{
  "id": "d1008-143",
  "text": "-6-\nleast three half-hour television programs (selected from the best\nof the above) for airing over both educational and commercial\ntelevision stations, as outstanding examples of \"The American\nWay of Life at Work.\"\nThe radio programs produced, and possibly the Television programs\nas well, after distribution over the NAEB Network, will be made\navailable for distribution in Europe, at least, through the\nInternational University of the Air, as stated above.\nEstimated Budget Required $70,000.00\nAdministrative Costs 3.500.00\nTotal $73,500.00\n2. (NAEB-Kellogg) Grants-in-Aid for (three) Series of In-School\nPrograms.\nThis area has been greatly, though undeservedly, neglected in the\nNAEB's previous prestige series, earlier prestige grants, for example,\nhaving been restricted to adult education emphasis. And nowhere is the\nneed greater. Two Seminars in this area (both Kellogg-financed) have\nrevealed, outlined, and suggested various projects requiring implemen¬\ntation, including one proposed Canadian-American exchange series and\none in the field of conservation. Outlines of these projects as devel¬\noped at the recent Seminar, will be available within the next few weeks.*\nQuoting from last year's request:\n\"These grants would be administered by NAEB, and would be made\navailable to educational institutions with radio stations or with\nradio program production centers. The grants, to be made upon\napplication, would be used by educational institutions to improve\na series which might need a 'lift* to bring it to NAEB Network\nquality.\"\nIn past experiences, the NAEB has discovered that this is one of\nthe most efficient methods of stimulating outstanding programs.\nGrants Proposed\n(up to maximum of $4,500 or $6,000 each,\nsubject to committee decision)\nCommittee Meeting, Travel and Promotion\nAdministrative Expense (5%)\nTotal Requested\n$18,000.00\n2,000.00\n1.000.00\n$ 21,000.00\n3. Repeatedly recommended by the NAEB Program Planning Committee is\na series of programs (thirty-nine had originally been visualized) on\nDiseases of the Nervous System and Psychosomatic Medicine, planned and\ndiscussed with the American Medical Association to cover the the most\nsignificant diseases (polio, cerebral palsy, psychiatric disorders,\naphasia etc.). Although a considerably larger sum would be needed fcr"
}