{
  "id": "d1008-148",
  "text": "fsn Dissectors of BABB\nFronu Tb® Research Coimaittoo^l^SS\nHBt Proposal for 195U New York TV Monitoring Study\nIt is proposed to conduct a fourth in the series of New York TV aaoitoring studies©\nISie plm/in this as in each of the studies# K>uld be to (1) obtain information\nconp arable to aid consistent with that derived from each of the preceding studies\non the amount of time devoted to TV prograsas of the several classes# together with\ninformation on the amount# kind and location during the week of advertising\nmaterial! aid (2) pioneer in the scientific exploration of some significant aspect\nof TV programming® In 1952 this exploratory work was on the measurement of the\namount-, means and context of acts of violence® In 1953& the siae^y obtained basic\ndata on the amount of violence for conparative purposes# bat in addition an ex®\nploratLon was conducted into the nature of stereotyping in indigenous TV dram\nprograms© It is proposed in X95U to explore a quite different area of T¥ program\npolicy 9 but one which seeaos overdue for analysis! namely# the manner in which\nwhat we have called * Public Issues* programs are handled© This mvdd entail an\nobjective analysis of how controversial issues are presented to the TV public# and\nwould include analysis of the extent to which TV undertake to deal with Public\nIssues# as well as the raore narrow question of how it handles those issues it\nchooses to present in some fashion©\nThis will be the fourth annual study of New York TV programs# using consistent\nand coup arable methods of analysis® The report on the third study which will be\npublished by summer# 1953© will disclose# as the preliminary release issued in.\nJanuary 1953 indicated., that major shifts are taking place in the kind and quantity\nof TV programming available to the public in the major program^originating city#\nHew Yorks Drama programs which in 1933 had amounted to 33 percent of all\nprogram time had risen in 1953 to h7 per cant© Sports programs in 1953 were only\nhalf as abundant# proportionately# as in 1951* Information md orientation pro®\ngrams have decreased while entertainment programs have increased# as proportions\nof total programing©\nIt is evident from the first three Mew York studies that the \"picture of the world*\nwhich is presented by TV programming has changed even in this short period of time©\nThese studies have provided essential berchmaric information for industry# educators#\nthe Federal government# and the public at large© They constitute a large-scale\nmap of the course of TV program development so that those who run may read®\nThe following table presents a budget for the next, year*\nSUBSET\n195U Hew York TV Monitoring Study\nField Work\nsaid equipment\nSpace\n$300\nTV set rental\n250\nOffice supplies and forms\n150\nTelephone and Telegraph\n75\nMiscellaneous\n75\n$850\nPersonnel\n““^ICTtors at $1©50 per hour\nSupervisors\nPhotographic service\n30715"
}