{
  "id": "d1008-155",
  "text": "420 THE QUARTERLY\nMerton believes that the value-conscious investigator as dis¬\ntinct from the value-free investigator would have framed his\nhypotheses differently in the beginning. He would have distin¬\nguished between the immediate results obtained from the more\nremote effects. He would have been concerned, for example, with\nhypotheses regarding the effects of acceptance of persuasive ap¬\npeals on the critical capacities of the recipients in general. He\nwould have desired to know the effects on the personality of\n“being subjected to virtual terrorization by advertisements which\nthreaten the individual with social ostracism” unless he uses a\nspecified product. This last is interesting in the light of the section\non “Fear-Arousing Appeals” in the book before us in which the\nprimary concern is with hypotheses regarding the effectiveness\nor ineffectiveness of certain types of “threat” appeals.\nIt would obviously be unfair to indict the present study for\nethical shortcomings which it shares (if we accept the orientation\nof Merton) with much, if not all, social science research in this\nfield. And the answer to these problems is certainly not a simple\none. We may not expect the social scientist to refuse to do re¬\nsearch on certain problems simply because the results of his\nstudies may be put to ethically indefensible uses—there may not\neven be agreement as to what is ethically defensible or inde¬\nfensible. But, if we are to be concerned with the effectiveness of\nthreat appeals in producing a desired action (strictly, of course,\nfrom the point of view of basic research), we should at the same\ntime endeavor to design research to test hypotheses regarding\nthe effects of threat appeals on personality structure. Communi¬\ncations research does not become immaculate merely because it\ndivorces itself from market-place considerations. Moral neutral¬\nity, perhaps unfortunately, is neither desirable or possible. With\nall its excellencies we should feel more comfortable about Com¬\nmunication and Persuasion if its authors, like Merton, had rec¬\nognized the “intimate interrelation of technique and morality.”"
}