{
  "id": "d1008-160",
  "text": "BIBLIOGRAPHY FOR THE QUARTER 425\nestablishment of an educational-television station and its equip¬\nment. The second part deals with TV-programming problems\nin the public schools, colleges, adult-education courses, and so on.\nPart three is devoted to writing and production techniques, and\nincludes a dozen or so TV scripts. The subjects of these scripts\nrange from Lunch-Time Gallery Talks (developed by the Memo¬\nrial Art Gallery of Rochester, New York) and Traveling with\nTunes (presented by the Baltimore Public Schools) to Greek\nTragedy (a script for a kinescope presentation by the University\nof North Carolina Communication Center). The appendices con¬\ntain an extensive bibliography of source material for educational-\nTV planning and programming as well as books and articles, a\nlisting of TV-equipment manufacturers, and, of course, a glossary\nof terms.\nAlthough the author’s picture of educational TV is somewhat\nroseate—one wryly recalls the picture presented in similar books\nabout the educational future of radio—she may be forgiven since\nthe book contains a vast amount of solid, usable material. It will\nbe indispensable to any person concerned professionally or non-\nprofessionally with educational TV.\n■0 o- -o\nTelevision Broadcasting by Howard A. Chinn (McGraw-Hill,\nNew York, 1953, $10.00) is a 700-page treatment of all the tech¬\nnical aspects of the subject. This is not to say that the author is\nconcerned with production techniques, directing, writing, and\nthe like. The book is intended primarily for technicians, who,\nas the dust cover hastens to explain, need have no mathe¬\nmatics beyond arithmetic to understand it. A sampling of the\nchapter headings reveals the book’s scope. These include\nTelevision-System Fundamentals, The Image-Orthicon Camera,\nField-Pickup Techniques, Studio-Television Equipment, Studio\nLighting, Television Projectors, Program-Transmission Systems,\nStudio-Building Planning, and Color-Television Broadcasting"
}