{
  "id": "d1008-180",
  "text": "2-2-2\nof these. The matter of professional stature (the “Bronson proposaltB) falls within\nthe province of this committee. The committee should suggest alternatives to the\nbasic proposals growing out of this meeting in case the preferred activity can not\nbe undertaken.\nWynn pointed out that this was the first time the whole committee had met and\nthat, while as many specific problems as possible should be settled, consideration\nshould also be given to some of the broader, long-range problems.\nSkornia reminded the committee that potential requests to the Ford Foundation\nwill have to be in form for Board action within a couple of weeks, otherwise announce¬\nments of summer workshops and scholarships (if the committee decides that such a\nprogram should be offered this summer) wouldnH get out in time. He asked the com¬\nmittee to consider the problem of whether or not only certain schools should be listed\nas ones which scholarship winners might attend, and reviewed the manner in which this\nhas been handled the past two years and the attendant problems. He also suggested\nthat the committee might desire a change in emphasis in the professional advancement\nprogram and that the committee should recommend possible changes in requests for grants.\nSchooley pointed out that, in his opinion, the Management Consultant service\n(Novik) did not fall within the realm of concern of this committee.\nWynn - After the committee has reviewed what has been done so far, the group may\nwant to consider specific matters first and later concern itself with generalities.\nWinnie - Raised the problem of one-year requests as opposed to a long-range plan\nwith requests to carry this out.\nSchooley - Committee should concern itself with both short and long-range and\ncome up with recommendations in both areas.\nWinnie - There is strength in making long-range plans and then specifying\nshort-range activities to carry out the long-range plan.\nSkornia - There are several areas in which workshops might be held; therefore,\nany report from the committee should indicate that the immediate recommendations are\njust a part of long-range plans. Radio and TV should be integrated in the planning."
}