{
  "id": "d1008-183",
  "text": "5-5-5\nSkoraia - This engineering seminar is related to the desire to start distributing\nhigh quality music on the NAEB Radio Network, The level of the Network canH be\nupgraded pastthe technical level of the stations carrying the programs.\nHill - Priority for seminars* workshops, etc,, recommended by the committee should\nbe established to guide the Board in its decisions.\nGeneral discussion of committee concern with priorities. Consensus was that the\ncommittee is concerned with, and should recommend priorities for, any type of pro¬\nfessional advancement, whether it be engineering, management, programming, etc.\nIn answer to a question, Skoraia and Hill explained the steps taken by the Head¬\nquarters staff to get educational stations to join the NAEB and to get more educational\nstations on the air.\nWynn - Should this committee make recommendations to the Membership Committee in\nthis area? This might be done on a regional basis and, when a regional meeting is\nheld, outsiders could be invited.\nRickard - On matter of regional meetings - smaller meetings than regional are\nneeded so that operational level staff members could go. Meetings should be held\nfor just 01® day and should be located so that no station representatives would have\nto drive over 100-150 miles. With meetings of this type more personnel could attend,\nWynn - Matter of inviting non-members to regional, or smaller, meetings will\nbe passed on to Membership Committee and Board for their consideration and recommen¬\ndations.\nAdkins - A joint radio-TV seminar will never actually materialize unless careful\nplanning 3s done to insure that radio is given its just share of emphasis,\nSkoraia - Need to build up such a seminar on the basis of integration of the two\nmedia.\nRickard - We need to realize that the NAEB should be actively involved at all\ntime in radio and TV, and in fact in all mass media, and should consider both when a\nproblem arises and consider which medium might do the better job in a specific case."
}