{
  "id": "d1008-187",
  "text": "9-9-9\nSkomia - Disagreed, Felt that scholarships are important in that they get the\nname of NAEB into the general framework of education.\nGarrison - Should consider, at least in the next year, the immediate, rather\nthan the long-range, problem. Consider giving grants to specific people for\nspecific study projects to bring about upgrading in specific areas of need. Those\npersons could get an intensive education in their area and then pass the benefits on\nto their staffs. Each station could be given a choice of the area in which they wish\nto nominate a scholar.\nSub-committees\nWynn appointed sub-committees as follows to meet immediately after lunch to\nconsider problems in the specific areas and bring back recommendations to the\nwhole committee. Seminars - Rickard, Skornia, Adkins. Workshops - Winnie, Browne,\nBidlack, Hill. Scholarships - Garrison, Wynn, Martin, Head.\nReport of Scholarship Sub-Committee (Garrison)\nRecommends the following four scholarship activities in order of priority:\nSpecial Study Grants - To start in the summer of 1956. Fundsto be provided for\ntravel and maintenance ($10 a day, plus travel), for a period of up to two weeks, to\nallow scholar to go to place of his choice for intensive study. Only full-time staff\nmembers of active radio and TV stations or productions centers would be eligible for\ngrants. Applicant must be recommended by the director of his station or production\ncenter. Not confined to the summer, but a yoar-around program. A five-year plan, to\nbe reviewed at the end of two years.\nSpecialists in Residence - A specialist in a specific skills area (writing,\nlighting, programming, management, etc.) of highest caliber to spend a period of time\nat an institution, engaging in his professional capacity while there. He would review\nwhat the institution was doing in his field, recommend improvements, train staff mem¬\nbers in his speciality, etc. This visit might be at any time during the year."
}