{
  "id": "d1008-190",
  "text": "12-12-12\nAfter general discussion of needs, the following areas for workshops were added\nto the two recommended by the sub-committee (Writing and Kinescope-Lighting)s Writing\nfor Radio, Graphics and Staging, Film, Advanced TV Production, and Radio Program Develop¬\nment, All of these workshops would run from five to seven days.\nTrough general agreement the committee recommended that funds should be sought\nto hire a Director of Professional Advancement (and necessary staff) to expedite and\nspeed-up the whole program of professional advancement and to carry out the plans.\nHill suggested that the committee might want to consider recommending that an\ninterim grant be requested so that professional advancement activities might be carried\non this summer while plans far the long-range program can be better formulated and\nfunds requested,\nWynn - Summarized the thinking on workshops. We must \"think big** and with a long-\nrange viewpoint in terms of extensive and intensive training, involving a Director of\nProfessional Advancement, The program of professional advancement must be such as to\nreally give educational radio and TV a ^shot in the arm,\" through the plans discussed\nabove. The workshops might be given over a cycle in different parts of the country.\nMust also consider an interim request, and what this should be for. Consensus favored\ninterim request to provide for the Kine-Lighting and Writing Workshops. (This in\n6\naddition to the needs for funds for Special Study Grants and Specialists in Residence\nprograms, both of which should start in 1956.)\nReport of SeninaraJfab-Conralttee (Rickard)\nAt committee's request Skoraia had contacted Coleman who reported that he did\nnot at this time wish to request funds for a research seminar pending action on\nearlier recommendations requiring funds.\nSub-committee recommended that the approximately $6,000 in Kellogg funds (available\nfor a seminar) be used for a radio engineering seminar. The sub-committee endorsed the\nidea of the cooperation with a possible architectural short course, as outlined\nearlier by Schooley."
}