{
  "id": "d1008-218",
  "text": "Mr. Harry J. Skornia\nPage 2\nFebruary 23, 1956\nWe further understand that you desire to begin your new program on July 1,\n1956, and that your first fiscal year will extend from July 1, 1956 to\nJune 30, 1957*\nIf the terms listed below are acceptable to your Association and to the\nUniversity of Illinois, this Foundation will make available to the Univer¬\nsity of Illinois as the fiscal agent of the NAEB $141,000 as a three-year\ncommitment for the conduct of this proposed program:\n1. The funds for this project shall be deposited in a special\naccount and at the close of each fiscal year an official\nfinancial statement signed by the University’s chief disburs¬\ning officer will be submitted to the Foundation in respect to\ndisbursements made.\n2. Subsequent payments under this commitment will be contingent\nupon evidence of satisfactory progress in the program and\nupon receipt and approval by the Foundation of the projected\nplans and budget for the next fiscal year.\n3. At the close of each fiscal year a written report will be\nsubmitted to the Foundation concerning the activities and\nthe developments that have occurred.\n4. Any unexpended balance existing at the close of a fiscal year\nwill be deducted from the payment for the next fiscal year.\n5. If at the end of the commitment there remains any unexpended\nfunds, or if the program is terminated at any other time, any\nunexpended cash balance is to be returned to the Foundation.\n6. Any anticipated changes in the itemized budget submitted should\nbe made in writing and submitted to the Foundation for approval\nprior to expenditure.\n7. Any salary increases or contributions to retirement plans above\nthose planned in the budget which is submitted with this agree¬\nment are to be provided by the Association unless approved in\nadvance by the Foundation.\n8. The Foundation would prefer that no publicity be given the commit¬\nment at the present stage. Only occasionally does the Foundation\nitself announce a commitment and then only when a transfer of\nfunds has taken place. At the time the first payment is made to\nyou, the transmittal letter will contain a statement explaining\nthe Foundation’s policy concerning publicity for its commitments.\n9. At the close of the second fiscal year of this project a special\nreport will be submitted to the Foundation containing the recommen¬\ndations of the Association's special committee which has been organ¬\nized for the purpose of studying ways and means for stable and per¬\nmanent support of its operational program. The Association should\nnot anticipate continued support of its operational budget by this\nFoundation after the expiration of this commitment."
}