{
  "id": "d1008-222",
  "text": "2.\nexpense connected with this service other than mailing costs and it is suggested that\ntest tapes be submitted from each machine used, immediately before the master tapes\nare recorded* If the recording of masters runs for a period of weeks or months,\ntest tapes should be submitted at intervals of about two weeks depending on the number\nof hours the recorder is in use. This service need not be limited to those who submit\nmaster tapes for duplication but is also available to those who wish to keep their\nrecording equipment in first class condition., The committee feels that this testing\nprogram probably should not be mandatory, at first, for obvious reasons, but as its\nadvantages become apparent, perhaps in the future it might become a required procedure\nwhenever master tapes are submitted for duplication. It is planned to make three copies\nof the evaluation report on each test. One will be kept for this committee, another will\nbe forwarded to NAEB Headquarters, and a third will be returned with the test tape.\nAfter the testing program is underway it will be possible to set up standards for tape\nnetwork recording. It may then be desirable to require that all master recordings meet\nthese standards before acceptance. Mr. Kratt has agreed to handle the tape testing\nprogram and to set up standards for committee approval.\nThe second step, that of duplication of tapes, is one that must be taken care of by\nHeadquarters. It consists of putting the duplicators in first class condition and\norganizing a maintenance program which will keep them that way. Mr. Bidlack has\ndifficulty in finding time to do this work and apparently maintenance has not been\nsatisfactory in the past. The committee was told that steps were being taken to correct\nthis. However, it feels that this work is extremely important and that high quality\nservice will never be possible unless duplicators are kept in top condition.\nIf the two steps outlined above are followed, so far as recording equipment is concern**,\nit will mean that NAEB can supply member stations with high quality recordings.\nAny degraded quality will then be the result of poorly adjusted playback equipment\nor poor pick-up and production techniques. The former can be corrected only by the\nstation using the tapes. The latter may respond to some correction when the tapes\nare dubbed from the original master to the duplicator master at Headquarters. By\nthe use of a variable equalizer during this dubbing process, an experienced operator\nmay be able to effect some improvement. It is recommended, however, that efforts\nfirst be concentrated on securing good original masters and producing good duplications\nA sub-committee of Bidlack, Brugger and Kratt will make a study and report of\nequipment needs at Headquarters.\n2 Tape network quality improvement. 15 in. per sec.?; The committee feels that where\npossible it would be desirable for master tapes to be recorded at 15 in. per sec.\nHowever, at this time recording at 7 1/2 In. per sec. can provide adequate quality for\nmost uses If steps are taken as outlined in (1) above. If such corrective measures are\nnot employed, poor quality will result at 15 in. per sec. as well as at 7 1/2 in per sec\nFurther, the Headquarters duplicators are not equipped to handle the ten inch reels and\nthere is some question as to playback equipment in member stations. The committee\nsuggests that the present situation be first corrected and later experiments might be\nstarted with special programs recorded at 15 in. per sec.\n3. Review of NAEB Engineering Workshops. Future plans: A discussion of past NAEB\nengineering workshops and a review of letters from participants indicated that the 1955\nmeeting at East Lansing was, in general, highly successful. Besides supplying up-to-\ndate knowledge and training, the workshop provided opportunity for discussion among\ntechnical representatives of educational television which has not been possible in the\npast. Of equal importance, it pointed out that NAEB does provide a much needed service\nto technical people as well as to programming and management. It was unanimously\nagreed that these meetings should continue if funds can be obtained and that perhaps\nthey should take the form of a conference rather than that of a workshop* It was pointed"
}