{
  "id": "d1008-223",
  "text": "3,\nout that most educational television technical problems at the various installations\nare similar in nature and that much can be done by having engineers gather together\nand discuss methods of solving them. This being true, attendance should be limited\nto twenty or thirty who are key people in the various TV stations and studios,. The cost\nwould.be no more than that of past workshops. The committee urges that efforts be\nmade to secure funds for such a technical conference in 1956. It might be advantageous\nto hold a conference in connection with either the annuallARTB meeting or the annual\nNAEB convention. This however* depends on when and if funds are available\nIt was indicated by Mr Skornia that a sum of around $3000.00 might be available\nimmediately for a conference or seminar of a technical nature. In this connection\ntwo suggestions are presented: First* there is need for a conference or seminar of\ntechnical personnel from the NAEB stations who are operating the smaller AM or FM\nequipment. It was pointed out that such stations usually employ engineers who lack\nexperience and knowledge and have very little opportunity to acquire it. Due to lack\nof funds their operation often suffers. This is especially true in the case of recording\nequipment owned by small operators who use the NAEB tape network offerings,\nNAEB could provide a valuable service to the smaller members by such a seminar or\nconference. It could be organized so as to limit attendance to the extent of the $3000.00\navailable or increase attendance and require that those who come defray a portion of\ntheir expenses. The committee recommends the former, as those who most need the\nexperience and training are usually those who cannot afford to attend.\nSecond, there is need for a conference or seminar of kinescope operators Much can be\ngained by a conference to discuss mutual problems and to present the use of new\ndevelopments in film, processing* and equipment. There is no organized exchange of\nsuch material. The cost of such a conference to include all those operating kinescopes\nmight exceed the $3000,00 available. However* it would seem that the Educational\nTelevision and Radio Center might consider it of enough value to its operations to assist\nin some financial way. With this in mind a letter has been sent to President Newburn\ninquiring as to his interest. As soon as this information is at hand* recommendations\nwill be made.\n4. Video recording. Work with Center. A study of kinescope recording costs was made\nby this committee for the Educational Television and Radio Center and a copy is on\nfile at Headquarters. In planning its activities, especially those concerning video\nrecording, the committee hopes to work closely with the Center. See (3) above.\nThis committee considered the possibility cf setting up standards for video recording\nbut due to the considerable time required as well as various other complications* it was\ndecided to postpone this project and to see what might be done toward publishing a\ntechnical handbook for operators of video recorders. This handbook would contain all\npresently available information and additional material could be added from time to\ntime. It was learned that Mr. DeLand of the Center staff had a video recording handbook\nin preparation and about to be published. Not knowing its contents, it was decided to\npostpone work on this project until we could be sure there was no duplication of effort.\nInquiry has been made of the Center as to the above.\n5. NAEB radio network. AM, FMt Microwave* Wire Lines* Multiplex.\nThe committee recognizes the advantages of a live mutual network to supply NAEB\nradio stations with programming material..A study has been going on for some time to\ndetermine its practicability. Thus far no scheme has been presented which would\ninvolve a reasonable cost. Work will continue however, and there does seem to be some\nreason to believe that at least a small regional network might be arranged, at least on\nan experimental basis, and at a cost which is not prohibitive."
}