{
  "id": "d1008-234",
  "text": "Kadao Program FlanMng —* 6\n(2) Healthy or more specifically souse phase of it* Much is being\ndone .in 'Sh,i*i field, © the series would require much res a arc!, aid thought in\nortizr to avoid being nothing« We suggest 10 to 13 progans ulth flexible length\n•a?.d foamat^ again to b® left to prodixcsrso\nThs coitent must b© dethmined by ai da people as Meaning e:\\ Grinkor. Brason,\n(3) fieriatfefces, sane phase or phases of it5 to be worked cit along liner\npr©viousOy preparecTby Skarrda. Thj committee felt that tie woiV already don© or.,\nthis should be utilized* &coe detail is available, but much. more vould be needed©\nliters mentioned were Leo Bostin, Erik Barnorw, and Morton Wisheicrad,\nIn this reconmendafcicK. the committee is unhappily aware that it has net\nbeen as specific as requested by President School^ on the matters o / writers,\nproducers3 production wait** budgets, source material5 consultants, a:id secondary\nuses* Sorry, but one day wcn*t do it> We hare tried to bail down all' ideas\nto threes now w© can move shcad with these details after sufficient exMoratory\nwuric has been don© by peopi with past psperienc© in hiring pnoducers, f It\n-■s reccrammded that throe steps bo taken by headquarters at cnee?\n(1) dedde whether ttese ideas, or on® of them, can be used fa* ^^ies\n(2) farm out to experienced individuals Ihe Jobs of Unding out v?ho i:n\nexptsrts are in 1he©o field r, good producing agencies and what they cost, gcx!\nwritexs available, possiHL« secondary uses, and the other things we need to mow\n(3) channel ties© reports through me and the committee or through sea eon*\nat hsadquarters for sifting, out and condensing for presentation -bo the barter/\nIt is possible that the Center does not need so much detail5 its personnel, is\nequipped to determine many of these tilings with little effort* • If this As true,\nperhaps we have enough in this report to start the Center out on a aerie 1*\nOther recommendations:\nThe ooiasdttee felt that Holt’s comments on an integrated effort by\nvarious committees ©nearnet with programming were well made., and so recommend\nthat Schooley stxxtiy the possibility of an integration between Prograa Plac ing,\nAcceptance, Grants, School, Engineering, International, and Pujalic ReLatLonv-, ‘\nNo details for this merges* aie suggested*\nThe conmittee further r eccnuncads that every offert be mad© by headqmrtiv's\nthrough the- Newsletter to encourage member stations to si&eIu programs for th®\nnet^ without waiting for grants or far seme one 'bo discover their light under the\nfirkin* We siould emphasise to the membership that acceptance of a program is\nreally a more significant SK&rd than many of these we try f or each yearo Of bourse,\ngrants flhoiM bo given for outstanding potential productions;, but a cm modest\nom& .may be top netmk quality without any outside financial help*\nM) coraaittee is not on record as a group on this idea., bub SboroLa pro-\nposss that the net issue a .'wangle general padcage, including school programs,\nat some 15 nours per week o: whidi the membcirs would select shout 10 hou rs\nsepLaS^it! ***** medStt m* mind eliEdaate the in-school package as a"
}