{
  "id": "d1008-255",
  "text": "to representations in Washington to preserve frequencies for education* The\ncouncil continues its liaison function with constituent members (of which the\nNAEB, its original parent, is one# being represented on the JCET Board by President\nSchooley)* At the same time its functions have been expanded to insure inclusion\nof radio as well as television in its orbit of interest where it provides\nWashington support to the NAEB and the ETRC.\nThe Television Committee of the American Council on Education, the fourth of\nthe agencies earlier mentioned, remains essentially as it was — an ACE Committee\nseeking to promote increased usage of and solid educational standards for edu¬\ncational television through ACE member channels* In this capacity it issues an\nETV Newsletter periodically for ACE members, and sponsors occasional conferences\nof administrative educators on problems concerned with the development of tele¬\nvision as a teaching tool* The President of the Council is an extremely active\nand articulate supporter of educational broadcasting*\nThe fifth group, the Association for Education by Radio and Television, has\npetitioned the NAEB for a merger of organizations. Subject to the working out of\na feu further details it appears that qualified AERT members will be taken into\nthe NAEB as individual members, increasing the professional association responsi¬\nbilities of the NAEB, and providing a large pool of school utilization resources.\nAn additional NAEB Board member will be added, to represent this type of member.\nSteps have already been taken for the NAEB to take over publication of the AERT\nJournalf with a gradual change of name to correspond to its position as an NAEB\nnational magazine publication* The next issues of this magazine will be published\nin Urbana-Champaign, as the first steps in this merger* This will simplify the\ncomplexity of organizations recently active in the area of educational broad¬\ncasting*\nOut of this re-organization of agencies, the NAE3 has emerged as the unified\nand sole membership association of institutions, stations, and individuals active\nin education via radio and television* It has considerably clarified both the\nsituation extant at the time of our last annual report (and even at the time of\nour request) and the increasingly important role of the NAEB in the nation, as\nwill be more fully explained below.\nIn addition tc relations with the above organizations, and the total edu¬\ncational broadcasting movement, the representation of the NAEB in other organ¬\nizations and activities has greatly increased during the past year, in the U. S.\nand international circles.\nIn the national education movement requests for NAEB representation have been\nparticularly great. In an effort to insure adequate liaison with other education¬\nal associations as well as commercial broadcasters, the NAEB Organizational Liaison\nCommittee has this year been expanded again and two meetings of this committee\nhave taken place. Most recent additions include the National Association of Radio\nand Television Broadcasters, the American Council for Better Broadcasts, the\nNational Association for Better Radio and Television, and the Association for\nProfessional Broadcasting Education, a group devoted to increasing standards for\ncollege courses in radio and television."
}