{
  "id": "d1008-260",
  "text": "This problem is receiving the attention of the Association, however, A dues\nrevision proposal, moving in this direction, is to be presented to our next Annual\nConvention in Atlanta, October 16-18, It is also the subject of the study which\nwill be reported on by the Special Committee, whose report and recommendations on\nthis specific problem will be presented to the Foundation in accordance with the\nterms of the current three-year grant.\nWithin the area of services provided to members, the NAEB serves a three¬\nfold function: it is the \"trade\" association of station owners and operators; it\nis the \"professional\" association of individuals, engaged in educational broad¬\ncasting, a role now being expanded in view of the organizational merger described\nabove; and it is also the \"mutual\", i.e. member-owned and financed network, for\nradio.\nIn its first role it provides legal, research, engineering, management and\noperational consultation services and materials, and operates the nation1s central\nemployment office for educational radio and television. In this capacity it also\norganizes and conducts Seminars, Regional Meetings, and Committee activities as\nlisted in appendices of this report.\nAs the Professional Association it maintains close liaison with other member-\nship-based professional associations, to many of which it provides consultation\nservices similar to those provided to the NPAC, when such organizations desire\nassistance in radio or TV problems. In this capacity the NAEB also conducts\nscholarship programs, workshops and other activities intended to raise the quality\nas educators of educational station personnel and NAEB membership generally.\nFinally, as the nation*s only educational radio network, the NAEB provides\nmembers, and other stations and organizations when possible, with both classroom-\nintegrated and adult education features which would not otherwise be available.\nIn cooperation with the Educational Television and Radio Center, whose\nprimary outlets are NAEB stations, it provides assistance in the operation of the\nnation’s educational television network in the same type of programs.\nIn all three of these areas, the need for services is increasing. It is our\nbelief that, as a result of those services which we are already able to provide,\nthe health of education generally, as well as that of educational broadcasting,\nis improving. Eventually this greater vigor will be reflected in increased\nbudgets and memberships, and a greater ability on the part of the members to\nsupport their own association adequately with a decreasing amount of outside\nsupport. Unfortunately this process can not be too accelerated, for reasons\nmentioned above.\nCommittee Activities:\nOne of the long-term strengths of the NAEB, as compared to other organizations\noperated more entirely as staff groups, is the amount of work done each year by\nits officers, board and committee members, all of whom serve without reimbursement."
}