{
  "id": "d1008-277",
  "text": "copy\nSent for the information of\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 GREGORY HALL\nURBANA, ILLINOIS\nJuly 25, 1956\nDr, Maurice F, Seay, Director\nDivision of Education\nW. K. Kellogg Foundation\nBattle Creek, Michigan\nDear Maurices\nIn Frank* s absence on a trip east, which he is combining with a few days\nof deserved vacation with his family in Virginia, I hasten to acknowledge\nyour letter to him of July 17, 1956,\nFirst I should like to explain the basis of salary computations behind the\nfigures submitted in our request. We first prepared tables in column form,\nindicating a progression of salaries over a five-year (later revised to a\nthree-year) period. Since we are in effect the staff of our members, our\nBoard makes sure that these figures are not out of line, for functions per¬\nformed, with those paid by member institutions. And since we are administered\nthrough University of Illinois personnel channels, these salaries must also\nbe in line with salaries paid here. As a result salaries are generally\nconsiderably more modest than those paid coj^arable people in the JCET, at\nthe Center, and at other such organizations, particularly for the top\npositions.\nThe basis of coxipitation, therefore, as shown in the table below, provides\nfor an approximately annual increase for the Executive and Associate\nDirectors, and the usual University scale for stenographic and secretarial\nhelp. However, in view of the high rate of turnover of secretarial help in\na campus location where most available personnel is student wives, we re¬\nquested somewhat less than the tables show us requiring, since we felt\nthat replacements generally would not be started at as high a figure as an\nincumbent would receive if she were to stay for the full period. We there¬\nfore felt safe in requesting somewhat less than the tabular (University-\nbased) scale, with the thought that this turnover, on the basis of past\nexperience, would save us this sum, and that we could absorb this annual\ndeficit in some manner, if our predictions turn out to be wrong.\nIn essence, then, our request is slightly higher than will be expended for\nthe first year* and it anticipates using carry-over or reserves accumulated\nfrom the first year for the third year*s % increases. If there is any\nsaving on personnel costs, beyond this reserve carry-over, which was designed\nto give us an average three-year budget, these fundjswill of course be re¬\nturned."
}