{
  "id": "d1008-278",
  "text": "Dr, Maurice F. Seay\n-2-\nJuly 25, 1956\nWe would hope that this procedure will be satisfactory to you and deserving\nof approval. If you feel that this approach, which resulted in a request\nfor the same amount each year, should be modified to decrease the first\nyear»s grant and raise the third year*s, still within the $11*1,000.00\ntotal, this cany-over reserve figure ($778.58) could be subtracted from\nour first year* s payment and added to our third year*s payment. Our belief,\nhowever, had been that you might prefer the simpler procedure, here out¬\nlined, which would involve carry-over of this small reserve to accomplish\nthe three-year salary base on which the request was computed. Here is the\ntable showing the breakdown.\nProposed Salaiy Scale - 1956-1959\n1956-57\n1957-58\n1958-59\nApproved in\nKellogg Grant\nExec. Dir.\nAssoc. Dir.\nSecretary\nSteno.\nMisc, Labor\n$T6,bo6.6o\n8,1*00.00\n3,600.00\n2,700.00\n1,000.00\n$H,i*o6.6o\n8,800.00\n3,720.00\n2,820.00\n1,000.00\n$12,600.66\n9,200.00\n3,81*0.00\n2,91*0.00\n1,000.00\n$ii,73o.66\n9,000.00\n3,972.00\n2,781*. 00\n1,000.00\nSub-Total\nW.C. (1.556)\nRetirement «■\n26,566.00\n397.50\n2,073.92\n2?,7i*6.oo\n1*16.10\n2,21*7.96\n-28,?8o.'66.\n1*31*. 70\n2,275.61\n2H,UH6.00\n1*27.29\n2,11*1.16\nf35p*i>I*766\nT5T,690.3l '\n($3i,05l*.l*5)\n* At the time of the request this contribution was 1*19%, It has since\nbeen raised by the University Board of Trustees to 8.133$.\n3 Year Total - $91,065.79\nYearly Average - $30,355*26\nAnnual Request - $29,750.00\nYearly Average Excess of scheduled salaries over Kellogg Grant - $605.26\nUnfortunately the departure of graduating students has left us with a\ncompletely depleted secretarial staff, for which replacements are gradually\nbeing found. Our annual report to you is, however, in preparation and will\nbe sent you as soon as the information for a final fiscal report can be\nsecured from the University Accounting office. It always requires at least\na month to get these year end reports to us after the close of the fiscal\nyear, June 30. The check on this grant, as in the past, is to be made\npayable to the University of Illinois; it can be forwarded either directly\nto President Henry or NAEB President Frank Schooley.\nI am leaving Frank a note to call this to his attention on his return, on\nor about August 3. If he has any corrections or additional comments,i*m"
}