{
  "id": "d1008-39",
  "text": "PROPOSAL FOR 1954 MEW YORK TV MONITORING STUDY\nAuspices of the National Association of Educational Broadcasters\nIt is proposed to conduct a fourth in the series of New York\nTV monitoring studies* The study is conducted under the\natispices of the National Association of. Educational Broadcasters\nunder a grant from the Fund for Mult Education of the Ford\nFoundation*\nThe plan, in this as in each of the three preceding studies,\nwould be to?\nlo obtain information comparable to and cinsistent\nwith that derived from each of the preceding\nstudies on the amount of time devoted to TV\nprograms of the several classes, together with\nthe amount, kind and location during the week\nof advertising materials*\n2* pioneer in the scientific exploration of some\nsignificant aspects of TV programming* In\n1952 this exploratory work was on the measure-\nment of the amount9 means and context of\nviolence* In 19539 the study obtained basic\ndata on violence for comparative purposes\nbut in addition an exploration was conducted\ninto the nature of stereotyping in indigenous\nTV drama programs* It is proposed in 1954\nto explore a quite different area of TV\nprogram nolicy, namely the manner in which\nwhat we have called t?Public Issues” programs\nare handled* This would entail an objective\nanalysis of the extend to which TV undertakes\nto deal with Public Issues, as well as the\nmore narrow question of how it handles those\nissues it chooses to present in some fashion*\nThe methods used for this study will be consistent with the\nearlier studies and cn mpnrable methods of analysis will be\nemployed*\nThe dates for the 1954 study will be the entire week of\nJanuary 3-10, (comparable to the dates used in preceding\nstud!es,)\nData wi 11 be compiled and evaluated in sufficient time to\npermit publication of the completed study by May 15, 1954*\nIt is evident from the first three New York studies that the\n”picture of the world” which is presented by TV programming\nhas changed even in. this short period of time0 The 1953"
}