{
  "id": "d1008-60",
  "text": "Audit Report\nN.A.E.B. Broadcast Revolving and\nKellogg Foundation-Tape Network\nJune 30, 1951 to January 31, 1955\nGeneral\nA grant from the Kellogg Foundation amounting to $245 350, payable\nin five annual installments, was accepted by the President of the\nUniversity on May 28, 1951 and his actions were confirmed by the\nBoard of Trustees at their meeting held on June 13* 1951. Subse¬\nquent commitments have increased the original grant to $286 093.\nThe purpose of the grant was primarily to provide funds to establish\na program which would give the impetus needed to strengthen and pro¬\nmote the general improvement of educational radio and television\nbroadcasting. The receipt and disbursement of the funds are record¬\ned in the account \"Kellogg Foundation-Tape Network.\"\nThe basic operating costs of the National Association of Education¬\nal Broadcasters (N.A.E.B.) Radio (Tape) Network (a part of the\nKellogg project) are being assumed by member stations of the N.A.\nE.B. on a gradual plan over a five year period. Assessments to\nthese member stations, and other income from the sale of tapes,\npublications, and services derived as a result of the project are\nrecorded in the N.A.E.B. Broadcast Revolving account which was\nauthorized and established in October, 1951. This income is used\nfor general network expenses and supposedly will be sufficient at\nthe end of five years to continue the basic operations of the proj¬\nect.\nScope of Audit\nThe N.A.E.B. Broadcast Revolving and the Trust Kellogg Foundation-\nTape Network accounts were examined from the date of the first post¬\ning entry on June 30, 1951 through January 31, 1955.\nAll receipts and expenditures for the N.A.E.B. Broadcast Revolving\naccount were scrutinized and Equipment charges were traced to in¬\nventory records. A summary of the activity is shown in Exhibit A\nattached. The total credits and expenditures posted to the Kel¬\nlogg Foundation-Tape Network account were summarized and the re¬\nsults shown in Exhibit B attached.\nThe relationship between N.A.E.B. Broadcast Revolving and the\nKellogg Foundation-Tape Network accounts was ascertained. The\noriginal proposal to the Kellogg Foundation and the conditions in\na subsequent agreement were reviewed.\nThe allowable charges for overhead payable from the Trust Kellogg\nFoundation-Tape Network account were computed and traced to the\nactual charges made by the Accounting Division. The entries for\nthe transfer of funds from the N.A.E.B. Broadcast Revolving ac¬\ncount to the Kellogg Foundation-Tape Network account were examined."
}