{
  "id": "d1008-61",
  "text": "N.A.E.B. Broadcast Revolving\nPage Two\nComments\n1) Through January 31, 1955 the Kellogg Foundation had remitted\nthe total of $243 350 to the University, leaving a commitment bal¬\nance of $42 743, which is scheduled to be used in the fifth year\nof the project beginning July 1, 1955. Because of an error made\nin 1952, net credits posted by the Business Office were $102 less\nthan the actual amount received. The adjustment was automatically\nmade later when N.A.E.B. Broadcast Revolving, the other account\ninvolved, absorbed all overdrafts in the trust account.\nAt January 31, 1955, net expenditures charged to the account a-\nmounted to $228 571 82, leaving an unexpended balance of $14 676 18.\nThese expenditures are exclusive of the $23 214 90 which was orig¬\ninally charged to the Kellogg Foundation-Tape Network account but\nlater transferred to N.A.E.B. Broadcast Revolving to alleviate over¬\ndrafts in the former account.\nThe total N.A.E.B. Broadcast Revolving income since the account was\nestablished in October, 1951 amounted to $73 870 8l. Approximately\n$32,000 of this income was received after July 1, 1954. Expendi¬\ntures, Including the $23 214 90 transferred from the Kellogg Founda¬\ntion-Tape Network account totaled $43 675 54, leaving a balance of\n$30 195 27 in the account at January 31, 1955.\n2) The Kellogg Foundation-Tape Network account has been classified\nas a current restricted fund while the N.A.E.B. Broadcast Revolv¬\ning account is in current general funds. Expenditures from the two\naccounts appear to be for the same basic purposes.\nMembers of the department are of the opinion that the revolving\nfunds are not University funds but belong to the National Associ¬\nation of Educational Broadcasters. If the revolving funds are\nnot University funds, and if the unexpended balance could not be\nlapsed into general University income if the program were discon¬\ntinued, then this account probably should be carried as an agency\naccount. Furthermore, if this is an agency account, perhaps the\nUniversity should consider assessing a service or overhead charge\nsimilar to that charged student organizations or various trust\naccounts.\nThe entire question may be of minor importance at the present\ntime, however, we believe the status of the N.A.E.B. Broadcast\nRevolving account should be clarified immediately to prevent the\npossibility of future misunderstanding as to the ownership of\nboth the funds and equipment inventory.\n3) In addition to tracing equipment charges to the inventory rec¬\nords, equipment was traced from the inventory records to the orig¬\ninal charges. Our findings are commented on below.\nA transfer of equipment frequently does not involve an exchange\nof cash. The transfer is handled by the inventory section of the"
}