{
  "id": "d1008-69",
  "text": "Dr, Harry Skomia\nNational Association of Educational\nBroadcasters\nPURDUE OPINION PANEL\ns*'\"-'\" Purdue University\nDivision of Education Reference\nLafayette* Indiana\nJune 2, 1954\nC\n0\nGregory Hal i. - - \\\nUniversity of Illinois\nUrbana* Illinois\nDear Dra Siornia*\nDr Pe mere will be away for a short time. Since you are probably anxious\nto have the highlights from the 1954 study as soon as possible* X have taken the\nliberty of preparing a brief summary for you\nI hcpe the enclosed material Is what you had in mind, I tried to select\nfindings that will make the most interesting reading when rewritten for the press*\nand I kevt the discussion ('airly brief — l trust not too brief\nIf there is anything I can add* or if other assistance can be given in Dr,\nRemitters' absence* please feel free to call on me\nSincerely,\n/s/ Robert Main<\nRobert Mainer\nA Summary of the 1954 Study\nof New York Television\nAn analysis of a co plete week of metropolitan New York's commercial television\nhas been mad© by the Purdue Opinion Pane for the Ni ionaJ Association of Educational\nBread casters. This study* the fourth In an annual series begun in 1951 by the NAEB*\nwas concerned with the content of television programs monitored bet aen January 25\nari 31 by the Purdue Opinion Panel,\nMore than 662 hours of television were viewed by monitoring teams during\nhe study week. Some of the resulting facts confirm findings from previous years*\n/hile others bring new TV trends to light. Entertainment continues to make up the\nbulk of TV programs wrth 77*. 7 per cent of all air time . Among entertainment pro¬\ngrams* drama alone accounts for more than 46 per cent of all broadcast time. Some\nslight changes in programming practices have been found A larger proportion of\nair time is given to comedy drama and less to crime and domestic or \"soap opera\"\ndrama. General information programs covering such to ics as cooking* arts* crafts\nand 5>imilar topics are on the decrease In general* however* the analysts conclude\nthat programming practises in commercial New York television have stabilized,\nThey point out that many of the changes in proportions of program time devoted tu\nvarious types of material Are a result of increased broadcasting activities by"
}