{
  "id": "d1008-82",
  "text": "Mr* Harry J. Skornia\nPage 2\nFebruary 23, 1956\n1. The funds for this project shall be deposited in a special account and at the\nclose of each fiscal year an official financial statement signed by the University’\nchief disbursing officer will be submitted to the Foundation in respect to dis¬\nbursements made.\n2. Subsequent payments under this commitment will be contingent upon evidence of\nsatisfactory progress in the program and upon receipt and approval by the\nFoundation of the projected plans and budget for the next fiscal year.\n3- At the close of each fiscal year a written report will be submitted to the\nFoundation concerning the activities and the developments that have occurred.\n4. Any unexpended balance existing at the close of a fiscal year will be deducted\nfrom the payment for the next fiscal year.\n5. If at the end of the commitment there remains any unexpended funds, or if the\nprogram is terminated at any other time, any unexpended cash balance is to be\nreturned to the Foundation.\n6. Any anticipated changes in the itemised budget submitted should be made in\nwriting and submitted to the Foundation for approval prior to expenditure.\n7. Any salary increases or contributions to retirement plans above those planned\nin the budget which is submitted with this agreement are to be provided by the\nAssociation unless approved in advance by the Foundation.\n8. The Foundation would prefer that no publicity be given the commitment at the\npresent stage. Only occasionally does the Foundation itself announce a coueait-\nment and then only when a transfer of funds has taken place. At the time the\nfirst payment is made to you, the transmittal letter will contain a statement\nexplaining the Foundations policy concerning publicity for its ccmmitments.\n9. At the close of the second fiscal year of this project a special report will be\nsubmitted to the Foundation containing the recommendations of the Association’s\nspecial committee which has been organized for the purpose of studying ways and\nmeans for stable and permanent support of its operational program. The Associa¬\ntion should not anticipate continued support of its operational budget ty this\nFoundation after the expiration of the commitment.\n10. In case of a national emergency the Foundation reserves the right to review the\nprogram and negotiate with the Association as to modification or termination of\nthe program in view of the national situation.\nUpon acceptance of these conditions by Mr. Frank Schooley, President cf your Associa¬\ntion and by Dr. David Henry, President of the University of Illinois, the Foundation\nwill schedule for payment in July of 1956 $47,000 as payment for the first fiscal\nyear of the program. Please instruct us as to whom the check is to be made payable.\nAs we review your program for the past five years we are pleased to note the descrip¬\ntion of results obtained. We congratulate you and the officers of your Association"
}