{
  "id": "d1308-1",
  "text": "Requests for Federal assistance for the expansion of existing stations range\nwidely from $15,000 to $500,000, and it is difficult to predict the average amount to be\nrequested in the future. The range for new stations is understandably narrower and the\naverage grant award continues to remain very close to the average of $175,000 upon which\nestimates have been based since the beginning of the program. It seems unlikely that the\naverage grant for a new station will go below that amount; on the contrary with the short\nsupply of used equipment and a trend to increased technical sophistication it is probable\nthat cost averages will rise. Evidence of the large number of citizens benefiting from\nthese expenditures is provided by the 26 applications for new station grants so far\nreceived. Based on total populations reported within proposed grade B contours we find\n1,860,000 persons to be the average number within the service area of a proposed new\nstation.\nIt is reassuring to note that the total expected activations reported by respondents\nis not inconsistent with the rate of authorization requests being made to the Federal\nCommunications Commission. Construction Permits which were granted on the average of 8 a\nyear in the period from 1951 to i960, jumped to 20 in 1962 and to 29 in 1963* At present\nthere are 27 outstanding Construction Permits and 37 pending applications of which 7 were\nreceived during the first quarter of this calendar year. In short, application activity\nbefore the FCC lends credence to the survey result.\nA principal controling factor in development will be the availability of State and\nlocal non-Federal matching funds. While our knowledge is unavoidably sketchy, what we do\nknow is encouraging to the realist. Information is largely limited to funds appropriated\nby State legislatures specifically for ETV construction. Of the new activation applications\nso far accepted by HEW, only a third are dependent for assistance on State ETV construction\nappropriations. It seems a reasonable guess however, that as much as 50$ of the new\nactivations in 1965 will have their non-Federal matching provided through earmarked\nState appropriation. We know now that at least 19 of the stations planned for fiscal\n1965 have non-Federal matching funds already available through State legislative action.\nBecause the legislatures of the large majority of States meet on odd years, 1964 will\nsee few appropriations for educational television, but several millions of dollars are\nalready assured. Furthermore, it is evident that the sessions beginning in 1965 will\nhave a sizable number of carefully drawn ETV construction bills supported by seasoned\nadvocates with several years of spade work behind them.\nThere is a realistic basis for planning on approximately 25-30 station starts\nduring fiscal 1964 and, barring the unexpected, on as many as 50-60 additional starts\nduring fiscal 1965. This rate of growth will impose a tremendous burden upon the\nprofession for which it must prepare if the movement is not to be stunted or fall into\ndisarray because of a failure to resolve the administrative and management problems which\nwill accompany large scale activation."
}