{
  "id": "d1722-0",
  "text": "OF EDUCATIONAL BROADCASTERS\nRepresenting non-commercial, educational AM, FM, and TV broadcasting stations, workshops,\nand production centers, owned and operated by colleges, universities, school systems, and public service agencies.\n• f\nAUGUST 1952\nEDUCATIONAL TELEVISION BEFORE' THE FCC\nFIRST GRANTS FOR NONCOMMERCIAL EDUCATIONAL TV STATIONS\nThe Federal Communications Commission has granted the first authorizations for non¬\ncommercial educational television stations* At press time there were six such grants:\none at Manhattan, Kansas, and five in New York state* Action for grants at Manhattan,\nAlbany, Buffalo and Rochester was taken on July 23 and 21*, while grants in Bingham-'\nton and New York City were finalized on August ll*.\nKansas State College First in Line\nThe initial construction permit went to the Kansas State College of Agriculture and\nApplied Science at Manhattan to operate on Channel 8 with effective radiated power\nof 17*2 dbk ($2 kw),visual and li*.2 dbk (26 kw) aural, antenna height 1£0 feet above\naverage terrain; engineering conditions (BPET-1).\nIn granting this application, the Commission adopted a Memorandum Opinion which reads\nin part:\n\"It appears • • • that the applicant is a land grant college controlled by the State\nBoard of Regents; that Hie Board has authorized the filing of the application; but\nthat funds for construction of the station will require legislative action. In\ngranting this application, the Commission has aken cognizance of the fact that state\neducational institutions and governing bodies in many instances are required to ob¬\ntain 'legislative appropriations in order to carry out their educational television\nprograms* '\n\"In view of the considerations set out in our Sixth Report and Order (FCC 52-29U),\nwhich led to a reservation of certain assignments for noncommercial educational sta¬\ntions, including that just outlined above, we have made a grant in this case despite\nthe fact that additional legislative action appears to be required in order for the\napplicant to secure the recessary funds* This action in no way affects or changes\nour established policies with respect to the finanacial showing required in connection\nwith applications other than those for reserved noncommercial educational channels.\"\n#***#*.#**##* #*##«*#**#’*#■**##**•#/#•#* *.*.#*:*\nTHE NAEB ANNUAL CONVENTION WILL BE HELD IN. MINNEAPOLIS ON NOVEMBER 6-7-8\nr\nFIRST ANNOUNCEMENTS OF PROGRAM DETAILS WILL BE MADE NEXT MONTH\nRESERVE THOSE DATES ON YOUR CALENDAR FOR OUR ANNUAL MEETING\nThe N-A-E-B NEWS-LETTER, published monthly, is distributed from\nthe national headquarters office at the University of Illinois. N-A-E-B\nmembers and associate members receive the NEWS-LETTER as part of\nmembership service. Non-members may obtain the publication at a\nsubscription rate of $5.00 per year. All inquiries regarding subscriptions\nand distribution should be addressed tot NAEB, 119 Gregory Hall,\nUniversity of Illinois, Urbana, Illinois. Editorial copy and inquiries\nconcerning editorial matters should be sent to the Editor, Burton\nPaulu, Station KUOM, University of Minnesota, Minneapolis 14,\nMinnesota."
}