{
  "id": "d1722-14",
  "text": "formed to as part of one’s job and one's style of life, but now with a winking eye,\nfor one knows that manipulation is inherent in every human contact. Men are es¬\ntranged from one another as each secretly tries to make an instrument of the other,\nand in time a full circle is made: one makes an instrument of himself, and is\nestranged f rbm it also.”\nThe so-called mass media are the sensitive foci of the manipulative process. And yet\nthe influence they exercise is rather anonymous than explicitly authored. The imper¬\nsonality of the managerial demiurge even obscures the nature of their power.\n’’The problem is who really has power, for often the tangled and hidden system seems\na complex yet organized irresponsibility*..Targets for revolt, given the will to\nrevolt, are not readily available. Symbols in terms of which to challenge power\nare not available—in fact, there are no explicit symbols of authority to challenge\nCommunications,' labor relations and political parties are identified by Mills as the\nthree processes which play the largest parts in maintaining the white collar popula¬\ntion as a going concern in the managerial demiurge. The areas of assertion and coun¬\nter-assertion are narrowed by the product of the mass media. A similar unreality is\nimparted to life by the monopolization of politics by the two major political parties\nWiich narrows the range of alternative interprets!ons. In the economic-political\narena of struggle, issues are narrowed by the labor-union-corporation struggle. The\nresult is that the insecurities and strivings of the white collar class are inartic¬\nulate and finding no symbols to support, are ’’drained off by the distractions of\namusement, the frenzied search for commodities, or turned in upon the self as busy\nlittle frustrations.”\nThose of us attached to the mass media in some fashion should note that Mills finds a\nlarger degree of competitive entrepreneurship in the communications agencies than in\nother commercial sectors of society. For this there are several explanations. These\nagencies are new within the last generation and have not yet settled down into stable\nbureaucratic, rationalized organizations within known market boundaries. Moreover,\nthese agencies supply most of the know-how of market research, public relations skills\nmove in leap-frog fashion from film to firm and between the communications agencies\nand the general staffs of large commercial and indistrial establishments. ’’Competi-\ntion” between such entrepreneurs, however, lacks one essential element present in the\nvanished white collar world—namely the security *iiich property ownership once provid¬\ned. And this, as Mils remarks, is ’’one thing that makes Sairmjy run*tf\nThe greater degree of competition in the mass media than in other segments of our\nsociety also may account, astigmatically, for a certain difficulty experienced within\nthem in appreciating the organization and dynamics in the society at large.\n# -x- * -x- -x- * x- -x- -x- -x- x- -x- -x -x- -x # * -x- -x- -x- -x- -x- -x -x- -x -x -x -x -x- -x -x -x- -x- * -x\nONE GOOD THING ABOUT A CONVENTION IN MINNEAPOLIS: THERE IS FIRST RATE TRANSPORTATION\nBOTH GOING AND COMING. NON STOP FOUR-MOTOR PLANE SERVICE FROM NEW YORK, DETROIT,\nCHICAGO, KANSAS CITY, AND SEATTLE; ONE STOP FROM WASHINGTON. NO CHAN® OF PLANES\nFROM NEW ORLEANS, HOUSTON, LOS ANGELES, AND SAN FRANCISCO. AND THERE ARE GOOD\nTRAINS TOOl\nIN THIS ISSUE\nEducational Television Before the FCC 1-6\nNews of NAEB . . . ...6-12\nResearch Report—Dallas Smythe • 1"
}