{
  "id": "d1722-3",
  "text": "U. OF SOUTHERN CALIFORNIA AND NEW JERSEY STATE FILE FOR CHANNELS\nThe Allan Hancock Foundation of the University of Southern California* on July 31*\n1952* filed an application for Channel 28* reserved for education in Los Angeles.\nUSC expects to make the facilities of the station available to all accredited educa¬\ntional interests of the area. Both public and private schools will have the oppor¬\ntunity to participate in the planning and operation of the station’s programs*\n”If this educational channel is to serve the best interest of education and the com¬\nmunity* we believe that its operation should be free from domination or control of\nary single gboup. M°re particularly* we feel that its value should be shared by all\nthe educational groups in this area who desire to participate.”\nThe application states that the Allan Hancock Foundation has coupletely equipped\ntelevision studios now in operation for instructional purposes. These* together with\nnew production centers in Los Angeles and neighboring communities, will provide fa¬\ncilities for all types of educational programs.\nThe estimated cost of construction for the Los Angeles educational station is $150*000;\noperating expenses for the first year are estimated at $195*000.\nIn New Jersey\nThe State of New Jersey on July 30* 1952* filed application for UHF Channel 19* re¬\nserved for educational use in New Brunswick*. New Jersey. The application* signed by\nChester Robbins* Acting Commissioner of Education* states that studios will be locat¬\ned at College Heights on the campus of Rutgers University in New Brunswick* and that\nthe effective radiated power will be 105.2 kilowatts.\nState appropriations for preliminary studies in connection with educational television\ntotal §80,000. As early as September* 1950* the Montclair Teachers College began\nintensive studies* in’ cooperation with DuMont, of the Educational uses of television\nin teacher training. The results of that study are incorporated in the New Jersey\nsp plication.\nIn a letter to FCC Chairman Walker* which accompanied the application* Governor Dris¬\ncoll said: ’’Studies of the feasibility of non-commercial television are now being\nmade in this state. A? you know* six channels have been allocated to New Jersey*\nGetting the first station in operation as soon as possible will be exceedingly help¬\nful to us in making a determination with respect to the other five channels.”\nAccording to the New Jersey application* operating expenses for the first year are\nestimated at $lb6,000. In the light of a proposal by the Allen B. DuMont Laborator¬\nies* Inc.', pursuant to which DuMont is to furnish the transmitter and associated\nequipment at cost* the New Jersey application does not specify total construction\ncosts; the transmitter building is estimated at $1*2,500; studio buildings at $75,000.\nIn his letter-transmitting the application to the FCC* Acting Commissioner Robbins\nsaid: ”As the Commission may already be aware* appropriations by our State Legis¬\nlature to cover the station contemplated by this application may be dependent upon\ndefinite assurance from your body that the construction permit will be forthcoming/\n— or that' it will be in hand*\nOther Applicants Pending\nOther applications for noncommercial educational stations pending before the FCC\ninclude: The Bay Area Educational Television Association* San Francisco-Oakland*\nCalifornia (Channel 9); and The University of Houston and the Houston Independent\nSchool District, Houston, Texas (Channel 8)»"
}