{
  "id": "d1174-1",
  "text": "FROM DEM JAMES T. ROOD-, DIRECTOR OF STATION KOB, NEVI MEXICO COLLEGE OF AGRICULTURE\nAND MECHANIC ARTS, STATE COLLEGE, NEW i EXICOj ’’During the ppst year we have not put\non any plays here from the main studio of KOB, as we have no Department of Dramatic\nArts,\n\"However, for a number of weeks, on Wednesdays, we put on a play from our remote con¬\ntrol studio at El Paso, Texas, These plays were directed and put on by Mrs, Ball of\nthe Department of English at Texas School of Mines at El Paso, Texas, No doubt, she\nwill be delighted to give you full information about the success of the plays she\ndirected for us,\n\"During the coming winter we expect to put on several plays performed by a combined\ngroup of college and town people who have been carrying on a Little Theatre movement.\nNot till later will I know the titles of the plays they expect to perform,’1\n(NOTE* A number of the stations have been corresponding with me relative to dramatic\nproductions, etc. I would suggest that here is another valuable lead and the directors\nshould get in touch with Mrs. Ball of the Department of English, Texas School of Mines,\nEl Paso, Texas. I am sure that, she will be able to render valuable assistance to sta¬\ntion managers as has been suggested by Dean Rood.)\nFROM MR, W. I. GRIFFITH', DIRECTOR OF RADIO STATION WOI, ENGINEERING EXTENSION SERVICE\nIOWA STATE COLLEGE, AMES, IOWA* ”W’e have not been very active in broadcasting pi*'ys,\nI feel this is a fine thing and a movement that should be encouraged. We had difficul¬\nty in getting any plays that wore worthwhile without royalty,\n’’I suspect you already have a report from Higgy and know of the work of Miss Gwendolyn\nJenkins at WEAO• I think their work in this line is outstanding ond will bo of interest\nto all member stations.\n”1 assure you I will appreciate results of your labors in making this information avail¬\nable, Do you know anything about the plays that are prepared by tho Hershey Play\nCompany, 2157 Sargeant Avc., St. Paul, Minnesota? Their literature has come to my\nattention but I do not know how good it is.”\n(NOTE* I have made special effort to secure information relative to the Hershey\nPlay Company of St. Paul, Minnesota. To date I have been unable to get information\nabout their materials. Will any of the program managers or directors who have this\ninformation kindly supply the same to Mr. Griffith of WOI and at the same time supply\nthis office with a carbon of your letter to him. It will help us complete our records\nrelative to this request.)\nAll member stations have received the TJEAO October bulletin offering special comments\nand listing special programs for the station of the Ohio State University, May I call\nto your attention the article below taken from page six of this bulletin dealing with\nthe YJEAO. Players• It answers a number of requests that have reached my office from\na number of individuals over the country and contains an excellent idea for any pro¬\ngram manager or director to develop for his station in cooperation with the school of '\ndramatic arts of his institution. It also establishes a direct contact with tho sta¬\ntion’s audience since the listeners send in interesting anecdotes or stories of th&ir\nown forefathers and may, in turn, hoar them presented in dramatized form by tho station\ncast. The article is as follows*\n\"The YJEAO Players are opening their fourth season of dramatic entertainment for the\nlisteners of this station. Gwendolvn Jenkins is agein directing the group. Over 150\nplays have been presented by the Players since their organization three years ago. A\nsurprise this season is the announcement thpt mrtinees will be offered once inch week.\nThe plays will be presented first on Friday night, then repeated the next Thursday at\n4*10 P. M."
}