{
  "id": "d1174-6",
  "text": "-7-\n.consideration of research pirns for projects that mi^ht bo carried on by the Committee*\nPerhaps the most ambitious reserrch undertaking pirn will bo rn extensive survey of\ncollege and University stations to bo made personally by Mr. Tyler, the secretary.\nThis will involvo several months’ traveling, which should result in considerable in¬\nformation of value. It might be well to suggest in a bulletin to our membership that\nevery courtesy and convenience be extended to Dr. Tyler on his visit to stations of\nthe Association. If any of our stations have suggestions as to what work the Commit¬\ntee might do in addition to that mentioned above,' or any other matter, I shall be\nglad to present it to the Committee at the next meeting on December 11, 1931* The\nService Bureau of the National Committee is doing very fine work in assisting our\nstations in their dealings with the Federal Radio Commission* The Service Bureau has\non many occasions represented the stations at hearings with power of attorney in oase\nthe stations are unable to send a representative to Washington*\n\"The Radio Division of the Bureau of Educational Research of Ohio State University is\nnow in action and Dr. Lumley is actively engaged in several research problems. One\nof these I believe the Association will be vitally interested in. He is attempting\nto evolve a standard form of listener questionnaire report. We are making certain\nexperiments here in connection with our station, and very shortly will ask for the\ncooperation of other stations in order to prove the value of the questionnaire before\nit is finally released to all stations for their use. We have found such a mail ques¬\ntionnaire of great value here, and I am sure that with further refinement it can be\neven still more valuable.\n■I realize that the above suggestions and information are in r> very crude form* but\nT trust that some of them will be complete enough for you to pass along to our sta¬\ntions in your next bulletin*\n<JYour special bulletin hrs ,iust arrived and I notice the remarks on the last few\npages about radio drama.\n\"In accordance with my promise I am sending you herewith the first radio play which\nMiss Jenkins of our staff has received permission to have distributed free to all\ncollege and university stations* This is a play that has been given several times\nover our station with considerable success and was written by Herman A. Miller, of\nour Department of English.\n”1 am also enclosing copies of several letters which contain pertinent remarks on\nthe production of radio plays. These letters are copies of correspondence relating\nto a radio play tournament which was held last spring here. It was highly success¬\nful, and. we are already planning on another tournament for this year* I think many\nof the suggestions contained in the letter dated February 18, 1931, will be of in¬\nterest to stations planning radio plays,\n\"I will forward several other plays as soon as we can obtain.the necessary permission\nto have them released and have a copy in shape for you. We will appreciate it if you\nwill forward us several copies of each play*\n\"Your bulletin was very fine, and is going to be of great importance to our stations\nI am sure* Keep up the good worki”\n(NOTE: Will you please refer back to Mr. Higgy’s comments relative to having plays\nsent to the executive secretary’s office, mimeographed at this office, and released\nto the members. Kindly give mo your reaction as to whether or not this would be a\nuseful service for you. Vo will be very glad to mimeograph those plays that have\nproved a success for member stations and supply.the copies if you feel the material\nwill be useful in your work. Also kindlv note the paragraph of Mr. Higgy’s letter\nrelative to the National Committee’s work. It is quite important that all members\nof the Association keep acquainted with developments on the Fess Bill and any other\nbill that may be introduced in the House and Senate affecting educational broadcasting.\nPlease note particularly his comments relative to the Bureau of Educational Research\nof Ohio State University. Note that Dr. Lumley of the Research Bureau is attempting\nto evolve a standard listener questionnaire report. Personally, I can think of no"
}