{
  "id": "d1916-13",
  "text": "- lb -\nWNYE RESUMES TV SERIES\nOn October 6th the New York Board of Education resumed its television series \"The\nLiving Blackboard.\" The programs, produced in cooperation with the New York Daily\nNews television station WPIX on Channel 11 are telecast every Monday, Wednesday, and\nFriday of the school year at 11:30 A.M.\nFollowing the successful pattern set last year, three subject areas are explored each\nweek. On Mondays there is a new guidance program. Your Life and Your Living, featur¬\ning sequences from selected educational films, live dramatic episodes, student\nparticipants and interesting guests from many fields of work. Dr Frances M. Wilson\nDirector of Guidance for the Board of Education, serves as moderator\nOn Wednesdays, Louis Kleinman, the Coordinator of the High School of the Air for Home\nInstruction, airs the program he initiated last year, Science At Your Fingertips.\nTopics in the area of General Science are covered in these broadcasts during this\nschool term. A study guide has been prepared to supplement the telecasts.\nNew Topics\nA new offering in the field of the arts is the Friday presentation, Hobbies and.\nCrafts. As the name implies, the program will explore such fascinating, and varied,\nfields as jewelry-making, ceramics, photography, ornamental painting and ham radio\noperating.\nThe topics for the new \"Living Blackboard\" series were not chosen at random by the\nproducers of the programs but were selected on the basis of preferences indicated by\nthe high school students on home instruction via a poll conducted last spring.\nAlthbugh \"The Living Blackboard\" is designed to supplement the work of the home\ninstruction teachers and the radio broadcasts of the High School of the Air, James\nF. Macandrew, Director of Broadcasting, and Mrs. Dorothy Klock, Television Super¬\nvisor for the Board of Education, hope that teachers and pupils in the schools.of\nthe city will use the programs this year wherever television receivers are available.\nKPRC OFFERS EQUIPMENT TO EDUCATORS\nTelevision facilities valued at more than $150,000 have been placed at the disposal\nof the Houston, Texas, School Board by the Houston Post Co., licensee of KPRC-AM-\nFM-TV in that city.\nThe offer was made by former Governor W. P.. Hobby,. Houston Post president, and Oveta\nCulp Hobby, executive vice-president. A similar offer was made to the U. of Houston\nBoard of Regents. The two educational organizations are joint licensees of Channel\n8, Houston’s non-commercial educational outlet.\nAcceptance of the offer was indicated by Holger Jeppesen, chairman of the school\nboard's TV committee, who said: \"I find this one of the most generous offers we’ve\never had. There was no price tag on this, but by checking I've found that we stand\nto get equipment valued in ekcess of $150,000.”\nThe Hobbys in a letter to the board noted their interest in educational TV and \"for\nthese reasons, the Houston Post Co. has decided to offer to you, as a gift, certain\nof its present facilities....These include without attempting to be specific, the\nstudio building,* sets and props; transmitter building; office, storage and shop\nspace; 500-foot tower and its facilities....\"\nThe letter pointed out that should the offer be accepted, Channel 8 would be on the\nair sooner than anticipated. The gift will be'effective about Feb. 1 when a new\nplant being constructed for KPRC-TV will be ready for occupancy."
}