{
  "id": "d1916-17",
  "text": "- 18 -\nEducational Challenge*of Overcrowding\n\"Then there is the challenge of over-crowding in our elemeptary schools and high\nschools: 300,000 classrooms are needed immediately. And, because of the increase\nin population, another 300,000 will be needed in 1958.\n\"There is the challenge of the shortage of elementary school teachers, now esti¬\nmated at 53,000.\n\"There is the challenge represented by the millions of eligible young men and\nwomen who are unable to go to college mainly because of economic reasons. For\nevery American boy and girl now in college, there is another boy and girl quali¬\nfied to attend but who is not attending because of lack of funds. . . .\n\"Implicit in all these problems is this challenge: In a democracy we are extremely\nsensitive to the rights, the privileges, the potentialities and the aspirations\nof the child or the adult as an individual. As a general principle, we believe\nin equality of opportunity in education. In addition, educational leaders point\nout the.value of an educated citizen to his community and to his nation.\n\"Every time we fail to capitalize fully on the minds of our youth by not giving\nthem the fullest educational opportunities that they are capable of employing, we\nare guilty of a monstrous waste of human resources....\nImportant Role of Adult Education Overlooked\n\"The Report of the President’s Commission on Higher Education had this to say of\nthe role of the colleges in this field:\n\"’The present status of university extension service makes it painfully clear that\nthe colleges and universities do not recognize adult education as their poten¬\ntially greatest service to democratic society. It is pushed aside as something\nquite extraneous to the real business of the university.’\n\"The President’s Commission pointed out that elevating adult education to a posi¬\ntion of equal importance with any other function would require more teachers,\nmore manpower in administration and a very considerable increase in budget. But\nthe Commission did not concede that this is the biggest obstacle.\nShould Broaden Concept to Include TV\n\"The principal obstacle, it asserted, is the limited concept that higher education\nstill holds of its role in a free and democratic society.\n\"’It must broaden that concept,’ the Commission declared. ’It must cease to be\ncampus-bound. It must take the university to the people wherever they are to be\nfound and by every available and effective means for the communication of ideas\nand the stimulation of intellectual curiosity. . .\n\"As directors of these educational stations, you have your work cut out for you in\nhelping Americans to adjust themselves to their new responsibilities as citizens\nof a nation commanding world leadership, citizens who must study and solve cor¬\nrectly many knotty international problems. . . .\n\"Ladies and gentlemen, the beginning of educational television in America is in\nyour hands. The children of America, the grownups of America, hungry for the\nbenefits you have to offer, await the fruit of your efforts. Nowhere in the\nworld have educators been armed with the power you now have at hand to speed the\neducation of an entire nation. I know that you approach the fulfillment of your\nmission with a sense of high resolve, of humility and of dedication. And knowing\nthis, I know that success will crown your labors.\""
}