{
  "id": "d1916-19",
  "text": "- 20 -\nPOOLE TELLS SCHEDULE FOR \"SCIENCE REVIEW\" SERIES\nTopics for the fall and winter schedule-of-the Johns Hopkins-Science Review, produced\nin the WAAM studios for DuMont network release, have been announced by producer Lynn\nPoole.. The series returned to the air September 1J.\nThe fourth program, October 6, presented !,How We Will Conquer Space, and the^\nOctober 13 and 20 broadcasts also dealt with outer space. Upcoming programs in¬\nclude: \"George—The Mechanical Mind,\" October 27; \"X-ray—by Motion Pictures,\nNovember 3; \"Man Against Cancer,\" November 10, 11, and 2h; ”100,000 Colors to See\nWith,\"December 1; \"Seeing Is Not Believing/ December 8; \"New Developments in\nPsychiatry,\" December 15; and \"Ask Your Dad, December 22.\nJohns Hopkins to Build TV Equipped Auditorium\nJohns Hopkins University recently announced that construction would begin soon on\nwhat the university believes to be the first academic auditorium to be built with\npermanent installation of television broadcasting facilities. The building, Shriver\nHall, is to cost more than $1,000,000, and is to be completed by the autumn of 1953-\nIt will have video cabling facilities and microwave facilities so that the univer¬\nsity can broadcast nationally or locally from Its stage.\nUNIVERSITY OF MICHIGAN OFFERS TELECOURSES OVER THREE STATIONS\nTelecourses—college courses via television—will be offered by the University of\nMichigan over.WWJ-TV, Detroit; WJIM-TV, Lansing; and WKZ0-TV, Kalamazoo.\nThis is the third year the program has been telecast. During the.1951-52 season,\n38OO registrations were received for the courses which originate in the WWJ-TV\nstudios.\nScience will be emphasised in the opening courses. Half-hour weekly lessons in\n\"Modern Physics,” a 15-weeks course, and \"Understanding Our Natural Resources, seven\nweeks, will, inaugurate the fall semester. The resources program will be followed by\nan eight-weeks course in understanding music.\nProf. Ernest F. Barker, chairman of the University’s Department of Physics, will deal\nwith the atom and atomic energy, light and radio waves, radar, and the use of the\nelectron miscroscope, during the 15 lessons. Use and waste of natural resources will\nbe discussed by Shirley W. Allen, professor of forestry, in the seven weeks tele¬\ncourse. Forests, minerals, water and wildlife, will be included in his list of sub¬\njects. Members of the School of Music faculty will present.the music course empha¬\nsizing the vocal arts.\nWeekly lessons on the one-hour program have been extended from 20 to 30 minutes this\nyear because of popular demand, according to Garnet R. Garrison, director of tele¬\nvision. A third portion of last year’s show, The Teletour, will be carried by\nWWJ-TV at another time, he said.\nSupplementary written material on the courses may be obtained by enrolling with the\nU-M Extension Service in Ann Arboh. Fees of two dollars for 15-weeks courses and ox.„\ndollar for the short courses are charged. Upon completion of a course, a Certificate\nof Participation is sent enrolled persons.\nNEWARK OUTLET SCHEDULES EDUCATION DISCUSSIONS\nSchool issues and new developments in education were shown in six weekly^TV programs\nover WATV, Newark, N.J., last July. The series, titled \"Summer Session, was pre¬\nsented by the Institute of Administrative Research of Teachers College, Columbia\nUniversity, in cooperation with the station.\nMembers of the institute staff, school superintendents, teachers, and other educators\nparticipated in the discussions which featured the half-hour programs."
}