{
  "id": "d1916-21",
  "text": "- 22 -\nVIENNA'S AMERICAN-SPONSORED NETWORK BUILDS UP ANTI-COMMIMIST NEWS TEAM\nAustria's American-sponsored German-language network, Red-White-Red, with studios in\nLinz, Salzburg and Vienna, has built up a news team whose goal is to counter commun¬\nist propaganda on both sides of the Iron Curtain. RWR is one of the most listened-t<\nradio networks in Central Europe, heard by an overwhelming majority of Austrians, anc\nincreasingly respected by all freedom-loving people within the sphere of the former\nAustrian Empire over most of which broadcasts can be received. The importance of\nthis cannot be underestimated as nearly all owners of radio sets in this area under¬\nstand the German language. Furthermore, RWR is the only radio station whose broad¬\ncasts many of them can receive with their antiquated pre-war sets.\nPropaganda Plan\nRWR's Austrian and American chiefs have worked out a propaganda scheme, carried it\nout in the past year, and proved its efficiency. The first thing they did was to\nhire a tough and tight trade-union man who knows how the workers feel about the\nRussians. In a daily broadcast, early in the morning, he tells his fellow-workers ii\ntheir own language what's going on and what's going wrong, and explains what would\nhappen if they had to work under red bosses. This broadcast, widely listened to, ha?\nproved successful time and again. A recent example was when communist-dominated\nfactories voted overwhelmingly for anti-communist delegates at this year's union\nelections following RWR's broadcasts on the subject.\nThe next move of RWR's chief was to hire a multilingual Czechoslovakia-borh com¬\nmentator, who reads all iron curtain newspapers (available in Vienna's Russian sec¬\ntor) and translates them for Austrians.\nRWR’s 100 kw transmitters are only a few miles from the borders of several of the\nIron Curtain countries.\nThe \"World News Roundup\" is a program for those who cannot or.do not read foreign\ndailies and magazines. This roundup of direct reports by coi*respondents all over the\nfree world is the first of its kind in Europe. It emphasizes the unity of the West\nand stresses the theme of growing Western economic and military strength.\nFormer NAEBer Skornia On Staff\nRWR needed not only fighters but thinkers too. The former chief of the official\nAustrian press agency was hired to be coordinator of all of RWR's news and commentary\nbroadcasting. Professor Ostry, the head of the section, gives political shape to the\nnetwork's newscasts. His daily analysis of the world situation expresses not only\nhis personal view on poIitics--it represents the will and wish of the free world,\ntries to give hope to the suffering and enslaved, and tells the others, who do not\nbelieve in freedom, that they cannot win.\nAfter RWR network and program directors, advised by State Department officials\n(headed by Dr. H. J, Skornia, on leave as chairman of Indiana University's Department\nof Radio, and former consultant for RIAS and other German stations, as Radio Officer),\nhas established this set-up, other political broadcasts were originated, broadcasts\nto show the communist world that criticism is essential to nations where there is\nfreedom and truth. >"
}