{
  "id": "d1916-22",
  "text": "Cultural and Moral Issues\nTheater critic Hans Weigel/'''Austria. rs Alexander .Wooldott; who has for, years been\nfighting against communist •infiltration-in the arts and for.greater activity on the\npart of the country's' cultural organization^, was given a weekly broadcast,: After\none of Weigel's cleverly led attacks. Austria’s official daily recently fired its\nmusic critic, a-famous and influential composer but a sympathizer with Soviet Russia\nIt is partly due to Weigel’s activity that Austria's outstanding intellectuals are\nless infected by the communist'disease than'those of France Or even of Great Britain\nDaniel Brier, one of RWR's most\"promising producers, concentrates on moral problems\nthat arise in modern life. His broadcast is a series of wise and witty thoughts,\nphilosophical at times, often whimsical.,: The audience which his program has Success\nfully built up is one which wants to learn about the human aspects of what is wrong\nwith our world and mankind. He is also the moderator of the network's forum program\nand \"RWR Radio\"Parliament,\" a model of free speech, heard behind the Curtain where\nsuch criticism is taboo.\nFreedom of Expression Insured '\nTo ward off the Austrian's and Western European's sceptical- attitude, two other mem¬\nbers of RWR's staff write and produce a man-in-the-street program for the average\nman. The problem of explaining political questions in this broadcast is only second\nary> what matters most is that listeners in Austria and especially behind the Iron\nCurtain are taught to what: extent .criticism and discussion of everything on earth is\nnot only possible but absolutely necessary in a free and democratic world.\nRWR also sets aside a certain amount of air time for each party of the.Austrian\ncoalition cabinet, to the Trade Union Federation, and to the Chambers of Agriculture.\nFurthermore, cabinet ministers speak at regular intervals in broadcasts especially\nreserved for them.\nThe Austrian situation in the psychological war is better than in many other parts o:\nthe world, and Vienna has become an outpost- in the Western psychological offensive.\nRWR, Austria's American-sponsored network, undoubtedly has contributed greatly to\nthis intensification of the campaign by the work of its versatile and energetic news\nteam. „ !- /\"•\" •' •' \" ‘ ' ■' -• \" :\nUTAH U. RADIO PERSONALITY AIRS EUROPEAN.MEWS PROGRAM\nAnn Wagner, broadcasting for the University of Utah, has been steadily building up a\nlarge and discriminating audience for over a year now with her \"Voices .of Europe.M\nThis feature has been broadcast weekly over KUTA, Salt Lake City, and tapes, have alsc\nbeen mailed to other stations throughout Utah for rebroadcasting..\n\"Voices of Europe\" is a fifteen-minute educational commentary and has as its chief\naim the furtherance of understanding between this nation and our neighbors abroad.\nAn accomplished linguist, Miss Wagner translates .from representative, European news¬\npapers of varying political points of view, bringing a summary of what Europeans\nwrite for.Europeans--especially what Europeans write about American affairs and\nAmericans. Subject matter often ranges from what Europeans think about' our political\ncandidates or what they think about the way we think about their affairs, to what\nthey think about American drama in foreign theatres, or any of innumerable subjects\nwhich make headlines in Europe.. Miss Wagner has been a naturalized citizen of the\nUnited States for ten years. She, was born in Germany and educated cfri the Continent.\nMiss Wagner brings literal translations from the foreign press, summarizes but does\nnot analyze or interpret, and attempts always to bring about greater international\nunderstanding by increasing the \"community's knowledge about our neighbors abroad.\n\"Voices of Europe,\" consistent with the University's belief that educational broad¬\ncasters should offer radio and TV fare not- usually aired by commercial interests, has\nbuilt a large and appreciative audience in Salt. Lake City*."
}