{
  "id": "d1916-24",
  "text": "AMERICAN EDUCATION WEEK WILL FEATURE CHILDREN IN TODAY'S WORLD\nThe 32nd annual observance of.American Education Week, November' 9-15y 1952, will\nagain direct.nationwide attention to the work of the schools. The central theme of\nthe 1952 program is \"Children in Today’s World,’\" with daily emphasis-upon \"Their\nChurches,\" \"Their Homes,\" \"Their Heritage,\" \"Their Schools,\" \"Their Country,\" \"Their\nOpportunity,\"and \"Their Future.\"\nAmerican Education Week is a time to review the purposes and accomplishments of the\nschools, to consider their needs and problems, to sharpen public interest in school\nimprovement, and to strengthen the bonds of home, school, and community cooperation.\nAn effective community-wide observance of American Education Week is a good founda¬\ntion for a year-round program of school public relations, suggests Ivan A. Booker,\nAssistant Director, Division of Press and Radio Relations of the National Education\nAssociation.\nOPERATING AMERICAN TAPE RECORDERS ITT BRITAIN\nMany inquiries have been made concerning the use in Great Britain of American record\ning machines. For your information we reproduce below a report written by a British\nBroadcasting Corporation technician.\n\"Alternating current in England generally has a frequency of fifty cycles and in\nthe United States of sixty cycles. The frequency or number of cycles determines\nthe speed of the electric motor used in a tape recorder to drive the tape.\n\"One of the standard speeds at which tape is driven is fifteen inches a second.\nShould one connect a tape recorder with a tape speed of fifteen inches per secon*\ndesigned for United States sixty cycle operation to the British fifty cycles, it\nwould operate but the motor would revolve slower, actually at five-sixths of the\nspeed for which it was designed. This in turn would drive the tape slower at\nfive-sixths of fifteen inches a second or at twelve and a half inches per second.\nIf the tape were played back in England on the same sixty cycle machine on which\nit was recorded it would of course work at the:same sub-standard speed of twelve\nand a half inches per second and reproduce quite well. Should this tape however\nbe played back in the United States on the same or any other standard machine it\nwould play back at the correct fifteen inch per second speed which would be two\nand a half inches per second faster than that at which it was recorded. This\nwould result in a speeding up of the program content, a rise in pitch and a\nshortening of the program time.\n\"In short you can operate a standard sixty cycle American machine in England only\nif you are prepared to play back the tape or dub it from the same machine in\nEngland. It could not readily be reproduced in this country.\n\"Some United States recorders—for instance the Magnacord--can be fitted with\nspecial pulley wheels which enable them to be run at a standard speed while\noperating on fifty cycle current. With such a device the tape is recorded at the\nstandard speed in England and will reproduce in the United States on any standart\nmachine or on the machine on which it was originally recorded if the sixty cycle\npulleys are replaced.\"\nLONDON CLASSROOMS HAVE CLOSED-CIRCUIT TELECASTS •\nLONDON, ENG. - The British Broadcasting Company is telecasting closed-circuit educa¬\ntional programs to 12 London schools in an experiment to determine the effectiveness\nof ih-school teaching by television. Inspectors Of the Schools Broadcasting Council\nare testing classroom reactipn to TV.\nExpansion of the telecasts into a regular schedule is planned following a study of\nthe experimental programs. The BBC for many years has given a wide range of lessons\ndaily to schools all over the country by radio."
}