{
  "id": "d1916-9",
  "text": "10\nKANSAS U. BEGINS FM BROADCASTING - .. ..\nThe University of Kansas has gotten into FM radio.. Its new station,, KANU, began\nregular broadcasting Sept. 10, R. Edwin Browne., director of radio, announced\nrecently.\nKANU operates at 91.5 megacycles on the FM dial, with a clear,signal receivable over\na 70-mile radius from Lawrence. It broadcasts by means of a 10,000-watt transmitter\nand a 511-foot tower.\nThe station is a gift to the Kansas University School of Journalism by-John B. Harris\nand Sydney F. Harris, Hutchinson and Ottawa publishers, as a memorial to their uncle,\nFred M. Harris, a former member of the state board of regents.\nFor many years, Kansas University has owned and operated KFKU, an AM station, which\nsplits time with WREN, Topeka.\nDULUTH FM STATION TO CARRY WISCONSIN PROGRAMS .\nWEBC-FM in Duluth, Minnesota, which was wrecked by a storm some months ago and has\nsince been silent, is being rebuilt and will soon return to the air on a regular\nbasis. The station has expressed an interest in rebroadcasting the Wisconsin School\nof the Air for children in Northern Minnesota, and will be given permission to do so.\nAn FM sales campaign is being staged at present in Duluth-Superior and surrounding\ncommunities. .\nFAR MORE FM\nMore than 40,000 classes in New York City grade schools and high schools will listen\neach week during this school year to the Board of Education's WNYE (FM) programs,\naccording to the 1952-53 program bulletin. Rapid growth from 9,000 classes in the\n1947-48 school year was attributed by school officials to the greater availability\nof FM radios in schools and to improved programming.\nPOSITIONS WANTED\nTV and radio writer with 12 years of commercial radio experience seeks connection\nwith university or other educational station. Experience with creation and wr±ting\nof all program and commercial types both in radio and TV. Executive experience:\ncommercial production manager for TV station, continuity director in local and\nregional stations. Available immediately. Frank C. Hart, Box 93* Route #3>\nBatavia, Ohio.\nMusic Program Director, A.B. cum laude, 19^9* A.M. 1952, Harvard University, ass't.\nto A. V. Frankenstein, H.U. 1951 and 1952; married; will travel; wide musical expe¬\nrience; for further information and references write: Victor Yellin, 653 Concord\nAve., Cambridge 38, Mass., Tel: TF.6-6095; New York address: 211 E. l4th St., New\nYork 3, N. Y., Tel: OR3-93^5-\nFormer Director of Promotion for Broadcasting and Film Commission, National Council\nof Churches seeks position in educational radio. Has e^erience in audience promo¬\ntion, radio, TV and TV films; also, programming, continuity-and dramatic -writing,\nteaching experience in radio and TV workshops. Master's degree from U. of Chicago.\nFor more details write to: Miss Marjorie Hyer, 520 East 12th St., New York City,\nN. Y."
}