{
  "id": "d1401-4",
  "text": "5\nLooking Ahead\nNAEB has striven always to provide requested services to the limit--and\nsometimes beyond --of its available resources and personnel and, to the\nextent possible, within the established structure and organizational pro¬\ncedures of the Association,\nEducational broadcasters in recent meetings have articulated the need for\nmore and better services in behalf of educational broadcasting and have shown\na growing appreciation of the fact that their Association must restructure and\nestablish new bases for support if it is to provide the quality of leadership\nat the national level and quality of service at the local level which the times\ndemand.\nResponsive to these concerns, the NAEB officers and Board will place\nfirst priority in 1963 upon aggressive action in the development of an Associ¬\nation which will wield together the strengths of all the diverse segments\nwithin the general field of educational radio-television and actively meet\nthe professional needs of individuals, stations, institutions, and organizations\ninvolved. As earnests of this resolve, the Executive Committee has met twice\nand will soon meet again to consider various reorganization proposals. Shortly\nthe Radio and TV Planning Committees and the Closed-Circuit TV Committee\nwill distribute questionnaires aimed at eliciting from members in their areas\nof interest answers as to the specific services which they feel NAEB should\nprovide. The results of these questionnaires will be folded into the plans for\na new structure designed to realistically fulfill the indicated needs and at\nthe same time build in the provisions for financial support which will be\nrequired for such services.\nSeasonal Note\nIn many respects this has been a good year for educational broadcasting\nand 19 63 looks even brighter. Legislatively, 19 62 brought passage of the ETV\nfacilities legislation (after seven years effort) and the all-channel receiver\nbill. The ETV movement kept moving with 11 new stations coming on the air\nand prospects for the new year indicate an accelerated growth in 19 63 . Some\n3 6 stations are poised on the edge of activation and some 70 others are well\nalong in the planning. Eight state ETV networks are in operation and eight\nmore are planned. One regional net is in being and three more are being\nestablished.\nIn radio, ten new educational stations came on, and, with educational FM\nexempted from the current freeze, we should average about two more per month\nthroughout 1963 ."
}