{
  "id": "d499-1",
  "text": "ASIAN BROADCASTING UNION\nOFFICE Of- THE SECRETARY-GENERAL\nBOX 3636. G.P.O.,\nSYDNEY.\nCABLE ADDRESS: ASBUN. SYDNEY\n1st December 1967\nDear Mr Harley,\nIf I had not been pressed by various urgent matters in the last few weeks\nI would have written to you earlier, as I should have done, about various\npractical matters connected with NAEB's membership of the ABU,\nI would now like to tidy up these matters:\n(1) ABU Newsletter: We are sending you 3 copies of the Newsletter each\nmonth but could be grateful to know whether this number is sufficient.\nAs the Newsletter is distributed by air, we try to keep the number of\ncopies to the essential minimum but please do not hesitate to ask for\nmore if you consider them necessary.\nIn addition to the background article about NAEB which I have mentioned\nin a separate letter, we would be grateful to receive further contribu¬\ntions for use in the Newsletter from time to time. We try to include\nin each Newsletter several substantial articles as well as a number\nof short pieces containing factual information: contributions of\neither kind would be most welcome. As NAEB is concerned with\neducational broadcasting, I feel sure you could provide contributions\nthat would be of great interest to our members in developing countries.\nIncidentally, I should perhaps explain that engineering matters are\nincluded in the existing Newsletter when they are available. However,\nwe expect next year to appoint a professional engineer to the ABU staff\nin Tokyo and when he starts work he should be able to collect enough\nengineering material to justify the publication of a separate Technical\nNewsletter.\n(2) Liaison Officers: We ask each of our members to nominate from their\nstaff an ABIT Liaison Officer who acts as a point of contact between his\nown organisation and the ABU, particularly for the more routine types\nof correspondence such as that about exchanges of information, programme\nexchanges etc. The Liaison Officers also act as a point of contact\namong members, e.g. if a member wishes to obtain information from\nanother member but does not know the name of the officer likely to be\nconcerned, the enquiry can be addressed to the ABU Liaison Officer.\nSimilarly, each member is requested to nominate an ABU Technical Liaison\nOfficer who carries out similar functions in the engineering field.\nAttached are two forms seeking your nominations.\nYou will be receiving from the ABU staff in Tokyo, where the records\nabout these appointments are kept, a list of the names and addresses\nof the existing ABU Liaison Officers and ABU Technical Liaison Officers.\nChanges or additions are published in the Newsletter, so that members\ncan keep their lists up-to-date.\n(3) Statutes, Proceedings etc: We would normally have sent you some\nadditional copies of the Statutes but as the Statutes were amended\nat the recent General Assembly in Singapore and are about to be\nreprinted, there is not much point in sending copies of the existing\nbooklet. You will receive a questionnaire asking about the number\nof copies of the amended Statutes you will require.\nYou will have received a copy of the Proceedings of the Third General\nAssembly and we are now sending to you by seamail, for reference purposes,\na copy of the Proceedings of the Second General Assembly. We are\nrunning out of copies of the Proceedings of the First General Assembly\nand, in any case, most of the references in correspondence would be\nto the more recent meetings."
}