{
  "id": "d499-101",
  "text": "4. Any member joining the ABU during the course of a fiscal year shall be liable for\npayment of one-twelfth of the annual subscription or contribution for each full\ncalendar month still to run until the end of the said fiscal year.\n5. The subscriptions and contributions shall be payable at the beginning of the fiscal\nyear. However, at the request of a member and under justifiable circumstances,\nthe President may authorize a deferment of payment or payment by instalments.\n6. The budget and the accounts of the ABU shall be drawn up in the currency of\naccounting pounds sterling or accounting United States dollars. Payments of sub¬\nscriptions and contributions shall also be made in the currency of accounting\npounds sterling or accounting United States dollars.\n7. The financial responsibility of members shall be limited to the amount of their\nsubscriptions and contributions.\n8. The ABU shall be answerable for its engagements to third parties to the full extent\nof its assets.\nArticle 15: Finance and Accounting\n1. The fiscal year shall begin on 1st July and end on 30th June of each year, except\nfor the first fiscal year in which the Union is established, which shall be from the\ndate of such establishment until the next 30th June.\n2. The books, ledgers and accounts shall be closed on 30th June of each year.\n3. The auditor or auditors appointed by the General Assembly shall submit to the\nGeneral Assembly during its ordinary session a report on the management of the\nUnion and the statement of accounts for the past fiscal year.\n4. The President shall present a draft budget to the ordinary session of the General\nAssembly.\n5. The financial resources of the ABU shall comprise:\na) the subscriptions of full members and contributions of associate members;\nb) payments from associate members for work undertaken or service rendered\nspecially by the ABU at their request;\nc) payments from full members for any extraordinary assignment carried out by\nthe Union at their request;\nd) receipts from sale of publications and other services, and\ne) subsidies and donations.\nArticle 16: Dissolution of the Union and\nAmendment to the Statutes\n1. Proposals relating to the dissolution of the ABU or for amendments to these Stat¬\nutes may be made only by full members.\n2. A proposal or proposals to dissolve the ABU shall be deliberated upon only at an\nextraordinary session of the General Assembly, specially convened for that purpose\nin accordance with the provisions of Clause 1 of Article 8, and notice convening\nsuch an extraordinary session, together with the proposals, shall reach members\n9"
}