{
  "id": "d499-108",
  "text": "EXCERPTS FROM REPORT OF THE PROGRAM COMMITTEE\nMr. Francisco Trinidad, Chairman\nSaturday, May 21, 1960\nAfter a general discussion of the draft agenda leading to a consolidation of the differ¬\nent proposals therein submitted by the participating organizations, the Program Com¬\nmittee adopted the following revised agenda:\n1. Promotion of regular exchange of broadcast programs and materials (Radio & TV)\na) News and information.\nb) Educational programs, i.e. school broadcasts, farm broadcasts, adult education.\nc) Musical and folklore programs and natural sounds.\n2. Joint projects\na) Asian folklore forum on the air.\nb) Establishment of Asian prizes in various fields of broadcasting.\nc) Plan to hold the Asian Music Festival through the exchange of recordings.\nd) Request to NHK to compile a classified Asian musical album.\n3. Training of staff\na) Survey of training facilities in Asia for programing and engineering staffs and\nthe collection of data on such facilities.\nb) Exchange of engineering and programing staffs.\nc) Joint training of staff.\n4. Questions of copyright in broadcasting\na) Exchange of up-to-date information on copyright in the different Asian coun¬\ntries.\nb) Rules of copyright involved in the exchange of programs.\nThe revised agenda were well and thoroughly deliberated on. The discussions were\nlively and after two sessions, the Committee wrote the following recommendations:\n1. On the matter of promoting regular exchanges of programs and materials (Radio\nand TV), the committee decided to submit the following recommendations to the\nJoint Committee:\na) That all participating organizations of the conference take advantages of the\noffer of NHK to serve as a central monitoring and disseminating point for the\npurpose of exchanging news among themselves. The Committee received with\ngratitude this offer by NHK. The Committee also recommends that participat¬\ning organizations supplement this exchange of news with exchange of infor¬\nmation through bulletins and background material sent directly from one\norganization to another.\nb) That exchange of educational programs on a bilateral basis among participat¬\ning organizations be expanded.\nc) That expansion of exchange in the field of musical and folklore programs and\nrecordings of natural sounds be encouraged.\n2. On the subject of joint projects, the Committee recommends:\na) That the idea of an Asian folklore forum on the air be accepted in principle,\nbut that this matter be referred to the next conference for consideration.\n16"
}