{
  "id": "d499-110",
  "text": "EXCERPTS FROM REPORT OF THE ENGINEERING COMMITTEE\nMr. Kirpal Singh, Chairman\nSaturday, May 21, 1960\n1. The Committee decided that:\na) The name, Technical Committee”, be changed to “Engineering Committee”,\naccording to the decision reached at the pre-conference meeting.\nb) The agenda items submitted by absentee organizations should also be taken\nup for discussion.\nc) The subjects of similar nature be discussed together, and discussion be con¬\nducted in the following order: 1-1), 3), 4), 5), 8), 2), 6), 9), 7), 2 and 3.\n2. Proceedings:\nItem 1— (1) Creation of an Asian Committee.\nThis is essentially a problem to be solved by competent administrative\nauthorities, but it was agreed that the exchange of information pertain¬\ning to the allocation of frequencies would create the foundation for\nfuture reciprocal cooperation. The Indian representative said that\nthere was a need for exchange of information on the projected fre¬\nquency schedules as well.\nThe consensus of opinions was that the time is not yet ripe for the\ncreation of an Asian Committee as the center intended for the coordi¬\nnation and sharing of frequencies. Concrete methods of cooperation\nin this respect must be worked out after watching the developments\nfollowing the enforcement from the coming September of a new system\npromulgated at the ITU Conference.\nItem 1—(3) Exchange of information and data on the existing conditions.\nThe Japanese delegate made a detailed report on the radio and televi¬\nsion facilities in Japan.\nQuestions from the Indian and Malayan representatives followed, and\nthey stressed the importance of exchanging various data and informa¬\ntion, for example, on ionospheric propagation. In response to the re¬\nquest from the Indian and Malayan representatives, the Japanese dele¬\ngation declared that they will endeavor to distribute English versions\nof their technical publications among Asian countries.\nItem 1— (4) Exchange of reports on shortwave reception.\nJapanese delegates dwelt upon the present state of the exchange of\nreception reports with Asian countries. It was urged by the Japanese\ndelegates that the member countries should exchange reception reports\nonce a month at least, and also that in case of serious reception deteri¬\noration, they should promptly exchange detailed reports as well as the\ntapes clarifying the actual reception conditions.\nIt was also agreed that more quantitative elements should be adopted\nin the codifying method.\n18"
}