{
  "id": "d499-115",
  "text": "Secondment of Foreign Staff for External Broadcasts\n6. With regard to the secondment of foreign staff for external broadcasts, the Con¬\nference feels that arrangements should be made bilaterally.\n7. The Conference acknowledges the importance of the efficient exchange of recorded\nsound programmes between participating countries and agreed that this exchange\nof recordings should be done in accordance with C.C.I.R. technical standards,\npreferably employing a speed of ll/2 inches per second.\n8. Regarding the assignment of frequencies (which is the responsibility of the Gov¬\nernments concerned), it is suggested that countries neighbouring on each other\nmay form into groups and thus prepare frequency assignment proposals for mutual\nbenefit before presenting them for consideration to the International Frequency\nRegistration Board through the proper channels.\n9. Participating countries of the Asian region shall encourage the exchange of tech¬\nnical personnel for training purposes and also the interchange of technical in¬\nformation for mutual benefit, and to this end every assistance will be offered to\nfacilitate such exchange.\nII. RESOLUTION ON THE ESTABLISHMENT OF AN ASIAN BROADCASTERS’\nUNION\nWe, the representatives of the National Broadcasting Organizations of the countries\nnamed hereunder, participating in the Fourth Asian Broadcasters’ Conference, resolve,\nsubject to the approval of the ultimate authorities to whom we are responsible in our\nrespective countries, to form an Asian Broadcasters’ Union.\nWe resolve, further, in order to implement the aforesaid resolution as soon as possible,\nthat a drafting committee, comprising representatives of the national broadcasting\norganizations of India, Japan, Malaya, Pakistan, the Philippines, United Arab Republic\nand Vietnam, be directed to prepare a draft constitution of the Asian Broadcasters’\nUnion for submission to the Fifth Conference.\nCountries adhering to these resolutions are as follows:—\n1.\nAustralia\n9.\nNew Zealand\n2.\nChina\n10.\nPakistan\n3.\nIndia\n11.\nPhilippines\n4.\nIndonesia\n12.\nSaudi Arabia\n5.\nJapan\n13.\nThailand\n6.\nKorea\n14.\nTurkey\n7.\nLaos\n15.\nUnited Arab Republic\n8.\nMalaya\n16.\nVietnam\nBurma has not been included in the list on the request of its own delegation.\nIII. RESOLUTION ON DATE AND PLACE OF THE NEXT MEETING\nThat this 4th Asian Broadcasters’ Conference accept with gratitude and appreciation\nthe kind invitation of the Government of the Republic of Korea to hold the 5th Asian\nBroadcasters’ Conference in Seoul on or about May 16, 1963.\n23"
}