{
  "id": "d499-116",
  "text": "IV. RESOLUTION ON APPOINTMENT OF LIAISON OFFICERS\nThe 4th Asian Broadcasters’ Conference recommends participating organizations to\nappoint a Liaison Officer in each organization in order to smoothly carry out activities\nof the Conference.\nV. RESOLUTION ON UNESCO ACCREDITATION\nThat the Secretary-General notify the Director-General of the UNESCO of the decision\nof the Asian Broadcasters’ Conference to be accredited to the UNESCO on the basis\nof mutual information relationship under category C of the Directive Concerning\nUNESCO’s Relations with Non-Governmental Organizations.\nVI. RESOLUTION ON JAMMING OF BROADCAST TRANSMISSION\nThe Conference deprecates the jamming of broadcast transmissions and calls upon the\nUnited Nations and other international agencies to take appropriate action against\nthis harmful practice.\nVII. RESOLUTION ON ETHICS OF OVERSEAS BROADCASTING\nWe, the representatives of the National Broadcasting Organizations participating in\nThe Fourth Asian Broadcasters’ Conference, recognize that the highest aim of broad¬\ncasting to other countries is to promote enlightenment, understanding and goodwill\nbetween peoples.\nWe believe that broadcasts to other countries should disseminate objective news and\ninformation and project the culture of the country and its point of view on interna¬\ntional affairs but we reject as unprofessional and unethical the directing of broadcasts\nto other countries which deliberately aim to suppress or distort truth. It is further\nagreed that this resolution should be incorporated in the Constitution of the proposed\nAsian Broadcasters’ Union.\nVIII. RESOLUTION ON BROADCASTING CODE\nThe 4th Asian Broadcasters’ Conference adopts the following BROADCASTING\nCODE:\nWe recognize the immense power of Radio and Television for both good and evil and\nthe solemn responsibilities thus placed upon all broadcasters;\nWe believe, therefore, that the following cardinal principles should be enshrined in the\npolicy and practice of all Broadcasting and Television organizations:\nTo ensure the objective presentation of news and fair and unbiased comment;\nTo promote the advancement of education and culture;\nTo raise and maintain high standards of decency and decorum in all programmes;\nTo provide programmes for the young which, by variety and content, will inculcate\nthe principles of good citizenship;\nTo promote communal harmony, religious tolerance and international understanding;\nTo treat controversial public issues in an impartial and dispassionate manner;\nTo respect human rights and dignity.\n24"
}