{
  "id": "d499-13",
  "text": "2\nJf/8\nbeing convinced that the grant will enable the Secretariat to extend\nand make more valuable its services to members,\nThe General Assembly\nrecords its very deep and sincere appreciation of this most generous\naction of the Ford Foundation.\n4*4. Realising the value to the ABU of closer collaborating with FAO in the\nuse of radio and television to stimulate increased production of\nfood and to improve the efficiency of the utilisation of existing\nfood resources,\nThe General Assembly\nwarmly welcomes and expresses its very sincere appreciation of the action\ntaken by FAO in granting Specialised Consultative Status to the\nABU.\n4,5* Recognising the value to the ABU of close collaboration with the ITU\nconcerning the engineering aspects of radio and television,\nparticularly in relation to the best use of the frequency spectrum\nand the development of the most effective techniques,\nThe General Assembly\nwarmly welcomes the decision of the ITU to admit the ABU, in an advisory\ncapacity, to the work of the C.C.I.R., and\nexpresses its sincere gratitude for the action of the ITU in granting the\nABU exemption with regard to the costs normally involved in\nparticipation in ITU Conferences and in the work of the C.C.I.R.,\nsubject to reciprocity.\n4*6, Having been informed of the grant made by UNESCO, through the Government\nof Hew Zealand, for the purpose of enabling some of the ABU’s members\nto be represented at the General Assemblies in 1967 and 1968,\nThe General Assembly\nrecords the deep gratitude of its members, particularly those concerned,\nto UNESCO for its generous action which ensures that the General\nAssemblies in the two years concerned are as fully representative\nas possible;\nexpresses its sincere appreciation to the Government of Hew Zealand for\nits action in agreeing to submit an application to UNESCO regarding\nthis grant and for having acted so promptly in making the\nsubmission at very short notice, and\nexpresses its warm appreciation for the extensive and ready assistance\ngiven by the HZBC which handled the detailed arrangements regarding\nthe use of the UNESCO grant.\n4*7• Recognising the immediate and pressing need for further staff training\nfacilities pending the establishment of the proposed Broadcasting\nTraining Institute,"
}