{
  "id": "d499-14",
  "text": "The General Assembly\nrecords the warm gratitude of the ABU to a number of organisations\nwhich have provided additional staff training opportunities in\n1967 including\n(a) NHK and the ABC both of which enabled a substantial number\nof ABU members to participate in training courses during the\nyear and have offered to provide further extensive opportuni¬\nties for attending training courses in 1968, including all\ntravel costs and living-expenses^\n(b) the Centre of Educational Television (CETO) and Radio\nSingapura who jointly organised a successful course in\nEducational Television held in Singapore in February/March\n1967;\n(c) The BCC which arranged an important Chinese Language Programme\nSeminar in Taipei during November 1967;\n(d) The Federation of Australian Commercial Broadcasters for\nproviding a second Fellowship in Commercial Broadcasting\nand generously offering its third successive annual Fellowship\nin 1968, and\n(e) the BBC and the Thompson Foundation for providing opportunities\nfor training to a substantial number of officers on the\nstaffs of ABU members.\nBeing aware of the demonstrated potential of television to make a major\ncontribution to the acceleration of national development in\nthe countries of Asia and the Pacific, and\nRecognising that television will be unable to realise its full potential\nuntil television receivers can be made available for community\nviewing in every centre of population,\nThe General Assembly\nrequests the U.N. and its appropriate agencies and ECAFE to carry out\na feasibility study on low-cost television receivers which would\nbe simple in operation and maintenance and suitable for the\nwidest use in the developing countries of Asia and the Pacific.\nRecognising the vital importance to broadcasting organisations of copyright\nlegislation which takes full cognisance of broadcasting needsj\nhaving listened with special interest to a brilliant exposition on the\nsubject of copyright and neighbouring rights given by Dr. George\nStraschnov, and\nbeing aware of the need, in those countries which have not enacted\ncopyright legislation or v/hich are contemplating a revision of\nexisting copyright legislation, for advice on this little understood\nand complex subject,\nThe General Assembly\ndirects that an approach be made to the EBU with a view to obtaining,\nif possible, the services of Dr. Straschnov at ABU expense in\norder that he could be made available to assist in the framing of\nappropriate legislation in those countries where this subject is\ncurrently under consideration."
}