{
  "id": "d499-15",
  "text": "4\nN/8\n4.10. Having heard a report, presented by an expert in copyright of world\nstanding, on the trend in modern copyright legislation*\nbeing aware that the manufacture of commercial gramophone records does\nnot involve any creative effort justifying copyright protection,\nand\nhaving found that the broadcasting of such records is the best way of\npromoting their sale to the public,\nThe General Assembly\nrecommends that ABU members should exert their fullest efforts?\n(a) to prevent the granting of a performing (broadcasting)\nright to the manufacturers of commecial gramophone records\nin their national legislation?\n(b) to prevent the accession of their respective countries to\nthe Convention on the so-called \"neighbouring rights\" signed\nin Rome in October 1961.\n4.11. Having heard a report, presented by an expert in copyright of world\nstanding on the present state of the two major copyright\nConventions?\nhaving noted that the Stockholm Act of the Berne Convention, which includes\na Protocol regarding developing countries, has not yet been ratified\nor acceded to by any of the more advanced countries, and\nhaving recognised that until the majority of the advanced countries ratify\nor accede to the Stockholm Act there would be no advantage to\ndeveloping countries in becoming party to either of the two major\ninternational copyright Conventions,\nThe General Assembly\nrecommends that ABU members, in those developing countries which are\ncontemplating accession to an international copyright convention,\nshould promote the advisability for the time being of acceding to\nthe International Copyright Convention as being the more appropriate\nfor such countries.\n412. Having heard the outstanding contributions to the success of the\ndiscussions of the Legal and Administrative Committee made by\nProfessor H. Brack, Mr. P.S. Raman, Dr. G. Straschnov and\nMr G.H. Stringer,\nThe General Assembly\nrecords its warm appreciation of the contributions of these gentlemen\nwhose respective addresses had obviously involved extensive\nresearch and careful preparation, and\nexpresses its sincere gratitude to the EBU for having made it possible\nfor Professor Brack and Dr. Straschnov to participate in this\nfirst and very valuable inter-Union project in which the\nABU has been involved."
}