{
  "id": "d499-19",
  "text": "That Study Group 1 appointed previously to investigate questions concerning\ninterference in the medium frequency band and to undertake field measure¬\nments to secure data regarding long distance propagation of medium\nfrequency signals should continue its present work, UHK continuing to\nprovide the Chairman.\nThat, considering the wide use of the tropical frequency band for\nbroadcasting in the Asian region, the terms of reference of Study Group 1\nare hereby extended to include investigations into interference in the\nhigh frequency band on frequencies below 6 MHz.\nThat the proposal of the Engineering Committee regarding the measuring of\nsignals from distant medium frequency transmitters, involving the purchase\nof equipment to be installed at Klang (Malaysia), be further investigated\nand a revised recommendation thereon be submitted to the Administrative\nCouncil for consideration at its next meeting.\nThat, considering the increasing use of videotape as a medium for interna¬\ntional exchange of programmes, a Study Group is hereby appointed to prepare\nrecommendations in regard to standard leaders f©r videotape recordings\nfor consideration at the next General Assembly, the KBS (Korea) providing\nthe Chairman.\nThat, considering the wide and increasing use of cinefilm for international\nprogramme exchanges, a Study Group is hereby appointed to prepare recommenda¬\ntions in regard to the standard densities and associated characteristics\nof such film for consideration at the next General Assembly, the ABC\n(Australia) providing the Chairman.\nThat, considering the increasing use of the term \"HERTZ” for the unit of\nfrequency in place of the term \"cycles per second\" previously used, and\nthe recommendations made by the CCIR in regard to the use of this term,\nthe ABU hereby adopts the terms Hertz, KHz, MHz etc., for use in all\nofficial documents.\nThat, when the ABU is represented at international conferences at which\nimportant technical issues are to be considered, the delegation should\ninclude an engineer with experience in the subject to be discussed.\nThat, re-affirming the principle stated at previous General Assemblies,\nwhen the delegation of a member organisation consists of more than one\ndelegate, it is considered desirable that at least one of the delegates\nshould be an engineer.\nThat Study Group 2 on Training and the Study Group on Space Communication\nshould continue their investigations.\nThat the General Assembly confirms the decisions made by the ABU Administra¬\ntive Council, acting on behalf of the General Assembly, at its Third\nMeeting in July 1967 and at its Fourth Meeting in October 1967*"
}