{
  "id": "d499-34",
  "text": "August 17, 1967\nSir Charles Moses, Secretary-General\nAslan Broadcasting Union\nBox 3636, O.P.O.\nSydney, Australia\nDear Sir Charles;\nX have been a long time in getting hack to you on your gracious letter about\npossible arrangements for MAES to be an Associate Member of AHJ. Believe me, my\ntardiness In response is not due In any measure to lack of Interest; It is due\nsolely to the fact that I have not previously been in a position to give you a\ndefinitive answer. As I know you are aware, a non-profit educational organization\nsuch as this never has sufficient money and we have had an extraordinary drain on\nresources recently in connection with the work that needed to be done in preparing\ntestimony, supplyVitnesses, and undertaking other appropriate activities in foster¬\ning the passage of the Public Broadcasting Act. This piece of legislation, if en¬\nacted, will provide funds for construction and modification of TV and radio facilities\nand will accord operating and program dollars to stations for quality live intercon¬\nnection for distribution. It is the legislative extension of the recommendations of\nthe Carnegie Commission on Educational Television and will have profound effect on\nthe development of educational broadcasting in the United States. The bill has passed\nthe Senate, has been reported out of the House Interstate and Foreign Commerce Committee,\nand will come to a vote in the House of Representatives within the next two or three\nweeks. Keep your toes crossed for us!\nI *m telling you this by way of explaining the fact that my Board of Directors has been\nleary of committing any amount of our scant resources for \"new” activities. It en¬\ndorsed the idea but, in effect, told me to go out and find the money. I am happy to\nsay that I have now been assured that such funding will be forthcoming for at least\ntwo years and by that time, I am sure we will be able to build this into the regular\nbudget.\nI am appreciative of your efforts to work for modifying the statutes so that they can\nbe adjusted to take care of our special situation. The ten-unit system at $100.00\nper unit would seem to be Just about right. To put it another way, it is all the\ntraffic will bear!\nI realize that you had hoped to take this matter up with the Administrative Council\nat its meeting in Bangkok and do not know —since you never heard from me -wtfhether\nyou went ahead with this matter. If you did not get the endorsement then, I assume\nyou will have to wait and bring the matter up at the October meeting. If you do have\nthe endorsement, please send me the accessary forms so that we may apply officially\nfor an Associate Membership in ABU."
}