{
  "id": "d499-36",
  "text": "ASIAN BROADCASTING UNION\nBOX 3636. G.P.O.,\nSYDNEY.\nOFFICE OF THE SECRETARY-GENERAL\nCABLE ADDRESS: ASBUN. SYDNEY\n11th May 1967\nDear Mr Harley,\nSince we met in Paris I have been giving a good deal of thought to the question of\nNAEB’s associate membership of the ABU. As you know I am anxious to make this\npossible because I believe your organisation can make a valuable contribution to\nour work and I realise that you too, feel much the same way.\nAs I see it, the best way this end could be achieved would be to amend Article\n15(3a) of the Statutes along the following lines:\n’’Contributions:\nAssociate members shall pay no subscription but shall contribute to the expenses\nof the Union, having regard to the services rendered by the latter and the\nfinancial resources of each of these members;\n(a) by paying, on the one hand, an annual contribution, the amount of\nwhich shall be fixed each year by the General Assembly for each\nmember considered separately; this sum will be assessed on a unit\nscale and the number of units payable will not exceed half the number\nthat would be payable as a subscription pursuant to the provisions of\nClause 2 of this Article if the said member were a full member provided\nthat the number of units for any associate member shall in no case be\ngreater than 20 and\n”(b) by paying, on the other hand, a sum to be fixed at the end of the\nfiscal year by the General Assembly in compensation for any special\nwork that might have been undertaken at their request by the ABU.”\nAs far as NAEB is concerned the important change would be the substitution of the\nwords ’’not exceed” for ’’equal to”. This would give us elasticity in fixing NAEB’s\ncontribution which the present text does not.\nThe position is that I was requested by the Third General Assembly to redraft\nArticle 15 to provide for two changes that have been approved by the Administrative\nCouncil, namely an increase in the value of the unit for full members from SUS100\nto SUS125 and an increase in the maximum number of units payable by associate\nmembers from 15 to 20. These changes with other amendments - not concerned with\nfinancial matters - will go before the Fourth General Assembly in Singapore which\nwill be held from 23-30 October next.\nAs I have to get the endorsement of the Administrative Council to projected\namendments to the Statutes - it meets in Bangkok on 3, 4 and 5 July - I would like\nto have firstly your confirmation that NAEB wishes to become an associate member\nand also an indication of the maximum number of units (at IUS100 per unit) that\nNAEB could pay. For instance, could you, in your present affluence ('!), manage\nto pay ten units, i.e. $US1000? or even more?!J\nPlease let me have your comments as soon as you can because I am at present working\non the agenda for the Administrative Council meeting.\nI need hardly say that I very much hope that we can look forward to seeing you and\nyour charming lady at Singapore in October.\nWith warm personal regards,\nMr William G. Harley,\nPresident,\nnational Association of Educational\nBroadcasters,\n1346 Connecticut Avenue,\nWASHINGTON D.C.20036,\nU.S.A."
}