{
  "id": "d499-37",
  "text": "ASIAN BROADCASTING UNION (A. B. U.)\nYOSHINORI MAEDA\nPRESIDENT\n17 August, 1967\nDear Sir,\nIn my letter to all our members convening the 1967 General Assembly of the\nABU which is to be held in Singapore from 23 to 30 October reference was\nmade to the procedure for preparing the agenda for this fourth annual meeting\nof the members of our Union.\nIn accordance with this procedure, a preliminary list of agenda items was\nsent to all ABU members early last month and they were invited to propose\nany additional subjects they considered it would be desirable to discuss at\nthe General Assembly. I have been very pleased to note that a number of our\nmembers have put forward some interesting subjects for discussion which, I\nam sure, will add greatly to the value of the meeting next October. In\naccordance with the requirements of the ABU Statutes, it is now my responsi¬\nbility to send to all members the agenda for the Fourth General Assembly,\ncopies of which are attached together with a statement (Appendix A) setting\nout summaries of the proposals put forward by members.\nIn sending the agenda to you, I would like to emphasise that we will welcome\nreports from members on any of the agenda items containing information or\nproposals that may be of assistance during the discussions at the meeting.\nI feel confident that members will provide many valuable reports to help us\nin our deliberations in Singapore.\nTo assist our hosts for the 1967 General Assembly, Radio-Television Singapura,\nI would, however, also like to remind members that their reports should reach\nSingapore by 16 September so that our host organisation will have adequate\ntime to prepare copies of the reports for distribution to members before the\nmeeting.\nI have been very pleased to learn that so many of our members have already\nindicated that they expect to be represented at the Fourth General Assembly\nof our Union and will look forward warmly to meeting, in Singapore, delegates\nfrom all parts of our vast ABU region and from other parts of the world.\nYours sincerely.\nYoshinori Maeda\nMr. William G. Harley\nPresident\nNational Association of Educational Broadcasters\nSuite 1101 Dupont Circle Bldg.\nWashington, D.C., 20036, U. S. A."
}