{
  "id": "d499-42",
  "text": "APPENDIX A\nSUMMARIES ABOUT AGENDA ITEMS\n(Note: ABU members were requested to provide a short summary\nabout each agenda item they wished to put forward and\nthese summaries are set out below*\nThe purpose of these summaries is to give all members\ninformation about proposals to be discussed at the\nGeneral Assembly, pending the completion and distribu¬\ntion of more detailed reports*)\nAGENDA ITEM 13* Exchanges of Staff Within the ABU Region\nFrom CEBC\n\"Organisations within the region would benefit considerably through mutual\nexchange of officers for periods between six months and a year. While some\nof the officers in certain organisations would be able to make use of this\nopportunity to acquire specialised knowledge in their particular sphere of\nactivities, others from more developed organisations would be able to pro¬\nvide specialised service to organisations less advanced in broadcasting,\"\nAGENDA ITEM 14. Relations between Broadcasting Unions with Common / reas of Activity\nand Membership\nFrom AIR\n\"Bringing the advantages of the knowledge and experience gained in one Union\nto the benefit of another would help broadcasting organisations and avoid\npossible areas of conflict.\"\nAGENDA ITEM 1$. Discussion on the Air of Subjects of National Importance\nFrom CEBC\n\"In many countries of the Asian region in particular, Government and the\nPublic Sector have come to assume responsibility for development over an\nincreasing area. Central planning covers almost every department of\nnational activity and is expressed more or less as general lines of policy*\nProfessional broadcasters, while being intent on employing the medium of\nradio to the fullest, are sometimes wary of bringing on the air points of\nview which may be at variance with accepted policy. The result is that\nbroadcasting, if not altogether precluded from, is certainly restricted in\ndealing with some of the most central issues of the day. Thus broadcasting,\nparticularly in the developing countries, finds itself hampered precisely\nwhere it needs to, and could make, a distinct contribution.\"\nAGENDA ITEM 19. Literacy; Food; Health: Population Explosion: Are TV and Radio\nMeeting the Challenge?\nFrom AIR\n\"These problems confront the whole region. A sharing of experience and of\nwork done in the member countries would be of help to developing countries.\"\nAGENDA ITEM 20. Competition for Young Farmers\nFrom NHK\n\"We propose that, with the cooperation of FAO an* other international"
}