{
  "id": "d499-43",
  "text": "APPENDIX A\n- 2 -\norganisations concerned, the ABU should endeavour to sponsor an inter¬\nnational competition aimed at encouraging young farmers to increase food\nproduction, in line with the recommendations made at the FAO Seminar held\nin Tokyo in 1966 and the resolution adopted at the Third General Assembly.\nAs the first step toward this objective, we propose that the ABU, in co¬\noperation with FAO, should conduct a survey of the existing local and\ninternational conferences and competitions for young farmers in various\ncountries in the ABU region as well as on the role being played by broad¬\ncasting in this region in this regard and that studies be started by the\nSecretariat on the possibilities etc. of such an international competition.\"\nAGENDA ITEM 21. Developments in Educational Radio\nFrom UARBC\n\"The UARBC proposes the holding of a regional seminar for ABU members to\ndiscuss recent developments in the field of Educational Radio Programmes.\nThis is in conformity with the recommendations of the EBU Paris Conference\non Educational Radio and Television. It was felt that educational radio\nwas riot fully discussed at the Paris Conference* as a result, the Fourth\nCommission of the Paris Conference recommended that adequate time should\nbe allocated for it to be discussed by the regional broadcasting Unions\nand we propose that this be done at the ABU*s Fourth General Assembly.\"\nAGENDA ITEM 22. Establishment of NHK International Library of Educational Programmes\n- Its Utilisation and Support by ABU Members\nFrom NHK\n\"With a view to promoting international understanding and assisting in the\nimprovement of the educational programmes of ABU members to some degree,\nwe are planning this year to establish an International Library of\nEducational Programmes. In this connection, we should like to request all\nmembers to extend their cooperation and would like to propose that ABU\nmembers suggest and discuss how the projected Library could be made most\nuseful for the benefit of member organisations.\nThe projected Library will consist mainly of TV films and videotapes, the\ncopies of which will be distributed on request to ABU members at cost.\nAGENDA ITEM 23. An Experiment in Educational Broadcasting\nFrom CEBC\n\"For well over 35 years we have had broadcasts to schools in Ceylon. In\nthe beginning these broadcasts were organised by a group of teachers but\nas from 1951, with the expansion of Radio Ceylon, schools broadcasting\nbecame a regular service of the broadcasting organisation.\nAlthough this service has provided excellent broadcasts to schools and\nTraining Colleges, recent investigations have shown that the schools are\nnot able to make good use of the programmes because of lack of radio\nreceivers, lack of suitable rooms in schools for listening and the fact\nthat the school curricula do not provide for radio listening.\nTo meet this situation, the CEBC has from 5 June of this year been\nbroadcasting educational programmes not only to schools but to homes in\nthe evening. This has resulted in an increase in the number of children\nlistening and we are now broadcasting also to University students.\""
}