{
  "id": "d499-49",
  "text": "ASIAN BROADCASTING UNION (A. B. U.)\nYOSHINORI MAEDA 31 March, I967\nPRESIDENT\nDear Sir,\nYou will know that at the Third General Assembly of the ABU held in Taipei,\nRadio and Television Singapura generously offered to act as host for the\nFourth General Assembly of our Union and that this offer was accepted by\nour members.\nIt now gives me great pleasure, as President of the ABU and in terms of\nClause 1 of Article 9 of the ABU Statutes, to convene the Fourth General\nAssembly of the ABU in Singapore for the period 23-30 October, 1967.\nI hope that this advice about the dates for this meeting will assist ABU\nmembers in making their own plans for the latter part of this year. I was\nanxious that our members should be given early information about the dates\nfor the General Assembly and Radio and Television Singapura has been most\nhelpful in examining this matter as quickly as possible. A proposed sche¬\ndule which outlines briefly the arrangements for the General Assembly\n(Schedule A) is enclosed but more detailed information will be sent to members\nlater in the year.\nWhile I fully understand that ABU members will need some time to consider the\nselection of their delegations to the General Assembly, I know that the RTS\nwould be grateful to have information about this matter well before the meet¬\ning as the RTS's staff will need to arrange hotel accommodation. A question¬\nnaire will be sent to members when they have had time to give consideration\nto this matter.\nAs members will be aware, it is one of my responsibilities as President of\nthe ABU to issue the agenda for General Assemblies and the ABU Statutes\nrequire that the agenda should reach members eight weeks before each General\nAssembly. In order to give members adequate time to consider any proposals\nthey may wish to submit for inclusion in the agenda, I am attaching copies\nof a schedule which sets out the arrangements that will need to be observed\nin the preparation of the agenda for our next General Assembly (Schedule B)#\nI believe that it may be valuable for you to have several copies of this\nschedule so that they can be made available to senior members of your staff.\nAs President of the ABU, I look forward with pleasure to our next General\nAssembly in Singapore and hope sincerely that it will be possible for all of\nour members to be represented at this important meeting.\nYours sincerely.\nYoshinori Maeda\nMr. William G. Harley\nPresident\nNational Association of Educational Broadcasters\nWashington, D.C., 20036, U.S.A."
}