{
  "id": "d499-5",
  "text": "ASIAN BROADCASTING UNION\nBOX 3636, G.P.O.,\nSYDNEY.\nOFFICE OF THE SECRETARY-GENERAL CABLE ADDRESS: ASBUN. SYDNEY\n11th November, 1965\nDear Mr. Hltrley,\nI want to thank you for your letter of 13th October, sent to me in Tokyo, and to\nsay that I am very sorry I could not reply earlier. Until the end of October I\nwas very busy with our General Assembly and since I returned to Sydney last week\nmy time has also been crowded in organising an unexpected journey overseas\non which I am to start tomorrow.\nAs I promised, I had a talk with some of our influential full members at a»\nunofficial meeting before our General Assembly and raised the question of the\noperational budget on which NAEB should be assessed if it were to apply for\nassociate membership. I found that a few of them were not happy about accepting\nNAEB*s own budget. While those who expressed doubts would have welcomed your\nAssociation as a member, they were concerned that there might be other organisations\nin the same situation and that they might therefore be setting a precedent. As\n£ had received your letter immediately before the General Assembly opened the matter\nthus had to be put before these members without their having time for preliminary\nthought, so this cautious approach was perhaps understandable.\nRather than have any division of opinion, I thought it best to let the matter\ndrop for the time being and therefore the application was not officially\nsubmitted. I personally was very sorry about this but I would particularly like\nto stress that the discussion made it clear the NAEB would be warmly welcome as\na member, the only question being that relating to the possibility of creating\na precedent# I will pursue this aspect of the matter as opportunity offers among\nthe members and I would think that by the time of our 1966 General Assembly there\nwill be no difficulty about putting forward the application with NAEB*s own\noperational budget insteadof the figure representirg the budgets of its members.\nI would very much have liked to see you again while I am overseas in the next few\nweeks but do not at presentsee how I could manage to go to Washington. I am\ngoing at this time mainly because I have been offered the opportunity of making\nthe journey at very little cost tb the ABU and, as the ABU has only a very small\nbudget for travelling, I cannot afford to miss the chance of discussing decisions\nmade at our recent General Assembly with organisations in Europe and the U.S.A.\nsuch as PAO, ITU, UNESCO, the U.N. Special Fund, the Ford Foundation and the Asia\nFoundation. It will be a very crowded trip as I have a very large amount to do,\nin many different places, in about five weeks.\n1\nI expect to be in New York from the night of 11th December to the late afternoon\nof the 16th but as I have many contacts to make there it would be difficult to\ninclude a trip to Washington without extending my absence overseas,which my wife\nwould object to as she is already not happy about lay being away until 19th December.\nShe says she will have most of the responsibilities and little of the preliminary\nfun of the festive season l\nI will keep you posted about the situation regarding your application. In the\nmeantime it would help me if you could let me know whether you know of any other\norganisations which are in fact in the exactly same situation as NAEB.\n■With kind regards,\nCHARLES MOSES\nSecretary-General\nMr. William G. Harley,\nPresident,\nNational Association of Education Broadcasters,\n1346 Connecticut Avenue,\nWASHINGTON D.C. 20036,\nU.S.A."
}