{
  "id": "d499-50",
  "text": "ASIAN BROADCASTING\nUNION\nOFFICE OF THE SECRETARY-GENERAL\nBOX 3636. G.P.O.. SYDNEY\nCABLE ADDRESS: ASBUN, SYDNEY\n7th February 1967\nI have just returned from a journey in Asia and found waiting for\nme your letter of 20 January from which I was pleased to hear that\nM.EB is still interested in joining the ABU if a means can be\nfound of dealing with the problem mentioned in your letter*\nI am glad also to know that I can look forward to seeing you again\nnext month at the EBU meeting* The ABU was invited to provide\none of the regional reports and I was asked at our last General\nAssembly to accept the responsibility for its preparation and\npresentation. With regard to the latter I will be helped by\nrepresentatives from some of our members.\nOne of the reasons for my recent journey which covered Western Asia\nwas, indeed, to collect material for the ABU report. I am now\nengaged in the task of putting together with the assistance of Bob\nHudson of NET #10 covered the Eastern countries of Asia.\nSummarising recent developments and trends of an area stretching from\nTurkey to Western Samoa is quite an assignment but we are finding\nit is an interesting task.\nIn Paris we will be able to talk about the question of NAEB being\nadmitted to the ABU on a financial basis that would be reasonable\nfrom your point of view. The main problem is that we already have\ntwo associate members, ITV in the U.K. and the Federation of Conmercial\nBroadcasters in Australia, #10 are paying contributions on^t>asis\nof the combined expenditure of their members, and we could have\nfarther members of this kind in the Asian area. These are of course\nall profit-making organisations and I agree with you that NAEB's\nsituation is different. I have not yet raised this matter again with\nour Administrative Council as I thought that the passage of time\nwould be useful but I could do so later this year. Is there anything\nin NAEB's constitution which would help in establishing a difference\nfrom associations of purely profit making stations?\nWith kind regards,\nCHARLES MOSES\nSe ere tary-Genera!\nMr William G. Harley,\nPresident,\nNational Association of Educational Broadcasters,\n1346 Connecticut Avenue,\nWASHINGTON D.C. 20036,\nU.S.A."
}