{
  "id": "d499-52",
  "text": "THIRD GENERAL ASSEMBLY\nFrom Sir Charles Moses,\nSecretary- General\nI think all present agreed that the ABU's Third General Assembly was\nan outstanding success. Delegates were unanimous in their praise of\nthe generous hospitality of the BCC, led by its President Mr. Lee Shih-\nfeng, and of the efficiency and smoothness which marked all the arrange¬\nments, whether for welcoming or farewelling delegates; for their trans¬\nportation; for the wonderful week-end tour, or for all the meetings as¬\nsociated with the General Assembly.\nThe appearance each morning of accurately typed minutes and reports\nof the previous day's meetings -- either in the delegates' own rooms or\nat their places on the conference tables -- was one striking example of\nthe BCC's splendid organisation and of the devoted hard work of the\nConference Secretariat.\nPerhaps the most important indication of the success of the meeting from\nthe point of view of the ABU itself was that fact rather than rhetoric pre¬\ndominated in the discussions of the various Committees. Delegates did\nnot talk about grandiose and impracticable projects but concentrated on\npractical proposals, appreciating the realities of the broadcasting situation\nas it exists today.\nThe selection of space communication as a special subject proved to be an\noutstanding success. The address by Mr. Istvan of COMSAT set the stage,\nand the reaction to it shown by the many questions asked by delegates during\nthe three meetings of the Committee on Space Communication were evidence\nof the great interest of all members in this exciting subject.\nThe progress which is at last being made towards the establishment of the\nlong-awaited Broadcasting Training Institute was indeed good news: the\nobvious interest in this project of UNESCO, as shown in Mr. Tor Gjesdal's\nrecent letter, and of the ITU as shown in Dr. Sarwate's address at the\nOpening Plenary Session, is an indication that the ABU has strong support\nregarding this project, for which all the delegates were very grateful.\nEspecially heartening, also, was the fact that a number of members have\nshown interest in assisting their colleagues, while we are waiting for the\nInstitute, by offering the use of their own training facilities.\nIt is good to know that, following the outstanding success of the Tokyo\nSeminar, FAO is interested in an extension of co-operation with the ABU\nand is likely to be prepared to consider the possibility of arranging further\njoint seminars and training courses. For so many ABU members effective\nFarm Broadcasting can be of enormous value by stimulating increased and\nimproved food production in their countries.\nThe amount of work done by the various Committees can be better appreciated\nwhen I mention that the total number of resolutions submitted by the Committees\n- 2 -"
}