{
  "id": "d499-54",
  "text": "*4\nmorning of the 24th October, began with an address by Mr. Lee Shih-feng,\nspeaking as President of the host organisation, the BCC, followed by greet¬\nings from Vice President-Premier Mr. C. K. Yen, Foreign Minister Dr.\nWei Tao-ming, and Education Minister Dr. Yen Chen-Hsing. General Kim\nShin, Ambassador of the Republic of Korea, spoke on behalf of the diploma¬\ntic corps, Dr. M.S.Sarwate, Secretary-General, ITU, on behalf of the\nUnited Nations and its Agencies, and Mr. Yoshinori Maeda, President, on\nbehalf of the ABU.\nThe ABU Prizes for Rural Radio Programmes and for TV Documentary\nProgrammes were awarded at the Opening Ceremony. (For details see\npage 9. )\nElection of President and Vice-Presidents\nAt the Opening Plenary Session on the afternoon of 24th October the elections\nfor the President and Vice-Presidents were held.\nMr. Yoshinori Maeda of NHK was re-elected as President. Tuan Syed\nZainal Abidin, Director-General of Information and Broadcasting, Malaysia,\nand Mr. Gilbert E. Stringer, Director-General of the NZBC, were elected\nas Vice-Presidents.\nElection of Administrative Council Members\nAn election was also held at the Opening Plenary Session to fill the seats\non the Administrative Council of the three Councillors whose term of\noffice had expired and as a result, the Korean Broadcasting System and\nRadio and TV Malaysia and the Broadcasting Corporation of China were\nelected, each for a term of office of three years. The ABU Administra¬\ntive Council now consists of the following nine members:\nNippon Hoso Kyokai:\nMr. Yoshinori Maeda, President (ABU President)\nNew Zealand Broadcasting Corporation:\nMr. G. H. Stringer, Director-General (ABU Vice-President)\nRadio and TV Malaysia:\nTuan Syed Zainal Abidin, Director-General, Information and\nBroadcasting (ABU Vice-President)\nAustralian Broadcasting Commission:\nMr. T. S. Duckmanton, General Manager\nBroadcasting Corporation of China:\nMr. Lee Shih-feng, Managing Director\nKorean Broadcasting System:\n(Member to be nominated by KBS)\nPhilippine Broadcasting Service:\nMr. Francisco Trinidad, General Manager\nRadio Thailand:\nMr. Prasong Hongsanand, Deputy Director-General\nTurkish Radio and Television Corporation:\nProf. Ismet Giritli, President, Executive Board of TRT\n- 4 -"
}