{
  "id": "d499-56",
  "text": "on Space Communication was established, but in view of the enormous scope,\nparticular aspects of the problem were referred to the Engineering and\nProgramme Committees.\nThe following five committees were established to study and report on the\nappropriate sections of the lengthy agenda:\nCommittee on Space\nCommunication:\nChairman - Mr. T . S. Duckmanton (ABC)\nRapporteur - Mr. Emin Hekimgil (TRT)\nGeneral Committee:\nChairman - Mr.\nRapporteur - Mr.\nLee Shih-feng (BCC)\nJ. W. Moore (SBS)\nProgramme Committee: Chairman\nRapporteur\nMr. Tadashi Yoshida (NHK)\nMr. Vu-Duc-Minh (VTVN)\nEngineering Committee: Chairman - Mr. Kee Sun Han (KBS)\nVice-Chairman - Mr. V. Kenna (ABC)\nRapporteur - Mr. Tavach Meksawan (RTH)\nFinance Committee: Chairman - Mr. Dol Ramli (RTM)\nRapporteur - Mr. Francisco Trinidad (PBS)\nThe Chairmen of the Committees reported on their discussions and recom¬\nmendations at the Closing Plenary Session on 31st October.\nRecommendations\nThe General Assembly adopted a total of some 60 recommendations sub¬\nmitted by the five Committees which included many important decisions\nand various projects to be implemented before the 1967 General Assembly.\nThe following are some of the resolutions which were made known to the\npress after the closing of the General Assembly:\n1. Space Communication\na) The ABU will strongly support any UNESCO pilot project in the\nAsian region which involves the use of space communication for\neducational and cultural purposes.\nb) The ABU will keep in close contact with other regional broad¬\ncasting unions to ensure that common viewpoints concerning\nspace communication are strongly represented.\nc) The ABU intends to seek admission to the meetings of the Inter¬\nnational Radio Consultative Committee (C.C.I.R.) of the Inter¬\nnational Telecommunications Union and also to nominate an\nengineer to participate in the work of the C.C.I.R. study groups\nconcerned with the use of satellites for broadcasting use.\n- 6 -"
}