{
  "id": "d499-58",
  "text": "4. EBU International Conference on Educational Radio and TV\nThe General Assembly resolved that the ABU should be represented\nat the Third EBU International Conference on Educational Radio and\nTelevision to be held in March 1967. A comprehensive paper on\neducational developments in the ABU region is to be presented as one\nof the major contributions at this Conference.\n5. Programme Projects\na) Joint Production of TV Programmes for Children\nAn interesting ABU programme project for 1967 resolved by\nthe General Assembly involves the sending of a joint TV film\nunit from different organisations to visit a number of Asian\ncountries to make short educational films for circulation among\nmembers and to be made available for-world-wide distribution.\nThese film programmes would be specially designed for children --\nto give children authentic information about other countries and to\nstimulate interest in, and a better understanding of other peoples,\nespecially regarding their basic similarities.\nb) TV Programme Offers\nIt was noted with appreciation that offers to provide a wide range\nof educational TV programmes at minimum cost to ABU members\nin developing countries have been made by ARD (Germany), ITV\n(United Kingdom) and NHK (Japan).\n6. Other Projects\nA new development with the ABU is an interest in commercial\nbroadcasting; most of the ABU members, including a majority\nof national broadcasting organisations, have, or are planning to\nhave, some form of commercial service. To cope with this\nsituation, the ABU Secretariat will provide the means by which\nsuch members can secure information in this field from those\nmembers with long experience in commercial broadcasting.\nFourth General Assembly\nThe Fourth General Assembly will be convened in Singapore in October\nor November 1967.\nProceedings of the Third General Assembly\nThe full Proceedings of the Third General Assembly will be printed and\ndistributed to members as soon as possible. In the meantime, important\ndocuments will have already been sent from Taipei to the members who\nwere not able to attend.\n- 8 -"
}