{
  "id": "d499-59",
  "text": "The Proceedings for the Taipei meeting will be in the following two\nvolumes:\nVolume I will contain the documents about the Opening and Closing\nPlenary Sessions and those about the Committee on Space Communication\nas well as the General, Programme and Finance Committees and will\nalso include the minutes and Report of the Engineering Committee but\nnot the documents discussed by that Committee. Volume I will therefore\nprovide a complete record of the Third General Assembly for those who\nare not specially interested in engineering matters.\nVolume II will contain the minutes and Report of the Engineering Com¬\nmittee and all the documents that were discussed by the Engineering\nCommittee. This Volume is therefore intended for use by the engineering\nstaffs of ABU members.\nThe host organisation for the Third General Assembly, the BCC, will be\narranging for the Proceedings to be printed and for copies to be distri¬\nbuted to members. But to assist the BCC, the Secretariat will send to\neach ABU Liaison Officer a questionnaire on the number of copies of\nVolume I and Volume II required by each organisation.\nABU Prize\n1. Rural Radio Programme Prize\nThere were nine entries for the ABU Prize for Rural Radio Programmes.\nThe Radio Jury reported that the entries were of a high standard and\nthat narrow margins separated the leading entries. The Jury, in\nfact, had to examine both the scripts and the general production\nstandards very carefully to determine the winner.\nThe unanimous decision of the Jury was that the most outstanding\nentry was the programme entitled \"Joint Cultivation\" produced by\nthe Broadcasting Corporation of China. This programme (29 minutes\n30 seconds) was broadcast on 16th June by eight stations over the\nsecond network of the BCC in a serial known as \"Happy Farmers\".\nIt opens with weather and market reports, followed by news of\ngeneral interest to farmers and questions and answers on farming\ntechnique, notes on the use of insecticides and ends with an inter¬\nview with an expert on the advantages and results obtained by joint\ncultivation.\nSpecial commendation was given to NHK's entry. The Radio Jury\nreported that the Jury members were all agreed that NHK's entry,\n\"Early Bird\" was a very attractive programme, demonstrating a\nhigh standard of professional production.\n- 9 -"
}