{
  "id": "d499-60",
  "text": "The Radio Jury comprised:\nChairman: Mr. C.R. Carson, Past President, FACB\nMember: Mr. G. V. de Freitas, Director, BBS\n\" Mr. Morio Tateno, Director, Overseas Broad¬\ncasting Department, NHK\n\" Mr. J. W. Moore, Director of Broadcasting, SBS\n\" Mr. Vu-Duc-Minh, Chief, Programming Service, VTVN\n2. Television Documentary Programme Prize\nThere were five entries for the ABU Prize for TV Documentary Pro¬\ngrammes, the quality of which was described by the TV Jury as of\n\"highest level\". It was most difficult for the TV Jury to choose the\nwinning entry.\nThe Jury decided that the programme most in accordance with the\naims of the ABU Prize in promoting international understanding was\nthe production by the Canadian Broadcasting Corporation titled \"A\nView from Geneva\". This film, introduced by Princess Grace of\nMonaco, was a sensitive and wide-ranging survey of the aims and\nwork of the International Red Cross.\nThe TV Jury also considered that the entry from NBC \"Siberia: A\nDay in Irkutsk\" deserved a special commendation.\nThe members of the TV Jury were:\nChairman: Mr. Tae Ro Yoon, Chief, Broadcasting Management\nSection, KBS\nMember: . Lord Windlesham, Deputy General Manager,\nRediffusion Television Ltd.\n(Representing ITV)\n\" Mr. George A. Graham, Jr., President, NBC\nEnterprises, NBC\n\" Mr. Loo Koon Fan, Chinese Language Programme\nOrganiser, RTS\n\" Mrs. Seniha Eke, Member of Executive Board, TRT\nThe contents etc. of the entries for both the Radio and TV Prizes will be\npublished in the next issue of the Newsletter.\nWith regard to the ABU Prize, it was decided at the Third General Assembly\nto add a further prize to the existing ABU Radio and TV Prizes. The new\nPrize, to be known as the ABU Special Prize of $US 500. 00, will be awarded\nto the best low-cost television documentary, showing outstanding ingenuity\nand imagination, entered in the ABU TV Prize Competition. It is intended\nto encourage improved standards of production by ABU members in develop¬\ning countries.\n10 -"
}