{
  "id": "d499-64",
  "text": "NEWS AND INFORMATION\nR-Mio Australia Announcer Attending Bangkok Fair (From ABC)\nMiss Rudi Chakorn, a translator/announcer in the Thai Service of Radio\nAustralia for the past six years, will attend the first Asian Inter¬\nnational Trade Fair in Bangkok,Thailand, from November 17th to December\n10th. She will prepare programmes on the Fair for Radio Australia,\ninterview visiting personalities, and be a hostess for Radio Australia's\ndisplay in the Australian Pavilionc\nAfter the International Trade Fair, Miss Chakorn will report the Asian\nGames, also being held in Bangkok, starting December 9th. She will then\ntake an extended holiday in Thailand before returning to Australia,\nRadio Australia Makes Programme for NHK (From ABC)\nRadio Australia's Transcription Service, at the request of NHK, recently\nprepared a special children's programme for the NHK feature, \"Children\nof the World in a Circle\".\nThe programme featured the Preparatory School Choir of Geelong College,\nan independent school for boys in the provincial city of Geelong, about\n50 miles from Melbourne.\nThe programme had an international flavour, with the boys singing a 400-\nyear-old Japanese children's song about a rabbit enjoying the autumn\nweather,.a children's chorus by the German composer Carl Orff, and two\nsongs written by the Geelong College boys themselves.\nThe programme ended with a message of goodwill read by student Jeffrey\nKiddie, aged 15, to the children of Japan on behalf of his school and\nthe children of Australia. Although specially prepared for NHK, the\nprogramme was also broadcast over Radio Australia.\nGandhi Centenary Programme (From AIR)\nThe 2nd October, 1969, will be a hundred years since Mahatma Gandhi was\nborn in Porbander, Gujarat, India. To celebrate his Birth Centenary,\nAll India Radio has planned a series of broadcasts to interpret the\nMahatma's message to mankind and project the values for which he lived,\ndied, namely, truth, non-violence and universal brotherhood. All India\nRadio would gratefully welcome the co-operation of broadcasting organi¬\nsations throughout the world in the planning and preparation of pro¬\ngrammes to mark the occasion.\nProminent Visitor (From Am)\nShri S. Kushkaki, President, Radio Afghanistan, visited India as a guest\nof All India Radio from 1st to 4th September, 1966.\n- 15 -"
}