{
  "id": "d499-65",
  "text": "Televising the British Parliament\n(From BBC)\nA select committee of Members of Parliament have recommended that a two\nmonth experiment should be conducted in televising the proceedings in\nthe British House of Commons in Westminster. After reviewing the results\nof the experiment, which would be conducted for Members of Parliament\nonly, the House would be invited to decide whether or not permanent\narrangements should be made.\nContinuous live broadcasting of proceedings is thought impracticable and\nundesirable, but a daily feed of all proceedings could be made available\nto the BBC and ITA to be recorded and edited by them, for use in their\nprogrammes. The Committee think the most suitable time for the experi¬\nment would be between Christmas and Easter 1967,\nThe report, which makes these recommendations, will be debated in the\npresent session of Parliament.\nRadio Play Commissioned by the European Broadcasting Union (From BBC)\nThe first radio play to be commissioned by the European Broadcasting\nUnion will be written by the English writer Francis Durbridge, author\nof many BEC radio and television serials. It will be called ’La\nBoutique’.\nThe play is a thriller which will be serialised in five, 30-minute epi¬\nsodes, and it will be broadcast exclusively by the participating countries\nduring a two-year period starting in May 1967. The BBC Light Programme\nwill broadcast it for British listeners. It is an adventure story with\nan international background, designed to appeal to radio audiences in\nmany different countries, among them, Britain, Austria, Italy, Germany,\nBelgium, Norway, Sweden, Switzerland, Turkey, Greece, Poland, Finland,\nCanada, South Africa and Australia.\nFrancis Durbridge is the creator of ’Paul Temple’, central character in\nthe long-running radio series, whose advantures are still being followed\nby listeners in many countries overseas.\nDurbridgefs radio and television serials have been broadcast in BBC and\nlocally-produced versions by very many stations all over the world. On\ntelevision the BBC has presented 13 adventure serials by Durbridge.\nCBS - Kol Yisrael Agreement Signed\n(From CBS)\nThe Columbia Broadcasting System has signed an agreement with the Israel\nBroadcasting Authority calling for consultation and advisory services in\nthe creation of television facilities for Israel. The agreement became\neffective on November 1,\nMerle S. Jones, President, CBS Television Stations Division, signed the\n- 16 -"
}