{
  "id": "d499-66",
  "text": "agreement in his New York office. The Israel Broadcasting Authority\nexpects to begin the television service in 1968.\nTopics from ITV\n1. “Double Your Money\" in Moscow\nRediffusion*s veteran quiz-game \"Double Your Money\" recently visited\nMoscow. At the invitation of Soviet TV the production team staged two\nprogrammes before a Russian audience in the Hall of Friendship. With\nthem to Moscow travelled six British competitors, three men and three\nwomen, to appear side by side with English-speaking Soviet citizens.\nThe six were chosen from 13,563 applicants.\n2. A New Public Service: Training for Television\nScottish Television is to give leaders in Scottish industry, the Public\nServices, Trades Unions, Commerce, Professional Associations and Local\nGovernment a series of one-day courses in TV appearance.\nThe scheme has been designed as a public service, and will involve no\nfees. The representatives of these organisations are often called on at\nvery short notice to present to millions of TV viewers opinions or re¬\nactions which could be crucial for their enterprise.\nSix candidates included in any single course will be from different\norganisations. They will be given instruction in such qualities as pro¬\nnunciation, voice modulation, posture, speech content, etc.\nThe \"trainees\" will have an opportunity to quiz their instructor on any\naspect of TV appearance techniques. Later, they will all be interviewed\nin studio conditions by a regular Scottish Television interviewer. They\nwill also take part in a television discussion, and both individual inter¬\nviews and discussions will be played back on close-circuit TV for con¬\nstructive criticism from experts.\n3. Evening of British Television for Germany\nOn the 8th October last Granada TV accepted an invitation to provide a\ncomplete evening of British Independent Television for Viewers of\nNordeutsche Rundfunk Channel 3 in the Hamburg area. This Saturday evening\nentertainment which was introduced in German by a member of the Granada\nstaff, ran for almost 4^ hours and featured the programmes transmitted by\nGranada in the North of England on the previous Wednesday.\nThe German company had in the past few years transmitted complete evenings\nof television from foreign stations, but this was the first occasion on\nwhich programmes had been taken from Britain.\n- 17 -"
}