{
  "id": "d499-68",
  "text": "British Broadcasting Corporation\nMr. David Attenborough, Controller, BBC-2\nMr. Sydney Newman, Head of Drama\nMr. James Redmond, Senior Superintendent Engineer\nWestdeutscher Rundfunk (WDR - Cologne)\nDr. Hans Joachim Lange, Programme Director (TV)\nDr. Gunter Rohrbach, Assistant\nMr. Horst A.G. Krieger, Chief Engineer (TV)\nNorddeutscher Rundfunk (NDR - Hamburg)\nMr. Gerhard Schroder, Intendant\nDr. Dietrich Schwarzkoph, Director of TV Programme\nDr. Hans Wilhelm Vahlefeld, Permanent Correspondent for\nGerman Radio and TV in the\nFar East, Hong Kong\nVast Expansion For Radio in East Malaysia (By Felix Puerto, RTM)\n\"The lack of communications poses a problem in East Malaysia and the\npeople living in the interior place great reliance on Radio as a means of\ninformation. Our policy therefore gives priority to the development of\nthis media.\" This was stated by the Director-General of Information and\nBroadcasting, Malaysia, Tuan Syed Zainal Abidin, in his address at a\nrecent Rotary Club luncheon in Kuala Lumpur.\nThe development comprises the acquiring of land in Kuching to provide for\nextension of the present Broadcasting House. At the moment temporary\nextensions have been made. Meanwhile a new transmitting station has been\ncompleted and is*now in operation, providing better radio coverage of\nSarawak. Land has also been acquired for the setting up of a Regional\nStation at Limbang which it is hoped will be in operation by early 1968.\nSimilar regional stations will be set up at Sibu, Simmanggang, Bintulu,\nMini and Kapit. The total amount to be expended on these schemes will\ncome to $2 million.\nIn Sabah, in order to improve the relay of broadcasts from the Federal\nCapital, plans have been drawn up for the establishment of a receiving\nstation which will cost approximately $272,000, and is expected to be\ncompleted before the end of next year. In order to further improve and\nsupplement the signals from the VHF/FM lOOkW transmitting station on\nMount Kinabalu (probably the only transmitting station in the world that\nhas been built on the slopes of a mountain at an altitude of 9,000 feet\nby having building materials and equipment flown in by helicopter),\nregional medium—wave stations of 10 to 20 kW power are in the process of\nbeing established at Sandakan, Tawau, Lahad Datu and Kudat. In Tenom, a\nsingle network transmitter is now in operation and another transmitter\nwill be installed in the near future for second network operation. In\nJesselton, work is in hand for a new transmitting station which is\nexpected to be completed in 1968. The Jesselton studios and offices will\n- 19 -"
}