{
  "id": "d499-72",
  "text": "6. Television Field Trials of 405-line and 625—line system in\nthe U.H.F. and V.K.F. bands 1957-8\n7. Television UHF Trials 1962-3, Results of field trials with\n625-line monochrome and colour television systems: a contri¬\nbution to the planning of a four-programme transmitter network.\n8. Television Engineering Volumes 1 - IV\n9. Microphones\n10. Studio Engineering for Sound Broadcasting\n11. Sound and Television Broadcasting - General Principles\n12. High-Quality Sound Production and Reproduction\n13. Principles of Transistor Circuits\n2. The Dynalens\nThe BBC Engineering Division has recently acquired a device called a\ndynalens, which provides a marked reduction in unwanted camera movement\nwhen a camera is mounted on an unstable platform, or is being buffeted by\nwind. The device is more fully described in a paper entitled \"A GYRO-\nSTABILISED LENS SYSTEM\" by Benson and Whittaker, published in the Journal\nof the Society of Motion Picture and Television Engineers, Vol 74, No. 10,\nOctober, 1965.\n3. BBC Demonstration of Stereophony in Paris\nFor the first time, the BBC was represented at the International Festival\nof Sound held in Paris early this year. One of the principal items at the\nConference was a demonstration of stereophony. The BBC contribution aroused\nmuch interest especially the recording of Benjamin Britten’s \"War Requiem\",\nrecorded in Westminster Abbey.\n4. Pneumatic Masts - A Novel Warning System\nThe BBC Research Department uses pneumatic extending masts on its field-\nstrength measuring vehicles and it is advisable that the driver should\nknow whenever the mast is raised above its ’rest’ position. The solution\nadopted is to place a long cylindrical magnet inside the top section of\nthe mast, with a reed switch fixed adjacent to the mast on the inside roof\nof the vehicle. The switch is, therefore, operated when the magnet is in\nproximity to it and causes a flashing red light to show on the dashboard\nin the driver's compartment. If an attempt is made to move the vehicle\nwhen the red light shows 'danger' a warning bell rings immediately the\nhand-brake is released.\nNotification of Frequency or Power Changes\nAt the Third General Assembly, Taipei, it was decided that ABU member\norganisations should notify other members of the following, for the reason\nthat there is a tendency for greater power to be used for medium frequency\ntransmitters which could result in interference being caused to existing\nservices:\n1) Any changes to the frequency or power of medium frequency\ntransmitting stations operating with a power exceeding 50 Id*/,\n2) The increase of power of any such station to more than 50 kW, and\n3) The establishment of any new medium frequency station of more\nthan 50 kW power rating.\n- 23 -"
}