{
  "id": "d499-77",
  "text": "September 23, 1965\nSir Charles Moses\nSecretary General\nAsian Broadcasting Union\nBox 3635\nSydney, Australia\nDear Sir Charles:\nPlease be assured that NAEB continues its interest in becoming an Associate\nMember of ABU. However, there are some problems which stem from the\nspecial nature of our Association which will need to be ironed out before we\ncan go forward with our application.\nFirst, Article 3 of the Statutes of the AB^, dealing with membership, stipulates\nthat \"to be a member, an organisation must produce and have general responsi¬\nbility for the programs broadcast by one or more transmitters permanently at its\ndisposal.\" NAEB does not own or control any transmitter. The members of the\nAssociation, of course, do own and operate transmitters, but we haver no direct\ncontrol or direction in their use. 1 suppose one could say that the NAEB radio\nstations which subscribe to our tape radio program service are \"at our disposal\"\nin that they select, from program materials which we offer each week, certain\nprograms which they choose to broadcast. However, we in no sense have any\ncontrol over what programs they may put on, nor do we have assurance that\nsome or even any of the programs offered by us will actually be used.\nSecond, we are concerned about the method of assessing dues. As you know,\nour operation is both non-commercial and non-governmental. This means that\nwe are dependent upon dues from our non-commercial members for support.\nOur total operating budget for NAEB annually is only $325,000. As an Associate\nMember, this would put our assessment at $150. But, if we were obliged to\nfollow the unit method of assessing dues on the *basis of combined operational\nbudgets of our members, the amount would be in excess of $35 million and put\nus in the 15 unit category, which is the maximum number of units for which\nAssociate Members of the ABU must pay. According to our understanding of the\nregulations, this would mean that NAEB would be obliged to pay annual dues\nof $1,500."
}