{
  "id": "d499-81",
  "text": "ASIAN BROADCASTING UNION\nBOX 3636. G.P.O..\nSYDNEY.\nOFFICE OF THE SECRETARY-GENERAL\nCABLE ADDRESS: ASBUN. SYDNEY\n3rd August, 1965\nI have just discovered that I have been labouring under a delusion about your\nAssociation for many months !\nEarly this year I received a letter from the Deputy Secretary-General of the\nABU, Mr. Matsui, who is of course in Tokyo, from which I understood that NAEB\nhad sought associate membership of the ABU. I was very pleased about this because\nI felt sure that your wish to take part in the activities of the ABU would be\nwarmly welcomed by our members and was also particularly glad that we would have\nthe help of your experience as the use of broadcasting to education is so\nimportant to ABU members operating in developing countries.\nLast May we had an ’unofficial* ABU meeting in Tokyo: there were a number of\nurgent matters to be considered and we have at present no Administrative\nCouncil that could meet between General Assemblies although we expect that\nprovisien for such a Council will be added to our Statutes at the next General\nAssembly. During the discussions at this meeting, it was agreed that applications\nfor membership should normally be dealt with by postal vote, so that we would\nnot have to keep the organisations concerned waiting until the next General\nAssembly. Recently the Secretariat staff in Tokyo began referring to the full\nmembers applications we had received from other organisations, including RET,\nand noticing that NAEB had not been included I wrote to Mr. Matsui to ask the\nreason for this.\nNow I have learned that I misunderstood Mr. Matsui six months ago as he intended\nonly to say that NAEB had expressed interest in associate membership. I have\nbeen thinking happily that I would be seeing you at our second General Assembly,\nto be held in Tokyo in October, and I am very disappointed that this idea has\nbeen temporarily - although I hope not permanently - shattered.\nI very much hope that your not actually having sought membership is a temporary\nmatter: such delays can easily occur in an Association which may have to wait\nfor an annual meeting for a decision of this kind to be made. I know Mr. Matsui\nsent you a copy of the ABU Statutes but I am forwarding another copy for ready\nreference and also a list of our present members: as I have already indicated\nthere will soon be additions to this list.\nThe objectives of the ABU are set out in Article 2 of the Statutes and in the\nannexures but I think you are aware that they can be broadly summarised as being\nto assist in the development of radio and television in the Asian/Pacific area\nand to encourage the use of the broadcasting media in the cause of international\nunderstanding. The election of Mr. Maeda, whose fine qualities are well known\nto ypu, as the first President of the ABU is an assurance that the Union will be\nwisely guided in seeking to achieve these objectives. You will also know\nMr. Bhatt and possibly Mr. Hammad of the UAR, our two Vice-Presidents, both of\nwhom are outstanding and dedicated men.\nAs many of our members inthe Asian/Pacific area are operating in developing\ncountries, a substantial part of the work of the ABU will be directed to activities\nof special value to broadcasters in such countries including projects in the general\nfield of school and adult eduction; efforts to help in the development of farm\nbroadcasting which is so important to countries that need to increase food pro¬\nduction; the provision of additional facilities for staff training, and so on.\nAt the first General Assembly of the ABU last November plans for a number of projects\nin these fields were agreed upon and we have since been working on these proposals:\nin many cases we are seeking the practical or financial collaboration of agencies\nof the U.N. such as UNESCO, FAO, and the U.N. Special Fund or other international\norganisations as the ABU’s own funds are very limited.\nIt is because of the vital importance of this developmental aspect of the ABU’s\nwork that we would particularly welcome NAEB as an associate member. Your exten¬\nsive experience in the educational field would be of great practical help to us"
}