{
  "id": "d499-88",
  "text": "ASIAN BROADCASTING UNION\nBox 3636, G.P.O.,\nSYDNEY a\n4th March, 1965«\n*7 -\nI have recently heard from Tokyo that N.A.E.B. has applied for associate\nmembership of the Asian Broadcasting Union and, as I will be in Washington\nbriefly at the end of this month, I thought I should mention this visit to\nyou in the hope that I may be able to call on you.\nYou may have heard that, during the first General Assembly of the ABU in\nSydney last November I was asked by my colleagu.es to become Secretary-\nGeneral of the ABU after my retirement from my post as chief executive of\nthe ABC (Australia) . My retirement dated from last Friday, so I have\nthis week officially taken up my new responsibilities for the ABU, Although\nthe headquarters of the ABU is in Tokyo, as stated in the Statutes, I will\nnormally work from Sydney although I will need to visit Tokyo periodically\nfor discussions with the President of the Union, Mr, Maeda,\nI must say I was very pleased to learn that N.A*E,B, is interested in the\nABU, Our new Union will have many problems ahead, not the least of which\nare the financial ones but, with the practical co-operation of bodies such\nas yours, I am convinced that it can be made into an organisation that will\nbe of genuine value to its members, particularly those in the developing\ncountries, I am looking forward to taking part in this work,\nI am going overseas on this occasion mainly because I have been invited\nto be the guest speaker at the dinner arranged by the DuPont Awards Foun¬\ndation in Washington on 29th March I will, however, take the opportunity\nof calling on Mr, Maeda on my outward journey and also of carrying out\nvarious assignments for the ABU in Asia, Europe and America, particularly\nmaking contacts with overseas organisations which may be prepared to give\npractical help in its work, I will be in Washington from the morning of\n26th March to about mid-day on 30th March but do not know where I will be\nstaying \"as' tHe accommodation booking is being made by the DuPont Foundation*\nI also do not know whether you are regularly in Washington, if so I hope we\ncan meet again there, I will be leaving Sydney tomorrow but if you would\ncare to let me know, at the address shown on this letter, whether you will\nbe in \"Washington at the time of my visit this infomation will be sent on\nto me promptly. Alternatively, you might prefer to advise the ABC*s Rep¬\nresentative in New York, Miss N, Fleming who is in charge of my personal\narrangements and with whom I will be in contact in the days immediately\nbefore I go to Washington: her address is: Suite No,2706, 1270 Avenue of\nthe Americas, New York.\nWith kind regards,\nYours sincerely,\nSecretary-General\nAsian Broadcasting Union\nMr, .i,G, Harley,\nPresident,\nNational Association of Educational Broadcasters,\n1346 Connecticut Avenue,\nN.■;. WASHINGTON. 36. D.C.\nU.S.A."
}