{
  "id": "d499-9",
  "text": "GA/6\n3.\nAt Mr Stringer’s request, the Secretary-General read a message from the\nPresident expressing his deep regret about being unable to remain in Singapore\nuntil the end of the General Assembly and indicating his happiness and\nsatisfaction concerning the success of the meeting.\nMinutes\nThe Vice-President drew attention to the draft minutes of the opening plenary\nsession on 23 October, set out in document GA/5* Mr Duckmanton, seconded by\nMr Kushkalci, moved that these minutes be confiimed and this proposal was\nadopted.\nReports from Committees\nThe Vice-President then invited the Chairmen of the Committees to submit the\nrecommendations prepared by their Committees for consideration by the plenary\nsession.\nMr Hekimgil, acting for the Chairman of the Administrative and Legal Committee,\nProfessor Giritli, who had had to return to Turkey, presented the recommenda¬\ntions of that Committee, as set out in the Committee’s report (Document LC/5).\nThe Chairman of the General Committee, Dr. Umar Kayam, submitted the recommenda¬\ntions of his Committee (Document GC/l2) and said that he wished to thank all\nthe members of the Committee, as well as the officers of the ABU and RTS,\nfor the assistance they had given in its work.\nMr Raman, as Chairman of the Programme Committee, presented the recommendations\nmade in the report of that Committee (Document PC/14) and was followed by the\nChairman of the Engineering Committee, Mr ITomura, who put forward the recommen¬\ndations which his wished to propose for adoption, as shown in Document EC/25.\nAs the Vice-President, Mr Stringer, had been the Chairman of the Finance\nCommittee, Mr Sceats, at Mr Stringer’s request, read the recommendations of\nthat Committee.\nMr Torres proposed that the General Assembly should adopt all the recommenda¬\ntions made by the Committees and should also thank all those associated with\nthe preparation of the Committees’ reports and recommendations for their\nvaluable contribution to the work of the General Assembly. This proposal\nwas seconded by Mr Sceats and adopted unanimously.\nMr Matsui drew attention to the fact that the recommendations of the General\nCommittee include amendments to the Statutes of the ABU and, at his suggestion,\nthe Vice-President requested that the full members should vote by show of hands\non these recommendations in order to provide an official record that they had\nbeen adopted in accordance with the requirements of the Statutes. The 19 full\nmembers present unanimously approved the adoption of the recommendations\nregarding amendments to the Statutes set out in Document GC/l2.\nResolutions of the Fourth General Assembly\nThe Vice-President pointed out that the recommendations of the Committees,\nas adopted by the General Assembly, would need to be expressed in the form\nof resolutions, as shown in Document N/8, and it was agreed to adopt the\ncontents of Document n/8 as a formal statement of the decisions already made\nby the General Assembly when considering the reports of the Committees.\nAppointment of Auditor\nThe Vice-President drew attention to the recommendation of the Finance\nCommittee, already approved by the General Assembly, that Mr Takashi Matsunaga"
}