{
  "id": "d499-94",
  "text": "d) to seek, within the framework of the Union and in the spirit of mutual con¬\ncession and cooperation, the solution of any differences that may arise;\ne) to use its best endeavours to ensure that all its members respect the provisions\nof international agreements relating to all aspects of broadcasting, and\nf) to make efforts to contribute to the advancement of international friendship\nand goodwill through the medium of broadcasting.\n3. In pursuance of these objectives, members of the ABU shall be guided interalia\nby the terms of the resolutions passed at the previous Asian Broadcasters’ Confer¬\nences set out in Annexes “A”, “B”, “C” and “D”.\n4. With these objectives in view, the ABU shall employ all appropriate means by\nstudy or action and, in particular:\na) shall establish and maintain permanent services to carry out its day-to-day busi¬\nness;\nb) may collect and keep up-to-date documents and other materials and issue publi¬\ncations on matters concerned with broadcasting;\nc) may set up committees and/or study groups for the examination of any partic¬\nular subject relating to broadcasting, and\nd) may acquire or obtain the use of any land, buildings, installations, equipment\nand/or materials necessary to achieve its purposes.\nArticle 3: Membership\n1. All broadcasting organizations of a national character in Asia and the Pacific\nwhich operate a public service broadcasting business under the government author¬\nity or with authorization by the competent government agency of the country con¬\ncerned may be admitted to membership of the Union.\n2. An organization shall be deemed to operate a public service broadcasting business\nif it produces and has the general responsibility for the programmes broadcast by\none or more transmitters permanently at its disposal.\n3. Members of the ABU shall be divided into the following two classes:\na) Full members\nb) Associate members\n4. Only broadcasting organizations of a national character in independent countries\nare eligible for full membership. However, in case any such broadcasting organ¬\nization has been admitted to another international broadcasting union with objec¬\ntives similar to those of the ABU and enjoys full membership of that union, the\norganization concerned shall not be eligible for concurrent full membership in the\nABU unless it is one of the members named in the Fourth Asian Broadcasters’\nConference Resolution on the establishment of an Asian Broadcasting Union re¬\nferred to in the Preamble. (Annexe “D”)\n5. Broadcasting organizations fulfilling the conditions stipulated in Clause 1 above\nbut situated in a country outside the region as defined above or falling under the\nproviso of Clause 4 above may be admitted as associate members.\n6. Organizations operating a broadcasting service of a national character in depend¬\nent territories situated in the region may be admitted as associate members, pro-\n2"
}