{
  "id": "d499-95",
  "text": "vided that their applications are supported by the governments of the countries or\nterritories concerned.\n7. Each country shall be represented by only one full member.\n8. Whenever there be more than one broadcasting organization in a country fulfilling\nthe conditions stipulated in Clause 1 above, only one of such organizations that is\nnominated by the government of the country concerned may be admitted as a full\nmember, others being eligible to apply as associate members.\n9. Only full members may enjoy the full rights of membership.\n10. Associate members may enjoy the same rights as full members except the right to\nvote and as otherwise provided for in these Statutes.\n11. Except in the case of the organizations from the countries named in the Fourth\nAsian Broadcasters’ Conference Resolution on the establishment of an Asian Broad¬\ncasting Union referred to in the Preamble (Annexe “D”), which shall automat¬\nically be eligible for full membership, broadcasting organizations qualified may\nforward their applications for membership to the President of the Union. Admis¬\nsion shall not be granted unless it is approved by at least three quarters of the\ntotal of the full members.\nArticle 4: Resignation\n1. Any member may resign from the ABU by giving written notice to the President\nat least six months in advance. The resigning member shall be liable for all its\nfinancial obligations to the Union.\n2. Any full member which has resigned from the ABU and any successor to its rights\nshall cease to have any rights in the assets of the Union as from the date of its\nresignation.\nArticle 5: Cessation of Membership and\nExpulsion of Members\n1. Any member no longer fulfilling the conditions stipulated in Article 3 of these\nStatutes shall cease to be a member of the ABU upon the decision of the General\nAssembly.\n2. Any member committing a breach of any of the provisions of these Statutes, or\nfailing to meet its financial obligations to the Union, or refusing to carry out a\ndecision of the General Assembly, may be expelled from the ABU by the decision\nof the General Assembly. Every full member shall be notified of any proposal\nfor the expulsion of a member at least three months prior to the date of the session\nof the General Assembly at which the said proposal will be placed on the agenda.\n3. No decision by the General Assembly shall be reached regarding the cessation of\nmembership or the expulsion of a member under the respective provisions of the\ntwo preceding clauses unless it is approved by at least three quarters of the total\nof the full members.\n4. Any member ceasing to be a member in accordance with the provisions of Clause\n1 or Clause 2 of this Article shall be liable for all its financial obligations to the\nUnion.\n3"
}