{
  "id": "d499-96",
  "text": "5. Clause 2 of Article 4 of these Statutes shall apply to any member ceasing to be a\nmember of the Union under the provisions of this Article.\nArticle 6: General Assembly\n1. The General Assembly shall be the supreme body of the ABU and shall have all\nthe powers necessary to achieve the objectives of the ABU. It shall comprise all\nthe members.\n2. Only full members shall have the right to vote in the General Assembly, this right\nbeing limited to one vote each except as provided by Clause 4 of this Article.\n3. The General Assembly shall meet once a year in ordinary session. The General\nAssembly may meet in extraordinary session when convened in accordance with\nthe procedure provided for in Article 8 of these Statutes.\n4. Each member may be represented at the sessions of the General Assembly by a\ndelegation or a representative of its own choice, or it may delegate in writing its\npowers to another full member, notifying such delegation of powers to the Presi¬\ndent of the Union. However, no full member may accept such delegation of power\nfrom more than one other full member.\n5. The agenda of the ordinary session of the General Assembly shall include:\na) approval of the minutes of the preceding ordinary session of the General As¬\nsembly and of any extraordinary session that may be held in the interim;\nb) the report of the head of the Secretariat on the activities of the ABU since the\nlast ordinary session of the General Assembly and, in particular, on the meas¬\nures taken to implement the decisions of the General Assembly;\nc) the report of the auditor or auditors;\nd) examination and approval of the accounts for the preceding fiscal year;\ne) appointment of the auditor or auditors for the current fiscal year;\nf) approval of the programme of activities and the budget for the next fiscal year;\ng) fixing the subscription and contribution for the next fiscal year;\nh) fixing the date and the venue of the next ordinary session of the General As¬\nsembly ;\ni) election of the President and/or Vice-President or Vice-Presidents whenever\nnecessary;\nj) any items submitted by members in accordance with Clause 3 of Article 9,\nand\nk) other matters that the General Assembly has been authorized to determine\nunder the provisions of these Statutes.\nArticle 7: President and Vice-Presidents\n1, The General Assembly shall elect from among the full members a President and\ntwo Vice-Presidents. The terms of office for the President and the Vice-President\nshall each be for two years.\n2. The President and the Vice-Presidents are eligible for re-election to office.\n4"
}