{
  "id": "d499-97",
  "text": "3. In the event of the absence or inability of the President, his functions shall be\nperformed by the older of the two Vice-Presidents, unless the General Assembly\ndecides otherwise.\n4. The President and the Vice-Presidents shall be deemed to have been elected to\ntheir respective offices only by virtue of and in relation to the offices they hold in\nthe broadcasting organizations to which they belong. Upon leaving the offices\nthey have held in the broadcasting organizations concerned, the President or the\nVice-President shall be deemed to have simultaneously left the office of President\nor Vice-President, which shall be assumed by their successors.\n5. Unless powers are specially delegated, all engagements binding the ABU other\nthan those concerning its day-to-day routine business shall be signed by the Pres¬\nident and one Vice-President.\nArticle 8: Convening of Meetings\n1. The ordinary and extraordinary sessions of the General Assembly shall be con¬\nvened by the President. He shall convene the General Assembly for an extraor¬\ndinary session upon the request of at least one-third of the full members.\n2. Notices convening the-General Assembly shall reach members by registered mail at\nleast three months prior to the date fixed for the session. In convening an ex¬\ntraordinary session of the General Assembly, however, the period of the advance\nnotice may be shortened to one month in case of urgent necessity.\nArticle 9: Agenda for Sessions of\nthe General Assembly\n1. The agenda for every session of the General Assembly shall be prepared by the\nPresident with the assistance of the Secretariat. The agenda shall reach members\nnot less than two months prior to the date of the session.\n2. No decision may be taken by the General Assembly on any subject which is not\non the agenda unless consent is obtained from not less than half of the full mem¬\nbers present or represented.\n3. Any member shall have the right to propose business for the agenda of an ordinary\nsession of the General Assembly. Such business shall not be placed on the agenda\nof the said session unless notification has been received by the Secretariat at least\nten weeks prior to the date of the ordinary session of the General Assembly.\nArticle 10: Language and Working Procedure\nof the General Assembly\n1. English shall be the official language of the ABU.\n2. The Chairman may allow a member to use a language other than English, provided\ntranslation into English is ensured by the member concerned.\n3. The General Assembly cannot make any valid decision unless a majority of full\nmembers are present or represented. If this quorum is not present, another ordi-\n5"
}