{
  "id": "d828-17",
  "text": "GEBJUOY: 11« Therelaticm between subject matter and sense or|geii beat appealed to.\nSome things go better, perhaps, on educational radio, than on EW. \\\nOiRDNERi There is the question of the bejrt Toice quality of the speaker\nGEBJUOYi U. Whether the material is put into words or symbols, or whether it\npresented by dixect means. You can deseribe something or you can show it. Orw\ndescttbing in words takes less time (if you let them read it rathdr than hear it) .\nll. Prlwacy of the subject. Can he take off his pants while he watches the show.\nShould it be seen in g^vip9 indiwidnaBy? Seme are better one way, some the other.\nQAlpilSRt wkmmmm m fwiMW >%iHrfc-ran industxlal program Mffwriir was lODdccssaaccii aimed at\ngroups that could discuss it afterwards.\nGERJUOYs There is Newcomb*s feedbadc variable. (15*)\nQARDNERt We need experiments on all kinds of feedback.\nGE£BJUOYs l6. How sensitive is the program to the feedback. A kinie show may not bs.\nLive shows mi^*\nQARDNERt 17. How meaningful is the feedback. Some people think it doesn’t mean a thing.\nYou get some very strange subgroups of the audience aresponding in mary cases.\nMOORE J How about getting back to general subject matter now?\nMEHRIL t W^ have three main areas': a) finaneingi b) the massage- c) the role of the\nstdbion in uhe community Let*s see which is the most important.\nGARDNER: If we are going to do research, we must ask:\na) what is the image of Channell 11 in the public mind?\nb) where does it fit into the lives of the people in the pubUc?\nwhat does it lack in coBqparison to the other things that they have Images of?\nThat is, what is its social role function? 4 4.1.4\nC) let’s look at the programs, then, and see how they fulfill and determine the image\nHow do the bits and piecss of individual programming oontrlbitbe to this image? How do they\nact on different segments of the audience?\n13. What research requires national study What research is for the local level?\nGARDNER: There are some research techniques available to eiwiry station. If they all uw\nthese then we could con^are the differences in results in one station with another station.\nC3ERJU0Y: This is the question of the smoothness op consistency of research results as\nopposed to their turbulence.\nGARDNER: This is the question of how uniform are the results*\nCHEYDLEUR: There must be single techniques available that an intelligent non-psychologist\non a station staff could ap ly uniformly.\n^ MOORE: This is a job for the research committee— the i^ermanent committee, that is.\nGARDNER: Then we could have some standards.\nCHEYDL3HJR— MARQUIS: IF they are simple and are applied everywhere.\nADJOURN."
}