{
  "id": "d828-22",
  "text": "Comnlttee II 3\nFor vxanplas The illiterate uiakee a good dollar wage, has a middle class home,\nand feels the gap between his llliteraQr and the remainder of his way of lifep Lower\nmiddle class children lAio gccfig up to upper middle class incomes want to belong, and to\nshed the^igmata of their origins. They feel the need for learning many kinds of\nthings that legitimise their higher status. Regardless of socio-economic status,\nmany p€K>ple feel that they are falling behind in even a speaking acquaintance with\nprogress in the most swiftly moving areas such as electronics, medicine, etc.\nWhat must be stressed here is that the educational broadcasting audience esdsts\nin a total social field. The pattern of production and oonsimption in the educational\narea is no longer merely the knowledge which the teacher happens to have or to approve\nshoved along to a captive consimer. The teacher must now consult audience as part of\nthe entire connunily of learning, and not a mere isolated l»rget for the sort of\n^ ainsunition he happensto have in stock.\nAn example of lAiat research on the potential audience may turn up may be\nillustrated in this manner. Some notion of ideal educational goals and states will\nbe known. However, the expressed ideal goals may be perceived by the xrespondents\nas beyond imaediate attainment. Part of Ike confusion existing in educational broad¬\ncasting nay be the acceptance of expressed ideal goals as wozkable goals in programming.\nIn addition, we will find out actual attainment in educational terns for various\nsegmnts and sub-se^ents of this potential audience. Thus we can see one type of\nmpip gap, that between ideal goals and actual attained educational level. There\nis a third type of information which can be gathexed. These are re^T ^ e goals\nas perceived by the reapondents. This the possible state which audience memberB\nrealistically Judge to be attainable within the time, money and energy which they\ncan spare. We think this level will never be at the same level as actual attainment\nwiU also MTOr be eet at the level of ideal goals. Here la a secood gap. Perhaps\nit is in the area of this gap between realizable and presently attained goals that\neducational television should concentrate."
}