{
  "id": "d828-47",
  "text": "SYRACUSE UNIVERSITY\nSYRACUSE 10, NEW YORK\nRADIO AND TELEVISION CENTER\nDeceml)er 10, 1957\nMr. Eaymond D. Cheydleur\nUniversity Broadcasting Services\nThe Florida State University\nTallahassee, Florida\nDear Bay:\nBy the time you receive this, you will have returned from Columhus.\nThe thanksgiving period recenC-ly ended apparently slowed the mails, as I\nreceived your good letter afterwards* In the same mail, I also received\nan invitation to the research seminar from Harry Skornia; hut, as you\nknow hy now, I sent him a telegram declining with regret.\nWhen Art Weld first showed me the Hovemher 22 information cojjy\nof a letter to Keith Tyler listing me as fourth alternate with a notation\nthat prohahly only the first two could he invited, I gave holding the\nweek open on my calendar, and made several commitments that would have\nbeen awkward to break.\nI was sorry to miss the meeting because of the fun of greeting\nold friends and meeting new ones, and the profit to be obtained from\nthe work. But I know you^ll havehlad a successful meeting, and I can\nhope that I might sometime read a report of the activities.\nMy real regret was the (shall I say—slipshod) way in which\nHASB headquarters handled the matter. Your letter was the first in¬\ndication that I was no longer a member of the research committee I I\nknew that you had been newly appointed as chairman last spring when\nyou chaired a panel at Columbus, but (and please forgive me for harboring\nsuch thoughts) I Just assumed that lack of correspondence meant lack\nof activity on the part of the committeeJ I never dreamed I had been\nremoved. Having served since my initial ai^pointment in January, 1953*\nI had the mistaken impression that I would remain a member until my\ninterest and talents, or NABB*s policies, detennined otherwise.\nObviously the latter happened; but the communication sure fell\ndown somewhere. Indeed, when I sent in the i^ecent telecourse sirrvey to\nK.S., he asked if I had sent copies to the Research Committee, and I\nreplied tha.t I had sent them to you, Adkins, Harwood, Coleman,, and\nRemmers. I see now that I missed Becker, Flick, Merrill, and Tyler,\nbut I*m sure they^ll forgive mej\nDo I recall talk at St. Louis that a “summit” meeting for NABB\nseemed necessary? Add one more strong “yes” vote to the chorus.'\nSincerely,"
}