{
  "id": "d1582-2",
  "text": "GUESTITOIUAL\n\"WHERE WE* RE WEAK\"\nEducational radio, as exemplified in the broadcasts by college and\nuniversity stations, is not perfect. Neither, according to the Blue Book,\nis commercial radio. But progress has been made by educational stations.\nNo longer can the stigma, expressed by the President of a large university-. e\n\"The trouble with educational radio is that the programs are no good\"....\nbe applied. Many programs on college stations are comparable to anything\nradio has to offer. Even the weakest programs are no worse than some I\nhave heard elsewhere.\nBut in our efforts to improve programming and production, we have over¬\nlooked one basic fact. People must be tuned to our station before they\nbecome listeners. In a recently conducted trial study of listening in our\narea, too many interviewees said they did not know when our programs were\nscheduled. We have been weak in our promotion..in letting folks know what\nwe have to offer.\nEven the networks realize they cannot build audiences by their own\nefforts alone...by figuratively pulling themselves up by the bootstraps.\nDid you see the promotion on children*s programs last fall. There were half\npage ads in the Sunday comic suppliments of the newspapers. There was a\n\"Superman\" contest in which bicycles, radios and other prizes were dis¬\ntributed through local stations. All these to -attract the child listener.\nObviously the educational station cannot purchase half page ads or\ngive away bicycles. The mailing of a few thousand programs each month,\nhowever, is but a small bit when the hundreds of thousands in our listening\narea is considered. Block announcements, while valuable, depend upon those\nwho are already tuned to us. These are not enough.\nNew, effective and inexpensive ways of informing people of educational\nbroadcasts must be devised. There are probably many ways in which this can\nbe done. The collective thinking of all N.A.E.B. members could result in\nideas which could help all educational broadcasting. Perhaps a standing\ncommittee to receive and correlate such ideas would be helpful.\nCertainly, with the great influx of new stations, both AM and FM, there\nis going to be increased competition for the listeners' time. Even though\nthe educational broadcaster may decide that his programs are for discriminating\nlisteners, he is still effected. I am convinced that we must pool our ideas\non promotion if educational radio is to consolidate the gains we have made\nin programming and other phases of our general operation.\n..Robert J. Coleman, WAR,\nMichigan State College\nNext Month’s Guestitorialist; W. I. Griffith, WOI, Iowa State College"
}