{
  "id": "d559-120",
  "text": "Mr. Harold E. Hill\nAdministrative Vice President\nNAEB\nlU Gregory Hall\nUrbana, Illinois\nreceived\nNAEB — URBANA\n6hr 2 5 1961\nAM \" PM\n■7,8,9,10,11,12,1,2i3i4i5,6\nDear Harold:\nThank you for yours of August 21. I am just wondering if, in the\nabsence of money to cover expenses of NAEB representation at meetings\nof other groups, a plan such as the following might work out. You\nwould notify the chairman of the Public Relations Committee of meetings\nat which such attendance seemed desirable. Then the chairman of the\ncommittee would circulate this to the members of his committee to see\nwho might be relatively near and would be willing to attend at his or\nher own expense. I have a feeling that we could pick up considerable\n\"free\" representation this way. For instance I attended the annual\nmeeting of the American College Public Relations Association in Denver\nthis summer, since I was asked to chairman a panel and the train trip\nlooked inviting. I willingly paid my own expenses. Just as easy as\nnot, I could have represented the NAEB at this function. So, what do\nyou think of the idea?\nSince writing you last, I conned the NAB out of a few additional SPEAKERS\nGUIDES and I am sending Betty, by this mail, copies of the GUIDE for\nradio broadcasters and for television broadcasters respectively. Of\ncourse my idea is to get out a single GUIDE that would cover our entire\nmembership. I presume that Betty will let you know the matter of costs\nwhen she has a chance, and then you will get in touch with me as to whether\nto proceed or not. Until I hear whether you find the money to do this\nor not I would rather hold the preparation in abeyance, because I should\nknow concisely how far to go in the matter of speech inserts, etc. Each\nof the publications sent Betty contain the substance of nine speeches,\nand if I do get the green light, I would like to have some suggestions\nfrom you and Betty as to how many speeches to include, and your ideas as\nto the topics.\nElmer G. Sulzer, Director\nRadio and Television Communications\nEGS:mp\ncc: Mrs. Betty McKenzie"
}