{
  "id": "d559-15",
  "text": "I\nMr. Elmer G. Sulzer\n•>\nMay 15, 1961\nbe accommodated nicely at discussion tables in the banquet room, with\na buffet luncheon served. Cost of the hall is $450. A registration fee\ncould offset this and include a luncheon. Such a meeting could draw\nfrom the entire state and adjoining areas, including Wisconsin, Michigan\nand Indiana, which are within driving distance.\nOf course, all these proposals are quite nebulous, but could be developed\nfurther, if and when the idea is approved in principle.\nII. DECAL\nRather than a door decal for stations, I would suggest a decal for\nautomobiJ.e windshields, etc., which would utilize a general NAEB logo\nas its theme, with space for individual insert of a station. This could\nalso be used by other types of members, such as individual, affiliate and\nassociate.\nIII. DESCRIPTIVE BROCHURE\nA descriptive brochure about HAEB (possibly one already in existence)\nshould be more widely circulated. A mailing list should be compiled of\npublic affairs directors of all commarcial stations, school administrators,\naudio visual personnel, etc., university speech departments as well as\nradio and television directors, religious organizations, radio and TV\ncolumnists of all major newspapers. One newsletter should accompany the\nbrochure, and a form should be enclosed, requesting the recipient to send\nit back if he wishes to receive literature from NAEB. After several months\nof receiving free literature, this individual should then be hit for a\nmembership. It*s pretty hard to sell a membership to someone who doesnft\nknow enough about the organization.\nIV. AWARDS\nI believe it is time that NAEB developed its own awards program. Such\nawards should be based on more realistic criteria than those in existence,\nand I need not point the finger. Categories should be developed on the\nbasis of type of producer (production agency, station, etc.) as well as\nsize of budget. This would enable contributors to compete on a more\nequitable basis and, of course, would be of considerable public relations\nvalue to NAEB in addition W recognizing and rewarding the efforts of\nthose* who are sincerely trying to utilize mass media effectively.\nThe above are a few random suggestions, presented in my usual disorganized*\nidealist fashion, but submitted with a sincere desire to be of -service.\nI hope they prove helpful.\n>t\nExecutive Director\nBroadcasting Commission\nHHM:hk"
}