{
  "id": "d559-9",
  "text": "-5-\nAnyone can work out success stories if they have the\npersonnel and the time to work on it. I don’t think we\nshould be concerned with the local problems.\nG. I don’t know how we could select a promotional\ntheme for NAEB• We might advise that an annual theme would\nbe a good idea to Skornla and see what he thinks of it.\nBut a theme and its publicity nationally costs money and\nrequires a staff.\nH. Of course I believe a National Educational Broad¬\ncasting Week is essential, and the Advertising Council\nshould be ready for it. However, it should be a Joint\nproposal for NAEB, the Center, and LRI, the NAEB should\nnot try it alone. Various contact people In advertising\nhave already been effected by ETV and should be willing to\nhelp us with the project. Such people include:\nJohn P. Cunningham - Chmn. of Cunningham and Walsh.\nJgngpS. Fish - Vice Pres. Adv. General Mills. Chmn.\nBd. of Adv. Fed. of America.\nMcGannon - Pres. Westinghouse Broadcasting. Chmn.\nAFA Communications Comm,\nThomas a, Adams - Pres. Campbell EwaId Adv. Agency.\nIf we work it out with the Center, Kraetzer has been\ncontacting many New York offices, 1 am sure a comprehensive\nJob can be done.\nI. The drive for NAEB membership among teachers\nutilizing TV is a great idea. It should be tied In with\nthe utilization committee, and utilization reports should\nbe distributed to these teachers along with an NAEB member¬\nship form. Each station could be a clearing house for\nthese mailings.\nJ. The features for the slicks will probably be done\nby the Center, LRI, and the publicity conscious ETV’s.\nI*m not sure what gimmick the NAEB has which .ould get It\nInto a siick.\nK. The articles in trade publications would not be\ntoo Important for industrial membership. They want to\nknow \"quid pro quo.\" Who’s buying what In relation to\ntheir membership and their rights under their membership.\nMay 1 suggest a confidential polling of NAEB members in\nwhich a total equipment purchase figure per year could be\nreached. This figure would get you members from industrial\nfirms, in a hurry."
}