{
  "id": "d1688-10",
  "text": "NAME\nORGANIZATION\nMAILING ADDRESS\nHotel Paso del Norte,\nHICKS, VIRGIL C. - Director of Extension Service, KTSLJ\nEl Paso, Texas _ „ _\nHILL, ABRAM - Director, Amer. Negro Theatre - lp West 12b Street, New York\nHILL, MACEO - Reporter, Associated Negro Press, Chicago-Defender - Chicago, Ill.\nHILL, ROBERT 3. - Ohio State University ,\nHILLER, OLAB. - Director Radio Education, Pontiac Public Schools - 111 Oneida R .\nPontiac, Michigan\nHIMES, ESTELLE J. - Teacher, Columbus Schools - 1236 Hildreth Avenue, Columbus\nHIMES, JOSEPH S. - Editorial Writer, Ohio State News - 123 \\Hildreth Ave* ’ C°lu?mS\nHIRSH, SELMA G. - Writer, Public Relations, Writers Roar'd - 145 E 92nd St., N, Y.\nHOACHLANDER, MRS. MARJORIE S. - Instructor Radio Workshop, Hagerstown High Schoo\n1205 Potomac Avenue. Hagerstown, Maryland\nHOBBS. RANALD P. - Manager, College Dept., Rinehart and Co. - 232 Madison Ave.. NY\nHODGES, MRS. FLETCHER- Co-Chm. \"Children’s Bookshelf\" (radio program), Pittsburgh\nJunior League - 435 Penn Avenue, Pittsburgh, Pa.\nHODGKINS, MABEL N. - Director, Hadio Workshop, Mont Pleasant High School - 215\nGrand Blvd., Schenectady, Hew York\nHOLBROOK, DOROTHY - South High School, Columbus\nHOLBROOK, ART - Studio Manager, WIBW t Topeka, Kansas\nHOUSTON, E. SUZANNE *r Ohio Wesleyan University - Delaware, Ohio\nHOLLOWAY, ROBERT L. - Director Audio Aids Dept., Euclid Central School -\nChardon Road, Euclid, Ohio\nHOLME, NANCY - Director Education, KNX - 6121 Sunset Blvd, Hollywood, Calif.\nHOLMES, ROBERT E. - 12b W. Bridge Street, Elyria, Ohio ^\nHOLT CORINNS M. - Continuity Director, WCCO - 625 2nd Ave. S, Minneapolis, Minn.\nHOLTZCLAW, DORIS - Program Director, WLAP - Short and Walnut Sts., Lexington, Ky.\nHOLY, GLADYCE G. - 5797 N. High St, Worthington, Ohio\nHOLY, THOMAS C. - Director, Bureau Educational Research, Ohio State Univ., 001s.\nHOOVER, CHARLES P. - Kent State University, Kent, Ohio\nHOPKINS, CAROL D. - Ohio State University\nHORN, ROBERT C, - Radio News Editor, WMAN - Mansfield, Ohio _\nHOSKINS, LUELLA - Chief, Radio Section, North Atlantic Area, American Red Cross\n300 Fourth Avenue, New York City\nHOSTER, MRS. HERMAN - 2?09 Bexley Park, Columbus . T\nHOUSTON, CLIFFORD G. - Dean Division Mult Education, Extension anc. . ublic Inf\nation. University of Colorado - Boulder, Colo,\nHOVER, FRED R. - Owner, manager, WFIN 5^0 l/2, Findlay, Ohio\nHOWARD, GEORGIANA - South High School, Columbus\nHOWERTON* JEAN - South High School, Columbus\nHUBBSLL, RICHARD W, - Production Manager, Television Consultant, Crosley Corp, WLW\nl40 West 9th Street, Cincinnati, Ohio\nHUBER, ROBERT J. - Music Staff, WEAR, Mich. St. College - 6l3 Division, E. Lansing,\nHUDSLSON, BEN - Education Director, WOWO - 925 S. Harrison, Ft. Wayne, Ind. /Mien.\nHUDSON, ROBERT B. - Director Education, CBS - 485 Madison Ave., New York\nHUFF, WARREN - Coke Ovens Amonia Research Bureau, Columbus\nHUGHES, RAY 0. -r Moderator, Jr. Town Meetings - 5517 Beverly PI., Pittsburgh, a.\nHULL, RICHARD B. - Program Director, ¥01, Iowa St. College w Ames, Iowa\nKUNNICUTT, RUTH G. - Script Writer, Radio House, Univ. of Texas, Austin, Texas\nHUNSICKER, ROBERT B. - Ohio State University\nHUNT, DAVID S. - Ohio State University .... .\nHUNTER, ARKAND L. - Chm., Dept. Radio, Northwestern University, Evanston, Illinois\nHUNTKEl! CHARLES F. - Director Radio, Univ. of Kansas City, Kansas City, Missouri\nHUNTLEY, ELIZABETH - Public Relations Dept., J. Walter Thompson Co, 420 Lexington\nAvenue, New York _ c\nEURTUBISB, MAJORIE R, - Instructor, Radio Writing,, Syracuse Univ., 201b 8th Street,\nHibbing, Minnesota\n11 T"
}