{
  "id": "d1688-12",
  "text": "NAME\nORGANIZATION\nMAILING- ADDRESS\nVa.\nKELLIS, FANNY - South High School, Columbus\nKELLNER, LEE B. - Ohio State University\nKELLY, ALBERT H. - Manager, WOOL -33 High St., Columbus\nKELLY, EDITH 3. - Director of Radio, Ohio Wesleyan University - Delaware, Ohio\nKELLY, VIRGINIA E. - Teacher, Jr. League - l4l6 ^uaxrier Street, Charleston, w.\nKELTNER, KAY - Director Women’s Activities, WOOL r 33 N. High St., Columbus\nKEMBLE, DOROTHY A. - Director, Continuity Acceptance, MBS - 1+40 Broadway, New Yor\nKEMPTON, WILLETT - Director, Radior-Television Section, U. S. Dept. Interior, was .\nKENISON, NELL - Director Radio Programs, Dept. Public Safety, Dos Moines, Iowa /\nKENNEDY, HELEN C. -r Asst. Advertising Director, Kroger Co., - 35 E 7th St. Cincy, .\nKENT, HAROLD W. - Director, Radio Council, Chicago Public Schools, 228 N. LaSa e\nKENT, LEW - Program Director, WKRC - Cincinnati, Ohio _ /St.,Chicago\nKENT, MILDRED G. - Pres. Radio Council - 5224 Mohawk Lane, Kansas City, Kansas\nKERNS, ROBERT J. - Sales Manager, WHIZ - Lindarcade, Zanesville, Ohio\nKEYSSR, LESLIE - Writer, Campfire Girls - Seneca Hotel, Columbus\nKIBLSR, CAROLINE D. - Junior League, Columbus, Georgia\nKILLER, MRS, FRANK - Junior. League, Columbus, Ohio\nKILCOYNE, LOIS - South High School, Columbus\nKIMBALL, INEX B. - Radio Director, Girl Scouts - 3° W 4Sth Street, New York\nKINDLER, DARWIN G. - Manager, South Central Rural Elect. Coop,, Box 425, Lancaster,0,\nKING, ALLEN Y. - Director Social Studies, Cleveland Public Schools; Pres. J^ior\nTown Meeting League - Board of Education, 1330 E 6th St,, Cleveland\nMRS. ALICE M. - Asst. St. Home. Demonstration Leader, Extension Service, OSU\nEUGENE E. - Program Director, WOR - 1440 Broadway, New York City\nMARY ALICE -r Ohio State University\nVICKI - Ohio State University\nKINTNER, ROBERT E. *r Vice-Pres., ABC - 30 Rockefeller Plaza, New -.ork\nKIRCHER, WILLIAM L. - Director of Education in Ohio and Pa., United Automobile\nWorkers, CIO, Detroit - 704 9th, Chester Bldg, Cleveland, 0.\nKISTER, GEORGE C. - Farm Service Director, KMMJ - Grand Island, Nebraska\nKITCHELL, ALMA - Pres., AWD, N. Y., ABC, 3° Rockefeller Plaza, New York\nKLOCK.MRS. DOROTHY L, - Program Staff, WNYE - 29 Ft. Greene PI, Brooklyn,\nKLOCK, PAUL R. - U. S, Army - 165 Beach l4bth Street, Neponsit, L. I«, N.\nKLUMPH, CATHERINE C. - Faculty, Syracuse University - Syracuse, New York\nKNAPP, BLANCHE L. - Teacher, West Jr. High School ** Lansing, Michigan\nKNIGHT, BOB - South High School, Columbus _ #\nKNETTI, FRANK R. t> General Manager, Spartanburg Broadcasting Co, - 291 E.\nSpartanburg, South Carolina\nKOBAK, EDGAR - President, MBS - 1440 Broadway, New York\nKOCH,MARGARET M. - Writer, WCOL - 1407 S. 4th Street, Columbus\nKOEPF, JOHN - Manager, Wash. Office, Fort Industry Co., - 1321 St.NW, *\nKOERPSR, KARL - Vice-Pres., Managing Director, KM3C - Pickwick Hotel, Kansas City,Mo,\nKRAMER, DONALD E. ^ Ohio State University\nKRISTOFF, JEANNE - South High School, Columbus\nKRITZER, VELMA - South High School, Columbus . .\nKUZMICH, HINA - Editorial Aset., N. Y. State College of Home Economics, Ithaca, NY\nKING,\nKING,\nKING,\nKING,\nN.\nY.\nY.\nMain St.\nLABBITT, MYRTLE E. - Home Economist, CKLW - 33^0 Guardian Bldg., Detroit, Mich.\nLADD, BILL - Radio Editor, Louisville Courier-Journal, Louisville, Ky.\nLAHMAN, MR. CARROLL P. - Chairman, Dept, Speech, Albion College - Albion, Michigan\nTjaNEMAN MRS. MARY B. - National Radio Chairman, American Legion Auxiliary, Indian¬\napolis - 15 Granger Place, W. Springfield, Massachusetts\nLAMB, HARRY D. - Director, Radio-Visual Education, Toledo public Schools - 1914 1/2\nLinwood, Toledo, Ohio .\nLAMBERT, RICHARD S. - Supervisor Educational Broadcasts, C3C - 35L^ Jarvis St, Toronto\nLAMKIN, MS. CHARLES - Junior League, Kansas City, Missouri\n- 13 -"
}