{
  "id": "d1688-21",
  "text": "NAME\nORGANIZATION\nMAILING ADDRESS\nSISTER MARY ARTHUR, .SHE -Teacher Radio-Speech, Notre Dame Academy - 1111 W. Ban¬\ncroft, Toledo, Ohio\nSISTER MARY MADELEINE, SITE - Principal, Notre Dame Academy - 1111 W. Bancroft, Tol.\nSIMENSON, CHARLES W. - Program Director, WHAM - East Aye., Rochester, New York\nSKI BEEN, LEE - South High School, Colum'ous\nSKQRNIA, HARRY J. - Radio Director, Indiana University, Bloomington, Ind.\nSLADE, GEORGE W. - Educational Director, WBZ, WBZA - 275 Tremont St., Boston, Mass.\nSLAGER. PEED C. - Principal, Central High School - 19&3 Berkshire Rd., ColumDus\nSLAWSON, MAUDS M. - Prof\". Music, Ohio State University - 2859 Neil Aye, Columbus\nSMALL, KATHLEEN H. - Consumer Relations, Information Division, Civilian Production\nAdministration, Social Security Building, Washington, D. C.\nSMILEY, BOB - ICent State University - Kent, Ohio\nSMITH, CHARLOTTE P. - Health Educator, Ohio Dept. Health, Columhus\nSMITH, DON - South High School, Columhus\nSMITH, DOROTHY - Asst. Editor, N* J. College Agriculture, Rutgers Univ., N. Bruns-\nSMITH, GEORGE W. - Managing Director, WWVA - Hawley Bldg., Wheeling, W. Va. /wick\nSMITH, MRS. HELEN POWELL - Clothing Specialist, N- Y. St. College of Home /N.J.\nEconomics, Cornell, Ithaca, New York\nSMITH, JIM - South High School, Columhus\nSMITH, KATHERINE R. - Home Economist, Nat’1. Canners Assoc., 1739 H St. NW, Wash.DO\nSMITH, PAUL E. * Bd. of Education, 13 S. Eitzhugh St., Rochester,^N. Y.\nSMITH, PAULINE - Publicity Secretary, Community Chest - 12 S. 3rd- St., Columhus\nSMITH, ROLLIN E. - Ohio State University\nSMITH, WILLIAM C. - Asst. Exec. Secy., National. Council of Catholic Men - 1312\nMassachusetts Avenue NW, Wadiington D. Cf\nSNYDER, ANN H. - Director of Radio, Jr. League, Saginaw Radio Council - 1220 S.\nHamilton, Saginaw, Michigan\n5757 Univ., Chicago\nMinneapolis, Minn\nSNYDER, MARGARET - South High School, Columhus\nSNYDER, ROSS L. - Prof,, Chicago Theological Seminary\nSPICER, CARL - 1920 Summit Street, Columhus\nSPICER, DOROTHY R. - Public Relations Director, KSTP, Radio City,\nSPICER, VERNA - Ohio State University\nSPIEGEL, GLADYS - Ohio State University\nSTAHL, MYRTLE E. - Education Director, WGN, Tribune Tower, Chicago\nSTAIR, MRS. HENRY, Chm., Capitol Univ., Women’s Committee - 2709 E. Broad, Cols,\nSTALLSMITH, STU - photographer, Ohio State Journal - 62^ E. Broad St., Columhus\nSTANLEY, RAY J. - Producer, WHA - Madison, Wisconsin *\nSTARK, LOUIS M. - Manager, Weatinghouse School Service, West. Electric Corp.\n306 Fourth Avenue* Pittsburgh, Pa.\nSTASHEFF, EDWARD - Program Dept., WNYE -29 Et. Greene PI., Brooklyn, N. Y.\nSTAUFFER, EDWIN S. - Teacher, South High School, Columhus\nSTAUFFER, JAMES - South High School, Columhus ^ .\nSTECK, GEORGE W. - Broadcast Manager, Graybar Elec. Co. - 310 Elm St..^Cincinnati\nSTEETLE, RALPH W. - Director of Radio, La. State Univ. - Baton Rouge, Louisiana\nSTEIN, GERTRUDE EMILIE - Music Director, Snyder Park Jr. High School, Springfield-\n416 W. Columbia, Springfield, Ohio\nSTEMAN, CAROLYN - South High School, Columhus\nSTENZEL, MRS. HOWARD - 2337 Canterbury, Columhus\nSTEPHAN, ROBERT S. - Radio Editor, Cleveland Plain Dealer, Cleveland, Ohio\nSTEPHAN! MRS. ROBERT S. - 9711 Clifton Blvd., Cleveland, Ohio\nSTEPHENSON, KATHLEEN E. - Home Demonstration Agent, West Va., University Extension\nService, New Martinsville, West Virginia\nSTERNER, ALICE P. - English Teacher, Barringer High School, Newark - 11 Seymour\nStreet, Montclair, New Jersey\nSTERNLICHT, JEAN - Ohio State University\n22"
}