{
  "id": "d1571-11",
  "text": "Grade School Pupils Prepare Show\nPupils of 8a, Scanlon School, Chicago, recently consisted a tour to the State Capitol\nand the Lincoln memorial at Springfield, Illinois#\nLater Helen 0. Sorensen, eighth-grade teacher, helped the pupils to prepare a radio\nbroadcast describing:preparations for the trip# Mrs. E* V. Cherest, of the Scanlon\nPTA, also participated in this program. The broadcast was included in the \"Education¬\nal Progress\" series over the Board of Education Radio Station WBEZ, and was also car¬\nried by the commercial station WIND.\nSOUTH DAKOTA UNIVERSITY OFFERS TV COURSE\" \" '\nWith televis ion c oming into the limelight, the .. University .of. South Dakota department\nof radio and dramatic art will offer a course next year in television production#.\n. s\nIncluded in this course will be instruction in the techniques of television producticn\nwith emphasis on announcing, acting, and practical training in various types of ^tele¬\nvision programs# Some work will be done with camera and lighting techniques, and set\ndesign and construction. The final productions will be either filmed or taken to\ntelevision studios for production, according to Keith Nighbert, radio director and\nWarren M. Lee, professor of dramatic art at the U# of S. D#\nThe Federal Communications Commission has allocated ,a channel to Vermillion, S. D.,\nfor a non-comnercial educational television station. University officials are\ninvestigating to determine if utilization of the channel can be made#\nRadio Education Class Offered This Summep\nBecause of the increasing use of radio and recorded‘programs in schools throughput\nthe state, the University of South Dakota is offering a class in radio education\nduring the summer School session#\nThe purpose of the class, according to Allis Rice, director of the School of the Air\nwho will teach the course, is to give teachers, principals, and superintendents a\nbackground in radio education. They will be shown how to use radio programs and\ntaped programs effectively in thefclassroora#\nA workshop will be held in which- actual work will be carried out in developing pro—\ngrams for students to produce over local radio stations# Particular attention.will\nbe paid to both the pre-broadcast period and the post-broadcast period#\nOHIO STATE UNIVERSITY GETS TV GO-AHEAD SIGN FROM REGENTS\nThe Board of Regents of Ohio State University has authorized the. university to pro¬\nceed with the necessary steps for the establishment of a television station for\neducational purposes. The recommendation of OSU President Howard L. Bevis that the\nuniversity should \"seek the best available channel\" was approved by the regents.\nDr. Bevis mentioned the high costs of television installation and operation and noted\nthat these costs vary widely. But he added: \"All' I can say at this time is that we\nfeel the costs will be within the resources of the University.\" ,\nOSU is now telecasting on local commercial stations and is also edeploring TV pro¬\nduction techniques in anticipation of programming its own station#.\nWIVES ARE WELCOME TOO AT THE YEAR’S CONVENTION—MINNEAPOLIS —NOVEMBER"
}