{
  "id": "d1571-17",
  "text": "- 18 -\nThe kinds of promotional material used in the experiment were as follows# Short spot\nannouncements were used on WILL# Talks were made before women's clubs by associates\nof the radio station in which these special programs were given attention# Printed\nand mimeographed material accounted for the bulk of the promotion used# Between the\nfirst and second diary the only printed material distributed was a mimeographed piece\nconsisting of one 8| x 1U inch page, the copy on *diich described in some detail the\nfour programs# This sheet was distributed through city and village school principals\nand music teachers and also rural teachers* A letter from the radio station manager\nasked these principals and teachers to distribute the sheet to their pupils and to\nurge them to take the material home to their parents# Between the second and third\ndiaries promotion was intensified# Spot announcements were increased# . An eight-page\nprinted booklet and another mimeographed piece were distributed through the schools.\nThe booklet was illustrated and printed in two colors and was designed as a \"sales\npromotion piece. It assumed that rarely urging people to listen was not enough#\nInstead, detailed information about the programs — their content, the personalities\ninvolved, specific mention of musical selections to be played, and the satisfactions\nand benefits these would bring — was included in the booklet#\" The booklet described\nonly three programs# The fourth was the subject of the mimeographed sheet, distrib¬\nuted with the booklet. One very interesting feature of the research design was the\nfact that for half of the diary panel of respondents reliance was placed on the\ngeneral distribution of the promotional literature# For the other half direct nail\ndistribution of the booklet and mimeographed sheet, covered by a letter personally\nsigned by the station manager was used*\nThe results of the diary study show (on a five days a week basis) that the nunber of\nfamilies in which WILL was listened to at least once a week fell by U per cent be¬\ntween the first and second diary week, rose in the third week to 219 per cent of the\nfirst week's level, and fell off to 166 per cent of the first week's level in the\nfourth week# During the same weeks, the comparable listening for the two other\nprincipal stations listened to by the panel menbers declined from the level of the\nfirst week and in each of the following study weeks fluctuated between 82 and 92\nper cent of the first week's level.\nIn view of the fact that the programs selected for special promotion were all morning\nprograms when women might be expected to predominate in the potential audience, it is\ninteresting to note the results of promotion for women listeners# The amount of lis¬\ntening to WILL by women in the second diary week fell off to 8U per cent of the first\nweek's level, but bounced back in the third week (after promotion) to 265 per cent of\nthe first week's level# In the fourth week it stood at 215 percent of the first week#\nAnd again# listening to the other stations fell below and stayed below the level of\nof the first week#\nWhen the analysis is approached in terms of location of respondents it appears that\nthe increase in listening was greatest among farm women, where the third and fourth\nweeks were 6I4.O and 697 per cent, respectively, of the volume of listening in the\nfirst week. Village woran's listening increased in the third week to 33U per cent,\nand in the fourth week was 153 per cent of the first week's level# In the urban\nfamilies, women's listening rose to 195 per cent in the third week and 160 per cent\nin the fourth week*\nSimilarly, the amount of listening to WILL by women was substantially raised by the\ndirect mail treatment, as compared with the response of women esqposed only to the\ngeneral distribution*\nMost interesting is the fact that while the amount of listening by women was in¬\ncreased most where the promoted programs were concerned (to 332 per cent in the third\nweek), even the non-promo ted programs of WILL had heavy increased in the amount of\nlistening (21*6 per cent in the third week)."
}