{
  "id": "d1571-7",
  "text": "-8-\nWOSU SCHEDULE FOR JULY FEATURES TALKS\nOhio State University *s WOSU program, \"Itoiversity Talks\" has scheduled for July such\nspeakers as Leo Lowenthal, Chief, Program Evaluation Office, Voice of America; Burr\nTillstrom, of Kukla, Fran and Qllie fame; and Charles H. Smith, Ohio industrialist,\nas well as a number 'of programs from United Nations Radio# These latter programs\ninclude: \"Year of Decision,\" a look at atomic energy, starring John Garfield and a\nspecial interview with Dr# Albert Einstein; \"Could Be,\" a Norman Corwin production\nshowing what could happen if nations worked together on common problems with the\nsame determination and resources which they often use in attacking each other; \"Docu¬\nment A/777,\" a documentary on UNfs Uhiversal Declaration of Human Rights, and \"Eleven\nMemory Street,\" the role of the International Tracing Service in returning children\nStolen by Nazis to their parents#\nJames Reston, Diplomatic Correspondent for the New York Times and former publicity\ndirector for the Cincinnati Reds, recently presented the i2th annual Shepard Founda¬\ntion Lecture at Ohio State# His: talk, \"Has the American Press Done Its Job?\" will\nalso be broadcast on \"University Symposium.\"\nOther Symposium speakers are: Dr# Edwin Wright, Department of Defense, and Dr#\nEmmanuel Varandyan, Ohio State University English professor, \"The Middle East in the\nGlobal Pattern\"; Dr# Leslie Hohman, author of The Twig Is Bent, popular book on child\ntraining; and IP-ss Jayne Shover, Associate Director of National Society for Crippled\nChildren and Adults, \"American Children Today\" ^ and Roger Bosworth, Ohio State Uni¬\nversity Philosophy department faculty menber, in a weekly news feature#\nU# OF AIABAMA SCRIPT EDITOR ON VISIT TO BBC\nLeRoy Bannerman sailed May 1 on the Ryndam for a few months visit in England where he\nplans to observe the production of documentary prgrams at the BBC# He is on a three-\nmonths leave of absence from the University of Alabama where he is Script Editor of\nthe Radio Broadcasting Services#\n' WAER RURAL RADIO NETWORK HOOKUP\nFollowing negotiations between radio station WAER, Syracuse University*s FM broad¬\ncasting outlet, and the Rural Radio Network, it was announced by WAER Station Manager\nEdward C. Jones that the University Station will add two and one half hours of pro¬\ngrams originated by New York Classical music station WQXR, and relayed on FM through¬\nout New York State by the Network, to the WAER program schedule# These programs on\na regular s chedule c ommenced Monday, May 12th#\nr Jones announced that the WQXR broadcasts would be heard on WAER Monday through Friday#\nHe further stated that the programs would be in complete accord with the specialized,\nnoncommercial educational program policy of WAER# The University station will carry\nthe program \"Symphonic Matinee,\" a classical music disc jockey show; studio perform¬\nances by distinctive WQXR piano and chamber ensemble artists; and, finally, \"Music\nMagazine,\" a show devoted to intimate facts and commentary about the entire field\nof classical music#\nJones stated that the WQXR programs were added for the principal reasoif of a more\nbalanced and distinctive program schedule#, Under this new system the WAER staff\nwill be provided with additional time for the development of experimental r adio\nproduction and techniques#\nARE YOU TRYING TO RUN A 10 WATT STATION ON A SHOE-STRING BUDGET?\n— THE NAEB CONVENTION WILL HAVE SESSIONS ESPECIALLY FOR YOU"
}