{
  "id": "d1468-3",
  "text": "NAEB NEWS LETTER.. • .MARCH 15, 1940. ...Page 4\nThe National Association of Educational Broadcasters and the National\nAssociation of Teachers of Speech will hold closed meetings Monday\nevening*, Ed Kirby will preside at a joint session of the National\nAssociation of Broadcasters, and the educational directors of CBS\nand NBC stations.\nGeorge V. Denny, Jr., and Frank E. Mason, NBC Tice President and\nAssistant to the president, will be chairman of two sections devoted\nto special problems. These will be held Monday evening. Mr. Denny\nis to preside at a discussion on Adult Education by Radio, and Mr.\nMason will be chairman of the section Pre-Professional Training of\nRadio Personnel.\nOther special sections will discuss Classroom Utilization of Broad¬\ncasts, presided over by Elizabeth Goudy, director of radio for the\nCounty of Los Angeles Schools, and Schoolroom Supervision of Radio,\nwith H. M. Buckley, Cleveland Assistant superintendent of schools,\nas chairman.\nThis year’s demonstration of utilization of a classroom broadcast\nwill be on the secondary level. The demonstration will be presented\nTuesday morning, at the Social Administration Building on the Ohio\nState University campus. An evaluation of the demonstration will\nfollow.\nFollowing the dinner Tuesday evening, round-table discussions will\nbe held on eight general topics. Ed Kirby of the National Association\nof Broadcasters, will lead the discussion on Handling Controversial\nIssues, The section on News and Special Events will have as chairman\nA. A. Schechter, NBC news editor and special events director.\nSubjects of other round-table discussions are Writing for Radio,\nRadio Production, Radio Workshops, Educational Script Exchanges,\nRecordings for School Use and Engineering Quiz Section.\nOn Wednesday morning the Institute will hear Guy Hickock, manager of\nthe International Division of NBC, who is to speak on ’’Developments\nin International Broadcasting.” At the same session, Leonard Power,\ncoordinator of research for the Federal Radio Education Committee,\nwill discuss the activities of the FREC.\nAn orchestra and a cast of radio actors will close the Institute\nWednesday afternoon, May first, with demonstrations of two types of\neducational broadcasts. \"Fortunes Washed Away,\" a program on soil\nconservation, will be presented by a cast of actors from 7LW,\nCincinnati. An orchestra from the Cincinnati College of Music will\npresent \"Music of the Masters,” a program in music appreciation.\nJoseph Ries, WLW educational director, will speak on the topic,\n\"Planning and Production of the Program.\"\nAs in previous years, proceedings of the Institute will be published\nin a yearbook, \"Education on the Air.\" All sessions will be held\nin the Deshler-Wallick Hotel except on Tuesday and Wednesday mornings,\nwhen meetings will be held at the Social Administration Building on\nthe campus of Ohio State University."
}