{
  "id": "d1631-1",
  "text": "NAB Counts Broadcasting Students\nAccording to a survey by the NAB, 4,480 students at 127\nU. S. colleges and universities are seeking degrees in radio\nand TV broadcasting. Of these, 3,527 seek bachelor’s degrees,\n773 master’s, and 180 doctorates. Comparable figures for last\nyear were 2,994; 593; and 132—for a total of 3,719.\nSeminar to Look at Research\n•Temple University and the USOE will cooperate in a three-day\nseminar on the findings of recent research on communication and\ntheir implications on school-community relations. Some 35 to 40\noutstanding individuals will meet at the university April 26 to 28\nto present and review research papers and then to focus attention\non needed research studies in mass communications media. Par¬\nticipants will represent four groups—school superintendents, di¬\nrectors of school-community relations programs, professors of\nschool administration, and research specialists in the fields of psy¬\nchology, sociology, political science, journalism, and audiovisual\nmedia.\nPlan 1965 NAEB Convention\nMembers of the planning committee for the 1965 NAEB conven¬\ntion (Washington, October 31-November 3) met in Washington\nearly in February to assign responsibilities as follows:\nPublicity and press—Thomas Aylward, associate professor,\nUniversity of Maryland.\nEquipment—Anna Hyer, executive secretary, DAVI; Har¬\nold Wigren, ETV consultant to NEA; Oscar Reed, Jansky &\nBailey; Don Williams, director of broadcasting, WAMU, Amer¬\nican University.\nPersonnel—William McCarter, general manager, WETA-\nTV; Williams; Louise Walker, supervisor, Educational Services\nCenter, Montgomery County Public Schools; Lillian Brown,\nradio-TV department, George Washington University; Aylward.\nLadies activities—Walker and Brown.\nMilitary meeting—Col. Robert Wood, chief, Audio Visuals\nSystems Group, the Pentagon.\nEngineering sessions—Reed.\nSide trips—Wood and Walter Whitaker, director, TV and\nRadio Branch, NASA.\nPost-convention trips—Walker and Brown.\nDecorations—W alker.\nGovernment sessions—Gertrude Broderick, radio-TV spe¬\ncialist, USOE, chairman; Robert Hilliard, chief, Educational\nBroadcasting Branch, FCC; Thomas Clemens, chief, Educational\nMedia Branch, USOE; John Hurley, deputy assistant to the\nUnder Secretary of ETV, HEW.\nNews Notes\nPERSONNEL\n^ Lawrence E. Dennis has resigned from the American Coun¬\ncil on Education effective June 30. He will be working with a\nFord Foundation education program in Venezuela, Mexico,\nand Central America, headquartering in Caracas.\ny Bill Arhos has been promoted from producer-director to\nproduction manager of KLRN-TV, in charge of production in\nthe Austin studios.\n^ Lewis Freedman is the new director of programing at\nWNDT, New York City. He was one of the original pro¬\nducers of “Camera Three,” for which he produced 125 con¬\nsecutive programs; most recently he produced 13 programs\nfor “Dupont Show of the Week.”\ny Mrs. Rose Blyth has rejoined the public relations staff\nof the California Institute of Technology as director of TV,\nradio, and film activities. After working there for seven years,\nshe left in 1962 to take part in the formation of the Los An¬\ngeles ETV station, KCET. In her new position she will con¬\ncentrate on developing material for TV and radio programs!\nand on expanding the film library. She will be in charge of\ndistributing these materials to ETV stations and other or¬\nganizations.\n^ Bert Briber has joined the Television Information Office\nas executive editor. He was with ABC for nine years, but\ncomes to TIO from a New York advertising agency, for\nwhich he was promotion director.\ny John H. Tyo has been named supervisor of motion pic¬\nture production at Syracuse University. He was formerly head\nof the motion picture unit of the RAND Corporation, an in¬\ndependent, nonprofit corporation which does 'long-range plan¬\nning for the Defense Department.\ny Robert C. Dudley is producer/director for cultural affairs\nfor Pennsylvania State University’s new station, WPSX-TV.\nHe was formerly producer/director at KUON-TV, Univer¬\nsity of Nebraska.\n^ The Georgia ETV Network has several new staffers. John\nR. Haney is the program development administrator, David\nO’Keefe executive producer, J. Hunter Todd film director,\nand John Vance chief engineer for the network station at\nAugusta, WVAN-TV. Haney was formerly program director,\nWUFT, University of Florida; production manager for\nWYES, New Orleans; and a producer for WUNC, Univer¬\nsity of North Carolina. O’Keefe was a producer-director and\nproduction manager for KLRN, San Antonio-Austin; Todd\nwas a producer with Williard Film Productions; and Vance\nwas assistant chief engineer at WTOC, Savannah.\nSTATE AND REGIONAL\n^ Ohio’s ETV Network will come of age April 9 when its\neight stations air at the same time a three-hour documentary\non the state’s contributions to the Civil War. The newest of\nthe stations is Cleveland’s WVIZ, which began operation in\nFebruary. Plans call for two more stations.\n^ A “live” ETV connection between Boston and WNED-\nTV, Buffalo, may be less than 18 months away, according to\nDonald Quayle, executive director of the EEN, which acts\nas a program exchange center for 17 ETV stations in the\nnortheast. Only 7 of the stations are now interconnected, but\nEEN’s hope is for all 17 to be, with eventual connection with\nthe Ohio network. The Buffalo connection hinges on the es¬\ntablishment of the proposed New York ETV network.\nLast month CBS donated TV equipment valued at $180,003\nto the EEN.\n^ Relocation of its transmitter and a boost to full power al¬\nlows KUON-TV, University of Nebraska, to reach over half\nthe state’s population. This is the first step toward a 7-station\nstate network. Two more channels are slated to become oper¬\nable this year, in Lexington and Omaha.\ny If the New York legislature goes along with requested\nfunds, phase one of the state’s UHF network will be to link\nAlbany and Buffalo ETV outlets by two-way microwave.\nPlans are for the $11.8 million network to be in operation by\n1975. Ultimately all 58 units of the State University would be\nconnected by one-way microwave.\ny Jansky & Bailey has proposed an ETV system for Illi¬\nnois of 12 new UHF stations linked by a 1250-mile micro-\nwave network. Budget estimates indicate an initial cost of\n$7.75 million.\ny The South Carolina ETV Commission has asked for ap¬\npropriations of $250,000 toward construction of a broadcast\nstation in Columbia. This would bring ETV to 21 counties.\nThe state now has two ETV stations—in Greenville and\nCharleston—in addition to a state-wide CCTV system for its\nschools, hospitals, and industries.\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, I 19 Gregory Hall,\nUrbana, III. 61803. $5.00 a year. Editor: Betty McKenzie. Editorial\nassistant: Skip Robinson. Phone 333-0580. Area Code 217. TWX\n217-344-0970.\n2\nNEWSLETTER"
}