{
  "id": "d1631-3",
  "text": "Service Committee. That organization has asked KWSC to\nrelease its tapes and films for national distribution on other\nstations and networks.\ny In its radio broadcasts of away-from-home basketball\ngames this year, KWSC has tried something different. In¬\nstead of taking a feed from another station, a play-by-play\nreport came to KWSC via leased Western Union service. As\nthe telegraphed report came in, a production crew went to\nwork to “recreate” the image of the game being played else¬\nwhere. Listener reaction has been favorable.\ny WEDU, Tampa, has produced three 90-minute specials on\nYbor City, Tampa’s historic Latin Quarter. The first half\nof each program is a drama on videotape, with a mid-program\nswitch to a live studio interview.\ny The Art Forms of the Organ is a 21-program radio series\nprepared at WILL, University of Illinois, which traces the\nhistorical development of the principal forms of organ com¬\nposition.\n^ In a series on Mythology, telecast over KLRN-TV, the\nrelevance of Greek myths to modern life is examined—relat¬\ning an Atlas missile to the myth of Atlas, for instance.\ny Exclusive hi-fi tapes from Moscow are being heard for\nthe first time in this country over WNYC-FM. The tapes\nwere obtained through the East-West Cultural Exchange\nAgreement. Through a special arrangement with the Insti¬\ntute of International Education and the Moscow Art Theater,\nWNYC-AM obtained exclusive rights to record and broad¬\ncast Moscow Art Theater seminars, resulting in a series called\nSeminars in Drama, broadcast during the last three months.\ny The South Carolina ETV Network recently broadcast an\nhour-long program on moonshining in the state.\n^ WOUB-TV, Ohio University, recently broadcast an orig¬\ninal half-hour TV play for children, The Princess and the\nT ailor.\nPublications & Films\n• NBC has provided the NAEB with some copies of the\n24-page election manual which NBC used during the 1961\ncampaign. NAEBers may obtain copies as long as the supply\nlasts by writing to the NAEB Urbana office. They are prob¬\nably most useful to institutions which have schools or depart¬\nments in communications.\n• Helps for Radio Station News Correspondents is a leaf¬\nlet by Wilbur Peterson, head of media management at the\nUniversity of Iowa journalism school. Write to the school for\ncopies; price: $1 for 10 copies.\n• KDTH, Dubuque, Iowa, has released a comprehensive\nstudy of radio information broadcasting in portions of Illi¬\nnois, Iowa, and .Wisconsin. If interested, write to Bob Wood¬\nward, Jr., station manager, at KDTH.\n• Eight filmed episodes from the TV series Profiles in\nCourage will be available for classroom viewing next year.\nThey will be available in two 25-minute reels for each sub¬\nject at $300 per subject, purchasable under NDEA Title III\nFor information about the films or NDEA procedures, write\nto Profiles in Courage, Robert Saudek Associates, Inc., 630\nFifth Avenue, New York, New York 10020.\n• Available for $1.75 each from the University of Pitts¬\nburgh Book Center is The Professional Education of Media\nService Personnel, giving recommendations for training of\nmedia service personnel for work in schools and colleges.\nHere and There\nFormer FCC Chairman Newton Minow, speaking at Stanford\nUniversity January 28, said that both political parties should\nreceive free TV time during the last month of national election\ncampaigns. He proposed that the national committees of the\nDemocrats and Republicans each receive one free hour per week,\nwith third parties receiving smaller amounts.\n• Newscaster David Brinkley, in an interview broadcast\nover WAER (FM), Syracuse University, advised those who\nwant to be TV newscasters to have a broad education. He said\nthey should “stop wasting their time with speech courses be¬\ncause it doesn’t matter that much,” and suggested they take\ncourses in American history, political science, economics.\n• Zenith has asked the FCC to authorize subscription TV\non a nationwide basis.\n• At a series of weekend seminars beginning in April, Sigma\nDelta Chi members will focus on such current professional\nproblems as the conflict between bar associations and the\npress over pre-trial publicity.\n• The University of Illinois extension division will off el¬\nan institute in programed instruction and language learning\nJuly 5-August 14, 1965. April 15 is the deadline for applica¬\ntion. Forms may be obtained from: Director, Summer In¬\nstitute, Training Research Laboratory, University of Illinois,\n8 Lincoln Hall, Urbana, Illinois 61803.\n• Minnesota Mining & Mfg. Co. has offered to give $2,000\nworth of transparency-projection equipment and other teach¬\ning aids to teacher-training institutions. Colleges graduating\na dozen or more teachers a year are eligible for the grant.\nMay 31 is the deadline for requests, to be sent to: Bertrand\nY. Auger, manager of the visual products department, 3M,\n2501 Hudson Road, St, Paul, Minnesota.\nPLACEMENT\nPOSITIONS AVAILABLE\n(For information, write the Placement Service, at the NAEB\noffice in Washington. In order to be considered through these\nchannels, the reader must be an Individual Member of the\nNAEB, with credentials on file with the NAEB Placement Serv¬\nice. Non-members can save time by sending the $10 annual\ndues and $10 Placement registration fee at the time of in¬\nquiry.)\nA-l Midwestern university seeks instructor or assistant pro¬\nfessor for broadcasting courses within speech. Salary and\nrank determined by experience in broadcast production\nand college teaching. Ph.D. preferred. Supervision of as¬\npects of FM station operation and CCTV. Academic year\nappointment, September I, 1965.\nA-2 Producer-director and visual materials designer needed\nby new CCTV at upper Midwest university. Experience\nin ETV or ITV installation preferred.\nA-3 Experienced cinematographer-editor, preferably but not\nnecessarily with producer-director capabilities and am¬\nbitions, thoroughly competent in all techniques of 16mm\nfilm production and editing, sought by east-central ETV\nstation. Position open immediately. Salary based on ex¬\nperience and skills.\nA-4 Producer-director for large eastern university with rapid¬\nly expanding ITV division. Duties will include direction\nof CCTV programing in new studio and possibly some\nopen-circuit direction of telecourses. M.A. and two years\nof experience required. Position to begin July I, 1965.\nSalary: $6,000 to $7,000.\nA-5 TV engineer, experienced in all phases of station opera¬\ntion, needed to teach college accredited communica¬\ntions course plus limited assignment in major ETV sta¬\ntion operation. Midwest; salary open.\nA-6 Northwest public school system seeks producer-writer for\nETV department; salary open. Candidates should be\nmale, 25-35 years old and hold a degree in education\nand/or professional communication areas. Position open\nSeptember, 1965.\nA-7 Staff production positions (not assistantships) in radio-\nTV for qualified students working on M.A. degree in\njournalism. B.A. and academic acceptance to graduate\nschool necessary. Ten-month contract for half-time or\nquarter-time position, renewable for second year if de¬\nsired.\n4\nNEWSLETTER"
}