{
  "id": "d1775-1",
  "text": "HILL-ELLIOTT BILL GRANTS\nFUNDS FOR RESEARCH\nThe Magnuson Bill reached Congress in its 85th\nsession. On the 29th of May, 1958, the Senate ap¬\nproved this bill which grants up to $1 million to each\nstate for the development of ETV facilities. Under\nthe bill, the federal government would finance TV\nbroadcasting equipment by providing grants-in-aid\nup to $1 million to state educational institutions or\nagencies organized for ETV purposes. In the final\nrush before adjournment, it failed to reach the floor\nof the House. The fate of the bill must wait until\nnext year ana the first session of the 86th Congress.\nHowever, the Hill-Elliott Bill (National Defense\nEducation Act of 1958) did pass both houses of Con¬\ngress. It provides certain funds for research and ex¬\nperimentation in educational broadcasting. The sec¬\ntion applicable to educational broadcasting is Title\nVII. For the convenience of our members it is re¬\nproduced here in full.\nTITLE VII—RESEARCH AND EXPERIMENTA¬\nTION IN MORE EFFECTIVE UTILIZATION OF\nTELEVISION, RADIO, MOTION PICTURES\nAND RELATED MEDIA FOR EDUCATIONAL\nPURPOSES\nPart A - Research and Experimentation\nFUNCTIONS OF THE COMMISSIONER\nSec. 701. In carrying out the provisions of this part the Com¬\nmissioner, in cooperation with the Advisory Committee on New\nEducational Media (established by section 761), shall (through\ngrants or contracts) conduct, assist, and foster research and ex¬\nperimentation in the development and evaluation of projects in¬\nvolving television, radio, motion pictures, and related media of\ncommunication which may prove of value to State or local educa¬\ntional agencies in the operation of their public elementary or\nsecondary schools, and to institutions of higher education, in¬\ncluding the development of new and more effective techniques and\nmethods—\n(1) for utilizing and adapting motion pictures, video\ntapes and other audio-visual aids, film strips, slides and other\nvisual aids, recordings (including magnetic tapes) and other\nauditory aids, and radio or television program scripts for\nsuch purposes;\n(2) for training teachers to utilize such media with\nmaximum effectiveness; and\n(3) for presenting academic subject matter through\nsuch media.\nGRANTS-IN-AID; CONTRACTS\nSec. 702. In carrying out the provisions of section 701, the\nCommissioner—\n(1) may make grants-in-aid, approved by the Advisory\nCommittee on New Educational Media, to public or non¬\nprofit private agencies, organizations, and individuals for\nprojects of research or experimentation referred to in section\n701;\n(2) may enter into contracts, approved by the Ad¬\nvisory Committee on New Educational Media, with public or\nprivate agencies, organizations, groups, and individuals for\nprojects of research or experimentation referred to in section\n701; and\n(3) shall promote the coordination of programs con¬\nducted or financed by him under this title with similar pro¬\ngrams conducted by other agencies, institutions, foundations,\norganizations, or individuals.\nSee You\nPart B - Dissemination of Information on New Educational Media\nFUNCTIONS OF THE COMMISSIONER\nSec. 731. In order to disseminate information concerning\nnew educational media (including the results of research and ex¬\nperimentation conducted under part A of this title) to State\nor local educational agencies, for use in their public elementary\nor secondary schools, and to institutions of higher edubation, the\nCommissioner—\n(1) shall make studies and surveys to determine the\nneed for increased or improved utilization of television, radio,\nmotion pictures, and related media of communication by State\nor local educational agencies and institutions for higher ed¬\nucation for educational purposes;\n(2) shall prepare and publish catalogs, reviews, bibli¬\nographies, abstracts, analyses of research and experimentation,\nand such other materials as are generally useful in the en¬\ncouragement and more effective use of television, radio, motion\npictures, and related media of communication for educational\npurposes;\n(3) may, upon request, provide advice, counsel, tech¬\nnical assistance, and demonstrations to State or local educa¬\ntional agencies and institutions of higher education under¬\ntaking to utilize such media of communication to increase\nthe quality or depth or broaden the scope of their educational\nprograms;\n(4) shall prepare and publish an annual report set¬\nting forth (A) projects carried out under this title and the\ncost of each such project, and (B) developments in the util-\nzation and adaptation of media of communication for educa¬\ntional purposes; and\n(5) may enter into contracts with public or private\nagencies, organizations, groups, or individuals to carry out\nthe provisions of this part.\nPart C - General Provisions\nESTABLISHMENT OF THE ADVISORY COMMITTEE\nSec. 761. (a) There is hereby established in the Office of\nEducation an Advisory Committee on New Educational Media\n(hereafter in this title referred to as the “Advisory Committee”).\nThe Advisory Committee shall consist of the Commissioner, who\nshall be chairman, a representative of the National Science\nFoundation and twelve persons appointed, without regard to the\ncivil-service laws, by the Commissioner with the approval of the\nSecretary. Three of such appointed members shall be individuals\nidentified with the sciences, liberal arts, or modern foreign lan-\nuages in institutions of higher education; three shall be individuals\nactually engaged in teaching or in the supervision of teaching\nin elementary or secondary schools; three shall be individuals of\ndemonstrated ability in the utilization or adaptation of television,\nradio, motion pictures, and related media of communication for\neducational purposes; and three shall be individuals representative\nof the lay public who have demonstrated an interest in the prob¬\nlems of communication media.\n(b) The Advisory Committee shall—\n(1) advise, consult with, and make recommendations\nto the Commissioner on matters relating to the utilization or\nadaptation of television, radio, motion pictures, or related\nmedia of communication for educational purposes, and on\nmatters of basic policy arising in the administration of this\ntitle;\n(2) review all applications for grants-in-aid under\nPart A of this title for projects of research or experimenta¬\ntion and certify approval to the Commissioner of any such\nprojects which it believes are appropriate for carrying out\nthe provisions of this title; and\n(3) review all proposals by the Commissioner to enter\ninto contracts under this title and certify approval to the\nCommissioner of any such contracts which it believes are ap¬\npropriate to carry out the provisions of this title.\n(c) The Commissioner may utilize the services of any mem¬\nber or members of the Advisory Committee in connection with\nmatters relating to the provisions of this title, for such periods,\nin addition to conference periods, as he may determine.\n(d) Members of the Advisory Committee shall, while serving\non business of the Advisory Committee or at the request of the\nIn Omaha\n2\nNEWSLETTER"
}