{
  "id": "d1775-8",
  "text": "gathered by the Chicago Public Schools Bureau of\nCurriculum in its investigation of what questions\ntrained, certified, and experienced classroom teachers\nstill have regarding the teaching of reading. Registra¬\ntion has been limited to teachers in service, but the\ngeneral public may watch the series.\n► Maine recently began a 30-week series of music\nappreciation broadcasts to make ETV on the class¬\nroom level a reality for that state. The series is the\nproduct of the Maine Secondary Schools Principal’s\nAssociation, Maine Educational Television Associ¬\nates Incorporated, the State Department of Educa¬\ntion, the Maine Teacher’s Association, and the three\nstations providing the use of their facilities on a pub¬\nlic service basis. The entire project was planned to\nmake music training available in places too small or\ntoo remote to engage the services of a music director.\nAbout 300 Maine schools fall in this class, but only\nabout half have signified their interest in the TV\nclass. One of the requirements is that each school\nmust be equipped with a TV receiver.\n^ Twelve prominent persons who made “news” their\nbusiness will take part in the University of Michigan\nradio series, titled “News in 20th Century America.”\nThe series, produced by WUOM-FM is scheduled for\ncompletion next spring.\nPrograms will consist of interviews of newscasters,\ncolumnists, and commentators who will discuss the\nproblems of slanted news, unbiased reporting, cen¬\nsorship, editorializing, adequate informing of the pub¬\nlic, and other pertinent questions.\nThe series is made possible through an ETRC-\nNAEB grant-in-aid and will be distributed by the\nNAEB tape network.\nPERSONNEL\n^ . David R. Collins, formerly in the radio-television\ndepartment of an advertising agency, has been ap¬\npointed business manager of the Metropolitan Edu¬\ncational Television Association (META) in New\nYork City.\n^ Byron Openshaw, a producer, director and an¬\nnouncer for 14 years in Utah radio and TV, has been\nappointed production manager of KUED, University\nof Utah station.\n^ Mr. George Lewin, Chief, Pictorial Engineering\nOffice, Army Pictorial Center, has become the second\nman in the history of the Society of Motion Picture\nand Television Engineers to be honored with two\nawards in one year. Mr. Lewin has been designated\nas recipient of the Samuel L. Warner Memorial\nAward for outstanding contributions to sound for\nmotion pictures and the Journal Award for the out¬\nstanding paper published in the Society’s Journal\nduring the preceding year.\nHeadquarters staff members: bid \"goodbye last\nmonth to Miss Barbara Stevens, traffic manager, and\nMiss Jane Lombard, Newsletter editor and placement\nofficer, who both left to be married. Our new ad¬\ndition to staff personnel, Mrs. Nancy Whitmore, has\nassumed the duties of all three positions.\n^ This month we have again added three more\nnames to the list of Broadcast Pioneers. These are\nLuella Hoskins, Consultant on Radio and Television,\nAssociation of the Junior Leagues of America, Inc.,\nNew York; Mrs. Eleanora Bowling Kane, Specialist,\nRadio and TV, Department of Education, Baltimore,\nMaryland; and Roger J. Houglum, Manager KRVM,\nEugene, Oregon.\nIf you are qualified to claim pioneering service,\n(20 or more years in broadcasting, presently with ed¬\nucational) please let us know and we’ll add your\nname to the list.\nTV TECHNICAL TIPS\n—Cecil S. Bidlack\nAll of a sudden summer ends and again we’re\nplunged into the midst of a busy fall season. School\nbegins, the football season starts, renewed and in¬\ncreased programming begins on educational as well as\ncommercial stations. Autumn, too, brings a round of\ntechnical meetings of value to all radio and TV station\npersonnel. Although two of these meetings will be\nover before this appears in print, it will give you time\nto think and plan for next year, since the pattern re¬\npeats yearly.\nThe first of these meetings is the annual Fall\nSymposium of the IRE Professional Group on Broad¬\ncast Transmission Systems held at the Willard Hotel\nin Washington September 27-28. We’d guess that\n125 were registered for the excellent two-day pro¬\ngram just concluded. While the majority of the\npapers presented were on television topics, there were\nalso papers on FM multiplex and stereophonic\nbroadcasting. Three papers covered television\nswitching facilities by relays, transistors, and a diode\nmatrix vertical interval switcher. Other topics were\nprecise carrier offset, the chroma-key effects system,\nand vidicon operating techniques. One afternoon\nsession was devoted solely to video tape recording\nwith descriptions of the NBC-Burbank color installa¬\ntion and the CBS-New York facilities, followed by\na panel discussion of the uses and problems en¬\ncountered in VTR operation at individual affiliate\nand network owned stations.\nThere was a tour of the new four million dollar\nNBC studios in Washington, which houses the WRC\nOCTOBER, 1958\nSee You In Omaha"
}