{
  "id": "d1775-9",
  "text": "and WRC-TV studios and offices as well as FM and\nTV transmitters. The plant is designed to make most\neffective use of a minimum of operating personnel.\nAll video controls for live and film cameras are located\nin one central control and transmission room. AM\nand FM studios are located in a cluster with all\nmicrophone outputs appearing on all control room\nconsoles. Every studio is visible from each of the\ncontrol rooms.\nThere are two TV studios, one large- and one\nmedium-sized. Eventually these will be equipped for\nlive color originations, with lighting boards relay\noperated so that the lighting for ten different sets\ncan be arranged and then turned on as required by\na control room panel switch. I was interested in the\nfact that no dimming facilities are provided for light¬\ning.\nBy the use of punched paper tape and readout\nand memory devices, automatic TV operation is\npossible once the proper sequence has been set up\non the tape. Automation is used primarily for sta¬\ntion break operation during long stretches of net¬\nwork programming. This automation equipment can\nbe clock-operated and switched from network to\nlocal, rolling and stopping projectors and switching\nbetween film and slide projectors as required and\nback into the network with operating personnel re¬\nquired only to supervise the operation and load the\nprojectors.\nWe’d like to see more representation from educa¬\ntional stations at this IRE PGBTS meeting which is\nusually held the last week end in September. The\n1956 meeting was held in Cleveland; Pittsburgh was\nhost in 1957; and the 1959 meeting has tentatively\nbeen set again for Washington, D. C., with Detroit\nalso a possibility.\n—NAEB—\nThe Tenth Annual Convention of the Audio\nEngineering Society is being held at the New Yorker\nHotel September 29 - October 4 in conjunction with\nthe New York High Fidelity Show and the Audio\nEngineering Show. Some NAEB technical personnel\nregularly attend this event, which is usually held in\nNew York City the first part of October. A full five-\nday program of papers on audio subjects has been ar¬\nranged covering stereo, acoustics, magnetic tape and\nrecording techniques as well as new devices, measure¬\nments, standards, speech input equipment and loud¬\nspeakers. The program looks interesting—hope\nsomeone who attends will give us a report.\n—NAEB—\nWe hope to see many of our readers at the NAEB\nConvention in Omaha, October 14-17. Jack McBride\nand his committee have been busy arranging a varied\nand worthwhile program.\n_N A E B—\nThe week following the NAEB Convention, the\n84th SMPTE Convention is being held at the\nSheraton-Cadillac Hotel in Detroit. The October\n22nd and 23rd sessions are of prime interest to ETV\npersonnel. Wednesday morning (the 22nd) the gen¬\neral topic is television equipment and practices, while\nthat afternoon kinescope recording problems and\nequipment will be discussed. The Thursday evening\nsession (the 23rd) is given over to closed-circuit\ntelevision for teaching, and educational, military\nand medical applications of closed-circuit systems\nwill be described. The Thursday morning topic is\nmachine language translation, while that afternoon\nthe general topic is designing for international tele¬\nvision where eventual contributions towards auto¬\nmatic translations and international standards will\nbe discussed.\n_N A E B—\nBefore we bring this column to a close perhaps\nwe should include a couple of technical tips, since\nthat’s our heading; so here they are:\nFactors for good vidicon performance.\n1. Plenty of light.\n2. Flat lighting.\n3. Reasonable target temperatures.\n4. A good camera.\na) Low noise input.\nb) Linear scanning.\nc) Aperature correction.\nd) Gamma correction.\ne) Stability and reliability.\nMany times the company which is endeavoring\nto sell you new television equipment has used oper¬\nable equipment on hand in its storage warehouse.\nThis equipment may have been taken in trade or\nhave been returned as a result of the station leaving\nthe air. Obviously, the salesman who calls on you\nis interested in selling the new equipment of the\ncompany he represents; however, his company is\ninterested in disposing of this used equipment too.\nWhy not ask about it?\n_N a E B—\nSee you in Omaha!\nN.A.E.B. NATIONAL CONVENTION\nOCTOBER 14-17\nOMAHA, NEBRASKA\n10\nSee You In Omaha\nNEWSLETTER"
}