{
  "id": "d1071-3",
  "text": "-4-\nTHE \"STUDEBAKSR COMMITTEE\" MEETS\n- Our Association will be reprosontod at tho mooting of the Nov/ Federal Radio\nEducation Committee in Washington, D.C* February 17, and 18, H*B. McCarty, as\nProsidont of tho N.A.E.B., is one of 39 members appointed by tho Fodcral Commun¬\nications Commission, with Dr, J.W* Studobakor as chairman of tho committee, to:\n”1. Eliminate controversy and misunderstanding between\ngroups of educators and between tho industry and\neducators,\n2. Promote actual cooperative arrangements between\noducators and broadcasters on national, regional\nand local bases,\"\nWhat will come of this now effort no one knows* \"It’s going to be a head¬\nache,\" says one national observer, \"The communications commission is just doing\na little window-drossing,\" says another* \"No, this is a genuine attempt at im¬\nprovement,\" says a third. Maybo, wo*11 see. But one big barrier to progress is\nthe provision that the committee is limited tc the work of eliminating contro¬\nversy and promoting cooperation \"within tho present broadcast structure. On\nthat basis the plan looks like a search for a palliative, net a corrective.\nPresident McCarty has promised that he will make a \"state of tho nation\"\nreport to N.A.E.B. members as soon as there are any significant developments from\nthe work of the Federal Radio Education Committee* Write him, if you have any\nideas about tho project or suggestions for tho committee*\nEXCHANGE PACKET\nAnother N.A.E.B, oxchango packet has now gone out. Tho expressions received\nindicate that the service should be continued and it will bo, if you, as a mem¬\nber, cooperate by sending in exchange material. Only by unselfishly swapping\nideas can wo bo of mutual help.\nMaterial for tho next packet is now being received by your secretary. Look\nover your activities — and send along samples of anything and everything which\nyou can make available.\nSTATION SURVEY\nSome v/eeks ago your secretary sent out to all educational stations question-\naires to supply information necessary to make N.A.E.B. service more effoctivo.\nThe following stations havo reported: WBAA, ¥CAC, WCAD, WCAT, WESG, WHA, WILL,\nWEAR, XWSC, WOSU, WRUF, YfSUI, WTAW, KBPS, WCAL, KFDY, KFKU, KOAC, KSAC, KUSD,\nWEW, and KWLC.\nWe still want reports from these: WGST, WHAZ, WOI, WSAJ, WSVS, VAIL, KFJM,\nand KFGQ.\nA REMINDER\nTho annual membership campaign is on* Once each year (sometimes oftener\nin cases where reminders are necessary) it is someone's unpleasant duty to col¬\nlect duos. The statements havo boon sent out. If you put yours in tho \"immed¬\niate\" file and forgot about it, won’t you dig it out now and o.k. it for payment?\nIf your statement hasn’t reached you, notify the Secretary and another will\nbe sent."
}