{
  "id": "d1475-2",
  "text": "TV TECHNICAL TIPS NO. 29\nThe revised NAEB Technical Directory is ready\nto go press. The new edition will contain the names of\nover 400 engineers and technicians working at educa¬\ntional radio or TV stations and production centers.\nThis is over a 100 per cent increase in the listings of\nthe original directory published in May, 1955; yet it\nstill is not complete.\nWe want to thank those of you have returned the\ndirectory questionnaires and test equipment data.\nWe believe we have included the names of all who\nsent this information.\nWe have also sent a second inquiry to some 20\nstations, some of whom have not yet returned the in¬\nformation (although each form was accompanied by a\nstamped return envelope). Our crystal ball is some¬\nwhat cloudy, so if the technical personnel at your sta¬\ntion is not included it isn’t because we haven’t tried.\nWe’d like to keep this directory up-to-date, and\nwould appreciate having the names of those added to\nyour technical staff. If someone leaves, too, we’d like\na post card or short note asking us to delete his name.\nIt would also help if you would advise us of errors in\naddressograph plates or in the station address and\ntelephone number.\nData secured as a result of the test equipment\nquestionnaire is being compiled. We hope to publish\nthis material soon and circulate it to all chief engi¬\nneers.\n* * *\nAnother publication of the NAEB Engineering\nService is an article which contains the constructional\ndetails of a two-channel transistor remote amplifier-\nmixer. This was designed and built by Donald K.\nHaahr of the WOI staff. The completed amplifier is 3\ninches high, 6 inches wide and approximately 8 inches\nlong. It has an overall gain of 80 DB into a 600 ohm\nload and excellent frequency response.\nThe article is complete with schematic, parts list,\nfrequency response, noise and distortion character¬\nistics, as well as three illustrations which show im¬\nportant constructional details and the completed\nunit.\nCopies of this paper have been mailed to all chief\nengineers of educational radio and TV stations. We\nshall be glad to take care of individual requests as\nlong as the supply lasts.\n* * *\nFor those of you who are thinking of new studio\nfacilities, we’d suggest reading an article which ap¬\npeared in the January 7 Broadcasting-Telecasting. It\nappears on Page 70, and tells how WSVA-TV built a\nstudio-office building with 2240 square feet of space\nfor $25,000. The studio itself is 28 x 32 feet with a\n7 x 13 foot control room and a 7 x 9^ foot projection\nroom. The building also provides space for film pre¬\nview, an art room, darkroom, combination dressing\nand rest rooms, a program director’s office and a 280\nsquare foot general office.\nThe building is constructed of Armco galvanized\nsteel. It is fully insulated and temperature is main¬\ntained between 70 and 73 degrees throughout the year\nby a Westinghouse heat pump system. These pumps\ndraw heat from the outside air even in winter and pro¬\nvide cool air in the summer. The two five ton units\nemployed are installed in outdoor metal bins.\nThe $25,000 is all inclusive and covers studio fix¬\ntures, (except TV lighting system) flooring, wiring\nducts, toilets, conduits, air pumps and a ball bearing\nsliding door. At a little over $11 a square foot, this is\nvery reasonable building cost. Construction was be¬\ngun on July 15 and the first TV program went on the\nair from the studio on December 15.\n* * *\nThose of you who watched the inauguration Jan¬\nuary 21st were privileged to see some of the first\nnetwork use of Ampex videotape recording for de¬\nlayed broadcast. Both CBS and NBC taped the oath\ntaking ceremony. CBS replayed it twice at approxi¬\nmately 30 minute intervals after the actual ceremony.\nNBC also reported that it played back a tape of the\nceremony less than a half hour after it had occurred.\nThe use of magnetic video tape recordings is\ngradually increasing on the networks. December 24\nCBS began using videotape for the West Coast re¬\npeats of the Arthur Godfrey “Talent Scouts” program\non Mondays at 8:30 p. m. EST. Beginning in March\nwhen Godfrey is on vacation, the program will be pre\nrecorded and played back for both East and West\nCoast broadcasts.\nNBC is now making use of videotape for West\nCoast repeats of five Monday-Friday program series.\nBeginning January 22, NBC will present the “Truth\nor Consequences” program (11:30 a. m. - 12 noon\nEST) on tape. The program will be recorded at a\n6 p.m. PST, audience performance and repeated on\ntape the following day in both East and West.\nAmpex officials have also announced they are in¬\ncorporating six new features in the production models\nof the videotape recorders as a result of the experi¬\nence gained by CBS and NBC in their use of the pro\ntotype models. Delivery on the production models is\nnow set for November, 1957, nine months later than\nthe anticipated start of delivery at the time of the\ninitial demonstration of the machine last April."
}