{
  "id": "d276-112",
  "text": "7. The psychological aspects of aging. A review of research findings relating\nto mental ability in the later years.\n8. The importance of continued intellectual activity if mental abilities are\nto be retained in the later years.\n9. Sociological aspects of agings the role and possible role of the older\nperson in our society.\n10. Economic aspects of aging; the financial needs of older persons.\n11. Planning for retirement; laying out specific goals for accomplishment in\nthe later years.\n12. Profitable activities for older persons; ways and means of starting small\nbusiness enterprises, etc.\n13. The contributions which older citizens can make through participation in\ncivic, social, and political activities; the community5s responsibility\nfor the local problem.\n2. Production: Production could be done either at NAEB member stations, at the CBC,\nor in commercial studios, or all three, under the supervision of the Center. It\nis believed that such universities as the University of Michigan, where annual\nsummer international gerontology conferences are held, and where Dr. Wilma\nDonohue is available, might, with possible financial aid to enable the securing\nof research, writing and production assistance, undertake such a series in whole\nor in part. Boston is also the scene of considerable activity in this field.\nA fine Industrial Program for Retired Persons has been on the air there for\nsome time, supported by the Agnew Foundation (Mr. John Agnew, First National\nBank of Boston).\nIt is also believed that actualities and interviews from other nations,\nwhich might be provided by arrangements with the CBC, BBC, ABC (Australia),\nRDF, RAI, and the Swiss and German Radio, with all of which the NAEB has excel¬\nlent relationships, might greatly enrich understanding of the universal nature\nof this problem. Later vise of some or all programs: of this series by those na¬\ntions, and possibly by the International University of the Air, should also be\nvisualized, as mentioned below."
}