{
  "id": "d276-29",
  "text": "OFFERING\nNAEB RADIO NETWORK\nAugust 9, 1955\nOFFERING\nSeries 55-36 (Fall 1955)\nTitle: THE BBC THEATRE\nType: Drama\nTime: 50 to 90 minutes\nNo.: 13 programs\nOrigin: BBC\nAudience: Adult\nRelease: Issue #1*0 (Oct. 2)\nAll but one of these programs is drama. The one exception is Program #11, \"A\nDialogue on Toleration,” which is an imaginary conversation between John Locke and\nthe third Earl of Shaftesbury. Please note the \"Dates of expiry.\" Programs should\nnot be broadcast after these dates. Times given are approximate.\nThe tape recordings should be returned to, or traded with, the NAEB Radio Net¬\nwork (NOT BBC).\nProg. Issue Title\n1. hO (Oct. 2) Prisoner*s Progress - A drama of imprisonment and escape\nwritten and produced by Louis MacNeice. In it the prisoner-\nof-war camp represents various kinds of mental and intellect¬\nual imprisonment, and the focus is not on the war but on one\nor two individual prisoners. Date of expiry: Apr. 26 *57.\nTime: 89:^0\n2.\n3.\nh.\nill (Oct. 9) The Rivals - By Richard Brinsley Sheridan, adapted for radio\nand produced by Martyn C. Webster. As Sheridan*s first play,\nit was produced at Covent Garden in 1775 when the author was\nonly twenty-three. It was withdrawn as a failure; but after\nthe replacement of an unpopular actor in the part of Sir\nLucius 0*Trigger, it was immediately successful and is still\none of the most popular comedies in the English language.\nDate of expiry: July 1, *57. Time: 89:1|6.\n[|2 (Oct. 16) A Month in the Country - Margaret Leighton stars in this play\nby Ivan Turgenev. \"A Month in the Country,\" considered\nTurgenev*s masterpiece, reflects the carefree mood of a\nlanded gentry still reasonably prosperous in the period in\nwhich he wrote. The comedy of a Russian holiday, it tells\nof the rivalry between a married woman and an unattached girl\nfor the same young man. Released previously in Fall 195U.\nDate of expiry: Feb. 13 *56. Time: 88:35*\nU3 (Oct. 23) An Ideal Husband - The comedy by Oscar Wilde, adapted for\nbroadcasting by Gilbert Travers Thomas, and produced by Val\nGielgud. The play, which was first performed in London in\n1895, is set within the circle of sophisticated Victorian\nsociety into which the brilliant adventuress, Mrs. Cheveley,\nhas contrived an introduction. Her knowledge that the wealth\nand the distinguished Foreign Office career of Sir Robert\nChiltern are founded on his sale of a Cabinet secret is her\nmeans of forcing him to suppress the official report on a po¬\nlitical and financial swindle. Date of expiry: Aug. 22 *57.\nTime: 89:3U*"
}