{
  "id": "d276-34",
  "text": "OFFERING\nNAEB RADIO NETWORK\nAugust 9, 1955\nOFFERING\nSeries 56-1 (Winter 1956)\nTitle: SHAKESPEARE FESTIVAL\nType: Drama\nTime: 57-90 minutes\nNo.: 12 programs\nOrigin: BBC\nAudience: Adult\nRelease: Issue 7fl (Jan. 1)\nSHAKESPEARE FESTIVAL consists of six of Shake spe are *s plays, each divided into\ntwo programs. Most have been released to NAEB Radio Network stations before, but\nthey have been quite popular and are therefore being released together as a series.\nIf you use the series THE ELIZABETHAN THEATRE, you may wish to \"follow up\" with\nthese programs. Times given are approximate.\nThe tape recordings should be returned to, or traded with, the NAEB Radio Net¬\nwork (NOT BBC).\nProg.\n1.\n2.\n3.\nU.\n5.\n6.\nIssue\nTitle\n1 (Jan. 1) A Midsummer Night*s Dream, Pt. I - Ralph Richardson as Bottom\nin the comedy by William Shakespeare, with Mendelssohn*s\nmusic arranged by John Hollingsworth who conducts the Royal\nPhilharmonic Orchestra and a section of the Ipswich Coopera¬\ntive Girls* Choir. The production script is prepared by\nLance Sieveking, and the play is produced by Val Gielgud.\nDate of expiry: Mar. 30 *56. Time: 63:51.\n2 (Jan. 8) A Midsummer Night*s Dream, Pt. II. Time: 88:U2.\n3 (Jan. 15) Anthony and Cleopatra, Pt. I - Michael Redgrave as Anthony and\nPeggy Ashcroft as Cleopatra in the Shakespeare Memorial Theatre\nConpany*s presentation of \"Anthony and Cleopatra.\" The play\nis produced for radio by Peter Watts from the Stratford-on-\nAvon production by Glen Byam Shaw. The music, which was com¬\nposed for the stage production by Anthony Hopkins, is played\nby the Shakespeare Memorial Theatre Orchestra, directed by\nHarold Ingram. Date of expiry: Dec. 22 *56. Time: 59:28.\nU (Jan. 22) Anthony and Cleopatra, Pt. II. Time: 83:23.\n5 (Jan. 29) King Henry IV - Part One, Pt. I - Donald Wolfit as Falstaff\nin \"King Henry IV - Part One.\" The music is composed by\nNorman Demuth, and the production is by Wilfred Grantham.\nDate of expiry: Jan. 30, *57. Time: 7U:U6.\n6 (Feb. 5) King Henry IV - Part One, Pt, II. Time: 7U:32.\n7. 7 (Feb. 12) The Taming of the Shrew, Pt. I - Adapted for broadcasting and\nproduced by Peter Watts. The music is collected and arranged\nby Jeremy Noble, The break between the two parts of the play\noccurs in Act II, Scene I after Petruccio has fixed the day\nof his marriage to Katharine and has left for Venice to buy\nthe apparel for the wedding. Date of expiry: Aug. 8, *57.\nTime: 56:32."
}