{
  "id": "d276-73",
  "text": "WBOE—\n-k-\n*#•&*•«•*■**■&■**\nlo It might be advisable to consider the possibility of having the workshop start\none week earlier than it did at this session* This might enable some members\nto attend who otherwise could not because of school opening dates, I believe\nthe organization of this workshop was excellent and I have no comments for im¬\nprovement*,\n2« I expected to increase my knowledge of TV station operation, equipment end\ntest instrumentation* I also hoped to meet other engineers in the educational\nTV field and gain a knowledge of their problems and the solutions to them.\nThose things would all be valuable to me when we order, install, and operate\nour new TV studio.\nThe workshop provided me with the opportunity to complete these objectives and\nin no respect did it fall short of my expectations*\n3° I believe it is impractical to attempt arty type of workshop for 20 or more engi¬\nneers where actual equipment operation could be conducted. The problems of\nsuch a workshop would be too extensive for value received.,\nk° a* I think the suggestion of having a tape copy of Ed Stasheff!s speech avail¬\nable to NAEB members should be followed up and notices sent to workshop engi¬\nneers when they may obtain same .,\nbo If at all possible it might be helpful to make copies of TV log and main¬\ntenance report forms available to NAEB members\nc. Also if feasible, I think it would be desirable to publish a list of salary\nranges paid to TV technicians* I would be glad to assist in such a study ,\nd* It would be interesting to have a list of NAEB engineers and technicians\nwho are \"hams\" and their call letters*\nThese comments are included with item No* U*\nWc B, Louis\n■ft***-*#-**#*-\nState University of Iowa—\n1* I have no suggestions for changes in the workshop set-up or organization*\nSome of us during discussions thought it would be a good idea if we would have\na sort of regional conference just after the workshop report is issued so that\nmore people in our area could benefit by our attendance and it would give us\nan opportunity to gather more information which could be disseminated through\nthe Newsletter* We thought perhaps a two day conference including parts or\nall of 3 or U states at a central meeting place* Perhaps you could help us\nif you think it a good idea*\n2, I expected to receive the benefit of the knowledge and experience of others\nto help me do a better job for ray Institution- This is exactly what I got\nout of the workshop plus a few ideas of ray own that may benefit others if\nthey work out*\ni"
}