{
  "id": "d276-83",
  "text": "2ft In looking over the advance program of the Workshop, I was impressed by the variety\nof subjects to be presented,, Truly, I looked forward to it* And I was not dis¬\nappointed by a single item. The several demonstrations on lighting, the wealth of\nmaterial on Kinescope Recording, etc*, were all very helpful.\n3* Depending on the kind of people who would make up the Workshop, actual operation\nmay or might not be of particular value to the member. When a group of 2$ people\nis involved, smaller groups of 5 or 6 could perhaps be handled easily, if there\nwere some other activity in which the remainder could participate.\nlj. The way in which the workshop was conducted was, I thought, very good. There was\nsome comment on the part of others that \"it was a long day from 8:00 A.M. to 10:00\nP.M.\" but after all, that is to be expected when attending a \"workshop,,\" When the\nprogram tries to encompass that amount of material in so short a time, the day has\nto be made that long in order to fully cover the agenda. Sure, it would have been\nnice to have had time to \"take in the sights\" but that was not the intent and pur-\npose of this session.\nSc The way in which the NAEB Engineering Service could help our organization would be\nsuch as this: If we could have the benefit of Mr. Bialack5s know-how gained by\nvisiting the many Educational TV stations throughout the country, in helping us lay\nout our studios & related space* But perhaps this is not the function of the NAEB\nTV Engineer,. I think that the Engineering Newsletter, with its \"Helpful Hints\"\nis good. But we do not have the budget or the time to see how the other fellow is\ndoing the sems thing we are trying to do. We did a lot of pioneering in FM in the\nearly days, had no one to follow, but with TV, with its diversity of space require¬\nments etc., is something that is made easiei* by someone who has been around the many\nother completed stations.\nIn conclusion, I wish to state that I did get a lot out of attending the Workshop,\nboth from the lectures and the \"bull sessions\" afterward, and in talking to indi¬\nvidual members-\nI want to take this opportunity to thank those whose generosity made it possible for\nme to attend, and the committee whose selection of me as a member o\nEmil H , Andre sen\nWILL-TV <»»«\nWhen I was first approached on the topic of attending the Workshop, I must admit I had\nlittle enthusiasm for the idea. In fact, to be perfectly honest, J was \"agin\" it. How«\never, after due consideration, I decided to attend.\nI must confess I expected very little when I packed my toothbrush and \"other\" pair of\nsocks and set off for Michigan State and operation \"Workshop.\" Thus, it was quite a\npleasant shock to find the well organized and enlightening program presented there.\nThe speakers did a tremendous job with their presentations. A great number of the\ntopics covered situations now prevailing in our own operations and provided a base for\nfuture progress.\nOne other thing I appreciated greatly and valued highly was the chance to meet and talk\n\"Shop\" with other engineers. From these talks I learned a great maiy technical points\nand regained some enthusiasm for the business."
}