{
  "id": "d276-92",
  "text": "Dr0 Maurice Seay\nJanuary 20* 1?$6\nbroadcasting might or should plsy in the whole educational program of our\nnation in view of the mounting pressure brought to bear by the great in¬\nflux of new students at all levels* elementary* secondary* college and\nadult,, There are also numerous very real threats to educational broad¬\ncasting to be considered. Both radio and television frequencies allotted\nto education by the Federal Communications Commission are in danger. Re¬\ncent editorials in the trade press and attacks from other sources threaten\nto curtail the logical and essential expansion of educational broadcast¬\ning, if not its very existence , A Seminar such as the one here proposed\nwin enable leaders in the educational broadcasting field to meet with\noutstanding consultants to plan ways and means of meeting these problems.\nORGANIZATION OF SEMINAR\nThe proposed Seminar would bring together, for a period of ten days at\nAllerton House, 2$ selected participants and resource personnel and con¬\nsultants to aid in guiding the Fellows in their considerations of the\nproblems here suggested and their possible solutions. Fellows will be\nvery carefully selected by a committee appointed by the President of the\nN.A,E,B,, and insofar as possible will be chosen from among the younger\nmn and women of promise who occupy central positions of responsibility\nin educational radio or television. Selection will be made on the basis\nof the contribution to education that these Fellows can be expected to\nmake as a result of attending this Seminar,\nConsultants will, a© in past seminars, be selected on the basis of out¬\nstanding leadership qualifications in specific subject matter areas near¬\nest the core of present critical educational problems. All expenses for\nFellows and consultants would be paid, and consultants would be given an\nhonorarium,\nA complete record of the deliberations of the Seminar would be kept and\na comprehensive report published. This report would -then be distributed\nat no cost to all csembers of the N.A.E.B. for their guidance and copies\nwould be made available, at a nominal cost, to others desiring to pur¬\nchase the report. Free copies would ba distributed to recognized leaders\nand authorities in the entire field of education so that they may be made\nmore aware of the growing potential of broadcasting as a specifically edu¬\ncational tool. Further, this report is expected to serve as a spring¬\nboard for deliberations later carried on in small groups at subsequent\nRegional Conferences of the N.A.E.B. In this manner the valuable results\nof the proposed Allerton House Seminar would enjoy the widest possible\ndissemination and secondary as well as primary uses*\nRespectfully submitted on behalf of\nN.A.E.B. President F, E* Schooley and\nthe N.A.** * unaw* rn rectors.\nHJSjcr\nExecutive Director\nEnclosures* Proposed Budget\nReport of First Allerton Seminar"
}