{
  "id": "d1131-0",
  "text": "— »\nN A E B N £ f $ LETTER\nNATIONAL ASSOCIATION OF EOUCAT’ONAL BROADCASTERS\nFrank E. Scnooley, Editor, Station WILL, Urbana, III.\nMarch I, 1944\nRAOIO ACTIVITIES IN CHICAGO SCHOOLS\nStation WBEZ, the FM station owned and operated by the Chicago Board or\nEducation presenteo, ouring the first semester of 1943-44, October through\nJanuaryi 208 total hours or programs for in-school use. In presenting\nthese programs 1370 stuocnts from the Chicago schools took part as actors,\nSOUNO MEN, ANNOUNCERS, OR VISITED THE STUDIOS AS AUDIENCE.\nIn addition to the 208 hours of operation of WBEZ the Raoio Council,\nPRODUCING DEPARTMENT FOR THE BOARD OF ^DUCATION, PRESENTED !47 BROADCASTS\nOVER LOCAL STANDARD STATIONS. WIND HEADS THE LIST WITH 69 PROGRAMS, A\nTOTAL OF 17 HOUR8 AND *5 MINUTES OF BROADCASTING; WJJD WAS USED FOR 58\nPROGRAMS, 14 HOURS, 30 MINUTES; WMAQ, 14 PROGRAMS, 7 HOURS; AND STATIONS\nWBBM AND WCFL SHAREO THE BALANCE of THE TIME OF 2 HOURS ANO 45 MINUTES.\nIn GROUPS OF APPROXIMATELY 30 STUDENTS, 547 CHMEREN FROM ELEMENTARY\nSCHOOLS VISITED THE STUOIOS TO OBSERVE AND LISTEN TO THEIR FAVORITE IN¬\nSCHOOL PROGRAMS.\nW8£Z HAS INCREASED ITS TOTAL DAILY HOURS OF OPERATION FOR THE SECOND\nSEMESTER BY ONE HOUR ANO 15 MINUTES, ACCORDING TO &EORGE JENNINGS, ACTING\nDirector of the Radio Council and WBEZ.\nKENTUCKY*S \"HELLO NEIGHBOR\" TRANSCRIPTIONS AVAILABLE\nElmer Sulzer, Oirector of Public Relations at the University of Kentucky,\nwrites: MWe HAVE AVAILABLE A SERIES OF 24 15-MfNUTE RECORDINGS ENTITLED\n\"Hello Neighbor..\" Each of these programs was produced at the University\nof Kentucky studios and was broadcast over WHAS, Louisville, the series\nJUST ENDING THIS WEEK* EACH PROGRAM IS DEDICATED TO ONE PARTICULAR\nLaTIN-AmERICAN COUNTRY ANO CONTAINS MUSIC OF THAT PARTICULAR COUNTRY^ AS\nWELL AS AN INTERVIEW WITH ONE OF OUR LaTIN-AmERICAN STUDENTS. \"UNIVERSITY\nof Kentucky\" appears only at the end of each program and can be deleted\nIF DESIRED.\"\nThe series is already scheduled on WILL,\nCHINA SCRIPTS AVA 3 LA8LE\nThe Chinese News Service, 201 N. Wells Street, Chicago 6, Illinois is\nOFFERING A SERIES OF 10 SCRIPTS ON CHINA. ThE SCRIPTS ARE IN THE ORDER\nOF AN INTERVIEW BETWEEN A CHINESE AND A STUDENT. YOU MAY SUPPLY BOTH\nChinese and student. The scripts may be adapted to your own local neeos.\nGeorge Jennings has used a similar series wjth Chinese available in the\nChicago area. WILL ns using the adapted series with Chinese graduate\nstudents."
}