{
  "id": "d1131-5",
  "text": "NAEB NcWS LETTERo\n»Page 6c\nc o oMarch I>\n* aF0R CoLL£GE Trashing in Radio, analysis of program trends m\nfrnCiLR^0i°9 AND A pescRiorsoN OF English use of radio for education\n°uiIHE CH,EF MATURES OF THE FEDERAL RADIO EouCATION COMMITTEE\nMEETING HELD AT THE STATLER • HOTEL IN ^ASHlNGTON ON JANUARY 28.\nFollowing are the additional radio facilities requested by U0 Sc\nCOMMISSIONER of EDUCATION JOHN We SlUDEBAKER IN THE LETTER TO CHAIRMAN\nFeoeral Communications Commission which was reported at the\nCOMMITTEE MEETING*\nTen F«m channels in addition to the five now allocated for educational use\n[unM«£p^V^TRANSM,SS,0N FREQUENCIES to MAKE POSSIBLE EXCHANGE OF PROGRAMS\nAMONG EDUCATIONAL STATIONS*\n‘WO television channels*\n^^irjSV0NER's LETIER ALS0 ASKE0 THAT ™E FCC allocate EDUCATIONAL\nLICENSES ACCORDING TO sTATE AND REGIONAL PLANS WHICH WOULD 1NSURE THAT\nNO SECTION OF A STATE WOULO BE DENIED EDUCAT 6 ONAL RADIO SERVICE IN THE\nF U T U R E * HE ALSO ASKED THAT ANY FUTURE ADDITIONS TO THE. EDUCATION BAND\nBE ADJACENT TO THE COMMERCIAL BAND SO THAT RECEIVING SETS DESIGNED FOR\nPUBLIC USE WILL ALSO SERVE THE SCHOOLS AND COLLEGES*\njfteen State departments of education have asked the U* $* Office of\nEDUCATION TO PREPARE TENTATIVE PLANS FOR POST-WAR EDUCATIONAL F-M NETWORKS #\nACCORDING TO THE REPORT MADE BY WlLLIAM 06 0OUTWELL, DIRECTOR, INFORMATION\nAND Radio, U0 S„ Office of Education. More than 50 State universities\nHAVE NAMEO STAFF MEMBERS TO FOLLOW THE DEVELOPMENTS IN EDUCATIONAL F-M\nAND RECOMMEND ACTION BY THEIR RESPECTIVE INSTITUTIONS* At LEAST 25 BOARDS\nOF EDUCATION AND COLLEGES AND UNIVERSITIES HAVE ALREADY SUBMITTED OR ARE\nPREPARING TO SUBMIT TO THE FCC APPLICATIONS FOR F-M LICENSES*\nH* B* Summers, Soucational D<rector, Blue Network, reported that news\nPROGRAM8 SHOWEO THE GREATEST GROWTH IN POPULARITY BUT HE PREDICTED A\nDECREASE IN NEWS PROGRAM INTEREST AFTER THE WAR. POPULAR MUSIC PROGRAMS\nAND NIGHT-TIME ORAMATIC PROGRAMS CONTINUE TO GAIN IN PUBLIC FAVOR*\nDaytime serials and variety programs hold their own but there has been\nA SHARP DECREASE IN AUDIENCE PART ICI PAT I ON PROGPAMS* Dr0 SUMMERS ALSO\nREPORTED A SMALL PROPORT I ONATE DECREASE IN LISTENING TO CLASSICAL MUSIC\nPROGRAMS.\nKenneth G, Bartlett, Director, Radio Workshop, Syracuse University, headed\n£2c5J,TT£E 0N Tra,N,NG STANOAROS WHICH PRESENTED A PRELIMINARY REPORT*\nthe FRcC recommended that the proposals be circulated among a selected\nGROUP OF EDUCATORS ANO BROADCASTERS AND THAT, ON THE BASIS OF THE\nJUDGMENTS RECEIVED, THE COMMITTEE PRESENT A FINAL REPORT FOR FREC CON¬\nSIDERATION AT ITS SPRING MEETING, OTHER MEMBERS OF THE TRAINING STANDARDS\nCOMMITTEE ARC:\nLyman Bryson, Columbia Broadcasting System\nH. 80 Summers, The Blue Network\nJudith C, Waller, National Broadcasting Company\nMiller M6Clintock, Mutual Broadcasting System\nArthur Stringer, National Association of Broadcasters\nfc.LI7ABETH GOUOY, U, Sc OFFICE OF EDUCATION\nLloyd E8 Slauch, U8 S, Office of Education,"
}