{
  "id": "d1101-17",
  "text": "HEARINGS - Friday, January 9, 970 KC (University of Wisconsin, WHa)\nNEW - Hochester Broadcasting Company, Rochester, Minnesota CP 970 kc.\nW’DAY -* Par go, North Dakota, Party -Respondent\nWRa - Madison, Wisconsin, Party Respondent\n* * * * * *\nPM ACTIONS - Noncommercial Educational\nWUOM - Ann Arbor, Mich. -• Granted modification of CP for extension of\ncompletion date to 6-16-48. (BMPED-97)\nWJUN - Philadelphia, Pa. - Granted modification of CP for extension of com¬\npletion date to 5-27-48. (BMPED -86)\n*** ***\nWTDA - Board of Education, Toledo City School District, Toledo, Ohio - Granted\nmodification of CP to change studio location and transmitter site, make changes\nin antenna system, and change commencement and completion dates.\nPM -APPLICATION - Remote Pickup\nNEW - Wausau, Rib Mountain, Wise. (State of Wisconsin State Radio Council,\nStudio - Madison, Wise., transmitter) - Construction permit for a new noncommercial\neducational PM broadcast station to be operated on Channel 209, 89.7 me., power\nof 10 KW.\nPM - (Conditional Grants)\nAgricultural and Mechanical College of Texas, College Station, Tex. - Authori¬\nzed conditional grant for a Class a station in lieu of existing Class B authoriza¬\ntion outstanding, subject to further review and approval of engineering details;\nproposed channel; 252 (98.3 me.) (BMPH-1206)\nPM - (Applications Accepted for Piling)\nWPTL - Providence Bible Institute, Providence, R.I. - Modification of con¬\nstruction permit (Bl-PED-55, which authorized a new noncommercial educational\nbroadcast station, as modified) for extension of completion date,\nNEW - The County of Los Angeles, Calif,, Mt. Wilson, Calif. - Construction\npermit for a new PM broadcast station (non-commercial) to be operated on 88.5 me.,\n203 channel, power of 1 KW. Amendment correcting resolution.\n* * * * * *\nPM - (Application Dismissed)\nNEW - Lewis College of Science and Technology, Chicago, Ill, - Construction\npermit for a new noncommercial educational PM broadcast station to be operated on\nfrequency to be assigned by PCC power of 52.2 KW, Dismissed without prejudice at\nrequest of applicant, December 2, 1947.\n* * *\nRadio Primer on Sale by Superintendent of Documents\n\"Radio - A Public Primer\" is now being sold by the. Superintendent of Documents\nfor 10 cents a copy. The latest PCC general information pamphlet traces the\ndevelopment of radio, explains its operation, and reviews broadcasts and other\ntypes of radio services. It is a companion to \"An ABC of the PCC,\" obtainable\nfrom the same source at five cents a copy, The Commission is unable to distribute\neither. Order should be addressed to the Superintendent of Documents, Government\nPrinting Office, Washington, 25, D.C,"
}