{
  "id": "d1101-3",
  "text": "-4-\nRules Committee of U. S. House of Representatives\nDemocrats\nHoward W. Smith (Va.), Chairman\nWilliam M. Colmer (Miss.)\nRay J. Madden (Ind.)\nJames J. Delaney (N.Y.)\nJames W. Trimble (Ark.)\nHomer Thornberry (Texas)\nRichard Bolling (Mo.)\nThomas P. O’Neill (Mass.)\nCarl Elliott (Ala.)\nB. F. Sisk (Calif.)\nRepublicans\nClarence J. Brown (Ohio)\nKatharine St. George (N.Y.)\nH. Allen Smith (Calif.)\nElmer J. Hoffman (Ill.)\nWilliam H. Avery (Kans.)\nTHE REPORT OF THE GEORGIA REGENTS\nThe “reply direct” of the Georgia University regents to the request of the Georgia\nAssociation of Broadcasters, Inc. re operation of WGTV, is an important milestone\nin ETV development and one that deserves widespread recognition and approval.\nThe commercial broadcasters of Georgia had asked the Regents to (1) create an\nadvisory group, including commercial broadcasters, for the development of ETV\n(2) eliminate all “entertainment” type programs, (3) abolish the showing of\nUniversity of Georgia athletic events.\nBecause of its importance and the possible uses other educational station*operators,\nboth radio and TV, might have for such a statement in handling similar situations,\nI am reproducing the substance of the Regents report here.\n“As to the formation of an advisory group, we think that this would be contrary to\nthe rules and regulations of the FCC. As licensee of the station, the Regents are\nobligated to determine the program policies and they could not properly delegate\nthis function to any outside group.\nThe elimination of all entertainment as such over the station. would in our\nopinion be contrary to the rules and regulations of the Commission.\nThe broadcast of feature films by non-commercial educational television stations\ndoes not violate any rule or regulation of the FCC. In fact, Section 3.621 (c) of\nthe rules reads as follows: (“Non-commercial educational television broadcast\nstations may transmit educational, cultural and entertainment programs, and\nprograms designed for use by schools and school systems in connection with\nregular school courses, as well as routine and administrative material pertaining\nthereto. ”)"
}