{
  "id": "d1101-4",
  "text": "-5-\nBADIO EARH DIRECTORS APPOINT TELEVISION COMMITTEE\nThe national Association of the Radio Earm Directors, headed hy Charles Vorces-\nter, commercial station UMT, Cedar Rapids, Iowa (former director of farm broadcast-\ning for C3S) has appointed a committee to study TV activities and opportunities in\nthe farm field.\nLand Grant N-A-E-B stations with strong farm Broadcasting programs will do\nwell to keep in contact with this group. Whether or not they plan to operate their\nown TV stations, they may well serve as production centers in cooperation with\ntheir Agricultural Extension Services for network feeds or '‘film feeds” to coopera¬\nting commercial stations.\nUHAT HAPPENED PSRE? .~~ “\nI Grants of non-commercial educational EM stations to the Buffalo, N.Y. Board\n| gfjgaucation and the Sacremento, California City Unified School District were\n.theJ^QC. Stated reason: dismissed without -prejudice for failure~*to\nSproceed with construction of the stations.\n| ' ■ '\nN-A-E-3 understands the difficulty—the red tape—the \"through channels”\n! necessity of applying for and proceeding with institutional stations, hut points\nj out \"without prejudice,\" educators have a unique opportunity with 20 educational\nj m channels to secure a \"voice.\" A radio station is an incomparably valuable\n| facility to any institution as those who have \"loved and lost\" well know.\nj N-A-E-3 stands ready to extend any possible aid in advising, facilitating,\nj helping applications which are in difficulty or plans which are faltering. Let\n! us know\nRADIO PIONEER DIES\nErank Butler, pioneer radio engineer and close associate of Dr. Lee DeEorest,\ndied January 7 in Toledo, Ohio, after an illness of two weeks. The 70-year old\ninventor together with Dr, DeEorest are credited with setting up the first broad¬\ncasting station in the world in Toledo in 1907. Previously they had collaborated\nin developing the first audio tube which made modern radio possible.\nCOLUMBIA UNIVERSITY PROCEEDS UITH EM’ DEVELOPMENT\nIIgJ.gr.Ddwin ^Armstrong, inventor of EM and member of the Electrical Engineer_\nColumbia University, Pew York City, reports the transmi11er and the\nAlpinei for the University have been in operation for \"a number cf\nmonths making propagation studies. ‘ ”\nXk§.s..g_-^D-ljrities, it__yas explained, will be ~out into utilization for Columbia\nUniversity broadcasts when -plans for radio -program -production and organization ~are\nillEiher^gperfected. ^ Columbia University as one of the major institutions in the\nUnited States will have rich resources to tan for the -production of nubile service\nand educational •programs.\n4j;.y?trqng__gJ^so_ r enor t s the production of good EM jet s at r ease nab 1 e prices.\n—„-n-ov in the_year good miners in lame quantities at reasonab 1 e\nprices should be available. ' 1"
}