{
  "id": "d1101-4",
  "text": "-5-\n“The representative of the GAB named two feature films that he objected to as not\nhaving any cultural value. If only two of the films shown have had objectionable\nqualities then we feel the program director has done a creditable job. However, it\nis the opinion of your committee that no films should be televised without a preview\nby some responsible member of the program department.\nThe GAB objects to WGTV’s showing films of football games. These films are shown\non Thursday night following the game played on the previous Saturday. These films\nare secured by WGTV from television station WAGA-TV without cost, and all\ncommercials are cut from the films.\nConclusions\n1. A committee of the Board of Regents should be created that would represent the\nBoard for the purpose of complying with the rules and regulations of the FCC.\nThis committee should make periodic studies of the program content and any other\npertinent matters.\n2. It is advisable that some entertainment be continued on WGTV as in the past, in\naccordance with the rules and regulations of the FCC. We do not think that our\nBoard is in a position, always, to determine the exact distinction between\ncultural films and entertainment films as such. All would agree, we feel, that\nmany films are entertaining as well as educational.\n3. We see no reason why the University of Georgia Football games should not be\ncontinued over WGTV on Thursday nights, as long as they have been shown,\npreviously, on the commercial stations.\n4. This committee recommends that the Board of Regents express their appreciation to\nthe GAB for bringing this matter to our attention. Certainly the GAB understands\nthat FCC rules which require complete control of programming policies must at all\ntimes be the obligation of the Licensee. However, the Board of Regents will\nwelcome the views of commercial television broadcasters at all times. The Board\nsuggests that the GAB appoint a committee to study the programming of the\neducational television stations and contact the committee of the Board of Regents\nif and when the GAB may have any complaints.” (End quote)\nAll educational broadcasters are in the debt of Manager Jerry Appy for making this\nstand, and the Georgia Board of Regents for its forthright statement of the principle\nof the right and responsibility of educators to determine what is educational.\n- WGH"
}