{
  "id": "d1078-2",
  "text": "FMBI VOL, 2, No. 16\nPage 3\nHAGERSTOWN BROADCASTING COMPANY, 33 West Franklin Street, Hagerstown, Maryland,\nfor the Hagorstown area* Studios, 33 West Franklin Street5 transmitter, Quirauk\nMountain, Washington County5 frequency, 14-3,500 kc; coverage, 22,150 sq.mi.; max.\nrated power, 3 kw (GE);' estimated cost, $ii0,210; link, STL, 12 miles; antenna, eight-\nbay circular (2.66) on 71-foot steel tower to height of 235 feet abovp ground, 2,380\nfeet above sea level; radiation, 20,000 watts; population, 1,885,730* Applicant\nlicensee WJEJ.\nAUGUSTA BROADCASTING COMPANY, 8th and Broad Streets, Augusta, Georgia, for the\nAugusta area. Studios, same; transmitter. North Augusta; frequency, U6,300 kc;\ncoverage, 8,9U7 sq.mi.; max. rated power, 3 kw (RCA); estimated cost, $36,700;\nlink, wire line, 3 miles; antenna, six-bay turnstile (2.06) on 185-foot steel tower\nto height of 250 feet above ground, 785 feet above sea level; radiation, 11,1|00\nwatts; population, 395*920; applicant licensee WRDW.\nTEXAS DEVELOPMENTAL PROPOSED\nA.H.Belo Corporation, 801 Commerce street, Dallas, Texas, has applied for an\nFM developmental station to conduct studies on propagation, antennas and allocations\nas related to sites and paver. The applicant proposes a composite set-up at the\npresent site of standard station WFAA but asks a portable authorization in order to\nconduct studies from other locations. The station would use 1 kw or less on the\n99*800 kc or other frequency as designated by the FCC* Ray Collins, technical ad¬\nvisor of WFAA and KGKQ, would be in charge of the studies.\nFMBI EMPLOYMENT-INVESTMENT PROJECTION\nFM broadcasting will be a $2,000,000,000 business employing 300,000 persons\nwithin a year following the lifting of restrictions on civilian goods. Moreover,\nit can be expected to grow into a $10,000,000,000 enterprise in five years with em¬\nployment increasing appreciably as more stations go on the air.\nThese statements, made in press releases last week, are substantiated by the\nFMBI projection which appears on the following pages. It is based upon accepted\nindustry figures but is contingent upon FCC decisions concerning allocations and\nstandards which will determine the freedom of development to be afforded\nThe recent Sylvania survey revealed a market for 91*300,000 sets capable of\nreceiving FM. The public wants 18,390,000 of these sets as soon as possible. This\nmeans employment for 262*000 persons for five years. Since most radio sets are re¬\nplaced in seven years this employment can be reasonably permanent.\nThere are 608 localities now receiving standard broadcast • If these localities\nare to have full network coverage via FM, 2,ii32 stations will be needed. More than\nI4.OO' Ft-i applications are on file. The industry can build 300 first-year stations\ngiving employment to 2,500o Expansion of this brandh is needed to build 2,500 FM\nstations in five years. Increased emplcyment will result.\nThe average radio station employs 25 persons. In the first year 3U6 FM stations\nwould employ or cause employment for 17,300 persons. In five years 72,500 persons\nwould be employed either directly or indirectly by 2,500 FM stations.\nAt $100 per set the public would pay $1,839>000,000 for FM sets in the first\nyear and $9*130,000,000 in five years. Broadcasters would spend $19,990,000 to put\nup 300 first-year stations and $166,587*500 to build 2,500 stations in five years.\nOperation would cost $18,338,000 the first year and would total $3^3 >500,000 in\nfive years. 2 - 16 - 368"
}