{
  "id": "d837-101",
  "text": "10\nSeries I, Tap* Bi *Q?m Pf mfflUm k reading »« &tov«\nof the follovixf nia# porrosi ?w T.ove«; The Dr-'r-ndhof*? 'If I\nCould Only Uv« nt the Pitch flint it Bear Madness*; Brother*\nhood of Fm (Parte III and IV)$ What if laae«dMNMMaf Line* to\nan Old Man} The florae Chestnut froe? Sea Saap* with Barabla?\nA legend of Viable ^eaen (Ports I* II end TV1). i?Plf~hour.\nSeries 1* tope Ct fOWt W VALUOK STWTO. A rending, vlth some¬\nwhat wore interpolated consent than in tapes A and » of this\ne«ri«t, of the follow!a* ten poems? Bix Signifyleant Landscapes?\nthe Snow Man; Sunday io ruing? A High-Toned 014 Christian Woman?\nthe Idea of Order at Key West? the Woman in Sunshine? Song of\nFixed Aoeordt (fee excerpts from) lotos toward a Supreme Fiction?\nfha Bmperor of lea Creanj Final Soliloquy of tha Interior Fart-\nmour# Half-hour#\nSeries I, fAps Di POBHS OF mm*. A reading, with sub-\nstanttally more comment than on the oth*r throe Series I tapes,\nof eight poems? Poetry? The Atssple-Jack? A Carriage From\nSweden? Bird-Fitted? Peter? la Distrust of Merits? Nevertheless?\nWhat Are Tsarst Half-hour,\nSaris* II, tape At FIVI POfMS Ct wmm 10*BU« A general intorpre-\ntation of Lowell's work Based on the reading and discussion of\nthe following poems* After the Surprising Conversions? tha\nDrunken fishirw?? Concord? The Quaker Cmveyard at Haatnahet\n(Farts 1, II, IV and V)? At the Indian Killer's Crave. Lowell's\npoetry Is exam toed as an expression of religious tensions re¬\nsolving a central parados. Half-hour#\nSeries II, Tape Ct tom mm* Of VAttADB fTffXSS* A study of\nStevens, Based on the reading of the following poems* The Snow\nMan? Sunday Horning? The Ida** of Order at Key West? The woman\nin Sunshine, The intellectual structure of tavens's work is\nexamined, with emphasis on the epistemological concept to Be\nfound in it, and the relation of this concept to problem* of\nBelief and action. The presentation endeavors to demonstrate\na more formal variant of the Series II type. Half-hour.\nSeries III* Tape Ct Hm mmmmkl nmmmim A Beadinf-Uotore\non Wallace Stevens's *fhe Idea of Order at ley West*# The\nlecture It addressed at the outset to a fe&r of modern poetry\nimputed to the auditor, and a review of its causes# The early\n20th century 'revolution of form* is sketched as the source,\nthrough its excesses, of a general public alienation from new\npoetry# Against this Background, *fhe Idea of Order at Key\nWest- is read# The simplicity and traditionalism of It* form\nend language are then noted# The argument proceeds that those\nwho dwell on the formal obscurities of 20th century poetry are\n■one revolution Behind11? that the Best poetry of today ip Being\nwritten within a newly integrated formal tradition* and within\nestablished convention* Is undergoing a 'revolution of substance'.\nStevens's poem is then interpreted as m Important illustration\nof this \"conventional revolution*1, end the tape conclude* with *\nsecond reading of the poem, this tins by the poet. Half-hour."
}