{
  "id": "d837-107",
  "text": "1% completing of the five series on Wr, Mi and Mr. Steven#,\nths experiment lias dealt with those two of the four posts chose* between whom,\ndaapit# their many differences, there Is ths least «oali%«l of general pw\npssas.* With particular reference to the Sorts* IT and Sorts* T treatment\nof these posts, they present the lsast contrast of method*. In ths completed\nproject, for example, it would to sssxi that ths approaoh to Hr. Lowell's work\nis radically different from any that could be devteed for Mis* Moors1* pestry.\nThus ths ssosriasnt in its present half-finished stats has only begun ths ex¬\nploration of method® which its oriental design was intsndsd to round out.\n2. Seas of ths presentation* roeordsd require, as has already been\naot»d, time-consuming and relatively expeneive production which ths six-month\nproject now completed would not allow. It is obvious that whlls ths Ideas\nooatainsd in these presentations om bs examlnsd as Ideas, thslr effectiveness\nas radio programs cannot ho evaluated ualsss their production requirements\nars not. The time and nocsssary fond* for such production are therefore\nbasic to any satisfactory completion of tha experiment. Moreover, because\n*» adequate production budget was lacking, ths director was obliged to Codify\nplans for certain scripts now recorded which would otherwise hare made more\nexteas ire «*• «f broadcasting techniques. Though nothing remotely approach-\ning the production expenditures usually associated with network radio is In\nquestion here, it would be well to free the experiment in this respect, tnso-\nfwr as the purpose le to dlscorer what radio can do with poetry.\n3. The completed and more varied range of recording* on four poets\nshould be made available la dubbings to the project •* consultants for auditioning\n*--\nThe interpretation of Mr. Stevens offered in this experiment is at nvriance\nwith that of many critics, who might consider the contrast with Mr. Lovell's\nwork extreme."
}