{
  "id": "d837-62",
  "text": "October 8, 195^-\nv\nX ^\nL E\\W I >3 HILL\n\\ S\nV\nMr, Graydon Ausmus\nPresident, N.A.E.B.\nBox 2002\nUniversity, Alabama\nDear Gray don.\nThanks for your note of September 29. I am now getting into the\nheart of the Rockefeller project, and at the moment feel fairly hope¬\nful that it may achieve the desired results.\nI do want to call to your attention and to that of the other per¬\nsons receiving carbons of this letter, that the purpose of the Rocke¬\nfeller project is not to produce programs for actual broadcast. The\nproject is rather for the purpose of comparing different methods of\npresenting poetry, including same experimental methods of my devising.\nAn important part of the project is its jury, consisting of R.P. Black-\nmur, Lloyd Frankenberg, John Crowe Ransom, T.S. Eliot, J.L. Sweeney,\nLouise Bogan, Aldous Huxley, Josephine Miles, Frederick Packard, Judith\nWaller, and certain others. These persons have been enlisted to hear\nmy tape recordings of comparative and experimental presentations of\npoetry, and to register their judgments as to which of the methods com¬\npared is in each case of four different poets the most effective. One\nbasic aim of the project is to assemble the opinions of this jury so\nthat a decision can be made at the Rockefeller Foundation as to whether\na somewhat larger project should be undertaken for the production of\npoetry programs for actual broadcast.\nAs part of the process of testing the effectiveness of different\nmethods of presentation I have considered running test broadcasts, with\nappropriate audience participation for a sampling at KPFA, WHYC, and\nWGBH (the latter two stations having expressed a warm interest in such\nan experiment). However, I have not finally decided whether this will\nbe desirable as part of the project, and in any case, if I do determine\nto run these actual broadcast tests, I shall be dependent upon the will¬\ningness of the publishers of the poets in question to permit such broad¬\ncasts without royalty fees. There is no provision at all in the pro¬\njects budget for royalty arrangements, since, as aforesaid, broadcast¬\ning of the material was not contemplated.\nI trust there has been no widespread misunderstanding on this\npoint but it is to 11 to mention it now and avoid disappointment in any\nquarter. To the best of my knowledge, unless the UAEB or the Rockefeller\nwish to undertake separate negotiations for broadcasting rights on the\nmaterial I am using, none of the tapes will be available for use on the\nnetwork. Our hope is, rather, that they will form the basis for another\nproject and some real program production in this field.\nWith regard to the question of reports on the projects development,\nI will be glad to keep Skornia informed, but I am afraid I cannot under-"
}