{
  "id": "d226-130",
  "text": "Cl Tic improvement, •»» The economy is sound; churches are well attended; there is\nlittle or no social discrimination.,.. The school system is excellent and the P-TA\nis well organized to sponsor such an experiment.\n3) The complete facilities of KUON-TV, the University's educational television\nstation dedicated to continuing and adult education, are available for the tele¬\nvision discussion seriesi\n* * *\nMuch experimentation is being carried on currently to determine the effective¬\nness of educational television in relationship to the complex problems facing educa\ntion in America. As educational television is relatively new, its techniques and\npotential are as yet unfulfilled or even approximated. To apply the medium fully\nand to allow it to serve its maximum potential for the optimum welfare of mankind,\nutilization of this new medium must be envisioned in a variety of new roles. Be-'\ncause of its very nature, television can be a tool for revitalizing the spirit of\ndemocracy*\nAs was expressed at the recent 1AEB Board meeting, there is much experimental\ntion currently underway.regarding \"education.\" It was pointed out that there is\nvery little research being done relative to the potentialities of television edu¬\ncationally* -—--\nIn strengthening community processes through discussion, educational televisio\nhas a significant, contribution to make in the perpetuation of our democratic heri-\ntage. Audience participation with an organized community group is a unique feature\nof the KOOK-TV experiment*\nEvaluation\nAs planned by a member of the KUON-TV staff who is a Master’s Degree candidate\nat thetUniversity of lfc.bras.ka — Elizabeth M. Warty) Meisinger criteria for\nevaluation will include aho .fallowing:\n1) Response fcc the aeries — both in quantity and in quality\n2) Subjective evaluation by key participants\n3) A report form filled out by each viewing post and submitted by its repre¬\nsentative following each summary\n4) A simple questionnaire J'.o members of the viewing aucioncry based mainly on\nthe question of whether they would like to see the series continued\nThe above appraisal will be carried out in connection with the Master's thesis\nwhether or not a grant-im-aid is received.\nWith the assistance off funds from the NAEB, the following additional types of\nresearch could be done, thereby enhancing the value of the experiment to the local\nsituation, to educational television nationally, ana to our democracy as a whole*\n1) utilization of instruments to test attitudes toward television and attitudes\ntoward the topics in the series\na) Purdue tests of attitudes toward TV — the attitude scale\nb) attitudes of those viewing groups registered and finally those who\nstay with the course\nc) P-TA selection of their most significant programs of the year and tV\nrank of the television discussion scries in their pattern of interests,\nas well as identification of the television topic considered most ef¬\nfective"
}