{
  "id": "d226-21",
  "text": "RESEARCH PROJECT\nIK\nAMERICAN RADIO HISTORY\nRaymond T. Bedwell, Jr.,\nAssistant in Radio-TV\nDepartment of Speech\nThe Ohio State University\nColumbus 10, Ohio\nPURPOSE: To photograph and catalogue materials related to the history and\ndevelopment of radio broadcasting in the United States to 193k,\nSECTION I\n1. The^ task of -beaching radio history seers to be a difficult on© for the\ncollege instructor. He is either not personally familiar enough with\nthis early period to talk about it effectively* or he finds it diffi¬\ncult to present these important historical materials to students in a\nmanner that is both instructive and interesting.\nA slid© lecture* dealing comprehensively with the early period of radio\nbroadcasting in the United States, could provide 'the teacher with a valu¬\nable resource unit for teaching. Radio history could be presented simply,\nclearly and effectively through the use of visual materials.\nThe data gathered in this project will subsequently be assembled into 3$\nmillimeter slide form, with a written or recorded narrative, for use as\nan aid in teaching American radio broadcasting history.\n2. Preliminary investigation has revealed voluminous quantities of valuable\nmaterial that, to data, have remained relatively untouched. The libraries\nof the networks, professional broadcasters organisations and several univer¬\nsities contain a wealth of books, raa.gasin.es, newspaper clippings, government\ndocuments and photographs related to this project. Figure I is an illustra¬\ntion of the quantity and quality of materials available. With permission\nof these libraries (already secured in several instances), photographs will\nbe taken of all pertinent data, and the photographic negatives assembled\ninto an extensive catalogue of resource materials for teachers of radio\nbroadcasting.\n3* As far as can be determined at this time, no similar research project of\nthis magnitude has ever been carried on in the area of radio history. AX-\nseveral collections of original materials are housed throughout the United\nStates, no comprehensive and thorough examination of these materials has\nbeen made* and no effort to photograph and catalogue all of them has ever\nbeen attempted*"
}