{
  "id": "d226-23",
  "text": "3\ni».0 The 12-day itinerary listed in Figure II reflects proposed contact with\nonly a portion of the vast body of information available on American ra¬\ndio history. As research on this project continues* it is hoped that ad¬\nditional sources will reveal themselves* which could aid in turning this\nbrief study into a continuing collection of radio history materials. For\npurposes of this specific project, certain limitations have been imposed.\nThe procedure will be as follows.\na) Following the itinerary given in Figure II, the researchers will\nvisit the various libraries in persuanee of visual materials for\ntills project*\nb) These materials will be photographed cnto 35 millimeter negative\nblack-and-white film, and will be catalogued,\nc) Upon completion of the itinerary, the catalogued negatives will\nbe arranged into several units, (i.e. Pre-broadcasting History,\nThe Early Stations; Early Radio Personalities; Early Equipment;\netc.) The exact number of units will be determined by the ex¬\ntent of materials available. The length of each unit and its\ncontents will be determined by the researchers and the active\nconsultants to the project at The Ohio State University,\nd) A complete catalogue of all material photographed during this\nproject* with descriptions of each elidecontents, will be\nprepared for the NAEB.\nSince this request for ai NAEB Grant-in-Aid is to finance the 12-day\nitinerary, procedures pertinent to the NAEE Research Committee end\nat this point. However, to give a more complete picture of the\nscope of this entire venture, the following additional steps are in¬\ncluded. NAEB funds would not be asked to finance these activities\nat this time.\ne) Using pertinent slides secured to this time, either through NAEB\nfunds or other sources, a narrative script will be written to ex¬\nplain and accompany the slide series®\nf) Slides and/or filmstrips will be produced for each study unit.\nScripts will be duplicated and/or recorded* and these slide-script\nunits will be made available to teachers of broadcasting.\ng) Original negatives collected will be kept on permanent file by the\nresearchers•\nh) A complete catalogue of all negatives available, with brief descrip¬\ntions of each, will be distributed to libraries. Individual slides\nor custom-made units of slides will be available to any interested\nperson."
}