{
  "id": "d226-44",
  "text": "OHIO UNIVERSITY’S AM STATION —1340 KC\nALSO OPERATING WOUI-FM —91.5 MC\nTHE FIRST UNIVERSITY FM STATION IN OHIO\nDr. Sam L. Becker\nTelevision Center\nState University of Iowa\nIowa City, Iowa\nDear Mr. Becker:\nThank you very mucn for your letter of March 3rd. Mr. Johnson and\nI both appreciate the fine support and cooperation we have received from\nthe National Association of Educational Broadcasters and the N.A.E.B.\nResearch Committee. We also appreciate your comments in regards to the\ncnanges in our report. I don*t know why we didn^ include the specific\ndate the AM station went on the air. It was just one of those things.\nHowever, we will make the correction. % the way, it was September 1U,\n1957* approximately three months before our AM survey was made. Although\nthere was still a certain amount of uniqueness connected with the opera¬\ntion, I think the audience had settled down to a great extent.\nIn regards to your second suggestion on the percentage figure, it\nrepresents a percentage or radio homes using radio per average minute\nin that time segment. This is according to the Nielson Radio Index as\ngraphed on page 226 of the 1956 Sponsor Fail Facts Basics. There is also\na table on page 220 of the same publication that in essence conflicts\nwith the previously-mentioned graph. I am at a loss as to how to resolve\ntnis conflict. Perhaps if you could check these two sources, you could\nmake a recommendation as to a possible solution. It would be very much\nappreciated.\nIn your last suggestion you seem puzzled as to why we have not tested\nthe significance of our differences by a statistical analysis. This idea\nhad occurred to us but in consultation with Professor C# W. Harris of the\nUniversity of Wisconsin and several statisticians on this campus, it was\ndecided that since the size of the sample is so large, the differences\nin means as large as they are, and the consistency of the factors which\ndo not vary, it would be superfluous to encumber the study with such a\nstatistical analysis. Further, we state in the report that we are not\ninterested in generalizing the report per se to a large population but\nrather are interested in determining differences which may be caused by\nthe addition of the AM transmitter."
}