{
  "id": "d226-63",
  "text": "EE; Decisions ©n grants for 1958*\n/‘f^yrf-r\nFirst of all, welcome to the research committee of the NAEB —\nagain. Oar first job appears to be to make decisions m the recip¬\nients of the grants-in-aid and the amounts to be given to each. Harry\nS. has informed us that we should be able to count ©a $1,500. This is\nnot a great deal ©f money but, wisely distributed, can do some good.\n1 think if we keep in mind what we talked about at one of our last\nmeetings — that the purpose of these is to help researchers improve\nupon or expand some project which will be done anyway, rather than to\npay the entire costs of a project — we can do the moat good. Remember\nthat we might decide that some of the researchers can do what they plan\non less money than they ask. In this case, they can be offered a lesser\nsum on the condition that the project be completed as stated.\nHarry informs me that the business on M Browne is still pending\nalso. Ha wanted $100.00 to take care of soma of the costs of his\nMaster’s thesis, which is completed. I thought this was settled at\nColumbus, hut 1 could be mistaken. Perhaps the rest of you remember.\nDo you have some record of this, lay?\nThe procedure for the giving of the grants will fee as follows:\nEach member of the sub-committee will receive, within a few days, copies\nof each application. Hate these in order of preference, indicating how\nmuch you feel each should fee given — of those whom you think should\nreceive anything. This information should fee sent to Ken Harwood at\nSouthern Cal. by the 5th of February. This- information must fee in his\nhands fey this date so that the announcement ©£ the grants can fee mads\nby the promised date. (By the way, Ken, I hope that you do not mind\nfinding out about your chairmanship of this sub-cosmdttee in this way.\nThis has come up so quickly that there has not been time to write a\nformal letter asking you to take on the job. I hope that you are willing\nto compile the results and make up a list of who gets what. Copies of\nthis list should then be sent to Skomia. I believe the rest of us on\nthe committee would fee interested in seeing it also. The important thing,\nhowever, is to get it to headquarters as quickly as possible.)\nI assume that we will fee in constant correspondence about one thing\nand another this year, toy suggestions cm what the committee should do\nor how it can do things better are always welcome. As soon as the Columbus\nreport is out, we will begin worrying about a major research project.\nStart saving those great ideas!!!\ncc: Harry J. Skomia\nRay Cheydleur\nIrving Merrill\nEideya Kumata\nKenneth Harwood\nSincerely,"
}