{
  "id": "d226-72",
  "text": "-8-\nThe remaining three parts of the table are calculated directly from the Raw Figures\nsection. \"Share of audience\" is obtained by dividing the number of listeners to any station\nat any period by the number of total listeners during that time period. Thus, the Share of\naudience section contains the percentage of the listening audience held by each station.\nFor example, of all people listening to anything between 9:45 and 10:00, 8% of them were\nlistening to WBAA.\nThe section labelled \"Computing Sets In Use\" is self explanatory. This figure is\nused to obtain the Rating figures. \"Sets in Use\" is an estimate of the percentage of people\nin the entire sample who are listening to either radio or television.\nThe \"Share of audience\" figure divided by the \"Sets in Use\" yields the rating\nwhich estimates the precentage of all people in the population who are listening to a given\nstation at any given period of time. The \"population\" in this study refers to all telephone\nsubscribers in the Lafayette area.\nTables 2 and 3 give the total for the remaining two hours covered by the Decem¬\nber period. Table 4 contains the grand totals for the three hour period.\nPrevious studies have indicated that there is very little television viewing in the\nmorning. This survey shows that television gains throughout the morning and commands\nslightly more than half of the total audience for the three hours covered. Approximately\none home in four has either radio or television turned on at any given time in the morn¬\ning.\nIt is seen that WFBM-TV, channel 6, maintained about 1/4 of the total audience\nthroughout the morning. It should be pointed out that the reception of channel 6 is better\nin this area than for any other channel. Therefore, one should not necessarily conclude\nthat the apparent superiority of channel 6 is due only to the programs carried.\nTable 5 lists the radio and television stations showing their share of audience and\nrelative rank for each hour period and for the entire three hour period. The rankings of\nthe television stations change only once. During the 11:00 to 12:00 hour WTTV and\nWFAM-TV switch rank order, but their relative shares of the audience are, for all prac¬\ntical purposes, almost the same and therefore the change in position should not be con¬\nsidered of any import. Slight shifts do occur in radio rankings throughout the morning.\nThe listenership of WBAA is shown in Table 6. Contrary to the findings of Sur¬\nvey I, 1956, which were that listenership to WBAA tends \"to slack off at 10:15 and re¬\nmains at 2% until 11:45\" the present results indicate considerable fluctuation but with\nmoderate downward trends except for the 11:15 to 11:30 period which indicates a con¬\nsiderable increase from 1% to 9%, then a sudden drop-off again to 2% for the succeed¬\ning fifteen minute period. As these percentages are low they are not considered\nstable and as such this fluctuation might possibly be attributed to chance factors.\nDuring the period from 10:30 to 11:45 WBAA normally presents various pro¬\ngrams of the School of the Air or National Association of Educational Broadcasters8\nSeries. This period, as can be noted, has a generally lower share of the audience as\nmeasured by this survey than has the period from 9:00 to 10:45. It should be noted\nthat the content of the 10:30 to 11:45 period is designed for broadcast to primary and"
}