{
  "id": "d226-89",
  "text": "-25-\nready available in a rough form in Figure 2, which shows the relative listenership\nby fifteen minute periods for WBAA.\nComparison of 19 56 Survey and 19 57 Survey\nCertain tabular information regarding comparative shares of audience per¬\ncentages are presented in Tables 19 through 23.\nComparisons were made first at a grand total level between the two sur¬\nveys. Second, the December periods were compared — as were the January per¬\niods. And finally certain minor comparisons were developed. Figures 3 and 4\nare comparative graphic presentation of selected information taken from these\ntables. Basically these tables introduce no additional information not already\npresented in earlier tables. However, comparative judgments can more readily\nbe made because of the combinations of certain selected data.\nTable 19 shows the comparative data for the 1956 and 1957 surveys in\ngrand totals. The readers attention is directed to the comparative relation¬\nships which exist between the \"Raw Figures\" and the similar relationships in\nthe \"Share of Audience\" section. When comparing the share of audience per¬\ncentages of the 1956 and 1957 surveys, we find that there is no significant dif¬\nference between 32. 8% and 31. 9%, or radio's share of the audience.\nShare of audience figures for WBAA for the 1956 and 1957 surveys are\n4. 5 and 4, 2 respectively.\nTable 20 depicts the figures for the comparable December periods of\nthe two surveys. Table 21 presents the figures for the January periods.\nTable 22 gives a station-by-station, hour-by-hour, breakdown of the\nDecember periods and Table 23 gives the same information for the January per¬\niods.\nWhen the shares of audience for radio are graphically depicted as in\nFigure 3, the comparable diminishing listenership to radio is evident in both\nthe 1956 Survey and the 1957 Survey.\nFigure 4 shows the comparative shares of the audience for WBAA. The\nextreme deviations toward the mid-day periods, which are unexplainable from\nthe data, obscure the more gross trend of listenership to WBAA which is that\nlistenership declines through the morning hours, rallies toward the middle of\nthe day, and begins to increase again during the evening hours.\nSummary of major findings of 19 57 Survey\n1. Radio's share of the listening audience is 31. 9% i. 6.\n2. WBAA's share is 4. 2% jjb 4."
}