{
  "id": "d226-97",
  "text": "-33-\n3. Radio’s share of the audience appears to decline steadily throughout the\nday with less acceleration toward the noon hour — from 50. 9% during the 9:00\nhour to 12. 7% during the 7:30 hour in the evening.\n4. WBAA maintains its own share of the total listening audience better\nthan any other radio station during the evening hours. While radio in general\nloses listeners to TV in the evening, WBAA loses very little.\n5. During the 7:30-8:30 period, WBAA has a higher listenership than any\nother radio station.\n6. On Monday evening of the January period during the 7:30 hour WBAA\nmaintained an average of more than twice the listenership of the next ranked\nradio station.\nSummary of Findings by Comparison of 1956 Survey and\n1957 g\n1. The general decline of Radio’s share of the audience throughout the\nday in the 1956 Survey was reaffirmed by the findings of the 1957 Survey.\n2. WBAA’s share of the audience for each of the two surveys was\nsubstantially the same, 4. 5% in 1956 and 4.4% in 1957. When compared by\nweekly period, WBAA's share was 4. 4% in 1956 and 4. 0% in 1957. When com¬\npared by fifteen minute periods the same trends of morning decline and\nevening increase were found in both surveys.\n3. In spite of the general decline in total radio listenership in the\nevening hours, both surveys showed that WBAA maintains its own share of\nthe total listening better than any other radio station during the evening hours.\n4. During both surveys a Purdue University basketball game was\nbroadcast during the 7:30-8:30 hour. As was demonstrated in the 1956 Survey,\nWBAA in the 1957 Survey held a substantially larger proportion of listeners\nover other radio stations during this hour.\nSuggestions for Future Surveys\n1. When interviewing, the interviewer should ask the question regard¬\ning television ownership with special stress put on the existence of a TV\nhome, rather than a TV set, for more than one year or less than one year.\nThus he should say, \"Have you had television in your home for more than a\nyear, or less than a year?\", rather than saying, ’’Have you had your TV set\nfor more than a year, or less than a year?” Interviewees often took the\nlatter question to be in reference to the presence for more or less than a\nyear of the particular TV set they had in the home when called. Sometimes\nTV sets were newly traded for a new set, or were at the repair shop, al¬\nthough the home had been a TV home for as long as TV in general had been"
}