{
  "id": "d1843-0",
  "text": "NEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. XXIII, NO. 6 URBANA, ILLINOIS JUNE, 1958\nMOTOROLA, INC. FIRST\nNAEB INDUSTRIAL ASSOCIATE\nMotorola, Lie. recently became the first Industrial\nAssociate member of the NAEB, inaugurating the as¬\nsociation’s new membership classification for manu¬\nfacturing and industrial organizations.\nMr. Philip Jacobson, manager of Instructional\nTelevision of Motorola, Inc. presented NAEB Presi¬\ndent Burton Paulu with a check for $500 to assist the\nassociation in its work of serving educational broad¬\ncasting. This presentation was made during the\nNAEB luncheon at the Institute for Education by\nRadio-Television May 12 in Columbus, Ohio.\nAn Industrial Associate certificate was given\nMotorola, Inc. acknowledging its “support, through\nthe NAEB, of the noblest uses of Television and\nRadio as instruments of American Education.”\nThe Industrial Associate membership classification\nprovides for manufacturing and industrial organiza¬\ntions who wish to participate in support of the as¬\nsociation and the educational broadcasting movement.\nSENATE PASSES\nMA0NUSON BILL\nThe Senate gave its approval to the Magnuson Bill\nMay 29, following a unanimous report of endorse¬\nment from the Senate Interstate and Foreign Com¬\nmerce Committee. The bill (S. 2119) grants up to $1\nmillion to each state for the development of ETV fac¬\nilities.\nApril committee hearings on the bill included the\ntestimony of several educators and ETV broadcasters\nwho spoke in its support for the NAEB. Sen. War¬\nren Magnuson (D-Wash.), originator of the bill, in¬\ncluded statements of this testimony in his report to\nthe Senate.\nSen. Magnuson urged, “I think this is one of the\nmost important bills this Congress will pass for the\nfuture of education, particularly in this fast-moving\nworld of physics and science, in which subjects\nteachers are hard to find, and in which there can be\nsome sort of mass education by use of the new and\nwondrous means of television.”\nIn similar strong support, Sen. John Bricker (R-\nOhio) stated his impression of the committee hearing:\n“I think it was the most inspiring hearing I have at¬\ntended since I have been a member of this body, be¬\ncause of the great promise which educational tele¬\nvision holds for the people of our country. Everyone\nknows our future must rest upon universal education\nof the highest possible quality.”\nUnder the bill, the federal government would\nfinance TV broadcasting equipment by providing\ngrants-in-aid up to $1 million to state educational in¬\nstitutions or agencies organized for ETV purposes.\nNAEB AND OFFICE OF EDUCATION\nSPONSOR ETV CONFERENCE\nFor the first time in nearly eight years, the NAEB\nand the U. S. Office of Education joined forces\nin presenting a Conference on Educational Television\nand Related Media, held May 26 - 28 at the Depart¬\nment of Health, Education, and Welfare in Washing¬\nton.\nAt press time, it was expected that nearly 100\nspecialists both from education and from ETV and\nradio would be attending the Conference. This meet¬\ning provided the two groups with the opportunity to\nexamine educational radio and TV’s current status\nand trends and to utilize a mutual interchange of\nviews so that the relation of TV and other media to\neducation may be established and a constructive\ncourse of action for the future may be determined'.\nThe Conference brought together, for what may be\nthe first time, basic educational and administrative\ngroups with broadcasting organizations such as the\nNAEB, the JCET, the ETRC, and the television com-\n1"
}