{
  "id": "d1843-4",
  "text": "3) students, 4) employees, and 5) ‘special.’ ”\nNote how Thompson’s “various media” differ\nfor each of the five “publics: ”\n1) General Public: newspaper advertising, press\npreviews, press releases, TV spots, window displays\nand exhibits.\n2) Customers: bill inserts, displays, posters, and\ntent cards in business offices.\n3) Students: student publications, previews for\neducators and science teachers, personal or direct\nmail contact with schools, distribution of school\nposters, contacts with national, state and local edu¬\ncational organizations.\n4) Employees: company magazines, employee\nbulletins and newspapers, large and small posters,\ntent cards for cafeterias and direct mail to homes.\n5) “Special:” includes organizations and publica¬\ntions in fields related to the subject of each program;\nalso in the general field of science. Cooperative pro¬\nmotion is often developed with interested organiza¬\ntions. The Weather Bureau, for instance, helped call\nattention to the scientific story of weather presented\nin “The Unchained Goddess.”\n“In addition to the promotion effort by the Bell\nCompanies,” Thompson continues, “each telecast is\npromoted by the network and its stations. This in¬\ncludes newspaper advertising, use of local and net¬\nwork TV spots, and mailing of special releases to TV\ncolumnists plus some direct mailing to organizations.”\nResults? Thompson estimates the total TV audi¬\nence at “more than 150 million viewers.” Another\n7% million saw the Canadian telecasts. The greatest\nsingle audience was drawn to “The Unchained God¬\ndess”—over 37 million.\nDIRECTORY CHANGES\nAffiliate Members 57\n(under University of Chicago)\nDelete: Rm. 10 Administration Bldg.\nAdd: 940 East 58th St.\n(under University of Rochester)\nDelete: 15 Prince St.\nAdd: 109 Administration Bldg.\nRiver Campus Station\nP. 33\n(under MICHIGAN)\nAdd: Henry Ford Museum and Greenfield Village\nMr. K. G. Hermann, Purchasing Agent\nGreenfield Village\nDearborn, Michigan\n(under NEW YORK)\nAdd: Institute for Democratic Education\nMr. Joseph Kenas, Program Director\n515 Madison Avenue\nNew York 22, New York\nPLaza 1-1800\nCONFERENCE PLANNED TO\nSTUDY INSTRUCTIONAL TV\nCollege and university administrators who have been\nconsidering closed circuit television as an instructional\nmedium will have an opportunity to get first-hand\ninformation on its possibilities and its operation at a\nconference to be held at Purdue University August\n24 to September 4.\nThis conference on Televised Instruction will be\nsponsored by the NAEB in cooperation with the\nPurdue television unit, which is under the supervision\nof James S. Miles.\nIn view of the current increase in student enroll¬\nment and anticipated problems which face educators,\nsome 60 or 70 colleges and universities across the na¬\ntion have been carrying on experimental programs in\ntelevised instruction. Purdue’s program, with its\nemphasis on research in the field, provides a good\nbasis for university and college personnel to discuss\nthe use of television with educators already experi¬\nmenting with it.\nDuring the 10-day conference, general and specific\nproblems will be discussed pertaining to administra¬\ntion, financing, scheduling, curricula, methods, re¬\nsearch, and required physical equipment.\nA registration fee of $100 per person will be\ncharged for the conference with funds accruing be¬\nyond the actual conference costs going to the NAEB\nto carry on its program in this field. For further in¬\nformation write James S. Miles, director, Television\nUnit, Purdue University, Lafayette, Ind.\nNAEB MEMBERS WIN 31\nOHIO STATE AWARDS\nThirty-one of the eighty-seven awards for the year’s\noutstanding educational radio and television pro¬\ngrams were presented to NAEB member stations and\ninstitutions during the Ohio State University’s re¬\ncent Institute for Education by Radio-Television.\nThese educational broadcasters won nine radio and\nthree television programs First Awards, twelve radio\nand five television Honorable Mention citations, and\ntwo Special Awards for television.\nReceiving radio awards were five programs pro¬\nduced under NAEB-ETRC Grants-in-Aid. Distri¬\nbuted by the NAEB tape network, they were:\n“Prison Document,” which brought a First Award\nto the University Broadcasting Service for broadcast\nover WFSU-FM, Florida State University.\n“When Men Are Free”, winning a First Award for\nthe Wisconsin School of the Air and station WHA,\nUniversity of Wisconsin, for broadcast over WHA\nJUNE, 1958\n5"
}