{
  "id": "d1843-7",
  "text": "authority to program and operate as if it were\nlicensed. The actual license is not expected for several\nmonths. Dr. Bernarr Cooper, the university’s direc¬\ntor of radio and TV commented, “The important\nthing is that the station is on the air in record time.”\nKNME’s instructional programming is well under\nway with English, biology, mathematics and anthro¬\npology courses aired for credit. Eight New Mexico\ncommunities have been participating in the program\nsince last fall by receiving kinescoped classes.\nThe entire project was set up as the result of an\noriginal grant of $150,000 from the Ford Fund for the\nAdvancement of Education for use in carrying out a\ntelevision junior college experiment.\nNEWS OF MEMBERS\nGENERAL\nKUHT, Houston, the nation’s first ETV outlet on the\nair, celebrated its fifth anniversary on May 23 with\na special program featuring representatives from other\neducational stations and organizations. Included on\nthe speaker’s list were Richard B. Hull, director of\nRadio and Television at Ohio State University and\nformer NAEB president, and Dr. John C. Schwarz-\nwalder, first general manager of KUHT.\ny A year-long schedule of programs marks the ob¬\nservance of radio station KUOM’s twentieth year of\nexpanded broadcasting. The University of Minnesota\nstation, called WLB before 1945, began major radio\nactivities in 1938 with an average program schedule\nof 40 hours per week. Prior to that time, since it went\non the air in 1922, the station broadcasted approxi¬\nmately 8 hours a week.\nDr. Burton Paulu, director of radio and television,\nsigned the station on the morning of May 2, starting\nthe year’s plan to repeat programs recalling the sta¬\ntion’s history and introduce new programs with an\nanniversary theme.\ny Last month’s Newsletter listing of Peabody Award\nwinners omitted one award of significance. Our\napologies to KPFA, Berkeley, the first FM station to\nbe presented with such an award.\nAfter nine years of broadcasting, KPFA was\nselected for the Local Radio Public Service Award\n“. . . for courageous venture into the lightly-trafficked\nfield of thoughtful broadcasting, and for its demon¬\nstration that mature entertainment plus ideas con¬\nstitute public service broadcasting at its best . . .”\ny Two NAEB members received one of broadcast¬\ning's top honors last month with the announcement\nof the winners of the Alfred P. Sloan Highway Safety\nAwards. Radio station WNYC, New York, and\nWCET, Cincinnati’s ETV outlet, were both presented\nwith bronze plaques for outstanding safety program¬\nming at the 10th annual Safety awards dinner May 6\nat the Waldorf-Astoria Hotel. Only three other\nbroadcasters were honored.\nPROGRAMS\ny Eleven outstanding personalities in education join\nin an effort to arrive at a clearer meaning of the con¬\ncept of freedom in the first of a series of TV pro¬\ngrams sponsored jointly by META, New York and\nWCBS-TV. The two-hour program entitled “Con¬\ncept,” is broken into four segments: interviews, de¬\nbates, round-table analyses, and straight lectures.\nTape recordings of the program will be made avail¬\nable to the U. S. Information Agency for broadcast on\nVoice of America in 41 languages to a world-wide\naudience.\nPERSONNEL\ny Glenn Starlin, of the University of Oregon, was\nelected president of the Assn, of Professional Broad¬\ncasting Education during the APBE annual meeting\nApril 27. W. Earl Dougherty, general manager of\nKXEO, Mexico, Mo., was named vice president at\nthe same meeting.\ny Mrs. Ella Will McKinney, co-producer of the Ala¬\nbama ETV network telecast, “Let’s Learn More,”\nwas recently named as one of seven women to re¬\nceive a 1957 Golden Mike award from McCall’s mag¬\nazine. Mrs. McKinney was cited as the “executive\nperforming the greatest service for youth.” Her\nteaching on the daily in-school series was cited with\n“helping to ease the problem of overcrowded and\n_ under-stuffed primary grades in Alabama.”\n^ A “Green Derby” was awarded to Loren Stone\nduring the University of Washington School of Jour¬\nnalism’s annual ceremonies to honor an outstanding\ngraduate. Stone, who has been manager of KCTS-TV\nSeattle, since it went on the air in 1954, was cited for\nthe “outstanding accomplishments” of his station as\nan educational TV outlet.\nBOX\nSCORE\nTotal\nAM Stations - 3239\n(includes 39 non-commercial)\nTotal\nFM Stations - 687\n(includes 157 non-commercial)\nTotal\nTV Stations - 587\n(includes 32 non-commercial)\nNEW\nSTATIONS\nWNPS (AM)\nNew Orleans, Louisiana\nWBWC (FM)\nBerea, Ohio\nKNME-TV\nAlbuquerque, New Mexico\nNEWSLETTER"
}