{
  "id": "d1423-1",
  "text": "News iiETTER\nPaqe 2\nAugust i^ 1946\nRAOto News Editorsc. Hull was graduated from Iowa State College in !939c\nWhile in college he was a member of Sigma Delta Chi, national journalism\nPROFESSIONAL FRATERNITY; CARDINAL KeY AND CARDINAL GuILD, CAMPUS HONORARIES;\nAND Delta Sigma RhOj national forensic honorary» He Ss a member of the NAEB\nExecutive Committeeo\nColonel Harold Wo Kent, Director of the Radio Council and Station WBE2 of\nTHE ChtCAGc Public Schools is leaving for Honolulu August first to assume\nTHE presidency OF THE KaMEHAMEHA SoHOOLSo '^HE INSTITUTfON TO WHICH COLONEL\nKent comes as the new head is probably the most heavily endowed private\nSCHOOL IN THE WORLD AND HAS BEEN DEVOTED TO THE EDUCAfllON OF HaWAMAN\nBLOODED YOUTH SINCE l884o The SCHOOL OCCUPIES A PROMINENT FIVE HUNDRED\nACRE CAMPUS ASTRIDE ONE OF THE GREAT RIDGES THAT OVERLOOKS HOMOLULU FROM\nDiamond Head to Pearl Harbor,\nColonel Kent was a member of the General Staff Corps in Washington, in the\nOFFICE OF the Chief of Staff and was in direct charge of the War Department's\nPLANS FOR Universal Military Training, Prior to his general staff duty he\nACTED AS Director of the Editorial Section under Colonel Ed^ U, Kirby Chief\nOF THE Radio Branch in the Bureau of Public Relations of the War Department\nHe was awarded the Army Commendation Ribbon and the Legion of Merit^\nPrevious to entering the MiLfTARv service Colonel Kent had founded the\nRadio Council of the Chicago Public Schools and laid the ground work for the\ninstallation of Station W8EZ which is the Chicago Board of Education owned\nSTATION, He was also THE LEADING FIGURE IN THE ORGANIZATION OF THE SCHOOL\nBroadcast Conference a national meeting for educators interested in the\nUTILIZATION OP RADIO IN EOUCATlONc He WAS ONE OF THE FOUNDERS AND PRESIDENT\nfor the First three YiARs or the Association for Education by Radio, He\nhas served as member of the National Board of Consultant^ of the CBS Ameri¬\ncan School of the Air and of a similar board for the University of the Air\nwhich is a creature of the National Broadcasting CompanYo George Jenninv,^,\nAT PRESENT ASSISTANT DIRECTOR OF THE RaDIO COUNCIL AND STIiTiON WBBZ JS\nSLATED TO SUCCEED COLONEL KENT AS OlftECTORc\n381.320 OHIO PUPILS USE WQSU\nNearly one school child out of every three in Ohio iisteneo tc special\nCHILDREN'S PROGRAMS BROADCAST OVER THE Ohi0 STATE UNIVERSITY STATION, WCSU,\nlast year “n its “School of the Air”,\nThe annual report on School of the Air activities, submitted by Mrs,\nMargaret Tyler, supervisor, shows that more than 381,320 out of Ohio^s\n1,200,000 PUPILS. HEARD AT LEAST ONE OF THE EIGHT 3PECIALLY-PREPARE0 SERIES.\nThe school^s broadcasts are divided into primary, intermediate, and high\nschool level programs, each adapted by experts for the chjld^s age level\nAND general vocabulary, SKILLS AND ABILITIES*\nTwo programs were heard by small tots !n primary grades. These were\n“Music Time\" and “Story Time”, both cpawpng large mail response from teachers."
}