{
  "id": "d953-113",
  "text": "October 2, 1952\nHr. Frank Schooley\nRadio Station WILL\nGregory Hall\nUniversity of Illinois\nUrbana, Illinois\nwear Frank:\nlour very kind letter and card of October 1 and the sentiments\ntherein are deeply appreciated.\nAs to my interest in the Executive Director’s job of HAEB my\nanswer is still the seme. I am not interested at this time or in\nthe forseeable future# If the University of Alabama does not pro¬\nceed with its TV plans, I ©hall consider moving to an institution\nwhere they are proceeding with TV, but I shall stay here and fight\nit through if it possible to do so. job here does not pay well\nand I have turned down several nice offers for the reasons that:\nfirst, I like to live in the deep South; second, I have put a great\ndeal of myself into this present job and am reluctant to leave this\nstate; third, ay work here is personally more gratifying and offers\nopportunity for advancement so long as I continue to butt my head\nagainst the obstacles we face. Furthermore, if I do make a move,\nI want it to be my last move. I am a strong believer in deeply*-\nplanted roots. This job has never paid well and never will pay\nwell so I pay a high price for the privilege of living where I\nwant to live and doing what I want to do. If I should mates a\nmove out of the deep South, I can think of no place I had rather\nbe ad no group of people with w’nom I had rather work than you.\nWill, Bob and the other fine people I have met at the University\nof Illinois. The fact remains, however, that leaving here is. not\na probability that I face at the present time. How soon I may\nface that probability, I can’t say.\nI apologize for such a long paroration, but your kindness\nI felt prompted a rather complete reply; so unless you cone up\nwith some highly negative information concerning Wynn - and I\ndoubt that you will - 1 am calling a meeting which will include\nSi, Dick Hull, Burton Paulu, Wilbur, and me with Earl Wynn in\nWashington the evening of October 16 and the rooming of October\n17th for a complete discussion of the possibilities of his going\nto work with us the first of January. I am convinced that he\nwill do a thoroughly outstanding job if we can arrive at an\nagreement."
}