{
  "id": "d1219-0",
  "text": "KBR 1\nNATIONAL ASSOCIATION Of EDUCATIONAL BROADCASTERS\nStation WI\nAmes » 2 ova\nMarch 15. 1S48\nTo s William Lot an son\nFromi Dick Hull\nEes Joint public sponsorship ef Monday* May 3rd afternoon session, at Institute\nfor Education by Radis* Columbus, OMo.\nAs you gentlemen suggested in your conference call, the following remarks are\nintended at. a ©tarter for the proposed session at the Ohio Institute to be sponsored\njointly by AER and HAKE» Please feel free to add, subtract, and Mslash* at wilL\n1) I think it is extremely gratifying to have this opportunity for joint\ncooperation, in the common interest of educational radio* Monday® May 3,\nproperly handled* could become a milestone in serious broadcasting*\n2) The fact that this Is the last half-day of the Institute has its positive\nas well as its negative side. If v® regard it as a climax, and even\nsuggest that some of © nr members stay over that srm if necessary, and\naanage to attract school and university people with more than a casual\nInterest we may be able to effect some really basic thinking in educa¬\ntional radio in several areas, namely?\nr\na) Definition of '©durational radio goals and objectives\nb) Better planning and organization to these end®\nc) Working systems for mutual aid (legal, financial, program, etc*)\nd) Recognition among ourselves of our very real, strength*\nc-) Ways1 and means 'to let our administrators, the radio industry, and\nthe public know what educational radio has to offer, end is, offering,\nf) A practical understanding by each educational station operator, each\nproduction center, each university or school radio director of mli&\naudience problems as they relate to his -particular area*\n3) It -seems to me very important this session not become just another section\nin a radio meeting* Things to be avoided ares\na) A review of accomplishment® with which we seek to impress one another.\nb) It must not dissipate itself into discussions of what is good and what\nia bad in education and in broadcasting so w© get Into discussions of\nwhat often are matter© of good and bad taste rather than basic goals.\nc) It must above all, not end in a maze of generalities and generalizations.\n4) On the positive ©Id®, It seens to me this session should accomplish several\nthings:\na) Point out the broad -goals and cro-oortunitles.Ah\nnr serious radio, and the resnonslbmtj^\nmaterial the colleges and universities have .(whcthgr_..?r ,notth^.admit.\nit) to function as broadcasters* production centers, an&_researg||\nagencies, not merely as critics."
}