{
  "id": "d1219-8",
  "text": "9 -\nwe plan to continue this type of demonstration and have al¬\nready scheduled several meetings.\nEven more significant is the formation in Wisconsin\nlast Spring of a Committee on School Broadcasting, represent¬\ning the Wisconsin Education Association of more than 20,000\nteachers. We now have a group of teachers keenly concerned\nabout the place of radio in the school, active in planning\nclassroom broadcasts, and eager to study techniques of ef¬\nfective school use of radio. Under this state committee and\na sub-committee, teachers themselves are developing programs\nfor schools and devising lesson aids. They are planning a\nseries of radio institutes at various centers about the state\nto demonstrate the reception and use of classroom broadcasts,\nand to discuss local problems. More about the work of this\nstate Committee on School Broadcasting is being reported in\nanother section of this conference by Mrs. Lois Nemec of our\nState Department of Public Instruction.\nThrough cordial relations such as these with teachers,\nschool authorities, parent groups, and civic organizations,\nthe work of developing and interpreting the unique service of\na university radio station proceeds. But there is still much\nto be done. There are still many problems to be faced and over¬\ncome. And as I remarked in the beginning, I believe the uni¬\nversity station directors chief problem arises out of the\nfailure of educators and the public generally to realize that\nthere is a problem in educational broadcasting. ItTs so easy to\nhope that finer tastes and unselfish aims will ultimately emerge\nand assert themselves.\nHowever, I am convinced, as I said in closing my\nstatement before the Federal Communications Commission at the\nOctober Allocation Hearing, that: Only by establishing and\ngenerously supporting college and university radio stations will\nwe have full exploration rather than exploitation of the social\ninfluences of broadcasting.\n-X- -X- -)(- -x- * -x- * -x- -x* -X-"
}