{
  "id": "d519-100",
  "text": "Page 2 of Synopsis.\nAs he kneels there, in agony, Rick comes in, 3tands transfixed.\nJosh tells him that Harriet is dead. Rick wants to know who did it,\nand Josh says he doesn't know. He also tells Rick about the landlady\nwho obviously believes that he. Josh, was guilty of beating his wife,\nperhaps mortally, only a few moments ago. He wants to inform the\npolice, but Rick points out to him that he is caught in a terrible web\nof circumstantial evidence, for he has no alibi for his progress back\nhome-he came back on the subway in which he surely would never\nbe recognized by anyone. Rick, apparently in the spirit of helpfulness,\nsuggests that they get rid of the body, but Josh is horrified by this.\nRick says \"the circumstantial evidence is overpowering; we've GOT to\nthink of something\" but Josh only murmurs that Harriet is dead, and\nhe no longer wants to live. \"I'm finished!\" he cries in anguish. At\nthis moment the door buzzer rings.\nRick opens the apartment door, admitting Mrs. Burnett and a\npoliceman. Mrs. Burnett immediately shows the policeman the blood\nspot. Rick now becomes master of the situation. He explains that\nHarriet cut herself while sewing. The landlady wants to know how that\ncould be so-was he down here with her ? Rick says that Harriet came\nupstairs to have him bandage it; but the landlady says that this is a lie,\ntoo, for there wouldn't have been time. She demands to know \"Where is\nthe body?\" Rick, stoutly protests that she's sleeping in the bedroom-\nbut Josh begs him to desist from lying. \"My wife is dead!\" he tells\nMrs, Burnett and the policeman. \"I've seen her lying cold underneath. . . \"\nand he is about to show them underneath the divan when, suddenly,\nHarriet herself appears from the bedroom door, cold and beautiful, but\nwith her hand swathed in a bandage, prominently displayed. Taken aback,\nbut remembering what Josh has just said, Mrs. Reynolds catches at\nstraws, says she might be a twin 3icter, and wants to look under the\ndivan. Harriet quickly sits upon it, and so blocks her. The policeman\nquickly puts an end to all this by taking Mrs. Burnett out with him;\nobviously Mrs. Reynolds i3 alive, and there is no case. Mrs. Burnett,\nstill suspicious, goes ungraciously; and Rick follows them, leaving\nHarriet and Josh alone.\nJosh, terribly relieved, embraces Harriet fiercely, kissing her.\nThen he looks strange. How cold she is! \"Let me go and fetch your\nshawl\" he begs, but she answers \"no, I no longer need it. \" However,\nJosh i3 relieved, and suggests that they light the cake now. \"No\" she\nprotests \"I've lit it earlier\". \"Did you make a wish?\" he asks, almost\ngaily. \"Yes\" she nods. \"Will it come true\" he asks, but she is silent;\nhowever, as he insists upon an answer she says, with false gaiafy--\n\"it won't come true if I tell you. \" Josh says that in a way he's glad all\nthis happened, that it taught him something terribly important----that in\nthose few terrible moments in which he thought she was dead he knew that\nlife meant nothing whatsoever to him any longer. \"I cannot live without\nyou!\" he declares.\nHarriet, stricken, says \"Josh, you MUST not say that!\" Josh says\nthat if she wishes he won't say it- - -but she knows now that he means it.\nAnd she answers \"I know it now. \" She also says that she had a sudden\nstrange realization---that if she could not have him, if he were taken\naway from her somehow-how TERRIBLY lonely she shall be. He,\nrelieved, laughs, and tells her that she DOES have him, for tonight,\ntomorrow, forever.Harriet shivers, as if stricken with a cold\ndraught. Josh, meanwhile, as if tired by the recent events, sags back\ninto the divan; and Harriet, overcome by compassion, sings him to\nsleep with a lullaby, ending by \"I'll love you faithfully, forever.\"\nShe gets up, placing his head upon the pillow, and a its besides\nhim, a look of indescribable sadness upon her face, as the curtain\nslowly descends."
}