{
  "id": "d519-101",
  "text": "Page 3 of Synopsis.\nSCENE THREE\nThe scene commences with tremendous joviality. It is Alberto's Cafe,\na little patio-restaurant nearby, and the place where Harriet and Josh\nfirst met. Also, it is the place they referred to in Scene One, where\nthey planned to spend that evening's anniversary, just as they had done\nevery year previous. A few people are dancing; and Alberto, at once\nthe waiter and proprietor, is curring about. Harriet and Josh enter,\narm in arm, beaming with happiness. Alberto, expecting them, dances\nthem to a table, brings Chianti as per usual. Josh points out to Harriet\nthat her bandage is slipping and, as he takes it off, laughingly points to\nher that there is no blood inside it; in other words, it’s a fraud of a\nbandage! Harriet assumes innocence, pretends not to understand. But\nJosh good humoredly says he understands alright-Harriet has played\na trick upon him, probably to test him. He wants her to explain, but\nshe tosses this off with \"oh, explanations are boring.\" But he insists\nupon knowing how she came out from under that divan (by now, of course,\nhe assumes that he was mistaken in believing her dead). She laughingly\nsays that she just crawled out from underneath it when he and Rick were\narguing as to what to do with her body. Josh protests that he had nothing\nto do with that, and she says \"and a good thing too, or else I'd never have\ncome back. \" So Josh laughingly assumes that she just did all this to\nteach him a lesson not to use such large resounding phrases as \"I love you\nforever\" etc. unless he meant them. He is, as a matter of fact, almost\ntoo anxious to believe this; indeed all this could be his wish-fulfilment\ndream. He dances with Harriet, and she murmurs \"Oh Josh, it's so\nbeautiful here on earth-who would ever want to leave it\" yes, she would\nlike to go on dancing here, like this, with him forever. She implies that\nit i3 a \"ghostly\" evening; and he protests \"but you're not a ghost\" and he\npicks her up \"you still weigh 110 pounds-ghosts weigh only three ounces!\"\nWhereupon Harriet becomes skittish, claims that SOME ghosts are fully\nmaterialized, up to full specific gravity, and gives instances---for instance\nthe policeman they saw that evening is a policeman that was shot dead years\nago, he just likes to hang around the neighborhood. She also mentions\nBen Weiss, the cigarstore man---another case of a fully materialized ghost.\nAlberto has brought them their cake, lit, and she sits down again at their\ntable with Josh, clapping her hands and saying \"How pretty, how very\npretty. \"\nA trio of men come out and sing a song about the enticements of Alberto's\nCafe. Beneath their false moustaches can be seen Pat the Policeman,\nBen Weiss, and Alberto himself. Harriet seems to know all of them by\ntheir first names, which surprises Josh---mildly. He is enjoying the\nevening for all it is worth. After the song, however, Pat and Ben come\nover to talk to Harriet. They are awkward, as if they bring bad news.\nPat says she's forgotten something. Ben adds that \"they're bound to find\nyou sometime.\" Harriet buries her face in sudden grief. Pat insists that\nthe case is pretty tight; Josh's fingerprints are on that poker. Ben adds\nthat she'd better go see Rick, he'd listen to her IF she approached him in\nthe right way. Harriet, grief-stricken, protests that she doesn't want to\ngo, she doesn't want to leave Josh. Ben and Pat leave, shrugging their\nshoulders sadly; they've done their be si. The candles on the cake have\nburned out, the people have left the cafe, it becomes dark and lonely\nthere. Josh begs Harriet for one more dance---although the gay music\nhas stopped and a ghostly terrifying music has taken it3 place. She dances\nwith him, but she is leaden, he literally has to carry her. She finally\ncries \"stop! stop\" and he does, but says \"darling, you are so cold, cold\nas ice!\" He now becomes transfixed, as she, with terrible effort, moves\nbackwards, into the distance, saying \"Love me Josh, love me always.\"\nWhen she disappears, Josh is released from his spell and moves painfully\nafter her, but it is too late. He cries \"Harriet, Harriet\" but she is gone,\nas the curtain slowly falls on almost complete darkness."
}