{
  "id": "d519-102",
  "text": "Page 4 of Synopsis.\nSCENE FOUR\nIt is the same as Scene One and Two, the apartment. Josh is asleep on\nthe divan in precisely the same position as at the end of Scene Two. The\nlandlady, first buzzing, then letting herself in with her own key, enters\nfurtively with her alibi---a pan of water and some rags---which she plans\nto use in case she is discovered; her real purpose is to see if Harriet's\nbody is really underneath the divan. She tries to get a look underneath it,\nbut Josh frightens her off by stirring in his sleep. The door-buzzer rings\ninsistently again; this time Josh awakens but does not 3ee Mrs. Burnett,\nwho hides hastily in the hall closet, her retreat through the apartment\ndoor blocked. Josh goes to open the door; it is Rick, wild-eyed with\nfright. He leans upon the door, as if someone pursuing him wants to come\nin, Josh wants to know what's up; and Rick tells him that Harriet is on the\nupper landing. \"She's awful to look at\" Rick says, burying his face in his\nhands. Josh runs out to look, but sees nothing, decides that Rick is losing\nhis mind. Rick continues to insist that she is there, crawling down pain¬\nfully. The closet door opens a trifle, indicating that Mrs. Burnett is not\nmissing a word of all this, Rick then confesses that he murdered Harriet,\nand that it is her dreadful ghost which is crawling down the stairs, after\nhim; \"she's not human anymore\". Moreover, he says, it was not necessary\n\"The cake was poisoned and would have killed you both within the hour. \"\nJosh believing that he is insane, shakes him and says \"make sense, make\nsense.\" Rick then describes how he killed him with the poker. Josh says\nthey all, including Rick saw her after that; but Rick says \"THAT WAS NOT\nHARRIET_IT USED TO BE HARRIET.\" Josh, increasingly agitated,\nsays he's crazy, but even Josh is not sure that he does not hear the leaden\nfootsteps coming down the stairway---though, previously, he saw nothing.\nRick says that Harriet sent him down here to confess because \"There's a\nWitness\" down here-as, indeed, there is-Mrs, Burnett in the closet.\nJosh catches a glimpse of the closet door hastily closing and thinks it is\nHarriet; he goes to it, begs her to come out, but Mrs. Burnett, besides\nherself in terror, runs out, gathers up her pan and rags, runs out.\nRick asks Josh to forgive him, because he truly loved her, runs out\nsobbing. Josh, left alone, goes over to the cake. He knows, now, some¬\nthing is wrong, terribly wrong. In complete abstraction he sings to him¬\nself a little song about poison cake, ending\nBaker, baker, can you bake\nFor us both a poison cake ?\nHe snaps out of his trance, and commences to lose his self-possession\nentirely. He says to himself \"WHAT DID RICK MEAN\" and commences\nto search through the apartment, finally bringing himself about to move\nthe divan, as he moved it in Scene Two.\nThere is Harriet, lying there exactly as we saw her before Rick\nmoved the divan back over her body. Josh cries \"Harriet, Harriet, \"\ntries to put her arms around his neck, but they fall back listle ssly.\nYes, she is dead. She probably has been dead all along. Her face is\ndeathly white. With finality he says \"Harriet is dead\" , straightens\nout her head and arms, sees the lighted cake, goes over to it, gets a\nknife, reads the inscription on the cake \"I Love You Forever.\"\nSuddenly some brassy popular music comes from across the way.\nJosh goes to the apartment door, still open from Rick's hasty exit, and\ncloses it, so closing off the world. He goes back to the cake, cuts a\nportion of it; and, as the curtain falls, we know that he will soon eat this\nheavily poisoned cake----and rejoin the Harriet he loves so terribly.\nEND OF \"THE WISH1"
}