{
  "id": "d519-104",
  "text": "2.\nHARRIET: Last year our cake had three candles and it read:\n\"I love you more than Life\" That’s what you’ve always said. Darling!\nJOSH: Yes Harriet?\nHARRIET: Do you really believe that we love one another that much?\nBeyond life ? Forever ? I know I do! I know now that I will love you\nforever.\nJOSH: I know it too.\nHARRIET: Darling!\nJOSH: Harriet! Have you ordered the cake for this evening?\nHARRIET: No, not yet! But I'll do it after you leave. Have you reserved\nthe same table at AJberto's?\nJOSH: I ordered it yesterday for tonight.\nRICK: Happy anniversary, you two!\nJOSH: He’s brought us our cake!\nRICK: It's incomplete, I don't remember what cabalistic remark you\nalways inscribe...\nHARRIET: I'll attend to that. I've got the gadget.\nRICK; So, now it's almost ready.\nJOSH: It's mighty swell of you, Rick, to remember; thanks! Well I've\ngot to go now until tonight.\nHARRIET: To-night!\nRICK: No! No!\nHARRIET: Why not? Is it poisoned?\nRICK: You'll spoil itl It's for tonight. For you and Josh together!\nYou both light it first, wish, then eat it.\nHARRIET: Oh! so it's for both of us this time! Well!\nRICK: I don't understand.\nHARRIET: It's about time that you tried poisoning us both! You've\ntried long enough to poison Josh!\nRICK: I don't know what you mean.\nHARRIET: Yes, you do! What's more, you knew that I knew since\nyesterday. When you saw me take that glass of milk which you brought\nfor him, out of the frigidaire and replace it with a glass of milk I had\npoured myself. I saw you look at me then and say to yourself then\n\"My God, she knows! She finally knows !\" Now it's clear. All of those\nviolent attacks he*3 been having, begin to make sense. I see what you're\nup to. Every time it was something he alone could eat. And I was\nallergic to strawberries, shrimps and cottage cheese. So now that you\nknow that I know why shouldn't you poison us both? You know, surely\nthat I'll tell Josh now, don't you? And soon?\nRICK: The cake's not poisoned, Harriet, I swear it!"
}