{
  "id": "d519-54",
  "text": "Italia Prize proper:\n1\nAn International Prize will be awarded each year in accordance with the\nregulations of the present Statute,\nThe Prize will be called \"Italia Prize - International competition for\nRadio Works, founded at Capri in 19U8,\"\n2\nAdditional Prizes may be awarded as well, each year, in accordance with\nthe Additional Statutes,\n3\nThe Italia Prize will be awarded each year to:\n1) a musical composition with wordsj\n2) a literary or dramatic work with or without music.\nThe entries submitted must have been especially created for broadcast¬\ning and must be in a form best suited to be presented through the medium\nof radio.\nThe entries submitted must present high aesthetic qualities and must\nalso include elements ttfhich broaden and enrich broadcasting experience,\nb\nEvery Broadcasting Organization is free to choose, without any con¬\nsideration of nationality, the Authors or Composers of the entries to be\nsubmitted.\nThe entries submitted may be entirely new. Should they have already\nbeen broadcast, they must not have been put on the air more than two years\nbefore the awarding of the Prize.\nWorks inspired by texts which have already been published are admitted\non condition that they have a creative value for broadcasting.\n5\nEach year the Italia Prize is divided into two parts having equal\nvalue, of which:\n—one to be awarded to a musical composition with text;\n—and the other, to be awarded to a literary or dramatic work with\nor without music.\nThe awarding of ex-aequo prizes is excluded.\n6\nThe Juries shall not examine any entries other than those submitted\nby the Broadcasting Organizations which have accepted the Statute of the\nItalia Prize and have fulfilled all the conditions laid down by the said\nStatute.\nEntries of a publicity character will be rejected.\nIn the choice of entries, Broadcasting Organizations should bear in\nmind the suitability of the works for being broadcast by all the Organiza¬\ntions participating in the Italia Prize.\nIt is also desirable that the entries submitted to the Juries should\nbe easy to translate without impairing their artistic value."
}