{
  "id": "d519-58",
  "text": "-5-\nItalia Prize for Television:\n1\nAn International Prize shall be awarded for two years in accordance with\nthe regulations of the present Appendix.\nThe Prize shall be called \"Italia Prize for Television.\"\n2\nThe Italia Prize for Television shall be awarded to: a dramatic work, with\nor without music, of original inspiration, whose subject has been especially\ncreated for television.\n3\nEvery Organization Member of the Italia Prize is free to choose, without\nany consideration of nationality, the Authors of the entries to be submitted.\nThe entries submitted may be entirely new. Should they have already been\ntelecast, they must not have been put on the air more than one year before the\nawarding of the Prize.\nk\nThe Italia Prize for Television may not be divided.\n5\nThe Jury of the Italia Prize for Television shall not examine any entries\nother than those submitted by the Organizations participating in the Interna¬\ntional Competition of the Italia prize, which have accepted the Statute of the\nPrize and have fulfilled all the conditions laid down by the said Statute.\nEntries of a publicity character will be rejected.\n6\nThe Jury shall examine only entries accompanied by a written statement by\nwhich the Authors, insofar as they are concerned, declare that - under reserve\nof their moral right and for the sole purpose of permitting the telecast of\ntheir work by all the Organizations participating in the Italia Prize - they\nauthorize the said Organizations, should their work be awarded a prize, to pro¬\nceed:\na) with the necessary translations and dubbings, and with the indispensable\nadaptations of the work;\nb) with the recording of the work by instruments suitable for the reproduc¬\ntion of pictures and sounds (transcriber), with a view to the telecasts\nprovided for under c) hereunder;\nc) with two telecasts of the work either by direct telecast or in relay or\nby means of instruments suitable for reproduction. For each of these\ntelecasts the Authors shall be credited with the usual amounts paid by\nthe Telecasting Organizations for works of the same nature. No addi¬\ntional amounts of any kind shall be claimable by the Authors on account\nof the fact that the work has been awarded a prize.\nIn the above mentioned statement, the Authors must also declare that, inso¬\nfar as the entry is concerned, they are the sole owners of the rights of trans¬\nlation, dubbing included, adaptation, reproduction and telecasting, otherwise\nthey must indicate the owner or owners of either one or of all of these rights.\nIn the latter case, the Organization submitting the entry may request from the\nAuthors, making it a condition to be fulfilled before submitting the entry to\nthe Juries, written authority from the said owners covering the points in a),\nb) and c) above."
}