{
  "id": "d1813-0",
  "text": "N-A-E-B NEWS-LETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nRepresenting non-commercial, educational AM, FM, and TV broadcasting stations,\nworkshops, and production centers, owned and operated by colleges, •\nuniversities, school systems, and public-service agencies.\nJANUARY 1952\n*T) _____\nNAEB NEWS\nNAEB RELEASES IQS ANGELES TV STUDY\nApproximately one-fourth, or 26 per cent, of the total Los Angeles TV program time\nduring the week of May 23rd - 29th, 1951# was devoted to adult drama programs, it\nwas found by the National Association of Educational Broadcasters in its survey of\nthe eight television stations serving the Los Angeles area. These programs were\nlargely motion pictures. Within the broad classification of Drama, Western Drama\nled all other types with slightly more than ten per cent of the total program time\nof the test week.\nThese statistics were disclosed when Seymour N. Siegel, Director of Radio Communica¬\ntions for the City of New York and NAEB President, released Study #2 in the organi¬\nzation^ projected series of television monitoring surveys. Study #1 was made in\nNew York City during the week of January l±th - 10th, 1951* The Los Angeles study\nwas financed by a grant from the Fund for Adult Education.\nProbst Explains Purpose of Studies\nAccording to George E. Probst, Chairman of the Committee to Supervise Monitoring\nStudies, ’’the NAEB is making these studies because of its interest in serving the\nentire broadcasting industry, the Federal Communications Commission, and the public\nby increasing the knowledge of current television programming. The Los Angeles\nmonitoring study, along with the previous New York study and other projected tele¬\nvision monitoring studies, should be useful in identifying trends in television\nbroadcasting and should provide a basis for more intelligent planning by commercial\nand educational broadcasters alike.”\nOther members of the Monitoring Studies Committee were Richard B. Hull, Director of\nStation WOI-AM-FM-TV, Ames, Iowa; Harold McCarty, Director of Station WHA, Madison,\nWisconsin; Parker Wheatley, General Manager of Station WGBH, Boston, Massachusetts;\nand NAEB President Seymour N. Siegel.\nNAEB News.... 1 - 15\nWisconsin Radio Council......... 1*6 - 18\nResearch Report—Dallas Smythe..... 19 - 21\nJCET News...*... 21 - 26\nPresident’s Page—Seymour N. Siegel.... 27 - 28\nDirectory..... 29\nThe N-A-E-B News-Letter, published monthly, is distributed from the editorial offices at KUOM, University of Minnesota, Minneapolis.\nN-A-E-B members and associate members regularly receive the newsletter as part of membership service together with various special\nreports, studies, and program helps. Non-members of N-A-E-B may obtain the publication at a subscription rate of $5.00 per year.\nAll subscription inquiries and editorial copy should be addressed to Burton Paulu, Editor, Station KUOM, University of Minnesota,\nMinneapolis 14, Minnesota."
}