{
  "id": "d1813-1",
  "text": "-2-\nStudy Made by Smythe and Campbell\nThe Los Angeles study was made by Dallas W. Smythe, Research Professor at the\nInstitute for Communications Research and Professor of Economics at the University\nof Illinois, and Angus Campbell, Director of the Survey Research Center and Pro¬\nfessor of Psychology and Sociology at the University of Michigan.\nProfessors Smythe and Campbell set up a monitoring room with nine television sets in\na large suite of the Chateau Elysee in Hollywood, and employed a corps of 1*0\n- trained monitors. These were graduate students and advanced undergraduates at both\nthe University of California at Los Angeles and the University of Southern Cal¬\nifornia, as well as professional research interviewers.\nThese monitors operated under three basic rules:\n1. All time when the station is on the air (not counting test patterns) was\ncredited to some program.\n2. Time used for advertising was carefully defined. (\"Advertising\" meant the\ntime used by a station on behalf of commercial purposes other than its own.\nThat is, the promotion of the station or its programs was not considered\nto be advertising.)\n3. Classification of a program in accordance with the nature of its predominant\nelements. (Where a program contained two or more characteristics, each of\nwhich would suggest placing it in different classifications, the decision\nwas made on the basis of the predominant element.)\nDomestic Programs—16%\nThe NAEB Los Angeles TV Report shows that after Drama programs, the next largest^\nsingle portion of the week was devoted-to Domestic programs (16 per cent) including\ntelecasts on cooking, shopping, personal care, variety programs for housewives, and\nsimilar presentations.\nNews reports contributed 12 per cent of the total, a proportion considerably in¬\nflated by the telecasting over two Los Angeles stations of a series of \"special\nevents\" programs in connection with a kidnapping in Southern California which\nshortly preceded the test week. These broadcasts amounted to approximately eight\nper cent of the total time on the air.\nChildren’s programs and Variety programs for general audiences each occupied ten\nper cent of the total time. Music of all types, although largely popular, took six\nper cent of the total programming. Eighty per cent of the total television time\nduring the week of monitoring was taken up with the above type of programs.\nThe remaining time was taken up by a variety of program classifications, none of\nwhich commanded more than a small amount of the total programming. Information pro¬\ngrams, including travelogues, scientific presentations, information programs for\nchildren, and the like, took approximately three per cent* Programs dealing with\nPublic Institutions (i.e., the Police Department, Los Angeles Harbor Authority, etc.)\ntook almost two per cent. Religion as a program class had less than one per cent\nof the total time. Public Events and Weather each amounted to less than one per\ncent."
}