{
  "id": "d1813-10",
  "text": "-11-\nDunham is a graduate of Columbia University, holds a Doctorate in Music from the New\nYork College of Music, and honorary doctorate degrees from St. Bonaventure and St.\nMichaels Colleges. He is an honorary fellow of Trinity College and was decorated by\nthe French government as Officier Instruction Publicque.\nStation and Program Awards Also Announced\nCitations were given to fifteen networks, stations and programs including the fol¬\nlowing :\nTo Station WLS and its WLS-SCHOOLTIME series, NEW WORLDS OF ATOMIC ENERGY. The sta¬\ntion and Mrs. Josephine Wetzler, director of education are to be commended for\nbringing to the schools of the middle-west this up to the minute, authoritative pro¬\ngram on a current problem of interest to every citizen.\nTo the Radio Division of the United Nations for its series, “Citizens of the World.\"\nThe basic philosophy of this program is, “through knowledge you will understand.\"\nApplying as it does to figures from many countries, backgrounds and aspirations,\nthis program is helping to dispel fear of other peoples and understanding them.\nTo Station WABE-FM, owned and operated by the Eoard of Education of the City of\nAtlanta, Georgia, and to Margaret A. Kill an, producer, for'the TELL IT AGAIN series.\nA regional program designed to familiarize children of the schools with the cul¬\ntural heritage of the region.\nTo Station WMEZ, Boston, and to Robert Schimmel, director of radio for the Boston\nPublic Schools, for the program “The Cricket on the Hearth,\" one in a series de¬\nsigned to bring outstanding but seldom heard classics of literature to the classroom\nand general public.\nTo Station WILL, owned and operated by the University of Illinois, for the program\nseries, \"Stories *NT Stuff,\" a program for children with much basic information told\nin an interesting and entertaining fashion. This program series disproves the\ntheory, sometimes held, that university and other educational stations operate in\nthe cloud-cukoo land of class-audience only. \"Stories ’N1 Stuff\" has an appeal for\nevery youngster.\nTo WHCU, ithaca. New York, and Joseph A. Short, Assistant Production Manager WHCU and\nteacher in the Ithaca High School - for the program series \"ACCENT ON YOUTH 1“ pre¬\nsented by the students of the Ithaca High School Radio Workshop in cooperation with\nWHCU. Actual student experience in writing, producing and appearing in radio pro¬\ngrams of the “ACCENT\" series and also the \"YOUTH BEHIND THE EIQiT BAIL\" student\ntalent programs.\nTo Station WTCN-TV, Minneapolis, Minnesota, and to Miss Madeline Long, Consultant in\nRadio-TV education for the Minneapolis Public Schools, for the program series,\n“Video School\"* an outgrowth of a school situation which proved that television can\nteach. The program series has now become an established feature of WCTN's schedule\nand also the viewing schedule of a vast audience.\nLAWYERS CRITICIZE TV COVERAGE OF PUBLIC HEARINGS\nThe television, radio, newsreel and camera reporting of hearings by executive and\nlegislative bodies was condemned recently by a committee of New' York lawyers. In a\nreport growing out of the recent Senate crime committee inquiry, the lawyers held\nthat abuses of such reporting invaded individual rights and diminished the effect¬\niveness of investigations."
}