{
  "id": "d1813-13",
  "text": "Coy in Washington (November 27, 1951) stated: \"We hope to be able to issue our new\nassignment table, the engineering standards and our decision on the educational res-\nervation within the next sixty days or so. A reasonable period, perhaps 60 days,\nwill beTallowed for the filing of applications. This would mean that we could re¬\nsume issuing construction permits even as early as the first of April.'1\nTV Digest (December 1, 1951) guessed: \"Target date for the final decision is Feb¬\nruary 1 with grants to start April 1. Some at FCC agree that those dates are\n\"targets\" but consider them optimistic.\"\nJCET is making no definite predictions, but in December mentioned \"the first part of\nnext year, possibly by March.\" The majority of inquiries directed to JCET are in\nregard to the decision rather than the issuing of grants.\nYOU: What’s your forecast???\n\"JAZZ IS MY BEAT\" OVER WNYC TO FEATURE JAZZ EXCHANGE GUESTS AND JAZZ PERFORMANCES\nBroadening its policy of presenting varied forms of music, and acceding to the many\nrequests of its listeners, WNYC started a new series of programs titled \"Jazz Is My\nBeat,\" every Monday and Friday at 5:00 to 5:30 P. M., on Friday, January U. As the\nname suggests, the program will cover all aspects of jazz: new and rare discs, cur¬\nrent news, interviews with prominent jazzmen and on-the-spot recordings of jazz\nperformances.\nThe program will be conducted by Jerry White, who has been active on the jazz scene\nsince 1938. Mr. White's most notable accomplishment in this field has been the.\npromotion of the careers of such personalities of the jazz world as Billy Eckstine,\nSarah Vaughn, \"Dizzy\" Gillespie, \"Flip\" Phillips and Charlie Parker.\nJerry White believes that \"Jazz Is My Beat\" will be the means of bridging the gap,\nnot only between the fan and the music, but between the fan and the musician as well.\nTo accomplish this, one of the features of the new program will be the \"Jazz Ex-.\nchange\" - a means by which the musician himself will be able to express his opinion.\nAs Mr. White puts it, \"The people who talk about jazz to the public are usually\ncritics or fans. The musicians don’t often have the opportunity to talk about their\nmusic in a public \"forum.\" This forum WNYC will provide.\nAn impressive list of jazz musicians signed the guest register on the premiere\nbroadcast January U. These included: Billy Taylor and George Wallington, pianists;\nJoe Thomas, trumpet; Kenny Clark, drummer; and Freddy Green,.trombonist. In addi¬\ntion, there were two interviews from France with trumpeter Bill Coleman and Charles\nDelaunay, French j azz critic.\nFM IN TUSCALOOSA SUBJECT OF HARWOOD STUDY\nIn April 1951 the Department of Radio of the University of Oklahoma went into i|00\nTuscaloosa homes to conduct a survey about FM. The results are summarized as follows\nby Kenneth Harwood, acting head of the University of Oklahoma radio department.\n1. The preportion of homes with FM receivers is far above the estimated\nnational average. Industry spokesmen say that 1*5% of homes in the U.S.\ncan receive FM, but we found FM receivers in 16.5$ of Tuscaloosa homes.\nTo put it another way, the rate of set ownership in Tuscaloosa is more than\ndouble the national rate."
}