{
  "id": "d1813-24",
  "text": "-25-\neffectively throttled by a shortage of FM receivers. A similar shortage of UHF\nconverters and all-band receivers would not only delay the development of a\nnation-wide television service but would also operate to the detriment of many\nprospective educational television licensees.\nEducators—Like Commercial—Telecasters Seek Large Audiences\n,vFor an educational television station in the UHF band to do a significant\neducational job it must have a large audience equipped with sets capable of\nreceiving educational programs* While some educational programs such as in¬\nclassroom programs and formal courses on television might be said to appeal\nto a well-defined specialized audience, such important programs as those\ndealing with adult education are designed to meet the needs of the general\naudience. An educational television station therefore must be able to appeal\nto different interest segments of the total public. An educational television\nstation in the UHF band will be able to attract a large audience only if large\nnumbers of UHF converters and receivers are available to the.public. And the\npublic will not be interested in such converters and receivers until after\nsome UHF stations get into operation.\n‘’The JCET believes, therefore, that the adoption of the recommendations of the\nBar Association would greatly delay' not only the early development of the UHF\nband, but also the provision of a truly nation-wide television.service, and\nthe growth of educational television stations in those cities in which UHF\nrather than W channels will be reserved for education.'1\nLANDIS BECOMES JCET COUNSEL\nThe Joint Committee on Educational Television has named James M. Landis, New York at¬\ntorney, as its legal counsel in behalf of the nation’s educators in their efforts to\nhave television channels reserved for educational use. Landis will be associated\nwith Seymour Krieger in the absence of General Telford Taylor, counsel to the.JCET\nsince November 1950, now Administator of the Small Defense Plants Administration.\nThe switch in attorneys was announced simultaneously with the JCET report that close\nto one-fourth of the 1500 legal petitions for television channels were filed by\neducational groups. 552 colleges, universities, school systems and public service\nagencies have provided the Federal Communications Commission with written arguments\nin support of the 209 channels tentatively set aside by the Commission in March 1951*\n’’This represents a major accomplishment cn the part of the educators,” says Landis*\n’’They have acoepted the Commission’s challenge to state their intentions toward the\nutilization of reserved channels. I feel sure that the majority of the proposed\nreservations, ten per cent of those available, will be upheld in the Commission’s\nfinal plan, which is expected to be announced by February or March of next year.”\nJCET’s new counsel is well-known in both the academic world and in government) he was\ndean of the Harvard Law School from 1937 to 19^6, and has served as a member of the\nFederal Trade and Securities and Exchange Commissions. During World War II he was\nDirector of Civil Defense and Economic Minister to the Middle East. He has law\noffices in New York and Washington.\nJCET Made Up of Seven Organizations\nThe Joint Committee on Educational Television, partially financed by the Fund for\nAdult Education established by the Ford Foundation, is made up of seven educational"
}