{
  "id": "d1813-3",
  "text": "-h-\nStill Leaves Unanswered Questions\nThe National Association of Educational Broadcasters has had in mind, during the New\nYork and Los Angeles surveys, and will have in mind during future surveys, several\npertinent questions to which they are seeking answers. As Monitoring Studies Com¬\nmittee Chairman George E. Probst puts it:\n\"The Committee believes that only through intensive research work . . . can\nthe industry secure the necessary facts for an identification of the answers\nto such questions as: ’Has the pattern of American television programming\nalready been molded?’, ’What is this pattern?’, ’What are the changes in\nAmerican television programming?’, and ‘How does the American television\nprogramming relate to and reflect the needs of the community?’\n\"It is often said,\" Mr. Probst concludes, \"that television is a window on\nthe world. The purpose of these studies is to show the shape of the world\nthat is there revealed.\"\nWILL PROMOTION DEVICE DOUBLES AUDIENCE\nA single printed booklet distributed by direct mail—plus spot announcements—more\nthan doubled the number of listeners in a survey sample tuning in three programs of\nthe University of Illinois non-commercial radio station WILL according to a study\nrecently released by the University’s Institute of Communications Research.\nAt the same time the total of WILL listeners in the sample went up approximately 60\nper cent as a result of the promotion for the three programs, it was reported in the\nnew University of Illinois bulletin, Building Audiences for Educational Radio Pro¬\ngrams , by Professor C. H. Sandage.\nIllustrated and printed in two colors the eight-page booklet gave detailed informa¬\ntion about the three specific programs, their content, personalities involved,\nspecific mention of musical selections to be presented, and the satisfactions and\nbenefits these would bring. It was distributed by mail and through the schools of\nChampaign County, Illinois, where the sample audience resided.\nDiary Method Used\nThe sampling used included 61*7 urban, village, and farm residents* selected at\nrandom, who kept a diary of radio listening coring four selected survey weeks, and\nwho were unaware of any connection between the research project and Radio Station\nWILL. The booklets were distributed just prior to the third survey week. A\nspecial distribution went to one-half of the survey panel with a letter from the\nstation manager but in no way identified with listening diary.\nDuring the third survey week the number of hours of listening to WILL on week-days\nwas increased over the first listening period more than three-fold for the group\nreceiving the booklet by direct mail, and more than doubled for the other group.\nThe fourth diary, kept a month later, showed both groups maintaining a healthy in¬\ncrease, although all special promotion was discontinued after the third listening\nperiod.\nFrom the study results it was found that \"left to their own devices, relatively\nmore college-trained than non-college-trained persons will select educational radio\nprograms.\" With the promotion, however, non-college-trained persons were added to"
}