{
  "id": "d1813-5",
  "text": "-6-\nWFUV Language Lessons\nDoes a listener favor cultural programs apart from music? A housewife may be\ndelighted to learn that instead of a soap opera she can take her pick on FM\nof lessons in Italian, Spanish, French, Russian or German. WFUV, owned by\nFordham University, offers them on successive mornings at 11:30 o’clock.\nWFUV also enlists its faculty members for talks in the sciences, literature\nand art, and many of them are excellent indeed. In covering local dinners\nand meetings, WFDR usually shows more enterprise than all the standard radio\noutlets put together. Books, discussion of the dance, liberal commentary\nand poetry? A careful perusal of Hie FM programs over a few days will turn\nup these, too. . . .\nFor those who want them, of course, the network radio shows also are avail¬\nable on FM in New York. But for additional programs to provide for more\nbalanced listening, exploring the FM dial is an experience that is not\nonly rewarding but also relaxing.\nNEW KUOM AND WOSU BULLETINS PLUG NAEB TAPE NETWORK\nThe lead story in the winter quarter bulletin issued by the University of Minnesota\nstation KUOM is deleted to the tape network.\nThe inside cover page, headed \"KUOM Salutes the NAEB Tape Network,11 states:\nIf you have been a fairly regular listener to KUOM during the past two years,\nyou may have noticed a significant increase in top-level programs originating\noutside of Minnesota.\nFrom New York you have heard the voices of world-famous authorities in many\nfields of interest via the stimulating, thought-provoking Cooper Union\nForums. From New York too come the witty, urbane commentaries of David\nRandolph on Music for the Connoisseur. From the famed Iowell Institute\nCooperative Broadcasting Council in Boston, you have heard challenging\ndocumentary programs concerned with a wide variety of human problems.\nFrom London, KUOM listeners can now hear the finest radio drama in the\nworld, produced by the British Broadcasting System for its outstanding\nWorld Theatre series.\nCorrespondingly, listeners in other parts of the nation will soon be hearing\nprograms originating from the University of Minnesota—programs produced at\nKUOM—which best represent the contribution of our state to the welfare of\nthe nation as a whole.\nThis revolutionary new development in educational broadcasting has been made\npossible through the creation of the NAEB Tape Network, a cooperative radio\norganization operated by the National Association of Educational Broadcasters\nfor its 75 member stations throughout the United States. The Network pro¬\nvides for the mutual exchange of the finest programs of its member stations.\nIt also procures and distributes programs from other agencies engaged in the\nproduction of radio material of serious purpose and mature content.\nThe NAEB Tape Network is founded on the simple belief that the use of radio\nexclusively for entertainment and the selling of merchandise is a serious\nwaste of a major national resource. In addition to these uses, radio broad-"
}