{
  "id": "d1813-8",
  "text": "-9-\nBelieving that many WOSU listeners would like to know more about polio, especially\nduring this annual period of the March of Dimes drive, Ewing took a tape recorder on\nhis daily visits to the hospital for the purpose of preparing a documentary series\non polio. That series of four programs will be broadcast on ”W0SU and You” which is\naired each Wednesday afternoon at 2:30 and repeated Saturday mornings at 10:00,\nThe first program on January 9, is entitled ”It Couldn’t Happen to Us.” In this\nprogram parents of polio patients tell of their experiences in the beginning of the\nillness before the children were hospitalized, A resident doctor answers the ques¬\ntions: What are the early symptoms of polio? What should parents do when they\nsuspect polio? Actual sounds of the hospital waiting room were recorded for this\nprogram.\nOn January 16, the program is ’’They Live in Lungs.'* It’s the story of polio\npatients in the critical stage of isolation. One interview is with a patient in an\niron lung; another is with a patient who just passed the respirator stage. The\nnurse supervisor tells about the special nursing care that’s needed.\n’’The Long Road Back*1 will be aired on January 23. It explains the various treat¬\nments given patients after the isolation period. Included are interviews with the\nhead therapist of the polio floor in the hospital and a patient who is receiving\nwater therapy. An interview with a seven-year-old girl just ready to go home closes\nthe program.\nThe final program, ’’Those Who Wait,” will be broadcast January 30. On this program\nparents tell of the impact of this experience on them and how it affeqts their\nroutine of daily living. They also point out how the polio foundation helps them to\nsolve their financial problems.\nThese programs are being offered other NAEB stations via the tape network.\nPOWERFUL RADIO FREE EUROPE TRANSMITTER STARTS BROADCASTS TO HUNGARY\nThe signal power of Radio Free Europe’s short-wave transmitter to Hungary, located\nin the Frankfort area of Western Germany, has been increased from 10,000 to 50,000\nwatts, it was announced on Christmas Day by General Lucius D. Clay, national chair¬\nman of the Crusade for Freedom.\n’’This tremendous increase of transmitter power is a Christmas gift from the American\npeople to the victims of Communist oppression behind the Iron Curtain—a gift that\nwill give no comfort to the men in Moscow or their puppets,” General Clay said.\n’’The stopped-up transmitter, made possible by the millions of Americans who sup¬\nported the 1951 Crusade for Freedom, now has sufficient power to saturate all of\nHungary with messages of freedom and hope. It marks the first tangible results of\nthe 1951 Crusade drive, which promised an intensification of the Cold War against\nthe Kremlin in the Iron Curtain countries.”\nThe new 50,000-watt Radio Free Europe transmitter broadcast almost a full day of\nChristmas programs to Hungary. The programs included carols, religious music, drama,\nnews and commentary by Hungarian exiles about Christmas—all forbidden by the Com¬\nmunist rules who have launched an all-out campaign to liquidate the keeping of\nChristmas.\n’’The Communists have gone as far as to announce that Stalin’s birthday must be sub¬\nstituted for Christmas,” Clay said. \"They have banned Christmas cards and trees"
}