{
  "id": "d1813-9",
  "text": "-10-\nbecause these traditions are contrary to the materialistic Communist ideology—\nwhich destroys human freedom, dignity and individualism in favor of complete sub¬\nservience to the regime.”\nThe $0,000-watt transmitter directed at Hungary, which broadcasts at least twelve\nhours a day, seven days a week, is following the successful pattern of hard-hitting\npsychological warfare against the Kremlin waged by Radio Free Europe’s Munich sta¬\ntion (to Czechoslovakia), made possible by the American people through their support\nof the Crusade for Freedom. The writers and broadcasters of programs are democratic\nHungarian exiles who speak to their enslaved compatriots in their own idiom.\nBRITISH SCHOOLS PLAN VIDEO EDUCATION\nPlans are now being made by the BBC for education by television for a group of\nschools in Kent, Southern England. The first '’pilot'1 program is expected to go out\nfor a four-week period during next summer, so it is reported by the British Informa¬\ntion Service.\nBy the .fall of 19$2, a large number of Britain’s schools will be able to take the\ntelevised educational programs. It is estimated that by that time 80 per cent of\nthe population will be within television range. There are more than 6,000,000\nschool children in Britain, so it is possible that more than I;,000,000 children will\nhave a chance of video education, by next fall.\nThe schools chosen for the experiment are comparable to American high schools. Each\nwill receive, from 3:00-3:30 p.m. daily for a five day week, a program of instruc¬\ntion either prepared in a EEC television studio or directly televised from some out¬\nside scene. The subjects these programs will cover are listed as travel, science,\ncurrent affairs, aesthetics and industry.\nIn this small-scale test the entire costs will be borne by the British Broadcasting\nCorporation, but by the time the national test takes place - in the late autumn of\nnext year - the schools will be expected to provide their own receivers.\nCHICAGO SCHOOL BROADCAST AWARD TO DUNHAM\nFranklin Dunham, Chief of Radio and Television, United States Office of Education,\nwas presented the School Broadcast Conference annual Award of Merit for outstanding\nservice to educational radio.\nThe award made at the annual luncheon of the Conference on December £ was voted by\nthe Advisory and Executive Committees, a group of sixty nationally known educators\nand radio executives. The presentation was made by Miss Judith Waller, public af¬\nfairs and education director for the National Broadcasting Company in Chicago.\nFor many years Dunham was Educational Director for the National Broadcasting Company\nin New York; during the war he was special consultant to the Secretary of War and\nserved as a staff member of the joint army and navy Committee of Welfare and Recrea¬\ntion. He established the GI radio system, the Star-Spangled Network, in which\nqualified men in the service were encouraged to develop their own radio programs.\nIn 19h5 he was made Chief of Radio in the United States Office of Education, and\nsince that time has been instrumental in establishing radio stations in schools and\ncolleges throughout the country. More recently he has devoted considerable time to\nthe problems of television in education."
}