{
  "id": "d894-1",
  "text": "r\n- 2 -\nnesses and statements brought fortfc for the Commission's consideration,\narguments on every side of both of the questions involved in the hearing.\nBecause of the importance of the issues o-onsidered in the hearing, and \"be¬\ncause of the possible confusion which may have existed in the past concern¬\ning, the policies applicable to the matters which were the subject of the\nhearing, we have deemed it advisable to set forth in detail and at some\nength our conclusions as to the basic considerations relevant to the ex¬\npression of editorial opinion by broadcast licensees and the relationship\nof any such expression to the general obligations of broadcast licensees\nwith respect to the presentation of programs involving controversial issues.\n3. In approaching the issues upon which this proceeding has been\nheld, we believe that the paramount and controlling consideration is the\nrelationship between the American system of broadcasting carried on through\na large number of private licensees upon whom devolves the respon¬\nsibility^ or the selection and presentation of program material)' and the\nCongressional mandate that ibis licensee responsibility is to be exer¬\ncised in the interests of, and as a.trustee for the public at .large which\nretains ultimate control over the channels of radio and television com¬\nmunications, One important aspect of this relationship, we believe., re¬\nsults from the fact that the needs and interests of the general public v/ith\nrespect to prpgrams devoted to news commentary and opinion can only be satis¬\nfied by making available to them for their consideration and acceptance or\nrejection, of varying and conflicting views hold by responsible elements of\nthe community,^ And it is in the light of these basic concepts that the pro¬\nblems of insuring fairness in the presentation of news and opinion and the\nplace in such a picture of any expression of the views of the station licensee\nas such must be considered,\n4. * It is apparent that our’ system of oroadcasting, under which\"pri¬\nvate persons and organizations are licensed to provide broadcasting service\nto the various communities and regions, imposes\\ ros'fipnsJU -■\nbility in the selection and presentation of radio program material upon such\nlicensees. Congress has recognized that the requests for radio time may\nfar exceed the amount of time reasonably available for distribution by broad¬\ncasters^ It provided, therefore, in Section 3(h) of the Communications Act\nthat^a person engaged in radio broadcasting shall not be deemed a common\ncarrier. It is the licensee, therefore, who must'determine what percentage\nof the limited broadcast day should appropriately be devoted to news and\ndiscussion or consideration of public issues., rather than to the other legiti¬\nmate services of radio broadcasting, and who must select or be respnnsible\nfor the selection, of the particular news items to be reported or the partic¬\nular local, state, national or international issues.or questions of public\ninterest to be considered, as well as the person or persons to comment or\nanalyze the news or to discuss or debate the issues chosen as topics for\nradio consideration, \"The life of each community involves a multitude of\ninterests some dominant and all pervasive such as interest in uublic affairs,\neducation and similar matters and some highly specialized and limited to\nfew. The practical day-to-day problem with which every licensee is faced\nis one of striking a balance between these various interests to reflect\nthem in ^a program service which is useful to the community, and which will\nin some way fulfil the needs and .interests of the many.\" Capital Broad-"
}