{
  "id": "d894-10",
  "text": "- XI -\nHor.thern,Corporation (W1IEX) . • 4 Pike & Fischer, S.R. 333, 339* Of course,\nsome cases will he- clearer than others, and the Commission in the exercise\nof its functions may be called upon to weigh conflicting evidence to deter¬\nmine whether the licensee has or has not made re<osonable efforts to present\na fair and well-rounded presentation of p,&iticular public issues* But the\nstandard of reasonableness and the reasonable approximation of a statutory\nnorm is not an arbitrary standard incapable of administrative or judicial\ndetermination, but, on the contrary, one of the basic standards of conduct\nin .numerous fields of Anglo-American law* Like all other flexible standards\nof conduct, it is subject to abuse and arbitrary interpretation and-appli¬\ncation by the duly authorized reviewing authorities. But the possibility\nthat a legitimate standard of legal conduct might be abused or arbitrarily\napplied by capricious governmental authority is not and cannot be areason\nfor abandoning the standard itself* £nd broadcast licensees are protected\nagainst any ‘conceivable abuse of power by the Commission in the exercising\nof its licensing authority by the procedural, safeguards of the Communications\nAct and the -Administrative Procedure Act, and bythe right of appeal to the\nCourts from final action claimed to be arbitrary-or capricious.\n19#There remains for consideration the allegation made by a few of\nthe witnesses in the hearing that any action by the Commission in this field\nenforcing a basic standard of fairness upon broadcast licensees necessarily\nconstitutes an nabridgement of the right of free speech1’ in violation of\nthe First Amendment of the United States Constitution* We can see no sound\nbasis for any such conclusion. The freedom of speech protected against\ngovernmental abridgement by the First Amendment does not extend any privilege\nto government licensees of means of public communications to exclude the\nexpression. df opinions and ideas with which they a.re in disagreement* We\nbelieve, on the contrary, that a requirement that broadcast licensees utilize\ntheir franchises in a manner in which, the lis tening nubile may be assured\nof hearing varying opinions on the paramount issues facing the American\npeople is within both .the spirit and letter of the First Amendment* As\nthe Supreme Court of the United States has pointed out in the Associa.tSd\nPress monopoly case:\nwIt would.be strange indeed, however, if the grave\nconcern for freedom of the press which prompted\nadoption of the First Amendment should be read as\na command that the.government was without power to\nprotect that freedom.. .That Amendment- rests on the\nassumption, that the widest -possible dissemination of\ninformation from diverse and antagonistic sources is\nessential to-.the welfare of the -public, that .a free\npress is a condition of free society, purely a\nCommand that the government itself shall not impede\nthe free.flow of ideas 'does not afford non-govern¬\nmental combinations a refuge if.they impose restraints\nupon that constitutionally -guaranteed freedom. Free¬\ndom to publish means freedom for all and not for some.\nFreedom to publish is guaranteed by the Constitution*\nbut freedom to combine to keep others from publishing\nis not*” (Associated Press v. United States. 326 U.S*\n1 at p* 20*)"
}