{
  "id": "d894-11",
  "text": "♦ -12-\n20. We fully recognise that freedom of the radio is included\namong the freedoms protected against governmental abridgement by the First\nAmendment*, United. States v« Paramount Pictures* Inc*, et al,33A U.S^I3I«i66.\nBut this does' not mean' that ’the freedom' of the' people as a whole to enjoy\nthe. maximum possible utilisation, of this medium of mass communication may\nbe .subordinated to the freedom of any single person to exploit the medium\nfor his own private interest. Indeed, it seems indisputable that full\neffect can only be given to the concept of freedom of speech on the radio\nby giving precedence, to the right of the American public, to be informed on\nall sides.of public questions over any’such individual exploitation for\nprivate purposes* Any regulation of radio, especially a system of limited\nlicensees,, is in a real sense an abridgement of the inherent freedom of\npersons ..to .express themselves by means of radio communications* It Is, how¬\never, a necessary and constitutional abridgement in order to prevent chaotic\ninterference from destroying the great potential of this medium for public\nenlightment and entertainment. National Broadcasting Company v* United\nStates, 319 U* S* 190, 296; cf; Federal Radio Commission v. Nelson-Brothers\nBond & Mortgage Co*. 289 U.« S*.266; FisherTs Blend Station. Ihc* v. State\nTax Commission, 277 U,S. 650. .Nothing in the Communications Act or its\nhistory supports any cpnclusion that,the people of the nation, ^acting through\nCongress, have intended to surrender or diminish their .paramount rights in\nthe air waves, including access to radio broadcasting facilities to a limited\nnumber of private licensees .to be used as such licensees see fit, without\nregard to the paramount interests of the people.. The most significant\nmeaning;of freedom of the radio is the right.of the American people to\nlisten to this, great; medium of communications free from .any governmental\ndictation as to what they can or.cannot hear, and free.alike from similar\nrestraints by private licensees, • .\n21. To recapitulate, the Commission believes that'under the\nAmerican system of broadcasting the individual licensees' of radio stations\nhave the responsibility for determining the specific program material to be\nbroadcast over their stations *r. This choice,' however.,. must be exercised in\na manner consistent with the.basic -policy of the Congress that ra£io be\nmaintained as a medium of free’ speech for the general public as a whole\nrather than as an outlet for the purely, personal or. private, .interests of\nthe licensee. This requires' .that’ licensees devote a. reasonable percentage\nof their broadcasting time to the discussion of public issues of interest\nin the community served by .thuir stations and that such programs be designed\nso that the public has a. reasonable, opportunity to hear different, oppos¬\ning positions on the public issues of interest and importance in'the com¬\nmunity* The particular format best suited for the presentation .df such\nprograms in.' a. manner consistent with the public interest must be determined\nby the licensee in the ‘light pil.the. facts of each individual situation*\nSuch presentation may :include :the:.identified, expression of the' licensee1s\npersonal viewpoint •‘•as part of the •more general presentation of views or\ncomments on the various issues, but the opportunity of licensees to"
}