{
  "id": "d894-111",
  "text": "any such practice, even though most responsible sta¬\ntions would take care to present all sides of a public\ncontroversy.\n“No public authority,” he said “should place restric¬\ntions on the freedom of expression of opinion over the\nradio.”\nJohn Dwight Sullivan, counsel for the Advertising\nFederation of America, speaking for 987 firms in the\nadvertising, broadcasting and publishing fields, rested\nhis case on the First Amendment. “A fundamental\nand constitutional principle is involved,” he said, add¬\ning that barring a station or network from statement\nof its views violates the free-speech amendment to the\nConstitution, as well as the law which created the\nFCC itself.\nJohn W. Studebaker, U. S. Commissioner of Edu¬\ncation, and Eric Johnston, president of the Motion\nPicture Association of America, backed the industry’s\nplea for the right to editorialize.\nIn a statement read into the record, Dr. Studebaker\nargued that the right to express its own opinions\nwould better enable stations to present all sides of\nimportant questions “fairly, objectively, and without\nbias.”\n“So long as free competition of differing points of\nview for acceptance in the market place of ideas is\nmaintained, why should the licensee himself be denied\nopportunity to compete?” asked the Education Com¬\nmissioner.\nMr. Johnston, whose testimony was also presented\nin written form, argued “very strongly” against\nabridgement “in the exercise of free speech guaranteed\nby the Constitution.” He said that “no instrument of\nexpression . . . should be restricted, openly or in¬\ndirectly.”\nThe Reverend Carly Mclntire, secretary of the\nAmerican Council on Christian Churches, favored the\nright to editorialize because: “It is the public interest\nthat the people of the community know where radio\nstations stand, just as the public knows today where\nnewspapers stand on various issues and problems,”\nand “radio should be as free as the press in every\nparticular.”\nAgainst Editorial Right. Testifying in favor of the\nban on editorials last week were James Lawrence Fly,\nformer FCC chairman of the time of the “Mayflower”\nrule, now in private law practice and counsel for the\nCivil Liberties Union; the CIO; Saul Carson, radio\neditor of the New Republic, AFL broadcasting unions,\nand National Farmers Union.\nMr. Fly contended that the air belongs to the people,\nand that the public interest is best served by free\nspeech that allows all sides of a controversy to be\nheard, but no expression of opinion by broadcasters\nthemselves. He said that radio cannot be compared\nwith the press because radio frequencies are limited,\nand because those who disagree with the broadcaster\nhave no ready access to a microphone.\nThe CIO contended that radio is “big business, de¬\npendent on advertising,” and would thus reflect a com¬\nmercial point of view if allowed to editorialize. Joseph\nA. Beirne, president of the Communications Workers\nof America, added that the rule should be kept in force\nand enforced more rigidly.\nAdvance “Freedom Train” Schedule\nThe Freedom Train today is completing a week\nof general overhaul in the shops of the Atchison,\nTopeka & Santa Fe Railway System. The train\nwill resume its itinerary tomorrow at Riverside,\nCalif.\nFollowing is the\nweek of March 22:\nschedule of the train for the\nMonday (22)\nServicing day, Reno, Nev.\nTuesday (23)\nElko, Nev.\nWednesday (24)\nSalt Lake City, Utah\nThursday (25)\nProvo, Utah\nFriday (26)\nOgden, Utah\nSaturday (27)\nPocatello, Idaho\nSunday (28)\nServicing day, Pocatello\nMr. Carson suggested a “complaint bureau” in the\nFCC, to hear people who believe they have been injured\nby broadcasts, and FCC Chairman Wayne Coy said he\nwas “interested in that proposal.” Mr. Carson added\nthat editorials on the air would lead to the “destruction\nof every regulatory power vested in the FCC.”\nOliver Nicoll, acting chairman of the Association\nof Broadcast Unions and Guilds, told the Commission:\n“We are unanimous and firm in our stand to ask for\ncontinuation of the FCC’s justified ‘Mayflower Rule’\nand we oppose any reversal of any phases of this de¬\ncision.”\nAFRA Secretary George Heller and NABET Presi¬\ndent J. R. McDonnell agreed with Nicoll.\nFor Editorials, But. Various shades of opinion on\nthe controversial subject of editorializing were ex¬\npressed by the remaining witnesses, including Nathan\nStraus, president of WMCA, New York; Morris Ernst,\nNew York attorney and author of The First Freedom;\nStanley Faulkner, counsel for the Voice of Freedom\nCommittee, whose sponsors include Orson Welles, Dor¬\nothy Parker, Rockwell Kent, Paul Robeson and Ed¬\nward G. Robinson; and Robert E. Cushman, operator\nof Cornell University’s station, WHCU.\nMr. Straus said that stations should be allowed to\nair editorials, but limited to 15 minutes a day and re¬\nquired to give like time to opposing views. He told\nthe Commission that his own station has broadcast\ndramatic programs expressing opinions on such con¬\ntroversial issues as minority rights and housing, sug¬\ngesting that listeners write to the mayor and demand\naction.\n“The beliefs, the hobbies, the prejudices of one man\nor one small group constitute the daily newspaper diet\nin 90 per cent of the communities of the United States,”\nMr. Straus said. “Here is an opportunity to give the\npeople of one-newspaper cities a chance to hear a\nvariety of editorial opinion.”\nMr. Ernst agreed in part with Mr. Straus, that edi¬\ntorials should be permitted only on locally-owned sta¬\ntions, but disagreed on the other point, holding that\nwhere a station is a town’s ony radio outlet, no edi¬\ntorials should be permitted. He added that a news-\n(Continued on next page)\nMARCH 8, 1948-181"
}