{
  "id": "d894-112",
  "text": "paper owner who also owns a radio station should not\nbe allowed to editorialize, and that stations expressing\ntheir own opinions should be required to give opposi¬\ntion views time on forums.\nMr. Faulkner’s testimony was devoted to a de¬\nnunciation of what he described as “the great monopoly\ninterest” that controls radio, and the “lords of monop¬\noly” which have “caused American homes to be invaded\nwith hysteria, international hate, and distrust which\ncan only sow the seeds of another war.”\nMr. Cushman told the FCC that the “Mayflower”\nrule “sharply restricts the scope and value” of the pub¬\nlic service a station can render, but he favored prohibi¬\ntion of editorials on political candidates and issues.\nHe said that stations should be free to voice opinions\non matters of public welfare or local community in¬\nterests.\nPresident Earl McGill of the Radio Director’s Guild\nsaid he subscribed to the belief that there is no reason\nwhy a station owner should not air his own views so\nlong as FCC guaranteed full opportunity to the oppo¬\nsition for rebuttal.\nM. S. Novik, executive secretary of the National\nAssociation of Educational Broadcasters, urged the\nCommission to “spell out” what it meant by “public\ninterest, convenience and necessity.”\nA long list of additional witnesses will be heard\nwhen the hearing resumes in April.\nNews Media Representatives Meet to Talk\nSecurity Policy with Defense Secretary\nMeeting with Secretary of Defense James Forrestal\nlast Wednesday (3), 22 news media representatives,\nincluding NAB President Justin Miller, formed a com¬\nmittee of eight members who will study Mr. Forrestal’s\nrequest for assistance in forming security policies and\nreport its findings to the full committee within 30 days.\nThe problem, as outlined by Secretary Forrestal at\nWednesday’s conference, “is to prevent information\nwhich might endanger the United States from being\ngiven to a potential enemy.” While assuming that\nnews media and the armed forces would agree on “the\nimportance of safeguarding highly classified informa¬\ntion of our vital military projects,” he acknowledged\nthat there would be differences as to method and\nasked the group’s “advice, assistance and guidance.”\nEmphasizing that “we do not have many military\nsecrets,” the Secretary of Defense told the news men:\n“Our lead over possible enemies is often a matter of\nonly a few months on the technical side, and it is'ex¬\ntremely dangerous to sacrifice that advantage by show¬\ning our hand.”\nThe Secretary said he was confident that the average\nAmerican would not complain at being denied infor¬\nmation if he understood that its disclosure would en¬\ndanger his safety.\n“The question as to how far we can go in keeping\nthe American public uninformed about technical prog¬\nress in order to safeguard our real ‘secrets’ is a diffi¬\ncult one,” the Secretary said.\nMr. Forrestal’s plan for attacking the problem called\nfor:\nIf Creation of a six-man “Security Advisory Coun¬\ncil,” composed entirely of civilians representing news\nmedia, which would advise the armed forces “in regard\nto security matters in general.”\nIf Establishment by the armed forces in Washington\nof an Information Advisory Unit which would operate\naround-the-clock “to answer inquiries on security sub¬\njects and offer guidance to the news media.”\nTrial Period Suggested. Under Mr. Forrestal’s pro¬\nposal, the Information Advisory Unit would function\naccording to rules drafted by the Advisory Council,\nwould be staffed largely by civilians with news ex¬\nperience, and be headed by a member of the committee\nwhich met last week. He recommended that the In¬\nformation Unit be established on a six months trial\nbasis “to be abandoned at any time by decision of the\nSecurity Advisory Council.”\nThe committee of eight, which will study the sug¬\ngestion, is composed of B. J. McKelway, editor of the\nWashington Star and representative of the American\nSociety of Newspaper Editors (who was elected chair¬\nman of the full group and ex-officio chairman of this\ncommittee) ; Judge Miller, Lyle C. Wilson, chief of\nthe UP’s Washington office; Reiman Morin, AP Wash¬\nington Bureau chief; William Chenery, publisher of\nCollier’s and chairman of the National Association of\nMagazine Publishers’ Editorial Committee; Perry\nGithens, editor of Popular Science Monthly and repre¬\nsentative of scientific and technical magazines; Walton\nC. Ament, vice president and general manager, Warner\nPathe News, representing all newsreels; and Gene\nDawson, president of Aviation Writers Association.\nIn addition to Mr. Forrestal, the group heard dis¬\ncussion of the problem from the military standpoint\nby General Omar N. Bradley, chief of staff; Admiral\nLouis E. Denfeld, chief of naval operations; General\nCarl Spaatz, chief of staff, Air Force; and Major Gen¬\neral Alfred M. Gruenther, director of the Joint Staff.\n1948 NAB Convention Plans Crystallize\nThe unusually large number of inquiries received\nat NAB Headquarters indicates widespread interest\nthroughout the industry in the forthcoming 26th An¬\nnual Convention to be held in Los Angeles, May 16\nthrough 21.\nAt its recent meeting the Board of Directors named\na special Board Sub-Committee on Convention Pro¬\ngrams, made up of Howard Lane, WJJD, as chairman;\nHarold Fellows, WEEI; T. A. M. Craven, WOL; Rob¬\nert T. Mason, WMRN; William B. Smullin, KIEM;\nWilliam B. Way, KVOO.\nOn Wednesday (3) three of the members of this\ncommittee, Messrs. Lane, Fellows and Craven, met with\nPresident Justin Miller, Executive Vice President A.\nD. Willard, Jr., and Secretary-Treasurer C. E. Arney,\nJr., in Washington and set up the tentative program\nfor the Management Conference.\nIn line with the policy previously announced, the\nConference will be programmed at the management\nlevel. While sales, program, production and other per¬\nsonnel will be welcome to attend, it is felt that they\nwill derive a great deal more value from attendance\nat the District meetings which are scheduled to be\nheld beginning in late July and running through to\nabout the middle of October.\n(Continued, on next page)\nMARCH 8, 1948-182"
}