{
  "id": "d894-114",
  "text": "forms for filing with the Commission. The Commit¬\ntee is concerned only with “procedural” matters and\nnot with “policy” matters, according to its charter\nfrom the Advisory Council. On this basis the Com¬\nmittee has no authority to inquire into such matters,\nfor example, as to whether or not the FCC may collect\nany information as to program content. Instead its\nconsideration is confined to the kind of information\nwhich could be assembled without undue burden and\nwhich would be meaningful.\nAddress for Comment. Any licensee or other appli¬\ncant who has had any trouble in preparing his appli¬\ncation form is invited to communicate his experience\nto Russell Schneider, executive secretary, Advisory\nCouncil on Federal Reports, 1615 H Street, N. W.,\nWashington 6, D. C.\nThe Advisory Council is composed of a group of\nbusiness men who are sponsored by seven large na¬\ntional business organizations. It was organized five\nyears ago on the invitation of the Director of the\nBureau of the Budget.\nThe forms about which comment is invited are:\ntion to the industry to make itself heard is not to\nagitate friction or discord but instead to improve the\npaperwork and the procedures.”\nMr. Schneider added that this Committee repre- V\nsenting the radio broadcasting industry has an enviable\nrecord of achievement and has so conducted its affairs\nas to have the fullest cooperation from both the Bureau\nof the Budget and the Federal Communications Com¬\nmission.\nMembers of the Committee are, in addition to Mr.\nStrouse: C. T. Lucy, WRVA; Merle Jones, WCCO;\nJames H. Neu, CBS-WTOP; Carl J. Burkland, CBS;\nRichard C. Steele, WTAG; Gus Margraf, NBC-WRC;\nCarleton D. Smith, NBC; Charles Barham, Jr., WCHV;\nKenneth Berkeley, WMAL; H. J. Brennan, WJAS;\nJohn Elmer, WCBM; Herbert L. Pettey, WHN, and\nT. A. M. Craven, WOL.\nC. E. Arney, Jr., NAB secretary-treasurer, is the\nCommittee’s secretary and Kenneth H. Baker, Director\nof Research for NAB, is assistant secretary to the\nCommittee. The representative of the Bureau of the\nBudget who is liaison to the Committee is Mr. David\nE. Cohn.\nForm 301—Application for authority to construct\na new Broadcast Station or make changes in an exist¬\ning station.\nForm 302—Application for new Broadcast Station\nLicense.\nForm 303—Application for Renewal of Broadcast\nStation License.\nForm 30k—Application for Modification of an exist¬\ning Broadcast Station License.\nForm 31b—Application for consent to assignment of\nRadio Broadcast Station Construction Permit Li¬\ncense.\nThese forms in a number of cases include several\nsections used interchangeably. Among these are\nLegal Qualifications of Broadcast Applicant, Financial\nQualifications of Broadcast Applicant, Statement of\nProgram Service of Broadcast Applicant, Standard\n(or FM or television) Broadcast Engineering Data,\nand Antenna and Site Information.\nThese forms were made the subject of an intensive\nstudy by the Committee during 1947 and extensive\nrevisions were made by the FCC. At the present\ntime the Committee’s project is an equally extensive\nstudy of FCC form No. 324, “Annual Financial Re¬\nport of Networks to Licensees of Broadcast Stations.”\nAny comment which licensees have concerning this\nform would also be considered by the Committee and\nshould likewise be sent to Mr. Schneider. At its recent\nmeeting the Committee gave consideration to the de¬\nsirability of recommendation to the Bureau of the\nBudget that the Commission amend its rules to permit\nfiling of form No. 324 on a fiscal year basis. Final\ndecision in this matter has been withheld pending the\nreceipt of comment from the industry.\nChance to Be Vocal. “This is an opportunity” Mr.\nSchneider said, “for all radio broadcasters to become\nvocal with respect to any criticisms they may have of\nthe existing FCC forms, to the extent that these forms\nmay be burdensome or otherwise subject to improve¬\nment. The primary object of the Committee’s invita-\nNAB President Receives Advertising\nAward for Distinguished Service\n“For his distinguished services to radio,” NAB\nPresident Justin Miller was presented Friday (5)\nwith a bronze medal which is given annually by the\nAnnual Advertising Awards to the firm or person “who\nby contemporary services has added to the knowledge\nor techniques of radio advertising.”\nThe award, one of four given in the radio and tele¬\nvision field, was presented at a dinner Friday evening\nat New York’s Waldorf Astoria. Other awards went\nto David Sarnoff, Chairman of the NBC Board, who\nwas cited as the person who, during the past year,\n“contributed most to television as a service to the\npublic and as a medium of advertising,” and to two\nnetwork programs.\nThe programs were “Theater Guild on the Air”\nsponsored on ABC by U. S. Steel, and handled by\nBBDO, for “outstanding skill in commercial produc¬\ntion,” and “Fibber McGee and Molly,” sponsored on\nNBC by S. C. Johnson & Son, Inc., and handled by\nNeedhan, Louis, and Brorby, Inc., Chicago, for con¬\ntributing most “to radio advertising as a social force.”\nCitations are made in various advertising media by\nAnnual Advertising Awards, an undertaking which\nbegan in 1924 and is currently sponsored by Adver¬\ntising and Selling magazine.\nPat Griffith Joins NAB Washington Staff\nTo Coordinate Women’s Activities\nMiss Pat Griffith, formerly director of information\nin the Washington bureau of the Manila Evening News,\nhas joined the NAB staff as director of women’s ac¬\ntivities.\nMiss Griffith’s work will include coordination of the\nactivities of the Association of Women Broadcasters\nwith its parent organization, the NAB. Her office will\n(Continued on next page)\nMARCH 8, 1948-184"
}