{
  "id": "d894-128",
  "text": "WLAW-FM—Hildreth & Rogers Co., Lawrence—Modifica¬\ntion of construction permit (Bl-PH-153, as modified, which\nauthorized a new FM broadcast station), to make changes\nin antenna system and change commencement and comple¬\ntion dates.\nWHAV-FM—The Haverhill Gazette Co., Haverhill—Modi¬\nfication of construction permit (Bl-PH-478, as modified)\nwhich authorized a new FM broadcast station, for extension\nof completion date.\nMichigan\nWFRS—The Grand Rapids Broadcasting Corp., Grand\nRapids—Modification of construction permit (B2-PH-508,\nas modified) which authorized a new FM broadcast station\nfor extension of completion date.\nWLAV-FM—Leonard A. Versluis, Grand Rapids—Modifi¬\ncation of construction permit (B2-PH-264, as modified)\nwhich authorized a new FM broadcast station, to change\ntransmitter location, ERP from 54 KW to 57.6 KW; antenna\nheight above average terrain and make changes in antenna\nsystem.\nMissouri\nKSD-FM—The Pulitzer Publishing Co., St. Louis—Modi¬\nfication of construction permit (B4-PH-30, as modified)\nwhich authorized a new FM broadcast station for extension\nof completion date.\nNebraska\nKFAB-FM—KFAB Broadcasting Co., Lincoln—Modifica¬\ntion of construction permit (B4-PH-601, as modified) which\nauthorized a new FM broadcast station to change ERP to\n11.8 KW, antenna height above average terrain to 258 feet,\nmake changes in antenna system and change commencement\nand completion dates.\nKOAD—World Publishing Co., Omaha—Modification of\nconstruction permit (B4-PH-140, as modified) which author¬\nized a new FM broadcast station for extension of completion\ndate.\nNevada\nKWRN-FM—Reno Newspapers, Inc., Reno—Modification\nof construction permit (B5-PH-376, as modified) which au¬\nthorized a new FM broadcast station, for extension of com¬\npletion date.\nNew Hampshire\nWMUR-FM—The Radio Voice of New Hampshire, Inc.,\nManchester—Modification of construction permit (Bl-PH-\n793) which authorized a new FM broadcast station for ex¬\ntension of completion date.\nNew York\nWRPA—Radio Projects, Inc., Syracuse—Modification of\nconstruction permit (Bl-PH-645, as modified) which author¬\nized a new FM broadcast station, for extension of comple¬\ntion date.\nNorth Carolina\nWLOS-FM—Skyway Broadcasting Corp., Asheville—Modi¬\nfication of construction permit (B3-PH-971, as modified)\nwhich authorized a new FM bi'oadcast station to change ERP\nto 9.3 KW and antenna height above average terrain to 128\nfeet.\nOregon\nKGPO—Southern Oregon Broadcasting Co., Grants Pass—\nModification of construction permit (B5-PH-825, as modi¬\nfied) which authorized a new FM broadcast station, for\nextension of completion date.\nKMED-FM—Mrs. W. J. Virgin, Medford—Modification of\nconstruction permit (B5-PH-336, as modified) which author¬\nized a new FM broadcast station, for extension of comple¬\ntion date.\nPennsylvania\nKQV-FM—Allegheny Broadcasting Corp., Pittsburgh—\nModification of construction permit (B2-PH-556, as modified)\nwhich authorized a new FM broadcast station for exten¬\nsion of completion date.\nWKST-FM—WKST, Inc., New Castle—Modification of con¬\nstruction permit (B2-PH-805, as modified) which authorized\na new FM broadcast station to change type transmitter\nand antenna height above average terrain to 342 feet, ERP\nto 3.05 KW.\nWIBG-FM—Seaboard Radio Broadcasting Corp., Phila¬\ndelphia—Modification of construction permit (B2-PH-81, as\nmodified) which authorized a new FM broadcast station,\nfor extension of completion date.\nWPIT-FM—WPIT, Inc., Pittsburgh—Modification of con¬\nstruction permit (B2-PH-582, as modified) which authorized\na new FM broadcast station, for extension of completion\ndate.\nWJKT—WJAC, Inc., Johnstown—Modification of con¬\nstruction permit (B2-PH-313, as modified) which authorized\na new FM broadcast station, for extension of completion\ndate.\nRhode Island\nYVPRO-FM—Cherry & Webb Broadcasting Co., Providence\n—Modification of construction permit (Bl-PH-84, as modi¬\nfied) which authorized a new FM broadcast station to\nChange type of transmitter and make changes in antenna\nsystem, change ERP from 20 KW to 30 KW.\nInter-City Broadcasting Co., Providence—Construction\npermit for a new FM broadcast station. (Class B) to be\noperated on frequency to be assigned by FCC, ERP of 16.4\nKW. AMENDED to change transmitter site from approxi¬\nmately .1 mile NW of city limits, Providence, R. I., to Pine\nSt., Rehoboth, Mass.; frequency from: “to be assigned by\nFCC,” to Channel #260, 99.9 me., and make changes in an¬\ntenna system.\nTennessee\nWSIX-FM—WSIX Broadcasting Station, Nashville (Jack\nM. Draughon & Louis R. Draughon)—Modification of con¬\nstruction permit (B3-PH-474, as modified) which authorized\na new FM broadcast station to change ERP from 65 KW\nto 71 KW and make change in antenna system.\nWSM-FM—WSM, Inc., Nashville—Modification of con¬\nstruction permit (B3-PH-965, as modified) which authorized\na new FM broadcast station, for extension of completion\ndate.\nWVUN—Unity Broadcasting Corp. of Tennessee, Chatta¬\nnooga—Modification of construction permit (B3-PH-776, as\nmodified), which authorized a new FM broadcast station for\nextension of completion date.\nTexas\nKRIC-FM—KRIC, Inc., Beaumont—Modification of con¬\nstruction permit (B3-PH-148, as modified), which authorized\na new FM broadcast station for extension of completion date.\nP KMHB—Mary Hardin-Baylor College, Belton—ModiSca^l\ntion of construction permit (B3-PH-1033, as modified), which j\nauthorized a new FM broadcast station to change type of 1\ntransmitter, ERP from 2.9 KW to 12.0 KW, antenna height l\nabove average terrain to 317 feet and make changes in an- \\\ntenna system. __1\n—-HTEM-FM—Bell Broadcasting Co., Inc., Temple—Modifi¬\ncation of construction permit (B3-PH-594, as modified),\nwhich authorized a new FM broadcast station to change\ntype transmitter, ERP from 7 KW to 1.9 KW and change\ncommencement and completion dates.\nVirginia\nWLON—Hoyle Barton Long, Front Royal—Modification\nof construction permit (B2-PH-1128) which authorized a new\nFM broadcast station for extension.\nWLPM-FM—Suffolk Broadcasting Corp., Suffolk—Modifi¬\ncation of construction permit (B2-PH-969, as modified),\nwhich authorized a new FM broadcast station for extension\nof completion date.\nWest Virginia\nWLOG-FM—Clarence H. Frey and Robert O. Greever,\nLogan—Modification of construction permit (B2-PH-814, as\nmodified) which authorized a new FM broadcast station for\nextension of completion date.\n(Continued on next page) ^\nMARCH 8, 1948 —198"
}