{
  "id": "d894-143",
  "text": "106 EDUCATION ON THE AIR\nthemselves as common carriers of public discussion. By this\nthe Commission does not suggest that they should be subject\nto the legal obligations of common carriers, such as compulsory\nreception of all applicants for space, regulation of rates, etc.\nThe press and radio cannot and should not be expected to give\nspace for everybody’s ideas.” But, the major units should\nassume the duty of publishing objective, impartial news, and\nsignificant ideas contrary to their own. Their control over the\nvarious ways of reaching the ear of America is such that if they\ndo not present ideas which differ from their own, those ideas\nwill not reach the ears of the mass of Americans.\nMore specialized media of advocacy have a continuing and\nvital place. They should be plainly labelled as such. But\nespecially we need the general mass medium which, although\nit may present its own views as editorial comment, has as its\nmain function setting forth all views held by considerable num¬\nbers and reaching across all groups in the community. This\nis especially so because of the tendency in our large-scale,\nurbanized society for each group to remain insulated from\nothers, reinforcing its own unchallenged assumptions by con¬\nversations, leadership, and partisan journals, so that its assump¬\ntions harden into fixed, unchallenged prejudices.\nThus far, the Commission! On the specific question of\nwhether in the field of radio the owner-manager should serve\nas editorial advocate as well as common carrier of news and\ndiscussion the Commission did not declare itself.\nMr. White, in one of his own proposals, did declare him¬\nself. Interpreting the Commission’s general position and apply¬\ning it to the Mayflower decision, he suggested to the FCC that\nit “amend the Mayflower decision to permit broadcasters to\nair their partisan views on condition that they provide equal\ntime for an answer.” Mr. White’s proposal permits the station\nowner to air his partisan views if he wishes, but only on condi¬\ntion that he maintain the form and reality of the station or\nnetwork as a common carrier of news and discussion.\nIt would be logically conceivable, but quite impractical, of\ncourse, to get the result another way. We could consider all\nthe stations serving any one area as together forming a common\ncarrier. But then the FCC would be faced with the infinitely\ndifficult task of licensing the stations in the area according to\nan ideological pattern so as to represent the whole spectrum of\nopinion and group representation. And this system would break"
}