{
  "id": "d894-144",
  "text": "SOCIAL RESPONSIBILITY OF RADIO IO7\ndown completely in smaller places served by only one, two,\nor three stations.\nSo much, as regards FCC policy and the Mayflower deci¬\nsion! Mr. White, in his book, goes further and proposes to the\nstation owners that they “assume a position of vigorous edi¬\ntorial leadership in public affairs.” My own emphasis would\nbe in the opposite direction. I agree that the broadcasters\nshould be free, legally, to become editorial advocates if they\nchoose to do so. And in large cities a few local stations might\nserve a very useful function as radio journals of advocacy. But,\nfor most stations, I think the function of common carrier is\nbest performed by developing the greatest skill, courage, and\nwisdom in exercising the difficult and important function of\numpire and interpreter of controversy. I believe that the\nbroadcasters and FCC here have been on the right track, and\nthat, despite some nostalgic yearnings for the days of Greeley,\nthe great newspapers are moving gradually in the same direc¬\ntion. A comparison of the readership of the newspaper editorial\npage and of the by-line columnists—equivalent of the radio\ncommentators—shows the major trend. It is a trend toward\nacceptance of the common carrier function.\nWhy is it that extensive polls of citizens show, in almost\nevery case, that people trust the reliability of radio news and\ncomment more than they do the newspapers? No one really\nknows the answer. It may be the greater confidence engendered\nby the human voice as compared with cold print. But I venture\nthe opinion that the preference is due partly to the implausi-\nbility, to people of common sense, that the newspaper owner\nwho, on one page, plays the role of zealous partisan, often\nas a political leader, on all the other pages, by some successful\nschizophrenic device of personality, plays the impartial, objec¬\ntive role of umpire and arbiter of news. Much more plausible\nis the radio station or network practice which offers to its cus¬\ntomers a medley of opinion by people whose views are la¬\nbelled as their own, with the station management, itself, stand¬\ning silently in the background as the symbol of tolerance and\nimpartiality.\nI believe that this symbol is worth cultivating, with single\nmind and clear purpose. Partisan advocates are cheap; they\ncan be found on every street corner. But the function of umpir¬\ning, of giving room to the really significant though unpopular\nindividual ideas and the opinions of all considerable groups in"
}