{
  "id": "d894-150",
  "text": "SOCIAL RESPONSIBILITY OF RADIO 113\nand under a Republican Administration the same slanting in the\ndirection of the administration in power would follow as inevi¬\ntably as the day follows the night.\nAll of this is true because radio broadcasters are dependent\nfor their very existence upon securing licenses at the hands of\nthe Federal Government. Broadcaster after broadcaster would\nseek advantages through editorial support of the “powers that\nbe” and attempt to convert that advantage into some reciprocity\nof a favorable nature.\nThe Congress provided in the Radio Act of 1927 and in\nthe Communications Act of 1934 that broadcast stations must\nbe fair and offer equal opportunities to legally qualified candi¬\ndates for public office. That was unnecessary unless the Con¬\ngress was convinced that what I have just stated would be the\nresult if stations were left to do as they pleased and editorially\nfavored one candidate over another.\nMany have overlooked the fundamental proposition that\nthe frequencies or wave lengths on which broadcast stations\noperate do not belong to the licensees of stations, but on the\ncontrary belong to all the people. These frequencies serve as\npipelines into the millions of American homes. One American\ncitizen has the same fundamental right as any other citizen to\nargue in support of his views on any subject. Since it would be\nimpossible for all people to air their views by radio, such rights\nbecome empty, indeed, if a few out of many millions are per¬\nmitted to fill the air with editorials in support of their pet ideas.\nThe fact is that many of those who argue that editorials\nshould be broadcast by radio are erroneously convinced that\nthey possess superior intellect to their fellows, and that they\nmust mount a white horse and lead the community, the state,\nor the nation in the right direction. My personal belief is that\nthose who are most vociferous and clamor loudest for this are\nmuch less capable than the quieter and calmer thinker who has\nnot become inflicted with such a superiority complex that he\nalmost, if he does not, honestly believes that he can lift the\nworld up by his own bootstraps.\nThere are others who would broadcast editorials out of\na deep-seated desire to be dramatic or sensational. Still others\nwho would do the same thing even though they knew in ad¬\nvance they would make trouble for others and get into trouble\nthemselves, but always hoping they would turn out to be\nself-made heroes."
}