{
  "id": "d894-161",
  "text": "ABOUT THE MAYFLOWER CASE\na reprint from\nTHE COMMONWEAL\nJuly 1949 by\nEdward J. “Ted” Heffron\n“FREE AIR OR HOT AIR\n“This is the greatest single victory in behalf of freedom of expression in this\nnation since the Zenger case . . . over a century ago.” So said the president\nof the National Association of Broadcasters in commenting on the June 1 report\nof the Federal Communications Commission entitled, “In the Matter of Edi¬\ntorializing by Broadcast Licensees.”\nThe Board Chairman of one of the major networks referring to the report as a\n“reversal of the Mayflower decision,” hailed it as a “great forward step for\nbroadcasting in this country.”\nDavid Lawrence, on the other hand, referred to the report as “thought control,”\nand said, “Republican and Dixiecrat owners of stations had better learn promptly\nthe new goose step of conformity.”\nWhatever it is, then, this report seems to involve questions of considerable\ninterest to the general public. What is it?\nIn 1939, the Mayflower Broadcasting Corporation asked the Federal Communications\nCommission for the frequency then enjoyed by Boston Station WAAB. It charged\nthat WAAB had not been living up to the statutory condition on which continuance\nof all radio licenses depends -- that is, service of the “public interest, con¬\nvenience, or necessity” -- inasmuch as it had been editorializing in favor of\ncertain political candidates to the exclusion of their opponents.\nThe Communications Commission found the Mayflower Corporation unsuitable\nas licensee of a radio frequency but felt obliged, nevertheless, to take notice of\nits complaint against WAAB, particularly since the station’s license was up for\nrenewal (under the law, radio licenses may not be granted for periods longer\nthan three years, and are then subject to renewal). The matter was under con¬\nsideration until January 16, 1941, when the Commission issued a Decision and\nOrder -- known as the “Mayflower Decision” -- in which it said:\n“. . .A truly free radio cannot be used to advocate the causes of the\nlicensee. It cannot be used to support the candidacies of his friends. It\ncannot be devoted to the support of principles he happens to regard most\nfavorably. In brief, the broadcaster cannot be an advocate.\n“Freedom of speech on the radio must be broad enough to provide full and"
}