{
  "id": "d894-163",
  "text": "This,.was a threat to the till. So the broadcasters launched a violent campaign against\nthe Blue Book, against the Commission, against the “public interest, convenience,\nor necessity” requirements of the Communications Act, The plea? Free speech.\nFof a federal agency to tell a broadcaster how he must broadcast, even in the most\ngeneral terms, was to interfere with his freedom of speech. As the president of the\nNational Association of Broadcasters declared before a Senatorial Committee,\nfree speech would be violated even if the Commission told an eccentric broadcaster\nthat he couldn’t get a renewal if he insisted on playing a record of “The Old Gray\nMare” over and over again, hour after hour, day after day, year after year.\n* * >!< *\nIt was in connection with this anti-Blue Book crusade that the Mayflower case was\nresuscitated. For the Commission to tell a broadcaster he could not air his own\nviews on controversial subjects was clearly to limit his freedom of speech, Even\nto tell him that he could not be unfair and discriminatory in airing controversial\nviews, the broadcaster now said, was to infringe upon his guarantees under the\nFirst Amendment.\nThus the attack upon the Mayflower Decision was simply a part of the larger cam¬\npaign “to make radio as free as the press” -- entirely overlooking the fact that\nthe number of possible newspapers in any given community, and in the country as a\nwhole, is unlimited, and that the press is therefore not a licensed industry. (An\neditor can be as one-sided as he wants, because the other sides always have their\nremedy; i.e., they can start their own papers, just as big and just as widely\ncirculated -- depending, of course, on their means and abilities and on the popular¬\nity of their views, but not depending on governmental restraints imposed by way of\npreferential and exclusive licenses).\nFor purposes of their attack on the Mayflower Decision, and of their radio-as-free-\nas-the-press campaign, it behooved the broadcasters to interpret the Decision\nmost rigorously. They thus centered their fire on the first of the two paragraphs\nin the Decision, ignoring the second.\nThey finally whipped up such a furore over the case that the Commission scheduled\nhearings in March and April of last year. The industry (save for a maverick or two,\nlike Ed Craney) lined up solidly against both of the two possible interpretations\nof the Mayflower Decision. One of their spokesmen expressly insisted that, under\nthe First Amendment, broadcasters must have the right to be unfair in their\neditorializing. This view was implicit in the testimony of nearly all their spokes¬\nmen.\nThis is the background of the Commission’s report of June 1, 1949. What the report\nholds, in substance, is that the original Mayflower rule, as set out in the two\nparagraphs quoted heretofore, is to stand -- only it makes clear that the second\nparagraph is to be underscored as qualifying the first. What it says, is that the\nprogram budget of any station\n“may include the identified expression of the licensee’s personal viewpoint as\npart of the more general presentation of views or comments on . , . various\nissues, but the opportunity of licensees to present such views as they may have\n3"
}