{
  "id": "d894-167",
  "text": "AP 170\n8-Z\\-48\nIF DESIRED)\n(WITH AP 129) '\nWASHINGTON—THE FEDERAL COMMUNICATIONS COMMISSION TODAY\nHEARD ITSELF CALLED \"THE PRINCIPLE ENEMY OF FREE SPEECH NOW OPERATING\nWITHIN THE GOVERNMENT OF THE UNITED STATES.\"\nWASHINGTON TIMES-HERALD COLUMNIST FRANK WALDROP APPLIED THE\nDESCRIPTION IN A# APPEARANCE BEFORE THE COMMISSION TO PROTEST THE\nSEVEN-YEAR-OLD F-C-C BAN AGAINST RADIO STATIONS \"EDITORIALIZING\"\nON PUBLIC QUESTIONS.\"\nWAIDROP ASKED FOR REVOCATION OF THE BAN AND \"A GENERAL CORRECTION\nOF PAST POLICIES\" RELATING TO SUPERVISION OF BROADCASTING.\nWALDROP SAID: \"THE LAW DID MOT APPOINT YOU AMERICA’S NURSEMAID,\nSCHOOL MA’AM OR. CENSOR,\"\nTHE NO-EDITORIALIZING RULE WAS AS STAUNCHLY CHAMPIONED BY NORMAN\nMATTHEWS, CHAIRMAN.OF THE UAW-CIO INTERNATIONAL RADIO\nCOMMITTEE.\nHE SAID THE WORDING OF THE BAN ITSELF—\"A TRULY FREE RADIO\nCANNOT BE USED TO ADVOCATE THE CAUSE OF THE LICENSEE\"—STATED\nTHE CASE FOR RETENTION.\nMATTHEWS CONTENDED THAT BOTH THE LETTER AND SPIRIT* OF THE RULE-\nARE FREQUENTLY VIOLATED BY RADIO STATIONS. HE SAID THAT \"THE\nLICENSING OF BROADCASTERS TO EDITORIALIZE WILL BE A MOVE TOWARD A\nMONOPOLY OF OPINION CHANNELS IN THE COUNTRY.\"\nF-C-C TODAY CONCLUDED A SERIES OF PUBLIC HEARINGS ON THE QUESTION\nOF AMENDING OR REVOKING THE RULE 3\nLOUIS CALDWELL, ATTORNEY FOR WON, THE CHICAGO TRIBUNE STATION,\nDESCRIBED' THE BAN ON A STATION AIRING ITS-OWN OPINONS IN PUBLIC\nCONTROVERSIES AS CLEARLY UNCONSTITUTIONAL.\n\"THIS MATTER OF EDITORIALIZING BY BROADCASTERS IS ONLY A SMALL\nSEGMENT OF A FAR-REACHING AND FUNDAMENTAL PROBLEM, INVOLVING\nOUR PHILOSOPHY OF GOVERNMENT AND A CORNERSTONE OF DEMOCRACY ITSELF,\"\nHE SAID. \"THE PROELEM IS THE CONTROL OF RADIO PROGRAMS BY THE\nGOVERNMENT, NOT JUST THIS PROGRAM OR THAT PROGRAM, BUT PROGRAMS AS\nA WHOLE.\"\nAMONG GROUPS PLACING STATEMENTS IN THE RECORD TODAY IN BEHALF OF\nTHE RULE WERE THE AMERICAN JEWISH COMMITTEE, AMERICAN VETERANS\nCOMMITTEE, AND NATIONAL LAWYERS GUILD.\nDEMANDS FOR REVOCATION WERE ENTERED BY SPOKESMEN FOR THE MOTION\nPICTURE ASSOCIATION OF AMERICA AND NATIONAL ASSOCIATION\nOF BROADCASTERS.\nTA946PES 21"
}