{
  "id": "d894-17",
  "text": "- 3 -\nby licensees. It is therefore reasonable to say that at the time of the commence¬\nment of these proceedings, it was the unimpaired ruling of this Commission that\neditorialization over the facilities of a station by the licensee was contrary\nto the public interest,' I would nov; expressly repudiate any such doctrine and\nexplicitly make clear that to the extent that Hayflower created such.a bandit\nis now overruled. The failure of the majority to discuss I ayflower and to\nrepudiate the ban on editorialization created by Hayflower is under such circum¬\nstances extraordinary, - It may not be without'signifi caric e that the majority\nreport cites the I. ay flower decision with apparent approval. In view of, the\nmajority’s decision I do not see how it can consistently, appear to leave the\neffect of Mayflower unimpaired while at the same time hold that editorializa¬\ntion by licensees is not. contrary to the public interest. The majority report\nin failing to discuss the effect of Mayflower on the’main problem here presented\neither indicates a reluctance to admit the~error of the earlier decision or a\ndesire to perpetuate its evil effect. In either ease I cannot approve,\n8. In concluding that,: editorialization by licensees is not prohibited,\nthe majority report does not expressly say that such conduct’is permitted in\nthe public interest\". The Commission,without any reference to-the effeot of\nMayflower, merely comes to the conclusion that overt licensee editorialization,\nwithin reasonable limits and subject to the general requirements of fairness,\nis not contrary to the public interest. This conclusion thus appears to be\nbased solely on the requirement created by this Commission that licensees be\nfair and objective in the presentation ©f controversial issues ©f public\nimportance, I believe that in resting this holding solely on that ground, the\nCommission overlooks the more important, and determinative factor of the First\nAmendment of the Constitution of the United States, If as the majority states\n\"radio is included among the freedoms protected against governmental abridgment\nby the First Amendment\" and if as is made clear by the majority it must be\nmade, available to \"all responsible elements in the community\", then it follows\nthat governmental prohibition of editorialization by licensees, who certainly\nare a responsible element ofythe. community, constitutes an.unconstitutional\nabridgment of free speech, t! I, therefore, rest my decision that editoriali¬\nzation by licensees is in the public interest not on any policy requirement\ncreated by the Commission but upon the inviolate terms of the First Amendment,\nFor whether or not the Commission is willing to follow the rule that licensees\nmust be fair and objective in the.presentation of controversial issues of\npublic importance,' a prohibition of editorialization by licensees would, in\n2/ Both the Communications Act and the decisions of this Commission and the\nCourts make it clear that radio’ station licensees are required to be responsi¬\nble members of the community. Irresponsible licensees are, of course, not\nqualified to be the holders of radio station licenses-and the problem of\neditorial! zat.ior+ by licensees in a context of irresponsibility, presents en¬\ntirely different problems from those involved in a ban on all editorialization\nby licensees, Cf, Trinity Methodist Church, South v,.Federal Radio Commission,\n62 F. 2d 850, ccrt.Ten, / 288 U.S. 599,"
}