{
  "id": "d894-177",
  "text": "91S\nLIMIT POWER OF RADIO STATIONS\nSTATEMENT OF RICHARD B, HULL. PRESIDENT, RATIONAL ASSOCIATION OF EDUCATIONAL\nBROADCASTERS, AND DIRECTOR OF RADIO, .IOWA STATE COLLEGE, AMES, IOWA\nMR. HULL* My name is Richard 3. Hull, I am president of the National\nAssociation of Educational Broadcasters, and director of radio of the Iowa State\nCollege, which operates a daylight station with us, WOI, on the 740 I~A clear\nchannelo\nMy appearance in these hearings has been authorized by the NAEB board of\ndirectors and by Dr. Charles E. Frilay, president of the Iowa State College0\nMy concern a3 a represent©,tire of the NAEB and WOI Is two-folds First\nthat the principle of a truly free, competitive, and unmonopoll£ ad system of\nradio broadcasting in the United States be better understood and more adequately\nprotected, and secondly, that adequate broadcast facilities be ade available to\nthose licensees who are anxiouo and uniquely able to serve that portion of the\nradio public not now served,, and not likely to be served either by proponents of\nsuperpower or by existing educational stations under the presently limiting\nsystem of radio rules and regulations®\nMy duties as director of radio at the Iowa State College include those of\nsupervising and managing radio stations WOI and directing the development of\nIts FM and. television stations, I have been associated with WOI in the several\ncapacities of announcer, news editor, production manager, program director, and\ndirector over & total period of more than 7 years. For 3 years I served as\nagricul tural extension radio specialist of the University of Minnesota, working\nwith the Uhl varsity of Minnesota Station &U0M, and produced farm programs for\nthe university over various commercial stations.\nDuring two other periods I did both general and farm broadcasting for WOSU\nat the Ohio State University and KOAG at Oregon State Colleger, In each instance\nI was primarily concerned with the problem of serving a predominately rural\naudience with program material^ not otherwise available, which related not only\nto the business of farming but the business of living*\nI would like to have the committee know that my appearance here is entirely\nvoluntary. No one has urged me to come here to testify, Neither the several\nstations of the National Association of Educational. Broadcasters nor MOI sill\nsuffer any economic loss as a. result of decisions which may be made as a result\nof this committee9 s action or action of the Federal Communications Commission,?\nListeners to our stations, however, will continue to be deprived of a\nunique service, if the status quo continues, and a superpower grant might well,\nin certain instances, further limit the already limited facilities of these\neducational, outlets. In other words, with a superpower grant or even a continue\nance of the status quo, the listening public stands to lose, not the educational\nlicensee.\nI think the committee should also know that the clear^chaxmei group, perhans\nexercising more optimism than good judgment, through one of its stations suggested\nthat Iowa State College assume a position with respect to S. 2231 which in view\nof the facts and the previous record it was not possible for the college to\nassume. From information I received from several other quarters, I would judge\nthe pressure was similar to that experienced at Iowa State College0"
}