{
  "id": "d894-182",
  "text": "LIMIT POWER OF RADIO STATIONS\n923\nWOI has made repeated efforts before the Federal Communications Commission to\nsecure nighttime operation privileges and was, of course, party to the recent\ndear-channel hearings before the Federal Communications Commission, along with\neight other college and public-service stations performing service daytime onlyc\nDue to these limitations* the roster Included KUOM, University of Minnesota,\nMinneapolis, Minn*; WCAL, St* Olaf College, Northfield, Minn; WNAD, University of\nOklahoma, Norman, Okla*; WOSU, Ohio State University, Columbus, Ohio; WHCU, Cornell\nUniversity, Ithaca, N« Y.; Oklahoma A. and M. College, Stillwater, Okla,; and WNSC,\ncity of New lorko\nEach of us felt the necessity in this period of world crisis and tension to\npresent more and better information on world and national Issues more often and to\nthe largest audiences—-the night audiences*—in our areas, and to offer the public\nnot four network points of view or one or two clear-ch&nnel points of view, but a\nchoice o With us, what the commercial broadcasters call public interest programing,\nand too often regarded as a painful necessity by them, is our first and major and\nonly interesto\nEach of these stations are class II stations on a Iclear channelo Each of\nthese stations is prevented from furnishing nighttime service by present rules and\nregulations.. Each of these stations is blocked by a I-A dear-channel station\nwhose farm program materials come from our institutions*\nIn other words, the farm program of most of these I-A dear-channel stations\nthat they use are derived from material furnished by the land-grant college 0\nI have here copies of a letter from the Iowa Farm Bureau Federation addressed\nto Senator Tobey which, in substance, states that the need and desire on the part\nof its 126,000 Iowa membsrs for WOI to operate at night to bring programs of\nculture, information, and special market news not otherwise available to its\nfarmer-member listeners* I submit the copy to the committee 0\nI have here also copies of a letter from the Western Grain and Feed Association\naddressed to Senator Tobey * This is the largest State organization of grain and\nfeed dealers in the United States, with over 1,100 members in Iowa. The letter\nwas written by Mark G, Thornburg, secretary* Mr. Thornburg was for years secretary\nof agriculture of Xowsu\nIn substance. It points out the unique and otherwise unavailable system of\ngrain reporting made available to Iowa listeners through the cooperation of this\norganization and the Farmer Grain Dealers of Iowa over WOI. The letter describes\nthe general service of WOI, regarded by the writer and his associates as presenting\na unique and valuable contribution, and he notes the expressed need and desire\nof 65 percent of Iowa farmers for nighttime service from WOI and his hope that\nthis committee and the Federal Communications Commission will give due attention\nto these facts in order to grant WOI nighttime operation*\nI have here a third letter from the Farmer Grain Dealers8 Association of\nIowa, a cooperative, which lists a membership of approximately 100,000 in Iowa0"
}