{
  "id": "d894-184",
  "text": "LIMIT POWER OF MDIO STATIONS\n925\nKOAG was granted a construction permit by the Federal Communications Gk>nw\nmission to serve rural Oklahoma, This permit was then revoked., and the whole\nissue thrown into the United States Court of Appeals because pf a ‘-A clear-\nchannel-station objection,\nWHAS, Louisville, Ky., argued that if Oklahoma A, and M. College had such a\nstation on the air, interference would result not only at night but during the\nday as well. If such a contention is true in theory, with normal present 50,000-\nwatt dear-channel ceilings, what would be the result of this in litigation and\nconflict with a 75,000-watt superpower grant?\nThe NAEB has no quarrel with the average aM typical commercial station\nwhose standardized programing is aimed at the objective of attracting the larg¬\nest audience. However, it insists upon the necessity of enriching radio service\nby adding specialised and unique services, keyed to regions and areas, which are\nnow offered by college and university stations—on a limited daytime basis only.\nIt seems Inconceivable to me that 26 superpower clear channels could even\nattempt to fulfill such a function. The vary nature of the monopolistic posi¬\ntion they would automatically acquire together with the standardized program¬\ning policy they would be almost certain to follow, would hinder, not help, a\nbetter American radio in th© sense above.\nThe MEB submits that in its opinion college and university stations\nshould be permitted to meet the needs and wants of its own particular radio audi¬\nences at night, in the same maimer as it now meets them during the day.\nThe grant of superpower to the present I-A clear channel licensees would\nnot only prevent college and university stations from securing nighttime broad¬\ncast hours which are sc essential in order to reach the largest audience, but\nwould also have the effect of seriously curtailing the service to the present\nradio listening audience during the day.\nThe NAEB does not request the promulgation of a rule which would automati¬\ncally break down all of the clear channels. It believes that the issue on which\nclear channels should be broken down and under what circumstances, should depend\nupon the relative merits of each case. It submits that the Commissionus rules\nshould provide for a procedure wherebv daytime radio stations licensed to uni¬\nversities, colleges, and public-service agencies may apply for a license to\noperate at nighttime on class I-A channels.\nSuch applications should be designated for hearing and the particular sta¬\ntion then operating on the channel should be made a party to the hearing.\nOn the basis of th© record established at the hearing, where each of the\nparties would b© permitted to introduce testimony on the need of service to the\nrespective areas, the Commission can grant or deny the application for additional\nnighttime service on the clear channel. We are not asking for special favors.\nWe are not asking for specia\" protective rules.\nWe, the educational broadcasters, are asking for a comparative considera¬\ntion of the merits of each of our specific particular cases. This is the demo¬\ncratic method. This is the fair method. This is the method by which public\nservants, who are the judges of conflicting interests, should make a fair and\nequitable distribution of radio facilities among applicants."
}