{
  "id": "d894-185",
  "text": "LIMIT POWER OF E4DI0 STATIONS\n926\nW© are not asking for a n5dosignatJen of the class of stations which ar©\npresently operated as class 1-A clear channels. Under our proposal their desig¬\nnation will remain the same and, consequently, th© protection required to tnem\nfrom stations outside of th© United States will remain the same os it 23 now*\nThe following statement, approved at the annual convention of the NAEB\nin Chicago, October 25-27, 1947, will summarise and explain very clearly, I\nthink, our point of view with respect to th© Johnson bills\nThe NAEB believes that the distribution of radio facilities differs funda¬\nmentally from the distribution of the other media of mass communications, such\nas newspapers and films, because its primary source for distribution belongs\nto the public at large. Unlike any other media, it draws it right to do busi¬\nness from licenses issued by a Federal regulatory body on the basis of ”public\ninterest, convenience, and necessity.® Thus, the license© has & clear duty\nto serve hot only the general public but the particular interests and needs of\nthe area and region in which the station is located.\nThe MEB further believes that its member stations are ©specially ©quipped\nto serve, have the duty of serving, and do, in fact, ssrv® specialized local\naudiences. This special service includes, among other things, a large rang© of\nprogram content—from special farm and market programs to classroom lectures,\neducational talks, and discussions on matters of public interest.\nThe NAEB believes that an. integral and essential part of the concept of\npublic interest, convenience, and necessity is the correlation of program con¬\ntent to the local and particular nasds of the community surrounding each sta¬\ntion. This criterion should be of paramount importance to th© Federal Communi¬\ncations Commission in its grant of facilities and promulgation of rules. The\nNAEB submits that it is physically end practically impossible for any on© group\nof 1-A stations--elear-channel stations—to actually serve the highly special¬\nized and local needs of communities which lie beyond their own immediate area.\nThis is particularly true, insofar as it applies to varied needs of farm¬\ners. Just as it is impossible for a Chicago daily newspaper to provide Florida\ncitrus growers with local news, or the Minneapolis daily newspaper to serve\nadequately the citizens of New York City, it is impossible for class 1-A sta¬\ntions to serve effectively listeners half a continent away.\nThe programs of clear-channel stations which would be subject to interfer¬\nence by the simultaneous operation of an MEB station nighttime ar© not of\nparticular interest to th© listeners residing in the areas of interference. Lis¬\nteners in these areas necessarily rely upon stations located in their immediate\nvicinity for news, market, weather, other items of information, and general\nentertainment programs—network and non-network. A clear-channal station lo¬\ncated hundreds of miles away cannot serve this function. This is evident from\nmerely inspecting any map of United States crop and livestock areas, which\nshow the diversity of agricultural pursuits in the various States.\nGranted that clear-channel stations do provide some general form or pro¬\ngram service to distant areas, it is submitted that th© public interest would\nbetter be served by permitting an NAEB station to serve its own area with its\nunique type of service at the cost of depriving som© dear-channel station of\na comparatively small number of listeners in distant areas of a general type"
}