{
  "id": "d894-192",
  "text": "LU’lT POWER OF RADIO STATIONS\n933\nSenator Johnson, I want to make certain that w© get in the record at this\npoint another telegram which was received from the Central Cooperative Wholesale,\nSuperior, Wis., by John Miller, public-relations director. They asked me to read\nthis into th© record. I also desire to precede that telegram with a letter from\nMr. John Carson, Washington head of the Cooperative League, from whom I requested\nsome information with respect to the Central Cooperative Wholesale.,\n(The letter and telegram follow:)\nTHE COOPERATIVE LEAGUE OF THE UNITED STATES OF AMERICA,\nWashington 6, D. C„, April 14, 1948.\nHon. EDWIN JOHNSON,\nChairman, Senate Subcommittee on Interstate Commarco,\nSenate Office Building, Washington, D„ C.\nDEAR SENATOR: In response to your inquiry, I am pleased to advise you that\nCentral Cooperative Wholesale, of Superior, Wis., is a member of the Cooperative\nLeague of th© United States of America. This organization is owned by several\nhundred local consumer cooperative organizations in northern Michigan, Wisconsin,\nand Minnesota. And these local cooperative associations arc owned by thousands\nof families. I would estimate that the family owners of this organization num¬\nbered 65,000 to 75,000. That would mean that about 250,000 of our citizens\nwere affiliated with this group, and it is important to rememter that they are\nthe owners of the finest of democratic economic institutions in the country.\nI am pleased that 0CW wired to your committee. I wish you could go into\nthat part of our country and mingle with the people iher.e. I doubt that there\nis any part of our country where devotion tc democratic principles and freedom\nexceeds that of these people. They are people who have not been blessed with\ngreat and rich natural resources. Their farms—as many as 90 percent of these\npeople are farmers who own their own farms—are small. The land is none too good.\nThe climate is very rugged as you may know. But these people are owners of farms\nand are proud of their devotion to democracy and freedom. I am confident that\nthey could not justify the expenditure of money to appear before your committee.\nAs ycu know, consumer cooperative organizations recognize that the all-\nimportant enemy to democracy and freedom is monopoly. And monopoly means\nfor them every concentration of power, where the power my be used to control\nor dominate other people. The fact is that information about your bill has not\nbeen communicated to the masses of our people, and therefore they have not been\naroused to the need to write to your committee. I am confident that when the\nmember-owners of consumer cooperatives know the facts about your bill, they will\ndo what CCW has done, and thus your bill will have the support of 2,500,000\nfamilies, or 10,000,000 people.\nI hope to see you some day, but I rarely get to the Capitol, and never\nexcept in search for news for our cooperative news service.\nYours sincerely.\nJOHN GARSON."
}