{
  "id": "d894-193",
  "text": "LIMIT POWER OF RADIO STATIONS\n934\nSUPERIOR, WIS., April 13, 1948.\nSonator EDWIN JOHNSON,\nChairman, Senate Subcommittee on Interstate Commerce,\nSenate Office Gliding, Washington, D. C.:\nIn behalf of more than 65,000 consumer families served by us In Michigan,\nWisconsin, and Minnesota, ve request your permission to read our statement\nregarding your proposal to fix minimum of 50,000 watts and provide for dupli¬\ncation of clear-channel stations. In advance of our statement, can this tele¬\ngram be presented to your committee? Our cooperative family sponsors a Monday-\nihrough-Friday noon broadcast explaining in each program the danger of monopoly\nin any form and we sincerely feel that your proposal helps us to counter the\nevils of concentrated control in radio. This Nation’s greatest current and fu¬\nture enemy is in the gigantic stature of big business which aspires to become\nmore gargantuan. This tendency opposes cooperatives5 stanchest allies, namely,\nsmall-business men themselves, whom we serve by championing their danger from\nour common enemy. We are unable to come personally to Washington en masse or\neven by small representation, for we cannot pass expanse and entertainment costs\nof travel on to our consumers, but we are certainly with you. Senator, in spirit\nand wish to add our measure of national concern as it affects the people in our\narea and the5.r millions of American neighbors. W® congratulate your effort to\ncurb monopolistic trend in this country and offer our assistance toward your\ncommittee*s constructive action.\nCooperatively yours,\nCENTRAL COOPERATIVES WHOLESALE,\nJOHN MILLER, Public Relations Director.\nSenator Reed„ We wil'1 recess until 2:30. The committee intends to finish\nthis afternoon. At least, it very earnestly hopes it will finish. There has\nbeen sufficient time to develop all phases and angles of this question. W© will\ntherefore ask the witnesses who appear this afternoon to prepare your written\nstatements to go into the record and prepare your oral statements.\nW® are in recess until 2:30 p*m.\n(Whereupon, at 12:36 p.m., the committee reeesssd until 2:30 p.m* of the\nsame day.)\nAFTERNOON SESSION\n(Whereupon, at 2:35 p.m., the committee reconvened, pursuant to the taking\nof the noon recess.)\nSenator Johnson (presiding). The hearing will please come to order.\nMr. Herbert L. Wilson? (No response.)\nMr. Edward Breen? (No response.)"
}