{
  "id": "d894-20",
  "text": "- 6 -\nthe day to day operation of a radio .-station, Ht/ Nor 'do I believe that the\ncitation of decisions involving network regulations, network programming,\nover-commercialism, radio advertising of liquor cr broadcasts relating to\natheism, furnishes any guide as to the manner in which the doctrine of fair¬\nness may apply to situations involving editorialization by licensees,\n15, I believe that the problems with respect to editorialization can\nonly and should only be determined a posteriori in connection .ith specific\nsituations involving editorializationT\"V I would therefore continue the. past\n4/ A few examples of questions raised;\nIf a licensee editorializes with respect to issue A, is he required under all\ncircumstances to afford radio time to all responsible persons with views\ncontrary to.his with respect to issue A? Or is it enough that on most issues\n.the licensee affords time to reply to his own editorial views?. Is the licensee\nrequired to afford such persons free time or can he require payment for the time\n.If views contrary to his have been expressed freely on other stations in his\ncommunity is he required to also afford time on his station? C-n the programs\nof commentators either of his own choosing or of the choosing of his sponsors\nserve as replies by opposing views? What restrictions can He impose on the\n.manner in which opposing views may reply? Can opposing views reply In the form\nof .song or drama? What restrictions with respect to censorship by the licensee\nof the opposing script does the Commission intend-to apply? ' These are but a few\nof the many practical questions faced by the licensee who wishes to editori¬\nalize but left unanswered by the Commission*s decision,\n%// While it is very true the flexible standards have served very useful\nFunctions in • Anglo-American law, it must be pointed out that they usually\nhave evolved not by a priori announcements by courts but out of decisions\narrived at on a case”to'case basis, Cf., eg., the history of the development\nof the legal standards in the common law of negligence. These standards grew\nout of findings'by juries bn a case to case basis that eventually were molded\ninto general standards. See Holmes, The Common Law, pp. 122-129. This is\nespecially significant where as here we are dealing with•the problems of free\nspeech,\n”Tho subject in its more .general outlook has been the source of much\nwriting since Milton’s Aeropagitica, the emancipation o-f the English\npress by the withdrawal of the licensing act in the reign of William\nthe Third, and the Letters of. .Junius. It. is enough now to say that\nthe universal trend of decisions has recognized the guaranty of the\namendment to prevent previous restraints upon publications, as well as\nimmunity of .censorship,, leaving to correction by subsequent punishment\nthose utterances or publications contrary to the public welfare. In\nthis aspect it is generally regarded that freedom of speech and press\ncannot be infringed by legislative, executive, or judicial action, and\nthat the constitutional guaranty should be given.liberal, and compre¬\nhensive construction. It may therefore bo set- down as a fundamental\nprinciple that under these constitutional guaranties the citizen has\nin the first instance the right to utter or publish his sentiments,\nthough, of course, upon condition that he is responsible for any abuse\nof that right. Near v. Minnesota ex rel, Olson, 283 U.S, 697/ 51 S. Ct.\n623, 75 L, Ed, loFTT” Tr^nFty Method'isT\" Churci'i, South, v. Federal Radio\nCommissi on, 62 F. 2d 85(9, .cert, den,, 2o8 n.S. S59, ' r-^"
}