{
  "id": "d894-23",
  "text": ". - 9 ~\ndecision licensees in general- remained silent .and supinely submitted\" to the\nCommission;-hdxvevdr, i^.ny licensees, including network licensees who operate\nthe most valuable radio facilities, selected commentators to do their editorial-\nizing for them. In fact, they-have commercialized the commentators to positions\nof power and influence upon public opinion which dwarf the power and influence\nof any licensee or any group of licensees* In fact, this commentator commercial-\nzation has reached the point where newspaper licensee network affiliates car¬\nry regular broadbasts which they apparently reject and ridicule as proper news\nor comment for the newspaper columns* This is all the more significant because\nthe jajbrity has treated the tern' \"editorialization” as comprehending \"news\"\nand ’’comment0. Since-the Majority couch the conditions of the licens'ce's.\nright to editorialise upon terms of ’'fairness”, it is hard, to understand why\ntheir opinion fails to come to grips with the licensees*. standard practice of * ■\neditorialization through commentators* The Commission files are literally\nfilled with legitimate complaints of unfairness by such professionals, the\nalter 'egos of 'licensees, who have become identified with them over a period of\nyears- as inextricably as the trade name of the. station or network*. The ambig-m\nuous doctrine of fairness has nover becsn attached to them; the Commission.has\nneveh felt it had the power to demand the kind of practice.it now asserts\nagainst their principals—the licensees—in this decision* And the Majority\ncompletely avoids discussing licensee-commentator fairness,\n21. 'in view of the majority decision, the Commission should give special\nattention to the extent to which the selection'of commentators constitutes,an\naspect of editorialization by licensees. Any appraisal of the realities must\ntake into consideration the fact that licensees in effect editorialize through:\nthe mouths of• commentators who by reason of their continued use of the facili¬\nties make known their views 'to the iicensee-and thus broadcast their views\nwith the implied consent of the 'licenseeThe importance of such editorilai«h\nzatioh is made clear by the special treatment afforded cdmnientaby programs.\nCommentators are known' to be associated with particular networks ..or stations\nfor long periods of time* \"while'the broadcast hour of other types of programs.:\nvaries from' time to time, networks and stations make every effort-to leave .\nthe broadcast* hours of commentator programs unaffected by overall changes in\nprogramming schedules. Sponsors may c'ome and go, but the same commentators\nbroadcast at'the'same hour over the same stations as. they have done for years*:\nGrid wonders whether it is- not appropriate to call such, commentators mere chat¬\ntels of the networks or statdohs. -Certainly,, they are.valuable pieces of\nradio property. \"I-hen the voices of such program, fixtrues are available to net¬\nworks'and stations, are., we to'' be surprised that the: broadcasting industry has\nsuffered in silence the ban on, editorialization created by the Mayflower deci¬\nsion?' ■ •' 'r“\n- : 22, I want to make it clearly understood that in discussing bommentators\nas alter ego editorialists for licensees, the Commission has no more power of\n6/..\"When a radio station, hires radio commentators and pays them and puts *them\non, they, editorialize on (the' news, and sometimes not only editorialize oh the\nnews, but they give out editorial Opinions about every conceivable subject,\nmany of which they don’t know anything about,” Comment of Chairman Wheeler in.\nSenate blearing on S, 814 (78 Cong. 1st Session) p, 413,"
}