{
  "id": "d894-52",
  "text": "&\n— ,, hi a £\n^JrT^k $*** \\ • &&.-\n-^4-\n154 WEST 46th ST., NEW YORK 19, N. Y.\nJanuary 28, 1948\nDeal* Reader:\nHerewith is editorial which appeared on page 27 of the January\n28th Variety.\nLOOKING FOR TROUBLE?\nBroadcasters are divided, and understandably, on the\ntricky, involved and dangerous matter of taking an\n\"editorial\" stand. This involves the right of a\nstation licensee to behave like a newspaper publisher.\nIt's easy to argue in theory that the broadcaster has\nor should have such an equal right to \"free speech,\"\nbut it's not so simple as it seems, for the FCC's May¬\nflower decision of 1940, which still stands as the\nbasic guide, was written in reaction to the abuses of\neditorializing by the Boston stations of John Shepard,\n3rd.\nShepard was up to his eyebrows in politics, and\nMassachusetts politics aren't pretty. In using his\nGovernment-granted franchise to advocate his view¬\npoints as to men and issues, Shepard became a potent\npolitical power not by entering politics or running for\noffice but by shouting from the platform of a radio\nlicense.\nThe pros and cons of the Mayflower decision still\necho, and further hearings on this very matter are due\nin Washington this spring. One party of radio men\ncontends that they ought to have freedom to editorial¬\nize, and they wish this right recognized even though\nsome of them frankly do not intend to use it. For this\nis the rub. As a businessman obliged in self-interest\nnot to antagonize listeners, a station operator cannot\neasily rush in, indifferent to consequences. It's\nbelieved in Washington that the motivation of some\nbroadcasters is not to exercise the privilege of ad¬\nvocacy, but to force the FCC to abandon its explicit\nand implicit control over editorializing.\nClearly this issue is emotional as well as intellectual.\nCertainly no snap solution is possible, but caution is\njustified because in the past the record is decorated,\nback to the mid-twenties, with examples of dubious use\nof the editorial privilege by broadcasters who, the"
}