{
  "id": "d894-62",
  "text": "-in¬\nvoluntary or invited speaker on a controversial issue. The licensee’s views\ndeserve no better or worse treatment than those of any one else who may use the\nstation’s facilities. The licensee, when he uses the station’s facilities,\nshould have the same obligations as any other speaker. I am against discrimina¬\ntion in the world of ideas -- irrespective of their source.\nI am in agreement with the spirit and intent of the basic philosophy\nwhich lies behind the Mayflower decision. The only criticism that I have of the\ndecision is its vagueness. I would like to see the Commission clarify it and\nput to rest, once and for all, the discussions of the decision which have need¬\nlessly plagued the industry since January 1941. It seems to me that the real\nissue involved is not revocation but rather clarification and elaboration. In\nfact, the principles upon which the decision is based are not revocable — at\nleast, not by the Commission, under its present mandate of Congress to license\nstations which will serve public interest, convenience and necessity. In my\nopinion, when the Commission issued the Mayflower decision it did nothing which\nwas new or novel. It did not promulgate a new rule. The decision is only a\nreminder of the historic role of radio in our democratic country where privately\nowned stations, using a public commodity have to operate in the interest of all.\nI fail to see how a revocation of the reminder could change anything in the\nfundamental law which requires broadcasters, under the Communications Act of\n1934 to operate in the \"public interest, convenience and necessity.\"\nOne can’t mention these words without hoping that when the Commission\nresolves the Issues involved in this hearing, it will restate in clear and\nsimple language what Is meant and implied by this phrase. A study of the in¬\ntent of Congress at the time the phrase was placed in the Act would go a long\nway in clarifying some of the very issues involved in this hearing."
}