{
  "id": "d1093-0",
  "text": "N-A-E-R NEZW S-LEL I TER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nRadio Hall, U.W., Madison, Wisconsin\nDecember 2, 1946\nDUNN OUTLINES NAEB REGIONAL PROPOSAL\nJohn Dunn, Vi NAD, has followed up on a plan for organizing regional groups with¬\nin NAEB* The details have been submitted to The Executive Committee for consid¬\neration. . .\nThe plan embodies a geographical division into eleven regions. It proposes a\nregional governor from each area, who would comprise an executive council. A con¬\nstitutional amendment is required to put the plan into.operation formally, but it\ncan be done informally with the approval of The Executive Committee.\nMore details later.\nSECRETARY NOVIK REPORTS\nIn assuming his duties as Executive Secretary of NAEB, Morris Novik invites\nall members to pass suggestions along to him and to call on him for help in pro¬\nmoting the cause of the educational broadcasters. He says;\n”1 have agreed to carry the ball and do my share\n”1 - to help forrtulate a program that will be of value to the many new FM\neducational radio stations, _\n”2 - to help keep alive the interests of the educational radio stations,\n”3 - and try to break through and convince some of the existing educational\nfoundations of the need for help to the new FM educational stations and why\nNAEB is the answer.”\nBROADCASTING COUNCIL IN BOSTON\nOrganization of The Lowell Institute Cooperative Broadcasting Council has been\nannounced. Included are six Boston Area institutions. Lowell Institute, Boston\nCollege, Boston University, Harvard, M.I.T., Northeastern University and Tufts.\nBroadcasting will be done over Boston radio stations. _\nParker Wheat ley, formerly radio director at Northwestern University and later\nin charge of educational broadcasting for the Armed Forces Radio Service is.director\nof the new Council. George W. Slade, educational director of WBZ and WBZA is\nassistant director.\nFREC PROGRAM LISTINGS IN SCHOLASTIC\nAfter providing mimeographed lists of programs approved for.student listening.\nThe Federal\"Radio Education Committee now publishes these selections m The\nScholastic Teacher each month in the Sight and Sound section. The choice.is deter-\nminedby(l) educational significance, (2) program quality, and (3) instructional\nadaptability."
}