{
  "id": "d1450-1",
  "text": "tober through December. These include the\nUNESCO National Commission Conference at San\nFrancisco, Adult Education and CNO Conventions\nand many others (besides a stepped-up tempo of\nNAEB activities) as we move into the “Convention\nSeason.”\nWe’ll keep you apprised of everything that affects\nthe NAEB in all these. Generally there are few\nwhich do not. Otherwise we should not be taking\nso much time for them.\nOnce again, we’re in the midst of a pretty com¬\nplete change in office and network personnel here\nat 14 Gregory Hall. We hope that, by the time our\nnext issue goes to press, we may again be more\nsettled. At the moment we are completing copy for\nthe new NAEB Directory, which is to be printed\nfor the first time. We shall hope you have this, also,\nby the time the October issue of the Newsletter\nreaches you. If there are any errors in it, please let\nme know. This is the only way we can keep it up\nto date.\nNETWORK NEWS\n—Bob Underwood\nIt is with deep regret that we announce the de¬\nparture of one of our most valuable employees, Mr.\nAdeleke (Leke) Ojo. Leke and his wife completed\ntheir studies at the University in June and are now\non their way back to Nigeria, Africa, where they\nwill teach in elementary and secondary schools.\nWe are sorry to see Leke go because he was a good\nfriend and a willing worker.\n*****\nOrders are coming in for the fourth quarter\noffering, and we are pleased to note how many\nstations are ordering now instead by deadline time.\nWhat with the vacation season upon us, we would\nhave been hard pressed to keep our books in order\nshould everyone have decided to order at the last\nminute. Thanks for your help.\nSpeaking of vacations, our wealthy traffic man¬\nager, Peggy Enderby, took her husband for a trip to\nNew York City where, we understand, they are\nhaving a very nice time. Jess Trump, our engineer,\ntook his vacation at home helping with the new\nbaby, Richard. I got a week off to visit my in-laws,\nbut I think I’m going to sneak off for another week\nor two a little later in the year. Our full-time dup¬\nlicator operator, Zoltan Ujhelyi, is going to look over\nhis new homeland plus a trip into Canada: we\nhope he doesn’t get lost.\nAs you probably can tell, there isn’t much go¬\ning on at this time of the year; but by next month\nwe expect to be back in the swing of full production.\nBe sure to make your plans for St. Louis where I\nhope to see all of you.\nPICTURES FOR THE NEWSLETTER\n—Hans J. Massaquoi, Editor\nAncient Chinese wisdom holds that one picture\ntells a story better than thousand words. In the\nbelief that this is correct, we would' like to include\nin our Newsletter as many photos and illustrations\nas space permits.\nHere is where you come in; for without your\ncontributions of picture material our good intentions\nwill have to remain just that.\nEach month your highly appreciated news re¬\nleases tell us of a multitude of interesting activities\nin which you or your organizations participate,\nranging from “plain old” meetings to the construction\nof new radio and TV stations. How about supple¬\nmenting some of this information with a snapshot\nor two to give all our readers an idea of what the\nnew stations, convention sites, experiments etc. look\nlike?\nAlthough we would like to accompany each news\nitem about newly appointed personnel with a photo\nof the person involved, the great number of such\nnews and limited Newsletter space make this im¬\npossible. So, please don’t bother sending photos of\nthe passport variety if they relate exclusively to\nstaff appointments.\nThanks a lot for keeping us up to date about your\nactivities. From now on we shall be searching our\nmail for loads of interesting pictures from you.\nA WORD OF TRIBUTE\n—Harry J. Skornia\nI would like to register here the loss which many\nof us have suffered in the death of Ralph H. Hardy\non August 5, at the age of 41.\nI worked with Ralph in many contacts (at\nUNESCO, where he was vice chairman of the U. S.\nNational Commission; in religious broadcast projects;\nand while he was at NARTB).\nIn Ralph’s death we have suffered the loss of\none of the finest and cleanest minds in our field'.\nOur regrets to CBS, which had recognized his fine\nabilities with a vice presidency; our sympathies to\nhis wife and five children. We shall all miss him.\n2\nNEWSLETTER"
}