{
  "id": "d1450-7",
  "text": "writing surface for instructional materials written\non camera, or the material can be prepared prior\nto program time and presented as needed. Lesson\nmaterial can be saved for future presentation or can\nbe edited to alter the course material. The tablet\ncan be used in place of flip cards or cue cards and\nalso as a crawl title machine. The machines are\navailable in a manual model as shown, or with an\nelectric motor drive and remote control. If you are\ninterested in purchasing these machines you may\nwrite Mr. Miles at Route #2, Williamsport, Md.\nThe manual machine sells for $132.80.\n*****\nWe’d like to call your attention to four meet¬\nings of interest to technical personnel. On Sept. 27-\n28 at the Willard Hotel in Washington, D. C., the\nIRE Professional Group on Broadcast Transmission\nSystems will hold its annual two-day fall meeting.\nThe program will feature papers primarily on tele¬\nvision subjects at sessions on Friday and Saturday\nmorning and Saturday afternoon. Friday afternoon,\na visit to the Walter Reed Army Medical Center\nhas been scheduled with a demonstration of its\nclosed circuit color television facilities.\nOn Oct. 4-9 the SMPTE will hold its annual\nfall convention in Philadelphia, Penna., at the\nSheraton Hotel. A wide range of interests will be\nreflected in the program of papers to be presented.\nDetails of the program are not yet available. How¬\never, sessions are being scheduled on international\ntelevision, military uses of television and video tape\nrecording. Other sessions will deal with high speed\nphotography, motion picture laboratory practices,\nclosed circuit television, large screen television and\ntelevision operating practices.\nA number of interesting papers on color for both\nmotion pictures and television are to be included\nin the program. During the convention there will\nbe a considerable schedule of Engineering and Ad¬\nministrative Committee meetings.\nThe Audio Engineering Society is holding a five-\nday technical session at the New York Trade Show\nBuilding, Eighth Ave. at 35th Street in New York\nCity Oct. 8 through 12. A detailed program is not\navailable for this meeting. However, the Program\nCommittee is working to arrange a program of tech¬\nnical sessions covering many topics from amplifiers\nto turn tables. The Audio Fair is usually held in\nconjunction with the AES meeting where a great\ndeal of audio equipment may be seen. Much of it\nis demonstrated for both professional and home use.\nConcurrently with the SMPTE and the AES,\nthe American Institute of Electrical Engineers is hold¬\ning its 1957 fall General Meeting at Hotel Morrison\nin Chicago Oct. 7 through 11. Tuesday Oct. 8 has\nbeen tentatively set aside for papers on television\nbroadcasting with the afternoon session being de¬\nvoted to four papers on the work of the Television\nAllocations Study Organization (TASO). These\nfour papers will serve as an unofficial progress re¬\nport on TASO. We have extra copies of the program\nfor this meeting, arranged by the AIEE Committee\non Television and Aural Broadcasting, in case you\nwant more details on the paper to be presented.\n*****\nGeneral Electric has recently announced an\nelectronic device about the size of a cigar box which\nis expected to double the life of image orthicon\ncamera tubes. The box mounts on the side of the\ncamera and contains an electronic deflection system\nwhich “wobbles” the TV image inside the tube and\nprevents “sticking” or burn in.\nThis device is to be marketed immediately and\nwill sell for around $1,200. It was originally devel¬\noped at WSM-TV at Nashville.\n*****\nWILL-FM of the University of Illinois recently\nrebuilt and replaced its 8 bay antenna at Allerton\nPark. It is now transmitting on 300 kw ERP.\n*****\nBob Higgy of WOSU-TV reports that Neal Milli¬\ngan of his staff has developed an automatic gain\ncontrol system for use with their RCA vidicon film\nchain. He states that it works perfectly and avoids\nall gain riding and completely eliminates dark slides\ncoming up on slide changes.\nIt is a comparatively simple addition to the film\nchain and since it is patched in between units it\nrequires no change whatsoever in the RCA equip¬\nment and can easily be connected or disconnected.\nThe AGC takes a sample from the video output and\nfrom this develops a control voltage which controls\nthe gain control stage in the vidicon processing\nchassis. The actual video circuits are not changed\nat all and the AGC works quickly and effectively\non all kinds of films and slides.\nWe have asked Bob for the details of this AGC\nsystem which we will duplicate and send to our\nreaders.\n*****\nThe Kaltenborn Radio Scholarship for the ac¬\nademic year 1957-58 was awarded to Enest T.\nKaufman, University of Wisconsin law student from\nWest Allis, Wis.\nThe scholarship, which this year amounts to\n$750, was established by Wisconsin-born news\ncommentator H. V. Kaltenborn to encourage im¬\nprovement in news analysis and presentation over\nthe air.\nNEWSLETTER"
}