{
  "id": "d1770-2",
  "text": "-5-\nSHOET FLASHES FROM THE FIALP\nKFDY - South Dakota State College, Brookings. S. W. Jonas reports, \"KFDY\nhas ^recently installed a Universal Recorder. Y'hile the recording studio is not\nyet complete we have, nevertheless, sent out several recordings already. Vie\nare enjoying the splendid cooperation of other radio stations in the state in\nthe use of these recordings.\n\"The grasshopper situation in this state this summer has lent itself ideally\nto justifying the expense of this recording outfit. By having the college\nentomologists make transcriptions of grasshopper control methods and other\nimportant announcements concerning grasshopper control campaign, we have been\nable to cover the entire state in short order, with up to the minute information\non the grasshopper situation. Now that the gr? sshopper situation is easing up a\nlittle we are finding the recorder just as important in releasing news about the\n1958 Agricultural Conservation Program ’which has just bean announced.\n\"A change, or rather addition, to the KFDY personnel has taken place this\nsummer. While I am still in general charge of the station my work as Forj?\nManagement Specialist for the Extension Service has kept me too busy in recent\nyears to do justice to the radio station. Therefore, on July 1, Jack Towers who\nhas been student announcer for the past three years was made announcer and\nprogram director for the Extension Service and is devoting more than half of his\ntime to the radio station and the recording outfit.\"\nUniversity of Kentucky. Lexington. Elmer Sulzer, in charge of radio, says,\n\"The expansion of the radio listening group organization service in eastern\nKentucky to include 16 of the University of Kentucky* s 24 remote listening\ncenters it has been announced jointly by University officials and the National\nYouth Administration. The latter organization has provided one supervisor for\nthe past two months who has worked in eight of the centers. Since the new\nsupervisor will also handle eight centers, exactly two-thirds of the University* s\nsystem of centers will be given this service.\"\nWSUI - University of Iowa. Iowa City. Concerning equipment Carl Menzer\nwrites, \"We have installed a new receiver and hope to work in connection with WOI\non the rebroadcasting of programs from both Ames and Iowa City. As you know, WHA\ncomes in with sufficient volume for rebroadcasting also no reason why it should\nnot be entirely satisfactory. I had hoped also to work out something with FILL\nbut I find there is too much interference from WIBW on their frequency. It looks\nlike a possibility for an educational chain of some sort.\n\"We have installed some new equipment during tha summer months - velocity\nand eight-ball microphones; new transcription turntables, etc. This RCA\nturntable is equipped with a recording attachment which should work satisfactorily\nalthough I have not tried it out as yet.\"\nWHA. University of Wisconsin, Madison. The week of September 27 will bo a\nbusy one for WHA, reports H. B. McCarty, program director. Twenty new series of\neducational features go on the air that week. The Wisconsin School of the Air,\nsupervised by Mr. McCarty, begins its seventh year by providing two programs\neach day for schools. The Wisconsin College of the Air opens its fifth year of\nbroadcasting under the direction of H. A. Engel with ten weakly courses for out-of¬\nschool \"students\".\nON TO THE N-A-E-E CONVENTION\nAT URBANA — SEPTEMBER 15-14 -"
}