{
  "id": "d1003-113",
  "text": "A M\nSEP 0 boo\nf|8|9|10(ll|12| l|2|8|4|6|f\nMay 12,^1955\nHr. Ralph H. Hall, Coordinator\nAudio-Visual Education |\nKent State University\nKent, Ohio\nDear Ralph*\nI am trying to answer at one and the same time, before taking off on another\ntrip, your letter of April 29 to me and your letter of Hay 6 addressed to Don\nSmith, HAEB. I wonder if you would like to have the letter forwarded to Don\nSmith at the University of Illinois Audio-Visual Department? I am not sure\nwhether it was intended for us, although it seems to be mostly about the NAEB.\nAs you probably know, most of the materials m distribute are not our own, and \\\nrights to use them will depend upon your getting the proper releases from the\noriginating stations. In a great mary oases these programs were not intended\nfor any except radio use, and this may be soke thing of a problem. This would\nrefer to \"Great Books of Asia,\" for example, which was produced by KPFA, in\nBerkeley. Rights on this latter ore further complicated by the fact that this\nprogram was produced under an FAT grant, and rights now belong to the Educa¬\ntional Television and Radio Center against whose budget this grant waa charged.\nThis, I think, illustrates our problem of rights in many oases.\nIn a general way also I am not sure that our objectives are quite the same,\nalthough both are equally laudable. Just as radio and television stations could\nnot subsist if they offered nothing that was not available at the corner thea¬\nter, at the public library or on films for the asking, it seems to me that ed¬\nucational radio and television will have to offer something not generally avail¬\nable elsewhere, or all the media would begin to be alike. Ihis is part of the\nreason why grants sometimes specified \"broadcast use only,\" and that only over\nnon-commercial stations.\nIn the case of many of our grant projects, also m have plans and hopes for pos¬\nsible future radio and/or TV exploitations, partly international, which we would\nnot be able to carry out if we were to turn these tapes over to you prior to\nattempting, as we now are, to implement those objectives for world radio use,\nwhich were a part of the Foundation request in the beginning. Therefore fail¬\nure to be able to provide copy of aam of these programs until this \"primary use\"\nis completed should not be interpreted by you as discriminatoxy in any way, or\nbased on a dog-in-the-manger attitude. It is generally based on realistic com¬\nmitments we had to make to get the money in the first place, for radio stations\nwhich were, and in raaiy cases still are, in need of distinctive materials."
}