{
  "id": "d1003-136",
  "text": "About our Television Activities\nWe have been most gratified by the fine support the general public has\ngiven to our first year on television. Millions of our friends have\nwatched these shows, and during the same period have continued to\nsupport our films in the theaters. This confirms our original judgment\nthat the two great media of entertainment need not be unduly\ncompetitive. In fact, we feel they are so compatible that this year we\nare expanding our television activities to include a new series of\nprograms designed primarily for school age citizens.\nFrom the very first we have been aware of the privilege, as well as the\nresponsibility which we assume, when we enter so many millions of\nhomes each week with our DISNEYLAND program. We feel this even\nmore deeply as we prepare to offer additional programs each day\nwhen the majority of our viewing audience will be composed\nof younger people.\nWe welcome the challenge this new opportunity presents. We hope all\nof our programs will provide entertainment, for that is our business.\nBut even beyond this, as we strive to reach our goals, we shall endeavor\nto place emphasis on the constructive aspects, which can logically\nbe part of “entertainment.”\nAbout This Guide\nThe format for both television ptograms permits a wide variety of\nsubject material. This publication provides information about many of\nthe specific things our shows will cover throughout the year.\nIt has, however, another purpose. It has been designed to be of direct\nhelp to our many friends in the field of education who have told us\nthey find educational values in our programs. Our mail has been heavy\nwith requests from teachers who seek additional supplementary\nmaterials which relate to the programs and which can be used in the\nclassroom. This publication represents our desire\nto answer these requests.\nWithin the booklet are synopses of individual programs, advance\nschedules giving program dates and times, “review” program notes,\nguide sheets suggesting classroom activities, and other items which we\nhope are meaningful. From time to time throughout the year,\nadditional information will be made available.\nWe sincerely hope the publication proves to be of help and service,\nand we would welcome your comments about it."
}