{
  "id": "d1003-138",
  "text": "When Knighthood\nWas in Flower\nDISNEYLAND HIGHLIGHTS\n1955-56\nThe great literary favorite, truly a classic historical\nromance of the 16th Century, will require two\nconsecutive hour-length programs. This production\nwas made in England, the locale of the story\nitself, and features the two fine British stars,\nGlynis Johns and Richard Todd.\nWater Birds\nThis Academy Award winning nature film is\nanother in the widely acclaimed series of\nTrue Life Adventure dramas. A group of\nnaturalist-photographers spent many patient hours\nto record the living habits of the remarkable and\nstrange birds who live on or near the waterways\nof our land. The Disney directors have made\ngenerous use of a beautiful musical score to\nhelp tell their story.\nDavy Crockett\nand the\nRiver Pirates\nSometimes it’s difficult for even students of history\nto know for sure when “history” stops and the\nlegends begin where such a beloved character as\nDavy Crockett is concerned. This is not the case\nhere, however. Davy and his amazing exploits\nas he cleans out the river pirates along the Ohio,\nis a most satisfying tall tale.\nThe Story\nof the\nAnimated Drawing\nIt seems most apt and proper that Walt Disney\nshould devote a full program to the history of an\nart form with which he has been so closely allied\nfor more than thirty years. Here the opportunity\nis presented to trace the evolution of “the moving\ndrawing,” from its first appearance on the walls of\ncaves to its modern counterpart—the\nanimation drawing.\nThe Seri Indians\nOn the Island of Tiburon, in the Gulf of Mexico,\nlives a small group of Indians known as the Seri.\nNot more than 248 individuals represent the\ntotal survivors of a still proud and independent\ngroup of Indians, who, many historians say, are\nthe direct descendants of the first inhabitants of\nthe New World. Their civilization is a rapidly\ndisappearing one, and this program documents it\nfor future generations interested in the strange\nstory of the SERI INDIANS."
}