{
  "id": "d1003-155",
  "text": "TELE-DIGEST*\nfor “WATER BIRDS”\nA TRUE-LIFE ADVENTURE NATURE DRAMA\nBirds Shown:\nGannets, Terns, Pelican, Wood Duck, Man of War, Coots, Snowy Egrets, Western\nGrebe, Pintail Duck, Bluebill Duck, Purple Gallinule, Cormorants, Black Skimmer,\nCurlew, Kildeer, Plover, Water Auzel, Flamingo, Black-Footed Albatross.\nProgram Content:\nSince the beginning of time, the bird has been an inspiration to the artist, the scientist and\nthe poet.\nEach specie has an interesting history, but none more fascinating than the story to be found in\nthe habits and customs of the water birds.\n“Free as a bird” is a familiar expression and yet a bird isn’t really free at all. He rarely makes\na flight without a definite purpose, and he has but one full time job —simply to stay alive.\nNature, however, lends a helping hand, and in this True-Life Adventure we will discover how\nshe’s adapted the water bird to meet the problems of survival.\nMany species of birds are migratory —like the gannets who each year travel from the equator\nto Bonaventure Island in the Gulf of St. Lawrence, to raise their young. In these Northern lati¬\ntudes 18 hours of daylight permit intensive fishing and young birds have tremendous appetites.\nNests are placed on every conceivable bit of ground or ledge, one egg is laid and one youngster\nis raised.\nGannets dive for their food. To protect them, nature has equipped them with pneumatic cells,\nshock absorbers, in the chest area.\nThe Pelican, in the air, is a masterpiece of functional\ndesign and a fisherman without equal. His dive is a study\nin perfect coordination.\nTo insure the reproduction of her many children,\nnature has devised many forms of courtship. The male\nWood Duck wears dazzling plumage. For the Western\nGrebe the peculiar ritual includes gathering moss for\nnest building.\nIn the struggle for survival, food gathering is all\nimportant... so nature adapts her birds to different diets\nand restricts them to separate feeding grounds. Some\nsearch for food in shallow waters, some at extreme\ndepths, some in swamps or along the shore.\nNature has also adapted feet, beaks and bodies in\nmany interesting ways. Webbed feet and long legs, long\ncurved beaks or broad flat beaks and streamlined bodies\nassist the various kinds of birds to survive.\nAt the end of the program a number of the scenes previously used are shown again and\nbecome a kind of rhythmic, musical poem set to the music of the 2nd Hungarian Rhapsody.\nThis “Tele-Digest” has been prepared by Mrs. Margaret Divizia, Supervisor\nin Charge, Audio-Visual Section, Los Angeles City Schools.\nCopyright 1955 Walt Disney Productions\nAll Rights Reserved Printed in U. S. A."
}