{
  "id": "d1003-49",
  "text": "12\nExperience has shown that, if adequate funds for staffing and equipment\nare available, a university has much to gain by establishing its own broadcast\nstudios* \"For educational purposes, commercial station facilities are a poor\nsubstitute for school-centered production and broadcast units. In many insti¬\ntutions the college facilities serve not only as educational broadcast units\nbut instructional workshops for students in many courses on the campus as well.\nAltho the trend in institutions of higher learning is toward centers which\nencompass all communication arts, in many institutions radio stations were es¬\ntablished under the jurisdiction of departments of speech or drama or in the\nextension division. Regardless of the immediate administrative responsibility\nfor such facilities, the audio-visual center as a coordinating agency plays an\nimportant part in the functioning of such special services. Tape and disc\nrecordings and their duplication, films, photographs, slides, and graphic ma¬\nterials are an essential part of radio and television programming. Experience\nshows that it is essential that administrative organization be such as to\nfacilitate the closest possible coordination of the broadcast staff and the\nproduction personnel in the audio-visual center.\nEducation, Training, and Research\nOne of the primary responsibilities of the center is to provide profes¬\nsional leadership in educational programs and projects, both on and off the\ncampus* This is done thru consultation, demonstrations, assistance in cur¬\nriculum planning, publication of information bulletins and resource catalogs,\nresearch, and manjr other educational technics.\nAnother important function of the center staff is to serve as consultants\nwhen classrooms, auditoriums, laboratories, and other instructional areas are\nbeing constructed or remodeled. To insure the best possible instruction,\nfacilities must be provided for the use of a wide range of teaching materials\nand equipment. Considerable financial saving can be made if needed facilities\nare considered in the planning stage of building programs."
}