{
  "id": "d1003-50",
  "text": "13\nMiether or not the university is educating teachers, it should be recog¬\nnized that the director of the center has certain teaching and inservice educa¬\ntion functions. He participates in conferences, workshops, and institutes. He\ndemonstrates the usefulness of new equipment and materials to faculty and stu¬\ndents. He assists in the selection of equipment and materials. He counsels\nstudents in the selection, use, and preparation of materials and trains the\nstudent projection corps and other student assistants.\nIf the university has a teacher-education program, the director will\nusually be involved in teaching formal courses. The center should provide\nadequate space and equipment for this educational work. (See Section III.)\nThe director and other members of the center staff should carry out con¬\ntinuous evaluative studies and other research projects. The center frequently\nplays an important part in evaluating the effectiveness of commonly available\nmedia and technics and engages in the production of new materials and the de¬\nvelopment of new technics and procedures. The well-functioning center is ready,\nwilling, and able to cooperate with other elements of the faculty in research\nand to participate in interdepartmental or institutional research.\nAdministration\nAdministrative functions will vary from very simple activities in small\ncenters to complex ones in large centers. Involved are such activities as\nstaff organization and supervision, record keeping and reporting, correspondence,\nand budget making and accounting. Smooth and efficient organization'is a basic\nprerequisite to all the service activities of the center.\nThe Staff\nThe nature of the service a center will render is affected by the leader¬\nship and ability of the person who directs it and the amount of time the ad¬\nministration allows for performance of the duties of this office, A college\nwith IjOO students needs, and can well afford, a full-time, professionally\ntrained director; a competent clerical assistant; and part-time student"
}