{
  "id": "d1003-65",
  "text": "28\nand ducts for removing fumes during film cleaning operations unless a nontoxic\ncleaner is to be used® Sturdy tables with nonmetalic tops should be provided\nand those to be used for film inspection should be equipped with firmly mounted\nrewinds* There should be convenient storage for cans, reels, film cement, film\ncleaner, high stools, a ladder on wheels, and other special tools. There should\nbe a nonsplash sink, first-aid materials, a four wheeled transfer cart, and a\npackage truck for moving heavy packages.\nRecommended space allocation for inspection and repair of materials: 200 -\n25>0 sq. ft, minimum. Increase in relation to amount and variety in types of\nmaterials circulated,\n5>. Education, Training, and Research\nThe area devoted to these aspects of the program is normally composed of\noffice space, consultation rooms, reference library, and workshop and demonstra¬\ntion room. In smaller colleges, or universities having no teacher education\nprogram, these functions may be housed in combination with other functions in\ndual purpose spaces. For example, auditioning and previewing areas may serve\nboth the selection and educational functions*\nIn all Institutions, such centers should maintain one or more workshop or\ndemonstration rooms for the purpose of stimulating the improvement of classroom\nenvironment and procedures. Such a room should provide proper facilities for\nthe best usage of every known audio-visual technic, including television (_\nThese workshops are large areas where students and faculty can come to get\nguidance in the selection of instructional materials to meet specific purposes,\nto learn to operate equipment, or to use duplicating processes ranging from a\nsimple Hectograph to the dry mounting press.\nIf the institution is engaged in teacher education, these facilities are\nnecessarily more extensive and should include well equipped classrooms for\nprofessional courses and laboratory work In audio-visual education (See Section\nIII)-"
}