{
  "id": "d1003-67",
  "text": "30\nshould be provided with quality darkroom photo equipment and proper table space,\nsinks, and storage facilities* Space must also be provided for negative and\nprint filing, camera storage, print dryers, and other related facilities.\nMinimum equipment includes: enlargers, 35>mm, 2jx2j, and ljx£; developing\ntanks; print dryers; press camera; copy camera; reflex camera; 16mm and 3$rm\ncameras; stainless steel sinks; microphotographic equipment; dry mounting press;\nfootage counter; copying stands; flood lamps; exposure meters; tripods; flash\nattachments; 3^nim printer; lantern slide printer; l6mm editor; benches; record\nand negative files; safelights; trimmers; steel cabinets; print washers; small\n8 and 16mm film developer tank; and safelights.\nfor photographic services:\nRecommended space allocation^ Minimum 300 - 600 sq. ft.\nc. Audio Services - The college should provide well equipped space for tape\nand disc recording and re-recording. Colleges mil want to produce tape program\nmaterials for classroom instruction on campus and also educational and public\ninformation programs for release on radio stations.\nMany universities are establishing tape recording libraries, where masters\nof prerecorded programs on many different topics are filed. These are available\nfor servicing the campus and also all schools mthin the college service area.\nSchools desiring a specific tape program send a blank tape with a request to\nthe library. A re-recording is made from the master tape and shipped to the\nperson requesting it. Usually a small service charge is made. These ”Tapes\nfor Teaching” libraries offer unlimited opportunity for service to schools,\ncampus\nThe/should have a sound studio with adjacent control room. Such a studio,\nin minimum installations, may be designed as a multi-purpose unit and used at\ntimes as a laboratory room for students or for shooting motion pictures or\ntelecasts. Its use will be greatly increased if it is connected by shielded\ncable and/or conduit wiring with every major activity area on the campus, such\nas the auditorium and sports arenas ,to permit use of closed circuit TV."
}