{
  "id": "d1003-85",
  "text": "1*8\nIn contrast to the 1“listening lab,\" the \"complete lab\" provides a tape\nrecorder-reproducer in every booth* This more than doubles the cost of the\ninstallation! in return, it more than doubles the performance* Each booth\ncan become a master station capable of \"feeding\" the others* Also, it can\noperate independently, so that as many languages as there are booths can\nbe made available simultaneously* Finally, and most important, it enables\nthe student to record and play back his own performance and, thus, to hear\nhimself as others hear him* This is a unique experience in self-criticism\nauditorially, as is a mirror visually*\nWith individual recorder-players, the whole series can be \"fed\" by a\nsingle master player* Each studentTs instrument records every sound from\nthe master, and in the spaced pauses of silence it records also the student1s\nresponses as they are spoken into his microphone. At the end of the drill,\nthe recorded voice instructs him to rewind and then listen to hjls own tape\nwith its alternation of \"his master’s voice\" and his own* Individual self-\ncriticism is thus possible and inevitable. Here is the paradox and the\ngreat advantage of the complete labs simultaneous, classwide, oral-auditory\ndrill which is, nevertheless, private, indivudual, endlessly repeatable, and\nalways subject to evaluation and attempts to improve it. When the complete\nlab is so used regularly and thoughtfully, it becomes an integral part of\nthe course.\nThe integrated laboratory represents a very different concept from that\nof the listening labs. It Is not a supplement to the classwork but an\nessential part of it. Ideally, each class, as a class, should hold all its\nmeetings here, but for reasons of economy, the lab is shared by various\nclasses, each of which meets in it alternately or every third meeting or\nevery fourth, etc* The regular instructor is in charge. He plans the lab\nroom activities to dovetail with the classroom activities and vice versa."
}