{
  "id": "d1485-0",
  "text": "f.\nSAN FRANCISCO CITY AND COUNTY\nDEPARTMENT OF ELECTRICITY\nRADIO INSTALLATION RULES\n(As Amended November 19, 1948)\nANTENNA:\nNo antenna shall be erected over any street or over.any wire\nof more than 600 volts, or be fastened to any pole supporting light\nand power wires©\nThere shall be a vertical clearance of at least 12 feet over\nany flat and 8 feet over any peaked roofj the construction shall bo\nof substantial nature, and all wires used to support the antenna shaLl^\nbe either copper or galvanized and not smaller then No. 14 B & S gauge.\nAll splices and joists shall be soldered, or approved connectors used.\nLEAD-IN WIRES:\nLoad-in wires shall not bo loss than No. 14 B & S gauge copper\nor No. 17 B & S gauge copper-clad steel. The lead-in wire must bo\nsupported on approved insulators spaced close enough to prevent the\nwire from coming in contact with the building, pipes, or light and\npower wires. . , , . ,, . ,\nA glazed porcelain or glass tube shall bo provided -or the lead-\nin wire where it enters the building.\nPROTECTIVE GROUND WIRE:\nThe ground wire may be bare or insulated and shall not be smaller\nthan No. 14 B & S gauge copper. The ground wire shall run as directly\nas possiblo to a good permanent ground, which should bo a cold water\npipe wherever possiblo. Gas piping shall not be used under any circum¬\nstances. When the ground wire is run outside, care should bo taken to\nprotect it from mechanical injury. An approved ground clamp shall bo\nusod wherever the ground wire is connected to pipes or piping.\nWIRE INSIDE BUILDING:\nWiros inside building shall bo run in a workmanlike manner and\nshall not be placed nearer than two inches to any electric light or\npower wiros unless encased in porcelain or flexible oubing.\nAPPARATUS GROUND WIRE:\nThis wiro may bo baro or insulated and shall not bo smallor than\nNo. 14 B & S gauge copper. It may bo run either inside or outside. If\nrun in full compliance with rules for protective ground wiro, it nay be\nusod as the ground conductor for the protective device©\nRADIO AND TELEVISION INSTALLATION RULES\nTELEVISION ANTENNA:\nAll parts of the television antenna shall have a vertical\nclearance\n- 1 -"
}