{
  "id": "d1485-1",
  "text": "RADIO AND TELEVISION INSTALLATION RULES - Cont»d\nabove tho roof* ponthouse roof, or elevator ponthouse roof, of 12 foot*\nNo part of tho television antenna shall be within 3 feet of any\nstandpipe, fire wall or fire osoape.\nNo equipment whatever shall be mounted on any fire wall, without\nthe approval of the Bureau of Fire Prevention*\nLEAD-IN WIRES;\nAll parts of tho load-in wires shall have a vortical clearanco\nabove the roof, ponthouse roof, or elevator penthouse roof of 12 feet -\n(or laid flat on the roof).\nNo part of the lead-in wiros shall bo within 3 feet of any stand*\npipe, fire wall, or fire escapo.\nLead-in wires extending down the side of a building shall bo support¬\ned on approved insulators securely fastened to the wall at each floor with\nscrews/ The lead-in wires shall not be located more than 4 inches away\nfrom tho wall*\nPERMIT:\n* The licensed contractor, firm, company or corporation proposing\nany radio and television installation shall submit before installation\nthe following data to the Bureau of Firo Prevention, for approval:\n(1) Location of the television set, by building,\nfloor of building, and room.\n(2) Location of the television set within the room\n(3) The size of the room in which set is to bo\nlocated - in square feot, with width, depth and\nheight dimensions*\n♦Upon approval by tho Bureau of Fire Prevention and before installation,\na pormit for tho proposed installation shall be obtained from tho Depart¬\nment of Electricity to insure electrical inspection and approval of the\nequipment* The minimum charge for each permit shall bo f2*50.\nBureau of Fire Prevention approval and Department of Electricity permit\nshall not be required from individuals installing radio and television\nequipment in their own home or living quartors, provided that the building\nis less than 4 stories in height*\n* *» * * * *\n♦TENTATIVE Distributed through the courtesy of\nRadio Council - Chicago Public Schools\n- 2 -"
}