{
  "id": "d1091-0",
  "text": "NEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. 28, NO. 9 SEPTEMBER, 1963\nNAEB Seeks Teachers for Samoa\nQualified elementary teachers are being sought for the new\nETV system which the NAEB is installing in American Samoa.\nTeachers with experience in TV teaching or as TV teaching\nsupervisors, who are interested in going to Samoa, should write\nto Vernon Bronson, NAEB director of research and develop¬\nment, 1346 Connecticut Avenue, N.W., Washington, D. C.,\n20036. The positions will be open around the first of the year.\nDESIGN ENGINEERING COMPLETED\nSmith Electronics, Inc., has successfully completed the design\nengineering phases of the Samoan ETV system, and further\nengineering phases of the project will be contracted for as the\nsituation warrants. Cecil Bidlack, NAEB TV engineer for over\nfour years in 1954-59, was in charge of the project at Smith\nElectronics.\nIn announcing completion of this project phase, Vernon\nBronson said, “Smith Electronics has solved some unique prob¬\nlems of television propagation in Samoa that will be of con¬\ntinuing value as TV systems are developed in other remote\nareas of the world.”\n75 Meet at Lake Okoboji\nSome 75 leaders in the field of uses of mass media in edu¬\ncation met in August at the ninth Audiovisual Leadership\nConference, Lake Okoboji, Iowa. Topic of the session was\n“Learning Theory as it Relates to New Media and the Learner.”\nBurton Paulu, NAEB Radio Board member from Region IV,\nattended the by-invitation-only conference as the NAEB repre¬\nsentative, while NAEB Vice President Harold Hill attended\nas the representative of the Educational Media Council.\nInformation Wanted\nA Newsletter reader is seeking information on television in\neducation in the following areas: nursing, dentistry, post¬\ndoctoral, industrial training—such as management seminars,\nscientific seminars, and worker retraining. He is looking for\ninformation similar to that in the SREB brochure “Television\nin Education for the Health Professions in the South,” recently\nmailed to all NAEB members. Please send any such information\nto the Newsletter.\nReaders' Almanac Passes 1,000\nOn July 11, Warren Bower was on the air with his 1,000th\nbroadcast of The Readers’ Almanac, the NAEB Radio Network\nprogram on which he interviews writers, publishers, critics,\nteachers, and others for whom books are the major business of\nlife. He began the program in November, 1938. Programs are\ntaped in the studios of New York University, where he is\nassistant dean of the Division of General Education, and dis¬\ntributed to 65 NAEB stations from Florida to Alaska.\nEdwin Adams Dies\nEdwin Adams, pioneer educational broadcaster, died in Au¬\ngust. He was formerly an NAEB Board member and com¬\nmittee chairman, and had been on the staff of KUOW,\nUniversity of Washington.\n1963 NAEB Convention Notes\n• November 17-20, Hotel Schroeder, Milwaukee. Ken Lofgren,\nspecial effects coordinator, WMVS and WMVT, is chairing\nthe local convention committee.\no Members will receive early in September copies of the ad¬\nvance program. Enclosed with this Newsletter is a flyer about\nthe scheduled social events and the automatic insurance coverage\nfor all who register before November 1.\n• Bruce Raymond, director of the English Radio Network for\nCBC, will speak at the session on radio programing Tuesday\nat 10:45 a.m. A. H. Partridge, CBC’s international exchange\nofficer, says of Raymond: “He has many ideas regarding the\nrole of radio and its place in society and has been bringing a\ncompletely fresh outlook to' the CBC network.”\n• The all-day technical session on Tuesday, November 19, will\ninclude the following papers (these are in addition to special-\ninterest sessions of the regular convention) : “Television Camera\nModifications,” Roger Penn, American University, Washington,\nD. C.; “Relating Technical Radio and Television Standards\nand Educational Needs,” John Renner, director, Jansky &\nBailey Systems Division, Atlantic Research Corporation; “New\nFCC Logging Rules,” Harold Kassens, assistant chief, Broad¬\ncast Facilities Division, Broadcast Bureau, FCC; and “Remote\nControl Operation for AM-FM Transmitters,” Rob Beldon,\nWILL, University of Illinois. There will also be a technical\ntour of WMVS facilities.\nCongressional Record Prints NAEB Program\nOne of the NAEB Radio Network’s programs on the wheat\nreferendum was reprinted in its entirety in the Congressional\nRecord in July. The program was Washington Report No. 114,\n“An Attempt to Clarify the Results of the Recent Wheat\nReferendum,” produced by John Lewis, and released to network\nstations on June 9.\nJournal Contributions Help Fill Gap\nIn response to the item in the July Newsletter, requesting\ncopies of old NAEB Journals in order to complete the Pub¬\nlications Office file, issues were received from Hugh Greene,\nUniversity of Texas; John R. Haney, University of Florida;\nand Raymond Wyman, University of Massachusetts. Their\ncopies, plus those previously contributed by Tracy Tyler, filled\nthe gaps in all but the first two volumes. Still missing are Vol.\n1 No. 1, Sept., 1941; Vol. 1 No. 2, Oct., 1941; and Vol. 2, No. 4,\nDec., 1942. If anyone has copies of these he is willing to give up,\nplease send to the NAEB, 119 Gregory Hall, Urbana, Illinois,\n61803.\n1"
}