{
  "id": "d1091-3",
  "text": "PROGRAMS\n► During the summer, WKAR and WKAR-FM, Michigan\nState University, introduced a new program series designed to\npresent concise daily feature reports on the state. “Background\nMichigan” integrates important highlights of Michigan’s past\nwith current developments. Informal interviews and commen¬\ntaries are featured on the 5-minute programs, which are pro¬\nduced by WKAR’s A1 LaGuire with the assistance of subject\nmatter specialists from all fields.\n► KTCA, St. Paul, is currently broadcasting Two Centuries\nof String Quartets, in which the Collegium Quartet presents\nsome of the significant works for string quartet written in the\npast two centuries. These are selected and arranged chron¬\nologically in the TV series so as to provide a “survey” of the\nliterature for this medium.\n► Extension 310 is a 15-minute program offered by WMVS,\nMilwaukee, designed to answer viewers’ questions about TV\nprograms, effects of programs on audiences, specific educational\nofferings of the stations, and general ETV information. Station\nManager Otto Schlaak hosts the series.\n► WTTW, Chicago, recently broadcast the film, “The New\nChicago,” which traced the architectural history of what hap¬\npened before, during, and after the great Chicago fire.\n► For three weeks in August, KEBS-FM, San Diego State\nCollege, pre-empted its regular schedule in order to broadcast\nspeakers at the 21st annual Institute on World Affairs at the\ncampus.\n► The Alabama ETV network recently broadcast a program\ncomparing voluntary vs. commercial blood banks,\n► The Man from Dearborn is the title of a radio series pro¬\nduced by Marion Corwell for the Dearborn Public Schools. The\nseries, saluting Henry Ford’s 100th birthday (July 30), was\nbroadcast overseas through the facilities of Radio New York\nWorldwide.\n► A report on Radio Russian, a series of forty half-hour radio\nlessons in elementary Russian, says that over 450 listeners have\nsent written requests for a continuation and/or rebroadcast of\nthe series: 1500 listeners wrote for the study guide. The pro¬\ngrams were broadcast over the eight FM stations affiliated\nwith the former NETRC network, the ERN. Requests for tapes\nfor broadcast have been received from other stations,\n► Speaking on the weekly radio commentary, Business Re¬\nview, of WUOM, University of Michigan, Ross J. Wilhelm\nused the commercial radio industry as a case in point to illus¬\ntrate that when it comes to business competition, bigness is\nno guarantee of survival. Wilhelm is an assistant professor in\nthe university’s graduate school of business administration. He\nsaid it is the small businessmen in the industry who have\nprospered and grown, not the giant firms—because the small\nstations “recognized there were major gaps in the entertain¬\nment and broadcasting fare by television,” and they filled these\ngaps and met the broadcast needs of specific groups.\nPLACEMENT\nPERSONNEL AVAILABLE\n(For Information, write Mrs. Gail Wilson, Placement Service,\nat the NAEB office in Washington.)\nAugust I—Experienced, creative TV producer-director with\nsolid background, seeks challenging position with pro¬\ngressive ETV operation. Age 27, married, no children.\nPresently employed; graduate of Stanford University\nRadio-TV Institute. Location preference: California or\nSouthwest.\nAugust 2—Producer-director with 6 years experience in all\nphases of ETV production and training of production\npersonnel desires position with ETV station. Military re¬\nquirement just completed. Age 25. Location and salary\nopen.\nAugust 3—Production-assistant, researcher, or related position\nwanted by single 23-year-old female with B.A. in liberal\narts. Location preference: Northeast or West. Salary:\nprevailing rate.\nAugust 4—ER station manager, program director, music super¬\nvisor for university station in Pacific Northwest only.\nMinimum salary: $7500.\nAugust 5—Creative, imaginative female in early thirties seeks\nposition in ETV as producer-director or in programing.\nCompleting master's thesis in speech arts (TV-film). Has\n3 years experience as producer-director in R-TV. Broad\ninternational travel background. Location preference:\nGreater Washington area. Minimum salary: $6500.\nAugust 6—Aggressive 24-year-old single male desires creative,\nresponsible position in writing/production areas. B.S.\nand M.A. degrees in TV production. Will relocate any¬\nwhere to prove talent. $85.\nAugust 7—Single 22-year-old male desires non-technical em¬\nployment in ETV or satellite TV systems. B.A. in speech\nfrom the College of Wooster. Experienced in program¬\ning and supervising of educational broadcasting. Will¬\ning to consider any area, but would prefer East. Mini¬\nmum salary: $4200.\nAugust 8—ETV producer-director looking for opportunity with\nforward-looking station. WGBH-TV scholarship student,\nM.A. in January 1964. Single male, 23. Location and\nsalary open.\nPOSITIONS AVAILABLE\n(In order to be considered by these institutions, the reader\nmust be an Individual Member of the NAEB, with credentials\non file with the NAEB Placement Service. Non-members can\nsave time by sending the $10 annual dues and $5 Placement\nregistration fee at the time of inquiry.)\nAU-I Producer-director for Midwest university with tape\nproduction center and construction permit for station.\nSalary by qualifications. Available immediately.\nAU-2 Videotape technician with one year of experience in\nengineering and maintenance. $7500; immediate opening.\nAU-3 Video men (two) with maintenance background. One\nyear of experience. $7000; immediate opening.\nAU-4 Producer-director for southern university. Must be col¬\nlege graduate and have minimum of one year working\nexperience. Capable of handling teaching assignment.\nM.A. desired. Open now. $5700.\nAU-5 Production manager with M.A. At least one year of\nexperience; includes teaching assignment. Immediate\nopening in southeast. Salary $7200.\nAU-6 Producer-director for public school system of ETV.\nSoutheast. Salary $4500-$5000.\nAU-7 Production-promotion manager for large Midwestern\neducational radio operation. B.A. required. Two years\nexperience desired but not essential. Starting salary\n$6400.\nAU-8 Music director for a Midwestern university. Music\ngraduate with academic emphasis on musicology, music\nhistory, etc., is preferred. Not necessary that he or she\nbe skilled with an instrument. 12 months a year. Start¬\ning salary: $6000.\nNOTE: Currently there is a dire need in the Placement Service\nfor engineers and technicians.\nUNESCO SEEKS CANDIDATES\n(Applicants for these UNESCO positions should contact: Mr.\nJohn Sauls, Office of International Administration, Department\nof State, Washington 25, D.C.)\nParis—Program Specialist: To take responsibility for specific\nprojects assigned to him, to deputize as required for the\nchiefs of section, to represent the department and, as\nrequired, the organization at meetings, etc., concerned\nwith the use of mass communication techniques for edu¬\ncational purposes. Expected to exercise initiative and\nindependent judgment within general policy directions.\nClosing date September 30, 1963. Tour for two years.\nBangkok, Thailand—Specialist in A-V media and teaching aids:\nWill concern himself with all levels of in-school and out-\nof-school education and will take into account, as need\nand opportunity offer, the use of radio and eventually\nof TV, and other new techniques of education. Will act\nas clearing house for information in teaching aids field,\nand will stimulate the exchange of filmstrips, production\nof audiovisual and other educational materials and train¬\ning of audiovisual personnel and teachers. Closing date\nSeptember 30. Salary $8,930 per annum.\n4\nNEWSLETTER"
}