{
  "id": "d1109-0",
  "text": "special\n\" Washington Report\nThe National Association of Educational Broadcasters\nSpecial Issue 1346 Connecticut Ave., Washington 6, D.C._Jan, 27, 1961\nFEDERAL ETV SUPPORT LEGISLATION\nFour ’bills introduced during the opening week of the 87th Congress are designed to\nprovide federal support for the construction of educational TV facilities. All provide\nfor up to $1 million per state and the District of Columhia for educational TV trans¬\nmission facilities (including closed-circiiit television, “but not buildings), and are\nsimiijar to ones introduced by the same authors in the previous session of Congress:\nH.R. 132 by Representative Roberts (D.-Ala.) incorporates some of the changes recommended\nin the Committee version of his previous bill, H.R. 10609j S. 205 by Senator iy&.gnuson\n(D.-'WfeLSh.) and Senator Schoeppel (R.-Khn.) is identical to their former bill; H.R. 96^,\nintroduced by Representative Harris (D.-Ark.)*, Chairman of the House Interstate and\nForeign Commerce Committee, is a house version of the Nagnuson bill, as is H.R. 645, \"by\nRepresentative Boggs (D.-LA.).\n^ All the bills provide that grants be made to the agency or officer responsible for\nthe state supervision of schools, to a non-profit ETV organization, to a state ETV com¬\nmission, or to a state college or university.\nThe Nagnuson-Schoeppel bill, subsequently co-sponsored by Senators Metcalf (D.-Mont.)\nand Cooper (R.-Ky.), provides for outright grants of up to $1 million for establishi^ or\nimproving educational television transmission facilities in each state and the District\nof Columbia. It is the same bill that has twice passed the Senate in previous sessions\nof Congress.\nSince the new Roberts bill is the most complex and detailed, and contains the most\nchanges from previous ETV legislation, it is here reproduced in its entirety.\nH.R. 132\n* A \"h-m to amend the Communications Act of 193^ to establish a program of Federal\nmatching grants for the construction of television facilities to be used for educational\npurposes.\nBe it enacted by the Senate and House of Representatives of the United States of\nAmerica in c'ong’i^s assembled. That title III of the Ccanmunications Act of 193^ is amended\nby adding at the end thereof the following new part;\n'^PART IV - EDUCATIONAL TELEVISION FACILITIES GRANTS\n\"DECLARATION OF PURPOSE\n\"Sec. 390. The purpose of this part is—\n”(l) to assist (through matching grants) the several States to survey the need and\nand to develop programs for the construction of educational television facilities, and\n* An ld^Trt1/*a1 H.R. 2910, has Just been introduced by Representative McIntyre (R.-Me.)"
}