{
  "id": "d1109-2",
  "text": "SPECIAL WASHINGTON REPORT OF ETV LEGISLATION\n1119 Dupont Circle Building\nNational Association of Educational Broadcasters\nWashington 6., D. C.\nSenate Debate ,\nOn March 21, 1961, the Senate, after a three-hour debate, passed S205 { The Mag-\nnuson Bill”) by a vote of 67-13. , j n\nMost of the debate centered on the position of Health, Education and Welfare as\nset forth in a letter dated March 14 to Sen. Magnuson, Chr. of the Senate Interstate\nand Foreign Commerce Committee, which had previously reported the bill out favorably.\nIn the letter Secretary Ribicoff endorsed the purpose of the bill but listed these\nreasons for not supporting the instant legislation at this time: (1) priority of he\ngeneral education bill (2) wait for completion of NAEB survey on allocations needed\nfor ETV (3) further study of state and regional patterns for ETV (4) laore attention\nto ways of securing operating funds for ETV installation (5) advisability of inclu¬\nsion of ETV legislation in broader framework of more comprehensive federal aid to\neducation. ^ ^ t „\nIn the debate this letter was used extensively by opponents of the legislation.\nAt one point Sen. Dirksen, minority floor leader, quoted the Secretary’s last sen¬\ntence (\"Accordingly, we recommend against enactment of S205\") and said: I\nmyself now holding up the hands of the new Secretary of Health, Education and Welfare.\nThat is all I have to say.\" ,\nWhen it was learned that one of the reasons being advanced for not supporting the\nETV legislation at this time was the need to wait for NAEB’s survey. President parley\nwrote to the Chairman of the FCC, the Commissioner of Education, the Director of the\nBureau of the Budget, etc., stating that the NAEB spectrum survey has no relations ip\nto the basic development proposed in the ETV bills. He asserted t^t this survey was\nlooking to the next decade and beyond and that meanwhile there is imperative need to\nactivate the 214 channels assigned to education that are still unused. ^\nSubsequently, FCC Commissioner Robert E. Lee wrote to Secretary Ribicoff in -\neating that the NAEB study should not be advanced as a reason for delaying the legis¬\nlation nor should the consideration of state and regional networks. He pointed out\nthe need to establish individual stations was prerequisite to development of EiV net¬\nworks.\n^^^^^^^Hearii5s~before the Subcommittee on Communications and Power of the House Com¬\nmittee on Interstate and Foreign Commerce Committee were held March 20-23* Wito®sses\nincluded NAEB members: Martha Gable, Armand Hunter, .\nand John Crabbe and several others representing educational institutions and orga\ntions, including JCEB, NETRC, AAUW, ACE, AALGC, and SO-^* a j that\nTwo witnesses appeared to request that the legislation be^^e^ed to Provide that\nthe funds be used for leasing lines: Robert Landry, Vice President for terketing,\nAT&T, N.Y.; and Francis E, Almstead, TV Consultant, N.Y. State Department oi nducation.\nJohn White, President of NETRC, and William Harley, President of NAffi, both\nlated into their testimony strong objection to such a\nimportance of maintaining the distinction between federal ®\"PPf ^\nment as opposed to operating funds. Congressman Moss (D. Cal.)\nthat such a proposal went far beyond the original concept of the legislation, whos\ncentral purpose, he believed,was to get stations on the air so as to take up the\nreserved^channels. In his opinion, a provision that permitted leasing of facil ,\nwould ensure that the legislation would not be approved by the Congress.\nPresident Harley again read into the record the letters from President Kenn y\nand former Vice President Nixon (originally presented at the ^^ioal\nOctober) and submitted, that as statements from the spokesman of both major political\nparties, they indicated bi-partisan support for Federal assistance in fostering edu-\ncational television."
}