{
  "id": "d1109-3",
  "text": "Responding to questions raised previously by Chairman Oren Harris as to the\ndegree of readiness of the several states to use federal funds for ETV, Harley\nindicated that in the process of conducting a state-by-state survey of the needs of\neducation for television spectrum space, NAEB had acquired considerable data on the\n^'status of the art\" in each state and the degree of preparedness to utilize funds'for\nETV should they become available. Vernon Bronson, director of the survey, then pre¬\nsented a \"roll-call\" of the states which provided a partial answer to Harris'\nquestion.\nEarlier, when Dr. Edgar Fuller was testifying for JCEB, he offered the services\nof this agency in compiling a full report on the readiness of each state. JCEB-\nNETRC-NAEB are now working on this survey for inclusion in the record.\nMeanwhile, Oren Harris has written to state governors to ascertain the degree\nof readiness within each state to use federal funds for educational television facil¬\nities. Both Harris and Ribicoff are said to place a great importance upon the results\nof this survey. So far, the returns have been slow to come in.\nNAEB has informed people in each state concerning the Harris letter so that they\nmight cooperate with their governor in supplying information relevant to the formula¬\ntion of his response.\nPending the results of this survey and a statement from HEW, the hearings have\nbeen adjourned and the record remains open for filing of statements by interested\nparties. . v j. • •\nHearings are not expected to resume until early in May, at viiich time it is\npresumed that the HEW position will be presented by the Commissioner of Education,\nDr. Sterling McMurrin. He was scheduled to appear as the lead-off witness on March\n22, but that morning it was announced that a postponement had been requested. Coming\non the heels of the Senate vote and discussion of the Ribicoff letter, there has been\nspeculation on a possible relationship. There is also a feeling that the HEW position\nmay be altered somewhat for the House hearings. HEW may make recommendations of its\nown for what it considers suitable legislation, taking into account some of the ques¬\ntions raised by Ribicoff in his letter to Magnuson and moving the Department into\nan affirmative posture.\nA late development has been the reassignment from the Subcommittee on Communica¬\ntions to the Rules Committee of Rep. William H. Avery (R.-Kan.). Avery has been an\noutspoken critic of the ETV proposals and at the last session made a personal appear¬\nance before the Rules Committee to argue against reporting out H.R. 10609.\nPersons interested in giving emphasis to the need for passage of the proposed\nlegislation, may write to any member of the House Committee and duplicate copies for\nthe Chairman and Counsel may be addressed to Room 1334, New House Office Building,\nWashington 25, D. C.\nHOUSE COMMITTEE ON INTERSTATE AND FOREIGN COMMERCE\nOren Harris, Ark., Chr.; John Bell VJilliams, Miss.; Peter F. Mack, Jr., >\nKenneth A. Roberts, Ala.; Morgan M. Moulder, Mo. ^ l/; Harley 0. Staggers, W. Va.;\nWalter Rogers, Tex.^; Samuel N. Friedel, Md.; John J. Flynt, Jr., Ga.”'^; Torbert H.\nMacdonald, Mass.; George M. Rhodes, Pa.; John Jarman, Okla.; Leo W. O'Brien, N.i.;\nJohn E. Moss, Calif.John D. Dingell, Mich.; Joe M. Kilgore, Tex.; Paul G. Rogers,\nFla.; Robert W. Hemphill, S.C.; Dan Rostenkowski, Ill.*; James C. Healey, N.Y.; John\nB. Bennett, Mich.; William L. Springer, Ill.; Paul .F. Schenck, Ohio; J. Arthur Younger\nCalif.*; Harold R. Collier, Illinois; Milton W. Glenn, N.J.; ^muel L. Devine, Ohio;\nAnchor Nelsen, Minn.; Hastings Keith, Mass.; Willard S. Curtin, Pa.; Abner W. Sibal,\nConn.*; Vernon W. Thomson, Wise.; and W. E. Williamson, Clerk.\n* Subcommittee on Communications and Power\nChairman of Subcommittee"
}