{
  "id": "d1109-4",
  "text": "5\n* * * *\nWe have attempted to provide some of the flavor of the arguments over\nCATV. This is probably the most controversial subject now before the\nCommission. Comments before the Commission (with the exception of NCTA's\nclaim of assistance to ETV stations and its inclusion, in its entirety,\nof Loren Stone's article in the NAEB Journal* as Exhibit 1 of its Comments)\nfail to treat in any depth the relationship of ETV to CATV.\nIt seems clear from developments to date that ETV probably should\nnot either oppose or support CATV in its entirety. The issue right now,\nhowever, is the narrower one of whether and in what manner CATV should be\nregulated by the FCC. ETV does have a stake in this matter. CATV is\ncarrying ETV signals. Undoubtedly, it is providing new audiences for ETV\nand is thus assisting the development of ETV. However, just as ETV could\nnot forever depend on private arrangements with commercial television\nstations to meet its needs, so ETV cannot depend forever on private\narrangements with CATV operators as a substitute for direct ETV service.\nIn fact, the problem is more acute insofar as CATV operators are concerned,\nsince commercial television stations are subject to regulation, and hence\nmust generally abide by programing representations made, whereas CATV\noperators for the most part are subject to no regulation whatsoever.\nIf CATV is to play an important role in the development of ETV, then\nit may well be that ETV interests would be well advised to support at\nleast minimal regulation of CATV by the Commission, if only to provide\nsome further assurance that arrangements now gratuitously proffered by\nCATV operators to ETV stations will not be abruptly modified or discarded\nat the whim of the CATV operator. In addition, as experience grows with\nCATV, and its impact, both beneficial and adverse, on ETV is more fully\ndocumented, there may be additional reasons why ETV should take a stronger\nstand, pro or con, on this touchy issue.\n♦Stone, Loren, \"Community Antenna Television: Its Role in ETV,\nJournal, March-April, 1964, 23:2, p. 46.\nNAEB"
}