{
  "id": "d1577-0",
  "text": "September, 1955 1\nTHE PRESIDENT'S PAGE\nDear NAEBers:\nWhere’d the summer go? Where did you go? Many of you must have gone\nsomeplace. Lots of persons in NAEB ranks haven’t been replying very\nPROMPTLY, SO i ASSUME THAT THEYrVE GONE FOR A WELL-0ESERVE0 VACATION.\nHad short one myself, but had to cut it short on account of NAEB busi¬\nness. These radio and television things run the year around, I guess.\nI did have a note from Cl»f Schropp of Des Moines, and McCabe Day of\nHuntington, and the prize from Verne Bronson, Miami. Verne wrote,\n\"O.K.-V.B.” Wonderful life, eh?\nAny of you get to the Michigan State Fair? Understand that Bob Cole¬\nman and staff had couple of good promotion ideas going there. For\none thing, Bob had the NAEB'Exhibit and boasted of WKAR-AM-FM member¬\nship in NAEB. To TOP THAT, WKAR had some cardborad sun visors that\nWERE GIVEN TO BOOTH VISITORS, AND ACROSS SAID VISOR WERE SOME SUCH\nwording as, \"Listen to WKAR-»AM-FMU and listing frequencies, too. Busy\nsummer. Bob?\nSpeaking of promotion, here’s a memo I sent Board members recently:\nIf we are to obtain greatest good for the good cause, NAEB\nNEEDS TO KEEP IN MIND:\n1. Good candidates for Fulbright Scholarships in countries\nWHERE WE HAVE BEEN, WHERE MASS COMMUNICATIONS CAN BE A CONTRI¬\nBUTION IN THE INTERNATIONAL WORLD.\n2. Have some places in educational institutions where so-called\nRETURN—FulBRIGHTS CAN BE USED. We NEED TO HAVE PLACES FOR RADIO—\nTV PEOPLE FROM THE UNITED KlNGDON, ITALY, FRANCE, AND PERHAPS\nothers. These may be obtained for periods of three to twelve\nMONTHS.\nWhat can you suggest to help?\nAnd, NAEBer, what can you suggest to help? It’s an important area in\nWHICH NAEB SHOULD BE A CONTRIBUTING FACTOR.\nSome of you probably have heard ’’American Adventure11 on NBC, Thursday\nevenings. An NAEB grant-in-aio series from the University of North\nCarolina.\nSome of the NAEB committees have been busy this summer, too. Grants-\nIn-Aio committee met in Chicago, August 10. Bill Harley has his TV\nProgram committee on the hop. Ken Wright’s Raoio Network Program\nPlanning sub-committee has been busy. And, I think Bob Schenkkan not\nonly has his committee busy, but he’s busy, too.' He moves from North\nCarolina to Texas. The Public Relations committee met in Chicago in\nconnection with ACPRA convention there. General chairman of that con¬\nvention was NAEBer Stew Howe of the Illinois Institute of Technology.\nThe Engineering committee had a meeting not so long ago, out of which\nCAME TWO REPORTS."
}