{
  "id": "d1577-1",
  "text": "PRESIDENT’S PAGE—II\nNow, some other items. Since last I conversed with you in the NEWSLETTER, I’ve\nbeen a number of places, seen lots of you. Sorry I haven’t seen all of you, but\nwe can get together at the convention in Chicago, October 26-29, at the Del Prado.\nI attended Earl Wynn’s Region II conference at Atlanta on April 1 and 2. It was\na good meeting, and Earl will have some report material which we’ll pass along in\ntime. A week later Skornia attended Region I meeting in Amherst. Then, on April\n13 I attended luncheon meeting of Marguerite Fleming’s Region V. We had a good\nsession and I believe that Region already has in motion plans for another, perhaps\nin connection with the national convention.\nIncidentally, Wednesday, Oct. 26, luncheon time at the convention is open. Some\nof you may wish to arrange regional luncheons. Or, come in early for regional meet\ning. Convention opens at 10 a.m., Wednesday.\nYour Board of Directors met at Columbus and was able to finish up business from an\nagenda with some 26 items. Might have been 23 or 25, but it was a pretty crowded\nagenda.\nBefore the Board meetings, and before the Institute, the NAEB Advisory Committee\nto the President of the Educational Television and Radio Center had a very fine\nmeeting. We all agreed upon a number of things that will b e helpful to Center\naffiliates, to NAEB, and to the Center, and as things move you'll hear about them.\nJust one thing, for example. NAEB has many members who are not affiliated with the\nCenter because they are not now operating stations. And, the Center deals closely\nwith its affiliates. By co-ordianting program information between Center Program-\nCo-ordiantor Bob Hudson and Bill Harley’s TV Operations (and maybe we ought to\nchange it to TV Program Committee) we can be helpful to each other. Bill can\nchannel to Hudson, Hudson to Harley, program ideas.\nAnd in connection with program ideas I have asked Harley's committee for TV, and\nKen Wright's committee for radio, to provide one good program lead (program or\nseries) for inclusion with mailing NEWSLETTER each month. These will be separate\nso they can be passed along to program people if the boss is prone to take too\nlong to read the NEWSLETTER. Ken Wright and I had discussed this proposal at Atlan\nta. Everyone I've talked with, including the Board members, thinks this can be an\nadditional service to members, and all for the good.\nMore progress has been made on the convention program, too, and Chairman A1 Partr^c.\nwill be getting dope to you before the end of May so you'll have it before you\nleave your job for the summer—in case you do. In this connection, I’ve been to\nNew York. And I've been to Washington for meeting of JCET.\nIf you’ve read this far, maybe you've read enough, so I'll sign off. I'll be back\nnext month. Meanwhile, if you think I've overlooked tending to any of NAEB busi¬\nness, just let me know. Or, just drop me a note, or a picture like the one I\nreceived from Vern Bronson today.\n—Frank Schooley"
}