{
  "id": "d1575-2",
  "text": "NAEB NEWS LETTER ..... March 1, 1941 .. Page 3\nDel Peru, Lima, Peru, writes:\n\"I beg to inform you that I have been commissioned by the\nPeruvian Government to organize and to direct a permanent\nweekly broadcast,in English destined to inform the American\npublic about Peru, its history, culture, folklore, topo¬\ngraphy, social institutions, business opportunities and\nrequirements, art, music, etc. Every week, my collaborators\nand myself, will strive to give a varied, lively, picturesque\nsummary of various aspedts of Peruvian life and lore and to\ndescribe some particular region or city of Peru.\n“These half-hour programs will be broadcast every Monday at\n10:30 p.m.. New York time, through Radio Nacional del Peru,\nwave length 49.62 meters, frequency 6082 kilocycles, and\nwill consist in concerts of g«3nuine Peruvian music and in\ninformal talks in English.\n“A Peruvian by birth and a writer by profession, I have\nresided for fifteen years in the U.S.A. My translations of\nTheodore Dreiser, Sherwood Anderson, Louis Bromfield, Ernest\nHemingway, Willa Gather and other prominent American writers,\nhave contributed towards making them known abroad. My\nAmerican wife, Florence Nelson Llona, a.lso a writer and a\nnewspaper woman, will more particularly speak about the\nPeruvian woman of today, her horse and social life and al\nthe aspects of Peruvian customs and activities that are likely\nto interest the woman,of the TJ.S0\n“We should consider it a greet favor U^you would kindly give\nthis announcement out!to your public an* tnank you cordially\nin advance. We also would appreciate a4y suggestions or\ncriticisms you may care to send us concerning our programs,\nmi aBsS. you that anything you may write us in that respect\nwill receive our most earnest attention. Please direct all\ncommunications to me.\"\nFOC ACTIONS\n7/BAA Purdue University, was granted permission to operate\nspecial nighttime hours in order to broadcast sports events.\n(2/18/41)\nY/TAW, Texas A & M, applied for modification of construction\npermit for increase in po-^r and change in frequency. (2/20/41;\nWNYE, Board of Education, New York City, resubmitted its\napplication for a construction permit to change frequency\nfrom 41,100 ko to 42,100 kc, increase power to 1,000 watts\n8nd install new equipment. (2/24/41)"
}