{
  "id": "d711-101",
  "text": "L\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nRepresenting~iton»cmnTitervial,‘ educational AM; FM, attd TV br(m<hasting^ytajiortS,'tmrks-hops, /\nand production centers, owned and operated by colleges, universities, school systems, and public service agencies.\nmi-vm\nWISCONSIN TV SEMINAR'\nFrom June 21 through June 27 a group of some forty leaders of American educa¬\ntion and foundation groups met together at Madison, Wis., to discuss and work\nout plans for the educational future of American television.\nStaying at Lincoln Lodge on the University of Wisconsin campus, the group, with\nsponsorship by The Fund for Adult Education, enjoyed the hospitality of the Wis¬\nconsin Radio and Station staff, headed by Harold McCarty, Harold Engel, William\nHarley, and kept' on schedule by Frank Schooley, who set a masterful level of'or¬\nganizing the conference and seeing that it achieved its goals.\nCopies of the principal talks and summaries of the various discussions and work¬\ning committees, ..being edited by Burton Paulu, will be published and distributed.\nFor the time being, it should be recorded that all participants spent virtually\nall their waking hours, which was most of the time, in either listening, dis¬\ncussing, or drawing up reports.\nHighlights of the seminar included talks by Professors Harold Lasswell of Yale,\nDonald Horton of Chicago, Edgar Dale of Ohio State, Lorentz T. AdClfsoft of\nWisconsin, and'“Dale Harris of Minnesota* * We-were also very fortunate to have-\nPresident (now of Oregon) Harry Newburn, newly elected head of the Educational\nTelevision and Radio Center, Mr. G.ft. Griffiths of the FAE, and Mr. William\n-McPeak' of. the: Ford Motor Company. Fund in “attendance.Their .informal comments,\nand encouragement helped immeasurably with the encouragement of the approximate¬\nly forty participants in attendance.\nFull minutes, which will be distributed within the next few months, will con¬\ntain the full roster. of participants as well as the minutes as listed .above.\nit it a # a a #.# # * n a n ##.* # # it it. it it £ # a it a it * * # ** # # n % a #\n# n;.' ;. -/ IN THIS ISSUE ■ l\n^ .. . .... . . v 1 . . \" * .. #\n# Bibliography & Calendar ofEvents.... .2 Help & Positions Wanted..........19 #\n^ ^\n# Cojast to Coast.. ./**.... *.9 List of Ed.* TV Applicants........17 #\n# Educational Clippings.... 22 Tape Network News. *10c #\na ‘ *\n# Executive Director’s Page......3 Television Section...........11 #\nit it a it V * it # 4 it it “a a it n it it it it a it it a it a it it a it it a n it ,a it it it it\nThe Newsletter is now edited at'Headquarters. All editorial material should be\nsent to NAEB Headquarters, 14 Gregory Hall, Urbana, Illinois.\nThe N-A-E-B NEWS-LETTER, published monthly, is distributed from\nthe national headquarters office at the University of Illinois. N-A-E-B\nmembers and associate members receive the NEWS-LETTER as part of\nmembership service. Non-members may obtain the publication at a\nsubscription rate of $5.00 per year. All inquiries regarding subscriptions\nand distribution should be addressed to: NAEB, 119 Gregory Hall,\nUniversity of Illinois, Urbana, Illinois. Editorial copy and inquiries\nconcerning editorial matters should be sent to the Editor, Burton\nPaulu, Station KUOM, University of Minnesota, Minneapolis 14,\nMinnesota."
}