{
  "id": "d711-103",
  "text": "EXECUTIVE DIRECTOR PAGE\nGreetings! I hope you’ll excuse this brief, informal salutation from your new\nExecutive Director. I arrived in time to get to work June 1. Since much of\nthe orientation I need can be secured only by travel, however, I took off again\nafter a few days to visit as many stations as possible. As this Newsletter is\ngoing to press, I’m off on the second part of this visitation which the FAE\nprovided a study grant to make possible. I hope that both the Headquarters and\nI personally will be better settled in another month or so.\nThe departure of Lorraine Linden to follow her husband a few d ays after I had\narrived, and before I had been able to be in the office more than a few hours\nto learn procedures, left the office without the experienced secretarial head\nit has had for the last year. Consequently much of my time has been spent in\nlearning procedural details and trying to find someone to fill her position.\nPersonally, the Skornias have made a down payment on a house and hope to move\nto Champaign from Bloomington, Ind., on or about September 1. That should\nmark the beginning of a more settled period all around.\nJim Miles and Frank Schooley, who have the background I need, are both helping\nme to avoid too many obvious mistakes at the outset. My sincere thanks to\nthem, to my staff for its patience, and to you for your understanding, in case\nall doesn’t yet seem quite as well organized as it should be. Herewith, then,\nwith actual running-off and mailing to take place while I’m on the road again,\ncur first Newsletter. Frank Schooley has finished up the May and June issues\nso this should bring us up to date again.\nThe results of my visitations around the country will be held for next issue.\nThis next issue may be caught in the summer doldrums, so please send in the\nmaterial.\nRemember.July 7, 1952: ’’July 3rd was D-Day at Headquarters. At or about\n6 p.m. a University of Illinois truck, which was previously sent to Chicago,\npulled up at the back door of Greg Hall and delivered one beautiful Toogood-\nSmith Mass Duplicator. Rawdon Smith accompanied the delivery and spent all day\nthe 4th with Bob Johnston perfecting the installation. Johnston is running\nsome checks of his own and promises that we will be doing an increasingly\ngreater amount of work on the duplicator so that the end of July or perhaps a\nlittle sooner should see us completely free of the old method of duplication.”\nUnder separate cover, active and associate members should now have received\nthe ’’Report by the Engineering Committee” and other television materials. Hope\nyou look over these significant items dealing with television with care.\nRE THE FULBRIGHT SCHOLARS\nUnited States approval of the Fulbright scholars approved by NAEB has been\nreceived, and only formal approval from the exchanging countries is now awaited.\nHowever, pending such approval, no announcement can be made. We are awaiting\nthis word momentarily, as we go to press."
}