{
  "id": "d711-104",
  "text": "-4-\nRADIO AND: TELEVISION EDUCATORS ATTENTION\nThe president of the University*of Oregon, Dr. Harry Newburn, has been chosen\nto head the new Educational Television and Radio Center in Chicago. The choice\nwas announced by the chairman of the Center, Dr. George Stoddard, president\nof the University of Illinois. Financed by a $1,500,0(30 grant for adult\neducation,‘ the Center will serve as a clearing house fcr educational television\nand radio, programs.\nWith this-announcement, one more step was taken toward the development of\nsound educational direction, guidance, and programs for America, and a model\nof a new approach for the rest of the world to see as it faces the new colossus\nof the media — television. What are you doing to explain the critical needs\nof educaticn for TV in your area? If NAEB of JCET can help, let us know.\nThe address of the new center, THE EDUCATIONAL TELEVISION AND RADIO CENTER,\nis to be 231 South LaSalle Street, in Chicago. Its goal is to help both\neducational radio and television stations.\nPROJECTION OF AMERICA\nAccording to an AP dispatch from Washington, the president of the World Wide\nBroadcasting System, Walter Lemmon, had a talk with President Eisenhower on\nJuly 1 about international broadcasting. Quoting the AP dispatch:\n\"Lemmon told reporters the President described himself as very anxious\nthat short-wave broadcasts to Latin America should continue. Lemmon,\noperating from Boston, has been beaming programs to Latin America for\nrebroadcast by local stations for some time. He is stepping up this\nservice as a result of the Voice of America’s withdrawal from the Latin\nAmerican field. His network now broadcasts such sponsored and unsponsored\nprograms as baseball games, lessons in English, and business surveys for\nLatin American businessmen,\"\nSENATE PASSES BILL TO GIVE BOOK RATE TO EDUCATIONAL FILMS\nThe Senate has passed a bill (S. 971) to authorize the transmission through\nthe mails at book rates, of films and related matter for educational use.\nSenator Carlpon of Kansas, its author, said the bill would simply bring the\nlaw up to date by giving films for educational use the same mailing privileges\nas books. The will not apply to films for commercial use.\nThe bill simply says that the book rate will apply to \"16 mm. films, film\nstrips, projected transparencies and slides, microfilms, sound recordings, and\ncatalogues of such materials when sent to or from schools, colleges, univer¬\nsities, or public libraries, and religious educational, scientific, philan¬\nthropic, agriculture, labor,veterans,or fraternal non-profit groups. Hearings\non an identical bill are expected in the House soon.\nQUOTE FROM FORD FOUNDATION ANNUAL REPORT FOR 1952\n\"It has been a general policy of the Foundation to seek new approaches to what\nare actually old problems of human welfare. We have sought out, or selected\nmeritorious projects that could not be undertaken at all or so well without such\nassistance. In this process, we have attached great value to the likelihood\nthat, a project might inspire other efforts in the same direction and earn future\nsupport from other sources.\""
}