{
  "id": "d711-110",
  "text": "-10-\nTAPE NETWORK NEWS\nThe NAEB Tape Network Hdq. would like to thank all stations for their cooper¬\nation in the matter of tape returns. Back tapes have been returned, several\nweeks have passed since Hdq. hit its distribution peak for the first half of\n1953, and a number of stations have stopped operations for the summer. These\nfactors have enabled the Network to slowly build up its tape stock—and at\npresent we do not have to worry about having enough tape to distribute the\ncurrent issue of programs.\nLike personnel of NAEB stations, members of the Hdq. staff are all trying to\nsqueeze out a few days to suffer from the heat in relative peace. Roz Biason\nwent to Chicago; Carl Clausen, our recording engineer and guardian of our\n’’monster” (duplicator) went to Wisconsin; Mr. and Mrs. Jim Fink spent a few\ndays in Freeport, Illinois. Mrs. Gertrude Balthazar accompanied her husband\nto the’ Pennsylvania State College for a few days; and John Holt recently\nreturned from Taos, New Mexico, which he thinks would make an excellent cite\nfor Network Hdq.\nThough'the summer season has hardly begun, arrangements are already oeing made\nfor the release of fall series. Several series will probably be added to the\nnetwork schedule before autumn. Within a few days distribution of a series\nof French classic dramas recorded by the Comedie Francaise will begin. A\nseries of programs from French music festivals and another on famous French\nwriters will be offered. Once again, Music From Interlochen will be made\navailable to Network stations. WNYC, New York City, will furnish programs\nfrom its First Annual Festival of Books.\nStrictly personal\nA few days ago, Headquarters received an announcement from and about Terry\nLinder, whom most of you will remember as the first NAEB Tape Network Manager,\nwhile the Tape Network was centered at WNYC. Here is a facsimile of the\nannouncement.\nS’Sd\n(D XJ to\n*3 -P S3\n■rl lf\\ <D\nCO C** Tj\n'd ?h\n<D Cd\nWHO\nS© q- >\nvt ©\nH «\nTerry and Ben Linder\npresent\n’•IT’S A GIRL\"\nstarring\nCathy Laura\nMay 29, 1953_6:34 P.m.\n_Directed by Dr. Peck__\nManagement reserves the right to cancel\npersonal appearance if star is sleeping.\nSince the announcement contains an address, any of you who wish may address\nTerry, Ben, and Cathy Laura directly. Meanwhile NAEB’s collective best\nwishes, and a copy of this Newsletter, are being sent to the Linders."
}