{
  "id": "d711-111",
  "text": "-11-\nTELEVISION SECTION\nINTERNATIONAL TOWN\nWayne University, Detroit, has just sent out an attractive brochure posing\nthe question: ‘’Given the Money.,,.Can Educational Broadcasters Achieve High\nProfessional Standards?” The question is answered by picturing the TV TODAY\nAnnual Award to Wayne University's International Town over WWJ-TV, which has\nreached approximately 150,000 people each week.\nQuoting from the brochure:\n”International Town was made possible through a special Grant-in-Aid from\nthe National Association of Educational Broadcasters and the Fund for\nAdult Education, an independent organization established by the Ford\nFoundation. Wayne University is proud to have been selected as the\nrecipient of one of six such awards granted throughout the country.”\nCOMMERCIAL BROADCASTERS THANKED\nIn recognition of his assistance to the Joint Committe on Educational Television\nand the cause of educational television, JCET Executive Director Ralph Steetle\non June 4, sent the following letter to Harold Fellows, president of the Nation¬\nal Association of Radio and Television Broadcasters:\n”A year has now passed since the effective date of the FCC's Sixth\nReport and Order. The Joint Committee on Educational Television is\npleased with the progress in television made during this short per¬\niod of time. We note that more than 600 applications for commercial\nstations have been filed and more than 350 applications have been\ngranted. 189 commercial stations are actually on the air and many\nothers will soon be in operation. All of this is areal tribute to\nAmerican initiative and enterprise. We extend to the broadcasting\nindustry our congratulations and best wishes.\n”The JCET is naturally proud of the progress educational television\nhas made during the past year. As of this day 47 applications for\nnon-commercial educational television stations have been filed and\n17 been granted. One station is already in operation and several\nothers will soon be on the air.\n’’Particularly heartening is the fact that most of these educational\napplications show solid financial and community support. In this\nconnections, the JCET is especially grateful to many commercial inter¬\nests in this country....One of the most recent examples of this\ngenerosity is the offer of the Storer Broadcasting Co. to provide a\ncomplete transmitter and antenna to help establish an educational\nstation in Birmingham, Ala.\n\"It is impossible, of course, for us to thank individually all of\nthe commercial interests in this country that have contributed and\nwill continue to contribute to the development of educational tele¬\nvision. However, I am directed by the JCST to take this opportunity\n(Continued on next page)"
}