{
  "id": "d711-112",
  "text": "-12-\nto thank you as the president of the National Association of Radio\nand Television Broadcasters for the. splendid help many of them have\ngiven to educational television and ask that you advj.se them of our\ngratitude.\n\"By continued cooperation between educators and commercial interests\nsuch as has been exhibited the past year, we can be assured that the\nAmerican people will receive the finest television service possible.\"\nDISPUTED CHANNEL SAVED FOR. EDUCATIONAL USE\nWashington—(AP)—The Federal Communications Commission announced it has re¬\nfused again to reconsider its decision to dismiss the application of Hearst\nRadio, Inc., for a television station in Milwaukee on Channel 10. The\nCommission reiterated that the channel is reserved for non-commercial, edu¬\ncational use and that the Hearst commercial application cannot be considered.\nILLINOIS PARENTS-TEACHER- ASSOCATION BACKS EDUCATIONAL TV\nThe Illinois PTA approved a resolution backing an educational television\nprogram for Illinois at the meeting in Chicago on June 12.\nMrs. Elizabeth E. Marshall, chairman of the PTA Board of Managers, said the\nPTA planned to \"get the ball rolling\" by building community strength. Mrs.\nMarshall said fall conferences with panel groups would be held, and that each\ncommunity would work with Rotary clubs, Girl Scouts and other civic groups to\ngain support for state-wide educational television.\nWISCONSIN TV OKAYED\nLate in May, 1953, the Wisconsin state legislature okayed a bill authorizing\nthe building and operation of a television station at the University of Wiscon¬\nsin at Madison. The story behind the bill is highlighted by controversy and\nclashing interests, dissolving into compromise, and culminating in cooperation\nof the finest type.\nImpetus for further TV development in this session of the Wisconsin legislature\ncame from the Wisconsin Citizens Committee for Educational Television, a \"grass\nroots\" organization which includes farm, labor, educational, professional, and\nbusiness groups throughout the state. It publicized the need for educational\nTV stations in Wisconsin, insisted that Wisconsin should not let what might\nwell be the richest opportunity in history go by the board.\nThe original TV bill provided $625*000 for construction and operation of ini¬\ntial units in a statewide network. At a public tax hearing those who expressed\nan opinion of the bill were 8-1 in favor; however, the taxation committee voted\nto kill the bill, 6-2.\nA rescflution. was made requesting the FCC to continue the reservation of the 12\neducational TV allocations in Wisconsin. The request for reservation was\npromptly made by Gov. Kohler and was followed by application for Channel 10\nin Milwaukee and for Channel 21 in Madison. H.B. McCarty, director of WHA,\npointed out that if the state acted now, it could qualify for a $100,000 gift\nfrom the FAE which would cover the cost of all the equipment; he urged that the\nstate appropriate $75,00 for operation of a station on a limited schedule.\nSen. Warren Knowles introduced a bill embodying these provisions; usual proced¬\nures were dispensed with because of the urgency to file with the FCC, and the\nbill was passed."
}