{
  "id": "d711-113",
  "text": "-13-\nOKLAHCMA LEGISLATURE FIRST TO ESTABLISH STATE-WIDE EDUCATIONAL TELEVISION\nGov. Johnston Murray of Oklahoma on May 18 signed legislation authorizing the\nfirst state-wide educational television system in the nation. The bill makes\npossible a ten-station network, with stations to be located in Oklahoma City,\nTulsa, Muskogee, Tishmingo, Clayton, Woodward, Enid, Lawton, Elk City, and\nGuymon.\nThe law provides for a 13-member Educational Television Authority including\nthe president of the University of Oklahoma, the president of Oklahoma A & M\nCollege, the State Superintendent of Public Instruction, the Chancellor of the\nOklahoma State Regents for Higher Education, and representatives of other\npublic and private educational institutions of the state. An Advisory Commi-\ntee of not more than 35 persons will be organized and selected by the Author¬\nity from members of civic and business groups.\nThis positive action by the Oklahoma legislature is the third big step taken\nby that state toward educational television. In 1951 the legislature by\nformal resolution, requested the FCC to reserve ten t elevision channels in\nthe state for educational use; in 1952 Governor Murray called a conference on\neducational television.\nEDUCATIONAL TV-ERS NOTE\nThe FCC said it has returned the application of San Antonio Council for\nEducational Television for educational channel 9 at San Antonio, Texas,\nbecause of discrepancies in dates in the application.\nCHICAGO FUND DRIVE RAISES $325.000\nWith contributions coming in every day and enthusiasm growing steadily, the\nfund-raising campaign of the Chicago Educational Television Association is well\non its way to final success. Volunteers working within a sixty-mile radius of\nChicago have collected $325,000 for Channel 11 since May 10 when the campaign\nwas launched officially. Their goal is $800,000. To establish the station and\noperate it for two years, $1,100,000 is needed. The Fund for Adult Education\nhas pledged $150,000 and the Chicago Board of Education has promised facilities\nworth $150,000.\nExecutives, \"1end-1eased11 to the drive by their corporations, helped to organ¬\nize both the special gifts and community drives. Some of them will be with\nthe campaign until its close. Edward L. Ryerson, executive committee chair¬\nman of the Inland Steel Company, has acted as director of the drive. He is\nalso president of the Association.\nThe PTA, Boy and Girl Scouts, television and radio stations, and Chicago\ndaily papers have cooperated generously by furnishing personnel, spot announce¬\nments, special TV shows, coverage, publicity, and editorials on the campaign.\nEvery contributor to the campaign receives a certificate naming him a charter\nmember of Channel 11. One gift of $1,000 and hundreds of smaller ones have\ncome in unsolicited through the highly-publicized Post Office Box 1100.\nPLAN TO ATTEND THE 1953 CONVENTION AT NORMAN, OKLA."
}