{
  "id": "d711-119",
  "text": "HELP WANTED and POSITION WANTED\nTraffic Manager-Script Writer Wanted\nRadio and Television Broadcasting Services, Radio Station WUOA (FM), The\nUniversity of Alabama* Approximately ^165,00 per month. Must have an A.B.\nDegree. Will be able to work toward a Master’s Degree in the extent of one\ncourse per semester. Twelve months’ job. Interested applicants apply immed¬\niately with ful particulars to: Mr. Graydon Ausmus, Director •\nRadio and TV Broadcasting Services\nBox 2002\nUniversity, Ala.\nProduction Director Wanted\n1000 watt university educational station. Position requires experience\nin production and script writing, announcing and supervision of student staff.\nCollege degree with midwestern background. Knowledge of all types of music\ndesirable. Send disc, scripts, and complete information to:\nRadio Station KUSD\nUniversity of South Dakota\nVermillion, South Dakota\nInstructor in Radio and Public Speaking Wanted\nTo being September, 1953* University of Kansas City, Kansas City, Mo.\nDuties: Teaching two sections of Radio or Speech and Discussion and assist¬\ning in the technical and programming activities of the department. Contact:\nMr. Henry M Mamet\nDirector of Radio\nUniversity of Kansas City\nKansas City, Mo.\nCommunications in Education Major: Masters degree, N.Y.U.; desires position\nwhere education and experience in administration and personnel can be utilized;\n3 years Special Service exp. Germany post-war; attractive, personable. Contact,\nFREDERICKA APPLEBY, 810 Broadway, Newark, New.Jersey; Humboldt 5-4582.\nFLORENCE E. BAYREUTHER, 3422 Brown St., N.W., Washington, D.C., Adams 2-1490.\nA.B. degree and graduate work in English literature with a minor in music.\nPrivate voice, speech, and piano lessons. Student at Berkshire Music Festival,\nSummer School, 1943. Writer, Producer, Director. Built and presented.l5-min-\n*ute radio show to portrary \"People Working Together to Realize Democratic\nGoals.” Doing this show, C0-0PA AT WORK, now in 140th week over WCFM, Washington\nHERBERT BRENNAN, 1315 Gordon St., Hollywood 28, Calif.; Granite 0531* Training\nin Radio, Television, Theatre, and Film. Six year’s experience in theatre and\nradio, three year’s experience in television—production and acting. Has been\nassociated with”Eternal Light,\" \"Sunny Side of the Atom,\" \"Connecticut Play¬\nhouse, \"\"Randall Playhouse,\" and miscellaneous programs in radio as production\npersonnel and actor. Exp. as TV floor manager, camera, recording and directing.\nMore detailed information sheets available from NAEB Hdq. or from person."
}