{
  "id": "d711-120",
  "text": "POSITIONS WANTED (Con‘t)\nChairman of small college radio-TV department seeks writing-production-teaching\njob with school offering challenging, creative opportunities. Thoroughly roun¬\nded in all areas of communication; M.S., B.S.; newspaper and commercial radio\nbackground; widely traveled. Hold national SDX and AER writing awards; co¬\nauthor of popular radio text; writer-director of numberous top quality educa*^-\ntional- and public interest shows for both educational nets and commercial radio\nstations. Excellent references. For further information contact the Newsletter,\nPositions Wanted Column, Dept. B.\nPATRICIA COLEY, 209 Mclver Dormitory, University of North Carolina, Chapel Hill,\nN.C. A.B. Degree in Radio. Main interest is in Children's Radio and Theatre.\nExperience in adaptation of children's literature, production of children's\nradio programs and films.\nCollege radio director with three years experience considering other offers.\nBackground includes varied production, news, continuity, and teaching assign¬\nments. Some metropolitan and commercial experience. Strong on creative writing.\nGraduate degree in music and radio from leading university. Producer of an\nNAEB Tape Network series. For further information please write the Newsletter,\nPositions Wanted Column, Dept. E.\nJAMES FISHER&NORTHROP, 142 E. 49th St. New York City. Age—37, married. Educa¬\ntion: A.B. 1937, University of California; General Secondary Teaching Creden¬\ntial, 1938; Pasadena Community Playhouse, 1939, 1940. Experience: 9 years in\nbroadcasting. Production Manager f or Voice of America, formerly served as pro¬\ngram director. Experience in promotion, announcing, writing, and acting. 4§*\nyears experience as instructor of history, English and radio.\nWriter and producer for Protestant Episcopal Diocese of New York wants educa¬\ntional TV position. A.B. Smith College, graduate work at Columbia University.\nThree years experience with New York advertising agencies helping produce\nradio programs. Will travel. For more details write to JUDITH W. GAYLOR, 504\nW. 112th St., New York 25, N.Y.\nWILLIAM D. HAZ WARD, 204 Fourth Ave., East Orange, N.J. Age-25, Married, 2 chil¬\ndren. Education: Bachelor of Music Education, Oberlin College; M.A. (Communi¬\ncations), NYU, '53. Experience: Radio Assistant, Ooerlin College Dept, of\nSpeech, 1951-52; producer-director of five -^r-hour weekly series (music, docu¬\nmentary, dorum, dramatic, etc.) over WEOL. Wrote three series of music-educa¬\ntion programs for in-school listening. Closed-circuit television production-\ndirection experience, WPIX, SRT-TV, NYU. Desires position in educational radio¬\ntelevision station, preferably in the East.\nLOUIS LANDMAN, 711 State St., Madison Wis. Age-26, unmarried. Naval service\nduring World War II. Education: A.B. in American Institutions from University\nof Wisconsin, 1948. Candidate for M.A. Experience: 4 years with WHA, University\nof Wisconsin in programming. 3% years commercial experience at WIBA, Madison;\nWERC, Erie, Pa. as announcer, newscasting. Particularly interested in produc¬\ntion and program planning. Audition and pictures available.\nKARL B. LOHMANN, JR. 21-E-3 Sheridan Village, Schenectady, N.Y. B.S. University\nof Illinois, M.S. Audio-visual education, Indiana Univ. Exp. in newswriting,\nfeatures, photography; in producation, promotion, etc. of audio-visual aids;\nin commercial television. At present doing advertising and sales promotion at\nGeneral Electric. Further information upon request."
}