{
  "id": "d711-121",
  "text": "POSITIONS WANTED (Con't)\nHANS LYND, 470 N. Broadway, Yonker^, N.Y.; I® 3-1639^ married. Education:\n‘‘LL.D., University of Basle, Switzerland. Exp.; U.S. War and State‘Depart¬\nments. Skilled in analysis and evaluation of trends as©pressed through\nmedia. Radio Officer in charge of radio broadcasting activities in Bavaria.\nMotion picture industry: free lance reader, writer, translator for most major.\nWest Coast studios. Affiliated with ASA-Film Co. in Copenhagen, Denmark as\ncutter, writer, assistant director. Languages: German, Danish, Swedish, Nor¬\nwegian, French.\nProgram writer for Chicago agencies desires position in educational television.\nEducation: University of Illinois and University of Chicago. Experience:\nOn staff of Chicago TV station for three years as writer, producer, and direc¬\ntor. For name and address please write Newsletter Positions Wanted, Dept. M.\nExperienced script writer and production director considering other offers.\nEducation: B.A. degree from midwestern University. Experience: three years\nas vriter director with university station. Has written history, dramatic, and\nchildren's radio programs. lias produced all types of programs. Experience\nin news writing, continuity, announcing, and acting. For name and address\nwrite Newsletter, Positions Wanted, Dept. R.\nKENNETH A. WHEELER, c/o Station WBET, 60 Main St., Brockton, Mass. At present\nstation director of WBET and WBET-FM. Sixteen years experience in radio. In¬\nterested in position in educational television. Extensive experience as speak¬\ner. Character and qualifications available writing to above address.\nMILDRED WOLFE, 502 V/. Orange St., Lancaster, Pa. Desires position in educa¬\ntional radio and TV. Education: M.A. Temple University. Experience in\npublicity and continuity. Has library training and enjoys doing research work.\nWoman wishes work in production, direction, writing, etc. with educational\nradio station. B.S. in Education Fordham University, N.Y., 1952; two years\nwith WFUV, N.Y., as dramatics director, producer, and writer of programs\ndealing with cultural arts. Good background in theatre. Have done sales,\npromotion work in TV. Licensed elementary school teacher with experience.\nFor further information and references contact, Newsletter. Position Wanted,\nDept. Y.\nGEORGE B. ZUKERMAN, 3990 Saxon Ave., Bronx, N.Y. Age -27, married. Education:\nA.B. in English, Queens College, 1949; courses towards Masters at N.Y.U. Exper¬\nience: Editorial work with news service. Television commercial writing; pro¬\ngram annotation for musical program New Chamber Music Society over WNYC;\nproduction assistant and technical coordinator with NBC-TV. Extensive back¬\nground in music. Taught at Adelphi College Summer School of Music. Especial¬\nly interested in work in educational radio and television.\nNEW BOOK.\nEducators Guide to Free Films. 13th Annual Edition, 1953.\nHorkheimer, Mary Foley, and Diffor, John W.\n516 page§, 2574 titles, 562 of whichare new. List price, $6.00\nEducators Progress Service, Randolph, Wis.\nThis guide to films contains titles and sources for free films in the fields of\nthe applied arts, fine arts, health education, science, and social studies. The\nentry for each film gives film size, sound or silent, color or black and white,\nsource, and number of reels. Entire volume thoroughly indexed."
}