{
  "id": "d711-122",
  "text": "-22-\nEDUCATIONAL GLIPPIIIGS . . . .EDUCATIONAL CLIPPINGS .... EDUCATIONAL CLIPPINGS\nPLANS FOR A NEW YORK CITY EDUCATIONAL TV OUTLET ARE SLOWLY TAKING FORM by\nJack Gould\nWhat about an educational television station for New York City? What’s happened\nsince the plan of the New York State Board of Regents for an educational TV net¬\nwork met an untimely demise in Albany?\nThe encouraging word is that plans for a local educational TV outlet are very much\nalive, in some ways perhaps more alive than ever before. There still is a fabu¬\nlous amount of hard work and perhaps many disappointments ahead before local edu¬\ncational TV becomes a reality. But things are beginning to move.\nAn interim report on the status of educational TV was provided last week at a\nprivate dinner at the Hotel St. Regis under the auspices of the National Citizens\nCommittee for Educational Television, of which Dr. Milton S. Eisenhower, brother\nof the President, is the head. Here is how the situation now looks:\nIt now seems abundantly clear that, with the exception of one or two states, edu¬\ncational TV is not going to succeed if it must depend on appropriations from\nstate Legislatures. Politically, it’s just not in the cards to expect allotment\nof state funds.\nAs originally conceived, the Board of Regents plan may be regarded as a dead\nissue and there’s litt3.e point in holding post-mortems. Where the board envision¬\ned starting with a network, now it is clear the individual local station must\ncome first.\nThe revised approach to educational TV in New York City is to operate a station\nas a privately sponsored project. To this end there has been set up the Metro¬\npolitan New York Educational Agencies Committee, headed by Dr. David Henry, ex¬\necutive vice-chancellor of New York University, and the New York Co-ordinating\nCouncil for Educational Television.\nThe over-all approach of Dr. Henry and his colleagues is to establish a non¬\nprofit corporation, enjoying broad community representation, which would run\nthe educational TV outlet.\nWhile direct school use of such a station and adult education programs would\nbe an inherent part of the programming, such a station in Dr. Henry’s eyes\nwould clearly reflect more than just the strictly academic point of view.\nIn the larger sense it would be genuinely a community station bringing to\nmetropolitan audiences all the facets of local life which it \\/ould not be\npossible for commercial stations to offer at good viewing hours and with sus¬\ntained continuity.\nThe hopes of Dr. Henry and the National Citizens committee are to enlist, in\naddition to educational groups, the support of leaders of industry, commerce\nand the arts. Just as so many business men have assumed a role of leadership\nin many major cultural and educational causes, so it is believed that they can\nplay a similar part in educational TV. In many cities throughout the country\nthat already has been the case.\nIn a matter of a few weeks—perhaps days—there is reportedly a good chance\nthat the Fund for Adult Education, established by the Ford Foundation,"
}