{
  "id": "d711-125",
  "text": "-25-\nUNYC OPERA FESTIVAL WILL BEGIN OH MONDAY\nSecond annual Opera Festival of WNYC will be launched Monday on the Hew York\nmunicipal station. Continuing through Sunday, June 7, the week-long series will\nfeature complete performances of seven well-kncwn operas, an interview with the\nMetropolitan Opera coloratura soprano, Mae. Frieda Hempel, a special program of\nthe works of leading modern composer, GianCarlo Menotti, as well as broadcasts\ndevoted to 17th century and modern American operas, Famous stars of the operatic\nworld will be featured in the recorded broadcasts of the seven complete per¬\nformances, which include \"Don Giovanni,\" \"Wozzeck,\" \"Idomeneo,\" \"Der Rosen-\nkavalier,\" \"Hansel and Gretel,\" \"Tales of Hoffman,\" and \"Die Fledermaus.\"\n(’Radio-Television Daily. May 29, 1953)\nTELEVISION NEWS AND VIEWS by Larry Wolters\nEDUCATION: A preview of what may be expected if and when we get educational\nchannel 11 on the air was provided through the telecast of \"The Independent\nMr. Jefferson,\" presented by the National Association of Educational Broadcasters\nover channel 5 yesterday. With William Prince in the role of Jefferson, this\nplay told the exciting story of the 17 days of the writing of the Declaration\nof Independence. The play was well done, but seemed a little compressed in a\nhalf hour. Our viewing circle was more than a little interested because Robin\nHumphrey, Evanston Township High School English and drama teacher, had the\nleading feminine role.\n(Chicago Tribune, June 8, 1953)\nTV FILMS FROM FRANCE AND ITALY TO BE SHOWN IN UNITED . STATES\nThe day is not far off when there will be world-wide TV film swapping.\nThis has been predicted by Seymour K. Siegel, who represented the National Associ¬\nation of Educational Broadcasters at a recent Paris conference on better use of\nworld communications channels to improve understanding among nations.\nDuring the discussion on the idea of international television exchanges, the\nFrench and Italian broadcasting systems announced they would make available to\nthe United States and others countries two special films on cathedrals of the.\nMiddle Ages and on Egyptian archeology. The latter film will be made by Italians\nin co-operation with the Egyptian government.\nIn return a TV film series to be produced by WNYC, New York’s municipal station,\nwould be made available in Europe. These films would include a study of slum\nclearance methods and public housing achievements in the United States, \"home\nhospital\" practices to extend medical care and the care of a baby.\n(Chicago Sun Timas. May 31, 1953)\nEDUCATORS ACCEPT OFFER OF KYW’ S FM STATION\nThe Delaware Valley Educational Television Corporation has accepted KYW’s offer\nof its TV and FM tower and FM transmitter. The installation is valued at more\nthan $90,000. The Delaware Valley group representing upwards of 100 educational\ngroups has applied for UHF channel 35.\n(Radio-Television Daily. June 30, 1953)"
}