{
  "id": "d711-128",
  "text": "-28-\nWALER RETIRES TODAY AS FCC COMMISSIONER\nFederal Communications Commissioner Paul A. Walker, whose term of office expires\ntoday, reiterated yesterday that he has \"purposely and deliberately avoided\"\nmaking plans for the time when he is no longer a member of the Commission.\nMr. Walker, who had said weeks ago that he had no plans for the time when he\nsteps down from the commissioner ship, said that he has not even considered future\nconnections during his last few weeks in office because of the importance he\nfelt attached to many decisions coming before the Commission during these weeks.\n\"There might have been some conflict,\" he explained, between any future con¬\nnection and the decisions he was called upon to make in the cases. Therefore\nhe has avoided making any plans until his duties with the Commission are com¬\npleted.\nWhile Walker’s resignation as chairman of the Commission, a job he had held\nsince mid-1951, was accepted several months ago when President Eisenhower\nappointed Rosel Hyde to be chairman of the Commission, no choice of his successor\nas commissioner has been made.\n(Radio - Television Daily. June 30, 1953)\nB»CASTERS PAY TRIBUTE TO FCC’S WALKER: CHARLES GARLAND SEEN AS SUCCESSOR\nPaul A. Walker, who is due to retire June 30, when his term ends, after 20 years\nwith the agency, was honored last week by the National Association of Radio and\nTV Broadcasters’ board of directors.\nIt’s expected that Walker, a Democrat, will be replaced by a Republican in order w\nto give the Administration greater control over agency policies. Under the law\ncreating the Commission, the party in power may have four members on the seven-\nmember agency. The present composition is three Republicans, three Demo¬\ncrats and one Independent.\nMost frequently mentioned to succeed Walker is Charles Garland, general manager\nof Gene Autry’s radio station, K00L, in Phoenix, Arizona. Garland has the backing\nof Eugene Pulliam, Indianapolis publisher, who reportedly has high influence in\nthe Administration. It was expected that Garland would be named to the com-\nmissionership given to John C. Doerfer when former Comr. Eugene Merrill, an\ninterim appointee, was replaced several months ago. However, Doerfer was a\nsurprise appointee who was nominated for FCC after reported souther objection\nto naming him to the Federal Power Commission.\nWalker is the only member of the Commission who has served since its creation\nin 1934. He \\ia.s formerly chairman of the Corporation Commission of Oklahoma,\na practicing lawyer in Shawnee, Okla., a member of the faculty of the University\nof Oklahoma, and a high school principal.\n(Variety. June 29, 1953)\na*#*#*######\nWith This Issue (Con't)\nRCA TV Station Monitors, 1183-T"
}