{
  "id": "d711-135",
  "text": "i\nBackground: Americans might have, a bit of difficulty un¬\nderstanding the character of a journal like the New\nStatesman and Nation of London. Apart from the fact\nthat it is perhaps the most widely quoted of all journals\nof opinion in the world, it might mystify Americans to\nknow that this journal is a combination of a Liberal\njournal established in London in 190G, a Socialist journal\nestablished in London in 1913, and a brilliant young\nTory paper taken over in 1934. To characterize the editor\nof this “mongrel\" would not be easy either. Milton\nMayer interviews the editor of the New Statesman and\nNation. Mr. Kingsley Martin, who has held this post\nsince 1931.\nBackground: Carlo Levi, whom Milton Mayer interviews\nin his studio, was once a physician, but he became\nfamous before Fascism as a painter, and then, exiled\nfrom Rome during fascism, he wrote his first novel:\n\"Christ Stopped at Eboli\". a best seller all over the\nworld. Exactly a week before the collapse of Fascism\nin Italy in 1943, Dr. Riccardo Bauer saw the light of day\nalmost for the first time in 17 years in Mussolini's prisons\nand penal islands. Dr. Bauer became secretary of the\nSocial Museum of the famous Societa Humanitaria, the\nHumanitarian Society of Italy, founded in the last cen¬\ntury as a public organization to help solve the problems\nof workers' lives.\nBackground: In the famous Max Planck Institute for\nPhysics at Gottingen, Germany, Milton Mayer interviews\nProfessor Carl Freidrich von Weizsacker. German schol¬\narship, theology and statesmanship are full of von\nWeizsackers. The one with whom Mr. Mayer talks is\ninternationally known as one of Europe's most distin¬\nguished theoretical physicists. In the little, the very\nlittle village of Patesen, in northwest Germany, Milton\nMayer interviews fhe pastor, Wilhelm Mensching, in the\nstudy of the parish house which is also a farm house.\nWilhelm Mensching is retiring this year as pastor of this\nquiet parish, after 30 years of service, to devote all his\nenergies to the work of the “Freunschaftshiem ..the\nFriendshio Home which he has established in the neigh¬\nborhood for young-people of all nations, races and creeds\nto work together for human brotherhood and peace.\nBackground: In London Milton Mayer interviews Mr. John\nStrachey, a member of the House of Commons: a member\ntoo of a distinguished family of civil servants, soldiers,\nsquires and writers. Mr. Strachey, whose best-known\nbook in America is “The Coming Struggle for Power\",\nwritten many years ago, was Under-Secretary for Air\nin the Labor Government of Britain from 1945 to 194G,\nMinister of Food from 1946 to 1950, and Secretary of State\nfor War from 1950 to 1951. Signor Paolo Vittorelli is a\nyoung but distinguished Italian journalist in the city of\nRome where Milton Mayer interviews him. He is a mem¬\nber. and a very active member, of the Social Democratic\nParty of Italy, the party which is opposed both to Com¬\nmunism and to the present Conservative government in\nItaly.\na_____ n northern Italy.\n„„ the shore of beautiful Lago Majore, Milton Mayer\ninterviews Signora Elsa Adami. Signora Adami. during\nthe war years, was active in the Italian underground\nand was, in a manner of speaking, a station on the un¬\nderground railway through which Allied prisoners of\nwar escaped into Switzerland. Nina Oulasevitch, a\nyoung lady of Brussels. Belgium, has been hitch-hiking\nall over Europe. Nina's mother and father are so-called\nWhite Russians who have lived in Belgium since 1917\nand are without nationality. Nina, by virtue of having\nbeen born in Antwerp, is a Belgian citizen."
}