{
  "id": "d711-137",
  "text": "cn\nBackground: Dr. McCormick is one of Ireland's eminent\nspecialists in preventive medicine and has been active\nin that field since 1919. Dr. McCormick is now acting\nchief of the Department of Health of Ireland and chief of\nthe Irish delegation to the World Health Organization in\nGeneva, Switzerland. In Oslo, Norway, Milton Mayer\ninterviews Dr. Karl Evang, Director-General of Health\nServices of the Norwegian Government and chief of\nNorway's delegation to the World Health Organization.\n\"S o\no I\n3 J\n«c a\nBackground: Milton Mayer interviews three educators of\nEurope. First, in Layston, England, Mr. A. S. Neill,\nheadmaster of the famous Summerhill School, a contro¬\nversial figure in English educational circles. Next, in\nGoldern, Switzerland, 84-year old Paul Geheeb (whose\ninterview has been condensed into a short statement\nread by Norman Michie) and then Dr. Teresita Sandesky\nScelba, a physician and director of one of the tubercu¬\nlosis dispensaries of the city of Rome.\nE\n.in\n\"E\n3\nE\nE\no\no\ne\nO\nBackground: Renato Mieli is 40 years old. He is a small\nsober young Roman, very conservatively dressed in a\ndark matching suit and tie, is married, of course, and\nthe fond father of a 3 year old son. Signor Mieli is in\ncharge of the foreign section of the Communist Party of\nItaly. Signor Mieli has had one very unusual experience\nwith a history like his. He has never been in prison.\nC\no\nBackground: The Reverend Michael Scott, whom Milton\nMayer interviews in London, enjoys the peculiar status\nof \"prohibited inhabitant\" of his beloved country of\nSouth Africa. The reason he is a prohibited inhabitant\nof South Africa is that he has represented the southwest\nAfrican tribes before the United Nations Assemblies,\ncarrying the tribesmen's petitions against their incor¬\nporation into the new racist state of the Union of South\nAfrica. The Reverend Mr. Scott is now no longer a mis¬\nsionary from the civilized world to the dark continent.\nThe Reverend Mr. Scott is now a missionary from the\ndark continent to the civilized world.\n*\nO\no\n5\nBackground: In this program Milton Mayer travels to\nNewcastle, one of the great ports on the east coast of\nEngland, where he interviews Mr. W. Grigor McClelland,\nthe president of a chain of 58 grocery stores, not, as you\nmay imagine, to find out how to run a chain of grocery\nstores, but rather to find out something about Com¬\nmunist China and Communist Russia. Mr. McClelland,\nas an English business man, in the spring of 1952 at¬\ntended the Moscow Economic Conference and then went\non to Peking, where, besides meeting government and\nnon-government Chinese, he witnessed Peking's May\nDay Celebration."
}