{
  "id": "d711-142",
  "text": "On how conditions On the role of the\nhave changed in On how they would On the German Church between East On the loss of a\nBritain change the world \"Neo-Nazi\" Party and West $50.00 bill\nMr. Percy Diggle and Five European students Herr Helmut Weber Professor Josef L. Hromadka Frau Gertrud Miiller\nMr. Joe Keiling\nBackground: Frau Muller's problem was an American\nS50 bill, and it was against the occupation laws for\nGermans to have American money. Frau Muller was\nborn and still lives in the tiny hamlet of Eichdorf, in\nsouthern Germany, near Munich. She is what the Ger¬\nmans call a real \"dorfkint,\" a small-town girl, one of\nsix children of a pattern maker who was killed in the\nwar. She got through grammar school, worked as a\nhousemaid and picked up a good deal of English from\nthe American soldiers who came to Eichdorf immedi¬\nately after the war. The story of Frau Muller's $50 bill\nis itself a Voice of Europe, a story of the almost incredi¬\nble complexities into which so many Europeans Wander\nwhen they let anything at all unusual happen to\nBackground: Milton Mayer interviews a Christian theo¬\nlogian from a Communist country. Professor Josef L.\nHromadka, of Czechoslovakia. Perhaps it is necessary\nto add that Professor Hromadka is not a refugee or an\nexile. He lives and works today as he has almost all\nof his life in his native land, and he visited Lund,\nSweden, this past summer, where Mr. Mayer inter¬\nviewed him, in his capacity as representative of the\nEvangelical Church of Czechoslovakia in the World\nCouncil of Churches. Josef Hromadka was born in the\nCzech province of Moravia which was then part of the\nold Austria-Hungary. He was an Evangelical pastor\nuntil he joined the theological faculty of Prague Uni¬\nversity in the capital city of Czechoslovakia in 1920. In\n1939 he came to America to join the faculty of the theo¬\nlogical seminary of Princeton University, returning to\nCzechoslovakia in 1947, a year before the Communist\nParty took over power,\nBackground: In the town of Marburg, Germany, Milton\nMayer interviews Mr. Helmut Weber. Mr. Weber, at\nthe age of 31, is state chairman for the state of Hesseu\nof the Socialistiche Reich Parti, the SRP, which many\nAmericans have heard of as the so-called neo-Nazi\nparty. Mr. Weber is also a member of the national\ncommittee of the SRP. Helmut Weber was born in mid¬\ndle Germany, the son, the only child of a locksmith. His\nfather is now retired and has a chicken farm, like so\nmany retired Americans. Mr. Weber attended high\nschool and was graduated in 1939. He was a member\nof the Hitler Youth, as was almost every other school\nboy in Germany at that time, and he rose to the rank of\nwhat we would call Battalion Commander in the Hitler\nYouth Organization. After 3 years as a prisoner of war\nin England, he returned to Germany, entered the Uni¬\nversity to study law which he has been doing up until\nvery recently.\nBackground: Milton Mayer, at Dalston Hall, in England,\ninterviews five European students: an Austrian, a\nFrenchman, a Greek, a Yugoslavian and a Spaniard.\nPeter, Robert, John, Ivan and Alfredo were attending an\ninternational seminar there, and they reply, in turn, to\nthe question: If you had the power, how would you\nchange the world?\n-\nBackground: The town of Cummersdale. in northwest\nEngland, is famous in its own way for the manufacturing\nconcern of Sted McAlpine and Company, one of the\nmany thousands of small, independent, family-owned\nconcerns in England, the printers of some of the finest\nhand-printed fabrics sold all over the world. The Sted\nMcAlpine concern is 170 years old and has always been\nin the Sted family. Milton Mayer interviews the Man¬\naging Director of Sted McAlpine, Mr. Percy Diggle. In\nthe city of Carlyle, in northwest England, Milton Mayer\ninterviews Mr. Joseph Keiling, whose dialect gives him\naway as a Cumberland man. The Keilings have been\nCumberland people, in Carlyle, as far back as Mr.\nKeiling knows. He was one of four sons of a railway\nporter. He went to work as an assistant to a block\nprinter in a fabric printing plant in Carlyle when he was\n14 years old. In 1921, he went to work for Sted McAlpine,\nand has worked there for almost 32 years."
}