{
  "id": "d711-151",
  "text": "On what it is to be On society, royalty Families have been On the BBC and On the situation in\na Dane and life in Spain disrupted Scotland Yard West Berlin today\nHerr Emil Frederitkson and The Carmen Story “Herr Hans Neumann” and Robert Silvey and Burgomeister Willie Kressman\nHenr Knud Klem “Frau Wagner” Superintendent Fabian and Senator Otto Bach\nBackground: In West Berlin. Milton Mayer interviews\nfirst the mayor of the Kreuzberg section of Berlin, a\ntrade unionist who was once head of the Berlin\nEconomics Division. The Minister for Social Affairs of\nthe state and city of Berlin is Senator Otto Bach.\nSenator Bach was also a trade unionist and an official\nof the International Labor Office of the League of\nNations. He left Germany in 1933, returning in 1940\nfrom Switzerland to engage in underground work\nagainst the Nazi regime which he continued in France,\nand then returned to Germany in 1945.\nBackground: In London, Milton Mayer interviews Mr.\nRobert Silvey, Director of Audience Research for the\nBritish Broadcasting Corporation. In London there is,\namong other things, the headquarters of an institu¬\ntion beloved of every American mystery reader, and\nthat is just about every American. The institution is\nScotland Yard. Milton Mayer interviews retired De¬\ntective Superintendent Robert Fabian. Superintendent\nFabian retired in 1949 after 28 years of service, 25 of\nthem as an un-uniformed man at the Yard. When he\nretired, he held, among other indications of his ca¬\npacity, what is known in England as the Police VC —\nthat is, the Police Victoria Cross, comparable to our\nCongressional Medal of Honor — the King's Police\nMedal for Gallantry.\nBackground: In the eastern sector, the Communist sector\nof the city of Berlin. Herr Hans Neumann is employed\nas a janitor in a building. Neumann, of course, is not\nhis real name. Herr Neumann, who is 80 years old,\nwas trained as a mechanic in Berlin. He went to sea,\nlanded in San Diego, worked as an automobile and\nairplane mechanic there, came back to Germany in\n1929, worked there as a mechanic until 1934 when he\nwent to Afghanistan to train mechanics for the Afghan¬\nistan air force. After the war and his release as a\nprisoner of war, he went back to his home in the\neastern sector of Berlin and got a job as a truck driver,\nand is now the janitor of a building there. Milton\nMayer interviews Frau Wagner, the daughter of a\nfamous German family which has been torn apart by\nthe division between East and West.\nBackground: In Paris. Milton Mayer interviews an exile\nfrom Spain. The lady he interviews, a Spanish Social¬\nist, was formerly a member of a family which had\nmarried into the Spanish nobility, and a family whose\nwealth had bought them positions of importance.\nThis is the story of her life.\nBackground: Denmark is a country whose most famous\nman is a teller of fairy tales, Hans Christian Anderson.\nAnd the leading authority on Hans Christian Anderson\nis Emil Frederickson of Copenhagen. Besides being\nliterary editor of the oldest existing newspaper in\nEurope, the Berlingkse Tidende, Herr Frederickson is\neditor of one of Denmark's oldest and most distin¬\nguished literary magazines. Gads. Secondly, Milton\nMayer interviews Herr Knud Klem in Elsinore Castle\non the subject of Shakespeare's Hamlet."
}