{
  "id": "d711-153",
  "text": "On the problem On the problem On Danish farming On conditions in On Paris and\nof the Saar of the Saar and shipping East Germany French decadence\nHerr Ernst Heinrick Schaeffer “Herr Busch” Sven Fisker and Eilot Maegaar “Hannelore Altmeier” and Lionel Durand and\nand M. Jacques Chaselle “Fritz Schneider” Claude Terrail\nBackground: Monsieur' Lionel Durand has been a\nFrenchman for 20 years, although he was born in 1920\nin Haiti. During the second World War he was a\nmember of the intelligence group of the French under¬\nground in Paris and then became New York corres¬\npondent and then foreign editor of the Paris news¬\npaper, the Paree Presse. After the liberation of France\nin 1945, the municipality of Paris decided that it could\nno longer afford to illuminate at night France's great¬\nest monument, Notre Dame Cathedral. And so a good\nFrenchman and a good Parisian. Claude Terrail of¬\nfered to pay the cost of lighting Notre Dame on week\nends and special occasions. In this Monsieur Terrail\nwa3 showing himself a good business man too. His\nrestaurant. La Tour d'Argent, the oldest public eating\nhouse in Paris and one of the most famous and ele¬\ngant, stands on the Quai De Tournelle with a mag¬\nnificent view of the Seine, of Notre Dame, and of Paris.\nThe restaurant, as far as is known, was founded in\n1582 and may very well be the birthplace of the fork.\nBackground: Not so very long ago, Fraulein Hannelore\nAltmeier, who is 18 years old, arrived in the West\nsector of Berlin from the Russian zone of Germany.\nThe same day Hannelore arrived, perhaps 1,000 other\nGermans from the East Zone appeared in Berlin, and\nmore or less this number arrive every day in the week.\nHannelore is one of four daughters of a professional\narmy officer, a colonel in the German army, who, since\nthe end of the war, has been a prisoner in the Soviet\nUnion. Hannelore's three sisters had all fled from the\nEast Zone before her. One is in America, two in the\nwest Germany city of Hamburg. Next Milton Mayer\ninterviews \"Fritz Schneider\" also of East Germany.\nBackground: In the heart of Copenhagen's great ship¬\nping district Milton Mayer speaks with Herr Eilot\nMaegaar, for 33 years the general manager of the\nDanish Shipowner's Association. Born in a small town\nin Denmark of a family of merchants and seamen,\nHerr Maegaar was trained as a lawyer. He is now a\nmember of the board of the International Shipping\nConference, of the International Shipping Federation,\nand of the International Chamber of Shipping. Farm¬\ning is the heart of Denmark and Sven Fisker is a\nDanish farmer in the province of North Zayland. The\nfarm is 333 acres of mixed farming, like all Danish\nfarming, with special emphasis on dairy production.\nBackground: In this and the following two programs of\nthe series, the problems of the Saar are discussed.\nMilton Mayer interviews \"Herr Busch,\" an unidenti¬\nfied Saarlander.\nBackground: Herr Ernst Heinrick Schaeffer was born in\nthe principal city of the Saar, Saarbrucken. He has\nbeen in the steel business for 40 years and is today a\nsupplier of high grade steel for plants throughout the\nSaar. During the last war he was the manager of the\nBerlin offices of two privately owned steel plants in\nthe Ruhr. He is a widower. He had two sons and\ntwo daughters. One of his sons was lost in the Ger¬\nman Army in Russia. At the end of May in 1945. when\nthe Russians took over the section of Berlin where\nHerr Schaeffer lived, having lost all his possessions, he\ncame back to the Saar, to his native city of Saar¬\nbrucken, on a bicycle, and began again. Monsieur\nJacques Chaselle is chief of the information section of\nthe French diplomatic mission to Saarbrucken."
}