{
  "id": "d711-173",
  "text": "2.\nto make the transition, have looked to their radio educators for guidance in\nthe new and challenging field of television. Therefore, the Allerton Seminar\nconsidered television as a natural extension of educational radio broadcasting.\nNineteen of the educators represented public school systems in the United\nStates owning and operating radio stations as part of their instructional and\ninformational function. The twentieth educator represented Canadian public\nschool education. (Cf. Appendix A.) Over half of the group had used commercial\ntelevision facilities for within’school education, for adult education, or for\nprograms interpreting the schools to the community. Mr. James Miles, Executive\nSecretary of the National Association of Educational Broadcasters, served as\nchairman during the Seminar. Through his efforts and those of the NAEB com¬\nmittee planning the Seminar, the services of seventeen consultants were made\navailable for varying lengths of time. Appendix B lists these consultants.\nAware of the excellent work of the Second Allerton Seminar which met during\nJune and July 19^9> and accepting those of their judgments having specific\nvalue for school broadcasters, the Allerton Seminar on School Broadcasting\ndefined their own areas of investigation and interest as those of (1) philos¬\nophy, (2) administration, (3) facilities, (4) programming, (5) production,\n(6) utilization and evaluation, (7) television, (8) script, and (9) foundations.\nThe director named committees in each area and charged them to report to the\nSeminar. Their separate reports indicate that practical considerations domi¬\nnated the thinking of the Allerton Seminar on School Broadcasting. Each\ncommittee took from the consultants those ideas which had practical applica¬\ntion, and while not discounting theory they nevertheless tested generalizations\nand theories in the light of their own experiences. As a consequence this\nreport on their deliberations should serve as a guide to educators entering\nthe field and as a standard of comparison for those already engaged in radio\nand television braodcasting."
}