{
  "id": "d711-179",
  "text": "8.\n6. He must not only use the standard and accepted techniques of evalua¬\ntion, hut he should constantly seek to find new evaluative techniques.\n(As Dr. Ben Bloom, Examiner, University of Chicago, told the Conference,\n\"There is a very sensitive relationship between measurement and cur¬\nriculum. If we can feed back to teachers what works, what makes the\nchanges in pupils that we label educative, then teachers can teach\nbetter.\" The implications of this statement in reference to radio and\ntelevision programming are obvious. The values are more fully dis¬\ncussed under Section IV, Programming, and Section VI, Utilization and\nEvaluation.)\n7* He must coordinate his efforts not only with those of the school system\nbut with those of the larger community within his signal pattern, in¬\ncluding cooperation with community groups, local stations, and radio-\nTV networks.\n8. He must develop techniques of utilization of radio and television and\nmust train the teaching staff as a whole in their use.\n9* He must publicize the radio-television services adequately through use\nof printed media such as regularly issued schedules of programs,\nthrough handbooks for special series and other teaching aids, through\nbulletins on special events or changes in schedule, through radio and\ntelevision announcements, through special campaigns to build up audi¬\nences for regular or special features, through newspaper releases,\nthrough group meetings, demonstrations, speeches and any other means\navailable or conceivable in his fertile brain.\n10. He must keep abreast of new developments in the fields of radio,\ntelevision,end education including participation and attendance in\nlocal, state, and national organizations working in each area.\n11. He must establish standards of classroom receivers and devise means\nfor their maintenance.\n12. He must devise means of equipping classrooms with radio and television\nreceivers, because many school systems do not equip their classrooms\nwith new. tools of learning immediately. Much of this will be done\nby demonstrating the educational values of these media and dramatizing\nthe need so that mothers' clubs, parent-teacher associations, and re¬\nlated groups assume their historical function of supplying teaching\naids in new fields. But he must never let the responsibility of the\nschools to equip classrooms according to the needs of modern education\nbe shifted from the schoolboard to private agencies.\n13* He must encourage the use of disc, tape, and kinescope recordings at\nthe school and classroom level so as to serve those audiences which\nwere unable to hear or see an original broadcast.\nlh. And recognizing that secondary school programs of study and schedules\nfor the day are complex and differ from high school to high school\nwithin the same system, he must point out to the superintendent and to\nother school officers ways and means of achieving some degree of uni¬\nformity in scheduling, he must duplicate broadcasts when vital programs\nmust reach all high school students and there is no possibility of\nchanging the high school schedule, and he must seek a directive from\nthe superintendent to require listening to a vital program in the event\na subject-centered high school fails to make any effort to use radio as\na tool of instruction."
}