{
  "id": "d711-190",
  "text": "6. To make effective use of radio the teacher should have time before\nthe broadcast for preparation of the class and time after the broad¬\ncast for follow-up activities. Therefore programs for the same grade\nor subject level should not be adjacent to one another, nor should\nthey be scheduled for the very first or very last period of the school\nday.\n7• Determine the frequency of broadcasts in a series according to local\nneeds. While the once-a-week program in a series is standard, varia¬\ntions may be desirable.\nIf departmentalized instruction is offered in the junior high as it is at the\nhigh school levels, program scheduling becomes exceedingly difficult. If the\nscheduling needs of the radio station and the schools cannot be reconciled by\na uniform bell schedule for all junior high schools, and a uniform bell\nschedule for all senior high schools, synchronization of broadcasts with class\nperiods will be haphazard. It will be wasteful, too, if classes in the same\nsubject meet at differing hours of the day, for saturation would require a\nbroadcast for every class in every subject. Practically such broadcasting\nwould be as impossible and undesirable as it would be administratively\nimpracticable and undesirable to require departmentalized schools of the same\ntype to offer the same classes at the same periods of the day regardless of\nwhether enrollment warranted it. Whatever degree of uniformity could be\nobtained, however, would simplify the task of scheduling radio programs to\nprovide maximum value. It is true that schools equipped with tape recorders\ncould record any programs of interest and make them available to the classroom\nteacher. Implicit in every aspect of programming is the close relationship\nbetween programming and the classroom: each must supplement the other, there\nis a mutual dependence.\nAlthough programming for classroom use is the primary obligation of the public\nschool station, there is an obligation to provide for the needs of the adult\ncommunity as much as possible. All school stations through organizational"
}