{
  "id": "d711-212",
  "text": "APPENDIX C (Continued)\n41.\n2. Copyright protects against duplication and dramatization. If the\nmaterial is dramatized, the material is covered by practices appli¬\ncable to drama: all performances including re-broadcasts must be\ncleared.\n3. There is a problem in defining dramatization, but the courts have\nheld that\na. a reading is not a dramatization, no matter how dramatically\neffective it may be, and\nb. musical accompaniment does not make a reading a drama, therefore\nc * ** solo reading may safely be given of any of the material in this\ncategory without clearance of copyright, on radio. The question of\nd. multiple readers, or speakers repeating lines as in a dramatiza¬\ntion though verbatim from the source, is unsolved legally in\nrespect to radio use. On television even with plain background\nit is dramatization.\ne. On radio a novel may be read in whole or part; it is questionable\nwhether this holds for television.\n4. By amendment to the copyright act on July 17, 1952, radio stations may\nno longer read non-dramatic literary materials over the air. This new\nlegislation, however, applies only to commercial stations operated for\nprofit. Non-profit educational stations may continue to read non-\ndramatized literary materials over the air without previous clearance.\n5* By the same amendment adopted July 17, 1952, all stations including\neducational stations are prohibited from making transcriptions of\ncopyrighted material described under E.\n6. News taken from newspapers after a sufficient delivery time for the\nnewspapers is allowed. Educational stations could read any newspaper\nover the air, after delivery time, without infringement of copyright.\n7. Reading of comic strips is permissible over radio where not for profit.\nDramatization requires clearance.\nF. PROGRAM IDEAS\nIdeas, titles, and formats are not usually secured by copyright. They are\nprotected to the extent that they cannot be appropriated so fully or in\nsuch ways that the listener is confused as to which program he is hearing.\nG. SPECIAL PROBLEMS OF TELEVISION COPYRIGHT\n1. School Film Libraries.\nIf copyright is still in effect, renew it including TV use.\n2. Cartoons and slides need copyright clearance.\n3. Photographs or reproductions of photographs in books must be cleared."
}