{
  "id": "d711-231",
  "text": "-14-\nFLORIDA: Vernon Bronson, Director, WTHS, Dade County\nRadio\nThree educational stations are on the air in Florida: WTHS, Dade County Public\nSchool System station; WTUN, University of Tampa; and WPRK, Rollins College,\nTampa has had remarkable success in liaison with the local commercial stations.\nThe NBC affiliate has given them studio equipment and a complete kitchen for\nhome economics shows. The CBS affiliate has been equally generous. They are\non the air 2 hours to 3 hours daily, 4 hours on Sunday. They expect shortly\nto go on S hours a day. They have a 20-student staff, 3 pieces of recording\nequipment. WPRK is largely a Classical music station. Of its 28 hours on\nthe air per week, 14 hours are classical music, and they also carry 5*r hours of\nNAEB Tape Network shows. WPRK has done a number of special events shows. CBS\nwill play back a WPRK music festival program Saturday, March 21*\nJacksonville: There is no school station in Jacksonville but most of the\nschools use a commercially produced 15-minute weekly show - \"Music for Youth,n\nand the audio-visual group has produced ten \"Know Your Schools'* programs.\nMiami; WTHS took three years after getting its construction permit to get\non the air. It has now been on the air 4 years. It leans heavily on help from\nthe NaEB; is building up a large record collection particularly in L.P.'s. They\nare particularly interested in the possibilities of using radio in furtherance\nof the bi-lingual idea in Miami which has 1,000,000 Spanish-speaking visitors\na year. They are hoping to teach conversational Spanish to the very small chil¬\ndren, and the plan is to repeat the broadcast a number of times a day. At pres¬\nent, these programs are used by the teachers on records. The schools have\nreceivers and sound systems, but have not been completely sold on either. WTHS\nis on the air from 3:00 to 9:30 p.m., and they estimate 5,000 to 7,000 regular\nlisteners. The University of Miami does two TV shows a week and 15 radio shows\na -week on commercial stations and are working on the NAEB Fund for Adult Educa¬\ntion grant.\nTelevision:\nFlorida has been extremely fortunate in its TV allocations. There are 9 alloca¬\ntions, and they are well placed. The Dade County School System was the first\ninstitution to file with the-FCC and the first to file an amended application.\nThere has been very little assistance outside, but pending the decision of one\nvote on the school board, Miami should get into the picture. The other alloca¬\ntions stand as follows: West Palm Beach has done very litte; Tampa is very\nlively and looks hopeful; an application is ready in Gainesville; Jacksonville,\nworking through its Citizens Committee, is about ready to file and has raised\nsome money; in Tallahassee the Citizens Committee is organizing, and if Gaines¬\nville gets a station it is a natural assumption that Tallahassee, site of Flori¬\nda State University, will also get a station; it's very doubtful that Panama\nCity will make any progress; there is a great deal of interest and good possi¬\nbilities at Orlando. To sum up, it's likely that 5 of the 9 allocations will\nsee some action soon.\nGEORGIA: Alvin Gaines, Supervisor of Radio Education, Director of WABE,\nAtlanta, Georgia.\nRadio\n•WAGE is the only educational station in Georgia. Despite certain special diffi¬\nculties, WABE has programmed such shows as PEOPLE UNDER COMMUNISM, THIS IS THE\nENEMY: COMMUNISM, and others. WABE broadcasts with a power of 4#00 watts, and\nis at the end of its fifth year of operation* It is on from 8:55 a>m. to 5:00\np.m. They have no budget. There are seventeen high schools, 92 elementary in\nthe Atlanta System alone (not including three county systems and a number of"
}