{
  "id": "d711-232",
  "text": "other independent schools) using the station. They produce 13 shows a week and\nuse 4 NAEB shows on in-school broadcasts. The schedule is made up with very\ncareful attention to grade availability so as to be on the air at the most con¬\nvenient hours for the teachers. Each elementary program is repeated four times\na week; high school programs are repeated seven times a day. The teachers have\ncomplete freedom; no one checks on their use of the program although a report\nof listening is requested.\nTelevision\nIn television, after the Southern Regional Conference which was held in Atlanta,\na Governor’s Conference was called. The Board of Regents were to make a request.\nThis action went to the Governor and he is holding it. He also is economy-\nminded, but has stated that he will write the FCC requesting a delay in the June\n2 deadline. Meanwhile, WABE-TV is going forward. The station will be governed\nby a board of all the educational institutions in the &rea. They are planning\na set-up which includes two 50’ x 100’ studios, 1 radio station, 1 mobile unit,\nand a video recorder. Their application went in on the first of March.\nKENTUCKY! Mrs. Camille Halyard, Manager, WBKY-FM, Lexington\nRadio\nThere are two principal activities in Kentucky: WFFL is perhaps the only radio\nstation in the country owned by a library. In this fabulous operation, the lib¬\nrary possesses copies of practically every educationally useful program avail¬\nable anywhere, and one can borrow these programs as one would borrow a book.\nDirect lines from the local stations permit the library to record programs for\nin-school non-commercial listening; 38 pairs of lines to the schools permit the\nteachers to request and receive over a private wire practically any program\ndesired. There is a new three-kilowatt transmitter for school broadcasting and\na 50-kilovratt transmitter for music.\nWBKY-FM at the University of Kentucky operates with a great deal of student\nhelp - the teaching department and the station have the same staff - and after\nrecent reorganization (a chart of which was shown), this is now a very efficient\noperation. They have also added an extra man this year to handle production.\nThe University has always done a lot with commercial stations. They do a series\neveryday, five days a week, mailed out on tapes to as many as 48 stations. These\nare largely programs produced for public service organizations. UBKY is on the\nair 3 hours a day at present and hopes shortly to go on 6 hours a day.\nTelevision\nWhat about television? Not too much has been done about television in Kentucky.\nThey are just beginning a foundation program in education which is designed to\neliminate some of the most serious deficiencies in the primary and secondary\nschool systems, and so there will not be - and perhaps ought not be under the\ncircumstances - any state-wide effort in educational television. Actually,\nonly one educational television channel has been allocated to the State of Ken¬\ntucky, and that to the city of Louisville. It is anticipated that the $210,000\nfor capital improvements made available to the library by the Louisville Fund\nwill enable WFPL to get into the educational television picture. The only other\nactivity is that commercial stations plan to install micro-wave transmitting\nfacilities at the University of Kentucky.\nALABAMA: Walter Whitaker, WU0A-FM, University of Alabama.\nRadja\nAlabama College for Women has a carrier current station WAS which operates 6J-\n^urs a day with an all-women staff. They produce a series CONCERTS FROM MONTE-"
}