{
  "id": "d711-4",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nMAER\nUniversity, Alabama\nBox 2002\nOctober 1, 1953\nMr. C* L. Alexander\nStandard Oil of Mew Jersey\nRoom 2131\nRockefeller Plasa\nHew Xork, Hew fork\nBear Mr. Alexander!\nOn September 1?, Hr, George Probet ami I called on Mr. David Anderson\nto present a request to Standard Oil of Hew Jersey for support of certain\nprojects in educational broadcasting in which the national Association of\nEducational Broadcasters is interested. After a rather lengthy discussion,\nMr. Anderson expressed considerable interest in the subject and suggested\nthat I present the proposal to you in complete detail, lie suggested also\nthat I furnish you full background material on the national Association of\nEducational Broadcasters as an indication of the scope of our activities.\nIn the package being forwarded to you, we have prepared, in duplicate,\na comprehensive proposal for support of the international phases of our\noperation. It should be noted that, though the emphasis throughout is on\nthe international, all of the programs produced under this proposal will\nreceive distribution first in the United States on our educational radio\nnetwork of over one hundred stations and the major portion of money spent\nwill be in securing significant radio programs from over the world for die-\ntribution in the U.S.A. At the same time, we shall be able to materially\nincrease the number of cultural, informational programs produced in America\nwhich are used by other countries.\nThe emphasis in this proposal is on materials and projects in radio f\nhowever, the HAEB is quite active in the television field, and, in coopera¬\ntion with the Educational Television and Radio Center, is launching a number\nof projects in educational TV. In the years ahead, HAEB may wish to discuss\nwith you the possibility of re-allocation of some funds requested herein for\nthat purpose.\nI shall be in Mew Xork October 5 and again October 22 and should be\nhappy to discuss this proposal with you if you are interested. On the 5th,\nI shall be at the Algonquin and at the Del Monieo on the 22nd should you\nwish to contact me. I shall be in conference at the Fund for Adult Education\noffice, 595 Madison Avenue on the morning of the 5th.\nPlease be assured of our genuine appreciation of your interest in and\nconsideration of this proposal.\nSincerely yours.\nGraydon Ausmus\nPresident\nGA/sbr"
}