{
  "id": "d711-57",
  "text": "240 HOLLYWOOD QUARTERLY\nhave never experienced, thus underlining the basic fallacy of the\nprogram popularity-rating systems as program determinants. It\nwent on to reassert that broadcasters must provide that variety of\nexperience which permits and encourages the development of\ntastes and interests. For broadcasters, this implies an obligation\nto experiment with both form and content.\nIn a forthright indictment of narrowly conceived policies and\npractices, the seminar argued that educational broadcasting, like\neducation itself, cannot in a democracy be the prerogative of a\nprivileged few. Educators on the air have often tried to serve the\nneeds of such limited groups as have already been exposed to the\nbenefits of considerable formal education. There is danger that\nthese special services will be given too great an emphasis and that\nthe medium will fail to carry information, understanding, and\nculture to the large portions of the general public which are not\nhighly educated and are therefore more difficult to reach with\nserious material. The seminar argued further that the effort\nshould be made directly and frequently, by educational broad¬\ncasters, to reach and serve the greatest possible number of people,\nalways bearing in mind the fact that the universal audience is\nmade up of a number of publics, and that generally speaking no\none program will reach all these publics and therefore all the\naudience.\nIt should be noted here that a program intended to appeal to\nthe universal audience must be based upon interests common to\nall people, and such interests are rare indeed. There are many\nelements which tend to limit the universal audience, such as age,\nsex, educational background, occupation, economic status, place\nof residence, the form of the program selected, the difficulty of\nthe presentation, and the selection of the area of the problem. It\nshould also be noted that each individual finds himself in many\nand quite different listening publics.\nThe seminar spent much time trying to think through and\nresolve satisfactorily the “mass vs. class” issue. Commercial broad-"
}