{
  "id": "d711-58",
  "text": "ALLERTON HOUSE\n241\ncasters, now even more than in earlier years, appear to be pro¬\ngramming for the mass—or, perhaps more accurately, the largest\nrealizable minority—audience. While leaving the so-called mass\naudience to the entertainment-centered commercial interests, the\neducational broadcaster must not fall equally captive to the class\naudience. The seminar reasoned it this way: one great purpose\nof the educational broadcaster is to render service to those publics\nwhich are not otherwise being served. In creating a program for\nany public in terms of the need or interest that defines that public,\nthe broadcaster will try to reach the entire public. When broad¬\ncasting is serving the interest of such publics, the size of the ob¬\ntained audience is not to be measured against the size of the\nuniversal audience, but rather against the size of the public\nselected. When the public is small, the obtained audience will, of\ncourse, be small. If the need or interest served is important, the\nsmallness of the audience may be justified. But there is no merit\nin smallness of audience in itself. If the potential audience for the\nprogram is large and the obtained audience is small, the situation\nshould be analyzed carefully to make certain that the size of\naudience is not a result of poor audience promotion or lack of\nimagination and skill in program design.\nThe deliberations of the seminar went beyond the broad ex¬\namination of purposes and the assessment of responsibility for\nserving audiences of various sizes and compositions. Critical at¬\ntention was given to the nature of noncommercial broadcasting.\nIt was pointed out that our social structure recognizes both profit¬\nmaking and nonprofit institutions. The school and the university\nhave as clear a place in our society as the small business and the\ncorporation. Both profit and nonprofit institutions support the\nAmerican way of life.\nFurthermore, society requires different services from the two\nkinds of institutions. The educational institution and its broad¬\ncasting arm exist entirely to render public service and to make\neducation widely available. Their success is judged not by eco-"
}