{
  "id": "d711-59",
  "text": "242 HOLLYWOOD QUARTERLY\nnomic results, but by achievement in reaching this educational\nobjective. The noncommercial broadcaster, no less than the com¬\nmercial, is dependent upon proper financing, skills, techniques,\nknowledge of his audience, and limitations of the medium. But\nthe similarities of his operation to commercial operation are\ndictated by the requirements of the medium, rather than by pur¬\nposes and goals. Some educational institutions maintain their own\nfacilities; others, through their production departments, use\navailable time on commercial stations; still others use both. What¬\never the avenue used, these institutions must meet professional\nstandards of production. But whereas the commercial station in\nits daily program design must emphasize the common denomi¬\nnators of public taste, and reflect in many of its programs the wide¬\nspread popular desire for relaxation and escape, the educational\nstation operator can aim his programs at the wide variety of spe¬\ncial needs and interests in his audience. He can program for un¬\nserved segments of the universal audience, for special areas or\nspecial needs. He can offer a service flexible enough to meet in¬\ndividual differences, and can reflect the total resources of educa¬\ntion in terms that will appeal, at different times, to all segments\nof the audience. Especially if he has his own station, he can pro¬\nvide the continuity of programming which is so essential to the\neducational process, on a regular and long-time basis rather than\nthe limited and sporadic basis which limits the educational broad¬\ncasting of commercial stations. He can do this because his primary\npurpose is education. Whereas a commercial broadcaster may\nhighlight a public service or educational program with great pro¬\nduction skill and for a large ready-made audience, the noncom¬\nmercial broadcaster can design his entire program structure in\nthe light of educational needs and resources.\nFrom these general discussions of philosophy and objectives,\nthe 1949 Allerton House seminar moved to some considerations\nof implementation. It outlined a program which the individual\neducational broadcaster might follow in assessing community"
}