{
  "id": "d711-60",
  "text": "ALLERTON HOUSE\n243\nneeds and resources, developing new program techniques, build¬\ning audiences, developing areas of research and “pilot plant” ex¬\nperiments, and training personnel. The largest and by far the\nmost important step it took, however, lay in its spelling out what\neducational broadcasters working together can do. The seminar\nrecommended and indeed set in motion plans for (1) a central\nservice for sharing programs, by tape or transcription, and (2) a\nlong-range plan for an educational network and a well-financed\nprogram-producing center.\nThe single most important factor contributing to the slow\ngrowth and development of educational broadcasting over the\nyears has been the unfavorable ratio of program staff and re¬\nsources to the number of hours in the broadcast day. It is obvious\nthat a simple exchange of the better programs produced by each\neducational station or university program-producing center would\nnot only relieve the pressure on each staff, but upgrade the pro¬\ngram output as well. A central program-producing service would\nsupplement this exchange and bring exciting new resources and\nproduction skills to bear all along the line.\nThe 1949 Allerton House seminar adjourned on this note of\nhope and dedication. The prologue had been written. The charge\nset off is still reverberating, firing imaginations, and igniting new\nactions in many quarters. A postseminar committee which in¬\ncluded in its membership Richard B. Hull, director of the Iowa\nState College station WOI (AM-FM-TV); George Probst, di¬\nrector of the University of Chicago Round Table; and Harold\nMcCarty, director of the University of Wisconsin station WHA\nand the Wisconsin State FM network, immediately began the task\nof formulating the long-range plan for organizing a network of\neducational stations, developing a central program-producing\nservice, and exploring possible sources of financial support for the\nenterprise. Concurrently Seymour Siegel, director of the New\nYork City stations WNYC and WNYC-FM, took the initiative in\nimplementing the program-exchange proposal of the seminar."
}