{
  "id": "d711-65",
  "text": "246 HOLLYWOOD QUARTERLY\nand the discussions were vital and penetrating. Practicality was\nassured through the participation, in all sessions, of either Robert\nLewis Shayon or Homer Heck, two of the abler and more ex¬\nperienced commercial network producers. The “technical-con¬\nsultant-in-residence” role of these men contributed greatly in\nbridging the gap between theory and practice, and their evalua¬\ntions for the medium of the scores of ideas introduced from the\nseveral substantive areas was especially noteworthy.\nThe 1950 Allerton House seminar kept records of its discus¬\nsions in abridged form. All members of the seminar participated\nin drafting the summaries, and the combined reports of the daily\nsessions constitute an imposing document. Already these are\nbeing drawn upon heavily in program planning by most educa¬\ntional stations. Obviously, these daily reports cannot be repro¬\nduced here; neither can one do justice to major subject areas by\nthumbnailing the discussions of them. Suffice it for purposes of\nconveying some insight into the nature of the seminar to give here\na few excerpts from the seminar notes on the discussions devoted\nto the problem of broadcasting literature, guided by Professor\nWalter R. Agard.\nA literary work is basically a work of art, declared the seminar.\nIt is also in its content a social document. It is a door to the com-\nprehensive understanding of a whole culture. “Confronted by a\nwork of art,” as Alfred North Whitehead says, “the individual has\nan experience limited only by his own ability to respond to it in\nterms of these three consecutive steps in learning: (1) romance,\nthrough awareness of its interest, importance, and vitality; (2)\nprecision, through the understanding of its tools and techniques;\n(3) generalization, through realization of its relation to the whole\nof life.” “Educators,” Professor Agard observed, “too often begin\nwith the second step; radio rarely goes beyond the first.”\nThe seminar agreed that radio, so far, has tended to reflect the\nepisodic nature of American life. Just as we live in “fifteen-minute\nshots,” so our approach to literature has been fragmentary, un-"
}