{
  "id": "d711-68",
  "text": "ALLERTON HOUSE 249\npresented as treated by different authors, such as Amphytrion or\nthe Fall of Troy.\nThe same kind of analysis and systematic study which char¬\nacterized the seminar’s attention to goals and techniques in broad¬\ncasting literature prevailed in all other discussions throughout\nthe seventeen days at Allerton House. The examination of sub¬\nject areas resulted in far more than the mere spelling out of new\nprogram series for educational stations. Program discussions in¬\ncluded the program concept, selection and treatment of materials,\nand knowledge of the wants and needs of selected audiences.\nThe benefits of the seminar cannot be generalized on a group\nbasis or in terms of mere program-performance goals; its impact\non the lives of the individual participants was impressive but diffi¬\ncult to assess. In a letter written after the seminar, one participant\nput it this way: “It was an extremely stimulating intellectual ex¬\nperience. I was made painfully aware of how slack I had been in\ncontinuing my education beyond college walls and college years.\nThe shove this experience gave me has overcome my inertia and\nhas given me sufficient impetus for a good hard program of con¬\ntinuing, purposeful self-instruction. The end result should be a\nbetter equipped program director.”\nThe Allerton House seminars have been of immeasurable\nvalue to the cause of educational broadcasting. They provided\nstimulus when stimulus was needed, and they provided a basis\nfor coordinated action when combined strength was needed in\nseizing the opportunities which beckoned. Today, to paraphrase\na slogan, educational programs are better than ever. In addition,\nthe “bicycle network” is rolling, a greatly stepped-up tape net¬\nwork operation is being established at the University of Illinois,\nprogress is being made on the long-range plan for a program-\nproducing center, and education is making a unified bid for the\nreservation of an adequate number of television channels for its\nexclusive use. If educational broadcasting is on the move, and it\nappears to be gaining momentum month by month, I believe it is"
}