{
  "id": "d711-81",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n□ □□□\nRepresenting non-commercial, educational AM, FM, and TV broadcasting stations, workshops,\nand production centers, owned and operated by colleges, universities, school systems, and public service agencies.\nMAY 1953\nNAEB AND MEMBER STATIONS RECEIVE IERT AWARDS\nThe National Association of Educational Broadcasters and several of its member\nstations won twenty-one awards in the radio division of the 17th American Exhi¬\nbition of Educational Radio and Television Programs. The exhibition was held\nin connection with the 23rd Institute for Education by Radio-Television at Ohio\nState University, Columbus, April 16 through 19. The awards include ten first\nawards, nine honorable mentions, and two special citations.\nIn Group I (Programs Heard Nationally by Network or Transcription) the NAEB-FAE\nseries \"The Jeffersonian Heritage\" won the first award in Class 4 (Cultural\nPrograms). The citation reads \"An outstanding document in which the best ele¬\nments of writing, acting, production and direction combine to present an his¬\ntorically accurate record of a significant American tradition. The series\nmakes an invaluable contribution to the understanding of democratic principles\nwithout resort to jingoism. Equal in merit to the best commercial network,\nprograms 'The Jeffersonian Heritage' proves that educational radio can success¬\nfully appeal to a mass audience.\" <•\nAlso in Group I, the NAEB-FAE series \"People Under Communism\" won a first award\nin Class 8 (Furthering International Understanding). The citation read: \"For\npresenting vital information concerning one of the major enigmas facing Amer¬\nica today in a documentary style well designed to attract the widest possible\naudience, this series is commended. Excellence of production combines with\nunquestionably authentic content to explain the motives of world Communism and\nthe reactions of peoples under Communism.\"\nStation WNYE, Board of Education, New York, won two first awards for \"This\nWay to Storyland\" and \"Americans to Remember.\" The former in the class for in¬\nschool listening by primary pupils; the latter for in-school listening by\npupils in the intermediate grades.\nit it a a a a a a a * a a\n(Continued on Page 2)\nit a a it n\nIN THIS ISSUE\nfc. it n a a a it a-a a it a it\nBibliography...17\n* Associate Member Page..6\nit\nit\nit\nn\nit Calendar of Events..2\na\nit\nit\nCoast to Coast.....3\nEducational Clippings.11\nKBPS Birthday....,...9\nMaterial Available From Hdq.16\nNAEB Officers and Committes.19\n***********(*****-*'«**** a' it' ^ a a it it it a a it it it it a it it it\nThe News-rLetter is now edited at Headquarters, All editorial material should\nbe sent,to NAEB Headquarters, 119 Gregory Hall, Urbana, Illinois.\nThe N-A-E-B NEWS-LETTER, published monthly, is distributed from and distribution should be addressed to: NAEB, 119 Gregory Hail,\nthe national headquarters office at the University of Illinois. N-A-E-B University of Illinois, Urbina,' Illinois. Editorial cppy and inquiries\nmembers and associate members receive the NEWS-LETTER as part of concerning editorial matters should be sent to the Editor, Burton\nmembership service. Non-members may obtain the publication at a Paulu, Station KUOM, University of Minnesota, Minneapolis 14,\nsubscription rate of $5.00 per year. All inquiries regarding subscriptions Minnesota."
}