{
  "id": "d711-87",
  "text": "-7-\nJCET MOVES TO PROTECT EDUCATIONAL TELEVISION RESERVATIONS\nIn its April meeting the Joint Committee on Educational Television voted to\ntake appropriate action before the Federal Communications Commission to ex¬\ntend the protection period for educational television reservations.\n’♦The Committee feels that the development of educational television services in\nthis country will be seriously retarded if educators are forced to defend their\nchannels at this time,'1 said Edgar Fuller in making the announcement.\n♦♦In many communities activity is just getting under way. If a commercial appli¬\ncant requests one of the television channels, the educators will be required\nto participate in a rule-making proceeding, thus diverting efforts now directed\ntoward activating the channel.**\nApplications for educational television channels now on file with the FCC total\ntwenty-five (25); many others are expected to be filed by June 2. In its\ntelevision report of 1952, the FCC assigned 242 television channels for educa¬\ntional use with the provision that after June 2, 1953, it will consider peti¬\ntions to remove the reservation.\nThere are many indications that support for educational television is increas¬\ning among people of the country. State and regional meetings have been held\nto discuss methods of programming and financing stations. In many states, leg¬\nislation has been introduced requesting the appropriation of funds and the for¬\nmation of study commissions. Philanthropic foundations and industrial organ¬\nizations have offered financial assistance to many communities.\nDavid Henry, newly elected Vice Chairman of the Committee, and Vice Chancellor\nof New York University, declared that many recent resolutions and statements\nwhich request the FCC to extend the period of the educational reservations\nprovide further evidence of the wide concern for the continued development of\neducational television.\n♦’No date has been set for the formal presentation of our views to the FCC,”\nstated Dr. Henry. ”But since the JCET represents the educators of this\ncountry, we believe it is our responsibility to move ahead in protecting the\nreserved television channels for them.”\nThe committee, now in its third year of operation, is supported by a grant\nfrom the Fund for Adult Education, established by the Ford Foundation. Dr.\nFuller, who has served as chairman since April, 1951, was re-elected in this\nweek’s meeting.\nWNYC DIRECTOR RECEIVES ENGLISH-SPEAKING UNION AWARD\nSeymour N. Siegel, Director of WNYC, is among eight broadcasters and newspaper¬\nmen who were named by the English-Speaking Union of the United States as a re¬\ncipient of its Better Understanding Award for contributions to international\nunderstanding.\nThe announcement, made by William V. Griffin, national president of the Union,\ncited Mr. Siegel ”for his contributions to American knowledge of the people of\nthe Commonwealth, both through Radio Station WNYC and through his work as pres¬\nident of the National Association of Educational Broadcasters.” Better Under¬\nstanding Awards were established by the Union in 1949 for writing and broadcast¬\ning which has shown a consistent endeavor to strengthen understanding and coop¬\neration between the people of the U.S. and of the British Commonwealth."
}