{
  "id": "d711-90",
  "text": "-10-\nclass broadcast tickets while members of the KBPS student staff, a feat con¬\nsidered by many to be accomplished in most cases only by college students.\nThere is hardly a station in the Northwest which does not have a former KBPS\nstaff member working in its technical or announcing department. Non-radio\nstudents from Benson and other high schools serve as assistants in music,\ntraffic, newscasting, sportscasting and announcing. KBPS sportscasts the\nmajor high school athletic events.\nAll students in the Portland Public Schools participate in programs broadcast\nby the station. I4,.ny original programs written by both elementary school\nchildren and high school radio workshop groups are aired. Broadcasts are of¬\nten presented which are outgrowths of classroom and school activities. Com¬\nmunity groups such as the Girl Scouts, the Junior Red Cross, the Park Bureau,\nthe Portland Art Museum, Civic Theatre, and the American Association of Uni¬\nversity Women, and Civil Defense authorities all utilize much KBPS program\ntime.\nSigning on at 10 o1clock each morning, the station devotes its in-school\nhours to programs planned by teachers and subject-area supervisors to enrich\nthe learning experiences in the classrooms. Broadcasts are planned for use\nby teachers on almost every grade level and in almost every subject area.\nCommercial stations in Portland have long and generously contributed to the\nKBPS program schedule through the writing and production of in-school broad¬\ncasts planned by KBPS personnel and by teacher committees. Radio stations\nKEX (ABC), KGW (NBC), and KOIN (CBS) all prepare programs which are tape-\nrecorded and then broadcast by KBPS.\nPortland teachers also prepare series for broadcast, such as ’’Pun with Music,”\na primary music and rhythms series written by Miss Juanita Wolff. KBPS buys\nseries for airing as well as securing programs from KOAC, the Oregon School\nof the Air, and through free transcription series, plus NAEB in-school net¬\nwork series.\nKBPS programs for adults are planned by supervisors, teachers, and community\ngroups. With the advent of KBPSfs extension of its broadcast day into the\nevening hours in March, 1950, and the growth of the NAEB Tape Network series,\nmany fine adult programs have been added from the NAEB network.\nThirty years of educational pioneering in in-school broadcasting, with its\nlast three years devoted to the building of a well-rounded program schedule\nfor adults is the KBPS story. \"This is KBPS, the voice of the Portland\nPublic Schools, 1450 on your radio dial in the city of roses, Portland, Oregon.\"\nPUBLICATIONS NOW AVAILABLE FROM NAEB HEADQUARTERS\nLos Angeles Television\n$ 5.00\n(Price to NAEB members—31)\nChicago Slimmer Television\n5.00\n(Price to NAEB members—31)\nNew York Television (Revisited)\n5.00\n(Price to NaEB members—31)\nNAEB Radio-TV Bibliography\n2.00"
}