{
  "id": "d711-91",
  "text": "-11-\nEDUCATIONAL CLIPPINGS:.EDUCATIONAL CLIPPINGS.EDUCATIONAL CLIPPINGS\nFROM THE EDITORIAL PAGE OF LIFE\n.Is there an adequate audience for educational TV? This question scarcely\nscarcely deserves an answer. The old commercial telecasters' shrugging excuse\nof ’simply giving the public what it wants' is as dead as druids. In 1930\nWilliam Paley, then president of CBS, had the eccentric notion of broadcasting\nthe New York Philharmonic concerts over his network every Sunday. ' Colleagues\nassured him that there was no audience for it, Paley said he would create\none, and he did. Thanks to his efforts and those of his competitors forced to\nfollow his lead, phonograph records of good music now are gradually overhauling\nthe sale of popular music platters in this country, and in 1951 Americans\nbought more tickets to symphony concerts than they did to baseball games-.\nThe hunger of our citizenry for culture and self-improvement has always been\ngrossly underestimated; the number of Americans who would rather learn a\nlittle something than receive a sample tube of shaving cream is absolutely\ncolossal.\nSo far, in addition to Houston, only 13 communities have been granted station\nbuilding permits by the FCC, and 11 more applications are pending. If for no\nother reason than that seven of the last 12 months were spent by our people\nin electing a president of the United State, the FCC should extend the reserve\nperiod for the educational channels. Who could adequately get behind building\nnon-commercial TV stations when our entire government virtually ground to a\nhalt for at least half of 1952?\nThe Joint Committee on Educational Television, which speaks for educators,\nwill submit a petition for extension, and the FCC should grant it. Our larg¬\nest cities should be given another year, our medium-si ed cities another\nthree years and our small communities another 10, if need be. Educational\ntelevision deserves and must have the best break we can give it. .\n(Life. April 20, 1953)\nIESS VIOLENCE. GENTLEMEN] By Harold B. Clemenko\nThe subject of crime and violence on television is by now a hoary yawn-producer.\nEditors are tired of this chestnut—and so is the public. This of course does\nnot minimize in the slightest the seriousness of the situation. But when you've\nmade your point, you've made your point.\nNevertheless we are shocked all over again to learn from the National Associa¬\ntion of Educational Broadcasters that the seven New York-area television sta¬\ntions are telecasting 6.3 acts or threats of violence every hour of the pro¬\ngram day. That is an average of almost one act of threat of violence per\nstation per hour! Ironically, the rate of violence is considerably higher\nduring the \"children's hours\" of the telecasting day. Moreover, this atro¬\ncious rate represents an increase over last year. After all the squawking done\nabout violence, we're getting nine percent more this year.' Is there any wonder\nin view of this, that our newspapers report a constant stream of real-life acts\nof violence? Evertybody knows how imitative children are. Even adults have\nthis quality. It is obvious therefore that the mounting pseudo-violence of our\ntelevision fiction will inevitably reap a constantly larger harvest of real-\nlife violence.\n(Television Guide. March 20, 1953)"
}