{
  "id": "d711-93",
  "text": "-13-\nDOERS OR VIEVJERS?\nThe Fund for Adult Education , 595 Madison Ave., New York City, has appropri¬\nated nearly $4 million to encourage discussion by American citizens of vital •\nissues. Established by the Ford Foundation, the Fund seeks to continue post¬\nschool education in political, international, and economic understanding, and\nthe humanities. Emphasizing the urgency of continuing adult education for cit¬\nizenship responsibilities, the Fund’s president, C. Scott Fletcher, made the\nfollowing vital observations:\n’’Clocks run faster in the 20th Century than in the 19th. Man flies faster than\nsound. The words of wise men, and of charlatans, flash around the world.even\nas they speak them. The mechanisms for becoming informed and misinformed are\nincreasingly effective.\n’’The inventions of our generation in the field of mass communication may seem,\nto some of us, to have reduced the need for down-to-earth group discussion—\nactually they have increased it. These inventions serve the ends of democracy\nonly if supplemented by such free discussion among individuals, free exchange\nof fact and opinion leading closer to the truth. It was in recognition of this\nthat the Fund for Adult Education decided at the outset to place maximum empha¬\nsis on face-to-face discussion a s the most fruitful method of carrying on lib¬\neral adult education, of stimulating free men in a free society to think accur¬\nately and constructively. Every dollar spent in grants by the Fund is spent •\nwith this in mind.”\nMr. Fletcher feels that Americans ’’have moved so far away from the concept\nof discussion as an educational tool” that they must be resold on techniques\nof successful group discussion.\nWe heartily agree with Mr. Fletcher’s observations and aims. We are in\ndanger of developing into a ’’Let George do it” democracy. Radio and televis¬\nion are making too many of us listeners and viewers rather than doers or\nparticipators in our free way of life. There is a growing tendency to regard\nas bad taste any discussion of political, economic or social issues when you\nare with friends. Of course, there is a time and a place for everything, but-\ntoo few Americans are allotting a time and a place for fruitful discussion.\nWe will lose our free way of life if we lose our inclination and capacity for\nenlightened discussion of vital issues. Demagogues and dictators are always\nready and anxious to take over for us. The town meeting was a major factor\nin the establishment of our free government of the people. It still is a\nvital necessity to the preservation of a free way of life. With all our\nmodern means of personal and mass communication and transportation, we seem\nto find it more difficult to attend a town meeting than did our forefathers\nwho plodded through snow and mud to make and keep this government with\npowers derived from the people.\nWe agree with Mr. Fletcher that modern means of communication can flash\naround the world the words of charlatans as well as those of wise men. By\npopular discussion of issues, which exposes falsehoods and leads to keener\nobservations of truths, the effectiveness of charlatans is reduced and truth\nhas greater opportunity to live and grow among the people.\n(Editorial from Trainman News. Dec. 22, 1952)"
}