{
  "id": "d711-97",
  "text": "BIBLIOGRAPHY — RADIO, TELEVISION AND MSS MEDIA\nAung, Tin, A Study of the UN Broadcasting System. Syracuse, New York, Syra¬\ncuse University, 1948. (M.A. thesis).\nHistory and descriptive study of the UN broadcasting system, 1946-48, show¬\ning the framework of the organization and analyzing the results.\nBroderick, Gertrude G. Radio and Television Bibliography. Washington, Gov¬\nernment printing office, 1952.\nAnnotated bibliography covering material on careers, production and writ¬\ning techniques, educational uses, scripts, books and plays, non-technical\nTV, radio and TV engineering and servicing, FM, receiving and recording\nequipment, records and transcription, periodicals, and sources of general\ninformation.\n’’B.B.C.-TV: An interview with Roger Manvell,” Quarterly of Film. Radio and Tele¬\nvision 7:3, Spring 1953, p. 253.\nCallenbach, Ernest. \"Chicago’s Third Programme,” Quarterly of Film, Radio and\nTelevision 7:3, Spril 1953, p. 230.\nFinancing and programming policy of WFMT, Chicago’s ’’little FM station.\nCooley, Hazel. Vision in Television. New York, Channel Press, 1952.\nAdvances a philosophy of education for TV and indicates how the individual,\nthe community and the nation will benefit from a non-commercial system\nof broadcasting.\nDavidson, Bill. ’’Arthur Godfrey and his Fan Mail.” Collier’s 131:18. Mav 2.\n1953, p. 11.\nThough non-scientific, this analysis of Godfrey’s fan mail gives an in¬\nsight into certain factors which contribute toward a numerically success¬\nful radio program, as well as certain audience expectations from radio\nlistening.\nDrewry, John Eldridge, ed. New Horizons in Journalism. Athens. University of\nGeorgia, 1952.\nPress, radio, television, periodicals, public relations and advertising\nas seen through institutes and special occasions of the Henry W. Grady\nSchool of Journalism, 1951-52.\nHorton, Donald^ Mauksch, Hans 0.; and Lang, Kurt. Chicago Summer Television\nJljiy 30-August 5. 1951. Chicago, National Opinion Research Center, n.d.\n(NAEB Monitoring Study No. 3).\nSeven-day non-evaluative study of TV broadcasting in Chicago. Classifies\nrather than describes material, measuring by amount of time given to mat¬\nerial of various kinds.\nHoward, Jack. ’’Lusaka Calling,” Quarterly of Film. Radio and Television 7:3,\nSpring, 1953. p. 235. ~ -\nReport on Central African broadcasting."
}