{
  "id": "d1772-46",
  "text": "43\nThe Funotioti of KSLH Planning Committees\n(During a discussion session, a great deal of interest ms shown in the\nsystem of teacher-level planning committees used by Station KSIH. In order\nto serve requests for further information about the system, the Editor\nasked Marguerite Fleming to supply additional details.)\nIn planning radio series, KSLH relies on assistance from many\npeople — teachers, consultants, school radio-coordinators, and pupils.\nThe first step is in the hands of radio planning committees. There is one\nfor each area: social studies, language arts, foreign language, mathematics,\nscience, health and guidance, art, music. Each committee decides what type\nof radio program could best supplement work in its field. Ideas come from\nthe committee itself, from suggestions made by the KSLH staff, and from\nprogram series whioh other stations have oarried.\nWe tell committees that this is their station and ask what we can\ndo to help in specific subjeot areas and grade levels. They then make\nsuggestions, explaining what they want and why. Although radio technique\nin writing and production is the function of the station, we urge these\npeople to give us all the suggestions they can. YTould they rather have\ndramatizations, interviews, straight talks? Would it be helpful to have\nchildren take part in productions?\nThe entire responsibility for content is on the committee. The\nKSLH coordinator meets with the committee. Then a script writer is assigned.\nThe station manager sits in whenever needed. The script writer works out a\nplan with the coordinator and writes a sample script. Often this is checked\nwith the program planning committee chairman. Then it is produced and tested\nin perhaps forty schools. A card is sent to teachers \\vho listened with their\nclasses for evaluation. If results indicate that ohanges or additions should\nbe made in a program, we re-do it. We try to develop a sample program that\nis as nearly perfect as we can make it. When it seems to fill the bill, we\nproduce the series. That this procedure is effective, although time consuming,\nseems evident beoause we have very few comebacks or criticisms on series\nplanned as carefully as this before going on the air.\nWorld Tour, an upper grade geography series, is an example of a\ncommittee-suggested series, which was planned to supplement soanty and out¬\ndated textual infor nation on Afrioa and Asia. The committee recommended a\ntour from city to city with a guide and travelers looking down on various\ncountries from a plane. The committee outlined the material they wanted\nto be included about each country. Then we put a soript writer on it who\nwent to work on format and research. Many ohanges from the original plan\nwere made before the series went on the air.\nThe planning committee serves as an evaluation committee as well,\nand also as a sounding board for other teachers’ reactions to the series.\nAfter the series has been aired for several weeks, the committee reports on\nits findings. KSLH also evaluates throughout the entire school system once\neach semester.\nThis system, we find, helps a good deal in building audienoes.\nTeachers who saw an idea grow tell other teachers, and we oouldn’t have\nbetter promotion than that.\nMarguerite Fleming\nManager, Station KSLH\nSt. Louis Board of Education"
}