{
  "id": "d1140-0",
  "text": "SPECIilL BULLETIN\nRelease Date September 17, 1931,\nTO ]VIEi\\iBERS\nTHE /association OF COLLEGE /HD UI^IVERSITY BRO/iDCASTING STATIONS\nAn excellent response has been received to my letters addressed to the various pro¬\ngram managers, directors, etc. Since the vacation season is now closing and most of\nour co-workers are beginning their activities in radio viork, I wish to release tjiis\nbulletin to give a resume of some of the replies received from my communication of\nAugust 20,\nFROM DIRECTOR B, B. BRACKETT OF KUSD, UNIVERSITY OF SOUTH DAKOTA, VERMILLION: * It\nis not probable that we can contribute anything of importance in loaning records for\nuse by our membership, but I am willing to do anything that I can do to encourage the\nplan. To date wo have made almost no use of records, * * *0n after-midnight programs\nalone we have used records a number of times,\n’’However, as you doubtless know, YIOI at Ames, lovm, puts on many very fine musical pro¬\ngrams using records. In fact, each week-day morning they present their ’Music Shop\nHour’, and those programs are wonderful compared with the jazzy stuff that the ’chains’\nare putting out at the same time, »*• * ♦If we were not so very short on funds this year,\nI would surely start a collection at this time; but this will be impossible, I feel sure\n’’About the finest part of your suggested use of records se-;ms to me to be that of ex¬\nchanging records of college songs, college yells, etc. We have no records in these\nlines, but if I can persuade our Publicity Department to have some made I shall cer¬\ntainly do so,”\nFROM DEM H, V. GMPENTER, DIRECTOR OF STATION KWSC OF THE STATE COLLEGE OF WilSHINGTON,\nPULLM/H: ” * ♦ *We are having considerable difficulty maintaining our place in the air\nagainst the effects of the new twelve-hour a day ruling, but hope to be successful,”\nFROM DIRECTOR W. I, GRIFFITH, STATION WOI, lOYiA STATE COLLEGE, AlffiS: ” ♦ ♦ ♦ I doubt\nthe advisability of our membership stations loaning records to one another, T.e have\nfound they wear out and have to be replaced, * ♦ *Another thing, the postage is quite\nhigh and of course they would need to be insured,\n\"I think in the case of records made by our own glee clubs, orchestra, and bard, that\nwe will bo willing to exchange these with the other institutions belonging to the As¬\nsociation, The only question is about recording them. At our last meeting there was\nsome discussion about the Association looking up tho most approved method of recording\nand perhaps to have ono of our members go from one institution to another and record\nsuch musical selections and such addresses as might bo most worthwhile,\n”We are doing considerable remodeling of our transmitter and when we get through if wo\nhave any money left v/e will consider the advisability of purchasing a recording device\nof our ovjn. If we diould do this we vrould then be in a position to furnish not only\nmusical selections but many other addresses that may be of interest to other education¬\nal institutions, particularly those who are interested in Agriculture.” (NOTE—I sin¬\ncerely hope that Mr, Griffith is in a position at this time to advise us if ho has been\nsuccessful in purchasing a recording device and wish to urge that he send to the ex¬\necutive secretary’s office details of his findings as to tho best type of equipment,\ncost, practicability, etc,)\nMR, GRIFFITH FURTHER STATES: ”I note in your closing paragraph you ask for suggestions,.\nI orn sure that the educational stations are going to have more or less difficulty in\nkeeping on the air with favorable power and frequency assignments unless they use the\nhours at their- disposal in a profitable manner and use them for twelve months in tho"
}