{
  "id": "d1140-2",
  "text": "NAE8 NEWS LETTER\nPage 3\nOecember 1, 1943\nSECONO YEAR THE QUARTET IS BROADCAST ING WEEKLY TO ILLUSTRATE A COURSE IN\nQuartet is broadcasting weekly to illustrate a course in Quartets or Haydn\nAND M02ART GIVEN BEFORE A UNIVERSITY CLASS BY PROF. CARL BriCKEN, DIRECTOR\nof the Music Schoolo\nThe Quartet members are on the staff of the Music school. The picture is\nOFFERED IN HOPES OF INCREASING THE RADIO AUDIENCE OF THE OUTSTANDING GROUP,\nSO THAT THE CULTURAL INFLUENCE OF THEIR MUSIC MAY REACH ALL THE PEOPLE OF\nWisconsin which the station and the Quartet serve.\nThe informal pose, in formal dress, shows Germaine Prevost, violist,\nGeorge Sopkin, cellist, and Albert Rahier, second violin, studying the\nSHEET OF MUSIC HELD BY ANTONIO 8r0SA, FIRST VIOLIN AND DIRECTOR OF THE\ngroup. The picture was taken by the University photographer, Homer Montague,\nAND FINANCED BY THE MUSIC SCHOOL.\nPine comments on the program accompany requests and are more than reward\nENOUGH FOR WHA FOR MAILING THE PHOTOS® HOWEVER, IF WE GET THE KIND OF\nRESPONSE WE DID TO TME OFFER OF A FREE PATRIOTIC PAMPHLET PUT OUT BY THE\nBureau of Oral and Visual Instruction—3166 at the last count—the Music\nSCHOOL isn’t GOING TO LIKE IT, AT 15^ A PICTURE.1\nSCIENCE FROM CLASSROOM ON W H A D\nAttempting for the first time to broadcast a scientific course by air\nDIRECTLY FROM THE CLASSROOM, WNAD WILL PRE9ENT A SERIES OF LECTURES ON\nPLANT SCIENCE AND ANIMAL BIOLOGY, \"BIOLOGICAL BaQIS OF HUMAN AFFAIRS,* TO\nBE HEARD EACH MONDAY, WEDNESDAY AND FRIDAY FROM 11:15 TO 12 NOON.\nComing under the general heading of \"Radio Classroom of the Ajr,» these\nLECTURES WILL NOT BE FOR SPECIALISTS IN THE FIELD, BUT RATHER WILL BE\nPRESENTED AS GENERAL UNIVER8ITY COURSES.\nDiscussions are led by the following professors: Aute Richards, a. 0. Wecse\nand A. U Ortensurger, professors of zoology, and Milton Hopkins and H. L#\nChance, associate professor of plant sciences.\n\"SPEAKING TO PARENTS* ON K F K U\n\"Speaking to Parents,\" a weekly KFKU Friday afternoon feature, is planned\nespecially for the parents of children of preschool age, two to five years.\nThe broadcasts are sponsored and prepared by the University of Kansas\nNursery School staff.\nAuthorities in the fields of child care and psychology discuss everyday\nproblems of parents on the quarter-hour broadcast. The topics for discussion\nDURING OECEMBER WILL INCLUDE MENTAL DEVELOPMENT, BEHAVIOR, CHILDREN'S PLAY\nAND PLAY MATERIALS, AND LITERATURE FOR CHILDREN.\n\"Speaking to Parents\" is broadcast at 2:30 o’clock on Friday afternoons\nover KFKU. Following, at 2:45, are the \"Speaking to Women\" programs.\n\"Food News\" from the department of home economics is broadcast once every\nTWO WEEK8, AND ON ALTERNATE FRIDAY AFTERNOONS KFKU PRESENTS \"TUNES ANO\nTips\" from the Office of War Information."
}