{
  "id": "d1140-5",
  "text": "NAEB NEWS LETTER\nPage 6\nDecember l, 1943\nOHIO INSTITUTE DATES SET FOR MAY 5-8.\nThe Fifteenth Institute for Education by Radio will be held at the Oeshler-\nWallick Hotel, Columbus, Friday through Monday, May 6-8, according to I *\nKeith Tyler, Director of the Institute. It is also probable that NAE8 will\narrange to hold its annual meeting in conjunction with the Institute, so\nBETTER MARK THOSE DATES DOWN#\nClosing date for entries to the Eighth Annual Exhibition and Citations of\nEoucational Radio Programs will be March 15, 1944. Specifications and\nentry blanks may be obtained by stations, educational organizations and\nregional networks by writing the Director of the Institute, The Ohio State\nUniversity, Columbus, 10, Ohio.\nCOLORADO COLLEGE PRESENTS: \"LET’S MAKE MUSIC\"\nLE7?S MAKE MUSIC comes to the Rocky Mountain Region perfected into twelve\nhalf-hour lecture-concerts of delightful swift-moving entertainment,\nPRESENTED BY COLORADO COLLEGE UNDER THE AUSPICES OF THE ROCKY MOUNTAIN.\nRadio Council.\nLET’S MAKE MUSIC FIRST TOOK FORM IN HEW YORK C|JY AS THIRTY BROADCASTS BY\nRoy ano Johana Harris with assisting artists, and was further (developed as\na Sunday feature on the Cornell University C8S station by the same artists*\nIn LET’S MAKE MUSIC, the hearer listens in on a lively stuoio chat between\nRoy Harris and his friend George, \"Mr. Average Man\", as they listen to\nmusic played by Johana Harris and their musician friends. More than half\nof each broadcast will be music. Excerpts and entire works run the gamut\nFROM YESTERDAY’S 8aCH, MOZART, AND BEETHOVEN, TO TODAY’S ROY HARRIS. THE\nCOMPOSER MAKES CLEAR TO HIS LISTENERS IN THE STUDIO AND ON THE AIR, IN AN\nEASY-GOING, PERSONAL, HUMOROUS WAY, JUST HOW AND WHY MUSIC AFFECTS THEM.\nOFF THE CUFF.\nWaldo Abbot at Michigan has gotten out another of those breezy letters of\nHIS TO HIS FORMER STUOES, NOW LOCATEO ALL OVER THE WORLD....WHA NEWS LETTER\nSHOWS HOW PLAYFUL WHA STAFF IS....MENTIONS HALLOWE’EN PARTY STAGED BY\nst aff «... Harold Engel visited WHA recently enroute from coast to coast...\nHarold is still located in Seattle....WCAL, St. Olaf College, was granted\nAUTHORITY TO DETERMINE OPERATING POWER BY OIRECT MEASUREMENT, NOVEMBER H...\nKOAC’S REQUEST TO USE WE TRANSMITTER AS AN AUXILIARY WAS DISMISSED BY FCC\nat KOAC request....The FCC granted WRUF, University of Florida, special\nSERVICE AUTHORIZATION TO OPERATE UNLIMITED TIME FOR PERIOD ENDING FEBRUARY I\n1944....The following item was carried by the Associated Press: \"The\nBROADCASTING OF COLLEGE BASKETBALL IS GOING TO BE GIVEN A NETWORK TRYOUT\nNEXT SaTUROAY AFTERNOON. (OeCEMBER 4) B|LL STERN WILL GIVE A PLAY BY PLAY\nDESCRIPTION OF THE GAME BETWEEN PRINCETON AND DARTMOUTH (OVER NBC). The\nBROADCAST WILL START AT 3?45 O’CLOCK. IT WILL BE ONE OF THE RARE OCCASIONS\nTHAT BASKETBALL HAS BEEN PUT ON THE SAME BROADCASTING BASIS WITH FOOTBALL.\nThe speed of basketball requires exceptionally fast oral description. And\nTHE SUCCESS OF THE TRANSMISSION IS EXPECTED TO DETERMINE WHETHER OTHER\nBASKETBALL GAMES WILL BE BROADCAST. \"TOURNAMENT BASKETBALL HAS BEEN CARRIED\nBEFORE ON THE NETWORKS BUT MAINLY IN SUMMARY FORM.” I *M AFRAID THAT"
}