{
  "id": "d1126-2",
  "text": "3\nTHE PAY-OFF”\nBILLBOARD Lagazine, in its January 18 issue, reviews the record of the Inter¬\ncollegiate Broadcasting System in giving training for employment in stations through*\nout the country, and says that educational broadcasting is paying off. I.B.S. sells\ntime commercially, and so in a measure, serves as a \"training farm\" for the big\nleague.' It cites numerous grads in professional radio.\nFrom a vocational point of view, this development is significant. It puts the\nemphasis on a phase of the radio activity somewhat apart from what most educational\nbroadcasters consider their major responsibility. Radio, like other new \"arts\",\nhas been going through an evolutionary process in which accident rather than planned\npreparation have placed people in key positions.\nThe list of \"alumni\" of truly educational stations engaged in professional\nradio work would run longer than most of them realize. Kl'^iSC recently made a sur¬\nprising shov/ing of the activities of former student staff members.\nIn offering academic courses in radio broadcasting, most of the institutions\nbest qualified to provide teaching and laboratory facilities for practical ex¬\nperience have lagged sadly behind. Their first duty, they have thought, is to the\nprogram service to their list0ners---with instruction considerea as secondar^r.\nSoon the labor-market will taper off, and again qualifications for jobs will\nrank high. Here is another opportunity for educational stations to make their\ninfluence felt.\nCSBC SELLS TRANSCRIPTION PUiYBACKS\nGeorge Jennings announces that the Chicago School Broadcast Conference is\nready to take orders for a 16 inch dual-speed transcription turntable which is\nengineered to the specifications set by the Radio Council of the Chicago Public\nSchools. Price $150.00. Write George at WBEZ for the details. (This is not a\npaid advertisement!)\nSTATION REPORTS\nY^BAA--—Purdue University, LaFayette^\nJim Miles cites the BMB station audience report on Yi'BiLA. as evidence that his\nstation is serving the people. He says, \"By multiplying the ’-station Total’\nfigures by three (the average number of persons per family) we see that according\nto this survey, YiiBAA has a daytime listening audience of 94,350 and a night-time\nlistening audience of 39,180.\"\nIndiana State Teachers College-Terre Haute.\n\"The Hoosier Schoolmaster of the Air\" Mo'rgan cites ISTC programs for Parents,\nStudio Orchestra, Radio Yiorkshop. Guidance Guideposts, Science, Variety Show,\nPlaces in the News, Talent on Parade and Story Princess of the Music Box on the air\neach v/eek in addition to a daily weather analysis from the campus. All are heard\nover Y^’B0^/1, local outlet.\nY'iNAD-University of Ok la homa, Norma n.\nThe station has a new production manager. He is Yii.S. Morgan and came from the\nUniversity of Nebraska, where he was Director of Radio Education.\nImprovements are anticipated at YiiNAD in the form of a change in the trans¬\nmitter site and an increase in power."
}