{
  "id": "d864-19",
  "text": "-4-\nConsider the following potential of communications technology:\nmovement of information from one point to many; movement of\ninformation from many points to a central place; capacity to\nhandle a variety of communication symbols - voice, sounds,\nmoving pictures, stationary pictures, diagrams, printed displays,\netc^n~; opportunity for persons geographically separated to work\ntogether on a common task; capacity to operate beyond and ...\naround the usual geographical limitations; opportunity to facilitate\nboth administrative cooperation as well as instructional cooperation\namonq widely separated individuals; economies of scale that re¬\nduce unit cost as numbers of participants increase; these are some\nof the facts of technological opportunity that have not yet been\nfully examined with respect to the educational conditions noted\nabove.\nSome have argued that the present approach of the Commission s\nstaff is too broad; it is, I fear only technically broad, but\nconceptually narrow. Consequently, I see the Commission s\nmost useful role to be as follows:\na) Identify the educational deficiencies extant in our\nschools and colleges.\nb) Illustrate what instructional television and radio\n(and other electronic communication techniques)have\nbeen able to do; what they are capable of doing; and\nwhat stands in the way.\nc) Recommend two or three areas where full scale\ndemonstrations of educational systems built around the\ncommunications potential of electronic audio-video-data\ntechniques. Such areas might be the Washington, D.C., .\nschools, the rural schools of Appalachia, or Mississippi,\nand the Indian schools in concentrated sections of\nIndian populations. The demonstrations should be com¬\nprehensive and developmental. They should be planned\nf6r a 10-year development period.\nd) Since the same problems exist in higher education, the\ndemonstration here should be the organization of a state s\njunior college program, treating geographically separated\nbuildings across a state as a common campus, made whole\nby electronic communications systems that.facilitate\nadministrative and instructional cooperation.\nJames A. Fellows"
}