{
  "id": "d1414-0",
  "text": "OF EDUCATIONAL BROADCASTERS\nRepresenting non-commercial, educational AM, FM, and TV broadcasting stations, workshops,\nand production centers, owned and operated by colleges, universities, school systems, and public service agencies.\nCONVENTION SPECIAL\nNAEB ANNUAL CONVENTION MINNEAPOLIS, NOVEMBER 6-7-8, 1952\nPRELIMINARY PROGRAM NEWS\nWRITE FOR RESERVATIONS TODAYl\nWith FCC Chairman Paul A. Walker and U.S, Senator Hubert Humphrey among the headline\nspeakers, the NAEB 1952 convention -will be held in Minneapolis at the University\nof Minnesota on November 6, 7 and 8* Following is a forecast of the convention\nsessions# Hotel reservation data will be found on pages 3-5*\nMAJOR AREAS FOR DISCUSSION WILL INCLUDE:\nGetting into educational television—setting up your own station or\nusing commercial stations.\nEducational radio's survival problem in today’s television world.\nThe problem of the small school station*\nNAEB OFFICERS AND COMMITTEE CHAIRMEN WILL REPORT TO THE MEMBERSHIP\nSiegel-Probst-Harley on their European trip*\nThe Adult Education Committee on the Jeffersonian Heritage and other\nprogram projects.\nThe Board of Directors on their work during the year.\nTHE JOINT COMMITTEE ON EDUCATIONAL TELEVISION WILL BE IN MINNEAPOLIS TOO\nThe JCET will hold its November meeting in Minneapolis on November 5, and\nits members will be available during most of the convention for consultation\nas needed.\nOTHER ATTRACTIONS\nAmong the events your wife (or husband) can attend (at his or her own expensel)\nwnile you go to the convention are:\nMinneapolis Symphony Orchestra Concert (with Claudio Arrau, pianist)\nFriday evening, November 7*\nUniversity of Minnesota Theatre (G. B. Shaw: ’’You Never Can Tell’1)\nFriday and Saturday evenings, November 7 and 8\nMinnesota-Purdue Football Game, Saturday afternoon, November 8*\nThe N-A-E-B NEWS-LETTER, published monthly, is distributed from\nthe national headquarters office at the University of Illinois. N-A-E-B\nmembers and associate members receive the NEWS-LETTER as part of\nmembership service. Non-members may obtain the publication at a\nsubscription rate of $5.00 per year. All inquiries regarding subscriptions\nand distribution should be addressed to: NAEB, 119 Gregory Hall,\nUniversity of Illinois, Urbana, Illinois. Editorial copy and inquiries\nconcerning editorial matters should be sent to the Editor, Burton\nPaulu, Station KUOM, University of Minnesota, Minneapolis 14,\nMinnesota."
}