{
  "id": "d1414-10",
  "text": "From THE BILLBOARD\nSeptember 20, 19E>2\n. miS OF MANKIND\n(A Study in Language)\nRADIO—Reviewed at a special pre-\"broadcast hearing at WNYC, .Newfork.\nProduced by the Canadian Broadcasting Corporation, under the supervision of the Adult\nEducation Committee of the National Association of Educational Broadcasters- Super¬\nvising producer. Dr. Walter Goldschmidt, professor of anthropology and sociology.\nUniversity of California, Los Angeles. Producer, Andrew Allen* . .. ^\n\"Ways of Mankind,H produced by the Canadian Broadcasting Corporation under\nthe supervision of the NAEB, is educational programming at its best, and easily the\nmost impressive of the three series sponsored by the Ford Foundation grant* The show\nreviewed, a half-hour documentary tagged \"A Study in Language,'1 was witty, literate\nand wholly adult—in the finest tradition of British broadcasting; yet sparked with\nthe lift and breezy pacing of American radio at its best.\nParadoxically, although its format was probably the most informal of the\ntrio, the program was also the most informative- The show packed an amazing amount\nof interesting data (on how words make the the world go round) into a half-hour,\nincluding such fascinating tidbits as the fact that the Arabs have 1,000 words for\n\"sword\" and the Eskimo language doesn't have a word for \"snow.\" They consider the\nwhite stuff so important that they use a string of different phrases to describe it\nunder varying conditions—falling on warm days, etc.\nBrisk Clip\nThe show moved along at a brisk clip, via urban, tongue-in-cheek commen¬\ntary; the use of varied voices and accents, and some wonderfully colorful wordage on\nthe part of the scripter. For instance, use of initials as words—D.P*, U.N., etc.—\nwas termed \"the compressed wreckage of phrases.\"\nAmong the most effective script devices used to \"humanize\" the science of\nsemantics (and translate it into terms of everyday living) was that employed to\nillustrate the commentator1s statement that \"language reflects the culture of a\ncountry.\" This point was emphasized by dramatizing the telling differences between\nwords spoken by mothers in each land when reprimanding a naughty child, (e.g.,\nAmerican mothers say \"Be good\"; French, \"Be wise\"; Swedish,\"Be friendly and kind1 ;\nGerman, \"Be in line—conform.\")\nSubjects explored on other \"Ways of Mankind\" programs, (\"Ethics,\" \"Author¬\nity,\" \"Museums,\" etc.) should offer even more scope for the CBC's sophisticated\npackaging technique for the. documentary."
}