{
  "id": "d1414-11",
  "text": "From THE BILLBOARD\nSeptember 2D, 195>2\nPEOPLE UNDER COMMUNISM\n(The Music and the Dream)\nHADiO—Reviewed at a' special pre-broadcast hearing at WNYC, New York.\nProduced by the National Association of Educational Broadcasters under the supervis¬\nion of Dr. Harold H. Fisher, chairman of the Hoover Institute and Library, Stanford,\nOalif., Russian Research Center, Harvard and Columbia University. Writer, Milton\nGeiger. Narrator, Arnold Moss. Music, Wladimir Selinsky.. \nThis hour-long documentary series is one of the most ambitious projects on\nNAEB’s new programming agenda. It is also a program that the NAEB may well take\npride in, both for its excellent production values, and the fact that it shuns flashy\nappeals to the emotions in favor of an intellectual approach to its subject.\nLatter road is certainly more difficult to travel# However, once its\ndestination is reached, the impact on the senses is even more shattering than that\nproduced by melodrama alone, since it reacts on both the mind and the emotions.\nOn the show reviewed, ’‘The Music and the Dream,\" the intellectual approach\nwas particularly effective, because it was applied to a field of Communist activity\nthat is still something of an enigma even to our own State Department, the mystery of\nthe Asiatic and Middle Eastern mind and why the Communists have been more successful\nin those countries, propaganda-wise, than America.\nThe pattern of political seduction followed by the Soviet in these lands\nwas set forth in realistic detail (via dramatization), beginning with Russia1s calcu¬\nlated generosity to the poor, and ending with the people’s complete subjugation-\nbound by bread to Stalin and split apart in their own ranks by the Communists’ effec¬\ntive divide-and-conquer technique of cold warfare.\nThis drama was played out against Wladimir Selinsky’s compelling musical\nscore, and underscored by some prominent Americans’ fearless analysis of exactly\nwhere and how we failed to reach the Oriental mind, and what we can do to avert sim¬\nilar disasters in countries still wavering between us and the Red Army. “Go to the\nEast with humility,* said Justice Jackson, “and help them plant ’rice roots’ like our\n’grass roots#’\"\nTragic Account\nThe most forceful argument for America to take stock of its methods in the\nEast was made during the last half hour of the program, when the citizen of a Commun¬\nist-controlled Chinese village told the story of his gradual disillusionment with the\nparty. This restrained tragic account of how a village was betrayed was more power¬\nful than 100 fiery, breast-beating narrations.\nCommentator Arnold Moss handled a difficult job with commendable ease, and\nscripter Milton Geiger captured an authentic feeling of the East in his descriptive\nnarratives. Credit for the program's unusually frank and honest appraisal of the\nsituation belongs to the astute supervisory committees of Harvard, Stanford and\nColumbia."
}