{
  "id": "d1762-1",
  "text": "-2-\nnow before the National Legislature that will be of advantage to radio broadcasting.\n\"Our situation is peculiarly advantageous in a certain sense. We can have all the\ntime we can use. Our problem is not like that of stations in more crowded areas—\nto get time on the air. It is rather to fill our time with material so attractive\nthat we can win that popular support without which no radio station can continue\nto perform.\n\"We have complied with every request of the Federal Radio Commission in manner and\nin spirit in accordance with the suggestions in your bulletins. We will gladly\ncontinue to assist in every possible way with this great movement—to make radio\neffective and appreciated in popular education.”\nFrom time to time the various college and university broadcasting plants have been\nconfronted with real problems relative to the Federal Radio Commission's rulings,\netc. Now MAD, the University of Oklahoma Station, is beginning its \"seige\" of\nunpleasant incidents in this regard. Below you will find a sample letter addressed\nto the Honorable T. P. Gore, United States Senator from the State of Oklahoma, which\nis self-explanatory. May I offer this explanation, however, that the Federal Radio\nCommission insists on assigning WLAP, a commercial station of Louisville, Kentucky,\nthe frequency of 1010 kilocycles. Kindly note the attitude of the Federal Radio\nCommission even in the face of convincing facts that have been presented before\nthem at the expense of our sister station, KGGF of Coffeyville, Kansas, with whom\nwe share time. In face of all protests in the last few months on the part of KGGF,\nMAD, and others, we are now informed by the Federal Radio Commission that the\nmatter is set for hearing on April 11 and that WNAD will have the right to be heard\nin the hearing at Washington, D. C. FINE STUFF'.'.'. Educational stations throughout\nthe nation are wondering when the Federal Radio Commission will ever realize that\nthe educational institutions of the various states cannot afford to \"beat a hot\npath\" to Washington every thirty or sixty days to attend a hearing on a matter which\nshould not be forced upon them. Our last letter of protest addressed to the\nHonorable T. P. Gore soliciting his aid in the matter is as follows:\n\"For the past several months we have corresponded with you relative to a problem\nconfronting Radio Station WNAD, University of Oklahoma, Norman, Oklahoma. It is\nin the matter of the application of Radio Station FLAP of Louisville, Kentucky, for\na permanent assignment on 1010 kilocycles. As you recall, Radio Station WLAP is\nowned by the American Broadcasting Corporation of Kentucky. Some four or five days\nago their attorneys, Littlepage, Littlepage & Spearman, attorneys located in the\nUnion Trust Building, Washington, D. C., wrote me a letter attaching statement of\nfacts to be proved at the hearing before the Federal Radio Commission (File No.\n2-SA-B-17) which they expect to establish for Radio Station WLAP.\n\"Radio Station MAD of the University of Oklahoma as well as Station KGGF of\nCoffeyville, Kansas, our sister station with whom we share time, will be handicapped\nin case the Federal Radio Commission grants the request of the American Broadcasting\nCorporation of Kentucky and allows Radio Station WLAP to operate on 1010 kilocycles.\n\"The attorneys state in part (kindly see their File No. 2-SA-B-17), 'Accurate field\nstrength measurements of the signals broadcast by Station WLAP have been and are\nbeing made in the vicinity of other stations licensed by the Federal Radio Com¬\nmission to operate on the frequency 1010 kilocycles.' May I advise that the owners\nof our sister station, KGGF of Coffeyville, Kansas, (Mr. H. J. Powell and Mr. Platz),\nhave at their own expense made such tests and found that there is decided interference.\nOn the basis of this there is no question but that interference would be recorded for"
}