{
  "id": "d1762-4",
  "text": "-5-\nChicago, telling us of'the new EX-4180 frequency monitoring equipment which is to\nsell for $675. We are writing to see if any educational discount is to be allowed,\nbut I rather doubt it.\n* * * *\n\"If you have not seen the literature on this apparatus, write to Mr. Vance. His\nletter states that orders placed now will be delivered in May. We are ordering\none.\"\nFrom Mr• E. E. Clark, Operator, Station WCAT, South Dakota State School of Mines,\nRapid City, South Dakota, we received the information quoted below. (This is in\nresponse to our recent request for all member stations to file certain information\nwith the various Congressmen, the Federal Radio Commission, Mr. Armstrong Perry,\nand others.) Mr. Clark in summarizing the points relative to WCAT states:\n\"(1) Power, time and frequency used by station April 1, 1927: 50 watts, unlimited\ntime, 1250 kc.\n(2) Po?;er, time and frequency assigned by the Commission in June, 1927: 100 watts,\nunlimited time, 1210 kc.\n(3) November 11, 1928, changed to 100 watts, unlimited time, 1200 kc. Remained\nas above until January 27, 1932.\n(4) Commission reduced time to 4 hours daily January 27, 1932. Hours assigned\n9:30 - 11:30 A.M. and 12:30 - 2:30 P.M., C.S.T. Reduction of time and\nhours assigned has not interfered with our present program but is going to\nseriously affect a contemplated expansion of equipment and program.\n(5) This station has not made a request for improvement of time, power, or\nfrequency as yet.\n(6) No applications are pending before the Commission at this time, although\nwe intend to apply for a construction permit for installation of new equip¬\nment in the near future.\n(7) Hearing brought about by the Commission November 4, 1931, charges: (a) Not\nusing enough of time allotted; (2) Existing equipment of such a nature that\nfrequency and modulation standards set up by the Commission cannot be met.\nHearing resulted in reduction of time as stated in (4) and renewal of license\nuntil June 1, 1932. Cost to station, $250.\"\nFrom Dean H. M. Crothers, Station KFDY, South Dakota State College, Brookings,\nSouth Dakota, we have received the following summary relative to suggestions sent\nto members of Congress, Mr. Perry, and others:\n\"1. KFDY was operating on 1000 K.C., 500 watts in April 1927.\n2. June 1, 1927, assignment was changed 760 KC, 500 watts, time unlimited.\n3. August 18, 1927, special Order 8° assigned Station KMA, the May Seed and\nNursery Company, Shenandoah, Iowa, also station KVKH of Shreveport to 760 KC,\nand directing Station KFDY to use time not used by KMA. This order resulted\nin the interruption of our noon broadcast of markets and agricultural informa¬\ntion which has been a continuous service for four years. Vigorous protest\ncoupled with the interest of our senators and representatives finally resulted\nin not a modification of the order, but in an agreement from Station KMA to\nyield the time for this service. Apparently this step was suggested to Station\nKMA by Commissioner Bellows.\n4. On November 1, 1927 Station KFDY was directed to share time with WAAW, Omaha\nCrain Exchange. No serious difficulty was encountered in retaining our noon\nprogram.\n5. December 1, 1927, KFDY assigned to 550 KC, 500 watts to share time with WDAY,\nFargo. North Dakota. No serious difficulty in retaining desired noon hour for\nour program.\n6. March 9, 1928, at our request KFDY was allowed 1000 watt power on 550 KC as"
}