{
  "id": "d1888-2",
  "text": "NAEB NEWS LETTER..\nFCC SETS WQST CASE FOR HEARING\nPAGE 3\nSeptember I. 1943\nThe Federal Communications Commission decioed on August 17 to hold another\nPUBLIC HEARING ON AN APPLICATION FOR RENEWAL OF THE LICENSE OF RADIO\nstation WGST, Atlanta. No date was set. Until final action is taken, the\nstation continues to operate under temporary authority.\nFCC Chairman James L. Fly and another member of the Commission, T. a. M.\nCraven, voted-against holding another hearing. They were overruled by the\nMAJORITY.\nThe Georgia School of Technology holds the license for operation of station\nWGSTo However, the FCC has charged that the school made an operating\nagreement with southern broadcasting stations, incorporated, which transferrec\nACTUAL CONTROL® At ONE OF THE HEARINGS THE SCHOOL PROPOSED THAT THE\nAGREEMENT WITH THE INCORPORATION BE TERMINATED, AND THAT THE SCHOOL\nEXERCISE COMPLETE CONTROL. PRESUMABLY THE NEW HEARING WILL 0E HELO TO\nDETERMINE WHETHER THIS PLAN H^S BEEN PUT INTO EFFECT.\nALFRED t. duPOUT RADIO AWARDS FOUNDATION\nThe Alfred I. duPont Radio Awards Foundation is now established upon a\nPERPETUAL, FUNDED BASIS WHICH ASSURES AN UNINTERRUPTED CONTINUITY OF THESE\nANNUAL AWARDS® A CERTIFIED FACSIMILIE OF THE FOUNDATI ON AGREEMENT IS\nBEING FURNISHED TO ALL RADIO STATIONS AND COMMENTATORS FOR THEIR PERMANENT\nREFERENCE AND INFORMATION.\nThree annual awards are provided now in the amount of ij>1,000.00 each as\nDESCRIBED IN THE AGREEMENT, TWO FOR RADIO STATIONS AND ONE TO A RADIO\nCOMMENTATOR, AS SELECTED BY THE COMMITTEE OF AWARDS. THE AWARDS FOR 1943\nWDLL BE MADE DURING THE EARLY PART OF 1944, PROBABLY DURING THE MONTH OF\nMarch. In order that the judges may have adequate time for proper con¬\nsideration OF ALL ENTRIES IT WILL BE NECESSARY FOR ALL NOMINATIONS AND\nSUPPORTING DATA TO BE RECEIVED BY THE SECRETARY ON OR BEFORE DECEMBER 31,\n1943. Due to the volume of the material submitted, no part of it will be\nRETURNED AND IT IS THEREFORE REQUESTED THAT ONLY COPIES OF VALUABLE PAPERS\nOR DOCUMENTS BE USED AND THAT THESE BE AS CONDENSED AS POSSIBLE FOR CON¬\nVENIENT EXAMINATION. THE DECISION OF THE JUDGES, CONSTITUTING THE\nCommittee of Awards, will be final and conclusive in all respects.\nFCC ACTIONS\nWOK Iowa State, was granted special authorization to operate from 6 a.m.\nTO LOCAL SUNRISE WITH I KW, FOR THE PERIOD ENDING FEBRUARY I, 1944.(AuG. 6)\nV.’BEZ, Chicago Radio Council, was granted authority to construct station\non 42,500 KC, with I KW power. (Aug. 3;\ni/itjQC State COLLEGE OF WASHINGTON, WAS DENIED PETITION TO MODIFY FCC FREEZE\npJuCY OF 22, I0«. AND* TO STRIKE ISSUES 6*7 AND TO AMEND NOTICE\nOF HEARING IN REGARD TO APPLICATION FOR MODIFICATION OF LICENSE. (AuG. 0)\n<HBEZ, Chicago Radio Council, vas granted license to cover construction\nPERMIT. (Aug. 26;\n—-SCHOOLEY"
}