{
  "id": "d149-101",
  "text": "2.\nUniversity has indicated verbally that its\nplans for the biennial budget period between\nJuly 1, 1969 and June 30, 1971 call for de¬\nstruction of one of the buildings presently\noccupied by the network. The proposed move\nwould result in a marked improvement in phys¬\nical facilities allowing increased efficiency\nof operation.\n2. Unity. The physical separation of NAEB and\nparticularly of National Educational Radio from\nthe network function creates inefficiencies.\nCorrespondence intended for the network is routed\nto the Washington office and vice versa. Tele¬\nphone and personal inquiries are mis-directed\nbecause of the physical separation. Adminis¬\ntration of the network by the manager is hamp¬\nered by lack of contact with the NER Executive\nDirector and the balance of the NAEB staff. The\nmove would result in increased supervision, im¬\nproved coordination and proper control.\n3. Distribution. Currently, program materials\nare distributed on tape by mail. From Urbana,\nmost materials are routed through the Chicago\npost office for dispatch. Distribution would be\nenhanced by locating the network in a metropolitan\narea with superior postal services. Geographically,\nit appears that the mid-western location holds\ncertain advantages. Our examination of patterns\nof mail distribution lead us to believe that, in\nfact, the speed will increase when the tape net¬\nwork is in proximity with a key postal center.\nThis is particularly true in regard to air mail\ndistribution of programs containing material\nrequiring rapid dissemination.\n4. Production Facilities. At present, the net¬\nwork lacks the necessary capacity to produce or\nedit program material. In the main, this work is\ndone prior to the arrival of the tape in Urbana.\nProduction facilities would be available from one\nor more educational radio stations in the Wash¬\nington, D. C. area.\n5. Future Expansion. The future growth of edu¬\ncational radio will result in expanded program of¬\nferings via tape, the reactivation of the National\nEducational Radio Network’s Public Affairs Bureau"
}