{
  "id": "d149-25",
  "text": "ESSEX COUNTY CULTURAL & HERITAGE COMMISSION\nHALL OF RECORDS - ROOM 558\nNEWARK. NEW JERSEY 07102\nTELEPHONE\n642-7800 EXT. 247\nR. Bruce Rltson\nVice-Chairman February 27, ]969.\nRobert A. Carpiano\nliahlon L. Fast\nW. Elmer Johnson\nJohnH. Macy , Jr., President,\nCorp. of Public Broadcasting,\n545 Madison Avenue,\nNew York, N. Y.\nMrs. Anthony C. Blast\nChat naan\nDear Mr. Macy:\nI recently had the pleasure of viewing both you and your Chairman of the Board,\nMr. Frank Pace, being interviewed by Edward Newman on the TODAY Show.\nThe discussion was of great interest to me because of my recent appointment\nto the Essex County Cultural & Heritage Commission.\nWe nave been chosen by the Board of Freeholders of Essex County as proposed\nby the State legislation under Assembly Bill II20, copy of which I enclose. We\nere extending a public service and it is our main job to make the public aware\nof, get them to become involved in, and help them to enjoy all the cultural and\nheritage activities existing in our County.\nYour statement regarding local govenment involvement, led me to write yoli and\n(ask how as a govenment agency we can be useful to a service such as yours.\nHow would an agency such as yours coordinate with a local government group\n'and what was your reason for making your statement.\nWe would be most grateful for any and all considerations extended to us. A\n; cultural and heritagejsommission is to be set up in every county in New Jersey\nand we have just been in existence since November, J 968. We feel through the\nassistance of all public medias, such as radio, TV, newspapers, magazines,\npublic involvement in municipalities there is much we can accomplish.\nThank you for allowing me this time in your busy schedule, but we are sincerely\ninterested in doing a thorough job and only by pursuing all avenues, can this be\ndone. Looking forward to hearing from.\nMost sincerely,\n^)n /OfaAA\n(Mrs.) Ajzthony C. Blasi, Chairman,\nEssex County Cultural & Heritage Commission\ncb: mab"
}