{
  "id": "d1801-13",
  "text": "-14-\nFIRST LISTEN5R-C PETROLLED FM STATION GOSS OH AIR IN WASHINGTON\nThe Nation*S' first listener-controlled cooperative FI' station went on the air in\nNovember in Washington, This new 20-thousand watt independent outlet is expected\nto roach listeners with a 65-mile radius of the capital. Call letters are WCFM,\nAlthough a commercial station, NCFI. plans to pay out \"profits” ta its investing,\nlisteners, chiefly in improved facilities and programs. It is financed primarily\nby some two-thousand stockholders who put up amounts ranging from ten to one\nthousand dollars each.\nAmong the groups behind the new project are the League of Women Voters, the Red\nCross, and the ‘-arent-Teacher1s Association, These and other participating groups\nwill be represented on a listener*s council and will act in an advisory capacity\nto the station*\nPEA30DY ADDS NEW AWARD CATEGORY\nA new award has been added to the George Foster Peabody radio prize list. Addi¬\ntion to the so-called \"Oscars\" of the broadcasting field will be for the most\noutstanding program in international understanding. Deadline for entries is\nJanuary 8*.\nOlder Peabody prizes include awards for community or regional welfare efforts by\na local or regional station,outstanding reporting and interpreting of the news,\noutstanding entertainment in drama, music, educational programs, and children’s\nprograms•\nAwards are administered by the University of Georgia journalism school with the\naid of an advisory board, and presented each spring in New York,\nIOWA STATU TRACKER'S COLLEGE AIRS HEN SERIFS ON WSUI & NCI\nSince September 20, 1948, the Iowa State Teacher’s College, in Cedar Falls, has\noriginated a half-hour schoolroom program every day, Monday through Friday at\n2:30 p.m. for broadcast over NAEB Station WOI at Iowa State College in Ames,\nOn the same date a series of Adult Education features was inaugurated on NAEB\nStation WSUI at the State University of Iowa in Iowa City. ISTC programs present¬\ned over these outlets are carried by remote lines from the Cedar Falls studio to\nthe two outlets.\nThe schoolroom programs offer instruction in vocal and instrumental music,\ncorrective speech, nature study, the social studies, and children's literature.\nIn loss than two months, ISTC Radio Office has received over 2,000 requests from\nIowa teachers for the manuals that are used in connection with the \"School of\nthe Air\" programs, reports Herbert V, Hake, Radio Director at ISTC, \"On the\nbasis of these requests, and an allowance of only 5 pupils per teacher, the man¬\nuals in actual service are accommodating at least 10,000 school children in\nIowa every week,\" he adds,\n\"Foremost among the advantages of the present radio outlets,\" says Nr. Hake, who\nrecalls an earlier association of the College with various commercial stations,\n\"is the quality of the audience to which the College now has access. Through\nmany years of distinguished educational service both W0I and WSUI have developed\na family of listeners which is cordial to the serious type of programs originating\nat the College,"
}