{
  "id": "d1801-14",
  "text": "-15-\nF1A DIRECTORS TO OPPOSE NAB MERGER\nDirectors of tho FI. Association, meeting in Chicago December 10-11, discussed\nways and means to strengthen the organisation and voted to oppose the threat\nof tho National Association of Broadcasters to absorb FI.A into membership.\nReports that NAB was making a bid for FI A members stirred FN executives in New\nYork and Washington, Both Nilliam T.rare, FMA president and Everett Dillard,\nformer FI A president went on record against the move before the director’s meeting.\nA spokesman for Ft:A in New York prior to the Chicago meeting declared that absorp¬\ntion of the FMA by the NAB would virtually moan the discontinuance of an active\nvoice in the field of Frequency Modulation.\nK. R. SI ITE FORMS NEW TRANSCRIPTION COMPANY\nK. R. Smith, formerly vice-president of Muzak, New York, has purchased the manu¬\nfacturing facilities of the NorId Broadcasting System and formed a new company\nfor the processing and pressing of transcriptions,\nSTROMBERG-CAPXSON EXPANDS TV PLANS\nDr. Ray Kanson, president of Stromberg-Carlson stated tho company’s present pro¬\nduction capacity of 3000 TV sets per month will be increased to 5000 by mid-1949.\nFormer assembly linos at the plant are being rapidly converted to television\nreceiver production. The company’s television station WHTM will beg?jn broadcasts\nsometime in the second quarter of 1949 from Pinnacle Hill in Rochester,\nSMALLER FCC STAFF LIKELY IN 1949—I ORE SLOW DOWS?????\nRumor from the budget bureau headquarters indicates the FCC may face a financial\ncutback next June with consequent cuts in personnel and a further slowdown in\nprocessing of license applications. Same appropriation (06,240,000) would be\nmade for next fiscal year but that sum would have to take care of an estimated\n0440,000 in salary increases this year, thus accounting for cut-back,_ Budget\nbureau recommendations are not always final, but President’s recommendation\nusually comes as a matter of course.\nSUNDAY SHOWS HIT BY CANADIAN RELIGIOUS LEADERS\nProtest at the failure of both private and government radio stations to schedule\nSunday evening religious services was contained in a resolution passed by the\nexecutive council of the Church of England in Canada in a recent action. No\nchurch service or other religious program, the resolution stated, is broadcast\nover any major Canadian station after 6:00 p.m,\nFN coil TTTEE3 NAKED FOR PRESS AND FCC\nAppointment of an FM newspaper committee and the re-appointment of a liaison\ncommittee to the FCC was announced this month by William E. arc, president of\nFMA. Heading the newspaper committee will be Josh L. Horne, publisher of the\nRocky Mount (F.C.) Evening Telegram and operator of WCEC-FM and heading the FCC\nliaison committee will be C. M. Janbky, Jr,, of Jansky, Jansky & Bailey, Washing¬\nton D.C."
}