{
  "id": "d1801-17",
  "text": "-18-\nFEDERAL COl'TDNICATIONS COMMISSION\nNovember 1, 1948 »JS—APPLICATIONS—ACTIONS December 7, 1948\nEDUCATIONAL\nPRS-MARBC ENGINEERING CONFERENCES TO BE HELD\nAn informal engineering conference to discuss matters pertinent to preparation for\nthe Forth American Regional Broadcasting Conference scheduled to be convened next\nSeptember(1949) will be held in the Auditorium of the National Museum, Constitu¬\ntion Avenue at 10th Street in Washington D.C., starting December 7, and continuing\nfor about three days. The purpose of the conference will be to assist in the\npreparation of proposals of the United States to be circulated to other partici¬\npating countries before May 2, 1949. Any licensee or other person interested in\nstandard band broadcasting is invited to attend and participate.\nILLUSTRATIVE TELEVISION AND FK CHANNEL STUDIES ISSUES\nTwo studies on effects of tropospheric interference on television broadcast\ncoverage and a similar study on FM, are now available from the -CC1s Office of\nInformation. The studies are for illustrative purposes only, and are not propos¬\nals. The Commission has also announced that additional engineering conferences\non Docket Fos. 8975, 8736 and 9175, dealing with revision of the television and\nFM engineering standards will be held November 30, and December 1 and 2.\nORAL ARGUMENT ON PROPOSED MULTIPLE OWNERSHIP RULINGS\nThe FCC has ordered the holding of oral argument on its proposed rules relating\nto multiple ownership of AM, FM, and Television stations. The argument will be\nheld January 17, 1949 in Room 6121, New Post Office Building.\nEDITORIAL AMENDMENTS TO PART 12 of the FCC RULES\nA number of editorial changes have been made in Part 12 (paragraph 62) of the ^FCC\nRules, governing amateur radio service. The changes do not make any substantive\namendments,\nGOLDSMITH ASKS FCC TO REMOVE 500 FOOT LB IT ON TV ANTENNA\nRemoval of the present 500-foot limit on TV antenna towers was urged in late\nNovember by Dr, T. T. Goldsmith of Dumont in an engineering conference on tropo¬\nspheric effects before the FCC, His proposal followed general agreement among\nFCC and industry engineers that tower height does not appear to increase inter¬\nference between stations,\nMarcus Colin, general counsel, National Association of Broadcasters, presented\na special petition to the FCC in late November on behalf of five daytime\nstations, asking the FCC to abandon its flat rule against further STA's*\nThe petition, stating that the FCC has already honored its.own rule on STA's\nmore in the breach than in the observance, quoted conflicting reasoning on\nvarious STA and special-time decisions.\nThe five day-time stations included WNYC, New York City Municipal stationjWl'IAI\nUniversity of Oklahoma in Norman,- WHCU, Cornell University, Ithaca, N.Y,;\nWKAR, Michigan State College, East Lansing; and ¥01, Iowa State College, Ames,"
}