{
  "id": "d1801-22",
  "text": "RBH-32\nRemarks by Benjamin Cottons , jSeaorai Counsel for the\nFederal Communications Commission,, to members of the\nNational Association of Educational Broadcasters at\ntheir annual meeting October lZe 1948.\nI hsv© been asked to convey to you the Commission9 s regrets that non© of\nthe Commissioners -was able to be tore c The entire Commission has been en¬\ngaged for the past five days in an important hearing which Is expected to\nrun for several days more. But their absenoe should not be taken as a lack\nof appreciation of the importance of meetings of this kindo\nI a®, however,, delighted to have th© opportunity to b© here* Your President *\nMr* Bull, has suggested that I apeak frankly to you about some Commission\nproblems that concern you* and u®„ 1 welcome this suggestion* and 1 shall\nspeak frankly and freely to you exempt on those matters which are presently\nawaiting decisions by the Commission* I wish first to discuss certain pro¬\nblems in which I know you are interested* and then give *ay mm views about\nthe immediate future of educational broadcasting in the light of th© broad\nproblems facing th© Commission*\nCLEAR CHANNEL HEARINGS\nFirst* a word about the clear channel hearings* 1 bring this up not because\nX want to but because I know you expect ms to* Many of you operate daytime\nstations on clear channels and hence have an active interest in this vener¬\nable,s but yet unresolved* proceeding. I am familiar’ with the testimony of\nyour representatives before th® Commission itself and more recently before\nthe Senate Committee on Interstate and Foreign Commero© which* under the\nresolution of Senator Johnson* inquired, into this matter* Aa you may know*\nas a result of this hearing the proposed l^hite Bill contains a provision\nlimiting clear channel stations to &Q kw power, Bie Commission, in antici¬\npation of a coming confer©nog on g. renewal of the North jfaaerioan Regional\nBroadoastlng Agreement is now working up its fiadiags and conclusions on\nthis Tlighly controversial issue e 'Atom this report will be is sued f what it\nwill contain and the\" meaning it will have for your group I unfortunately am\nunable to discuss at this time* It is a complex problem with both national\nand international considerations thoroughly intertwinedo\nSPECIAL NIGHTTIME AUTHORITY\nImagine a Yankee compelled to defend the civil rights program at a Mssiss-\nippi convention of states’ rights Democrats and you can* in some measure*\nappreciate the frame of mind in which I approach ray next subject* I refer,\nof course* to the Commission5, s recent order abolishing special temporary"
}