{
  "id": "d1801-24",
  "text": "I think you should take particular note of the advice whioh the Chairman\npy.vo about television in that a pee oh.\nFM AMD EDUCATION\nHow as to FM. I would be less than frank if X told you the FM frequen¬\ncies got \"aside for your exclusive us© in the 1945 allocation plan were\ninviolate. They are not.. The Commission, as those of you who follow\nour own releases and the trade press are well aware, is under enormous\nand daily increasing pressure to give additional space in the spectrum\nto many diverse services, both commercial and non-commercial, Taxioabs,\npower companies, newspapers, police departmentsp railroads, utilities*, and\n©van grave diggers are oaoh crying to be served. Indeed, as I have already\nindicated, the reason the Chairman is not her© today is the necessity of\nhis presiding over a lQ~day hearing at which the conflicting interests of\nsuch groups and many others are being passionately aired,?\nWe cannot possibly fully sotiafy the demands of all of those seeking fre¬\nquencies, even for worthwhile purposes. Many will necessarily bo dis¬\nappointed. Despite the great technological advances of recent years, there\nare not yet enough frequencies to satisfy the demand? Under these circum¬\nstances this question naturally arisesg Sow long before the disappointed\nones will covetously eye the rich untapped veins between 88 and 92 mega¬\ncycles? In large measure, that depends on you.\nMost of the interests clamoring for .frequencies are articulate, resouroeful,\nand well organised. They know what they want?, they know how to make a com¬\npelling and persuasive appeal. And it cannot \"be denied that many oi their\nrequests are clearly in the public interest? happily, educators, though\nwith leas physical resources at their commano, are still able to present a\nstrong case for their band. Ho on*? yet denies that education is in the\npubiio Interest. Unhappily, on the other hand, comparatively few educators\nand trustees of universities and state legislators yet seem to realize that\neduoatlonaT radicals'id the pubiio interest? Consequently, the case for re¬\nserving frequencies does not have the force it should0\nHere I wish again to refer to Chairman Coy's recent speech at Indiana Univer¬\nsity. He gave this warnings - \"I must point out that radio channels are too\nvaluable to be left in idleness. If educators fail to utilize them, they will\nhave lost their second, and perhaps last chance to own and operate radio stations\nI recall that Mrc Fly shortly before he left the Commission made a similar state\nment end I know Cliff Durr more recently has expressed like views.\nThese words are harshly realistic0 They are*.. 1 realize*, addressed in part to\nthe wrong group. I should*, perhaps, be making these remarks to the large num¬\nber of persons in or associated with education whose shocking inertia or lack\nof interest in the face of a great and socially obligatory responsibility\nthreatens to bring such a tragedy to pass. But the warnings must necessarily\nbe addrosaed to you. In this field you are both tho vanguard and the mission¬\naries. You know and have demonstrated the educational value to our democracy"
}