{
  "id": "d1801-3",
  "text": "FCC AITFOUHCES HEARINGS ON MJLTIPLE OIR1ERSTIIP\nThe FCC announced that its hearings on a proposed new formula for the limitation\nof multiple ownership of broadcast stations will be held here January 17, Limit\nfor AM stations under common control would bo set at seven, with the limit six\nfor FM and five for TV stations. The maximum in which stock representing less than\ncontrol could be held by a single individual or group would be 14 AM, 12 FM and\n10 TV, with these maximums permissible only in the event no controlling interests\nare held. Combinations of control and less than control would be on a sliding\nscale, with control given tiri.ee the weight of an interest less than control.\nThus, with a total of 10 permissible for TV, a single group might control two sta¬\ntions and hold smaller interests in six, or control three stations and hold smaller\ninterests in form*, etc.\nPLi'rSYLVAriA RADIO 3TTTDY DISCLOSES LI3TTIHG PREFEREHCBS\nThe Pennsjrivania Agricultural Extension Service has just printed a cooperative\nPennsylvania-USDA study made in Berks, becoming, and Mercer counties to county\nagent radio programs. Men are the most frequent listeners among the full-time\nfarmers with some high school education and ages of 30-35 years. Twenty to 40%\nof the women in the three counties are reached in the course of a month—over half\nduring the year. TJomen prefer noontime broadcasts.\nStudy shows radio reaches about as many' people who have no contact with Extension\nservice as it does those who do have such contacts.\nCopies of the study may be obtained from Elton Tait, Extension Radio Specialist,\nState College, Pennsylvania,\nCHICAGO RADIO CCUFCIL IE1.BERS REPORT OH YEAR’S ACTIVITY\nThe Chicago Radio Listener’s Council in its initial fall mooting reported first\nyear activity had been spent on research, background, exploring the field generally\nand establishing contacts.\nProgram chairman, Ruth M. Kogan, indicated group feeling that concentration on only\none of the mass media, e.g. radio, was not enough, no matter how well the job\nmight be done, since new and equally potent media are taking shape, and will in¬\nevitably assume their places.\nThe Chicago council has volunteer listeners in various areas, checking stations\nbroadcasts, who report back to the central group, to better enable the members to\nachieve meaningful listener participation on both the planning and receiving fun¬\nctions of communication.\nST. LOUIS STATION FIND FM STATION ’’IHSURAITCE”\nRadio Station KXLW was.able to put on an FM broadcast recently, but its regular\nAH' station was off the air. Both stations were closed down for a day by an\nunscheduled strike of A-F-L engineers who walked out after a dispute over\nwhether they or disc jockeys should play records over the air.\nThe FM broadcast resumed the following day from a St. Louis hote],continuing\nin the face of the AM silence."
}