{
  "id": "d1801-6",
  "text": "-7-\nKQAC OREGON’S CMTSTATTPH\nTlie Oregon State Broadcasters Association at its mooting last week in Portland\nappointed JaF.cs M. Norris, program manager of the state-owned station KOAC, as\nexecutive decretory of the organization. The now appointment of an executive\nsecretary xor the organization was made folloimlng a report of a special committee\nneaded by Lee Jacobs, of stations KBKR, KLBN, and KSRV, named by President Frank\nLoggan of KBND, Bend, to study the proposals to affiliate the state broadcasters\nassociation with the Oregon State System of Iiigher Education,\nHeadquarters for the association will be maintained in the KOAC business office\nlocated in Corvallis and annual meetings of the association will be held at both\nthe University of Oregon and Oregon State College.\nTl10^0W/XGCUtive secrotary Oregon State Broadcasters became a member of the\nstaff 01 the state-owned station in 192$ and was named program manager of the sta¬\ntion 2f years ago. Ir. Morris also servos the National'Association of Educational\nbroadcasters as western regional director and is Northwest President of the Associ¬\nation for Education by Radio.\nPORTLAND PUBLIC SCHOOL K-B-P-S SALUTED EY OFFICE OF EDTTfl ATTm\\T\nCity school station, KBPS, Portland’s NAEB member was hailed as one of the finest in\nthe country by Franklin Dunham, chief of radio for the U.S,Office of Education in\na recent visit there,\nDunham, on hand to confer with Portland educators, on the use of radio in teaching,\npointed out KBPS, the only AM city-school outlet in the country, was the first\nschool radio station in the U.S*.and explained success of the local radio plan\nbecause it was shaped to fit the needs of the curriculum,\nDunham pointed out there are m^ pridian--’65 educational radio stations in the U.S.\nof which 35 have sprung up since the last\"'war. Many of these, ho said, have shuped\ntheir program after the Portland plan.\nWith Patricia L. Green,.KBPS director and assistant supervisor of radio in the\npublic schools,Dunham visited several schools and wa.s guest at a luncheon with\nschool administrators and Portland commercial station representatives. Miss Cecil\nNcKcrchor, president of the Portland Chapter of the AER, arranged a special meet¬\ning for Portland school principals and teachers to hear Dunham’s address on \"Utiliza¬\ntion of Radio by the Classroom Teacher,\"\nDunham.who recently visited Europe, is enthusiastic about the use of radio in\neducating Gorman youth. Educational programs arc being aired over many German\nstations and a .,>100,000 fund has been raised by the NAB in the U.S. to help pay for\nradio receivers in German classrooms.\nFranklin.Dunham, chief of radio for the U. S. Office of Education, Washington,\nD.C. visited KOAC this past week end. While in Corvallis the radio educator\nalso attended some oi the sessions of the audio-visua.l aids conference held on\nthe Oregon State College Campus. It was Ir. Dunham’s first visit to Corvallis\nand to the state-owned educational radio station KOAC. Mrs. Dunham was with her\nhusband on a five-weeks tour up the west coast and returned to Washington, D.C.,\nby way ox Denver and Salt Lake City, While in Oregon he also conferred with\nradio educators in Eugene and ortland."
}