{
  "id": "d1866-1",
  "text": "to accept the responsibility of serving local community needs,\npresenting programs on controversial issues, political cam¬\npaigns, etc. While recognizing the importance of purely in¬\nstructional television, he emphasized the broader role “that\nwe at the FCC expect of our educational stations.” He said,\n“I for one believe you should use your voice to participate in\ncivic matters, to air positions on issues of public importance,\nand to provide programs for that large audience whose tastes\nare not often met by commercial outlets.”\nKCTS-TV, University of Washington, hosted the con¬\nference. Rudy Bretz, vice president of Television Systems\nPlanning, served as the resource authority on new develop¬\nments in ETV, and spoke at the session.\nMeetings and Workshops\nWayne State University. June 4—a one-day seminar in the\nuses of TV in education for the Canadian Association of\nDirectors of Extension and Summer Schools.\nBoston University. June 7—School of Public Communication\nalumni annual salute to graduating class. Harold Bray-\nman, director of public relations for E. I. duPont de\nNemours, speaker.\nNational Community Television Association. June 14-19. 13th\nannual convention, Philadelphia. Among speakers: FCC\nCommissioners Cox, Ford, and Lee; NAEBers John\nSchwarzwalder, general manager of KTCA-TV, St. Paul;\nDonald V. Taverner, general manager of WQED and\nWQEX, Pittsburgh; and Martha Gable, director of radio-\nTV education, Philadelphia schools. The NAEBers par¬\nticipated in a special panel to discuss the role of CATV\nin ETV.\nQueens College. July 1-August 11. Summer ETV workshop,\nconducted on graduate level.\nNational A-V Education Forum. July 18-20, Sherman House,\nChicago. As part of NAVA convention.\nWorkshop in Fund Raising. July 20-31, Syracuse University.\nOpen to college and hospital administrators and other\nfund raisers. Information from Director, Chautauqua\nCenter, Syracuse University, 610 E. Fayette St., Syracuse,\nNew York, 13202.\nAwards and Fellowships\n• Two annual fellowships of $2,000 each in communications\nmanagement have been established at the Annenberg School\nof Communications of the University of Pennsylvania, by\nAmerican Broadcasting - Paramount Theatres, Inc. The fel¬\nlowships will be awarded each year to one entering and one\nadvanced student in the school’s new two-year course leading\nto an M.A. degree in communications management. Students\nwill receive training in the regular Annenberg School curricu¬\nlum and in addition, will receive enough specific training in\nadvanced business courses to qualify for positions in manage¬\nment and business administration.\n• WGBH, Boston, has received an award for its radio cov¬\nerage of the racial issue from the American Baptist Conven¬\ntion. This is the first time in the ten years of the awards pro¬\ngram that an educational station has won.\n• Five Michigan FM stations have received a “Creativity\nin Adult Education” award for 1963 from the state’s Adult\nEducation Association for the weekly series Midweek Michi¬\ngan, which the stations co-produce. Each program examines\na different topic, with each station providing comment from\nits area. The stations are WDET, Wayne State University ;\nWFBE, Flint Public Schools; WKAR, Michigan State Uni¬\nversity; WMUK, Western Michigan University; and WUOM,\nUniversity of Michigan.\n• Douglas Wardwel'l, producer-moderator of the Connecti¬\ncut Farm Forum, has received the Pioneer AAACE Award\nfrom the Northeast Region of the American Association of\nAgricultural College Editors. The farm program, believed to\nbe the oldest continuous radio broadcast program in the na¬\ntion prepared by an agricultural college, celebrated its 25th\nyear on a special program May 9. The special broadcast in¬\ncluded a message from Secretary of Agriculture Orville\nFreeman, and program ideas by all seven men who have\nemceed the program for the University of Connecticut Col¬\nlege of Agriculture during the quarter century.\n• This year’s Wayne State Mass Communications Center\nAward of the Year went to James Schiavone, general man¬\nager of WWJ-AM-FM-TV, the Detroit News. He was cited\nfor distinguished service to educational broadcasting. Among\npast recipients of the award are Garnet Garrison, Karl Haas,\nand Kathleen Lardie.\nNews Notes\nPROGRAMS\n^ WOUB-TV, Athens, Ohio, provided exclusive live and\nvideotape coverage of President Johnson’s visit to the city\nin May, when he spoke about elimination of poverty in Ap¬\npalachia. The programs were picked up live off- air and re¬\nbroadcast by commercial stations in Zanesville, Ohio, and\nParkersburg, West Virginia. The videotape dubs were used\nby stations in Columbus, Cincinnati, and Huntington, West\nVirginia, and NBC’s Huntley-Brinkley. The speech was fed\nlive by direct pick-up from WOUB Radio to CBS and West-\ninghouse radio stations. _ _\n^ KVCR-TV, San Bernardino Valley College, broadcast, live,\nan hour press conference with Nelson A. Rockefeller. He\nwrote each member of the student production crew a personal\nletter of thanks for “an excellent job.”\n^ When President Johnson visited the University of Texas\nto deliver the commencement address and receive an honorary\ndegree, KLRN-TV was set to broadcast the main events. Just\n12 minutes before the scheduled pre-graduation show, an an¬\nnouncement came that the open-air event had been moved to\nan auditorium because of a severe weather alert. Over the\nloudspeaker, the announcer went on to say that the overflow\ncrowd could see the event on television. As rain and hail be¬\ngan to fall, KLRN staffers acted, and TV equipment arrived\nat the auditorium in station wagons, convertibles, etc. Soaked\nto the skin, cast and crew hauled the equipment in, and in 65\nminutes had a picture on the air.\nI WDET (FM), Wayne State University, has received an\naward from the American Association for State and Local\nHistory and Broadcast Music, Inc., for two series, Michigan’s\nRole in the Civil War and A Century Ago. The 'latter de¬\nscribes the thoughts and attitudes of the American public 100\nyears ago, with scripts based on actual letters and diaries of\nthe Civil War period.\n^ The University of Colorado recently presented a D/^-hour\nmusical program over KRMA, Denver. “Musical Sketchbook\nconsisted of original compositions by university music facul¬\nty. Two sketches were taped in university studios, and the\nthird was a tape from WQED, Pittsburgh, where a concert\nhad been presented previously. James Dryden, program man¬\nager, radio-TV section, University of Colorado, produced the\nprogram.\n^ The South Carolina ETV network recently presented a\nspecial program in which the ETV French dlasses of an ele¬\nmentary school presented a skit in French.\n^ WGBH, Boston, recently presented a program in which\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 119 Gregory Hall,\nUrbana, III. 61803. $5.00 a year, $7.50 including Washington Re¬\nport. Editor: Betty McKenzie. Editorial assistant: Skip Robinson.\nPhonie 333-0580. Area Code 217.\nReporters:\nRegion I —Michael Ambrosino, EEN, 238 Main St., Cambridge,\nMass.\nRegion II —Shirley Ford, WUOT, University of Tennessee, Knox¬\nville.\n—Lou Peneguy, AETC, 2151 Highland Ave., Birming¬\nham, Ala.\nRegion IV —Richard Vogl, KTCA-TV, 1640 Como Ave., St. Paul,\nMinn.\n2\nNEWSLETTER"
}