{
  "id": "d1359-0",
  "text": "Radio Child Study Club\nIowa Child Tfelfare Research Station\nState University of Iowa\nSUGGESTIONS FOR PREPARING RADIO TALKS\n1. The length of the talk should be fifteen minutes* The listener*s\nreaction is influenced by other factors in addition to length, such\nas the interest of the topic and the quality of the speaker1s voice.\nWriters are enoouraged to test the interest of their talks on small\ngroups. Sometimes a speaker needs special devices such as dramatiza¬\ntion to build up interest.\n2. Since groups have access to reading references, it is not necessary for\nthe discussion to cover the entire field. The special functions of the\nradio talks may be: (a) presenting new material, (b) motivating through\nnovel, original, and vivid examples, or (o) setting out in relief three\nor four major generalizations, thus guiding and stimulating discussion.\n3. Our analyses of reading material for parents indicate that much of it\nis far too general to be useful. To make the material useful show by\nseveral everyday practical examples how the principles are applied in¬\ntelligently.\n4. In choosing illustrations the author should keep in mind whether the\ntalk is intended for the infant, preschool, elementary school, or ado¬\nlescent course.\n5. When using statistics it is in general advisable to talk in round numbers.\n6. A significant proportion of the population between nineteen and forty-\nfive has not extended its education beyond the eighth grade. One in¬\nvestigation reported characteristics of reading materials that can be com¬\nprehended by the average parent of this type as follows: (a) low vo¬\ncabulary difficulty, that is, words understood on the average by 94%\nof sixth grade pupils? (b) simplified sentence structure, that is, a\nlarge proportion of simple sentences (average 16 per 500 words) or a\nsmall proportion of words in dependent clauses (average 19$)?\n(o) a small number of prepositional phrases (average 43 per 500 words).\nThese characteristics apply in the main to materials discussing relative¬\nly concrete relationships. If highly abstract relationships are con¬\nsidered, it is helpful to use an abundanoe of concrete examples.\n7. It is suggested that the author check the delivery of his talk to make\nsure that it is within the time allotted for the broadcast. Since it\nis not possible for the author to be present at both radio stations,\none of the broadcasts'will be given by a reader. To allow for varia¬\ntions in reading rate, the author should indicate one or two paragraphs\nwhich may be omitted, if necessary."
}