{
  "id": "d635-101",
  "text": "mwnmm\nhudl*\nIOi Officers, Board of Directors, rad Membership Committee of the National Aseocia-\ntioo of Educational Broadcasters\nFROKi Gray don Auemus, Vice-President\nDATE? May 6, 1952\nSUBJECT8 Comments On John Dunn’s Mimeographed Letter on Membership Activities, etc.\nJohn’s three letters (which should have carried the dateline for reference) indi¬\ncate serious thought on some important N,£B business and deserve careful considera¬\ntion by us all* In reference to his ^membership activities”! I*m in complete\naccord with Paragraphs 1 aid 2 xLth his ’’report on membership activities”.\nIn Paragraph 3, he asks for some help on his article on \"hhy I Am an Active or\nAssociate Member of K/.EB”* Since this ties in closely with his Paragraph 7 con¬\ncerning giving associate members \"more for their money\", let me comment on the two\njointly. His a,b,c comments under No. 7 are very sound. However, the implication\nthat members are not getting their money* s worth is to me unfounded. Through the\nNEWSLETTER,and consequently keeping up-to-date on what’s going on in educational\nbroadcasting, the associate member is more than getting his money’s worth. Add to\nthis the importance of being a part of a strong national organization—belonging—\nand the privilege of attending meetings and having a voice in the organization,\nthough not a vote, all add up to a pretty good score.\nAs far as providing associate menfoars with NAEB programs, this could be done for\nan additional fee of some kind. However, when we open the door to this type of\ndistribution then we are admitting carpus-wired stations to our network and can\nvery soon double the demand on our distribution facilities which can be done only\nat the expense and efficiency of distribution to our active station members.\nAnother reason for not providing associate members with shows is that we are\ntaking away one of the strong arguments for owning and operating your own educa¬\ntional outlet and certainly we should continue to promote very vigorously the idea\nof institutional ownership of their own facilities. Furthermore, if we provide\nprograms for associate members to distribute through commercial outlets, we can\nbe reasonably sure of the poor handling those programs will receive at the hands\nof the commercial operators. All of us have had our bitter experiences of having\nour best locally produced shows juggled and cancelled at whim by our commercial\nbrethren. Instead of this type of distribution, why not direct distribution of\nour programs to the commercial outlets upon request from them, if we have any time\nat Headquarters for handling additional coverage.\nLi Paragraph !*, John raises the question of a standard application form for member¬\nship. Sue a a form was approved at the Executive Committee meeting at Urbana in\nFebruary and adopted by the Board at Columbus. If there need to be changes in\nthis, that can be worksd out between John and Jim."
}