{
  "id": "d635-103",
  "text": "pagS 3\nsettled on it. Vfe are spinning om* wheels. It was to have bee one a part of a\n\"Manual of Operations\" iich the Executive Director ms requested to compile\nwhen the Board met in New loxfc in January, We need all of these housekeeping\nchores fcmalized into a printed or mimeographed handbook go ye will not go\nover and over the sane material year after year.\nIN R^FEIMCE TO THE PROPOSED TO THE CONSTITUTION AND BYLAWS \\\nI’m glad to see John referring to the term \"democratic processes\" and I agree\nthat the proposed amendment to the Constitution concerning the election of\nRegional Directors will strengthen the democratic process within NAEB. I am in\nfavor of the amendment as proposed except that it is much too long and involved.\nIt can be presented adequately and in about 1/3 the number of words and I would\nsuggest that tlie Headquarters office mail out the ballots, because some Regional\nDirectors might slip up on this, having them clearly masked to be Mailed back to\nthe Executive Director. There is little value in having the nomination accom¬\npanied by any statement in behalf of the nominee. I wonder also if this tyoe of\npre-convention nomination for all officers might not bo\"^sirable.\nIN HBFEZENCE 19. THE \"F.A.B. PRODUCTION CENTERS PROJECT\"*\nI would certainly agree with Jolui1 s interpretation of the Fletcher letter but\nregardless of whether we are correct or not in the interpretation, John has\nwritten one of the most significant paragraphs in the annals of the NAEBi\n\"that NAEB maintain all control over projects rather than that this\ncontrol be delegated-——\"\nThis is to me a reaffirmation of a profound belief in democracy and in the demo¬\ncratic way of getting things done. The mornant we begin accepting programs which\nare prepared specifically for us but over which we have no control, we become\ncharlatans and prostitutes* It is ridiculous for U3 to endorta and blindly\nmale® use of materials that are prepared specifically for us, or participate in\nprojects which are designed for our e iclusiv© use and yet not be expected to\nparticipate actively mid as an organization in the planning and execution of\nthose programs and projects. . Tfc&re may be instances where the only prerogative\nwe can exercise is that of censorship by acceptance or rejection of materials\non ^individual station basis but this type of indirect participation and\ncontrol is fraught with considerable danger, not only to our integrity as\neducational broadcasters but to our jobs as social scientists concerned with\nbroadening participation in idea formulation throughout the country rather than\nswaying public opinion to a pre-conceived, viewpoint.\n8 As to the thirteen points outlined in John’s procedure in administering these\ngrants, I’ve only one suggestion to make. In Paragraph 8, he uses idle term\n\"they should not be dated or of such a regional nature that they could not be\nused by others—\". I object to the use of the word \"regional\" on the grounds\nthat more Information is needed across the country concerning regional matters.\nHow about the substitution of the word \"local\" for the word \"regional\"? We have\nall acknowledged the failure of commercial radio to reach regional problems which\nare a matter of national concern and it is possible that the inclusion of the"
}