{
  "id": "d635-107",
  "text": "Hr# Seymour N# Siegel\nSeptember 17# 1952\nPage 2\nOne of the things we rolled, around at Urbana was\npossible plans for an Allerton-type seminar on educa¬\ntional TV. Bob Hudson suggests that we shoot at some\ndate in Januaxy or February# We have $5#000 from Ford,\nso I understand, set aside for this specific purpose.\nWe had discussed the possibility of getting representatives\nof the foundations, people from JCET, HAEB, and other\ngroups beginning to show interest in 1% to a meeting In\nChicago or seme other centrally located place by the\nmiddle of October so we could attempt to divide responsi¬\nbilities and areas of operation and make a more closely\ncoordinated drive for the development of educational TV*\nWe estimated the need for about twenty people at such a\nmeeting# With existing funds, the meeting will be im¬\npossible. If you know of amr place we can get 3 or U\nthousand dollars for a 3 csr 4 day session, it would be\na very fin© project for you to prerote. Such a meeting\nwould give greater direction to our Minneapolis meeting#\nIf such a meeting is not possible, the group at\nUrbana felt that we should request representatives\nfrom thsse groups as well as our own TV committee &nd\nour foundations committee to meet a couple of days\nahead of the fall convention# Give this some thought\nand do what you think best#\nYou will see from various carbons enclosed that we\nwere concerned at Urbana about the TV membership and\nfelt that the TV committee should be vigorously acti¬\nvated to ccane up with suggestions for specific services\nin TV# Perhaps you would write Dick and prod him and\nhis committee into action#\nI Blissed all of the Friday afternoon meetings when\nWilbur and I flew to Battle Creek, but I understand that\nBurton promised a very excellent convention* I have\nseen no tentative outline for the convention and, so\nfar as I know, neither has anyone else. Perhaps you\nshould check Burton on it to be sure that he is in good\nshape. I am. a bit worried that he has not sent out\nany special publications on it. Perhaps you can persuade\nhim that he should do so#\nBy telephone Ball\\s raised the question of procedure\nfor news release when the second New York TV stuefcr is off\nthe press. He said he would be able to come into New York\nand hold press conferences jointly with Merton if the"
}