{
  "id": "d635-117",
  "text": "Mr. Geydon Aum s\n3\nxo/xk/n\nthe H0F1E UKDEli ttKNBXISK series consisting of 7 1-hour program sod\npossibly throe or four additional hours of literate Material by our\nconsultants is to bo reloaded during the first week in December. Mine\nhalf-hour program* art ready of the MATS OF MA&&I1D andthose sill bo\nreleased for broadeasting after the Jefferson series runs out, i.e.\n(After December 7th).\nfhi*. is a tremendous quantity of material to let go at one tine but I an\nconvinced as a remit of tbs reception to the Jefferson series by Press,\npublic and especially by the Fund for Adult Education, that it is imperative\nfor us to retain the momentum. X know that this is #>igg to be a tremendous\nlet on Jim and perhaps make our stations sit up and take notice, but it is\nImportant that we take advantage of the favorable dilate which is feeing\ncreated. Furthermore, the present PAE grant runs out December 31st\nand the Adult Education Oozsaittse is ready to sueodi is resignation.\nAstually, 1 suppose the Committee will submit its resignation to ths new\nPresident since it will be up to him to decide whether to reoonvene the\npresent committee or to change its complexion.\nA mmmvy of flour European consultant* with the heads of Italian, French,\nBritish and Swiss Hadis and ft Is enclosed, the complete memoranda runs\nto 1? pages and the complete report exclusive of addenda will run dose to\n13$ pages. t$® !@C also Is turning out an elaborate report which dll\ncertainly highlight the importance of the new liaison which has been established.\nX have had conversations with high local and state department officials in\nthe last few days and sines this Is a matter which affects the national\ninterest X am not writing anything, about this but will convey it to ’asmbers\nof ths Board face-to-face.\nX am designating Dick as chairman of the nominating committee and McCarty\nhas also agreed to be a member. X would like to have three other members\nof the Committee and wsuid appreciate your suggestions.\nthere is a tad lot of indoctrination that must be gone through not only\nfor the members of the Board but also among our member stations.\nX am announcing this week the appointment of an International Advisory\nCommittee composed of the worth American representatives of ths foreign\nbroadcasting services, this Committee will aid and advise MAEB in connection\nwith any additional facilities or help that the network or individual\nmember stations may require in connection with anything which is available\nabroad.\nfrobot has made arrangements for three Pellbright scholarships to permit\nof having an MAEB representative in London, Paris and Home tor a period\nof one year but this is not likely to become available until next Fall."
}