{
  "id": "d635-124",
  "text": "October 2hs 1952\nfpQi Members of the Board of NAEB\nFROM* Or ay don Ausmus, Vice President\nFirst may I say that, upon advice from several source®, I\nam going to th© University of North Carolina this weekend for a\nlengthy conference \"with Earl Vfyruu This will take the place of the\nmeeting I have tried to arrange with, th® Coraaittoo and Earl, Th©\npurpose of this trip 1® to offer Earl in the name of th© committee\nappointed to select th® Executive Director th© job of Executive\nDirector at a salary of ten thousand dollars® X wish 1x> make it\nclear that th® action of this committee is subject to ratification\nby the Board at the Minneapolis meeting and that we will expect\nfrom Sari an acceptance or rejection of this offer at th© Minneapolis\nmeeting® X sm making him this offer upon the advice of the committee\nand others with whom we have been in close contact. Wilbur Schramm\nhas assured m® of the willingness of th© University cf Illinois\nto string along with us in making him this offer. X bellow© im are\nall in agreement that the tin© element her© is very important® Earl\nwill need a few days in which to make a decision and NMB needs to\nknow by th© Minneapolis meeting whether or not he will accept so that\nwe may begin plans for the takeover or further search as dictated\nby his decision®\nTurning to the preconvention Board meeting in Minneapolis\nth© agenda as outlined is very inclusive and quite excellent® How¬\never on® of the major items of business as proposed by the group\nwhich met in Urbana in September wae_a conference with a number of\npeople who represent organisations and institutions who are forging\nahead with plans for TV development so we may chart the pattern, ahead\nwith greater conservation of energies and this item per so is not\noutlined in th© agenda. On® of th® most constructive steps m can\ntake at Minneapolis will be to shape up a bluo print for our contri¬\nbution to the development of educational TV as m organization as\nwall as attempting to coordinate our activities with other organiza¬\ntions and institutions X should lik®, therefor®, to appoint a work¬\ning committee on a temporary basis - illegal and unofficial, if you\nwish - which would spend considerable tiro between now and th© meeting\nand during th© first period of tho meeting projecting NAEB into th©\nTV picture as far as possible « laying out a positive arid vital pro--\ngram in the TV areao X would hop® that this committee could meet in\nMinneapolis as early as noon on Sunday, November 2, to explore all\npossible avenue8 for TV operation - including perhaps tho takeover\nof the JCET functions and some vigorous rolo in the \"million dollar\"\nFAE TV project. Perhaps m should establish our own film exchange\nservice in th© immediate future so we not only have some plans to\npresent but a project underway to point to. Si informs mo that ^uch\nis now a reality."
}