{
  "id": "d635-128",
  "text": "Ikvoaber 1952\nAirmail-Special Delivery\nMr* Graydon tomm\nStation WUOA\nUniversity of Alabama\nUniversity, Alabama\nDear Graydon»\n1 will try to answer the specific points in your letter of November 12*\nFirst, operational details of headquarters have in the main been left to me*\nIf I felt I needed support or advice, I went to Sy. this was a fairly rare\noccurrence* I imagine I will not mod to bother you very often at this level.\nThings which need policy determination can normally wait until Board or Executive\nCommittee meetings. All of this does not mean that I wonH be calling on you\nfrom Mm to time and asking your advice, but I think it does mean that you\nneed not worry about this ond of things. Tour Job is so involved that I\nimagine you are going to have to assure yourself that good operation 1©\nexisting in certain areas and then depend on it to go by Itself*\nIn the past, funds have boon provided for the president1© secretary, telephone\ncalls, etc. s directly between % and Frank. Sy merely made up a slip of paper\nindicating what the Mil was and where it was to be charged, approved and signed\nit, and sent it to Fmak for direct payment. I believe the contingency fund\nwas handled in the same way. However, I will lot Frank answer mam specifically\non this.\nThe minutes of the Board arc fairly well txiwerd ocs§!>let4nn* 1\nhave them in your hands within a week* As I briefly review them, the only\njjcsaodiato thing which needs to be done is to order a committee to select\nFulhright grantees. Tou do, of coarse, need to select the other csxami turns.\nIn this regard, there is nothing sacred about the committed alignment which\nhas used for the last year or so. In other words, you may have as many com*\nsditees as you like and call than whatever you like, too.\nWe are gradually assembling material for the and 1 believe we will\nfollow a procedure of trying to gat it out the first of the month. 1 m tents**\ntively hitting toward a November 24 deadline for the December issue. 1 may make\nsome changes in the Fews*Lcttey. forma t. but it will cover essentially the mam\nthings It has in the past. I never believe in having columns or pages Just to\nsay we have them. I would be happy to have a \"President^ Page* or a \"Message"
}