{
  "id": "d635-20",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVICE-PRESIDENT\nGRAYDON AUSMUS\nWUOA, University of Alabama\nUniversity, Alabama\nTREASURER\nFRANK SCHOOLEY\nWILL, U. of Illinois\nUrbana, Ill.\nEXECUTIVE DIRECTOR\nJAMES MILES\nGREGORY HALL, U. of Illinois\nUrbana, HI.\nGENERAL COUNSEL\nMARCUS COHN\nCafritz Building\nWashington, D. C.\nREGIONAL DIRECTORS\n☆\nRegion 1\nPARKER WHEATLEY\nWGBH, Lowell Institute\nBroadcasting Council\nBoston, Mass.\nMaine, New York, Connecticut, New\nHampshire, Massachusetts, Vermont,\nRhode Island, Pennsylvania, New\nJersey, Delaware and Maryland.\nRegion II\nALVIN GAINES\nWABE, Board of Education\nAtlanta, Ga.\nVirginia, West Virginia, Alabama,\nKentucky, Tennessee, North and\nSouth Carolina, Georgia, Florida\nand Mississippi.\nRegion III\nWALDO ABBOTT\nWUOM, U. of Michigan\nAnn Arbor, Mich.\nOhio, Michigan, Indiana, Illinois\nand Wisconsin.\nRegion IV\nRICHARD B. HULL\nWOI, Iowa State College\nAmes, Iowa\nIowa, Minnesota, North and South\nDakota, Nebraska and Wyoming.\nRegion V\nJOHN DUNN\nWNAD, U. of Oklahoma\nNorman, Okla.\nMissouri, Kansas, Colorado, New\nMexico, Oklahoma, Arkansas, Texas\nand Louisiana.\nRegion VI\nALLEN MILLER\nKWSC, State College of\nWashington\nPullman, Washington\nMontana, Washington, California,\nIdaho, Oregon, Nevada, Arizona,\nUtah and Territory of Hawaii.\nDIRECTOR OF STUDIES\nDALLAS W. SMYTHE\nIllinois University Communica¬\ntions Research Institute.\nUrbana, Illinois\nSECRETARY AND\nPUBLICATIONS EDITOR\nBURTON PAULU\nKUOM, U. of Minnesota\nMinneapolis, Minnesota\nPRESIDENT\nSEYMOUR N. SIEGEL\nWNYC, Municipal Broadcasting System\n2500 Municipal Building\nNew York 7, N. Y.\nJanuary ^, 195>2\nMr* Seymour Siegel\nPresident\nNAEB\nNew York City, N.Y.\nDear Si:\nGlad to have your letter of January 7 regarding my letter on the\nHeadquarters* operation and I am also glad to know that you concur in\nmy opinion that the Executive Director is a creature of the Board and\nas such should follow directives of the Board. A number of things that\nhave happened this year have made me regret that I did not push for this\nExecutive Director's job the first year. I honestly feel that I could\nhave carried out the intent of the office and the needs of the organi¬\nzation more effectively than Jim is doing. He has the grandiose idea\nthat his is a sort of super executive position set up to run NAEB busi¬\nness, including all the responsibilities formerly assumed by the Board\nand President. }fy reason for writing you concerning this is to urge\nthat at this up-coming meeting you assume full control of the Board\nmeeting and the discussions and direct your questions to the Board for\nsettling rather than giving Jim the ball to run with. A specific point\nwhich will illustrate what I mean was an incident that occurred at the\nGotham meeting in September. I reacted with some surprise when you\nturned to Jim and asked if we could pay Siepmann an honorarium at the\nfall convention from the Kellogg Foundation money. My feeling at the\ntime was that it should have been a question settled by the Board with\na directive to Jim instructing him to pay Siepmann, if the Board decided\nthat it was a legitimate expenditure.\nI shall try between now and the 18th to draw up a blueprint for\npresentation at the Board meeting of my understanding of the relation¬\nship between the Kellogg Foundation, the Executive Director, and the\nBoard of Directors-a rehash of my letter of January 26.\nIf you have any specific suggestions, ideas, or reactions which\nyou would like me to present or would like*%o be giving special thought\nor consideration prior to the meeting, please let roe know by return\nmail. I hope we can get a working blueprint on paper as well as in the\nminds of all members of the Board and all connected with the organiza¬\ntion at this meeting.\nAfter checking schedules, I had better plan to get into New York\non the afternoon of the 17th. January is a bad month for flying and\nit will be pushing my luck too far to depend on the night flight which\ngets into New York at 6:00 on schedule but which is cancelled frequently.\nPlease ask Terry to reserve my room at the Gotham for Thursday night.\nRepresenting non-commercial, educational, radio and television stations, workshops, and production\ncenters, owned and operated by colleges, universities, school systems and public-service agencies."
}