{
  "id": "d635-30",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVICE-PRESIDENT\nGRAYDON AUSMUS\nWUOA, University of Alabama\nUniversity, Alabama\nTREASURER\nFRANK SCHOOLEY\nWILL, U. of Illinois\nUrbana, Ill.\nEXECUTIVE DIRECTOR\nJAMES MILES\nGREGORY HALL, U. of Illinois\nUrbana, Ill.\nGENERAL COUNSEL\nMARCUS COHN\nCafritz Building\nWashington, D. C.\nREGIONAL DIRECTORS\n☆\nRegion 1\nPARKER WHEATLEY\nWGBH, Lowell Institute\nBroadcasting Council\nBoston, Mass.\nMaine, New York, Connecticut, New\nHampshire, Massachusetts, Vermont,\nRhode Island, Pennsylvania, New\nJersey, Delaware and Maryland.\nRegion II\nALVIN GAINES\nWABE, Board of Education\nAtlanta, Ga.\nVirginia, West Virginia, Alabama,\nKentucky, Tennessee, North and\nSouth Carolina, Georgia, Florida\nand Mississippi.\nRegion Ill\nWALDO ABBOTT\nWUOM, U. of Michigan\nAnn Arbor, Mich.\nOhio, Michigan, Indiana, Illinois\nand Wisconsin.\nRegion IV\nRICHARD B. HULL\nWOI, Iowa State College\nAmes, Iowa\nIowa, Minnesota, North and South\nDakota, Nebraska and Wyoming.\nRegion V\nJOHN DUNN\nWNAD, U. of Oklahoma\nNorman, Okla.\nMissouri, Kansas, Colorado, New\nMexico, Oklahoma, Arkansas, Texas\nand Louisiana.\nRegion VI\nALLEN MILLER\nKWSC, State College of\nWashington\nPullman, Washington\nMontana, Washington, California,\nIdaho, Oregon, Nevada, Arizona,\nUtah and Territory of Hawaii.\nDIRECTOR OF STUDIES\nDALLAS W. SMYTHE\nIllinois University Communica¬\ntions Research Institute.\nUrbana, Illinois\nSECRETARY AND\nPUBLICATIONS EDITOR\nBURTON PAULU\nKUOM, U. of Minnesota\nMinneapolis, Minnesota\nPRESIDENT\nSEYMOUR N. SIEGEL\nWNYC, Municipal Broadcasting System\n2500 Municipal Building\nNew York 7, N. Y.\nJanuary 26, 1952\nMr* Seymour Siegel\nPresident, NAEB\nNew York City, New York\nDear Sis\nMay I congratulate you again for having done a magnificent job of\nriding herd on our meeting last weekend and tell you how good it was\nto see you. We shall have to wait, of course, till our February\nmeeting, which I understand is to be on the 15th and 16th, to find out\nwhat effect our actions had upon Jim, on Will, and upon the Kellogg\ndeal as a whole. I don’t know how you feel about the work we accom¬\nplished but I was very pleased with the over-all job and glad to see\nthe new members of the Board kicking in with their rough and ready Tr¬\nactions.\nI am sure you will agree with me that one of our biggest jobs,\nand most pressing, is the vitalizing of our committee on school broad¬\ncasts and an all-out effort to provide specific services to the public\nschool people. I hope you will prod A1 to get his committee at work\nimmediately and will authorize Kellogg funds to implement their\nmeetings and any projects they undertake. I am convinced that this\ngroup can accomplish a great deal more operating within the NAEB\nstructure than as an independent group, but the time has come when\nwe must make concrete our hopes for providing services for this group.\nIn other words, we must push forward to provide them services or\nacknowledge that we cannot and let them get out and organize their\nown group for self-help.\nI think you have done a wonderful job of setting up committees\nfor the year, with the possible exception of making me chairman of\nthe relay network committee, and we should see a sizeable amount of\nprogress during the next eight or ten months. I hope you will get\nout letters to the chairmen of these committees outlining our duties\nand suggesting meetings, etc. Shall I notify the members of my\ncommittee of their appointments or will you and should I begin to\nmake plans to get this committee together, possibly at the Columbus\nmeeting, and should I prepare specific recommendations for the\nconsideration of the Executive Committee concerning this committee\nassignment?\nI know you have your hands full on a number of things and I\nwill not push you for a reply to these questions but I shall be\ninterested in instructions from you. Again, congratulations upon\nhaving done a terrific job of riding herd on a rough range during\nthe past weekend. Let me know about the Executive Committee meeting\ndates as soon as possible.\nRepresenting non-commercial, educational, radio and television stations, workshops, and production\ncenters, owned and operated by colleges, universities, school systems and public-service agencies."
}