{
  "id": "d635-38",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVICE-PRESIDENT\nGRAYDON AUSMUS\nWUOA, University of Alabama\nUniversity, Alabama\nTREASURER\nFRANK SCHOOLEY\nWILL, U. of Illinois\nUrbana, Ill.\nEXECUTIVE DIRECTOR\nJAMES MILES\nGREGORY HALL, U. of Illinois\nUrbana, Ill.\nPRESIDENT\nSEYMOUR N. SIEGEL\nWNYC, Municipal Broadcasting System\n2500 Municipal Building\nNew York 7, N. Y.\nFebruary 19, 195>2\nGENERAL COUNSEL\nMARCUS COHN\nCafritz Building\nWashington, D. C.\nREGIONAL DIRECTORS\n☆\nRegion I\nPARKER WHEATLEY\nWGBH, Lowell Institute\nBroadcasting Council\nBoston, Mass.\nMaine, New York, Connecticut, New\nHampshire, Massachusetts, Vermont,\nRhode Island, Pennsylvania, New\nJersey, Delaware and Maryland.\nRegion II\nALVIN GAINES\nWABE, Board of Education\nAtlanta, Ga.\nVirginia, West Virginia, Alabama,\nKentucky, Tennessee, North and\nSouth Carolina, Georgia, Florida\nand Mississippi.\nMr. Seymour Siegel\nPresident\nNAEB\nWNYC\nNew York City, N.Y.\nDear Si:\nIt was good seeing you in Illinois and you have my admiration still\nfor running a good show. In retrospect, I doubt the value of our visit\nto Wilbur in terms of its clarification of any issues involved. I am\nnot disturbed about it, however, because Wilbur is too busy to concern\nhimself about NAEB business, including the Kellogg grant, and he is further¬\nmore a thoroughly nice guy and we may depend upon his approval and support\nof practically anything we outline.\nRegion III\nWALDO ABBOTT\nWUOM, U. of Michigan\nAnn Arbor, Mich.\nOhio, Michigan, Indiana, Illinois\nand Wisconsin.\nRegion IV\nRICHARD B. HULL\nWOI, Iowa State College\nAmes, Iowa\nIowa, Minnesota, North and South\nDakota, Nebraska and Wyoming,\nRegion V\nJOHN DUNN\nWNAD, U. of Oklahoma\nNorman, Okla.\nMissouri, Kansas, Colorado, New\nMexico, Oklahoma, Arkansas, Texas\nand Louisiana.\nRegion VI\nALLEN MILLER\nKWSC, State College of\nWashington\nPullman, Washington\nI think the plai s we made for NAEB seminars etc. are excellent and\nwill make our annual report, as well as our projects for next year, look\nverY good. I hope that next year we will be able to divert more money for\nresearch than we have been able to do this year because of the emphasis\nthat was placed upon research in the original grant. In this regard, by\nthe way, wouldn't it be a good idea for you to write Dallas immediately\nand request that he begin right away the comparative analysis that Wilbur\nsu-gSes‘t'ed, balancing NAEB operations (station logs, personnel, etc.) of a\nyear ago with a comparable week at this point. My guess would be that Dallas\ncan do this with the aid of one part-time secretary for a couple of months\nat very little cost to us. This seems to me to be a project for Dallas\nrather than one which Jim and Dick can, or should, handle and one which\nis a \"must\". If you agree with me on this, I would suggest that you con¬\ntact Dmltes immediately asking him to get to work on it. It will take\nsome time.\nAfter this last meeting, I begin to feel that our operations are not\nc.u™iHaU Just so®ethiug we are planning to do but I am suddenly aware that we\nIdaho. Oregon, Nevada, Arizona,have accomplished a great deal and now have something to show. Much of\nUtah and Territory of Hawaii, this accomplishment may be attributed directly to your leadership, to\n• your being one jump ahead in the thinking and planning.\nDIRECTOR OF STUDIES\nHit^ulve^colmunica. Turning to more immediate matters, do you want me to plot the agenda\ntions Research institute.for the Columbus meeting or will you? If the former, please compile a\nlist of subjects which you feel must be covered at Columbus and we can\ngo over them at the Oklahoma meeting. If I am to be responsible for\ndrawing up the agenda, I will write each member of the Board about the\nmiddle of March asking for suggestions for the agenda and then compile\nthe agenda from those suggestions, as well as suggestions from you, Jim,\nand from my own thinking. The Columbus meeting will be a rough session\nUrbana, Illinois\nSECRETARY AND\nPUBLICATIONS EDITOR\nBURTON PAULU\nKUOM, U. of Minnesota\nMinneapolis, Minnesota\nRepresenting non-commercial, educational, radio and television stations, workshops, and production\ncenters, owned and operated by colleges, universities, school systems and public-service agencies."
}