{
  "id": "d635-90",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVICE-PRESIDENT\nGRAYDON AUSMUS\nWUOA, University of Alabama\nUniversity, Alabama\nTREASURER\nFRANK SCHOOLEY\nWILL, U. of Illinois\nUrbana, Ill.\nEXECUTIVE DIRECTOR\nJAMES MILES\nGREGORY HALL, U. of Illinois\nUrbana, Ill.\nGENERAL COUNSEL\nMARCUS COHN\nCafritz Building\nWashington, D. C.\nREGIONAL DIRECTORS\n☆\nRegion 1\nPARKER WHEATLEY\nWGBH, Lowell Institute\nBroadcasting Council\nBoston, Mass.\nMaine, New York, Connecticut, New\nHampshire, Massachusetts, Vermont,\nRhode Island, Pennsylvania, New\nJersey, Delaware and Maryland.\nRegion II\nALVIN GAINES\nWABE, Board of Education\nAtlanta, Ga.\nVirginia, West Virginia, Alabama,\nKentucky, Tennessee, North and\nSouth Carolina, Georgia, Florida\nand Mississippi.\nRegion III\nWALDO ABBOTT\nWUOM, U. of Michigan\nAnn Arbor, Mich.\nOhio, Michigan, Indiana, Illinois\nand Wisconsin.\nRegion IV\nRICHARD B. HULL\nWOI, Iowa State College\nAmes, Iowa\nIowa, Minnesota, North and South\nDakota, Nebraska and Wyoming.\nRegion V\nJOHN DUNN\nWNAD, U. of Oklahoma\nNorman, Okla.\nMissouri, Kansas, Colorado, New\nMexico, Oklahoma, Arkansas, Texas\nand Louisiana.\nRegion VI\nALLEN MILLER\nKWSC, State College of\nWashington\nPullman, Washington\nMontana, Washington, California,\nIdaho, Oregon, Nevada, Arizona,\nUtah and Territory of Hawaii.\nDIRECTOR OF STUDIES\nDALLAS W. SMYTHE\nIllinois University Communica¬\ntions Research Institute.\nUrbana, Illinois\nSECRETARY AND\nPUBLICATIONS EDITOR\nBURTON PAULU\nKUOM, U. of Minnesota\nMinneapolis, Minnesota\nPRESIDENT\nSEYMOUR N. SIEGEL\nWNYC, Municipal Broadcasting System\n2500 Municipal Building\nNew York 7, N. Y.\nMay 1, 195>2\nMr. Seymour Siegel\nPresident, NAEB\nNew York City, N.Y.\nDear Sis\nI was out of the office all last week and this is my first\nopportunity this week to bring you up-to-date on the NAEB meeting\nin Columbus. Since you met with Jim at the Pennsylvania fiasco,\nI assume that he will have filled you in on most of the details.\nLittle remains for me to say except that I am indeed sorry that\nyou were not present for all of the meetings and everyone else\nwas very much of the same opinion. Actually, Columbus represented\nthe fruition of many of the things you have fought hardest for\nand it was unfortunate that you were not there to receive credit\nfor the good fight that you have fought.\nIn reviewing, as I have done many times, our meetings with\nFletcher, I am firmly of the opinion that we did the only thing\nwe could have done in regard to the big project. I am further of\nthe opinion that we will have very little voice in any project\nundertaken in regard to television production or anything else and\nour choice is simply, do we get the programs on their terms or do\nwe not get the programs, and again I came up with only one answer\nand that is that we must have the programs. Very frankly, I think\nI have reached the point you reached prior to Columbus and my\none feeling at this point is that it is a battle which we have lost\nand I, for one, am ready to quit. The whole thing is a little\nbit more than a personal sense of failure for I feel that in this\ncase the democratic process itself has failed in the face of power¬\nful dictatorial forces.\nOne of the disturbing things to me was the $80,000 grant and\nFletcher's positive statement that it was not a grant to be ad¬\nministered by NAEB at all but strictly through Jim Miles with no\nreference to an NAEB comittee or board. I was more disturbed at\nthe vindictive manner of our friend who had told Jim privately *\nand me privately that the grant was not to NAEB but to the Executive\nDirector, Jim Miles, and then repeated his question to Fletcher\nwhen we were all together. I am still of the opinion that we should\ncontrol the fund through the committee we appointed to work with\nJim—-Bunn, Abbot, and Waggner. If this committee cannot continue\nto function, then I suggest we write the Foundation and tell them\nwe don’t want the money. To have our Executive Director endanger\nRepresenting non-commercial, educational, radio and television stations, workshops, and production\ncenters, owned and operated by colleges, universities, school systems and public-service agencies."
}