{
  "id": "d1804-1",
  "text": "NAEB SUPPORTS NEW HAMPSHIRE ETV PETITIONS\nThe Univ. of N.H. has petitioned the FCC for Rule Making to reserve Ch. 45\nin Keene, N.H., and Ch. 24 in Littleton, N.H., for educational use. The NAEB is\nfiling comments in support of this petition. The Association has also filed comments\nin Docket No. 14979 opposing the FCC*s proposal No. 1 to reclassify Ch. 20 in Hanover,\nN.H., as a non-reserved channel, and also opposing FCC*s proposal No. 2 which would\ndelete Ch. 39, now assigned to Glens Falls, N.Y. and reassign it to tebanon, N.H.,\nand delete Ch. 24 from Littleton, N.H. These latter comments are also in support of\na petition by the University of New Hampshire.\nNAEB FILES IN AIRBORNE MATTER\nThe NAEB has filed comments with the FCC supporting a request of Midlwest\nProgram for Airborne Television Instruction, Inc., for issuance of Notice of Proposed\nRule Making to investigate matters relating to the use of UHF TV channels for airborne\nETV instruction. However, the NAEB comments carefully point out that the Association\n\"can take no position as yet on the merits of the controversy, nor can it take any\nposition as to any of the questions raised in (Airborne*s) Petition.\" The comments\nfurther pointed out that the NAEB is currently engaged in an electronic digital computer\nstudy to determine use of TV channels for airborne TV, and until this study is completed,\nthe NAEB can take no position in this matter.\nFCC GIVES UHF ANOTHER BOOST\nThe FCC has amended its rules (effective my l) to ease UHF technical requirements:\n(l) transmitters may be operated by remote control, (2) the visual-aural ratio is\nwidened to 10-1 — present rules require aural power to be at least one-half visual\npower, (3) transmitters of 1 lew or less may operate without present requirement for\nspecified reduction of sideband radiation, and (4) unrestricted use of directional\nantennas is permitted by stations with under 1 kw transmitter; over 1 kw transmitter\nmay use directional antennas with a maximum to minimum radiation of up to 15 db (VHP\nstations still limited to 10 db).\nFCC WOULD LIMIT USE OF CH. 37\nTo protect essential radio astronomy observations by the Univ. of Ill., the\nFCC proposed (March 27) to delete the availability of Ch. 37 for TV broadcasting until\nJan. 1, 1968, within a 600-mile radius of Danville, Ill. Also, the FCC would hold in\nabeyance all TV applications for this channel from anywhere within the U.S. pending the\noutcome of this rulemaking proceeding which might necessitate a different temporary\nprotection plan. Comments are due by May 1, 1963* an<^ should not be directed to the\ngeneral matter of frequency allocations for radio astronomy (already under consideration)\nbut to interim protection of such operations at the Univ. of Ill. only. A number of\neducational reservations on Ch. 37, on a nationwide basis, were recommended in the NAEB*s\nSpectrum Study.\nMISCELLANEOUS FCC ACTIONS\nGranted (March 21) a CP to the South Carolina ETV Commission, for a new\nnoncommercial ETV station on Ch. *7; ERP 29.4 kw visual and 14.7 kw aural; antenna\nheight 180 ft.\nGranted (March 18) CP to the Charlotte-Mecklenburg Board of Education, Charlotte,\nN.C., for a new noncommercial ETV station on Ch. *42; ERP 233 kw visual and 130 kw\naural; antenna height 400 ft."
}