{
  "id": "d1313-3",
  "text": "miles along the radial at an antenna height of 30 feet.\nOur pictures this month show the unique and inexpen¬\nsive way in which the measuring dipole is raised to\nthe 30 foot height.\nAn RCA BW-7A VHF Field Intensity Meter and\nTest Set was used. The mast used is the same sec¬\ntional li/4\" seamless tubing used for TV antennas.\nThe measuring dipole is mounted normally on the\ninsulating mast section which is furnished\nwith the meter. This insulating rod is inserted in\nthe mast tubing and clamped so as to place the an¬\ntenna 30 feet above ground. A 4\" channel is bolted\non the back of the truck and the mast pivoted (as\nshown) at the top of this channel.\nFor normal travel, the mast is tied down horizon¬\ntally at the front end of the panel van. When a\nmeasurement is to be made, these ropes are untied\nand the mast is raised by pulling down on the section\nextending beyond the rear of the truck. This end\nfits into the channel bolted to the rear of the truck\nand is fastened in the channel with wire or rope. A\nbolt through the mast enables the antenna to be\noriented for maximum response. A short mobile\nrun (100 ft.) is then made with the antenna at 30\nfeet. An average value of field strength is taken\nover this run as the measured field. The mast is\nthen lowered and secured and they’re off to the next\nmeasurement.\nRob Beldon, WILL chief engineer, says the mast\nand channel iron cost less than $15 including one mast\nwhich was bent before they decided that the bracing\nshown was necessary. The field intensity meter is\nmounted temporarily on a desk in the truck with\npower supplied by the truck battery. Beldon may\nbe seen in front of the truck. If you look closely,\nClarence Berbaum may be seen inside the truck and\nA1 Saldeen could be seen at the right of the picture\nif we hadn’t cropped it to fit the column.\nThe FCC also recently denied a petition which\nasked that UHF stations be permitted to broadcast\nmusic and other purely aural programs while tele¬\ncasting still pictures and slides for a part of the broad¬\ncast day. The FCC rule is that television aural and\nvisual transmissions must comprise integral parts of\nthe announcement or program and have a substantial\nrelationship with each other.\n*****\nThe first production model of the Ampex Video¬\ntape Recorder is scheduled to be completed in Nov¬\nember. Among the new features announced by Am¬\npex are complete interchangeability of tapes among all\nproduction units and a means of editing the recorded\ntapes without loss of synchronization. Production\nmodels are priced at $46,000 and a delivery schedule\nset up earlier this year is expected to be maintained\nin spite of a strike which shut down production for a\nmonth this summer. Over 100 units have been or¬\ndered to date.\n*****\nAn excellent paper on “Television Film Stand¬\nards” was presented at the recent SMPTE Conven¬\ntion in Philadelphia. The authors are K. B. Benson\nand J. F. Whittaker of CBS Television in New York.\nIn the paper, standards for control of the combined\nmotion-picture and TV system are developed by an\nexamination and correlation of the relationships be¬\ntween the two component processes and the effects\nupon the end product. It’s a paper of interest to all\nTV engineers and will no doubt be published soon in\nthe SMPTE Journal.\n4\nENGINEERING NEWSLETTER"
}