{
  "id": "d1899-0",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n1346 Connecticut Avenue, N.W., Washington, D.C., 20036\nVolume TV, Number l8\nDecember 1,19&3\nMEMBERSHIP APPROVES NAEB REORGANIZATION AT CONVENTION\nThe membership of the Association has approved the proposed changes in the NAEB\nConstitution and By-Laws providing for a major reorganization. The new structure\nwas detailed in a packet of materials sent to all Active and Associate members on\nOctober IT, and was summarized in the November issue of the Newsletter. However,\na summary is presented herewith for the information of all members, and especially\nIndividual members who did not receive the October packet.\nUnder the new structure, there will be five classes of members and associates\nwithin the NAEB:\nINSTITUTIONAL MEMBERS - Open to any university, college, school or other educa¬\ntional, cultural or public service agency, organization or association broadcasting\nover an educational radio or television station recognized as under its control by\nthe FCC, or engaged in the production and broadcasting of television instructional\nand/or cultural programs and/or operating closed circuit television equipment for\ndirect instructional purposes.\nINSTITUTIONAL AFFILIATE MEMBERS - Open to any university, college, school or\nn other cultural or public service agency, organization, or association producing or\nseeking to promote educational, cultural and/or public service programs or broadcasting\n(but not operating a radio or television station or closed circuit television broadcast\nequipment).\nINDIVIDUAL MEMBERS - as presently defined.\nHONORARY MEMBERS - as presently defined.\nASSOCIATES - includes present Industrial Associates, International Associates,\nand Sustaining Members.\nAll Institutional Members will determine which of three Divisions of the NAEB\nthey wish to belong to: Radio Station Division, Television Station Division,\nInstructional Division. Institutional members may elect to join more than one Division,\nif qualified, in which case they will pay full Institutional member dues in each\nDivision joined, and will have a vote in the affairs of each.\nAll Individual members will belong to the Individual Member Division. This\nDivision may establish sections for different interest groups (such as producers,\nclassroom teachers, engineers, etc.) and may, if desirable, establish categories of\nmembership based on such qualifications as may be established and may determine which\ncategories are eligible to vote.\nEach Division will have a Board of six members, with the President of the\nAssociation serving as an ex officio member of each Division Board.\nThe NAEB Board of Directors will be composed of the four Division Boards, the\nPresident of the NAEB, a Director-at-Large elected by and from the Institutional\n^ Affiliate Membership, and a Director-at-Large elected by the other members of the Board\nof Directors."
}