{
  "id": "d1899-1",
  "text": "NAEB NEWS LETTER\n-Page 2\nSeptember I, 1944\nlanguages\nor FOREIGN\nhalf-hour\nTO THOSE LISTENERS WHO WISH TO LEARN OR IMPROVE THEIR KNOWLEDG\nLANGUAGES,, MONDAY THROUGH FRIDAY AT 4:00 P 0 M. , WSUI PRESENTS\ninstructive French, Spanish and Portuguese broadcasts,,\n«r\nLtll RROfRAM,/RlrNCH Travelers in America, will be broadcast on Tuesday\nT „ nl«r-niL 0 CL°CK ev ?R0F- Henr' Bartun. The object of this program\nis to discover what French Travelers from LaFayette to recent visitors\nhave thought of the United States. Mor.ze and Grant's \"Selections from\nFrench Travelers in America\" will serve as the text.\nMonoay afternoon at 4 o'clock Miss Marjorie Holbert will teach Elementary\nSpoken French when she will train listeners to speak simple French. The\n!f!!TitFOiR THIS C0URSE BE Cochran's \"Conversational French for Beginn-\nrequestu'gTthem WILL 8E SENT AT C°ST IN SETS °F mve LESS0NS T0 those\n^LE.\"5!!!#RV Spoken Spanish will be taught by Richard W. Tyler on Wednesdays\niL!;PV’HEN HE WILn TRAIN LiSTENIERS TO speak simple Spanish. \"Conversa\ntional Spanish for Beginners\" by LaGrone will be the text, a survey of\nl^EuBESl IN Span|sh literatures through the 18th Century will be given\n8Y Mr. Tyler on Thursday afternoons in a course entitled \"Spanish.\" This\n8E f°ll6wed next year by the modern period. Text to be used is\nRomera-Navarro's \"Antologia oe la literature ESPANOLA.\"\nTraining listeners to speak simple Portuguese Jeronimo Mallo will broao-\nwsm ElEaENTary Sdoken Portuguese on Friday afternoons at 4 o'clock over\nAn)i,ntropuctory Portuguese Grammar\" by Williams and \"Spoken\nPortuguese\" by TENno will serve as the texts.\nCHICAGO SCHOOLS ISSUE SEMIANNUAL REPORT ON RADIO\nFjve^major commercial radio stations, supplemented by the Board of Equca-\nTION S OWNED AND OPERATED FM STATION, WBEZ, CARRIED RADIO PROGRAMS INTO\n5800 CLASSROOMS OF THE CHICAGO PUBLIC SCHOOLS DURING THE MONTHS OF\nI t«TPM?A,>T'iIROrGH dUNE’ 944’ ACC0RD,NG T0 A semi-annual report of radio\ntnmrlro ' £ A®° SCH0°LS, RECENTLY RELEASED BY THE RADIO COUNCIL.\nSTUDENTS IN 403 CHICAGO SCHOOLS HEARO ONE OR MORE BROADCASTS\nDURING ANY AVERAGE WEEK IN THE FIVE-MONTH PERIOD COVERED BY THE SURVEY.\nPrograms Released by WIND, WJJD, WMAQ, W8BM, WLS ano WBEZ figureo in the\niSSfl^L.Sil!!.w'N0RELEAS,NG 69 R£d'° CSunc,l broabgasts to an audience of\nw,2rRGLASSES' W/dD RELEAS,NG 72 «A°to Council broadcasts to 814 classes:\n\"Li, ochooltime (a five-a-week strip) WAS HEARO IN 389 classes; WB3!vi-C8S\nAmerican School of the Air was heard in 266 classes. Five hundred and\nseventy-two classes reported listening to WBEZ (FM) and 2492 classes\nreported that they listened to special broadcasts on both WBEZ and other\nlocal Chicago stations. The program released by WMAQ is a Saturoay\nmorning broadcast and no classroom figures are available on it.\nThe number of frequency modulation receivers in the schools doubled in\ncomparison with a survey for the first half of the school year 1943-1944.\nTotal hours of operation for the FM Station WBEZ increased from 207 hours\nFOR THE FIRST HALF OF THE YEAR TO 386 HOURS. TOTAL TIME ON COMMERCIAL\nSTATIONS INCREASED FROM 31 HOURS AND 30 MINUTES TO 48 HOURS ANO 30 MINUTES.\nREPORTEO NUMBER OF STUDENTS LISTENING TO RAOIO IN CLASSROOMS INCREASED BY"
}