{
  "id": "d1899-3",
  "text": "NAEB NEWS LETTER\nPage 4\nSeptember 5, 1944\nRECEIVING AT LEAST A THREE-DAY BREAK. CBS COMMERCIAL SHOWS RATED 7,360\nPOSTERS TO THE NON-NET COMMERCIAL’S !,Q80, WINDOW DISPLAYS WERE JUST ONE\nMEDIUM USED TO SELL THE STATION AND ITS PROGRAMS**\nTypical of WHCU’s merchandising was the jqs done by the Rym Berry program\nfor Babson BroSo Dairy Equipment. Five different kinds of printeo matter,\nFROM A CATTLE WEIGHING TAPE TO POST CARDS, WERE USED TO BRING THE STORY\nof Babson to dairy prospects.\nWHCU * S POSTSCRIPT TO THE EFFECT THAT BaBSON IS NOW A ” ROUND-THE—YEAR\nSPONSOR WAS HARDLY NECESSARY —BUT IT DID GO TO PROVE THAT MERCHANDISING\nWHAT A STATION HAS DOES PAY OFF—IN OTHER WAYS THAN THRU A BILLBOARD CITATION.\nWBEZ RETURNS TO AIR SEPTEMBER 18TH\nWBEZ, THE FM STATION OWNED AND OPERATED BY THE RADIO COUNCIL OF THE\nChicago Public Schools will return to the air Monday, September 18th\nWITH A SCHEDULE OF BROADCASTS DESIGNED FOR GENERAL AND CLASSR00M LISTEN¬\nING, THE STATION WILL OPERATE FROM 9:30 A 0 M. TO 3H5 P.M. EACH SCHOOL\nDAY, AND WILL CARRY AS PART OF THE DAILY SCHEDULE PROGRAMS FROM FOUR\nNETWORKS, NEWS REPORTS, AND A GROUP OF THIRTEEN PROGRAMS ESPECIALLY\nWRITTEN TO SUPPLEMENT THE COURSES OF STUDY IN THE ELEMENTARY AND HIGH\nschools of Chicago.\nFor THE EIGHTH CONSECUTIVE YEAR, CORE OF SCHOOL BROADCASTS WILL ALSO BE\nRELEASED OVER STATIONS WIND AND WJJD, AT WHICH TIME TRANSCRIPTIONS WILL\nBE MADE OF THEM FOR RELEASE AT DIFFERENT TIMES THROUGHOUT THE DAY ON WBEZ,\nNews commentators from Mutual, two Schooltime programs from station $LS,\nSELECTED PROGRAMS FROM THE BLUE AND NBC WILL SUPPLEMENT THE COUNCIL\nBROADCASTS, BBC WILL BE REPRESENTED WITH A TRANSCRIBED SERIES, ‘’FAMOUS\nNames”, recorded in London for WBEZ. CB8-W8BM, not only will feed WBEZ\nWITH NET WORK' PROGRAMS BUT THE POPULAR “YOUNG PEOPLE 8 S PLATFORM1’, NOW\nHEARD EACH WEEK OVER WBBM, WILL BE REPEATED FOR WBEZ CLASSROOM LISTENERS\nBY TRANSCRIPTION.\nSeveral exchange series of programs have been arranged with other pro¬\nducing groupso ’’Let’s Look at Canada” comes from CBC Toronto; ’’Lady\nMake-believe” from KOAC Corvallis, Oregon and “American Neighbors” is\nEXCHANGED WITH WHAt MADISON, THE CHINESE NEWS SERVICE WILL BE REPRE¬\nSENTED WITH A SERIES ON \"THE New CHINA1’.\nSubject fields covering all grade levels include science, French, American\nHISTORY, SOCIAL STUDIES, GEOGRAPHY, STATE AND CITY HISTORY, C I V I CS, CU RRENT\nEVENTS, LITERATURE, AND MUSIC,\nPublic relations programs will include “News from the High Schools\",\n\"Education tor Victory”, \"Public School Bulletins\", and a variety show,\ntalent for which will come from the elementary GRADES,\nTwice each week special bulletins from the Superintendent’s office will\nbe aired. From 12:00 noon to ISQO p.m, when schools are closeo special\nNEWS AND FEATURE orqGRAMS WILL BE PRESENTED FOR LISTENING TEACHERS,"
}