{
  "id": "d8-122",
  "text": "BOWLING GREEN STATE UNIVERSITY\nRalph G. Harshman\nPresident\nDCPAMTMCNr or STftCH\nBOWLING GREEN, OHIO\nMarch 12, 1962\nProfessor Walter B. hnery\nCollege of Communication Arte - Division of Mass Cowmunicatione\nDepartment of Televieion end Radio\nMichigan State University\nEaat Lansing, Michigan\nMay I express my appreciation for your detailed explanation on my Hennock paper*\nI was most grateful to receive your comments because it is the first time since\nthe paper has been circulated, that I have received a satisfying discussion as\nto its rejection*\nIn my research it was obvious that Miss Hennock was se outspoken as it seems\npossible to bej oftentimes, her comments went beyond the bounds of civility*\nCertainly she seemed to have her causes. And I did not intend to imply in the\npaper that ETV was the result solely of her efforts. The whola story of the\nETV reservations, I*m sure, is one or two volumes yet to be written which will\ndetail the efforts of numerous individuals*\nI concede it is impossible to portray an entirely accurate picture of a person\nsolely from the printed word..*speeches, etc* Any investigation into a personal¬\nity is s difficult task at bast, and all oonceivable information ought to be\nobtained* You have convinced me that Is what I must do* I'll plan now on\ncontacting the individuals you indicate, and others, about Miss Hennock*\n•nfortunately it is impossible for me to attend the Muncle meeting this month,\nmuch as I'd like to. However, perhaps in the course of my research I might be\nable to talk with you at baat Lansing one ot these days, inasmuch aa that la no\nimpossible **#• apefgg aooux *0*50 mile# from the Southern Michigan border.\nI'm serious about this, and will write later When I find it feasible to get away*\nUltimately, I shall try to talk personally with some of the others you mentioned*\nAs you can see, I'm doubly curious now about Miss Hennock* She apparently was a\nhighly neurotic, though talented, woman. I had heard once I believe that \"she\nliked her boose”, but other than her outspokenness, little of her personality\nand apparent pathological nature came through in the research.\nThank you very much. Dr* Emery, for your forthright comments* I shall look\nforward to further research, and my talk with you one day, soon, I hops*\nSincerely,\nA* Franklin Smith"
}