{
  "id": "d8-127",
  "text": "How many times have you heard or have you been guilty of toying\n\"It's Juot ITV. ..,: or It's only for classroom use...\" or 'It doesn't cere,\nhe's jutt « teacher...' or 'Just stand tha® up in front of the curtain tad\n•boot... Tbit approach to TV productions accomplishes savaral thicks than\nwe '...stand them ia front of tha curtain and shoot. First, wo \"kill\"\n'•hat littla intarost tha viewer night have in tna program. We kill\" tha\naathuslaaa of our taiont. Consequently, wo \"kill\" ITV.\nStaging — ahoocaaing — ia aost important In ITV. Thoro art\nwy -Tim r* r^s^, »«.-\nstaging. Wo have boon using ona tutorial in aany ways.\nStyrofoam la a matarial wo would llko to diacuaa. Wo have used\nit’to make mod#la. We hava uaad It for columns. We hava uaad it for\napaca staging. We hava uaad it aa background. It ia vary aaay to\ndecorate with piccurst, maps, charts, curtains, and grapha. Wo havo\nhung matarial on it; wa hava paintad it. Staging mattrlals of versatile\naad lasting quality art constantly in dessand by television. Styrofoam lo\ntha anawar to many of tha staging problems. It ia a unique matarial la\nthat it is a class, rigid plastic foam with something of a sparkling look.\nStyrofoam ia 30 times lighter than watar and yet it has excellast strength\nand it la aaay to work with.\nStyrofoam stay ha fabricated with common power woodworking tools.\nThs power tools should bo operated at a high rata of apood and the food rote\nof tha foam at a low rata of speed. This raaulta In many thin cuts giving\ntha foam a smooth surface by preventing a tearing action which might\naccompany tha us« of a thick cmt.\nTha hot wire technique of fabrication produces a smoother cut.\nThe thermoplastic material malto whan it comas in contact with tha heatad\nwire and this adds to the strength by covering tha layer with s thin\ncovering of the plastic. Whan tha hot wire lo used, the food rate must\nba low enough to prevent distortion of tha wire which would rmoult in\nomavan cuts. (A hot wire attached to a l\" by 4 frame can saslly ba\nproducad by your engineering department)."
}