{
  "id": "d8-167",
  "text": "Publications Committee\nNational Association of Educational Broadcasters\nMembers present: Rudy Brets, Hugh Cordier, Walter Emery, Presley Holmes,\nBetty McKenzie, and Arthur Weld.\nMembers absent: Patrick Hazard, Philip lewis, P. R. MacTaggart,\nHoward Martin, and Frank Schooley.\nTne NAEB Publications Committee convened in Milwaukee, Wisconsin, November\n20, 1963, to consider problems relating to the selection of a new Journal edi f\nthe imoXomentation of a survey to determine the number of colleges and universities\ngranting ’’publication1' credit to faculty for air work; a proposal to use the\nJar uary-February issue of the Journal as a yearbook; a proposal to ixwrease the\nsubscription price of the JeuziSTTram $iw00 to $6.00 a year; \"special-interest,\"\nnewsletters; and a policyTor publications responsibility.\n1) The Committee regretfully accepted the resignation of Dr. Walter B.\nQuery as Editor. Dr. Emery will be on sabbatical leave from Michigan State\nUniversity during the academic year 196U«6£ and it appears that a large portion\nof this leave will be spent outside the country.\nIn discussing possible replacements, the Committee selected and approved\na list of three candidates. President William Q. Harley will contact the\npotential candidates.\n2) The Committee unanimously approved a motion that, in the future, the\nmembership of the Publications Committee should reflect the various interest\ngroups (TV station division, radio station division, etc.) within the re-organized\nAssociation.\n3) Dr® Presley Holmes® proposal for a survey to determine the number of\ncolleges and universities that grant \"publication\" credit to faculty for air\nwork was approved®\nImplementation of the proposal follows: Holmes will prepare the questioimaire,\n(j- e attached) it will be printed rather than dittoed or mimeographed, and Cordier\nwill distribute to the one hundred largest institutions with radio, television,\nclosed-circuit, or instruction film programs. The questionnaire win be\ndistributed through the membership at each institution and returned to Cordier\nfor tabulating.\nOther professional education groups (i.e., NEA, DAVI, SAA, AATJP, and the\nAFBE) interested in this problem win be informed of the study.\nThe Committee also expressed the hope that the NAEB Board of Directors\nwin take official action on the final report, thereby developing a national\npolicy."
}