{
  "id": "d1489-2",
  "text": "services, says that faulty installation of equipment has been\nthe source of most school reception problems.\nPROGRAMS\n^ Literacy training by television on KLRN-TV, San Antonio,\nTexas, is being received by more than 600 pupils in more than\n30 TV viewing centers in the area. “Operation Alphabet” is\nseen during prime evening time five nights per week.\n^ KLRN-TV program director, Bob Squier, has asked most\nof the ETV stations in the country for a sample of their best\nprograming to showcase in the station’s new series, “The\nBest of ETV.” So far more than 30 stations have submitted\nentries.\n^ Fifth-grade students in Tallahassee get an extra incentive\nto learn sociology over WFSU-TV from three puppets—a\nmouse, a cabin boy, and a professor. Rhett Bryson, a Florida\nState University student, emphasizes points made by the TV\nteacher, Mrs. Nancy Benda, by having his puppets repeat\ncentral ideas and converse about the lesson.\n^ “Memorable Concerts,” a new thirteen-week series present¬\ning half-hour glimpses of renowned names in the world’s\nperforming arts, has begun over Chicago’s WTTW (TV).\nThe series is produced in cooperation with John Nuveen and\nCompany, national underwriters and distributors of tax-free\nbonds. The series is one of the first major series for WTTW\nto be underwritten locally.\n^ A Detroit coffee house is the scene of WMSB’s first “On\nLocation” program. The Michigan State University cameras\nmove right into The Retort Coffee House in Detroit and join\nthe audience for an on-the-spot folksinging concert.\n^ Five educational radio stations in Michigan are cooperating\nin presenting “Midweek Michigan,” a series which this season\nhas covered such topics as Housing and Integration, Alcohol¬\nism, Firearms Mailing and Control, School Dropouts, Public\nSchool Enrollments, and Adoption. Segments of the program\noriginate at WDET, Detroit; WFBE, Flint; WKAR, East\nLansing; WMUK, Kalamazoo; and WUOM, Ann Arbor.\n^ The University of Texas radio series, “Texas Business Re¬\nview of the Air,” has received praise from Governor John\nConnally. The series, now in its 11th year, is a joint venture\nof Radio/Television and the Bureau of Business Research.\n^ Fresno State College broadcasting students are writing,\nproducing, directing, and performing in a daily live TV pro¬\ngram for San Joaquin Valley viewers. Called “This Morn¬\ning in Fresno,” the program offers news and weather, along\nwith special interviews. The latter have included a locafl tur¬\nkey breeder speaking about his birds, a discussion with a local\nartist, and comments about the college’s stage production of\nShakespeare. The half-hour broadcast is microwaved from\nthe campus studio to KJEO-TV, a commercial station. Stu¬\ndents have had a chance to experience at least one live produc¬\ntion emergency—when all of the studio lights failed. Accord¬\ning to TV Coordinator Edwin H. Lombard, future plans—\nwhen rehearsal time is available—call for drawing on the col¬\nlege music and drama departments, the modern dance groups,\nand the fiction writing classes, with the possibility of produc¬\ntion of original plays.\n^ WBUR-FM, Boston University, recently ran a 1%-hour\nbroadcast on problems and possibilities of Boston radio and\nof the profession, called “Focus on Radio,” and done by a\npanel of commercial broadcasters, Boston U. faculty, and a\nstudent moderator.\nHere & There\n• For its 32nd annual SDX Distinguished Service Awards\nContest, Sigma Delta Chi has established separate awards for\nradio and television editorials. Until now, they have been in\none category.\nNAEB Headquarters: Suite 1119, 1346 Connecticut Avenue,\nN. W., Washington, D. C., 20036. Phone 667-6000. Area Code 202.\n• In Harrisburg, the Pennsylvania Community Antenna\nTelevision Association recently held a symposium on ETV,\ndrawing a number of educators, legislators, and CATV oper¬\nators.\n• The nation’s oldest and largest educational publication or¬\nganization, the Educational Press Association of America\n(EDPRESS), has moved its national executive headquarters\nto the Syracuse University School of Journalism, Syracuse,\nNew York.\n• Marking the midway point in its 3-year trial operation,\nsubscription TV Channel 18 in Hartford, Connecticut, has\nannounced some coming attractions: the Broadway production\nof Spoon River, the Liston-Clay fight, Joan Baez, a Tony\nMartin-Cyd Charisse Revue, three American movies (“Irma\nLa Douce,” “The Great Escape,” and “West Side Story”) plus\nCannes Film Festival winner “The Lady and the Dog” and the\nVenice and London festivals winner “The Sound of Trum¬\npets.”\n• Excellent dramatic productions on television in 1963 have\nwon the applause of the National Council of Teachers of\nEnglish. NCTE directors at the 53rd annual convention in\nSan Francisco commended the television industry for “bring¬\ning to millions of students plays of substantial content in pro¬\nductions of good taste.” Specific dramas mentioned were The\nTempest, Macbeth, Hedda Gabler, Cyrcmo de Bergerac, and\nPygmalion. The Council publicly recognized recent efforts of\nthe television industry to cooperate with the English teach¬\ning profession in raising standards of production and improv¬\ning aesthetic and intellectual appreciation of television.\nPLACEMENT\nPERSONNEL AVAILABLE\n(For information, write Miss Julie Hunt, Placement Service,\nat the NAEB office in Washington.)\nMarch I Production manager, 37, male. Experience: 4 years\nETV experience, 4 years commercial, 2 years FM radio.\nDesires to be located (a) with TV station or production\nunit affiliated or near college or university ... to work\nand continue education toward MA; (b) East/West\nCoast or peninsular Florida, interested in P-D position\nworking with new teachers. Salary open; will consider\nother locations.\nMarch 2 Experience: 8 years producer, director, writer and\nart director for commercial (public affairs) and educa¬\ntional (open and closed circuit) television; 4 years col¬\nlege level teaching (broadcast preparation curriculum\nand ITV techniques). B.F.A. (industrial design), M.A.\n(communications, R/TV). Interested in responsible de¬\nvelopmental or administrative position in educational\ncommunications, either on university or station staff.\nNot adverse to activities for both. Available late sum¬\nmer, fall, 1964. Location open. Minimum salary: $10,000.\nMarch 3 Ambitious young man with many new ideas and a\npractical knowledge of ETV writing, production and di¬\nrection, desires a growing position that will be a con¬\nstant challenge to his abilities. B'.S. radio-TV, Ithaca\nCollege. Most desirable position would be one that\nwould enable him to continue study for master's degree\nin the summer months.\nMarch 4 Planning, programing and management. Background\nincludes teaching at all levels, university administration,\ntelevision management, consultantships. Commercial and\neducational publication, freelanoe lecturing. Ph.D., male,\n32, married. Northeast preferred. Present salary over\n$13,500.\nMarch 5 Married male, 30, with work beyond M.A., experience\nin various phases of ETV and radio, desires programing\nor produaer position. Primary interest lies in public af¬\nfairs. Salary, location open. Available June I, 1964.\nMarch 6 ETV administrator/producer/director; 12 years ex¬\nperience in commercial and educational TV, 8 years\ncommercial radio. Produced series for NET and NITL;\nwinner national awards. Now teaching in major univer¬\nsity, seeks position in production/administration with\nMARCH 1964\n3"
}