{
  "id": "d1337-12",
  "text": "-13-\nDETROIT EDUCATIONAL TV STATION BECOMES A REALITY\nThe Board of Education has given the green light to educational television in\nDetroit with the appropriation of ?>10U,000 to install studios at Wayne University\nand at the Detroit Public School Radio Station WDTR.\nWayne will spend $75,000 converting its Old Main auditorium, until recently occu¬\npied by the library, while WDTR will use $29,000 to alter its radio studios for\nTV presentation. A third studio will be built by the University of Detroit.\nAll three studios will be used by the 18 cultural and educational groups who are\nmembers of the Detroit Educational Television Foundation, sponsors of the non¬\nprofit, non-commercial UHF station. The Foundation has raised nearly $1*00,000\nfrom private sources which will be used to build a 500-foot tower and purchase\na transmitter, television cameras, kinescope and allied equipment.\nMEMPHIS ETV RECEIVES GIFTS FROM INTERNATIONAL HARVESTER AND WHBQ-TV\nInternational Harvester Foundation has given ^1000 to the Memphis Community Tele¬\nvision Foundation on behalf of International Harvester*s five Memphis operations.\nIn an accompanying letter, R. G. Mahal, works manager at IH, said in part, \"We\nfirmly believe that an educational television station will be of inestimable value\nto the community. We believe it will benefit our company indirectly by raising\nthe educational and cultural standards of the community. We believe it will bene¬\nfit our company directly by offering self-improvement opportunities to our em¬\nployees and their families and by enriching their home lives. We are making this\ncontribution because we feel we should have a part in bringing community educa¬\ntional television to Memphis.\"\nA donation of $30,000 worth of television equipment was made to the Memphis ETV\nfoundation by WHBQ-TV, bringing to well over .100,000 the grants made to the\ncommunity TV station by the two commercial outlets in Memphis. The gift was an¬\nnounced by John Cleghorn, general manager of WHBQ and WHBQ-TV and a director of\nGeneral Teleradio, Inc., which controls the two stations.\nChannel 10, licensed to the Memphis Community Television Foundation, will be the\nMid-South*s first cultural and educational TV station. It is planned to operate\nthe station through public subscriptions. Channel 10 has already received equip¬\nment valued at $78,500 from WMCT, The Commercial Appeal television station. With\nthe gift from WHBQ-TV, it now holds equipment valued a! $108,5oO.\nFRACTURED VIDEO\nFILM CLIP: Practice of bilking television stations with inferior movies.\nFLIP BOARD: Informal society of sales personnel; name derives from expression:\n\"Let*s flip for the coffee.\"\nI.D.: Abbreviation for intestinal disorder; i.e., ulcer,\nI.D, CARD: Employee who jokes about ulcers.\nLAP DISSOLVE: Instruction to seated actor; as \"Get up.\"\nMIKE SHADOW: Affectionate name for TV detective.\nTELEPROMPTER: Viewer who notifies the advertiser when somebody goofs.\nTIGHT CLOSEUP: Refers to performer who appears crocked at close range,\nPANNING: Objective appraisal of TV program by radio personnel."
}