{
  "id": "d1337-2",
  "text": "WHAT VJNYG IS DOING\nWAR EFFORT PROGRAMS\n54% »f WNYC11 a entire broadcast schedule is devoted to war effort and civilian\ndefense programs* Other\" stations cooperate in the war effort, but no station\ncan match this record.\nTho following official government war services programs wore instituted by and\narc hoard exclusively ovor ?/WYC's\nFor ovor 170,000 Air Wardens, WNYC carries regular programs\nTo more than 40,000 Firo Department Emergency Auxiliary Corps (FDEAC)\nmembers, WmC Vroadoasts nightly instructions\nThe HELP WANTED COLUMN OF THE AIR of the United States Employment\nService is broadcast twice daily by WNYC\nTb Selective Service Board Manbors and civilians, WNYC broadcasts\nrogular programs from Selective Service Headquarters*\nPrograms from the Civilian Dofcnse Volunteer Office at Pershing Square\nis another sourco of rogular WNYC broadcasts.\nSpecial War Emergency Services:\nSolootivc Sorvico Registration: During Selective Service registration\nperiods, WNYC broadcast directly from Selective Service Headquarters,\ngiving up-to-tho-minutc instructions and late information to Local\nBoards and registrants.\nRationing Registration: During the registration of Now York!s seven\nand one-half million citizens for War Ration Books, WNYC was tho\nmodium usod by tho Board of Education to roach the 35,000 teachor\nregistrars with last minuto instructions, and to give Important dir¬\nections to the millions of registrants.\nWoro WNYC to perform no other function during tho entire year, the\ncost of this sorvico to the City for facilitating the registration ,\nof tho seven and ono-half-million people during the three day period\namounts to only $0,013 (LESS THAN A CENT AND A HALF PER PERSON),\nRation News and Necessary Consumer and Marketing Information for New York Hous\nwives comprise 12% o£ all V/NYC broadcast time:\nTwice daily ration news roundups (3:55 and 8;55 p.m.) i\n23 other separate and distinct rationing and consumer programs weekly:\nTHE CITY CONSUMER GUIDE - Department of Markets\nRATIONS AND RECIPES - Mrs, F* F. Gannon, Dopartmont of Markets\nOFFICIAL 0. P. A. CONSUMER NEWS\n0, P. A. CONSUMER DRAMA"
}