{
  "id": "d1337-5",
  "text": "-6-\nTV TECHNICAL TIPS NO. 1\nby\nCecil S. Bidlack, NAEB TV Engineer\nWhy do images ”stick\" on image orthicon tubes? Can proper operation of the orth\nminimize this sticking? ’ These two questions are answered in a paper presented\nat the Eighth NARTB Broadcast Engineering Conference in Chicago May 27, 195U by\nR. G. Neuhauser, camera tube engineer for the RCA Tube Division, Lancaster, Pa.\nWhen you pay 01200.00 for a 5>820 image orthicon there are two things you as a TV\nengineer are interested in getting from It. The first is a high quality picture\nand the second is a long life which is easily translated into low operating\ncost. Neuhauser states that operating conditions which giVe the best picture\nare the same as those that give the tube longest life in normal operation. RCA\nhas printed this talk in Publication No. ST-§93 and it should be MUST reading\nfor every video control engineer. The title of the paper is ’’Optimum Perform¬\nance of Image Orthicons and Vidicons in Broadcast Service.” If you would like\nto have a copy of this paper, drop a note to the NAEB Television Engineer and\nhe will secure a copy for you.\n■x- * -Jf -if -if # * *-# -if\nLinn Towsley, Chief Engineer for WKAR-TV, is installing a new studio switching\nsystem and a master B plus power supply system manufactured by General Communi¬\ncations of Fort Atkinson, Wisconsin. Other stations may be interested in con¬\nsidering a master .power supply for regulated B Plus .voltage, rather than using\nindividual power supplies as is done in much current practice. The master sup¬\nplies are available in 2, 10, and $0 ampere capacities at 360 volts with which\nindividual voltage regulators are used. Advantages claimed are the elimination\nof large numbers of individual heat producing supplies, conservation of rack\nspace, low maintenance and operating cost, and low initial cost.\n-)f -X- -Jf •if -x- * if if if if if\nBy the time this Newsletter reaches you this item will not be timely. . However,\nit illustrates a point. RCA is advertising a ’’Sale” of certain items of tele¬\nvision equipment and if you happened to be in the market for the items mentioned\nsubstantial savings could be had. For instance, a TG-10A Sync Generator.(field\ntype) with a regular price of '\">3750.00 was offered at $2000,00j a TS-30B/Field\nSwitcher at $1339.00 marked down from \"2200.00. If we had a well .polished crys¬\ntal ball and knqw what you needed;we could pass such information on to you and\nyou might take advantage of such offerings. Perhaps you have surplus equipment,\nsounds crazy doesn*t it, that some other educational station could use. If so\nyou would be able to realize something from it and the station needing it would\nbe willing to pay a fair price and both would benefit.\nRecently we had a request from Graydon Ausmus of the University of Alabama, Sta¬\ntion WUOA, for a side mount 6 or .8 bay FM antenna (Collins or Andrews), Possi¬\nbly you have one he could use. A local phone call to John Brugger of WILL dis¬\nclosed that they have a Federal 8 Bay antenna fdr 93.3 me that they were willing\nto dispose of at a very reasonable price. Obviously we couldrMt call all NAEB"
}