{
  "id": "d1337-9",
  "text": "-10- t M _..\nresolution increased at least 100 lines. No wonder their film programs looked\nsoft.\nHow*s your linearity? Are your circles round? I know it is difficult to pre¬\nserve proper.aspect ratio on video monitors, but blanking widths are specified by;\nthe FCC• 'If your horizontal blanking is a little narrow, and your vertical blank¬\ning a little wide, then you will have poor linearity on your transmitted picture\nand.your aspect ratio will be incorrect regardless of live camera alignment on :\ntest pattern.\nThere*s another place where we can pay attention to details. Proper camera expan¬\nsion with slight \"corners\" showing on the air are the mark of a good video engi¬\nneer. They are masked out on most sets—but how else can you determine if deflec¬\ntion has drifted if you do not show \"corners.\" And in showing them you are using\nmaximum target area which will give you maximum resolution. Time should be al¬\nlotted just prior to air time for a final check of live cameras on test pattern.\nHow much you should allow depends upon the skill of your cameramen and video engi¬\nneer. At least 1$ minutes should be allowed for two live cameras with experienced\nmen. If they can do it faster, well and good; however, it*s a good thing to have\na short break before going on the air.\nWhen you put the cameras on test pattern, use the standard 18 x 2k inch pattern\nand not one cut from a magazine. And use at least a 90 mm. lens on camera for\nthe job, with the pattern mounted on a good stand and its center at lens height.\nA line normal to the center of the test pattern should run through the optical\ncenter of the lens. If you need a standard size test pattern, a note to the NAF.B\nTelevision Engineer will bring you one by return mail.\nGood'lighting is important too. The eye has an automatic iris which adjusts with\nvariations in light level. For this reason itfs quite difficult to light a set\nproperly by eye. Incident light meters are not expensive. With reasonable care\nthey*11 last indefinitely. How else can you knowhow much light there is on a set\nand how do you determine the proper ratio of back light to front light without a\nmeter? Lighting isn»t a very glamorous job, in fact it*s usually hard, dirty work\nbut good lighting makes a world of difference in picture quality.\nThese are just a few details that cannot be neglected if you are to produce a good\ntelevision signal. Perhaps you think they*re not important. But if you*re a\ncritical viewer (and who isn*t if you*re in the business) you*11 agree that it is\nattention to the multitude of small details of programming, production and engi¬\nneering that adds up to make a good television production.\nWUOA BEGINS SIXTH YEAR\nWUOA-FM \"The Voice of the University of Alabama,\" will begin its sixth year of ed¬\nucational broadcasting in December with increased power of approximately 16,000\nwatts. The increase from U,800 watts will triple the station’s present coverage\narea and provide for the first time coverage of the metropolitan areas of Birming¬\nham and Montgomery, Alabama.\nUniversity approval of the power expansion was one result of a recent listener-\nresponse campaign conducted by WUOA staffers. Graydon Ausmus, WUOA manager and\ndirector of the University Radio and Television Broadcasting Services, reported\nthat a six-bay FM antenna has been purchased and will be side mounted on a new 200\nfoot tower now under construction. The present WUOA radio tower is 100 feet."
}