{
  "id": "d1920-3",
  "text": "says that over the past forty years radio\nand TV have usurped many cultural ex¬\nperiences. Both media make surveys to de¬\ntermine what people are listening to, not\nwhat they want, he says, and the result is\n“more and more entertainment, and less\nand less education,”\nETY Helps\nBusiness Education\n—by Bernarr Cooper\n[Ed. Note: The following was taken from\nan address which Dr. Cooper delivered last\nfall before the International Conference on\nBusiness Education. Single copies of the en¬\ntire speech may be obtained from him at:\nBureau of Mass Communications, Univer¬\nsity of the State of New York, Albany,\nNew York 12224.]\nShort courses on particular training needs\nusing videotape or closed-circuit presenta¬\ntions have been conducted in a variety of\nbusinesses:\nBear Mountain in New York State has\na fully equipped television studio which\nfunctions in these capacities on a regular\nbasis.\nThe armed services have used television\nfor training for many years. The most high¬\nly developed closed-circuit television in¬\nstallation of a military nature is at Fort\nMonmouth, New Jersey. Fort Monmouth\nproduces 9,000 “graduates” per year. The\nsubject fields range from the business re¬\nlated area of computer technology, to elec¬\ntronics and foreign languages.\nThe Articulated Instructional Media pro¬\ngram at the University of Wisconsin\n(AIM) offers a state-wide system of busi¬\nness-education instruction, much of which\nis college credit. Adult industry trainees\nuse a variety of media for business train¬\ning including radio, television, telephone,\nprogramed instruction, and correspondence\ncourses.\nBank employees have been trained in\nPittsburgh and New York City using tele¬\nvision.\nCourses in small business management\nhave been broadcast in several communities\nsuch as Phoenix, Arizona, and Los Ange¬\nles.\nNeighborhood solicitors for United Fund\nhave been trained by television in San Fran¬\ncisco.\nAn institute for business development was\nconducted using the closed-circuit television\nfacility of Hagerstown, Maryland.\nIn Boston a professional marketing sem¬\ninar has been conducted using television in\npart.\nIn Washington a course in shorthand was\nbroadcast by the local educational television\nstation to help upgrade the quality of gov¬\nernment stenographers.\nIn several municipalities teachers have re¬\nceived in-service training in business sub¬\njects by means of local broadcast televi¬\nsion.\nTelevision has made possible the bringing\ntogether of consultants and other resource\npersons in conjunction with business con¬\nferences, conventions, public gatherings. The\nBell System Communications Seminars con¬\nducted in Chicago on a regular basis make\nuse of television and other media in train¬\ning top level and lower echelon adminis¬\ntrators.\nWithin the schools television has been\nused in a variety of business subjects. In\nteaching touch typing, for instance, it has\nbeen established that the learning time for\nthe comprehensives of touch timing funda¬\nmentals may be reduced as much as 60-80%\nover conventional teaching when television\nis used, as in New York State by open-cir¬\ncuit and by closed-circuit at the University\nof Miami and San Fernando State College.\nAccounting, business management, banking,\nand financing and a host of other business-\noriented academic programs are offered by\nmost of the large universities that employ ^\ntelevision on a closed-circuit basis on their\ncampuses. Many universities such as Michi¬\ngan State, Ohio State, the University of Il¬\nlinois, and the University of Miami broad¬\ncast such courses under the auspices of\ntheir respective extension divisions.\nThe use of video tape in conjunction with\ntelevision has opened up wide diversifica¬\ntion of use for student observations of\nhazardous or complicated procedures which\ncan be replayed again and again, or where\ndirect observation is impossible or danger¬\nous, or where practicum on the part of the\nstudent may be televised, recorded, and im¬\nmediately replayed for evaluation. The\nteaching of shorthand is one notable sub¬\nject area using this technique.\nPLACEMENT\nPOSITIONS AVAILABLE\n(For information, write Miss Yasmine Mina, Placement Service, at\nthe NAEB in Washington. In order to be considered through these\nchannels, the reader must be an Individual Member of the NAEB,\nwith credentials on file with the NAEB Placement Service. Non-mem¬\nbers can save time by sending the $10 annual dues and $10 Place¬\nment registration fee at the time of inquiry.)\nApril I Instructor in Radio-TV-Film. Master's degree in Radio-TV-'Pilm preferred.\nBroadcast experience desirable, also announcing, TV production, FM station\noperation and copywriting. Duties will require some teaching in those areas\nand supervision of FM student station operation. Salary $6,750 min. for 9\nmonths.\nApril 2 Director of Instructional Resources with faculty rank of Associate Professor to\nsupervise and coordinate CCTV operation, audio-visual area, language labs\nand other learning spaces, programed learning, etc. Administrative position.\nAdvanced degree and teaching experience important. II months for $12,500\nplus.\nApril 3 Technical assistant to Director of Instructional Resources. Training in audio¬\nvisual and/or TV important, but experience not necessary. Job will provide\nopportunity for growth. B.A. degree acceptable. Salary $5,200 with liberal\nbenefits.\nApril 4 Leading lighting firm has opening in its Sales Engineering staff that will en¬\nable the candidate to deal with both educational and commercial TV per¬\nsonnel and will offer the opportunity to design lighting and lighting control\nsystems for a variety of TV applications. Good technical background essen¬\ntial although a degree in Engineering is not required. Salary open.\nApril 5 Northeastern College has position for an Electronics Specialist qualified to\noperate and maintain both TV and AV equipment and systems. This person\nwill serve as assistant to the CCTV Chief Engineer, and will have special re¬\nsponsibility for supervision and maintenance of campus audio-visual equip¬\nment. Applicant must have general academic knowledge for association with\nfaculty, first-class license, experience and personal maturity. Salary $8,000\nwith excellent benefits.\nApril 6 Private liberal arts university in Northeast seeks someone to plan and operate\na campus-wide closed-circuit system and to provide maintenance of audio¬\nvisual equipment. Must be capable of planning budgets, selecting equipment,\nand administrating department. Starting Summer 1966. Salary open.\nApril 7 Communications Arts department of large western university responsible for\ntheatre, TV, film, speech, debate and radio needs man for Sept. 1966 to\nteach multiple sections of basic public address and direct two stage produc¬\ntion in a fall production season. Opportunity for someone with diversified\nmedia interests and talents. ‘Required M.A. degree and teaching experience.\nRank and salary depends on experience.\nApril 8 Electronic Technician with full technical and limited management responsibil¬\nity for all operations and maintenance involved with a closed-circuit TV play¬\nback facility utilized in the distribution of ETV programs. Applicants must\nhave 3 years general experience in the field and 2 years specialized expe¬\nrience in the maintenance and operation of television equipment.\nApril 9 Television Production Specialist responsible for operational control and super¬\nvision of the CCTV facilities and equipment. Applicants must have 6 years\nexperience in the fields of radio, movie, TV or AV communication, or a com¬\nbination of these fields, at least one year of this must have been in TV pro¬\nduction.\n4"
}