{
  "id": "d1269-17",
  "text": "-13-\nADULT EDUCATION PLANS ANNOUNCED BY NBC\nIn a special story to the N-A-E-B Newsletter, Sterling Fisher, manager NBC Public\nAffairs Department, described plans for an adult educational project with the\nfirst experimental series to be conducted this summer at the University of Louis¬\nville in cooperation with Station WAVE, under his direction.\nHBC's motives, Fisher said, rest on the desire of thousands of citizens to increase\ntheir education with respect to the world at large in order that they may act as\nmore intelligent citizens of a democracy. Despite progress in adult education in\nrecent years nearly half of our 85 million adults have not completed high school,\nand about 2% have not complete 8th grade. Consequently millions of adults have\nno facilities for continuing their education. NEC hopes to meet this need.\nNBC believes, Fisher said, ’’without diminishing*..the general appeal of the programs\n...the network can immeasurably increase the value of the programming it does in\nthe field of education and public affairs by providing ways for listeners to make\nuse of the broadcasts. Home study courses have been set; listeners may register;\ncertificates will be provided. Results of Louisville case study will be made\navailable to NBC affiliates and colleges and universities in the fall*\nONE HOUR CF TELEVISION—MICHIGAN STATE REPORT\nMichigan State College took its first dip into television recently in an hour-\nlong broadcast over WWJ-TV, Detroit. W. Loxvell Treaster, director of public\nrelations for the college, worked out arrangements with the station for staging\nthe program. Theme of the program was the story of Michigan State College\nservices to the people of the State. Special emphasis was given to interpret¬\ning agricultural information for the urban televiewers.\nJudging from the following remarks from Lowell we gather that both the college\nand the station really went to the whole hog in this show:\n”It took 10 engineers, two directors, and nne producer to stage it,\nusing two studios located two blocks apart. We used movie film,\nslides, still pictures, demonstrations, student dramatists.\n’’The first 15 minutes involved film taken by one of our students on\nthe campus, with a message from President Hannah. The second 15\nminutes was a dramatized version of the founding of M.S.C., the\nNation’s oldest agricultural college. We used radio students for that\nsegment. The last half hour told the story of present services,\nparticularly in the Extension Service and the Agricultural Experiment\nstation. Director R. J. Baldwin and a number of our specialists\nparticipated with demonstrations. Earl Richardson (Extension Editor)\nworked up the agricultural section.”\nWas it a success? We'll let Lowell do the talking:\n”It occurred to us some time ago that we should be feeling our way\nalong in this new medium so that we would be familiar with it when\nit becomes a really potent tool...We feel that the program was\nreasonably successful, particularly in view of our lack of experience\nin television. It certainly served to teach us a lot about the many\nproblems, limitations, and advantages of this medium. We will be in\nmuch better position to use television when it becomes a really use¬\nful tool. In the meantime we plan to study methods and practices and\navail ourselves of any opportunities for reaching the public with\nmaterials that adapt themselves to television.”"
}