{
  "id": "d1269-19",
  "text": "•17-\nTurning to functions of the Center, it is designed primarily—I would\nsay almost solely—as a program aid in the areas of radio and television.\nYou will hear a good deal more, I presume, about the aid for television in\nthe first year or two of operation, but we are not unmindful of our responsi¬\nbility to radio as well. In fact, I think if you would take grants made to\ndate you would find more support devoted to radio than to television.\nWith that general definition of function, it follows that the hope of\nalmost everyone who has had some connection with the Center is that, through\nits efforts and resources, the program services of educational television\nwill be enhanced and of higher quality than might be possible otherwise. I\nam certain I do not have to tell you that this has been one of the great prob¬\nlems of educational radio. Speaking as an ex-school administrator, I must ad¬\nmit that the type of financial support which has been available to educational\nradio, with but a very few exceptions, has been most inadequate indeed.\nIf such a pattern holds over to educational television, where the costs\nwill be much greater but the educational potential much higher, it is inevi¬\ntable that the results will be far worse, at least in terms of educational\ngoals which we might have achieved. In fact, it seems to me, that unless all\nof us can put our heads together and provide the resources necessary—both\nideas and funds to bring the ideas to fruition—the possibilities of educa¬\ntional television are quite limited.\nThus, I have sketched the philosophy underlying the Center*s approach\nto its problems. By concentrating our efforts in the area of program services,\nwe feel we will be making the greatest contribution to educational television\nand radio in this country. Such a concentration will mean that, of necessity,\nwe shall be unable to assume primary responsibility for other important prob¬\nlems such as engineering services, grants for equipment, the many problems of\npersonnel for stations, and related fields. To be sure, we shall be inter¬\nested in these areas because of the influence they will have upon the type\nand quality of program materials which we will be getting, but they are not\nour primary areas of operation.\nWithin this framework, you will ask, how does the Center plan to go\nabout its job? I wish I could be more specific on this point, but I cannot,\nprimarily because our operation is so new. However, I can indicate to you\nsome of our tentative thinking as we move ahead in our planning and opera¬\ntions.\nIn the first place, we do not conceive of ourselves as a primary produc¬\ning agency. We believe that our job is to get the production done, but not\nby directly entering the producing business with our own staff. In short, we\nintend to seek such production help from the educational stations themselves;\nfrom universities and colleges with television, radio, and film units; and\nfrom independent producers.\nSecondly, and consistent with the above point of view, we feel that we\nshould operate with a very small, full-time central staff and depend to a great\nextent upon highly-skilled and specialized, part-time or temporary help. Now\nthat conception is based upon several assumptions, but one of them I think\nis very important to you people."
}