{
  "id": "d1269-28",
  "text": "-26-\nleave its business to chance. It has ’’news scouts.” They swarm over the place\nlike flies. Every week they pay a routine call and pump you for what they call\n\"items.\" If they hear you are up to something, they have you on the phone be¬\nfore you can turn around. Campus news is their business. Now, by analogy,\nlecture talent is a station’s business. I often visit other men's classes. More\nthan once I have stumbled onto a lecture which was a \"natural” for an academic\nmike. With a new head and tail it could have been lifted right out of the course\nand stood on its own. Whose business is it to know about such things? You can’t\nexpect the lecturer to realize that he has come forth (perhaps by accident) with\na talk suited to the needs of the station. Even less can you expect him to come\naround and ask to be \"taped” while he still has it where he can handle it. More\nthan once I have had a strong hunch that Professor So-and-so, regardless of the\nlecture he might be putting out, has potential mike-talent. Whose business is\nit to keep after these things? Why isn’t a campus kept under constant sensitive\nsurveillance? No football coach, no campus editor, is as happy-go-lucky as some\nstation directors I have known. How many program directors go out and shunt\nfor their talent? How many have student assistants out in the field \"spotting”\nfor them?\n(6) For what it is worth, I would urge upon universities and their stations\nthe great utility of tapes. This used to be a sore point with me. I was against\ntapes. I thought they resulted in \"canned” goods. But I was wrong about this.\nWith a little coaching a person can be trained to warm up even to a tape. They\nare flexible as to time and .place. They are storable. They are revisable. They\nare like cameras—doing their take and salting it away. I see less and less need\nfor \"live\" broadcasting in academic affairs.\n(7) Having said this, I would add that one of the great values of a tape is\nthat it lets a person listen to a play-back as soon as he is through. This is\na point which cannot be over-emphasized. Always urge a man to sit through a\nplay-back as soon as he has come away from the mike. Never make him feel that\nthis is either a bother or a mere routine. If it is a \"bother\", you have a wrong\nperspective. If it is a\"mere routine,\" he has a wrong perspective. There is\nnothing that will teach a man the things he needs to know as quickly and surely\nas a play-back. If he has done well, but thinks otherwise, it will help to res¬\ntore his nerve. If he has done poorly, but thinks otherwise, it will confront\nhim with the facts. If you know how to help him, the play-back provides you with\ndocumentary evidence for your points. A play-back, in the hands of a sympathetic\nand skillful program director has many of the virtues of a \"confessional\". Many\na time I have come away from such ordeals with a heightened sense of sin but\nwith a determination to do better next time.\n(8) My last point to administrators and directors has to do with a matter\nupon which I have had little first-hand experience but upon which T have *\ndone thinking. I mean academic television. Hight new I think this is an over¬\nrated potentiality. I am convinced that when a university adds a radio station\nit adds far more to its resources than it will when it adds television to its\nradio. A university without radio is drastically cut off. A university with\nradio but without television is not drastically cut off. A university can do a\ngreat deal for its customers, given broadcasting facilities. But the nature of\nits clientele and the nature of its materials are such that not as much propor¬\ntionately is added when you pass from broadcasting to television. A university\nstation lives by its appeal to the minds of its listeners. To do this at least\none sense medium is essential. When you add a second sense (in this case vision)\nyou encounter diminishing returns. When I learned what it cost one university\nto add television I could not help wondering whether the returns were worth\nthe added investment; and I could not help thinking how some or all of that money"
}