{
  "id": "d1269-8",
  "text": "-9-\nFCC APPROVES COMMERCIAL FACSIMILE FOR JULY 15\nThe Federal Communications Commission announced approval of facsimile for commercial\nFM stations beginning July 15. Commissioners Durr, Hyde, and Sterling are primarily\nresponsible for the decision with Coy, Walker, and Webster not participating, and\nJones dissenting in part. (Jones would have banned multiplex during the day)#\n| The decision to permit multiplex programming (which means facsimile broad-\nj casting may be carried on while regular aural. FM programming is in progress\non the same frequency) was taken, the FCC explained, in the hope that ulti¬\nmately a suitable multiplex system will be developed which will not cause any\ndegradation of the full FM tonal range*\ni;\nEither simplex or multiplex operation was approved with simplex limited to one hour\nduring the day and multiplex to three hours with no limit after midnight. Use of\nthe 8.2 inch paper, as advocated by the John Hogan interests and by Finch Tele¬\ncommunications. Inc, was approved.\nDaytime hours, for purposes of this decision, are held to extend from 7:00 a.m,\nuntil midnight, during which time one hour of simplex transmission is permissible\n(this means no aural FM sending during that period) and three hours of multiplex.\nBetween midnight and 7:00 a.m. there is no limit on either simplex or multiplex\nservice.\nNAB’S JUSTIN MILLER BLASTS PUERTO RICO GOVERNMENT STATION PLAN\nPlans of the Puerto Rican government to operate WIFR- its 10 kw outlet now under\nconstruction—on a commercial basis were viewed with extreme disfavor by Justin\nMills#, president of the National Association of Broadcasters. Meanwhile commer¬\ncial broadcasters on the island have begun a legal study to find possible ways\nand means to proceed against the project. Initially, the island radiomen voiced\nno objection, it was reported, because of their alleged understanding the project\nwas cultural and educational in nature.\nJudge Miller said, \"Operation of a commercial broadcasting station by an arm of\nthe government is as dangerous a precedent as publication by such an agency of\na commercial newspaper. It is one more step threatening, not only the American\nsystem of radio, but our traditional system of free enterprise,\"\nUNION STATION SEEKS WFPR CALL LETTER\nThe International Ladies Garment Worker’s Union which holds a construction per¬\nmit for a New York City FM station assigned the call letters WMKA, have asked\nthe FCC permission to use the letters WFDR.\nThe past several years have seen a number of requests for the FDR call letters\nbut they have been turned down. This new application, however, carries with it\na letter from Mrs. Eleanor Roosevelt expressing her approval and saying her\nchildren have no objection to assignment of the letters to the Union station."
}