{
  "id": "d1269-9",
  "text": "-7-\n2) ELECTION OF REGIONAL DIRECTORS. I don»t mind telling you that I am\nthoroughly confused on this matter. I*ve listened to the arguments on this\nquestion for the better part of six years and there are certainly good things\nto say on both sides of the issue. If I was personally forced to vote I would\nsay let*s elect the Regional Directors as a group, by the total membership.\nI like to feel that while one director may be from the West Coast, he still\nis a member of my Board of Directors. Some day a region might elect a director\nwho would never have gotten anywhere on a national slate. Of course, you could\nturn this thing around and say that the ignorance of the people outside the\nregion about members in that region would tend to do this same trick. I still\nfeel that I*d like to vote for each one of the Directors of the NAEB, but I\nknow this is at variance with your recommendation and generally, at variance\nwith the wishes of the total membership, so 1*11 be content to vote for the\nDirector of Region III when my turn comes.\n3) REPRESENTATION OF GROUPS ON THE BOARD: I was very happy to know that\nyou came to the consensus that the Board should not have a School Station Rep¬\nresentative per se. Board members must represent broadly; they must not speak\nfor any special group within the Association; they must attempt to do the\nbest for all members. This does not say that the school station manager might\nnot be a better man than the operator of a college station but I would rather\nelect him for his integrity and brilliance rather than for the reason that he\nis a school station man.\nIt) REDISTRICTING OF NAEB. Your suggestion of dividing REGION VI into\nRegion VI (A), composed of Washington, Oregon, Idaho, and western Montana,\nand Region VI (B) composed of California, Nevada, Utah and Arizona, has some\nmerit. Your analysis of the Board of Directors acting as a senate rather than\na house of representatives is also good. However, I feel that there must be"
}