{
  "id": "d1428-0",
  "text": "/\nN-A-E-B NEWS\nNATIONAL ASSOCIATION OF ELUCATIONAL BROADCASTERS\nRadio Hall, U.V^*, JVIadison, Wisconsin\nJanuary 1, 194?\n’’COMING EVENTS CAST THEIR SHAPQl'iS\nFM BUSIl'TESS - December, 1946 says in part; ’’EDUCATIONAL CEAIEEL EXCESS? Undsr\nthe pressure of highly corapetitive hearings, some FM applicants, through their\nattorneys and engineers, have grumbled that 20 FM channels are too many to^be set\naside for educational institutions* They point to the slow rate of educational\napplications submitted thus far as justification for their claim. Educators,^in\nturn, admit that schools are slow to apply, but blame legislators for tight-fisted¬\nness and point to extensive plans.\n’’But here is the box score of the extent to which all the educators’ plans\nhave been executed: six stations have been licensed, 23 construction permits have\nbeen issued, 20 applications are pending. Tv/enty other applications were tendered\nto the FCC only to be withdrawn by the applicants or returned by the FCC with the\nnotation ’’incomplete”.\nAVIATION vs. FM\nThe desirability of high spots as locations for FM transmitting towers and the\nundesirability of their use for such a purpose in the eyes of aviation interests\nhas created a real headache.\nFM operators logically look for the tallest hills or peaks as sites from which\nto get maximum coverage. Airmen look upon those peaks as hazards to air navigation,\nand object to having those hazards increased. Reconciling the two interests is\nno simple problem.\nSooner or later the matter of legal rights will need to be clarified for the\nbenefit of all concerned. So far the Civil Aeronautics Administration has been able\nto exert a strong influence by objecting to the FCC to the location of tovers in\ncertain locations. CAA admits that of itself it is virtually without authority to\ndo more than recommend. Beyond that lies the question of the authority of the FCC\nto deny licenses where all the specified requirements for the operation of a station\nare satisfactorily met.\nThe rights of property owners also enter into the picture. Denial of the\nright of an owner to use his property to a legitimate end amounts to a confiscation\nof that property, and compensation is expected.\nAviation interests point to the millions of dollars being spent on airports\nand air operations, saying that radio towers cannot be permitted to interfere with\nprogress. Yet they are not ready to accept progress which has been made by calling\nfor the use in planes of the radar type devices which can detect obstructions even\nwhen visibility is zero.\nThis conflict in interests between aviation with the thousands it serves, and\nradio with its millions of listeners, must be resolved, he must go forward on\nboth fronts."
}