{
  "id": "d1428-6",
  "text": "- 6 -\nHITS AND IvUSSES\nThe Georgia Assooiat'-on of Broadcasters is collaborating with^ the University\nof Georgia in what it calls a \"grassroots” approach to indoctrinating students and\nfaculty in practical radio operations. ¥<e wonder who is getting set to make hay r\nStewart McPherson, of the BPC, visited Canada recently. ^He listened to the\nradio and said, \"It’s pretty near unbearable listening, especially in the afternoon,\nduring washtub programs. The British will never have commercial radio\". And no\n■nging commercials?\nArthur Fiedler and the Boston Pops Orchestra will next summer present a new\nsymphony based on five commercial jingles. (Laxative ad reps please note.)\n\"Government Talent On Parade\" is listed as a new Y.ashin^ton D.C. broadcast.\nThat one should come from the Union Station platform after the new Congress gets\nto work.\nThe Michigan faculty in the levity of a \"Family Night Party\" contemplated\non what to expect if the institution’s new FM station were to be a commercial station\nThese samples were offered by various interests;\nIn the style of Lucky Strike;\nU yi —- M F E U M-M F E\nUniversity of Michigan Means Finer Education. Yes the\nUniversity of Michigan Means Finer Education. The University of\nMichigan gets the cream of the crop. So round, so firm, so fully\npacked, so free and easy on the draw-the University of Michigan\nFaculty. To those wUio know education best-it’s Michigan 2 to 1.\nIn the style of Pepsi Cola;\nPublic Health sure hits the spot\nTvvelve dead microbes thats a lot\nTv'ice the jobs, good pay too\nPublic Health's the School for you.\nIn the style of Ipana and Salapatica;\nHave you ever asked yourself \"Hhat’s wrong with the W'^rld\nIt's always a question of too much and not enout-h. Too much m^.ney and\nnot enough goods. Too many peo-ple and T..Dt enough supplies. Too much\nmaterial and not enough production. Th.-se problems can best b ' n.lved\nby the production and. research methods developed at the Universj.ty of\nMichigan School of Engineering. Their new, modern technfques^wi11 make\nyou hot in the winter and cold in the summer, they’ll build cities in\nthe country and countries in the city. The .School of jjjngineerxng, can\nmelt down the nation’s currency and mould the nation's wealth. Remember\nthe Engine School’s Slogan;\nInvention for the \"style of beauty\"-\nProduction for the \"style of wealth\"-\nEdited by-\nH. A. Engel\nRadio 'uBA\nMadison/ Wisconsin\nJanuary 1, 1947"
}