{
  "id": "d1829-1",
  "text": "Total AM stations ■\n■ 3031\n(includes\n36\nnon-commercial)\nTotal\nFM stations ■\n- 660\n(includes\n131\nnon-commercial)\nTotal\nTV stations •\n• 539\n(includes\n24\nnon-commercial)\nGREETINGS FROM THE PRESIDENT\n—Burton Paulu\nThe spring meeting of the Institute for Education by\nRadio-Television provides us of NAEB with our best\nchance of the year to get together, except for our own\nannual convention.\nAs those of you who went to Columbus last month\nknow, a good many NAEB activities were scheduled\nin connection with the Institute, and many of our\nmembers contributed in an important way to the In¬\nstitute, itself. To start off, the NAEB Board of Di¬\nrectors met for several hours Monday evening, May\n6, and during most of May 7.\nWednesday noon, under the capable direction of\nGale Adkins, ably assisted by Gertrude Broderick and\nother members of the Utilization Committee there\nwas an NAEB-sponsored luncheon at which Dr.\nAlexander J. Stoddard addressed a capacity group of\n150. Then came an afternoon session on utilization\narranged by NAEB, in the tradition begun by AERT\nin previous years. These first fruits of the NAEB-\nAERT merger were very successful.\nWednesday evening the Organizational Liaison\nCommittee had a dinner at the Maramour Restau¬\nrant, attended by our officers and headquarters staff,\nand representatives of some of the broadcasting and\naudio-visual education groups with which we have\nfrequent professional contacts. Special guests in¬\ncluded Don McGannon of the Westinghouse Broad¬\ncasting Company, one of the speakers at the opening\nsession of the Institute, and Dr. and Mrs. I. Keith\nTyler. On Thursday noon we held' an NAEB\nluncheon and open business meeting, with short re¬\nports from officers, committee chairmen, and head¬\nquarters personnel.\nIn addition to these NAEB-arranged meetings,\nthere were many Institute sessions in which our mem¬\nbers had major roles. There were many NAEB com¬\nmittee meetings, too. For example, the Professional\nAdvancement Committee met all day Saturday to\ndraw up plans for the Television Management Sem¬\ninar scheduled for Allerton House on August 20-25.\nOn Saturday and Sunday, a number of ETV sta¬\ntion managers and program directors went from\nColumbus to Ann Arbor for a meeting of ETRC af¬\nfiliates. On Tuesday afternoon, May 14, the NAEB-\nETRC Liaison Committee met with ETRC Presi¬\ndent Harry Newburn.\nIt seems to me that NAEB’s contributions to the\nInstitute were outstanding. What do you think?\nNevertheless, I’d like to hear from all NAEB officers\nand members as how we might better organize our\ncontributions to future IERT meetings. At the same\ntime, let’s look forward to our own convention from\nOctober 30 to November 2. Let our motto be: “See\nyou in St. Louis!”\nMEMO FROM THE EXECUTIVE DIRECTOR\n—Harry Skornia\nThis month, like May, is a busy one for your Head¬\nquarters staff. The Radio Programming Seminar was,\nindeed, a great success. So, we believe, will be the\nSeminar to be held in late August for ETV station\nManagers and Directors which we are working on\nnow.\nThe assistance given the whole movement by the\ngenerosity of Foundations like the W. K. Kellogg and\nFord Foundations would be difficult to exaggerate,\nfor they have provided many of the essential rungs\nin the ladder to what we. hope will one day be a\nstrong national movement of which the entire Ameri¬\ncan public will be aware and proud.\nThe Board meeting at Columbus was well-at¬\ntended and expeditiously handled. President Paulu\nwill undoubtedly report more fully on that.\nThe evening of May 9 and a part of May 10,\nFrank Schooley and I spent with Dr. Maurice Seay\nof the Kellogg Foundation in discussions of our pro¬\ngram and general possibilities for the future. We were\ngraciously received, had a fine discussion, and had\nthe pleasure of spending some time with Dr. Emory\nMorris, President of the Kellogg Foundation.\nFrank Schooley, as Foundation Committee Chair¬\nman, has more recently conferred with Ford Founda¬\ntion officials on plans for the future, and we have\nreason to believe that these conferences, too, were\nboth pleasant and useful to all concerned’.\nBecause of our crowded agenda, we were forced to\nmiss the NAEB’s IERT luncheon on Thursday of that\nweek. From all we’ve heard, however, it was a suc¬\ncess, and Harold Hill more than adequately handled\nthe Headquarters reporting provided for those in at¬\ntendance.\nI know that the Wednesday NAEB luncheon and\nthe Liaison Committee meeting, handled by Gale\nAdkins and Gertrude Broderick, respectively, were\nenthusiastically received. One of the highlights of the\nformer, as we expected, was the address of Dr. Alex¬\nander Stoddard of the Fund for the Advancement of\nEducation.\nThe Institute was also generally agreed to be an¬\nother very successful one, and we were pleased to\nnote, once again, the number of awards won by\nNEWSLETTER"
}