{
  "id": "d1829-3",
  "text": "do not take Network service then. Naturally, your\ncomments on our summer programming will be ap¬\npreciated.\nI really am sorry I didn’t get a chance to meet\nand talk with more Network people at the recent\nIERT meeting in Columbus, but if you were there\nyou know how fast the time passes. I truly hope at\nleast one representative from each Network station\ncan manage to come to the NAEB convention in St.\nLouis this fall. Make plans for it now; the dates are\nOctober 29 - November 1. I’ll be seeing you there.\nWith the summer offering now in distribution, our\nthoughts are turning to the fall offering for this year\nand the winter offering for 1958. We could stand\nsome more submissions for these offerings; so if you\nhave one or more good program series scheduled for\neither or both of these periods, be sure to send them\nin. There are a lot of submission forms; don’t hesitate\nto write for some.\nRADIO MEN REPORT\nHenry Bartkowski of WSPE, Griffith Institute and\nCentral School in Springville, N.Y., sent a program of\nhis FM station’s activities. The station serves the\ncommunity with a signal of 15-25 miles and is the\nfocus of activity for the high school radio-speech pro¬\ngram. Students have an opportunity to work and give\nspeeches in a professional radio atmosphere.\nHarry Brawley, of WCHS in Charleston, W. Va.,\nwrote to tell about the WCHS-Morris Harvey College\nRadio Classroom. They are now completing their 7th\nyear offering credit courses over radio. Latest station\nfigures are:\nNumber of courses offered 25\nTotal enrollment 1186\nAverage per class 47.45\nLet’s have some more response from active radio men\nfor the Newsletter!\nHAIL AND FAREWELL\n—Mrs. Judith Stevens, Editor\nThis Newsletter marks my last session as Editor, and\nI’m taking this opportunity to thank all of you for\nyour comments and criticism of my work.\nMy successor, Hans Massaquoi, who is taking\nover the Editorship this summer, will undoubtedly\nappreciate your interest as much as I have. Be sure\nto keep the news coming; and pictures, please!\nThanks again for all the help and encouragement\nyou’ve given me. It’s been a rewarding experience,\nand a very pleasant one.\nREPORT FROM REGION II\nThe NAEB Region II meeting was held in Columbus\nMay 7. Several topics were discussed, among them\nthe idea of a regional radio program exchange among\nand between Region II stations. The problems of\nradio-TV relationships, cooperative multi-station pro¬\ngram series production for the tape network, and\nNAEB membership status were also discussed.\nMembers present were: Vernon Bronson, Dade\nCounty Board of Public Instruction; Ed Wegener,\nAlabama Polytechnic Institute; Raymond Cheydleur,\nFlorida State University; Stephen Buell, Marshall\nCollege; Rae Weimer, University of Florida; Kenneth\nWright (ETRC), University of Tennessee; John\nYoung, University of North Carolina; Graydon Aus-\nmus, University of Alabama; Lucille Ruby, Louisiana\nState University; and Robert Schenkkan, University\nof Texas.\nThe meeting was also attended by: Harold Hill,\nBob Underwood and Cecil Bidlack of NAEB, Ralph\nSteetle of JCET, and Seymour Kreiger of the Wash¬\nington legal staff of JCET.\nUNESCO AND TV\nUNESCO became interested in TV in 1951, and called\nan Advisory Committee of TV Experts from 8\ncountries to help in its work. The Committee rec¬\nommended UNESCO enter the TV field because of\nthe widespread influence TV was gaining and its\npossibilities of serving the cause of world peace.\nUNESCO is now serving as a clearing house for\nTV information, promoting the use of TV for\neducational purposes, and promoting international co¬\noperation among TV organizations and producers or\ndistributors of educational films. It also assists\ncountries planning or starting TV broadcasting and\npromotes the production of TV programs on\nUNESCO and UN teams.\nIn short, UNESCO serves as a world source of\nTV information, as a source of ideas about its cultural\nor educational use, and as a source of material for\ncultural program production.\nAWARDS\n► Two educational broadcasting stations won the\nAlfred P. Sloane Radio-TV Awards for 1956, given\nfor the best traffic safety programs.\nWKAR, Michigan State, produced “You Are the\nJury,” a distinguished radio series combining audience\nparticipation with expert technical analysis to clarify\nmany common traffic programs.\nWTTW, Chicago’s ETV station, telecast a 15-\nweek series called “The Man Behind the Wheel.”\nThe program represented a successful pioneering\neffort to teach techniques and principles of good\ndriving over TV.\n4\nNEWSLETTER"
}