{
  "id": "d770-10",
  "text": "- 4 -\nNHK:\nNZBC:\nRTH:\nUARTO:\nP/20\n\"While a number of films exchanged under the ABU project have\nbeen found to be of high quality, we have been occasionally\nobliged to give up using them, because of the fact that the\nscripts accompanying the films (which scripts appeared to be\na direct translation from the text used in their domestic\nbroadcasts) were lacking in background information that is\nindispensable for our viewers. In order to ensure better use\nof the films we receive under the exchange project, we wish to\nask the member organisations to supply us with more detailed\nscripts. (Telecasts of foreign films without an accurate\nscript are feared to cause misunderstanding.) Regarding\ntechnical quality of the films, we find that contributions from\na few members are over-exposed or contain scratches.”\n\"A good number of ABU items are directed at small specialised\ngroups and often solid commercial content. Items of general\nnature usually contain basic information of limited value.\nterns that contain valuable new information are rare and are\noften orientated for the original audience to such a degree that\nsevere editing is required before they can be screened here.\"\n\"It would be an ideal if the film sent to RTH could be accompanied\nwith an international sound track. Appropriate sounds are\nneeded, because the film, being shown to a non-English speaking\naudience, has to be dubbed in Thai.”\n\"Subjects best appreciated by the farmers in UAR, are those\ndirected originally to the avergae farmer and not to the academic\nexperts in agriculture and animal breeding. They identify easily\nwith a farmer like themselves performing some new method in a\nsimple way.\"\nQuestionnaires signed by:\nMr. G. White, Director, Rural Broadcasts\nMr. Morio Tateno, Director, Overseas Broadcasting Dept.\nMr, F. Barnes, Supervisor of Rural Broadcasts,\nMrs. Somchit Siddhichai, ABU Liaison Officer for RTH\nUARTO: Mr. Hamada Abdel Wahab, Controller of Rural Programmes\nABC:\nNHK:\nNZBC:\nRTH:"
}