{
  "id": "d770-111",
  "text": "RESOLUTIONS OF THE ABU FOURTH GENERAL ASSEMBLY\nSINGAPORE, 23 to 30 OCTOBER, 1967\nRecognising the great importance to ABU members of the action of UNESCO\nin associating itself with our efforts towards improving the\ntraining facilities for broadcasting staff in the ABU region,\nespecially in connection with the proposed establishment of\na Broadcasting Training Institute, and\nhaving heard with great interest the message from UNESCO’s Assistant\nDirector-General in charge of Communications concerning the survey\nmission sent by UNESCO to a number of ABU countries with a view\nto assessing training needs,\nThe General Assembly\nrecords its warm gratitude to UNESCO for this further evidence of its\ncontinuing interest in the development of broadcasting in Asia\nand the Pacific, and\ndirects the Secretary-General to maintain close contact with UNESCO with\na view to bringing this important training project to fruition as\nsoon as possible.\nBeing aware of the rapid development of various types of satellites\nsuitable for broadcasting purposes, and\nbeing convinced of the urgent need for the broadcasting organisations\nof the world to discuss the problems inherent in the use of this\nnew means of communication and to make known their views thereon\nbefore international agreements are completed,\nThe General Assembly\nexpresses its warm appreciation of the action of UNESCO in convening a\nmeeting of representatives of the regional broadcasting Unions\nand of North America to be held in Paris on 24 “ 26 January 1968$\ncommends the action of the Administrative Council in selecting as its\ndelegates to this conference the President, Mr Yoshinori Maeda,\nand Mr T.S. Duckmanton, supported by the Secretary-General\nSir Charles Moses, thus ensuring ABU representation at the\nhighest level?\nwelcomes this opportunity for discussing satellite broadcasting problems\non a worldwide basis, and\nexpresses the hope that, as a result of this conference, an International\nConvention will be prepared for submission to an early UNESCO\nGeneral Conference making the use of television broadcasts by\nsatellite, whether live or deferred, subject to the precise\nauthorisation of the originating organisation and, in general,\nensuring that broadcasting organisations are given the fundamental\nprotection they need when originating transmissions by satellite.\nRecognising that the decision of the Ford Foundation to make available\nto the ABU a grant of $US200,000 in the years 1967 to 1971\nwill make possible the strengthening of the Secretariat and\nthe confirming of its international character?\nbelieving that the Union’s relations with other international organisations\nmay thereby be strengthened, and"
}