{
  "id": "d770-21",
  "text": "ASIAN BROADCASTING UNION (A. B. U.)\n10 September 1968\nSome time ago our Secretary-General sent to all ABU members a preliminary\nlist of agenda items for the ABU meetings that are to be held in New Delhi\nnext November. This list included the subjects that will in any case need to\nbe discussed, such as projects already in progress, and members were invited\nto submit any additional proposals which they might have to discuss.\nIt is now my responsibility, as the President of the ABU and in accordance with\nthe requirements of the ABU Statutes, to send to members the completed agenda\nfor the meeting, copies of which are attached. It will be noted that the agenda\nis divided into three sections, relating to the Programme and Engineering Com¬\nmittees and the General Assembly, because, as previously explained, the two\nCommittees will meet before the General Assembly. However, the reports and\nrecommendations of the Programme and Engineering Committees will of course\nbe submitted to the General Assembly for adoption as has been the case in the\npast.\nI am also attaching copies of a schedule which draws attention to the need for\nmembers to send to the host organisation for the meetings, All India Radio, as\nsoon as possible, any documents they may wish to contribute for use during the\nmeetings. I would like to emphasise that all full and associate members are\ninvited to contribute documents on any of the agenda items which they consider\nwould be of assistance to members in discussing thefce subjects. In the case\nof the Engineering Committee, for example, members may contribute reports\nunder any of the broad headings included in the agenda.\nI also wish to mention particularly the special topic for the Fifth General\nAssembly, which has been given the short title, Functional Literacy, in the\nagenda. As members already know, the discussions on this subject will be\nconcerned with the contribution which radio and television can make to the efforts\nbeing made in all parts of the world to reduce illiteracy. In particular, it will\nbe concerned with the new approach to literacy teaching in which such teaching\nis closely related to national plans for economic and social development, so that\nthose who are newly literate can make a full contribution to the development of\ntheir own countries. I know that many of the ABU's members are already in¬\nvolved in the struggle against illiteracy in their own countries and I hope that\nthese members will be prepared to contribute to our work on this important topic,\neither by supplying written reports or through their contributions to our discussions\nYours sincerely,"
}