{
  "id": "d770-32",
  "text": "size and power which are capable of transmitting to ground terminals of medium\nsize and sophistication. These are called distribution satellites and could be used\nfor distributing programmes directly to conventional transmitting stations on\nearth, which would then re-trammit them to borne listeners; or to antenna receiver\nterminals of moderate sophistication, size and cost, which would deliver pro¬\ngrammes to the listener either by wire or by strictly local transmission through\nlow-powered repeater systems.\nThe basic problem of broadcasting satellites today is power, i.c., they must\nhave enough power to produce a signal which will reach the earth with sufficient\nstrength to be picked up by home receivers.\nThe power requirements for such satellites range from a few hundred watts to\na few hundred megawatts, depending on the type of service (sound jgjoadeasting\nor television), the frequency range employed, and the kind of modulation (am¬\nplitude or frequency). In the light of expected progress, direct broadcasting from\nsatellites to home receivers might be possible in perhaps seven or eight years,\nwhich is a fairly long time.\nThis time scale led to consideration of an interim distribution satellite which\nmight be able to provide more limited service but would require less power. Many\nvarieties of distribution satellites are possible, depending on the type of service\nrequired and the degree of sophistication, and hence cost, of the antennas which\nwould be necessary. A distribution satellite which could be used for fm radio\nbroadcasts, as an example, could be built in about three years, once a decision\nwas made to go ahead with its construction.\nFor the developing nations, the distribution satellite offers a good alternative\nto the establishment of extensive (and expensive) ground communications sys¬\ntems utilizing radio relays or co-axial cables. Installation of such a system could\ntake as long as a decade or more, while a distribution satellite with a television\nchannel and several associated voice channels could be available in a much\nshorter time.\nHowever, it is the point-to-point communications satellite which today has the\ngreatest potential for the developing nations, since point-to-point systems are\nalready in operation. Point-to-point satellites arc already being used to transmit\ntelevision and radio programmes of great timeliness and urgency from continent\nto continent, and, as more and more of them come into being, several other\nimportant things can be expected to happen.\nFor one thing, the number of available telephone and telegraph channels will\ngrow very' rapidly. This growth can be expected to cut the cost of long-distance\ncommunications to a. considerable degree, and it should lessen the differentiation\nof tolls by distance. It may even be possible to look forward to the day when\nthere will be only a single rate for calls made to any point on earth.\n\"Facsimile transmissions over long distances will also be encouraged by point-\nto-point communications satellite systems. It has frequently been pointed out that,\nif it should prove economically feasible, a single satellite could handle all of\ntoday's transatlantic correspondence, thus immensely speeding up mail delivery.\nPoint-to-point satellites would also make the exchange of data over long dis¬\ntances easier. Satellites, coupled with sophisticated computers, could assemble,\nprocess and distribute world-wide information on such topics as the weather or\nindustry' quickly and easily.\nIn order to achieve maximum benefits from point-to-point communications\nsatellites, however, a constant dialogue between broadcasters and engineers is\n6"
}