{
  "id": "d770-36",
  "text": "Chapter VII. Education and Training\nAt the dosing session of the XVIIIth Congress of the International Aslronautical\nFederation (iaf), held in Belgrade, Yugoslavia, in the autumn of 1967, William\nBoliay of Stanford University, Palo Alto, California, Chairman of the iaf Educa¬\ntion Committee, reported on three significant papers on education via satellites\nwhich had been presented at the education sessions of the Congress.\nAmong the most important conclusions taken from these papers were the\nfollowing:\n• The synchronous equatorial satellite appears to be most suitable for educa¬\ntional television (etv) because it is always on view for a given longitude belt, and\nit permits the use of low-cost, fixed antennas for the direct reception of radio and\ntelevision programmes by even the most remote village schools.\n• High-power but light-weight solar cells are now technically feasible on satel¬\nlites to provide a power output of 1-3 kilowatts, which is necessary for the direct\nrelaying of television programmes to schools with small receiving antennas, of the\norder of 1-3 metres.\n• If started now, it would be technically feasible by 1970 to offer direct tele¬\nvision education via satellite to all schools within an area as large as all of India\nor Brazil or Indonesia, i.e„ millions of square miles.\n• In large-quantity production, the cost of a school etv receiver, including\n2-metre-diameter antenna, capable of receiving programmes directly from a satel¬\nlite, would be about $350, or less than $1 per student per year,\n• Perhaps the most important conclusion reached in the papers. Professor Boliay\nnoted, was that, because of the importance of satellite etv, action should be taken\nnow to develop satellites and ground stations, and to begin obtaining the necessary\nexperience with television education in the developing countries, using presently\nexisting or newly installed television stations.\nThe report offers one more indication of how much progress has been made in\nthe past few^ years in the direction of television educational programmes from\nsatellites. Although educators and engineers have been talking about the enormous\npotential of the satellite as an educational tool almost since the day the first\ncommunications satellite was launched, it is only recently that satellite etv has\ncome to be thought of as a goal to be sought in the immediate future, rather than\nas something which would inevitably come \"some day\".\nThe papers presented at the 1967 iaf Congress hint that most of the probtems\nof satellite etv either have been solved or could be solved within a fairly short\ntime. In addition, the iaf Education Committee appears to feel very strongly that\nnot only are direct television broadcasts from satellites feasible, but that the costs\ninvolved in establishing satellite etv systems, capable of broadcasting directly to\nschools, 'would not be prohibitive.\n30"
}