{
  "id": "d770-40",
  "text": "1. training at the graduate and post-graduate level in space science and technol¬\nogy and related subjects;\n2. research in the space sciences;\n3. training in optical and radio tracking;\n4. training in payload construction and testing;\n5. training in data handling;\n6. training in the area of space applications, and particularly in the operation of\nground terminals for communications, meteorological, navigation and earth-re¬\nsources satellite systems.\nMany education and training programmes in space science and technology are\navailable on a bilateral, regional and international basis, and a complete list of the\nfacilities and programmes offered in different countries is available from the United\nNations.*\nAmong the most important of these programmes are the European Space Re¬\nsearch Organization (esro) educational programme, which includes Scientific Pro¬\ngramme Fellowships for experienced researchers to work in European institutes,\nand European University Student Fellowships for post-graduate training in the\nspace disciplines, as well as summer schools in space science and technology, and\nspecial colloquia and symposia; the United States National Aeronautics and Space\nAdministration programme, which includes International University Graduate and\nPost-Doctoral Fellowships in Space Science. Post-Doctoral and Senior Post-Doctoral\nResident Research Associate Fellowships, and training in connexion with nasa co¬\noperative projects with other countries; symposia, seminars and summer schools in\nthe Soviet Union and East European countries: special seminars, and schools, such\nas the Space Science Seminar at the Thumba Equatorial Rocket Launching Station\nin India, and the Latin American School on Space Physics in Bariloche, Argentina;\nand periodic workshops on meteorological satellites organized by the World Me¬\nteorological Organization, and on communication satellite technology organized\nby the International Telecommunication Union.\nOne interesting new development of particular interest in this area is the Ex¬\nperimental Satellite Communication Earth Station established by India at Ahmeda-\nbad with the assistance of the Special Fund Sector of the United Nations Develop¬\nment Programme. The Station promises to fill one of the most important needs of\nthe developing countries in that it will provide practical training in operating and\nmaintaining a ground station.\nTTic Station is organizing two different training courses, one for scientists and\nengineers dealing with space and space communications systems, and a second for\nmaintenance personnel which will cover all aspects of maintaining equipment used\nin communications satellite ground stations. Arrangements have been made with\nthe United States for the Station to cany out tests and experiments with Applica¬\ntions Technology Satellites launched by the United States.\nThe Government of Poland, in a recent report to the United Nations Committee\non the Peaceful Uses of Outer Space, proposed an international training scheme\nas the first step towards active international space collaboration, noting that a\nshortage of technical specialists was probably the largest single barrier to partici¬\npation in space programmes.\n*International Directory of Facilities for Education and Training in Basic Subjects Be-\nlated to the Peaceful Uses of Outer Space (United Nations publication, .Sales No.:\nE.68.1.4.)\n34"
}