{
  "id": "d770-42",
  "text": "£r-S <107\nASIAN BROADCASTING UNION\nOFFICE OF THE SECRETARY-GENERAL\nBOX 3636. G.P.O..\nSYDNEY.\nCABLE ADDRESS: ASBUN. SYDNEY\nTO: ABU MEMBERS\nNECESSARY ACTION BY THE ITU REGARDING SPACE COMMUNICATION\nThe resolution adopted by the ABU Administrative Council at its recent meeting\nincluded a request that ABU members emphasise to the appropriate authorities in\ntheir own countries the importance of ensuring that:\n(a) an Extraordinary Radio Administrative Conference regarding space\ncommunication should be convened by the ITU (international Telecommunica-\ntion Union) as soon as possible to pursue work started at a similar\nconference in 1963;\n(b) the next Plenary Assembly of the C.C.I.R., one of the agencies of the\nITU, should be held ag soon as possible, so that further progress can be\nmade with various aspects of space communication which are being studied\nby the C.C.I.R.\niiS members will be aware, the ITU is a Union of Governments which have accepted\nthe International Telecommunications Convention, In each country, there is a\ngovernmental authority - usually the authority responsible for telephones and\nother telecommunications services - which acts for its Government in relations\nwith the ITU and in arranging for the country concerned to be represented at\nITU meetings. In ITU correspondence these authorities are often referred to\nas ’Administrations'.\nIn addition, the ITU admits to its activities in what is referred to in its\nConvention as \"an advisory capacity\" international organisations such as the\nregional broadcasting Unions. The ABU was granted this status last year with\nthe C.C.I.R., one of the major agencies of the ITU, and in this capacity receives\nITU documents and publications and can be represented, if it wishes, at\nconferences arranged by the ITU or its agencies which are in fields that are of\ninterest to our Union. The ABU and other such international organisations are\nnot, however, able to act for their members in matters such as the convening\nof ITU conferences because such decisions rest with the Governments which are,\nin effect, the full voting members of the ITU: the Governments act through\nthe national authority, or 'Administration', which has been selected in each\ncountry as the official authority in relations with the ITU.\nThis is the background to the resolution recorded at the recent meeting of the\nABU Administrative Council which is mentioned above. The ABU's Council believes -\nand this view is shared by other broadcasting Unions such as the European\nBroadcasting Union — that it is in the interests of broadcasting organisations\nto try to influence the ITU to arrange as soon as possible the meetings mentioned\nabove. There are a number of issues, such as further revision of the assignment\nof frequencies for space communication, which need to be resolved by international"
}