{
  "id": "d770-47",
  "text": "- 2 *\nc} to harmonize the actions of nations in the attainment\nof those common ends”;\n3, that space- telecommunication is merely another form of\nthe art of telecommunication involving the I.T.U. in its traditional\nresponsibilities;\n4, that the I.T.U., through its administrative conferences\nand its permanent organs (C.C.I.R., C.C.I.T.T. and I.F.R.B. - whose present\nwork in this field is outlined in the Annex to this Resolution) is fully\nqualified and well-equipped to deal with the study and regulation of the\ntechnical and operational aspects of space telecommunication;\n«5# that the complementary nature of space telecommunication\nand telecoramunic ation by conventional means (requiring their integration into\nthe world telecommunication network, an integrated plan for the allocation of\nradio frequencies, the coordination of the use of the radio frequency spectrum,\netc.) necessitates technical and operational coordination and regulation by\nthe I.T.U. of all forms of telecommunication;\nrecognizing\nthat interest in various aspects of space telecommunication\nis being displayed by a growing number of international organisations, not all\nof whom are fully apprised of the I.T.U.Ts essential role in this field;\nresolves\nthat the activities and responsibilities of the I.T.U.\nas outlined in this Resolution should be brought to the attention of all\ninternational organizations and of national representatives attending such\norganizations with a view to ensuring full cooperation and proper coordination\nof the studies and efforts being undertaken by the X.T.U. and other inter¬\nnational organizations in the field of space telecommunication;\ninstructs the Secretary-General\n1. to bring this Resolution together with Resolution\nNo. R632, to the notice of the Secretary-General of the United\nNations and to the heads of the U.N. Specialized Agencies and of all\nInternational organisations known to have an interest in any aspect of\nspace telecommunications;"
}