{
  "id": "d770-49",
  "text": "ANNEX\n(to Resolution Ho)\nTHE FKSMAHKNT (BQAN3 OP THE UNION\nAND SPACE RADXOCCmJNICATICW\nX^F.R.B,\n1.1 In its Resolution No. 1A, relating to the provision and use of\nInformation regarding international satellite systems* the Administrative\nSpace Radio Conference (Geneva* 196.3) resolved that any Administration\n(or group of Administrations) which intended to establish an international\nsatellite system should provide the Board with a general description of it.\nThe Board was instructed to publish this description so as to enable any\nother Administration which believes it has reason to expect harmful\ninterference to address its comments to the Administration concerned; the\nlatter should then endeavour to find a satisfactory solution and the Board,\nmight be asked to submit suggestions if necessary.\nThis procedure* which in no way resembles the procedure for the\nrecording in the Master International Frequency Register of frequency\nassignments to stations of the space service (Article 9A of the Radio\nRegulations), has been applied so far to four international satellite\nsystems* the description of which has been brought to the notice of\nAdministrations.\nX ,2 Procedure for the treatment by the I.F.R.B. of frequency notices\n7^cen\\lng\"aisIgriiRent3 to stations in the space service and the\nradiGastronomy service\nUnder No* l6p of the International Telecommunication Convention*\none of the essential duties of the I.F.R.B* is to effect an orderly recording\nof frequency assignments made by the different countries.\nSo far as terrestrial services are concerned, the rule given in\nArticle 9 of the Radio Regulations is that (except in certain specified\nfrequency bands allotted on a regional basis), all frequency notices shall\nbe examined by the I.F.R.B* with respect to the probability that harmful\ninterference may be caused to stations In any service by the use of the\nnotified frequency.\nIn the case of the apace service, all assignments of transmitting\nor receiving frequencies to an earth station notified in accordance with.\nArticle 9A of the Radio Regulations are examined by the I.F.R.B. with respeqi\nto the site of the station concerned in relation to the frontiers of the\nnotifying country. It depends on the result of this examination, which is\nbased on’the notion of \"coordination distance\" defined by the Administrative"
}