{
  "id": "d770-50",
  "text": "~ 2 -\nSpace Radio Conference In 1962, whether or not the notifying Administration\nis asked to make a closer study, in cooperation with the Administration of\nthe neighbouring country or countries, of the probability of harmful\ninterference between the earth station and the stations in terrestrial\nservices of the latter country or countries and to coordinate the use of\nthe frequencies with the latter Administration^).\nWith regard to frequency assignments to space transmitting\nstations notified under Article 9A of the Radio Regulations, the I*P.R.B*\nstudies them - when they concern frequency bands shared with terrestrial\nservices - by calculating the power flux density produced at the earth*s\nsurface basing itself on the emitted power, the antenna characteristics\nand the orbit characteristics. The Board gives Its opinion on the frequency\nnotices after comparing the results of its study with the established\ncriteria*\nA frequency assignment to a space receiving station notified in\naccordance with Article % does not undergo technical examination by the\nX.F.R.B. It is for the notifying Administration to take the necessary steps\nto ensure that such a receiving station is not subject to interference either\nfrom emissions by other stations of the space service or, should it be\noperated in a frequency band not allocated exclusively to the space service,\nfrom emissions by terrestrial stations*\nFrequency assignments to stations of terrestrial services in the\nfrequency bands shared by these services with space receiving stations are\nexamined by the I*F,R,B*, which compares the maximum effective radiated\npower with the established criteria*\nNotification to the I.F.R.B. of the frequencies used by radio\nastronomy stations for receiving is optional (see No* 639AC of the Radio\nRegulations) and is effected virtually for information only.\n2* C«C«1*K«\nThe C*C*X#R* has concerned itself with space communications since\n1959 when a Study Group was set up to deal especially with the problems of\nspace telecommunications to provide a sound technical basis for the most\nefficient use of the radio frequency spectrum* The latest C.C.I.R* text?\non this subject, which include studies of the technical and operating aspects\nof all forms of space telecommunications, are principally those prepared by\nStudy Group IV (Space Systems and Radioasironomy) and approved by the XIth\nPlenary Assembly of the C.C*I.R* (Oslo, June/July 1966). These studies\nconcern the possibilities of communication satellites per se and those\nconnected with the integration of satellites into existing telecommunication\nsystems. They deal particularly with the following points :"
}