{
  "id": "d770-52",
  "text": "- 4 ~\nby transmitters of a terrestrial service to the receivers of ft satellite\nsystem. This problem has led to the introduction of the concept of\ncoordination distance which is that distance within which mutual\nconsultations between administrations will be required and beyond which\nthe possibility of Interference may be regarded as negligible.\nd.) Antenna considerations\nIn view of the large distances that will always separate a\nsatellite from its ground station and the possibilities of interference\nbetween satellites* earth stations and terrestrial communication systems,\nlarge directional antennae have been required for the space services.\nThe'directional properties of these antennae including the effect® of\nterrain are of considerable Importance in determining the potential\ninterference between various telecommunication systems and are under study\nin the C.C.I.B.\n»!\nSI\nIt\nj I\nij\ne) Broadcasting from satellites\nThe possibility of broadcasting from satellites to serve large\nunpopulated areas such as oceans and deserts and to bring broadcasting\n(both sound and vision) to areas where the population is widely distributed\nand where existing terrestrial networks are limited both in extent and/or\ncapacity Is receiving considerable interest since the most recent\nAdministrative Conference devoted to space communications lu 196j* There\nare essentially three types of services being envisaged using relay\nsatellites, distribution satellites and direct broadcasting satellite®.\nThe c.C.IJt. is studying these possibilities from the technical am\noperational standpoint with particular emphasis on the transmitter power\nrequired in the spacecraft, the most suitable frequencies and the\npossibilities of providing satisfactory receivers at a low cost.\nf) Otherspace tgleoowgunication system®\nThe choice of frequencies am, various parameters in the case of\nradio navigation by satellites, meteorological satellite®, near earth and\ndeep space research satellites and manned spacecraft are also being studied\nby the C.C.I.R.\nThe chief subjects relating to space telecommunication system\nstudies dealt with in the C.C.X.K. have been summarized above. In addition,\nthe C.C.X.Pw reports on space systems contain a great amount of Information\nranging from instructions on how to apply recommendations to background\ninformation. The programine of studies being pursued by the C.C.Z.R* ihr\nthe field of space telecommunications is extremely broad embracing all the\ntechnical problems arising In this field. The next meeting of Study Group\n(Space systems and radioastronomy) 1» due to take place in Geneva from ^\n18 September to 8 October 1968 in preparation for the XItth senary Assembly\nof the C.C.I.R. to be held, early in 1970, It is believed that the\nof the Xllth Plenary Assembly will be sufficiently advanced to determine,\nfrom the technical and operational point of view, the potentialities oi"
}