{
  "id": "d770-53",
  "text": "- 5 r\nmany nm general purpose* and fcp&pi&liied eamm^dgubion satellites and to j|\nconsider their use on a worldwide bml$ with oih&r qo^unie^tlon systems, ||\n>* £^1^1.-\n3*1 Th*» C*C*I»T.T’* is iniarwstpd ia this wee of ccsmsunication satellites\nfor telegraphy* facsimile* tolsphony and d-a-ta tra&gssission and for any\nsignalling rasoQl&fced with tho** different types of uoasmuaioation. Several\nStudy Groups hav* contributed to this work*\n3*2 Since the cmmxssl&i*£Xw s*teilites »<af in oowmeroisl operation are\nall of the high altitude type, the problem raised by the Doppler effect and\nInterruptions (when passage is effected from one satellite to another) are\nnot urgent, With such satellites the factors which have the moat serious effect\non tran»mi«aion quality are transmission delay and echo. For this reason.\nStudy Group .XII has proposed retaining for the time being the recommendation\nalready Issued on this subject In 1964* The limits given In the recommendation\nconcerned are based on speech transmission quality* In data transmission with\nhigh transmission delays error control may raise difficulties and Special\nStudy Group A is studying the matter*\n3.3 Study Group XVX has prepared recocaaendations which should be applied\nto satellite telephone circuit® to ensure that the overall limits fixed by\nStudy Group XII are not exceeded; for this purpose not more than one high-\naltitude satellite may be included in a connection, except in quite exceptional\ncircumstances. As a result of the** studies, Study Group XIII has introduced\nsome supplementary rules in the international routing plan and is fully aware\nthat the routing plan have to be adjusted within a few years if demand-\nassignment of circuits becomes common practice# It Is proposed to study a\nquestion in this respect during the period 1968x1972.\n3.4 C.C*I.T.T, Study Group IV considers the maintenance of satellite\ncircuits, which set© some new problems, especially since the composition of\nsuch circuits has not been defined in the same way as for conventional systems*\n3,5 The new telex and telephone signalling systems that have been\nrecommended or are under study make allowance for thf special features of-\nsatellite circuits*\n3*6 Study Croup II is considering tbs tariff problems reiswd by the use\nof satellite circuits for telephony*"
}