{
  "id": "d770-58",
  "text": "Dear Sir,\nOn 1 May 1968 I wrote to you and to the other members of the ABU\nto convene, in terms of Clause 1 of Article 9 of the ABU Statutes, the Fifth\nGeneral Assembly of our Union to be held in New Delhi within the period\n13 to 23 November 1968 with All India Radio as our host organisation.\nAt that time it was not possible for me to give our members a\ndetailed schedule for the period of the General Assembly, mainly because\nthe ABU Administrative Council wished to review, at its meeting in Seoul\non 23 and 24 May, the arrangements for our General Assemblies. The\narrangements which we have been observing were adopted shortly after the\nestablishment of the ABU, when the membership of our Union was very\nmuch smaller than it is today. Our Administrative Council therefore\nconsidered that it would be desirable to re-examine our procedures, in order\nto make them more efficient in the circumstances in which our annual meet¬\nings are now held, particularly the large increase in the number of the\ndelegates.\nAs the President of the ABU, I now wish to advise you that the\nCouncil has decided that a change should be made which I and the members\nof the Council believe will not only be convenient for all our members but\nwill make it possible for our General Assemblies to be conducted more\nefficiently and for the Administrative Council to carry out the functions\ngiven to it by the ABU Statutes.\nAt previous General Assemblies the Administrative Council has met\nimmediately before the General Assembly and this meeting has been followed\nby the Opening Plenary Session of the General Assembly and then by the\nmeetings of the Committees which made plans for future ABU activities\nfor submission to the Closing Plenary Session. Under the new arrangements,\nwhich are to be adopted at the 1968 General Assembly, the Programme and\nEngineering Committees will meet first to prepare their plans and this will\nbe followed by a meeting of the Administrative Council and then by the General\nAssembly. Although the period of the General Assembly itself will be shorter\nthere will be more time than previously for discussions on the special topic,\nwhich members regard as an important aspect of our General Assemblies,\nand the General Assembly will also review the recommendations of the Com¬\nmittees as was previously done at the Closing Plenary Session."
}