{
  "id": "d770-65",
  "text": "ASIAN BROADCASTING UNION\nOFFICE OF THE SECRETARY-GENERAL\nBOX 3636. G.P.O..\nSYDNEY.\nCABLE ADDRESS: ASBUN, SYDNEY\nTO: ABU MEMBERS\nINTERNATIONAL COPYRIGHT CONVENTION RELATING TO SPACE COMMUNICATION\nIn the resolution regarding space communication adopted by the ABU Administrative\nCouncil at its recent meeting special attention was drawn to the urgent need\nfor a new international copyright convention which would provide protection\nfor programmes relayed by satelliteo The ABU’s Council requested that members\nof our Union should:\n’'•••• inform the appropriate national authorities and the UNESCO National\nCommissions in their own countries of the importance to broadcasters of\nthe recommendation made by the Conference (of broadcasting Unions)\nregarding a universal convention for the protection of television\ntransmissions carried by satellite .... and that they should take\nappropriate steps to ensure that the national delegations to the next\nsession of the UNESCO General Conference, to be held in the latter part of\n1968, will support the recommendations on this matter made by the\nConference” (of broadcasting Unions).\nThis request to members made by the ABU's Council was the result of the\nConference on the Use of Space Communication in Broadcasting which was arranged\nby UNESCO in Paris last January and was attended by representatives of all\nthe broadcasting Unions and of broadcasting organisations in north America\nwhere there is no Union. All the organisations attending this Conference were\nconvinced that there is an urgent need for the new convention, because the\nexisting copyright conventions do not deal with satellite relays, and all firmly\nsupported the recommendation made to UNESCO by the Conference which was that the\nConference:\n\"recommends that an international convention be prepared and adopted, for\nthe protection of television transmissions carried by communications and\nbroadcast satellites, making the recording, rebroadcast and public use of\nsuch transmissions subject to the authorisation of the originating\ntelevision organisation and\nthat UNESCO urgently take the necessary steps for the preparation and\nadoption of such a convention, which the meeting considers to be within\nthe competence of UNESCO.\"\nVery briefly, the situation behind this recommendation is that satellite\ntransmissions cover a very large area and can be received in any country\nwithin this area which has the necessary equipment. Until a new copyright\nconvention is prepared and adopted, broadcasting organisations transmitting\na programme by satellite have no proper legal means of restricting the relay\nto the country or countries for which the programmes are intended. Normally\nthe transmitting organisation would pay the contributing artists, composers,\nwriters, etc. only for the rights for the use of the programme in the country\nor countries to which the relay is directed but, as there is at present no\ncopyright convention dealing with satellite relays, the transmitting organisa¬\ntion could find itself forced to pay for the rights for the programme to be\nused in all the countries covered by the satellite. This could mean that the\ncost of relays by satellite would be v-ry much higher than is necessary, and\nwould thus restrict the use of space communication for relaying television\nprogrammes.\nMoreover, there is at present nothing to prevent a broadcasting organisation\nfrom using a programme transmitted by satellite to which it is not entitled\nand for which it has not made any of the appropriate payments. Whilst it is\nhoped.that broadcasters would not \"take\" programmes from their colleagues in\nother countries in this way, there has already been at least one case where\nthis has happened."
}