{
  "id": "d770-72",
  "text": "- h -\nderive full benefit from distribution satellites. Such a convention\nwould not, incidentally, be contrary to the Home Convention, since Ar¬\nticle 22 of the latter expressly provides for international agreements\nwhich grant more extensive rights to any of the three parties covered\nby this Convention.\nII* For reasons which are not immediately apparent the UNESCO Ge¬\nneral Programme does not include, for the attention of the 1968 General\nConference, the text of the recommendation adopted by its January 1968\nmeeting of experts, but contains - in Chapter 5, Section 5.1., Part II,\n5§ 1685 and 1686 - much vaguer proposals merely providing for study,\nwithout specifying the urgency of the need for an international conven¬\ntion in the sense indicated above. Mere acceptance of this part of the\nprogramme by the General Conference would scarcely serve the interests\nof developing countries in the sphere of cultural broadcasting via sa¬\ntellite, and it is therefore vital that the General Conference should\nin this respect go beyond the programme submitted to it. To accomplish\nthis, however, the Director General of UNESCO must receive concrete go¬\nvernmental proposals not less than ten weeks before the Conference, and\na model proposal of this kind is the object of the present communication.\nIII. It is recalled that the recommendation unanimously adopted by\nthe UNESCO meeting of experts in January 1968 ran as follows:\n\"Recommends that an international convention be prepared and\nadopted, for the protection of television transmissions carried\nby communications and broadcast satellites, making the recording,\nrebroadcast and public use of such transmissions subject to the\nauthorization of the originating television organization and\nthat, UNESCO urgently take the neeess&ry steps for the preparation\nand adoption of such a convention, which the Meeting considers to\nbe within the competence of UNESCO.\"\nC?S/RT/MCB\n24.6.1968"
}