{
  "id": "d770-74",
  "text": "2\nfor the 1968 competitions were drawn from 16 countries in Europe, Asia, Africa\nand North and South America*\nAnnexure A (attached) lists the members of the juries; Annexure B lists\nthO programmes which received prizes and awards; Annexure C the comments of\nthe juries on these programmes with the addition of my own notes with relevant\ndetails about the programmes, indicating those which ABU members may be\ninterested to secure for use in their own TV services*\nI feel that this report would be incomplete without paying a tribute to the\norganisation of the Prix Jeunesse International.\nThe arrangements were primarily the responsibility of the Bayerischer Rundfunk\nin whose premises the competition was held and whose staff carried out much\nof the detail work. The Intendant (Director-General) of the Rundfunk\n(Mr Christian Wallenreiter), who is also the President of ARD, one of the\nABU*s associate members in Germany, took a keen interest in every aspect of\nthe competition and showed himself to be a gracious and dignified host.\nThe general planning and overall supervision of the competition and its many\nassociated functions, was in the hands of Mr Siegfried Magold, Secretary-\nGeneral of the Prix Jeunesse Foundation, and the credit for the outstanding\nsuccess of the Third Prix Jeunesse must, in a very large measure, go to him.\nEvery one of the more than 150 jurors, representatives of the participant\norganisations, guests, and observers could not help but be impressed by the\nhigh standard of efficiency displayed, not only in the split-second timing\nof the screening of the 116 films which had been entered or were demonstrated,\nbut in the many other administrative details associated with transport, with\ncatering, with travel bookings or with the social functions. The courtesy\nof the Prix Jeunesse staff who were in attendance for long hours - the\nscreenings started at 9.30 and on a number of occasions finished near\nmidnight - was sincerely appreciated by all who attended.\nCHARLES MOSES\nMembers who are interested in securing, for transmission purposes,\nany of the films referred to in the Annexures should get in touch\neither with the Director of Interpool, a company set up by the\nnational broadcasting organisations of Austria, Bavaria and\nSwitzerland, or directly with the broadcasting organisation\nwhich produced the film.\nInterpool is a television programme distribution company which\nis negotiating for the broadcasting rights of most of the films\nlisted in the Annexures, with a view to making them available,\nparticularly to developing countries, at a reasonable fee*\nCommunications to Interpool should be addressed to its Director\nwho is:\nMr Siegfried Magold\nc/- Bayerischer Rundfunk\nRundfunkplatz 1\n8 Munich 2\nGERMAN FEDERAL REPUBLIC."
}