{
  "id": "d770-78",
  "text": "ANNEXURE »C*\nJURIES * COMMENTS ON SELECTED PROGRAMMES\n(With Notes by Secretary-General)\n(a) Category I:\nHLucky bus” (Yleisradio TV, Finland)\nThis programme comprising 3 episodes, is most adequate to inform children\nin pre-school-age about the modern every day life.\nIts special merits can be seen in the discreet, well balanced utilization\nof the composition, in the rhythm of pictures, as well as in the choice of\nthe graphical technique and in the subtle introduction of the accoustical\nmeans.\nThe programme thus awakens the child*s interest and appeals to its\nimagination.\nThe simple story, the inventive humour and the likeable figures correspond\nin the most optical way to the imagination and the creative experience\nof the children.\nTo understand the world of the child to understand the world surrounding\nhim.\nNOTES\nAn outstanding programme for young children. Made in colour,\nThis animated cartoon would be very effective in black and white.\nThe three episodes run about 4 minutes. The commentary is in\nEnglish. Yleisradio provided a cardboard cut-out model of the\nprincipal character which could be easily made and animated by a child.\nThis programme is strongly recommended for children under 7 years.\n\"The Chimneysweep\" (Danish Radio and TV)\nThis programme is a successful attempt to transcribe a well known folksong\ninto picture in a graphical, clear, and modern way. The frequent\nrepetition of the refrain, and the easy to remember melody help the\nchild to grasp and to find its way into the course of this romantic and\ndramatic story.\nWhat is offered here is a delightful combination of tension, elements\nwith which children are familiar - games, story and reality.\nNOTES\nAn animated cartoon in black and white. Duration: approximately\n12 minutes. Musical background delightful. Could be used for\nchildren in the 7-12 year group as well as for younger ones.\nEnglish sound-track.\n\"The Little Bird and the Cloud*1 (Swiss Radio and TV)\nImpressing in this programme are the gentle poetic way of the narration,\nthe careful making and the consequent keeping up of the simple technique of\nthe movement.\nEnriching is also the clear information on how to effect movement in the\npicture in the most simple way."
}