{
  "id": "d770-8",
  "text": "- 2 -\nP/20\nQuestion 2\nWhat type of items are most useful? (e.g. general, specific, practical\ndemonstrations etc.)\nABC_£_ \"Practical, well filmed and scripted items, together with films\nof general interest.\"\nNHK:\nPresh and original items that may be used in our programmes to\nintroduce rural topics abroad.\"\nComment: \"Contributions which we wish to receive and which we\ncould use in our farm broadcasts would be those depict¬\ning some aspect of the life of the farmers or fisher¬\nmen of the originating country. There are some\ncontributions which met our requirement in this regard,\nbut we find there is a lack of background information\nin the texts of the contributions concerned. We feel\nthat most texts are merely a translation of the text\nused for the domestic broadcasts of the originating\norganisation and they do not contain enough information\nto explain to our audience the contents of the films\nsupplied.\"\n: \"Specific items about techniques that can be applied in New\nZealand minus the commercial implications.\"\nRTHj_ \"(a) Practical demonstrations; (b) specific; (c) general.\"\nUARTQ: \"Practical demonstrations.\"\nSummary:\nPractical demonstrations are strongly favoured, although there is some\nindication that they must have relevance for the recipient country.\nQuestion 5\nPlease list broad subjects of interest (e.g. farm management, dairy\nfarming, soil conservation etc.)\nABC:\nNHK:\nNZBC:\n\"The whole range of farming, management and agricultural science,\nas long as it is modem and applicable to Australian conditions.\n\"Items that may be used in introducing to our TV audience the\nfanning conditions overseas (e.g. current state of pioduction\nand distribution of farm products), the rural life abroad\n(e.g. functions and recreations). Various systematic\nactivities (e.g. 4-H Club, movements for improvements in farming\nand m farmers’ life.)\nComment: \"For the reasons mentioned above, we have found it\nimpossible to use any of the contributions we have\nreceived during the past 6 months.\"\n\"Breeds and breeding techniques, stock management, feed\nconservation, horticulture, artificial fertilisers.\""
}