{
  "id": "d770-81",
  "text": "4-\nNOTES\nA good example of the effective integration of an orphaned child\nfrom an Asian country into the normal life of a European family*\nAn English commentary is available but the dialogue is in French*\nBlack and white. Duration: 23 minutes*\n(c) Category III:\n.\"A New Start” (Norwegian Broadcasting Service)\nThis film shows the fate of a young man who sustains severe physical\ninjury through an accident. By mobilizing and intensifying his will to\nlive, he succeeds not only in transforming his physical incapacities but\nalso in building a full and successful life.\nBy the discreet manner of presentation and by refraining from capitalizing\non the drama of the story, ”A New Start” shows that people may be able,\n.even in extreme situations, to succeed with the help of their environment\nand themselves if the former does not remain fixed in false sympathy but\nactively supports him in his effort.\nNOTES\nThis programme provides a wonderful lesson for parents as well\nas young people, including Category IV as well as Category III.\nWell worthwhile. Narrative in English. Black and white.\nDuration: 30 minutes.\n”Batik” (Hungarian Radio and TV)\nThe film shows that young spectators also may learn the technique of\nbatik-making with simple means.\nThe presentation of the artistic technique and the factual information\nabout the production of batik result in an impressive programmeson the\nimportance of a popular art.\nThe portrait of the young artist and her explanations of her work may\nalso induce the audience towards creative activity*\nNOTES\n\"Batik\" would be equally suitable for Category IV or adults\ninterested in-trying their hand at batik work. Black and white.\nDuration: 18 minutes. Unexciting but quite good* The explanatory\nremarks in English are adequate.\n\"Do Not Adjust Your Set” (i.T.V., United Kingdom)\nIn this programme specifically intended for young people, young performers\nsucceed in producing an entertainment programme whose formal quality matches\nthe wealth of pointed, witty and unexpected ideas.\nAlthough aimed at the age group 12-15» this intellectual and at the same\ntime unpretentious presentation also appeals to adults.\nPerformers and audience are joined in carefree joie de vivre*"
}