{
  "id": "d770-84",
  "text": "{\n( ASIAN BROADCASTING UNION (A.B.U.)\nYOSHINORI MAEDA\nPRESIDENT\n1 May 1968\nDear Mr. Harley,\nYou will know that at the Fourth General Assembly of the ABU held in\nSingapore last October, All India Radio generously offered to act as host\nfor the Fifth General Assembly of our Union and that this offer was warm¬\nly accepted by our members.\nIt now gives me great pleasure, as President of the ABU and in terms of\nClause 1 of Article 9 of the ABU Statutes, to convene the Fifth General\nAssembly of the ABU in New Delhi to be held within the period 13 to 23\nNovember, 1968.\nI should explain that the General Assembly itself will not occupy the whole\nof the period I have just mentioned but there are other activities, such as\nthe judging of the ABU Prize, for which allowance has to be made in the\ntotal period. At this moment there are problems about stating specifically\nthe details of the arrangements within the period 13 to 23 November but we\nexpect to be able to send a detailed schedule for this period to all ABU mem¬\nbers by the beginning of June. In the meantime, I hope that the information\nI have given will be helpful to our members in planning their own activities\nfor the latter part of this year.\nAs members will be aware, it is one of my responsibilities as President,\nof the ABU to issue the agenda for our General Assemblies. The ABU\nStatutes require that the agenda should reach members eight weeks before\neach General Assembly and this means that we must all begin to give thought\nto it a long time before the meeting. I am anxious that all our members\nshould have the opportunity of putting forward proposals, for consideration\nat the General Assembly, about activities which would be valuable for the\nABU to undertake and I am therefore attaching a schedule showing the arrange¬\nments that will need to be observed in the preparation of the agenda for the\nFifth General Assembly. I am sending several copies of this schedule to you,\nso that they may be made available to the heads of those sections of your\nstaff which may be concerned with the preparation of agenda items or reports\nfor discussion at the meeting."
}