{
  "id": "d770-93",
  "text": "delegates at General Assemblies made a change in the arrangements necessary.\nMoreover, the present structure of these meetings was adopted before the establish¬\nment of the Council and, in existing circumstances, it is difficult for the\nCouncil to carry out certain of the functions required of it by the Statutes.\nThe Council give much thought to this matter at its meeting in Seoul and\nfinally decided to adopt a recommendation made by the Secretary-General which\nwill result in a change in the order in which meetings are held but without\nincreasing the total time that has been devoted to activities associated with\nthe General Assembly in the past. Under the new arrangements, which are to\nbe adopted for the 1968 General Assembly, the meetings will be held in the\nfollowing order:\nProgramme and Engineering Committee Meetings\nMeeting of the Administrative Council (at the same time\nthe judging of the ABU Prize would be in progress)\nGeneral Assembly (about 4 days)\nFull details about the new arrangements will be sent to all ABU members in the\nnear future. The Council believes that they will be convenient for all\nmembers, will increase the efficiency of the meetings, will impose a lesser\nburden of work for the host organisation and the ABU's staff, and may result in\nsavings for individual members.\nFifth General Assembly: Special Topic\nAfter considering various possible subjects, the Council decided that the\nspecial topic for the 1968 General Assembly should be:\nEducational Broadcasting with special reference\nto Literacy and Basic Education\nThis is an important area of activity for many ABU members but it is one to\nwhich the Union has not yet had the opportunity of giving special attention.\nIt is proposed that, as in previous years, expert speakers from ABU members\nand other appropriate organisations should be invited to lead discussions and\nthe Council has authorised the Secretary-General to make the necessary detailed\narrangements.\nFurther information about this matter will be sent to members as soon as\npossible.\nThe Council also reviewed estimates of the Union's financial position as at the\nend of 1967/68 and approved an interim budget for 1968/69. It was necessary that\nan interim budget for the next financial year should be considered, so that the\nSecretariat can continue its work between 1 July 1968 and the next General Assembly.\nThis interim budget will be reviewed by the Council at its meeting in November\nand then submitted to the 1968 General Assembly for approval.\nFinally, the Council discussed the locations for future ABU meetings and was\npleased to agree that it would recommend to the 1968 General Assembly that it should\naccept the offer of the New Zealand Broadcasting Corporation to act as host for\nthe General Assembly to be held in 1969.\n6"
}