{
  "id": "d57-10",
  "text": "SENIOR ASSOCIATES lee schooler roger d. Isaacs Stanley a. frankel alice Alexander bruce beck Herbert brin anne donley richard elfenbein Joseph a. folzer marjorie fullmer\nLYLE D. QlrMM ' p'M. HOAG BARBARA HUMPHREY WILLIAM jrjOHNSTON BERNARD MEREMS CORA A. MITCHELL HARRY MOLTER ALFRED E. PARTRIDGE VICTOR PERRY ELLA Q. ROLLER FRED J. SEIDNER JUDITH SHOTZ\nPETER E. 8IEQLE BETTY J. STEARNS LYN TALMAGE IRWIN K.TEVEN PERRY WOLFF BURT ZOLLO TWX: CG 2390 CABLE! PUBREBOARD, CHICAGO\nTHE PUBLIC RELATIONS BOARD\n• WASHINGTON • HOLLYWOOD\n75 EAST WACKER DRIVE • CHICAGO 1, ILLINOIS • RANDOLPH 6-2891\nNovember 26, 1957\nNational Association of Educational Broadcasters\nlij. Gregory Hall\nUniversity of Illinois\nChampaign, Illinois\nGentlemen:\nThe enclosed tape recording is one of a series\nof twenty two, ten-minute radio tapes.\nThis tape and the others were produced jointly\nby Purdue University and Visking Company, Division\nof Union Carbide Corporation, as a public, service\nprogram.\nOn behalf of Visking and Purdue, as public rela¬\ntions counsel for Visking, we would like to offer all\nor part of the series free to radio stations for\ntheir public service programming.\nAll of the tapes are of the interview type.\nSpecifically, program moderator Clyde Kracht of Visking\nconducts interviews on location with professors and\nspecialists in all fields at Purdue University.\nThe entire series already has been broadcast here\nin Chicago on WJJD. At present the new series of fif¬\nteen minute interviews with Purdue people and guests\nto the campus is running on the same station. We also\nexpect to offer this series for distribution as soon\nas the first thirteen have been completed.\nI understand that your organization reproduces\nand distributes tape recordings of a public service\nnature. I would appreciate your auditioning this tape,\nand receiving your comments or suggestions as to\nwhether you feel this series could be distributed by\nyour organization and what costs would be involved.\nSincerely y^urs.\nPJS:vh\nr."
}