{
  "id": "d57-103",
  "text": "a\n- 3: -\nAtomwaffen abgeschafft warden - konnen nicht davon abhl^ngig gemacht\nwerden, dass der Himmel sich das unmogliche politische Wunder ereignen\nlasst, dass keine der drei AtommMchte mehr etwas an dem flir erforder-\nlich gehaltenen Abrtistungsabkommen auszusetzen hat,\nTatsSchlich ist es so, dass die Versuchsexplosionen und\ndie Verwendung von Atomwaffen den absolut zwingenden Grund, nicht\nwaiter statthaben zu dtlrfen, in sich selber tragen. Zuvor zu er-\nfUllende Bedingungen konnen nicht in Betracht komraen.\nBeide bedeuten ja die denkbar schlimmste Verietzung der\nVolkerrechte: Die Versuchsexplosionen dadurch, dass sie schon in\nFriedenszeiten auch ausserhalb des Gebietes der ntommachte Gesund-\nheit und Leben von Menschen gefMhrden,der mit ritomwaffen geflihrte\nKrieg dadurch, dass er noch viel mehr gegen das Volkerrecht verstosst,\nindem er durch von ihm verursachte hochgesteigerte RadioaktivitHt ,,\ndas Land unbeteiligter Vdlker unbewohnbar macht, und weil er das un-\nvorstellbare Sinnlose und Grausige is^t^ das. die Weiterexistenz der\nMenschheit in Frage stellt, Darum darf er in keiner Weise Wirklichkeit\nwerden.\nDie drei AtommSchte sind es also sich und der Menschheit\nschuldig, dass sie ohne vorerst Uber zu stellende Bedingungen zu ver-\nhandeln, sich zu diesem absolut notwendigen Versicht entschliessen.\nDie Verhandlungen fiber ein rechtes /ibrllstungsabkommen sind\nalso nicht die Voraussetzung diesesVeraichtes, sondern seine Folge,\nSie gehen davon aus, dass er Tatsache geworden ist, und setzen sich\nals Ziel, die neue Situation, in der sich die drei AtommSchte und die\nmit ihnen in Verbindung stehenden Volker nunmehr miteinander befinden,\nin der erforderlichen Weise auszugestalten und bestmogliche Garantien\ndafUr zu schaffen, dass nun nicht eine Bedrohung durch nichtatomare\nWaffen an Stelle der vorherigen trete.\nAlles was die Diplomaten an Sachlichem geleistet haben, urn\ndie Verhandlungen gut vorzubereiten, behSlt seine Bedeutung, auch wenn\ndiese nicht vor dem Verzicht sondern erst nach ihm und auf Grund des-\nselben stattfinden.\nXXX\nKommt es zur Abschaffung der Atomwaffen, so hat schon\nallein hierdurch, ohne das Zutun irgendwelcher Verhandlungen, eine\nweitgehende Gesundung der politischen Lage stattgefunden. Sie har ihren\nGrund darin, dass mit diesem Verzicht die Distanz, und mit ihr, die"
}