{
  "id": "d57-105",
  "text": "Die Verhandlungen der drei ..tommachte uber das Abrtistungs-\nabkommen haben es mit den Garantien zu tun, die der Western und der\nOsten sich gegenseitig zu geben haben, urn die tatsfichliche, vdllige\nund dauernde Abschaffung von .'.tomwaffen sicher \\zu stellen, Dabei werden\nsie auch die Moglichkeit auszudbend'er Kontrolle vorsehen wollen.\nGegenseitig werden sie sich Rechte zuzugestehen haben, internationalen\nOder von ihnen gemeinsam eingesetzten KommiEBionen zu erlauben, auf\nihrem Boden Nachforschungen anzustellen. Man redet auch davon, dass\nFlugzeugen einer internationalen Polizei das Recht zugestanden werden\nsoil, tiber fremdem Boden in mittlere und hdchster Kobe spionierend\nzu* kreisen.\nBis zu welchem Qrade kann ein Staat, ohne sich etwas zu\nvergeben, solches Uberwachtwerden auf und Uber seinem Boden ertragen ?\nZu befUrchten sind auch Uble ZwischenfUlle, die sich dabei ereignen\nkonnten. Wie steht es auch urn die .'.llmacht, die einer internationalen\nKontrolle zugetraut werden soil ?\n..uch die weitgehenste internationale Kontrolle verraag nicht,\ndie GewShr zu geben, dass Uberall und in allem ein Ubereinkommen ein-\ngehalten wird, Letzten Endes sind der Osten und der Westen jeder\ndarauf angewiesen,die VertrauenswUrdigkeit des anderen einigermassen\nvorauszusetzen.\nDasselbe gilt noch in einer anderen i.ngelegenheit. Durch\nden Verzicht auf Atomwaffen wird die militSrische Macht der Sowjet-\nunion, was das europUische Gebiet angeht, weniger betroffen als die\nAmerikas, Es verbleibt ihm diejenige, die ihm die vielen, mit vor-\nzUglichen gewohnlichen Waffen ausgerUsteten Divisionen sieiner Land-\narmee verleihen. Es konnte mit ihnen die Natostaaten in Europa,\ninsbesondere Westdeutschland, Uberrennen, ohne dass ihm jemand mit\neiniger Aussicht auf Erfolg zur HUlfe kommen konnte. Angesicht der\nGefahr, die diese Storung des Gleichgewichts mit sich bringt, mUsste\ndie Sowjetunion im /.brUstuKcgsabkommen darauf eingehen, ihre Armee zu\nve: ringern, und sich verpflichten, nichts gegen Deutschland zu unter-\nnehmen. le wSre die Innehaltung dieser Verpflichtung in wirklich\nxvirksamer 'Jeise zu l!fberwachen und zu garantieren ?\nJ.uch hier gait also, dass mit einem bis in alle Einzel-\nheiten ausgeti^ftelten und sozusagen international garantierten ^.b-\nrUstungsabkommen nicht alles getan ist, sondern dass die Partner\ndarauf angewiesen sind, sich Vertrauen entgegenzubringen."
}