{
  "id": "d57-106",
  "text": "Wir leben aber in einer Zeit, in der die Vertrauenswtirdig-\nkeit von Volkern mehr als je bezweifelt wird, ilusserungen, in denen\nsie sich fort und fort gegenseitig die Vertrauenswtirdigkeit ab-\nsprechen, sind in unserer Zeit wie abgegriffene Mdnzen im Umlauf,\nSie sind in dem begrtindet, was die Volker vom ersten Kriege an, an\nUnehrlichkeit, Ungerechtigkeit..und Unmenschlichkeit miteinander er-\nlebt und voreinander erlitten haben, Wie soil es da zugehen, dass\nwieder eines Vertrauen in das andere setzen konne ?\nUnd doch muss es dazu kommen,\nWir kdnnen in diesem uns ISlhm^.nden ilis.strauen nicht waiter\nverharren^ Wollen wir uns aus der trostlosen Lage, in der wir uns be-\nfinden, herausarbeiten, muss ein anderer Geist in den Menschen und in\nden Volkern entstehen, ..ufkommen kann er nur, wenn die von uns er-\nlebte Notwendigkeit seines Kommens uns die Kraft gibt, an ihn zu\nglauben. Dieses Erleben dttrfen wir auch bei den ..ngehdrigen der Volker\nvoraussetzen, die mit uns die furchtbaren Ereignisse dufchgemacht haben.\nWir begegnen ihnen in der Besinnung darauf, dass wir miteinander\nMenschen sind und als solche uns beffihigt erachten mtlssen, mitein¬\nander in derselben Weise zu ftihlen, zu denken, zu wollen.\nDas Bewusstsein, dass wir miteinander Menschen sind, ist uns\nin Kriegen und Politik abhanden gekommen, Wir kamen dazu, mitein¬\nander nur noch als Angehorige verbUndeter oder gegnerischer Volker\nzu verkehren, und in den sich daraus ergebenden Ansichten, Vorur-\nteilen, Zuneigungen und Abneigungen gefangen zu bleiben. Nun heisst\nes Wiederentdecken, dass wir mit-einander auch Menschen sind und uns zu\nbemtihen haben, uns gegenseitig zuzugestehen, was in dem Wesen des\nMenschen als moralische FShigkeit vorhanden ist. So kdnnen wir uns\nzu dem Glauben erheben, dass auch in Angehdrigen anderer Volker das\nBedtirfnis eines neuen Geistes wach warden wird, wodurch wir beginnen\nwerden, ftir einander wieder vertrauenswtlrdig zu sein.\nDer Geist ist eine gewaltige Macht der llmgestaltung der\nDinge. Wir haben ihn als Geist des Bdsen am Werke gesehen, der das\nUnglaubliche vermochte, uns aus dem Zustande des Bemtihens urn geistige\nKultur in das Barbarentum zurtickzuwerf en. Nun wollen wir . unsere\nHoffnung auf dasselbe Vermogen des Geistes setzen, die Menschen und\ndie Volker wieder zu Kulturgesinnung gelangen zu lassen."
}