{
  "id": "d57-108",
  "text": "In\nwir uns schatzen, dass nicht irgendwo draussen in der Welt schon\nwelche in ihren Besitz gekommen sind.\nIn fortgesetzter Beschaftigung mit dem Problem der Ib-\nrtlstung wird man es mit der Fr.'^ge zu tun bekommen, wie weit mxan in\nder V/elt, wie sie zur Zeit ist, im Verzicht auf VJaffen Uberhaupt\ngehen kann und gehen soil. x*uch durch die vervollkommnesten ge-\nwohnlichen Waffen kdnnen, wie es sich in den beiden Weltkriegen ge-\nzeigt hat, schon Uberaus grauenhafte Verheerungen angerichtet werden.\nIhr Vermogen solches zu vollbringen, hat nunmehr noch dadurch zuge-\nnommen, dass mfichtige, gewohnliche Geschosse durch Raketen auch fer-\nnen Zielen entsandt werden kdnnen,\nEs ware zu wttnschen, dass man sich jetzt schon dartiber\neiningen kdnnte, auf das Vernichten in solchen Fernen, wie auch auf\ndas aus der Luft betriebene, zu ver.'zichten,\nDem Fortschritt, dass wir den Krieg zu einem Duell mit\nvorgeschriebenen Waffen zu machen unternehmen, wird immer etwas\nUnnatUrliches anhaften. Das Ziel, auf das von jetzt bis in alle Zu-\nkunft der Blick gerichtet bleiben muss, ist, dass die Entscheidung\nin Volker entzweienden Fragen nicht mehr Kriegen tiberlassen bleibt,\nsondern . eine friedliche Ldsung finden muss,\nKur durch einen uns noch unvorstellbaren allgemeinen\ngeistigen Fortschritt aller Volker der Menschheit kann es einmal\ndazu kommen, besonders da fttr die Zukunft fiberaus schwere Fragen\nzu erwarten sind. Die Schwerste wird die des Rechtes auf n^hrendem\nfremdem Boden sein, wie sie die fortschreitende Ubervolkerung marcher\nLender mit sich bringen wird.\nV/enn unsere Zeit auf Rtomwaffen veraichtet, tut sie den\nersten Schritt auf dem Wege zum fernen Ziele des xvufhorens der Kriege\nhin. Tut sie ihn nicht, so verbleiben wir auf dem, der zum Itomkrieg\nund zum Elend ftihrt. Dessen mtissen sich die, die auf hochster Ebene\nmiteinander zusammen kommen, voliig bewusst sein, urn die Verhandlungen\nmit der rechten Sachlichkeit, in dem rechten Ernst, in dem rechten\nGeiste, und in dem rechten Verantwortlichkeitsbewusstsein zu ftihren.\nLambarene 14- 3* 1958\nAlbert Schweitzer (s)"
}