{
  "id": "d57-110",
  "text": "HEADQUARTERS UNITED STATES ARMY INFANTRY CENTER\nFort Benning, Georgia\nl3iformation Section\nDr* Harry J. Skornia\nExecutive Director\nNational Assn, of Educational Broadcasters\nII4. Gregory Plall\nUrbana, Illinois\nNAEB HEADQUARTERS\nAPR 2C 1258\n?l9l?|ip,ll,12,l,2|8)4|8i?.\nL\nDear Dr. Skomia;\nAlthough currently a member of the United States Army, I became\nfamiliar and very icpressed by the NAEB tape network while a student at\nthe State University of Iowa and a member of the staff of WSUI there.\nNow, as chief of the Radio Unit, Information Section, Fort Benning, Georgia,\nI am wondering about the possibi3-ity of placing a program series produced\nby this office on the NAEB net.\nI fuHy realize that the shows carried by your operation are almost\nentirely educational in nature. However, although very definately an Army\nshow, we feel that our series, entitled \"Queen of Battle\" also falls into\nthis catagoiy. Unlike most military produced programs, \"Queen of Battle\"\nis in now way a recruiting show. No mention whatsoever is made of\nrecruiting or even of the “advantages\" of being a member of the military.\nRather, our series is designed purely as an educational medim, and is\nused solely to keep non-military people informed on developments and\nmodernization in the Array, Nearly all of the shows consist of a series of\nskits and field recordings. All of the shows are a dramatized docuementaiy\nin one form or another. We feel that \"Queen of Battle” very definately\nfalls in the educational programming classification.\nMany of the shows, too, are ones that we believe would be of parti¬\ncular interest to the college age audience. There is one program, for\nexair55le, that deals specifically with the Reserve Officer Training Corps\nsummer camp training; something I know from personal experience is of •\ninterest to a large number of college students.\nAlready carried by a large number of stations across the country, we\nfeel our programs are of high technical quality. They are timed on a 14:30\nbasas for use by stations under normal broadcast conditions."
}