{
  "id": "d57-112",
  "text": "Infonsation S3ctdo9:i\n21 April 1958\nOr* Harry ^ornia\nSsBOCutlYe Director\nnational Asan« o£ Mucati(»)al Broadcasters\nHi Qregory Hall\nUzt)ana, Illinois\nDear Dr. Skomiai\nAlthough currently a noraber of the United States Aray, I becane\nfamiliar and very iiiqpressed Iqr the NAEB tape netwoi^ while a student at\nthe State University of Iowa and a member of the staff of W3UI there.\nNow, as chief of the Radio Unit, Information Section, Fort Banning, Georgia,\n1 am wondering about the possibility of placing a program series produced\nby this office on the HABB net.\nI fully realise that the shows oarried by your operation are almost\nentirely educational in nature. However, although very definately an kray\nshow, we feel that our series, entitled “Queen of Battle* also falls into\nthis catagoiy. Unlike meat military produced prograam, “Queen of Battle*\nis in now way a recruiting show. No mention whatsoever is made of\nrecruiting or even of the “advantages* of being a member of the militaiy*\nRather, our series is designed purely as an educational mediimi, and is\n\\ised solely to keep non-military peqple informed on dovelq^aaents and\nBoderxiiaation in the Army. Nearly all of the sliows consist of a series of\nskits and field recordings. AH of the shows are a dramatised docuementary\nin one form or another. We feel that “Queen of Battle* very definately\nfalls in the educational programming claasificatiQn*\nMany of the shows, too, are ones that we believe would be of parti*\ncular interest to the college age audience. There is one program, for\nexanple, that deals specifically with the Reserve Officer Training Oozps\nsummer omap training| something I know from personal eoqperience is of\ninterest to a large number of college students.\nAlready carried by a large number of stations across the country, w\nfeel our programs are of high technical quality. They are timed on a liiBO\nbasus for use by stations under normal broadcast conditions."
}