{
  "id": "d57-128",
  "text": "2092 Mound Street\nHolljrvcod 23\nCalifornla\n9 April 1953\niiiTTv Navbum >. s\nrht Prtaaldent\niidu.national lalevision aivl Radio Contjur * *\n2320 Uasttterjiw Aveooa •\nAnn Arbor\nb!l3higan\nDear Mr, I^evbum -\nI ttjT* ’lost Intorsstod in acquiring Information on the production 3f\nlaatfjrlrils for educational radio and teleYision* John K, Weiss of the Ford\n?oundax.iia 3U.jgestai I get in touch with 70c.\nIn .nay time away fro» NBC, where I am the assistant manager of the\nGuest Pnlat'-ons department, I have begun working with a group of actors,\n’writers an^I r.usiciana - most of thsR, like me, invclved in network bro d-\nc.asting or coEiierclal recording - preoe*rlng audition tapes of some seri-as\nwhi Th we hope will be of uae when (if) the Pacifica Fou^atlon’s PM station\ncomes on the air in Southern California this smsaer. It occurred to us that\nsuch program material might be of Interest to the stations associated with\ntiie Cmter and the KABB« •\nOur experimental formats have so far been limited to dramatizations\nand readings of daglish and American literatiire and history, aimed at a\ngeneral audience rather than a purely scholastlo one. It Is our hope to\ndevelop a dramatic progranning comparable in soope aind appeal to musical\nbroadcasts already available on PM radio#\nNBC rsdio network activity in Hollywood has been considerably ouiw\nUtlled in Ui# last y«ai', beam that lifnie.. aa\nas the time of broadcast engineers would be put at our disposal without cost\nif we were preparing material for recognized educational (T-itlets. I have\nthl- €w:suranoe froBi our broaaoaat facilities administration in Hollywood\ntnough, of co'jTse, final arrangements ’would have to be approved in liev York\na? well as ha;*e*\nI have been wl’th NBC for two years and have became very interested in\nthG development of educational broadcasting at the network azid elsewhere.\n’»^l6 I was a student Oxford (Rhodes Scholar from California, 1952) I had\nopoortunity to appreciate the prograinnlng of the BBC Third Program, ’ban I\nreturned to the United States - first to Yale, where I was the VE. 111am\n;-lorrls Fellow in Play-writing, and then to California and NBC - I was struck\nby the nesd for the sort of progrema which I had enjoyed on the BBC and Radio"
}