{
  "id": "d57-132",
  "text": "UNITED NATIONS PLAZA AT ASTH STREET\nNEW YORK 17, NEW YORK\nCABLE ADDRESS INTERFAX\nRECEIVED\nCARNEGIE ENDOWMBlVRE/affl^/^^^JNATIONAE PEACE\nV 1958\nPH\n?l?l»|iPlM|12|ll2i8i4i6i?\n5 May 1958\nDear Mr. Skornla:\nThe Carnegie Endowment for International Peace has recently\npublished a book, Britain and the United Nations . This book is part of a\nseries of national studies on international organization designed to clarify\nthe policies and attitudes of key nations toward the UN. (See attached leaflet)\nThe series is sponsored by the Carnegie Endowment assisted by a grant from\nthe Ford Foundation.\nIt was our thought that an interesting half hour radio program con¬\nsisting of an informal discussion of the issues raised by the book might be\nof real educational value. In thinking of the most suitable outlets. Dr.\nRobert Hudson with whom I spoke Friday, mentioned the NAEB network\nas the logical choice. We agree with this opinion. Our plan was to have\nthe program take the form of a panel with three participants and a moderator.\nTo give you an idea of the contents, I am enclosing a copy of the con¬\ncluding chapter of the book. I think you can easily see from glancing at it\nthat the topics covered are of more interest than the title might indicate. We\nhave not approached any specific panelists as yet, but we have in mind persons\nof the calibre of Eric Britter of the London Times , Denis Brogan, Sir Pierson\nDixon, Joseph E. Johnson, Allan Nevins, Brian Ashford Russell of the United\nKingdom delegation, William Stringer, former London correspondent of the\nChristian Science Monitor and Arnold Toynbee. We have some assurance of\nthe cooperation of the English Speaking Union in approaching these people.\nAmong the topics that might be discussed are: (1) British and American\npublic opinion compared and contrasted with regard to the UN; (2) The United\nNations and anti-colonialism; (3) the merits of private negotiations favored by\nthe British as against the U.S. exponents of open diplomacy; (4) British and\nAmerican views concerning Communist China. All of these topics are discussed\nin the book which I would be glad to send if you wish to see it.\nWe realize that you cannot commit yourself to distributing a program\nbefore you have judged its value, but assuming that we were able to meet your"
}