{
  "id": "d57-15",
  "text": "SPEAKERS AT THE TENTH ANNUAL BARNARD FORUM — 2\nPresident White, who will speak on the future of the independent college, has\nbeen president of Mills College since 1943. The author of \"Educating Our Daughters:\nA Challenge to the Colleges,\" Dr. White has viewed higher'^education from the vantage\npoint of both an administrator and a faculty member. A Renaissance and Medieval\nscholar, he has served on the faculties of Stanford University and Princeton\nUniversity. A graduate of Harvard University, the Union Theological Seminary, and\nStanford, Dr. White is a former president of the Western College Association. In ...\n1956 he was elected a Fellow in the American Academy of Arte and Sciences and this\nmonth he was appointed to the board of editors of The American Historical Review\nfor a five-year term.\nThe publicly-supported university will be represented by Dr. Jones, a past\npresident of the Association of Land-Grant Colleges and Universities. Before\nassuming his post at Rutgers in 1951, Or. Jones was president of the University of\nArkansas. From 1941 to 1947 he served as president of Bennington College, where he\nhad been a charter member of the faculty. Dr. Jones is currently serving as a\nmember of the American Council on Education's Committee on Relationships of Higher\nEducation, which deals with the relations of the branches of the Federal Government\nto colleges and universities. He has served on numerous government boards and\ncommissions, including the President's Water Resources Policy Commission, the\nNational War Labor Board, and President Truman's Commission on Higher Education.\nHe served last year as a consultant to the Special COomittee of the United States\nSenate on Foreign Aid to the Countries of South Asia.\nMetropolitan alumnae groups of the following colleges and universities are\nsponsoring the Forum: Agnes Scott College, Barnard College, Bennington College,\nBryn Mawr College, Cedar Crest College, Chatham College, College of Mount Saint\nVincent, College of New Rochelle, College of St. Elizabeth, College of St. Rose,\nConnecticut College, Douglass College, Elmira College, Fordham University, Good\nCounsel College, Goucher College, Hollins College, Hood College, Hunter College,\nKeuka College, Manhattanville College of the Sacred Heart, Marymount College\n(Maiibattan>^ Marymount College (Tarrytown)\n-more-"
}