{
  "id": "d57-17",
  "text": "I\n^ Public Relations Office\nBarnard College\n606 West 120 Street\nNew York 27, New York\nMonument 2-8992\nSpeech on \"What’s Ahead For Independent Colleges\nAnd Universities?\" to be given by President\nLynn White, jr. of Mills College, California, at\nthe Tenth Annual Barnard Forum on Saturday,\nFebruary 8, 1958 at 2:00 p.m*. Grand Ballroom,\nWaldorf-Astoria Hotel#\nPublic excitement over the prospects for higher education in this country has\nrisen to such a point that in recent months a number of \"tranquilizer\" addresses\nhave been proffered us, designed to calm the fears of parents that their offspring\nmay not get into Alma Mater, or that in the mad rush to the colleges, rigorous\nacademic education -- or is it just the ivy? -- is going to be trampled to a pulp#\nWe have been told that since American higher education has in fact expanded about\nten-fold in the last five decades, there is no cause for alarm in the certainty that\nit is going to double or perhaps even treble during the next dozen or fifteen years#\nThe chief difference now, it is said, is that our statistical services are so much\nbetter than ever before that whereas the past blundered blindly into unexpected\nexpansion, we can see, to some extent, what is coming and can plan intelligently for\nit#\nI agree: the statistics do give us a great advantage# But they do not console\nme as 1 contemplate the problems of the independent college or university during the\nnext couple of decades.\nFor nearly twenty years, now, we Americans have been producing children at a\nrapid pace, and there is no present evidence that this is going to decline# The\nintellectually qualified children are already born who in waxing armies are going to\ndemand a college education, and they continue to arrive in fantastic numbers#\nMoreover, these same two decades have seen our technology pass into a new phase which\nmakes education beyond the high school as important as education beyond grade school"
}