{
  "id": "d57-22",
  "text": "President Lynn White, jr,, Barnard Forum, 2/8/58 — 6\nbefore, and having children quickly* One result is that these children are arriving\nat college age before the father's earning-pover has reached its maximum* Moreover,\nthanks to overmuch reading of child psychology, babies are now being deliberately\nbunched, like asparagus. In the 1890's one of Mrs* White's proper Bostonian\nrelatives wrote of a cousin: \"Is it not a fearful thing that she has two living\nchildren under the age of eighteen months?\" Victorian families, of the sort which\nwere interested in education, carefully spaced their children* Mrs. White and I\nproduced three living children under the age of fifteen months (I should explain\nthat two were twins), and while there were moments when we did Indeed consider it a\nf?.afful thing, we could find solace in the thought that we were in the pattern of\nour time*\nThe chronological result of all this is inevitable: these bunched children --\nthree, four or five of them — will be in college, and in graduate and professional\nstudy, simultaneously. Not only will papa normally be unable to foot the bills in\nan independent institution: little aid can be expected from grandparents. In earlier\nand less pasteurized generations, grandparents were often dead when grandchildren\nreached college age, and some inheritance was available for education* Today\ngrandfather and grandmother have a far greater life expectancy and are, moreover,\nrelatiweljr younger because of the tendency to early marriage* Moreover,\ngrandparents are decreasingly able to subsidize the education of grandchildren*\nWhereas once one saved money for old age, now one accumulates pension rights and\nannuities the capital basis of which cannot be touched* We must conclude that while\nin so vast and complex a land as ours there will be a large and perhaps sufficient\nclientele for independent colleges, every demographic change now taking place tends\nto deduce the size of the market available to such institutions.\nAnd why should one pay fabulous fees to go to an independent college or\nuniversity? It has been taken for granted, particularly in the Northeastern states."
}