{
  "id": "d57-23",
  "text": "President Lynn White, jr., Barnard Forum, 2/8/58 -- 7\nthat these harbor the academic aristocracy, that they make available a considerably\nsuperior brand o£ education as compared with low-tuition, tax-supported campuses.\nBeing professionally an historian, and having watched the tendencies within my\nown discipline for nearly thirty years, I have increasingly questioned this\nassumption. But how does one measure academic quality? It occurred to me that 1\nmight get some pointer-readings by examining the American Historical Review at\ndifferent dates. This Review has by far the widest circulation of any historical\njournal in the nation, and its articles are carefully selected. The focus, however,\nis less on articles then on the relriew of publications in the entire range of history.\nWhen a scholar is invited to review a book in the American Historical ^Review, this\nmeans that in the editor's opinion, he is the leading American authority on that\nparticular subject. The location of the contributors to the American Historical\nReview should therefore be a fairly accurate index to the location of academic\nquality in the field of history. And the study of history is so intertwined'with\nother kinds of scholarship that the academic quality of an institution's history\ndepartment is probably not a bad indication of the general intellectual level of\nthe campus.\nIt was not until April 1930 that the American Historical Review began to attach\nacademic affiliations to the names of its contributors. Prior to that time the\nhistorical profession in this country had been so largely concentrated in the\ninstitutions of the Eastern Seaboard that, as in the case of a British weekend party,\nthere were no introductions: you simply knew who people were. Volume 36, spanning\nSeptember 1930 through July 1931, is therefore the first complete volume to give\nidentifications. This I compared with Volume 62, spanning September 1956 through\nJuly 1957. It became clear that great changes had taken place during those twenty\nseven years"
}