{
  "id": "d57-24",
  "text": "President Lynn White, jr., Barnard Forum, 2/8/58 — 8\nIn Volume 36, 64% o£ the contributors were attached to Independent Institutions,\nand 36% to tax-supported institutions. (In tabulation I omitted a scattering of\nlone-wolf scholars, European professors, government officials and the like#) In\nother words, in 1930-31, nearly two-thirds of the top historical scholars were in\nIndependent colleges and universities. In 1956-57 this category of campus still\nheld the lead, but by a far slimmer margin: 54% as compared to 467. in the tax-\nsupported institutions.\nThe real significance of the figures may perhaps better be seen by arranging\nthem in another way. The 1956-57 volume is much plumper than the one twenty-seven\nyears earlier, and contains nearly twice as many academic contributions -- 490 as\ncompared to 256. But whereas historians in independent institutions had increased\ntheir participation by 62% (from 163 to 264), historians in tax-supported\ninstitutions had run up their contributions by 144% (from 93 to 226).\nThe conclusion is inescapable. While the entire historical profession in this\ncountry has been heightening its activity in a remarkable way during the past\ntwenty-seven years, the historians in state colleges and universities have been\nimproving their quality more than twice as fast as the historians in the privately\nsupported institutions. A year ago the latter still seemed to have an 8% margin of\nqualitAtive superiority, but it is rapidly vanishing. I strongly suspect that a\ncheck of any ccipparable learned Journal would yield similar results for other\nacademic disciplines. Whether we like it or not, the dynamic center of American\nscholarship, the weight of academic authority, is shifting rapidly from\nindependent to state institutions*\nWhere does this leave the independent colleges and universities? To put it\ncrudely, what have they got to sell, and is the market going to be adequate?\nThe greatest virtue of our independent institutions is their astonishing\ndiversity. Because of their almost infinite variation, I believe that it would be"
}