{
  "id": "d57-253",
  "text": "Octobar 15, 1957\nQene vm Hallbeorg\nHoznoDQr Ballf toa*\nP« 0. Box a03\nPcm0t HlllSp Hbv tcKk\nDmt Htt von Hallb»gt\nI hsfB just returaad trtm « two woek watlon, and thus this Is 17 ^xst\nopportunil^ to aoswer your latter of Septenber 30 aregevding THS FHUNDLY\nFHILOSOFaiR.\n7km majority of series we distribute are produced bQr our lasaber statioaai\nthat is, a station produoes a show for airing looai^ and, if the response\nis satisfaotosy, the series is offered to us for national distribution.\nThe originating stati<»is aake no charge for this mtrlom* In addition,\nwe distribute aeries fTon outside agenoiest IMted llations Badio, Canadian\nBroadoastii^ CoaipaaaQr, l^nch Broadcasting SN^stea, Radio Italiana, Wi\n(oooasionalJ^), hserioan Poundatiiwi for the Blind, little Orchestra Society,\nBritish Infoanaation Services, Rudubon Society, etc.t all of these series\nare provided free of charge. In fact, the Rienoh Broadcaeting Sijrstea\nhas a unit which doae nothing but produoe prograna for ua*\nTha only financial help given for the production of radio aeriaa to ba\ndistributed by us la becked by the Bducationel Televieion end Radio Center\nwhich, tqpon as^Hoation iron an interested par^ end i|)proval by an RASB\noonnittee, grants funds to assist in the productimi of outatanding radio\nprcgrana. for your infomation I am enclosing the latest grant«in«aid\nannounoenent put out by the Center.\nOriginally, the RilB Radio Rstwork waa flmsioed by the W. X. Kellogg\nfbundation. However, we have been able to aake curaelvee aelX<-supporting,\nrelying (xoly on annual dues paid by our asoher atationa. Thus, you can\nsee idiy ws have no funds available for the purohaao of aerlest our budget\nis Halted aod elr ti|^t.\nI have one *no* vote on your aeries, with two acre votes due in. Regazdless\nof the final vote, I aa returning your midition tape end eoript under aeperate\ncover, and I shall infora you as to the remaining two votes.\n1 hop^ this has cleared acme of the questions you had about our organisation.\nSincerely,\nRobert K* trnderwood,\nMtmek Mmiager"
}