{
  "id": "d57-283",
  "text": "During the continued reassurance campaign a very prominent\ni'jnerican nuclear physici's went to the lenghh of declaring that the\nluminous watchdials in the world represent a greater danger than the\nradioactive fall-out of all nuclear tests up till now I\nThe reassurance propaganda expects much from the glad\ntidings that science hy succeeded in making the prototype of a\nhydrogen bomb producing / less of dangerous radioactive materials\nthan the usual ones. The new bomb is called ”the clean hydrogen bomb^’.\nThe old type must from now on be content to be called the dirty bomb.\nThe clean hydrogen bomb differs from the other in having\na jacket made of a material which does not, like Uranium 238 release\nimmense quantities of radioactive elements at the enormous explosion\ntemperature. That is why it is less harmfull as regards radioactivity\nthan the usual ones. It is, however, also less powerful.\n•‘■he new, highly praised hydrogen bomb is ^ let it be said\nin passing - only relatively clean. Its trigger is an uranium bomb\nmade of the fissionable uranium 235; - an atomic bomb as powerful as the\none dropped over Hiroshima. This bomb, when detonated, also produces\nradioactivity, as do the neutrons released in great numbers at the\nexplosion^\nIn an /jnerican newspaper^^he beginning of this year,\nEdward Teller, the father of the dirty hydrogen bomb, sings a hymn\nof praise to the idyllic nuclear war to be waged with completely\nclean hydrogen bombs. He insists on a continuation of the tests,\nto perfect this ideal bomb.\nHere are two stanzas from Edward Teller^s hymn to the\nidyllic nuclear warfare:\n’’Further tests will put us into position to fight our\nopponents’ war machine, while sparing the innocent bystanders,”\n”Clean weapons of this kind will reduce unecessary\ncasualties in a future war,”\nOf course, neither the United States nor the Soviet Union\nis thinking of producing this less effective bomb for use in a\npossible war. The ^.merican war department has quite recently\ndeclared that the irradiotion of whole areas has become a new offen¬\nsive weapon."
}