{
  "id": "d57-286",
  "text": "In the future the propaganda for the continuation of nuclear\ntests can no longer maintain that the scientists do not agree on the\nquestion of the danger radiation, that one must, for that reason,\nawait the decision of international bodies and abstain from alarming\nthe public by saying that radiation represents an actual danger, growing\nmore serious every day,\n..... This propaganda will continue to set the tone in cer¬\ntain newspapers. But beside it the truth about the danger of nuclear\ntests marches imperturbably along, influencing an ever increasing\nsection of public opinion. In the long run, even the most well-\norganised propaganda can do nothing against truth.\nOne incomprehensible aspect of the propaganda for the\ncontinuation of nuclear tests is its complete disregard of their harm¬\nful effects on future generations which, according to biologists and\nphysicians, will be result of the radiation to which we are being\nexposed.\nThe declaration signed by the 9^35 scientists did well in\nstressing that danger,\nMe must not assume the responsibility for the future birth\nof thousands of children with the most serious mental and physical\ndefects, simply because we did not pay enough attention to that danger.\nOnly those who have never been present at the birth of a deformed baby,\nnever witnessed the whimpering and the shock of its mother, dare to\nmaintain that the risk in going on with nuclear tests is one which must\nbe taken under the given circumstances. The well-known French biolo'gist\nand geneticist Jean Rostand calls the continuation of nuclear tests\n”the future crime’’ (le crime dans I’avenir). It is the particular\nduty of women to prevent this sin against the future. It is for them\nto raise their voice against it in such a way that they will be heard.\nIt is a strange fact thatj^till now nobody has taken into\nconsideration that the question of wether nuclear tests should be\nstopped or continued is not one which concerns the nuclear powers exclu¬\nsively, a question for. them to decide at pleasure, lA/ho is giving these\ncountries the right to experiment, in times of peace> with weapons\ninvolving the most serious risks for the whole world? R?hat has inter¬\nnational law - enthroned by the United Nations and so highly praised\nin our time - to say on this matter ? Does it no longer look out on"
}