{
  "id": "d57-287",
  "text": "“ 7 -\nthe world from its temple ? Then take it out that it may face the\nfacts and do its duty accordingly.\nInternational law would at once discover the interesting\ncase of Japan. That country suffers heavily from the effects of\nnuclear tests. The radioactive clouds created by the Soviet tests\nin North-East Siberia and by the American'‘ones at Bikini (an island\nin the Pacific Ocean) is carried by the wind over the ‘country. The\nresulting radioactive poisoning is the worst possible. Very powerful\nradioactive rain-falls are quite common. The radioactive poisoning of\nthe soil and the vegetation is so powerful that the inhabitants of\nvarious districts ought toafcstain from using their harvest for food#\nThey are then faced with situations in which they are forced to eat\nrice infected with strontium, an element'particularly dangerous for\nchildren. The ocean surrounding Japan is also at times dangerously\nradioactive, and thereby the very food-supply of the country - in\nwhich fish has always played an important part - is being threatened\nbecause of the large amount of radioactive fish unsuitable for\nconsumption.\nAs every new nuclear test make a bad situation worse,\nthe Japanese ministers, when hearing of plans for new tests to the\nnorth or south of Japan, have presented their country’s urgent appeal\nin Washington or Moscow, beseeching the American or Soviet authorities\nto give up their plans. The answer was always the same: they regret\nthat there can be no question of so doing while as yet the powers have\nreached no agreement to that effect. As late as on February Both, 1958\nthis happened again in the capital of one of the nuclear powers.\nWe always learn about the appeal and the refusal through\nshort telegrams in the newspaper - just like any other news item. The\npress did not disturb us with editorials drawing our attention to and\nmaking us share in that which lies behind the news: the misery of the\nJapanese people. In that way we and the press have been ma:de guilty\nof lack of compassion. More guilty is, however, international law,\nwhich have kept silent and indifferent on this question, year after\nyear,\nhigh\nIt is/time that it is being realized that the question of\nthe continuing or .ceasing of nuclear tests is a matter for international\nlaw to take up. Mankind is imperilled by the tests.. Mankind insists"
}