{
  "id": "d57-29",
  "text": "Barnard Forum-3\nThe strength of our system is in its pluralism, its many centers of\ninitiative. Its rich variety offers opportunity to students of differing\nabilities and interests. Anyone with a good idea, some support and a lot\nof courage can start a new college. The system is adapted to local and\nspecial, as well as to national and general needs.\nThe important thing to recognize is that all universities--public,\nprivate or mixed—face common problems and a common task. These are\nso urgent and so important that they call for the most determined, cour¬\nageous and imaginatively cooperative efforts of everyone engaged in higher\neducation.\nWe are, indeed, all in the same rather leaky boat. It will not be\nenough merely to plug up the leaks and pull harder on the oars. If we\nare to begin to meet the demands of the fundamental revolution which is\ntaking place throughout the world, an industrial and technological revolution\nof unprecedented scale and scope, we need to build a much larger boat and\nequip it with something like nuclear power.\nThe most obviously urgent problem is money. Even fifty years ago,\nHenry Adams wrote: ’’The whole problem of education is its cost in money.\"\nIt isn't the whole problem, but it dwarfs all others just now.\nHigher education is struggling with three forms of inflation: the\nrising level of prices, rising student enrollments, and the rapid growth\nin knowledge, I see no end to any of them. All require money: much\nmore money than we are now spending or are accustomed to spend on\nhigher education. We need a major breakthrough to an entirely new level\nof financial support.\nThe struggle for money from traditional sources is now so pressing\nthat I suspect it may account for a certain antagonism towards public edu¬\ncation which I have occasionally detected, especially along the Eastern\nseaboard. Private colleges, once reasonably well supported by endowments\nand fees, and with relatively stable student populations, are finding the\ngoing increasingly tough. Some of them resent the competition of the public\ninstitutions for private and corporate gifts. Some are looking for a share\nin tax support--an ambivalent attitude for any who insist that private edu¬\ncation is the last stronghold of private enterprise. If it is any consolation\nto hard-pressed administrators of private colleges, I can assure them\nthat the going is pretty tough for the public universities, too.\nState governments have had to spend more and more on highways,\nwelfare programs, state aid to municipalities, and the like. The bulge\nin school enrollments has already hit them hard. Their tax sources have\nnot kept pace with growing needs, and the requirements of the Federal\nbudget have increased drastically. In my more discouraged moments, I think\nwe are exhausting our efforts in building larger and larger highways."
}