{
  "id": "d57-31",
  "text": "Barnard Forum-5\nAt present, we fall far short of doing so. We spend 3/4 of^ 1% of our\nnational income on all forms of higher education; yet many people are\nappalled and indignant at the cost. It obviously would not break us to spend\n2% or considerably more. The Russians are said to be spending 7% of\ntheir national income. They can control the proportion of the nationd re¬\nsources devoted to education and research by a decision at the top. We\nhave no such easy means of changing the direction of our own national\neffort. Thus our admirably productive system results in some curious\nchoices.\nWe spend millions to educate people in the value of cigarette smoking,\nthough the benefits of this form of consumption are at best dubious. Millions\nare available to persuade people to buy new cars, and this educational\ncampaign has been so successful that we could put the entire population on\nthe front seats of the cars we already have. Is this really what we want\nand need? These highly effective methods of channeling purchasing power\nand productive effort won’t do us much good if we fall behind in the com¬\npetition for knowledge.\nWe should be grateful to the Russians for waking us up to our own\neducational shortcomings. It is ironical that they have done it by offering\nus severe competition: a good old capitalist motivation. It is ironical,\ntoo, that Russian successes in scientific accomplishment are based on the\nuse of another time-honored American practice: that of giving pay incen¬\ntives to call forth the needed emphasis. We all know by this time that\nSoviet professors are honored and highly paid, and that able students have\ntheir way eased by adequate support,\nRussia has also adopted and acted upon the conviction which inspired\nthe founders of this republic, and many generations of Americans since:\nnamely, that national strength and progress depend on a strong system of\nuniversal education. We have faltered in our own allegiance to these\nconvictions in recent years, neglecting our schools, and failing to provide\nadequately for higher education and basic research.\nThe idea that these things are of vital importance is not new, nor did\nthe Russians invent it. Washington, Jefferson, John Quincy Adams were\ninspired by the vision of a great new nation of free men, and by the positive\npromise for human betterment in the uses of science. More recently, the\nnegative and dangerous results of neglecting knowledge in the modern\nsituation was stated by Alfred North Whitehead, in England in 1916. Here\nare his words:\n”In the conditions of modern life the rule is absolute; the race which\ndoes not value trained intelligence is doomed. Not all your heroism, not\nall your social charm, not all your wit, not all your victories on land or at\nsea, can move back the finger of fate. Today we maintain ourselves.\nTomorrow science will have moved forward yet one more step, and there will\nbe no appeal from the judgment which will be pronounced on the uneducated,\""
}