{
  "id": "d57-32",
  "text": "Barnard Forum-6\nThe United States is now in the mood, perhaps, to heed Whitehead's\nwarning, I hope we shall not take our cue only from the Russians, and\nlaunch on a sort of Olympic obstacle race for scientific supremacy. It is\nabsolutely essential that we maintain our military strength. But this use\nof science is a negative, if necessary, one. Our own educational tradition\nis strong and positive. We need to reassert and re-examine it, and act\nupon it decisively.\nTwo main themes have characterized American public education\nfrom the beginning. One is to use knowledge for the development of\nnational strength. Our forefathers saw clearly that the new and struggling\ndemocracy could not survive without an educated citizenry, and that the\npromise of this great continent co\\ild only be realized by the application of\nscience and intelligence to the ordinary productive occupations. The second\ntheme is the equality of individual opportunity.\nThe Land-Grant colleges and state universities are American inventions\nexpressing both these national purposes. They were founded to open\nacademic doors to the new scientific knowledge, and to make its results\navailable for the improvement of agriculture, engineering and other\npractical pursuits, while continuing to stress the traditional liberal arts.\nAnd they opened the doors of educational opportunity to all who c ould use\nit.\nThe present mood of national breast-beating should not blind us to\nthe fact that American higher education, with all its defects, has done a\nmagnificent job. No other country offers a college education to so large\na proportion of its young people. The investment in knowledge and research\nhas paid off a thousand-fold in contributing to our national strength and\nwell-being. To take only one example--agriculture; the productivity of\nAmerican farms is so great that we need only 12% of our people to grow\nthe food and fiber for all the rest, and our main problem is that we produce\nsurpluses. These are some of the positive achievements which inspire\nadmiration and imitation in other parts of the world, especially in the so-\ncalled underdeveloped regions where our Land-Grant college people are\ngiving technical aid.\nThe two goals of national strength and equal opportunity are, in our\nfortunate country, aspects of the same democratic aspiration. They are\nstill the proper guides to national educational policy today. They require\nonly a stronger affirmation, and certain changes of emphasis to meet\ncontemporary conditions.\nFirst, we must raise our educational sights. High school is no longer\nenough. Young men and women without a college degree find their oppor¬\ntunities severely limited. And the staffing of our complex economy requires\nan increasing proportion of highly educated people. Both these considera¬\ntions are likely to put more and more pressure on the public institutions."
}