{
  "id": "d57-33",
  "text": "Barnard Forum-7\nI think many people are confused because they tend to think of college\nonly in terms of individual opportunity. Higher education is thought of as a\nluxury, which can be left to the ordinary market demand of those who can\npay for it. Perhaps the over-publicized and quite distorted picture of the\nrah-rah aspects of college life have contributed to this view.\nWhy, then, shouldn't the students, or their families, pay the full\ncost of an education which brings such great advantages in earning power,\nsocial status, and the enrichment of personal lives? Another proposal\nis that the students shoxild buy their own education on the prevalent consume-\nnow-pay-later plan, through the provision of substantial loan funds.\nStill another idea which seems widespread is that any industrious and\ndetermined student can work his way through college, without loss of\nacademic accomplishment, and with positive gains in character development.\nThis last idea finds little endorsement among experienced college\nteachers. It is true that many students can and do usefully earn something\nwhile learning. But very few can earn enough to support themselves\nentirely. If the economic pressure is too great, the losses and failures are\nserious. The important business of learning must come first.\nThe notion that students and their families could pay the fiill costs of\nhigher education is, I think an illusion. A recent report of the Office of\nEducation indicates that nearly half the students now in college come from\nfive-member families whose total income is under $5,000. Even families\nwith twice this income find it hard enough to keep one child in college.\nHow many New Yorkers would be able to give their children a college\neducation, without the opportunity afforded by the excellent City Colleges?\nThere is no doubt some merit in the student loan plan, but it cannot\nbe regarded as a complete solution. Few young people could afford to\nassume such a f>urden of debt, at an age when they are ready to marry\nand start raising their own families.\nAn attempt to solve the financial problem by charging the full cost\nof higher education to the recipients would sharply reduce the number of\ncollege students, and move us far away from the provision of equal\nopportunity we profess to value. The loss to the national strength would\nbe catastrophic.\nEvery recent commission on higher education has deplored the fact\nthat a significant proportion of our ablest young people do not now attend\ncollege. Obviously, we cannot afford to cut down the numbers still\nfurther. Ways must be found to induce all who have the ability to get as\nmuch education as they can use. This requires public support for higher\neducation more nearly on the scale which we have been accustomed to\nthink of as applying to the high schools. Higher education is not a luxury\nwhich can safely be left to individual choice backed by ability to pay. The\nequal opportunity for the development of the powers of all our young\npeople is at the same time a matter of justice, and a national necessity."
}