{
  "id": "d57-34",
  "text": "Barnard Forum-8\nThe need for increased support for higher education does not stop\nat the undergraduate level. Apart from money, the most crucial shortage\nin the immediate future will be the shortage of qualified college teachers.\nGraduate schools must be expanded, and fellowships provided.\nPromising students ought to be able to give full time to graduate study,\nso that they can earn the Ph.D, in two or three years of concentrated\nwork, instead of struggling along for perhaps ten years in depressed\nand depressing poverty, as so many of them must do today,\nI don’t think I need add my voice to the chorus which has been\nproclaiming the need for certain changes of emphasis in the college\ncurriculum. Obviously, we need to reinstate science as one of the im¬\nportant liberal studies, and stop accepting scientific illiteracy with com¬\nplacency, We need to step up the study of foreign languages and cultures.\nIt is hard to explain or justify the almost complete neglect of geography,\nwhich most American students don't encounter beyond the seventh grade.\nOur graduate schools doubtless require some re-organization, and are\ncurrently engaged in some searching self examination with the purposes\nof attracting and holding first-class students, and educating them for\nthe kind of creative scholarship which must be the foundation of good\ncollege teaching.\nThe present alarm about Russian scientific achievements will not,\nI hope and believe, throw us off base. We need businessmen, lawyers,\nartists, actors and a host of other competent people, as well as scientists\nand linguists. We can surely afford to give our students the luxury of\nchoice, so that each may contribute in his own way by developing his own\nparticular talents.\nThe kind of national strength we value requires the continued\ncultivation of the humanities and the arts as well as the sciences. The\narts are the most lasting products of any civilization. They are universal\nlanguages, speaking through the ages, and directly communicable to all\npeoples. There are, however, no pressure groups behind them, no public\nclamor for their emphasis. It is the responsibility of the universities to\ninsist that they receive proper support. It is encouraging that the great\nstate universities of the West, the Middle West and the South are meeting\nthis responsibility admirably. In many respects they are ahead of the\nolder institutions in the East in their provision for the arts. (I recommend\nthat any sceptical Easterner take a tour of their campuses to see for\nhimself.)\nIn spite of formidable problems, I am optimistic about the future of\nhigher education in this country. I do not share the gloomy forebodings\nbased on the belief that increased numbers will mean a lowering of quality.\nOn the contrary, I believe that the pressures of necessity will oblige us\nto undertake some educational reforms long overdue, long vainly advocated"
}