{
  "id": "d57-46",
  "text": "A Brief History of The Barnard Forum\nThe Barnard Forum, which has been an annual mid-winter event\nin New York City since 1949, was conceived as a public service\ndesigned to bring into the light of open discussion the critical educa¬\ntional issues of the times as a public service to the community and as\na contribution to general education.\nNew York has a large population of college women, alumnae\nof scores of different colleges located throughout the country, but\nthere have been few opportunities for them to come in contact with\none another outside their individual alumnae groups. The Barnard\nForum was planned as an event that would augment the work of\nlocal alumnae groups by bringing them into close association, work¬\ning cooperatively on a program through which they could discuss\nmutual problems or develop a meeting of minds on various topics.\nThe first Forum was sponsored by the New York alumnae clubs\nof Barnard, Bryn Mawr, Mount Holyoke, Radcliffe, Wellesley, Vassar,\nand Smith, with the Barnard College Club of New York taking the\ninitiative in arrangements. The next year, the responsibility of plan¬\nning and arranging the meeting was undertaken by Barnard College,\nand twenty-four metropolitan alumnae groups joined in the sponsor¬\nship. The number has increased every year and this year alumnae\ngroups of forty-nine colleges and universities and the New York\nBranch of the American Association of University Women are spon¬\nsoring the Forum.\nTheme of the 1949 Forum was “Today’s Woman—What\nNow?” Since 1949 Forum themes have been: “Is College Good\nEnough for Women?’’; “Woman and the World Crisis’’; “Modern\nEducation; Evolution or Revolution?’’; “Decade of Decision for\nHigher Education’’; “Knowledge and Freedom’’; “The Younger Gen¬\neration: A New Perspective’’; “Women in Politics: Their Achieve¬\nments and Their Opportunities’’; and “Asia and the West: Time\nfor Understanding.’’\nProceedings of The Barnard Forum will be published in booklet\nform. Please fill out the white card on your table if you wish a copy\nand give the card to an usher. Additional copies of the Proceedings\nare available for twenty-five cents at The Barnard Forum Office, 606\nWest 120th Street, New York 27."
}