{
  "id": "d57-83",
  "text": "- 3 -\nVon Wissensohaftlern, die sich angelegen sein\nlassen, die Gefalir der Radioaktivitat auf das vermeintliohe\nrechte Mass zuriickzufiihren , komme einer aus Mitteleuropa in den\nkiiiinen, auf Jahrzehnte hinaus soiiauenden Satzen zu Worte, mit\ndenen er einen von ihm uber diesen Gegenstand geiialtenen\nVortrag beschliesst: ’’Falls die Versuche im Temp# der letzten\nJahre waiter gefulirt warden, wird die radioaktive Verseuchung\nim Jahre I983 das Vierfache der heutigen betragen, wahrend urn\ndas lahr 2010 berum der sech.sfache Wert erreicht wird. Auoh\ndiese Betrage waren nocb klein verglichen mit der naturlichen\nradioaktiven Bestrahlung..,. Es kann eindeutig festgestellt\nwarden, dass das Risiko fiir die Menschheit infolge der\nVersuchsexplosionen klein ist. Das heisst nicht, dass kein\nRisiko vorhanden ist. Es konnen hier vielleicht die Worte\ndes amerikanischen Physikers und Mitglied der A.E.C.\n(Atom-Energie-Commision) Professor Dr, Libby angefiibrt warden:\n”Das Risiko der radioaktiven Verseuchung muss entgegen gesetzt\nwarden dem Risiko, dem sich die ganze freie Welt aussetzen\nwurde, wenn die Versuchsexplosionen abgeschafft wiirden, bevor\nein sicheres internationales Abrustungsabkommen existiert.\nDie Versuche sind notwendig, wenn die Vereinigten Staaten von\nAmerika in der Entwicklung der Kernwaffen nicht zuriickbleiben\nwo lien”’.’\nIm Fortgang der BeriAhigungspropaganda versteigt\nsich, im August 1957> sine sehr hohe amerikanische Atom-\npersonlichkeit zu der Behauptung, dass die Radiumleuchtziffer-\nblatter der in Gebrauch befindlichen Uhren eine grossere\nGefahr bedeuten als der gesammte radioaktive Niederschlag von\nalien bisher stattgefundenen VersuchsexplosionenJ\nViel verspricht sich die Beruhigungspropaganda\ndavon, dass sie der Welt die frohe Botschaft verkiinden kann, '\ndass es der wissenschaft gelungen sei, den Prototyp einer\nWasserstoffbombe herzustellen, die bei der Explosion viel\nweniger von den so gefahrlichen radioaktiven Stoffen\nproduziert als die gewohnliche. Diese neue Wasserstoffbombe\nwird’Uie saubere”genannt. Die bisherige muss sich gefallen\nlassen, hinfort die schumtziga zu heissen."
}