{
  "id": "d57-86",
  "text": "- 6 -\nWie entsteht diese in ans vorhandene Radio-\naktivitat?\nDie in der Luft, auf Grand der Versuchsexplosionen\nvorhandenen radioaktiven Stoffe verbleiben nicht in ihr,\nsondern komnien in radioaktivem Staub, in radioaktivem Regen,\nin radioaktivem Schnee auf die Erde hernieder. Sie lagern\nsich auf ihr ab. Durch die Blatter und die Wurzeln gehen\nsie in die Pflanzen ein und speichern sich in ihnen auf.\nDurch die Pflanzen gehen sie in uns ein, sei dass wir die\nMilch von Kuhen trinken, die sich von ihnen ernahrten, Oder\ndas Fleisch von Tieren essen, die solches taten, Radioaktiver\nRegen kann es mit sich bringen, dass wir radioaktives Wasser\ntrinken.\nDie grosste radioaktive Verseuchung ist auf dem\nStreifen zwischen dem 10-ten und 60-ten Breitegrad nordlicher\nBreite festzustellen, well die zahlreichen Versuchsexplosionen\nhauptsachlicU\nAmerikas und der Sowjetunion in diesen Streifen statthaben.\nWas unser Korper mit der Zeit an solchen radio¬\naktiven Stoffen in sich aufnimmt, wird in seinem Zellgewebe\nnicht gleichmassig verteilt sondern an besonderen Orten\nabgelagert und angehauft. Von diesen Oyte^ aus findet dann eine\nvon innen her kommende Bestrahlung statt, durch welche die\nfiir sie empfindlichen Organe in besonderer Weise geschadigt\nwarden. Was ihr an Starke abgeht, ersetzt sie durch ihre\nDauer, Durch lahre hindurch ist sie ja Tag und Nacht im Gange.\nEines der verbreitetst^n 'i^id gefahrlichsten\nradioaktiven Elemente, die wir in uno aufne.hmen, ist\nbekanjitlich Strontium QO. Dieses lagert sich in den Knochen ab\nund gibt von da seine Strahlung in die Zellen .\n/des roten Knochenmarks ab, in aem die roten und weissen\nBlutkbrperchen gebildet warden. Dies hat Blutkrankheiten zu\nFolge, die in den meisten Fallen totlich verlaufen..\nAm meisten warden durch die Strahlung die Zellen\nder fur die Fortpflanzung in Betracht kommenden Organe\ngeschadigt. Auch wenn sie nur ganz schwach auf sie einwirkt,\nkann sie verhangnissvolle Folgen haben.\nDas Unheimliche der von innen, wie auch von aussen,\nkommenden Bestrahlung ist, dass es Jahre lang gehen kann, bis"
}