{
  "id": "d57-89",
  "text": "- 9 -\nEinen fur es interessanten Fall kann as gleich\nin einar Japan angahandan Sacha zu G-asicht bakomman, Diasas\nLand laidat untar dan Versuchsaxplosionan in basondarem Massa,\nDia Winde traiban die radioaktiven Wolken sowohl der Versuche\nder Sowjetunionen in Nord-Ost-Sibirien als auch die der\namerikanischen auf Bikini (einar Insel das Stillen Ozeans),\nauf es zu und iiber es hin. So ist dia radioaktive Verseuchung\nunter der es zu leiden hat, dia d^nkbar schlimmsta. Sehr\nStarke radioaktive Regan gehen hauftig iiber ihm niedar. Die\nradioaktive Verseuchung das Bodens und der Pflanzen ist\nderart, dass zu Zeiten die Einwohner dieser Oder jener Gegend\ndarauf verzichten sollten, sich von dam, was sie ernten\nkbnnten, zu ernahren. Dabei kommen sie in die Lage, Reis, der\nstrontiumhaltig ist, essen zu mlissen, Fiir Kinder ist dies\nbesondars gefahrlich. Da auch die umgabenden Meere zu Zeiten\nubel radioaktiv verseucht sind, ist die Ernahrung der\nBevolkerung durch Fische, die in Japan eine so grosse Rolle\nspielt, durch die MQngen von radioaktiven Fischen, die fur\nsie nicht in Betracht koinmen konnen, in Frage gestellt.\nWo' nun durch jade neue Serie von Versuchsexplosionen\ndie schlimme Lage noch verschlimmert wird, wurden die\ngesandten Japans, wenn sie von im Norden Oder Siiden geplanten\nVersuchen horten, jeweils in Moskau Oder Washinton vorstellig\nund tragen dort die flehentliche Bitte ihres Landes vor, dass\nman sie unterlassen moge. Jedasmal bekamen sie zur /uitwort,\ndass davon leider keine Rede sein konne, weil von den Machten\nnoch kein abkommen abgeschlossen sei, die Versuche miteinander\naufzugeben. Solches ereignete sich wieder einmal kiirzlich, am\nzwanzigsten Februar I958, in der Haupstadt einer der\nAtommachte.\nVon der Bitte und der Antwort erhielten wir jedes-\nmal durch kurze Zoitungstelegramme, Wir nehmen davon Kenntnis\nwie von irgend einer Nachricht. Die Presse belastigte uns\nnicht mit Leitartikelen, die uns auf die im Hintergrunde\nstehende Not des japanischan Volkes aufmerksam gemacht und zu\nderen Miterleban bewegt hatten. So machten die Presse und\nwir uns der Teilnahmbsigkeit schuldig. Am meisten schuldig\naber ist das Vblkerrecht geworden, dass es Jahrc hindurch in\neiner solchen Sache teilnehmlos und stumm geblieben ist."
}