{
  "id": "d57-93",
  "text": "- 3 -\nWie verliefe ein heute ausbrechender Atomkrieg ?\nZuerst sei der sogenennte lokale in Betracht gezogen,\nInsgeheim geben sich nSmlich so manche Menschen der Hoffnung bin,\ndass die Feindseligkeiten mit einem einigermassen lokal begrenzten\nAtomkrieg anheben konnten, in dem noch nicht von den vervollkommneten\nitombomben und von mSchtigen lAasserstoffbomben Gebrauch gemacht wtirde,\nsondern nur von Kurz- und Mittelstrackenraketengeschossen. Die durch\ndiese angerichtete Vernichtung konnte, so hofft man, sich noch in\ngewissen Grenzen halten und ein rechtzeitiger Friede ebenfalls noch in\nBetracht kommen.\nWas die lokale Beschrtokheit eines solchen Krieges angeht,\nist es damit nicht weit her. Es wird ja mit Raketengeschossen von bis\nzu 2400 Kilometern Reichweite geftlhrt. Auch die statthabende Vernicht=\nung darf nicht gering eingeschStzt werden, wo die Wirkung der ;^ur\nVerwendung kommenden Atomgeschosse die einer Hiroshimabombe ist, und\neine noch viele grdssere, wenn sie einen Wasserstoffbombensprengkopf\nhaben.\nEs ist kaum anzunehmen, dass die Gegner darauf verzichten\nwerden, von Anfang an auf grosse StSdte vervollkommnete i.tombomben\nOder modernste Wasserstoffbomben abwerfen zu lassen. Diese Wasser-\nstoffbomben haben eine Snergieentwicklung die tausendmal grosser ist\nals die einer ..tombombe.\nEine grosse Wahrscheinlichkeit spricht also dafUr, dass in\neinem kommenden Atomkrieg Raketengeschosse und grosse Bomber mitein-\nander eingesetzt werden. Der mit Abwurf grosser Bomben gefUhrte\nXrieg wird durch den mit Raketengeschossen nicht ersetzt, sondern\nvervollstSndigt.\nVon der Wirkung der grosser Wasserstoffbomben ist zu sagen,\ndass der Durchmesser der bei ihrer Explosion entstehenden Feuerkugel\nmehrere Kilometer betragen kann. Die Hitze wird auf 100 Millionen\nGrad geschStzt. Danach l^sst sich ermessen, wieviele Menschen in\nder getroffenen Stadt in ganz kurzer Zeit durch den Druck der Explo¬\nsion durch die herumfliegende Trfimmer, durch das Feuer, die Hitze und\ndurch die erste, gewaltige, wenn auch nur einen /^ugenblick bestehende\nradioaktive Strahlung vernichtet werden. Die todliphe radioaktive\nVerseuchung, die die Explosion zum Folge hat, wird sich auf einem\nGebiete von etwa 45000 'uadratkilometern erstrecken."
}