{
  "id": "d57-94",
  "text": "- 4 -\nVor einem Parlamentsausschuss soil ein amerikanischet Gene-\nralgesagt haben; '^Wenn in einem /.bstand von jeweils 10 Minuten 110\nWasserstoffbomben auf die U S A abgeworfen werden, so werden dabei\n70 Killionen Menschen getdtet oder verletzt, Ausserdem werden\nlausende von Quadratkilometern ftir eine ganze Generation unbrauchbarV\nDanach werden Staaten wie England, Vi'estdeutschland oder Frankreich\nmit ftinfzehn bis zwanzig Wasserstoffbomben neuester Fabrikation so\ngut wie abgetan.\nWas die Schutzmassnahmen in einem kommenden Atomkrieg an-\ngeht, soil President Eisenhower nach einem Bombenangriffsmanover, in\ndem auch die Schutzmassnehmen erprobt wurden, geSussert haben:\n^^Da hilft nur beten’^. v\nTatsachlich kann man nicht viel mehr tun, als im Hinblick\nauf einen Bombenangriff die Anweisung geben, dass alle auf dem GelSnde\nbefindlichen Personen sich hinter einer moglichst starken Wand aus\nStein Oder Beton mit dem Gesicht nach unten auf den Boden werfen und\ndie RUckseite des Hauptes und des Kdrpers nach Mdglichkeit mit Tuch\nbedecken. So kann man, wenn man sich nicht im Gebiet des absoluten\nVernichtetwerdens befindet, unter UmstSnden dem Tod durch Durch Be-\nstrahlung entgehen. Wichtig ist auch, dass man den Uberlebenden\nnach Mdglichkeit 'Wasser und Speise, die nicht radioaktiv sind, zukommen\nISsst und sie schnellstens uas dem radioakti verseuchten Gebiet her-\nausschafft.\nSchutzbauten mit dicken Betonmauern fUr die ganze Be-\nvdlkerung eines Ortes zu erstellen,. daran ist nicht zu denken. Woher\nnShme man den erforderlichen Platz und die erforderlichen Mittel ?\nWo nflhmen, im Falle einer Bombardierung, Die Einwohner die Zeit her,\nmiteinander in irgendwo erstellten Bunkern Schutz zu suchen ?\nIn einem Atomkrieg gibt es keinen Sieger, sondern nur Be-\nsiegte. In ihm erleidet jeder von den Bomben und Atomgeschossen seines\nGegners, was die seinem diesem antun, Es enststeht dabei eine im\nGan bleibende Vernichtung, der kein W^affenstillstand und kein Friedens-\nschluss ein Ende setzen kann.\nWo es sich urn Atomwaffen handelt, kann kein Volk zu seinem\nGegner sagen ‘^Nun sollen die Waffen entsch'iden'», sondern nur 'WJun\nwollen wir miteinadner Selbstmord begehen, indem wir uns gengenseitig\nvernichten,"
}