{
  "id": "d57-95",
  "text": "- 5 -\nMit Recht hat ein englischer Parlamentarier gesagt, dass\nwer Atomwaffen gebraucht das Schicksal der Biene, hat, die, wenn sie\nsticht, ihrerseits unfehlbar daran zugrunde geht, dass sievon ihrem\nStachel Gebrauch gemacht hat.\nEin mit den heutigen Atomwaffen ffir die Erhaltung einer\nals gefShrdet angesehenen Freiheit gefUhrter Krieg, kann nicht leisten,\nwas man von ihm erwartet,\nDiejenigen, ftir die er geftihrt wind, werden in seinem Ver-\nlaufe zu leben aufgehort haben oder nachher elend dahinsiechen. An\nStelle der freiheit wurde ihnen die Vernichtung zuteil.\nDie radioaktiven Staubwolken, die ein zwischen dem Osten\nund dem Westen geffihrter Atomkrieg zur Folge hStte, wtirden auf der\nganzen Erde das/:eiterexistieren von Menschen in Frage stellen, Diese\nMSchte brSuchten daftir nicht einmal ganzen Vorrat an Atombomben und\nWasserstoffbomben dranzuwenden. Er soil 50 000 Sttick betragen,\nEin Atomkrieg ist also das unvorstellbar Sinnlose und\nGrausige, das under keinem Umstanden Tatsache werden darf.\nXXX\nLeider ist die Gefahr, dass der kalte Krieg in einen Atom¬\nkrieg tlbergeht, heute viel grosser als je zuvor, Sie hat ihren Grund\nin dem Aufkommen der ferngelenkten Raketengeschosse und der durch sie\ngegebenen Moglichkeiten ,\nIn vergangenen Zeiten hat Amerika zum Prinsip gehabt, neben\nder Sowjetunion allein im Bestize von Atomwaffen zu bleiben. Es\nhatte kein Interesse, andere Staaten mit Atom- und Wasserstoffbomben\nauszustatten. Diese hStten auch nicht gewusst, was damit anfangen.\nDurch das Aufkommen von ferngelenkten Raketengeschossen von kleinerer\nund grosserer Reichweite Sndert sich aber die Lage. Mit diesen kon-\nnen mit in Amerika im Bund stehenden Lender etwa anfangen, das sie in\nihrem und Amerikas Interesse ftir geboten erachten. So geht .merika\nvom Dogma ab, keine .atomwaffen in andere HSlnde zu ge]Den, Ein folgen-\nschwerer Entsheid.\nVon seinem Standpunkt aus ist begreiflich, dass es die\nNatovolker in Stand setzen will, sioh mit diesen neuartigen Atomwaffen\ngegen die Sowjetunion verteidigen zu konnen. Fdr die Sowjetunion\naber bedeutet diese Bewaffnung eine vorher nicht vorhandene Bedrohung."
}