{
  "id": "d1536-3",
  "text": "-4-\nEOAC MARKS ITS SILVER JUBILEE\nDecember 7, 1947 is an important date in American history. It’s also a very\nimportant date in the annals of Station EOAC, owned and operated by the Oregon\nState System of Higher Education.\nEOAC, transmitting with 5000 watts on 550 kilocycles, is located on the\ncampus of Oregon State College, Corvallis, maintains remote studios.- , on the campus\nof the University of Oregon in Eugene, and serves, under the direction of James\nM. Morris, a wide area in Oregon*s fertile Willamette Valley\nSurveys have shown EOAC to hold the number one spot in Oregon rural listening\npreference. It operates with a varied program of good music, news, special\nagricultural features, and a noteworthy School of the Air, broadcasting from\n10:00 a.m. to 10:00 r>.m.\nClearly one of the key stations on the N-A-ErB. educational circuit, EOAC\nhas operated continuously since 1922 as an educational, non-commercial outlet for\nOregon’s institutions of higher learning. December 7, 1922 saw the arrival on\nthe Oregon State campus of the license from the old Federal Radio Commission for\nfacilities then known as ”EFDJ\" which later became the present EOAC.\nEOAC has had a good many radio notables ’’milestoning” its career. To mention\nseveral— Wallace Eadderly, long-time Radio Chief for the U.S. Department of\nAgriculture and former mentor of the ’’Rational Farm and Home Hour,” Luke Roberts,\nEducational Director for EOIN, Portland, and Allen Miller, presently Director\nof the RockyMountain Radio Council,\nN-A-E-B salutes EOAC and its Program Manager, Jimmy Morris.\nHEW RADIO COUNCIL IN NEBRASKA\nCivic leaders and station representatives met in Omaha early in December\nto begin formation of a Nebraska Radio Council whose first formal meeting was\nscheduled this month. Dorothy Lewis, who has been active in nation-wide organi¬\nzation of these civic groups which act as liaison agencies between commercial\nstations and John G-illin, manager .of commercial station WOW, Omaha,met with the\norganizing committee.\nRadio councils, acting on the local level, serve as liaison and traffic\ncenters for public agencies seeking, free public service time on commercial\nand educational stations.\nAn increasing number of radio councils are seeking associate membership with\nthe National Association of Educational Broadcasters in their capacity as lia^lson\nand public service program production centers.\nCOMMISSION WARNS COLLEGES ABOUT RADAR ABUSE\nThe FCC this month warned colleges and other educational stations who\nhave been inquiring about use of radar equipment for engineering training,\nabout possible interference to recognized radio services and the necessity\nof obtaining both station and operator licenses before beginning operation.\n(MORE DETAILS IN FCC SECTION OF NAE3 NEWSLETTER)"
}