{
  "id": "d1536-7",
  "text": "FEDERAL CQiUNIFICATIONS COMMISSION\nNovember 15, 1947\nNEUS--APPLICATIONS—ACTIONS\nDecember 20, 1947\nAN ORDERLY FA LICENSE REFEUAL SCHEDULE\nThe FCC proposes to amend present rules to set up an orderly schedule\nfor renewal of FM station licenses.\nThe amended section of the rules would provide for licensing FM stations\nfor a normal period of one year. Licenses would expire at 3:00 a.m. Eastern\nStandard Time on staggered dates.\nNon-commercial, educational licenses would expire on the following date\nschedule;\nJune 1 August 1\n88.1 me.\n89.1 me.\n90.1\nme.\n91.1 me.\n88.3 me.\n89.3 me.\n90.3\nme.\n91.3 me.\n88,5 me.\n89.5 me.\n90.5\nme.\n91.5 me.\n88.7 me.\n89.7 me.\n90.7\nme.\n91.7 me.\n88.9 me.\n89.9 me.\n90.9\nme.\n91.9 me.\nI'ISSION SETS ASIDE NEU YORK GRANTS ON FM\nThe FCC set aside its October grants for\nfive\nnew FM radio stations in\nthe New York area. This was the case in which former FCC Chairman Charles Denny\ncast his vote. (Denny left his post to become associated with NBC as their\ngeneral counsel). Kis participation in the grants was challenged by the News\nSyndicate Company, Inc., publisher of the New York Daily News. The News was\namong the unsuccessful applications for the available FM channels in the area.\nThe News contended Denny unlawfully took part in the awards after a\npublic announcement that he was leaving the FCC for NBC; it also raised the\ncontention that his business as a newspaper publishing firm had been used by\nthe FCC as a basis for its rejectign, and said if this policy were allowed to\nstand it would place in jeopardy the licenses of all newspaper owned stations.\nThe FCC, in setting aside the October grants, announced it will reopen the\ncase for new oral argument January 12.\nCLEAR CHANNEL E&JtlNGS ORAL ARGUMENT, JANUARY 19\nThe FCC adopted an order in Docket 6741, ordering that before a decision\nis rendered all parties to the Clear Channel Hearings will be given an op-oortunity\nto appear and present oral argument before the Commission \"en banc” at 10:00 a.m.\nJanuary 19, 1948.\nThe FCC further ordered that any person desiring to participate in the\noral argument must file with the Commission a brief on or before January 5, 1948;\nit further ordered that upon conclusion af oral argument the Commission HILL\nISSUE A FINAL ORDER IN LIEU OF PROPOSED.\nOral argument is expected to last for 60 days."
}