{
  "id": "d1536-9",
  "text": "-3-\n450 EC - Change Hours\nKBPS - Benson Polytechnic School, R. T. Stephens, Agent, Portlant, Oregon -\nModification of license to change hours of operation from 10:30 a.m. to 6:30 p.m.,\nPST, Monday through Friday each v/eek, to 10:00 a.m. to 10:00 p.m., PST, Monday\nthrough Friday each v/eek.\n1030 ICC - SSA*\nIUTBU - Baylor University, Corpus Christi, Texas - Extension of special service\nauthorization to operate on 1030 kc., 50 ICU power, using non-directional antenna,\nduring the hours from local sunrise at Boston, Mass.» to local sunset at Corpus\nChristi, Texas. Period not to exceed six months from 12-15-47.\nCOMMISSION UAPUS OF RADAR INTERFERENCES\nKITE RADIO SERVICES BY COLLEGE TRAINING\nThe FCC last v/eek sounded ,ra note of caution” for colleges and other education¬\nal institutions inquiring about use of radar equipment for training, regarding\npossible interference to recognized radio services and the necessity of obtaining\nboth station and operator licenses before beginning operation.\nIn a public notice issued on Monday (1), the FCC said that such equipment\nin the main had been purchased from TTar Assets Administration surplus military\nstocks, for use in training engineering students in radar techniques.\nCiting as an example one type of radar designed to operate on frequencies\nused by ground controlled approach (GCA) stations in landing aircraft, the public\nnotice said that such war-born equipment, was developed for miliary use in emer¬\ngency, not to operate in the Commission1s table of allocations.\n\"It is evident,\" saidthe notice, \"that even momentary interference to so\nvital a safety service could have disastrous results.\"\nThe notice also listed forms to be filled by institutions wishing to set up\nsuch training transmitters..\nAPPLICATIONS (FREQUENCY MODULATION) COLLEGE AND UNIVERSITY\nExtension Completion Date\nMUCH - The regents of the University of Michigan, Ann Arbor, Mich. - Modifi¬\ncation of construction permit (B2-PED-25, as modified) which authorized a new\nnoncommercial educational broadcast station for extension of completion date from\n12-16-47 to 6-16-48.\nCP Modification\nUTDS - Board of Education,Toledo City School District, Toledo, Ohio -\nModification of construction permit (B2-PEB-37) which authorized a new non¬\ncommercial educational broadcast station to change studio location and transmitter\nsite, make changes in antenna system and change commencement and completion dates.\nRemote Pickup\nTTS0H - The Ohio State University, Area of Columbus, Ohio - Construction\npermit to install new transmitter and increase power.\n*(Owned by University but operates commercially as investment)"
}