{
  "id": "d1220-1",
  "text": "b) Leave all present with a clear understanding the \"tide hat tamed.*1\nEducational radio hat been the 9tep~child of American broadcasting.\nOf an original 200 educational stations, the number sank to a mere\n30 during the depression. We are accustomed to regard ourselves as\npoor relations, To so regard ourselves now is merely an eshibitloa.\nof inferiority feelings. Colleges* universities, and allied insti¬\ntutions in terms of physical resources alone, compare favorably with\nmany corporations. As for intellectual resources, they are the\nfountainheads.\ne) Leave the clear concept that radio as one of the mass media is only\na •‘tool** of communication. As Lyman Bryson says, **0ne can comsiuni-\ncate anything.** Universities must become, not only practitioners\nof educational radio, but also the practical conscience of all radio,\nand cease being only carping critics,\nd) And if this Is indeed the \"age of mass communication\", consider\nwhere the resources of the schools should be expended in \"Gstsnsioa\neducation\" ?md how most effectively, Harold Bagel at WHA has pointed\nout no citizen blanches at the thought of several new miles of paving\nto simplify transportation from one city to another to help several\nhundred citizens per day. (Cost in Iowa - $35,000 per mile.) Yet\nmany wince at the \"cost of radio\" which can serve thousands, What\nwill you have—3 miles of paving or \"several thousand miles\" of\nserious radio, serving as mmy citizens?\n5) Following is a statement in other words of the problem, the promise, the\nurgencies, and the Issues, Appended is a suggested program for your editing.\nme gro>j&aa\nEducational radio has been the step-chi Id of American radios-the poor relation—\nthe unwanted orphan—the erudite but peculiar child of electronic mass communication.\nFounded in the promise of a new technology, more than 200 educational institu-\ntions in the U.S. set up transmitter?, procurred broadcasting licenses and em¬\nbarked on what they then thought was the \"royal road to learning.\"\nWhile they were pouring from the fountain of knowledge, waiting for thirty\nthousands to drink, that parched population was turning its attention, not\nto academicians of the air but to crude, loud-mouthed but popular sad effec¬\ntive hucksters who understood the psychology of the medium, better than the\nprofessors.\nDisillusioned by the c&oophony in the ether and harassed by the depression of\nthe thirties, most of these institutions followed one of three courses; (1) let\ntheir licenses lapse (2) sold their stations, or (3) were \"traded\" out of their\nwavelength by some shrewd commercial entrepreneur.\nOnly thirty stations managed to survive. Educational broadcasting had\nreached its lowest ebb. ‘Phoue-thirty were lucky—and tough.\nHow as Si soman says, comes \"radioes second chance.\" With the advent of 20 non¬\ncommercial FM channels serious radio has a claim staked off. It is \"pey dirt\"\nbut it requires working—and intelligent working."
}