{
  "id": "d1275-1",
  "text": "NAEB RECEIVES USOE CONTRACT FOR STUDY AND CONFERENCE - BREITENFELD APPOINTED DIRECTOR\nA USOE grant to investigate the long range financing of educational tele¬\nvision stations has been announced by President Harley. The study will concentrate on\nidentifying factors in the development of a long range program for financing educa¬\ntional television stations. It will be inaugurated by a Washington Conference at\nwhich educational television stations across the country will be represented by\nmembers of governing boards and station managers.\nThe ETS Division has appointed Dr. Frederick Breitenfeld, Jr. as Project\nDirector for the seven-month study. Prior to this assignment. Dr. Breitenfeld\nwas a communications consultant at Cape Kennedy, and from i960 until 1963 he served as\na Program Administrator and Assistant Dean at Syracuse University.\nThe grant to the NAEB was made by the United States Office of Education\nthrough Title VII of the National Defense Education Act.\nSPECIAL PRODUCTION GRANT FOR EDUCATIONAL RADIO\nAmerica*s educational radio stations are invited to participate in a special\nprogram for creative non-commercial radio production in an announcement made last\nweek by Jerrold Sandler, Executive Director of National Educational Radio, the newly-\nformed radio division of the NAEB. In his message to NER members, Mr. Sandler ex¬\npressed the hope that proposals resulting from this initial grant of $8000 \"will start\na therapeutic stretching of educational radio*s collective imagination.\" He urged\nstations to give special thought to the challenge and opportunities facing educational\nradio today. \"We*re interested in fresh ideas...the best ideas we can all come up with.\nThese presently earmarked funds, from a grant made to NAEB by the National Home\nLibrary Foundation, will cover a broad range of subjects in public affairs, the arts,\nand the humanities. The announcement, inviting proposals from all member stations, will\nresult in production contracts delivered about November 15» Deadline for submitting\nproposals is October 10.\nGRANT FOR NEW EDUCATIONAL TELEVISION PROGRAM EXCHANGE\nPresident Harley announced the receipt of an $80,000 grant from the National\nHome Library Foundation of Washington, D.C. to enable the ETS Division to organize and\nestablish a national exchange library service for educational television stations\nthroughout the nation. There are now more than ninety ETV stations on the air\nwith many more expected during the next two years.\nLeonard Marks, President of NHLF, speaking for the Foundation Trustees said,\n\"By means of this grant we wish to indicate our faith in the ETV movement and our\nbelief that in the next few years it will show a remarkably healthy growth.\" The\ngrant provides $35,000 for 1964-65; $25,000 for 1965-66; and $20,000 for 1966-67,\nwith the stipulation that the finds for the latter two years will be matched.\nCommenting on the grant, ETS President Fletcher said, \"I am confident that\nthe matching provisions will be met shortly. This will mean a total of $125,000\nto assist us in launching this important and much needed service which will make\nselected non-credit programs and series available to any and all stations. We plan to\nselect a location for this new television library by the end of the year. This new\nsource of programing will be available during 1965*\""
}