{
  "id": "d862-106",
  "text": "BRIEF SKETCH OF THOMAS JEFFERSON\nThomas Jefferson was horn in Albemarle County, Virginia, on April 11, 17^3•\nFrom his father, Peter Jefferson, a substantial planter and a man of local promi¬\nnence, he inherited a considerable estate; and through his mother, Jane Randolph,\nhe was connected with one of the largest and most prominent families in the prov¬\nince. Until he went to the College of William and Mary at the age of seventeen,\nhe was privately taught, the most notable of his early teachers being Reverend\nJames Maury, who grounded him in the classics. In college he was introduced to\nscience by another unusual teacher, William Small, and for five years he read law\nunder the direction of George Wythe, the most noted law teacher of his generation\nin Virginia.\nJefferson began to practice law in 1767 and continued to do so until the Re¬\nvolution closed the courts, though he was chiefly supported by his farms. Public\nservice was expected of a man in his position and in 1769 he began to represent his\ncounty in the House of Burgesses. He continued to serve there until the beginning\nof the Revolution. Meanwhile, he began to build his famous mansion, Monticello,\nwhich was not finished in its present form until the first decade of the nineteenth\ncentury. On January 1, 1772, he was happily married to Mrs. Martha Wayles Skelton,\nwhose death ten years later prostrated him with grief. Only two of their children\nsurvived childhood: Martha or Patsy, and Mary or Polly. Four other children died,\nincluding one son (May 28 - June lk, 1777)*\nFrom the beginning of the struggle with the mother country, Jefferson was an\narden champion of the colonial cause. In 177^- he wrote a burning pamphlet, A Sum¬\nmary View of the Rights of British America, and in June, 1775, he began his service\nin the Continental Congress. In the course of this he drafted, in June, 1776, the\nDeclaration of Independence. He then served conspicuously (1776-1779) in the legis¬\nlature of his own state. He carried through the legislature a bill for the aboli¬\ntion of entails and was the leader of the fight to disestablish the Anglican Church.\nExperimental Discussion Program Subject to Revision\n9"
}