{
  "id": "d862-112",
  "text": "The quotation from Crevecoeur (\"What then is the American, this new man?\") is\nfrom his Letters from an American Farmer, published in 1782 though written earlier,\nand it has become justly famous. We are a little hard on Dickinson in having him\npoke fun at the word \"American.\"\nCongress did strike out the passage Jefferson originally inserted in the\nDeclaration in denunciation of the African slave trade, and the dehate followed\nmuch the line of his colloquy (in the program) with an unnamed gentleman, (inter¬\nestingly, the actor who played that part in the radio production was a direct\ndescendant of Jefferson, though a New Englander.) Jefferson's own indictment of\nslavery is based on a passage in his Notes on Virginia, written a little after\nthis date. (There are references to his own slaves and his attitude toward them\nin the program, \"The Return of a Patriot,\" in the printed version of The Jeffer¬\nsonian Heritage.)\nArgument\nThe first program sets the stage for the entire series, not merely by intro¬\nducing Jefferson as a person and giving (in his instructions for his tombstone) a\nsummary of his most memorable achievements, but also by presenting the general\ntheme that the ideas embodied by him and incorporated in the Declaration of Inde¬\npendence are living realities. We naturally begin with the Declaration, because\nthe history of the United States as a nation officially began with that. This\ndocument has a double significance:\n(1) It announced a political act, the severance of the tie with Great Brit¬\nain and the beginning of political independence, and it sought to justify this to\nthe American people and the world.\n(2) It was the charter of a new nation, embodying principles and ideals\nwhich American society has tried to attain and follow through the years. (As\nsuch it may be compared with the Virginia Declaration of Rights, which preceded\nit; the French Declaration of the Rights of Man and the Citizen, which followed it\nin 1789; and with the Universal Declaration of Human Rights of the United Nations.\n16"
}