{
  "id": "d862-128",
  "text": "of inequality, and lack of economic opportunity on the part of the overwhelming ma¬\njority of the people, which had no parallel In the United States, but he viewed\nthese problems in the light of the same philosophy. He was in no position to affect\nFrench policy, but this humane man revolved in his mind possible remedies. These\nwere long-range rather than short-range, preventive rather than surgical, and admi¬\nrably suited as they were to the American situation they may not have been drastic\nenough for France under the Old Regime. Things had gone so far there that, within a\nfew years, the greatest revolution of the age ensued. The remedies which he himself\nproposed, both in France and America, were based on a profound respect for property\n(as the servant but not as the master of man) and a desire to enlarge, not to cur¬\ntail, the area of human freedom. In France, however, he went a step further than he\nsaw any need to go at home. With amazing modernity, he suggested to his friend\nJames Madison a graduated system of taxation based on ability to pay. This, he be¬\nlieved, would tend to discourage vast accumulations of property in the hands of the\nfew, to the impoverishment of the many. By and large, however, Jefferson in his own\nage had a negative conception of the role of the government in economic matters.\nWhat he sought was fair play and an equal chance,without any special favors to any¬\nbody.\nIt was a philosophy which was well suited to his times in his own country; but,\neven then, there were those who thought him old-fashioned and narrow-minded in his\nemphasis on agriculture, as compared with commerce and,more particularly, manufactur¬\ning. These criticisms are voiced at the end of the recorded program and are best\nanswered by him in his final speech, which should be read with special care. He\nwould have preferred that America, with its abundance of land, be a vast Arcadia in\nwhich most people would be independent and self-sufficient farmers. Farming seemed\nto him the best life because it was the freest and produced the best citizens. In\nthat sense he was an agrarian,but he would have just the same dislike of farmers as\na pressure group as he would manufacturers. Commerce he recognized as a necessity,\nand he did much to further it. His objection to it, in comparison with agriculture,\nwas that merchants and shippers were less free, since they were subject to the whims\n3^"
}