{
  "id": "d862-132",
  "text": "have circulated through the years go back to this wretched journalist, and almost\nwithout exception they were false. The story of a slave mistress is the most noto¬\nrious, and it is wholly without foundation in fact. The religious attacks, which\nlargely emanated from New England, were very extreme and reflected no exact knowl¬\nedge of Jefferson's theology, but they can be partially explained on the grounds\nof passionate religious loyalty.\nThough Jefferson himself engaged in no punitive actions against his slanderers,\nhis followers did in one case - that of Harry Croswell, a New York journalist. Alex¬\nander Hamilton defended Croswell in the name of the freedom of the press. One of\nthe finest statements of Jefferson's philosophy on this subject is in his second in¬\naugural, which is extensively quoted in the radioscript. His letter to John Norvell,\nalso extensively quoted, has long been in print and has attracted a good deal of\nattention lately. In this connection, the dedication of The Papers of Thomas Jeffer-\nson (Princeton edn., Vol. I published in 1950) is specially pertinent. It is to the\nmemory of Adolph S. Ochs, long publisher of the New York Times, \"who by the example\nof a responsible press enlarged and fortified the Jeffersonian concept of a free\npress\". Jefferson would like that, but what he would say about some of the sensa¬\ntional columnists and radio commentators of our day is another question. If he were\nliving now, he might have more to say about the radio and television than about\nnewspapers, and it would be interesting to speculate about his judgment of their\nfreedom to discuss deeply controversial public questions.\nArgument\nThe provision in the first amendment to the United States Constitution, which\nis paralleled in the various state constitutions, that no law shall be passed \"a-\nbridging the freedom of speech, or of the press,\" joins freedom of the press with\nfreedom of speech. Actually, it is one aspect of freedom of speech. This program\nis centered on freedom of the press, rather than the larger question of freedom of\nspeech, chiefly for purposes of convenience and in order to make the discussion\nmanageable. Jefferson had definite experiences with newspapers, and these give us\na good starting point.\n38"
}