{
  "id": "d862-138",
  "text": "Program 6\nProgram Title: \"FREEDOM OF THE MIND\" or \"FREEDOM OF OPINION\"\nRecord Title: \"THE DANGER OF FREEDOM\"\nHistorical Background\nIn this program considerable historical license has been allowed the script¬\nwriter for dramatic purposes. At the very beginning the listeners are warned:\n\"This story is true in a way because it is false in a way.\" It centers in the dis¬\nputed presidential election of 1800-1801, which is a fact. The original electoral\nsystem was still in effect and under this each elector voted for two men, without\ndistinguishing between President and Vice President. The unexpected result in this\ninstance was the accidental tie between Jefferson and Burr, though nobody had ex¬\npected the latter to be anything but Vice President. The election was then thrown\ninto the House of Representatives, where the Federalists held things up a consider¬\nable time by throwing their votes to Burr. Meanwhile, there were efforts to extract\npromises from Jefferson, as a price of support. These are best summed up in the\nconversation between Jefferson and his rival in the campaign, John Adams. This\nactually occurred, though some of the details have been imagined. Adams does not\nappear at his best at this stage, but other programs serve to restore the balance\nin his case. Actually, he never went all the way with the extreme members of his\nown party - like Timothy Pickering, whom he eventually dismissed.\nMore important than the specific episodes, some of which are imaginary, are\nthe attitudes which are brought out. Jefferson speaks for himself and his most im¬\nportant speeches consist largely of quotations. If he should seem a little self-\nrighteous at any place, that impression was not intended. Many things entered into\nthe election besides the issue of freedom of opinion and the historians are still\narguing about its meaning. It is a notable fact, however, that in a period when a\nrepressive government was in power in Great Britain and Napoleon was creating his\n^5\nExperimental Discussion Program\nSubject to Revision"
}