{
  "id": "d862-139",
  "text": "own form of dictatorship after the French Revolution, the repressive party was de¬\nfeated in America and the most conspicuous advocate of freedom of thought and speech\nwas elected to the highest public office.\nBy this time the French Revolution had passed into an imperialist phase —much\nas the Russian Revolution has done in our own time, hence the issue of revolution,\nand attitudes toward it,had really become artificial. The general question of revo¬\nlution and Jefferson's attitude toward it will be taken up in the next program. One\nthing that may be pointed out here is that Jefferson's political enemies had done\ntheir best to stigmatize him as a Jacobin and revolutionary, using \"smear\" words\nfreely and reflecting on the patriotism of his party. Politicians follow the same\nsort of tactics in all generations, it seems, and there was no more reason to\nquestion the patriotism of either political party than there is now. The surest\nthing about Jefferson's administration, to anybody who really knew him, was that it\nwould not be a Reign of Terror, in which the government sought to impose its own\nopinions by law or force. His foes had tried to arrogate to themselves the mantle\nof patriotism, but to his admirers, then and thereafter, it seemed that he was the\ntruer champion of genuine Americanism.\nThe analogy between the situation then and now is close enough to be very sug¬\ngestive,but care should be taken not to carry this or any other historical analogy\ntoo far,since conditions are never identical. The overwhelming historical opinion\nis that the fears of \"foreigrf ideologies and domestic subversion at that time were\nhysterical. The present situation and present danger must be judged on its own\nmerits. One thing seems sure, however, psychological attitudes have an extraordi¬\nnary way of repeating themselves in comparable situations.\nArgument\nThe radioscript on which this program is based differs greatly in form from\nJefferson's monologue on the freedom of the press. That was a solo, while this is\na medley of themes. Some of these have been heard previously, and certain famous\nsayings reappear. If any person should find the medley confusing he may be reminded\nthat the various freedoms hang together;they are parts or aspects of the same thing.\nh6"
}