{
  "id": "d862-140",
  "text": "The setting in this instance is political (the disputed presidential election\nof 1800 - l80l), and the Alien and Sedition Acts again appear. Attitudes toward\nreligion and unconventional religious ideas also enter into the story. What we have\nhere is a series of incidents that were designed to illustrate Jefferson's insist¬\nence on freedom of opinion in all fields - politics, religion, philosophy and every¬\nthing else. He did not draw the line anywhere, and whether we speak of freedom of\nopinion, or freedom of intelligence, of freedom of speech, it is all the same. The\nright of every individual, through the exercise of his own mind, to arrive at his\nown opinions, and to express them freely lies at the heart of the Jeffersonian phi¬\nlosophy. His own particular political and economic ideas are inevitably dated, and\nit would he strange indeed if they could he applied without change to the conditions\nof another age. But the right of every man to hold and express his own opinions\nwithout any sort of external coercion is precisely the same in the middle of the\ntwentieth century as it was 150 years ago.\nIn his own time he believed that America differed from Europe not only in the\nfreedom it offered men to govern themselves and avail themselves of economic oppor¬\ntunity, hut also in the freedom that it offered to their minds. If he were living\nnow he would loathe Communism for many reasons, hut its tyranny over the opinions of\nmen, its enforcement of a rigid uniformity of thought, would probably he the first\nof these. The reasons for his implacable hostility to every form of tyranny over\nthe minds of men are implicit in the recording, hut may he stated more explicitly\nhere, (l) All other forms of tyranny depend at last on this one. Tyranny and dis¬\nsent cannot live together, and where dissent is stifled tyranny can reign. (2) The\nprogress of the human race is contingent on freedom of thought and investigation.\nThe history of scientific progress in recent generations is an effective demonstra¬\ntion of this;and it is a commonplace of history that many of the orthodoxies of to¬\nday were the heresies of yesterday.\nSince the relation of the freedom of the mind to human progress has already\nbeen discussed in the program on Scientific Freedom, and will he referred to again\nin the program entitled \"Man's Right to Learn,\" it seems desirable in the present"
}