{
  "id": "d862-148",
  "text": "Argument\nOur history as a nation began with the American Revolution, which was a cur¬\ntain raiser to the French Revolution, and Jefferson was the author of our mani¬\nfesto, the Declaration of Independence. We ourselves are living in what is prob¬\nably the most revolutionary age known to recorded history, and in a considerable\nportion of the world men have appealed to the Communist Manifesto. Much can be\nlearned by comparing these two revolutionary movements, in their theory and prac¬\ntice. The subject is vast and opinions about historic events differ, even among\nscholars, but distinction can be made between revolutions.\nIn this program the effort is made to distinguish between the historic rev¬\nolution of the American sort, and the contemporary revolution of the Communist\nsort. This is done by means of an examination of Jefferson by a Commissar, who\nkeeps trying to prove that the author of the Declaration of Independence is on\nhis side. The subject is difficult and at times the dialogue may be confusing to\nthe listeners. The Communist would not be in character if he did not try to trick\nthe American spokesman into a damaging admission, and Jefferson would not be\ntrue to history if he denied being as much of a revolutionary as he actually was.\nIt would be foolish to deny that he and the other Patriots of 1776 proclaimed a\nrevolt against authority; but there were very significant differences between him\nand modern Communists.\nWhat we are giving here, in dialogue, is an interpretation of great historic\nevents, without going into confusing detail. Therefore, the main points have to\nbe stated rather dogmatically.\nThe American Revolution was a revolt against foreign rule. In 1776 our fore¬\nfathers were not terrified by the word \"revolution\" as many Americans of today\nare, but this might just as well have been called the War for American Independ¬\nence. It was supported by men of various shades of opinion who were united by\ntheir common desire to attain national self-government. They wanted to manage their\nown affairs, political and economic. Similar motives can be seen in the various\nnationalist movements of our own time which have been directed against imperial-\n56"
}