{
  "id": "d862-15",
  "text": "FROM:\nTHE NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n2500 Municipal Building\nNew York 7, N, Y,\nFOR RELEASE: AUGUST 25th, 1952\nThe great ideals of our American democracy that found expression\nin the life and writings of Thomas Jefferson will be translated into living\nterms through the medium of radio in a series of programs on \"The\nJeffersonian Heritage\", which soon will be heard by listeners in this area.\nBeginning September 14th, 1952, over the educational radio stations\nof America, the National Association of Educational Broadcasters will\npresent a thirteen-week series designed to explore in lively and enter¬\ntaining fashion the principles that made Jefferson symbolic of America\nand that found vivid expression in his writings, notably the Declaration\nof Independence.\nSeymour N. Siegel, President of the NAEB, predicted that ,rThe\nJeffersonian Heritage\", from the first program through the last, would\ninform, entertain and educate. The \"Heritage\" series, he said, would\nnot be biographical, but would seek to recreate Jefferson as a living\nvoice, his ideals as living ideals, and his principles as enduring qualities\nthat should guide men of the present day.\nToday, Mr. Siegel said, there is a tendency to look upon the acts,\nwords and motivating forces of Jefferson and others of our founding fathers\npurely as history. By means of the forthcoming radio programs, the NAEB\nPresident explained, it is hoped to bring to vibrant life with real dramatic\nfire, the thoughts that Jefferson expressed and the principles he espoused.\nRadio, Mr. Siegel said, is the ideal instrument for recreating the tensions\nand trials that produced Jefferson and many of his great contemporaries.\nThe first of the thirteen-week series, entitled \"The Living Declaration\",\nwill launch the story of Jeffersonian ideas, stemming from the Declaration\nof Independence and running through all of American history.\nThe presentations on \"The Jeffersonian Heritage\", together with\nother series of programs that will follow, have been made possible under\na $300, 000 grant from the Fund for Adult Education, established by the\nFord Foundation. George Probst, of the University of Chicago is Chairman\nof the special Adult Education Committee of the NAEB, which has planned\nand will produce the \"Heritage\" and later series.\nThe programs will be broadcast by member stations of the NAEB Tape\nNetwork, a cooperative organization devoted to the dissemination of out¬\nstanding radio programs. The series will be made available also to the\nUnited Nations Radio, The Voice of America, The British Broadcasting\nCorporation, The Canadian Broadcasting Corporation, the Australian\nBroadcasting System, The New Zealand Broadcasting System, and All-\nIndia Radio.\nThe programs are to be made available to commercial station operators\non a sustaining basis, and it is expected that at least one series of those to\nbe produced will be broadcast over a national network.\nIn addition to \"The Jeffersonian Heritage\", other contemplated series\nare \"The Ways of Mankind\", \"People Under Communism\", and \"The\nPeople Talk Back\".\n30"
}