{
  "id": "d862-158",
  "text": "Program 9\nProgram Title: \"MAN'S RIGHT TO LEARN\"\nRecord Title: \"THE UNIVERSITY OF THE UNITED STATES\"\nHistorical Background\nAt the University of Virginia they still speak of Jefferson's looking through\na telescope from Monticello as the bricks were being laid, and one of the most\nprominent buildings in the University was named for Cabell, his most important col¬\nlaborator. This institution was the beloved child of his old age; the plan and\nbuildings represent his chief title to architectural fame; and, as the saying goes,\nthe people there still speak as though he were in the next room. In his own state\nhe got the apex of the educational pyramid before he got the broad base he wanted,\nand there were some people at the time who charged him with indifference to the\ngreat body of the people in his old age. Hence the flashback in the radio program\nto his earlier proposals and struggles. In his Bill for the More General Diffusion\nof Knowledge forty years earlier (l779)he had outlined an entire educational system\nfor Virginia, and it was this that gained him the title of major prophet of public\neducation in the United States.\nAs the text says, the story of events is freely reconstructed, so as to bring\nthe events and arguments of a considerable period into a Single debate. In es¬\nsentials, however, the story is quite correct. His bill was passed in a truncated\nform years later,when he was no longer in the Assembly, and his fears that the pro¬\nvision leaving matters to the individual counties would defeat his purposes were\nfully realized. There were some further provisions for common school education in\nthe state before he died, but there was no comprehensive system. Comprehensive\nsystems were afterwards worked out in other states, especially in the Middle West,\nbut without the selective features which he had included.\nIt was only after his own full retirement from public life in 1809 that he was\nExperimental Discussion Program Subject to Revision\n67"
}