{
  "id": "d862-159",
  "text": "able to.turn his attentions again to public education. The University of Virginia\nwas chartered in 1819 and Jefferson was its first Rector, that is, Chairman of the\nBoard. It had no President until 1904, being administered wholly by the facility.\nThere is an abundant literature on Jefferson's educational activities, and some of\nthis is referred to in the \"Suggestions for Reading.\"\nArgument\nIn no other field except science have the ideas and hopes of Jefferson come to\nsuch rich fruition as in education,and nowhere else does he appear more clearly and\nunmistakably as a major prophet. Some of his ideas are now so widely accepted that\nwe largely take them for granted, not realizing how strongly they were challenged\nin his own day - when, actually,he was able to carry them into only limited effect.\nThough his thoughts and actions are of interest to any teacher or scholar, in any\nsort of school, he addressed himself chiefly to public education.\nHis basic idea was that the education of all the people is the responsibility\nand the necessary function of the state. The fundamental reason why this responsi¬\nbility must be assumed is that education is a corollary of political democracy, and\nthat without an intelligent citizenry freedom and self-government cannot be pre¬\nserved. The state has to assume it because no private agency can take on so vast a\ntask. In his own day Jefferson was fearful lest education should fall into the\nhands of particular religious^groups. His anti-clericalism did not spring from hos¬\ntility to religion, but arose from his fear that particular sects would try to uti¬\nlize education for their own advantage as religious organizations. As we saw in an\nearlier program, he was especially fearful of any sort of alliance between church\nand state. Certain religious groups resisted the idea of public education in his\nday, and continued to do so in many of the older states after his death. It was in\nthe newer states, especially in the Middle West, that the idea of public education\nwas most fully accepted. Even in the older states, however, religious objections\nwere most effective in the field of higher than in elementary education, because of\nthe inability of any single religious group to provide for the training of all the\nchildren in a state.\n68"
}