{
  "id": "d862-161",
  "text": "program). Jefferson would never have said that the state owes every hoy all the ed¬\nucation he wants at every stage, regardless of his abilities;and he would have been\nhorrified by the thought that universal education would result in the lowering of\nstandards everywhere. He did not want to put an intolerable financial burden on\nsociety or to make a travesty of education. Some undiscriminating enthusiasts for\nuniversal education in a democratic society may tend to reduce it to an absurdity,\nbut Jefferson,whose faith kindled that of so many others, was discriminating. Many\neducational leaders of our own time have recurred to his emphasis on selection; and\nthe application of tests of fitness during the post-war rush to the colleges and\nuniversities was quite in line with his thought. The result was that sons and\ndaughters of the rich frequently failed of admission, while able youths from poor\nfamilies gained it. Jefferson himself never questioned the right of well-to-do\nparents to give their children as much education as they were willing to pay for; but\nhe believed that education at public expense should be based on considerations of\nprobable public usefulness.\nTimes have changed so much since his day that his views on the content of edu- t\ncation are no longer of major interest: and his views on higher education enter\nlittle into the radio program. Probably there never was an American public man with\ngreater faith in knowledge, and he valued no freedom beyond freedom to learn. As\nhe says in the radio script, the University he had fathered was to be based on \"the\nillimitable freedom of the human mind to explore and expose every subject suscepti¬\nble to its contemplation.\" There is no possible doubt of the stand he would take\non academic freedom. If there are those in our generation in America who make a\nveritable religion of universal education and are at the same time distrustful of\nscholars and intellectuals, Jefferson would find them incomprehensible. Faith in\nthe human mind was central in his philosophy; and it seemed to him that the surest\nway to impose tyranny on men was to restrict the operations of intelligence.\nQuestions and Topics for Discussion\n1. Would you say that the idea of universal public education is accepted in all\nparts of the United States today? If not, what are the exceptions?\n70"
}