{
  "id": "d862-17",
  "text": "- z -\nThrough the narrative of the new radio series, it is hoped to show\nthat the principles enunciated by Jefferson and other great men of our\nhistory, which may have lost meaning for many persons because of\ntheir familiarity, were outlined in words actually spoken by living human\nbeings at particular times and places.\nTo a public that, largely because of the Jefferson Heritage, selects\nits own government and thereby helps to work out the destiny of its own\nland, the NAEB dramatic offerings will make an effort to bring home the\neternal Jeffersonian truth that ’’The earth belongs to the living generation *.\nHence, it is felt, it can be assumed that contemporary radio listeners\n--a cross-section of the voting public -- will be easily stimulated to learn\nwhat men have done with Jeffersonian principles over the years and what\nis being done with these principles now.\nAs a mirror of the trend of historic thought and action from an early\nAmerican predominantly agricultural society in an age of slow transpor¬\ntation and relative physical isolation to a contemporary industrial society\nclosely interlocked with the rest of the world, the NAEB programs will\nstrive to reflect the American ideology as Jefferson saw it. This\nideology is that human considerations come first and that the sanctity\nof the personality and freedom of the mind are the most precious of\nhuman possessions.\nCommenting on the ’’Jeffersonian Heritage\" series of radio programs,\nMr. Probst said:\n\"We are engaged in producing programs of the quality of rHenry V',\nor Sherwood's 'Abraham Lincoln in Illinois', or MacLeish's 'The Fall\nof the City'. We are trying to produce programs that are 'consumer\ndurables'. We are trying to produce programs that can be rebroadcast\nten or twenty years from now to both our satisfaction and the satisfaction\nof the listener.\n\"We are doing this really against the w'hole current of American\nwriting and American commercial radio, which are devoted to the\nproduction of programs that are really 'consumer perishables' ---\nAt no previous time in American radio has there been an occasion when\nanybody had the funds, or thought it was worthwhile to try to create an\noutstanding series of programs about Jefferson, or about any other out¬\nstanding American\n-30-"
}