{
  "id": "d862-28",
  "text": "; RELEASE NUMBER 5\njntoM: Radio Station WXXX\nAddress\nTelephone\n(Date of Release Issuance)\nFOR RELEASE: (DATE)\nJEFFERSON’S RETURN TO AMERICA DRAMATIZED ON STATION WXXX\nA dramatization of Thomas Jefferson's return from France\nand hie acceptance of the Secretaryship of State of his own country is\nportrayed in \"The Return of a Patriot\", fifth, in a radio series, \"The\nJeffersonian Heritage\". The sketch, with the noted actor Claude Rains\ntaking the part of Jefferson will be heard -- (date) -- over Radio Station\n-- (name) --at -- (time)\nWith the four preceding episodes in the \"Heritage\" series\nalready enthusiastically received by a representative cross-section of\nradio listeners, Seymour N. Siegel, President of the National Association\nof Educational Broadcasters, producer of the series, predicted that\nThe Return of a Patriot\" would draw an even wider listener response,\nMilton Geiger has written and Frank Papp has produced\nand directed the new episode, whose central idea is public responsibility --\nthe subordination of personal preference to the general welfare. In the\nunfolding of the story, we see how Jefferson's own record of service,\nsupplemented by the individualism of his philosophy, in itself constitutes\na priceless legacy to his country.\nThe new episode has a music score composed and conducted\nby Wladimir Selinsky, The narrative is based on research, writings and\nadvice of Dr. Dumas Malone, Professor of History at Columbia University,.,\nwho provides a running commentary for the dramatization.\nSummarizing the doubts that assailed Jefferson when George\nWashington offered him the Secretaryship of State, the commentary in\nthe new episode says:\n\"Thomas Jefferson, the First Citizen of Albermarle, did\nnot know yet where duty would lead him. But in the region of his birth,\nthis traveler just returned from a continent in the first throes of revolt\nagainst oppression (France), renewed his allegiance to the holy cause\nof freedom, while announcing his undying faith in the sufficiency of\nreason anA his r*>Hance or, the will of the majority. \"\n30"
}