{
  "id": "d862-36",
  "text": "RELEASE NUMBER 13\nFROM: Radio Station WXXX\nAddress N\nTelephone\n(Date of Release Issuance)\nFOR RELEASE: (DATE)\nCOLUMBIA UNIVERSITY PROFESSOR DISCUSSES\nTHOMAS JEFFERSON ON RAJDIO STATION WXXX\nFor the past twelve weeks. Radio Station --(name) -- has been\nprivileged to present a thoroughly mature and adult, yet entertaining,\nhistorical radio broadcast series on \"The Jeffersonian Heritage\". The\nseries has dramatized Thomas Jefferson’s principal acts and his views\non politics, philosophy, education, liberty, revolution and a variety of\nother issues and realities that helped to make this nation great.\nOn -- (date) -- at -- (time) -~ Radio Station -- (name)\nwill present a summing up of the entire series, \"What the Jeffersonian\nHeritage Means Today\", by Dr. Dumas Malone, Professor of History at\nColumbia University, upon whose research, writings and advice the entire\nJefferson series has been based.\nDr. Malone is thoroughly qualified to explain the significance\nof the series, and do it in a lively and entertaining manner, because in the\namassing of his material he has thought Jefferson's thoughts and thoroughly\nimmersed himself in the writings and expressions of philosophy in which\nJefferson translated himself to his fellow-man, not only of his own era,\nbut of all eras.\nWhen the distinguished motion-picture actor, Claude Rains,\nwas speaking the lines ascribed to Thomas Jefferson, he actually was\nJefferson. Dr. Malone provided the raw material to make him so, while\nMilton Geiger and Morton Wishengrad,wrote the lines that made Jefferson\ncome alive again. Frank Papp produced and directed the series, with\nmusic composed and conducted by Wladimir Selinsky.\nAll of the episodes have been authentic in historical spirit\nand imaginative in form. Against a background of some of the most\ninspirational chapters of our nation's story, the programs have sought\nto dramatize ideas which are the enduring possessions of all Americans,\nall free peoples."
}