{
  "id": "d862-9",
  "text": "THE JEFFERSONIAN HERITAGE\n”The Jeffersonian Heritage,” which had its premiere at 1 o'clock yesterday\nafternoon over the city's station, WNYC, is an event to gladden the hearts of all\nthose who believe the microphone and camera have a broader destiny than purveying\nvaudeville and commercial announcements*\n”The program itself promises to be a brilliant radio series bringing to light\nthe ideas of Jefferson and underscoring their timeliness and pertinency in 1952.\nWith a poignant simplicity and disciplined g randeur the opening installment of this\nseries dealt with Jefferson's trials in drafting the Declaration of Independence\nand then quietly put the telling question to all of U3: What is our generation doing?® ••\n11 The production of 'The Jeffersonian Heritage® was of the highest network cal¬\niber* To liis interpretation of Jefferson, Mr. Rains is bringing forcefulness leavened\nby humility....The Educational Broadcasters have not stinted in other departments\neither 8 Wladimir Selinsky has provided an eminently helpful score-..and Frank Papp!s\ndirection is plain and knowing.” {Jack Gould, New York Times, Sept. 15* 192£)\n\"The Jeffersonian Heritage” is a 13-week half-hour series dealing with the life,\ntimes, principles and philosophy of Thomas Jefferson. However, its purpose is net\nbiographical, but rather to show how Jeffersonian ideals have guided generations of\nAmerican statesxnent up to the present day. In line with this aid, the initial pro¬\ngram, 'The Living Declaration,8 reviewed, spotlighted Jefferson's part in writing of\nDeclaration of Independence.\n”The entire aeries is based on the research, writing and advice of Professor\nDumas Malone, of Columbia University*... .Producer-director, Frank Papp, has show¬\ncased the professor’s material in laudable fadi ion, with VJladimir Selinsky3 s majes¬\ntic background music particularly impressive* However, major credit for the series*\nsuccess belongs to actor Claude Rains.....\n”The first show in the series registered maximum audience impact, via Jeffer¬\nson’s vain attempt to have an anti-slavery clause written in the Constitution and\nRainA* convincing explanation of Jefferson's tolerant religious views.”\n(June Bundy, Billboard, Sept. 20, 1952)\n'‘Radio's evaluation of Thomas Jefferson's contributions to the free world—the\nhighly touted series produced by the National Assn, of Educational Broadcasters un¬\nder a grant from the Ford Foundation—got away to an impressive start (Sunday, Sept.\n14), to suggest that this series will have steady, and sharpened impact*\n”A little pretentious and self-conscious in its scripting at the very start,\nthe premiere program got 5.nto proper dramatic focus very soon, however, by virtue\nof its subject matter and Claude Rains* fine performance as Jefferson* The meat\nand sincerity in this program, the easy though serious way in which it was presented\nas wall as the sterling quality of the acting performances, type this as a highly\nimportant series. It should be ‘must5 listening for adults as well as all schoolrooms.\n\"Program was a combined narration-dramatization format, which had drama, bite,\nand vigor.” (Variety, Sept. 17, 1952)\n\"The NA£B should be mighty proud of the job producer Frank Papp and his staff\ndid on their 8Staffers onian Heritage* series. The quality of production and script\nare radio at its almost forgotten best—reminiscent of the glorious days of the\nold Columbia Workshop..*.” (Ted Green, Radio Daily, Oct. 21, 1952)"
}