{
  "id": "d590-105",
  "text": "naeb headquarters\n14 Gregory Hall\nUrbana, Illinois\nTO? NAEB BOARD OF DIRECTORS, 1959 and I960 CONVENTION COMMITTEES\nFROM? Harold E0 Hill\nDATE; January 13, 1959\nBelow, as collated by our \"retiring\" secretary, FfrSo Judith Gans, are the results\n©f the questionnaire which was sent to all those who attended the recent Omaha\nconventiono We have found information of this sort t© be quite helpful in planning\nconventions, because it provides the \"planners\" with first-hand information about\nwhat those attending the convention would like to have0 We believe the 1959 and\nI960 committees can use this information to advantageD\nThe returns this year were fewc Out of the 227 or so people listed on the registra¬\ntion sheet, only 92 questionnaires were received at Headquarters0 The results are\nlisted belows\nlc HOW WOULD IOU CLASSIFY THE CONFERENCE?\n2 So-So\nJ Dicin'* t Answer\nVery Successful\nModerately Successful\nComments were?\nThere was too much ©f a gap between the \"oldtimers\" and the \"newcomers\" and\nit was suggested that in the future newcomers be issued distinguishing badges„\nGiving these badges to the oldcomers, as was the case at the Convention in\nOmaha, doesn’t help the newcomers in the leasto Other than that, the ge.<?ral\nconsensus was that it was pleasant meeting everyone and socially the convert\nticn was a huge success„\nWith the exception of 6 people (2 said it was too long, 2 said tocjmuch was\nplanned at the same time, 1 thought it lacking in inspiration and 1 thought it\njust plain dull), nearly everyone returning a questionnaire commented on the\nwonderful organization of the convention and mentioned it was certainly worth-\nwhileo\nTwo persons thought the speakers goodo The majority however, didn’t agree0\nOther opinions were \"radio still slighted,\" \"need more meetings relating to\nspecific problems,\" and \"too much time spent in political maneuvering0\"\n20 WHAT DID YOU FEEL WAS THE MOST EFFECTIVE PART OF THE CONVENTION (IN ORDER OF\nPREFERENCE)\n~60 Business Sessions\n231 General Session Speakers\n215 Informal Discussions\n217 Briefing Sessions\n17 Other"
}