{
  "id": "d590-108",
  "text": "/\nTo: New NAEB Board Members\nGraydon Ausmus\nKeith Engar\nRaymond Burlbeit\nJames Miles\nJohn Schwarzwaider\nDuff Browne\nKenneth Harwood\ncc: 'William Harley\nJack McBride\nRobert Schenkkan\nRobert Coleman\nFrank Schooley\nE. A. Hungerford\nDate: January 13, 1959\nHerewith, as backgrounding on particularly our Kellogg and Hill-Elliott relations,\nare recent requests and documents on those subjects, as listed at the end of this\nnote.\nYou will also, in a few weeks, receive the budget report of our financial status\nas of December 31, for Headquarters and the Network. The general fund report,\non monies handled by NAEB Treasurer Bob Coleman, will probably first be dis¬\ntributed on or about dates adjacent to the IERT (May 6-9), which is when the\nnext NAEB Board meeting will be held. The exact date will be announced later.\nSince the two regular Board meetings of the NAEB each year are held in connec¬\ntion with the IERT, »r»d at our own Convention, the NAEB does not attempt to pay\nthe full travel expenses of Board members for these meetings. There is $1,500\nbudgeted as a travel item for cases where the Board member would otherwise have\nto travel at his personal expense. In such cases, up to the limit of funds avail¬\nable, we have, where necessary, paid travel for the Board member(s) concerned\nto either the IERT (Columbus), or the NAEB Convention.\nAt present, of the $1,500 budgeted from Headquarters (Kellogg) funds, there Is\na balance of only $398.18, due to the special board meeting held last June (vou¬\nchers were not received and processed until after July 1, which was in the\npresent fiscal year). If you will definitely need to have your expenses to jither\nColumbus (in May) or Detroit (in October) during the current calendar yea paid\nby the NAEB, please let us know as soon as possible. If necessary, the Board\ncan, if it feels this necessary or desirable, obligate reserve funds fron the Non-\nKellogg budget (described below), administered by ’Dreasurer Robert Coleman, for\nthis purpose."
}