{
  "id": "d590-113",
  "text": "Form NDEA-VII-1\nBudget Bureau No. 51-R281\nApproval expires February 28, 1959\nU.S. DEPARTMENT OF HEALTH, EDUCATION, AND WELFARE\nOffice of Education\nWashington 25, D.C.\nINSTRUCTIONS FOR PREPARATION OF APPLICATIONS FOR GRANTS TO SUPPORT\nRESEARCH PROJECTS UNDER THE PROVISIONS OF TITLE VII OF THE\nNATIONAL DEFENSE EDUCATION ACT OF 1958\nUnder the provisions of Title VII of Public Law 85-864, 85th\nCongress, grants-ln-aid may be made to public or private non-profit\nagencies, organizations, and individuals for research and experimen¬\ntation in more effective utilization of television, radio, motion\npictures, and related media for educational purposes* Such research\nand experimentation must be of value to State or local agencies in\nthe operation of public elementary or secondary schools, and to\ninstitutions of higher learning, and may include the development of\nmore effective techniques and methods—(1) for utilizing and adapting\nmotion pictures, video tapes, and other audio-visual aids, film¬\nstrips, slides and other visual aids, recordings (including magnetic\ntapes) and other auditory aids, and radio or television program\nscripts for such purposes; (2) for training teachers to utilize\nsuch media with maximum effectiveness; and (3) for presenting\nacademic subject matter through such media.\nGeneral Instructions\n1* Methods of applying. The first page of the application must show\nthe following information in the order indicated:\nAPPLICATION TO THE COMMISSIONER OF EDUCATION, U.S. OFFICE OF EDUC.\nDEPARTMENT OF HEALTH, EDUCATION, AND WELFARE, FOR A GRANT TO SUPPORT\nA RESEARCH PROJECT UNDER THE PROVISIONS OF TITLE VII OF THE\nNATIONAL DEFENSE EDUCATION ACT OF 1958 (P. L. 85-864)\nSubmitted bv:\nAddress:\nTelephone number:\nInitiated by:\nTransmitted bv:\nDate:\n(Name of institution or agency)\n(Address of institution or agency)\n(Telephone number of institution or agency)\n(Full name and position of the individual who !k\nInitiated the project, ordinarily the director\nor chief investigator)\n(Full name and position of the official who is\napproving the transmittal of the application.\nThis must be someone in a position to assume such\nauthority and to commit the Institution or agency\nto the undertakings projected in the proposal)\n(Date of approval)\nIn addition to the typed names, the proposal should be signed\nby both individuals on the original or master copy."
}