{
  "id": "d590-114",
  "text": "2\n2. Mailing address for applications; Send all applications directly to;\nProgram Consultant\nNew Educational Media Branch\nOffice of Education\nU.S. Department of Health, Education, and Welfare\nWashington 25, D.C.\n3* Length of application* Normally an application runs from six to\neight pages in length. It should not exceed 12 pages except in\nexceptional cases.\n4. Number of copies required. The application should be typed or\notherwise reproduced on white paper of standard size on one side of\nthe sheet. Since all applications are submitted to the Advisory\nCommittee on New Educational Media for review, 30 copies are required*\n5c Suggestions* It is desirable that the applicant submit an appli¬\ncation as soon as it is prepared in order to allow as much time as\npossible for processing. There is no need for the application to be\naccompanied by covering letters or other communications endorsing the\nproject*\nOutline of Content\nFollow the outline given below in describing the proposed\nproject so that the Advisory Committee may have adequate information\nupon which to base an objective evaluation. In preparing the des¬\ncription, identify each section by using the number and the under¬\nlined words in each item given below:\nI* Project title. The title should be concise, descriptive, and\nspecific as possible. Avoid technical terms that are obscure.\nII* Problem* Give a brief statement of the problem. Explain its\nimportance in the field of education and explain the significance of\nthe proposed research. Briefly review other related research, citing\npublications, and suggesting ways in which the study proposed will\nadvance knowledge in the field.\nIll* Objectives* State the specific questions to be answered or the\nhypotheses to be tested.\nIV. Procedure* Describe clearly the proposed plan of attack. (The\nfollowing information will not apply in those cases where the proposed\nresearch does not fall within the category of controlled experimentation\ninvolving standard statistical procedures.)\na* General method and/or experimental design*\n1* Controls. If one or more control groups are involved,\nindicate their origin, composition, and purpose*\n2* Sampling plan and procedure* Describe the population\non which the study is to be based and tell how the\nsample is to be taken*"
}