{
  "id": "d590-131",
  "text": "Again, thanks for the letter* I expect to make a few mistakes but I\nshall make no move of any significance until I have checked with\nseveral other people to get a reaction. One of the reasons I'm coming\nto Urbana before going to Chicago is to talk with you, Jim, and Wilbur\nbefore the meeting with Fletcher. I shall expect always to move only\nafter advice of the people in whom I have confidence, and you three\nare at the top of the list in that category—so just bear in mind the\nresaponsibility you have for the organization. Fletcher was damned\nupsefi by the film exchange deal and VanDuyn was too-However,\nI pointed out to VanDuyn that this is temporary and assured Bob Hudson\nof the same thing. Si is entirely amenable to the moving of it to\nthe headquarters operation or to the Ford Center. I knew when we\nvoted to establish the deal that it would stir up some antagonism—\nbut I still think it was a good move* because it shows we are not\nsitting on our hands, it makes both foundations more aware of the\nneed for getting something done, and it puts up is a position of\nhaving them come to us with a proposal that is better. Fletcher's\nfeelings can be soothed on this score and no damage will be done.\nOne of my big concerns at the moment is whether the film distribution\nof NAEB produced TV shows should be from the Headquarters operation\nor out of the Chicago Ford Center. I had assumed the former but there\nis every evidence that the FAE boys think we agreed to have them\ndistributed from the latter. Wish you'd talk to Wilbur about this\nand give me his reaction when I get in there on the night of D^c. 2—\njust in case I cannot see him while I'm there. (In case he is to\nbe out of town.) The reaction I get from Bob H., George, and others\nis that Ford now thinks of the Center as the distribution center for\nboth radio and TV materials produced under the FAE $80,000.00 grant.\nThis is one of the deals to come up in Chicago. Frankly, it looks\nto me that we may have a few rough minutes at that meeting.\nMust get out for a luncheon meeting with Cedrifl Foster. Give me a\ncollect ring if you have any good reactions to the above which I\nshould be considering. If Wilbur is to be out of town on the\n2nd. and 3rd. I'll talk to him by phone before I leave here.\nMy best to you.\nSincerely,"
}