{
  "id": "d590-27",
  "text": "■5-\nBeqi»gr£ #2\nwould be published laoraaslngly as mi es^sasiua ef the present HASS Bessarab\nFeat Sheet Service* Free ashsoKlptioos to the Jomaal aac! fmmMtter would be\nvldad selsotiv®^, at firsts to leatog ^uaatars aid other oplMflc leaders* Tbs\nsmfoerehip of the RAEB vcuM be greatly ©speeded this* inereaeed esd a\ngeoeral daering bouse for the distribution of sossntial materials m& ini&smtSm\nwaUd be es&gbllstod*\nAn Izapcrtast remat espeat&d ffceen this project is the siimhis it would give to\nefforts of the NAEB to become mope sod mew® ©slf-smipcstiiig. One of the most likely\nsasreo® of revenue is the sale of our periodicals sud other publications* This\ngrant would permit the up-grading of proeeut publications, to a point where the deseend\nfer them Should Increase significantly The income froa such publication and diets*'-\nbutton efforts oust bacons an incra-Mingly iaparteit factor In the NffiB'o budget.\n(3) International Relational tha HABB has been wy active In tha field of inter¬\nnational exchange of broadcasting personnel, Inf cassation and program*, and it la felt\nthat, its activity la thin area mat ha incraaeed in vim? of the growing need for inter-\nnational understanding, and tha Increased requests for? assistance from 0. S. governasat\nagencies as veil aa foreign broadcasters directly. The activities so far engaged in\nhave not begun to Met the need adequately. They have only beam passible tbrajgh the\ngenerosity of foreign broadeasting systems {gray of when proudly display MSB citations\nin their Easrcpean atflcea} end the availability for uevi’aX years of Fulbright Scholars,\nrepresenting educational broadcasting, who were able to represent the NAEB at Important\nintemationsl bscsdeasting meetings, Although the TIASB holds memberships in the\nEuropean Broadcasting Odea, the International ttaivwsity of tha Mr, and Prlx Italia,\nactive participation of the type requested, or representation by the specialists who\nwould show the U. 3, up to tha beat advantage, has been impossible du® to the lack of\nfunds."
}