{
  "id": "d590-55",
  "text": "5\nConsultants will include recognized educational leaders; broadcast producers\nand teachers who have been eminently successful in the instructional uses of\n^ these media; curriculum coordinators and administrators from institutions current-\n, Vo ly using the media successfully; content and subject matter specialists who will\nable to bring new and different ideas and problems to the group; and qualified\n^ research specialists to make sure that valid experimental design and report pro¬\ncedures are built into each workshop.\nb. Data: In planning the program for these workshops, data will be gathered\nfrom institutions using the broadcast media for classroom instruction in order\nto determine what is currently known about which subjects may best be taught by\nthese media, production techniques that have proved most valuable, the proper\nbalance between broadcast instruction and instruction ly the classroom teacher,\nand other such problems, as listed under item (s) hbove« This information will\nthen be used as a basis for further experimentation, demonstration, and study\n, at the workshops. The workshops themselves will supply definitive answers to\nmany of the problems raised in II above, and these will be published, as indicated\nin (f) below, for wider dissemination.\nc. Methods of statistical or other analysis: A careful analysis and evaluation ^ v y\nV ’ r\nwill be made during and after each workshop, of the techniques and problems\nstudied and experimental solutions developed, in order to determine which are\nmost practicable for instructional broadcasting. This will result in information j\nand data which can then be used by others in the field so that they may make\nmore effective use of the media. Although primary emphasis will at first be\ngiven to television, some of the workshops will be devoted solely also to radio.\nand others will develop complementary uses of the two media.\nd. Approximate time schedule: A total of 12 workshops will be held, fcur each\nsummer in 1959, I960, and 1961. The staff to plan and conduct these workshops\nwill be hired within 60 to 90 days after the receipt of the grant, to permit"
}