{
  "id": "d590-56",
  "text": "6\nample time for proper planning. The staff will also be needed for several\nmonths after the last workshop to evaluate results and prepare reports.\ne. Expected end-product: The result of these workshops will be the development\nof a central body of knowledge and personnel to make possible better utilization\nof television and radio for classroom instruction, and we hope, result in the\ndevelopment of courses in this area at teacher-training institutions. A new\nnteam,f approach between those producing and those using the programs would\nbe illustrated and experimented with indifferent forms, to make possible the\ndevelopment of integrated and coordinated utilization principles and course\nmaterials for use both in in-service training and higher education courses for\nnew teachers.\nIn addition to this outcome, it is to be expected that these workshops will\nserve as a catalyzing force in stimulating the introduction into teacher training\ninstitutions of courses in this area, which are the long-term solution. Al¬\nthough the NAEB would not presume to try to impose such courses, it would offer\nits services and those of consultants of the type engaged to conduct these work¬\nshops, when requested. In this function it would work closely with the\nAmerican Association of Colleges of Teacher Education and similar organizations.\nThe reports produced by these workshops will be extremely valuable as\nreference materials for those who will have attended them and for the many\nthousands who will not have the opportunity to attend. These reports will be\nmade widely available for distribution to teachers throughout the nation who\nare called upon to use these new media.\nf. Publication plans: As stated above, comprehensive reports of the pro¬\nceedings and findings of each of the workshops will be published and distributed\nnationally to teachers, school administrators, educational broadcasters, board\nmembers and the many other people who will be involved in using or deciding on\nthe use3 of these media for instruction. They will also be made available to"
}