{
  "id": "d590-58",
  "text": "8\nwith many prominent educators and research specialists from whose ranks con¬\nsultants for this project would be selected. As an indication of the qualifica¬\ntions and experience of the NAEB in the Workshop-Seminar area, we are attaching\na copy of nThe Training Program of the NAEB,\"\nThe educators and broadcasters attending the NAEB Seminar on Instructional\nUses of Television and Radio, mentioned above, specifically urged the A'BB to\nundertake a project of this nature because they felt that this Association was\nbest qualified to do so. One recommendation of the Seminar reads:\nIt is recommended that the NAEB, in collaboration with school and\ncollege personnel in super vision and curriculum, initiate local and\nregional workshops in which educational broadcasters and teachers\nwould work jointly on the problems of classroom utilization of radio\nand television.\nAs pointed out earlier* these workshops will carefully weigh the advan¬\ntages and disadvantages of using the broadcast media for various subjects and\nin various ways.\nThree other pertinent recommendations from the Seminar were:\n(a) It is recommended to the NAEB Board of Directors that ways and\nmeans be found (l) to stimulate a continuing program of creative\neducational planning in the areas of instructional broadcasting\nand (2) to finance and organize projects arising from such planning;\nOb) It is recommended that the NAEB develop sources of financial\nsupport which will permit the holding of a continued schedule of\nworkshops or seminars devoted to the subject of instructional\nuses of radio and television;\n(c) It is recommended that the NAEB explore the possibilities of preparing\na publication describing current practices in teaching by radii, o and\ntelevision. The use of such a publication in certain courses in\nteacher training Institutions should be encouraged.\nThe reports resulting from the workshops heroin proposed will provide\nnot only the information about current practices, as called for in this recom¬\nmendation, but also should establish a pattern in the development of courses\nof the best possible quality in the teacher-training fie^d in the United States,\nThey should provide a significant contribution to the specific infcitation\nand understanding needed if American educators are to know how bsst to utilise\nthese media as instructional tools in educationally responsible ways*"
}