{
  "id": "d590-64",
  "text": "-4-\nc. Methods of statistical or other analysis: As indicated above, a careful\nanalysis and evaluation will be made of the installations in use in order\nto determine which best accomplish the instruction desired. It is expected\nthat realistic cost figures will be provided which, with technical data,\nwill permit others to determine the needs to accomplish a particular mission,\nd. Approximate time schedule: It is expected that this project will extend\nover a two year period, Mich data will be available immediately from the\n203 AM and FM educational radio stations and 35 educational television\nstations. Since many closed circuit television experiments are in progress\nand more comprehensive systems will develop in the immediate future, it is\nexpected that at least a two year period will be necessary to complete this\nproject. Then too, television facilities in schools now under construction\nwill provide an added base for judgment of future requirements,\ne. Expected end product: Descriptions of typical installations with equip¬\nment lists and specifications, floor plans, distribution systems, and\narchitectural features for the guidance of educators, educational broadcasters\nand administrators, to enable them to plan for the use of electronic means\nin improving the efficiency of teaching. As a result of the data accumulated\non existing installations the project director will be available to offer\nconstructive and specific advice and criticism on proposed plans,\nf* Publication plans: It is expected that bi-monthly reports will be pub¬\nlished in printed form which can be indexed and made into a permanent record\nfor use in future planning.\nVI* Personnel: It is proposed that Mr, Cecil S. Bidlack will be employed\nto direct this project. For the past four years he has been employe! as\ntelevision engineering consultant to the NAEB. Prior to his employment at\nNAEB, he was employed by NBC, serving six years as a television technical\ndirector and three years as a radio studio engineer# His background in edu-"
}