{
  "id": "d590-65",
  "text": "-5-\ncatjonal radio is provided by eleven years service in various technical\ncapacities at WOSU, the Ohio State University station. This experience\nprovides him with an excellent background and knowledge of educational\nradio and television installations and their requirements and problems. In\naddition, an assistant will be employed with audio-visual training or\nexperience. Funds will also be required for a secretary and the part time\nservices of a draftsman to assist in the preparation of reports. Mr, Bidlack\nwill be available January 1, 1959 and it is believed the remainder of the\nproject staff can be secured within 30 to 60 days after receipt of the grant-.\nThe project personnel will be assisted by the NAEB Headquarters staff and\nthe NAEB Engineering Committee* the members of which have been involved in\nthe construction and operation of radio and television stations and closed\ncircuit television installations for a number of years.\n-Facilities. The National Association of Educational Broadcasters is\nwell qualified to undertake a project of this nature for a number of reasons;\n1. It is a professional organization of educational radio and tele¬\nvision stations, production centers, closed—circuit installations and\nindividuals engaged in these activities. As an association of 34 years\nstanding, it receives many requests for help in establishing the above\nactivities. However, due to limited funds and personnel, it has not been\nable to develop the comprehensive materials necessary and desirable to meet\nth- increasing demands made upon it.\n2. In the past four years the NAEB has begun to provide the type of\nservices outlined here. Che budget available, however did not make possible\n-:he concentrated or adequate approach here proposed. T'.e four years* back¬\nground acquired by Mr. Bidlack in performing this work ;r NAEB provides an\nexcellent base from which almost immediate results can expected in the\nLmpi'vmsiuation of this proposed project."
}