{
  "id": "d590-75",
  "text": "Inite^national Relations\nWithin the last few months a now cvgmUaU<m9 the Broadoastlag Foundation\nof kmrteB', has coma into being* It was £<mmd principally % two faster ITAEB\noffioera srd camittee workers.. In exploring to us the reason® to its formation,\nthaaa individuals stated that the reasons on which they had proceeded were based m\n«13 NAED's apparent unwillingness or inability to meet the great need to American\nleadership! which e:~5ts in the International program exchange area.\nThe MSB's inability to meet the need in this area is, we most admit, a fact.\nIn answer to invitations to the MSB to provide speakers, consultants,, judges and\nrepresentatives to distinguished international teoadoasting conferences,particularly\nin Europe, the lJAEB'a inability to provide .funds to travel to its most logical,\nrepresentatives has- resulted in oar having to delegate, to representation, whoever\ncould attend, cop happened to ba in Europe at the times as ilOhright scholars, or\nindividuals on sabbaticals, etc. Consequently, to maity conferences, tha NAEBhaa\nbeen embarrassingly inadequately represented. Cppca*taait;fes to leadership of the\nhighest order have boon missed. And various other orgaiisattos, loss acceptable\nto European broadcasting and educational leaders, begin to ba accepted, reluctantly,\nas representatives of tosrican education and educational broadcasting in such\ncapacities*.\nIn tha few cases when tha representatives we have been able to secure at little\nor no cost to the MEB have been good, tha resultant flood of letters and requests\nto us has teen gratifying. The fins offices of several toepeen broadcasting system\nproudly display on their walls framed citations £raa the MEB to programs they have\nprovided tha ?JAEB, at no cost to us. Our inability to repay them in kind, in even\na few programs created specifically to than, which they would gladly broadcast,\nhas met with a pstdenco which reveals unusual understanding of the still prevalent"
}