{
  "id": "d590-9",
  "text": "(without that area being specifically defined) and in rotation in the\nWest, the Bast and the Sooth in even-numbered years. Amend #5 would\ndelete all mention of any specifio method site selection, (NOTE* On\nthis item 5 ballots (representing 8 votes) were marked in favor of\nmore than one proposal, thus invalidating the ballots, and three ballots\n(representing 6 votes) were left blank,)\n4 - For Amend* #1 24 - For Amend. #2 18 - For Amend* #3\n16 - For leaving the present wording unchanged,\nK0 PROPOSAL RECEIVED A MAJORITY,\nJames Miles, Chairman of the Constitution Committee, presented a unan¬\nimous report of his committee asking that the Constitution and By-Laws\nbe made compatible to provide for dual membership. Miles made the\nmotion and it was seconded by James Morris, The motion passed.\nThe committee sought clarification of the rules regarding Convention\ntime and place. Written ballots were distributed.\nConvention Site Vote\nVotes\n53 We favor holding the N.A.B ,B. Convention in the Midwest\nevery other year,\n65 We favor holding the NJWE,B, Convention in the Midwest\ntwo out of every three years.\nThe Convention will be held in the Midwest every other year.\nReport of Executive Director, Executive Director Harry Skornia gave\nan excellent report oni tW aoitvities and achievements of the Head¬\nquarters staff* The 1957 - 58 Annual Report of the National Associ¬\nation of Educational Broadcasters contained a detailed account of the\noutstanding service our Headquarters staff performs.\nClosed Circuit Educational Television Television Membership Proposal.\nChairman James Miles presenied tie proposal which is explained In tHe\nfollowing proposal-balloti\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nOFF ICIAL BALLOT FOR PROPOSED CONSTITUTIONAL AMEND’f'NT\n\"Explanation\nAt the present time there is no provision for membership for insti¬\ntutions operating closed circuit television (except, of course, as\nthey might be eligible anyway through operation of a station or pro¬\nduction center). With more than 200 of these operations in existence,\nit is deemed advisable to amend the Constitution to provide such mem¬\nbership, It is further felt that such members should be classed as"
}