{
  "id": "d590-91",
  "text": "-3-\nae bona fide educational instruments , was essential* The challenge which\ncams out of this first seminar was essential^^f develop trained^educationally-\nsound professionalism at the management and staff level of these stations—\nreplacing the engineers, English and speech teachers and others who had\ninitially first been \"tapped* by their institutions to operate this \"toy”\nor \"public relations outlet.* Many of the stations, up to this time, were\noperated by single departments of the institutions owning them. Their\nuse as an instrument for tapping all the resources of the mother institution\nwas only vaguely perceived* Hany were essentially \"amateur show\" operations,\nbarely distinguishable^except for the absence of commercials, from commercial\nstations. Unless a broader purpose was visualized for them, such stations\ndid not deserve to survive*\nFollowing the 19h9 Seminar, a request was submitted to the W* K.\nKellogg Foundation for funds to establish a national educational tape\nnetwork and a national headquarters for the NAEB, with a paid permanent\nstaff* It was with the granting of these requested funds that what had\npreviously been only a dream began to become reality*\nWithin four years of the first grant, the NAEB Radio network was\nself-supporting* The HAEB Headquarters, made possible by this grant, gave\nthe NAEB the mechanism which made possible the business-like administration\nof other grant funds in the slow but steady climb of the association\ntowards status as a respected service organization in educational broad¬\ncasting and the still slower progress towards achievement of the related\nrole as the professional association of those responsible, as management\nand staff members, for the operation of educational radio and television\nfacilities throughout the nation*\nIt is obvious that, before a profession can be developed,\nprofessional personnel must be created to fill it* During the past ten\nyears, to this end, the NAEB has conducted some 2k Seminars end workshops"
}