{
  "id": "d590-94",
  "text": "be inducted in any definition of a professional association of individuals\nwhose principal functions are using these media for educational purposes.\nThe entire new concept of the profession which this opened up made us\ngrateful that we had not previously established qualifications which might\nhave excluded them. And, to date, there is no other organisation to which\nthey can turn for the experience, training, guidance and assistance they so\nurgently need. Unless the NAE3 proves responsive to this challenge within\nthe next Jtew years, however, it is a virtual certainty that such individuals\neither find their home with other organisations (we do not here refer\nto the perfectly natural membership of such individuals in such content-^?\noriented areas as the American Association of Teachers of English,\n^Science, ModeiuJ^ct^hich we seek to encourage) or will fora a splinter\ngroup of their own,\nA delaying factor has been the international role of the\n\\ .\nHAEB. Within the last two years individuals from the KAEB have been\ninvited to serve as speakers, judges, and consultants at various educational\nconference^ abroad. Including Canada and Latin America, Since the HAEB\nie unique internationally as well as in the United States, educators and\neducational broadcasters of these nations naturally inquire regarding member¬\nship by them in the KAEB, Thanks to the efforts of various KAEB representa¬\ntives, for example, educational television is on the threshold of realization\nin Canada, Venezuela aid other nations, No great obstacles are foreseen\nwhich would permit membership by them in the KAEB until developments and\ngrowth warrant the formation of their own organizstions^or possibly a new\ninternational role for tho HAEB eventually. However, & sobering responsi¬\nbility is placed on the HAEB to make sura that standards and qualifications\n•eat for educational broadcasters will be as carefully designed and as\n*\nprofessional in nature as the best minds available can make The KAEB8 s"
}