{
  "id": "d590-97",
  "text": "meeting suggested above. In this case Jwr could, if the Foundation would\nconsent, be considered as in draft or tentative form, to enable the\nFoundation to consider the merits of the proposal in broad terms, in the\nhope that some tentative allocation of fhnds might be mads by the tine such\nallocations must be made by the Foundation in its long-term planning. In\nthis case the first meeting might be held, under whichever auspices the\nFoundation prefers, either separate small grant or ^ an advance on the\noverall proposal, with the understanding, of course, that no farther obligation\nwould be incurred by the Foundation, pending Ihe outcome of this meeting.\nSuch a meeting would of course be only one of several seminars,\nwork®sessions, demonstration-sessions and other projects as outlined in the\ngrant request itself. One of the first of these other meetings would\ninvolve assembling the beet authorities available from other such organi¬\nzations as the American Association for the Advancement of Science, UNESCO\nand othei$ with related experience and broad background, to begin the inten¬\nsive study and drafting necessary to establish eventual qualification\ncategories for membership in the NABS as a professional association.\nIn this connection it will be noted that the individual meafcorahip\nof the HAEB, being a relatively new category, numbers lees than hOO individuals\nThe potential is probably on the order more nearly of 5,000 to 10,000 at\npresent, including staff members of KAEB active members and closed circuit\ninstallations, with the large number of teachers, actively engaged in TF\nand radio teaching and utilization, which are involved. During the interim\nperiod while standards are being developed, it is expectedfhat this individual\nmembership category will continue to increase gradually, in spite of the\nabsence at present of such standards. Eventual standards, to be developed,\ncan probably not be made retro-actively effective."
}