{
  "id": "d1398-0",
  "text": "y\nNational Association of Educational Broadcasters\nMadison, Wisconsin — July 23, 1937\nN-A-E-B CONVENTION PLANS DEVELOP\nMembers attending the annual convention to be held on September 13 and 14 at\nthe University of Illinois, will find a varied program ready for them, reports\nJos. F. 7/right who is in charge of affairs. \"The program will be such that it\nwill be worth while for directors, program directors, engineers, announcers — in\nfact everybody ought to be able to get something out of the discussion.\"\nProgram topics include:\n1. Recordings and transcriptions, with equipment demonstration,\n2. Campus remotes, with techniques for question and answer system.\n3. Interesting equipment (Members asked to bring portable pieces\nfor demonstration and discussion.)\n4. Television — reports on use and plans for using it in schools.\n5. New 110A program amplifier.\n6. General round-table discussion.\nMembers are again asked to send Joe Wright suggestions on what they would\nlike to have added to the program, or what they could contribute to the mootings.\nThese gatherings will not be large in size. 7/e can discuss our problems\nintimately and informally.\nPlan to attend the convention. Bring several of your staff members along.\nIt is an opportunity to give them a better understanding of their place in the\nradio picture.\nWILL ASKS POWER BOOST\nStation 7/ILL, of the University of Illinois, has before the Commission an\napplication for an increase in power to 5,000 watts on its present frequency of\n580 kilocycles. With the increase in power it is expected, says Manager Wright,\nthat the station will have general state coverage except in a westerly direction\nwhere its carrier wave is suppressed in the direction of Topeka. The station\nhas recently greatly expanded its program service.\nNATIONAL CONFERENCE PLANS BEING FORMULATED\nThe NAEB has accepted the invitation to continue as one of the organizations\nsponsoring the National Conference on Educational Broadcasting. The first one was\nheld in December, 1936 in Washington.\nPresident H. B. McCarty went to Chicago on July 22 to participate in planning\nthe sessions. The meetings will be held in Chicago on November 29, 30 and\nDecember 1, 1937. All members are especially invited to plan to attend.\nN-A-r-B NEWR I FTTH\nON TO URBANA - SEPTEMBER 13-14\nN-A-E-B ANNUAL CONVENTION"
}