{
  "id": "d1398-1",
  "text": "Miami University, Oxford, Ohio, for expansion of station WMUB-TV, operating on Channel\nl4, Oxford Ohio. Amount of Federal grant approved: $132,015.\nUniversity of Nebraska, Lincoln, Nebraska, for the expansion of station KUON, operating\non Channel 12, Lincoln, Nebraska. Amount of Federal grant approved: $309,533, ,\nThe approvals bring to 28 the number of grants allocated since funds became avail¬\nable last Jfey. They total $4,804,008, in Federal funds. Accepted for filing and awaiting\nfurther action are 36 applications which request a total of $7,375,512.\nJCEB ELECTS OFFICERS AND MOVES HEADQUARTERS\nHarold Wigren, Consultant in Educational Television for the National Education\nAssociation has been elected Chairman of the Joint Council on Educational Broadcasting.\nAt the same time, Iawrence Dennis, Assistant to the President of the American Council on\nEducation, was named Vice-Chairman of the JCEB, and James Fellows, Associate Director of\nResearch and Development at NAEB,was elected Secretary.\nThe JCEB is comprised of seven professional education associations whose activities\nand membership are concerned with various aspects of radio and television applications to\neducation. Current members are: American Association of School Administrators, American\nCouncil on Education, Association of State Universities and Land-Grant Colleges, National\nAssociation of Educational Broadcasters, Council of Chief Sbate School Officers, National\nEducation Association, National Educational Television, and State Universities Association.\nFCC RULES MODIFY INSTRUCTIONAL TV FIXED STATIONS\nBy Report and Order, the FCC modified its rules governing Instructional Fixed Tele¬\nvision Stations to provide for the assignment of alternate channels to a licensee instead\nof the wider spaced channels in the original rules. (Docket 15l8l). Hiis arrangement will\npermit the use of a single broadband converter to convert as many as four channels simul¬\ntaneously. This should result in a substantial saving to school systems using that service\nby eliminating the necessity of a separate converter for each channel. The original\nproposal, initiated October 3, 1963, on the basis of a petition by Adler Electronics, Inc.,\nwas modified slightly as the result of comments filed in the proceeding.\nThe following frequencies may be assigned to instructional television fixed stations:\nGROUP A\nGROUP B\nGROUP C\nGROUP D\nBand\nBand\nBand\nBand\nChanne1 Limits\nChannel Limits\nChannel Limits\nChannel Limits\nNo.\nMe/ s\nNo.\nMe/ s\nNo.\nMe/ s\nNo.\nMe/ s\nA-1\n2500-2506\nB-l\n2506-2512\nC-l\n2548-2554\nD-l\n2554-2560\nA-2\n2512-2518\nB-2\n2518-2524\nC-2\n2560-2566\nD-2\n2566-2572\nA-3\n2524-2530\nB-3\n2530-2536\nC-3\n2572-2578\nB-3\n2578-2584\na-4\n2536-2542\nb-4\n2542-2548\nC-4\n2584-2590\nD-4\n2590-2596\nGROUP E\nGROUP F\nGROUP G\nGROUP H\nBand\nBand\nBand\nBand\nChannel limits\nChannel Limits\nChannel Limits\nChannel limits\nNo.\nMe/ s\nNo.\nMe/ s\nNo.\nMc/s\nNo.\nMe/ s\nE-1\n2596-2602\nF-l\n2602-2608\nG-l\n2644-2650\nH-l\n2650-2656\nE-2\n2608-2614\nF-2\n2614-2620\nG-2\n2656-2662\nH-2\n2662-2668\nE-3\n2620-2626\nF-3\n2626-2632\nG-3\n2668-2674\nH-3\n2674-2680\ne-4\n2632-2638\nf-4\n2638-2644\nG-4\n2680-2686"
}