{
  "id": "d1398-2",
  "text": "RADIO INDUSTRY OPPOSES FEDERAL STATION\nAmong the developments reported emanating from the Chicago Convention of the\nNational Association of Broadcasters are some which indicate that the industry is\nas jumpy as ever about anything which might endanger the entrenched wAmerican\nSystem”.\nOpposition to the Cellar Bill, which would authorize the construction, main¬\ntenance, and operation of a government broadcasting station, was expressed in a\nresolution the premises of which are wide open to debate. It read:\nWhereas, there has been introduced into the Congress of the United States\na bill known as the Cellar Bill, which would authorize the construction,\nmaintenance, and operation of a government broadcasting station.\nWhereas, the existing system of broadcasting in the United States makes\navailable to the various departments of the government ample tine for broad¬\ncasting either domestic or foreign programs,\nWhereas, the existing system of broadcasting in the United States affords\nto the departments of the government the greatest possible radio audiences,\nWhereas, the operation of a broadcasting station by the Office of Educa¬\ntion is opposed by all existing Federal and State laws respecting education,\nWhereas, due to its official status, there would be great danger of\nutterances over such a station giving offense to friendly nations, and\ncreating unnecessary international incidents,\nWhereas, the enactment of the bill would result in a useless and extrava¬\ngant expenditure of public funds,\nNov/, therefore, be it resolved, That the NAB express its opposition to\nothe passage of this bill and instruct its board of directors to use all\nlegitimate means to cause its defeat, and urge the members of the NAB to\nencourage their members in Congress to oppose the passage of this bill.\nThe determination of the Association to gain a firmer footing for the \"system”\nwas shown when it was decided that \"offensive tactics rather than the defensive\nlethargy” of the past will be employed under the industry* s new leadership. It is\nproposed that \"the fountain-head of the offensive will be in Washington and on the\nlegislative front, strengthening of the industry activities in the field is planned\nas' a definite part of the project”.\nThe NAB Board voted to increase the salary of its managing director from $2,500\nto $16,000 a year (Broadcasting Magazine, July 1). It also authorized the appoint¬\nment of an advertising manager to \"advance the art of radio broadcasting in the\nminds of tho people and to portray a true picture of the- value of the radio industry,\nin its present form, to the United States.”\nNow, what does this mean to us? Many things. It means that more direct\nefforts will be used to force the acceptance of commercial programs. It'means\nthat educational stations are likely to find their work belittled because their\nexistence, like that of the proposed federal station, is not in line with the\n\"American System”.\nThe principle of true service broadcasting is fundamentally right. We must\nmake our activities prove it. This is a job which everyone must do for himsolf.\nWe must take stock of our support and, like our commercial friends, substitute\nmore positive action for a \"defensive lethargy”.\nON TO URBANA - SEPTEMBER 13-14\nN-A.-E-B ANNUAL CONVENTION"
}