{
  "id": "d1022-0",
  "text": "January 21, I960\n14 Gregory Kail\nUrbana, Tllinoic\nDr# rlaurica F# Secy, Director\ncTT,^K*^^l loj •j^oundn^lon^-\n250 Champian Stroot ~\nBattle Greek, ItLchi'an\nDear Maurice i\nIntended to send you a copy of this, but with a note saying \"for your infor¬\nmation\" —#. Something slipped on tills somewhere, I fear#\nTour conclusion woo correct# At tlio suggestion of several people, like Borman\nCousins, T^enny Marks, and others — wo did send this to quite a number* Par¬\nticularly to new foundations, whose area of ctiphasis is not yet decided. I\npersonally don* t put 00 terribly much faith in this, but thought it might be\nworth a try#\nIt was not sent to sovoral with whcsa we already have appointments* Chi tod\nStates “SEeel Foundation (rec craaended to I Sr# llamr Turner by their San TVanoisoo\nDirector, who knows of our work), etc#\nHarley and I leave for 0 week in Fksw York, January 25 - 29, for conferences\nof this sort# Ms are even talking to a couple of professional \"fund-reisers\"\nbut so far are a bit squeamish about using this, except as a last resort#\nShortly after our return, perhaps sometime in bbruary or Ifesroh, we*d lil:e very\nmuch to chat with you over developments since our last (dinner) meeting#\nTIjo crux of our problem is this* The Center (VJhite et al) ere now going into\nradio network distribution# Ford had given lnrf.e finds to the Broadcast 'aun-\ndatian of America (Cy Siegel, George Frobst end others), with which tlioy bought\nduplicating equipment, hired staffs, and had travel funds wc could only onvy#\nThey (BFA) wore effectively squeezing us out of the International cron, since\nthey could pay for pro. rams, etc. Then lord discovered that the numerous groups\n(^AEB, the Center, l.'V) most of which Ford created, were getting in each others*\nway# Hence they ( ard) exerted their influence (vitliholding funds to BFA) to got\nthis on-going radio distribution set-up and a whole international relations organ¬\nization transferred to the Center, including 3 ‘Afs radio clientele. TJo were in"
}