{
  "id": "d1022-16",
  "text": "EE: Radio Network Assessment Fees\nIMPORTANT NOTICE\nDO NOT DISCARD\nSince Radio Network assessments were raised as of July 1, 1954 six Class C\nStations and one Class B station have discontinued Network service because of\nincreased expense. While this presents no cause for alarm, since Network member¬\nship will always vary some from year to year, I believe every member should\nreview the Radio Network picture as well as look toward the future.\nBy action of NAEB, taken in convention, the Radio Network operation is to\nbecome self-supporting as of July 1, 1955. In order to assume full support members\nwill pay according to the new schedule, also approved by convention vote, come\nJuly 1.\nAt that time fees will be as follows: Class A stations (5 kw and over), $800\n(this is the equivalent of slightly less than $2.00 per program hour); Class B\nstations (1-4.9 kw), $500 (the equivalent of less than $1.25 per program hour);\nand Class C stations (less than 1 kw), $300 (the equivalent of less than $.75 per\nprogram hour).\nThe NAEB has done remarkably well in reaching the goal set at the time the\nW. K. Kellogg Foundation grant was agreed upon. We must carry on from this point\ntoo. I therefore thought it would be helpful, after discussion with President\nSchooley, if I called attention to earlier decisions made by the NAEB, and to the\nrate structure which becomes effective July 1.\nIF YOU LIVE BEYOND ZONE 3 FROM URBANA. THIS IS OF SPECIAL INTEREST: You\nwill recall that postage reductions for the shipping of tapes to and from educational\ninstitutions went into effect about a year and a half ago. These reduced rates,\nhowever, did not apply to tapes to stations beyond Zone 3; this rule-change m\nfact resulted in a greatly increased burden to flasgg, stations.\nIt now appears that there is some likelihood, if adequate interest is mani¬\nfested, that this situation can be corrected. Specifically legislation to be\nintroduced will eliminate the zoning limitations now contained in Public Law 141,\napproved July 20, 1953, by virtue of which parcel post rates now apply to tppes\n(though not to films) beyond the third zone. If this proposed legislation is\napproved, it will mean a saving of as much as $150.00 to $200.00 for some of the\naffected stations.\nHJS:jy"
}