{
  "id": "d1022-179",
  "text": "-8-\nThree new series produced by the British Broadcasting Corporation represent\nGreat Britain. They are THE BBC THEATRE, thirteen semi-documentary and dramatic\nprograms; and serializations of two novels, Dickens* MARTIN CHUZZLEWIT and\nGeorge Eliot’s THE MILL ON THE FLOSS.\nThe remaining three new series are provided by NAEB members. From station\nWNYC, New York City, comes a new Cooper Union Forum series, SOME PSYCHOLOGICAL\nPROBLEMS OF DAILY LIVING. THE CHILD BEYOND, produced by Radio House, Univer¬\nsity of Texas, on an NAEB Grant-in-Aid from the Educational Television and Ra¬\ndio Center, deals with the problems of exceptional children. TALES OF THE\nVALIANT, produced by Station WUOM, University of Michigan, on an ETRC-NAEB\nGrant-in-Aid, tells the dramatic stories of great national heroes outside of\nthe English-speaking world.\nSix previously announced and distributed series will be continued. They\nare: STORIES ’N STUFF (WILL), WINDOW ON THE WORLD (British Information Ser¬\nvices), THE EVOLUTION OF JAZZ (WGBH), OVER THE BACK FENCE (CBC), FRENCH PRESS\nREVIEW (RDTF), and MUSIC IN THE MAKING (Millikin University - Grant-in-Aid).\nWhat are your Call Letters?\nOnce again, a reminder to members of the NAEB Radio Network: When you\nreturn your order form for the new program offering, please do not forget to\nfill in your station call letters.\nQuery\nWould member stations be interested in receiving occasional tapes of pro¬\ngrams or other matter for non-broadcast use, i.e. use on closed-circuit, in\nstaff meetings, before local groups for public relation purposes, etc.? If you\nare interested in receiving such tapes — will you please let the Network\nknow? For example, we recently had one on WNAS from New Albany, which caught\nus with no real procedure set up to process or handle. Would such a service\nserve a real need? Of course, a charge of $2.00 per reel would have to be\nmade since this is not a part of normal Network operations.\nFor recent technical developments of the Network see Technical Tips by\n14*. Cecil S. Bidlack, page 26.\n•am*"
}