{
  "id": "d1022-31",
  "text": "NAEB Radio Network\n14 Gregory Hall\nUrbana, IIllinois\nMEMO:\nTO:\nIn-School\nBroadcasters\nFROM:\nJohn Holt\nDATE:\nMarch 25,\n1955\nRe: In-School Broadcast Series. 1955\nThe Network has already offered two 1955 in-school series, ALPHABET OF SCIENCE\n(S55-1) from WBAA and TIPTOP TWINS (S55-2) from WFBE, which are already in the\ncourse of distribution.\nSix more series are hereby offered. They are:\nS55-3 FRENCH FOR GRADE 3 (KSLH) - 15 programs (including Christmas\nspecial)\nS55-4 JUST WHY STORIES (KSLH) - 23 programs\nS55-5 AMERICANS TO REMEMBER (WNYE) - 30 programs\nS55-6 BOOKS ON REVIEW (KSLH) - 28 programs\nS55-7 HOW IT BEGAN (WNYE) - 15 programs\nS55-B LANGUAGE IN SONG (WNYE) - 16 programs\nAn audition tape for JUST WHY STORIES will be included with Issue #16\n(April 17). Audition tapes for BOOKS ON REVIEW and FRENCH FOR GRADE 3 will be\nincluded with Issue #17 (April 24). Audition tapes for AMERICANS TO REMEMBER,\nHOW IT BEGAN, and LANGUAGE IN SONG will be included with Issue #18 (May l).\n(The tapes should actually arrive at your station about a week before these\n’’release'1 dates.)\nTeacher’s manuals for HOW IT BEGAN, AMERICANS TO REMEMBER, LANGUAGE IN SONG,\nand the first 14 programs each of JUST WHY STORIES and BOOKS ON REVIEW are here\nincluded. Manuals for FRENCH FOR GRADE 3 and the remaining 14 programs each for\nJUST WHY STORIES and BOOKS ON REVIEW will be forwarded to you immediately upon\nreceipt by the Netirork Headquarters. If there is any chance that you will use\nan in-school series, PLEASE RETAIN THE MANUAL. Extra copies are NOT available\nfrom Headquarters.\nFRENCH FOR GRADE 3 and the first 14 programs of JUST WHY STORIES will be\ndistributed a few reels each week during May. The second 14 programs of JUST\nWHY STORIES will be distributed next fall.\nThe remaining four series will be distributed next fall. You may elect\nto receive any of them by either of two methods of distribution.\nMethod I. All programs in any given series will be sent out in one package.\nAMERICANS TO REMEMBER will be sent to you with Issue #38 (September 18). BOOKS\nON REVIEW will be sent with Issue #41 (October 9). HOW IT BEGAN will be sent\nwith Issue #44 (October 30). LANGUAGE IN SCKG will be sent with Issue #47\n(November 20). This method of distribution is for those who prefer to receive\nall the tapes in a series at one time even though it means not broadcasting the\nseries until after next fall."
}