{
  "id": "d632-111",
  "text": "Memorandum\nPage 2\nNovember 28, X>\ne) A central office for the program. Tilth a director to be\nresponsible, for exchange of information, for such central\nservices as promotional materials, and in general for\nmaking the program of maximum use to the stations*\n/ ) Experimental work on the use of television for educational\npurposes, on the effects of educational radio and tele¬\nvision, on educational station management, and other perti¬\nnent problems, over a period of five years®\n6. To develop this program and to secure the Foundation’s final\napproval will be a matter of months and will take considerable Illinois\nstaff time and money® This we are willing to give® However, it is not\nour wish to undertake this work of development unless we are sure of NAEB’s\nw3ih to center its network activities at Illinois and to give its whole-\nhearted cooperations®\n7e If NAEB accepts the line of action here outlined, we understand\nacceptance to mean:\na) Cooperation during the next six months in planning the larger\nproject so that it will be of most use to us all.\nb) Cooperation during the delicate period of negotiations with\nthe Foundation® Specifically, this means:\nbl» Appointment of such special committees as may be needed\nduring the negotiations®\nb2® Checking with us, during this delicate period, plans,\nif' any, being made for approaches to other foundations on\nbehalf of NAEB, so that one does not cancel out the other,\nand we do not lose one or both grants because of seeming\nto double-deal©\nb3« Development, at the proper time, of a time-table whereby\nthe operating expenses of the network (machine operators,\nmachine maintenance, tape, and shipping) will be taken over\ngradually during a five year period by the stations using\nthe network®\nc) Appointment of a Standards and Acceptance committee, if Illinois\nundertakes operation of the network® This committee of members would determine\nwhat goes on the network.\nd) Acceptance by NAEB members of responsibility for providing programs\nfor the network.\ne) A clear understanding that if Illinois is unable to supply funds\nfor such a program as this by the time of the next annual NAEB convention, or\nsuch other time as the Lexington convention may set, NAEB9 s acceptance of this\nproposed line of action shall be reconsidered®\nf) Meanwhile, the network to be centered where it is or vfherever\nelse NAEB may decide, until Xnninois is asked to take it over because of a\nmajor emergency at WNIC, or until Illinois is able to provide the funds\nmentioned above."
}