{
  "id": "d632-121",
  "text": "6) TUBERCULOSIS\nIn his Belmont home, a public works engineer describes his first\nhemorrhage from tuberculosis while on his honeymoon, his treatment at\na sanatorium and his recovery at home. At the Middlesex County Sana¬\ntorium, Dr. Prank uawson, Superintendent, talks with a patient and\ndescribes his treatment. Early detection of tuberculosis'is illus¬\ntrated on a visit to a mobile X-ray Unit on boston Common:^ where a\nvisitor tells why he is having his chest X-rayed, and Dr. Hoy P0\nLendyren explains the X-ray apparatus and how the community program\nis fighting tuberculosis0 Dr0 Henry J. Bakst (boston University)\nvisits a patient at her home and they review the steps in preventing\nthe spread of the disease to other members of the family, home care\nof the tubercular patient and treatment by rest, diet and fresh air.\n7) EPILEPSY\nA middle-aged businessman, interviewed with his wife and young son at\nhis home in Wollaston tells what it is like to be an epileptic, and how\nhe has managed to carry on his job with the same company for the past\n30 years, and to lead a harpy and normal family life in spite of his\nhandicap*. He describes adjustment to such riruys as phenobarbital and\nmesantoin. \\ 12-year old school girl, interviewed v:ith her mother in\ntheir home at Brighton, illustrates epilepsy in children. Together\nthey reconstruct her first seizure after being hit by a snowball,\nher* experiences in hospital where she underwent brain surgery, .and\nhow she is now back at school and able to lead a full life. At the\nSeizure Unit, Children’s Medical Center, Dr. William 0o Lennox (Harvard)\nexplains what epilepsy is, demonstrates thh use of the electroencephalo¬\ngraph in diagnosis of* epilepsy (the sound of the eight pens tracing\nthe brain waves of a patient is heard) reviews advances in drug treatment\nand points out how the epileptic can attend school or hold a job despite\nthis diseaseo\n3) HIGH BLOCj PRSSSUU;\nAn appliance salesman, father of two young sons, interviewed with his\nwife in the Brookl&ne home, tells how his high blood pressure was\ndiscovered when he applied fro life insurance in 1945, how he was\ntreated by medication, dieting and psychotherapy. In his office at\nEvans Memorial Hospital, Dr. Robert ii« Wilkins (Boston U.) reviews\ntreatment and explains the role of surgery in relieving hypertension,\nbrora an operating room at Evans Memorial, key portions of a Splanch-\nnicectomy are heard as it is actually performed by Dr. Reginald H0\nSmithwick (Boston U.) who himself describes his surgical procedure as\nhe operates on a male patient„\n9) mmumio illness - i\n\\ middle aged woman tells of her emotional disturbances in relation\nto her son yetting into college, and her being able to help him through\nthe universityc Also her anxieties and fear of death by cancer at the\nsame age at which her mother had died of cancer. The program tells of\nhelo received from the Psychosomatic Clinic of Massachusetts Memorial\nHospital. This is a typical example of a prelirainary exploratative\npsychiatric interview without interpretation. It includes Dr. Bernard\nHandler, the Clinic Directoro\n10) PSYCHIATRIC ILLNESS - II\nThis is a continuation of part I, and explains the point of view of\npresent day psychiatry employing all the tools of modern medicine."
}