{
  "id": "d632-135",
  "text": "EDUCATION.'I. •. KB I.IIIKS 13 S TA II OHS III TAPE PRO SRAMS fKBVICSP FROM\n-— \" )tm 'YORK\n(Radio Daily) .Programs provided by the National Association\nof Educational Broadcasters are novi being aarri'd by 13 stations\nthroughout the country and within the next few weeks, at least\n15 additional stations will begin broadcasting the series, Seymour\nSiegal, regional director for HAEB and director of h-iYC, report-\ned yesterday. The series, which was begun in the latter part of\nFebruary, is being financed through funds provided by Cooper Union*\nShows are transcribed on tape at various plaoes with the distribu¬\ntion being handled through VOYC in Hew York,\nFirst series was made in Boston in cooperation with the Lowell\nInstitute Cooperative Broaden sting Council. u.,e Human beings\nwas the title\" of the first group while the second was on ^Long\nI.ifen* The latter included talks on cancer, arthritis, accidents,\naloholism and other diseases.\nThe Third series on \"Great Themes in\nat Cooper Union, now marking its 90th\nelude Rapph Bunche of the UI:* Walter\ni&tion for the Advancement of Colored\nof the UH»\nthe Great Hall\" was recorded\nanniversary. Speakers in-\nWhite of the national Assoc-\nPeople and Carlos P. Romulo\nArmy Band Included\nFourth series features the concerts of\nwhile the fifth titled \"Pusio for the C\nof discussions by David Randolph.\nthe United States tr my Band\nonnoisseur\" consits mrinly\nPrograms of the British and Canadian Broadcasting Ccmpanys will\nbe made avoileble in the sixth and seventh ser’.s to be produced\nlater. U” presentations .ill be utilized for still another froup,\nPlans for the educational broadcasts were laid during June and\nJulv of last vear at a meeting on the campus of the University\nof Illinois. V Siegalwho was among those drawing up the so-call-\ned \"Allorton Report\"!, later put the plans to work and was instru-\nmental in arranging the present programs.\nCommenting on a recent article by Robert Hutchins of the Univer¬\nsity of Chicago in the BBC quarterly which deplored the lack of\neducational broadcasts, r.legal noted that the present programs\nare evidence of construct! work being done m the field.\nThe recordings, thus far, have been produced\nget given by Cooper Union and no talent fees\nThe shows are available only for non-commerc\non a very small bud-\nhave been nec< ssar/o\nial stationse"
}