{
  "id": "d632-47",
  "text": "Mr. George E. Probst, Director\nUniversity of Chicago Round Table\nUniversity of Chicago\nChicago 37, Illinois\nDear Georgei\nI am really very unhappy about not having organised eqt life better in\nHew York last week so I could get out of that conference to see you.\nMy feelings are further compounded by Sy telling me he forgot he had\na date with you and that you were counting on both of us.\nDuring the next week I will shoot you something about your wonderful\ninvitation to do a science Round Table the last Sunday in September,\nthe 24th. - please check me on this date, lould you want it live or\ntaped? Is it a fee program and how touch per each?\nBid you see the enclosures from life about those pigeons Dr. Skinner\nis working with?\nThe meeting of the Joint Committee of the American Association for\nAdult Education and the department of adult education of the NEA\nrequires a special report which I shall prepare when the final\nminutes of the meeting are mailed to each of us who attended. At\nthe moment, the relationship between NAKB and any new single\norganisation representing adult education in the country which will\nresult from this meeting, is largely an exchange of ideas with persons\nand groups in other adult education fields. The only immediate out¬\ncome is the possibility of our getting organised cooperation for the\nbicycle network from the Audio-Visual Board of the American Library\nAssociation. Since a copy of this is going to Sy, Bob and Dick, I\nhope that I will hear from each of you what you think about this\npossible cooperation and liow it might be worked out. The usual\nlibrary cooperation would be the base, of course, but more ideas might „\nbe developed in a conversation with Mrs. Patricia Blair, Chief, ALA\nAudio Visual Hoard. Library Offis1600 Broadway, New York 19, New\nYork. John M. Coi3y, executive Secretary of the ALA, in Chicago,\nbelieves sometliing could be worked out. Another result of being in\nNew York was lyman Bryson’s considerable interest in the bicycle net¬\nwork. He believes our kind of radio and organised effort is store\nimportant now than it ever has been.\n/"
}