{
  "id": "d632-57",
  "text": "September 4* 1950\nMr. H. A. McCarty, WHA, Madison, Wisconsin\nMr. Frank Schooley, WILL, Urbans, Illinois\nMr. Harry bkomia, WFUI, Bloomington, Indiana\nMr. Seymour Siegel, WMYC, Mew York, Mew York\nMr. Elchard Hun, WOI, Ames, Iowa\nGentlemen*\nAttached please find, first, the results of our recent\nsurvey, and, second, a proposal for utilising the facilities\nso offered. It is my thought that little will be gained\nby having a meeting on this affair. What it will require\nis several hours of study on the part of each one of you\nover the material enclosed. I do not feel that this can\nbe covered at a glance or with any preconceived notions.\nIt is new. It will take new ideas. 1 hope I have offered\na few.\nItem one is the compilation of all the surveys returned\nto date. We sent surveys to 41 stations and have received\nIB answers to this time. We have also received 9 letters\npromising complete questionnaires at a later date. We\nhave included everything here, including all suggestions,\nthis must be studied carefully before you proceed to item\ntwo.\nItem tw© is tent&tiv# proposed schedules for the MAKB\ntranscription network for two thirteen-week periods start¬\ning January 1 and April 1, 1951* Please note that these are\ntentative. They not only could be, but they undoubtedly\nshould be, changed before being distributed to the general\nmembership. It is not my intention that every NAKB station\nset up an hour a day for network features. It is easier,\nhowever, to see it in this form.\nItem three shows proposed membership cost plan. It is ay\nthought here that the slight reduction for additional hours\ncarried would be an incentive for taking more hours. The\nweekly rate in line 7 gives no reductions! however, the\n30 and 52 weeks rate in lines 8 and 9 does allow a moderate\nreduction for bulk subscription. The initial contribution\nmentioned in line 10 Is a necessity for the purchase of\nthe basic store of tapes. I do not believe that this would\nbe an annual proposition, borne purchase of tapes would\nundoubtedly have to be made at the end of the first year's\noperation. Whether this would be 5 or 25% of the original\nsupply, X am not prepared to state. Lines 11, 12, 13,\nand 14 are pure conjecture. I went over the stations I\nknew and supposed we could get fifteen from each of the"
}