{
  "id": "d632-79",
  "text": "September 3th, 1950\nMr. John Witherspoon\nDirector, IBS Region 9\nc/o K C V N\nCollege of the Pacific\nStockton, California\nDear Mr. Witherspoon:\nI»ve just returned from a week’s vacation to find your\nletter of August 23th. I’ll do the best I can to explain\nthe workings of the NAEB Transcription Network.\nWe have set up a ’’basic bicycle” for all tapes. We have\ntried, in so doing, to use the most direct east-west route.\nAll of our offerings are made with a one-week interval. In\nother words, the program is offered to station A for broad¬\ncast the week beginning October 1st, to station B for the\nweek beginning October 3th, etcetra. We’ve had a suprising\namount of success with this system. There are, of course,\nseveral instances where it is necessary to ask the stations\nto move their starting date either ahead or back.\nFro example: Station A would like to schedule the series\nstarting October 7th. Station B requests it for October\n9th. Both these stations are utilizing the time offered,\nbut because of the proximity of schedules, we would ask\nStation A if they could not move their starting date up\none week of start September 30th.\nIf this cannot be arranged, it is also possible that\nStation A could redub the tape immediately upon receipt\nfrom us (generally speaking this would be at least five\ndays prior to their scheduled starting date) and ship the\noriginal on to Station B immediately.\nWe’ve been employing this system since the inception of\nthe Network, and as I said it has been working out with\na tremendous amount of success.\nAlong with the offering, there is sent along to each\nstation a Disposition Form, and a complete description\nof the programs. The Disposition Form (a copy of which\nI am enclosing) was arrived at as a more expeditious form\nof return. After much experimentation (at the outset we\nwere sending individually typed letters to each station)\nwe discovered that the replies were received much more\nquickly by this method. We also discovered that by setting"
}