{
  "id": "d632-89",
  "text": "COPY\nMr. Jim Miles\nRadio Station WBAA\nWest Lafayette, Indiana\nDear Jim:\nYour letter of August 2 andthe accompanying\nquestionairre leave me in a mild state of frustrated confusion.\nYou, who were at Allerton, doubtless have a fairly clear cut\nunderstanding of the magnitude of the immediate needs of the\nNAEB Transcription Network and can translate these into a\nfair quota among the members. But those of us who were not\npresent have no such base for judgement. I have a well-\ndeveloped caginess against requests for pledges or contributions\nwithin groups since I have found such wide variations in the\ngenerosity or penuriousness of individuals and institutions.\nVoluntary pledges will not, in my opinion, result in any\nequitable distribution of load.\nAs to the participating programs, I am definitely\nskeptical. We are ingrave danger of duplicating the worst\nprogram practices of mutual networks. The exchange of the\nbest products of each of us should result in definite enrich¬\nment to all of us while maintaining uniformity in each series.\nWhere information from different members is to be woven into\na series, I am strongly inf avor of having the writing and\nproduction done by one of the NAEB members. I am quite aware\nof the difficulties involved in centralized program production,\nparticularly the division of costs involved. Without centralized\noperation, series will tend to lose form and audience recognition,\nIn my opinion, someone will have to block in a\nproposal for the network which estimates costs for different\nnumbers of programs per week, and which suggests the expenses\nwhich should be carried by NAEB members participating in the\nexchange. Then each of us can decide whether the goods delivered\nwarrants the expense. I»m sure we would all agree that some\nof our financial support should be to the idea since the per¬\nformance of the organization can be expected to be of increas¬\ning merit. Hence we should help to launch the network even if\nwe don*t feel we have full value received. But the idea will\nnot be feasible for long if we depart very far from a business\nbasis. I»ve had my fill of organizations in the educational\nand public service field who operate on an idea of charity\nfrom members they are supposed to serve.\nWe*11 have growing pains in which programs will be\na contested point, among others. We are all aware of a\nsplit in opinion within NAEB regarding the length and weight\nof programs. There is a division on whether programs should"
}