{
  "id": "d632-90",
  "text": "August 22, 1950\nMr. Miles\nPage two\nhave heavy factual emphasis or whether they should be expected\nto capture the attention of more people, making them aware'6f\nproblems but not delving so deeply into them during the broad¬\ncast. I suppose offerings will have to be made and the decision\nas to feasibility of a series judged in part by acceptance\namong the members. To date we have had little to chose from\nthe lighter side. The closest approach, so far, has been ”w©\nHuman Beings” which rates very high among my choices. I doubt\nthat I will schedule another ’’Great Themes” full length\npresentation particularly with the long delay involved in\nbicycling series.\nThere will be central costs in any event to\ncover traffic and distribution. Probably some place will\nhave to dub copies at the beginning of series to reduce\nbicycling or to eliminate the need of each shop to dub\nupon arrival. We’ve been having too many disruptions of our\nschedule because of late arrival of tapes ——and I believe the\nfault to be that of the bicycling system rather than of any\none individual. We have six copy units and a master, so we\ncould duplicate in volume. But I»m not going to volunteer to\ntake on such work load on my limited budget nor should others\nbe expected to do so. Not to mention the need for tape supplies.\nThe programs to date have not been edited in\nopening and close to eliminate sections which may have been\nquite appropriate in the initial broadcast but which are not\nreally usuable by the network. We have need, also, for check¬\ning and cueing at the beginning and end of each tape. Duplication\nof this effort all the way down the line, usually w ithout warn¬\ning, is a great waste of time. I wonder how many are slapping\nthe tapes on and letting come out what will? God forbidJ\nI suppose l»m being a maverick again, but I refuse\nto ’’buy” a plan in its present amorphous state. As you know,\nI*ve been interested in an educational network for a long time,\nbut it will be a first-rate flop if we go into it in our\npresent fashion. I hope some order may come out of the\nmeetings in Louisville. If so, it will be because someone\nhas organized a plan before the meetings. Committee discuss¬\nion is unlikely to do the job.\nCordially yours.\nAM: cm\ncc: Mrs. Terry Linder\nAllen Miller\nStation Manager"
}