{
  "id": "d1794-2",
  "text": "NAEB NEWS LETTER\nPage 3\nApril I, i945\nTHE FACULTY SENATE AND WILL BE TRANSMITTED TO THE BOARD OF TRUSTEES,\nThe proposed program is to be offereo in cooperation with the university\nRADIO STATION WILL and V'ILL UTILIZE ITS EQUIPMENT AND PART OF ITS PERSONNEL*\nAS WELL AS THE PRESENT RADIO FACILITIES OF THE SCHOOL. The JOURNALISM\nLIBRARY NOW HAS A LARGE COLLECTION OF BOOKS, PAMPHLETS AND PERIODICALS IN\nTHIS FIELD, IT IS POINTED OUT, AND IS BUILDING A COLLECTION OF SCRIPTS AND\nTRANSCRIPTIONS.\nTo GR a OUATE FROM THE PROPOSED CURRICULUM IN RADIO JOURNALISM STUDENTS MUST\nMEET THE GENERAL REQUIREMENTS FOR GRSUATION FROM THE SCHOOL OF JOURNALISM\nAND IN ADDITION MUST COMPLETE THE FOLLOWING COURSE REQUI REMENTS !\nThird year, first semester! Journalism 3, the principles of broadcasting,\n2 hours; JOURNALISM 5, reporting, three hours; journalism 10, PRINCIPALS OF\nADVERTISING, THREE HOURS, FOUR TO SIX HOURS OF SOCIAL SCIENCES ANO A THREE-\nHOUR ELECTIVE.\nThIRO YEAR, SECOND SEMESTER! RADIO ANNOUNCING, TWO HOURS; JOURNALISM 6,\nREPORTING, THREE HOURS; RADIO ADVERTISING, TWO HOURS*, THREE TO SIX HOURS\nOF ADVANCED SOCIAL SCIENCES, AND 5 HOURS, ELECTIVES.\nFourth year, first semester! radio news, three hours; law of the press,\nTHREE HOURS; ADVANCED SOCIAL SCIENCES, THREE TO SIX HOURS, AND SIX HOURS\nOF ELECTIVES. SECOND SEMESTER! RADIO PRODUCTION AND DIRECTION, THREE HOURS;\nRADIO LAW, TWO HOURS; ADVANCEO SOCIAL SCIENCES, THREE TO SIX HOURS, AND\nSEVEN HOURS OF ELECTIVES.\nMENZER VISITS PURDUE\nThis is a story of a visit to WBAA, Purdue University. But first, let me\nSAY THAT IN MAKING THIS BRIEF REPORT, I AM PINCH-HITTING FOR JlM £BEL AND\nFrank Schooley who were unfortunate in not visiting Lafayette this year.\nIf NAEB members have stopped over to visit WBAA, they know THEIR VISIT\nSTARTS WHEN THE TRAIN ARRIVES AT THE STATION, JlM MlLES IS THERE TO SEE\nTHAT YOU1 RE TAKEN CARE OF EVERY MINUTE OF THE TIME.\nFor THE SAKE OF HISTORY, WBAA WAS FIRST LICENSED ON April 7, 1922, AND\nOPERATED WITH A POWER OF 250 WATTS UNDER THE SUPERVISION OF THE ELECTRICAL\nEngineering Department, Some of you have visiteo that olo station and know\nHOW THE ENTIRE PLANT WAS CROV-OED INTO ABOUT FOUR HUNORED SQUARE FEET OF\nfloor space. Under the leadership of Demon and ’’Gibbs” Williams, the station\ngrew. Funds were made available for new equipment and quarters and now\nWBAA OPERATES WITH A POWER OF 5 KW DAY, I KW NIGHT ON A FREQUENCY OF 920 K/C.\nOn July I, 1944, Jim Miles took over the job of Program Director and since\nTHAT TIME WBAA HAS BEEN JlM MlLES. THOSE OF YOU WHO RECEIVE BULLETINS AND\nPROGRAMS FROM TIME TO TIME, KNOW THAT THINGS HAVE BEEN DEFINITELY LOOKING\nUP, BUT UNLESS YOU SPEND A DAY LISTENING TO BROADCASTS AND WATCHING OPERATIONS,\nYOU WILL NEVER REALIZE WHAT A SUPERB JOB JlM IS DOING.\nTO GET BACK TO THE PHYSICAL PLANT - STUDIOS AND OFFICES ARE LOCATED IN THE\nHall of Music, a modern building housing one of the large university\nAUDITORIUMS. RADIO QUARTERS ARE LARGE, BUT LIKE MOST OF THE RAPIDLY\nsr:rr«S!7.rttTs:,:sw~"
}