{
  "id": "d1792-9",
  "text": "REGULATIONS BEING BRAWN UP FOR ETV FEDERAL GRANTS\nIt is anticipated that the administrative structure for adminis¬\ntering ETV gr an ts ,wtdrixbismamKipImirmdrmmihxmxt£cmxm&m± mtmjommntiihm i ncl udi ng\nthe ne^cassapy rules and regulations governing the grants, wiUncompleted\nt'fiitp* t - two -mo-nths. A'imsty Within that time, Congress will\nprobably have appropr iated funds for the first year's grants. Z/h4^le~-Tt\nitp p^pdiet.h-QV' rmudK.. money mi 11 be etva i labie the f ir st\nueekthm Yt seems unlikely that any maximum grants will be made during this\ninitial period.\nIt is expected that an eligibility date will be e stablished by the\nSecretary of HEW in thf n?rr future in order to protect matching rightsf\ni of those applicants wanting t oprpceed with con¬\nstruction plans. However, potential applicants shoiufaSe cautioned that,\nregardless of such a date, HEW can't assume any responsibility for any\ncommitments applicants may make before they specif ically receive a grant.\nCeriMi^-i*xpendftvre&-might._,m^ as\nintexpre%ed9 and applicants cannot rm4 assume that expenditures or conu\nmnored^f or ’m t nds ^wrHT- their application for\na moni d. The HEW ETV office is\ncurrently concerned with the deifinition of what actually constitutes\na \"project.\" Pending final definition, it is currently felt that a\nproposal which would merely MenhahceM a.yk ETV operation would not qualify\nas a project, but that the operat ion would have to be expanded through\nexpanddd service to more people or a greater area, or both\". No fimtl\ndecision has been made9 either9 on whether or not purchase of an existing\ncommejudaJ^gtat ion would constitute antk eligble project. ^\n\" The ETV~office of HEW~would welcome views~~or comments on how edu¬\ncational broadcasters think the law should be interpreted. Any questions\nyou may have will also be wlecomed and used as a basis for final inter¬\npretation. Send your comments or questions to Dr. John W. Bystrom9 Asst,\nto the Secretary for ETV9 Office of the Secretary9 Dept, of HEW9 Washington\n2$9 D.C.\n\"However, it has been established that grant applicants must either hold\na license for an ETV station, or have applied to the FCC for a CP9 and that\nsuch license or application must be for a reserved channel."
}