{
  "id": "d1018-100",
  "text": "-12-\nour better ones like Michigan or Oklahoma, and then quite a sizeable annual\nbudget to operate it with the hopes that maybe we can get some programs from\nit. I tend to believe with some of the members at your meeting that we should\nstay out of the production field. This is not to say that someone should not\nproduce another series like the JEFFERSONIAN HERITAGE or THE MAYS OF MANKIND,\nbut I am not at all sure that the NAEB as an Association should do so. This\nis in direct variance with the consensus of your group. However, I did not\nsee anything in the reporters notes arguing pro or con on this matter, —\nmerely the simple statement that the NAEB should continue to produce programs.\n11) STATION BUDGETS! I remember in going over the old files in some\nattempt to set up a history of NAEB, that in 1937 the late ¥. I. Griffith,\nthen Manager of ¥01 at Ames, Iowa, took two pages to write to Frank Schooley\nand Jim Ebel at the University of Illinois, asking them to be sure to be by\ntheir telephones shortly after 7 P. M. on a certain evening so that he could\nplace a long-distance station-to-station call at reduced rates and hope to\nget a particular question answered. All of us who knew Griff will remem¬\nber that he more than likely had a 3-minute egg-timer by the telephone too.\nI use this merely as an example of the tightness of all budgets not too long\nago and certainly it is not a slur on Griff, whom all of us knew and loved.\nI believe it was Pat Greene who said at your meeting that their station had\nbeen at it for 31 years and they still hadn*t all the money they needed by\na long way. This may or may not be solace to a newcomer but it does indicate\nthe long-term effect of which all of us in educational broadcasting are so\nwell aware. It certainly is good to get together with others and compare and\nperhaps commiserate on one*s budget troubles. Some of that commiserating can\nbe done at home now, thanks to our good friend from Marshall College who put\nout such an excellent publication about a year ago. If my memory serves me"
}