{
  "id": "d1018-101",
  "text": "■13-\ncorrectly, Burton Paulu did something quite comparable not more than five years\nago and I expect that something similar will have to be done five years hence\nin order that people may understand how budgets grow as respect for the opera¬\ntion grows. It seems quite popular today for many employers to place a big\ncard on the office wall with the single word \"THINK\" on it. Undoubtedly this\nis needed around educational radio stations as well but if I were to have my\nchoice of cards I wouldn*t put up the word \"THINK,\" — the word \"PATIENCE\" would\nbe much better, or perhaps just \"WAIT\".....\n12) FM PROMOTION. Some will certainly take heart when I tell them that\nthe Chairman of our Television Policy Committee here at Purdue has agreed to\nspend several thousand dollars on a series of 8 television programs and that\nhe, after reading the first set of scripts, was so elated that he called me\nat ten o»clock at night and stated: \"If these are as good on television as they\nare on paper, I will have to buy a TV set.\" May I drop one little gem in here?\nI don»t know how many people saw it, but it seemed to me that one answer to\nthis whole problem was displayed at the NAEB Convention in New York with the\nlittle gadget that goes on the television set and makes it an FM receiver.\nVernon McKown of New Albany was in the office recently and stated that while\ntheir television and radio dealers down there didn*t want to handle the sale\nof this, he thought he could get permission to sell it through their school\nsystem to those parents who might want to listen to their kids at home and\nwho would not pay $f>0.00 for an FM receiver but who had TV receivers and\nmight well pay $20.00 for one of these gadgets. Of course, I don*t think I\nneed to say that circulation is only a portion of the problem. It is true\nthat you have to have receivers before you have listeners, but its also true\nthat you have to have something which people want to hear. Here you certainly\nmust say \"Set a goal, be true unto it, and allow it to develop over the years,\nnot the weeks.\""
}