{
  "id": "d1018-108",
  "text": "-20-\nIn addition, most other government agencies have shown a real interest in mak¬\ning their films available through the Center, thus reducing the number of\ncontacts with which they might have to deal.\nApart from government film, we have a big job to do in screening other\nmaterials already produced. For example, we hope soon to have reliable data\non somewhere between 1,000 and l,f>00 titles which might be valuable for edu¬\ncational television purposes, a project which is being carried out for us by\nthe Film Council of America. A similar project already has provided data on\nsome 9J>0 European educational films of possible interest and value to edu¬\ncational television.\nSuch will be the sources of supply which we hope to tap during the first\nyear of operation. There will not be much variety in our program package the\nfirst year, but it is the best we can hope to do until production resources\nare built up around the country.\nNaturally, this will not preclude the possibility of providing programs\nover and above those furnished in the package. For example, we are also ex¬\nploring the possibility of providing some type of regular newsreel service,\nnot in the usual sense, but in the way of a 11 news in depth\" type of presenta¬\ntion. I must say that the possibilities of such a service do not look good\nto us at the present time—partly because of clearances, etc.—but at least\nwe are carefully looking into the situation.\nEven more important, we*re also hoping to do a few distinguished things\nof a prestige nature. We realize there is some controversy on this point and\nwe recognize the possibility, in the pressure of the moment, that such ac¬\ntivity may be overlooked because it is expensive. But we certainly intend\nnot to neglect this area and we hope to put on some things which are really\noutstanding—a program or series which will stand as a beacon light for any¬\nbody to look at and say, \"This is what can be done—the goal to which we can\nall aspire in educational television.\"\nThus, I have tried to present rather briefly some of the background\nthinking as well as some of the problems of the Educational Television and\nRadio Center. Let me say again that we are pleased to be associated in this\nimportant educational enterprise with an organization such as you represent."
}