{
  "id": "d1018-109",
  "text": "-21-\nQuestions and Answers\nQuestion: I*d like to ask, speaking for those of us who are looking toward\nbudgets and planning, and in line with the idea that you might some day be\nself-supporting, what sort of financing should we figure in our planning?\nNewburn: I cannot answer that question in any detail at the moment because\nour 6oard has made no final decision. We are basing our plans, however, on\ntwo fundamental assumptions. These are (1) that the stations in the long run\nshould pay for the program materials received from us, and (2) that in the\ninitial years of operation with very restricted budgets this payment shouldn*t\nbe much more than a token one. Naturally, because the stations themselves\nwill supply part of our material, we expect the long run charges to be less\nthan the equivalent service might cost from other sources.\nI also should add that we think there are other sources of income in\naddition to charges for program services. We feel there are national organi¬\nzations, for example, which may be interested in granting money to an organi¬\nzation such as ours for the production of materials in broad areas of inter¬\nest, without demanding specific advertising tags on the end product. At\nany rate, the problem of charges for service is one which we intend to talk\nover carefully with your advisory committee before we reach any final conclu¬\nsions.\nQue stion—Graydon Ausmus: % comment is upon a statement which you made which\ndisturbs me a lit’tle, Dr. Newburn. You say you are not going to produce.\nYet, I think there is a possibility, eventually, that someone is going to\nhave to establish a production center for educational television. Perhaps\nthis is not so much a question as a statement because I hope that is one\naspect of the Center*s operation which may be kept open.\nNewburn: Our By-laws now would prevent us from producing and the Board is\nunanimous in the feeling that we ought not ourselves to engage in actual\nproduction. Having said that, however, I should add that you can always\nchange By-laws.\nAusmus: I merely say this to get it on the record because I think there is\na possibility that eventually we will have to have a central production agency\nfor educational television programs.\nQuestion—Allen Miller: I inferred correctly, though, from what you said\nthat there is nothing to prevent you from seeing to it that there is produc¬\ntion done by other organizations. In other words, you can determine what\nproduction is needed and can see to it that contracts are issued so that the\nend result is accomplished?\nNewburn: That*s right. If there is a vacuum in an area, we can move right\nin and see that something is produced, and we would have no hesitation in\ndoing so. It*s simply a matter of where the actual production is done and"
}