{
  "id": "d1018-113",
  "text": "-25-\nsimply good business, good public relations, for a university to stand in this\nsort of relation to the radio public.\n(2) The rest of ray points assume the general truth of what I have just said.\nThey go on to note that there is a price-tag, indeed several price-tags, on a\ngood academic broadcasting program, and to ask whether administrators and direc¬\ntors acknowledge these price-tags, and think about them as frequently and vivid¬\nly as they can. For example, ten years of academic broadcasting has taught me\none rule which it is mike-folly to ignore; namely, that after all preparatory\nreading and study is over, it takes one hour to produce an effective five-min¬\nute script. There will be exceptions to this, but they are exceedingly rare.\nWhen they come along, you are thankful for them, but you never count on them.\nAn administrator or a director who doesn’t know that that is what he is asking\nfor, is ignorant of the basic human cost of his commodity. That ratio, one hour’s\nwork to produce an effective five-giinute script, does not alter as the script\nlengthens. If you are going to hold the mike's attention for ten minutes, set\naside two hours; if for fifteen minutes, set aside three hours; if for thirty\nminutes, set.aside six hours. For one academic year I was assigned to fill\nthirty minutes three times a week. That cost me eighteen hours every week. It\nmade no difference whether you wrote the script out and read it, or thought it\nout and practically memorized, or worked from a note outline. It was still an\nhour’s work to produce five minutes effective talk. I would repeat that this\nhour comes after all your preliminary reading and study is over.\n(3) I can come at my next point this way. Academic broadcasting, once you\nrealize its possibilities and demands, is hard and exacting business. In the\nprofessorial life there are few things to compare it with. No class-room is as\nhard to catch and hold as a mike. No class-room uses up your material as fast\nand inevitably as a mike. There are ways of stalling for time in a class-room,\nmost of them useless to try on a mike. The mike merely turns a cold metallic\neye on your script and saysj \"You are ill-prepared\"; or, \"You haven't enough\nthere to last out\"; or, \"You have too much there for the amount of time you've\ngot.\" As I said, academic broadcasting, once you realize its possibilities and\ndemands, is hard and exacting business. Why then do universities make no allow¬\nances on teaching loads for conscientious and effective academic broadcasting?\nI have never heard of this being done. Why not? In these matters as in others,\nthe laborer is worthy of his hire. Why do universities persistently exploit the\nfact that a man who relishes academic broadcasting can be left to sweat his fool\nhead off?\n(U) Why are stations, or the universities in back of them, so stingy when\nit comes to mimeographing scripts? This is an old gripe of mine. If a script\nis worth the work it takes to produce it and broadcast it, why is it not Yforth\nthe extra cost needed to mimeograph it for distribution? Not to see this is a\nrebuke to the vanity and self-esteem of the broadcaster; and, as a count against\nit, that's not hay. It is also a let-down to the write-in people who think\nenough of what the station is putting out, to ask personally for a copy. It is\na missed opportunity on the part of the university to drive home the fact that\nit stands back of the show and is pleased that its customers want its wares. liy\nfiles are stuffed with letters asking for a copy of the script. And, except in\ncases which do nothing to mitigate this near-sighted policy, the answers have\nalways had to be \"Sorry; no can do.\" I am not alone in this. This is a matter\nwhich, soon or late, comes up for beefing v/henever academic broadcasters are\ntalking things over.\n(5>) I have yet to hear of a university radio station, that maintains a\n\"talent scout\". Why not? On our campus the students’ daily newspaper does not"
}