{
  "id": "d1018-24",
  "text": "Flemming\n2\nNext came the Economic Opportunity Act. It is an act which I believe can be utilized in a\nconstructive manner to deal with these same problems. I am enthusiastic about it because\nit rests on the foundation of education. I am enthusiastic about it because it provides un¬\nprecedented opportunity for a unified community attack on the causes of dependency. There\nisn't any doubt in my mind but that the trend which started with the Public Welfare Amend¬\nments of 1962, which was continued by the Economic Opportunity Act of 1964, will continue.\nI believe tint at the national level and at the state and community level there is strong\nsupport for increased investment designed to bring about the rehabilitation of those who are\ndependent and designed to prevent dependency.\nAt the same time that I note these developments in the public sector, I likewise note a renewed\ninterest in making investments in organizations in the private sector that are playing a major\nrole in the interest of achieving the same objectives. Sometimes we allege that if government\nbecomes too much involved in attempting to work out constructive solutions to problems of\nthis kind it will discourage the private sector from becoming involved. Actually the figures\ndo not bear out that kind of a conclusion. A recent publication of the Department of Hed. th,\nEducation and Welfare points out very clearly that investments from the private sector in\nhealth, education and welfare programs have increased at the same rate as investments in\nthe public sector. For every $2 of public funds that we are investing in programs in this\narea today we continue to invest $1 of funds from private sources. That was the ratio in\n1950 and it was approximately the same ratio in 1934.\nAt the beginning of the 60s significant laws have been passed, funds have been appropriated,\nbut the question still remains. Will we at the community level become sufficiently involved\nin a positive, constructive approach to the opportunities that confront us in the welfare field\nto take full advantage of these laws and of these resources? If we do, we are going to make\ntremendous strides in the direction of cutting down on dependency. The opportunity exists.\nWill we become involved?\nTurning to the field of education, there isn't any doubt in my mind at all but that our society\ntoday knows that it must become more and more involved in the field of education. It isn't\nnecessary to repeat all of the evidence that has been brought together pointing to the conclu¬\nsion that our people must be provided with more and more educational opportunities and as\na result of this growing conviction, that there must be a marked increase in the investment\nthat society makes in the field of education. There isn't any doubt at all but that the federal\ngovernment is going to increase its investment. There isn't any doubt in my mind but that\nthe present Congress will pass major legislation providing additional resources in the field\nof elementary and secondary education. There isn't any doubt in my mind that the present\nCongress will pass additional legislation adding to the resources that it provided at the last\nsession of congress for the field of higher education both public and private.\nAnd as we face the fact of life that the federal government will continue to step up its invest¬\nment in the field of education, oftentimes we ask ourselves the question - will this in the long\nrun seriously impair the basic freedoms of our educational institutions at all levels? My\nanswer, whenever I am asked that question is simply this - it could lead to that result.\nThere isn't any doubt at all but that increasing involvement on the part of the federal govern¬\nment in helping to pay the bills of education brings with it the dao, ger of controls that could\nseriously interfere with our basic freedom. To me this means that the educational community\nand the friends of educa tion must become more and more involved in government in order to\nmake sure that our system of checks and balances operates in such a manner as to protect\neducation's basic freedoms."
}