{
  "id": "d1018-27",
  "text": "Flemming\n5\neffective program of law enforcement. Of course itrs a challenge to develop programs that are\nconsistent with the Bill of Rights and at the same time provide use with the kind of law enforce¬\nment that we need in our community. But man is capable of responding to that kind of a\nchallenge. Are we willing to become involved in what is in many, many communities the un¬\npopular side of this issue? I believe that the interpretations of our Bill of Rights the Supreme\nCourt of the United States has given us have become a fact of life. I believe that we should\naccept it as a fact of life, not reluctantly but willingly, as a challenge to develop meaningful\nand effective programs of law enforcement.\nAll of us are aware of the fact that we still have in our midst the extremist who believes that\nhis cause is so just and so important that he can - and he feels must - ignore the concept of\nthe dignity and worth of each human being in order to achieve objectives that he believes he\ncannot achieve in any other way. He is a threat to the life of our day. Do we stand on the\nsidelines and ignore him or do we defend those who are thusly attacked and thus run the risk\nof being attacked ourselves? Involvement in this issue does involve risk. Do we work with\nthe extremist in an effort to bring him to the place where he is willing to give top priority\nto the concept of the dignity and worth of each human being. Involvement of this kind is risky\nand oftentimes frustrating, but isn't it the constructive approach to what is certainly one of\nour serious problems?\nI went to Washington, D. C. for the first time to live and to work in the fall of 1927. As I\nthink of the conditions that prevailed in the capital city of our nation in the fall of 1927 in the\narea of human rights and the situation that exists at the present time, there isn't any doubt\nin my mind but that we have made marked progress. Also, there isn't any question in my\nmind but that if we do not continue to become involved in these issues in the field of human\nrights that we can slip back very easily rather than continue to move forward. There is\nnothing in the present situation that guarantees progress unless we are willing to become\ninvolved.\nThen also at this point in our history when we are watching developments in another country\nwith genuine concern, it seems to me that all of us need to ask ourselves some questions\nabout our involvement or non-involvement in the issues in the field of international affairs.\nTonight there is convening in the City of New York an international convocation to examine\nthe requirements of peace. Some of the outstanding leaders of the free world as well as\nfrom behind the Iron Curtain are going to examine this issue. In what context? In the con¬\ntext of Pope John s encyclical. Here was a man who was called to a position of leadership\nat a point in life when most of the rules of society would indicate that he should have been\nretired. He realized that he had only a short period of time in which to provide leadership,\nbut in that period of time he was willing to become involved in the basic issues that confront\nour world to such a degree that his influence of course is going to live on for years and years\nto come. What a tribute that this international convocation is being carried on in the context\nof his letter not just to the members of the Catholic Church, but to all human beings every¬\nwhere. I read just recently of a statement made by Mr. Khrushchev to the effect that Pope\nJohn's intervention during that week when it was touch and go as far as Cuba was concerned\nhad a profound effect on his thinking and on the decision that he finally made not to travel the\npath that he had started to travel.\nOne of the persons who will be participating in the International Convocation is Norman Cousins,\nthe editor of the Saturday Review. In a recent issue of the Saturday Review he has this to say:\n\"There are only two groupings of ultimate consequence on earth. One grouping consists of those\nwho give thought to the implications of nuclear war and are willing to look and build beyond"
}