{
  "id": "d1018-37",
  "text": "executive director\nJerrold Sandler\nASSOCIATE DIRECTOR\nJohn P. Witherspoon\nNational Educational Radio\n1346 Connecticut Avenue N.W. Washington D.C. 20036 Telephone 667-6000\nOctober 20, 1964\nMr, James M. Morris\nAssistant to the Director\nDepartment of Educational Media\nOregon State System of Higher Education\n219 Coliseum\nCorvallis, Oregon\nDear Jimmie:\nEver since taking over John Witherspoon's NER duties and his\nfile, I've been meaning to get a letter off to you to pick\nup the threads of his correspondence with you regarding the\nNER, the NAEB, and the WRTC. Your letter of 7 October to\nHarold Hill brings me up to date nicely, and answers in\nadvance a number of questions which I wished to raise.\nFirst of all, I want to offer my hearty endorsement of placing\nthe all-NAEB meeting on Thursday, with divisional sessions on\nthe following morning. John Witherspoon and I discussed, before\nhe left for Washington, a possible approach to programming such\nan all-NAEB session, and I'd like to outline our thinking here,\nand invite your reactions, and those of the others to whom\ncopies of this letter will go.\nEssentially, it seemed to John and myself that what's needed\nmost is a fresh look at the new face of NAEB, now far more\ncomplex and active in many new dimensions. Traditionally,\nBill and Harold have joined us at WRTC to bring us all up to\ndate, but NAEB has grown so that it seems to us that a new,\nand even radical, technique is in order. What I'm proposing\nis this:\nWe assemble at 7:15, and, allowing five or ten minutes for\nthe meeting to come to order and the session chairman to\nintroduce, briefly, those members of the NAEB Board who are\nfrom the west, we settle down before an appropriate number of\nTV sets on which, promptly at 7:30, we see an NAEB Special\nReport from Washington. Contents: Bill, to introduce the\nprogram and introduce Scott Fletcher to report on ETS, Jerry\nSandler on NER, Jim Fellows on ECS, Vem Bronson for the\nIndividual Members Division, and, perhaps others, as well—\nJohn Bystrom for HEW, Frederick Breitenfeld on the ETS-USOE\nProject, even Commissioner Henry if possible. Following the\nformal portion of the program, we're open for questions and\ndiscussion from the floor, put to both the regional represent-\nBOARD\nOF\nDIRECTORS\nCHAIRMAN\nJack D. Summerfield\nRiverside Radio WRVR\n400 Riverside Drive\nNew York City\nMrs. Marjorie Newman\nWFSU\nFlorida State University\nTallahassee, Florida\nE. G. Burrows\nWUOM\nThe University of Michigan\nAnn Arbor, Michigan\nMartin Busch\nKUSD\nUniversity of South Dakota\nVermillion, South Dakota\nJack Burke\nKSAC\nKansas State University\nManhattan, Kansas\nFrank Norwood\nKEBS\nSan Diego State College\nSan Diego, California\nNETWORK\nMANAGER\nRobert E. Underwood, Jr.\n110 Gregory Hall\nUrbana, Illinois\nA DIVISION OF THE NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS"
}