{
  "id": "d1018-83",
  "text": "Castell -I4.-\nmight have been spent to improve and extend the station’s broadcasting resources.\nII\nI want now to shift from administrators and directors to faculty colleagues\nas academic broadcasters. If academic broadcasting is to be a reality, it will\nbe because they make it so. Unless they have \"the will to broadcast\", their\nstation will be little more than an administrative play-t©y. When Professor\nPerry at Harvard wrote his autobiography he called it \"And gladly teach.\" You\ncan borrow that phrase. It must be, or become possible to say \"and gladly broad¬\ncast.\" Without that, academic broadcasting will get no real status. I would\nhave such persons think along two lines: as to choosing a subject; and as to\nhandling it.\n(1) As to a choice of subject, these five suggestions, (a) first, what I\ncall the \"magic platitude\": choose something which you can make both interest¬\ning and valuable. Neither alone is enough. If you can't make the subject inter¬\nesting, leave it alone. Avoid boring your listeners as you would avoid the\nplague. If they cannot say later \"You know, I heard an interesting broadcast\nthe other day,\" you have lost Round One. But you must aim at more than that.\nTo make your subject interesting is necessary, but it is not sufficient. You\nmust also make it valuable. This distinction is quite real. It is one thing\nto say\"I heard an interesting broadcast\"; it is another thing to say \"I heard\na valuable broadcast.\" Over the years academic broadcasting must include the\nsecond in its aim. The people who listen to academic broadcasting are people\nwho are capable of value-judgments. Never forget that fact about them. If\nyou do, they will forget about you. I have referred to this mandatory combin¬\nation (\"interesting and valuable\") as \"the magic platitude.\" It is just that.\nIt is a platitude. What could be more of a platitude? But it is magic,also.\nI say that because its results are nothing short of magic; also because I\nknow of no scientific rules for stating it. To say \"Be interesting and valu¬\nable or be off\" is good advice. To say \"This is how to make your stuff inter¬\nesting and valuable\" is to invoke something of an art, something that throws\nyou back upon intuitions, something that goes into the making of poems and the\npainting of pictures and the telling of stories. These considerations however\ndo not disqualify the ideal. The persisting ideal here is qualitative. It\ndefines for you the character of your excellence.\n(b) you can do more with the magic platitude than merely state it. You\ncan say, for example, \"choose a topic upon which feeling is strong but about\nwhich reflection is not usual though it is profitable.\" That statement goes\na long way to defining a good topic for academic broadcasting. There must be\nsomething about your topicwhich taps the feeling, the concern, of your listen¬\ners. You get nowhere by plugging in on indifference. When I say \"feeling\"\nI do not mean \"emotion.\" I do not mean that academic broadcasting to be inter¬\nesting and valuable must play on the emotions of its listeners. It must tap\nmatters upon which they feel strongly in the sense of having strong convictions.\nBut that was not all. \"Upon which feeling is strong but about which reflection\nis not usual,\" or has not carried them far. This gives your power of reflection\nan area in which to spark, an area of dry timber which has not been burned over.\nUnder those circumstances you can start a fire in their minds. That was still\nnot all. \"Upon which feeling is strong but about which reflection is not usual\nthough it is profitable.\" That last clause is important too. There is no\npoint to blazing a trail which leads nowhere. Your powers of reflection must\nopen up things which your listener's mind would have gotten around to had he\nbrought his powers of thinking to bear upon it. Your topic matters to him, but\nhe has not thought too much about it. You get him to think about it along lines"
}