{
  "id": "d1587-0",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nDBGEIW\nRepresenting non-commercial, educational AM, FM, and TV broadcasting stations, workshops,\nand production centers, owned and operated by colleges, universities, school systems, and public service agencies.\nAPRIL 1952\nNEWS OF NAEB\nWALDO ABBOT\nREGION V MEETING AT NORMAN SUCCESSFUL\nNAEB's first Kellogg project supported regional meeting.\n--\nLIBRARY OF BROADCASTING\nheld- at Normn -40-klahoma)----\nMarch 28 through 30, was pronounced a great success by the Region V members as well\nas by the NAEB officers and headquarters personnel present*\nA total of k3 persons attended the meeting# All of Region V’s eleven active members\nwere present, as were L of the district’s seven associate members# Region V states\nwere represented as follows: Oklahoma—21*5 Kansas—h} Texas—J+j Missouri—3 j New Mex¬\nico— 1; Louisiana—1$ Colorado—1. Also present were the NAEB Executive Committee\n(president, vice-president, secretary and treasurer) and the organizations’s execu¬\ntive director#\nRegional Director John Dunn Makes Arrangemsnts\nUnder the leadership of John Dunn, head of the University of Oklahoma’s VJNAD and\nNAEB Region V director, a varied and stimulating program was presented# The combina¬\ntion of local guest speakers and NAEB personnel provided a core around which were\nbuilt discussions of the radio and television problems of the Region V members\npresent#\nThe meetings were held in the luxurious Oklahoma Memorial Union Building on the Uni¬\nversity campus# Those in attendance were taken on tours of the WNAD studios (all 9\nof them, with shining new equipmenti), convened in meeting rooms in the Union, and\nate their principal meals there* Delegates were housed in the Extension Study Cen¬\nter on the town’s outskirts#\nCOST OF \"NEWS-LETTER\" SUBSCRIPTIONS REDUCED\nAt its February meeting in Urbana the NAEB Executive Committee voted a change in\nNews-Letter subscription rates as follows:\nAll members and associate members will continue to receive the News-Letter as a part\nof their service from NAEB, and subscription rates to non-members will remain at\n$£#00. However, both active and associate members now may have additional subscrip¬\ntions at the reduced price of $2.£0 per year (instead of $£#00 as heretofore)#\nIN THIS ISSUE\nNews of NAEB Activities.-\nRadio and Television Overseas..\nNAEB Tape Network—Richard Rider..\nResearch Report—Dallas Smythe....\n1-11\n12 - lh\nl£ - 16\n16 - 19\nThe N-A-E-B NEWS-LETTER, published monthly, is distributed from\nthe national headquarters office at the University of Illinois. N-A-E-B\nmembers and associate members receive the NEWS-LETTER as part of\nmembership service. Non-members may obtain the publication at a\nsubscription rate of $5.00 per year. All inquiries regarding subscriptions\nand distribution should be addressed to: NAEB, 119 Gregory Hall,\nUniversity of Illinois, Urbana, Illinois. Editorial copy and inquiries\nconcerning editorial matters should be sent to the Editor, Burton\nPaulu, Station KUOM, University of Minnesota, Minneapolis 14,\nMinnesota."
}