{
  "id": "d1587-2",
  "text": "HULL - TAYLOR - HUDSON TO PARIS FOR UNESCO\nThree American television experts attended the first international meeting on televi¬\nsion to be organized by UNESCO — the United Nations Educational* Scientific and\nCultural Organization, They were Robert B. Hudson of Urbana* Illinois* TV consult¬\nant to the Ford Foundation's Fund for Adult Education; Richard B. Hull* director of\nWOI-TV* Ames, Iowa; and Davidson Taylor* general production executive for the NBC\nTelevision network* New York City, As members of the UNESCO Advisory Committee on\nTelevision* they will meet in Paris from April 7 to 12 with men and women from nine\nother countries where television has become an important means of communication,\nLuther H. Evans* Librarian of Congress and chairman of the U, S, National Commission\nfor UNESCO* in making the announcement said that UNESCO had chosen three American\nrepresentatives on its advisory committee of thirteen in recognition of the advanced\ndevelopment of television in this country. The three U, S, experts were chosen by\nUNESCO as representatives of a major television network* a college which has experi¬\nmented in educational television and a member of a research institution which has\ncarried out studies on the influence of television in society.\nOther members of the Committee were Mrs. Mary Adams of BBC-TV and Maurice Corhan*\nformerly director of BBC-TV* Great Britain; Mr, Porche* Director-General of French\nradio and television; Mr. Zaffrani* Secretary-General of radio in Italy; Professor\nKors* President of the Netherlands association for TV; Mr. Besencon* Director-General\nof Swiss radioj and Mr. Seguin, Director of Television for the Canadian Broadcasting\nCorporation,\nThe primary object of UNESCO in organizing the conference was to discover any poss¬\nible ways in which it can itself assist the development of television on the inter¬\nnational plane, and promote its use for the purposes of education* science and\nculture,\nEDUCATIONAL FM GRANT TO KNOXVILLE* TENNESSEE, SCHOOL\nOn January 8 the FCC granted the application of Fulton High School of Knoxville*\nTennessee* for a non-commercial educational FM broadcasting station.\nPROFESSOR GORDON RIDES THE CIRCUIT\nUniversity of Wisconsin Professor E. B. Gordon* known to thousands of Wisconsin boys\nand girls as their invisible singing teacher* has begun his yearly \"circuit ride\" to\nWisconsin towns to conduct his regional music festivals. These festivals climax the\nyear's \"Journeys in Music Land\" broadcasts presented by Professor Gordon over State\nRadio Stations WHA* WLBL* and the State FM network each weex during the school year.\nApproximately 90*000 children are now enrolled in the course.\nThis year Mr. Gordon has arranged 13 regional festivals in addition to the one at\nEdison on May 10* which is expected to bring together more than 3*000 Badger\nchildren.\nThis year at the regional festivals the children will not only see Mr. Gordon and\nsing with him; they'll also be able to meet the man who tells them how to have fun in\nart by radio—James Schwalbach of \"Let's Draw.\" Schwalbach is extension specialist\nin art and design who broadcasts every Tuesday at 1*30 p.m.* using stories and songs\nbased on Wisconsin's rich heritage to teach students the fundamentals of art,\nSchwalbach's part of the program will include a demonstration of the ains of the\ncourse and a showing of some of the work accomplished by his radio pupils."
}