{
  "id": "d1587-5",
  "text": "WOI-TV SERIES REPORT\n-6-\nAs of March 27, the Fund for Adult Education and WOI-TV have produced 11 programs in\nthe current weekly series, \"The Whole Town’s Talking,\" which features Iowa Community\nproblems.\nCitizens from each community appear before the IC>I-TV cameras to air their views on\nthe specific community problem as they see it. And their discussions have been\nlively ones.\nSchools reorganization was the first problem to be tackled by the FAE production\nstaff. First the small community of Cambridge, la., served as the basis for a school\ndiscussion. Viewing groups were set up in the town to watch the program and to hold\nfurther discussions afterward. This same procedure has been enlarged and repeated in\neach community represented since that time.\nFive programs were centered around the school problem theme, ending with a slam-bang\naffair at the Statehouse in Des Moines.\nFollowing two interim programs of evaluation by the Iowa Advisory Committee for the\nFAE and by viewers who had expressed opinions of the program through letters to the\nstation. Cedar Rapids exporters met with representatives of the sugar beet industry\non February 21 and the dairy industry on February 28, to discuss problems of econ¬\nomic interdependence.\nA broadcast from Slater on Iowa’s school bond issue, basically a problem of athletics\nas compared with academic work, was the next program in the series, followed by\nproblems of teenage recreation in Toledo, a courthouse building issue in Guthrie\nCenter, and a county hospital plan in Humboldt.\nA number of interesting developments have been noted following the programs. School\ndistrict reorganization plans have been drawn up and completed by Hardin County since\nthe program two months ago. Teenage recreation councils have been set up in three\ntowns following the program on Toledo’s problem one month ago, and the Slater bond\nissue was voted upon and defeated, although the latter may or may not have been a\nresult of the program.\nSTASHEFF AND WILLIS TO MICHIGAN\nEdward Stasheff, TV supervisor of WNYE, New York, and Edgar E. Willis, professor of\nspeech at San Jose State College, have been appointed to the University of Michigan\nspeech department faculty effective next fall.\nStasheff is producer of \"living Blackboard,\" a public school television series. He\nhas been writer-director for WNYE and education director at TV station WPIX, both in\nNew York City. Willis is in charge of radio and television at San Jose. In 19UO-ii3\nhe was in the radio department of Detroit Public Schools and director of forensics at\nWayne University after the War.\n\"With these two additions to the staff we plan to increase our radio and television\ncourse offerings,\" said Garnet R. Garrison, director of television and professor of\nspeech at the University of Michigan.\nMichigan now has a weekly series of one hour Telecourses on Sunday over WWJ-TV,\nDetroit; WJIM-TV, Lansing; and WKZO-TV, Kalamazoo. A Saturday half-hour series is\ncarried by WOOD-TV, Grand Rapids. Fifteen student radio shows are produced each week\nby the Speech Department."
}