{
  "id": "d1587-9",
  "text": "-10-\nKUSD HAS 2 OOP WEEKLY RURAL SCHOOL LISTENERS\nIn-school radio programs, which have been featured by the University of South Dakota\nradio station for the past five months, are being listened to by more than 2000 rural\nschool children weekly, according to a recent survey made by KUSD. These programs,\nbroadcast each afternoon for the schoolroom, cover a variety of subjects including\nscience, geography, social science, history, music, literature and s peech. Teachers\nare supplied with manuals concerning the programs,\nA survey of the school of the air showed that of the rural schools in the KUSD area,\nall that had radios listened to at least one of the ten programs each week# The sur¬\nvey showed that of the schools in the KUSD area, ll$ schools listened to from one to\nten programs each week* Of the 393 schools answering the questionnaire, 199 were\nwithout radios* Poor reception was listed by 18 schools as a reason for not listen¬\ning to these programs, and 13 schools reported not listening because they could not\nlocate the station, or because they were teaching in a specialized field not covered\nby the school of the air*\nFor the schools not having radios, tape recordings of the various programs are sent\nthem free of charge. This tape exchange is a free service of the University station.\nTwenty-seven South Dakota schools have used 323 tape recorded 1$ minute school of the\nair programs in their classrooms*\nNEW RADIO-TV INSTRUCTOR AT MIAMI UNIVERSITY\nEdgar D. Talbert of Rock Hill, S, C., has been appointed radio and television instruc¬\ntor in the University of Miami (Fla.) Radio and Television Department* In addition\nto teaching, he will supervise news and music programs produced by the department for\nbroadcast over Greater Miami commerical stations*\nTalbert, a graduate of the University in 19 U9, was program director at Station WTYC,\nRock Hill. He also did graduate work at U. of M. in 19U9 and at Winthrop College,\nRock Hill, in 1991. Talbert has also been active in civic radio and theatre pro¬\nductions as an actor and director. He served as a corporal in the 10th Armored\nDivision, 3rd Army, 19 months in the European theater of operations.\nHe takes over the vacancy at the University caused by ill health of T. J. Wertenbaker,\nJr., now on leave of absence.\nSECOND EDITION NAEB BIBLIOGRAPHY BEING PREPARED\nAll NAEB members are invited to make suggestions in regard to the second edition of\nthe radio-television bibliography being prepared by the secretary for summer re¬\nlease. All the standard periodical and book publication guides have been used to\ncompile a detailed list of all articles on the non-engineering .aspects of radio and\ntelevision published from January 19U9 to date. These will be grouped into cate¬\ngories similar to those used in the original edition of the guide issued in the sum¬\nmer of 1990.\nWhen completed the bibliography is expected to cover approximately one hundred stan¬\ndard single-spaced typewritten p^ges.\nSuggestions as to the format of the new edition or on its contents should be sent\nimmediately to the NAEB secretary. Burton Paulu, Station KU0M, University of\nMinnesota, Minneapolis llj., Minnesota."
}