{
  "id": "d290-12",
  "text": "NATIONAL ASSOCIATION (F EDUCATIONAL BROADCASTERS\nReport of the Network Acceptance Committee\nPresented at the NAEB 37th Annual Convention\nOctober 23-26, 1961s Washington, D. C.\nIn his report to this convention. Network Manager Bob Underwood has\nalready indicated the changes and growth in network operations this past year.\nThe revised Network Acceptance Committee, which took office in February of this\nyear, has coordinated its activities closely with Mr, Underwood, Miss Seaman\nand Mssrs, Boyle, Giese, Harrison, Estell, Eblon, Qu&yle, Curry, Norwood,\nGoodrich, Busch, Regnell and Chairman Burrows, have operated on two assumptions\n1) that the NAEB Radio Network is a vital part of NAEB and should be preserved,\nand 2) that to increase the netT*orkfs potentialities and value, the Acceptance\nCommittee must widen the scope of its operations and assume new responsibilitSlo\nPending the appointment of a full-time program man for the network, the commit¬\ntee has sought not only to judge regular offerings from member stations and\noutside sources, but to seek out and develop new program ideas and sources.\nSince February, the committee has judged some 38 separate series of\nprograms. The committee assisted Ip the Inauguration of WASHINGTON REPORT and\nSPECIAL OF THE WEEK, with emphasis on the national and international scene.\nThe committee approved the scheduling of a weekly series of three five-minute\ncommentary programs, something completely new for NAEB. Through the committee,\na fruitful relationship with Radio Nederland in Holland has lead to the plan¬\nning of a weekly series of l5~minut@ news programs beamed by shortwave from\nEurope especially for the use of NAEB member stations. New contacts have been\nmade with Scandinavian broadcasters through Radio Sweden, with Italian Radio\nthrough the American Academy in Rome, with Radio Japan and with other foreign'\nbroadcasters. These contacts, it is anticipated, will lead to the acquisition\nof new program materials not currently being distributed in this country by any\nother agency. Mr. Underwood has spoken earlier of the gratifying assistance\nextended by the Voice of America in permitting NAEB to obtain and distribute\nprogram materials initially produced for overseas consumption."
}