{
  "id": "d274-102",
  "text": "MINUTES OF MEETING- OF THE ADULT EDUCATION COMMITTEE OF THE\nNAEB HELD IN NEW YORK CITY TUESDAY, MARCH 25, 1952\nMembers of the committee present were Probst, chairman, Hull, Siegel, and\nWheatley; by invitation, Harley and Miles; for luncheon only. Fuller and Papp.\n(Hull did not arrive until 10:30 A.M.)\nThe meeting began at 9:30 A.M. Probst stated that there were four general\nitems on the agenda: (l) A report from Harley on the four areas of the pro¬\nject; (2) The question of Harley’s continuance in his present position after\nJune 1; (3) The decision on what to do in the public affairs program project\narea with the development of the withdrawal by Las swell of his suggestion\nfor a Washington, D.C. program operation; and (a) A report of the recent meet¬\ning with the Fund for Adult Education in Pasadena.\nInasmuch as Hull had been present in Pasadena and was familiar with that area\nof the agenda, Probst suggested that to economize on time the meeting begin\nwith item four—a review of the recent meeting with Mr. Scott Fletcher and\nthe staff of the FAE in Pasadena. Harley, Hull, Probst, and Wheatley had been\ninvited as individuals to come to Pasadena and consult with Fletcher and his\nstaff at the FAE on the problem of educational television. A number of other\npeople were also invited, among them President Arthur S. Adams of the American\nCouncil on Education and Ralph Steetle. At all times 16 to 13 people were in\nthe meetings. More than half the time was spent discussing television. Ther^\nwas no place nor opportunity for a statement on NAEB needs for next year.\nThere were no promises made that there would be any grants; in general, however,\nit can be said that Fletcher and his entire staff were very pleased with the\nprogress that had been made and that they were completely sold on the Adult\nEducation Project of the NAEB. They are impressed by the quality of the people\nwe have assembled to work on the Lowell project; for example, Mr. Fletcher is\nvery impressed by Professor Walter Goldschmidt, director of our Ways of Mankind\nproject. The only specific grant made by Mr. Fletcher to the NAEB was $3,000.00\nfor printing the Chicago and second New York monitoring studies. This money is\nnow on its way to Treasurer Schooley.\nThe views of Mr. Fletcher regarding publicity on the monitoring studies have\nchanged. Mr. Fletcher wants as wide a dissemination of the results of the\nstudies as can be made. In the discussion on this point, after the request\nfor $2,500.00 had been presented by Probst, an additional $500.00 was granted\nby Mr. Fletcher to be used for promotional purposes. Mr. Fletcher asked who\nwas handling NAEB promotion. He wants a vigorous campaign to promote the studies\n—but not a political fight type of promotion. Mr. Fletcher said he was not\nimpressed by the promotion and news coverage given to the Los Angeles study,\nand that the FAE wants wider dissemination of the information collected. They\nwould like to see articles appear in the Readers Digest, etc. Siegel stated\nthat he believed Fletcher should be pleased with the promotion and news cover¬\nage that was given to the Los Angeles study. Probst said that the matter of\npromotion was the NAEB’s responsibility—that the Adult Education Committee was\nno longer the Committee to Supervise the Monitoring Studies, and the promotion\nproblem continued to be Siegel’s responsibility. Siegel said that it would be\neasy to work up a big campaign on the studies, but that the optimum time for\npublicity was past—that the studies were getting old."
}