{
  "id": "d274-119",
  "text": "APPENDIX B\nMEMORANDUM ON PUBLIC DISCUSSION AREA - NATIONAL ADULT EDUCATION PROJECT\nBy William Harley\nApril k9 1952\nThe following summarizes conversations which the Program Coordinator held\nrecently with ProfessorsRobert Merton, Columbia, and Harold Lasswell, Yale*\nMr. Merton expressed interest in the talk-back proposal and felt that it\nhad considerable merit providing that the objectives of the program were somewhat\naltered. He felt that it would not provide a valid representation of cross-\nsection opinion across th& country (since it would be impossible to validate\nsmall groups of individuals as representative of regions), but that the program\ncould perform a significant educational function as a demonstration of the com¬\nmunications process. He suggested that the final ten minutes of the program be\ndevoted to an analysis by an expert on the preceding discussion, pointing out\ninstances of agreement, unresolved arguments, misunderstandings, etc., together\nwith the probable reasons therefor.\nHe felt that the \"cricket vote\" technique would not be a valid sampling\nof public opinion, either; although he thought it might have some validity if it\nwere used to indicate a shift of sentiment between a pre-broadcast vote and a\nvote taken during a program.\nMr. Merton agreed to serve as a consultant on a small pilot project in\nthis area if we could assure him that he would not be \"involved in hours of fruit¬\nless discussion, but could have relatively short sessions in which we reported\nour activities and he gave us three or four ideas which we then went out and\nacted upon.\"\nIt is proposed that we try an experimental project on the talk-back idea\nwith the production centered at Boston in charge of Ralph Tangney, a skilled tape\neditor and writer, and with Parker Wheatley informally overseeing the operation.\nMr. Lasswell in a brief luncheon conversation March 30 gave these reactions\nto proposals in the public discussion area. Lasswell said:\n1. The international discussion series of the BBC, etc., has many\nexcellent and obvious ideas, but is a pretty conventional formula*\n2. The talk-back proposal has the advantage of station participation,\nand he concurs with Merton’s notion of its objective, with the addi¬\ntional element that the analyst should emphasize the degree of\nclarification achieved.\n3. The Milton Mayer series and the talks on communications he said were\n\"self-evidently good ideas.\"\nRegarding his future relations with the NAEB, Lasswell said that he was,\nof course, principally interested in causes or objectives, and that since he\nmust budget his time, it was difficult to decide how it might best be disposed;\naccordingly, he wished to be associated with ventures which were more likely to\nimplement his ideas successfully."
}