{
  "id": "d274-139",
  "text": "October 2, 195>1\nNaEB Policy Letter\nMessrso Ausmus, Gaines, Harley, Hudson, Hull, McCarty, Hiller, Paulu,\nProbst, Schramm, Siegel, Stefctle, and Wheatley.\nGENTLEMEN:— This was to have been a chatty note-—but it now takes\non a serious mien* Frank Schooley just arrived with the news that\nWole Griffith died Saturday, Septender 29 and was buried yesterday,\nOctober lo Details are hazy here but include a blood clot and an\namputation,. Trust Hull and Paulu will fill us in on detailso\n•\nPURPOSE OF THIS LETTER is to provide a bit of liaison between the pol-\nicy level people in NAEB. I have long had the idea that something in-\nbetween Newsletters was needed. My idea was general distribution to\nmemberso Ralph Steetle suggested that we start it out by having it\namong this group. It looks like a good idea—-and herewith is the first\nsuch. No regular publication date is planned. Issue will be when war-\nranted. You are free to compose your own and distribute it---or send it\nyour information to me and 1*11 include it in the next one.\nNEW YORK TRIP. Your Executive Director started his tenure with a two\nweeks trip to New iorkas a delegate of the Carnegie Endowment for Peace-\nWorld Affairs Roundtable. This was the deal that Siegel mentioned at\nthe Allerton board meeting in June* Carnegie decided to make the parti®*\ncipants Adult Education people rather than all radio--—although we\nwere well represented with Siegel, Ausmus and Miles. Preceding this was\nan augmented Kellogg Executive committee meeting. Present were Siegel,\nAusmus, Paulu, Hull, Harley, Steetle, and Miles. Weill not attempt to\nreport in these memos the minutes of any meeting—leaving that to the\nSecretary. We 'did settle matters of policy regarding the Kellogg grant.\nHad reports from Steetle on JCET and Harley on Ford plus Hull on the\nAmes grant and a general report on the TV surveys* Hull and I visited\nseveral recording sections of the Networks—-he on a Kine problem and I\ntrying to find out something further on the mass duplicator. Got some\nleads on the latter which further investigation showed promising. Best\nbet seems to be Fairchild. Waiting now on a firm bid. Carnegie really\nparaded the best for us -soma of which will coma to you via the tape\nnet. Found that Siegel had completed arrangements for a show on Fire\nPrevention week with the Fire Underwriters., It is now being duplicated\nand will be distributed on a limited basis* The Herald Tribune forum\nplans were well underway too. HT has since confirmed its offer of &6C0\nworth of tapes and WNYC will make the originals which tape hdqts. will\ndub and distribute on limited basis* Fred Rope at the USUN (U.S* Mission\nto thfe U.N*) has promised a series of fbui* 1^-mlriutfe shows on th£ USUN\nposition on agenda items at the coming General Assembly oil the U«$L>\nHaven't recieved these as yet."
}