{
  "id": "d274-140",
  "text": "i\npa;-e 2\nNEW YORK SIDELITEo IT you ever HAVE 'to be in New York for two weeks—\narrange it so that Siegel shows you around* ®. * and has two good non-New\nYorkers helping® ®® like Paulu and Ausmus® Oh yes, I could mention some\noutside help too«®0&®but I won't here®\nWASHINGTON is a nice place to be in late September* Had the chance to\nquiz Phillip Jessup®®o®and Ralph Steetle® Don*t know who offered the\nmost stimulation* The JCET office is a beehive with plenty of results\nto show for the effort* Ralph reported over 300 filings* Scuttlebutt\naround Washington was March *£2 on final FFC TV report* Steetle\nattended the Hennock hearxingSo Plans for Biloxi are progressing*\nAusmus and Siegel worked them over in N®Y® and Steetle got in his licks\nin Washington* Coy and Walker slated to be there, ditto Dorothy Gordon\nof the Times o * * Charles Siepraann®®®Charter Heslipo®*He3.en Waller of the\nHerald Tribune* Plenty of activity too on the part of Discussion leaders*\nlooks lixe the best NAEB meeting ever*\nBILOXI TROTS* These items sore than likely will come up at the board\nmeetings* (I'm not trying to set an agenda SyJ) Further definition of\nel.&gibility for membership* Constitutional changes necessary for\nappointment of an Executive Director* rtith Griff's passing a new treas¬\nurer® Membership of WEVC-FM, Evansville College, Evansville, Indiana,\nand others® Final clearing up of finances under the old JCET® Add some\nothers as you will* With these items and others for the board®®«plus\nthe selection of officers and half the board—plus many stimulating\nspeakers and discussions,®«.®plus November in'Biloxi® What more could\none ask?\nHEADQUARTERS NOTES® Hired a secretary today thus rounding out our staff\nat five® . Have installed as a temporary measure a new Magnecarder ampliC\nfier capable of feeding three reeling mechanisms-which aids duplication\nappreciably® No hop for the mass duplicator from any source before\nMarch *52® We're well ahead of the game on this matter® All of the\nrecording, services in NY were worried about the problem but it was not\nan immediate one with ifchem® They are all sure that TV Kines will event¬\nually be on tape-—so maybe we'll beat the nets in one way® Hope all\nyou guys now have us on your regular mailing lists® We'd appreciate\ngetting everything you put out®®®printed, mimeoed, or otherwise®\nTOO AND SO LONG Tills is already too long®*®olet us have your reactions—\nalso your ideas on how headquarters can help your operation®\nRegards,\nJIM\nNote in current broadcasting Tel Taylor is going to government position®\nwhat's the score Steetle? What do you guys think ox the WBAL-TV ad on\npage 97 of Oct* 1 Broadcasting?\nHad a nice visit with Walter Emery in Washinrton® He's got time to\nlisten to your problems now®o*<,in his new position as Ass*t to Commr0\nWalker® Address him at Rm 721*0 New P®0» Bldg® Phone—Exec® 36U*"
}