{
  "id": "d274-19",
  "text": "Personal Observation\n-3\nSupplemental income would be sought from foundations and\nproject activities, but these funds would be add-ons and\nwould not be counted on for basic support.\nThe Fellows memo was given sufficient endorsement by staff\nto warrant a special staff task force which is now developing\na paper on costs, staffing, services, market potential, etc.\nfor early staff attention.\nFinally, I suggest we look upon the current situation as a\nway of making a virtue out of adversity. Let us move forward\nto seize this opportunity to accelerate moves that might\notherwise have failed or taken decades to accomplish through\nevolutionary processes:\n1. The development of a new unified structure to\nrepresent the broadcast licensees, exploiting\nthe power potential of lay board members and,\n2. the development of a companion organization\nserving the professional needs of all elements\nin the field and fostering the public\ntelecommunications concept for the future.\nIt is appropriate to examine the whole range of emerging\npossibilities and not act with precipitate haste. We\nneed to trace out and assess the impact of new approaches\non related activities in order to predict how effective\nthe new set of interacting elements will perform.\nIt is also wise not to break completely or even substantially\nwith the past, but to rectify weaknesses and build upon\npresent strengths. It is non-pragmatic to believe that a\ntotally new system can spring forth full-grown and be\ncapable of meeting all our needs. Educational institutions\nare more evolutionary than they are revolutionary.\nNAEB has demonstrated in the past that it is fully capable\nof generating modifications that are constructively\nresponsive to altered circumstances and reflect our\nawareness of changing necessities. Nor should we take the\neasy or most expedient way.\nWhat we must do is to act, rather than merely react, and\nexert the power of creativity that shapes a system to fit\nthe times and need.\n3/15/73\n. -WGH"
}