{
  "id": "d274-37",
  "text": "6« In the United States people tend to listen or view stations for the\nfollowing reasons in the following order of importance.\na) Strength or accessibility of signal of the station, e.g.\nease and clarity with which one station is received as op¬\nposed to another. (This factor has special application in\nterns of UHF transmitters in VHF areas.)\nb) Frequency of the program. All other things being equal, a\nfairly good program or even a poor program has a better chance\nof acceptance if it is heard five times a week rather than\nonce; once per week rather than once per month; once per\nmonth rather than once per year.\ne) The program itself.\nThese factors apparently do not prevail to the same extent on the Continent.\nPeople do not devote as much time to looking and listening asrthey do in the\nUnited States. The factor of competition between stations for the listening-\nviewing Attention of the individual is not the same major factor.\nIn the United States, however, any station must be on the air at regu3a r times,\noften enough, and long enough to create a habit of listening and looking. As one\nindividual at the University of Michigan said a long time ago, nthe university\nmust present programs when the people wish to listen, not when the University\nwants them to listen\".\nIf one agrees cm these propositions, a conzaon concept of educators about tele¬\nvision is iranediately rendered absurd—namely, the idea of an educational tele¬\nvision station being on the air only two or three hours a week (if that is the\nmaximum amount of quality programs it can produce) • First, no one can predict¬\nably write masterpieces* secondly, the practical effect of such a policy is for\nthe station to completely escape public attention or have to spend time and\nmoney in promoting audience attention to its \"special occasional features\" com¬\npletely but of proportion to its budget. (The best \"premotion\" is the continued\npresence of the station itself with frequent programs which approach, if they\ndo not begin to reach, the \"ideal standard\").\nObviously educators are primarily concerned with \"the program itself\" and they\nregard these other matters as of minor or passing importance. However, having\nembarked on station operation, the university finds itself in the midst of a very\ncomplex activity, no portion of which can be neglected. It is one thing for the\nUniversity of Chicago to air a single program on NBC where myriad member stations\nthrough their 18 hour per day transmitter operations and through days and weeks\nof presentation of other programs provide a vehicle for airing the Chicago\nUniversity program to a ready-made audience. It is another matter for that\nuniversity to assume the obligation of building and operating a station which\nmust carry on the whole business of transmitter operation and maintenance and sus¬\ntain a schedule of programs of many kinds prior to presentation of the one-time\napiece de resistance\" the University especially values.\nA college information service can fancy itself in the newspaper business through\nits system of press releases, but it does not have the trying necessity of operating\nprinting presses, collecting news, laying out pages, maintaining a circulation\ndepartment, etc., which a newspaper faces. Actually, the information service\nhas taken a \"free ride\" on an already established channel of conuiunication."
}