{
  "id": "d274-42",
  "text": "FINAL SERMON\nPaul Laz are fold has said \"in the 20th Century there no longer is any still small\nvoice without the RESONANCE of mass communications\"*\nTechnically in the 20th Century mankind is better able to communicate more infor¬\nmation more rapidly than any time in the known history of the world.\nThe proposition that much of the communicated information is contradictory, worth¬\nless, cheapening, confusing, and sometimes deliberately distorted requires little\nargument.\nObviously devoted, sincere, and intelligent men in all walks of life (and especially\neducators) have a duty and responsibility to improve and enrich our system of mass\ncommunications.\nIn a republic dedicated to the principle of ballot and the rule of the majority—\na part of that Western World of free peoples, engaged (as Barbara Ward has said)\nin a 500 year old experiment testing whether or not democracy will work—the role\nof the mass media is supremely important.\nIncreasingly the \"pictures of the world inside our heads\" are derived from the\ntelevision screens.\nIf those pictures are distorted, or significant portions of the pictures are ab¬\nsent, or if the pictures of the worthwhile and significant are not presented\noften enough for people to understand and remember, then their concept of the\nworld is completely inadequate to provide any basis for self-government. Indeed\nanother step is for those who control the pictures by default or intent to do\nthe governing themselves.\nEducators and educated men tend to shrink from the prospect the acceptance of\nthis responsibility poses—not only because of the fights, the problems, and the\ndifficulties the assumption of such a role suggests, but to a large degree be¬\ncause they do not understand their indicated responsibility and whan they face,\nin fact, the techniques of dealing with a so-called \"mass\" it appears at such\nvariance with their own well-ordered and cultivated universe of taste, reason,\nand culture that they blanch at the descent into the market place.\nA? I have said before, this is not precisely a matter of free choice*. Either\ntie educator lives in this world or by absenting himself from it, allows the\nconditions to be created that will end by destroying not only his special\nmiverse but the society that has permitted him this enjoyment.\nIe does not understand or appreciate how strongly the winds of anti-intel-\n:.ectualisra are blowing; nor that the protection he has thus far enjoyed\nis for other reasons than his own efforts. It is like the United States and\nthe Monroe Doctrine with American patriots fancying their promulgation was\neffective because they said it, and not because of the British fleet. Can\nany discerning educator doubt what a McCarthyism come to full flower should\nmean? Can he doubt what sins of omission or emphasis on any major political\nor social development would mean? Can he argue that he cannot afford to counter\nthis and should have been countering it via the mass media?\nWhen all this is summarized it means there are several kinds of educational"
}