{
  "id": "d274-61",
  "text": "account o Surely it is a fiscal consideration to insure that the minimum number\nof organisations are maintained to do the job.\n(We shall attach here a separate estimate of the budget needed if the NAEB\nis to take over the various functions needed.)\nIV. Administrative Structure:\nWithout regard to who is to be which organization, it is obviously essential\nthat we have, as listed above:\n1) A strong professional organization\n2) A Network exchange mechanism (both for TV and radio)\n3) A facility for collecting materials (which Wilbur Schramm compares to a\nNew York office of the AP)\nk) Legislative representation\n5) A source of aid, comfort, and advice, which is in essence the spirit of\nthe NAEB.\nCertainly it will be essential to have the first two organizations mentioned\nabove. \"The New York office of the AP,\" as a source of materials might well be\nincluded in our Washington office. The latter, if it is to take over from the\nJCET its most essential functions and also provide liasion with the ACE, naces®\nsazy lobby activities, and tape and film studios, should probably be located in\na large building with the AP and perhaps a Center representative.\nOur present management and legal council could be somewhat expanded, as we\nthus move into the Washington picture. It is believed that we would no longer\nneed an engineering consultant or a legal consultant aside from those provided\nby the NAEB as the professional society Involved. The combination resulting in\nWashington would then preserve the functions of the NAEB, the ETEC and the JCET.\nMost of the functions of the NCGET can now be considered as virtually completed.\n(Some areas feel that their influence has done great harm in ary case).\nReplacing the JCET, but as a new committee of the NAEB, might be something\nlike a JEAC: Joint Educational Advisory Council. This might include the present\nJCET Board, plus representative of Teachers Colleges, School Board Associations,\nClassroom Teachers Associations, the National PTA, the Junior League, the Federa¬\ntion of Women3 s Clubs, the AAUW, the League of Women Voters, the NUEA (National\nUniversity Extension Association), Associations of Principals, the AEA, etc.\nThese representatives might be on a rotating basis (with the MENC, for ex¬\nample, in an active status this year, but replaced next year by another organi¬\nzation) . An executive committee of the above council would meet with the NAEB\nBoard once a year.\nThe additional functions visualized for the Washington office, were essen¬\ntially legal, lobby, liasion, and reporting."
}