{
  "id": "d274-91",
  "text": "-2~\nWalter Emery was tied up with JCC hearing on the TV allocation plan*\nbut X finally got to him Saturday afternoon at his nice home in Chevy Chase, Md.\nX also ran into Eldon Campbell, who is alumnus of WILL, and a good friend of Allen\nMiller and also at one timo my boss at WOWO at Port Wayne® He is doing real well\nas national sales coordinator for Westinghouso Radio Stations, Inc*\nAMERICAN COTMJIL MEETINGS-*4’ho real purpose for my trip to Washington ms to attend\nthe American Council of Educational Conference of Organisation Member Representa¬\ntives® It is a real thrill to see this -vast organization rrork® 2 am sure m> have\nlong appreciated the work the American Council does, but none of us have really\nunderstood the tremendous pressures that are exorted by all sorts of diverse inter*\nests which the group represents® It is literally a wonder that they can toko a\nstand on any subject concerning education* It is only because men of good faith\nstrongly believe in the necessity for education at all levels that the Council ha®\nsucceeded® Maybe vm can take a leaf from their bock*\nPrimary areas of consideration at the meeting tserc public illations,\ninternational understanding, veterans benefits, and NUT and all of its ramifications®\nThis is all put together under one publication called \"Education and National\nSecurity'* * a 60*pag9&oci3B3nfc Ydiioh can be secured for I®50 by writing to the\nAmerican Council on Education, 1785 Massachusetts Avenue, H.W®, Yfoshingfcon 6, D« C®\nIt occurred to no that with the hundred or so associations which were\nrepresented at this mooting, wo my have a wry live potential source of informa¬\ntion for a series of shows on education. It certainly will beer further inwstiga-\ntion«\nTHE MASS DUPLICATOR PRQBLBXI~*AHQng th© things I had thouglrb would take a few minutes\nto do in Washington was to visit Georgettsm University and see their msc duplicator\nin action* My first shook ms that it w&sn’t &t Georgetown but ms uith an engineer\nby tii© mm® of Ra*rd©a Smith, vdw ms setting up to make -taps duplicates on a con~\nmercial basis® My visit with Smith took something less than k hours during which\nI got a terrific sales talk on the value of the machine and some indication that\nhe, not Toogood, ms the man who would ©^mutually be able to supply us a roaohiae-\nbut no further indication ae to when sue!?, a machine might b© available®\nI then visited Dr. Dorstair, Head of the Linguistic Institute of Georgetown\nUniversity® This is an amassing institution which teaches 26 different languages\nand can make almost anyone a conversationalist in any of these languages within an\namazingly short time*\nTo do this they use some 100 brush soundn&rror tape recorders. They have\n16 of them set up so that they can put a master on any one and dub on the other 15.\nThe system works but the quality leaves much to be desired. Dorstair was very\ninsistent upon his need for a mass duplicator and was more than willing to go along\nwith us to get one developed. I plan to pursue this whole area much further in\nthe immediate future and will have a more complete report for you*"
}