{
  "id": "d1520-17",
  "text": "FET'rS FROM REGION III (Cont)\n18-\nOhio\nH-A-E-B Station UBOE-FI, Cleveland Board of Education, plans to expand activities in\nthe near future to include evening broadcast time for adult audiences. They current¬\nly serve (as they have as America’s pioneer FM school station) the Cleveland City\nSchool system during the day. They have just erected a new high-gain FI antenna for\ngreater efficiency.\nF-A-E-B President, Pick Hull and Iowa State College Information Director, C, R.\nElder, were visitors at Ohio State University WOSU and Radio Institute in late\nJanuary. They also visited station UBOE, Cleveland, and F-A-E-B station ISM,\nPurdue University in Indiana.\nThe Ohio EarniBureau has a new station, exclusively for farmers, operating in\nUcrthington, Ohio. FRED, Ohio’s first completely rural station is hacked cooper¬\natively by the more than 55,000 members of the Farm Bureau Federation. URED went\non the air September 27 and will specialize in programs for farm people*\nIndiana\nF-A-E-B station UBAA, Purdue University, LaEayette, broadcast the longest remote\nin its history on January 1 and 2— 7 hours of basketball with 4 universities,\nUBAA Director Jim Miles has an excellent school of the air schedule set up and a\nclip sheet (a good idea for all stations) which briefly and interestingly describes\nthe history and policies of UBAA. Miles operates a good station in a very intelli¬\ngent far-sighted and effective manner.\nHarry Skornia, Radio Director, University of Indiana, Bloomington, hit the headlines\nwith his ''School of the Sky” activities. The Indianapolis Star Magazine of January\n25th carried a double-page spread, describing the wide activities of this univer¬\nsity radio production department,\nMichigan\nF-A-E-B member Faldo Abbot, reports the new University of Michigan station is\nlooking forward to starting of broadcasts. ,rU0M-EM will operate on 91.7 megacycles\nwith a radiated power of 13,500 watts.\nF-A-E-B member station FKAR, Michigan State College, is starting a new program\nseries, says Bob Coleman, station director. Cooperation of all departments on\ncampus has been enlisted to aid in producing a daily ’’Campus Visitor” interview\nseries.\nWisconsin\nF-A-E-B member station UHA has prepared an annual report which is a model for all\nstations. (They have considerable to report on) In addition to UKA operation\nFHA-EM is on the air, and plans for completion of the 7-station EM network are well\nunder way,\n**** ****\nHE^S FROM REGION IV - Regional Director n, Carl Menzer, *rSUI, Io^a City, Iowa\n(Iowa, Minnesota, Forth and South Dakota, Nebraska and Wyoming)\nSouth Dakota\nw_A-E-B station TOJSD (University of South Dakota) Vermillion, has conroleted a\nprogram of studio reconstruction and engineering modernization. To new modern\nstudios in the University Memorial Union building and a new 10-channel console\nthey add a new 1000 watt transmitter acquired from war surplus."
}