{
  "id": "d1520-18",
  "text": "-19-\nNET-7S FROM REGION 17 (Cont.)\nIowa\nN-A-E-B Station UOI (Iowa State College)Ames, was granted permission to \"broadcast\nIowa State College \"basketball games daring the months of Janaary and February. This\nreverses a previous FCC decision on granting UQI a special temporary authorization.\nPermission was also granted to broadcast Farm and Home Week and the National Farm\nInstitute proceedings at night.\nNorth Dakota\nStation KFJM (University of North Dakota) Grand Forks, gives assurance that\nwhat seemed to be license renevral difficulties with the FCC -proved to be techni¬\ncalities.\nIowa\nN-A-E-B Regional Director, Carl Menzer (Station USUI, University of Iowa) reports\nEM station (KSUI-FU) operating on 91.7 megacycles with radiated power\nof 17,500 watts is getting excellent reception reports.\nMinnesota\nN-A-S-B Station TOOK, (University of Minnesota) is distributing a splendid aooear-\n“lnnesota School of the Air 'bulletin for the second semester. Burton Paulu,\n.UOf , manager is proceeding with plans for overseas shortwave transmission of\nAmerican scenes as chairman of a committee for AER.\nN-A-E-B member station TOAL, St. Olaf College, Northfield, reports planning is\nproceeding on WCAL-Frf. rlilford Jensen, manager, will have a report for the Hews-\nletter m the near future.\n*** ***\n77;-S FRCM V ~ Hegional__Directcr - Ralph U, Steetle. 1U.SU, Baton Rouge.La.\n(Missouri, Kansas, Colorado, New Mexico, Oklahoma, Arkansas, Texas and Louisiana)\nTexas\nA conditional grant by the FCC, subject to final approval of engineering details,\nhas been issued to Texas A & M College, College Station, Texas, for a new FM broad¬\ncasting station.\nMary-Hardin-Bay1or College, A texas Baptist college, has applied for membership\nin N-A-E-B. They have applied for a construction permit to construct a new FM\nstation.\nThomas Rishworth, Director of Radio House, University of Texas, attended the NAB\neducational standards meeting recently in Washington, will shortly advise N-A-E-B\nmembers on recommendations and proceedings.\nMissouri\nStation KFUO, St Louis, operated by the Missouri Synod of the Lutheran Church and\nrecognized throughout its listening area for fine program service, plans to proceed\nwith an FM station building program.\nN-A-E-B Station, KSLH-FM, St. Louis Board of Fducation, newly developed facility of\nthe city of St. Louis will have a full-scale report in an early Newsletter. The\nBoard of Education now broadcasts 3 programs weekly over local commercial stations."
}