{
  "id": "d1520-19",
  "text": "ms FROM REGION V (Cont)\n-20-\nOklahoraa\nF-A-E-B member station KOAG-, Oklahoma A & M College, Stillwater, still tied up in\nthe U.S. Circuit Court of Appeals, made a special appearance in the closing week\nof FCC clear channel argument with skywave testimony with respect to WHAS, Louis¬\nville. They plan a complete market news service when facilities are available.\nF-A-E-B member station -.FAD, University of Oklahoma, Forman, has an unusually fine\n•urogram lined up for springobroadcast including an expanded school of the air.\nVice-president of F-A-E-B John Dunn, originator of the F-A-E-B regional plan, con¬\ntinues a vigorous membership campaign.\nFext Fewsletter will carry a full report on the Annual Radio Conference at the\nUniversity of Oklahoma, February 26, 27, 28. Title of the conference \"Few Look\nin Radio\". Director of proceedings is Sherman Lawton. A stellar roster of perform¬\ners expected.\nLouisiana\nAny F-A-E-B members who have not seen the fine feature article on the new University\nof Louisiana station, ULSU-FH in the December alumni magazine of the University\nshould request a copy from Ralph Steetle, ULSU-FM director and Region V F-A-E-B\ndirector.\nFew H-A-^E-B associate member is Southeastern Louisiana College which registered as\na cooperating organization. Royal K, Sanford, director of publications, reports 3\nregular programs per week over commercial stations,\nI-Cansas\nStation KSAC, Kansas State College^ Manhattan, is proceeding with a-program of\nengineering improvement and development including a new tower and a new 5000 watt\ntransmitter.\nF-A-E-B member station, KFKU, University of Kansas, Lawrence, is now operating 1\nkw nite and 5 kw daytime using the facilities of the UREF transmitter. Broad¬\ncast hours run from 2:30 - 3:00 p.m. and 9:30 - 10:00 p.m.\nColorado\nF-A-E-B associate member Rex Brown, director of information Colorado A & M College\nreports cooperative agricultural broadcasts with KOA, KLZ, KCOL, KVOD and 13\nother stations in the Rocky Mountain area.\n*** ***\nFEUS ERQM REG-1 OF VI - Regional Director - Filljam F. Sener - IHTSC. Los Angeles,\nCalifornia (Montana, Washington, California, Idaho, Oregon, Fevada, Arizona, Utah\nand Territory of Hawaii)\nCalifornia\nThe Unified School District of San Diego, California, has applied to the FCC for a\nnew non-commercial, educational FM station to serve as a supplementary teaching\naid to the schools of that district. More detail next Fewsletter,\nThe Associated Students of the University California and the University (An\nF-A-E-B member) are proceeding with #lans to apply for and erect an FM broadcasting\nstation o.n the campus. They have been checking costs and estimates with various\neducational broadcasting stations around the country. Hale Sparks, director of\npublicity fbr the University promises a report in the near future."
}