{
  "id": "d1520-6",
  "text": "BOSTON1 S COOPERATIVE RADIO COUNCIL\n-7-\nThe Cooperative Broadcasting Council, which includes Boston College, Boston\nUniversity, Harvard, Massachusetts Institute of Technology, Northeastern and Tufts,\nproduced and presented 412 programs for nearly 115 hours of education in the first\nyear of the Council’s Broadcasting in Boston, Ralph Lowell, trustee of Lowell\nInstitute, who made the announcements, stated that the programs were released hy\nspecial arrangement over Boston’s six full-time commercial stations,\nCOLLEGE RADIO MEN MEET UITH NAB EDUCATIONAL GROUP\nThe educational standards committee of the National Association of Broadcasters\nmet with radio representatives from colleges and universities in Washington the\nfirst week in February. Purpose was to discuss ways and means of raising the train¬\ning standards for persons entering the broadcast field,\nEducational broadcasters present were Russell Porter, coordinator of radio at the\nUniversity of ^enver; Thomas D, Rishworth, director of Radio House, University of\nTexas; Dr. Kenneth Bartlett, Syracuse University; and Professor Ben Hennecke,\nUniversity of Tulsa.\nCommercial radio representatives,(members of the NAB standards committee) present\nwere: Ralph Hardy, KSL, Salt Lake; Judith Nailer, NBC, Chicago; Dr. Willis Dunbar,\nUKZO, Kalamazoo; F. C. Sowell, ULAC, Nashville; Armand Hunter, UFIL(and Temple\nUniversity), Philadelphia; and Hazel Kenyon, UTOP, Washington.\nRADIO LEADERS TO SPEAK AT ”NEU SCHOOL” SESSIONS\nFCC Commissioner Clifford Durr; ABC vice-president Robert Saudek; and Llewellyn\nWhite, will be guest lecturers at a session on radio at the New School for Social\nResearch in New York on February 27. The lectures are part of a course on free¬\ndom of the press in print, radio, and films, given by the school with Milton D.\nStewart, res-earch director of the President’s Committee on Civil Rights, as chair¬\nman.\nEXPANDED SCHOOL OF THE AIR FOP. STATION WAD IN OKLAHOMA\nN-A-E-B member station WAD(University of Oklahoma) plans a new and expanded School\nof the Air series for spring, 1948. The Oklahoma School of the Air now offers 10\nweekly broadcasts for in-school listening to service more nupils in Oklahoma’s\nrural, consolidated, and independent district classrooms^ WTAD director John\nDunn ( lalso N-A-E-B vice-president) announces the school program includes such\ntypical features as \"Great Figures in American History,” World Incorporated,”\n\"Spotlight on Health,” \"End of the Rainbow”', \"Making Friends with Music,” as well\nas an authoritative series of newscasts for elementary grade levels 5 to 8.\nDirector Dunn points out that School of the Air activities are an expanded service\n.of WAD, serving one more type of special audience. Station WAD1s basic program\nschedule with a fine array of educational, informational, and musical features\nserves a large audience throughout the state of Oklahoma with programs and services\nnot available from other sources.\nJOHN DE PROBP0 OF STATION WYC CELEBRATES 30TH ANNIVERSARY\nOn February 6th, John De Prospo, Executive Officer and Assistant to the Director\nof N-A-E-B member stations, WYC AND WYC-FII, New York, will complete 30 years\nin the service of the City of New York. Starting as clerk with the Commissioner\nof Accounts in 1918, he was transferred to Finance, Plants and Structures, and\nfinally to WYC in 1934,"
}