{
  "id": "d1520-9",
  "text": "OHIO RADIO IF8nITUTB R^CQRDIFGS\n-10-\nA record number of program entries and requests marked this year’s exhibition of\nrecordings and public service programs at the Institute for Education by Radio,\nOhio State University. This is the 12th Annual American Exhibition of Educational\nRadio programs, Although definite figures are not available, Ur. I. Keith Tyler,\ndirector of the 18-year old Institute said indications point to an all-time high\ntotal of programs to be entered in this year’s exhibition,\nCOi-lMUI'TI CAT I OPS COl^URUHCE AT ILLINOIS U.\nThe recently established Institute of Communications Research at the University\nof Illinois, headed by Wilbur Schramm, and established by Dr. George D. Stoddard,\npresident of the University.held a special conference on communications in mid-\nJanuary in Champaign-Urbana. Many prominent people -from the mass media field\nwere present, including Robert Blakely, editorial staff, Des Moines Register and\nTribune; Dr, Paul Lazarfeld, and others. Hugh M. Belville, Jr., director of re¬\nsearch for K3C spoke on the subject, \"The Challenge of the Hew Media of\nCommunications.”\nBelville told the group the field of mass communications faces a-period of evolu¬\ntion comparable to the combined effect of introducing the rotary press and the\nmotion picture camera to the world simultaneously. The new media—television,\nfrequency modulation, and facsimile broadcasting —- can be a hig help in dispelling\n•public ignorance and apathy concerning crucial problems of the day,_He -pointed\nout that a Gallup noil showed 60 per cent of the American -public had no knowledge\nof the Marshall Plan and 39 per cent of the Taft-Uartley law. He saw three\nchallenges which had to be met before these media are fully established, they are:\ntechnical and artistic mastery of each medium, sufficient advertising sup-port, and\ngovernment control.\nBAPTIST^ PT.AH Eli PET WORK U? TEXAS\nAnnlication for an PM butlet has been made by the San Antbnio Baptist Association\nto the FCC. This is nart of a proposed state Bantist network. Dr, Alton Reed of\nDallas has been emuloyed by the Texas Bantist General convention to direct network\norganization. Other stations are to be at Baylor University, Hardin-Simmons,\nMary-Pardin-Baylor College, and churches in Beaumont, Houston and Lubbock.\nTEMPLE UNIVERSITY FORMALLY DEDICATES ITU\" STUDIOS\nFormal dedication of the new $40,000 Temple TMiVersity radio studios took place\nin late January when the student-operated (low-radiation) station, WTRI, goes\non the air, participating in the ceremonies was station WFJL, radio outlet of the\nPhiladelphia Inquirer newspaper, which contributed $25,000 for construction of the\ncampus studios, and which cooperated with Temple University in establishing\nPhiladelphia’s first school of radio.\nA documentary drama by the university’s radio workshop together with a talk by\nTemple University president, Robert L. Johnson, were transcribed by WFIL for\nlater broadcast with WFIL-FM carrying the entire proceedings.\nTemple University’s radio installation consists of four studios, two 25 x 30\nfeet; one 12 x 18 feet, and an announcer’s news booth 8 x 10 feet and modern\nin-put equipment throughout."
}