{
  "id": "d840-0",
  "text": "RATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nAmes, Iowa\nDecember 20, 1948\nTO OFFICERS AND DIRECTORS?\nEnclosed are 6 copies of the revised MSB membex-ship list.. Each of you will\nnote certain errors within your district which we have not been able to correct*\nThere are also several errors which we should have corrected. For instance?\nRegion I WCUV-FM, Columbia University, has cancelled its CP, but is\npaying active dues through remainder of the year*\nUniversity of i aryland—Br* Melvin White, the former radio\nhead, now has a similar position at the University of Hawaii,\nNew head not Inown.\nRegion II I dryland Wilson is on leave, but the membership is held.\nWilson is at th© Nurnberg Dependents School, Rumberg\n1'Hitary Post, APO #696, c/o Postmaster New York.\nUniversity of North Carolina radio head is no1 known.\nRegion HI WBOE, Cleveland Board of Education. Levenson is now asst,\nsupt, of schools and Ed Helman is WBOE director.\nRegion IV KUOM, University of 1'innesota, Burton Paula is on leave.\nRuth Swanson is acting director.\nRegion V O.K.\nRegion VI University of Hawaii. List Dr. I’olvin White instead of\nJoseph Smith.\nI am enclosing six copies of a descriptive paragraph which might be used as\nthe basis for a letter in soliciting membership. If you desire I will have\nan extra run on the next Newsletter, so you have this to distribute for samples 6\nIt will be appreciated if each of you can check your region for accuracy as you\nproceed with rBinbership campaign plans. It would be further appreciated if\nyou send carbons of all contact letters to John Dunn, vice-president, who will\nhead membership arrangement© (and whose previous record of skill in this area\nshows in RegionV of which he was one-time director) and carbons also to W. I.\nGriffith, recording secretary and. treasurer.*\nJohn Dunn will probably bear me out in the suggestion that each regional director\ncould wall follow the FCC section (as well as reviewing older copies) for news\nof educational station action in his region, (torrent issue has several new\napplications."
}