{
  "id": "d840-10",
  "text": "national ASSOCIATION OF EDUCATIONAL BRVujCJASm.3\nRadio Station WOI0 Hdqrs .>\nAm©s„ Iowa\nMarch 7* 1349\nTO OFFICERS AND DIRECTORS AND MEMBERS OF MJSB INVOLVED IN CLEAR CHANNEL CONFLICT*\nEnclosed are four documents!\nAo A subcommittee report by Senators Xobey and McFarland ol’ the Interstate and\nForeign CcsBaaeroo Committee which gives the clearest picture of the non¬\ntechnical issues in American broadcasting today in the opinion of your pres¬\nident. (This deserves your serious study because it affects you, not only\nas a station involved in the clear channel dispute, but in a much larger\nsense,)\nB» A copy of a speech given at the anti-dear channel meeting in Chicago Jan-\nuary 28 by Senator Edwin Co Johnson* Democrat Colorado,, Chairman of the\nSenate Interstate and foreign Commerce Committee.\nG, A bulletin entitled *?he Clear Channel Question” which contains an analysis\nof arguments presented in favor of, and opposed to, use of clear channel\nfrequencies by more than one station in the United States* This wa* prepared\nin the law offices of former Senator Burton Wheelerc\nThe Chicago anti-clear channel meeting brought together 70 individuals who\ncollectively represented more than 139 stations* all opposed to continued\nclear channel dominance\nIt became abundantly clear at this meeting that the clear channel question\nis not on© of serving two ’Nrhite areas on a map1',, but rather a pure and\nsimple question of monopoly—in other words* the b:\\g stations* 24 of them*\nwant to keep what they have and get more*\nNAEB was represented by Director Higgy of WOSU, Ohio State University, and\nby your president * Ho He leak©* Oklahoma A4 M, Radio Director* was pre¬\nvented from attending by a weather-bound train, ' Mr0 Higgy end I decided\nthat HkUB should coopsrate closely but not affiliate itself with the anti*\nclear channel group in Chicago* Arrangements have been made to keep in\ntouch with delegates of this organization* Direct reports to me from\nintimates of Senator Johnson give every indication that he is a suan to be\nrespected and trusted in this struggle against monopoly. Those NAEB sta¬\ntions directly involved should study carefully the material enclosed and\nmake due and conscientious effort not only to contact, but to explain to\ntheir representatives in congress the significance of this situation and\nhow it affects them,\nA report of any aotivity undertaken wi31 be greatly appreciated here* It\ncannot be expected that Senator Johnson and others who are undertaking this\nstruggle against monopoly control of the American air can continue their\nefforts without some indication of support and interest.\nYour comments will be appreciated."
}