{
  "id": "d840-18",
  "text": "&B2i~90\nRATIONAL ASSOCIATION Of JSDUGAfflQMAL\nIowa State College\nArne e« Iowa\nMarch ?8S 1949\nTO? All Officers ami Directors\nFBOUi Dick Hall\n1. Enclosed is a copy of a letter from K®ith Tyler at OSU which ssese to me to ex¬\nplore this religious Bl situation pretty well. Plans are now to make this a major\nitem of discussion at the Coluabue business meowing, Ibvik has talked to Everett\nParker of the Joint He!igious Committee who can help ua clear up this situation,\nParker will he on hand, at Columbus,\n2. Apparently some correspondence has been mislaid in this office. I need re¬\nconfirmation on some director vote# as noted billow. If you haw© voted, please\nvote againg\nA, Annual meeting dates — vote for one ~~ circle your choice\nOctober 9-10-11 October lb-17-18 October 23-24-25\nB» Membership for WQAT, South Dakota Schools of Mines (leg) (Eo)\nC, Membership for Reorganised Church Latter Day Saints (Crac^Iand College)\n(Yes) (Ho)\nD. Proceed with plans for HASB membership placque and have several sample?) pre¬\npared for choice and approval of directors, (Yes) (ho)\nB. Are you keeping in contact with your Congressmen in re Census Bill HR 1958?\n(*•#) (fito)\nWill you list those in following space who indicated support?\nSTATE Hama a i\nP. Clear channel decision will apparently b© mad© by May 1 by the Jj'CGft not the\nSenate. Imperative wo know status of your activity with senators and\ncongressmen. Will you use reverse side of this sheet to answer the follow¬\ning questions*\n(1) Your state and station? (a) A list of your senators and congressmen?\n(2) Have any clear channel contacts been made by you with them in re\nJohnson Bill and general situation?\n(3) Please designate responses from them as fallows? Response*®\n\"favorable#\n\"Against**\n0. Do you want an HAEB exhibit at Columbus meeting? (Yes) (Ho)\nWill appreciate any suggestions you say have re business items for the Columbus\nmeeting.\n(PDSASS HSTORH THIS SHEET)"
}