{
  "id": "d840-32",
  "text": "September 30, 1949\nMr. Richard B. Hull\nRadio Station W0I\nIowa State College\nAmes, Iowa\nDear Dick;\nI have not answered jour various communications for the last three\nweeks because I have been speaking all over the state to Alabama Feder¬\nation of Womens Clubs In the interest of organizing radio councils and\npromoting a series of thirty minute weekly broadcasts which will be\ncorrelated with the club study work of the federated clubs of the state.\nI took up the matter of an appearance at the TV hearings with my\ndean and he and I were of the opinion that the statement which the\npresident sent for your brief on that subject was as far as we could\ngo at the present time and there would be little point in our sending\na represehtative. Yesterday, however, os the result of a letter from\nDr. Bevis, our president asked us to review our stand on It and ad¬\nvise him. I am hoping to get a reaction from our committee by Monday\nend will let you know Immediately if we wish to have a representative\nat Washington. I still think the answer will be no.\nIn your honest opinion, would It help the HAKB TV presentation\nfor us to send © man up there unless that man could say ”we definitely\nexpect the University of Alabama to own and operate it3 own TV station\nwithin the next five to ten years.”\nAbout the transcribed net—I feel that we should go ahead with\nplans for that net on as many stations aa we^can as soon as possible.\nIt will Indicate to the ford foundation that we are trying. If we got\nmoney from the Foundation, then this activity can be absorbed within\nthe Foundation plan. Apparently everybody la too busy In starting\ntheir fall schedule to react to my letters on this subject, however.\nI shall be in Ann Arbor on Friday if at all possible. I have a\nThursday morning date in Birmingham which I cannot cancel and I have\nnot been able to work out a schedule which will get me out of Birmingham\nThursday noon and into Ann Arbor earlier than Friday noon. In any\nevent, I shall see you In Ann Arbor as soon as possible.\nYours very sincerely.\nGraydon Ausmus, Director\nRadio Broadcasting Services\nGA/ns\nP.S. We should have WUOA(FM) rolling by the first of November."
}