{
  "id": "d840-43",
  "text": "law Officea\nCLIFFORD J. DIKE\nCoEBsamwa&lth Building - 1625 *K* Street, H#W.\nWashington 6, D. C*\nEBB-15?\nDecember 1,\nMr. Biohard Hull, President\nRational Association of Educational Broadcasters\nc/o Radio Station WOI\nAmos, Iowa\nDear Dicks\nWhat the hell has happened to th© SAKE? I have Just read FCC Docket 9fr70» Th&\nSouttxern Baptists are moving in on the educational m bend, the Catholics are\nbacking them up, and, so far as the record shows* there is not a chirp of pro-\n* ?*?? 0T* for that nattef* ffom a single educator ©r educational\nins ti tution *\nIt looks t.s if a lot of blood, sweat, and tears had been shad to no purpose.\nt^8® r?^ttQn of 1318 old loeinS flsht to hold a place for education in\nthe Alt band? a# Bombers of the HAEB should too® better than anyone else ®!»t\ntoppane onoe the gate is opened, even though the first small opening is made in\nthe? nmmsa nf ^\nIt is not enough to say that the academic dodoes have been sit&ng on their back-\nsides and letting the educational M band go to waste. The band was not sot\npersonal benefit. It was set aside fbr the benefit of the boys\nand girls of this country and, of the adults who want something more solid la the\nway of radio listening fare than Is provided as a by-product of the advertising\nbusiness. Dod©s, even academic dodoes, have a way of becoming extinct. In\nanother generation most of them will have gone to their reward and educational\nradio will have a chance of doing, on a national scale, *fcat W<H, KUOM, WA,\nMLL and a handful of others have demonstrated it is capable of doing. But\nthe chance will be gene if the educational frequencies are gone.\nI have no objection to religion having its proper place on the air, but it seems\nto me it should seek its space In that portion of the spectrum available to the\nhucksters of soap, cigarettes, and Serutaa, of -riiich there are too many, rather\nthan at the expense of educational radio, of which there is too little| and It\nis pretty discouraging that no educators are appearing before the Federal Communi¬\ncations Commission to say Just that.\nSincerely yours.\n(Signed) Clifford J. Durr"
}