{
  "id": "d1692-55",
  "text": "54\n9, \"Another thing | have learned is that \"people are wonderful0. Let me\nconfirm this statement. Every person I called was extremely willing to\naid me and give me his. opinions on the subject. The listening public\nwas courteous and very eager to state its views,\"\n10 \"This type of survey is very effective in discovering $he likes and\ndislikes of listeners. Due to its length l do not think it would be\nwise to repeat It too often, | would think people would object to\nnumerous requests for their time,, although all those l called were very\nnice about it,\"\n11, 'Most people reacted in a very favorable and cooperative way. Though\ntheir answers were not always ''thought-out* responses, they were honest\nand sincere,\"\n12, \"The voices of many listeners seemed to brighten at each opportunity to\noffer constructive or destructive opinion to the field-—-anything that\nrequired their opinion seemed not only to please but to flatter them,\nI believe that all but a minor percent-expressed their true feelings on\nall questions and made a real effort towards sincerity,\"\n13, “\"Call me any time that l dan be of service,* Had l heard correctly? .\nCould this be a resident of Bloomington responding with such generosity?\"\nB, Effect of the Surrey on the students\n1. \"As to the value of such a survey, I dont know, | think perhaps it is\ndoing more for us who take it than it has value as a method of judging\naudiences. Until the listening Is more pointed and discriminating,,\nuntil listeners think more specifically about their likes and dislikes,\nsuch surveys do not seem to be Indicative except to verify the torpitude\nof the average listener, (l‘m sorry to admit that this languor existed\nalso among'the supposedly more intelligent classes on my list,)\"\n2= \"I think that these surveys should be continued because not only does it\nfamiliarize the students with the different aspects of radio but also it\nit’s food for thought for the people called., It might stimulate them to\nthink more about radio and not just think that radio is a square box\nthat can be turned on and off.\" 1\n3, ‘it surprised me that a lot of listeners pay absolutely no attention to\nwhat station or program they are listening to,*\n4 * I believe I have improved my. knowledge of radio because I explained it\nenough to the people i called,,\"\n5, Kl must admit, although the surveys were rather a-bother at first* I\nenjoyed doing the wo k It was a change from the usual line of college\nwork and proved a relief from the boring set-up of classes. Of all the\nwork I have done In high school and college, and there is a lot of it,\nthis has proved more interesting than anything l have ever done before.\"-\n6, \"In my survey in the East l found variety shows like Bob Hope, Red\nSkelton and the like more of a favorite among the people, than in the\nBloomington area„\"\n7o \"| was quite surprised to find that the principal objections l have\nheld toward radio in Bloomington were anything but prominent in my\nsurvey,!"
}