{
  "id": "d1692-56",
  "text": "55\n8= \"I was surprised at the low grade of the programs preferred. One wonders\nif the poor quality of most of them is causing the taste of Americans to\ndeteriorate.\"\n9. \"I think this survey is very effective since it is much more detailed and\ncontacts a more intensive cross section of the people. In its own small\nway, it will start some of the people thinking about radio instead of just\ntaking it for granted,\"\n10. \"I was surprised to find that a large percentage of the people on Sunday\nmorning listen to churches over the radio. It seems that a lot who are\nnot able to attend church listeaf\"\n11. \"It was very interesting and I think beneficial contacting various types\nwho comprise the group of us humans. From the woman who becomes extremely\nnervous when she hears operas to the gaUant mother who thinks that\nchildren's programs are even bordering on the ’sexy side’-—they all\nproved a great group of subjects and the work was well rewarded.\"\n12. \"I did think that the percentage listening would be larger than.that\nrealized in my survey: 5035 listening out of the 24 home town listeners\non Tuesday nights, and 202 listening out of the 25 Bloomington residents\ncontacted at poorer periods.\"\n13-r \"Remembering that musical programs had a low Hooper rating, I was\nsurprised to find that of my calls, Music headed the list of what people\nliked best. (It would be interesting to take a survey asking for\npeople’s preference in music). Comedy was their second choice, but many\nseemed to agree that the comedy programs definitely needed some rejuvena¬\ntion, and that a lot of ’comedy' programs were not funny,”\n14. \"Another think that was surprising was the number of people in both\ntownsswho preferred classical music, or 'good* music, as they said-\nespecial ly in Bloomington, Another item that was not too important\nbut rather ironical, was that of the few people jn South Bend who thought\nthat radio was getting worse, two of them were listening to Bob Hope at\nthe time.\"\n15. \"The majority of people prefer musical programs above all others. This\nconclusion, I believe, is contrary to the impression given by national\npo&ls.\"\n16. \"I knew, of course, that there were a lot of radios, but I was surprised\nto find that some families had 4 or 5 in their homes. In both\nBloomington and Tipton there were more people with more than one radio\nthan with only one, I found no one who had no radio at all.\"\n17. \"Income didn’t seem to have a tremendous influence on the number of\nradios owned after a certain point.\"\n18. \"Before this term, I was one of those few that possibly felt radio was\n’lousy,' and that because I owned a radio the stations owed me a duty\nto cater to my feelings, we are lucky and I am thankful,\n19. \"The thing I liked best about making this survey was the fact that it\ngave me a chance to talk to a percentage of those people who are the\nbread and butter of every network, every local station, every announcer,\nevery sound engineer, every radio lineman and every janitor that sweeps\nout a station.,,,the listening public,\"\n20. \"The most humorous incident occurred when one lady thought that' I was\none of her friends playing a joke on her, I told her what I wanted and\nshe only laughed and said, 'I know who you are!’ It to ok me almost\nfive minutes to convince her that I wasn't her old ’trifck-play ing ’\nfriend, Albert.\"\n21. \"In working with this survey, I discovered that it was helpful to the\nradio student nottonly in that its results found the attitudes of the\nlistener and important statistical information, but also in calling\nlisteners the student learned that it is necessary to be diplomatic in\nradio as it is in so many fields of enterprise. It helped train our\ntelephone and hence our radio personalities.\""
}