{
  "id": "d1692-61",
  "text": "60\nvital part of their lives, should be an Indication that something more should\nand could be done to shake the people and radio out of their respective\nlethargies. Radio has made probably the greatest start of any of the media.\nCould it not take the one or two additional steps necessary to be sure that\nit is going the whole way?\nD= On \"Soap Operas\" and Other Criticized Programs\nOne of the most reassuring aspects of doing a radio survey of the same area\nrepeatedly is the feeling you get that \"the people\", though not too well\ninformed on the full meaning of world problems, are a fairly stable lot. The\n\"soap opera\" is obviously no longer a problem. In most areas a decreasing\nproportion of the stations now carry them; thanks to increasing competition,\nand those that are retained seem to be enjoyed by a sufficiently large group\nto justify their presence. It would seem on this basis that there is also\nlittle generally to fear from murder mysteries, allhbagh^cert&in crrme\ncoincidences may refute this statement. Most 1isteners seem well-balanced\nand normal. And the same would seem to go for disc jockeys and the other\n\"problems\" of radio. Like women's fashions, radio's history reveals many\nfads and phases. The fact that static is increasingly indicated as an\nimportant objection in certain areas does not prove that static is worse,\nbut probably only that people are beginning to have fewer other objections\nto talk about. It would also seem to indicate a certain number of listeners\nwho will appreciate FM.\nWith new radio stations going into more small towns, the understanding of\nradio operation seems to be increasing. More local programs are being\nheard. People have stations and sponsors nearer by to complain to, or to\npraise, either in writing or in person. The rapport between radio and the\npeople is apparently becoming closer. As long as this trend, rather than\nthe opposite, continues, the sensitivity of radio to its public should\nincrease. If this influence can be increased and enlarged, with the\nassistance of organized, intelligent radio councils, and if too much\nimportance is not attached to \"listener ratings-', radio should become better,\nin all senses of the word.\nE» Evaluation\nAs stated above, this survey is run principally for the purpose of acquaint¬\ning future radio personnel at our institution with the meaning, importance,\nvalidity, and some of the methods, of Audience Measurement.\nVarious other types of r^dio surveys are carried out each year, by personal\ninterviews and group experiments. The present survey, then, was not carried\nout by a professional survey organization, or for purposes of pleasing or\ndispleasing any group or force. Except for this final section, plainly\nlabeled as personal opinions, based on the conclusions as we see them,\nobjectivity was the keynote. The students were briefed on the absolute\nvaluelessness of any survey attempting to prove anything, and the \"right\nanswers\" were not suggested to cal lees.\nWe know t>ur students, the broadcasters of tomorrow, have learned a great\ndeal from this survey. We modestly hope the broadcasters of today may also\nfind it of some interest and value."
}