{
  "id": "d755-0",
  "text": "<h>*'\n<0*\nNEWS OF THE CONFERENCE\nTHE SOCIABLE SHELTER: We are pleased to inform you that Mr. Hoyt B, Wooten,\nChairman of the Board of Cowles Broadcasting and former owner of V/REC AM & TV in\nMemphis, has invited those attending the conference to be his personal guests for a\nsocial hour to be held in the bomb shelter on his estate. Mr. Wooten's shelter, one of\nthe most unique in existence, is designed to accommodate 56 people for a period of\nthree weeks in an area of some 5500 square feet. It has excellent recreational\nfacilities, and a communications room providing world-wide radio contact. The shelter\nwill comfortably hold 125 people for a party, and arrangements are being made for us\nto visit in two groups on Friday evening.\nLEGISLATION AND BROADCASTING: In addition to our general session on this subject\nwith Mr. Phillip H. DesMarais, Deputy Assistant Secretary for Education, Department\nof Health, Education and Welfare, Mr. Bob Rowland, ETV Specialist with the ETV\nFacilities Program office in Washington will be at the conference on Friday and Saturday\nfor personal conferences with those considering applications under the Federal ETV\nFacilities Act.\nRADIO PRODUCTION: Those planning on attending the special interest session on radio\nproduction Friday morning will have the opportunity to hear Mr. Will Lewis, Director of\nBroadcasting at WBUR, Boston, discuss some of the techniques and ideas adaptable to\nvarious kinds of stations.\nCOLLOCATION SERVICE: For those interested in position or personnel availabilities, a\nspecial booth will be open under the supervision of Mr. Roy Johnston of the University\nof Miami. By means of a card system, registrants will be able to contact each other\nconcerning these matters. We will have more details on this later, but we particularly\nurge those seeking staff members to contact this service as soon as possible after\narrival. The service is free.\nWEATHER REPORT: If you are selecting your wardrobe for the trip to Memphis, you might\nlike to know that the weather will probably be mild. Sixty-seven degrees is the normal\nhigh for the city on April 1st; normal low is 46 degrees, with an average temperature of\nfifty-seven degrees on that date.\nINTERCONNECTION: Along with the previously announced participants in the inter .\nconnection session, Messrs. Witherspoon, Press and Berenson, the panel will include\nMr. John Hamblen, Director of Computer Sciences Project, SREB; and Mr. Gerard Appy,\nDirector of Field Services for NET.\nADVANCE REGISTRATION: An extra copy of the advance . Registration and Reservation form\nis enclosed. May we remind you of the $1.50 saving to those who put their checks in the\nmail by March 15, and encourage everyone to register in advance for the conference, if\nat all possible, so that we may better plan for your visit.\n# # # # ##'#,#"
}