{
  "id": "d755-24",
  "text": "I\nPARTICIPANTS IN THE NAEB. REGION II CONFERENCE\nApril 9, 10, 11, 1964\nColumbia, S. C.\nWilliam E. Abel, 607 Buckingham Drive, Montgomery 11, Ala. (USAF)\nGerard Appy, WGTV, Georgia Center, Univ. of Ga., Athens, Ga. (WGTV)\nRichard B. Armfield, Jr., Consolidated Eng. Office, WUNG-TV, Chapel Hill, N. C. (N. C.\nETV Network)\nLarry Atkins, 5925 Peachtree Rd., NE, Chamblee, Ga. (3 M Co. - Magnetic Products Div.)\nJohn M. Barnes, Box 470, Rock Hill, S. C.\nFrank D. Benson, 3376 Peachtree Rdt, NE, Atlanta, Ga, (Ampex Corp.)\nHill Bermont, c/o Georgia Center, Athens, Ga. (WGTV, Univ. of Ga.)\nFrank E. Blodgett, ETV Dept., Auburn Univ., Auburn, Ala. (ETV Dept, - Apburn Univ.)\nBob Bolton, 5925 Peachtree Ind. Blvd., Chamblee, Ga, (3 M Co. - Magnetic? Products Div.)\nTom F. Bost, Jr., 1330 W. Peachtree Rd., Atlanta, Ga, (General Electric Co.)\nGlenn Brackin, 916 Lakeview Drive, Auburn, Ala. (ETV - Auburn Univ.)\nCharles Braswell, WUNC-TV, Univ. of N. C., Chapel Hill, N. C. (WUNC-TV)\nRandolph Brent, 5200 Hampton Boulevard, Norfolk, Va. (WHRO-TV)\nMiss Kay Brown, Box 802], Univ, of Miami, Coral Gables, Florida (Univ. of Miami)\nPaul Bunker, 1900 Barnwell St., Columbia, South Carolina (Dixie Radio Supply.Co.)\nDon L. Burgess, ETV Dept., Auburn University, Auburn, Ala. (ETV Dept.)\nJames P. Burns, Clemson College, Clemson, S. C. (Clemson College)\nEverett Chaffie, Los Angeles City Schools, 450 N. Grand Ave., Los Angeles, California\n(Los Angeles City Schools)\nJ. M. Comer, Jr., 1330 W. Peachtree St. N.W., Atlanta, Ga. (General Electric Cof)\nLt. Col. Thomas R. Cook, Jr., AIAOS, Box 2132, Maxwell AFB, Ala. (Director, ETV n Maxwell AFB)\nT. W. Cowan, Jr., 740 Bismark Rd,, NE, Atlanta, Ga, (WETV - WABE)\nMrs. Eloise J. Cowand, 735 Pembroke Ave,, Norfolk, Va. (Norfolk City Schools)\nE. Ashley Dawes, WUNC-TV, Greensboro, N. C, (Univ. of NT C.)\nHugh DeSamper, Colonial Williamsburg, Inc., Box C, Williamsburg, Va. (Colonial Williamsburg)\nMiss Dona Lee Davenport, Director, Radio-TV, Charlotte-Mecklenburg Schools, 720 East\nFourth Street, Charlotte, N, C. (Station WTVI)\nGene Drogos, WUNC-TV, Univ, of N- C., Chapel Hill, N. C. (WUNC-TV)\nJ. A. Durham, 6871 Data St. Pensacola, Fla. (Pensacola JJr, Collage)\nRay F. Ellis, 908 S, 20th Street, Tampa, Fla. (Fla, West Coast ETV, Inc.)\nJames P. Etheridge, Jr, Florida ETV Commission, 303 Dodd Hall, FSU Campus, Tallahassee, Fla.\n(Florida ETV Commission)\nDonley F. Feddersen, WUFT-TV, Gainesville, Fla. (Univ. of Fla.)\nJames A. Fellows, 1346 Connecticut Ave., NW, Washington, D.Cr (National Assoc, of\nEducational Broadcasters)"
}