{
  "id": "d755-38",
  "text": "A. CftAIO VMILUFO\nWILLIAM C. MLF\nMCUTt ■ UP HI If—\nMr. Roy J. Johnston, Director\nMiami Univereity\nDivision of Communication Sorriooa\nCoral tables, U6, Florida\nDoar Roy|\nIt vii good to talk with yon yoatardqr. I appreciate your\ntaking tiao to eall and diaouaa tha forthcoming Region II moating.\nTour plana sound Ilka we ara vail on tha vpy to anothar varthvhila,\nvell-organitod moating that Region n ban eoma to ba famooa for holdl*.\nIn eonnectipn with our diaouaalon about tha in-sohool inetrwe-\ntlonal portions of tha moating, I an aanloaing tha mamas and addresses\nof several people who would ba assailant res was parsons. I haws seam\nall of than in positions of lsadarshlp si meetings and they would all\ndo a top-notch job for as. lash has had goad background and experience\nin developing, planning, produeing, sad coordinating instructional pro¬\ngraming in sohools. All four era goad, sad I would reoomaaad them in\ntha order in which thqr era listed.\nI heps in tha promotion far tha masting that you will list\nseveral areas of discussion within tha instructional framework. In that\nvqr school people will ba encouraged to attend tha noetl* with their\nemphasis an tha instructional sessions partioularily. I want a number\nof our people to attend, especially since I will have to attend the\nnanageneaWlaanee meetings amd esn't ba in both plaeee at .ones.\nI would like is talk with yarn mare shout tha poaaibilitiaa of\nour holding am instructional television conference in Raglan n lm ths\nfall* Sines you are as aware as I am of the mead far this type of masting\nclamor is hams (instead of alw^a in the aid meet), this mould be an\nexcellent opportunity for us to bring ear people tloser together, and\nalso add to ear region's growing prestige in the ergealfatioiu\nAs I told jm am ths pfcsme, X thUdt wa should eemsidsr ths\nproblems of ooooooibiUty, as mall so tha spsrmtlama amd program**,\nwhan ws talkdwwt posoiblo lasailone» Urbans amd XUssarl ara eases\nin point of tho problems of osssesibility*"
}