{
  "id": "d755-58",
  "text": "GUIDELINES FOR EDUCATIONAL BROABCAS TING\nThis, it seems to roe, is an essential need. Xflm not one\nfor defining things unless they •'sally need it but it\nseems to me educational radio does need it now.\nEducational radio has flown by the seat of its pants for\na good many years and it will be in trouble if it ever gets\nso organised and systematized and categorized that it is\nvoid of inspiration. But now that we are in the limelight,\nalbeit a limelight prismatically reflected through an ETV\nlens, it is important that our inspiration fall within a\nframework of defined purpose.\nEducational radio is many things, possibly more things than\nETV. But, perhaps because we have never sustained the\nbuffeting that presently perplexes ETV we have never drawn\nboundaries clearly delineating what we think is our purpose.\nDespite our national organization (which itself is suffering\nfrom lack of definition) and our frequent get-togethers and\ntalk-togethers, educational radio does not describe an\nactivity with easily recognizable parameters.\nAnd X think we ve tended to keep it that way on purpose.\n1 think with all our talk we haven81 been entirely open\nwith each other, we haven’t really wanted to pry beneath\nour conscious concerns.\nMany of us have, after we\"re been at this awhile and have\ndrifted below the initial level >f enchantment, wondered if\nwhat we were doing was worth doing ... or rather, perhaps,\nwhether our administrations really thought it v*a& worth\ndoing. \"ve heard many conversations at meetings, and\n—pa»trc ipajbed ia. aqi, <3 few seeking to justify our\nradio stations as either student training devicos^with ~\npublic service overtones or public service devices with\nstudent training overtones. Others are clear in their\npurpose of providing continuing education and cultural en¬\nrichment but are embarrassed by their general inability to\nshow statistics of enrollment as proof of success. The\nleast apologetic are those stations which are frankly\ninstructional in nature and those programs 'which actually\ndo enroll and deliver credits.\nAll of which is not so very far from the open circuit -\nclosed circuit - ITV ETV roundelay except in one respects"
}