{
  "id": "d755-59",
  "text": "there is such a variety of fingers in the television pie\nand so many more trying to get in that the educational\ntelevision broadcaster must define his role and define it\neffectively or he may lose the pie altogether. And while\nthe cause is different, the same end result threatens\neducational radio broadcasters also.\nRadio has not previously been under a similar compulsion\nto define its role. Ho one has really been breathing down\nour necks until lately. suggest it would have been\nsalutary in the extreme had there been.\nv down our\nown necks. Can we continue to exist half apologetically,\nwithout a solid image of our purpose?\nI hope we can tackle this question; and more I hope that\nwe can carry it far enough by noon on Saturday that a\ncommittee can be named to refine the ideas submitted and\nto issue a report which might serve as a basis for a\nrecommendation to the national board.\nDISTRIBUTION TO COMMERCIAL STATIONS\nThis closely parallels the discussion above on our reason\nfor being. f'ou will remember, Ken* the good session on\nthis subject last year at Athens where. Hugh DeSamper and\nDick Settle* among others, spoke of promoting greater dis¬\ntribution of our programs to commercial stations. We\ntalked around this on every level and wound up with some\nvery stimulating ideas. One was to establish first a\nregional and then a national distribution much as our\nseveral state universities do within their respective\nstates. And concomitantly, there was-the _\nNAB be approached to underwrite the NAEB network as a\npublic service arm of commercial broadcasting,. 1 don't\nknow where else this Could lead, except to a realistic\ndiscussion of ways and means and approaches, but\ncertainly think it is worth taking up where we left off.\nFROGRAMM1CNG AND THE NETWORK\nEducational radio ha* done many of the great things ETV\nis doing now. But -n•t c either medium can be\naccused of a notable consistency or quantity of high\nquality important' programming. There is plenty of room\nfor competition and 1% for one, feel we have-, a responsibility"
}