{
  "id": "d755-70",
  "text": "June 22, 1962\nMr. Lou Peneguy, Director\nCoordination and Information\nAlabama Educational Television Commission\n2151 Highland Avenue\nBirmingham 5# Alabama\nDear Lou:\nThanks for your letter of June 15.,.and believe me, I know the\nfrustration you must feel at darting around from meeting to meeting,\ntrying to get something down on paper that can be used—only to\nhave It never appear.\nThe type of coverage I was speaking of for Region III that involved\nNewsletter \"prior to the event\" type of news was handled this last\ntime by Larry Frymire. He sent me all the info that was sent out\nto the possible attendees - and a couple of longer \"news release\"\ntypes of things besides.\nThe little NL write-up that appeared after their meeting was written\nby me, since I attended the meeting myself.\nAs to the speeches, several of the speakers brought them in manuscript\nform to the meeting, and I was able to get them right there at the\ntime. Others I got promises from that they would send them to me\nlater...and all but a very few did. Several announcements were made\nat the luncheon meetings, etc., that w© wanted the speeches and what\nwe intended to do with them. We*ve had considerably more response\nfrom people writing in for the speeches than I ever thought we*d have—\nwhich must mean that people who can*t go to the meetings are hungry\nfor this type of thing. And it does seem a good way to handle it.\nIf your speakers seem reluctant to prepare manuscripts in advance,\nperhaps you could write them a oouple of months before your meeting\nnext year, tell them that we did this in Region III this year and that\nit seemed to go over quite well, and suggest that they bring a type¬\nwritten manuscript with them—or even send it in advance (but I\nsuspect that1s much harder to get them to do—as you indicate it has\nbeen previously). Then I»m sure we can list the titles in the NL and\noffer to let people have them for a quarter each etc,, as we did this\nyear for Region III.\nReading over your comments about your gathering of material the first\nyear, and waiting for reports from your reporters at the meetings you"
}