{
  "id": "d1347-10",
  "text": "-11 -\nWalter B. Emery\nWalter B. Emery has resigned from the Federal Communications Commission to acceptva.\nposition as Special Consultant for the Joint Committee on Educational Television, it\nwas announced recently by the JCET Chairman, Edgar FulJe r. Emery’s acceptance of the\nJCET appointment concludes nine years of service with the FCC as attorney, examiner,\nChief of Renewals and Revocations Branch in the Law Department, and more recently\nLegal Assistant to Chairman Paul A. Walker. Emery’s experience will be utilized to\nstrengthen the JCET Field Service Program. He will attend regional and state-wide\neducational meetings, providing general assistance to educational groups interested\n,n filing applications for non-commercial'educational stations.\nBorn and educated in Oklahoma, Emery received his law degree from the University of\nOklahoma in 1931*. He began graduate work under a scholarship from Northwestern Uni¬\nversity, and received his Ph.D* at the University of Wisconsin in 1939. He has been\ninstructor in speech and radio at the University of Oklahoma, the University.of Wis-^\nconsin, and Ohio State University.\nIn educational conferences throughout his professional career, Emery has emphasized\nthe contribution which radio and television can make to American education. He was\ndirector of the University of Oklahoma radio station from 1932 to 1935, and in 191*6\nthe University presented him with the D3s tinguished Service Award in Radio.\nDuring the summers of 1935-and 1936 he served as attorney in a special telephone\ninvestigation for the FCC. He has been a member of the Oklahoma Bar Association sinoe\n1933 and was recently admitted to membership in the District of Columbia Bar.\nINDUSTRY ANNOUNCES $100,000 GRANT TO EDUCATIONAL TV\nBenjamin Abrams, president of the Emerson Radio and Phonograph Corporation, recently\nannounced that his company would give $10,000 to each of the first ten educational*\nlicensees to begin regular television broadcasting. The $100,000 Emerson grant is\nhoped to be the beginning of a large-scale industry drive to launch educational\ntelevision on an extensive, immediate and practical scale throughout the United\nStates.\nPart of this proposed program would be the establishment of a council of internation¬\nally known educators, artists, scientists and public leaders, to explore techniques\nby which the full potential of this new dimension of television may be realized.\nThe $10,000 individual grants will be given to stations to buy capital equipment\nwhich would facilitate high-quality operation.\nEDUCATIONAL FILMS PAY OFF IN TOLEDO TV\nWSPD-TV, Toledo, Ohio, is racking up its second highest daytime rating with educa-\n~ tional films on its \"summer television school\" project. The series, which started\na couple of months back, is designed to give young viewers a continuing contact\nwith educational material during the \"school’s out\" season, and is backed three times\na week at 9sl5-9:30 a.m. by the board of education with the medical society getting\ncredit the other two days.\nPictures involved are the library of 100-odd reels of Encyclopedia Britannica Films,\ndistributed through Associated Program Service. Project has gotten hefty plaudits\nfrom Parent-Teachers Association and other public-minded organizations.\nThe same films are being used in a twice-weekly evening s cience program which is sold\non a participating basis and currently has a waiting list of sponsors."
}