{
  "id": "d1347-12",
  "text": "- 13 -\nEDUCATIONAL TV-WORKSHOP TO BE HELD AT'IOWA STATE COLLEGE, AUGUST 17-2h, IN COOPERA-\nTION WITH NAEB... .j . • • ,J»\nIowa State College at Ames, Iowa, will hold an eight-day educational television\nworkshop, Sunday* August *17 to Sunday,'August 21*, inclusive, in cooperation with the\nNational Association of Educational Broadcasters, it is announced by Seymour N.\nSiegel, President of NAEB*\nSixty representatives of leading educational institutions have been invited to\nparticipate forv the purpose of developing \"television know-how\" with a view to future\nf operation of their own stations# The person from each institution who was invited\nis the man who will manage the station or the one directly responsible for planning\nand b\\iilding the station#\nIowa State College operates WOI-TV, the only television station in the country\nat this time whiph is licensed to an educational institution# Three of the station*s\npersonnel will supervise the workshop sessions in cooperation with expert consultants\nfrom commercially operated television stations# They are * Richard Hull, Director of\nWOI-TVI Irving Merrill, staff member of the station* and Joseph North, also on the\nstation*s staff, aid head of the television curriculum at Iowa State College*\nCommenting on'the aims of the workshop, Mr. Siegel declared? \"The reservation of\neducational frequencies for television provides an opportunity for the creation of\nthe highest quality educational television programs. Educators are preparing applicar\ntions for station licenses. One of the biggest problems will be that of trained per¬\nsonnel* For the first time the National Association of Educational Broadcasters has\npersuaded leading scholars to take television seriously. The Iowa State College TV\nWorkshop will make possible the transmission of technical skills to provide suffi¬\ncient understanding of the drawbacks and pitfalls as well as the challenge and oppor¬\ntunities for public service which educational television offers.\"\nWCAU ORIGINATES EXPERIMENTAL SCHOOL TELECASTS FOR CBS\nWCAU-TV and leading educators of the Philadelphia area are coordinating the\nproduction of \"Summer School,\" nine week, thrice-weekly series of educational tele¬\ncasts which began over the CBS-TV network June 30* The novel series, described as\nprobably reaching a larger audience than any preceding educational event, will be\nused to develop a pattern for future similar projects.\nThe series is presented by CBS-TV, WCAU-TV, and the lower Merion School district\nof Ardmore, Pa. The broadcasts are originating Monday, Wednesday, and Friday, 3:30\nto 1* p*m* EDT, in the Penn Valley school 10 miles from Philadelphia*\nThe format calls for a lecture-type program presented to 1*0 selected pupils on\nsubjects seldom essayed to children, but \"of fascinating interest to television\n^ audiences of all ages.\" The same 1*0 children constitute a permanent class for the\ntotal of 27 lectures. Ages range from six to eleven years, with the youngsters\nchosen for average intelligence and interests..\nThe lecture subjects, designed to combine education, interest, and entertain-\nirant, vary from the weather to global government, presented with simplicity assuring\ncomprehension by the youngsters* Dr. Carleton Coon, winner of the Viking Ifedal in\nanthropology, one of the lecturers, commented: \"The only limitation on the powers of\nabsorption and understanding of the young mind are those placed upon them by their\nelders.\nWIVES ARE WELCOME TOO AT THIS lEAR'S CONVENTION—MINNEAPOLIS —NOVEMBER"
}