{
  "id": "d1347-2",
  "text": "JEFFERSON SERIES READY FOR SEPTEMBER RELEASE\nThe principles and ideas of Thomas Jefferson as applied throughout the course of\nAmerican history are to be depicted in a series of radio programs on \"The Jeffersonian\nHeritage\" that soon will be presented under the auspices of the National Association\nof Educational Broadcasters* The NAEB Board of Directors has authorized the release\nof the series as of September lit, 1952*\nIn announcing the new thirteen-week series, Seymour N. Siegel, President of NAEB,\ndisclosed that the broadcasts on Jefferson will be the first of many sets of programs\ndevised to give the radio-listening public a lively insight into matters of histori¬\ncal and contemporary significance.*\nFAE Grant Financed Series\nBroadly conceived to afford a perspective on significant topics that will at\nonce inform, entertain and educate, the new NAEB programs have, been made possible\nunder a $300,000 grant from the Fund for Adult Education established by the Ford\nFoundation* V; \\ \\ •\nThe special adult education committee of the NAEB which has planned and will\nproduce the new sets of radio program series consists of George Probst of. the Uni¬\nversity of Chicago, chairman; Parker Wheatley, Lowell Institute Cooperative Broad¬\ncasting Council; Richard B. Hull* Iowa State College; Harold. B. McCarty, Uiiversity\nof Wisconsin, and Mr* Siegel, Director of the Municipal Broadcasting System, New\nYork City*\nThe forthcoming series will be broadcast riot only by member stations of the\nNAEB Tape Network but also will be made available to United Nations Radio, The Voice\nof America, the British Broadcasting Corporation, The Canadian Broadcasting Corpora¬\ntion, the Australian Broadcasting Company, and All-India Radio.\nThe programs will be made available to commercial station operators on a sus¬\ntaining basis and it is expected that at least one series of those to be produced\nwill be broadcast over a national network*\nThe sets of series are planned to fit into a broad pattern of four main outlines\n— The American Heritage, The Nature of Mai, and International Understanding and Pub¬\nlic Affairs. Since the project is flexible, the ideas to be worked out in some of\nthe later programs and their presentation Will depend in some measure on public re¬\nsponse to the opening series*\nThe American Heritage\nThe initial series on \"The Jeffersonian Heritage\" will seek to explore the\nenduring ideas that are best summed up in our Declaration of Independence, among\nAmerican historic documents and best exenplified and symbolized by Thomas Jefferson\nas an Individual. Avoiding any emphasis on biography> the programs will seek to\ntranslate into living terms through dramatic action the Jefferson embodiment of the\nspirit which should animate men and the general principles which should guide them\nhere and now.\nFrom the \"Living Declaration,\" opening program of the first series, throughout,\nthis radio venture will seek to make real and vibrant the principal features of the\nAmerican Heritage as passed down from Thomas Jefferson through a.national history\nrichly endowed with his ideas. These features are seen as* one rich, fair land,\noffering vast opportunities; one diverse people, melted into a national unit; one\nbackground of knowledge and skills inherited from the many races of our ancestry;\nand lastly, the timeless and universal ideas of a new land*"
}