{
  "id": "d1347-20",
  "text": "21\nU. OF CINCINNATI PROF RECORDS \"SOUND SEMINARS11\nA world-vri.de \"recorded university\" with headquarters in Cincinnati has been un¬\ndertaken by Dr. George W. Kisker, Associate Professor of Psychology at the University\nof Cincinnati, Dr. Kisker plans to record on tape the voices and theories of world\nintellectual leaders. These recorded lectures are expected to form the nucleus for\nan international faculty in the arts, sciences and humanities. By his \"sound seminars\"\nas the individual recordings are called. Dr. Kisker hopes to enable every college and\nuniversity to offer the words of living authorities in many fields.\nThirty \"Seminars\" Completed\nAssisted by his wife, Mrs. Florence Hay Kisker, the Cincinnati professor already\nhas made recording trips to New York and Cleveland where he gathered interviews from\nauthorities in psychology and psychiatiy. Some thirty \"sound seminars\" are filed in\nthe Kiskers* Cincinnati home. .Their titles range from general discussions, such as\n\"Can Human Nature Change?\" by Dr. Karen Homey, New York, to \"The Psychodynamics of\nthe Industrial Executive\" by Dr. Wladimir Eliasberg, also of New York.\nStudents respond well to the seminars. Dr. Kisker reports. Their interest is\nfound to be stimulated when a \"name\" becomes a \"real\" person through a voice record¬\ning. Most of the tapes are being edited for twenty minutes, considered to be an\neffective listening period. After the tape is played, college classes have time for\ndiscussion and debate. Supplements for the taped lectures offer still futher possi¬\nbilities.\nTHE 19$2 NAEB CONVENTION\nby\nBurton Paulu\nChairman Convention Committee\nThe 19^2 NAEB convention will meet in Minneapolis November 6-7-8.\nThis is the first News-letter section to be devoted to that convention. It is\nthe. shortest for that reason; as program plans become positive there will be more and\nmore to report.\nYour committee is planning to cover: (l) important educational television devel¬\nopments; and (2) the role of educational radio today when television seems to be get¬\nting more and more attention. Long term strategy and day-to-day operating problems\nwill both be dealth with. Of course there will be sessions devoted to NAEB general\nbusiness•\nOur plans will shortly \"jell.\" Before they do we invite you — the members —\nto offer suggestions* What subjects do you want to have covered? What speakers would\nyou like to hear? What are your favorite convention likes and gripes?\nYour committee can turn in a better performance with your help. Let us hear from\nyou now before it’s too late, rather than on the morning of November 6thi\nSee you in Minneapolist"
}