{
  "id": "d1347-23",
  "text": "A “Working*1 Conference\nIt might be pointed out here that this was a “working\" conference. Sessions\nstarted at nine each morning and ran to twelve or twelve-thirty, reconvened at two and\ncontinued until four-thirty or five. Evening meetings began at seven-thirty and hard¬\nly ever broke up before ten-thirty. Committee meetings were held at mealtimes and\nbetween sessions.\nMr. Benjamin Bloom, Examiner*s Office, University of Chicago, was the consultant\non Wednesday evening and Thursday morning, specializing in discussion techniques.\nWednesday evening was also devoted to an audition of the kinescope of WOI-TV's \"The\nWhole Town’s Talking.\"\nThe members of the seminar were also busy at various times auditioning the many\ntapes of programs from member stations and the FAE programs, \"Jefferson\" series and\n\"The Ways, of Mankind.11 Such auditions were often followed by informal critical \"bull\nsessions.\" „ ,\nA detailed analysis of a specific educational program was presented on Friday by\nMr. James Schwalbach of WHA. The program was \"Let’s Draw\" broadcast by WHA and the\nWisconsin State FM Network.\nBy now the committees that had been set up earlier began to report and the matter\nof time became a big factor as the group went over each report carefully (sometimes\ntaking it word by word). Though the hours around the seminar \"rectangle\" in the\nAllerton library became longer, there was no flagging of interest. In short, each\ncommittee got a good \"going over.\"\nTV Discussions\nTelevision came with full bloom on Saturday and Sunday when Miss Martha Gable,\nTV Co-ordinator, Philadelphia Public Schools, was the consultant. Utilization and\nresearch with Dr. Dallas Smythe, University of Illinois, the problem areas of educa¬\ntion with Dr. Harold Hand, University of Illinois, and the methods of audience deter¬\nmination by Dr. Vernon Fryburger, University of Illinois, rounded out the consultants\nfor the remainder of the conference.\nAll committees made their reports and the final report of the seminar was pro**\njected. This report should be available early in the Fall.\n„• Skipper Miles, of the S.S. Allerton was presented with a present by the grateful\ncrew in honor of a most pleasant and profitable voyage and sweltering from another\nheat wave, the crew departed for all points of the compass.\nIt is not given to anyone to foresee the future, so this reporter will not at¬\ntempt to predict the impact of the Third Allerton on educational broadcasting. He\nwill say this, however, if there is any relation between impact and the earnest hard¬\nworking group (participants and consultants) that took part, the effect of this con¬\nference should be both great and wide-spread in educational radio and television.\nThere was diversity in unity, good humor in conflict of opinion and enthusiasm with\npracticability. ...\nYes, the Third Allerton is history - and we hope, history-makingi\nSEE THAT YOUR TRAVEL BUDGET FOR THIS YEAR COVERS NAEB MINNEAPOLIS"
}