{
  "id": "d1347-26",
  "text": "-27-\nDetermining the schedule calls for a consideration of a number of factors# It is\nwell to be cautious about scheduling one elementary program after another because it\nis often necessary to move the classroom radio from one room to another# The same\nholds true for secondardy school programs due to the time it takes to change classes#\nA good spread of programs for various grade levels is important in programming. Often,\nit may be wise to repeat an elementary program one or more times a week.\nUtilization Committee\nFactors to take into consideration in determining effective utilization of radio\nand TV include the selection of the broadcast based on the needs of the specific group\nwho will use it; study by the teacher of the guide sheets describing the individual\nprograms; preparation of the class for this experience; adaptation, not just adoption,\nby the teacher of all suggested broadcast preparation activities, including follow¬\nups after the end of the program; and guidance of student out-of-school listening.\nTeacher training is important in obtaining full utilization of the potential of\nthe broadcast. This teacher training should be both pre-service and in-serdlce. In\nthe latter area suggestions for helping teachers include demonstrations by station\ncoordinators meetings; bulletin helps; and graduate-level courses. Evaluation of all\nprograms will aid in obtaining better programs in the future.\nProduction Committee\nThe report of the production committee urged that all radio and TV production\nbe the best that the station can achieve and stressed that quantity is no substitute\nfor quality. The report recognized that all stations operate under some sort of\nlimitation but once the individual station knows its limitations, it should produce\nthe best it possibly can. The choice of program format-drama, talk, news, etc.—\nmust be determined by the content of the individual program or series, and by the\ntype and age-level of the expected audience.\nThe report mentioned that the educational telecaster has a challenge to produce\nnew and original TV formats for commercial TV is still struggling under superimposed\ntechniques of other media. Writers for radio and TV can be found within the school\nsystem. Speech, English, and Journalism departments are fertile grounds. Writing for\neducational radio amd TV must not only satisfy the standards of good writing, but it\nmust also observe the standards of the media involved. Performing talent like writing\ntalent may be found within the school system. Yet the schools are not limited in this\nrespect; they may levy upon the resources of the community at large.\nTelevision Committee\nThe television committee report points out that the educational channels are\nreserved only until June 3, 195>2. The JCET will provide aid and information to any\neducational group that plans to apply for a channel. The JCET will provide such\ngroups with information and consultants in the areas of financing methods, legal ad¬\nvice, engineering, and programming sources. Three separate plans of organizing for\neducational telecasting are mentioned. The parent-institution plan is one in which\none educational institution files for the license and operates the station with coop¬\nerating institutions having access to facilities and time. The new legal entity plan\nis one in which the member institutions form a council or foundation and incorporate,\nwith the council holding the license and operating the station. The third alternative\nis for a state network planned and financed by the state. Funds may come from public\ntax monies, from participating institutions or from private endowments to fit any of\nthe above three plans."
}