{
  "id": "d1347-4",
  "text": "- 5 -\nEDUCATIONAL TELEVISION\nEDUCATIONAL INSTITUTIONS MAKE APPLICATION TO FCC FOR TV LICENCES\nThe Federal Communications Commission, which began processing applications\nJuly 1, has already received applications for 9 non-commercial educational television\nstations in California, Florida, Kansas, New York and Texas.\nCalifornia\nThe Bay Area Television Association, a non-profit corporation organized under\nthe laws of California, on July 3 requested VHF channel 9 on behalf of all education¬\nal institutions in the San Franc is co-Oakland Area* Elementary schools, high schools,\ncolleges and other organizations whose primary purpose is to educate, may use the\nfacilities of the station. Policy will be determined by those who share in the\nfinancial obligations of the association.\nAccording to the Bay Area application, membership assessment from participating\neducational institutions, and possibly private funds and foundation grants will,\nfinance the station. Capital outlay equipment on a lease-purchase basis is estimated\nat $100,000; operational expenses at $110,000 per year.\nNew York\nThe Board of*Regents of the University of the State of New York on July 2 filed\napplicationstfor reserved UHF channels in Albany, Buffalo, Rochester, Syracuse and\nNew York City. Applications for the reserved channels in Binghamton, Ithaca, Malone,\nPoughkeepsie and Utica — all UHF channels — are in preparation to be filed shortly.\nThe Regents plan to use the 10 stations (the total number reserved in New York\nState for education by the FCC) for a state-wide network. The system will utilize\nprograms originating from each of the educational stations. I*1 addition each station\nwill present some programs for local viewing.\nThe University of the State of New Y0rk is \"the constitutionally designated\nagency for the development of new means of expanding the educational facilities of\nthe State.\" Construction costs for the state-wide network are included in the\nbudget now being prepared by the Board of Regents. The estimated cost of each\nstation is $2£l,5>00.\nFlorida\nThe Lindsay Hopkins Vocational School of the Dade County Board of Public Instruc¬\ntion, Miami, on July 1 requested authority to build a television station on reserved\nVHF channel 2. The Board has agreed to lease from television station WTVJ^-MLami,\nits entire transmitting plant, effective as soon as the FCC authorizes WTVJ to\nutilize new facilities.\nThe program schedule of the educational station in Miami will include organized\neducational programs for class-room use; adult education programs; information and\npublic events; and programs on the arts and sciences. The Dade County Board applica¬\ntion also states that this station can provide educational training for both com¬\nmercial and educational broadcasters. Estimated cost of equipment is $78*500, which\nis the amount required for studio equipment and new antenna needed to utilize the\ntransmitting plant to be leased from WTVJ. Estimated cost of operation for the\nfirst year, $25,000."
}