{
  "id": "d1023-24",
  "text": "Mr* Maurice F. Seay\nSeptember 27,1961\n-2-\nWhile we realize that the W. K. Kellogg Foundation has provided U\nyears of operational support and cannot be expected to provide such\nsupport in the future, I feel that you might be interested in consider¬\ning a two or three year grant for the special purpose of establishing\nand developing the enclosed publication, while continuing to upgrade\nthe jjtetgl (which can be permitted to become an even more scholarly\nprofessional publication if we have this new vehicle for thd*haw-to-\ndo-iff* articles, bookreviews, etc ).\nWe believe that Educational Radio-TV can be put on a self-supporting\nbasis within two or three years. In fact, we are confident that this\nnew publication can become a source of extra income which can be\nused to help underwrite the operational expenses of the Association.\nThis fact is borne out by such publications Issued by similar profes¬\nsional organizations, such as Audio-Visual Instruction, published by\nthe Department of Audio-Visual Instruction of the National Education\nAssociation, which now has enough advertising revenue to return some\n$15,000-20,900 a year 1'profit** to DAVI.\nHowever, it will take time to build up subscriptions and advertising\nrevenue, and it is for that intermin period that we will need support.\nWe anticipate that publication of Educational Radio-TV and continu¬\nation of a full-time editor ( plus the addition of more editorial assis¬\ntance ) and continued up-grading of the Journal will cost us approx¬\nimately $201000 a year for the next two or three years. Frankly, as\nyou well know, the Association cannot now afford that sort of \"deficit**\nfinancing.\nTherefore, simply as an exploratory gesture, I thought I would inquire\nwhether or not you feel there is a possibility of the Kellogg Founda¬\ntion Considering such a grant to the NAEE. If you feel that this matter\nis worth looking into further, we will be happy to prepare a more m\nprepare a more formal presentation far your consideration. And we\nwould appreciate any comments you would care to make about Educa-\nSincerely,\nWGH/a\nW illiam G. Harley\nP. S. You will be getting a more formal invitation, but I do hope you\ncan join us for our convention this year, October 22 - 2$.\nblc: Richard Hull\nRaymond Hurlbert, Frank Schooley"
}