{
  "id": "d1228-11",
  "text": "9.\nThe NAEB After Thirty Years. Dr. Harry J. Skornla. \"I want to welcome you\non behalf of the NAEB and wish you a Good Friday. I bring the greetings of\nPresident Frank Schooley, Associate Director Harold Hill, Network Manager John\nHolt, your Regional Director Jim Macandrew, Sy Siegel and the many others who\nwere unable to come. Instead of starting with the announced topic \"The LAEB\nAfter Thirty Years,\" in view of the questions which have arisen about how we\nshould here proceed, I would like to precede this historical review by telling\nyou some of the purposes of NAEB regional meetings. One of the strong points of\nemphasis in the original grant from the W. K. Kellogg Foundation was that the NAEB\nshould hold at least one meeting in every region. This Region I Meeting completes\nthe first round. The first regional meeting, which was Vice-President John Dunn*s\nidea, was held in Norman, Oklahoma, March 28-30, 1952 with approximately 20 in\nattendance. The Region II meeting was held March 13-14, 1953 in Chapel Hill, North\nCarolina with 29 members attending. Incidentally just last weekend approximately\n15 or 20 Region II members got together in Atlanta, Georgia for another regional\nmeeting, this time with all representatives paying their own expenses. The Region\nIII Meeting was held in Ann Arbor, Michigan, May 22-24, 1953 with 36 members\npresent. This, too, served as a pump-priming session since, again at their own\nexpense, on June 10, 1954, the engineers specifically of Region III got together\nin Chicago for a one day meeting arranged by George Jennings of MBEZ and Region III\nDirector Paul Rickard. Thirty-two members attended the Region VI meeting held in\nEugene, Oregon, October 16-17, 1953. Last October 1, 27 members of Region IV met\nin .Ames, Iowa.\n\"Some of the NAEB’s best ideas and statements have originated in these regional\nmeetings. This type of creative thinking can best result when attendance is\ngenerally restricted to NAEB members. A regional meeting is generally the only\nopportunity to have all members get together as the NAEB constituency to discuss"
}