{
  "id": "d45-32",
  "text": "Pag© 2\nFootnotes\n4. Includes official travel of all NAEB officers and/or staff, and official meetings*\n5. The amount allocated for Seminars, Travel and Research has been reduced to help absorb\nthe increase in Expenses and Supplies*\n6. Considerably increased over original budget, because of greatly increased demand for\nservices, and volume of tapes and other materials handled* This also includes Capital\nExpenses (such as new Duplicator for $10,000.00), and repair charges (old Duplicator\nrepair $2,000*00}\n7. Includes $278*37 for 1952-53 expenses paid from 1953-54 budget.\n8. 5% Adm* charge for 1952-53 - $2,525\n\" ■ • \" 1953-54 - .2,275\n\" w « Hew Grant-1,100\n9o Includes: for 1952-53 -$1700.00; for 1953-54 - $1700.00$ for new Grant $350*00.\n10* Includes: for 1952-53 - $ 825.00$ for 1953-54 - $ 575.00; for nm Grant $750.00\n11. Includes $10,000.00 (actually $9,999.96) salary for Skornia plus $383.32 for overlap\nsalary (June-July) of previous Executive Director.\n12. Figured on basis of 7.79$ for Retirement and 1.5$ for Workman’s Compensation.\n13. A seminar for writers of in-school programs now being planned. To be held in St. Louis\nin June. It is hoped that actual amount spent for seminars can be held considerably below\nbudgeted amount.\n14. Represents amount spent on Region VI meeting held in Eugene, Oregon, October, 1953.\nThis meeting was held at considerable less expense than anticipated and it is hoped\nthat similar savings can be effected in the Region I meeting to be held later in the year.\n15. Increase over original budget due to fact that certain sums in the additional grant were\near-marked for this purpose*\n16. HAEB committees have been very active, and the number and frequency of committee meetings\nwill have to be increased in the next few months if the expanded activity and services of\nthe NAEB are to continue at the present level. The past few weeks have seen meetings of\nthe In-School sub-committee and the Research committee. Meetings of the whole In-School\ncommittee and the Network Acceptance committee are planned for Columbus in advance of the\nInstitute for Education by Radio-Television. Meetings of this sort are planned as an economy\nmeasure because most of the conaaitte© members will be attending the IEET anyway and the\nonly expense that will accrue to the NAEB will b© re imbursement of committee members\nfor one day’s expenses ia Columbus.\n17. Carrying over f2,049.17 to next fiscal year, as per note (2) above, reducing next\nyear’s grant by this amount.\n18. Includes $3,000.00 transferred from the NAEB General Fund (by action of the Board of\nDirectors) to help absorb the extra expenses of expanded operation."
}