{
  "id": "d45-39",
  "text": "ALABAMA EDUCATIONAL TELEVISION COMMISSION\n714 PROTECTIVE LIFE BUILDING\nBIRMINGHAM, ALABAMA\nRAYMOND D. HURLBERT. Birmingham\nPresident\nTHOMAS D. RUSSELL. Alexander City\nSecretary\n- June 16, 1954\nMILTON K. CUMMINGS. Huntsville\nREX SIKES. Luverne\nMRS. T. S. ACKER. Ohatchie\nMr. Graydon Ausmus, President\nNational Association Educational\nBroadcasters\nBox 2002, University of Alabama\nUniversity, Alabama\nbear Graydon:\nThe Alabama Educational Television Commission is applying for\nChannel 2 to be located at Andalusia. This will complete the planned educa¬\ntional television network for the State with a 95% coverage. At the present\ntime commercial interests of Tallahassee, Florida are also applying for the\nsame channel. The Alabama Educational Television Commission feels that if\nthe Federal Communications Commission fully appreciates Alabama’s felt need\nand the public demand for such complete coverage, including the southern one-\nthird of the State which Channel 2 would serve, favorable action in our be¬\nhalf might be expected. A letter from you, from your position as President of\nNAEB, expressing your request for such favorable action in Alabama's behalf\nwill certainly help create the desired results. The following data might be\nused in your letter but should be stated in your own words as others in the\nState are being asked to make similar appeals.\n1. The 3 VHF channels as planned will give almost complete State\ncoverage.\n2. If Channel 2 is not included the southern one-third of Alabama\nwill lack coverage.\n3. This will help serve as a pilot or example in the national pic¬\nture of educational television. This is a very real opportunity to give educa¬\ntional television its chance to succeed.\n4. In the case of extreme eventualities this particular channel\ncan well serve as a direct outlet for Alabama Polytechnic Institute, as could\nChannel 7 for University of Alabama and as could Channel 10 for the Birmingham\nArea Educational Television Association, Inc.\n5. The State of Alabama has already provided sufficient public\nfunds to set up this statewide program and can proceed with construction if\ngiven proper authority.\nPlease write the requested letter at your earliest convenience as\nthe decision in the matter is expected in the near future."
}