{
  "id": "d45-5",
  "text": "-5-\non a State vide basis* The agreement to cover only those programs on which T rights\nvere cleared* Objections were raised on the basis of proper authorisation, loss of\nradio listenership through such classroom distribution, and the fact that residual\nrights in the programs had not been fully determined* It vas then moved that all\nrequests from audio visual centers for permission to dub and distribute tapes be re-*\nviewed by the NAEB and the requests referred to the original producer of the programs\nin question* The motion was seconded* After further discussion the second vas with**\ndrawn and the motion withdrawn* A motion to refer all such requests to the original\nproducer was then carried by common consent without formal vote.\nDiscussion of the question of resubmitting the Anrmwfl budget estimate to\nKelloggs It was suggested that the elimination of a seminar for regional meetings be\nauthorised in order to balance the 1953-54 budget* Staff cuts were also proposed as\na method of helping balance the operating budget. Miller volunteered to carry the\ncost of printing the proceedings and results of his regional meeting and eliminate\nthe expense in order to help eliminate one item of expense* An analysis ex¬\nplanation of the budget and possible deficit was presented by the Executive Director*\nIt vas suggested that all Class A stations send 30 tapes to the Center as their con*\ntribution to the Center in providing additional financial assistance. This suggestion\nwas agreed upon on the following basis*\nOne Class A member, one Class B member and one Class C member should\ncontact the other stations in their respective classes informally\nrequest their fellow stations to contribute tapes to the Headquarters\nin the following ratio*\nClass A stations 24 tapes\nClass 3 stations 12 tapes\nClass C stations 3 tapes\nIt was moved that $3,000 in funds now available in the general NAEB budget be held in\nreserve for the possible need to transfer to, and supplement, the Kellogg budget for"
}