{
  "id": "d1861-17",
  "text": "-17-\ntelecourse. In addition, students not regularly enrolled\nin the University must pay a $1 fee required of all part-time\nstudents. The home study guide is free to those registering\nin the course for credit, and is sold to others interested\nfor $2.00.\nFaculty remuneration — The normal semester teaching load\nat Western Reserve is 12 credit hours. The instructor receives\ncredit for 6 hours for teaching the 3 hour telecourse (and\nBroun feels this is certainly not too much, and should probably\nbe more)• The instructor may teach the telecourse plus 6\nother hours, for regular pay, or may teach 9 other hours, plus\nthe telecourse, in which case he gets extra pay for the over¬\nload. Very infrequently, an instructor will teach a full 12\nhours plus the telecourse and get paid accordingly. Except\nfor the first year (when apparently enrollments were larger\ndue to the novelty), the income from fees for the telecourses\nhas not been sufficient to cover the expenses. The deficit\nruns from $1000-43000 a year. The University administration,\naccording to Dean Brown, feels this investment is certainly\nworthwhile.\nNo effort is made to \"water-down” or popularize the lec¬\ntures. Each credit student is required to purchase a text\nand have library facilities available. Normally, assignments\nare sent in every week. They arrange, two or three times a\nyear, for the credit students to come to the campus and spend a\ncouple of hours with the instructor. This is designed as\nprimarily a social gathering, but of course it does give an\nopportunity to discuss the course, too.\nSince Western Reserve started these formal telecourses in\n1951-52, only 254 different individuals have taken the courses -\nthe total registration has been about 400. The sale of study\nguides (for those not taking the course for credit) has ranged\nfrom 50 for one course to about 700 for a course on the Old\nTestament.\nThe credit students are usually of high intelligence and\nhigh motivation, according to Dean Brown. Therefore, results\nhave been very good. Exams given to both campus students\nand TV students have shown that TV students get higher grades.\nBrown is convinced that within the limits of this type of in¬\nstruction the people taking the telecourse have had a valuable\neducational experience. Most of the telecourse students are\nalso taking at least one course on campus - several also take\nboth telecourses."
}