{
  "id": "d1861-26",
  "text": "■27-\nHester, Harriet H. and others. TV in Health Education.\nChicago, American Medical Association, 1955. (Bureau\nof Health Education Handbook.) Apply.\n(Explanation of techniques of television production\nintended to help local communities put on health pro¬\ngrams.)'\nHodapp, William. Face Your Audience. N.Y. Hastings House,\n1956. 130 pp. $3.95.\n(Scripts ranging from one-minute excerpts to ten-minute\nsketches and including an original half-hour TV script\nfor audition readings.)\nMike and Screen Press Directory. 1955-56. 2nd edition. N.Y.,\nRadio-Newsreel-Television Working Press Association,\n270 Park Avenue, 1955. 215 pp. $10.00.\n(Part one lists newsmen and their affiliations under\ntheir network, newsreel, or radio or TV station; part\ntwo lists the spokesmen in federal, state and municipal\ngovernments as well as pertinent UN and industrial of¬\nficials .)\nRose, Reginald. Six Television Plays. N.Y., Simon & Schuster,\n1956. 302 pp. $3.95.\n(\"Unlike his predessessors in this form, Paddy Chayefsky\nand Horton Foote, who deal in characterization within a\nrather static framework, Mr. Rose writes of ideas in\naction.\")\nSwinson, Arthur. Writing for Television. London, Adam and\nCharles Black, 1955. 144 PP- 16 s.\n(includes chapters on the techniques of writing plays,\nfeatures, talks, light entertainment and the documentaries\nwhich are the author's specialty.)\nTelevision Dictionary Handbook for Sponsors. N.Y., Sponsor\nServices, Inc., 40 E. 49th Street. 48 pp. $2.00.\n(A new edition of a 1950 publication in which the number\nof definitions has grown from 300 terms to 2200.)\nTV in Medical Education. Chicago, American Medical Association,\n1955. 96 pp. Apply.\n(The Council on Medical Education and Hospitals explores\nTV's potentialities as an aid in medical education.)\nThomson, Charles A. H. Television and Presidential Politics.\nWashington, D.C.^ Brookings Institution, 1956. 181 pp. $1.50.\n(Subtitle: \"The experience in 1952 and the problems ahead.\")"
}