{
  "id": "d1861-32",
  "text": "-34-\nKUSC-TV began its fourth semester of closed-circuit tele¬\ncasting on February 20, continuing its operating schedule of\n12 to 1 on Monday, Wednesday and Friday, The station has a\n12-week programming plan that will provide time for at least\n60 shows by May 18 when the station will stop broadcasting for\nthe summer.\nft**##\nThe English department at Alabama Polytechnic Institute,\nconcerned about the number of entering freshmen who must take\nsub-Freshmen, remedial English for no credit, is offering thirty\nprograms on a three-a-week basis during the spring quarter.\nThe series is aimed at the high school seniors. This program\nseries will be concerned mainly with word study, basis of\nphonetics, and composition. World Publishing Company has\ndonated twenty of their \"Webster’s New World Dictionary\" as\nprize material to be used on the show.\n*****\nA series of \"Spectacular\" shows entitled \"Lands and\nLegends\" is being presented over WUNC-TV, University of North\nCarolina, by the Woman’s College studio in Greensboro in\ncooperation with the Arts Workshop. The first in this series\nwas an ancient Japanese fable entitled \"Momotaro.\" The entire\nshow was an original adaptation, and persons at the Woman’s\nCollege combined talents to produce a show that would cost\napproximately $70,000 if produced in New York for only $125.\nAs part of its educational television program the Uni¬\nversity of Pittsburgh Speech Department is telecasting a spring\nsemester series, \"Improve Your Heading,\" over WQED-TV. The\n15-session course utilizes a booklet specially prepared for\nthis project, \"Reading Improvement Exercises,\" by Donald L.\nCleland, Josephine Tronsberg, and Thomson Leiper. Each stu¬\ndent who takes the course purchases a copy of the \"text\" and\nexaminations will be given at the beginning and the end of the\ninstruction to determine the results of the program. Response\nto the series is excellent with 60 students having enrolled.\n*****"
}