{
  "id": "d1339-13",
  "text": "93795\nBefore the\nFEDERAL COMMUNICATIONS COMMISSION\nWashington, D. C.\nIn the Matter of\nAmendment to Section 3.407 of the\nCommission’s Rules and Regulations\nGoverning the Announcement of\nMechanical Records.\nORDER\nAt a meeting of the Federal Communications Commission held in\nits offices in.Washington, D. C. on the 29th day of May, 1946;\nWHEREAS, The Commission is of the opinion that public interest,\nconvenience and necessity may he served by amending Section 3.407 of the\nRules and Regulations to read as follows:\n§ 3.407 Mechanical records.—(a) Wo recorded program con¬\nsisting of a speech, news events, news commentator, forum, panel\ndiscussion, special event, or any other recorded program in which\nthe element of time is of special significance and a presentation\nof which would qreate, whether intentionally or otherwise, the\nimpression or belief on the part of the radio audience that the\nevent or program being broadcast is in fact occurring simultaneously\nwith the broadcast, shall be broadcast without an appropriate\nannouncement being made at the beginning and conclusion of the\nbroadcast that it is a recorded program: Provided, however, Any\nrecorded program of one minute duration or less need only be\nannounced at the beginning. The identifying announcement shall\naccurately describe the type of mechanical record used.\n(b) Any other program consisting of a mechanical record or\nseries of mechanical records need not be announced as provided\nin subsection (a) , but the licensee shall not attempt affirmatively\nto create the impression that the program being so broadcast con¬\nsists of live talent.\nAID, WHEREAS, The Commission is of the opinion that it will best\nconduce to the proper dispatch of business and to the ends of justice that\nall interested persons be given an opportunity to file statements or briefs\nand to appear before the Commission and argue orally why the above proposal\nshould not be adopted, or why it should not be adopted in the form proposed\nby this order;\nWOW, THEREFORE, IT IS HEREBY ORDERED, That, upon the written re¬\nquest of any interested person, oral argument be held before the Commission\nen banc on a date to be specified in the future, as to why the proposed\n)\n)\n)\n) DOCKET NO.- 7611\n)\n)"
}