{
  "id": "d1500-2",
  "text": "NaEB NEWS LETTER_.DeCo 1, 1940..... Page 3\nA greater emphasis upon program production.\nEstablishment of radio libraries.\nEstablishment of courses in radio broadcasting and its use.\nInc 'eased use of recordings .\nOrganization of councils for cooperative production of broadcasts.\nBetter cooperation between schools and commercial stations.\nAn increasing recognition of university obligation in broadcasting\nfield.\nEstablishment of adequate broadcasting staffs and radio budgets.\nImproved publicizing of programs.\nEstablishment of local studios for radio work shops, both as\ntraining centers and producing centers.\n«Tfce renorte this year from member institutions show continuation\nof orogrese in all the features listed above. Instead of attempting\nto amplify and support each item in the above list, it will be more\nsatisfactory to the reader to examine the appended statements for\neach school.\"\nListed as \"high spots\" in the report are the following paragraphs:\n\"ILLINOIS - Station WILL, owned and operate! by the University of\nIllinois, reports the most successful year in its history. During\nthe year more than 2,000 persons v:rote the station commending pro-\ngrams. Complaints during the same period numbered five. WILL\naveraged 10 hours of operation during week-days. Thirty-seven\ncourses were broadcast direct from the classroom. One of the five\neyries of education dramas was produced at the request of the\n»i„ u Office of Education. Musical programs use only classical\nand semi-o’lassicAl music. Programs of panel-discussion or roun^-\ntable-type were continued. Special series of programs were\narranred in many fields of education. The noon-day farm program\n?aa presented by the College of Agriculture every week day,\nsupplemental by special broadcasts. Special events and sports\nevent* were broadcast with noticeable appreciation of alumni.\nThe professional colleges presented a series of health programs.\nThere was a weekly Parent-Teacher Forum, and\neditorials :vere read during the year on \"The Illinois Editorial\nReview,* an original feature of WILL, which has since been ocpl«-\nby commercial broadcasting.\n\"Additional personnel is needed as well as office and studio space.\nProfessorR. B. Browne is chairman of the Radio Advisory Committee\nand Mr. Josef F. Wright is Director ol the Station WILL staff.\n\"INDIANA - During the past year three weekly programs have been\ncarried over WIRE, Indianapolis, entitled 'The Editorial of the\nAir 11 a round-table discussion*, a half-hour variety program con¬\nsisting of drama, music, and interview; the Indiana University\nEnsemble, consisting of classical and semi-classical music, has\njust been accepted by the Mutual Broadcasting System as a regular\nweekly chain program.\n\"The North Central Radio Conference was held on the campus in June.\nThe conference was primarily to get constructive criticism of\neducational pro rams and to determine how mutual cooperation could"
}