{
  "id": "d1351-1",
  "text": "mmERSHIP APPLICATIONS\nThe publication of the follo^ving applications for membership in the National\nAssociation of Educational Broadcasters constitutes notice to all members. Unless\nnegative votes are received within thirty days9 all members v/ill be recorded as\nvoting in favor of granting such memberships and the Constitutional required v/ill\nthus be complied with.\nFor Active Membership\nWMBIj E^oody Bible Institutes Chicago, Illinois Robert Parsons\nFor Associate Membership\nEast Central State College, Ada, Oklahoma Oscar L, Parker\nUniversity of Hawaii, Honolulu, T.H. Joseph Smith\nEfemberships Accepted\nUniversity of Tulsa, Tulsa, Oklahoma (Active)\nPennsylvania State College, State College, Pa. (Associate)\nMfBI. Moody Bible Institute ~ 153 Institute Place, CEdcago 10, Illinois.\nRobert Parsons, Director, The Institute has operated Station lliBI (5000 v/atts,\n1110 Kc), daytime non-commercial, since 1926. It also operates its own FM station\n?/DLM on channel 7^259« This station went on the air experimentally on Sept. 5j 1941.\nEast Central State College - Ada, Oklalioma.\nE.C.S.C. does not operate its own station, but carries on its broadcasting\nactivities over the local station KADA.\nUniversity of Hav/aii\nThe institution is carrying on its broadcasting activities over commercial\nstation in Honolulu. Ten broadcasts per week are offered.\nAt the present time, a University Radio Committee is having a study made to\ninvestigate the broadcasting potentialities of the institution and make recom¬\nmendations for courses of instruction. Dr. Joseph Smith of the Speech Department\nis administering the v/ork of the Committee.\nWISCONSIN LEGISLATURE EXPANDS FM\nOn i^'ugust 5> Governor Oscar Bennebohm signed a bill passed by the 194? Wisconsin\nLegislature appropriating $166,100 to the State Radio Council for the expansion of\nthe state's netv/ork of non-commercial educational stations. The bill passed the\nAssembly with but 19 dissenting votes and cleared the Senate with only 5 votes in\nopposition.\nThe first station in the chain is nov; in operation in Madison. The second one\nis under construction near Milwaukee. The third will be started at once, and is\nexpected to be on the air in the spring of 1948. The fourth unit is planned to be\nir. operation in the fall of 1948. Four more units are to follov/.\nIN MEI::ORIAE.<I\nDave Owen, University of Michigan and former NAEB Associate Etember, died on\n■July 4 at the age of 48 at Ann Arbor after a long illness. Burial was in Falmouth,\nMassachusetts.\nNAEB extends its sincere sympathy to Mrs, Ov/en and daughter Rosemary.\nNAEB condolencea to Seymour Siegel (V/NYO) upon the sudden death of his father\non June 29*"
}