{
  "id": "d1351-4",
  "text": "CALIFORNIA RADIO PLANS STYMIED\nThe University of California and the California Department of Education lost in\ntheir attempt to persuade the 194-7 State Legislature to provide funds for the\nestablishment of a state-wide non-commercial educational FlU network. Identical\nbills introduced in both houses met defeat without ever coming up for a vote. The\nSenate bill died in the Education Committee* where it was tabled after cries of\n’’Communism\" were heard. The Assembly bill died in the Ways and Means Committee\nafter being sent out from the Education Committee.\nThe apparent reasons for the failure of the measure are assumed to be*\n(a) Political feuding between the Governor and the Legislature—coupled with\nthe urge to adjourn.\n(b) Opposition of the telephone interests because radio link rather than land¬\nlines was proposed.\n(c) Opposition of commercial broadcasters who, through their Northern and\nSouthern sections of NAB, used varied devices to befuddle the issue. IF/hile they\ndid not openly admit being in opposition, the presence of influential San Francisco\nand Los Angeles station operators—with their attorneys—is hardly mere coincidence.\nCertain questions should be asked of the legislators and of the broadcasting\ninterests and the FCC. What action’in the broadcasters* meetings preceded the\npress reports that the Northern and Southei*n broadcasters* associations were\nguiding to kill off the bill in the Legislature^ What activities were carried oh\namong the lawmakers after the FCC reprefeeritative^ investigation caused the campaign\nto go \"underground\"? l?i/hat did the FCC representative discover in his investigation?\n?/hy were proponents of the bill in the Legislature not given a chance to speak in\nbehalf of the measure at hearings held for that measure? Who stimulated the\nSenator to inject the \"Communism\" bogey into the hearing and thereby embroil the\nCommittee in irrelevant conflict? Why was the representative of the Federal\nCommunications Commission who was present at the meeting not permitted to answer\nquestions raised by the Committee members?\nIn the interests of their inalienable rights, the intelligent people of\nCalifornia should rise up in wrath at this betrayal of the concepts of democratic\ngovernment!\nAgain we say——this is a matter which needs to be thoroughly investigated by\nthe FCC if encouragement is to be given to other would-be-broadcasters in the\npublic service field. How can any state be expected to have the courage to\noperate a station following the precepts of the \"Blue Book\",if all it has to\nexpect is organized lynching at the hands of selfish, short-sighted entrenched\ninterests? If FM is to give education its second-chance, this cannot be permitted\nto pass without investigation!\nIn the meantime, the University of California is moving its radio headquarters\nfrom Berkeley to Los Angeles in order to be nearer to the commercial stations over\nwhich it will carry on its broadcasting. Hale Sparks will have his office there,\nhereafter.\nNAEB MEMBERSHIPS\nIn recent months, many new members have been accepted by NAEB.\nMore are needed if we are to present the united front which is so\nessential,if we are to be hoard in high places.\nLook over your area. Pro there any prospective members there?\nInvite them to membership. Remember: institutions operating their\nown facilities become Active Members. Those broadcasting, but not\nhaving their own stations, are eligible to become Associate Members.\nFor the good of the cause——-rally the new memberships!"
}