{
  "id": "d792-102",
  "text": "Graham Hovey — Letter from Italy Ho* 15\nRecorded In dome, February 5, 1954\nTape runs i 13 *25\n(Second In a series of four broadcasts on the Italian parliament In relation\nto the January political crisis)\nThis Is Graham Hoveyf sending from Rome another Letter from Italy, pro*\nduced for the Rational Association of Educational Broadcasters with the cooper¬\nation of Radi©television© Italians*\nA parliamentary debate In Italy is both similar and strikingly different\nfrom a debate In our own Senate or House of Representatives — and I suppose\nthere Is nothing very surprising In that.\nIn Rome, as In Washington, there Is the same bustle as & session gets\nunderway* fages dart up the aisles with messages for the legislators! a clerk\nat a microphone drones on with the reading of the minutes or some other docu¬\nment and no one in the house seems to be paying the slightest attention; mem¬\nbers climb the rostrum to confer with the presiding officer, Just as congress¬\nmen go up to confer with Speaker Joe Martin*\nA member of the Chamber of Deputies invariably refers to another member\nas \"the honorable\" so-and-so, whether he really feels that way about him or not*\nThus, Communist leader Ralmlro Togliattl calls former Premier Alcide de Gasperl\n\"I'onorevol© De Gasperl.\" It reminds an American of the way two bitter enemies\nsuch as Congressman Emanuel Cellar and ex-Congressman John Rankin would refer\nto each other as \"the gentleman from Hew fork,\" and \"the gentleman from\nMississippi,\" respectively*\nThese are some of the similarities* Then there are the differences —\nand some of these strike an American visitor immediately.\nOne of these differences is obvious, but I think you must visit the\nItalian Senate or Chamber to get its full impact* In Washington senators and\ncongressmen debate the Communist menace. Here in Rome that meance is always\npresent in strength, ready to take part in the debate* The Communists and their\nfellow travelers occupy more than a third of the seats in both houses*\nThere they are, duly elected by qualified voters, holding a great bloc of\nseats on the left side of each chamber, if you are looking down from the ros¬\ntrum.\nThere, two thirds of the way up the bank of seats in the Chamber of\nDeputies, on the inside of the first section, sits Palmiro Togliattl, number\none man In Italy's Communist hierarchy.\nTogliattl is a short man with broad shoulders, but he is slight¬\nly, as though he had suffered from arthritis* His black hair,_Still thick in\nmost places, is now thinning Just a bit on top, but he hardly looks 61, which\nhe will be on March 26* He dresses conservatively in dark blue suits and wears\nrimless glasses*\nHe hardly look® like the stereotype of the Communist revolutionary and\nmany observers believe Togliattl Is quite content for the present to play his\nrole as parliamentary leader of a powerful minority party, scoring debating\npoints against the government.\nIf there is impatience among the Communist deputies to get on with the\nrevolution It probably originates with the hardboiled party organizer and"
}