{
  "id": "d792-104",
  "text": "Hovey — 3\nPietro Nennl, is one of the most colorful and interesting figures in the\nChamber. If you come clockwise around the bank from the Communist benches the\nnext group is occupied by deputies of Nenni1a Partito Socialists Italiano.\nNenni himself sits about halfway up the bank in one of the last seats of the\nSocialist section — Just across the aisle from his bitter political enemies,\nthe Social Democrats.\nNennl is a broad, stocky man of 63, with a fringe of sandy hair and\nthick-rimmed glasses. He has the reputation of being one of the most effective\norators in the Chamber. He has a friendly appearance and, in fact, is liked\npersonally by men who differ with him sharply In politics.\nWhen you watch Nenni in operation in the Chamber it is difficult to\nimagine him as the stooge of Togliattl or anyone else. But it should not be\nforgotten that never once has Nennl really wavered from the Communist line since\nhe struck his so-called “unity of action* pact with Togliatti.\nNeither should it be forgotten that sitting not far from Nennl in the\nChamber are create Lizzadri and Glusto To Hoy, two men regarded by Italian\ndemocrats as virtual Communist agents operating within the socialist party to\nkeep it on the kremlin track.\nContinuing to move clockwise in the Chamber, you find in the next section\nGiuseppe Baragat and his Social Democrats, now reduced to 19 seats, and the\nRepublican party, which now has only five.\nSaragat is a tall, handsome man who looks like our former secretary of\nstate, Dean Aoheaon, without the mustache. Saragat is restless during debate\nand seldom occupies on© seat for very long. He has not yet recovered from the\nshock of the 195,3 elections, when his party not only failed to gain at Nennl1 s\nexpense, but lost 600,000 votes and 14 Chamber seats from its 1948 showing.\nBest known of the five Republican deputies is Randolfo Pacciardi, minister\nof defense in Pe Gasper! cabinets and highly regarded by both President Eisen¬\nhower and the present supreme allied commander in Europe, Gen. Alfred M.\nGruenther.\nPacciardi was a militant anti-fascist in the Mussolini era who soent\nyears of exile in America, as commander of the Italian anti-fascist Garibaldi\nbrigade in the Spanish civil war, he learned — and has never forgotten — the\nagonizing difficulties of trying to cooperate with the Communists In any\ncommon effort.\nBecause of his vigorous anti-fascism jgd anti-communism, Pacciardi has\nbeen bitterly and constantly attacked by the two extremes. But you get the\nimpression that this husky, blunt-talking veteran of both shooting and politi¬\ncal wars would follow wherever principal led him, regardless of the cost to\nhimself or his dwindling party. His friends would say that is why Pacclardl\nswung his five Republican votes behind the Fanfanl government in January while\nSaragat persuaded his party to vote no.\nThe most successful Italian party by far la this post-world war II\nperiod has been, of course, the Christian Democrats. They still hold 262\nseats in the center and right-center of the Chamber — 44 more than the Commun¬\nists and Nenni Socialists combined.\nSitting high up on the bank in the exact center of the chamber is the man\nsho, more than any other, fashioned this success. He is the man who for eight\npostwar years headed the government and virtually became wMr. Italy, * so far\nas Americans wore concerned."
}