{
  "id": "d792-105",
  "text": "Hovey — 4\nX refer, of course, to Alclde de Gas perl* No need to describe him —\nyou've seen his picture countless times* The cartoonists who caricature his\nhawk-like fact with the long beak don't exaggerate very much at that. But\nsomehow they have never captured the twinkle in his eye that is always there,\nbehind the strong leases of his glasses.\nThere is something symbolic about De Gasperi sitting in the center of the\nchamber. His philosophy and his program have been of the democratic middle-of-\nthe-road. He has been by far the most effective enemy of the two extremes —\nTogliatti and his Communists over on the left, and the frustrated political\nheirs of Benito Mussolini on the far right*\nSometimes you can tell much about a political man by the source and\nviolence of the attacks against him. De Gasperi took on the Communists at the\nheight of their postwar power — and licked them when few thought he could.\nThey have never forgiven him. When the neo-Fascists began to come out at the\npolitical woods, De Gasperi flayed them, too, and laid down the law to his\noarty* no deal of any kind with the MSI. So the neo-Faseists, too, can\nhardly find words strong enough to us© against him.\nThere he sits in the center of the Chamber with prestige and stature\nmatched by none of the other 539* In recent months he has taken on one of his\ntoughest Jobs * that of holding together and reforging into an effective poli¬\ntical instrument the sharply-divided, bickering forces of the Christian Demo¬\ncratic party. The fate of the Italian democracy may hinge on how well De Gas¬\nperi succeeds. One gets the feeling that Italy sooner or later will turn\nagain to this remarkable man for leadership of the government*\nResuming the clockwise tour of the Chamber you come next to the benches\noccupied by the Liberals and the monarchists and, finally — at the far right\nend — the benches of the neo-Fasclst Movimento socials Italiano, of which I\nwas speaking a moment ago.\nThe Liberal party, which traces its origin to the great Cavour, is now\nreduced to 14 chamber seats. Like the other democratic parties it is divided\nbetween a left and right wing. Its deputies generally support the so-called\n*sound money* fiscal policies and measures for European unification. The\nMonarchists scored substantial gains in the 1953 elections and now have 40\ndeputies, a bloc big enough for serious political trading\nThe Monarchists once struck an electoral alliance with the neo-Faseists,\nbut have found that they do better by themselves. They gained some stature\nwith the country when they supported the recent government of Premier Pella,\nostensibly without asking .any price. Many Italians doubt that the Monarchists\nreally are serious about wishing to bring back king Umberto XI and scrap the\nrepublic.\nThe MSI, on the far right of the Chamber bank, has 29 seats as the result\nof its improved showing last year. Perhaps it is not too surprising that this\nnoisy crowd often finds itself voting with the Communists at the other end of\nthe spectrum, particularly on problems of Italian foreign policy.\nOne ofthe M3l's principal spokeamen is 40-year-old Giorgio Almirante, a\nbaldish little man with black hair and mustache. The neo-Fasclst students\ncarried Almlrante through Roman streets in triumph on their shoulders during\nthe Trieste demonstrations of November.\nBut the patriarch of the neo-Fasclst party 1b Auguste de Marsanich,\nwhite-haired, 63-year-old veteran of Mussolini's March on Rome, curing the\nFarxfanl government debate, De Marsanloh shouted * When we are accused of"
}