{
  "id": "d792-109",
  "text": "Hovey — 3«\n4. .f st?rted this seriea of letters from Italy on the Italia* parliamentary\nsituation because I believe Americans always need to know more about the in- 7\nstltutions and problems of a friendly country and an ally — lust as the\nItalians need to know more about how our government functions#\nBut there have been other provocations t\nThere have been a number of recent articles In American newspapers and\nmagazines suggesting that Italy was about to go Communist#\nThere have been other recent articles in America suggesting that our\n*\"4,lu*ln6 th# flonsr##., was Impatient with thTltallSn \"ove^ent\nfor not cracking down on the Communists* &\ndAPRlnf i3+h2er?U?f**6 this series to present — without necessarily en¬\ndorsing -- the Italian side zt the story. To do that* one needs to know at\nar^thm*ai ^8present Italian parliament# And the story\nwav^flt ti+/he Fanfani government in late January provides a convenient\nway to illustrate those basic facts. X think It is imoortant to know wtevg*\nFanfanl failed and he failed* ^\nV «Jta biggest single bloc of seats in the Chamber of Deputies is that of\ntxfnaratio party* Th© Christian Democrats have 262 out\n“ lut’ “>ar>-to »»» mwi~ .\ni,.». ysrr&.'irs.KA.\nchrl,tl“ D*-,“-w *• * p*\"y\" '«ssr\nOne example will demonstrate the extent to which Fanfanl had to Comoro-\nmis© at this point t ‘\nOluseppe Pella resigned as premier on January 5 because the party vetoed\nhis plan to appoint an ultra-conservative Christian Democrat* Salvatore ildiaio.\nbecauae^ITf «t t“fid ?2?'»¥r*' Fiinfaai hfmsoJf 3wa3al home the party's case\nm^t“s la^frefo^Jrosr8a?P3° ntomt ** that J°b mlaht tha S*™m-\n„ . \"k?” fanfanl announced his wn cab mat January 18, It included .'Sal¬\nvatore Aldlslo as minister of Industry and commerce. Fanfanl had been willing\nrlshtCwin'-Aldl310 * 3-®es sensitive ministry to win the support of the party's\n. . , A* l ®#J» Fanfanl made this appointment at the outset to gain the unified\nbacking of his own party. But they weakened hie position with some of the other\nKSrtbf 34 B°I'a rote° than the chri8tian De“oerat8\n. , „ *“** ««*? J-fliy only two ways for Fanfanl to get those votes. Pella\nhad done It be bidding for the 40 votes of the monarchist party.\n+ S®1 518 Christian Democratic faction had been\ncritical of Pella for depending on the .ionarohists.\nThe only other practical way was to make a bid for support of the Social\nDemocrats, with IS votes| the Liberals, with 14, andthe Republicans, with 5.\nThese were the moderate center and left parties that generally had supported\nDe daspar1 and, at times, had served In his cabinet."
}