{
  "id": "d792-11",
  "text": "Hovey — 2,\ncomrades in th© other Cominform countries. And soon they were denouncing Tito as a dictator\nand howling indignantly about his persecution of Italian nationals in the Yugoslav son© of\nthe Trieste Fro© Terri tory.\nDuring the recent parliamentary debate, Communist orators up to the eleventh hour were\ndenouncing the Trieste settlement as a \"sellout\" to the United States and the Atlantic\ncommunity* Then once ©gain by telling the United Nations the Soviet Union took \"due note\"\nof the agreement as one that would reduce tensions in that part of Europe, so the Italian\nCommunists found themselves in an untenable position and their orators immediately stopped\ntalking about Trieste.\nFor these reasons, as I say, on© would have expected the Seelba government to emerge\nfrom these four votes of confidence at the peak of its popularity and prestige. And there\nwere other factors in the Italian political picture which ordinarily would serve to streng¬\nthen the government at this point.\nOn the foreign policy front there were the London and Faria conferences of the nine\nAtlantic community nations, which produced more than many Italians expected, after the\nkilling of the European Defense Community in the French National assembly.\nThese agreements, for giving sovereignty and eventually arms to West Germany, and for * V\nbringing that republic and Italy into the Brussels treaty seemed to be favorably received by\nItalians. They were something of a political victory for a new Liberal foreign minister,\nGaetano Martino, who seems to be making a substantial impression on the Italian public.\nOn the domestic front, there were evidences this autumn of a gradual upturn in the\nItalian economy. It was nothing to be jubilant about, and economists doubted that it would\nmake any substantial dent in the hard core of 2,300,000 unemployed in the near future. But\nthere was a quickening of the economic pace in Italy and an alert government might have\nturned it to political advantage.\nI have already cited the demonstrated ability of the four democratic parties to hang\ntogether to protect the government’s narrow parliamentary majority. But there was a negative\npolitical factor this autumn that also served to ease the government’s situation. During the\nsummer, the long-anticipated split in the Monarchist party became a fact. The mayor of\nNaples, Achilla Lauro, who had been president of the National Monarchist party and chief\ncontributor to its treasury, resigned and formed a new group called the Popular Monarchist\nparty. The bulk of the Monarchist members of parliament remained loyal to the old party and\nits secretary, 'Ifredo Covelli, Lauro*s bitter enemy. But lauro did manage to take a few\nMonarchist parliamentarians with him* This Monarchist split was reflected in the majorities\nachieved by Signor Seelba in those four confidence votes I have cited.\nThe old Monarchist party, as usual, took an official stand against the government. But\nwhen the senate voted on the Trieste issue, one Monarchist voted for the government and 14\nothers left the chamber to avoid taking a stand. Seven Monarchists abstained in one of the\nvotes in the chamber of deputies and on the other occasion several of them supported Signor\nSeelba.\nTo sum up, while the democratic party lines were holding fast, the pressure against the\ngovernment from the political right was lessening somewhat because of the split in Monarchist\nranks.\nThese, then, were fairly Impressive assets for a hard-pressed government* the return\nof Triestef moderate new success for Italy’s pro-European, pro-Atlantic community foreign\npolicy! a slight gain in the Italian economy! concrete evidences of solid support from the\nmiddle-road democratic parties, and a weakening of the government’s opposition from the\npolitical right."
}