{
  "id": "d792-110",
  "text": "Hovey — 4\nThe 262 Christian Democratic votes plus the 38 of these three parties\ncould put Fanfani over. Obviously, this is what he hoped would happen. 3o,\nif you examine his program speech, you find the biggest proposed budget in\nItaly's history .and heavy emphasis on social and economic programs designed to\nattract the Social Democrats and republicans• But you also find a pledge to\ncontinue the so-called ^defense of the lira,*1 hard-money policy and promises\nto work for European unification, designed to win the liberals.\nBut Fanfani know in advance that the Social Democrats, for reasons of\ntheir own, might find it difficult at this time to support any government\nheaded by a Christian 2>«aocrat. So, he felt it necessary to keep the door\nslightly open for the Monarchists in the event the Social Democrats would not\ngo along.\nThis possibility of having to depend on *oonarchist support may have\nhelped to account for the vigor and extent of Fanfani*s assault on the Commun¬\nists in his program speech. He may have wanted to assure conservatives in his\nown party as well as the Monarchists that his left-wing views have nothing in\ncommon with those of the Communists or the fellow-traveling Jociallats.\nThere was one more subtlety in the situation that may have figured in\nFanfani*a attack on the Communists. It involved Pietro Henni and his Sociali¬\nsts. At one point there i/ere reports that because of Fanfani1® left-wing re¬\nputation, the 75 Nenni Socialists might abstain from the vote of confidence\naltogether. Ibis, of course, would have reduced Fanfanl,s mathematical pro¬\nblem.\nBut for obvious political reasons, the Christian Democrats felt they could\nnot afford a government that would depend for its support on the tacit consent,\nif not active support, of Henni. It was reported, therefore, that if Fanfani\nsurvived in the Chamber only because the Socialists abstained, his own Chris¬\ntian Democratic party would engineer his downfall in the Senate.\nBy sailing into the Communists in his program speech, Fanfani made it\nimpossible for the Henni Socialists to do anything but oppose him vigorously.\nAnd thus, in his final speech before the vote, Fanfani cited this Socialist*\nopposition as one more proof that Nennl is, in fact, the Captive of the\nCommunists.\nveil, as overyone now knows, all of Fanfani1® Juggling and compromising\nwas in vain. He started out with a total of 24? sure votes against him — 143\nComunists, 75 Nennl Socialists and 29 neo-Faaciata.\nOf the votes from the other parties that he tried for, Fanfani got only\nthe five of the Republicans.\nBy leaving the door only slightly ajar instead of inviting them cordi¬\nally into the house, he lost the 40 Monarchists.\nThat left it up to the Social Democrats, who might have been expected to\nback him as a social reformer. But the Social Democrats have not recovered\nfrom the shock of the 1953 Elections, when they loot heavily to the Henni\nSocialists. They are convinced that one reason for those losses was their\nprevious collaboration with — and oerhaps subservience to — the Christian\nDemocrats.\nThey demanded that Fanfani come out for a new electoral law, based on\nstrict proportional representation, which they believe would help them. This\nFanfani was unable to do because of opposition in his own party."
}