{
  "id": "d792-112",
  "text": "Graham Hovey — Letter from Italy Ho. 17\nrecorded In Home, February 6, 1954\nTape runs* 13*30\nwt~\n(Last In a series of four broadcasts on the Italian parliament in relation to\nthe January political crisis)\nThis is Graham Hovey, sending from Rom© another Letter from Italy, pro¬\nduced for the National Association of Mucational Broadcasters with the co¬\noperation of Hadloielevlsi on® Italians and the United States Information\nservice*\nThere were historic overtones — perhaps 1 should say overtones of a\nfairly recent past — in the debate of the Italian Chamber of Deputies on the\nfate of the Fanfani government during the January political crisis.\nAnd those overtones heightened the Interest and significance of the de¬\nbate for an American interested both in Italy*s past and in orospecta for the\nsurvival and strengthening of Italy's young democratic system.\nIt seemed to me that those overtones should have added much of what\njournalists call ‘’human interest material* to the running news story itself\nduring those exciting January days in the Palace of Memtecitorio.\nSome of these overtones were sounded by the use of Individual Italian\npolitical words that have no counterparts in American politics — words such\nas ‘'trasformismo, wmas&lmalismof 11 * corporatism,11 HIntegral!sm,\" ’’clericalism,”\nand Catholic imperialism.* All of these and more like them were hurled back\nand forth across the Chamber during the four days in which a majority of the\n590 deputies decided to vote out of office the government headed by vaintore\nFanfanl.\nDut there were other historic overtones that could not be invoiced by a\nsingle word| historic parallels that were not even drawn in detail, but only\nhinted at by the orators.\nThus, the Italian politician best known to Americans — .41cide de Gasper!\n— referred to f,the spectacle of this parliamentary misery that follows at a\ndistance of only a few yours the shining hopes bom in the first assembly of\nthe a© public.\" By ”parliamentary misery,’* he Gasper! was referring to the\napparent inability at that meant of the Italian democratic parties to join\nlegislative forces in order to give to the country a broadbaaed and stable\ngovernment. He said the country was perplexed and troubled by this incapacity\nof the chamber of Deputies.\nDe Geeperi said It was the functionality* the vitality of the Parliament\nthat was at stake and not merely the fortune of one party or the other. He\nappealed to the deputies of the democratic parties to recognise what ha called\nthe necessity for a common, serious and continued effort in order that the\ndecline of Italian democratic Institutions should not become ‘'inevitable and\nfatal.”\nDe Gas peri drew no historic parallel. He didn’t need to. It would be a\nsafe bet that hie words ml every deputy present — including those of the\ntotalitarian left and those of the total!terina ri§ht — to thinking of the\nearly 19^0®. For it was the discrediting of Italy's democratic, parliamentary\ninstitutions in the face of crisis after World War X that paved the way for\nthe triumph of fascism. De Gasper! was actually saying*\nDon’t let it happen again."
}