{
  "id": "d792-117",
  "text": "araham Hovey — i^etter from Italy No* 18\nRecorded In iorae, March 5, 1954\nTape runai 13*30\nRECEIVED\nnaeb headquarters\n(First In a series of tvo broadcasts on Italian attitudes\niiusaiana, m reflected In public opinion polls).\nAmericans and\nF M\nThis la Graham Hovey In Rome, sending along anothex^ Letter from Italy, pro¬\nduced for the National Association of Educational Broadcasters with the coopera¬\ntion of Radiotelevision© Italians*\nEvery now andthen I like to give this program a kind of MItaly looks at\nAmerica'* aspect* I believe It Is important for Americans to know how they and\ntheir country are regarded abroad* And I think most Americans are eager for such\ninformation*\nToday’s version of “Italy looks at America*1 should b© more scientific than\nmy previous efforts on this theme* It is not based on interviews with Italian\nooliticlans or so-called “opinion leaders** It consists of results of a oubllc\nopinion poll, based on a scientific sample, of the whole Italian population*\nFor all its faults, and despite some conspicuous failures, the public opinion\npoll, based on a scientific sample, remains the most practical device we have for\nmeasuring national attitudes on public questions* I mean that the poll is the\nbest means we have short of actual elections, held on specific issues*\nIn America, we know that despite their failures to predict accurately the\nresult of our 1948 presidential election, the polls were back in the picture ae\nstrong as over in 1952* .Popular Interest In them seemed as high as ever*\nWell, popular interest in nubile opinion polling seems high In Italy, too*\nThe popular Illustrated weekly called alorno widely advertises the fact that it\ncarries results of scientific polls conducted by an agency known as\nPQXA recently conducted polls to determine attitude® of Italian citizens\ntoward the United States and toward the Soviet Union* The articles and tables on\nthe results were a big journalistic scoop for the magazine Gjorao* I thought you\nmight b© interested in com© of these resuits, compiled *nd adpitod for this pro¬\ngram by my wife and colleague, Mary Jean Hovey.\nPQXA starts out by explaining a scientific polling sample* It s?iys that a\nsample is “the cart which gives ua an approximate idea of the whole; It is the\nladleful which says If the sous is salted or not* . • ♦ I was amused at the\nsoup analogy. It is one used often by a colleague of mine who has contributed\nmuch to refining of polling technique 1 Dr. Ralph 0. Hafstger, director of the\nachool of Journalism at the University of Wisconsin.\n3ut let’s get on to the results of the first poll — the one on Italian\nattitudes toward America and Americans.\nAs its first question, PQXA asked Italians; “Do you have greater sympathy\nfor the British, the Americans* the Germans or the French? And in what order of\npreference would you put thee?**\nFifty six per cent of the Italians polled said they were most sympathetic to\nAmericana. Eighteen per cent listed us in second place; ten percent in third.\nOnly six per cent listed the Americans last* Another ten per cent gave us no\nranking*"
}