{
  "id": "d792-119",
  "text": "Hovey — 3\n\"intelligent,\" to describe Americans, but nine per cent thought us \"foolish.”\nEighteen per cent said we were \"ingenuous\" people.\nTwelve per cent of the Italians said Americana were \"calm,\" but another nine\nper cent called us ** impulsive,\" and three per cent said we were \"agitated.\"\nAs against nine per cent who thought we were \"courageous,\" seven per cent\nsaid we were \"timid.\" And as against nine per cent of the Italians who said\nAmericans were idealistic,\" six per cent s id we were \"without Ideals.”\nThere was more of the same, but perhaps this will give you a general Idea:\nDQXA found that exactly tv/o-thirds of all answers expressed \"praise\" for\nAmericana, while one-third expressed \"blame.\"\nMoving along to matters more important in the world political picture, DOXA\nsaid this to Italians In its polling sample 1 \"Some say that American aims to\ndominate the world. Whet do you think?\"\nTwenty nine per cent of Italians polled said th© statement was true; that\nunerica does air to dominate the world. And another 40 nor emit said'the state¬\nment was \"partly true.\" Twenty three per cent said the statement was \"false,\"\nand eight per cant made no response to the question. But let*a remember that\n6£ per cent said the statement that America aims to dominate the world was either\ntrue or partly true.\nBoxa1® political party breakdown on this question was Interesting — and\nrevealing. Ac for thw Oonciuntfttft and left-wing Socialists, 74 per cent of them\nsaid it was true that America aims to dominate the world, md another 13 per cent\nsaid the statement was partly true» only five per cent said it was false.\nIn the democratic left-of-center groups, including the Social Democrats and\nRepublicans, only 16 per cent thought the statement true, but 35 per cent said\nit was true in part. Twenty six per cent called it false.\nAmong Christian Democrats* only eight per cent thought America wished to\ndominate the world, but an additional 46 per cent said the statement was partly\ntrue. Forty per cent called to false.\nFifteen per cent of the i-iberals and Monarchists believed the statement that\nAmerica wished to dominate the world was true; 45 per cent said It was partly\ntrue; and 37 per cent said It was false.\nThe neo-Fasolets were more nearly in agreement with the Communists and left\nSocialists than any of the other Italian parties on this question. That, of\ncourse, is not an unusual thing in Italian politics, particularly on specific\nforeign policy questions no£ Involving the Soviet union. Forty eight per cent\nof the neo-Facclstc said It was true that the United States wished to dominate\nthe world and another 41 per cent thought the at*tenant partly true.\nBut DQXA went further with this matter, partly because, ae the polling\nagency itself said, its question on the United States made use of a propagan-\ndlstlc cliche\" that was \"somewhat superficial.\" So, It asked the Italians\npolled this quotation;\n\"some assert that America Is not interested, enough in Italy, others that\nshe meddles too much in our affairs. According to you, who is right?\"\nThirteen per cent said the United States was not interested enough In Italy;\n33 per cent said our policy toward Italy was about the right one; 30 per cent\nsaid we meddled too much, and 24 per cent said they did not know or at least\ngave no answer."
}