{
  "id": "d792-12",
  "text": "Hovey — 3\nYet, this America reporter, returning to the Bom© political arena after an absence of\na couple of months, was immediately struck by the degree of uneasiness An government and\ndemocratic party ranks, in spite of these impressive political credits.\nIt seemed obvious to political men that the government was, overall, in a weaker posi¬\ntion before the country than it had been when the parliament quit Borne for its summer recess.\nSome of its best friends harbored grave doubts ©bout the course the government had\nfollowed on certain matters.\nIt was obvious that ©11 was not well within the democratic party coalition, despite the\nunity of the Scelba cabinet and the solidarity demonstrated in parliament.\nCabinet ministers of the Liberal and Social Democratic parties were still completely\nloyal to Premier Scelba. But they and their Bepublicen party allies were having fresh doubts\nabout the loyalty to the coalition government of Scelba,s own Christian Democratic party.\nIt seemed evident, at one point, that Scelba shared these doubts. In speaking to\nChristian Democratic members of the chamber of deputies, the premier pointedly called for a\nstricter cooperation between party and government.\nBut in spite of repeated pledges for such cooperation by the party secretary, Amintore\nFanfani, it was obvious that the Christian Democrats were again suffering from their chronic\nailment, factional differences. The right wing of the party was again charging the govern¬\nment with laxity toward the Communists. Some members of Fanfani #s left-oenter democratic\nInitiative” faction were saying that the party secretary was actually dissatisfied with\nSignor Scelba and would soon make another bid for the premiership himself.\nAnd as though the internal troubles of Italy#s biggest party were not enou^i, a deep-\nseated split in the goveinment-supporting Liberal party came to the surface again, with the\nresignation of three left-wing Liberals from the party directorate.\nThere was not doubt in anyone's mind as to the beneficiary of this uneasiness, uncer¬\ntainty and confusion. The beneficiary was the group that can always exploit conditions of\nuneasiness, uncertainty and confusion. The beneficiary was the Communist party.\nThere was striking unanimity among democratic party politicians on one thing* the\nbelief that the Communists were stronger in Italy this autumn than ever before.\nIn light of the embarrassing political somersaults they had performed on the deeply-\nfelt Trieste issue this might seem incredible. But some Italian democrats conceded gloomily\nthat if new national elections were held now, the Communists and their left Socialist allies\nmig&t poll as much as 40 per cent of the total vote, compared with 35 per cent in 1953.\nAnd all its supporters agreed that it would be perilous for the government coalition to\ncall new elections at this time.\nThe Communists, of course, had created a part of that national uneasiness and confusion\nwhich they were now exploiting. By the incessant use of their powerful propaganda machine,\nthey had turned the mysterious death of an obscure young woman into a case that shook the\ngovernment. I safer to the celebrated Wilma Montesi ease,\nI would guess that this case has been covered thoroughly enough in American newspaper©\nto ©limin' te the need for extensive summary here. The facts are thesei Signorina Montesi's\ndrowned body was found April 11, 1953* on a beach 20 miles south of Borne. It was subsequent¬\nly charged that she had been thrown into the sea by friends who Believed her dead after she\nhad fainted at a drug orgy in a nearby hunting lodge. It was implied that persons high in\ngovernment circles were involved."
}