{
  "id": "d792-120",
  "text": "Hovey -• 4\nNext# DQXA asked Italians why they thought the United States had given —\nand continues to give — financial aid to Italy. Fifteen per cent said America\nsincerely desires to help Italy get back on her feet so that she can maintain\nherself. Forty eight per cent said it was because America wants to stop Italy\nfrom going Communist, thirty two per cent said America wants to have friends in\nItaly so as to have Italy for an ally In the event of war with Russia. And 19\nper cent said the United States was giving aid In order to take possession of\nItalian markets. You will note that these percentages exceed one hundred, for\nsome persons polled gave more than one answer.\nAt a time when ratification of the European array treaty is a lively issue\nin Italian politics, DOXAfs next question was timely and Interesting. It listed\nseveral possible ways to prevent the outbreak of a new war, and asked Italians\nto choose the one they thought best.\nTh© biggest single group — 37 per cent of those interviewed — answered\nthat they did not know. The second biggest group — 34 per cent — said the\nbeat way to prevent war vac by stepping up the rearmament of western Europe.\nFourteen per cent said the best way to begin the disarmament of western\nEurooej three per cent said it was best to leave western European armament at\nits present level. Twelve per emit answered, with regard to this question about\nthe best way to prevent a new war* “One can do nothing#*\nFinally, DOXA singled out the 34 par cent who said the best way to prevent\n*far was by Increasing the rearmament of western Europe and asked i Is It desir¬\nable that America aid Italy to rearm?* ninety two per cent said yes and four\nper cent said no.\nAs I*m sure the officials of the DQXA polling agency would concede, we\nshould be careful not to read too much into those results of the poll about\nItalian attitudes toward America and Americans. But I think these two general\nconclusions might be justified#\nFirst, there is no substantial anti-American feeling in Italy $ on the con¬\ntrary# a majority of Italians seems to have more sympathy and affection for\nAmericans than for their neighbors of western Europe.\nAnd second, Americans as individuals are more popular with Italians than\nAmerican policies, as a general rule.\nBoth of these points confirm strong hunches that I reported In a previous\nLetter from Italy. Friends told ai© before I came last year that I might find a\nrising tide of anti-Americanism. But as I said previously, if such feeling\nexists I can*t find it — in Rome or anywhere else. And the DOXA poll, with its\nevidence that many Italians think of Americans as generous, practical and in¬\ndustrious# confirms my feeling that if anti-Americanism exists it Is confined to\na small minority. In fact# these DOXA reports tend to confirm something Italian\nfriends have been telling me for a long time4\nThat the weakest and most ineffective part of the Communist propaganda\neffort in Italy Is its anti-Araerlean aspect.\non the other hand, many Italians who like Americans are somewhat distrust¬\nful of some aspects of American foreign policy. Recall for a moment the 69 per\ncent in the DOXA poll who said the statement that America aims to dominate the\nworld was either true or partly true.\n.And I would like to add one more observation only indirectly related to\nthis particular DOXA poll*"
}