{
  "id": "d792-131",
  "text": "* *ovey — 4\nBut one day Signor Canonic1 was having a chat In Naples with an old\nItalian railway employee who was a convinced Communist* Signor\nCanonic 1 says of the conversation * ”1 answered many questions which he\n(meaning the Communist railway worker) asked me with a lively curiosity on the\nconditions In the United States. He mentally compared what I told him about\nAmerica with the conditions which he thought existed in Russia. At the end,\nafter I had skimmed over the subjects of federal government benefits for\nveterans, progressive taxes, TVA and other things, he (the dommuniat worker)\nconcluded: “Allora, in the United States there is also communism — but\nwhite communism. ”\nAnd Signor Canonic! adds* * Arbitrarily, I adopted this tern of 'white\ncommunism' in place of the many others suggested, 'white communism' because\nits ultimate end is that of equality, such as the ideal aim of communism was\nto have been. Equality • • • without the red color of a revolution, without\nthe spilling of blood, only one party, and the suppression of the most ele¬\nmental liberties of thought and speech.’*\nLike Signor Continl, in II Meaaad^erp, Signor Canonic! is impressed by\nthe American graduated system of income taxes. He says that no country in\nthe world, excluding perhaps Great Britain, has a tax system so well conceived\nfrom the standpoint of equalising incomes. And it impresses this Italian that\nrich Americans who try to evade their income taxes go to Jail along with the\npoor; the celebrities along with the unknowns.\nBut Signor Canonic! is impressed by many other features of the userlean\nsystem i oocial security, government responsibility for finding Jobs for un¬\nemployed; old-age pensions; farm price, support programs; the spectacular\ngrowth of free, independent labor unions; veterans* benefits; the Tennessee\nValley authority.\nThis, he says, is “not capitalism.* The classical school of capitalism\nthat Mam Smith and the Manchester school described in their treatises “does\nnot exist in the United States.” Signor Canonic! calls it “white communism,\nand he describes it in these words* . .a scheme without a scheme, a\nmovement which has no rigid ideology; which can mold and modify according to\nmomentary circumstances.”\nHe says this system Is characterised by *d continuous work of moderni¬\nsation, restoration and amendment to the old system.” Private initiative, he\nsays, “continues to be the fulcrum of the national life, but to it is added\nthe work of the state to protect the interests of the people and to prevent\nexcesses. • .”\nSignor Canoniel predicts that the march forward of the American system\nwill be long. He says the “expectations for the success of this new experi¬\nment seem good.”\nOne of the reasons why h© believes the prospects are good is the behavior\nof the Eisenhower administration with respect to the economic and social pro¬\ngram of the Hew Deal, launched by President Roosevelt more than 20\nyears ago.\nSignor Canonic! says that in many European circles the election of a\nRepublican candidate was interpreted as ”a repudiation of the work accomplish¬\ned in 20 years of a Democratic majority; a backward step in respect to the\nsocial politics of the Hew Deal and the Fair Deal.” But Jlgnor Canonic! be¬\nlieves that the victory of Eisenhower instead represented, in effect, a rati¬\nfication of the preceding work. He says* ”Elsenhower never thought of reque¬\nsting in his campaign a reduction of progressive taxes or a halt to the leg is-"
}