{
  "id": "d792-136",
  "text": "Hovey — 4\nHe did not permit himself to he provoked into h~sty police action. That could have resulted\nin widespread bloodshed and backfired badly against the government.\nThus, Soelba and the government prevailed. And that incident probably marked the\nturning point of the struggle to restore respect for law and order to postwar Italy,\nPolicemen re rarely loved* Italians, who were subjected to a police state for 20 years,\nare apt to hrve an automatic dislike and distrust of the man in charge of the national police,\nIt would not be accurate to say th t Mario Soelba enjoys a wide, general popularity.\nOne often overhears remarks In derogation of this squat, bald, 52~yaar~old Sicilian\nlawyer. Some northern Italians simply resent having a premier from the south, especially\nfrom Sicily. They criticize Soelba*s accent and his rather dial political speeches.\nBut as I s-y, those Italians who know Soelba best seem to think highly of him.\nThey say he was a consistent and sincere anti-fascist, who helped smuggle forbidden\nbooks into Fascist Italy and otherwise maintained contact with the anti-Fascist exiles.\nThey say he worked actively and courageously in the Home underground before th# liber¬\nation of the capital of June, 1944,\nThey say Soelba is one of the hardest workers in government* that he personally is\nscrupulously honest* and th*t h© proved himself a good administrator in a difficult job.\nThey say, finally, that he is a shrewd politician in a system and country that requires\npolitical shrewdness.\nHe learned his early political lessons from th© famous Sicilian priest, Bon Luigi Sturzo,\nwhom he served as private secretary while a young law student in Rome, It was Bon Sturso who\nfounded the party that eventually became th© Christian Democracy. And it was the 82-year-\nold Bon Sturso, now a senator for life, who came out of relative seclusion to deliver a rare\nspeech for the Soelba government during senate debate in late February,\nAnd when the Soelba government finally got its vote of confidence in the Chamber of\nDeputies there were celebrations in the streets of the Sicilian city of Caltagirone, birth¬\nplace of both Soelba dnd Bon Bturzo.\nBut of oourse you o&n often tell as much about a political man by the behavior of his\nenemies as you can by the remarks of his friends.\nThe Communists and left Socialists on one extreme and the neo-Fascists on the other had\nlittle to say in criticism of Pella during his four and one-half months as premier. Obvious¬\nly, they thought — rightly or wrongly — that they had little to fear from him*\nBut the extremes reacted vigorously ©gainst the left-wing Christian Democrat, Fanfani,\nAnd they have gone all out in their efforts to bring down or harass Soelba and his middle-\nroad government, which is pledged to extensive sooial end economic reforms.\nThe Communists generally know well whom their real and effective opponents ©re. Obvio¬\nusly, they fear Mario Soelba. They fear him for reasons that have little to do with th©\neffectiveness of his flying squad® against their riots.\nThey fear him because he has been able to reconstitute the coalition of democratic\nparties, whereas their success depends on a shattering of Italian democratic unity.\nThey fear him because they know he is in earnest about his governments economic and\nsooial program, whereas their suocess depends on democratic drift, indecision and inaction,\nin a country where staggering economic and sooial problems cry for solution."
}