{
  "id": "d792-141",
  "text": "Hovey — 4<\nHOVEY* Signor Del Drago, as you know, © groat many Italian painters an many ran\nother countries have com© to Borne to do their work. One hm only to recall the artist\ncolony on Via Margutta in downtown Bom© to realise what an attraction the city is or many\npainters* Yet you, who are Roman, have turned your back on Rome to work at Filacciano,\nwhich you have described an a ’’small and ancient agricultural village, 1MMHK situated on\ntop of a hill thick with bushes, vineyards an olive tree groves, with the Tiber flowing at\nits base*\" *$hy Filacciano?\nDEL DRAGOt Filacciano is a little hamlet — the smallest that you coul possibly\nimagine. It is like a big family. I love this mirror of humanity that is Filacciano.-*\nand I love all the legendary world which surrounds it* th© Sabine Hills, Mount S oratte,\nthe Tiber. Here, still, man is in irect contact with nature $ a contact which is good.\nThe people like wholssome things. This simple humanity eliminates all that is not essential,\nbut multiplies all that is important — just as one must do in painting a picture that is\ngood.\nI!craft \"This mirror of humanity that is Filacciano • • • \" Even with what his wor's\nlose in translation, I believe you can sense that Del Xtrogo speaks as a poet. Critics say\nhe also paints like a poet. One referred to the \"fabricated poetry\" of a Del Dtrago meadow\npainting. Another says the lyrical is the vein \"most authentic\" of Del Dr ago* a creative\ntemperament. You will recall his preference for what he calls the \"poetical-religious\"\naspect of art rather than the \"politioal-econanio\" aspect. And he once said that in his\npainting he had \"sou^it always more of forgetting myself in order to achieve the same\ntoo©try of the creature or creatures that I ha’ before me.\"\nObviously, this reporter can venture no Qualified judgment about this so-called\n\"Third Force\" in art, with which Fn»cesco Del Drag© has been identified, but which he says\nis simply th© road between abstraction and neo-realism which all good artists travel* But\nI do believe we may be hearing more about this 3*Hre**-eld It lian whom some critics say\nis already on© of the best painters of his generation.\nGraham Hovey reporting. This Letter from Italy was recorded in Filacciano and Some\nfor the national Association of Educational Broadcasters — an' this is the NAEB Network.\nm*"
}