{
  "id": "d792-143",
  "text": "Kerrey — 2,\nCHAPINi The choice of Italy fop me was personal — one of a personal artistic nature.\nAfter I got out of the navy in December, 1945, I studied art un or Hans Hoffmann in New\nYork City for two years* During that time, I took part in the most abstract artistic i'©as\nthen circulating*\nBut then something came along that had a great impact for me* It was a retrospective\nexhibition in New York of th* work of the French painter, Pierre Bonnard* His work showed\nme hO’~ an ortist coul realistically depict the life that surrounded him, but at the same\ntime, make full use of the most modem abstract principles* In short, Bonnard bridged the\ngreat gap that seems to separate realism from abstraction*\nI went to Illinois Wesleyan university at Bloomington and taught art for three and a\nhalf yev rs, using simple abstract terms to explain pictorial structure to my students. But\nin my own work I began to travel th© road indicated for me by my discovery of Bonnard* I\njunked my abstract painting and tried to combine my abstract theories v/ith direct obser¬\nvation of nature*\nHCYNY (interrupting)! Yes, I understand that come of ycntr students at Illinois\nWesleyan were a bit surprised when they saw your first exhibition, after two years in\nBloomington* Pvi ently, they ha expected a more blatant abstraction in your painting*\nCHAPINt Yes, they were — an some of them were rather relieved! But to get back to\nyour cuestion as to why I came to Italy! I think there was something instinctive about it*\nI had mad© the shift from abstraction to painting what you might call everyday subject\nmatter* In lew York I had seen th© Italian realist film, \"Open City,” and lat^r I sar\n^Who Bicycle Thief** I was struck by their sincerity, an < by the coherence of the picture\nof human life which they gave* I thought that somehow in Italy it might be easier for me\nto get close to the basic facts of human existence*\nBeyond that, of course, Italy is in a sense the cradle of western culture* Here I\ncould investigate at first ban the monuments of the classical, medieval and renaissance\nworlds* But I repeat! It was really an instinctive move* You might say I was flying by\nthe sent of my pants when I came to Italy*\nHCT&Yt Well, Ifd like to follow that flight a bit further, David, and specifically,\nI would like to folio1 it from Horn© to Soriano nel Cimino* I think some people have tho\nidea that all American artists who com© to Italy settle down on Via Margutta, near th©\nSpanish steps, in the heart of Homo. Yet, you came to Italy an straightaway settled in a\nhill town north of Home that I woul imagine few Americans have ever heard about* I know\nthat this foot made a deep impression on your good friend, the Italian artist, Francesco\nDel Brago* He once wrote that th© fact that you left America, after having successful per¬\nsonal exhibitions of your work there, and settled down in relative solitu e at Soriano for\nseveral years was solid evidence of \"a strong artistic conscience.* You have toll why you\ncam© to Italy. But why Soriano?\nCHAPIN« Won before leaving America I had made up my mind that I did not wish to live\nin Home * I wanted to live in a small community — one that might be called \"typically\nItalian*\" Landscape has .always figured prominently in my work, and I wished to find a place\nwhere people lived in direct contact with nature. Soriano is very ’©finitely such a place.\nHOVSYi Well, could you expand on that a bit, David. What, exactly did you find at\nSoriano?\n•HAPINt First of all, I found a rugged, volcanic landscape — a boul er-strewn moun¬\ntain, cover©a with ancient chestnut trees, gnarled and twi ted in svery conceivable way.\nBecause it is so thickly forested, this mountain is said to be unicue in all Italy. Soriano\nitself is crowded on a cone-shaped spur near the base of Monte Cimino. From our house —\nacross a ravine and slightly higher — the town looks like a gigantic ant heap of humanity.\nFrom our windows, we can see ancient and modem forms of traffic circulating through Soriano"
}