{
  "id": "d792-145",
  "text": "Hovey — 4\nHOMt That should bo cult© a change of pace* Why the hert of Lon on?\n-HAIIH* $ell, here et Soriano I have paint© ' man close to nature * How I w nt to -o\nsomething vastly different. I want Oo paint man cut off from nature, living in the anti-\nnaturalist aurroun ’ings of a modern, sprawling city. But I pm not yet ready to go back to\nAmerica* There is still too much left to see and learn in Europe. Hence, Lon on. t hope\nto find and paint the poetry that must exist in a city of '©finite character, ouch as\nLon on.\nHCTSTi Well, David, why London and not Paris? Paris surely is a mo'em, sprawling\ncity with a character of its own. And Paris historically has had a tremendous attraction\nfor painters — isn*t that ture?\n'HAPINt Tes, that is true. But on*t forget that the Impressionists began painting\nPeris a hundred years ago. It is very difficult to fin; new images in groun that has been\nso well worke over. The Paris vein, you might say, has be n well worked over, if not\nactually exhausted*\nHOVHTi Well, from what you have sai l, I gather that sometime after Lon on — sometime\nin the future — you plan to cone to a stop in America once again*\nKAPINi Definitely. That*s what I meant when I sail I didn#t want to become an\nexpatriate painter. My objective is to go back to America andpro uce works that will be\nrecognized as American. But in these formative years, I feel a compulsion to suck up as\nmuch of the culture of lAirope an the rest of the world as I can.\nTo ay, western civilization is in the throes of eveloping an entirely new culture.\nIt will be as different fro® what has gone before as the Bennaissance wan from medieval\nculture. And it is necessary to un erstand what has gone before in order to create something\nthat is definitely new.\nHOVTTf Those.of you who heard Francesco Del Drag© on the previous Letter from Italy\nwill now understand better why I say that ho and Devi l CSjkpln have many things in common —\nand why these two young painters, one Italian, one American, only a few months apart in\ntheir ages, both belong to the band of artists that the Bom© critic, Luciano BuUgna, calls\na \"Third Force a group that Signor Budign© believes is becoming larger and more effective\nin the artistic worl •\nThe paintings of Chapin and Del Drag© are dissimilar. are their actual methods of\nwork at the eacel# But both learned well the principles of abstraction while rejecting\nabstract painting. Both rejected neo-realism. Both sought places of woik remote from the\ngreat cities; places where they could paint something very ol , very simple, and largely\nunchanging.\nSaid Del Dr ago i \"Many people are interested in that which changes. I am interested in\nthat which oes not change.*’ And Chapin laughingly suggested that he might, as a painter,\nbe classified as a kind of \"neo-reactionary.\"\nBoth fear artistic theories as guides by which to pain^\nBoth talk of trying to paint the poetry that they see.\nFor more than three years their artistic lives have follow© similar patterns. In a\nfew months they will iverge. I would be much interested in following their progress.\nGraham Hovay reporting. This Letter from Italy was recored in Soriano and Foma for\nthe National Association of Educational Broadcasters — and this is the NASB Network."
}