{
  "id": "d792-147",
  "text": "jvcy — 2,\nScelba*© record under fascism 1b clean-cut* He withdrew from public life altogether,\nwent back to Caltagirone and «uietly practiced law. But h© maintained contacts with anti¬\nfascists at home and in exile, and helped snuggle in books that were on Mussolini98 black\nlist.\nThe developments of World War II gave Scelha new opportunities for public service.\nPrior to the Allied liberation of Home on June 9 1944, Scelha had returned to the capital\nto work actively in the anti-fascist underground. And with Aleid© Be Gas peri and others,\nhe founded the Christian Democratic party as the successor to the old Popular party*\nAs I say, this background is vastly different from that of Gaetano Martino. Yet\nMartino, strangely enough, grew up in a political atmosphere. His father was a staunch\nRepublican and the mayor of Messina for more than 20 years. But Martino elected to study\nmedicine, and he was graduated as a doctor from the University of Messina in 1923* He\nthen studied abroad — in England, France and Germany — and somewhere along the line he\ndecided to be a university professor.\nMartino took the equivalent of our Ph.D. in 1928. Then came an unusual interlude.\nHe went off to Paraguay to teach physiology at the University of Asuncion before coming\nback to Sicily to settle down as professor of bio-chemistry and general physiology at the\nUniversity of Messina. Except for the war period, when he took time out to serve as a\nmedical officer in the Italian navy, Martino advanced steadily in the academic world.\nEventually he was elected rector of the university by his faculty colleagues — a\nposition corresponding roughly, but not exactly, to that of president of an American\nacademy. His output of articles on the nervous system and nutrition for learned journals\nwas impressive. On the social side, he become president of the Messina Rotary club.\nWith this kind of record, it was understandable that pressures would he put on\nMartino to enter politics after the fall of fascism and the end of the war. He says he\nwas reluctant to say yes when the Liberals asked him to help reconstitute that party in\nSicily in 1945. And he admits, candidly, that he had never been a militant anti-fascist.\nBut eventually, he joined the Liberal party and became a member of its national\ncommittee. He was elected to the assembly that wrote Italy*s new republican constitution\nin 1947 and he since has been elected twice to the Chamber of Deputies from Messina. He\nhad been vice president of the Chamber hut had never held a cabinet portfolio until Mario\nucelba named him education minister a year ago. He became foreign ra mister when Attilio\nPiccioni resigned last fall.\nYou can understand from all this why the temptation is to say that the only things\nPremier Scelha and Foreign Minister Martino have in common are their Sicilian origin and\ntheir ages.\nScelha has spent many of his adult years in rough and tumble politics; Martino has\nsoent most of his adult life in the sophisticated atmosphere of a university. Scelha has\ntraveled little — in fact his recent official visit to England was his first trip to that\ncountry — and he speaks only a little French, in addition to Italian. Martino is widely\ntraveled! speaks fair English, very good French and fluent Spanish. Scelha was a constant\nfoe of fascism! Martino, at least, accepted the regime of Mussolini. Ucelba, a devout\nCatholic, has always been a member of a Roman Catholic partyj Martino, an ecually devout\nCatholic, is a member of the Liberal party which historically has opposed the church in\npolitics.\nScelha is a much more cultured man than his critios would admit or than many of his\npolitical associates realise, but Martino has written more than a hundred articles for\nlearned journals.\nStill, the political fates brought these two Sicilians onto the same governmental\nteam in 1954, and the intervening months have shown that actually they have many things in\ncommon."
}