{
  "id": "d792-148",
  "text": "Perhaps the most important thing they have in common is the belief that Italy1 s way\nout of her present crucial political situation is the way of the middle road, with a\ngovernment made up of HIXSM the old Be Gasperi coalition of democratic parties of the\ncenter. Wot all lembers of Scolba's Christian Democratic party share his faith in this\ndemocratic coalition. Inhere ia real doubt, at the moment, that the men directing Martino*s\nLiberal party share his belief. But Scelba and Martino are deeply committed, and their\npolitical fortunes are apt to rise or fall with the success or failure of democratic\ncoalition government.\nIn fact, I would guess that Mario Scelba will be remembered longest for the fact\nthat he rebuilt the democratic coalition after it had fallen apart in the wake of the 1953\nelection. And I think this will be true whether democracy survives or fails in Italy.\nThis may surprise those of you who are familiar with Scelba*a work as interior minis¬\nter, when he rebuilt the national police and carabinieri and used them vigorously in\ncrucial postwar years to put down Communist demonstrations that got out of hand. And\ncertainly, Scelba today is best known both at home and abroad for that police job — the\norganising of the famous \"celere,\" ox flying squads, to cope with Communist and Fascist\nviolence in the squares of Italy*\nBut as a Iongrange proposition I will stick with my guess. I think that when the\npolitical historians tackle this particular period they will single out Mario Soelba for\nthe fact that he rebuilt a democratic coalition when few believed it could be done.\nPerhaps just a bit of background will help to put that job in focusI\nItaly*s four democratic parties — the majority Christian Democrats, the Social\nDemocrats, Liberals and Hepublicans —* had joined forces and drawn up a unified slate of\ncandidates for the election of June, 1953. Together they had enacted an electoral law\ncarrying Scelba *s name that would have given them about 65 per cent of the seats in the\nChamber of Deputies if they had polled more than 50 per cent of the total vote. Partly\nbecause of widespread resentment over that law, the democratic coalition fell just short\nof its 50 per cent. And this setback caused the coalition to break up in bitter recrimin¬\nation after the election. Be Gasperi, whose name had been synonomous with Italian\npolitical stability in the postwar period, tried to form a government compered only of\nChristian Democrats — and failed. So did another Christian Democrat, Attilio Piccioni.\nFinally, a third Christian Democrat, Giuseppe Pe.lla* managed in mid-August to form\na government and resolve the long summer crisis. At first, Pella himself referred to his\ngovernment as a kind of caretaker cabinet, to get the budget passed and allow the political\ndust to settle.\nThen Pella began to depend on the right-wing Monarchist party, which had more votes\nin the Chamber than the three minor democratic parties together. Thus, the real signifi¬\ncance of Pella*s four-month government was that it marked a turn away from the democratic\ncenter and an uneasy and unofficial alliance between the Christian Democrats and the\nMonarchists.\nOne Christian Democrat who didn*t like this situation at all was Mario Soelba. In\nDecember of 1953, he made a peech in which he advocated a return to the democratic\ncoalition. He said this was the only effective way to bring needed social and economic\nreforms as well as to fight communism. This speech was one factor in Pella*s downfall in\nJanuary, 1954, and a factor that eventually led President Luigi Einaudi to give Scelba the\njob of doing what he had advocated! reconstructing the democ 3tic coalition.\nIt was a difficult taks. Scelba had to pay — with key cabinet jobs — for the 38\nvotes which the three minor parties could give him in the Chamber of deputies. And even\nwith these 38 he could count on a majority in the Chamber of only a few votes. And the\nhigher price had paid for this support, the more dissatisfaction he created in his own\nChristian Democratic party."
}