{
  "id": "d792-153",
  "text": "ey — 4.\nBy this time, the \"scandaletto,\" as the newspapers called it — the little scandal —-\nwas subsiding. Gina said she actually had been offered TO million lire for the third film.\nT+!°r^Ct% °? their Part' they 57131103 to e®Pba»i^e that the\nprofits reported for the first two \"Bread, Love\" pictures were gross and not net. The\nlatest word is that Miss Loren will play her \"pissaiola\" role in the third \"Bread, Love\"\nMiss'liollobrigida in°the ~her £o! ^ * °h™ 9“at frOT1 °ne he assay0d\n. V °\"e “S^suggested that the third picture be called, \"Pane, Amore e la Bella Sophia,-\nt\" h^nor of Miss Loren. And II ^fessaggero, the newspaper that started the \"scandaletto\" in\nthe first place, now admitted that it had dissolved like a soap bubble.\nIn the middle of the Lollobrigida-Loren business, who should arrive in Naples, fresh\nfrom America and Hollywood, but Anna Magnani? And if you listened hard enough in Pome, you\ncould hear voices saying that she was the only real actress of the lot anyway. *\nVittorio De Sica’s role in the Ginar-Sophia scandaletto wa a minor one. The noted\nactor-producer also figured in a minor way in one of two announced retirements that have\nattracted much attention recently.\nOne involved Beniamino Gigli, the Italian operatic tenor, whom many critics call the\ngreatest since Caruso, Gigli is now 65 years old and in the 41st year of his singing career.\nHe made his retirement announcement in London during a strenuous concert tour that will also\ntake him to the United States and Canada. It was a strange kind of retirement announcement.\nThe interviewer said Gigli spoke with a voice full of emotion. He described his de¬\ncision as a \"tremendous\" and \"sorrowful\" one that required great will power. But then it\nturned out that Gigli intends to retire only from the operatic stage and concert tours. He\nsaid i\nJtI will continue to sing for the radio, television, motion pictures, and for any\noccasions on which people wish still to hear my voice, and especially in our beautiful\nItalian songs.*\nv ,T??n.Gigli made a remaTk that less solemn circumstances mi^it have sounded like a\nbroad hints\n-Suppose,\" he said, \"that tomorrow. He Sica, for example, heard that Gigli is retiring,\n^decided to make a biographical film about me. I certainly would not refuse to sing for\nThe other prominent retirement announcement seemed much more final. It concerned the\nretirement of the former Italian bicycle racing champion, Qino Bartali. Bartali now is 40\nyears old and had been racing 23 years. During that time, he won 153 victories in national\nor international competition and in the course of them he bicycled the equivalent of 16 trips\naround the world.\nTlie Italian sports writers pulled all stops in reporting Gino’s retirement, for he was\na national sports hero in a way that Americans, who have never gotten very excited about\ncycling, would find it hard to understand.\n^ Italy battered 8111 ****** in World Wa* *1# Bartali • s victories against all comers\nin the Tour de Prance, or the Giro d«Italia restored a necessary measure of self-respect in\nthe early postwar years. One journalist recalled the time when a tense parliamentary debfete\nthreatening to erupt in violence. But some wise politician intervened to announce that\nBartali had won an Alpine stretch of the Tour de Prance — and legislators of all political\nfaiths jumped up in a shouting tribute to Gino that broke the tension and saved the day."
}