{
  "id": "d792-155",
  "text": ".ahan Hovey — Letter from Italy No* 23\nNASB Network\nRecorded in Home, March 15, 1955\nTape runs s 14 *00\nf\n(First of two on possible resurgence of fascism in Italy).\nThis is Graham Hovey, recording in Heme a Letter from Italy for the network of the\nNational Association of Educational Broadcasters* These programs are produced with the\ncooperation of Hadiotelevisione Italians*\nAt times, I get the uneasy feeling that much of the current political reporting from\nItaly for America is out of focus* For years now, we Americans have been getting a steady\nflow of articles md broadcasts about the Communist threat to this country* >>e have heard\nfar less about the threat of a resurgence of Fascism.\nYet, many intelligent Italians, whose implacable opposition to communism is a matter^'?\nof record, will tell you that a revival of fascism constitutes the mere serious short-\nrange threat to the young Italian democracy. And some of these Italians wonder why\nAmericano concern themselves so little with this Fascist threat.\nI always reply that our concern with Italian communism is natural for several reasons.\nWe have good reason to believe that the Italian Communist party is not basically different\nfrom other Communist parties, excepting that of Yugoslavia* That is, we believe Palmiro\nTogliatti and Company are bound hand in glove with Moscow and the Ccn&nformj that the\nItalian Communists therefore are a part of a worldwide conspiracy. That fact alone would\nmake them much more dangerous from our point cf view than the Italian Fascists, who have\nno such international organisation* who are not tied to a great power which menaces the\nUnited States and the free world*\nSecondly, the Communists and their allies have a demonstrated voting strength far\nbeyond anything shown thus far by the Fascists* In the last national election, the\nCommunist© and fellow-traveling Socialists together polled more than 35 per cent of the\nvotes for the Italian Chamber of Deputies and won a total of 218 seats* The neo-Faecist\nItalian Social Movement — or MSI — got less than six per cent of the votes and captured\nonly 29 seats*\nKven if the Fascist vote percentage were lumped with th -t of the right-wing Monarchist\nparty, with which it is sometimes allied, the total would fall far below that of the\nCommunists and Left Socialists*\nMy Italian friends admit the validity of these arguments, and many of them concede\nthat the greater lon^-range threat to democracy in Italy is posed by the Communists*\nBut they also warn that the strength of the Fascist idea or Fascist tactics in Italy\ncannot be measured by the number of votes a neo-Faecist party managed to poll in an\nelection two years ago* For they say that Fascism above everything else is a state of\nmind _ and that many Italians who think in Fascist ways actually hold membership in other\nparti s, and probably would have little to do with the MSI, the neo-Fascist group.\nThese Italians say the real threat of fascism in Italy, therefore, is posed not by\nthe MSI, with occasional help from the Monarchists, but by fascist or totalitarian senti¬\nment existing, say, in the Christian Democratic party’s right wing, or even in the Liberal\nparty, or in Italians outside any party at the moment*\nThese arguments came bade to me in a hurry on a recent evening, during fleeting\nmoments when I almost found myself trapped in the middle of a sou ad of young Fascist storm\ntroopers on their wry to attack and bomb Communist forty haadqu rters in Home*\nI use my words advisedly here# I deliberately said a squad of young Fascist storm\ntroopers* These young fanatics were in a kind of uniform — all of them wore gray-green"
}