{
  "id": "d792-161",
  "text": "Reaction# to LETTER mm ITALY\nPago 2\nthe local station. This on~th®~spot type of reporting seems to hare boon much\nneglected in recant years by the eanraercial networks. It la the reaponsibility\nof educational stations to continue and improve this sort of program during peace\nas sell as war-time. There Is certainly popular demand and need for such propens,\nand anything MSB can do to keep them going will certainly reflect veil in the\nlong run on educational broadcasting in general*\n\"Mr, Hovey*s narrations are well prepared and well delivered. Like all \"new\"\ncommentators in any given area, he will necessarily take a while to become popular\nand familiar to the general audience • Frequency and continuity hero will definitely\nadd to hie prestige and that of any atation.\"\nCordially,\n/a/ B. 6. Burrows\nProgram Director\nBo. 4 * KHAD\n\"Some weeks ago, I wrote headquarters to express our extreme delight over\nthe broadcasting of the series, LETTER FROM ITALY. I assure you that it is again\nour pleasure to spotlight this very unique radio aeries which we have carried for\nsome tine through the facilities of the KASB Retwork.\n\"To begin with, one of the beet criteria for judging radio programs is the\nreaction of our own staff* hearing and working with so many and varied types\nof programs, they assume what might be readily called a \"neutral attitude\"\ntowards things in general* However, in the case of LETTER FtiQH ITALY so many of\nthe staff have conveyed to ms the fact that they are faseinated by this program\nand listen in their offices and workshops to each of the broadcasts. In my\nestimation, that is high praise*\n\"Then there le our faculty. Members of various departments but most\nespecially the languages, literature and history have dropped by ay office or\nstopped m on the campus to congratulate us on the fact that we are carrying\nLETTER FROM ITALY. Their reasoning le to the effect that direct ward is to be\nhad at various times from France, England, etc. but this is the first and only\ntins that such a program series has endeavored to give interesting facts and\neaansnts about Italy and things Italian*\n\"Ms arc also pleased to note many comments from listeners over our five*\nstate coverage area regarding the series — all of which leads us to believe\nthat Mr, Hovey is doing an excellent job in Interpreting Italy to us. And may\nwe add that we are meet insistent that the aeries be continued. It will continue\nto occupy an important spot in our weekly schedule of offerings to the people of\nOklahoma, Toms, Arkansas and Kansas.\"\nSincerely yours,\n/s/ John W. Dunn\nJohn W. Dunn, Director\nEducational Broadcasting\nServices"
}