{
  "id": "d792-2",
  "text": "Hovey — 3\nThe Univer&ity for Foreigners actually started to function in 1921 but it was formally\nestablished by state law in 1925, That law said the purpose of the university was \"to\nspread abroad the knowledge of Italy in all its manifestations, past and present.\"\nThe academic year at the University for Foreigners consists of three terms of three\nmonths each, and runs from April to December. There are three different sections _ for\nbeginning, intermediate and advanced students. Courses include the study of the language,\ncivil history, art history, philosophy, literature, and one devoted entirely to Dante's\n\"Divine Comedy.\"\nIn the 33 years of its existence, the University for Foreigners has enrolled some\n17,000 students from 78 different nations.\nThe biggest single group of students has come from Germany, with Americans second.\nBut the annual invasion of American Fulbright grantees for their month of special orienta¬\ntion is closing the gap.\nThat American invasion this year came on Sunday, September 26. Most of the Fulbright\ngranttes arrived in Naples aboard the SS Independence about noon on Saturday, September 25,\nAfter clearing customs, they olimbed into buses and were taken up the Appian Way to Rome\nfor the night, stopping en route for dinner at a seaside restaurant near Formia. They were\nup for an early departure from Rome on Sunday morning, andtheir buses slowly climbed the\nzig-zagging highway from the upper Tiber valley to the crest of XS Perugia about noon.\nAfter a group luncheon at a hotel just off the Corso, the Fulbrighters scattered to\nthe various Peruginian homes where they were to live for the next month. The next day,\nMonday, the vacations ended; the orientation program began.\nMiss Ida Haubold is an attractive redhead from Brooklyn, U. S. A. She studied fine\narts and painting at Hew York's Cooper Union and will study this academic year at the\nInstitute of Fine Arts in Florence.\nJust 48 hours off the boat at Naples, Miss Haubold finds herself in a classroom at the\nUniversity for Foreigners, getting the drilling of her life in down-to-earth Italian from\na tall, handsome man with a Roman nose; friendly but very persistent,\n(COMINCIA II NASTRO NTbSsRO UNO),\nGUARNIERI, Cominciamoi Che cosa fa, ogni mattina?\nHAUBOLD, Ogni mattina, leggo il mio giomale.\nGUARNIERIt Ha letto il suo giomale stamattina?\nHAUBOLD, Non ho ancora letto il giomale di quests mattina, perche' non ho avuto tempo,\nGUARNIERI, Perche' no ha avuto tempo di leggere il suo giomale quests mattina?\nHAUBOLD, Stamattina no ho avuto tempo di leggere il giomale perche' ho risposto alle\nletters che ho ricevuto ie_ri sera.\nGUARNIERI, Che cosa ho fatto stamattina?\nHAUBOLD, Stamattina ho risposto alle letters che ho ricevuto ieri sera e percio' non\nho avuto tempo di leggere il mio giornale, come faocio ogni mattina.\nGUARNIERI, Bene. Molto bene. Eh?\n(FINISCE II NASTRO NUMERO UNO)."
}