{
  "id": "d792-5",
  "text": "Graham Eovey — letter from Italy No,\nRecorded in Rome, October 12, 1954\nTape runsi 13t\n2\nq^-u-H3\n(Second of two programs on .American Fulbright scholars in Italy),\nThis is Graham Hovey, recording another Letter from Italy for the National Association\nof Educational Broadcasters — the NAKB Network,\nIf you had been sitting at a sidewalk: oaf© along the Corso Vannucoi in the hill-set\nItalian oity of Perugia on the bright autumn afternoon of September 26, you soon would have\ndiscovered somethings\nThe fifth annual invasion of Perugia by American Fulbright scholars had taken plaoe.\nIt wasn’t that the Americans were dressed improperly or that they behaved badly. Almost\nwithout exception, they were dressed as they might be for a Sunday afternoon stroll in early\nautumn in their home towns in America. And they behaved well*\nBut dress and behavior nevertheless distinguished them from the thousands of Perugin-\nians, who had come out to the Corso to take the air and greet their friends, while strolling\nthe half-kilometer length of the city’s main street.\nSomehow the Americans seemed more casual — in both dress and manner — than even the\nmost casual Italians on the Corso* For the men Fulbrightera the give-away characteristics\ncould be the cuts of both their hair and their sport jackets} the hang of their grey\nflannels; or their loafer-style shoes. For the girls, too, the low-heeled loafers, the\nhair-does, and the generally more casual sweaters and skirts were distinguishing.\nIn addition, many of the Americans started out immediately to soak up in a hurry what¬\never Perugia had to offer of historical or cultural value.\nWith guide books or without, they studied the great Pisano fountain, or gas:ed at the\nlovely Gothic communal palace, or wandered into the Cathedral of Ian Lorenzo, where they\nclaim to have the wedding ring of the virgin Mary.\nPerhaps you remember, from the previous letter from It sly, the summary of these activi¬\nties of the newly-arrived Folbrigliters by the young oomposer, Marshall Bialoaky, from\nCleveland, Ohio, and the faculty of Milton college, Wisconsin?\n(COMINCIA UN PEZZC DEL NASTRO 3SUMEH0 NUB)i\nBIALOSEYt Inevitably, we try to see it all at one*) to absorb in an hour the culture\nof the ages. And we imagine ourselves as medieval men; as a renaissance painter, for\nexample • • •\n(FUCXSCE XL KASTEO ED5BH0 DUE).\nHOVETi So it was obvious that Sunday afternoon that the 2954 American Fulbright group\nhad arrived in Perugia for its month of orientation, prior to scattering across the Italian\npeninsula for an academia year of work.\nThe Feruginians now take this annual invasion in stride, and no doubt you could have\nheard many of them along the Corso, saying to on© another-1 \"The Americans have come again.”\nAnd many would be smiling when they said it. •\nThat American group this year numbered more than a hundred. Half a dozen were pro¬\nfessors who would be visiting lecturers at Italian universities. Nine more were persons of\nprofessorial rank who had come to Italy to do research in their respective branches of\nlearning."
}