{
  "id": "d792-63",
  "text": "Graham Hovey — Letter from Italy No. 6\nRecorded in Rome December 20, 1953\nTape runs 13*30\nThis is Graham Hovey, reporting from Rome with another radio\nLetter from Italy. These programs are produced for the National Associa¬\ntion of Educational Broadcasters with the cooperation of Radio Italians.\nA big poster on a building near my apartment says that the Hon.\nPietro Secchia will address a meeting of the Federation of Italian\nCommunist Youth on Sunday at the Adriano theater.\nThe poster says that Signor Secchia, the vice secretary general\nof the Italian Communist party, will launch the Federation*a drive for new\nmembers. And it says that the goal for 1954 is 40,000 young Communists in\nRome and the region of Lazio.\nThis poster was pasted over another which you can still make out.\nThis earlier poster says that two party leaders will speak at the Adriano\ntheater on Sunday about plans for the future of Rome and the Lazio region.\nThe speakers were the Hon. Edoardo D’Onofrio, vice president of the Italian\nChamber of Deputies, and Aldo Natoli, regional secretary of the Communist\nparty for Lazio.\nThis second poster had been pasted over a third one put up a week\nearlier. This third poster said that the Hon. Giuseppe di Vittorio would\nspeak on Sunday at the Adriano theater about the demands for wage increases\nby workers in state-owned industries. Signor di Vittorio is secretary-\ngeneral of the Communist-dominated Italian General Confederation of Labor.\nIf you could dig back beyond that third poster you would find that\nfour weeks ago the Hon. Palmiro Togllatti, secretary general of the party,\naddressed a Sunday meeting at the Adriano theater, and that five weeks ago\nthe speaker was Luigi Longo, the hardboiled party organizer.\nAn American in Rome sometimes gets the feeling that the Communists\nwill win Italy in the end simply because they are willing to work harder at\nthe Job than all the democratic parties combined.\nSfals impression might not be accurate. There is more to winning\nan election, more to taking over Italy, than Just winning the battle of the\nposters or having Sunday morning meetings in the Adriano theater.\nStill, I believe Americans should not dismiss this poster business\nlightly — for two reasons* the posters themselves surely have some propa¬\nganda value for the Communists. And they do, in fact, signify serious party\nactivity. Those meetings in the Adriano theater actually come off. And they\nare well attended.\nOne reason why they are well attended is that the Communist leaders\nspeak only rarely about the Soviet Union and world communism. I noticed that\neven the poster announcing that Signor Togllatti would speak on the 36th\nanniversary of the October revolution did not say whose revolution or where\nIt took place. There was no mention of the Soviet Union.\nAnd note what the others were to talk about* Pietro Secchia, the\nstrong man of the Italian Communist party; the real boss of the party's hard\ncore, was to speak to the youth. He was to tell them about Communist plans\nfor making their future brighter than it now Is in Italy."
}