{
  "id": "d792-64",
  "text": "Hovey — 2\nD Qnofrio and Natoli were to apeak on the party's plans for the\neconomic and social rejuvenation of the Home and Lazio area — a program\nthe Communists since have illustrated with well-drawn charts; a program\nthat promises more jobs, better pay* improved housing.\naiuseppe di Vittorio, possibly the most intelligent of the lot,\nwas to talk about the pay of workers in industries operated by the govern¬\nment — and there are many such workers in Rome. He was to explain the\nreasonable-sounding demands his big trade union was makings demands which\nwere reinforced this last week by a 24-hour strike of such workers.\nX would guess that if any of these speakers mentioned Karl Harx\nor Joe Stalin it was only in passing. I would wager that they stuck mostly\nto the subjects of Jobs, wages, housing and security*\nx/4** 4N?W ? ? and J k*10\" JJf** these men are not sincere about these things\nDi Vittorio's labor union could not really work for full employment and high\nwages under Italy's present democratic system. For if those things were\naohieved under a democratic system the extreme doctrine of communism could\nmake little headway. Pietro Secohia and his chief lieutenant, Longo, really\nwant only one things power. And they surely would know what to do with it\nif they got it — and they would do it ruthlessly, with no concern for\nItalian workers or Italian institutions or anything else.\nWe know these things — but the Italians who follow Togliatti and\nSecohia and Di Vittorio and Longo do not know them. And we had better\nrealize once and for all that these Italian workers will never take our word\nfor these things. They will have to find out for themselves. And tKere is\na real longrange chance in Italy that by the time they do find out it will\nbe too late.\nThe Italian working man is unquestionably much like his counter¬\npart in any free country, including the United States. On a day-to-day\nbasis he is mostly concerned about his Job; how secure it is; how much it\npays him and enables him to do for his family. 3o far as he knows, Di\nVittorio s COIL has worked harder to provide better and more secure Jobs and\nhigher pay than any other agency or group. If wages and salaries are con¬\nsiderably higher now than they were under fascism, the worker is apt to give\ncredit to the COIL.\none unpleasant incident on the Italian industrial scone this last\nautumn was the laying off of 2,000 steel workers in the city of Temi, north\nof Rome. The Temi plant was not competitive. It had to lay off surplus\nworkers.\nThis Temi story was treated by the Communist oress as one of the\nbiggest news stories in Italy. When virtually all Italian dailies were de¬\nvoting most of their front pages and their editorials to the subject of\nTrieste, the Communist newspapers were screaming Just as hard about the\nTemi 2,000.\nI should not want to suggest that the other newspapers ignored the\nTemi situation or that the Italian government was calloused about it. But\nthe Communists made the loudest and most consistent noise. And X would\nguess that many embittered unemployed steel workers in Temi got exactly the\nidea the Communists intended them to get; that the Communists and the labor\nunion they dominate were the only groups that really cared very much."
}