{
  "id": "d792-67",
  "text": "Hovey — 5\nAt the moment, the Republicans, Liberals and Social Democrats are\nengaged in long discussions on whether it is possible for them to agree on\na common political program and thus form an influential coalition} a demo¬\ncratic alternative to the Christian Democratic government.\nAt the moment, the Christian Democracy — a widely-based, hetero¬\ngenous party, like our own, in many respects — is showing new evidences of\nstraining at its seams, with only the prestige and power of Alolde de\nCasper1 holding it together.\nAnd while these things are going on, the Communists relentlessly\nstay on the Job of building a party. They talk language ordinary Italians\nunderstand} they talk unceasingly about everyday problems and Issues that\nconcern ordinary Italians.\nIt is surely this energy, more even than the social and economic\nconditions of Italy, that has enabled the Italian Communist party to sur¬\nvive many major defeats in this postwar period but come beck stronger than\never. It is this energy that has enabled a party of two million members\nand a hard cor© of perhaps 200,000 to poll — with its Socialist allies —\na vote of 9*5 million.\nAnd as Communism gains, Italian democracy loses, any way one looks\nat it. Aa Communism gains, its supporters among the Italian workers feel\nmore Isolated than ever from their government} and that government, in turn,\nfeels more Isolated from them. The results have been apparent in a rash of\nserious strikes in recent weeks and months. Some believe the results are\napparent, too, in a turn to the right by the Pella government, which must\ndepend increasingly on the support of the Monarchists to survive.\nAs I drove to the studios to record this program I passed a new\nseries of Communist party posters. They say that the Hon. Di Vittorio will\naddress a meeting of the activists of the CGIL — the big labor union — at\nthe Manzoni theater on Sunday. Anyone interested is invited to attend.\nOne gets the feeling that only when the middle road parties are\nwilling to work as hard as the Communists on all fronts — including the\nbattle of the posters — will the future of Italian democracy be secure.\nGraham Hovey, signing another Letter from Italy. This program\nwas recorded in the Rome studios of Radio Italians for the National\nAssociation of Educational Broadcasters — and this isthe NAEB network.\nm"
}