{
  "id": "d792-73",
  "text": "Graham Hovey — Letter from Italy Ho. 8\n, Recorded in Rome, December 22, 1953\nTape runs 13 minutes\nThis is Graham Hovey, reporting from Rome with another radio\nLetter from Italy, produced for the Rational Association of Educational\nBroadcasters with the cooperation of Radio Italians*\nIn previous Letters X have taken a look at the two extremes in\nItalian politics. I have examined the possibility that Italy might be\ndrifting back to Fascism. And I have examined some factors in the growing\nstrength of the Italian Communists.\nItaly cannot go Fascist and Communist at the same time, of course.\nBut the simultaneous drift toward the two extremes and away from the demo¬\ncratic middle 1s a familiar phenomenon in politics. The national elections\nof last June 7 demonstrated that his trend is continuing in Italy.\nOn the far right, the neo-Fascist Italian Social Movement polled\na million and a half votes and increased its representation in the Chamber\nof Deputies from six to 29 seats. The Monarchist party polled a million\n800 thousand votes and boosted its Chamber delegation from 14 to 40.\nOn the far left, the Communists and left Socialists together\ngained a million and a half votes over their eight million figure of 1948\nand increased their overall representation in the Chamber from 183 to 218.\nThe Fascists and Monarchists have gained by exploiting a variety\nof Italian frustrations and discontents. The Communists and left Socialists\nhave done this too, but they also have worked unceasingly at the onerous\nJob of party organisation and the task of identifying themselves unmistakably\nwith the interests of workers and peasants.\nOne can say all this without entirely explaining away that drift\naway from the democratic middle. What I am saying is that the parties be¬\nlonging to that democratic middle road must shoulder some of the responsibi¬\nlity. It has been their weaknesses, as well as the other factors I have\nlisted, that account for the growing strength of the far left and the louder\nnoises emanating from the far right.\nIt follows that these democratic parties must correct their weak¬\nnesses; must do a more adequate Job, if the delicate Italian democracy is to\nsurvive and grow stronger. Well, then, what are the prospects?\nAt the moment, the strongest of these parties; the strongest party\nin Italy, has the responsiblity of governing the country. I refer, of course,\nto the Christian Democratic party. Last June, the Christian Democrats\npolled nearly 11 million votes and won 262 Chamber seats. That represented\na loss of two million votes and 43 seats over the party's 1948 showing.\nPartly as the result of those losses, the Christian Democracy is\nobviously in a period of transition at the moment. Premier Giuseppe Pella\nmust depend on Monarchist support for his parliamentary majority, but no\none knows how long that will be forthcoming and at what price. The party\nhas shown some signs of disintegration."
}