{
  "id": "d792-75",
  "text": "Hovey — 3\nWell, as X have said, these parties did participate at various\ntimes in the governments headed by De Gasperl*But some of their members\nalways thought such a course politically unwise* At best they were only\ntails to the Christian Democratic kite. Membership in a predominantly\nChristian Democratic government seemed to involve these minor parties in\nan obligation to defend that government. By belonging to such a govern¬\nment they risked being blamed for its shortcomings but found it difficult\nto claim credit for its achievements. They were risking loss of their\npolitical identities.\nThe Liberals finally dropped out in protest over the government1s\nland reform program. The Social Democrats eventually dropped out because\nof their belief that such a course would best promote party unity and win\ndefections from the left-wing Socialist party of Pietro Nennl. Only the\nRepublicans stuck with De Gasperl to the end.\nBut all three parties did establish an alliance with the Christian\nDemocrats for the June elections. And all three went along with the bigger\nparty in passing an ©lection law that aroused bitter opposition, not only\nfrom the Communists, who branded it ”la legge truffa” — the swindle law —\nbut also many Italian democrats. It was this law that would have given any\nparty or group of parties getting one more than 50 per cent of the votes for\nthe Chamber of Deputies 64 per cent of the seats — or 380 seats out of the\n590 total.\nThere is no doubt that this law was a big factor in the failure\nof the Christian Democrats and their three allied parties to get that 50\nper cent.\nTheir poor showings as minor partners of the Christian Democrats\ncaused the Social Democrats, Liberals and Republicans to have lengthy second\nthoughts, not only on the electoral law but on the whole question of the\nfour-party coalition. And in any event, the election results were widely\nregarded as a repudiation of that De Casperi coalition.\nGiuseppe Saragat, leader of the Socall Democrats, looked at the\n600,000 votes his party had lost and announced that he would come into the\nnew government only if the Nenni Socialists were also included. When\nDe Gasperl brushed this suggestion aside, for obvious reasons, Saragat\nlaunched his policy of Mapertura a sinistra” — opening to the left. This\nwas designed either to effect reunion with Nenni's forces, on the condition\nthey would break their alliance with the Communists, or to win recruits from\nNenni if he refused to leave the Reds.\nA split that had been brewing in Liberal ranks for a long time\nthreatened disaster. Historically, the Liberals have been a conservative\nparty, devoted to parliamentary democracy, but wary of government inter¬\nference with the established economic and social order.\nBut the left wing of the Liberal party, composed mostly of younger\nmen, now seems to be gaining the upper hand. Their economic and social\nviews are closely akin to those of the Republicans and the Saragat Socialists\nThe question now is whether this more progressive group can pre¬\nvail without splitting the party. An indication of how nip and tuck the\nintra-party battle is came recently at a meeting of the national council.\nBruno VilXabruna, supported by the left and center, was re-elected party\nsecretary, with 59 favorable votes. But 43 blank ballots were cast and 19\ndelegates abstained from voting."
}