{
  "id": "d792-80",
  "text": "Hovey — 3*\nIt Is interesting to note that the man who carried the veto of Christian\nDemocratic party directors on the Aldisio appointment to Premier Pella was\nAmintore Fanfani. And it was Fanfani who went back a second time to plead\nwith Pella not to make the appointment.\nThat was interesting for these reasons; first, Fanfani vigorously ad¬\nministered the beginnings of the land reform as minister of agriculture in\nDe Gasperis cabinet? second, Fanfani is leader of the so-called “Democratic\nInitiative faction that has fought to keep the Christian Democrats on the\nroad to social and economic reforms; a left-center faction that provides a\ncounterforce within the party to the conservative wing which Aldisio repre¬\nsents; and, finally, Fanfani had served Pella loyally as minister of the in¬\nterior and was slated for reappointment to that important Job in the revamped\ncabinet.\nBut two points need emphasis here;\nThe first is that the Aldisio affair does not mean that the left-of-cen-\nter faction is in firm control of the Christian Democratic party.\nAnd the second is that Pella’s troubles with his party were deeper and\nbroader than simply a quarrel with the party’s left wing over the agriculture\nministry.\nFanfani was spokesman for the party directors on the veto of Aldisio. but\nthis does not mean that Fanfani’s 11 Democratic Initiative* faction can run the\nparty or chart overall party policy. As a matter of fact, ^Democratic\nInitiative is only one of three fairly well defined left-of-center groups\nwithin the sprawling, heterogenous Christian Democratic party. All the\nAldisio affair means so far as the party is concerned is that on this issue\nthe Fanfani group, with the support of De Gasperi, was able to make its policy\ntk© policy. Only in that context was the veto of Aldisio, achieved at\nthe cost of a cabinet crisis, a victory for the Deft wing of the Christian\nIn that connection, it should be noted that Pella’s intention of appoint¬\ning a right-wing Christian Democrat — Attilio Picoionl — as vice premier and\nforeign minister in the revamped cabinet — was quite acceptable to the party.\nIn fact, the party may have suggested Piccioni for the Job. It is interesting,\nthen, to add the additional fact that Picoionl was the soonaor of Aldisio for\nthe agriculture ministry.\nBut the fact that Picoionl was acceptable to the party as number two man\nin the cabinet Illustrates the point that the left wing is not in firm con¬\ntrol of the Christian Democracy* You might say that the left wing had to\naccept right-winger Piccioni as vice premier and foreign minister in order to\nput over its party veto of Aldisio as agriculture minister. But the Piccioni\nmatter gets me back to my second point* that Pella’s troubles with his party\nwere broader than Just the Aldisio affair.\nThe fact is that Pella has never been a “party man,* in the sense in\nwhich politicians use that term. He was elected to parliament as a Christian\nDemocrat and he served with distinction as budget minister in the De Gasperl\ncabinet. But one writer has said of him that although he lived for eight\nyears in the midst of politics, he had as little to do with it as possible.\nAs I reported previously on this program, Pella was the choice of the\nparty to head the government after the summer cabinet crisis. H® was selected\nin fact as well as constitutionally by President Luigi Sinaudi, after De\nGasperl had been defeated in parliament and Piccioni had failed even to get"
}