{
  "id": "d792-81",
  "text": "Rovey •- 4\nto the point of asking the Chamber and senate for a vote of confidence. The\nChristian Democratic leaders in parliament tactlessly made it clear that\nPella was not their man* that they would have preferred someone else.\nIt was only the strenuous intervention of De Gasperi that got the party\nfairly well in line for Pella last autumn. But the political honeymoon be¬\ntween Pella and the country lasted much longer than that between the premier\nand his party.\nDe Gasperi and other Christian Democratic leaders were deeply disturbed\nby Pella1s handling of the explosive Trieste question. Some thought he was\ntrying to use that emotional issue to turn his supposedly stopgap government\ninto a durable one and establish himself firmly in the premiership. It was\nsaid that Pella was spending too much time on foreign affairs and neglecting\npressing domestic questions. Some Christian Democrats thought Pella should\nturn over the foreign ministry to someone else, for he was serving simultane¬\nously as premier, foreign minister and budget minister.\nChristian Democratic trade unionists, led by Giulio Pastors, criticised\nPella for the firm stand taken by the government in the wave of industrial\nstrikes that struck Italy in December. Their union, the CISL, had gone along\nwith the Communist-dominated CGIL In backing those strikes.\nAnd It riled many Christian Democrats that Pella had to depend on Mon¬\narchist support for a sure parliamentary majority and they were constantly\nasking what price the premier was paying for that support.\nBo much, then, for the party's side of the case* There is also Pella's\nside, and It too, deserves serious consideration. First of all, even some\nChristian Democrats vigorously opposed to Aldisio believed Pella had a valid\npoint when he defended the freedom of the premier to choose his own cabinet\nministers. It's the same argument often advanced in America that a President\nshould have a cabinet of his own choosing — forgetting for a moment the very\nbasic difference between the American system of checks and balances and the\nEuropean parliamentary system.\nSecondly, Pella toofc up the burden of forming a government when that Job\nwas truly a thankless task. Be took on that Job at a critical time for the\nItalian democracy. And the fact that he succeeded where De Gasperi mid\nPlccionl had failed brought an end to the long summer crisis.\nPella did that Job well enough to restore the faith of Italians in their\neight-year-old democratic system and to win genuine widespread support for\nhimself in the country.\nPella can make out a case for the argument that his own party has never\nappreciated the Job he did and that it never gave him the support he deserved\nduring his four and a half months as premier* rtParty man*1 or not, he was do¬\ning a Job for the party as well as for the country. And he had served both\nparty and country faithfully and well as budget and treasury minister for manj\nyears.\nSo far as the Trieste issue is concerned, Pella can argue with some evi¬\ndence that it was forced on him and that De Gasperi himself had started the\nball rolling by a much tougher stand on that issue after the elections last\nJune.\nSo far as his dependence on the Monarchists was concerned, Pella can ask\na very difficult question, namely, what was the alternative? What was the\nalternative to depending on the 40 Monarchist votes in the Chamber of Deputies"
}