{
  "id": "d792-82",
  "text": "Hovey — 5\nonce the biggest of De Gasoeri1 s former coalition partners — the Social\nDemocrats — had decided to withhold their 19 votes from Pella? Together,\nthe three former cabinet partners of the Christian Democrats — that is, the\nSocial Democrats, Liberals and Republicans — now have only 38 Chamber votes.\nThree developments in December brought the Pella-party relationship\nclose to the showdown stage:\nFirst, the Christian Democrats Issued a statement that seemed to be\nneutral on the strike of workers in government-operated industries — after\nPella had taken a strong stand against the strike.\nSecond, former Interior Minister Mario Scelba publicly advocated a re¬\nconstruction of the old D® Gasperi coalition government of Christian Democrats!\nSocial Democrats, Liberals and Republicans. Scelba emphasized that he was\nspeaking personally, but he is a director of the party. His speech was in¬\nterpreted as criticism of Pella for accepting Monarchist support.\nAnd finally, De Gasperi wrote a stirring call to action for the first\nissue of a new Christian Democratic weekly. In the article, he referred to\nthe Pella cabinet as **a friendly government*** To Pella, this implied that\nthe party as such felt no responsibility for the government and did not regard\nit in any sens© as a party government.\nPella then threatened to resign unless he got full party support. The\nparty countered by demanding a reshuffle of the\"cabinet to make it more of a\nChristian Democratic political government* And it was inability to reach\nfinal agreement on the makeup of that government that brought on Pella*s\nresignation.\nAs I say, these things help explain why the crisis between premier and\nparty probably was inevitable and would have come later If not now. But these\nthings only begin to explain the much deeper and broader Italian political\ncrisis of which the fall of Pella is only a symptom. I hope to examine this\nmore Important question — for Italy and for America — in another special\ndelivery radio Letter from Italy.\nGraham Hovey reporting from Rome for the National Association of\nEducational Broadcasters — and this la the NAKB Network.\nm"
}