{
  "id": "d792-84",
  "text": "machine, he said, was “based on the huge network of key positions the party\nhas been able to build up throughout the country'1 during its years in power*\nand the economic interests were simply the “big vested interest® of Italy,\nplus Catholic labor.*\nBoth this Italian writer and beo J* Wollemborg wrote their descriptions\nof the Christian Democracy more than two years ago* But each had one addi¬\ntional thing to say which I think helps to explain the present crisis within\nthe party, of which the fall of Premier Pella was a symptom.\nThe Italian writer said that the ingredients of the Christian Democracy\nwere held together by “only one agenti the fact that the party is In power.*\nHe said that “any shift in the political situation within the country at large\nwill threaten the whole structure.*\nAnd Leo wollemborg said that it was due only to former Premier Ale id e de\nGasperl*® “singular personality, his unusual mixture of deep piety and politi¬\ncal skill, that the party has held together at all.*\nI say that these two assessments -• which actually contradict one another\nin a sense •* help explain what is happening to the Christian Democratic party\ntoday. The “shift in the political situation* which the Italian writer said\nwould \"threaten the whole structure* of the Christian Democracy actually\noccurred in the national elections last June ?. And if the party still is\nholding together, rather than breaking up into its many ingredients, it still\nis due to the prestige and power and political skill of Aloide de Gaeperi.\nPolitical scientists and political Journalists have long sought to isolate\nthe Ingredients that go into the cement that keeps a great political party\nintact, but all would agree, I think, that victory at the polls ranks high on\nthe list, and the Christian Democrats, founded on the remnants of Don Sturso*®\nold Italian Popular party during World ivar IX, have been a remarkably success*\nful party, whether they made any sense in their composition or not*\nIn the first national postwar election in Italy — held June 2, 1946# to\nelect a Constituent Assembly and render a verdict on the monarchy — the\nChristian Democrats became the strongest party in the country. They got 95*2\nper cent of all vote© oast*\nmd in the crucial national election of April 18, 19*8 — while the free\nworld hold its collective breath — the Christian Democrats won nearly 49 per\ncent of the votes$ captured an absolute majority of seats in the Chamber of\nDeputies and a comfortable plurality in the Senate. It had only about a\nmillion party members, but got more than 12*7 million votes.\nIn the national election of last June 7# the Christian Democrats polled\n10.8 million votes to remain the largest single party by a wide margin. 3ut\nthey had dropped nearly two million from their 1948 high mark and their re¬\npresentation in the Chamber dropped from 305 seats to 262i\nMathematically speaking, the overall election result was not a defeat.\nBut the result certainly was a serious political setback and it started the\nvarious factions of the party snarling at each other again. For the Christian\nDemocrats had expected to do better* They had made an electoral alliance with\nth® Social Democrats, Liberals and Republicans and they believed this four-\nparty bloc would get more than 50 per cent of the votes. They had been able\nto pass an electoral law under which any group of parties getting more than\n50 per cent of the votes would get nearly 65 per cent of the seats in the\nChamber, or 380 out of 590. But th© bloc failed by 57*000 votes to get its\n50 per cent and wound up with a total of only 300 Chamber seats — not a\nworkable majority*"
}