{
  "id": "d792-86",
  "text": "dovcy — 4\nIt seems likely that because of these attacks on him from left and right\nand because of certain aspects of Pella*s behavior, Be Gasperi has been blamed\nby many Italians for Pellafs fall. In the previous letter on the fail of\nPella, I mentioned Be Gasperi*® stirring call to action In a Christian Demo¬\ncratic weekly as on© factor in Pella*& determination to force a showdown with\nthe party.\nBut the evidence available seems to indicate that all through the cabinet\ncrisis Be Gasperi*® role was two-foldi that of trying to prod Pella to take\ncertain actions that might placate the party and that of trying to persuade\nthe party to keep its demands on Pella within reason so as not to upset the\ngovernment. Indeed, at one point, Be Gasperi, fearing that Pella might take\nextreme action, offered to make another personal call on the premier to try\nto get agreement. But Pella sent word that he did not believe such a meeting\n**opportune.”\nAnyhow, if I am correct in believing that the fall of Pella is but a\nsymptom of a deeper and broader crisis within the Christian Democratic party,\nperhaps it is time to take another and closer look at the composition of the\nparty.\nas X reported previously, the party veto of Pella * a plan to nominate the\nultra-conservative Salvatore Aldtalo administer of agriculture was engineered\nby a loft-of-center Christian Democratic faction known as the * Democratic\nInitiative.* But * Democratic Initiative* is only one of three, fairly well-\ndefined left-lf-center group© within the Christian Democratic fold. That fact\ngives you a rough idea of how heterogeneous the Christian Deaiocr&ey la.\n\"Democratic Initiative\" was formed originally to combat what its member® re¬\ngarded as a swing to the? political right by the party directorate. As X say,\nit was instrumental in bring about the party veto of Signor Aldisio.\nlet, two of the most prominent leaders of \"Democratic Initiative\" held\nmajor positons in the Pella cabinet and would have been retained if Pella had\nrevamped his government Instead of resigning. They are Amintore Panfanl,\nminister of the interior, and Paolo Emilio Taviani, minister of defense.\nBut back to the party i The other major group on th© Christian Democratic\nleft is the trade unionists, the men who run the Catholic labor union known\nas the 0I3L. Their icador la Giulio Pastor©, head of the CISh. The union\nItself claims more than a million and a half member© and has a sis©able bloc\nof Christian Democratic deputies in parliament. Pastor® is working hard to\nbuild a great union and to win Workers away from the bigger Communist-dominated\nCGXL. But to do that he must fight some industrialists as hard aa he fights\nthe Communist®. And that means, specifically, that Pastor® is engaged in\nfrequent bitter battles with the Industrialists and big land-owners who make\nup the Christian Democratic right wing* This right wing is known as the\nVespisti because it held it® first caucus in a showroom for the Vespa motor\nscooter, and its leader la a big landowner, Carmine do Martino. When de\nMartino tried to address the Christian Democratic party congress a year ago,\nthe left wing howled him clown and told him to \"go join the Fascist©, where\nyou belong.1*\nBut to get back to Pastor®, his latest fight was actually against th©\ngovernment run by his own party. Pastor©*s CIS! joined th© Communist-led\nCGIL in calling a strike of workers in government industries in December over\nthe strong protests of the Pella government.\nThe third left-of-center group in th© Christian Democracy is led by\nGiovanni Gronchl, president of th© Chamber of Deputies. It is not a large\ngroup, but some Christian Democrats regard it as dangerous. In economic and"
}