{
  "id": "d792-97",
  "text": "Graham Hovey — Letter from Italy Ho. 14\nrecorded in Rom®, February 5, 1954\nTape runs? 13i35\n(First in a series of four broadcasts on the Italian parliament In relation\nto the January political crisis)\nThis la Graham Hovey, sending along another radio Letter from Italy under\nthe dateline* Rome. These programs are produced for the national Association\nof Educational Broadcasters with the cooperation of Radiotelevisions Italians.\nThe guide books say that the Palace of Montecitorio was begun in the year\n1650 by the great Roman architect and sculptor, Giovanni Lorenzo Bernini.\nIf you have visited Rome you probably will recall Montecitorio. Its\noriginal front is located almost in the heart of downtown Rome, Just off the\nPiazza Colonna. It Is next door to the Chigl palace, which houses the Italian\nforeign ministry. Its most imposing exterior landmarks on this original front\nare a familiar but always beautiful type of bell tower and a huge clock that\nface the square which io named for the palacej a square that has at its center\none of dome13 many obelisks.\nAt its other end, Montecitorio has another imposing front — you*d have\nto call it another \"front/’ even if the term seems contradictory. And this\nsecond \"front\" is dominated by a long and broad flight of steps that ends in the\nPiazza del Parlamenio — Parliament square.\nThis square gets its name because the Palace of Montecitorio houses the\nItalian Chamber of Deputies — the more important house of the Italian parlia¬\nment. Italians use the word \"Montealtorlo\" in political conversation in the\nway we Americans use the expression \"Capitol Hill/1 or the way in which the\nBritish use the word, \"Westminster.\"\nXou would know immediately what an American meant if he told you to ex¬\npect plenty of fireworks on Capitol Hill over the -iricker amendment. In the\nsame way, if an Italian says it will be a week \"molto movimentata\" at Mon tec 1-\ntorio, he means that the debate in the Chamber of Deputies will be fiery and\nagitated.\nWell, the last week in January certainly was \"molto moviiaentata\" at the\nPalace of Montecitorio. It was the week In which the Chamber decided the fate\nof the government constituted on January 18 by Amintore Fanfani. It was the\nweek in which the Chamber, by striking down Fanfani, left Italy without a gov¬\nernment for the second time in a month, and thus reopened the political crisis\nwhich started with the resignation of Premier Giuseppe Pella on January 5•\nArticle 94 of the Italian constitution requires a new government to pre¬\nsent Itself to the Chamber and the Senate for a vote of confidence within 10\ndays after its formation. So, on Tuesday, January 26, Signor Fanfani formally\npresented hie cabinet and his program, first to the Chamber and then to the\nSenate, which meets about half a mile southwest of Montecitorio in the Madams\npalace.\nThen the Senate adjourned to permit the Chamber to act first. And for\nfour long parliamentary sessions on consecutive days, Fanfani and his cabinet\nsat at the ministerial bench in the well of the Chamber and heard themselves\nworked over by political orators ranging from far Left to far Right. The vote\nof rejection for the Fanfani government came in mid-afternoon of Jaturday,\nJanuary 30.\nHot for a long time have ordinary Italian citizens been so interested In\na debate at Montecitorio."
}