{
  "id": "d792-98",
  "text": "Hovey — 2.\nDay aft©r day* Ions lines of thorn formed In front of the entrances to\niiontecitorio in spite of almost constant rain and winter temperatures said to\nbe the lowest in TO years in Home* They were hoping — most of them vainly —\nto get on© of th© relatively few gallery seats in the Chamber available to the\ngeneral public*\nIf you left rainswept Parliament square and crossed the Corao to get\nunder the protection of the arcades around the largo Chigit you could hear\nsnatches of political conversation on all aides as small bunches of people\nwaited for the latest editions of afternoon newspapers*\nyou might overhear a discussion on Fanfani’s chances in a bus or street¬\ncar or a Roman restaurant*\nfact was that th© Pella resignation came as a shook to a country\nwhich had settled down again after the unexpected fall of Premier Alcid© d®\nGasperl last July. There is no doubt that Peila#s popularity with the country-\nat-large remained high at the moment when difficulties with his own Christian\nDemocratic party prompted him to quit the Job he had taken on last August*\nThere Is no doubt that many ordinary Italians unable to follow the subtle\ntwists and turns of intra-oarty politics felt that they had been left comoletely\nin th© dark to th© real reasons for the new crisis. \"\nSo* these ordinary Italians felt some compulsion once again to interest\nthemselves in their countryfa politics. They suddenly developed the feeling\nthat they had a stake in th© political drama being enacted within th© walls of\nMont©©itorio«\n_1 least* that is the way it ae^raed to this foreign observer, on that\n©isma*. Tuesday when Fanfanl presented, his cabinet and program* my press creden¬\ntials were in order for th© Senate but not for the Chamber. So I joined a big\ncrowd that gathered in the downpour at a vest entrance to .onteclto^lo fully\nan hour before Fanfanl was scheduled to arrive.\nMoot of us had series h tickets* which were lowest on the priority list,\nio, when the carabinieri finally opened the doors* practically no on© in our\ncrowd was permitted to enter* after that long wait in th© rain.\nStill* the crowd remained good-natured for th© moat part. And* more\nsignificant* perhaps* most of it remained right there at the entrance even after\nFanfanl had begun to spook. They wore interested enough in what was going on\nto cling to the thin hop© that sooner or later they would 00 admitted to the\nChamber.\nPlenty of spirited speeches were delivered by members of the crowd and\nmost of them got respectful attention. Their common theme was the rtdlsgrazlaw\n— this disgraceful situation in which citizens of the Republic could not get\ninto coateeitorio to see the government of the Republic in action, even after\na long wait in the rain and cold.\nSow and then someone would rail at the cheerful and patient carabinieri\nwho had the unhappy Job of guarding th© door, ait mostly the crowd lashed the\n\"bureaucracy or some nebulous group called the Hauthoritiesw responsible for\nthis disgrazia*”\nIt was impossible to note any common political denominator and chances\nare the crowd ranged the full length of the Italian political spectrum.\nThere was th© sterotyp© of th© Neapolitan. He had inched his way to the\nhead of the line* where he gave brief lecture® — replete with Neaoalitan\ngestures — to th© carabinieri and other listeners."
}