{
  "id": "d1237-0",
  "text": "■n\nA E B\nmt\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. XXV NO. 10\nOCTOBER 1960\nConvention Program Changes\nCopies of the preliminary program for the NAEB\nconvention, October 18-21, Jack Tar Hotel, San\nFrancisco, have gone to all NAEB members. The\nonly' changes as the Newsletter goes to press are as\nfollows:\n• Playwright Rod Serling will participate in the\nsession on “Too Hot to Handle?: Controversy in\nBroadcasting.” Kenneth Adam will not be on that\nprogram, as listed.\n• Kenneth Bridson will not participate in the ses¬\nsion on “The Integrity of Sound.”\n• Dr. Frank C. Baxter will be toastmaster at the\nconvention banquet, at which Steve Allen will speak.\nIndustrial Associates Exhibit at Convention\nAmong the exhibitors at this year’s NAEB con¬\nvention are eight of the nine NAEB Industrial\nAssociates: RCA, GE, 3M, Ampex, GPL Division of\nGeneral Precision, Inc., Adler Electronics, Dage, and\nSarkes Tarzian. Motorola was unable to exhibit\nbecause of other trade show commitments for the\nsame dates.\nConventioneers will have ample time this year\nto visit all exhibits and they are urged to do so.\nIndustrial Associate representatives will be willing\nto help with any problems NAEBers may want to\ndiscuss with them.\nBooth numbers for these and other exhibits-wcill\nbe listed in the convention program to be distributed\nat the convention.\nTettemer Heads Utilization Project\nThe NAEB has received support from the U. S.\nOffice of Education for a project leading toward\nbetter utilization of educational broadcasts. Kits of\nmaterials to help schools improve or initiate the use\nof such broadcasts will be made available on short¬\nterm loan to school systems, colleges, universities,\nbroadcasting stations, and others.\nMembers who would like to submit ideas for the\nkits should send them to Clair Tettemer, Director\nof School Programs, KTCA-TV, St. Paul 8, Min-\nr\\ nesota. In general, the kits will contain all the in¬\nformation and material necessary to carry on a\nutilization demonstration, workshop, or meeting. All\ntypes of A-V material can be used, either individually\nor in various combinations of film, slides, printed\nmaterial, tape recordings, models. Pilot kits have\nbeen prepared by the staff of KSLH, St. Louis, and\nthe Chicago and Minneapolis public school systems.\nNAEB Washington Office News\nBeing mailed with this Newsletter is a supplement to\nkeep members abreast of developments from the\nNAEB Washington office opened September 1 by\nWilliam G. Harley.\nHeadquarters and Network Moves Accomplished\nDuring the month of September, the NAEB offices\nwere moved from 14 Gregory Hall to two houses\nseveral blocks away. The Network operation pro¬\nceeds from 55 East Armory, Champaign, Illinois,\nwhile other Headquarters personnel work at 59 East\nArmory. There is one intervening house occupied as\na residence. Items misplaced during the move keep\npopping up every day, and all involved hope that by\nconvention time things will be relatively serene once\nmore.\nPlease note that the mailing address is 119 Greg¬\nory Hall, Urbana, Illinois.\nNAEB Passes 1,000-Member Mark\nIn September, total NAEB membership, including all\ncategories, passed the 1,000 mark.\nFCC\nOhio University’s application for a commercial TV\nstation at Athens has been dismissed.\n• The Moody Bible Institute of Chicago has been\ngranted a noncommercial educational license for\nWMBI-FM.\n• Walla Walla College, College Place, Washington,\nhas applied for an FM license.\n• Appications have been granted, for FM radio sta¬\ntions for Central University of Iowa, Pella, and San\nMateo Junior College, San Mateo, California.\nJESSE TRUMP DIES\nJesse Trump, assistant manager in charge of pro¬\nduction of the NAEB Network, died at his home\non Sunday, October 2, after a long illness. He had\nbeen with the NAEB for over four years.\n1"
}