{
  "id": "d1237-3",
  "text": "we like it or not — profoundly changes the educa¬\ntional job that now needs doing.\nGoaded on by members like Vernon Bronson,\nwe have asserted that what is needed is a true\nprofession, encompassing both those who are the\nprofessional wielders of these instruments, arid the\nother educators, with and for whom the instruments\nare to be used, if education’s cause is to be served\nby them.\nA profession, I would remind you, must advance\nknowledge — not merely distribute it. Failing to\nrecognize this key to professionalism would, I fear,\nbe fatal. I am, then, not speaking only of the skills\nour \"professionals” will have. For before we think\nof the training needed, we need to identify the kind\nof person we wish to attract. In view of develop¬\nments of the last year or so, I think it is essential\nthat we have people who won’t do certain things for\nmoney. They must also be people who will actively\noppose, not just \"regret,” certain uses of TV and\nradio — and who will speak up on behalf of what\nthey believe.\nProfessionals in the sense I visualize do not con¬\nfuse leadership with popularity — recognizing that\nthe two are in fact, in a sense, opposites. Such\npeople will not hesitate to stand by leadership re¬\nsponsibilities regardless of popularity effects.\nThe people we need in our profession are con¬\ncerned about our nation and its behavior in this\nnuclear age.\nNot long ago Norman Cousins in an editorial\nasked: “What do we do when we’re wrong?” He was\nreferring to U. S. national policy, of course. Do we\nsupport the “party line” whether it be in politics,\nor diplomacy, or educational policy? How valid is\n\"my country (organization, station, bailiwick), right\nor wrong” ? Or do we call for hard looks, and facts,\nand standards to which we can all subscribe with\npride as citizens of the world as well as of a great\nnation ?\nI am aware of this international responsibility\nparticularly because of the increased requests reach¬\ning us in recent months from the nations of Africa,\nAsia, and other newly emerging areas. They look to\nus for leadership and guidance: in the kinds of\nfacilities they need, the kind of people they must\nhave, and the kinds of tasks which these media can\nbest handle. Do we pass on to them suggestions\nwhich will soon be anachronistic? practices which\nare outmoded? If we are to deserve to lead, we\nmust be sure our eyes are on the future and that\nour standards are high and clear and unequivocal.\nIf that line is followed, I believe the NAEB will\nbefore too long find supporters and members in\nevery nation of the globe, including our own — in\na new relationship in which truth and humanity and\ncourage and human dignity reappear as national\ncharacteristics. This will apply in both fields — edu¬\ncation and broadcasting — insofar as it lies within\nour power to bring this about.\nThat is the challenge that I think faces the\nNAEB, as I turn over to others reins which I have\nheld proudly for over seven years.\nPublications\n“Needed Research in School Broadcasting” is avail¬\nable free from I. Keith Tyler, Bureau of Edu¬\ncational Research and Service, Ohio State University,\n154 N. Oval Drive, Columbus 10, Ohio.\n• \"Teaching Through Television,” a report on the\ncurrent use of\" TV in schools in western Europe, is\navailable at 75 cents per copy from the Organization\nfor European Economic Co-operation, Suite 1223,\n1346 Connecticut Avenue, NW, Washington, D. C.\n• \"The Relation of the Writer to Television” has\nbeen published by the Center for the Study of Demo¬\ncratic Institutions, Santa Barbara, California. Single\ncopies are available free.\n• Adler Electronics, 1 LeFevre Lane, New Ro¬\nchelle, New York, has for distribution free copies of a\nstudy describing an economical method for extending\nthe coverage of WUNC-TV, the University of North\nCarolina’s ETV station, to major communities in\nthe western part of the state.\n• Edward G. Sherburne, Jr., head of the visual\ncommunications department at the University of\nCalifornia, had an article on future ETV research in\nthe July-August issue of A-V Communication Review.\n• Gale R. Adkins, director of radio-TV research at\nthe University of Kansas, had an article, “Roles in\nTelevised Instruction,” in a recent issue of the\nTeachers College Journal.\n• Parts I and II of \"What Is Important for the\nSuccess of a New Employee in Television” are\navailable at 50 cents each from Mr. Adkins. (See\nreview in September-October NAEB Journal.)\n• “TV Transmission Possibilities for Ohio Wesley¬\nan University” — a study financed by an NAEB\ngrant — is available on loan from the NAEB. The\nreport was prepared by Harold D. Gorsuch, an engi¬\nneer at WOSU-TV, Ohio State Universityr\n• A brochure called \"How to Use Direct-Wire TV\nas a Low-Cost Educational Tool” describes how a\nschool can begin to use direct-wire TV as a teaching\naid with an investment of $595. Copies are available\nfrom Argus A-V Systems Department, Argus\nCameras, Inc., 405 Fourth Street, Ann Arbor, Michi¬\ngan.\n• A 97-page final report on its three-year experi¬\nment in offering college credit courses via TV has\nbeen issued by the Chicago City Junior College.\n• A TV planning guide has been issued by the U. S.\nArmy Signal School for those individuals engaged in\nplanning, preparing, and presenting TV programs via\nthe corps’ CCTV system.\n4\nNEWSLETTER"
}