{
  "id": "d1388-11",
  "text": "from the most beautiful girls at court, the next Queen for King\nArgon of India. This is followed by a great banquet and a mag¬\nnificent celebration. Part IV. The Polos Return to Venice.\nAfter a mutiny, shipwreck, and attack by pirates, as Marco at¬\ntempts to take Princess Kogatin to India to become Queen, they\nare finally rescued and go ashore at Anamba to collect the annhal\ntribute, but learn that Kublai Khan has died. They finally deliver\nthe princess, and continue on to Venice, where they arrive five\nyears later.\nNo. M79-91. Ferdinand Magellan.\nPart I. Sails to Far East with Da Gama. Magellan, a gentleman\nof the Court of King Manuel of Portugal, enlists as a common\nseaman and sails around the Cape of Good Hope to Cochin, India,\nwith a view to conquering India. The Zamorin of Calicut attaches\nthe Portugese with a fleet of two hundred ships, after being un¬\nable to impress them with a gigantic parade which he stages in\ntheir honor. Part II. Straits of Magellan. In 1520, Magellan\nsucceeds in sailing his clumsy, square riggers through the Straits\nsouth of South America, and names the Pacific. After sixty-seven\ndays of suffering, starvation and panic, Magellan’s ships reach the\nMolucca Islands where Magellan is warmly welcomed, and loses\nhis life in a foolhardy adventure against an overwhelming number\nof natives who have rebelled! against their king. His ships, how¬\never, continue on to England.\n*No. M53-56. Sir Francis Drake.\nPart I. Leads Expedition to New World. Drake is presented to\nQueen Elizabeth, and justifies his proposed expedition on the\ngrounds of gold, new lands and a new passage to the Far East.\nUpon the advice of Lord Essex, the Queen unofficially approves.\nPart II. In Straits of Magellan. Gale. Songs. Young sailor\nbecomes frightened and Drake consoles him. Ships become sep¬\narated. One lost; one returns to England. Only the flagship gets\nthrough the Straits.\n*No. M61-65. Sir Francis Drake.\nPart III. Plan Pacific Voyage. Spanish captain tells of Drake's\ncapturing his ship and taking $5,000,000 worth of gold from him.\nDrake discusses plans with his leaders. Captured Chinese pilot\ngives good counsel. Part IV. Home Again, Knighted. Ship\nhangs for 20 hours on a reef, but finally gets free and sails on to\nPlymouth, England. Drake is welcomed by the mayor, then told\nhe is to be arrested. Elizabeth is disturbed. Visits Drake secretly\nand knights him.\n12"
}