{
  "id": "d1388-12",
  "text": "No. M62-64. Sir Francis Drake.\nPart V. Drake Lands in California. Drake sails north as far as\nVancouver in his search for the Northwest Passage. But returns\nsouth to San Francisco where he lands, meets Indians, observes\nthe fertility of the soil, and claims the land for England. Part VI.\nCrosses Pacific and Lands at Motir Island. Due to the skillful\npiloting of Chang, Drake’s ship, The Golden Hind, finds the safety\nof an island harbor. Drake is welcomed by the Viceroy, an ex-\nshipwrecked German sailor who had risen in esteem of the native\nking. Sends Chang home with a chest of gold. Sends officers\nashore to dine with the Sultan of Ternate. Royally treated. Pre¬\npares to sail to England.\nNo. M50-51. William Dampier.\nPart I. Fails to Capture Spanish Galleon. Dampier who spent\nmany years in Pacific waters trying to capture Spanish ships\nloaded with gold, circumnavigates the globe and writes a detailed\naccount of his adventures from carefully preserved notes. In this\nepisode, he cruises off the coast of South America and has many\ninteresting experiences but fails to capture a Spanish galleon lad-\nened with $20,000,000 worth of gold. Part II. Crosses the Pacific.\nCaptures the town of La Villa. Crosses the Pacific to Guam. Has\ntrouble enroute. Sails to the Philippines. Royally welcomed by\nthe Sultan.\nNo. M14-18. Jean Lafitte.\nPart. I. American Traitors and Pirates. Washington burned by\nthe British. Mr. Lafarge offers to deliver Louisiana to the British.\nLafitte carries on his piratical activities in southern Louisiana.\nThe Governor offers a reward for his capture dead or alive.\nPart II. Lafitte Helps Save New Orleans. There is a price on\nhis head. State troups have attacked his colony at Barataria and\ndestroyed much property and captured many of his men. Yet\nLafitte goes to General Andrew Jackson and offers him all his\nforces to fight the British, if Jackson will permit the release of\nsome of Lafitte’s men from jail. Jackson agrees, and the men fight\nvaliantly in the Battle of New Orleans.\n13"
}