{
  "id": "d1388-5",
  "text": "Being a splendid example of radio writing and acting this series\nis really suited to the needs of classes in drama especially those\nstudying radio production. The complete set of radio scripts may\nbe purchased with this series. By reading the book, studying the\nscripts and actually listening to the drama, high school juniors\nand seniors and college students can get a clear insight into the\nfine art of radio writing and radio acting. (Also see D22-23, D18-\n25, D80-91, and D82-85 under the Cavalcade of Drama).\nTHE CAVALCADE OF DRAMA\nThis series dramatizes in a vivid and authentic way the lives of\nall types of personalities—poets, conquerors, musicians, religious\nleaders, royalty, etc. The author, Dr. Kimball S. Sant has collaborated\nwith recognized authorities in history and literature to make sure that\nevery detail of biography and setting is factually true. Such historians\nas Dr. Laurence Chandler of the University of Southern California,\nDr. Carlyle and others have cooperated whole-heartedly in an earnest\nendeavor to recreate true-to-life portrayals.\nListen to the actual words of Bonaparte, the humble Corsican\npeasant, who rose by strength of his own will to conquer a mighty\nnation and become its Emperor. Walk hand in hand with Elizabeth\nBarrett as she confesses her great love for Robert Browning. Hear\nthe wind in the Vienna Woods blowing an inspiration to Johann\nStrauss to write one of the most beautiful waltzes the world has ever\nknown. Compare the tragic lives of Stephen Foster and Edgar Allen\nPoe. Share the heartaches of the martyred Queens Marie Antoinette\nand Mary Stewart.\nThe “Cavalcade of Drama” deals dynamically and factually with\nthe lives of these great and fascinating personalities. It enables its\nlisteners to know personally the creators of history. Men and women\nwho, literally, have shaped the destinies of the peoples of the World.\nIt takes the dry inert pages of history, and fills them with the breath\nof life so that each character might again live and love, conquer whole\nnations, write inspired music and poetry, but in the end—die as all\nmortal beings must in spite of their great accomplishments.\nNo. D4-9. Marie Antoinette.\nPart I. The Feeble-Minded Louis XVI. Marie sits on a lounge\nand talks with her husband who is then Prince Louis Bourbon.\nLouis stares out the window. Louis tells of his likes and dislikes.\nMarie plays the harpsichord. It is their first wedding anniversary\nand Count d'Orleans enters with a present for them. Part II.\nThe Revolution Grows. Intrigue. Count d'Orleans publicly de¬\nnounces, Louis and Marie. They fear for their safety. The voice\nof the ghost King Louis XV speaks. A mob attacks the palace.\n6"
}