{
  "id": "d1388-9",
  "text": "devour every living thing in their path. But the Mormons pray,\nand great flocks of seaj gulls come and eat the locusts before the\nnew crops are destroyed. Upon Young’s return from the East he\nhas a monument erected to the sea gulls to commemorate their\nsaving the colony.\n*No. D120-128. Stephen C. Foster.\nPart I. Sells “O Suzannah.\" As a young man, Foster goes to\nCincinnati to a song publisher named W. C. Peters, and sells\n“O Suzannah” for $250. Returns to Pittsburgh to learn that his\nsweetheart Suzannah has died. Asks his brother for his old job\nagain. Part II. Foster a Bum in New York. After Foster s wife\nleaves him, because of his failure to provide, he goes to New York\nand deteriorates rapidly. His brother William goes to New York,\npays Stephen’s bad debts and gets him out of jail, but Stephen re¬\nfuses to return to Pittsburgh.\nNo. D125-129. Stephen C. Foster.\nPart III. Foster Marries Jane McDowell. Hard times. Jane\nupset. Says she’ll leave Stephen before she will bring a child into\n4 such abject poverty. Part of “Swanee River” sung. Stephen walks\nalong the Ohio river and meets Charles Dickens who compares the\nriver and life. Part IV. Last Days of Foster. Foster drinks ex¬\ncessively. Lives in poor rooming house. Collapses. Taken to\nBellevue Hospital. Wires his wife.\n*No. D133-142. Victoria Regina.\nPart I. Victoria Becomes Queen. King George IV dies and\nI Victoria is informed that she is Queen. German Princes Ernest\nand Albert invited to London, but Albert does not wish to go.\nVictoria likes Albert and discusses love, but he falls asleep. Later,\nhowever, he admits his love and they become engaged. Part II.\nGolden Jubilee. Victoria feeble, but takes part in the celebration.\nDiscusses her reign and health with Dr. Stanley, her physician,\nand with her son Albert.\nNo. D135-140. Victoria Regina.\nPart III. Prince Albert and Victoria. Victoria not pleased with\nher efforts to make Albert over. Albert unhappy because he has\nno power nor anything useful to do. Decides to get acquainted\nwith the English people. Goes to the House of Commons and\nhears himself condemned. Part IV. Albert Becomes an Influen-\ncial and Wise Counsellor. Crimean War. Florence Nightingale\ndiscussed. Albert clashes with the Prime Minister over tactless\nmessages the latter proposes to send to America and Russia.\nAlbert re-writes the messages. Overworks. Becomes gravely ill.\n10"
}