{
  "id": "d1680-5",
  "text": "JiM EbELj ^H5Cr £\\*G! NF.ER OF WILL, TALKED BRIEFLY ON FM AND DESPITE WHAT 98\nBEEN! SAfC AND WRITTEN, HAD A GOOD STORY TO TELL AND ONLY LACK OF TIME KEPT\nA GOOD DISCUSSION FROM GETTING STARTED*\nJohn Stiehl, Chief Engineer of WHA, discussed all or the various types of\nRECORDING DISCS AVAILABLE ROW A?vD TOLD OF PROBLEMS i NVGLVED IN USING AND\nGETTING THEM*\nAt THE BUSINESS SESSION, W. I. GRIFFITH GAVE A TREASURER’S REPORT SHOWING\nTHE BALANCE *)N HAND AS OF SEPTEMBER 6 TO BE $644,56, SlMCf' THE REPORT\nmade on May 5 in Columbus, $21 had been collected and none disrupted by\nTHE TREASURER. OUTSTANDING OBLIGATIONS WERE REPORTEO AS BEING APPROXIMATELY\n$115. Further anticipated income for 1941 amounted to approximately $25.\nat random: WHA has a “Dear Sir” program on which Mac and Bill Harley talk\nOVER THE MAIL RECEIVED DURING THE WEEK, ANSWERS QUESTIONS, AND EXPLAIN THE\nPROBLEMS AND WORKING OF THE STATION...AT WOI THE LIBRARY IS RESPONSIBLE\nFOR NINE PROGRAMS EACH WEEK...NOVJK REPORTS A PROGRAMS SERIES OF POETRY\nwith use cr Victor, Columbia, and Decca records...Phil Staley said scmethinc\nABOUT SOME' MJ'3J.0£,\\N*S ALMANAC HAVING SOME GOOD PROGRAMS IDEAS AND I 9 VE\nLOST NOTES ON EXACT TITLE.*.NOVlK SaYS THERE SHOULD BE MORE PLAY ON\n31G NAMES IN CONNECTION WITH USE OF RECORDED MUSIC... EVERYONE FELT TH*T\nGibbs Williams and his assistant Fred Conger did a fine job in handling\nthe meeting.o eNotably missing were retiring President Ingham and Vice-\nPresident Jensen...Blanche Young'and Recorded Lectures, Inc. are looking\nFOR GOOD PROGRAM IDEAS...WILL HAVE SOME PROGRAMS AVAILABLE FOR S0HOOLS\nSOON.\n•LUCSS PREVENTS 1 N3HAM-JENSEN,,.MI£NfANC£\nHoping until the last minute to attend, Harold (3. Ingham wired word of his\nINABILITY TO ATTEND BECAUSE OF ILL HEALTH AND PRESS OF BUSINESS ON THE\nKansas campus. Ingham spent quite sometime in the hospital last spring\nAND HADN'T FULLY RECUPERATED.\nA wire from Milford Jensen arrived during the Friday evening dinner.\nJensen sent greetinos and explained that health did not alloy/ him to\nattend. We.trust ill health was nothing worse than hay fever, and in\nany case, our sympathies."
}