{
  "id": "d1789-0",
  "text": "Office of -Executive Secretary\nUrbana, Illinois\nMay 1, 1941\nOH TO COLUMBUS\nRemember the NAEB meeting scheduled for Monday night at Ohio\nState University* s twelfth Institute for Education by Radio,\nSee you there.\nIn addition to NAEB members, attending the institute will be\nrepresentatives of the chains, individual radio stations, sohools\nand colleges, national organizations making use of radio, and\ninterested individuals. Sessions are open to all who are Inter¬\nested, Arrangements are in the hands of Dr, W, W, Charters,\ndirector, and Dr, I, Keith Tyler, executive secretary, both of\nOhio State,\n\"Radio in the Current Crisis” is the subject for the opening\ngeneral session Monday morning, May 5, in which the technique\nwill be that of ”America*s Town Meeting of the Air” as broadcast\nby the National Broadcasting Company,\nParticipants will be George V, Denny, Jr,, president of Town\nHall, Inc,, Hew York; Ed Kirby, office of the chief of staff,\nUoS, Army, Washington, D.C.; Robert Landry, radio Editor of\nVariety, New York; and Clifton Utley, Chicago Council of Foreign\nRelations,\nIn the afternoon of May 5 institute attendants will turn their\nattention to “Handling News and Special Events Broadcasts,”\nunder the leadership of Paul W. White, director of news broad¬\ncasts for Columbia Broadcasting System, Hew York, As a part of\nthis program the group will listen in on two-way conversation\nover cue channels with Columbia’s foreign news correspondents,\nbefore they go on the air from Europe with regular evening\nnews roundups,\nA morning general session May 6 will be given over to \"Radio\nand Cultural Relations with the Americas,” Among the speakers\nare Mauricio Magdalene, head of the department of fine arts,\nRepublic of Mexico; Antonio C. Gonzales, assistant director\nof Latin-American Relations, Columbia Broadcasting System,\nNew York; John M, Begg, U.S. Department of State, division of\ncultural relations, Washington, D.C. ; and Philip L. Barbour,\nOffice for Coordination of Commercial and Cultural Relatione\nbetween the American Republics, Hew York."
}