{
  "id": "d1759-1",
  "text": "Ik specific questions -which they are inviting interested parties to answer in their\ncomments. Those interested in details should write the FCC, Office of the Secretary,\nWashington, D.C., 20554, and ask for Report No, 4842, Oct. 25, 1963.\nHOUSE RULES COMMITTEE CLEARS EDUCATION BILI5\nThe House, on Oct. 29, approved resolutions sending HR 6l43, the college facilities\nhill, and HR 4955, the NDEA renewal-vocational education-impacted areas hill, to\nconferences to resolve differences between the Senate and House versions of the two\nmeasures.\nHR 4955, as originally approved hy the House, contained no provisions regarding\nNDEA (which is due to expire June 30, 1964 unless extended), while the Senate version\nauthorizes a three-year extension. It is under Title VII of the NDEA that extensive\nresearch in ETV and other media has been carried on hy the NAEB and member institutions.\nMembers of the House are generally taking the position that the student loans program\nshould be expanded and extended for two years while the remaining titles of NDEA\nshould be granted only one-year extensions.\nADDITIONAL ETV GRANT APPLICATIONS\nThe following additional applications for grants under the ETV Facilities Act\nhave been accepted for filing by HEW: (Amounts indicate total project cost)\nMetropolitan Pittsburgh Educational TV (File #34), to improve operation of ETV\nstation WQED, Ch. 13. $212,174.\nCommunity TV of Southern Calif. (File #35), for new ETV station, Ch. 28, Ios\nAngeles. $1,056,656.\nTwin City Area ETV Corp. (File #36), for new ETV station, Ch. 17, Minneapolis-\nSt. Paul. $168,470.\nKentucky State Board of Ed. (File #37), for new ETV station, Ch. 46, Lexington.\n$762,088.\nKentucky State Board of Ed. (File #38), for new ETV station, Ch. 29, Somerset.\n$426,065.\nPenn. State Univ. (File #2), to amend its application for new ETV station from\noperation on Ch. 69, State College, to operation on Ch. 3, Clearfield. $639,907*\nFURTHER HEARING ON WOI AND WNYC\nOn Oct. 24 the FCC remanded to the Hearing Examiners fot further action the pro¬\nceedings on applications for special service authorizations of WOI, Ames, Iowa\n(640kc, 5kw, Daytime) to operate additional hours from 6 a.m. to local sunrise CST,\nwith 1 kw, and WNYC, New York City (830 kc, 1 kw operating between sunrise in NYC\nand sunset in Minneapolis) to operate additional hours from 6 a.m. EST to sunrise\nNYC and from sunset Minneapolis to 10 p.m. EST. Initial decisions in 1956 and 1957\nlooked toward granting the authorization, but were deferred pending outcome of the\nClear Channel proceeding. WOI and WNYC have been given 30 days to amend their\napplications and bring them up to date and to apply for regular licensing for the\nhours desired. Both 640 and 830 kc are clear channels, in Los Angeles and Minneapolis,\nrespectively, but WOI and WNYC have been operating the additional hours since 1944\nunder a series of special service authorizations.\nFORM FOR ITV FIXED STATION APPLICATIONS ADOPTED\nOn Oct. 24, the FCC adopted Form 330P to be used by nonprofit educational organiza¬\ntions in applying for CPs for ITV Fixed Stations in the 2500-269Gmc band. Form is\nsimilar to ETV Form 340, but tailored to elicit information pertaining to transmission\nand other noribroadcast characteristics of the 2500 me service."
}