{
  "id": "d651-0",
  "text": "COMMENTS m NMB VIDEO PftQttlJCXlON PROJECT\nft/\n^b;, Stone * i. Wisdom ol creating *'through NAEB* another television program service\ncompetitive with NETRC * Z * Question wnethe. \"the stations can afford teethe* service,\no, that NAEti can finance m m> ice ol any consequence Iron othe* than station foods,'*\ni *«Ia th« extent that NA£E will seek os accept uaderwritiag financing ot programs they\nare confusing the nmumml image at educational television and cresting a competition for\ntha present p<^«a service which My decrease Its effectiveness by Mr mo;-# than the value\nat new programs to be produced by or tor MSI/*\nloha W tavXof WITW - Agrees with Stone -\nThomas Fairy - “For years* the individual stations, working together with NET, have\nteen complaining arid are finally doing something about the matter of quality productions*\nIt seems evident bo® the p od actions that we have received in the last year and a half and\ntom what we were permitted to preview from next year's schedule, that NET is weii on its\nway in providing a truly outstanding program service which v«;y definitely responds to the\nneeds ol the ETV stations i have screened mmmmoblm- kinescopes and tapes which several\n•‘independent** ET V stations have either produced lor their own distribution or acquired\ntom Other sources and, in all honesty • I have found little that was useful o, could approach\nthe mwmi NET products in quality “\n\"It seems obvious that a diversion of funds, such as NASh proposal would seem to imply,\ncould well be suicidal at this critical period **\nHoward L. lohnsoii KKMA-TV - *‘it does appear to he in disagreement with some of me\nstatements made at an ear 1Mb date regarding the activities of NAEB as they relate to the\nactivities of METRO.\n**I sincerely hope that we do not ante, into future conflicts regarding the designated\nresponsibilities of these two organisations inasmuch as both have a very important role\nto play in educational broadcasting **\nJohn C Crabbe KV1E - **l urge that the vested interests in MM& invite an ebjetUve\nanalysis of the Association to determine whether os proposes are to encourage a st^oag\neducational broadcasting system tn cooperation with all ether agencies in the Held, or\nwhether those purposes are to preserve NAEB in competition with many other influences\nthat have come on the scene* :*\nKenneUi A Chitstlaasen wuri-TV* **I think this is the kind of activity which diverts NAES\nfrom its i ole as a professional organisation It seems to me much mora realistic to think\nof staff time being devoted to interesting foundations or organisations in giving funds for\nestablishing training programs than for the unreality of funds for production 4 programs\nthat have no real guarantee of distribution. I am convinced that this production activity\non behalf of NAEB diverts the image of National Educational Television. I think this activity\nproperly rests with the Center/*"
}