{
  "id": "d651-14",
  "text": "PLEASE ADDRESS\nNAEB HEADQUARTERS\nP.O. BOX 17\nJUN 2 9 1962\nAM\nriverside school, front street Schenectady 5, new york fr 7-8517\nJune 25, 1962\nMr. William G. Harley, President\nNational Association of Broadcasters\nDupont Circle Office Building\n1346 Connecticut Avenue, N.W.\nWashington 6, D. C.\nDear Bill:\nAs you know, we have been on the air just about a month now and our station is not\nequipped for production. Along with this we are in the throes of a fund drive that is\nnot doing well. For these reasons I must beg forgiveness for a belated reply to your\nrequest for an opinion on the decision taken by the NAEB Board.\nApparently this decision has stirred up a good deal of controversy, and I feel somewhat\nlike an outsider being asked for an opinion. I must say at the outset, however, that\nmy immediate reactiorHsince NAEB leadership has been approached by groups interested\nin underwriting ETV programs, would be that in the interests of its membership it might\nvery well contact^those stations which are capable of producing such programs to see if\nthere is interest’:--that apparently is what you are suggesting as the first possibility\nin your letter of May 25.\nSecondly,ince NAEB has offered a service to its individual members in job placement,\nwhy could not the same approach be used for contract placement? I think the same approach\ncould be used for the film documentary series you suggest under Item 2 as regards film\nproduction—for there are a number of the larger ETV stations already equipped for this\ntype of production and having NAEB headquarters, which represents us, taking over the\nresponsibility for production would, I feel, constitute a kind of competition with in¬\ndividual stations.\nJudging from what is stated in your letter of May 25, it would seem to me that a decision\nof the TV Board could have been reached before the entire Board had the opportunity to\npass judgment—since, in reality, this is a consideration cf more immediate interest to\nthe TV Board and less to the radio members.\nI appreciate the opportunity to react—even if somewhat belatedly,\nof some help in my answer.\nDESrea\ncc: RS Burdick\nHN Gunn Jr\nRB Hull\nRD Hurlbert\nL Martin Jr\nKJ Nighbert\nL Stone\nD Tavaner\nI hope I have been\nSincerely,\nC~^TDV\\\nDonald E. Schein\nManager\nmohawk-hudson council on educational television"
}