{
  "id": "d651-3",
  "text": "TRANSMITTER—EDISON TECHNICAL SCHOOL\nCHANNEL\nSTUDIOS—UNIVERSITY OF WASHINGTON\nSEATTLE 5, WASHINGTON\nAugust 2, 1962\nBill Harley\nNAEB\nWashington, D. C.\nDear Bills\nI guess I had not understood the anguish I had caused you over the\ntelevision program matter, and I sincerely apologize — for your\nfriendship and your effectiveness in your job are of far greater\nimportance than is this particular matter,\nI made a report to the television stations in my region -- i^hich I\nfelt was my responsibility as their elected representative. And\nI sent you a copy of that so you wouldn’t think I was carrying on\nbehind your back. When you sent out a statement to all the members\ntelling of the Board action and reporting what I thought to be but\none side of the story, I thought it proper to turn out a \"minority\nreport”. Mine went only to the television stations -- not to the\nfull membership. I also sent you a copy of that letter.\nI suppose, Bill, the thing that had me most disturbed was that I\nbelieved the Board was flying in the face of what I am positive\nwere the wishes of the majority of the educational television\nstations. We have a well developed form of democracy in the State\nof Washington which provides for both initiative and referendum\nprodedures, by which matters can be referred to the citizenry,\nthemselves when there is reasonable doubt as to the citizens’\napproval of legislative action or lethargy. I see nothinjun-demo¬\ncrat ic in the NAEB Board referring a matter of the importance of\nthis one to the stations.\nWhen the stations believed they needed some mechanism other than\nthe NETRC aegis through which they could work together on some of\ntheir common problems, NAEB appeared to offer a solution through\nthe creation of the Television Board. If the first matter of real\nimportance to the television stations is to be decided in light of\nthe interests of the entire NAEB membership and contrary to the\ninterests of the station group, then NAEB is not providing the forum\nfor the television stations they need.\nAnd now I see where it is proposed to re-structure NAEB so the tele¬\nvision stations have even less say in whbt NAEB does for and to the\nstations. This may be a practical solution to what the group con¬\nceived to be NAEB’s problems, but I don’t think it is going to provide\na mechanism to meet the specialized needs of the television stations.\nIt looks to me like NAEB may force the stations to create some sort\nof organization of their own to meet their non-NETRC problems.\nUniversity of Washington Seattle Public Schools a King County Schools • Seattle University e Seattle Pacific College Seattle Public Library"
}