{
  "id": "d651-38",
  "text": "-4-\nFQR THE PROTECT (14 Replies)\n(Hurlbert, Kager, Miles, Browne, Dunn)& Schenkkan\nHartford Gunn - “I stand behind my statement at the Board Meeting that I would favor\nNAEB trying television production on an experimental basis. I share many of the doubts\nand concerns of Loren Stone on this matter, but think that the only way to prove the value\nof such a service to the NAEB and to the mem foe, & may be to set up a trial run and see how\nit goes.”\n”A brief discussion with Jack White indicated no opposition or hostility on his part to the\nNAEB proposal.”\n”This may pose problems for those of us who hold membership and affiliate status with\nboth organizations; but at least on the administrative level the situation has been clarified.”\nEdward Wegener - “First, added diversity in program sources, which I assume will mean\nnew and fresh approaches to programming, is desirable.”\n“Second, speaking only locally (Alabama), w© need something that is located between our\nown preoccupation with utility (how to do it, teaching), and the Center’s emphasis on Big\nIssues, Big Names, and Culture. I am not discounting either end of the programming scale.\nW© need what NET has to offer, although they speak only to the most literate of the available\naudience.,,.But somewhere in the ‘vast wasteland* in between there is swinging room for\nimagination and creativity.”\nThird, the project may unearth outstanding local talent.\nFourth, “NAEB should not attempt to go over any of the same ground which NET has covered.\nAlso a new approach to audience should evolve, different from theirs.”\nGray don Ausmus - WUOA - ”1 have always felt that it would be desirable to have more than\none source of programs in EXV.”\nRichard 13. Burdick * ”1 encourage the experiment to determine the competence of NAEB in\nregard to serving unfulfilled TV program needs .*'\nGarnet R. Garrison - Undertaking is desira bie and would like to be considered for sub¬\ncontract work.\nCaA G. Balson - College of William & Mary - Interested in using and producdng NAEB\nvideo tapes.\nHarry O, Lamb, WGTE-IV - Re first series, NAEB’s service need not be competitive—could\nbe supplementary and fill needs of certain subject and interest areas not served by NETRC.\nSees second series as prestige item only.\nBarton L ♦ Griffith - University of Missouri - Would be interested in producing domestic series.\nRoy J. Johnston - “The possible production experiment as outlined in your memo is a logical\nextension of NAEB activities and is an experiment in which we would enjoy participating.”"
}