{
  "id": "d651-4",
  "text": "-2-\nI wonder if NAEB isn’t trying to be so/nany things, for so many people that\nit is taking on more activities than it can do well. As we take on more\nprojects we must have more money -- as we need more money we rush into\nactivities that might provide us with funds but perhaps are not in the\ndirection of the needs really to be served for our members. In fact I\nguess we don’t really know who are members are or should be, or what we\nshould be doing for them. Are we a trade association or a professional\nassociation, or both; and what memberships should we serve and how.\nI’m really not trying to be pessimistic -- but practical. I’m not used\nto operating on someone else’s money, but having to produce something\nuseful for the income derived. I think NAEB should find what it can do\nfor its members within the income that membership will produce. The\nmembership is not entitled to any more unless it is willing to pay for\nit. When it pays for what it gets, it will have the right and the\nincentive to make sure it is doing for itself, through its association,\nthose things which really need to be done -- not just going through a\n^l^of motions because they appear necessary to keep up with someone else.\nSo you won’t think I am just sour on NAEB (although you will undoubtedly\nconclude that I am so out of touch with things, way out here in Seattle\nthat I don’t understand all the events and their significance that compel\nthe actions that are being taken -- and you are probably right) I am\nenclosing a copy of a letter I have written to Jack White, that is part of\na current exchange between us. This is not part of a ’’hot mimeograph”\ncampaign like a friend of ours carries on -- you are the only recipient\nof this copy, and it is for you, alone.\nI suppose I shouldn’t be so pessimistic, I just returned from a good\ncouple of weeks of vacation and feel fine. Also my ego is in good shape\nat the moment for I have recently turned down a most flattering offer to\ntake over a commercial television and radio station operation -- but what\nthe heck, I have served my apprenticeship on that circuit and know that\nI don’t want to get gack into that sort of a rat-race. I enjoy the\nthings I am doing and the people I am working with, both locally and\nnationally too much to leAVe. I got out of the commercial business\nbecause I finally found that my health and sanity were worth a lot\nmore than money. Incidentally this is not something I want publicised,\nfor I am not trying to brag about it. I tell you about it only so you\nwon’t think I am just a tired and discouraged guy.\nAnd Bill, I am not trying to discourage you, for there is no one in this\nbusiness for whom I have a higher personal regard -- and I consider\nmyself in part responsible for having pressured you into taking on the\nNAEB job.\nHow can I best help you.\nLoren B. Stone"
}