{
  "id": "d651-47",
  "text": "Mr. William G. Harley\nJune 8, 1962\nPage Two\nNow to get down to cases. Jake Dunlop,\\my Program Director, in\nhis comments on your memo, spoke loud and long for more programming\nfor children out of school. He feels that what has thus far been done\nhas not explored all the ways of doing it. Or possible content. He\nis not discounting \"What*s New,” an excellent series. I agree with\nJake that this is one of the really skinny areas of programming in ETV.\nWe have tried it here but with less than indifferent success. What\nwe needed was the right people and the money to buy them with.\nLet me now list a couple of other areas where I think some excit¬\ning programming might take place. One is in the general scope of\n\"Our Heritage.\" I am aware that NET has ventured into this. My idea\nis different. Once we had a regional idea going in SREB for a series\non the rich historical story of the Southern Region. It was not to\nbe a talk series, but was to rely heavily on seeing places and things,\nwith the right talk with it. Something like the job Herb Hake did on\nthe Midwest. Now, this concept could be projected into a national\npattern...along series, to be sure, if every section got what it con¬\nsidered its fair share. But that could be worked out, and production\ncould be shared. Sixty-two stations should be able cooperativley to\nbring off something pretty worthwhile# I am limited here by not know¬\ning what your preconceptions are about how any series sponsored by\nNAEB should be produced. Again, diversity might be a blessing rather\nthan a hindrance. Or a single roving producer might be employed to\ndirect the efforts at the several stations to give unity to the series.\nPerhaps this whole paragraph is brought about by the fact that I am\njust past the midpoint in my reading of \"Advise and Consent.\" Who\nwe are as a people, how we got here, and what some of the alternatives\nare as to where we are going, appeals to me as needing much explora¬\ntion. Such a series could be done right in D. C., with the shift in\nemphasis I have just given it. That isn*t where I intended going\nwhen I started the paragraph. Therefore, our history in terms of\nplaces, where I started, is what I would put in the pot. The real\ndigging in, as it appears in the book, is probably only possible in\na novel—so let*s shelve that.\nNext—for the last two days I have been bugged by the fact that\nin cleaning some paperbacks out of my desk I came across \"The Creation\nof The Universe\" by Gamow, and \"The Universe and Doctor Einstein\" by\nLincoln Barnett. Both of these books, along with other concerned with\nthe new physics and with astrophysics, have always got to me, reached\nout and completely engaged my mind and imagination. The whole realm\nof concepts and complexes of ideas on which our science today, and\nparticularly space science is based should not be the private preserve\nof specialists. We can*t all be Von Brauns, but there are several\nlevels of understanding between him and us which could be occupied by\ncitizens if they were given a chance to be taken mentally by the hand\nand led."
}