{
  "id": "d651-56",
  "text": "WUFT-TV. UNIVERSITY OF FLORIDA, 234 STADIUM, GAINESVILLE, FLORIDA\nJune 6, 1962\nHr. Wi11iam G. Harley\nPresident\nNational Association of\nEducational Broadcasters\n13^6 Connecticut Avenue, N. W.\nWashington 6, D. C.\nDea r Bill:\nI am sorry [ could not attend the Board Meeting in Columbus.\nYour memorandum of May 25 prompts these comments:\n1. I disagree with the action of the Board which authorized\nthe President of the NAEB to contract for the package production of\ntwo educational television series on an experimental basis. [ feel\nas two of the television board members did, that this is a matter\nwhich should have been passed on to the membership for its action.\n2. I think this is the kind of activity which diverts NAEB\nfrom its role as a professional organization. It seems to me much\nmore realistic to think of staff time being devoted to interesting\nfoundatiorvsor organizations in giving funds for establishing training\nprograms than for the unreality of funds for production of programs\nthat have no real guarantee of distribution. I am convinced that this\nproduction activity on behalf of NAEB diverts the image of National\nEducational Television. I think this activity properly rests with the\nCenter. ‘ The question of training personnel for the mushrooming of\ntelevision operations that will follow the national legislation is\nnot being faced in any quarter as far as l can tell. I think NAEB\ninstitutions could properly be contract institutions for such training\nprograms. In half a dozen institutions, selected for their particular\ncompetence, could be the potential for training staff at all levels\nand in all areas. Graduates of radio and television programs in our\ninstitutions are not going to meet the critical demands in management,\nprogramming, engineering, etc. Process of the regular program is too\nslow to meet growing staff demands as I see it.\nKAC:mt\nCordially,\nKenneth A. Christiansen\nDirector of Television\nJUN 1 1 1962 f\n» « p»\n?I?I?|W|12|1|9|3|4|6|P\ni"
}