{
  "id": "d651-64",
  "text": "CHANNEL\nSTUDIOS—UNIVERSITY OF WASHINGTON\nTRANSMITTER—EDISON TECHNICAL SCHOOL\nKCTSCTV)\nCOMMUNITY TELEVISION SERVICE\nSEATTLE 5, WASHINGTON\nMay 23, 1962\nTo: Television Members of NAEB Region VI\nFrom: Loren Stone, TV Director* Region VI\nI feel I should report to you on action taken at the recent meeting of the\nNAEB Board in Columbus* Ohio, May 2, 1962, on a matter which I opposed\nvigorously because I believed the majority of television stations w^)ch\nare members of NAEB were opposed to such action:\nThe Full Board of NAEB approved the following action: \"That the NAEB\nPresident, on an experimental basis for a two year period, be empowered to\nenter into contracts for package productions of ETV programs\"*\nThe above motion had been presented to the Television Board earlier the same\nday by John Schwarzwalder, Director of Region IV, but it was approved by the\nTV Board only with the addition of an amendment that the recommendation be\nsubmitted to a vote of the TV active members of NAEB for their majority\napproval. It was this amendment which the full board deleted.\nI have been seriously concerned for some time at the effort to created, through\nNAEB, another television programs service competitive with NETRC. The stations,\nthemselves, now provide but about l/6th the cost of the NETRC programs —\nthe balance of the cost being provided by foundation or underwriter support.\nI do not believe the stations can afford another service, or that NAEB can\nfinance a service of any consequence from other than station funds.\nTo the extent that NAEB will seek or accept underwriting financing of programs\nthey are confusing the national image of educational television programming\nand creating a competition for the present program service which may decrease\nits effectiveness by far more than the value of the new programs to be produced\nby or for NAEB.\nI think it was entirely inappropriate for the full NAEB board, which has a\nmajority of non-television members, to over-ride the TV Board on a matter\nwhich primarily affects the television members.\ncc: Bill Harley, President, NAEB\nDick Hull, Chairman of full board, NAEB\nRay Hurlburt, Chairman TV board, NAEB"
}