{
  "id": "d651-7",
  "text": ">3«\nof those on the Center staff who see the underwriting road as the\nfuture of educational television. Our station was not conceived to\nbe a vehicle for public service promotion for anyone — not our\nschools, not our social agencies, and certainly not for business,\nI know that your present and sionere posture is that you will accept\nunderwriting only for those programs which fit your idea of good\nprogramming. M ney could not buy any other kind of programs from you\nor your staff. *But Jack the availability of underwriting funds or\nthe needs or desires of the underwriters cannot help but lower the\nstandards of programming, just as it has done — not to the same\ndegree, obviously — in commercial broadcasting. A great many\ncommercial broadcasters are just as fine and just as sincere people\nas we are. They want to provide good programming for their audiences\nbut have gradually been forced — little tiny bit by little tiny bit —\nto take programs below their standards because these programs are the\nones which can be supported by advertisers. We will ultimately find\nourselves in thisfeame position of lowering our standards bit by bit\nto accept £hose programs or the modifications of our own program ideas\nwhich are acceptable to our underwriters.\nWe talked in one of our recent affiliate meetings about not accepting\nCoca Cola, for example, as an underwriter for hhildren*s programs, for\nthis would be too \"commercial\", But I see by the SPONSOR article that\nIBM is underwriting a series on Computers; that American Cyanitnid is\npresenting a science series? NAM one on American Business; Mead\nJohnson the Family Doctor; the AMA on You# and Your Doctor; a number\nof Swedish companies underwriting a series on life in Sweden, etc., etc.\nThis, in my opinion, is the height of commercialization.\nSome way must be found to provide the kind of service the stations can\nuse without our selling ourselves and our audience out to the under¬\nwriters. The stations and the communities must learn that they have\nto support these stations *• that they cannot be supported forever by\neither Uncle Sam or Uncle Henry — and that the local stations and their\ncommunities must be content with the kinds of programs, whether produced\nlocally or nationally, that the stations and the communities can and\nwill pay for. There is really no other way.\nI know your activities in New York have produced some spectacular\nresults in terms of fund raising for the Center both with the Foundation\nand with business and industry. It has taken this to support the kind\nof an operation which you think is important and necessary for educat¬\nional television.\nI do not desire either the stations or the Center to be poor, but I do\nsincerely believe that neither the stations or the Center will survive\nif they lose their integrity as educational facilities. Harvard may\nhave large endowments that are in part provided by business and industry\nbut they do not have a Chair by IBM, nor one by the AMA — nor one by\nMead Johnson or by World Book, etc.\nPart of the fundamental difference between our points of view. Jack,\narise out of our different station background — you come from a\ncommunity supported station, I strongly believe that the only stations\nwhich will long survive and be healthy are those which are fully\ninstitutionally supported. The stations which depend on their audiences\nfor large parts of their income require ifuite a different type of"
}