{
  "id": "d651-75",
  "text": "4\nJ\nOregon State System of Higher Education\nGENERAL EXTENSION DIVISION\nMay 29, 1962\nDepartment of Educational Media\nOffice of KOAC-AM-TV\nCorvallis, Oregon\nMr. William G. Harley\nPresident, N A E B\n131*6 Connecticut Avenue, NW\nWashington 6, D. C*\nDear Bills\nI am just as much against the NAEB going into the production of a\npackage for ETV as I was against the NETRC going into network radio pro¬\ngramming, and for many of the same reasons.\nTwo competing organizations which seek to speak for a group of\nstations in the search for program material and for donors of production\nfunds cannot help but confuse the ,,imageM of educational radio or\neducational television.\n!i The strength of the radio network is in having one strong organiza¬\ntion, not two competing services. Likewise the strength of the ETV net¬\nwork is in having one group of affiliates and one central approach to\nthe dollars with which to produce network programs. It seems to me that\nthe affiliates and the NETRC have a good working agreement on this\napproach for such production funds. NAEB entry into this field could\nonly confuse the problem for everyone concerned.\"\nI would also be concerned about the idea of seeking donor partici¬\npation and production of a series without the additional commitments\nregarding duplication and distribution. We know that the masters of a\nseries on tape or in the cans will be of no use until duplication has\noccurred and distribution made. It would appear that these items are\njust as much a part of the initial consideration as are financing and\nproduction.\nIn view of the above reactions, I would be happy to see the final\nplan one of leaving development of ETV programming to the Center and its\naffiliates.\nJMM:rr\nccs Loren Stone\nRalph Steetle\nRECEIVED\nNAEB HEADQUARTERS\nMAY 3 1 1962\nAM PM\n7|8|9|ip|ll|12|l|2|S|4|5|6\nl\nToBl\nGeneral Extension Division Serves the State of Oregon Through Facilities and Resources of the State System of Higher\nEDUCATION: OREGON STATE COLLEGE, UNIVERSITY OF OREGON, PORTLAND STATE COLLEGE, OREGON COLLEGE OF EDUCATION, SOUTHERN\nOregon College, Eastern Oregon College, Oregon Technical Institute, the Medical and Dental Schools, and in Cooperation\nwith Various State Agencies and Departments"
}