{
  "id": "d1739-1",
  "text": "-2-\nOne last thing. Needless to say, in these days of scandals and investigations, we( as\nteachers of radio, television and film, can exert an extra effort to help and Improve the\nstate of broadcasting throughout the country. Our responsibility to the young students\nof broadcasting is an important one. Now is the time to rework and strengthen courses;\nto lay stress on high programming standards: to encourage constructive criticism; and to\npay careful attention to ethical practices in advertising, management and production. Per¬\nhaps we can help to lay the groundwork for future industry leadership and a more informed\nand able radio, television and film audience,\n*********\nSummary of panel? \"The Future of Mass Media Research\"\nSamuel L. Becker„ State University of Iowa, Chairman\nCharles F. Hoban, University of Pennsylvania, Annenberg School of Communications\nWilliam McPhee, Bureau of Applied Research, Columbia University\nBoth of the speakers called for a reappraisal of our approaches to research in the mass\nmedia of communication. Both agreed that most of the present approaches had become sterile\nthat they no longer produce much gain in knowledge.\nDr, Hoban stressed three points?\nI. Greater effort must be made to develop research designs which better \"fit\" the\nproblem to be investigated. He suggested a need to get away from the \"cook book\"\nmethods so often substituted for adequate conceptualizations of the problem.\n2. There is an urgent need for an intense study of the effects of the introduction\nof new media coranunications systems, such as television, on other systems rely¬\ning heavily on communications media, the most obvious and most important of which\nis education. These studies call for careful observation and description,\n3. One of the places in which traditional experimental studies are still needed in\nthe newer educational media is in the area of testing various methods within a\nmedium in order to find the optimum methods. One example cited was that of test¬\ning various methods for programming teaching machines.\nDr McPhee pointed out that former leaders in our field have been drifting away from research\nin mass communications. It would seem a reasonable hypothesis that the reason is that they\nhave found that the mass media did not have the striking., direct effects that were once\nsupposed. These researchers deserted direct research in mass communications because they\nfound it more fruitful to focus upon processes - e.g., how voters make up their minds in\nelections, how attitudes are developed, or how children and their families use the media.\nInterestingly, however, and on the more optimistic side, new communications insights are\narising from research programs which gave up the frontal attack on communications. If these\nunexpected outcomes foretell the future, then the mass media will eventually be back into\nmarry of these research programs in a much less superficial naive way than they entered\ntwenty-five years ago. Thus, an understanding of the mass media and their effects might\nbest be obtained indirectly, by studying the processes by which we as a society live and\nthink.\n********"
}