{
  "id": "d1396-1",
  "text": "-2-\nhomes. However, this number grows smaller all the while. In casual conversation\nwith almost any member of the faculty, one finds that they spend a considerable\nnumbers of hours listening to the radio-many mere than they commonly admit-some\nhaving pet programs which they hesitate to forego for social engagements. I grow\nquite impatient with this attitude, and 1 have come to believe that it furnishes\nthe first point of attack in any program of college or university broadcasting. We\nwould-be highbrows have devoted too much time to criticism of the weaknesses of the\nradio and too little time to articulate appreciation of and constructive suggestions\nfor the best the radio*Jias to offer.\nIn the second place, it seems difficult to convince the faculty that there is\nany place for the local radio station expept for local advertising and local athletics\nThey will grant that there is a place for local newspapers, but they fail to grant\nsimilar justification for the local broadcasting station. It takes continual empha¬\nsis upon this point to get them to prepare their radio programs in terms of the needs\nand interests of Southwestern Michigan which is largely rural. They much prefer\nscholarly academic generalizations requiring from fifteen to thirty minutes to read.\nThere are times when I am tempted to think that such is the professorial turn of\nmind so why not accept that fact and leave broadcasting to those with a better lis¬\ntening audience consciousness. But being one who believes firmly that publicly-\nowned and controled institutions of higher learning have an obligation just as surely\nto their service area as to campus students, I return again to stress upon the rural\naudience of Southwestern Michigan. Just as surely as elementary and high school\nteachers are expected to learn the technics of visual and health education, college\nand university professors should master new technics of presenting their subject-\nmatter,"
}