{
  "id": "d1396-2",
  "text": "-3-\nOur programs have been devoted largely to subjects of local interest or of gen¬\neral interest localized in interpretation or personalities. Prior to tne referen¬\ndum on county reorganization, we had a series of programs on local government. At\nthe time of the setting up of county consumer councils, we had two series on con¬\nsumer problems. This year our state celebrates its centennial, and so we have been\nhaving series on state historical events. Last spring one series featured interest¬\ning auto drives thruout this area with discussion of various geological or biological\nor literary or historic points of interest noted* Nor have we negiected tne literary\nand aesthetic interests. Of course our program has not been devoted exclusively to\nthe local, no:* more than is our newspaper, the Kalamazoo Gazette.\nThe third in our series of skepticisms with which we must contend, is that I\nhave great difficulty in convincing the faculty members that any one is listening. It\nis difficult to put any personality into a talk when one can not envision listeners,\nparticularly is it difficult to maintain an easy conversational style even when one\nis participating in a round table. I post on the faculty bulletin board just before\nthe end of each term—which, incidentally, is just before beginning to line up the\nprogram for the next twelve week period—a number of letters of commendation and\nrequests for copies of programs plus a statement of the total number of copies of\ntalks for which there have been requests. During the past year 1,000 copies were\nsent out. When I hear comments from out in the field on our programs, I take pains\nto spread the word about. We have had a few listening groups organized, concerning\nwhich notices are posted. And yet I find it difficult to get faculty members to\nenvision listeners. They are accustomed to and dependent upon the stimulation of a\nvisable audience.\nIn the fourth place, left until last purposely, is the attitude of condescension\non the part of the management of the broadcasting station. Each fall after they\nhave their season's program quite well signed up, they call us to remind us that"
}