{
  "id": "d1396-4",
  "text": "to reserve the same hour-1 Bl-thruout the wee, for the use of various educational\nand civic organizations in this area. Consequently, all of us profit or suffer by\nthe publicity of any of us.\nwe have contended with our faculty that one Justification of local stations is\nthe personal acquaintance or knowledge of the speaker held by .any of the listeners.\nAny publicity value acruing to the college must cone fro. the high quality of the\nprograms using faculty members personally known to many of the listeners. And so we\nhave been very anxious that the voices of our people seem as natural as possible.\nAny one at all familiar with broadcasting knows that to accomplish this result en¬\ntails auditions. There we were up against two stone walls: faculty members accus¬\ntomed to speaking all the while had no misgivings as to their ability to speak in\npublic and the radio station people scoffed at the idea. But when wives at home did\nnot recognize the voices of their own husbands, faculty members were gradually won\nover, in consequence of our insistence upon auditions, we learned indirectly that\neven men at the station were convinced of their worth to the point that some of their\nemployees had auditions. But the station authorities still maintained an attitude\nof indifference whijh discouraged our people when they went in for rehearsals. How¬\never, we still urge auditions for anyone who has not had previous experience. The\npoint I am trying to emphanize is this; after the station has fulfilled its oblige-\ntion by granting us time, they do not care at all whether or not our pr g\nsuccessful. Their duty is done, their fifteen to thirty minutes credited, and they\narc anxious that it entail a minium of annoyance to them.\nAs a teacher-training institution, we have interest in the possibilities of\nbroadcasting for the schools of our area. Knowing something of the history of such\nexperiments and of the general skepticism of the possibilities in that field, far be\nit from me to undertake such an experiment without a far more wholehearted support\nthan educational broadcasting new, enjoys on the part of our faculty and local stations"
}