{
  "id": "d1354-0",
  "text": "■\nN\nA\nE\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. 29, NO. 9 SEPTEMBER, 1964\nFellows Named to New Post\nJames A. Fellows has been appointed to the newly created\npost of assistant to the NAEB president, where he will serve\nas liaison between the president’s office and the expanding\nnumber of projects under NAEB supervision. He will also\nserve on special assignments for the president, such as the\nECS project mentioned elsewhere in this Newsletter.\nFellows has been serving as associate director of the\nOffice of Research and Development since he joined the\nNAEB staff in 1962. Prior to that he was executive secre¬\ntary of the Empire State FM School of the Air.\nTV Division Provides\nSample Grant Applications\nPotential grant applicants under the ETV Facilities Act may\nobtain sample applications from the NAEB TV Division,\ncalled “Educational Television Stations,” in Washington.\nThere are two types of sample applications—one for activation\nof a new station, and one for an expansion grant for an\nexisting station.\nThe new station application is based on a mythical state\nuniversity, but should be of equal assistance to other types\nof qualified applicants. The expansion application is based on\na mythical nonprofit community corporation.\nSample applications are available on loan to all interested\nparties and may be obtained by writing to Educational Tele¬\nvision Stations, NAEB, 1346 Connecticut Avenue, N.W.,\nWashington, D.C., 20036. The ETV program staff in the\nOffice of Education has cooperated to make this service pos¬\nsible.\nMusic Conference Highlights Revealed\nNER music personnel attending the conference at the Uni¬\nversity of Minnesota September 30 and October 1 will hear\na talk by Maestro Stanis'law Skrowaczewski of the Minne¬\napolis Symphony Orchestra; they will meet with Lynn Tilley\naf the 3M company to discuss the latest developments in\nmagnetic tape recording; and they will attend a performance\nof Henry V at the Tyrone Guthrie Theater.\nIn announcing these highlights of the third annual music\npersonnel meeting, Harry Welliver, conference chairman and\nmusic director of WUOM, University of Michigan, said that\nregistration materials and program details will be mailed the\nfirst week in September. Any NER member not receiving a\ncopy should write to Russell Walsh, Music Director, KUOM,\nUniversity of Minnesota, Minneapolis.\nWalsh is in charge of local arrangements for the con¬\nference, which will be hosted by Burton Paulu, director of\nradio-TV broadcasting at the University of Minnesota. As¬\nsisting in program arrangements are Welliver and Ann Burns,\nWBAA, Purdue.\nNER Sets Up Washington Offices\nThe NAEB Radio Division—reorganized as “National Educa¬\ntional Radio” earlier this year—opened its divisional offices\nwithin the NAEB in Washington, D.C., September 1.\nJerrold Sandler heads the operation as executive director,\nassisted by John P. Witherspoon as associate director.\nSandler has been working in the NAEB offices for six\nmonths, as director of the Educational Communications Sys¬\ntem project, administered under a grant from the U. S. Of¬\nfice of Education. A veteran of twenty years in educational\nbroadcasting, film, and theater, he left the production man¬\nagership of WUOM, University of Michigan, to join the\nNAEB staff in March. James A. Fellows, assistant to the\nNAEB president, has assumed the ECS duties.\nWitherspoon comes to the NER post from San Diego\nState College, where he was program director of KEBS and\nassociate professor of speech.\nPrograms and Records Available\n• Songs, slogans, and major issues of ten presidential races\nhave been put together in a series of five-minute programs by\nNew York University’s department of TV, motion pictures,\nand radio. Radio stations may use the series, which costs $20\npostpaid, with no fees or license charges. Write for “Cam¬\npaign!” information: Prof. Irving Falk, New York Univer¬\nsity, Washington Square, New York, New York, 10003.\n• “The Studio Teacher,” a 47-minute kinescope showing and\nexplaining equipment and techniques used in an ITV pres¬\nentation, is available through the Great Plains TV Library,\nLincoln, Nebraska. Prints are $5 plus return postage on a\none-week loan or $68.50 postpaid for purchase.\n• San Diego State College announces a record album of in¬\nterpretive choral readings by the college’s Verse Choir. For\ninfonnation on “Sounds to Remember,” write Thomas Mack-\nlin, Aztec Shops, Ltd., San Diego State College, San Diego\n15, California.\n• “Milestones of the Century” films may be used by ETV\nstations for unlimited telecast over a three-year period for\n$15 per film. The films range from the Theodore Roosevelt\nera to the present. Write John C. Smith, Sales Manager,\nPathe News Inc., 245 W. 55th St., New York 19.\n51 Exhibit Booths Taken\nAs we go to press, 51 of the possible 60 booths available for\nindustrial exhibits at the NAEB national convention have\nbeen sold. The exhibits will be in Austin’s $3 million Munici¬\npal Auditorium, where most of the convention sessions will\nmeet. More information about the Auditorium and other con¬\nvention matters is in the special “Convention Supplement” in\nthis Newsletter.\n1"
}