{
  "id": "d1354-3",
  "text": "Hotels and Auditorium\nMost sessions will be in the Auditorium, for which free\ntransportation will be provided by the NAEB to and from\nhotels. Buses will leave the hotels every ten minutes prior\nto sessions in the Auditorium, and they will leave the Audi¬\ntorium for the hotels at ten-minute intervals after sessions.\nThe Commodore Perry will be the official headquarters\nhotel, including convention registration on Sunday, October\n25. After that, registration will be at the Auditorium.\nAll three hotels are downtown, within a block of each\nother. The Driskill is Victorian or traditional in decor; the\nStephen F. Austin is Western or Texas in style; and the\nCommodore Perry is contemporary—a convention-type hotel.\nEach hotel will have a convention information center oper¬\nating throughout the convention.\nGroups Schedule Monday Night Meetings\nInternational Relations Committee—8:00 p.m.\nBurton Paulu, chairman.\nNAEB Institutional Affiliates—8:30 p.m.\nJames K. Petersen, director.\nRegion IV radio stations—8:30 p.m.\nMartin Busch, director.\nRegion V—8:30 p.m.\nBarton Griffith, director, Instructional Division.\nResolutions Committee—8:30 p.m.\nHarry J. Skornia, chairman.\nProfessional Development Committee—8:00 p.m.\n(Also Wednesday at 10:30 a.m.)\nVernon Bronson, chairman.\nAbout Austin\nAustin—state capital and home of the University of Texas—\nhas a population of about 200,000. It is located near the scenic\nhill country of central Texas.\nAmong points of special interest are:\n• Capitol. This massive pink granite building covers 18\nacres of floor space and is largest of the state capitals of\nthe United States. The Capitol is downtown, within a few\nblocks of the NAEB convention hotels.\n• University of Texas. Well over 20,000 students will be\nattending classes here during the NAEB convention. From\nthe 307-foot Tower of the Main Building, visitors may view\nthe city and surrounding countryside. The observation deck\nis open from 8 a.m. to 5 p.m. daily and 1 p.m. to 5 p.m. on\nSundays. On the'outside of the building are the complete al¬\nphabets of the Egyptians, Phoenicians, Hebrews, Greeks, and\nRomans.\n• Municipal Auditorium and Convention Center. This new\n3-mi'llion-dollar building, with a multi-colored aluminum dome,\nwill house most of the NAEB convention meetings.\n• Lake Austin. Only ten minutes from downtown Austin,\nthis is the first of a chain of six man-made lakes on the Colo¬\nrado River. The other five nearby lakes spread into the hill\ncountry.\n• Stately “Old South” homes, such as the Governor’s Man¬\nsion, built in 1856.\n• Restaurants specializing in Mexican and Southern foods.\n• Museums such as the O. Henry Home, Laguna Gloria Art\nMuseum, Elisabet Ney Museum, Texas Memorial Museum.\nEDUCATIONAL RADIO AND TELEVISION\nEducational radio-TV at the University of Texas includes\nRadio/Television (including KUT-FM) for the university,\nand services to the Texas Educational Microwave Project\nand KLRN-TV.\nThe three-year-old Radio/Television building includes two\nTV studios, one motion picture studio, and three radio studios.\nTV facilities at the university include two fully equipped TV\nstudios, one 30' x 50' and the other 60' x 60'; three Ampex\n1000C videotape recorders; three RCA Image Orthicon TV\ncameras; two Marconi WC’ Image Orthicon cameras, two\nVidicon film chains, a multi-channel campus closed-circuit\nnetwork, an electronic editor, and associated lighting and\nsound equipment.\nRadio/Television has a new 16mm motion picture unit to\nproduce educational, documentary, and informational films. It\noperates in a 33' x 42' sound stage with such photographic\nequipment as Arriflex, Auricon 1200s, and Cinevoices. Sound\nfacilities include Magnasync and Stancil-Hoffman dubbers\nand recorders, and a complete interlock and mixing studio.\nEditorial equipment includes a Moviola and related equipment.\nKUT-FM has faculty administration and student operation.\nThe station broadcasts 56 hours a week, from 3 p.m. to 11\np.m. daily, covering a 50-mile radius. Programing is primar¬\nily music, with some news and “talks” programs.\nKLRN, Southwest Texas ETV Council station broad¬\ncasting in Austin and San Antonio, has its operationall office\nin the Radio/Television building. The transmitter and tower\nare located on a hill exactly halfway between Austin and\nSan Antonio. Potential audience for KLRN is over 1,250,000,\nincluding nearly 400,000 school pupils.\nTEMP, fully described in the May-June 1963 NAEB\nJournal, offers videotaped courses to participating colleges,\nand universities in central Texas.\nAirlines\nBraniff and Trans Texas operate flights from Dallas to Aus¬\ntin. Trans Texas has mailed its schedules direct to NAEB\nmembers. Enclosed with this Newsletter is a reservation\nsheet from Braniff.\nThere is no jet service into Austin, just to Dallas or San\nAntonio. Dallas is about 200 miles from Austin, San Antonio\nabout 70 miles.\nNAEBers Can Go to Mexico\nAfter the convention, NAEBers can spend a week in Mexico\non a specially priced tour. Plans include a party in Mexico\nCity at which NAEBers can meet and talk with Mexican\nbroadcasters and educators.\nBrochures describing the trip in detail have been mailed\nto NAEB members.\nABSENTEE VOTING\nThose planning to take the junket to Mexico October 30 to\nNovember 5 will need to check absentee voting regulations in\ntheir respective states. In most states, voters will be able to\ncomplete their ballots before leaving for Austin.\nBarbecues and Banquets\nCarl T. Rowan, director of the U. S. Information Agency,\nwill speak at the closing banquet of the convention, Wednes¬\nday, October 28, at the Commodore Perry Hotel. Banquet\nprice—$6.50.\n• On Tuesday evening, there will be a barbecue catered by\nWalter Jetton, Inc., “kingpin of the barbecue men” and\ncaterer to the nation, from Fort Worth. After the beer and\nbarbecue there will be a satirical revue followed by dancing\nto a live combo. Price for the Texas-style evening at the\nAuditorium—$4.50.\nProfessional Football at Houston\nSome NAEBers on their way to Austin to the convention may\nwant to stop in Houston to see the Houston Oilers play the\nSan Diego Chargers. Game time is 1:35 p.m. Sunday, October\n25. Houston is about 160 miles from Austin."
}