{
  "id": "d1354-4",
  "text": "^ Lawrence W. Lichty has resigned from the speech faculty\nat California State College to become assistant professor of\nspeech at the University of Wisconsin.\n^ David T. French has received the first T&L Productions\nFoundation Fellowship in Communications Arts, as announced\nby the radio-TV department of the Newhouse Communica¬\ntions Center at Syracuse University. The $3,000 award is\npresented to an outstanding student for specialization in TV\nprograming, and was established by TV producer Sheldon\nLeonard and comedian Danny Thomas, co-owners of T&L\nProductions.\n^ John Kiermaier has been elected president of the Educa¬\ntional Broadcasting Corporation, which operates WNDT,\nNew York City. He succeeds Samuel Gould, who resigned to\nbecome president of the State University of New York. Kier¬\nmaier will leave his post as vice president of the public af¬\nfairs department of CBS News on September 15. He has been\nwith CBS five years and prior to that spent nine years with\nNBC.\nGENERAL\n^ The University of Oregon has established a new Division\nof Broadcast Services and Televised Instruction to provide\nfacilities for radio and TV programs from the campus to\nreach stations in the state, and to be responsible for closed-\ncircuit instruction on the campus. Staffers of the new division\nare: John R. Shepherd, director; Arthur Jacobs and Dale\nWile, producer-directors; E. A. Kretsinger, chief engineer;\nRobert Adams, studio technician; and Frank Murphy, engi¬\nneer. Plans call for a new building designed specifically for\nthe division, although it is currently operating out of the TV\nand radio studios.\n^ Marquette University’s radio-TV service has acquired an\nAmpex VR 1002 equipped for dual-speed operation.\n^ Preparations are under way for official establishment of\nthe new School of Communication at the University of Texas.\nDuring the 1964-65 academic year DeWitt C. Reddick, di¬\nrector of the School of Journalism, is serving as director of\nboth schools. Thereafter he will be director of the new School\nof Communication, in which journalism will become a depart¬\nment with a new chairman. The new school will bring to¬\ngether in one administrative unit instructional programs in\njournalism, radio-TV and speech, all now in the College of\nArts and Sciences. The school will also have a bureau of\ncommunication research and radio-TV-film production unit.\n^ WMHT, Channel 17, Schenectady, has begun publishing a\n24-page monthly program guide, “Scene on Seventeen.” In\naddition to program information, the guide will contain sports\ninformation, a column of “Letters to the Editor,” advice on\nhow to receive the channel, photographs, and feature articles.\n^ The Illinois State Fair this year contains a special display\nabout ETV.\n^ “Television in Today's World” is a three-credit graduate\ncourse being offered this fall to Chicago-area teachers, to in¬\nform them on how TV can be used to enrich classroom teach¬\ning. Chicago’s commercial and educational TV stations are\ncooperating with Chicago Teachers College-North on the\nproject.\n^ The Fordham University communication arts department\nrecently cited three educational radio and TV projects for\n“significant creative use of the new media in the service of\neducation.” They are: Radio-televisione Italiana for its Teles-\ncuola project which uses TV to combat illiteracy and the lack\nof secondary schools in Italy; the Peace Corps for its ETV\nproject in Colombia; and Radio Sutatenza, which for many\nyears has used radio to serve community needs in Colombia.\n^ Under a $37,225 grant from HEW and the Indiana board\nof health, John P. Sheehan, associate professor of radio and\nNAEB Headquarters: Suite 1119, 1346 Connecticut Avenue,\nN.W., Washington, D.C., 20036. Phone 667-6000. Area Code 202.\nTV at Indiana University, is studying how TV can be used\nto reduce the rising incidence of syphilis.\n^ WDET, Wayne State University, has begun an internation¬\nal service through which it will exchange cultural programs\nwith other countries. “Music from Spain” was the first such\nprogram carried by WDET. In return, WDET sent to Spain\na 13-program series called American Concerts.\n^ In response to viewer requests during a recent survey,\nKWSC-TV, Washington State University, will try to go on\nthe air on Sundays this fall.\n^ WTTW, Chicago, has joined the program exchange serv¬\nice of the Eastern Educational Network. WTTW and KQED,\nSan Francisco, are the only non-regional stations affiliated\nwith EEN, which consists of eleven stations in the area from\nMaine to Washington, D.C., and west to the Ohio border.\n^ For economy reasons, WTTW has eliminated three series\nfrom its local live TV schedule, temporarily interrupted Sun¬\nday telecasts, and laid off production staff. John W. Taylor,\nexecutive director, said the measures were necessary because\nof delays in receiving commitments on national production\ncontracts.\n^ The American Council on Education has launched a study\nof what students learn in colleges about the motion picture as\na contemporary art form. David C. Stewart, former execu¬\ntive secretary of JCEB, has been appointed consultant to .\nconduct the project.\n^ A committee has been formed at the University of Wis¬\nconsin to study and formulate a general policy on compensa¬\ntion, rights and privileges of faculty members participating in\nTV instruction.\n^ In conjunction with the wildlife management department at\nthe University of Wisconsin, Rudy Wolff, WHA technician,\nis building miniature radio transmitters which are attached\nto collars placed on wild foxes. Research workers then fol¬\nlow movements of the foxes in their normal habitat, using re¬\nceivers which Wolff has adapted for the purpose.\n^ David Susskind will be at the Joseph Horne Co., Pitts¬\nburgh, September 8 to conduct an Open End type show dis¬\ncussing “What Do the New Fashions Reveal—Socially, Eco¬\nnomically, Politically?” His guests will be the designer of the\ntopless bathing suit, the designer of the dress with the “see\nthrough” top, and several models. His Open End television\nprogram is seen in Pittsburgh over WQED.\n^ The FCC has approved an increase in power for WOUB-\nTV, Ohio University, from 14,000 to 197,000 watts.\nKCET, Los Angeles, is slated to begin broadcasting Sep¬\ntember 28 with 1,200,000 watts ERP. Expectations are that\nthe staff, now 25, will number 40 by then.\n^ A recent NAFBRAT survey shows that TV crime has\nrisen 20% since 1958. Monitoring the seven TV stations in\nLos Angeles during a week in June, NAFBRAT members\nreported 501 killings.\n^ Northern California’s new ETV station, KIXE, Redding,\nstarts operation in September, and during its first year will\nrepeat via microwave the complete programing of KVIE,\nSacramento.\nINSTRUCTION\n^ This fall the ETV stations in Pittsburgh and Philadelphia\nare broadcasting a 90-program series, Electronics at Work,\nwhich was prepared at the South Carolina ETV Center and\npurchased through a grant from the Pennsylvania public in¬\nstruction department. The series will assist industrial arts\nteachers and will expose pupils to equipment and situations\nwhich cannot be acquired by each school due to cost.\n^ KVIE, Sacramento, is entering its second year of broad¬\ncasting a seven-lesson series on communism to the area’s 12th-\ngraders. Each week’s lesson is broadcast ten times to over¬\ncome classroom scheduling difficulties. Last year some 40\nclassrooms used the series effectively. During the latter part\nof this year the two-year experiment will be evaluated.\n^ KVIE begins the 1964-65 school year with over 240,000\nSEPTEMBER 1964\n3"
}