{
  "id": "d1569-3",
  "text": "NAE3 NEW3 LETTER,\nMaroh 1, 1943\n• •.•Page 4\nIn behalf of the WNAD staff, Mies Hawk stated, **We consider it an import¬\nant effort at WNAD to build a farm program for farm people in Oklahoma*\nThrough a service of news and information to farmers we hope to reach a\nwider listening audience for WNAD, Oklahoma’s educational station.11\nivrs tears of radio\nBy Willlam &V Jdhnson, Superintendent of Schools, of Chicago:\nJust five years ago this ’ eek6 the Radio Council put its first broadcast on\nthe air. Since then it has done an average of four hundred urograms every\nyear.••.programs planned, written and produced for classroom use*\nNow we are living in war-times. Our entire educational system is geared to\nthe war effort• Not only is this true in the high schools but in the ele¬\nmentary schools as welle Our educational picture has changed* j&treas upon\nsubject matter has been changed* No longer is it sufficient to teach the\nhistory of yesterday, we must train the youngsters to live in the world of\ntomorrow*\nAviation, mathematics, languages, geography and social scienoes, these\nsubjects are important now and will be more important a3 our elementary\nyoungsters grow\" into high school and then into maturity. For these are the\nfoundation upon which our elementary students will base their lives, and\nin basing their lives on this foundation do they not become the very basis\nof our city, state and nation!\nThe new radio urogram of this semester, the WORLD OF WINGS series; the\nNUMBERS AT WORK nr©grams; the THOUSAND MILLION social scienoe and geography\nseries; the LANGUAGES IN ACTION programs have been planned, written and wi3L\nbe produoed witSh but one purpose in mind-..to supplement the work of the\nteacher in the subject mentioned above*\nCHICAGO RADIO SPRING PROGRAMS ANNOUNCED.\nAviation, its history, the science which makes it possible, its increasing\neffect on the world, and the story of its first inventors and fliers, will\nbe told in three broadcast series for use in the classrooms of the Chioago\nPublic Schools via station WIND during the February-June semester. George\nJennings, Acting Director of the Radio Council, Board of Education school\nbroadcast department, announced &hat the new aviation series when it\nstarted on February 17*\n»WORLD OF WINGS1* is the title of all three aeries. “New Worlds for Old,**\nthe history of transportation and communication, will be broadcast Wednesday\nstation WIND, 1:30*1:45 p*ra*, for the students of the middle elementary\ngrades. On Thursdays, same time and station, ^Contact**, the scientific side\nof of aviation, will be broadcast* \"Desfcinatiofi Unlimited,** the story of\nthe aviation’s inventors and fliers, will be broadcast on Fridays through¬\nout the semester, also at 1:30*1:45 p.m., on station WIND*\nSchools will reodive pictures, flight maps, north pole projection maps@\ntransport olane menus, the informational material from all the major air*\nlines'and from all U* 8. Air Corps and government agencies. These are to\nbe displayed during the i-adio broadcasts and studied later."
}