{
  "id": "d1115-0",
  "text": "Washington Report\nThe National Association of Educational Broadcasters\nVol. I No. 2 Dupont Circle Bldg., Washington 6, D. C. November, i960\nFCC vs. FAA\nTwo government agencies with large responsibilities in the public interest are\ngetting into a stand-off jurisdictional dispute. The Federal Aviation Agency last\nmonth proposed to regulate height and site of broadcasting towers. FCC promptly\nresponded that (l) it is charged by law with responsibility for determining whether\na radio or TV license is granted and (2) where it is alleged that a tower may be a\nhazard, the Commission has always held hearings in order to make a qualified judg¬\nment. Though views of FAA must be considered, the FCC cannot, it insists, under\nexisting statute, avoid making decision nor delegate responsibility.\nPrivately, Commissioners feel that, since both are Federal agencies with over¬\nlapping jurisdiction, legislation must be passed to spell out precise responsibility\nof each.\nALL-CHANNEL RECEIVERS\nAll seven Commissioners are reported to favor legislation which would require\nTV receivers shipped in inter-state commerce to be all-band equipped. Such a re¬\nquirement it is claimed would alleviate situation of UHF stations in VHF dominated\nareas and encourage activation of IMF channels which lie idle because it is feared\nfew viewers would trouble to convert existing sets to receive UHF. Education, which\nhas nearly 2/3 of its reserved allocations in UHF, would stand to benefit by such\nlegislation.\nSimilar legislation introduced last session was opposed by Commerce Dept, and\nElectronic Industries Assoc. Their position: such mandatory manufacturing require¬\nment would interfere with free enterprise and force public to pay higher prices for\nsets even in areas where no UHF is available. Set makers say it costs $15-$25 more\nto make all-band receivers; some engineers insist that completely redesigned sets\nincorporating all channels could be made for price of present sets.\nFCC will push for this legislation in the next session of Congress.\nAPPLICATIONS\nPublic schools of Newark, Ohio, have asked that Channel 28, Lancaster, Ohio,\nbe substituted for Newark's Channel 60 assignment. If change is made, the school\nsystem will apply for a UHF translator to rebroadcast programs of Ohio State U.\nstation WOSU-TV.\nSPECTRUM SURVEY\nMr. Oscar Reed, Jr., head of the Allocations Dept, of Jansky & Bailey, Washing¬\nton, has been named to head up the engineering aspects of study NAEB has undertaken\nto determine the needs of education for television spectrum space and to translate\nthese requirements into overall allocations plan which will serve as basis for devel¬\nopment of a national educational television system. First phase of study will bring\ntogether all existing data on present and planned ETV installations across the nation.\nReed met with some 15 ETV managers at San Francisco to brief them on project.\nBORDER ALERT\nFCC is considering changes in international agreements to permit VHF drop-ins\nalong Canadian and Mexican borders. Proposed Canadian agreement, for example, would\nprovide possibility of additional V's in Rochester, Syracuse, Bangor, etc."
}