{
  "id": "d333-21",
  "text": ".W .\nVOLUME 1 NOVEMBER, 1963 NUMBER 2\nNAEB CONVENTION IN MILWAUKEE A SUCCESS!\nOver 5£6 people attended the annual conven¬\ntion of the National Association of Educa¬\ntional Broadcasters held in Milwaukee, Wis¬\nconsin. Conventioners heard about the re¬\norganization plan of the NAEB. Next year's\nconvention is planned for Dal 1 as, Texas.\nKSLH OFFERS PROGRAMS ON GUIDANCE\nStation KSLH, St. Louis Board of Education\nFM Station, is presenting many programs in\nthe area of guidance. Mr. Achiever, for\nexample, is designed to promote good study\nhabits and better school achievement. It is\ndirected primarily to a culturally, disadvan-*\ntaged district within the St. Louis Public\nSchool system. The programs are planned and\nperformed by people within that district.\nMr. Achiever is a mythical character who gives\nsuggestions and hints on how pupils can succeed\nin school. The progress and academic achieve¬\nment in the area has been outstanding. A few\ntitles of the programs are: “Developing Good\nStudy Habits,\" \"Getting Along With Others,\"\n\"It Pays To Stay In School,\" etc. Another\nseries entitled Know Yourself is designed to\nhelp 7th and 8th grade boys and girls under¬\nstand and talk about their own emotional reac¬\ntions. Students listen to a dramatization of\na life-like situation and then hear a panel of\nteenagers discuss it. It is hoped that from\nsuch discussions, junior high pupils can learn\nmore about themselves. An example of a program\ntitle is \"The Effects of Worry.\"\nVIP MAILING LIST\nThis idea canes from Betty Girling, Director\nof Minnesota School of the Air. Any NAEB\nInschool Broadcasters who have materials they\nwould like circulated, should send their name\nwith a list of materials available to the\neditor of INSCHOOL BROADCASTER. We will then\ncompile the list and offer in next month's\nedition materials available and station names.\nWBGO, NEWARK,HAS NEW SERIES\nWBGO, Newark, New Jersey, has two new\nseries in the works. The first Tale and\nTune for grades 4 and 6 accenting the\nrelationship between certain books and\nmusic. Examples \"Alice in Wonderland\"\nand Deems Taylor's \"Thhough the Looking\nGlass.\" \"Huckleberry Finn\" and Grofe's\n\"Mississippi Suite.\" The second series\nis Rhythm and Rhyme, which is poetry for\ngrades 4 and &\"* On this program only\npoems requested by listening children are\nread. If it is possible, the child is\nidentified along with the teacher and\nschool. In this way, WBGO draws \"flocks\nof very stimulating fan mail.\"\nTAPE RECORD RADIO PROGRAMS\nWBEZ, Chicago, recommends when broadcast\ntimes are not convenient, a tape recording\ncan be made when a program is being heard\nby a class, or \"silently\" while other\nclass activities are under way. WFBE,\nFlint, Michigan, has a sheet, compiled by\nChief Engineer Edward A. Rauch,which tells\nin simple terms how to make a tape record¬\ning from a broadcast. If any other\nInschool Broadcasters are interested,\nplease write to WFBE-FM, Oak Grove Campus,\nFlint, Michigan, 48503* We will be happy\nto mail one out to you.\nPROGRAMMING IDEAS\nThis list comes from Betty Girling,\nMinnesota School of the Air, offering a\nfew areas that we might be thinking of\nfor future programming. Drop-Out Problem:\nThe time to tackle this problem is when\nthe attitudes leading to it are being\nformed. Suggested grades 4, 5# and 6.\nAttitude Education: A positive approach\nto ALL MINORITY PROBLEMS, long,overdue\nin social studies. Mental Health: One of\nour major health problems, yet substantial\n(OVER)"
}