{
  "id": "d333-24",
  "text": ".9fuckooi_ .\nVOL. 1 OCTOBER, 1963_NO. 1\nNEW HEALTH SERIES AT WHA\nThe Wisconsin School of the Air will present\na new health series on radio in January* 1964*\nFor a long time they have been searching for\nthe \"just-rightu person to put over the idea\nof the importance of a healthy body and mind.\nThe \"just-right11 person is Or, H. Kent Tenney*,\nEmeritus Professor of Pediatrics in theUnivep*\nsity School of Medicine. His relaxed* informal\nmanner has particular appeal for the boys and\ngirls. He visits with them about health in\nterms of their own interests and experiences®\nHe points the way to good health practices*\nborn of understanding and regard for the won¬\nderful workings of the human body.\nHOMEROOM 0 64\nA new concept for junior high programming is\nbeing tried by the Flint Public Schools and\nWFBE-FM this year® At 8s30 a®m. (when all\neight junior highs start their homeroom period)\nHOMEROOM !64 takes to the airs for five minutes\nmusic is played with only one interruption re¬\nminding the teacher \"Homeroom 064 starts in two\nminutes and thirty seconds? at 8s35s news of the\nworld* nation and local area is presented® All\nstudents have' notebook size maps available with\nreference points of letters and numerals along\nthe edges. By calling attention to a specific\nmap* then referring to the specific spot in the\nnews* each pupil can identify the news locale.\nInterviews with such persons* as Amy Vanderbilt\nand William L. Shirer (who have appeared in\nFlint at lectures*) are used along with guidance\nfeatures* reports of school activities* sports*\nand open-ended features. At this early date*\nHOMEROOM *64 has been well received by teachers\nand students in all of the Flint Public junior\nhigh schools.\nTAPES AVAILABLE\nThe National Aeronautics and Space Administra¬\ntion has tapes available to all educational\nradio stations. These are programs concerning\nthe developments in space science® There are\ninterviews with leading space scientists* the\nsounds of missiles, possible inserts for local\nnews stories and programs available in their\nentirety. The address for these tapes iss NASA*\nCode AFEA-1* Washington* D.C. 20546®\nLOTS OF MUSIC\nFESTIVAL OF SONG* a series produced by the Uni¬\nversity of Michigan* Station WUOM* is in the\n14th year of production. Over 25 stations in\nMichigan, both educational and commercial* carry\nthe program. An estimated audience of over\n250*000 school children listen to the program®\nCIVIC SERIES AT WETL\nThis year WETL* the FM radio service of\nSouth Bend Community School Corporation\nbegan broadcasting a new series of pro¬\ngrams entitled \"Close-up South Bend.\" This\nseries of 15 fifteen-minute programs was\ndesigned for use in the sixth grade unit of\nsocial studies $ SOUTH BEND AND ITS RELATION\nTO THE WORLD, This unit presents the city\nwithin its national and world setting. It\nstresses interdependence* but is also con¬\ncerned with civic government* industrial\nactivities* and local history. The series\nfeatures statements and/or interviews with\ngovernmental and industrial leaders. They\nare asked to explain the purpose of their\ndepartment’ or agency or to tell how their\nfirm is dependent on others for raw mater¬\nials* etc. and why their company is located\nin South Bend. Historical incidents are\ndramatized.\nHIGH SCHOOLS ARE OUT?\nMany stations have despaired of ever build¬\ning a high school audience* and devote al¬\nmost all of their broadcast day to grades\nK-9o High school series are being made\navailable on tape and teachers are asked to\nuse them in this form. Is this a policy\namong the other inschool broadcasters? Or\nis it impossible to schedule programs at\ntimes when high schools can receive them by\nradio and tape them themselves? We would\nlike to hear from other school stations as\nto their feeling toward this problem.\nWBGO* NEWARK* PROMOTES UTILIZATION\nIn order to promote utilization in elemen¬\ntary and junior high schools* members of\nthe WBGO staff for the past two years have\nbeen visiting all schools at the beginning\nof each year to talk individually with prin¬\ncipals and key teachers. In each school at\nleast'one teacher on every grade level or\nsubject area is visited and advised on all\nseries appropriate to .her classes. That\nteacher is then asked to contact the others.\nStaff members feel this two-way ccmmunica¬\ntion has been very fruitful--especial 1y to\nthe WBGO staffi\nGUIDEBOOKS AVAILABLE\nElizabeth Marshall* Assistant Director of\nRadio-TV* WBEZ-FM* Chicago* Illinois* tells\nus that this semester 37 guidebooks have\nbeen prepared for the various series used in\ntheir city. NAEB members who are interested\nmay send for W8EZ guidebooks®\n(MORE)"
}