{
  "id": "d333-4",
  "text": "WTDS\nJRadio ^VoLce of the Toledo (Public Schools\n91.3-FM\n(Radio-TV Education (Department . . /90/ (West Central, Toledo 6, Ohio . . Qreenwood 9\\5373\nHARRY D. LAMB\nDOROTHY KELLOGG\nMILDRED COWELL\nDOROTHY MATHENY\nFebruary 7> 1961\nMr. William G. Harley\nPresident, NAEB\nSuite 1119\n1346 Connecticut Ave., N.W.\nWashington 6, D. C.\nDear Bill:\nI should like to accept the chairmanship of the Radio Network School Committee,\nbut before I do I think we should review the function of the committee, its\nmethod of operation, and decide whether it is the best possible means of\nserving the needs of the membership. I raised the question last year with\nKay Lardie (copies of correspondence enclosed - Kay's letter of March 18,\ni960, and mine of March 23). I'd like to carry it a bit further:\n1. Our present method of supplementing local in-school programming is\ntoo happenstance. We have no assurance that anything will be offered.\nWe are entirely dependent on chance for the subject matter, grade\n(or audience) level, method of development, authority and accuracy\nof information, and production competence.\n2. The circumstances under which we operate when judging submissions\nare not objective, but highly subjective; perhaps inescapably so\nwhen the judges hear but two programs in a series and must rely on\nthem, the handbook, and the presumed authority for content and\npresumed competence to produce a series with the same quality as\nthe samples. It is almost impossible to be objective about series\ncoming from a station whose other offerings have been either excep¬\ntionally good or exceptionally bad.\n3. Submissions of in-school programming might be solicited from\ncolleges and universities as Kay Lardie suggested last year (her\nletter of March 18, i960). Certainly there is competency in many\nof them, but a competency that seems in some instances only to\nhave flowered when a grant-in-aid was given. But it is undeniable\ncompetency both in script and production and I can see no reason\nwhy we shouldn't ask them to originate in-school series as a public\nand school network service.\nTherefore, I suggest that the function of the Radio Network School Committee\nshould be to ascertain the needs of the member stations in terms of educational\nseries and then to solicit script and production services from competent"
}