{
  "id": "d333-6",
  "text": "COPY\nCOPY\nSUBJECT: NAEB Radio Network School Carnmittee\nFROM : Kathleen N. Lardie, Chairman\nTO : All Committee Members\nDATE: : March 18, i960\nI presume that all of you have at hand the letter from Bob Underwood dated March 15\nregarding our committee*s responsibilities for next year.\nWe realize that our task is a most difficult one because as I see it, it is impossible\nfor us to have any meetings together — that is, meetings financed by NAEB.\nTherefore, I hope you will plan to be at the Columbus meeting, May 3> and in preparation\nfor this meeting, may I suggest the following:\n1. Will you again list the criteria we should hold to for all programs to be accepted\nfor distribution by NAEB. .When X receive your list, I will consolidate them and send\nyou a rough draft for your approval. X think we should publish this criteria in the\nNewsletter.\n2. Will you send any suggestions you have for encouraging people to submit programs for\nthe network? You recall that last year a suggestion was made that each station in\nthe nation be given a gma.li grant and asked to use this for the production of a program\nfor the network. Bab tells us our offerings this year are nil and maybe we can implement\nthe notice that he is sending out regarding contributions.\n3. If and when programs are sent to us to preview, would you be willing to try the programs\nout on some school group in your area so that we might have a very definite reaction\nfrom the contemplated audience before we decide upon the merits of the series.\n4. What would you think of asking Bob to let us review programs that are submitted for\ncolleges and universities? It might well be that many of these might be suitable for\nthe in-school offerings. You recall that we mentioned to the Convention last year that\nit might be possible some of the in-school offerings could be of interest to university\nand college groups.\nI would also appreciate receiving from you any suggestions you might have pertaining to our\nday*s meeting. V What matters are of first importance? How should we proceed? I am a little\ndiscouraged at this point, but let*s try to carry through at least until after our main\nmeeting to see if we can come up with something that will be helpful to NAEB.\nI am enclosing a copy of the letter I am sending Bob. Do give me your reaction.\nKNL:cnb /s/ Kay"
}