{
  "id": "d1767-1",
  "text": "WHO'S WHO ON THE STAFF\nStill with us are our four main-stays, Doc Skornia, Bob Lee,\nGeorge Johnson, and Fred Gerber on the top level.\nThen in the lower income brackets, Fred Brewer, Eloise Sipes,\nand Jim Ratcliffe still manage to keep eating.\nNew blood in the family include, John R. Mickey, graduate of\nEmporia State Teacher's College, Production Director for the.Kansas\n''Radio Classroom\" for the past two years and 3i years of radio work\non KTSv; in Emporia under his belt. His position here is that of\nAssistant Production Director for the:?School of the Sky.\"\nRuby Anderson comes to us by way of MONO and WIRE where for.the\npast five years she has done publicity and promotion work in addition\nto producing her own shows. Fe expect that Ruby will be a much needed\naddition to the Department in giving the old homestead the kind of\npublicity it has been needing for some time.\nJan Tvroler, ex-Story Lady for the \"School of the Sky\" found.\nworking on the manual so broadening this summer (36\" around the hips)\nthat she has become a permanent member of the.staff this fall as\nResearch Assistant, a job which covers a multitude of sins (such as\ngetting out a Newsletter f'rinstance.)\nDorothea Katzman who took over the \"Children's Corner\" from.Jule\nShaw (who incidentally won an Honorable Mention at this years Ohio\nState Institute for her production of that show) is still with us.\nAlso John Rees is the new student technician working with ever-busy\nRatcliffe. And last but by no means least, the hardest working sec¬\ntion of this Department has two new secretaries; Mrs. June Burger,\ngraduate of Indiana State Teachers College who is taking Eloise's\nplace and Miss Dorla Ford formerly of Central Business College who\nmakes her home in Mr. Johnson's office.\n***********\nSUF ART IMP SCHEDULE\nMany of our programs, like many of our staff members went off the\nair during the summer season, but such long-time favorites as the\n\"Indiana University Roundtable\", \"The Children's Corner\",.and the\nDramatic Workshop carried on, heat or no I Also one of this year's new\ninnovation’s \"The Bobby Soxers of the Air\", continued to make use of\nthe local high-school talent,\nDorothea Katzman, who's been directing \"The Children's Corner\",\nstarted working with a group of youngsters from 7 to 14 years old with\nand eye toward using them on the kid shows instead of we grown-ups\ntrying hard to recapture our lost youth. So every afternoon during\nthe summer the studio was filled with these little people and their\nstage-door mommas. Dorothea thinks we’ll have a very fine crop^of\nfuture Bernhard's and Barrymores ere long. Martha v?alstrum, P.3. ,\nacts as Story Lady on these Saturday shows and does a smooth job.\n* * *\n-2-"
}