{
  "id": "d1767-11",
  "text": "(5) Those concerned directly with program production can get a great\ndeal of valuable information from research done on analytical preferences. It\nis here that much commercial listener research has \"been concentrated. A good\nexample of the technique of obtaining information on analytical preferences has\nbeen published by Coutant.* Some of the results of this research are available\nto the public, many more can be deduced from the programs that are. so popular.\nDetailed research of this type is not needed so urgently in educational radio\nbecause there is no requirement to make educational programs as smoothly un¬\nobjectionable as are the commercial programs. However, it will sometimes be\nfound** that the listener rating of a program depends on a very few features\n(distinguishability of voices, dramatization by speakers, pacing) and that\nconscious control and improvement of these will greatly improve the program.\n(6) The influence of programs on preferences themselves is now\nbeginning to become a subject for research. For example. Miss Jeanette Sayre,\nin studying the listeners and non-listeners to \"America’s Town Meeting of the\nAir\" found one considerable group whose attitude toward the program was changed\nwhen they were induced to listen to one or two broadcasts. This group consisted\nof well-educated, urban residents. It is fairly certain, however, that well-\neducated persons coming from small towns and rural areas would like the program\nin even larger numbers if the coverage were adequate to reach them and if they\ncould be induced by publicity to listen to one or two programs. Such research\ndata should supply useful information to publicity directors interested in\naudience-building.\n(7) Educational radio programs may initiate or stimulate further\neducational activity (discussion, reading, listening to other programs). Since\nmany educational programs have as their primary aim such stimulation, studies\ninvestigating effectiveness of stimulation are badly needed by broadcasters\nwho are also educators. Research studies of this type are now in progress under\nthe direction of the Evaluation of School Broadcasts group of Ohio State\nUniversity.\n(8) The changing of attitudes is a common objective of educational\nbroadcasts. Such changing (or ingraining) can only be estimated by careful\nresearch studies. Work in this area is now being conducted by the Office of\nRadio Research at Columbia University and by the Evaluation of School Broad¬\ncasters Project.\n(9) The influence of educational broadcasts on the thinking of those\nwho listen is probably the most important to all educational aims, and at the\nsame time is the most difficult to measure. Work on this subject is being\ncarried on in connection with a few educational series by the Evaluation of\nSchool Broadcasts group at Ohio State University. If it can be shown that first-\nrate educational programs do have significant effects on the thinking of those\nwho listen to them seriously, the educational broadcaster will have fully\njustified his work. If such research can show what types of programs and what\n* - Coutant, F R, \"Determining the Appeal of Special Features of a Radio\nProgram,\" Journal of Applied Psychology. Yol. XXIII, No. 1, February, 1939.\n** - As in Miss Marjorie Fleiss’ study, \"University of Chicago Round Table,\n1938, on file at Office of Radio Research, at Columbia University.\n-6-"
}