{
  "id": "d1767-3",
  "text": "DOC IN DEUTCHELAND OR INNOCENT ABROAD\nFame comes to I.U. in many ways. President Wells went to Germany\nand was picked up By the Russians (temporarily, that is). On the\nother hand, our own Doc Skornia also has been paying a visit to that\ntroubled land, but he wasn’t picked up. In fact, during the past four\nmonths, he’s been giving a shot in the arm to German radio, will(?k\nunder his guidance, has perked up considerably. Doc left here in June\non a four month War Department assignment which had as its chiex pur¬\npose, the revitalizing and reorganizing of what was left of German\nradio. He made his headquarters at Berlin’s RI.AS, and from there\nbranched out to Munich, Bremen, Frankfurt, Heidelberg, Karlsruhe,\nStuttgart, et al. His first jgb was that of Control Officer—checking\nstories of pro-American newsmen and commentators for psychological\nslanting. But that was only the beginning. After a few months of\ndusting off his German here at home, he was able to lecture on pro¬\nduction techniques to the German producers, work with the script^\nwriters and prepare a manual for their use—’•all this, plus turning\nout some educational programs for them.\nAccording to his letters, he’s also had the opportunity to cache\naway a few good ideas which we may be able to use.here. He says that\nthe German engineers are tops and incidentally, wishes his studen s\nat I.U. were as attentive to his lectures as the Germans are......\nalthough he wrrote ”If you think I’m bad in English, you ought to hear\nme in German!”\nWe’re counting on the air-lift to set the good Doctor down in our\nmidst again on or about the 10th of October—and we'll make him write\nhis own\"copy for the next Newsletter and give you a real blow by blow\ndescription of what’s going on over there.\n***********\nBOB’S NEW BABY\nThe fact that we haven’t gotten our radio station hasn’t dimmed\nthe enthusiasm of our program director, Bob Lee, who is all the time\nhunting for more ambitious projects to undertake. Latest brain-^torm\nis an hour show7 to be presented weekly, using dramatizations of plays,\nnovels, and poems which have become literary classics.\nThe project went beyond the planning stage this summer when Bob\nand company adapted and produced an hour version of ”Hamlet\"---using\nthe stage of the Little Theatre as a studio, with a very complex mike\nset-up and drawing on the best talent still surviving the ordeals of\nsummer session...Bob came up with a very fine show and a good idea of\nwhat can be done with things of this sort.\nvje now7 have a list of 30 or so prospective shows, including ’’The\nDivine Comedy,” ’’Alcestis,” ’’Alice in Wonderland,” and. ’’Cyrano de\nBergerac” and only this week got the promise of an additional source\nof acting, writing, and musical talent from among members of the\nfaculty.\nWe expect to get the series under way in two or three weeks, so\nif you can pick up\" Bloomington on your sets--listen for us--m fact,\ntell N.B.C.’s University Theatre to listen too--they may pick up a\nfew good pointers.\n-5-"
}