{
  "id": "d1767-8",
  "text": "5. Analytical, as shown by liking --or disliking --\nparts of a program (personality types, announcements,\nvoices, pace, music, sound effects, transitions,\nbuild-ups, acting, length of program, etc.)\nII. EFFECTS OE INFLUENCES* May be classified as:\n6. Influences on program preferences. People change\ntheir radio likes and dislikes.\n7. Initiating or stimulating Influences. Eadio may start\ndiscussion, reading, other listening or other action.\n8. Changing or ingraining of beliefs and attitudes.\n9. Changing or ingraining of thinking.\nThere are then four main groups who may use the results of research\nand nine main subdivisions of researches. Chart 1 indicates the thirty-six\npossible references of research to groups. The twenty-eight references marked\nwith an X are discussed in detail in this paper.\nChart I\nTypes of Listener Eesearch and Groups Who May Use Them\nG r o u\nP s .\n\"Broadcasters\"\n\"Teachers\" '\n\"Civic\"\n\"Administrative\"\nI. FEEFEEENCES\n1.\nQuantitative\nX\nX\nX\nX\n2.\nEelative\nX\nX\nX\nX\n3.\nContent\nX\nX\nX\nX\nk.\nProduction\nX\nX\nX\n5.\nAnalytical\nX\nX\nII. EFFECTS\n6.\nOn preferences\nX\nX\nX\n7.\nStimulation\nX\nX\nX\n8.\nOn attitudes\nX\nX\nX\n9.\nOn thinking\nX\nX\n* - Each of these four types of effect may be subdivided according to the magni¬\ntude of the effect. A change in attitude, for example, may be an ’'impression,\"\nan \"influence,\" a \"change,\" or a \"reform,\" depending upon how permanent it is\nand upon how many persons are influenced. Impressions are defined as effects\nupon listeners at the time they listen; influences last longer but do not\nnecessarily result in habits; changes do affect individual habits; reforms are\nthe effects of radio as they show in the whole population, they are simply\nwidespread and persisting changes. It is to be hoped that research in edu¬\ncational broadcasting will be able eventually to supply information on the\nextent of each type of effect listed above (6, 7> 8, 9); most research so far\nhas been concerned with the more superficial impressions and influences rather\nthan with the deeper, more permanent, changes and reforms."
}