{
  "id": "d1767-9",
  "text": "Research of Particular Value to Broadcasters\n(l) Broadcasters want to know the size of the audience of individual\nprograms, the trend in audience size, the proportion of regular and oecasional\nlisteners, and something about the social and geographic structure of the\naudience. Available commercial surveys supply most of this information for ^he\nnational and a few local programs but will in general be too expensive for\neducational programs,*\nOne of the most widespread errors in educational radio is the broad¬\ncasting of programs far too advanced in cultural and intellectual level for most\nof the radio listeners in the country. Educational programs Judged by experts\nto be of the highest quality usually employ a vocabulary, pace, and range of\nconcept that puts them far beyond the vast majority of listeners. Unpublished\nstudies on file at the Office of Radio Research at Columbia University, data\noffered in the recent volume Radio and the Printed Page by Dr Paul F Lazarsfeld,\nand Beville’s study mentioned above, all agree in finding that the audience\nfor the well known adult educational programs consists mainly of high school\nand college graduates, while close to half of the adult radio audience has had\nno high school education.\nThere is known to be a strong correlation between income and edu¬\ncational level. Since income is more easily estimated than educational level,\nit is frequently substituted for the latter in listener research. For this\nreason the findings reported by Beville** showing that those of higher income\nlisten much more to educational programs, may be interpreted to mean that persons\nof higher educational level listen more to educational programs. If radio is\nto fulfill its promise in education, it is clear that this situation must be\nwidely changed. In addition to supplying educational material to the few of\nhigh income and high educational level, who need it least, educational broad¬\ncasters should turn their attention to supplying more easily assimilable\neducational material to the vast majority of the population, of low income and\neducational level.\nAn over-all picture of the audience to a single program can be\nobtained quickly and inexpensively if the services of a volunteer civic or edu¬\ncational group can be secured for making coincidental telephone calls. For\nexample, R H Hudson, of the Rocky Mountain Radio Council, (Denver, Colorado),\nestimated the size of the audience to several programs that the Council sponsors\nin several communities by this method. The survey was completed in a few days\nand the cost was very small.\n* - Many examples and applications of information of this type may be found in\nH MBeville’s report “Social Stratification of the Radio Audience,\" 1939>\nmimeographed, $1.00. Available through the Office of Radio Research at Columbia\nUniversity.\n** - Beville, H M, \"The ABCD's of Radio Audiences,\" Public Opinion Quarterly,\nJune 19^0, Vol. 4, No. 2. .. .\n-4-"
}