{
  "id": "d1105-10",
  "text": "-10-\non Educational Television, Washington, D. C.; Professor W. G.\nAlbright and Professor Paul F. Schwarzlose of the Electrical Engi¬\nneering Department and Professor Ambrose M. Richardson of the Depart¬\nment of Architecture of the University of Illinois; and members of\nthe NAEB Engineering Committee.\n*****\nThe FCC has published the first edition of \"Radio Equipment\nList Part A\" showing TV broadcast transmitters and monitors which\nhave received \"type acceptance” and \"type approval\" respectively.\nOnly one transmitter and one frequency monitor are on this list.\nThis is the last segment of radio equipment lists to be compiled.\nThe lists are broken down into the following parts: Part A, Tele¬\nvision Broadcasting Equipment; Part B, Aural (AM and FM) Broadcast\nEquipment; and Part C, List of Equipment Acceptable for Licensing\nin the Radio Services other than Broadcast.\nSupplements to these lists will be issued from time to time\nand the lists will be brought up to date at about yearly intervals.\nThese lists are not available for general distribution; however,\ncopies are available for inspection at the Commission’s offices\nin Washington and at each of its field offices. Arrangements\nmay be made through the Technical Research Division of the Office\nof Chief Engineer of the FCC for the loan of copies of these lists\nso that those interested may reproduce the lists in whole or in\npart.\n*****\nRCA recently demonstrated a new, low-light, image orthicon\ncamera tube which can \"see\" in almost total darkness. In the\ndemonstration a camera equipped with this new wide-spaced image\northicon picked up the image of a girl in a room with the lights\noff. She was invisible to observers fifteen feet away in the\nsame room. Observers stated that the picture obtained was shown\non a television receiver in the room with good brightness and\ndefinition.\nThis new image orthicon is said to be 5 to 10 times more\nsensitive than present camera pick-up tubes. It is being used"
}