{
  "id": "d1105-3",
  "text": "-3'\nsubway and train to get to Lowell Friday evening to enable us to get ac¬\nquainted over the weekend with our second granddaughter,\nMonday (19) we were on an early train from Boston to New York, early\nenough to see the beginning of the second snow storm which deposited another\nfoot of snow in the Boston area. We arrived in New York City 90 minutes late\nto find traffic at a standstill due to a 12.5 inch snowfall on Sunday. Taxis\nwere few and very far between, and hotels were jammed but the busses were\nstill running. Advance hotel reservations meant only good intentions however.\nAnother bus landed us in a hotel with rooms available although not so con¬\nveniently located.\nIn spite of the storm and the gigantic transportation problem it caused,\nthe annual Institute of Radio Engineers Convention was well attended, so well\nin fact that many were turned away at some of the more popular technical ses¬\nsions. We were pleased to see BYed Remley, Chief Television Engineer of the\nUniversity of Michigan, George Murphy, Chief Engineer of the Auburn Studio of\nthe Alabama State Network, and Ralph Townsley of WBAA at Purdue University in\nattendance. We feel that educational radio and television should be repre¬\nsented at such meetings and hope that in future meetings our participation\nwill increase.\nThursday afternoon and Friday we spent in Brooklyn at the Board of Educa¬\ntion Station WNYE. Herman Haverkamp, WNYE Chief Engineer, was busy going over\nspace requirements for new television facilities which we discussed in detail.\nJim Macandrew sat in with us for a few minutes in discussing their plans. We\nalso had a lengthy session with Ed Kratt of the NAEB Engineering Committee and\nHerb Friedman of the WNYE staff on tape recorders, their characteristics and\nmaintenance routines.\nWe*11 report later on the remainder of the trip. We*11 put this in the\nmail with the hope that it will beat us home by a day and make the deadline\nfor the April Newsletter.\n*****\nWe have available the procedures used by W0I-TV, Channel 5, and WILL-TV,\nChannel 12 in making harmonic measurements on their television transmitters.\nIn both cases, the method is essentially the same as that set forth in the\nGeneral Radio Experimenter Vol. XXIX, No. 10, March, 1955. We are not plan¬\nning to publish these in the Engineering Newsletter since they are not of\ngeneral interest, however, we will be glad to make copies for those who re¬\nquest them.\n*****\nA sample log form for kinescope recorder operations was included in\nIssue No. 5 of the Engineering Newsletter. We!d be glad to send you a copy\nupon request.\nr"
}