{
  "id": "d1105-5",
  "text": "-5-\nA report by the NAEB Engineering Committee to be released soon\nwill cover these in some detail. In addition to the video tape\nrecorder, the following will be covered: newly developed low and\nmedium power television transmitters, transistor audio amplifiers\nand consoles, new television lighting equipment using sealed beam\ntype lamps, microwave equipment and automatic programming devices\nfor AM and TV, vidicon camera and associated equipment, low cost\nkinescope equipment and lenticular film for color television\nrecording.\nTo the writer, the past year has seen a marked improvement\nin picture quality as demonstrated on vidicon live camera equipment.\nKay-Lab, Cage, Sarkes-Tarzian and new G.E. vidicon camera equipment\nwere on display and the picture quality was uniformly good.\nAnother feature of the week in Chicago was the dedication of\nnew live color equipment at WNBQ which began making all local\nlive originations in color. Monochrome equipment will be removed\nand soon will be dispensed with entirely. This means that\ninitially WNBQ will originate approximately five hours per day of\nlocal live color programs. In addition the station will carry as\nmany of its film programs as possible in color as well as NBC\nofferings. It is expected that the station will originate a total\nof seven hours per day of color programs.\n*****\nAs noted in the January 1956 Newsletter. Part 3 of the FCC*s\nrules governing Radio Broadcast Services revised in November and\neffective January 2, 1956 has now been published and is on sale\nby the Superintendent of Documents, Government Printing Office,\nWashington 25, D. C. for $1.50 per copy. Standards of Good\nEngineering Practice concerning Broadcast Stations are now\nincluded in Part 3. This publication contains all rules, regula¬\ntions and technical standards for AM, FM and TV.\nEngineering charts and graphs contained in Part 3 may also\nbe purchased separately for $1.00 per copy. This pamphlet is\ntitled \"FCC Broadcasting Engineering Charts.”\nA set of two maps on \"Estimated Ground Conductivity in the\nU.S.\" (Figure M-3), is also available at $3.50 per set.\nIf you wish a complete list of FCC publications, write the\nSuperintendent of Documents, Government Printing Office,\nWashington 25, D. C. and ask for Adm. Bulletin No. 1, March 1956.\nr\n*****"
}