{
  "id": "d1268-21",
  "text": "-19-\nhours each week, but later, as the supply of programs becomes greater, we hope\nto increase the weekly package so that an average of five hours will be at¬\ntained over the year.\nWhere will the Center obtain this material? In general, we expect our\nchief sources of program materials to fall into three broad categories:\n(1) those programs produced by educational television stations and distributed\nby the Center (exchange programs); (2) those programs produced for the Center\nby educational and commercial television stations, by universities and col¬\nleges, and by commercial film producers (produced programs); and (3) those\nprograms selected from the great variety of film resources already available\nand which have been, or can be, cleared for educational television uses (ac¬\nquired programs).\nOur first source of supply is quite an extensive one. We already have\na long list of proposed exchanges that various agencies feel are worthy of\nnational distribution. This doesnH mean such programs are reacfy to go on\nthe air in the form in which they should go into a package, but at least they\nare not just ideas.\nIn short, it looks as if in the long run the exchange method can produce\na good deal of excellent material. Most of this we hope to get at a relatively\nlow cost, perhaps little more than the out-of-pocket cost of the unit which\nproduced the material; in other words, the difference between what it would\ncost if the local station were to put it on the air for itself and the addi¬\ntional operations necessary to put the film on kine into our hands for ex¬\nchange.\nThe second source of supply is through direct production contracts. In\nmost cases, we think of these as internal contracts because they will be either\nwith educational television stations themselves or institutions which have\nfilm production units. These contracts will be just that—an agreement with\na station or a university to produce a specific series of programs for the\nCenter. In some cases we may pay the entire cost of production; in others,\nonly part.\nThis source of supply, we feel, will be quite productive over the years,\nand we have every hope of getting materials which will vary all the way from\nwhat might be called acceptable to really distinguished programs. Already\nthere are signs that some of these agencies will be able to do an outstanding\njob in this area.\nFinally, the third category of materials is what we have called acquired\nmaterials. These are programs selected from the vast supply of film material\nalready available in this country. By the nature of its operation, the Cen¬\nter does not intend to buy wholesale quantities of such materials, but rather\nplans to build its program patterns and acquire only those films which fit\ninto its patterns.\nI am certain I do not have to point out to any of you the almost unlim¬\nited possibilities in this field. In one category alone, the State Department\nhas stored in New York City some forty million feet of film, part of which can\nperhaps be turned over to us. Just to find out what is in this material is\na staggering job since the largest part of it is not catalogued or evaluated."
}