{
  "id": "d790-10",
  "text": "Graham Hovey — letter from Italy Bo*\nJJAEB Botwork\nrecorded in Home, October 28, 1954\nTape must 13§40\n3\n(First in a series on the current Italian political scene)*\nThis is Graham Hovey, recording in Home a radio Letter from Italy for the national\nAssociation of Educational Broadcasters — the BABB Network.\nAs I record these lines, the government of Italy, headed by Mario Soelbs as prime\nminister, has just won its fourth parliamentary vote of confidence in as many weeks.\nOn none of those four occasions was the Scelba government in serious danger of being\nturned out of office. Three of the four votes — one in the senate and two in the chamber\nof deputies — gave Signor Scelba his biggest majorities since he formed his cabinet last\nFebruary 10*\nThose were not whopping majorities, to be sure. The party lineups in both chamber\nand senate since the national elections of 1953 make it impossible for any middle-road\nItalian government to count on comfortable margins, \"hen the democratic parties backing\nthe Scelba government can keep their ranks intact to a man they can muster sure majorities\nof only eight votes in the chamber and six in the senate.\nIn its least impressive showing in the four votes of confidence I have cited, the\nScelba government had a margin of 17 votes in a senate of 237 members. And in each of its\nteats in the chamber, the government mustered 30 more votes than its combined opposition\nof political left and right.\nThis meant that the four parties supporting the government had kept their lines in tact |\nthat when the chips were down, the democratic coalition rebuilt by Signor Scelba under\ndifficult circumstances nine months ago could still hang together and permit the government\nto funotion.\nThus, these four confidence votes should have been what the term implies» they should\nhave bolstered the confidence of both government and country! they should have constituted\nentries on the credit aid© of the ledger for middle-road, democratic government.\nThis should have been true especially because two of those confidence votes directly\nconcerned the settlement, at last, of the Trieste question, which is deeply felt by nearly\nall Italians.\nIt is true that few Italians are entirely satisfied with the settlement, which leaves\nso much of Istria and many Italian nationals under Yugoslav rule. But I think most Italians\nconcede that the settlement was the best Italy could hope for under present circumstances.\nThus, the government had every right to hope that the return to Italy of the Adriatic\nport city would be regarded as a victory for the course of patienoe and firmness which it\nhas followed. And this victory oould hardly fail to embarrass the governments critics of\nthe Communist-dominated left and the neo-Fasoiet and ultra-nationalist right.\nThe tub-thumpers of the political right were oonfrented with the hard fact that quiet,\npatient diplomacy had achieved something that the street riots end tough talk and bellicose\npostures of a year ago oould not achieve.\nAs for the Communists, their position on Trieste had long ago become ludicrous, because\nof the compulsion to follow the twists and turns of the Moscow line, then Yugoslavia’s\nMarshal Tito was the favorite son of the Kremlin in 1945* the Italian Communists urged\nworkers of Trieste to greet Tito’s troops as \"liberators.\" Then Tito wae cast out by the\nKremlin in 1948, the Italian Communists had to do a quick flip-flop, along with their"
}