{
  "id": "d790-125",
  "text": "Hovey — 4,\nNow wo com© to a D05CA question that would have been more meaningful for\nAmericans if it had included the United States in the list of countries in¬\nvolved. BGXA asked Italians: In your opinion, which of the following three\ncountries showed the most hostility to Italy after the war — France, sagland\nand Russia.\nIn the overall survey, only two per cent of the Italians polled siad\nFrance had been moat hostile. Forty one per oent said Britain and 37 per cent\nsaid Russia. eleven per cent of those responding said all three of these\ncountries had been hostile to Italy and only two per cent said none of the\nthree had shown hostility* Perhaps three historical reminders should be in¬\nserted at this pointi\n1* Many Italians have long nursed a deep resentment against Britain as\nthe nation which consistently thwarjsed Italy's ambitions — colonial and other¬\nwise — in the Mediterranean area*\n2. The British army contributed to the World War II debacle of the Ita¬\nlians in Africa* then fought on Italian soil for nearly two years* and finally\nstayed on as an occupying power once the war was over* The Soviet army, on\nthe other hand, has never been on Italian territory.\n3. And finally, the British have been responsible for the administration\nof Zone A of the Free Territory of Trieste and were blamed for the violence\nand deaths of last autumn.\nThese factors may help account for the overall result of the DOiXA pell,\nin which 41 per cent of the Italians said England had shown the most hostility\nto Italy in this postwar period against 37 per cent who listed Russia* In\nDOSCa’b breakdown according to educational background, the result was somewhat\ndifferent. Persons with the most formal education among those polled said that\nRussia had shown the most hostility to Italy, although the margin was not great\nbetween the Soviet Union and England.\nDUX.A also broke down answers to this question according to geographic\nlocation. The polling agency found that in the sou$h of Italy and in the is¬\nlands, Including Sicily and Sardinia, the Italian people thought Russia had\nshown greater hostility than England in the postwar years. But in the north¬\nern and central parts of Italy, about 46 per cent said Ihgland had demonstrated\nthe greatest hostility, compared with 37 per cent who named Russia as the major\noffender.\nOnce again, the political party breakdown was what one could anticipate.\nAmong Communists and left Socialists, 70 per cent said Itagland had shown the\nmost hostility, against eight per cent who listed Russia. But among Christian\nDemocrats, only 23 per cent called England the greatest offender, against 54\nper cent who named the Soviet Union.\nDGDUk’a last question was worded this way* “Whet acts of Russia, hostile\nto Italy, -have hurt it th^most?*\nThirty three per cent of Italians polled listed the Soviet Union’s de¬\ntention of Italian crooners captured during World War II. It has been esti¬\nmated that upwards of 60,000 Italians were so detained* only a relative handful\nhave come back. And the Italians clearly resent this more than anything else\nthe Soviet Union has done. In second place, cited by 19 per cent of those\npolled, is Russia’s persistent veto of Italy’s admission to the United Nations.\nSix per cent cited Moscow*s hostility to the return of Trieste to Italy* nine\nper cent cited Russia’s claim for war Indemnities* and five per cant listed\nCommunism’s struggle a&Alnst the church and persecution of priests."
}