{
  "id": "d790-70",
  "text": "Hovey — 3\nThat Nenni hid won support from many Italians who are not sympathe¬\ntic to Communism and who are not even enrolled Socialists, hut who fear the\nrearming of Germany under any conditions* These Italians resented what they\nregarded as the abrupt way in which Nenni's proposal was cast aside hy\nAleide de Gasperi, who then was seeking to form a new government.\nThese hopeful Italian Socialists point out that Nenni has concrete\nproof that detaching himself even a short distance from the Communists pays\noff at the polls. Immediately after World War II, the Socialists were the\nbiggest party in Italy. But during the period of their alliance with the\nCommunists, their strength diminished to the point where they were only a\nsubstantial tall to the Communist kite. In the Chamber of Deputies after\nthe 1948 election, they held only 50 seats to 133 for the Reds.\nFor this year's election campaign, the Nenni Socialists decided\nto campaign with a separate list of candidates, rather than the common\nslate they drew with the Communists five years ago. Nenni's campaign slogan\nwas “the Socialist alternative,\" the clear implication being that his party\nwould steer a course midway between that of the Communists on the left and\nthe Christian Democrats in the middle. Nenni said glibly that his party\nreally sought only \"neutrality\" for Italy between the two great power blocs,\nheaded by the United States and Russia.\nThe result of this appeal has already been noted: An Increase of\n50 per cent in the Nenni party*s representation in the Chamber.\nBut the hard fact is that Norm! at no time hasoffered to break his\nso-called “unity of action\" pact with the Communists. Another fact is that\nif Nenni has been hinting at a revival of the Popular Front kind of govern¬\nment, so have the Communists. Communist party leader Palmiro Togliatti is\nsaid to have told the British left-wing Labor!te, R. H. 3. Crossman, in\neffect: “If Nenni goes to the right. I’ll go even further right than he\ndoes.\" Togliatti's meaning was clear. And the Communists have been trying\nto implement Popular Front strategy on the Italian l&borfront already in a\nway I will examine in a few minutes*\nAnd so, the effort to detach Nenni himself from the grasp of the\nCommunists seems to be getting nowhere* Giuseppe Saragat of the Social\nDemocrats, who made an effort to persuade De Gasperi to take Nenni into the\npost-election cabinet under certain conditions last summer, now has given\nup that angle* But Saragat still is trying, with his Social Democratic\nparty, to maintain what he calls \"Apertura a Sinistra’* — an opening to the\nleft — which is designed to capture many of Nenni*s followers, if not the\nhead man himself.\nThe Saragat effort will be examined in a later Letter. It will\nsuffice for now to say that the available evidence indicates that the Social\nDemocratic leader is having no major success* But the idea of detaching\nNenni and his followers from Togliatti! the idea of bringing into the\ngovernment a unified, powerful Socialist party whose leaders had broken\ndecisively from the Communist embrace — that idea will continue to fas¬\ncinate Italian democrats of the political left*\nBut an outsider taking a look at recent election results and\nbits of additional evidence wonders if the reverse process isn’t the more\npowerful one. I noted in a Rome newspaper yesterday that the directors of\nthe Nenni party had voted unanimously to accept back into the fold the Hon.\nUmberto Calosso. The account said Signor Calosso had left the party in\n1947, together with the Hon. Saragat."
}