{
  "id": "d790-87",
  "text": "Hovey — 5\nsocial policy, the Gronehi group is reformist and often supports the Demo¬\ncratic Initiative and the trade unionists* But in foreign policy its line\nis closer to that of both the Communists and Fascists, strange as that may\nsound. It is nationalistic, like the Fascists, hut it is also neutralists*\nThat means that it oppose® the Atlantic alliance and European unification\npolities of D© Gasperi*\nIt means that the Gronchi group might he capable of a deal with either\nthe far left or the far right if the present political crisis should be pro¬\nlonged and no tther solution should appear feasible.\nIn addition to these factions there are, of course, a great many Chris¬\ntian democrats who generally stick to the middle of the road and follow the\noartv policy. And no look at the compost Ion of the Christian Democracy HKB&aai\nwould be complete without a reference to Catholic Action* Tills organisation,\nwhich claims three million members, is not a part of the Christian Democracy.\nBut its so-called Civic Committees, organised by Professor Luigi Gedda, a\nPiedmontese physician, did a tremendous Job in rolling up votes for the\nChristian Democrats both in 1948 and again in 1953* His enemies say that\nGedda would like to create a single Catholic, aati-Communist party which would\nembrace both the neo-Fasoi&ts and th© so-called Christian Socialists* however\nthat may be, G-edda1® considerable influence is exerted in such a way as to push\nthe party toward the political right.\nSuch is the party that Aleid© de Gasperi, at 72, has undertaken to hold\ntogether and to re-forge as an effective political lustrum-ant, capable of\nfollowing a middle-rood, democratic course and enacting needed social and\neconomic reforms*\nAt the moment, as you well know, the outlook Is not very encouraging.\nBut Be Gasper! will surely persist, because he know® that the falling apart\nof the Christian Democracy at the present time would surely imperil the whole\nItalian democratic system.\nThis i® Graham Hove/, signing the second in a series of two Letters from\nItaly dealing with the present Italian political crisis. This program was\nrecorded in the Rome studios of Radio Italiana for toe National Association\nof Educational Broadcasters — and this is the MAKE Network.\nm"
}