{
  "id": "d790-88",
  "text": "araham Hovey — Letter from Italy Mo. 11\nrecorded in Rome January 15* 1954\nTape runsi 13*45\nThis Is Graham Hovey, sending along another radio Letter from Italy under\nthe datelines Rome. These programs are produced for the national Association\nof Educational Broadcasters with the cooperation of Radiotelevisions Italians.\nHere is the way a cabinet crisis can begin in Italy? The voice is that\nof the Hon. Giuseppe Pella. He is speaking to a crowd of journalists and\nradio and television reporters in a large hall of the Palazzo Quirinale in\nRome. The da&e is January 5 and the hour is eight in the evening. Pella has\nJust come out of the office of Italy* s president, JLwigi Einaudi:\nPELLA (first tap®)* \"Come sapete, era mio intendimento dare una maggiore\nefficients teenies e politics al Governo, ehe ho constituito nel mese di\nagosto sotto i segnl della transitorieta.*\nHQVEX (interrupting to translate): ’*As you know, it was my intention to\ngive a greater technical and political efficiency to the Government that I\nformed in the month of August on a transitory basis/*\nPELLA (first tap© continues): f*Quests maggiore efficients mi sembrava,\ne ritengo aacora oggi, ind is pen sa bile per poter affront are quel conoreti\nprogrammi di lavoro e dl realizzazioni che il Paeae attend®.\nHQ VEX (interrupting to translate): **Xt seemed to me — and I still think\nso today — that this greater efficiency was indispensable for meeting those\nconcrete programs of work and realizations that the country expects.\nPELLA (first tape continues): **Ho cercato, attraverso la formula del\nrimaneggiaxaento, di rags lung ©re quo l: to rlsultato, ma, purtroppo, ho incontrato\nfattl e difficolta che ml port ana a concludere che il raggivmgimento d©l\nrlsultato cul accannavo, cioe un governo pollticament© e tecnicamente effi¬\ncient©, pud essere raeglio ragglunto aoltanto attraverso la formula della\ncrisi.\"\nHQ VEX (interrupting to translate): **X have sought, under the formula of\na remodelling or reshuffling of the cabinet to achieve this result, but un¬\nfortunately I have met with facts and difficulties that made me conclude that\nthe attainment of the result which I pointed out, that is, a government\npolitically and technically efficient, could be bettor achieved only under\nthe formula of a crisis.**\nPELLA (first tape continues): HPor questo ho avuto I'onore di presentare\nal signor President® della iieyubblica 1© dliaissioni del Govemo.\nHQ VEX (translating) t *For this, I have had the honor of presenting to\nthe President of the Republic the resignation of the government.\nHQVEX (continuing commentary): well, there it lsj that s exactly the\nway Italy’s latest cabinet crisis started at eight o'clock on the evening of\nJanuary 5-at the quirinal palace in Rome. I thought-you might like to hear\nsome of the developments of this crisis from the lips of the men who figured\nin it# a3 their remarks v/ere recorded and broadcast by the news staff of\nRadio Italians. And I thought this* might be a good time to review the way\nsuch a crisis develops in Italy's parliamentary system, which is so vastly\ndifferent from our own system of coordinate branch©** of government and checks\nand balances between them."
}