{
  "id": "d790-94",
  "text": "Hovey — 2\nfact that the Social Democratic party of Giuseppe Saragat laid down four\nmajor points as the bases for its support of a new government and that Fanfani\ncould not unconditionally accept all four* If he could not get the support\nof the social Democrats, with their 19 votes in the Chamber of Deputies, he\ncould not be assured of a vote of confidence when he presented his cabinet to\nthe parliament* That Is, he could not be assured of such a majority unless\nhe were willing to bid for the 40 votes of the Monarchists and that was one\nof the major criticisms levelled against his predecessor, Giuseppe Pella* In\nfact, it had been one of the criticisms levelled, among others, by Signor\nAt this writing it still is not clear how Fanfani will make out before\nthe Chamber of Deputies and the Senate. Ry the time you hear these lines you\nmay know whether he got his majority or not, and, therefore, whether Italy1 s\ncabinet crisis is resolved or not*\nAt any rate, the strenuous efforts of the directors of the Christian\nDemocratic party — Including the efforts of former Premier Aloide de O&sperl\n— kept Fanfani at the job* .And early Sunday evening January 17, he was\nready to take the next step. About seven o'clock, his ministerial automobile\npulled into the courtyard of the Palazzo Quirinale. The short, baldlsh,\nintense premler*designate was ushered into the studio of President iSlnaudi.\nAnd about an hour later Ferdinand© Carbone, secretary general of the\noffice of the Presidency of the Republic, had an announcement for the waiting\nnewsmen and the Radio Italians microphone* Here is 3eeretary-General Carbone*\nCARBONM (first tape begins)* 1111 President# della Repubblioa ha quests\nsera all© ©are 19 ricevuto a palazzo biirinale I'onorevole Amintore Fanfani,\n11 quale, dopo averlo messo al corrente della situation# politics in relazione\nall Incarloo di formare 11 Minister©, si e diohiarato fiducioso di poter entro\ndomani, sologliend© la formulata rlserva, presentare la lista del componenti\ndel nuovo Govern©*\nHuraf (interrupting to translate)* \"The President of the Republic has\nthis evening at the hour of seven received at the Mrinal palace the lion*\nAmintore Fanfani, who, after bringing him up to date on the political XXmxWtei\nsituation in relation to the task of forming a ministry, has declared himself\nconfident of being able by tomorrow •• removing the formula of reserve —* to\npresent the list of the components of the new government*\"\nCARBONS (first tape continues) t \"L'on. Fanfani tomerk ad essere rice*\nvuto dal Capo della state domani 18 corr* alle ore 11,30.*'\nHOVSf (translating)* \"The Hon. Fanfani will return to be received by the\nHead of the State tomorrow, the 19th, at the hour of 11*30.\"\nA few minutes later — at 8*25 P* m., to be exact — Fanfani emerged\nfrom President Sinaudl's studio to confirm what Carbone had said* Here Is\nSignor Fanfani, telling the country that he is going ahead with the job of\nforming a new government and expects to have his slate of ministers ready\nthe following day*\nFANFANI (second tape begins) * \"Ho rlferito al signor Presidents della\nRepubblioa sulle indagni e colloqui che mi ero rlservato di fare in questl\ncinque gioml* Credo di essere ormai in prossimita del porto, e di ooter\ntornare dooattina a sottoporre al signor President© della Repubblica la lista\ndel component! il nuovo Governo.\"\nHOVJCX (translating) * rtI have reported to the President of the Republic"
}