{
  "id": "d790-96",
  "text": "Hovey — 4\nBut It ha© long been my belief that most Americans — my&elf included —\nneed to know more about the parliamentary system by which our alliedand\npartners in western Europe govern themselves* we need to know more about\nthis system and how it differs from our© if we are to understand western\nEuropean political problems and something as complicated as this January\ncabinet crisis in Italy*\nFinally* It seems to me* w© ought to know as much as possible about the\nreasons for a particular cabinet crisis in Italy, one of the countries in\nwhich we have a substantial stake*\nXou will probably know the fate of signor Fanfani1* effort by the time\nyou hear this letter from Italy* But the political situation that brought on\nthe crisis which led to the resignation of signor Pella on January 5 is\nbasically unchanged by the shift of ministerial portfolios.\nIf Signor Fanfani wins his vote of confidence in parliament* that situ*\nation will continue to hinder him as he tries to develop his government*!\nprogram# If he should be struck down by the parliament, that\" situation would\nconfront the next man who make© the attempt to fora a government and would\nmake that man*a Job even more difficult than Fanfani1* has been.\nFor basically* this Is a crisis of the Italian democracy* Its most\nimmediate and aggravating fact isthat the Italian democratic parties —\nFanfanifs Christian Democrats* the Social Democrats* Liberals and Republicans\n•• did not get enough votes and did not elect enough men in the national\nelection of last June 7* They did not elect enough members In the Chamber of\nDeputies and the Senate so that a democratic government could govern effective*\nly.\nSince then* each of these parties has been afflicted with its own inter¬\nnal crisis* This fact has made the Job of the government even more difficult\nthan the unfavorable mathematical lineup in the parliament dictated.\nAt this moment* Fanfani is not out of the woods* But the very fact that\nhe finally decided to go ahead and form a government caused many Italians to\nheave * sigh of relief. As the Rome newspaper* U aessaattero. said, editori¬\nally* the prolonged crisis had wearied and aggravated the uneasiness and be¬\nwilderment of public opinion*\nkesa.aggero did not add the fact that public weariness over prolonged\nparliamentary squabbles and crises helped bring the Fascist march on Rome\n30 years ago#\nJo* there is much sympathy in Italy tonight for the little man who stood\nbefore the Radio Italians microphone in the Quirlnal palace this morning and\nsaid i\nFANFjtfil (repeating)! *La situations ha Imposto a me questo dovere verso\nla Nations Italians•*\nHO VEX (translating) I 11 The situation has imposed on me this duty toward\nthe Italian nation*rt\nftraham Hovey* signing another radio Letter from Italy* This program\nwas recorded in the Rome studios ofRadlotelevislone Italians for the National\nAssociation of educational Broadcasters — and this lathe NAEB Network*\nm"
}