{
  "id": "d1653-1",
  "text": "‘ NAEB NEWS LETTER...Fob 15, 1940,..Pag© 2\nbroadcasts in making their plans*\nThe beginning of Mr* Miller’s regular broadcasting, it is interesting\nto note, is earlier than the dates on which the so-called \"pioneer”\nbroadcasting stations began their operations* 'This is further\nevidence to support the Madison station’s claim that it is\nAmerica’s oldest station*\nNOTES ON W I L L\n\"Historic Illinois” is the name of a new series of programs being\ncarried 4:30«5:00 p.m,, Tuesdays, on the University of Illinois\nstation, WILL* This series, written by George Jennings, continuity\neditor of the Chicago Radio Council, seeks to present phases of our\nrich history, bringing to life past events, and making real some of\nthe men and women who made Illinois the great state it is* It is\nespecially suitable for the upper grades and high school students,\nas well as for adults* The first three programs: Joliet and\nMarquette; Abraham Lincoln; Robert Cavalier Sieur de la Salle*\nWar, floods, and politics; a record low in highway deaths and a\nrenewed increase of them; death of Borah and others; world events\nwith repercussions or potentialities flop ©very Illinois community;\nlocal problems of interest because similar problems occur in many\ncommunities--all these have been discussed in more than 4,000\neditorials read during the past three years in the \"Illinois\nEditorial Review” of the University of Illinois radio station, WILL,\nDuring the past year, nearly 1,500 editorials from the leading\ndaily and weekly newspapers of Illinois were read in this unique\nprogram of the state's only non-commercial, educational radio\nstation. Total circulation of the newspapers received is just\nshort of two and a quarter million persons. More than 200 copies\nof newspapers are scanned each week in preparing the two 15-minute\nbroadcasts--l:45 p0m, each Tuesday and Friday, The papers include\n24 dailies and 66 weeklies,\nMEET IN FLORIDA?\nGarland Powell writes: \"The thou^it occurred to me that our\nassociation should meet at different places from time to time, I\nmean by that, it is a logical thing to do, to meet at a central\nlocation, but on the other hand it may help out situations and would\nbe just as cheap in the long-run to meet at distant points. In\nother words, I am trying to convey the thought that the University\nof Florida would like to have an NAEB meeting,” Now there it is, a\nrepetition of Major Powell’s previous invitation to hold the next\nNAEB convention in Florida, Soon a mail vote on dates and place\nwill be taken. Watch the News Letter for further details,\nEDUCATION ON WNYE\nThere is quit© an extensive story of the work being done by WNYE,\nin New York City’s Board of Education ultra-high radio station, in\nthe December issue of \"Pick-up\"* Some of you may have heard M,S<>\nNovik of WNYC describe the start of the ultra-high stations at the\nAmes Convention, In any case I think you will enjoy reading this\narticle*"
}