{
  "id": "d1488-1",
  "text": "News Notes\nPERSONNEL\ny Phi'llip A. Jacobson, long-time NAEBer, is now manager of\nITV sales for Westinghouse.\ny Hugh Greene has been appointed project coordinator for the\nTexas Educational Microwave Project. Greene, of the Univer¬\nsity of Texas, was in on the beginning of ITV at the univer¬\nsity and at TEMP.\ny Darrel W. Hold has joined the staff of the University of\nKansas radio-TV-film department as an assistant professor.\nHe is finishing his Ph.D. at Northwestern and has been in\ncommercial broadcasting for 12 years.\ny Glenn Wilson has become television engineer at Northern\nIllinois University. He will assist Blanche Owens, the coor¬\ndinator of ETV, in the design of closed-circuit and broadcast\nTV facilities.\ny Thomas H. Welch of the Columbus, Ohio, public schools\nhas just been hired by WOSU-TV, Ohio State University, as\na producer-director.\ny George Dooley has been appointed station manager of Dade\nCounty (Florida) WTHS-TV and WSEC-TV. Dooley will\nbe in charge of the two TV stations, as well as the radio sta¬\ntion, WTHS. Cliff Mitchell, general manager of WTHS-TV\nand director of radio and television education for the county\nschool board since 1960, has been promoted to the position of\nadministrative assistant to the superintendent of Dade County\nschools.\ny Ohio State’s Richard B. Hull has been chosen one of Co¬\nlumbus’ Top Ten Men of 1963 by the Columbus Citizen-Jour¬\nnal for his work in ITV.\ny James W. Case, former program director and assistant ex¬\necutive director of ETV station KRMA, Denver, has taken\nover as director of programing at Los Angeles’ new educa¬\ntional Channel 28. James Loper has been named director of\neducational services. Loper leaves the post of director of tele¬\nvision at Los Angeles State College.\ny Boston University Associate Professor Sidney Dimond is\nleaving school broadcasting to work full-time on his “sounds\non tape and record” company, Creative Associates, Inc.\ny Two new WKNO-TV, Memphis, staffers are Jim Long-\nstaff, producer-director, coming from WCCO radio, Minne¬\napolis, and Allen Bates, children’s director and host of daily\nseries, formerly a local actor.\ny Howard Holst, WKNO-TV, Memphis, managing director,\nis doubling as Memphis State University speech and drama\ndepartment instructor in TV production.\nSTATE AND REGIONAL\ny A $100 savings bond will be awarded the winner of a con¬\ntest for the design of a new identification emblem for the\nOhio Educational Television Network. The Special Projects\nCommittee of the Columbus Chapter of the National Academy\nof Television Arts and Sciences is providing the award. Ohio\nnow claims more ETV broadcast stations than any other state\nin the nation: 7.\ny “ETV for South Dakota,” a survey and report prepared for\nthe South Dakota ETV Association, has been completed by\nETV Associates of St. Paul. The report was presented to the\nstate Joint House-Senate Committee on Education for further\nstudy by the Legislative Research Council. After an exten¬\nsive “grass roots” publicity and promotion effort, tentative\nplans hope for initial legislative action in January, 1965, at\nwhich time the legislature might appropriate funds to operate\nthe first phase of a state-wide network outlined in the study.\ny In preparation for the Arkansas ETV Commission’s final\ndevelopment plans, Director Lee Reaves and Commissioner E.\nT. Sheffield, Lakeshore Schools Superintendent, spent three\ndays studying the Alabama ETV Commission and its opera¬\ntion. The Arkansas Commission plans to pattern its organi¬\nzation after the Alabama setup.\ny Eight CATV systems outside the Alabama ETV network’s\ncoverage now are providing their subscribers with Alabama’s\nprograms.\nINSTRUCTION\ny TV teachers from KLRN-TV, Austin, Texas, are meeting\nwith classroom teachers who are using their television pro¬\ngrams in a series of evaluatory workshops.\ny At eight schools throughout New York City, special pro¬\ngrams utilizing portable TV units are helping pre-service stu¬\ndent teachers and in-service regular and substitute teachers\nto develop skills in classroom routines, discipline, and pupil-\nteacher relationships. The units employ a single camera which\nprojects—with the aid of monitor, microphones, and audio¬\nvideo “mixers”—a classroom demonstration lesson to a num¬\nber of other rooms in the school building where teachers and\nsupervisors view it on receiving screens.\ny WKNO-TV, Memphis, says its telecourses are being used\nby 80,000 pupils this year.\nGENERAL\ny James Hagerty, vice president of ABC, and Robert E. Lee,\nFCC Commissioner, will keynote the 25th annual Intercollegi¬\nate Broadcasting System’s national convention March 21 at\nColumbia University.\ny WQED, Pittsburgh, is running a Miss ’QED contest\namong city college students. The winner will help the station\ncampaign for funds.\ny University of Florida’s WUFT (TV), in a recent program\nbulletin, asked viewers to keep postal cards near the set, and\nto write the station immediately about programs they either\nliked or did not enjoy.\ny For the first time in its nine years of operation, WCET,\nCincinnati, is telecasting on Sunday afternoons, with good\ndrama, opera, jazz, classical music, ballet, and documentary\nfilms.\ny Chicago’s commercial WGN is opening a four-man bureau\nin Washington, D.C.\ny Dickinson College has become actively associated with\n“Romper Room,” an ETV program seen by millions of pre¬\nschool children in seven countries. The Dickinson faculty will\nparticipate in the creation, development and periodic review\nof all segments of the telecasts.\ny Tele-Measurements, new owner of radio station WACE,\nChicopee, Massachusetts, says it will be pleased to make its\nfacilities available to educators in the Massachusetts area.\ny KLRN-TV, University of Texas, has been chosen by NET\nto act as production agency for the first nationwide TV ap¬\npearance of the Houston Symphony Orchestra.\ny KUSD AM-TV and the University of South Dakota were\nhosts to the third radio-television workshop for religious\nbroadcasting sponsored by the South Dakota Council of\nChurches, January 27-30. Consultants for the workshop were\nprovided by the staff of KUSD AM-TV and the division of\nradio-TV of the United Presbyterian Church, U.S.A.\ny KUSD is broadcasting a series of 15 lectures recently de¬\nlivered by a military team of the Industrial College of the\nArmed Forces at a national security seminar in Sioux City,\nIowa.\ny GE and Westinghouse have agreed to guarantee installation\nand maintenance of TV equipment for schools to receive\nMPATI telecasts. Bill Fall, MPATI’s director of technical\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 119 Gregory Hall,\nUrbana, III. 61803. $5.00 a year, $7.50 including Washington Re¬\nport. Editor: Betty McKenzie. Editorial assistant: Skip Robinson.\nPhome 333-0580. Area Code 217.\nReporters:\nRegion I\nRegion II\nRegion III\nRegion IV\n—Michael Ambrosino, EEN, 238 Main St., Cambridge,\nMass.\n—Shirley Ford, WUOT, University of Tennessee, Knox-\nviNe.\n—Lou Peneguy, A'ETC, 2151 Highland Ave., Birming¬\nham, Ala.\n—McCabe Day, WVSH, School City of Huntington, Ind.\n—Richard Vogl, KTCA-TV, 1640 Como Ave., St. Paul,\nMinn.\n2\nNEWSLETTER"
}