{
  "id": "d1488-3",
  "text": "community or university ETV station. Part-time teaching\nwelcome. Married, male, 37. M.A., Ph.D. nearing com¬\npletion. Pacific Coast or Western location; salary mini¬\nmum: $9,500.\nMarch 7 Experienced ETV director with some producer ex¬\nperience seeks position with progressive ETV station.\nAge 24, married, no children. Just completed one se¬\nmester of post-graduate television studies. B.A. Auburn\nUniversity in speech. Will consider any location except\nextreme Northwest. Salary: $4800.\nMarch 8 Produce-direct and teach TV courses. Prefer college\nor university in order to work on Ph.D. Married, male, 25.\nHas worked at various commercial radio stations. Student\nassistant at college TV station; worked all production\npositions. B.S. in broadcasting, University of Florida. As\nreserve Army officer on active duty, spent two years at\nArmy's motion picture studio in various phases of mo¬\ntion picture production. Will graduate from Ohio Uni¬\nversity in August, 1964, with M.A. in radio-TV. Now\nteach three hours and direct at least three television\nprograms per week. Prefer Florida or Southeast, but will\nconsider any area. Beginning salary range: $6000-$6500.\nMarch 9 Former assistant to radio-TV coordinator of I960\nDemocratic National Convention; wide staff officer ex¬\nperience in Signal Corps, including liaison duty with\nCCTV; extensive work with members of U. S. Congress\nwith Legislative Reference Service of Library of Con¬\ngress; research knowledge of FC'C rules and regulations\nfor ETV; working experienoe in production of ETV pro¬\ngrams; M.S. in library administration; candidate for M.A.\nin broadcasting with thesis on state-wide ETV network.\nAge 29, male, single. Desires ETV/ITV administrative or\ncoordinator position in California, D.C. area, Middle\nWest, New England. Salary minimum: $7500.\nMarch 10 Ph.D. candidate seeks position in ETV, possibly com¬\nbined with teaching. 14 years experience in film and\nphotography; experience in commercial TV. Married, age\n32. Location and salary open.\nMarch 11 ETV producer-director and college instructor, mar¬\nried male, 27, wants position as educational radio or TV\nproducer-director or program manager. Experience: 5\nyears ETV and ITV, 5 years educational radio, 10 years\ncommercial radio; as documentary and dramatic director,\nannounoer, news reporter, script writer and administra¬\ntor. Ph.D. in radio-TV-film. Salary $7500. Prefers East or\nWest Coast.\nMarch 12 Commercial business (2l/2 years) and commercial\nTV production (2 years) experience; married male, 28,\nwith B.F.A., radio-TV major, speech minor. Qualified back¬\nground for consideration: (I) a TV association, (2) film\ndirector, (3) a TV related business or manufacturer. Lo¬\ncation preference: Midwest. Salary: $7500.\nMarch 13 Man seeks new challenging production position in\nTV. Network, ETV and local producing/directing expe¬\nrience, all in large eastern markets. Looking for position\nstressing creative implications anywhere in country. B.S.\nin R'-TV; candidate for M.S. in public relations and com¬\nmunications. Single male; $7000 a year minimum.\nMarch 14 Young man, well educated, desires position with\neducational broadcast station. Would prefer college FM\noperation as program director, manager, or news writer.\nGood experience and references. Also 4 years in all\nphases of educational TV.\nPOSITIONS AVAILABLE\n(In order to be considered through these channels, the reader\nmust be an Individual Member of the NAEB, with credentials\non file with the NAEB Placement Service. Non-members can\nsave time by sending the $10 annual dues and $5 Placement\nregistration fee at the time of inquiry.)\nMAR-1 Manager for new VHIF community ETV station in\nGreat Lakes region to begin operations as semi-satellite\nof large ETV station in same area. Young man desired\nwith broad experience and ambition in E!TV and instruc¬\ntional programing, production and supervision. Salary\n$7,000 and up depending upon experience.\nMAR-2 Assistant professor of radio and television at univer¬\nsity in Great Plains area. Ph.D. desired; broadcast and\nteaching experience required. Appointment effective\nSeptember I, 1964. Minimum salary $7500 for annual\n9-month appointment.\nMAR-3 Production manager to supervise program department,\nprogram development. High quality noncommercial, re¬\nligious-educational, AM-FM 5kw independent daytimer,\nowned by a Lutheran church. Cultural, good music, pub¬\nlic service, civic interest and news format. (P.M. not\nresponsible for religious features.) Salary open; position\nopen immediately. Man with capacity required.\nMAR-4 Announcer-producer to handle complete program proj¬\nects an assignment. Full time. Ample initiative and cre¬\native leeway. Reports to production manager. Must have\nclean, top voice. Salary open.\nMAR-5 Ph.D. for assistant professorship at West Coast col¬\nlege. Must have necessary background to teach courses\nin production and must be particularly strong and ex¬\nperienced in creating, producing, and directing educa¬\ntional radio and TV programs for both public consump¬\ntion and college-level closed-circuit ITV, using college\nstudents and college faculty for production crews and\ntalent. Beginning salary $7,044 for 9-month assignment,\nwith summer teaching possibility at $1,134.\nMAR-6 Graduate electrical engineer capable of designing, im¬\nproving, and maintaining radio, television and audiovisual\nsystems. Must have knowledge of solid state equipment\nand be able to work with and supervise technicians. Ex¬\ncellent retirement program. Salary open.\nMAR-7 Two producer-writers wanted for ETV station in Mid¬\nwest. One position available immediately, the other\nopening July I. Want people who can research and write\nscripts and produce them. Directing ability is desirable\nbut not necessary. Knowledge of film and theater would\nalso be advantageous. One will be assigned to write and\nproduce a number of sieries in the general women-family\narea. The other position assignment is to write and pro¬\nduce a number of different series which range from the\nhumanities to the natural and social sciences. Both peo¬\nple should have imagination, writing and producing abil¬\nity, and a willingness to work. People who cannot meet\nthese requirements should not apply. Salary: $7000.\nMAR-8 Program director who can work with elementary and\nsecondary schools, colleges, universities, and community\ngroups. This person wiould also be assistant station man¬\nager and responsible for the day-to-day operations.*\nMAR-9 Chief engineer capable of administering the engi¬\nneering department, installing, operating, and maintain¬\ning all of the equipment used in a television station.*\nMAR-10 One or two junior program directors to work with\nprojected live programs late in the summer.*\n*Positions Mar-8, 9, and I01 are at an ETV station in the\nupper Great Plains region.\nMAR-1 I Four full-time and three part-time regional service\nrepresentatives generally knowledgeable in public school\nor college level academic areas and ITV. Must be able\nto conduct meetings, hold conferences and generally\npromote use of instructional teleoourses via exchange of\nrecorded materials. Will assist in forming ITV council\nand in station programing via both ETV and commercial\nstations. Must work closely with school administration\nand curriculum personnel. Will travel large part of time.\nMidwest location. Salary plus expense and subsistence\nallowance. Open immediately.\nMAR-12 Radio-TV writer-producer. University-based educa¬\ntional radio and TV station seeks individual with dem¬\nonstrated ability to write and produce programs for\nboth media. Position includes teaching basic courses in\nradio-TV. Experience in film and promotion helpful. Po¬\nsition includes faculty status. Optional health program\nand mandatory retirement program. One month vacation.\nSalary: $7,200.\nMAR-13 Radio-television journalist. Should be able also to\nteach news-editorial courses. Instructor or assistant pro¬\nfessor rank. September, 1964. Salary: $6000-$8000 for 9\nmonths.\n4\nNEWSLETTER"
}