{
  "id": "d1656-1",
  "text": "2\nIt is expected that various plans and methods will he used for uniting members\nand stimulating interest within the regions. Sub-meetings, state-chairmen and\nvisits by members to neighbor institutions have been suggested for trial.\nThe June Newsletter will include a membership list by districts. Prospective\nmembers are urged to get membership application blanks from the regional chairmen\nor from the President’s office. Monthly reports on memberships will be made,\nCONSTITUTION CHANGES PROPOSED , , , . ..\nAssociate Memberships? It was recommended that Article II be amended by insertmg\nafter the word \"dues\" and before the statement \"the annual dues of 9 ®\nletter (A). This Section (A) to be followed by the following amendment to Article\nII. (B) The primal dues of associate members ,,shallJ^^OiL£AP-i^^• Thls 1J1\nkeeping with the practice followed in recent years without constitutional amendment.\nThis publication constitutes notification of the proposed amendment. Cuficial\naction will be taken at the 1947 fall meeting. .\nRobert Coleman, Prank Schooley and Burton Paulu comprised tne committee to\nconsider constitutional changes. It will continue its study and make a further\nreport at the fall meeting on the status of associate and active memberships.\nFM SERVICE COMMITTEE APPOINTED . .\n-A committee to determine the ways in which NAEB can test serve educational FM\nstations was set up. Members are Elmer Sulzer, Chairman; _aldo Afrk.op ^lph Steetle\nand Hilliam B. Levenson. The committee made a preliminary report and will make a\nmore complete report at the fall meeting.\nThe present\" need is for assistance to prospective FM broadcasters. A\nquestionnaire was prepared by the committee for guidance in individual cases,\nwas urged that information about prospective FM members be sent to NAEB.\nThe committee recommended that up-to-date information about the activities,\nboth AM and FM, of all members be secured. A form was prepared for such a survey.\nCLEAR CHANNEL NEGOTIATIONS , , . ,\nRichard C. Hull (ChmT)Pf. S. Morgan and Seymour Siegel, all representing day¬\ntime stations on clear-channel frequencies, constituted a committee to recommend\naction on the clear-channel problem. ^ . . . +v,„ vrr\nThe committee recommended that NAEB send the following telegram to the FCC\n\"NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS IN CONVENTION\nPETITIONS THE FCC FOR ADDITIONAL TIME FOR THE PRESENTATION CP NET'* AND\nSIGNIFICANT TESTIMONY BY MEMBER STATIONS DIRECTLY CONCERNED IN CLijAR\nCHANNEL HEARINGS\". ,\nBy resolution this action was approved and the telegram was sent.\nPAT!. MEETING ARRANGED-OCTOBER 25-2.6 . , .\nA recommendation for the 1947 autumn meeting was made by a committee consisting\nof Jim Miles (Chm.) John Blake and Dave Johnson. ,\nIt proposed that the meeting be held in Chicago on Saturday, October 25 and\nSunday October 26, which is the time just before the School Broadcast Conference\nin that city. An informal opening meeting would be held on Saturday evening, wi\nall-day sessions on Sunday, followed by a banquet on Sunday evening.\nThe recommendation was accepted by unanimous vote and the meeting will be\nheld accordingly.\nMARK YOUR CALENDAR\nFALL NAEB CONVENTION\nCHICAGO - OCTOBER 25-26 1947\nLet's all get together again!"
}