{
  "id": "d1656-5",
  "text": "- 6 -\nDIVIDE AND CONQUER\nThat was the technique which Hitler and his fanatic followers used to overrun\ntheir neighbors. They turned countrymen against their fellows to their own sorrow,\nNow we see the pattern again. Eroadcasting headlines its lead story (April 21)\n\"Durr Charges Colleagues With Laxity\". This would tend to imply serious internal\nfeuding, which a reading of the story itself fails to reveal.. It is, in fact,\nconvincing evidence that differences in opinion are a good thing-when the dis¬\nsension is based on as sound a basis as those in this case.\nIf the FCC can be split internally, it will be easier to break down its\ncreditable stand in relation to the radio rights of the American people and the\nresponsibilities of broadcasters to them. The Commission members must.not become\nmere pawns in a game. They must be permitted to work together and disagree when\nthey honestly do so-in the interests of the public they represent.\n\"Divide and Conquer\"—remember that formula well.\nHANNA-WHCU WIN AWARD\nMike Hanna has scored again! His name and that of Cornell’s .VHCU won a Peabody\nAward for \"Radio Edition of The Weekly Press\". 3am Woodside, assistant to Hanna,\ndid the quarter-hour program each Sunday, presenting comments, ideas, suggestions\nand personal items culled from the weekly papers.\nThis program was characterized as a step in the direction of bridging the gap\nbetween press and radio.\nCongratulations to WHCU.\nOBOLER ASKS\nIn reply to a call for questions from a proponent of the \"purely-for-profit-\nand business\" philosophy of radio, Arch Oboler poses a good one. He says (Variety,\nApril 26, *47)s\n»-is it not true that if a larger percentage of the same cleverness and\ningenuity Y/hich goes into entertainment was diverted into an education of our people,\nwe&would soon have an alert, informed voting majority which would make democracy\nwork on all levels, and thus fill the terrible vacuum in our national life, a void\nwhich can never be filled by ephemeral entertainment or an increase of deep-freeze\nrefrigerators or television receivers, which must be filled by giving a greater\npercentage of us the knowledge, and the opportunity of being of service in peace¬\ntime to our nation and to our Y/orld?\"\nFCC REVOKES LICENSE\nWOKO, Albany, v/ill cease operation on August 31 as the result of a.Supreme\nCourt decision that the FCC has the right to refuse to relicense a station guilty\nof misrepresentations in its reports. WOKO concealed the fact that Sam Pickard, a\nformer Federal Radio Commission member and former CBS vice-president owned 24/o of\nthe station’s stock.\nTwo years of litigation followed the FCC decision. Meanwhile Pickard sold his\nstock for $108,000.\nThis Supreme Court decision tends to strengthen the FCC power to regulate\nradio in the public interest.\nNAEB INVITES TO MEMBERSHIP EDUCATIONAL INSTITUTIONS OPERATING OR\nANTICIPATING THE OPERATION OF THEIR OWN AM OR FM BROADCASTING STATIONS.\nWRITE FOR AN APPLICATION BLANK. __"
}