{
  "id": "d1013-1",
  "text": "March 1965\n2\nPL-6\nBURT HARRISON ILL\nThe Western Radio and Television Conference and the NER-6 meetings were the\nless for the absence of Burt Harrison of KWSC. Burt had just undergone\nintestinal surgery, and could not attend. At the request of the NER-6\nmeeting, Ye Ed wrote a note to Burt, and a similar letter was sent from the\nBoard of WRTC. Bob Mott, in a recent letter, reports that Burt is well on\nthe road to recovery, and is expected back at his desk after a month or so.\nNEW WRTC BOARD AMD OFFICERS\nOf interest to all NER-6 stations is the election of new Western Radio and\nTelevision Association officers. James Loper, Director of Educational\nServices for KCET (TV), Los Angeles, is the new President; Dr. Kenneth A.\nHarwood, University of Southern California (KUSC) and Dr. Ralph Steetle,\nOregon System of Higher Education, are VP's and Mrs. Rose Blyth, California\nInstitute of Technology is secretary-treasurer. Ye Ed was elected to the\nBoard of Directors.\nANYONE FOR RADIO?\nPat Swenson, KBPS, Portland was, as of the Portland meeting, searching for\na radio producer to join the KBPS staff. KBPS is the only school-system-\noperated AM in the nation. If interested, contact Dr. Patricia Swenson,\nSupervisor, KBPS, 5b6 N.E. 12th Avenue, Portland 12, Oregon.\nNER-6 SPECIALS AVAILABLE\nThe major addresses heard at the 1965 Western Radio and Television Conference\nare available as NER-6 Specials, thanks to Ken Warren & Company of KQAC-KQAP.\nThe Keynote Address, delivered at the Opening General Session, is entitled\n’’This Changing Society,\" and was by Dr. Arthur S. Flemming, President of the\nUniversity of Oregon and former Secretary of Health, Education and Welfare.\nThe other major address available is that which was given at the Annual\nBanquet by Lawrence Laurent, TV critic for the Washington Post. Stations\nwishing to broadcast either of these addresses should send a request, plus\ntape, to: Mr. Kenneth Warren, Network Program Manager for Radio, KOAC,\nCorvallis, Oregon 97331*\nNER-6 TESTIMONY ON HIGHER EDUCATION ACT OF 1965\nIn a conference call a few days ago, Jack Summerfield and Jerry Sandler asked\neach Regional Director to submit written testimony to be presented by them\nat the House Subcommittee on Higher Education's 12 March hearings on The\nHigher Education Act of 1965. The text of the NER-6 statement is attached.\nTHEME UP TO TIME\nIf every month is as full of news as the past month has been, monthly\npublication should not be a major problem. Postponed to the next issue"
}