{
  "id": "d1013-10",
  "text": "2.\nIn the case of \"People under Communism\", the consultants have been Merle\nFainsod and Alex Xnkeles of the Russian Research Center of Harvard University,\nHarold H. Fisher of the Hoover Institute and Library, Stanford University,\nand Philip E. Mosely and Ernest J. Simmons of the Russian Institute, Columbia\nUniversity, Prof. Walter Goldschmidt of the University of California, assisted\nby Ruth Oreck, supervised the preparation of \"The Ways of Mankind.\"\nWhat have been the results for the listener?\nThe liveliest of several sample programs I have heard was \"A Word in Your Ear\"\nfrom \"The Ways of Mankind.\" Directed by Andrew Allan of the Canadian Broad¬\ncasting Corporation, this was a literate, highly informative, lively and amusing\nprogram. It had moving passages, such as the recitations of the Lord’s Prayer\nas it might have been heard 600 and 1,000 years ago. And its combining of\nhumor atith instruction was perhaps most engagingly illustrated in a passage\ndemonstrating how the Trobriand Islanders have solved the awkward problem of\nwhat to say upon first confronting a new baby. There resourceful folk simply\nremark, \"How Babyt\"\n\"Stand-In for a Kurd era?,\" in the same series, fell short of its goal, no doubt\npartly because it tried to do too much. This program attempted to acquaint the\nlistener with the complex elements of a primitive Indian ceremony involving\nconquest by hospitality, and mortal combat between individuals as a means of\naverting a more general slaughter.\n*\n\"The Music and the Dream\" from \"People Under Communism\" was more successful in\ntreating a comparably difficult subject. It indicated how the delusive \"short\ncut\" which the communists offer the Asians can be intelligently dealt with.\nThe answer, to paraphrase Supreme Court Justice William 0. Douglas (who was\nheard on the broadcast) is to understand the aspirations of the peoples of Asia\nand to help them achieve a better life.\nThe program suffered from an oversonorous narration, but gained much from the\nhandling of a passage involving the experiences of a disillustioned Chinese\nCommunist. And there was an enlightening comparison between what has happened\nin China and what can be prevented from happening in other parts of the Far and\n»Middle East.\nA common failing in several of the NAEB prog ams is the insufficient distinction\nmade between authentic, but fictional, characters and actual authorities who\nappear in person on the programs. The only series which has escaped this con¬\nfusion (aside from the purely historical Jefferson programs) is \"Voices of\nEurope.\"\nProfessor Mayer appears to be trying very hard to serve as the listener’s\nspokesman; his interviews are basic, simple, and eminently understandable.\nHaving drawn regularly on overseas sources for its broadcasts, the NAEB now\nmakes its own programs available to the CBS, the British Broadcasting Corporation,\nthe Australian Broadcasting Commission, the All-India Radio, and the Voice of\nAmerica. The association is currently engaged with CBC and BBC in producing\nan unprecedented international series of 12 programs which will attempt to\nexplain the respective foreign policies of Canada, Great Britain, and the\nUnited States..‘Also it is making plans for the U. S. distribution of transcribed\nbroadcasts of French and Italian music festivals, the ComMie Frangaise, and\nFrance’s International University of the Air."
}