{
  "id": "d1013-3",
  "text": "STATEMENT BY FRANK W. NORWOOD\nDIRECTOR, REGION VI\nA DIVISION OF THE NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nBEFORE THE SUBCOMMITTEE ON HIGHER EDUCATION OF\nTHE HOUSE COMMITTEE ON EDUCATION AND LABOR\nFRIDAY, MARCH 12, 1965\nRE: HIGHER EDUCATION ACT OF 1965 (H.R. 3220-3221)\nI am Frank W. Norwood, an Associate Professor at San Diego State College,\nSan Diego, California, and Manager of the College's educational radio station,\nKEBS (FM). I wish to enter a statement on the legislation before this\ncommittee in my capacity as a member of the Board of Directors of National\nEducational Radio, a division of the National Association of Educational\nBroadcasting. As Director for Region VI of National Educational Radio, I\nserve on the NER Board as the representative of those noncommercial educational\nstations in Arizona, Nevada, Montana, Idaho, ytah, Washington, Oregon,\nCalifornia, Alaska, and Hawaii.\nI should particularly like to direct the committee’s attention to the\nfact that many NER stations in my region, and across the nation, are operated\nby colleges and universities as instruments of continuing education and\nextension and as \"public service resources,\" and speak briefly of the\ncontributions which these stations have made, are making, and can make in the\nfuture toward achieving some of the goals of the proposed legislation.\nMany of the college- and university-owned radio stations in the United\nStates were established specifically to help meet such needs. In the Region\nwhich I represent, such stations as KWSC at Washington State University and\nKOAC at Oregon State University have been at work, extending the boundaries\nof the institutions they serve, for more than forty years.\nHere in the West, the majority of educational radio stations operate, as\ndoes our own KEBS, in the FM band. While their histories are not so lengthy,\ntheir opportunities for service are equally great. The recent growth of\nFM radio has meant that the potential audience of many of these stations is\ncomparable to those of standard (AM) broadcast stations. The price of FM\nreceivers no longer represents a barrier; table models and transistorized\nportables are now available for less than twenty-five dollars. Finally,\nFM broadcasting offers the possibility of the use of \"Subsidiary Communications\nAuthorizations,\" a technical advantage which has clear application to the goals\nset forth in Title I of this bill. I shall speak in more detail of \"SCA\" in a\nmoment.\nThe most obvious role which AM and FM educational radio stations can\nplay is alerting the communities they serve to the problems before us and\nthe opportunities for community action which seek solutions. Specialized\nprograms by radio to help to provide retraining and refresher courses are\nanother obvious possibility. In this Region, the University of Utah's KUER\n(FM) broadcasts a regular schedule of Medical Seminars for doctors in nine\nUtah hospitals. By means of two-way radio, doctors in each of these hospitals\nmay ask questions of the panelists from the College of Medicine, and\nparticipate actively in the discussions. The opportunities for wider service\nof this type, both in terms of geography and content, are now before us."
}