{
  "id": "d1013-35",
  "text": "FROM: NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n2500 Municipal Building\nNew York 7, N. Y.\nFOR RELEASE: JANUARY 18, 1954\nNEW NATIONAL ASSOCIATION OF EDUCATIONAL\nBROADCASTER’S SERIES, ’’ASIA REPORTS*', TO\nBRING HOME ORIENTAL PROBLEMS AND ASPIRATIONS\nTO AMERICAN AUDIENCE, THROUGH ON-THE-SPOT\nINTERVIEWS AND DISCUSSIONS,\nCommittee for Free Asia sends\nRobert Goralski on Four Months\nTape-recording Tour of the\nFar East\nFor the first time, Americans will have the opportunity to\nhear outstanding Asian personalities discuss their culture, history,\neconomic and social conditions and aspirations, in \"ASIA REPORTS\",\na new series of half-hour programs, featuring on-the-spot interviews\nand discussions from 10 Far Eastern countries, produced by the National\nAssociation of Educational Broadcasters, in cooperation with the\nCommittee for Free Asia, Inc., it was announced today by Graydon\nAusmus, President of NAEB.\nRobert Goralski, a staff member of the Committee for Free\nAsia, spent four months touring Japan, Korea, Taiwan (Formosa),\nHong Kong, Thailand, Indo-China, Indonesia, Malaya, Pakistan and\nCeylon tape-recording interviews and roundtable discussions. His\nvisit to Malaya coincided with the recent visit there of Vice-President\nRichard Nixon and local authorities asked Goralski to act as commen¬\ntator for a newsreel of Nixon’s tour of the country.\nSome of the persons who will participate in the \"Asia Reports\"\nseries are known to Americans, because they are outstanding leaders\nin their countries and are frequently mentioned in news dispatches.\nOthers are unknown to most Americans, but enjoy a great reputation\nIn Asia as leading educators, economists and historians. Their views,\nconstitute a fresh and instructive approach to understanding Asian\naspirations. It is the aim of the Committee for Free Asia, a private,\nnon-profit organization, to work with the people of the Far East in\ndeveloping free, democratic institutions through the participation of\nprivate citizens and non-governmental organizations."
}