{
  "id": "d1013-63",
  "text": "a detailed proposition with arguments pro and con be submitted in writing to each active\nmember and each associate member of WAEbS that there be an pie time for members to consider\nthe proposition and the arguments before a poll is taken; and that no transfer of the tape\nnetwork take place unless a substantial majority of the members is in agreement with the\nproposed action. The motion won unanimously. It was suggested that the President of the\nAssociation furnish a copy of this motion to each Director*, so that other Regions may know\nthe position of Region VI.\nHill reported that preparations for the national convention at the new Jack Tar Hotel\nin San Francisco on October 18-21, i960, were progressing well.\nStone reviewed the status of networking and exchanges of programs in several areas of\nthe country, including desires to plan and exchange video tapes of in-sehool programs.\nCrabbe described possibilities of linking KVIE with KQED, Essman offered to exchange video\ntapes, and Morris described developments in linking institutions and transmitters for ETV\nin Oregon.\nEngar described developmental experience grants by the FGC to the University of Utah\nto originate programs through low-power transmitters on UKF channels 71 and 74 in the area,\nof Halt Lake City. Applications for further similar grants may not be made until the\nCommission has considered the engineering experience with the transmitters that are to be\nactivated in the near future by the University of Utah.\nIt was moved by Crahbe and seconded by Herbold that the President of the Association\nb© requested to convey to the Federal Communications Commission on behalf of Region VI our\nwarm cxmsmendation of the Commission for its foresightedness in making developmental exper¬\nience grants for low-power UHF educational 'television broadcasting and our great interest\nin the future of low-power television as a strongly desired and needed counterpart of low-\npower non-commercial educational FM broadcasting. The motion won unanimously.\nStone reported that the Fagmson gill to provide federal funds for ETV appears to\nneed immediate support from others than the professionals and the avocationists of ETV if\nit is to progress.\nHansen stated the need of Utah State University for qualified applicants for the\npositions of television engineer and television producer. Walter said he would be pleased\nto hear of the availability of a position for a college teacher of broadcasting.\nThe meeting adjourned at 3:R5 P.M.\nUniversity of Southern California\nLos Angeles 7\nKenneth Harwood\nRadio Director, NAEb Region VI"
}