{
  "id": "d1013-92",
  "text": "If the NAEB becomes \"Their Association,\" not Association,\" then it will\ncease to occupy the position that it now does in the minds and hearts of all\nof us.\nHaving worked with the Fund for Adult Education and the Kellogg Founda¬\ntion, I realize very definitely the truth of Ausmus* statements regarding\nthe flexibility of foundation negotiations. Certainly here is the place\nwhere the utmost in latitude must always be allowed the governing body of\nany association. In all dealings with foundations we must be prepared for\nquick changes. Sometimes this may mean a reinterpretation of our basic policy.\nAs long as we have the type individuals we have on our Board and serving as\nour officers I will always believe that they will do thier best for the Asso¬\nciation and its members.\nYou know as well as I some of the problems that the Board and the Execu¬\ntive Office have had in the past, in understanding one another. The question\nof establishing policy, whether it was established by the Board, or whether\nit was established through the persistence of operations, and just what was\noperations, is a moot question. It must be decided, knowing the background\nto each individual case. Ifm happy to note that this took up a great deal\nof time in the discussion period. Nothing is any more difficult for a mem¬\nber who has not served in one of these capacities to understand than this.\nThankfully the United States is well \"organized.\" Thus if some of our mem¬\nbers have not served on the Board of the NAEB, at least they have served on\nthe board or in some executive capacity with some other organization and real¬\nize how impossible it is to check every detail with the total membership.\nI think, too, that the other question that Graydon raised more than\nlikely served as a kick-off for the fifteen or so points that were discussed\nand on which I would like to comment in detail. They are still points that\nneed further determination."
}