{
  "id": "d101-39",
  "text": "jte_Rgki of the NAEB\nAt xdd-centtiry, hmr,ica finds itself strangely uneasy® What is cor\nreputation abroad? H« strong is our leadership? Have m lost Asia? Have\nwe lost world respect? Are we too materialistic? Bow cm our educational\nsystem best be assisted by us and our tools to meet the pressures and\ncriticismsp precipitated on it (bat not caused) by Sputnik? s ,\nA few years ago, these would have seemed like strange questions for an\nassociation of educational \"station operators\" to b© talking about* For we\nwould have been expected to be praising or exercising our gadgets; micro¬\nphones, cameras, films, trick shots9 echo chambers, etc0\nI think we can refer to 1957-5B as the year the HAKB most definitely\nbegan to give evidence of having \"found itself1»wh©n it began to exhibit\nthe type of broad understanding, educational orientation, leadership, md\nconfidence in its own resources that mean that it’s now \"growing up*\"\nFor many years we had felt vaguely aware of the need for better training\nand higher standards for the people in charge of planning and producing the\nintellectual and cultural radio and IT far© on which Americans live, thrill\nor grow| or vegetate and wither® 2h 1949, with the first Allerton Seminar,\nwe held our first \"soul-searching\" sessions® Since then we have held seme\n24 national seminars and workshops, which have been attended by seme 700\nmembers of the staffs of educational stations® These people have been\nbrought together in close association with over 100 consultants of the level\nof Harold Lassuell, Hobart Redfield, Allen Nevins, and over IDO others ,\nrepresenting^ the best minds® in many problem areas, jn.g£ nation® For the\nNAEB has always felt that incest must b© avoided at all costs; We must\nconstantly expose ourselves to the best minds, and the most basic social,\neducational, economic and moral problems, of the U® S® In how wo handle\nthose problems we shall demonstrate whether or not w© have achieved Intel¬\nlectual and professional maturity, or whether we represent an essential\nservice or not,"
}