{
  "id": "d101-40",
  "text": "~2~\nIn the programs provided by NAE3 isamber stations , both in radio and\ntelevision, that maturity is being demonstrated more and more. We are\nproud not only of Jeffersonian Heritagea Ways of Mankind, People Under\nCamaanisa and our various earlier prestige series o We are equally' proud\n°f The Dead Sea Scrolls. The Creative Mlad. Pacific Portraits, and other\nseries produced by our regular members* It would have been ridiculous to\nexpect member stations to be able to turn out such uniformly high quality\nprograms a few years ago* Thanks to our program grants-in-aid (now handled\njointly with the Educational Television and Radio Canter) , standards have\nrisen —* and what seemed unrealizable goals a few years ago are now ecssaon-\nplace standard So A tradition of quality and integrity has sprouted in what\nyesterday was desert.\nIn addition to the program grants-in-aid which have assisted some 4®\nmember institutions (often indirectly) to iBsprove staff and production\nfacilities, grants-in-aid have also been given to help member institutions\nto set up and conduct workshops and seminars on their mim for teachers ,\nadministrators, producers , writers, managers and those teachers who use the\nprograms. This year 12 such workshop grants-in-aid were given. This\nsupplemented the 7 program grants-in-aid given, the J research grants-in~\naid given for new types of original research, and the seven national seminars,\nworkshops and meetings we have run ourselves since December of 1957s in\nresearch, instructional techniques and utilization, station management,\nteacher-training, engineering and recording, children® s programing, and\ncooperation with other national organizations. The NAEBfls own intensive\nworkshops, seminars and conferences (excluding Conventions and Regional\nMeetings) were attended by 203 different individuals involved in educational\nuses of T? and radio; 19 more were recipients of NAEB Scholarships, and some\n300 more studied at workshops, seminars and summer sessions supported in\npart by the NAEB Workshop Grants-in-Aid mentioned above."
}