{
  "id": "d101-41",
  "text": "-3~\nIn other words * many ©f the NAEB’s, major efforts are now devoted to\ntrainings to the development of higher and higher standards* capabilities\nand education for those who are responsible for the operation of educational\nTV and radio facilities,\nIn this respect we are all \"teachers\" or part of a teaching function\ngoing on under the banner of an educational auspice* which we represent.\nAnd* to quote Frank G, Jennings in Saturday Review. \"Teaching is a dangerous\nprofession* It deals with our children* the moat precious of our natural\nresources. It refines them into brave and wonderful adults or it grossly\ndegrades them into dull* over-aged adolescents0 Its results mold and deter¬\nmine the shape of our nation and the character of our people,\"\nPerhaps* by dint of the effort to raise the standards of all educational\nbroadcasters* we may help raise the standards that begin to be recognized\nas necessary also for ccRsaerc.ial broadcasters, We feel that the movement\nwhich we represent* in part* will be built on peoplefl not merely on dollars*\nor even on stations alone* Neither will it rise or fall on the basis of\nwhat is dons la an office in Washington* New York* Ann Arbor or Urbans,\nIn the years ahead* and In subsequent years* we feel that foundation\nsupport* from which funds for much of the above type activity has come* will\nbecome less and lass available. Therefore part of this past'year’s meetings\n(notably the one on ETV instruction) was attempted on a self-supporting\nbasis (with Purdue University) « We believe this is a sound basis* and that\nmembers* more and more, will be willing to pay their cm way for such essential\nseminars.\nPerhaps we should say a word about how we see TV as an instructional\ntool. First of all we don’t see it alone? we see it in relation to other\ntools and methods. Secondly* far from believing that TV should \"do every¬\nthing\"* we do and shall resist\\useyCh©^ of ETV for any educationally\nirresponsible purposes. We oppose its use as an evasion for the segregation"
}