{
  "id": "d101-46",
  "text": "Publ.\nNo.\nREPORTS OF WORKSHOPS AND SEMINARS (CON’T.)\nW-ll NAEB Region VI Seminar-Workshop - James S. Miles, Editor\nReport of the meeting of NAEB members in Region VI, held October\n16-17, 1953/ at the University of Oregon. February 1, 1955. 33 pp.\nPaper. $1.00\nW-12 NAEB Region I Conference\nReport of meeting of NAEB members in Region I, held April 8-9,\n1955, at the University of Massachusetts. August 15, 1955.\n38 pp. Paper. $1.00\nW-13 NAEB Third TV Production Workshop - 1955 - Edward Stasheff, Editor\nReport of the Production Workshop for persons engaged in educational\ntelevision, held at the State University of Iowa, August 14-Septem-\nber 3, 1955. 1956. 72 pp. Paper. $2.00\nW-l4 NAEB Second TV Engineering Workshop - 1955 - Cecil S. Bidlack, Editor\nReport of the engineering workshop for technical personnel in\neducational television, held at Michigan State University, Septem¬\nber 12-16, 1955. 1956. 189 pp. Paper. $2.00\nW-21 NAEB Radio and Audio Engineering Seminar - Cecil S. Bidlack, Editor\nReport of the Radio and Audio Engineering Seminar held at Allerton\nPark, University of Illinois, May 27 - June 1, 1956, for technical\npersonnel in NAEB member radio stations. July, 1956. 23 pp.\nPaper. $1.00\nW-22 NAEB TV Lighting and Staging Workshop - Hazen J. Schumacher, Editor.\nReport of the TV Lighting and Staging Workshop held at the University\nof Michigan, August 19-22, 1956, for ETV personnel actively engaged\nin lighting and staging work. February, 1957* 10 PP* Paper. 50^\nW-23 NAEB TV Program Planning Seminar - William G. Harley, Editor\nReport of the Program Planning Seminar, for personnel actively\nengaged in planning of programs for ETV stations and production\ncenters, held at the University of Wisconsin, August 26-September 1,\n1956. February, 1957* 64 pp. Paper. $1.00\nW-24 NAEB Region V Conference - Gale R. Adkins, Editor\nReport of the meeting of NAEB members in Region V, held June 14-15,\n1956, in Denver, Colorado. February, 1957* 43 pp. Paper. $1.00"
}