{
  "id": "d101-48",
  "text": "NAEB ENGINEERING COMMITTEE REPORTS\n5.\nPubl.\nNo.\nE-l No. 1 Television Equipment - Carl Menzer\nThis report covers television and radio broadcasting equipment\ndisplayed at the NARTB convention in Los Angeles, April-May, 1953.\nEmphasis is placed on the description of new equipment shown or\nannounced for the first time. An attempt is made to give as much\ninformation as possible for those educational institutions which\nplan to purchase television equipment. Prices are not quoted.\nMay, 1953* 25 pp. Paper. 50$\nE-3 No. 3 Operating Techniques for Video Recorders - Keith K, Ketcham and\nHerbert T. Krajewski\nThis report contains sections on \"The Positive Sound Track,\"\n\"Exposing the Positive Picture,\" \"Exposing the Negative Picture,\"\n\"Developing the Exposed Negative,\" \"Printing the Negative,\"\n\"Exposure Comparison,\" and \"Some Difficulties Encountered.\" July,\n1953* 11 pp. Paper. 50$\nE-4 No. k Engineering Operations Problems Based on Three Years of Operation\nfwiO-TV;'\nA survey of the problems encountered in television operations as\nobserved over a three-year period. The report contains sections\non \"Film Slide Operation,\" \"Addition of Live Net,\" and \"Addition\nof Live Studio Operation.\" November, 1953* *+ PP* Paper. 50$\nE-5 No. 5 The Theory of Video Pecording - Joseph W. Belcher\nThis report is intended as a guide to making good video recordings\nusing standard techniques. There are sections on \"Basic Theory,\"\n\"Sensitome cry,\" \"Electrical Factors Influencing Exposure,\" \"The\nNeed for Gamma Correction,\" \"Film Standards,\" and \"Sound.\" March,\n195*+• 19 pp. Paper. 50$\nE-6 No. 6 NAEB Tape Recording - Carl Menzer\nThis report was written in and effort to improve the audio quality\nof the programs supplied by the NAEB Network. There are sections\non \"Amplifier Characteristics—Electrical,\" \"Recording and Playback\nHead Maintenance and Adjustment.\" April, 195*+* 6 pp. Paper. 50$\nE-7 No. 7 AM-EM-TV Eouinroent - Carl Menzer\nThis reporb covers new equipment displayed at the NARTB Equipment\nExposition held in Washington, D. C., May 22-26, 1955. No attempt\nis made to describe equipment which has been on the market for\nsome time and with which most are familiar. Much of such equipment\nwas covered in NAEB Engineering Committee Report No. 1, issued in\n1953* Neither is any attempt made to describe equipment which\nobviously would not interest members of the NAEB. May, 1955. 7 PP*\nPaper. 50$"
}