{
  "id": "d101-82",
  "text": "Oj - «7\nREPORT OF THE NAEB RESEARCH COMMITTEE\nOctober, 1956\nThree major projects occupied the attention of the Research\nCommittee during the past year. Two of these were undertaken\nspecifically in the interest of NAEB and its members and provide\ninformation for our own use primarily. The third is one of the\nlong range projects planned a year ago but not activated until\nthis year.\nAt the convention in 1955 the Board of Directors discussed\nthe format and content of the NAEB Newsletter and whether there\nshould be any changes in this or whether a new magazine should\nbe considered. It was suggested that the membership be polled\nto learn their opinions and desires. The editors of the Newsletter\nwere especially interested in reader reactions. Our committee\nundertook this study and qiestionnaires were drawn up and submitted\nto Headquarters and to the Public Relations Planning Committee\nfor suggestions. The corrected schedules were mailed to all\nsubscribers to the Newsletter. Response was excellent, many mem¬\nbers registering comments in addition to the checked questions.\nThe results of the portion relating to the present Newsletter\nwere published in the June, 1956, issue of the Newsletter*\nA second part of this study concerned preferences should\nNAEB find it desirable to go into a different kind of magazine\nformat. This questionnaire mailed with the ©pinion ©f the\npresent format. ' Many opinions were expressed, reflecting the\nvaried interests of readers. For example the operators of radio\nstations were, as a group, interested in different features than\nteachers of broadcasting in the schools. Members of NAEB requested\ndifferent kinds of information than subscribers outside the member¬\nship. The results of this study were printed in the Newslp±.tar,\nissue of July, 1956.\nBecause President Schooley set up a special committee to\nevaluate all magazines being published in this field, the find¬\nings of our committee were turned over to the general committee\nfor their information. It is hoped that our reports saved time\nand effort to the Publications Study Committee,\nA study was undertaken to determine the extent to which\nNAEB members contribute to the programming of commercial stations\nby furnishing programs to these stations. This study was planned\nto provide specific information for some members who wished to '\nconvince their administrations of the value of operating a pro¬\nduction center. The results showed a very large contribution to\ngeneral broadcasting being made by NAEB members (Active and As¬\nsociate). The results also indicate that the old prejudice\nagainst the use of programs originating at educational institutions\nby commercial stations is being dissipated."
}