{
  "id": "d101-83",
  "text": "At a meeting of the Research Committee, in Columbus, Ohio, in\nApril, plans and procedures were worked out whereby Grants-in-aid\ncould be provided to college and university departments as a means\njof fostering Research in the field, of educational broadcasting. This\nidea had been discussed and adopted by the committee a year ago but,\nbecause funds were not available then, it could not be put into effect\nuntil now. The Board of Directors agreed to provide $1,500.CO for re¬\nsearch grants and, in addition, to cover costs of printing and mailing\nannouncements and instruction sheets. This provides a minimum of five\ngrants in the amount of $300.00 each and established the project for\nNAEB. The money is allotted to provide incidental expenses which are\noften a burden on people carrying on research for degree work. The\nbrochure was printed and mailed in September to all instutional mem¬\nbers of NAEB and to other selected lists. Applications for grants\nmust be on file by November 1st, 1956 and announcement of winners\nwill be announced by December 1st, after screening by members of the\ncommittee. There have already been a number of requests for instruc¬\ntion sheets and it is expected that this project will be a success\nthis year.\nThe Grants-in-aid for Research project is an important one in\nthe long range plans of the committee. It permits the use of manpower\nin the colleges and universities and the carrying out of desired re¬\nsearch with the expenditure of comparatively little money by NAEB.\nIt permits direction of research areas and the possibility of initia¬\nting research along lines most needed by educational broadcasters.\nThis project could be a continuing service of NAEB and, with the\nsize of individual grants being increased, could attract many par¬\nticipants. This seems a more effective way for the Research Com¬\nmittee to operate than to depend upon the individual efforts of\nmembers of the committee.\nIt is suggested that the objectives and functions of the NAEB\nResearch Committee be re-evaluated in terms of present trends. Where¬\nas this committee has been given responsibility for directing the re¬\nsearch efforts of NAEB (Gotham meeting of January, 1952), there seems\nthe possibility of duplication of effort because presently research\nis being fostered by foundations (ERTC) and by professional teaching\nand educational organizations. Our committee finds it difficult to\nplan extensive research which involves large expenditure of money\nsince such funds are difficult to secure from foundation or other\noutside sources'. The projects undertaken this year have been carried\nout under NAEB financing entirely and have been for the benefit of\nour association. None are on the ’’Grand Design” pattern. Perhaps\nthe objectives of the Research Committee should be examined and re¬\naffirmed in terms of the entire broadcasting field and NAEB in parti¬\ncular.\nRespectfully submitted,\nNAEB RESEARCH COMMITTEE\nGale Adkins\n. Raymond Cheydleur\n*'-''■''Kenneth Harwood\nLawrence Myers\nHerman H. Reramers\nRobert J. Coleman, Chairman"
}