{
  "id": "d874-20",
  "text": "14 Gregory Hall\nUrban©.9 Illinois\nJuno 13, 195?\nDr. ifeurlc© ?. Seay, Director\nDivision of Education\nW. K. Kellogg .foundation\nBattle Crook g Michigan\nDear Maurice*\nHerewith our proposed regular budget for operation of the NAEB Headquarters\nfor tbs fines! yesr July 1, 1957 - June 30, 1958, as approve<3 ty tits tliffiB Board\nof Directors*\nIt will be noted that all figures are exactly as included in this ysar*s\nbudget except for salaries la which ©csss adjustments are indicated. These\nare, however, consistent with our original proposal.\nIt is our understating that m? balance w© have remaining at the end of\nthis fiscal year will be deducted f*om tbs grant check you win issue upon\nreceiving our final financial statezasot. This will b© sent you as quickly as\nwe can expedite the closing of accounts mid th© securing of final reports frcaa\nthe University* s financial office, probably in early August. It is our under¬\nstanding also that any funds not expended during the first two years zasy be\navailable for expenditure, subject to prior budget approval of course, during\nthe 1958-59 fiscal year.\nI to say that m ©re nearly finished with the draft of cur\ncomplete annual report to you, together with the brief stxnary report you\nrequest. I hope to be abla to mail all this to you prior to ny leaving for\nvacation, July 1.\nIf there are any questions that occur to you, or if additional information\nis needed, it will ba a pleasure to provide it. If any of these questions\noccur during ay absence, please do not hesitate to contact Associate Director\nHill who is fully conversant with all financial matters, and who will\nactually be preparing the budget and financial reports, with tbs University a\nfinancial officers.\nI should Him to arefer to cos item in the proposed budget, the first item\n(Seminars $3,000.00} undar SEMINARS, TRAVEL, RESEARCH. This item is allocated\nfor e Research Seminar. However, since this sum is obviously inadequate to\nprovide the type of SeraSnar needed, you will recall that Mr. Schndsy and I\nleft with you the outline and proposed budget for a Proposed Seminar on Research\nin Educational Broadcasting, which it is proposed to bald at the Ohio State\nUniversity. If those is eny further information you need before taking action\non this special request focr an additional grant (from which the v 3,000*0® ^\nmentioned above esa be deducted if necessary), we should be very happy to provide\nit."
}