{
  "id": "d874-51",
  "text": "-3\nFrom these figures it appears that the network has passed the member¬\nship crisis brought about by increased assessment fees during the 1953-1955\nperiod. The ability of more stations to meet network costs plus the increased\nawareness of and interest in the network by these stations (as reflected in the\nmembership rise) is cause for optimism regarding the network's future.\nThe addition of a full-time engineer to our staff has resulted in increased\ntechnical quality in our tapes. The engineer is able to maintain and repair\n(when necessary) existing equipment; also, of great importance, the engineer\nis capable of constructing valuable test equipment which, if purchased on the\nmarket, would be beyond the ability of the network to buy. Recently, the\nengineer has devised a method whereby, with certain modifications, our dupli¬\ncators will be able to produce copies on ten inch (10\") reels at 15 inches per\nsecond. This development will enable the network to duplicate and distribute\ngood quality music recordings, a service long requested by member stations.\nThis is, of course, one of many illustrations of ways in which the engineer\nhas contributed to the development of better broadcasting. However, it\nserves also to indicate how every member of the network staff, from manager\nto hourly duplicator operator, is working to improve the quality and efficiency\nof network operation.\nThree NAEB member-constituted committees are directly concerned\nwith assisting network operations: the NAEB Radio Network Committee, the\nNAEB Radio Network School Committee, and the NAEB International Relations\nCommittee. In addition to other duties, all three of these committees serve\nselection and review functions for series and programs submitted for possible\nnetwork distribution. During the year July 1, 1956 - June 30, 1957, the\nRadio Network Committee handled 48 submissions, the School Committee\nconsidered 53 series, and the International Relations Committee reported\non 24 series from foreign sources. As a result of these combined 'operations."
}