{
  "id": "d874-56",
  "text": "-8<\nThe Membership Committee\nThis committee has recently undertaken a drive to increase the number\nof individual memberships in the Association. Such memberships were substan¬\ntially increased as a result of the merger of the NAEB and the Association for\nEducation by Radio-Television. Recently the committee has devised and dis¬\ntributed a special promotional brochure, briefly describing the activities of\nthe Association and pointing out the advantages of individual membership to\neducational broadcasters, in particular, and educators, in general. Promo¬\ntional material, with an explanatory letter, has been sent to the manager\nof each member station and production center to enlist the help of the managers\nin securing memberships among the members of their staffs. In addition,\nevery person, not a member, writing into Headquarters for information about\nsome phase of broadcasting is sent a promotional brochure urging him to join\nand thus insure receiving the benefits of membership and pointing out that\nsuch membership would often preclude the necessity for writing in for informa¬\ntion since such was already available in the publications of the Association.\nPromotional brochures are also distributed at meetings where educators and\nbroadcasters meet. Although it is still too early to determine the outcome of\nthis membership drive, early indications are encouraging.\nThe Foundations Committee\nThis new committee has been charged by the NAEB Board of Directors\nwith the responsibility for handling all relations with the Foundations from which\nthe NAEB now receives support or from which support might be solicited in the\nfuture. This* committee held one meeting in Urbana to discuss future activities\nof the NAEB warranting consideration by foundations, and discussions have\nsince been carried on with representatives of the W. K. Kellogg Foundation\nand the Ford Foundation.\nThe Convention Committee\nEach year the NAEB President appoints a regional committee with the\nresponsibility for planning the NAEB Convention for that year, and a local\ncommittee from the host city to work out the details for the Convention. The\nchairman of the 1957 Convention Committee has met in Urbana with the NAEB\nPresident, the Immediate Past President and members of the Headquarters\nstaff to discuss plans for the 1957 Convention. In addition, the Executive\nDirector and the Associate Director went to St. Louis, the site of the 1957\nConvention, to meet with the chairman and members of the committee.\nThe Organizational Liaison Committee\nThis committee is composed of representatives of national organizations\nwith an active interest or concern in educational broadcasting and with whom\nthe NAEB works cooperatively and exchanges materials. The organizational\nrepresentatives are asked to serve by the NAEB President, with an NAEB member\nas chairman. Although this group meets only twice a year (in connection with"
}