{
  "id": "d874-57",
  "text": "■9-\nthe NAEB Convention and the Institute for Education by Radio-TV), its existence\nenables the NAEB to work more closely with related organizations than might\notherwise be the case. The chairman of the committee is currently seeking\nto determine whether other national organizations should be included on this\ncommittee in order to widen the scope of contact.\nThe Public Relations Committee\nThis committee is concerned with the overall public relations policy\nof the Association, and, in this nespect,advises the Headquarters staff in\nsuch matters as promotional brochures, public relations in general, exhibits\nand displays, etc. Prior to the formation of a Publications Committee this\npast year, this committee was also responsible for making general recommenda¬\ntions in regard to the NAEB Newsletter. In this capacity the committee was\nvery helpful to the Newsletter editor in suggesting changes of format, em¬\nphasis, content, etc. This committee met only once during the year, in\nconnection with the NAEB Convention.\nThe Utilization Committee\nThis new committee was an outgrowth of the merger of the NAEB and the\nAssociation for Education by Radio-TV. It is concerned with the utilization,\nin the classroom, of educational radio and television. This committee has\nheld one meeting since the merger last October, in connection with the Insti¬\ntute for Education by Radio-TV. The committee was responsible for planning\nand presenting the portion of the IERT program devoted to utilization.\nThe Publications Study Committee\nThis special committee was appointed to make a comprehensive study\nof the NAEB Newsletter and Tournal and to make recommendations about\npossible changes in these periodicals as well as the general publications\npolicy of the NAEB. The Tournal was the official publication of the AERT and\nwas taken over by the NAEB as a result of the aforementioned merger. The\ncommittee recommended that the name AERT Tournal be maintained during this\nyear of transition, with the name to be changed to the NAEB Tournal with the\nfirst issue of the 1957-58 publication year in October, 1957. This committee,\nwhich met several times during the year, included members of the Toumalism\nfaculty of the University of Illinois, who served in a consultant capacity.\nThe Advisory Committee to the President of the ETRC\nThis committee was formed at the time of the creation of the Educational\nTelevision and Radio Center to serve as an advisory body to its President,\nto review Center Activities and to make suggestions intended to insure closer\ncooperation and coordination throughout the entire movement. This committee\nmet once this year, at Ann Arbor, in connection with the meeting of the ETRC\nAffiliates."
}