{
  "id": "d874-59",
  "text": "11-\nFrom January to June small improvements were made. The masthead\nwas cleared of unnecessary decoration. Page numbers grew smaller, more\nunobtrusive, and the date began appearing on each page. Almost all the de¬\npartment headings and signed columns were kept intact when the Newsletter\nchanged over to print, and specialized information is now much easier to\nfind.\nThe new Newsletter fits easily into envelopes and loose-leaf note¬\nbooks. It can be folded small or mailed flat, and its weight usually doesn't\nexceed one ounce, thus saving on postage. We feel that the new Newsletter\nis one additional evidence of the increasing maturity and professionalism of\nthe NAEB.\nThe AERT Toumal . periodical issued eight times a year. Publication of this\nTournal in small magazine format was considered desirable when the NAEB\nexamined functions of the Association for Education by Radio and Television\nwhich should be continued when the latter organization was taken over by\nthe NAEB. Beginning with the fall issue, as the NAEB Journal, it will con¬\ntinue and expand the magazine-length articles it has offered during the past\nyear. Recent issues have included several articles from abroad as well as\nreports on important experimental projects in progress, and articles by univer¬\nsity presidents and other distinguished professional educators.\nThe NAEB Educational TV Fact Sheet Service. digests of TV (and some radio)\nresearch, published periodically. Twenty-seven Fact Sheets were published\nduring fiscal 1956-57.\nThe NAEB Engineering Newsletter, issued quarterly.\nThe Academic Leader, a listing of films for ETV use, published irregularly.\nThree such reports, each listing several films, were published during the\nyear.\nThe NAEB Directory of Members. new, revised edition published July, 1356.\nThe NAEB Technical Directory, new, revised edition published February, 1957.\n\"Test Equipment Inventory,\" technical paper published February, 1957.\n\"Status of the Ampex Videotape Recorder,\" published September, 1956.\n\"Low Power Television Technical Considerations,\" February 1957 NAEB News¬\nletter Supplement.\nReport of the NAEB RADIO AND AUDIO ENGINEERING SEMINAR (May 27-June 1,\n1956, Allerton Park), published July, 1956.\nReport of the NAEB REGION V CONFERENCE (June 14-15, 1956, Denver, Colo¬\nrado), published February, 1957"
}