{
  "id": "d874-64",
  "text": "16-\npossible. Participant critiques indicate that all of them returned to their\nstations with new inspiration about educational radio, as well as specific\nprogram ideas. Certain participants recommended that such a seminar be held\nexclusively to deal with in-school radio programming* A report of this seminar\nis now being published and will soon be available from NAEB Headquarters.\nRegional Conferences\nTwo NAEB Regional Conferences were held during the past year. Nearly\none hundred members of Region III gathered at Lafayette, Indiana, January\n18-19, 1957, and those members of Region II attending the Institute for\nEducation by Radio-TV spent one day together discussing regional problems.\nFor both of these meetings the NAEB paid a portion of NAEB member expenses.\nEvidence of the intense interest of educational broadcasters, both in the work\nthey are doing and in the NAEB, is to be found in the fact that, although no\nmention of remuneration of any kind was made in the announcement of the\nRegion III meeting, nearly one hundred persons took part in the meeting at\nLafayette. Even institutions not yet having a station on the air, who were\nstill only applicants for NAEB membership, sent representatives to this\nmeeting. Region I, however, had scheduled a meeting for this spring, with\nno expenses to be paid by the NAEB, but conflict with other commitments and\nthe smallness of the number who indicated they could attend, resulted in can¬\ncellation of this meeting.\nMeetings in the Flannlng Stage\nAt this time the NAEB is planning two seminars which will take place\nwithin the next few months. A seminar on management problems will be held\nat Allerton Park, August 19-25, 1957, for managers of ETV stations. A Research\nSeminar is also planned for this fall, although final details have not yet been\nworked out, pending decisions on availability of funds.\nIn summary, we should like to list the workshops and seminars which\nthe NAEB has conducted to date. This list does not include the annual con¬\nventions of the Association, or its thirteen regional conferences;\n1949 - First Allerton Conference (Rockefeller)\n1950 - Second Allerton Conference (Rockefeller)\n1952 - Educational TV Workshop: Iowa State College: NAEB & JCET (FAE)\n1952 - School Broadcast Seminar (Kellogg)\n1953 — Lincoln Lodge Seminar: general planning for ETV (FAE)\n1953 - ETV Management Seminar (FAE)\n1953 - First ETV Production Workshop (FAE)\n1954 - In-School Writers Seminar (Kellogg)\n1954 - Second ETV Production Workshop (FAE)\n1954 - First ETV Engineering Workshop (FAE)\n1955 - Third ETV Production Workshop (FAE)"
}