{
  "id": "d874-65",
  "text": "-17-\n1955 - Second ETV Engineering Workshop, including kinescope emphasis (FAE)\n1956 - Radio Engineering Seminar (Kellogg)\n1956 - ETV Staging and Lighting Workshop (Ford Foundation)\n1956 - ETV Program Planning Seminar (Ford Foundation)\n1957 - Radio Program Planning Seminar (Kellogg)\nThanks to these workshops, at least in part, the leadership, manage¬\nment and staffs of educational stations in the U.S. are incomparably better,\nand better trained to meet the needs of American Education, than would have\nbeen possible otherwise.\nTHE NAEB ENGINEERING SERVICE\nThe NAEB Engineering Service was established July 1, 1954, by a grant\nfrom the Fund for Adult Education. This grant, made in February, 1954, covered\nthe operation of the service for a two-year period. Funds from the Ford Founda¬\ntion continued the operation of this service through June 30, 1957, and an addi¬\ntional grant has been requested for operation through the fiscal year ending\nJune 30, 1958. The original FAE grant, recommended by the ETRC, JCET and\nNCCET as a function which the NAEB should fulfill, stated that the NAEB Engineer\n\"will provide guidance and assistance to new television stations, to the solving\nof technical problems bound up with studio and control, the transmitter and\nfilm equipment. The engineer will concentrate on technical standards in\ntelevision, including television audio problems and camera operation.\"\nIn carrying out the functions as outlined above, the NAEB TV Engineer\nduring the past year has performed the following services:\n1. Visited ETV stations in Philadelphia, Denver, Seattle, San\nFrancisco, Miami, Minneapolis and Columbus for TV consulta¬\ntion.\n2. Visited production centers or closed circuit studios in Ann\nArbor, Lafayette, Hagerstown and New York City for TV\nconsultation.\n3. Visited radio stations at Greenville, N.C., and DeKalb,\nIllinois,for consultation and technical recommendations.\n4. Attended meetings of the NAEB Engineering Committee in\nOctober, 1956, and April, 1957.\n&. Assisted in the preparation of a report on ETV in the United\nStates for the Ford Foundation Overseas Development Program."
}