{
  "id": "d874-67",
  "text": "-19-\nProfessional Group on Broadcast Transmissions, an Active member of the\nSociety of Motion Picture and Television Engineers and a Member of the\nAudio Engineering Society, He attends the technical sessions of the annual\nmeetings of these societies, provides papers and assistance to them on request,\nand attends the Broadcast Engineering Conference of the NARTB in order to\nkeep NAEB members abreast of the latest technical developments in broadcasting\nequipment and procedures.\nRESEARCH\nThe NAEB's interest in, and contributions to, serious research into\nradio and television as educational and social forces, are both well known.\nIts six Monitoring Studies (1952-54) are standard reference works of researchers\nthroughout the world. They represent the only complete *bench-mark* record\nof the first years of television and television programming and listening in\nAmerica, as well as revealing the first objective measure of 'televiolence*\nand other tendencies and practices, some of which have now become by-words\nof the press, research scholars, and sociologists. It is therefore not sur¬\nprising that the NAEB should continue its interest in this field.\nDuring the past year, from its current Kellogg grant research alloca¬\ntion, it has launched a modest program of grants-in-aid to member stations\nto help them develop a tradition of basic, local self-evaluation, as described\nunder GRANTS-IN-AID.\nThe NAEB also established, some two years ago, a TV Research Fact\nSheet Service, providing current digests and analyses of direct instructional\nuses of television; comparable services are also provided, when possible,\nfor radio. This service is in great demand by educators abroad, as well as\nin the United States, and was greatly expanded during the past year.\nOne of the more interesting projects undertaken in the area of tele¬\nvision for direct teaching during the past year was worked out cooperatively\nwith Dr. Hideya Kumata of the Institute of Communications Research at the\nUniversity of Illinois. The results of this study have now been published\nand distributed by the ETRC, and provide the first complete inventory in the\nfield. This compilation, together with the NAEB Fact Sheets, which are issued\nat more frequent intervals, make s it easily possible for busy educators to\nsecure an accurate picture of developments in the uses of television in educa¬\ntion at virtually any given moment.\nFinally, although not research in its true sense, the activities of\nvarious other NAEB Committees have resulted in tabulations of questionnaires\nin operational problems and areas such as financing, staffing and salaries,\npractices regarding the reimbursement of faculty and staff for broadcast courses\nand appearances, etc. These materials, though not widely distributed, are\nfound to meet critical needs of members at frequently critical times. Various"
}