{
  "id": "d874-68",
  "text": "-20-\nreports to us indicate that such objective materials as these and our Fact\nSheets have been responsible in whole or in part for swaying decisions\nmany times in favor of greater use of radio and television as instruments\nof American education in its best sense,and in many instances for securing\nthe activation of both radio and television educational frequencies.\nAs the year ends, the NAEB hopes for funds with which to assemble\nthe educational TV and radio research directors of the nation for an intensive\nseminar needed to give new direction and impulse to research in this impor¬\ntant area. The need for responsible, educationally-valid research, as\nopposed to irresponsible studies and reports now only too frequently en¬\ncountered, is too obvious to belabor in this report. It is the hope of the\nNAEB Research Committee that such a seminar as it intends to conduct\nwill go far towards eliminating present duplications and repetitions in\nthis area, and will chart long-term plans to provide thorough studies in\nmany now-neglected aspects of educational radio and television uses.\nPLACEMENT SERVICE\nLong before the actual establishment of the Educational Television\nand Radio Placement Service, the need became apparent for a central agency\nto handle employment applications and to locate qualified personnel. In\naddition to the numerous letters coming to local station managers, the\noffices of the major organizations assisting educational broadcasting\nwere deluged with letters, data sheets and resumes from individuals\ndesiring employment. To these offices also came requests from employers\nwho, unable to sift all of the applications sent to them, turned to the\nnational organizations for assistance.\nThe NAEB Educational Television and Radio Placement Service was\nofficially opened on May 1, 1954, as a central employment agency for educa¬\ntional radio and television. Its establishment was made possible by a\ngrant from the Fund for Adult Education, on the recommendation of the\nJoint Council on Educational Television (JCET), the National Citizens\nCommittee for Educational Television (NCCET), and the Educational Tele¬\nvision and Radio Center (ETRC) • It has been continued during the last\nyear under a grant from the Ford Foundation.\nAlthough not all educational television and radio employees and\nemployers as yet use this service, since it takes considerable time for\nsuch an office to become firmly established, it is Increasingly serving\nits purpose in assisting stations to find better-trained personnel. Thereby\nit is also serving the broader national purpose of increasing professionalism\nthroughout the educational broadcasting movement.\nAs the year ended, the Placement Service had a file of some two hun¬\ndred and seventy-five active registrants • In all except the technical area\nit could meet promptly the need of potential employers and station managers"
}