{
  "id": "d874-69",
  "text": "21\nfor increasingly well-trained staff members • Each week more people use\nthis service.\nIn view of the closed-circuit, low-power TV, and recently increased\nFM educational station activity and interest in the U. S. in recent months,\nin addition to the steady need of new and operating educational radio and\ntelevision stations, the Placement Service is expected to serve an increasing\nneed in the months and years ahead.\nMANAGEMENT CONSULTATION SERVICE\nFrom the inception of this service, in 1954, with funds from the FAE,\nlater renewed from the Ford Foundation, Mr. M. S. Novik, NAEB Management\nConsultant, has provided critically needed assistance to ETV stations in\nSt. Louis, Pittsburgh, San Francisco, Boston, Houston, Madison, and\nChicago. More recently he has assisted in consultations with officials of\nthe Metropolitan Educational Television Association in New York and Memphis\nETV Station WKNO, and has had correspondence with the manager of Detroit\nETV Station WTVS. He has also met with virtually all ETV Station managers\nin regional meetings and NAEB management conferences. In all cases,\nencouraging progress is noted in working out what could become serious\nlabor-management problems if adequate guidance were not available. *\nThis service was inaugurated as a function of the NAEB on the joint\nrecommendation of the JCET, ETRC, and the then extant NCCET, to solve a\ntwo-fold problem. First, to assist new ETV stations, particularly of the\ncommunity type, as opposed to the college or university-based type, in\nareas which previously had had no educational broadcasting facilities or\nexperience; to secure from unions and other local groups an understanding\nof the fiscal and staff problems of ETV as a special type of station. If\ncommercial scales and conditions were enforced or insisted on by such\ngroups, many ETV stations could not survive.\nSecondly, labor support needed rallying behind ETV and educational\nradio as a nationally-needed movement. Considerable industry support had\nalready been secured, largely through the efforts of the NCCET. Industrial\nand commercial donors in Chicago, Pittsburgh, St. Louis, Alabama, Seattle\nand other areas had made large gifts to the movement. Equivalent support\nfrom labor was needed, however, if total, balanced national support was to\nbe guaranteed.\nSince labor represents such a large segment of the American popula¬\ntion, Mr. Novik‘s efforts to secure labor support have brought new strength\nto the stations involved. He has also developed the union recognition we\nhad hoped for, of ETV as something quite different from commercial television\nin its financial resources and special needs for freedom in a frequently in¬\nstructional framework."
}