{
  "id": "d874-71",
  "text": "-23-\nWe should also like to mention at this point the excellent and alert\nsupport provided to the NAEB and its membership by its Washington legal\ncounsel, Cohn and Marks. This firm has served the NAEB for many years,\nuntil recently without fee, and presently for a very modest one which is\nprovided from Association receipts from dues. Without the assistance\nprovided by them in the many allocations, customs, postal, and other\nareas too numerous to list here, educational broadcasting, the NAEB, and\nmany of its member stations would be on far less solid ground than they\nare today.\nACTIVITIES AND RECOGNITION\nAs will be noted under ORGANIZATIONAL RELATIONS, where addi¬\ntional details are given for various awards and appointments received by the\nNAEB and its staff, officers and members, this year brought many new evi¬\ndences of steady progress.\nIn addition to the various Peabody, Sylvania, National Safety Council\nand other program awards received by NAEB members, the NAEB entry was\nagain this year the winner, in international competition, of the million-lire\nPrix Italia Award, The Prix Italiana, for the best radio documentary submitted\nin the European and U. S. entries. At the International Exhibition held at\nthe Institute for Education by Radio and Television, at Columbus, Ohio, in\nMay, 1957, NAEB station entries won eighteen of the fifty-seven first awards\ngiven in radio and twelve of the thirty-five first awards given in television.\nAlthough this is somewhat less of a sweep than last year when NAEB member\nentries won twenty-one of the fifty-nine radio first awards and eleven of the\nthirty-seven television first awards, this is still most gratifying in the face\nof the financial, talent and technical resources available to the national\nnetworks, commercial stations, and foreign systems entered in this competi¬\ntion.\nThere was a great increase during the year in addresses by NAEB staff,\nofficers and members at other organizations* conventions, listings in various\nWho*s Who publications, and consultation requests. The extent to which\nNAEB-authored contributions are beginning to appear in print, in proceedings\nof the ACE and its various Conferences, in Tournalism Quarterly, the ACPRA\nQuarterly and other publications in the U. S., as well as in such foreign\npublications as the German Rundfunk und Fernsehen, the Journal of Radio\nItaly, the European Broadcasting Union Bulletin (Geneva), the World Radio\nHandbook and others, is also worthy of note in this connection. Most of\nthe principal textbooks in the field of educational broadcasting are also\nby NAEB members and leaders."
}