{
  "id": "d874-73",
  "text": "-25\naudio-visual methods in education, and this year was elected to the Executive\nCommittee of this Commission.\nHe represented the NAEB at a meeting of the Institute for International\nEducation in connection with a UNESCO meeting in Chicago, to discuss further\npersonnel exchange plans, and handled itinerary planning of various foreign\nscholars for the IEE during the past year.\nDuring the past year, also, the American Association for the Advance¬\nment of Science, in conjunction with the National Academy of Science,\ncalled a meeting in Washington to consider uses of the various media in\npresenting more information about scientific advances, the teaching of\nscience, and interesting more young people in science as a career. The\nAssociate Director represented the NAEB at this meeting and he later con¬\nducted a survey for the AAAS, to determine what programs about science are\ncurrently being broadcast by educational television stations.\nv\nWith the Executive Director he attended a special staff training\nseminar conducted by ETV station KETC, St. Louis. He also appeared on\nthe panel which opened the ETV workshop held in Toledo, a workshop which\nwas partially financed by a grant-in-aid from the NAEB. He also represented\nthe NAEB at a meeting of the Illinois Speech Association and took part in its\nprogram devoted to uses of educational radio and television.\nIn the technical area, the NAEB Engineer also contributes to NAEB re¬\npresentation nationally. He was recently appointed to membership on Panel\nFour (Propagation Data) of the Television Allocations Study Organization\n(TASO). He is a Senior Member of the Institute of Radio Engineers, a member\nof its Professional Group on Broadcast transmission Systems, an Active Member\nof the Society of Motion Picture and Television Engineers, and a member of\nthe Audio Engineering Society. During the year, he served as technical\nconsultant to the Ford Foundation on an international project. He attends the\ntechnical sessions of most of the technical societies in the field, has given\npapers before them, and represents the NAEB at the Broadcast Engineering\nConferences of the National Association of Radio and Television Broadcasters.\nElected, unpaid officers of the NAEB also represent the organization\nand are receiving recognition which is a credit to the entire movement.\nPresident Burton Paulu, whose book British Broadcasting was published\nin December, 1956, is rapidly orienting himself in his new position. Reviews\nof his new book have applied to it such phrases as: \"Scholarly but not\npedantic, sympathetic but not prejudiced** (Broadca sting - Telecasting);\n\"eminently readable English** (Annals of the Academy of Political and Social\nScience); \"as comprehensive and as fair as one could wish it to be** (European\nBroadcasting Union Bulletin). As chairman of the NAEB-ETRC liaison committee,\nand as a member of the JCET, Dr. Paulu seeks to orient all NAEB relations in\na genuinely educational and professional manner. As an educator, Fulbright\nScholar and broadcaster. Dr. Paulu is rapidly winning favorable recognition\nfor himself and the NAEB alike."
}