{
  "id": "d874-74",
  "text": "-26-\nThe contributions to educational broadcasting of the NAEB's Vice Presi¬\ndent and former President, Richard B. Hull, are also well-known. He has\nbeen one of the nation*s outstanding educators in the field of broadcasting\nfor many years, was the first Executive Director of the JCET, has served\nUNESCO in many capacities through the years, and has been active as a\nconsultant to, and a member of the Board of, the Educational Television\nand Radio Center.\nFormer President Schooley, besides serving as a member of the NAEB\nAdvisory Committee to the President of the Education Television and Radio\nCenter, and Chairman of the NAEB Foundation Relations Committee, is a\nmember of the Fulbright Advisory Committee for broadcasting, and has served\nas a consultant to the Ford Foundation on an international project. He is also\na member of the *People-to-People* Broadcasting Committee, which is a part\nof the People-to-People Foundation's efforts to bring about greater understanding\nbetween the peoples of all nations. He has represented the NAEB at ACE,\nJCET, Music Educators, and numerous other conferences.\nLast April he was the recipient of a special award for distinguished\nservice and leadership in educational broadcasting, given by the Institute\nfor Education by Radio and Television. He also addressed the last annual\nconvention of the National Association of Radio and Television Broadcasters,\nis a former President of the University of Illinois AAUP, and is active in\nvarious other organizations, such as the Association for Education in Journalism\nThe election of former NAEB President, Seymour Siegel, to preside at\nthe past year's Prix Italia Conference, in Italy, is only one of numerous other\nrecognitions bestowed upon him—many of them by the governments of various\nEuropean nations, in tribute to his efforts in the area of international under¬\nstanding and good will. These illustrate the recognition achieved by only a\nfew of NAEB*s leaders and officers.\nGratifying, too, are the increased number of distinguished educators\nwho are joining NAEB ranks as educational television and radio gain acceptance\nand support, and the new generation of TV and radio educators, whom the NAEB\nis now able to assist in securing training, through scholarship programs and its\nnumerous workshops, seminars and other services. We believe that increasing\nrecognition, at these younger levels, will be apparent in future reports.\nORGANIZATIONAL RELATIONS\nListed below are the principal organizations and associations with which\nwe have had close relations during the past year;"
}