{
  "id": "d874-76",
  "text": "-28-\nACBB: The American Council for Better Broadcasters\nIhe Executive Director this year, for the first time in three years, was\nnot moderator for the ACBB's annual convention. However, we provided articles\nand many other kinds of assistance to this group. NAEB member (active on\nNAEB Committees),George C. Johnson, is this organization's new President.\nSee also NAFBRAT.\nACE: The American Council on Education\nThe Executive Director has represented the NAEB at all major confer¬\nences of the ACE during this year, works closely with the ACE's television\ncommittee, and his remarks at the ACE conference to draft recommendations\nto the President's Commission on Education Beyond the High School were\nquoted in some length in the published proceedings of this special conference.\nThe NAEB staff has also hosted and arranged itineraries for several foreign\nscholars at the request of the ACE.\nACPRA: The American College Public Relations Association\nThe Executive Director addressed the 1956 annual convention of this\ngroup. His address was published in the Association's first issue of its\nnew magazine, PRIDE. We have also been useful in other ways, including\nassisting with plans, now being implemented, to set up a radio-TV section\nin the Association. (In passing, NAEB influence has been instrumental in\nestablishing the recognition of ETV and educational radio as deserving of\nspecial committees and sections in other associations as well.)\nAEA: The Adult Education Association of the United States\nEach year recently this association has been given increased assist¬\nance by the NAEB. In exchange, we find their materials and guidance most\nuseful to the NAEB. The Executive Director's term as member of the Delegate\nAssembly expired this year. However, he assisted in their last convention\nand continued to serve as a member of the AEA's Field Development Committee.\nThe Associate and Executive Directors of the NAEB also co-edited the Biblio¬\ngraphy of ETV and Educational Radio published during the year by the AEA.\nAET: The Association for Education in Tournalism\nThe Executive Director has advised on conference participants. Journa¬\nlism Quarterly articles and has reviewed several books for this publication\nduring the year. Various other NAEB individuals, notably its former president,\nFrank E. Schooley, are also very active in AEJ affairs.\nAES: Audio Engineering Society\nThe NAEB's Engineering Director has presented papers before this\nnational group of which he is a member, and we regularly exchange materials\nand publications with it."
}