{
  "id": "d874-77",
  "text": "-29-\nAETA: The American Educational Theatre Association\nWe have exchanged numerous materials with this group, whose members\nin some cases have been helpful in the planning of dramatic programs for\nthe Network. Genuinely joint projects may eventually result. The NAEB\nparticipates each year in the AETA's annual conference.\nATLA: The Association of Tunior Leagues of America\nThis association, as well as its branches, has strongly supported\nvarious NAEB projects and member stations. Notable was a grant to station\nWKNO, Memphis, for the salaries of a distinguished Canadian children’s\nprogram producer-writer husband-and-wife team. Similar contributions have\nbeen made to ETV elsewhere. The League has also conducted numerous work¬\nshops for its TV and radio chairman, and we seek always to assist in such\nendeavors. (Comparable assistance is given the Junior Town Meeting League\nand others too numerous to mention here.)\nAMA: The American Medical Association\nWe have provided materials to this group for its excellent Handbooks\nin the use of radio and television. The Executive Director has also, during\nthe past year, participated in panels of the Medical Education Section of\nthe AMA, and the American Dental Association, at annual conventions of the\nACPRA (see ACPRA).\nThe American Friends Service Committee\nThis organization has during the past few years produced numerous\nseries (carried by the NAEB Network) which have won the respect of American\neducators, particularly in elementary education. Pending at present is a three-\nyear project in this area which we hope may be one of the most important and\nworthwhile offerings of the NAEB Radio Network.\nThe American Heritage Foundation\nThe NAEB and its member stations, during this past campaign year,\ncooperated in this Foundation’s efforts to promote registration and voting,\nstressing heavily the need to *‘inform oneself” as a citizen responsibility.\nThe NAEB was given a citation by the Foundation for its special efforts in\nthis connection.\nAPA: The American Psychological Association\nIn December of 1955 this association devoted a special issue of the\nAmerican Psychologist to teaching by television, using many materials we had\nsent them, and authorities we recommended. During the past year we have\ncontinued to keep the APA informed of developments in this area, as well as\nradio. We feel that cooperation with this alert group has been extremely fruit¬\nful, and it is being continued."
}