{
  "id": "d874-80",
  "text": "-32-\nETRC: The Educational Television and Radio Center\nThe NAEB is represented on the Board of the Center by this year's Vice-\nPresident. The NAEB also works with the President of the Center through\nits advisory NAEB-ETRC Liaison Committee, the chairman of which is the\nNAEB President. Areas of joint effort are too numerous to list here. Several\njoint publications have been issued. The gratifying sum of $300,000 for a\nthree-year program of production and grants-in-aid for programs for the\nNAEB Radio Network has this year been made available by the Center, from\nfunds granted by the Ford Foundation. The selection of all grantees, programs,\netc., for such grants are of course handled by the NAEB. The Center is also\nrepresented on the NAEB’s advisory Organizational Liaison Committee.\nFAE and other Ford Foundation Funds ,\nThe Fund for Adult Education, The Fund for the Advancement of Educa¬\ntion and the Ford Foundation itself are all organizations with which the NAEB\nhas friendly and constant relations. F. E. Schooley, C. S. Bidlack and\nother NAEB individuals have served as special consultants to the Ford Founda¬\ntion during the year. Fund for the Advancement Studies were reviewed and\ndistributed through the NAEB Fact Sheet Service. Funds from the Ford Founda¬\ntion made possible several TV Workshops and Seminars, Scholarships, Grants-\nin-Aid for ETV Workshops, Consultant Services, the NAEB Engineering Service\nand the NAEB Placement (employment) Service, among others. All of these\nwere begun as grants from the FAE prior to re-organization of the functions\nof the various Funds as related to the Ford Foundation itself.\nThe Fulbright Commission\nThe advisory committee of the Commission for the exchange of broad¬\ncast personnel between the U. S. and other countries is made up almost\nentirely of NAEB representatives, including its former President and its\nExecutive Director. Constant guidance and assistance are provided the\nCommission at the various levels of planning which are necessary for the\nrealization of maximum benefits from funds available to this program.\nIERT: The Institute for Education by Radio and Television\nThe President and Executive Director of the NAEB continued to serve on\nthe Committee which plans this annual Institute. NAEB Board, business, com¬\nmittee and one regional meeting were held in connection with the IERT in May\nof 1857. The NAEB Utilization Committee, continuing the function of the former\nAERT, taken over by the NAEB during the year, was responsible for the excel¬\nlent utilization and evaluation sessions which were a feature of this year’s\nInstitute.\nHE: The Institute of International Education\nDuring the past year the NAEB, upon the request of the HE, arranged\nitineraries for visits by foreign broadcast officials desiring to visit NAEB member"
}