{
  "id": "d1009-104",
  "text": "4\nFriday, July 2, 1954\nRADIO DAILY—TELEVISION DAILY:\nIBljlp\ntsi£-\nBy HAL PERSONS\nNEW DISC\nPERSONALITY\nMITZI\nMASON\nSINGS\nWHO\nCAN\nSAY?\nB/W\nSO\nMUCH\nMORE\nMGM 11760 — 78 rpm\nK 11760 — 45 rpm\nLAERTES MUSIC\n1650 Broadway, N. Y. C.\n• • • TIN PAN ALLEY GAZETTE . . . July seems to\nbe Jubilee Records month. A year ago the indie label hit it\nbig with “Crying In The Chapel.” Now the same group that\nmade that one, The Orioles, has another chapel song, “In the\nChapel in the Moonlight.” The platter hasn’t been released yet,\nbut Jerry Blaine, has gotten orders for 62,000 by playing the\nacetate for the distributors over the phone. . . . Joni James\nwill guest on “The Arthur Murray Show,” Tuesday, July 6.\n. . . The forthcoming Walt Disney flicker, “20,000 Leagues\nUnder the Sea” will include a song, “A Whale of a Tale,”\npublished by Disney’s BMI affiliate, Wonderland Music.\n★ ★ ★\n• • • The girl who sings the Hunts Tomato Sauce com¬\nmercials, Peggy King, has been signed by Columbia Records.\n. . . Roger Coleman’s Decca release to be shipped July 12, will\nbe impregnated with “L’Amour, Toujours L’Amour” perfume.\nThat’s the name of the song Roger has cut on one of the sides.\nIt’ll be a welcome switch for record librarians who will be\nable to save their eyes by sniffing out the platter.\n★ ★ ★\n• • • RECOMMENDED RECORDS ... HE IS A MAN,\nJill Corey, (Columbia): A very interesting song which for¬\ngives us men for all our despicable characteristics. Makes\nlovable scamps out of us all. Well deserving of those spins.\n. . . BREAK MY HEART GENTLY, Dorothy Collins, (Audi-\nvox): A country flavored blues song, should go a long way\ntoward further enhancing Dorothy’s popularity. ... I NEED\nSOME ONE, Tommy Mara, (M-G-M): A fresh new voice in\nan appealing ballad. A gals voice used as an echo helps set\nthe record along by the effect.\n★ ★ ★\n• • • PLATTER CHATTER . . . For the first time in the\nhistory of the swank Vogue Room of the Hotel Hollenden in\nCleveland, a performer was given a standing ovation following\nher opening there. The singer, petite Dorothy Collins, who\nkicked off her Summer tour at the spot. . . . Bell Records is\nsending special 10 in. 78’s to dee jays even though their records\nare pressed and sold on 7 in. 78’s. . . . Paul Siegel publisher\nand composer, is in Philadelphia plugging his Epic etching of\n“Madalena” and his own long hair piano concerto, “Between\nTwo Worlds.” . . . RCA Victor has released an album that\nfeatures relaxation and romance, a perfect combination. It’s\nc|tle3 “Relax with Victor Herbert”' and feSthressOme of'bis\n^maltziest melodies. . . . A1 Jarvis, KFWB, Hollywood, disc\njockey, has been receiving a considerable number of requests\nfor his parody-platter on Stan Freberg’s “Point of Order.”\n★ ★ ★\n• • • “I’ll Cry Tomorrow,” the autobiography of Lillian\nRoth, is now the number three best-seller in the country.\nIt looks like she may have as much good luck with the song\nbearing the same title. She recorded it for Bob Theil on Coral.\n. . . Jack Gale formerly a platter spinner at WSRS, is now at\nWTMA, Charleston, as program director and disc jockey. . . .\nThe Broadway Palladium features a show “Magic of the\nMambo,” every Wednesday night, which stars the country’s\noutstanding mambo teams. . . . Georgia Gibbs, has been\nawarded the June “Brascar” for exquisite form on records.\nShe got it for her Mercury waxing of “Wait For Me Darlin’.”\n★ ★ ★\n• • • Sammy Kaye, had his biggest week in his current\nrun at New York’s Astor Roof this week. His record of\n“Through” and “Friends and Neighbors” for Columbia, is\ndoing nicely too.\nGOODNIGHT,\nSWEETHEART,\nGOODNIGHT\nRecorded by\nMcGUIRE SISTERS Coral\nSUNNY GALE.Victor\nGLORIA MANN. . . Jubilee\nELLA MAE MORSE Capitol\nJOHNNIE & JACK .. Victor\nSPANIELS.Wee-Jay\nPublished by\nREGENT MUSIC C0RP.\nA Summer Smash!\nLes Paul and Mary Ford\n\"I'M A FOOL\nTO CAW\n7/\nCAPITOL RECORDS\nPEER INTERNATIONAL C0RP.\n1619 Broadway N. Y. C.\nA Solid Ballad Hit!\nFrom M-G-M’s “FLAME AND THE FLESH'\nNO ONE\nBUT Y01\n1\nLEO FEIST, INC.\nI\n'JOEY\"\nBetty Madigan .\n....M-G-M\nJeri Southern ....\nMargaret Whiting .\n.. .Capitol\nArthur Norman Choir...\n......Bell\nI\nI\nLOWELL MUSIC CORPORATION\nI\nLI 619 Broadway, N. Y. C."
}