{
  "id": "d1009-118",
  "text": "Tos HAEB Board of Directors,. Research Committee, Executive Director\nFroms Frank E. Schcoley, Treasurer\nR@: Monitoring Study, New York, 1954\n1* The contract has beer awarded to Purdue Opinion Panel, with H. H. Reamers,\nDirector, for bid of $10,450«\n2. The award was made m abF.id.l of comparative bidding, and POP was the lowest\nfirm bidder,,\n3o Approval of the contract award was made by the Executive Committee, by\nunanimous vote, after Bob Coleman had forwarded oil bids to the Executive\nDirector for use of the Executive Committee. At all times we conferred with\nthe Chairman of tba Committee*\n4o ?*> brief you, th# bids came down to POP and Dallas Blythe* I talked at some\nlength with Dallas. He was unwilling to submit a fin\\ bid, he said, because\nhe was not operating a commercial research organization. He would take it\non the basis cf the past studies, and while indicating to ma the fee was not\na major consideration, in writing to Coleman he had indicated he thought\nprevious fee x>o small. He was unwilling to agree to any period less than six\nmonths for supplying manuscript report for printer. In evaluating the factors,\nit was agreeu (with Coleman concurring) that Dallas should be given the task,\nother things being equal. The Executive Committee decision In favor of POP\nwas mad© an the two factors I have indicated, but largely because of the six\nmonths f©j preparation,\n5c Other bids were in amounts of (l) $12,000 plus, (2) $19,075, and three\ndeclinations. On© institution did not reply.\n6. This decision was made 1 y the Executive Committee, by telephone vote, and\nwith each member voting without knowing how others were voting until his vote\nhad been cast. I imraodiav^ly informed Coleman, who concurred, and also\nadvised Reamers and set vp conference with him for Monday, December 7.\n7. Coleman is to advise the Research Committee members of all actions and\nprocedures. I have previously sent some information to Directors. Thit\nsupplements the previous information, which I got out under pressure ii:\norder to expedite.\n8. May I urge you to keen Mis award in confidence. It is most desirable \"hat\nthis not become general information until after the monitoring is done. 1\nshall suggest to Remmers that he see Si Siegel on his first trip to New\nYork. Remmers is planning an early trip to New Xork.\n12-7-1953"
}