{
  "id": "d1009-123",
  "text": "THIRD EDUCATIONAL TELEVISION\nPRODUCTION WORKSHOP\nSTATE UNIVERSITY OF IOWA _ AUGUST |4 - SEPTEMBER 3, 1955\nThe National Association of Educational Broadcasters will hold the Third\nEducational Television Production Workshop at the State University of Iowa, August\nlii-September 3, 1955. This Workshop is made possible by a grant from the Fund for\nAdult Education.\nPARTICIPATION. The number of participants will be limited to 30 representatives of\naccredited institutions or organizations who have an educational television station,\nwho hold a construction permit for an educational television station, who have ap¬\nplied for such a station, or who are engaged in the production of educational tele¬\nvision programs. Participants will be selected on the basis of their educational\nradio and television experience or related experience and qualifications, and on\nthe basis of the contribution to educational television which they are likely to\nmake.\na. Selection of participants will be made by the NAEB Professional Advancement Coith\nmittee.\nb. In lieu of tuition, expenses of organizing and conducting the Workshop will be\nborne by the NAEB. Participants will'receive $100.00 toward lodging and food.\nNO TRAVEL will be paid.\nc. Participants in the 1953 Production Workshop, held at the University of Illinois,\nor the 195U Workshop, held at Michigan State College, are not eligible for atten¬\ndance at the 1955 Workshop.\nAPPLICATIONS. Applications should be submitted in eight copies and should specifi¬\ncally incl.ude the following items:\na. Institution Represented: Name, TV status, and TV activities.\nb. Applicant: Name, title, present responsibilities and qualifications, and likely\nactivities and duties in the next five years.\nc. Recommendation of Superior: Name, title, and signed letter of recommendation for\nthe applicant, including information as to why this applicant was selected over\npossible other candidates.\nd. The following statement, signed, and dated, by the applicant:\n\"If accepted, I agree to attend for the full period of the Workshop. I also\nunderstand that NAEB*s contribution to the expenses involved shall not include\nany transportation and, for living expenses, shall not exceed $100.00. All per¬\nsonal expenses beyond this $100.00 will be borne by me or my institution*\"\nApplications should be mailed to Dr. Hariy Skornia, Executive Director, NAEB, lU Greg¬\nory Hall, Urbana, Illinois, and must be received not later than May 15, 1955. Suc¬\ncessful applicants will be notified by approximately June 15, 1955*"
}