{
  "id": "d1009-139",
  "text": "at a later time only on the basis of monitors written descriptions of programs.\nAll initial classifications of programs were made by the monitors with the\nassistance of supervisors.\n4) Timing of materials was made more accurate. Stop watches were used to\ntime all advertising to the nearest tenth of one minute. This procedure reduced\nsome of the error introduced by the necessity of shifting attention from the\ntelevision receiver to a wall clock. Also, preliminary tests indicated that many\nerrors were made in following the old procedure of reading elapsed advertising\ntime from the sweep second hand of a wall clock,\n5) Monitors worked in teams of two per channel at all times. Reports of\nstudies from previous years indicate that monitors sometimes found it impossible\nto record all necessary information during such fast moving moments as station\nbreaks or program openings* As noted before, upwards of five per cent of adver¬\ntising time was reported as missed for such causes. In addition to reducing the\namount of information collected, a further precaution against such errors was\ntaken in 1954 by assigning two monitors to each channel at all times. In this\nway, monitoring duties were divided so that, for example, one monitor recorded\nprimary advertising time on his watch while the other monitor recorded secondary\nadvertising time,\nA further advantage in the use of two monitors per channel came from the\ncross-stimulation between monitors. Supervisors frequently heard one monitor\nasking another, \"Did you get that violence?\" or \"Isn’t that a secondary advertise¬\nment in the background?\".\nTo a certain extent, such measures, taken to Improve the accuracy of the\nmonitoring process, actually served to make the data less comparable with past\nfindings. For example, more primary advertising and much more violence were noted\nin 1954 over previous years. Is this the result of a real trend, or of improved\nmethods, or both?\n6) All data were punched into IBM cards and analyzed by machine. By using a\ncarefully planned log sheet, the data from the study were logged in a convenient\nform for transfer to IBM cards. All major analyses were then run by tabulating\nmachines rather than by hand.\n2. An Overview of Findings\nProgram Time. On the seven New York commerical TV stations 642 hours and 46\nminutes of television were broadcast during the week of January 25 to 31, 1954*\nThis figure is 11 hours greater than it was for the week of January 4 to 10, 1953*\nNetwork stations (WNBT, WCBS-TV, WABD and WABC) added an average of nearly nine\nhours to their weekly program time since 1953, but of the indepentdent stations,\none (WATV) added 16| hours while the other two (WOR-TV and WPIX) lost an average\nof over 20 hours.\nMost of the gain in program time came in the children's hours (up nearly 14\nhours) and in the late hours (up nearly 6 hours). Some losses in the domestic\nhours offset these gains to result in the 11 hours net gain in total program tipie*\nNew York TV Programming. For the most part, the programming of New York\ntelevision has apparently stabilized during 1953 and 1954* Very few major changes\ndue to programming practices were noted.\n(2)"
}