{
  "id": "d1009-141",
  "text": "Orientation type\n4.9$\nAll\\\n'other \\\n/ information\n/ 11.3%\\\nNews \\\n6.1» \\\ni Aii\" --\nother entertain- \"\nComedy\nDrama\n11.156\nVariety\n11.036\no?\nAll\nother\nDrama\nCrime\nDrama\n13.5*\nWe stern Drama\n7.156\n/* /All 14.5$\n& V\n/ $\n/ $\n//\n/music\n/ 6.7$ \\\nFigure 2: Per Cent of total Program Time Devoted to Various Types.\nand Classes of Programs. (Advertising and public agency\ntime included in each class.)\nWhere programs for the audiences are concerned, children’s programs are\nmore concentrated in the children’s hours. In 1954, SO per cent of the children’s\nprograms were found in the so-called children's hours as against 59.4 per cent\nfor 1953. The 1953 figure represented a decrease of over thirty per cent from\nprevious years. Crime drama in 1954 makes up eight per cent of the children’s\nhours as compared with over 17 per cent in 1953.\nPrograms from the Stations. Three stations, (WCBS, WOR-TV, and WATV) con¬\ntinue to devote more than SO per cent of their broadcast time to entertainment\ntype programs. WPIX, the station with the smallest proportion of entertainment\ntime (68.156) leads all other stations in the proportion of time devoted to\ninformation type programs, (30*5/0* WCBS leads all stations in domestic programs\nwith IS.8 per cent of its total time given to the housewives, while WOR-TV lags\nfar behind with only 2.7 per cent of total time given to domestic programs.\nWATV and WOR-TV stand out as having the largest proportion (about 17 percent) of\ntheir program time devoted to children's programs. WCBS among the stations has\nproportiohally the smallest amount of children’s program time (3.4$)\nWATV and WOR-TV devote the largest proportion of broadcast time to drama\nprograms. About 6S per cent of their total time on the air is taken up by drama;\ncrime drama alone accounts for between 20 and 25 per cent of their time. On\nthese two stations, the bulk of the drama productions are in the form of old or\nimported motion pictures. WNBT devotes the smallest proportion (25.7$) of time\nto drama, but does not actually lag too far behind other stations in actual hours\nof drama program time.\n(4)"
}