{
  "id": "d1009-142",
  "text": "WNBT leads all stations in the proportion of time given to news programs\n(13.8$); this is still true after the proportion of time in Dave Garroway’s \"Today11\n(6,5$) is discounted.\nViolence on New York Television, In 1954, monitors recorded an act or threat\nof violence about every five minutes in entertainment type programs, or 13#3 acts\nor threats per hour. This figure is only a little less than twice the figure of 7.1\nacts and threats per hour obtained in 1953. A total of 6868 acts and threats of\nviolence were logged in 1954 as compared with 3,350 acts and threats in 1953.\nAlthough some of this increase may be due to improved monitoring methods as\ndescribed in the introductory paragraphs of this report, the bulk of this increase\nin violence probably was due to a more liberal interpretation of the definition of\nviolence that was borrowed from previous studies. Despite this fact, however, the\nmonitors complained at the end of the study that the amount of violence on\ntelevision was greatly understated by the definition of violence used l\nThe bulk of violence on television occurs in drama programs where, in 1954,\ntwenty acts or threats of violence were recorded in each hour of drama monitored.\nWestern drama, crime drama and comedy drama, in that order, show violence with the\ngreatest frequency. The animated cartoons for children account for most of the\nviolence in comedy drama, with an act or threat occuring every minute.\nAn innovation in the monitoring of violence was introduced in 1954 by rating\nthe context of the violence. This was done on a three point scale with the\nfollowing definitions:\nContext I: Acts or threats in sinister contexts. Acts or threats tallied\nhere are those accompanied by one or more of the following devices:\na. measured, ominous music\nb. shadowy, \"low-key\" lighting\nc. relatively clear depiction of terror or horror in\nthe actions or expressions of characters involved\nd. stealthiness of movement\ne. other devices used to create \"suspense\"\nContext II: Acts or threats not necessarily less realistic than those\nclassed as context I, but not accompanied by the devices listed above.\nContext III: All cases of sham violence such as found in comedy situations.\nTable 1 presents the results of the analysis of violence in terms of intended\naudience of program and context of violence contained in it.\n(5)"
}