{
  "id": "d1009-154",
  "text": "BIBLIOGRAPHY FOR THE QUARTER 419\nceptible to control—the authors are careful to note that not all\nthe important variables are at present susceptible to experimental\ncontrol—and the results are presented with admirable scientific\ncaution. In fact, the book reflects constantly the formal commit¬\nment of the authors to the study of theoretical issues and basic\nresearch. “It is,” they say, “to be contrasted with the greater part\nof research in this area which is of an applied or ‘action oriented’\nnature.” If practical considerations are involved at all it is “only\nto the extent that there is clear indication they will contribute\nto the formulation of important theoretical issues.”\nThis is all in the best tradition of objective science. It is clear\nthat these investigators are not solving the practical problems for\nindustry, for advertising agencies, or even for government prop¬\nagandists. There is, however, a moral dimension inescapably\npresent in any study of mass persuasion. Perhaps the best state¬\nment of this dimension is found in another monograph which is\nby way of being a classic in this field. Robert K. Merton in the\nlast chapter of Mass Persuasion: The Social Psychology of a War\nBond Drive1 puts it thus:\nHe [the social scientist] may adopt the standpoint of the positivist,\nproclaim the ethical neutrality of science, insist upon his exclusive\nconcern with the advancement of knowledge, explain that science\ndeals only with the discovery of uniformities and not with ends, and\nassert that in his role as a detached and dispassionate scientist, he has\nno traffic with values. He may, in short, affirm an occupational phi¬\nlosophy which appears to absolve him of any responsibility for the\nuse to which his discoveries in methods of mass persuasion may be put.\nThe “value-free” investigator, according to Merton, says in\neffect:\nIf these techniques of persuasion are used, then there will be (with\na stated degree of probability) a given proportion of people per¬\nsuaded to take the desired action.. .. The investigator takes no moral\nstand. He merely reports his findings, and these, if they are valid, can\nbe used by any interested groups, liberal or reactionary, democratic\nor fascistic, idealistic or power-hungry.\n‘(New York: Harper and Bros., 1946), pp. 187 ff."
}