{
  "id": "d1009-161",
  "text": "426 THE QUARTERLY\nEquipment. The author is chief engineer, Audio-Video Division,\nof the General Engineering Department, Columbia Broadcasting\nSystem.\no o o\nUtilizing the information in the record books of the Copyright\nOffice which contain the original applications for registration of\ncopyright claims, the Library of Congress has been issuing a\nseries of film catalogues. The first of these, Motion Pictures,\n1912-1999, was published in 1951. Two more have just been\npublished, Motion Pictures, 1894-1912 and Motion Pictures,\n1940—1949 (Copyright Office, Library of Congress, 1953, $2.00\nand $10.00, respectively). Together, these publications provide\na fifty-five year record of motion-picture copyrights containing\nthe descriptions of more than 76,000 films made in the United\nStates. The content of the entries varies somewhat but, in general,\nincludes the title, date, producing company, facts about the pub¬\nlished work on which the film was based, and the author of the\nscreen story. The information in the 1894-1912 volume was com¬\npiled by Lamarr Walls, former curator of the motion-picture\ncollection of the Academy of Motion Picture Arts and Sciences.\nThe 1894-1912 volume is historically the most interesting. It\nlists 8,506 works beginning with Edison Kinetoscopic Record\nof a Sneeze (“Fred Ott’s Sneeze”), registered January 7, 1894,\nand ending with The Feast of Belshazzar, copyrighted January\n23, 1913. There are many titles documenting important events\nrecorded on film: McKinley Taking the Oath (1897), Roosevelt’s\nRough Riders Embarking for Santiago (1898), Admiral Dewey\nLanding at Gibraltar (1899), Queen Victoria’s Funeral (1901),\nThe Attack on Port Arthur (1904), The Inauguration of Presi¬\ndent Roosevelt (1908), and many others. During this early period\nno copyright protection existed for films as such, and producers\nprotected their works by copyrighting contact paper prints, made\nfrom the 35-mm. film, which they deposited in the Copyright\nOffice. The films have long been lost or destroyed, but the paper"
}