{
  "id": "d1009-43",
  "text": "November 24,1953\nMr. Harry Skornia,\nNAEB Executive Director,\n14 Gregory Hall,\nUniversity of Illinois,\nUrbana, Illinois.\nDear Harryi\nReturns are beginning to come in on the requests for bids\non the New York TV Monitoring study. As I wrote you earlier\nI sent out the proposal to six agencies. On receipt of your\nadded suggestions following the Executive Board meeting last\nweek I added the three others you mentioned. I am sending\nthe correspondence from three of the agencies to you. I am\nof the opinion that, since the decision as to who does the\nJob and the matter of contract is in your hands, I should\nrelay what information I have as soon as received here.\nEnclosed are letters from NORP at the University of Chicago\nindicating their interest in the project and their willingness\nto undertake the Job. Their bid, you will note, is tl2,0G0.\nwhich does not include actual publication. I believe that a\nvisit to Chicago may help clarify this entire situation and\nthat the cost might be negotiated by personal contact.\nAlso enclosed is the bid of the Purdue Ooinion Panel, H.H.\nRemmere,Director. Dr. Remmers is a member of our committee\nand we discussed the project in detail at Norman. His bid\nfor the Job is 110,450., also not including publication cfcsts.\nAlso enclosed a letter from the Bureau of Applied Social\nResearch at Columbia University, saying that they cannot take\non the project at this time.\nPreviously I had written Dallas Smythe and had an answer from\nhim asking for his original estimates made when the proposal\nwas first drawn up. i sent these but have not heard from him\nsince. Perhaps you could contact him there and get the figures\nwithout having me act as middleman. I feel very stongly that\nDallas is best equipped to handle the study since he did the\nthree previous ones and knows the procedure and requirements\nbetter than a new agency could. That is only my personal\nopinion based on tha necessity to keep the studies uniform\nand techniques alike."
}