{
  "id": "d1009-45",
  "text": "Purdue Opinion Panel\nPURDUE UNIVERSITY\nDIVISION OF EDUCATION REFERENCE\nLAFAYETTE, INDIANA\nNovember 20, 1953\nMr, Robert J. Coleman\nChairman, NAEB Research Committee\nRadio Station WKAR\nMichigan State College\nEast Lansing, Michigan\nDear Mr, Coleman:\nIf ray memory serves me, I mentioned to you briefly at Norman, Oklahoma,\nthe fact that Dr, Benjamin Shimberg has been employed by Educational Testing\nService, Princeton, New Jersey, to develop and carry out research on TV,\nDr, Shimberg is a former student and assistant of mine who, after receiving\nhis doctorate here in 1949, was employed by the U, S, Public Health Service,\nwhere his assignment was the development and implementation of research\ndesigns to measure and evaluate the impact of various health programs carried\nout under the auspices of the U, S. Public Health Service.\nThe Educational Testing Service is, as you perhaps know, the result of\nthe amalgamation of a number of different testing services several years ago,\nincluding the American Council, the Graduate Record Examination, the College\nEntrance Board Examinations, etc. Most of the large testing programs of the\nArmed Forces are done under contract with the ETS, which has a staff number¬\ning somewhere between three and four hundred persons. It, like the NAEB, is\na non-profit organization.\nWhen Dr, Shimberg wrote me of his new assignment it occurred to me that\nit might be worthwhile to explore the possibilities of cooperation of NAEB\nand ETS. Jim Miles, with whom I discussed the matter, concurred. I therefore\nwrote Dr, Shimberg informally, making this suggestion. A copy of the letter\nI received in reply is attached.\nIt seems to me that the NAEB has nothing to lose and possibly a great\ndeal to gain if Dr. Shimberg could be made a member of our Committee. Won*t\nyou write President Ausmus your reaction to this and send me a carbon copy?\nWithin a day or two I shall send you our cost estimate of the New York\nCity monitoring project.\nIt was good to renew acquaintance with you in Oklahoma and I hope that\nwe may be able to have the physical meeting of our Committee for the purpose\nof trying to hammer out a research program.\nCordially yours.\nHHRibc\nEnclosure\nDirector"
}