{
  "id": "d1009-46",
  "text": "EDUCATIONAL TESTING SERVICE\n20 Nassau St.\nPrinceton, N. J.\nNovember 16, 1953\nProfessor H. H. Reamers, Director\nDivision of Educational Reference\nPurdue University\nLafayette, Indiana\nDear Hermans\nI was pleased to receive your letter of November 9 suggesting that we\nexplore the possibility of ETS and the National Association of Educational\nBroadcasters joining forces on problems of mutual research interest. It\nsounds like an excellent idea. I discussed it briefly with Mr. Chauncey and\nhe is anxious that I learn all I can about the activities of the NAEB Research\nCommittee and possible areas of collaboration.\nCould you send me any materials which would give me an idea of the scope\nand interests of the Committee as well as a brief run down on its current\nactivity. I'd like very much to work with the group if you can arrange an\ninvitation. This would certainly be one way to keep informed on research\nplans and to avoid wasteful duplication of effort. How often does the Committee\nmeet?\nI had hoped to spend several months travelling around the country getting\nacquainted with people in TV and learning about research activity. However,\nthe day I arrived at ETS, Mr. Chauncey tossed an interesting project my way and\nI*ve had little time for anything else since.\nThe National American Red Cross asked ETS to help them do an objective\nevaluation of an experimental program they're planning for Houston, Texas\nbeginning in February. They propose to teach their home nursing course on\nKUHT-TV for two nights a week for seven weeks (&:30-9?00 P.M.). Our experi¬\nmental design calls for three groups. The control group will be taught by the\nconventional lecture method, which requires 14 hours of work in small class\ngroups. One experimental group will watch TV and in addition get an hour a\nweek of supervised practice from a Red Cross instructor who will meet with small\nneighborhood groups. The third group will only watch TV and have no opportunity\nto participate in supervised practice.\nWe've prepared an objective written test of course content and in addition\nare working on a series of short performance tests which will measure some of\nthe important skills taught in the course. Everyone will be given a pre and a"
}