{
  "id": "d1295-2",
  "text": "NAEB\nNEWS i^TTEK.....Dec. 15, 1940-Page 3\nthose who have been active in N>vEB in expressing the hope that you\nwill continue to feel that you belong to our family circle and will\ndrop in on us, either at your individual institution, ox at an\nannual conference of the group, whenever you may find an opportunity.\nSorry to see Luke leave us. Know you feel the esme.\nNON-COMMERCIAL STATIONS PAY HAVE BOTH AlCaP aNP BMI MUSIC\nApparently the non-commercial educational and municipal stations\nwill have the privilege of using both ASGAP and BMI music after\nJanuary 1, in contrast to approximately 800 others which will\nhave both one or the other, ASCAP has announced its intention\nof allowing unrestricted use of its music for educational, re**~\nligious, and governmental purposes, proving the programs are\nnon-commercial. BUI has offered the same stations its music\nat a nominal fee. (See NEWS LETTER for December 1. }\nRADIO AND NATIONAL DEFENSE\nThe current issue of EDUCATION BY RADIO contains a discussion of\n\"Radio and National Defense\". It8 s worth reading. For further\ninformation, inquire of S. Howard Evans.\nRADIO AND THE PRINTED PAGE\nThe December ^ssue of the FREC Service Bulletin contains an article\non the objects and methods of educative research. The article is\nin the form of ouestions and answers. Questions are propounded by\nLeonard Power of the U.S. Office of Education and answers are those\nof Paul Fo Lazarsfeld, Director, Office of Radio Research, Columbia\nUniversity. A study of this article, or of the book of the same\ntitle, will be worth your time.\nRADIO IN SCHOOLS AND PCLIEGES\nJust ran across an article that was originally printed in the\nOctober.issue of SCHOOL LIFE. It is titled, \"Radio in Schools and\nColleges.\" Author is Leonard Power. Maybe you missed it,\ntoo.\nWANTED: RADIO CRITICS\nTHE PUBLIC OPINION QUARTERLY of Princeton University contains an\narticle by Robert J. Landry, the radio editor of VARIETY. Title\nof the article is, “Wanted: Radio Critics.\"\nA STATE EDUCATIONAL SYSTEM aRHEO FOR DEFENSE\nThis title is the one assigned to a series of radio programs which\nthe New Jersey State Teachers College at Newark inaugurated over\n\\70R on November 9,\nSEE VARIETY FOR DECEMBER 4C\nVARIETY for December-4, on page 26, carries a brief summary of the"
}