{
  "id": "d1295-3",
  "text": "NAKB NEWS LETTER.Dec. 15, 1940.Page 4\nactivities of some of the educational radio stations.* Mentioned were\nWHA, WRUL, WOI, WNYC, WBOW, WOSU, WRUF, ‘TILL, ana the University of\nKentucky.\nWKAR RATES A PAGE\nPICK-UPS for November carried a full-page article and a full page\nof pictures on the boost of power at Y/KAR, Michigan State College,\nFCC ACTIONS\nKFDY, 3outh Dakota State College, was given permission to stay silent\non November 28 - Thanksgiving Day to the Dakotans. (11/25/40)\nKFDY was also given authority to operate special hours on November\n21 in order to broadcast the annual eminent Fanner and Homemaker\nbanquet. (11/20/40)\nWOI, Iowa State College, was given authority to operate special\nhours on December 4, 7, and 31, in order to carry some basketball\ngames. (11/20/40)\nWO I, WHA25, Rensselaer Polytechnic Institute, and WLBL, State of\nWisconsin, were all given permission to determine operating power\nby direct measurement of antenna. (11./20/40)\nWNYC, City of New York, was given permission to operate late hours\nduring week-days in December in order to broadcast official inform¬\nation to draft boards and registrants. (12/3/40)\nWtfAD, University of Oklahoma, was authorized to operate certain\nhours and to operate others during December in order to observe\nthe Christmas vacation. (12/3/40)\nWILL* University of Illinois, was given permission to operate special\nhours during December in order to carry the Illinois basketball\ngames. (X2/S/#0)\nWBAA, Purdue University, v?as granted permission to operate certain\nnights in December in order to broadcast basketball games. (12/5/40)\nWOSU, Ohio State University, was given permission to determfe _\noperating power by direct measurement of antenna imput (12/5/40)\nY/OI was granted permission to operate specified night hours during\nJanuary in order to broadcast basketball games, (12/11/40)\nWTAW, Texas A & M, was given permission to determine operating\npower by direct measurement of antenna imput. (12/13/40)\nKWLC* Luther College, was given permission to remain silent on\ncertain days and to operate during specified hours in order to\nobserve holidays. (12/14/40)"
}