{
  "id": "d288-0",
  "text": "W. W. Charters, Honorary Director\n[. Keith Tyler, Director\nArdis Hillman Wheeler, Secretary\nTHE INSTITUTE FOR EDUCATION BY RADIO\nSponsor of\nThe American Exhibition and. Citations of Educational Radio Programs\nBureau of Educational Research\nTHE OHIO STATE UNIVERSITY\nCOLUMBUS 10\nFebruary S, 1944\nMr. Frank E. Schooley\nExecutive Secretary\nNational Association of Educational Broadcasters\nStation WILL - University of Illinois\nUrbana, Illinois\nDear Frank:\nNf Tfe are now planning the program for the Fifteenth Institute for\nj Education hy Radio which meets May 5-& at the Deshler-Wallick Hotel in\n| Columbus. We are very happy again to he able to extend a warm invitation\nto the NAEB to meet with us at the Institute. I am particularly interested\nto learn whether the organization would like to follow the usual plan or\nsomething different.\nFor the past several years, the NAEB has held a special closed session\nat the time of the section meetings which will occur this year on Saturday\nevening, May 6. The program committee of the Institute suggested that\nperhaps the NAEB would prefer to meet just previous to the Institute or to\nhave a luncheon session so that members might be free to attend other meetings\non Saturday evening. Certainly this would be feasible. The Institute will\nopen officially on Friday evening with a general session and there will be\na special pre-conference session on Friday afternoon devoted to a demonstration\nof a junior town meeting by radio. The NAEB could therefore schedule its\nmeeting almost any time on Friday with no important conflict. The AER is\nhaving its regular luncheon probably on Saturday but an NAEB luncheon could\nundoubtedly be arranged for some other day without difficulty.\nI 1 Please let me know whether or not your group wishes to have a section\n1 meeting on Saturday evening or whether you wish other meeting times listed\n/ in the urogram.ft\nKind personal regards.\nT:W\nVery cordially yours,\nI. Keith Tyler\nAn annual national conference of broadcasters, educators, and civic leaders devoted to the exchange of techniques and experiences in educational broadcasting"
}