{
  "id": "d288-3",
  "text": "JUDGES’ AWARDS FOR\nTHE SECOND AMERICAN EXHIBITION OF RECORDINGS OF\nEDUCATIONAL RADIO PROGRAMS\nMay 2-4, 1938\nSponsored by the\nNinth Institute for Education by Radio\nOhio State University, Columbus, Ohio\nI. Entries by Educational Organizations or Stations\na. For general use. Lecture, talk, speech.\nFIRST AWARD. \"Science in the News.\" Broadcast of July 15, 1937. Planned\nand produced by the University Broadcasting Council, Chicago. Speaker,\nOlan SouleC Length of program, 15 minutes. Broadcast over Station WCFL\nand the NBC Blue Network.\nb. For general use. Demonstration or participation program.\nNo award or honorable mention,\nc. For general use. Dialog, round-table conversation, interview, debate, ques¬\ntion and answer.\nFIRST AWARD. \"The Right Job.\" Broadcast of February 6, 1938. Planned\nand produced by the University Broadcasting Council, Chicago. Script writ¬\nten by J. H. Hazelhurst. Length of program, 15 minutes. Broadcast given\nover Station WGN, Chicago, and the Mutual Network, from 2:00 to 2:15 P.M.\nHONORABLE MENTION. \"The Crisis in Central Europe.\" From the University\nof Chicago Round Table series. Planned and produced by the University\nBroadcasting Council, Chicago. Length of program, 30 minutes. Program\ngiven without scripts by Harry D. Gideonse, Clifton M. Utley and Carroll\nBinder. Date of broadcast, February 27, 1938, from 12:30 to 1:00 P.M.\nE.S.T. over Station WMACL, Chicago, and the NBC Red Network.\nd. For general use. All forms of dramatization.\nFIRST AWARD. \"The Little Indian of Mexico.\" From the series, \"Brave New\nWorld.\" Planned and produced by the Educational Radio Project of the\nUnited States Office of Education. Length of program, 30 minutes. Writ¬\nten by Bernard C. Schoenfeld and directed by Irving Reis. Produced by\nprofessional cast from the project. Broadcast on January 10, 1938, from\n10:30 to 11:00 P.M. over Station WABC, New York, and the CBS Network.\nHONORABLE MENTION. \"Story of Electricity.\" From the series, \"The World\nIs Yours.\" Planned and produced by the Educational Radio Project of the\nUnited States Office of Education. Written by Peter J. Harkins, directed\nby Philip H. Cohen and produced by professional cast from the project.\nBroadcast February 27, 1938 from 4:30 to 5:00 P.M. over Station WEAF,\nNew York City, and the NBC Red Network.\nHONORABLE MENTION. \"Christ of the Andes.\" From the series, \"Brave New\nWorld.\" Planned and produced by the Educational Radio Project of the\nUnited States Office of Education. Written by Bernard C. Schoenfeld, dir-"
}