{
  "id": "d288-44",
  "text": ".Public Service Broadcasting, Room 1540\nWalter G. Preston, Jr., Assistant to the Vice President in Charge of Pro¬\ngrams, National Broadcasting Company, Chairman\nMajor Problems for Discussion\nHow can the radio station and different local organizations get to know\nand understand each other’s problems, so that more public service pro¬\ngrams, with a greater amount of listener appeal, can be built?\nWho pays program costs?\nWho has the final say as to (a) pattern of program, (b) content of program?\nWhat can be done to improve publicity and promotion disseminated by\nstation and organization?\nWhat is being done about audience building by station and organization?\nWho should be responsible for such audience building?\nWhat about length of program, type of program, content of program, pres¬\nentation and participation?\nHow can the non-commercial sponsors be made aware of their limitations\nin the entertainment field, while at the same time giving them an\nawareness of their power in the field of their specialization?\nShould cooperation with governmental agencies be treated separately from\nother organizations?\nHow important is the radio director of the organization to the success of\nthe series of radio broadcasts?\nIf a station has a chance to sell the time that is being used for an estab¬\nlished public service program, does public interest demand that it forego\nthis added income, so that the public service feature may be maintained\nintact?\nShould a station make a time-demand contract with a network that sub¬\njects public service programs on the local station to a time shift or com¬\nplete deletion on short notice?\nIs a public service program justified if it appeals to only a small group\nnumerically, providing that radio can give a service to this group that\nthe group can get no other way?\nWhat, from the regional or local point of view, are the defects in present\npublic service broadcasts?\nWhat can public service broadcasting do to assist the furtherance of gov¬\nernmental measures for the betterment of society?"
}