{
  "id": "d370-69",
  "text": "Mr. John Bums\n-2-\nMarch 6, 1961\nfrom the very best examples of American school broadcast programs. This\npresentation would be thoroughly rehearsed and polished for presentation\nbefore the team left this country. Such a professional production plus the\nteam's participation in the subsequent discussions would, we feel, combine\nto make an outstanding contribution from America, the country which has\ndone far more experimentation in in-school use of television than any\nother.\nWe have the people and the know-how to do thts job; the only thing\nlacking is the necessary funds.\nBecause of your particular interest in educational television and because\nof the outstanding role RCA has played in the development of educational\nuses of electronic equipment in this country, we believe RCA might be\ninterested in underwriting such an undertaking. We estimate that it\nwould require $10,000. to cover the production costs plus travel and\nexpenses for the team for one week.\nAs a non-profit organization representing the educational television and\nradio stations of the U.3., NAEB is uniquely qualified to do this job -\nto share with representatives of foreign broadcasting systems in our\nknowledge and experiences with school broadcasting and pass long our\nsuggestions on ways nd means in which they may employ these electronics,\ninstruments to serve the educational needs of their countries. We\nsincerely believe that we can make valuable contribution in the world\nstruggle by demonstrating American leadership in the use of broadcasting\nfor instruction, and establishing our earnest desire to share this know-how\nwith our European neighbors.\nWe are ihopefcd that you uik feel fiMbfc RCA can appropriately support\nthe NAEB in this endeavor.\nIt was good to see you again and I am looking forward to your presentation\nin Columbus at the Institute for Education by Radio-Television.\nSincerely yours.\nWilliam G. Harley\nPresident\nWGH:rkf\ncc: Mr. Leonard Marks"
}