{
  "id": "d1414-5",
  "text": "From THE NEW YORK TIMES\nSeptember 21, 1952\nEDUCATION NETWORK\nMagnetic Tape Recordings Link Seventy Stations\nBy'VAL ADAM\nA new kind of nation-wide radio network put together with magnetic record¬\ning tape is being nurtured by the National Association of Educational Broadcasters*\nSeventy stations participate in the network, all non-commercial, the vast majority\noperated by schools, universities and boards of education. Their aim is to serve and\ninform the public with programs above quiz show caliber.\nThe -N.A.E.B. has been around formally since 193b, but its tape network came\ninto existence less than three years ago. In the beginning one of its members begged\n&6Q0 from Cooper Union here for the purpose of buying magnetic tape, recording the\nschool’s forums and putting them on the air.\nThe taped program was broadcast by one educational station and then rushed\nto another, a process repeated over and over and known in the trade as \"bicycling.\"\nThe circuit completed, the tape was returned to New York, the sound '’wiped'1 off, an¬\nother Cooper Union Forum recorded, and the same piece of tape sped on its way again.\nThus was bom the N.A.E.B. tape network.\nIts operational level has climbed since then, the crowning achievement to\ndate occurring last Sunday with the debut of “The Jeffersonian Heritage'’, a thirteen-\nweek series highlighting the ideas of Thomas Jefferson and underscoring their timeli¬\nness and pertinency in 1952.\nGrant\nThe program is broadcast here on Sundays from 1 to 1:30 P.M. by WNYC, city-\nowned station and a member of the N.A.E.B., whose director, Seymour N. Siegel, is\npresident of the association. \"The Jeffersonian Heritage,\" with Claude Rains»playing\nJefferson, is one of four series of programs to be produced and presented by the\nN.A.E.B. through a &300,000 grant from the Ford Foundation’s Fund for Adult Education.\nIt was directed here by Frank Papp, a producer formerly with N.B.C.\nThe other series will include \"The Ways of Mankind,\" a study of human behav-\njv; \"International Understanding,\" which deals with people suffering under Communist\nsubjugation, and \"Public Affairs.\"\nHeadquarters for the tape network operation was originally at WNYC, but in\nJanuary, 1951, it was moved to the University of Illinois at Urbana and placed under\nthe guidance of the Division of Communications. From this point seven and one-half\nhours of taped material is mailed weekly to irember stations. Many of these programs\nare produced by the individual affiliates and offered to the network on an exchange\nbasis."
}