{
  "id": "d1414-6",
  "text": "EDUCATIONAL NETWORK (Con’t)\nThe weekly program bundle includes folk music from WMUB, Miami University,\n(Oxford, Ohio)5 a string quartet from \\JUOA, University of Alabama; a discussion\nseries from H8AA, Purdue University; the Cooper Union Forum and ’’Music for the Con¬\nnoisseur,” with David Randolph’s commentary, from TaINTC; readings from ’’Treasure\nIsland\" from KPFA, a station in Berkeley, Calif., whose listeners send in contribu*;\ntions to pay for the broadcasts; ’’Music of the Baroque” from WGBH, Lowell Institute,\nBoston; ’’The Fifteen Steps,” a children's program from WOI, Iowa State College, and\n’’Stories ’n’ Stuff,” another children’s show from WILL, University of Illinois.\nSources\nThe latter program, incidentally, is broadcast here by WNYC on Saturday\nmornings from 8 to 8:30.\nFor additional programming the tape network also draws upon a wide variety\nof sources, including the British and Canadian Broadcasting Corporations, the Univer¬\nsity of Berne in Switzerland, the Federal and Mutual Security Agencies and the United\nNations.\nFor the most part, the ’’bicycling'* of programs from one station to another\nis no longer necessary. The network’s headquarters now has a large supply of tape\nand recently installed a mass duplicator, a single mandrel machine that turns out\neleven copies of a half-hour show in ten minutes. Duplication is made backward,\nstarting with the end of the program so the reels of tape need not be rewound, thus\nsaving time and effort*.\n' The only exception of stations not being sent their own copies of a broad¬\ncast is in the case of E.B.C. programs. Tapes from England cannot be duplicated be¬\ncause of restrictions by the artists’ union there. The tape network receives twelve\ncopies of each B.B.C. program and has to “bicycle” them around the circuit.\nDay to day service to the network is supervised by Jim Miles, executive\ndirector of the N.A.E.B., who is currently on leave from Purdue, where he is director\nof WBAA .\nAlthough stations currently pay an annual service assessment fee ranging\nfrom $7^ to $200, depending on a station’s transmitter power, it was a $250,000 oper¬\national fund grant last year from the W.K. Kellogg Foundation that put the tape net¬\nwork on sound financial footing.\nThe grant is to be spent over a period of five years, at which time the\nnon-profit network, through a gradual increase in assessments, will be self-sustain¬\ning. Any commercial radio network, hard pressed by television, would gladly abolish\nsix vice presidents if it knew it could say the same five years from now."
}