{
  "id": "d1124-0",
  "text": "Volume V, Number 4\nWASHINGTON REPORT\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n1346 Connecticut Avenue, N.W., Washington, D.C., 20036\nMarch 2, jcgg\nDETAILS ON FILING COMMENTS WITH THE FCC MADE AVAILABLE\nThe NAEB Washington Office has arranged to make available to Institutional\nMembers upon request, copies of a talk given recently by Robert A. Woods of Krieger\nand Jorgensen, Washington, D.C. Mr. Wbods' remarks were given to the participants of\nthe NEA-JCEB Conference on a National Policy for Educational Television Channel Assign¬\nments, and are particularly related to filing comments in the current UHF allocation\nproceeding. The basic information, however, is pertinent to filing comments on other\nmatters and is a very helpful digest of general procedures to be followed in preparing\ninformation to be filed with the FCC. Copies are available from the Washington office\nof the NAEB.\nCONFERENCE REPORT SUMMARY AVAILABLE\nA summary of the NEA-JCEB Conference on a National Policy of Educational\nTelevision Channel Assignments has just been published by the NAEB. Copies of the\nsummary have been sent to members of the FCC, to constituent members of the Joint\nCouncil on Educational Broadcasting, to conference registrants, and to all educational\ntelevision station members of the NAEB. Additional copies are available upon request\nfrom the Washington office.\nTWO NEW ETV GRANTS ANNOUNCED BY HEW\nApproval of two grants totaling $439,375 to help activate two new educational\ntelevision stations was announced by Secretary of Health, Education and Welfare,\nAnthony J. Celebrezze. The grants are to:\nFlorida East Coast Educational Television, Inc., for $239,375 to activate and\nprovide antenna, transmitter and studio equipment for Channel 24 at Orlando, Florida,\na project costing an estimated $478,749*\nPennsylvania State University, University Kirk, Pennsylvania, for $200,000 to\nactivate and provide antenna, transmitter and studio equipment for Channel 3* Clearfield,\nPennsylvania. Total estimate of the project is $700,221. Instead of requesting\nmatching funds, the University requested a maximum giant of only $200,000.\nThe Florida station will serve Orange, Brevard, Volusia and Seminole Counties.\nThe area includes Cape Kennedy, Daytona Beach and Orlando. It is the largest metro¬\npolitan area of‘Florida currently without educational television service. Potential\naudience of the station was estimated at 750*000, including 192,000 students in 355\ninstitutions of learning.\nPenn State’s station will serve Central Pennsylvania, and is designed to\nbecome a key link in a proposed State network. The area has an estimated population\nof 895,000 and 707 institutions of learning with enrollment of 244,986.\nThirteen grants have been approved since funds for the five-year program first\nbecame available last May. The over-all approved grant total is $2,460,459* Forty-\nthree additional applications have been accepted for filing and are awaiting further\naction. The pending applications seek $7*430,377 in Federal matching funds."
}