{
  "id": "d1020-123",
  "text": "NAEB Headquarters\n1h Gregory Hall\nUrbana, Illinois\nTO:\nFROM:\nDATE:\nBoard of Directors k\nHarry J, SkorniahP \\J\nOctober 15, 19J&\nGraydon and I have just had a telephone conversation on the matter of cita¬\ntions and the honorary memberships* There seems agreement on Judith Waller*\nWe shall therefore have an honorary certificate ready for her for the ban¬\nquet, There is also general agreement on WNYC and Siegel, WHA and McCarty,\nand Frank Stanton and CBS, We shall therefore also prepare actual cita¬\ntion certificates for these three* Ruth Gordon has also been suggested\nby a couple of persons for her Youth Forum, Will you concur? If there\nis any question we can include her in the group and situation discussed\nin the next paragraph.\nIn answer to the note many suggestions came in. In addition Mrs* Bullitt\nand Mr, Storer have now been joined by the following: Abrams of Emerson,\nThe Rich Foundation, the Mott Foundation of Flint, Petersmeyer and Griffin\nof Oklahoma and others still coming in. The suggestion made by Graydon\non this is that we check these with you at our first board meeting and\npossibly tilm them from New York on Monday to see whether they could have\na representative at the Convention for the citation on Friday, Graydon\nand I had apparently independently axrived at the brilliant idea that, if\nyou agree, we could simply read a list, with short descriptions of their\ncontributions, of those civic-minded commercial, broadcasters who have sig¬\nnificantly aided the cause of educational television in America* Will try\nto get something drafted for this before leaving, and we shall bring along\ncitation certificates. The only catch is that the latter would not fit\nthis last group, unless we have all the drafting and lettering done in\nNew York*\nThe awards approved will be to WNYC and the Mayor of New York with mention\nof Siegel, and to WHA and the Wisconsin Radio Council, with mention of\nMcCarty,\nLet us have any more names that occur to you.\nHJSscp"
}