{
  "id": "d1020-4",
  "text": "£~JLJL«X\nA National Institution for Musical Education\nCollege of Music of Cincinnati\n1228 Central Parkway\nCincinnati 10, Ohio\nJanuary 9, 1954\nMr, Harry J, Skorala\nExecutive Director\nNational Association of\nEducational broadcasters\n14 Gregory Hall\nUrbana, Illinois\nDear Harry s\nI have been planning to write you for some weeks, but the Holiday rush and\nbustle was too much for me. Between the Radio-TV Arts department of the College,\nand the duties of the TV Educational Foundation'^ general manager, I am kept\non the ru^ pretty steadily.\nPerhaps you don’ t remember our conversation in St. Louis concerning some plans we\nare tvying to develop© here in Cincinnati for a short two-week TV-Radio Institute.\nThe University of Cincinnati Sumer School Dean, Dr, Sponger Shank, has appointed\na committee of three or four UC professors and myself, to com© up with some Idea\n/or Summer School Workshop in Radio-^V, to be offered by the University of Cincinnati\nin cooperation with the Radio-TV Arts Department of the College of Music of\nCincinnati.\nI have been instructed to contact you for the following Information, if you care to\ndivulge its\n1) What type of course or subject matter would your organization HAEB be interested\nin having presented in a two or three-week Radio-TV or TV Workshop this summer?\n2) Would you be able to offer several scholarships to individuals interested in this\ncourse or subjects if available in Cincinnati, so that we might have a backlog of\nfunds to help support the Workshop for this year?\nOur thinking at present is along the following lines. We anticipate a two or three-\nweek Workshop as the most likely type of offering. We are considering the Television\nfield primarily, although radio can be covered as well either in conjunction with the\nTV field or separately.\nWe are interested in such subject matter as techniques of production, writing,\nprogramming and TV equipment operation; techniques of teaching by television? problems\nof utilization of TV educational programs in the class room, as they affect the\naverage primary or secondary school teacher."
}