{
  "id": "d1020-91",
  "text": "NAE8 Board of Directors\n-2«\nJuly U*, 195U\nprograms are coming from non-station production centers, from\ngeneral, film sources, and from Canada*\n3® Contracts are being made regularly to secure additional materials*\n|«o Pees for the program sendee have been increased once and a new\nstructure is under consideration*\n5* Generous use is being made of carefully selected subject matter\nspecialist in building npackage” series around films on special\nsubjects and advice is being sought to guarantee validity of\ncontent#\nDr* Arthur Adams says you are cither on top of the job or the job is on\ntop of you* Ky reaction is that the boys at the Center are on top of the\njob* They are aware that they still have some problems to solve, but I\nhave confidence that they are going about solution of those problems in an\nintelligent,busincss-like,constriactive way* They deserve, and I am sure\nwill get, complete NAEB support#\nIII# ROCKEFELLER FOUNDATION REQUESTS. Ws have been trying for several\nyears to get the Rockefeller Foundation interested in educational broad¬\ncasting agsdn (you may recall at one time th$y made generous contributions\nto this field)* After several conferences with Mr* John Marshall, Asso¬\nciate Director of the Humanities Division, Si> George, and Lewis Hill\ndrafted a proposal for an experimental project in interpretation of poetry\nin radio, and X forwarded a request to Mr* Marshall last week in the name\nof NAEB covering this proposal* Under conditions of the request. Lew Hill\nworking with a committee of critics and authors and representatives of MSB,\nwould launch a sia months experimental project in presentation of poetry\non radio# Any programs developed under this project would be available\nfor distribution on the NAEB tape network* I made tills application without\nreferral to the Board because:\n1. X was told that Mr* Marshall was very favorably disposed toward\nthe project.\n2* There is every indication that it will be approved*\n3* I knsw no one would question the desirability of getting Rockefeller\nback in the educational broadcasting business*\nU# NAEB would receive h% for administration*\n5* It is incumbent upon us do sosrq experimentation in new techniques\nof broadcasting#\nIV. WASHINGTON OFFICE* Recent developments offer re-confirmation of my\n^JLong-eacpressed belief that NAEB must have a Washington office to guarantee\nadequate representation and adequate interpretation* Any suggestions on\nhow we can bring this about?\nTHOUGHT FOR THE DAT* Our Executive Director should have a significant\nraise*"
}