{
  "id": "d1020-98",
  "text": "Box 2008\nUniversity, Alstoi\ngeptasfcar X, 19$U\npr. Harry J. SkorrAa\nlb orogory Hall\nUni varsity of Illinois\nUsbana, IUinola\nDear lurry*\nwelcome back from your vacation and thtnka f« the material y°o\nttemmummSd and raring to go. How that you're thoroughly\nraated I will expect only hard work and en extremely chaarful attitude.\nEES sport tta^Tmortrt in the worst haat^ve everllvcd throng\nin mylife you nay expect an extremely critical and griping aeriaa\nof reactions from no.\nI do want you to know that X ham ircreasing piioe in the writfrw\nortara. IHa •specially ploaced with the ca2J.br* of prograBi\noffthjn.t*«k. J^SSon\nrfkf EcSS emoert of reprint material\n$^^Sde pSf ^ SSe. the gemral new. concerning educational\nm^o MO television. I'd like to eee for instance a special\nEach north on one radio station operation and one TV station Gyration.\nJhie sortd ham to be planned and the etaUon manager would ham to\nae^EolEl^rKs. I'd like also to sea r*>re newa of local\nSEuE SraSInEpEjocta. A letter once a month from headqnvtsn\nto eoch of*the Regional Directors asking for news of ^\nwuldtoep the Directors contacting the stations across\nrf vflflp neva flowing in# VJo need. to resasafcsr that the newsletter is\nthe onePlntiaate contact for maintaining the sense\n4m me ixsoortant to #w organisation and the sons® of being in tb® taicir#\nOur two primary functions are the network and the Bewsjtetter. E**gT~\nthing else must be of secondary importance, thei*•^Jreles\nand T would suggest that you now turn the bulk of your ener^.ea\ntorthe Usk tflukinTtha Newsletter the best source of information and\nof iceaa available in the educational broadcasting business#\nI trust you are building a eisabl® file on itasna for the Fall C^wention.\nYou and ?will hove to get together at least by the end of\noirnn tha agenda for each of the business sections in much tighter detail\nSmn ™ toTewdone. I will get a note our to coasnltte® cbaiwsn\nconcerning committee meetings and committee reports in the next day or two."
}