{
  "id": "d1668-0",
  "text": "N\nEWS\nNational Association of Educational Broadcasters\nMadison, Wisconsin - April 17, 1937\nEDUCATION BY RADIO INSTITUTE, MAY 5-5. 1957\nThe pass-word is \"On to Columbus\"1\nElaborate plans are being made to make this yearns Institute surpass even the\ngreat success of those of past years. The NAEB is glad to participate and looks\nforward to its own sessions especially.\nThe Association has arranged a general meeting on the afternoon of May 3\nand a closed business-meeting that evening.\nMembers who have not arranged for their 500 word reports in Jos. F. Wright's\nroll call in \".Educational Stations on the March\" are urged to do so at once*\nWrite to Joe, at WILL, Urbana, Ill., and tell him whether or not you*11 be at\nColumbus to report, and give him the subject you will discuss. (See March \"News-\nLetter for details)•\nA program booklet of the Institute is included in the April \"Exchange Packet.\"\nGEORGIA CREATES RADIO COMMISSION\nTo protect the State's interest in WGST, owned by the Georgia School of Tech¬\nnology and operated under lease by a company controlled by £>am Packard, CBS Vice-\nPresident, the Georgia Legislature on March 25 created the Georgia Radio Commission.\nThe Commission consists of seven members, including? the governor, president\nof the senate, speaker of the house, president of Georgia Tech, and three other\nmembers named by the governor to serve for terras of four years.\nThe bill creating the Commission was introduced when it was learned that\nHearst Radio, Inc. was negotiating with Mr. Packard for the sale of the operating\nlease.\nThe station was the gift of the late Clark Howell, Sr., publisher of the\nAtlanta Constitution, to Georgia Tech. Had the Hearst deal been completed, the\ndonor's competitor would have gained control. WGST operates commercially and\nwill now be under the jurisdiction of the newly formed Commission.\nPHILLIPS LEAVES WILL\nW. E. Phillips, member of the NAEB Executive Committee, has resigned his\npost as Chief Engineer of WILL and gone into research work. He is now in Chicago\nwith the Bendix Corporation working on the development of aviation radio commun¬\nications.\nAt WILL Mr. Phillips has been replaced by C. Joseph Ebel. Mr. Ebel is a\ngraduate of the University of Iowa, and worked with WMT, Waterloo, Iowa.\nMr. Phillips gives the assurance of his continued interest in the work of\nthe Association. The NAEB wishes him successI\nFACILITIES AND EXPANSION\nWILL - University of Illinois. The \"Illinois Extension News Messenger\" says?\nThe University of Illinois radio station, WILL, is now scheduled to change\nfrom 890 to 680 kilocycles on April 19 and to begin an enlarged program of full\ndaytime broadcasting, including special features in agriculture and home economics.\nTentative plans are to have a home economics program regularly from 10:02 to\n10:15 on Monday, Wednesday, and Friday mornings and an agricultural program from\n12:50 to 1 each afternoon except Sunday."
}