{
  "id": "d1668-3",
  "text": "- 4 -\ni+\nKFUO MEETS KSD ATTaCK\nIn response to a request for information regarding the application of KFUO,\noperated by the Concordia Theological Seminary, St. Louis, for a power and time in¬\ncrease, Director H. H. Hohenstein sends this storyr\n\"Radio Station KSD, owned and operated by the St. Louis Post-Dispatch news¬\npaper, has for years been trying to get full time on the 550-kilocycle frequency,\nwhich we have shared with them since the beginning of the station in 1924. At first\nthey tried, in a friendly way and even at their own expense, to get a different\nfrequency for us, but v.hen their efforts proved in vain, they forced the issue and\non September 5 and 4, 1956, at a hearing before the Federal Communications Commission\nat Washington, D. C., tried to convince the Government to take KFUO off the air, so\nthat they might have full timet\n\"Last summer when we were preparing for the hearing of September 5, our Wash¬\nington attorney suspected that KSD would attack us principally on two points, namely\nthat wo had not followed their example and installed a 5000 watt transmitter, and\nthat we, unlike KSD, were not a general service station, but specialized in religious\nprograms. In anticipation of these charges, we followed our attorney's advice and\nfiled an application for authorization to install a 5000 watt transmitter and utilize\nhalf time, thus requesting full equality with KSD, and sufficient time to become, to\na certain degree, a general service station. This application was filed approximately\nten days before the hearing, however, not sufficiently early to be acted upon Sep¬\ntember 5. We mentioned it during the hearing, indicating to the Federal Communica¬\ntions Commission that we had aggressive plans for the future, and informed the Ex¬\naminer that we would file a petition with the members of the Federal Communications\nCommission requesting them to withhold the Examiner's report until our application\nfor a 5000 watt transmitter and half time had been heard. This petition, though\nopposed by KSD, was granted. Our attorney feels certain that the Examiner's report,\nwhich has been ready for a long time, is favorable to KFUO,\n\"Our next hearing has been set for May 11. We feel certain that the Commis¬\nsion will grant us permission to install a 5000 watt transmitter and to utilize\nhalf time, either on the 550 Kc. frequency or on some other frequency.\"\nThis will be an interesting case to watch. Will commercialism win out — or\nwill the attacker lose prestige?\nPAYNE FAVORS TAX ON BROADCASTERS. EDUCaTIONALS EXEMPT\nCommissioner George Henry Payne, F.C.C. member, is working with Representative\nJohn J. Boylan to have a bill put through v/hich would levy a tax on broadcasting\nstations according to their power.\nThe measure would raise more than six million dollars annually by taxing\nstations up to 1000 watts $1.00 per watt, 1000 to 10,000 watt Stations would pay\n$2.00 per watt. Stations in excess of 10,000 watts would pay $5.00 per watt.\nCommissioner Payne describes the bill as \"purely a revenue measure\". Contin¬\nuing, he says, \"There has been a widespread conviction that the enormous profits\nmade by the broadcast stations more than justify a special tax, as they now enjoy\nthe use of a great national resource and it is the government that bears the burden\nof the regulation without which they could not exist. The proposed special tax\nwill be no burden on the broadcast industry as it represents less than six per cent\nof the revenue of the industry.\"\nA REMINDER\nSend your notes for the News Letter\nto: H.A. Engel, Radio Hall\nMadison, Wisconsin"
}