{
  "id": "d1750-1",
  "text": "2. WHEREAS, the planning and support of our\nconvention were enhanced by many members\nof the St. Louis community,\nTHEREFORE, BE IT RESOLVED that the\nAssociation proclaim its gratitude, and ask that\nthe convention chairman convey that gratitude\nto the teachers and administrators, the business\nand professional men, the Chamber of Com¬\nmerce and the Convention Bureau of St. Louis.\n3. WHEREAS, the National Broadcasting Com¬\npany has brightened our convention and de¬\nlighted our membership with its splendid\nhospitality,\nBE IT RESOLVED that the NAEB express to\nthe National Broadcasting Company, through\nMr. Edward Stanley, its deep appreciation.\n4. WHEREAS, the commercial broadcasters of\nSt. Louis have made an unprecedented contri¬\nbution to our convention through their hearty\nparticipation and most gracious hospitality,\nBE IT RESOLVED that the NAEB express its\nsincere thanks to the commercial broadcasters\nof St. Louis.\n5. WHEREAS, the Statler Hotel of St. Louis has\nbeen highly cooperative in providing for the\ncomplex needs of our convention, and WHERE¬\nAS, Mr. John Lodato of the hotel staff has been\nparticularly helpful to the convention commit¬\ntee,\nTHEREFORE, BE IT RESOLVED that the\nAssociation express its appreciation to Mr.\nLodato and the hotel management.\n6. WHEREAS, the convention was honored by\nthe presence of Commissioner Richard Alfred\nMack of the Federal Communications Commis-\n* sion,\nBE IT RESOLVED that the Association ex¬\npress its appreciation to Commissioner Mack\nfor his participation in our program.\n7. WHEREAS, the convention was honored by\nthe presence of Mr. Tor Gjesdal, Director of\nMass Communications of UNESCO,\nBE IT RESOLVED that the Association ex¬\npress its appreciation to Mr. Gjesdal for his\nhis participation in our program.\n8. WHEREAS, Producer William Harley and all\nthe participants in the NAEB Follies provided\nsuch probing, deft and outstanding entertain¬\nment,\nBE IT RESOLVED that the Association ex¬\npress its appreciation to all rendering services.\nDR. TYLER HONORED\nDr. I. Keith Tyler, director of the Institute for\nEducation by Radio and Television at Ohio State\nUniversity, has been honored with the NAEB 1957\nCitation of Merit. The presentation of the citation\nwas made by Raymond Hurlbert, president of the\nAlabama Educational Television Commission and\nchairman of the NAEB Awards Committee on Oct.\n31 during the Convention in St. Louis.\nThe text of the citation reads as follows:\nFor more than a quarter of a century Ohio State\nUniversity has annually attracted educators and to\nbroadcasters from many states and other lands\nto discuss and explore their problems in radio — and\nmore recently television — as they relate to education.\nTo this unique platform have come the greats and\nthe not-so-greats — the dreamers, the extremists,\nand the moderates — to exchange ideas and share\nexperiences leading to developments of national and\ninternational importance.\nThe necessity of maintaining a climate friendly to\nthe free expression of divergent views, one which en¬\ncourages controversy while minimizing conflict, has\nrequired skill and understanding of a high order.\nThese requirements are fully met in the familiar and\ntrusted key figure who has so long presided over\nthis open forum.\nIn recognition of the leadership, vision, and de¬\nvotion of the man who personifies this significant\ndevelopment in communications, the National As¬\nsociation of Educational Broadcasters proudly ac¬\ncords this 1957 Award of Merit to I. Keith Tyler.\nMEMO FROM THE EXECUTIVE DIRECTOR\n— Harry Skornia\n“The Convention was the best ever,” that seems\nto be the consensus of opinion regarding the 1957\nConvention. To Marguerite Fleming and her St.\nLouis Committee workers our respects. To the many\nat international, national and local levels who made\nit what it was, our sincere thanks.\nElsewhere in this issue you will find the list of new\nofficers. Directors for Regions I, III and V, of course,\nwill be elected later, and will be announced in the\nJanuary Newsletter and Journal.\nA few developments: From January 1 on, the\nNAEB TV Research Factsheets will be published in\nthe Journal. No longer is there any need to subscribe\nseparately. But are all members of your staffs in¬\ndividual members of the NAEB, so they’ll get their\nown copy of the Journal and other items that will\nNEWSLETTER"
}