{
  "id": "d1890-1",
  "text": "Previously Sir Hugh met with Sen. Pastore and staff to give his views\non the Ford Satellite proposal. He sustained our position that such a\nscheme would not insure nearly enough revenue to support a second service.\nPROJECTS ENDED, EXTENDED AND PROJECTED\nIn two weeks the recommendations of the third phase of our Educational\nCommunications System study will be presented to the U. S. Office of\nEducation. Present plans call for personal presentation to high level\nofficials at HEW, USOE. Copies of the full report will also be sent to\nthe Board.\nJim Miles, Purdue University, is acting Director for the concluding\nweeks of the ECS study - covering the departure of John Witherspoon who\nhas just left for Santa Barbara where he will be Associate Director for\nTelecommunications of the Brooks Foundation. (The Brooks Foundation\ncontracts for projects and studies; it does not, as the name implies,\nmake grants.)\nA three««month extension has just been received on the contract for the\nUSOE project developing six color films on the use of instructional\ntelevision. These films are being written and produced at the U. of\nTexas; three are completed, two are in the final stages of completion;\nand one is yet to be activated. The end product will be an effective\nkit for use at teacher workshops, seminars, instructional centers, and\nfor demonstrations by utilization specialists and school and station\nadministrators.\nAuthorization has been received from the High Commissioner of the Trust\nTerritory of the Pacific Islands to undertake a study in that area to\ndetermine whether television and radio can be used to improve and\nstrengthen their education systems. A Washington meeting last week with\nthe Assistant Commissioner of the Territory revealed an encouraging\nattitude toward the use of technology and a willingness to consider a\nrange of changes involving a twelve-month school program, improved\nschool facilities, new teaching roles, and more active leadership from\nthe central administration.\nThe study, to be paid for in its entirety in advance, will be conducted\nduring November and December."
}