{
  "id": "d1012-6",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nMay El, 1954\n2500 Municipal Building\nWHitehall 3-3600\nYORK 7, N. Y.\nExt. 2281\nRELEASE: TUESDAY, JUNE 1, 1954\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nTO HOLD 5 DAY SEMINAR FOR WRITERS OF IN-SCHOOL RADIO\nPROGRAMS, JUNE 7 - 11, AT ST,LOUIS, MISSOURI\nA five day NAEB In-School Writers Seminar, the primary purpose\nof which would be \"to stimulate experienced writers and writer-producers of\nin-school programs by offering opportunities for exchange of ideas”, will be\nheld in St. Louis, Missouri, June 7-11 inclusive, it was announced today\n(Tuesday, June 1, 1954) by Graydon Ausmus, President of the National\nAssociation of Educational Broadcasters.\nThe host station will be KSLH, one of the outstanding public school\nstations in the country. Marguerite Fleming, director of KSLH will be in\ncharge of arrangements.\nWriters have been selected from NAEB stations in almost every state\nin the union. These include AM and FM, university and college operated\nstations, as well as those owned by Boards of Education.\nThe Seminar Selection Committee was composed of John Henderson\nof Purdue University as Chairman; M. McCabe Day of the Huntington,\nWest Virginia public school system; Betty Girling of the Minneapolis public\nschool system; Jay Stillinger of the Cleveland public school system and\nArlene MeKeliar of the University of Wisconsin.\nHousing accommodations for those attending, as well as the seminar\nitself, was made possible by a grant from the Kellogg Foundation.\nIn a letter to those \"fellows” selected to attend the seminar, president\nAusmus described the 5-day meeting as \"among the most significant\ncontributions of the NAEB to upgrading of program levels in America”. He\nadded that outstanding writers of school programs from Canada and the\nUnited States are expected to be on hand \"to furnish leadership in helping\nto open new vistas to evaluate sample programs now on the air”.\n(more)"
}