{
  "id": "d1187-0",
  "text": "N-A-E-B\nE WS - LETTER\nAMMUiil NATIONAL ASSOCIATION OB EBUGATIQNAL BROADCASTERS AIIFIUL\nMEETiNG .Edited tSy; Rfcto4rd Bv Hull,.President . 'MEETING\nILLINOIS U. , Station WOI, Iowa State College, Ames, Iowa ILLINOIS II«\nOCT. 10-11-12 CCtT 10-11-12\n^ AUGUST 31,: 194^__; ~~ \"\nCOLLEGES TO FIGHT SEPTEMBER 20 FOR UPSTAIRS VIDEO PERMITS :\nI WASHINGTON. Aug.21 fiBillboard) Lastchance fon educational institutions, to got\ninto television broadcasting is soon now resting with the Federal Communications\nCommission's (FCC) September 20 hearing on. upstairs video. All but crowded out\nof the television field, educational institutions are expected then to push.vigor¬\nously for reservation of channels’: in the upper band, With present channels\napproaching the saturation point,-it-appears certain: that saturation of spectrum\nspace in the low band will find universities holding no more than six stations.\nBoth FCC' and the Natiohal Association- of Educational Broadcasters (NAEB) are\nworried over failure of educational institutions to get aboard the TV bandwagon\nNAEB has cited the high cost of initiating and operating a TV station as the\nchief reason for the lag of the educators, ill. this important new field. Chairman\nWayne Coy, of FCC has issued two separate invitations for educators to appear at\nnext month’s hearing'and ..request -the-’ Commission; to- set aside channels for educa-^\ntional outfits as has' been done in FM, ., V \" ■ ;\nOnly One Permit So Far\nIova.State is How the only college to hold a, video construction permit. It is set\nfor Channel 4 in Amos. ■ Five other universities have bids in, with- throe, of them\nfacing stiff.competition in hearings with commercial applicants.\nOne - uncontested bidder, State University of Iowa, has to\"get. FCC approval to\nswitch Channel 11 to Iowa City. The only other uncontested college bidder,\nCornell University, however, faces difficulty because.of .probable interference\nof the Ithaca frequency with WBEN-TV, operating in Buffalo on the same channel,\nand' with:”.TTE, • which holds'a CF for channel 5 in Syracuse. Under both...present\nand proposed allocations, Ithaca is'left'without a TV .channel.\nIn New Orleans, the bid of Loyola University has. been set for hearing, with two\nother applicants for the two remaining frequencies.. .St.Louis.University is in\na scrap with four other bidders for four open frequencies in St, Louis, while\nGeorgia Tech is in a three-way scrabble.for the lone open channel in Atlanta.\ni =\nHIGHLIGHTS IN THIS ISSUE\njSTA STOP ' ORDER \"STOPS\". DAYTIMERS....2\nNEW EDUCATION STATION—KANSAS CITY. .5\nOHIO STATE WIN RADIO NEWS AWARD.6\nim.C GRATED NIGHTTIi E EXTENSION....?\nNINE-'UNIVERSITIES. CRGANIZE UAPRE.,„'.9'\ntv facts & fancies fcr august a_w.n\nCOLUMBIA U. RADIO DRIVE AGAINST V.D.12\nKANSAS STATE'S KSAC IN RESEARCH..-...!;\nPURDUE’S WBAA— INTERNATIONAL PLAN... H\nFCC NEWS & ACT IONS (EDU CAT I ON).......17\nPLAN TO ATTEND -N-A-E-B ANNUAL MEETING OCTOBER 10-11-12 AT UNIVERSITY CF ILLINOIS\nVlCE-I\nJohn Dunn\nWNAD, University of Oklahoma\nNorman, Oklahoma\nW. I. Griffith\nWOI\nAmes, Iowa\nExecutive Secretary\nM. S. Novik\n30 Rockefeller Plaza\nNew York, N. Y.\nExecutive Committee\nSeymour Siegal, WNYC, New York Graydon Ausmus, WUOA-FM, Alabama\nCarl Menzer, WSUI, Iowa Ralph Steetle, WLSO-FM, Louisiana\nFrank E. Schooley, WILL, Illinois William Sener, KUSC-FM, California"
}