{
  "id": "d1187-17",
  "text": "-18-\nCOY YIARNS EDUCATCRS (CONT.)\n\"Radio makes it possible for an elementary school, system to makejlie^enn.ces\nof a few highly-specialized and skin fid toaohers available to cla.gsea._in scores\n^TT^Mi^fleattered over a large city. The less highly-trained^lassroom .\nteachers can ginnl. ament the radio programs.with_many types of,.Ylsual^a^ds^^This\nis\" in effect a crude form of television. This is real dollars. and_cents economy\nparading at cut-rate educationCoy stated.\n\"If education should lose out in FM it will also,lose its chance for fgggjmile\nbroadcasting.\" Coy said. calling facsimile the electronic newspap.e£^nd_the\nelectronic textbook,\nFCC AMENDS ENGINEERING STANDARDS\nTwo amendments to the FCC'a Standards of Good Engineering Practice Concerning AM\nBroadcast Stations, revised to October 30, 1947, were announced by the FCC. T e\namendments, one of which is reprinted below, should be-noted in copies of the\nStandards.\n1. Substitute the following text for the present text of Section 19, Use of\nCommon Antenna by Standard Broadcast Stations or Another Radio Station, at page\n40, columns 1 and 2 (edition revised to October 30, 1947);\n19, Use of common Antenna by Standard Broadcasting Stations or Another Radio\nStation,\nSection 3.45 (c), under certain conditions, permits the simultaneous use of\nthe same anterna or antenna structure by more than one standard broadcast station\nor by one or more standard broadcast stations and one or more stations of c.ny\nother class or service.\nPrerequisities to an authorization for, simultaneous use are:, (l) Submission of\ncomplete verified engineering data Showing that satisfactory operation of each\nstation will be obtained without adversely affecting the operation of the other\nstation; (2) Compliance with Section 3.45 (a) and (b) With respect to the minimum\nantenna height or field intensity for each standard broadcast station concerned.\n(Amendment SCEP-AM-2). Effective date: June 21, 194S.\n2. Substitute the following text for the present text of Section 26, .^^age\nSunrise and Sunset Times, at Page 46, column 1. (edition revised to October 30,1947}\n26. Average Sunrise and Sunset Times.\nNotes”'The Commission on 1S^27, 194B, adopted a revision of this “action. It is\nbeing printed as a separate pamphlet and will be available on sale at the Office\nof the Superintendent of Documents, Washington, D.C. xn the near future. Complete\ntext as revised is set forth in the daily issue of the Federal ^gi-ster for^June 5,\n1948, pages 3024, through 3035. (Amendment SGEP-AM-1.) Effective date. May 27,\n1948._____________\nSUNRISE SUNSET TABLE STATEMENTS TO .COME\nThe FCC August 19 announced that statements will_.be taken on the . table contain^\ni^^^g^i^rlFe^Hd sunset times, adopted.,.by^^r^oQay^^^ew^\ni^ qiinflfcinna that hav^ sinoo arisen. Statements or_briefs on the table may.be\nfiled with the Commission on or before September 15, the public ...not.ice said."
}