{
  "id": "d1187-18",
  "text": "-19\"\nFCC AKPLIC A^ QNeTTaJ^^^ «•■ INSTITUTIONAL\n• £50 KC' - Modification, of CP\nWRUF - University of Florida', Gainesville. Fla. - Modification of construction\npermit (B3-P-4682, which authorized change in hours,of operation, installation ■\nof new transmitter and directional antenna for night use) to make changes iff.7\ndirectional antenna system and change transmitter location from near Gainesville,\nFlorida, to 0.1 mile south of Highway. 14, west of Gainesville, Florida.. AMENDED\"\nto mount FM on N,E» tower and change type of transmitter, change transmitter\nlocation from 0.1 mile south' of- Highway 14, west of Gainesville, Florida to 1\nmile south of Newberry Highway, 5*7 miles west of. .Gainesville, Florida, and\nchange studio location from Gainesville, Florida., to University of Florida,\nGainesville, Florida.\n850 KC - CP for Power Increase\nKFUO-Evangelical Lutheran Synod of Missouri. Ohio and.Other States, Clayton, _Mo.-\nConstruction permit to increase power from 5 KV7 day to 1.0 KW day-, install new\ntransmitter and to change transmitter location from 801 De Mun Ave., Clayton,\"Mo.,\nto: To be determined Clayton, Mo. AMENDED to change power from 10 KW to 5.KW,\nchange type transmitter and change transmitter location from \"to be determined’1\nClayton, Mo., to Near U.S. 440 at Monks Mound, Maneoki Township, Ill.\n850 ICC - CP For Change of Name\n• KFUO-Evangeiical Lutheran Synod of Missouri. Ohio and Other States, Clayton,Jo^-\n^Modification of~licensfe:to change name of licensee, from Evangelical Lutheran\nSynod of Missouri, Ohio and'\" Gthe'b States to the;Lutheran -Church - Missouri Synod.\n1490 KC - CP For New Station * •\nHarding College, Searcy, Ark.-Construction permit for a new standard broadcast\nstation to be operated or 1400 kc., power of 100 watts, and unlimited hours of\noperation. AMENDED to change frequency from 1400 to 1490 kc.. ?/ - \\ .\n900 KC - Modification' of CP- * • ■ ■■ *\nKTIS-Northwestern Theological Seminary and Bible Training School, Minneapolis,Minn\nModification of construction permit (B4-P~5273, .which authorized a new standard\nbroadcast station) for approval of antenna and\"transmitter location at nprth side\nof Medicine’'lake Road, approximately,900 feet west of Turner’s cross, road;;ii.7\nmiles west of Minneapolis, city limit, Minnesota, and mount FM antenna on the FM\ntower. • . ; ; ,• >j ' 4 : . -vm\n1250 KC - Modification of CP\nKPAC-Port Arthur College, Port Arthur, Tex>-Modd.fication of construction permit\n\"BJ-p-51257*^as modified, which authorized increase in power, install new trans¬\nmitter and change transmitter location) for extension of completion date.\n1450 KC - CP Modification Increased Hours\nKBPS-Benson Polytechnic School, Portland, Orp.- Modification of license. 1450 kc.\n100'watts, 10* A.MyTo' 10 P.Mf PST Monday ,fhru Friday each week. ."
}