{
  "id": "d1187-5",
  "text": "-6-\nN-A-E-B MEMBERS TO PARTICIPATE TW TffiA NETtS ED IT CP. MEETING\nAttending the annual meeting of IARNE (Iowa Radio News Editor's Association)meeting\nin Des Moines, September 4, will be Paul Bergstrom, news director 10'LC (Luther,\nCollege) | Arthur Barnes, news director of WSUI (University of I°?a) *\nHull, station director of UOI (Iowa State College) and president of N-A-E-B*\nBarnos, editor of the \"Pronunciation Guide to Iowa Place Names”, compiled for the\nHawkeye state’s radio newsmen will review plans for a revised edition with^the\ngroup. Hull, president of IARNE, will preside at the annuai election.and^intro¬\nduce Dr. A. F. Voight from the Ames Laboratory of the Umtod States Atomic Energy\nCommission Y/ho will present the meeting’s major address.\nIARNE includes 4 non-commercial stations in its membership: USUI (University of\nIoYi/a) | WOI (Iowa State College)? KWLC (Luther College)? and KFGQ (Boone Bible\nCollege).\nOHIO STATE UNIVERSITY WINS NATIONAL RADIO NE1S_AP[^DS\nThe National Associationi of Radio News Directors in a .series\ncited Dr. Edgar Dnlo of Ohio State UnivorsitxlO^L*^^ f\nPaul Wagnert instructor of Radio ,iournalism at^ILwho^.hductod_^.Jniversj.ty_s\nprogram in \"radio nows absorption”.\nOhio State bniversity, homo of N-A-E-B meml»r_g^io^^\naycar~lAn7'gnrvny studying listener absorption _and. retpntiwjL-SL-.\nnewscasts.\nOther awards for outstanding work in the field of radio news were extended to\nstation KFTfB, Hollywood, for individual coverage of the Democratic and republican\nconvention by newsmen George Lev/in and Clete Roberts.\nWCMA OFFERS UNIQUE PUBLIC SERVICE PRCGRAlj\nBeginning Scptomber 10, Now York City residents will hear a new-typo public ser¬\nvice show on social and civic problems whoso format may well be copied m other\nmajor American cities.\nInitial broadcast, titled \"Crisis in the Classroom\" sets the patterns for the\nseries, which will be aired Fridays from 9:30 to 10:00 p.m. Each problem or\nsituation will be- handled in a two program block. Situation will be presented\ndramatically one Friday and on following week■experts in the field in question\n'and city officials will Seek solution on roundtable broadcast. Michael Sklar\nis scripter for series.\nCOLEMAN NAMED HEAD OF FQRDHAM UNIVERSITY STATION\nWill iam A. Coleman, chairman of the,radio, division\nNew York Citv. has recently been named stat.\noutlet, and as an agency of the radip__dopartment^at,,Fordhann\nJudson LaHaye, Jr., assistant in the. radio division has been named assistant\nmanager. August Rickert is program director and Manuel Ylanan.is production\ndirector. WCUV-FM operates with 3.5 KW on the 90.7.me. FM channel."
}