{
  "id": "d1187-8",
  "text": "-9~\nUNIVERSITIES ORGANIZE TO RAISE RADIO TRAINING STMMIDS\nUniversity Association .for Professional Radio, Education^stabJJ.ghed\nFollowing a preliminary meeting in Denver\nfor’ Professional- Radio Education) wag established^inJ?t a2i|_r±ormal~\nlT^nnounced in August? UAPRE will be. a permanent_^joc^\nwho together with NAB, radio trade organizat imi-JZi3^\n-fessional standards of education for radio*\nNine universities have ratified the constitutionA_witlL_cha^\nopen to schools which can meet standards covering^s^ff^_^pnrge^conj^Pit^n^.\nequipment. \" Present members are U. of Alabama^..U.^pf jGnv^r^Norbh^e^ern^U^.\nU. of Southern California. Syracuse U. T Temple U.. Texas College.,oOanes^Texas\nU. and U. of Tulsa.\nThe project iras set in motion last February by the NAB Educational.Standards\nCommittee. It was discussed at a Denver meeting in March with Judith ualler,\nN,B.C. Chicago, and Ralph M. Hardy, KSL Salt Lake City, representing NAB along\nwith President Justin Miller, who had personally sponsored the uncertaxing.\nStandards of Admission\nBefore other schools are admitted their radio courses will be closely studied\nby a UAPRE committee. Requirements include a provision that at least “alt\nthe courses be taught by persons who have been successful in commercial radio\nstations^ all students completing a sequence must have had general instruct¬\nion in radio including programming, sales and advertising along wit;h station\noperation and traffic! students must have daily logged broadcasting experience5\nsuitable equipment must be available -\n(See next page)\ntt|\\ttw.P.eTTV OF DENVER1S PORTER IS UAPRE HiESIDENT\nConstitution and standards were completed at a Jupe_j^etingj^ ^at\ntS£ these officers were elected; ,...H.__foisse3JJ^\nDon Fedderson, Northwestern U., vice presidentj—^mas^is^oi^h^e3^s_^i^\nseer et ar v TWil li amis enex^_jiL„PlL§5N^.§IlL-2^i^P—\nNailer and Mr.Hard^bgth^\neducational standards group, with•\nBOARD OF DIRECTORS\nUAPRE operates under an eleven**man board of directors, nine of which are\nselected from university membership and two appointed each year by the pres\ndent of the National Association of Broadcasters, commercial trade organiza¬\ntion,\nMEMBERS OF COMMITTEE ON STANDARDS\nMembers of the. Committee on Standard,s„pL.nMl^ai^^PBg^.. Hurtfer *■\n■ chairmans Ben Henneke, Tulsa, ULeoJjartin,.,U,\nFedderson and Hardy•\n(Continued next page)"
}