{
  "id": "d1600-1",
  "text": "On July 10 I attended the opening session of the Conference and remained\nuntil persons not officially connected with it were dismissed following the\nresponse to the address of welcome. So far as I know, only official delegates\nattended the remaining sessions.\nOn July 11 I called at the American Consulate and inquired if there were\nany regulations vrtiich would prevent or restrict my interviewing officials of\nother countries to exchange information on broadcasting. I was informed that\nthere were no restrictions and that I was at liberty to make and develop any\ncontacts that I desired.\nOn July 14 I interviewed the Ambassador of the United States and asked him\nthe same question. Ho informed me that if I wished to place anything before the\nRadio Conference the proper procedure would be to request the Chairman of the\nAmerican delegation to present it. I assured him that if I wished to have any¬\nthing presented at the Conference I would follow this procedure.\nDaily during the Conference I called at the Regis Hotel, where I talked\nfrequently with the following: Hon. Eugene 0. Sykes, Chairman of the American\ndelegation; Hon. Roy Tasco Davis and Hon. Schuyler Otis Bland, the other members;\nHon. C;«s. R. Curtis, representing the Brinkley station; Mr. Artuur J. Coutigan\nof R.C.A. Communications, Mr. C. W. Horn of National Broadcasting Company,\nMr. A \"drew Rinr.-; of the American delegation, Mr. Jrs. ¥. Baldwin of the National\nAssociation of Broadcasters, Mr. E. K. Jett of the American delegation, Mr. Gerald\nC. Gross of the American delegation, Mr. Ralph M. Heintz of Globe Wiruless, Mr.\nArthur Scuu-.rfold, radio attorney of Washington; Mr. Paul Segal, radio attorney,\nrepresenting the American Radio Relay League; Dr. C. B. Jolliffe of the American\ndelegation, Mr. Zimmerman, a radio man with American experience; Mr. and Mrs.\nH. L. Munol of the Brinkley station; Mr. H. L. Cornell, representing shipping\ninterests; Dr. Irvin Stewart of the American delegation.\nOn July 27, after rumors indicated that the Conference would reach no agree¬\nment as to the allocation of channels to different countries, and that the Latin\nAmerican delegations were incensed over the attitude of the delegation of the\nUnited States, I mailed to the heads of the Latin American delegations informa¬\ntion concerning the financial results of broadcasting in different countries\nunder different systems. A copy of this report, entitled \"Financial Aspects of\nRadio Broadcasting\", is attached. This information had been published in the\nCongressional Record, Senate Document 137, and the Bulletin of the National\nCommittee, more than a year before. It had boon sent to the United States Depart¬\nment of State, the Federal Radio Commission, and many other groups and persons\nin this and other countries interested in radio.\nIn making a telephone call to secure the address of one of the delegates,\nmy secretary was connected with the delegate himself. Ho asked who wanted his\naddress. She gave him my name. He said he would bo glad to see mo. She said\nthat I merely wished to mail him some information. Ho repeated that ho wanted\nto see me. I called and gave him the report. Thereafter he and other Latin\nAmerican delegates asked me repeatedly for information. I loaned them official\ndocuments published by the United States Government, copies of \"Education by\nRadio\", clippings from \"Broadcasting\", \"The New York Times\", and the \"United\nStates News\", and such books and other materials as were available.\nOn July 28 I was approached by two representatives of American commercial\nbroadcasting in the lobby of the Regis. They demanded to know what the state¬\nment was that I had given to the Latin American delegations. I gave each of them\na copy. I was asked why I had circulated this information. I explained that"
}