{
  "id": "d1600-1",
  "text": "The action does not affect present use of the remaining 12 Class 1-A fre¬\nquencies.\nSUBCOMMITTEE OK'S FEDERAL AID TO ETV\nThe House Subcommittee on Communications and Power last week approved a bill\nauthorizing $25,250,000 in Federal aid to ETV, and it is anticipated that the bill\nwill shortly receive favorable consideration by the full House Interstate and Foreign\nCommerce Committee.\nThe bill(HR 132) is an amended version of one introduced by Rep. Kenneth\nRoberts (D-Ala.), and incorporates most of the recommendations made by HEW Secretary\nRibicoff (as reported in Washington Report No. 6). Funds would be administered by\nthe Commissioner of Education who would approve applications and amounts, up to a\nlimit of $1,000,000 per state, based on availability of ETV channels, location of pre¬\nsent ETV stations, and density of population to be served. The bill also requires\nmatching funds from the states and would permit the federal government to recover part\nof the funds if, within 10 years, the institution or agency receiving the grant ceased\nto exist or the station was no longer operated educationally. Up to $10,000 would be\navailable to each state, also on a matching basis, for surveys and planning which would\nbe a prerequisite to the awarding of a construction grant.\nThis bill differs from the Senate-approved Magnuson bill(S 205) in that the latter\nwould provide $51,000,000, would not provide for funds for planning, and would not re¬\nquire matching funds from the states. The new bill also differs from the Roberts bill\nin that it makes no provision for permitting \"credit\" in matching for previous expen¬\nditures for ETV. Efforts will be made to have this provision restored in the House-\nSenate conference.\nFCC PROPOSES LEGISLATION FOR ALL-CHANNEL SETS\nThe FCC sent Congress (June 15) proposed legislation which would require all TV\nsets shipped in interstate commerce to be equipped for both VHF and UHF reception.\nFCC Chairman Newton N. Minow, testifying before the House Antitrust Subcommittee, sta¬\nted the proposed legislation would provide the spur needed for the development of UHF,\nadding that it is impossible to have a truly competitive TV system with only the 12\navailable VHF channels. He said, \"With this assurance of eventual access to all tele¬\nvision homes, UHF broadcasting can make real progress,\" and predicted the proposed\nlegislation would insure complete conversion to all-channel receivers within seven to\nten years.\nSince two-thirds of the channels reserved for educational use are in the UHF band,\nthis legislation is of extreme importance to educational broadcasters.\nFCC ACTIONS\nThe School of the Ozarks, Point Lookout, Mo., was granted a CP (June 2) for a\nnew noncommercial educational FM station to operate on 88.1mc, lOw.\nGreater Washington Educational Television Assn, granted a CP(June 13) to operate\nWETA-TV, a noncommercial educational TV station, on Ch. 26, V-123 kw, ERP-224 kw, an¬\ntenna height of 590', with studios located in Yorktown High School, Arlington, Va.\nWCFM, Williams College, Williamstown, Mass.; WAMC, Albany (N.Y.) Medical College;\nWMHC, Mfc. Holyoke College, South Hadley, Mass.; and WSCB, Springfield (Mass.) College\nwere all granted (May 29) licenses covering changes in frequency. (These changes were\nrequested to facilitate operations of the Eastern Educational Network.)"
}