{
  "id": "d1483-3",
  "text": "NAjSB NEWS LETTER o. May 15, 1941 0, Page 4\nW C A D ST. LAURENCE U0 3 TAT I ON TO LEAVE THE &IR\nOne of America* s oldest non-commercial educational braodcasting\nstations, WCAD', licensed to St. Lawrence University at Canton\nNo Yo, will voluntarily cease operations at the end of this\nmonth under an edict of the board of trustees of the university\nmeeting in Canton May 5. The board decided that broadcasting\nactivities of the university will henceforth be carried on\nthrough the facilities of WSLB, Ogdensburg, No Y. , a privately-\noperated commercial station, according to Richard C. Ellsworth,\nuniversity secretary and radio chairman.\nThe station, known as the \"Voice of the North Country” for the\nlast 17 years, operates part daytime only on 1250 kc., and has\nbeen used for experimental purposes and instruction in broad¬\ncasting. It was estimated that more than 575,000 has been spent\nin supporting WCAD, which has never accepted commercial accounts,\nwhile not more than 20 students had obtained jobs in radio as a\nresult of their training.\nBecause of its limited time operation, annual operating expenses\nhave averaged only around $5,000 a year, which was appropriated\nfrom the general income of the university, where at present there\nare some 25 students enrolled in various radio courses.\nThe station was established in 1924 by Dr, Ward C. Priest, head\nof the physics department, with the cooperation and assistance\nof Owen D, Young, chairman of the board of General Electric Co,\nand a St, Lawrence alumnus and trustee, Harold K, (Hal) Bergman\nand Ellis L, Manning doubled as announcers and technicians\nalong with Dr, Priest; Mr, Bergman is now manager of the station.\nThe demise of the station was forecast earlier this year when ^\nwas reported that the university would have difficulty in defraying\nthe estimated $4,000 cost of shifting WCAD*s frequency from 1220\nto 1250 kcv under the Havana Treaty, This estimate proved high,\nbut FCC requirements demanded new types of transmitting equipment\nand other modernization whioh the trustees felt was too costly.\nFence the eventual decision to sign off permanently.\nNEWS FROM KWLC\nBob Lee, production Manager of KWLC, Luther College, sends us\nthis bit of news about his station:\nOn the radio industry1s \"Movin’ Day,” March 29, KWLC changed its\nfrequency from 1270 to 1240 kilocycles. This improvement of\nbroadcast facilities here is materializing this year after 13\nyears of activity. Today it stands as one of 3S stations in\nthe United States operating as an educational medium on a non¬\ncommercial basis, while 743 stations operate commercially.\nThe objective of KWLC has always been, qnd shall remain the"
}