{
  "id": "d1378-3",
  "text": "Division Day Programs Planned\nNAEB division activities will be concentrated on Tuesday,\nNovember 2. Individual Members will meet Tuesday morning,\nand division luncheons and business meetings will follow.\n• INDIVIDUAL MEMBER DIVISION\nTo open this meeting, the Board of Directors of the divi¬\nsion will report on actions taken on such items as member¬\nship, services to Individual Members, professional interest sec¬\ntions, division financing, Placement Service, division staffing\nand publications. Following this report, members will be urged\nto express themselves on these particular issues, and on the\nfuture role of this division.\nBased on the response to a questionnaire to NAEB Indi¬\nvidual Members, seven professional interest sections have been\nset up. These groups will meet Tuesday afternoon to decide\nthe kind and extent of future activities which they wish to\nundertake.\nThese sessions mark the beginning of efforts by the divi¬\nsion to meet the needs of specialized interest groups. The meet¬\nings planned for this year are: engineering, graphic arts, class¬\nroom teaching, television teaching, research, production-direc¬\ntion, and music direction.\n• EDUCATIONAL TELEVISION STATIONS DIVISION\nNAEB-ETS will have a business meeting on Tuesday,\nstarting with a luncheon and lasting the full afternoon. Attend¬\nance promises to be heavy, and issues discussed will be of im¬\nportance to all educational television stations.\nETS committees will report, new legislation will be dis¬\ncussed, and the new ETS Program Service will be explained.\nIn addition, information will be disseminated on possible in¬\nternational exchange of ETV program material.\n• INSTRUCTION DIVISION\nThe Instruction Division will have a luncheon Tuesday,\nafter which members will be free to attend the professional\ninterest sections of the Individual Member Division from 2:00\np.m, to 3:30 p.m. At 3:30, the Instruction Division will re¬\nconvene for a session on “The Application of Programing\nPrinciples to Televised Instruction.”\n• NATIONAL EDUCATIONAL RADIO DIVISION\nNER’s luncheon speaker is yet to be announced. At the\nbusiness meeting during the afternoon, members will hear\ntalks on NERNPAC and long-range program needs, the in¬\nschool broadcasters committee, network membership and the\nnew fee structure, the present status of live networking, and\nthe first annual report by NER’s executive director, including\ndevelopments in international broadcasting. These speeches will\nbe followed by general discussion.\nRelated Meetings\nThe following organizations will have meetings during the\ntime of the NAEB convention:\nEastern Educational Network.\nMidwestern Educational Television.\nWestern Radio & Television Association.\nInternational Radio & Television Society.\nJoint Council on Educational Broadcasting.\nState ETV Authority Associates.\n\"Viewings and Listenings\"\nDuring this year’s annual NAEB convention, there will be\nan opportunity for convention attendees to listen to or view\noutstanding radio and television programs which have been\nproduced by members of the NAEB. These presentations will\nbe from 8:00 p.m. to 10:00 p.m. on Monday and Tuesday, and\nall delegates are invited to drop in as convenient. Rooms and\nprogram titles will be announced in the official convention\nprogram.\nCommittees Meet\nAs we go to press, the following committee meetings have\nbeen scheduled:\nSunday, October 31—International Relations Committee. 3:00\np.m.\nMonday, November 1—Breakfast meetings, 7:30 a.m.\nCentral Committee of the Illinois\nETV Council.\nETS Labor Committee.\nETS CATV Committee,\nETS Program Committee.\nLuncheon meeting, 12:15 p.m.\nNAEB Research Committee.\nEvening meetings, 8:00 p.m.\nNAEB Convention Site Committee.\nNAEB Awards & Citations Commit¬\ntee.\nNAEB Rights Committee.\nTuesday, November 2—Breakfast meetings, 7:30 a.m.\nETS Program Practices Committee.\nETS Copyright Committee.\nETS Interconnection Committee.\nNER Network Program Advisory\nCommittee (8:00 a.m.).\nEvening meetings\nNAEB Permanent Convention Com¬\nmittee, 8:00 p.m.\nNAEB Publications Committee, 8:30\np.m.\nSheraton Converts to UHF\nThe convention hotel, the Sheraton Park, will convert to\nUHF following an NAEB staff suggestion that hotel sets be\nable to pick up Channel 26, the local ETV outlet. Sets will be\nready to receive Channel 26 when the NAEB meeting begins\non October 31.\nBill McCarter, WETA-TV station manager, has an¬\nnounced that his station will carry the banquet address live on\nNovember 3, and that WETA’s mobile van will be at the\nhotel during the convention for programing. Plans are under¬\nway for David Susskind’s Open End program during conven¬\ntion week to cover the growth of educational broadcasting in\nthe U.S., possibly using NAEB conventioneers as participants.\nWomen's Activities\nAs outlined in an early convention announcement, three\ntours have been planned for wives during convention week.\nOn Monday, a chartered bus will take the group to Mount\nVernon and through Alexandria and old Georgetown. The\nTuesday tour is of the White House, Arlington, and the\nSmithsonian Institute, and Wednesday’s activities will include\na stop at the Moslem Mosque, the Washington Cathedral, and\nan embassy tea.\nIf there are not enough convention wives interested in\nthe regular tours, hostesses will be available to help plan in¬\nformal tours throughout the city. Those interested in the tours\nare urged to stop by the registration desk on Sunday, October\n31, for further information.\nProfessional Football Game\nNAEBers in Washington on Sunday, October 31, might be\ninterested in attending the football game between the Washing¬\nton Redskins and the Philadelphia Eagles. The game will be¬\ngin at 1:30 p.m. Those who want tickets should purchase them\nimmediately from the Redskin Ticket Office, Redskin Build¬\ning, 9th & H Streets, N.W., Washington 1, D.C. All tickets\nare $6, tax included."
}