{
  "id": "d1561-0",
  "text": "FEDERAL COMMUNICATIONS COMMISSION\nWashington, D.C. (50863)\nGENERAL INFORMATION RELEASE\nJune 5_, 1941\nNON-COMMERCIAL EDUCATIONAL BROADCAST\nBEING DEVELOPED THROUGH THE USE OE \"EM\"\n-o-\nApplications by the Board of Education of the City of Chicago, the\nSan Diego (Calif.) Unified School District and the University of Illinois to\nengage in non-commercial educational broadcast service is indicative of the\nvalue of EM in developing the five high frequency channels reserved by the\nFederal Communications Commission for non-profit educational use.\nCommon interest in making the most of the new opportunity to use these\nfacilities is evinced in the following letter to Dr. John W Studebaker, Com¬\nmissioner of Education, from Edwin H. Armstrong, prominent in the practical\nutilization of EM, which was read at the recent Twelfth Institute for Educa¬\ntion by Radio:\n\"I have been much gratified with the reports that are\nreaching me about the experiments with E.M. transmission con¬\nducted by the Cleveland Board of Education and I have been\nconsidering for some time vhatTuight be done to further en¬\ncourage other, similar, projects.\n\"From time to time letters have come in from educa¬\ntional institutions requesting information about royalty rates\nunder my Frequency Modulation patents In the event that these\ninstitutions should decide to erect stations and construct\ntransmitters themselves. . It has seemed to me that it might\nhelp the development of this new branch of radio if I should\narrange to issue licenses, to those educational institutions\nwhich are interested in going ahead, at a nominal royalty\nof One Dollar. This Is to advise you that I am willing to\ndo that. .\n\"I am writing this letter, therefore, in order that\nyou may, if you see fit, make whatever announcement would be\nmost effective in reaching those of your Institutions that\nyou feel could successfully carry on an educational program.\nThis offer would, of course, apply only to stations whose\npurpose is educational and which do not obtain income from\ntheir broadcasting activities."
}