{
  "id": "d1561-3",
  "text": "NAEB MEWS LETTER\nPage 4,\nDecember I? 1941\nIS HEARD EVER/ WEDNESDAY . DESIGNED ESPECIALLY FOR THE CLUB WOMEN\nof the Pacific Northwest, The Women's Club Handbook represents a\nSERIES OF MEETINGS OF A MODEL CLUB. PROPER PROCEDURE* ENTERTAINMENT\nPLANNING, AND A WIDE VARIETY OF OTHER CLUB RESPONSIBILITIES ARE DEMON¬\nSTRATED. AS PART OF THE PROGRAM OF MANY OF THE MEETINGS, SPEAKERS\nOR PANELS DISCUSS THE PLACE OF WOMEN IN DEFENSE*.\n“In the American tradition of freedom of speech, the Foundation acts\nAS HOST, WITHOUT PREJUDICE OR FAVOR, TO SPEAKERS OF ALL SHADES OF\nPOLITICAL AND ECONOMIC THOUGHT•“\nThis paragraph in the opening announceme t of Wake Mg. America, ex¬\npresses THE PHILOSOPHY BEHIND THE AMERICAN ECONOMIC rOUNDATION,\nPROMOTER OF THE SERIES,. THE WEEKLY BROADCASTS ORIGINATED BY THE\nBlue Network of N. B. Co are rebroadcast by KWSC for an hour on\nFriday. Wake Up America is of the forum type program. During the\nFIRST FEW MINUTES THE SPEAKERS ON THE PANEL BRIEFLY STATE THE IR\nPOSITIONS. The BALANCE OF THE FIRST THIRTY MINUTES OF THE PROGRAM\nSS SPENT IN HANDLING QUESTIONS OF THE SPEAKER^ OWN CHOOSING. DURING\nTHE LAST HALF HOUR, QUESTIONS ARE ACCEPTED FROM THE STUDIO AUDIENCE.\n1 Am An American is the story of naturalized citizens*. £ach week\nA D1FFERENT NATIVE OF ANOTHER LAND COMES THE MICROPHONE TO\nTELL HIS INTERVIEWER AND THE AUDIENCE WHY HE IS GLAD TO BE ABLE TO\nsay, “I am an American.” Many famous men and women have appeared\non THE PROGRAM—LEADERS IN VARIOUS FIELDS. FIRST HEARD ON K’wSC\nDURING THE SUMMER OF 1940, THE FEATURE IS TRANSCRIBED.\nThe story of our freedom is heard in weekly QUARTER hour dramatizations\nIN THE SERIES LEST We FORGET. A KWSC SCHOOL OF THE AlR FEATURE FOR\nOUT-OF—SCHOOL LISTENING, THIS SEMESTER * S SERIES IS ABOUT THE CON¬\nSTITUTION of the United States. Important steps leading toward the\nConstitution, from the Magna Carta to the Constitutional Convention,\nHAVE BEEN DRAMATIZED AND TRANSCRIBED.\nAn interesting five minute program prepared by the Office of Emer¬\ngency MANAGEMENT IS PRESENTED WEEKLY ON KWSCe BjJLLLDIN.G FOR P£FEN§£,\nREVEALS MANY FACTS ABOUT PRESENT PROGRESS IN DEFENSE WORK AND THE\nDEFENSE EFFORTS OF D8FFERSNT GROUPS OF AMERICANS:.\nThe U. S. War Department presents a fifteen minute program each\nSaturday evenings. The army band is featured, together with variety,\nDRAMATIZATIONS, AND BRIEF INTERVIEWS ABOUT BRANCHES OF THE SERVICE.\nThe show is entertaining and informative.\nAn ESPECIALLY INTERESTING DEFENSE SERVICE OF THE SjATE COLLEGE OF\nWashington radio service is related to the farm and homemaker pro¬\ngrams. Located in an agricultural area, KWSC has long served a\nlarge rural audience, The Agriculture Extension Service, College\nAGfil CULTURE AND AGRUCUL TURAl. EXPERIMENT STATION HAVE A PAST IN THE"
}