{
  "id": "d1561-9",
  "text": "NAEB NEWS LETTER,\nPage. 10,\nDecember I, 1941\n-•v: - / ■\nPORTUNITtES TO ALL OTHER SUCH CANDIDATES FOR THAT OFFICE\nIN THE USE OF SUCH BROADCAST l.*^ STATION, AND THE COMMISSION\nSHALL MAKE RULES AND REGULATIONS TO CARRY THIS PROVISION\ninto effect: Provided, that such licensee shall have no\nPOWER OF CENSORSHIP OVER THE MATERIAL BROADCAST UNDER THE\nPROVISIONS OF THIS SECTION. No OBLIGATION !S HEREBY IM¬\nPOSED UPON ANY LICENSEE TO ALLOW THE USE OF ITS STATION\nBY ANY SUCH CANDIDATE.”\nIT SHOULD BE NOTED THAT THIS SECTION DOES NOT IMPOSE UPON RADIO\nSTATION LICENSEES THE OBLIGATION TO GIVE OR SELL TIME TO ANY CANDI «?\nDATE FOR PUBLIC OFFICE FOR THE SAME OFFICE. In THAT EVENT, THE\nSTATION MUST THEN PROVIDE EQUAL OPPORTUNtTIES TO ALL OTHER SUCH\nCANDIDATES FOR THAT OFFICE.\nA PERSON WHOSO NAME IS NOT INCLUDED ON THE PRINTED BALLOT, BUT POS¬\nSESSES THE REQUISITE LEGAL QUALIFICATIONS TO HOLD THAT PARTICULAR\nOFFICE, IS A “LEGALLY QUALIFIED CANDIDATE” WITHIN THE MEANING OF\nTHIS SECTION OF THE COMMUNICATIONS Ad AT'O THE COMMISSIONS RELATED\nRULES. The names of SUCH persons can be written in by voters and\nA VALID ELECTION RESULT. ll IS EVI DENT THATSe<OTI ON 315 SHOULD BE\nCONSTRUED ALSO TO INCLUDE CANDIDATES FOR, I NAT | ON FOR OFFICE WHERE\nTHE NAMES OF CANDIDATES ARE NOT REQUI RED ON PRINTED BALLOTS.\nIN CONSEQUENCE, THE COMMISSION HAS CHANGED SECTION 3.422 OF ITS RULES\nTO DEFINE A “LEGALLY QUALIFIED CANDIDATE'1 AS FOLLOWS:\n“A 8 LEGALLY QUALIFIED CANDIDATE® MEANS ANY PERSON WHO\nHAS PUBLICLY ANNOUNCED THAT HE IS A CANDIDATE FOR NOMINA¬\nTION BY A CONVENTION OF A POLITICAL PARTY ®R FOR NOMINA¬\nTION OR ELECTION IN A PRIMARY, SPECAIL, OR GENERAL ELECTION,\nMUNICIPAL, COUNTY, STATE OR NATIONAL, AND WHO MEETS THE\nQUALIFICATIONS PRESCRIBED BY THE APPLICALBE LAWS TO HOLD\nTHE OFFICE FOR WHICH HE IS A CANDIDATE, SO THAT HE MAY BE\nVOTED FOR BY THE ELECTORATE DIRECTLY OR BY MEANS OF DELE¬\nGATES OR ELECTORS, AND WHO-‘{A) HAS QUALIFIED FOR A PLACE\nON THE BALLOT OR (b) IS ELIGIBLE UNDER THE APPLICABLE LAW\nTO BE VOTED FOR BY STICKER, BY WRITING IN HIS NAME ON THE\nBALLOT, OR OTHER METHOD, AND (!) HAS BEEN DULY NOMINATED\nBY A POLITICAL PARTY WHICH IS COMMONLY KNOWN AND REGARDED\nAS Sl^QH, OR (2) MAKES A SUBSTANTIAL SHOWING THAT HE IS\nA BO&yrtPE CAND i DATE FOR NOMINATION OR OFFICE, AS THE\nCASE MAY BE. “\nIn so doing the Commission is cognizant, of course, tha\"j the mere\nFACT THAT ANY PIAME MAY BE WRITTEN IN DOES NOT ENTITLE £tl PERSONS\nWHO MAY PUBLICLY ANNOUNCE THEMSELVES AS CANDIDATES TO DEMAND RADIO\nTIME UNDER SECTION 315, FOR THE OBVIOUS REASON THAT THE LIMITED\nBROADCAST FACILITIES WILL NOT ACCOMODATE ALL WHO MIGHT DESIRE TO\nspeak. The Commission also recognizes that broadcast stations may"
}