{
  "id": "d1886-2",
  "text": "r\nJune 8\nJune 9\nJune 10\nJune I I\nJune 12\nJune 13\nJune 14\nJune 15\nJune 16\nAppointment for 9 or 11 months. Opportunity for advancement. Salary\n$6,000 minimum.\nLarge midwestern university is seeking a Supervisor of ITV Production to\nwork in its CCTV system. Applicant should have had experience in produc¬\ntion of ITV materials at the collegiate level. He will supervise CCTV pro¬\nducer-directors, handle various administrative duties involved in the sched¬\nuling of studios, crews and other facilities and assist the production man¬\nager. He will be expected to direct one or two courses per term. Salary\nrange from $7,200 depending upon experience. MA degree desirable. Open\nJuly.\nLarge university in the south has immediate opening for a TV Production\nManager. This person would be responsible for all live and video tape pro¬\nductions, and crew scheduling. Salary up to $8,000 for the right person.\nInstructor in Speech and Assistant Radio Program Manager. To, teach basic\ncourse in radio announcing and equipment operation and assist in scheduling\nof programing. Possibility of television production. MA in Broadcasting and\nexperienced in announcing, programing, production and supervision of radio\npersonnel. Salary $6,800-$7,500 for 9,/2 months. Open September.\nMusic Director for large university's 70 KW FM station. This person will be\nresponsible for the major portion of programing, predominantly serious\nmusic. Position calls for some imagination but at the same time involves a\nlot of detailed work. Applicant should have a BA degree. Salary dependent\nupon experience and education—will range between $4500-$6000 plus uni¬\nversity employee benefits. University is an Equal Opportunity Employer.\nNew community ETV station in Northeastern metropolitan area has these\nopenings: Two Producer-Directors, positions beginning summer. Recent grad¬\nuates acceptable. Salary open. Liberal benefits. Good chance for rapid pro¬\nmotion; Two Studio-Transmitter Engineers. Must be familiar with operation\nof modern klystron UHF transmitters as well as studio equipment and micro-\nwave link. First-class license required; Graphic Artist to be responsible for\ncoordinating all visual elements both on-the-air and publication responsibili¬\nty.\nTelevision Science Teacher to teach grades 5-8 for regional ETV Council in\nthe Midwest. Salary $9,000-$ 10,000. Position open immediately.\nChief engineer needed for large northwest VH'F-ETV project. Technical com¬\npetency must span entire range of full power operated equipment and sys¬\ntems; full responsibility for federal and state agency negotiations, personnel\nsupervision, design, installation and maintenance. No teaching, no students.\nProgram-operations manager needed for large northwest VHF-ETV project.\nMust have prior experience in programing sources, control systems, traffic,\nproduction directing and coordination. Guides publications for staff sched¬\nuling-supervision. MA will be considered. Consider only those who have a\npersonal commitment to educational broadcasting.\nETV station—mid-atlantic state is expanding staff and operation. Have open¬\nings for engineers (2), technicians (2), cameramen (2), and photographer\n(I).\nPublications\n• Free subscriptions to Broadcast Man¬\nagement/Engineering may be obtained from:\nMactier Publishing Corporation, 820 Sec¬\nond Avenue, New York, N.Y. 10017.\n• Jerrold Electronics has a new 36-page\nbooklet on the basic types of TV systems\nfor instructional use. Write for “1966\nSchoolman’s Guide to ETV Communica¬\ntions” to: Jerrold Electronics Corporation,\n401 Walnut Street, Philadelphia, Pa. 19105.\n• In April, the Hollywood Chapter of the\nNational Academy of Television Arts and\nSciences issued Vol. 1, No. 1 of its news¬\nletter, Forum. In the feature article, Ted\nPost recommends training professional art¬\nists, research and experimentation in the\nperforming arts, encouraging criticism. He\nsays that ETV should have taken the lead\nin realizing these goals, but that instead it\nhas accepted a pat on the back and gestures\nof financial aid from commercial TV.\n• The Broadcasting and Film Commis¬\nsion of the National Council of Churches\nhas issued a catalog of programs for radio\nand TV. Write to them at 475 Riverside\nDrive, New York, N.Y. 10027.\n• Allen E. Koenig has an article in the\nsecond issue (March-April 1966) of Preach¬\ning: A Journal of Homiletics, called “What\nthe Preacher Should Know About the Ef¬\nfects of the Mass Media.”\nPrograms & Recordings\n• CBC is offering a radio art series,\n“Listening to Pictures,” to interested sta¬\ntions. The series contains 13 talks (7 to 10\nminutes each) by Dr. Jean Sutherland\nBoggs, Steinberg Professor of the History\nof Art, Washington University, St. Louis.\nSupplementing the talks is a booklet con¬\ntaining the texts, plus color photographs of\nthe paintings discussed. (These may be in¬\nserted in the booklet, next to the text con¬\ncerned.)\nCost of the programs is about $50, while\nthe books and pictures are to be sold to\nthe public as a package at $2.50 each. Dis¬\ncounts will be allowed to stations wishing\nto purchase the material for their own\ndistribution to listeners.\nFor information, write: A. H. Partridge,\nOverseas and Foreign Relations Officer,\nCBC, 354 Jarvis Street, Toronto, Ontario.\n• Western Michigan University’s broad¬\ncasting department has produced six LP\nrecords—Chaucer read in Middle English,\nfolk songs, and four in a poetry series fea¬\nturing American poets reading their own\nwork. Records are $5 each. Write: Aural\nPress, Western Michigan University, Kala¬\nmazoo, Mich. 49001.\nNews Notes\nPERSONNEL\n^ Orin D. Hood has been appointed man¬\nager of WDET, Wayne State University.\nA graduate of Boston University, he for¬\nmerly worked for WBUR-FM there, and\nfor WENH-TV, University of New Hamp¬\nshire.\n^ Stanton W. Saltzman has been ap¬\npointed director of Temple University’s\nnew department of medical communica¬\ntions. For the past six years he has served\nas producer-director and TV program co¬\nordinator for the office of instructional\nresources, University of Illinois.\n^ Alice Lewitin, who terminated her 19-\nyear association with the French Broadcast¬\ning System on December 31, is now with\nthe Coty Television Corp., a new affiliate\nof a French program production company—\nwhose technical services in Paris may be\nof interest to NAEBers going abroad. Ad¬\ndress : 1270 Avenue of the Americas, New\nYork N.Y. 10020.\n^ Roger Houglum, manager-director of\nKRVM, Eugene (Ore.), since 1945 and the\nstation’s acting chief engineer, will leave\nthat post July 1 to accept a full-time as¬\nsignment as chairman of the electronics di¬\nvision of the Lane Community College. He\nwill also direct broadcasting there, develop¬\ning radio and TV facilities on the school’s\nnew campus near Eugene.\n^ The Delaware ETV network has an¬\nnounced the following new staff appoint¬\nments : Hale Hauptman, film photography\ndirector, former CBS photographer; Joan\nRebecca Scott, resources specialist, former\nwriter-production assistant for WITF-TV,\nHershey, Pa.; Malcolm Rausch, audio tech¬\nnician, formerly chief engineer at WATS\nRadio, Sayre, Pa.; Joseph H. Gaunt, traf¬\nfic manager, formerly FM program and\nstaff announcer for WFMD-FM, Fred¬\nerick, Md.; and David Olson, studio tech¬\nnician, formerly production assistant and\nstudio supervisor at WETA-TV, Washing¬\nton, D.C.\n^ Jack Boone, Ohio University TV pro¬\nducer-director, will spend the next two\nyears in Nigeria as TV and new media ad¬\nvisor at Kano Teachers College. He will\nspend the summer directing installation of\neducational CCTV in the college. ETV is\nexpected to be in operation this fall, and\nwill be the first installation of its kind in\nAfrica.\n^ KCET, Los Angeles, has announced the\nfollowing staff additions, due to increased\nlocal programing: Charles Allen, director of\nprogram operations, former program in¬\nstructor, WLVT, Bethlehem, Pa.; Gregory\nHeimer, program associate working with\nJUNE, 1966\n3"
}