{
  "id": "d1799-0",
  "text": "N A £ B NE^S LET TER\nNATIONAL ASSOCIATION OF EOUCATIONAL BROADCASTERS\nA. James £bel, £oitor, Station WILL, Urbana, III.\nApril I, 1945\nNAEB CHANGES CONSTITUTION\nNAEB HAS VOTED TO AMEND ITS CONSTITUTION REGAROING MEMBERSHIP. PRESIDENT\nFrank Schooley declares the constitution changed in accordance with a\nMAIL VOTE CONDUCTED AFTER A 30-DAY NOTICE OF PROPOSED CHANGE IN THE CON¬\nSTITUTION.\nARTICLE I OF THE NAEB CONSTITUTION NOW READS*.\nasHfi£B.8H I P•\n(A) Any UNIVERSITY, COLLEGE, OR OTHER EDUCATIONAL OR PUBLIC SERVICE\nAGENCY OF &ECOGN17 E D STANDING ENGAGED IN EDUCATIONAL, NON-COMMERCIAL\nBROADCASTING OVER A RADIO STATION OWNED AND/OR OPERATED BY IT OR ANY\nSUCH AGENCY HOLOING A CONSTRUCTION PERMIT FOR SUCH A STATION, MAY BE\nELECTED TO MEMBERSHIP IN THIS ORGANIZATION BY APPROVAL OF THE EXECUTIVE\nCOMMITTEE, AND A TWO-THIRDS AFFIRMATIVE VOTE OF ALL ACTIVE MEMBERS OF\nTHE ASSOCIATION. EACH MEMBER INSTITUTION OR AGENCY SHALL BE ENTITLED\nTO ONE VOTE.\n(B) Any individual, educational institution, or public service\nAGENCY ENGAGED IN EDUCATIONAL BROADCASTING MAY BECOME AN ASSOCIATE\nMEMBER OF THIS ASSOCIATION BY APPROVAL OF THE EXECUTIVE COMMITTEE,\nAND A TWO-THIRDS AFFIRMATIVE VOTE OF ALL ACTIVE MEMBERS OF THE ASSOC¬\nIATION. Associate members shall have all the privileges of active\nMEMBERSHIP, EXCEPT THAT THEY SHALL NOT BE PERMITTED TO VOTE OR TO HOLD\nOFFICE.\n(0) This amendment shall become effective April I, 1945, but shall\nNOT CHANGE THE STATUS OF ANY MEMBER IN ANY CLASSIFICATION HELD ON\nDecember 31, *944.\nNO CHANGE IN DUES FOR *945\nAt last fall's annual convention the association authorized the Executive\nCommittee to act upon proposals for change in annual dues for NAEB members\nand associate members.\nThe Executive Committee has decioed to make no change in dues for *945.\nIt has also authorized the President of NAEB to appoint a special committee\nTO STUDY THE PR08LEM OF OUES ANO TO MAKE RECOMMENDATIONS FOR CONSIDERATION\nOF THE ASSOCIATION.\nPresident Schooley hereby announces that he is appointing the Executive\nCommittee as the special committee and that special correspondence regarding\nTHE ASSIGNMENT WILL BE GOING FORTH SOON TO MEMBERS OF THE COMMITTEE.\nMeanwhile, any NAEB member wishing to make any recommendations should\nFORWARD THEM TO NAEB HEADOUARTERS, GREGORY HaLL, UR8ANA, ILLINOIS."
}