{
  "id": "d1799-1",
  "text": "NAEB NEWS LETTER\nPage 2\nApriL I, I 945\n\" SCIENCE PAY* ON WO I\nFor the past 10 years, Iowa State College has been host to the high school\nYOUNGSTERS OF THE STATE ON THE FOURTH SATURDAY IN April, AT WHAT IS KNOWN\nas a ’’Science Day.\" Since gasoline and rusber restrictions are in effect,\nWOI HAS CARRIED THE INFORMATION ENTIRELY BY RADIO ON T*'0 PREVIOUS OCCASIONS,\nAND ARE DOING IT AGAIN THIS YEAR, BUT INSTEAD OF LIMITING THE INSTRUCTION\nANO CONTESTS TO ONE DAY, ARE CARRYING IT IN 12 FIFTEEN-MINUTE PROGRAMS FROM\nApril 10 to May 3 at 2:30 in the afternoon on Tuesdays, Wednesdays, and\nThursdays. Last year they had response from something over 2,000 students,\nAND ARE EXPECTING TO HAVE A GOOD MANY MORE THAN THAT THIS YEAR.\nFINAL ALLOCATIONS EXPECTED SOON\nWashington radio people now expect the FCC to announce its final allocation\nOF FREQUENCIES ABOVE 25 MEGACYCLES—AND WITH IT THE SPECTRUM POSITION FOR\nFM BROAOCASTING—SOME TIME EARLY IN April. ThERE WERE REPORTS THIS\"WEEK\nTHAT THE FM CONTROVERSY WAS STILL A MATTER OF SOME DISCUSSION WITHIN THE\nCommission. Allocations are also understood to be the subject of some\n0 IS CUSS I ON IN FCC-1 RAC meetings.\nFM NETS AWAIT SPECTRUM QgClSlON\nPlanning in the non-commercial educational FM broadcasting field is marking\nTIME WHILE THE FCC OECIDES THE FINAL SPECTRUM POSITION FOR THIS TYPE OF\nSERVICE. Six STATIONS ARE NOW ON THE AIR AND FIVE ARE UNDER CONSTRUCTION.\nAbout 35 applications have been received by the Commission but the real\nYARDSTICK OF INTEREST IS IN THE WORK THAT HAS BEEN AND IS BEING DONE TOWARD\nTHE ESTABLISHMENT OF STATE EDUCATIONAL NETWORKS.\nTHREE NSERIES HAVE WNYC PREMIERS\nA STORY-TELLING SERIES FOR CHILDREN, A SERIES OF AVIATION SHOP-TALK ANO\nINTERVIEWS AND A COAST GUARD SERIES OF SERVICE NEWS ANO RECORDINGS WILL BE\nPREMIERED ON NEW YORK City's Own STATION DURING THE COMING WEEK.\n“The Story-Telling Hour\", to be heard Sundays from lO-H a.m. beginning\nApril 8, will offer dramatic presentations of stories for younger listeners,\nwith Frances Clarke Sayers, Superintendent of the New York Public Library's\nWORK VI T H CHILDREN, AND >V,AR I A C | M I NO, ASSOCIATE LIBRARIAN OF THE CENTRAL\nChildren's Room of the Library, telling the stories.\n\"Destination New York\" will be heard Fridays on WNYC, 5:45-6:00 p.m.,\nBEGINNING April 13, AND will FEATURE SoGAR BauMAN, EDITOR OF \"AviATION NEWS,\nINTERVIEWING OUTSTANDING PERSONS IN THE FIELD OF FLYING, AND DISCUSS8MG\nNEWSWORTHY DEVELOPMENTS IN AVIATION.\n“Always Ready\", a Coast Guard series with Lt. (J.G.) Kathepine Stuurman,\nWILL OFFER A QUARTER HOUR OF SERVICE NEWS AND RECORDINGS SATURDAY MORNINGS\nAT 10:15, BEGINNING ApR|L 14.\nRAO IQ CURRICULUM! VOTED AT ILLINOIS\nA NEW RADIO JOURNALISM CURRICULUM, SUBMITTED TO THE UNIVERSITY OF ILLINOIS\nSENATE BY THE COMMITTEE ON EDUCATIONAL POLICY, WAS APPROVED MONDAY 9Y THE"
}