{
  "id": "d555-189",
  "text": "NAEB RADIO NETWORK\na\nPROGRAM OFFERING PROGRAM OFFERING\nBONUS Title: PATTERNS OF AMERICAN BONUS\nCULTURE: CONTRIBUTIONS\nOF THE NEGRO\nType: Lecture\nTime: Varied (see below)\nNo.: 13 programs\nOrigin: WUOM\nAudience: General\nSerial Number: 57-24B\nRelease Date: Issue 14 (April 7)\nThe* lectures in this series were selected from a number recorded during the 1956\nSummer Session at the University of Michigan. All of the speakers are Negro. How¬\never, not all the speakers are dealing specifically with Negro problems. An effort\nwas made to select outstanding individuals from various walks of life, men not only\nserving as fine representatives of the Negro people but as outstanding Americans\nas well.\nThe majority of the speakers do emphasize the contributions, history and problems\nof the Negro people. Many of them discuss contemporary problems of segregation and\ndiscrimination; some reference is made to the attitudes of the various political\nparties in the past. It is to be expected that certain beliefs, attitudes, con¬\nclusions drawn by the speakers will not meet with the approval of certain segments\nof the American population.\nThe first half of Professor Lorenzo Turner’s presentation is straight talk. The\nsecond half is devoted to the playing of recordings with commentary. The pickup\non these recordings was poor but the material is of such interest that it has been\nretained. It may be eliminated at the discretion of the individual station.\nProgram 1 - Issue 14\n\"The American People in Government” - E. Frederic Morrow, Administrative Officer,\nThe Special Projects Group, White House. Time: 30'\nProgram 2 - Issue 15\n“Athletic8 and American Life” - Jesse Owens, Illinois Youth Commission. Time: 45*\nProgram 3 - Issue 16\n“Negro Americanisms in History” - Benjamin Quarles, Morgan State University. Time:\n30’\nProgram 4 - Issue 17\n“Democratic Education” - Mordecai Johnson, President, Howard University. Time: 45*\nProgram 5 - Issue 18\n\"The Negro In Government” - Wade H. MsCree, Jr., Judge, Circuit Court, Detroit.\nTime: 30’"
}