{
  "id": "d555-49",
  "text": "NAEB RADIO NETWORK\n14 Gregory Hall\nUrbana, Illinois\nTo? ALL NAEB RADIO NETWORK STATIONS\nFrom: NETWORK MANAGER\nRe: PROGRAM OFFERING FOR THE 1ST QUARTER, 1957\nDEADLINE FOR ORDERS: DECEMBER 3, 1956\nAttached hereto is the offering for the period covering January-March, 1957,\nIssues #1 through 13# We hope the series offered will appeal to all stations#\nTwo major remarks are felt necessary:\n(1) Late Orders, The deadline for ordering for this offering is December 3, 1956.\nThe ordersmust be in our hands by 5:00 P.M., CST on that day. Any order\nreceived after shipment of tapes begins for this offering will be accepted\nonly if the station agrees to pay ^2,00 per reel for the back tapes. If a\nstation order's late and does not wish any back programs, but prefers that we\nbegin service with the issue being shipped when the order is received, there\nwill be no charge. This is a drastic measure, but it is vital that we have\nall orders on the deadline day so that we can get our books ready for the\nduplication and shipment of the tapes. Your cooperation is urged.\n(2) Basic and Bonus. With this offering we begin the \"basic and bonus” plan\ndiscussed previously. Offered herewith are four (4) bonus series, series we\nfelt that, while not well suited for general use over all member stations,\nmay be of great interest and value to particular stations due to their\ngeographic location or the institution or community with which they are\naffiliated.\nTo obtain a bonus series, it is necessary that you substitute.it for an equal\nnumber of hours from the \"basic” or regular offering. Thus, if you should\nwish a bonus series consisting of 13 15-minute programs, it is necessary\nthat you give up three hours and fifteen minutes of regular offering program¬\nming.\nYou may take as many bonus series as you wish, but be sure to substitute\nthem for series in the regular offering.\nIf there are any questions concerning the above announcements or the offering in\ngeneral, please feel free to contact the Network Manager for details. We will be\nglad to assist anyone who nay havo sono questions.\nBest regards to all from the Network staff. Let us hear from you often, and do not\nforget to have your order in before December 3, 1956.\nOotober 15, 1956dfc"
}