{
  "id": "d555-78",
  "text": "29\nNAEB RADIO NETWORK\nPROGRAM OFFERING\nPROGRAM OFFERING\nTitle: THE RE3TH LECTURES\nType: Lecture\nTime: 30:00\nNo.: 7 programs\nOrigin: BBC\nAudience: General\nSerial Number: 57-9\nRelease Date: January 6, 1957\nEach year the BBC invites an acknowledged authority in a particular field to\nundertake some study or original research and to give listeners the results of\nhis work in a series of broadcasts. These series are known as the Reith Lectures,\nafter the BBC’s first Director-General. The Lectures were inaugurated in the hope\nthat they would become a valuable national institution as a stimulus to thought\nand a contribution to knowledge.\nThis series of Reith Lectures - THE ENGLISHNESS OF ENGLISH ART - are given by\nNikolaus Pevsner, Head, Department of History of Art at Birkbeck College in the\nUniversity of London, Art Editor, Penguin Books, and author of \"The Building of\nEngland: Cornwall\", etc.} \"Academies of Art, Past and Present\",* ’An Enquiry into\nIndustrial Art in England\", etc. Dr. Pevsner was Slade Professor of Fine Art at\nCambridge University from 1949 to 1955.\nProgram Issue\n1. 1\n2.\n2\nTopic\nTHE GEOGRAPHY OF ART - In his first lecture\nDr. Pevsner asks what all works of art of\none people have in common, at whatever time\nin history they have been made. \"That\nmeans,\" he says, \"that my subject is really\nnational character as it is expressed in\nterms of art.\"\nHOGARTH AND OBSERVED LIFE - Hogarth de¬\nclared himself a \"Britophil\" and regarded\nforeigners as \"interlopers.\" In Dr. Pevsner\nview, the painter’s work illustrates several\nof the strongest and most enduring of\nEnglish characteristics. To Hogarth, art\nwas a medium for preaching, and the most\neffective sermon was the recounting of\nwhat the observant eye had seen. The\nEnglish concern with realities rather than\nwith ideals and systems is contrasted with\nthe Continental \"grand manner\" whether\nexpressed in allegory or in large religious\npictures."
}