{
  "id": "d555-86",
  "text": "37\nNAEB RADIO NETWORK\nPROGRAM OFFERING\nPROGRAM OFFERING\nTitles THE SPERANZA LECTURES\nType s Lecture\nTimes 60s00\nNo* s 2 programs\nOrigins Columbia University-WNYC\nAudience s Adult-College\nSerial Number s 57-13\nRelease Dates February 10, 1957\nThe general topic of these two lectures will bes \"Reconstruction—The Angry Scar,\"\nand the two lectures will be distributed as followss\nProgram Issue ISEiE\n2 6 The Scar*s Beginnings\n? 7 The Aftermath of Reconstruction\nThe speaker will be Hodding Carter, Pulitzer Prize-winning editor and publisher of\nthe Delta Democrat-Times, Greenville, Mississippi, and well-known author and f\nauthority on race relations in the South. A graduate in 1928 of Columbia University s\nSchool of Journalism, Mr. Carter has had a distinguished journalistic career^begmr-\nning with his first reporting job on the New Orleans Itemr-Tribune in 1929. From\n1932 to 1936 he was editor and publisher of the Daily Courier, Hammond, Louisiana,\nwhich he founded. In 1936 he started the Delta Star in Greenville, Mississippi,\nand, in 1939, the Delta Democrat-Times, of which he is now editor and publisher.\nMr. Carter received a Nieman Fellowship for newspapermen from Harvard in 1939 and\na Guggenheim Fellowship for creative writing in 1945. In 1946, he was awarded^a\nWar Department citation for his wartime activities as editor of the Middle East\neditions of Stars and Stripes and Yank. He had retired from the army with the\nrank of major the preceeding year. The Pulitzer Prize for editorial writing was\npresented to It. Carter in 1946. He is now a member of the Advisory Board on the\nPulitzer Prizes as well as of the National Citizens Committee for Public Schools\nand the National Society of Newspaper Editors. Mr. Carter is a frequent contributor\nto magazines and the author of a number of books, his most recent being Where Iton\nStreet Meets the River, published in 1953.\nThe Gino Speranza lecture fund was established at Columbia in 1952 by a bequest of\nhis wife, the late Florence Colgate Speranza, to provide annual lectures devoted\nto \"American traditions and ideals, viewed from an historical viewpoint. The\nseries began in 1953 with two lectures by Dr. Marie Curti, Frederick Jackson Turner\nProfessor of History at the University of Wisconsin.\nThese lectures honor an American of Italian extraction who contributed prominently\nduring the early years of the century toward the integration of Italian immigrants\ninto American life. Trained as a lawyer, Speranza served the Federal government\nand the state of New York in numerous agencies concerned with the problems of\nimmigrants. In 1915 he went to Italy as a special correspondent for the New York\nPost and shortly thereafter became an advisor to the American diplomatic staff\nthere, interpreting Italian political developments during the days before and during\nItaly's entrance into World War I. He died in 1927. Mrs. Speranza died in 1951,\nleaving a bequest of $25,000 for the establishment of the lecture series."
}