{
  "id": "d85-42",
  "text": "Burt Harrison\nFebruary 13, 1967\nREPRESENTATIVE LLOYD MEEDS (D-Wash.) Talked to his Adminis¬\ntrative Assistant, Al Swift. In fact talked a long time with\nhim. In fact, we went over to a bar and had a couple. Al is an\nold Washington (state) radio broadcaster. In between a lot of\n\"What's old so and so doing now?\" I got the whole bit. He was\nfascinated by the multiplexing possibilities. Usual assurance\nof % support, etc. etc. But I think this guy at least is sold\nand certainly understood that we were talking radio, not TV.\nREPRESENTATIVE JULIA BUTLER HANSEN (D-Wash.) Dead loss here.\nJulia was in a committee meeting. Talked to her Executive\nAssistant, Roy Carlson. Knew him when he was head of the\nstate highway patrol. Fundamentally he is still a cop—and\nnot a terribly bright one either. Never got through to him\nwhat the hell I was talking about. Much chit_chat about old\nbuddies in WSU School of Police Science. Tried to switch talk\nto radio, reminding him to weekly program we used to do in\ncooperation with highway patrol. Drew blank. His kids enjoy\ngoing to school in D. C. They are well.\nREPRESENTATIVE TOM FOLEY (D-Wash.) Lots of house here. The\nrepresentative is a classical music fan and cannot get classical\nmusic in Spokane. Hell bent to have KWSC install satellite (FM)\nin Spokane. Was aware of general provisions of existing ETV\nBill. Was—surprise—aware of NER Network from having listened\nto KWSC. Offered to testify before Senate committee hearing\nto urge inclusion of radio in new Facilities Act. Told a\nmoderately funny story about Toscanini and a symphony broadcast\non NBC. I suggested Facilities Act might help Eastern Washington\nState College (an NER member) and Spokane Community College\nexpand radio activities for Spokane. \"Hell with those jerks,\"\nhe said, \"Iwant KWSC to get an FM satellite in Spokane.\" Ob¬\nviously a very superior type representative.\nREPRESENTATIVE FLOYD HICKS (D-Wash.) Talked briefly with him,\nmore extensively with his Executive Assistant whose name I for¬\ngot to note down. They were vaguely aware of Educational Radio\nbecause of Ken Kager's operation. I gave the pitch. They ex¬\npressed interest. O.K. but I felt it was a sort of routine\nbit.\nREPRESENTATIVE CATHERINE MAY (R-Wash.) Catherine in state selling\nLincoln and Republicanism. Long—90 minute—bit with her Exe¬\ncutive Assistant, John Knieval. John is an old pal and one of\nmy former students. Also, old commercial radio man. Catherine\nis old commercial radio broadcaster. Talked about Catherine's\nweekly show we are broadcasting. Talked about nut who has just\nbought local commercial station in Pullman and is hell bent to"
}