{
  "id": "d85-44",
  "text": "Burt Harrison, page three\nSENATOR E. L. BARTLETT (D-Alaska) Talked briefly with Jack\nCornman, who was writing a speech on Alaskan TV for the\nSenator. Much pressure on speech. Agreed to come back\ntomorrow.\nREPRESENTATIVE THOMAS M. PELLY (R-Wash.) Congressman out\nselling Lincoln. Executive Assistant home sick. Talked to\nlower echelon type. Asked name twice. Mumbler. Didn't ask\nthird time. Polite attention. Comprehension doubtful.\nAgreed to communicate with Representative.\nNICK ZAPPEL Talked to Nick Zappel. His office across corredor\nfrom Magnuson's. Handy. He says...I know you guys are on the\nHill. People have been calling me all morning. I say: How are\nwe doing? He says: Like I told Herman and Sandler, you've got\na long, Hard'row to climb. I say: We know it. He says: I\nwill say this, you're going about it the right way. We chat on\nsundry matters for about five minutes. As we part (he has\nluncheon date) he slaps me on the back and says:’ You guys\nare causing me nothing but trouble, but, Burt, I wish you lots\nof luck, and keep at it.\nWent back to Downing's office. Downing says: Honest to Christ,\nBurt, is Sandler's operation as hard up financially as he indicated\nyesterday. I gave him a few, broad details. He made some notes\nand said: Well, you guys obviously have got to have money, and\nyou obviously have to push out on your own because the ETV guys\naren't ever going to do anything.\nI asked him about the SENATE telephone directory. He told his\ngirl to get me one. She went down to the Senator's office.\nThey were out. She sent for one. It had to be sent down by\npage. I told Cindy about it. It has the names and correct\nspellings of all the guys we have contacted when we were\nunable to see the Senator himself. Cindy said she'd have some¬\nbody pick it up.\nWent to Senator Cannon's office (Nevada). Everybody out to\nlunch.\nMade tour under capitor, via two electric subways. Went to\nRep. Moss (Calif.) office. Everybody out to lunch except recept¬\nionist.\nHad (pardon the expression) TV business with Stanley Neustad of\nCohn and Marks. Called him from House Office Building. He said\nI've been waiting lunch to hear from you. Joined him at Broad¬\ncasters Club for lunch. He said. I've been writing an interesting"
}