{
  "id": "d85-49",
  "text": "Jerrold Sandler, page two\n2) Accompanied Harrison to see Jack Kornman of Senator Bartlett’s\nstaff. Showed considerable interest for the potential of educational\nradio in Alaska. Suggested that we ought to get our affiliate KUAC\nto contact the Senator suggesting what they are doing and what they\nmight be doing, if funds were available, and raising a number of\npertinent points which Bartlett might then translate into comments\nor questions for the record during the hearings. Will follow up.\n3) Accompanied Burrows to lunch with Dean Coston, Deputy Under¬\nsecretary, HEW, and former WUOM man. We briefed him on the Board's\npresence and activities on the Hill. He insisted that radio is\ndefinitely written into the administration bill which will still\nundergo some finalization. The bill will probably be presented as\nan omnibus package for five years, combining ETV Facilities Act\nextension with Carnegie recommendations for a public corporation.\nMy comments which now follow come from this lunch meeting, plus\nseveral more informal chats with Coston in the last few days.\na. He promised to get me a copy of the bill as soon as\nit is available in approved form. This could be anywhere\nfrom momentarily to several weeks, depending primarily\non the scope and changes which may take place from within\nnot only HEW, but from the White House side, i.e., the\nBureau of the Budget.\nb. While there can be no garantee, he considered it\nunlikely that radio would be dropped from consideration\nat this point.\nc. He indicated (and obviously all of this should be\ntreated quite confidentially and off the record) that\non the Facilities side, radio was written in for %\nmillion, and ETV for 10 million fr the first year. No\nsums describing draft bill 'for ensuing years, but if\nand when pressed by Congress, HEW is ready to discuss\npossible five year project of up to 500 million dollars\ntotal package, including very substantial expenditures\nvia a public corporation. I indicated my concern about\nearmarking separate funds for radio which would tend to\nset precedent for separate administration and bureau¬\ncratic practices, as well as suggesting overall low limits\nof possible expenditures for radio under the act. He\nsaid that we might be better protected via earmarked\nfunds particularly since the public corporation will be\nETV dominated.\nd. While keeping somewhat vague on the details, he\nintimated that radio would be a part of the public\ncorporation idea.\ne. I asked about the likelihood of this omnibus version\npassing this session of Congress. He replied that they were\nwell aware that it might run into difficulties in this form\nand that the primary purpose behind this was to get the public\ndebate going behind a public corporation."
}