{
  "id": "d85-51",
  "text": "Jerrold Sandler, page four\n4) Accompanied Burke to Senator Long's office. Saw Charles\nMcBride, press aide. When legislation is actually before them, it\nis quite possible that I will want to speak with their legislative\nman who was not available that day.\n5) Accompanied Lewis to see Bill Kitzmiller, legislative assistant\nfor Representative Ottinger (D-N.Y.). In short, we have a potential'\nchampion who took the bull by the horns within minutes and suggested\nthat his man introduce a radio bill to be co-sponsored by Magnuson,\nas a possibility on the Senate side. He told Magnuson's legislative\nman Broide on the phone in our presence that if Maggie could not\nor would not that he might go to Bobby Kennedy or somebody like that.\nWhile a number of other contacts which some of you made left a\ngeneral impression of a willingness to help, this was the only active,\nagressive, overt offer to go this far, this fast. As mentioned\nabove, I checked this out with Coston who agrees that this could\nbe a good strategy for us, and that Ottinger is certainly an OK\nCongressman on HEW type matters. Before going too far with\nOttinger, we are trying to check from a number of sources about the\nman's reputation within Congress and in his own territory. Generally,\nI can already report the following.\na. He is a liberal Democrat from Republican West Chester\nCounty, New York.\nb. He is one of the guys who has been vigorously fighting\nthe public utilities and is very anxious to be on the Power\nand Communications subcommittee under which our legislation\nwould come.\nc. According to his legislative man, he has introduced such\nbills a number of times before as an attention getting device,\nthis could mean good PR for both the Congressman and NER,\nsince there would be a number of remarks which he would\nintroduce into the Congressional Record, as well as the at¬\ntention the bill itself would receive.\nd. I understand that he is quite wealthy in his own right,\nand indeed, is one of the officers of a family foundation\nin New York named The Ottinger Foundation. (Who knows, there\nmight even eventually be some financial aid from that quarter,\nalthough I don't count on it yet.)\nI will be contacting Kitzmiller after I return from the WRTA\nmeeting in California."
}