{
  "id": "d85-57",
  "text": "Will Lewis\nFRIEDEL, SAMUEL N. (D-Md.) House Commerce Committee. Quick,\npolite meeting with him—not too terribly interested. Be sure\nand send report. Sees no reason he wouldn't support measure.\nROONEY, FRED B. (D-Pa.) (Allentown, Bethlehem region)\nMet with legislative team of Ray Huber and Richard Henderson.\nGave 45-minute pitch. Extremely receptive. Send report.\nParticularly interested in any plans educational radio stations\nin Allentown-Easton may have for expansion. I promised we'd\npull out some extracts from national report.\nMURPHY, JOHN N. (D-N.Y.) Out of town until Tuesday.\nOTTINGER, RICHARD (D-N.Y.-Westchester County). Legislative\nAssistant, Mike Kitzmiller, a fast-talking, idea man looking for\nflashy, news-grabbing causes for a liberal democrat on the move.\nAlthough he doesn't fully grasp the dimensions or the background\nof educational broadcasting, he sees educational or non-comraercial\nradio as a suitable cause for his man. Wants Jerry to draft an\nEducational Radio Bill separate from the Administration bill.\nThis will give movement a base and will generate on-the-record,\nindexed literature on the educational radio cause. Doublechecked\nby phone to Magnuson's legislative man, Brodie, a former class¬\nmate. Brodie is Maggies man—Zappel is pastore's man. Reaction\nfrom Brodie was, \"Why not? Send the info over.\" Mike says if\nMaggie runs into static via Zappel—Ottinger may call on Bobby\nKennedy to co-sponsor bill. Magnuson and Ottinger, according to\nMike, introduce each other's legislation.\nPASTORE, JOHN 0. (D-R.I.) Saw James A. McKenna without ap¬\npointment. McKenna is Legislative Assistant. He was reluctant\nto give me much time. Indicated that Senator relies on Zappel\nfor all communication advice. Left \"Care Package\" which\nMcKenna promised to read.\nSCOTT, HUGH (R-Pa.) Saw Sid Bailey, Legislative Assistant,\nfor about 15 minutes. Listened politely. Offered to let me\nknow state of radio when bill came down. Gave Sandler's\ncard. Left \"Care Package\". Seemed sympathetic.\nCOTTON, NORIS (R-N. Hamp.) Saw Louis Jefferson, Legislative .\nAssistant. Extremely sympathetic. Says Cotton is buddy of\nMagnuson. If radio is dropped, thinks Sen. Cotton would help\nintroduce amendment. Asked us to be sure and come back!"
}