{
  "id": "d85-60",
  "text": "Jerry:\nAn original of a similar letter was sent to\nSen. Birch Bayh, Democrat, Indiana, and to\nRep. Charles A. Halleck, hep., Indiana.\nAn answer from Rep. Halleck is attached.\nFebruary 26, 1968\nThe Honorable Vance liartke\nThe United States Senate\nWashington, D.C. 20025\nDear Senator Hartke:\nIn a comiaunication I received yesterday from the\nNational Association of Educational Broadcasters,\nresults of a survey on the impact of the proposed\nnew copyright law (H.R. 2512 and S, 597) were in¬\ncluded, I have been following the NAEB's regular\nadvisories on the direction and progress of the\ncopyright law revision, but never has the stag¬\ngering import of the proposed revision been made\nso clear.\nThe survey covered one week of broadcasting by WBAA,\nDuring this week WBAA broadcast a total of 163 pro¬\ngrams that would be covered by the revised copyright\nlaw. 160 of these programs would have been denied\nexemption by S. 597 had it been law!\nWBAA is a standard AM broadcast station, and our\nsignal covers much of Indiana; the radius of our\ndaytime signal is in excess of 100 miles, which is\none of the exemption limitations in the proposed\nrevision.\nContrary to information that copyright amendment ad¬\nvocates may have given to you, program production\nis not becoming highly centralized. Our 1967 License\nRe new a 1 Application stated accurately that 52.7?; of\nour programs were locally produced, 27.2% were com¬\npiled from records in our music library, and only\n20.1% came from outside program sources such as\nNational Educational Radio Network.\nOne of our primary programming efforts is expended\non in-school programs for elementary schools in\nIndiana. Nearly 200,000 students were enrolled in\nthese in-school programs during the 1966-67 school\nyear. During the year, 23 other Indiana radio stations\nwere mailed tapes of 3,160 of these in-school programs.\nMost of this distribution of in-school programming\nwould be prohibited under current restrictions im¬\nposed by S. 597."
}