{
  "id": "d85-62",
  "text": "The Honorable Vance Ilartke\nPa ge 3\nFebruary 26, 1968\nIn the past we’ve broadcast college courses for credit.\nWe are currently working to continue this practice\nas an aid to teachers who wish to obtain advance de¬\ngrees. This type of programming would be unlawful\nunder current restrictions in S, 597. We feel that a\ncollege station’s right to broadcast courses for credit\n1 t students should be supported by law rather\nOur program schedule each week includes about five hours\nof programming provided by the NER Network, plus another\nfour hours obtained from exchanges with other university\nstations and from outside agencies. A conservative\nestimate would be that seven hours of this total of\nnine hours would be prohibited by S, 597.\nI believe it is evident that WBAA would be severely\nhandicapped, as would most other educational radio\nstations, by the unreasonable restrictions of the proposed\ncopyright law revisions. Estimates made by authorites\nwho have surveyed educational radio and televisions\nstations and who have studied the nroblem carefully are\nthat budget additions of $30,000 to $50,000 would have\nto be made to compensate personnel whose only duty would\nbe to obtain proper copyright clearance. The budget\namount would vary according to the amount of local\nproduction each station did. Our additional cost would\napproach $50,000.\nIn the case of WBAA, which regularly faces a close\nbudget scrutiny, this added amount for ’’copyright\nclearance personnel” could well be the final straw.\nAs best the added production cost would mean severely\nrestricted production and almost completely curtailed\nservice to other Uoosicr stations.\nUnder the present copyright law, exemptions for non¬\nprofit performances of copyrighted non-dramatic literary\nand musical works have permitted educational broadcast¬\ning to offer fine cultural and educational programs to\ntheir respective areas. There has been no evidence\nthat the existence of these exemptions has harmed\nauthors, performers, or publishers, nor is there\nevidence that creativity in these cultural disciplines\nhas been curtailed."
}