{
  "id": "d85-76",
  "text": "February 18, 1967\nThe Honorable Quentin K. Burdick\nSenate of the United State®\n110 GM Senate Office Building\nWashington, P. C. 20510\nBear Sir:\nWhile 1 was in Washington thi® pact week, I visited your office and met\nwith your assistant, Mr* Janes Meeker. My call was occasioned both by acquain¬\ntanceship with Mr. Meeker and by my responsibility as representative for\nRegion IV (Borth and Bouth Dakota, Iowa, Nebraska, Minnesota and Wyoudng) of\nNational i ducational ladio. KBR is headquartered in Washington, B. C. This\nletter expresses my deep appreciation for the cordiality of Mr. Meeker and\nyour staff.\nIt is my understanding that legislation to extend the current Iducatdonal\nTelevision Facilities Act is expected to include educational radio for the\nfirst tire. If so, the inclusion will be especially welcome to the plains\nstates because support for educational radio is badly needed. Up to this\ntime, educational radio interests have been rather quiet for fear of\njeopardising the development of its more flambuoyant brother, educational\ntelevision. How it is desired to call the attention of Congress to the\nolder medium and to seek support for it.\nIn mid-March it is expected that the results of a nationwide survey of\nexisting educational radio facilities will be provided for you. If the voice\nof educational radio can be heard in the Senate Commerce Committee hearing*\nthrough presentation of the survey data, the desirability of including\neducational radio in the language of the TfV Facilities bill will surely be\nclear.\nI tr..st that the information left for you with Mr. Meeker will help to\nacquaint you in detail with background details of educational radio. The\nforthcoming result* of the survey will contemporise the background. It is\neven to be hoped that with such information and your existing, thorough\nacquaintanceship with Korth Dakota* s educational needs, that you could\nbecome an advocate of a vital medium, educational radio, which has been\ntoo long neglected.\nPlease convey my special appreciation to Mr. Meeker for his courtesy\nand his time, fie helped to make my visit to Washington a pleasant and\nmemorable experience.\nSincerely yours.\nMyron M. Curry, Director\nKm & Closed Circuit T?\nce: Mr. James Meeker\nMR\nMr. Leon Morse, land Associates, N.Y."
}