{
  "id": "d85-90",
  "text": "February 20, 1967\nThe Honorable William Proxmire\nSenate of the United States\n2311 New Senate Office Building\nWashington, D. C. 20510\nDear Sir:\nWhether you v/ould remember Mike Curry from a passing\nacquaintanceship of more than twelve years ago I was unsure, but\nI took the chance and visited your office last Tuesday, February\n14, 1967* Your secretary was very gracious to take a message.\nI regretted being unable to see you* I was in Washington on\neducational radio business and thought you might be interested\nin it as well as a greeting out of the past.\nThere has been an indication that the language of the\nadministration*a version of the Educational Television Facilities\nAct,which, is nearing expiration or renewal, will probably include\neducational radio along with television. If this were so, the\nmedium whose little brother so quickly overshadowed it would get\na much needed boost. Educational radio as been quiet, I suppose,\nso as to avoid Jeopardising educational television. Apparently\nit's time to speak up#\nIn mid-March, the results of a nationwide survey of educa¬\ntional radio stations will become available. I've seen data from\n125 questionnaires. A very clear picture of the variety of\nstations, operating conditions, staffing, and achieve;;,-ends is\nappearing. The final report should ; *\"OVide accurate information\nfor evaluating the status and needs of educational radio today.\nWould £ou like to have a copy? Unless you say no, one will be\nsent to you.\nIf educational radio can at least be heard when the Senate\nCommerce Committee takes up the ETV Facilities legislation, it\nwill be all that cold be asked. If It finds advocates as well\nas the opportunity to be heard, educational radio everywhere\ncould develop new life. At any event, this letter may serve to\ncall your attention to the desirability of including radio in\nthe forthcoming ETV Facilities legislation.\nBest wishes to you.\nSincerely yours.\nMyron IV. Curry, Director\nKFJV /fc Closed Circuit TV"
}