{
  "id": "d1429-1",
  "text": "2\nTHE MEV^' YEAR\nVvhat v;ill 1947 brin^ to the National Association of Educational Broadcasters?\nCertainly the opportunity to go forward on all fronts. And hov^r will we handle\nthat opportunity? The answer will be written in the months ahead.\nThis is the golden opportunity for educational broadcasting. Facilities\nassignments in the non-commercial band are available, and there must be more\nevidence of intentions on the part of school people to use them. Y<e must encourage\nit lest the story of Mi radio be permitted to repeat itself. 1947 should see a\nflood of FM applications from institutions interested in using radio to extend\ntheir services. NAEB must encourage this, and give assistance to such applicants.\nA real obstacle to progress is complacency. It is all too easy to follow a\nfixed pattern until it becomes a deep rut. This is a time for appraising the past--\nand charting a course ahead.\nThe NAEB course must lead to greater service to FM broadcasters. There is a\nhigh degree of transfer value from AM to FM, and the experience of the years can be\nused to advantage. Broadcasting is broadcasting—-be it FM or AM. The basic\ninterests are the same. Yve will move forward together toward the goal of better\nradio for all.\nSIEGEL REPORTS USE OF TAPE RECORDER\nSeymour Siegel, Y<NYC program director, has been using the Brush Sound Mirror\nTape Recorder, and has the following to report*\nOur experience with the recorder has been centered mainly on the recording of\nspeeches and discussions. The practicality comes from its compactness and simplicity\nin operation, as well as its ability to both record and play back at one-fifth the\ncost of recording on regular transcriptions. The frequency response of 6000 cycles\ncan be considered high fidelity enough insofar as voice recordings are concerned.\nLesser success has been attained thus far in our experimental tests with music.\nThe principle of operation involved in the pa:er tape recorder is the use of\na ribbon of paper a quarter of an inch wide and coated with a ferrous base which\ngives it magnetic properties similar to the steel thread used in the wire recorder.\nThe advantage of paper in editing is obvious. A snip with a pair of shears, and\nthe use of a little scotch tape to bind the ends together does not require the\nskill, patience and time necessary in re-dubbing and re-editing the normal trans¬\ncription.\nThe cost is about one-third to one-fourth of what most wire recorders were\nselling at, and one-half hour’s quantity of paper is expected to sell for $1.50 to\n$1.75. The tape, of course, can be used over and over again although, obviously,\nits life is not as long as the wire reel. The advantage of any recorder lies in\nits ability to turn the whole world into a studio and in oases of stations v/ith\nsmall budgets, such as '*NYC, it has proven a boon in our telephone line budget allot¬\nment. Several changes could advantageously be made in the present model to permit\nuse of associated amplifiers, but for the expenditure involved it is our considered\nopinion that good value is received. It would be premature after our brief assoc¬\niation with the machine to make any conclusive observations, but the potentialities\nof the tape recorder are excellent and for v^fhat times we have used it, the results\nhave attained considerable success."
}