{
  "id": "d1429-12",
  "text": "In the course of the discussion of the 1934 Act, an\namendment to the Senate bill was introduced which re¬\nquired the Commission to allocate 25 percent of all broad¬\ncasting facilities for the use of educational, religious,\nagricultural, labor, cooperative and similar non-profit-\nmaking organizations. Senator Dill, who was the spon¬\nsor in the Senate of both the 1927 and 1934 Acts, spoke\nagainst the amendment, stating that the Commission\nalready had the power to reach the desired ends (78 Cong.\nRec. 8843):\n“The difficulty probably is in the failure of the present\nCommission to take the steps that it ought to take to\nsee to it that a larger use is made of radio facilities\nfor education and religious purposes.\n* * * * * *\n“I may say, however, that the owners of large radio\nstations now operating have suggested to me that it\nmight be well to provide in the license that a certain\npercentage of the time of a radio station shall be\nallotted to religious, educational, or non-profit users.”\nSenator Hatfield, a sponsor of the amendment, had\nalso taken the position that the Commission’s power was\nadequate, saying (78 Cong. Rec. 8835):\n“I have no criticism to make of the personnel of the\nRadio Commission, except that their refusal literally\nto carry out the law of the land warrants the Congress\nof the United States writing into legislation the desire\nof Congress that educational institutions be given a\nspecified portion of the radio facilities of our country.”\n(Emphasis supplied.)\nThe amendment was defeated and Section 307(c) of\nthe Act was substituted which required the Commission\nto study the question and to report to Congress its recom¬\nmendations.\nThe Commission made such a study and in 1935 issued\na report advising against the enactment of legislation.\nThe report stated:\n“Commercial stations are now responsible under the\nlaw, to render a public service, and the tendency of the\nproposal would be to lessen this responsibility.\n“The Commission feels that present legislation has\nthe flexibility essential to attain the desired ends with¬\nout necessitating at this time any changes in the law.\n“There is no need for a change in the existing law\nto accomplish the helpful purposes of the proposal.\n“In order for non-profit organizations to obtain the\nmaximum service possible, cooperation in good faith\nby the broadcasters is required. Such cooperation\nshould, therefore, be under the direction and super¬\nvision of the Commission.” (Report of the Federal\nCommunications Commission to Congress Pursuant to\nSec. 307(c) of the Communications Act of 1934, Jan.\n22, 1935.) (Emphasis supplied.)\nOn the basis of the foregoing legislative history there\ncan be no doubt that Congress intended the Commission\nto consider overall program service in passing on applica¬\ntions. The Federal Communications Commission from\nthe beginning accepted the doctrine that its public , inter¬\nest determinations, like those of its predecessor, must be\nbased in part at least on grounds of; program service.\nThus early in 1935 it designated for joint hearing the\nrenewal applications of Stations KGFJ, KFWB, KMPC,\nKRKD, and KIEV, in part “to determine the nature and\ncharacter of the program service rendered . . .” In re\nMcGlasham et al., 2 F.C.C. 145, 149. In its decision,\nthe Commission set forth the basis of its authority as\nfollows:\n“Section 309(a) of the Communications Act of 1934\nis an exact restatement of Section 11 of the Radio Act\nof 1927. This section provides that subject to the\nlimitations of the Act the Commission may grant\nlicenses if the public interest, convenience, and neces¬\nsity will be served thereby. The United States Court\nof Appeals for the District of Columbia in the case of\nKFKB Broadcasting Association, Inc. v. Federal Radio\nCommission, 60 App. D.C. 79, held that under Section\n11 of the Radio Act of 1927 the Radio Commission\nwas necessarily called upon to consider the character\nand quality of the service to be rendered and that in\nconsidering an application for renewal an important\nconsideration is the past conduct of the applicant.”\n(2 F.C.C. 145, 149.)\nThe courts have agreed that the Commission may con¬\nsider program service of a licensee in passing on its re¬\nnewal application. In the first case in which an applicant\nappealed from a Commission decision denying the renewal\nof a station license in part because of its program service,\nthe court simply assumed that program service should\nbe considered in determining the question of public inter¬\nest and summarized and adopted the Commission’s find¬\nings concerning program service as a factor in its own\ndecision.1 In 1931, however, the question was squarely\npresented to the Court of Appeals when the KFKB Broad¬\ncasting Association contended that the action of the Com¬\nmission in denying a renewal of its license because of the\ntype of program material and advertising which it had\nbroadcast, constituted censorship by the Commission.\nThe Court sustained the Commission, saying:\n“It is apparent, we think, that the business is im¬\npressed with a public interest and that, because the\nnumber of available broadcasting frequencies is limited,\nthe Commission is necessarily called upon to consider\nthe character and quality of the service to be rendered.\nIn considering an application for a renewal of a license,\nan important consideration is the past conduct of the\napplicant, for ‘by their fruits shall ye know them.’\nMatt. VII: 20. Especially is this true in a case like\nthe present, where the evidence clearly justifies the\nconclusion that the future conduct of the station will\nnot differ from the past. (KFKB Broadcasting\nciation v. Federal Radio Commission, 47 F. 2d 670.)\n(Emphasis supplied.)\nIn 1932, the Court affirmed this position in Trinity\nMethodist Church v. Federal Radio Commission, 62 F.\n(2d) 850, and went on to say that it is the “duty” of the\nCommission “to take notice of the appellant’s conduct\nin his previous use of the permit.”\nThe question of the nature of the Commission’s power\nwas presented to the Supreme Court in the network case.\nThe contention was then made that the Commission’s\n1 Technical Radio Laboratory v. Federal Radio Commission, 59 App. D. C.\n125, 36 F. (2d) 111.\n[11]"
}