{
  "id": "d1429-15",
  "text": "Pro- Avail- Recruit-\ngram\nable\ning\nRa-\nAudi¬\nEffici¬\nting\nence\nency\nMon.-\n-Fri.\n3:30 p.m. Pepper Young’s\nFamily. 7.1\n65.9\n10.7\n“\n“\n3:45 p.m. Right to Happiness. 7.0\n66.4\n10.5\n“\nu\n4:00 p.m. Backstage Wife. ... 6.7\n67.6\n9.9\n“\n“\n4:15 p.m. Stella Dallas. 6.9\n67.4\n10.2\n*\n4:30 p.m. Lorenzo Jones. 6.7\n68.7\n9.8\n“\n“\n4:45 p.m. Young Widder\nBrown. 7.5\n69.6\n10.7\n“\n“\n5:00 p.m. When a Girl Marries 8.9\n71.1\n12.5\n“\n*\n5:15 p.m. Portia Faces Life. .. 7 .9\n71.6\n11.0\n“\n“\n5:30 p.m. Just Plain Bill.6.5\n73.4\n8.9\nU\na\n5:45 p.m. Front Page Farrell.. 5 .6\n74.7\n7.5\nCBS Soap Operas\n“\n“\n10:00 a.m. Valiant Lady.2.9\n76.1\n3.8\n“\n“\n10:15 a.m. Light of the World.. 3.7\n75.3\n4.9\n“\n“\n10:30 a.m. The Strange Ro¬\nmance of Evelyn\nWinters.3.4\n75.4\n4.5\n“\n“\n10:45 a.m. Bachelor’s Children. 4.3\n73.6\n5.8\n“\n“\n11:00 a.m. Amanda of Honey¬\nmoon Hill. 2.8\n74.5\n3.8\n“\n“\n11:15 a.m. Second Husband. . . 3.3\n73.3\n4.5\n“\n1 “\n11:30 a.m. Bright Horizon.4.5\n73.1\n6.2\n“\n“\n12:15 p.m. Big Sister. 6.7\n72.1\n9.3\n“\n“\n12:30 p.m. The Romance of\nHelen Trent.7.0\n72.1\n9.7\n“\n“\n12:45 p.m. Our Gal Sunday_ 6.8\n70.8\n9.6\n“\n“\n1:00 p.m. Life Can Be Beauti¬\nful. 7.2\n70.4\n10.2\n“\n“\n1:15 p.m. Ma Perkins. 7.7\n69.7\n11.0\n“\n“\n1:45 p.m. Young Dr. Malone.. 5.1\n68.2\n7.5\n“\n“\n2:00 p.m. Two On a Clue.4.3\n68.2\n6.3\n“\n“\n2:15 p.m. Rosemary.4.1\n67.1\n6.1\n“\n“\n2:30p.m. Perry Mason. 3.8\n66.0\n5.8\n“\n“\n2:45 p.m. Tena & Tim.3.8\n66.1\n5.7\nSource: “Sectional” Hooperatings, Dec. 1944-April 1945,\nWinter-Spring.\nThe “ratings” of the NBC and CBS soap operas must\nbe considered in the light of the dominant position in\nthe spectrum occupied by the stations concerned. Thus\nin the 32 cities in which the surveys in question were\nmade, the power of the stations affiliated with each net¬\nwork was as follows:\n32 CBS stations. .\n32 NBC stations..\n32 ABC stations. .\n32 Mutual stations\nTotal power\n925,000 w\n835,000 w\n222,250 w\n200,000 w\nAverage power\nper station\n28,906 w\n26,093 w\n6,945 w\n6,250 w\nSeveral reasons may be suggested for the popularity\nof soap operas among advertisers.3 First, the soap opera\nis among the cheapest of all network shows to produce.\nThe weekly production costs of the ordinary soap opera\nare reported to be less, for five 15-minute periods, than\n3 According to the Cooperative Analysis of Broadcasting (CAB), network\ncommercial time during the day from October 1943 to April 1944 was\ndivided as follows:\nSerial drama .\n. 57.4%\nNews and talks .\n. 10.7%\nVariety .\n. 8.7%\nDrama .\n. 6.8%\nChildren’s Programs .\n. 4.7%\nClassical and Semi-Classical .\n. 4.5%\nAudience Participation .\n. 2.8%\nPopular Music .\n. 2.2%\nFamiliar Music .\n. 1.3%\nHymns .\n. 0.9%\n100\nsome advertisers spend on a one-minute transcribed spot\nannouncement. Second, advertisers' are not interested\nmerely or primarily in the size of the audience which\nthey achieve. They are interested also, and perhaps\nprimarily, in two other indices of program effectiveness.\nOne is the “sponsor identification index” which is defined\nas “the percent of listeners to a specific program which\nknows the name of the program’s advertiser, or of any of\nhis products.” The other is the “product use index,”\ndefined as “the use of a sponsor’s brand of product and\nthat of his competitors among listeners to his program\ncompared with non-listeners.” An advertiser relying on\nthe sponsor identification index, for example, may prefer\na soap opera which appeals to only one million listeners\nand indelibly impresses the name of his product on two-\nthirds of them, rather than a non-soap opera program\nwhich appeals to two million listeners but impresses the\nsponsor’s name on less than one-third. Similarly, an\nadvertiser may prefer a soap opera which, as in an actual\ninstance, results in the use of his product by 46.5 percent\nof those who listen (as compared with 25.1 percent of use\namong non-listeners), even though the program in ques¬\ntion appeals to comparatively few listeners.\nMr. Duane Jones, head of an advertising agency re¬\nputed to be one of the five largest in New York, clearly\nwas considering the special interests of advertisers rather\nthan the public interest, when he declared:\n“The best radio program is the one that sells the\nmost goods, not necessarily the one that holds the\nhighest Hooper or Crossley rating.” 4 * 6\nWhether or not the reasons cited for the popularity of\nsoap operas among advertisers are the decisive ones, it is\nclear that the result on many stations has been a marked\nimbalance of program structure during the daytime hours;\nand it is significant that the first steps recently taken\nto redress this imbalance have been the addition of sus¬\ntaining programs. It is by means of the sustaining pro¬\ngram that program imbalance, consequent upon sponsor\ndomination of excessive blocks of time, can be redressed\nby those responsible for program structure—balance—\nthe licensees, including the networks.\n(2) Programs Inappropriate for Commercial Sponsorship\nA second role of the sustaining program is to provide\ntime for broadcasts which by their very nature may not\nbe appropriate for sponsorship. As early as 1930, Mr.\nMerlin H. Aylesworth, then president of the National\nBroadcasting Company, recognized this role of the sus¬\ntaining program in testimony before the Senate Com¬\nmittee on Interstate Commerce, even proposing that col¬\nlege football games were by their nature inappropriate\nfor commercial sponsorship.3 More recently, in 1941,\n4 The advertiser view cited may be contrasted with one of the “basic\nprinciples” in the interpretation of the phrase “public interest, convenience\nor necessity” laid down by the Federal Radio Commisison in 1928:\n“While it is true that broadcasting stations in this country are for\nthe most part supported or partially supported by advertisers, broadcasters\nare not given these great privileges by the United States Government for the\nprimary benefit of advertisers. Such benefit as is derived by advertisers\nmust be incidental and entirely secondary to the interest of the public.”\n(Emphasis in original.)\n6 “Mr. Aylesworth. * * * We have refused to permit from our system the\nsponsoring of football games by commercial institutions. That may be a\nwrong policy; I do not know; but I have assumed that with all these young¬\nsters in their management boards and with all of the commercialism that is\ntalked about, and so forth, that I just did not quite like to see the Yale-\nHarvard game announced ‘through the courtesy of so and so’.” (Hearings\non S. 6, 1930, p. 1711.)\n[14 1"
}