{
  "id": "d1429-18",
  "text": "partment of Agriculture, and by the Bureau of the\nCensus.10\n(5) Program Experimentation\nDr. Stanton, in his testimony previously cited, has de¬\nscribed still another role of the sustaining program in the\nAmerican system of broadcasting:\n“* * * It is through the sustaining or noncommer¬\ncial program service that Columbia has developed its\ngreatest contributions to network radio broadcasting.\nOn its own time and at its own expense, Columbia has\npioneered in such experimental fields as that of original\nradio drama through the Columbia Workshop Series.\nFurther, it was the first to originate news broadcasts\ninvolving on-the-spot reports from correspondents lo¬\ncated over all the world. The Columbia School of the\nAir, now in its thirteenth year, is another example of\nthe use to which Columbia puts its sustaining time by\nproviding a balanced curriculum of broadcasts, S days\na week throughout the school year, suitable for use in\nthe classrooms. Columbia has also taken the leader¬\nship in the matter of new program content in adult\neducation, music and public debate.”\nVarious advertisers and advertising agencies have\nfrankly stated the extent to which their commercial re¬\nquirements make necessary a special tailoring of commer¬\ncial programs. The president of the American Tobacco\nCompany, a sponsor of many network commercial pro¬\ngrams, has been quoted to this effect:\n“We have some funny things here about radio, and\nwe have been criticized for it. Taking 100% as the\ntotal radio value, we give 90% to commercials, to\nwhat’s said about the product, and we give 10% to\nthe show.\n“We are commercial and we cannot afford to be any¬\nthing else. I don’t have the right to spend the stock¬\nholder’s money just to entertain the public. In par¬\nticular, sponsors are naturally loath to sponsor any\nprogram which may offend even a minority of listen¬\ners. * * * The last thing I could afford to do is to\noffend the public.”\nSimilarly Proctor & Gamble, probably the largest spon¬\nsor in American broadcasting, has been described as hav¬\ning “a policy never to offend a single listener.”\nIn 1935, to take an extreme example, Alexander Wooll-\ncott’s “Town Crier” broadcasts were discontinued when\nthe sponsor complained Mr. Woollcott had criticized Hit¬\nler and Mussolini, and might thus offend some listeners.\nIn the field of creative and dramatic writing for radio,\nthe sponsor’s understandable desire to please, to avoid\noffense to anyone, and to integrate the tone and content\nof his program with his sales appeal, may exert an espe¬\ncially restrictive influence on artistic self-expression, and\non the development of the radio art. Not a few dis¬\ntinguished writers are known to be unwilling to accept\nsponsorship because of restraints and stereotypes imposed\nwhich reflect the commercial as against the artistic pre¬\noccupations of the sponsor. Variety comments on this\nsituation in its issue of June 20, 1945:\n10 Attitudes of Rural People Toward Radio Service, Bureau of Agricultural\nEconomics, U. S. Department of Agriculture, January 1946.\n“Radio script writers are turning in increasing num¬\nbers to the legit field. . . . What is particularly sig¬\nnificant, however, is the motive behind the wholesale\ntransfer of allegiance of the scripters from radio to\nBroadway. For some time the feeling has been mount¬\ning among many of the serious writers for radio that\nthey’ve been retarded by a lack of freedom of expres¬\nsion . . . and that as long as radio remains more or\nless of a ‘duplicating machine’ without encouraging\ncreative expression and without establishing an identity\nof its own, it’s inevitable that the guy who has some¬\nthing to say will seek other outlets.”\nNorman Rosten, himself a writer of commercial pro¬\ngrams and winner of a grant from the American Academy\nof Arts and Letters for his radio writing, has stated the\npoint of view of some radio writers in part as follows:\n“The sponsor and the advertising agency have taken\nover radio quietly in this matter of writing. Except for\nsustaining shows (often worthy, such as ‘Assignment\nHome’) or special public service programs magnani¬\nmously aired after 11:30 p. m., the broadcasting com¬\npany sells Time. It owns the air. It will sell you a\npiece. Period.\n******\n“By ‘non-commercial radio’ I do not mean simply\nany sustaining series. I mean a non-format show, an\nexperimental show, one which does not have limitations\nof content or form. Something like the old Columbia\nWorkshop. I mean a half hour each week on each\nnetwork for a program of original radio plays. With\nor without love in a cottage. In poetry or prose. Any\nway we please. No commercial and no strings. All we\nwant is a piece of wavelength and your good auspices.\nNot as a seasonal replacement, but an all-year-round\nproposition. The present hit-or-miss, one-shot system\nis a phony. Nor does a new ‘Thirteen by Corwin’ mean\nthe millennium. Mr. Corwin’s triumph has not saved\nhis fellow-writers. How about a ‘Thirteen by Thir¬\nteen?’ or ‘Twenty-six by Twenty-six?’- The writers\nare here and some good ones. How about setting the\nSaga of Lux or the creaking door aside one half hour\nper week per network? It might well usher in a renais¬\nsance in radio drama. How about it NBC, CBS,\nAmerican and Mutual? Put up or, as the saying\nquaintly goes, shut up. Prove it, or forever hold your\npronouncements about radio coming of age. We are\nnearing the middle of the 20th century. Shall the\nsinging commercial and the Lone Ranger inherit the\nearth?”\nThere is no reason to believe that the present bound¬\naries of program service are the ultimate boundaries. If\nbroadcasting is to explore new fields, to devise new types\nof programs for the American listener, it is clear that the\nsustaining program must continue as a means by which\nexperimentation and innovation may have the fullest\nscope, undeterred by the need for immediate financial\nsuccess or the imposition on writers of restraints deriving\nfrom the natural, but limiting, preoccupations of the\nadvertiser.\nIt is especially important that some sustaining pro¬\ngrams be reserved from commercial restraints in view of\nthe degree of concentration of control currently existing\n[17]"
}