{
  "id": "d1429-3",
  "text": "- 4 -\nG UESTITORIAL\nLast May, at the invitation of Elmer Sulzer, I attended the Convention of\nthe American College Public Relations Association in Lexington. It was one of\nthe most enjoyable moetings I have ever attended.\nThere was a large room filled with displays of college publicity| magazine\nstories^ bulletins, brochures, catalogues, pictures, news re leasesj an impres-\n! sive display of'the use of the printed word. There was not a si:agle display or\ni presentation of the use of the spoken word for publicity purpose:'> Prizes\n■ were awarded for (1) Best College Pictorial Booklet, (2) Best College Catalogue\n: (3) Best News Photo used during the year, (4) Best news story used during the\ni year interpreting education, (5) Miscellaneous Publicity Pieces.” ^There were\nj no transcriptions, no copies of radio scripts. Evidently the Public Relations\nI directors do not consider radio as one of their outstanding mediums for dis¬\nseminating information to the public concerning the research, the learning, and\nthe instruction available on their campuses.\nA total of 173 representatives from colleges and universities were regis¬\ntered at the convention. There were Publicity and Public Relations Directors;\nnews, sports, and research editors. There were art editors and photographers;\nDirectors of Information and of Public Announcements. One, just one, member of\nthe College Public Relations Association in attendance at the convention evi¬\ndenced some connection with radio. An examination of the entire membership\nroster shows 500 members, but not even Elmer admits connection with radio. In\n1947 there v/ill be at least one listing in the radio field, because I have\nbeen accepted as a ’’secondary member”.\nHave we broadcasters been so intent with serving the radio audience that\nwe have neglected to sell radio to our institutions as a medium in the field\nof Public Relations? Do College Public Relations Departments fail to recognize\nthe radio quintuplets, A.M., F.M., facisimile,^television, and wired radio.\nEach of these types of broadcasting offers an individual type of public service\neach will have a different audience.\nIt v/ould be redundant to point out the great advantages that radio offers\nin the field of public relations. That is not my point-, I merely present fact\nwhich imply that radio should be sold to the campus, to the college public\nrelations departments. On the other hand. College Public Relations Directors\nhad better recognize radio for the medium it is or, with the advent of FM ed¬\nucational stations, they will be ’’secondary members”.\nPublic Relations and Radio Broadcasting are so intimately connected that\ntheir respective directors must work with and profit from one another. Start\nbroadcasting to the home campus.\nImldo Abbot\nDirector of Broadcasting\nUniversity of Michigan\nNext month's guestitorialist: John.IV, Dunn, Oklahoma."
}