{
  "id": "d1429-4",
  "text": "PART I. THE COMMISSIONS CONCERN WITH\nPROGRAM SERVICE\nOn April 10, 1945, the Federal Communications Com-\nsion announced “a policy of a more detailed review of\nbroadcast station performance when passing upon appli¬\ncations for license renewals.” 1\nThe need for such a policy had earlier been set forth\nby Chairman Paul A. Porter in an address to the National\nAssociation of Broadcasters March 12, 1945. The Chair¬\nman stated:\n“• • • Briefly the facts are these: an applicant seeks\na construction permit for a new station and in his appli¬\ncation makes the usual representations as to the type\nof service he proposes. These representations include\nspecific pledges that time will be made available for\ncivic, educational, agricultural and other public service\nprograms. The station is constructed and begins opera¬\ntions. Subsequently the licensee asks for a three-year\nrenewal and the record clearly shows that he has not\nfulfilled the promises made to the Commission when\nhe received the original grant. The Commission in the\npast has, for a variety of reasons, including limitations\nof staff, automatically renewed these licenses even in\ncases where there is a vast disparity between promises\nand performance.\n“We have under consideration at the present time,\nhowever, a procedure whereby promises will be com¬\npared with performance. I think the industry is en¬\ntitled to know of our concern in this matter and should\nbe informed that there is pending before the Commis¬\nsion staff proposals which are designed to strengthen\nrenewal procedures and give the Commission a more\ndefinite picture of the station’s overall operation when\nlicenses come up for renewal.”\nA procedure involving'more detailed review of renewal\napplications was instituted experimentally in April 1945;\nand this report is based in part upon experience since\nthen with renewal applications.\nThe need for detailed review on renewal can best be\nillustrated by a series of specific instances. The cases\nwhich follow are not presented for any substantive light\nthey may throw on policy with respect to program service.\nPart III of this report will deal with substantive program\nservice matters. The following cases are set forth to\nshow various occasions for detailed review on renewal\nrather than the principles in terms of which such review\nshould proceed.\nA. COMPARISON OF PROMISE AND\nPERFORMANCE: STATION KIEV\nThe KIEV case (8 F.C.C. 207) illustrates primarily\nthe need for sound procedures to compare promises with\nperformance when acting on renewal of licenses.\nUnder date of January 21,. 1932, the Cannon System,\nLtd., applied for a construction permit for a new stand¬\nard broadcast station at Glendale, California. Because\nthe quota 2 for the zone in which California was located\n1 FCC Mimeograph No. 81S7S, April 10, 1945.\n2 Under Section 9 of the Radio Act of 1927, as amended March 28, 1928,\neach zone and each state in the United States was assigned a quota, and\nnew applications could not be granted, with certain exceptions, in a zone or\nstate whose quota was already filled. Since the Fifth Zone quota was filed,\nKIEV was of the opinion that its application would be granted only at\nhad been filled, the Cannon System, Ltd., further re¬\nquested that the facilities assigned to Station KGIX, Las\nVegas, Nevada, be withdrawn, in order to make possible\na grant of its application.\nIn prosecuting its application (Docket No. 1595), Can¬\nnon System, Ltd., represented that it proposed to operate\nthe station as a civic project; that the central location\nof its proposed studios would be convenient for the pro¬\ngram talent to be broadcast; that the applicant proposed\nto cooperate with the Glendale Chamber of Commerce\nand all the local civic, educational, fraternal and religious\ninstitutions in donating to them, without charge, periods\nof time for broadcasting programs of special interest to\nGlendale listeners; that one-third of the broadcasting\ntime would be devoted to educational and semi-educa-\ntional matters; that agricultural features would be pre¬\nsented and that programs would include local, state and\nnational news items; that special features would be pre¬\nsented for the large Spanish population in the Glendale\narea; that 20 percent of all its broadcast hours would be\ndevoted to sustaining programs of an agricultural nature;\netc. It further represented that the lack of a broadcast\nstation in Glendale discriminated against “the use of\nGlendale’s excellent talent.”\nOn the basis pf such representations, the renewal appli¬\ncation of Station KGIX was designated for hearing\njointly with the application of the Cannon System, Ltd.,\nfor a new station. Following this hearing, the Federal\nRadio Commission found that “although the Glendale\narea now receives service from a number of stations\nsituated elsewhere, there appears to be a need in that\ncity for the purely local service, largely civic and educa¬\ntional in character, proposed to be rendered therein by\napplicant, Cannon System, Ltd.”\nWith respect to Station KGIX, the Commission found\nthat cutting its hours from unlimited to limited would\npermit the station “to render any substantial service\ntheretofore rendered or proposed to be rendered.” Ac¬\ncordingly, the application of the Cannon System, Ltd.,\nwas granted, and the authorized time of Station KGIX\nwas cut in half in its renewed license.\nOn May 22, 1939, Station KIEV filed an application\nfor renewal of its license and the Commission was unable\nto determine from an examination of the application that\na renewal would be in the public interest. Accordingly,\nthe application was designated for hearing3 and was\nheard beginning December 7, 1939.\nCommission inspectors had made recordings of the\nprograms broadcast by the applicant on December 15,\n21, and 27, 1938. On the basis of these recordings, the\nCommission found:\n“. . . On the first of these days the programs con¬\nsisted of 143 popular records and 9 semi-classical rec¬\nords. There were 264 commercial announcements and\n3 minutes of announcements concerning lost and found\npets. On December 21, 1938, the programs were made\nthe expense of some other station, and hence requested the withdrawal of\nthe facilities assigned to KGIX. A subsequent change in California quota\nfacilities rendered this question moot. (In re Cannon System. Ltd F R C\nDocket 1595, decided Sept. 23, 1932.) '\n3 The^ issues in the hearing included the following:\n“1. To determine the nature and character of the program service\nrendered by the applicant;\n. “2. To determine whether the station’s program service has been and\nis now in conformity with the representations made to the Commission\nt^e,0r*§'”3l application^ for construction permit or license,\nand all subsequent applications by the licensee. i\n[3]"
}