{
  "id": "d1429-41",
  "text": "desirable in connection with the operation of broadcast\nstations during a political campaign?\n(14) Does a station operate in the public interest\nwhich charges a higher rate for political broadcasts than\nfor commercial programs?\n(15) The Federal Communications Commission is\nforbidden by law to censor broadcasts. Should station\nlicensees have the absolute right of censorship, or should\ntheir review of broadcasts be limited to protection against\nlibel, dissemination of criminal matter, etc.?\n(16) Should broadcasters be relieved of responsibility\nfor libel with respect to broadcasts over which they exer¬\ncise no control?\n(17) Should the “right to reply” to broadcasts be\nafforded; and if so, to whom should the right be af¬\nforded, and under what circumstances?\n(18) When a station refuses time on the air requested\nfor the discussion of public issues, should it be required\nto state in writing its reasons for refusal? Should it\nbe required to maintain a record of all such requests\nfor time, and of the disposal made of them?\n(19) What measures can be taken to open broadcast¬\ning to types of informational programs which contravene\nthe interests of large advertisers—for example, news of\nthe reports and decisions of the Federal Trade Commis¬\nsion concerning unfair advertising; reports of the Amer¬\nican Medical Association concerning the effects of cig¬\narette-smoking; temperance broadcasts; etc?\nThese are only a few of the many questions which are\nraised in complaints to the Commission from day to day.\nThe future of American broadcasting as an instrument\nof democracy depends in no small part upon the establ¬\nishment of sound solutions to such problems, and on the\nfair and impartial application of general solutions to\nparticular cases.\nUnder the Communications Act, primary responsibility\nfor solving these and similar issues rests upon the licensees\nof broadcast stations themselves. Probably no other type\nof problem in the entire broadcasting industry is as im¬\nportant, or requires of the broadcaster a greater sense of\nobjectivity, responsibility, and fair play.\nWhile primary responsibilty in such matters rests with\nthe individual broadcaster, the Commission is required by\nthe statute to review periodically the station’s operation,\nin order to determine whether the station has in fact been\noperated in the public interest. Certainly, the establish¬\nment of sound station policy with respect to news, in¬\nformation, and the discussion of public issues is a major\nfactor in operation in the public interest.\nThe Commission has never laid down, and does not\nnow propose to lay down, any categorical answers to such\nquestions as those raised above. Rather than enunciating\ngeneral policies, the Commission reaches decisions on\nsuch matters in the crucible of particular cases.11\nOne matter of primary concern, however, can be met\nby an over-all statement of policy, and must be met as\npart of the general problem of over-all program balance.\nThis is the question of the quantity of time which should\nbe made available for the discussion of public issues.\nThe problems involved in making time available for\nthe discussion of public issues are admittedly complex.\nn See, for example, the May flower case, 8 F.C.C. 333, and United Broad¬\ncasting Company (WEKC) case, decided June 26, 1945.\nAny vigorous presentation of a point of view will of neces¬\nsity annoy or offend at least some listeners. There may\nbe a temptation, accordingly, for broadcasters to avoid as\nmuch as possible any discussion over their stations, and\nto limit their broadcasts to entertainment programs which\noffend no one.\nTo operate in this manner, obviously, is to thwart\nthe effectiveness of broadcasting in a democracy.\nA test case may illustrate the problem here raised. At\nthe request of the Senate Committee on Interstate Com¬\nmerce, the Commission undertook a study of all network\nand local programs broadcast from January 1, 1941\nthrough May 31, 1941, relative to the foreign policy issue\nthen before the country, that of isolationism versus inter¬\nvention in the world conflict. The period reviewed was\none of great crisis. The issue at stake would affect the\nhistory and even the survival of our country and its insti¬\ntutions. Five major questions of foreign policy were in¬\nvolved—lend-lease, the convoying of ships to Britain,\nthe acquisition of foreign bases, the acquisition of foreign\nships, and the maintenance of the British blockade.\nFrom this study the following facts emerged.\nThe four major networks submitted 532 programs.\nUpon analysis only 203 scripts were deemed revelant; 14\nscripts were unobtainable.\nAssuming all 14 of these scripts to have been relevant,\nthis means that 217 scripts during a 5-month period dealt\nwith the 5 major issues of foreign policy listed above.\nPut another way, each network broadcast a program\ndevoted to one or more of these issues every third day.\nBut while the networks made these programs available,\nnot all affiliated stations carried them. Of 120 CBS\naffiliates, 59.3% carried the average lend-lease program.\nOf 165 MBS affiliates, 45.5% carried it. Of the approxi¬\nmately 200 NBC stations on both Red and Blue networks\nof NBC, 69 stations carried the average NBC program\non lend-lease.\nEven more significant are the figures relating to non¬\nnetwork programs. Of 842 stations reporting, only 288\nclaimed to have originated even one program on any\nsubject relevant to this study. The remaining 454 denied\nhaving broadcast a single non-network program on\nforeign policy during the entire 5-month period. While\nsubject to possible sampling error, the study indicates\nthat station time devoted to discussion programs dis¬\ntributed by the four networks exceeded station time\ndevoted to discussion programs originated by the stations\nin the ratio of 30 to 1.\nThe carrying of any particular public discussion, of\ncourse, is a problem for the individual broadcaster. But\nthe public interest clearly requires that an adequate\namount of time be made available for the discussion of\npublic issues; and the Commission, in determining\nwhether a station has served the public interest, will take\ninto consideration the amount of time which has been or\nwill be devoted to the discussion of public issues.\nD. ADVERTISING EXCESSES\n(1) Value of advertising\nAdvertising represents the only source of revenue for\nmost American broadcasting stations, and is therefore\nan indispensable part of our system of broadcasting. In\n[40]"
}