{
  "id": "d1429-42",
  "text": "return for spending some 397 million dollars per year 1\non American broadcasting, the advertiser can expect that\nhis name and wares will be effectively made known to\nthe public.\nAdvertising in general, moreover, and radio advertising\nin particular, plays an essential role in the distribution\nof goods and services within our economy. During the\npostwar era if manufacturers are to dispose of the tremen¬\ndous output of which our postwar industry will be capable,\nthey must keep their products before the public.\nFinally, informative advertising which gives reliable\nfactual data concerning available goods and services is\nitself of direct benefit to the listener in his role as con¬\nsumer. Consumer knowledge of the new and improved\nproducts which contribute to a higher standard of living\nis one of the steps toward achieving that higher stand¬\nard of living.\nHowever, the fact that advertisers have a legitimate\ninterest and place in the American system of broad¬\ncasting does not mean that broadcasting should be run\nsolely in the interest of the advertisers rather than that\nof the listeners. Throughout the history of broadcasting,\na limitation on the amount and character of advertising\nhas been one element of “public interest.” A brief review\nwill illustrate this point.\n(2) Historic Background\nCommercial broadcasting began in 1920 or 1921, and\nby 1922 the dangers of excessive advertising had already\nbeen noted. Thus at the First Annual Radio Conference\nin 1922, Secretary of Commerce Herbert Hoover de¬\nclared:\n“It is inconceivable that we should allow so great\na possibility for service, for news, for entertainment,\nfor education and for vital commercial purposes to be\ndrowned in advertising chatter. * * *”\nThe Conference itself took heed of Secretary Hoover’s\nwarning and recommended:\n“* * * that direct advertising in radio broadcast¬\ning service be absolutely prohibited and that indirect\nadvertising be limited to the announcements of the\ncall letters of the station and of the name of the con¬\ncern responsible for the matter broadcasted, subject\nto such regulations as the Secretary of Commerce may\nimpose.”\nIn 1927, following the passage of the Radio Act, ad¬\nvertising abuses were among the first topics to engage\nthe attention of the newly established Federal Radio\nCommission. Thus, in its first formal statement of the\n“broad underlying principles which * * * must control\nits decisions on controversies arising between stations in\ntheir competition for favorable assignments,” one of the\n“broad underlying principles” set forth was that “the\namount and character of advertising must be rigidly\nconfined within the limits consistent with the public serv¬\nice expected of the station.” To quote further:\n“* * * The Commission must * * * recognize that\nwithout advertising, broadcasting would not exist, and\nmust confine itself to limiting this advertisement in\namount and in character so as to preserve the largest\npossible amount of service to the public. Advertising\nmust be accepted for the present as the sole means\nof support of broadcasting, and regulation must he\nrelied upon to prevent the abuse and over use of the\nprivileged 2 (Emphasis supplied.)\nThis general principle was applied in particular cases,\nespecially in connection with actions on renewal of sta¬\ntion licenses. Thus in announcing, on August 23, 1928,\nits decision not to renew the license of Station WCRW,\nthe Commission stated:\n“It is clear that a large part of the program is dis¬\ntinctly commercial in character, consisting of adver¬\ntisers’ announcements and of direct advertising,\nincluding the quoting of prices. An attempt was made\nto show a very limited amount of educational and\ncommunity civic service, but the amount of time thus\nemployed is negligible and evidence of its value to\nthe community is not convincing. Manifestly this sta¬\ntion is one which exists chiefly for the purpose of\nderiving an income from the sale of advertising of a\ncharacter which must be objectionable to the listening\npublic and without making much, if any, endeavor to\nrender any real service to the public.”\nThe station’s license was not renewed.\nIt was. urged in some quarters, then as now, that the\nCommission need not concern itself with program service\nbecause whenever the public found a broadcast irksome,\nlisteners would shift to other stations and the situation\nwould thus automatically correct itself. The Federal\nRadio Commission, in announcing on August 29, 1928 its\ndecision to place Stations WRAK, WABF, WBRE, and\nWMBS “on probation” by renewing their license for\n30 days only, rather than for the customary 90 days,\ngave short shrift to this argument. It stated:\n“Listeners are given no protection unless it is given\nto them by this Commission, for they are powerless\nto prevent the ether waves carrying the unwelcome\nmessages from entering the walls of their homes. Their\nonly alternative, which is not to tune in on the sta¬\ntion, is not satisfactory, particularly when in a city\nsuch as Erie only the local stations can be received\nduring a large part of the year. When a station is\nmisused for such a private purpose the entire listen¬\ning public is deprived of the use of a station for a\nservice in the public interest.”\nDespite the Federal Radio Commission’s concern with\nexcessive advertising, there is reason to believe that sub¬\nstantial Congressional sentiment considered the Commis¬\nsion too lax in the exercise of its functions with respect\nto advertising. Thus on January 12, 1932, the Senate\npassed Senate Resolution 129, introduced by Senator\nCouzens, then chairman of the Senate Committee on\nInterstate Commerce, which provided in part as follows:\n“Whereas there is growing dissatisfaction with the\npresent use of radio facilities for purposes of commer¬\ncial advertising: Be it\n“Resolved, That the Federal Radio Commission is\nhereby authorized and instructed to make a survey\nand to report to the Senate on the following questions:\n2 In re Great Lakes Broadcasting Co., F:R.C. Docket No. 4900.\n1 See p. 54.\n[41]"
}