{
  "id": "d1429-43",
  "text": "“1 What information there is available on the feasibil¬\nity of Government ownership and operation of\nbroadcasting facilities.\n“2. To what extent the facilities of a representative\ngroup of broadcasting stations are used for com-\nmercial advertising purposes. ,\n“3 To what extent the use of radio facilities for pur-\n' poses of commercial advertising varies as between\nstations having power of one hundr^ watts five\nhundred watts, one thousand watts, five thousand\nwatts, and all in excess of five thousand watts.\n“4. What plans might be adopted to .re(^c®’to1 |\nto control, and perhaps, to eliminate the use ot\nradio facilities for commercial advertising pur-\n“5. What rules or regulations have been adopted by\nother countries to control or to ehmmate the us\nof radio facilities for commercial advertising pur-\n“6. Whether it would be practicable and sabsf^tory\nto permit only the announcement of sponsorship\nof programs by persons or corporations.\n(3) Evolution of Industry Standards\n(a) Commercials in sponsored programs. Broad¬\ncasters and advertisers themselves _ have\nnized the basic doctrine that advertising must be limited\nand abuses avoided. Thus, Mr. Herbert Wilson Smith,\nof the National Carbon Company, sponsors of the Eve\nReady Hour, testified before the House Merchant Marine\nand Fisheries Committee concerning radio legislation on\nJanuary 7, 1926:\n«* * * When these musical and semi-dramatic pro¬\ngrams are given, we precede the program by some such\nSuncement as this one, for example, on December\n15, 1925‘ ' - u\n“ ‘Tuesday evening means the Ever-Ready Hour,\nfor it is on this day and at this time each week that\nthe National Carbon Company, makers of Ever\nReady flashlights and radio batteries, engages the\nfacilities of these 14 radio stations to present its\nartists in original radio creations. Tonight the spon¬\nsors of the hour have included in the program,\netc.\nIn 1930 Mr. William S. Hedges of Station WMAQ,\nthen Dresident of the National Association of Broad-\nSemTnd now vice-president of the National Broad¬\ncasting Company, testified before the Senate Committee\non InferstatePCommerce concerning the quantitative lim-\nits on advertising which he then enforced.\n“Now that is the extent of the advertising, direct or\nindirect’of any character which we do in connection\nwith our program. * * * The statement of the name\nof your company or the sponsorship of the program\nmust be delicately handled so that the listener will not\nfeel that he is having advertising pushed over on him\nthen throughout the rest of the entertammcnt the e\nis given a very high-class program, a musical program,\nentirely for the pleasure of the listeners. (hearings\nH R. 5589, 69th Cong., 1st sess., pp. 81-8Z.)\nOn March 25, 1929 the National Association of Broad¬\ncasters, composed at that time of 147 broadcast stations\nthroughout the country, adopted Standards of Com¬\nmercial Practice” which specifically provided.\n“Commercial announcements, as the term is gen¬\nerally understood, shall not be broadcast between 7\nand 11 p.m.”\na The Commission’s ^dy made pursuant to Ais Resolution was pub¬\nlished as Senate Document 137, 72nd Cong. 1st sess.\n\"The Chairman (Senator Comens). What\nof a 30-minute program would you say should be de\nvoted to advertising?\n“Mr. Hedges. It all depends on the way you do\nit Our rule, however, in our station is that no\nthan one minute out of the 30 minutes is devoted to\nadvertising sponsorship. In other words, the radiobs-\ntener gets§ 29 minutes of corking good entertamment,\nand all he has to do is to learn the name of the org\nization that has brought to him this fine program.\n“The Chairman. Do all of the advertisers on your\nstatkin6 confine*themselves to 1 minute of advertising\nout of thirty minutes?\n“Mr. Hedges. Some of them do not use as much as\nthat.\n“The Chairman. And some use more:'\n“Mr. Hedges. Very few.” (pp. 1752-3)\n2?homs p« wedk out ofm^hours of operation waS\nthe “CBS Credo” on advertising:\n“No overloading of a program with advertising\nmatter, either through announcements that are> too 1 g\nor by too frequent mention of a trade name\nproduct.” (p. 1801).\nMr. Paley testified further:\n“Senator Dill. How much of the hour do you allow\nfor advertising in a program of an hour, or how much\nin a program of half an hour?\n“Mr Paley. Well, that varies, Senator Dill. I do\nnot know how many seconds or how many minutes\nduring an hour we actually give for the advertising\ntime but a few weeks ago our research department\ntold ’me that of all the time used on the air during a\nparticular week, that the actual time taken for adver-\ntising mention was seven-tenths of 1 percent of a\ntime.” (p. 1802).\nSince 1930, there has been a progressive relaxation of\nindustry standards, so that the NAB standards at presen\npermit as much is one and\nadvertising in a five-minute period, and do not even\nrequire this limit on participating programs, musical\nclocks”, etc. The NAB Code provisions in effect from\n1937 to 1945 were as follows:\n“Member stations shall hold the length ^of com¬\nmercial copy, including that devoted to contests and\noffers, to the following number of minutes and seconds.\n4 Senate Committee on Interstate Commerce, Hearings on S. 6. 71st. Cong.,\n[42]"
}