{
  "id": "d1429-44",
  "text": "“Daytime\n“Five-minute programs . 2:00\n* Five-minute news programs. 1:45\nTen-minute programs . 2:30\nFifteen-minute programs . 3:15\nTwenty-five minute programs. 4:15\nThirty-minute programs . 4:30\nSixty-minute programs . 9:00\n“Nighttime\n“Five-minute programs . 1:45\n♦Five-minute news programs . 1:30\nTen-minute programs . 2:00\nFifteen-minute programs. 2:30\nTwenty-five minute programs . 2:45\nThirty-minute programs . 3:00\nSixty-minute programs . 6:00\n“♦Further restriction by individual stations is recom¬\nmended.\n“Exceptions:\n“The above limitations do not apply to participa¬\ntion programs, announcement programs, ‘musical\nclocks’, shoppers’ guide and local programs falling\nwithin these general classifications.\n“Because of the varying economic and social condi¬\ntions throughout the United States, members of the\nNAB shall have the right to present to the NAB for\nspecial ruling local situations which in the opinion of\nthe member may justify exceptions to the above pre¬\nscribed limitations.”\nIn August 1945 these standards were further amended\nto eliminate the day-night differential, and to apply the\nformer nighttime maxima to all hours.\n(b) Spot Announcements. In addition to the com¬\nmercials within sponsored programs, there are, of course,\ncommercial spot announcements within or between pro¬\ngrams. . No standard appears to be generally accepted\nfor limiting spot announcements—though one network\nhas recently announced with respect to its owned sta¬\ntions that commercial spot announcements must be lim¬\nited to 1 minute or 125 words, that not more than three\nmay be broadcast in any quarter-hour, that “station-\nbreak” spot announcements must be limited to 12 seconds\nor 25 words, and that these must not be more frequent\nthan one each quarter-hour. The result is to permit 12\nminutes and 48 seconds of spot announcements per hour.\nThe NAB standards place no limitation whatever on\nspot announcements. .\n(4) Present Practices: Time Devoted to Commercials\nIn addition to the general relaxation of advertising\nstandards in recent years, there is abundant evidence\nthat even the present NAB standards are being flouted\nby some stations and networks.\nAs a rough index to contemporary advertising prac¬\ntices, the Commission recorded the programs of the six\nWashington, D. C., stations for Friday, July 6, 1945, and\nanalyzed the recordings and station logs for that day.\nThe Washington stations comprise:\nWRC—a 5,000-watt regional station, owned by the\nNational Broadcasting Company.\nWTOP—a 50,000-watt clear-channel station, owned\nand operated by the Columbia Broadcasting System.\nWMAL—a 5,000-watt regional station, owned by\nthe Washington Evening Star, affiliated with the Amer¬\nican Broadcasting Company (Blue Network).\nWOL—a 1,000-watt regional station licensed to the\nCowles Broadcasting Company and affiliated with the\nMutual Broadcasting System.\nWINX—a 250-watt local station licensed to the\nWashington Post.\nWWDC—a 2 50-watt local station licensed to the\nCapital Broadcasting Company.\nIt seems reasonable to suppose that these six stations,\noperating in a major metropolitan area and the capital\nof the country, including two stations owned by major\nnetworks and two others affiliated with major networks\nwould represent practices superior to the practices of\nstations generally.\nFrequent examples of commercial advertising in ex¬\ncess of NAB standards were noted on all four networks\nand all six stations. The results of the study suggest\nthat on networks and stations alike, the NAB standards\nare as honored in the breach as in the observance.\n(5) Other advertising problems\nThe proportion of overall time devoted to advertising\ncommercials, discussed above, is only one of a series of\nproblems raised by present network and station policies.\nNo thorough study has been made of these other adver¬\ntising problems, and accordingly, the following para¬\ngraphs should be considered as suggestive only, and\ndesigned to stimulate further research in this field.\nMore light is needed both on the nature of existing\npractices and on their effect. A partial list of adver¬\ntising problems other than the proportion of time de¬\nvoted to advertising includes:\n(a) Length of individual commercials. One commer¬\ncial recorded by the Commission ran for just five min¬\nutes, without program interruption of any kind.\nThat many advertisers are content with spot an¬\nnouncements of reasonable length is indicated by the\nfollowing table showing the scheduled length of 70 com¬\nmercial spot announcements broadcast over Station\nWCAU on Monday, February 12, 1945, between 8 a.m.\nand 11 p.m.:\nNo. of 15-second commercial spot announcements\nNo. of 20-second “ “ “\nNo. of 25-second “ “ “\nNo. of 30-second “ “ “\nNo. of 45-second “ “ “\nNo. of 60-second “ “ “\nNo. of 95-second “ “ “\n2\n2\n36\n2\n1\n26\n1\n70\nOn the other hand, some advertisers are frankly of\nthe opinion that the longer the commercial plug, the more\neffective the program. Mr. Duane Jones, president of\nan advertising agency said to be one of the five largest\nin New York, placing more than 2,000 commercials a\nweek for 26 clients, has given forceful expression to this\nview:\n“In dealing with advertising on the air, we in the\nDuane Jones Co. have found that, when we increase\n[43]"
}