{
  "id": "d1429-48",
  "text": "“Cavalcade of America” program over NBC to explain\none side of a controversial issue. To quote:\n“I want to talk to you tonight about an agreement\ncurrent in the news and of wide public interest. This\nis the agreement which the DuPont Company has had\nfor years with a British chemical company, Imperial\nChemical Industries, Ltd. It provides for a mutual\nopportunity to acquire patent licenses and technical\nand scientific information relating to important chem¬\nical developments. It has been a matter of public\nrecord and known to our government for ten years.\n“Literally hundreds of transfers of technical and sci¬\nentific information have occurred for the advancement\nof chemical science and the benefit of the American\npeople in peace and war. Agreements of a similar\ncharacter, but limited to specific chemical fields have\nbeen made from time to time with continental Euro¬\npean companies for the use of scientific data obtained\nfrom abroad. Many valuable products have resulted\nfor the use of the American public and necessary to\nour armed forces. In this war, DuPont chemists have\nmaterially improved and have further developed the\nscientific data flowing from these contractual arrange¬\nments.\n“The scientific and technical information gained has\ncontributed substantially to American progress and to\nthe success of American arms. Many important prod¬\nucts have resulted from these agreements to which\nreference may be made without disclosing military\nsecrets. Developments were made incident to syn¬\nthetic ammonia manufactured from nitrogen extracted\nfrom the air. Without this we could not have smoke¬\nless powder and TNT in anything like the quantities\nneeded. The development of Methyl Methacrylate\nplastic used for the transparent enclosures to be found\non every combat airplane stems from these agreements.\nA new process vital to quantity production of aircraft\nengines and a new plastic polythene, which has gone\ninto the production of new electrical items urgently\nneeded by the Army and Navy. Also high in this list\nare rayon, dyes, celophane, zelan,—water repellent for\nmilitary apparel, as well as many other chemical prod¬\nucts. All have been improved and perfected here but\nthey came originally from abroad.\n“These agreements have been of the greatest benefit\nin giving to the American public products and proc¬\nesses which in the past have materially raised the\nstandard of living, products and processes which are\na part of the promise for the future of “Better Things\nfor Better Living Through Chemistry.”\n(i) Intermixture of program and advertising. A lis¬\ntener is entitled to know when the program ends and\nthe advertisement begins. The New York Times com¬\nment on this and related topics is here in point:\n“The virtual subordination of radio’s standards to\nthe philosophy of advertising inevitably has led the\nnetworks into an unhealthy and untenable position.\nIt has permitted Gabriel Heatter to shift without em¬\nphasis from a discussion of the war to the merits of\nhair tonic. It has forced the nation’s best entertainers\nto act as candy butchers and debase their integrity as\nartists. It has permitted screeching voices to yell at\nour children to eat this or that if they want to be as\nefficient as some fictional character. * * * The broad¬\ncaster often has argued that it is not his function to\n‘reform’ the public taste, but, be that as it may, it\ncertainly is the broadcaster’s responsibility not to\nlower it.”\nThe Association of Radio News Analysts has particu¬\nlarly inveighed against the practice of having the an¬\nnouncements read by the same voice as the news analysis.\nArticle IV of the ARNA Code of Ethics provides:\n“The association believes the reading of commercial\nannouncements by radio news analysts is against the\nbest interests of broadcasting.”\nAccording to the president of the ARNA, John W.\nVandercook:\n“ARNA has * * * consistently arrayed itself in\nopposition to the reading of such commercial announce¬\nments by news analysts. It is our belief that the\nmajor networks and all of the more reputable Ameri¬\ncan advertising agencies are in substantial agreement\nwith us and support our stand.\n“We, however, recognize and applaud the necessity\nfor perpetual vigilance and unremitting efforts to\nextirpate the all-too-common breaches of these prin¬\nciples.” (St. Louis Post-Dispatch, Feb. 5, 1945.)\nThe above is not to be taken as an exhaustive list of\nadvertising excesses. Since it is not the intention of\nthe Commission to concern itself with advertising ex¬\ncesses other than an excessive ratio of advertising time to\nprogram time, no exhaustive study has been undertaken.\nThere is need, however, for a thorough review by the\nindustry itself of current advertising practices, with a\nview towards the establishment and enforcement of sound\nstandards by the industry itself.\nIV. ECONOMIC ASPECTS\nThe problem of program service is intimately related\nto economic factors. A prosperous broadcasting indus¬\ntry is obviously in a position to render a better program\nservice to the public than an industry which must pinch\nand scrape to make ends meet. Since the revenues of\nAmerican broadcasting come primarily from advertisers,\nthe terms and conditions of program service must not be\nsuch as to block the flow of advertising revenues into\nbroadcasting. Finally, the public benefits when the eco¬\nnomic foundations of broadcasting are sufficiently firm\nto insure a flow of new capital into the industry, espe¬\ncially at present when the development of FM and\ntelevision is imminent.\nA review of the economic aspects of broadcasting dur¬\ning recent years indicates that there are no economic\nconsiderations to prevent the rendering of a considerably\nbroader program service than the public is currently\nafforded. Detailed statistics are found in two annual\nCommission publications, “Statistics of the Communi¬\ncations Industry in the United States”, and “Financial\nand Employee Data Respecting Networks and Standard\nBroadcast Stations”. Some selected and additional sta¬\ntistics are presented below.\nThe broadcast revenues shown in this report are not\n[47]"
}