{
  "id": "d1429-55",
  "text": "TABLE 14 (2)\nBroadcast expense ratios of radio stations with annual time sales of $25,000 or over, excluding key stations of major networks\nItem\n1940\n1939\n1938\nDollars\nPercent\nDollars\nPercent\nDollars\nPercent\nTotal broadcast expenses.\n. 75,255,538\n100.0\n64,608,419\n100.0\n58,945,834\n100.0\nTechnical.\n. 11,980,208\n15.9\n• 10,719,830\n16.6\n10,024,944\n17.0\nProgram...\n. 27,923,610\n37.1\n23,664,016\n36.6\n22,245,023\n37.7\nSales.v.\n. 10,211,457\n13.6\n8,396,325\n13.0\n6,925,671\n11.8\nGeneral and administrative...\n. 25,140,263\n33.4\n21,828,248\n33.8\n19,750,196\n33.5\nProgram expenses.\n. 27,923,610\n100.0\n23,664,016\n100.0\n22,245,023\n100.0\nSalaries and wages of program dept.\n. 7,354,639\n26.3\n6,109,684\n25.8\nN.A.\nN.A.\nTalent expenses..\n. 9,562,686\n34.3\n8,814,725\n37.3\nN.A.\nN.A.\nRoyalties...\n. 5,814,236\n20.8\n4,222,464\n17.8\nN.A.\nN.A.\nWire service..\n. 1,931,354\n6.9\n1,655,067\n7.0\nN.A.\nN.A.\nOther.\n. 3,260,695\n11.7\n2,862,076\n12.1\nN.A.\nN.A.\nExplanatory Notes:\n(1) “Key Stations” are those owned and operated stations of the major networks which serve as the originating points for most of\nthe network programs. In the annual reports filed for these stations, an adequate segregation between network expenses and\nstation expenses is not made. In 1944 there were ten such stations; prior to 1944 there were nine.,\n(2) N.A.—not available.\nSource: Annual financial reports of networks and licensees of broadcast stations.\nTable 15 is a comparison of the investment in broad¬\ncasting of the networks and stations, as of December 31,\n1944, with an estimate of the public’s investment in\nbroadcast receivers as of that date.\nIt will be noted that the original cost of the public\ninvestment in broadcast receivers exceeds the original\ncost of the networks’ and stations’ investment in tan¬\ngible broadcast property by a ratio of about 26 to 1.\nTABLE 15\nOriginal cost to the public of 53,800,000 re¬\nceivers manufactured during the 8-year\nperiod prior to December 31, 1944. $2,078,000,000 1\nOriginal cost of all tangible broadcast prop¬\nerty to licensees of all stations and net¬\nworks, as of December 31, 1944. 82,997,650 2\nExcess of public investment over industry\ninvestment in tangible broadcast property $1,995,002,350\n1 Radio & Television Retailing, January 194S, page 21.\n2 See Table S.\nTable 16 shows a comparison of the estimated annual\nexpenditures by advertisers for broadcast time and talent\nwith the estimated annual cost to listeners.\nIt will be noted that advertisers spent an estimated\n2.0 cents per day per receiver to reach listeners, while\nlisteners spent an estimated 3.1 cents per day per re¬\nceiver to hear the programs provided.\nTABLE 16\nComparison of annual expenditures of advertisers to broadcasting\nwith annual expenditures of listeners.\nA. Advertiser expenditures\nTotal expenditures of advertisers for purchase\nof broadcast time (after discounts but in¬\ncluding commissions). $287,642,747 3\nEstimated expenditure of advertisers for pro¬\ngram talent and other program expenses\n(38 percent of time sales). 109,304,244 4\nTotal expenditure of advertisers. $396,946,991\nExpenditure of advertisers per receiver per\nyear (divide above by 55,000,000). $7.22®\nExpenditure of advertisers per receiver per\nday (divide above by 365). .02\nB. Listener Costs\nCost of electricity, batteries, etc. $200,000,000 5\nCost of 22,000,000 replacement tubes. 25,000,000 6\nCost of repair parts, supplies, etc. 60,000,000 7\nCost of repair services. 50,000,000 8\nAverage annual expenditures for purchase of\nreceivers. 297,000,000 9\nTotal bill paid by listener. $632,000,000\nCost to listeners per receiver per year.... $11.49\n(divide above by 55,000,000)\nCost to listeners per receiver per day. . . .03\n(divide above by 365)\n3 See Table 10.\n* “The Dimensions of American Broadcasting,” by William C. Ackerman,\nColumbia Broadcasting System, in Public Opinion Quarterly, Spring 1945,\npage 11. Ackerman estimates talent costs at from 20 percent to 38 percent\nof net time sales. Cf. Borden, The Economic Effect of Advertising (1942),\npp. 891-895, for an estimate of talent costs as 32 percent of time sales.\n5 Radio & Television Retailing, January 1945, page 21. This estimate based\non the assumption that 55 million receivers were used an average of four\nhours per day, that the average power requirement was 60 watts, and that\nthe average cost of electric power (both centrally generated and from battery\nsources) was 5 cents per kilowatt hour.\n6 Ibid., based on data supplied by the RCA License Bureau, which re¬\nceives reports from all manufacturers of tubes licensed under RCA and asso¬\nciated patents.\n7 Ibid., based on estimates received from manufacturers.\n8 Ibid., based on questionnaire replies from radio repairmen and service\nagencies.\n9 Based on 53,800,000 receivers manufactured after January 1, 1937. Since\nfew receivers were manufactured during 1942 and 1943, the figure for a\nnormal year would be much higher.\nPART V. SUMMARY AND CONCLUSIONS-\nPROPOSALS FOR FUTURE COM¬\nMISSION POLICY\nA. ROLE OF THE PUBLIC\nPrimary responsibility for the American system of\nbroadcasting rests with the licensee of broadcast stations,\nincluding the network organizations. It is to the sta¬\ntions and networks rather than to federal regulation that\nlisteners must primarily turn for improved standards of\nprogram service. The Commission, as the licensing\nagency established by Congress, has a responsibility to\nconsider overall program service in its public interest\n[54]"
}