{
  "id": "d1429-6",
  "text": "F.C.C. 92), the issue of two competing applications for\na single available assignment was squarely raised.1\nOn December 8, 1939, the Van Curler Broadcasting\nCorporation filed an application for a new station to\noperate in Schenectady, New York, on a frequency of\n1210 kilocycles, with power of 250 watts. A month later\nthe Western Gateway Broadcasting Corporation filed a\ncompeting application for a new station in the same\ncity, utilizing the same power on the same frequency.\nThe two mutually exclusive applications were jointly\nheard.\nSince both applicants specified similar or identical\nequipment and both appeared initially to be qualified\nfinancially and legally, the hearings were primarily con¬\ncerned with the program representations of the two ap¬\nplicants. The Van Curler Broadcasting Corporation, for\nexample, represented that it would regularly broadcast\nprograms of the American Legion, the Schenectady Mu¬\nnicipal Housing Authority, the Schenectady Council of\nChurches, etc.; that school programs for the city school\nsystem would be broadcast from 1:30 to 2 p. m. daily;\nthat a local town-meeting program, patterned after the\n“American Town Meeting of the Air,” would be broadcast\nTuesday evenings from 8 to 9 p. m.; that a special line\nand studios would be installed at Union College for the\nbroadcasting of its educational programs; etc.2\nThe other applicant, Western Gateway, also made de¬\ntailed program representations—for example, that it would\nbroadcast book reviews; a music appreciation series; a\nlocal “Radio Workshop” patterned after the CBS pro¬\ngram of the same title; round table religious discussions\nembracing all religious faiths; programs of various local\ncivic organizations, etc. The percentage of time to be\ndevoted to each type of program was explicitly set forth.3\n1 This need to decide between competing applicants is a commonplace\nin the standard broadcast band. It may be somewhat less frequent in the\nnew FM band because of the possibility of a larger number of stations in\nmost communities; but competing applications for FM along the Eastern\nseaboard and in other, metropolitan areas are already on file with the Com¬\nmission. Television will also in all probability give rise to competing appli¬\ncations for identical facilities.\n2 “The Schenectady Municipal Housing Authority would broadcast a\nweekly one-quarter hour program, publicizing its activities. The Council\nof Churches of Schenectady would cooperate with the applicant in presenting\nreligious programs. The proposed religious programs consist of: A one-\nquarter hour morning devotional program, presented 5 days a week by local\nministers; a one-quarter hour Jewish program on Saturday afternoons; morn¬\ning church services, presented from local churches for 1 hour on Sundays;\nand Vesper services for one-half hour on Sunday afternoons. Definite ar¬\nrangements have been made with the city superintendent of schools for the\nbroadcasting of school programs from 1:30 to 2 p.m. daily. Arrangements\nhave been made with the State Forum Counselor, assigned by the United\nStates Office of Education, to the New York Council of School Superintendents\nto broadcast programs in connection with this group’s work in promoting\nadult civic education. The broadcasts to be presented would consist of:\nA local town meeting program (patterned after the well-known program,\nAmerican Town Meeting of the Air”), which would be carried on Tuesday\nevenings from 8 to 9 p.m.; and three one-quarter hour programs each week.\nThe Federation of Women’s Clubs of Schenectady, representing some 38\nclubs, would broadcast a one-half hour program each week during the seasons\nof the year when the clubs are most active. Definite arrangements have\nalready been made for the presentation of some 43 programs by affiliates\nof the Federation. A one-quarter hour book review would be presented each\nweek in cooperation with the city public library; and the applicant has also\nagreed to broadcast special announcements concerning the library. The City\nof Scotia would broadcast a weekly program devoted to matters of local\ninterest to the listeners living in that community. The applicant has agreed\nto contribute to these groups the use of the facilities of the projected station, as\nwell as professional production assistance, and to reserve specific periods of\nFmC °C 92 ~b)e-SUStaining basis for their reSular programs.” (9\n3 “The proposed station would be operated on the average of about 17\nh0UIij ual/‘ According to the applicant’s proposed program plans, time\nwould be devoted as follows: Entertainment (51.41 percent), includes various\ntypes of music (presented by local and professional talent, records and\ntranscriptions), drama, quiz programs, and broadcasts designed especially for\nthe . women (such as shopping and household hints, fashion comments, and\nadvice on the care of children); educational (16.53 percent), includes safety\nprograms, book reviews a music appreciation series, a program entitled\nRadio Workshop” (a local version of CBS program of the same title),\npatriotic broadcasts, dramatized historical events, local round table discus-\nsions, and others; religious (6 percent), includes a morning program of\nOn the basis in part of these program service repre¬\nsentations, the Commission on February 24, 1942, granted\nthe application of Western Gateway and denied the ap¬\nplication of Van Curler. With respect to the successful\napplicant, the Commission concluded:\n“Western Gateway Broadcasting Corporation is\nqualified in every respect to construct and operate the\nstation proposed; it proposes to render a balanced\nprogram service comparable to that normally provided\nby local broadcast stations; and its proposed station\nwould provide a satisfactory technical service through¬\nout the City of Schenectady and the rural areas con¬\ntiguous thereto.” (9 F.C.C. 92, 101.)\nWith respect to the unsuccessful applicant, Van Curler\nBroadcasting Corporation, the Commission found that,\n“while this applicant has made a showing of the public-\nservice programs, newscasts, transcribed features, musical\nclock programs, and time and other reports, it expects to\nbroadcast, it has not adduced evidence as to its other\nprogram plans.” Moreover, the Commission raised the\nquestion of credibility with respect to the representations\nmade by the unsuccessful applicant. It noted that one\nof the directors had first testified that $5,000 which he\nhad invested in the company was his own, and subse¬\nquently testified instead that it had been borrowed from\na brother-in-law. Said the Commission:\n“In the performance of our duties we must, among\nother things, determine whether the operation of pro¬\nposed stations, or the continued operation of existing\nstations, would serve public interest, and in so doing\nwe are, of necessity, required to rely to a large extent\nupon statements made by station licensees, or those\nconnected therewith. Caution must, therefore, be exer¬\ncised to grant station licenses only to those persons\nwhose statements are trustworthy.” (9 F.C.C. 92, 102)\nExamination of the logs of Station WSNY, the Western\nGateway station, for the week beginning January 18,\n1945, and a consideration of the statement concerning\nthe public service rendered by Station WSNY filed by\nthe licensee under date of May 24, 1945, in connection\nwith its license renewal, warrant the conclusion that while\na very genuine effort is being made by the licensee to\nserve the Schenectady area,4 nevertheless, the station’s\npresent operations clearly fall short of the extreme repre¬\nsentations made when Western Gateway was competitively\nseeking approval of a new station as against Van Curler.\nFor example, Station WSNY represented that approxi¬\nmately 20 percent of its time would be devoted to pro¬\ngrams presented by means of mechanical reproduction.\nreligious hymns (presented by talent furnished by local churches and\nschools), a daily devotional program conducted by local clergymen round\ntable discussions embracing all religious faiths, and Sunday services from\nlocal churches; agricultural (1.27 percent), includes market and other\nreports. Farm Bureau topics, Grange notices, and others; news (16.95\npercent), includes during each day, 5-minute newscasts every hour, a 10-\nminute sports review, a one-quarter hour news commentary presented by\nJames T. Healey, two 5-minute local newscasts, and two one-quarter hour\nnews digests; civic (7.84 percent), includes programs concerning the activi¬\nties of various local organizations and institutions, discussions of govern¬\nmental and . civic problems, and broadcasts designed to promote interest in\nthe community, state and nation. Programs presented by means of mechanical\nreproduction would be broadcast for about 20 percent of the time. Material\nfor newscasts would be obtained from a well-known news service and local\nnewspapers,” etc. (9 F. C. C. 92, 96.)\n4 With respect to its statements filed May 24, 1945, Station WSNY de-\ncjares: “WE BELIEVE THAT NO OTHER STATION IN AMERICA\nCAN MATCH THE RECORD OF COMMUNITY INTEREST AND\nIJ/BLIC SERVICE BROADCASTING INDICATED IN THESE VARIOUS\no IATEMENTS.\n[5]"
}