{
  "id": "d1429-7",
  "text": "An examination of the WSNY logs for the week begin¬\nning January 18, 1945, shows, in contrast, that 78 per¬\ncent of the program time of the station is devoted to\nmechanically reproduced programs. At least some of the\ntypes of programs specifically set forth in the original\nrepresentations do not appear on the program schedules\nless than 3 years after the station went on the air.\nC. APPLICATIONS FOR INCREASED FACILITIES:\nSTATION WTOL\nThe relation between the Commission’s renewal pro¬\ncedures and its actions in connection with applications\nfor increased facilities for existing broadcast stations is\nillustrated in the case of Station WTOL, Toledo. (7\nF.C.C. 194.)\nStation WTOL was originally licensed to operate day¬\ntime only; but in 1938 it applied for authority to broad¬\ncast unlimited time. In the hearing on its application,\nthe station relied heavily on the need for added evening\nhours in order to serve local organizations in Toledo, and\nto make use of the live talent in Toledo after 6 p. m.\nThe applicant represented, for example, that after 6 p. m.,\n84 percent of its time would be devoted to live-talent\nbroadcasts; that the Toledo Council of Churches, the\nAmerican Legion, the YMCA and “other worthwhile or¬\nganizations” desired time over the station at night, and\nthat the only other station in Toledo was unable to clear\nsufficient time for such programs because it was affiliated\nwith a national network.1\nThe president of the licensee corporation testified as\nfollows on direct examination:\n“Q. What is the purpose of this application for night¬\ntime hours?\n“A. It is to give the people of Toledo an opportunity\nto have a station which can broadcast a great many\nevents which can not at the present time be broadcast,\nbecause the only other station there is a regional sta¬\ntion with a chain hook-up. For instance, we had dur¬\ning the summer civic opera which, by special permission\nof the Federal Communications Commission was broad¬\ncast. We have had a great many other musical occa¬\nsions which could not be broadcast, although request\nwas made by the managers of musical organizations for\nbroadcasts. We have many important and interesting\nspeakers who come to Toledo for dinner meetings, and\nother occasions, where there is a demand made for\nbroadcasting, and these and other educational features\n1 “The applicant’s proposed weekly program schedule was admitted in\nevidence, and shows, among other things, that approximately 35.5 percent\nof the station’s time will be devoted to news, drama, education, religious,\ncivic, and sports broadcasts, and the remaining 64.5 percent will be devoted\nto musical entertainment, approximately one-half of which will be commer¬\ncial broadcasts. The program service proposed appears somewhat similar\nin character to its existing service, except that a greater percentage of the\ntotal time will be devoted to the use of live talent broadcasts. Approxi¬\nmately 62 percent of the station’s time will be devoted to broadcasts using\nlive talent and after 6 p.m. live talent will be used approximately 84 percent\nof the time. * * *\n“The policy of the station has been, and will continue to be, to give free\ntime to the Toledo Council of Churches for religious broadcasts. This or¬\nganization desires time at night over Station WTOL. The station has also\ncooperated with the municipal and county governments and the various\nagencies of both the State and Federal Governments in giving free time on\nthe station and this policy will continue. The station has given free time to\nthe Toledo Post of the American Legion, the Y. M. C. A., Boy Scouts of\nAmerica, and other worthwhile organizations. These organizations desire time\nover the station at night and will cooperate in furnishing program material\nfor broadcasts. Station WSPD is at the present time affiliated with the\nNational Broadcatsing Company and has been unable to give sufficient time\nto these organizations at night.” (7 F. C. C. 194, 196-7.)\ncan be carried if we have full time operation.” (F.C.C.\nDocket 5320, Tr. 81-82.)\nIn granting the WTOL application for unlimited time,\nthe Commission concluded:\n“Station WTOL is rendering a satisfactory local pro¬\ngram service to the Toledo, Ohio, audience during day¬\ntime hours and a similar program service is proposed\nfor the evening hours which is not now available from\nany radio broadcast station serving this area. The\nother existing station (WSPD) in Toledo is of a re¬\ngional classification and does not adequately meet the\nlocal needs of the Toledo area during the evening hours.\nThere is a need in the Toledo, Ohio, area for the service\nproposed by the applicant.” (7 F.C.C. 194, 198.)\nThe WTOL application was granted on April 17, 1939,\nand eight months later Station WTOL, like the only other\nstation in Toledo, became affiliated with a national net¬\nwork. By 1944 the “local” programs upon which WTOL\nhad relied were conspicuous by their absence. During\nthe week beginning November 13, 1944, for example, ap¬\nproximately 15 percent of the station’s time was devoted\nto “live” broadcasts rather than the 62 percent originally\nrepresented. After 6 p. m., instead of devoting 84 percent\nof the time to local live broadcasts, as represented, Station\nWTOL devoted only 13.7 percent of its time to such\nprograms. Nearly half of the “live” programs, more¬\nover, were wire news involving no live talent other than\nthe voice of a news announcer.2\nIn contrast to its allegations that time after 6 p. m. was\nsought for local public service, the station broadcast only\n20 minutes of local live sustaining programs after 6 p. m.\nduring the entire week—10 minutes of bowling scores\nand 10 minutes of sports news.\nThroughout the week, 91.8 percent of the broadcast\ntime was commercial. No evening time whatever during\nthe week was given to the Toledo American Legion,\nYMCA, Boy Scouts, or any other local organizations\nwhich, according to the representations, desired time over\nthe station at night.\nNor was the time after 6 p. m. filled with commercial\nprograms of such outstanding merit as to leave no room\nfor local service. From 6:15 to 6:30 p. m. on Tuesday,\nfor example, a 15-minute program of transcribed music\nwas interrupted by seven spot announcements—at 6:18,\n6:19, 6:22, 6:24y2, 6:256:26^4, and 6:29 p. m. From\n10:10 to 10:30 the same evening, a transcribed musical\nprogram entitled “Music Hall” was interrupted by 10\nspot announcements in 20 minutes—at 10:15, 10:16,\n10:20, 10:21, 10:22, 10:23, 10:25, 10:26, 10:27, and\n10:29^2 p. m.\nD. TRANSFER OF CONTROL: STATION WBAL\nIn recent years, the purchase of an existing standard\nbroadcast station has become a more common means of\nentering broadcasting than the erection of a new station.3\nThe case of Station WBAL, Baltimore, illustrates the ex¬\ntent to which the service rendered by a station may be\n2 For discussion of “wire programs” as distinguished from “local live” pro¬\ngrams, see “Uniform Definitions and Program Logs.”\n3 During the four years 1941 through 1944, inclusive, 98 new standard\nbroadcast stations were licensed, while 110 were assigned or transferred in\ntoto, excluding merely formal transfers or assignments involving no actual\nchange of control.\n[6]"
}