{
  "id": "d997-13",
  "text": "mm NETWORK\n5-10-54\nPROGRAM OFFERING\nSari#* 54-28 (Sumner 854)\nTitles TOWARD A MORE FRIENDLY WORLD\nTjfp®! Casual chats and interviews\nTims? 15»00 (WILL 3E ON 1st HALF OF REEL WITH \"SPENCER SNOW\")\nNo.? 13 prog...\nOrigins Edwin Randall\nAudience: General\nThe originator of the series describes the purpose of TOWARD A MORE FRIENDLY WORLD\nThuslyi a^he present situation is so desperate not at el. just because we are in\ndanger of blowing ouraf&Xves up but because there is so much of hate and distructo „ * 0\nell of which leads us to think of others more disparagingly than we ougjbt****There\nis* on the other hand, all too little thinkingef other people as potential friends\nand so conducting ourselves as to be their friends and win their good ikLll*,**., This\nseries is just one person s effort to point in a direction where he has himself seen\nlight and where he believes others willing to geek can aloe find illumination for\nthis dark time**\n1» INTRODUCTION: FRIENDLIRSSS IS WHAT PAYS OFF. This is an idea basic not only to\nChristianity and Judaism but also to democracy*\n2v CULTIVATING YOUR IMAGINATION, Science and mechanical progress have widened our\nContacts faster than imagination has been able to keep up with them®\n3. PEOPLE ARE PEOPLE WHEREVER,, This is a fact testified to particularly by the young\npeople of the International Farm Youth Exchange who live In homes in ether lands and\nso are sell qualified to speak„\n4c SOMETIMES WE DON’T LOOK SO GOOD OURSELVES* Maybe v© ought to have more sympathy\nand certainly we should have more understanding of some of the people who don’t think\nso sell of use,\n5* THE WORLD IS AT OUR FRONT DOOR* W© used to have to send people to foreign lands\nto tell them about the USA* Now there are more than 30-thousand students here to learn.,\n6* MOST PEOPLE ARE FARMERS. Consequently ®orae of the most serious of the world9s pro¬\nblems are farmers9 problems*\n?» EVERYBODY GETS SICK* But we know enough about disease now to keep a lot of people\nfrom getting sick so much and from dying so soon*\n8* WE’VE NC CORNER ON BEAUTY, TRUTH, OR GOODNESS, These things, shared, are multi¬\nplied and everyone enriebad*\n9* WE SHARE AIR AND WATER, IF NOT THE LAND. Friendly coo. eration on weather, traffic\nrules of the sea, use of the air waves, and so on is a simple essential of daily livings\n10* IGNORANCE IS NO LONGER NECESSARY.It8s an interesting fact that people aren’t dumb\njust because they can’t read and write, but they don’t want to stay ignorant and they\nare convinced that they don’t need to*\n11* NOBODY HAS TO BE HUNGRY. There’s no magic way to produce suddenly enough food\nbut friendly skill is finding a way.\n12* WE WAIT TO make LIFE LIVABLE INSTEAD OF ENDURABLE, Most of the people of the world\ndon’t get much out of life according to our standards. But the odd fact is that the\nmore they get out of it the more we can get out of it*\n13• FRIENDLINESS TAKES PATIENCE. IT also takes courage. Hate and ill will die slowly and\ngood will must be tenderly nourished often at great risk.\nPROGRAM OFFERING"
}