{
  "id": "d997-73",
  "text": "EEPORT OF THE NETWORK MANAGER\nOctober 1, 1955\nAlthough the Network member stations have been kept informed through various memo¬\nranda and reports, a few remarks on the state of the Network project are appropriate\nhere.\n1. NETWORK MEMBERSHIP. Immediately prior to the 195b NAEB Convention, the Network\nhad 72 member stations. Since that time seven stations have joined or rejoined\nand eight have dropped out, making a present membership of 71 stations.\n2. NETWORK PERSONNEL. The Network Headquarters personnel now consists of the\np.qnjvflj ftnt. of \"four and one-half full-time employees# Extra workers are picked\nup only when necessary. Since this is the first year in which the Network has\nbeen self-supported, we are particularly careful not to make any unnecessary ex¬\npenditures or hasty commitments# Nevertheless, it is only fair to say that the\nNetwork Headquarters is working with an absolute minimum in personnel, actually\nwith one half-time person less than it did two years ago#\n3. NETWORK EQUIPMENT. As noted above, the installation of an air conditioner in\nour workshop has been helpful in maintaining recording quality, and we hope it\nwill help in the preservation of our 8,600 tapes. The conversion of the two\nmass-duplicators should also be helpful. On the whole, the duplicators have be¬\nhaved much more respectably during the past year, but they still have not been\ncompletely tamed and they show temperament from time to time. A large part of\nthe improvement can be credited to Cecil Bidlack, the NAEB Television Engineer,\nand Glenn Blackburn, the Networks Assistant Manager for Production, who have\nexpended much thought and effort on the equipments care.\niu TAPE SUPPLY. The Networks greatest problem at the time of this writing is that\nof maintaining an adequate supply of tape at Headquarters to produce recordings\non schedule. The rate of tape-returns decreased considerably this fall with the\nresult that recordings are being mailed to the stations five days late# Some\nstations have 350 unreturned tapes, enough for one-third of a week*s output at\nNetwork Headquarters. Reminders that tape must be returned or traded in order\nthat the Network may continue operation have been published in the NAEB News¬\nletter and the Network cue-sheets, and the Executive Director has telegraphed\nrequests to several stations for the return of tapes. After all due discussion\nand consideration, we have come to the conclusion that for the sake of the ma¬\njority, the Network must discontinue service to those stations which hold up\nlarge quantities of NAEB tape*\nNETWORK HEADQUARTERS OPERATION. The Network Headquarters manner of operation\ncontinues much the same as last year. An attempt was made to divide the broad¬\ncasting year into a summer season and two long seasons, fall-winter and winter¬\nspring; but the results of a survey indicated that four thirteen-week seasons,\nbeginning with the first week of each calendar year, were preferred by the ma¬\njority of the membership, and the Network Headquarters plans to continue on\nthat basis. A number of changes in clerical methods have been made, and con¬\ntinue to be made, in the interests of efficiency and accuracy."
}