{
  "id": "d1874-2",
  "text": "PLACEMENT AD\nNovember I — Graduate of radio and TV school, with degree\nin production, desires a position as TV cameraman or\nradio announcer. Male, 27 years old, single. Prefers\nWest, but will consider other locations. $4800 minimum.\nCouncil, for outstanding contributions in support of\nU. N. activities. WGBH recently covered “live” the\nGeneral Assembly sessions via U. N. Radio.\ny The 2.014 individuals enrolled for credit in the\nnine courses currently being offered over Chicago\nCity Junior College’s TV College represent a 48 per\ncent increase over the ^959 total.\ny Syracuse University’s TV-Radio Center recently\nconducted a five-week international broadcasting sem¬\ninar for sixteen broadcasters from thirteen nations.\nAfter attending lectures and discussions at Syracuse,\nthe broadcasters scattered throughout the country to\nobserve and study networks and other broadcasting\norganizations here.\ny Marquette University, Milwaukee, is planning “a\ncomprehensive program of community education\nthrough radio and television,” and has appointed a\nnew committee on radio and TV. Raymond T. Bed-\nwell, Jr., head of the radio-TV department of the\nMarquette speech school, was named staff assistant\nto the committee and will act as program administra¬\ntor for radio and TV in the division of continuing\neducation.\ny WHYY-FM, Philadelphia, this month began\nairing two college credit courses: History of Ameri¬\ncan Democracy and The English Language. These\nare said, to be the first such college credit courses\npresented on FM radio.\ny The Empire State FM School of the Air this\nfall is broadcasting one hour per day throughout\nNew York State. The School has received an extra\nhalf-hour per day from all the commercial FM sta¬\ntions through whose facilities the broadcast is carried.\ny Glamour Magazine featured Station WUOM,\nUmversityArf-Michigan, in its September issue.\ny The Corning (N. Y.) City School District has\nreceived a $50,000 grant from the Corning Glass\nWorks Foundation to continue its experimental\nETV project. This month the project will provide\none hour of daily evening cultural, adult education,\nand civic programing for the community. This is\nin addition to the three hours of in-school program¬\ning carried for the past year. The school-owned fa¬\ncilities distribute through a community cable system.\ny Theodore O. H. Karl, director of the Department\nof Speech at Pacific Lutheran University (formerly\nCollege), Tacoma, Washington, will be in charge of\nthe CCTV program at the university, and he and\ntwo other professors will teach entirely via TV. The\nCCTV system was installed during the summer, and\nincludes seven sources of pictures distributed about\nthe campus and two new studios and control rooms.\nThe system comprises a five-channel chain with one\ncamera fixed in the auditorium.\n► RCA has announced a new low-cost portable tape\nrecorder, built to withstand prolonged rise in schools\nand language laboratories.\n► WJCT, Jacksonville, Florida, hopes to be oper¬\nating from its new studio building by January 1,\nwith new studio equipment received under a $100,-\n000 grant from the Fund for Adult Education. For\nthe past two years WJCT has operated from fa¬\ncilities of two local commercial stations.\ny Ohio State University has appropriated $25,500\nto equip a studio and classrooms on the campus as\nthey would be used in an ETV teaching situation. The\nproject will attempt to answer the question of what\npart the teacher’s presence plays in the learning'pro¬\ncess. - - _ .\ny Thompson Ramo Wooldridge Inc. (parent com¬\npany of Industrial Associate Dage Television) has\nformed an Educational Electronics Division to market\nits electronics products for use in schools. These in¬\nclude CCTV systems, language laboratories, teaching\nmachines, special disc tape and tape magazine re¬\ncording systems, tape magazines, tape duplicators, and\nelectronic classrooms.\nPROGRAMS\ny Radio stations of the Wisconsin State Broadcast¬\ning Service will air a survey course on the history\nof the religions of the world.\ny Executives and businessmen have agreed to appear\non a program over the Alabama ETV network on\n“Human Relations and Personnel Management.” The\nexecutives will tell how they have obtained their\npositions and will offer advice for those entering the\nmanagement field.\ny WNYC and WNYC-FM on October 24 broadcast\nlive from Geneva, Paris, and New York the annual\nUnited Nations Day Concert, featuring world-fa¬\nmous orchestras and soloists. This was in keeping\nwith a tradition of many years.\n► WTTW, Chicago, recently told the story of a\nneighborhood’s struggle to keep from slipping into\nthe slums. Interviews with neighborhood leaders and\nfilmed sequences of the community’s growth Were\nused.\ny WOI and WOI-FM, Iowa State University, have\ninstituted a Sunday afternoon program offering sub¬\njects under such headings as light music, history,\nscience, arts, social studies, and stereo concerts. Called\n“Seminar,” the program lasts four and a half hours.\ny KQED, San Francisco, recently broadcast a spe¬\ncial half-hour documentary, “Main Street — San\nFrancisco,” using a montage of still photographs re¬\nflecting the atmosphere, past and present, of the\nwaterfront.\nNOVEMBER 1960\n3"
}