{
  "id": "d682-120",
  "text": "THE NAEB NETWORK\n• WHAT IS IT?\n- It is an organization which each year distributes dozens of radio series - hundreds of\nprograms - to its members,\n. WHO COMPRISES ITS MEMBERSHIP?\n- Its membership consists of 76 non-commercial radio stations owned and operated by active\nmembers of the National Association of Educational Broadcasters - the NAEB.\n• HOW IS IT ORGANIZED?\n- The NAEB Network is directly responsible to its members and their accredited representatives.\nIts programs are selected by commit tees appointed by the president of the NAEB. They are then\ndistributed to NAEB Network member stations by a Network staff employed by the NAEB.\n• WHERE DO NAEB PROGRAMS COME FROM?\n- NAEB members: Produce over 50% of Network programs.\nOther organizations: The Air Training Command, Radiodiffusion Television Francaise, The\nCommittee for Free Asia, etc.\n- Grants-in-Aid: The NAEB has administered grants from the Fund for Adult Education and the\nEducational Television and Radio Center totalling $200,000 in the past three years to enable\nNAEB members and other educational organizations to produce outstanding educational programs.\n- NAEB production: With financial aid of the Fund for Adult Education, the NAEB has produced a\nnumber of notable series: The Ways of Mankind, The Jeffersonian Heritage, etc.\n• WHAT KINDS OF PROGRAMS DOES THE NAEB NETWORK DISTRIBUTE?\n- Music -- lecture -- discussion panels -- children's programs -- interviews -- drama -• in-school\nlistening programs.\n• HOW DO NAEB NETWORK PROGRAMS DIFFER FROM COMMERCIAL PROGRAMS?\n- NAEB Network programs are primarily content-oriented, although technical and format consider¬\nations are by no means forgotten.\n• HOW ARE THESE PROGRAMS DISTRIBUTED?\n- The recordings are mass-duplicated on special equipment at the NAEB Headquarters with weekly\nshipments to each member station.\n• HOW MANY PROGRAMS ARE MADE AVAILABLE TO MEMBER STATIONS?\n- At least 8 hours of programming each week. Since the Network was founded in 1950, member stations\nhave aired a combined total of almost 50,000 hours of NAEB Network programs.\n• WHAT ABOUT IN-SCHOOL PROGRAMS?\n- Besides the series mentioned above, from 5 to 12 in-school series are distributed for use during\neach semester.\n• HOW IS THE NETWORK FINANCED?\n- Foundation aid: This year approximately one-fifth of the cost of operation is underwritten by\na grant from the IT. K. Kellogg Foundation.\n- Membership assessment fees: Member stations are assessed according to transmitter power from\n$225-S600. A small additional fee for in-school programs is charged in some cases. Next year,\nwhen the assessment fees are raised to $300-$800, the Network will be entirely self-supporting.\n• ISN’T THAT QUITE EXPENSIVE?\n- On the contrary. You will find that it costs less to broadcast NAEB Network tapes than to\nprogram classical music.\n• WHERE CAN I GET FURTHER INFORMATION?\n■ Write to —\nTHE NAEB NETWORK,\nltt GREGORY HALL, URBANA, ILLINOIS."
}