{
  "id": "d682-127",
  "text": "the Twentieth Century Fund, the Lowell\nInstitute, the Rocky Mountain Radio\nCouncil, commercial stations and net¬\nworks, university sponsored conferences,\nand various public service institutions.\nThe programs to be used by the net¬\nwork are selected by a program com-\nmitteee composed of representatives of\nmember stations throughout the country.\nThe programs to be used are assembled\nat network headquarters at the Univer¬\nsity of Illinois where they are checked,\nedited, and made ready for duplication.\nAs the name implies, the entire opera¬\ntion of the network is carried on through\nthe use of magnetic tape. The network\nnow has a duplicating machine at net¬\nwork headquarters which is capable of\nreproducing ten copies of a program per\nrun-through, at fast speed. Through\nthe use of this high-speed duplicator a\ncopy of each program can be made for\nevery member station.\nBefore the network begins to process\nthe tapes, the stations are given informa¬\ntion on programs which will be avail¬\nable and are supplied with tentative in¬\nformation on each program. The in¬\ndividual member stations are free to ac¬\ncept or reject programs on whatever\nbasis they choose. On this purely volun¬\ntary basis, acceptance and use of net¬\nwork programs reaches a significant fig¬\nure, and upwards of ninety per cent of\nthe stations use any given series of pro¬\ngrams.\nThe tape network is in actuality\ngoverned by its member stations, since\nit is responsible to the board of directors\nof the NAEB, elected annually by sta¬\ntion representatives.\nThe financial support of the NAEB\nnetwork is, of course, a significant prob¬\nlem. When the network was originally\nfounded, it was anticipated that it would\nbe supported on a mutual basis by its\nmember stations. While this is a sound\nplan, it soon became apparent that some\noutside help would be needed during\nthe formative years. In June of 1951, it\nwas announced that the W. K. Kellogg\nFoundation of Battle Creek, Michigan,\nhad made a generous grant to the NAEB\nfor the general purpose of stimulating\nand expanding educational broadcasting.\nIncluded in this grant were funds to\nassist in the establishing of an educa¬\ntional network. Funds for the first year\nprovided the necessary equipment to\noperate such an enterprise, and an ade¬\nquate operating budget. In the three\nsucceeding years a diminishing propor¬\ntion of the annual operating budget is\nprovided. During this three year period,\nthe member stations assume an increas¬\ning share of the operating cost, Finally,\nbeginning with the fifth year, the mem¬\nbership of the NAEB undertakes full\nfinancial responsibility for the network\noperation.\nEducational broadcasters in general\nfeel a justifiable pride in the achieve¬\nments of the network to date. Coupled\nwith this pride in past accomplishments\nis great enthusiasm for the future. When\nthe final organization of the network is\ncompleted, it will be possible to expand\nthe programming to as much as five\nhundred hours each year. A constant\nsearch is carried on to find more fine\nprogram material.\nOne stimulating prospect for the fu¬\nture is exemplified by the recent grant\nto the NAEB by the Adult Education\nFund of the Ford Foundation, for the\npurpose of producing several program\nseries. Through grants of this type, per¬\nsons with wide experience in both edu¬\ncation and broadcasting have the oppor¬\ntunity to bring together outstanding\nsubject-matter experts and the finest radio\nwriters and producers.\nAnother major step forward in the\nnetwork’s progress is the distribution of\nprograms designed for in-school listen¬\ning.\nThe NAEB hopes that its network\nwill continue to grow, and will continue\nto expand its position as the chief source,\nin the United States, of mature and in¬\ntelligent radio fare.\nNOVEMBER, 1953\n3"
}