{
  "id": "d682-129",
  "text": "Notes from Our Listeners\nEditor’s Note: Many of our listeners\ntoo\\ pen in hand to send notes of\ncomment, criticism, and than\\s along\nwith their Bulletin renewal coupons.\nThe WOSU staff is extremely grateful\nfor these letters and cards, and we are\nonly sorry that it is obviously impos¬\nsible to answer each one personally.\nWe would li\\e to use this page of the\nBulletin, however, to share with you\na few of the interesting comments\nwhich we received.\n“I would like to take this opportunity\nto thank you for the excellent selection\nof music which you present daily. For\na high school student, such as I am, who\nis very interested in hearing classical\nmusic by renowned artists and orches¬\ntras, I firmly believe that your station\ncannot be surpassed. Listening to your\nmusic programs proves not only enjoy¬\nable but also extremely educational for\nanyone who is striving to follow a career\nin music.”\n—Dayton, Ohio\n“We have been somewhat disappointed\nin your programming of late. There is\nentirely too much popular music which\ncan be had if we change our dial to\nanother setting. Being the only station\nwhich carries classical music in these\nparts, we would prefer more of that\ntype of music from you. We expect the\nbest from an educational institution such\nas OhiQ State.”\n—Cleveland, Ohio\n“We enjoyed your broadcasts very\nmuch while we stayed in your town, in\nfact, we think it was the best we have\nheard in the U. S.\n“As a native of Switzerland I specially\nenjoyed your literary courses which gave\nme an insight into the English language.”\n—Washington, D. C.\n“For many years I’ve been most ap¬\npreciative of the wonderful music from\nWOSU. However—here we go! It\nseems to us that in making up the pro¬\ngrams of the recordings there is a change\ntaking place. I’m a lover of Wagnerian\nmusic and also Beethoven and I do not\nfind as much of either as formerly. Or\nis it that you do present it at different\nhours from that formerly presented?\n“We also do not like the Symposium\nat 3 p.m. At that time we are so tired\nthat we get very little from it and we\ndo prefer more music.”\n—Marysville, Ohio\n“During almost one year of “bed resi¬\ndence” I have depended upon your pro¬\ngrams both for consolation and for\ngrowth. You have offered your listeners\nof all classes—it seems to me—oppor¬\ntunity for self-entertainment—incentives\nto “look up” worthwhile food for\nthought during the long hours.”\n—Wilber force, Ohio\n“My one suggestion I’ve beeen want¬\ning to make for a long time is that I\nwish you could find time for a program\non child care, child psychology, etc. Is\nanything more important? We are\ntrained in school for everything but how\nto be good parents and handle children\ncorrectly.”\n—Columbus, Ohio\n“During the last several months I have\nbeen dismayed to note that you have\ngone to considerable length to give your\nlisteners a heavy diet of the lesser known\nmusicians along with a great percentage\nof vocal works. I would say that you are\nlimiting your audience in this manner.\n“I would like to put in my two cents\nand say return to the tried and true\nmasters. We have only a limited time\nto listen to music and don’t give us so\nmuch chaff with the grain. Give us more\nBrahms, Wagner, Beethoven; we’d like\nto hear them a dozen times daily.”\n—Xenia, Ohio\nNOVEMBER, 1953"
}