{
  "id": "d682-38",
  "text": "naeb program format\n(NAEB Network Report—Appendix B)\nOct, 30, 1953\n11-13-53\nTO: ALL MEMBERS\n1) All programs submitted to the Network must run within and close to standard\ntimes,ie. 14:30, 29:30, 59:30, etc.\n2) All programs must end with the NAEB station break: \"This is the NAEB Network.”\n3) All timely references must be deleted; eg. non this evening*s program,*’ ’’Good\nmorning,’’ ’’Goodnight,” ”be back next Tuesday,” \"the President’s latest speech,\ngiven last week,” ”to be published next November.” (The program may not be\naired until long after \"next November.”)\n4) When a program running an hour is submitted, neither reel should run more than\n30:30 (nor the total time more than 59:30, of course). In the case of music it\nmay be necessary to break this rule and run a reel as long as 31:00. But,\nplease, do not do this if you can possibly help it. We may not be able, to dup¬\nlicate the long reel. If there is absolutely no way of putting a 59:30 pro¬\ngram on two reels, put it on three.\n5) All programs should indicate somewhere, preferably at both the beginning and\nthe end, that they are tape-recorded, recorded, or tape-transcribed.\n6) All programs should, if at all possible, credit the National Association of Ed¬\nucational Broadcasters at the beginning and/or the end.\n7) Please send CUE SHEETS for all programs sent to the Network for distribution.\nCue sheets should include: a) series title, b) program title and/or subject\nmatter, c) names of speakers, musical numbers, d) cues, e) accurate times, f)\na note as to whether or not recording is credited (and it should be if at all\npossible), g) any notes as to quality or contents which might interest broad¬\ncasting stations.\nNOTES\n1. Please mark all submissions \"Audition” or \"Master” and \"Do Not Erase.\"\n2. Do not pack sample program tapes or master tapes of programs slated for dis¬\ntribution together with used tapes being returned for erasure. Please pack\nseparately and mark as noted above.\n3. It is perfectly all right to take tapes from your weekly shipment from NAEB 8c,\nafter playing, erase and use to submit auditions or masters for the new series\nyou are contributing to NAEB Network. But if you do this, please let us know,\neither by letter or by marking the boxes clearly. We want to be able to credit\nyou with having returned the tapes.\n4. To help insure proper handling of your submission, address it according to its\ndisposition; for instance: AUDITION\nNAEB Network\n14 Gregory Hall\nUrbana, Illinois or to\nNETWORK ACCEPTANCE COMMITTEE, IN-SCH00L PROGRAM COMMITTEE, or NAEB NEW MASTER\nTAPES, NAEB Network, 14 Gregory Hall, Urbana, Illinois\nFor your own safety, it is best not to send your original tapes. Keep a safety\ncopyj\n5."
}