{
  "id": "d1014-106",
  "text": "-18-\nThere is, it seems to us, a real danger implicit in such an organiza¬\ntion as ours. This danger is that it will, without meaning to do so, tend\nto dominate to some degree programming from the standpoint of ideas and\nphilosophy. We are fully aware of that possibility, and we certainly shall\ndo everything we can to prevent it from happening.\nWe think one of the ways in which we can avoid such an unconscious in¬\nfluence is by calling upon people from all over the country to help as consul¬\ntants, bringing them in on a special job, a special assignment, or a special\nprogram series. Thus, we take into our staff a more varied group, not only\nfrom the geographical point of view, but also from the standpoint of general\nbackground and thinking.\nThis is not the only reason for operating with a comparatively large\nstaff of part-time consultants. We also feel that in so doing we implic¬\nitly say to the people in the field that this is a cooperative enterprise, a\ncommon job, in which their special talents and abilities are needed, I cite\nthe following as an example only.\nBob Hudson, who is in charge of our program development, has a long list\nof possibilities to check and evaluate. Obviously, he can*t examine all of\nthese himself. To handle this problem, we could do one of two things: add\nto our staff a half-dozen people on a full-time basis, or pick up people from\nyour ranks and elsewhere around the country who have special qualifications\nfor the particular job we have in mind. Naturally, we feel that the latter\napproach assures us of highly important skills, which we might otherwise be\nlacking, and also provides more varied approach to the entire programming\nproblem.\nTurning from program production to another area of our operation, it\nalso is becoming increasingly clear to all of us on the staff that we cannot\nhope to develop a great warehouse, or a series of warehouses over the coun¬\ntry, of film materials, and attempt to stock these \"depots\" with all the film\nmaterial which is currently available. It had been proposed that we do this\nby going to the commercial houses that produce and distribute film and making\narrangements to obtain copies of film materials which our affiliated stations\nmight want. Then, instead of dealing with each individual producer, the sta¬\ntions would be able to requisition films from a single warehouse.\nOur reason for not going into an extensive operation of this kind is not\nbecause we think there is no possibility for a real service, but because we\nfeel we can gain the same end without getting involved in such a large-scale\ndistribution setup that it might become the tail that wagged the dog. In¬\nstead, we are giving serious consideration to a plan of working with station\nmanagers and potential suppliers of educational film to obtain a more favor¬\nable arrangement based upon multiple usage. This eliminates the necessity\nof setting up and maintaining the physical distribution facilities for such\nan operation. At the same time, I should add, we are not ruling out the pos¬\nsibility of obtaining selected programs to be included as part of a program\npacket which the Center will distribute directly.\nTurning now to more specific plans, we have decided—and I hope this is\nnot too optimistic—to offer the stations which will be on the air during the\nfirst part of the year an average of five hours of programming per week be¬\nginning on January 1. At the outset we do not expect to supply a full five"
}