{
  "id": "d1014-52",
  "text": "UNIVERSITY OF CALIFORNIA\nTELEVISION OFFICE\nBERKELEY 4, CALIFORNIA\nJanuary 17, 1964\nHr. Harold Hill, Vice President\nNational Association of\nEducational Broadcasters\nSuite 1119, Dupont Circle Building\n1346 Connecticut Avenue, N. W.\nWashington, D. C., 20036\nDear Mr. Hill:\nJust a note to let you know that I have just had a phone call from John\nWitherspoon at San Diego State College who has learned that he is the\nregional representative on the NAEB Radio Board.\nI thought you might like to know that we have finally locked in. I\nhave been concerned that the NAEB play a role in the Conference but\nfound myself in the position of not being able to do anything until\nsome specific steps were taken.\nThe steps are now being taken. I am certain that the Conference will be\nable to offer a satisfactory meeting opportunity for this NAEB Region.\nWe will be receiving copies of the final Conference announcement for\ndistribution to our mailing list sometime late in the week of the 20th\nof this month. We can make some copies available to the NAEB for\ninclusion with an announcement of the regional meeting (once John\nWitherspoon and the others directly concerned are satisfied that the\ntime and place has been adequately established).\nOur program is developing nicely with some very prominent speakers. I\nbelieve that, at this time, we have 21 confirmed exhibitors.\nI am personally very anxious that this regional meeting be successful.\nThere is a lot of work to be done out here by way of firmly establishing\nthe \"presence\" of the NAEB. This means, as one of the first steps,\ngetting we Westerners -- many of whom did not make it back to the\nConvention -- together in one place.\nIf it is felt that the fact of the Conference and its program can be\nused to help pull people out of the woodwork, then let me know and I\nwill do whatever I can to provide you with up-to-the-minute information\nabout the developments of the Conference.\nYours truly\nKen Winslow, Chairman\n1964 Western Radio &\nTelevision Conference\nCC: Betty McKenzie"
}