{
  "id": "d1014-8",
  "text": "February 4, 1965\nHr. Jamas M. Morris\nHead, Information Services\nOregon State System of Higher Education\n230 Agricultural Hall\ndiversity Campus\nCorvallis, Oregon 97331\nPear Jimmie:\nPresent plans, subject always to suggestions toy anyone, for the\nftegion 71 meeting' are as fellows*\nOn Thursday evening, X will make a general report about the\nAssociation, its activities and its plans for the future* This\nwill toe followed by a presentation of one of the six films in a\nseries on utilisation of tolevlsion in instruction* This is an\nexcellent film which will give the members in that area a preview\nof what to expect from the series* I believe this will be worthwhile\nand well received*\nTo present the film, 2 will need a 16mm sound projector and whatever\nsine screen the sine of the meeting dictates* 2 trust you will have\nthe equipment and an operator on hand* tty talk and the film will\ntake perhaps an hour* There will certainly be some discussion\nfollowing the film, and 2 am herewith asking the directors from\nSteglon 71 to serve with me as a general panel to answer questions\nabout the SASH and its activities if time permits after the presen*\ntat ions*\nThe most important contribution by the directors can be node on\nFriday morning when each of the three institutional divisions\n(radio,television, and instructional) have their division meetings.\nAt that time each one will be able to discuss what his division is\ndoing at the present time and plans for the future — and answer\nany questions the members may have*\nIt is my understanding from John Crabbe that it would not be feasi¬\nble to hold a meeting of Individual members because met of them\nwould mat to attend the other meetings* However, I do feel that\nwe should provide an opportunity for sqm sort of meeting for those\nIndividual members who are interested in such a meeting to talk about\nthe special interest sections within the division* X will touch\non this in my report and then X believe we should have an opportunity\nat the end of the Thursday evening session for Crabbe and I to moot\nwith members of the Individual member division* Perhaps we might"
}