{
  "id": "d1014-97",
  "text": "-9-\nTransportation to some places is difficult, but even this, with the feeder\nairlines that we have nowadays, is not a serious problem,\n6) REPRESENTATION OF ASSOCIATE MEMBERS ON THE BOARD, The REGION VI\nmeeting evidently agreed that Associate members do not need representation on\nthe Board, It also appears that you felt that the NAEB should continue to be\nan Association of operating stations. While your discussion tended to make\nthis an either/or proposition I do not view it as such, I think we should\nmake every effort to cultivate Associate members and I think they should be\neligible for Board membership just as any Active member is eligible for Board\nmembership, I do not believe that the sheer fact that the NAEB now allows only\noperators to be Active members and only Active members to be officers or Board\nmembers has anything to do with the desire or ultimate consummation of plans\nfor an institution to operate a station of its own. This has a corollary,\nof course, in nShould NAEB Network programs be made available to Associate\nmembers?,, I have always held that Associate members should have a way of\nsecuring certain programs from the NAEB Network. Here I am inclined to agree\nwith Dr. Neitfburn that in those situations where there is no educational sta¬\ntion, service should be given educational institutions who have agreements\nwith commercial stations. You always have to put in, of course, the restric¬\ntion that only certain programs will be available because of copyright, union\nand other factors.\n7) NETWORK ASSESSMENT FEES. The discussion about fees was most inter¬\nesting. I can see your fine hand in this topic. I also see that you were\nquite vocal on your \"FIFTH YEAR PLAN.\" As you know, this is one point on which\nwe have always agreed* Like you I do not feel that we do enough to support\nour Association. I know that each institution is going to have to do more.\nYour FIFTH TEAR PLAN is a very fine start in the right direction. I am sorry\nto see that some of the members still do not understand the provisions of the"
}