{
  "id": "d25-1",
  "text": "(2)\nhaven't already. The proposal will need to carry the\nargument Independently. The bibliography is primarily to\nshow that he has background in the field and an interest\nwhich hasn't simply been aroused when the possibility of\ngovernment money came up — and, who knows, perhaps someone\non the committee will look up some of the references.\nClarification by example, I believe, could greatly strengthen\nboth the objectives and the procedure sections. For example,\nwhat are one or two things that might wind up in the handbook\nwhich would assist in media perception and judgment? What\nis meant by media perception? An example or, even better,\na few examples to show what he means by the syntactics of\ntelevision would be quite helpful.\nSecondly, I believe the procedure section| needs to be\namplified. He says the work of Girrard is \"another example\nof the sort of aid which this project would enlist\" but he\nhad no previous specific examples. I believe he needs to\nbe quite specific here — specific people or kinds of people\nhe wants to contact and the kinds of information - again\nspecific - which he hopes to obtain from each. I realize,\nand I am sure the committee will realiaiise (at least I hope\nthey will) that one cannot be quite as specific in this sort\nof projedt as in many other types of studies. However, the\nmore specific Marshall can be, I believe the better the\nchances of getting money to support the project.\nIn the writing of the proposal, McLuhan will need to shift\ninto low gear in my opinion. His writing generally reflects\nhis rapid-fire thinking. I am afraid that many members of\nthe group which passes on these proposals may become completely\nlost if they miss one of the logical leaps ar turns. McLuhan's\nwriting reminds* me of a fine ballerina who is impressive\nand lovely to follow but whom one must watch quite carefully\nand knowledgably (if that is a word) in order to fully\nappreciate the artful expression. I am not sure that a\ncommittee passing on research grants will read this carefully\nor knowledgably.\nThose are my reactions for whatever they might be worth.\nCertainly hope that you push ahead with this. I would love\nto see the results of McLuhan's work.\nBest\nSamuel L. Becker\nHope that you and the rest of headquarters staff have a good\nholiday — and some vacation. Ruth is still holding out.\nI have fchixxx this meeting in Chicago next week -- which is\nprobably when she will pick to have the baby."
}