{
  "id": "d25-3",
  "text": "larger context. Let us ask what varied roles the teacher will THE radio news analyst would never have\nplay and how to prepare him to perform these roles with thieved his wartime eminence if those men who\nnrofessional distinction made the Sreatest reputations had not already\nprofessional distinction. . _ achieved distinction for the contributions they had\nFirst, the able teacher is a person who knows himself and made to the general cultural renaissance that began\naccepts himself. Socrates, a model teacher, said: “The un- about 1910 or ’12 and continued into the early\nexamined life is not worth living.” He also made it clear ^o’8- 1 am thinking specifically of H. V. Kal-\nthat the resulting accepted values were worth dying for.\nIndeed, thejeacher, more than jury other person, must ^ medium of radio but who had already equip-\nknow who he IS, what he .believes, where he -is now,-and ped themselves to play distinguished and creative\nthe direction in which he is headed. I don’t suggest that the Parts m the cultural of their times. They be-\n\"teacher must be a paragon. Buthe^Tust have carefully looked '°n«ed “ ,h= 8ene,radon of ,™ter ^Pm3nn>\nir . y . , . . J . H. L. Mencken, and Heywood Broun, three men\nat himself and his ideas, have become conscious of himself who found in neWspaper work the same outlets\nas a unique individual, because the message he communicates and opportunities that others found in radio. It\nwill be most profoundly himself. You can’t separate mathe- was also the time of Scott Fitzgerald, Ernest Hem-\nmatics from the mathematics teacher, or reading from the mSway> RmS Lardner, William Faulkner, Thomas\nteacher of literature. To say this, however, is not to achieve y°lfe; ofpR?Fert Fr“'’ A”y ^\nit. Yet the development of a person who freely and thought- creative wr;ter and artist flourished, and most of\nfully chooses and accepts the consequences of his choice is them made their reputations in their twenties-\nthe heart of liberal and professional education. and thirties. (Quincy Howe, ABC news analyst\nWoodrow Wilson wrote of the time “when a man comes 3nd journalism teacher, at the opening of\nto himself.” It IS hard to say when, how, and where this State Historical Society of Madison, Wisconsin,\noccurs. But the teacher as a person reaches this point when he January 25, 1958.)"
}