{
  "id": "d763-0",
  "text": "lorn City, Iowa\nSeptember S» 1961\nTOs liaeb Members Region IV\nF^CPf* Carl ?!«n«tf (&AE3 Radio Board of Directors Region IV)\nJcshn ScfeflKretsdder Q?A£R Tf 8oard of Directors Region IV)\nDoubtless you have been following KAEB activities through the newsletter\nfend Journal* There ar«, ho»w«r, two or tMve other iteas in which you. as\nRag left IV wesabers, way be inters ted.\n*• ^ tc funds it has been impossible* to hold a Region IV meeting\nstellar to 9*3ch meetings xjhhh have been held i& the past* there is no Question\nriS to the v&ivo of such reacttegs and, we believe, thsrs is general agreement\nthat sc«se closer regional contact Is desirable* In order to supply th*s need\nwe have several suggest! ms to make;\n*• * raglonal seating at n&albers mm responsibility for nmt of\ntheir travel ompenses*\nb* To arrange for a seating of Region I? ambers at the annual conference\nin Ifeshlngton storing the week of Qstob&r 23*\nc„ To pt&lfdh & Region IV newsletter*\na. There Is an alloiiscrti in the BASS Sxafest of $100 per r«|cn for meetings.\nIf a ace ting was to be organized for I cm City* &$ aa ©sample, meeting\nplaces and sots* Incidentals could be taken care of locally. The $100\nfund cmld b% prorated *srang individuals attending cn the basis of distance\ntraveled, but this would actually be a rather insignificant mmmt*\nb. One to the scheduled convent!^ program, the only possibilities for a\nmeeting in ftesfolagten are luncheons m Monday, October 23 or Wednesday,\nOctober 25* T© ©she such a meeting worthwhile, there should be a substantial\npercentage of tsa&terss in attendance and definite advance arrangements\nwould have to be made far the weal, rcor^, program, etc®\nc. It my he desirable to publish a Region Vf newsletter regardless of whether\nmeetings are held* Such being the case, leaser will be glad to take care\noi edit teg, duplicating end -sailing provided contributions of news freest\naetibers are fethccaing.\nII^ A three day seminar ms held in Kadteonk STIcccasin, to examine the\nfunctions of BAEB and to make an attempt to determine what it is, whet It\nc^jht t© beecase, and how to get there® Principal topics diseased y$re\npregrar?s, professional advancement, teacher and edueaticnal develcpnent,\nmember services, preset 1 car* and public relations, prosoti^ial develqpamt and\nactivation, policy guidance and direction, financial support, and international\nrelations end liaison with ail branches of p«*en&9&fit. A complete report will\nbe published end made available to-all active? and associate aeajbers. However,\ndistribution of the report will probably net be made before the October\nconventfon.\nHI. One of the big hopes of MZB t© ja&ke substantial progress, is In.\nexpanding individual membership. He ara not sure how many representatives of\nActive, Associate and Affiliate members tore taken out individual member-\nship, but If ym fmm not done so, we urge you t© consider it. Also, we\nsuggest that you ash members of you? staff t© consider taking out individual\nmemberships. Bet only cm this bmsem the backbone ©f HAEB support, but it\nMings Individuals closer to the nations! seen® aid is a most valuable help\ntheir professional development. Also, if yc*z know of any institution"
}