{
  "id": "d763-17",
  "text": "Skornia: Expressed belief that suggestion might result\nin increased efficiency but had doubts concerning ability\nof any one person to be the sole judge of programs. Cited\nas example the in-school program offerings which must be\nevaluated by people who have a background in school broad¬\ncasting. He also mentioned other specialized fields where\nthe judgment of a group of evaluators is valuable. He said\nthe necessity of rejecting a sizable proportion of programs\noffered by members is already a difficult problem even when\nthe decisions are made by a committee. About half of the\nmember programs offered to the network are accepted now.\nFrom the Floor: Why can’t network subscribers have some\nkind of graduated scale for fees based on the actual hours\nof programs they take as well as the other factors which\nare now used in setting fees?\nSkornia: ’’The answer to that is the network is self-\nsupporting. You’ve got to have a budget. Holt has to be\npaid, the duplicators have to be run, and tapes have to\nbe purchased. You can’t do it if you’re going to let\neverybody take either Rate A, Rate B or Rate C. We\nfigure that when the rate goes up for members (this\nyear it is |>600 and next year probably ^800 for some\nstations) a few will drop out, but we’ve got our budget...’’\nFrom the Floor: How are the A and B rates determined?\nSkornia: ”A” is £,000 watts or over; ”B” is under £,000\nwatts excluding 10 watts; ”C” is 1 to U? and the rest be¬\nlow 1 kilowatt. ”1 don’t know how cheaply people can pro¬\nduce programs on their own stations, but on our rate I don’t\nthink the highest rate stations are paying more than a\ndollar a program. I think it is somewhat less.We\ndon’t see how people can afford not to take (the network\nservice) if they’re going to run a station.”\n(At this point in the Business Meeting the group took a\nbreak for coffee.)\nSkornia: Announced he had brought registration blanks for\nthe annual NAEB Convention in New York as well as copies\nof the tentative program.\nHulls Made general remarks about the role of the NAEB as\nthe organized minority voice in American broadcasting and\nhow, even with much fewer outlets than commercial broad¬\ncasters, NAEB members are able to reach a considerable\nportion of the American public. He cited the excellent"
}