{
  "id": "d763-7",
  "text": "ItaM&dtait; Max’ll reported cm his activities since his election at the\ntesha convention in October, 1950. He has maintained close contact\nwith the Departe&at of Health, Education and Welfare in connection\nwith HARD utilisation of Hill-Elliott mammy <, He also reported that\nthe Magnuses* Bill has been reintroduced in the Senate in the sane\nfern it took in the 65th Congress, and that two similar Bills had\nb*an introduced in the House. Washington sources are optimistic\nabout passage.\nHarley also suggested that the office of President be enlarged to a\nfull-time, paid position, with authority to make policy decisions\nfor the organisation when necessary*\nRelieving a 15 minute break for coffee, the remainder of the aiming\nwas spent in general discussion from the floor. Questions centered\non the reports by Skcrala and Harley, the meeting adjourned for\nlunch at noon.\nthe meeting reconvened at 1$30 with a report by Vogl on payment of\ntravel expenses to the meeting by MAEB, Delegates from outside the\nthin Cities were allowed full round trip reimbursement on the basis\nof six cents per highway mile.\nScfcwerswelder outlined a preliminary proposal to establish an ETV\nnetwork in legion IV. Xt would connect existing and proposed stations\nin Minnesota, Iowa, North Dakota, South Dakota and Nebraska with VBA-TV\nin Madison, Wisconsin. Further extensions were suggested to Milwaukee\nand Chicago, and into Montana. Considerable discussion from the floor.\nFollowing coffee break, resolution# were passed instructing Schwarswalder\nfee apply for funds under Title FIX of the Hili«SlUott Act to conduct\ndetailed engineering, program and administration surveys on the above\nproposal, and vseomnendisg to the FCC that a “drop in\" reservation on\nChannel 10 be node in the Madison, Minnesota, area to assist la the\npursuit of the network proposal.\nGeneral discussion of miscellaasous legion XV affairs.\nXt being noted that Vogi was raking random notes, the Chairmen moved\nthat ha be designated secretary of the meeting. Motion carried with\none dissenting vote.\nMeeting adjourned at approximately 4*30 FM.\nRichard F. Vogl, Secretary\nJanuary 19, 1959"
}