{
  "id": "d1200-3",
  "text": "NAEB NEWS LETTER\n-4-\nOctober I, 1941\nof WNYC, New York City8s own station, it has been announced by M. s. Novik,\nDIRECTOR OF THE STATION. Mr. COHEN WILL BE IN CHARGE OF PRODUCTION AND\nActing Program uirector.\nOne of the pioneers of Radio in education, Mr* Cohen was Production Director\nfor the United States Office of Education, producing such shows as mThe\nWorld is Yours,” and”Americans All, Immigrants All®” He was one of the\nfounders and the first director of the New York University Radio Workshop,\nTHE FIRST OF ITS KIND IN THE COUNTRY. ^OR THE PAST YEAR, HE HAS BEEN WORK¬\nING on « Rockefeller grant as head of the Radio Research Program of the\nLibrary of Congress.\nFUNDS FOR NEW YORK FM STATION\nThe New York City Board of Estimates has approved a $16,000 apprqpriation\nrequested by WNYC, municipally-owned station, for the construction of an\nFM station. Construction will begin as soon as equipment can be obtained.\nOrders for the transmitter and other equipment will be placed soon. The\nFCC last June issued WNYC a construction permit for a 1000-watt FM station\nto operate on 43.5mc., with the call W35NY*\nThe FM station will give New York City broadcast facilities during la e\nEVENING HOURS. WNYC IS NOW REQUIRED TO SIGN OFF AT TIME VARYING FROM\n10 P.M. IN MID-SUMMER TO 5:30 P.M. IN MID-WINTER BECAUSE IT IS ON THE SAME\nFREQUENCY WITH WCCO, MINNEAPOLIS.\nNAE8 PACKET\nThe NAEB Packet will be mailed to members about October 20. It will con¬\ntain A NUMBER OF ITEMS OF INTEREST TO YOU. Dqn9T OVERLOOK THIS SERVICE OF\nNAEB. Seek and you will find some good program ideas. You will learn\nWHAT OTHERS ARE DOING. In SOME CASES IT WAS NOT POSSIBLE TO INCLUDE EVERY\nITEM BECAUSE OF THE LIMITED SUPPLY. In OTHER CASES, THOSE ATTENDING THE\nPurdue Convention had a chance to get oopies, and the secretary has assumed\nCHANCES WERE NOT OVERLOOKED. ITEMS WHICH WILL BE INCLUDED IN ONE OR ALL\nPACKETS ARE:\n1. RADIO PRODUCTION FOR RECREATION, Kentucky WPA Recreational Project.\n2. Annual Report, WILL, for year ending July I, 1941.\n3. Association for Education by Radio promotional material.\n4. JOURNAL OF THE AIR, VOL. I, NO. I (AER OFFICIAL PUBLICATION)\n5. University of Kentucky Radio Programs.\n6. Music of the Masters, WILL.\n7. Wisconsin School of the Air, Advance Information.\nWisconsin College of the Air, 1941-1942. Aii^iio„ Ce.rtT(rilQc.D\n640 On Your Dial, The Voice of Iowa State, July,August,September.\nW 0 S U Program Bulletins for July and October\nK 0 a C School of the air, Teachers’ Guide, Fall, 1941-42.\n8.\n9.\n10.\nIt.\n12.\n13.\n14.\nChildren’s Book Week, 1941,\nAround the Radio Circuit, October, 1941.\nThe Masterwork Bulletin, WNYC, September and October, 1941."
}