{
  "id": "d1200-5",
  "text": "NAEB NEWS LETTER\n■6-\n0CTOBER I, 1941\nHOME BUILDING AND DECORATION, GARDENING, CHARM THROUGH PHYSICAL CULTURE,\nMUSIC, LAV/ FOR WOMEN AND MANY OTHER PHASES OF HOMEMAKtNG.\nAN ARMCHAIR TRIP TO ONE OF THE TWENTY LATIN AMERICAN COUNTRIES WILL BE MADE\neach Tuesday evening, starting in November.\nK F K U HAS BEEN ONE OF THE PIONEERS IN OFFERING LESSONS IN SPANISH. FOR TEN\nyears Spanish has been given from the Unive&sity*s broadcasting station as\nA SUPPLEMENTARY RADIO COURSE TO THE CLASSES IN THE SECONDARY SCHOOLS AND FOR\nALL ADULTS WHO ARE INTERESTED IN LEARNING THE LANGUAGE OF OUR NEIGHBORS TO\nthe south. This year the Spanish lessons may be heard on Tuesday and Thurs¬\nday AFTERNOONS AT 3:15.\nFAMILY LIFE FORUM RETURNS TO W N A D\nFirst Family Life Forum broadcast of the school year will be given on W N A 0,\nOklahoma University radio station, on Monday, October 20, Miss Alice Sowers,\ndirector of the Oklahoma Family Life Institute, has announced.\nThe broadcasts, round-table discussions by groups of state high school studenti\nwith miss Sowers as leader, this term will center upon the Oklahoma bill of\nRIGHTS—LIFE, LIBERTY AND THE PURSUIT OF HAPPINESS.\nTwo new programs becoming bopular with the listeners this year of W N A 0,\nOklahoma University radio station are the daily campus news broadcast and the\nDAILY SPORTCAST. BOTH PROGRAMS ARE PRESENTED BY STUDENTS IN THE UNIVERSITY\nSCHOOL OF JOUNALISM8 S RADIO NEWS CLASSES DIRECTED BY CHARLES H. BROWN,\nJOURNALISM PROFESSOR, AND ARE PREPARED IN CO-OPERATION WITH THE OKLAHOMA\nDaily, Oklahoma University student newspaper.\nNoel Kaho, Claremore, author of \"The Will Rogers Country” and formor news¬\npaperman, HAS JOINED THE STAFF OF H A D, AS HEAD OF THE SCRIPT DEPARTMENT.\nThe 35 YEAR OLD WRITER WILL AID STUDENTS IN PREPARATION OF MATERIAL FOR BROAD¬\nCASTING.\nWilliam Edmund Durham, former band and orchestra director at Berea College,\nBerea, Kentucky, will direct the musical programs of W N A D this term.\nLIBRARY OF CONGRESS OFFERS DISKS\nA NEW SERIES OF DOCUMENTARY RECORDINGS, OF A TYPE WIDELY EMPLOYED IN ENGLAND,\nBUT AN INNOVATION IN THIS COUNTRY, WILL BE MADE AVAILABLE TO RADIO STATIONS\nTHROUGHOUT THE COUNTRY ABOUT THE MIDDLE OF OCTOBER, IT HAS BEEN ANNOUNCED.\nTHE RECORDINGS, OF EITHER 15 OR 30 MINUTE DURATION WILL BE DISTRIBUTED ON\nA COST BASIS, WITH STATIONS PAYING A80UT $1.25 FOR EACH RECORD.\nThe SERIES, TENTATIVELY CALLED ”AMERICA—SUMMER OF 1941M * IS THE FIRST ATTEMPT\nTO FORMULATE A COMPREHENSIVE PICTURE OF THE AMERICAN SCENE THROUGH ON-THE-\nSPOT INTERVIEWS WITH NATIVES OF VARIOUS SECTIONS OF THE COUNTRY, SHOWING\nTHE DIFFERENT ASPECTS OF THElR CULTURE, IDEALS, ACTIVITIES, ETC., IN RELATION\nTO THE REST OF THE OOUNTRY. WORK AND FOLK SONGS OF VARIOUS LOCALITIES AND"
}