{
  "id": "d1917-11",
  "text": "- 12\nCOMMISSIONER WEBSTER MAKES CORRECTION '\nThe August 1952 News-Letter carried on page 3 tile following statement:\n\"Commissioner Edward M. Webster, in a dissenting opinion, asserted that per¬\nmits for state-supported educational television stations should not be\nissued until state legislatures had appropriated funds for construction\nand operation of the stations. Channels set aside for education, Webster\nsaid, should be kept open for other applicants until the appropriation of\nfunds assured that they would be used.” •\nCommissioner Webster Writes to Comment\nUnder date of September 8 Commissioner Webster wrote to the editor of the News-\nLetter stating that this did not properly represent his opinion in the matter. For\nthe record the Commissioner’s complete letter is reprinted herewith:\n\"On August lh, 1952 I dissented from the Commission’s decision to grant the\napplications, of certain financially unqualified state-supported educational\ngroups requesting authority to construct and operate educational television\nstations. State legislatures, which must appropriate funds necessary for\nthe construction and operation of such stations, meet only once every two\nyears, or possibly every year - depending upon their state constitutions.\nI was and am of the opinion that the granting of construction permits to\napplicants who have received no appropriation for this purpose might pre¬\nvent privately endowed educational organizations from going forward with\nplans to construct and operate educational television stations during this\ntime because of the lack of facilities. I stated further that I considered\nit in the public interest to keep these channels open for use by as''many,\nvaried educational groups as possible. In other words, I took the position\nthat smaller schools, with private capital, also have something to offer\nthe public, and I consider'it my duty to see'that an'opportunity is afforded\nthem to construct and operate educational television stations if they are\nqualified to do so. I also said that I recognized that there is a sub¬\nstantial difference in the manner in which private capital and public funds\nare obtained and conceivably a situation may develop where it would be in the\npublic interest to grant construction permits to educational groups before\nthey are definitely in possession of funds necessary for the construction\nand operation of educational television stations.\n\"I feel constrained to call your attention to the wording'in the August NAEB\nNEWS LETTER which sums up my dissent by stating that I said educational\nchannels should be kept open for other applicants until the appropriation\nof funds assured that they would be used. The omission of the word educa¬\ntional between other and applicants abridged my remarks to the point where,\nin my opinion, their real meaning is lost. While I am sure this was not\nintended by your publication; nevertheless, inasmuch as the. Commission’s\n6th Report and Order with respect to the television frequency assignment\nplan permits commercial interests to seek reassignment of educational\nchannels for commercial purposes after one year, anyone not having access\nto my dissent might easily assume from the NEWS LETTER item that the\n'other applicants' mentioned therein referred to commercial interests."
}