{
  "id": "d1917-18",
  "text": "ST. LOUIS TV. STATION. FORECAST WITHIN-. ONE YEAH\nOpening of a St. Louis educational TV station Vithin a year appears to be a virtual\ncertainty. Chairman Raymond H..Wittcdff of the Mayor's Committee on Educational\nTelevision said, .\"There is every reason to believe we will have it.\"\nWriteoff, a manufacturer and president of the Adult Education Council of St. Louis,^\nsaid the project is materializing in large part because of \"magnificent cooperation\"\nfrom area public and parochial schools and Washington and St. Louis universities.\nIn this venture they are united \"in an almost unprecedented way, he declared. He.\ngave an indicat ion. of the initial, cost when, he said that... each-of the area's approxi¬\nmately bOO,000 TV sets \"will become a classroom for less than a dollar each.\"\nThough Channel 9 has been reserved by the Federal Communications Commission.for a\nnon-commercial educational station, granting of a license and actual operation was\nuntil recently little more than a hope. Wow, Wittcoff said, there are tangible\n'prospects\" for adequate financial support, including some from a foundation. He sale\nplanning has gone ahead rapidly. The two universities already are setting up tele¬\nvision courses. Washington U. recently hired a television producer with broad net¬\nwork experience. ...\nHo Divided Time\nIt has been agreed, he disclosed, that programs will not be on a divided'time basis.\nThat is, there will be no programs exclusively for any one group of schools or for\nany religious group. \"We are agreed,\" he said, \"that our productions will cover\neducational ground common to all.\"\nChannel 9 is on very high frequency (VHF) which all existing sets in St. Louis can\nreceive without adjustment. Programs during school hours would be designed for *\npupils and students. Evening programs would be for adults.\n\"This is one of the greatest educational and cultural opportunities ever offered our\npeople,\" Wittcoff told a meeting of public school principals. \"Its success, once the\nlicense is applied for and issued, will be in the hands of your own and other educa¬\ntional systems. The station will -be non-profit, cooperative and completely inde¬\npendent of government--city, state or federal—except for policing by the FCC.\"\nTo support the venture, Wittcoff said, it is planned to seek private financial help,\nboth from individuals and organizations such as P.T.A. groups. Donations both large\nand small will be sought.\n\"The cost will be considerable,\" Wittcoff said, \"but it will be only a tiny fraction\nof the community's total educational expenditure. And the cost does not in any way\ninvolve shrinkage of teachers' salaries or measures of that sort.\"\nW. VA. APPROVES $250,000 FOR MARSHALL COLLEGE TV\nThe West Virginia Board of Education recently approved funds for the development of\neducational television at Marshall College. The center, to be located in the new\nscience hall on the Marshall campus, will be a further expansion of the recently\ncompleted modern educational radio studios.\nRaymond D. Cheydleur, Director of Educational Radio and Television, said that the\n$250,000 the Board of Education has approved for the developmentof TV will enable\neducators in West Virginia to keep’abreast of educational trends. Because of serious\ngeographical problems in this state, television will become one of the least expen¬\nsive educational \"Tools.\" Eventually*, .educators expect to offer programs and classes\nto at least 136,000 students."
}