{
  "id": "d1917-26",
  "text": "- 27 -\nr\nr\nBBC World Theater\nMusic for the Connoisseur\nA Time for Planting\nCooper Union Forum\nBach Memorial Concerts\nStories and Stuff\nUniversity of Michigan Band\nAmerica and the World\nMasterworks Story\n42.8 percent\n14.3 percent\n14.3 percent\n7.2 percent\n7.2 percent\n7.2 percent\n7.2 percent\n0\n0\nThe respondents were then shown a list of the programs and asked \"Which of these did\nyou listen to most of the time, which occasionally, and which didn't you listen to a\nall? At this point 14.1 percent recalled hearing one or more programs. We repro¬\nduce here the percentages answering \"most of the time\" and \"occasionally'' in the\norder of the total of the two categories:\nMost of\nOccasion¬\nthe time\nally\nTotal\nUniversity of Michigan Band\n2.23\n5.20\n7.43\nMusic for the Connoisseur\n2.23\n4.83\n7.0 6\nBBC World Theater\n2.60\n4.08\n6.68\nA Time for Planting\n2.60\n3-72\n6.32\nMasterworks Story\n1.12\n4.46\n5.56\nBach Memorial Concerts\n1.46\n4.08\n5.57\nAmerica and the World\n1.49\n2.97\n4.46\nCopper Union Forum\n1.86\n2.23\n4.09\nStories and Stuff\n1.12\n1.12\n2.24\nSpecial questions were included as to WBAA's \"Schools of\nthe Air\" programs\n;. One-\nfourth of the urban population reported\nsome listening to\nthese programs.\nwith 30 pei\ncent of this group reporting listening to one of them in the \"past week,\" and one-\neighth of the group of adults who listened to them being able to remember the name oi\nthe particular program which they found most interesting.\nQuestions addressed to Sports program listening discovered that almost two-thirds of\nthe population heard some of WBAA’s football and basketball game broadcasts, with\nthree-fourths of the sports program listeners having tried \"to hear all of these\ngames they could.'*\nLastly, special attention was paid to a children's program \"Storyland Special\" broad¬\ncast from WBAA at 5 every afternoon. It was learned that older children (age 8-12)\nwere more likely to listen to it than younger children (age 3-7). The older children\n‘were also more likely to listen to the whole program than the younger children, one-\nfifth of which listeners listened only to the first part of the program.\nThe technique of surveying employed in this WBAA study is worthy of warm commendation\non several scores. Area sampling, carefully designed, permits precise calculation oi\nthe reliability of the statistical results. The urban sample was designed to deal\nwith individuals rather than families on the realistic assumption that the urban\nfamily lacks the homogeneity to yield as meaningful results as in rural areas. The\nmain reliance was placed on this interview survey, but an effort was made to develop\nmail techniques which could yield more cheaply in the future the answers to questions\nfor which known reliability is not administratively necessary. In this respect, as\nin the use of consistent questions and sampling techniques as between this and pre¬\nceding surveys, WBAA has multiplied the efficiency of its efforts in audience\nanalysis. This particular study was conducted by Richard W. Lanman under the joint\nsponsorship of John Henderson, Director Pro Tern, WBAA, and H. H. Remmers, Director,\nDivision of Educational Reference, Purdue University."
}