{
  "id": "d1917-5",
  "text": "- 6 -\nLovell Council Organized in 19^6\nThe Lovell Institute Cooperative Broadcasting Council* vhich presents the major part\nof WGBH programs*- vas organized in September, 19^-6, by Boston College* Boston Univer¬\nsity, Harvard University, Lovell Institute, Massachusetts Institute of Technology*\nNortheastern University and Tufts College. The Boston Symphony Orchestra* the Nev\nEngland,Conservatory of Music and the Museum of Fine Arts, Boston, Joined the Council\nduring the year. Today the Council is the only organization of its kind in the\nUnited States, and is generally recognized as being unique in the history of American\neducation and broadcasting. The Council continues to present programs over cooperat¬\ning commercial stations in Boston vhich provide time and facilities vithout cost.\nWISCONSIN NET AIRS \"FRESHMAN FORUM\" PROGRAM\nRadio listeners throughout Wisconsin Join University of Wisconsin freshmen in Madison\nand Extension Centers to make up the \"student body\" for a course this year outlining\nresources for richer living. Starting Tuesday, September 23* listeners at home or in\nclass are heading 17 outstanding university faculty members* teachers of this semes¬\nter’s \"Freshman Forum.\"\nIncluded in course subject matter are such topics as philosophy* music, dance, litera¬\nture, art, and politics. Lectures are carried on the tvo state AM radio stations and\nthe eight-station FM netvork at 11 a.m. Tuesdays and Thursdays. Thursday is discus¬\nsion day for classroom students. Moderator for the program vill be Frederick ,\nHaberman* professor of speech.\nProgram Goals\n\"Freshman Forum,\" Haberman explained, has tvo major purposes:\n1. To stimulate the freshman’s interest in various subjects offered by\nthe university\n2. To introduce the freshmen to a selected group of renovned'university\nprofessors\nPrevious forums have centered around' the themes of freedom, vhat it means and hov it\ncame to be* and modern science related to human needs.\nSome topics to be studied this fall are: \"The Uses' of Philosophy\"; \"Enjoying Plays-\nOn and Off the Stage\"; \"Why Men Dance\"; \"Literature as a Personal Resource\"; \"The\nOpportunities of Citizenship\"; \"Art - Why Don’t We Live Without It?\"; and \"Moral\nForce and Atomic Energy in the War of Ideas.\"\nForum Speakers\nLecturers vill be Dean John Guy Fovlkes* education; Walter R. Agard, classics de¬\npartment; Julius Weinberg, philosophy; Ronald E. Mitchell, speech department; Mrs.\nShirley B. Genther, physical education; Robert J. Francis, physical education; and\nRoe-Merrill Heffner, German department.\nOther speakers are Paul Wiley, English; James S. Watrous, art history; Richard\nChurch, music; Chester Easum, history; David Fellman, political science; Graham\nHovey, Journalism; Ervin Gaumnitz, commerce; Elizabeth Brandeis, economics; Edmund\nZavacki, Slavic languages; Lt. Col. Jack C. Jeffrey, Corps of Engineers ROTC."
}