{
  "id": "d633-103",
  "text": "October 22, 19£8\nDear Haxrys\nTills will bo a rather hurried exposition of the conference on inplmcmtatton\nof Title VII but I believe that there is little tine to waste* I think that\nthe IWSB should act m quickly m possible to get a proposal into the works#\nfho;/ have all of this money (Plough only % million rather than 3 million for,\nthe first year we discovered at the last moment* 3 million were auitaorised\nin the facilitating 1 egirlation — however, only 1/2 of tIds was appropriated*\n1 learned sonethlag new about tlio way in whlflh government operates, interesting\nthat it was the former rather than the latter figure which received the\npdbliKity*) :s I was saying, they have all of this money and they want to\nbe sure and get ■ it spent by June or tlrny have little chanco of getting th©\n$ million for next year* Also# toy want to give mm of their first grants\nto projects which have some assurance of success and imblicity value —\nagainp to help insure the 5~xaillion for the following year* I was quit©\nimpressed by Bay Kail* I believe 'that he wants to really put this money\ninto the sort of research which will best further cur Jo pledge about\neducation — but I think that the above is a hard fact which he faces in\nto first year or two of the program.\nI had lunch with Boy yesterday <md told him that the MASS wanted to help in\nthe program in sny way which ho felt was needed* I noted particularly\nthe organization's experience in running seminars and woikshops and its\nexperience in the clearing !louse sort of tiling — distribution of research\ninfomation or findings, etc* I also talked about tho ready-»mdo commotion\nit already has with all of the aducational radio and television stations\nand riost of the closod^ireuit operations* Frankly, I got naxy a rise from\nhim with any of tills bait — oven after I told hm that wo would so© that\nhe got a personal copy of our research sendnar report and the fact sheets\nwhich we have distributed# (This last business v;a» Dick Hall's idea — and\nI think it a good one. Dick feels that the ItABB should toiediatoly get a\ncomplete file of the facb~sheeteand have thorn bound with hard covers and\nadboseed with aonethlng suck as “Bsrsonal copy for use of Dr* lay Hall*\nDick thinks tot tills sort of gesture is quite important -** mid tot the\norganissaiion sliould go all out cm it*) hnyv^y. Hall - (Be must be quite'\na poker player — pl^rs a cool hand and hides Ids cards close to his belly.)\nHall in.dcaifed that Stone5 s |yrfjmxp function would be the clearLng-liouse\nfunction. Whether tide lets trie 11MB out completely, he did not say — but\nheld out no encouragement. I think you ought to ccotitiuo to f#llow up on\nit however* He had to specific tilings which he finally told me tlmt he\nwould like the KAHB to do. Both are research projects for which formal\nproposals should be rmdo if you want to do then. Ih© first was to discover\ntlio Modes to acceptance of tlio new media. The second project# which I boliove\ntlmt the 1IAEB is far more able to do, is to do research aimed at discovering\nthe best kinds of equipment, production, perfonianco, etc* for instruction^,\nbroadcasting * I believe tlmt by calling upon tlio meiiiership of the UAE8# using\nthe pooled experience which this represents, w© have a hell of a start on this\nlatter project alreaty* W siiggostiaa would b© an immediate proposal in this\ndirection. This would provide them with some helpful materials which they could\ndistribute early and thus show Congress that they arc already helping tlio\nschools* (This last Hoy did not say, but I would guess tlmt it is in the back\nof hie mind.)\nThis last sotfrids as though I trail trying to psychoanalyse Hall-which is\ncorrect# especially after he started to feel mo out on whether I was interested\nin becoming Director of the Title VII program — a result, I gator, of your\nputting a bug in his oar* Thin came as quite a surprise to no* Fortunately#\nho did not want an ievaedtato answer* This is for next June — if at all*\n®ils gives ise plenty of tire to think- give me southing to cogitate on\nat ni$vt ton I cannot sleep —* and it will ’probably b© to thing vArlch\nkeeps m from sleeping. What do you think of the idea?"
}