{
  "id": "d633-121",
  "text": "OEPARTMEN 1 OF\nIETALTH. EDUCATION. AND WEL> <f\ni: ft ice or tour a i \\\nOFC 2 2. l-'5»\nDr. Sam L. Becker\nChairman, NAEB Research Committee\nNational Association of\nEducational Broadcasters\nUrbans, Illinois\nDear Dr. Becker.\nThe Advisory Committee on New Educational Media, established\nunder provision# set forth in Title VII of the National Defense\nEducation Act (P.irr 85-864), was eonvwnwd by .aAnesi >signer Derthick\nfor tbe first time in Washington, D. Co on December 17 - 18, 1958o\nAt this meeting, the Committee developed and epprtved s basic state¬\nment of policy., program, and procedures as well as a plan for initial\ndissemination activities to be supported by contracts during the\ncurrent fiscal year. The Committee also reviewed ail proposals for\nresearch and experimentation which bad been received on date.\nThe nature of the policies and procedures adopted by the\nCommittee are such that the Committee has decided u postpone\nawarding gxante-in-aid for research and experimentation until its\nnext meeting to be held in Washington, March 5 - 60 1959. Some\nproposals already submitted may require minor modifications, mostly\nin regard to listing of budget items. All proposals reviewed to\ndata will be carried forward. Proposals may be rev tied by any insti¬\ntution as desired In accordance with instructions which will be\nmailed shortly. The final deadline for submitting new or revised\nproposals for considetation by the Committee #t the March meeting is\nFebruary 1, 1959.\nThe Office of Education is very grateful to all those who have\nexpressed interest in the Title VII Program and wishes further to\nexpress its deep appreciation for the many suggestions and generous\noffart of assistance it has received.\nFollow-up material giving full details regarding specific\nprocedures tc be foLlowed when submitting or revising epplicstions\nfor research grants according to policies and prc'itdjres now established,\nwill be mailed tc you within a few day*.\nSincerely yours,\nKenneth D. Norberg\nProgram Consultant\nNew Educational Media"
}