{
  "id": "d633-17",
  "text": "Prof. Percy Tannenbaum\nJune 20, 1958\nPage 2\nOn the studies in which we have been utilizing the SD.\nThe most interesting one, in my opinion, is the one which we\nare doing on film lighting. This is being done by one of my\ndoctoral candidates* He has taken three short dramatic scenes\nwhich are more-or-less complete — which is to say, they make\nsense even if one is not familiar with the play. He has filmed\neach one three times — once with lighting which follows light¬\ning theory (motivated source, back, key, and fill, emphasis on\nmain character, etc.), once with these lighting factors mixed\nup, and once with the flat light which is often used by local\ntelevision stations. Thus, he has 9 scenes — three each filmed\nin three ways. For each scene, he did a fairly decent job of\nholding acting, shots, editing, etc. quite constant so that\nlighting is pretty much the only variable. He is going to use\nnine groups of subjects. Each will see one scene and then react\nto a series of concepts with 9 or 10 scales — one concept will\nbe the \"overall scene,11 another will be the \"lighting,\" etc.\nThere will be some other questions but we consider the three di¬\nmensions of meaning to be his primary criteria to evaluate dif¬\nferences. Our primary concern to date has been with the analysis\nof data. He will do sisqple analyses of variance for each dimen¬\nsion for each concept for each film — testing the three versions\nagainst each other. This does not give us a test of the pattern\nof responses. You talk about a chi-square in your text but this\nis not a legitimate test. Even if one accepts the assumption of\nthree independent dimensions, when you have one person making\njudgments on the three, the three cells are not independent in\nthe chi-square. E.g., on page 100 when you talk about this, 1\nbelieve you fall into this error. Anyway, if you have any bright\nideas on the analyses of these data, let me know. What tests\nof significance did you run on your data from the study of music\nbackground in drama?\nAnother Interesting study which one of the students in my\nresearch seminar is planning involves the use of the SD to test\nthe theory in film that the \"meaning\" of a shot depends on its\ncontext. He plans to shoot a reaction shot which he will use in\nthree or four simple little scenes. Each scene will differ only\nin the object (shown in cutaway) to which the actor is supposedly\nreacting. The concepts to be rated will be the actor and his\nreaction (these will be exactly the same in each film). This any¬\nway is our idea at this point. We just began discussing it today."
}