{
  "id": "d633-27",
  "text": "-2-\nCAN BE HELD FOR CERTAIN T Y P E 8 OF BROADCASTING PERSONNEL, PARTICULARLY\nON A REGIONAL OR LOCAL BASIS, WHERE TRAVEL AND OTHER COSTS CAN BE KEPT\nTO A MINIMUM, AND REGISTRATION FEES CAN BE *frPT TO A LEVEL WHICH\nR C U I STRANT8 CAN AfFOfiO,\n(2) Materials distrIbutioni One of the greatest handicaps facing\nEOUCATIONAL BROADCASTING TODAY IS THE WUNAWARCNES%\" ON THE PART OF\nLEADING EDUCATORS OF THE IMPORTANT ROLE THAT I l ». ELISION AND RADIO OAN\nAND MUST PLAY IN EDUCATION. THIS IS LARGELY JOE TO THE FAOT THAT\nPERTINENT PUBLICATIONS AND MATERIALS ARE NOT W • 0f l < ENOUGH DISTRIBUTED\nNOR DISTRIBUTED TO THE PROPER PEOPLE, COUPLE with THIS IS THE FAOT\nTHAT ALTHOUGH THERE IS CURRENTLY A GREAT DEAL OF RESEARCH AND DEVELOP¬\nMENT, AND WRITING, GOING ON IN THIS FlELO, THE FINDINGS OF 8UOH PROJECTS\nARE SO LIMITED IN DISTRIBUTION THAT THERE IS VERY LITTLE NATIONAL\nAWARENESS OF THEM. MUCH WASTED EFFORT IS CERTAINLY GOING INTO RESEAROH\nWHICH MERELY DUPLICATES RESEARCH DONE EARlIER AT A DIFFERENT LOCATION,\nWe ARE FACED WITH a TWO-FOLD PROBLEMS l) THE NEED FOR 0 I 9SCM I NATION\nTO LEADING EOUCATORS OF VITAL AND uP-TO-DATt INFORMATION ABOUT THE\nUSES OF TELEVISION ANO RADIO IN EDUOA T | ON, AND Z) NEED FOR A\n\"CLEARING HOUSE\" FOR RESEARCH ANO OTHER PUBLICATIONS TO PERMIT WIOER\nDISSEMINATION OF FINDINGS TO THOSE ENGAGEO IN BROADCASTING AND IN\nBROAOCASTING RESEARCH.\n»* •\nThe two NAEB publ ioations, the Newsletter and the Journal, if\nPROFESSIONAL^^! TED J LrY ***** I Bttft D ; <***! (V ALLEVIATE\nTHE FIRST PR.OBLEM. OWE/TO IV SHORTAGE ‘Or ^U N TT*'^ XU t” N C W 8 L E T TER\nV.i: ‘ ‘ • • .w„\nIS CURRENT LX E(^ I T fi)D A P CYLBON WHO * MOST At. SO ^EttVt'AS NAEB ^ETWORK\n•*' ' 4' V* '* \" _ .1 ] * 1!, J*'1\nTraffic Manager and i^ACCMENrt Off.foIw-, 'whiIT' j6u&nal is\nj, in-*’- 1 '* v--' .-••‘jii .*!•' v\nEOITED^JIL WY \"AN-, E|»P tWt* OF OF THE CocAl RADIO\n$ T AT I Th R EGLF. ST ^ I N<$L«Ofc^ FUNDS’’ Td 'pi- ' VV I D C FOR A FULL-TIME"
}