{
  "id": "d633-57",
  "text": "(3 - Telephone Coincidental Study)\n1. hello* This is a broadcasting survey. I would like to asm you a\nfew questions, please, das your television or radio set on just now\nwhen I called? ’ (If not, thank the respondent and hang up.)\n(If yes)\na. here you listening to the radio or watching television?\nb. To what station were you tuned?\nc. Can you tell me the name of the program or what it was about?\n2. Thankgc you very much. Goodbye.\nThe check sheets on which each interviewer is to note the responses\nto his questions should look like the following:\nInterviewer Date_Time period _to_\nPhone no.\nh1\nh\nRTA\nLi:\nSr\nstening\n\"Radio”\nHone\nStation\nghannel\nProgram\netc. C 0£y ~ fid44/J M ' /jo frfUurtfj R7A - r)\nHave all of the telephone numbers listed on these check sheets before\nthe survey is to start. FLace the name of the interviewer, the date, and\nthe time period during which you want the interviewer to make as many of\nthe calls' on the sheet as possible on top of each sheet. Separate c heck\nsheets or groups of check sheets should oe given eac interv io > * or for uhe\nsmallest time segment which you plan to tabulate. For example, if you\nwant a separate tabulation for each hour of the afternoon, check sheets\nshould be made for the 12*00 to 1:00 period, 1:00 to 2:00, 2:00 to 3:2*00,\netc. Interviewers should be instructed to begin calling one minute after\neach hour o r half-hour begins and to stop one minute before each, half-hour\nor hour ends. This -./ill avoid catching many persons tuning programs In or\nout during this period. Each intervie check\nsheets for the entire morning or evening or whatever the period in which\nHe is to make calls. He should be told to let a phone ring six tines before\n■ signals, 1 e should go on to a few\nother calls and then come back and tip- the bus - njgnber again. A good rule\nto follow is to Ceil each busy line three tii os before giving up and marking\nbusy on the check sheet. In any case, all interviewsrs must receive tre\nsame instructions for such, cases so that es.cn ..is doing the sane tiling.\nIf a respondent wants more information than, .that this is a broadcasting y;\nsurvey. It should be given to him. It should not be given to him if he ^\ndoer not ask. hour slot ion or institution should not be identified Jsy the .\ninterviewer unless absolutely necessary, for this niglrc. bias some of ire\nresponses. It is a good idea to hold a joint meeting with all interviewers\nto explain these proceduresx to all at one time and to answer any questions.\nIt is\" even well to make a few sample calls so that they, can hear and see\nthe procedure."
}