{
  "id": "d633-59",
  "text": "(5 - Telephone Coincidental Study)\nYou will find that some research agencies calculate Mshare-of-audiencen\nrather than percentage of total homes tuned to your station. The results\nlook better in promotional pieces but you should remember that the error\nincreases proportionately with the apparent increase in audience figures.\nThis can be easily illustrated. Lot us say that you have 5>C0 calls in an\nevening, after deleting the refusals and numbers which were busy all three\ntimes you tried to call them and the disconnected phones. Of these 500,\n20 report that they are viewing your television station. 'The percentage\nof total : 1 Qfflon-^ould be 100 times . which would be h%. Possible error would\nbe 2 A x 96 hOD\n$00 which would be 1.65. Thus the percentage of homes viewing\nyour station pr&bably fell between 2.35 and 5*655* If you wont to estimate\nshare of television audience, rather than percentage of total homes, you\nsubstitute all of the homes reporting viewing television for the $00. Let\nus say .that. 2$Q respondents reported that they were viewing television.\nYour share, of that audience would be 100 times 20\n2 /^Tx~92 250\nor 3*42.\nIt\nthe possible error more than doubled.\n250\nU.58 and\npercentage doubled.\nor 85* Possible error\nThus your share of viewing homes probably fell between\nis important to note here that although the listening\nAn advantage of calculating percentage of total homes is that it is\nslightly easier to estimate the total number of homes in the community\ntuned to your station. You can figure it by multiplying the total number\nof homes or households in your community by the percentage and dividdtothe\nresult by 100.\nSome broadcasters find it easiest to interpret the results of this\nsort of study if they are put into tabular or graphic form. This can be\ndone in many ways. Two of these are illustrated below.\n(Graph s)\nIt Is possible to ask a few more questions in a telephone interview\nthan indicated by the sample questions above. You might want to determine\nwho in the home was listening to the program. You migh£ want to find out\nwhether anyone in the home ever listens to your station and, if so, to what\nprograms. Questions of this last kind, which indicate that your station\nhas a special interest in the results of the study should be at the end of\nthe interview where this knowledge has no chance of influencing responses\nto other questions. Attitude questions, e.g., 'lhat do you think of station KYZ?,r,\nand personal questions of any sort, probably will result in the least\nreliable responses of any questions which might be asked in this sort of\nsurvey. In considering additional questions for the telephone interviews,\nremember that each additional question lengthens the time consumed by the\ninterview and necessitates more interviewers to obtain the required number\nof calls in any given period."
}