{
  "id": "d1064-2",
  "text": "-3-\nQ. Can microwave equipment be purchased with the Federal funds?\nA. Yes, if not more than 15% of the grant is used for the acquisition and\ninstallation.\nQ. Can closed circuit operations qualify for Federal grants?\nA. Yes, Sec. 394(2) includes \"apparatus which may incidentally be used for\ntransmitting closed circuit television programs.\"\nQ. Can two or more states join together in making an application for a\ngrant?\nA. Yes. In this case, some segregation must be made of the cost in each\nstate so that the total of $1,000,000 per state can be maintained. However, the\nConference Report clearly points ov that expenditures from inter-city stations\nshall be incidental to the main purpose of station activation.\nQ. What happens if several qualified applicants apply from a state and their\ncombined projects exceed $1,000,000?\nA. H.E.W. will then decide how much each will receive, or which applicants\nwill be rejected. In that case, if there is a State plan presented, the applicants\ncoming within the provisions of the State plan should be favored. Section 392(c)\nspecifically provides that: In order to assure proper coordination of construction\nof educational television broadcasting facilities within each State which has es¬\ntablished a State educational television agency, each applicant for a grant under\nthis section for a project for construction of such facilities in sueh State, other\nthan such agency, shall notify such agency of each application for such a grant which\nis submitted by it to the Secretary, and the Secretary shall advise such agency with\nrespect to the disposition of each such application.\nQ. Will the grant be paid out at the time the award is made?\nA. Not necessarily. It may be paid in installments as the construction\nprogresses; it can be made as an advance or a reimbursement.\nQ. Must an applicant have an FCC construction permit before a grant is made\nby the Health, Education and Welfare Department?\nA. No. However, it appears that there will be close coordination between\nthe FCC and HEW to facilitate the purposes of the Act. In fact, Section 395 pro¬\nvides that: The Federal Communications Commission is authorized to provide such\nassistance in carrying out the provisions of this part as may be requested by the\nSecretary. The Secretary shall provide for consultation and close cooperation with\nthe Federal Communications Commission in the administration of his functions under\nthis part which are of interest to or affect the functions of the Commission.\nQ. Can the HEW control the programs which the station proposes to broadcast\nor the curriculum of the school using these facilities?\nA. No — Section 397 specifically prevents such action and provides that:\nNothing contained in this part shall be deemed (l) to amend any other provision of,\nor requirement under this Act; or (2) to authorize any department, agency, officer,\nor employee of the United States to exercise any direction, supervision, or control\nover educational television broadcasting or over the curriculum, program of instruc¬\ntion, or personnel of any educational institution, school system, or educational\nbroadcasting station or system."
}