{
  "id": "d1064-3",
  "text": "-4-\nQ. Will the FCC require program information?\nA. Yes. No changes are made in the basic provisions of the Communications\nAct as it relates to the licensing of educational television stations.\nQ. How soon can I apply for a grant to the HEW?\nA. The Secretary of the Health, Education and Welfare Department is now\npreparing rules and regulations required to carry out the provisions of the law.\nIt is anticipated that they will be complete by fall, and that applications will be\nreceived at that time.\nQ. How much money is now available for Federal grants?\nA. None...since the legislation adopted is not an appropriations bill, but\nenabling legislation. It is anticipated that an appropriations bill providing some\nfunds will be passed before Congress recesses in 1962. If less than $32,000,000\n(the limit provided in the Bill) is appropriated, grants to individual states may\nbe reduced proportionately. For example, if $16 million is appropriated, there may\nbe a limit of $500,000 per state until the remaining $16 million is passed.\nQ. Why did Congress place a limit of $32 million, when there are 50 states,\nDistrict of Columbia and Puerto Rico, all eligible to receive $1 million each?\nA. It is unlikely that all eligibles will apply for their full amount. If\nthis assumption is wrong, the earliest states to apply will probably benefit.\nQ. Is there a time limit within which an application must be made for a\ngrant?\nA. Yes. Applications will not be received after July 1, 1968.\nPART IV, TITLE III OF THE COMMUNICATIONS ACT\nSEC. 390. The purpose of this part is to assist (through matching grants)\nin the construction of educational television broadcasting facilities.\nSEC. 391. There are authorized to be appropriated for the fiscal year ending\nJune 30, 1963, and each of the four succeeding fiscal years such sums, not exceeding\n$32,000,000 in the aggregate, as may be necessary to carry out the purposes of sec¬\ntion 390. Sums appropriated pursuant to this section shall remain available for pay¬\nment of grants for projects for which applications, approved under section 392, have\nbeen submitted under such section prior to July 1, 1968.\nSEC. 392. (a) For each project for the construction of educational tele¬\nvision broadcasting facilities there shall be submitted to the Secretary an appli¬\ncation for a grant containing such information with respect to such project as the\nSecretary may by regulation require, including the total cost of such project, and\nthe amount of the Federal grant requested for such project, and providing assurance\nsatisfactory to the Secretary -\n(l) that the applicant is (A) an agency or officer responsible for the\nsupervision of public elementary or secondary education or public higher education\nwithin that State, or within a political subdivision thereof, (B) the State educa¬\ntional television agency, (C) a college or university deriving its support in whole\nor in part from tax revenues, or (D) a nonprofit foundation, corporation, or associa¬\ntion which is organized primarily to engage in or encourage educational television\nbroadcasting and is eligible to receive a license from the Federal Communications\nCommission for a noncommercial educational television broadcasting station pursuant\nto the rules and regulations of the Commission in effect on April 12, 1962;"
}