{
  "id": "d1126-6",
  "text": "TI-E JEGRETMY’S PAGE\nMemo from Radio City\nIf you think you are tired, and who isn’t — if you feel that the Job you're\ndoing doesn’t c oiie up to the high standards of commercial radio — if you’re a\nbit sorry for yourself, and we all are at times — read this. I happened on it\non a back page of the New York Times, but it never received the j^eneral press and\ntrade paper coverage it deserved.\n’’Chicago, Jan. 20 — Dr. Lee DeForest, ’father of the radio’ says he\nharbors not the slightest tinge of bitterness because he failed to reap\nfinancial rewards commensurate with the tremendous benefits his invention\nof forty years ago brought to mankind.\n\"But of present-day broadcasting, the 73-year-old scientist wonders\n’if our simian ancestors had any conception that ages later such monkey\nchatter as tliey originated could some day be transformed into the\nessentials of livelihood’.\n\"As vigorous and alert as a man many years his Junior, Dr. DeForest\ntalked calmly today about the future of atomic energy, radar and television.\n\"l(’«hat have you gentlemen done with my Child? He was conceived as\na potent instrumentality for culture, fine music, the uplifting of\nAmerica’s mass intelligence. You have debased this child, you have sent\nhim out on the streets in rage of ragtime, tatters of Jive and boogie\nwoogie, to collect money from all and sundry for hubba and hubba and\naudio Jitterbug.\n’SCAP OPERAS,\" MYSTERIES HIT\n\"'You have made him a laughing stock of intelligence, surely a\nstench in the nostrils of the gods of the ionosphere; you have cut time\ninto tiny cube lets, called shorts (more rightly stains), v/herewith the\noccasional fine prot,ram is periodically smeared with impudent insistence\nto buy or try.\n’.’’The nation has no soap, but soap opera without end or sense floods\neach household daily.\n\"’Murder mysteries rule the waves by night and children are rendered\npsychopathic by your bedtirB stories.\n\"’This child of mine has been resolutely kept to the average intel¬\nligence of thirteen years. Its national intelligence is maintained\nmoronic, as though you and your sponsors believe the majority of\nlisteners have only moron minds. Nay, the curse of his conimercials has\ngrow'n consistently more cursed, year by year.’\"\npass this on to your staff -- put it on the air -- have it reprinted in t?ie station\nbulletin -- get it out to the school publication, or for that matter, any other\nMIorris S. Novik\nExecutive Secretary\npublication,\nJanuary 29, 1947\nRoom 5052\n30 Rockefeller Plaza\nNew York, New York"
}