{
  "id": "d1521-0",
  "text": "t N-A-E-B NEWS - LETTER\n% NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nNEWARK BOARD OF EDUCATION Edited by Richard B. Hull, President N-A-E-B CLEAR CHANNEL CONCERN\nHAS NEW EDUCATIONAL Station WOI, Iowa State College, Ames, Iowa DECISION IN SICHT\nRADIO STATION - WBGO-FM FEBRUARY 1 OKLAHOMA A. & 'M.'KOAG'rTESTffIES\n. 1948\nNFUARIC, N.J. BOARD OE EDUCATION GETS UNDSR NAY UITH A NET'T STATION\nThe National Association of Educational Broadcasters salutes new member station,\nUBGO-FM, which will begin operation February 5, 1948. Owned and operated on a\nnon-commercial and educational basis by the Board of Education in Newark, the\nstation will transmit on 91.1 megacycles, serving the schools and community of\nthis important New Jersey city. The station will initially operate on a 5-hour\nschedule Monday through Friday taking the air at 10:00 a.m, and leaving the air at\n3:00 p.m. Operation is coordinated with the basic curriculum of the Newark schools\nto furnish a supplementary aid to classroom work. (A detailed program describing\nthe daily schedule may be had by addressing the Department of Library and Visual\nAids, Board of Education, Newark, New Jersey.)\nUnder the supervision of Uilliam R, Pfeiffer, a former staff member at the Univer¬\nsity of Wisconsin station UHA, UBGO-Fm marks the establishment of another import¬\nant registrant in the growing roster of N-A-E-3 stations. Like UBOB-FM, Cleveland\nBoard of Education station now serving night audiences in the Cleveland area,\nUBGO-FM can well represent an extension to the educational FM network now shaping\nup under the direction of Seymour Siegel, director of UNYC and UNYC-FM, Municipal\nBroadcasting System in New York City,\nSpecial congratulations are due everyone connected with this new development es¬\npecially the superintendent of schools and the Newark Board of Education, who\nhave painstakingly and with determination carried through this development in the\nface of many difficulties, legal, technical and otherwise.\nEDUCATIONAL RADIO HIGHLIGHTS\nIN THIS ISSUE\nClear Channel Decision Close.2\nFebruary Clip Sheet..4\nColleges Study Radio Methods.5\nU.S. Losing Battle of Ideas.5\nBoston* s Radio Council.7\nHits, Misses, & Flashovers,......8\nFCC Educational Actions...22\nVoice of America Bill Official....\nFCC Policy on Political Broadcasts\nHints to the Program Director.....\nDorothy Lewis Resigns NAB.\nN-A-E-B Business Page...\nFT-A-E-B News by Districts.\n.9\n11\n12\n13\n14\n16\nRADIO CONFERENCE AT UNIVERSITY OF OKLAHOMA\nThe Annual Radio Conference of the University of Oklahoma(Horae of member N-A-E-B\nstation WAD) this year is expected to attract a record audience of educational and\ncommercial broadcasters with a full quota of government officials(including George\nSterling, FCC Commissioner)and experts from many fields. Scheduled for February 26,\n27, and 28 at the University in Norman, Oklahoma, with the emphasis on the \"new\nlook in radio\" a good many interesting and worthwhile developments are expected.\n— -r-oport next ioouo)i--—-\nVice-President Treasurer Executive Secretary Executive Committee\nJohn Dunn W. I. Griffith M. S. Novik Seymour Siegal, WNYC, New York Graydon Ausmus, WUOA-FM, Alabama\nWNAD, University of Oklahoma WOI 30 Rockefeller Plaza Carl Menzer, WSUI, Iowa Ralph Steetle, WLSO-FM, Louisiana\nNorman, Oklahoma Ames, Iowa New York, N. Y. Frank E. Schooley, WILL, Illinois William Sener, KUSC-FM, California"
}