{
  "id": "d1521-1",
  "text": "CLEAR CHANEL ARGt1CTT ENTERS FINAL PKAgF-^FCO DECISION IS IN SIGHT\nLast Roundsup?\nJanuary 19 opened the final stages of the \"bitterly-fought, 3-year old clear channel\ncase before the full Commission* Oral argument began and concluded, and scores of\nparties to the case who listened to the final week of argument took stock and won¬\ndered whether they were pointed \"down the homestretch” or ”headed for the last\nround-up. ”\nChannel Break-up?\nThe arguments on the clear channel proceeding, which will determine whether some,\nall, or no clear channels will be broken down and whether power above 50,000 watts\nwill be permitted, also included testimony on daytime skywave transmissions, their\neffect, and what, if any, rulings in this respect should be made.\nLate ftf Decision\nFederal Communications Commission authorities would not speculate on the date, a\ndecision might be reached, but pointed out that U, S, proposals for the revision\nof the Forth American Regional Broadcasting Agreement (FAR3A) will defend on the\noutcome of the clear channel case, and that 1TARBA proposals must be submitted to\nother signatory nations by May 1, because of the FARBA meeting August 1,\nShould the FCC1 s decision involve any change in the status quo of clear channel\nbroadcasting, the Commission will have to first take up its decision with the\nState Department, and then in turn, with U. S. delegates to BARBA.\nDecision Fill be Final '\nThe decision in the case will be final, that is, the Commission will omit the usual\nprocedure of rendering a \"proposed” decision in order to save time and meet the\nMay 1 deadline. The decision with respect to skywave transmission, which may decide\nthe fate of hundreds of daytime 1-A and 1-3 channel stations and applicants, may\ncome at the same time as the clear channel deoision or be issued separately.\nU-A-B-B MEMBER STATION KOAG\nOklahoma A & M College Station KOAG, applicant for 10 kilowatts day¬\ntime on the 840 channel, gave special testimony with respect to daytime\nskywave interference. (KOAG applied for and was granted 10 kw on 840\nkc. An objection by the dominant station UBAS, Louisville, precipitated\nthe whole sequence of questions on daytime sky-wave interference.)\nThe Oklahoma station stated that its operation caused daytime skywave\ninterference only at sunrise and sunset and only on 10^ of the days of\nthe year with the interference questionable on Bp?! of these days and\nconsequently saw no need in a rule requiring protection to%the 100\nuv/m contour. KOAG said it was not sure that the TJHAS signal is listen-\nable at the point of alleged interference.\nN-A-3-B Brief\nMarcus Cohn (Cohn & 'arks) presented the final memorandum brief and oral argument\nfor the national Association of Educational Broadcasters, urging that ”the duality\nof program service should be the determining factor (in deciding on channel usage)\nrather than the technical and arbitrary yardstick of protecting the coverage of\nclear-channel stations to unreasonable limitsf Upon this basis, there would be an\nimproved broadcast service to rural (and local) audiences with programs designed\nfor their special needs,”"
}