{
  "id": "d1521-13",
  "text": "-14-\n(National)\nN-A-E-B BUSINESS PAGE\n(Regional\nAnnual Dues\nW. I. Griffith, N-A-E-B Treasurer, reports statements for the 1948 membership dues\nhave been sent out. Griffith wishes to express his appreciation for the promptness\nwith which most members have either sent their personal or institutional checks, or\nplaced the claim with their institutional business office for payment.\nRegional Re-ports and Station Reports, and N-A-E-B Procedures\nA series of detailed plans for district operation will shortly be available to mem¬\nbers of the N-A-B-B Executive Committee for approval. Plan is to clarify relation¬\nships between members and the central N-A-E-B and members of the Executive Committee\nwho head up the six N-A-^-B regions.\nSpecial and Regular Reports to the Newsletter\nIt is urgently requested that EVERY N-A-E-B STATION put the N-A-E-B president’s\nmailing address on its mailing list. (Station VO I, Ames). It is even more urgently\nrequested that EVERY STATION send, not only the regular program bulletins and weekly\nschedules of the station to the President, but any special items such as might nor¬\nmally be included in local or regional newspapers. KUOM, VNYC, WEB, FOSU, and\nseveral other stations have been especially good about this, but a 100£ contact is\ndesired.\nIn addition every station manager or director—and especially regional directors—\nare requested to keep the N-A-E-B president informed of any special developments\neither with respect to educational radio developments or major policy developments\nin which the H-A-B-B should take action.\nMayflower Hearings - March 1 — N-A-E-B Intends to Cancel Appearance\nThe ’’freedom of speech” hearings scheduled to open March 1 are likely to be postponed\nuntil later at the request of the commercial trade organization FAB (National Associ¬\nation of Broadcasters).\nN-A-E-B was requested by the ECC to file for an appearance along with many other\ngroups who are concerned with the truly basic issues involved in the case. Your\npresident filed for this appearance. However, it immediately became apparent that\nN-A-E-B member stations did not have a common point of view on the issues involved.\nThree points of view are apparent: (1) Let everyone editorialize (2) Modify the\npresent law (3) Keep the status quo. Without common ground N-A-E-B cannot make a\nstatement; hence the intention is to file for withdrawal.\nJob Exchange\nN-A-E-B station managers can simplify the problem of circulating requests about\n’’jobs open” or ”personnel wanted” by sending their correspondence either directly\nto the president’s office (TT0I, Ames, Jova) or to M, S. Novik, N-A-E-B. secretary,\nRoom 370, 630 Fifth Avenue, New York 20, N.Y. Information will be printed in the\nNewsletter. There have been some delays and mis-mailings in this connection for\nwhich your editor is sorry.\nConstitution\nCopies of the N-A-E-B constitution are being duplicated to include last revisions\nmade a year ago in Columbus, Copies will be furnished to every member. It is re¬\nquested by the president that these copies be given some rather serious study in"
}