{
  "id": "d1521-14",
  "text": "-15-\nfl-A-3-B BUSINESS PAGE (Cont.)\norder that any desired revisions or additions can be discussed at the N-A-E-B\nsemi-annual business meeting at the Institute for Education by Radio in Columbus\nthis spring.\nJob Openings\nStation ICWSC, Washington State College, Pullman, Washington (5000 watts, 1250 kc.)\nhas a position-opening for Continuity Director at $3500 annually, with raise if\nsatisfactory,. on basis of one-month annual vacation. Job requirements: to teach\nradio writing under Department of Journalism one-third time and direct continuity\nstaff(news editing, publicity and promotion, scripts, special one-time shows, musi¬\ncal continuity, and spot announcements) Apply: Frederic Eayward, Manager.\nWFYC- New York City Municipal Broadcasting Service\nFor the first time in 10 years the Few York Civil Service Commission is holding an\nexamination for announcers for the municipal outlets, WNYC and WNYC-EM. Exams\nconsist of auditions andwritten tests. General requirements are high school diploma\nand two years recent, satisfactory, full-time experience as an announcer or a\ncollege diploma and six-months experience. Candidates must be U, S. citizens.\nStarting salaries range from $2400 to $3000, Possible promotions boost pay to the\n$3000-$4200 range.\n*** ***\nLOWELL COUNCIL PRAISED BOB EDUCATIONAL SH0TTS\nSix leading educators, participating in a special program observing the first\nanniversary of the Lowell Institute Cooperative Broadcasting Council over YHDH,\nBoston, in late January, praised the work of the Council in airing adult education\nshows over six Boston stations. Topics included in the series covered classical\nliterature, child psychology, social relations, American literature, regional\nand international studies and meteorology.\nResults Reviewed\nThe panel reviewed the results of the Councils 412 broadcasts, representing nearly\n115 hours o.f air time, produced over r,HDH, W3Z, WCOP, WEEI, WHDH, WMEX and WRAC.\nOpinion of the educators was expressed by President Carl S, Ell, of Northeastern\nUniversity, who said, ,fRadio programs can stimulate interest and pave the way for\nfurther study by all persons regardless of their educational background. It is\nobvious from our experiment this year, that the radio and the college may well .join\nhands in a cooperative enterprise designed to produce better informed and more\nintelligent citizens.\nEducators Participating\nParticipating in the broadcast, in addition to Dr, Ell, were: The Very Rev. William\nL. Eelleher, president of Boston College; Dr, Daniel L, Marsh, president of Boston\nUniversity; Dr, James Bryant \"Conant, president of Harvard; Dr, Earl T, Compton,\npresident of M^T.t Dr. Leonard Carmichael, president of Tufts; Rev. Stephen.A.\nMulcahy, dean of Boston College, apd Ralph Lowell, trustee of the Lowell Institute,"
}