{
  "id": "d1521-22",
  "text": "-23-\nCP Modification\nKOAG-FM - Oklahoma Agricultural and Mecbnical College. Stillwater, Okla. -\nModification of construction permit (B3-PED-58, as modified), which authorized\na new noncommercial educational broadcast station for extension of completion date\nCP Modification\nKOKU - State University of Oklahoma. Norman, Okla. - Modification of construction\npermit (B3LPED-4l, as modified), which authorized a new noncommercial educational\nbroadcast station for extension of completion date.\nCP Modification\nW.S0U *- Seton Hall. College, South Orange. N, J. - Modification of construction\npermit (Bl-PED-78, which authorized a new noncommercial educational broadcast\nstation) for extension of completion date.\nCP Modification\nKCVN - College of the Pacific. Stockton, Calif. - Modification of construction\npermit (B5-PED-47, as modified) which authorized a new noncommercial educational\nbroadcast station, for extension of completion date.\nFor License\nWHA-FM - State of Wisconsin, State Eadio Council, Madison, rise. - License to\ncover construction permit (B4-PED-59, as modified) which authorized a new non¬\ncommercial educational broadcast station.\nCP Modification\nKWGS- The University of Tulsa. Tulsa. Okla. - Modification of construction permit\n(BPED-82, which authorized a new noncommercial educational station) for extension\nof completion date.\nACTIONS (AMPLITUDE AND MODULATION) COLLEGE AND UNIVERSITY\nNew Station\nLemoyhe.College. Memphis, Tenn. (P.0., 807 Walker Ave., Memphis 6, Tenn.) -\nConstruction permit for a new standard broadcast Station to be operated on 1400 kc.\npower of 250 watts and unlimited hours of operation. Contingent upon WHBQ being\ngranted a change of facilities.\n1230 KC - Extension Completion Date\nWBBR_.,a Watchtower Bible and Tract Society. Inc.. Staten Island, N. Y. - Modifica¬\ntion of construction permit (Bl-P-4807, as modified, which authorized increase in\npower and installation of new transmitter and directional antenna for day and\nnight use) for extension and completion date."
}