{
  "id": "d1521-23",
  "text": "-24-\n640 KC - Temporary Authorization\n/ WOI - Iowa State College, Ames, Iowa. Granted special temporary authority to\nbroadcast college basketball games, Farm and Home Week, and the National Farm\nInstitute during February (7:00—10:00 PM)\nACTIONS (FREQUENCY MODULATION) COLLEGE AND UNIVERSITY\nGranted CP' Modification\nKOKU - Norman, Oklahoma - Granted modification of CP for extension of completion\ndate to 8-1-48. (BMFED-104)\nGranted CP Modification\nWSOU - Seton Hall College. So. Orange, N. J. - Granted modification of CP for\nextension of completion date to 4-15-48 (BMFED-102)\nGranted CP Modification\nWBEZ - Board of Education. City of Chicago. Chicago, Ill. - Granted modification of\nCP to change transmitter site; effective radiated power to 14 Kft; antenna height to\n320 ft.; make changes in antenna system and extend completion date in non-commercial\neducational station. (BMPED-100)\nGranted CP Modification\nWKAR-FM - East Lansing. Mich. - Granted modification of CP for extension of com¬\npletion date to 4-15-48. (BMPED-99)\nGranted hearing Petition\nNorthwestern Theological Seminary & Bible Training School. Minneapolis, Minn. -\nGranted petition to continue hearing on applications (BP-5273; Docket 7922, and\nBPH-970; Docket 7923); hearing continued to February 25, 1948.\nDesignated for Hearing\nRadio Station WAIT, Chicago, Ill.; Metropolitan Radio Corp. of Chicago, Ill.;\nLake Shore Broadcasting Co., Evanston, Ill.; Lewis College of Science & Technology\nChicago, Ill. - Designated foi* consolidated hearing applications for Class B FM\nstations in the Chicago, Ill. area, (BPH-614; BPH-1317; BPH«*-1334; BPH-1401).\nGranted CP Modification\nWBOE - ‘‘Cleveland, Ohio - Granted modification of CP for extension of completion\ndate to 4-29-48 iBMPED-106)\nGranted New Station CP\nState of Wisconsin. State Radio Council, Chilton* Wise. - Granted CP for a new\nstation; Freq. 89.9 me. (Channel 210); 34 KWj antenna 800 ft, (BPED-86)\nGranted New Station CP\nState of Wisponsin. State Radio Council, Wausau, Wise. * Granted CP for a new\nstation; freq, 897l me, (Channel 206); 34 KW; 1090 ft. antenna (BPED-89)"
}