{
  "id": "d1521-24",
  "text": "■25-\nGranted New Station CP\nSan Diego, Unified School District, San Diego, Calif. - Granted CP for a new\nstationj freq. 91.7 me. (Channel 219); 3.3 KWj antenna 15 ft. (BPED-88)\nTELEVISION ACTIONS\niVOI-TV - Iowa State College. Ames, Iowa. Granted extension of completion date\non television CP (66-72 kc.j 3000 watts aural, 4000 watts visual).\n* * * *\nWILL THE 540 KC. CHANNEL BE OPENED FOR PROGRAM BROADCAST?\nThe National Association of Broadcasters yesterday asked the FCC to probe the\n’’most effective” use of the 540 kc.,frequency in this country. In a petition\nfiled at the Commission, the NAB said that ”if the characteristics of this frequency\nare to be fully utilized for the benefit of the people of the United States, it is\nclear that studies...will be necessary after execution of the agreement reached at\nthe forthcoming NAEBA conference.”\nThe.NARBA conference is scheduled to be held in Canada in August. 1948. The\npreliminary meeting of engineers was held in Havana in November and December. It\nwas.limited to discussion of technical problems, to the exclusion of policy matters.\nThe 540 kc.. channel was added to the standard broadcast band for American regions\nat the Atlantic City International Telecommunications Conference last summer.\nThe NAB petition also pointed out that preliminary studies of the channel’s\nbest use would be necessary to provide a basis on which United States proposals\nfor NARBA may be submitted, and in order that the United States delegation may be\nfully instructed. NAB, during the 1944 meetings of the Radio Technical Planning\nBoard, advocated not only 540, but 530 kc.’s as well, for inclusion in the standard\nbroadcasting band. The NAB board at its November, 1947, meeting also favored the\ninclusion of 520 kes*\nThe National Council of Farmer Cooperatives in testimony before the FCC during\nthe Clear Channel Hearings asked that this 540 kc. as well as 530 kc. be considered\nfor use by Land Grant College radio station in serving farm groups. Other groups\nhave suggested the 540 kc. channel be considered' for non-commercial station usage.\nWE COMMEND TO YOUR ATTENTION'....\n’’Network waiting rooms are crowded with people who want to say something on the\nair. People with causes. Causes like Be-kind-to-birds-and-wildflowers. And\nother causes. Like the problems of management and labor. Like juvenile delin¬\nquency. And slums, and the shortage of school teachers. And the Bomb.”\n”A network can handle these problems two ways: (l) Give them fifteen minutes on\nthe air around midnight in which they can say a few words, and then send them\naway with a clear conscience. (Yours, not theirs.) Or...(2) Take their problem\nto heart, study it, live with it, do the most adult job of broadcasting you can.\nGive it not only a good time period but also as much time as is needed.”\n...Advertisement of the American Broadcasting-Company in ATLANTIC"
}