{
  "id": "d1521-7",
  "text": "HITS, MISSES & FLASHOVERS\nThe Program Executive Committee of the national Association of Broadcasters has\napproved publication of an \"FAB PROGRAM MAHUEL\" to improve programming of member\nstations. '\nIs Judge Justin Miller about to perform a “shot-gun wedding?\" These carriage lines\nsound like they came from the Blue Book.\n******\nGeneral Douglas MacArthur is rapidly increasing his circle of \"intimate enemies.\"\nAdded now to the roster which began with Newsweek Magazine, is CBS whose foreign\ncorrespondent in the Tokio area was likewise not accredited.\nSounds emanating from the Far Department in Washington, sound suspiciously , like\nthe General still thinks war-time censorships are in effect.\n********\nRepresentative Harris Ellsworth, Oregon Republican, told the House Commerce Com¬\nmittee that the major networks are drunk with power and need a greater variety in\ntheir programs. \"If the big companies would study their popularity ratings, they\nwould find the small stations are outpulling them in public interest,\" he said,\n' and added, 'that the paramount need today is for a wide variety of programs from\nsmall stations rather than a few standardized programs by big networks.\"\nIf small stations would carry some of the truly excellent network public service\nshows instead of cancelling them out for local beverage broadcasts maybe the\n•public would also benefit.\n. * * ** * *\nAudience survey research organizations are reporting a dividing-up of listeners\nrather than new audiences as a result of the great increase in numbers of broad¬\ncast stations.\nIll ere are the new radio -programs for the third of the -population that leaves radio\nalone?\n******\nThe Federal Communications Commission has ruled that a radio station may broadcast\nhorse race results, \"if the information is not given with such urgency or detail as\nto suggest that gamblers might benefit.\"\nAnnouncers, detailed to read such bulletin, will please walk, not run to the\nmicrophone.\n******\nThe Radio Manufacturers Association and the national Association of Broadcasters\nare promoting the idea of a \"radio in every room\" (9 out of 10 American homes\nalready have 1 or more radio sets.) Each family member, they say, could then\nlisten to the program of his own choice.\nSounds to us a little like giving the \"star-boarder\" more forks to eat the same\nhash.\n******\nRepresentative Richard Figglesworth of Massachusetts, has called for an immediate\ninvestigation of the Federal uommunications Commission, accusing it of\" showing\npolitical!!, favoritism toward applicants for radio licenses.\"\nIs thjs the same FCC that incurred Senator HcEella^s wrath by over-looking his\nrecommendations for a \"friend?\"\n******"
}