{
  "id": "d767-29",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nOFFICE OF EXECUTIVE DIRECTOR\nUNIVERSITY OF ILLINOIS\n119 GREGORY HALL\nURBANA, ILLINOIS\nMr* Graydon Ausmus\nBox 2002\nUniversity of Alabama\nUniversity, Alabama\nDecember 9, 1953\nDear Graydon:\nThanks for your note about candidates for the associate director*s job*\nI have written to most of the persons you mention, and as soon as we\nget on top of the present load, I shall be distributing dittoed copies\nof all letters so far received. I think we by now have some half dozen*\nChe thing worries me a little. Mr. Bernstein, Sy Siegel*s candidate,\nwas under the impression that the job paid $9,000. If this were true\nwe would of course have to have $10,000 budgeted for us, in order to\ncover retirement and workmen*s compensation. Che of the problems we\nnow have is that workmen*s compensation was not included in the present\nbudget, and, since this deduction goes to 2$ on January 1, another\nnearly $1,000 deficiency will show up here in the present budget, to\nadd to the $1,000 over-draft inherited from last year and the $4,000\nadministrative charge made by the University for both last year and\nthis year, but deducted from this year*s budget.\nIf we receive $8,000, we shall be able to pay a maximum of $7,275* The\nsums which we will have to pay, from our budget, will amount to 9*79$\nof this sum, to bring the total we spend on this person to approximately\n$8,000. I hope we are clear on what has been requested and what will be\nsecured. I would not be^adverse to receiving more myself, of course,\nand I assume a promotion'\"as high a salary as possible for an associate\ndirector would be a good\"'way to work toward this. I do have the im¬\npression that going rates may be somewhat higher than was budgeted either\nfor my job or the other one, but I hope that, unless or until new re¬\nsources are available, any offer made will be in the realm of funds\nallocated.\nYou will notice that we have put a special note, inviting applications,\nin the December Newsletter on this. I hope to have all applications\ndistributed for consideration within the next couple of weeks.\nFulbright applications are now essentially all in. Would you care to\ndesignate a committee to whom these might be referred?"
}