{
  "id": "d767-4",
  "text": "Member: Modern Language Association, Phi Kappa Phi; national honorary societies\nfor German, French, and Cinematography.\nReferences:\nDr. Harold von Hofe, Chairman, Department of Gorman, University nf Southern\nCalifornia, Los Angeles 7, California.\nProfessor Harry Levin, Chairman, Department of Comparative Literature\nHarvard University, Cambridge 38, Mas«.\nMr. Fred G. Taylor, Radio Officer, American Embassy, PAD, APO 777, c/o\nPostmaster, New York, N. Y.\nFrom Harvard Appointment Office:\nThe following are copies of photo-static letters which Mr. Bardos brought to\nthis office:\nMr. Arthur Bardos has taught German at the University of Southern California\nfrom 1946-1948. His personality and rich cultural background coupled with a\nsound sense of pedagogy have earned for him the reputation of an effective and\npopular teacher. Students have expressed to me grateful appreciation of the\ncourses which they have had under Mr. Brrdos. Among his colleagues at the University\nMr, Bardos enjoys the highest esteem. We respect his scholarship and we can\nalways count on his cooperatlveaess. I recommend Mr. Arthur Bardos without reservation.\nSigned: Harold von Hofe, Chairman\nDepartment of German\nThe Univ. of Southern California\nUniversity Park\nJune 4, 1948. Los Angeles, California\nMr. Arthur Bardos was employed in the capacity of Radio Control Officer by\nRadio Branch of Information Control Division. Office of the Military Government\nfor Greater Hesse, from the summer of 1945 until September 1946. His duties\ninclined the scrutinizing of scripts prepared for broadcasts, the writing of such\nscripts in some instances, advising and guiding the German staff of Radio Frank¬\nfurt, particularly in the literary, editorial and features field, and the selection\nof qualified Germans to fill leading positions in the radio station. During the months\nof June and July he also acted as station chief and Chief of Radio Branch during the\nabsence of the permanent chief. Mr. Bardos* entire service with this organization was\nperformed in a superior manner. He returned to the States in September 1946 at his own\nrecuest. Signed: Herbert C. Gross, Capt. Inf.\nChief, Radio Branch\nInformation Control Division,\nRadio Frankfurt.\nSeptember 15, 1946,"
}