{
  "id": "d767-80",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nPERSONNEL POlICY STATEMENT\nPromotions and Salary Increases\nVacancies occurring, for any reason, shall, where practicable,\nbe filled by promoting a person already employed by the NAEB;\nprovided, that such person shall be fully qualified to fill the\nposition vacated.\nSalary increases normally will be given at the start of the\nfiscal year (July 1), except that increases may be awarded at\nother times when deemed advisable. Based on merit and length\nof service,salary increases normally will be given to each em¬\nployee each year, and such increases normally shall be between\n5% and 10% of the employeeTs current salary. However, finan¬\ncial considerations, ability and attitude of the employee, or\nother considerations may limit the amount and frequency of\nsalary increases, and nothing in this section should be con¬\nstrued as a guarantee that such increases will be forthcoming.\nInsurance\nEach employee is covered for Workmenrs Compansation by a policy\ncarried by the Association, except those NAEB employees em¬\nployed through the University of Illinois who are covered by\nthe University.\nAll employees in the Urbana office, whether actually employed\nthrough the University of Illinois or not, are eligible to\nbuy health insurance under the University1s group policy.\nRegular employees (as well as the Board of Directors) are\ncovered by a travel accident policy which provides for benefits\nin the case of accidental death or injury while travelling out¬\nside the city of employment on NAEB business. The coverage\nfor the President and Administrative Vice President covers 24\nhours a day, whether on NAEB business or not. Each employee\nmay designate his or her own beneficiary by filling out a form\nprovided by the NAEB.\nRetirement Benefits\nEach employee employed through the University of Illinois be¬\ncomes a participant in the University Retirement System. For\nsuch employees the Association shall contribute to the Retire¬\nment System such amounts as are required by the System; each\nsuch employee shall likewise contribute the amount specified\nby the Retirement System."
}