{
  "id": "d353-107",
  "text": "- 9’ -\nZur Zeit haben wir die ¥ahl zwischeri zwei Risikos. Das\neine besteht in der Fortsetzung des unsinnigen V/ettrtlstens in\nwaffen und der damit gegebene Gefahr sines unvermeidlichen und baldigen\ni^tomkrieges, das andere in dem Vereichten auf Atomwaffen und in dem\nHoffen, die Sowjetunion und die mit ihnen in Verbindung stehenden\nVdlker es fertig bringen werden, in Vertraglichkeit und Frieden neben-\neinander zu leben. Das erste enthSlt keine Moglichkeit einer ge-\ndeihlichen Zukunft. Das Zweite tut es. ViJir mUssen das Zweite wagen. .\nIn der unter dem Eindruck des Sputnikereignisses am 7«\nNovember 1957 gehaltenen Rede des PrSsidenten Eisenhower kommt das\nWort vor; ’H/iJas die Welt heute noch mehr braucht als einen gigantischen\nSprung in den Weltenraum, ist ein gigantischer Sprung zum Frieden hin.^^\nDieser gigantische Sprung besteht darin, dass wir den Mut zum Hoffen\naufbringen, dass in den Menschen und Volkern, der Geist der Verntinftig-\nkeit und der Menschlichkeit, den der Unverntlnftigkeit und der Unmensch-\nlichkeit verdrdngen konne.\nXXX\nWerden die Verhandlungen ftlr das Abrtistungsabkommen nicht\nim Hinblick auf die Moglichkeit des Verzichts auf Atomwaffen sondern\nnach diesem und auf Grund desselben geflihrt, so bekommen sie eine viel\ngrossere Bedeutung. Sie wer en dann zu einem grossen Unternehmen der\nendgUltigen Liquidierung der durch den zweiten Weltkrieg geschaffenen\nverworrenen Lage.\nAlle die Abrtistung, den Frieden und die Ermoglichung mog-\nlichst gerechter und stabiler Zustitnde betreffenden Fragen - vjie zum\nBeispiel die der Wiedervereinigung von Ost- und Westdeutschland -\nkdnnten nunmehr zur Sprache gebracht und in einer viel besseren .'*tmos^\n, phSre als vor dem Verzicht auf \\tomwaffen erdrtert werden. In\nmanchem konnte ein den so geftihrten Verhandlungen Ersatz fflr nach\ndem zweiten Krieg nicht zustande gekommene FriedensschlUsse ge-\nschaffen werden.\nAuf Grund des Verzichtens der drei AtommSchte auf .'itom-\nwaffen, h^.tte dann die 0 N U das Notige zu unternehmen, urn alle Vdlker\nzu verpflichten, ftlr jetzt und in Zukunft davon abzulassen, sie her-\nzustellen und zu gebrauchen. Die Gefahr, dass irgendwann irgend~\nwelche Vdlker auf den Gedanken kommen kdnnten, Atomwaffen herzustellen,\nmuss auf lange Zeit hinaus im /.uge behalten werden. GlUcklich mfissen"
}