{
  "id": "d353-118",
  "text": "QUEEN OF BATTLE\nSERIES THREE\n27- -THE ORDNANCE CORPS\nthe Army’s largest corps issues, maintains and repairs the\nequipment that keeps the American combat soldier ready\n28- -ANTIAIRCRAFT DEFENSE\nAmerica’s cities are protected from enemy air attack by the\nfamed Nike, developed and operated by the Army\n29- -THE ARMY’S MISSILES\nmeet the Army’s family of guided and free-flight missiles, a\nkey to success on tomorrow’s battlefield\n30- -THE ARMY’S CRIMINAL INVESTIGATORS\nthe Criminal Investigation Division solves a crime with highly\nscientific cunning in this dramatic who-dunnit\n31- -THE ARMY FIELD PRINTING PLANT\na little known part of the Army picture that plays a big role\nin getting the word to the combat and student soldier\n32- -SERVICE AND PATRIOTISM\nliberty and freedom, keywords of American patriotism, give real\nmeaning to military service\n33- THE COMBAT ARM OR DECISION\nthe strength of shock action, firepower, mobility and armor it¬\nself make Armor an indispensable ally of the infantryman\n34- THE NATIONAL GUARD\nAmerica’s oldest military unit has always answered the call to\narms. Today it offers a challenge to teen-agers\n35- -ALL READY ON THE HOME FRONT\nthe United States Army Reserve’s “take six’’ plan arms the Nation\nwith a large citizen army, combat ready with a minimum of training\n36- -ARMY ECONOMY\n“economy’’ takes a serious meaning when it conserves the strength\nof the Army and the Nation\n37- A COMBINATION OF IDEALS\nintangible benefits and satisfactions are strong reasons why the\nArmy life is an honorable and rewarding one\n38- -THE TRANSPORTATION CORPS\nthe Army moves as the Transportation Corps moves. In the age\nof speed, their job becomes increasingly more complex\n39- A GI’S LETTER\none GI tells why he decided to make the Army his career. He\nspeaks for the Nation’s hard core of professional, dedicated soldiers\n14:17/14:27\n14:22/14:32\n14:27/14:37\n14:16/14:26\n14:15/14:25\n14:13/14:23\n14:06/14:16\n14:25/14:35\n14:17/14:27\n14:07/14:17\n14:16/14:26\n14:07/14:17\n14:04/14:15"
}