{
  "id": "d353-172",
  "text": "r\nOn “February 1,\nHoward W. Bennett, often\ncalled the “dean” of eco¬\nnomic education in Ameri¬\ncan industry, joined the\nNational Education Pro¬\ngram staff as director of\nfield services. Shortly there¬\nafter he began an itinerary which will take him into\nthe major industries and school systems throughout\nthe 48 states, seeking advice for the improvement of\nour educational services and offering the written and\nvisual aid materials being developed in our Searcy\nworkshops. In his 30 years with General Electric\nCompany, Mr. Bennett’s assignments included execu-\ntwp rpspnnRihilitipR in-4h&-manageraent, engineering,-\nmanufacturing and marketing fields. During his last\n10 years he spearheaded the\ndevelopment of one of the\nmost extensive economic\neducation programs in\nAmerican industry, reaching\nGE’s 220,000 employees and\nsupplying materials for sim¬\nilar programs in industries\nemploying several million\npersons. Upon his retirement\nfrom GE, a number of top¬\nflight organizations in the East and Midwest made\nattractive overtures for his services; he chose to\nassociate himself with the National Education Pro¬\ngram (at a considerable financial sacrifice) because,\nas he told Dr. Benson, “It offers the greatest oppor¬\ntunity for effective work in bringing about a wide-\nopmid—underatanding-ef-th^ advantages of- our\nAmerican private enterprise system.” Mr. Bennett\ncontinues his active membership in such organizations\nas the American Society of Training Directors; the\nNational Sales Executives Association; the U. S.''\nEducation Institute, which at present is pioneering\nclassroom education through closed-circuit TV; and\nothers. One of his chief responsibilities in the field is\nthe distribution of the “American Adventure” film\nseries for TV and industrial employee programs.\nHoward Bennett\nNUMBER eighteen/mID-YEAR, 1958\nYOUR\nGRASS ROOTS\nREPORT\nThe\nI NATIONAL EDUCATION PROGRAM\n815 CENTER STREET • SEARCY, ARKANSAS\n/%T THE MID-YEAR milestone in 1958 we\ncan report an enthusiastic optimism among\nstaff members of the National Education\nProgram, a solid and growing belief that\nAmerica will turn back Socialism and with¬\nstand the machinations of world Commu¬\nnism. During 1957 and especially in the\nfirst six months of 1958 we have watched,\nindeed we have been participating in a\nsignificant expansion of an informed citizen\nforce determined to keep our basic economic\nand political principles intact. Yes, we are\ngaining strength—school teachers, educa¬\ntional administrators, the wage-earning and\nsalaried men and women of America are\nnow paying attention to the American story;\nmore and more of them are beginning to\npass the facts along to their fellows. With\nthe inauguration of a second annual Free¬\ndom Forum at Oklahoma City in co¬\nsponsorship with educational, business and\nindustrial leaders; with our new series of\nfilmstrips and movies dramatically showing '\nhow much more human welfare our private\nenterprise economU s.y»l&m -\nthan the socialistic Welfare States of Europe,\nand with the addition to our staff of Howard\nW. Bennett, former General Electric eco¬\nnomics education specialist, we have\nstrengthened and intensified all phases of\nour nationwide work. This report to patrons\nand friends of the Program reflects some of\nthe highlights of our progress.\n—George S. Benson\nI Dr. Benson's two weekly Looking Ahead\nfor newspapers, and the condensed version, Listen"
}