{
  "id": "d353-173",
  "text": "r\nOn TeSruary h\nHoward W. Bennett, often\ncalled the “dean” of eco¬\nnomic education in Ameri¬\ncan industry, joined the\nNational Education Pro¬\ngram staff as director of\nfield services. Shortly there¬\nafter he began an itinerary which will take him into\nthe major industries and school systems throughout\nthe 48 states, seeking advice for the improvement of\nour educational services and offering the written and\nvisual aid materials being developed in our Searcy\nworkshops. In his 30 years with General Electric\nCompany, Mr. Bennett’s assignments included execu¬\ntive responsibilities in the management, engineering,\nmanufacturing and marketing fields. During his last\n10 years he spearheaded the\ndevelopment of one of the\nmost extensive economic\neducation programs in\nAmerican industry, reaching\nGE’s 220,000 employees and\nsupplying materials for sim¬\nilar programs in industries\nemploying several million\npersons. Upon his retirement\nfrom GE, a number of top¬\nflight organizations in the East and Midwest made\nattractive overtures for his services; he chose to\nassociate himself with the National Education Pro¬\ngram (at a considerable financial sacrifice) because,\nas he told Dr. Benson, “It offers the greatest oppor¬\ntunity for effective work in bringing about a wide¬\nspread understanding of the advantages of our\nAmerican private enterprise system.” Mr. Bennett\ncontinues his active membership in such organizations\nas the American Society of Training Directors; the\nNational Sales Executives Association; the U. S.\"\nEducation Institute, which at present is pioneering\nclassroom education through closed-circuit TV; and\nothers. One of his chief responsibilities in the field is\nthe distribution of the “American Adventure” film\nseries for TV and industrial employee programs.\nHowprd Bennett\nH Dr. Bensori’s two weekly columns—LooMmg Ahead\nfor newspapers, and the condensed version. Listen\nAmericans for industrial publications—continue to add\nnames to their mailing list. A recent series of columns\non the ‘'Farm Problem'’’’ emphasizing the fundamental\nnecessity of agricultural production for a market\neconomy brought in a flood of mail from farmers and\nurban consumers. Ninety-eight per cent commended\nDr. Benson’s recommendation for the withdrawal of\nthe Federal Government from the marketing and man¬\nagement and other economic functions of American\nfarming. More than 4,000 publications now receive\nthe two columns with an estimated readership of\n20 million.\n■ The “American Adventure” citizenship education\nfilm series in the first six months of 1958 reached\nthousands of new audiences. The total audience thus\nfar: 22,500,000. At latest count, nearly 1300 prints\nhad been purchased by organizations planning ex¬\ntensive use of the films. More than half of these\nsales were made to schools.\nOne recent purchase requisition from the State\nDepartment of Education in Louisiana involved an\norder for more than $5,560 worth of prints which\nwere placed in regional libraries throughout the\nState for distribution to every school system in\nLouisiana.\n■ The National Program Letter continues to expand\nits reader audience. Approximately 50,000 now go\nout to influential people in the 48 states. The series\ncontaining the dispatches of Glenn Green from Scan¬\ndinavia and the Continent, reporting the facts on the\nsocialistic Welfare States of Europe, brought in an\nunprecedented volume of reprint requests. Hundreds\nof industrial employee publications published portions\nof the series. The National Research Bureau, the\nnation’s top producer of Reading Rack publications,\nobtained permission to publish the reports in booklet\nform for its industrial and organizational clientele;\nthere will be six Reading Rack pieces in this NRB\nseries with expected runs aggregating several million\ncopies. Our organization has been asked to follow up\nthis distribution with a single publication digest of\nall the Welfare State material—presenting at the same\ntime the comparative American economic facts.\n(PLEASE TURN PAGE)\nV EVA.I.XTA.TION'S\n\"'The afterglow of the Freedom Forum lingers with me yet. It is\nmore than Just an emotional experience. Ifeel that my insight has\nbeen-so informed and my heart so moved that I will be per¬\nmanently affected by being aroused to responsibilities heretofore\nneglected.”\nJ. Robert Ashcroft, President\nEvangel College\nSpringfield, Missouri\n\"Attending the Freedom Forum at Harding College was a\nwonderful experience, not only became of the Forum, but because\nit gave me an opportunity to observe first hand the fine work\nyou are doing in the college there.”\nD. D. Wendel, Vice President\nAlabama Power Company\n\"I have a better concept of the menace of Socialism and a deepened\nappreciation for the principles of American freedom. The contact\nwith other conferees has given me a broader understanding of\nsome of their problems.”\nMrs. Leslie Evitts\nHistory Teacher\nFort Smith Senior High School (Ark.)\n“ Whatever final impressions / record, the first is to congratulate\nyou and the staff on the great work being done to advance the\nlove of America and the American way of life. The second im¬\npression is that the great work you are doing takes great people\nand there is no doubt in my mind that you and your staff are\ngreat people.”\nBro. Stephen Sheehy\nHamilton Catholic High\nHamilton, Ohio\n\"It was the most informative and worthwhile meeting I have\never been privileged to attend.”\nMrs. Carol McMullen\nReynolds Metals Company\nBauxite, Arkansas\n\"I have attended a number of forums, workshops, etc., but this\none was the best in organization, information given, and the\nmost important for our future. It was a great experience. Keep\nup the great work.”\n^ B. L. Wertz, Principal\n. Central High School\nMuskogee, Oklahoma\n\"This Forum has given me a purpose and objective in what will\nlast through life and more specifically has clarified in my mind\na previous dilemma, i.e., that labor and managements goals are\nnot inherently diverse, but rather that the system best for either\nis best for both—the capitalistic system.”\nJudge John F. Campbell\nPampa, Texas\n\"The wealth of information digested from the well-planned pro¬\ngram, the excellent guest speakers, and the thought-provoking\nquestions and answers of attending conferees will help us to tell\nthe American Story to others.”\nRobert L. Burke\nEditor, HIGHLIGHTS\nHouston Lighting & Power Company\n\"The Forum was both educational and enjoyable. I don't know of\na thing about the entire program that I could offer except praise.”\nClyde Beals, Secretary\nProgress Manufacturing Co., Inc.\nArthur, Illinois"
}