{
  "id": "d353-174",
  "text": "lia\nfietnCte\nw\nA $1,500 essay contest on the subject, “My Stake in Free Enterprise,”\ndesigned to encourage high school students to delve deeply into the basic\nreasons why America grew great and strong, was launched in a 32 county\narea in eastern North Carolina on February 20.\nThe contest, conceived and suggested by the National Program staff,\nwas sponsored by the First Citizens Bank and Trust Company of Raleigh,\nwhich has banks throughout the eastern area. The essays were based on\nOri^ute io T)r. Jenson . . .\nFOR HIS ACHIEVEMENTS IN ANOTHER AREA-HARDING COLLEGE\nFrom among the large number of prominent American\nuniversities and colleges entered in the Freedoms Foundation's\nnationwide competition. The Distinguished Awards Jury, headed\nby Dr. M. E. Sadler, president of Texas Christian University,\nselected Harding College tq receive the top award for a campus\nprogram strengthening and safeguarding the structure of Ameri¬\ncan Freedom. Dr. Benson was called to Valley Forge, Pennsyl¬\nvania, on Washington's Birthday to personally receive the coveted\nThomas Jefferson Award, highest recognition in America for\nbuilding citizenship and citizen leaders dedicated to the basic\nprinciples and institutions of freedom. Harding College also\nwas awarded the Distinguished Service plaque for having been\nhonored eight consecutive years by Freedoms Foundation', and\nDr. Benson personally received the George Washington Honor\nMedal for his address: A Job for American Industry and Edu¬\ncation. Harding's competition for the Jefferson Award included:\nUnited States Military Academy, University of Southern Cali¬\nfornia, University of California at Los Angeles, University of\nTexas, Georgetown University, The Citadel, University of San\nFrancisco, Tufts University, and University of Wyoming, and\nabout 40 other colleges. Said Dr. Kenneth D. Wells, president\nof Freedoms Foundation: \"Our 1958 Distinguished Awards Jury\nhas said that the program in American citizenship education at\nHarding College is one of the greatest things being done in\nAmerica.\"\nAWARD, )1,D00 GIVEN\nTO HARDING CDLIEGE\nDr. Benson Also Honored By\nFreedoms Foundation\nFreedoms Foundation yester¬\nday named Harding College the\nNo. 1 school in the nation in pro¬\nmoting the American way of life\nand picked Dr. George S. Ben¬\nson, Harding’s president, for an¬\nother high honor.\nThe Searcy, Ark., school,\nwhich has an extension branch\nin Memphis, won the Thomas\nJefferson cash gift of $1,000,\nreceived\nmaterial appearing in the National Program’s “American Adventure” tele¬\nvision film series which was televised weekly over WRAL-TV, Channel 5,\nRaleigh. The contest was open to high school students in grades nine through\ntwelve and stimulated intense interest throughout eastern North Carolina.\nHundreds of high school students submitted entries.\nIn order to assure a saturation use of the “American Adventure” series,\nthe First Citizens Bank and Trust Company organized a speakers’ bureau\nto visit schools and assist principals and teachers where necessary in the use\nof the films; radio and television spot announcements were carried three\ntimes daily, and the films were made available to schools and Parent-Teacher\nAssociations and civic clubs for local showings.\nThe essays were judged by three distinguished North Carolinians:\nW. W. Taylor, Jr., president of the North Carolina Bar Association; Ben R.\nRoberts, State Commissioner of Banks; and\nState Treasurer Edwin Gill. The contest\nended just before schools recessed for the\nsummer vacations. Winners were to be\nannounced shortly.\nA blueprint of the entire project is\nbeing published as a guide to “saturation”\nuse of the film series throughout the nation.\nAn immediate collateral benefit was\nan order for several sets of the “American\nAdventure” films to be integrated into\n.school systems of the area.\nGraduating class—Forum XIX\n'7<t4e Ok€(\n1,500.00 Essay Contes^\nAMERICANS HAVE A STAKE IN\nNORWAY, TOO!\nOpplysningsinstituttet For Fritt Naeringsliv in Oslo, Norway, is an organization of\nfree enterprisers, set up after the Socii\nlatedly seeking to awaken the Norwegia\nand individual self-reliance. The name\ncational Institute for Free Enterprise.\nfor business and industrial personnel\nhousewives. “Libertas” has been using\nis lists had gained control of the government, be¬\nat citizenry to the advantages of private ownership\nof the organization, freely translated, is: Edu-\nt is known throughout Norway as “Libertas”. It\nconducts a nationwide educational projiram, including a daily tabloid newspaper and an\neducational institute providing short coirses in the private enterprise economic philosophy\nand community “thought leaders,” including\nI our NEP free enterprise films, with Norwegian\nsound-track, for a number of years. In April a new supply of the following titles was\nordered: Meet King Joe, Going Plac(s, Why Play Leapfrog, Inside Cackle Corners,\nFresh Laid Plans. A similar organization in Sweden uses the films, as do organizations\nin a number of other European nations.\nFreedom Forums held in Oklahoma City in January and on the Harding Campus\nat Searcy in April more nearly approached the ideal—in programming and in the make-up\nof the conferee bodies—than any since the Forums were inaugurated ten years ago.\nSo that our patrons and friends may better appreciate the widespread reach and the effec¬\ntiveness of these Forums, we are listing on the back cover the conferees and principals who\nparticipated in Forum XIX on the Harding Campus.\nThe Oklahoma City Forum was attended by 115 business and industrial execu¬\ntives, including several presidents, vice-presidents and union labor people; clergymen,\ncivic club officers, American Farm Bureau regional officials, and educators from a region\nembracing Texas, Kansas and Oklahoma. The conferees responded enthusiastically to a\nbusy three-day program featuring presentations by Dave Crawford Houston, economic\neducation specialist with Kennecott Copper Corporation; Herbert Philbrick, famed FBI\ncounterspy; Dr. Sylvester Petro, New York University law professor and economist;\nRobb M. Winsborough, vice-president of Middle West Service Company; Dr. Benson\nwho keynoted and closed the Forum; and Dr. Clifton L. Ganus and Glenn Green,\ndramatizing the comparative economics in America and the European Welfare States.\nPhilbrick lakes a question\nSELLING THE AMERICAN SYSTEM\nTO HIGH SCHOOL AND COLLEGE YOUTH\nForty-six educators participated in this Forum. Two of the immediate results in the educa¬\ntional field were the establishment of American citizenship courses in the public schools\nof Tulsa and at Muskogee. Officials of these school systems attended the Forum and a\nfew weeks later called upon Dr. Benson to address the faculties and student bodies to\ninaugurate new citizenship courses built with the Forum materials.\nCentral Christian College co-sponsored the Forum with the National Program.\nBy popular demand of the 115 conferees and the distinguished industrial leaders on the\nOklahoma Advisory Committee this Oklahoma City Forum is to become an annual affair.\nAt the April Forum in Searcy we were hosts to 107 people from 25 states.\nState Departments of Education in Virginia and Washington, school systems from 15\nstates and three colleges and universities were represented in the conferee body. The\nForum concentrated its attention on the problem of achieving widespread dissemination\nof the comparative facts of political and economic systems. Eight members of the Forum\nAdvisory Committee—personnel and communications executives from General Motors,\nGeneral Electric, Folger’s Coffee, Pepsi-Cola Bottlers, Hinde & Dauch, Monsanto Chemi¬\ncal, the Indianapolis Chamber of Commerce, and the Washington State Department of\nPublic Instruction—personally assisted the NEP staff with the operation of the Forum.\nForum-end evaluations and specific back-home results reported were especially en¬\ncouraging to Dr. Benson and gave assurance that this Forum was one of the most suc¬\ncessful in the series begun 10 years ago. Many of the 26 educators in attendance spoke up\nat the final session to pledge themselves to the immediate development of classroom\ncourses designed to bring about a keen appreciation of our private enterprise economic\nsystem and our Republican form of Government. A feature of Forum XIX was the\nattendance of 31 retired U. S. Army Colonels and Generals, residents and most of them\nemployed in Arkansas Educational Work. They were special conferee guests of the NEP.\n(See roster on back page.)\nGlenn Green begins his Vu-graph Retired generals\nreport on the welfare states show keen interest\nChairman Mills of House Ways and\nMeans, in Harding auditorium"
}