{
  "id": "d353-20",
  "text": "President Lynn White, jr., Barnard Forum, 2/8/58 •• 4\nWhere are the Independent institutions going to find the cash as assnunition to\nfight off such raids and thus hold their own academically? One assumes constantly\ngrowing prograpt of fund-raising from alumni, parents, corporations, and the like.\nOne assumes likewise a continuation of the present gradual change in the handling\nof endowment funds: a change from trusteeship of dollar values to trusteeship of\npurchasing power, in recognition of the long-term inflation which destroys the\npurchasing power of dollars. But it is clear that these measures alone will not be\nsufficient.\nRecently, here in the Northeast, there have been several suggestions that a\nlarger part of the cost of college education -- perhaps even the full cost should\nbe passed on to the consumer and his family. To the objection that not many families\ncould afford so much, and that such a move would de-democratize student bodies, the\nreply is made that a college education is demonstrably the world's best investment,\nand that students should not hesitate to borrow amply for it, confident that their\nincreased earning power in later years will make repayment simple.\nI find myself shocked by this confirmation and consecration, from high sources,\nof the view that the prime purpose of a college education is to make more money than\nwould otherwise be possible. I myself have mentioned earlier that our technological\nrevolution has made necessary a constantly rising level of popular education. But\nsurely it is selling the academic birthright for a very maggotty mess of pottage to\nput the economic motive first in the quest for sound learning.\nMoreover, this proposal is strictly masculine in its mode of thought. I know\nof no wide survey of loan funds, but 1 suspect that college girls are much more\nreluctant to borrow for their education than are college boys. Every college girl\nwhom I know expects to work at some periocb in her life. But she is also quite\nresolved to marry and have children. She knows that hier husband may well have\naccumulated debts, particularly for graduate and professional work, and, since she"
}