{
  "id": "d353-213",
  "text": "SWEDISH RADIO- & TV PROG RAMSERVICE\nA DEPARTMENT OF AB MASKIN & ELEKTRO LTD\nOFFICE! Nygatan 11 A, Orebio, Swedeo, TeJ. 124780 — STUDIO; Femkampsgatan 14, Postbox 113, Orebro, Swedan, Tel. 121418 — CABLE ADDRESS: Moskinelektro\nOFFICE OKLAHOMA:\n1809 LIBERTY BANK BUILDING\nOKLAHOMA CITY 2\nOKLAHOMA\nUSA\nOKLAHOMA\n4^,\nAugust 25, 1958.\n^*oj5ert E. Underwood, Ja*\nNetwork Manager,\nNASB,\nUrbana, Illinois.\nDear Mr* Underwood:\n■%\n^ V\nThanks so much for the quick response to ray letter\n^d the material you sent me. I have forwarded most of the material\nby air mail to Mr, Rolf Zetterlund, the President of our company, at\nOrebro, Sweden for his examination and consideration, I feel certain\nthat he will have an immediate favorable reaction. I am enclosing\nsome printed material which I have been giving to interested parties*\nI am sorry that I do not have any extra copies of the list of tape\nrecordings. Apparently the lists sinc^e May have been lost in the\nmails. As soon as they arrive, I will send you copies for your con¬\nsideration^ I have also sent a photo copy of your letter for con-\nsideratioB by Mr. Zetterlund. He plans to come to the U.S.A again\nthis fall. I met him two years ago this fall and he was here last\nNovember on a two week^s trip to this countyy, I hope he will be\nable to come to Urbana to see you this year,\n^ present time I have made program exchanges\nwith KTOK in Oklahoma City, KVOO in Tulsa, KTRH-PM in Houston, and\nthe University of Wisconsin State Network through cliff fiblen, who\nyou may know. If Cliff is in Madison this Friday, I hope to visit\nwith him on a short trip that my wife and I arkm. taking to visit ray\n'^if®*s mother. I wish I had time to visit Urbana to see you, but I 7\"^^\nwill have to make it some® other time.\nI wish you could sen<l me another set of mater’ial\nby parcel post for my own file as I forwarded most of the material\nto Rolf Zetterlund in Sweden, He has been doing a lot of contract work\non tapes for RCA in Oslo, Norway and for Livingston and Oraegatapes,\ncommercial pre-recorded tape companies in this country*\nT have four programs by Egon Kjerrman's orchestr\n-a that I can send you anytime for your use in dubbing or copying\nthem. Cliff Eblen has two programs he should be copying aid I will\ntake him two more on my trip to Madison*\nWe have a lot of Illj^ols alumni here in the\ncity, I am President of the ‘''Wisconsin Alumni here and Norman where\nwe have about I30 alumni in the two cities.\nSincerely yours,\nE,G* Dahlgren."
}