{
  "id": "d353-222",
  "text": "Always in the first line with novelties\nk-\nMASKIN&ELEKTROco.ltd specialisis in radio- and\nTV distribution. A number of experts specialising in the many\nimportant different directions within the electrontechnical\nsphere and a large collection of instruments for all imaginable\ndevelopment-, service- and measuring purposes are employed.\nThe company owns a four-story office building in the city of\nOrebro with commodious premises.\nThe founder of the company, Mr. R. Zetterlund, is a pioneer\nin Sweden in the tape recording sphere. In 1946 he brought\nin his luggage from U. S. the First nori^roFessional\ntaperecorder ever to cross the border into Sweden. That was\na »Soundmirror» from the Brush Development Co. in Cleve¬\nland, Ohio. Some hundreds of this machine were imported\nbefore the import ban came into force in Sweden during the\nspring of 1947. After more than one year of negotiations\nwith the American manufacturer it was agreed to start the\nmanufacturing of a Swedish »Soundmirror». However, the\ndifficulties were great because of the lack of raw materials\nand skilled technicians. In the meantime progress in U. S. A.\nhad reached a new point necessitating the investment of a\nlot more money, if the manufacturing were to continue.\nTherefore the manufacturing company was taken over by the\nL. M. Ericsson Telephone Co., which company still is producing\ntaperecorders in the factory.\nThe Tandberg factory has always been\nfirst with new developments. Thus in\nEurope the first taperecorder with a\nsuper low speed of 1 %\" ps and the\nfirst machine with 3 different recording\nspeeds and also the first machine with\nHi-Fi and a frequency response of\n30—16000 cps ± 2 dB, were developed\nin this factory. Finally the factory is\nnow in full production of the first\nstereophonic taperecorder on the European\nmarket and at a very reasonable price.\nThe combination of the Tandberg\nstereophonic Hi-Fi taperecorder and two\nTandberg Hi-Fi loudspeakers gives a\nsound reproduction only comparable to\na very high class professional equipment.\nMr. Zetterlund had however found a growing market for tape-\nrecorders and therefore investigated the products of different\nforeign manufacturers. He found that the best nonprofessional\ntaperecorder he had ever seen was manufactured by the Tand¬\nberg Radio Factory in Norway and furthermore, that this\nmachine could be sold at a reasonable price. It was agreed\nthat the new company, MASKIN & ELEKTRO CO. LTD,\nfounded by Mr. Zetterlund, should work as exclusive repre¬\nsentative in Sweden for this taperecorder and other products\nproduced by the same factory. The selling of the Tandberg\ntaperecorder started during the spring of 1953. Very soon\nit became the main product of the company and the selling\nhas grown year after year.\nWghi now the Tandberg taperecorder is the most popular\nand the best selling recorder in Sweden.\nThe Tandberg Radio factory, as the\nname indicates, is also manufacturing\nradio sets. The highest quality of radio\nreceivers is produced, high sensitivity and\na perfect sound quality and a lot of\nrefinements are characteristic of their\nproduction. The radio models therefore\nmet with outstanding success on the\nSwedish market. Also with regard to\nradio receivers the Tandberg factory is\nin the highest class. The latest model\nwith a Hi-Fi amplifier, built together\nwith an AM and a FM receiver, is\nsomething very new, and up to now no\nother European factory has produced\nanything of that class."
}