{
  "id": "d353-284",
  "text": "- 4 -\nThe clean hydrogen bomb is intended for the showwindow only-,\nnot for use. The bomb is to help people to believe that from now on\nnuclear tests will be followed by less and less radiation, and that\nreal argument speaks against the continuation of the tests.\nThose who think that the danger created by nuclear tests\nis small, mainly take the air radiation into consideration, and\npersL^'d'e themselves to believe that the danger limit has not yet been\nreached,\n-■■he results of their arithmetic are, however, not so\nreliable as they would like to believe. Through the years the\ntoleration limit for radiation has had to be reduced several times^\nIn 1934 it was 100 radiation units per year. At present the limit\nis officially put at 5» In'^ny countries it is even lower. Dr^\nLauriston Taylor (USA), who is regarded as an authority on protection\nagainst radiation, holds, like others, that it is an open question\nwhether there is anything called a harmless amount of radiation. He\nthinks that we can only speak of an amount radiation which we regard as\ntolerable.\nV/e are constantly being told about ’’a permissible amount of\nradiation^^ ATio permitted it ? Vi^ho has any right to permit it ?\nWhen speaking about the risk of radiation we must take\ninto consideration not only the radiation coming from the outside,\nbut also of that coming from radioactive elements in our body,\nVJhat is the source of this radioactivity ?\nThe radioactive elements brought up in the air by nuclear\ntests do not stay there permanently. In the form of radioactive rain\nand radioactive snow they fall down on the earth. They enter the\nplants through leaves and roots and stay there. We ab.sorb them through\nthe plants by drinking milk from the cows or by eating the meat of\nanimals which have fed on it. Radioactive rain infects our drinking\nwater*\nThe most powerful radioactive poisoning occurs in the areas\nbetween the Northern latitudes 10*^ and-60°, because of the numerous\nnuclear tests conducted mainly on these latitudes by the Soviet Union\nand the United States,"
}