{
  "id": "d353-285",
  "text": "- 5 -\nThe radioactive elements absorbed over years by our body\nare not evenly distributed in thc/cellular tissue, but are deposited and\naccumulated at certain points. From these points the internal radia-\ntion takes place,causing injuries to particulary vulerable organs«\nWaat this kind of radiation lacks in strength is made up for by its\nlongevity, working, as it does, day and night for years.\nIt is well-known fact that one of the most widespread and\ndangerous elements absorbed b3^ us is Strontium 9Pa I't is stored in\nthe bones and emits from there its rays into the cells of red bone\nmarrow, where the red and white blood corpuscles are made. Blood\ndiseases - fatal in most cases - are the result.\nThe cells of the reproductive organs are particularly sen¬\nsitive. Even relatively weak radiation may lead to fatal consequences\nThe most sinister aspect of internal as well as external\nradiation is that years may pass before the evil consequenses appear.\nIndeed,they make themselves felt, not in the first or second gene¬\nrations, but in the following ones. Generation after generation, for\ncenturies to come, will witness the birth of^ an ever-increasing\nnumber of children with mental anc. physical defects.\nIt is not for the physicists, choosing to take into\naccouatn only the radiation from the air, to say the decisive word\non the dangers of nuclear tests,. That right belongs to the biologists\nand physicians who have studied internal as well as external radia¬\ntion, and those physicists who pay attention to the facts established\nby the biologists and physicians.\nThe declaration signed by 9^35 scientists of all nations,\nha.nded to the Secretary General of the UN by the well-known American\nscientist Dr. Linus Pauling on January I3, 1958? gave the reassurance\npropaganda its death-blow. The scientists declare that the radio¬\nactivity gradually created by nuclear tests represents a great danger\nfor all parts of the world, particularly^ serious because its conse-\nquense will be an increasing number of deformed children in the\nfuture. For this reason theyinsist on an international agreement\nputting an end to the nuclear tests."
}