{
  "id": "d353-60",
  "text": "DESCRIPTION OF # 1 — “CONVERSATIONS ABROAD'* — CARLA RICH INTERVIEW\nCONTENT; GENERAL PLAN OF “EXPERIMENT PROGRAM\"; how “Experimenters\" prepare\nfor their summer experience...how to enroll in the program...what to expect\non a summer \"Experiment\";... .where you will live, what you will do in the\nhost tome, on the tour;..,.the value of the trip.,., study preparations for\nthe summer \"Experiment\"....process of pooling knowledge gained by all members\nof the group so that each not only has individual experiences, but profits in\nthe understanding acquired by all.background on \"THE EXPERIl\\ffiNT\", why and\nwhen it was founded. One example of direct contribution of the Experiment\nprogram: i4.,000 of the [|.0,000 who have taken part in the program over the 25\nyears of its founding, are now in international relations,\nDESCRIPTION OF #2 — \"CONVERSATIONS ABROAD\" — INTERVIEW WITH YOUNG STUDENT\nLEADERS OF FRENCH GROUP AT RAILWAY STATION AS THEY\nPREPARE TO LEAVE FOR A VISIT TO AMERICAN HOMES FOR\nTHE SUMMER,\nWhat the young men leaders hope to explore in their summer visit of their\nthree groups in American attitudes and understanding between American and\nFrench people (\"America is not all a factory and machine land..,,France is\nnot all Place Pigale,\"). Each of the three French groups had in it, young\nFrench students and students from Tunis, Morocco, and Algiers, thus making\nit an opportiinity for the French group to learn more about the different\npoints of view separating them.,.they bring out explicitly that no one group\nof people can surely have the \"right\" answer to solving world problems.\nthat the only hope lies in understanding the cultural, historic and political\nbackground of each the \"answers\" offered as national or regional \"solutions\"\nor points of view.also includes hopes and plans of the French groups'\nexperience in America....the possibility of studying \"alcoholism\", learning\nmore about each city and town.,..a possible visit to Miami etc."
}