{
  "id": "d353-87",
  "text": "“ 7 -\ndie Folgen offenbar werden. Die ublen Wirkangen auf die\nNachkojnmensGJriaft treten sogar erst viel spater in Erscheinung,\nkaum in der ersten und zweiten Generation, sondern erst in\nden spatern. In diesen werden dann Missgeburten in steigendem\nMasse bis in Jalirhunderte iiinaus stattfinden.\nDas entsclieidende Wort in der Frage der sicb\naus den Versucbsexplosionen ergebenden Gefabr kommt nioht den\nPhysikdrn zu, die es fiir gut befinden, sich nur mit der aus\nder Luft auf uns Qinwirkenden Radioaktivitat abzugeben, sondern\n, ^ . . Sfrahlungen\nden sicn mit der von aussen und innen kommenden/beschaftigenden\nBiologen und Arzten, wie auch den Physikern, die auf das, was\nBiologen und Arzte feststellen eingehen.\nDen Todesstoss gab der Beruiiigungsprepaganda die\nErklarung der 9235 Wissenschaftlern aus alien Volkern, die der\nbekannte amerikanische Forsober Dr. Linus Pauling am I3. januar\n1958 Generalsekretar der U.N.O. uberreiohte. In ihr\nstellen sie miteinander fest, dass die durcb die Versuohs-\nexplosionen fort und fort erzeugte Radioaktivitat eine sohwere\ngefahr fiir alls Gegenden der Irde bedeutet, und eine iiberaus\nsohwere insbesondere daduroh, dass sie in kommenden Generationen\nMissgeburten in steigender Zahl zur Folge haben wird. Darum\nverlangen sie, dass ein internationales Abkommen den\nVersuohen ein Ende setze.\nNunmehr kann die Propaganda fiir Fortsetzung der\nVersuohe nioht mehr die Behauptung aufreoht erhalten, dass\ndie Wissensohaftier in der Frage der bestehenden G’efahr der\nRadioaktivitat nooh nioht einig seien, dass man deshalb erst\ndas Upteil offizieller internationaler Korpersohaften\nabwarten mtisse und bis dahin die Mensohheit nioht mit der\nBehauptung einer bestehenden und zunehmenden Gefahr der\nRadioaktivitat beunruhigen durfe.\nIn gewissen Zeitungen kann diese Propaganda\nweiterhin das grosse Wort fuhren. Neben ihr aber geht die\nWahrheit uber die Gefahr die die Versuohsexplosionen bedeuten,\nunersohiittert ihres Weges weiter und setzt sioh allenthalben\nin der offentliohen Meinung mehr und mehr duroh, Auf die Dauer\nvermag die bestorganisierte Propaganda niohts gegen die Wahrheit,"
}