{
  "id": "d353-97",
  "text": "Diese Notigung schnellster Abv/ehr ist es, welche die grosse Gefahr des\nzufSlligen Ausbruchs eines Atomkrieges in sich trSgt, Bei der Schnellig-\nkeit, mit der entschieden werden muss, was das auf dem Radarschirm\nsichtbar werdende bedeutet, ist die Moglichkeit eines verhSngnissvollen\nIrrtums gegeben, der unter Umst^nden den Ausbruch eines Atomkrieges\nzur Folge haben kann,\nDem amerikanischen General Curtis Le May zufolge muss man\nernstlich mit dieser Moglichkeit rechnen.\nTatsSchlich befand sich die Welt vor kurzem in einer sol-\nchen Gefahr. Die Radarstationen der amerikanischen Luftwaffe und die\nder amerikanischen KUste meldeten miteinander, dass Geschwader unbe-\nkannter Bomber mit Uberschallgeschwindigkeit auf Amerika zuk^men,\nDaraufhin hStte der General, der das strategische Bomberkommando be-\nfehligte, alsbald die ..tombomber zur Vergeltungsbombardierung starten\nlassen mtissen . Er konnte sich aber nicht dazu entschliessen, womit er\neine schwere Verantwortung auf sich nahm, Kurz darauf stellte sich\nheraus, dass die Radarstationen einem technischen Irrtum zum Opfer ge-\nfallen waren. Was hStte geschehen konnen, wenn ein weniger besonnener\nGeneral an seiner Stelle gewesen wSre I\nIn der nSchsten Zeit wird die Gefahr eines durch einen\nIrrtum verursachten ntomkriegs noch grosser sein. Die mit Uberschall¬\ngeschwindigkeit heransausende Raketen werden ihrer Kleinheit wegen erst\nspat auf dem Radarschirm sichtbar. Dadurch sind die /^bwehrmoglich-\nkeiten sehr beschrankt. Es bleiben nur Sekunden, urn zu entschieden, ob\ndas was sichtbar wird, wirklich Raketen sind, und das Erforderliche'in\nGang zu setzen. Dieses besteht in der Entsendung von .'.bwehrraketen,\ndurch die die feindlichen Raketen zur Explosion gebracht werden sollen,\nehe sie das Ziel erreichen, imd in der Entsendung von Bombengeschwadern,\nurn die feindlichen r.bschussbasen zu vernichten. Einem Menschenhirn kann\ndies nicht tlberlassen bleiben. Es arbeitet zu langsam. Man muss es\neinem mit dem Radargerat in Verbindung atehenden Elektronenhirn anver-\ntrauen. Hat dieses vermittelt, dass es sich tatsMchlich urn Raketen\nhandelt, sc berechnet es nach vom Radargerat empfangenen Angaben in\nBruchteilen von Sekunden deren Flugbahn und Entfernung und setzt den\nstart der Abwehrarbeiten in Gang. Dies alles erfolgt automatisch.\nSo weit haben wir es gebracht: Unser Schicksal wird von einem\nElektronenhirn und den Versehen, die ihm passieren konnen, abhSngen.\nEs kann nur automatisch entscheiden. Das Vermogen des Menschenhirns,\nin jeder Richtung und in jeder ^-^insicht dberlegend vorzugehen, ist"
}