{
  "id": "d1830-5",
  "text": "the university president at its spring meeting. His\nterm begins immediately.\ny Mrs. Meryle Renie Evans has been named Ad¬\nministrative Assistant in Promotion and Public Re¬\nlations for the Metropolitan Educational TV Associa¬\ntion, New York City.\nPROGRAMS\ny For what is believed the first time in history, high\nschool students competed in an oratorical contest on\na state-owned TV network.\nCooperating with the American Legion’s 20th An¬\nnual Oratorical National Contest, the Alabama ETV\nNetwork cleared a scheduled hour to carry the judg¬\ning of three state finalists.\nThe Alabama Legion in the past had staged it’s\ncompetition in auditoriums, limiting attendance to\nimmediate friends, family and instructors of those in\nthe contest (about 3,000 students enter each year).\nBy utilizing TV for the finals, it is estimated a min¬\nimum of 150,000 watched and cheered their favorites.\ny WBUR, Boston University, has produced a unique\nradio series, “Project Moon watch,” in cooperation\nwith the Smithsonian Observatory and the satellite\ntracking program. The series features discussions\nwith the observatory staff and members of the satel¬\nlite tracking organization, and they will be heard\nthis summer on the NAEB network.\nTEACHING\ny In a questionnaire given teachers who took the\ntelecourse “Art Skills for Elementary Teachers,”\nWKNO-TV, Memphis, found the group agreed that\nsubjects could be successfully taught on TV: 92%\nthought personal contact with instructor was good,\n70% felt the home classroom was equal to or better\nthan the college classroom, and 86% said you can see\nand hear better on TV (assuming perfect reception).\nHowever, when asked if a complete curriculum\nshould be offered on TV and degrees awarded, 68%\nof the group said, “No.”\n—N A E B—\nMiss Judith Waller, long-time NAEB friend,\nand honorary member, retired from her position as\nNBC Public Affairs representative on April 30. Miss\nWaller was the first manager of radio station WMAQ,\nand has been in the broadcasting business 35 years.\n—NAEB—\nDr. Bert Donnepp, director of the Adult Educa¬\ntion Center in Westphalia, Germany, paid a visit to\nHeadquarters on May 1 to visit Harry Skornia and\nFrank Schooley.\nTV TECHNICAL TIPS NO. 33\n—Cecil S. Bidlack\nNAEB TV Engineer\nNew arrivals are always news! The NAEB Network\nis proudly displaying a new Ampex 300 Magnetic\ntape recorder which arrived May 6. This new equip¬\nment will permit a thorough overhaul of our present\nAmpex machines, in constant service since March,\n1953 and gives us a feeling of security in that we now\nhave a spare.\nNew monitoring loudspeakers, too, have been\npurchased which will provide better reproduction and\npermit a better check on the quality of our output.\nA complete revamping of the inter rack wiring and\njack field is underway to provide more flexibility, and\nease of testing and checking characteristics.\nFor those of you who are familiar with Head¬\nquarters geography, the “back room” (18c Gregory\nHall) has been rearranged and Network Manager\nBob Underwood has moved his office there. With\nthe exception of Traffic Manager Peggy Enderby, the\nnetwork is now a compact working unit in one room.\nWe’d like to rearrange the “front” office to provide\nmore privacy and increased efficiency, but so far no\none has come up with a better floor plan.\n*****\nThe 81st Semi-annual Convention of the Society\nof Motion Picture and TV Engineers was held in\nWashington, April 29 to May 3. Twenty-three of the\n103 papers programmed were on TV subjects.\nOne of the highlights of this meeting was a visit\nto the Closed Circuit Color TV installation at the\nWalter Reed Army Medical Center, where its fine\nfacilities were described and demonstrated. The\nspeakers presented their talks over the TV system to\nthose in attendance in two auditoriums, and were\nviewed in full color, projected on 4 x 6 foot screens.\nAn SMPTE Committee on Closed Circuit TV has\nbeen proposed, and 38 attended an explanatory meet¬\ning to discuss the proposal. A small “ad hoc” com¬\nmittee is to be appointed to further consider this pro¬\nposal, which will review the discussion, draft a pro¬\nposed official scope of interest and an initial proposal\nof work to be undertaken.\n*****\nThe 27th Institute for Education by Radio-TV\nwas held in Columbus May 8-11. Due to the high\ninterest in teaching by TV, the equipment exhibited\nwas perhaps the largest display ever to be seen at\nthis annual meeting. Beginning at the east end of the\nmezzanine of the Deshler-Hilton, Jerrold Electronics\nexhibited their distribution equipment, Dage dis¬\nplayed their two lines of vidicon equipment and\nNEWSLETTER"
}