{
  "id": "d980-13",
  "text": "February 2h, 19%\nMiss Joan B. Anderson\nBox %6\nState Teacher’s College\nWest Chester, Pennsylvaria\nBear Miss Anderson:\nTour card of February 19, addressed to the Chicago Board of Education regarding\ninformation on educational recordings, has been referred to me*\nTt appears that you raif^bt be interested in an active membership in the Association\nfor Education by Radio-Television. Founded sixteen years ago, AERT is a non-profit\norganization, national in scope, which includes among its members teachers and admin¬\nistrators on all-levels of education, commercial broadcasters, religious broadcasters,\ncivic leaders, parents, and representatives of many leading civic groups.\nFrom the information contained on your card, it appears that you would be par¬\nticularly interested in the Journal of the Association for Education by Radio-Tele¬\nvision. This magazine is published monthly during the academic year. It contains\narticles on the utilization and evaluation of both educational radio and educational\ntelevision materials. Specifically, articles in the Journal cover a diverse number\nof topics including areas of communication theory, practical program and promotional\nideas, helpful how-to-do-it and how-to-find-it suggestions, as well as reports on\nlistener council and other evaluation activities.\nYou will be interested to know that the Association for Education by Radio-\nTelevision serves as one of the sponsors of the rational Tape Recording Catalogue\nand Re-recording Service, a project set up in cooperation with the Department of\nAudio and Visual Instruction of the National Education Association.\nI am enclosing a copy of the AERT membership blank which contains a statement\nof the objectives and advantages of membership in the Association.\nI am sure that you would find that a membership in A^KT would provide you with\nboth services and materials which would be of great use yn your work. By sending in\nyour membership application in the next few weeks, you will be eligible to attend the\nAssociation’s national convention to be held this year on April 17, coincident with\nthe Ohio State Radio and Television Institute in Columbus, Ohio.\nIf I can help you with any further information about AIRT, please let me know.\nSincerely,\nJohn Adams Rourke\nNational Membership Chairman\nAERT\nJARtle"
}