{
  "id": "d980-22",
  "text": "*; • Before The\nFEDERAL COMMUNICATIONS COMMISSION\nWashington 25, D. C.\nDocket No.\nCOMMENT BY THE CONNECTICUT CITIZENS COUNCIL ON EDUCATIONAL\nTELEVISION ON PROPOSALS TO BE SUBMITTED TO THE FEDERAL COM¬\nMUNICATIONS COMMISSION IN RESPONSE TO ITS NOTICE OF PRO¬\nPOSED RULE MAKING, ADOPTED NOVEMBER 10, 1955. ~\n1. Tbe Connecticut Citizens Council for Educational Television takes\nnote of the Commission’s assumption that some of the various proposals to\nhe submitted in response to its invitation may, if adopted, affect in some\nway the educational reservations provided in its Sixth Report and Order,\nand therefore wishes to put on record its firm belief that these reserva¬\ntions form an essential supplement to any broadcasting system based pri¬\nmarily on competitive private enterprise.\n2. If the objectives of the Sixth Report and Order have not yet been\nfully realized, we hold that the cause cannot be traced, directly or in¬\ndirectly, to the reservation for non-commercial service of the small pro¬\nportion of all television channels, nor are we aware that any such charge\nhas been made. We therefore respectfully submit that there can be no\nvalid reason for revoking or threatening to revoke, or interfering in any\nway, with these reservations.\n3. The Commission stated in section 43 of its Sixth Report.and Order\nthat ’’One of the reasons for having the reservation is that the Commission\nrecognizes that it is of the utmost importance to this nation that a rea¬\nsonable opportunity be afforded educational institutions to use television\nas a non-commercial educational medium, and that at the same time it will\ngenerally take the educational community longer to prepare for the opera¬\ntion of its own television stations than it would for some commercial\nbroadcasters\".\nWe are convinced by experience in Connecticut since the reservations\nwere made that this reason was sufficient in itself for making the reser¬\nvations and that it is just as valid today as it was in April, 1952. In¬\ndeed all experience in Connecticut and other states since that date amply\nconfirms the soundness of the Commission's decision.\n4. Connecticut was one of the first states to begin-making plans to\nuse its educational channels. That we do not yet have any stations on\nthe air only lays emphasis on the fact that much time is required to de¬\nvelop the kind of public understanding of the educational potential of\ntelevision that can lead to the necessary legislative appropriations.\nConnecticut, like many other states, must depend on appropriations by the"
}