{
  "id": "d980-68",
  "text": "March 28, 1#6\nHr. Raymond T. Redwell, Jr.\nInstructor tn Radio-TV\nUniversity of Maryland\nCollege of Arts and Sciences\nCollege Park, Maryland\nDear Mr. Bedwell:\nYour letter of March 16, addressed to Miss Vee Kounas, has been\nreferred to me.\nYte are delighted to hear of your interest in an institutional\nmembership in the Association for Education by Radio-Television.\nThe institutional membership, the fee for which is fifteen\ndollars annually, includes three copies of tha AEHT Journal for each\nof the eight months of the year in which it is published. All of the\nfull-time members of your department are indeed covered in the insti¬\ntutional membership. It is customary to appoint one member of your\nstaff to represent your group. All announcements, literature, and so\non can then be channeled through this one person.\nWe find that, in nary instances, full-time staff members also\nlike to hold individual memberships In the Association. In this way,\nthey are sure to have their own individual copies of the Journal\nand any other literature that may be distributed from time to time.\nThis, of course, is purely a matter of individual preference.\nOur convention this year will be held in the Hall of Mirrors at\nthe Deshier—Hilton Hotel in Columbus, Ohio on April 17. The morning\nsession will be devoted to talks and demons t r at ions on radio, with the\nprimary emphasis on radio drama. The annual luncheon will be held at\nthe I'aramor Restaurant, where the guest speaker will be Edward Stanley,\nmanager of public service programs for the Rational Broadcasting\nCompany. The afternoon session will be devoted to the very timely\ntopic of closed circuit TV. The official convention program will be\nsent out in & few days. I will see that you receive a copy. In the\nevent that you are alia to get to Columbus, please be sure to look me\nup. 1*11 be staying at the Deshler-Hilton.\nA copy of our standard membership blank is enclosed.\nKindest personal regards.\nSincerely,\nJohn Adams Rourke\nRational Membership Chairman\nAEHT"
}