{
  "id": "d980-72",
  "text": "March 28, 19#\nMr. Arnold Wilkes\nStation WBAL\n2610 Worth Charles Street\nBaltimore 18, Maryland\nDear Arnold:\nI know you've been up to something •.. because the results of your\nefforts are beginning to come in in the form of new memberships. I was\nat sea for several days, trying to determine the source of a particular\ndittoed membership form that arrived in the office. Finally we received\nanother one with a note attached which made reference to the fact that\nit ... the membership form ... had been received from you. While the\nmailman is not yet arriving with large sacks containing checks for new\nmembers, still the number of people we are signing up is conspicuously\non the increase. And that is good. So our respective hats are off to\nyou for the obvious effort you have already expended on behalf of AERT.\nWould you please take a minute and drop me a note, advising me of\nthe nature of the membership campaign you have been conducting so that\nI, in turn, can pass the details along to the other regional directors?\nAs far as the letter from James R. Young at West Virginia University\nis concerned ... well, I don't know. All I can say is that either they're\npretty short of ready cash, or else they have a well-developed bureaucracy\nthere. Perhaps both.\nArnold, I am toying with the Idea of recommending that the board of\ndirectors take necessary action to split up your southeastern region on\nthe grounds that it's just too much territory for any one person to be\nresponsible for. It seems to me that It might be better to have a aiddle-\nAtlantlc region, encompassing your immediate territory and going as far\ndown as, perhaps, Virginia and West Virginia ... and then, create a new\nregional directorship which would cover the deep Southern states. As I\nsaid, I've been thinking about this, but I would hesitate to make any\nformal proposal without first having the benefit of your thoughts on the\nmatter. Would you please turn it over in your mind and let me know what\nyou think?\nT'm looking forward to seeing you again at the meeting in Columbus.\nSincerely,\nJohn Adams Rourke\nNational Membership Chairman\nAERT"
}