{
  "id": "d980-75",
  "text": "Schooley*s comments on Father Grady*s memorandum on \"conditions\"\nrelating to possible merger/consolidation of interests. In\nsame order:\nU Correct. Additionally, it is Schooley9s hope that an Individual\nmembership can be created for individuals, and leave affiliate\nmembership for organizations. He feels sure this can be done.\n2. Correct*\n3. As stated, correct, but Schooley points out this is only his\npoint of view, based upon rising costs and experiences with\nsimilar orofessional organizational memberships, This is\nsubject to study, even if Schooley feels strongly on the sub¬\nject, and he does.\n4. Correct. Later events, based upon studies and conferences,\nindicate NAEB should proceed to get first four issues out on\nusual schedule, using present format. Steps are being taken\nin this direction.\n5* Correct.\n6. Correct, as events and interests indicate.\n7. Correct. NAEB Board is now willing (although technically\nthis is subject to change in by-laws) that |adlvldual members\n(and at first, technically, this is affiliate) shall elect\ntheir own representative to the Board. Generally, NAEB Board\nmembers prefer some such rather than a vice-presidency. At\npresent NAEB has only one vice president. This, too, can be\nworked out in time. No disagreement on representation, just\non label primarily.\n8® Correct.\n9. Correct.\n10. Schooley assumes one membership if merger takes place.\n11. Correct In part. As Schooley recalls, he suggested retaining\ncorporate structure until merger plans worked out, primarily to\nprotect all interested parties. He did not mean to suggest any\nsuch indefinite period of time, and feels sure NAEB Board would\nnot accept such a point of view. Therefore, so that he may not\nbe misunderstood, he records here that his thoughts were meant\nto cover a period such as through the NAEB convention, 1956,\nassuming at all times that previously agreed to references would\nbe adhered to.\n12. Correct. AERT members always welcome at regioxial and national\nmeetings, and if merger/consolidation takes place we*ll make\nevery effort to get as many as possible to Atlanta in October.\n7-10-56"
}