{
  "id": "d980-82",
  "text": "■2-\nDuring the past year, attempts were made to interest foundations in\nthe support of AERT but little headway was made due to the condition of our\nbudget, the fact that we had no research projects already under way (and\nbecause of our low budget, we couldn't afford to start them), and due to\nour lack of any full-time officers or permanent location (also needing more\nmoney).\nYour Board of Directors meeting in Columbus in April, on learning the\nproblems of AERT's finances, was unanimous in its vote to investigate the\noffer of NAEB for a merger of the two associations. Your President was\ninstructed to appoint a committee to study the possibilities and report to\nthe Board. The President appointed the Executive Committee, consisting of\nthe AERT officers. After several discussions and interchanges of corres¬\npondence with NAEB, the committee voted unanimously in favor of a merger.\nThis vote was completed the early part of September and was then submitted\nin writing to each Member of the Board. The Board voted unanimously in\nfavor of a resolution calling a special meeting of AERT at the time of the\nNAEB Fall meeting in Atlanta. This vote was completed just prior to the\nnotice which you received from the Secretary.\nIllinois Corporation laws (where AERT was incorporated) specify that\nnotice of a meeting called for purposes of a merger must reach the members\nnot earlier than 40 days and not later than 5 days before the date of the\nmeeting. The Board resolution vote was received by our Secretary approxi¬\nmately two weeks before the meeting and she proceeded to advise the membership.\nWe would have preferred more time; we acted just as fast as a recruited office\nforce could work.\nThis situation has called for realism at all times. All of us would\nhave preferred to matintain AERT as a separate organization. But the economic\nfacts of the situation made us face the realities and act for the welfare\nand best interests of the membership. It is a real compliment to AERT that\nits purposes and accomplishments have been recognized by NAEB to the extent\nthat adjustments have been made in that organization's constitution to permit\nthe utilization and evaluation interests to be added.\nThe conditions of the merger provide the following:\n(1) All members of AERT now automatically become individual members\nof NAEB.\n(2) Dues already paid to AERT shall be honored with full credit through\nthe terminal date of their membership (or subscription) period.\n(3) The JOURNAL will be continued.\n(4) The utilization and evaluation day (known as AERT Day) will be\ncontinued and expanded to include a session at the annual IERT\nmeeting in Columbus in the Spring and a session at the time of\nthe annual NAEB meeting in the Fall. (The latter changes location\neach year. The 1957 meeting will be in St. Louis; the 1958 meeting\nin Omaha).\n(5) AERT will be represented on the NAEB Board of Directors, governing\nbody of the association. A ballot is enclosed with this letter for\nyour vote for the representative on the Board. By mutual agreement\nbetween NAEB and AERT, the officers of AERT are the candidates for\nthe representative during 1957-*58. You may vote for any one of the\nfive. -"
}