{
  "id": "d1104-2",
  "text": "-2-\nWe also wanted to mention too that Issue No, 5 of the Engineering News¬\nletter was ready for mimeographing before we left. If your Chief Engineer\nand members of your technical staff do not receive this, we hope you’ll for¬\nward us their names for our mailing list.\n*****\nAttention; Radio Station Technical Personnell The NAEB Engineering Comr-\nmittee is planning a Seminar for Technical Personnel who are charged with the\noperation and maintenance of technical equipment at the smaller educational AM\nand FM stations. This is primarily for the permanent technical staff members\nof the small stations with the expectation of covering the problems encountered\nin the operation and maintenance of their studio, transmitting and recording\nequipment. Soon we will forward a questionnaire and application blank to all\nmember stations, We hope you will get this information back to us in time for\nthe Engineering Committee to use it in setting up the program of the Seminar\nat its meeting, April 15 and 16.\nIt is expected that this proposed seminar will receive NAEB Board approval\nand that sufficient funds will be available to pay all travel and living\nexpenses of those attending. This should be a fine experience for those\nselected to attend. It will enable them to get acquainted with other NAEB\nengineers, and we hope it will provide the solution to many of their technical\nproblems as well as improve the quality of their transmitted signal.\n******\nNow for a brief run down on the trip mentioned in our opening paragraph.\nWe left Champaign-Urbana Sunday morning, March 11, arriving in Columbus that\nevening for the NAEB Consultation Team Visit (see story on page 2) at WOStt-TV\nMarch 12, 13, and 14. After the visit, we left Columbus Wednesday afternoon\nonly a few minutes late for a flight to Boston via Cleveland. We mention\nonly slightly late since Armand Hunter’s and Ed Stasheff’s plane to Detroit\nand East Lansing was four hours late leaving Miami. We were delayed an hour\n(leaving Cleveland) and then almost made up most of this time en route to\nBoston thanks to a 90 m.p.h. tail wind.\nWe spent Thursday (15) and Friday (16) at Boston University, with Dr. Leo\nMartin, Jim Bonney, Ted Nelson and Milan Barnes going over plans for their\nproposed radio and television studios. We also visited the building where\nthe proposed studios are to be located, covering the entire building from roof\nto basement in an endeavor to determine the most advantageous location which\ncould be adapted for radio and television.\nWe were there to experience first hand the ’’Blizzard of 1956” which so\neffectively tied things up in Boston and New England. However we managed by"
}