{
  "id": "d788-12",
  "text": "February 4, 1954\nHr. G. If. Griffith©\nFund to Mult Eduction\n914 East Groen Street\nPasadena l* California\nDear Mr. Griffithst\nAs already diseased with 3m infosmoll^ by telephone, several of the\ncandidates for the position as HAEB Television Engineer have bean uo*\nable or unwilling to accept the position on a single yoar*s basis.\nThis is therefore to formalise the request of the national Association\nof Edumtional Broadcasters for funds to assure candidates that the\ntenure of this position would Justify their moving to Ufbaca^ha^paigaf\nwith the problems of housing, children*® education,and other personal\nconsiderations, which are often of the greatest i^pcartanoo to tho best\ncandidates. It is our hope that funds ma& bo allocated in time to\nassure candidates of a minium tenure of two calendar years, while\nseveral good candidates are still interested.\nSince wo understand that $30,000.00 have been approved for the first\nyear, this therefore formalises our request to an additional $30,000.00\nto a second year9® estimated expenses, as follows 1\nEngineers salary (up to a mscdj&iia of) $15,000.00\nOther expenses (including travel, secretarial\nand supplies and expenses) mJJLOB^SSL\nTCm HEt#E33ED FOR SECOID 2BAR $30,000.00\nAt sosoe» time in the future we should also liZsc to hold basic discussions\nwith you on the possibility and practicality of securing consultant funds\nto be used approximately as outlined in our earlier requests, but with\nperhaps a little more leeway so the HAEB might move more rapidly when\ncrises or critical needs develop. Recently, to emople, we were unable\nto provide the prompt help needed by a TV applicant to HAEB membership\nin a staff union relationship problem which is logically and roe: g&tsably\nan NAEB operational area. In may oases prompter action by tho Z1AB8\nwould result in considerable values to cany of tho stations to whidh tho\nFund to Mult Education has already made significant contributicne.\nFinally, aupplcssonting copies of letters already sent you tom various\ncolleges and universities, inquiring about tho possibility of financial\nsupport which will in several caeca b© a datarndning factor os to"
}