{
  "id": "d788-19",
  "text": "February 24* 1954\nHr. G. II. Griffiths\nFund for Adult Education\n914 East Croon street\nftasadena* California\nDear Mr. Griffiths *\nThis letter follows rqy telephone conversation with you today* r®»\ngardlns problems in the selection of the 2IAEB Television Engineer\nfor which the Fund for Adult Education baa allocated funds.\nIf you will recall* at the beginning it wa© expected that this\nengineer should have primary skills in the kinescope recorder\narea. Later* as it became evident that the Center was canto©*\npiffMnfl securing probably the best kinescope engineer in the\nUnited States on a consultant basis for serving what would apparently\nbo the ease stations* but only in kinescope problems* it appeared\nthat for the HASH to select the same type of person would mean waste*\nful duplication. In interviewing the many candidate® for the position\nof NAEB Television Engineer* it has also become apparent that those\nwho would qualify to provide the best operational help and guidance in\ngeneral to the many educational television stations now going or* the\nair* are not equally or eminently qualified in kinescope operations.\nThis question is raised following these many interviews* in an effort\nto gur© that* as far as tho tlAEB is concerned* the enginoering\ntalents available through the JCET* the Cantor* and the IXALB* may be\ncoordinated ***** integrated to tho best advantage. Wo are also w»\nsolved that tho spirit and letter of our request for this engineer\nbe fully observed in good faith* and that request and performance agree.\n\\ie therefore would be grateful for your agreesaent* if you fool it can\nbe given* to cur securing tho boot qualified television engineer avail**\nablo for tho purpose intended, even though ho nay be only generally\nfamiliar with kinescope operations, rather than one equally trained in\nboth kineooopo and general operaticno proooduroo.\nSincerely*\nlUSizne\nOOI IIAEB Officers and Engineering Ccoslttoe"
}