{
  "id": "d788-31",
  "text": "^QOI^QySS\nX. The revised budget was deeiaed essential when a study of expenditures for the first seven\nmonths indicated that original estimates for the year would not be sufficient* The\nvarious reasons for increased expenditures are indicated in the proper footnotes below*\nAfter accurately determining the break-down of expenses for the first seven months, the\nexpenses for the last five months of the year were carefully projected,, based on the\ncurrent expanded operation. It was deeiaed necessary to indicate probaldLe maximum\nexpenditures, but It is hoped that further economy measures (as noted In (13), (14) and\n(16) below) will reduce the final annual expenditures considerably.\nPart of the cause for spending more than expected is the multiplicity of organizations\nrepresenting, or trying to create for themselves the status of representing, educational\ntelevision broadcasters. In the face of the demands for services, and the number of\norganizations well-financed and eager to take over these services from NAEB, the NAEB\nhas had to over-extend itself without delay, considering this a lesser evil than losing\nits status. The past nine months and the next eighteen months are and will be the\ncritical period in this regard, and the NAEB must be prepared to take owr the providing\nof essential services now provided in whole or in part by ether, temporal*; organizations.\nA large part of the anticipated deficit can be attributed ta the big deasEiid for new\ntape which had to be resolved immediately and which couldn* t be postponed if network\noperation was to be maintained at the present level. Approximately $7,00C was expended\nfor tape in the first seven months, and, while it will help greatly, the $3,000 ear¬\nmarked for tape in the additional grant will only partly alleviate the situatien.\nIt should be pointed out that Radio Station WILL and the Division of Communications at\nthe University of Illinois have been doing everything within their power to help the\nNAEB avoid additional expense. Frank Schooley, Manager of VILL, has turned over\nadditional office space to the NAEB, oM WILL is buying approximately $1000 worth of\nshelving for the NAEB tape network to use for badly needed tape storage anc filing space.\nIn addition to this,member stations are trying to help the over-all situation by donating\ntapes to the network. This, of course, is in addition to tb? payment of their network\nassessment fees.\n2. Includes Workman* s Compensation and Retirement payments fen all salaried employees.\nPart of the increase in salaries and wages is due to the large labor turn-over at NAEB\n(terminal leaves, over-lapping of old and new employees, so that procedures can be\nproperly learned, etc.) It is generally accepted in business that a large turn-over\nin labor force Increases costs. The NAEB is faced with the same problem that faces all\neducational institutions in the matter of not being able to compete with private business\nin the matter of salaries and wages.\n3® Includes $2,950.33 salary (including above-mentioned payments for Associate Director for\nfour and one-half months (February 15 - Juno), leaving 12,049A? carried over to next\nfiscal year, at $7,368.88 rate ($7,200.00 salary; $560*88 retirement; $108.00 Workman0 s\nCompensation). Some personnel was also added to handle the approximately SG% increase in\nHeadquarters and Network duplication, shipping and corresponded*^ load as compared to\nlast year."
}