{
  "id": "d788-4",
  "text": "b. s Bob Hudson (Cantor) - 4 man appointed from KAEB\n2. Radio_Metvork. (Aosgpjanflftl-SsPjj>i$Asg8 ®ASB only\nma only\n3. Advisory Committee-.to. tha. President.of the Canter (5 BAEB nan)\nIt was proposed further that an informal basis of exchange of information be¬\ntween the NAEB and the Center on questions of fund raising and the development of new\nprojects be worked cut on a cooperative basis, with the RAEB to retain full independ**\nence and the rights to pursue its own objectives* and to fulfill its own network ob-\nligations and services.\nIn connection with the problem of upgrading, it was decided to continue the\nsystem of workshops and seminars, to establish a central pool of information on\npersonnel for placement, to develop and establish scholarships, and to set up a\ntraveling unit of special experts to visit member stations and work with station\npersonnel, Wynn was appointed to draft a statement and design for the achievement\nof the plan for upgrading, to be submitted to the Board for approval and for in¬\nclusion in the general statement of basic and long range purposes and objectives.\nDiscussion of the Encyclopedia Brittanies Films proposal, to act as exclusive\nsales representative for Albums of Recordings made of HAEB program® pr<.: . ed under\nFAE grants, as reported by George Profest. Riecard moved that the exclusivity clause\nbe removed * Seconded, Hiller moved to table the entire proposal * Seconded and\ncarried. 4 to 3, Schooley moved re-peonsideration of the motion to table, Motion\nlost 4 to 3, It was then moved that Miller be appointed to investigate the proposal\nfurther, to confirm the facts, and check the exclusivity condition, and report to\nthe Board on his findings. The motion was seconded and carried.\nDiscussion of the DAFI Propose! concerning the dubbing and distribution of\nRAEB tape network programs for audio visual departments and centers at cost? It was\nmoved that Skomin be authorised to explore the possibility of this agreement with\nDAT1 on a national baeio and the distribution of th?f tapes through visual centers"
}