{
  "id": "d788-8",
  "text": "January 26, 1954\nI\nto. G. H. Griffiths\nFund for Adult Education\n914 East Green Street\nPasadena 1, California\nDear Billt\nIt was good to talk to you. We*11 look forward to seeing you soon.\ncall was prompted partly by some jurisdictional problems in Station\nUnion Relations and other areas for which, we have requests for funds\nout, but in which others, with money in hand, seem to be moving into\nthe vacuum left by our delay in getting these funds, even though the\narea seems to be recognized as ours.\nHope soon to settle the problem of •which engineer* to get. I wonder\nwhat would be a safe starting date to quote? I shall soon be preparing a\nrequest for extension of these engineerfs services for at least one more\nyear. Several engineers have declined because we could not guarantee any\ndefinite tenure. Do you suppose we could be rela^,', sure of two years,\nat least? Or could this be considered a request for such an nnd<yr«t,flndi ng?\nWe also shall probably be requesting same funds at least on a more general\nbasis, for use as needed for consultation services to member stations. The\ntoo specific earmarking of various funds has several times prevented our\ngetting into a crisis area soon enough to be of real help, iiould a service\ncharge (returnable to FAE) for the Engineer, after the first year, seem to\nmake sense to you?\nWe had a nice meeting at Ames. Looking forward now to long-range piang for\nmuch mutual working together with you for common goals. Also feel that a\nrecent meeting I had with Harry Ifewburn, just preceding the Board Meeting,\nresulted in much improvement of mutual understanding end cooperation, so\none*s strength may be also the other*s.\nWe are most grateful for approval of funds for Engineer, and look forward\nmost eagerly to the Board*s reaction to our various other proposals. Most\npressing are Labor Consultant and (Summer School) Scholarship requests at\nthe moment.\nAll our best.\nHJS:ms\nHarry J. Skoraia\nExecutive Director"
}