{
  "id": "d788-87",
  "text": "KAEB Headquarters\n14 Gregory Hall\nUrbana, Illinois\nTOs\nFECMs\nSUBJECTS\nDATES\nNAEB Board\nHarry J0 Skomia^\nQuartarly fiscal reports Kellogg Project\nJanuary 25, 1955\nHerewith the second quarterly (and therefore semi-annual) Kellogg Project\nreport for fiscal year 1954H55, as prepared by Harold Hill.\nLest we at first glance appear unduly wealthy, Harold lists several, items\nstill outstanding 2\nExpenses of Region XV Meeting\nBeCo Mailing Charges (usually billed on time)\nNew recording heads for Ampex\nTelephone bills (installation and service\ncharges)\nNovember and December Travel unpaid\n$l,100oQ0\n349«75\n180,00\n200o00\n110,00\n$l7939TY5\nHe also callb attention to the fact that income will be $5,000.00 -\n$6^000.00 less than budgeted, \"partly because of the change we have\nmade in the method of handling re-imbursable services and partly because\nassessment fees will bring in about $1,500,00 less than anticipated.\nAll of this simply means that the budget picture, while good, isn't as\nrosy as balances unexpended would seem to indicate.\nuThere are several items that will go in the red, probably by the amount\nestimated below2\nHq. - Office Supplies and Expenses\nNet. - Equipment and Repairs\nOffice(r) Travel\n# 250c00\n600,00\n1,500,00\n$2,350o00*f\nThese can probably be off-set by the $1,G00C00 contingency item and savings\nin other areas.\nYet to be billed also are Schooley and Skomia trips to New York, January\n18-20 (for meetings with representatives of the ACE-TV Committee, JCET,\nNCCET, ETRC and Foundations) as well as upcoming trips to either Washington\nor New York for the same purpose a Upcoming also are at least two more\ncommittee meetings plus partial expenses for other committee?at Columbus in\nApril, and at least one more Regional Meeting (beyond the Ames meeting, not\nyet billed)o\nI think we are in good shape provided we don®t over extend present planso\nIf any of you have questions, we\"11 be glad to try to answer them. We\ndo want this all to be clear, understandable and correct.\n37"
}