{
  "id": "d788-93",
  "text": "COPY\nFUND FOR ADULT EDUCATION\nlhhb Wentworth Avenue\nPasadena £, California\nFebruary 9, 19#\nMr. Frank E. Schooley\nPresident, National Association\nof Educational Broadcasters\nUniversity of Illinois\nIk Gregory Hall\nUrbana, Illinois\nDear Mr. Schooley:\nIt is my pleasure to inform you, on behalf of our Board of Directors, that The Fund\nfor Adult Education has approved a grant of $7#00 to the National Association of\nEducational Broadcasters to make possible an experimental program of consultation\nto educational television stations during the period approximately April 1, 19# -\nSeptember 30, 19#.\nOur Board understands that the consultation will be directed to the improvement of\nprogram development and production on the part of local educational television\nstations. The Board understands further that the plan calls for intensive training\nsessions of three to four days each at selected institutions under the direction\nof visiting teams of persons of outstanding ability in such specialized fields as\nprogram planning, direction, production technique, staging, technical handling,\nand the like.\nFees for consultation plus travel expenses are expected to average approximately\n$1200 per consultation team per three-to-four day visit. Accordingly, the $7#00\nprovided under the grant is expected to cover approximately six such visits plus\n$300 for evaluation and reporting at the conclusion of this experimental program.\nIt is requested that this report on the experience with this plan and its effective¬\nness be made either at the end of six such visits or as soon as possible following\nSeptember 30, 19#.\nAs a provision of the grant it is understood that the National Association of\nEducational Broadcasters will conduct the experiment in close collaboration with\nthe Educational Television and Radio Center. It is understood also that so far as\nis practicable the program will focus on those situations most likely to be of\nearly benefit to program development for national exchange.\nThe fund would like to receive a brief report on each visit of the team, as well as\nthe comprehensive report on the total experience as soon as possible following\nSeptember 30, 19#. An audited financial statement by the same date will also be\nappreciated. Any amount remaining in the grant as of September 30, 19# should be\nreturned to the Fund."
}