{
  "id": "d788-97",
  "text": "MINUTES, NAEB REGION II MEETING\nATLANTA, APRIL 1-2, 1955\nRegion II, membership of NAEB, met in Atlanta* April 1-2,\nin the WABE studios, City Hallo\nPresent were? Haskell Boyter. Atlantal Vernon Bronson, Miami*\nPaul Carpenter, Jr*, Atlanta* Ken Christiansen, Southern Regional\nEducation Board, Atlanta* Roy Flynn, Tallahassee| A1 Gaines,\nAtlanta* Margaret Killan, Atlanta* Lillian Lee, Atlanta* Ken\nWright, Knoxville* Earl Wynn, Chapel Hill* John Young, Chapel\nHill, and Frank SehooXey, President of NAEB,\nEarl Wynn, Director Region II, served as Chairman0\nThe tentative agenda for the meeting was approved» ’The morning\nsession was given over to a discussion of ”NAEB Members Look At\nthe National Organization and at Themselves”«\nThere t*as general agreement among the participants that a policy\nstatement of the national organisation should emphasis®§\n10 that educational broadcasters are first of all educators.\n20 that educational radio and television have the same\nauthority and same responsibility as the institution\nwhich they representa\nFurther, such a statement should by implied or explicit purpose\nencourage any Institution which broadcasts to become NAEB members0\nSuch a policy statement also should b© designed to position radio\nand television as broadcast media ©f equal potential and respon¬\nsibility* There was a feeling among some of the members that the\nbreech between radio and television was reaching dangerous pro-\nportions* Therefore^ the national organization ought not to close\nIts eyes to this problem*\nThe policy statement of NAEB should honestly interpret NAEB9b re¬\npresentation of the low power station* Recognition was made of\nthe feelings expressed by the High Point and Greensboro operations\nthrough Mr* Young, namely that NAEB doesn«t concern Itself enough\nwith the problems'of the 10 watter*\nA subcommittee, Bronson (Chairman), Gaines, KiXIan, and Christiansen,\nwere appointed t© do a redraft of the NAEB policy statement0\nThe afternoon meeting was concerned with programming* Without con¬\nsidering mechanics of distribution, consideration and discussion was\nmade of what programs now being produced are exportable and could be\nused by other stations in the region* The program offerings of the\nseveral stations were reviewed with this matter of exportability In\nmlnd0"
}