{
  "id": "d788-99",
  "text": "the program send a brief announcement to all member\nstations in Region II as soon as the program is set\nfor broadeast? giving program information^ length of\nprogram3 nature of event* personality involved and like\ninformation^ Those stations wishing to carry the pro¬\ngram would then send a blank tape to the originating\nstation which in turn would record the program or pro—\ngramsa Recommendation was approved 9\n2a The Regional director was asked to secure from each member\nstation in the Region a list of programs considered exportable*\nincluding titles and full description This information would\nb© compiled in the regional office and mad© available to all\nmember stations in the Region,, Requests for any of these\nprograms **ould be made to the originating station as follows?\na) request for audition program* blank tap© included!\nb) if audition approved* request for series* blank\ntapes includedo\nThe regional director would take the responsibility of\nkeeping the list of available programs up-to-date0 Re-\ncommendation was approvedB ™\nPrank Schooley offered services of the National Office in drawing\nup a clearance for broadcast form which could be used to secure\nthe release and broadcast permission*\nYoung* Bronsons Moved that director of Region II encourage all\nregion membership to support as individuals* by writing Congress-*\nmen urging passage of Senate Bill 1292 re postal regulations for\nsending tapes* pointing out the particular interest this would\nhave for Region II because of distance from NAEB headquarters*\nMotion passed*\nBronson*Youngt Moved that the ©lection of Regional directors\nshould be by mail ballot of region membership and constitution\nchanges necessary to effect this be initiated« Motion carried*\nBronson* Flynns Moved that this meeting go on record to extend\na vote of thanks and appreciation to Haskell Boyter and the staff\nof MABE and to Kenneth Christiansen and the Southern Regional Edu¬\ncation Board for hospitality* cooperation* and services performed\nin the conduct of the meeting* Motion carried*\nChristiansen* Wright: Moved that Region II express appreciation\nto NAEB headquarters and particularly President Frank Schooley for\nhis attendance at this meeting and encourage similar participation\nin future meetings of Region II.\nThe matter of future meetings was discussed« It was generally agreed\nthat an annual meeting would be helpful and a decision for annual\nmeetings was infernally made*"
}