{
  "id": "d1253-0",
  "text": "Volume V Number 11 July 22, 19&k\nFCC MOVES ON UHF ALLOCATIONS\nBy a Third Report and Order in Docket 14229, the Commission adopted UHF channel\nassignments for ten markets. Seven of the ten involve educational reservations. In\nBoston, Channel 44* has been reserved; Channel 59* transferred from Kannapolis, North\nCarolina, to Concord and reserved; Channel 25* substituted for Channel l6 at Ft. layers,\nFlorida, and reserved; Huntsville, Alabama, shifted educational reservation from Channel\n44 to Channel 25*; Idnville, North Carolina, assigned Channel l8* as an educational\nreservation; Tampa-St. Petersburg, Florida, Channel l6* assigned and reserved for\neducational use; Qraak-Okanogan, Washington, Channel 32* to replace Channel 35 as an\neducational reservation. This last modification requires replacement of Channels 49\nand 65* in Ellensburg with Channels 51 and 63*.\nAs part of the same decision, the Commissioners authorized a further study of\nthe overall UHF allocation plan to be made by the Commission staff with the use of\ncomputer calculations. The new deadline for completion of a plan is the end of the year.\nIn a letter to the NAEB calling attention to this action, FCC Chairman Henry\nwrote, \"The substance of your views was presented to the Commission and was carefully\nweighed in arriving at our decision. The Commission also recognized that this was a\nlast opportunity to assure itself that it was establishing a sound allocation framework\nfor the development of educational and commercial UHF in the next decade, and that\nviewed in this light, spending several more months on several analyses was fully\nwarranted...1 appreciate having the benefit of your views and I know I shall want to\ndiscuss these matters with you again when we are further along with our analyses.\"\nOTHER FCC ACTIONS (RADIO AND TELEVISION)\nGranted CP for a new noncommercial educational FM broadcast station to be\noperated on 9O.5 mcs., Channel 213, TPO lOw, to Stephens College, Columbia, Missouri.\nGranted CP for a new noncommercial educational FM broadcast station to be\noperated on 91.7 mcs, Channel 219, TPO 10 w, to Wisconsin State College in Whitewater.\nGranted CP for a new noncommercial educational FM broadcast station to be\noperated on 91.3 mcs, Channel 217, TPO lOw, to School District No. 1 in Buffalo, Missouri.\nGranted CP for a new noncommercial educational FM broadcast station to be\noperated on 88.1 mcs, Channel 201, TPO lOw, to Montana State University in Missoula.\nGranted CP for a new noncommercial educational FM broadcast station to be\noperated on 88.5 mcs, Channel 203, TPO lOw, to the University of Vermont and State\nAgricultural College in Burlington, Vermont.\nGranted CP for a new noncommercial educational FM broadcast station to be\noperated on 89.1 mcs, Channel 206, TPO .01 kw. with amendment to change frequency to\n88.5 mcs, Channel 203, for Community High School District #233, Flossmoor, Illinois.\nGranted CP for a new noncommercial educational television station on Channel 39-\nERP: Vis. 465 KW and Aur. 91.9 KW, unlimited hours, AH 969 feet, to Lehigh Valley\nEducational Television Corporation, Allentown, Pennsylvania."
}