{
  "id": "d160-16",
  "text": "MEMO\nTo NAEB Board, of Directors, and staff\nFrom: Frank E^ Schooley, Chairman, Publications Committee\nRe: NAEB Publications\nThe memo is written after a meeting of the publications Committee.\nIt is not suggested that this memo represents a unanimous decision\nin a formal way, but rather the reasoned conclusions of the chairman\nafter the meeting.\nThis is a vacuum.... there is no present publication that fills the\nneeds of education with special emphasis on the uses of radio and\ntelevision for educational purposes, either formal or informal, or\nboth. There is no one publication that now serves the needs such as\na popular R-TV educational journal.\nIf changes are to be made, and made by NAEB, then the following\nelements should be considered:\nPossible publication needs:\na. NAEB NEWS LETTER. This publication should be published weekly,\nsemi-monthly, or monthly, depending uoon the ability of NAEB\nto finance. It should be the present NAEB Newsletter and the\nWashington Report combined into one. Basically, its pages\nshould be limited to four for most issues. It should be\noriented to the highlights of R-TV news, with emphasis on\nstation operations, government functions, government, and\nassociation relations. It should be limited to these general\nareas.\nIt should be published anddistributed primarily for the and to\nthe station operated membership. Consideration might well be\ngiven to a limited distribution, such as to active instutional\nmembers. It's contents should all be objective reporting fef\nfacts.\nIt might well be reproduced with offset printing, based upon\ntypewritten copy if this method^ is \"he most effcient and\neconomical.\nb. (l) The NAEB QUARTERLY, or (2) The EDUCATIONAL BROADCASTING\nQUARTERLY, or (3) The EDUCATIONAL RADIO-TELEVISION\nquartelyy\nI lean toward the EDUCATIONAL RADIO-TELEVISION QUARTERLY\nbecause it carries a^signficance beyond NAEB, it is not\nlimited to the HbroadcastinJ1 uses of radio and television.\nIt*s contents should be of the scholarly types, with contents\nprimarily limited to research reports, studies, and unanswered\nproblems and needs of education in the use of the media.\nc. (1) The NAEB JOURNAL, or (2.) The Educational BABI^TELEVISION\nJOURNAL, pubished by UAEB. I lean toward the latter title\nbecause of the broader implications as earlier indicated.\nThis might be the \"popular\" magazine in the field reporting"
}