{
  "id": "d160-22",
  "text": "MSB HB&WARTERS\n1346 Connecticut Avenue, H.W.\nT&shington 6, D.C*\ni«DBMDUH\nTO: MSB Board of Directors\nFROM: Harold E. Hill\nDATE: June 3, 1962\nrIhe luncheon period on the first day of our convention this fall has been set aside for\nthe directors to meet -with their constituents. (You will recall that we are trying a new\nformat this year whereby the Board will meet on Sunday, ahead of the convention, hut Trill\nonly discuss, and not vote on, issues which they would like to take up with their members.\nThen the Board will meet again on Thursday, the day following the convention, to dispose\nof such matters.)\nThe period from 12:15 to 2:45 is available to you to hold your meetings (which will be, •\nin effect. Regional business meetings), and you may include luncheon or not, as you deem\nadvisable. You may prefer to let your people eat \"on their own\" and not start your meet¬\ning until, say, 1:00 p.m., or you may wish to have a luncheon meeting. We have reserved\nmeeting rooms at the hotel for your use in this regard, and, if you decide to hold a luncheon\nmeeting, we will arrange with the hotel to serve the same luncheon to all of the groups\ndesiring it*\nWe presume that the Radio and TV Director of each region will confer to work out details\nof their own meeting. In addition, if Christiansen and weld would like to hoia a separate\nmeeting for Associate members, and Skoraia would like to hold a separate meeting for Indivi¬\ndual members, space can be provided for that, too. However, the latter three may decide\nthat it would be preferable to have the Associates and/or Individual members meet with\ntheir respective regions, or not at all.\n33ie Directors will be responsible for notifying their constituents and for planning their\nown meetings. However, if you would like for notices to be sent out from the mailing center\nin Urbaca, we will be happy to do this fox'* you if you will send the copy to the UTbana\noffice. And, as indicated, if you want to have a luncheon, we will make the food arrange¬\nments with the hotel.\nIn order for the staff to plan properly, there is certain information We will need fairly\nsoon. Therefore, will you please let m know not later than July 1 whether or not you want\nto include a luncheon (each member to pay for his own meal, of course) arid you best estimate\nas to how many you might expect at the meeting. Veld, Christiansen and Skomia should let\nme know whether or not they want to hold meetings and, if so, the same information about\nluncheon and number expected.\nThen, not later than September 1, I will need a firm figure as to how many you will expect.\nThis may be merely a more educated estimate if you do not plan a meal, but needs to be\nfairly accurate if you do intend to have the luncheon because we will have to tell the\nhotel how many meals to plan on.\nEEE(/mIm"
}