{
  "id": "d160-8",
  "text": "Agenda Item 4^d\nNAEB BOARD OF DIRECTORS\nMeeting of April 29 0 19 61\nColumbus i Ohio\nStaff Person for Washington Network teamaffiyaa.\nDuring the past several monthsn Len Press (on sabbatical leave from his\nposition as Director of Broadcasting, University of Kentucky) has worked\nfor the NAEB “quarterbacking5* the NAEB Network programming (Washington\nReport and Washington Specials) coming out of Washington.\nThis is one of the vital services offered by the NAEB to its member stations\nand should be continued 0 It is anticipated that we will continue to attempt\nto get temporary90 people for this job - either someone on sabbatical (as with\nPress),, or someone who may be in Washington on other business for a period\nof several months and can devote approximately half of his time to NAEB\nprogramming 0\nThis will require funds and is one of the factors contributing to the fact that\nthe Network will operate at a deficit in the coming year0 However* it is felt\nthat this sort of service needs only “seed53 financing to become established\ntnd will in a year or so have either attracted outside support or proved its\n\\\\Vue to such an extent as tc allow for an increase in rates (if this should become\nnecessary) inorder to underwrite the cost. However, this single item cannot\nlogically be isolated from the general expansion program now underway in both\nthe h twork and the Headquarters, but is merely an example of expanded\nservic\\s* already instituted and contemplated, which we are striving to provide*\nThese expanded services will lead to a natural growth, both in numbers and\nfinancial soundness, and will contribute to the future health and welfare of\nthe Association*,\nRocommendVdon\nIt is recommended that the Board approve the employment of a staff person\n(probably on a part-time basis) to provide Network programming from Washington\nand the funds (as indicated in the budget - Agenda Item #12) necessary for\nMs enploymenlo Appropriation also includes funds to pay program talent,\nprogram costs of a miscellaneous nature, mailing, etc."
}