{
  "id": "d122-125",
  "text": "ITFS Listings\nAs compiled by the NAEB\nITFS Systems\nWhat it is: Instructional Television-Fixed Service (ITFS), a\nspecial band of television channels reserved for the\nexclusive use of educational institutions, was first\nestablished by the Federal Communications Commission in\n1963 to respond to the needs of instructional television for\nmulti-channel transmission capability at costs considerably\nlower than conventional VHF or UHF television. ITFS\noperates at frequencies higher than those used by\n\"standard\" television. For this reason special antennas and\nconverters must be installed on each building which is to\nreceive ITFS. This equipment converts the transmission to\nsignals which can be received by ordinary television\nreceivers. When viewed in the classroom, ITFS looks like\nany other kind of television.\nAdvantages to the educator: ITFS offers an opportunity for\nlow-cost multiple-channel television distribution. Each ITFS\nlicensee may utilize up to four channels in the ITFS band,\nthus permitting the simultaneous transmission and\nreception of four different programs. Also available in the\nITFS band is a special group of radio frequencies that may be\nutilized for audio or data response to the television\nprogram. This permits live interchange between teacher\nand student, and offers the possibility of computer-\nmanaged television instruction as well.\nThe cost of ITFS transmitters and transmitting antennas is\nconsiderably less than that of standard television broad¬\ncasting equipment. Aone-channel ITFStransmitter-antenna\npackage may currently be purchased and installed for\n$40,000 or less, depending upon local conditions. By\ncontrast, cost for a one-channel VHF or UHF transmitter\ninstallation presently run between $750,000 and $1,000,000.\nA third advantage is that ITFS is presently restricted to\ninstructional uses. Thus, a school systems, college, or\ncommunity educational association has a ready-made,\nreserved place in the telecommunications spectrum for its\nexclusive use.\nPresent utilization: In March, 1977, there were 376 ITFS\nchannels reported in operation in the United States. These\nchannels were operated by 89 different institutions holding\na total of 186 ITFS licenses. At the same time, the FCC had\ngranted construction permits for 13 additional ITFS systems,\nand was processing applications for eight more.\nA survey conducted by the NAEB in the spring of 1975\ncompiled data from 68 of the 83 institutions holding\nlicenses. They reported reaching an audience of 1,750,000\nstudents during the 1974-75 scholl year, with each system\naveraging 4,360 hours of programming. Public and\nparochial elementary, junior high, and senior high school\nstudents comprised 92% of the viewing audience. Other\nsignificant groups using the service included medical\nprofessionals, business and industry executives, and\nengineers and scientists enrolled in continuing professional\neducation courses. Over half of the systems reported that\nthey transmitted their programming in color.\nRecent developments: The FCC is currently considering\nthree proposed rulemakings relating to ITFS:\n1. RM 2603, if adopted, would permit ITFS systems to\nutilize non-broadcast technical standards in certain\nproduction and transmission equipment. This would\nhave the effect of lowering still further the capital\nexpenditures necessary to construct new ITFS facilities,\nor to re-equip existing ones.\n2. RM 2609, if adopted, would permit CATV systems to\nreceive and re-transmit ITFS signals on their cable. This\nwould relieve cable-equipped schools and other recep¬\ntion points of the expense of acquiring and installing\nreceiving antennas and convertors.\n3. RM 2213, if adopted, would permit certain ITFS channels\nto be re-allocated to Multipoint Distribution Service, a\ncommon carrier regulated by the FCC. MDS is presently\nused to pay television programming to hotels and\napartment buildings. Reallocating ITFS channels to MDS\nwould have the effect of limiting the availability ot ITFS\ndelivery systems to educational institutions in many\nmajor metropolitan areas.\nOther news of interest to ITFS users comes from the U.S.\nOffice of Education’s Educational Broadcasting Facilities\nProgram, which is now permitted to allocate some of its\nfunding to non-broadcast services such as ITFS. Funding\nlevels, however, are expected to be low.\nITFS and the NAEB: The NAEB closely monitors ITFS\ndevelopment both in the field and in Washington, and\ncooperates with other national agencies in legislative and\nregulatory efforts that will preserve and foster this\nimportant area of instructional technology.\nRepresentatives from ITFS systems have formed an\ninterest group within the NAEB, and hold special meetings\nat each NAEB convention. A six-person steering committee\nelected by the field coordinates ITFS activities and concerns\nwith designated NAEB staff. Members of the ITFS Steering\nCommittee are:\nDon MacCullough (Chairman)\nDirector of Media Programs\nDade County Public Schools\n1410 N.E. Second Avenue\nMiami, FL 33137\nKenneth Down\nDirector, Stanford ITV Network\nStanford University\n401 Durand Building\nStanford, CA 94305\nElmer Friman, Director\nMedical Educational Resources\nProgram\nIndiana University School\nof Medicine\nIndianapolis, IN 96206\nJohn Hill\nITV Specialist\nKLVX-TV\nLas Vegas, NV 89120\nFrances Forde Plude\nDirector of Development\nCatholic Television Network\n23 Catherine Street\nBoston, MA 02131\nRobert Suchy\nDirector of Instructional\nResources\nMilwaukee Public Schools\nDrawer 10K\nMilwaukee, Wl 52308\n124"
}