{
  "id": "d122-80",
  "text": "If you think\nfree sponsored films\nare half-hour\ncommercials,\nthink again.\nFree-loan, sponsored films are public interest films. Corporate, non-profit or\ngovernment organizations sponsor their production and distribution to educate,\ninform, entertain. Think about films such as:\nI OWE IT TO THE SONGS I SING—60 min. color. The\nUnited Negro College Fund, founded in 1944 gives\ndeserving students an educational opportunity they\nmight otherwise have missed. Through the fund¬\nraising tours of the Fisk Jubilee Singers, Fisk University\nin Tennessee does its part as a member of the United\nNegro College Fund. Enjoy the music of this fine\ninstitution—from the melodious choir to the kettle\ndrums and brass of the University Orchestra.\n#31535 CARNATION COMPANY\nDON’T CUT US OFF—16 min. color. This film is a\ndocumentary of the Community Energy Action\nProgram which assists low income groups and older\npeople in solving their energy problems. “Don’t Cut Us\nOff” examines the way Trenton, Santa Fe, Seattle and\nJacksonville are instituting “winterization” programs,\nexperimental produce greenhouses to supplement low\nincome food budgets, and other ideas that\ncommunities use to make life more comfortable for the\nelderly, poor and disadvantaged.\n#31482 FEDERAL ENERGY ADMINISTRATION\nTHE WOMAN’S GAME-28 min. color. Filmed in\nlocations spanning the U.S., this sensitive and topical\nfilm is of interest to men and women of all ages and all\nlevels of education. A fourth-grade class and their\nteacher and five women talk about new educational\nopportunities for women. The discussion ranges from\nhigh school athletics to training for non-traditional\noccupations to non sex-biased teaching materials.\n#31451 U.S. OFFICE OF EDUCATION\nAMERICA—ITS ALL THE DIFFERENCE—26 min.\ncolor. America has always been a refuge for the world’s\nrisk-takers. The adventurers. The people who were a\nlittle—or a lot—different. That difference is the subject\nof this film. Poles, Chinese, Italians, Indians; the film\nexplores the wide range of backgrounds that have\ncontributed to our key strength: the free exchange of\nideas. The kind of ideas that make a country great. The\nkind of ideas that make America so different.\n#31403 JCPENNEY\nWOMEN IN BALLOONING—5 min. color. This film\ntakes a magnificent look at one of the sport’s most able\npractitioners, Nikki Caplan. Nikki, an analytical\nchemist, mother of three, and enthusiastic balloonist,\ndiscusses what it’s like to be a woman in a high-thrill\nsport. And as she talks, viewers will be shown a\npanorama of lush landscapes that can be seen only\nfrom the vantage point of a balloon.\n#31569 HANES HOSIERY, INC.\nTHE USE OF ELECTRICITY AROUND WATER—2%\nmin. color. This newshort demonstrates howelectricity\nand water can become dangerous...dangerous enough\nto injure or even kill a person. Forthe important thing is\nthat the electrical energy never comes into contact with\nthe water when the product is used in accordance with\nthe manufacturer’s instructions. The film gives\nexcellent advice to viewers on what and what not to do\nin certain circumstances...advice that could save lives.\n#31507 UNDERWRITERS’ LABORATORIES, INC.\nAnd over 500 more programs. Programs that can stand alone as free features. Or free\nITV programs, free fillers.\nModern TV offers more titles, more selections and more free information than any\nother sponsored film distributor. We have the best sponsored films...films that tell a\nstory, not plug a product. Films that will make your viewers think...and think again.\nFor more information, write or call the Modern TV office nearest you.\nAloilrrn TV\nATLANTA, Ga. 30336\n4705-F Bakers Ferry Rd.\n(404) 696-2026\nBob Cole, TV Mgr.\nCHICAGO, ILL.\n1687 Elmhurst Rd.\nElk Grove Village, III. 60007\n(312) 593-3256\nArlene Clemente, TV Mgr.\nCINCINNATI, Ohio 45202\n9 Garfield Place\n(513) 421-4896\nCurtis Hensley, Mgr.\nMary Ciambarella, TV Bkr.\nDALLAS, Tex. 75207\n1411 Slocum St.\n(214) 742-4109\nLeland Kinkade, Mgr.\nNEW HYDE PARK, N.Y. 11040\n2323 New Hyde Park Road\n(516) 437-6300\nPeter Glick, TV Mgr.\nSAN FRANCISCO, Cal. 94105\n149 New Montgomery St.\n(415) 543-1666\nHenry C. Henn, TV Mgr."
}