{
  "id": "d1440-1",
  "text": "BOX SCORE\nTotal TV Stations — 535 (includes 22 non-commercial)\nTotal AM Stations — 3014 (includes 37 non-commercial)\nTotal FM Stations — 652 (includes 125 non-commercial)\nwere aware of their existence. In many communities\nthe number of fine programs — news, drama, music,\ninformation and discussion — will often exceed the\namount of time that even the most avid serious\nlistener or viewer can devote to them.\nIn those fortunate areas which have educational\nstations, the total amount of good broadcasting will\nbe enormous. Yet I often encounter people who are\nunaware of the riches offered by Minneapolis and\nSt. Paul stations, despite the outstanding job of Twin\nCities’ newspapers and stations in promoting good\nbroadcasts.\nAll of us know some educational adminstrators\nwho fully appreciate the potentialities of broadcast¬\ning for education. Yet several researchers who re¬\ncently traveled about the country studying ETV\nhave told me about meeting many university, col¬\nlege and public school administrators whose know¬\nledge of broadcasting was amazingly small, and\nwhose opinion of it was low. If the men who set edu¬\ncational policies have only slight understanding of\nradio and TV, the departments in their institutions\nwhich do broadcasting will probably be limited both\nin scope and budget.\nOne of NAEB’s most important assignments,\ntherefore, is that of selling all intellectual leaders,\nespecially educational administrators on the social\npotentialities and educational values of broadcasting.\nWe have made a good start. Our conventions, reg¬\nional meetings, seminars and workshops have broad¬\nened educational outlooks and improved' performance\nskills. Whenever possible we have included in such\nmeetings key administrators, some of whom become\nardent advocates of our cause.\nAs an organization we have come a long way\nsince the deservedly praised Allerton House Con¬\nference of 1949. But much remains to be done, not\nonly by bur officers, committees, and headquarters\nstaff, but also by our individual members. Every\ntime one of us increases his professional stature, he\nadds something to the status of broadcasting. Every\ntime a good program is broadcast, something is done\nto improve serious broadcasting.\nAbove all, every time our administrative sup¬\neriors are able to identify us as spokesmen for all\nof the educational services provided by their insti¬\ntutions through radio and TV, rather than just as\nrepresentatives of narrow technical and professional\ninterests, the cause of educational broadcasting\nmoves forward.\nMEMO FROM THE EXECUTIVE DIRECTOR\n—Harry Skornia\nThe past month could best be described as relatively\nuneventful. Some periods are like that - their fruits\nbeing apparent only much later.\nThe most interesting personal experience I had\nwas a trip to Regina and Saskatoon, Saskatchewan,\nCanada, to address a provincial conference on TV and\nAdult Education. The weather was cold but the re¬\nception and welcome were most warm. So was the\npace: an hour-long “keynote” address, a TV ap¬\npearance, and several talks to the conference, the\nTeachers College, student body and others.\nI was greatly impressed by the sincere interest\nand enthusiasm of all associated with the conference,\nas well as the representatives of the CBC and local\ncommercial stations, who were in attendance and con¬\ntributed greatly to its success.\nFollowing the announcement of committees by\nPresident Burton Paulu, various committees are hard\nat work on projects you’ll be hearing about as they\nprogress. I believe credit belongs to those who do,\nand, therefore, I do not propose to steal their thunder\nat this time.\nIt can be said that a great deal of consideration\nwas given by the Professional Advancement Com¬\nmittee at its recent meeting to the development of\nprofessional attitudes and standards for broadcasters.\nYou’ll be hearing more on this as the appointed sub¬\ncommittee begins to bring in recommendations.\nWe were also pleased, during the month, to see\ntwo new publications: The Journal of Broadcasting,\na quarterly publication of the Association for Pro¬\nfessional Broadcasting Education (published at USC,\nLos Angeles 7); and Schools for Tomorrow, by Dr.\nAlexander J. Stoddard, published by the Fund for the\nAdvancement of Education. Both deserve your at¬\ntention.\nThe former is of value for its data on legal, pro¬\ngramming and other areas in broadcasting generally,\nas related to education rather than educational sta¬\ntions. The second is the most powerful salvo we have\nyet heard on behalf of ETV as a logical instrument to\ncontribute economically and soundly to the solution\nof current and impending school and enrollment pro¬\nblems.\nSeveral NAEB reports and publications are “in\nthe works” at the moment. We hope this year will be\none of our best as far as useful services to members\nare concerned.\nFinally, thanks to the many of you who took\ntime to comment on the new Newsletter format.\nWe’re always grateful for your reactions - as well as\nstories and pictures we can use.\nNEWSLETTER"
}