{
  "id": "d1440-19",
  "text": "81844\nFEDERAL COMMUNICATIONS COMISSION PUBLIC NOTICE\nWashington 25, D. C.\nApril 2k, 19k5\nThe Federal Communications Commission today announced that the\nclear channel hearing (Docket No. 67^1) scheduled to open May 9, 19^5*\nhas Been postponed until Wednesday, September 5> 19^5* 10:30 a.m.\nThe Commission is of the opinion that it is Important that prepara¬\ntion for the clear channel hearing be thorough and complete so that the\ndecision can be made upon the basis of a comprehensive record. It Is\napparent after conferences with interested persons that this type of pre¬\nsentation cannot be ready in time for May 9* Hence, a postponement at\nthis time is necessary.\nSubstantial preparatory work has already begun in connection with\nthe hearing. Three engineering committees have been established for the\npurpose of preparaing comprehensive reports on the basic underlying data\nnecessary for the hearing. These committees are composed of representatives\nof the Commission and other interested persons. These committees are:\nCommittee 1 - Determination of what constitutes a\nsatisfactory signal.\nCommittee 2 - Determination of what constitutes objection¬\nable interference.\nCommittee 3 - Determination of distances to which and areas\nover which various signal strengths are\ndelivered.\nIt is expected that these committees will continue their work during\nthe summer and be ready to report well in advance of the September 5th\nhearing. It is expected that after reports are ready, they will be made\navailable to interested persons in advance of the hearing.\nA fourth committee consisting of Commission personnel and other inter¬\nested persons has also been established. This committee is concerned with the\nproblem of conducting a survey of listeners. The desirability of such a survey\nhas been urged upon the Commission by many interested persons. It has been\nstated that the Commission rather than the industry is best equipped to conduct\nBtich a survey. Full cooperation, however, has been offered by members of the\nindustry. Preliminary meetings have already been held by the Commission with\nrepresentatives of other government agencies who would cooperate'with the Com¬\nmission in making such a survey. It is hoped the results of this survey will\nbe ready for the opening of the hearing on September 5th.\nIn addition to the foregoing committees, the Commission has also set up\nstaffrCommittees to prepare material on all the issues covered by the proceed¬\ning. It is expected that members of the Industry will likewise proceed dili¬\ngently in the preparation of their material. The Commission’s staff is avail¬\nable at all times for conferences or assistance in connection with this pro¬\nceeding. Arrangements for such conferences should be made through the Com¬\nmission’s General Counsel or Chief Engineer.\n- FCC-"
}