{
  "id": "d1440-20",
  "text": "IMPLICATIONS, FOR EDUCATIONAL BROADCASTING, OF\nTHi FEDERAL COMMUNICATIONS COMMISSION'S \"CLEAR CHANNEL\" HEARINGS\n-o-\nOn May 9, 1945, the Federal Communications Commission will begin\nhearings in DOCKET 6741 to determine what changes, if any, ought to be\nmade in its present policies relative to what is known as ’’clear chan¬\nnels\"* Since these hearings concern \"clear channels\" in the Standard\n(i.e.- Amplitude-Modulation) Broadcast Band,' they will, of course, be\nof relatively little interest to public school systems, colleges and\nuniversities, and State departments of education which are planning to\ndevelop stations to operate in the 20-channel band which the Commission\nproposed to allocate for Educational FM Broadcasting. The hearings\nwill, however, be of interest to schools and universities which are now\noperating educational stations in the Standard Broadcast Band, and to\nthe listeners who look regularly to these stations for educational\nprograili series of various kinds. To the following ten educationally-\nowned stations which operate on clear-channel frequencies, the nearingjs\nare likely to to© of immediate and vital importance;\nWNAD - University of Oklahoma\nWOI — Iowa State College\nKUOM - University of Minnesota\nWCAL - St. Olaf College\nWEW — St. Louis University\nWOSU - Ohio State University\nWRUF - University of Florida\nWEAR - Michigan State College\n* WHCU - Cornell University\n* ML — uoyola University\n(** a Commercial operation)\nStations WNAD (University of Oklahoma) and WOI (Iowa State College)\nare two of three Class II stations licensed to operate on the 640-kilo¬\ncycle channel assigned to Station KFI, a 50,000-watt cIea r-c harm el station\nin Los Angeles. During daytime hours, these Class II stations cause no\ninterference with respect to reception of KFI1s broadcasts, because they\nare of relatively low power (WNAD - 1 KWj WOI - 5 KW). Bpiore sunpise\nand after sunset, however, the situation is much different. Conditions\nin the \"ionosphere\" (electrified layers high above the earth) during^ night¬\ntime hours are such that radio waves transmitted at irequencies of the\nStandard Broadcast Band are reflected back down to the earth’s surface at\ndistances far beyond a station's normal service area. Consequently, in\norder to make sure that Stations WNAD and WOI will not interfere with re¬\nception of Station KFI13 broadcasts during early morning and evening hours,\nthese two stations' are permitted, according to present FCC regulations, to\noperate ONLY during the hours between local sunrise and local sunset 1\nSeven others of the educational stations listed above are similarly\nsituated. Stations KUOM, WCAL, and WEW are three of gour Class II stations\nlicensed to operate during daytime hours, with limited power, on the 770-\nk.ilocycle clear-channel frequency assigned to the two 50,000-watt Class IB\nstations WJS and KOB. Station WOSU (Ohio State University) is one of two\n5,000-watt daytime stations licensed to operate on the okO-kiloeycle clear-\nchannel frequency of Stations WFAA and WbaP. Station wRUF (University ox\nFlorida) is one of five stations licensed to operate on tne tyO-nilocycle\nclear-channel frequency of Station KOA. Stations ••'KA.R anc. ,„wQU are. yw£\nof three stations licensed to operate on the &70-kilocycle frequency of an\neducationally-owned clear-channel station — Station WWL° itn the exoupu-\nion of Station WVJL (which operates full time), each of tnose stations is\npermitted to operate only during the daytime hours between local sunrise\nand local sunset at the place where the clear-channel station is locatedl"
}