{
  "id": "d1440-22",
  "text": "-(3)-\nHo-ever, if an East-Coast clear-channel station were operating on the same\nfrequency, these two educational stations might be required to go off the\nair at the time of local sunset in the Eastern Time Zone, thereby shorten¬\ning their daily broadcast time by three hoursl\nOn the other hand, a decision to permit more than one full-time\nstation to operate on each clear-channel frequency might make it possible\nfor at least some of the Class II educational stations which now operate\nonly during daytime hours to become full-time \"duplicated clear-channel^\nstations. In this connection, it is interesting to note that Issue No. 9,\nDOCKET 6741, involves a consideration of —\n\"whether and to what extent the clear-channel stations\nrender a program service particularly suited to the\nneeds of listeners in rural areas.\"\nIt was fairly obvious, in the case of Station WOI, that its formerly-\noffered early-morning program was uniquely suited to the needs of rural\nlisteners. Hence, if service to rural listeners should be made one of\nthe guiding principles in licensing stations for clear-channel operation,\nit would appear that Iowa State College should be able to make a convinc¬\ning case for full-time operation. Altogether, six of the educational\nstations operating on clear-channel frequencies are owned and operated\nby state universities. Each of them, therefore, is in a position to play\na leading role in the university's agricultural extension program, and,\nin consequence, might be in a position legitimately to qualify for con¬\nsideration for full-time operation. •\nFrom the foregoing discussion, it appears that certain of the issues\nto be considered in the Commission's forthcoming hearings offer opportuni¬\nties for educational broadcast stations operating on clear channels to\nimprove their positions. It appears, also, that some oi the alternative\ncourses of action that might be taken with respect to certain of these\nissues might operate definitely to the disadvantage of these stations.\nIt would be difficult to suggest any uniform course of procedure to\nthe educational institutions those Droaclcast stations are likely to be af¬\nfected by the outcomes of these hearings, since no two oi the stations are\nlikely to be affected in exactly the same way by any given decision. ^ It\nmight be in order, however, to suggest that the management of each oi these\nstations take appropriate s.teps to place on record, with the Federal Com¬\nmunications Commission, a clear statement of its station's needs as they\nrelate to established or potential services to listeners.\n-o-\nR. R. Loadermilk\nEducational Radio Service\nU.S. OFFICE OF EDUCATION\nPrepared as an information service\nto Educational Broadcasters,\nApril 23, 1945."
}