{
  "id": "d1440-23",
  "text": "‘S'toadcaat StfuifeMient Pnionctcf 'Piatt\nA SERVICE FOR BROADCASTERS WHO\nWISH TO PLAN FOR THE FUTURE\nRCA’s Broadcast Equipment Priority Plan is designed to help broadcasting stations plan\ntheir future apparatus requirements. By indicating what equipment will be needed, you\nwill enable RCA to plan its production and to make deliveries more nearly in accord¬\nance with your requirements. The plan is simple. No payments are required until a\nformal order is placed. We are offering a list of the most generally used equipment\nfrom which you may make your selection, although we intend to produce, as soon as\npossible, the same complete line of up-to-date broadcasting equipment as we offered\nin the past, including transmitters, microphones, turntables and recorders, test and\nmeasuring equipment, FM and Television equipment.\nHow to Plan Your Equipment Estimate:\nYour engineering and operating department will\nbe familiar with the apparatus you are now using\nand its present condition. You may want to con¬\nsider replacement of older equipment which has\noutlived its usefulness; you may want to consider\nreplacing apparatus which has been repaired\nduring wartime and for which you could obtain\nno new replacement; you may also have plans\nfor future expansion. Your engineering depart¬\nment will know the equipment required to carry\nout these plans. In addition, you may be consider¬\ning the installation of FM or Television equipment\nin order to provide for the new opportunities\nwhich may be expected to exist after the war\nHow the Equipment Priority Plan Works:\nHaving determined your requirements, please\nrefer to the list of apparatus printed on the back\nof this sheet and place a check mark alongside the\nunits you will need and which you intend to pur¬\nchase from us. Then sign the sheet and fill in\nyour address, mailing it to us in the enclosed\nenvelope which requires no postage. When we\nreceive this indication of your requirements we\nwill assign to it a precedence rating based upon\nthe actual postmark date and time of stamping.\nNote that you may send your equipment\nrequirements at any time, but your chances of\nbeing at the top of the priority list will be better\n.if you send this information as soon as possible."
}