{
  "id": "d1440-3",
  "text": "TEACHING BY TV\n► A series of 3 TV lessons in basic English, in¬\ntended primarily for newly arrived Hungarian\nrefugees, is being broadcast over WGBH-TV Boston.\nSponsors say they understand the lessons would make\nthe first use of ETV to acquaint new Hungarian ar¬\nrivals with their second language. They hoped the\ntelecasts might prove useful to high school teachers\nassigned to work with refugee students in nearby\ncommunities.\n► New York’s Deputy Mayor John J. Theobald in¬\nterviewed on WNYC’s “Campus Press Conference”\nsaid that “without question” TV will be used as an\neducational medium in New York schools. He added\nhis belief that TV is “the coming medium for mass\neducation.”\n► Remembering names and faces without a pad\nand pencil to jot them down, is the outcome of a new\n13-week course “Improve Your Memory” that\nstarted February 5 on KQED, San Francisco. Based\non the association method of mnemonics, these “live”\nweekly programs also teach thousands of absent-\nminded viewers how to recall not only their own\nphone number, but as many others as they want.\n► Five institutions and agencies will cooperate\nwith public schools in Alabama in conducting a joint\nproject designed to improve educational opportunities\nin the state through the use of ETV. The project\nwill be financed by a grant of $72,000 to the Uni¬\nversity of Alabama from the Fund' for the Advance¬\nment of Education.\nState groups to cooperate in the project are the\nUniversity of Alabama, Alabama Polytechnic In¬\nstitute, the State Department of Education, the Ala¬\nbama ETV Commission, and the Birmingham ETV\nProduction Center.\n—N A E B—\nFCC ACTIONS\n► President Eisenhower went on record as saying\nhe believes some TV channels should be preserved for\neducational purposes. He made the comment at a\nnews conference when asked about the brewing con¬\ntroversy over reallocation to commercial interests of\nTV channels originally assigned by the FCC for edu¬\ncational use.\nThe President said he had not had a recent study\nof the problem presented to him, “But speaking only\nfrom what I believe to be the eventual good of the\nU. S., and not knowing anything of many more chan¬\nnels being available through improvement of tech¬\nniques and equipment, I would say we must preserve\nchannels for educational purposes.”\n^ The FCC has been barraged with differing\nviews on proposals that ETV Channel 2 at Denton,\nTexas, be reassigned for commercial use. Texas edu¬\ncators have protested the proposal by Gregg TV Inc.,\nLongview, Texas, that Channel 2 be assigned to\nLongview.\nChannel 2 was originally set aside for the Texas\nState College for Women, North Texas State College,\nand the Denton Public School System. Because of\nlack of funds to build and operate a TV station, the\nchannel has not yet been used.\nPUBLICATIONS AVAILABLE\n► A delightful little booklet, Children Turn to\nEducational TV, has been published by the ETRC\nand is available on request from the Center. New\nprograms and old favorites are described, and in¬\nformation is given on where to see these programs.\nFor copies write:\nEducational Television and Radio Center\n1610 Washtenaw Avenue\nAnn Arbor, Michigan\n► A cleverly illustrated, 28-page booklet, Ten\nCheckpoints for Better Booklets, is available for\nwriters and editors of small publications. Price: 1\ncopy — 60c, 2 copies — $1, 3-24 copies — 40c each.\nWrite:\nCouncil of National Organizations of AEA\n303 Lexington Avenue\nNew York 16, New York\n► Schools for Tomorrow: An Educators Blue¬\nprint by Dr. Alexander Stoddard has been published\nby the Fund for the Advancement of Education. This\nis a most important stride for ETV, containing dis¬\ncussion of the teacher shortage and the use of TV\nas an integral part of instruction at all levels. Add¬\nitional copies are available from the Fund for the\nAdvancement of Education, 655 Madison Avenue,\nNew York 21, New York.\n—N A E B—\n► Suppose They’d Never Invented Radio is the\ntitle of an entertainingly informative brochure, the\ntext of an address by Arthur H. Hayes, CBS Radio\nPresident. The address was given last November to\nthe Seminar in Contemporary Broadcasting at Em¬\nerson College Boston. Those interested in obtaining\na copy, write: Charles Dudley, Chairman, Depart¬\nment of Broadcasting, Emerson College, 130 Beacon\nStreet, Boston 16, Massachusetts.\n—N A E B—\n► A nice-looking reprint of the KETC St. Louis\narticle in Broadcast News (January Newsletter,\npage 8) is available from RCA, Commercial Elec¬\ntronic Products, Camden 2, New Jersey. The title of\nthis slick publication is “TV and the Crisis in Edu¬\ncation,” and it contains some excellent photos of\nKETC facilities and personnel. ,\nPage 4\nNEWSLETTER"
}