{
  "id": "d1291-0",
  "text": "N A £ B NEWS LETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL\nA» Jav.es Ebel, Editor, Station WILL,\nJune, I, 1945\nBROADCASTERS\nUrbANA, ILL,\nNAEB MEMBERS PLEASE NOTE\nEnclosed with this issue of the News Letter are several matters of\nIMPORTANT BUSINESS WHICH THE MEMBERS OF THE NAEB SHOULD HANOLE AT ONCE,\nPlease send your replies to the Secretary immediately,\nHIGHLIGHTS OF TH£ FCC ALLOCATION RELEASES\nDuring the past month the FCC has released the allocation proposals for\nFREQUENCIES BELOW 25 MC AND A PARTIAL FINAL ALLOCATION FOR FREQUENCIES\nabove 25 MC. There are many changes involved in the new proposals and\nin the final allocations. Of most interest to the NAEB MEMBERSHIP ARE\nTHE FOLLOWING!\n1. The 540 KC channel has seen added to the Standard Broadcast band.\nThe usage of this channel has not been specified AS YET, BUT BECAUSE OF\nITS PROXIMITY TO THE 500 KC DISTRESS CHANNEL IT IS PR08 ABLE THAT IF HIGH\nPOWER ASSIGNMENTS ARE ALLOWED THEY WILL BE IN THE CENTRAL PART OF THE\nCOUNTRY, IT IS ALSO VERY PROBABLE THAT NO HIGH POWER ASSIGNMENTS WILL BE\nALLOWED ON THE CHANNEL AND IT WILL BE USED TO PROVIDE EXPANSION SPACE FOR\nLOCAL BROADCAST STATIONS,\n2. Six bands have been set aside for direct international broadcasting.\nThis is an attempt to provide sufficient channels for the transmission\nOF PROGRAMS ON A WORLD WIDE BASIS, A GREAT DEAL OF INTERNATIONAL\nCOOPERATION WILL BE NECESSARY TO PREVENT INTERFERENCE ON THESE BANDS\nSINCE IT IS ALMOST NECESSARY THAT EACH CHANNEL USED BE A CLEAR CHANNEL\nON A WORLD WIDE SCALE.\n3. The 1.7 MC amateur band has been deleted. In its place there are\nADDITIONAL BANDS BEING MADE AVAILABLE AT THE HIGHER FREQUENCIES. ThIS\nIS IMPORTANT TO BROADCASTERS SINCE MUCH OF THE INTERFERENCE TO BROADCAST\nRECEPTION CAME FROM OPERATION IN THIS BAND. (YOUR EDITOR IS A HAM WHO\nOPERATED IN THIS BAND UP TO THE START OF THE WAR, YET 1 THINK THE MOVE IS\nIN THE BEST INTERESTS OF ALL CONCERNED.)\n4. Three alternative proposals have been made in the issuance of the\nFINAL ALLOCATIONS FOR FREQUENCIES ABOVE 25 WC. The FM ALLOCATIONS UNDER\nTHESE PROPOSALS WILL BE AS FOLLOWS,\nCommercial Band\n54 - 68 MC\n72 - 86 MC\n88 -102 MC\nThe television channels unoer the three alternatives are shuffled in\nFREQUENCY RANGE BETWEEN 50 AND 104 MC TO TAKE UP CHANNELS NOT ASSIGNED\nto FM ano Facsimile, the latter occupying the 2 MC just below the\nEducational Band.\nAlTERNATIVE\n1\n2\n3\nEducational Band\n50 - 54 MC\n68 - 72 MC\n84 - 88 MC"
}