{
  "id": "d371-27",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nDuPont Circle Office Building\n1346 Connecticut Avenue, N. W.\nWashington 6, D. C.\nOFFICE OF THE VICE PRESIDENT\nMay 16, 1961\nDr. Samuel L. Becker, Director\nDivision of Television, Radio, Film\nState University of Iowa\nIowa City, Iowa\nDear Sam:\nThis summer the NAEB will conduct a seminar at Madison, \"Wisconsin, which has\nbeen rather aptly described by someone as “Allerton - 12 Years Later”.\nThis seminar, which will bring together the NAEB Board of Directors and certain\ncommittee chairmen and members, will be devoted to a searching self-analysis.\nIn general, those attending will examine carefully the role now being played by\nthe NAEB in light of what it should be doing, what it is best equipped to do, what\nthe future should hold, etc. This will be examined in the context of the entire\neducational broadcasting movement and the NAEB’s place therein.\nThe above is a very sketchy resume of what the planning committee has in mind,\nand more detailed information will be sent to you within two or three weeks.\nHowever, it is important at this time to find out whether or not you will be able\nto attend.\nThe seminar will be held July 16 - 19. Participants will arrive Sunday afternoon,\nthe 16th. Morning and afternoon sessions will be held on Monday, Tuesday,\nand Wednesday and the seminar will close about 5:00 p.m. on Wednesday the\n19th As has been the case with past seminars, it is anticipated that most parti¬\ncipants will want to stay over on Wednesday night and depart on Thursday morning.\nThere will be no formal evening sessions, thus giving participants time for in¬\nformal sessions and discussions.\nThe NAEB will pay your living expenses (room and board) while you are at the\nseminar and rooms will be provided in University of Wisconsin housing, with\nmeals being eaten in the dining room. In addition, the NAEB will reimburse you\nfor transportation according to the following table:"
}