{
  "id": "d371-35",
  "text": "September 11, 1961\nMr. William G. Harley\nNAEB\nDuPont Circle Office Bldg.\n1346 Connecticut Ave., N.W.\nWashington 6, D. C.\nDear Bill:\nPlease excuse the delay in responding to your letter and the\nbrevity of this response. 1 just returned to town to find your letter\nhere — along with a large pile of other business to attend to. I am\ntrying to do all of this hastily because I will only be in town for\ntwo days before leaving for another week to teach at an ICA seminar\nin Michigan.\nI believe that your idea is a fine one. It seems to me that\nthis is something which the NAEB could do quite readily, if it got the\nright person in as director in Washington. It ought to be someone who\nhas had survey experience, not merely any sort of research experience.\nA prime candidate is Harrison Summers at Ohio State who has been doing\nsurveys for many years. He is due for retirement there before too long\nand might jump at the chance to do something of this sort. Forest Whan\nat Kansas State has also had a great deal of experience at this sort of\nthing. In the yearly statewide radio and television surveys which he\nran for many years in Iowa and Kansas and elsewhere he used student inter¬\nviewers and faculty supervisors in each area. The only problem with Forest\nis that he would come rather high salary-wise I would guess. However, you\nmight get more takers since he has quite a reputation among commercial\nbroadcasters. I would think that interview schedules and other procedures\ncould be standardized so that the project would not be too dependent upon\nregional research directors, not all of whom would nave had great experi¬\nence at survey work.\nI would guess that your budget is far too low, unless the $30,000\ndoes not include the cost of any of the surveys. You will find that you\nwill need to pay both your local supervisors and the student interviewers.\nOtherwise, it is almost impossible to get dependable work done. (Even\nwhen you pay students for this sort of thing, someone will need to keep\nafter them very carefully. Again, this would be the kind of thing with\nwhich Whan has had much experience. He probably ought to be brought in\nas a consultant in setting it up whether he becomes the director or not.)"
}