{
  "id": "d371-67",
  "text": "As you know, the commercial industry has been under attack from\nboth the public and its representative in Congress and the FCC. The\nlatter body, under Mr, Minow’s leadership, has repeatedly indicated\nthat it has a responsibility and authority to concern itself with\nstations’ programs. As earnest of its intention to do something about\nprogramming, it has indicated that it will be paying increasing atten¬\ntion to discrepancies between program promises and performance when\nit comes to license renewals.\nThe result of this crackdown on station programming is that the\nstation manager at long last is convinced that the FCC means what it\nsays and is going to get tough; hence stations are belatedly becoming\nvery worried about how to beef up the educational content of their\nscheduleso To capitalize on their concern, NAEB has just issued a\nflyer calling to their attention the splendid selection of high quality\neducational programs available from its tape library.\nThe FCC has also indicated that in considering renewals of licenses\nit will pay attention to how well a station has geared its programming\nto meet the needs and interests of the community it serves. They have\nalso indicated that in satisfying this requirement a station is not\ngoing to be able to just \"fly by the seat of its pants\", be guided by\nquestions the director asks at the bar of the local Elks club, or use\nany other quaint divining rods which have gotten them by'in the past.\nIn fact, this means audience surveys.\nWealthy stations in metropolitan areas have means and facilities\nfor carrying out such surveys; stations which happen to be situated in\ncommunities where there are colleges and universities have help at hand.\nBut many stations which do not enjoy such advantages, are not in a posi-\ntion to conduct studies of their audiences, particularly surveys that\nare not suspect.\nIt occurs to me that NAEB, under the aegis of its research com¬\nmittee, might set up in its Washington headquarters a national audience\nsurvey office, which would undertake to conduct surveys for local sta¬\ntions to determine the special requirements and wants of their audiences.\nI can envision something like the following:\n1. A full time national research director, with secretary, and\noffice in Washington.\n2. A group of regional research directors (who might or might not\nbe the members of the present committee) who would organize and super¬\nvise arrangements for surveys within their particular geographical area.\n3. Wherever possible NAEB members and/or people on college and\nuniversity staffs would be engaged for a fee to conduct a survey for a\nstation in their vicinity.\n4. The surveys would be conducted by educators and would use\nstudents to do the interviewing, doorbell-pushing, or whatever.\n5. Although this activity would be undertaken as a service de¬\nsigned to return funds to the Association, it would at the same time\nprovide some productive research opportunities for research people\nthroughout the country."
}