{
  "id": "d371-78",
  "text": "THE UNIVERSITY OF WISCONSIN\nMADISON 6\nSCHOOL OF JOURNALISM RECEIV ) December 12, 1961\nNAEB HEADQUARTERS\nMr# William G# Harley\nPresident, NAEB\nDupont Circle Office Bldg#\n1346 Connecticut Ave., N. W#\nWashington 6, D. C.\nDear Bill:\nITm sorry that I didn!t get my answer to your query via Sam Becker off in time\nfor inclusion in Sair^s recent communication# Since the response is not unani¬\nmous, I think ITd better put in my two centsT worth even now#\nOn the whole, my position is most like that of Kumata. The points I*d like to\nunderscore are these:\n1) There are numerous private groups anxious to serve broadcasters interested\nin getting research data on their audiences. On the whole they can do the job\nmore cheaply and uniformly than we could do it under the aegis of the national\noffice#\n2) Furthermore, they can meet the usual conditions more readily than we can-\nclient control over content of survey, client control of publication, etc.\n3) Many of us cannot meet these conditions at all# The University of Wisconsin\ndoes not permit the use of its name in connection with purely commercial research\nwhen contol of content and publication is not in the hands of the researcher#\nIfm sure we are not alone in this.\n4) It would be all but impossible to guarantee a user uniform quality under the\ncircumstance^ you describe. Such uniformity could probably not be enforced by\nthe proposal* office without making the proposal excessively unattractive.\n5) Many of us are still interested in the dynamics of audiences in relation to\ncontent. But the usual commercial survey rarely adds to our mite of knowledge.\nAnd it is unfortunately true that routine audience surveys tend to justify the\nbroadcaster in not taking risks, not trying something new, not worrying about\ngrave local issues that nevertheless lack the drawing power of Lawrence Welk.\nDoes NAEB want to associate itself with such a business?\nAs usual, I*m hopeful for any way NAEB can help us get significant research done\non broadcasting. But this proposal as it stands does not appear to be the ave¬\nnue we are seeking.\nDEC 14 1961\nAM p\n?lMlW|l,8|l|2|8|4|6|{5\nt\nSincerely,\nBruce H. Westlsy\nAssociate Professor\nBHWrbfta\nCC: Samuel L. Becker"
}