{
  "id": "d1768-12",
  "text": "parts of the program are most effective in developing the thinking of listeners,\nthen \"broadcasters can make immediate use of this information in designing\nfurther series.\nResearch of Particular Value to Teachers\n(1) Teachers must know how much listening their pupils do and what\ntheir pupils listen to if they are to have an adequate picture of the interests\nof those they teach. A breakdown of the amount of listening for children from\ndifferent socio-economic levels will he valuable to many teachers. It might be\nexpected that increased listening goes with decreased opportunity for other\nentertainment. There is however a small amount of evidence tending to show\nthat the same programs are favorites and that the same amount of listening is\ndone by children from upper and from lower income groups. Several studies done\nin different parts of the country have found an average amount of listening of\n2-3 hours per day. Teachers will want to know such facts, especially if con¬\nfirmed for their own students, since they disclose some interests of youngsters\nwhich can probably be used to motivate school work.\nAnother simple but important quantitative aspect of young people’s\nradio preferences is connected with program schedule and program availability.\nThere is but little published research that shows to what extent children’s\nlistening is conditioned by the fact that there are only a few hours in the day\nwhen he has control of the dials. Quite different conclusions about children’s\npreferences may be drawn when the actual listening is reported in terms of what\nprograms are on the air at the times of day for which each child can choose\nwhat he wishes.\n(2) The relative preferences of youngsters for different programs\nseem fairly constant. Studies made in Chicago, St Louis and Zanesville show\nthat \"Gang Busters” and the \"Lux Radio Theatre” lead in popularity over a wide\nrange of ages and for both sexes. This finding, at present a tentative one,\nwill if verified be an important one for teachers. Apparently these programs\ngive the children some satisfactions that are not being supplied by home or\nschool, although research data are lacking concerning the role of the movies,\npulp magazines, comic strips, and some games in satisfying the same needs.\nSeven hundred and fifty-four high school students in Newark were asked\nthe question, \"What are some of the radio programs from which you learn some¬\nthing?\" Thirty-four and two-tenths (34.2) per cent of them gave \"Professor Quiz\n30.5 per cent mentioned \"Gang Busters\"; 17.0 per cent mentioned \"Cavalcade of\nAmerica\"; 13,8 per cent mentioned \"March of Time.\" Nineteen programs received\nfrom ten per cent to one per cent of the votes. This finding is equally un¬\ncomplimentary to teachers and to broadcasters. Apparently the students feel\nthat the accumulation and retention of miscellaneous bits of information is\neducational. Apparently also there is not a large surplus of genuinely edu¬\ncational programs on the air. All the same, this is where the students are, and\nteachers would do well to listen to \"Professor Quiz\" and to \"Gang Busters\" so as\nto know one more thing that their pupils appreciate and think about.\nIt will be important for teachers to know how the listening interests\nof their students change with age, if the listening interests of boys and girls\nare different, and if differing occupational, national and social backgrounds\naffect the radio preferences of young people.\n-7-"
}