{
  "id": "d1768-13",
  "text": "(3) The present content preferences of students do not seem to offer\nany very useful information for teachers. Youngsters listen mostly to enter¬\ntainment programs. Many teachers would like to have them listen to more news,\nmore forums and more educational broadcasts. These facts confront the teacher\nwith a two-fold problem, namely, to help some students acquire the serious\nattitudes needed for listening to serious programs and to study the entertain¬\nment programs in order to get some picture of what the satisfactions are that\nthe youngsters certainly get from them. Psychological studies of the motives\nand satisfactions that young people get from their radio listening are now under\nway. The effects of the ’ crime-serials’ on youthful listeners are being studied\nat the Bureau of Research in Education by Radio at the University of Texas.\nThese will surely provide valuable information for teachers anxious to under¬\nstand their students.\n(4) Teachers must know something about the production-preferences of\ntheir students. It will not do to recommend regular listening to forums to.\nstudents who are interested in and able to pay attention only to dramatizations;\nnor will the boy who uses the radio to provide fantasy material of the Super¬\nman type for himself be likely to learn much from serious science school broad¬\ncasts. Research on production-preferences for students of different ages and\nboth sexes is needed to supply information on these points to teachers.\n(5) Teachers will need to know something about the analytical\npreferences of their students, that is to say, preferences with respect to pro¬\ngram elements such as voices, pace, acting, sound effects, etc. It seems\nprobable that many of these preferences are widely different for young people\nof different ages, but objective findings that would permit rational choices\nand acceptable recommendations of programs to be made on this basis are not yet\navailable.\n(6) Mhny teachers are already interested in trying to influence the\nradio tastes of their students. More insistence or recommendation of programs\nthat teachers consider good, are alike ineffective, but when teachers learn as\nthe result of research of the five types just mentioned what the radio\npreferences of their students actually are, they will be able to recommend some\nprograms that the students can like. In this way will students learn that the\nteachers have their interests at heart and that the teachers understand and\nsympathize with them. It is to be hoped, of course, that as educational pro¬\ngrams are made to fit the interests of youngsters, the youngsters will gradually\nchange their preferences to include more educational programs.\n(7) Many educational programs are designed to initiate or stimulate\ndiscussion, reading and other activities. It will be necessary to do a great\ndeal of research to find out if those programs are actually effective in these\nrespects. Miss Jeanette Sayre's study of \"America’s Town Meeting of the Air\nfound little evidence of this stimulating effect on individual listeners. It\nis very likely that this program, when used by listening groups and by local\ntown meetings, has a much bigger effect. Research on this point is in progress.\nA study done by the Evaluation of School Broadcasts group at Ohio State\nUniversity* with sixth-grade children in the public schools of Cicero, Illinois,\nshowed that the radio could be used to initiate and stimulate a good deal of\n* - Reported in Miles, J R, \"Radio and Elementary Science Teaching,\" Jnl. of\nAp. Psychol. XXIV, 6* Dec. 1940.\n-8-"
}