{
  "id": "d1768-15",
  "text": "Administrative groups such as state supervisory hoards and the Federal\nCommunications Commission will want to know the audience size and distribution\nfor educational programs. Such evidence is clearly one indication of the extent\nto which a station is operating in \"the public interest, convenience and\nnecessity.\"\n(2) Civic groups will want also objective information concerning the\nrelative importance of radio in children’s lives. Do children listen mainly\nwhen they have nothing else to do, or will they forego other amusements for the\nsake of a radio program? Will they come in off the street, will they leave a\nwell organized playground so as to be sure not to miss a particular program?\nWill they neglect their studies for the sake of an interesting broadcast? Does\nthe radio have as great drawing power for those who are scholastically apt as it\nhas for those who find school work difficult?\nIt has been found, almost by accident, that many adults listen to\neducational programs that were produced primarily for children. How large a\ngroup of adults this is, what social and economic levels they come from, what\nsubjects these adults find most interesting, what activities these adults forego\nto listen to these programs, are all unknown, but can be found out by suitable\nlistener research. This information will be usable by civic agencies interested\nin general education, in particular causes, in particular groups of listeners,\nor in producing their own programs.\nInformation on the relative preferences of listeners for educational\nand other programs Is of great importance to administrative groups even if the\ntotal amount of listening to educational programs at present is small, (The\nactual volume of listening In one community is being studied at Ohio State\nUniversity.) The demonstration of a trend showing that this volume of listening\nIs increasing and that more persons are coming to prefer educational programs,\nwould provide objective evidence of the public importance of educational broad¬\ncasts .\n(3) Civic groups interested in young people will need to know how\ntheir listening time is divided as between news, entertainment, quiz programs,\neducational programs, and so on. It may be that they are only objecting to 10\npercent of children’s listening, or that only 10 per cent of the children spend\nmost of their time listening to programs judged to be objectionable. It will be\nImportant to know what children listen most to these programs, and what children\nleast; then the interested groups will know where to focus their energies.\nCivic groups interested in adult education need to know how the\nlistening time of the particular groups they are most interested in is allocated.\nFor example, there is a considerable body of evidence showing that individuals\nof lower education prefer to get their news information from the radio, and that\npersons of more formal education prefer on the whole the newspaper and news¬\nmagazine as a source of news. This finding is of importance to any civic group\nsponsoring or encouraging news programs. Similar divisions of audience\npreferences for the other types of programs may be expected, and these group\npreferences must be known, if the organization interested in radio-education Is\nto reach the groups in the audience that it wants to reach.\n(4) Administrative groups (such as the Federal Radio Education Com¬\nmittee) act as experts functioning for the radio audience in influencing the\n-10-"
}