{
  "id": "d1168-1",
  "text": "NAEB Personnel Service\nPOSITIONS AVAILABLE .... December 1966\n(For information, write Miss Carol A. Whitcomb, Personnel Service,\nat the NAEB in Washington. In order to be considered through these\nchannels, the reader must be an Individual Member of the NAEB, with\ncredentials on file with the NAEB Personnel Service. Non-members can\nsave time by sending the $15 annual dues and $15 placement registra¬\ntion fee at the time of inquiry.)\nENGINEERING: r , _.\nNov 18 Television studio and transmitter engineers for operation, maintenance ot tlv\nsystem in South Pacific. Good living conditions, liberal benefits. Minimum two\nyear assignments.\nNov 19 Chief Engineer for planned video tape production center of large, southern\nregion university. E.E. degree desired, but others considered. Should have\ndesign capability. $9,000+ to start with regular increases. Position open im¬\nmediately.\nNov 29 Engineering Supervisor of CCTV for college in NE. Prime responsibility tor\nmaintenance, also assisting Director generally. Salary range $7,480-$8,200 to\nstart. M.A. required. Open now.\nNov 30 A-V Technician for rapidly-growing college on west coast. 1st class FCC li¬\ncense, technical school training, experience in field required. Will install and\nmaintain all electronic, mechanical equipment relating to Service. Excellent\nopportunity for professional growth. Salary open.\nNov 32 Experienced Studio Engineer with Center for Radio and TV of a midwestern\nstate university. Must be particularly well-qualified in both VTR operation and\nmaintenance. Open immediately. Salary determined by qualifications, mini¬\nmum $7,000. . ..\nNov 35 The following positions with CCTV training facility of large military installa¬\ntion in east: VTR Supervisor, TV Technicians (5), floor manager, cameramen\n(2), crew chief. Good opportunity for professional growth. Detailed job de¬\nscriptions available from Personnel Service.\nNov 37 Television technician to operate, maintain ITV fixed service system of public\nschool district, Great Lakes region. Operational by January, 1967. Require 1st\nclass FCC license, technical school training, experience in field.\nDec 7 Assistant Chief Engineer for university-affiliated CCTV operation in Rocky Mt.\narea. Needed immed. Salary negotiable, but approximately $7,500 to start.\nDec 9 Chief Engineer for state-owned ETV station under construction in NE. Civil\nService position. $10,000+ for well-qualified person.\nPRODUCTION r .. A± . _ . . : 1\nNov 25 ETV Studio Production Coordinator for public school district in Great Lakes\nregion. Primary responsibility for production of both live and video taped\nTV programing on elem. level with future growth into productions on sec.\nlevel. M.A. or near preferred, with TV production background. Wide salary\nrange, dependent on experience. Open now,\nDec I TV Producer-Directors (2) for junior college in south. In-school and evening\nprograming. B.A. plus I, 2 years in field desired. Approximate salary $7,000\nto start. Open immediately.\nDec 3 Producer-Director for community ETV station in metropolitan midwest. Cre¬\native programing, ITV oriented. Degree in field plus I, 2 years experience\nETV Task Force Named\nA task force to examine the possible use\nof educational TV in primary and second¬\nary schools in underdeveloped countries has\nbeen appointed by President Lyndon John¬\nson. The President noted that he has ob¬\nserved the use of ETV in American Samoa\non his receftt Aslan trip and said,' “1 be¬\nlieve that- educational television can play\na vital role in assisting less-developed coun¬\ntries in their educational effort.” The Samoa\nproject was pioneered by NAEB and con¬\ntinues under the association’s sponsorship.\nReview Plans Announced\nPlans for the publication of Educational\nBroadcasting Review, a new bi-monthly\njournal devoted to the presentation and ex¬\nchange of ideas related to educational broad¬\ncasting, have been announced by William G.\nHarley, NAEB president. Ohio State Uni¬\nversity, Columbus, Ohio, has been selected\nas the publication center for the new maga¬\nzine.\nArrangements between the university and\nNAEB specify that Ohio State will supply\nnecessary space and secretarial help for the\npublication. Richard Hull, former NAEB\nboard chairman and director of the Tele¬\ncommunications Center at Ohio State, said\nthe university intends to establish a special\nworking editorial committee to explore the\nexact nature and format of the Review. The\ncommittee includes Dr. William Hall, direc¬\ntor, School of Journalism, Dr. Edgar Dale,\nprofessor, School of Education, Dr. Robert\nWagner, head of the Motion Picture Divi¬\nsion, and Dr. James Lynch of the Depart¬\nment of Speech. Mr. Hull will also serve\non the committee.\nDr. Lynch will serve as Editor in Chief\nuntil a permanent editor is selected.\nThe target date for the first issue of the\nReview is January-February. It will replace\nthe NAEB Journal which has been pub¬\nlished by the association since the Fall of\n1956 at the University of Illinois, Urbana.\nAll Review correspondence should be sent\nto Dr. Lynch, Dept, of Speech, Ohio State\nUniv., Columbus, O. 43221.\nID Conference Set\nThe relationship between instructional\nbroadcasting and industrial producers of\ntelevision equipment and resources will be\nexplored at the fifth Instructional Radio-\nTelevision Conference in New York City,\nApril 18-20. The conference is being spon¬\nsored jointly by the Instructional Division\nof NAEB, the Electronics Industries Asso¬\nciation and the Educational Media Council,\naccording to ID director, Richard H. Bell.\nMatters which will come under study at\nthe meeting include ways to accomplish bet¬\nter industry-ITV liaison, who will be pro¬\nducing the ITV programing of the future\nand how will the need for such materials\nbe identified, distributed and used.\nDr. Bell has announced that attendance\nat the conference will be limited to a dozen\ngroups of not more than 30 each, so that\nall delegates can work together more profit¬\nably.\nHEW Grants\nThe approval of grants totaling $1,640,080\nto the Kentucky State Board of Education,\nand $232,245 to the University of New\nHampshire, Durham, have been announced\nby Paul A. Miller, assistant secretary for\neducation, Department of Health, Education\nand Welfare. Dr. Miller has also announced\nthat KFME, Fargo, N.D., will be expanded\nwith a grant of $176,293. This new grant\nwill increase the number of viewers in\nNorth Dakota and Minnesota by almost\n19,000, including 5,714 students.\nThe grants in Kentucky will help put\nsix new TV stations on the air. They will\nbe part of a proposed 12-station ETV net¬\nwork in that state bringing educational tele¬\nvision to almost three million people includ¬\ning 772,000 students.\nIn New Hampshire, one grant of $133,490\nhas gone to Channel 49 at Littleton. Chan¬\nnel 40 at Berlin was awarded the sum of\n$96,755. State matching funds for both ven¬\ntures will bring the total expenditure to\n$474,490.\nVermont ETV\nGets Underway\nVermont’s educational television system\nhas been launched with the beginning of\nconstruction of transmitter-antennas on four\nof the state’s mountain peaks, according to\nstation manager H. Odell Skinner. It is ex¬\npected that the system will begin telecasts\nnext fall.\nDr. Raymond V. Phillips, dean of the\nsummer session and evening division of\nthe University of Vermont, Burlington, is\noverseeing the development of Vermont\nETV. He reports that construction was\nscheduled to begin in October. Plans for\nprojected public affairs programing have\nreceived a boost with tentative approval of\nan $18,000 grant under Title 1 of the High¬\ner Education Act.\nNAEB Newsletter, a monthly publication is¬\nsued by the National Association of Education¬\nal Broadcasters, $5.00 a year. Editor: Patricia\nK. Moran.\nNAEB Ffeadquarters: 1346 Connecticut Ave.,\nN.W., Washington, D.C., 20036. Phone 667-\n6000. Area Code 202.\n2\nNEWSLETTER"
}