{
  "id": "d891-120",
  "text": "3634) ; KYES, Butte, Mont., to 8-14-48 (BMP-3640) ; KHBO,\nHailo, T. H., to 8-31-48 (BMP-3636) ; WTMA, Charleston,\nS. C., to 4-1-48. (BMP-3635)\nMiscellaneous Actions\nThe Fairfield Broadcasting Co., Waterbury, Conn.—\nGranted petition for leave to amend application for CP\n(BPCT-204; Docket 8624) to combine the interests of peti¬\ntioner and a competing applicant, American-Republican, Inc.,\nWaterbury, Conn. (BPCT-280; Docket 8775), to change ap¬\nplicant’s name to The Nutmeg State Broadcasting Co., and\naccepted said amendment.\nKTRM—KTRM, Inc., Beaumont, Tex.—Granted petition\nfor leave to amend application for modification of license\n(BML-1269; Docket 8534) to specify 1 KW, using DA at\nnight, in lieu of 250 watts; accepted said amendment and\nremoved application from hearing docket.\nInter-City Broadcasting Co., Providence, R. I.—Granted\npetition for leave to amend application for CP to change an¬\ntenna site, antenna height above average terrain, and change\napplication to show technical changes corollary thereto;\naccepted said amendment. (BPH-1301; Docket 8496)\nSanta Rosa Broadcasting Co., Santa Rosa, Calif.—Denied\npetition to change place of hearing on its application (BP-\n5855; Docket 8247) from Washington, D. C., to Santa Rosa,\nCalif.\nWBIR—Radio Station WBIR, Inc., Knoxville, Tenn.—\nGranted license covering installation of new vertical antenna\nand ground system and change in transmitter location. (BL-\n2957)\nKOWH—World Pub. Co., Omaha, Neb.—Granted CP to\ninstall new transmitter and change transmitter location, em¬\nploying the supporting structure of KOAD-FM as the ver¬\ntical antenna. (BP-6578)\nKRDU—Radio Dinuba Co., Dinuba, Calif.—Granted peti¬\ntion for leave to amend application for CP (BP-5691; Docket\n8585) to substitute for applicant partnership a corporation\nknown as “Radio Dinuba Co.” ; accepted said amendment.\nThe Civic Broadcasters, Inc., Cleveland, Ohio—Action on\npetition for leave to enlarge issues in consolidated hearing\non applications of The Civic Broadcasters, Inc., Cleveland,\nOhio; WLEU, Erie, Pa., and WERC, Erie, Pa., was passed\nover at request of counsel for petitioner. (Dockets 8269,\n6913, 8160)\nKSTT—Davenport Broadcasting Co., Inc., Davenport, Iowa\n—Granted petition for leave to amend application for CP\n(BP-5984; Docket 8309) to change its proposed DA and\nsupply technical data corollary thereto; accepted said\namendment.\nCapitol Broadcasting Co., Trenton, N. J., and WSWZ, Inc.,\nTrenton, N. J.—Granted petition for continuance of con¬\nsolidated hearing on applications for CPs (BP-4832, Docket\n8083; BP-5590, Docket 8084); continued hearing to March\n18, 1948.\nThe following actions were taken by Commissioner Walker\nFebruary 26:\nJorama-Fer Radio Corp., Caguas, P. R., and Caguas Radio\nBroadcasting, Inc., Caguas, P. R.—Granted petition for con¬\ntinuance of consolidated hearing on applications for CPs\n(BP-5174, Docket 7998; BP-5475, Docket 7999) ; continued\nhearing to March 22, 1948.\nW7TOM—Fred O. Grimwood, Bloomington, Ind.—Granted\npetition for continuance of hearing on application for modi¬\nfication of CP (BMP-2669; Docket 8451); and continued\nhearing to April 1.\nWANN—Annapolis Broadcasting Corp., Annapolis, Md.—\nGranted CP for installation of a new transmitter. (BP-6591)\nKSJO—Santa Clara Broadcasting Co., San Jose, Calif.—\nGranted license covering installation of DA for night use,\nchange hours of operation to unlimited and increase power\nto 500 watts night, 1 KW-LS. (BL-2895)\nKMYC—Marysville-Yuba City Broadcasters, Inc., Marys¬\nville, Cal.—Granted license covering changes in transmitting\nequipment, installation of new vertical antenna and mount\nFM antenna on top of AM tower. (BL-2947)\nKXLW—St. Louis County Broadcasting Co., Clayton, Mo.—\nGranted license covering installation of new transmitter.\n(BL-2625)\nWMOB—Nunn Broadcasting Corp., Mobile, Ala.—Granted\nlicense to make changes in antenna and mount FM antenna\non top AM tower and change transmitter location. (BL-\n2919)\nKDB—Don Lee Broadcasting System, Santa Barbara, Cal.\n—Granted CP to install a new vertical antenna, and change\ntransmitter and studio locations. (BP-6507)\nWLBZ—Eastland Broadcasting Co., Bangor, Maine—\nGranted modification of license to change name of licensee\ncorporation to Main Broadcasting Co. (BML-1286)\nWPUV—Southwest Broadcasting Corp., Pulaski, Va.—\nGranted CP to install a new transmitter. (BP-6588)\nWAKR—Summit Radio Corp., Akron, Ohio—Granted li¬\ncense covering changes in DA for night use, and changes\nin ground system. (BL-2951)\nKLBM—Inland Radio, Inc., LaGrande, Ore.—Granted CP\nto install a new transmitter. (BP-6590)\nWGLN—Glens Falls Publicity Corp., Glens Falls, N. Y.—\nContinued the consolidated hearing on its application and\nthat of Granite State Broadcasting Co., Inc. (Dockets 8404\nand 8565) scheduled for March 3 to March 22.\nWFCI—Pawtucket Broadcasting Co., Pawtucket, R. I.—\nContinued the hearing scheduled for March 3 to March 8 at\nPawtucket. (Docket 8416)\nMt. Pleasant Broadcasting Co., Mt. Pleasant, Tex.—Con¬\ntinued hearing scheduled for March 4 to March 18 in re\nDocket 8254.\nWTYS—John H. Phipps, Marianna, Fla.—Adopted order\ngranting petition to the extent only that the condition upon\nwhich its CP (BP-5372) was granted is modified to provide\nthat operation of station WTYS shall not commence until\nstation WTAL commences operation on 1270 kc., and in all\nother respects petition is denied.\nThe Midwestern Broadcasting Co., Toledo, Ohio—Action\non petition requesting leave to amend application for CP\n(BP-6421; Docket 8685) was passed over until such time as\nthe amendment is formally filed with the Commission.\nPilgrim Broadcasting Co., Boston, Mass.—Granted petition\nfor leave to amend application for CP (BP-5362; Docket\n8568) to show election of one new oflicer and four new\ndirectors of corporation from among the existing directors;\naccepted said amendment.\nViking Broadcasting Co., Newport, R. I.—Granted petition\nfor leave to amend application for CP (BP-5953; Docket\n8284) to reflect a change in stockholders and officers of cor¬\nporation, to add financial statements of two new stock¬\nholders; accepted said amendment.\nDouglas L. Craddock, Leakesville, N. C.—Granted petition\nfor continuance of hearing on application for modification\nof license (BML-1253; Docket 8427) ; continued hearing to\nApril 2, 1948.\nWJMO—WJMO Broadcasting Co., Cleveland, Ohio—\nGranted petition requesting that WJMO Broadcasting Co.\nbe substituted for W. J. Marshall as a party to the con¬\nsolidated proceeding (Docket 7756 and 8718) ; and accepted\nits appearance filed simultaneously with the petition.\nFairfield County Broadcasting Co., Norwalk, Conn.—\nGranted petition for late acceptance of its written appear¬\nance in proceeding on its application. (BP-6460; Docket\n8717)\nWROK—Rockford Broadcasters, Inc., Rockford, Ill.—\nGranted petition to dismiss without prejudice its application\nfor CP. (BP-5555; Docket 8315)\nWMPS—WMPS, Inc., Memphis, Tenn.—Granted petition\nto dismiss without prejudice its application for modification\nof CP. (BP-2388; Docket 8316)\n(Continued on next page)\nMARCH 8, 1948-190"
}