{
  "id": "d891-123",
  "text": "WPUV—Southwest Broadcasting Corp., Pulaski, Va.—\nAuthority to determine operating power by direct measure¬\nment of antenna power.\nKYNG—Idaho Falls Broadcasting Co., Idaho Falls, Idaho\n^—Modification of construction permit (B5-P-4599, as modi¬\nfied, which authorized a new standard broadcast station)\nfor extension of completion date.\nNEW—John R. Tomek, Wausau, Wis. (P. O., Suite 604,\nFirst American State Bank Bldg.)—Construction permit for\na new standard broadcast station to be operated on 1230\nkc., power of 250 watts and unlimited hours of operation.\n1240 KC.\nWJBY—Gadsden Broadcasting Co., Inc., Gadsden, Ala.—\nAuthority to determine operating power by direct measure¬\nment of antenna power.\n1250 KC.\nNEW—Lamar County Broadcasting Co., Paris, Tex. (a\npartnership composed of Cecil Hardy, Charles L. Cain, Merl\nSaxon, O. E. Smith and J. T. Smith) (P. O. Box 326, DeniSon,\nTex.)—Construction permit for a new standard broadcast\nstation to be operated on 1250 kc., power of 1 KW and day¬\ntime hours of operation.\nWLPO—The LaSalle County Broadcasting Co., LaSalle,\nIll. (F. F. McNaughton and Louis F. Leurig, a partnership)\n—Construction permit to change frequency from 1220 to\n1250 kc., increase power from 250 watts to 500 watts,\nchange hours of operation from daytime to unlimited time,\ninstall new transmitter and directional antenna for day and\nnight use.\nKPAC—Port Arthur College, Port Arthur, Tex.—Modifi¬\ncation of construction permit (B3-P-5125, as modified, which\nauthorized increase in power, install new transmitter and\nchange transmitter location) for extension of completion\ndate.\n1260 KC.\nThe Civic Broadcasters, Inc., Cleveland, Ohio—Construc¬\ntion permit for a new standard broadcast station to be\noperated on 1260 kc., power of 5 KW, directional antenna\nand unlimited hours of operation. AMENDED re change\nin directional antenna patterns.\n1280 KC.\nWMRO—WMRO, Inc., Aurora, Ill.—Construction permit\nto make changes in vertical antenna and change transmitter\nlocation from Highway 31, North Aurora, Ill., to Cross and\nRiver Sts,., Aurora, Ill.\nWKST—WKST, Inc., New Castle, Pa.—Modification of\nconstruction permit (B2-P-5290, as modified, which author¬\nized changes in vertical antenna and to mount FM antenna\non AM tower) for extension of completion date.\nR. G. LeTourneau, Longview, Texas—Construction permit\nfor a new standard broadcast station to be operated on 960\nkc., power of 5 KW and daytime hours of operation.\nAMENDED to change frequency from 960 to 1280 kc., power\nfrom 5 KW to 1 KW, change type transmitter and change\nstudio location from Texas Route 149, 2.8 miles south of\nLongview, near Longview, Texas, to Mobberly at Green St.,\nLeTourneau Technical Institute Campus, Longview, Texas.\nWNAM—Neenah-Menasha Broadcasting Co., Neenah, Wis.\n—License to cover construction permit (BP-6278), which\nauthorized to mount FM antenna on AM tower.\n1296 KC,\nWIRL—Illinois Valley Broadcasting Co., Peoria, Ill. (Ed¬\nward J. Altorfer, John M. Camp, John H. Aitorfer, Katherine\nA. Swain and Timothy W. Swain)—License to cover con¬\nstruction permit (B4-P-3686, as modified) which authorized\na new standard broadcast station and specify studio location\nas 115 N. Jefferson St., Peoria, Ill.\n1346 KC.\nWSOY—Commodore Broadcasting, Inc., Decatur, Ill.—\nConstruction permit to install alternate main transmitter\n(composite) at N. of State Highway #121, .7 mile E. of\nU. S. Highway #51, Decatur, Ill. (present location of main\ntransmitter) tq, be operated on 1340 kc, with power of 250\nwatts and unlimited time.\nKOME—Oil Capital Sales Corp., Tulsa, Okla,—Modifica¬\ntion of construction permit (B3-P-4880, as modified, which\nauthorized a change of frequency, increaseinpower, ,installaT\ntion of new transmitter and directional antenna for day\nand night use and change transmitter location) to make\nchanges in directional antenna, change transmitter loca¬\ntion from 3904 South Newport St., Tulsa, Okla., to approx,\n8.5 miles south-southeast of the city of Tulsa, Okla., and for\nextension of commencement and completion dates.\nKNOG—Border Broadcasting Co., Inc., Nogales, Ariz.—\nModification of construction permit (B5-P-5345, as modified,\nwhich authorized a new standard broadcast station) to\nchange type of transmitter.\nKOWB—Snowy Range Broadcasting Co., Laramie, Wyo.\n(Carrol} S. Mohr, Fred O. Rice, Douglas D. Kahle and\nGeorge D. Humphrey)-^-License to cover construction per¬\nmit (B5-P-5001, as modified) which authorized a new stand¬\nard broadcast station and authority to determine operating\npower by direct measurement of antenna power.\n1386 KC.\nWTSP—Pinellas Broadeasting Co., St. Petersburg, Fla.—\nModification of construction permit (B3-P-3965, as modified,,\nwhich authorized increase in power, install new transmitter\nand directional antenna for night use and change trans¬\nmitter location) for extension of completion date.\n1396 KC.\nKULP—-Wharton County Broadcasting Co., El Campo, Tex.\n(Louis Thurmond Culp* Kruger, Lafayette Lionel Ducket, C.\nCharles Coppage Ingram, J. Edward Johnson and Ross\nBohannon, a partnership)—License to cover construction\npermit (B3-P-5611, as modified) which authorized a new\nstandard broadcast station and change studio location.\nNEW—Neponset Radio Corp., Norwood, Mass. (I\\ (). %\nC. F. Brauneck, 3124 Boylston St., Boston, Mass.)—Con¬\nstruction permit for a new standard broadcast station to be\noperated on 1390 kc., power of 500 watts and daytime hours\nof operation. '\n1406 KC.\nNEW—Biddleford Broadcasting Corp., Biddleford, Maine\n(P. O. % Gordon J. Lewis, 35 Mildred Street, South Portland,\nMaine)^-Construction-permit for a new standard broadcast\nstation to be operated on 1400 kc., power of 250 watts and\nunlimited hours of operation.\nWDOS—Radio Columbia, Columbia, S. C.—License to\ncover construction permit (BP-6475) which authorized to\ninstall new vertical antenna and change transmitter location.\n1416 KC.\nNashville Radio Corp., Nashville, Tenn.—Construction\npermit for a new standard broadcast station to be operated\non 1410 kc., power of 5 KW, with directional antenna (DA-2)\nand unlimited hours of operation. AMENDED to change\ntransmitter location from Hamilton Road and Clarksville\nHwy., Nashville, Tenn,, to Hamilton Rd. near Clarksville\nHwy., near Nashville, Tenn.\n1436 KC.\nNEW—The Gladewater Broadcasting Co., Gladewater,\nTexas (Barnes H. Broiles, Carl B. Everett, John Ben Shep¬\npard, Thomas C. Unis and Henry Wade) (P. O., .1517 Com¬\nmerce St., Dallas, Tex.)—Construction permit for a new\nstandard broadcast station to be operated on 1430 kc., power\nof 1 KW, and daytime hours of operation.\n1446 KC.\nKMED—Mrs. W. J. Virgin, Medford, Ore.—Modification of\nconstruction permit (BP-5968, which authorized to increase\npower, install new transmitter) for extension of completion\ndate.\n(Continued on next page)\nMARCH 8, 1948-193"
}