{
  "id": "d891-137",
  "text": "IOO\nEDUCATION ON THE AIR\nbetterment. This sort of operation can only enhance the pres¬\ntige of broadcasting. At this critical juncture of world affairs\nit is important that the standing and the power of radio be both\nmaintained and expanded in what is one of its most vital char¬\nacteristics} that is, the ability to promote the free flow of com¬\nmunications in that most precious of all fields—ideas,\nREX HOWELL2\nRadio should have an editorial policy, because therein\nlies one of radio’s great opportunities for public service.\nFirst, however, we must decide if radio has the right to\neditorialize. I think the answer to that is also unequivocally in\nthe affirmative. I think we are nearly all generally agreed, that\nanything as fundamentally related to our Constitutional guar¬\nantees of freedom is not rightfully subject to challenge. How¬\never, since there is a small but vocal minority that opposes, in\nprinciple, the basic right of broadcasters to express opinions of\ntheir own, a brief discussion of the legal aspects of “editor¬\nializing” by radio may be in order. First, let me say, I have\nnever personally felt that the present members of the FCC\nhave any objections to radio editorials, properly handled.\nHence what I am about to state should not be construed as\ncharging the Commission with any conscious effort to bar edi¬\ntorials from the air.\nIn 194° the FCC handed down a decision in the so-called\n“Mayflower case.” The decision came after a hearing to deter¬\nmine whether the Mayflower Broadcasting Corporation, a new\napplicant, or Station WAAB, owned by the Yankee Network,\nshould be licensed to use certain time in Boston. The Commis¬\nsion rejected the application of the Mayflower Corporation and\nrenewed the license of WAAB.\nThe important issue in the case turned on WAAB’s prac¬\ntice, earned on from early 1937 through September, 1938, of\nbroadcasting editorials on behalf of various political candidates\nor supporting one side of various controversial issues. The\nCommission granted the renewal of license only after WAAB\nmade “comprehensive and unequivocal representations” that no\neditorials would be broadcast, that the station would have no\neditorial policies, and that no attempt had been or would be\nmade to color or editorialize news.\n2 Station KFXJ, Grand Junction, Col."
}