{
  "id": "d891-154",
  "text": "SOCIAL RESPONSIBILITY OF RADIO II7\nenough time in the 24 hours otherwise. In this connection, I think the\npublic interest very often is much better served by affording separate\ntimes for people to present conflicting views. I don’t want to leave the\nimpression that I think all these questions ought to be aired in the\nform of debate.\nMr. Howell:\nI want to say to Mr. Sayler that broadcasters have no quarrel with\nthe requirement relating to political candidates being accorded equal\naccess to facilities. The question at point is actually whether, under the\ninference that may be drawn from the Mayflower decision, the broad¬\ncasters have an equal opportunity themselves to use their own facilities.\nI would like to ask you a question, Mr. Sayler. At present, the\nUAW-CIO has an application for station facilities on file. In the\noperation of your station, do you propose at any time to editorialize\non labor’s behalf?\nMr. Sayler:\nWe have stated in our application to the FCC that we will follow\nthe principles we espoused in the Columbus WHKC case—we will give\nequal time and fair treatment to all opposing views. I will say, further,\nthat in each city where we have applied we have asked the Chamber of\nCommerce or the Manufacturers’ Association to set up a regular\nweekly program to be heard over our station. We also have addressed\nsimilar offers to the AFL and the CIO.\nChairman Tyler:\nWe will have questions from the floor now, please.\nMr. Burton Paulu:8\nMost of our speakers seem to be in pretty general agreement so\nwhat I have to say is in the nature of a footnote.\nThe average person seems to have more faith in news reports heard\nover the radio than in news read in newspapers. Like all of you, I am\naware of the editorial policies of newspapers—policies which often are\nreflected in the handling of the news columns. Yet, when I listen to\nnews on the radio I am seldom aware of any personal feelings one way\nor another. I am convinced that one of the reasons for the wide prestige\nenjoyed by radio news reports is the fact that listeners have come to\nidentify radio stations as impartial purveyors of news. If radio should\nadopt a policy to editorialize at one point, they might well do so at\nanother point; in other words, in their normal news programs.\nMr. Howell:\nMay I comment on that? I think that editorials never should be\npresented as part of a regular news broadcast. This would be highly\n8 University of Minnesota, Minneapolis."
}