{
  "id": "d891-156",
  "text": "SOCIAL RESPONSIBILITY OF RADIO 119\nCongress should pass a law prohibiting all editorials. I don’t be¬\nlieve that, either.\nMr. Paul W. McGune:11\nIn listening to Mr. Howell, I wonder why couldn’t we have edi¬\ntorial programming that would be more or less in the public service?\nIt would be something for the blind to hear; something for those who\ndo not know how to read.\nMr. Howell:\nI appreciate that view very much. I think in the field of adult edu¬\ncation, radio and the educators have a great challenge and a great com¬\nmon area of agreement. The small items, in which there are honest\ndifferences of opinion, are of little consequence compared to the great\nproblem that lies ahead.\nMr. Sayler:\nThere are two questions I would like to address to the members\nof this panel.\nOne has to do with the matter of the presentation of public issues.\nIn 1941, the FCC made a survey covering a six-months’ period, on\nthe number of stations carrying programs on such subjects as Lend-\nLease, Convoys, Basis for Defense, and the general question of isola¬\ntion or intervention. At the time, these were hot questions. The news¬\npapers were full of them. Out of 844 stations, 388 reported they had\none or more network programs on this general subject. Between 200\nand 300 stations carried not a single program on these issues during\nthe six months’ period.\nMy second question is this: What is a substantial group in a com¬\nmunity to do when the radio station refuses it time on the air to voice\nits views on a controversial issue?\nMr. A. A. Schechter:12\nIn fairness to the local stations, I will answer part of the first one.\nMr. Sayler overlooks the fact that practically every radio station has\nfrom four to eight news broadcasts a day. While stations may have\nno debate on certain subjects, they carry volumes of news broadcasts,\nciting both sides of that issue and quoting important people on it.\nChairman Tyler:\nWe still await some reply as to what a representative of a substan¬\ntial group is to do when he is denied facilities.\nMr. Edgar Kobak.:18\nWhat you shall do is write your Congressman.\nII Station WBNS, Columbus.\n12 Mutual Broadcasting System, New York.\n18 Mutual Broadcasting System, New York."
}