{
  "id": "d891-164",
  "text": "on matters of controversy may not be utalized to achieve a partisan or one-sided\npresentation of issues. Licensee editorialization is but one aspect of freedom\nof expression by means of radio. Only insofar as it is exercised in conformity\n\\yith the paramount right of the public to hear a reasonably balanced presentation\nof all responsible viewpoints on particular issues can such editorialization be\nconsidered to be consistent with the licensee’s duty to operate in the public\ninterest. w\nWhile this report as a whole is a prime example of federal prose in its most tortured\nstate, it is sound. Remembering that, in more than half the towns enjoying radio\nfacilities, all facilities are under one ownership, the practical reasons why the only\nbroadcaster in town should not be allowed to monopolize the air with editorials in behalf\nof the NAM or the CIO or the Democratic Party, are obvious enough.\n* * s{e :Je * Jjc\nThe constitutional question is clear, too, on a moment’s reflection. The First Amendment\nguarantees free speech. It guarantees it to all citizens - to 140,000,000, not a mere\n3,000. Some limitations on this freedom are inescapable - thus Justice Holmes said\nthat one is not free to shout Fire in a crowded theatre.\nThere is not room in the radio spectrum for a radio station for every citizen who would\nlike to broadcast; and of the relatively small number which can be accommodated, there\nmust be discriminatory differentials as to power, broadcasting hours, direction (around -\nthe-compass or directional antennae), and clear channels (less than thirty of these).\nSo even-handed freedom to broadcast is limited of necessity. If it is no violation of the\nConstitution to deny applicant X altogether or to limit applicant Y to 250 watts, it is no\nviolation to grant a 50,000 watt license to applicant Z ON CONDITION that he serve not\nmerely his own interest, but the public interest.\nBroadcasters, in attacking the relative deprivation suffered by Z as a result of this CON¬\nDITION, are opening the way for X to assert his absolute deprivation and thus to attack\nthe whole licensing system. In the NBC case, the Supreme Court of the United States\nconsidering NBC’s contention that certain Commission regulations abridged its right\nof free speech, said; “If that be so, it would follow that every person whose application\nfor a license to operate a station is denied by the Commission is thereby denied his\nconstitutional right of free speech.” If the industry’s case against the Mayflower Decision\nand its claims for a radio as free as the press are ever recogonized, therefore, it will\nbe at the cost of validating the claims of all the rejected applicants who desire to cut\nin on what broadcasters now enjoy as exclusive or quasi-exclusive franchises.\nTheir present preferential licenses are worth more to broadcasters than all their\nphysical equipment and good will put together and multiplied a hundred times. One\nwonders, therefore, why they should expose themselves to attack on this very vulnerable\npoint. But I suppose it is not the first time that businessmen have become so blinded\nby their short-term interests as to be unable to see where their legitimate long-term\ninterests lie.\nOne can still wonder, however, why some broadcasters are hailing the June 1 report as a\ngreat victory in behalf of their conception of freedom of broadcast expression - meaning,\nof course, “radio as free as the press.” If one remembers the vigorous fight they put\nup to torpedo the whole of the Mayflower Decision - the more lenient interpretation as\nwell as the more rigorous - one may be tempted to suspect that, winking one eye, they\nare really saying, “What a good boy am I.”\n4"
}