{
  "id": "d891-183",
  "text": "LIMIT POWER OF RADIO STATIONS\n924\nWritten by Don Edison, secretary for the organization, it puts th© association\non record as wanting the Senate committee to bring forth a decision which would\nenable WOI to serve rural Iowa with full day and night operation in order to per¬\nmit farmers and tradespeople to get additional seasonal and long-time outlook\nmarket information* Present Federal Communications Commission nO.es prevent\nand the I-A stations now oppose this extended operation*\nSurely, the Senators must understand how difficult it is for Iowa State\nCollege to explain to Iowa taxpayers its inability to operate at night with this\nservice by saying Federal regulations require us to protect clear-charms! L-A\nstation in Los Angeles, over 1,500 miles away, Iowa farmers canat hear KFI,\nand California farmers can't hear WOI. The people in between can't and don't\nwant to hear either station. They have their own.\nAnd yet, KFI is protected against alleged WOI interference from th© eastern\nborders of Nebraska to the rolling Pacific. If interference did rea].ly exist,\nengineers tell us it would not be significant, except in the Colorado-Wyoming\narea where farm listeners are not concerned with the citrus growing in California\nor t&s corn and hog problems of Iowa. Their problems are cattle end sugar beets,\napples, and irrigation.\nA further fact which contradicts the interference argument is that on sev¬\neral occasions WOI has been on the air at night with special temporary permis¬\nsion to broadcast special ©vents, such as the National Farm Institute in Des\n• Moines or an address on atomic energy by Senator EickenLooper, This has brought\nno reports whatsoever of listener interference. This further confirms our feel¬\ning that KFI, as a member of the dear-channel group^ might perhaps be more\ninterested in protecting a very valuable facility—and expanding it—to its own finan¬\ncial advantage than it is in scrutinising what the interests and needs of the\npublic actually %<e, and what radio service they require, and how that may best\nbe provided them.\nI submit, gentlemen, that the clear-channel stations have never been will¬\ning impartially and comprehensively to survey the real needs of various regions\nof the country. Rather, fearful that any such exploration might diminish their\npresent preferred position, they have opposed any change, and any thorough ex¬\nploration, and answered a!P arguments by stating I-A dear-channel service is the\nonly means of serving rural America—and, we may assume in the same breath, they\nmean I-A service by the present licensees.\nOn Saturday last I talked with an official of th© American Farm Bureau Fed¬\neration. That organization gave this committee its official point of view last\nweek. I was surprised to learn that this individual ims unaware that if super¬\npower were given to I-A clear-channe3 WCBS in New York it might einasculate sta¬\ntion WRFD owned by the Farm Bureau in Ohio. This official's apparent understand¬\ning was that WRFD was a clear-channel station and that super-power would not harm\nit.\nWRFD is ©n a clear channel but is not a clear channel, and hence neither\nseeking nor protected against superpower—which is the real issue. It makes\nme wonder if th© proponents of superpower, in contacting these farm organiza¬\ntions, have really spelled out the total implications for the AFEF, th© National\nGrange, and so forth. NAEB is particularly conscious of these implications in\nview of the fate of one of our members, KOAG—which, I might say, is a station\nin name only; not on the air."
}