{
  "id": "d891-188",
  "text": "LIMIT POWER OF RADIO STATIONS\n929\nI want to apologise for writing this long letter. We are greatly inter¬\nested in the outcome of the Senate hearings and the decision of the FOG. Thank¬\ning you3 and with kind personal regards, I sm\nSincerely yours,,\nHARK G„ THORNBURG, Executive Secretary\nIOWA FARM BUREAU FEDERATION,\nDos Moines 9, Iowa5 April 9* 1943,\nSenator CHARLES II8 TO BEY p\nSenate Office Building, Washington, D. Gc\nDEAR SENATOR TOBSIs As president of the Iona Farm Bureau Federation, which\nis composed of more than 1263000 farm families, I wish to express our views\nIn regard to increasing the broadcasting services of radio station WQI, Iowa\nState College, Ames, Iowa\nAg a noncommercial station, WOI has proved itself very successful. Through¬\nout the years, farm people of Iowa have acquired a feeling of high respect for\nits educational, public service, musical, mid marketing broadcasts. Conse¬\nquently, rural people are besoming more and more concerned because of the lim¬\nited broadcasting time that is permitted this station because of Federal regula¬\ntions. Daytime broadcasting activities fulfill only a part of the radio needs\nof our Iowa listeners. For example, I as a livestock producer in Dallas County\nfind it very difficult to be on hand for market-news reports during the day¬\ntime, but would find it helpful and enjoyable to tun© in for market summaries\nand outlook information during the more leisurely evening hours. The same\nholds true for public discussions on farm issues and farm problems.\nWe do not believe that commercial interests of large and powerful dear-\nchannel stations should be so great that thoy hold a monopoly power over non¬\ncommercial, educational stations. Neither do we believe that the good clear-\nchannel stations should be eliminated or seriously restricted in their activi¬\nties.\nYet expansion of dear-channel station;? is not the solution to the particu¬\nlar problem we have here in Iowa. It is difficult for us to see how a station\nsituated hundreds of miles away can adequately fulfill our local and specialised,\ninterests. In other words, why should a dear-channel station be protected for\na service they really cannot offer? Our 1946 America Farm Bureau resolutions\npointed outs ask that radio service to farmers ty substations be maintained\nand improved with reference to the special needs of people on farms.” I believe\nthe delegates had such stations as WOI in mind when they approved this particu¬\nlar section.\nWithin the last year, WO I has obtained special permission to broadcast a\nfew sport events and farm forums about which listeners have never complained\nof any interference when these programs were on the air. Therefore, we see no\nsound reason why permanent permission could not be granted to WOI for night¬\ntime broadcasting. Such a permission is consistent with the development of a\nsound communications system. It would seem to us then, that a solution to"
}