{
  "id": "d891-189",
  "text": "LIMIT POWER OF RADIO STATIONS\n930\nthis particular problem might easily b® accomplished without harming present\nclear-channel stations. At the same time, the listeners of WO I would\" be sub¬\nstantially benefited.\nlowt farmers are keenly interested in this important matter and any action\nwhich will increase the broadcasting hours of WOI will be greatly appreciated\nnot only by thousands of Iowa farmers but also by city residents.\nWith kindest personal regards, I remain,\nSincerely yours,\nE* HOWARD HILL, President,\nFARMERS GRAIN DEALERS ASSOCIATION OF IOWA,\nles Moines 9* Iowa, April 9, 1948.\nThe Honorable CHARLES W, TO BEY,\nActing Chairman of the Senate ICC Committee,\nWashington, D„ G.\nDSAH SENATOR TOBEYs It has com© to our attention that your committee is\nhearing evidence relative to Senate bill 2231 limiting power of the clears\nchannel stations, Th© Farmers Grain Dealers Association of Iowa (cooperative),\nrepresenting 300 cooperative elevator organizations in th© State of Iowa with a\nmembership of approximately 100,000 farmers, would like to go on record, urging\nthe Senate committee to bring forth a decision which would enable WOI to serve\"\nrural Iowa throughout, the day with farm, home, outlook, and market-news infor¬\nmation*\nIt is our understanding that at th© present time WOI does operate from 6 a„m.\nuntil sundown„ What Iowa really needs is a station such as WOI rendering exclu¬\nsively educational mid public-service programs, which can operate the full day\nfrom early moralng until late evening.\nAt present WOI is performing an excel\": ©nt service throughout the day, from\nsunrise to sunset, covering the current daily changes in market conditions for all\nMidwest farm commodities. What is badly needed is for this station to have full\nday end nighttime operation so that farm and home programs might be carried\nduring the evening and early morning hours as well as from sunup to sundown.\nTh© nighttime period of broadcast is very much needed to give farm and rural\ntradespeople an opportunity to get additional seasonal and long-time outlook in¬\nformation to help them make decisions during this period of rapidly changing eco¬\nnomic conditions.\nW© hope that the Senate committee hearing will assist in legislation or rec¬\nommendations to the FOG which will enable educational broadcasting stations such\nas WOI to bring a full day of farm,, home, and market information to rural agricul¬\nture.\nYours very truly.\nDON E„ EDISON, like cut ive Secretary*"
}