{
  "id": "d891-24",
  "text": "- 10 -\nprevious restraint over commentators than it does over licensees in view of\nthe First Amendment and Sec. 326 of tfte Communications Act. However, I do\nbelieve th&t the Commission has the power to require segregation of objective\nnews from comment and editorialization by commentators and lioensees, If\nfairness to the public is to be the test, then certainly the public-is en¬\ntitled to know what is news and what is opinion from both licensees and com¬\nmentators*.\n23. In the first place the Commission must put itself in a position to\ndetermine on appropriate oocasion the character of editorialization by licen¬\nsees whether through their own mouths or through the mouths of commentators.\nIt should be realized that at present there is no radio format equivalent to\nthe editorial page, of our newspapers. Accordingly, neither the Commission nor\nradio listeners are in the same position as newspaper readers to identify ed¬\nitorial comment. The problem of labeling is all the more serious in radio by\nreason of the frequent practice of commingling editorial views with programs\ndealing with objective presentation of the news. This is especially true in\nthe case of commentator programs. They do not, in fact, constitute merely\nnews broadcasts nor on the other hand do they constitute purely editorial com¬\nment. They are rather a'combination of editorial opinion based upon so-called\nfactual news stories, which all too frequently result in \"loaded\" news stories,\n- - -24# While there are .differences between the programs of different com¬\nmentators, and there are good commentators and bad commentators, in the main\nlisteners believe that they are being furnished with critical news suranaries\nby all. commentator programs. And it is the failure of many such urograms to\nrepresent themselves as \"loaded\" news programs that consitiutes the vice here¬\nin. Tihile I believe that the Commission cannot under the Constitution and\nshould not in any event prohibit the commingling of such editorial opinion\nand new stories, nevertheless I believe it clear that it has the authority to\nrequire the labeling of editorial comment. Furthermore, that, many so-called\ncommentary programs, although not all, are obvious deceits on the listener\nhas been alluded to frequently both in Congressional hearings and by promi¬\nnent public officials,, ^or example, the use of date lines, indicating that\nthe item about to be read originated in oscow, Berlin,' Singapore or the\nWhite House, are transparent falsities to informed persons*. Nevertheless,,\nthousands of listeners believe, if letters received in Congress and by the\nCommission are evidence, that such news items are coming hot over the wire at\nthat instant. Similarly, the use of sound effects lends a false and mislead¬\ning impression. The Commission might well promulgate standards which will in¬\nsure honest and factual reporting of news and honest and accurate labeling of\nwhat is news and what is opinion. I believe, therefore, that the Commission\nshould, by way of a codified rule and regulation, establish standards for the\nlabeling and identification of editorialization over the air. The Commission ;\nshould specifically describe in such a rule the exact identifying language\nand the exact times at which tho identifying announcement should be made dur¬\ning the program, Cf», e.f... Sections 3.167 and 3.189 of the Rules and Regu-',,\nlations relating to station identification and announcement of sponsored pro¬\ngrams. Such a rule should make clear that in a program where commingling of\nnews and editorial comment is made, that portion of. the program'dealing with\neditorial comment should be labeled as such, I do not believe it is suffi¬\ncient-bo merely require a general statement that such a program contains ed¬\nitorial comment."
}