{
  "id": "d1294-0",
  "text": "N-A-L-B NLWS I BITER\nNational Association of Educational Broadcasters\nMadison, Wisconsin—April 22, 1936\nILSTUDEBAKER COMMITTEE1*TO STUDY CONFLICTS.\n. fince the *«*roary meeting of the Federal Radio Education Committee several\nspecial subcommittees have been set up. One of these is known as the Subcom¬\nmittee on Conflicts. Our ^resident, H. B. McCartv, has heen asked to serve with\ntins group to inquire into cases of controversv or conflict between educators and\nbroadcasters, to discover instances of failure to cooperate and see what can he\ndone to bring about better relations. Membership of this committee is as follows:\nChairman A. 0. Crane, President, Universitv of Wvoming\nM. S. Eisenhower, 17. S. Dept, of Agriculture\nH. B. McCartv, National Assn, of Educational Broadcasters\nGeorve B. Porter, Legal Division, F. C. C.\nFrank M. Russell, Station WRC, Vice-President NBC\nHarrv C. Butcher, Station WJ$V, Vice-President CBS\nThomas Reed, National Advisory Council on Radio in Education\nWilliam B. Dolph, Station WOL, Washington\nA wn OQ6 fl/nn meeilng of this Subcommittee on Conflicts is scheduled for\n29 Washington. According to McCarty, the work of this sub-committee\nshould strike right at the heart of the problem which the Federal Radio Education\ncommittee was set up to solve.\nWhat have you to report hy way of controversies or failures to cooperate\nJ Uv rs and troadoasters? What do you know of instances of disguised\nf *7 0°“»ereial broadcasters? Do you know of cases of the imposition of\nstandards of entertainment on educational material? Can you give specific\nZ2lT £ i6nlal °i Ume t0 educational authorities’ Where has education been\nf 6 alf because “ popular enough\"? What educational stations,\nfar nTli ft ^ Un !r pI?ssure frora commercial interests seeking to acquire their\nI S h® prlnolple of the public what it wants\" been\napplied, to the hindrance of educational and social values?\nA°nJhe °thef hf£A’ d0 vou know of cases of indifference and neglect on the\nprise? Wherein1”3 here are they failing to do their part in a cooperative enter-\naccent advioe f educators guiltv of the charge of being dull, unwilling to\naccept advice from commercial broadcasters, and inconsiderate of audience wants?\ncases of^tn00™1**66,011 Confliots needs h«lp- Accurate information on\nte fcLr! TV censorship is required. As a member of the committee,\nd iib ^ ^ f°r 7?U help‘ He is anxlous that hls contribution to the\nu-nnn %°f th? committee based, not upon theorv and generalities, but\nmake the most ^ °T Aetails’ Write hira no*, and help this committee to\nmake the most of its opportunity.\nNATIONAL CONFERENCE ON EDUCATIONAL BROADCASTING\nsor thehfirlt*M\"f* invited to be one of a *roup of organizations to spon-\nWashington D r n ^orence Educational Broadcasting to be held in\nall who a™ fata’ t “eoerater 10- 11 and 12. 1936. The aim is to draw together\nall who are interested m any phase of the social use of radio.\nmaking thaa™ B\\“oCa^y is a meml>er of the planning committee which is\nrenort Z l ’Mtter wil1 d^cussed at Ohio. A complete\nreport will be given m a later issue of the News-Letter."
}