{
  "id": "d1294-5",
  "text": "-6-\nRADIO *S CHALLENGE\nRecent statements bv two men with widely different interests in radio make\nan interesting stud^. Their backgrounds and points of view are very unlike.\nDavid Sarnoff, President R. C. A:\nnI regard radio as a force comparable to steam or\nelectricity, and not merely as an instrument or enter¬\ntainment business. New services are being created in\nthe laboratory. Its greatness lies ahead, and. not behind.”\n(American Magazine, May 1936)\nProfessor Arthur Lloyd James, Consultant in Speech, British Broadcasting\nCorporation:\n•’America is a large country and has room for many\nradio systems. You may possibly find time in the\nnear future to develop alongside the present system\na non-commercial svstem devoted exclusively to culture\nand education.” (Broadcasting, April 1, 1936)\nFACILITIES IMPROVEMENTS\nKWSC, Washington State College, Pullman, Washington\nThe F. C. C. on April 3, 1936, granted KWSC an increase in power to 5000\nwatts, daytime hours.\nWHA, University of Wisconsin, Madison, Wisconsin\nThe commission on March 27, 1936, granted WHA‘S application for 5000 watts\npower, d.aytime\n• WHA, a work project providing for the addition in Radio Hall of five offices and\none studio was approved in Washington on March 19, 1936. Money for the materials\nwa,s provided through the state Emergency Board.\nWHITHER BOUND?\n’’The secret of success is constancy to purpose.” So spoke Disraeli!\nTaking it to ourselves, our own stations, our own situations—are we sure\nexactly what our purposes are? How can we progress without having certain goals\ndefinitely set?\nTo attain our ends a sequence of steps usually is necessary, and this should\nbe planned, carefully. Perhaps that ’’next step” is a power increase, more help,\na new studio, additional equipment, additional hours, or something else which\nyou see a definite need for. Whatever the steps toward your goal may be, work\nin that direction.\nWhere will your station be two years from now? Will you be able to look\nback to 1936 as a year in which, under your leadership, definite progress was\nmade or will it be a year of marking time? You can guide the pen in writing\nthe answer!\nFAVOR MADISON FOR 1936 CONVENTION\nIn response to invitations to hold the 1936 convention of the N.A.E.B. at\nthe University of Wisconsin, Professor K. L. Ewbank, chairman of the WHA advisory\ncommittee, has received replies from ten member stations favoring accepting the\ninvitation. Those reporting were KFDY, KFJM, KOAC, XUSD, KWSC, WESG, WCAL,\nWHAZ, WILL, WSUI. No other meeting place has been proposed. The matter will\nbe discussed, and perhaps a definite decision made at the N.A.E.B. meeting at\nColumbus on May 4. If you have any further recommendations, pass them along."
}