{
  "id": "d143-11",
  "text": "- 10 -\nthe planning and recording of a lesson and the presentation of that lesson in\nthe classroom. Where longer periods of time are spaced between the record¬\ning and presentation of the lesson the situation must be remedied and all in¬\nstructional personnel must make every effort to have no more than a twenty-four\nhour lag between recording and presentation of a lesson.\nWhen a lesson is planned, recorded and presented within the proper time-\nschedule, feedback information from the classrooms will enable the television\nteachers to make such modifications as may be indicated. Feedback informa¬\ntion may also indicate a clear necessity for presenting the same lesson a\nsecond time. It may be necessary to present it in the same way because of\nthe lesson being missed in a particular segment of the schools because of\nelectronic or mechanical failure, or because of some event occurring in the\nschools at that particular time that may have interrupted the proper reception\nof the lesson; or it may be indicated that the lesson will need to be presented\nagain but in a different manner with different emphasis. In planning a sequence\nof lessons, allowances must be made for the re-teaching of a particular lesson\nat any particular time. This is an important point in the total plan of instruc¬\ntion.\nIt is also possible that because of the enforced absence of a teacher, or of\nmechanical failure, that lessons cannot be kept up to date in their proper\nsequence. This contingency should be given every consideration in the plan¬\nning of a sequence of lessons, and insert lessons must be prepared to be used\nat a time such as this. The insert lesson should be a valuable lesson that is\nwithin the general subject area but which does not in any way interfere with the\nsequence of lessons that are being taught in a particular unit. When an insert\nlesson is presented, notice should be given to the student that this is an insert\nlesson and that you will return to the sequence in the unit at a specified time.\nWhen the sequential lessons are resumed a note should also be made of that so\nthat the student will be completely informed as to the relationships existing\nbetween the lesson presentations.\nPlanning\nThe post-school period ought to be given over to evaluation of the instructional\nprogram at the various grade levels for the past year, and the determination\nas to the modifications and changes that are needed in the curriculum for the\nensuing year. The pre-school planning period must be given over to the plan¬\nning of the total school year in terms of the units, the sequence of units and the\nsequence of lessons within the units. If we are to have 180 days of school, then\nduring the pre-school planning period 180 lessons in each subject area are to\nbe planned for. This does not necessarily mean the detailed planning of each\nlesson nor certainly does it mean the recording of any lessons. It does mean,\nhowever, that the outline of each unit to be presented during the 180 days ought\nto be pretty clear and the number of lessons and the scope and sequence of\nthose lessons in each unit ought to be pretty well down on paper. When this kind\nof long range planning is done the business of planning and recording a specific"
}