{
  "id": "d143-13",
  "text": "- 12 -\nthe areas of their particular skills and responsibilities. The Television Teacher\nis directly responsible to the Assistant Director in charge of elementary or\nsecondary education. However, the Television Teacher also has a working re¬\nsponsibility to the Supervisor of Production and Producer-Director and other\nmembers of their team. In the event of a difference of opinion in the matter of\nlesson planning or of production that cannot be settled among the members of\nthe team the matter must be referred to the Assistant Director in charge of ele¬\nmentary or secondary education who will make the final decision. It must be\nemphasized however that decisions ought to be determined co-operatively as\nnearly as possible, and each professional opinion ought to be given full con¬\nsideration.\nWhenever possible and practicable the Television Teacher ought to have a\nSamoan assistant. It was recognized initially that enough Samoan teachers\nwith the proper educational background and langauge ability could not be\nfound to provide each Television Teacher with such an assistant. However,\nthe plan calls for eventual establishment of a Samoan Television Teacher intern\nas an assistant to each American Television Teacher.\nThe Samoan Television Assistant Teacher\nThe Samoan teachers selected for this assignment must be proficient in the use\nof the English language and must have an academic background sufficient to\nenable them to become expert in the particular subject area in which they are\ninterned. Such Samoan teachers ought to be carefully selected by the Assistant\nDirector in charge of elementary or secondary education and a group of televi¬\nsion teachers with full consideration for the personal appearance, the ability to\nproject, the facility with language, and basic academic proficiency. It is the\nresponsibility of the Samoan television teaching intern to assist the Television\nTeacher in planning the presentation of the lesson, to make such suggestions\nas might make the lesson more meaningful to the Samoan children, interpret\nthe Samoan customs that might be affected one way or another by the content of\nthe lesson, and be responsible for any translation necessary in the preparation\nof the lesson, either from English to Samoan or from Samoan to English.\nIn the primary grades the Samoan assistants may give instruction in the Samoan\nlanguage during a lesson or may provide Samoan language introductions to non¬\nverbal exercises arranged and presented by the Television Teacher. The extent\nof the participation by the Samoan intern teacher is of necessity determined by\nthe state-side Television Teacher, who is responsible for the direct presenta¬\ntion of the lesson material on the air.\nThe Research Teacher\nThe Research Teacher is not a writer. The Research Teacher is exactly what\nthe name implies, a competent teacher who does the research necessary to the\ndevelopment of a truthful and authoritative lesson. The Research Teacher works\ndirectly with the Television Teacher in the planning of the content of a lesson."
}