{
  "id": "d143-16",
  "text": "- 15 -\nresponsibility of the Supervisor of Television Production to see that no time is\nlost by production personnel by waiting on facilities to be made available. It is\nhis responsibility to co-ordinate with the assistant directors in charge of instruc¬\ntion to see that production scheduling is planned so that maximum use of produc¬\ntion facilities is made.\nThe Supervisor of Television Production is directly responsible to the Director\nof Education administratively, but in operation he has a responsibility to work\ndirectly with the Assistant Director for the management of the instructional\ncenter and with the Assistant Directors in charge of instruction. This includes\nElementary Education, Secondary Education, and Adult Education. He also has\nan operational responsibility to the Assistant Director in charge of Engineering\nServices. If he has a service problem or a recording problem these must be\nworked out directly with the Assistant Director in charge of Engineering Services.\nThe Supervisor of Television Production is in effect an organizational catalyst,\nwhose job it is to see that everything works smoothly in the system and that the\nco-operative effort in the use of production facilities and in the process of pro¬\nduction itself is effective.\nAssistant Supervisor of Television Production\nThe Assistant Supervisor of Television Production is just what the name implies,\nan assistant to the supervisor. However he has a primary responsibility of\nworking more closely with the Producer-Directors in the actual process of pro¬\nduction than does the supervisor who may be limited in this respect by his many\ngeneral operational and administrative responsibilities. Aside from this direct\nrelationship with the Producer-Directors the Assistant Supervisor of Television\nProduction has approximately the same responsibilities as the supervisor.\nThe Cameramen\nThe studio cameras are to be manned by native Samoan personnel, who shall be\nunder the direction of an American crew chief or head cameraman. It is the\nresponsibility of the crew chief to see that all cameramen are thoroughly familiar\nwith the cameras and with the techniques of using the camera. Their job is as\nmuch instructional as it is operational. They are to assist the Producer-Director\nin setting the stage3 and setting the lighting on the stage, and in directing the\ntrimming of the studio and the staging of any production as requested by the Pro¬\nducer-Directors. The Cameramen and the studio crews are directly responsible\nto the Producer-Director while they are working on his particular production.\nThey are administratively responsible to the Supervisor of Television Production.\nArtist\nThe art department shall be in charge of a head artist, or senior artist, who will\nhave the responsibility for getting up such material as is ordered, assigning work\nto various people in the department, ordering art supplies and equipment, and for"
}