{
  "id": "d143-17",
  "text": "- 16 -\nthe normal functioning of the department. He shall be under the direct super¬\nvision of the Supervisor of Television Production and shall be administratively\nresponsible to him; however, the head of the art department shall work co¬\noperatively with the Producer-Directors, the Television Teachers and the\nAssistant Directors in charge of various areas of instruction.\nThe artists that are assigned to this department will work under the head artist\nand will accept such assignments as are given to them and complete them with\nas much speed as is compatible with quality work. It should be noted here that\nthe art department ought not to be requested to do any kind of art work that could\nbe better done by photography. The art department ought to be particularly\ncapable of turning out graphs, charts, maps, special lettering needs, special\nisometric and exploded views and cartoon type illustrations. This list does not\npreclude the using of the art department for any purpose that cannot be better\nor otherwise served but the plan of instruction does not anticipate that the art\ndepartment will be used as a catchall for inadequate figure representations,\nlandscapes and such other materials.\nPhotographer\nThe photography department is to be in charge of a head photographer with such\nassistants as are indicated. The photographer’s job is primarily involved in\ninstruction. He is directly and administratively responsible to the Supervisor\nof Television Production. However the kind of work that he turns out must meet\nthe approval of the Producer-Directors and the Television Teachers and the\nAssistant Directors in charge of instruction. The photographer is not to make\nany photographs that he is not specifically requested to make and when he is\nrequested to make a photograph it must be for a specific instructional purpose.\nIn using photography on television for instruction it must be remembered that\nthe preferable scene or image must be a moving one - moving pictures are the\nfirst choice beyond live action to be used to illustrate or demonstrate anything\non television. If it is not possible or practical to have a motion picture film\nclip of a particular scene or action that is needed, then good sharp still pictures\nwill be acceptable; but they are not to be made promiscuously or casually, but\nunder direct instruction from the person who intends to use them and for the\nspecific purpose for which they are intended to be used.\nGlossy prints are never to be used or made for television production, only dull\nprints and particularly matte face prints if at all possible; and sharpness and\ncontrast must be paramount qualities. The photographer is expected to settle\nupon standard film to be used, and standard developers, and standard paper for\nproduction; and the entire photographic crew is to be drilled in the use of these\nstandard products so that the absence of one or more persons from the studios\nwill not in any way handicap production."
}