{
  "id": "d143-21",
  "text": "- 20 -\nbe done and has to be co-ordinated with the government departments. It is his\nresponsibility to observe the quality’of classroom supervision that is achieved\nby the Samoan Classroom Teachers and by the Elementary Principal and to\nsubjectively evaluate the quality of instruction that is being achieved in the\nclassrooms.\nThe Elementary School Supervisor is directly responsible to the Assistant\nDirector in Charge of Elementary Education, and is to keep that person in¬\nformed of the situation and conditions prevailing in the elementary schools and\namong the elementary teaching and supervisory personnel.\nClassroom Instruction Supervisors\nThe Classroom Instruction Supervisors are equivalent to the principal teachers\nin the elementary schools, at the secondary level. It is their job to supervise\nthe actual introductory and reinforcement activities that occur in the classroom\nbefore and after each televised lesson. This person is not to be used in any\nadministrative capacity whatever, but is to stay in the classrooms and con¬\nstantly supervise and work with the secondary classroom teachers.\nThey are to provide feedback information to the Assistant Director in Charge\nof Secondary Education as to the responses received from the children and\nprovide a subjective evaluation of the pace and content of the lessons. The\nClassroom Instruction Supervisors will also meet with the Secondary Curricu¬\nlum Development Committee. They are directly responsible to the Assistant\nDirector in Charge of Secondary Education, and they are administratively\nresponsible to the Principal of their particular high schools.\nSecondary School Principals\nSecondary School Principals are in general charge of the instructional pro¬\ngrams in their schools and are administratively responsible for the function of\nthe entire school. They are responsible for supervising the work of the Class¬\nroom Instruction Supervisor and the Classroom Teachers. Where there are\nspecial classes they are responsible for the operation of the special classes\nand for the work of the subject-matter teacher in these classes. This includes\nvocational or shop skills training, homemaking education, agriculture education,\netc. They are responsible for seeing that the Classroom Instruction Super¬\nvisors provide the instructional production center with the required feedback\ninformation and subjective evaluations that are necessary to modify the instruc¬\ntional program in line with the indicated needs. The Secondary School Principal\nis directly responsible to the Assistant Director in Charge of Secondary Educa¬\ntion."
}