{
  "id": "d143-29",
  "text": "burning up cigars at a great rate. Maybe it is the pip®1;radition, but I like\nthem best with the little plastci holders. Furthermore, I don't know where we\nare in regards to money for all the little goodies you have shipped me. Maybe\nyou can recall enough to give me some idea. Anyway, it is all appreciated.\nYou will be happy to know that my tomatoes have done famously. Everyday I\nharvest a goodly crop. Have a few canteloupes on the way, too. My watermellons\nproduce tremendous vines, but no mellons. On?of the Ag people suggested that\nmaybe because of the lack of bees they weren't getting properly polinated. Maybe\nI'll get a paint brush and do some bee work. But, its fun.\nApart from appendicitis, the girsl are apparently happy in Vienna. We will\nmiss them during the Christmas season, but lack the funds to bring them back.\nAnyway, we are sure they will be taken care of and will have a fun Christmas, even\nif somewhat different than being home.\nWard and Rick# are fine. In different ways, they are both a handful. Ward\ntends to disappear and not show up till almost dark. And while the area in which we\nlive, Apapa, is not huge, young boys can disappear with great ease. Of course,\nRicky is at the stage of getting into everything, breaking everything, etc. And\nhas picked up a local habit of using all the great outdoors, regardless of location,\nas a toilet. Good thing this isn't a postcard.\nEnough chatter for now. Keep after G. Davis and Co. Best regards to all\nin NAEB. For Bronson, I do Remember the Alamai\nBest of love and good wishes to all the Hills\nAs ever\nP.S. McBride's visit was a pleasant interlude, and we had a delightful trip around\nthe country with George, and a BBC'er named Michael Wynne. Arch Parsons of the\nFord Foundation read Jack's report in New York and said it was very good. We\nhaven't received a copy out here as yet.\nP.P.S. We have been somewhat re-organized. George and I, and our two projects\nhave officially been transferred to the Education Division. All that is left in\nCM is a small service unit. Don't know -whether Winfield, Griswold, Davis et al\napprove of this heresy, but we think it will work much better. Time will tell.\nDR"
}