{
  "id": "d143-3",
  "text": "- 2 -\nThe \"system” is not a television system. It is a CO-OPERATIVE SYSTEM\nOF INSTRUCTION MAKING MAXIMUM USE OF TELEVISION. The core of all\ninstruction in this system is the teaching that is done by means of television,\nsupported by the reinforcement activities that take place in the classrooms.\nThe planning, presentation, and reinforcement procedures are all developed\nco-operatively in this system. This is \"team teaching\" in its very broadest\nand best sense. This co-operative teaching is mainly concerned with ideas,\nunderstanding, and insights. It is not concerned with the memorization of\nrelatively unrelated facts, or with rote learnings of any kind.\nThe system will proceed in its development according to the plan. The plan\nwas initially conceived to take approximately fifteen years in its total develop¬\nment. Three years were required for base planning and for constructing the\nphysical plant necessary to the system; and twelve additional years will be\nrequired for the academic and organizational development.\nThe plan requires that all instruction be conceptual in nature, and directly\nrelated to the environment, and to the needs of the Samoan children. It\nrequires that all basic instruction be planned co-operatively at the educational\ncenter, and be presented to the children in the classrooms by television trans¬\nmitted from the center. It requires that planning for each lesson at the tele¬\nvision center shall be complete, that is that each lesson plan shall provide for\nsuch activities or exercises as may be necessary to properly introduce a lesson\nor to prepare the minds of the learners to receive the lesson, the main body\nof the lesson in proper sequence and scope, and such reinforcement activities\nand drills as may be required following the presentation of the main body of\nthe lesson. The television teacher shall be the central figure of the lesson\nplanning and shall assume the major responsibility for the organization of the\nlesson, but he must be assisted by the entire instructional team in the planning\nprocess, and in the presentation.\nThe Instructional Team\nThe instructional team includes the television teacher, the research teacher,\nthe Producer-Director, the Production Supervisor, the Research Librarian,\nthe subject-matter specialist, the departmental supervisor, and such other\ntechnical assistants as shall be required from time to time. The specific\nduties and relationships of the members of this instructional team will be\nexplained in detail in other parts of this manual.\nThe plan requires native Samoan teachers in the classrooms, supervised by\nproperly certified and experienced American supervisors. It calls for an\nAmerican Principal in each elementary school, and one or two Classroom\nInstruction Supervisors in each secondary school according to the number of\nclasses involved in each school. In addition to the Classroom Instruction\nSupervisors, each secondary school will have a qualified principal in charge\nof the total school program."
}