{
  "id": "d143-7",
  "text": "- 6 -\nIn the twelfth grade there will be a small carefully selected class in advanced\ntyping and business education that will receive a more intense training in\nthese areas. Selection for this small class will be made on the basis of pro¬\nficiency in the English and in the eleventh grade typing. Pupils admitted to\nthis accelerated class will be brought into Utulei High School and receive\ntheir training in the special classroom situated in this area.\nIt is clear that for the first few years of this new system that the children in\nthe ninth and tenth grades will not be academically prepared to take special¬\nized training in typing or other business skills and that is the reason for\ndelaying the election of instruction in this field until the eleventh grade. It\nis also obvious that these skills cannot be usefully developed unless the student\nhas attained more than the ordinary proficiency in the use and comprehension\nof the English language and that is the reason for using this basis for selection\nof those who have elected to come into these classes.\nThe students that successfully complete the eleventh year typing and business\nEnglish classes may be allowed to continue into the twelfth grade; however\nonly the top ranking students as demonstrated by typing proficiency and pro¬\nficiency in the English language may be admitted to the accelerated class.\nThis class should at no time exceed 25 students until experience has indicated\nthat a greater percentage of students have the necessary educational develop¬\nment and language proficiency to profit by advanced training, and the Samoan\neconomy has demonstrated that it can absorb more than this number of trainees.\nAdult Education\nThe plan requires that there be a strong adult education program to back up\nthe school program. The general purpose of the adult education program shall\nbe to provide opportunities for adults and for out-of-school youths to become\nproficient in the comprehension and use of the English language, to develop\ncivic understanding, and vocational skills, particularly in the field of agricul¬\nture.\nThe adult education programs shall be scheduled for the most part in the early\nevening hours. Such programs shall be directed primarily to the adults in the\nvillages of American Samoa. A certain amount of entertainment programs shall\nbe made available for the purpose of attracting the attention and interest of the\nadults, and familiarizing them with the use of the English language. However,\ninterspersed with the entertainment programs shall be regular programs of\nsystematic instruction in the English language, in village sanitation, in personal\nhygiene, in agricultural information, and in the demonstration of home and agri¬\ncultural skills.\nIn Adult Education there shall also be regular programs concerned with the\nproblems of the local government, information about the United States, and\nproblems confronting the United States from time to time. The Supervisor of\nAdult Education is expected to call upon the various other departments of"
}