{
  "id": "d143-8",
  "text": "- 7 -\ngovernment in America Samoa to develop and prepare programs of interest\nand value to the people in the villages and to the adult population generally.\nAny personnel in the Department of Education may be assigned by the Director\nof the Department of Education to participate in the adult education program\nat the request of the Supervisor of Adult Education. It must be understood\nthat the adult education program is more than just an adjunct to the program\nof systematic instruction in the schools. It is the basis upon which the depart¬\nment of education must expect to develop continuing support for the system of\nuniversal education which has now been instituted by the Government of\nAmerican Samoa. The success of the village schools and the continuing suc¬\ncess of universal education in the high schools depends in a large measure\nupon the development and success of the adult education program. It is for\nthis reason that all the school facilities, all school principals, all school\nsupervisors must consider themselves a part of the adult education program\nand must be prepared to participate in some measure in the development of\nthis program.\nTHE METHOD\nThe heart of this new system is the modified curriculum. The curriculum\nhere does not just mean the broad areas of subject matter - language, mathe¬\nmatics, science, and social studies, nor is it identified by that vague definition,\n\"The sum total of a child’s school experiences\". The curriculum in the new\neducational system of American Samoa means those particular areas of each\ngroup of skills and knowledge that are selected and presented in clearly de¬\nfined scope and sequence and depth, such as seem most nearly to meet the\nneeds and advance the intellectual and civic growth and development of the\nSamoan children.\nThe curriculum may be modified from time to time, but it is initially and\ncontinuingly determined and developed by a curriculum committee composed\nof the faculty and staff of the instructional division of the system. The Ele¬\nmentary Television Teachers, a selected group of Elementary Principals, a\nselected group of Elementary Classroom Teachers and the Assistant Director\nin charge of Elementary Education shall constitute the Elementary Curriculum\nDevelopment Committee.\nIn the secondary division the Secondary Classroom Teachers, the Classroom\nInstruction Supervisors, and a selected representative group of Classroom\nTeachers with the Assistant Director in charge of Secondary Education shall\nconstitute the Secondary Curriculum Development Committee. Each of the\ncurriculum committees shall be headed by the Assistant Director in charge\nof the particular division. The Director of Education shall be the ex officio\nchairman of both committees, and shall make all appointments to the com¬\nmittees."
}