{
  "id": "d143-9",
  "text": "Curriculum must be modified regularly in accordance with experience. As\nthe level of educational achievement rises among the students and the frames\nof reference broaden, the rate of learning will increase and the instructional\ntechniques must become more sophisticated. For this reason the keynote of\nthis system is continuing evaluation and modification. Textbooks are not being\nused for direct instruction because they are not flexible enough to meet the\nneeds of this system for continuing modification based on learning sophistica¬\ntion and change in rate of learning. Continuing evaluation is the guide to\ncurriculum modification. The development of the individual lesson plan is\nthe instrument of curriculum modification. The instrument depends on the\nguide.\nThe Lesson\nThe lesson has its basis in the prescribed curriculum. The lesson plan and\nthe lesson itself is the product of the total instructional team; however the\ntelevision teacher must be the core of that team and must assume prime re¬\nsponsibility for the development of the lesson plan and for the presentation of\nthe lesson.\nWhen the lesson is planned, it is not only planned for that portion that is pre¬\nsented on television but it is also planned for all other activities concerned\nwith the lesson. From a working standpoint it can be said that a television\nlesson is divided into four parts:\nThe first part is planning. This stage is concerned with what is going to be\ndone in a particular segment, in a particular instructional step. Determina¬\ntion is made as to the scope of the sequence — whether it will be a totally\ndeveloped idea or a partially developed idea. Planning is essentially the pull¬\ning together of the elements of the lesson. The ingredients of the lesson are:\n1) The idea, 2) The materials, and 3) The manner and technique of presenta¬\ntion.\nThe second part of the television lesson is the preparation of the mind of the\nlearner to receive that lesson. Learning cannot occur through a closed door\nand it is the responsibility of the teacher or the teaching team to open up the\ndoor to learning. This may be done by the teacher on television, or it may\nbe done by the teacher in the classroom, or it may be done by a combination of\ntechniques between the teacher in the classroom and the teacher on television.\nIn any event the lesson must contain specific procedures and activities designed\nto open the way to learning, to open the way for the reception of ideas. The\nlesson planners must direct the teacher in the classroom in this phase of the\nlesson, and they must co-ordinate any joint activity in which both the teacher\non television and the teacher in the classroom must participate. If the teacher\nin the classroom is to be made directly responsible for the preparation of the\nmind of the learner then the lesson plan devised and co-ordinated by the tele¬\nvision teacher must tell the classroom teacher precisely what to do and how to\ndo it."
}