{
  "id": "d1619-1",
  "text": "NAKB NEWS LETTER.JAN* 1, 1941...Page 2\nJackson issued one in Washington. He ordered the beginning of\ncriminal proceedings under the Sherman anti-trust law against\niiSCAP, BUI, CBS, and NBC. The Justice department announced that\nJackson had ordered Thurman Arnold, anti-trust chief, to file\ncharges after the first of the year.\nWNAD SEEKS MOKE POUER AND LONaSR HOURS\nThe Extension Division News of the University of Oklahoma reports\nthat \"Plans are being made to increase both the broadcasting\nrange and time of VfNAD, university radio station. This will mean\nan increased service to the state by the Extension Division.\n\"Dr. U. L. Warden, assistant to the president, announced that\napplication has been made to the federal communications commission\nto change the frequency of the station from 1010 to 640 kilocycles.\n\"In seeking an increase in the effectiveness of WAD, Warden said\nthe apolication presented to the FCC called for a full daytime\nbroadcast for the station. The station nor broadcasts on an\naverage of 14 hours each week. The increased time would permit\nmore extensive service to the citizens of Oklahoma.\"\nNAEB PACKET\nThe current packet contains material from\n1. University of Kentucky.\n2. University of Michigan.\n3. WOI, Iowa State College,\nIf your institution is not represented, it1 s because L didn't receive\nany dope from you. For most members, that statement goes for the\npacket or NEWS LETTER content.\nFOC ACTIONS\nKOAC, Oregon State College, was given permission to remain silent\non Christmas. (12/18/40)\n7/BAA, Purdue University, was given special permission to operate\ncertain night hours during January in order to carry basketball\ngames. (12/18/40)\nWOSU, Ohio State University, was given permission to operate late\non December 30th in order to carry a basketball game. (12/18/40)\nWNYC, City of New York, was given authority to operate certain late\nhours in order to broadcast official information to draft boards\nand registrants. (12/23/40)\nWILL, University of Illinois, was given permission to operate certain\nnight hours during January in order to carry basketball games (l*/^3/40)"
}