{
  "id": "d1723-10",
  "text": "-11-\nRADIO-TV COUNCIL REPORT SUMMARY\nSchools of journalism with sound radio news departments should give serious con¬\nsideration to offering basic training in television news. If they can find competent,\nwell-trained instructors, they can \"set up shop\" for TV news training on small invest¬\nment.\nThese are conclusions of a study recently completed bynthe Council on Radio-\nTelevision Journalism under the direction of Professor Mitchell V. Charnley of the\nUniversity of Minnesota School of J ournalism. Though the Council sees no immediate\nexpansion of demand for TV-trained newsmen, it expects eventual opportunities to be\n\"fairly heavy.\" But it says that TV is going to select its new workers only after\nscrupulous screening.\nThe Council conducted the study last spring, with the participation of its\ntwelve industry and teacher members and the counsel of two experienced TV newsmen:\nSpencer Allen of WON Chicago, who has been teaching a TV news course at Northwestern\nUniversity for several years; and James Byron of WBAP Fort Worth, tliose operations\nwon for his station last year's National Association of Radio News Directors top\nTV award.\nThe report arrives at four major conclusions:\n1. Schools of journalism with good radio news departments ought to offer at\nleast ihtroductory work in TV news. Fundamental education in news gathering,\n_ writing, editing and administration lies at the base of any such training\n(one opinion calls it \"the most important contribution'/ the schools can make).\nIn most cases the schools should not concern themselves with studio camera\noperation, production direction and the like. But use of the news camera, the\nfundamentals of TV news writing and editing, editing of news film and other\nsuch instruction can successfully be offered in the classroom laboratory.\n2. There is no adequate supply of well-trained teachers. The teachers1 intern¬\nship plan as operated for six years by the Council in radio news is a sound\nmeans of helping to meeting the shortage; but the number of TV stations with\nsound news operations is at present too small to give an internship program\nbroad effectiveness. A start has been made on such a program, however, and •\nthe Council plans to extend it as rapidly as possible.\n3. .Expensive equipment is not necessary for the kind of training most schools\nshould offer. Students should be given experience in the techniques of hand¬\nling and editing film, counting and slugging it, and writing copy for it.\nTraining with both silent and sound film should be included#\nCooperation with local stations in offering practical experience is valuable\nwhen it can be arranged; but the number of opportunities is at present extreme¬\nly limited.\nU# There will be no immediate expansion of opportunity in TV news jobs, but the\nlong-range prospect is for considerable development. Both the coming increase\nin the number of stations and the extension of local TV news operations (sim¬\nilar to the extension of radio news operations in the last fifteen years) will\nexpand the demand for well-trained workers. Women should be \"as successful in\nTV news as they have been in newspaper and radio work\"; they can do film edit¬\ning and other specialized types of TV work with special skill."
}