{
  "id": "d1723-11",
  "text": "-12-\nTV employers are likely to screen applicants for newsroom work with intense\ncare# TV news work is expensive and expert, and employers mil select workers\nscrupulously.\nMinimum Equipment Requirements for TV News Training\n'(Prepared by CBS-TV News Department?*\nFor 16mm Silent Film\nBaia editor-viewer and splicer $ 9i**79\nOR\nCraig Projecto-Viewer Model El622, with splicer\nand rewinds mounted on board 8h»9$\n-**l6mm Keystone projector, new model\n100.00\nused model\n5o.oo to 75.00\nFor Sound Film\n**BeU & Howell projector Model 189, new\n1*25.00\nused model, about\n225.00\nBell & Howell Viewer\n100.00\nSplicer, Griswold No. 3 Positive\n30.00\nRewinds (two), Neumade RW-1 (geared)\n18.00\nReels, cans, beaded screen, etc.\n25.00\n#*Most universities will have projectors, and some of the other\nequipment, already available,\nORE STUDIO SPACE FOR WBEZ\nThe Chicago Board of Education on August 13, approved a five year lease of two floors\nof the Bankers Building in the Chicago Loop to provide more space for its radio sta¬\ntion WBEZ and possibly to serve as site for an educational television station. The new\nquarters contain 3200 square feet of space and the rent is $900 a month. The 700\nsquare feet used by WBEZ for transmitter site in the Morrison Hotel cost $630a.month.\nDr, HeroId C, Hunt, General Superintendent of Chicago Public Schools, said the present\nquarters are inadequate and even if the new space is not used for the television sta¬\ntion transmitter site, it might serve as a feeder point for the new Channel 11 station.\n\"The new quarters allow us ample room for t ransmitter and servicing facilities as well\nas two additional studios and much needed office space,\" said George Jennings,Director\nof Radio and Television for Chicago schools. “Present studio facilities will be main¬\ntained in the Board of Education headquarters at 228 N. La Salle Street, with a tele¬\nphone link between them. In addition to this increase in space, station WBEZ now has\nremote relay equipment in Operation and during the current year will use school audi¬\ntoriums and assembly halls as studios for large pageant type programs, orchestra and\nhand concerts, spelling bees and other audience participation broadcasts.\""
}