{
  "id": "d1723-5",
  "text": "~ 6 -\nOnly One Year In Which to Act\n\"The Sixth Report issued by the Commission on April 1U last stipulated that the Table\nof Assigmrants shall not, with certain exceptions, be subject to amendment on petition\nfor a period of one year from the effective date of the Order — which was June 2,\n19£2...In other words, at the end of one year anyone may petition the Commission to\nchange any of these seven noncommercial educational assignmsnts in Oklahoma to com¬\nmercial assignments,\n\"The same holds true for any of the 21*2 educational assignments over the nation,\n\"Let me assure you that the land-hungry boomer of the old days had nothing on the\nchannel-hungry television boomer of today. The need for prompt action on your part\nis obvious. N°w you can understand why I keep saying that this is education’s year\nof decision. Need I remind you that almost two months of the year have already pass¬\ned? Just what action the Commission will take on any petitions that may be presented\nat that time and in that particular case. Your best insurance, of course, is to have\na. construction permit.• • •\n\"Your next best insurance is to have an application on file or to have a definite\nprogram of action looking toward the filing of such application.”\nSTEETLE SPEAKS IN MADISON\nEducators have shown a tremendous energy in the past two years in finding a substan¬\ntial place for educational television in a new medium, Ralph Ste6tle, executive di¬\nrector of the Joint Committee on Educational Television, told a Madison audience\nrecently. Steetle spoke on \"The Status of Television in American Education” before\nconferees at the Audio-Visual Education Institute meeting on the University of Wis¬\nconsin campus. He cited as the result of that energy the 21*2 channel assignments for\neducational television thus far granted by the Federal Communications Commission.\nHe listed the University of Wisconsin along with Ohio State, Wayne, the University\nof Illinois, Consolidated University, New York, Kansas State, the University of Kan¬\nsas, and the University of Houston among the institutions of higher learning which\nhave already begun experiments in educational television or which are making vigorous\nplans for entering the field.\nThe phrase, \"Television offers the greatest potentials since the introduction of\nprinting”, has beconB a cliche among people interested in communications media,\nSteetle pointed out in emphasizing the great possibilities which television has.\n\"The teacher’s best role at this stage of television is an investigating what is\ntelevision’s best use and what the medium cannot be used for,” Steetle declared.\n\"People in the audio-visual fields,” he continued, \"should feel a real stake in tele¬\nvision and should take an active part in assisting in its development. So much of\nthe potentiality and possibilities for educational television lies with you,\" he\nemphasized to the teachers, administrators, supervisors, and directors in the field .\nof audio-visual education who were the bulk of his audience+\nThe question of how television can best be used in the classroom and in teaching situ¬\nations is still a big one, Steetle concluded, but pointed to the situation in Cleve¬\nland where £7*000 housewives tune in at an unpopular hour to a televised elementary\ncourse in psychology as an indication of audience possibilities to be found in TV as\nthe new educational medium is explored.\nSEE THAT YOUR TRAVEL BUDGET FOR THIS YEAR COVERS NAEB MINNEAPOLIS"
}