{
  "id": "d1723-7",
  "text": "- 8 -\nINDIANA: Edwin Carmony, Supervisor Audio-Visual Education, Board of Education, Gary*\nNed L. Reglein, Associate Professor and Associate in Research and Utiliza-\n' tion, Indiana University, Bloomington.\nIOWA: W. Gj'erde, Audio-Visual Specialist, Iowa State Teachers College.\nCarl H. Menzer, Director Stations WSUI-KSUI, State University of Iowa.\nJohn R* Winnie, Director of Film Television, State University of Iowa.\nClifton F. Schropp, Director, Curriculum Development and Audio-Visual\nEducation, Des Moines Public Schools.\nKANSAS: . R. Edwin Browne, Director, Radio and Television, University of Kansas.\nRobert Hilgendorf, Director, Station KSAC, Manhattan*\nLOUISIANA: Lucille Ruby, Louisiana Stare University*\nMASSACHUSETTS: Lawrence Creshkoff, Assistant Manager, WGBH, Lowell Institute,\nCooperative Broadcasting Council, Boston.\nMICHIGAN: Paul B. Rickard, Director, Radio and Television, Wayne University, Detroit.\nMINNESOTA: Madeline S* Long, Consultant in Radio Education, Minneapolis Public\nSchool.\nBurton Paulu, Manager, KUOM, tkiiversity of Minnesota.\nMISSOURI: Elizabeth Golterman, Director, Division of Audio-Visual Education, Board\nof Education, St. Louis\nNEBRASKA: Ken R. Keller, Assistant Director, Public Relations, University of\nNebraska.\nNEW JERSEY: John F. McDonald, Department Public Relations, Rutgers University.\nNEW YORK:\nOHIO:\nOKLAHOMA j\nBernard R. Buck, Program Director, WNYC, Municipal Broadcasting Station,\nNew York.\nCarroll V. Newsom, Associate Commissioner for Higher Education, The\nUniversity of the State of New York.\nLois B. Hunter, Westminster Choir College, New York.\nWilliam B. Levenson, Assistant Superintendent, Board of Education,\nCleveland, Ohio.\nR. C* Higgy, Radio Station WOSU, Ohio State University.\nJohn Woodworth, Director, Radio and Television Services, Oklahoma A & M,\nJohn W. Dunn, Director, Educational Broadcasting Services, University\nof Oklahoma.\nOREGON: A. K* Trenholme, Sub-Director, Instructional Materials, Portland.\nPENNSYLVANIA: Martia A. Gable, Assistant Director, School-Community Relations, Board\nof Education, Philadelphia.\nViers Adams, Pittsburgh Public Schools, University of Pittsburgh.\nSOUTH DAKOTA: Keith J. Nighbert, Radio Station KUSD, University of South Dakota.\nTENNESSEE:\nTEXAS:\nWASHINGTON:\nHelen Lochrie, Board of Education, Memphis.\nDr. Robert T* Lagemann, Head, Physics Department,, Vanderbilt University.\nWilton W. Cook, Division of Fine Arts, University of Texas.\nAllen Miller, Director, KWSC, State College of Washington."
}