{
  "id": "d1723-8",
  "text": "- 9 -\nWISCONSIN: William F. Rasche, Director, Milwaukee Vocational and 4dult Schools.\nHarold Engel, Director, WHA, University of Wisconsin.\nPUERTO RICO: Jose A. Guitrago, Director, Radio Station WIPR, Department of Educa¬\ntion, San Juan.\nWISCONSIN REGENTS APPROPRIATE 105,750 FOR TV LABORATORY\nUniversity of Wisconsin regents recently set up a \"closed circuit\" television labora¬\ntory for teaching and research in the new medium. They appropriated $105,750 for\nequipment and for remodeling space in the Old Chemical Engineering Building which\nthey assigned for the project.\nLast May the regents indicated their approval of this project and at the same time\nauthorized the University Radio Committee to work with the State Radio Council on a\nlegislative request for funds to construct « a TV station or stations.\"\nThe regentsf action provides practically all equipment necessary for telecasting ex¬\ncept a transmitter. Experimental productions in the \"closed circuit\" laboratory will\nbe seen in University viewing rooms and will not go out over the air. In June, re¬\ngents approved an operating budget of $22,820 for the \"closed circuit\" laboratory\nduring the 1952-53 year. '\nProf. H. L. Ewbank, chairman of the University of Wisconsin Radio Committee, explained\nthat the laboratory would provide the training necessary to prepare a staff for ulti¬\nmate operation of a state TV station or network, if such plans receive legislative\napproval.\nProf. Robert Pooley, who headed a special subcommittee which drew up the \"closed cir¬\ncuit\" proposal, predicted that \"television may well prove to be our most economical\nform of education.\" He indicated that the research expected to be carried on in the\nlaboratory may be its most inportant function. \"There is much that is unknown about\nthis medium that only scientific investigation can determine,\" he said.\nThe regents* action provided funds for three complete canera \"chains,\" calbe to link\nstudio and viewing rooms, lighting and scenery, monitor receivers, a mobile unit,\nphotographic equipment, and a kinescope recorder and processor. A $6,0G0 item is\nincluded for remodeling the north half of the basement and first floor of Old Chemical\nEnginnering Building for studios*\nPOSITION WANTED\nExperience in radio and TV. B.S. degree from U. of Texas *Uj. Radio copywriter for\ncommercial agency; work with NBC-TV; TV director for Texas ad agency; free lance\nwriting; teaching experience in TV and radio courses at Texas Christian U. Seeks\nteaching position in a University interested in developing a program of study in\ntelevision. Please write to Miss Pat Crauston, UJUX7 East Lancaster, Ft. Worth,\nTexas, for full details and references.\n**<&■£•&■if # # -?«• -M* 4S* # * # # 4t- * * # * * * * ■* # & *\nATTENDANCE AT THE ANNUAL CONVENTION IS NOT LIMITED TO NAEB MEMBERS* EXCEPT FOR A\nFEW BUSINESS SESSIONS ALL THE MEETINGS ARE OPEN TO EVERYONE* IF YOU ARE INTERESTED\nIN EDUCATIONAL BROADCASTING — RADIO OR TELEVISION — YOU ARE WELCOME AT THE ANNUAL\nMEETING IN MINNEAPOLIS. REMEMBER THE DATE AND PLACE:\nNOVEMBER 6-7-8; MINNEAPOLIS"
}