{
  "id": "d1727-1",
  "text": "NAEB NEWS LETTER.........April 15, l£4LV,\nKENTUCKY TRAlNfNG WOMEN (cONT'd)\nA CLASS IS BEING ORGANIZED THERS TO TRAIN WOMEL T - OPERATE THE\nCONTROLS t'N THE STUDIO, AMO PR ACT I CAL EXPCR lEGYG t BE GIVEN\nIN THE WORK. NO PREVIOUS TRAINING OF ANY KING-IS NECESSARY.\nPEFENSC REGREAT I ON CENTER ON J*JLY.-C\nThe Defense Recreation Center where service men invariably head\nWHEN THEY*RE LOOKING FOR AN EVEN I MG *S ENTERTAINMENT IN NEW YORK,\nBEGAN PROV t 0* HQ ' : . -T FOR ALL New YORKERS TUESDAY., App i L\n14. On that date, - f: o.; Recreation Center began a radio\nSERIES^ ENTITLED 11£.!? F;.:U1 ShoWCAJS£w TO 4E .H£ARO EACH WEEK OVER \nNew York* City*s Own Station 'V-:vc.\nThe show features interviews with men from all branches of the\nARMED SERVICES CONDUCTED BY 'THE FAMOUS NAMES OF THE THEATRE* 1N\nADDITION, THERE IS ENTERTAINMENT 8Y THE ENTERTAINMENT UNITS FROM\nTHE MANY CAMPS IN THE MEW YORK AREA AND A TALK BY A \"GUEST OF THE\nWeek” one of the many men and women engaged in helping the men\nFEEL AT HOME IN THE BIGGEST CITY IN THE WORLD.\nYOUTH SPEAKS FOR ITSELF\nSix transcribed programs, \" Youth Speaks for \\ 7 3 elf 11 and five pro¬\ngrams IN THE SERIES, \"-YOUTH TELLS ITS STORY,1' ARE AVAILABLE TO\nANY AND ALL NAEB MEMBERS WISHING THEM} FOB URBANA. MANY OF OUR\nMEMBER STATIONS HAVE ALREADY RUN THE SERIES, GUT IN CASE YOU\nhaven8t,set is available in office of Executive Secretary.\nFA 10 YOUR DUES?\nIn checking recq; •• :.ACr; for 1942 we note one or twoj4€Mbers%\nhaven^t forwarded Trea surer WT IGriffith? w5T| Ames,\nIowa. Let’s clean and clear the records for 1942*\nF. C. Co ACTIONS\nWHCO, Cornell University, wag granted renewal of license for\nPERIOD ENDING FEBRUARY !, 1944* (4/5/42)\nWNYE, Board of Education, New York City, was granted modification\nof construction permit, extending completion date. (4/3/42;\nWBEZ, Board of Education, Chicago, was granted extension of\nPLETION DATE ON ITS FW CONSTRUCTION PERMIT TO JULY ?, 194c.\nWMYC City of New York, had oral argument before j*.ca •\nAT I ON OF LICENSE TO INCREASE HOURS v. F"
}