{
  "id": "d1463-14",
  "text": "uBig Time Radio Hopefuls Find Only Refuge\n(Herald-Tribune — August 3, 1947)\nTT ,?£e.,of WNYC’S lesser-publicized functions came in for notice during 1947 by one of the leading metropolitan dailies, The New York\nHerald-Tribune.\nfunction. WNYC s quietly conducted, continuous job of serving as a training school for many young people who want to get into\nradio but do not find any opening niches for themselves in commercial radio.\nHere is part of what the article had to say about WNYC’s job:\n“For something like thirteen years WNYC has conducted a kind of year-round ‘summer theatre’ of radio for young hopefuls. It has kept its\ndoors open to everyone and anyone who wanted a chance at radio and who showed some talent or promise.\n“Institutions too take advantage of WNYC’s plan. The City College has a Radio Workshop which presents plays over the city station,\n^ard College in New York and Bennington College in Vermont send down volunteers to work at the station. Antioch College, of Yellow Springs,\nUnio, sends from one to ten students to WNYC for a six-week training period in all non-engineering phases of radio.\nAbove all, there is time at the station—time that the networks do not have. There is time to educate an actor not to ‘plop’ the mike; to\nteach a sound-effects man how to cue records; to train a writer to develop an ear for language as it is spoken; to teach a director what a ‘level’ is\nand what it means; to tram a producer in what his sometimes nebulous job really is . . .\nxt ‘‘A.lth°ugh thC Statj°n manaSement realizes that it would be simpler to run a program day entirely from its musical record library, Mr. Seymour\nN. biegel, the program director, says: ‘We encourage and promote dramatic programs because we feel that it is definitely part of our function here\nat the municipal station to give talented would-be’s a chance to crack the tough and often intimidating field of radio.’ ”\nThe article ends with a statement that typifies WNYC’s position as the leading />erjo«a/-station in the metropolitan area. It says:\nwxTV^USiar-the n°rk HaS g°ne, °n unheralded and there’s little likelihood that medals are going to be struck off for the opportunity that\nW . e.nng a11 y°u”g People who dream about going into radio. But from the men and women who have served their radio apprenticeship\nat WNYC in its year-round summer theatre’ there are unspoken thanks. For the voun? neonle nnw f anrl momr mnro 1U___\n- - .- “-- Li.v. nuw incic aim uie many more to come, it is nice an\nisland of refuge that stands out in a sea of $35 hand-painted ties, advertising account executives, closed doors and the impersonal towers of marble\nand glass of the networks.\nJust Another Example of WNYC’s Functional Relationship With the People It Serves\n- 13-"
}