{
  "id": "d1463-38",
  "text": "Frequency Modulation... First in New York\nAs of the writing of this report the new Western Electric 10 Kilowatt FM transmitter was being\nshipped to the City Station. This new transmitter promised WNYC-FM an enormous increase m\npower and coverage. In effect, with the installation of a Western Electric Cloverleaf Antenna, WNYC-\nFM would have an effective radiated strength of 20,000 watts ... as powerful as any FM station in the\nNew York City area.\nThe new transmitter promises to be at least ten times more powerful than the old 1 kilowatt FM\ntransmitter although the position and type of the new antenna promises something like twenty times\nmore power.\nInstallation of the cloverleaf antenna, which has been completed, was a unique achievement. The\nthirty foot steel tower weighed about three thousand pounds and it had to be raised from the twenty-\nfifth floor of the Municipal Building to the thirty-ninth floor. Brooklyn Bridge Ironworkers, with the\nassistance of the station’s engineering staff, completed the job in only three.hours. There it now stands,\n535 feet above the street.\nThe entire unit, when completed, is expected to furnish a strong, static-clear signal in a sweeping\ncircle one hundred miles in diameter. With its effective radiated power of 20,000 watts WNYC-FM\nwill step up into the F.C.C. Class B FM station rating.\nWNYC-FM will share all the carefully integrated programming available to WNYC and the two\nstations will continue to serve the public in the same manner which has won the Municipal Broadcasting\nSystem award after award.\nDESCRIPTION OF EQUIPMENT:\nTRANSMITTER\nCode Number:\nFrequency Range:\nPower Output:\nWeight:\n506B-2 Radio Transmitting Equipment ___, _ . ,\n88 to 108 megacycles. Any specified frequency in this range. (The F.C.C. has assigned WNYC-FM 93.9 megacycles as its\n10,000 watts (effective radiated strength at five hundred feet with 54A Antenna is 20,000 watts).\nApproximately 5,700 pounds.\nANTENNA:\nCode Number:\n54A Antenna (Cloverleaf)"
}