{
  "id": "d1463-4",
  "text": "The Discussion of Public Issues ... FORUMS\nThe heart of any democracy is free, public discussion of public issues. In this respect radio has an enormously\nimportant responsibility to its listeners. WNYC regularly meets this obligation with varied, complete programming.\nIn 1947 WNYC provided time in its program log for forum discussions covering a wide range of topics.\nAmong the city colleges participating in WNYC’s forum of the air was Brooklyn College. Some of the topics\ndiscussed included: “Should New York Have a State University?”; “Opportunities in Adult Education''; “Must\nWe Have Strikes?”; “Developments in the American Theatre”; “What May We Expect From U.N.?”; “Whose\nBusiness Is Social W elf are?”; “The Problem of Displaced Persons”; “Women in Politics”; “Are the Schools Respon¬\nsible for What We Are?”; “What of the Veteran Now?”; “Your Life Is in Danger”; “The Third Party in 1948”;\n“The Status of Religion Under the U. S. Constitution”.\nOne of the most important public issues WNYC provided airing for was the topic of the five cent subway fare\nas it was covered in the transit hearings in February of this year. The transit hearings lasted two days and two nights.\nWNYC broadcast the entire hearings in which hundreds of representatives of various organizations, as well as indi¬\nviduals themselves, appeared before the City station microphones to express their views on this issue. As a result of\nthese broadcasts thousands of pieces of mail were received and there is reason to believe that the airing of these hear¬\nings had a great deal to do with the crystallization of public opinion and with a fuller understanding of the many\nproblems involved in the issue.\nIt goes without saying that no other station in New York City provided this service, for which WNYC was\ngranted special permission by the F.C.C. to remain on the air past the usual sign-off time.\nThe literature of a nation is one of the strongest streams in the culture of a people. Intelligent, critical evaluation\nand discussion of the major literary works of our times were handled on The Reader’s Almanac. In 1947 the Reader’s\nAlmanac, conducted by Professor Warren Bower of New York University, discussed such books as: “Modern Woman:\nThe Lost Sex”; “Betrayal in the Philippines”; “Out of Your Pocket” (cartels); “Final Judgment: The Story of\nNuremberg”; “Tomorrow's Food”; “The Greek Dilemma War and Aftermath”; “Man Against Myth”; Fields of\nWonder” (poetry) ; “Angry Men—Laughing Men” (Puerto Rico problem) ; “The Role of the Jewish Book Council\"\n(Rabbi B. J. Bamberger, speaker) ; “A Short History of the Opera”; “Eugene O'Neill: The Man and His Plays”;\nand others.\n-3-"
}