{
  "id": "d1463-5",
  "text": "HEALTH... The People's Number One\nConcern in Piny Year\nStill number one in anybody’s concern is the concern about one’s health — the personal inventory that added up\nto how he felt. To keep people informed on the facts of a variety of health topics WNYC carried:\nThe New York Academy of Medicine’s “Lectures to The Laity”.once monthly in 1947\nHealth Department of the City of New York Health Talks.once weekly in 1947\nThe Oral Hygiene Committee’s series on Dental Health.once weekly in 1947\nThe Medical Society of the County of New York Talks...°npe weekly in 1947\nThe New York Tuberculosis and Health Association Talks.twice weekly in 1947\nThe Bronx County Medical Society Health Talks.once weekly in 1947\nThe Kings County Medical Society Health Talks...once weekly in 1947\nA vital part of health is diet and nutrition. In order that the widest, most complete and accurate news about\nfood and health might be spread, WNYC arranged for a number of regular broadcasts by nutrition experts. They\nincluded:\nThe City Consumer’s Guide with Mrs. Frances Foley Gannon of the Department of Markets, with complete news about\ndiet and the availability of vital foods on the current market. Five times weekly throughout the year of 1947.\nNutrition News with Margaret Conner, Health Department nutritionist.\n“How Does Your Kitchen Fare?” Special nutrition series under the auspices of the American Women’s Volunteer Service\nfeaturing talks by prominent nutrition experts.\nBrief, capsule health tips are the easiest way to carry through public health indoctrination. WNYC carried\nseveral hundred tips for good health through its spot announcement packets.\nBiggest health break in 1947 was the threatened smallpox epidemic. When the smallpox epidemic last spring\nstruck this city, with its terrifying possibilities, WNYC became the spearhead of the inoculation campaign, broad¬\ncasting talks and appeals by New York City’s Health and Hospital Commissioners, repeatedly advising listeners of\nvaccination centers, relaying authoritative suggestions for coping with what could have been a major disaster to this\nCity. Among other appeals for cooperation with the City’s Fight-Smallpox Campaign, WNYC aired a delightful,\nspecially commissioned “Fight Smallpox” singing jingle. Unlike most compositions of that kind, the “Get-Vacci¬\nnated” jingle received considerable critical approval.\n-4-"
}