{
  "id": "d1463-6",
  "text": "For Better Understanding of GOVERNMENT\nIn order to help the various branches of the municipal government to bring their story to the citizens of New\nYork, WNYC arranged the programs listed below.\nThey serve multiple purposes. For one thing they assist in establishing an understanding between the agency and\nthe public; they provide a definitive account of the agency’s work and they aid the agency in rendering a more complete\nservice to the public.\nAbove all, it is the translation of city government to the people from whose support any democratic city gov¬\nernment derives its powers. It gives the public a body of factual impressions and a base from which it can intelli¬\ngently discuss, critically evaluate and fully appreciate the work of all municipal services.\nPartial listing of programs presented by city departments:\nBoard of Education:\nDepartment of Health:\nDepartment of Correction:\nPolice Department:\nFire Department:\nDepartment of Markets:\nDepartment of Parks:\nDepartment of Welfare:\nCivil Service Commission:\nSanitation Department:\nDepartment of Hospitals:\nCity Rent Commission:\neleven programs weekly throughout school year of 1947.\nsix programs weekly throughout the year.\nprogram series once weekly.\nnine programs weekly throughout the year.\ntwice monthly throughout the year.\nfive times weekly throughout the year.\nonce weekly throughout the year.\nonce weekly throughout the year.\nonce weekly throughout the year.\ntwice monthly throughout the year.\ntwice monthly throughout the year.\nonce weekly throughout the year.\nThe other departments share in radio time on the special events schedule, a copy of which will be found in another\npart of this report. Special program time was made available for announcements concerning various departments\nof the city not included in the above listing or in the special events schedule.\nIn 1947 WNYC’s cooperation with other city departments was, as it has always been, on a high level.\n-5-"
}