{
  "id": "d1139-0",
  "text": "N A £ B N E W S L S T T £ R\nNATIONAL ASSOCIATION OF EDUCATIONAL 8ROADCASTERS\nFrank £. Schooley, Editor* Station WILL* UrBana, III,\nDecember I, 1943\nNAEB URGES BAND RESERVATIONS FOR EDUCATION\nMeeting in conjunction with the School Broadcast Conference in Chicago on\nNovember 29, NAEB unanimously passed a resolution urging adequate provision\nBE MADE FOR EDUCATION IN ANY FUTURE ALLOCATION OF BROADCASTING FACILITIES,\nThe resolution follows:\n\"Foreseeing the possible and probable use of FM by education immediately\nAFTER THE WAR AND RECOGNIZING the NECESSITY FOR HAVING ADEQUATE FACILITIES\nAVAILABLE, THE NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS AOVOCATES5\n•|. The reservation of ten channels in the spectrum for use of education*\nAND THAT THESE CHANNELS BE ADJACENT TO THOSE RESERVED FOR COMMERCIAL FM\nBROADCAST INGo\n\"2. TMAT MORE ADEQUATE PROVISION BE MADE FOR USE OF FM RELAY STATIONS BY\nRESERVATION OF SEVEN OR MORE SUCH FREQUENCIES FOR EDUCATION.\n\"3. The reservation for exclusive use of education, two channels in any\nassignment of such frequencies for television and that such channels shall\nBE adjacent to any assigneo commercial television.\"\nA copy of the resolution has been forwardeo to Commissioner John W.\nStudebaker of the Office of Education, urging the efforts of his office\nIN BEHALF OF ADEQUATE RESERVATION OF BROADCASTING FACILITIES FOR EDUCATION\nIN THE POST-WAR ERA BY THE FCC,\nKENT RECEIVES SBC \"AWARD OF MERIT”\nThe Fourth annual \"Award of Merit,\" presented each year by the executive\ncommittee O'f the School Broadcast Conference for \"outstanding and meri¬\ntorious service in educational radio\" was made to Major Harold W# Kent,\noirector of the Radio Council, Chicago Public Schools and president of\nthe Association for Education by Radio, on military leave in Washington.\nMajor Kent was selected by the sponsoring committee of the School Broad¬\ncast Conference: composed of 50 leaders in the educational field of radio\nFOR HIS SERVICE to RADIO BOTH AS AN EDUCATOR AND AS a WARTIME MILITARY\nOFFICER. The \"Award of Merit\" in previous years has gone to Judith Waller,\nPUBLIC SERVICE DIRECTOR, MI0WE3T DIVI8I0N, NBC, CHICAGO; STERLING MSHER,\nASSISTANT TO THE EDUCATIONAL COUNSELLOR, NBC, AND ROBERT HUDSON, DIRECTOR\nof the Rocky Mountain Radio Counoil, Denver.\nNOTES FROM CHICAGO MEETING\nThe Association also voted to provide the A£R JOURNAL with a series of\nARTICLES ON NAEB STATIONS. MORE DETAILS WILL BE SUPPLIED IN A LATER ISSUE\nOF THE NEWS LETTER....Nov IK, WNYC, was unable to attend because of oeath\nOF HIS CHIEF ENGINEER AND CLOSE FRI END....QeaN CaLDWELL OF OREGON DIED"
}