{
  "id": "d1139-2",
  "text": "NA£6 NEWS UETTERo.Page .February 8, S944\nSENT I NG A NEW SERIES OF PROGRAMS ENTITLED \"JjUNIOR CITI2ENS SERVE*. Ued BY\nIrene Wicker (\"The Singing Lady\") the program presents New York children\nFROM THE CITY*S SCHOOLS AND OTHER ORGANIZATIONS DESCRIBING THEIR TYPE OF\nVOLUNTEER WAR WORKo\nThe Junior Citizens Service Corps is the junior branch of the U. S. C|T|2eNS\nService Corps, and part of the army of unpaid civilian workers mobilized\nTO DO THE MANY NECESSARY CIVILIAN WAR JOSS THAT MUST BE DONE TO KEEP THE\nHOME FRONT STRONG.,\nF-M BROADCASTERS MEET J[H NEW YORK CtTY\nSchools and colleges throughout the country are greatly interested in the\nPOSSIBILITIES OF FREQUENCY MODULATION BROADCASTING FOR USE IN EDUCATION.\nThose are the words of Dr0 William D. Boutwell of the Feoeral Office of\nEducation.\n0r6 Boutwell told a meeting qf FM broadcasters, January 27 that more than\n25 SCHOOLS OR COLLEGES HAVE SUBMITTED APPLICATIONS FOR FM LICEN8E8, OR PLAN\nto do so. Furthermore, he said fifty state colleges have appointed officers\nto study FM opportunities* And 85 state departments of education have\nASKED THE UNITED STATES OFFICE OF EDUCATION TO PREPARE PLANS TO BRING\nEDUCATIONAL RADIO PROGRAMS INTO EVERY SCHOOL IN THEIR RESPECTIVE STATES*,\nDr6 Boutwell continued; !,8y state FM networks, the best in educational\nRADIO WILL BE BROUGHT TO THE MOST ISOLATED ONE~ROOM SCHOOL*\" THE EDUCATOR\nLISTED TYPING, SHORTHAND AND 8AND MUSIC AS SUBJECTS THAT COULD BE TAUGHT\nBY FM RADIO.\nTHE CHAIRMAN OF THE FEDERAL COMMUNICATIONS COMMISSION, JAMES Fly, HAS\nSUGGESTED THAT THE EXCELLENCE OF FREQUENCY MODULATION TRANSMISSION WILL\nDESERVE A HIGH QUALITY OF RADIO PROGRAM AFTER THE WAR. FLY TOLD REPRESENT¬\nATIVES OF THE BROADCASTING INDUSTRY THAT RADIO EXECUTIVES SHOULD START NOW\nTO DETERMINE FUTURE PROGRAM STANDARDS. He SAID PRESENTING WHAT HE TERMED\nEMOTIONAL QROOLERY OF SOAP OPERAS IS A WASTE OF THE HIGHLY DEVELOPED\nFREQUENCY TRANSMISSION.\nFly POINTED .OUT THAT THE CHALLENGE OFFERED BY FM TO THE PLANNING AGENCIES\nOF RAD IO o He said THAT CURRENT RESTRICTIONS ON RADIO MANUFACTURE AFFORD\nAN OPPORTUNITY TO THE INDUSTRY TO EMPHASIZE SOUND, LONG-RANGE PLANNING.,\nThe convention of FM broaocasters incorporated, heard the opinion that .\ntelevision and frequency modulation broadcasting compete with each other\nONLY TO a LIMITED EXTENT. The CHIEF ENGINEER OF THE FEDERAL COMMUNICATIONS\nCommission, £, K. Jett, told the convention that each sbould be able to stand\non its own feet. Jett believes that ultimately both branches should have\ntwice as many channels as are now available.,\nSECOND FARM AND HOME WEEK ON W 0 8\nProfessor Wc 8. Griffith, Director of WO! and NAEB treasurer writes;\nHWe are GETTING ALREADY TO LAUNCH OUR \"SECOND Farm AND HOME WEEK BY A|RH\nFebruary 7 to 18 inclusive. We will broadcast about two hours and forty\nMINUTES OF MATERIAL EACH DAY OF SPECIAL \"FARM AND HOME WEEK1* PROGRAMS. We\nHAVE SENT A REPRESENTATIVE TO WASHINGTON, C. TO SECURE TRANSCRIPTIONS"
}