{
  "id": "d1139-3",
  "text": "NAE8 NEWS LETTER\nPage 4\nDecember I, 1943\nIn the series* \"Living Books*11 on K F K U at 9:30-10:00 p.m., Wednesdays*\nTHE STATION PROPOSES TO EXAMINE SOME OF THE GREAT BOOKS THAT STILL HAVE\nA GREAT OEAL TO SAY ABOUT OUR ST ANOARDS—THE VALUES THAT WE SET UP OR FAIL\nTO SET UP.\nThe APPROACH TO THE9E books will be non-techw ical. a group of professors\nin the University will discuss each of them, from the standpoint of their\nHUMAN INTEREST, THEIR REFLECTION OF LIFE. \"WHY HAS THIS BOOK LIVED?\nTHEY WILL SAY IN EFFECT. \"WHAT DOES IT HAVE TO OFFER TO US NOW?1 HENCE\nOLD AS WELL AS NEW BOOKS, FROM HOMERlS ODYSSEY TO CONTEMPORARY DRAMA WILL\nBE CONSIDERED. THE TEST OF A BOOK WILL BE ITS CONTRIBUTION TO THE UNDER¬\nSTANDING OF THE HUMAN SPIRIT IN ITS PROBLEMS AND ITS ASPIRATIONS.\nW K A R CARRIES STATE DEPARTMENTAL SERIES\nAs EARLY AS 1925* THE DATE OF THE EARLIEST PRINTED PROGRAM OF THIS STATION*\nDEPARTMENTS OF STATE GOVERNMENT HAVE BROADCAST OVER WKARC °URING THE\nINTERVENING YEARS ALMOST EVERY AGENCY OF THE STATE HAS, AT SOME TIME* USED\nTHE STATION. SOME DEPARTMENTS HAVE CARRIED A WEEKLY BROADCAST OVER A LONG\nPERIOD. AS A PUBLIC SERVICE STATION* WKAR HAS ALWAYS WELCOMED THE OPPORT¬\nUNITY TO PROVIDE A MEANS OF KEEPING LISTENERS INFORMED OF THEIR GOVERNMENT.\nSix DEPARTMENTS ARE SCHEDULED EACH WEEK DURING DECEMBER. THE DEPARTMENT\nof Agriculture is heard on Tuesday at 1:00 p.m. On Wednesday the Department\nor Health broadcasts at 1:00, and the Civil Service Department at 3:15.\nThe State Historical Commission presents glimpses of the past in Michigan*\neach Thursday at II:00 a.m. The State Highway Department ano the Department\nof Public Instruction are heard at 1:30 and 2*00 p.m. on Friday.\nWHA OFFERS NEW MUSIC PROGRAM LISTING\nWHA1S NEW FREE LASTING OF CLASSICAL MUSIC PROGRAMS FOR THE COMING MONTH\nHAS BEEN ENTHUSIASTICALLY RECEIVED BY LISTENERS. CONCEIVED BY MUSIC\nDirector Don Voegeli six weeks ago, the project will probably remain as a\nPERMANENT FREE SERVICE TO WHA LISTENERS.\nCo-operation of the record companies makes possible the listing of Music\nof the Masters, Masterworks of Music and Music You Want. The titles of\nFEATURED WORKS ARE MIMEOGRAPHED ON A DOUBLE-FOLDED LEGAL SI2E SHEET OF\nM & MCO STOCK, USED SIOEWAYS, WITH A PRINTED HEADING \"CLASSICAL MUSIC\nWHA Program Schedules.\" Each program occupies a third of the sheet and is\nCONTINUED ON THE REVERSE SIDE.\nThe first 5i days* mail brought 202 requests. The free listing is being\nPROMOTED BY Don THROUGH MUSIC STORES, RECORD SHOPS AND MUSIC COLUMNS.\nMAIL REQUESTS ARE ON THE INCREASE.\nAppreciation of wha‘s generous classical music programs gomes with most\nrequests. \"Your wonderful programs are an antidote for the strain of the;\nEVER-PRESENT WAR SITUATION....\" \"I AM A MUSICIAN WHO MOVED AWAY FROM CITY\nNO 18CS, NOW THE ONLY ENJOYMENT I GET IS FROM WHA RADIO STATION.... AND\nAN ENGINEERING FIRM IN WaTCRTOWN WROTE FOR THE SCHEDULE, EXPLAINING THAT\nTHE MEN IN THE SHOP LISTEN TO WHA13 MUSIC PROGRAMS.\nAND ON A POST CARD CAME THE REQUEST \"PLEASE SEND FREE MUSIC SCHEDULE ANO\nMIMEOBBAPHED SHEET ON RAISING CALVES.\""
}