{
  "id": "d1873-0",
  "text": "Urbana, Illinois\nJuly 19 1940\nFCC CBAHGJSS OPEHixTI ON RULES\nNaEB stations should check now their operating schedules to be sure\nthey are now complying with rule Section 3.71 as modified recently\nby the Corami s si on. To make sure of interpretation your secretary\ninquired of the Commission. The reply from Mr. T. J. Slowie,\nSecretary of the FCC is quoted below;\n\"Replying to your letter of June 8, the modification of Section 3.71\nso as to require operation two-thirds of the hours between 6:00 aj,\nand 6:00 p.m. and 6:00 p.m9 to midnight was not* in fact* considered\na modification of the meaning of this rule but rather a clarification*\nThe present rule requires that two-thirds of the total hours that the\nstation is authorized to operate during each broadcast day (both day\nand night) must be utilized. Day and night are defined as the hours\nstated above. Under the Section before modification, it was the\nintention to require operation just as now required oy the modified\nrule.\n\"It is true that certain stations that are permitted to operate after\n6:00 p.m, are required to operate two-thirds of the hours authorized.\nIt is generally considered that these are the most desirable hours\nand it is not thought any licensee would object to this requirement.\nIf it does* in fact* work a hardship in any case* and if the licensee\nhas not interpreted the previous wording as to require such operation,\nthen upon a showing in any individual case* undoubtedly the Commission\nwould modify the rule as applying in such case so as best to serve\nthe public interest*\" (Signed) T. J* Slowie\nsection 3.71 - Minimum operating schedule - was amended to read as\nfollows:\n\"Except Sundays8 the licensee of each standard broadcast station\nshall maintain a minimum operating schedule of two-thirds of the\ntotal hours that it is authorized to operate between 6 a.m. and 6 p.m.,\nlocal standard time, and two-third* of the total hours it is authorized\nto operate between 6 p.m. and midnight, local standard time, except\nthat in an emergency when, due to causes beyond the control of the\nlicensee, it becomes impossible to continue operating, the station\nmay cease operation for a period of not to exceed 10 days, provided\nthat the Commission and the Inspector in Charge shall be notified in\nwriting immediately after the emergency develops.\"\nEarly morning broadcast service to many rural sections now denied\nsuch service is invited oy Federal Communications Commission action"
}