{
  "id": "d662-46",
  "text": "EXCERPTS PERTAINING TO JEFFERSONIAN HERITAGE FROM JSM\nLETTER TO SIEGEL — July 30, 1952\nRegarding the printing of the Jefferson folder j although we received our copy\nof your letter to Wartik yesterday, Wartik1 s original didn*t arrive until just\na few minutes ago. We are now clear on the exact wording of the overprint and\nwill follow your copy exactly* The overprinted copies will now number 250,000.\nWe will, in addition, send 20,000 blank copies to you in NewXork. The remaining\n80,000 we will distribute to member stations from headquarters.\nWartik tells me that the cost of overprinting was not included in the original\nestimate. This cost will run from $100 to $150. Compared to the total cost,\nthe sum seemed insignificant. **ence, I have authorized it. If you think it\nunwise, please call me at once and we will get it stopped.\nAs you know. Bill Harley is re-editing the first four Jefferson programs. He\nhas promised to have some of these to me wit in the next week or ten days. We\ncould proceed to duplicate the Jefferson shows immediately and send them out\nseveral weeks in advance of our regular mailing. There would be only a slight\nadditonal expense so that does not matter, but we are afraid that it will be\nvery confusing and that we may get some stations jumping the gun. We will\nundoubtedly be making our first mailing to stations undent he new direct system\nsomewhere around September 5* I would prefer to hold the Jefferson programs nid\nhandle theimdth the rebular mailing. What do you think?\nI have watched with great interest the storiesin the various trade publications\non the Jefferson series. This certainly has given us excellent coverage.\nI trust that you have heard from the man at the Roger Brown Agency by now re¬\ngarding a proposed story they want to do on this series, pointing up the use of\ntape recordings. I was at a considerable loss to give him definite information\nfor his proposed story and, hence, referred him to you. I hedged considerably,\nmaybe more than was actually necessaiy, because I did not know your plans. Would\nyou kindly give me your latest thoughts on publicity release dates, particularly\nfor the Russian series but also for the iridchhkkk various other programs you are\nproducing."
}