{
  "id": "d662-50",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n2500 Municipal Building New York 7, N. Y.\nTO STATION MANAGERS OF ALL NAEB MEMBER STATIONS;\nYour Board of Directors has authorized the release of the first of\nfour series of distinguished radio programs as of September 14th, 1952.\nThe first series to be released is \"The Jeffersonian Heritage”. It\nis expected that 13 of these programs, of half-hour length, will be\nmade available to you by NAEB's Tape Network.\nThis is a truly outstanding series of which all of us can be extremely\nproud. The programs are based on the research, writings and advice\nof Professor Dumas Malone of the Department of History of Columbia\nUniversity. They have been produced and directed by Frank Papp,\nand have been written by Morton Wishengrad and Milton Geiger.\nSpecial music was composed and conducted by Wladimir Selinsky, and\nthe shows star Mr. Claude Rains as Thomas Jefferson.\nYou will be receiving, in the mails, the following materials to assist\nyou to build audiences and promote listening to these shows:\n1) Special two-color folders are being printed by the\nUniversity of Illinois. A minimum of a thousand\nwill be sent to each station, and more if you re-\nrequest same. You should be prepared to mail\nthese from one to two weeks prior to the first\nprogram.\n2) You will receive blanket releases which you can copy\n(filling in your own station call letters, and setting\nforth the time, date and day that you will be schedul¬\ning the program). A different release is being prepared\nfor each half-hour program. These should be mailed\nto your local newspaper radio editors from ten days to\ntwo weeks prior to air time.\n3) Two national releases are being sent to every radio\neditor in America.\n4) Several thousand individual letters are being sent to\nopinion-makers, including editors, preachers, doctors,\nlawyers, college presidents, legislators, et al, calling\nattention to the fact that these programs are being broad¬\ncast over the educational radio stations of America.\nI need not emphasize to you that this will make a tremendous impact\nand represents a tremendously successful effort by the members of\nyour Adult Education Committee - Messrs Probst, Hull, McCarty,\nWheatley, and the undersigned, as well as Mr. William Harley,\nwho has served a^ Project Director"
}