{
  "id": "d370-1",
  "text": "KilBICI CORPORATION' OR AMIKKA\nIWDIJgmiAL ELECTRONIC PM.©»UCI\"rS\nCJi^ailSIBK' WEW^ERgET\nJanuary 16, 1962\nMr. William G. Harley\nPresident\nNational Association of\nEducational Broadcasters\n131j6 Connecticut Avenue\nWashington 6, D.C.\nDear Bill:\nIt is time that I gave you some indication as to where\nwe stand on the possibility of helping NAEB underwrite the cost of\nadding a Director of Development to its staff along the lines we dis¬\ncussed prior to the NAEB Convention last October.\nWhile I encountered some interest when I \"sounded out\"\nseveral of my industrial acquaintances about the possibility of making\nthe support of the NAEB Director of Development an Industrial Associates\nproject, it was quite apparent that a relatively \"hard sell\" effort\nwould be required to push the several companies involved to the point\nof making a commitment. While we all have high regard for NAEB, we all\nalso operate on relatively limited promotion budgets* I also noted con¬\nsiderable concern about the precedent involved; an initial contribution\nby industry to launch a new staff service may lead to moral obligations\nto continue such contributions in subsequent years.\nAfter the convention, I decided to postpone the \"hard sell\"\nactivity needed to promote this project until such time as I had assurance\nthat we at EGA. would be prepared to do our share. I placed in my budget\nproposal for 1962 an item to cover what I considered our share of the\n$25,000 that you estimated would be required to support the Director of\nDevelopment. In the closing weeks of 1961, however, there were major re¬\nvisions in the organizational structure of RCA, resulting from the resig¬\nnation of Mr. Burns. Among the changes was the transfer of my Educational\nElectronics activity from the Broadcast Division to the RCA Service Company,\nwhich is now responsible for virtually all of the educational services of¬\nfered by the Corporation. While I shall continue to operate essentially\nthe same as in the past, my budget must be held at the 1961 level, and I\nsee no way to stretch this budget to include a significant contribution\nto NAEB beyond our normal Industrial Associates assessment.\nRCA Pioneered and Developed Compatible Color Television"
}