{
  "id": "d1183-11",
  "text": "-12-'\nU.S, PUBLIC HEALTH SVC. IN NATIONAL RADIO DRIVE AGAINST V.D_._\nSponsored by the United States Public Health Service and produced by Columbia\nUniversity’s. Radio Program Bureau, headed by Eric Barnouw, the most comprehen¬\nsive educational drive in the nation’s history on venereal disease.Will get un.ei\nway this fall. ‘ ■\nThe f irst radio attack on VD ever attempted on a\naid of hundreds of local and educational radio outletg^^s^J^_iLkiJ!yi^^§.\nscries of dramatic transcriptions. documentaries\nal ideas ‘and, material. The 50 stations of the National^s^kllQ^.^Offl^pi:.^\"'\nal Broadcasters and affiliated outlets are' expected^ojJUy^jaro^^^\nthe drive>\nOne of the first U.S. stations to break'the taboo against educational V.D.\nmaterial on the air was N-A-E-B station KOAC (Oregon State College) when\nspecial series under direction of Allen Miller was presented. At that\ntime KOAC received a special VARIETY magazine award for the series.\nIncluded in the program kits are eight dramati_c_shows, foatoiji£^Ma£gOi^dd^\nAlbert. Raymond Massey, and many others. George Hicks,jfill_^ond^^f3.el^^t^‘\nviews with patients under treatment. Programs were.prepaiodjby leuding,jietwork\nwriters under diroction of Frank Papp and supervision of Eric Bajnouw.\nMICHIGAN STATE AND WISCONSIN U. IN WBKB TV TRAINING PLAN\nProfessor J. Ra Davis, of Michigan State College^ home of N-A:ErJ_.^n^r^a^ipn\n1 WTf^.and_Prnfofl.qo-j John E. Dietrich. University__pfJlisconsint.home_jDQirA=^zb\nmember\" statioi\\~YEA« were .participants in the TIBKE tr,ainlng_planj:n^hic^o-dur■\ning the week of August 16. WBKB. Balaban and Katz_TV^t3^t^and_^ldestj:V\nstation in Chicago has been operating a cooperatfev,IQr ai .\nrii-PAnt.lnn of the station manager Captain Eddy. Trainees^ in_the, cooporatiyQ.irg:in«-\nihg clan work with WBKB crews to obtain experience,under actual w.Qr£3^ig^onditions\nJOE ANTHONY LEAVES MJTUAL TO JOIN STEVENS COLLEGE_STAFF—_—.\nJoseph Anthony, writer on the MBS \"Newsreel’’ show is leaving the network to\nbecome director of public relations of Stevens' college at Columbia, Missouri.\nHe will be in charge of the school's departments of public information, alumni\nrelations, and publications.\nKUi\nfSD FIRST TO BROADCAST FROM MISSOURI BASIN DAM PROJECT\nA special events crew from KUSD(University of South Dakota) headed by its dir-\nector Irving Merrill, provided the keynote broadcast from the Ft. Randall vS.D.)\ndam site in mid-July. Using tape-recorders for background material, descript¬\nion, and on-the-spot interviews, the broadcast was later incorporated into a\nspecial documentary, with an introduction by George T. Mickelson, governor of\nSouth Dakota.\nThe Ft. Randall dam, under construction by the U. S. Army Engineer Corps is\none of the largest construction undertakings anywhere m the U.S. i-lien comple¬\nted it will be a major link in the Missouri Basin power and flood control pro¬\ngram and will provide power and irrigation for several large western states."
}