{
  "id": "d1183-13",
  "text": "-14-\nMEMTtT. HEALTH documentary scksduled_by_cbs\nColumbia BroadoastiBfi_S2SiSEL-i§-ElS!JSiS£_S_^.Q-''-Si£.'J4S--S°£!S.ei^ffi2jjS§Sl|BS_HiSli\nm^TFi n-sr ftrnnl(j Perl- wh0 gci^j!s_^-liaLt-la?t .Aqa^a-gt.\n^+.L'r¥lT~e\"SIetInirthe' writing after lengthy researches including-COfi:\nfSTST^TSItT^fr^als of the ?!gn^iger_clijiic_aj_ToESi£aj-£aS§&St.\nNEW YORK MJNICIFAL STATION fflYC IK GOIDBILJffiNITOi^ftRY ..CELE^ATICTj\nTOYC H-A-E-B outlet in New York City is originating all programs, except news\nduring late August and early September from special studios in Granc, Central\nPalace, scene of a month-long Educational Exposition.\nnrrioes of WNYC manager Seymour Siegel and executive officer John ,D„e_PS2gEg\nS^°“.n ,!!? ^-ln the hall\nA^STSWdth talks by David JS^i4Mj2£i£ak\nInd Mayor Win I^O^r, were aired televised by_CBo.\nCNF. ]jQRID DELEGATES ON LAGUAIDIA.JfiMOr-IAL.IES\nFormer FCC Commissioner Clifford Durr; N-A-E-B secretary Morris Novikj^and\nSaul Carson of the \"New Republic\" were anong the party which left New Yo:\nin mid-August to participate in a series of dedications of memorials to\nNew York's late mayor, Fiorello LaGuardia in four different European coun¬\ntries! The dedication will include a library in Warsaw a public square m\nLyon, France, a school in Prague, and a hospital in Italy.\nSLOAN FOUNDATION TO OFFER RADIO. AIIALDS\nThe Alfred P Sloan foundation, Inc., is to offer recognition for outstanding\nradit public service\" programs in the field of highway safety. The announcement\nmade by Arnold J. tocher, executive director of the Foundation, stated the\nnuroose was two-folds to pay tribute to the nation's broadcasters for bh i\ncontributions to highway safety and to stimulate greater participation in th\nfuture#\n\"The Foundation\", he said, \"believes radio has and will continue to play an\nimportant part in promoting highway safety.\"\nLocal regional and clear channel sta^no!ilLl§^li^^-i£^-i^~-2-^il5“l0\nindividual progjm.s^.Jive^.wardS\nhp .<7-1 yp.n for commercial and five^for__suetainin.gi programs.\nAll types of programs designed to promote public interest and act^1^,i^JraffiC\naccident prevention may be entered for awards. Shows will be evaluated for\naudience appeal, educational value, ingenuity and showmanship, coverage, and\nfrequent scheduling.\n,jn+rip„ should be submitted as brief written statements including description\nis 700 Hill Building, Washington 6, D.C#"
}