{
  "id": "d1183-3",
  "text": "-4~\nCHICAGO U'S THIRD ANNUAL RELIGIOUS RADIO WORKSHOP\nThe University of Chicago concluded its third annual religious_ra^.o_,workshop\non August 27 after discussing\"five areas of reli^ipu^brQMg^k^i.^l4A2--£^\ngoals? writing and production; utilizing radio in Qducationalrj,vprk_o_f_the_churgh;\nbuilding\"relations with listening public; and training religions broadcastors_in\nthe community and in the seminary.\nThe workshop is a non-sectarian enterprise sponsored by the federated theological\nfaculty of the University and the Joint Religious Radio Committee representing\nthe Methodist, Congregational, Christian, and Presbyterian churches in the U.b#\nand the United Church of Canada. Ross Snyder, associate professor of religious\neducation on the faculty is serving as dean of the session.\nIf the FCC Should License Networks....?\nClifford C» Durr, former FCC membert told the group that legislation empower¬\ning the FCC to license national radio networks would eliminate._the_tug^of-\nwar between the FCC and the networks._Individual stations, he pointed_out\nare caught in the squeeze of FCC regulations and the network p,ower_to_hold\nor withdraw 1 argest source of station revenue., Durr spoke at a panelsdig_^\ncussion \"Broadcasting in the Public Interest.\"\nErik Barnouw, president of the Radio Writer's Guild and head of the Columbia\nUniversity Radio Bureau and Everett C. Parker, director of the Joinu Religious\n'Radio Council were featured at the session.\n‘Barnouw told the 35 religious workers, gathered there from all parts_og_the\ncountry that there is more freedom in writing religious programs,than in any\n?other type of production. ..\nParker told the group that the lack of cooperation, between stations snd^net works\nlirTthe production of public service programs is a; more important proble^ Jlian\ncensorship. \"The extent of cooperation in many cases is limited to seelng__that\npublic service groups do not offend any of the station or netwgrk_listeners.\"\nNEW ELECTRONICS AUDIENCE' SURVEY METER IN PHILADELPHIA STUDY\nA new system of measuring radio and television audiences developed by Albert\nSindlinger is being tried in Philadelphia, answering a radio industry need\nWanted for years?', but heretofore too costly. The electronic meter is installed\nin the home receiver, registers everytime the tuning dial is turned, trans¬\nmitting a signal to a central control board. In this manner a complete re¬\ncord of every metered receiving set is obtained, and then can be totalled\nup and averages of the audiences reached. .\nSixty of the meters have already been installed in Philadelphia, and twenty\nmore are being pub in each week, NBC has signed for the new service.\nSindlinger believes the system will prove much more effective than present\naudience sampling methods of random telephone calls. He expects his meter\nto show that radio listeners are more discriminating, than generally believed."
}