{
  "id": "d1895-3",
  "text": "-4-\nYasmine Mirza, resigns at the end of October from her post as Personnel\nPlacement Director. She will return to her home in Pakistan after 3%\nyears in the United States, three years of which has been spent with\nthe NAEB. Carol T#iitcomb will assume responsibility as Personnel\nPlacement Director.\nUdell Ehrlich, who has edited the Newsletter during recent months will\nleave on October 15.\nMrs. Pat Moran, who has worked at NAB and Broadcasting Magazine will\nassume responsibility for the Newsletter and will be on hand at the\nKansas City Convention to handle press relations.\nREGISTRATION ZOOMS AS CONVENTION LOOMS\nAs of today, there are more than 500 people pre-registered and judging\nby last year, this means we can be assured of over 1,000 total attendance\nThe Muehlebach Hotel was completely booked by the last week in September.\nAll exhibit space (104 booths) is sold out.\nMain speakers include, Fred Friendly, formerly of CBS, now advisor to\nthe Ford Foundation? Dr. Donald G. Emery, Superintendent of Schools,\nScarsdale, N. Y.; and the Hon. Paul Miller, Asst. Secretary for Education\nDepartment of HEW. Mr. Miller, highest ranking education official in\nthe Government, is former President of the University of West Virginia,\nfrom which position he pushed through the State ETV application.\nHENRY NOMINATED AS PUBLIC MEMBER\nE. William Henry, former FCC Chairman, at the invitation of the President\nand concurrence by the Executive Committee, has agreed to accept appoint¬\nment as a Public Member of the NAEB Board of Directors. He replaces\nLeonard Marks who was obliged to resign when he became Director of USIA.\nFrankly, we have proceeded somewhat irregularly in this situation, since\na Public Member must be elected by the full Board. However, Staff, the\nExecutive Committee, and the two divisional Boards which have recently\nmet, have given unamimous and enthusiastic approval? hence, I felt I\ncould proceed with the liklihood that the full Board would endorse his\nselection. Since postponing his participation until the Spring meeting\nof the Board seemed an unnecessary delay - particularly since Henry\nis to receive an NAEB citation at the banquet - I felt we should go\nahead and, without waiting for the formal Board ratification, ask him\nto meet with the Board at Kansas City."
}