{
  "id": "d1299-1",
  "text": "NAEB Foreign Tour Postponed\nIn further correspondence regarding the NAEB-\nsponsored tour of foreign broadcasting facilities, it\nwas found that the cost of the tour would be be¬\ntween $2600 and $3500 per person. To get the lower\nrates mentioned in the December Newsletter, it\nwould be necessary to have 20 or more people. Since\nfewer than 20 NAEBers responded to the Newsletter\nannouncement, the plan has been dropped for this\nyear.\nDues Increased for Individual Members\nOn July 1, 1961, dues for NAEB Individual members\nwill become $10 per year, including a subscription to\nthe Newsletter and Journal, a directory of members,\nand other reports from time to time.\nAnyone wishing to do so may pay several years\nin advance at the current rate of $7.50 per year—\nif his payment is received before June 30, 1961. (Be¬\nfore March 1, send to 119 Gregory Hall, Urbana, Illi¬\nnois; after March 1, to 1346 Connecticut Avenue,\nN. W., Washington 6, D. C.)\nThe student rate of $5 and group student rate\nof $4 will remain the same. Foreign rates will be\n$12.50 per year.\nPlacement Service Moves to Washington\nAny correspondence regarding the NAEB Place¬\nment Service should now be addressed to the Wash¬\nington office. Records were transferred from Urbana\nin January, and correspondents are asked to be pa¬\ntient with any delays which may stem from the re¬\nlocation.\nNews of Members\nGENERAL\n► Installation of transmitter and associated TV\nequipment is under way at KUSD-TV, State Uni¬\nversity of South Dakota’s new station. Target date\nis April 1.\ny Eleven radio and TV officials from Indiana and\nsurrounding states will come to the I. U. campus\nthis semester to lecture to radio-TV classes.\n► The Alabama ETV network has begun to sign\non at 8:15 a.m., to function 68+ hours per week. The\nnetwork claims “one of the longest ETV program\ndays in the world.”\ny The University of Minnesota will produce 13\ntelevision films relating cancer research to cancer\ncontrol. Filming will be done at major cancer research\ncenters throughout the country, and the completed\nseries will be distributed nationally to educational\nand commercial TV stations. Burton Paulu, director\nof radio and TV broadcasting, will supervise the\nproject which is being done under a grant of $92,000\nfrom the U. S. Public Health Service.\ny GPL Division of General Precision, Inc., has re¬\ncently installed equipment for a CCTV program at\nHunter College, Pleasantville, New York. An un¬\nmanned football-sized camera is the basic unit for\nthe system. The CCTV program is being evaluated\nthrough a research project under Title VII of the\nNDEA.\n► Riverside Radio WRVR, New York, which went\non the air January 1, is issuing a truly excellent\nmonthly program guide, with photos and descriptions\nof outstanding programs. Center pages of the book¬\nlet are devoted to a fine arts calendar for the city\nof New York. The guide is similar to the one which\nhas been issued for some time by commercial FM\nstation WFMT in Chicago.\n► The weekly “University Bulletin” of the Univer¬\nsity of California devoted two pages of a recent issue\nto ETV activities there.\n► Ampex announces this month the installation of\na videotape recorder at All India Radio’s ETV sta¬\ntion in New Delhi. This is the only operative TV\nfacility in India—but another station is planned for\nBombay within two years. The Indian installation\nbrings to 19 the number of countries outside the\nU. S. using Ampex TV recorders.\ny Ampex also announces that the NETRC has ex¬\ntended its contract to purchase recorders to equip\nthe next 25 noncommercial ETV stations that go\non the air and become affiliated with NETRC by\nthe end of 1962. Final shipments have been made\nunder the original grant. A new Ford Foundation\ngrant of $1,882,000 makes the contract extension\npossible.\n► The University of Michigan announces that New\nYork City’s commercial WOR-TV and commercial\nKHJ in Los Angeles have begun broadcasting pro¬\ngrams produced by the university. During 1960, says\nthe notice, 36 TV stations in the U. S. carried more\nthan 1,000 hours of programing that was planned,\nconceived, and produced in the U-M television studios\non the Ann Arbor campus.\ny Industrial Associate Dage Television has a new\nname: Educational Electronics Division, Thompson\nRamo Wooldridge Inc. Under the new title, Dage is\npaired with MRI (Magnetic Recording Industries),\nmanufacturers of language laboratories.\nNote: In the January-February NAEB Journal “Salute\nto Industrial Associates,” there is a proofreading error in the\nspelling of the name of the parent company. Wooldridge is\ncorrect.\nPROGRAMS\ny KUSD and the history department at the Univer¬\nsity of South Dakota are preparing a comprehensive\nseries of documentary programs in conjunction with\nthe Dakota Territory Centennial being observed this\nyear.\n► WOI and WOI-FM, Iowa State University, aired\nrecently what they believe to be an exclusive broad¬\ncast of the Soviet, English language, radio version of\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, I 19 Gregory Hall,\nUrbana, III. $5.00 a year, edited by Betty McKenzie.\n2\nNEWSLETTER"
}