{
  "id": "d1877-2",
  "text": "confidence and vigor their interest in the use of TV for\nteaching, and we plan to submit some proposals to\nthem for possible cooperation.\nWhile in New York I also had the pleasure of din¬\nner on Thursday night with Barrie and Mrs. Thome\nof the BBC, and on Friday night I dined with Sy\nSiegel. Both discussions were “idea-stimulating” in\nthe best sense. Out of the first will, I hope, come in¬\ncreased cooperation and understanding with the fine\nBBC people. Out of the second I learned of many new\nprograms from the CBC and elsewhere which will soon\nbe available to the NAEB through WNYC and Sy’s\nimaginative efforts and drive.\nI also talked by phone with George Probst of the\nEdison Foundation and Lawrence Levey, publisher\nof TV Opportunities. If any of you now want copies\nof Mr. Levey’s special ETV issue, mentioned in the\nNovember Newsletter, let us know. We’ll be glad to\nsend them.\nThe balance of time was taken up by a Regional\nMeeting, the Broadcasting Committee Meeting and\nthe Executive Committee Meeting ... all of the CNO.\nLike ourselves, the CNO faces the problem of develop¬\ning self-support, as foundation funds begin to be with¬\ndrawn for on-going and operational purposes; and they\nare increasingly restricted to project grants. Most of\nthe CNO developments are not applicable at this time.\nHowever, I believe the leadership role we can provide\nwith them justifies our continued cooperative efforts.\nBetween meetings I had an hour with Burton\nPaulu at the Airlines Terminal. He had been to Wash¬\nington and New York and was on his way to A n n\nArbor . . . then home. Elsewhere you will find his\ngreetings to you, together with any report he may feel\ncalled upon to make.\nBack home we have just finished entertaining Mr.\nPluang Nanakon from Thailand, and Dr. Maurice\nSeay, of the W. K. Kellogg Foundation, who has just\nhad his first glimpse of our National Headquarters.\nMany of you are sharing the responsibility of hosting\nMr. Nanakon, and we thank you for this. And - re¬\ngarding Dr. Seay - since our central office is financed\nlargely by Kellogg Foundation Funds, I’m sure you\nrealize the genuine pleasure his visit has given us.\nHungarian refugee Zoltan Ujhelyi has just been\nemployed by Headquarters to work on the Network.\nMr. Ujhelyi spent 5 years in a prison camp in Hun¬\ngary, in the same camp with Cardinal Mindzendty.\nLater he was accused of espionage for the Americans\nand spent time at forced labor. He plans to enroll in\nthe University of Illinois after he is more acclimated,\nto continue his study of civil engineering. His en¬\ntire family - wife and her parents - is now living in the\nUnited States. We certainly welcome him!\nDIRECTORY CHANGES\np. I Change Summary of Membership figures to:\n121 Active Members\n86 Associate Members\n78 Affiliate Members\n3 Honorary Members\n288 Total\np. 7 Delete Mitchell Gerbick from WGVE.\nAdd: Paul J. Bowlby, Station Manager\np.15 Insert with WUNC-TV, their other two TV studios:\nNorth Carolina State College State College Studio\nRoy Johnston, Director of TV Raleigh, N. C.\nWoman's College Woman's College Studio\nEmil W. Young, Jr. Greensboro, N. C.\nDirector of TV\np. 21 Add under Wisconsin\nWLFM-(FM) 91.1 kc Lawrence College\n(Appleton) 3 kw Joseph A. Hopfensperger,\nStation Manager\nSampson House\nLawrence College\nAppleton, Wisconsin\nP. 23 Add: Birmingham Public Schools Evelyn Walker,\n(Birmingham) Producer-Coordinator, Radio-TV\n720 S. 20th Street\nBirmingham 5, Alabama\nP. 38 Change Sheldon Fisher's city to Urbana\np. 40 Add: MISSISSIPPI (Region II)\nMississippi Southern College, Thomas B. Maclin Jr.\n(Hattiesburg) Director, Radio-TV\nStation A\np. 51 Add: WLFM(FM) Lawrence College,\nAppleton, Wisconsin\nIn closing, may I thank the many of you who\nsent personal Christmas cards and notes. Your\nwonderful support and good wishes are greatly\nappreciated. May we share another fine year to¬\ngether. A happy and prosperous 1957 to you all!\n—N A E B—\nNETWORK NEWS\n—by Robert Underwood\nWith the advent of 1957 and the reflective pause\nwhich accompanies the ending of one year and the be¬\nginning of the next, the Network staff is taking the\nopportunity to survey the present situation and de¬\ntermine future lines of action.\nThis past year has seen a complete turnover in\nNetwork personnel (with the exception of one half¬\ntime student employee). Naturally, under such con¬\nditions errors of fact and judgement occurred along\nwith numerous misunderstandings among the staff and\nbetween Network officers and various stations. Per¬\nsonally, I feel many of these errors and misunder¬\nstandings took place because too many items were\nfiled in individual minds and not in the regular files -\nand I feel this is true at both ends of this operation.\nNEWSLETTER\nPage 3"
}