{
  "id": "d1710-0",
  "text": "OFFICERS\nEXECUTIVE COMMITTEE\nPresident: R. C. HIGGY, WEAO\nOHIO STATE UNIVERSITY\nColumbus, Ohio\nVice-President: carl MENZER, WSUI\nSTATE UNIVERSITY OF IOWA\nI OWA C ITY, I OWA\nSecretary-Treasurer:\nB. B. BRACKETT, KUSD\nUNIVERSITY OFSDUTH DAKDTA\nCollege. av\\A Un\n\"B /c>a deoiling\nFirst Zone: DANIEL E. NOBLE, WCAC\nStorrs, Connecticut\nSecond Zone: J. B. HASSELMAN, WKAR\nMICHIGAN STATE COLLEGE\nThird Zdnei GARLAND POWELL, WRUF\nUNIVERSITY OF FLORIDA\nGainesville, Florida\nFourth Zone: W. I. GRIFFITH, WOI\nIOWA STATE COLLEGE OF ADRICULTURE\nOffice of Executive Secret.\nT. M. BEAIRD, WNAD\nSPECIAL BULLETIN\nRelease Date February 6, 1932\nfifth zone: H. V. CARPENTER, KW5C\nSTATE COLLEGE OFWASHINGTON\nAt LARGE: CHARLES A. CULVER, KFMX\nCARLETON COLLEGE\nNgrthfield, Minnesota\nTO MEMBERS\nof\nTHE ASSOCIATION OF COLLEGE AND UNIVERSITY BROADCASTING STATIONS\n(ard a special request mailing list in addition to members)\nYOU ARE AWARE, OF COURSE, THAT THE CRITICISM OFTEN HEARD, “COLLEGE AND\nUNIVERSITY STATIONS CANNOT BE HEARD WELL\" IS LARGELY TRUE. AS BRACKETT\nOF SOUTH DAKOTA AND DOZENS OF OTHERS STATE, HOWEVER, THIS IS DUE TO THE\nFACT THAT UNDER THE PRESENT LAWS*THE FEDERAL RADIO COMMISSION CANNOT EE\nMADE TO GIVE EDUCATIONAL, STATIONS A FAIR CHANCE TO USE THE POWER THAT\nMANY OF THEM ARB DESIROUS OF USING OR ARE EVEN NOW READY TO USE.\nNEED PROOF ON THIS POINT? HERE GOES:\n\"THE UNIVERSITY OF ILLINOIS HAS A FINE VffiSTERN ELECTRIC TRANSMITTER\nPRACTICALLY IDENTICAL TO THAT OF WNAX OF YANKTON, BUT IT IS ALLOWED\nTO OPERATE IT AT ONLY HALF POWER DURING THE DAY TIME AND ONE FOURTH\nPOWER AT NIGHT, WHILE CERTAIN SINGLE COMMERCIAL STATIONS IN CHICAGO\nARB BEING ALLOWED TO USE 200 TIMES AS MUCH.”\n\"THE UNIVERSITY OF IOWA HAS A TRANSMITTER SIMILAR TO THAT OF THE UNI¬\nVERSITY OF ILLINOIS BUT CAN USE ONLY HALF LOWER, WHILE COMMERCIAL STA¬\nTIONS IN IOWA ARE RECENTLY VOTED IMMENSE INCREASES IN POWER.\"\n\"THE NEBRAiSKA WESLEYAN UNIVERSITY HAS BEEN FIGHTING FOR AH INCREASE\nFROM 500 WATTS TO 1000 WATTS AND CANNOT GET IT, WHILE KFAB IN THE SAMS\nCITY IS VOTED BY THE COMMISSION AN INCREASE FROM 5000 to 25000.\"\n\"THE UNIVERSITY OF NORTH DAKOTA, AND THE UNIVERSITY OF WISCONSIN BOTH\nWISH TO INCRuA.SE THE POWER OF THEIR STATIONS, BUT NEITHER CAiN GET PER¬\nMISSION TO DO SO WHILE COMMERCIAL STATIONS ALL ABOUT THEM AiRE BEING\nGRANTED UNLIMITED INCREASES.\"\n\"THE AUTHORITIES IN WASHINGTON COULD TAKE CARE OF EDUCATIONAL BROADCASTING\nUNDER THE PRESENT LAW, BUT THEY ARE NOT DOING SO AND THEY WILL NOT WITHOUT\nAMENDMENTS OR NEW LAWS THAT WILL COMPEL A FAIR TREATMENT OF THE EDUCATION¬\nAL STATIONS.\"\nIn a recent communication from Dr. B. B. Brackett, Director of Radio Station\nKUSD, University of South Dakota, Vermillion, we are supplied with the fol¬\nlowing information which I am sure will prove of interest to the entire\nmembership: The South Dakota Society of Engineers and Architects at\nMitchell, South Dakota, on January 7, 1932, passed the following resolution:"
}