{
  "id": "d1909-3",
  "text": "THE RADIO INSTITUTE OF THE AUDIBLE ARTS\nNew York Parent-Teachers Programs\nSponsored jointly by the New York City Board of\nEducation and Teachers College, Columbia Univer¬\nsity, the WNYC “School of the Air” consists of lec¬\ntures by noted educators, designed to aid teachers and\nparents in encouraging the children’s educational de¬\nvelopment.\nTypical subjects discussed on the programs are\n“Why Children Have Trouble With Arithmetic,”\n“Reading Difficulties of Elementary School Children,”\nand “What Makes a Good Teacher?”.\nTwo weeks before each broadcast, discussion ques¬\ntions bearing on the topic to be considered, together\nwith a selected reading list, are distributed to the\nvarious school systems. After the fifteen minute radio\ntalk, superintendents and principals conduct the dis¬\ncussion for the balance of the hour. Approximately\n10,000 elementary and secondary school teachers hear\nthe programs, it is estimated.\nCleveland Public Schools\nThe Cleveland public schools present series of\nmusical lessons over the radio. Different courses are\ngiven for each grade, and there is one radio program\nfor each grade each week. The teachers are furnished\nwith advance literature telling the teacher what mate¬\nrial is needed for the utilization of the program, out-\nling the teacher’s responsibilities before, during and\nafter the broadcast, and containing suggestions for\nsupplementary activity on the part of the class.\nChicago Public Schools\nThe Chicago public schools broadcast a regular\nseries of programs designed for the use of pupils from\nthe sixth to twelfth grade, over WMAQ on Mondays,\nWednesdays and Thursdays from 11:30 to 11:45 a.m.\nOn Friday mornings, from 10:00 to 11:00, a musical\nprogram entitled “Great Music of All Times” is\nbroadcast over both WMAQ and KYW.\nThe programs are selected by a committee com¬\nposed of four grade and high school principals and\none art supervisor. A typical monthly list of the Mon¬\nday broadcasts, includes programs dealing with geog¬\nraphy, civics, literature and history. The program\ncommittee keeps in constant touch with the use made\nof the broadcasts, through a questionnaire attached to\nthe program bulletin.\nMuseums on the Air\nThe Metropolitan Museum of Art in New York\nCity is also active on the radio. Huger Elliot, Director\nof Education for the Museum gives a talk on the Mu¬\nseum’s collection every Saturday at 12:30 P.M. over\nWOR, Newark, N. J. He also speaks on alternate\nTuesdays at 5:30 P.M. over WNYC, the municipal\nbroadcasting station.\nThe Buffalo Museum of Science, located at Hum¬\nboldt Park, Buffalo, N. Y., broadcasts regularly over\nWGR. During the month of February a program was\nbroadcast each Friday evening from 9:45 to 10:00\np.m. The subjects of the four talks were “Eclipses,”\n“Aren’t the Stars Bright!”, “Our Planetary Twin”\nand “Evening Stars.”\n“A Challenge to Education”\n44. . . Radio has given education a new medium, but it has also presented it with a rather\noverwhelming challenge. There is an audience for every program, provided the program is techni¬\ncally well constructed and is presented to that section of the audience for which it is intended. An\naudience of millions is waiting to lend attentive ears to anyone who can interest it and hold its\nattention. . . . But the successful use of the new medium challenges many time-honored traditions\nof the classroom and campus. It challenges first and foremost the professor’s sacred right to be dull.\n. . . The educator, if he wishes to grasp the remarkable opportunities afforded him by Radio,,\nmust go to school to the showman, the journalist, the feature writer, the popularizers of scientific\nthemes, and to those men who have made a study and profession of broadcasting . .\nFrom a brochure entitled “The Educational Program,” by Merrill Denison, journalist, dramatist and consultant on\nthe technical preparation of many educational programs. Copies of the complete brochure from which the above excerpts\nhave been taken can be obtained, without charge, by writing to The Radio Institute of the Audible Arts, 80 Broadway, New\nYork City."
}