{
  "id": "d1909-4",
  "text": "THE RADIO INSTITUTE OF THE AUDIBLE ARTS\nNational Broadcasting Company\nSome idea of the extent to which the networks are\nfostering the development of educational programs\nmay be gathered from a study of the Educational Bul¬\nletin of the National Broadcasting Company, listing\nthe regular educational features and special events\nbroadcast over NBC facilities during the month of\nFebruary.\nThere were approximately a hundred weekly pro¬\ngrams and six daily ones. In addition, there were five\ninternational broadcasts, and six special events of\nmajor educational significance. In addition to the full\nnetwork programs, there were special educational\nfeatures broadcast over Pacific Coasts or midwestern\nstations.\nAn outstanding educational series is the one en¬\ntitled “Our American Schools,” which is broadcast\nover a nation-wide NBC-WEAF network every Satur¬\nday evening from 5:30 to 6:00 p.m., Eastern Standard\nTime, under the asupices of the National Education\nAssociation. The program is broadcast from the\nWashington headquarters of the Association, and is\nunder the personal direction of Florence Hale, Di¬\nrector of Radio for the N.E.A. This program has been\na regular feature for four years.\nCBS American School of the Air\nOne of the most interesting projects in edu¬\ncation on the radio is the Columbia Broadcasting\nSystem’s American School of the Air. Now in its sixth\nsuccessive season, the School offers programs deal¬\ning with literature, history, geography, music, stories,\nforeign affairs and vocational guidance, broadcast five\ndays a week from 2:30 to 3:00 P.M., Eastern Standard\nTime, over the facilities of eighty-seven stations of the\nColumbia Broadcasting System.\nThe scripts are prepared by a staff of ten authors,\neach one specializing in a particular subject. The cur¬\nricula of the school is arranged with assistance of a\nBoard of Counselors, consisting of recognized authori¬\nties in the various fields, and a cooperating committee\nof educators, musicians, etc.\nAn advance Teacher’s Manual and Classroom Guide\nis distributed by Columbia at the beginning of the year,\nand is supplemented by weekly issuances containing\nsuggestions for the utilization of particular programs.\nThese usually take the form of an explanation of the\npurposes of the broadcast, questions for supplemen¬\ntary discussion, and supplementary reading lists.\nWEYD University of the Air\nThe success of the University of the Air, founded\nby WEVD of New York in 1933, proves that even a\nsmall independent station can gain wide recognition\nand support by presenting outstanding educational\nprograms.\nWith the inauguration of its third season, the Uni¬\nversity announced five regular series, one each night\nof the week, featuring prominent educators in discus¬\nsion of such subjects as “Economic Planning-Society\nin the Making,” “Education for a New Social Order,”\n“Psychoanalysis Today,” “The Art of Enjoying\nMusic.”\nOther series planned for the year include “History\nRepeats Itself,” “Labor Faces the Future,” and “Lit¬\nerature and Drama.” It is planned to have each series\nrun for ten weeks. In addition to regular series broad¬\ncast currently, WEVD is offering two series from\nWashington: one, presenting prominent labor leaders;\nand the other, entitled “Legislating the New Deal,”\nbringing members of the Senate before the micro¬\nphone.\nBy means of modern transcriptions, WEVD has\narranged to furnish all the programs of the University\nof the Air to college radio stations on a non-profit\nbasis.\nWorld Wide Broadcasting Corporation\nAn interesting experiment in the utilization of\nshort-wave broadcasting for educational purposes, is\nbeing conducted by the World Wide Broadcasting\nCorporation, a non-commercial organization operating\nstation W1XAL in Boston.\nThe station, having a power of 5000 watts, and\nbroadcasting on a frequency of 6040 kilocycles, can\nbe located by owners of short-wave receiving sets mid¬\nway between DJC, Berlin, and GSA, Daventry. The\nstation goes on the air on Sundays at 5:00 P.M. Eastern\nStandard Time, and on Tuesdays and Thursdays at\n7:30 p.m.\nPrograms dealing with Current Events, Music, Art,\nPopular Law, Adult Education, Religion, Economics\nand Foreign Affairs are broadcast regularly. The\nprograms are arranged with the cooperation of an\nadvisory committee of prominent educators, and are\ndesigned for use by school, college and club groups.\nProgram information may be obtained by writing\nto the Educational Director of the station at the Uni¬\nversity Club in Boston."
}