{
  "id": "d1377-1",
  "text": "BUBEAtJ OF BROADCASTING\nUNIVERSITY OF MICHIGAN EXTENSION SERVICE\nJuly 1, 1945 - July 1946\nThe 1945-46 Broadcasting Season marked the 21st year of broadcasting over\ncommercial stations by the Broadcasting Service of the University, in 1925\nprograms originated from the top floor of old University Hall in a room not\ndesigned for broadcasting and selected only because it had a rug and a piano. In\n1927 Morris Hall was remodeled and equipped with an announcing booth, studio,\ncontrol room, and a band practice hall which could be used for broadcasting\npurposes. These quarters were used jointly by the University Band, by the\nDepartment of Speech for classes in radio, and by the Broadcasting Service.\nIn March 1946 the Broadcasting Service was moved to Rooms 4006 and 4007 Angell\nHall. Two acoustically treated studios and a single control room were constructed\nby the Plant Department* The Angell Hall studios are used jointly by the\nSpeech Department and the Broadcasting Service.\nDuring the year 1925, ten programs were presented over Station WRJ and VJCX\n(now station WJR). In 1945-46 seven hundred thirty-six programs were broadcast\nover four different commercial stations and the educational station owned by\nMichigan State College.\nDuring the 1945-40 Broadcasting season the four comme-reial stations gave to\nthe University periods upon the air which could have sold coramerctally for a\ntotal of $41,530. Of this amount WJR (Detroit) donated time having a commercial\nvalue of $31,180; Station WPAG (Ann Arbor) donate*d time having a commercial value\nof $9,300; Station l^£0(K&laifia2Go) presented 10 quarter hour programs using\ntime valued at $600; and Station WJEP (Grand Rapids) $450.\nDuring the 1945-43 season of broadcasting the various series of radio\nprograms Included: The Medical Series, presented by members of the faculty of\nthe Schopl of Medicine and of Post Graduate Medicine, two series of programs\npresented by the faculty of the School of Education, two series by the School of\nBusiness Administration, a Veteran*s Counseling Service Series, Religion in\nReview Series by Dr. Edward W. Blakeman, the Workers Educational Series, School\nof Music Series, Dramatic Series, Stoi’y Time for Children, Campus News Series\npresented by the News Dissemination Service, the Adult Education Program Series,\nthe Home Planning Series by members of the faculties of the Colleges'\" of\nArchitecture, Engineering and the Law School, victory Reunion Series, a series\non the University Carillon played by Mr. Sidney Giles, Stump the Professor, and\nHymns of Freedom."
}