{
  "id": "d1377-2",
  "text": "NEWS LETTER*.0 *«* 8»«„„, <•, .. „ «Page 3° * * ••• - .. ..... .... *. «. December 1, 19^5\n(AKR Journal find others).\nThe Radio Consultant must supervise for all schools in the system*,\nhimself or through coor dinatora\n' 1, The actual on-the-air bro&acast*\n2n The use of programs in the classroom,\na. In-service training,\nb, Evaluations utilization aidSc\nThe story of Educational Broadoaftlng was one of the highlight8 of the\nmeeting as presentee by Dr- Clarence Morgan* Radio Director of Indiana\nState Teachers College\n\\\nur Iordan outlined the failures, in general, of educational bread-\ncasting in the 1920 1 a, the interuat taken by the networks in the late\n2G?e ana early 30 fs, &nu the realization today of the great amount of\nwark necesbary for noth prouuction ana utilisation. He outlined the\nmariner of cooperating, An programs, with the service area of WBOW, an\nexample of indeed rare commercial station cooperation, and after out¬\nlining the growth of radio at I naiana State Teachers College, from\nthe \"Old Memoriee Hour” to the present, suggested that group© like the\nPTA get suggestions from public service directors aid experienced\nradio peoole on utilization of time offered, and on developing and\npi anni ng p r ogram e«.\nTn the final session of the day the future of educational broadcasting\nwas hi sous red by NAEB President School ey..\nPrefacing his predictions by a brief review of the history of broad-\ncasting, particularly in the educational field, In the past*, Mr,\nLohooley spoke of radio’s becoming the fifth estate, its frightening\nHitler, Mussolini, Tojo) and encouraging (educational arm cultural)\npowers. He pointed out that used aright, it could be the Befcoon of\nDemocracy, fighting intolerance. He discusseu the rare opportunity\nnow offered educational, institutions with the setting a aide by the FCC\nof 20 FM channels, with the greater and better use of radio that will\nensue if education doean* b misa the boat. He warned of the expense\nof television and predicted that because of this factor, H is still\nsome years away on a national scale* He discussed facsimile, and the\npossibility of its simultaneous use of Ft? channels. And he covered\nthe other new development© (Wire recarders? etc,) pointing the way to\npotential, radio tomorrow..\nHe pointed out that Education*® Own Stations can be the best pro-\ntaction America has against undemocratic use of radio* The need is\ngreat for interest and action on the part of educators and all people\nnterested in democratic education and a democratic America*\nulon0 with these fine talks were three films on AM, FM, and television\nplus a very fine classroom demonstration broadcast entitled \"Citizen© of\nlomorrow 3pea&, »"
}