{
  "id": "d1377-3",
  "text": "NEWS LETTER,\nPage k\nDecember 1, 1945\nA REPORT FROM Fli STATION WBKY\nterp^ti^i<’^^effnU'5r v,a? a lett'er fro“ SImer dulzer with some in-\nJtt eU^n S amernWrUee?ertlti0n °f ““ Unlversit* of Kentucky.a\nrftno^+iVf ^i?ur reSmit9 with our Present use of FM, all I could do is\n(dhi» trt8r.fOl^°W0iv Thfre are supposeu to be approximately 300 FM sets\nL_?J? t0 receive tiie old band) in the listening area of our station\n6 f&dius of approximately 25 miles. However, as yet I\n•h7ihb? S 410 feoura thG names of Just about 25 of these owners\n!™0\" «u , • at re^lAlar Intervals, as you will note by the enclo-\n2*? listeners are very enthusiastic about FM and we bet quite\na bit oz telephonic response from them. We did not expect much of a\nlistening audience on the old band ana we have not been disappointed\nbut we wanted to e>et our feet wet in the matter of transmitter opera¬\ntion as well as provide a broader training ground for good prospective\nstudents in radio. Our probrams over WHA3 ana WLAP have improved as\na result of this preliminary training We are, of course, continu¬\nously attempting to raise our standards on WBKY and we feel that when\nwe move to the new frequency and an audience develops equipped with re¬\nceivers on the new band, we will be in a position to serve them well,\nY ou may be interested in knowing that WHAS* FM transmitter has been\noff the air temporarily for several months, so if we maintain our con¬\ntinuous operation, we can truthfully lay claim to be Kentucky’s oldest\nm station. We do not use our FM station in connection wit]* our listen¬\ning Centers since, as you know, battery-operated FM receivers have not\nbeen developed as yet or at least X don’t know about them if they have\nand our reception radius does not reach the mountains. We are, of\ncourse, looking ahead to the possibility of eventually serving these\nCenters through FM, if reception proves posdbie in the hills. This will\nbe done either by higher power of our own station, relaying our programs\nto nearer FM stations in an educational network, or a combination of\nboth methods.11\nWCHU ORIGINATES HOVEL BOND PHI VS IDEA\nIf you don’t know the story behind WHCU*s already nationally famou#\n\"Thanksgiving Victory Dinner\" drive to have “Kach home Give Thanks As\nIt Is Able - With a Bond or Pledge on Every Table,\" here’s the \"inside\"\non a typical example of radio’s community service.,.,.\nIt began when Mrs. R, C. Osborn, chairman of the Tompkins County War\nFinance Committee, asked Michael R. Hanna, WHCU’a general manager, if\nthere wasn’t something \"special\" the Cornell University radio station\ncould ao to bive Tompkins’ seventh and final bond drive a livening\nshot in the arm Thanksgiving Day was Just one week away at the time.\nManager M ike ealleu his WHCU staff together and put the problem squarely\nbefore the boys who do the planning, write the copy and put \"radio\" oyer\nthe air. \"X ou've aone a whale of a Job on the previous bond drives «\nMike summed it up, \" now dream up something fresh and hot - and QUICK."
}