{
  "id": "d1087-0",
  "text": "EXHIBIT 30\nNAEB Educational Television Production Workshop\nAugust 23 - September 10. 1954\nMichigan State College, East Lansing. Michigan\nRoster\n1. Mr. Thomas J. Brophy, Office of Radio-Television, NEW YORK UNIVERSITY,\nWashington Square, New York 3, New York\n2. Mr. Charles B. Gilbert, RADIO STATION KSLH, ST. LOUIS BOARD OF EDUCATION,\n1517 South Theresa Avenue,- St. Louis 4, Missouri\n3. Dr. Lewin Goff, Department of Speech, STATE UNIVERSITY OF IOWA, Iowa\nCity, Iowa\n4. Mr. John Henderson, RADIO STATION WBAA, PURDUE UNIVERSITY, Lafayette,\nIndiana\n5. Mrs. L. C. McNabb, Director of Broadcasting, MILLIKIN UNIVERSITY, Decatur,\nIllinois\n6. Mrs. Maude Kemper Riley, Editor of Publications, THE ART INSTITUTE OF\nCHICAGO, Chicago 3, Illinois\n7. Miss Margaret Siegley, Assistant Director of Radio and TV, OKALHOMA CITY\nPUBLIC SCHOOLS, Oklahoma City 6, Oklahoma\n8. Miss Hilary Whittaker, Department of Speech, WAYNE UNIVERSITY, Detroit 1,\nMichigan\n9. Mr. Anthony W. Zaitz, Department of Speech, UNIVERSITY OF MASSACHUSETTS,\nAmherst, Massachusetts\n10. Mr. Ray E. Halcombe, Department of Drama and Speech, MACMURRAY COLLEGE,\nJacksonville, Illinois\n11. Dr. Harry W, Knepler, Division of Liberal Studies, ILLINOIS INSTITUTE OF\nTECHNOLOGY, Chicago 16, Illinois\n12. Mr. W. Ferron Halvorson, Director of Broadcasting, TEXAS TECHNOLOGICAL\nCOLLEGE, Lubbock, Texas\n13. Mr. S. Donald Robertson, Department of Speech, RADIO STATION KFJM.\nUNIVERSITY OF NORTH DAKOTA, Grand Forks, North Dakota\n14. Mr. Ralph J. Tangney, Program Manager, RADIO STATION WGBH-FM AND WGBH-TV\n(WGBH EDUCATIONAL FOUNDATION), Symphony Hall, Boston 15, Massachusetts\n15.. Mr. John E. Young, Manager, RADIO STATION WUNC, UNIVERSITY OF NORTH\nCAROLINA, Chapel Hill, North Carolina\n16. Mr. Roland E. Fenz, Director, RADIO STATION KSTC, KANSAS STATE TEACHERS\nCOLLEGE, Pittsburg, Kansas\n17. Mr. Fred B. Rainsberry, Television Service, CANADIAN BROADCASTING CORPORATION,,\n354 Jarvis Street, Toronto, Ontario, Canada\n38. Miss Marjorie E. Stevens, RADIO STATION WDTR. DETROIT PUBLIC SCHOOLS,\n9345 Lawton Avenue, Detroit 6, Michigan\n19. Mrs. de Lacee W. Holland, BIRMINGHAM CITY SCHOOLS, 2904 Ave. W. Ensley Hglds.,\nBirmingham 8, Alabama\n20.. Miss Julia M. Hanna, Department of Communication Arts, UNIVERSITY OF DETROIT;,\n4001 W. McNichols Road, Detroit 21, Michigan\n21. Mr. Glenn W. Price, Division of Radio and Television, UNIVERSITY OF KANSAS,\nLawrence, Kansas\n22.. Mr. William G. Harley, Manager, Radio Station WHA-TV, UNIVERSITY OF WIS¬\nCONSIN, Madison, Wisconsin"
}