{
  "id": "d333-25",
  "text": "WFBE CELEBRATES\nTENTH ANNIVERSARY\nNOW HEAR THIS.....\nWBGO, Newark, New Jersey, has produced two\nseries on the teaching of listening techniques.\nThe first, LEARNING TO LISTEN is for grades K-3\nand its sequel LISTEN, MY CHILDREN is planned\nfor grades 4-6.\nWBEZ, CHICAGO\nWBEZ received an award from the division of\nRadio and Television this summer. The 1963\nNAFBRAT citation for the program was received\nfrom the National Association for Better Radio\nand Television, WBEZ marks its 22nd year in\nbroadcasting with its return to the air this\nfall.\nPROGRAM IDEA?\nIn a recent program for FOCUS; AFRA-ASIA, the\nproducer of the program interviewed, separately,\nofficials of Israel and Iraq asking the same\nquestion on matters of concern and conflict to\nboth. The interviews were then integrated into\none program with Arab and Israel answers to each\nquestion spliced back to back. This reminds us\nof a similar program in which WFBE interviewed\nthe two candidates for governor separately givi\ning them each the same five questions. They\nwere then spliced back to back and students\nwere given the opportunity to hear the two\ncandidates answer the same question. This\nmight be an idea for next year\"s election,\nKSLH, ST, LOUIS\nOne of the NAEB's greatest contributors starts\nits 14th year of operation. Some of the new\nprogramming includes THINKING AHEAD, a series\nof programs designed to help the 8th grade\npupil plan for a high school education! CHAPTER\nA DAY, a program for after-school listening fea¬\nturing children's stories by favorite American\nauthors! WAYS TO WRITE, programs planned to help\nchildren gain facility and skill in various\nkinds of writing! and in the field of music a\ncatchy title gets interest among KSLH listeners\n—AROUND THE WORLD IN 88 KEYS, a seven-program\nseries of the music of people from around the\nworld,\nWBEZ, CHICAGO\nWBEZ sends out program bulletins to all tea¬\nchers and calls their resume of all radio pro¬\ngrams \"Schedu1e-at«a-G1ance\" giving the tea¬\ncher an opportunity to see what is offered in\na given subject area on a given day to a given\ngroup, WFBE also has a similar device which is\ncalled a “Quick-Reference.'1 Any stations in¬\nterested may receive a sample copy from either\nof the stations; WBEZ, Chicago, Illinois;\nWFBE, Oak Grove Campus, Flint, Michigan.\nWFBE, the Flint Public School's Radio Sta¬\ntion, celebrated its 10th anniversary,\nOctober 10, 1963. Invitations to former\nstudents-and staff were sent and an open\ninvitation to visit the studio during the\nday was extended to the public. Miss 01a\nHiller, the founder of Radio Station WFBE,\nwas present to greet guests. Many con¬\ngratulatory telegrams and greetings were\nreceived from around the country.\nA WORD ABOUT INSCHOOL BROADCASTER\nAt a meeting earlier this year, members of\nthe Inschool Broadcasting Committee of the\nNAEB decided that an information-type news¬\nletter would be of great value to other\ninschool broadcasters around the country.\nWe took it upon ourselves to volunteer our\nservices by formulating these ideas into\nthe sheet of paper you are now reading. To\nour readers, we have but one word and that\nis “Help!\" Any comments, criticisms pro\nand con, will be we loomed. We feel this\nshould be the type of newsletter we can all\ncontribute to and hope it will prove helpful\nto all. It is a place to exchange ideas,\nto verbalize and brainstorm possible untried\nways in broadcasting. We have tried to\ngive you a few names and places to write for\nideas. If any of you have handouts, informa¬\ntion sheets, or devices that you have found\nuseful at your station, why not make them\navailable to others? For this year, please\nsend all letters concerning the INSCHOOL\nBROADCASTER to; Stephen A, All, Manager,\nRadio Station WFBE-FM, Oak Grove Campus,\nFlint, Michigan 48503*\nSEE YOU AT THE CONVENTION!\nAs you all know by this time, the NAEB Con¬\nvention will be held in Milwaukee, Wiscon¬\nsin. Robert Lewis Shayon, Radio-TV critic\nfor the Saturday Review will give the key¬\nnote address. Arthur Sylvester, Assistant\nSecretary of Defense for Public Affairs,\nwill speak at the general session. Dates\nfor the convention ares\nSunday, November 17\nthrough\nWednesday, November 20\nirtn'drtrJrJrJrJrJriitrirJilrkickiiirJricidrXirkirtririrJelflririrJn'ritio'riiri'i\nEDITOR....Stephen A. All\nEDITORIAL STAFF;......Susan Kilmer\nNora Perry\n10-22-63"
}