{
  "id": "d1759-0",
  "text": "Volume IV, Number l6 November 1, 1963\nFCC PROPOSES REVISED ALLOCATION OF UHF CHANNELS\nOn Oct. 24, the FCC issued a Further Notice of Proposed Rule Making in Docket\n14229, proposing a revised allocation plan for UHF channels that will add over 400\nnew assignments to the present Table of Assignments, and invited comments on or\nbefore Jan. 3, 1964. No changes in VHF channel assignments are proposed.\nOut of approximately 1,975 UHF assignments in the proposed table, about 600\nare reserved for educational, use, a substantial increase over the 230 UHF reserved\nchannels in the present table, (in addition, 99 VHF channels are currently-\nreserved in the continental U.S.) The selection of communities for educational\nreservations was based on the earlier NAEB survey of the needs of education for ETV\nchannels, modified in some cases by subsequent specific plans submitted by states\nor local and regional ETV groups. Two ETV reservations are proposed in 44 communities,\nwhich include the 8 communities now having two reserved channels. No community was\ngiven more than two educational channels.\nThe NAEB has recently completed a detailed computer study to determine a table\nof UHF allocations which differs somewhat from that proposed by the FCC, in that more\nchannels are reserved and some communities are given more than two reservations.\nA summary of the NAEB study will appear in the next Washington Report.\nCOMMENT INVITED ON REGULAR AIRBORNE EDUCATIONAL PROPOSAL\nOn Oct. 24, the Commission invited comments by Jan. 3> 1964 to a petition by\nMPATI that its operation be authorized on a regular basis and that six UHF channels\nbe provided for that purpose. The present experimental operation transmits on\nChs. 72 & 76. MPATI now requests Chs. 72, lb, 76, 78, 80, & 82 for regular operation.\nThe Commission invites comments on whether substantial spectrum space should be\ndevoted to the proposed operation, and points out that the states involved (Indiana,\nOhio, Kentucky, Illinois, Michigan, and Wisconsin) have indicated interest in exten¬\nsive ground-based ETV networks. The FCC stated that in their proposed new UHF\ntable (above) they were unable to provide fully for ground-based ETV needs as set\nforth by the NAEB in its survey, and added, \"Further, if airborne TV service were\nconsidered on a nationwide basis, 12 or 18 alternate channels would be needed exclu¬\nsively for such operation and 13 to 19 adjacent channels would be seriously limited\nin use. In addition, MPATEmay require other spectrum space in the 2000 me and 2500 me\nband for ground-to-air relay and for translators required in certain high-rise urban\ncenters.\" The FCC adds: \"It may be questioned whether such an impact can be justified,\nespecially since the transmissions of the airborne stations are intended primarily\nfor reception in specially equipped schools and the material is tailored for in¬\nstructional purposes rather than for viewing by the home audience. It may be that\nsuch an operation is more properly to be provided for as a private service.\"\nThe Commission also points out that the new 2500 me service was established\n— \"to accomplish objectives similar to those of the MPATI proposal.\" The FCC has listed"
}