{
  "id": "d1479-2",
  "text": "News Letter\nPage 3\nFebruary 1946\nInformed of the action in Chicago, Dr, Madoy said; \"After 37 years of\nMEMBERSHIP IN GOOD STANDING, I HAVE BEEN EXPELLED FROM THE AFM FOR THE\nINNOCENT CRIME OF TEACHING MUSIC TO CHILDREN AT InTERLOCHEN.\n\"The unfair ruling in my expulsion is a reprisal against me personally\nFOR DARING TO DISPUTE PETRILLO*S RIGHT TO CONTROL BROADCASTING AND THE\nMusical Education of the Children of America.,\n\"In spite of Petrillo’s efforts to obstruct the development of youthful\nmusical talent, the National Music Camp and other school musical organiza¬\ntions throughout the country will continue to fight any and all edicts\nTHAT would interfere WITH THE RIGHTS OF EDUCATORS TO TEACH AND OF CHILDREN\nTO LEARN music.\"\nMaDDY added THAT HE HAD NO IMMEDIATE COMMENT ON POSSIBLE APPEAL FROM THE\nPOARD*S DECISION.\nveterans returning to w k a r.\nThe coming of war in 1941 brought a serious personnel problem when, by\nJune of 1942 W K A R*s Program Supervisor, seven announcers and four operator\nLEFT to join THE ARMED SERVICES, NoW THESE MEN ARE RETURNING. FquR HAVE\nalready JOINED THE STAFF TO TAKE UP THEIR DUTIES AND OTHER VETERANS HAVE\nBEEN ADDED UNTIL THERE ARE NOW THIRTEEN SERVICE MEN AT W K A R,\nThese men have experienced much during their period of war service. In¬\ncluded ARE A major and TWO CAPTAINS FROM THE ARMY, A LIEUTENANT COMMANDER\nAND LIEUTENANT OF NAVY. THERE ARE ALSO TWO AIR MEDALS WITH CLUSTERS, TWO\nDISTINGUISHED FLYING CROSSES AND TWO PURPLE HEART CITATIONS. THE COMBINED\nSERVICE INCLUDES ACTION IN THE ALEUTIANS AND THE SOUTH PACIFIC AREA IN¬\nCLUDING SAIPAN AND THE PHILIPPINES, AFRICA, ITALY, GERMANY AND FRANCE,\nVeterans, who have come back to the W K a R family, are announcers Charles\nAnthony, Robert Shackelton, Herbert Bodwin, Edward Prink, Milton Haitema\nAND Merrill Walker; operators Linn Tows^ey, John Bl^keslee, George Fraser,\ni^LLiAM Winters and Robert Hogle, Music librarian Robert Huber and agri¬\ncultural editor Carl Moore,\nNOViK ENTERS PROGRAM CONSULTING FIELD.\nMorris Novik, former manager of W NYC Ngvv York has been retained as\nPUBLIC service consultant FOR THE HaRRY C, WILDER STATIONS, W S Y R SYRACUSE,\nW TRY Troy, and W E L I New Haven, He already holds a similar position\nAS CONSULTANT FOR FORMER MaYOR FiORELLO LaGUARDIA,\nMr. MOVIK, who resigned as W N Y C head coincident WITH THE CHANGE IN NeW\nYork City*8 administration January I, announced at the time that he would\nenter consulting field with particular reference to PUBLIC interest pro¬\ngramming. He was asked BY Mayor-elect William 0*0wyer to remain as head\nOF THE station, BUT HE DECLINED, He HAD HANDLED MaYOR LaGUARDIA‘S RADIO\nassignments for the past SIX YEARS, DURING HIS INCUMBENCY AS STATION MANAGER,\nMORRIE has recently BEEN ELECTED AN ASSOCIATE MEMBER OF THE NAEB SO THAT\nEDUCATl’ONAL BROADCAST NG^ ANDHE WILL MAINTAIN HIS CONTACT WITH"
}