{
  "id": "d1479-3",
  "text": "cal commercial stations have helped acti¬\nvate the channel by contributing equipment,\nland, engineering and legal services, as well\nas air time for in-school programs in the\npast. WCNY began broadcasts December\n20.\n^ WCNY General Manager Thomas Pe-\ntry has announced that his station will in all\nlikelihood become the first ETV station to\nhave its own symphony orchestra in resi¬\ndence. The Syracuse Symphony Orchestra,\nand its opera and choral groups, will use\nWCNY studios and production facilities for\nrehearsal and production purposes. Petry\nsays this is the first step toward close coop¬\neration with all area cultural organizations\nas part of a long-range plan to determine\nthe effectiveness of ETV in stimulating in¬\nterest in and attendance at area cultural\nevents.\nTexas A&M University has a new mo¬\nbile unit which they believe to be unique\namong university-owned mobile units, in\nthat it is equipped with two videotape re¬\ncorders.\n^ KVCR-FM, San Bernardino, marked\nits completion of 12 years on the air on\nDecember 5, with a six-hour special anni¬\nversary broadcast.\n^ A special civil defense project has be¬\ngun in California under a $28,000 grant to\nthe Santa Clara County Office of Educa¬\ntion from the USOE. Clarence E. Flick,\nsupervisor of radio-TV at San Jose State\nCollege, has taken a year’s leave of absence\nto direct the research project. He will at¬\ntempt to determine attitudes toward and\ngrasp of information about civil defense\namong school personnel, students, and the\ngeneral public. TV programs will be devel¬\noped on the basis of this information.\nPROGRAMS\ny A series of one-minute public service\nfilms broadcast last summer by commercial\nand educational TV stations in Georgia has\nbeen credited with a 25% increase in 1965\nfall public vocational-technical school en¬\nrollment. The announcements explained th?\nrole of the schools and their availability to\nhigh school graduates.\n^ KTPS, Tacoma Public Schools, is broad¬\ncasting four school safety patrol training\nsessions for more than 2500 pupils in the\npublic and parochial school patrols. This is\nbelieved to be a “first” of its type.\n^ The U. S. Information Agency is re¬\ncording the Book Beat series of WTTW,\nChicago, for rebroadcast on the Voice of\nAmerica.\n^ WDET, Wayne State University, has\nbegun the second season of Detroit’s only\nmulti-lingual radio series, Detroit’s Ethnic\nGroups. The programs are in six different\nlanguages and highlight the cultures of the\nlargest nationality groups in the Detroit\narea, Polish, Italian, German, Hungarian,\nCroatian, and Armenian.\n^ KUED, Salt Lake City, began a new\nseries, Civic Dialogue, Goals for Utah, this\nfall. The viewers may participate in the\nprograms by joining a study group and\ntalking with the experts through a tele¬\nphone hookup for a discussion and ques-\ntion-and-answer period.\n^ WBUR began its fifteenth season of\nThe Art World with Edward J. W. Cooper,\nNew England artist and art critic. The\nprogram features news and reviews of art\nexhibitions in the Boston area, interviews\nwith outstanding artists and representatives\nof leading art galleries, and discussions with\nfaculty members from art departments in\nthe area.\n^ Writing With Writers is a new dis¬\ncussion series over WDET. It is produced\nin cooperation with the Detroit Women\nWriters, and is designed to give practical\nadvice to free lance writers. Experienced\nwriters will be used on each program.\nS. I. Hayakawa, noted semanticist, ex¬\nplains the art of talking and listening on\nLanguage In Action, WHYY-TV’s new se¬\nries. The programs will cover impasses in\ncommunications created by clumsy uses of\nwords, will define language, discuss and\nillustrate how dictionaries are prepared, and\nelaborate on advertising techniques.\nSTATE AND REGIONAL\n^ Ohio is planning a master communi¬\ncations center designed to give higher edu¬\ncation in the state the finest radio-TV edu¬\ncational facilities of any in the nation.\nPlans are to locate the center on the Ohio\nState Fairgrounds, to be operated by Ohio\nState University in association with Miami,\nOhio, and Bowling Green state universities.\n^ A new state agency, the South Dakota\nBoard of Directors for ETV, is spearhead¬\ning a drive for legislative appropriations to\nbe matched with federal money in order\nthat the state’s ETV network can be estab¬\nlished. Martin Busch, KUSD AM-TV-\nFilm, has been elected secretary of the\nagency.\n^ Hawaii’s ETV network is expected to\nbegin broadcasts early this year. The Uni¬\nversity of Hawaii has established an Edu¬\ncational Television Broadcasting Service,\nwith Robert M. Reed as director, to be re¬\nsponsible for the production and transmis¬\nsion service of the network, a cooperative\nventure of the university and the state edu¬\ncation department.\nPLACEMENT\nPOSITIONS AVAILABLE\n(For information, write Miss Yasmine Mirza, Placement Service, at\nthe NAEB in Washington. In order to be considered through these\nchannels, the reader must be an Individual Member of the NAEB,\nwith credentials on file with the NAEB Placement Service. Non-mem¬\nbers can save time by sending the $10 annual dues and $10 Place¬\nment registration fee at the time of inquiry.)\nJan I Private liberal arts university in Northeast seeks highly experienced chief en¬\ngineer who is intelligent, creative, and sensitive to the requirements of a uni¬\nversity committed to excellence. To plan and operate a campus-wide closed-\ncircuit system and to provide maintenance of audio-visual equipment. Must be\ncapable of planning budgets, selecting equipment, and administering depart¬\nment. Starting summer 1966. Salary open.\nJan 2 Above institution also seeks highly experienced producer-director who is\nscholarly, creative, resourceful, and ebullient—therefore capable of working\nclosely with the great intellectual figures of our age. Starting fall of 1966.\nSalary open. . . . ,\nJan 3 Instructor in telecommunications arts in large Midwestern university. M.A. de¬\ngree and experience in directing and producing in TV required. Duties would\nvary from teaching beginning and/or advanced radio and TV production and\npublic speaking. Salary range for nine months: $6500-$7700, depending upon\nqualifications. Open in September.\nJan 4 Producer-director wanted for closed-circuit TV. Must be creative, experienced,\nand capable. Midwest area.\nJan 5 Producer-director, producer-writer ($6,000 and $8,000 for nine months, re¬\nspectively) and two cameramen in large university in Great Plains region. Im¬\nmediate openings.\n(Positions 6 throuqh 9 are with an expanding university mass communications\ndepartment in the\" Midwest. Salary and rank dependent upon degree and/or\nexperience. All are twelve-month appointments.) ,\nJan 6 Research associate. Ph.D. necessary, interest and ability in programed instruc¬\ntion. Position open now.\nJan 7 TV design and graphics specialist. Design television graphics and sets. Open\nsummer 1966. . .\nJan 8 TV staging and lighting specialist. To handle remote and studio staging and\nlighting. Open summer 1966. ,\nJan 9 TV traffic associate. To schedule production facilities of three studios, three\nremote units and six VTR's plus a distribution system to 105 classrooms and\ntransmitter. Open summer 1966, .\nJan 10 Production assistant with secretarial skills for division of university _ relations\nin large Eastern state university. B.A. degree plus experience in writing and\nproducing and in radio-TV-film liaison. Salary up to $5350. Opening in Feb¬\nruary.\nNEWSLETTER"
}