{
  "id": "d1343-2",
  "text": "NAEB NEWS LETTER\nNovember 15\nPage 3\nCopies of a manual on aHow To Partioipate11 are being mailed out\nTO 1,700 COLLEGE PRESIDENTS, 18,000 SUPER INTEN0CNT8 OF SCHOOLS,\n26,000 HIGH SCHOOL PRINCIPALS, 9,000 LIBRARIANS, AND NUMEROUS\nCIVIC GROUPS*\nA REQUEST -- OR A SUGGEST l SSL. .r .SSSLS/hSPBf MT.t m\nWhy not have the Federal Government set up a central agency to\nHANOLE ALL OF THE NATIONAL DEFENSE RADIO ~ L7ASES AND SUPPLY\nTHEM TO THE STATIONS IN ONE PARCEL IN SHAPE FOR RADIO? ONE RE¬\nLEASE RECEIVED ONCE A OAY OR ONCE A WEEK ‘ILL GET MORE ATTENTION\nTHAN A NUMBER OF NONDESCRIPT DRI6BLINGS FROM THE IT NY FEDERAL\nAGENCIES. IN KEEPING WITH TMC *UNI TED YfC STAND1* I Dt A LET THtfSE\nAGENCIES SET AN EXAMPLE IN COOPERATION.\nCLIFFORO J. PURR, NEW FCC COMMISS;ONER\nClifford Judkin9 Durr of Alabama became a member of the Federal\nCommunications Commission, takinq the oath at the Commission^ offices\non November I.\nMr. Ourr was nominated by President Roosevelt on October 13 for a\nSEVEN YEAR TERM, AND WAS CONFIRMED SY THE SENATE ON 0CT0BBR 29.\nHe fills the vacancy caused by the expiration, on June 30 last,\nof the term of Frederick I* Thompson, also of Alabama*\nSince 1936 Mr. Durr had been assistant general counsel of the Re¬\nconstruction Finance Corpot *.tion, with which he had been associated\nIN LEGAL WORK.SINCE 1933. KOFI TWO YEARS HE HAD SERVEO AS A DIREC¬\nTOR of the Commodity Credit Corporation, and when the Defense\nPlant Corporation was created in august of this year he was named\nits general counsel ano later became a director.\nBorn at Montgomery, Alabama, on March 2, 1898, Mr* Durr received\nHIS A.B. DEGREE FROM THE UNIVERSITY OF ALABAMA |NcI9I9*. THREE\nYEARS LATER, AS A RrtOOES SCHOLAR, HE WAS AWARDED HIS B. A. IN\nJURISPRUDENCE 1Y OXFORD UNIVERSITY, ENGLAND.\nReturning to the United States, Mr. Durr y/as admitted to the\nAlabama bar in 1923 and to the Wisconsin bar two years later.\nUntil entering Government service, he had, in turn, been connected\nwith THE Montgomery VAW firm of Rushton, Crenshaw and Rushton;\nthe Milwaukee law firm of Fawsett, Smart and Shea, and the Bir¬\nmingham LAY/ FIRM OF MARTIN, THOMPSON, TURNER ANO faCWHORTER.\nAMERICAN EDUCATION WEEK ON KFKU\nIn observance of American Education Week, November 9-15, the\nUniversity of Kansas School of Education, in cooperation with\nKFKU, PRESENTED DISCUSSION OVER THE AIR OF SOME OF THESE PHASES"
}