{
  "id": "d1902-0",
  "text": "NEWS NAEB LETTER\nNATIONALASSOCIATION - EDUCATIONAL BROADCASTERS\nPrank E. Schooley, Editor, Station WILL, Urbana, Illinois\nAPRIL I, 5 9-12\nAGRICULTURE IN WAR ON KWSC\nIn ADDITION TO THE USUAL GOVERNMENT PROGRAMS and SPOT LiOUNCEMENTS, the\nVictory Network shows, and other features available to radio station\nKWSC, THE 5000 WATT EDUCATIONAL OUTLET OF THE STATE Cq OF WASHINGTO\nIS CARRYING SEVERAL SPECIAL, LOCALLY-OR!GfNATED SERIES, WORDING TO\nKenneth Yeend, director*, The importance of the relation**.! p between\nAGRICULTURE AND WAR, IS RECOGNIZED IN THE STATIONS PROGRAMMING POLICYe\nThree daily agricultural programs contain much information related to\nWAR FARM PRODUCTION IN THE CAMPAIGN FOR VICTORY*, LOCATED IN THE HEART\nOF AN AGRICULTURAL AREA, THE STATE COLLEGE OF WASHINGTON IS ABLE TO GIVE\nVALUABLE SERVICE TO ITS FARM LISTENERS BY BRINGING ITS EXPERTS TO THE\nKWSC MICROPHONE TO DISCUSS AMD DRAMATIZE THE PLACE OF A\"CULTURE IN WAR\nWAR CONVOCATIONS ON WILL\nDesigned especially for faculty and students, but of qi\nTO ALL CITIZENS OF ILLINOIS, A.SERIES OF UNIVERSITY Co?\nPROBLEMS OF THf WAR WAS RECENTLY HELD ON THE UnIVERSIT’\nUndaunted by r tat ion of daytime operation only, W!Li\nENTIRE SERIES ANO BROADCAST THE ADDRESSES TO THOSE OF 1\nthe Statue of Illinois*\n\"WE ARE PREPARED OH WNYC»\n“We Are Prepare ' a new pa:,. , .a ; • m ... . ...\nWHICH ARE NOW UNDER WAY TO PROTECT AMERICA SS 9E|NgTpR£\nNew York City’s own station*, The new show replaced “Cf\nWritten and directed by Mitchell Grayson, the program devotes\nHOUR EACH WEEK TO ONE FACT OF THE CIVILIAN AND ARMED DEFENSE,\nSROM THE WORK OF THE ARMY I NTERCEPTCRS TO A|R F?A I D IvAROEnI%N\nConsumer Division of the War Production Bo\nPROGRAMS IS A CL\nANY PART OF THE THEY DO NC V ' . , T . L,\nNAEB MEETS MAY 4, IN COLUMBUS\nIn connection with the Thirtci\nMay 3-6, in Columbus, N4E8 v u\nMay 4, Room 1437 Deshle&vvall\nProblems perculiar to our sta‘\nl interest\ntions on\nIllinois can\nNSCRI BED THE\nARGER CAMPUS"
}