{
  "id": "d1902-10",
  "text": "-11-\nEDUCATIONAL RADIO MEETING IN CHICAGO, APRIL 2 and 3\nHale Aarnes, Chairman, Radio Education Department, Stephens College, announces\na two-day meeting in the Parliament Room of the Congress Hotel, Chicago, Friday\nand Saturday, April 2 and 3. The theme for the Friday session is \"Building an\nEducational Radio Unit\", Featured speakers include: Phil Spradling, Chief\nAnnouncer, FILL, University of Illinois; Robert Harmon of the Harmon Electrics\nCompany; F. Virginia Howe, Acting Head, Radio Section, Speech Department, Kansas\nState College; and Kathleen Ann Lardie, Manager, WDTR, Detroit Public Schools.\nBeginning at 2:30 p.m,, Saturday, the conference will get under way on its dis¬\ncussion of “Operating an Educational Radio Unit,\" Topics and speakers on the\nagenda include: “Organization and Operation” by Kenneth Christiansen, Radio\nEducation Department, Stephens College; “Radio Public Relations\" by John Dunn,\nManager, FNAD, University of Oklahoma; “Audience Measurement for the College\nStation\" by Dr. Joseph Seibert, Chairman, Department of Marketing, School of\nBusiness Administration, Miami University; and “Making the Radio Workshop\nServe the Public Interests\", by D. F. Feddersen, Chairman, Department of Radio,\nThe School of Speech, Northwestern University.\nTESTERN RADIO CONFERENCE IN CALIFORNIA\nWilliam Sener, Director, KUSC-FU, University of Southern California and N-A-E-B\nDirector, Region VI, reports that the Western Radio Coni'erence will be held\nSaturday and Sunday, March 20 and 21 at the Marines Memorial Building in San\nFrancisco.' Conference participants arriving Friday are invited to witness and\n.join in a discussion following a roundtable broadcast over KNBC. \"World Affairs\nAre Your Affairs,\" with Dr. Eugene Staley, educational director of the World\nAffairs,Council of Northern California and Frank Clarvoe. editor of the San\nFrancisco News.\nFeatured on Saturday's program in a discussion “Toward a More Responsible Use of\nPiadio\" are Watt Long of the San Francisco Schools and A. John Bartky, Dean, School\nof Education, Stanford University.\nAt the noon luncheon on Saturday, Richard Reeve, director of Radio, Sacramento\nCollege, will act as chairman and introduce Luke Roberts, director of education,\nKOIN, Portland, who will address the members of the Association for Education\nby Radio. Bill Sener. manager, KUSC-FM. University of California, will be one\nof the featured speakers in the afternoon discussion “The Local Station and\nCommunity Education.\" Chairman of the afternoon meeting will be Francis Noel.\ndirector. Audio-Visual Education Division. California State Department of Education.\nOn Sunday a Forum discussion on “Radio and the School\" win include Margaret\nPainter. Modesto High School and Marjorie HcGilvray, Mountain View High School.\nHerbert C. Clish. superintendent. San Francisco Unified Schools, will be chairman\nof the closing meeting on Sunday. Among the featured speakers will be Peter\nQdegard. president. Reed College. Portland."
}