{
  "id": "d1902-16",
  "text": "-17-\n(National) N-A-E-B BUSINESS PAGE (Regional)\nN-A-E-lTciear Channel Hearings TsenateV\nN-A-E-B president Hull filed an official statement with the Senate Interstate Commer¬\nce Committee re S-2231, requesting permission to testify in any hearings in connect¬\nion with the Johnson bill and the matter of clear channels,, In a reoly from the\ncommittee such permission was granted! the final date, however, of the hearings has\nnot been set. It is expected to be early in April. It is requested copies of in¬\ndividual station correspondence on this matter be sent to the president at 101.-\nColumbus Radio Institute (April 30 - May 3)\nYou have all received 'copies of the correspondence sent from N-A-E-B president's\noffice to Keith Tyler, Director of the Ohio Radio Institute and William Levenson,\npresident of the A-E-R. Plans calls for a ,jointly-sponsored meeting the afternoon\nof May 3 under the general heading of \"Serious Radio in America—The Responsibility\nof the College, the University, and the Citizen.\"\nPLEASE MAKE A SPECIAL NOTE OF THIS s N-A-E-B FILL HAVE ITS OWN BUSINESS MEETING ON\nFRIDAY, APRIL 30 AT 2:00 P.M.^IN^THE DESKLER-' ALLICK HOTEL. THIS MEETING TILL\nOCCUR BEFORE“FORMAL INSTITUTE SESSIONS BEGIN, EVERY REGIONAL DIRECTOR SHOULD BE ON\nHANDTaND EVERY HIUiBEl'VHO CAN POSSIBLY MAKE ~IT~~ THE' FOLLO’ ING ITEMS ; ILL COME UP\nFOR SERIOUS CONSIDERATION;\n(1) Washington Office and Representative\n(2) Constitutional amendments, and fund-raising\n(3) A working system of self-aid (engineering, legal, etc.)\n(4) State as well as regional directors\n(5) N-A-E-B Foreign Scholarship Program\nMAKE ANOTHER SPECIAL NOTE: THERE WILL BE AN N-A-E-B LUNCHEON SATURDAY AT 11:50 A.M.\nIN THE DESHLER V~a5JCX7TtHIS Mil' BE A JOINT N-A-E-~B A-E-R LUNCHEON, 01 IT 1LAY\nNOT BE — FINAL ^OID IS NOT YET~lNr\"HOI EVER PLAN* TcTeE ON 'HAND IN FORCE FOR THE\nSATURDAY LUNCHEON.\nAnnual Dues\nW. I. Griffith,. N-a-E-B treasurer, reoorts that about 90 percent of the members have\nnow paid their 1948 dues. He is most anxious to be able to report a 100 percent\ncollection with no delinquent accounts in time for the N-A-E-B meeting at Columbus.\nCooperation on the part of those who have not yet paid their 1948 dues will be\nappreciated.\nForeign Scholarship Program of N-A-E-B\nHarold Engel (FHA), Carl Menzer (VSUI), and Keith Tyler (Ohio Institute) will have a\nreport on the scholarship program for the Columbus meeting,. Developments have tsken\na new turn with the entrance of Rockefeller Foundation into dealings with the Army\nand the State Department for exchanges of radio personnel and for bringing some\nkey German personnel to this country.\nCopyright Questions and Answers\nBurton Paulu, manager of KUOM, University of Minnesota, has prepared a very thorough\nand careful analysis of copyright law as it relates to stations in the N-A-E-B. This\nwill be distributed to each member in the very near future. It is now being pre¬\npared for final release. Heretofore this has been a major area of concern with lots\nof questions and no answers, and Paulu has done an admirable job of bringing us up\nto date."
}