{
  "id": "d1902-25",
  "text": "FIi - Applications Accepted For Filing\nKEr - Science Education Foundation, Inc., Shaker Heights (P.Q. 7301 Euclid Aye..\nCleveland 3) - Construction permit for a new FM broadcast station (Class A) to be\noperated on 93»5 me., Channel #228, ERP of 637 watts and antenna height above aver¬\nage terrain 303 feet.\nNew - For Construction Permit\nFirst Baptist Church of Beaumont. Beaumont - Construction permit for a new FM broad¬\ncast station (Class B) to be operated on 92.3 to 107.9 me., ERP of 2890 watts#\nAmended to change frequency from 92.3 to 107.9 me., to Channel #300, 107.9 me.\n****\nThe Southwest Baptist Theological Seminary. Fort rorth - Construction permit for a\nnew FM broadcast station \"(Class Bj~to be operated on 92.1 to 103.9 me., and ERP\nof 2890 watts. Amended to change frequency from 92,1 to 103.9 me., to Channel\n#227, 93.3 me.\n****\nNET - Howard Payne College. Brownwood - Construction permit for a new FM broadcast\nstation (Class B) to be operated on 92.1 to 103.9 me., and ERP of 2890 watts.\nAmended to change frequency from 92.1 to 103.9 me., to Channel #290, 105.9 me.\n******\nSan antonio Baptist Association, San Antonio - Construction permit for a new FM\nbroadcast station Tciass B) to be operated on 92.3 to 107.9 me., ERP of 2890 watts*\nAmended to change frequency from 92.3 to 107*9 me., to Channel #289, 105.7 me.\n******\nRayland Baptist College, Plainvlew - Construction permit for a new FM broadcast\nstation (Class B) to be operated on 92,3 to 107.9 me., ERP of 2890 watts* Amended\nto change frequency from 92.3 to 107.9 me., to Channel #297, 107.3 me*\n******\nFor License\nWNYC-FM-City of New York. Municipal Broadcasting System, New York - License to cover\nconstruction permit (B1-PH-1067, as modified) which authorized changes in FM broad¬\ncast station.\nFor License\nRHCU-FM- Cornell University, Ithaca - License to cover construction permit (B1-PH-248,\nas modified) which authorized a new FM broadcast station.\nACTIONS (AMPLITUDE AND MODULATION) COLLEGE, UNIVERSITY, AND INSTITUTIONAL\n900 KC - New Station\nNorthwestern Theological Seminary and Bible Training School. Minneapolis., Minn.-\nConstruction permit for a new standard broadcast station to be operated on 900 kc«^\npower of 1 KW and daytime hours of operation. Amended re officers and directors,-\nMiscellaneous Actions\nNorthv/estern Theological Seminary and Bible Training School, Minneapolis, Minn#-\nGranted petition for leave to amend applications for CPS (BP-5273, Pocket 7922$\nBPH-970, Docket 7923) to show the election of Rev., T illiam Graham as president and"
}