{
  "id": "d1902-5",
  "text": "COMPOSER HOWARD HANSON CRITICIZES RADIO INDUSTRY\nThe radio industry in the United States is \"capitulating to greed\" according\nto a leading American composer conductor, Howard Hanson. In a lecture at Harvard\nUniversity, Hanson said radio has taken network time formerly used for music and\nturned it over to advertisers and jazz orchestras.\nHanson, director of the Eastman School of Music at Rochester, New York, also\ndescribed a recent decision of the American Federation of Musicians as \"unfortu¬\nnate.\" He referred to the permission extended to broadcasters to duplicate or\nbroadcast the same program simultaneously on AM and FM transmitters. As a result,\nhe said, the same soap operas now may be heard on both AM and FM radio.\nNETWORK OFFICIALS DON’T WANT1 STATE DEPARTMENT RADIO F.ESTOPS IBI LIT Y\nTy/o radio network officials, Edmund Chester (CBS shortwave director) and William\nBrooks* turned down a suggestion that the chains take over the State Department’s\nforeigti broadcasts. Senator Joe Ball (Minnesota Republican) made the proposal\nat a Senate committee hearing into a State Department request for 34 million\ndollars to continue its information program. Ball said he would like to get the\nState Department out of the broadcasting business and suggested it be done by\ncontrapt, Network officials said private business couldn't afford it,\nUNIQUE COMMERCIAL STATION POLICY\nStation TREX, new 10 KW Twin Ports, Wisconsin outlet announced it will function\nunder the advisory surveillance of a committee of area leaders representing civic\naffairs, labor, industry, cultural interests, church and service organizations.\nThis advisory board includes persons from Duluth, the Iron Range and outlying\ncommunities who will judge programs in the light of their educational and civic\nvalue as well as entertainment quality.\nMUTUAL GIVES TIME FOR AND AGAINST CIVIL RIGHTS\nMutual Broadcasting System set aside three half-hour periods on successive Tuesdays\nfor use by spokesmen of the southern opposition to President Truman’s civil liber¬\nties program with broadcasts scheduled for March 23, 30 and April 6 at 10:00 p.m.\nEST.Twenty-one southern senators asked for broadcasting time after the network began\na series on which the civil liberties report was narrated. The Senators called\nthe issue political.\nDOUBLE TROUBLE WITH DAYLIGHT TIME\nWith Sunday, April 25 pegged as the normal network switch to daylight time, net¬\nwork trafficmen were giving California dour looks. The \"golden state\"adopted\ndaylight savings time March 14 as a power-saving measure, six weeks ahead of the\nnormal switch. Since a heavy percentage of network programs originate in Califor¬\nnia it means they are performed one hour later there—by daylight time.\nIt is hoped if all four networks adopt the plan of delayed broadcasts (to stand¬\nard time zones) followed last year, that on April 25 radio programs will be back\non regular schedule. Meanwhile, broadcasters are giving considerable support\nto a measure now before Congress that would provide for uniform time all year.\nThe idea would be either to eliminate daylight or else to make its observance\nuniform throughout the country to avoid the annual confusion with clocks*"
}