{
  "id": "d1902-8",
  "text": "Certainly the right to speak pro and con on public issues is a basic right of free\nspeech and the concept (not true in fact) that the radio should offer a ’’milk-toast\"\ndiet is ridiculous. The protective rulings should be against discrimination and\nmonopoly not against the vigor of ideas.\nAny regulations forthcoming from the FCC, should bear in mind \"not the arms, but\nthe man\", and remember a minimum of regulation based on a maximum of principle\nis the heart of this 500 year old experiment in democracy. And the FCC must bear\nin mind that it too is a trusteeship of the peoples\n*** **-*\nINTERNATIONAL RELATIONS ENTRIES SHOT' LARGE INCREASE IN 12th ANNUAL PROGRAM\nmiBITION*\nAmerican broadcasters were more international-relations conscious in 1947 than ever\nbefore in radio history, it was indicated recently in a preliminary survey of en¬\ntries submitted for the 12th Annual Exhibition of Educational Radio Programs at\nOhio State University, Of the fourteen educational and public interest classifica¬\ntions into which this year's programs vrere grouped, that of \"furthering internation¬\nal relations\" showed the largest increase, drawing approximately three times as\nmany entries as last year. Three not too close runner-ups, which, nevertheless\nindicated significant increases, were the personal and social problems, cultural\nand public issue groups.\nOne of the oldest and most firmly established in the exhibit-strewn radio industry,\nthe Ohio State educational broadcasting exhibition is offered yearly in connection\nwith the 16-year old Institute for Education by Radio, held in Columbus, and attracts\nsample recordings of the best urogram offerings of radio stations and national\norganizations, broadcast during the preceding year in the interest of public educa¬\ntion. Topping all previous exhibit records, this year's total of entries is expect¬\ned to near the 600 mark, when complete tabulation is available, said Dr. I, Keith\nTyler, Institute head and director of the exhibition. Deadline for entering the\nexhibit was February 1,\nPreliminary screening of entries, involving literally hundreds of listening hours,\nwill be handled by local judges, with the exception of network presentations which\nare judged \"live\" in New York, and three \"in-school\" program groups which are to be\nevaluated by a Detroit committee uhder the direction of Mrs. Kay Lawrie, supervisor\nof radio in the Detroit public schools, A final judging committee will consist of\nat least one national authority in the field of school broadcasting and possibly two\nnetwork representatives, chosen because of their ability to judge educational value,\nradio quality and audience appeal.\nExhibit awards are to bo announced during the 1948 meeting of the Institute for\nEducation by Radio, April 30-May 3, at the Deshler V'allick Hotel in Columbus, and\nwinning programs will be available for audition during the 4-day meeting.\n*•** **-*\nPersonnel r'anted\nContinuity-News Director, housing available, one-month annual vacation, £3600 (plus),\nto teach radio writing and supervise students in writing at KWSC.\nProduction Manager, housing available, one-month annual vacation, £3600 (plus), to\nteach live production and supervise students and faculty in production directing on\nKWSC.\nEducational-Events Director, housing available, one-month annual vacation, about £4000\nto teach radio education production, public events and supervise students and faculty\nin educational programming on KVSC.\nSpecial Events-Sports Director, housing available, one-month annual vacation, about\n£3900, to teach sportscasting and supervise students in special events for KWSC.\nAddress application to; Frederic Hayward, Radio Station KWSC\nThe State College of Washington, Pullman, Washington"
}