{
  "id": "d1902-9",
  "text": "1948 RADIO CONFERENCE - NORMAN, OKLAHOMA\nReported by Ed Wegener, 1.01 Production Manager\nSherman Lawton has done it.againi This yearTs radio conference at Norman was up to\nthe usual high standards one expects when the folks at the University of Oklahoma\nget their annual meet organized. Commercial, educational and network radio folks\nwere there, as well as the usual complement of agency and other allied industry\nrepresentatives.\nThis year’s meeting, held on the University’s North Campus, all took place in one.\nbuilding—the Extension Study Center, which fact probably accounted for consistently\nhigh attendance at the individual sessions.\nWorth the Price of Admission Alone\nOutstanding for this observer were the first noon luncheon, to which Tom Rishworth\nof Radio House, University of Texas, made an excellent after-lunch talk on what\nthe colleges can do for radio; the session on religious broadcasting; the meeting\ndevoted to women’s programs where Julie Benell of KOMA laid down the formula for\nsuccess for women broadcasters; the session on music where Edward Dunham, producer\non the ’’Voice of Firestone” and Roy Harlow of BMI, both had challenging and im¬\nportant things to say about music on the air; and finally, the closing dinner meet¬\ning where television was dealt with by Mr. Straker of BBC and Ardien Rodner of the\nChicago Television Advertising Production Company, Unfortunately, I missed the meet¬\ning on music where representatives of BMI and ASCAP took off their gloves for a\nbit of ’’hand-to-hand” discussion.\nIt seemed to me that college radio was inadequately represented at Norman in terms\nof numbers of representatives. Tom Rishworth was there, as before noted. Baylor\nwas represented well by John Bachman and, of course, the Oklahoma crowd was much\nin evidence; but other than that, our commercial friends and the NAB took the lime¬\nlight, What were all the college people doing on February 26, 27 and 28?\nIn some ways, this meeting was even more stimulating than the Ohio State conference,\nbecause it was more intimate and less distracting in terms of alternates...that is,\nother sessions you feel you should be attending while you’re sitting in on this\nparticular one. For that reason,I felt that the NAEB folks were missing a good\nbit by not being down at Norman in greater numbers. After all, someone has to\nspeak for sanity when the NAB \"big guns” start sounding.\nNeeds Correction\nThe most serious criticism that can be made of the speeches that were part of the\nmeetings is that too many of the speakers read from prepared statements as if they\nwere making a formal report to a board of directors. Outstanding in this respect\nwas one representative of a network whose material was excellent, but his presenta¬\ntion made it difficult for one to stay arqund for the material#\nThis Is That They gaid\n’’This is the best conference Sherman. Layrton has ever got together,”\n’’Y.'ish we weren’t way out here in the countryj”\n”It looks like the v/holq University of Texas dame up.'”\n’’That man Hardy, of KSL, speaks well, hut wljnt hid he say,f!\nOrchids to the folks'ht Oklahoma!.’ !"
}