{
  "id": "d29-101",
  "text": "2.\nAs it happened, this crucial matter only came up at the\nvery end of our visit, and the rest of our long conversations\ntended to analyze all media study procedures in which he has\nbecome deeply interested.\nLet me emphasize that one of the matters that excited\nhis interest most was my point that it is possible to distin¬\nguish between a code and a language in terms of the moment\nof saturation in learning, and that this moment can be detected\nwhen a child is prepared to play with meanings and sounds and\nwords. This moment of betwixt and between is, of course,\nthe world of Lewis Carroll and Edward Lear.\nWe discussed at some length the language saturation\ntheory as it concerns the whole language of media and I suspect\nthat the entire body of data that Poshay has covered with\nregard to learning theory is relevant to the Understanding\nMedia project. I hope, very much, therefore, that some means\ncan be found to retain him as a fairly frequent consultant\nto the project on an official basis.\nI shall go to work at once on drafting the syllabus, and\nwhen some sample pages are available, I shall send copies to\nyou and all the members of the committee for appraisal and\nsuggestion and, in the meantime, I shall hope to correspond\nwith Poshay on the subject of the K.O.R. by means of relatively\nshort teaching efforts. His replies I shall ask his permission\nto circulate among Sam Becker *s committee.\n*\nPoshay is really quite pepped up about this whole project\nand has said many/times that it is the only new thing in\nJpJ^catiQn to-dayCjiffy own way of phrasing it would be perhaps\n”tHatr^?w6y was right in his over-all awareness of the\neducational needs of our century, but that his entire absence\nof knowledge of educational media, including the written word,\ndeprived his program of any effective means of implementation.\nHe was too early to have had the obvious media facts thrust\nunder his nose, over and over again, as we have*\nA bit of luck occurred when Tom Bledsoe, new head of\nthe Council for Basic Education turned up in New York in time\nto meet Poshay. I discovered from Poshay that the Bledsoe*s\nCouncil is dedicated to the destruction of Dewey and all\neducationalists, and I may be the means of reconciling these\nancient enemies. Certainly, Bledsoe understands my media approach\nand is quite able to see how it complements Dewey and he is in\nthe best possible position to resolve the squabble between\nhis council and the teachers college world. If you don*t know\nBledsoe *s background, it is briefly as follows:\nUniversity of Illinois, graduate in English Literature\nwhich he taught in various universities; then college editor\nof Rinehart Books and college editor of Knopf whence he was\nhoicked to the editor of Beacon Press where he set up their\nWun?er£U?' 5aUer back series; then he thought he would take a\nshot at independent publishing as founder of Arlington Books\ninc., and now he has just moved to Washington as head of council\ncontinued..."
}