{
  "id": "d29-11",
  "text": "UNIVERSITY OF MICHIGAN\nMICHIGAN MEMORIAL-PHOENIX PROJECT\nANN ARBOR\nDecember 9, 1959\nOFFICE OF THE DIRECTOR\nProfessor H. M. McLuhan\n96 St. Joseph Street\nToronto 5, Ontario\nDear Marshall:\nI wish to thank you for your most provocative media log.\nAfter having read it three times, with new thoughts emerging each\ntime, I am more than willing to concede that there are some challenging\nideas contained in it. In particular I don’t believe I got from\ntalking to you in Washington the full impact of your notion about\nsystems revealing themselves in collision, but it certainly hit me\nfrom the media log. I have, in fact, this week found certain exten¬\nsions of TETs”notion which are an almost necessary part of the book\nI am trying to do on value and if and when the book becomes publish¬\nable I would like to include reference to your media work in it.\nWith my own merely superficial acquaintance with the subject\nmatter of your immediate concern, my first inclination is to suspect\nthat you overvalue the extent of change in the particular systems\ncollisions you discuss. I am, for example, informed that the volume\nand supposedly the quality of print has increased following the\nintroduction of television, but I can find little indication that\nthe kinds of composition, semantics format, or discursive method\nhave altered. Nevertheless I admit both my own ignorance in this\narea and the fascination of an idea which challenges some of my\na priori convictions. I shall examine further.\nVery sound, in my own opinion is your statement of the only\npractical liaison between in-school and out-school training being\ninstruction in the modes and effects of media on human perception.\nI remain, however, skeptical of the degree to tfich different media\nproduce differential learning because of different or multi-plane\nwxperiences. I remain skeptical because of the digitalizing character\nof man as a low grade computer - he chops these experiences into\npieces of about the same size and shape before they ever get into\nhis brain. The pretty well known circuitry of the neuron, for\nexample, seems to tell me to be distrustful of any sizeable incre¬\nment to the learning process as a result of increased simultaneous\nsensual experiences.\nAnyhow it was both fun and profit, Marshall, and I will look\nforward to further scoop from your operation.\nRoger L. Leatherman,\nAssistant to the Director"
}