{
  "id": "d29-116",
  "text": "Dr# Ilarshcll IisLuhon, ?o(p 2, Soptcribor 15, 1959\nTho problem will bo, cus each rcesago-vic^iwaodiR is nrc conte d, to bo\nable to obsorvw, roasuxe end rocord what happens to to recipient*©\nmind (©notions* attitude*c, etc#)# How do wo ODceurc to stfeliminal\noffsets you spool: of? Doc a advertising provide clues? jloctrodo\ntesting? Interviews? Psychiatric techniques?\nI don*t think tho $db you can do at first will be perfect# There will\nbe carpers# But it should bo os valid as integrity con noto it#\nStudents end tonetors can bo given sam scales on tho basis of which\nto rocord parallel inproesiarts, deviant ones, and ircnlly \"nutations,11\nwhich ana particularly important#\nBroadly, the United States is confronted with the problem of education\nin a multi-cultural world* Tours is tho problem of the identification\nof messages and conditioning in a nulti-redia world#\nWhen I was a graduate student, studying under native Wrench professors,\nwo used the \"explications do toxto\" proooduro# We tore opart, analysed,\netc# But all wo disc arc re cl wore tho mate rial and intellectual ingre¬\ndients# We say to parte, but not to (pnjas that nodi ton a groat\nunit# I think wo need to incurs rxesuring to whole as woll as to\nparts in this project — preserving to total mosaic, as you call it#\nUhat tests (researchers can, I hope, tell you) o:riLot which come closest\nto being able to measure what X*vo been talking about?\nIlrybe to projoot con coni np with sore which advance to cause of\ntesting and axacurement — \\Mch new is too print-based in orientation#\nAny ideas, anyone? Ilotr is a stained glass trindew (light through)\ndifferent feom a painting, photograph (light on), cto#?\nHow is a TOacfer-viwioxwiistDner affected by to best possible descrip¬\ntion of m actual murder (or any other actual objective event or case)«\nvia TIT?\nvia to newspaper?\nvia radio?\nvia film?\nvia still photos?\nWhich madia most \"shoclx\" —. or lends itself to analysis of motives?\nWhy?"
}