{
  "id": "d29-117",
  "text": "Dr. Hardball tbLuhan, ?a£p 3, Soptortoor 15, X9$9\nIf any of you have bettor Ideas, out idth ti»ra§ But t*«d hotter get\ngoing!\nHoc? does a statcimnt of an objective fact faro whent\npresented by a good reader via radio?\npresented by a bad reader via radio?\npresented by a atronc personality via TV?\npresented by a weak or antagonistic or syisiathetic\npersonality via TV? Vis £iln? Via bine or\nvideotape? Live?\nVariants on this con extend into Tine-style Journalese, reporter styla, etc.\nVJhat is nsw (as perceived — or as identified with help by you, discing\nbe lew the surface of consciousness at first, perhaps in interview) in each\nvariation — in tto conditioning, effect on attitude, affect, information\nfocus, etc.? To Tibet extent does education in one rjediun strengthen (or\nTioaten) tho uneferafcanding of all rodia, aryp», and vice-versa?\nHow effective is each median in expressing cordiality, hospitality,\ninnuendo, defense (against persecution), etc.? Art* people convinced\n(in each and to what degree) or persuaded by facts, or the medium, or\nemotion, etc#?\nlife®re Id3Q interested in how much more fact one medium can cany than\nanother than whet differences, or distortions occur* TJlixrt incentives\nto further investigation or action? And hew does each affect attitude\n(toward the fact, the subjects in it, the relator of them or the teacher,\npersonally and os a representative of a profession)?\nHow do the various media coqparo in transmitting transnational ideas,\ncrossing language barriers, transmitting emotional content (the basis\nof many decisions today), prejudice, aesthetic experiences, etc*? In\nwhich does the liotoncjvrc;acbswiewor seem to supply the most from\ninside himself, to round out tho picture? Hoc; \"adequately4* in each\ncase? IJhich are tjd proudest to understand? How (on tho basis of\nelectrode or mstabolic measurement) does the body react to solving a\nproblem presented by each? Can wo record tho energy cxpan<tod in\nviewing, listening, reading different types of materials? ;jhat does"
}