{
  "id": "d29-12",
  "text": "W A Y N E S T A TE UNI V E E S\nCOLLEGE OF EDUCATION\nDecember 10, 1959\nDETROIT 2. Ml\nProfessor Marshall McLuhan, Director\nProject in Understanding New Media\n96 Saint Joseph Street\nToronto 5, Ontario\nDear Marshall:\nWe are ready for your coming on the 17th and 18th. If you will let me\nknow the exact time your train arrives in Windsor, I will pick you up on\nThursday morning. Also, keep your receipts of all expenses incurred in mak¬\ning the trip. We will need them to take care of your reimbursement here.\nJohn Ellery, Bill Hoth, and I have been working on the plans for your\ntwo days here, and I hope you will not think we have structured things too\nclosely. Here is the way it looks now. On Thursday from 9:00 to 4:30 we\nhave reserved a seminar room for about fifteen people in our new McGregor\nMemorial Conference Center. We have taken care to invite people who have\nhad some previous interest in media study and who are interested in pushing\nfurther some of the ideas in your Media Log. I will send you a list of these\npeople, and I think you will know most of them.\nOn Thursday evening I think Chandos is planning a little informal dinner\nfor you at her home which will involve some of the people who were with us in\nWashington.\nFriday morning the other four members of our Ford Foundation research\nteam would like to spend the morning y/ith you getting your reactions to some\nof our concerns with media study in teacher education. I'll be there too.\nFriday afternoon we have left open for people who might like to see you in¬\ndividually or for things you would like to do.\nMy wife and I would very much like to have you stay with us while you\nare here. You will be sleeping near a great many books, but they will prob¬\nably not cause too much difficulty.\nWe would like very much to know if you have some ideas about how to\nproceed with the group of fifteen on Thursday. Would you like to make an\nopening statement to the group? Should one of us be chairman of the seminar?\nAre there some special questions you would lile answered? What kinds of out¬\ncomes should we shoot for? Let know and we'll try to set things up so we\ncan really be of some help.\nSee you Thursday morning at the train station in Windsor.\nCordially,\nfiJr\"\nRES/njt\nRobert Shafer"
}