{
  "id": "d29-123",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nDr. Harry J. Skornia\nExecutive Director\nNAEB\n14 Gregory Hall\nUrbana, Illinois\nofCE IV c.O\nU£headquart,ks\nAUG18 1959 ^\n1\nDear Harry:\n14 GREGORY HALL\nURBANA, ILLINOIS\nAugust 17, 1959\nAm having a terrible time trying to find a date on which we can\nget a quorum of the research committee together with Marshall. The\n23rd and 24th of September are impossible for Harwood and difficult\nfor Evans. I have not heard yet from any of the other members.\nEvans would prefer that we move the meeting over one day and make it\nthe 24th and 25th of September. Harwood could not meet until some\nweek-end in October. It seems to me that we must meet either the\n23rd and 24th or the 24th and 25th of September or during or just\nprior to the NAEB convention as difficult as this might be. Do you\nlave any reactions to these? Actually, the more we go around and\naround on trying to find a date the more I am of the mind that it\nmight be best to stick with the 23-24 dates and those who cannot come\nsimply will not be there.\nIt occurred to Harwood and me, as we talked on the phone, that it\nwould be extremely helpful if Marshall could begin to get some organized\nthoughts down on paper and distribute it to the committee prior to our\nmeeting. I was thinking that it would probably be helpful to us — and\neven more to him — if he took one of the media and pulled together his\nideas or hypotheses or questions about this medium. Then it seems to\nme we would see where the gaps were in his picture of this medium, what\nkinds of data were still needed and we could discuss the sort of approaches\nthat could be taken to collect these data. If he could do this for each\nof the media which he plans to cover in this study, I believe that we\nwould be able to make much better use of our time at the meeting of the\ncommittee. Each of us could be further ahead when we arrived and could\nhave some ideas arrived at from studying Marshall's document. What do\nyou think?\nPlease let me know immediately on the dates since we must inform\npeople right away and I will need to make arrangements to be away from\nhere at that time.\ncc: Dr. Marshall McLuhan\nToronto, Ontario\nCanada\nBecker"
}