{
  "id": "d29-139",
  "text": "f\nNEWSWEEK BUILDING • 444 MADISON AVENUE • NEW YORK 22\nPLaza 2-1500\nDr. Harry Skornia\n111 Gregory Hall\nUrbana, Illinois\nDear Dr. Skorniat\n31 July 1959 RECEIVED\nNAEB HEADQUARTERS\nAUG 3 1959\n*« p*\n7iMiWii,2|i|2|?|4i?|f\nl\nThough the story we had hoped to write has been held for an indef¬\ninite length of time, I write to thank you fbr your help in sending\nus material and suggesting ideas. As work on your project progresses\nwe would appreciate very much any further information you might care\nto release, about both the project and its results. You are doing\npioneering work, and it deserves all the notice it can possibly be\ngiven.\nI am personally interested in your project because of my own studies\ninto the idea of time. This Spring I completed a senior honors es¬\nsay at Yale discussing the idea of time in William James, Henri\nBergson, and James Joyce; the essay tries to show the consequences\nof the Jamesian-Bergsonian notion of a time altogether present, and\nthe way, in ULYSSES, Joyce both satirizes and uses this notion. If\nyou have looked through Lewis Mumford’s TECHNICS OF CIVILIZATION, or\nremember McLuhanfs Sewanee Review discussion of the newspaper form\nin ULYSSES, the possible ramifications of the time problem should be\nclear* Probably this approach is obvious to you, but though the\nconstriction of the modern sense of time (television, with its »mon-\ntag£f effect, is a powerful offender here) may not be so much the\ncause as the result of technological change, it is a useful hook on\nwhich to hang most of the widely-varied causes. To suggest a few,\nwhich again may be completely familiar to you!\n—Technological obsolescence and the modern cult of youth.\n—All the factors,—media, mass hysteria, advertising, etc.—which are\nincluded in the phrase ’modern mass myth’.\n—The important ethical problem of decision (in television, for ex¬\nample, a viewer may ’decide’ to buy a product because of irrational\nor subliminal hints built into the commercial he is viewing, not from\nany rational consideration of whether or not it is needed, or can be\nafforded. His’decision’ is false, and akin in a complex way to stim¬\nulus-response systems. The problem is more important as it carries\nover into ethics and morals; in all cases it results from a blanking-\nout of memory and consciousness of future needs).\n1 -\nTHE\nMAGAZINE\nO F\nNEWS\nSIGNIFICANCE"
}