{
  "id": "d29-143",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 GREGORY HALL\nURBANA, ILLINOIS\nJuly 27, 1959\nDr. Harry Skornia *\nExecutive Director\nNAEB\n14 Gregory Hall\nUrbana, Illinois\nJUL 2 8 1959\nDear Harry: j\nIrv Merrill and Hide Kumata have suggested that the research\ncommittee meet with Marshall McLuhan on the 9th and 10th of September\nin Cincinnati. The American Psychological Association is meeting\nthere from September 3-9. Scheduling our committee meeting at that\ntime would make it more likely that we could get the committee to¬\ngether because many will be at that meeting. It would also mean\nthat some who might not otherwise go to APA would go and, as Irv\nput it, \"take in the pertinent sessions of the convention to stimu¬\nlate our experimental thinking.\"\nI think that this is a pretty good idea. The only problem is\nthat this comes in the middle of the vacation period for all academic\npersons, who are generally off until about the 15th or 20th of Septem¬\nber. Whether some of the committee will be off vacationing someplace\nat that time, I do not know. I am still not sure of my plans for this\nperiod but will probably be available by the 9th.\nAnyway, what do you think. Will Mac be back from Vancouver by\nthen?\nI am happy to say that I believe that I am going to have more\ntime to devote to my own research and the supervision of graduate\nresearch in the future. I have gotten the Provost to agree to let\nme delegate most of the responsibility for production supervision to\nother people - though the ultimate responsibility will still have to\nbe mine. I am going to have Winnie take over most of the responsibility\nfor our in-school and public relations programs, another fellow take\nover responsibility for our \"creative\" experimentation in production -\ndrama, etc., and a third take over responsibility for film production.\nUnfortunately, I cannot yet shuck any administrative work - but at\nleast this is a step in the right direction and I am much encouraged."
}