{
  "id": "d29-149",
  "text": "PROJECT IN UNDERSTANDING NEW MEDIA\nIn the broadest sense, the object is to devise a means of bridging\nbetween in-school and out-of-school experience. Since the sheer flow of\ninformation outside of school is out of all proportion to the in-school\ninformation flow, this fact alone without regard to the forms and modes\nin which this flow occurs indicates a new educational need.\nA possible new strategy presents itself from the fact of the inter¬\naction of multiple media to-day. In teaching writing and language, the\ngreat changes in recent decades have arisen from the fact that print now\nexists as only one among several major media. Photography, film, audio\ntapes, radio and television have all x-rayed, as it were, the older medium\nof print, enabling us to see its structure as a form of experience. This\nstructure was not visible in the ages of printing but what the new media\nhave done to print they have also done to one another, rendering themselves\nstructurally luminous from within.\nTo understand media in this over-all structural way offers a real\nshort cut to the education of perception and Judgment. For the various\nmedia exert a direct non-verbal pressure upon all habits of perception\nand Judgment. It has not been sufficiently noticed that these powers\nexercise an almost exclusively non-verbal and subliminal pressure upon\nthe assumptions within our experience.\nFor example, the telephone has changed the patterns of decision¬\nmaking to such a degree as to make the older structure of delegated author¬\nity in business and management not only obsolete, but a threat to the con¬\ntinued existence of management functions. This clash between telephone\nand typewriter has received only incidental appraisal in Parkinson1 s Law.\nIt has caused the sudden rise of many management centers which attempt\ndecentralization by means of over-all training of specialists.\nThe impact of new structures such as photography and film upon habits\nof learning and Judgment are, of course, far greater than that exerted by\nthe telephone. Obsession with \"content*1 seems infallibly to obscure the\nstructural changes effected by media.\nThe future of navigation in education at any level depends upon an\nexact knowledge of ever-changing lines of forces exerted by new media\nstructures, and beamed irresistably into our personal and social modes\nof awareness.\nTo provide ways of discerning these lines of force, these currents\nnot of opinion but of perception, is the aim of the Project in Understand,\ning New Media.\nMarshall McLuhan"
}