{
  "id": "d29-157",
  "text": "-4-\nwork In favor of auditory all-at-onceness* £t would &eem that artists,\nof all media, respond soonest to the challenge of new pressures* X\nwould like to suggest that they also show us ways of living with new\ntechnology without destruction of earlier achievement and form.\nIf there is one theme in all the arts of the past century it is\nthat of the need for relevance in the patterns of human interests* To\nbe out-of-touch with one's time, they have not ceased to urge, is to\nbe irrelevant*\nTo cultivate irrelevant attitudes and rhythms and order is to be\nnot only futile but to be an enemy of one's fellows*\nPrior to the cry for relevance was the idea of steadiness of per¬\nspective and consistency of point-of-view* This was the visual man's\nstrategy and bias from Gutenberg and the Renaissance onwards* But since\nBaudelaire and Cezanne such individual perspective has been held to be\nas irrelevant as \"self-expression*\"\nIt needs no insistence to show that \"relevance\" is an all-at-once,\ninclusive, and total affair, and that as an attitude it is born of the\near mode of awareness; whereas individual point-of-view is the eye\nmode and is bora of a technology in which mechanical and animal forms\nare dissociated*\n(The wheel, for example is referred to as the classic instance\nof the separation of mechanical and animal form; whereas today, with\nrocket and air-cushioned saucers and electronic circuits in which there\nare no moving parts, there is a transmutation of mechanical into animal\nagain, as it were* We more towards the post-mechanical*)\nThe ear mode of all-at-once or total-field awareness seems naturally\nto prepare the climate of opinion to welcome organic and ecological ap¬\nproaches to problems of education and society, of the arts and industrial\nproduction alike*\nIf my diagnosis is on the beam, does it not afford a means of iso¬\nlating causal factors and relations in our open society of over-all co¬\nexistence? Will it not be possible to test my diagnosis by careful\nchecking, for example, of the impact of one medium upon another? Just\nas electronic nuclei can only be reached or probed by other accelerated\nelectrons, cannot we not use the action of the media themselves upon\none another to reveal their powers and properties?\nWhen radio is released in a widely and long-literate area like the\nU* S. its effect on social and psychological structures would seem to\nbe quite different from the effects of radio in Japan, or Germany or\nSpain* But the effect of radio on non-literate areas like India, Iran,\nor Africa would seem to be quite different again*"
}