{
  "id": "d29-158",
  "text": "-5-\nThls approach of mine is structuralist but is not derived from\nthe recent field of structural linguistics. Rather it derives from\nthe practice and criticism in the field of poetry and painting during\nthe last 100 years. However* the electronic tapes which are ending\nthe assembly*line in industry also made possible structural linguis-\ntics. And this new field* as it clashes with older language study and\nteaching, affords another instance of the clash of ear and sye 8true*\ntures of knowledge. For to the structural linguist the fact that the\nletter \"k,\" for exasple, as written, may suggest a single sound, does\nnot hide from him the fact that there are several quite distinct \"k\"\nsound-structures mastered by every child by two or three years of age.\nFor the \"k\" in \"quick\" Is not the \"k\" in \"chalk.\" Using the fill-at-\nonce approach of electronic tape, the linguist becomes aware of the\ninterpenetration of the alphabetic sounds and the consequent modifica¬\ntion of letters that look alike in the one-thing-at-a-tlme world of\nthe written word. So he doesn't hesitate to say that written letters,\ninsofar as they pretend to point to distinct sounds, are a very crude\ngimmick for reducing couples and subtle qualities of sound to mere\naverages.\nBut the ear order of the structural linguist finds a clash whan\nhe turns to the visual order of words on the page. What has long passed\nas \"granmar\" to the visual and literary person seems crude and arbitrary\nto the ear perception of the structural linguist. Here ha could be\nmistaken.\nThe eye-order of the printed page and of the written word, as\nsponsored by the grammarian, may lack the organic unity and delicacy\nof spoken idion. But eye-order may here have a validity imperceptible\nto the structural linguist with his subliminally-espousad ear-order via\nelectronic tape.\nBut the pros and cons can more easily be tested whan the real\nnature of the clash is clarified.\nThe eye man in this order of observation is satisfied that film\nand TV images are roughly alike. Yet just as small children can make\nthe most delicate distinctions of subtle sound structures, so do they\nreceive and react to the distinction between movie and TV imagery.\nThat is, between the still shot and the continuous pick-up, between\nlight on and light through an Image, etc.\nThis illustration may serve to introduce a theme that could be\ncrucial to the Understanding Media project. Professor Johnson of\nMcGill's department of Psychology has been working on what can be called\na \"saturation theory\" of learning. 1 look forward to conferences with\nhim. Because if a child can learn a language by three or four in the\nsense of being at horns with its sounds, gestures, and syntax, how long\ndoes it take a child to be at home in the sane way with the structure of\nprint, photo, film, TV, radio, and gramaphone?"
}