{
  "id": "d29-159",
  "text": "-6-\nThis question includes another: Can familiarity or saturation\nwith one medium block introduction to others? the child who learns\none language before another will have only one anther-tongue. He\nwill not learn the second In the same total way as the first. Carl\nOrff, the Viennese composer, has a music school in which he seeks to\ntrain his pupils before they can read or write. His view is\nafter literacy nobody can really toaster the modes of music.\nThis approach, quite apart from the validity of the particular\ncase, suggests that in understanding media we might check whether the\ncurrent familiarity of children with photo and TV, for ©sample, before\nthey read and write may really be an unfortunate sequence. I am sure\nthat if a more natural and fruitful sequence of madia experience exists,\nit can be discovered and demonstrated. This approach is related to the\nnow accepted idea that some media are especially indicated for some\nkinds of learning. But Ferguson's theory that saturation in i*nC.ag^\nand media experience occurs very early may prove of major aid in study.\nIt certainly points to a variety of procedures and controls in observa¬\ntion (diet have been lacking.\nSpeaking casually to a member of the Institute of Child Psychology\nin Washington 0. C., I just happened to inquire, \"What is the effect\nof the telephone on children?\" The reply was this: \"We know one thing;\nnamely, that neurotic children are normal when using the telephone.\"\nThat remark suggests, to me at least, a basic aspect of all tasdia: that\nexperience in one is transmuted and translated into a different experi¬\nence in another. Some people stutter in English but not in French or\nSpanish.\nWould it not interest Bell Telephone to use their research labora¬\ntories to consider some aspects of their medium in relation to other\nmedia and to the training and education of children? That is, can we\nnot enlist the resources of all the communication industries to concen¬\ntrate on discovering the inter-relation of media in terms of experience\nand education?\nCan we not reasonably expect to interest Remington Rand and Under¬\nwood, etc., in investigating the effect of composing on the typewriter?\nWhat is the effect of publishing oneself, as it were, while composing\nat the typewriter? What has been the effect of the typewriter in struc¬\nturing decision-making in our world? How has the typewriter been affected\nby tape-recorders? What has been the effect of the typewriter on the\nwriting and publishing of books and newspapers? On the short-story?\nOn poetry? On reading habits?\nSpeaking to top executives of General Electric at Crotonville\nabout their attitude toward media study, I was assured, \"We will help\nyou in every way we can,for whatever raises the general leval helps us,\ntoo.\"\nThat was also the reply of the NBC."
}