{
  "id": "d29-161",
  "text": "-8-\nThis raises a major issue for us all to study: Stasly, when\ndoes a mechanical code of transmission of information itself become\na language? Under what conditions does a language revert to a code\nof transmission? With our new coding devices today such as movies\nand TV, tapes, discs, radio, teletype and so on, we are setting about\nto establish whether these means of transmission have themselves so\ndeeply altered human sensibilities and re-shaped human institutions\nand attitudes as to have acquired the status of new languages* For\nto an infant, English is not a language but a mechanical code. To an\nadult beginning Russian, that, too, is at first a mechanical code. It\nbecomes a language only when it has become subliminal to him. English\nin its totality becomes a code again to the structural linguist who\nbegins to translate the whole structure into auditory terms alone. To\nthe same man as a speaker of English, it exists in all his senses at\nthe same time.\nIs a code the translation of one sense into another single sense;\ne.g.. Horse code? Morse reduces the nailti-levelled structure of Eng¬\nlish into one sense — the ear. It is at once translated into a code\nfor the eye.\nWhen writing was invented it was a visual code for a many-level led\nauditory thing. Phonetic writing has proved much the most powerful of\nwritten instruments for it abstracted •’all\" meaning from the visual code.\nOther kinds of writing did not attempt to divorce the code from meaning.\nOnce this divorce had been effected, it was possible to translate any\nsound structure into phonetic alphabetic form. The phonetic alphabet\ngave to the Graeco-Roman world the power of conquest of all cultures it\ncontacted. We see that aggressive power today at work in India and\nChina.\nToday by means of \"translating machines\" we are setting out to do\nwith entire languages what once was done in divorcing meaning from visual\nwritten forms. When by frequency counts we have averaged out the lexical\nmeanings of all words in a language w© can use that language as a mechan¬\nical code such as it is for a beginner. When the same has been done for\nother languages they can be translated into on® another lexically and\nsemantically, just as they formerly were reduced from auditory to visual\nstate by means of the phonetic alphabet.\nWhat I am saying is that new madia may at first appear as mere\ncodes of transmission for older achievement and established patterns\nof thought. But nobody could make the mistake of supposing that phonetic\nwriting merely made It possible for the Greeks to set down in visual\norder what they had thought and known before writing. In the same way\nprinting made literature possible. It did not merely encode literature.\nThat is what I mean whan I say that (in the not-so-long run) the\nmedium is the message. So that what we have to study now is what totally\nnew curricula and modes of organisation are inherent in our current\nnew media?"
}