{
  "id": "d29-25",
  "text": "Department of Speech\nAnd Dramatic Art\nState University of Iowa\nIowa City\nCOPY\nNovember 9, 1959\nDr. Marshall McLuhan\nUnderstanding Media Project\n96 St. Joseph St.\nToronto 5, Ontario\nCanada\nDear Marshalls\nX wrote you not long ago that X had written to Arthur Foshay concerning\nthe objectives which you had indicated he might supply and to find out\nabout his availability for help on this project. X was quite encouraged\nby his reply, the major sections of which were as follows: 11X see no\ndifficulty in principle (my underlining) in turning some of McLuhan*s\nassertions into a testable hypothesis. For exaisple, one of his inter¬\nesting ideas is that little children begin to play with language at a\npoint early in life when they are saturated with the language. His\nnotion is that after an early age (perhaps during the third year) the\nfurther language learning of children amounts to a kind of elaboration\nof the kind of basic structure that they already know, and the evidence\nthat this has taken place is to be found in their tendency to play with\nlanguage or to respond playfully to the play of others - that is, to\npuns, to nonsense, rhyme, reversals, and the like. What X meant to\nconvey to Marshall was that this kind of thing can be verified through\nsystematic observation, and that such observation would tend to fill\nout the idea with reality. The same sort of thing is true of a number\nof his ideas. So such for the first quotation.\nX do not recall having said that X was willing to provide a list of\nobjectives, but 1 may very well have said that I would be glad to ait\nwith him long enough to try to develop a list of objectives out of the\nmany ideas he has. X tried to explain to him what the term \"objective\"\nmeans to me (i.e., the meaning of the educational expression \"behavioral\nobjective\"). X think Marshall assumed we all speak the same language\nand that you would know what X meant when he said X could provide a list\nof objectives. Let me emphasize: X think that a list of behavioral\nobjectives can be derived rather directly from the ideas that McLuhan\nhas, but X could not sit here and do it."
}