{
  "id": "d29-26",
  "text": "Or. Marshall McLuhan\nNovember 9, 1959\nPage 2\nI share some of your unease about the outcome of project, and your\nconviction that we really must work this one through. I have never been\nin contact before with a man of such explosive brilliance. I find it\ninviting to consider the possibility of playing Huxley to his Darwin.\nWith respect to some organisational approach, I think I would suggest\nthat first X can spend 6 to 8 days in conference and in the writing of\nresults of conferences during the balance of this year, and I might spend\nsome time next summer or early fall on this matter. X don't know what\nkind of an arrangement should be made of this point - X suggest that you\nand Skomia and the other involved consider this on some sort of perdiem\nbasis and arrive at a suggested amount of money that you think is\nappropriate for this kind of consultation, given the total budget of the\nproject, the time that there is [work it through, and the need for other\nsupplementary help.\nI must return to the matter of \"testable objectives\" and speculate a\nlittle more about these, in order to deal with your question about the\nemployment of a research man. While I have not talked about these\nmatters with Mr. McLuhan, the following possibilities occur to me:\n1. (with respect to \"the media is the message\"). A child's report\nof a dramatised bit of acting experienced through television will differ\nin form, content, and ordering, from his report of an experience with\nthe same dramatic event reported in print.\n2. A child's tendency to \"act out\" his learning will differ according\nto whether the stimulus material is presented by television (or sound\nfilm) or print.\n3. A child's conception of the else, texture, tri-dimensionality\nof objects will differ as between a flat picture, a television image, a\nmotion picture image, the real object, a line drawing of the object,\nand so on.\nA. The child's tendency to use certain aspects of language will\nvary according to the medium on which an experience is presented.\n5. Children will learn more within a subject matter area when it\nis presented epochically (with little or no attention paid to the\nsequential nature of the content) on television than when they are pre¬\nsented the sane content serially(in which case one's understanding of\nthe lesson depends upon one's memory and understanding of the last).\nDoes that sort of thing illustrate what you have in mind! It represents\nthe sort of stuff that comas into my mind as McLuhan fires off his\nrockets around me.\""
}