{
  "id": "d29-27",
  "text": "Dr. Marshall McLuhan\nNovember 9, 1959\nPage 3\n1 would hope that arrangements could be made, budgetwise and In other\nways, to take advantage of Wells* willingness to participate in the\nproject. As I have indicated before, I can think of no one, Marshall,\nwho would be more likely to help you pull the project off.\nI wondered about one thing in his letter, lie seemed to be under the\nimpression that the project was still to be concerned with testing some\nof your basic hypotheses about media differences rather than with testing\nthe effects of a course, Understanding Media, on 11th grade youngsters.\nIt seems to me that these are two different projects. Did you talk to\nhim about the second?\nI think it would be more practical to stick with this second at this time\nbut, et the same time, come back to the first in a later stage of the\nresearch though 1 may be far off base with this opinion. I find his\nsuggestions for research in this area very interesting. This is the\napproach which Jean Piaget used so successfully in research on the con*\nstructIon of reality and the growth of logical thinking In children.\nI believe that Dick Evans' suggestions on the syllabus and the trial pro*\ngram are very good. A pre-test of one program with 11th grade youngsters\nwould almost certainly elicit some new ideas and would probably make\nclear some faulty assumptions about what is or is not reasonable to except\nfrom such a group, this might not be a bad next step. What do you think?\nIn fact, one might even do this pre-test in two steps. First, with some\n11th grade youngsters in a Toronto classroom, not worrying about the\nproblems of putting the course on tape but simply to feel about for an\noptimum level and approach for these youngsters. The next step then\nwould be an actual trial run with one lesson on video tape, which you\ncould do in Houston and then observe as some 11th grade youngsters view\nand use it.\nIt was good seeing you in Detroit, Marshall. Sorry that we were not able\nto get a few of the committee members together for e discussion of the\nsyllabus. However, 1 assume that you have heard or will hear from each"
}