{
  "id": "d29-73",
  "text": "Media Study Project,\n96 St. Joseph St.,\nToronto 5, Ont.,\nOctober 15th, 1959.\nDr. Harry J. Skornia,\n14 Gregory Hall,\nUrbana, Ill.,\nU.S.A.\nDear Harry:\nJust had a note from Sam Becker who was reassured about\nthe project by the enthusiasm of Wells Foshay whom he met in\nWashington last week. He says that the more we can use\nPoshay on a consulting basis the better. I shall be seeing\nPoshay more than once between the dates of October 20th-24th,\nand shall tell him of the limited consultant funds in my\nbudget. I have no doubt that he would work his head off for\nfree on this particular project, since its scope includes his\n-own basic interests in research into the learning process.\nHe is a man who is capable of real intellectual excitement\nand dedication, and I think he realizes that we are playing\nhere with something very big indeed. I may have mentioned\nhis phrase: ”lt is the only new thing in education in our\ntime1'.\nYou mentioned in our session with Walter Stone some\nmonths ago that the NAEB might be counted on for some consult¬\nant funds for this project. I am not one to press such\nmatters at all so I shall say nothing to Poshay about any\navailable funds over and above the $1,000 in the budget.\nPerhaps I should ask him, however, what is his own opinion\nabout the urgency of more extensive consulting. The fact\nthat New York is so much handier than Houston or Iowa City\nis a factor, but only one factor in such decisions.\nPorsdale has been extremely helpful and will continue to\nbe so. Perhaps it would be possible to award a bit of con¬\nsulting money to him, as well, later on. You are a better\njudge than I about the relevance of any further meetings such\nas we had in Chicago. I would prefer, myself, to make\npersonal visits with the members of the committee.\nYou asked about Art Knowles* $2,000. He has accepted the\njob with the University. I meet with him tomorrow morning,\nOctober 16th, over at the University. In order to secure a\nsizeable portion of his time and effort it may prove helpful\nto push up his payment somewhat, but I shall report on that\na little later.\ncontinued"
}