{
  "id": "d29-74",
  "text": "-2-\nAs regards time for the project, I do not think that\nthere is any doubt that a second year is strongly indicated,\nbut I am going to proceed on the assumption during the next\nweeks that we are working on a one-year basis.\nYesterday I lunched with Gene Hallman who is Program\nDirector of both Radio and T.V. for the C.B.C., and discovered\nthat he has a considerable degree of understanding of this\nproject and a whole-hearted feeling about its urgency with\nregard to the schools and public alike. He said he would\ndiscuss the possibilities of a practical involvement of the\nC.B.C. in the project with Rainsberry and Attridge.\nIt was Rainsberry and Attridge (both Ph.D*s. in English, and\ncontemporary poetry at that) who were from the first keen\nabout getting into the project, but who encountered budget\nsnags right off. Hallman is in a much better position to\nmake official C.B.C. commitments.\nAppropo^ of my secretary, there is the fact of the Canadian\nexchange which slices off automatically from any U.S.\npayments received here. So a renegotiation budget should take\nthat factor into consideration and a slightly augmented salary\nwould be extremely welcome to her. Moreover, I think she is\ngoing to earn it in the difficult days that lie ahead.\nThe airlines here tell me that with respect to an air\ncredit card the natural and easy way is for the NAEB to apply\nfor one for me through any American airline. You may have\nfound there are some disadvantages in the use of a credit\ncard, but if not and if it*s convenient to procure me one it\nwould seem to be an obvious way to simplify the bookkeeping\nproblem of travel expenses as well as making for considerable\nconvenience on my part.\nThe rental of office equipment up until now is this way:\ntypewriter just under $20 per month; tapes and transcribing\nequipment $20 per month; phone $10 per month (including\ninter-com); furniture (desk, chair, filing cabinet, etc.)\n$30 for first three months, then $20 for subsequent months.\nI plan to be at the Detroit convention throughout.\nWould it be a good time to meet the Research Committee again?\nAm enclosing a copy of a typical kind of letter that passes\nbetween me and Wells Foshay. Looking forward to seeing you\nat the convention. I do not plan to fly back to Toronto, but\nwould urge you to stay with us Friday night and not to hurry\noff Saturday if you can possibly manage to relax and chat a\nbit more. Also I want you to get acquainted with Corinne and\nthe family. It would probably be possible to have some valuable\nconferences with other C.B.C. types at our home.\nc\n* V' ‘\nAs ever."
}