{
  "id": "d29-76",
  "text": "-2~\nfarther improvement become a substitute for the country.\nOver and over again a medium of communication will begin\nas a link between two areas gradually substituting itself as\na rival reality making the previous two areas irrelevant.\nThe newspaper is an obvious case. But the vacuum tube which\nbegan as radio and reversed itself into visual form, upon\ndevelopment, finds many parallels in our world. Even the\never-aceelerating ease of travel tends toward a kind of stasis\nso that if one can proceed to Tokyo or Moscow or Paris in\nthree or four hours the experience of travel is eliminated,\nand the purposes of travel are completely transformed.\nThis principle seems to me to apply to all electronic\nmedia as compared to the experience of reading and writing:\nMuch have I travelled in the realms of gold and mam’ goodly\nStates and Kingdoms seen\". The relatively slow pace of\nreading not only created its own assumptions and attitudes\ntoward learning, but all these must now be translated via\nthe new media into totally new objectives for education\nand social order. One thing that I frequently ask myself\nis whether the irreducible component in education is articu¬\nlation and verbalisation. Since most experience is non¬\nverbal is it inevitable that men should move toward the\nverbalisation of these non-verbal aspects? Does not the\nFrench cuisine differ from ours precisely in having been long\nsubjected to subtle verbalization. And a friend in New York\nwho is an eminent wine expert insists that in testing wines\namong a group of people verbal agreement about the precise\nnuance of taste is not only possible, but indispensable to\nthe recognition and enjoyment of the specific qualities\nand tactful dimensions of any wine.\nRecently the electronic engineers have come up with the\nmeans of providing, by electric means alone, the specific\nflavours of food, drink and natural odours of all kinds.\nThis I have not sampled. \\\nThe matter of the role of verbalisation in the training\nand perception of judgment would seem to be a key concern in\nthis media project of ours. So I ask whether the power\not verbalizing and discriminating the qualities of media\nexperience r.is an obtainable object of the experiment in the\nclassroom., Behavioral change resulting from new awareness\nof the nature and conditions of media experience could scarcely\nfollow any one pattern. Is not then verbalization both a\npossible goal and a necessary control in the whole effort?\nI do not have in mind a verbal package to be delivered to the\nstudent. The last thing I want is for them to learn any\nformulas that would become a substitute for direct observation.\nIn order to avoid that trap I hope to be able to set the\nsyllabus in the interrogative mood.\ncontinued"
}