{
  "id": "d29-78",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nOctober 13, 1959\n14 GREGORY HALL\nURBANA, ILLINOIS\nDr. Harry J. Skornia\nNAEB\n14 Gregory Hall\nUrbana, Illinois\nT 1 * 195*\n* Ftt\nDear Harry:\nJust a brief note at this time. I saw Wells Foshay in Washington\nlast week but we did not have time to talk very much about the\nUnderstanding Media project. However, I have just written to him\nand asked for some of the objectives which Marshall says he can\nprovide. It seems to me completely impossible to tell whether a\nweek or two is a long enough period in which to get results which\nwill hold up until we have a pretty good idea of what these objectives\nare --that is to say, until we know what kinds of behavior changes\nMarshall will be trying to make in the students.\nI wonder too about this sudden new idea to try out the course on\nGeneral Electric executives. It seems obvious to me that one does\nnot teach in the same way to executives and to school children. The\npeople at the Department of Health, Education, and Welfare don't\ngive a damn about executives. This means that the children must be\nout primary interest at this time. If Marshall wants to piddle with\nexecutives, all right. But let's get the main show on the road first.\nIn other words, it is going to be hard enough for him to finish one\nsyllabus in the time alloted. If he tries to do two at once, or\ntries to make one which will do both jobs, I do not have much faith\nin what the result will be.\nIn addition to asking about objectives, I also took the liberty of\nasking Foshay how much time he would be willing to spend on this\nproject. I would say that he should be used as much as he is willing\nto be used. In regard to the time of committee members, this depends\nupon whether you accept the recommendation that a full time research\nperson be employed. If not, then you need a tremendous amount of\nconsulting time. If you do, it could be fairly minimal. Pretty much\nthe same sort of thing holds for the rest of the budget. It will\nmake a tremendous difference if we are talking about an experiment in"
}