{
  "id": "d29-80",
  "text": "DEPARTMENT OF\n2 1/ A M> HEALTH, EDUCATION, AND WELFARE\n>r\\^iAtU Acj<U*^F¥'c* of education\n■'jp^Tn'- -\nDr. Harry J. Skornia\nExecutive Director\nNational Association of\nEducational Broadcasters\n14 Gregory Hall\nUrbana, Illinois\nDear Harry:\nWASHINGTON 25, D. C.\nOctober 14, 1959\nRECEIVED\nnaeb headquarters\nOCT 1 8 1959\nAM P*\nfiMiijWi9ifiMi4iW\nl\nThank you for your letter of October 9 reviewing the progress\nmade to date on the McLuhan project. It does, indeed, sound as if you\nare well on the way.\nIn answer to your question regarding budget, I would be inclined\nto recommend that we keep the project going under the arrangements made\noriginally which call for negotiation in phases. However, I can give\nyou the best answer to the questions raised when I see full details on\nwhat is likely to be involved.\nWarren Seibert of Purdue has joined us as senior research coor¬\ndinator and is doing a very fine job. When you are ready to get down\nto specific cases, I will refer the matter to Warren so that you can\ndeal directly with him whenever the time comes. This transfer of\nresponsibility means nothing other than that I am trying to redelegate\nas much responsibility as possible in order to be free to carry forward\nmore general activities. So don't hesitate to call or write Warren at\nany time. If, however, there should ever be any problem or question\nwhich refers back to our original agreements and about which he may be\nconcerned for one reason or another, please call me direct.\nA number of things have been coming our way recently with regard\nto TV developments in the field which require more immediate knowledge\nand expert judgment than we have available. Therefore, if I may, I\nshall be calling you or coming to see you about some of these things in\nthe near future.\nGenerally speaking, we are very pleased with the way things are\ngoing this Fall, and at this moment are generally optimistic about our\nfinancial situation.\nBest personal regards.\nSincerely yours,\nC. Walter Stone, Director\nEducational Media Branch"
}