{
  "id": "d29-85",
  "text": "NAEB\nNational Headquarters\n14 Gregory Hall\nUrbaaa, Illinois\nOctober 9$ 19$9\nDr* C* Walter Stone, Director\nEducational Media Brandi\nTJ* S. Office of Education\nDepartment of Health, Education and Welfare\nWashington 25, B. C.\nDear Walters\nAttached is a copy of sy letter of today to Marshall* This is the first I*ve\nbeen able to get back to his project*\nThe meeting went well* Somme, since turn of to people game up consultant\nifees to come, we (the USED) will hare to reimburse then in some my (outside\nthe contract money from BSOE). Travel only will be charged to to contract*\nCounting their usual rates, m had at least #1,500 worth of exultation\ntalent provided by the HiEB. AH were in attendance except Harwood and Kmasta.\nGrateful for Dick Evans* He got the project nailed down better than anyone*\nIf I may quote from Becker*s letter to m (since I had to leave early the\nlast afternoon)?\n*»I was extremely pleased with the outcome of to meeting* Frankly, I was not\noverly optimistic when I started for to meeting bat I believe that it proved\nto be quite fruitful* Hot a great deal more was accomplished after you left*\nIt was agreed that Marshall would develop a fairly complete aid specific\nsyllabus of to course and have it circulated to us ty OciobeFIStfi. ¥his\nwould also include a statement of to goals of to course which might provide\nideas for to development of new kinds of instruments for measuring tone\noutcomes* The next step, to development of a design, must wait upon our perusal\nof this material because to design cannot be developed without knowing to\nbehavioral goals of to course - aid m could not get Marshall pinned down much\non this point Thursday. Once we get to syllabus, to following Jobs must be\ndone i outline of to experimental design including tie samples to be used;\nto kinds of instruments to be utilised for to collection of data; a descrip¬\ntion of to sort of treatment to control groups get In order to counterbalance\nany Hawthorn© effbet; a careful development of bud^t, etc*"
}