{
  "id": "d29-86",
  "text": "Dr. C. Walter Stone, Page 2, October 9, 19$9\nMTte one major Idea to cos© out of the afternoon cession was a decision to put\ntbs major part of the course on videotape. This would provide much greater\ncontrol. The plan is to htm US 30~m±nate videotape lessons, each of which is to\nbe followed by 20 minutes or so of discussion and otter experiences in each\nclassroom. (This means about 3 class meetings per week for a semester.)”\n(HOTE to Walter* see later quote in ay letter. I hope this can be held down\nto less.)\nIt appears from all the item that we are getting closer to knowing the step-\nby-step approach} syllabus materials are being developed for review by the\nCommittee} and by December 1 (ite deadline I gave item) wo hope to have a\nrevised (higher) budget to submit, together with adequate explanatory sup¬\nporting material, sables of procedures, etc.\nI thought I should broach this to you. Do we submit tte completed plan and\nrevised budget for re-ragotiation of tte whole, for enlarged continuing funds,\nor on a whole new basis? Dick Evans, who has offered Houston*a studios and\nvideotape at cost, estimates that tte whole thing Is likely to run to some\n$100,000 before it*s through (figuring a two-year period). I*d hope wo can\nkeep on some sort of continuation basis — since otherwise it could rim to\nstill more, and be slowed down greatly.\nOn testing, too, we*re going to be in pretty fair shape. Quoting from Marshall's\nletter to me, regarding a meeting he had just had with Arthur ^©lls Foshay ((with\nLouis Forsdaie present part of tte tiasj and Tom Bledsoe (Council for Basie Edu¬\ncation) whom you may know, also present fear a white))*\n*1 explained tte proposal of Sam Bee ter*® committee that I prepare a syllabus,\nat once, for experimental teaching in a variety of classes. (I asked at\nGeneral Electric Management Conte© whether they would conrent to tey out tte\nsyllabus among tteir executive training classes, and toy said it was entirely\nagreeable to them. This would mm having an adult grot# of august dimensions\nindeed.)\n\"Foshiy saw no difficulties in this pattern and said that te would be glad to\nprovide a list of objectives in tte course that would te feasible for testing,\nsine® te understands my approach on my terms and is willing to translate it\ninto tester terms. But te emphatically assured ms teat tore was no need to\nuse te© syllabus for any such period as a full semester in order to hare what\nte called K.0.K* (Knowledge of Results). He insisted that one or two weeks,\nat most, would give adequate K.O.R. te said it would mm te ©clung and testing\nsingle concepts of a mdium or of tte interaction of two or more madia."
}