{
  "id": "d29-93",
  "text": "a, octet** 9, is^9\nDr* C. Water Stone, Pa@e\n\"The one major Ida# to cm oat of to afternoon session wm # (teston to pot\nto major part of to course an videotape* This would provide much grater\ncontrol* The plan is to famm 16 30*tet*te videotape loeacma, each of which is to\nbe followed by 20 citato# or so -of other e&peri*no#s in each\nclassroom* (This sues* toot 3 class votings per wte for a meter* )a\n(BOR: to Walton see later qute in sy later* X hap# this can bs held dam\nto loss*)\nIt appears from all to tore tod re are getting closer to knowing to step*\nbystep approachj lyllabaB isterlals asm being developed for review by to\nCommittee! and by Itottto 1 (to deadline I gave ton) m hope to have a\nrevised (higher) budget to stfeit, together with adequate e^lsteory sup*\nporting material, samples of procodtams, etc*\nI thought I should broach this to you* Do re submit to coEgdted plan and\nrevised budget for renegotiation of to whole, for osOaraad contiiiulng fends,\nor on a tola new bate? Sick Evans, to has offered Houston*© studios and\nvideotape at cost, ©testes tot to whole thing 1* 21My to run to son*\n1100,000 be fox© it*a through (figuring a teoywar period}* ltd hope wo con\ntop on some sort of cmttoteon bate — since otorteo it could run to\nstill mm, to be slowed down greatly*\nOb testing, too, tofe going to be in pretty fair ship** suoting from Kartell*©\nlater to me, regarding a anting he had just had with Arthur walls fotoy ((with\nLote Foredate presold part of to ttef to Tom Btedeo© (Council for Bate Edt*~\ncation) whom you wy know, tec present far a whlte))t\n*X esplatmd to proposal of Sm Becfasr*a cototte© tot 1 prepare a syllabus,\nat once, for eatpertotel teaching in a variety of elasu*#. (I noted si\nGeneral Electric femagmst Cento whether toy would ewd to txy out to\nUylltos among telr training clams, to toy ted it was entirely\nagreeable to tom* Tliia would mm having «a adult group of august dimension©\nindeed*)\n«Fotey saw no difficulties in this pattern to ted tot he would be glad to\nprovide a list of objectives in to course tot would be feasible for testing,\nsince he understand© ny appeote on ay tera© to la willing to translate it\ninto tester terras* But he emphatically assured m tot tore was no need to\nuse to syllabus for say such period as a fell semester in order to hmm what\nhe called JUC*R* (towledgp of tosults). Be insisted tot one or two woelcs,\nat most, would give adequate K*G*R« ffe said it would raesa teaching to testing\nof a tolua or of to Interaction of two or mam media*\nsingle concepts"
}