{
  "id": "d29-97",
  "text": "STATE UNIVERSITY OF IOWA\nIOWA CITY\nTelevision Center\nSeptember 28, 1959\nDr. Harry Skomia\nExecutive Director\n14 Gregory Hell\nUrbane, Illinois\nDeer Kerry:\nEnclosed ere my expenses for the recent meeting of the NAEB research\ncommittee in Chicago.\nTransportation by plane (Receipt enclosed)\nHotel (Receipt enclosed)\nBus to and from airport\nCab for all of us back to hotel rfed. night\nTips for bellhops and checking\nFood\n$34.32\n10.00\n2.90\n2.50\n.75\nihll\n$64.04\n41\n1 was extremely pleased with the outcome of the meeting. Frankly,\nI was not overly optimistic when I started for the meeting but I believe\nthat it proved to be quite fruitful. Not a great deal more was accomplished\nafter you left. It was agreed that Marshall would develop a fairly com¬\nplete^ jund specific syllabus of the course and have it circulated to us\nby October 15th. This would also include a statement of the goals of the\ncourse which might provide ideas for the development of new kinds of instru¬\nments for measuring these outcomes. The next step, the development of a\ndesign, must wait upon our perusal of this material because the design\ncannot be developed without knowing the behavioral goals of the course -\nand we could not get Marshall pinned down much on this point Thursday.\nOnce we get the syllabus, the following jobs must be donej outline of the\nexperimental design including the samples to be used? the kinds of instru¬\nments to be utilized for the collection of data* a description of the sort\nof treatment the control groups get in order to counterbalance any Hawthorne\neffect9, a careful development of budget, etc.\n^ The one major idea to come out of the afternoon session was a deci¬\nsion to put the major part of the course on video tape. This would pro¬\nvide such greater control. The plan is to have 45 30-minute video tape\nlessons, each of which is to be followed by 20 minutes or sojff discussion\nand other experiences in each classroom. (This\nings per weex for a semester.) s/\nmeans about Tclass meet-"
}