{
  "id": "d1174-3",
  "text": "-4-\nApr. 22 - Gold Mask Players; '’Poets All.”\nMay 6 - Gold Mask Players; ’’One Minute Past.”\nMay 20 - Gold Mask Players: ’’The Londonderry Air.\"\nJune 3 - Gold Mask Players; \"Spreading the News.”\nJune 24 - Gold Mask Players: \"Allison’s Lad.”\nJuly 8 - Gold Mask Players: \"A Marriage Has Been Arranged.”\n”I sincerely hope this is the information -which you requested in your letter of Sept.\n30.”\n(NOTE: We have written Mr, Duffey asking for complete details on the plays listed\nabove. The following questions have been asked and as soon as he gives us a reply\nwe will send the information in a bulletin to the members: 1. The amount of royalty,\nif any, charged on each of these plays. 2. In case no royalty was required how was\npermission secured from companies before plays were presented. We further asked for\ndetails so that other stations in the Association may use this list of materials pre¬\nsented by the Gold Mask Players.)\nFROM A. A. APPLEGATE, HEAD OF DEPARTMENT OF PRINTING AND RURAL JOURNALISM, SOUTH\nDAKOTA STATE COLLEGE OF AGRICULTURE AND MECHANIC ARTS, BROOKINGS: \"Although excerpts\nfrom a number of plays were given over station KFDY last year, only one complete play\n\"Suppressed Desires\" went out over the air. We found afterward we had to pay a royalty\nof $10 for the privilege of broadcasting the play.\n\"We have found it particularly difficult to find plays suitable for broadcasting, as\nnot very many voices can be distinguished by an audience and a long play does not go\nover well. From our standpoint broadcasting of plays is something of a fizzle.”\n(NOTE: We were quite interested in this communication in that the experience of Mr.\nApplegate has evidently led him to the conclusion that they will not attempt dramatic\nwork over their station in the future. We have in the past experienced the same feel¬\ning that Mr. Applegate portrays in his communication. However, I feel that by cooper¬\native work in the Association, we can establish an ideal situation, select and present\nmaterials designed particularly for radio use which will prove quite satisfactory.)\nAnother very interesting letter has been received since the release of the last bul¬\nletin from DEM JAMES T. ROOD, DIRECTOR OF KOB, NEW MEXICO COLLEGE OF AGRICULTURE\nAND MECHANIC ARTS, STATE COLLEGE, NEW MEXICO: \"The ideas and suggestions contained\nin your letter appeal to me very much and I should like to see them carried out, if\npossible.\n\"The collection you mentioned as having been made by Miss Miriam Dearth should be\nwell worth using by other association stations if you are in a position to send them\non tour when you have used them. They should be of great interest to cultured list¬\neners, especially when broadcast from different stations of the association. Personal¬\nly, I find that educated people in every part of the country are interested in the\nhistory, the sagas, the folk stories and songs of all other parts of the country,\nexpecially, as you say, where they are ’human interest stories.’ So I sincerely trust\nyou may be able to work out this most attractive experiment.\n\"Unfortunately for us, our funds have not as yet permitted us to work out any parallel\nset for this section that we could offer you or others in return for the use of such\nrecords or continuities from other association stations. Yet this region offers a.\ntremendous store of stories that could be worked up. That of Billy the Kid, Geronimo,\nthe Spanish Conquistadores, the Santa Fe Trail, the finding of pottery revealing the\npresence here of artistic tribes five thousand years or more ago.\n\"Surely there is a wealth of human interest stories that could be written for this part\nof the Great Southwest. And I know that other sections have equally interesting\nstories to tell*"
}