{
  "id": "d1174-7",
  "text": "study that will prove as valuable to our Association as a study of this type. All\nmembers can indeed assist in this matter and supply the Bureau of Educational Research\nof Ohio State with valuable information. Please note also the fomment by Mr. Higgy\nrelative to their radio play tournament held last spring over VffiAO. This is indeed\nan excellent suggestion for consideration on the part of the members. Mr. Higgy also\nstates that those stations interested in a radio play tournament may be interested in\na release sent out by their station dated February 18, 1931. I am quoting this release\nin full, as it contains some very valuable information that should be before program\ndirectors throughout the entire country.)\nThe letter is as follows:\n\"The interest arroused has necessitated a limitation of entries, since we are allowed\njust so much time on the air. This means that the first eight schools sending in\nregistration blanks will be given the right to enter the tournament. And now that we\nare planning a definite allotment of time, a receipt of your entry is a guarantee of\nyour being here at the scheduled time,\nnVe will expect each group to be made up of students regularly enrolled in the school\nwhich they are representing; for this is distinctly a college project, fostered by\nOhio State University in an attempt to extend to other Ohio schools an opportunity to\ninvestigate this new field of dramatic endeavor,\n''Publicity will be given the tournament and we will expect pictures and ’copy' as soon\nas possible after notification of registration acceptance is given.\n\"The play will be judged on selection of material, presentation, and the effectiveness\nof the broadcast. Professor Herman A, Miller, director of dramatics at Ohio State\nUniversity, is chairman of the judging committee, and he will announce the winning\nplay on May 1, at the regular YffiAO Players’ hour, 8:30 P. M. A suitably inscribed\ntrophy will then be sent the prize group.\n\"The following suggestions are sent you in the hope that they will simplify problems\n•onfronting you as you make your decision regarding entering the tournament:\nA. Selection of play,\n1. The play should have a limited cast, which is carefully\ndifferentiated as to characterizations, and contrasting\nas to voice requirements.\n2. The plot should be simple. Avoid complications which are\ndifficult to follow.\n3. The dialogue is nil important, end should have. lines that\nare meant to be spoken. Clear and definite exposition is\nessential.\n4. Action must be such as can be translated into words,\n5. The fewer the scones, the easier to follow. The use of\ntoo many scones gives an episodic touch to the broadcast\nthat is undesirable,\n6. A play with a ’sound’ basis permits the introduction of\nsubstitutes for lighting and staging. Music may also be\nused to suggest the emotional tone or background,\n7. There is a definite time limit of thirty minutes, in which\nto present the play,\n8. The play may be a one act play, a cutting of a longer play,\nan adaptation of a story, an original continuity, or a\ndramatization. Note that such group must assume the respon¬\nsibility of securing broadcasting rights, and meeting any\nroyalty requirements."
}