{
  "id": "d1013-0",
  "text": "Reed Harris president\nU BL_I CATION SERVICES INC.\nDupont Circle Building\nWashington 6, D. C.\nDupont 7-3466\nAugust 25, 1953\nMr. Graydon Ausinus\nNational Association of Educational Broadcasters\nWUOA, University of Alabama\nUniversity, Alabama\nDear Mr. Ausmus:\nYou and your organization, interested in foreign affairs, may -wish to know that some of\nthe ablest writers in the foreign affairs field are available through us to work on your\npublications, reports, speeches, and other papers.\nMiss Helen P. Kirkpatrick, Dr. William C. Johnstone, Jr., Thomas W. Wilson, Jr., Howard\nD. Wheeler, Wolf von Eckardt, Ann Hartwell Johnstone and a host of others are among the\ncapable writers on foreign affairs who work with Publication Services Inc.\nIran or Indonesia, France or Argentina — we have at least one knowledgeable person who\nknows the country intimately. Whether your interest is in the business implications of\nforeign affairs, the advancement of cultural development overseas, aid to starving\npopulations, or the study of foreign governmental mechanisms, there are people on our\nlist who know the subject.\nSuperior design, editing and writing service is available from us in any field, whether\nit’s writing sparkling copy with a New Yorker touch, persuasive arguments to be presented\nto a committee of Congress, or solid scientific prose to meet scholarly needs.\nYou perhaps have your own editorial staff, but even so there must be times when peak\nloads make you call for outside help. Now and then you may also want something with a\nslightly new and different approach or appearance from anything done in the past. We\ncan meet your needs, effectively and promptly.\nWhen you call us in, your project will have the attention of one expert or a team, de¬\npending upon the need, and each assignment will have the careful supervision of this\noffice.\nPlease call or write us the next time you need writing, editing, research, design or\nproduction of papers or publications. We’ll be delighted to work with you and we’ll\ntry to make you very glad you called us in.\nSincerely yours.\nPresident\nRHst"
}