{
  "id": "d1013-23",
  "text": "Keynote Address Given by Arthur S. Flemming, President,\nUniversity of Oregon and Former Secretary, Health,\nEducation, and Welfare to Western Conference\non Radio and TV, February 17, 1965\nAll of us, I am sure, have been shocked in recent months by a book entitled \"Thirty-eight\nWitnesses\". It isn't fiction. It is an accurate account of a recent event. A human being is\nbeing murdered. Thirty-eight other human beings stan<J on the sidelines as spectators.\nThey refuse to become involved. Yes, we are shocked, but what would we have done? What\ndo we do when the human spirit is trampled under foot; to take just one example, by anti¬\nsemitism?\nJust as we have been shocked by \"Thirty-eight Witnesses\" we have been thrilled by the bring¬\ning into being and the rapid growth and development of the Peace Corps. We have been\nthrilled that young men and women, older men and women have been willing to volunteer their\nservices in order to become involved in the problems of their fellow human beings in all parts\nof the world. We have noted the satisfaction which they have experienced just as all who are\nwilling to become involved in service to others experience satisfaction.\nThe issue which confronts our day it seems to me is clear. Will the day in which we live\nbecome known as the day of the Thirty-eight Witnesses? Or will it become known as the day\nof the Peace Corps? To become involved or not to become involved - that is the question.\nIt's a question which confronts me as I go about my everyday activity. It's a question which\nconfronts you as you participate in the everyday activities of the great communication pro¬\ncess of our nation. For a few moments this evening I would like to face this issue with you\n- the issue of involvement or non-involvement in certain areas of life.\nTake the field of welfare. At the beginning of the 1960s writer after writer and speaker\nafter speaker were vieing with one another in denouncing our public assistance program.\nThey were presenting to us what they thought of and described as a chamber of horrors.\nA city manager in Newberg in New York had the national spotlight thrown on him when he\ndecided to be tough in his dealings with people on public assistance rolls. The State of\nLouisiana ruled that if an illegitimate child had been born in a family on public assistance\nrolls, the family should no longer receive help. As a result 23, 000 children in needy\nfamilies were overnight deprived of funds for food, clothing and shelter. Comparable action\nwas taken in other states. Citizen after citizen stood on the sidelines shaking his head, but\ndoing nothing.\nFortunately, our elepted representatives in Congress responded to the leadership of the\nlate President Kennedy and decided that the Federal Government should become involved,\nnot in a destructive, but in a constructive manner. As a result the Public Welfare Amend¬\nments of 1962 became the law of the land - amendments which authorized the use of federal\nfunds for programs tta. t if implemented will rehabilitate many of those who are now on\npublic assistance rolls and transfer them from the public assistance rolls to the income tax\nrolls. These programs will in many instances prevent dependency in community after com¬\nmunity. Fortunately, many states (I am glad that Oregon is one pf them) responded affirma¬\ntively to this opportunity to move in. Instead of getting tough they recognized that the conditions\nthat existed were related to causes about which something could be done if society was willing\nto become involved and work on the elimination of those causes."
}