{
  "id": "d1013-31",
  "text": "Laurent\n2\nI guess everybody knows the most archaic joke in Washington springs from the translation of the\nwords that are chiseled on the side of the National Archives building. The words are: \"The\npast is prologue.\" And just about any one of Washington's 11, 000 cab drivers can tell you that\ntranslates into a bureaucrat's phrase for \"Brother., you ain't seen nothing yet. \"\nWell from the publications by the National Aeronautics and Space Administration comes this\nnote: 90% of all the scientists who ever lived are alive today. Or a few thoughts from\nDr. Jerrold R, Zacharias of the Massachusetts Institute of Technology: \"More new knowledge\nhas been developed in physics in the last twenty years than in the preceding two thousand years, u\nand adds Dr. Zacharias, \"the need for technological manpower alone, scientists and engineers,\nwill more than double by 1980, will more than triple by the year 2000.\"\nOr look to one of the convictions of the Educational Media Council that, of the children now\nin grades 1 through 6, 50% will work in occupations that do not now exist.\nA changing society? Brother, you ain't seen nothing yetS\nSome of those physicists who are working with the wonders of the Laser beam and major ampli¬\nfication could profoundly change the very nature of the regulation in broadcasting because it\nwill lift it into an area of plenty in the spectrum, into an area where there is no shortage of\nfrequencies; and the whole philosophy of regulation to allocate a scarce commodity will have\nto be changed.\nNow certainly the engineers will continue to decrease the size of broadcasting equipment. We\nhave seen some of that here right next door. The tools of the electronic journalist, for example,\nwill become more portable and less intrusive at public events. And as they shrink in size and\nbecome less obtrusive our friends in the American Bar Association will lose the final and last\nreason for not allowing the electronic journalist full access to the courtroom.\nIf we were concerned tonight with only the technical achievements in recent years, I think we\nmight find a new respect for some words uttered by Mr. William Faulkner: \"What’s wrong\nwith this world? It is not finished yet. It's not completed to the point where man can put his\nfinal signature to the job and say 'It is finished, we made it and it works.'\" Well, our\nchanging society is no where near finished but it is working rather well.\nAll right then what about the part of the theme of this conference that is concerned with some¬\nthing called responsibility? Well let me look backward to 1941 for a moment and to a speech\nmade by a wild-eyed old radical called John D. Rockfeller, Jr. \"I believe, \" he said \"that\nevery right implies a responsibility, every opportunity an obligation, every possession a\nduty.\" Which leads me to the fact that broadcasters are in a peculiar business. It's the\nonly business in this land that begins with an open declaration that you will do good for a\ncommunity, a town or a city.\nAnd all that the Communications Act of 1934 really means when all of its 146 pages are digested\nis one simple declaration by a broadcasting applicant: \"Give me the license and I will make my\ncommunity a better place.\" And then to a degree unknown in broadcasting anywhere else in\nthis world, you are left free to exercise your good judgment and to carry out that responsibility.\nBecause this word responsibility really means one thing, and right out of the dictionary, \"the\nability to meet obligations or to act without superior authority or guidance.\" Responsibility\nin broadcasting means also the ability to seek and discern the community's goals, its hopes."
}