{
  "id": "d1013-34",
  "text": "Laurent\n5\ncontinues to grow at a great rate and there's a funny kind of polarization in that growth. Al¬\nmost half the population is under the age of 25 and the group past 60 gets larger and larger.\nNow to broadcasters this seems to mean that there's lots of business over here for the\nBeatles and there's lots of business over here for Lawrence Welk. Coupled with this is\nautomation which forces industry to give greater leisure time to production workers. In\nshort more people with more time to look at television, more time to listen to the radio,\nand if providence is kind, to read newspapers and books.\nThere are strong signs that there will al$o be rpore money. I have to apologize because almost\nany economic forecast stirs up a certain amount of disagreement, but the one that has drawn\nthe greatest acceptability was published last spring by the Twentieth Century Fund called\n\"U.S.A. AND ITS ECONOMIC FUTURE.\" It caused a highly conservative publication such\nas Business Week to devote three pages to summarizing this forecast and nearly all the\ncomment in that publication was favorable. What was forecast here was an increased rate\nof growth and our reaching a gross national product of about one trillion dollars in 1975.\nThey interpret this growth to mean an increase in consumer spending, an increase in\nproductivity and a reduction in the work week.\nFrom all indications we also seem bound to continue our trend toward replacing rather than\nrepairing. Something close perhaps to Aldous Huxley’s terrible slogan of BRAVE NEW WORLD\n\"spending beats mending.\" At least so far we haven't had to go t hrough the shock that was put\nupon a pair of visiting British dignitaries. It seems that in New York City--there was a very\nattractive young lady who was taking a shower; the room got sort of hot, she decided she would\nopen a window, one of these things that push out. And it was stuck. She pushed; it didn't work.\nSo she backed off and ran at it. It flew open, she fell out the window; a short distance, but\nupside down in a garbage can. Just about this time our British visitors turned the corner and\nwalked past this curious sight. And one of them looked at the exposed portions of this lady\nand he said, \"now you see what I mean about wastein this country.\"\nMuch more seriously, I hope, is the continuing need for the forces of advertising in what is\nsometimes called the economics of discontent. Our economy depends in great part on the\nsale of low cost packaged goods and here for a long time production has gone much faster\nthan consumption. What that means to me is that our society will need even more mass\nmedia advertising, the kind that creates and sustains the need for more of these kinds of\ngoods.\nThe other part is that there is still a lot of use left in the United States' portion of the broad¬\ncasting spectrum and ahead is the continued specialization in the use of radio with stations\naiming at minority tastes of every kind and doing it in prosperity. With the rapid expansion\nof the number of television stations, specialization has already begun. There's a television\nstation WOOK in Washington that aims solely at the Negro market. There's a new television\nstation in Detroit that looks solely to the people who are interested in sports. All of this\nillustrates that this electronics revolution does move at the speed of light.\nThe question comes, are there some threats to our society in this revolution? And of course\nthere are, and we will have to prepare for them.\nWe have already speeded up communication and transportation to the point where the small\nunit of local government has declined in importance. Problems tend to be solved on a"
}