{
  "id": "d1013-35",
  "text": "Laurent\n6\nregional or national basis and we do have centralized big government and in the future it will\nbecome more centralized and will get even bigger. There is danger too in the role that mass\nmedia plays in what Professor Dallas Smythe called its role as the agenda setter for human\nproblems. He compares mass media, favorably I hope, to the House Rules Committee, and\nrefers to it as an ‘'agenda for our consideration.\"\nProfessor Smythe is so worried about the atom bomb he's now teaching up at Saskatchewan\nwhere he thinks he’ll be safe and this is reflected in his conclusions here. \"If the mass\nmedia perform these functions as the agenda setter for human problems, without marked\nand systematic bias society is well served; but if the mass media fails to discharge this\nfunction well by reason of socially disfunctional bias, then their own survival and society's\nsurvival is in jeopardy.\"\nAs an illustration and example let's look for a moment at the results of the new forces at\nwork as racial groups push for equality. S. I. Hiyakawa the semanticist out of San Francisco\nwrote for us at one point, \"television like radio*bypasses literacy and it makes its commercial\npromises without regard to race or color.\" And he concluded, \"in the television programs,\nAmericans learn to see themselves as people not willing to be pushed around and our Negro\nyoung people have learned that lesson and they will be pushed around no longer. The work\nthat television has done cannot be undone.\"\nGoing with this is a reverse side, a side that too many people seem not to know about. In\nmy native Southland there have been inexcusable treatments of free citizens who were black\nfor at least 100 years. And certainly there had been riots before. But the public's know¬\nledge of the inhumane treatment and the violence rested solely on words that appeared in\ncold type and in half-tone engravings. Two years ago in our summer of discontent, there\nwas something different about public reaction to riots in Birmingham, Oxford, Mississippi,\nNew Orleans or Little Rock. And I think that it was because our knowledge of these events\ncame daily into our homes, it came from pictures that moved, and with sound that screamed\nand there was in that phrase Mr. Morrow used in connection with the new mass media.\n\"There was in each of tte se reports a reality as fundamental as birth or life or death; there\nwas the reality of police dogs, fire hoses, the police night sticks, and the marching militia.\nAnd as a result public indignation and support among those far removed physically from\nthe scene took on a new intensity and we got our first civil rights bill that means anything\nsince the Civil War.\"\nAnd what I am trying to prove here, if indeed proof is needed, is that responsibility of a\nbroadcaster in a changing society is not going to diminish. Your responsibility grows\ngreater and your acceptance of responsible roles will very likely determine the route this\nsociety is going to take. Whether we will finally reach those still unspecified goals of the\nGreat Society or whether ve become one more western culture that had all the gifts for\ngreatness but couldn't stand responsibility.\nWell, I'll predict that we are going to make it and as Ralph Waldo Emerson!*; words written\nabout 100 years ago have more meaning for our time than for his own, the words were \"We\nthink our civilization is nearing its meridian but we are yet only at the cock crowing and the\nmorning star.\""
}