{
  "id": "d30-103",
  "text": "3\nmade by the Corporation for any one project or to any one station a like restric¬\ntion for fiscal 1969.\nWe understand that these amendments are technical in nature necessitated\nby the delay in the nominations of the directors of the Corporation and the\nconsequent delay in its organization.\nThe Commission therefore has no objection to enactment of H.R. 15986.\nSincerely yours,\nRosel H. Hyde, Chairman.\nMr. Macdonald. In his education message to the Congress dated\nFebruary 5,1968, President J ohnson stated:\nI am asking the Secretary of Health, Education, and Welfare, and the Secre¬\ntary of the Treasury, the Director of the Bureau of the Budget, all of whom\nhave been studying this problem since the law was enacted, to work with the\nBoard of Directors of the Corporation for Public Broadcasting and the ap¬\npropriate committees of the Congress to formulate a long-range financing plan\nthat will promote and protect this vital new force in American life.\nBecause of the importance of the long-range plan of financing, and\nthe Interstate and Foreign Commerce Committee’s involvement in\nthe Public Broadcasting Act of 1967, we would expect to receive as¬\nsurance, which I am sure we will get today, from the representatives of\nthe Departments of Health, Education, and Welfare, and the Treas¬\nury, and the Bureau of the Budget that the House Committee on In¬\nterstate and Foreign Commerce is an “appropriate committee of the\nCongress” within the meaning of the President’s message.\nWe would also like some indication from those representatives on\nhow they intend to work with this committee in formulating a long-\nrange financing plan for the corporation.\nUnfortunately, the Chairman of the Board of Directors of the Cor¬\nporation, the Honorable Frank Pace, Jr., is hospitalized and cannot\nappear before the subcommittee today. However, the subcommittee is\nfortunate in having in his place the Honorable Joseph D. Hughes,\nof Pittsburgh, Pa., who is a member of the Board of Directors. He is\na governor and vice president of T. Mellon & Sons, and is also co-\nchairman of the Pennsylvania Committee for Public TV.\nIf Mr. Hughes will come forward, I understand he is accompanied\nby a gentleman who is well known to us, and who is a great friend of\nour very distinguished chairman of the full committee.\nWe welcome you both. I am sure Chairman Staggers would like to\nsay a few* words in welcoming you both.\nMr. Staggers. Thank you very kindly, Mr. Macdonald.\nI would like to welcome Mr. Hughes and Mr. Stephen Ailes to the\ncommittee. As Chairman Macdonald has said, Mr. Hughes is a re¬\nnowned banker from Pittsburgh, with a name we have known for many\nyears to be associated with money, the Mellon interests.\nI would like to welcome Stephen Ailes, who is one of our distin¬\nguished West Virginians. He is the grandson of one of the great and\ndistinguished Governors of our State. He is also former Secretary\nof the Army of the United States.\nWe are happy to have both of you. We are especially happy to wel¬\ncome Mr. Ailes because I have known him, his family, and all of his\nrelatives, who live in my district, close by my hometown at Iveyser.\nThey live in Romney. Steve now is a member of the law firm of Step-\ntoe & Johnson.\nWe do welcome both of you to be witnesses on what I consider to\nbe an important subiect that affects all America.\nThank you, Mr. Chairman."
}