{
  "id": "d30-106",
  "text": "6\nment that the corporate charter was issued today? How has your\norganization gotten along and what do you plan for the next year?\nMr. Hughes. Mr. Kornegay, of course, most of that time was taken\nup in the selection and nomination of the one lady and 14 men who\nconstitute the Board of Directors-designate of the Corporation, and\nalso in the naming of the Chairman who, under the bill, is to be\nnamed by the President for the first year. The President nominated\nMr. Pace for this. He assumed that role. He immediately began a\nseries of consultations with other people actively engaged not only\nin public television, but commercial television, meeting with them, and\ndiscussing his concept of the future of this Corporation, how it should\nbe activated, possible staffing, possible location, building availability,\nand those things which normally enter into the formation of a business\nenterprise. Public television is business, albeit a modest one compared\nto commercial television.\nI think at the present time, Mr. Kornegay, we have 149 educational\nstations in the country. As of last week, that number was 147. Two\nstations came onstream in Vermont. As I recall the figures, their operat¬\ning budgets approximate $70 million each year.\nI can speak with greater familiarity with our own station in Pitts¬\nburgh, Station WQED, which was the first community educational\nstation formed in the country. The first station came on the air at\nHouston. WQED in Pittsburgh was the first community station.\nWe operate under a budget of approximately $1.5 million per year.\nWe have broad-based public support, a house-to-house canvass which\nyields almost $400,000 on a yearly basis for the budget of this station.\nIt is one of the best supported public enterprises we have in western\nPennsylvania.\nLike all stations, although it is considered one of the big 8, WQED\nneeds to expand its programing activities. It does have color com¬\npatibility, which not all stations do. It is in the process of erecting a\nnew building headquarters with large studies at a cost of $2 million,\nwhich has been provided from the private sector, and it is moving.\nIn Pennsylvania, we have nine stations, seven operating channels\nwith nine channels, Pittsburgh and Philadelphia having two channels\neach. We badly needed interconnection in Pennsylvania. It is the\nEastern blackout. We cannot today interconnect the nine stations in\nthe Commonwealth of Pennsylvania for a single live broadcast with¬\nout special arrangements. It costs $14,000 a month to bring one 2-hour\nprogram into Pittsburgh each Sunday evening.\nI am glad to say that the Governor of the Commonwealth has recom¬\nmended to the general assembly in his current budget that $1,300,000\nbe appropriated for this purpose, of which $1 million will be an annual\ncharge on a leasing basis for the facilities, and $300,000 for the opera¬\ntion of the switching circuit.\nMr. Kornegay. You are talking about Pennsylvania?\nMr. Hughes. Pennsylvania; just the nine stations.\nMr. Kornegay. Let’s move from there into the national scene under\nthe Public Broadcasting Act of 1967. How much money has been appro¬\npriated by the Appropriations Committee for the fiscal year 1968 ?\nMr. Hughes. None, Mr. Kornegay.\nMr. Kornegay. You expect, then, to get no money from the Federal\nGovernment in 1968 ?"
}