{
  "id": "d30-107",
  "text": "7\nMr. Hughes. That is correct.\nMr. Kornegay. The purpose of this bill, H.E. 15986, is to authorize\n$9 million, exactly the same figure that was actually authorized in the\noriginal bill for 1968 ?\nMr. Hughes. That is correct.\nMr. Kornegay. But for w^hich no money was actually appropriated.\nMr. Hughes. That is correct. It moves the authorization from fiscal\n1968 to fiscal 1969.\nMr. Kornegay. I know you probably haven’t gotten far enough m\nyour corporate organization and in your planning to determine ap¬\nproximately how much you are going to need. Of course, that is cer¬\ntainly more properly a question for the Appropriations Committee\nthan for this committee.\nDo you feel that an authorization of $9 million would be sufficient\ninsofar as the Federal Government’s participation is concerned ?\nMr. Hughes. I do, Mr. Kornegay. In addition, we have private con¬\ntributions which have been announced of over $2 million for the Cor¬\nporation, $2,125,000 as I recall the figure.\nMr. Kornegay. Are those contributions contingent upon the Federal\nGovernment’s coming through again in 1969 or coming through in\n1969 with an appropriation ?\nMr. Hughes. I think no. They are outright grants.\nMr. Kornegay. There are no strings attached ?\nMr. Hughes. That is correct.\nMr. Kornegay. Would it be helpful to the Corporation in soliciting\ncontributions to have this authority from the Federal Government for\nthe coming year ?\nMr. Hughes. I think it is indispensable. It is necessary that we have\nit.\nMr. Kornegay. Is there certain money available which could be made\navailable in the event that the Federal Government authorizes and ap¬\npropriates money to assist in the operation of the Corporation in 1969 ?\nMr. Hughes. Yes. I think the commitments which have been an¬\nnounced, the $2,125,000, could be made available immediately. They\nhave been held up pending the organization of the Corporation.\nMr. Kornegay. Maybe my question was not too well phrased. Would\nit help you in raising money if the Government participates ? Is there\nmoney available on a matching basis ?\nMu Hughes. It certainly will, indeed.\nMr. Kornegay. I think that is all I have. Thank you very much.\nMr. Macdonald. Mr. Brotzman ?\nMr. Brotzman. Thank you, Mr. Chairman.\nI would understand that by virtue of the questions, you want to\nlust move the authorization from fiscal year 1968 to fiscal year 1969.\nThis presentation, I understand, has already been made to the Senate.\nIs that correct ?\nMr. Hughes. The Senate has passed the authorization, I believe, Mr.\nBrotzman.\nMr. Brotzman. I note a report here, but it is your recollection that\nthey have already passed this particular measure on the Senate side.\nMr. Hughes Yes.\nMr. Brotzman. To follow up with just one or two questions asked\nbefore, do you know how the Broadcasting Corporation, the Public"
}