{
  "id": "d30-112",
  "text": "12\nMr. Chairman, this resolution is primarily a statement of policy.\nI believe the Congress should go on record favoring such financial\nsupport by commercial broadcasters for this public effort.\nPresident Johnson, in his February message on education, stated\nthat he was asking administration officials to work with the Board\nof Directors of the Corporation for Public Broadcasting in formulat¬\ning a long-term financing plan. The President did not spell out the\nrange of this work. I can only assume that the possibility of com¬\nmercial broadcasters contributing will be considered. Communications\nfrom the Federal Communication Commission’s Chairman, Rosel\nHyde, indicate that in view of the President’s announcement, the\nFederal Communication Commission does not deem it appropriate\nto take a position, nor to make a study of this issue.\nMr. Chairman, I support H.R. 15986 because it provides short-term\nfinancing for educational television and radio. However, I urge the\nmembers of this subcommittee to support the content of my resolution\nand ask that you express this support to the administration so that\nwe may be assured that they will consider commercial broadcasters\nas a source of permanent financing for public education broadcasting.\nMr. Macdonald. Thank you for your brief statement, Mr. Farbstein.\nThe next witness is Mr. William Carey, Assistant Director of the\nBureau of the Budget, with two associates.\nSTATEMENT OF WILLIAM D. CAREY, ASSISTANT DIRECTOR, BU¬\nREAU OF THE BUDGET; ACCOMPANIED BY DEAN W. COSTON,\nDEPUTY UNDER SECRETARY, DEPARTMENT OF HEALTH, EDUCA¬\nTION, AND WELFARE; AND GERARD M. BRANNAN, DIRECTOR,\nOFFICE OF TAX ANALYSIS, DEPARTMENT OF THE TREASURY\nMr. Carey. I have Mr. Dean Cost on, the Deputy Under Secretary\nof the Department of Health, Education, and Welfare; and Mr.\nBrennan, representing Assistant Secretary of the Treasury Surrey.\nIt is our understanding that the Subcommittee on Communications\nis interested in the status of planning for permanent financing of\nof the Public Broadcasting Corporation authorized by Public\nLaw 90-129.\nI would like first to describe the administration’s position on the\ninterim financing bill now before you.\nThe purpose of H.R. 15986 is to authorize appropriations in 1969\ninstead of 1968 for startup activities of the Corporation for Public\nBroadcasting. Fiscal year 1968 is fast drawing to a close. The mem¬\nbers of the Corporation have just been confirmed by the U.S. Senate,\nand incorporation is now arranged under the laws of the District of\nColumbia.\nThe Corporation will not be in a position to function fully until\nthe fiscal year which begins next July 1. There was a general under¬\nstanding when Public Law 90-129 was under review by the Congress\nthat the appropriation authorization in the bill was an interim measure\nonly, and that the Corporation should begin to operate before long¬\nterm financing was authorized.\nThe present law did not anticipate the unavoidable delays asso¬\nciated with enacting legislation and starting any such new enterprise.\nFor these reasons, the administration recommends enactment of H.R."
}