{
  "id": "d30-115",
  "text": "15\nProvide an automatic Federal payment to the Corporation in\nan amount equal to donations received by local stations, perhaps\ndistributed in part on a matching basis and in part on an equal¬\nizing basis. This alternative would provide an incentive for in¬\ncreasing the share of non-Federal funds available for public\nbroadcasting, thus making the Federal contribution more efficient.\nUnder each of these arrangements for using general revenues, the\nexecutive branch and the Congress would evaluate the requirements of\nthe Corporation and assess the degree of Federal interest each 3\nor 5 years.\nI should also like to note other activities within the Government that\nmay have a bearing on any public broadcasting financing plan.\nAs you know, several months ago the Ford Foundation proposed a\nsystem of domestic communication satellites that would markedly alter\nthe economics of commercial broadcasting. Under that proposal, some\namount of revenues would be made available to improve the pro¬\ngraming of public broadcasting. This proposal is currently under con¬\nsideration by the FCC, which has not, at this date, reached any con¬\nclusions. The Senate Commerce Committee has also held hearings on\nthis proposal.\nIn addition, last August 14, the President announced a Task Force\non Communication Policy under the chairmanship of Under Secre¬\ntary Eugene Rostow, which is examining a number of major ques¬\ntions in the broad field of telecommunications, including a review of\nuse of domestic satellites. This task force is scheduled to report late\nin the summer.\nWhile we are uncertain as to the scope of the recommendations of\nthe task force, it would appear the report may have some bearing in\nconnection with the examination of ways in which new technology-\nmay change the operating patterns and costs of broadcasting distri¬\nbution.\nIt is plain that we have some difficult issues still to work out. In\nhis education message last month, the President took the position, as\nI noted earlier, that the long-range financing problem should not be\nresolved without further study and consultation. I cannot predict a\nquick answer, but I can assure you that the Bureau of the Budget and\nthe Treasury and Health, Education, and Welfare Departments will\npursue the alternatives carefully and consult with the congressional\ncommittees as the thinking crystallizes and work closely with the new\nBoard of the Corporation.\nMr. Coston, of the Department of Health, Education, and Welfare,\nand Mr. Brennan of the Treasury Department, may wish to add to\nwhat I have said.\nMr. Macdonald. We would be happy to hear them, but before we\ndo, I would like to have your thinking, as it comes up twice in your\ntestimony—and my questions are friendly, not unfriendly—where you\nindicated that the Departments would consult with congressional\ncommittees.\nI would like to know what congressional committee, except this one\nto authorize the bill, and the Appropriations Committee, would have\nanything to do with this bill.\nMr. Carey. I think, Mr. Chairman, you have identified the right\ncommittees. The only other possibility that occurs to me is that if the"
}