{
  "id": "d30-121",
  "text": "21\ntheory came into the picture—luggage, jewelry, furs, television, cos¬\nmetics, handbags, valises.\nI am a bit curious here about the list of commodities Mr. Carey put\ndown under the second proposal, a tax on the gross revenues of the\ncommercial broadcasters, and your reason for stating that that is not\na good idea was the fact that ultimately the cost would be passed on\nto the consumer or to the products, such items as automobiles, beer,\ncosmetics, nonprescription drugs, soap, and tobacco, which are engaged\nin and purchased in larger proportions by low- and middle-income\nfamilies than by high-income families.\nDepending upon the use, you could say almost all of those items\nare in the classification or category of luxuries, aren’t they ?\nMr. Bnannan. Many people insisted that the automobile was not a\nluxury, that was part of the argument about the tax, as you may\nrecall.\nMr. Kornegay. Depending on the uses, I say. To a traveling sales¬\nman, of course it is not a luxury. Beer, cosmetics, sweet-smelling\nsoap—and that is the kind that is mostly advertised on TV—are\nluxury items, with cigarettes and tobacco products.\nI don’t know liow anybody could answer a question that occurs to\nme at this time, until you have a budget and you can anticipate what\nthe appropriation from the Federal Government is that will be needed.\nMy question is, and I will throw it out anyway, to see if you have an\nanswer to it: Have you come out with any percentage figures with\nreference to a tax imposed on the gross revenues of the commercial\nbroadcasters; that is, if you elected to go that route ?\nMr. Carey. I would be glad to try that, Mr. Kornegay. We don’t\nreally have a number to nominate. I think in doing anything like that,\nyou would probably be at a fraction of 1 percent, some fraction of it.\nI don’t know at this point what it would be.\nI think certainly it probably would start out somewhere like that. It\nmight build up and become a small point or two over 1 percent over\na 10-year period, or something. But it is very, very speculative.\nThe last thing I think I would want would be to start premature\narguments about rates. It is a fair enough question, but I don’t think\nwe are anywhere near talking sense in terms of the rate yet.\nMr. Coston. I would like to add one thing, Mr. Kornegay: I don’t\nthink you can even speculate yet on the amount of revenues that you\nwould hope to have for the Corporation until the Corporation has been\nable to develop its own long-range plans as to what it wants to do.\nThis is one of the reasons why I think it is important that the\ncommittee and the executive branch, and the Corporation, first sit\ndown and describe and define some goals and objectives and programs\nthat the Corporation may wish to engage in. When those are worked\nout, we can begin then to fix the kind of financing program that we\nneed. Until that happens, I think, as Mr. Carey said, it is purely\nspeculative as to what levels of financing the Corporation may, in fact,\nneed.\nMr. Kornegay. As I indicated, I expected that to be the answer. I\nthink it is certainly plausible and reasonable.\nMr. Carey, has any consideration by you or the Bureau of the\nBudget been given to a tax or a fee on license renewal by commercial\nbroadcasters ?\n92-085—68-4"
}