{
  "id": "d30-124",
  "text": "24\nor requested by the President for enactment in 1968 because of the\ndelays generally in getting the enterprise going.\nMr. Broyhill. If this bill is approved, you will ask the Appropria¬\ntions Committee for the full $9 million ?\nMr. Carey. We will come up with a budget amount.\nMr. Broyhill. Will you ask for the full $9 million ?\nMr. Carey. That is my presumption. I am leaving it up to the Presi¬\ndent, but the reason we are here this morning asking you to enact this\nbill is that we certainly are going on the strong expectation that we\nwill come forward promptly with a budget amendment to fund it at\nthat level.\nMr. Broyhill. Actually, it seems to me that we are continuing the\nsame type of discussions we had in the hearings when we were con¬\nsidering the act last year. I know some of us wrote additional views,\nwhich I would like to refer to at this time.\nOn one page some of the members indicated that one of the weak¬\nnesses in the bill was “financing.”\nAnother statement is “Despite the very careful and patient effort of\nthe committee to get a clear and detailed picture of the financing of\nthe Corporation, the result is foggy and confused.”\nAnother statement is “Government witnesses could not help the com¬\nmittee clarify the plan for Federal assistance.”\nAnother statement is “Although there is no quarrel with financing\npurely instructional TV as in the past through general revenues from\nthe Government entities concerned, there are entirely too many un¬\nanswered questions about both the Federal level of moneys involved\nand the means of getting them to the Corporation.”\nThese statements are Still of concern to us today. My question is this:\nIs it my understanding that the Bureau of the Budget, the Treasury,\nand the Department of Health, Education, and Welfare are going to\nwork with the Corporation to come up with the financing plan ?\nMr. Carey. Yes, sir.\nMr. Broyhill. When will this be accomplished, and when will it be\nrecommended ? What is the timetable ?\nMr. Carey. There is not a set timetable on it, sir. As the President\nsaid in his message, I believe it was his budget message, he intended\nthis year to propose a plan. As far as I know, sir, that is about as ex¬\nplicit as we can be. I don’t think we are on the verge of answering the\nkind of questions we have been talking about.\nI am afraid that is the case. I can’t suggest we will be here quickly\nwith answers, but we will certainly, in the course of this year, get that\ndone. That is our objective and that is what the President said he wants\nto do.\nMr. Broyhill. No further questions, Mr. Chairman.\nMr. Macdonald. Mr. Harvey ?\nMr. Harvey. Mr. Carey, as I recall reading both the Ford Founda¬\ntion report and the Carnegie Commission report, they both recom¬\nmended specific taxes which you have enumerated here. The Ford\nFoundation recommended a tax on satellites, as I recall, and the Car¬\nnegie Commission recommended the excise tax on the sale of tele¬\nvision receivers.\nBoth of them, in their original reports, recommended specifically\nagainst financing from the general appropriations process, which you"
}