{
  "id": "d30-125",
  "text": "25\nare recommending here today. But as a practical matter, I gather that\nyou would agree with me that Congress is not about to pass another\ntax at this time.\nMr. Carey. Judging from the production of new taxes so far, sir;\nthat is probably a fair conclusion. I would like to make one thing clear:\nthat I am not really up here commending—I think that was the word\nyou used—financing from general revenues. I have set that out as one\nof the alternatives that we are talking about.\nMr. Harvey. You have set it out as an alternative, but we have to be\nmindful as a committee that the President has asked for a 10-percent\nsurtax to finance the war in Vietnam and Congress has not seen fit to\ntax that.\nThe President has asked, in addition, for a tax on travel abroad,\nand the Ways and Means Committee has not seen fit to pass that, and,\nin fact, at this very hour is killing that tax.\nSo as I say, as a practical matter, you are not seriously telling us that\neither of these other alternatives, these taxes, are realistic, are you ? _\nMr. Carey. I think they certainly are realistic enough to be very seri¬\nously considered by the Congress in settling the long-term financing of\nthis enterprise. The alternative would be, I take it, to rely entirely on\nthe general funds.\nMr. Harvey. I happen to disagree with the chairman, in that I think\nthe appropriate committee at this time would be the Ways and Means\n•Committee. I feel that if we are going to have public broadcasting in\nAmerica, it should be financed by one of these specific taxes that the\nFord Foundation or the Carnegie Commission report recommended.\nIf we are going to have public broadcasting, this Congress and this\nNation ought to face it and ought to finance it at the same time. We\nshouldn’t put the cart before the horse, as we are doing right now.\nI specifically disagree in that regard with what the administration is\nrecommending here today.\nI just might say here that it is almost incredible to me that you come\nhere from the Bureau of the Budget and recommend that we spend, if\nI understand correctly what you told Mr. Broyhill, $9 million on this\nfor next year.\nMr. Carey. Yes, sir.\nMr. Harvey. And we are spending $10 million on rent supplements\nthis year to provide housing for poor people in America. How this\nadministration can reconcile this sort of priority is beyond me. I\ncan’t believe that the President has looked at this since he made this\nrecent speech in Minnesota calling for austerity, nor can I believe that\nhe has looked at it in light of the Kerner Commission report calling\nfor changes and vast improvements in the slums and ghettos of\nAmerica.\nThis is just incredible, that you, from the Bureau of the Budget,\ncome here today and recommend this $9 million to be financed out of\nthe general appropriation process.\nMr. Careiy. I certainly respect your views, Mr. Harvey.\nMr. Harvey. Would you give this equal weight with the rent supple¬\nment program, for example, when you are sitting there in the Bureau\nof the Budget? Would you balance this equally for the poor people in\nAmerica?\nI happen to have voted for that rent supplement program, along\nwith 30 or 40 other Republicans. I happen to believe in it. I can’t be-"
}