{
  "id": "d30-127",
  "text": "27\nsupposed to do. For us to be arguing about something that we haven’t\neven given a chance, I think, is wrong. We are arguing about whether\nwe should change the figure 1968 to 1969. That is the reason I couldn’t\nsee getting far afield on many things right now.\nI think that should be kept in mind before the committee. I don’t\nthink we should get into political issues. We will fight the political is¬\nsues in November. I think all we want to do is change the figure 1968\nto 1969. That is the issue before the committee.\nMr. Harvey. May I reply to that, Mr. Chairman ?\nMr. Macdonald. Mr. Harvey.\nMr. Harvey. I would just like to call the attention of the chairman\nof the full committee to the fact that this $9 million is for next year\nthat they are asking for. I think because it is for next year it makes a\nsignificant change. This committee does have to weigh the priorities,\nwhether it is the important bill you say it is in relation to Vietnam,\nwhether it is the important bill you say it is in relation to the Kerner\nCommission report, whether it is the important bill in relation to the\nother problems that our Nation faces.\nI doubt that it is, It isn’t, in my judgment. I would hope that is not\nthat important a bill in the President’s judgment. I would hope, for ex¬\nample, that his lack of comment on the Kerner Commission report did\nnot reflect that he was unhappy with that report. I would hope that he\nis going to give it more emphasis than that.\nMr. Staggers. I might say in reply to that, that that is a difference\nof opinion. You certainly have a right to your opinion. I say we are\nonly here today to decide whether we are going to change 1968 to 1969.\nI reiterate my opinion that it is the most important bill this committee\nis going to put out for the future of America. I just don’t know what\nit would be.\nMr. Macdonald. Thank you, Mr. Chairman.\nMr. Brotzman ?\nMr. Brotzman. I have no questions.\nMr. Macdonald. Mr. Brown ?\nMr. Brown. Far be it from me to get involved in a colloquy between\nthe chairman and Mr. Harvey. I would like to observe that this is\npart of our philosophy of “legislation now and pay later” that seems\nto be rampant in this country.\nYou seem to be coming up to the “pay later” part of that without\nany very good answers.\nBefore we get into that, I would like to ask Mr. Coston this ques¬\ntion : Mr. Broyhill read some of the minority views in the committee\nreport when we passed public broadcasting last year. I would like to\nread from the general report on page 12. There is this comment.\nHEW testified it will not be able to approve all of the applications currently\nin hand because they would exceed the $10.5 million authorized in this bill.\nHave any of those applications under title I been abandoned or set\naside ?\nMr. Coston. No, sir; those applications are still all on file and will\nbe processed when the appropriations are forthcoming.\nMr. Brown. Have you had any additional applications %\nMr. Coston. I believe we have; yes, sir.\nMr. Brown. Do you know where the figure stands now ?"
}