{
  "id": "d30-128",
  "text": "28\nMr. Coston. I am not sure, but I can supply it for the record and\nI will do so.\n(The information requested follows:)\nHealth, Education, and Welfare Department Statement on Pending\nEducational Television Facilities Requests\nApplications for educational television facilities continue to be received by\nthe Department of Health, Education, and Welfare. The Educational Television\nFacilities Act of 1982 (P.L. 87-447) authorizes funding of applications received\nprior to June 30, 1968. As of March 25, 1968, 66 educational television facilities\napplications had been received and are pending for a total of $40,413,000 in\nproject casts.\nNo requests for noncommercial radio facilities, authorized under the Public\nBroadcasting Act of 1967 (P.L. 90-129) have been invited or received.\nA Federal share of not to exceed 75 percent of the project cost as authorized\nunder the Public Broadcasting Act of 1967 would require up to $30,309,750\nin Federal funds to support all existing educational television facilities\napplications.\nHowever, the Public Broadcasting Act of 1967 places a limitation of 8y2 per¬\ncent on the amount of an annual appropriation which can be distributed within\none State. With this restriction imposed on the FY 1969 request of $12.5\nmillion for grants, an amount of $14,480,000 in pending project costs exceed\nthe 8% percent limitation in 6 States. Therefore, there is a total of $25,933,000\nin existing projects eligible for consideration, or a total of up to $19,500,000\neligible for Federal funding support, based on the 75 percent Federal share\nauthorized under Title I of the Public Broadcasting Act of 1967.\nMr. Brown. If you would, I would appreciate it.\nAm I to understand that there is no urgency now about funding those\napplications or about making the funds available to those applicants ?\nMr. Coston. We have the applications on file. Because of the\nchanges in the law, there is a rather extensive redesigning of the pro¬\ncedures and regulations that will be required to take account of the\nrevised provisions, such things as the inclusion of radio, for example.\nMr. Brown. $500,000 was your estimate last year required to pro¬\nvide educational radio facilities ? Has that changed ?\nMr. Coston. No; I would say that is roughly the ratio at the mo¬\nment; yes, sir. But as soon as we get our procedures revised and are\nable to begin processing applications under the new procedures, we\nwould expect to resume that program.\nMr. Brown. So this is all merely procedural. There is no real thought\nthat you want to set aside the importance that was expressed last year\non the funding of these applications ?\nMr. Coston. No, sir.\nMr. Brown. Do you have any idea when those procedures will be\nstraightened out so that we can proceed with the funding of these\napplications?\nMr. Coston. We will expect to be in a position to resume funding\nof projects under title I when the appropriations are forthcoming, sir.\nMr. Brown. Wait a minute. Is it procedural or is it because of the\nappropriations ?\nMr. Coston. It is both. We do not have an appropriation at this\npoint. We have not requested a supplemental appropriation. Our\nposition was-\nMr. Brown. That is my question. Why not ?\nMr. Coston. Because we have not yet gotten the new procedures\nand the new operations design."
}