{
  "id": "d30-132",
  "text": "32\nwould be easily available to anyone who chose to tune in on it, rather\nthan to have to limit it to those who had the capability, the resources\nand so forth, particularly those maybe in our society who need it most\nhaving to depend on their personal resources in order to buy it.\nI would personally have some intellectual difficulties with that prop¬\nosition, but that is just a personal view.\nMr. Brown. I would say it would be possible that we might produce\n“My Fair Lady” on Saturday nights for people who would like to pay\nthe difference, which is also cultural, for the opportunity to watch the\nBoston Symphony free on Sunday night, and that balance might be\nworked out between the two.\nI have no further questions.\nMr. Macdonald. Thank you very much.\nMr. Carey. Thank you very much, Mr. Chairman.\nAgain, we appreciate the opportunity to be here and hope that the\nbill will be reported out favorably.\nMr. Macdonald. Thank you.\nOur next witness will be Mr. James Robertson, chairman of the ex¬\necutive board of the National Association of Educational Broadcasters.\nSTATEMENT OF JAMES ROBERTSON, CHAIRMAN, EXECUTIVE\nBOARD, NATIONAL ASSOCIATION OF EDUCATIONAL BROAD¬\nCASTERS; ACCOMPANIED BY CHALMERS H. MARQUIS, EXECU¬\nTIVE DIRECTOR, EDUCATIONAL TELEVISION STATIONS DIVISION;\nAND NORMAN JORGENSEN, COUNSEL\nMr. Robertson. I am James Robertson, chairman of the executive\nboard of the National Association of Educational Broadcasters, and\ndirector of educational communications, University of Wisconsin.\nWith me are Mr. Chalmers H. Marquis, executive director of the edu¬\ncational television stations division of the association, and our at¬\ntorney, Mr. Norman Jorgensen.\nThe association for which I speak is the professional association of\ninstitutions and individuals engaged in educational radio and tele¬\nvision. Its membership consists of universities, colleges, schools and\nnonprofit corporations which operate educational radio stations, edu¬\ncational television stations, and closed-circuit and 2500 mHz television\nsystems. It also represents over 2,600 individuals who are involved in\neducational applications of radio and television.\nIn its appearances before committees in both Houses of the Con¬\ngress, the NAEB has given detailed testimony in support of all\nthree titles of the Public Broadcasting Act of 1967. At each step\nof the act’s progress through the Congress to the desk of the President,\nwe have applauded the dedicated and exhaustive study and support\nwhich the act has received from the Congress. And we here state\nagain our strong endorsement of the Public Broadcasting Act—its\npurposes, principles, and processes.\nWe have stated, and we state again, our belief that the three titles\nof this act represent a unified program for the extension of an effec¬\ntive, independent, financially sound, noncommercial broadcasting sys¬\ntem to all parts of our country.\nWe have urged the continuation of the program of the Educational\nTelevision Facilities Act of 1962 and applaud the inclusion of radio"
}