{
  "id": "d30-134",
  "text": "34\nthe facilities program for more than 8 months. Now it is proposed\nthat the 1968 authorization of funds in the amount of $10,500,000\nfor the facilities program be discarded. More than $30 million in\nfacilities proposals already filed at HEW must wait for consideration\nuntil 1969 when, hopefully, the $12% million authorized for that year\nwill be appropriated and some of these projects can be approved.\nIt is also proposed that the Corporation for Public Broadcasting\nbe authorized funds for its establishment but not until fiscal 1969.\nThe Board of the Corporation has been appointed and has been con¬\nfirmed by the Senate. It is an outstanding and distinguished board.\nArticles of incorporation are being drawn up.\nThe corporation is eager to begin, now, the work which has been\nassigned to it by this committee and the Congress. But without funds\nit must stand aside. Planning is a practical impossibility.\nThe NAEB has been invited to come here today to speak to the\nsingle question raised by H.R. 15986: Should the authorization for\nthe corporation be changed from fiscal 1968 to fiscal 1969 ?\nOur answer is brief and obvious: The need is as real and present\ntoday as it was the day this Congress adopted the law we are examining\nhere. All had hoped that the appropriation would come in 1968. Since\nthat apparently is not going to happen, it must come in 1969, and\nas early as possible.\nTherefore, we urge this subcommittee to report favorably on the\namendment. The Senate has already passed the amendment. We hope\nthat both Houses of Congress will act without delay, and that appro¬\npriation action will follow promptly.\nBut we cannot merely make this statement and turn away. We\nmust also relate our deep distress over the probable loss of the $10,-\n500,000 facilities funds. We must plead again the urgency of educa¬\ntional broadcasting’s need, an urgency all the more acute because of\nthe time already lost.\nWe have pointed out that more than $30 million in facilities project\napplications have already been accepted for filing by HEW. These\nrepresent the needs of over 62 applicants. Proposals from more than\n20 other applicants have been received but cannot legally be accepted\nuntil title I is funded. These more than 80 applications repesent mil¬\nlions of dollars in local matching funds waiting to be put to work.\nHow long can these funds, pledged both to establish new stations\nand aid existing stations, be kept available? The fact is that these\ncommitted kinds of moneys frequently have limited life. Legislative\nfunds can be granted only for a stated period, then lapse; and private\nfunds, too, are often withdrawn when the project for which they were\npledged begins to appear uncertain of realization. Project costs are\nfrequently based on bids, and bids also hold firm only for a limited\nperiod.\nEven more significant is the loss of momentum. Projects begun with\nthe enthusiastic support of local individual volunteers and of State\nand local governmental bodies lose their direction and force when the\nCorporation for Public Broadcasting which Congress intended to point\nthe way is not yet able to assume its responsibilities.\nThere is another loss in addition to these losses of Federal funds,\nlocal matching funds, momentum, and time. That is the loss in pro-"
}