{
  "id": "d30-138",
  "text": "38\nCongress “recognized * * * that a public broadcasting service could\nmore fully meet the educational and cultural needs of the Nation.”\nIn urging Congress to reaffirm its commitment to the Public Broad¬\ncasting Act of 1967 as passed and to appropriate the full amounts for\nfiscal 1968 as authorized, the committee in its resolution stated:\nTo settle for less, at this critical moment, could do serious harm to the de¬\nvelopment of the Corporation for Public Broadcasting and the continued growth\nof strong local stations.\nThe $10.5 million facilities moneys alone, which was to have been\nappropriated for fiscal 1968 and was properly expected by education¬\nal broadcasters and their audiences as a simple extension of the Educa¬\ntional Television Facilities Act of 1962, are desperately needed by the\neducational stations of this country. Already, there are project requests\ninto the Department of Health, Education, and Welfare for funds Zy2\ntimes the amount that was to have been, but as yet has not been, ap¬\npropriated for fiscal 1968. The needed moneys for educational sta¬\ntion facilities are mounting at the rate of almost $20 million per year,\nwhile no money is appropriated for them.\nThe committee strongly holds that the $10.5 million in facilities\nmoneys should still be appropriated for fiscal 1968. The Corporation\nfor Public Broadcasting must inherit the strongest possible system\nof educational television stations for it to service in the public interest.\nThe committee has no desire to divorce itself from the multitudinous\nproblems this Nation faces. The committee exists, in point of fact, to\nfoster a broadcasting system that will help this Nation better to face,\nunderstand, and solve these problems. Where Federal funds are un¬\navailable because of emergency budgetary considerations caused by the\ndifficulties in which this country finds itself, the committee reluctantly\ncan understand delay.\nEven so, there are several points in conjunction with the funding\nof the Corporation for Public Broadcasting that we believe must be\nmade with precision. A public broadcasting system of the breadth\nenvisioned in the Congress’ 1967 act cannot get fully underway until\nFederal moneys begin to make it possible.\nSuch a public broadcasting system, at this point in our history,\ncould do much to report and clarify the issues which threaten to tear\nthis Nation apart. The fact is that any delay in starting a strong,\nhealthy, and productive public television system on its way keeps\nour national communications from taking on a form that is absolutely\nessential to this Nation’s well-being.\nOnly through the offices of the Corporation for Public Broadcast¬\ning, according to Congress’ own definition in the Public Broadcasting\nAct of 1967, can all the activities that a strengthened public television\nthis country needs be accomplished. It is imperative, from the com¬\nmittee’s and the country’s point of view, that the Corporation get\nstarted to—\nFacilitate the full development of Public Broadcasting.\nBe the body to assist in the establishment and development of\nnoncommercial television and radio stations.\nMake funds available for production of programs of high\nquality for noncommercial broadcasting.\nObtain grants from various sources and make payments to\nlocal stations for programing and other costs of operations."
}