{
  "id": "d30-139",
  "text": "39\nArrange by grant or contract for interconnection facilities at\nthe free or reduced rates which the communications common\ncarriers are permitted by the act to provide.\nEngage in activities that will assure maximum freedom of\nthe system and its stations.\nHave final responsibility for recommending a permanent fi¬\nnancing plan for public broadcasting.\nThe committee backs these roles of the Corporation for Public\nBroadcasting. Through its public information efforts and through\nspecial studies, such as one on financing recommended by its members\nto be made expressly for the Corporation, the committee will do all\nit can to see that the Corporation move ahead expeditiously. But the\nCorporation cannot move ahead as it should until its initial, minimal\n$9 million in Federal moneys are appropriated.\nFor all the reasons I have enumerated, I believe it unlikely that the\ncommittee would on another occasion willingly accept any further\ndelay in getting public broadcasting going. The committee expects\nthat public broadcasting—or at least that tiny footpath which is really\nwhat we are talking about here today that can lead to a full-fledged\npublic broadcasting system in this country—must at last begin to\nmove in the directions laid down by the Congress in the Public\nBroadcasting Act of 1967.\nIn summation, the citizens committee believes that the $10.5 mil¬\nlion in facilities moneys still must be appropriated for fiscal 1968.\nThe commit to urges that the amendment being considered here today\nbe approved.\nFurther, the committee asks 'that the full sums of $9 million for the\nCorporation—as well as the $12.5 million for facilities called for in\nthe act for fiscal 1969—be appropriated as quickly as possible.\nI thank you.\n(The attachments referred to follow:)\nResolution Adopted Unanimously February 12. 1968, by the National\nCitizens Committee for Public Television\nThe President proposed and the Congress, through bipartisan support, enacted\nthe Public Broadcasting Act of 1967.\nThe Act has three main provisions : Title I, which extended construction grants\nfor educational broadcasting facilities and authorized an appropriation for the\ncurrent fiscal year of $10.5 million; Title II. which created the Corporation for\nPublic Broadcasting and authorized an appropriation until expended of $9 mil¬\nlion; and Title III, the instructional broadcasting study for which funding\nprovisions have been made.\nBoth the Administration and Congress recognized by their action that a Public\nBroadcasting service could more fully meet the educational and cultural needs\nof the nation.\nThe provisions of this astute legislation have been hailed unanimously by\neducational television stations, National Educational Television, the Educa¬\ntional Television Stations Division of the National Association of Educational\nBroadcasters, educators, the members of the Carnegie Commission and the Na¬\ntional Citizens Committee for Public Television.\nToday the House Appropriations Committee has before it a budget request for\n$4 million to finance the Corporation’s initial activities. No request for funds for\nTitle I has been made for 1968.\nThe Committee believes that Congress’ initial judgment on the minimum\nnecessary funding was sound for Titles I and II. Further, the authorization in¬\nspired substantial contributions from the private sector.\nTo settle for less, at this critical moment, could do serious harm to the develop¬\nment of the Corporation for Public Broadcasting and the continued growth of\nstrong local stations."
}