{
  "id": "d30-142",
  "text": "42\nRobert E. Quinn, M.D.: Chairman, Ohio University Public Television-Radio Ad¬\nvisory Committee, Athens\nA. Philip Randolph: International President, Brotherhood of Sleeping Car Por¬\nters!, New York City\nRobert Rauschenbreg: Artist, New York City\nCharles E. Reilly, Jr.: Executive Director, National Catholic Office for Radio\nand Television, New York City\nFrank A. Rose : President, University of Alabama, University\nEdward L. Ryerson: Honorary Charmas, Chicago Educational Television Asso¬\nciation (WTTW)\nCarl E. Sanders: Former Governor of Georgia, Atlanta\nDick Schaap : Journalist, New York City\nSusan Schmidt: Editor, Colorado Daily, University of Colorado, Boulder\nBudd Schulbreg: Author, Los Angeles\nMrs. William H. Schuman: Chairman, Friends of Channel 13, New York City\nTy Scoggins: Manager, Personnel and Public Relations, Tidewater Oil Company,\n‘Los Angeles\nCharles A. Siepmann (T) : Professor Emeritus, NYU, New York City\nMrs. Arthur Skelton: Chairman, Washington State ETY Commission,. Olympia\nMrs. David E:. Skinner (T) : Patron of the arts and education, Bellevue, Wash¬\nington\nRobert Smylie: Former Governor of Idaho, Boise\nPhilip M. Stem: Author, Washington, D.C.\nMrs. Robert J. Stuart: President, League of Women Voters of the U.S.A., Wash¬\nington, D.C.\nMaria Tailchief: Ballerina, Chicago\nAllan Temko: Institute of Urban Affairs, University of California, Berkeley\nGus Tyler: Assistant President, International Ladies Garment Workers Union,\nNew York City\nLeslie Uggams: Actress, New York City\nEli Wallach: Actor, Newr York City\nJune Wayne (T) : Director, Tamarind Lithography Workshop, Los Angeles\nCaspar W. Weinberger: Attorney, San Francisco.\nLeonard Woodcock: Vice President, United Auto Workers, Detroit\nRobert B. Wright: Vice Chairman, Georgia State Board of Education, Moultrie\nPaul A. Yetter: Vice President, Public Service Company of Colorado; President,\nCouncil for KRMA/Channel 6, Denver; Vice Chairman, Colorado Commission\non Educational Television\nWhitney Young, Jr.: Executive Director, National Urban League, New York City\nMr. Macdonald. Mr. Harvey.\nMr. Harvey. He has touched on the only question I had.\nI noted that in both Mr. Eobertson’s statement and in Mr. Kubasik’s\nstatement, on page 4 of Mr. Eobertson’s and page 5 of Mr. Kubasik’s,\nboth of them emphasize what they really wanted was not only the $9\nmillion that this bill covers, but the $10.5 million for facilities'in 1968,\nand in addition to the $9 million for 1969, an additional $12.5 million\nfor facilities in 1969.\nIs that correct ?\nMr. Eobertson. That is correct, sir. That is an endorsement of the\naction of this subcommittee, this committee as a whole, and of the\nCongress in the act which is now the law of the land.\nMr. Macdonald. Gentlemen, we appreciate your coming this far and\nhaving such little time, but the bureaucrats consumed quite a lot of\ntime. There is nothing much we can do about it.\nI will recognize Mr. Brown. The House is in session.\nMr. Brown.\nMr. Brown. Do any of you gentlemen have any idea what the ulti¬\nmate total responsibility will be in this field ? What is the total cost of\nthe operation of the Public Broadcasting Corporation ?\nMr. Eobertson. In order to answer Mr. Brown’s question and also\nto save time, Mr. Chairman, I would suggest that all of this is in the"
}