{
  "id": "d30-143",
  "text": "43\nrecord of the past hearings. I don’t believe there are any changes that\nanybody would suggest at this particular j uncture.\nMr. Macdonald. Out of courtesy, do you know the answer, just to\ngive it to him ?\nMr. Robertson. You are asking for the total amount for the Cor¬\nporation for Educational Television ?\nMr. Brown. The functioning corporation.\nMr. Robertson. The Department of Health, Education, and Wel¬\nfare had provided for the corporation a projection which is found on\npage 53 of the committee’s former report by fiscal years, starting with\n$9 million in fiscal 1968, and running up to $120 million in 1973, with\nthe comments that the long-range corporation budget is not expected\nto exceed $160 million by about 1980.\nMr. Brown. That is the answer I wanted.\nWould you react to the suggestion of a possibility of a combination\nof subscription or pay television with a tax on broadcasters ? The tax\non broadcasters has some built-in thermostat because if ETV can be\nconsidered to be competitive with commercial broadcasters, then when\nthe commercial broadcasters don’t do so well because of the fluctuations\nin the economy, presumably ETV would have less money to operate\non, too. And, you wouldn’t be tied to a quixotic Federal Government,\neither in the Congress or in the executive branch. Could you comment\non that ?\nMr. Robertson. I would be glad to, Mr. Brown.\nI would say in answer to your comments that these are the kinds of\nconsiderations which educational broadcasters generally are in the\nmidst of studying.\nI don’t think any one of the suggestions that has been made, in¬\ncluding pay television, should be thrown out. There are specific ob¬\njections and specific strengths in all of them, but I don’t think we are\nprepared to say yet precisely the plan we would support.\nMr. Brown. When do you think you will be prepared ?\nMr. Robertson. I think we need to see some action on the part of\nthe Public Corporation.\nMr. Brown. Roughly. One year, 5 years, 20 years?\nMr. Robertson. One year.\nAir. Brown. Thank you.\nMr. Macdonald. Thank you, Mr. Brown.\nMr. Brown. Have any of you read a statement made by Federal\nCommunications Commissioner Robert Lee on January 26 on the re¬\nsponsibility of stations in news presentations, made to a conference\nheld at the continuing education center at Notre Dame University ?\nMr. Ktjbasik. I heard reports of it, but not the full statement.\nMr. Brown. Mr. Chairman, I would like to ask that the statement\nbe placed in the record at this point for the interest of the members of\nthe committee.\nMr. Macdonald. Without objection it is so ordered.\n(The statement referred to follows:)\nRemarks of Commissioner Robert E. Lee, Federal Communications Com¬\nmission, Conference at the Continuing Education Center, Notre Dame\nUniversity, South Bend, Ind., January 26,1968\nresponsibilities of stations in news presentation\nA network commentator, covering the 1964 Convention, spotted a civil rights\ndemonstrator who had prostrated herself on the convention floor. He told the"
}