{
  "id": "d30-145",
  "text": "45\nBroadcasting Corporation. I believe that the proper acceptance of the ETV\nstation can bring a new dimension to both the commercial and ETV stations.\nNetwork and locally originated news has matured and, in my opinion, per¬\nforms a very, very good job. I see no reason why ETV stations under the Public\nBroadcasting Act should compete in the area of regularly scheduled hard news.\nThe ETV station can perform a worthwhile service in analyzing the news panel\nshows and editorials in depth.\nI recognize, of course, that there is no such proscription in the enabling legis¬\nlation and as a matter of fact, the Carnegie Report which is the catalyst of the\nPublic Broadcasting Act makes much of the contribution that they may make\nin the area of live news. On reflection, I merely indicate my concern with such\nprogramming not because I would not trust the integrity of the PBC broadcaster\nbut rather because I believe live news may carry the appearance of bias from\na government sponsored corporation. Unhappily, human nature is such that\nbias is defined as that with which one disagrees.\nAs I read the debate on the Public Broadcasting Act of 1967, however, I am\nstruck with the legislative intent of not creating competition to the existing\nbroadcast structure but rather to provide a new and exciting choice to the dis¬\ncriminating audience.\nWith the Board of Directors appointed by the President and the use of Govern¬\nment funds, it is difficult indeed to look at ETV as a completely non-government\nfunction.\nActually, in this area of financing ETV broadcasting, I believe that significant\nfinancial contributions from commercial stations may result in substantial\nbenefits to all parties, including the public. I have considered various proposals\nfor government and private support, including the excise tax of 2-5% on new\nTV set sales and charitable contributions by commercial broadcasters, private\nindustry and various foundations.\nI feel that industry support of ETV should properly be considered a business\nexpense of the commercial broadcaster. I have from time to time attempted to\ncreate a dialogue on an idea I have had. I might as well try it on you. All broad¬\ncast stations are licensed to serve in the public interest. This has been interpreted\nas including a concern with the type of programming that a proposed station\nintends to “air” to “serve the needs of the community.”\nThe concern of the Commission with programming vis-a-vis a prohibition\nagainst censorship has been a complex administrative problem. It seems to be\nresolving itself into a deep concern with the expertise of the licensee in the\nprogramming area. The Commission concern is to insure that the licensee is\nindeed an “expert” in the needs of the community and bow these needs are\nbeing served by competing media. When analysis shows him a void that he can\nfill by his programming schedule, he files his proposal with his application. The\nCommission properly quizzes its licensees as to what they have done to make\nthemselves “expert” and having reached affirmative judgment, largely relies\non the programming proposals submitted by the applicant. Thus, it becomes\nthe licensee’s “promise” against which is measured his “performance” at renewal\ntime at a later date. One caveat. It would be unrealistic for the commission\nto bind the licensee to his precise promise for a three-year license period New\nmedia enters the market, the effect of which the licensee analyzes to determine\nwhat, if any, programming changes he should make to tailor his so-called\n“void.” After notification to Ithe Commission, this amends his original proposal.\nThus we have, for example, stations which program all news, religion, ethnic,\nadvertising and music. This presupposes that the licensee survey has shown the\ntotality of other broadcasting media provides the community with well-rounded\nprogramming.\nThe basic problem with commercial broadcasting today is the intense com¬\npetition for a small amount of broadcast time. There are only 18 hours at most\nin the full broadcast day. Actually, given our living habits, there are only three\nor three and a half hours—usually from 7:00 to 10 :30 P.M.—when most adult\nhuman beings find it convenient to watch television. The broadcasting networks\nand broadcasting stations are in an enormous competition simply to deliver the\nlargest possible audiences during this time segment. With the exception of\nthe 7 o’clock news programs on some stations, the general public generally\nhas no choice but to Watch the mass appeal programs. At -the risk of being\ninconsistent with my previous remarks, I might say that on Sunday night even\nthe news programs are somewhat curtailed. Moreover, only a minute or two can\nusually be given on the news programs to, say, a major report on a very basic\nissue—a report to which even the small newspapers would give a thousand"
}