{
  "id": "d30-93",
  "text": "Proposed Board of Directors\nCorporation for Public Broadcasting\nChairman: Frank Pace, Jr., President, National Institute of Social Science\nand a member of the Presidents Foreign Intelligence Advisory Board.\nTerm six years.\nJoseph A. Beirne, President, United Electrical and Communications Workers\nof America and vice president of the AFL-CIO. Term four years.\nRobert S. Benjamin, Chairman, United Artists Corporation, Partner in New\nYork law firm of Phillips, Nizer, Benjamin, Krim and Ballon. Term six years.\nRoscoe C. Carroll, General Counsel for the Golden State Life Insurance Company,\nLos Angeles and a member of the Board of Welfare Planning Council for the Watts\narea of Los Angeles. Term two years.\nDr. Milton Eisenhower, President emeritus of John Hopkins University.\nTerm six years.\nMichael A. Gammino, President, Columbus National Bank of Rhode Island,\nTrustee and treasurer of the Newport Metropolitan Opera Festival and Trustee\nfor the repertory theater in Rhode Island. Term four years.\nMrs. Oveta Culp Hobby, President and editor, Houston Post. Secretary of\nHealth, Education and Welfare, Eisenhower Administration. Term four years.\nSol Haas, Chairman, Station KIRO, Seattle, Term two years.\nJoseph D. Hughes, Vice President, T. Mellon & Sons and administrative trustee\nof the Richard King Mellon Foundation, Pittsburgh, Co-chairman of the\nPennsylvania Committee for Public Television. Term four years.\nDr. James R. Killian, Chairman, Corporation of the Massachusetts Institute of\nTechnology. Term six years.\nErich Leinsdorf, Director, Boston Symphony Orchestra, Member of the\nMassachusetts Arts Council and a trustee of the Kennedy Center for the Perform¬\ning Arts, Washington. Term two years.\nJohn D. Rockefeller, III, Chairman Rockefeller Foundation. Term two years.\nCarl Sanders, former Governor of Georgia, Member of the National Commission\non Urban Problems. Term four years.\nFrank E. Schooley, Director of Broadcasting and an associate professor of radio\nand television at the University of Illinois and former president of the National\nAssociation of Educational Broadcasters. Term two years.\nMr. Jack Valenti, President of the Motion Picture Association of America,\nFormerly Special Assistant to President Johnson. Term six years."
}