{
  "id": "d30-96",
  "text": "-2-\nPublic broadcasting commends itself particularly to the young people\nwhose careers have emerged since World War II. Their urge and capacity\nfor intellectual, moral and cultural improvement is immense. They have the\ncreative instincts that can establish a new order of magnitude in the whole\nrealm of television.\nBut, Mr. Chairman, we are pragmatic men and women. We realize\nthat the road to glory opens up only after we have done the hard work needed\nto establish a sound base, identify short and long-range goals, determine\npriorities, and build a staff carefully --in short, after we put in the kind of\nlong hours and competent judgment that make any institution effective. It\nwould be unwise to expect any spectacular approaches or results in the early\nstages of this operation. These can come only after the groundwork is laid\nand some experimentation undertaken.\nOnce the Corporation for Public Broadcasting is properly positioned,\nit should be possible to move forward on several fronts at the same time.\nThe opportunities before the local stations are exciting. It seems to\nme that they should come to be the focal points of urban development and\nunderstanding. Public television can provide means for the city to communicate\nwith its citizens and vice versa --it can, in short, re-establish civic pride\nand civic identity. This is an opportunity on which the wisest and most\nimaginative citizens in the community should seize.\nFurther, it seems to me that the Corporation should encourage schools\nand universities to provide courses to train young, exciting minds both in the\ncreative and managerial fields, so that they might address themselves to\ncareers in public broadcasting. The physical sciences have been the beneficiary\nof genius in the twenty to thirty-year age range; there is no reason why this\ncreative capacity should not also address itself to the social sciences. Univer¬\nsities, particularly those with educational television affiliation, should be en¬\ncouraged in this area. There is a great opportunity for breakthroughs in\nresearch, perhaps financed in the beginning by foundations at the local station\nlevel, later to be supported by the Corporation.\nInstitutionally, the Corporation for Public Broadcasting should provide\nthe local stations with facilities not available in the past. Carefully directed\ncentral production and effective intercommunication can make a new order of\nprogramming available to our communities.\nFinally, it is clear that the Corporation can be effective only if it is\ntruly independent. This was recognized in the Congressional hearings, by the\nPresident and by the Carnegie Commission. It will require wisdom and fore-\nbearance on the part of both the Executive and the Congress to permit this to\ncome to be."
}