{
  "id": "d1254-0",
  "text": "\" Vol. IV, No. 12 DuPont Circle Building, Washington 36, D.C. August 16, 1963'\nSEMIS APPROVES ETV FACILITIES APPROPRIATION\nThe Senate has approved the HEW requested appropriation of $7,000,000 for\nmatching grants under the ETV Facilities Act for 1963-64. Since the House had\npreviously cut the appropriation to $5,000,000, a conference between the two\nhouses will now be necessary to arrive at a determination of the actual amount to\nbe appropriated.\nADDITIONAL APPLICATIONS FOR ETV GRANTS\nHEW has accepted for filing five more applications for matching-fund grants\nunder the ETV Facilities Act, bringing the total accepted to 17• The five latest\n(with amounts requested from HEW rounded off) are: San Mateo (Calif.) Jr. College\nfor construction of a new ETV station on Ch. 8 - $204,000; Univ. of Utah to expand\nKUED, Ch. 7, to acquire 18 translators - $246,000; Miami Univ. (Oxford, 0.) to\nincrease service area of WMUB, Ch. 14 - $128,000; Regents of the Univ. System\nGeorgia to expand WGTV, Ch. 8 - $136,000; Delta College, Bay City Mich., to activate\n^ Ch. 19 - $187,000.\nIn addition to the 17 applications so far accepted, six more have been\nreceived by HEW but have not yet been processed. These 23 applications anticipate\ntotal expenditures of (approximately) $6,200,000, with $3,800,000 requested from the\ngovernment.\nTeams from HEW and the FCC have visited the nine district offices throughout\nthe country, and report that each meeting was attended by 40 - 70 representatives of\neducational institutions interested in ETV and in learning more about the grants\navailable under the ETV Facilities Act.\nOfficials administering the Act have asked us to make it clear that applica¬\ntions to HEW should not necessarily await final determination of the availability of\nlocal matching funds. If the final approval of such funds must await subsequent\nlegislative action, or if there is adequate assurance that such funds will be made\navailable in the foreseeable future, application to HEW for a matching grant . should\nbe made now, in order that a low file number may be assigned to the application and\nthe application processed. The applicant can subsequently notify HEW \"when final\nassurance of matching funds is received.\nOVERSEAS POSITIONS WITH UNESCO OPEN\nr\nThe U.S. National Commission for UNESCO has asked the NAEB Washington office\nto assist in locating qualified applicants for two UNESCO positions in the field of.\nmass communications. One opening, in Baris, is for a Program Specialist to assist in.\nplanning and implementing UNESCO activities concerned with development of mass communi¬\ncations techniques in education. This position pays $7,460, plus living allowances\nand exemption from income tax. The other position, in Bangkok, Thailand, is that of\nSpecialist in AV Media and Teaching Aids. This person will maintain a clearing house\nservice of information in the teaching aids field; stimulate and assist in exhange of\nAV materials; stimulate and assist in production of AV and other instructional materials\nstimulate and assist in training of AV personnel and teachers in production and use of\nmaterials; and concern himself with all levels of in-school and out-of-school education."
}