{
  "id": "d1254-1",
  "text": "taking into account the use of radio, and eventually TV, and other new techniques of\neducation. The salary is $8,930, plus living allowances and exemption from income\ntax. Those interested should write to Mr. John Sauls, Office of International\nAdminstration, Dept, of State, Washington 25, D.C., indicating they learned of the\nopenings from the NAEB.\nNAEB COMMITTEE STUDYING FM ALLOCATIONS PROBLEMS\nThe NAEB Radio Advisory committee, chaired \"by Larry Frymire, is looking into\nthe problem of educational needs for FM during the next several years, especially in\nthose states bordering Canada. The FCC has announced that new educational allocations\nin the FM band will probably be made in the future and that one of the problems is\nthat of coordination with Canada* *s need for FM frequencies. NAEB*ers with plans for\nfuture FM stations in those states affected should notify Headquarters immediately,\nand the information will be passed on to the committee.\nWILLIAM WOOD NAMED HEW CONSULTANT\nWilliam A. Wood, professor of Journalism, Columbia U. (and formerly manager\nof ETV stations, WQED, Pittsburgh and WTVS, Detroit), has been employed for one month\nas a consultant in the administration of the ETV Facilities program of HEW. Wood\nreplaces ©.Leonard Press who has been serving in this capacity for the past six weeks.\nPress returns to Kentucky to assume his new responsibilities as Exec. Director, Ky.\nETV Auth. Until a full-time director is hired for the ETV Facilities program, Charles\nZellers (Exec. Officer, Bureau of Ed. Assist. Progs., USOE) is acting director.\nNEW ETV CHANNEL FOR KENTUCKY\nOn Aug. 1, the FCC assigned and reserved Ch. *33 in Hazard, Ky., and deleted\npresently reserved Ch. *19, at request of Ky. ETV Auth., which also requested that Ch.\n*19 be assigned to Ashland. FGG separated this latter matter, for separate considera¬\ntion, and invited comments supporting either substitution of Ch. *19 at Ashland for\npresently reserved Ch. *78, or addition of Ch. *19 as second ETV channel.\nMISCELLANEOUS FCC ACTIONS\nGranted (July 10) to Odessa (Tex.) College, CP for new noncommercial FM\nstation to operate on 91*3 me; ERP 5*5 kw; antenna height 255 ft.\nGranted (July 19) to KUSD-TV, U. of S.D., Vermillion, license for noncom¬\nmercial ETV station.\nGranted (July 23) to Eastern Wash. State College (Cheney), CP for new\nnoncommercial educational FM station to operate on 89*9 me with 10 w.\nGranted (July 25) to N.J. ETV Corp. (Glen Ridge), CP for new noncommercial\nETV station, Ch. *77; ERP - 369 kw visual, 185 kw aural.\nGranted (Aug. 2) to WARC, Allegheny Coll., Meadville, Pa., license for\nnoncommercial educational FM station.\nGranted (Aug. 8) to U.S.L. Student Corp. (Lafayette, la.) license for\nnoncommercial educational FM station, KRVS.\nGranted (Aug. 8) to Indiana U. (Bloomington), CP for new noncommercial ETV\nstation, Ch. *30; ERP - l4.4 kw visual, 7.8 kw aural."
}