{
  "id": "d1723-13",
  "text": "As a result, agriculture offers little hope for employment* The small businessman\nnever flourished in.large cities: his forte was the smaller towns* And the growth of\nurbanization, large scale-technology in industry and commerce, and the corporation\nreduced the small businessman to an anachronism in our society* Businessmen are about\n6 percent of the labor force, and most of them are small* Yet the characteristic role\nOf the small businessman is that of the unsuccessful hanger-on* Both the small and\nthe new firms typically fail; they are competing for a small share of the market* In\nthis sense they are hanging on to a market the bulk of which is preempted by large\ncorporate business (in 191+0, over half of the retail stores did only 9 percent of the\nbusiness but employed 21 percent of all people in retail trade)*\nThe result of this process for both farming and small business has been the develop¬\nment of a quite unrealistic \"rhetoric of competition\" in political thinking and talk¬\ning* In a very provocative chapter under this title, the author explores the use made\nin politics of the anxieties and frustrations of the agricultural and property-less\nurban population*\nThe middle class—the white collar class—consists of the managers, salaried profes¬\nsionals, sales people and office workers, who together in 19^4-0 outnumbered the old\nmiddle class (farmers, businessmen and free professionals) in the order of 6 to 4.\nAnd, as Mills sees them, the white collar class is subordinated.to and by what he calls\n\"the managerial demiurge\"© This demiurge is a managerial organization of our society:\n\"The managerial demiurge means more than an increased proportion of people who work\nand live by the rules of .business, government, and labor bureaucracy; it means that\nat the top, society becomes an uneasy interlocking of private and public hierarchies\nand at the bottom, more and more areas become objects of management and manipula¬\ntion* Bureaucratization in the United States is by no means total; its spread is\npartial and segmental, and the individual is caught up in several structures at\nonce* Yet, over-all, the loose-jointed integration of liberal society is being\nreplace , especially in its war phases, by the more managed integration of a corpor¬\nate-like society*\" (p. 78)\nMills1 penetrating conception of'the role of the white collar people is tied to an\nunderstanding of their relation.this demiurge* ^-t is essential to realize that his\nview has noiteng in common with that of Burnham and others who say that as the result\nof a managerial revolution big management has replaced big property owners as a ruling\nclass. He recognizes that property rights have been undisturbed and that the influ¬\nence of big management is based not on property rights but on personal qualities, ihe\ndominant personal qualities have little of the older competitive drive* Most of the\nwhite collar population has been rationalized in large business organizations.\n\"Rationalized\" means supplied with mechanical aids and geared together in a ramified\nadministrative ■ structure •' VJhite collar people are thus the links in the chain of\ncommand, carrying authority but not being its source. It follows as a matter of course\nthat the skills which matter most in such a system a re less and. less material tech¬\nniques and more and more the manipulation of people. Manipulation is the essence of\nsalesmanship* And comman values and mutual trust are exploited manipulatively. The\nThe result is summed by suecinetily:\n\"Without common values and mutual trust, the cash nexus that links one man to.an¬\nother in transient contact has been made subtle in a dozen ways and made to bite\ndeeper into all areas of life and relations. People are required by the salesman\nethic and convention to pretend interest in others in order to manipulate them. In\nthe course of time, and as this ethic spreads, it is got unto. Still, it is con-"
}