{
  "id": "d1723-2",
  "text": "- 3 *\nCommissioner Webster Dissents to Other Grants\nOn August li* the FCC authorized noncommercial stations for Binghamton and New York\nCity, which will operate on ultra-high channels 1*6 and 2£ respectively. Binghamton’s\nantenna height will be £1*0 feet with ERP Of 200 kilowatts visual and 10£ kilowatts\naural, while New York City’s station will have a 680 foot tower with ERP of 20£ kilo¬\nwatts visual and 110 kilowatts aural.\nThe University of the State of New York has pending applications for stations at\nSyracuse, Ithaca and Utica, which await solution of engineering problems.\nCommissioner Edward M. Webster, in a dissenting opinion, asserted that permits for\nstate-supported educational television stations should not be issued until state\nlegislatures had appropriated funds for construction and operation of the stations.\nChannels set aside for education, Webster said, should be kept open for other appli¬\ncants until the appropriation of funds assured that they would be used.\nFlorida Grant Held Up\nThe Commission addressed the following letter to the Lindsey Hopkins Vocational\nSchool of the Dade County Board of Public Instruction, Miami, Florida:\n’’This is with reference to your application as last amended on July 1, 19£2, for a\npermit to construct a noncommercial educational television station on Channel 2 in\nMiami, Florida.\n’’Your application indicates that your organization has entered into a leasing agree¬\nment with Southern Radio & Television Equipment Company, licensee of television sta¬\ntion WTVJ now operating on Channel h in Miami. Under the terms of this lease, the\ntelevision transmitter facilities of station WTVJ will be made available to your\norganization at a rental of $1 per year. You indicate, however, that the above lease\nwill not become effective until the application of Southern Radio and Television\nEquipment Company (PBCT-868) requesting modification of its facilities to specify a\nnew site, higher power and higher antenna height is granted and that, accordingly,\nyour application for a noncommercial educational television station in Miami is con¬\ntingent on the grant of the modification application for station WTVJ.\n”In view of the foregoing, consideration of your application for a noncommercial\neducational television station to operate on Channel 2 in Miami, Florida (BPET-2)\nwill be withheld pending a determination by the Commission of the WTVJ application.”\nThe Commission vote in regard to the construction permits for Kansas State College\nwas as follows; Paul A. Walker, Chairman, Yes; Rosel H. E&rde, No; Edward M. Webster,\nAbsent; Robert F. Jones, No; George E. Sterling, Absent; Frieda B. Hennock, Yes;\nRobert T. Bartley, Yes.\n^t-#**#***##* ^ * # # * # # * # #\nTHE PRINCIPAL SESSIONS OF THE ANNUAL CONVENTION WILL BE HELD IN THE CENTER FOR CON¬\nTINUATION STUDY ON THE MINNEAPOLIS CAMPUS OF THE UNIVERSITY OF MINNESOTA. IN THIS\nONE BUILDING THERE ARE SLEEPING FACILITIES FOR 60 PEOPLE, AND EATING AND MEETING\nSPACE FOR ALL. OVERFLOW HOTEL ACCOMMODATIONS ARE BEING ARRANGED AT MAJOR MINNEAPOLIS\nDOWNTOWN HOTELS.\nPLAN TO ATTEND THE 19£2 CONVENTION"
}