{
  "id": "d1723-2",
  "text": "NAE8 NEVUS LETTER\nPage 3\nDecember 15, 1941\n(2) General Philipson announces no curtailmen or military\nLEAVES AND FURLOUGHS.\n(3) Navy recruiting announcements, Army Air Corps announce¬\nments and Marine recruiting announcements.\n(4) Special announcement fro Colonel McDermott re selective\nservice inductees and their elegibility for enlistment\nIN THE v'ARMED FORCES© j\n(5) Special announcement from Markets Commissioner Will(a^/m\nFellowes Morgan, Jr. warning against food hoarding©\n(6) Air raio wardens and Fire Department Auxiliary Corps\nMEMBERS TO KEEP IN TOUCH WITH TELEPHONES FOR ANNOUNCE¬\nMENTS OF SPECIAL DRILLS.\nAgain acted as clearing house for these announcements, calling them\nTO OTHER RADIO STATIONS THROUGHOUT THE CITY TO ASSURE COMPLETE COVERAGE©\nFLY COMMENTS ON RADIO CENSORSHIP\nChairman James Lawrence Fly of the Federal Communioations Commission\nTOLD HIS PRESS CONFERENCE ON DECEMBER 15 WITHER THE COMMISSION NOR\nthe Defense Communications Board was concerned with censorship of\nRADIO AND PRESS SERVICES. FLY SAID IF THERE WAS ANY CENSORSHIP, ST\nWOULD BE BY SOME OTHER AGENCY OF THE GOVERNMENT.\nYOU CAN'T DO BUSINESS WITH HITLER\nHOW WELL WE KNOW THATS The FOLLOWING LETTER REGARDI NG THE RADIO\nSERIES OF THIS TITLE IS FROM PR/WK K, TELFORD, RADIO SECTION, OFFICE\nof Emergency Managements\n“You Can't Do Business with Hitler,” is a transcription series,\nWRITTEN AND PRODUCED BY THIS OFFICE. We EXPECTED TO RELEASE ST\nTO ALL LOCAL STATION REQUESTING IT WITHIN THE NEXT FEW WEEKS.\n,,the Axis' declaration of war, however, has necessitated certain\nREADJUSTMENTS RELATING TO THIS SERIES. OUR RELEASE DATE HAS BEEN\nSET INDEFINITELY FORWARD.\n“WE APPRECIATE YOUR INTEREST AND IF AND WHEN THIS SERIES IS RELEASED\nWE SHALL NOTIFY YOU©15\nDOPE ON NEW YORK FM STATIONS — NOV8K, WNYC, SPEAKING:\ntt^HE DISMISSAL OF THE PETITION FOR REHEARING AND OTHER RELIEF DIRECTED\nagainst us by Station WDRC in Harford was to get us to change the\nORIGINAL GRANT BY THE F.C.C. OF 43.5 MEGACYCLES TO 43.9 MEGACYCLES.\nThe F.C.C. then issued us a modified construction permit to permit us\nTO ERECT A NEW FM STATION, VV39MY, HTER IN NEW YORK IN THE COMMERCIAL\nBAND.\nIn the non-commercial band, $NYE IS NOW' in the process of constructing"
}