{
  "id": "d1723-9",
  "text": "-10.\nEDUCATIONAL TV PROBLEMS EXAMINED BY U. OF KENTUCKY COMMITTEE\nA review of the future of educational television possibilities, and specifically of\nthe future of television at the University of Kentucky is .given in a recent report.\nThe lengthy report was compiled by an eight-man committee appointed by the University\nof Kentucky’s president. Dr. H. L. Donovan.\nGrowth of the institution’s radio service, with the helpful cooperation of WHAS,\nLouisville, was traced from the first broadcast, April 1, 19h9> to the present. The\nuniversity now, in the course of a year, serves virtually every Kentucky radio station\nthe report said.\nThe report recognizes that the University of Kentucky is not now in a position to fin¬\nance the cost of .necessary television facilities. Nor is it likely to be in the fore¬\nseeable future, it was added.\nOpinion on lave Telecasts\nIn the committee’s opinion, bans against live telecasts of athletic events cannot long\nbe maintained. As a guide to future policies, the committee recommended that if the\nSoutheastern Conference and the National Collegiate Athletic Association permit live\ntelecasts of football and basketball games, the Board of Trustees authorize acceptance\nof bids from television stations for the privilege of telecasting these games.\nScanning video developments in colleges and universities, the report reviewed efforts\nof institutions of higher learning to get TV stations on the air. Specific cases were\nnoted of the U. of Illinois and Michigan State College, both of which reportedly hhve\napplied for permits to construct their own station.\nFunds for the U. of Illinois station are to be obtained from a university appropria* *\ntion plus a special grant. This station is to operated entirely on a non-commercial\nbasis.\nWAVE-TV Offers Services to University\nNathan Lord, general manager, WAVE-TV Louisville, made several proposals, among them\nthat WAVE Inc. would apply with the FCC for a license to operate a UHF television\nstation at Lexington, home of the University of Kentucky.\nIn its report, however, the committee recommended that the WAVE proposals not be\naccepted because, among other reasons, it would lay the university, a state-supported\ninstitution, open to severe criticism for aligning itself with a particular station on\nan exclusive basis.\nSCHOOL FM FUNDS .\nTo provide practical training for students in radio and television at Edison Technical\nSchool, the Seattle Public School Board has authorized a budget of $10,000 for the\nfirst year’s operation of an FM station. The funds would cover equipment and person¬\nnel. An application has not been filed with FCC, school officials said, and it is ex¬\npected that the next* few months will be devoted to getting ready for the broadcast\noperation, including the purchase of used equipment.\n* * x * # -x- ### ********************************\nTHE JOINT COMMITTEE ON EDUCATIONAL TELEVISION WILL HOLD ITS NOVEMBER MEETING\nIN MINNEAPOLIS IN CONNECTION TOTH NAEB CONVENTIONS"
}