{
  "id": "d1869-0",
  "text": "■\nN\nA\nE\nb\\\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. XXV NO. 11 NOVEMBER 1960\nConvention Highlights\nFollowing are some of the decisions coming out of\nthe NAEB convention October 18-21 at San Fran¬\ncisco’s Jack Tar Hotel.\n• Richard Hull, director of radio and TV broad¬\ncasting at Ohio State University, was named Region\nIII TV Director and also Chairman of the Board of\nthe NAEB. In both positions he replaces William\nHarley, who became NAEB President on November 1.\n• Philadelphia was selected as the convention site\nfor 1962. Bids were submitted on behalf of Pittsburgh\n(later withdrawn in favor of Philadelphia), Wash¬\nington, and New York City.\n• Regarding the proposed transfer of the NAEB\nRadio Network to the NETRC, the membership di¬\nrected the NAEB Board to continue negotiations\nwith the NETRC Board. For the foreseeable future,\ntherefore, the network will continue to chart its own\ncourse, along the lines of better and more programing.\n• A resolution was passed honoring Miss Frieda\nHennock:\n“Whereas the late Frieda Hennock gave unstintingly\nof her time, effort and ability to promote the estab¬\nlishment and use of educational television and where¬\nas without her efforts, in conjunction with those of\nothers, it is doubtful that either the present number\nof stations would exist or the strength of the educa¬\ntional movement would be as great as it now is;\nNow therefore be it resolved that the NAEB hereby\nrecognizes and gratefully acknowledges its debt to\nher . . .”\n• Another resolution recognized the outstanding\ncontributions to educational broadcasting by the Fund\nfor Adult Education. The FAE will discontinue op¬\nerations within the next few months.\n• A plaque was presented to Dr. Harry J. Skornia\nin recognition of his outstanding service to educational\nbroadcasting and to the NAEB as Executive Director\nand President for the years 1953-1960.\n• The Board of Directors voted to increase dues of\nNAEB Individual members from $7.50 to $10 a\nO year, to take effect July 1, 1961.\n• There were 370 people who officially registered\nat the convention; 330 attended the NAEB banquet.\nWashington to Be 1961 Convention Site?\nNAEBers in Milwaukee, slated to host the 1961\nNAEB convention, have indicated that they would\nprefer to postpone having the convention there, be¬\ncause of personnel changes. Many people attending\nthe San Francisco convention expressed a desire to\nhave the next one in Washington, D. C., in view\nof the new NAEB offices there. Provided that hotel\nspace can be obtained at this date, and that the mem¬\nbership does not object, the Board of Directors and\nstaff hopes to proceed with plans to have the 1961\nconvention in Washington.\nDirectory Changes\nWork will soon begin on the 1961 NAEB directory.\nAny member whose listing is wrong should notify\nMrs. Dorothy Templeton at NAEB Headquarters.\nATTENTION: FM AND TV STATIONS\nFor several years, the directory has carried rated\ntransmitter power for member stations. However,\nsome members have submitted ERP rather than rated\npower, causing considerable confusion. After this was\ndiscussed at the Live Radio Networking seminar this\npast summer, it was decided that both should be listed\nin the next directory. Therefore, will each NAEBer\noperating an FM or TV station please send in a\npostal card indicating both ERP and rated power?\nPlease send to Mrs. Templeton before January 1.\nFile Service No. 7 Study Ready\nNAEBers may obtain copies of File Service topic\nNo. 7 — on the use of vidicon cameras for live broad¬\ncasts — by writing to Headquarters. The questions\nconsidered were listed in the June Newsletter.\nNAEBers to Elect\nWithin the next two weeks, the following will receive\nballots for the Board of Directors election: all In¬\ndividual and Associate members, and Active radio\nmembers in Regions I, III, V, and VI. Deadline\nfor voting will be December 1.\nAlthough the By-Laws call for election this year\nof TV Regional Directors in Regions II, IV, and\n1"
}