{
  "id": "d1424-1",
  "text": "- 2 -\naccrue from the operation of Station WGST, and receives as compensation for\nits service to the licensee 90 percent of the gross receipts. Another condi¬\ntion of this contract stipulates that _____ ___\nstation for two hours each week to broadcast any mST\nSeSouffi^n^ff^^asTers^5’\"1 TncT,' is designated as an operating agency working\nunder the direction of the President of the Georgia School of Technology, Dr.\nI Brittain. Dr. Brittain has the right to approve and/or disapprove any pro-\nfgram or programs proposed to be broadcast by the operating agency. The\nI policies of the station remain under his control by the terms of the contract.\nThe financial statement offered in evidence indicates the profit\naccruing to the licensee from the operation of this station from January 1,\n1935 to September 3, 1935, amounts to $6,625.46, and the profit accruing to\nthe operating agency during this same period amounts to $20,968.29. The\noperating agency is amply able to finance any improvements or changes con¬\ntemplated in the instant application.\nThe applicant is affiliated with the Columbia Broadcast System and\nreceives a major part of its programs from that source. A typical program of\nthis station was offered in evidence as an exhibit. The programs appear to\nbe well balanced, entertaining and enlightening. A reasonable amount of time\nis devoted to educational, religious, charitable and civic broadcasts. Several\nnews broadcasts are given daily covering local, national and international\nmatters.\nAccording to the 1930 census the City of Atlanta had a population\nof 270,366, and the metropolitan area of Atlanta had a population of 370,920.\nIncluded in this metropolitan area are several smaller cities which are within\na radius of six or seven miles. There are two other broadcast stations located\nin Atlanta; namely, WSB, a 50 kilowatt station, and WJTL, (changed since the\ndate of the hearing to WATL), a 100 watt station. Other radio service is\navailable at night from distant clear channel stations.\nThe record discloses that the service area of the applicant station\nis curtailed because of interference from Station XEW, Mexico Gity, Mexico,\nwhich operates on the same frequency as the applicant station. Engineering\ntestimony and other evidence indicates the service area of the applicant sta¬\ntion is limited at night by said interference to a radius of approximately\nthree or four miles from its transmitter, which does not permit service to\nthe entire metropolitan ar^a of Atlanta. It would appear that if the addi¬\ntional pow^r requested is given the interference would be overcome sufficiently\nfor the applicant to serve all of the metropolitan area of the City of Atlanta.\nIt appears that a substantial noed exists for the additional service proposed.\nIf this application is granted some interference may be expected\nwith the following stations, all operating on 890 kc: Station KARK, Little\nRock, Arkansas, which operates with power of 250 watts night and 500 watts\nlocal sunset, and is 450 miles distant from Atlanta; Station KFNF, Shenandoah,"
}