{
  "id": "d1150-1",
  "text": "NAEB NEWS LETTER* , • • 00T 1, 1940.. .-.Page 2\nWOI is also broadcasting many of the Iowa State football games this\nf&llo On games except the two night ones are being broadcast* KFI\nrefused to give consent for simultaneous broadcast of the night games*\nKENTUCKY PROPER AMS ON MUTUAL\nSix \"school of the air\" programs, to be carried each week by the\nooast-to-ooast network of the Mutual Broadcasting System, and origin¬\nating in the studios of the University of Kentucky, Lexington, will\nbe started immediately upon the conclusion of the World Series*\nDiffering from many other \"schools of the air/ the University of\nKentucky offerings will stress showmanship and entertainment values\nin a decided appeal to the adult as well as to the classroom listener*\nAll of the Mutual 51 school of the air\" programs will be heard during\nthe 2s3Q to 3s00 p0m, EST period*\nOn Tuesdays, two programs will be presented during this period, the\nfirst Entitled *hywns and their Stories/ to deal with the background\nof well-known saored compositions, and the second, \"Let1© talk abmt\nthe weather/ to feature dramatizations on the backgrounds of weather\nforecasting, with music by the U,K, staff orchestra,\nWednesdays from 2s45 to 3?00 p*m* EST. talks by specialists on ’’The\npursuit of recreation18 will be presented during September and October,\nand similar talks called \"Chemical interludes*3 will be heard during\nNovember and December,\nThursdays will feature two unusual types of educational broadcasts*\nBetween 2z30 and 2i45 p.m. \"The music of George Gershwin/ consti¬\ntutin'': a dramatized story of that famous American composer* s life ,\nand performances of his outstanding compositions will be heard. Close\ncollaboration with George’s brother Ira, has resulted in a high, degree\nof authenticity for the scripts. Through the cooperation of ASCA?,\nthe bars have been lowered to permit performances of these Gershwin\ncompositions usually set aside with a positive \"no\" from broadcasting*\nThe other Thursday pregrain, \"Recent American Short Stories/ are fifteen\nminute \"high-light dramatizations\" of the best up-to-the-minute works\nin American literature, Sorf>>ts for this series have been designed\nby Greer Johnson, rising young Bluegre.ss writer* Again the close\ncooperation of authorities has been called in for the eerie a 3 with\nthe result that the series of programs has the working endorsement\nof America* s leading writers,\nFriday* e Mutual \"school of the air\" program is a fifteen-minute\nmusical program of light classics, \"Concert miniatures,\" scheduler,\nfor 3:45 to 3:00 p,m,\"EST* Dr* Alexander Capurso, executive director\nof the University of Kentucky department of Music will conduct the\npresentation,\nEDUCATIONAL PROGRAMS FROM WILL\nThe fifteenth year of regular radio broadcasts by the University of\nIllinois is bringing classroom sessions from 11 university courses\ninto the homes of education—minded listeners of Illinois and Indiana*"
}