{
  "id": "d1150-2",
  "text": "NAE3 NEWS LETTER....OOT. 1, 1940,,,.Page 3\nThe University'1 a radio station, WILL, 580 kilocycles, has just\nannounced the schedule of classroom broadcasts and October-November\nprograms.\nClassrooms1 broadcasts incluse?\n8 a.m. MWF, Recent European History, Prof< a. H, Lybyer»\n8 a.m. Tue.,Coloration finance. Prof, Paul M. Green,,\n8 a.m. Thur. , Economics of Transportation„ Prof, D. P. Loeklin,\n9 a.m. MWF, Educational Psychology, Dr. Glenn M. Blair,\n10 a.m. MWF, The Civil War and Reconstruction, Prof, F„ A. Shannon,\n11 aem8 MWF, Principles of Sociology. Dr, E. J. Hulett.\n11 a,m« TT, Great Novelists of the Nineteenth Century, Prof9 Ernest\nBernbaum.\n2 p,m. Mon,, Eoonoraic Systems, Prof, Ralph Blodgett,\n2 p,m. Wed,, Personnel Administration, Prof, W. C, Robb,\n2 p0m, Frl. , Labor Problems, Prof, E. B, MoNatt.\n2 p.m. TT, Insectss Their Importance to Man, Prof, W, V, Balduf,\nWILL, the only educational, publicly-owned radio station in Illinois,\naccepts no advertising programs. The station is heard through modern\nradio receivers in practically all parts of Illinois and adjoining\nareas of nearb3* states,\nIllinois football games, at home and away,, will be broadcast on\nSaturday afternoons by WILL. It is the only radio station presenting\nall games of the Illini.\nNYA SINFONIETTA OH WNYC\nA new series of classical music programs entitled “NYA Sinfonietta\"\nwas inaugurated September 15th on WNYC. The Sinfonietta, comprising\nSC members, will alternate with the National Youth Administration\nSymphony Orchestra in Sunday concerts, ancl is under the direction of\nWilliam Strickland.\nKWLC RULES AGAINST\nThe Federal Communications Commission on September 25 announced its\nProposed' Findings of Fact and Conclusions proposing to GRANT the\napplication of the Mason City Globe Gazette Company, (Station KGLO),\nMason City, Iowa, for a construction permit to change frequency from\n1210 to 1270 kilocycles; increase power from 100 watts night, 250\nwatts local sunset, to 1 kilowatt, unlimited time, (the facilities of\nKGCA and KWLC), and install new equipment including a directional\nantenna for nighttime operation* The application of Charles Walter\nGreenley for renewal of license of KGCA, Deoorah, Iowa, was denied\nas in default, and the application for renewal of license of Luther\nCollege {KWLC), Decorah, to use the frequency 1270 kilocycles was\nalso denied* However, this finding will not prejudice consideration\nof an application by Luther College for authority to operate station\nKWLC upon another frequency.\nIn it6 findings of fact the Commission concludess\n1. The Mason City Globe Gazette Company.....if financially qualified\nto install the proposed new equipment for which a permit is requested."
}