{
  "id": "d1150-4",
  "text": "MSB NEWS LETTER,..,OCT. lf 1940..,.Pag© 5\nfrom 41,500 kilocycles frequency, 500 watte power night and day, A3\nemission, to 42,500 kilocycles and increasing day and night power to\n1000 watts for FM transmission.\nExtensive use has been made of the facilities of WBGE in serving 156\nreceivers in the Cleveland school system. The Board of Education\nstates that the objective to be attained with FM is higher fidelity\nand less noise in classroom instruction and public education.\nIn August the Commission authorised the San Francisco Board of Education\nto use FM for like service in that area. The Hew York City Board of\nEducation &ae been using amplitude modulated noncommercial educational\nbroadcasts for some time, and the University of Kentucky was mores recent¬\nly licensed to give similar service to local mountain schools,\nDON’T OVERLOOK PACKET MATERIALS\nUnder separate cover literature in the field of educational radio has\nbeen mailed the HAEB members. Some, or all. of the material you\nreceived is listed below. In case you didn’t receive your copy, it\nwas because HAEB was limited. An many cases it will be worthwhile\nfor you to write direct for the literature,\nWNYC - The Mastexwork Bulletin, September and October, 1940.\nWHA «** Wisconsin College of the Air, 1940-1941 Course Outlines.\nKOAC - Music for October, \"ovember, and December, 1940.\nKWSC - Farm and Horae Programs.\nKWSC - School of the Air, First Semester, 1940-41.\n170SU - School of the Air. *\nKOAC - School of the Air, 1940-41 Teachers Broadcast Guide.\nW3UX - Conference on Applied Radio,\n’TSUI - The University oh the Air.\nWHA - Wisconsin School of the Air.\nWHA - This Our Democracy.\nChicago Radio Council - Fourth School Broadcast Conference Program.\nUniversity of Kentucky « Program Announcements.\nU. S. Office of Education - Programs Produced During 1940.\nNational Foundation for Education in American Citizenship Proposal.\nRocky Mountain Radio Council Report.\nFederal Radio Education Committee - Small Station Cooperation.\nFederal Radio Education Committee - College Radio Courses.\nWILL - Professor Rodkey Radio Series Proposal.\nFCC ACTIONS\nWSUI, University of Iowa’s request fox modification of construction\npermit for new transmitter, directional antenna day and night, to\nincrease power, and move transmitter, further requesting increase in\npower from 1 kilowatt night, 5 kilowatt day to 5 kilowatts day and\nnight, make changes in directional antenna, and extend commencement\n60 days after grant and completion 180 days thereafter, was returned\nby the FCC(9/6/40).\nWRUF, University of Florida, was granted special temporary authority"
}