{
  "id": "d1277-0",
  "text": "HOLLYWOOD NEWS\nBULLETIN FROM\nSCREEN PLAY MAGAZINE MINNEAPOLIS^ MINN.\nPermission is given to use the whole or any portion of this news service in broad¬\ncasts providing credit is given to SCREEN PLAY Magazine. The information con¬\ntained in this bulletin is supplied by a staff of prominent writers in Hollywood and\nis comprised of up-to-the-minute news bits gleaned from our daily wire service.\nWatch for this bulletin weekly! December 6, 1933\nLET'S SEE WHAT’S DOING IN HOLLYWOOD THESE DAYS — One of the latest romances is\nbetween Rose Davies and Mae Murray's divorced Prince Mdivani, David ... Marlene\nDietrich recently turned down a radio offer of $6,500 for each of thirteen broad¬\ncasts. Declares she will, not go on the air at any price ... And a prominent\nsponsor is angling for the services of Mae Clarke with only Metro’s permission yet\nto be obtained before the deal goes through ... Myrna Loy has had the sealing wax\nspilled on a new long term contract with Metro ... That \"Viva Villa\" picture is\nstill giving the studio a headache. Roscoe Karns was no sooner set for the part\nvacated by Lee Tracy than he was yanked out again and Stuart Erwin put in ... Bing\nCrosby shot his first 74 at the Lakeside course this week ... The appendicitis\npatients, Joan Blondell and Maureen O'Sullivan, are reported continuing their im¬\nprovement ... Incidentally, Joan's illness will prevent her playing in \"Heir.\nChaser\" with Jimmy Cagney, and her pretty brunette sister, Gloria Blondell, is\nslated for the part, which is a break for Gloria, as she has been trying to crash\npictures for some time.\nIDA LUPINO, the English platinum blonde who has come to Hollywood as a star, gives\nher ideas on what it takes to be one. \"You've got to be nice and naughty to make\nthem like you in this day, \" she tells SCREEN PLAY in a special story.\nCAMERAS WAITED ON A PLUMBER'S SKILL when Bob Woolsey accidentally dropped his bridge-\nwork down a drain on one of the Radio sound stages ... Plastic surgery eliminated\nany trace of scars on Lyle Talbot's forehead after he was cut up in that motor\ncrash ... That rosepoint lace gown Marlene Dietrich wears as Catherine the Great\nwas made for Russia's last Czarina in 1914 ... and it’s insured for $10,000 ...\nClara Bow appeared at the Colony Club in a bright green dress with long orange\ngloves. Sure nuff.' ... And Adolphe Menjou inadvertently dropped.a fashion hint for\nthe men when he reported to the police that a thief had robbed his car of.a package\ncontaining a London-made purple shirt with matching tie ... Dorothy Gish is enjoy¬\ning her first hair bob.\nHOLLYWOOD IS LIKE THaT ... An extra girl named Peanut Baker had been getting a\nlittle work around the studios now and then, but never got a chance to say a word\nuntil the other day during the shooting of \"Free, White and Desperate.\" She hu.d\none line, and Director Richard Boleslavsky liked the way she spoke it, so he put in\na few more for her — and, of course, boosted her pay check at the end of the\nsession* She took the money home — more than she had seen in a long, long time,\nand hid it in a bureau drawer while she went out to celebrate with a few chocolate\nsodcas. When she got back she found the room ransacked and the money gone. When\nthe sad tale got back to Bob Montgomery and Madge Evans, leads in the cast, they\ngot busy and took up a collection, which netted Peanut about $50.\nIN a SPECIAL STORY, Sidney Skolsky, the Broadway columnist who is now news sleuth¬\ning in Hollywood, tells SCREEN PL*.Y readers that Mao West s favorite dish is\nkippered herring, that her hair isn't as blonde as it appears, that she spends much"
}