{
  "id": "d1618-1",
  "text": "Reduction of Public Expenditures 2,.\nThe continued existence of n demdotatic society depends upon the nnintonance\nof those educational, cultural and social institutions -vi/hioh have ‘been created to\npromote general education and I'diolesomo living. The service of such institutions\nmust not be destroyed.\nThe need for economy is recognized. In many cities, counties and states the\nunit cost of governmental services can and should be reduced^ All taxing units\nshould be required to live mthin their incomes except for permanent improvements\nand emergencies,\nA wholesale horizontal cut applying to all departments and activities is one\nof the least desirable ways of reducing, for it cannot be assumed that all depart¬\nments are equally efficient and all activities equally important^ Before reductions\nare made there should be a study by disinterested specialists and citizens to deter¬\nmine (l) what cuts can bo made without limiting important services, and (2) the\nrelative importance to the public of the various activities, Wo vd.ll welcome such\ninvestigation of the institutions and activities we represent.\nWe pledge our cooT'Oration to forward-looking public administrators in their\nefforts to find permanent solutions for the tcjcpayers* problems, through the com¬\nplete elimination of the spoils or patronage system in all govornnental activities\nwhere it exists; through the improvement of the personnel; through the reorganiza¬\ntion of areas and functions of government; and through improved methods of taxation.\nThe elimination of waste should precede any curtailment of socially useful services.\nIncreased Demand for Library Service\nLibraries were created by our democratic society in order that every citizen\nmight have throughout life the means of self-oducation.\nMore people used libraries, more books wero borroaved from libraries and more\nbooks were used in library reading rooms in 1932 than ever before. Sample reports\nfrom 33 cities representing only one-tenth of the total population of the United\nStates show that the number of books borrowed from their libraries in 1932 was\n81,663,423, an increase of 37^ since 1929,\nEconomic and social insecurity has led men and women to attempt to understand\nthrough reading the fundamental ojid current problems -vdiich confront them as citizens.\nBooks on the business of earning a living *^.ro in groat demand. So also are the books\nof many kinds which contribute to the maintenance of a spirit of hope.\nLibrary expenditures are a small part of tho public budget. With few exceptions\nlibraries have been operated without extravagance, mth an intelligent regard to the\npublic interest and the tax-payer*s burden. It 4« ne^rertheless the duty of library\nadministrators to re-evaluate the library*s services in terms of present conditions,\nto distinguish sharply between essentials and non-essentials, and to seek new ways\nof carrying on tho most necessary activities at the lo'^ivest possible cost.\nLibraries are more needed today than over before. There is much to learn which\nwas not taught when the present-day adult was at school. Never wq.s the average adult\ndriven to the printed page and to the library so repeatedly in order to become\nreasonp.bly well informed about matters which arc of vital concern to him. In the\ninterest of an intolligent, understanding citizenship the library*s essential service,\nmust be maintained."
}