{
  "id": "d337-0",
  "text": "Confidential\nM E M 0 R A N D IT M\nKAEB Adult Education Project: Radio Series, U.S.S.R.\nDecember 7, 1951\nTO:\nFROM:\nConsultants, Research-Specialists, Radio Personnel\nC, Dale Fuller (410 Riverside Dr., Apt, 141, NYC 25)\nSUBJECT: Progress report on the U.S.S.R. Series\n. . lm Jesearch memoranda are being submitted faster than they can be transformed\nsc*ipts* Jhis ls a h&ppy state of affairs from my point of view and does\nnot deter me from urging memo-writers who have not yet sent their research to me to\nas possibl- need to have in handball the materiSs now «in pre-\nparation before we can successfully block out the additional subject matter areas\nfor which we must seek programs. The great number of memos received this oast wepk\nr^ivedf “ ^ ^ 20 mIfflaa fflasoto seve^ w^IfterU\nMemoranda received to date deal with the following subjects: the Soviet\nfamily, class structure, medicine, children’s theaters, policy in the Far East\"\nareas/labor’cSps!17 ^ i)eraonality types in the U.S.S.R., life in satellite\nMemoranda contracted for and not yet received will consider: the Politburo\nbehavior pfcitizens when Soviet power is removed, Communism in the United States! '\n1 + g?pf.which must be filled fcy additional materials include: agri-\nliterature?VJ*6t milit&ry strength> sacret police, government structure, music and\n™ ^ Chlf f£0T: 1v NeW York at present is directed toward getting the first\nshow on tape. We hope to have the script completed by December 15, approved (or\nrif by “er ^ the ^w™SVon January\n3. Whenever possible, scripts will attempt to portray in dramatic form what\ngoes on deep within the heart end nind of the individual livLg^er thHo^ist\nsystem. Data on the politics, economics and policies of tb. S l «\n** such facts as are presented should toCe rSi raihe?\nthan theoretical significance for the listener.\nFAri i n4p,i!!q 4 Iff 3rab0Ut the use of the Programs have already been received from\ntbe Isr\"811 “d tokiSh and\ntion6S wS: Iflt-*;' « i?1 Au^ust for the trustees of the Ford pLda-\ntion. The other is the text of Professor Fisher’s talk, entitled \"Hearing is\nBelieving, given in November to the members of the NAEB. Also, I should^ike to"
}