{
  "id": "d337-11",
  "text": "FROM: RADIO STATION WXXX (RELEASE #1)\nADDRESS\nPHONE\nFOR RELEASE: (DATE)\nRUSSIAN ANTI-CZAR REVOLT\nLED TO SOVIETS, SAYS NAEB\nThe origins of Bolshevism will be discussed by Professor Merle Fainsod of the\nRussian Research Center at Harvard University in a spirited half-hour talk,\n\"The Russian Revolutionary Movement and the Rise of Bolshevism\".\nThe talk will be the first of several analyzing various phases of the Russian\nsituation compiled to follow the dramatic presentations which made up the\nfirst broadcasts in the distinguished series, \"People Under Communism\",\nan Adult Education Project of the National Association of Educational Broad¬\ncasters.\nRadio listeners in this area will have an opportunity to hear this discussion\non the Russian Revolutionary movement over Station WXXX at - - {time) --\non -- (date) —.\nProfessor Fainsod, who was one of the noted consultants in the compilation\nof material for the entire \"People Under Communism\" series, is one of the\nnations leading authorities on Russia. He has explained that to understand\nthe rise of Bolshevism, it is necessary to know the background out of which\nit emerged. It is essential to understand the long tradition of protest, of\nrevolution and of dreams of freedom on which the Russian revolutionary\nmovement was nurtured.\nBeginning with the Decembrist revolt in 1825, at the time of the death of\nEmper.iT Alexander I, and the accession of Nicholas I, Professor Fainsod\ntraces the efforts of the liberal-thinking Russians to modernize the trend of\ntheir government, only to bring down upon the suffering and poverty-stricken\nRussian masses even greater repression than before.\nThe climax, as Professor Fainsod shows, came in the revolutions of 1917,\nwhich swept into power Lenin and his Bolsheviks. Once power was seized,\nthe Bolsheviks marched inexorable toward the consolidation of dictatorship.\nThe dream of freedom, which had moved successive generations to struggle\nagainst Czarist autocracy, ended in the new prison-house of Soviet totalitar¬\nianism.\nsje sjc sje 3 Q * * *"
}