{
  "id": "d337-15",
  "text": "FROM: RADIO STATION WXXX (RELEASE #5)\nADDRESS\nPHONE\nFOR RELEASE: (DATE)\nEDUCATIONAL RADIO ADDRESS UNMASKS\nSOVIET ATTACK ON \"VOICE OF AMERICA\"\nOne of the major resources of the United States' arsenal in the post-World-\nWar-II propaganda struggle with the Soviet Union has been the Voice of\nAmerica, our State Department's periodic radio broadcast beamed to Russia\ndesigned to give an accurate picture of life in this country. Recognizing\nthe importance of these broadcasts, the U.S.S.R. has marked the Voice\nof America out for constant attack.\nThe entire technique of the Russian regime to combat our broadcasts through\nattempted refutations in all media of Soviet government controlled mass\ncommunications is blisteringly exposed by Alex Inkeles of the Russian Research\nCenter at Harvard University in \"The Soviet Attack on the Voice of America\",\nthe latest in the notable series, \"People Under Communism\", produced by\nthe National Association of Educational Broadcasters.\nRadio listeners may hear this no-holds-barred expose of Russian attacks on\nthe Voice of America when it is broadcast over radio station WXXX at --\n(time| -- on -- (date)\nIn particular, Professor Inkeles will show Soviet propaganda has sought to\ncreate an image of the Voice of America in the minds of its potential audience\ndesigned to discredit it as a source of information, and thereby to produce a\nbuffer against the impact of its message.\nThe central theme in the Soviet characterization of the Voice of America, de¬\nfines it as the paid instrument of . . and servant of . . Wall Street. Soviet\ncommunications directly suggest that every informed person knows that behind\nthe United States government stands the power of what the Russians call\n\"monopoly capital\" and that the American government is simply a tool of\nthat power.\nAccused of being the Voice of Wall Street, the Voice of America is attacked by\nthe Soviets as not the \"true\" voice of America. The radio voice of America,\nsay the Soviet propagandists, \"thunders and slanders, mounting attack against\npeace.\" The genuine voice of America, according to the U.S.S.R. commen¬\ntators, is heard when Paul Robeson, the baritone, sings \"Polyushko\", and when\n\"simple people come to Madison Square Garden to greet the delegates of Russia.\n30 $***"
}