{
  "id": "d337-16",
  "text": "*\nFROM: RADIO STATION WXXX\nADDRESS\nPHONE\n(RELEASE #6)\nFOR RELEASE: (DATE)\nRADIO LISTENERS WILL HEAR\nSOVIET \"LETTERS TO THE EDITOR\"\nTrue self-criticism no longer exists in the Soviet Union, and has long been\nforbidden. Because, however, it serves the interests of the Communist\nParty leaders, a significant amount of popular Criticism of defects in the\nfunctioning of Soviet institutions and personnel at the local level is permitted\nby the Party. The main channel provided for expression of this criticism\n\"from below\" is in the critical letters to the editors of the Soviet Press.\nAlex Inkeles, of the Russian Research Center at Harvard University, explains\nthe nature of these critical letters to the editor, explains just how far they\ncan go and analyzes their effectiveness and lack of effectiveness in \"Letters\nto the Editor: Soviet Style\", a new broadcast in the National Association of\nEducational Broadcasters distinguished series, People Under Communism,\nan Adult Education Project.\nRadio listeners will hear this broadcast, with its many samples of typical\nRussian \"letters to the editor\" over Radio Station WXXX on -- (date) -- at\n- - (time) - -.\nMore than most other recourses available to the Soviet citizen, letters to the\neditor frequently get action. For almost all Soviet newspapers regularly\nprint at the bottom of their Letters to the Editor columns, brief items re¬\nporting what official action has been taken on previously printed letters.\nSometimes punishment of officials results from the publishing of these letters.\nThe most important limitation on the letter-writing system, however, is that\nthe citizen writing the letter automatically exposes himself to potential poli¬\ntical scrutiny in a society in which political misunderstanding can have serious\nconsequences. Yet, the Soviet pattern of handling letters to newspapers is an\nimportant example of the efforts made by the Communist Party to create an\n®®ion of mass participation in the work of social control -- within the\nnarrow limits set by the Party itself.\nBecause of the restrictions on the letters and their subject matter, the men\nin the Kremlin tend to become prisoners of their own system. They are told\nonly what their subordinates know those men want to be told.\n* * * * 30 * * * *"
}