{
  "id": "d337-18",
  "text": "FROM: THE NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n2500 Municipal Building New York 7, N. Y.\nFOR RELEASE; DECEMBER 6th\nNAEB SERIES WEIGHS\nRUSSIAN POWDER KEG\nA new radio' series, as up-to-date as today's headlines, because it will\ndeal with the cause of the world's most explosive headlines today\nRus sia --is about to be presented as an Adult Education Project of the\nNational Association of Educational Broadcasters. The first of the series\nwill be released on December 7th. The new presentation will bear the\nseries title of \"People Under Communism\".\nBecause Russia has become the international menace that it is, and a\ncorrect estimate of Soviet power and intentions may be a matter of life\nor death in the next ten years, the NAEB believes that a series like that\nnow projected will help the public to become well-informed and alert.\nThe programs have been made possible under a $300,000 grant from the\nFund for Adult Education established by the Ford Foundation.\nAs the discussions and dramatizations unfold, radio listeners will learn\nwith stark reality of the iron grip that the Soviets have put upon art,\nliterature, drama and music -- intellectual pursuits which in the Western\nworld are characterized by freedom.\nThere will be seven one-hour shows, and thirteen half-hour lectures,\nfollowed by a half-hour documentary.\nThe horror of the Soviet Secret Police in action will be the message of\nthe first of the Russian broadcast studies -- \"Terror As A System of\nPower\" -- based on materials furnished by Dr. Merle Fain sod of the\nRussian Research Center of Harvard University, one of five consultants\nfor the Russian series. Other topics will cover the engineer in Soviet\nSociety, preventive repression and the efforts of the Communists to\ncapture Asia and convert it into a totalitarian dictatorship.\n\"With every session of the United Nations, with every move made on the\ninternational checker-board in virtually every part of the world, we\nrealize that for our own protection we should find out all we can about\nRussia -- its strengths -- and its weaknesses -- the significance of its\nforeign policy, \" Graydon Ausmus, president of NAEB said, in discussing\nthe new series. \"We feel that these programs are very timely and that\nAmerican radio listeners cannot well afford to miss them.\"\nIn addition to Dr. Fainsod, four other noted authorities on Russia served\nas consultants for \"People Under Communism\" presentations. They were\nAlex Inkeles of the Russian Research Center, Harvard University; Harold\nH. Fisher of the Hoover Institute and Library, Stanford University;\nPhilip E. Mosely, Russian Institute, Columbia University and Ernest J.\nSimmons, Russian Institute, Columbia University.\nMember stations of the NAEB Tape Network, a cooperative organization\ndevoted to the dissemination of outstanding radio programs, will broad¬\ncast the Russian series, but the recordings will be made available to\nUnited Nations Radio, the British Broadcasting Corporation, the Voice\nof America, the Australian Broadcasting Commission and All-India Radio,\nThe series will also be made available to commercial station operators\non a sustaining basis.\nIn spite of Soviet efforts to keep its vital statistics and secrets securely\nlocked behind the \"Iron Curtain\", resources for interpreting the USSR\nare fairly extensive, and the NAEB and its project consultants have made\nliberal use of many of them. Much of the program material comes from\nRussian emigres who, in spite of the difficulties in getting out of Russia,\nhave succeeded in escaping.\n**** 30 * * * *"
}