{
  "id": "d337-20",
  "text": "* ft\nPOLICY AMD OPERATIONAL MEMORANDUM STATEMENT BY THE SPECIAL\nCOMMITTEE OF FIVE W THE LOVJELUMA.EB RADIO ADULT EDUCATION\nPROJECT IN REFERENCE TO THE PROGRAM . SERIES ON INTBEMATIOML\nUNDERSTANDING, PRESENTING EDUCATIONAL PROGRAMS OH THE U.S.3.R.\nlo There are attached as appendicesjth© folloj^ng^tatenientst\nA* Copy of letter from Mr. Fletcher to Ralph Lowell making the grant.\nBo Copy of letter from Mr. Fletcher to the members of the Special Committee,\nC« The statement of program development plan as approved by the Board of\nDirectors of the Fund for Adult Education of the Ford Foundation on\nApril 5? 1951*\nD. Chief preliminary statement by Philip Mosely outlining proposed series\nof '£>he U.S.S.R.\nE* Memorandum reporting Harvard program conference on projected education¬\nal radio programs on Russia, dated July 24, 1951*\nII. STATEMENT OF POLICY, OPERATIONAL PRINCIPLES. AND PROCEDURES:\nA. POLICY\nThe Special Committee of the MAES, approved officially by the MSB\nand appointed by Mr. Scott Fletcher, President of the Fund for Adult Education,\nis responsible for the execution of this Radio Adult Education project® The\nCommittee has appointed William Harley, Program Coordinator, to serve as the\nexecutive officer in charge of this project and to execute the policies laid\ndown by the Special Committee*\nIn the area of international understanding, one of the four areas of\nprogram development in tills project, the decision has been taken to present\nradio programs informing the American people of the tilings which they should\nknow and which can bs communicated about the U.S.S.R.\nThe Committee makes the following basic assumptions:\n1) It is in the national interest of the American people and the United\nStates government to have as much reliable information as possible\nabout the Russians.\n2) This is an appropriate task to be discharged by educators, and the\nphilosophy of the entire project is educational in its purpose.\nt\n3) Leading American specialists and scholars of Russian life know\nsomething about Russia that is of importance to communicate.\n4) There are differences of opinion among American scholar's on various\naspects of Russian civilisation; these differences should be presented\nwhere they are relevant and important."
}