{
  "id": "d337-22",
  "text": "-3-\nof watering the material down educationally* It is a problem of\npresenting the message for what it is intrinsically, as simply and\nas appealingly as possible, without jeopardising the significance\nof what it says * In some instances a program may have a very wide\nand popular appeal and in some it may not®\n4) Factual accuracy and. the integrity of the content come first,\nand tho problem of a program9 s being so-called \"good radio53 is\nsecondary* If the first consideration cannot be met, it should not\nbe produced* This project is experimental in its character, par¬\nticularly in the early stages of the project® It is taken for\ngranted that not every effort will be fruitful. The ideal to be\naimed at is the creation of a program with a content and a radio\nform that has the enthusiastic approval of the consultant, the\nproject director, and the program coordinator*\n5) The Committee hopes, since this is an experimental project con¬\ncerned with a variety of subject matters (thus suitable for various\ntreatments), that a number of different techniques and formats will\nbe represented in the series. Keeping in mind this diversity of\nprogram format, ranging from fifteen minute to one-hour programs,\nand fro® straight talk through drama and documentary, the Committee\nrecommends that the total number of broadcasts to be produced by\nJune 1, 1952 should be somewhere between twenty-six and forty*\nc. steps w nmmijpim peogiams amp scripts\n1) the list of topics worked out in the program conference on July 24\nserves as a general guide in the selection of subjects for the pro¬\ngram series *\n2) The Committee expects that the Project Director, Mr* Dale Fuller,\nwith the help of the five consultants, who are Professors Merle\nFainsod, Harold Fisher, Alex Xnkeles, Philip Mosely, and Ernest\nSimmons, will develop a statement of over-all plan for the whole\nseries of Russian programs* (Attached will be found samples of this\nprocedure as seen in the excellent overall plan drawn up by Walter\nGoldschmidt for the project area \"Ways of Mankind\" and the subsequent\nspecific implementation of this plan with a document reporting a\nproposed series of thirteen scripts arid giving full detail on the\nsubstantive points to be made by each script with a brief descrip¬\ntion of the dramatisation line that will be used to project the\nmessage of the program*) This series is expected to represent a\nlist of those programs which can be done within the following limita¬\ntions of the project:\na) Money.\nb) Availability of materials.\nc) Feasibility of acquiring adequate help from key consultants.\nd) Ease and suitability of translation into radio terms.\ne) Participation of key program personnel as talent.\nf) Relative significance of message to be eomanic&ted.\ng) Potential American public interest in topic.\nh) Limitations of American public9© information."
}