{
  "id": "d337-23",
  "text": "This overall plan .can only fe© laid out 1st the first instance by the\nProject Director. Mo consultant will have the total view of resources\nnecessary to do this. However, the consultants will b® of great value\nin criticising the overall plan and in evaluating the relative im¬\nportance of its parts.\n3) After this overall outline of topics has been drawn up, and con¬\nsultants identified for each topic who have agreed to act as consul¬\ntants in developing the program on the topic-, the Project Director\nwill bring the writer to a first preliminary conference with the con¬\nsultant. The experience of the members of the Special Committee is\nthat there is no substitute for face-to-face contact between the writer\nand the expert. This contact must be made at the very beginning® It\nis impossible for a consultant to play a genuine part in the creative\nprocess if he is not in at the very beginning, because when the export\nis handed a script it is then at a stage where significant structural\nchanges cm no longer easily be md@.\n4) The consultant is the star of the project. Whenever possible,\nidentify topics that represent work which has been of prime interest\nto the consultant and is to be found in his published works. The\nconsultant is most likely to take a genuine, thorough interest in a\nradio program when that radio program is based upon his own work and\nis so identified to the listening public.\n5) Based on discussions with the consultant and reading of materials\nrecommended by Mm, the writer' should prepare a summary statement of\nthe main point© which he proposes to male© in the script {and/or pro¬\ngram) and submit it to consultant for comment and suggestion, and\nwritten approval.\n6) The above statement submitted by the writer must be approved in\nwriting by both the consultant and the Project Director before actual\nwriting of script begins. After it has been approved., the writer\n(in collaboration with the producer) will work up a descriptive state¬\nment of how it is planned to convert the material into a broadcast,\ne.g., dramatic format, documentary, interview, etc. This plan, in'\nturn, must be approved in writing by the consultant’ and Project\nDirector, after which approval the writer should proceed with pre¬\nparation of the first draft of the script® The word 89script\" may\nmean,in any given instance, the script for a dramatic program, a\ndocumentary, an interview, and so cn$ in other words, Mscript” is\nnot t© be construed as applying only to the dramatic format. The\nProject Director should bring the producer into collaboration with\nthe writer and/or consultant at the proper time required by the\nparticular content to be communicated. Furthermore, the Project\nDirector need not necessarily personally participate in each inter¬\nview between writer {and/or producer) and consultant, but may arrange\nsuch interviews and procedures as will expedite the project: for\nexample, he may supervise numerous scripts (and/or programs) in\nvarious stages of development at the same time.\n7) In the process of discussion between consultant and writer, the"
}