{
  "id": "d337-35",
  "text": "-2-\nMr. Inkeles expressed his agreement with all that had so far been\nsaid, and briefly pointed out that he had thought of dividing the subject in\nthree ways: first, the historical aspects; second, the system as a system;\nand third, the everyday life of the Russians« He asked if it would not be\npossible to create a dramatic family, as in our \"soap operas,\" through whom\na history of the collectivization of agriculture could be presented. The\noverall purpose would be to give a more realistic impression of Russian daily\nlife. In the discussion on daily life and culture which followed, Mr. Simmons\nmade the point that the whole problem of ideological controls in the daily\nlife of a Soviet citizen, and particularly with respect to literature, would\nbe worth probing in our programs.\nThe question was raised as to what were the main areas that these\nradio programs ought to try to deal with. Each consultant suggested a list\nof main points. There was a good deal of agreement and common reference to\nitems in these lists. In brief, they were as follows:\nMr. Mosely selected three main themes:\n1) How the Russians achieved industrialization through their own\nefforts—without Point IV or any outside help.\n2) The concept of the Party \"line,\"—its origins, its operation.\n3) The Soviet attitude toward history, and its effect on the problem\nof how the Russians approach the rest of the world.\nMr. Inkeles made a list as follows:\n1) The historical development of Communists in Russia\n2) Soviet ideology\n3) The Communist Party in Russia\n4) The Bolsheviks themselves—their character\n5) The Politburo\n6) Soviet elections\n7) What is the Soviet citizen*s relation to the government at every\npoint in his life?\nB) Class structure in Russia\n9) The industrial life of Russia—the moaning of their work life and\nthe fact that those interviewed seem to report a high work satis¬\nfaction. This is one of the areas in which citizens are left some\nfreedom to express themselves.\n10) Family; church; education.\nMr. Fainsod’s list was:\n1) Historical aspects—development of Bolsheviks.\n2) The Communist Party—show passivity of the citizens by documents.\n3) The factory—manager and labor.\n4) Collective farms.\n5) Nationality—minority groups.\n6) Amy and secret police.\n7) Religion. Consultants: John Curtis of Duke University, Timascheff of\nFordham, Karpovich of Harvard."
}