{
  "id": "d337-37",
  "text": "2. Soviet propaganda and how it operates. Consultant: Inkeles.\na. Illustrations:\nSoviet emphasis upon present unemployment in the U.S.; quotations\nfrom Soviet press and radio, and comments by ex-Soviet citizens.\nU.S. policy towards the Philippines and Soviet treatment of it.\nNehru and \"non-commitment\"; Soviet treatment of developments in\nIndia.\n3. Soviet system of preventive repression. Consultant: Fainsod. Large\nuse of interview material.\na. Who is arrested, and why?\nb. System of investigation and sentencing; interviews with ex-Soviet\n\"repressees.\" Consultant: Ernest Hollis of Columbia, who is doing\na study of secret police.\nc. Economic role of slave labor system; its effects. General discus¬\nsion, fear in regard to responsibility. Consultant: Verzy Gliksman\nof Roosevelt College, author of Tell the West: Bergson; Walter\nGailyson, Association of Former Inmates; documents of Harvard\nCenter.\nd« Spread of slave labor system to satellites. Elinor Lippert,\nDavid Uallin should be brought in to at least one program.\nII. Folitical structure. Consultant: Mosely. Use American experts. {The\njudgment is that the Russian citizen knows nothing about points 1 and 2\nbelow; therefore, interviews would be no good.)\n1. What is the Politburo; its role; important members. Consultants (for\n1 and 2): Mosely, Fainsod, Hazard, Tewster.\n2. Politburo and the economic system.\n3. Nature and role of \"self-criticism\"; illustrations. Interviews.\n4. Soviet elections; nature and meaning* Have citizens discuss.\n5. The local officials and the ordinary citizens. Interviews.\nIII. Economic development. Consultants: David Granick, working under Abram\nBergson of Columbia; Joseph Berliner ard Alex Peskin, assistants to Alex\nPeskin, assistants to Alex Gerschenkror of Harvard; Evsey Domar of Johns\nHopkins.\n1. Resources of the USSR; discussion of nature, range, etc.\nConsultant: Shimkin of Harvard. \"U.S. as a have-not nation compared\nwith Russia.\"\n2. Technology of USSR; its level, prospects for development; original\nfeatures, and copying from West.\nConsultants: Shimkin of Harvard; Smirnov in New York of Standard Oil\nof New Jersey; Naidnov of New York. Get some Soviet engineers.\n3. Advancement in the economic system; channels for rise in status;\nwho runs it. Interview material.\n4. Soviet pattern of industrialisation as an alternative path of develop¬\nment for backward areas.\n5. The postwar economic plans; fulfillment and failures; the Soviet\neconony in 1970; economic competition between West and Soviet."
}