{
  "id": "d337-38",
  "text": "-5-\nDiscussion between American economists. Consultants: Bergson or Ger-\nschenkron.\n6. Economic exploitation of satellites; concrete illustrations. Inter¬\nviews with former Hungarian Minister of Finance, Nyradi; with Ripke\nof Czechoslovakia; with Dodof of Bulgaria.\n7. Soviet standard of living; range of differentiation; standard of\n„ * various levels illustrated; drags on rise of general standard.\nInterview material- Consultants: Bergson, Berliner. See National\nCommittee for Free Europe - Research on Middle Europe. Director,\nEdgar P. Dean, Temple £-9250.\nIV. Cultural life. 13 half-hour programs. Consultant: Simmons.\n1. Attempted isolation from West; attacks on \"cosmopolitanism”; illustra¬\ntions .\n2. Process of writing a novel; review by party and political controls;\naward of Stalin prize and later rejection; illustrations. Interviews\nwith ex-Soviet novelists in New York. Use Sosin for a couple of weeks.\nAlso Bulygin, his difficulties (speaks English, engineer, technical\nbook)—now in New York City.\n3. Soviet standards in music; conflict between creative inventiveness of\nartist and detailed standards set frcm above; illustrations. Nicholas\nNabokov, composer, in N.Y. in September. Follows Russian music, can\ngive examples of what is denounced and what is approved.\n4. Soviet natural sciences; achievements and limitations; illustrations.\nTurkievich of Princeton University very good - a leading mathematician.\nHow to plan science.\n5. Access to secondary and higher education; political and financial\nlimitations. Use ex-Soviet people - several interviews, for example,\nArnold Horlick, now working with Professor Anderson, has 60-page chapter\nto be used in book. Inkeles has manuscript.\nV. Social life.\n1. Housing problems. One program in which ex-Soviet citizens discuss\nhow hard it is to get an apartment. At bottom of priority list of\nbuilding.\n2. Problems of care of children and working mothers.\n3. Parents’ authority and the Party.\n4. Family life; marriage and divorce. Consultants: Alex and Geiger.\n5. Care of war cripples. Social insurance. Discrepancy between what\nis on books and what they get.\nVI. Nationality progrems. Consultant\nConsultant: Alexander Park of Minnesota on Central Asia.\n1„ \"Family of nations” and renewed emphasis upon superiority of the Great\nRussian nation.\nConsultants: Rechetar of Princeton; Lither of Columbia, Tom Weiner of\nDuke. Pipes is new abroad interviewing in Turkey on Mrhammedans.\nPrograms on nationality: Moslems, Ukrainians (consultants: George\nLucky j„ Russian Institute, Columbia); nationalities during World War II\n(consultants: Luther, Dallin)."
}