{
  "id": "d337-40",
  "text": "-7-\nTypes of Programs\nI. Discussions by Western students of Soviet system and policies; preferably\n•with differences of views.\nII. Discussions between American students of problem and ex-Soviet citizens*\ni.e.* ex-Soviet administrators* army people* students* propagandists*\nliterary people* and scientists. Sont; of these can be conducted entirely\nin English now; others by fading out Russian voices and leading in English\ntranslations.\nIII. Arranging to hear an excerpt from Soviet English-language radio and dis¬\ncussion between U.3* and ex-Soviet citizens of its meaning and how a\nSoviet citizen interprets it.\n17. Dissuasions with ex-Soviet non-Russian (i.e.* Tartar* Ukrainian* and others)\ncitizens of the nationality question, in its political and cultural aspects.\n7. Representation of typical discussions or situations from Soviet life* with\nintroductory and injected commentaries, i.e.* an author who is defending\nhis manuscript against the censors; a kolkhoz chairman who is brought on\nthe carpet.\n71. Suitable life-histories of ex-Soviet and satellite citizens* presenting\nthe impact of the Soviet system on then.\nVII. While a good deal of advance planning; will be necessary for many of\nthese programs* others must be geared to immediate events or striking news.\nSources of ex-Soviet materials and speakers\nI. Harvard interview project; certainly rich in material; live interviewees\ncan be picked up from its project in New York. Soviet escapees.\nII. Columbia interviei* project in literature; much rich material now available.\nConsultant: Simmons. Soviet escapees vho are writers - 15 or 20 of them.\nIII. Research Program on the USSR* under Tree Russia Fund ?Inc• - will have\ngrowing body of material and some English speakers.\nIV. National Committee for a Free Europe; good material on satellite nations\nand also some satellite citizens with direct experience in the USSR.\n7. Selective utilization of material acquired through various Russian*\nUkrainian,, Belorussian* and other national committees and cultural organi¬\nsations\nMrs. Solomon Schwarts (Vlarity Alexandrof £) - semi-digested material\nunder Margaret Mead9s project.\nt"
}