{
  "id": "d337-41",
  "text": "CONFIDENTIAL\nMINUTES OF MAT 29, 1951 MEETING OF THE COMMITTEE OF FIVE TO DISCUSS ADMINISTRATIVE\nPOLICY PROBLEMS RELATING TO THE FUND FOR ADULT EDUCATION GRANT-IN-AID OF $300,000\nTO THE LOWELL INSTITUTE IN BEHALF OF THE NAEB.\nPRESENT: Robert Hudaon (Ex-officio without vote)\nRichard Hull\nHarold. McCarty\nGeorge Probst (Chairman)\nSeymour Siegel\nParker Wheatley (Arrived at 2:30 PM)\nThe meeting convened at 11:00 AM. Probst opened the meeting with\nthe problem of making a choice of what to take up first on the agenda. Probst\nsuggested that there was a choice of discussing the general problems relating\nto the grant or to take up the immediate problem of the appointment of the\nexecutive secretary to the Committee to begin work on executing the purposes\nof the grant.\nSiegel and Hull raised the problem of what is the relation between\nthe Ford grant and the Kellogg grant. Are there not some administrative econ¬\nomies and efficiencies that could be achieved by meshing them? Hudson emphasized\nthat the money is given as a grant-in-aid; the money deposited with the Lowell\nInstitute is a program fund; the grant is made on the assumption that the NAEB\nis a going organization; the purpose of the grant and the reason that the board\nof directors of the FAE approved it was to create a fund for new and higher\nquality educational programs.\nSiegel and Hull asked would it be possible for the executive secretary\nfor the Ford grant to be responsible also for the securing of programming for\nthe network? Would it be possible to set up a promotion and publicity operation\nunder the Ford grant that would mesh with the Kellogg grant and accomplish some\nof the general purposes that the Kellogg grant is meant to accomplish? Hudson\nand Probst said that the executive secretary to this Committee—or director of\nthe producers in these four program areas—should be spending his full time on\nprogramming. The Ford Foundation does not want to have a permanent staff set\nup in relation to this grant. The programs are to be operated on a \"oat up\"\nbasis no that once they are accomplished there are no continuing stmember\nHudson said it might be possible for staff activities of the Kellogg grant that\nare devoted to audience promotion of the four series of programs developed in\nthe four subject-matter areas to be billed against the Lowell Institute fund.\nThese promotion charges would have to relate directly to the promotion of th?\nprograms produced in the four subject-matter areas.\nHull argued that we faced the problem of trying to have a permanent *\nlong-run benefit result from the activity of the Ford grant. If the Lowell\nmoney is only a programming fund* once the programs are done and the money is\nspent, all that we will have will be the programs on tape and there will be no"
}