{
  "id": "d337-53",
  "text": "APPENDIX D\nTEXT OF MEMORANDUM ON PROGRAM PLANNING CONFERENCES GIVEN TO MR. C. SCOTT\nFLETCHER FEBRUARY 21, 1951 TO EXPLAIN PLANS PROPOSED IN DEVELOPMENT OF\nNEW EDUCATIONAL RADIO PROGRAMS WORKED OUT IN CONSULTATION WITH FAE\nIn the first area, \"America and Russia,\" it is proposed that consultations begin\nfirst with Philip Mosely, George Kerman* and Anatole Mazour. Other authorities\nwould be added on the advice of these men. An agenda for the two-day conference\nwould be worked out in advance. As a general rule, each conference would divide\ninto two working groups of three subject area expert® and three educational\nbroadcasters in each group.\nIn the second area, \"Problems of American Foreign Policy,\" it is proposed that\nconsultations begin first with Walter lippmann, Hans Morgenthau, and Robert\nRedfield.\nIn the third area* \"America and India,\" it is proposed that consultations begin\nwith Phillips Talbot, Director of the Institute of Current World Affairs.\nIn the fourth area, \"America and China,” it is proposed that consultations\nbegin with F. Fairbank of Harvard and Albert Ravenholt of the Chicago Daily\nNews and Herrlee Creel of the University of Chicago.\nIn the fifth area, \"Principles of a Free Society\" (which deals with the founda¬\ntions of the American Commonwealth), it is proposed that consultations begin\nwith Harold Lasswell, Robert Carr, Malcolm Sharp, Edward Levi, and Charles\nMerriam.\nAppropriate people will be added as they are suggested and their relevance\nbecomes apparent. It is expected that program suggestions might include things\nranging ao far away as asking for the cooperation of All-India Radio and the\nBBC in providing certain programs. Or Supreme Court Justices Douglas and Black\nmay be asked to undertake a series of talks on \"The American Guarantees of\nFreedom.\"\nThese conferences for program ideas would be pushed as rapidly as possible\nand it i3 hoped they would be concluded in April. A grant of $30,000.00 is\nneeded to make them possible."
}