{
  "id": "d1437-1",
  "text": "2.\nhanging back on the sidelines. Perceiving this, he strode toward us holding out his\nhand, accompanied by a warm smile and cordial hello. At this point a bevy of\nphotographers were unleashed into the room and the President with much good-\nnatured banter with Congressman Harris and Senator Magnuson “arranged” the\npose. He then proceeded to sign the bill, utilizing a row of ceremonial pens\narranged in a holder on his desk and employing each for a portion of his signature\nand handing it to one of those present as he did so. One of the pens marked\nTHE PRESIDENT - THE WHITE HOUSE is now a proud possession of NAEB on my desk.\nThe signing of the ETV facilities legislation was the final act in a long series of\nevents in a seven-year effort, but it was President Kennedy’s administration that\nbrought them to a successful conclusion. And as I watched the President sign, I\nrecalled reading before the San Francisco NAEB convention the letter from the then\nCandidate Kennedy containing his pledge of assistance in the enactment of this\nlegislation and his belief in its importance. “Since education is a matter of national\nconcern, the Federal Government should assist in expediting and accelerating the\nuse of television as a tested aid to education in the schools and colleges of the\nnation ... I wish it (NAEB) continued success in seeking to project the electronic\nmedia into the full usefulness of which they are capable in the service of American\neducation and the welfare of our country.”\nOf course, his interest in supporting ETV was only a part of a general thrust by\nPresident Kennedy to develop a fuller intellectual and spiritual condition for our\npeople and to foster the enrichment of life and culture in the United States.\nCertainly one of the enduring values that we have as a legacy from the Kennedy\nAdministration is the elevation to a new level the recognition of the importance of\nculture and education to the pursuit of American ideals and national purpose.\nFor each of us the reaction to the President’s death was personal; the action we\ntake now must be, too. waiter Lippman once observed that “the final test of a\nleader is that he leaves behind him in other men the conviction and will to carry on.'\nIf each of us is resolved, in the President’s words, “to make the full use of our\npowers along the lines of excellence” in accordance with the principles of decency\nand productivity which John F. Kennedy’s life exemplified, his tragic death will not\nhave been in vain.\nAnd of the Future\nIt. is clear from the start that the new President intends to carry on much of the\nprogram of President Kennedy. Eventually there will be changes certainly, for\nPresident lohnson is a man of strong convictions in his own right.\nA story, which is not generally known, might be relevant at this point to indicate\nthe new President’s degree of interest in educational broadcasting.\nOn the eve of the hearings on the proposed ETV legislation before the House\nCommerce Committee, it became known that the Secretary of HEW (the agency\nproposed to administer the act) was to be the lead-off witness and intended to"
}