{
  "id": "d211-11",
  "text": "COMMERCIAL RECORDINGS OF EBU CONCERTS\nThe Working Party considered this question in detail and agreed\non the artistic desirability of perpetuating some of the more outstanding\nperformances from the EBU Concert Seasons. It recognized, however, that\nthe EBU as such must be seen not to be entering the commercial recording\nmarket. It did not feel qualified to comment on a proposal that subscribers\nto the EBU Concert Seasons might themselves pay the supplements required by\nartists for the commercial exploitation of their EBU performances in return\nfor the revenue which would thereby accrue. Alternatively, the possibility\nwas discussed of a commercial record bearing an EBU label but produced and\nput on sale by a member organization; once again, however, the Working\nParty felt uneasy about the contractual difficulties which might ensue and\nthe fact that such a label might suggest that the EBU itself was involved\nin commerce.\nIn general, the Working Party agreed with the Bureau's recommenda¬\ntion that the most satisfactory method of procedure was to encourage a\nrecord company to take over an EBU production after its broadcast and to\nmake its own studio recording of it, giving due credit to the EBU or,\nalternatively, to make a recording of the actual broadcast available to a\ncommercial company.\nOPERA\nThe Working Party felt (a) that what could be done in this area\nwas already being done (Prinz Jodelet, Padmavati, Saul and David, etc.) and,\n(b) that specific, expensive suggestions would continue to be welcome.\nSzymanowski's \"King Roger\" was discussed as a possibility.\nEBU CONCERT SEASON IDENTIFICATION SIGNAL\nArising from a proposal put forward at its previous meeting the\nWorking Party heard playbacks of first experiments and decided that further\nexperiments should be undertaken. The basic problem is that of repeatability.\nThe Working Party feels that a simple, unharmonized succession of E - B Flat\n- pitchless note might be the best solution, one without espressivo\nimplications, and hence readily repeatable. The tritone would, at the same\ntime, produce the expectation of a resolution which would never ensue. Since\nthe pitchless note would have to be produced by a different instrument\nfrom that or those producing the two pitched notes, they themselves ought\nperhaps to be given to different instruments too. Percussion instruments\n- or, at any rate, percussive sounds - would seem to be the most desirable\n(non-espressivo) possibility."
}