{
  "id": "d211-2",
  "text": "ITEM 2\nRad. Com.\nIstanbul\nREPORT OF THE MUSIC EXPERTS\nThis report (document O.A. k22b of 25 November 1970) has been\ndistributed to all members.\nWhen the Bureau came to consider the report it particularly-\nendorsed several points, notably the appeal to organizations to send\nto the Working Party charged with the planning of the EBU Concert\nSeason any objective ideas for concerts or proposals of programme\nconstructions which they might have. Additionally, the Bureau noted\nthat the publicity given to the EBU concerts had now improved and it\nwelcomed the various suggestions appearing throughout the report that\nmember organizations should use the Radio Bulletin as much as possible\nfor the exchange of information on musical matters.\nUnder Item 1 (c) on page 13 of the report the Bureau examined\nthe request of the experts that a small working party should examine\nthe question of operatic broadcasts in depth and decided to recommend\nto the Committee that the best group to tackle this was that presided\nover by Mr Keller, which was responsible for the planning of the EBU\nConcert Seasons. The Committee is asked to approve this proposal.\nThe Bureau selected the experts’ proposals for dealing with\ncommemorations which divided these into two categories. The recommended\nprocedure whereby the relevant organization would offer representative\nworks from the composers falling into category (2) seemed to be the\nmost satisfactory method of dealing with these particular composers.\nAs regards the composers falling into category (l), the Bureau was\nanxious that the procedure for their commemorations should be clearly\nunderstood, viz, that in each case the organization of the country\nmost appropriate to the composer in question would prepare a written\nplan of his commemoration which would ensure that his output was\nadequately and logically covered. This plan, in the first instance,\nwould be communicated to the Administrative Office which would then\nsend it to all other members, seeking their interest in taking an\nactive part in the production and, in that case, which works they would\nlike to produce. The Bureau further noted that on certain occasions it\nwould become necessary for interested organizations to meet under the\nguidance of the co-ordinator, so that the work could be apportioned\nout in the most satisfactory manner. As regards the commemorations\nfalling in 1971» the Bureau learned that the RAI's offer in respect\nof Albinoni was now ready and would shortly be distributed and that the\nBRT’s plans for Josquin des Pres would include special concerts or¬\nganized within the framework of the Flanders and Holland Festivals\nand that fuller details would soon be communicated. In addition, the\nRTB had made its plans known for the production of a number of works"
}