{
  "id": "d211-24",
  "text": "ITEM_8(a)\nRad. Com.\nIstanbul.\nNORD RING\nThe following note is contributed by Mr. C. Mertens (Director\nof Programmes, BRT)\n\"At the last meeting of the Radio Programme Committee in Berne\nI expressed the wish to receive from those organizations which either\ntook part or sent observers to the Heligoland experiment a report on\nthis. I am sorry that only the BBC has answered this request*the text\nof whose reply is &3 follows\n’ In the original concept, the Nord Ring co-operation was\nof good value to the BBC. The live concerts in the seven\ncapitals with international artists were broadcast at very\nsmall cost and made good sustaining programmes. After two\nor three years of this idea, some member countries felt\nthat a change was necessary and that a more modern approach\nto this seven nation effort had to be found. Gradually we\nmoved to the fully \"pop\" idea of Radio Heligoland in August\n1970 and in the meantime some short series and ’one-off’\nprogrammes took place, as well as some series of \"Dancing\nround Europe\".\nThe pop idea of Radio Heligoland was not attractive to\nthe BBC(although we co-operated in a small way) for we have\nhad our own pop network. Radio 1, for some years.\nI believe that the future of Nord Ring must be based on\nprogrammes of popular melodic music, not pop. With the\nbuilt-in language difficulties, it is a constant problem to\nfind common ground for programmes, and I hope that we can\nsolve this in the future.’\nMeanwhile the members of Nord Ring met in Holland during Decem¬\nber with delegates from BBC, DR, NOS, NRK and SR. At this meeting it\nwas recognized that the Heligoland Scheme had been successful in respect\nof the daily live programmes but that the concerts which had taken place\nthere had not achieved the same success. As a result of this experiment\nthe December Meeting decided to organize in 1971 a new Nord Ring which\nwould take place at Knokke in Belgium between 5 and 17 July 1971 at the\nsame time as the International Challenge Cup of the \"Chanson\". The 1971\nNord Ring scheme would not envisage the organization of any concerts.\nOther countries are once again invited to send an observer to Knokke.\nIn principle the 1971 Nord Ring Scheme will concern itself\nexclusively with pop music.\nAfter receipt of a detailed report from the NOS I will not fail\nto forward more precise particulars to interested member organizations\"."
}