{
  "id": "d211-27",
  "text": "ITEM 10\nRad. Com.\nIstanbul\nREPORT OF THE MEETING OF DRAMA EXPERTS\nThis report (document O.A. 4248) is now attached to this\nnote \"but in its draft form it had the advantage of advance examination\nby the Bureau of the Committee when it met in January.\nSome points on which the Bureau commented were as follows :\npoint 1 (a) Eurotheatre - The Bureau noted that copies of the 6 plays\nselected by the international jury had been supplied to member or¬\nganizations in many parts of the world but it felt that this infor¬\nmation was insufficient to judge fairly the success or otherwise of\nthe scheme, since no information was available as to whether or not\nthe plays requested had, in fact, been produced. The Administrative\nOffice was asked to seek information on this point and this inquiry\nis currently in progress. It is worth recording here that copies of\nsome or all of the plays were supplied to BRT/RTB, IBA,JRT, Kuwait\nBroadcasting Service, NHK, NRK, NZBC, RAI, RTE, SABC and SSR and,\nof course, copies were already in the possession of those organiza¬\ntions which supplied the members of the international jury (ARD, BBC,\nORTF and SR). Perhaps, in order to speed this matter up, delegates\nfrom the organizations mentioned above who will be attending the\nCommittee’s meeting in Istanbul would be good enough to advise the\nSecretary of the Committee at that time of the use, or otherwise,\nthey made of these 6 plays.\nIn examining the recommendation at the foot of point 2\nof the report (pages 6 and 7) the Bureau wished to propose to the\nCommittee that at least in the first instance the panel of experts to\nexamine the manuscripts of plays specifically written for radio\nshould be composed of Mr Esslin (BBC) and Mr Trutat (ORTF).\nApart from this suggestion of the Bureau, the Committee\nis, of course, invited to discuss and take a decision on the re¬\ncommendation put to it in this respect by the expert working party\n(pp. 6 and 7).\nThe Bureau went on to examine the further recommendation\nunder point 2., which appears on page 9 of the report, but expressed\nsome doubt as to the feasibility of this. It suggested that the\nCommittee might feel inclined to recommend to the Administrative\nCouncil that an approach be made to the Secretariat of the Prix Italia\nwith the request that recordings of all the winning entries of that\ncompetition be retained by its Secretariat as a permanent archive for"
}