{
  "id": "d211-28",
  "text": "ITEM 10 contd.\n- 2 -\nnon-broadcasting purposes. An unofficial approach by the Secretary of\nthe Committee to the Secretariat of the Prix Italia has suggested\nthat if such a request were to be forwarded through official EBU\nchannels it would be sympathetically received and, if time permitted,\nput forward as an amendment to the Statute of the Prix Italia at its\n1971 General Assembly. The Committee is therefore invited to for¬\nmulate a recommendation on these lines for submission in the first\ninstance to the Administrative Council.\nIn discussion with the Secretariat of the Prix Italia, how¬\never, the Secretary of the Committee expressed the further hope that\nthe RAI might also consider collecting recordings of other dramatic\nproductions considered to be really important, perhaps on the basis of\nup to two (as opposed to the six recommended by the experts) such\nrecordings each year. The Secretariat of the Prix Italia was not\nkeen on this idea and wished to ensure that the archive of Prix Italia\nwinning entries was created and preserved as such and not complicated\nby random other works unrelated to it.\nIn respect of the three recommendations under point 3, con¬\ntained on page 12 of the Report, the Bureau welcomed the first, felt\nconfident that the Committee would wish the Administrative Office\nto proceed as requested under the second, but felt that the third\nrecommendation was not very realistic and should not appear as an\nofficial proposal of the Committee.\nThe Bureau noted the information contained on page 18\nunder point 5 of the Report that the ARD would be organizing a radio\nplay festival in Frankfurt in 1972 and felt that this might provide\nthe occasion for those EBU experts who would be present there to meet\nand follow up their specific EBU work together. The Bureau further\nhofed that at that time, assuming the Committee's agreement, the ex¬\nperts would pay particular attention to the subject of serials and\nwould find ways and means of bringing into the limelight serials which\nhad been nationally successful and might be internationally meaning¬\nful and therefore worthy of exchange, at least in script form.\nThe Bureau's overall reaction to this Report of the drama\nexperts was very favourable and though clearly it would not be\ndesirable to institute regular meetings, it felt that occasional\nmeetings of this kind could not fail to be fruitful."
}