{
  "id": "d211-3",
  "text": "ITEM 2 contd.\n- 2\nincluding\n- De profundis clamavi\n- Domine exaudi\n- Nunc dimittis servum tuum\n- Ave maris stella\n- Salve Regina\n- 0 tone et dulcissime\n- Misericordias Domini in aeternum\n- Deus 9 in nomine tuo salvum me fac\nThe NOS has confirmed that it is going ahead with its plan for the\nSweelinck commemoration and that this would shortly he communicated\nto the Administrative Office in accordance with the procedure outlined\nabove for composers falling into category (l).\nThe Bureau also examined a proposal from Mr Mertens, Director\nof Programmesj BRT, that, in conformity with a wish expressed after\nlast year's successful Beethoven International Piano Competition, similar\ncompetitions should be organized each year. Mr Mertens proposed that\nfor 1972 a competition dedicated to Scriabin's piano music might be\nappropriate, but the Bureau felt that this was too difficult for young\npeople and recommended to the Committee that the proposal of the music\nexperts for the commemoration of Scriabin in 1972 be implemented.\nAs regards the \"Troubadour\" project on page l6 of the report,\nit is now known that the BRT, ARD, BBC, NOS, NRK and RTB\nhave nominated musicologists who are at present seeing what their own\ncountries could provide in this context. It will be recalled that in\ndue course a meeting of the organizations expressing an interest in\ntaking an active part in this series is proposed under the chairmanship\nof Mr Mertens (BRT).\nOn the subject of the \"Italian Madrigal\" project the situation\nis that details of the proposals from a number of organizations are in\nthe hands of the co-ordinator of the project, Maestro Giazotto (RAI)\nand his suggestions are currently awaited. By way of information the\nfollowing have been put forward in this respect :\napproximately 250 assorted madrigals\none 30', one U0' programme\nexcerpts from Vecchi's \"Le Veglie di Siena\"\nand excerpts from Banchieri's \"II Festino\"\na considerable number of madrigals\nthree 30' programmes\nARD\nBBC\nCBC (Canada)\nORTF\nSSR (RSI)\nNo doubt Maestro Giazotto will be able to inform the Committee in Istanbul\nwhether his organization will contribute anything to this first series on"
}