{
  "id": "d211-38",
  "text": "- 10 -\n3. Techniques of Radio Drama\n(a) 'Training_of_Writers_,_Adapters_and_Producers\nProlonged discussion on this subject revealed that the\nprincipal contribution which international co-operation could make\nin this area was the facilitating of exchange of information on the\npractices of member organizations.\nMr. Esslin (BBC) explained that in the BBC writers who\nshewed talent in the scripts they submitted for consideration were\ninvited to London for a one-day seminar in which the BBC acquainted\nthem with the professional techniques of radio drama production.\nOnly writers who had already had at least one play transmitted were\ninvited and so far four such seminars, each of about 12 people, had\nbeen held with very successful results. Mr. Hausmann-Higson (SSR)\nadded that he had been present during one of these BBC seminars and\nas a result had followed suit by doing exactly the same thing on\nhis return home : on three occasions about 12 young Swiss writers\nhad been invited to a central point and he was convinced that as a\nresult a considerable amount of worthwhile material had emerged from\nthem. The writers had expressed themselves as being delighted that\nradio had wanted to do something for them and both parties had gained\nfrom this since radio, of course, had wanted work from them.\nMr. Esslin emphasized the psychological importance of radio being\nseen to be doing something for writers and he added that the BBC had\nalso arranged occasional special meetings for well-known and established\nwriters including one which brought writers and composers together.\nThis latter experiment was not entirely successful but he believed it\nhad achieved some results.\nDiscussion revealed that several organizations had produced\nrecordings on the lines of an \"ABC of Radio Production Techniques'*\nwhich shewed how the lapse of time could be indicated, change of\nscenery, how many voices can be used in a single scene, etc. Such\ntapes were simple but proved to be very effective and there was\nclearly value in making them available to others though in doing so,\nsince they merely contained recorded examples, it would be necessary\non each occasion to accompany them by fairly detailed explanation.\nMr. Klippert (ARD-SR) believed that there would be value\nin exchanging writers and/or producers between organizations so that\nthey could study on the spot and in detail the methods and practices\nof other stations. This proposal was strongly endorsed by Mr. Esslin\n(BBC) and others and forms the subject of a recommendation later in\nthis report."
}