{
  "id": "d211-45",
  "text": "IT\n5. Co-operation vith QIRT\nMr. Lounela (YLE), who is also Chairman of OIRT's Drama and\nLiterary Group, produced the following prepared statement\n\"The OIRT drama and literature experts meet once a year, generally\nat the end of October. Initially the group was divided so that\none year the exchange of literary and cultural programmes was\ndiscussed, and the other year drama. The last two meetings have,\nhowever, mainly concerned drama.\n\"Next autumn the literature and drama experts will meet in Finland\nand beside common negotiations the intention is to give the\nsections for literary programmes and drama an opportunity to\ndiscuss separately their special questions. The last of the three\ndays of the meeting will be devoted to a general exchange of views\non some central matters: last autumn in Warsaw the subject was\nstereophony.\n\"The aims of the expert group are :\n- to improve the mutual flow of information by exchanging\nregularly reviews of the repertory, reports on new radio\nplays and texts both in the original language and\ntranslated into one of the common languages;\n- exchange of information and programmes on important\ncultural events;\n- to stimulate bilateral co-operation, as for instance\nthe exchange of directors and dramaturgists;\n- the comparison of personal experiences and views;\n- the development of co-operation with the corresponding\nexperts of the EBU countries;\n- to establish contacts with the broadcasting organizations\nin Africa, Latin America and Asia.\n\"Owing to significant administrative and programme political differences\nin various broadcasting companies as well as to different copyright\nlegislation, the group cannot make normative resolutions, it only gives\nrecommendations which the various drama departments apply in the\nmost suitable way.\n\"Certain countries arrange so-called drama festivals, which at the\nsame time serve as public propoganda for radio drama and\noffer a representative review of the newest drama repertory"
}