{
  "id": "d211-51",
  "text": "FINLAND\nSince YLE broadcasts in two languages, Finnish and Swedish, it\nhas two radio drama departments. At the present time the Finnish Ser¬\nvice broadcasts 4 plays per week; the traditional radio play aimed at a\nwide audience is broadcast on Monday evenings while new and frequently\nshorter plays are broadcast on Friday evenings. Experimental plays go\nout on Tuesday evenings but the YLE does not feel in any sense tied to\nthese times or even to the normal durations of the plays. The most\npopular time for radio drama is at midday on Sunday when the best plays\nfrom the past are edited and rebroadcast.\nRegional broadcasting is rapidly developing in Finland and con¬\nsequently provincial radio is likely to come soon and will alter the\npresent picture as regards radio drama. How this will be altered is not\nyet known except that,clearly,there will be more encouragement to local\nwriters.\nFRANCE\nOne of the major recent changes in ORTF's output has been the\nincrease in serials to some 3 or 4 per day carried9in the main on France-\nInter. This same channel also carries a broadcast of an hour-long\nthriller every Tuesday evening, an historical play every Wednesday evening,\nnews of the Comedie Frangaise on Friday evenings and a new radio play on\nSaturday nights. On Sunday nights it gives special news from the world\nof drama, literature, cinema, etc., and also broadcasts a science-fiction\nplay between 2210 and 2300 hours.\nFrance Culture broadcasts a daily adaptation of a major but well-\nknown work between 1445 and 1515 hours during weekdays, it devotes two\nperiods on Tuesdays to drama and the theatre between 1700 and 1800 hours\nand 2030 and 2145 hours when a new radio play is presented. There is a\nMagazine Programme on the subject on Wednesday mornings and another new\nradio play is broadcast on Thursdays between 2100 and 2215 hours. Of\nthese new works there is always at least one play per week by a writer,\nwho, although he may be well-known in other spheres, has never written\nbefore for radio. Every Sunday afternoon between 1415 and 1615 hours,\nFrance Culture broadcasts a play live from a Paris theatre or from the\nComedie Franqaise with an audience present in the theatre and it looks\nupon this series of transmissions as a sort of panorama of plays currently\nrunning in Paris. Once a month France Culture which broadcasts only in\nmono and France Musique (stereo) join together for the presentation\nof a musico-dramatic work with very interesting results, as has been\nevidenced by the lively listener reaction. Altogether 0RTF broadcasts\nsome 700 to 800 drama programmes per year but is of the opinion that it\nstill does not devote sufficient time to rebroadcasts to which it\nattaches considerable importance.\nIn addition to the above, each regional station of 0RTF broadcasts\nat least one major dramatic production per week as well as short adaptations."
}