{
  "id": "d211-52",
  "text": "- k -\nGERMANY\nThe situation within the ARD varies from station to station\nand it is therefore possible to give only a very brief summary here.\nThe sort of radio plays which Saarlandischer Rundfunk used to\nbroadcast on its First Programme have been discontinued since they\nwere not considered to be particularly entertaining for the listener.\nThey have been replaced by a new format known as \"Radio-Play-Boutique!i9 9\na programme presented by \"Madame Boutique\" which includes short plays\nof between 20 and 25 minutes duration. On the Second Programme the\nradio play has complete liberty but is only received by a very small\nnumber of listeners.\nRIAS has made no significant change in its traditional output\nduring recent years, except that it only broadcasts difficult plays,\nwhich truly involve the public and on which it does audience research3\non Saturday nights.\nSiiddeutscher Rundfunk is allocated 90 minutes for each of its\ndrama programmes.\nDeutschlandfunk*s approach is rather different from that of\nother stations in that it only has one programme,broadcast on long\nwave. Originally there was provision for a radio play only on Wednesday\nafternoons but the station received a considerable amount of correspon¬\ndence from drivers of motor cars and lorries who found that they could\nreceive this long wave transmission of DF better than many other stations,\nparticularly at night. As a result, DF now broadcasts 3 radio plays per\nweek including one between 0100 and 0200 hours, which is generally a\nthriller or concerned with science-fiction. Occasional time is scheduled\nfor radio drama additionally between 2300 and 2^00 hours.\nHessischer Rundfunk has a fixed spot for a radio play every\nweek in its First Programme and a similar slot for experimental plays\nin its Second Programme. It also broadcasts a considerable amount of\ngeneral entertainment plays and serials.\nWestdeutscher Rundfunkis particularly concerned with gaining\nthe interest of writers and, apart from the standard output of radio\ndrama and several experimental plays, it also has regular public dis¬\ncussions with writers on the whole subject of drama.\nThe Bayerischer Rundfunk is particularly interested in stereo\nproduction and has noticed that, in view of frequency allocation prob¬\nlems ,its stereo plays on FM are better received technically than those\nin mono on AM. It is observed that, although the public generally is\ninterested in stereo, this is less the case with the more intelligent\ncategory of listener."
}