{
  "id": "d211-54",
  "text": "- 6 -\na considerable amount of experimental drama, adaptations, poetry, etc.,\nbut these do not go out at standard fixed times. The only exception to\nthis is between 2100 and 2200 hours on Saturday evenings which is a\ntraditional period for drama on the national programme. RAI broadcasts\ntwo types of serials, the first between 15 and 20 episodes each of 15\nminutes and the other an adaptation of a novel averaging 6 episodes of\nbetween 30 and 40 minutes each. RAI also broadcasts a considerable\namount of talks and discussion programmes on theatrical subjects inclu¬\nding an attempt at a global panorama of radio drama from the time of\nAncient Greece to Samuel Beckett. It now envisages a further panorama\nof 20th century theatre with air time devoted to it every week. Actors\nare frequently brought into the studio and interviewed on their profes¬\nsion and its attendant sociological and aesthetic problems, and a sort\nof avant-garde club is now planned for truly experimental drama, often\nin the original language.\nJAPAN\nIn spite of the vast impact of television in Japan the important\nfunction of radio has now been re-recognized and although the commercial\nradio stations broadcast few dramas, principally because of financial\nconsiderations, NHK's output in this field has come to be increasingly\nimportant. It broadcasts two regular 45-minute dramas per week -\nArt Theatre on FM and Literary Theatre on AM. The former is concerned\nwith original radio works and the second with adaptations.\nNETHERLANDS\nEach of the six organizations within the NOS tends to have a\ndifferent philosophy towards radio drama but most broadcast experimental\nprogrammes regularly between 2000 and 2300 hours in the evening designed\nfor selected listeners. Other lighter plays are broadcast during the\nafternoons and short plays and serials regularly go out at other times.\nNORWAY\nLike Ireland, Norway has only one channel at the present time\nand the demand for radio drama exceeds NRK’s capacity of supply. In\nspite of this three plays a week are produced whilst the light entertain¬\nment department is responsible for serials and similar programmes. The\nNRK has detected no lessening of interest in radio drama in recent years.\nSWEDEN\nSR's pattern is much the same as has already been reported in"
}