{
  "id": "d211-63",
  "text": "ITEM 13\nRad. Com.\nIstanbul\nCO-OPERATION WITH QIRT\nThe Committee will note from the document accompanying\nItem 1 of the Agenda (Decisions of the Administrative Council) that,\nas a matter of EBU policy, the chairmen of committees will now be\nleft to decide which of their specialized working parties can best\nbenefit by the attendance of experts from member organizations of\nother regional broadcasting unions.\nIn respect of OIRT this has already started to have re¬\nsults and it is pleasant to record that an OIRT drama expert (from\nMagyar Radio) attended the meeting of EBU drama experts in Cologne\nin January and that the Head of Magyar Radio's Music Department\nserved on the jury of this year's \"Let the Peoples Sing” competition.\nIn return the EBU was invited to send a representative to a recent\nmeeting of the OIRT music experts and, at the suggestion of Mr Salter\n(BBC), who presided at the last meeting of the EBU experts, Mr. En-\nhoerning (SR) very kindly served as EBU's observer.\nA statement made by Mr Lounela (YLE),who is Chairman of\nOIRT's drama and literary group,is reproduced on page IT of the\nreport of the meeting of drama experts (Item 10 of the Agenda).\nShortly before the last meeting of the EBU Administrative\nCouncil, when this new policy was defined, Mr Otto Dcnner (YLE) had\nattended an earlier meeting of OIRT music experts in Sofia in\nmid-October 1970. Mr Donner was kind enough to send some notes on\nthis meeting to the Administrative Office and from these it is\nclear that it was principally concerned with Light Music. In this\ncontext the member organizations of the OIRT are being invited to be\nrepresented at the forthcoming International Forum of Light Music,\norganized for the EBU by the Bayerischer Rundfunk in Munich in May\n(see Item 6 of the Agenda). OIRT organizations also take part in the\nMontreux Jazz Festival and in the \"Let the Peoples Sing\" choral\ncontest and EBU organizations, on the other hand, support the Prix\nBrno and the Concertino Praha.\nAs may be seen, co-operation with the OIRT is now well\nestablished and likely to become increasingly so under the new\npolicy and the Committee is informed that its Bureau is meeting with\nthat of the OIRT in Budapest, probably towards the end of June this\nyear.\nIf therefore there are any further points or instructions\nwhich the Committee would wish to give its Bureau in this respect\nit is invited to do so now."
}