{
  "id": "d211-69",
  "text": "ITEM_15\nRad.Com.\nIstanbul\nQUESTIONS OF A TECHNICAL NATURE\na) Storage_of Sound Tage Recordings\nThe Technical Centre was unable, before February 1971> to start\nthe detailed analysis of the replies from the various organizations that\nhad received the questionary regarding the arrangements for storage of\nsound tape recordings. This questionary (circular letter G 105/1), had\nbeen sent in July 1970 to the members of Sub-group G1 (sound recording)\nof the Technical Committee and to the Working Party of experts on\nsound archives of the Radio Programme Committee.\nTwenty-seven replies were received from 18 different organizations,\nwhich provides a very comprehensive survey of the practices of EBU member-\norganizations. In the majority of cases, the replies are very encouraging\nso far as the condition of the stored tapes is concerned, even in the case\nof the older ones. Certain organizations were pleasantly surprised by the\ngood quality obtainable from the tapes, some of which were more than 30\nyears old. The only deterioration noticed is tie following :\n- from the mechanical aspect: tapes made of cellulose tri¬\nacetate become brittle and tend to curl; the splices tend\nto adhere to adjacent turns;\n- from the aspect of acoustic quality: slight increase in\nbackground noise, faint echo, a few drop-outs due to the\nhumidity and perhaps a little distortion due to tape wear.\nIt is difficult to compare the present-day quality with that\nobtained at the time when the recording was made, as technical criteria\nhave evolved since that time. Nonetheless, in the opinion of the majority\nof organizations, the quality of both periods is comparable. However, if\nit is desired to retain a recording for a long time, it is advisable to\nmake a copy of it on a modern polyester tape which will have better\nmechanical characteristics.\nGenerally speaking, the organizations consulted took no more\nthan a few simple precautions for the storage of tapes: air-conditioning,\nmaintaining a medium humidity in the store-rooms, avoidance of proximity\nto magnetic fields likely to be dangerous, storing the tapes in cans,but\nthey took no special precautions against dust. In conclusion, it appears\nthat the problem of tape conservation is not critical and that the fears\nregarding the deterioration of tape recordings after ten or twenty years\nare unfounded."
}