{
  "id": "d410-17",
  "text": "JOHN H, LERCH\n1240 Bryden Road\nColumbus, Ohio\nQualifications: Thoroughly familiar with all phases of radio programming, including 5\nyears’ experience as announcer, script-writer, producer, newscaster,\nand program director. First-hand knowledge of Western European and\nAsian radio techniques.\nIn Vienna, Austria (1948-49). Responsible for 10 producers assignments\nand all special events originating from Vienna. Promoted to station\nmanager before leaving. Trrmiiral nnln ryr *jjlflOQ-pius housing.\nIn Munich (1951-52); foreign language producer for RADIO FREE\nEUROPE for 18 months. Set up training program for Czechs, Poles,\nHungarians. Produced over 300 programs aired--of all formats. Pro¬\nmoted to administrative head of Hungarian Desk: studio booking, sched¬\nules, transportation, personnel work i T 5 OtTp a 1 annum.\nIn Manilla, Philippines. Assistant Program Director, RADIO FREE\nASIA. Responsible for staff of 30 Filipinos, 10 Chinese. Supervised\nshaping and direction of news, information, drama, farmers' shows.\nPolicy decisions in program planning and development affecting\nChinese listeners overseas, Filipino audience, and language desks\nfor other Asian countries. Budget and recruitment of personnel.\nRADIO FREE ASIA terminated activity April 15, 1953 by order execu¬\ntive committee, San Francisco. ^ygrrnf<11\\| -4^i \"t1 ju-' i aH-..■ ■ ■ ^\nwith slated increase for July 1.\nTwo months study-survey through Southeast Asia to measure effective¬\nness of psychological warfare facilities and listenership in Hongkong,\nSiam and Japan.\nWriting, Assistant editor army camp newspaper (1944). Made staff assign-\nEditing ments, reviewed and edited stories. Planned and arranged interviews.\nR cently (1952) wrote Cultural News in Free Europe used as promotion¬\nal material for Radio Free Europe by university stations.\nMilitary\nExperience\nLanguages:\nEducation:\nArmy Counter Intelligence Corps. 19 months overseas as observer,\nreporter on internal security France and Germany. Investigation sub¬\nversive activities. Interpreter services on highest level: personal\naide to Commanding General, 7th Armored Division.\nAuthentic command French and German. Knowledge of these languages\nlearned in those countries. Working knowledge Spanish. First-hand\nexperience in dealing with, working with, living with Europeans and\nAsians. Total : 4 years in Europe, 1 year in the Orient.\nCertificat d' etudes, Universite de Grenoble. France 1946.\nStanford University, A. B. ' 1947\nOhio State University^: A. 1950.\nAug. 15,1953"
}