{
  "id": "d410-32",
  "text": "% \\\nTHE OHIO STATE UNIVERSITY\nHoward L. Bevis, President\nBROADCASTING STATION WOSU AND WOSU-TV\n820 Kc. 5 Kw.\nWOSU-FM 89.7 Me. 14 Kw.\nWOSU-TV CHANNEL 34\nRobert C. Higgy, Director\nCOLUMBUS 10\nOctober 3, 1955\nMr. Harry J Skomia\nExecutive Director\nNAEB\nUniversity of Illinois\n119 Gregory Hall\nUrbana, Illinois\nDear Harry:\nGood news, personally, and a program prosposal herewith]\nIfm leaving WOSU this month to go to Japan as script writer\nfor a newly established psy. warfare unit of the government.\nIn thinking it over carefully, and boning up on my lore of\nJapan, I«d like to do REPORT PROM JAPAN for NAEB release.\nIt seems to me that I could prepare a^fifteen minute tape\ncovering one subject of current interest relative to American\ninterest in Japan plus a short interview bearing on this\nsubject ( economic hardships, export-import, theatre and films,\nAmerican influence and ancient traditions, etc.) ; this\ntape to be produced either at NHK or in our own studios there\nand made at nominal costs for NAEB.\nIfve already sounded out my superiors in Washington, so that\nthere is no objection or conflict represented; and I am at liberty\nto do such a taped report as well as an occasional article.\nYou might give me your reaction to this proposal before I formally\npresent it to the entire committee. You might also tell me\nsomething about Robert Goralski*s ** Asia....** which I recall\nvaguely... after he left Radio Free Asia. I can tailor these\nreports according to your guidance and material requested, so\nthat if I were to do 13 we'd have information on Japan that I\nthink might be pretty good.\nIncidentally, I expect to leave Columbus about October 20 so\n1*11 greatly appreciate a reply soonest*.. and also so that I\ncould get the necessary papers rolling before I leave the country.\nI truly would like to work out something with you. This is a truly\nchallenging opportunity for me and the experience ( journal!stica^L\nand professionally ) all to the good. So, if you find the fl\nmaterial satisfactory and suitable for your purposes, 1*11 be\nconter\nI can as a service#"
}