{
  "id": "d410-63",
  "text": "Program\nIV, Topic: Interview with Tokugen Matsumoto on basic foods\nof Japan, the udon and soba. ( noodles )\nFeature: address by John Snedaker of the American Chamber\nof Commerce on the Progress thru Plenty motif\nat the American Paviliion in Osaka,\nConcerning programs V and VI which will be recoded Saturday, May 12\nand put into the mail that date, so you should have by May 16,\nProgram V: Highlights: Foreigners in TV panel criticize\nConstitution revision ; Great plans for\nTokyo building in next ten years; Repair\njob going on Hemeji Castle; New Kabukf\nTheatre trainees.\nTopic: the bulk of this program is concentrated on a\nsubject I have long wanted to get to: attitudes\ntoward America, with a sifting of the evidence in\nanti-Americanism, I have John Ishimoto, a Nisei\nattorney who will discuss the topic. This takes 9\nor 10 minutes alone.\nProgram VI: Highlights: Items on Judo; Spotlight on Okinawa's\nrecovering economy. radical new art\nexhibition at gallery ( new school in paint¬\ning)\nI shal I have Miss Aiko Kitaoka as my guest to talk\nover costume design in Japan ( Women's fashions)\nShe just returned from a successful year in the States\nand was photographed in Vogue, etc. OR... if she\ncannot make it, I'll get Miss Dorothy Birttten, an\nEnglish woman living in Japan who composes and arranges\nfor the Tokyo Symphony. She will discuss contemporary\nJapanese music. AT THIS DATE I CANNOT TELL WHICH OF\nTHE TWO I'LL MANAGE TO GET. SO IT GOES.\nHere appended is a list of the topics I plan to get on to, and you could\nstart numbering them VI£ VIII etc.\nI wonder if you could copy this, and return it to me, or a\ngood carbon. The gal who does my typing is not in today, or\nI'd have it done before sending you this messy outline!\nQuestion: Do you plan to stockpile these and then announce the\nseries, releasing them bit by bit, or are they already in\ncirculitfcon. Please tell me how you plan to operate.\nAnother guestion: Can you provide me with information on the fifth\nseries of grants-in-aid for content oriented\nprograms 1956. I'd like to apply for next fall.\nJOHN LERCH"
}