{
  "id": "d977-126",
  "text": "Hereto 1, X95S\nMr* John Metes, ▼lee<-Pl«aldent\nffm Fund Adwaaa—nt of tdueattoa\n1*77 Edison Iwbm\nMew York 22, Mew York\nBoar Johns\nThis is to report that Harry Skoraia has now completed the first draft of\na now MSB proposal for submission to the Ford Foundation* Burton Psrnlu,\nSkonda and I will bo giving the Material an intensive review during the\nnest several weeks. A,® quickly as a final and formal, document can be pro*\npared we will put it in jmr hands.\nOn behalf of all of u® m& I thank yon for your interest and your careful\nand considered reactions to our preliminary draft proposal. They war® ex¬\ntremely helpful* 1m were most generous with your time, and we are grate*\nf»X for it.\nton may be interested in a brief account of our Washington activities. Yon\nrecall we had discussed the possibility of a national \"overview and direct¬\nion®\" session m ISff to be called by the B. S. Office of Education and the\nMBS (with the 1950 Htf easting before the channel reservations as a pre¬\ncedent).\nIon recall, it war this mmting which brought the JC&T into being. Mm near¬\nly 8 years later m felt it we® tine to try to le-epprais® and assess the di<\nrent ions and Vm $miX» in education to which television Is being applied.\nMe spent two days with Franklin Dunham and Gertrude Broderick who report the\n0. S. Office of Education will not only officially sanction such a acting,\nbut has a great deal of eathuslasNi about it* Dates have been set (Kay 26,\n27 and 28) end official invitations from the U* $• Office of iducatioa will\nbe forthcoming shortly* We would hope 'that you. Dr* Stoddard, and other#\ncan pis® to attend.\nDr. Arthur Adams of the American Council on .Education signified hi# interest :\nin having the Council participate md offered the services of the Council*s\ntelevision committee staff toward this end. (Under the Joint sponsorship\nof MB and the U* S. -Ifflee the Council would be a participant, not a host,\nand one of the previous rationales whereby the MAIM, the JC f, the BTitC, etc*\nwould ask the Council itself to participate, does not now prevail).\nSteetle expressed his interest in ?mch a meeting and pledged Ids support on\nbehalf of JOIST."
}