{
  "id": "d977-170",
  "text": "-7-\nTo achieve this effect of concentration, we invited cur second group of twelve\nto meet for an entire day with college experts on the school problem. On Wednesday,\nNovember 15>, from 9:30 in the morning until £:00 in the afternoon, these twelve — a\nbanker, a farmer, two housewives, two school teachers, a student, and several business\nmen — discussed their school situation with Professor Martelle Cushman of the Iowa\nState College Department of Vocational Education and Mr. Ralph Imes, our program\nmoderator.\nDuring the morning period they were exposed to a series of maps which showed the\nsize and nature of the Cambridge community in terms of trade area, and church and school\nattendance. In the discussion which followed, some of the real problems of their\nschool were brought out, with facts and figures supplied by Mr. Cushman. Alternative\nsolutions to these problems were considered, along with what each solution might cost\nthe town in terms of tangible and intangible values.\nIn the middle of the afternoon session an odd thing happened. The group had been\ndiscussing the reasons why the school had lost so many tuition paying pupils in the\nlast few years. Most of the group insisted it had nothing to do with the town for\nthe school, but was the result of \"personal things.” Then one of the young men said\nthat he knew why the parents of these children had taken them from Cambridge and placed\nthem in neighboring schools. The reason, he said, \"is our bad reputation. We’re known\nas a tough town. We've got a juvenile delinquency problem and we’re not doing anything\nabout it. If we want to get these kids back into the Cambridge school, we've go to do\nsomething about our reputation.\" This statement, and the short discussion on juvenile\ndelinquency which followed, indicates the greatest penetration of our process, in terms\nof creating an atmosphere in whidi these people could face and discuss the real problems\nof their town.\nIn the last few minutes of our Wednesday discussion, the group again brought up\nquestions about the alternative solutions to their prcblam. At this point. Bob Shayon\nasked them if they would like to talk with people from towns which had faced their\nproblem and actually done something about it. They said, yes, they would like very\nmuch to talk with such people. \"When can we see them?” one man asked. \"Tomorrow\nnight on the program,\" said Bob Shayon.\nTo provide additional factual material, we had located three towns, all similar to\nCambridge, tfcich had been faced with similar school problems, and had made and carried\nout decisions on them. A representative from each town was chosen to take an informal\npoll to determine how pleased the town was with the solution it had adopted. These\nindividuals arrived in Ames on Thursday morning—Julius Black from Kelly, Iowa, a town\nwhich had decided to close its high school and send the children to neighboring schools,\nMrs. Griffiths from Lisbon, Iowa, a town which had voted down a possible reorganiza¬\ntion, and Mrs. Vaupel from Ashton, Illinois, a town which had, four years ago, voted for\nreorganization with several neighboring districts, something which no town in Iowa has\nyet done.\nOne more guest was invited, Wayne Hill, a businessman from Pella, Iowa. This man\nhad graduated from the Cambridge High School some twenty years ago. He was asked to\ncome on the program to tell out of his personal experiences how he felt now abOTat the\nadvantages or disadvantages of his education in Cambridge."
}