{
  "id": "d977-173",
  "text": "alternative solutions to the Cambridge school problem.^* Then comes the introduction\nof our guests. Three of them tell the experiences of their towns in adopting differ¬\nent alternatives as solutions to the school problem® Mr® Hill speaks of his years\nin the Cambridge high school and gives his evaluation of his education in the light\nof his personal experience. Questions from the Cambridge people directed at the\nguests begins the real discussion period. Mrs. Vaupel, the woman from Ashton,\nIllinois, a town which has reorganized, proves to be our best discussion raiser, prin¬\ncipally because her views directly oppose those of most of the Cambridge people.\nFour minutes before the end of the program, Mr. Xmes points out an apparatus on\nthe wall above him. This is our \"vote-board,n a wooden panel with the four alternatives\nwritten on the left and four series of twelve small electric lights on the right.\nMr. Imes explains that on each desk there is a panel with four buttons. Each button\nis labeled with an alternative. When one of the buttons is push©!, a light comes up\non the board.\nMr. Imes explains that they have discussed the problem, considered the alternatives,\nand now they must come to personal, private decisions. The alternatives are four:\nthe town can stay-put5 it can close the high school down, sending the children to\nother schools as tuition paying students; it can try to consolidate the small areas\naround it$ or it can attempt to join together with three or four neighboring towns and\nreorganize.\nThe decision is yours, says Mr. Imes. And once you1 ve made it, youtve got to live\nwith it and iry io make It stick. But that doesn* t mean that next month or next year\nor ten years from now you won1!; have to sit down and make some mors decisions. That*s\none of the great^thlngs about living in a democracy—you1 ve got tQ keep oiTmking your\nown decisions.\nThe vote is taken. The results: ei^it for consolidation, three for stay-put.\nHad this vote been taken a month before it would have been one or two for consolidation\nand the rest for stay-put. In the eyes of many experts, consolidation—that is, the\nabsorption of smaller rural districts—is not much different from staying put. It is\na patch-work solution which was tried twenty years ago by many districts and is now\nantiquated. The interesting thing here is that some years ago Cambridge had a chance\nto consolidate with rural districts and did not, fearing that the rural areas would out¬\nvote the town. To vote for consolidation, then, does represent a change in the minds\nof these people, some widening, perhaps, of their civic horizons.\nn fee driving force of the program, as we saw it in the early stages of the project,\nwas to be the whole town, moving together toward a solution to their problem. Thus\nwe did not begin our dry-run discussion with the typical conflict arrangement of two\nspeakers with opposing views. While we still feel that our basis idea of working with\nconsensus is sound, in future shows we mil make use of conflict, not as an end in\nitself, but as a way to provoke construction patterns of discussion."
}