{
  "id": "d977-87",
  "text": "-2-\nIn the past, the Fund for Adult Education has made funds available©\nfor the conduct of eight seminars or workshops* While these will\nbe similar in nature, they will not be identical* There is need\nto get into other areas of specialization.\n4. Continuation of the Placement Service for educational television\nand radio stations. During the past year half of the educational\ntelevision stations have availed themselves of the Placement\nService, more than a hundred fifty institutions and individuals\nhave utilized the Service within the same period.\n5. Continuation of the Fellowships and Scholarships program for\npersons in educational television for whom additional training\nand/or schooling would be profitable. It is proposed to make\nthis available in grants varying between flOO and f300, depending\nupon the merits of each case, with consideration being given to\nlength of program and the prospective good to educational tele¬\nvision.\nThese Fellowships and Scholarships are intended to encourage ed¬\nucational television personnel to participate in advanced study.\nThese are not intended to pay the full costs to the individual.\nThe varying amounts are intended to encourage individuals to in¬\ndicate special needs and interests in their applications. These\nScholarships and Fellowships could be used for study during summer\nsession work at regularly scheduled institutional summer sessions,\nor planned special workshops, or at accredited institutions during\na fall or spring term. Applicants would not be eligible for those\nFellowships*or Scholarships if attending an NAEB sponsored Seminar\nor Workshop* A similar amount has been available to NAEB from\nthe Fund for Adult Education during each of the past two years.\n6. Grants-In-Aid for Educational Television Workshops*\nIt is proposed to make available to educational institutions who\nwill sponsor educational television workshops for selected persons\ngrants in the amounts of fl,000 to £3,000 in order that the quality\nof workshop personnel may be upgraded. It is not proposed to\ncover participant expenses, nor to contribute to a workshop that\ncan be financed on other bases.\nThis particular type of grant-in-aid is a new proposal, but one\nfor which NAEB has had a number of requests during the past three\nyears. With such grants it is anticipated that help can be given\nin improving an institution-sponsored seminar or workshop. It is\nnot anticipated that these funds would be used to pay any part\nof the participants1 expenses. In effect, such grants would be\nsupplemental to the institutions.\n7. Continuation of the Television Consultant Services 0\nIt is proposed to continue the services which have been made\navailable to educational stations this year by NAEB through a\nGrant from the Fund, but to change the conditions under which\nsuch services would be available. Under this grant, if approved,\nit is proposed to male© consultant services available on an in¬\ndividual or team basis, depending upon the need3 of the requesting\nsources.\n£ 7,000\n$ 6,000\n$18,000\n£10,000"
}