{
  "id": "d977-93",
  "text": "-5-\nAPBE: The Association for Professional Broadcasting Education,\nThis group, devoted to raising the standards of university and college\ncourses in broadcasting, is represented on our Organizational Liaison Commit¬\ntee, as are many of the other groups listed here. Most of the officers of this\nassociation are also NAEB members and committee members. Consultation\non various common problems, particularly in the area of publication at the\ntime of the launching of the APBE’s new magazine, took place during 1956-57.\nAVCPI: The Audio Visual Commission on Public Information\nThe NAEB was represented this year on this commission by its Associate\nDirector, whose participation was greatly appreciated by this group. The\nAVCPI grew out of DAVI (The Department of Audio-Visual Instruction of the\nNEA). See also DAVI and NEA.\nBBC: The British Broadcasting Corporation\nWe have for years exchanged programs with the BBC, admittedly re¬\nceiving more than we have been able to offer. We also exchange publications,\nresearch and personnel with them whenever possible. Several of their studies\nare reviewed in this year’s Fact Sheets. Several NAEB publications are also\nregularly reviewed and referred to in their various studies. NAEB President\nBurton Paulu’s study of British Broadcasting, written in large part while he\nwas a Fulbright Scholar in London, has been favorably reviewed by the British\npress and BBC publications during early 1957 as an evidence of our mutual\nserious interest in each others’ systems and programming. BBC representatives\nalso participate regularly in our conferences and we are represented at as many\nof theirs as possible.\nBIS: The British Information Service\nMost of the relations with this organization are in the exchange of\nprinted material. However, certain excellent informational series on British\nlife, industry and mores have also been carried by the NAEB Radio Network.\nSuch a series is *’Window on the World,” a weekly year-round series currently\nbeing distributed.\nThe Board of National Missions of the Presbyterian Church in the United States,\nof America\nThe Executive Director serves as a consultant to this group and is\nscheduled to give a series of lectures and serve as a consultant to Board¬\noperated radio stations and at special conferences being held in Sitka and Jtmeai\nAlaska, the last week in August of 1957."
}