{
  "id": "d977-96",
  "text": "-8-\nstations to study educational broadcast techniques. All such visits by these\ndistinguished guests were most successful. At least one such guest paid high\ntribute to the NAEB for its role in such exchanges at the time of the 1S56 NAEB\nConvention. The NAEB was also represented at a meeting called by the HE during\nthe year, and advised from time to time on planned visits of other foreign scho¬\nlars in the broadcast field, whenever our help was requested.\nIRE: The Institute of Radio Engineers\nThe NAEB's Engineer is a member of this group and of its Professional\nGroup on Broadcast Transmission Systems. Various other NAEB member engin¬\neers are also members and have contributed papers and publications for Insti¬\ntute use.\nIGEZ;.. The, Joint ,Qp>ugcil op,,Educatign^l Television\nThe NAEB is represented on the Board of the JCET by its President. The\nJCET is education’s voice in Washington to encourage the use of frequencies\nallocated to educational television, and to insure their protection for a long\nenough period to make possible their full utilization. Like the ETRC, the JCET\nhas received its operating funds from the FAE, and more recently, the Ford\nFoundation. It is represented on the NAEB Organizational Liaison Committee,\nand the NAEB staff works closely with that of the JCET.\nMENC: The Music Educators National Conference\nThis group is represented on the NAEB Organizational Liaison Committee.\nCommon projects for programs in music education, however, have had to be\ndelayed this year in view of other priorities. Hence, there is no significant\nprogress to report during 1956-57.\nMLA: The Modern Language Association of America\nThis organization has been one of the most alert of the professional\nassociations in its interest in the uses of radio and television for language\ninstruction. During the year, the Executive Director conducted a survey of\nall language programs on educational radio and TV stations in the U. S. for\nthe MLA in a joint project which will also be included in a UNESCO interna¬\ntional report on this subject. He also addressed and served as a consultant\nfor a state conference of the Illinois MLA, which was devoted principally to\nthis problem.\nNAFBRAT: The National Association for Better Radio and Television\nThis Listener Council organization, like the ACBB, is assisted in every\nway possible by the NAEB in the establishment of a reasonable and fair public\nreaction voice to the programming available on the U. S. airwaves. Through\nthe efforts of such groups as this, outstanding programs have been recognized\nand encouraged and provably harmful programs resisted—some having been can¬\ncelled partially as a result of responsible educational efforts by such-groups."
}