{
  "id": "d1107-0",
  "text": "Office of Executive Secretary-\nUniversity of Illinois\nUrbana, Illinois\nAugust 1, 1938\nTHE CONVENTION\nBecause of complication regarding dates and place of annual meeting, it has not\nbeen possible to state either in this issue. A special publication will be sent\nyou by first class mail when the call is issued.\nARMSTRONG PERRY DIES\nLong a friend of educational radio and service manager of the National Committee on\nEducation by Radio, Armstrong Perry, 6l died July 5 at his home in Westport, Conn.\nEducator and editor, Mr. Perry made a survey of educational broadcasting in Europe\nin 1933 for the Payne Fund and afterward became a specialist in radio in the U.S.\nOffice of Education. The following year he became service manager of the National\nCommittee. He is survived by his widow, Mrs. Montanye Perry, also a writer, and a\nbrother. Mr. Perry was injured more than a year ago in Venezuela. For months he\nrefrained for over-work, on orders of his doctors.\nEQUIPMENT FOR MICHIGAN\nRegents of the University of Michigan In their last meeting of the year acknowledged\nreceipt of radio equipment valued at $7,500 from WJR, Detroit. At the same time\nProf. Waldo Abbot, director of broadcasting at the University, placed a value of\n$39,000 on gratis time for more than 200 programs broadcast direct from the campus\nthrough WJR. The equipment in the Ann Arbor campus studios makes the plant one of\nthe best in the country. The studios are used for classes in radio technique as\nwell as for broadcasting. (BROADCASTING, July 15)\nNO TROUBLE FROM A. F. OF M.\nNow comes word from Mr. Joseph N. Weber, president of the American Federation of\nMusicians, which clears a question raised some months ago when AFM started negotia¬\ntions with the networks, stations, and recorders regarding use of union musicians.\nDuring certain stages of the negotiations it appeared that AFM would insist that\nrecord and transcription manufacturers sell only to approved radio stations. How¬\never, recent events show this boycott feature will not be in the agreement between\nAFM and record and transcription manufacturers. So far as NAEB is concerned, here\nis Mr. Weber’s letter:\n\"In answer to your favor I beg to advise you that the policy of the American Federa¬\ntion of Musicians at the present time is not to prohibit its members from taking\npart in the manufacture of educational and musical recordings as long as no commer¬\ncial use is made of such recordings.\""
}