{
  "id": "d1107-1",
  "text": "-2-\nPKESSINGS FROM ACETATE\nYour secretary was instructed to secure information on making of master records frcm\ninstantaneous recordings at the Columbus meeting. In the packet is a price list from\nGennett Record Division of the Starr Piano Company. Another, the Clark Phonograph\nCo;, 216 High Street, Newark, N.J., gives us the following dope on pressings:\nWe have been most successful in plating discs and find the reproduction very true.\nIt is necessary to leave at least one inch margin on the outside of a disc. This\nallows for proper margin on your finished record. It is advisable to handle the\nrecorded disc as little as possible. Also, do not use a lubricant of any kind on it\nas we are unable to plate over a lubricant. We can plate only one side of a disc.\nWe cannot handle a disc with paper label in center. If both sides are recorded,\ndesignate which side is to be plated. Give every plate a number as we work entirely\nby number. The original disc is ruined in the processing. We usually keep plates\non file for reordering.\nDiscs will be oversized in order to have them plated. In other words, the sizes\nmust run as follows:\nFor a 10-inch record the disc must measure lli inches\nFor a 12-inch record the disc must measure 13-| inches\nFor a l6-inch record the disc must measure 17 3/8 inches\nNote quotations are for two different kinds of materials, Shellac and New Material\n(Vynal Acetate). The shellac record is used for commercial purposes mostly, while\nthe Vynal acetate is used where unusually good surface is required, or where a very\nquiet record is desired. In other words, vynal acetate is used entirely for broad¬\ncasting purposes, auditions, and sales talks. Notice, too, quotations are on plat¬\ning, Master, Mother, and Stamper. You will require a Master, only, in most cases.\nUnless otherwise advised, we will cut all Masters down. However, should you require\na number of records (75 or more) it is advisable to have a Mother made and kept on\nfile. Then, at any time the Master wears out, you can have another plate made from\nthe Mother and keep on pressing records indefinitely.\nPrices, FOB,\nNewark, N. J., are:\nPlating\n16\" 12\"\n10\"\nMaster\n$7.00 $S7oo\n$4~oo\nMother\n6.00 5.00\n3.00\nStamper\n7.00 6.00\n4.00\nNew Material (Vynal Acetate)\nw\n1 to 10 of a number\n$1.85 ea S.F.\n2.10\nea D.F.\n12\"\n1 to 10 of a number\n.95 ea S.F.\n1.10\nea D.F.\n10\"\n1 to 10 of a number\n.75 ea S.F.\n.90\nea D.F.\nShellac Pressings\n16*\n1 to 5 of a number\n1.75 ea S.F.\n12\"\n1 to 10 of a number\n.85 ea S.F.\n10\"\n1 to 10 of a number\n.65 ea S.F.\nIn greater quantities than quoted above there are lower prices, and lower prices for\ndouble face pressings. These prices are on file and will be sent you upon request.\nYou are to furnish labels and envelopes, if same are to be printed."
}