{
  "id": "d1107-2",
  "text": "-3-\nTBE VOICE OF PURDUE\nWBAA now has a permanent-line outlet on a street corner in the middle of down-town\nLafayette. Five broadcasts a week go through this new outlet. Using the basic \"man-\non-the-street” technique for all, variety is injected through different slants. The\nprograms are: a sports questionnaire; a court of motor safety, during which a state\npoliceman stops cars for the announcer’s queries; a woman shopper program; a movie\nquestionnaire; and a week-end finale Saturday afternoon, with questions on local and\ngeneral affairs.\nFree complimentary tickets to a local ball-park are offered to the participants in\nthe sports program, and free tickets to all the local movie theatres are handed out\non the movie questionnaire. \"It is interesting to note,\" says Williams, \"that in\nthe latter case ducats are handed out in sealed envelopes, with neither the announcer\nnor the recipient knowing the identity of the theatre involved. And all this with\nno word of publicity for the local theatres or their attractions, as only general\nquestions on the movie trade are used. Here’s cooperation between local merchants\nand an educational station.\"\nFCC ACTIONS\nWILL, University of Illinois, Urbana, Ill., has been given permission to increase its\npower from 1 to 5 KW on 5^0 kilocycles.\nWKAR, Michigan State College, East Lansing, Michigan, has been authorized to increase\nits power from 1 to 5 KW on 850 kilocycles.\nKFJM, University of Worth Dakota, Grand Forks, W.D., has been granted permission by\nthe FCC to make changes in equipment.\nKPAC, Fort Arthur College, Port Arthur, Texas, was granted permission to operate\nspecial hours the night of July 25 in order to broadcast statewide election returns.\nKOAC, Oregon State College, Corvallis, Ore., was granted permission to remain silent\non July 4.\nWBAA, Purdue University, Lafayette, Ind., was given permission to operate from 1 to\n2 a.m., June 21 in order to broadcast special DX programs.\nKFDY, South Dakota State College, Brookings, S.D., was given permission to remain\nsilent July 4.\nUniversity of Illinois, Urbana, Ill., has been granted construction permit for new\nrelay broadcast station, using frequencies 1646, 2090, 2190, and 2850 kc, with 40\nwatts.\nWRUF, University of Florida, Gainesville, Fla., and WKAR, Michigan State College,\nEast Lansing, Mich., have been granted extension of permit to rebroadcast Naval\nObservatory time signals.\nWHAZ, Seneselaer Polytechnic Institute, Troy, N.Y., has been granted authority to\nremain silent August 1, 8, 15, 22, 29 and September 5 becaase of summer vacation."
}