{
  "id": "d1525-0",
  "text": "tBefore the\nWashington; Dv J/Cv . \"/,: '■■■\"' ; \"\"•\nTestimony of Seymour. i$. Siegeli * ’ '\nDirector of Programs of WNYC in ■'••••\n\"behalf of the Municipal Broadcasting ; •\nSystem of the City of New' York ? ' ' * .\nIn\" re j CDE.li/ck^n^.L.;BEARINGS ‘ :: : • ' Docket .No, 6741\n- My- name is Seymour N. . Siegel. I .am ;the'- Director of Programs, of Radio\nStation WNYC,' and have beeh associated with the station since'; 1964. ' -\nStation WNYC', which is under the direct supervision of the. Mayor1 of the\n0ity of hew York, the hon, William' O’Dwyer, has \"been operating on- a license\nwhich permits \"broadcasting on 830 kilocycles until sundown Minneapolis time,\nfor the past five years WNYC has \"been operating until 10 P.M,, Eastern Standard\nTime, under Special Service Authorizations of this: Commission.\nThose precious nighttime hours,- from sunset-Minneapolis - time to 10 P.M,,\nEastern Standard Time, have \"been devoted, we -believe,- to providing a unique\nprogram service to the inhabitants of the City of-hew York,- the largest city in\nthe world, which would otherwise not \"be available to them, .\nPermit me to indicate that WNYC is owned and operated by tne City of New\nYork, itself. The station is an'vadjuric't: of various municipal .departments which\nuse and require broadcasting service.'Tt is entirely non-* Commercial in.-its\":opera¬\ntion and all of its programs are sustaining.- It'is devoted wholly and solely-to\nthe service, .education, entertainment, recreation, health,; welfare and safety\nof its owners, who are the’taxpayers and citizens of New York City, . .;\nNew York has become the capital of the world since the United Nations\ndesignated the City ae its world headquarters. Ever since the. Uni ted Nations\nbegan meeting,\" WNYC has broadcast complete and full information direct from the\nCouncil sessions. Because lfNYC:’has-no commercial -Commitments1 it is peculiarly\nwell; adapted to the allocation of‘:large blocks of - choice broadcasting time to\nthe coverage of 'couplete sessions of tile Security'Council, the' General Assembly,\nthe Atomic Energy Commission; the Economic and Social Council and other'organs of\nthe United,Rations.\nMany of the hours after sunset Minneapolis:time- have been utilized:for the\npurpose of bringihg' to the radid\" audiencec6iiiple te'; \"gavel to gavel\" coverage of\nthese discussions having \"to: do with the peace--of. the worldv Many times these\nmeetings have run past id' RDM, , Eastern' Stahdard- Time-; and this Commission has\nbeen good enough to entertain\" and grant our request- -to remain on the air until\nthe adjournment of these sessions.\nJack Gould, radio editor of the - \"New- -York- Times\", and one of radio's most\nconstructive critics, characterizes -WNYC1 s \"transmission, Without extraneous com¬\nment or interpolation of the full sessions of the meetings' of the United. Nat ions\"\nas \"the responsibility which has fallen on the station and which to date it has\ndischarged magnificently. ; ‘ : : •\n' \"Por the first time the listener -is being afforded the privilege of sitting\nin on the councils of the world1 s; statesmen,\" in itself, a tremendous advance.;...\ntoward that international understanding so vitally needed for the achievement\nof lasting peace. At .the hands of the Nazis and Ease is ts, radio was employed"
}