{
  "id": "d1525-0",
  "text": "December, 1955\nThe Pre side nt * s Pa ge\nDear NAEB-ers; ' '\nHave you ever tried this, at 8 otclock in the morning, three days*\nPAST THE DEADLINE? 1 HAVE« I*M DOING THE TRICK NOW• WHAT COMES OUT,\nFOR BETTER OR WORSE, HERE GOES. *\nYOU MAY NOT BELIEVE IT, BUT JUST NOW I 1 VE ABOUT CAUGHT UP wI’tH THE • '\n1955 CONVENTION. STILL A FEW WIND-UP THINGS TO DO, BUT IN GENERAL\nI CAN LOOK MYSELF IN THE FACE. i*VE HAD JUST A FEW MINUTES TO- THINK\ntoo. Maybe you won!t mind if l get back to company business.\nBy WAY of REVIEW, BUT MORE LOOKING FORWARD, let* S SURVEY a ’N-UM8ER OF\nTHINGS NAEB MUSitACT- ON WITHIN THE NEXT FEW MONTHS.\nTake committees first. The President will issue the new line-up\nSOMETIME THIS MONTH, He HOPES TO MAKE A FEW CH A NGE S, f: SOME HERE,\nsome there. Now is the time to forward all suggestions*and* I\nhave. SOME ALREADY.\nThen there’s the question* of some prestige programming for the NAEB\nRadio Network, with help of the Educational Television and Radio\nCenter. Ken Wright’s Program Planning committee is Meet Ing early\nthis- month to consider recommendations.' Out of- this we hope to come\nup with something good.\nThere1s the problem of redistrioTi ng any or all regions.1 In particu¬\nlar, WE' HAVE THE TASK (REGION VI PEOPLE WILL SAY PLEASURE) OF DIVIO I NG\nRegion' VI. Sometime this monthY you in that ge'neral area will be\nASKED FOR YOUR SUGGESTIONS. YOU MAY WRITE WITHOUT BEING ASKED, YOU\nKNOW.\nVi/E MUST MAKE PLANS FOR TWO OR THREE REGIONAL MEETINGS THIS YEAR,\ntoo. Your suggestions will be welcome on this point. The meetings\nSHOULD BE HELD WHERE THEY WILL DO THE GREATEST GOOD FOR EDUCATIONAL\nBROADCAST ING.\nThere’s the consideration of educational radio and television semi¬\nnars AND WORKSHOPS, THE PROFESSIONAL ADVANCEMENT COMMITTEE IS CON9 •\nSJDER1NG THIS TOPIC, ALONG WITH THE BOARD, AND SOME DECISIONS WILL BE\nMADE AND ANNOUNCED EARLY NEXT YEAR. Tn FACT, A COUPLE ARE IN THE\nMILL NOW.\nS THE PROBLEM OF PROFESSIONAL STATUS, \"THAT SELF-SAME TOPIC\nwhich Vern Bronson expressed himself on convention floor. And\nCH MANY ANOTHER NAEBeR HAS EXPRESSED EQUAL CONCERN. Th I S, TOO,\nRECEIVE NAEB ATTENTION.\nThere’s the problem of working with all interested groups ano organi¬\nzations FOR THE GENERAL GOOD OF EDUCATIONAL RADIO AND TELEVISION,\nProgress toward solidification of efforts, elimination of overlapping\nFUNCTIONS, AND MAINTENANCE OF A STRONG FRONT IN WASHINGTON ON BEHALF\nOF EDUCATIONAL TELEVISION, HAS BEEN MADE OVER THE PAST FEW MONTHS.\nBut It’S A LONG PULL, AND ONLY TIME WILL INDICATE HOW SOME OF THESE\nPROBLEMS ARE SOLVED.\nThere’\nABOUT\nON WH I\nSHALL"
}