{
  "id": "d1409-1",
  "text": "EDUCATION BY RADIO\nis published by\nTHE NATIONAL COMMITTEE ON EDUCATION BY RADIO\nTracy F. Tyler, secretary\n1201 Sixteenth Street, Northwest, Washington, D. C.\nCommittee Members and Organizations They Represent\nArthur G. Crane, vicechairman, president, University of Wyoming,\nLaramie, Wyoming, National Association of State Universities.\nJames E. Cummings, department of education, National Catholic Welfare\nConference, 1312 Massachusetts Avenue, Washington, D. C., National\nCatholic Educational Association. .\nW. I. Griffith, director, radio station WOI, Iowa State College of Agri¬\nculture and Mechanic Arts, Ames, Iowa, National Association of\nEducational Broadcasters.\nJ. 0. Keller, assistant to the president, in charge of extension, Pennsyl¬\nvania State College, State College, Pa., National University Extension\nAssociation.\nJoy Elmer Morgan, chairman, 1201 Sixteenth Street, Northwest, Wash¬\nington, D. C., National Education Association.\nCharles A. Robinson, S. J., St. Louis University, St. Louis, Missouri,\nThe Jesuit Educational Association.\nJames N. Rule, state superintendent of public instruction, Harrisburg,\nPennsylvania, National Council of State Superintendents.\nH. Umberger, Kansas State College of Agriculture and Applied Science,\nManhattan, Kansas, Association of Land-Grant Colleges and Universities.\nGeorge F. Zook, director, American Council on Education, 744 Jackson\nPlace, Washington, D. C., American Council on Education.\nof communication. America has zealously defended freedom\nof the press, even to the point of permitting excesses and\nabuses rather than hazarding the dangers of the slightest\ncensorship. America has recognized the same principle in\nmaintaining the right of communication free and untram¬\nmeled for all citizens using the United States mails. Postal\nfacilities have been extended to every citizen, to the remotest\nhamlet, to the rural population—even at the expense of annual\ndeficits—in order to protect the right of universal communica¬\ntion. Telephone and telegraph have been made public utilities\nand common carriers of communication. Their service is open\nto all citizens who are able and ready to pay for it. The right\nof uncensored communication is the essential expression of\nfree speech. Without free speech and free discussion a govern¬\nment of the people cannot endure. It is the bed-rock of Amer¬\nican institutions.\nRadio broadcasting is the most potent of all forms of com¬\nmunication. It is instantaneous and universal. It speaks to\nliterate and illiterate alike. It calls a nation on instant notice\ninto a great public town meeting. If freedom of the press and\nof the post office, of telephone and telegraph, are essential to\nfreedom of speech, how many times more vital is radio. Public\nuse of this communication marvel of the century must be pre¬\nserved to insure America’s freedom of speech. It must not be\npermitted to come under the control of any limited body of\nmen or special interests. It must remain under public control\nfor public welfare. It is not a question of the character of the\nprivate control, however honorable and decent. America can¬\nnot safely entrust the means of universal communication ex¬\nclusively to any private control, since such control must be\ngoverned by the limitations of available time and channels\nand by the necessity for producing profitable income.\nThe National Committee on Education by Radio proposes\na plan for preserving for public use an adequate portion of the\nlimited broadcasting facilities as a protection to free speech.\nThe Committee is not attacking commercial broadcasters.\nThey have done a remarkably fine piece of work in many\nways. Our commercial stations often have been and still are\noffering much of their facilities for educational and nonprofit\nbroadcasting. These favors are appreciated, and, for that rea¬\nson, the plan proposed by the National Committee on Educa¬\ntion by Radio has been carefully framed to cause the least\ndisturbance, the least possible hardship to present broadcast¬\ners. In fact, the establishment of a parallel public broadcasting\n[;\nsystem would probably relieve commercial broadcasters from\nmany embarrassing demands and requests for broadcasts of\nnonadvertising character. The Committee is not protesting\nagainst advertising as such. To promote the sale of worthy\narticles is commendable. On the other hand, America’s free¬\ndom of speech for all men and all parties must not be con¬\nsigned to the inevitable censorship of a broadcasting system\ndependent upon advertising revenues for its existence. The\nplan proposed by the National Committee on Education by\nRadio is for the protection of free discussion, free dissemina¬\ntion of ideas, and universal enjoyment of the best America\nproduces in culture, entertainment, and information.\nThe plan asks only for a portion of radio channels, leaving\nthe major part of the limited available band for the use of\nprivate commercial interests. It does not ask for a definite\npercentage of the available radio frequencies. The amount\nrequired must be determined by technical experts and will\nchange as modern developments take place in this compara¬\ntively new art. However, is it unreasonable for the public to\nreserve even as much as one-fourth of the facilities of the air\nfor public use if merchandising still retains three-fourths?\nThe National Committee is not unappreciative of the many\nfine things put on the air by the private broadcasters. Adver¬\ntising of superior articles is commendable, but stations wholly\ndependent upon the revenues from merchandising can give\nonly incidental service to public welfare, and, inevitably, when\npublic welfare conflicts with advertising revenues, the cash\nreceipts must win. Such censorship is dangerous to public\nwelfare.\nThe new plan proposes to place the operation and control\nof a public system under national, regional, and state boards\ncomposed of leaders in American welfare. The members of the\nboards are to be carefully selected and safeguarded against\nthe vicious influence of political or private propagandists.\nUnder these boards would be the technical operators of sta¬\ntions and the managers of programs.\nThe public system, supplementing but not supplanting the\npresent private system, would give greater freedom of choice\nto the listener who, under all systems, finally pays the bills.\nBy a turn of the dial the listener could enjoy either a construc¬\ntive public program or the alluring charms of rejuvenating\ncrystals, the merits of toothpastes and mouthwashes, or the\nlatest scheme for selling something.\nThe public system would permit broadcasts to the public\nschools by master teachers, bringing stimulation to teachers\nand pupils alike, and connecting even the most isolated class¬\nroom with the best in music, literature, information, and\nentertainment. State stations have already demonstrated that\nbroadcasting improves school instruction. Even if general\nbroadcasts to public schools should increase the effectiveness\nof school expenditures a mere five percent, it would return\nadditional values worth one hundred fifty millions annually\non the three.billion dollar education bill. Private as well as\npublic schools are equally concerned in broadcasting values.\nIn neither public nor private schools is advertising, even tho\nunobjectionable, likely to be permitted.\nBy assuring affiliation with the national system for all non¬\nprofit stations, any local poverty of program material will be\nenriched by national hookups. All the genius of America would\nbe available for all.\nThe public system would maintain experimentation and re¬\nsearch in broadcasting technics to make this great agency,\nwhich so intimately enters American homes, of the most use\nfor public welfare.\n1"
}