{
  "id": "d1409-12",
  "text": "-12-\nslide projector in the control room, greatly reduced the initial cost. (See append\ndix for details). Antenna costs were kept at a minimum by mounting a special an¬\ntenna, designed by RCA, directly on the roof of the penthouse above the base hos¬\npital. Since the hospital is located on the highest ground on the base, it was con¬\nsidered sufficient height for the purpose. With this arrangement, the antenna cable\nwas, at the most, hO feet long and the antenna was radiating an effective power of\napproximately eight to nine watts from the ten-watt transmitter. The complete sta¬\ntion, including remodeling of the studio, transmitter, installation, and even two\nweeks of training for the personnel, cost less than $>0,000,\nThe bulk of the programming is done by the use of \"kinescope recordings\" that\nare loaned to the station by the commercial networks. No attempt is made to delete\nthe commercials. These kinescope films will be rotated from one station to another\nas the network grows. There is a time delay involved and the Limestone station was\nbroadcasting the New Year*s shows while a few hundred miles south the programs were\nconcerned with Valentine sentiments. There appears to be no reason to doubt that a\nsimilar operation could be carried on successfully by an isolated educational sta¬\ntion with the bulk of the programming being supplied by the kinescope center at Ann\nArbor.\nAfter a trial period of one year, the station was moved to more spacious quar¬\nters in a converted barracks building where the studio is eighteen by thirty feet\nand ample room is available for the transmitter, control room, and other facilities\nneeded for the broadcasting of films and slides. Nine people devote their full time\nto the operation of the station which broadcasts seven days a week from noon to mid¬\nnight. Special broadcasts are made outside these regular hours that are of interest\nonly to the Air Force personnel. Two professional type image orthicon cameras were\nadded to the original vidicon camera and all \"live\" pickups are done with these.\nThe vidicon is now used exclusively for films and slides in connection with a multi¬\nplexer unit, a job for which it is admirably suited. A mast was erected which raised\nthe antenna to 232 feet above the ground but the long transmission line reduced the\nactual radiated power to about four watts. The performance of this installation was\ndescribed in the second paragraph of this report.\nAn operation of this sort on a UHF channel would probably be more expensive\ninitially than on VHF unless some manufacturer produces a low-power, low-cost UHF\ntransmitter. For a locality where a channel is available, and an absolute minimum\nof live programming would be satisfactory for a start, this experiment at Limestone\noffers great promise. The writer is fortunate in having received an invitation to\nvisit the Limestone station soon, for there are indications that some of the clever\ntechniques developed there will be of interest not only to low-power stations but to\neducational broadcasters with more sophisticated facilities. Another report will\nfollow this telling what he finds of interest there,\nW, Worcester Smith\nChairman of the Engineering Conraittee\nWestern Mass. Educational TV Council,Inc.\n*A report to the Western Massachusetts Educational TV Council, Inc. and the National\nAssociation of Educational Broadcasters."
}