{
  "id": "d1409-5",
  "text": "TV Technical Tips No. 8\nMay, 1955\nCecil S. Bidlack, NAEB TV Engineer\nPerhaps public school officials and educational institutions should take a second\nand more exhaustive look at the proposal of the Federal Communications Commission\n(Docket 11237) on low power television stations. This would permit authorization\nof stations, with a minimum effective radiated power of 100 watts in cities of less\nthan £0,000 population without regard to antenna height above average- terrain.\nFor a practical application of low power television broadcasting, they can also\nbenefit from the experience of the new Armed Forces Television Service, which has\nrecently been in the trade news of the TV industry.\nAttention of NAEB headquarters was focused on the Armed Forces Television .Service\nby a report from Professor W, W. Smith of- WMUA and the University of Massachusetts\nat Amherst, Mass. His report describes, in some detail, the low power station at\nLoring Air Force Base at Limestone, Maine. Other information was secured by the\nwriter at the recent SMPTE Convention in Chicago where a paper was presented by\nMajor Stanley E. Rodby, of the Office of Armed Forces Information and Education in\nWashington, on \"Low Power Telecasting by the Armed Forces.\"\nThe Limestone, Maine station was the first and pilot model of these stations. Its\nequipment consisted of a single vidicon camera and control, a film projector, slide\nprojector, multiplexer, sync generator and necessary power supplies, monitors,\nspeech input equipment including microphones and turntables, a ten-watt .transmit¬\nter and antenna. RCA provided equipment for the initial station. The complete\nstation, including remodeling of the studio, transmitter, installation and even\ntwo weeks of training for personnel cost less than $50,000.\nThe bulk of the programming is done by the use of kinescope recordings loaned to\nthe station by commercial sponsors and agencies. No attempt is made to delete the\ncommercials. For live programming such as news, weather and other rather static\ntype programs, the vidicon camera was simply swung around 180 degrees on its mount\nand trained on the announcer or speaker in an 8 x 12 foot lighted booth.\nIt must be remembered that Limestone, Maine and other Armed Forces Stations are in\nremote areas, not serviced by any television station. While the live picture qual¬\nity of the vidicon camera left much to be desired, still the military personnel\nand their families living on these remote bases received a tremendous lift in mor¬\nale with the advent of the TV station.\nThe Armed Forces have stations on the air also in the Azores, North Africa and\nIceland. For these and other stations, equipment has been supplied by RCA, Dage\n(with Gates) and Electronics Research Laboratory* Technicians and other station\npersonnel are selected from qualified personnel on each post. Receivers are pur¬\nchased thru the Post Exchange for barracks, day rooms, officers* quarters and the\nhomes of service men*s families. The AFTS already has some 60,000 viewers for whom\nTV is the main form of recreation and entertainment. New stations will be in¬\nstalled at Thule, Greenland and Saudi Xrabia, with plans for other stations in Grea>\nland, Okinawa, Bermuda and Puerto Rico. So far all stations have been on VHF Chan¬\nnel 8 but the Puerto Rico station may be UHF to avoid possible interference problems."
}