{
  "id": "d1123-1",
  "text": "ERROR IN FCC FORM 340\nn\nFCC Form 340, July 1963, \"Application for Authority to Construct or Make\nChanges in a Noncommercial Educational Television, FM, or Standard Broadcast Station,\"\ncontains an error in Section IV, Statement of Program Service. The Commission has\nasked the NAEB to inform its members that persons who have obtained copies of this\nform should delete Item 4 of this section.\nFIRST REGULAR INSTRUCTIONAL TELEVISION FIXED STATION GRANT\nOn February 17, the FCC, through its Broadcast Bureau, made the first regular\ngrant for an Instructional Television Fixed Station. It went to the Plainview-Old\nBethpage Public Schools Central School District No. 4, Plainview, Long Island, New\nYork, to serve the elementary schools in that district.\nThe Plainview-Bethpage school system was among the first to test this type of\nsupplemental ETV service, under an experimental authorization issued to Adler\nElectronics (an NAEB Industrial Associate). Its regular service will carry instruction\nin library skills, science, safety, health, art, music, and social studies to pupils,\nalso instruction to teachers, and special material for Parent-Teacher Association\nmeetings. The facility will operate on 2506-2512 megacycles with 10 watts power.\nKRIEGER AND JORGENSEN TO PREPARE NAEB FILING ON MPATI PETITION\nWashington Attorneys Krieger and Jorgensen have been retained to prepare the\nNAEB filing with the FCC on the proposal of the MPATI for expansion and regularization\nof service. The comments will be based on the NAEB's study of technical and educational-\naspects of the MPATI operation financed in part by the U.S. Office of Education.\nComments in this proceeding (Docket 15201) are to be filed by April 3> a-nd Reply Comments\nare to be filed by June 3.\nUSOE AUTHORIZES NAEB TO NEGOTIATE SUB-CONTRACT WITH UNIVERSITY OF TEXAS TO PRODUCE\nUTILIZATION KIT FILMS\nOn February 27, the Educational Media Branch of the USOE approved the NAEB's\nrequest to sub-contract with the University of Texas to produce six color films which\nwill be used as the basis for six Utilization demonstration Kits about various aspects\nof instructional broadcasting. The Kits have been designed to provide material which\nwill orient teachers who are unfamiliar with methods and procedures for effective use\nof instructional broadcast materials. Eventually these kits will become part of a\nTeaching Materials library which will provide a library of materials to assist teachers\nand broadcasters in developing effective patterns of instructional television\nutilization.\nEDUCATIONAL MEDIA COUNCIL ANNOUNCES SPECIAL PRICE ON EDUCATIONAL MEDIA INDEX\nThe Educational Media Council has compiled a l4 volume index of reference guides\non the source, content, and cost of non-book educational materials such as films,\nkinescopes, filmstrips, slides, maps, videotapes, and other media materials. For a\nlimited time, this set may be obtained at a special pre-publication price of $56*95*\nor $74.45 with the 1965 supplements. After March 28, the price of these books will\nbe $62.45 and $79.95. The Educational Media Index is published by McGraw-Hill and\nmay be ordered from Thomas J. Murphy, Educational Media Index Project, McGraw-Hill\nBook Company, Inc., 330 West 42nd Street (19th Floor), New York, New York, IOO36. Be\nsure to indicate your membership in the NAEB clearly on all orders."
}