{
  "id": "d1334-3",
  "text": "-2-\nTUESDAY I STINGS OPENED WITH A BUSINESS SESSION in which the following actions\nwere taken:\nElections\nA nominating committee, consisting of Engle (chairman), University of Wisconsin\n(WHA): Coleman, Michigan State College (WEAR), and Steetle, Louisiana State\nUniversity (WLSU), presented the following roster of officers and directors:\nPresident - Richard B. Hull, Iowa State College (WOl) ^\nVice President - John Dunn, University of Oklahoma (WAD;\nSecretary-Treasurer - W. I. Griffith, Iowa State College (WOI;\nDirector Region I - Seymour Siegel, Municipal Broadcasting System of\nNex^j York City (WNYC)\nDirector Region II - Graydon Ausmus, University of Alabama (WUOA)\nDirector Region III - Harry Skornia, Indiana University (WFIU)\nDirector Region IV - Irving R. Merrill, University South Dakota (KUSD;\nDirector Region V - Ralph Steetle, Louisiana State University (,ILSU)\nDirector Region VI - James Morris, Oregon State College (KOAC)\nMotion by Abbot, University of Michigan, seconded by Menzer, University of\nIowa (USUI) and McCarty, Univorsity of Wisconsin (WHA). Carried unanimously.\nAuthorizations\n1. President and directors authorized to investigate and propose a new dues\nschedule which would enable the organization to double its income during\nthe next fiscal year. ~\n2. Authorized ^resident to appoint Dallas Smythe, former FCC director of\nstudies, now fellow at Illinois U. Institute for Communications Research to\nconduct a study as basis for a plan to establish cither an FM or a trans-\ncription network using a combination of present educational AM and I'M\nstations on a national basis. Study planned for completion and presenta¬\ntion to member January 1, 1948 (or as soon thereafter as possible) as basis\nfor plan to finance early costs of such an operation.\n3. Authorized the appointment of Marcus Cohn of Cohn & Marks, Wellington\nattorneys, as attorney for the National Association of Educational\nBroadcasters without cost or obligation to theAssociation. (It was under¬\nstood the Association would pay out of pocket expenses incurred by lx. Cohn\nsuch as telephone, telegraph, etc.)\n4. Authorized enlargement of expenditures for the Association newsletter\n5. Authorized the Board of Directors to propose and state the policy of the\nAssociation regarding television. This action waste take into consider¬\nation the probable ponding reallocation of television facilities by the\nFCG and if such reallocation of television channels.is to be made and\nadditional television channels to become available in other bands of the\nspectrum, that sufficient channel be set aside for possible educational\nuse. The authorization also required the Board of Directors to make clo^r\nto the FCC that educational institutions by virtue of their adminiotrative\norganization and direct responsibility to a tax-paying pub!Lie must of\n' necessity move slowly in such matters, and that failure to act with spe\nis not necessarily indication of lack of interest or inability to proceed."
}