{
  "id": "d489-12",
  "text": "-5-\nWHAT WAS STUDIED AND WHEN?\nAlthough the resolution calling for this study indicated only\nthat a study of programs dealing with racial matters be con¬\nducted, an examination of program titles and acquaintance with\nprogram content quickly proved this to be an impractical mandate.\nMany programs deal with racial matters - some directly, some\ninadvertently. The NET Festival starring Nina Simone is a racial\nmatter in some communities, but not in others. Who is to decide\nwhat constitutes racial content and what amount is necessary\nfor a program to be included in such a study? And is the absence\nof racial material in some programs an issue in itself? We do\nnot feel that these questions are best answered in the abstract,\nand we proceeded, therefore, to study the acceptance and rejection\nof all programs from NET''and NER>fwhich were listed as network\nbasic schedule or basic package.\nThe study covered a six-month period, beginning October 1, 1968\nand terminating March 31, 1969. By selecting an active period\nof network and station programming, we have avoided some reduced\nschedule operations in the summer and other kinds of special\nprogramming that may be less than typical of average station\nprogram practices.\nNERN provided their records of station program orders during\nthe period for use in the radio portion of the survey. Letters\nwere sent to each NERN affiliate in early summer, together with\ncopies of their program orders. Each station manager was asked to\nconfirm the accuracy of his order and to make comments on his\nreasons for rejecting programs which his station did not broad¬\ncast. Of the 158 stations surveyed, 56 stations offered detailed\ncomments about program selection policies of their stations,\nwhile several others returned their forms without further comment.\nStatistics for stations which did not return forms were compiled\nfrom existing NERN data.\n*\nAlthough there are other national program services, only NET\nand NER provide what could reasonably be called a basic schedule.\nNET's scheduled service is, in fact, the more traditional net¬\nwork operation. NER provides a slate of programs from which\nthe stations select. Only by inference from what was selected\nis it possible to consider that the stations rejected certain\nprograms. With the NET service, stations must specifically\nreject the scheduled service program if they choose not to broad¬\ncast it."
}