{
  "id": "d489-16",
  "text": "-8-\nILLUSTRATIVE COMMENTS ELABORATING ON\nVARIOUS STATION PROGRAM POLICIES\nAlthough individual comments range from monosyllabic \"dulls”\nto rather pungent paragraphs, most statements pertaining to\nprogram choices fall into a number of specific categories.\nThese are listed below, accompanied by references to specific\ncomments by station managers. Categories are listed in what\nappears to be their order of importance as causes for the\nrejection of either individual programs or groups of programs.\nI. Budget Limitations\nMost stations are limited by their NER membership\nclass to a prescribed number of chargeable hours\nper year, generally divided equally among the\nquarters. Stations which do not divide their pro¬\ngram hours equally often find their resources de¬\npleted by the 3rd or 4th quarter. Even among\nstations which do divide their hours equally, the\nmost common reason for the rejection of any program\noffering is lack of chargeable hours. For this\nreason, continuing series are frequently rejected\nor carried for only one quarter. Fairly typical\nexplanations of this problem include the following\ncomments: \"Another reason some programs were not\nordered was that most of the continuing series,\nin themselves, usually make up the major portion\nof the 65-hour limit under the network fee. Not\nmore than a few new series can be ordered without\nadditional charges.\" - WFSU-FM, Tallahasse, Fla.\n[Many prog rams]\" we re not selected simply because of\nlimited air time available coupled with the fact\nthat the number of hours we can take from NER with¬\nout incurring an ’excess' charge is limited.\" -WOI-AM/FM,\nAmes, Iowa. \"Lack of additional funds for adult\nprogramming. We are basically an instructional\nservice for the public school system.\" - WTHS-FM,\nMiama. Fla.\nII. Scheduling Limitations\nThe absence of available time in station schedules\nwas mentioned more often after financial considera¬\ntions than any other reason for the rejection of NERN\nprogram offerings. Some stations cannot accommodate"
}