{
  "id": "d489-48",
  "text": "-39-\nFURTHER COMMENTS ABOUT PROGRAMS\nNOT ACCEPTED FOR REASONS OF CONTENT\nThree programs were rejected with considerably higher frequency\nthan mojt others: NET Playhouse, NET Journal and Black Journal.\nThe reasons for not accepting such programs were inevitably\ntied to local concerns and anxieties.\nThe NET Journal program, \"Fidel,\" was rejected by WFSU, Tallahassee,\nbecause of concern about balance. It was considered pro-Fidel\nand gave an incomplete picture, \"leaving the viewer with false\nimpressions.\" Although the station carried other controversial\nprograms, this was rejected because the management did not f6el\nit could \"justify to its higher authorities\" scheduling the\nprogram. WCMU, Mt. Pleasant, Michigan, also reported that the\nprogram carried \"too much propaganda, was too one-sided, and\nthat viewers would not have waited for a panel discussion at the\nend.\" Another station, KLVX, Las Vegas, labeled it \"sugar-\ncoated communism.\"\nAn NET Journal program, \"Diary of A Student Revolutionary,\"\nwas not selected by KLVX because \"we had our own...no additional\ninstruction was necessary.\" The program, \"Some of Our Best\nFriends,\" was not accepted by WSJK, Sneedville(Knoxville)\nand WKNO(Memphis), because of profanity. An NET Journal\nentitled \"The Drinking American\" was not accepted by KLVX\nbecause it was felt that a more \"seasonal program for program\nbalance and color\" would be more acceptable.\nSeveral NET Journal programs and Black Journal programs were\nnot carried by KETS, Conway, Arkansas, because of program\ncontent. The station has reported that each program was not\nnecessarily rejected for objectionable content, but was re¬\njected because program personnel were not available to preview\neach one before broadcast.\nThe NET Playhouse was rejected by stations for several similar\nreasons, generally dealing with obscenity or topics that were\nfelt to be offensive to local viewers. For exemple, \"Theatre\nin America--New Theatre For Now,\" was rejected by WCNY, Syracuse,\nbecause it did not\"conform to local standards of taste\" and\ninvolved \"gratuitous obscenity.\" WKNO, Memphis, identified\none play in this program as \"having offensive language and\nsuggestive material.\" WRLK, Columbia, S.C., referred to it"
}