{
  "id": "d489-77",
  "text": "RESOLUTION OF THE NAEB PROGRAMMING PRACTICES COMMITTEE\nSUBMITTED TO NAEB BOARD OF DIRECTORS FOR ADOPTION\nAT THE 1968 NATIONAL CONVENTION\nAll noncommercial broadcasters must continue to be concerned\nwith the development of programming responsive to the broad\nneeds of the large segments of our population which are cul¬\nturally different and to a large extent black. These needs\nare urgent and immediate.\nTherefore, be it resolved that; NAEB individual members,\ninstitutional members, and stations initiate action leading\nto additional programming that will significantly meet the\nneeds of Black Americans.\nBe it further resolved that: Additional steps be taken to\nascertain how the needs of all poor people in our society\nmight be served programmatically with appropriate action to\nbe taken as soon as these needs can be identified.\nBe it further resolved that; Each member station of the NAEB\nbe urged to adopt as official policy the above resolution and\ntake all necessary steps to implement this commitment. It is\nurged, therefore, that stations develop positive sensitivity\namong all levels of station personnel toward the target audi¬\nences and that the minimum implementation consist of naming\none staff member who shall be charged with the responsibility\nof: (1) maintaining liaison between the station and the target\naudiences; (2) conducting internal training which will assist\nstaff members in establishing ties with the target audiences;\n(3) lending special expertise for programming in this area.\nBe it further resolved that: The NAEB should demonstrate its\nactive commitment to a philosophy encouraging social program¬\nming by member stations by the continuance of the office of\na national director concerned with this area. It is recom¬\nmended that the director shall have at least the following\nminimal responsibilities which are: 1) to provide frequent\ndetailed reports to member stations and individuals on pro¬\ngramming, training activities, and employment of program\npersonnel. He shall explore all flexible, imaginative means\nof disseminating this information; 2) to develop a compre¬\nhensive knowledge of potential funding and procedures- relevant\nto all public and private sources; 3) to be available for\nconsultations, organization of workshops, and to assist local\nstations in their specialized program development; 4) to\nwork with the NAEB Personnel Service to develop a program\npersonnel information bank which can readily assist local\nstations in their desires to hire qualified, creative staff\nfrom minority groups."
}