{
  "id": "d489-78",
  "text": "EDUCATIONAL BROADCASTING CORPORATION\n304 W 58TH ST/ NEW YORK 10019. NY/ LT 16000\nSeptember 20, 1968\nMr. William Harley\nPresident, NAEB\n1346 Connecticut Avenue\nWashington, D.C.\nDear Bill:\nThe Programming Practices Committee, in its meeting of September 17 and 18, unani¬\nmous lyarrived at the-enclosed resolution to be presented to the Board of Directors\nand the NAEB membership. We have taken the liberty to send copies of the resolu¬\ntion and our letter to you to the NAEB Executive Board and Executive Staff before\nthe convention.\nThe committee was extremely anxious to function until the successful implementation\nof the enclosed resolution. The members felt very strongly that I convey to you\nand members of the board their willingness to meet at any time, at any place, with\nmembers of the board to discuss and amplify the resolution.\nWe must compliment the work executed by Ken Clark; therefore, we would hope that\nthere would be no lag in the work he has begun. The staff at NAEB should proceed\nwith the continuation of the project until the resolution is acted upon or until\nhis replacement can be found.\nWe hope that prior to the enactment of the enclosed resolution at the NAEB meeting,\nthat the NAEB headquarters staff begin to implement ways and meand of developing\npositive sensitivity among the staff toward the culturally different.\nIt was obvious to the committee that funding for these endeavors is necessary.\nTherefore, we felt that it is implicit in the resolution that the NAEB staff begin\nimmediately to locate sufficient funds to fully carry out the recommendations of\nthe committee.\nBill, the successful meeting of this committee was, I believe, due in large measure\nto the makeup of the group. I cannot thank you enough for being a part of the\nselection of these members. Each and every individual contributed to the discussion\nand the formulation of the resolution. I look forward to seeing you at the NAEB\nconvention. Best wishes.\nfin npovol tt\nRichard J. Meyer\nChairman, NAEB\nCommittee on Programming Practices\nRJM/bg\nEnc.\ncc: NAEB Board of Directors\nNAEB Executive Staff\nNAEB Programming Practices Committee"
}