{
  "id": "d1790-1",
  "text": "NAEB NEWS LETTER .... IT. ay 1, 1941 .. Page 2\nWHA WINS INCREASED OPERATING BUDGET\nStarting on July 1, WHA will expand its broadcasting service\nas a result of the substantial budget increase granted by the\nWisconsin Legislature for the State Station., The budget boost\nis approximately 90 per cent over that of the past biennium*\nThe results of the increase will be longer hours of operation\nmornings and on Sundays, funds for administering the Wisconsin\nSchool of the Air, equipment improvements and salary adjustments*\nA second measure is now before the Legislature to appropriate\nmoney for a new antenna*\nEnrollments for the Wisconsin School of the Air totalled 325,049\nas of April 1. More than 16,000 school classes use the broadcasts*\nFourteen series of programs are now being presented by the School\nover WI1A. The series are: Afield with Ranger Mao, This Our\nDemocracy, Storybook Land, LeVs Draw, Good Reading, Living\nLanguage, Letfs Find Out, Journeys in Music Land, Music Enjoyment,\nFicture Studies, Our Wisconsin, Rhythm and Games, The French\nProgram, and Book Trails,\n0N-T1.E-G0 AT KWSC\nKenneth E* Yeend. Director of KWSC, reports on activities for\nhis station in these words|\n\"Six daily United Press news broadcasts have given a boost to\nKWSCfs radio audience. Through work of the KWSC staff, other\ndepartments on the campus, and the Associated Students, the\nfunds were raised to install a teletype machine in the .KWSC\noffices, Now it constantly beats out the news of the world\nfor KWSC* s news broadcasts.\nBecause of the great success and growing recognition this\ninstitution is achieving in training and placing radio students,\nthe Department of Speech at the State College of Washington\nis now offering a four-year course in radio speech.\nPerhaps the crowning achievement in sports broadcasts for KWSC\nwas bringing a direct report of the National Basketball Champioa-\nship game between the State College of Washington and the\nUniversity of Wisoonsin direct from Kansas City, Cooperation\nof the Puilman townspeople, the faculty, and students made it\npossible for the funds to be raised to handle the expense of\nthe leased v?ire. KWSC* s own sport announcers handled the\nplay-by-play description of the Coast Championship series\nbetween WSC and Stanford, and also translated telegraphic\nreports of the Creighton-W3C and the Western Championship\ngame between the Washington State College Cougars and the\nArkansas Razorbacks into play-by-play reports for the Cougar\nfans of the Inland Empire. This series of sport events brought"
}