{
  "id": "d1808-6",
  "text": "-7-\non timely subjects from the College of Agriculture. The Agricultural Extension\nService presents a half-hour program once a week from Omaha over a state-wide\nnetwork,\nNEW JERSEY - Rutgers University continues its broadcasts in the field of Agri¬\nculture and Home Economics, These programs are broadcast over the Mutual Broad¬\ncasting coast-to-coast network from station WOR,\nNEW MEXICO - The University has conducted a weekly fifteen minute musical broad¬\ncast over station KOB, Station KGGM, Albuquerque's other commercial station, also\noffers an outlet for programs. The College of Engineering is installing a 350\nwatt transmitter for short wave broadcasting. Courses are offered in radio play\nproduction and radio play writing,\nNEW YORK - Columbia University offers courses in radio writing and in production\nof radio programs, Students will participate in radio dramatic productions over\nstation WIXE.\nSyracuse University maintains a radio workshop. Professors and students\nparticipate in broadcasts. The workshop also cooperates with civic and profes¬\nsional groups,\nNORTH CAROLINA - The University of North Carolina owns and operates its own radio\nstudio opened in January, 1940. The studio activities are under the direction\nof the Radio Department, a subsidiary of the Extension Division, with R. W.\nMcDonald as head of the Radio Department and Program Director, Each department\nof the University which produces radio programs is organized with a representa¬\ntive in charge of its radio activities. Ten radio stations in North Carolina, in\naddition to the Mutual Network, carry regular University programs each week.\nNORTH DAKOTA - The University owned station, KFJM, operates with 1000 watts day\nand 500 watts night power. The University uses the station for an hour and a\nhalf each day and rents the remainder of the time to a commercial lessee. A\nRadio Council is being organized to increase the service facilities of University\nprograms•\nOKLAHOMA - The University of Oklahoma owns and operates station WNAD. Plans\nare under way to improve equipment and to operate a full daytime schedule with a\nchange of frequency. From WNAD programs have been carried throughout the state\nover a network of six or eight stations. H. R. Heck of the Extension Division\nhas been active in a proposed organization of a state radio council to stimulate\nand promote public service broadcasting.\nOREGON - Station K0AC is state owned and operated under the supervision of the\nState Board of Higher Education. University students broadcast an average of\nfour hours per week in the fields of news, poetry, music, drama, and quiz pro¬\ngrams. Faculty members also broadcast about four hours per week. These broad¬\ncasts are made over K0AC at Corvallis by remote control from Eugene. Three reg¬\nular radio courses are taught.. New studios and new equipment are being secured."
}