{
  "id": "d373-0",
  "text": "EDUCATIONAL TELEVISION STATIONS\n\\j£j\nA division of\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nPHONE: 667-6000 • 1346 CONNECTICUT AVENUE • WASHINGTON, D.C. 20036\nJuly 30, 1968\nFifth Report on Programming for the Disadvantaged\nKen Clark, Project Director\nIf any of you thought this particular summer might squeek by without\nany civil disturbances, news in recent days of Cleveland, Gary, Akron and\nGrand Rapids have surely suggested something else.\nNo one believes television programs for, about or even by the dis¬\nadvantaged people of America will stop unrest or violence. But as broad¬\ncasters engaged in the demanding mandate of communications, do we not\nshare a common necessity to try?\nSome stations have been trying very hard. Let's look at WTTW,\nChicago; KCED, San Francisco; WTVS, Detroit; and WCED, Pittsburgh.\nWTTW conceived of a 26 weeks sociological-variety series called\nOUR PEOPLE. The station went after funding and found it in Illinois Bell\nTelephone and Western Electric. The program went into the schedule May 9th\nof this year. According to Edward L. Morris, Director of Programming at\nWTTW, this is the first program of its kind for the Negro community. It is\na magazine format featuring news, entertainment and public service segments,\n£lus_a weekly guest, a Negro who has achieved success in his own area of work\nThe guest segment is fashioned after the \"Person to Person\" idea with\nthe host visiting his guest. . . . talking to him. . . . asking questions of him that\npertain to living productively as a human being who happens to be Negro.\nThe quest segment runs about 25-30 minutes. By design an outstanding\nwoman from the black world is featured every third show. Celebrities are\nwelcome, but not stressed. Ed Morris says \"Accomplishment and articulatene\nare the bench marks. \"\nOther features of the series included:\n\"Club or Organization of the Week\" (5-8 minutes) in which a Chicago\narea organization is recognized for its activities. Both specific projects and\nindividual efforts are underscored and a liberal use of film excerpts is made.\nWhy is this segment important? The black community has never before had"
}