{
  "id": "d373-1",
  "text": "-2-\nthe media showcases open to the white world. OUR PEOPLE provides that\nshowcase.\n\"Buyers Guide\" uses a consumers report approach which makes the\naudience visually and narratively aware of the price and qualitative difference\nin goods and services available to them, i. e. , appliances, used cars, insurance\nprograms etc.\n\"Buyers Alert\" warns the viewers about specific types of fraud and\nshoddy merchandise. This 5-8 minute segment also periodically tackles advice\non financial matters such as credit buying, loans etc.\n\"Job and Educational Opportunities\" (6-8 minutes) uses guest experts,\nfilm reports and a special reporter to hit an intended young adult audience.\nThe emphasis is on job-training openings and post high school education. It\nalso includes general employment opportunity news for Negroes.\n\"Cuestion of the Week\" (5-8 minutes) permits Chicago area blacks to\nask questions on medical, educational, public safety issues etc. of local in¬\nformed institutional representatives. For every program approximately twenty\nfive people are interviewed, questioned and their answers on sound film edited\nto provide six to eight questions for that program's institutional representative.\nThe questions and answers are inter-cut. The questions are limited to one\narea to reach for a depth response and go along the general line of \"If you could\nask the Superintendent of Schools one question, what would you ask him?\n\"Action Line\" uses a phone tape arrangement, inviting viewers to\nmake complaints, ask questions etc. The program follow-up these calls\ndirecting the viewer's special interest to the right source for answers.\nPreviously frustrated or intimidated audience members can get their answer\nnow;\nThe entertainment segment of OUR PEOPLE features a different Negro\nartist or performer each week. . . . but the entertainment is featured throughout\nthe entire program for the sake of transition and pace.\nOUR PEOPLE is enlightening; it does not patronize.\nOUR PEOPLE crosses all economic lines; it is not psuedo-intellectual\nmish-mash.\nOUR PEOPLE is aiding the black community of the Chicago area in\nthe bewildering, often frustrating task of self discovery.\nWhat about staffing? WTTW has hired three Negroes full time to host\nthe series, to serve as production assistant and liaison with the Negro com¬\nmunity, and as reporter-researcher in that community. Additionally, the"
}