{
  "id": "d373-15",
  "text": "2\nKDPS has also just completed a one-year trial run for in-school\nlistening, beamed at the fourth through sixth grade levels in local\nDes Moines schools. A weekly, ten-minute segment entitled \"Mr. Achiever\"\nencouraging incentive, impetus, ambition, and especially self-believability.\nThe yardstick here: 1,500 letters in one year ... and that. Friends ...\nfor an in-school broadcast to youngsters I The series is being continued\nand a new one started for grades one through three.\nOne other salvo from KDPS: Ezell Wiggins is at the station because\nhe is talented; he is not there for window dressing. Two Negro adults\nhave also recently been added to the staff writer-poducer Carl Williams\nand Jim Reed who will work primarily with the Des Moines Public Schools\nITV projects.\nCONTACT: Dwight Herbert, Radio Director\nWFSU-FM, Tallahassee had a problem that others of you may share.\nHaving built up a sizeable audience of sophisticated, well-educated,\nmiddle-to-higher income bracket listeners, programs for the disadvantaged\nseemed suicidal. At the same time. Manager Marjorie Newman felt her\nstation had to move with the mainstream. Her answer: to aim productions\nat the known audience in an effort to promote action ... recognizing that\nmany of WFSUTs listeners xvere in a position to do just that.\nEarly this year, WFSU broadcast the series, \"The Quest for Equality\",\ndiscussions moderated by the chairman of the Sociology Department at\npredominantly Negro Florida A & M University. Faculty and community\nmembers centered on problems and aspirations of the Negro in the United\nStates in general and Tallahassee in particular.\n\"Problems of the Inner City\" took up a sociological analysis of\nurban disorganization, the Detroit riot and the Tampa riot and other\ntopics that have shaken loose traditional ideas about urban living.\nA new series is now being recorded concerning teaching Black history\nin the public schools. The first two:\n1. Omissions of black history and culture through a survey\nof textbooks used in Florida.\n2. The effects of these omissions on black and itfhite populations.\nFor the future, WFSU looks with hope toward the day when it can\ninstitute a second service for the black inner city.\nCONTACT: Mrs. Marjorie Newman, Manager\nWUWM, Milwaukee is in the movement to stay. Dr. Ruane B. Hill,\nDirector of the University of Wisconsin station reported a number of\nprojects that have provided some unique reactions.\nFollowing initial publication of the Kerner Commission Report, WUWM\naired a one-hour discussion of the Report by two University professors\n(one black, one white), and the pastor of a Milwaukee core area church"
}