{
  "id": "d373-198",
  "text": "-4-\nprogram will be residents of the area. For a second time, the station has\ntelevised live a neighborhood meeting of the Boston School Committee from a high\nschool in the ghetto, and will televise a third from another location this week.\nEarlier this month, \"Volunteer--Why Bother?\" showed how young people are\ntrying to do what M. I. T. Professor Jerome Lettvin urged last fall on \"Lettvin\nTuned In\" when he forcefully told his audience to \"reach out\", not \"drop out. \"\nWGBH's monthly \"Law Enforcement and Criminal Justice\" continues, with par¬\nticipation by over 400 law enforcement agencies in New England, through a\ntelephone feed-back system and the cooperation of 16 television stations in the\nregion.\nWXXI, Rochester, New York, will broadcast \"In Our Time: Riots and their\nCauses\", the first in a series with Paul H. Douglas, former Democratic senator\nfrom Illinois and chairman of the President’s Commission on Urban Problems.\nOther New York State stations have co-produced and broadcast the EEN specials -\n\"Help Wanted\" (WNED), \"Talking Black\" (WNDT), and \"The Visual Generation\"\n(WCNY).\nWBGU, Bowling Green, Ohio, produced a half-hour film, in cooperation\nwith the Ohio Department of Education, Division of Federal Assistance on the\neducation of the children of migrant workers.\nIn Pennsylvania, WHYY (Philadelphia) cooperated on the production of\nEEN's \"Help Wanted\", and WITF (Hershey) and WOED (Pittsburgh) worked on\n\"The Visual Generation. \"\nIn Texas, KUHT (Houston) devoted one session of a monthly discussion\nprogram to \"Racial Understanding in Houston\" (reported by KUHT’s Phil\nZimmerman at April 21, ETS meeting). The station manager and the mayor of\nthe city were with the editor of the Houston Chronicle, a black minister, a young\nblack militant, a Negro state legislator, and a viewing audience that kept five\ntelephone lines operating at capacity for three and one-half hours. A second\nprogram ran longer. A commercial station in Houston followed KUHT's example,\nwith similar results.\nKYVE, Yakima, Washington, has started a TV job program.\nKDPS, Des Moines, Iowa, is reevaluating their earlier jobs program which\nran into unexpected difficulties.\nProbably the most ambitious special project at the statewide ETV level\nwas the week-long effort by the University of Wisconsin extension division (re¬\nported in the planning stages in the first Addena to \"Report on ETV in the Ghetto.\")\nDuring the week of April 29 - May 3, WMVS-TV, Milwaukee, WHA-TV, Madison,\nand the state's 11-station educational FM radio network, and even some volunteer\ncommercial AM stations, broadcast programs in prime evening time running up\nto two and one-half hours a night under the heading, \"The Inner City. \" Panels\nattacked problems of housing, education, business community relations, the"
}