{
  "id": "d373-22",
  "text": "2# Berkman to Harley, 19 July, *68\n(?)\nBill, if thesememorials to the doctrine that scavenging can never substitute\nfor substance, don’t add up to an indictment of the medium, I’d sure hate like\nthe devil to have to he the guy who had to rests its defense on these two col¬\nlections of trivia! /The first thing I would do if I were attempting to satirize\nthis situation, would be to assemble a document which attempted to justify\nSTV’s service to blacks by noting that the Roanoke station, really, honestly,\nactually, honest Injun, put on a 20-some-minute tribute to Martin Luther King#\nHal-Luli-Lu-Yuh!!!]} In short, I see virtually nothing here indicating Southern\nstations aren’t doing anything more than they didn't do last November! And\nwhjy is there no attention to the key question here of Southern station clearance\nof NET or PBL material on race? O'/hen I brought thills thing to a head at\ntiie Convention, I really never doubted iTTSfe— nor did I particularly care!—\nthat one Southern outlet might see its way to honoring a lb:# King on his\ndeath*) WHERE IS THERE ANY INDICATION IN MYERS’ EFFORT THAT THE DEEP SOUTH\nSTATIONS HAVE GROSs/kEGATED THEIR MANDATE AS LI CASSES TO SERVE THEIR TOTAL\nCONSTPOTENCIES? Where is this gross omission at'least; pointed up^ if not\nquestion— let alone condemned??? (Yes, I did note that one entry for one\nstation, WYES, on its black-white confrontation# But where is there anything-\nthat would let me know that none of the half-dozen Alabama outlets serving\na non-white population of could cite even a single effort???)\nYour letter; *\nin which I was f:- m struck by a rather marked contradictions It is imperative,\nyou wrote, to4irst collect relevant data before calling the personnel committee\ntogether. ^Though, as noted above, the really relevant data seems the one type\nv;e won’t be collectingj7 Yet at the same time, you indicate a three-step-ahead-jump,\nin that staff hiring has begun in order to place a program into operation#\nBill, no Committee of which I'm a part will rubber stamp any fait accompli\nwhich has nothing more to recommend it than that it is an accomplished fact,\nwithout the most vigorous minority dissent, if only from a minority of one#\n(incidentally, I’m fascinatedly your lack of any reference to the questions\nI raised with regard to the Kafka-esque choice of the person to chair this\ncommittee. Am I to assume your omission speaks for itself?)\n‘Zur*%:\nIn.short, all your letter, Myers!Adocument*, and Hungerford's memorandum tell mer\nis^that the committee on personnel is still unscheduled to meet with the Summer\nalmost half-over and but three months remaining until the Convention to which\nwe are to make our report and recommendations; and),that the Southern stations are,\nin fact, as thoroughly remiss in their refusal to serve their black constiuencies\nas I originally contended#\nTherefore, as simply and as directly as possible— anything beyond simple Yes's\nor $o’s would really be superfluous— will you answer these questions:\ntS (l) Will the HASB go on record—especially now that the FCC has ruled that a\nstation’s hiring practices are a legitimate criteria in determining its right to\nhold a license— in stating that|Lt is incumbent upon all of its members to\nhire and staff at all personnel levels, up through top management, in such a\npmer as to insure an equitable racial balance?\nWill the NA3B issue an unequivocal statement that it is wrong for an ETV sta-\n* tion to refuse to carry a program containing .paggrigl on racial matters simply\nbecause the dominant racial constituen^'night\"raise\"objections or withold support?\nWill the NAEB give teeth to such pronouncements by conducting, and making\nr public, a study designed to show whether or not each of its member stations are\nimplementing 'these polcies?"
}