{
  "id": "d373-26",
  "text": "3\nAnd what about the Welfare Rights Mothers? TheyTve stayed together\nto press for legislation affecting them; they are functioning with\na new sense of identity. One TV program didnTt do it all; but it\nhelped.\n’’The Deer People of Athens” told the story of a group of 70\nMexican-Americans, migrant workers who were moved by their employer\ninto an abandoned high school near the center of a very small town.\nThe repercussions were immediate. The program tells it like it is,\nand like it will be next year, and the year after, until people begin\nto look at each other as human beings instead of freaks.\nCONTACT: Martin Gal, Producer, WMSB\nSpecial attention is called to the 1968 URBAN BROADCASTING WORK¬\nSHOP to be held at the American University, Washington, D. C. during,\nthe month of August.\nSix Washington, D. C. broadcasters and the Department of Com¬\nmunication at American University have developed a program to attract\nand train promising urban and minority group students for work in the\nradio-television industry. The plan is simple and effective:\n1. Select high school juniors of promise (with aid of school\ncounselors, NAACP, Urban League, etc.)\n2. Provide a tuition free, intensive workship for them during\none month in the summer.\n3. Select the most promising of the students for eventual\ndecision-making positions in broadcasting; keep in touch\nwith them during their senior year of high school; motivate\nthem, encourage them to do their best during their last,\ncrucial year of high school.\n4. Provide scholarships and loans for the students selected so\n. they can attend college.\n5. Provide summer broadcasting employment for the students\nselected.\n6. See that students are placed in a broadcasting job upon\ngraduation.\nThe plan suggests what can be achieved by cooperation between\nbroadcasters and a local university. This is the second year of the\nproject. Can any of you in other parts of the country start a similar\nworkshop?\nA less elaborate, but just as exciting project is underway at\nWTHS-TV, Miami where eleven disadvantaged youths from the Neighborhood\nYouth Corps have been hired for the summer to learn both on and off\ncamera skills. In addition, a special tutoring course is being pursued\nwith the eleven. As producer Bea Baxter puts it, ’’Soul Talk is an O.K."
}