{
  "id": "d373-34",
  "text": "THE FLORIDA STATE UNIVERSITY\nTALLAHASSEE 32306\nWFSU-FM RADIO\nUNIVERSITY BROADCASTING SERVICES\nJuly 10, 1968\nMr. Kenneth Clark\nProject Director, Programs for the Disadvantaged\nNational Association of Educational Broadcasters\n13^6 Connecticut Avenue, N. W.\nWashington, D. C. 20036\nDear Mr. Clark:\n\"7\nI*m delighted that NAEB is taking an active role in promoting\nprograms~f6r~ljSe disadvantaged and-Organizing this \"on a naTionaU’\nbasis.Wi~have done, and currently are producing, some things that\nmay be of interest to you.\nAs is probably the case vith many educational radio stations, ve\nhave on the basis of past programming built up an audience that is\nsophisticated, veil-educated and in middle to higher income brackets.\nThis has been a barrier to our broadcasting programs intended directly\nfor the disadvantaged. I feel that unless ve devoted a sizable portion\nof our broadcast day to this group ve could not interest it in listening\nto FM even if sets vere available. We have therefore aimed our productions\nat the audience ve knov listens, hoping to promote action on its part\nsince many of these listeners are in positions in the community in vhich\nit is possible to do so.\nt S During last February and March ve broadcast a series called \"The\n^ Quest for Equality” vhich vas produced here. These vere a series of\n^ discussions moderated by the chairman of the Sociology Department at\n/ Florida A & M University (predominantly Negro). The discussions by\nfaculty and community members vere centered around the problems and\naspirations of the Negro in the United States in general, and Tallahassee\nin particular. Individual topics for the seven programs vere:\n1. Historical perspective for race relations today\n2. Objectives and activities of various civil rights groups\n3. Employment and housing\n4. Education\n5. Political participation of Negroes in American society\n6. The role of the Church\n7. The future of the Quest for Equality\nThe programs may be of interest to you even though a portion of each\nvas devoted to specific conditions in Tallahassee."
}