{
  "id": "d373-49",
  "text": "DES MOINES PUBLIC SCHOOLS\n88.1 fm\nDEPARTMENT □ F RADIO AND TELEVISION\n1800 GRAND AVENUE\nDES MOINES, IOWA 50307\nJuly 3, 1968\nMr. Ken Clark\nNational Educational Radio\n13^6 Connecticut Avenue, N.W.\nWashington, D.C.\nDear Mr. Clark:\nI was most pleased to recieve your memo of June 27, and to realize\nthat there is concern on the part of other non-commerciaXTroaHcaiters\nas to what our radio stations might do to help callirr^ial~uhYestT\nTo directly answer one of your’questions... no, Des Moines doesn’t\nknow what Boston is doing.’ ...and I'll h'et that Boston doesn't know\nwhat Des Moines is doing (unless they read \"Billboard\" magazine). I\nhope that your office can truly a'ct as a clearinghouse for new ideas.\nWe, in Des Moines, have realized for some time that public broadcasting\ncan have a profound influence on minority groups, and have begun a\none-hour nightly program aimed at the negro audience. Although\nwe do not believe that \"'block\" programming has any impact on such an\naudience, (especially .if the station is \"Fine Arts\" oriented) we have\nset up this one-hour segment as part of our total programming concept.\nDuring this one-hour, each night, we program \"soul\" music, and in-between,\nwe drop-in short (one or two minute) educational, cultural, and philosophic\nvignettes aimed at the negro audience...especially the negro teen-ager.\nWe operate much as a commercial station, using the music as the \"draw\"\nand instead of commercials, we program our educational vignettes. Knowing\nthat the negro audience is very news oriented, we also are strong on news\n(a 15 minute summary is part of this hour). We are also programming job\nopportunities with the assistance of the State Employment Office here in\nDes Moines.\nThis \"soul\" hour (9 PM to 10 PM) is followed by a jazz program which is\nappealing to both black and white, so I guess you could say that we are\ndevoting two hours each evening to the negro audience."
}