{
  "id": "d373-64",
  "text": "Page 2\nETV REPORTER\nJune 26, 1968\nTHE PUBLIC BROADCAST LABORATORY GOT A NEW LOOK LAST WEEK AS NET ANNOUNC-\ned a reorganization of the operation for the upcoming season. Av Westin will continue as Exe¬\ncutive Director of PBL with operational responsibility for all productions.\nFrederick M. Bohen, recently Staff Assistant to President Johnson and former Assistant Dean\nof the Woodrow Wilson School of Public and International Affairs at Princeton University, has\nbeen appointed Executive Editor. Both Westin and Bohen will report to NET President John\nF. White, and through him to the NET Board.\nIn addition, a programming committee, of which Westin and Bohen will be members, has been\nestablished to advise on program objectives and editorial policies. Other members will include\nWhite and several representatives of the public to be named shortly.\nNET said that the PBL reorganization is largely the result of appraisals by the former Edi¬\ntorial Policy Board, which recently reported to the NET Board and asked that it be dissolved\nin order to leave the officers of NET \"free to take such steps as they think appropriate in de¬\nveloping the second stage of the PBL experiment. \"\nA RECORD NUMBER OF EXHIBITORS WILL OFFER DISPLAYS AT THE 17TH ANNUAL CON-\nvention of the National Cable TV Association June 29-July 2 at the Sheraton-Bos ton Hotel, Bos¬\nton. Approximately 75 exhibitors will show their hardware and software in 183 booths, a 19%\nincrease over last year's show. Information about the Conference is available from NCTA,\n1634 Eye St., N. W., Washington, D. C.\nETV STATIONS HAVE AIRED OR PLAN TO BROADCAST SHORTLY MORE THAN 1, 000 SPE-\ncial programs for the disadvantaged, according to the \"Third Report on Programming for the\nDisadvantaged,\" compiled by NAEB's ETV Stations Division.\nA major workshop session on race relations and service to the disadvantaged was held by ETS\nfor ETV station managers late in April. Topics covered included programming needs, inclu¬\nsion of the disadvantaged, community involvement, the importance of instructional TV, financ¬\ning, outside program sources, and publicity, as these areas relate to the problems of civil\ndisorders and the disadvantaged population. Copies of the report are available from NAEB’s\nETV Stations Div., 1346 Conn. Ave., N.W., Washington, D.C. 20036.\n\"MUSIC IN MOTION, \" A TWO-HOUR SPECIAL FEATURING FIVE DRUM AND BUGLE CORPS\nfrom the Eastern U.S. and Canada, will be aired July 4th from 8 to 10 P. M. over WNDT (Ch.\n13) N. Y. The bands will be competing for $5, 000 in prize money at MacArthur Stadium in\nSyracuse, N.Y.\nThe five competing corps are the Connecticut Hurricanes, Sheldon, Conn.; New York Skylines,\nNew York City; Long Island Sun-Risers, Long Island, N. Y. ; Baltimore Yankee Rebels, Balti-\n-more, Md.; and Les Diplomates, Quebec, Canada.\n\"Music in Motion\" is being produced by WCNY-TV Syracuse for the Eastern Educational Net¬\nwork under a grant from the Carnegie Commission. Ted Weinheimer of WCNY-TV is Producer-\nDirector.\nTHIRTY-ONE OUTLETS OF THE EASTERN EDUCATIONAL NETWORK CARRIED A SPECIAL\nlive program on the problems of the Negroes, \"Talking Black\" this week. The 90-minute pro- .\ngram, originating from WQED Pittsburgh, included simultaneous pickups from Boston, New\nYork City and Pittsburgh. In each city, a Negro reporter, serving as anchorman, introduced\nfilm segments about his community, followed by a live interconnected discussion among all\nthree. The special was produced under a Carnegie Corp. grant to EEN."
}