{
  "id": "d373-65",
  "text": "June 26, 1968\nETV REPORTER\nPage 3\nTHE GREAT PLAINS NATIONAL INSTRUCTIONAL TV LIBRARY DUPLICATED AND PETRI.\nbuted nearly40U recorded telecourses to more than 80 schools and educational mshtutions m\n,, o and Canada during the 1967-68 school year, according to figures revealed at a recent\nmeeting rfle Library’s Policy Board. Thirty different production centers around the country\nwere involved in the production of the telecourses.\nTN A MAJOR DECISION AFFECTING THE ENTIRE BROADCASTING INDUSTRY? BOTH EDU^\ncatfon^fand commercial, the Supreme Court ruled last week that the Nation's Community\nAntenna TV (CATV) operators do not have to pay copyright fees from programs such as mo\ntion pictures which they pick up and transmit to their subscribers.\nA five-man maioritv of the Court ruled that CATV transmission of programs are not a \"public\nperformance” within the definition of the copyright laws, and consequently do not have to pay\ncopyright fees, as do the stations which originate the programs.\nONE NEW ETV STATION WENT ON THE AIR DURING THE PERIOD JUNE 13-25, BRINGING\nthftomniroLcastfnl/to tei, according to figures compiled by the Educational Broadcasti^\nBranch of the FCC. The total includes 78 VHFs and 86 UHFs.\n\"ONF WEEK OF FnilCATTONAT, TELEVISION.\" A CONTINUING ANALYSIS OF ETV PRO^\ngrammintfin fee U S is being conducted in 1968 by the Institute for Communication Research\nat Stanford University. The study is being supported by NET and the National Center for School\nand College TV.\nSince being established in 1960, the analysis has been one of the most widely^/theTtady will\nthe programming practices of the Nation's open-circuit ETV stations. This year the stuay win\nlncludeSrep“ntative closed-circuit and ITV fixed service facilities. The report, which will\nexamine programming of the week May 6-12, will be published this winter.\nTHE ALABAMA ETV NFTWORK WILL OFFICIALLY OPEN ITS MONTGOMERY AREA ETV\nCenter^tiienetwork ’s fifth production studio, at a special dedication dinner this week (dune 57).\nAlabama Governor Albert Brewer will present the keynote address at the dinner. The ne\nMontgomery facility, headed by Robert Dod, includes two studios, and was built under a\n$200,000 appropriation to AETC by the state.\nBELL & HOWELL HAS INTRODUCED WHAT IT CLAIMS IS THE FIRST LOW-COST CLOSED-\ncircuit color video system. The combination recorder and camera was shown at a press\nbriefing in New York City last week.\nThe B&H 2920 Recorder is the first unit on the market capable of full NTSC color, according\nto the firm. A monochrome version of the system can also record NTSC color signals. A\nsingle plug-in circuit board equips monochrome machines for NTSC color playback.\nOther features of the 2920 include compact size and portability (65 pounds including case), full\npush-button control for all tape motion functions, and fast forward and rewind m less than 90\nseconds. The recorder sells for between $4, 200 and $6, 200.\nThe new Model 2970 closed-circuit color camera, priced at $14, 000, features all solid-state\ncircuitry, built-in integrated circuit sync generator, electronically regulated supply voltages,\nand a minimum number of controls."
}