{
  "id": "d373-66",
  "text": "Page 4\nETV REPORTER\nJune 26, 1968\nTHE FORD FOUNDATION LAST WEEK ANNOUNCED THREE GRANTS TO HELP ADVANCE\nthe careers of Negroes and other minority group members in the mass media and to aid in\nimproving racial attitudes through \"more thorough and informed mass-media coverage of\nminorities. \" The Foundation said the grants are part of an effort to help implement the com¬\nmunications section of the report of the National Advisory Commission on Civil Disorders.\nWith a grant of $122, 000, the Columbia University Graduate School of Journalism will run an\neight-week program this summer to train twenty members of minority groups for news posi¬\ntions in radio and TV. The program will be directed by Ford Foundation TV advisor Fred W.\nFriendly and will be supervised by Dean Edward W. Barrett.\nA $30, 000 grant to Syracuse University, to be matched by the school, will be used for gradu¬\nate fellowships in broadcast journalism for Negro students. Students who complete the course-\nwork will receive a master’s degree from the S. I. Newhouse Communications Center of the\nUniversity. Each fellowship will be valued at $4, 500, including tuition, student stipend and\nschool costs.\nThe New School for Social Research was granted $74, 000 for two series of forums on urban-\nminority affairs reporting in the mass media. One series will be for twenty-five media execu¬\ntives at the top management level and the other for twenty-five professional working journalists.\nCURRENT MAGAZINE ARTICLES ON ETV —\nEducational TV Doesn't Have To Be Dull, by Robert de Roos, TV GUIDE, Box 400,\nRadnor, Pa. 19088, June 22, 1968, p. 5.\nInstructional TV -- What About It?, by Glenn D. Tabor, AMERICAN SCHOOL & UNI¬\nVERSITY, 757 Third Ave., New York, N. Y. 10017, Apr. 1968, p. 29.\nMicro Teaching, by Lloyd Jarman and Erv Behsman, NORTH DAKOTA TEACHER,\n410 E. Thayer Ave., Box J, Bismarck, N.D. 58501, May 1968, p. 22.\nProgramming For Educational Television Must Meet High Quality Standards, RURAL\nKENTUCKIAN, 4515 Bishop Lane, Louisville, Ky. 40218, Apr. 1968, p. 4.\nETV to Cross State Lines, by Mary Cobb, WEST VIRGINIA SCHOOL JOURNAL, 1558\nQuarrier St., Charleston, W. Va. 25311, Apr. 1968, p. 18.\nEducational TV: Slight Delay Before Work Resumes ?, CANADIAN ELECTRONICS\nENGINEERING, May 1968.\nVideo-Tape Opens New Vistas For Teaching and Learning. SCHOOL ADMINISTRATION\nMay 1968, p. 34.\nEDITOR’S NOTE: Copies of articles are not available from ETV REPORTER. Please\ncontact publications directly. Mention of ETV REPORTER would be appreciated.\nWQED (CH. 13) PITTSBURGH, PA, , EXCEEDED THE $350,000 GOAL IN ITS ANNUAL FUND\ncampaign conducted during Feb. and Mar. of this year. James A. Drain, Chairman of the\nBoard of Joy Manufacturing and Chairman of the campaign, announced that the goal had been\nsurpassed by $3, 000 and said that the fund-raising program represented the fifth consecutive\nyear that the station had met or surpassed its designated goal.\n\"The most satisfying reward to all concerned with this year's campaign, ” Drain commented,\n\"is the increased number of individual contributions. WQED depends on these contributions\nof all sizes for its total support and its is for this reason that the station has garnered an\nexcellant reputation.\"\nSIX STUDENTS WILL SPEND THEIR SUMMER VACATION AS INTERNS STUDYING WITH\nWQED Pittsburgh, as part of a program, now in its fifth year of operation to train students\nin the operation of an ETV station."
}