{
  "id": "d373-68",
  "text": "Page 6\nETV REPORTER\nJune 26, 1968\nWHO'S NEWS IN ETV —\nJ. Jerome Alexander, ex-Senior Field Engineer, becomes Mideastern Regional Sales\nManager for Ampex Corp. ’s Instrumentation Division. Charles S. Polk has been promoted\nfrom Manager of Marketing Planning for the Consumer and Educational Products Division\nto Director of Distributor Sales. The Redwood City, Calif, -based firm also named Oral\nEvans, former National Distribution Manager, to the post of Manager, Systems and Appli¬\ncations, and M. Carlos Kennedy, ex-Chief of Video Engineering for Raytheon Learning Sys¬\ntems Co., to the position of Manager, Camera and Systems Engineering, for the Division.\nWilliam C. Lewis moves up from Technical Services Director of the Delaware ETV\nNetwork to the position of Managing Director.\nWilliam J. Lamb, Senior Vice President and Treasurer of WNDT New York, N. Y., has\nbeen elected to the Board of Trustees of the Educational Broadcasting Corp., operators of the\nstation.\nRobert M. Olsson, ex-Programs Director of the Contract Materials Center of the Gen¬\neral Learning Corp., joins the Commercial Electronics Division of Sylvania Electric Products\nInc. in Bedford, Mass.\nDaniel C. Cady, who had been Director of Films and Television, American Management\nAssociation, Inc., New York, N.Y., has been elected Vice President.\nJane Schautz has been appointed Director of instructional Services, WVIA-TV (Ch. 44),\nScranton, Pa.\nRobert P. Bolles, ex-Merchandising Manager with Arno Tapes, Inc., joins Raytheon\nLearning Systems Co., Michigan City, Ind., as Manager of Marketing Services.\nRaymond A. Makela, formerly a Sales Representative for Zack Electronics, has joined\nBlonder-Tongue Laboratories, Inc., Newark, N.J., as West Coast Field Engineer.\nPaul Kaufman, an Executive Producer of Public Affairs Programs for NET, New York,\nN. Y., joins the Political Science Department of the University of California at Berkeley to\nparticipate in a year-long educational experiment, \"The Film: Towards the Expression of the\nIdea of Freedom. \"\nPaul Stevenson, former Supervisor of Instructional Graphics at Penn State University,\njoins WWVU-TV, Morgantown, W. Va. , as Graphics Supervisor; Robert Francis, formerly\na Radio Officer for the United States Lines, Inc., becomes Transmission Supervisor for the\nstation; S. Douglass Bailey, former Radio-TV Coordinator for the Office of University Rela¬\ntions at the University of Maryland, becomes Producer/Director; Edward Ryan, ex-Broad-\ncast Engineer for WSAZ-TV, appointed Engineering Maintenance/Operations Technician; and\nS. Neil Haislop, a Senior Speech Major in West Virginia University's program in Broadcast\nEducation, begins work for WWVU-TV as Assistant Cinematographer.\nV. T. Miller, former Science Teacher in the Sidney Public Schools, has been chosen\nby the Nebraska Council for Educational Television as the Studio Teacher for a pilot sixth\ngrade science series.\nBob C. Selby of the University of Texas Radio-Television film faculty and Communica¬\ntion Center named Operations Manager of KLRN-TV.\nDavid G. Griffiths, formerly with KRMA-TV in Denver, Colo. , joins WHYY-TV (Ch.\n12) Philadelphia, Pa., as a Producer-Director.\nCarolyn Nichols and Cher rill Anson, Producers in the Programming Dept, at WET A\n(Ch. 26), Washington, D.C. have been presented \"awards of excellence for their contributions\nto the communications media, \" by the Advertising Club of Washington.\nFrank J. Haney, ex-Manager, Audio/Video Systems for ABC-TV's Network Engineer¬\ning Dept., named General Manager for the Sunnyvale (Calif.) Division of Visual Electronics\nCorp.\nDIAMOND POWER SPECIALTY CORP. , HAS NAMED W. G, BROWN SOUND EQUIPMENT\nCo., Syracuse, N.Y., as distributor of its CCTV arid videotape records in Syracuse, Utica,\nAuburn and Rome, N.Y."
}