{
  "id": "d373-69",
  "text": "June 26. 1968\nETV REPORTER\nPage 7\nVERMONT ETV HAS RECEIVED A GRANT TO PRODUCE A PROGRAM ABOUT THE CHIEF-\ntan of Scotland's oldest clan, Robert Lister Macneil, 45th Chieftan of the Clan Niall, who\nmakes his home in Marlboro, Vt. Macneil is known to Scotsmen around the world as the\nMacneil of Barra, 45th Chieftan of the Clan Niall, Scotland’s oldest. He and Lady Barra have\nowned Barra House in Marlboro for more than 30 years. Vermont ETV Network camera crews\nwill travel to Scotland this summer to film the documentary at Kisimul Castle, ancestral home\nof the clan.\nGOV’T. ETV, CCTV PROCUREMENTS, CONTRACT AWARDS —\nCOMPETITIVE PROCUREMENTS:\nTESTING AND DELIVERY OF A VIDEO TAPE RECORDER/REPRODUCER — A request\nfor proposal has been issued by the Defense Communications Agency, Code 260, Washington,\nD.C. 20305 for the procurement of testing and delivery of a videotape recorder/reproducer.\nThe unit must employ Quadruplex Transverse Recording on 2” Magnetic Tape capable of being\nupdated from a Basic Unit to that described in the \"Television System and Equipment Standards,\nDCA Circular 330-175-1, Annex A. To participate in the procurement a firm must have an\norganization with background and manufacturing experience in videotape recorder/reproducers.\nHe must demonstrate videotape recorder experience at an industry level comensurate with the\ntechnical work statement. Ampex and Radio Corp. of America are on the present source list.\nThe RFP will call for the submission of a technical proposal and separate price proposal on\nor before close of business July 22. Questions concerning the technical aspects should be re¬\nferred to Mr. M. Burgett or Mr. G. C. Jaones (202 OX 4-2704 or OX 4-2777) — Contracting\nquestions should be referred to Mr. John Watson (202 OX 4-2987); Mail address for both is the\nDCA.\nTV STUDIO/TRANSMISSION EQUIPMENT — Under FPA-F-58047-N, the General Serv¬\nices Administration, Region 3, Business Service Center, 7th & D Sts., S.W., Washington,\nD. C. 20407, seeks furnishing and supervision of installation of TV studio/transmission equip¬\nment at El Salvador, definite. Quantity—Solicitation. Bid opening: July 5.\nVIDEO TAPE RECORDER/REPRODUCERS — The Base Procurement Office, Keesler\nAir Force Base, Miss. 39534, has issued IFB F22600-68-B-2443 for a video tape recorder/\nreproducers (monochrome) for use as training aids, Keesler Air Force Base, Miss. 15\neach. Copies of sol. form will be furnished on a first received, first served basis. Bid\nopening: July 9.\nSOLE SOURCE PROCUREMENTS:\nDELAY SET FOR THE OPERATIONAL TV SYSTEM — An IFB DACA18-68-R-9163 has\nbeen issued soley to Tel-Comm Instruments Inc., 6 Grade Meadow Lane, Hanover, N.J.\n07936, for an One Envelope delay set for the operational television system, for Launch Com¬\nplex 29, Kennedy Space Center, Fla. by District Engineer, Canaveral District, Corps of\nEngineers, P.O. Box 4567, Patrick Air Force Base, Fla. 32925,or Bldg. 560.\nCONTRACT AWARDS:\nPRODUCTION OF A 13 TO 14 MINUTE 16MM COLOR SOUND FILM — The Chief Pro¬\ncure meiF!TSui5ny”Dkr7l5man^ awarded\na $10, 017 contract to Eli Production, Inc., Washington, D. C., for the production of a 13 to\n14 minute 16mm color sound film.\nVIDICON CAMERAS — The Procurement Branch, Logistics Div., Brooke Army Medi¬\ncal Center, Fort Sam Houston, Tex., has awarded a$32,718 contract to R. J. Walker Co.,\nDallas, Tex., for vidicon cameras, 2 each."
}