{
  "id": "d373-71",
  "text": "June 26, 1968\nETV REPORTER\nPage 9\nTV AND RADIO ARE \"THE ONLY REAL LINK BETWEEN THE GHETTO AND THE OUTSIDE\nworld,\" and they may be inspiring people to demand a better life, Vincent T. Wasilewski,\nPresident of the National Association of Broadcasters, contended this week.\nHe told a group at the Mayor’s Prayer Breakfast in Buffalo, N. Y., that broadcasting ’’has\nplayed an almost unconscious role” in letting the underprivileged learn about \"the good life\"\nand the affluence in our society. While only a small percentage of ghetto residents read\nnewspapers, Wasilewski stated, broadcasting reaches some 90%. These people, he asserted,\n\"know the world they have really never seen through the eyes and ears of broadcasting.\"\nCommenting on charges of excessive violence in broadcasting, Wasilewski charged that be¬\ncause the medium is so universal in its appeal, \"we are an easy target of everybody's frustra¬\ntions. \" He said it is easy to say that broadcasters should bear the guilt for all of the evils\nand failures which exist in our society as a whole, but he added: \"I would suggest that such\nthinking is not only inaccurate, but a dangerous indulgence, because it shifts the blame to some\none else and it implies tantalizingly easy solutions to very complicated problems.”\nNEW ETV PRODUCTS AVAILABLE FROM —\nAmpex Corp., 205 West Touhy Ave., Park Ridge, Ill. 60068. A new rack-mounted\nvideotape playback unit for use in dial-access television systems has been developed by\nAmpex Corp., and is priced at $2, 500. The VR-5900 extends the Ampex one-inch wide tape,\n9. 6 inches per second format, and any tape produced on an Ampex one-inch videotape record¬\ner may be played on the unit. A printed circuit motor in the head drum permits video material\nto be played back to any number of stations in six seconds, according to Ampex, and the VR-\n5900 recycles continuously when there is program demand, and stops when there is no demand.\nMounting vertically in a standard 19-inch rack and hinged on the side to swing out 90 degrees\nfor maintenance or inspection, the unit has a rewind time for a 15-minute program of 60\nseconds.\nTeleMation, Inc., 2275 Southwest Temple, Salt Lake City, Utah 84115. The new\nTMC-2100 vidicon camera is capable of converting from operation as a self contained unit\nto operation as a two-unit operation. As a self-contained unit, the TMC-2100 can perform\napplications from random through standard EIA scanning standards to \"hi-rez\". Plug in\nsync options include: Crystal /Drive, 2:1 Interlace, and EIA. Two-unit operation is accom¬\nplished by connecting the camera to any of the firm's family of Cablecaster/Multicaster Video\nControl Centers, TMV-707 Universal Camera Control, or TSE-100 Screen Splitters. Two-\nunit sync is either 2:1 or EIA, depending upon the standard of the control device. The TMC-\n2100 has an 800 volt power supply and 60 gauss focus field, 8 and 800 lines resolution is\nquaranteed.\nH. Wilson Corp., 555 W. 166th St., South Holland, Ill. 60473. The Wilson Mobile\nVTR Center, priced at $199.00, features space inside to store a camera, tripod and receiver/\nmonitor, as well as 4\" ball bearing casters. Monitor can be placed.on the drop shelf out of\nthe Center during a pick-up.\nFRED ROGERS, OF ETV'S \"MISTEROGERS NEIGHBORHOOD,\" WILL BE A GUEST ON ABC-\nTV's \"Mike Douglas Show\" this week (June 28). Rogers will discuss his special techniques in\ncommunicating with young children and also sing some of the numbers from his three records.\nWETA (CH. 26) WASHINGTON HAS LAUNCHED A NEW SERIES, \"ONE TO ONE, \" WHICH\nfeatures readings of selected authors, visually enchanced by a variety of techniques. Host\nfor the series, which was funded by a grant from the National Home Library Foundation, is\nA. E. Claeyssens, Associate Professor of Creative Writing at George Washington Univ. and\nArtistic Consultant to the AP-Phoenix Repertory Co. in New York City."
}