{
  "id": "d524-2",
  "text": "January 3, 1958\nMr. Bernard Wise\nIndustrial Transmitters and Antennas\n7327-A West Cluster Pike\nUpper Darby, Pennsylvania\nDear Mr. Wise:\nThanks for your letter of December 30th regarding the formation of I.T.A.\nfor the manufacture of IK equipment for educational broadcasters. Tour\nletter arrived Just as copy was being prepared for the January HABB hews-\nletter, and, if space permits, mention of your installation at WRYI-TK\nof your organization, will be included.\nThe annual NAEB Convention is held in late October; in 1957 (the 33rd)\nit was held in St. Louis, October 29 through November 1. Dates for the\n1958 Convention in Omaha, Nebraska have not yet been set. No equipment\nexhibit has been held in connection with this event since the 195k con¬\nvention in New York City*\nThe 28th annual Institute for Education by Radio-Television will be held\nin Columbus, Ohio Hay 12-15, 1958. It is usually lie la at the Deshler\nHilton Hotel and last year had a small equipment exhibit, mainly consisting\nof television equipsnt. I believe that the exhibitors felt that JERT was\nquite worthwhile as contrasted to the HABB Convention in New York where\nmost exhibitors thought the attention paid to the equipment exhibits not\nadequate for the expense involved.\nI would suggest, that you write to Dr. I. Keith Tyler, Director, Institute\nfor Education by Radio-Television, Ohio State University, Columbus 10,\nOhio for information regarding the 1958 Institute*\nThe Eleventh Annual Western Radio and Television Conference will be held\nat the Bellvue Hotel, San Francisco, California February 13, Hi & 15*\nRegion VI of NAEB will also meet there two days prior to this meeting.\nFor information contact RooaiM L. Hunt, 3712 Starr King Circle, Palo Alto,\nCalifornia.\nThere is also an Annual DAVI ESeting to be held in Minneapolis, Minnesota\nin April, which has an equipment exhibit. For further information contact\nMiss Mary C. Welch, Department of Audio-Visual Education, National Education\nAssociation, 1201 Sixteenth Street, N. W., Washington, D. C. You might\ninquire of Miss Welch about NBA meetings, having equipment displays."
}