{
  "id": "d524-35",
  "text": "S. P. *7&yC<vi\nManager, Distributor Sales\nRadio Division\nWestern Electric Company\nA COOPERATIVE ENTERPRISE\nFOR BROADCASTING\nDOMINATING the multitude of questions which constantly come to us has been the one\nregarding transmitter building design. This has been particularly so during the rapid expan¬\nsion of the Radio Broadcasting Industry over the past two years. Consistent with our established\npolicy of cooperating with the Industry and in the hope of contributing an answer to this question,\nthe Oscillator launched a series of surveys and studies on transmitter building design and construc¬\ntion. The results, offered in the pages which follow, represent the combined knowledge and\nexperience of many authorities.\nIn this project we find demonstrated once more the spirit of cooperation which we believe to\nbe one of the most important factors in bringing the Radio Broadcasting Industry to its present\nlevel of achievement and technical excellence. Indeed, its pooling of knowledge, skills and experi¬\nences from within and from without is one of the most striking elements of the Industry’s develop¬\nment. In my capacity as Manager, Distributor Sales of Western Electric’s Radio Division and as\nChairman of the Transmitter Division of the Radio Manufacturers Association I have witnessed this\nspirit in operation many times.\nIn preparing this guide, we had the advantage in full measure of this same spirit of cooperation.\nIn this instance I saw how freely and willingly hundreds of busy chief engineers and hard-working\nstation managers from stations all over the land answered questionnaires, sent in blueprints, designs\nand valuable suggestions and how some of the country’s foremost network engineering executives\nand leading architects in the radio field gave of their time and experience to insure the project’s\nsuccess.\nSo this guide, compiled from all of these sources, is presented for the benefit of all broad¬\ncasters. Use it as you wish. We hope it will in this way be fully justified by its value to you and to\nthe whole Industry.\n4\nWestern Electric ^OHJTJVTOf?"
}