{
  "id": "d524-41",
  "text": "Functional Units of a\nBroadcast Transmitter Building\nEssential Transmitter Room\nControl Room or Area\nWashroom\nStorage Space\nWork Shop\nDesirable Office\nShower Room\nKitchen or Kitchenette\nEmergency Studio\nGarage\nOptional, Depending Living Quarters\non Requirements Employees7 Lounge\nHeater Room\nTransformer and Power Distribu¬\ntion Room\nViewing Lobby or Visitors7 Lounge\nOn the other hand, if your transmitter building is\nseen regularly by a large number of people in your\ncommunity, the building becomes a permanent ad¬\nvertisement for your station, establishing in the\nminds of your listeners the character of your organi¬\nzation. The minimum response to this situation\nshould be a building with a clean, well-balanced ex¬\nterior appearance, well-kept approaches, architec¬\nture neither pretentious nor dowdy. This kind of\nclean, smart looking building need not cost substan¬\ntially more than a cluttered, ugly, ramshackle type\nof building—again it is expert planning that counts.\nEach management must make a decision, based\non its resources and the probable benefits in good¬\nwill to be obtained, as to just how far it wants to go\nbeyond this minimum toward a more elaborate use\nof the transmitter building in the public relations\nscheme of the station. Many arrangements are pos¬\nsible, ranging from the use of a glass wall on the\ncontrol area, a fairly inexpensive and often most\neffective way of \"showing the works” to the public,\nup to fountained gardens, beautifully furnished visi¬\ntors’ lounges, raised viewing lobbies that circle the\nwhole transmitter area. A number of practical\nschemes for the accommodation of visitors are\nshown in the plans in Sections II and IV.\n3. Units of the building\nArchitecturally speaking, a transmitter building\ncan be divided into the unit functions and features\nshown in the table at the left.\nYour planning of interior layout can be based on\nthe selection of the building units or rooms to take\ncare of your particular needs and problems.\nThe transmitter room and control room are the\nheart of any transmitter building, and they should\nbe designed first, to accommodate your transmitter\nand to provide for installation of the services neces¬\nsary for operation and maintenance. Choice of the\nother building units or rooms required for your in¬\nstallation can then be made. These additional rooms\nshould be added around the transmitter and control\nrooms to provide proper and efficient operating flow\nto the various parts of the building. The transmitter\nroom and control room are discussed in detail be-\nBASIC PLANS FOR\n10\nWestern Electric"
}