{
  "id": "d524-44",
  "text": "TRANSMITTER BUILDINGS\nKOB, Albuquerque, N. M.\nREGIONAL: This example of a regional type in the Southwest is\nin harmony with its surroundings, though not to the point of ex¬\ncluding the possibility of other forms being equally successful.\nThis particular type happens to be quite in keeping with interior\nefficiency and economy and shows how to use style to advantage.\nAssociate Editor, Architectural Record\nThe exteriors of transmitter buildings should be judged\narchitecturally by the same standards used for other\ntypes of buildings. Does the exterior form proceed\nlogically from the planning of interior space and suit¬\nably express the building’s purpose? Is it harmonious\nwith respect to site and environment ? Since a transmit¬\nter building’s purpose is so essentially of the present,\nexterior forms in the modern or contemporary manner\nwould seem to be generally appropriate. \"Modern,”\nhowever, does not mean those cliches and rootless styl-\nisms necessitating the term \"modernistic.” Moreover,\nthere are many cases where exterior expressions in re¬\ngional, traditional or other manners are amply justified.\nWMIT, Winston-Salem, N. C.\nWCBS, New York, N. Y.\nMOUNTAIN TOP: This ideal location for an FM transmitter build¬\ning does constrain the architect in his choice and handling of\nmaterials to provide appropriate shelter. Traditional and regional\nfactors are seldom important, but expressiveness of form must\nbe subordinate to considerations of weather and exposure.\nISLAND: A site like this provides as nearly perfect ground con¬\nditions as are possible for a permanent transmitter building.\nThe architecture, though functional in appearance to the point\nof severity, is generally suitable to the purpose and environment.\nA more elaborate style would probably appear specious.\nQUONSET: Slightly more creative is this adaptation of a familiar\nstructure of general utility to the specific purposes of radio\ntransmission. Although the Quonset form has architectural\nvalidity in many functional applications, it is doubtful that it\nprovides the best basis for efficient permanent solutions.\nWKYW, Louisville, Ky.\nSPECIAL PROBLEM: This solution, in the tradition of the original\nflood, insures protection against the worst rampages of the Ohio\nRiver. Combined height of the concrete piers and former Army\npontoon barges put prefabricated transmitter building well above\naverage high-water mark. Barges are moored fore and aft."
}