{
  "id": "d524-45",
  "text": "(Continued from page 11)\nchanges he hopes to make. As stated by Royal V.\nHoward, \"Every small or medium power transmitter\nbuilding should allow for expansion to higher\npower, if the owners have any hope for normal ex¬\npansion and growth of their business.” In the trans¬\nmitter room, this means sufficient space for a larger\ntransmitter, and any secondary units required. Such\nadditional floor space costs very little per square\nfoot. A wall of glass brick, unit partitions, or other\neasily removable construction is one of the simplest\nand most popular methods of facilitating future\nexpansion in the transmitter room.\nAfter layout of the room, the next major planning\njob for the transmitter room is that of supplying\ndirt-free air to the transmitter and auxiliaries and\nkeeping ambient temperature at the proper levels.\nDirt Removal. As pointed out by A. B. Chamberlain,\n\"It is more economical as well as more satisfactory,\nfor maintenance and continuity of service, to supply\ndirt-free air to the transmitter than to have operat¬\ning personnel constantly engaged in removing dust\nand dirt which may eventually cause equipment\nfailures. Filtered air will be found, over the long\nrun, one of the best investments the designer of a\ntransmitter building can make.”\nAn analysis of the normal dirt content of the air\nBeautifully finished control room at WHEC, Rochester, N. Y., has the\n\"l\" arrangement of units, with ample space left around control desk.\nat the transmitter location will give an indication of\nthe problem you face in cleaning up the air for your\ntransmitter room. Simple filters on the air intake of\nthe transmitter cabinet will often be sufficient, par¬\nticularly if a slight positive air pressure is main¬\ntained inside the cabinet. On the other hand, it may\nbe desirable to filter the air for the whole room or\nbuilding. If the transmitter is not in a separate room,\nprecaution may be necessary against entry of dirt\nwhen outer building doors are opened.\nWith the larger air-cooled transmitters, which\npull cooling air from outside the building, close\ncontrol of dirt becomes of paramount importance.\nVarious types of filters, or an electrostatic precipi¬\ntator, can be installed in the intake side of an air\ncooling system. With proper maintenance and oper¬\nation, the precipitator or other type of filter will\nprovide clean air for cooling the transmitter.\nAmbient Temperature. The disposal of waste heat\nin a broadcast transmitter, to keep the temperatures\nat safe operating levels, is of course one of the prin¬\ncipal design factors for which the manufacturer has\nmade provision. The planner of the building must\nconsider, in addition, the comfort of operating per¬\nsonnel. Thus the general considerations that affect\nthe planning of the transmitter room are as follows:\n(1) In a building cooled by mechanical refrigera¬\ntion, waste heat should not be added to the load on\nthe cooling equipment, but discharged outside. The\nwaste heat will almost certainly overload the cool¬\ning equipment.\n(2) The same will be true if the cooling air for the\ntransmitter is taken from a building area cooled\nmechanically.\n(3) Thus treatment of transmitter heat separately\nfrom that in the building itself is highly desirable,\nespecially in warm climates and whenever mechani¬\ncal refrigeration is used to cool the building.\n(4) By enclosing the area in back of the transmitter\nfront panel as a separate room, dirt, ventilation and\nheat disposal can all be handled on the most effi¬\ncient basis, with the operator’s comfort assured.\nControl Room: The space in front of the transmit¬\nter, or the separate room into which the transmitter\nfaces, must be used as the control room. The central\nfeature of the control room is the control desk, so\nplaced that the operator on duty can monitor the\ntransmitter efficiently during operation.\nThe layout of the transmitter and the racks of\n14\nWestern Electric ©§(S!MLM,®j1"
}