{
  "id": "d524-46",
  "text": "audio and test equipment around the control desk\nso that they are easily seen, with ample space for\nmovement of personnel, is one of the most impor¬\ntant planning jobs in any transmitter building. The\nsketches at the bottom of pages 10 and 11 have been\nprepared to show the various basic plans which ac¬\ncommodate themselves well to these requirements,\nas adapted to single unit transmitters, multiple unit\ntransmitters, and two transmitters. The following\nprinciples should guide the layout of the control\nroom or area:\n(1) The operator must be able to see the indica¬\ntions of the most essential meters (although not\nnecessarily to read the meters accurately) without\nleaving the control desk.\n(2) The minimum distance between desk and\ntransmitter should allow for easy passage of the\noperator between the two with the transmitter doors\nopen—approximately five or six feet.\n(3) As units are added to the transmitter, the con¬\ntrol desk must be moved back from the transmitter\nfront, to give the operator a proper view of all the\nunits. Thus the average distance between control\ndesk and transmitter in medium power installations\nis eight to ten feet.\n(4) As more units are added to the transmitter, a\nrectangular, semi-circular, or other \"folded” ar¬\nrangement (see sketches at bottom of pages 10 and\n11) becomes desirable to bring all of the units\nwithin proper viewing distance of the operator.\nSuch arrangements also make for easy maintenance\nand use space efficiently.\n(5) Not only the transmitter itself, but auxiliaries\nsuch as phasing equipment, modulation, frequency,\nand phase monitors, noise and distortion meters,\nline and limiting amplifiers, should be visible and\nreadily accessible to the operator.\n(6) The auxiliary units listed above must be ar¬\nranged so that the operator can get in back of them,\nwith ample space for servicing or maintenance.\nAfter layout of the transmitter, control desk, and\nother units and scaling of the control room, plans\nshould be made for maintaining temperature, ven¬\ntilation, and lighting in the room, all adjusted to the\nrequirements of continuous occupation by an oper¬\nator. Proper lighting of the front of the transmitter\nwill add measurably to the appearance of the equip¬\nment and the efficiency of operation.\nAcoustic treatment of the control room walls and\nceiling has become general practice, to lower the\nnoise level with consequent improved program\nmonitoring efficiency and additional comfort for the\noperator.\nA feature of the control room often overlooked is\nthe provision of convenient space for a typewriter.\nStanding a typewriter on the control desk puts it in\nGas equipment for pressurizing transmission lines and high voltage\ncondensers can be put in basement or near back wall of building.\nthe way of other operations and makes it incon¬\nvenient to use.\nWhen the preliminary layout of major units of\nequipment in the transmitter room and control room\nis on paper, attention should be turned to planning\nfor proper and economical installation of the fol¬\nlowing \"services” to the transmitter and associated\nequipment:\nIncoming primary power\nIncoming program lines\nInterunit connections\nOutgoing transmission line\nLighting circuits\nCooling water piping (if water\ncooled)\nAir ducts for cooling (larger air cooled\ntransmitters)\nGas equipment for pressurizing\ntransmission line\nSeptember 1947\n15"
}