{
  "id": "d1637-4",
  "text": "RADIO, UNIVERSITI>S3 .(v€ ip\\SJjS WUQPS1W\nEditor*a note - The following article by Mr. Victor S. Y&rros,\nLewis Institute, Chicago, appeared In the -June 10 issue of School\nand Society and is reprinted here with consent of the publication.\nIt is generally admitted that education by radio has not Justi¬\nfied our early and optimistic expectations. The response of the radio\npublic i;o the sort of lectures or courses given over the air has not\nbeen encouraging. Whose is the fault? It is easy, but futile, to\n■ blame the public, which can not oe compelled to tune in any program\nthat fails to challenge Its attention/ and which can not be forced\nto listen to a speaker who is dull or obscure.\nDistinguished educators have predicted the broadcasting of the\nregular college and university courses in the near future. That\nwould be a very long step Indeed toward universal adult education.\nBut it is obvious that the courses and the methods of ch© professore\nand instructors, would have to be changed in Important particulars.\nThe radio student body will not be required to take and pass examina¬\ntions, and it will not regard knowledge fi'om the view-point of the\nyoung man or woman to whom education is preparation for a career, a\ncondition of membership in a learned profession.\nEducation by radio, in short, must be made interesting to average\nmen and women and must consult their convenience. This, however,\nshould not prove very difficult, considering the amount of rubbish\nand trash inflicted \\roor. ua by radio. Wo certainly could spare a good\ndeal of third-rate Jas.% many tedious and pointless sketches, hack¬\nneyed and trivial musical compositions, and the like.\nThere are remarkable opportunities before our colleges and\nuniversities, and it is scarcely open to doubt that the right appeal\n—this is, the right programs, and the right arrangements for the\nbroadcasting of such programs—would bring ample financial support\nfrom our -enlightened philanthropists and from the man:- organisations\nthat have long been anxious to promote genuine adult education.\nBut education ia a big tern covering a multitude of issues and\nsubjects. Selection la necessary. Let us bear In mind that the\ntalk about the public oversimplifies the situation. As in the case\nof. vuelo, education must re&db. many publics. An excellent lecture\non astronomy, on Egyptology, on anthropology, on electricity, will\nattract a small group. A lecture or series of lectures or intelligent^\nplanned' debates on current, vital and ,3burningH topics will interest\nmillions, the country over. ¥fe may not know the end-result of radio\neducation; we know, or should know? the proper and effective beginning\nof that enterprise.\nRecently, Harvard announced several lectures and courses over\nthe radio, and among the subjects to be discussed we find “The After-\nmath of the Civil War, “ '^Recent Times,09 59 Relation between School\nand CollegeNo reasonable parson can object to the consideration\nof these and similar matters. Yet many perplexed and light-seeking"
}