{
  "id": "d1637-6",
  "text": "majority of the biologists when he gave the world Me revolutionary\n\"Origin of SpeciesoM Einstein has not always had a majority or the\nphysic Lflte and mathematicians with him. At any rate,, a government'\nassured of impartial md scientific support would escape many ilxil-\ncult Iei and embarrass lents that secrecy and uncertainty invar lady\ninvite.\nTo return tc the suggestion broached tentatively in the* foregoing\nparagraphs. Our universities and colleges should not shrink from\nthe most effeotivq&nd successful kind and form of adult education\nthat our critical tlir r clamors for--education of the radio put?-!©\nwith respect to the great and pressing probleme of our o*t day.\nCons irvatives, liberals, radicals on our faculties should be affords*,\nfull and equal ot port mltyj all sides should be given a hearing, and\nthe radio lectures or- talks should be republished fen leaflet or\npamphlet form Mhat :.he Tom Meeting of the Air can do, our educa¬\ntional institutions of authority and prestige can do, and do better*\nThe question of paying the broadcasting corporations, assuredly, is\nnot a very serious one* Contributions would be forthcoming for so\noommendable and trials democratic an fenterprise.\nI am not forgetting the University of Chicago Sunday morning\nbroadcast. It it goc i as far as it goes, but is not as good ss it\nmight be. The discuE3ion is seldom systematic or sufficient. It\nia even superficial at timesw. Some of the speakers have little to\ncontribute, and othei 3 aan r.ot claim to epB&k for science and educa¬\ntion * We need mors, nuoh more, discussion of vital questions, and\nmors method and design in the discussions.\nHELP WANT ED s HEY'.JOl 1 AT WILL\nFour new part-time Jobs for graduates are available for the coming\ntwelve months period it W I L L, University of Illinois, Urban a, XIX.\nOpenings now exist for a Chief Announcer, two Announcers, and. a\nContinuity Writer, according to Director Josef W. Wright, abuse\nJobs will give some capable graduates an opportunity to olntlnue\nwith their educationst work and at the same time earn expense*. If\nyou Know of any likely candidates, you might advise them to get in\ntouoi with Joe immediately. In all probabilities the petitions will\nbo filled before Sept ember X*\nACTIONS BY FCC\nmm% Cornell Univeri kty, hm been licensed to operate regularly on\n680 tQ with 1 KW, frc:a 8 asm. to sunset in Hew Orleans . The station\nhas oeen operating or this frequency for many months, but with an\n’ experl me11al 11 ot nsc -.\nWNAJ). University of % dahoma, was granted special permission to remain\nsklent during many perie-ds in August because of summer vacation*\nWHUF, University of Florida, has had its application for construction\npermit to move transmitter and studio sites, male changes in equip®#**;\nand to increase power, set for hearing* Application calls for increase\nin power and time of operation from 5 KW limit eel to B XW nigh*, 10 KM"
}