{
  "id": "d1800-1",
  "text": "-2-\nTELEVISION'TOPICS\nRESTRICTIONS ON THE USE OF TELEVISION FILMS have been demanded by the A-Frof-L\nScreen Actors Guild. They fear the new medium may turn into what they call a\nFrankenstein monster. The Guild says thousands of TV movies would cut acting\nwages and reduce employment of actors unless their use is regulated by collective\nbargaining contract.\nTELEVISION STATION U-H-E^N BEGAN BROADCASTS NOVEMBER 29. Owned by the Meredith\nEngineering Company WHEN-TV is directed by Captain W, C, Eddy, television pioneer.\nAN ESTE ATED TUP-MILLION PERSONS SAU TEE OPENING NIGHT. PRESErEATIOJT pF.lLQTBII,En\nbroadcasting from the Metropolitan Opera House by ABC over the company’s East\nCoast Network. Black and white version failed to catch the glitter of colorful\ncostumes, but viewers, thousands of them for the first time, not only saw opera\nbut had an intimate backstage glimpse of interviews with Met artists and officials\ndenied to the celebrity studded audience out front. Illumination was by \"black\nlight.\" Music came through brilliantly. Met officials expressed the belief TV\nwould popularize opera the way radio did concerts.\n1QQQ TV STATIONS in 7 to 12 YEARS IS THE PREDICTION OF FCC CHAIRMAN COY. In 1946\nthere were 6 TV stations and 6500 TV receivers. In 1948 there are 42 TV stations\nand 718,000 TV receivers in use. The FCC expects 400 TV stations to be on the air\nin 1950, and a coast-to-coast TV network in operation by 1952. Estimates of 1949\nTV receiver production range from 2,500,000 to 4j000,000.\nTELEVISION STATION UBKB MILL START A NEW TYPE M R/S PROGRAM. SOON presenting Associated\nPress news directly on the screen as it is received on a new type ticker printer. ■ -\nPrinted tape will be dravm across the TV screen, unaccompanied by sound initially,; -\nLater system of bells to denote stories varying in importance will accompany visual ^\npresentation of news. Up to now-news has been presented by means of off-the-screen\nvoice reading while still pictures or blank screen confronted viewer. However, TV\nwatchers state they prefer to read news themselves.\nTV A TOOL OF TILE RICH??\nA warning that television, which may wipe out sound radio, is likely to land in\nthe laps of millionaires, came from Morris L. Ernst, N.Y. attorney, who laid\nthe matter before the House Small Business Committee recently as one for ser¬\nious consideration.\n\"Let’s take a look at television,\" he said, during his rambling dissertaion as\nwitness. \"It may^ipe out everything else in the field of radio and otherwise.\nThere may be 1000/stations in America ultimately.\"\n\"You know how much it costs? You'must have a million dollars. And it is that\nmedium that is going to control ultimately what I think may be the transmission\nby either of the spot news and opinion of America.\"\n\"I don’t believe that it is going to take the place of films, in the sense of\nfeature pictures. But who is going to own those 1,000 pipelines? How many\npeople and how much diversity can there be—whon we are speaking of people in\nAmerica who have millions of dollars?\"\n\"Take a look at the people who are in there. They are not evil. But they are-\nthe people with a million dollarsj that is all.\"--VARIETY"
}