{
  "id": "d1800-10",
  "text": "-11-\nSK011I-TIA APPOINTED NAEB REPRESENTATIVE TO OHIO COINERSNCE\nr\nDr. Harry J, Skornia, director of radio at Indiana University and director of\nNAEB Region III, has been named as NAEB representative to the special Advisory\nCommittee of the Ohio Institute for Education by Radio, Skornia together with\nother representatives from education and commercial radio will meet in Columbus\nDecember 11, to discuss plans for the 1949 Radio Institute at the Ohio State\nUniversity. _\nKADDERLY ELECTED PRE3IDEFT FARM DIRECTORS\nUallace Xadderly, KGU (Portland) Farm Service Director and former USDA radio director,\nwas elected president of the National Association of Farm Radio Directors, November\n28 at the annual meeting of the association in Chicago. Vice president is Gordon\nLoudon of T7UL, New Orleans and secretary-treasurer is Phil Alampi of UJZ, New York,\nNATIONAL COUNCIL TEACHERS OF ENGLISH GIVE RADIO AUARDS\nThe Theater Guild of the Air (ABC) and the CBS Documentary Unit won the awards of\nthe National Council of Teachers of English as the ’’best literature on the air\"\nin the 1947-48 school year. Announcement was made at annual meeting of group in\nChicago in late November.\nPI-IPNE INTERVIENS GST BIG PLAY BY STATIONS\nRecent FCC rule permitting recording ahd broadcasting of telephone conversations\nis being put to considerable use by many stations around the country and now comes\nUNEU, New York, with a quarter-hour nightjy \"Telephone Newsreel” starting December 1.\nAnother development is a campaign being readied by UOR, New York, to ask the FCC\nto go a step further and allow the warning \"beep\"—every 15 seconds—to be dropped\nunder certain conditions.\nUNEU is programming its \"Telephone Newsreel,\" by which it will cover local,\nnational and international news via telephone conversation and interviews, as a\nresult of the imoressive listener response to a similar operation on Election Night\nwhen it had Martin Block phoning political officials all over the world. \"Telephone\nNewsreel\" will be aired Monday through Friday, 8-8:15 p.m,, with George Brooks,\nUNEU chief announcer and newscaster, conducting the interviews. Series will be\nproduced by Ted Cott, directed by Jack Grogan and written by Dick Pack and Bert\nBriller. ” _\nHANNA RETURNS FROM UNESCO MEETINGS ABROAD\nMichael R. Hanna, general manager of UHCU, Ithaca, NAEB outlet at Cornell Univer¬\nsity, has returned to his station after a six-weeks1 absence as UNESCO adviser\nin Paris and Beirut.\nMr. Hanna, representing American broadcasters, served as one of 18 radio experts\nfrom as many nations, in developing a proposed mass communications plan for\nUNESCO during October and November sessions in Paris.\nSubsequently he was adviser to the United tates delegation to UNESCO in Beirut.\nHis travels took him to Rome and London as well. Mir. Hanna returned to his station\npost December 8. He will report on his trip to the NAB Board of which he is a\nmember."
}