{
  "id": "d1800-12",
  "text": "-13-\nFCC TO HOLD HEARINGS ON KI.'PC, HOAR, AMD WJR NEWS HANDLING\nHearings on news policies at three stations owned by G„ A. Richards have been\nordered by the FCC to take place at an early date, as an outgrowth of accusa¬\ntions aired at Richards by two resigning K1 PC(Hollywood) newsmen earlier this\nyear. Their complaints (carried in an exclusive story by Billboard) alleged\nthat Richards had issued specific directives to them and the KIPC newsroom to\neliminate certain stories and to slant others.\nBy motion of the FCC, WJR(Detroit) and WGAR(Cleveland) were included in the order\ndirecting the hearing. Special counsel has been retained including former\nsenator, Burton K, Wheeler, and Lewis Caldwell, attorney for CCBS, Clear Channel\nBroadcasting Service.\nFrank E. Kullen, former HBC vice-president, who was employed as operating head of\nthe Richards stations shortly after the ..KMPC story broke, while Richards became\nchairman of the board, stated in part, \"The public service recoras of the three\nstations is outstanding in every respect...we are confident that at the public\nhearing, which the FCC has ordered to be held, these charges will be shorn to be\nwithout foundation.\nPETRIJLO \"SITS IN\" ON THE GODFREY SHOW\nJames Petrillo, president of the AFP, says if musicians talk or sing on the radio,\nthe AFM and nobody else will see that they get paid for it. The question was\nraised after funny-man Arthur Godfrey told his bandsmen not to talk or sing on\nhis radio program-—he said if they so much as laughed lie would have to pay three\nthousand dollars extra. Godfrey said the extra money would 1 e involved because\nAFRA would be involved as we11 as AFP.\nRUSSIA. ADDS TIME TO U.S. SHORTWAVE \"BEAK\"\nThe Soviet Embassy reports in its official publication, the USSR Information\nBulletin that the Red Network has added another program to its American schedule,\nraising its daily broadcasting time to this country to 2 hours and 55 minutes\neach day. Broadcasts are beamed to this country in English.\nThe State Department’s \"Voice of America” broadcasts to Russia only 2 hours each\nday. Department officials state the \"Voice\" is playing a valuable role in the\ncold war with Russia by getting the \"true story of America” through the iron\ncurte.in. Leading credence to this statement are reports that Russia attempts\nto jam\" our Moscow-bound transmissions.\nWEAR \"DOOUPBIIE CLUB\" AT M ICHIGAN STATE COLLECT!\nby\nFaced with increasing competition for listeners\\more than 100 other stations\nin Michigan (most of them new since the war’s end) Robert Colaman director of\nUAEB’s 1 ichigan State College outlet, WEAR developed a number of listener-\npromotion plans, including the Bookmobile Club worked out in cooperation with\nthe Michigan State Library.\nWith the aid of posters, listing both WEAR and WEAR-EM frequencies, a special\nmembership card, and a special WEAR button designed to appeal to \"small iry\",\nthe project requires each prospective child member to send in a list of five\nchildren’s books he has read with the list signed by parent, teacher, or.\nlibrarian. Initial announcement brought 300 requests, and more are flooding in\nand each child becomes a walking promotion piece for WEAR."
}