{
  "id": "d1800-20",
  "text": "-21-\nUFIVERSITY OF HAWAII ORGANISES RADIO WORK\nSporadic broadcasts over commercial stations have been made by the University of\nHawaii for many years. But under the impetus of Thomas bickerson, University of\nPublications Editor, and others, Dr. Henry I. Eubank of the University of Wisconsin\ncame to Honolulu and spent one semester, surveying the possibilities of radio at\nHawaii. In a lengthy recommendation-report (which many NAEB members would find\nintensely interesting and useful), Dr. Ewbank encouraged the University to organ¬\nize its broadcasting activity under one head, to increase the classes in radio to\nbe offered, and to increase its time on the air.\nAs a result of all this. Dr. Melvin R. White, who will be remembered by some of\nyou as a former vice-president of the NAEB during his years at KWSC, and as Direct¬\nor of the University Broadcasting Service at Indiana University before the war\nand Skornia, has been appointed Coordinator of Radio Services and .Associate\nProfessor of Speech. With the assistance of a committee of deans and professors,\nho is supervising the building of new studios, and putting into effect Dr. Ewbank’s\nsuggestions.\nThus far, the following broadcasts are given over four of the five local commercial\noutlets:\nTime\nStation\nProgram\nType\nSrt. a.m,\nS;30-8:45\nKP0A\nHawaii Town and Country\nHomemailing & Agric\nSat. p.m.\n12:15-12:30\nKULA\nIsland Homemakers Review\nHomemaldng\nSat. p,m0\n12:45~1:00\nKG1 B & Network\nAgricultural News\nAgriculture\nSun. a.m.\n8:00-8:15\nKH0H\nBetter Farrs and Homes\nConsumer Education\nSun. a.m.\n10:00-10:15\nKGMB & Network\nAgricultural News\nAgriculture\nSun. p.m.\n7:30-8:00\nKP0A\nUniversity on the Air\nGeneral\nWed. & Fri.\n6:35-6:40\nKH0N & Network\nMarket Reports\nAgriculture\nThurs, p.m.\n4:30-4:45\nKH0N & Network\nAsk the Professor\nGeneral\nThurs p.m,.\n6:30-6:45\nKULA\nU. of H. Radio Workshop\nGeneral\nIn short, the University of Hawaii has eight different broadcasts on the air week¬\nly, a total of one hour and forty-five minutes. Five of these are agricultural\nand homemaking in nature, whereas the other three consist of forums, musical shows,\ndramatic shows, student talent and faculty talent. It is planned that in January\n1949, a weekly thirty-minute faculty forum will be presented in addition to the\nshows already aired, and other programs are being given consideration, such as\n’’Your Speech” series to help improve the general speech standards of the Islands.\nClasses to be offered as part of the Speech curriculum include ”Introduction to\nRadio”, ’’Radio Production,” \"Radio Workshop,” \"Radio Writing,” and \"Advanced Radio\nWriting.” In addition to these, two courses are offered the general public on\na non-credit basis: \"Planning and Broadcasting of radio Programs\" and \"Radio\nAnnouncing and Acting.\""
}