{
  "id": "d1800-21",
  "text": "-22-\nWHAT IS THE NATIONAL ASSOCIATION OF EDUCATIONAL BROADCAST'S?\nHOW DOES IT SERVE EDUCATIONAL RADIO?\nThe National Association of Educational Broadcasters during the past three years\nhas steadily increased its number of active and associate institutions and\nindividuals to a total of rore than 95 members in 32 states, Hawaii, and the\nDistrict of Columbia.\nN-A-E-B represents the non-commercial educational AM and FM radio stations,\nworkshops, and production centers owned and operated by colleges, universities\nand public service agencies.\nN-A-E-B represented 9 member stations in Cloar Channel hearings before the Federal\nCommunications Commission in 1947-48, appeared before the Senate Interstate and\nForeign Commerce Committee hearings on the Johnson Bill in 1948, and has had\nobservers and participants in the FCC Mayflower hearings, the newly-formed Univer¬\nsity Association for Professional Radio Education, the FCC television hearings,\nand numerous conferences and radio meetings*\nN-A-E-B sponsored a special session at the Ohio Institute for Education by Radio\nand maintain liaison relationships with the School Broadcast Conference, the\nAssociation for Education by Radio, the Federal Radio Education Committee of\nthe Office of Education, the Canadian Broadcasting Corporation, the British\nBroadcasting Corporation and the North American Service of Radio Diffusion.\nN-A-E-B, acting through its central office and regional directors lias supplied\nthrough correspondence and by special consultant trips a free-consulting service\nto members and to colleges and universities establishing or planning to establish\nfor the first time their own broadcast outlets either AM or FM.\nComplete detail on membership in the N-A-E-B may be\nobtained by contacting N. I* Griffith, Secretary -\nTreasurer, Station WOI, Iowa State College, Ames, Iowa*\nThe N-A-E-B has regional directors who are ready and willing to extend informa¬\ntion and advice to prospective educational broadcasters or to answer questions on j\nmembership and policy. Their names and locations:\nSeymour Siegel\nGraydon Ausmus\nHarry Skornia\nIrving Merrill\nRalph Steetle\nJames Morris\nREGION I\nREGION II\nREGION III\nREGION IV\nREGION V\nREGION VI\nStation UNYC\nStation WUOA\nStation WFIU\nStation KUSD\nStation WLSU\nStation KOAC\nMunicipal Bdcst. System, New York City\nUniversity of Alabama, University, Ala. '\nIndiana Univers ity, Bloomington, Ind. j\nUniversity of South Dakota,Vermillion\nLouisiana State University, Baton Rouge ;\nOregon State College, Corvallis, Ore. j\nEXECUTIVE SECRETARY - M. S. Novik, Room 370, Fifth Avenue, New York City\nGENERAL COUNSEL - Marcus Colin, Evans Building, Washington, D.C.\nDIRECTOR OF STUDIES - Dallas Smythe, University of Illinois, Urbana, Illinois.\nLIAISON OFFICE - John Dunn, WNAD, University of Oklahoma, Norman, Okla*\n- Richard B. Hull, WOI, Iowa State College, Ames, Iowa\nCENTRAL OFFICE"
}