{
  "id": "d1800-23",
  "text": "authorizations. Here* alas* X cannot duck behind the protective iv&ll of\n\"this matter is awaiting Commission decision.\"\nSeriously, I oan appreciate the reaction to this order of those of you\nwho operate daytime AH station©« I know that for many years the STAs have\non oocasion been a small solace when the sun went down* I think you de¬\nserve some discussion of this action0\nWhen the Commission decided to re-write its rule on STAs* it had been faced\nwith a serious problem of orderly administration. As a result of the great\nincrease in the number of daytime stations after the war* we were daily be¬\ning besieged with great volumes of eleventh hour requests for authority to\nbroadcast so-called special ©vents programs.\nHow you must bear in mind that th© previous rule providing for STAs was it¬\nself merely a procedural device. It reserved to the Commission a measure\nof latitude to waive or disregards if you will* soma substantive rule or\nprohibition where good cause was shown or undue hardship to the public might\notherwise result in particular oases*\nBut in the light of th© post-war developments * the oaso-by-oase method of\nsifting the meritorious from the unmeritorious requests was rapidly break¬\ning down into a hit-or-miss proposition* It was becoming impossible to dis¬\ntinguish the one from the other. If you were sitting in our place9 I think\nyou too would have almost thrown up your hands in dismay.\nVI© have never been able to develop a reasonable standard for judging th©\nmerits of particular requests for STAs nor has one ever been, suggested to us0\nHow thia may sound to you like a serious™admission of the i^&knoss or futility\nof the administrative process„ But reflect on the fact that basically the\nSTA itself was a method by which an exception was made to an established policy\nor standardo I think you will see how anomalous it was for th© Commission to\nbe granting so many exception® to the rules that the rules themselves were be¬\ncoming exceptions* You will probably say that under these circumstancea* tn©\nrule limiting certain stations on clear channels to daytime operations should\nhave been given a decent burial and revered in memory only. But if we had\ntaken that position* w© would have met ourselves coming around the corner be¬\ncause w© were having th© clear channel proceeding in which we were trying to\ndooid© whether that rule should be killed and buried*\nTELEVISION AND EDUCATION\nA word on television* The Commission as you know has presently been hold-\niag hearings on the^'poasibilitiss of expansion into the 476* to 890 megacycle\noand. Chairman Coy in a speech last July at tha University of Indiana—in-\noidentally a thoroughly meaty speech on education and radio which I recommend\nthat you all read-surged educators to request space in this band. I know\nDick Hull* your President—ha3 written the Commission in this respect and I\nunderstand that at this meeting you are considering what action you will take*"
}