{
  "id": "d1800-5",
  "text": "_6.\nWNYC ENGINEERING SUPERVISOR TO CHINA FOR FOUR MONTHS VISIT WITH PARENTS\nHorn Hong Wei, engineering broadcast supervisor of the Municipal Broadcasting System,\nleaves Newark,Airport Monday evening, November 15, for a four months1 visit with\nhis parents, Mr. and Mrs, Horn Wah Hong of Canton. Nip. Wei1 s itinerary includes\nstops at San Francisco, where he will board a Pan American plane to Hong Kong, by\nway of Honolulu, Midway, Wake Island, and Guam, Hr. Wei will be seeing his mother\nfor the first tine in eighteen years, and his father for the first time in 11 years.\nIr. Wei, who was acting chief engineer for WNYC and WNYC-FK during World War II,\nholds the degree of Bachelor of Electrical Engineering in communications from the\nPolytechnic Institute of Brooklyn and took specialized work at tho RCA Institute.\nThroughout the administration of the late Mayor LaGuardia, Mr. TTei served as the\nlatterTs engineer on his regular Sunday ”Report to the People”, and supervisied the\nengineering set-up for most of the important war-connected special events.\nN-A-E-B ATHLETIC PICK-UP EXCHANGE SERVICE\nWestern Conference NAEB stations have arranged an exchange-service plan to facili¬\ntate the problem of making remote pickups from intercollegiate athletic contests\nand similar events. Eight of the nine universities in the league (Northire stern\nhas no station) are signatures to the agreement.\nUnder the plan the radio station of the institution where the game is being played\nwill provide engineering help and tho necessary equipment to make the pickup. The\nvisiting school will supply its own announcer, unless specifically arranged other¬\nwise. It will call for and pay for any additional help, such as spotters or\nbotwecn-halves reporters, which may be needed. This will enable the announcer to\ntravel fast and light—by piano if desired—without being encumbered with equipment.\nAll parties to the arrangement have agreed to supply this service for a flat charge\nof 315 (except I innesota—,)25) which is expected to be about the actual average\ncost of paying for the extra help needed.\nIn case you want to make a pickup at one of the car puses, and want to make arrange¬\nments, gets in touch with these people.\nUniversity of Illinois, WILL, Frank E. Schoolcy\nUniversity of Indiana, 'JFIU, II. J. Skornia\nUniversity of Iowa, WSUI, Carl Menzer\nUniversity of Michigan, WHOM, Waldo Abbot\nUniversity of Minnesota, KUOM, Berten A, Holmberg, Chief Engineer\nOhio State University/, WQSU, R* C. Higgy\nPurdue University, WMA, Jim Miles\nUniversity of Wisconsin, WHA, Bill Harley\nFurther details regarding the plan and other similar cooperative arrangements may\nbo obtained from Harold Engel, Assistant Director, Station WHA, University of\nWisconsin, 1 adison, Wisconsin.\nWLSU RECORDS CHILDREN'S CAROLING\nChristmas week programming on WLSU, NAEB outlet in Baton Rouge, La., included 6\nschool choirs brought to WLSU studios for recording. Four hundred children took\npart in the singing, reports Ralph W. Stcotlc, Dirccor of NAEB Region V."
}