{
  "id": "d1490-0",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nBULLETIN\nUrbana, Illinois\nFebruary 18, 1935\nPresident: W. I. Griffith, Iowa State College.\nVice-President: H. G. Ingham, University of Kansas.\nSecretary-Treasurer: 3. B. Brackett, University of South Dakota.\nExecutive Treasurer: T. M. Beaird, University of Oklahoma.\nGreetings to NAEB Members and Friends:-\nAt the Kansas City meeting last Fall a number of us promised to get out an\nissue of the Bulletin* It was to be a monthly affair and was to start immediately.\nHere is the first:.: we apologize for its incompleteness, but it is at least an\neffort in the right direction* Undoubtedly each succeeding number will be better\nthan its predecessors.\nYou will note the lack of originality on our part in the contents here set\nforth. Practically the entire comments are contributions from other members. And,\nafter all, undoubtedly a bulletin of this kind can best be of service by exchanging\nideas that come from the membership.\nA number of station directors have sent me copies of their programs. Many\ngood ideas are contained therein, but the task of condensing them into usable\nmaterial for the bulletin is too great. Wouldn't it be a good idea for every mem¬\nber to include all NoA.S.B. members on his mailing list? When new WILL programs\nwere printed early in February we sent copies to all educational stations on the\nonly mailing list we had available. A new list should be available in the near\nfuture o\nPresident Griffith, WOI, Ames, is to get out the next bulletin about March 1.\nLet's all send him some suggestions and comments. After all, this series of Bulle¬\ntins will be just what each of us, as members, contribute from time to time. Let's\nget going'.\nThe sincere wishes to all of you.\nWright-Schooley-Phillips\nWILL\n#\nMr. W. I. Griffith, director, radio station WOI, Iowa State College, Ames,\nIowa, president of the NAEB, as representative of his organization, attended the\nannual meeting of the National Committee on Education by Radio in Washington, D.C.\non January 21.\nThe NCER selected the following officers for 1935: Mr. Joy Elmer Morgan,\nchairman; Dr. Arthur G. Crane, vice-chairman; Dr. Tracy F. Tyler, secretary;\nMr. J, W. Crabtree, treasurer; and Mr. Armstrong Perry, counsel. Members of the\nNAEB will be particularly glad to note that the Committee expects to continue for\nthe present its practise of retaining a legal counsel (Mr. Horace L. Lohnes,\nMunsey Building, Washington, D. C.). The fact that the Committee has made him\navailable to educational stations has saved them thousands of dollars. A subcom¬\nmittee which had been assigned the task of determining a definite future procedure"
}