{
  "id": "d1490-2",
  "text": "-3-\n2. Under the revision of the constitution governing the National Association\nof Educational Broadcasters, we feel that it is well to state again the article\ndealing with all memberships:\n\"Membership: (a) Any college or university of recognized standing engaged\nin educational broadcasting (whether the institution owns its own transmitter or\nuses some other) may be elected to membership in this organization by approval of\nthe executive committee, and a two-thirds affirmative vote of all active members\nof the association* Each member institution shall be entitled to one vote.\n\"(b) Individuals of faculties of recognized institutions are interested\nin educational broadcasting may become associate members of this association by\napproval of the executive committee, and a two-thirds affirmative vote of all\nactive members of the association* Associate members shall have all of the privi¬\nleges of active membership, except that they shall not be permitted to vote or to\nhold office.\n\"(c) Any experimental or amateur station, owned and operated by a recognized\neducational institution, may be elected to associate membership.\n3. In the course of a few days the annual announcements relative to member¬\nship fees, etc. will be made through the regular offices of the Association, and\nfrom advance correspondence it is predicted that the Association will this year\nenjoy the largest membership in its history.\n4. During the past several weeks, Professor J.C.Jensen of Nebraska Wesleyan\nUniversity has been assembling material giving the complete history of the Associa¬\ntion from its beginning in 1925. Some excellent research has been done by Profes¬\nsor Jensen to this date, but it is being temporarily held up awaiting the final\ndecision of Dr. Levering Tyson as to issuing a history covering all stations holding\nmembership in the Association.\n5* The regular officers and executive committeemen elected to serve until\nOctober 1, 1935 are as follows;\nPresident: W. I. Griffith, Iowa State College, Ames, I0wa\nVice-President: H. G. Ingham, University of Kansas, Lawrence, Kansas\nSecretary-Treasurer: B. B. Brackett, University of South Dakota,\nVermillion, South Dakota.\nExecutive Secretary: T. M. Beaird, University of Oklahoma, Norman,\nOklahoma.\nExecutive Committeeman at Large: Joe Wright, University of Illinois,\nUrbana, Illinois.\nExecutive Committeemen:\nFirst Zone: C. A. Taylor, Station WESG, Cornell University,\nIthaca, New York.\nSecond Zone: R. C. Higgy, Ohio State University, Columbus, Ohio.\nThird Zone: E. P. Humbert, Texas A. & M« College, College Station,\nTexas.\nFourth Zone: h. B« McCarty, University of Wisconsin, Madison,\nWisconsin.\nFifth Zone: F. F. Nalder, State College of Vfeshington, Pullman,\nWashington.\n6. The following committees were regularly appointed in the business session\nof the Kansas City Convention:\n(l) Committee on Federal Chain Education Program Development;\nChairman: Frank E* Schooley, University of Illinois, Urbana\nBruce Mahan, Iowa State University, Iowa City\nHerman James, University of South Dakota, Vermillion."
}