{
  "id": "d1490-3",
  "text": "-4-\n(2) Committee on Short Wave Transmission between Stations:\nChairman: Carl Menzer, State University of Iowa, Iowa City\nW. E. Phillips, University of Illinois, Urbana\nR, Co Higgy, Ohio State University, Columbus.\n(3) Committee on proposed Recorded Programs:\nChairman: T. M. Beaird, University of Oklahoma, Norman\nHo Bo McCarty, University of Wisconsin, Madison\nCo A. Taylor, Radio Station WESG* Elmira, New York.\n#\nSecretary-Treasurer of NAEB, Professor B. B« Brackett of KUSD, says:\n\"The Secretary-Treasurer needs all information possible about schools that\nhave regular broadcasting schedules over stations not owned or operated by the\nschools. The changes recently made in our constitution opens regular membership\nto such schools* Will those of our members who are near schools broadcasting regu¬\nlar educational programs through stations that are either owned or operated by\noutside parties or who from any unusual contacts of any kinds are familiar with any\ncases of such broadcasting, please report the mere facts to the N.A.E.B. Secretary-\nTreasurer, care KUSD, University of South Dakota, Vermillion, South Dakota? In this\nway we ought to secure a substantial increase in our membership; and it is up to\nyou individually to do your part in helping your officials in this matter.\"\nDEVELOPMENT OF POSSIBLE RESOURCES\nHere's a contribution of L. L. Longsdorf, Program Director for KSAC, Man¬\nhattan, Kansas:\n\"In looking ahead and planning for the future development of our educational\nprograms by radio, it seems imperative that we should not neglect the possibilities\nof developing the commercial radio station outlet. The directors of these stations\nare most instrumental in shaping and planning the concerted efforts of their listen¬\ners. Similar to the editors of our daily and weekly newspapers, these directors\nare ever alert to the changing elements that are influencing the thoughts and ac¬\ntions of the peoples of America*\n\"Their opinions are at all times creeping into the innermost thoughts of our\nrural and industrial centers* Through their radio contacts, they are at all times\nguests to the listeners, listeners who come to know these directors and their asso¬\nciates as next-door neighbors, as purveyors of the opinions of National and World\nleaders, and as individuals to whom to turn in shaping their opinions and judgments\nprior to taking action*\n\"These directors of our commercial radio stations should not, and cannot\nrightfully, be left out of the educational institution picture.\n\"Granted that this source of communication should be encouraged, how might\nwe go about the problem of its development?\n\"Is it not possible for us to discuss with these radio directors the\nfield of work in which we are engaged?\n\"Is it not possible for us to passion to them the opinions of farm and\ncity peoples with whom we associate?\n\"Is it not possible for us to interest the directors in a cooperative\nendeavor, along with our interests, in improving the standard of living\nof our countrymen?"
}