{
  "id": "d1490-4",
  "text": "-5-\n\"It may take some salesmanship in the beginning* But it can be done by\nvisiting the directors, explaining our aims and ultimate goals. Then, too, there\nis the good will that can be created between commercial radio interests and educa¬\ntional institutions by personal interviews.\n\"It is usually the uninformed who object, to any cause, if the cause is\njustly founded.\n\"Then, too, we also learn. Our appreciation of what the commercial director\nneeds for his listening audience will be enlarged. We can then write, talk, and\npicture our educational materials in such a way that they will more properly fit\ninto the commercial radio station broadcasting pattern.\"\n#\nJames W. Barrett, Editor of the Press-Radio Bureau of the publishers’\nNational Radio Committee has sent many stations a reprint of an article on \"Radio\nand the Press,\" by Mr. E. H. Harris, Chairman of the Publishers' committee, which\nappeared in the Annals of the American Academy of Political and Social Science,\nissued January 10th, 1935. Better look up the issue or write Mr. Barrett, 551\nFifth Avenue, New York City, for a copy of the reprint.\n#\nWHAT EDUCATIONAL STATIONS ARE DOING\nOn Wisconsin'. Supplied by Harold A. Engel, Promotion Director at behest of\nProgram Director Mac McCarty, WHA:\nDevelopments in the Wisconsin College of the Air show a new use for radio in\nsupplementing the educational programs of the Wisconsin penal institutions. The\nstate penitentiary uses the programs regularly and welcomes them particularly\nbecause few qualified teachers are found among the convicts and no funds are pro¬\nvided for hiring teachers. The state reformatory is well equipped with radio and\nwill on February 1, make use of the broadcast programs.\nThe educational program affords leisure time activity so necessary for those\nin confinement. Some prisoners, prior to the installation of the receivers to\nbring in the V/isconsin College of the Air, had never before heard a radio.\nBy means of a studio in the state capitol and a permanent wire connection\nWHA broadcasts events and messages of state importance coming from the governor,\nlegislators and state officials.\nUseful in stimulating an interest in radio are meetings held in the broad¬\ncasting studios. The radio section of the Southern Wisconsin Teachers Association\nwill meet in the WHA studios on Friday, February 8. Those present will see and\nhear actual broadcasts of features of the Wisconsin School of the Air. The meeting\nwill feature a talk by a teacher who uses the broadcasts as a part of her class work\nPTA groups, women's organizations, luncheon clubs welcome invitations to\nvisit the studios. If you don’t believe it just drop a suggestion to some of your\nlocal bodies. They’ll come many miles to see you.\n#\nThe prize-winning long-distance attendant of the Kansas City Convention,\nFrank F. Nalder of KWSC, State College of Washington, contributes his bit;\n\"KWSC at the State College of Washington, Pullman, Yfeshington, is engaging\nin a vigorous campaign, in its state and the Northwest generally, to encourage the\nuse of radio broadcasting of the schools of the state. The management of KWSC"
}