{
  "id": "d80-104",
  "text": "Af\ny\nMarch 3, 1966\nMr. Frank M. Merklein\nProduction Manager\nForeign Operations\nTime-Life Broadcast Inc.\nTime Life Building\nNew York, New York 10020\nDear Mr. Merklein:\nMiss Susan Gallagher of our staff has told us of your interest in\na Sustaining membership in the NAEB for Time-Life Broadcast, Inc.\nWe are very pleased to hear of this interest and are forwarding\nmembership information to you as you have requested.\nThe National Association of Educational Broadcasters is the only\nprofessional and trade association serving the field of educational\nbroadcasting. Our members represent more than four hundred educa¬\ntional radio and television stations, production centers and closed-\ncircuit installations; more than 2000 individual members who are\nengaged in or seeking to promote educational, cultural, and public\nservice broadcasting; and over one hundred schools, universities,\nassociations, commercial stations, and industrial firms which are\na part of the expansion and development of education via the broadcast\nmedia. I am enclosing a booklet which will tell you more about the\npurposes and activities of the Association. Also enclosed are copies\nof some of our publications.\nAs a Sustaining Associate, your company would be joining such firms\nas National Community Television Association, Crowe11-Collier Publi¬\ncations, RTA International, the National Broadcasting Company, etc.\nin showing an interest in educational broadcasting and a willingness\nto assist in the work of educational broadcasting’s national organi¬\nzation. Our Sustaining Associates, as a contribution to the national\neducational broadcasting movement, pay annual dues of $200. They\nreceive certain tangible benefits in return for these dues.\nA brief summary of these benefits would include reduced rates at our\nannual convention and receipt of multiple copies of our periodicals,\nas well as the various reports we publish from time to time; special\nrates for advertising in some of our publications; invitations to\nparticipate in our regional meetings and workshops; and listing in\nour educational broadcasting directory."
}