{
  "id": "d80-107",
  "text": "March 14, 1966\nMr, Richard J. Zbitler\nManager\nTELE-BEAM\nThe Kalart Company, Inc.\nPlainville, Connecticut 06062\nDear Mr. Zeitler:\nI am sorry for the delay in answering your letter of February\n15 regarding membership in the NAEB and your interest in exhibiting\nat our annuAl convention. Before writing you, however, I wanted\nto have printed brochures which outline the costs and regulations\nfor exhibiting.\nThe National Association of Educational Broadcasters is the only\nprofessional and trade association serving the field of educational\nbroadcasting. Our members represent more than four hundred non¬\ncommercial radio and television stations, production centers, and\nclosed-circuit educational broadcasting installations, and more than\n2000 individual members who are seeking to promote educational, cul¬\ntural, and public service broadcasting. Also included in the member¬\nship are approximately one hundred schools and universities, asso¬\nciations commercial stations, and industrial firms which are a part\nof the expansion and development of education via the broadcasting\nmedia.\nIt would be an honor to welcome TELE-BEAM into membership in the\nNAEB as an Industrial Association. Your company would be joining\nsuch firms as Sarkes TarziM, RCA, 3M and Continental Electronics\nProducts, etc., in showing an interest in educational broadcasting\nand a willingness to assist in a small way in the work of educational\nbroadcastingvs national organization. Our Dndustrial Associates, as\na contribution to the national educational radio and television\nmovement, pay dues of $560 annually.\nI am enclosing a brochure which describes in brief the aims and acti¬\nvities of the NAEB. Also enclosed are copies of some of our publica¬\ntions. As an Industrial Associate of the NAEB, you would receive\nmultiple copies of our periodicals, as well as the various reports we\npublish from time to time and you would also receive special rates for\nadvertising in some of our publications."
}