{
  "id": "d80-110",
  "text": "March 15\n1966\nM?\nO/J**\nMr. E.A. Wheeler\nAdministrator\nEducation and Training Department\nBell Telephone Laboratories\nMurray Hill, New Jersey 07971\nDear Mr. Wheeler:\nIt has been brought to our attention that you are interested in\nknowing about the NAEB, its activities and services to its members.\nThe National Association of Educational Broadcasters is the only\nprofessional and trade association serving the field of educational\nbroadcasting. Our members represent more than four hundred educa¬\ntional radio and television stations, production centers and closed-\ncircuit installations! more than 2000 Individual members who are\nengaged in or seeking to promote educational, cultural, and public\nservice broadcasting; and over one hundred schools, universities,\nassociations, commercial stations, and industrial firms which are a\npart of the expansion and development of education via the broadcast\nmedia. I am enclosing a booklet which will tell you mor4 about the\naims and activities of the Association. Also enclosed are copies of\nsome of our publications.\nCommercial concerns may affiliate with the NAEB in either of two\ncategories. Those engaged in the manufacture and/or sale of broadcast\nor auxiliary equipment may become Industrial Associates, while all\nother business firms would become Sustaining Associates. Among our\nIndustrial Associates are 3M, RCA, GE, Sarkes Tarzian, AT&T, etc.\nand Sustaining members include RTA International, Crowe11-Collier\nPublications, NBC, National Community television Association and others.\nOur Industrial Associates, as a contribution to the national educa-}\ntional broadcasting movement, pay dues of $500 annually. The annual\ncontribution for Sustaining members is $200. Both membership categories\nreceive certain tangible benefits in return for those dues.\nA brief summary of these benefits would Include: multiple copies of\nour publications; special rates for advertising in some of our\npublications; for the Industrial Associates, the first opportunity\nto select exhibit space at our annual convention; and perhaps most"
}