{
  "id": "d80-118",
  "text": "Mr* Wfcrd Deutaehman\npage 2\nAugust 26, 1966\nThis is but a bare outline# In addition, although ve do not\nattempt to persuade our members to buy from our Industrial\nAssociates in preference to other concerns, it is only reason¬\nable to presume that educational broadcasters, often, struggling\non minimum budgets, would prefer to give their business to those\ncommercial concerns which have evinced a sincere interest in the\nwelfare and furtherance of educational broadcasting. Industrial\nAssociates also are considered \"part of the family” at our\nRegional Meetings and annual conventions and thus are able to\nchat more intimately with our members. Representatives of our\nIndustrial Associates are invited to attend most of our seminars\nand workshops and thus meet with NAEB members on a very infoimal\nbasis*\nI hope that it will be our privilege to welcome Harvey Radio to\nour Association as an Industrial Associate. There is no member¬\nship application to complete for this category of membership. All\nwe need is a letter from you stating your intention of joining. We\nwill bill you as you wish, or you can send your membership fee along\nwith your letter.\nRegarding exhibiting at our annual convention, I have checked with our\nConvent 1cm Coordinator, and she tells me that both distributors and\nmanufacturers are eligible to exhibit. She suggested that if you\nare interested in exhibiting at our upcoming Convention in Kfensas\nCity, October 23-26, that you contact our adhibit Manager immediately.\nIt is her understanding that there are only four remaining booths, so\nperhaps you would want to call him rather than rely car the U.S. mails.\nHe is Frank Masters, Trade Associates, Inc., 5151 Wisconsin Avenue, N.W.,\nWashington, D.C. The telephone number is 362-2794. If you are unable\nto speak to Mr. Masters, his secretary, Mrs. Duty will be able to help\nyou.\nI have also enclosed some infoimtion about Individual Membership in\nour organization. If you wish to become an Individual Member, you\nhave only to fill in the enclosed application and return it to me to¬\ngether with a check in the amount of $15*00. We will see that you are\nadded to our membership list immediately so that you may begin to receive\nthe publications to which membership entitles you.\nIt was good talking to you today, and I am hopeful that Harvey Radio will\ndecide in favor of becoming an Industrial Associate. If you have any\nquestions, or need any additional information, please do not hesitate to\nget in touch with us.\nSincerely,\nSandra Olson\nMembership Associate"
}