{
  "id": "d80-125",
  "text": "September 20, 1966\nCaptain T. J. Ryan\nCommanding Officer\nCoEsannication- Electronics School Battalion\nMarine Corps Recruit Depot\nSan Diego, California cJ2lkG\nDear Captain Ryan:\nMy apologies for the delay in replying to your letter\nrequesting information about associate membership in\nthe NAEB. I have been away on vacation, and unfortunately,\nyour letter was buried in a pile of papers and was (Maly un¬\nearthed this morning.\nDuring the past few years, many military installations have\nexpressed an Interest in becoming a member of the Rational\nAssociation of Educational Broadcasters, However, there was\nno appropriate membership category for them since the cost of\ninstitutional membership ranges from $100 - $700, and military\nInstallations found it impossible to Justify this amount In\ntheir budgets.\n(therefore, the HAJSB Board of Directors approved last year the\nestablishment of a Military Associate category of membership,\nwith annual dues of $45.00. (This fee entitles Military Associates\nto monthly copies of our newsletter, M-monthly copies of our Journal,\nalong with various other NAEB publications and reports which are sent\nto our members from time to t&&e. You would also be invited to attend\nand participate in our annual convention at a low membership rate, and\nattend workshops, seminars and regional meetings where you would meet\nwith others operating closed-circuit installations all over the world.\nThe NAEB Convention is being held this year, October 23 - 27, at the\nMuehlebach Hotel in Kansas City, Missouri. X am enclosing a brochure\nwhich explains the purpose of this convention and also describes the\naims, activities and purpose of the MSB. An Aimed Forces Meeting is\nbeing scheduled for Tuesday, October 25th, tram 2:00 to 5:00 p.m. For\nadditional infonmtion about this meeting you may want to contact Dr.\nJoseph H. Kanner, iMucatian Specialist, Pictorial & Audio-Visual,\nU.S* Amy, 2100 l4th Street, North Arlington, Virginia."
}