{
  "id": "d80-16",
  "text": "NASH HEADQUARTERS\n1346 Connecticut Avenue, N.W.\nWashington, D.C. 20036\nMEMORANDUM\nTO: ALL NAEB ACTIVE, ASSOCIATE, AND AFFILIATE MEMBERS\nFROM: Harold E. Hill\nRE: Dues for 1964\nDATE: December 11, 1953\nAs explained in the latest Nashington Report (which all of you\nshould have received fcy nowT\", at the txme the new organizational\nstructure was approved at Milwaukee, the membership also approved\na new dues structure to taka effect as of January 1, 1964. We\ntherefore need information from all present institutional members\nabout the categories of membership to which they wish to belong,\nand information to permit us to know what dues to assess.\nMEMBERSHIP CATEGORIES\nInstitutional - Radio Station Division-: Open to institutions\nand organizations engaged in educational, cultural and public\nservice non-commercial broadcasting over a radio station recognized\nas under its control by the FCC. (Now classified as Active members.;\nInstitutional - Television Station Division: Open to institutions ar\norganizations engaged in educational, cultural and public service\nnon-commercial broadcasting over a television broadcast station\nrecognized as under its control by the FCC. (Now classified as\nActive members.)\nInstitutional - Instructional Division: Open to institutions and\norganizations engaged in the production and broadcasting of radio\nand/or television instructional and/or cultural programs (over\nstations not under their control), or institutions and organizations\noperating closed circuit television equipment for direct instructions\npurposes. (Now classified as Associate members.)\nInstitutional-Affiliate Membership: Open to institutions or organi¬\nzations \"producing\"or “seeking to promote educational, cultural and/or\npublic service programs or broadcasting (but not operating a radio\nor television station or closed circuit broadcast equipment).\nThis category was established to provide for those present Associate\nmembers who feel that they do not want to affiliate with the\nInstructional Division named above. (Would include some now\nclassified as Associate members, and perhaps some now classified\nas Affiliate members.)\nThe Radio Station Division, the Television Station Division, and\nthe Instructional Division will each elect its own Board of six\nmembers. The Institutional Affiliate members will be represented"
}