{
  "id": "d80-17",
  "text": "on the NAEB Beard of Directors by one Director-at-Large.\nEach institution or organization belonging to the NAEB may\nindicate one or more of the above categories to which it wishes\nto belong, if qualified. The final determination of eligibility\nwill, of course, rest with the Boards of each Division, or with the\nNAEB Board of Directors in the case of Institutional Affiliate\nmembers.\nNEW DUES STRUCTURE\nThe new dues structure is based on the operating budget of the\nmember. It is recognized that among educational institutions and\norganizations there are no uniform accounting and budgeting practices\nAppropriations budgets do not always reflect the total operating\ncost of the broadcast budget. For example, whereas community statior\nbudgets include items for rent, heat,, lights, maintenance, etc., most\nuniversity station budgets do not reflect these items since they are\nprovided by the general university operating budget. Hence the\nfigure you indicate for your budget should include actual expendi¬\ntures plus equivalents, such as those just enumerated, staff members\npaid by other departments, and other similar considerations.\nThe ranges gjtven in the dues table are large enough so that there\nshould be no real trouble determining a sufficiently accurate ' figur\nto establish the appropriate slot. We do not intend to question\nthe budgets reported, and we have to rely completely on your integrit\nin this matter, If there are questions because of any unusual or\nspecial situations, we will be glad to discuss with you what figures\nyou should probably report. Naturally, the figures you report for\nbudget to be used in the assessment of dues will be confidential\ninformation and will be treated as such.\nQualified members electing membership in more than one of the\nenumerated categories must pay dues appropriate for each Division,\nexcept that the maximum paid by any one member shall not exceed $750\nannually. Your dues would be based on the portion of the operating\nbudget allocated to each operation, ife, ,radio, television, etc.\nOperating Budget\nAnnual\nLess than $25,uu0\n1 $100\n$25,000-99,399\n200\n$100,000-249,999\n300\n$250,000-499,939\n400\n$500,000 and over\n500\nBILLING\nWe realize that problems may arise at some member institutions in\nregard to billing for the new dues. We will be happy to bill you in\nany way you designate - as dues (separately by Divisions, or in a\nlump sum, whichever you desire) fees, service fees, or what-have-you.\nWe would naturally prefer to bill you annually, but if absolutely\nnecessary we can arrange to bill you semi-annually or quarterly. In"
}