{
  "id": "d80-29",
  "text": "in, and this Is carried over Into needs so far as equipment is\nconcerned, so that Manufacturers night know sore about the\nspecialised needs of education.\nBut, perhaps you are more concerned about the specific kinds of\nthings we think the MSB ean do Or those who eight Join the\nInstructional Division. However, as Bill Harley has often said,\n\"the rising tide raises all the boats,\" and we feel that th«\ngeneral work we do for educational broadcasting in its nan;\nparts will bslp all those parts to sons degree.\n*e held s conference mi instructional television at the University\nof Illinois Inst spring, and we held another Just last month, at\nwhich cone ISO people engaged la ITV In sane way or another wet\nand discuesed their problems and got the advice of consultants\nChon ws brought la. Thsre is currently another such confer*!#,-.*:\ntentatively planned for eoaewhere in the southeast next fall.\n«e, in cooperation with ether educational nedla people, are\ncurrently corking with the school administrators on methods of\nfurther cooperation and, even more important, on the aannar in\nwhich we night better educate school and college administrator**\nas to the benefits ef television and the other media.\nWe are currently engaged ia a $100,000 project to prepare six\ncolor half-hour film on utilisation which are designed to help\ninform teachers aad sfoinistrators how they can sake ths best\nuse of television la instruction, these films will be available\nto IASS members semetims next fall to show to the people they want\nto \"educate,\"\n$mmi ef the detailed specifics of what our new Instructional\nDivision will provlds is the way of services will have to wait\nuntil ths Board meets la Columbus the early part of next month.\nAlready this Besrd has mst and agrssd oa a regular newsletter\nwhich will be seat to all members. Sac lowed ia the first copy\nof that newsletter. In general, it is hoped that we can help\nprovide informatlea ee utilisation (in addition to the above\nmoatioaod films), help in tralalag and finding qualified people,\ntaring about better relations with administrators, issue \"how-to-\n4o-.it\" manuals ef owe sort or another, end so oa. Hors of this*\ndetails are corked out snob tine the Board nests, and the attached\nnewsletter sill give yes ns Idea ef ths seep* of the Board's interest\nI trust that thin answers seme of the questions you had in mind,\nand I really feel that any institution engaged ia ITT will profit\nfrom membership. I might add that, even with the increased foes,\nthe ngntrvTahir dees not fully support ths operation of the MSB.\nWe still need to get thaueaade ef follars every year from other\neeorces - project greats end so oa - and this Is difficult when\nyou realise that we have had ae najor foundation support for"
}