{
  "id": "d80-35",
  "text": "SJCU <K'tf-TA\nDraft of letter for\nDear Mr. Kahn:\nReference is ma.de to your recent exchange of correspondence with Mr.\nGarard Appy of our Educational Television Stations Division.\nMifaEMxm Business concerns may affi Hate with the NAEB in either one of\ntwo categories. Those engaged in the manufacture, distribution, or sale\nof broadcast and related equipment and supplies may become Industr ia1\nAssociates jcrwiihkmarmmxAxiADCBismajflx^^/Sl^i,wwhi le other business firms, without\nsuch specific involvement in broadcast equipment, may become Sustaining\nAssociates fridttkmxmimocrtxiAxmxrmfoc$2^r)i. I believe, from your letter, that\nAcme Film Laboratories, Inc., fail fits into the latter ''.Category.\nThe NAEB is the only professional and trade association serving the field\nof educational broadcasting. Our members represent more than four hundred\nnwMmxmjmjrmxmih educational radio and television stations, pr oduction\ncenters, and closed circuit installations; more than lf>00 individual\nmembers who a re xmxkxrm engaged in or seeking to promote educational,\ncultural, and public service broadcasting; and over dne hundred schools,\nuniversities, associations, commercial stations, and industrial firms\nwho are a part of the expansion and development of education via the\nbroadcast media. I am enclosing a booklet which will tell you more\nabout the aims and activities of the Association. Also enclosed are\ncopies of some of our publications.\nAs a Sustaining Associate, your company would be joining smxmxmim&rmmximti\nsuch fimms as commercial stations,Mational Community Television Association,\nthe Educational Radio Network, the National Audience Board, and the ±ks\nNational Br oadcast ing Company.\nOur Sustdining Associates, as a contribution to the national educational\nbroadcasting movement, pay dues of $200 annually. Industrial Associates\npay $500 annually. Sustaining and industrial Associates also receive\ncertain tangible benefits in return for these dues.\nBmxm A brief summary of these benefits viould includemultiple\ncopies of our per iodicals axrit as well as the various reports we publish\nfrom time to time; special rates for advertising in some of our\npublications; listing in our member ship Directory; and, perhaps most\nimportant, xrmmxd&rnaik becoming \"part of the family\" at our Regional and\nNational meetings, thus permitting more informal and intimate conversations\nwith our members. Representatives of our Sustaining Associates are\nalso fmzrmmntdm invited to attend most of our seminars and workshops\nand thus meet with NAEB members on a very informal basis. In addition,\nalthough we do not attempt to persuade our members to patronize our\nSustaining and Industrial Associates in preference to other concerns,\nit is only reasonable to presume that educational broadcasters, often\nstruggling on minimum budgets, vwuld prefer rbo give their business to\nthose commercial concerns which have evinced a sincere interest in the\nwelfare and furtherance of educational broadcasting.\nImkvwBvciii±mmmJ:ih We hope that you will consider affiliating with us in\nthe educational br oadcast ing' movement. If you have further questions,\nplease do not hesitate to get in touch vnth me.\nSincere h;,\nwgh"
}