{
  "id": "d1639-0",
  "text": "UNIVERSITY OF ILLINOIS\nURBANA, ILLINOIS\nRADIO STATION WILL\nSeptember1 3, 1937\nDear Fellow Broadcaster:\nBy now you must have made your plans to attend the annual convention of the\nNational Association of Educational Broadcasters at the University of Illinois on\nSeptember 13 and 14* If not, this is your cordial invitation. If you have, this\nis simply a reminder.\nThe attached program will indicate the subjects that will be discussed on the\nconvention floors we have done everything possible to arrange matters to suit the\nmembership#\nIn addition to being present, we are asking you to help in two ways:\n1. Bring with you a written statement of approximately fifty words on each of\nyour outstanding programs. The statement should indicate the nature of the program,\nits length and any other outstanding characteristics that you may care to mention.\nPrepare as many statements as you have programs# Hand these in when you register\nso they may be mimeographed and distributed on Tuesday.\n2. At the time of registration leave with the girl the subject or subjects you\nwish discussed on the floor of the convention. Be prepared to discuss this yourself\nand perhaps lead the discussion at the Monday afternoon session following the talk\nby Howard Evans (of the National Committee on Education by Radio).\nThe official hotel has been designated as the Urbana-Lincoln. Rates run from\n$1.75 up. If you care to make advance reservations simply return the enclosed card\nto the hotel. The Inman and Beardsley hotels are located in Champaign. We will\nattempt to secure rooms in private homes for you if you wish.\nAll convention meetings will be held in Room 114 in the Woman’s Building, ex¬\ncept the engineering meeting on Monday night which will be held in the lower gym¬\nnasium of that building. All equipment displays will also be held in the gymnasium.\nThe Woman’s Building is located on South Wright Street.\nWith all good wishes and looking forward to seeing you at the NAEB convention,\nI am\nSincerely yours,\nJos. F. Wright\nDirector Station WILL\nP.S. Please note that we arb having a special session for the engineers on Monday\nnight, also a number of topics on the regular program that will be of interest to\nengineers# Please bring them along#\nJFW\nP.S. WHA is bringing seven to the meeting, WBAA four, etc. How many are you bring¬\ning?\nJFW"
}