{
  "id": "d433-136",
  "text": "FCC Notifies MPATI\nAn FCC notice of May 12 instructed its staff to draft a docu¬\nment that would deny MPATI’s petition for regular use of that\nservice on six channels in the upper UHF. The document will\npoint out that the FCC would permit continued MPATI oper¬\nation on six frequencies of the 2500 me band.\nAppalachia Committee Meets\nThe special Appalachia committee organized at the NAEB Re¬\ngion II conference in March met in Atlanta May 7. In its re¬\nport the group urges establishment of a regional educational\n■communications task force to develop a regional plan for de¬\nvelopment and operation of radio and TV programs and facili¬\nties. The regional plan would be based on state plans of the\neleven states.\nJohn Young, WUNC-TV, chairman of the committee, has\nscheduled another meeting for June 3 in Columbus, Ohio. Oth¬\ners who attended the Atlanta session are: Hill Bermont, Henry\nJ. Cauthen, David Chapman, Jr., Charles Drake, Tom Eden,\nLee E. Franks, E. H. Gilli's, Jr., Gregory Heimer, Robert M.\nHenderson, Presley D. Holmes, W. Frank Martin, Marjorie\nNewman, Louis Peneguy, O. Leonard Press, Jerrold Sandler,\nOdell Skinner, Ronald B. Stewart, and Kenneth D. Wright.\nRegion III Talks Available\nPhotocopies of the following presentations from the 1965\nRegion III meeting may be obtained from the publications of¬\nfice for 10c a page to cover duplication and postage; payment\nmust accompany order. These will not be published in the\nNAEB Journal.\n1. Bruner AND Brets: The Professional Training of\nITV Personnel, by Lewis A. Rhodes. 6 pages.\n2. The Theory-Practice Dichotomy in Instructional Tele¬\nvision, by Egon G. Guba. 11 pages.\n3. Closing the Gap—Research and Practice, by Lee S.\nDreyfus. 13 pages.\n4. Fulfilling the Instructional Role of TV, Viewpoint of\na School Executive, by H. R. Cromwell. 9 pages,\n5. An Appraisal of Current Developments in ETV Equip¬\nment, by Roger E. Peterson. 7 pages.\n6. I Wanna Be a Disc Jockey, by Robert F. Smith. 9\npages.\nInsurance Over $3,000,000\nNAEBers have more than $3 million of accident insurance in\nforce under the group plan for NAEB Individual Members,\nwhich was begun in January 1964.\nManagement Tapes Available\nETV stations may receive free of charge a series of 36 video¬\ntapes on the subject of management. The tapes, each approxi¬\nmately a half-hour in length, are primarily lectures by lead¬\ning practitioners in the subjects covered. Write Daniel C.\nCady, Assistant Vice President, American Management Asso¬\nciation, 135 West 50th Street, New York City 10020.\nTennessee Seeks ETV Info\nTennessee’s education department is interested in ETV courses\nwith emphasis on children pre-school through third grade.\nOfficials would like to hear from NAEBers who have offered\ncourses concerning child growth and development, materials\nand methods of training the young child, pre-school equipment\nand arrangement and techniques. They would like to know the\nname of the teacher, whether the course is on videotape,\nwhether credit was offered, whether it was considered suc¬\ncessful. Write to Mrs. Alice Kousser, supervisor, ETV, 102\nCordell Hull Building, Nashville, Tennessee 37219.\nCorrection!\nIn the list of coinmittees included with last month’s News¬\nletter, Zoel Parenteau, member of the ETS CATV Commit¬\ntee, was listed with an incorrect station affiliation. He is with\nKCSD-TV, Kansas City, Missouri.\nNews Notes\nPERSONNEL\n^ Stanley D. Handleman, of the TV Center at Brooklyn\nCollege, City University of New York, has been appointed di¬\nrector of the Peace Corps ETV project in Colombia.\n^ Joseph L. Manch, superintendent of schools, Buffalo, -N.- Y.,\nhas become chairman of the board of trustees of the Empire\nState FM School of the Air. He succeeds the late .Paul C.\nReed.\n^ Burt Harrison, manager, KWSC, Washington State Uni¬\nversity, is back on the job following recuperation from ex¬\ntensive surgery.\n^ Henry R. Cassirer has been named chief of a UNESCO\nunit for Educational Use of Mass Media. In his new position\nhe will assure close integration of the use of such media as\nradio, TV, film, and the press into the education effort of\nUNESCO member states, especially in adult education. He\njoined the UNESCO staff in 1952.\n^ The president of Colby College, Robert E. L. Strider, was\nelected president of the Colby-Bates-Bowdoin Educational\nBroadcasting Corporation at its recent annual meeting in\nAugusta, Maine, The corporation is the licensee for WCBB,\nLewiston, Maine.\nSTATE AND REGIONAL\n^ Nebraska ETV Network plans were aided recently when\nthe state legislature passed a law imposing an additional two\ncents a package on cigarettes; ETV will receive 35% of the\nrevenue. September 1 is the target date for completion of two\nchannels—3 at Lexington and 16 at Omaha.\n^ The Connecticut House has allocated to the Connecticut\nETV Corporation a needed $50,000 to carry ETV programs\nfor classrooms through June. This is in addition to an appro¬\npriation in 1963 of $200,000 for the biennium,\n^ The South Dakota legislature this year created an ETV\nBoard of Directors and appropriated money to establish an\noffice in Pierre, but failed to pass the money bill to estab¬\nlish the first phase of the state ETV network. The Board will\ndirect its primary efforts to submitting another bill next year.\nMeanwhile, a Center for ITV of the state’s ITV Council\nhas been set up at the University of South Dakota, as a co-\noperative service of KUSD-TV and the school of education.\nPurposes and activities are: exchange and distribution of TV\nprograms among the state’s TV stations and CCTV facilities;\nproduction of new TV series; holding Utilization workshops;\ncurriculum development of new ITV courses; informational\nservices; preparing future teachers to use TV effectively; and\ndevelopment of experimental programs under federal grants.\nStaffers are: Martin Busch, director; Ernest Phelps, associate\ndirector; Raymond Schroeder and Fred Peterson, curriculum\nconsultants; Dell Colwell, audio-visual consultant; Gaylord\nAyers, TV production; and James Prusha, technical director.\n^ A Wisconsin legislative finance committee has approved\nthe idea of Saturday broadcasting for the state’s radio net¬\nwork, but allowed only $14,700 for the biennium—enough to\ncover operating expenses for about four hours each Saturday.\nIf the legislature approves the committee recommendation, the\nlimited Saturday broadcasting will begin.\ny An ETV network for Illinois awaits decision by the as¬\nsembly and governor. The bill calling for the first phase of\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 119 Gregory Hall,\nUrbana, III. 61803. $5.00 a year. Editor: Betty McKenzie. Phone\n333-0580. Area Code 217. TWX 217-344-0970.\n2\nNEWSLETTER"
}