{
  "id": "d433-34",
  "text": "ALABAMA EDUCATIONAL TELEVISION COMMISSION\n21SJ HIGHLAND AVENUE\nWAIQ, CHANNEL 26\nCOMMISSIONERS\nBIRMINGHAM 5, ALABAMA\nWBIQ, CHANNEL IO WCIQ, CHANNEL 7\nJune 20, 1963\nH. MAYNARD LAYMAN\nPRESIDENT\nDECATUR\nVINCENT F. KILBORN\nMOBILE\nMrs. Marion Corwell\nAssociate Director\nSchool Relations\nDearborn Public Schools\n5757 Neckel\nDearbon, Michigan\nMRS. BERTHA S. ROBERTS\nGADSDEN\nHAROLD T. PURDY\nBIRMINGHAM\nROBERT L. HARPER\nMONTGOMERY\nPROGRAM BOARD\nTELEPHONE 322-4625\nWDIQ, CHANNEL 2\nRALPH DRAUGHON\nAUBURN\nAUSTIN R. MEADOWS\nMONTGOMERY\nFRANK A. ROSE\nUNIVERSITY\nTHEO WRIGHT\nBIRMINGHAM\nDear Marion:\nNow, I knew you had left the Henry Ford Museum,\nbut for the 1ite of me .. when I wrote to you ... I\ncould not recall where you had moved. Pleased to\nread that you are content in your new position.\nSTAFF\nRAYMOND D. HURLBERT\nGENERAL MANAGER\nAppreciated all the names and addresses of those\nto contact for potiental film material from Ford.\nAL RENFRO\nCHIEF ENGINEER\nLOUIS PENEGUY\nDIRECTOR\nCOORDINATION & INFORMATION\nMRS. MADGE LAW\nOFFICE MANAGER\nYour inquiry for ideas on the NAEB Speakers1\nDirectory finds me in a quandry. It is probably the\ntale of being in the forest. We have had a well-\naccepted ETV operation here for 6 of the past 8 years\nthat Alabama has had ETV. It would not be too hard\nto make suggestions on finding ETV speakers, but just\nwhere to find the NAEB speakers brings the question to\nmy mind .. where do speakers talk to encourage others\nto join NAEB outside of the educational broadcasting\nfield? If you can shed light on this, may be I can\nthink where to find the speakers.\nRegards.\nLouis Peneguy, Director,\nCoordination and Information\nThe Nation’s first ETV network telecasts simultaneously over four channels. Programming is originated by Auburn University,\nthe Birmingham Area Educational Television Association, the University of Alabama (which is also a NET affiliate), and CBS-TV\nand NBC-TV documentary programs and educational telecourses."
}