{
  "id": "d433-40",
  "text": "NAEB HEADQUARTERS\n13^6 Connecticut Avenue, N. W.\nWashington, D. C. 20036\nMEMORANDUM\nTO: NAEP Committee Chairmen\nFROM: Harold E. Hill\nDATE: August 21, 19^3\nWe would like to provide an opportunity for committees to meet at the\nconvention again this year* We will he able to make rooms available to you\nat any time on Sunday, November IT, for committee meetings. All you have to\ndo is let me know if you want a room on Sunday and what time you plan to call\na meeting of your committee.\nWe have also set aside the period from ^aj p^m^to- 2*rQ0 p.iiia^^JJediiesdajL,\nNovember 20, for committee meetings. This would give you an opportunity to\neat anrT taTE f,ngptheT» fror' sRVPral hours! We~afe~5Ptr Planning gcfaeduled\nluncheons, per se. (l*m sure you realize that it would be an extremely\ndifficult task to cuui diiiato some 10 Lu 20 luiicligggsT) However, I would\nrecommenftrthat you have .vour cumulil/tee niueb at to^-you\ncan make reservations with the hotel—and,\nluncheon me ^ _\nbe made availa&t^Tor^committee meetings.\ntherefore, have an informal\nrooms- that will\nSome of you may perhaps feel that there is no need for your committee to meet\nbecause you have not recently been called upon by the staff. I hope that you\nwill take this opportunity to meet, decide what you think you should be doing,\nand then make these suggestions to the staff. This will be a great help to\nus. We are hoping that all NAEB committees will be meeting. It has also\nbeen suggested that you may want to have your meeting \"open” to anyone who\nwishes to come. I leave this entirely up to you.\nWe are assuming that if you decide to hold a committee meeting on either or\nboth of the days provided, you will notify your committee members. However,\nif you let us know in time, we will also put an announcement in the Newsletter.\nAs soon as possible, will you please let me know whether you plan to have a\nmeeting and on which day. We will provide the rooms; you can take care of\nthe other arrangements.\nPLEASE LET US KNOW YOUR PLANS NO LATER THAN SEPTEMBER 15*\nHEH:atb"
}