{
  "id": "d433-57",
  "text": "NaEB 39th Annual Convention\nREGISTRATION list\nNovember 18, 1963\nAnderson, James, Chief, Production Branch, TV Division, U.S. Army Signal School,\nFort Monmouth, New Jersey.\nAusprich, Harry, Chairman, Department of Speech & Drama, Memphis State Univer¬\nsity, Memphis, Tennessee.\nBendickson, A.J., Sales Representative, Miratel Electronics, New Brighton,\nMinnesota.\nBlake, Robert L., Director, A-V Education, Sioux Falls Public Schools, Sioux\nFalls, South Dakota.\nBlenheim, Laurence C., WRTI-FM, Temple University, Philadelphia, Pennsylvania.\nBornstein, Ronald C., Program and Production Manager, University of Michigan\nTV, 310 Maynard, Ann Arbor, Michigan.\nBowman, Richard J., Producer-Director, University of Michigan Television Center,\n310 Maynard Street, Ann Arbor, Michigan.\nBrugger, John R., Educational TV Facilities Program, Office of Education,\nWashington, D.C.\nBuckstaff, John, Assistant Director—Broadcasting, University of Chicago, 1307\nEast 60th, Chicago, Illinois.\nBussey, H.M., Director of Radio & Television, Loyola University, 820 N. Michigan,\nChicago 11, Illinois.\nCampion, Lee E., Director, Division of Educational Communications, New York\nState Department of Education, Albany 1, New York.\nCoates, Thomas B., Art Director, University of Michigan TV, Ann Arbor, Michigan*\nConrad, Brother I., F.S.C., Superintendent, Bishop Noll Institute, 1519 Hoffman\nStreet, Hammond, Indiana.\nCox, Kenneth D., International Representative, International Brotherhood of\nElectrical Workers, 1200 15th Street, N.W., Washington, D.C.\nCrabbe, John C., General Manager, KV3E, P.0. Box 6, Sacramento, California.\nDebrodt, Robert Earl, Producer-Writer, University of Michigan TV Center, 310\nMaynard, Ann Arbor, Michigan.\nDenovan, Nancy S.f University of Michigan, 2109 Woodland, Royal Oak, Michigan.\nDeusing, Murl, 5325 West Van Beck, Milwaukee, Wisconsin.\ndeVera, Jose M., Jesuit Priest, Sophia University, Tokyo, Japan, 19624 Wood,\nMelvindale, Michigan.\nDoherty, Joseph W., Senior Specification Writer, New York State Division of\nStandards and Purchases, 103 Washington Avenue, Albany, New York.\nDreyfus, Lee S., General Manager, WHA-TV, University of Wisconsin, Madison,\nWisconsin.\nEgan, Joseph L., Closed-Circuit TV Illustrator, U.S. Navy Great Lakes, R.T.C.\nTV Unit, Great Lakes, Illinois.\nElliott, Gordon, Director, Publications, W.A. Krueger Co., 12821 Blue Mound\nRoad, Milwaukee, Wisconsin.\nEngel, Harold A., Assistant Director, WHA-AM-FM-TV, University of Wisconsin,\nMadison, Wisconsin.\nFoster, George E., Assistant Marketing Director, Professional Division, Bell\n& Howell Company, 7100 North McCormick, Milwaukee, Wisconsin.\nGladfelter, David D., Reporter, Milwaukee Sentinel, Milwaukee, Wisconsin.\nGleason, John J., NYPS Coordinator, Yellow Pages Message Center, Wisconsin\nTelephone Company, Milwaukee, Wisconsin.\nGoedert, Rev. William 0., Assistant Superintendent of Schools, Archdiocese of\nChicago School Board, 205 West Wacker Drive, Chicago, Illinois."
}