{
  "id": "d433-59",
  "text": "-3-\nPaulson, C. Robert, Special Representative CCTV, Precision Instrument Co.,\n3170 Porter Drive, Palo Alto, California.\nRashidpour, Ebrahim, A-V Specialist, Radio Producer, Iran Radio, Walnut\nGrove Trailer #49, Indiana University, Bloomington, Indiana.\nPriske, Dick, Sales Representative, Fairbanks Morse & Co., Chicago, Illinois.\nReyner, John J., Head, Systems Engineering Division, Jansky & Bailey, 1339 Wis¬\nconsin Avenue, N.W., Washington, D;C.\nRohr, Joan-Marie, Graduate Student in Broadcasting, Marquette University,\n1628 W. Wisconsin Avenue, Milwaukee.\nRussell-Tutty, Ronald, Assistant to Executive Director, Kentucky MTV Network,\nMcVey Hall, Lexington, Kentucky.\nSchiller, Jonathan WT., Coordinator of Music Communications, University of\nIllinois School of Music, Urbana, Illinois.\nSiebert, Fred S., Dean, Michigan State University, East Lansing, Michigan.\nSmith, Walter E., Radio and Television Officer, A.I.D. (Dept, of State), 23 R\nStreet, Washington, D.C.\nSpaulding, Seth, Associate Professor, University of Pittsburgh, Pittsburgh,\nPennsylvania.\nStaab, Milton L., Acct. Manager, Northwestern Bell Telephone Co., Minneapolis,\nMinnesota.\nStack, Snirley E., Principal, Byrd School, Chicago, 937 N. Linden Avenue,\nOak Park, Illinois.\nStanley, Ray, Director, ETV Facilities Program, USOE, Washington, D.C.\nStevens, Dr. Humphrey, TV Coordinator, Chicago Teachers College, North,\n5500 North St. Louis Avenue, Chicago, Illinois.\nStewart, Ronald, Chief Engineer, Kentucky Authority for ETV, Lexington, Kentucky.\nStickels, Mrs, Trymby, Continuity Director, WHA, Radio Hall, Madison, Wisconsin.\nSublette, Major J.F., Chief, Telepresentations, Air Force Systems Command,\nAndrews Air Force Base.\nSweeney, William W., Closed Circuit TV Instructor, USNTC, Great Lakes, Illinois.\nTaylor, Bev, FCC, Washington, D.C.\nTaylor, James R., Director, TV, DePaul University, 25 E. Jackson, Chicago.\nTaylor, Mrs. Elizabeth, University of Kentucky, Lexington.\nTraw, Glen H., Director, SWTETVC, 407 Carpenter St., Evansville, Indiana.\nTripet, Thomas, A-V Director, Independent School District 281, 5214 37th Ave.,\nNorth, Robbinsdale, Minnesota.\nVan Wyk, John, Elementary 7th Grade, Oostburg, Jisconsin.\nWallter, Judith, 1515 Davis Street, Evanston, Illinois.\nWeise, Duane, WTTW, Chicago, Illihois.\nWenzel, Richard, Supervisor, Radio & TV Services, Milwaukee Public Schools,\n5225 W. Vliet Street, Milwaukee.\nWheeler, Robert C., Supervisor of Audio-Visual Instruction, Wisconsin Dept,\nof Public Instruction, State Capitol, Madison, Wisconsin.\nWiggin, John, Special Projects Officer, Voice of America, Washington, D.C.\nWilcox, Lt. R.C., Technical Training Officer, USNTC, Great Lakes, Illinois.\nWilliams, T.M., Director, Radio-TV Division, Brigham Young University, Provo, Utah.\nWills, Mr. and Mrs. Gustave, NaEB, Urbana, Illinois.\nYoung, John, Director of Television, University of North Carolina, Chapel Hill, N.C"
}