{
  "id": "d433-77",
  "text": "ALABAMA EDUCATIONAL TELEVISION COMMISSION\n2151 HIGHLAND AVENUE BIRMINGHAM, ALABAMA 35205 TELEPHONE 322-4623\nWAIQ, CHANNEL 26 WBIQ. CHANNEL 10 WCIQ, CHANNEL 7 WD1Q, CHANNEL 2 WEIQ, CHANNEL 42\nCOMMISSIONERS\nROBERT L. HARPER\nABBEVILLE\nCLELL L. HOBSON\nCENTREVILLE\nVINCENT F. KILBORN\nMOBILE\nMRS. BERTHA S. ROBERTS\nGADSDEN\nJAMES R. SWEDENBURG\nREFORM\nAugust 19, 1964-\nMrs, Marion Corwell\nAssociate Director\nDearborn Public Schools\n4.82i|. Lois\nDearborn, Michigan 4-8126\nPROGRAM BOARD\nD. P. CULP\nMONTEVALLO\nRALPH DRAUGHON\nAUBURN\nAUSTIN R. MEADOWS\nMONTGOMERY\nFRANK A. ROSE\nUNIVERSITY\nTHEO WRIGHT\nBIRMINGHAM\nDear Marion:\nI have at hand your letter of August 12\nwhich inquires as to the progress being made\nin my suggesting individuals for the NAEB\nSpeaker’s Guide as per your inquiry on July 28,\nYour July 28 letter came while I was on\nvacation, and I have been meaning to write you\nsince that date.\nSTAFF\nRAYMOND D. HURLBERT\nGENERAL MANAGER\nAL RENFRO\nCHIEF ENGINEER\nLOUIS PENEGUY\nDIRECTOR\nCOORDINATION & INFORMATION\nMRS. MADGE LAW\nOFFICE MANAGER\nDue to administrative reasons, the Alabama\nEducational Television Commission discontinued\nits membership with NAEB, It has transferred\nits trade association relationship to the\nNational Association for Educational Television.\nAt the time of this transfer (the end of June of\nthis year) it seemed logical that I suspend my\nNAEB affiliation rather than spread myself\nthin with too many trade associations at a\ntime when I will be programming the new Mobile\nstation independently of my work with the\nAlabama Educational Television network. As a\nresult of this, I presume it would be best for\nme to withdraw from the NAEB PR Council rather\nthan attempt to serve in both associations. I\nregret that I do this because I have met some\ninteresting people in NAEB, and it was only\nlast year that NAEB finally \"recognized” we\nPR workers by permitting us to be on the NAEB\nnational convention programs.\nFurther, with the AETC transfer from its\naffiliation with NAEB to its association with\nNAET, we of the AETC staff will no longer be\nsent to NAEB regional or national meetings.\nThis would mean that I would be unable to\nconsult with the NAEB PR members, which (again)\nwould make ray work on the PR Committee limited.\nThe nation’s first educational television network telecasts programs simultaneously over four channels, which are originated by Auburn\nUniversity, the Birmingham Area Educational Television Association, and the University of Alabama. National Educational Television\n(NET) programs are provided to the network by the University of Alabama. Independently operated WEIQ-TV is also a NET affiliate."
}