{
  "id": "d433-84",
  "text": "(Proposed - 8/25/64)\nNAEB\nAmendments to Articles of Incorporation filed January 8, 1951\n(1) Eliminate existing Article 5.\n(2) Add new Article 5 as follows:\n5(a) Said corporation is organized exclusively for educational purposes,\nincluding, for such purposes, the making of distributions to organizations that\nqualify as exempt organizations under Section 501 (c)(3) of the Internal Reve¬\nnue Code of 1954 (or the corresponding provision of any future United States\nInternal Revenue Law).\n(b) No part of the net earnings of the corporation shall enure to the ben¬\nefit of or be distributable to its members, directors, officers, or other pri¬\nvate persons, except that the corporation shall be authorized and empowered\nto pay reasonable compensation for services rendered and to make payments\nand distributions in furtherance of the purposes set forth in Article (5) hereof.\nNo substantial part of the activities of the corporation shall be the carrying\non of propaganda, or otherwise attempting, to influence legislation, and the\ncorporation shall not participate in, or intervene in (including the publishing\nor distribution of statements) any political campaign on behalf of any candidate\nfor public office. Notwithstanding any other provision of these articles, the\ncorporation shall not carry on any other activities not permitted to be carried\non (a) by a corporation exempt from federal income tax under Section 501(c)(3)\nof the Internal Revenue Code of 1954 (or the corresponding provision of any\nfuture United States Internal Revenue Law) or (b) by a corporation, contribu¬\ntions to which are deductible under Section 170(c)(2) of the Internal Revenue\nCode of 1954 (or the corresponding provision of any future United States Inter¬\nnal Revenue Law).\n(c) Upon the dissolution of the corporation, the Board of Directors shall,\nafter paying or making provision for the payment of all of the liabilities of the\ncorporation, dispose of all of the assets of the corporation exclusively for the\npurposes of the corporation in such manner, or to such organization or organ¬\nizations organized and operated exclusively for charitable, educational, reli¬\ngious, or scientific purposes as shall at the time qualify as an exempt organ¬\nization or organizations under Section 501(c)(3) of the Internal Revenue Code\nof 1954 (or the corresponding provision of any future United States Internal\nRevenue Law), as the Board of Directors shall determine. Any of such assets\nnot so disposed of shall be disposed of by the appropriate court of the county\nin which the principal office of the corporation is then located, exclusively for\nsuch purposes or to such organization or organizations, as said court shall\ndetermine, which are organized and operated exclusively for such purposes.\n(d) Nothing herein contained shall authorize the corporation to, and the\ncorporation shall not, operate a post-secondary educational institution, a\nvocational school or a business school.\n-3-"
}