{
  "id": "d433-94",
  "text": "President may be designated by the Board of Directors to perform the duties of the\nPresident and, when so acting, shall have all the powers of, and shall be subject\nto all the restrictions upon, the President. The Executive Director of each Divi¬\nsion may be elected a Vice-President of NAEB.\nSection 7. 10. The Secretary. The Secretary shall (a) see that all notices\nare duly given in accordance with the law and this Constitution and By-laws; (b)\nbe custodian of the seal of NAEB and affix such seal to all documents, the execu¬\ntion of which, on behalf of NAEB under its seal, is authorized by the Board of Di¬\nrectors or the Executive Committee, or by any officer or agent of NAEB to whom\npower to authorize the affixing of such seal shall have been delegated; (c) keep, or\ncause to be kept, in books provided for the purpose, minutes of the meetings of the\nmembers, of the Board of Directors, and of each committee of the Board other\nthan a Division Board; (d) sign such instruments as require the signature of the\nSecretary; and (e) in general perform all the duties incident to the office of Secre¬\ntary and such other duties as from time to time may be assigned to him by the\nBoard of Directors.\nSection 7. 11. Assistant Secretaries. Each of the Assistant Secretaries shall\nperform such duties as from time to time may be assigned to him by the Board of\nDirectors.\nSection 7. 12. The Treasurer. The Treasurer shall (a) have charge and cus¬\ntody of, and be responsible for, all funds and securities and other property of NAEB\nand deposit all such funds in such banks, trust companies or other depositories as\nshall be selected in accordance with the provisions of this Constitution and By¬\nlaws or by order of the Board of Directors; (b) receive, and give receipts for,\nmoneys due and payable to NAEB from any source whatsoever; (c) sign such docu¬\nments as shall require the signature of the Treasurer; (d) keep or cause to be kept\ncorrect records of the business transactions of NAEB and at all reasonable times\nexhibit such records to any of the directors of NAEB upon application at the office\nof NAEB where such records are kept; (e) have charge of the audit and financial\nstatistical departments of NAEB; and (f) in general perform all the duties incident\nto the office of Treasurer and other duties as from time to time may be assigned\nto him by the Board of Directors. The Treasurer shall, if required by the Board\nof Directors, give a bond for the faithful discharge of his duties in such sum and\nwith such sureties as the Board of Directors shall determine.\nSection 7. 13. Assistant Treasurers. Each of the Assistant Treasurer shall\nperform such duties as from time to time may be assigned to him by-the Board of\nDirectors. If required by the Board of Directors, each Assistant Treasurer shall\ngive a bond for the faithful performance of his duties in such sum and with such\nsureties as the Board of Directors shall determine.\nSection 7. 14. Compensation. The compensation of the officers shall be\nfixed from time to time by the Board of Directors.\nARTICLE VIII\nCommittees of the Board\nSection 8. 01. Executive Committee. The Chairman of each Division Board,\ntogether with the Chairman of the Board of Directors of NAEB and the President\nof NAEB, shall serve as an Executive Committee. To the extent specifically pro¬\nvided by resolution adopted by a majority of the whole Board of Directors, the\n-13-"
}