{
  "id": "d1279-0",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n1346 Connecticut Avenue, N.W., Washington, D.C., 20036\nVolume V Number 15\nOctober 9, 19^1-\nNDEA EXTENDED AND EXPANDED\nCongress completed action last week on an extension of the National Defense Education\nAct for three years beyond the present expiration date, June 30, 1965* President Johnson is\nexpected to sign it into law within the next few days.\nThe revised NDEA provides for considerable expansion of the student loan, graduate\nfellowship, guidance, institute and equipment purchase program. Specifically, the bill\nincreases funds for teaching equipment in the elementary and secondary schools, and adds\nto the number of subjects for which the equipment may be used. In addition to the present\nmathematics, science, and modern foreign languages, the bill now includes English, reading,\nhistory, geography, and civics. The total authorization is increased from the present\n$75 million to $100 million.\nNAEB OPPOSES MPATI PETITION IN ORAL ARGUMENT BEFORE FCC\nNAEB and seven other organizations today opposed the MPATI petition for regulari¬\nzation and expanB ion to a six-channel airborne operation. The comments, delivered by\nNorman Jorgensen of Krieger and Jorgensen, were based on earlier reports and filings by\nthe NAEB. Also opposing were: Joint Council on Educational Broadcasting, Association for\nSupervisory and Curriculum Development (National Education Association), Council of Chief\nState School Officers, American Association of School Administrators, Association of\nMaximum Service Telecasters, Ohio Educational Television Network Commission, and Livonia\nPublic Schools.\nFiling in support of MPATI were: Chicago Board of Education; Archdiocese of Chicago;\nState of Illinois; Junior Women's Club of Ironton, Ohio; Middletown, Ohio, Board of\nEducation; and MPATI Area Council, Wayne State University Resource Area.\nBRONSON NAMED EXECUTIVE DIRECTOR OF INDIVIDUAL MEMBER DIVISION\nr\nVernon Bronson has been named Executive Director of the Individual Member Division\nof the NAEB. This division, one of four established under a recent reorganization plan,\nis devoted to fostering the professional growth and development of individuals who have\nchosen careers in educational broadcasting.\nBronson, who is current^ serving as Director of the NAEB Department of Research\nand Development, will add this new responsibility effective immediately.\nIn announcing the appointment, President Harley said, !,We are delighted that Mr.\nBronson is willing to accept this responsibility, for his active leadership will provide\nforce and direction to this newest area of organized Association effort. It is important\nthat educational broadcasters be afforded opportunities to increase their professional\nstature and abilities and have an organizational structure with which to identify as their\nprofessional home. This new division provides the logical means and structure; Vernon\nBronson is the logical person to supervise this activity.\""
}