{
  "id": "d1334-5",
  "text": "Kingdom, 1953-5U. Summary transcript of Dr. Paulu’s\naddress appended.\n2:15 p.m. - Business Session, Memorial Union, Council Chamber\nHull presided. He opened by inviting each NAEB headquarters\nrepresentative to outline the various services and functions\nof the national headquarters.\nSkornia: Outlined the steady growth of headquarters staff\nand services citing as examples the tape network, placement\nservice, engineering consultation service, newsletter, work¬\nshops, clinics, management and labor consultation, scholar¬\nships and fellowships. He said Headquarters now has a staff\nof 12 persons.\nHull: Asked for more information on the new engineering con¬\nsulting service of NAEB.\nSkornia: Explained the national organizations set up to\nservice the needs of new and prospecting educational TV\nstations did not provide for handling the questions regard¬\ning technical operations of a new station. Recognizing\nthis need the Fund for Adult Education made a grant to\nNAEB to hire an engineering consultant, Mr. Cecil Bidlaek.\nWhile most of his activities are in the field of TV he\nalso supervises the technical operation of the tape dupli¬\ncators at Headquarters. The addition of technical consult¬\ning service by NAEB was primarily an outgrowth of studies\nand advice from the NAEB engineering committee.\nFrom the Floor: How is the new Placement Service working?\nSkornia: Said the number of persons now listed and available\nfor positions far outruns the current demand for employees.\nThis is due in large part to the discontinuance or deferment\nof two or three educational TV developments throughout the\ncountry where staffs were assembled and later dismissed.\nFrom the Floor: Do you have enough people and time to do the\nthings Headquarters is asked to do?\nSkornia: Said Headquarters staff is plenty busy but would not\nrecommend adding to its staff right now. UI would rather starve\nalong on a slightly overworked basis but have everybody feel\nthat they’ve got an organization which is not a luxurious\none; that is, get by on bare essentials, but adequate enough\nin those critical points to have a small reserve left over\nwhich can be thrown in where needed.n He then added that he\nwished Headquarters had a full-time Newsletter editor.\n- 2 -"
}