{
  "id": "d1761-2",
  "text": "NAEB\nPage 3\nSEPTiEMBER 1, 1945\n--Bring the staff to the convention in Chicago--\nHUDSON JOINS CBS\nThe Columbia Broadcasting System has announced that Director Robert Bo\nHudson of the Rocky Mountain Radio Council join the CBS Program\nDepartment of September 1st. Hudson will assist CBS Director of Ed¬\nucation Lyman Bryson in supervision and aomtnsstrati on of CBS Educational\nPrograms,\n-Meet NAEBers from everywhere o.ii Sept. 17 & 18,-\nTHE FREEZE IS OFF\nThe green light has been given to broadcast construction and broadcast\nplanning. In a Statement of Policy issued August 7, the Federal Communi¬\ncations Commission announced the 60-oay period, prior to full-force con¬\nstruction activities as promised last January began with the issuance\nOF THE statement, MORE THAN 800 APPLICATIONS FOR NEW FACILITIES IN THE\nPENDING FILES WILL BE PROCESSED, THE 60-DAY PERIOD FOR \"FILING AND\nprocessing of new applications\" prior TO ACTION ON THOSE IN THE PEND¬\nING FILES IS UNDER WAY,\nThis w'Ill mean that many educational FM ap^lic^nts may be authorized to\nPROCEED BY THE FIRST OF THE YEAR. It WILL BE NECESSARY FOR ALL IN¬\nSTITUTIONS planning FM STATIONS TO MOVE QUICKLY AND TO MAKE DEFINITE\nPLANS FOR ACTUAL OPER'ATIONS. ThE TIME FOR PLANS FOR THE DISTANT FUTURE\nIN PAST, Action is needed now.\n——Bring your program ideas to the convention——\nTHIS AND THAT\nThe Westinghoube Stratovision plan makes sense to this department, but\nSPEAKING as a CHIEF ENGiNEER, HOW ARE WE GOING TO MAKE THOSE QUICK TRIPS\nUP TO THE TRANSMITTER WHEN THERE IS TROUBLE?ThE FREE-FOR-ALL IS\nON, There are many stations being planned. Some of them won’t last\nLONG IN THE STIFF COMPETITION WHICH IS BEING CREATED. WE HOPE THAT THE\nNUMBER OF EDUCATIONAL STATIONS TO FALL BY THE WAYSIDE AFTER THE INITIAL\nSURGE WILL BE SMALL, WE SHOULD REMEMBER WHAT HAPPENED IN THE EARLY\nHISTORY OF AM BROADCASTING. ,,,, oSOU.\\08 LIKE JENNINGS HAS REALLY TAKEN\nON AN AMBITIOUS TELEVISION PROGRAM, MORE POWER TO YOU GEORGEo,,,,WE\nNOTE THAT THE MICHIGAN FM PLANS CALL FOR A $175,000. STATION AT THE U.\nOF Michigan. Brother Abbot who could tell us so much about it all will\nBE unable to attend THE CONVENTION. HE IS GOING TO NEW YORK TO STUDY\nSTUDIO DESIGNS. HE WANTS HIS NEW SET-UP TO BE THE LAST WORD IN STUDIO\nDESIGN. Sounds great Waldo.,, See you in Chicago in a couple of weeks,,o,.\n—Ebel"
}