{
  "id": "d1209-1",
  "text": "a razor blade, a straight edge and a splicing jig fur¬\nnished with the machine. The cut is made parallel\nwith the “swipe” of the head across the tape and on\nthe edit pulse. The edit pulses are timed so that the\nsplice comes during vertical blanking to eliminate\npicture roll over or noise due to the splice. The pres¬\nent splicing jig is but a milled plate to align the tape\nso that the cut may be made at the proper angle.\nWe saw an engineering model of a splicer which will\nbe of considerable advantage, where splicing and edit¬\ning is required. Since the head tips, when new, pro¬\ntrude less than four mils from the drum, a special\nsplicing tape must be used which is very thin. It also\nmust be applied to the back of the tape without\nwrinkles since the tolerance between the tape guide\nand drum is but a few thousandths of an inch.\nAt the time of our visit to Redwood City, over\nfifty video tape recorders had been produced and the\nmachines were coming out of final test at a rate of\none per day. Ampex expects to have its initial pro¬\nduction run completed and in the hands of users well\nin advance of the advent of Daylight Saving Time\nApril 27. Training classes consist of no more than\nten students. Ours had an international flavor, with\na representative of Siemens-Halske, a German firm\nwhich will handle export distribution, an engineer\nfrom a Havana station, and representatives from TV\nstations in Boston, New York, San Antonio, Lubbock,\nTex., and Los Angeles, besides the writer. We be¬\nlieve it was time well spent. Our only regret is that\nwe will not be able to put the training obtained to\nimmediate use in educational television.\n* * * * *■\nThe February 1958 RCA Broadcast News contains\na comprehensive twenty-six-page article on WUNC-\nTV at Chapel Hill, N. C. It is profusely illustrated\nand has diagrams of the microwave relay system used\nto connect the studios in Raleigh, Greensboro and\nChapel Hill to the transmitter near the latter studio.\nAudio and video block diagrams are included as well\nas the video schematic which is common to all studios.\nThe same issue of Broadcast News contains a\nbrief article by A. H. Lind and a block diagram show¬\ning how a color television signal is processed for re¬\ncording on a video tape recorder.\n*****\nWe see by Radio-TV Daily that WOSU-TV has\nrecently put into service two complete remote units\n(a total of four cameras) to telecast special events.\nIt is also expected that these units will be used for\ninstructional purposes, either by closed circuit or\nbroadcast on the Ohio State University station\nWOSU-TV. All of which brings up a point we’ve been\nwanting to mention for some time.\nIt would be nice to hear from our readers occasion¬\nally and also to be included when publicity releases\nare sent to the press regarding new equipment or\nother technical improvements. We’d like to know,\ntoo, whether anyone besides Ralph Townsley at Pur¬\ndue has purchased any of the used image orthicons\nfrom NBC which we announced in a December mail¬\ning and also in the January Newsletter. Purdue liked\nthe first four 5820’s they received so well, they im¬\nmediately ordered four more. We do appreciate the\nnotes some of you have written but we’d like to hear\nfrom more of you. With 31 ETV stations now on the\nair it’s difficult to make frequent visits, so drop us\na line to tell us of the progress you’re making and\npass along any items you think would interest others.\n*****\nThe FCC is proposing to add a new section to\nPart 4 of its rules and regulations to provide for\nlicensing low powered auxiliary transmitters used to\ntransmit cues and orders to production personnel and\nparticipants of broadcast programs. The proposed\nrules provide for operation in the 26.10 - 26.48 MC\nand 450 - 451 MC bands.\nPlate power input to the final rf amplifier is limit¬\ned to one watt. No operator’s license is required of\nthe person actually using these low powered units,\nprovided that a licensed operator is on duty at the\nplace of operation. A Radiotelephone first or sec¬\nond class operator license is required when any ad¬\njustments or changes are made which would affect\nthe proper operation of the transmitting units. Call\nletters will not be assigned, however adequate records\nmust be kept of the periods and place of operation.\nComments on this proposal, Docket No. 11696, are\ndue April 15, 1958, with reply comments due ten\ndays later.\nTV TECHNICAL TIPS (May)\nThirty engineers from educational television stations\nand production centers will attend the NAEB Video\nRecording Workshop to be held May 5 - 9 in the\nstudios of WTTW, the Chicago Educational Televi¬\nsion Assn, station. The Workshop is made possible\nby a grant from the Ford Foundation and is sponsored\nby NAEB to provide attending engineers an ap-\nportunity to increase their technical knowledge and\nability in video recording.\nMuch of the programming supplied educational\ntelevision stations by the ETRC, Ann Arbor, Mich.,\nis recorded on film by the kinescope process. While\n2\nENGINEERING NEWSLETTER"
}