{
  "id": "d43-149",
  "text": "NATIONAL EDUCATION ASSOCIATION OF THE UNITED STATES\n1201 SIXTEENTH STREET NORTHWEST. WASHINGTON 6. D. C.\nDecember 18, 1953\nMr. Graydon Ausmus, President\nNational Association of Educational Broadcasters\nBox 2002\nUniversity, Alabama\nDear Graydon:\nI recall your eloquent remarks about the need for study and experiment\nin the use of educational television as a supplementary aid to classroom\ninstruction. I was especially appreciative of your comments because the\nNEA is asking the Fund for the Advancement of Education to finance a three-\nyear project in this very field. It is the one, of course, in which the\nNational Education Association has a tremendous stake and for which our\norganization is uniquely qualified. Centered here are all of the types\nof administration in nearly every subject field of education and all of\nthe service groups who might in any way have an interest in television for\nthe classroom. We propose to represent these fields on a commission and\nto have a staff to work on it, if the money is granted by the Fund for the\nAdvancement of Education. We have some reason to believe that the request\nwill be granted.\nIn order to make it clear to the Fund that there was an urgent need for\nsuch a project, we asked a number of people to write to the Fund outlining\nthe need of such a study from their own point of view. Among these were:\nMrs. Newton Leonard, President, National Congress of Parents and\nTeachers\nJames E. Allen, Jr., Deputy Commissioner of Education, State\nDepartment of Education, Albany, N. Y.\nMark C. Schinnerer, Board of Education, Superintendent of Schools,\nCleveland, Ohio\nF. E. Engleman, Commissioner of Education, Hartford, Conn,\nEdward Tuttle, Executive Secretary, National School Boards Ass'n\nEdgar Fuller, Executive Secretary, National Council of Chief S^ate\nSchool Officers\nTheir letters are now on file with the Fund for the Advancement of Education.\nI am writing to ask if you will not, in the same eloquent fashion as you\nperformed last Wednesday, write to Alvin C. Eurich, Vice President, The\nFund for the Advancement of Education, 575 Madison Avenue, New York 22,\nNew York, in behalf of such an appropriation. So that you may get a better\npicture of what we are asking for and what some of the others have done to\nencourage the Fund, I am sending you my original letter to the Fund together\nwith one of the supporting letters sent."
}