{
  "id": "d43-22",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nOFFICE OF THE PRESIDENT\nBox 2002\nUniversity, Alabama\nMay 15, 1953\nMr* Frank Schooley\nRoom 119 Gregory Hall\nUniversity of Illinois\nUrbana, Illinois\nDear Frank:\nThe enclosed carbon of my reply to George Overton's letter\nis self-explanatory. If you have not already sent the agreement on\nthe Big Four and on the new $80,000.00 grant to Scotty, you may wish\nto send it to George first* His letter indicated that he is expecting\nit* However, use your own discretion on this.\nYou have received by now the copy of my letter to Bill\nGriffiths covering the fellowships, scholarships, internships deal.\nIn a telephone conversation with him yesterday he indicated that he\nexpected these to be a specific request from NAEB - a direct contra¬\ndiction to Hull's statement that my form of helpful interest and\noffer of help was very good. He indicated interest in receiving\nas soon as possible a complete spelling out of the details of all\nthe proposals which we might include, such as a specific statement\nof the amount of each of the proposals which would go to scholarships\nand the amount of each proposal which would go to cover the cost\nof operating each of the se workshops .or seminars. In the case of\nthe engineering thing, for instance, Wfcwanted to know what portion\nof the $9,000.00 we anticipated spending for tuition, if any, and\nwhat portion we anticipated contributing directly to those who attend\nthe training sessions. I promised to get this breakdown of details\nto him as soon as possible,, and this is a request for you to get\nbusy on those details as rapidly as possible to the extent of:\n1. Contacting already established workshops and\nbuilding a list of such, including tuition and dates.\n2. Contacting several institutions to see if they would\nbe interested in holding any of the proposed seminars,\nhow much (if any) they would expect for local fees,\nhow much would be needed to bring in additional\nconsultants or teachers, and how much it would cost\nto house and feed the crowd in each case.\n3. Making an estimate of the amount which will be necessary\nfor travel for each person attending these places."
}