{
  "id": "d43-23",
  "text": "Mr. Frank Schooley\nMay IS, 1953\nPage 2\nU. Making a list of possible consultants or teachers\nfor each of the seminars and honoraria, if any, which\nwould be expected.\nS* Giving recommended or available dates in each case.\nCompile all of this which is humanly possible by the time\nof the Ann Arbor meeting so the Executive Committee may go overffend\nhelp in the final refinements so the letter can then be got off\nto Bill Griffiths within a few days of the Ann Arbor meeting. In\norder to do this, I suggest you get Jim's help and both of you tie\nup the long distance lines for a couple of days and come up with\nsome pretty firm recommendations. I really don't know whether it\ncan be done by the last of next week or not, but at least enough of\nit can be firmed up to make the story much more complete to Bill\nthan my presentation.\nHearings on our TV bill are scheduled for Wednesday or\nThursday of next week - May 21-22. That means that I may not be\nable to get to Ann Arbor at all. Realizing the importance of that\nmeeting and the necessity that we get a great deal of work done on\nplans for next year, this is veiy unfortunate. If the hearings are\npostponed, I will plan to be there. If they go off on schedule, I\nwill be glad to come to urbana on the early part of the week May 2b\nto work with yoi^ and perhaps Jim, for as long as is necessary to\ncomplete the Kellogg budget and the FAE budget requests and will be\nglad to go from Urbana with you to Battle Creek to talk to Bob VanDuyn\nand Hugh Masters. As things stand now, I think you may as well count\nme out of the Ann Arbor meeting. Things are popping in this state and\nour bill stands a good chance of passage. It is important that I be\nat the hearings and cb some lobbying in order to assure that if the\nbill passes, we will be given favorable consideration for a station\nat the University.\nAnother matter which should concern the Executive Committee\nat the Ann Arbor meeting is a request for funds from Kellogg or FAE\nand the Center to establish a very extensive TV station program\nconsultation service. This is the significant area of activity in\nthe two years ahead and FAE is sold on the idea that this is a\nproject for NAEB to supervise. When we draft this proposal, we should\nnot spare the horses but should toss a budget at them that compares\nwith the JCET budget of $1^5,000.00 annually.\nI am aware that we had hoped that we might wait until after\nthe|!North Woods’11 and until after the Wisconsin meeting to make our\nmajor presentation for activities for next year to the foundations.\nFrom my conversation with Bill Griffiths the other day, I gather that\nthe Center and the FAE are looking to NAEB in the very near future"
}