{
  "id": "d43-29",
  "text": "flmt/ ^cwnmitfee on ^ctwc€i/iwia/ ^Te/em^km\n1785 MASSACHUSETTS AVENUE, NORTHWEST, WASHINGTON 6, D.\nQ 0 p Y June 4, 1953\nJCET MEMBERS\nRalph Steetle, Executive Director\nHUDSON 3-6628\nASSOCIATION FOR EDUCATION\nBY RADIO-TELEVISION\nFranklin Dunham\nASSOCIATION OF LAND-GRANT\nCOLLEGES AND UNIVERSITIES\nJames H. Denison\nNATIONAL ASSOCIATION OF\nEDUCATIONAL BROADCASTERS\nGraydon Ausmus\nMr. Harold E. FeI lows\nPresident\nNational Association of\nRadio and Television Broadcasters\n1771 N Street, N.W.\nWashington 6, D. C.\nDear Harold:\nNATIONAL ASSOCIATION OF STATE\nUNIVERSITIES\nAlbert N. Jorgensen\nNATIONAL COUNCIL OF CH\nSTATE SCHOOL OFFICERS\nEdgar Fuller, Chairman\nNATIONAL EDUCATION ASSOCIATION\nOF THE UNITED STATES\nBelmont Farley\nA year has now passed since the effective date of the\nFCC's Sixth Report and Order. The Joint Committee\non Educational Television is pleased with the progress\nin television made during this short period of time.\nWe note that more than 600 applications for commercial\nstations have been filed and more than 350 applications\nhave been granted. 139 commercial stations are actually\non the air and many others will soon be in operation.\nAll of this Is a real tribute to American initiative\nand enterprise. We extend to the broadcasting industry\nour congratulations and best wishes.\nThe Joint Committee on Educational Television is\nnaturally proud of the progress educational television\nhas made during the past year. As of this date 47\napplications for non-commercial educational television\nstations have been filed and 17 have been granted. One\nstation Is already in operation and several others will\nsoon be on the air*\nParticularly heartening is the fact that most of these\neducational applications show solid financial and\ncommunity support. in this connection, the Joint\nCommittee is especially grateful to many commercial\ninterests in this country. in a large number of\ninstances many business men have generously given their\ntime, facilities and money to help establish these\neducational television stations. One of the most\nrecent examples of this generosity Is the offer of the\nStorer Broadcasting Company to provide a complete trans¬\nmitter and antenna to help establish an educational\nstation in Birmingham, Alabama.\nIt is impossible, of course, for us to thank individually\nall of the commercial interests in this country that have\ncontributed and will continue to contribute to the develop¬\nment of educational television. However, I am directed\nby the Joint Committee on Educational Television to take\nthis opportunity to thank you as the President of the\nNational Association of Radio and Television Broadcasters"
}