{
  "id": "d43-41",
  "text": "—2—\nb) taffling the station for continuous programming of\ntelecasts for the classroom.\nc) valuation of television received in school and commu ity*\n7) How my school and comsmnity resource® for pr^ ramming be\ncoordinated and employed effectively, including such resources\nas the local library, art isuseum, business and manufacturing\nactivities, community organisations, etc.\n8) What are the responsibilities of the board of education, of\noitisene committees, of parent-teacher associations, and of\nother co nunity groups of educational character in the evalu¬\nation and improvement of television received in the home*\n9) if there are local institutions of higher education, what\npart my they play in the television programs providtd for the\nbenefit of children in their homes of their classrooms*\n10) 'What are the most successful experiences of school y stems\nusing television in their classrooms?\nThe National Kduestion Association includes among its departments\nall of those who work in education, classroom teachers, elementary school\nprincipals, secondary school principals, school administrators, supervisor®,\nand subject specialists* All of these have responsibilities in the use of\nthis new aedium of education* Through the MBA, representatives of these\ngroups can b# quickly drawn together* The committee appointed by the\nAssociation to study educational- television in classroom and community\nwill be composed of such repr sentatives*\nAt an illustration of the inter at of the UFA in educational tele¬\nvision, I m sending you, enclosed, programs of our 91st Annual Meeting\nat Miami Teach, Florida, June 24-July 3. I wish to call your attention\nof one of these programs is the utilization of educational television as\na supplementary aid to classroom teaching* The large attendance at this\nsession was compos principally of teachers* Another program featured\nthe use of television as an aid in the preparation of teachers* This\nprogram was sponsored jointly by the National Association of Chief State\nSchool Officers and the National Commission on Teacher Education and Pro¬\nfessional Standards* The Joint Committee on educational Television fur¬\nnished the funds which made these demonstrations possible*\nA third convention program was devoted to the impact of television\nupon American youth. This was an evaluation program in irtuch membere of\nthe Parent Teachers Association and commercial television broadcasters\njoined the educators* It is cited as an illustration of the interest of\nthe NBA in the television programs idiich cose daily into the horns* All\nthree of these sessions wfcr« high spots of our convention*"
}