{
  "id": "d43-46",
  "text": "Hr. G. K. Griffiths\nBig® 3\nso constantly, not to say aimlessly, in motion that X find it confusing,\ndistracting, end annoying.\"\n\\\nIn addition to the report mentioned above, Hr. Faulu says in his let -or\nof August 25s \"The symphony aeries is completed* A reasonably thorough\nreport of whet we did is included in the text of the article I have already\nsent you. If this is printed up as I hop it will fee — I will provide you\nwith several copies together with copies of the article Rudy Sretz wrote\nabout the project and soma other data.. This will fee in such form th/it you\ncould transmit it bo the Fund for Adult Education if you wanted to. In the\nevent the £HE£&B£to does not print the article, I will have the material\ntyjod up neatly on originals eo that you will h vs the data for your files*\"\n3. University of Oklahoma Film series on Indian dances, for television.\nMr. John Dunn provides the following report in answer to our request\nfor interim reports on these seriesi\n\"Although the grants-in-edd were made lest November or so, Indians\ndonft start their dances and cermonials naich until the middle of June.\nHence u© were not able to really get going until about the 1st of July*\n\"To date, we have FIVE, films done* Ihese include: CADDO Turkey-\nDance} Creek Ribbon Dancej CREEK Feather Dance; Kiowa Give-A-Why dance}\nComanche Scalp dance. Those are all unusual dances—some of which have\nnever been seen, let alone filmed by whit© men before.\n\"We have yet to go: dances by the PAWN £S, the USAGES, the AFACHLS\nand the &;c and FO\n\"In some cases we were rained out of engagements. We hope to have\nall 9 films finished by September 15* Ihen we will start the job of\neditisig end working out the film. Ibis is a project that is not like\nany of the other projects* Would like to take you with us on one of\nour \"expeditions\"* Think that would tell the story of why we*re late\nbetter than anything I could 3ay. Wo crave the indulgence of NAE3-FAE\nand request additional ti:ae in which to finish these distinctive films\nof the American Indian.\"\n4. Stanford University: Television series entitled PEOPLE. PL CIS. AND\nPOLITICS.\nAttached herewith is the special report provided by Director of\nRadio find Television, Stanley T. Lonner, in answer .o our request for\nan interim report. Also attached, in a single copy, is c brochure\ndistributed by Stanford on this seriesi\n\"A lengthy and complete report on the television series \"People,"
}