{
  "id": "d43-47",
  "text": "Mr, C. H. Griffiths\nPage 4\nPlaces, end Politics® is now being mimeographed. Copies of this report\nwill be delivered to the President *8 Office, the Executive Head of the\nDeportment of Speech and Drama, Kill and to the National Association of\nEducational Broadcasters#\n\"The series was made possible by a grant-in-aid of $8,900 from the\nNational Association of Educational Broadcasters. The series of thirteen\nhalf-hour telecasts wore aired 7300 to 7t30 Friday evenings from January 8\nto April 3, 1953= This \"Class A\" time was provided Without charge by\ntelevision station Kill, San Francisco* KPIX also helped with all stages\nof planning, gave an hour and a half camera rehearsal time for each\nprogrr.it and at c 11 times gave the assistance of William Dempsey, Educational\nDirector; George Mathiasen, Production Manager; Ray Hubbard, Art Director,\nand James Bakins, the studio director#\n\"Th© idea of the series wa3 originated by Prof. Alfred ft# Sumner\nof Geography and Professor Frederick Terrian of Anthropology and Sociology#\nThe responsibility for the series rested with Professor Stanley T# Dormer\nof Speech and Drama# He was assisted by Professor George Willey, also of\nSpeech and Drama® Mr# Willey took alternate shows of the series*\nAdditional help was provided by the Main Library, Hoover Institute and\nLibrary. and by the detxirtnents of Geography, History, Sociology ond\nAnthro] Science.\n\"The program was an attempt to show the viewers the oblig: tion of\nthe Edited States to the various \"itical nations contiguous to the\nUSSR# Therefore a Geographer wouli describe the piece; a Sociologist,\nAnthropologist, native, or an expert of the country would talk of the\npeople; an historian or a political scientist would 3peak of the\npolitics. In a larger sense the series might bo cabled an anti-ceranmist\nprogram.\n\"Hie program attracted an audience estimated at 100,000 people <mch\nweek £ind the Boise rating Indicated that this audience was growing larger\nprogram by program. Hundreds of enthusiastic viewers wrote Stanford or\nKPIX about the series. The Northern California Television Academy singled\nout \"People, Places and Politics8* for one of its two program awards# The\naward was made \"for imaginative uso of production techniques.”\n\"Television recordings were? made of the programs so that they may be\nused by other commercial television stations or educational television\nstations#\"\n5# Syracuse Univorsityj Television series entitled FOOTNOTES TO AMERICA#\nBelow is the report C3 received from Mr* Arthur Weld, Jr#, on\nAugust 21i\n\"Currant Status? Program series completed# Report in process of\ncompletion#"
}