{
  "id": "d43-48",
  "text": "Mr. G. K. Griffiths\nPd-cb 5\n\"Descrii tioni FOOTNOTES TO AM. RICA, with T. V. Smith, \"the program\nthat lives you a better look ufc our American heritage\", presented live\nover WSXR-TV at 12 noon Sundays, Jxmuary 25 through April 26, from the\ncampus studios of the Radio and Television Center at Syracuse University.\n\"Selected titles to individual programs} Inaugurating a President*\nThe Food on your Table; Why Men Are Not Equal; Sports in America;\nBuilding America.\n\"Formts various, including discussion with illustrative vignettes;\ndocumentary; intimate philosophizing by T* V* Smith*\n\"Audiencoi Surveys indicate a regular audience of 15,000 homes.\n\"Quotation from an unsolicited lett ri \"four very excellent series •\nis b regular feature of our Sunday program.\"\n\"Remarks! As part of Syracuse University's report, and in addition\nto photographs, film cold other visual material, complete tapes of ell\nprograms will be filed with the NAEB.\n\"Also, a thirty-mini ta film reproducing one of the programs is being\nprepared end will be submitted with the report.\"\n6. Wayne University! INTEH&-. TONAL TOWN\nDue to the departure of Mr. Jack McBride, some delay has coxae about\nin getting to NAE3 materials which we should by now have. Attached Is\na co y of u recent V&riU article on this series. The last word from\nWayne University on this report is in the form of a telegram of August\n27, which reads as foll<wss \"Delay in NAEB report© due to McBride's\ndeparture and necessity of audit of account by our Accounting Department.\nForwarding material on grant project and tentative- financial report today.\nIf the complete report is unsatisfactory in any respect, pleas© notify\nus immediately*\" We are continuing efforts to get this project into\nproper form for reporting.\nXI. Radio Series\n7. University of Alabama! DOCUMENT: DK&i SOUTH\nHerewith the interim report received on this project, from Walter\nWhitakerj\n\"A series of documentary programs, tracing the role of the South*s\nnatural resources in the growth of the nation's econoiay, produced with\na grant-in-aid from the Fund for Adult Education, establishes by the"
}