{
  "id": "d402-10",
  "text": "In connection with the White House Commission on Higher Education\nthe suggestion was made that the Council offer cooperation and possible service\nto the White House Commission. The possibility of a conference of the delegates\nfrom the Council’s Constituent Members in the early spring,, for a discussion of\ngeneral problems in higher education,, to which might be invited representatives\nof the White House Commission, among others, was suggested.\nIT WAS VOTED to approve the suggestion that the Council offer\nto be of service to the White House Commission on Higher Education in a manner to\nbe determined by the President of the Council after an exploration of the\npossibilities.\n(h) The Committee was informed that Dr„ Rufus H. Fitzgerald,\nformer Chancellor of the University of Pittsburgh, was engaged in planning the work\nof the Council's Committee on a Study of Character Traits, of which he is Chairman.\nDr. Fitzgerald and Dr. Eugene R. Smith, former Headmaster of the Beaver Country\nDay School, who has had a long-time interest in educational programs in character\ndevelopment, had conferred with members of the Council staff on December 16, 1955*\nIt is hoped to get the study under way at an early time. The members of the\nCommittee to guide the study will be appointed in the very early future.\n(i) Dr. Adams reviewed the relationships of the Council and the\nInstitute of International Education over the long past, referring to the formal\nagreement between the Council and the Institute approved at the 1927 annual\nmeeting of the Council and signed by each organization during that year. Under\nthe 1927 agreement the Council discontinued its activities in the field of\ninternational education. Dr. Adams mentioned the resumption by the Council of\nactivities in international education some ten years thereafter. It was pointed\nout that while there had been discussion of an amendment to the 1927 agreement,\nno formal action had been taken and that the 1927 agreement continued to be a\nmetter of record. Despite this the Council has carried on activities in the\nfield of international education, of which the Institute has been full cognizant.\nDiscussions between representatives of the Council and the Institute during the\npast year on their respective areas of operation in the international field has\nresulted in a new agreement, which was presented in writing to the Executive\nCommittee.\nAfter considerable discussion of the proposed new agreement,\nIT WAS VOTED to approve the following statement as the basis\nfor activities of the two groups in the area of international educational\nrelations with the provision that paragraph two be amended to call attention\nto the change in international affairs and the consequent increase in the\nresponsibilities of education in this area. /5h amendment of the paragraph has\nbeen suggested to the President of the Institute of International Education\nwho will submit it to his Executive Committee at its next meeting, during the\nlatter part of March. The new wording of the paragraph will be submitted for\napproval to the Executive Committee of the Council at its meeting in May 19567\nRelated Activities of the American Council on\nEducation and the Institute of International\nEducation\nThe American Council on Education, founded in 1918, comprises in its\nmembership national educational organizations, approved universities, colleges\nand junior colleges, and a large number of other organizations and institutions"
}