{
  "id": "d402-100",
  "text": "at regular intervals before then.\nWe are not committing the Nation to a long-range military manpower\nprogram. Rather* we are directing our attention primarily toward the\nperiod immediately ahead* with the knowledge that it will be necessary\nto revise the plan as our needs change.\nWe believe that our six-months' training program for men entering\nthe ten-year obligation will enable us to build up reserve forces\nmore rapidly and effectively.\nThe purpose of the initial training is to prepare the trainees\nfor continued readiness training that they will receive when they enter\nthe \"Service Callable Reserve.\" This will be of particular importance\nin improving the level of training in units of the National Guard* which\nunder operation of the current program have a high percentage of members\nwithout previous training or service.\nThe program must be a good one* however. It requires not only the\nprovision of suitable training facilities* but also capable instructors\ndrawn from the Active Forces. It has to be well administered and it\ncan work only if the six-months trainees are properly integrated with\nthe men coming out of the Active Forces after longer service.\nOur reluctance to embark upon a program that requires any fixed\ndrain on the manpower pool is supported by the Committee on Manpower\nResources for the National Security which stated in its report to the\nDirector of the Office of Defense Mobilization;\n\" ... the Committee wishes to call strongly to the attention of those\nconcerned that the recent variations in estimates of which it has\ncognizance constitute a convincing argument for great caution in\ncommitting the country to a basic change in its program of procuring\nand training the manpower needed for national security,\" A similar\nposition regarding the sensitivity of the manpower pool was pointed\nout in the report issued by the Department of Labor as recently as\nMarch 195^.\nAlthough we are talking about 100*000 a year through this program*\nthe dynamic nature of the problem requires that the exact number to be\ntaken for any period be fixed by the President with the advice of the\nSecretary of Defense and the Joint Chiefs of Staff. Changing conditions\nover the years of the program in either the National Guard or Reserve\ncould lead to the decision to change this quota.\nNow* I would like to show you what our program as a whole will mean\nin terms of actual men.\nBy 1959* assuming the maintenance of a 100*000 rate of six-months\ntrainees annually, there would be approximately 750*000 untrained men\nin the pool available to meet the demands of the Services.\nAt the same time* there would be the required numbers in the Active\nForces* a \"Service Callable Reserve\" of approximately 3*000*000* and a\n\"Selectively Callable Reserve\" broadly estimated at 3*000*000. This is\nthe end product of the Department of Defense program.\n7"
}