{
  "id": "d402-101",
  "text": "In addition to producing the military forces needed for national\nsecurity, the plan includes two important provisions designed to\nlessen the impact on civilian economy„\nFirst, our Reserve concept contemplates a constant screening process\nto move essential civilian personnel out of the \"Service Callable Reserve\",\nand to control their subsequent recall through the Selective Service process\nSecond, the plan contemplates the use of the six-months’ active duty\nfor training in lieu of the present two-year service requirement for highly\nskilled workers over age 19 in critical defense-supporting industries,\nwhen authorized by an Executive Order which would limit its application to\nspecified groups and periods of time.\nIn addition, the plan has sufficient flexibility to include other\nfeatures in recognition of civilian needs as these needs manifest themselves\nOur most challenging task is the development of a reserve training\nprogram, a mandatory program, that will work.\nTo start with, we admit the shortcomings of our present reserve\nprogram. Over a million and a half of the members of the Ready Reserve\nare not participating in any training today.\nWe propose to pursue four complementary approaches to gain compliance\nwith our program.\nThe first is through education. One great difficulty with our present\nReserve training program is that the obligation to participate is not\ngenerally known and accepted. In general, neither the potential service¬\nman nor his family is aware that an 8-year military obligation exists,\nand they are not mentally conditioned to accept the need for Reserve\ntraining after the young man has completed his period of active duty.\nWe have to start in at the high school level and make this obligation\nknown to everyone. In addition, the information must be generally\ndisseminated through appropriate public channels.\nWe also have to provide a smoother transition from active service\nto reserve training.\nOur second approach to the enforcement problem is to provide for\na better reserve curriculum. Under present conditions many men report\nto a reserve unit once or twice and then disappear because the courses\nare not sufficiently productive.\nA third proposal is to provide incentives. Participation in the\n\"Service Callable Reserve\" training programs will entitle individuals\nto drill pay and qualify them for promotion and for retirement benefits.\nThe revised pay structure under consideration for the Active Forces\nwill be translated into increased training pay for members of the\nReserve Forces.\n8"
}