{
  "id": "d402-102",
  "text": "Our final approach to compliance with reserve training requirements\nis through enforcement procedures.\nOur solution to the enforcement problem is based on the concept\nthat honorable service includes complete fulfillment of all service\nobligations, reserve service as well as active service. If a man\nfails to participate in required reserve training he will be warned\ninitially and given ample opportunity to make up time that he has lost.\nIn the event of continued unsatisfactory participation, the\nreservist will be given an opportunity to remedy his lost proficiency\nthrough active duty. If the reservist refuses to follow this course,\nthen he will be reduced in rating and lose all retirement and remaining\nveterans’ benefits. Upon his discharge he will receive other than an\nhonorable discharge.\nWe believe that every man of value to the reserve training program\nwill want to maintain his eligibility for an honorable discharge.\nAppropriate steps will also be taken to make certain that any reservist\nwho fails to take part in required training will not avoid his service\nliability in the event of an emergency.\nIn the case of the 6-months trainee, there is relatively little\nenforcement problem, since we can always have him called back to\nactive duty for an additional one and one-half years' service in the\nevent that he fails to maintain proficiency through reserve training.\nThe training curricula for the Reserve Forces will be specified\nby the Services in accordance with their requirements. One basic\nprinciple, however, is that the training will be directly related\nto the need of the individual and his unit.\nA man who is to be used as a cook in the Forces, for example,\nand who is employed as a cook in his regular civilian job, will not be\nrequired to participate in a weekly drill program, but may take part in\nsummer training to accomplish integration within the unit.\nThe costs of the Reserve Plan fall within three categories;.\nThe cost of training six-months trainees, the cost of training Reserve\nForces to keep in a state of readiness, and the cost of procuring\nan equipment stockpile to be used by these Reserve Forces on M-Day.\nThe aggregate expenditure in these three categories depends, of\ncourse, on the numbers trained, the speed of training, and the type\nof training courses that are required. These factors, in turn, are\ntied up to the larger problem of the size of the active forces and\nappropriations authorized by the Congress.\nThe k-year program permits us to undertake a gradual and flexible\napproach with time for periodic review and with sufficient time to\nprepare for any indicated changes after 1959°\nWe believe that with a plan of this type, the active forces can\nbe held at a reasonable size complemented by a reserve organized to\nmeet assignments here or abroad under any mobilization action.\n9"
}