{
  "id": "d402-16",
  "text": "10.\nof their publications as previously established. The new agreement reads:\nThis agreement entered into between the American Council on Education,\nhereinafter referred to as the Council, and the Cooperative Study of Secondary\nSchool Standards, hereinafter referred to as the Cooperative Study, sets\nforth the conditions under which the Council will operate as the fiscal and\ndistributing agent of the Cooperative Study:\n1. The Council will distribute at prices agreed upon by the Council and\nthe Cooperative Study the various forms of EVALUATIVE CRITERIA, 1950\nedition.\n2. The Council will pay annually, or at more frequent intervals if mutually\nsatisfactory, a royalty on each copy sold under regular conditions of\nsale as follows:\nJanuary 1 - June 30, 1956\nJuly 1\n- December 31*\n1956\na.\nClothbound\n1.49\na.\nClothbound\n1.49\nb.\nPaperbound\n1.07\nb.\nPaperbound\n1.07\nc.\nComplete set of separates\n1.25\nc.\nComplete set of separates 1.25\nd.\nBanded\nsets of 5 separates:\nd.\nEach i\nzopy of separates:\n1.\nA and I\n^5\n1.\nA,B,C,I\n.10\n2.\nB,E,G,H,X\n.35\n2.\nE,F,G,H,X,Y\n.075\n3.\nC, D-5, D-10, F\n.30\n3.\nAll others\n.05\n4.\nJ\n.175\n5-\nX\n• 38\n6.\nAll others\n• 25\n3. The Council will make semi-annual reports to the Cooperative Study showing\nthe preceding period's sales, royalty due, and stock on hand.\n4. The Council will maintain a \"Project Account - Cooperative Study of\nSecondary School Standards\" to be requisitioned on by properly designated\nCooperative Study officers. The Council's administrative fee of 6fo on\ndisbursements will be charged this account EXCEPT on withdrawals for the\npurpose of making investments. The Council will make semi-annual report\non the \"Project Account\".\n5. Accounts will be audited annually by the Council's regular auditor.\n6. This agreement shall be in force January 1, 1956 until December 31> 1956.\nIT WAS VOTED to approve the agreement with the Cooperative Study\non Secondary School Standards, as presented by Dr. Adams.\n8. Committees and Commissions. The Committee had before it a roster of seventeen\ncommittees of the Council, the members of which have been placed on a rotating term\nbasis, in accordance with the vote of the Executive Committee at its meeting on\nJanuary 14-15, 1955* The Committee was advised that the membership of nine committees\nhad not yet been placed on rotating terms. In the case of one committee a natural\nrotation of membership is taking place at present and it seems advisable to post¬\npone placing the committee on a term membership basis until a later time.\nNegotiations are now under way for the allocation of terms for the members of five\ncommittees in the near future. The membership of one committee is so highly\nspecialized that the assignment of terns would not be feasible. The work of two\ncommittees will be completed during 1956 and the Committees will be discontinued.\nThe membership of three committees, which have been authorized, has not yet been\ndetermined."
}