{
  "id": "d402-20",
  "text": "2\nIIo INSTRUCTION AND EVALUATION\nCommission on Instruction and Evaluation\nThe Commission met- December 5 and 6 in Ann Arbor, Michigan, for discussion\nof a number of project proposals, and on December 7 met jointly with the Commission\non Student Personnel to discuss the topic, “teachers, student personnel workers,\ngeneral administration and 'the gifted student ' w. Four members drawn from the\ntwo Commissions made opening statements and the discussion was lively and profitable.\nThis was the first occasion on which two commissions have met for the consideration\nof issues of common interest.\nThe Commission’s discussion of “administration-faculty relations\" led to\nthe recommendation that a specific proposal be prepared to .convene a small work\nconference of teachers and administrators to discb.ss problems in relationships\nbetween faculty and administration and to propose needed research. The Commission\ncontinued its discussion of the relationship of general and professional education\nobjectives. It expects to carry this discussion further at its next meeting,\nApril 3 and 4, at the Center for Advanced Study in the Behavioral Sciences in\nPalo Alto, California, where the Center will assist by making a presentation con¬\ncerning inter-disciplinary studies ,\nThe Commission had an extended discussion of problems in the allocation\nof faculty time among teaching, research and service. It referred its discussions\nto the President of the Council for advice as to further action.\nThe Commission established a plan of rotation under vfhich members will\nbe appointed to the Commission in the future for three-year terms. Those who have\nserved on the Commission since the spring of 1953 were given terms all of which\nwill expire by the end of 1957.\nCommission on Accreditation of Service Experiences\nDuring the month of December 1955 the Commission on Accreditation completed\nits first decade of activities. The Commission was established by the Council\nand began operation on December 15, 1945, as an agency concerned with the evaluation\nof educational experiences of service personnel, cooperating with educational\ninstitutions, national, regional and state educational organizations, the Armed\nForces of the United States and Veterans Administration.\nAt its last semi-annual meeting held October 21, 1955, the Commission\nreviewed and codified the actions voted during the past ten years. As reported\nat the last meeting of the Executive Committee of the American Council on\nEducation, the Commission had previously appointed a Policy Committee to re-examine\nthe functions of the Commission and to study the various policies and procedures\nadopted since the Commission was established with the view of appraising the\nCommission’s responsibilities and relationships to the educational programs of the\nmilitary now and in the future."
}