{
  "id": "d402-24",
  "text": "6\nCommittee on Television\nThe Committee on Television, at a meeting of October 5, 1955, authorized\na conference on closed circuit television, which is being sponsored jointly by the\nCommittee and the State University of Iowa at the Iowa Continuation Center on\nFebruary 27 and 28, 1956. Invitations were issued to the administrative officers\nof 85 institutions and to approximately 20 other persons representing various fields\nof interest. The Committee exoects 70 or more persons, including administrators,\nteachers and productions specialists0 Executive Vice Chancellor Carroll Newsom of\nNew York University, a member of the Council’s Committee on Television, will be\nthe presiding officer of the conference. A. report of the conference will be\npublished 0\nThe Committee will hold a meeting on February 26 in Iowa City.\nnegotiations in regard to coordination of agencies working in\ntelevision, previously reported, have culminated in the reorganization\n>n of the Joint Committee on Educational Television into the Joint\nCouncil on Education Television. The following are represented in the new JCET,\nwith further representation of lay interests anticipated at an early date: Ameri-ean\nAssociation of School Administrators, American Council on Education, American\nAssociation of Land-Grant Colleges and State Universities, Educational Television\nand Radio Center, National Association of Educational Broadcasters, National\nAssociation of State Universities, Council of Chief State School Officers, National\nCongress of Parents and Teachers, and National Education Association of the United\nStates« The JCET has received a grant of $140,000 from the Ford Foundation in\nsupport of its work for the year 1956, its previous support having been by the\nFund for ^dult Education. The Joint Council will continue to work toward the\n[preservation and utilization of the channels reserved by the Federal Communications\n'Commission for education television and radio stations.\nThe National Citizens Committee for Educational Television will close its\noffice in Washington as of January 31, 1956, having had support for three years\nfrom the Fund for Adult Education. Its essential activities are being transferred\nto the Educational Television and Radio Center in Ann Arbor, Michigan. The Center\nreceived a grant of $90,500 from the Ford Foundation especially for these activities.\nThe\neducational\nand expansi\nCouncil on Cooperation in Teacher Education\nThe Annual Meeting of the Council on 0Ooperation in Teacher Education, held\nin Washington on October 7-8, 1955, was focused on the interests and acitivities of\nscholars and scientists concerning the improvement of the education of teachers.\nSpeakers and their topics were as follows: \"Teacher Supply and Demand\", T„ M,\nStinnett, Executive Secretary, National Commission on Teacher Education and\nProfessional Standards; \"The Science Teaching Improvement Program of the American\nAssociation for the Advancement of Science,” jo R Mayor, Director, Science Teach¬\ning Improvement Program; \"The Foreign Language Program of the Modern Language\nAssociation,”1 William R, Parser, Executive Secretary, Modern Language Association"
}