{
  "id": "d402-57",
  "text": "/uV\n-3-\nHow do we tip this pool of qualified students? The first task is obviously\nthat of identification of those who should come. Though some efforts are being made,\na complete and clear audit of the number and abilities of all our students from\nelementary grades on is required. The findings of such an audit must then be\ncooperatively used by all segments of education to identify those most qualified to\ncontinue® X\nOnce identified, these students must be inspired to continue their educational\ndevelopment to insure the fullest satisfaction for themselves and their greatest\n/^pbtential service for the nation® To achieve this result, will call for •\n^^uidan\nguidance prnrrrinrnn at all levels of education\ncbmmunities®\ncooperate' effort in the local\nw_rx'-iti + n rmi t-lct f 1\n^Onee~±denlified and uiicg~lhspir^d, (Opportunity for ^eip-eontinwing education\nto a level appropriate to their capacity must be assured by adequate financial\n<JUvi( A\nsupport® Not only in&ssfc the American family put srhigher premium on continuing- educa¬\ntion and give a higher priority to providing the costs of that education, but larger\nnumbers of additional scholarships must be provided, and all other-^nnoimohil r? forms\nof financial aid .explored*\nEven if high of quality are applied to every type of education offered,\nenrollment of ^students the high school according to conservative estimate will\ndouble by 1965* The present^be^ching force of 190,000 would also have to be doubled\n-fo,. 4° ^\n■, if the present ratio of teachers ^esre^to be maintained® Other forms of post-high\nschool education might require an even sharper increase figured on the same basis,\nsince part-time enrollments, particularly of adults, are mounting more rapidly than\nthe enrollment of full-time students® In view of the competing demands of Government\nindustry, the professions, and other levels of education for trained personnel, it is\nunlikely that enough teachers can be found to meet the needs of higher education on\nthis theoretical basis® Nevertheless a very large increase in the faculties of\ncolleges and universities will clearly be necessary® A corresponding increase of"
}