{
  "id": "d402-58",
  "text": "qualified administrators will also be required.\nSociety las a right to demand that teachers and administrators in all academic\ninstitutions be highly qualified* since upon their work depends to a large extent the\nnature of our culture and our citizenship. Since the gifted teacher must have\n-Special personal qualities as well as rigorous training* the recognition and encourage¬\nment of able persons to enter the teaching profession become7especially urgent.\nIt is also essential that means be found to retain effective teachers in the profession\nuntil they have made their maximum contribution.\nOrganizations in the field of higher education* and a substantial number of\ncolleges and universities themselves* sometimes in cooperation with secondary schools*\nare at work in planning and executing means to identify, encourage* and train a greater\nflow of competent recruits to faculty ranks. They are working to enhance teacher\neffectiveness through the use of teaching aids and the encouragement of greater\ninitiative among teachers and students. They have plans to increase the available\nsupply of teaching personnel by drawing upon the services of a larger proportion of\nwomen* and by utilizing-4^aclisks who have passed the/formal ages of retirement* whether\nin teaching or in other occupations.\nFrom government and from the, public, we seek recognition of the critical V\nt1 f<h , y .\nimportance nf ^ -frmii n.wong fh^-uaaf^em-^mof^tr-Mghly qualiltied^young people, \\\nM-ghly qual^fikisi^young people,\n;to college and imiver^i^y^^acdiin^-^and^abmlRl-stratlQn. From society we ask\n' _ __\n\"tiie a LbTactivenesh^F-\n'personal and J&miAy geeurity-emet—fccr\nspread understanding of the conditions of effective teaching* including\nthe academic proiession as a ca-rpp-r hp nhHi,iiii.mi-jLn p-pnmn+.P\nrespect for the teaching function, t(T~impyovo available\nleirease BRlnraunr. Perhaps the most important\nneed^>\nfull freedom of teaching and research^\nWith the present record-breaking total of 3*000*®00 college students likely to\ndouble by 196£* the need for expanded facilities will be proportionate unless more\neffective use can be made of present buildings and equipment. One authority estimates\nconstruction costs of approximately 13 billion dollars over the next ten years* or\nalmost double the present rate of expenditure for this purpose, even though all the\n4-"
}