{
  "id": "d402-62",
  "text": "3.\nterms of the contrast between the educational opportunities available to, let us say, the\nten-year old European child in a middle school, and the ten-year old American child in a\ngrammar school* There is no doubt that the universities across the seas have maintained\nhigh standards of scholarship, and that their life during the past half century has been\ncomfortable, aside from the disturbances of war, but there can be no doubt that the comfort\nand the scholarship have been paid for by circumscribing educational opportunities.\nNow that the achievement of creating a full system of secondary education is a matter\nof record, it is worth our while to inquire as to the nature of the social movement that\nbrought it to pass and, if possible, to state it, for a movement of such force is obviously\na fundamental one which will, though perhaps in modified form, have its effect on higher\neducation*\nThis'social movement is one which has been marked by four phenomena, which are almost\ncertainly, but perhaps not provably, related, and which for purposes of this paper are\nassumed to be related*\nThese ares\n1* The steady, even spectacular growth in the percentage of youth attending\nschool of college*\n2. The steady, though not spectacular, decline in the percentage of youth in\nthe labor force*\n3. The steady growth in productivity per capita, as noted and charted by the\neconomists*\nThe steady expansion of the economy in terms of capital investment*\nThe relationship of these four phenomena to each other is certainly not obvious on\nthe surface* But I suggest that it is clear if we consider them as being each in some\nmeasure a result of a social movement by which we have, in fifty years, replaced\napprenticeship with education. I should here explain that I am not using the word\n,fapprenticeship,r in its formal historical sense, but rather as a description of the\nprocess of fundamental education in simple skills*\nThe provability of the thesis that apprenticeship has been replaced by education\nrests fundamentally upon statistics which can be mined from various government sources.\nAs to the growth in the percentage of youth attending school or college, these\nstatistics show that in 1900 there were, in round numbers, 12 million youth between the\nages of Ik and 21, Of these, less than a million were in either school of college* By\n1950, there were over 17,1;00,000 youth between the ages of ll* and 21. Of these, just\nover 9 million were students in school or college. In other words, during a period of\nfifty years, the age group increased by kh%, while the school and college enrolments\ndrawn from that age group increased by nearly 1,000$.\nThe decline in the percentage of youth in the labor force is established by a\ncomplementary series of statistics* In 1900, out of the 11 million youth not in school\nor college, and hence available for the labor force, 8 million were actually in the labor\nforce, They constituted more than one-fourth of the existing labor force of 30 million."
}