{
  "id": "d402-66",
  "text": "7.\nIf we accept these two trends as established—the replacement of apprenticeship by\nsecondary education and the development of higher education in the direction of creating\nand serving professions which are themselves assuming an institutional form, we can\nerect a useful hypothesis as to the direction and _possibly even the extent of the further\ndevelopment of higher education.\nIn erecting this hypothesis we have the advantage of half a century of experience in\nexpanding educational systems. We know, or should know from experience that if the\nexpansion of higher education follows the pattern of the expansion of secondary education it\nwill produce the following phenomena.\n1. The concept controlling higher education which is now based on the selection of\nyouth with ability to follow professional or cultural interests will be broadened to the point\nwhere it will resemble the concept now controlling secondary education—namely that of\noffering broad opportunity to the fullest extent of individual abilities.\n2. A sizable percentage of the age group 18-21 will be shifted from the labor force\nto college. Furthermore, since higher education affects a sizable number of individuals above\nthe age of 21, there will be some shift from the labor force to education within an age\ngroup not presently heavily affected by the expansion of education.\n3. In order to provide teachers for the additional students in higher education it\nwill be necessary to develop college teacher training programs. The problems of developing\nsuch programs will not be as great as the problem of developing a teaching force for schools\nat earlier levels, at least not in terms of numbers, but the problem will be large enough\nto be identifiable and to require special solutions.\nk. Productivity will again increase thru the witholding of additional youth from the\nlabor force thru their period of advanced training, with the consequent benefit that these\nyouth will, upon entry into the labor force produce at a higher rate than they otherwise\nwould have.\n5. The capacity of the economy to expand itself thru additional investment from the\ngross national product will be increased. Additional investment funds will also be made\navailable by the shifting of the responsibility for certain forms of specialized and\nadvanced training from the employers to the taxpayers.\n6. The expansion of the economy will again generate a need for even more people\nwith superior skills and the ability to produce at a high rate.\nIn concrete terms, or at least in terms as concrete as they can be made, these\nphenomena will be manifested somewhat as follows:\nFirst, the broadening of the concept controlling higher education will result in\nbringing in to the area of what is now higher education a large number of fields that are\nnot classified as semi-professions, and as technician activities^ including fields that\nhave not yet attained to either classification. This broadening of concept is already\nnoticeable in the simple fact that a President'of the United States appointed, in 19^6,\na Commission on Higher Education, whereas In 1956 another President has appointed a\nCommittee on Education beyond the High School.\nSecond; the percentage of the college age group that will actually be in college\nwill rise rapidly, continuing the trend that began in 19^0. As suggested earlier, it will\nbe about 4Cff> by 1965. Thereafter it should continue to rise, although at a slower rate\nof increase, until it approaches its probable limit. We do not know what that limit will"
}