{
  "id": "d402-69",
  "text": "2.\nability group which suffers most from inequality of opportunity, since they may\nhave inadequate preparation in certain small or superficial function high schools«\nTherefore, when we talk of the demands for educational opportunities from the\nAmerican people as a whole, it is well to remember that these demands and needs\nmay differ in different communities and in different states because of these\ninequalities in educational opportunities.\nThat the states are alert to the challenge of these situations is evident.\nSince the end of World War II, and especially in the last few years, an impres¬\nsive number of state studies and surveys of higher education has been made.\nIn the September 1955 issue of the Annals,!/ Dr. A. J. Brumbaugh and Dr. Sugg\nanalyze briefly the objectives and assumptions of state-wide planning studies\nof Minnesota, Louisiana, Arizona, Florida, and Mississippi, and they mention\nothers. They also discuss the role of regional planning and interstate com¬\npacts, concluding that with the increase of college enrollments, those engaged\nin regional action and planning are likely to be challenged to study \"the prob¬\nlem of quality in mass education\" and the \"development of a broad conception of\nwhat constitutes excellence.\"\nIn the preliminary report of the Florida study, there are eleven basic\nassumptions, four of which I think are worthy of repetition here:\nNo. 3 - that diversified types of education programs should be provided\nto meet diversified needs of the students and of the state, for practical and\nliberal education.\nNo. 5 - that Florida will assume its share of responsibility in fields of\nregional, national and international education.\nNo. 8 - that professional and lay leaders of Florida will participate in\nthe identification of present and emerging needs of the state in higher educa¬\ntion and in the development of plans to adjust programs and facilities to such\nneeds.\nNo. 9 - that from the present study (there be) a continuous study process\nto keep higher education sensitive to the needs growing out of changes in the\nsocio-educational life of the state.\nThese emphases upon practical and liberal education, upon international\neducation, upon responsibilities of lay as well as professional leaders, and\nupon the necessity for continuous study are worthy of note.\nPerhaps the most helpful plans identify the kinds of ability which can\nprofit by the different types of post-secondary education. The California\n-study^/ goes further by differentiating quite clearly the functions of the dif¬\nferent types of institutions in the state and their contributions. For the\nuniversity, the report reserves the functions of research, instruction of the\nable, and training for professional careers. It recommends that junior college-\nes concentrate on technical-vocational education, general education, lower\ndivision ^pre-transfer education, adult education of certain grades, and guid¬\nance. The state colleges, the report submits, should educate for responsible\ncitizenship, for occupational competency at the four and five year degree level,\nl/ Annals of the American Academy of Political and Social Science, pp. 32-4l.\n2/ A Restudy of the Needs of California in Higher Education, T. R. McConnell,\nChief Consultant."
}