{
  "id": "d402-71",
  "text": "k.\nUniversity admission? Will more exacting admission requirements be set for them in\nterms of - say,, ability,, grades* motivation* objectives? Are preparations being\nmade for additional women's housing* or will that later be a limiting factor? Will\nthey be admitted for any curriculum? Will they be admitted to universities only at\nupper-class level? If coeducational colleges become too crowded to receive girls,\nwill the women’s colleges be able to receive them? Will junior colleges become\nchiefly women's colleges\" Will girls have equal opportunity for scholarships? Will\nthe rate in the 1950's of women dropping out of college be held against their\nadmission in the’60's? Will it be held against them in the *60's when they apply\nfor graduate or professional schools?\n\"How important is financial aid as a barrier to any post-high school educa¬\ntion? Will increased need for specialized personnel bring more scholarship aid?\nFor both boys and girls? Only in the natural sciences? What scholarship aid is\navailable for undergraduate women? For graduate women? Should women be allowed\nto compete equally for financial aid at the graduate level?\n\"What about the woman college graduate with the ability to go on for gradu¬\nate degrees? Should this question be asked solely from concern for an individual\nwith inadequately used talent and ability* or is there a critical social and economic\nloss to be considered? To how great an extent is the frequent weak motivation for\nadvanced work linked to possible conflicts over marriage and career? In view of\nacute shortages in the professions facing us, can top-ability women be educated in\nmotivation to help remedy these shortages and to be refreshed in preparation?\"\nMany of you know the Report \"How Fare American Women.\" Discussing motiva¬\ntion in this report* Dr. Hottel comments* \"Differences in motivation among persons\nof equal capacity may in time result in very great differences in effectiveness»2:/\nAnd again she states* \"A person continuously faced with two alternatives may develop\nquite differently from a person presented with only one course.\"2/\nAmong the recommendations from this Report is a strong one for studies on\neducational objectives of women and the outcomes of present educational programs*\napproached by (l) surveying the goals of high school and college women students*\nthe accomplishments of their graduates* and the responsibilities of adult women;\nand (2) examining both content and method of present education programs in the\nlight of these goals and the values desired.\nIn summary, we have asked these questions: What does post-secondary educa¬\ntion include? From whom may and should recommendations come for future needs?\nWho are the public? What studies have been made* especially in the states?\nWe have commented briefly upon inequalities of educational opportunity*\ntechnological changes* differing patterns of leisure* and the role of women as\nexamples of important factors to be considered in relation to the demands of the\nfuture for post-secondary education.\nDr. Maclean* after discussing in the Yearbook^/ crowded facilities* waste of\ntalents and threatened occupational shortages* makes this observation* so appropriate\nfor the conclusion of this paper:\n\"With knowledge and insight into scientific* technological* political* economic*\nsocial and humanistic trends* we may be able to use these very forces to give higher\neducation new blood* bone and sinew* and to chart the direction and speed of its\ndevelopment in an expanding universe of junior colleges* colleges* and universities.\"\nl/ and 2/ A Report of the Commission on the Education of Women, American Council\n~ on Education; prepared by Althea K. Hottel* p. 22; p.50.\n3/ NSSE Yearbook* p. 35-"
}