{
  "id": "d402-72",
  "text": "AMERICAN COUNCIL ON EDUCATION\nConstituent Member Meeting\nMayflower Hotel, Washington, D.C.\nMarch 19-20, 1956\nOffice\n1785 Massachusetts Avenue, N.W<\nWashington 6, D. Co\nTelephones Hudson 3-6620\nPaper prepared for delivery\nMonday, March 19,\n3sUO p.m.\nTHE NEED FOR EXPANDED FACILITIES\nRonald Bo Thompson, Registrar and University Examiner\nOhio State University\nBasically the need for expanded facilities in higher education during the\nnext fifteen to twenty years will be directly proportional to increasing enrollments*\nUnless better utilization of present and planned facilities can be realized in the\nfuture, it will be necessary to build, within twenty years, as many classrooms,\nlaboratories, offices, and other buildings as now exist on all the college and\nuniversity campuses in the entire United States. Two basic factors make this need\ninevitable. First, in twenty-two years the number of births each year in the United\nStates has doubled. Obviously, this means that within another twenty years the\nnumber of college-age youth in the United States will be almost twice the present\nnumber. The second factor is even more startling. The proportion of high school\ngraduates continuing on into college has increased dramatically in the last four\nyears. Even those most closely related to the problem have not realized the full\nimpact and significance of this revolutionary change in higher education. An\nexamination of the data reveals that the number of first-time students in our\ncolleges and universities has risen from 2U per cent of the number of ei^iteen\nyear olds in 1951 to 3b P©f cent of the number in 1955* In like manner, the\nnumber of first-time students has risen from bO per cent of the number of high\nschool graduates in 1951 to almost 50 per cent of the number in 1955* Stating this\ntrend in another way, the number of first-time enrollments in our colleges and\nuniversities has risen b6 per cent in four years. We already face a staggering\nresponsibility and task with Almost one fourth of the entire population of the\nUnited States in school at the elementary, secondary, or college and university\nlevel. Without stopping to enumerate the impelling forces at work, I am sure\nwe agree that still larger percentages of our youth will ask and be given the\nopportunity of a college education. This means then that we shall continue to\nsee increasing enrollments year by year until within a few short years we shall\nhave enrolled in our colleges and universities between two and three times our\npresent number of students* It is interesting to note that during the last year\nor two we have seen the total number of college-age youth in the United States at\nthe lowest level it has been in twenty-five years and lower than it will ever be\nin the foreseeable future. Despite this fact, we find our college enrollment the\nlargest m our nation's history* These data should give us cause to pause and\nFollowing present birth rate and population trends, not only will the\nenrollment in our colleges and universities double within twenty years but the\nentire population of the United States will double in just a little over forty\nyears, at *hich time we shall have a population of well over three hundred million*"
}