{
  "id": "d402-79",
  "text": "come from other colleges and universities. The Federal contribution to the in¬\nstructional budget of the Land-Grant institutions for all purposes is less than\n3=5 per cent.\nFederal funds going into agricultural research and education programs are\ncommonly called \"grants-in-aid” to the States. If one takes a detached look at\nthe whole field of agriculture, and at the way agricultural programs are financed\nin other countries of the world, one may question the accuracy of this term. Is\nthe Federal Government aiding the States, or are the States aiding the Federal\nGovernment ?\nLet me here emphasize that the primary beneficiary of Federal programs in\nagriculture in such fields as research, extension work, conservation, sanitation,\npest control, and the like, are not the farmers, but the vast majority or our\npeople who live in urban and non-farm areas. They Xiave been of great benefit to\nfarmers and farm families, but the fact is that in terms of the numbers of hours\nof work necessary to buy a given amount of food, the urban worker is today\nconsiderably better off than he was fifty (50) years ago. He also has much\ngreater assurance that his food is of high quality, and that he and his family\nwill not contract disease from consuming it. Greatly increased farm productivity\nand efficiency is the base on which our whole industrial development and popu¬\nlation growth, with a constantly higher standard of living, rests.\nTechnical Assistance and International Educational Exchange\nI shall mention only briefly our program of foreign technical assistance\nand international educational exchange, a fundamental part of the foreign policy\nof this country to which our colleges and universities have contributed greatly.\nSome fifty (50) colleges and universities are directly involved in foreign, tech¬\nnical assistance contracts. Hundreds, of others are involved in the education of\nforeign students, or in giving specialized programs for foreign visitors. Demands\nfor permanent career people and for temporary staff on long-term leaves are in¬\ncreasing. Obviously, the colleges and universities are the primary source of the\nmen and women for this national program.\nIn this paper are covered only a few areas in which the Federal Government\nhas, traditionally or in recent years, taken major responsibility. I have not\nmentioned the huge field of social welfare; the fact that industry is closely\nrelated to national security as well as prosperity; or have I discussed the im¬\npact on higher education of the vast veterans educational programs of World\nWar IX and the Korean War.\nI have not even alluded to the fact that the national government has long\nbeen looked to as the chief and best source of the collection and dissemination\nof statistical information about education, but has been woefully niggardly in\nits support of this modest activity so essential to all of us.\nThere are, of course, some ways other than those I have mentioned in which\nthe Federal Government contributes to the cost of educating people involved in\nprograms of great national concern. The National Science Foundation, for example,\nprovides a limited number of graduate and post-graduate fellowships, and it is\nexpanding its program of institutes for science teachers. The Navy has an ROTC\nscholarship program; the Army and Air Force with equal or greater needs, do not.\nVarious well-intentioned proposals have been made to provide for national\naction to meet certain needs. These include suggestions for a foreign service"
}