{
  "id": "d402-8",
  "text": "2.\nhis interest, once aroused, should endure. His term as treasurer of\nthe Council extended from December 1919 to May 19^8, two years after\nhe retired from the presidency of the American Security and Trust\nCompany of Washington.\nDuring this long period, he gave close personal supervision to Council\nfinances, requiring and studying monthly reports on all funds and\naccounts, recommending competent firms to audit the books, and giving\nadvice on a variety of other matters relating to the organization's\nfinancial stability. For more than fifteen years he personally signed\nall Council checks.\nThe Executive Committee pays grateful and heartfelt respect to the\nmemory of a distinguished citizen who fortunately made the Council\none of the objects of his enlightened concern.\nDr. Adams read to the Committee a list of the meetings and functions he\nhad attended since the meeting of the Executive Committee in October, 1955>\ncommenting on these meetings, as appropriate. The meetings were:\nOctober\n12 -- Spoke at New Jersey State Teachers College, Trenton\n28-29 -- 32nd Annual Educational Conference, University of Kentucky\nNovember\n1 -- Executive Commission of Educational Testing Service, New York City\n6-13 — Participated in inauguration of President Bachman, University of\nHawaii, Honolulu\n\" \" — Pacific Coast Committee of ACE, San Francisco, California\n\" \" — Joint meeting of Pacific Coast Committee and Western College\nAssociation\n14 -- Board meeting of Institute of International Education, New York City\n15-18 — American Association of Land-Grant Colleges and State Universities\nand Conference on Institutional Projects Abroad, East Lansing, Michigan\n\" \" — White House Conference on Education\nDecember\n2-3 — Cleveland Conference, Cleveland, Ohio\n5 — Board Meeting of Educational Testing Service, New York City\n6-7 -- Commission on Instruction and Evaluation and Commission on\nStudent Personnel Work, Ann Arbor, Michigan\n19 — Meeting with group regarding dental survey, Chicago, Illinois\nJanuary\n9 -- Meeting with representative of Modern Language Association, New\nYork City\n\" — Banquet of National Citizens Commission on the Public Schools, New\nYork City\n11-12 -- Association of American Colleges, St. Louis\nDevelopments at the Council since the October 1955 meeting of the Executive\nCommittee were reported, as follows:\n(a) President Virgil M. Hancher agreed to accept the chairman¬\nship of the proposed Council's Commission on a Dental Survey.\n(b) The Council held on December 21, 1955, a small conference on\nIndustry-College Cooperation, at which time a resume of activities in this area\nwas made and the general relationships between industry and education were discussed."
}