{
  "id": "d402-82",
  "text": "the qualified students who for one reason or another do not come to us. It is\nobvious that they are our source of the larger supply of qualified students.\nWe have been deluged with figures to prove that there are thousands upon\nthousands of capable high-school graduates who never get to college, and who just\ngo on to join the great army of the undeveloped. I shall spare you by not adding\nto the deluge. Far more important than a deluge of figures are the questions \"Who\nare these capable students?” ”wfty don’t they go to college?” ”How can we remove\ntfie obstacles that prevent their entering and remaining in college?”\nI suppose it is on the general principle that money is the root of all evil\nthat we just take it for granted that lack of money is the chief obstacle standing\nbetween an education and more-capable students who do not go to college. It is but\nnatural than to assume that scholarships are the answer' to our problem, and\nthat a federal scholarship is the panacea of all our educational ills.\nIt was then to be expected that like its predecessors the Eighty-fourth\nCongress would have the usual number of federal scholarships programs to consider.\nIn keeping with its usual interest in such matters and anticipating that its advice\nwould be sought on any serious proposal for a federal scholarship program the\nCommittee on Relationships of Higher Education to the Federal Government appointed\na sub-committee to study and prepare a policy on national scholarships. This sub¬\ncommittee soon decided that it was not in a position to recommend a national\nscholarship policy for the simple fceason that it did not have the facts. Was\nthere a real need for a federal scholarship program? Were there not already enough\nscholarships to supply the real demand? Was it true that the major obstacle for\nmany capable students entering college was financial? Were the scholarships already\navailable sufficiently well distributed? To these and similar questions, the sub¬\ncommittee did not feel it had the answers, at least not adequate ones."
}