{
  "id": "d402-83",
  "text": "Under the sponsorship of the sub“Committee and under the able and devoted\ndirection of Dr* Elmer D« West a study was begun *to gather the factual data having\na bearing on a national s cholarship policy. On February 1, 1956* the results of the\nstudy were published by the American Council on Education under the title Background\nfor a National Scholarship Policy„ Having first tried to answer such questions as\n‘‘What is a scholarship?* WHow much money is available?* *What is the need for\nScholarship Money*?* the report goes on to compile data on the *sources of\nfunds*1* the *motivational factors relating to college attendance* and the ”admin“\nistration of scholarship programs*. The report closes with a brief commentary on\nstudies that are still necessary to the solution of this problem.\nAs might be expected the report leaves many questions unanswered. This is nothing\nagainst the report. Its function was to see what facts we do possess and what facts\nwe Iqck. It could only discover| it could not create.\nThe report does show that we have considerable evidence to substantiate the\nclaim that while there is a critical shortage of trained manpower a good part of the\npotential supply of such trained manpower is constantly drained off with the large\nnumbers of capable high school graduates who do not enter college* or who do not remain\nin college to graduate. The report does show that we have sufficient evidence to prove\nthat lack of finances keeps many of these students out of college. It also shows that\nlack of proper guidance and better counselling may be an even more serious obstacle\nthan lack of money. More important still it points to some glaring needs that must\nbe filled before we can really begin to attack the problem of shortages in trained\nmanpower and before we can give adequate answers to the questions we suggested earlier™\nwho are the cpable students who do not go to college? Why*don*t they go? How can we\nremove the obstacles that stand in their way? Thus the study puts the finger on the need\nfor a clearing house of accurate* up-to-date information pertaining to scholarships. The\nstudy lists a number of studies that are essential if we are to give reasonable answers\nto the problem of trained manpower shortage. In all fairness it indicates studies that\nare now in progress. But the very mention of them in this context will, I hope, be taken\nas a pleading for their speedy completion."
}