{
  "id": "d402-86",
  "text": "AMERICAN COUNCIL ON EDUCATION\nConstituent Member Meeting\nMayflower Hotel, Washington, D. Co\nMarch 19=20, 1956\nOffice\nPaper prepared for delivery\nMonday, March 19o\nTelephones HUdson 3-6620\n1785 Massachusetts Avenue, N.W*\nWashington 6, D. C.\nHIGHER EDUCATION’S NEED FOR A\nLARGER SUPPLY OF QUALIFIED TEACHERS\nJo Conrad Seegers, President\nMuhlenberg College\nProbably all of us have heard so much about the impending increase in college\nenrolments - an increase which was felt in some degree even this year - that we set up\nsome kind of resistance whenever we hear the idea mentionedo It is not that we fail to\nrecognize the fact that a problem is going to face us, nor is the fact that we think\nthat by refusi ng to listen that we can solve or effectively postpone the issue* It\nis just a natural human reaction against listening to the same story over and over\nagain. In spite of that, in spite of the fact that I know I am setting up sales\nresistance, I am going to begin this paper by citing some figures, because they do\nlend focus to what follows.\nWe have, at this moment, about 190,000 men and women teaching in American\ncolleges. That provides a ratio of about one instructor for every thirteen students.\nIf we assume that some faculty-student ratio, and assume that the same proportion of\nboys and girls of college age will continue to attend college, neither of which\nassumptions is necessarily accurate, we will need 250,000 college teachers by i960,\nand 1495,000 by 1970* I say neither of these assumptions is necessarily valid because\nthe thirteen to one proportion is a matter of circumstance and practice which has\nnever been proved to be a matter of necessity or of optimum procedure, and the propor¬\ntion of young people attending college is not a fixed proportion. As long as records\nhave been kept, that proportion has tended to increase, and there is no reason to\nexpect that the present figure of about thirty per cent will remain fixed. And there\nare other factors involved. We will almost surely see more public junior colleges\nestablished in the next ten years. We will doubtless find that many young people will\nbe absorbed in terminal courses leading to some degree of vocational competence, and\nwill not attend four year, degree granting institutions. But no matter how you look\nat them, these figures give one pause*\nAnother set of statistics is equally arresting. In the year 1953=514, 8,996\ndoctors’ degrees were awarded by American colleges and universities* Of these, 1,388\nwere in Education, 202 in Health Sciences, 135 were in such fields as Home Economics,\nPhysical Education, and Industrial Arts* I cite this not to disparage either these\nfields or these degrees, but to underline the shortage of candidates holding\ndoctorates for the arts, humanities, and sciences*"
}