{
  "id": "d402-88",
  "text": "- J-\nSome colleges are making serious attempts to interest promising undergraduates in\ncollege teaching. Certainly we should not lose any opportunities to do this., One\nwonders to what extent graduate schools attempt a similar procedure. One hears of\ngraduate ^schools which apparently do think of themselves as being!, in a very high\ndegree,, responsible for preparing college teachers and urging and encouraging students\nto enter the field. Certain programs of study sometimes, however, make one wonder if\nthat motive is strong, as programs and courses are organized. It has been suggested\nthat reciprocal arrangements between graduate schools and certain undergraduate\ncolleges, whereby graduate students could do intern teaching, might be employed more\nwidely. This problem of supply of college teachers is essentially more a problem for\nthe undergraduate college than for the graduate school« At least that is true now,\nand probably will be for some time to come. But graduate schools are affected and\nshould be concerned. The quality of students they will receive is dependent upon the\nundergraduate instruction those students will have experienced, and we are all in this\ntogether. Their interest is direct and their concern should be genuine.\nWe should also not overlook the opportunity to go into high schools, to participate\nin their career nights or days, and suggest that in college teaching one can find\nchallenging and satisfying work.\nIt has been suggested that colleges might well call upon industry to help supply\nteachers in certain fields, by lending men with specialized training to help conduct\nsome courses. In some instances these might be on a part-time basis with a man handling\na single course or two. In others, it has been suggested it might be by lending a\nman’s services for a year. This suggestion has certain advantages, and some obvious\ndisadvantages. It is by no means guaranteed that such men, interested primarily in\nbusiness, would become good teachers, even granting that their training and background\nmight be superior. If a college depends too much upon part-time or temporary instruction,\nthe difficulty of local integration, of homogeneity, of developing what might be called\nthe personality of an institution is multiplied. Certainly some relief might be effected\nin this manner, and there are innumerable examples of such procedures, especially in the\nuse of part-time people. Artists and musicians, for example, as well as business people,\nare teaching on a part-time basis and contributing effectively in many institutions. But\nat its best this is only a partial solution.\nOne entirely possible partial contribution would be to make more effective use of the\nteacher’s time. We could certainly see that non-teaching activities are curtailed. We\ncould provide clerical workers for clerical work, and release teachers from that kind\nof chore. We can certainly investigate the possibility of using student assistants,\nespecially in schools in which graduate students are available. We could investigate\nfurther the possibility of closed circuit television, of the tape recorder in teaching\nlanguages. There have been experiments in the use of such techniques which indicate\nthat some profit has accrued. They do not take the place of the teacher, and nothing\ncan replace personal contact, but they might reduce the amount of personal contact\nrequired and thus allow a teacher to work with more students."
}