{
  "id": "d402-96",
  "text": "direction is also increasing with technological changes in equipment.\nAny sound program must not impair the services' ability to get these\nenlistments.\nAt this point let me identify the color scheme employed in our\ncharts, and define certain terms used in the subsequent discussion.\nRed denotes the Active Forces.\nBlue denotes the new Ready Reserve which we have technically called\nthe \"Service Callable Reserve.\" This is an appropriately organized and\ntrained force, constituting the reserve manpower base for the initial\nphases of a general mobilization. It is to be a readily available\nforce, subject to call in time of war or in an emergency declared by the\nCongress or proclaimed by the President.\nThe National Guard will be part of the \"Service Callable Reserve,\"\nretaining its traditional position as part of the first line defenses\nof the Nation. As such it will continue in its present structure,\nhaving both State and Federal status.\nA continuous screening process will be applied to the \"Service\nCallable Reserve\" to provide proper balance of military skills within\nestablished strengths, and to assure that individuals possessing\ncritical civilian skills will not be retained in numbers beyond\nmilitary requirements.\nGray denotes the new Standby Reserve which we have technically\ncalled the \"Selectively Callable Reserve.\" This is a non-organized,\nnon-paid reserve pool which will provide experienced personnel for\nforces to be raised for the secondary phases of mobilization.\nThe \"Selectively Callable Reserve\" will be composed largely\nof personnel who have fulfilled their \"Service Callable Reserve\"\nobligation, or who have been transferred thereto as a result of\nthe screening process. Members are liable for recall only in a\ngeneral mobilization, and their availability for service will be\ndetermined by the Selective Service System based on allocation of\ncritical skills between military service and essential civilian\nactivities.\nCombat veterans of Korea, or of any other conflict, will\nbe given first consideration for transfer to the \"Selectively\nCallable Reserve.\"\nGreen denotes a pool of draft-eligible and available manpower\nacceptable for military service.\nTo support the recruiting of long term volunteers, this pool\nshould contain approximately 850,000 men, about the number becoming\neligible for military service each year. It is particularly\nimportant that the manpower pool contain a heavy proportion of\nmen below 20, because that age group provides more than 85 percent\nof the volunteers in the Active Forces. It is also important that\nthe pool not rise beyond a level at which some men might pass the\nage of military liability without having performed military\nservice.\n3"
}