{
  "id": "d528-107",
  "text": "UNITED STATES NATIONAL STUDENT ASSOCIATION\n2115 S STREET, N.W., WASHINGTON, D. C. 20008 ® 202 / 387-5100 © CABLE / NATSTUD\nROBERT S. POWELL, JR. BILL SHAMBLIN, Vice President JAMES GRAHAM, Vice President\nPresident Executive Affairs Campus Affairs\n'' . ^77)\nFrom: Steven A. Bookshester, Program Development\nRe: A New Program of Radio Production to Serve Needs in Higher Education and Communi-\nity Development\nWith very few exceptions, use of media--particularly electrohic--has been minimal in stu¬\ndent efforts directed at both change in educational institutions'and change in the gener¬\nal community. At the same time, no body of experts would question the need for new atti¬\ntudes and improved communication of proposals for innovation as a prerequisite of non¬\nviolent change on the campus and in the greater community.\nThere appears to be an almost day-by-day growth in the deterioration of understanding of\nthe demands and needs of students and other young people in America; brief,news reports,\nfilm of violent incidents, preconceived television \"Documentaries\" seem only to enlarge\nthis gap between the young and other segments of the population.\nWithin the so-called \"youth subculture\" itself, there is an increasing fragmentation and\na growing polarization of attitudes: Students in the Northeast have insufficient infor¬\nmation on which to make reasoned decisions about happenings in the West; many white stu¬\ndents have little understanding of the felt needs of their black counterparts.\nStudents and other young people receive little information on the actions of Congress and\nvarious Federal agencies which may importantly affect their lives; government officials\nand community leaders receive only fragmentary reports on events with the \"youth subculture.\"\nStudents and others working on the campus and within minority and poverty-dominated com¬\nmunities for nonviolent change have no real national vehicle for communication of their\nexperiences, viewpoints, and needs. Innovators have no national forum for communicating\ntheir ideas and the developments of their projects.\nA FREE UNIVERSITY IN A FREE SOCIETY"
}