{
  "id": "d528-24",
  "text": "-KGBSTTTT\nTELEVISION 15/FM RADIO 89.5\nAugust 22, 1969\nMr. Robert A. Mott\nNational Educational Radio\n1346 Connecticut Ave., N. W.\nWashington, D. C. 20036\nDear Bob:\nWhen A1 Hulsen was in town last Friday, we discussed the radio portions\nof the seminar being planned for the CPB Fellows in September.\nA number of the presentations will have to do with broadcasting in gen¬\neral, and some inevitably will tend toward television, but on Tuesday\nmorning, September l6 from 9-10:30 there is a session set aside specif¬\nically for radio. I will be the chairman. It occurs to A1 and me that\nit would be a good idea for the three of us to participate. Your em¬\nphasis might be the background and present status of educational radio,\nincluding the Board's present position toward development of the national\nservice. A1 would stress the Corporation's position and steps that will\nbe taken in the immediate future under the Corporation's aegis. I will\nbe Mr. Interlocutor.\nThroughout the entire seminar there will be an emphasis on discussion by\nand with the Fellows, and not merely on straightforward presentation.\nAccordingly it seems to A1 and me that our mutual presentation might\ntake perhaps 30 minutes, followed by a good hour of talk with these people.\nAnother aspect that occurred to us would be a brief presentation high¬\nlighting the unique nature of radio. We had thought of a short tape pre¬\nsentation that might lead off the session. One possibility would be\nthe Stan Freberg spot \"Stretching the Imagination\" which Bob Hilliard\nquotes in Chapter 4 of his book \"Radio Broadcasting.\" Another example\nwould be the excellent Fuller Paint spot which does a far better job of\nselling color than television could possibly hope to accomplish. A1 has\na couple of ideas along these lines too, and you may wish to add your\nown thoughts. A1 is coordinating the acquisition of the material.\nBoth A1 and I hope you will join us for the session on September l6. CPB\ncan of course provide additional information about the seminar as a whole.\ncc: A. L. Hulsen\nSAN DIEGO STATE COLLEGE, SAN DIEGO, CALIFORNIA, 92115 • 714/286-6415"
}