{
  "id": "d528-28",
  "text": "V Corporation for Public Broadcasting\n' NEWSLETTER\nVolume 1 Number 3 September 1969\no\nREACHING FOR THE EARTH\nPublic broadcasting has announced an enterprising schedule\nfor Sundays starting this fall, along with a wide range of\nprogram projects, of new kinds of programs in production,\nof bright new talents coming into the public broadcasting\nsphere, and of increasing nationwide support of public\nbroadcasting’s objectives. Children’s Television Workshop is\nputting final touches to, and post-copy-testing, its kickoff\nprograms for Sesame Street. NET, as new president James\nDay succeeds John White, is unveiling a flock of bright new\nadditions to its program roster.\nWhile tending the fall crop, no one is losing sight of\nfuture harvests. Toward the end of June, at a place called\nWingspread in Wisconsin, public broadcasters from around\nthe country met with scores ot artists, writers, scientists,\nprofessors, all there to talk about what public broadcast\nprogramming might become in the near future, and what it\nshould become. By all indications the three-day meeting,\nheld at the Johnson Foundation’s conference house (Wing-\nspread) under the auspices of the Kettering Foundation,\nwas a mind-stretching experience.\nAs one participant recalls, “About 50 men and women\nof various backgrounds, wide age ranges and disparate\nWilliam Reed, Commissioner of the Big Ten Athletic Con¬\nference, contemplates public television possibilities during a\nbreak at the Wingspread Conference with Norman Cousins,\nEditor of The Saturday Review, and John W. Macy, Jr.,\nPresident of the Corporation for Public Broadcasting.\noccupations spent three days here at the end of June to\ndiscuss the one thing they did have mutual interest in -\npublic broadcasting. ~\nr -- Continued on page 2\nNEW IMAGES FOR AMERICANS\nCoincidentally, some of the suggestions put forth at\nWingspread were already being given tangible form at a\nnumber of public television stations. By mid-summer,\nproduction was underway on a wide range of programs that\nmay point the way for new forms of future programming.\nNowhere was such activity more intense than at the 13\ntelevision stations whose projects had won production\ngrants from the Corporation for Public Broadcasting. The\nstations and the programs they are producing under the\ngrants are as follows:\n• At KVIE, Sacramento, Richard Simpson is using film\nto explore the oneness of man and the natural world he\nis part of.\n• WTHS, Miami, is documenting how refugees from\nCastro’s Cuba are shaping - and being shaped by - the\nlife and the culture of South Florida.\n• WYES-TV, New Orleans, is recording the surviving\nAcadian life-style in Louisiana.\n• WMEB-TV, Orono, is summarizing the humor and\nfolklore endemic to Maine, as chronicled by Marshall\nDodge.\n• KTCA, St. Paul, is tracing the history of the reform\nmovements of the region.\n• WBGU, Bowling Green, Ohio is exploring whether\nAmerica’s small towns can resist being swallowed up by\nspreading cities.\n• WITF, Hershey, is mixing media, film, tape, psycho¬\ndrama, encounter, and confrontation to involve audi¬\nences in controversial issues.\n• KLRN, Austin, is charting the revolution in movies,\nexploring everything from underground cinema to\n“bag” films.\n• WHA-TV, Madison, is recording how classical music\nteachers become turned on to The Sound, and on how\nrock music groups become plugged in to the classics at\nthis summer’s Youth Music Institute.\n• WMVS, Milwaukee, is filming a new ballet on location\nin the wilderness of Wisconsin.\n• KEBS, San Diego, is examining how four eminent\nscientists view our future.\n• WCNY, Syracuse, is anatomizing the politics of the\nrural family, showing how parents and children act\nupon - and against - one another.\n• WTVI, Charlotte, is dramatizing black folklore in “The\nWalls Come Tumbling Down.”"
}