{
  "id": "d528-29",
  "text": "Continued from page 1\n“Perhaps the one other common denominator was that\nthey were about as articulate as any fifty people can be,\nand they talked steadily from 8:30 a.m. on, when the\ncommuting bus from the motel to the conference site\nwould be humming with a different meeting in every pair of\nseats, until late evening, when the bus returned.\n“The conference did not produce dramatic conclusions\nor solutions to the many problems in public broadcasting.\nIt did, however, accomplish something even more impor¬\ntant - it forged for public broadcasting keen interest where\nthere had been mild curiosity and dedication where there\nhad been interest, and even a deeper understanding by\npeople outside the business for those in it.”\nFALL DOUBLEHEADER\nMeanwhile, the Corporation for Public Broadcasting,\ntogether with the Ford Foundation, took the wraps off\npublic television’s new Fall Sunday schedule. The big news\nin the schedule is The Forsyte Saga and an experiment in\nparticipatory democracy called The Advocates.\nThe Forsyte Saga was acquired by NET from the\nBritish Broadcasting Corporation. It was run on BBC’s uhf\nnetwork, BBC-2, in the ’66-’67 season and then on the\nBBC’s main network, BBC-1, in the ’67-’68 season. As a\nresult, it is said that hardly a Briton alive has not seen the\nseries. In the BBC-1 run it was a national habit and a\nnational preoccupation. Every Sunday through the 26\nweeks of the Saga, more than 15 million Britons were\nwatching, and clergy decried the attendance falloff at\nVespers. The Saga has since been sold to 42 countries,\nincluding the Soviet Union. It stars Eric Porter, Kenneth\nMore, Nyree Dawn Porter and Susan Hampshire.\nThe Saga is vastly more than a period piece, than an\nexercise in nostalgia, although such appeal is one of the\nthreads in the series’ rich tapestry. It’s worth noting, for\nexample, that for each of the 26 hour episodes of the Saga,\nsome fifty new costumes were designed. But the signifi¬\ncance of the Saga far transcends its glamour. Society in the\nadvanced industrial nations has been so transformed in\nrecent decades that we sometimes forget how rapid and\nfar-reaching were the changes and reforms that took place\nin the hectic days of the Victorians, the Edwardians, and\nthe Georgians. The Forsyte Saga shatters the illusion of\ntranquility our perspective gives to the days of our\ngreat-grandparents and grandparents. Any delight we find in\nthe stately manners, the splendid accoutrements of those\nseemingly spacious times, may be dispelled by the way the\nSaga reveals the misery underneath. The wretchedness of\nthe working classes, and perhaps worse, the inward misery,\nthe torment of spirit that underlies the outward decorum\nand hedonism of the Forsytes.\nThe series gives an authentic picture of what daily life\nwas like for the different classes of the society from the\ntime of the Civil War right up to the beginning of The Great\nDepression.\nNATIONAL DIALOGUE\nOriginating from WGBH-TV Boston and KCET, Los\nAngeles, The Advocates, each week for 39 weeks, will look\nat a particular question open for decision on major\ncontemporary problems, such as environmental pollution,\nmilitary procurement, the draft, and dissent in the universi¬\nties.\nIn The Advocates two skilled lawyers will argue the\npros and cons of each issue, and will try to convince a\n“decision-maker” what to do about it. The decision maker\nwill be someone with responsibility for the actual decision\nin question. The lawyers will use short documentaries,\nanimated film, and filmed interviews to build their argu¬\nments.\nAn experiment in using television as a form for\nparticipatory democracy, the series will attempt to show\npeople that they can affect policies on important issues.\nMethods are being sought to permit home audiences to\nparticipate and make their opinion felt. Studio guests will\nbe polled electronically so that vote totals can be announc¬\ned as the broadcast progresses.\nRoger Fisher, professor of law at Harvard, is the\nexecutive editor of The Advocates. The executive producer\nis Gregory Harney, director of national programs at WGBH.\nThe Los Angeles producer is Dr. Richard Scott, executive\nproducer for program development at KCET.\nThe Advocates will be broadcast live at 10 p.m. EST,\nover the national public television interconnection system.\nAlthough it will be produced primarily in Boston and\n(alternating weeks) Los Angeles, production teams from the\ntwo stations will sometimes go, for live originations, to\nother cities at the center of particular controversies of\nnational interest.\nNEW SOUNDS LUUo M [\nNew directions are also evident all along the radio front\nand notably at the 22 public radio stations which won\nproduction grants from the Corporation. The grants range\nfrom $1,800 to $5,000. The 22 winners and the programs\nthey are developing are as follows:\n• WFCR-FM, Amherst, is doing An Experiment in Sound\nSensations: Or, The Non-Drama, 13 programs creating\nimages and symbols with sound.\n• WUHY-FM, Philadelphia, is conducting 10 experiments\nin participatory democracy with confrontations in the\nopen-air.\n• WBUR-FM, Boston, is programming The Drum, a series\nof 29 roundups of what’s happening in black communi¬\nties throughout the country.\n• KOAC-AM-FM, Corvallis, Ore., is exploring environ¬\nmental sound and probing noise pollution and what it\ndoes to people.\n• WMUB, Oxford, Ohio, is putting together a definitive\nmusical history of the great jazzman, Bix Beiderbecke.\n• KSJR-FM, Collegeville, Minn., is developing documen¬\ntaries to bridge the urban-rural communications gap.\n• WNYC-AM-FM, New York, is producing Eyewitness,\n20 half hours with Negro Ensemble Company drama¬\ntizing black history.\n• KUAC, College, Alaska, is recording the life of the\nnative tribes of Alaska and their troubled transition to\nthe modern world. Continued on page 3\n2"
}