{
  "id": "d528-31",
  "text": "COMING ATTRACTIONS\nSeven films for public television are now being made by the\nwinners of the television film-maker competition run by the\nAmerican Film Institute. Funds for the film projects were\nprovided by the Corporation, with a grant of $100,000.\nThe films in production are:\n• Seems Like Only Yesterday, about social change in the\n20th century as seen through three generations of one\nfamily-by Carroll Ballard, 31, of Venice, Calif.\n• A film about prejudice in a world where blacks rule a\nwhite minority—by Robert H. Dyke, 25, of Dearborn\nHeights, Mich.\n• My Brother’s Keeper, a documentary on how one\nprison warden succeeded in changing his state’s penal\nsystem-by Robert Kaylor, 34, of New York City.\n• Ride, Chicago, Ride, the shenanigans of a zany quack\ndoctor—by George Manupelli, 37, of Ann Arbor, Mich.\n• A documentary exploring radical politics and life styles\nacross America—by Jim McBride, 27, of New York\nCity.\n• A story about a young runaway who meets and\nmatches wits with his long-lost hermit father-by\nMatthew Robbins-25, of Beverly Hills, Calif.\n• A documentary on The Living Theatre’s tour of\nYugoslavia—by Sheldon and Diane Rochlin, 30, hus¬\nband and wife, of New York City.\nThe seven winners were picked from a field of 150\napplicants by an AFI panel. The Corporation has set aside\n$25,000 more for the film-makers whose films are eventual¬\nly chosen for broadcast.\nON BEING BLACK, a new series of ten original one-hour\nteleplays produced by, for, and with members of the\nnational black community, premieres on Wednesday eve¬\nning, October 1, in color. Produced by Luther James,\nformer CBS executive producer, ON BEING BLACK reveals\nin dramatic form, the multi-faceted black image of 1969.\nFrom mental illness to class divisions, from dance to\nhumor, ON BEING BLACK illuminates the black experi¬\nence. Alice Childress’ Wine in the Wilderness explores the\nrelationship of a young couple alternately being drawn\ntogether and pushed apart because of social mores. Abbey\nLincoln stars with Israel Hicks in this first drama of the new\nseries.\nJohnny Ghost stars Robert DeQui as a champion who\ntries to save boxing and the black image he has projected\nfrom the challenge of a young black boxer whose only\ninterest is in fight money. A1 Freeman, Jr. plays a middle\nclass social worker who shocks his parents by falling in love\nwith a woman on welfare in the bittersweet Basis of Need\nby Clayton Riley. A change of pace is provided by the\nfourth entertainment in the series when the Alvin Ailey\nAmerican Dance Theatre performs Talley Beatty’s The\nBlack Belt and Alvin Ailey’s Revelations. The latter work\nexplores the motivation and emotions of the American\nblack as expressed in religious music -- spirituals, songs of\ntrouble, love and deliverance. A black man’s search for help\nto battle his mental illness is the agonizing theme of Luther\nJames’ Alton Flipped, which explores a white world\nindifferent to a black man’s paranoia.\nAvant-garde composer Michael Colgrass (l.) receiving a\ncommission from CPB’s John Macy (r.) to compose\nNightingale, Inc., a musical for public television, about a\nMafia attempt to set up an opera company.\nEYES ON THE HIDDEN MEDIUM\nCPB’s Radio Advisory Council held its second meeting at\nthe beginning of August in Madison, Wise. The 12 council\nmembers mulled over ideas for a Washington production\ncenter and for a live radio network, and considered\nstandards for Public Radio stations. The Council consists of\nMyron Curry, KFJM, Grand Forks, N. D.; Richard Estell,\nWKAR, East Lansing, Mich.; Albert Fredette, WAMC,\nAlbany, N. Y.; Robert Hinz, KOAC, Corvallis, Ore.; Ken\nKager, KUOW, Seattle, Wash.; William Kling, KSJR,\nCollegeville, Minn.; Will Lewis, WBUR, Boston, Mass.;\nMarjorie Newman, WFSU, Tallahassee, Fla.; Roger Penn,\nWashington, D. C.; Karl Schmidt, WHA, Madison, Wise.;\nWilliam Siemering, WBFO, Buffalo, N. Y.; and John\nWitherspoon, KEBS, San Diego, Calif.\nEYE ON ANIMATION\nAs television coverage of Apollo 11 trajectories and\nmaneuvers again made clear, film animation is unrivaled as a\nway to make difficult subjects easy to grasp. It’s seldom\nused in educational and instructional television, of course,\nfor the simple reason that good, full animation is many\ntimes more expensive to produce than is live-action footage.\nNow the Corporation is underwriting a study to find out\nwhether public television stations, together with schools\nand universities, government agencies, and educational film\nmarketers, could be served collectively through a central¬\nized animation pool. Under a grant from the Corporation,\npublic television station KCET, Los Angeles, has assigned\nveteran animator Lawrence L. Kilty to make a feasibility\nstudy of the possibility of setting up a national film\nanimation center in Los Angeles.\nON THE EVE\nThe ability of public television to respond speedily to\npressing national concerns was again demonstrated on\nAugust 5, when NET networked a special on the Senate\nvote on the ABM looming the following morning.\n4"
}