{
  "id": "d528-34",
  "text": "Corporation for Public Broadcasting\nCAREER FELLOWSHIPS\nThe strength of public broadcasting, like the strength of any force in modern life, is the strength of its people. This summer\nthe Corporation made a number of moves designed to strengthen the ranks of public broadcasters.\nChief among them are the Career Fellowships.\nThe Corporation picked 14 men and women from a field of 82 applicants and awarded them Career Fellowships in public\nbroadcasting. The 14, who represent a cross-section of American life, will work for a year at public television and radio\nstations. Some of the winning candidates are veteran journalists distinguished for their investigative reporting, others are\nminority group community activists, and still others are experimenters in the arts.\nThe 14 Fellows will begin their training cycle with a seminar in public broadcasting to be held in New York City for three\ndays from September 14 through 16. The seminar will brief the Career Fellows on the general structure of public\nbroadcasting.\nTaking part in the seminar, along with CPB executives, will be Dr. Frederick Breitenfeld, Jr., Executive Director of the\nMaryland Center for Public Broadcasting; John Witherspoon, General Manager of KEBS-FM-TV, San Diego; Lloyd Kaiser,\nManager of WITF, Hershey, Pa.; Robert F. Schenkkan, General Manager of KLRN, Austin; William Kobin, Vice President for\nProgramming at NET; James Day, President of NET; William Greaves, Executive Producer of Black Journal; Zoel Parenteau,\nManager of KCSD, Kansas City; Dr. Richard Meyer, Director of School Services at WNDT, New York; Fred Rebman, General\nManager of WJCT, Jacksonville; and Dr. Harold Mendelson, Dean of the Communications Center of the University of Denver.\nAfter the seminar the Career Fellows will return to their respective stations, to begin the year’s program of training and work.\nOWEN COYLE\nMadison, Wisconsin.\nCity troubleshooter\nOwen Coyle, 41, will work on the development of\nStorefront Studio at WHA, Madison. The project is an\nexperiment in opening up two-way communications\nbetween the slums and the suburbs. For the past year Mr.\nCoyle has been a troubleshooter in the Madison city\ngovernment, working on critical urban problems. Before\nthat, he covered city hall and other beats for the Madison\nCapital Times. Earlier, Mr. Coyle was on the Peoria\nRegister, where he won the 1959 National Catholic Press\nAssociation Award for Best Feature Writing. A graduate of\nSt. Ambrose College in Davenport, Iowa, Mr. Coyle is\nmarried and the father of five children.\nDAVID L. CRIPPENS\nSan Diego, California.\nInner-city educator\nDavid L. Crippens, 26, will specialize in public broadcasting\nadministration as assistant to the general manager of KEBS\ntelevision and radio stations in San Diego, Calif. Named this\nyear as one of San Diego’s ten outstanding young men by\nthe Junior Chamber of Commerce, Mr. Crippens runs an\nexperimental school for ghetto children in San Diego, and\nteaches a course on U. S. minority politics at San Diego\nState College, where last year he took a master’s degree in\nsocial work. A graduate of Antioch, Mr. Crippens taught in\nBiafra for two years as a Peace Corps volunteer."
}