{
  "id": "d528-35",
  "text": "WILLIAM W. KEIFER\nWethersfield, Connecticut.\nEditor and writer\nClayton M. Grillo, 25, will work in all phases of radio\nproduction at KQED-FM, San Francisco, Calif. A graduate\nof the University of California, Mr. Grillo has been working\nas a volunteer with the new FM station, helping it to go on\nthe air last May. While working in public relations, Mr.\nGrillo took a master’s degree in communications at San\nFrancisco College, and also a third-class operator’s license.\nWilliam W. Keifer, 39, whose investigative reporting on the\nHartford city hall beat won him last year’s American\nPolitical Science Association Award for Excellence in\nPublic Affairs Writing, will work on the development and\nproduction of a new public affairs series, Connecticut Issue,\nat WEDH, Hartford. Before joining The Hartford Times\nfour years ago, Mr. Keifer edited and published a small\ntown weekly. Earlier he was with The Dayton (Ohio) Daily\nNews and The New American Library, and has edited\nbusiness publications and news magazines. An occasional\ncontributor to The Saturday Review and other publica¬\ntions, Mr. Keifer lives with his wife and five children in\nWethersfield, Conn. He is a graduate of the College of\nWooster, Ohio.\nJames Hope, 31, will develop network programs on urban\nproblems and national affairs at the headquarters of the\nEastern Educational Radio Network in Washington, D. C. A\nsenior counselor in a Washington youth training program,\nMr. Hope has taught in D. C. high schools and worked with\nthe State Department as interpreter to foreign guests.\nEarlier, Mr. Hope was with the African American Institute,\nand specialized in helping refugee African students enter\nAmerican universities. From 1962 to 1964 he was in the\n(former Belgian) Congo as an aide to the head of the Ecole\nNational de Droit et d’Administration in Kinshasa, a school\ntraining leadership cadres for the Congo administration. A\ngraduate of the American University of Beirut, Lebanon,\nMr. Hope has a master’s degree in African Studies from\nHoward University.\nJim Lehrer, 34, author of Viva Max and city editor of the\nDallas Times Herald, will become executive producer of\npublic affairs at KERA, Dallas, and will create a docu¬\nmentary production unit at the station. A reporter and\neditor on Dallas newspapers for the past ten years, Mr.\nLehrer’s novel, a satire on the retaking of The Alamo by\nMexican freebooters, has been made into a movie with\nPeter Ustinov. For the past year Mr. Lehrer has been\nmoderator of KERA’s Viewers Voice. His reporting on\npolitics in the Southwest has won him a number of awards\nand citations. A graduate of the University of Missouri,\nwith a degree in journalism, and a veteran of the U. S.\nMarine Corps, Mr. Lehrer lives in Dallas with his wife and\nthree daughters."
}