{
  "id": "d528-36",
  "text": "WILLIE J. MARTIN\nJacksonville, Florida.\nCommercial radio manager\nWillie J. Martin, 31, will work in television news production\nand programming at WJCT, Jacksonville, Fla. Vice Presi¬\ndent in charge of operations of the Mel-Lin Corporation,\nowner and operator of a group of black-oriented radio\nstations, Mr. Martin has worked in radio broadcasting for\nthe past eight years. A graduate of Alabama State College,\nMr. Martin started in broadcasting when he was still in high\nschool, moonlighting as an announcer on a local radio\nstation. From then until becoming Vice President at\nMel-Lin a year ago, Mr. Martin did everything in radio from\nannouncing to production to programming to sales. He lives\nin Jacksonville and his wife and two children.\nROSANNA JOY QUINN\nMemphis, Tennessee.\nMusic educator\nRosanna Joy Quinn, 26, will learn the ropes of television\nproduction and direction at WKNO, Memphis. A graduate\nof Howard University, with a master’s degree in education\nfrom Memphis State University, Miss Quinn has been\nteaching music to ghetto children, using the methods of\nCarl Orff and others in a Federally backed music project.\nRAMON L. MERLOS\nLansing, Michigan\nEducator and translator\nRamon L. Merlos, 28, is a special teacher of mathematics\nand languages in the Lansing Public Schools. He will work\nin all phases of television production at WMSB, Lansing,\nwhile studying radio-television at the graduate level at\nMichigan State University. Recently Mr. Merlos has worked\nas a translator and as an advisor for WMSB’s Spanish-\nlanguage news series, Revista Latina. He was born in Aporo,\nMexico and came to the United States in 1961 after\ncompleting studies at the St. Anthony Seminary in El Paso\nand at the University of Guanajuato. Later Mr. Merlos\nstudied mathematics and languages at the Catholic Uni¬\nversity of America, and recently has been doing postgrad¬\nuate work in education at Michigan State University. Mr.\nMerlos speaks fluent Spanish, French, Latin, and English.\nAmong his responsibilities in the Lansing schools is special\ntutoring of Spanish-speaking children of migrant workers.\nWILLIAM C. THOMPSON\nPittsburgh, Pennsylvania.\nProfessor of drama and\nstage director and dramatist\nWilliam C. Thompson, 30, will work on the development of\nnew forms for television drama at WQED, Pittsburgh, Pa.\nMr. Thompson last year left his post as assistant professor\nof drama and speech at Transylvania College in Lexington,\nKy., to qualify for a master’s degree in fine arts at Carnegie-\nMellon University in Pittsburgh. A graduate of the College\nof Wooster, Mr. Thompson also has a master’s degree in\ndrama from Wayne State University. He has directed and\nmounted scores of plays, from Hamlet to Krapp’s Last\nTape, and has written musical comedies, dramas and topical\nreviews. He is married and the father of one child."
}