{
  "id": "d528-37",
  "text": "JAMES VAL\nLos Angeles, California.\nCinematographer, writer, actor\nJames Val, 25, will work on the development of Ahora, a\ndaily Spanish-language news program at KCET, Los\nAngeles, Calif., while training to become a production unit\nmanager. A founder of the Mexican-American Theater\nWorkshop, Mr. Val has often appeared in Cancion de la\nRaza, KCET’s serial on the lives of Mexican-Americans in\nSouthern California. A cinematographer and writer for\nstage and television as well as actor, Mr. Val heads his own\ndocumentary-film company, and has served in a wide range\nof local youth programs. He is a graduate of East Los\nAngeles College.\nWILLIAM HUNTER WILSON\nLexington, Kentucky.\nEducator and psychologist\nWilliam Hunter Wilson, 24, will work on the development\nand administration of extension programming at the head¬\nquarters of the Kentucky Educational Television Network\nin Lexington, Ky. Mr. Wilson has been a high school\nassistant principal, and a counselor at the University of\nKentucky and at high schools, clinics, and institutions in\nKentucky. A graduate of Kentucky State College, Mr.\nWilson last year took a master’s degree in educational\npsychology and counseling at the University of Kentucky.\nTHEODORE WING\nWashington, D. C.\nFilm-maker\nTheodore Wing, 22, will work in all phases of television\nproduction at WCNY, Syracuse, N. Y., while qualifying for\na master’s degree in radio and television at Syracuse\nUniversity. A graduate of Howard University, Mr. Wing\nworked on Color Us Black, the NET Journal documentary\nfilmed at Howard, and produced and directed his own film,\n“Recess.” He was cameraman on a film called “Toward a\nBlack University Conference.” Last summer Mr. Wing took\npart in the 14th Annual Flaherty Film Seminar in Putney,\nVt. His home is in Washington, D. C.\nA. Price Broughton, 34, will specialize in network admin¬\nistration while putting together SEC A Interconnect, a new\nseries on the Southern Educational Network. While based at\nthe headquarters of the Southern Educational Communica¬\ntions Association in Columbia, S. C., Mr. Broughton will\ntravel from station to station in the network, working with\nthem in making programs for the series.\nSenior producer-director at WKNO-TV, Memphis, Tenn.,\nBroughton joined the station as a cameraman in 1961 and\nquickly rose to the top production post. A native of New\nMadrid, Missouri, Mr. Broughton has been an instructor in\nradio-television at San Francisco State College, where he\nearned an A.B. degree in “Communication Arts and\nSociety.” He was an Army broadcaster during his military\nservice.\n1345 Avenue of the Americas, New York 10019, Phone: 212-582-2020\n1250 Connecticut Avenue, N.W., Washington, D.C. 20036, Phone: 202-223-2228/9"
}