{
  "id": "d528-44",
  "text": "September 9, 1969\nMr, Albert L. Hulsen\nDirector Radio Projects\nCorporation for Public Broadcasting\n1345 Avenue of the Americas\nNew York City, New York 10019\nDear Als\nThis letter is a response to your August 22 communique.\nI know fchat we discussed these matters in some detail, but I\nfind it valuable (and I hope you do) to summarize the conversation\nwe had on August 27.\n1. Interim reports on grants. Nothing new except that we will present\nthe first formal report on schedule on the moving grant shortly after\nSeptember 30. The exact time will depend on E. A. Hough’s fiscal\ndocument.\n2. Satellite proposal. I commented on this in an earlier brief note.\nThe proposal is undergoing change, and I’ll have another draft for\nyou on September 15. Yottr comments were noted in discussion among\nNorwood, Fellows and Mott on September 5.\n3. Future Role of NER and NERN (and NPR)• I agree that between now\nand convention time we work out additional specifics. In view of\nyour call for a meeting of the Radio Advisory Council on October 28,\nI assume we would want detailed proposals to present to the advisory\ngroup and to the NER Board at that time*\nI have developed a five year plan for NER covering the fiscal\nyears 1971-1975 and this could serve as a base for projecting the\namounts of support grants for NER. I’m a little less sure of the\nNER/PS grant base but am confident we can work this out. Point is\nthat I’m willing to spend a good deal of time on the development of\nparticulars. My thought is that you and I do the basic work and get\nthe necessary staff, board, council, etc. approvals. I consider\nthis item of high priority.\n4. Reaction to timetable. In the main, I concur. These questions\noccur. Ia a full discussion of future planning for radio possible\nat NAEB convention even though CPB Board may not have approved the\nplan? Will CPB announce the criteria for public radio stations\nafter approval by board on September 26?"
}