{
  "id": "d528-68",
  "text": "14 July 1969\nMr. David M. Davis\nProgram Offioer\nOffice of Public Broadcasting\nThe Ford Foundation\n320 E. 43rd Street\nNew York, N.Y. 10017\nDear Mr. Davis:\nThank you very much for your letter of 11 July with reference to the proposal\nfor production of programs dealing with higher education and community develop-m\nment which I had initially addressed to Mr. Friendly, in a letter dated 7 March.\nIt does appear that there is a misunderstanding on your part as to the nature\nof the proposal, particularly your belief that we are proposing a service dealing\nonly with student-operated radio stations. In fact, and if you check over the\nproposal you will note the point, the proposal is to produce programs which would\nbe distributed to all educational stations which desired them, on the topios as\nnoted in the proposal.\nAt the suggestion of the Corporation for Public Broadcasting, I recently discussed\nthe production we hope to do with Mr. Robert Mott, executive director of National\nEducational Radio. Mr. Mott noted that NER does not itself have production capabilities,\nbut would be interested in distributing the programs we might produce, subject to\nits usual initial review procedures.\nAs colleges, universities, and related educational bodies are the primary holders of\neducational licenses, and as the programming we are suggesting is intended to serve\nthe educational community and related communities, and would at its best be a\ncooperative effort of a national production group plus individual stations and\nindividuals, I continue to believe that our suggestion has some merit.\nThe budget which we initially proposed could of oourse be revised downward, with a\ncorresponding reduction in the scope of programming. I am quite aware of the financial\ndifficulties of educational radio, of the considerations of the Foundation and CFB,\nand of the fact that the funding we initially requested is a considerable sum in the\ncontext of the very limited money which has been allocated by national groups to\neducational radio.\nI do hope, however, that in the light of this letter you might reconsider our\nproposal, and allow me to meet with you if you believe there might be a possibility\nof some funding.\nRespectfully,\nSteven A. Bookshester\nProgram Divelopraent\n5'e-e.\nItfe/"
}