{
  "id": "d528-7",
  "text": "IOWA STATE UNIVERSITY\nof Science\nAMES, IOWA 50010\nWO I-AM WOI-FM\n640 Kc 90.1 Me\nJune 2, 1970\nRobert A. Mott\nExecutive Director\nNational Educational Radio\n1346 Connecticut Avenue, N.W.\nWashington, D.C. 20036\nDear Bob:\nWOI-FM wishes to make the following points in regard to the issues raised by the\namendment dealing with the retention of certain station records which is now part\nof Senate File 3558 as passed.\n1. The FCC now has adequate means, through its processes of inquiry,\nto determine the extent of outside influence, governmental or\notherwise, on station news and public affairs programming.\n2. Record keeping of the sort called for under S. 3558 and its\nlegislative history, imposes an onerous burden on the bulk of the\nnon-commercial radio community, including WOI-FM. While such\nstations, as a rule, produce far more public affairs programming\nthan most commercial outlets, their overall ability to bear the\nfinancial, space, and personnel time obligations imposed by the\nbill is much less than that of the average commercial broadcaster\nin spite of the financial aid that may be forthcoming under the\nPublic Broadcasting Financing Act. The obtaining at no small cost\nthe equipment dedicated to the recording process envisioned by the\nbill, the acquisition of tape stock, and the personnel time which\nmust be devoted to the record keeping would tend to detract from\nthe ability of the stations to pursue their primary aims.\n3. Governmental influence is equally odious whether it falls on\nnon-commercial or commercial broadcasting. While the fear that\nsuch influence tends to follow financing is a rational one, it\nmust be remembered that the power of the government to license an\nactivity likewise raises the spector of undue influence. We\nmaintain that the licensing power, in fact, raises a much more\nsubstantial question. If untoward governmental pressure were\nbrought to bear on the average station, that station would be\nmuch more likely to compromise its integrity because of the\ninfluence the government has through its licensing power than\nthat which it has indirectly through the threat of the withdrawal\nof financial aid. So, if additional record keeping is required\nin order to protect non-commercial broadcasters, it is likewise\nrequired to protect commercial broadcasters who are much more"
}