{
  "id": "d528-70",
  "text": "Mr. A1 Hulsen\nCopporation for Public Broadcasting\n555 Madison Avenue\nNew York, N.Y. 10022\nDear Mr. Hulsen:\nIt was good to speak with you several days ago in regard to the proposal which we\nhad submitted to the Corporation for a program of radio production to serve needs\nin higher education and community development.\nAs I noted in our conversation, Donald Quayle suggested in his letter to me of\n18 April (in which CPB declined to fund the proposal), that I discuss the matter\nwith Robert Mott of National Educational Radio.\nI had the opportunity to do this several weeks ago, and Mr. Mott stated that while\nNER would be very interested in distributing programs which we might produce, subject\nto the usual review procedures, they have no funds available for production. This\nsituation sends me back to the Corporation^ doorstep, for NSA also has no funds\navailable for production.\nRather than submitting a suggested revised budget, I would like to state where I\nbelieve cuts might be made in the budget as submitted to the Corporation;\nThe field staff, suggested as 5, could be reduced with a corresponding reduction\nin the ability to produce diversified programming.(There would then be a reduction\nin the travel budget.) The promotion budget could be reduced, as well as postage.\nThe studio might be deleted, substituting a lower-cost, less-eophistidated arrangement,\nwith corresponding reduction in capabilities. (With reduction in field staff, there\nwould also be a reducation in the needed portable machinery.)\nOr, reduced to a bare minimum, we could make it a strickly-Washington staff, and\nhope that limited production of special national programs might be done based on\nthe contributions of stringers.\nIn all honesty, it would be much more logical from my viewpoint if yd*u could take\nthe opportunity to review the proposal as initially submitted, and suggest to me\nwhat funds if any might be made available from the Corporation for this type of\nproduction. If I had an imaginary working figure, I would be able to figune out the\nproduction possibilities.\nThank you very much for giving me the opportunity to have our proposal reviewed\nby the Corporation, and I do look forward to hearing from you in the near future.\nRespectfully,\nSteven A. Bookshester\nProgram Development"
}