{
  "id": "d528-84",
  "text": "June 16, 1969\nMr. Don Quayle\nDirector of Netowrk Affair*\nCorporation for Public Broadcasting\n555 Madison Avenue\nNew York City, New York 10022\nDear Don:\nThis is an informal interim report on one of the two grants\nawarded The National Educational Radio Network by the Corporation*\nA second letter will summarize the other grant relating to the\nrelocation of NERN from Urbana to Washington, D. C.\nThis document pertains to the $65,000 grant made January 7, 1969\nto support the current operation of the National Educational Radio\nNetwork* Tie grant is based on our proposal of September, 1968.\nThe NER Board of Directors has studied the utilization of this\ngrant at meetings March 21-22 and May 13-14. NER intends to utilize\nthe grant money prior to December 31, 1969. Though final commitment\nof funds will be made in calendar 1969, some programs will not be\naired by network stations until 1970.\nYou will recall that at about the time this grant was finalized,\ndiscussions were initiated regarding a grant to relocate NERN from\nUrbana to Washington. A study of the network operation, lead the\nNER Board to decide that the support grant should be used after the\nnetwork relocation had been completed and after new network personnel\nhad been employed. Because the network currently operates on a\nquarterly schedule, it became apparent that first upgrading of\nprograms could not occur prior to the final quarter of calendar 1969\nstarting October 1.\nWe expect that between now and August 15, when the quarterly\nprogram listing is distributed to stations for selection of programs\nto be broadcast in October-November-December, the bulk of the grant\nmonies will be committed.\nNegotiations are virtually complete for the purchase of raw\nstock audio tape in sufficient quantity to allow NERN to distribute\nhour and longer programs on one 10% inch reel. As elementary as\nthis is, the fact remains that NERN utilized only seven inch reels\nfor all distribution. The impact of this purchase of audio tape\nstock, reels, boxes, cartons, etc. is improved efficiency at the"
}