{
  "id": "d528-85",
  "text": "network duplicating center during the copying process and less involved\nplayback of the tapes at the using stations. In addition, the 10% inch\nreels will be used for music programs and we hope for improved technical\nquality by use of new, unedited tape. Finally, the purchase of 10% inch\nreel tapes will give us flexibility in the network tape inventory. As\nyou can see, this is very much a housekeeping item but an important one\nwhich follows a recommendation of NERNPAC.\nWe have made no use of the support grant funds budgeted for personnel.\nWe will review carefully the network operation in its new environment\nbefore employing added personnel. This freedom to delay a decision is\npossible only because of the operational subsidy Included in the NERN\nmoving grant.\nOur anticipation is that if the $21,200 budgeted for personnel is\nnot used in toto, we will direct the funds into program acquisition and\ndevelopment. NER’s Board hopes this will be possible. It should be\nmade clear that NERN expects to process and distribute all programs\nemanating from the CPB direct station production grants without requesting\nadditional funds.\nNo final commitments have been made regarding the acquisition and/or\nproduction of NERN programs. NER has determined that one children’s\nseries will be scheduled. Our negotiations call for the purchase of 52\nprograms (45 minutes each) of \"No School Today\". The producer, Jon\nAethur of San Fransisco, has been in contact with NERN prior to the\nCPB grant regarding use of his two series, \"No School Today\" and \"Big\nJon and Sparky\", The NERNPAC recommendation of these series was\naffirmative. The NER Board believes that Initially we should utilize\nonly one children’s series.\nWe are in negotiation with CBC and BBC regarding acquisition of\nprograms. Malcolm Fr6st and I have had a seizes of conversations and\nwe expect to conclude negotiations in late August or early September.\nAs you know, the BBC Transcription Service appointed Hartwest of New York\nas its US distributor. That agreement is ending, as it relates to\neducational radio stations, and Frost has agreed that NERN and BBC should\nnegotiate directly. He has provided us with offerings not made available\nto Hartwest. The listing is impressive and the difficulty will be in\nfinding dollars to purchase all that we may desire. Frost is amenable\nto some sort of blanket arrangement to allow carte blanche utilization.\nI am sure we cannot afford such an arrangement at this time, but I\nsuggest it is an area that NERN and CPB would want to pursue. Partrided\nof CBC has been in touch with us, and he will be in Washington in July\nto discuss possible program offerings. Our feeling is that early BBC\nor CBC purchases sh&oibd be talk, discussion, drama, etc., rabher than\nmusic.\nNER’s utilization of dollars available for domestic programming\nwill be used in the area of news and public affairs. We do not\nanticipate spot news coverage. Rather, we expect to develop a series\nof programs that will be distributed on a regular basis — such as"
}