{
  "id": "d528-99",
  "text": "a-\nn /\nCorporation for Public Broadcasting\nSuite 630\n1250 Connecticut Avenue, N. W.\nWasliington, D. C. 20036\nl-erw HfiCB •&<?<!. S-b-U\n'tfvi't fc> ‘Tu*.\n(202) 223-2228-9\nJohn W. Macy. Jr.\nPresident\nMay 10, 1969\nMr. William G. Harley\nPresident\nNational Association of\nEducational Broadcasters\n1346 Connecticut Avenue, N.W.\nWashington, D.C. 20036\nDear Bill:\nMy colleagues in public television agree with me that public television\nis on the threshold of a new era. As is so often the case, the character\nof that era is much more difficult to assess than is the emergence of the\nera itself.\nAs we embark on this new era, the timing appears opportune to raise what\nis perhaps both the most significant and most neglected question, \"What is\nto be the programming philosophy for public television?\"\nThere have been strong reasons why probing questions regarding programming\nphilosophy have not been answered in the past. Financial, technological and\norganizational concerns all have commanded a higher priority. Many, indeed\nmost, of these same concerns remain unresolved today. However, before\nfurther progress can be achieved on the financial, technological and organ¬\nizational problems, a more clearly defined programming base must emerge.\nAfter all, programming is the basic product of public television.\n-*-s this reason that I am so delighted, on behalf of our hosts, the\nCharles F. Kettering Foundation and the Johnson Foundation, as well as\nmyself, to invite you to attend the Exploratory Conference on Public Tele¬\nvision Programming.\nThe principal objective of this Conference will be to identify opportunities\nand possible new directions for public television programming. Subject\nmatter at the Conference will be limited to programming concerns in news,\npublic affairs, general knowledge, cultural areas, sports and entertainment.\nThe Conference is scheduled to begin with an informal gathering on the\nevening of Wednesday, -June 25. and extend through the early afternoon of\nSaturday, _June_28. It is to be held at the Johnson Foundation's Conference\nfacility, Wingspread, located near Racine, Wisconsin. The Conference staff\narrang^'lo^^^^i^.^doipcal .•trflusipc^agifflxr-in. Ra'cine, and will\narrange to> reimburse you for your travel expenses connected with the\nfirm -F^-v-^r-k"
}