{
  "id": "d1480-1",
  "text": "The NATION\n426\nsuggested, might have unfortunate repercussions on Ameri¬\ncan oil interests in Latin America. This particular difficulty\nwas overcome, but it is indicative of thinking in Washing¬\nton which is thoroughly in harmony with Wall Street ideas.\nCritics who object that it hardly harmonizes with the spirit\nof internationalism will doubtless be reminded that those\nwho pay the piper call the tune.\nIN ONE EAR\nBY LOU FRANKEL\nTO COMMERCIAL\nbroadcasters,\nof which there are now\nmore than 1,100 in the\nUnited States, educa¬\ntional programs on\nboth the juvenile and\nadult level have always\nbeen an unadulterated\npain in the pocketbook.\nThey required a lot of\nwork, considerable acu¬\nmen, and more money\nthan most stations were\nwilling to spend on\nsustaining programs;\nthey rarely produced\nany appreciable listener\nreaction; and they were\nnever bait for sponsors.\nThere were and are exceptions, of course, but commercial\nradio has always given educational shows a failing grade. Al¬\nthough it has classed educational stations as freaks, however,\nit never actively fought the educational and non-commercial\noperators. It had very little reason to fear them. Too many of\nthe educational institutions which had licenses to operate\nradio stations in the early days let them go by default. Today\nthe only commercially operated stations that come to mind\nare WWL, New Orleans, owned and operated by Loyola\nUniversity, and WHCU, Ithaca, the property of Cornell,\nand Georgia Tech’s WGST. Altogether, the educational and\nmunicipally owned and operated stations number only thirty.\nRecently, though, a bill was introduced in the California\nlegislature calling for $1,700,000 for a non-commercial net¬\nwork of FM stations to be run by the state Department of\nEducation. Back of this is the University of California’s de¬\nsire to carry its extension courses beyond the physical border\nof its campus.\nIn itself this is nothing new. The Federal Communications\nCommission has set aside twenty channels for non-commer¬\ncial, educational FM stations. The states of Wisconsin, Min¬\nnesota, and Michigan have educational FM networks either\nin operation or under construction. There are and have been\nnon-commercial FM stations ever since frequency modulation\nwas started, although they are even fewer than the thirty AM\neducational stations. Yet suddenly, and for no apparent reason\nexcept greed, the commercial broadcasters of California took\na stand in opposition to the California educators.\nCharles McCarthy, head of the Northern California Broad¬\ncasters Association, hurried home from Washington, D. C.,\nto confer with Robert Reynolds, his counterpart in the South¬\nern California Broadcasters Association, and other industry\nchieftains. Between them, they set out to organize a united\nfront of commercial operators against the plan.\nSince McCarthy is general manager of KQW, a network\naffiliate in San Francisco, and Reynolds is general manager\nof KMPC in Los Angeles, and their organizations include\nmost, if not all, the commercial operators in California, there\nwas no doubt they could lead a vicious fight. But still the issue\nwas not clear. After all, these were the big commercial-station\nmen, the dollars-and-cents operators in AM, not FM; in what\nway did they and their interests conflict with the educators'\nplans for FM? It just didn’t make sense.\nThen the story broke in the trade press. Variety reported:\n\"Commercial. . . broadcasters want no part of what they feel\nwill be definite competition for audience.” And Broadcasting\nreferred significantly to \"this threat to freedom of expres¬\nsion” (sic).\nThat let the cat out of the bag. The self-same broadcasters\nwho have been shouting for freedom of speech and free com¬\npetition from every and any luncheon lectern they could\nget—-these same people wanted to bar the educators.\nIt wasn’t because the radio business was doing badly; last\nyear radio sold $325,000,000 worth of time to reach an all-\ntime record and a 7 per cent increase over the previous year.\nIt wasn’t because the commercial broadcasters were doing a\ngood educational job. Nor was it because the educators were\nproposing something illegal.\nFederal Communications Commissioner Paul A. Walker\nsaid, when queried, \"State educational networks offer an\neffective means of carrying educational programs to schools\nand communities throughout the states. It has never occurred\nto us that educational stations could be, in any way, a threat\nto commercial broadcasting. In fact, it is my personal opinion\nthat such stations would be a tremendous impetus to broad¬\ncasting generally and would encourage and assist commercial\nstations through developing listening habits and greater audi¬\nences. To my way of thinking, the opposition to the Cali¬\nfornia Educational Network is exceedingly... short-sighted.”\nIt was short-sighted for a number of reasons. First, it\npointed up the fact that commercial radio was doing so bad\na job as to be afraid of losing some listeners to the educators.\nSecond, it suggested the possibility that the commercial\nradio interests were hoping to get hold of the twenty FM\nchannels now set aside for educational use by keeping the\neducators from using them.\nThird, and most important, it spotlighted, once again, the\nfight between public service and dollar service in radio.\nThe educators, via their National Association of Educa¬\ntional Broadcasters and the Association for Education by\nRadio, are fighting back. The Los Angeles Board of Educa¬\ntion has allocated funds for an engineering study of its re¬\nquirements preparatory to filing for an FM frequency to be\nused by the city and the city educators. This, in effect, puts\nLos Angeles solidly on the side of the angels.\nBut a few letters addressed to the Federal Communications\nCommission and the National Association of Broadcasters,\nboth in Washington, D. C., will do no harm."
}