{
  "id": "d1480-21",
  "text": "EDUCATIONAL RADIO\nWe need a production center for^public service programs. The case for\nIts establishment rests on some aspects of the past history of public service\nbroadcasting which we might briefly review.\nThe story of educational radio stations Is, at worst, one of sheer pro¬\nfessional incompetence. At best, it Is the record of a courageous struggle\nagainst almost hopeless odds. The muddled thinking about radio of many\neducators, the raahappy influence of politics (as it affected state university\nradio stations in particular), the opposition of commercial broadcasters —\nthese ?nd other influences have contributed to sorry story. Twenty years ago\nthere were 176 educational stations. Today only 30 are left.\nAt the risk of oversimplifying a complex problem, one might say that the\nbasic trouble with educational stations has been a vicious circle of cause\nand effect from which few have as yet entirely escaped. Inadequate funds have\nresulted in the appointment of men as radio directors with insufficient grasp\neither of what education is all about or of effective radio techniques. The\nconsequence has been that, at university stations at any rate, with rare ex¬\nceptions, most members of the faculty have remained unconvinced that radio\nis anything buy a means of diluting the elixir of pure scholarship. The rela¬\ntively few viho saw its possibilities were reluctant to submit themselves to\na new and exacting discipline— that of writing and speaking for the radio.\nThey neither trusted their radio mentors (often with very good reason) nor\nbelieved that speaking at a microphone is different from and harder than\nlecturing to a class. The result was poor programs and negligible audience*.\nThere are, of course, exceptions. Stations like WHA at the University of\nWisconsin and VJOI at Ames a Iowa, have beaten commercial radio sit Its owfi\nfee and made a deserved name for themselves. But the exceptions only prove\nfi ralfl. ... ‘ '\nWe have already seen the problem. Inherent in the necessity of being\non the air for sixteen hours a day, of maintaining a continuing high standard\nof programs. The material is limitless, but its unearthing and conversion\ninto prvrram form require a very Mgh degree of skill and imagination. It\nis no a ; ident that stomach ulcers are almost an occupational disease in\nradio. Che pace Is fast and relentless.\nWith a generous band of FM frequencies reserved for educational stations,\npublic arvice broadcasting gets its second chance. Will history repeat it¬\nself? 'r- nty years hence, shall w® witness yet again the taking over of these\nfrequeue ; s by the commercial stations with their supposed know-how? Public\nInterest, and all the machinery of planning we have proposed to foster it,\nwill not niffice to avert this calamity if publSi service programs fall in\nquality md attractive power. We shall be wise to take time by the forelock\nand profit now by past experience.\n.M\nThere is already evidence that educators intend to take FM more seriously\nthan thi.,/ did AM broadcasting. Public service broadcasting will almost certainly\nbe more jrcnerously financed and better operated. But there remains another\ndanger--that of dispersed effort, the chronic defect of men of good will. The\ncontention that the public will respond, in time, to \"seriou i* subjects has\nstill t i t<e proved, at any rate on a resale large enough to silence skeptics.\nIt would be madness not to give what we must still call an experiment the beat\nchance for success by ensuring the highest possible standards of program writing\nand production. There Is not enough talent to go around It must be pooled. The\nmeans of such a pooling are available."
}