{
  "id": "d1480-3",
  "text": "FMoBANO WILL STAY AT 88-^108 MC.\nFREQUENCY MODULATION remains at 88-108 MC, TROPOSPHERIC fading notwith¬\nstanding, THE FCC HAS RULEDa\nIn a brief announcement released Thursday the Commission denied petition\nOF the Zenith Radio Corp. and General Electric Co, to allocate the 44-50\nMC BAND TO FM IN ADDITION TO THE 88-108 MC BAND IN ORDER TO PROVIDE A\nBETTER RURAL SERVICE* TwO DAYS OF HEARINGS WERE HELD ON THE PETITIONS,\nWITH INDUSTRY ENGINEERS SUBSTANTIALLY IN AGREEMENT ON MEASUREMENTS MADE\nAT Deerfield, III*, by the Zenith Corp, and those at Andalusia, Pa., and\nPrinceton, N, J., by the FCC*\nIt will be a week or 10 days before the Commission issues its formal opin¬\nion, betting forth the REASONS FOR DENYING THE PETITION. IT WAS UNDERSTOOD,\nHOWEVER, THAT THE FCC FELT THAT F M IN THE 88-108 MC REGION WOULD PROVIDE\nample service FOR SOME TIME TO COME. EMERGENCY SERVICES ALLOCATED TO THE\n48-50 MC BAND AND THE RESERVATION OF 44-50 MC FOR TELEVISION ChANEL I\nALSO ARE UNDERSTOOD TO HAVE PLAYED AN IMPORTANT PART IN THE DECISION.\nW B A A RELEASES MAIL ANALYSIS.\nW B A A IN ITS ANNUAL MAIL REPORT SHOWED A DRAW COVERING NINE NEIGHBORING\nSTATES IN ADDITION TO 2039 PEICES OF MAIL FROM 328 INDIANA COMMUNITIES.\nNo BUSINESS CORRESPONDENCE OR SOLICITED MAIL WAS INCLUDED. JubGINQ FROM\nTHE REPORT, THE \"LISTEN WHILE YoU WORK\" PROGRAM, A VARIETY MUSICAL PRO¬\nGRAM FOR HOMEMAKERS, SPOTTED FROM lOlOO TO 10530 A.M* DAILY HAD THE BIGGEST\nDRAW. Using the oft quoted figure that one card or letter represents 500\nlisteners, Miles estimates that W B A a reached over a million homes the\npast year*\nTHIS and THM,\nOrchids to the FCC and FCC counsel Rosel Hyde for the manner in which the\nfirst session of the Clear Channel Hearing was conducted* It was apparent\nto all present that they were seeking information and not allowing the\nhearing to become a show-case for anyone’s pet peeves or private philosophie\n.Our hat also goes off to Louis G, Caldwell as one of the leading\nlawyers of the land*...enuoyed the companionship of Bob Coleman and Norris\nGrover of W k A R while in Washington. Grover, Chief Engineer for W K A R\nhas seen a lot of radio in his many years AS AH ENGINEER AND CAN REALLY\nTELL SOME GOOD ONES ABOUT PAST HAPPEN INGS.... BOB MiGGY’S REPORT ON HIS\nMEASURING PROGRAM ON RADIO TRANSMISSION AFTER SUNSET SEEMS TO SHOW THAT\nthere IS A GRADUAL INCREASE IN SIGNAL STRENGTH AT A DISTANCE AFTER SUNSET\nAND THAT THE VALUES GIVEN AS AVERAGE FOR THE SECOND HOUR AFTER SUNSET ARE\nNOT NECESSARILY REPRESENTATIVE OF THE SIGNAL STRENGTHS RECEIVED PRIOR TO\nTHIS TIME* ACTUALLYTHIS MIGHT MEAN A POSSIBILITY FOR SOME LIMITED TIME\nSTATIONS TO OPERATE ADDITIONAL TIME AFTER SUNSET.,... ThE THING WE CAN’T\nUNDERSTAND IN ALL THE DISCUSSION AND SPECULATION SURROUNGING THE EXPLORA--\nTION OF THE MOON BY RADAR IS THAT SO FAR NO MENTION HAS BEEN MADE OF CHECK\nING FOR CHEESE* ...FCC REPORTS INDICATE THAT K W L C IN OeCORAH, IOWA\nIS GIVING UP PART OF THEIR TIME TO A NEW COMMERCIAL STATION COMING INTO\nthat TOWN,.Mac’s applications for two FM stations in Wisconsin are on\nFILE WITH the FCC. SHOULD BE SOME ACTION SOON.THE BROADCAST EnGINEER-"
}