{
  "id": "d664-10",
  "text": "- 6 -\nIt must be educationally oriented toward the basic principles of the teaching-\nlearning process, and it must be technologically sophisticated and informed\nin the media approach to better education.\nThe National Association of Educational Broadcasters is the organisation\nwhich includes within its structure all of these elements. It can act as a\ncatalyst in furthering the understanding and stimulating action by member\ninstitutions and professional educators. It can provide initiative in developing\nstandards of quality and in promoting practical applications of the communications\nprocess in all areas of education.\nSULIM\n- Intensification of the activities of the professional association in its efforts\nto increase the number of gifted, well-prepared, and dedicated persons in\ncreative and transmissive roles In educational broadcasting and promote aware¬\nness of common purpose between the educational media and the field of formal\neducation as a means of backstopping, « .\n- A major citizenship training effort through facilities and personnel of\neducational broadcasting, implemented through various in-service seminars\nand workshops,cooperative enterprises with schools, colleges and other\nprofessional associations, production of radio and television programs, and\ndissemination of pertinent information and materials.\nA. The.NMB„Role\nThe National Association of Educational Broadcasters will continue to\nserve in its traditional role as an association of educators and educational\ninstitutions using communications technology, and as a distributor of\ncooperatively produced recorded educational materials. The Association\nheadquarters will take care of the public relations and public information\nservice, conduct and stimulate research, provide regular legal and advisory\nservice to the membership, and edit and publish various periodicals, and\nreports. It will conduct a continuing program of recruitment and training,\nmaintain placement service, and, in general, provide educational communications\npersonnel with a professional home that will nurture and promote their growth.\nIn addition to carrying on these regular functions, the NAEB proposes\nto intensify and accelerate its continuing effort to professionalize educational\nbroadcasting."
}