{
  "id": "d664-12",
  "text": "8\nmost Americans join a happy laughing crowd divested of responsible concern\nfor the community or accept membership in a democratic system.\nProperly managed, the mass media can provide the people of our nation,\nwherever they are, with direct participation in public happenings of vital sig¬\nnificance; they can illuminate, can teach, and even inspire.\nPublic affairs should be viewed in depth historically as well as pro¬\nspectively. Enlightenment includes: clarification of goals, trends to date,\nanalytic examination of factors that condition the past, projection of future\npotentialities, and evaluation of alternative policies. In other words, we need a\ncontextual approach to understand our place in the passing stream of events.\nThis is the kind of approach which the educational radio and television\nstations are making and will increasingly bring to consideration of public affairs.\nCommercial broadcasting, with its compulsion to seek the largest possible\naudience at all times, is entertainment oriented. There can be little or no cumu¬\nlation from one program to the next, and little introduction of material adapted to\nan educational experience. The purpose, rather, is recreational, and the mood\nestablished is one of irresponsibility and unreality; such programming conditions\nthe public to develop an allergy for matters of serious or disturbing nature.\nIn educational broadcasting the aim is not at a universal audience, but\nat selected audiences. The purpose is not to be soporific—but to stimulate, to\narouse, to Inform, The emphasis is upon realism, judgment, responsibility,\nand the effect is cumulative.\nCommercial broadcasting is so constituted that its purpose is to seek\nprofits for its stockholders; non-commercial broadcasting's sole purpose is\nserving the common good.\nThis is not to say that commercial broadcasting does not do some excel¬\nlent programming In the public service area, providing background information\nand interpretative comment, as well as giving spot news. However, such fare\ntends to be scheduled In times of crises when national attention is so focused\nas to make public affairs coverage profitable or is in response to critical scrutiny\nfrom the FCC.\nCrisis coverage, however, is not sufficiently consistent to make for an\ninformed public judgment.\nIn the Soviet world audience instruction is a matter of national policy;\nin the United States audience instruction is in irresponsibility as an incidental\naspect of marketing. Within our pluralistic society it is well for us to supple¬\nment the market when the market transgresses public interest, by non-market"
}