{
  "id": "d664-15",
  "text": "2. Develop a aeries of radio programs of similar nature but utilising\nsend-dramatic or documentary techniques. Programs would be distributed\nnation-wide over the 107 stations of the NABS Radio Network and subsequently\nmade available to commercial stations.\nIn both series, printed materials would be developed related to the\nprograms to enhance their educational effectiveness for the viewer or listner.\nCopies of the programs would be made available on tape for distribution via\nthe educational media materials centers established by the USOE. Additional\neducational benefit might be derived from publication of the scripts in book\nforms.\n3. Develop a sense of in-service teaching films for instructing teachers\nin a special course on the Soviet Union. Educational television has been\nespecially successful in providing refresher or In-service instruction for pro¬\nfessional people. It is proposed that a special course be produced utilizing\nan outstanding aurthority in the field (1.e. Professor Michael Petrovich, of\nWisconsin) to provide on-the-job training in this particular subject area\nwith the expectation that teachers could then more competently inculcate\nthis knowledge to their own students* Text materials, reading, guides, etc. would\nbe developed to accompany the course. The lessons, recorded on vide© tape,\nwould be made available for use over television stations or closed-circuit\nsystems.\nTo carry out the program outlined in the previous pages requires expenditures\nof a magnitude above and beyond the resources of NAEB. During the 10 year\nperiod in which it has had foundation support, complete self-sufficiency has\nbeen achieved for the Tape Radio Network and the Association itself,\ndespite rising costs, has made long strides toward reaching a basis of self-\nsupport for its core activities. When the headquarters was established, it\nwas only 16% self-supporting; today b0% of the operational budget is supplied\nfrom its own resources. Ibis means NAEB is now contributing to its own support\nat over five times the 19$2 rate. The steady increase in the numbers ofled¬\nucational radio and television stations and the rapid growth in individual\nmembers ( over 250 in the past three months), plus expanding project activities,\npromise eventual total, car near total support. We are confident this goal can\nbe achieved within three years»\nBudget\n1, To supplement its own funds in order to provide national leadership\nin the professional up-grading of educational broadcasting, foundation under¬\nwriting is sought for a three-year program in which support would be pro¬\ngressively reduced."
}