{
  "id": "d664-5",
  "text": "IN BRIEF\nThe purpose of this paper is to demonstrate that there is need for professional\ndevelopment of educational broadcasting as an effective and continuing approach to\ncitizenship training.\nA. The Premise\n1. The ideas and ideals which characterize American democratic society\nface a period of serious crisis and threat in the years ahead.\n2. Education is a fundamental tool in the instillation and preservation of\nthese ideas and ideals»\n3. Traditional methods of education are inadequate to meet the stress and\nstrains of the times.\nB. The Answer\n1. Educational radio^especially television—provide the most rapid means\nfor dynamic expansion of the educational facilities and educational effectiveness\nof the country.\na. The attained status of educational broadcasting and the projected\nexpansion in the next few years indicate satisfactory progress of\nthe technology.\nb. There is a widening gap between the technology and the people with\nthe knowledge, skills, and understandings to apply it to education.\nc. Such a personnel resource can only be developed through expanded\nactivities aimed at creating a true profession of educational broadcasters.\nd. The development of a core of highly competent professionals to operate\nradio and television facilities has a direct bearing on the effective use\nof such facilities in the furtherance of civic education.\ne. Educational broadcasting is uniquely qualified to utilizing these\ninstruments for advancing civic education via programming for children\nin school, adults at home, and teachers in service.\nC. The Plan\n1. In addition to continuing its traditional activities as a professional\nassociation, the NAEB will intensify its efforts to;\na. Develop an increased number of well-prepared and dedicated people\nwith standards, qualifications, and skills of a true professional group,\nthus reinforcing a project to ...\nb. Develop a major citizenship training program through facilities and\npersonnel of educational broadcasting implemented through seminars,\nprogram series, and cooperative enterprise with educational institutions\nand associations."
}