{
  "id": "d664-7",
  "text": "- 3 -\nIf education is to develop skills, knowledge, and attitudes which will per¬\npetuate our form of society and strengthen the ideological and moral fiber of\nthe nation, we must pursue excellence with these goals in mind.\nIn the face of such compelling needs, where are we to find the means of\nextending the scope and effectiveness of our educational resource?\nThe most feasible answer lies in the immediate and massive application\nof technology, particularly in communications.\nThe Role of the New £1astanfeLMg^\nWhen communications technology is skillfully used in the educational\nprocess, it makes possible the extension of more learning to more people in\nless time at less cost. This is especially true of television.\nResearch and experimentation have proved conclusively that television\ncan teach. Moreover it can extend the talents of gifted teachersasridely to\nmany people simultaneously. More importantly, television through its abUity\nto provide close-up and magnified views, and incorporate other visual devices, and\nintroducing learning experiences not possible or normally available in the class¬\nroom , can improve the quality of the learning process.\nSome of the educational uses of radio and television are:\nto elementary and secondary schools—small organized instructional pro-\ngrams, particularly in subject areas when there is a shortage of competent\nteachers.\nIn colleges and universities—distribution of lecture or laboratory demonstrations\nto a large number of students on campus or at extension centers.\nFor Improvement of teaching—the impact upon teaching methodology caused\nby imposing sharper discipline. In increasing the variety of teaching aids;\nintroducting innovations in the classroom; teacher-training through opportunities\nfor observation of classroom practices and teaching methods.\nIn pre-school instruction —programs to help prepare children for their first\nformal school experiences by offering valid pre-school education aimed at\nbuilding attitudes and early skills.\nIn adult education—Informal education aimed at providing a rich cultural\nfare through programs in the arts; a continuing learning resource via college\nlevel credit and non-credit courses and vocational and professional training;\nprograms for functional illiterates, accurate information and informed opinion\nabout public issues as a basis for making informed judgments; and in¬\ndoctrination in the ideals and values which are necessary to the sustention"
}