{
  "id": "d1149-2",
  "text": "you give authority to the radio organization of a university or a college, you\ncan’t expect it to do a good job in education unless you give it the editorial\nworkers and production men and women and clerical help necessary to take the\ngood radio talent of the faculty and assist that talent in preparing and pro¬\nducing and following up really educational programs. And you fan’t expect the\ngood radio talent of the faculty to continue indefinitely piling more and more\nradio work on top of a full-time teaching or research program. Either they will\nrebel, or they will let down on the amount of time they give to preparing their\nradio material* These things, end more, we have learned.\nIt seems to me that we stand ready now, after 5 years of int@ia&i%o, gruelling\nexperience in the realities of presenting day-to-day educational radio programs,\nto develop educational broadcasting on an assured, common sense basis and scale.\nWe no longer hope for miraculous millions to be poured into educational broad¬\ncasting. We realize that we shall have to work with small resources for some\ntime to come. We realize that the radio unit must be in the hands of a strong\nmember of the institutional faculty, strategically placed within the institutional\norganization, if it is to survive in-the inevitable competition among departments\nof instruction and administration for meager institutional funds during the next\nfew years. We realize that permanent broadcasting programs depend on making pro¬\nvision for faculty talent to prepare and present the program, and for expert radio\neducators to assist the faculty talent in preparation and presentation. We re¬\nalize that the follow-up work of educational broadcasting must be adequately pro¬\nvided for in the arrangements for clerical help, printing, and so on.\nLately when I have talked -with educational broadcasters, they have talked\npracticalities like -these, rather than taking off on conversational flights into\nthe realms of gaudy fancy about the future of educational broadcasting. That is\na significant difference between now and 5 years ago* It augurs well for the\nnext 5 years."
}