{
  "id": "d1234-2",
  "text": "presented\nTl WW Istreet Northwest\n1201 Sixteenth Strc~x\nWashington. D. C,\nCollege of Arts and Sciences\nSecond Semester? 1934-55\nRadio Program Speakers:\nAttached is a copy of the Radio Program of the College of Arts and Sciences.\nYour address is scheduled for\nThe\nbroad cast period extends from 6:00-6:15 p.m. on the day indicated.\nTwo typewritten copies of your address should be in the hands of the proper\nmember of the Radio Program Committee as indicated hereinafter at least one.\nweek before the date on which the address is scheduled to be delivered. This\nhr\nwill make it possible to bring the address to the proper attention of the.\npublic. One copy of the address to be delivered should be given to the.Di¬\nrector of WRU£ one week in advance of delivery. This is a Station require¬\nment.\nDr. Foote will have charge of the addresses to be delivered by the Departments\nof Chemistry, Biology and Oeology, Pharmacognosy and Pharmacology, and Pharm¬\nacy. Two copies of each address to be delivered by members of these depart¬\nments should be given to Dr. Foote a week in advance of delivery.\nDr. Kokomoor will have charge of the addresses to be delivered by the De¬\npartments of mathematics, Philosophy, and Psychology. Two copies of each\naddress to be delivered by members of these departments should be given to\nDr. Kokomoor a week in advance of delivery.\nProfessor Farris will have charge of the addresses to be delivered by the\nDepartments of English, Spanish and German, and French. Two copies of each\naddress to be delivered by members of these departments should be given to\nDr. Clunt a week in advance of delivery.\nProfessor Perry will have charge of addresses to be delivered by the Depart¬\nments of Bible, and Physics. Two copies of each address to be delivered by\nmembers of these departments should be given to Professor Ferry a week in\nadvance of delivery.\nCordially yours,\n9-\nRadio Committee Chairiftain\nAPPROVED:\n/a\nDean, College\nArts and Sciences\n■> '"
}