{
  "id": "d849-6",
  "text": "2\nLERCH : Italian mandolins and guitars against the importation of Japanese porcelain\ngoods, laequred woods, and decorative household articles, Italian trade\ncircles point out that more and more Italian goods are finding their way to\nJapan; and it is expected that more Japanese export items will be welcomed\nonto the Italiaa market, --\nLERBH:\nWith the rise of J§*£n's population to an even 90 million, editorials have\nrecently app^afed in the press commenting on the population problem. Mr, Lerch\nhas sel^ted an editorial from the J£|&H TIMES.\nis editorial is entitled, quite simply: Population; 90.000*000 l\nJapan continues to face the problem of over-population. The balance between\nJapan's territory and resources on the one hand; and the number of people, on\nthe other, is broken. The importance of the problem is highlighted by the\nlatest report that Japan's population has^p^P^the 90 million mark. In\nAugust, 1954, the Population Problems Research Council, realizing the need for\nquantitative adjustment of the population made a recommendation to the govern¬\nment for a greater information program regarding planned parenthood. This is\nnot a measure that can solve the population at once; but if left alone, as\nit now stands, the balance between population and resources will aggravate.\nTwo of the undesirable results of over-population are apparent in\nunemployment and poverty. It is also causing undue concentration of people\nin the big cities. Although there was an unprecedented \" bumper harvest\"\nlast year, 10 thousand more people still flocked to Tokyo, There are not\nenough jobs to go around, which surely everyone realizes. The gap between\nwealth and poverty is increasing. Although Japan suffers from a ljfack\nof resources in comparison with population, greater efforts are needed to\ndevelop the available land resources. The population problem, however, is\nat the root of the majority of problems faced by Japan,\n1*-<1\nLERCH:\nThis appeared on the front page of a recent JAPAN TIMES.\nDOCUMENTARY MARCH UP AND OUT. ( 5 seconds).\nI am very pleased to have as my guest, Mr. Marcel G-rilli, program advisor\nfor the International Department of NHK.\n( to end of interview)\nMUSIC: THEME UP AND UNDEB-JRT?TV,TFT.y\nABHOR; Written and produced by John Lerch, REPORT PROM JAPAN Is tape recorded in\nMUSIC: THEME TO END"
}