{
  "id": "d164-15",
  "text": "From the Floor: But do you really have time to do all the\nthings Headquarters tries to do?\nSkornia: Said there are certain basic things like the tape\nnetwork which absolutely must come first and be done right.\nIf the time ever comes when Headquarters cannot do these\nbasic things properly* it will be necessary to expand the\nstaff. He continued:\nill was reading the other day that this year would be a year\nof clarification (for educational broadcasting and NAEB).\nEverybody has wanted the NAEB to say what we’re doing and\nwhere we’re going. We have meetings about once a month in\nWashington in which five organizations sit around a table\nand try to decide which one of us could maybe be liquidated\nwith the greatest advantage to the reduction of total con¬\nfusion. Harold (Hill) and I have worked over draft after\ndraft of what NAEB is and where it’s going. Now* that’s not\nwhere those drafts should originate* and the one appeal that\nI came out here with was that you become articulate members*\nand each person get off his chest his viewpoints of what the\nNAEB should be as an association, where it should go and what\nit should do.”\nDunn: ”• . .Some of us can remember when there were only 22\nmembers of NAEB. Now there are more than 200* and many of\nthese people have joined NAEB without ever realizing what it\nmeans to be a member of the National Association of Educational\nBroadcasters. A great deal of responsibility rests upon each\nof us as memberso . .Educational broadcasting won’t sell it¬\nself any more than soap will sell itself without a lot of pro¬\nmotion* a lot of talk* a lot of performance. I personally\nthink the greatest dangers that face NAEB are in the rather\nlukewarm* lackadaisical attitudes on the part of members. • .”\nHull: Asked John Holt to speak about the tape network and its\nproblems•\nHolt: ”We have one primary task to take the series of programs\nwhich have been selected by the Network Acceptance Committee*\nschedule them in the best possible manner and distribute them.\nTo do this we have two duplicators. The first one which we’ve\nhad about two years has been rebuilt and works pretty well.\nThe second duplicator has done a fine job and is making our\noperation a lot more efficient. We have at present about\n7*000 tapes to work with. . . There have been some queries as\nto why we have lost from 20-2$% of our tapes. • .(The answer\nis) a majority of stations are inclined to send us tapes that\naren’t quite as good as the ones they received. • .We try to\npreserve tapes by splicing as little as possible. • .When we\n~ 3 -"
}