{
  "id": "d164-16",
  "text": "do splice a tape it is because we received back (from a\nstation) a short reel and have to fill it up in order to\nmake use of it* • •\"\nFrom the Floor: How many programs do you have in reserve\nnow for the future?\nHolt: Replied that a number of programs are still before the\nNetwork Acceptance Committee for selection, cited a few ex¬\namples and said he couldn*t really give an accurate answer\nuntil the Committee finished its current selections.\nFrom the Floor: Percentagewise, could you break down the\nsources of programs now used on the network?\nHolt; Answered in terms of hours per week-foreign, 2\nhours; grant-in-aid, \\ to 1 hour; other outside organiza¬\ntions 1 hour; and the rest by member stations, about 3 to\nk hours per week*\n(Question:)\nHolt: Offered some suggestions on proper handling of tapes.\nAsked that broken tapes be spliced more carefully. Said some¬\ntimes a bad batch of tapes gets into circulation because of a\nfaulty channel in the duplicator. Asked that member stations\nadvise Headquarters immediately when a bad tape is received\nso that the' faulty channel can be corrected immediately.\nVogls Mould it be possible in the future with your announce¬\nment of forthcoming programs to provide a master tape which\nwould include two or three minute samples of each of the\nseries offered? This would help a great deal in deciding\nwhich offerings we wish to take and those we don*t want.\nHolt: Agreed the idea was good but cautioned against placing\ntoo much reliance upon a two or three minute segment of a\nwhole program series.\nSkornia: Asked Holt how many programs or series were auditioned\nso far this year by the Network Acceptance Committee.\nHolt: 108 auditions so far this year, probably 115 by November 1*\nHull: Asked the opinion of Skornia concerning having a Tape\nNetwork Program Director who would audition and select offer¬\nings rather than having the procedure handled by committees\nsince the job is so burdensome and time-consuming."
}