{
  "id": "d164-6",
  "text": "MXNDTBS OP HAEB [MBGIQH Vf]\nJanuary 15, 1959 T!fC&, Hiansapolia, Minnesota\nMembers of legion 19, MB, eat for a one-day mating In Minneapolis,\nMinnesota, on January 15, 1959. The following representatives of the BASE\nmember institution* ware presents\nSister Amalia Gallagher, College of St. Scholastiea, Duluth, Minnesota\nSister Theresa College of St. Scholastics, Duluth, Minnesota\nHarold Gregory, Minneapolis Public Schools, Minneapolis, Minnesota\nm Co Mill ism, S.J., Creighton University, Omaha, Babfaska\nSheldon Goldstein, University of Minnesota, Minneapolis, Minnesota\nRobert toast*, Macalaater College, St* Paul, Minnesota\nMilford Jensen, St. Olaf College, Horthfleld, Minnesota\nJin Slack, University of South Dakota, Vermillion, South Dakota\nW. Boyd Roomy, KUGH-TV, University of MSbreska, Lincoln, Nebraska\nAlton S. Hotaling, SCOOH-TV, University of Nebraska, Lincoln, Nebraska\nBetty Msisingsr, KUOB-TV, University of Hebraaka, Lincoln, Bsbrssks\nOpalee Barnard, Cedar Rapids Public Schools, Cedar Rapide, Iowa\nRichard F„ Yogi, lorn State College, Ames, lows\nJohn Schwarswslder, Director, Region XV, Minneapolis, Minnesota\nHarry J. Skomia, Executive Director, BABB, Urbane, Illinois\nMillie® G. Harley, President, BARB, Madison, Wisconsin\n1. Chairman Jim Slack called the meeting to order at approximately 9:15\nAM and outlined the program for the day.\n2* Slack introduced John Schmrswelder, newly-elected Director of Region\nIV, who made brief reference to a proposal to be presented after lunch,\nthen introduced Harry Skomia.\n3. Skomia outlined briefly the operation of BARB Headquarters and referred\nmembers to recent articles by him in the HAIR Newsletter end Journal for\nfurther detail. He called for a general campaign to axil 1st BABB station\nstaff nsmbers and personml of other member institutions as Individual\nMembers*\nSkomia reported in seem detail on the following projects recently\nundertaken by Headquarters:\na) three applications submitted to the Department of Health,\nEducation and Welfare for research funds under title VZX of\nthe Hlll-Blliott Bill.\nb) Final report to the Ford Foundation.\nc) Testimony submitted to the FOC in defense of FM reservations.\nd) New application to the Kellogg Foundation for continued sup-\nport of HABB Headquarters operation.\nSkomia also reported on current activity slated toward establishing a\nprofessional accrediting system for educational broadcasters."
}