{
  "id": "d1452-2",
  "text": "NAEB-May-5.\nExtension Division Radio Class Presented in First Air Program. Members of Joseph\nG. Catanich’s Extension Division classes in Radio Writing and Broadcasting\nTechnique presented their first broadcast over Radio Station KNX Saturday, March\n30, at 4:30 p. m. Original five minute sketches concerning the homo life and house\nhunting problems of Mr. and Mrs• America -written by students were enacted,\n•--•Now classes in Radio Writing, Production and Broadcasting are organizing now\nat the University of California Extension Division and will meet every Thursday\nevening in the Hillstreet Building, Los Angeles * from 6:30 to 9:30 p. m.\n\"LISTENING TO FARM BROADCASTS\"\nFrom Andrew W. Hopkins, Editor for the Cooperative Extension Work of the University\nof Wisconsin and the U, S. Department of Agriculture in Wisconsin, comes a copy of\n\"Listening to Farm Broadcasts\"—a ten-weeks study of the farm programs of the first\neducational radio station of the United States, by Wilford D. Porter. Mr. Porter,\nwho is the Extension Editor of Utah State Agricultural College, made this survey\nwhile doing graduate work at the University of Wisconsin. Wc feel that this\nbulletin will be of interest to educational broadcasters—both those who are broad¬\ncasting farm programs, and others. Thoso interested in securing this publication\nshould ask for Bulletin 5, Department of Agricultural Journalism, College of\nAgriculture, University of Wisconsin, Madison.\nFARM RADIO PROGRAMS\nAccording to the Farm Radio Programs published by the New York State College of\nAgriculture, Cornell University, Ithaca, New York:\n\"Twenty-four radio stations in New York State are cooperating with the New York\nState College of Agriculture and Home Economics, the New York State Veterinary\nCollege, and the experiment stations, and the county representatives of these\ninstitutions, to bring new ideas and the farm news of the day to New York state\nhomes. These stations, which are broadcasting farm and home programs, are so\nsituated that every listener in the state can receive these daily educational broad¬\ncasts .\n\"In some of these programs you will hear directly the voices of specialists,\nteachers and investigators from colleges and educational institutions; or the\nvoices of county agricultural agents, home demonstration agents and 4-H club leaders\nIn other programs a member of each station’s staff who specializes in broadcasting\nfarm programs, presents the daily messages.\n\"The New York State College of Agriculture furnishes daily programs to twenty-four\nstations which have assigned special broadcasters to handle educational agricultural\nannouncements •\n\"About one hundred twenty-five talks are broadcast each month during the daily noon\nfarm program from the University station WESG at Ithaca. Also members of the colleg'\nstaff speak on other stations as circumstances require. For the program on WGY at\nSchenectady, the college furnishes a speaker each Monday noon.\"\nRANDOM NOTES FROM THE RADIO INSTITUTE\nColumbus, Ohio, May 6-8\n(As reported by Miss Blanche Young, Assistant Director, Department of Publications,\nIndianapolis Public Schools, Indianapolis, Indiana)\n\"The most important figure at the opening meeting Monday morning was Mr. Aiming"
}