{
  "id": "d1452-2",
  "text": "•*3~\neffort of listening. My suggestion in this regard is that stations sponsor economics\nhours, psychology hours, government hours, and science hours. These hours could con¬\nsist of several talks interspersed with music to permit relaxation. A round table\nmethod, dialogue, or dramatization might be used for the sake of variety. But it\nis essential 'that these talks or round tables appeal to the same type of listener.\nOne talk should not be on business research, another on sanitation, and a third on\nmusic appreciation. It is quite likely that the listener who wants to hear one will\ni0t want to hear the other two. The talks should treat similar topics or take up\ndifferent phases of the same topic. For example, three talks might be devoted to\nthe nroblem of illumination. One talk could describe the different types of illumin¬\nation under which swe work and methods of measuring illumination, A second talk\ncould discuss hie history of illumination and the development of devices for pro¬\nducing artificial light. A third talk might take up the effect on health of good\nand poor lighting-.\nIt is clear that in a specialized society, such as the one in which we exist,\nthere is no longer need for each station to preserve its local identity by giving\nexclusively local programs. Programs will be improved when some means of making\nmore extensive use of single programs is developed. At present this can be done in\ntwo ways, either by transmitting such programs by means of wire from one station to\nanother, or by recording them and distributing the records. As an advance in educa¬\ntional broadcasting, I foresee the careful preparation of talks or programs under\nunhurried conditions, the testing of these programs locally, and finally the record¬\ning of these programs for use by a large number of stations#\nThere is no more reason why a speaker with sufficient ability to entertain and\ninterest his audience should go unpaid, than that he should appear on the platform\nwithout remuneration, or write a book without receiving royalties. At present, how¬\never, educational organizations have very little money to pay speakers. The prepara¬\ntion of a suitable talk requires a tremendous amount of work from those unfamiliar wit\nthe composition of material for broadcasting. The program is soon over without any"
}