{
  "id": "d1452-4",
  "text": "NAEB-May-5.\nan educational broadcast is given, thus giving permanent form to what has beon said,\n\"Tuesday evening at the banquet all three speakers were very well selected and had\nvery positive ideas about *Radio Broadcasting in the Future,* which was their topic,\n\"Stanley High, news commentator, NBC, said that radio*s prime purpose was for enter¬\ntainment; that we should get our facts from educators and loave the showmanship\nnecessary for successful broadcasting to the broadcasters; that radio will continue\nto become more perfect mechanically, but that radio itself is on edge—it is still\njittery, he said. The big idea in large broadcasting stations is not to plan ahead,\nbut to produce each day and let tomorrow take care of itself; that they work on a\nhand-to-mouth basis. He cited the experience of ono broadcasting studio which\nspent |10,000,000 on new equipment only to find when it was completely built that\nit was entirely obsolete. He suggested several boards of review; that there would\neventually bo a board of review for advertising on the air to determine the kind of\nproducts which should be advertised and to determine the way the product is adver¬\ntised; that there would be eventually a plan department for programs of the\nfuture ,\n\"Raymond Gram Swing, editor of the Nation, had a voice, sense of humor, and manner\nof delivery very much like Alesander Woolcott, He said the groat mistake most\npeople make in broadcasting is that they forget to be conversational. One must\nremember that the radio is a door handle into a living room. Broadcasting is an\nart. The art of being personal. Ideas must be expressed simply and clearly, and\nbroadcasting should be done by excellent broadcasters, not by persons who speak\nbecause they are authorities on certain lines. He knows of only one person who has\na perfect radio personality, who is not a professional broadcaster, and that is Sir\nOliver Lodge, Through all the talks it was evident that the main thing to watch\nfor in radio broadcasting is a human interest appeal. If the material lacks this\nhuman interest, it will be unsuccessful on the air.\n\"The techniques clinic Wednesday morning showed very definitely the need for pro¬\nfessional training on the part of educators.\" (A number of records from educational\nschools of the air and from CBS and NBC were played) \"Certain definite principles\nmay be established from this demonstration. That it is more important for a\nstudent to develop culture and good taste rather than to increase his knowledge of\nfacts. Facts are soon forgotten, especially those facts learned in a classroom, A\ntoacher’s moral influence upon a student in development of his character has been\nproved to bo more important than the subject matter she teaches. Therefore, it\nseems to me that the type of broadcasting we as educators must do is the kind that\nwill contain few facts and have human interest as the paramount idea,\n\"In trying to determine how much time should be spent in preparation for radio broad¬\ncasts, I talked with Joe Reis, educational director for WLW, who was originally a\nteacher in the Indianapolis schools and who has had direct charge of all of the\nOhio School of the Air programs over WLW. He said that WLW allowed him twenty hours\nfor writing a half hour broadcast. This they counted as half a week*s work. I\ntold him that I had estimated that it took me ten hours to write fifteen minutes\nscript for our family series, and he said that it would take longer in proportion\nto do a fifteen minute program than a thirty-minute program because condensing\nmaterial was more difficult on a fifteen minute program. He would estimate about\nthirteen hours. I asked him how much of the success of the broadcast depended upon\na well written script and he said perhaps 90%, that is, after the script has been\nrewritten until it is in perfect form for broadcasting. Most of their programs\nrequire three readings after which the script is rewritten each time, and a final\ndross rehearsal takes place an hour or so before the broadcast,--"
}