{
  "id": "d1429-13",
  "text": "power was limited to technological matters only. The\nCourt rejected this, saying (National Broadcasting Com¬\npany v. United States, 319 U.S. 190, 216-217):\n“The Commission’s licensing function cannot be dis¬\ncharged, therefore, merely by finding that there are no\ntechnological objections to the granting of a license.\nIf the criterion of ‘public interest’ were limited to such\nmatters, how could the Commission choose between two\napplicants for the same facilities, each of whom is\nfinancially and technically qualified to operate a sta-\n, tion? Since the very inception of federal regulation\nby radio, comparative considerations as to the service\nto be rendered have governed the application of the\nstandard of ‘public interest, convenience, or necessity.’ ”\nThe foregoing discussion should make it clear not only\nthat the Commission has the authority to concern itself\nwith program service, but that it is under an affirmative\nduty, in its public interest determinations, to give full\nconsideration to program service. Part III of this Report\nwill consider some particular aspects of program service\nas they bear upon the public interest.\nPART III. SOME ASPECTS OF \"PUBLIC\nINTEREST\" IN PROGRAM SERVICE\nAs has been noted, the Commission must determine,\nwith respect to each application granted or denied or re¬\nnewed, whether or not the program service proposed is\n“in the public interest, convenience, and necessity.”\nThe Federal Radio Commission was faced with this\nproblem from the very beginning, and in 1928 it laid\ndown a broad definition which may still be cited in part:\n“Broadcasting stations are licensed to serve the pub¬\nlic and not for the purpose of furthering the private or\nselfish interests of individuals or groups of individuals.\nThe standard of public interest, convenience, or neces¬\nsity means nothing if it does not mean this. . . . The\nemphasis should be on the receiving of service and the\nstandard of public interest, convenience, or necessity\nshould be construed accordingly. . . . The entire lis¬\ntening public within the service area of a station, or of\na group of stations in one community, is entitled to\nservice from that station or stations. ... In a sense a\nbroadcasting station may be regarded as a sort of\nmouthpiece on the air for the community it serves, over\nwhich its public events of general interest, its political\ncampaigns, its election results, its athletic contests, its\norchestras and artists, and discussion of its public issues\nmay be broadcast. // . . . the station performs its\nduty in furnishing a well rounded program, the rights\nof the community have been achieved.” (In re Great\nLakes Broadcasting Co., F.R.C. Docket No. 4900; cf.\n3rd Annual Report of the F.R.C., pp. 32-36.) (Em¬\nphasis supplied)\nCommission policy with respect to public interest de¬\nterminations is for the most part set by opinions in par¬\nticular cases. (See, for example, cases indexed under\n“Program Service” in Volumes 1 through 9 of the Com¬\nmission’s Decisions.) A useful purpose is served, how¬\never, by occasional overall reviews of Commission policy.\nThis Part will discuss four major issues currently involved\nin the application of the “public interest” standard to pro¬\ngram service policy; namely, (A) the carrying of sustain¬\ning programs, (B) the carrying of local live programs,\n(C) the carrying of programs devoted to public discussion,\nand (D) the elimination of commercial advertising ex¬\ncesses.\nA. THE CARRYING OF SUSTAINING PROGRAMS\nThe commercial program, paid for and in many in¬\nstances also selected, written, casted, and produced by\nadvertisers and advertising agencies, is the staple fare of\nAmerican listening. More than half of all broadcast time\nis devoted to commercial programs; the most popular\nprograms on the air are commercial. The evidence is\noverwhelming that the popularity of American broadcast¬\ning as we know it is based in no small part upon its com¬\nmercial programs.\nNevertheless, since the early days of broadcasting,\nbroadcasters and the Commission alike have recognized\nthat sustaining programs also play an integral and irre¬\nplaceable part in the American system of broadcasting.\nThe sustaining program has five distinctive and outstand¬\ning functions.\n1. To secure for the station or network a means by\nwhich in the overall structure of its program service,\nit can achieve a balanced interpretation of public\nneeds.\n2. To provide programs which by their very nature\nmay not be sponsored with propriety.\n3. To provide programs for significant minority tastes\nand interests.\n4. To provide programs devoted to the needs and pur¬\nposes of non-profit organizations.\n5. To provide a field for experiment in new types of\nprograms, secure from the restrictions that obtain\nwith reference to programs in which the advertiser’s\ninterest in selling goods predominates.\n(1) Balance-wheel Function of the Sustaining Program.\nThe sustaining program is the balance-wheel by means\nof which the imbalance of a station’s or network’s pro¬\ngram structure, which might otherwise result from com¬\nmercial decisions concerning program structure, can be\nredressed.\nDr. Frank N. Stanton, then Director of Research and\nnow vice-president of the Columbia Broadcasting System,\nexplained this function to the House Committee on Inter¬\nstate and Foreign Commerce (Hearings on H. R. 4597,\n77th Cong., 2nd Sess., May 7, 1942, page 289):\n“One use Columbia makes of sustaining programs is\nto supplement commercial offerings in such ways as to\nachieve, so far as possible, a full and balanced net¬\nwork service. For example, if the commercial programs\nshould be preponderantly musical, Columbia endeavors\nto restore program balance with drama or the like in\nits sustaining service.”\nThe Commission, as well as broadcasters themselves,\nhas always insisted that a “well-balanced program struc¬\nture” is an essential part of broadcasting in the public\ninterest. At least since 1928, and continuing to the\npresent, stations have been asked, on renewal, to set forth\nthe average amount of time, or percentage of time, de¬\nvoted to entertainment programs, religious programs,\neducational programs, agricultural programs, fraternal\n[12]"
}