{
  "id": "d1429-14",
  "text": "programs, etc.; and the Commission has from time to\ntime relied upon the data thus set forth in determining\nwhether a station has maintained a well-balanced pro¬\ngram structure.1\nIn metropolitan areas where the listener has his choice\nof several stations, balanced service to listeners can be\nachieved either by means of a balanced program struc¬\nture for each station or by means of a number of com¬\nparatively specialized stations which, considered together,\noffer a balanced service to the community. In New York\nCity, a considerable degree of specialization on the part\nof particular stations has already arisen—one station\nfeaturing a preponderance of classical music, another a\npreponderance of dance music, etc. With the larger\nnumber of stations which FM will make possible, such\nspecialization may arise in other cities. To make possible\nthis development on a sound community basis, the Com¬\nmission proposes in its application forms hereafter to\nafford applicants an opportunity to state whether they\npropose a balanced program structure or special emphasis\non program service of a particular type or types.\nExperience has shown that in general advertisers prefer\nto sponsor programs of news and entertainment. There\nare exceptions; but they do not alter the fact that if\ndecisions today were left solely or predominantly to\nadvertisers, news and entertainment would occupy sub¬\nstantially all of the time. The concept of a well-rounded\nstructure can obviously not be maintained if the decision\nis left wholly or preponderantly in the hands of advertisers\nin search of a market, each concerned with his particular\nhalf hour, rather than in the hands of stations and net¬\nworks responsible under the statute for overall program\nbalance in the public interest.\nA device by which some networks and stations are\nseeking to prevent program imbalance is the “package”\nprogram, selected, written, casted and produced by the\nnetwork or station itself, and sold to the advertiser as a\nready-built package, with the time specified by the station\nor network. In order to get a particular period of time,\nthe advertiser must take the package program which\noccupies that period. This practice, still far from gen¬\neral, appears to be a step in the direction of returning\ncontrol of programs to those licensed to operate in the\npublic interest. The commercial “package” program is\nnot a substitute for the sustaining program, however, for\nreasons set forth in subsections (2) through (5) of this\nsection.\n1 The question asked on renewal in recent years is as follows:\n“State the average percentage of time per month (combined total should\nequal 100%) devoted to-\n“Commercial Programs\n“1. Entertainment\n2. Educational\n3. Religious\n4. Agricultural\n5. Civic (include in this item\nfraternal, Chamber of Commerce,\ncharitable, and other civic but\nnon-governmental programs)\n6. Governmental (include in this\nitem all municipal, state, and\nfederal programs, including po¬\nlitical or controversial broad¬\ncasts by public officials, or can¬\ndidates for public office, and re¬\ngardless of whether or not the\nprograms included under this\nitem are entertainment, educa¬\ntional, agricultural, etc., in\ncharacter)\n7. News\n8. -\n9. Total”\n“Sustaining Programs\n“1. Entertainment\n2. Educational\n3. Religious\n4. Agricultural\n5. Civic (include in this item\nfraternal, Chamber of Commerce,\ncharitable, and other civic but\nnon-governmental programs)\n6. Governmental (include in this\nitem all municipal, state and\nfederal programs, including po¬\nlitical or controversial broad¬\ncasts by public officials, or candi¬\ndates for public office, and re¬\ngardless of whether or not the\nprograms included under this\nitem are entertainment, educa¬\ntional, agricultural, etc., in\ncharacter)\n7. News\n9. Total”\nWhat happens when the balance-wheel function of the\nsustaining program is neglected can be illustrated by the\ncase of the “soap opera,” defined as “a continuing serial\nin dramatic form, in which an understanding of today’s\nepisode is dependent upon previous listening.”\nIn January 1940, the four networks provided listeners\nwith 59% daytime hours of sponsored programs weekly.\nOf these, 55 hours were devoted to soap operas. Only\n4y2 sponsored daytime hours a week on the jour networks\nwere devoted to any other type of program. Advertisers,\nin short, were permitted to destroy overall program bal¬\nance by concentration on one type of program. The\nnumber of soap operas subsequently increased, reaching\nin April 1941 a total of some 50 commercially sponsored\nnetwork soap operas a day.2 3 4 5 6 7 Since then, there has been\nsome decline, and the introduction of some sustaining\nprograms in daytime hours has begun to modify the\npicture.\nThe extent of program imbalance still prevalent is\nindicated by the fact that in September 1945 the National\nBroadcasting Company was still devoting 4}£ hours per\nday, Monday through Friday, to 19 soap operas, and the\nColumbia Broadcasting System was similarly devoting\n4% hours daily, Monday through Friday, to 17 such\nprograms.\nThe following table presents data concerning soap\noperas during the period December 1944-April 1945.28\nColumn 1 shows the “rating” of the 19 soap operas\nbroadcast by NBC and the 17 broadcast by CBS—that\nis, the percentage of telephone homes in 32 large cities\nwhere a respondent stated that the radio was tuned to\nthe program in question or the station carrying the pro¬\ngram. Column 2 shows the size of the available audience\nas determined by the same telephone calls—that is, the\npercentage of telephone homes in which someone was at\nhome and awake to answer the telephone. Column 3,\nwhich is the “resultant” of columns 1 and 2, thus shows\nthe recruiting power of the program—that is, the per¬\ncentage of the available audience actually tuned to each\nsoap opera. It will be noted that the most popular soap\nopera on the air during the period in question recruited\n12.5 percent of the available audience. The average\nNBC soap opera recruited 8.4 percent of the available\naudience, and the average CBS soap opera recruited 6.7\npercent of the available audience. In contrast, approxi¬\nmately 76.8 percent of the available audience answering\nthe telephone during the soap opera hours reported that\nthey had their radios turned off altogether.\nNBC Soap Operas\nPro¬\nAvail- Recruit-\ngram\nable\nmg\nRa¬\nAudi¬\nEffici¬\nting\nence\nency\nMon.-\n-Fri. 10:15 a.m. Lora Lawton.\n3.3\n75.3\n4.4\n“\n“\n10:30 a.m. Road of Life.\n3.0\n75.4\n4.0\n“\n“\n10:45 a.m. Joyce Jordan.\n3.0\n73.6\n4.1\n“\n“\n11:45 a.m. David Harum.\n2.9\n72.2\n4.0\n“\n“\n2:00 p.m. Guiding Light.\n2:15 p.m. Today’s Children.. .\n5.5\n68.2\n8.1\n“\n“\n6.0\n67.1\n8.9\n“\n“\n2:30 p.m. Woman in White. . .\n5.6\n66.0\n8.5\n“\n“\n3:00 p.m. A Woman of Amer¬\nica.\n4.6\n66.1\n7.0\n“\n“\n3:15 p.m. Oxydol’s Own Ma\nPerkins.\n6.1\n66.2\n9.2\n2 C. E. Hooper, Inc., “Year End Review of 1943 Daytime Radio Listening.”\n2a See Fortune, March 1946, p. 119, “Soap Opera.”\n[13]"
}