{
  "id": "d1429-38",
  "text": "field, including those pioneered by the armed forces and\nthe introduction of wire recorders, suggest a significant\nrole for such programs in the future.\n(e) Portable recorders make it possible to present to\nthe listener the event as it occurs rather than a sub¬\nsequent re-creation of it. The recording of actual press\nconferences, for example, and the actual battlefront\nrecordings by the Marine Corps and Army Signal Corps\npoint the way to an expansion of recording techniques\nas a means of radio reporting.\nIn January, 1945, approximately 32.3% of all the time\nof standard broadcast stations was devoted to transcrip¬\ntions and recordings.\nWire Programs. The wire service, by which spot news\nand sometimes also other program texts are telegraphi¬\ncally distributed to stations, has in recent years assumed\na role of increasing importance.2 By means of wire\nservice for news and other texts of a timely nature, plus\ntranscriptions for programs of less urgent timeliness, the\nunaffiliated station can very nearly achieve the breadth of\nservice attained through network affiliation. No statis¬\ntics are currently available concerning the proportion of\ntime devoted to wire service programs.\nLocal Live Programs. There remains for discussion\nthe local live program, for which also, no precise statis¬\ntics are available. It is known, however, that in January,\n1945, approximately 19.7% of all the time of standard\nbroadcast stations was devoted to local live and wire\nservice programs; and that during the best listening hours\nfrom 6 to 11 p.m., approximately 15.7% of all the time\nwas devoted to these two classes of programs combined.\n.In granting and renewing licenses, the Commission has\ngiven repeated and explicit recognition to the need for\nadequate reflection in programs of local interests, ac¬\ntivities and talent. Assurances by the applicant that\n“local talent will be available”; that there will be “a\nreasonable portion of time for programs which include\nreligious, educational, and civic matters”; that “time\nwill be devoted to local news at frequent intervals, to\nmarket reports, agricultural topics and to various civic\nand political activities that occur in the city” have con¬\ntributed to favorable decision on many applications. As\nthe Commission noted in its Supplemental Report on\nChain Broadcasting (1941):\n“It has been the consistent intention of the Com¬\nmission to assure that an adequate amount of time\nduring the good listening hours shall be made avail¬\nable to meet the needs of the community in terms of\npublic expression and of local interest. If these reg¬\nulations do not accomplish this objective, the subject\nwill be given further consideration.” (Emphasis sup¬\nplied.)\nThe networks themselves have recognized the im¬\nportance of local live programs. Under date of October\n9, 1944, the National Broadcasting Company, when re¬\nquesting the Commission to amend Chain Broadcast¬\ning Regulation 3.104, stated:\n“Over the years our affiliated stations have been\nproducing highly important local programs in these\nthree open hours of the morning segment. From 8\nand FProgram°Logs1” defi“!t!on of “wire” programs, see “Uniform Definitions\na.m. to 10 a.m. N.Y.T., most of the stations have\ndeveloped variety or ‘morning clock’ programs which\nhave met popular acceptance. These periods are not\nonly profitable to the individual station but are sought\nfor use by civic, patriotic and religious groups for\nspecial appeals because of their local listening audi¬\nence appeal. Likewise, from 12 noon to 1 p.m. they\nhave developed highly important news farm programs\nor other local interest shows. To interfere with local\nprogram schedules of many years' standing would\ndeprive our stations of their full opportunity to render\na desirable local public service.” (Emphasis supplied.)\nThe Commission’s reply, released December 20, 1944\nas Mimeograph No. 79574, stated in part:\n“One purpose of Regulation 3.104 was to leave 14\nof the 35 evening hours in each week free of network\noption, in order to foster the development of local\nprograms.8 * * * The Commission * * * concurs\nfully in your statement that interference with local\nprograms which have met with public acceptance and\nwhich are sought for use by local civic, patriotic and\nreligious groups, local church services, and other\nhighly important local program schedules of years’\nstanding is to be avoided.” (Emphasis supplied.)\nThe courts have also supported the position taken by\nthe Commission that the interests of the whole listen¬\ning public require that provision be made for local pro¬\ngram service. Where the record showed that of the two\nstations already functioning in an area, one carried 50\npercent network programs and the other 85 percent, the\ncourt stated: “In view of this situation it is not difficult\nto see why the Commission decided that public interest\nwould be served by the construction of a local non-net¬\nwork station.” 4\nBut the soundness of a local program policy does not\nrest solely on the consistent Commission policy of en¬\ncouraging a reasonable proportion of local programs\nas part of a well-balanced program service. Three ex¬\namples will serve to suggest that local programming\nmay also be good business policy and may contribute to\nthe popularity of the station. These examples were noted\nby Professor C. H. Sandage of the Harvard School of\nBusiness Administration, during a survey of radio ad¬\nvertising possibilities for retailers financed by the Colum¬\nbia Broadcasting System.\n(a) One 250-watt station located in the Middle West\nhad struggled along for 4 years and lost money each year\nuntil a reorganization was forced in 1942. “The former\nmanagement had attempted to compete directly with\noutside stations whose signals were strong in the local\ncommunity. Good entertainment was provided, but no\nattempt was made to establish the station as a local\ninstitution interested in the life of the community.\n* The failure of Regulation 3.104 to achieve this purpose is illustrated\nby the eight charts following page 23, showing many stations which carried\nno non-network programs whatever during the evening hours on the two days\nanalvzpn\nn.\\Great Western Broadcasting Association. Inc. v. F. C. C„ 94 Fed. (2d);\n244, 248. In the KHMO case, the court, ordered the Commission to issue\na license to an applicant for a local station in an area where three stations\nwere already operating, none of which gave genuine local service. The court\nexpressed approval of the Commission’s findings in similar cases, that\nunder the direct provisions of the statute the rights of the citizens to enjoy\nlocal broadcasting privileges were being denied.’' (Courier Post Broadcasting\nCo. v. F. C. C.. 104 F (2) 213, 218) (Emphasis supplied).\n[37]"
}