{
  "id": "d1429-4",
  "text": "THE SECRETARY’S PAGE\nRadio City\nNew York, N.Y.\nFrom way up here it looks as if, for a great many reasons, there will be plenty\nof activity on the FM front in the year ahead. There are many reasons, but it seems\nto me the three most important are;\n1. The continuous issuance of FM grants by the Commission ... the continuous\nencouragement to FM by the Commission ... and the fact that the Commission is adher¬\ning to its hearing schedule although the manufacturers didn’t live up t'O their\nproduction schedule.\n2. The forthright speech of Chairman Charles Denny at the recent NAB convention\nwhich left no room for doubt in the minds of anyone that the interest in FM is not\nlimited to just one or a few Commissioners, but it is the unanimous opiniopi of all\nthe Commissioners. Many an eyebrow lifted when he said, ^\n\"The Commission has expressly authorized me to say to you again\nthat it is our opinion that FL'I is the finest aural broadcast\nsystem attainable in the present state of the radio art. FM is\nnot coming; it’s here. And it is growing fast. Already there\nare 66 stations in operation and 564 more authorized (counting\nboth construction permits and conditional grants). In addition,\nthere are 307 applications pending. Our long-range plans for FM.\nlook forward to the day when every square inch of every state from\nthe Atlantic Ocean west to the middle of the Dakotas, Nebraska,\nKansas, Oklahoma and Texas will be covered - night and day - with\nsatisfactory FT.': signals. Similarly, FM signals solidly will\nblanket the Pacific Coast states. The area in between these two\nsections is what is now the poorest served portion of our country.\nFM will serve large parts of it but cannot reasonably be expected\nto serve it all. Here our long-range plans look for a revamped\nAM service to fill in t'he gaps.\"\n3. The non-production of receivers was the real stumbling block to FM audience\ndevelopment; but I have a hunch the solid front of manufacturers has been cracked.\nA great many small manufacturers and sub-contractors would have switched to AM-FM\nin recent months, were it not for the pressure by big manufacturers to hold to their\nproduction schedule of cheap AM sets. The margin of profit v/as greater and by just\nholding the line, of course no risk was involved. But the bottom has been hit. I\npredict that many a retailer will have plenty of inexpensive sets left on his shelves\nafter the holidays, and when that happens the big fellows will be forced to change\ntheir production schedules and bring out something new. A popular-priced AM-FM set,\nwhile higher than the low-priced AM set, will nevertheless be less expensive than\ntelevision or good radio-phonograph combinations, , . « r ./?—\nOur job then is clear. Every station ought to increase its FM schedule\nand improve the program service. Chairman Denny hit the nail on the head—\n\"In a sentence, the way to get FM moving still faster is for you\nto get stations on the air and -the public will demand receivers,\nI know it’s hard to convince yourself that you should spend money\nto put on a program that nobody can hear. But it’s even harder\nto convince the public that it should buy sets when there is\nnothing to listen to. It’s your next move. Give this new superior\nbroadcast service to the people as soon as possible.\"\nIt’s our next move -\nIt’s our great chance.\nMorris S. Novik\nExecutive Secretary"
}