{
  "id": "d1429-40",
  "text": "exclusively for non-network broadcasting, and that the\nCommission regulations prohibit the carrying of network\nprograms by stations so licensed. This proposal appears\nimpracticable. In communities where the number of\nstations does not exceed the number of networks, the\nresult would be to deprive listeners of regular network\nservice from one or more of the networks. In communi¬\nties where the number of stations exceeds the number\nof networks, moreover, the regulation would be of little\npractical value since in such communities one or more\nof the stations will remain without a network affiliation\nin any event. The solution to network monopolization\nof a station’s time, accordingly, must be found in terms\nof a balance of network and non-network programs,\nrather than in a distinction between network and non¬\nnetwork stations.\nThe most immediately profitable way to run a station,\nmay be to procure a network affiliation, plug into the\nnetwork line in the morning, and broadcast network pro¬\ngrams throughout the day—interrupting the network out¬\nput only to insert commercial spot announcements, and\nto substitute spot announcements and phonograph rec¬\nords for outstanding network sustaining programs. The\nrecord on renewal since April, 1945, of standard broad¬\ncast stations shows that some stations are approaching\nperilously close to this extreme. Indeed, it is difficult to\nsee how some stations can do otherwise with the mini¬\nmal staffs currently employed in programming.\nFor every three writers employed by 834 broadcast\nstations in October, 1944, there were four salesmen\nemployed. For every dollar paid to the average writer,\nthe average salesman was paid $2.39. And in terms of\ntotal compensation paid to writers and salesmen, the\nstations paid $3.30 for salesmen for every $1.00 paid\nfor writers. The comparable relationship for 415 local\nstations is even more unbalanced.8\nThe average local station employed less than y3 of a\nfull time musician and less than % of a full time actor.9\nSuch figures suggest, particularly at the local station\nlevel, that few stations are staffed adequately to meet\ntheir responsibilities in serving the community. A posi¬\ntive responsibility rests upon local stations to make arti¬\nculate the voice of the community. Unless time is ear¬\nmarked for such a purpose, unless talent is positively\nsought and given at least some degree of expert assistance,\nradio stations have abdicated their local responsibilities\nand have become mere common carriers of program ma¬\nterial piped in from outside the community.\nC. DISCUSSION OF PUBLIC ISSUES\nAmerican broadcasters have always recognized that\nbroadcasting is not merely a means of entertainment,\nbut also an unequaled medium for the dissemination of\nnews, information, and opinion, and for the discussion\nof public issues. Radio’s role in broadcasting the election\nreturns of November 1920 is one of which broadcasters\nare justly proud; and during the quarter of a century\nwhich has since elapsed, broadcasting has continued to\n8 In the week of October IS, 1944, 834 stations employed 863 writers at\nan average compensation of $40.14, totalling $34,641; and 1195 salesmen at\nan average compensation of $95.92, totalling $114,624. The 415 local sta¬\ntions employed 259 writers full time at an average salary of $31.87 but\nemployed 409 salesmen at an average of $68.85.,\n9 Many or most stations are financially able |b employ fair larger program\nstaffs than at present. See Tart IV, pp, 47-54. :\ninclude news, information, opinion and public discussion\nin its regular budget of program material.\nEspecially in recent years, such information programs\nas news and news commentaries have achieved a popu¬\nlarity exceeding the popularity of any other single type\nof program. The war, of course, tremendously increased\nlistener interest in such programs; but if broadcasters\nface the crucial problems of the post-war era with skill,\nfairness, and courage, there is no reason why broadcasting\ncannot play as important a role in our democracy here¬\nafter as it has achieved during the war years.\nThe use of broadcasting as an instrument for the dis¬\nsemination of news, ideas, and opinions raises a multitude\nof problems of a complex and sometimes delicate nature,\nwhich do not arise in connection with purely entertain¬\nment programs. A few such problems may be briefly\nnoted, without any attempt to present an exhaustive list:\n(1) Shall time for the presentation of one point of\nview on a public issue be sold, or shall all such presenta¬\ntions of points of view be on sustaining time only?\n(2) If presentations of points of view are to be limited\nonly to sustaining time, what measures can be taken to\ninsure that adequate sustaining time during good listening\nhours is made available for such presentations, and that\nsuch time is equitably distributed?\n(3) If time is also on occasion to be sold for presenta¬\ntion of a point of view, what precautions are necessary\nto insure that the most time shall not gravitate to the\nside prepared to spend the most money?\n(4) Are forums, town meetings, and round-table type\nbroadcasts, in which two or more points of view are aired\ntogether, intrinsically superior to the separate presenta¬\ntion of points of view at various times?\n(5) Should such programs be sponsored?\n(6) What measures will insure that such programs be\nindeed fair and well-balanced among opposing points\nof view?\n(7) Should locally originated discussion programs,\nin which residents of a community can themselves discuss\nissues of local, national, or international importance be\nencouraged, and if so, how?\n(8) How can an unbiased presentation of the news be\nachieved?\n(9) Should news be sponsored, and if so, to what\nextent should the advertiser influence or control the\npresentation of the news?\n(10) How and by whom should commentators be\nselected?\n(11) Should commentators be forbidden, permitted,\nor encouraged to express their own personal opinions?\n(12) Is a denial of free speech involved when a com¬\nmentator is discharged or his program discontinued\nbecause something which he has said has offended (a)\nthe advertiser, (b) the station, (c) a minority of his\nlisteners, or (d) a majority of his listeners?\n(13) What provisions, over and above Section 315 of\nthe Communications Act of 193410, are necessary or\n10 “Sec. 315. If any licensee shall permit any person who is a legally\nqualified candidate for any public office to use a broadcasting station, he\nshall afford equal opportunities to all other such candidates for that office in\nthe use of such broadcasting station, and the Commission shall make rules\nand regulations to carry this provision into effect; Provided, That such\nlicensee shall have no power of censorship over the material broadcast under\nthe .provisions of this section. No obligationis hereby imposed upon any\nlicensee to allow the use of it? station by any such candidate.”\n[39]"
}