{
  "id": "d1429-46",
  "text": "(e) The middle commercial. The Radio Council of\nGreater Cleveland, composed of representatives of 112\norganizations having a total membership of 155,000, con¬\nducted a questionnaire survey in 1945 with respect to\nthe “middle commercial” and related problems. The\nstudy, while perhaps subject to considerable sampling\nerror, nevertheless indicates roughly the extent of listener\ndissatisfaction. More than 95 percent of those respond¬\ning stated that they preferred commercials only at the\nbeginning and end.\nCanadian regulations prohibit the middle commercial\non newscasts altogether. Canadian Regulation 13(2),\nadopted November 17, 1941, provides in part:\n“The only announcement of sponsorship for news\n* * * shall be two in number, one at the beginning\nand one at the end, and shall be as follows:\n“ ‘Through the courtesy of (name and business of\nsponsor) Station — presents (presented) the news of\nthe day furnished by (name of news service)’.”\nThe Association of Radio News Analysts, a group\nwhose own livelihood depends upon commercial news¬\ncasts, has been among those who believe the middle com¬\nmercial to be an unhealthy growth. Article IV of the\nARNA Code of Ethics states:\n“The association deplores the interruption of a news\nanalysis by commercial announcements.”\nMany members of the ARNA, which includes outstand¬\ning news analysts and commentators throughout the\ncountry, refuse to appear on a program which is inter¬\nrupted by a middle commercial. Raymond Swing, in a\ntelegram to the St. Louis Post-Dispatch published Feb¬\nruary 5, 1945, described his own experience with the\nmiddle commercial:\n“I made my own rebellion against them on May 10,\n1940, when writing my broadcast reporting German\nviolation of French, Belgian, Dutch and Luxembourg\nneutrality in launching the Western offensive. It\nseemed hideous to have this account interrupted by a\nsales talk, and I balked.\n“To the credit of Mutual officials, for whom I was\nthen broadcasting, and the advertising agency han¬\ndling the program, they supported my stand. Since\nthen my contracts for broadcasts on the Blue network\nhave specified that my program not be interrupted by\nmiddle commercials.\n“Listeners are entitled to hear the news without\njarring interruptions, and I feel confident it is sound\nadvertising policy to recognize the right.”\nDespite the successful revolt of Mr. Swing and some\nothers, it should be noted that as late as Friday, July 6,\n1945, recording of broadcasts on the six Washington\nstations showed some news and analysis programs being\ninterrupted by commercials on all four networks and all\nsix stations.\nThe St. Louis Post-Dispatch has carried on for some\nmonths a concerted campaign against the middle com¬\nmercial in newscasts, and has been followed by news¬\npapers throughout the country. Leaders in the campaign\nhave been other newspapers which, like the Post-Dis¬\npatch, are themselves the licensees of standard broadcast\nstations.\nJudge Justin Miller, then of the United States Circuit\nCourt of Appeals and now president of the National As¬\nsociation of Broadcasters, commented on the middle\ncommercial and the Post-Dispatch campaign in a letter\nto the editor published April 20, 1945:\n“I have just read in Broadcasting a reprint of your\neditorial of April 10, ‘In the Interest of Radio.’ Let\nme add my voice to that of others who have com¬\nmended you for the position which you have taken.\n“There is no more reason why a newscast should be\ninterrupted for a plug-ugly than that such ads should\nbe inserted in the middle of news stories or editorials\nin a newspaper; especially when the interruption—\ndeliberately or unconsciously, whichever it may be—\nis in nauseating contrast to the subject under discussion\nby the commentator.\n“It is particularly encouraging that this insistence\nupon higher professional standards should come from\na newspaper—a representative of the profession which\nhas most intelligently through the years defended the\nguarantees of the first amendment. Only by intelli¬\ngent anticipation of public reaction and by equally\nintelligent self-discipline can we prevent legislative\nintemperance.”\nWhile many stations and some sponsors deleted the\nmiddle commercial on newscasts following the Post-Dis¬\npatch campaign, others adopted measures which fall short\nof elimination. One network, for example, divides 15\nminutes of news and comment into a 10-minute program\nfor one sponsor and a 5-minute program for another—\nwith a station-break announcement between. The result\nis to move the middle commercial from the precise mid¬\npoint to the two-thirds point of the quarter-hour—and\nto subject the listener to two or even three interrupting\nimpacts. Another network claims to have eliminated the\nmiddle commercial, but actually it requires that commer¬\ncials be limited to the first two and the last three minutes\nof the 15-minute period—as a result of which the news is\ninterrupted twice instead of once. It is clear that such\ndevices, while they eliminate the commercial at the\nexact middle, fail to meet the chief listener complaint—\nwhich is that the news is interrupted. Some sponsors,\nin contrast, have made a sound asset of actual elimination\nof the middle commercial; their opening announcement\nends with some such phrase as: “We bring you now the\nnews—uninterrupted” It may well be that such em¬\nphasis upon the essentials of good programming, made\nexplicit to listeners by appropriate announcement over\nthe air, will do much to eliminate inferior procedures\nindulged in by other networks, stations, or sponsors.\n(f) The patriotic appeal. Patriotism, especially in\ntime of war, is an emotion near the forefront of the\nminds of most listeners. To misuse the listener’s deep¬\nest patriotic feelings for the sale of commercial products\nover the air is a violation of a public trust. It is well\nestablished that the American flag shall not be used in\nvisual advertising; 7 and the aural symbols of our na¬\ntional life should be similarly immune from commer¬\ncialization. An example of the patriotic appeal to buy\n7 Public Law 623, approved June 22, 1942, provides: “The flag should\nnever be used for advertising purposes in any manner whatsoever.”\n[45]"
}