{
  "id": "d1429-49",
  "text": "identical with the expenditures for radio by all adver¬\ntisers. Part of the total time sold on radio is handled\nby agents and brokers who customarily receive a 15 per¬\ncent fee for their services. These commissions are de¬\nducted from total time sales and are not included in total\nbroadcast revenues. However, for purposes of com¬\nparison, gross broadcast revenues before deduction of\ncommissions on time sales are shown at the right, and the\ncommissions are listed separately in Table 10.\nTable 1 shows broadcast revenues, expenses and in¬\ncome of all networks and stations from 1937 to 1944.\nIt will be noted that during the 8-year period revenues\nincreased from $114 million to $275 million; expenses\nfrom $92 million to $185 million; and broadcast income\nfrom approximately $23 million to $90 million.\nBroadcast revenues in Table 1 are defined as time\nsales less commissions plus incidental broadcast revenues\nto maintain consistency with “Statistics of the Communi¬\ncations Industry in the United States.” Gross broad¬\ncast revenues before the deduction of commissions on\ntime sales are given below:\nGross Broadcast Revenues\nYear (before deduction of com¬\nmissions on time sales).\n1944.\n1943,\n1942\n1941,\n1940\n1939\n1938\n1937\n316,601,826\n247,715,785\n205,343,606\n194,281,378\n168,005,735\n141,287,278\n127,845,578\n131,205,866\nTABLE 1\nBroadcast revenues, expenses,\nand income of all networks and stations 1937-1944\nYear\nBroadcast\nrevenues\n(dollars)\nBroadcast\nexpenses\n(dollars)\nBroadcast\nincome\n(dollars)\nRatio of expenses\nto revenues\n(percent)\nRatio of income\nto revenues\n(percent)\n1944.\n. 275,298,611\n185,025,760\n90,272,851\n67.2\n32.8\n1943.\n. 215,317,774\n148,842,188\n66,475,586\n69.1\n30.9\n1942.\n. 178,839,499\n134,207,261\n44,632,238\n75.0\n25.0\n1941.\n. 168,779,432\n123,940,406\n44,839,026\n73.4\n26.6\n1940.\n. 147,146,717\n113,850,009\n33,296,708\n77.4\n22.6\n1939.\n. 123,881,864\n100,043,920\n23,837,944\n80.8\n19.2\n1938.\n. 111,358,378\n92,503,594\n18,854,784\n83.1\n16.9\n1937.\n. 114,222,906\n91,656,311\n22,566,595\n80.2\n19.8\nNote: Total broadcast revenues equals time sales less commissions plus incidental broadcast revenues.\nSource: Annual financial reports of networks and licensees of broadcast stations.\nTable 2 shows the trend, from 1937 to 1944 of broad¬\ncast expenses and broadcast income expressed as ratios to\nbroadcast revenues. It will be noted, for example, that\nin 1937 the networks and stations spent 80 cents out of\nevery revenue dollar in serving the public, and in 1938\nthey spent 83 cents out of each revenue dollar. There¬\nafter, the proportion progressively declined, until in 1944\nstations and networks were spending only 67 cents out\nof each revenue dollar in serving the public.\nConversely, in 1937, the stations and networks re¬\ntained 20 cents out of each revenue dollar as broadcast\nincome (profit after all expenses, including depreciation\ncharges, but before Federal income tax). By 1944, the\nproportion of each revenue dollar retained as broadcast\nincome had increased to 33 cents.\nTable 2 is significant in showing that the tremendous\nincrease in profits from 1937 to 1944 (from $23 million\nto $90 million) was not due solely to the increase in\nadvertising revenues but is also attributable in consid¬\nerable part to the fact that the industry has progressively\nretained a larger and larger proportion of each revenue\ndollar as profit and has spent a smaller and smaller pro¬\nportion for serving the public.\nTABLE 2\nDistribution of gross broadcast revenue dollar of all networks and radio stations _\n1944 1943 1942 1941 1940 1939 1938 1937\nTotal broadcast revenue dollar (after deduct¬\ning commissions)..\nTotal broadcast expenses...\nBroadcast income (before Federal income\ntax).\n1.00\n1.00\n1.00\n1.00\n1.00\n1.00\n1.00\n1.00\n.67\n.69\n.75\n.73\n.77\n.81\n.83\n.80\n.33\n.31\n.25\n.27\n.23\n.19\n.17\n.20\nSource: Annual financial reports of networks and licensees of broadcast stations.\nExplanatory Note:\nTotal broadcast revenues equals time sales less commissions plus incidental broadcast revenues.\nTable 3 shows similar data for the major networks and\ntheir key stations.1 It will be noted, for example, that\nin 1937 the networks spent 81 cents out of every revenue\ndollar and retained 19 cents as profit subject to Federal\n1 Key stations are those owned and operated stations of the major networks\nwhich serve as the originating points for most of the network programs.\nThroughout this section, data for the networks include the operations of key\nstations due to the fact that an adequate segregation of expenses between\nnetwork operation and local station operation is not made in the annual\nfinancial reports for these stations. In 1944 there were 10 such stations; in\n1943 and prior years there were 9.\nincome tax; while in 1944, they spent 74 cents and re¬\ntained 26 cents.\nTable 3 also shows the breakdown of total broad¬\ncast expenses. It will be noted that the proportion of\neach revenue dollar devoted to technical, program, and\ngeneral administrative expenses all declined between 1938\nand 1944. The only increase was a 25 percent increase\nin the proportion of the revenue dollar devoted to sales\nexpenses.\n[48]"
}