{
  "id": "d1429-58",
  "text": "A wire program (W) is any program the text of which\nis distributed to a number of stations by telegraph, tele¬\ntype, or similar means, and read in whole or in part by\na local announcer. Programs distributed by the wire news\nservices are “wire” programs. A news program which is\npart wire and in part of local non-syndicated origin is\nclassified as “wire” if more than half of the program is\nusually devoted to the reading verbatim of the syndicated\nwire text, but is classified as “live” if more than half is\nusually devoted to local news or comment.\n(The above is a new program category. Programs in\nthis category resemble network and transcribed programs\nin the respect that they are syndicated to scores or hun¬\ndreds of stations. They resemble local live programs only\nin the respect that the words are vocalized by a local\nvoice; the text is not local but syndicated. Such pro¬\ngrams have an important role in broadcasting, especially\nin the dissemination of news. With respect to stations\nnot affiliated with a network, the wire program for timely\nmatter, plus the transcription for less urgent broadcasts\naffords a close approach to the services of a regular net¬\nwork. The only difficulty is that with respect to pro¬\ngram classifications heretofore, the wire program has been\nmerged with the local live program, which it resembles\nonly superficially, preventing a statistical analysis of\neither. By establishing definitions for “wire commercial”\nand “wire sustaining,” the Commission expects to make\npossible statistical studies with respect to such programs,\nand also to make more significant the statistical studies\nwith respect to the “local live commercial” and “local\nlive sustaining” categories.)\nA local live program (L) is any local program which\nuses live talent exclusively, whether originating in the\nstation’s studios or by remote control. Programs fur¬\nnished to a station by a network or another station, how¬\never, are not classified as “live” but as “network.” A\nprogram which uses recordings in whole or in part, except\nin a wholly incidental manner, should not be classified as\n“live” but as “recorded.” Wire programs, as defined\nabove, should likewise not be classified as “live.”\nA sustaining-public service announcement (PSA) is an\nannouncement which is not paid for by a sponsor and\nwhich is devoted to a non-profit cause—e.g., war bonds,\nRed Cross, public health, civic announcements, etc. Pro¬\nmotional, “courtesy,” participating announcements, etc.\nshould not be classified as “sustaining public service an¬\nnouncements” but as “spot announcements.” War Bond,\nRed Cross, civic and similar announcements for which\nthe station receives remuneration should not be classified\nas “sustaining public service announcements” but as “spot\nannouncements.”\nA spot announcement (SA) is any announcement which\nis neither a sustaining public service announcement (as\nabove defined) nor a station identification announcement\n(call letters and location). An announcement should be\nclassified as a “spot announcement,” whether or not the\nstation receives remuneration, unless it is devoted to a\nnonprofit cause. Sponsored time signals, sponsored\nweather announcements, etc. are spot announcements.\nUnsponsored time signals, weather announcements, etc.,\nare program matter and not classified as announcements.\nStation identification announcements should not be classi¬\nfied as either sustaining public service or spot announce¬\nments, if limited to call letters, location, and identification\nof the licensee and network.\nThe Commission further proposes to amend Regulation\n3.404 to provide in part that the program log shall con¬\ntain:\nAn entry classifying each program as “network com¬\nmercial,” (NC); “network sustaining” (NS); “re¬\ncorded commercial” (RC); “recorded sustaining”\n(RS); “wire commercial” (WC); “wire sustaining”\n(WS); “local live commercial” (LC); or “local live\nsustaining” (LS); and classifying each announcement\nas “spot announcement” (SA) or “sustaining public\nservice announcement” (PSA).\nThe adoption of uniform definitions will make possible\na fairer comparison of program representations and per¬\nformance, and better statistical analyses.\n2. Segments of the Broadcast Day\nThe Commission has always recognized, as has the\nindustry, that different segments of the broadcast day\nhave different characteristics and that different types of\nprogramming are therefore permissible. For example,\nthe NAB Code, until recently, and many stations permit a\ngreater proportion of advertising during the day than at\nnight. The Commission’s Chain Broadcasting Regula¬\ntions recognize four segments: 8 a.m.-l p.m., 1 p.m.-6\np.m., 6 p.m.-ll p.m., and all other hours. Most stations\nmake distinctions of hours in their rate cards.\nIn general, sustaining and live programs have tended\nto be crowded out of the best listening hours from 6 to\n11 p.m., and also in a degree out of the period from 8 a.m.\nto 6 p.m. At least some stations have improved the ratios\nshown in reports to the Commission, but not the service\nrendered the public, by crowding sustaining programs into\nthe hours after 11 p.m. and before dawn when listeners\nare few and sponsors fewer still. Clearly the responsibil¬\nity for public service cannot be met by broadcasting pub¬\nlic service programs only during such hours. A well-\nbalanced program structure requires balance during the\nbest listening hours.\nNetwork commercial (NC)\n8 a. m.\n6 p. m.\n6 p. m.\n11 p. m.\nAll\nother\nhours\nTotal\nNetwork sustaining (NS)\nRecorded commercial (RC)\nRecorded sustaining (RS)\nWire commercial (WC)\nWire sustaining (WS)\nLive commercial (LC)\nLive sustaining (LS)\nTotal1\nNo. of Spot Announcements (SA)\nNo. of Sustaining Public\nService Announcements (PSA)\n1 Totals should equal full operating time during each segment.\n[57]"
}