{
  "id": "d1429-59",
  "text": "Statistical convenience requires that categories be kept\nto a minimum. In general, the segments of the broadcast\nday established in the Chain Broadcasting Regulations\nappear satisfactory, except that no good purpose appears\nto be served in connection with program analysis by cal¬\nculating separately the segments from 8 a.m. to 1 p.m.\nand from 1 p.m. to 6 p.m. Accordingly, for present pur¬\nposes it is proposed to merge these segments, so that the\nbroadcast day will be composed of three segments only:\n8 a.m.-6 p.m., 6 p.m.-ll p.m., and all other hours.\nThe categories set forth above, plus the segments herein\ndefined, make possible a standard program log analysis\nas in the form shown on page 57.\nThe above schedule will be uniformly utilized in Com¬\nmission application forms and annual report forms in lieu\nof the various types of schedules now prevailing. In using\nit, stations may calculate the length of programs to the\nnearest five minutes.\n(3) Annual Reports and Statistics\nFor some years, the Commission has called for a state¬\nment of the number of hours devoted to various classes of\nprograms each year, in connection with the Annual Finan¬\ncial Reports of broadcast stations and networks. Requir¬\ning such figures for an entire year may constitute a con¬\nsiderable accounting burden on the stations, and. may\ntherefore impair the quality of the reports. Accordingly,\nthe Commission proposes hereafter to require these data\nin the Annual Financial Reports only for one week.\nTo make the proposed week as representative as pos¬\nsible of the year as a whole, the Commission will utilize\na procedure heretofore sometimes used by stations in\npresentations to the Commission. At the end of each\nyear, it will select at random a Monday in January or\nFebruary, a Tuesday in March, a Wednesday in April,\na Thursday in May or June, a Friday in July or August,\na Saturday in September or October, and a Sunday in\nNovember or December, and will ask for detailed pro¬\ngram analyses for these seven days. The particular days\nchosen will vary from year to year, and will be drawn so\nas to avoid holidays and other atypical occasions.\nThe information requested will be in terms of the defini¬\ntions and time periods set forth above. Statistical sum¬\nmaries and trends will be published annually.\nThe Commission will also call upon the networks for\nquarterly statements of the stations carrying and failing\nto carry network sustaining programs during a sample\nweek in each quarter.\n(4) Revision of Application Forms\nSince the establishment of the Federal Radio Commis¬\nsion, applicants for new stations have been required to\nset forth their program plans, and applications have been\ngranted in part on the basis of representations concerning\nprogram plans. Applications for renewal of license, as¬\nsignment of license, transfer of control of licensee corpora¬\ntion, and modification of license have similarly included,\nin various forms, representations concerning program serv¬\nice rendered or to be rendered. The program service ques¬\ntions now asked on the Commission’s application forms\nare not uniform, and not closely integrated with current\nCommission policy respecting program service. It is pro¬\nposed, accordingly, to revise the program service questions\non all Commission forms to bring them into line with the\npolicies set forth in this report.\nSpecifically, applicants for new stations will be required\nto fill out, as part of Form 301 or Form 319, a showing\nof their proposed program structure, utilizing the uniform\nschedule set forth on page 57. Applicants for renewal\nof license, consent to transfer of assignment, and modifica¬\ntion of license will be required to fill out the same uniform\nschedule, both for a sample week under their previous\nlicenses, and as an indication of their proposed operation\nif the application in question is granted.\nThe Commission, of course, recognizes that there is\nneed for flexibility in broadcast operation. An applica¬\ntion to the Commission should not be a straitjacket pre¬\nventing a licensee from rendering an even better service\nthan originally proposed. To provide the necessary\nflexibility, the information supplied in the uniform sched¬\nule will be treated as a responsible estimate rather than\na binding pledge. However, attention should be called\nto the fact that the need for trustworthiness is at least\nas important with respect to representations concerning\nprogram service as with respect to statements concerning\nfinancial matters.\nStations will also be asked whether they propose to\nrender a well-balanced program service, or to specialize\nin programs of a particular type or addressed to a partic¬\nular audience. If their proposal is for a specialized rather\nthan a balanced program service, a showing will be re¬\nquested concerning the relative need for such service in\nthe community as compared with the need for an addi¬\ntional station affording a balanced program service. On\nrenewal, stations which have proposed a specialized serv¬\nice will be expected to show the extent to which they have\nin fact fulfilled their proposals during the period of their\nlicense.\nStations affiliated with a network will further be re¬\nquired to list network sustaining programs not carried\nduring a representative week, and the programs carried\nin place of such programs.\nIf the Commission is able to determine from an ex¬\namination of the application that a grant will serve the\npublic interest, it will grant forthwith, as heretofore. If\nthe Commission is unable to make such a determination\non the basis of the application it will, as heretofore,\ndesignate the application for hearing.\n(5) Action on Renewals\nWith the above changes in Commission forms and\nprocedures, the Commission will have available in con¬\nnection with renewal applications, specific data relevant\nto the finding of public interest required by the statute.\nFirst, it will have available all the data concerning\nengineering, legal, accounting and other matters, as here¬\ntofore.\nSecond, it will have available a responsible estimate\nof the overall program structure appropriate for the sta¬\ntion in question, as estimated by the licensee himself when\nmaking his previous application.\nThird, it will have available affirmative representations\nof the licensee concerning the time to be devoted to sus¬\ntaining programs, live programs, discussion programs, and\nadvertising matter.\nFourth, it will have available from the annual reports\nto the Commission data concerning the actual program\n[58]"
}