{
  "id": "d1207-0",
  "text": "THE ASSOCIATION OF COLLEGE AND UNIVERSITY BROADCASTING STATIONS\nAugust 9, 1934\nOffice of\nExecutive Secretary\nNorman, Oklahoma\nTo Members a£ the Association :\nSome weeks ago we advised you in a special bulletin of the recent developments\nfor the project of securing recordings of various federal government groups for\ncirculation among members of our organization. Since releasing this bulletin,\nwe have had letters dealing with this matter both from our members in response\nto the bulletin, and additional letters from government officials.\nIn this bulletin, we are quoting letters indicating the reactions of our various\nAssociation members relative to the project first, and following this the addi¬\ntional correspondence from various departments of the federal government, offer¬\ning their cooperation. Before going into this particular item, however, I wish\nto call your attention to the item listed below:\n! All members of the Association have received special announcements\nfrom President Joe Wright in the past few days, urging your atten- I\nj dance at the annual Association convention to be held in Kansas\nj City on September 10 and 11* Indeed, this promises to be the most J\noutstanding and important meeting our Association has held during j\nI the years of its service to member stations* It behooves each and\nI every station director to begin immediate plans to bring a large i\nj number of his co-workers to this very important conference* Presi- j\ni dent Wright has corresponded with you by bulletins giving some of j\n! the veiy important problems to come before this meeting* Every\n; member station of the Association should have one representative ' i\nj and, if possible, several additional members of its staff present*\nSome of the stations are organizing parties and as many as four\nrepresentatives from those stations will be in attendance. This\nconcerns our future * Many important items directly bearing on\nproblems involving your institution must be discussed and settled j\n! in this convention. Won't you write President Joe Wright at the\nUniversity of Illinois today stating that you will be present with\nus and also advise him how many delegates will be present from your\ninstitution. I\nLetters received from the membership since our last bulletin are as follows:\nFrom J. C. JENSEN, THE NEBRASKA WESLEYAN UNIVERSITY:\n\"Was glad to hear from you again, even though it was only through a circular\nletter, and to learn that you are still vrorking on that project of getting special\ntranscriptions of governmental and scientific material for use by the college\nbroadcasting stations. It seems to me that the following aspects of the problem\ntsust be given consideration, probably in the order named:\n\"1. Source of revenue. $5000 to $10000 per year for five years will be\nneeded, according to the scope of the work planned and whether the material is"
}