{
  "id": "d1207-2",
  "text": "3\nand establishments, such as the Civil Service Commission, Federal Trade Comission,\nAeronautical Board, and so on throughout the numerous boards and commissions, all\nof which have a story to tell, but in telling it they should ever keep in mind\nthe fact that it has gat to be humanized to the point where it’s interesting\nenough to hold the people’s attention. The Smithsonian Institute', like the\nBureau of Standards, can tell a thousand untold tales of interesting and his-*\ntorical value, but again comes the question—the way you tell them#\n\"Remember in presenting these natters to the various department heads that\nyou’ve got to tell then exactly what you want and how you want it, because they\nare not radio minded and, like all people igiorant of radio matters, have their\nlikes and dislikes and cannot steer an even keel# It should be remembered that\nradio meets all classes, as well as the: masses,\n\"Any other way I can help you in this matter, you have only to call on me#\nI am vitally interested and sincerely hope that it goes through,\"\nFrom FRANK F. NALDER, THE STATE COLLEGE OF WASHINGTON:\n\"Dean Carpenter and I have received, and read with care and interest, your\ncircular of July 20 concerning electrical transcriptions for broadcasting infor¬\nmation about the work of Government Departments# We are much interested to read\nthese responses to your suggestions#\n\"Station KWSC will gladly broadcast such transcriptions. We understand,\nof course, that the expense of preparing them will, as it undoubtedly should, be\nborne by the departments involved,\n\"Government departments and scientific institutions at Washington serve the\nAmerican people in many important ways. Under present conditions it seems likely\nthat those services my bo expanded and elaborated. Hence, there is every reason\nfor conducting a continuous process of public education concerning these depart¬\nmental services. Since this work of public education will be in the interests of\nthe departments and the citizens of the nation, the expense of preparing these\ntranscriptions and furnishing or circulating thorn among the educational broadcast¬\ning stations should logically be borne by the public through the departments\nserved.\n\"Our educational radio stations, which are entirely free from commercial\nobligations, are the right ones to broadcast this information to the public.\nFurthermore, thqy offer through electrical transcriptions, a means whereby in the\ninterest the voices and viewpoints of leading men in departmental organizations\nnay be hoard. I believe it would be a fine thing if many such tran script ions\ncould be prepared, and if their broadcasting could be featured by educational\nstations at certain unifom hours. KWSC is willing to participate in such a pro¬\ngram,\n\"We think, too-, that in each instance a mimeographed copy of the material\nrecorded on the transcription should aocompany the disc# Before putting such a\ntranscription on the air, the station should know what it is going to broadcast,\nand so be able to give suitable introduction and to fit such broadcasts intelli¬\ngently into its other program material#\n\"We hope that the departments at Washington, in response to your energetic\nefforts, may soon produce a number of highly instructive transcriptions and make\nthem available for broadcasting.\"\nFrom A, G. W00LFRIES, CHIEF AMOUNCER, WOI, IOWA STATE COLLEGE:\n\"Your mimeographed letter of July 20 arrived in Mr. Griffith’s absence.\nWhile I do not have a record of your previous correspondence on the matter of\nreaord^ngs for circulation in the association, I am sure that this station will\nbe very happy to assign the necessary time to this feature# It seems to me that\na daily fifteen or thirty minute program would be the ideal set up providing that"
}