{
  "id": "d1369-0",
  "text": "N A c 0 NEWS LETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nA0 James Ebel, Editor, Station W I L L, Urbana, III.\nMarch I, 1945\nNO TRAVEL—FARM AND HOME WEEK PROGRAMS BROADCAST INSTEAD\nFarm and Home Week is an annual institution at Iowa State College and at\nthe University of Illinois. It is traditionally a mid-winter meeting for\nTHE FARM FOL.K FOR THE PURPOSE OF DISCUSSING THE LATEST FARM INFORMATION\nAND THE CURRENT PROBLEMS OF FARMERS IN THESE STATES. The BEST TALENT\nON THE FACULTIES OF THE SCHOOLS AND NATIONALLY RECOGNIZED AUTHORITIES\nARE CALLED UPON TO PRESENT TALKS AND TO LEAD THE DISCUSSIONS. THIS YEAR\nIN FULJ COOPERATION WITH THE War MOBILIZATION D?RECTOR98 TRAVEL RESTRIC¬\nTIONS TIIESK CONFERENCES WERE PRESENTED ENTIRELY BY RADIO.\nThe MEETINGS PRACTICALLY TOOK OVER THE OPERATION OF WILL FOR THE FOUR\nDAY PERIOD OF Farm AND HOME WEEK IN ILLINOIS. GUEST SPEAKERS FROM THE\nGovernor of Illinois on down came for the broadcasts. Special enter¬\ntainment DURING THE LONG SESSIONS WAS ARRANGED FOR AND OFTEN LARGE GROUPS\nOF PARTICIPANTS INDULGED IN VERY INFORMAL DISCUSSIONS FOR THE BENEFIT OF\nTHE FARM RADIO LISTENERS.\nTHE THREE DAY MEETING IN IOWA WAS HANDLED BY WO 3 AND LISTENERS ALL OVER\nTHE STATE WERE ABLE TO TAKE ADVANTAGE OF THE SPECIAL OCCASION. All\nREPORTS INDICATE THAT THE BROADCASTS WERE VIOELY USED AND DEFINITELY\nFILLED THE GAP LEFT BY THE CANCELLATION OF THE CAMPUS MEETING.\nSIXTH ANNUAL MUSIC FESTIVAL ON ftNYC\nMusic in virtually every form, with contemporary compositions and the role\nOF MUSIC IN WARTIME UNDERSCORED, WAS HEARD IN MORE THAN 125 BROADCASTS\nfrom New York City concert halls and City Station studios during WNYC's\nSixth American Music Festival, held as in previous years during the ten-\ndays BETWEEN L|NCOLN°S AND WASHINGTON'S BIRTHDAYS.\nOnce again the threefold purpose of the Festival, as expressed by M. S.\nMqvik, Director of the Municipal Broadcasting System, was to point up\n’’the rich storehouse of our musical heritage, provide a hearing for\nNOTABLE NEW WORKS AND OFFER a SOUNDING BOARD FOR NEW TALENT.H The OB¬\nJECTIVE WAS UNDERLINED IN THE SCOPE OF THE PROGRAM SCHEDULE«\nTwenty-seven contemporary American composers had world premieres of their\nCOMPOSITIONS AND THIRTEEN HAD FIRST RADIO PERFORMANCES OF WORKS DURING\nWNYC's Sixth American Music Festival. More than thirty compositions\nWERE PCAYED FOR THE FIRST TIME DURING THE FESTIVAL JUST CONCLUDED, AND\nTWENTY-TWO MORE WERE PERFORMED ON THE AIR FOR THE FIRST TIME.\nUNIVERSITY OF KENTUCKY9 S NEW FM STATION ON A § R\nWBKY, the University of Kentucky 9s new Frequency Modulation 500 watt\nEDUCATION STATION, IS NOW ON THE AIR AFTER SEVERAL MONTHS OF CONSTRUCTION.\nWhile the programs, to be broadcast entirely during the evening hours for\nTHE PRESENT, WILL BE LARGELY OF A CULTURAL AND INFORMATIVE NATURE, AN"
}