{
  "id": "d1369-2",
  "text": "NA£8 NEWS LETTER......\nWISCONSIN STATE FM NET PROGRESS\nPage 3\n*.»March I, 1945\nThe ReLmIc n moving ahead towards a state FM radio system.\nTHE STATFTRAnLTrE Un,V£RSITV> at THEIR MEETING ON JANUARY 9 AUTHOR 1?EO\nthe State Radio Council to make application for FM facilities.\nI^L?0UNC,L ,TSELF> AFTER STUDYING THE OPPORTUNITIES PRESENTED BY FiV had\nbah oTERE:D ,TS conv,ct,on about the importance of developing the state\nradio service and of obtaining the necessary FM fac'ut?es for staL coverage.\n2™ ssz: ^T^s^^rY1* a\nnow adequately served by WHA. lakcshore area not\nOHIO STATE FM NET CHanbfs\nNot entirely satisfied with its proposed plans for a network of Ih mui'i\nDroAct M STATi0NS STRUN8 OUT CHAIN-LIKE THROUGHOUT OHIO, THE Oh 10 StaTe”\n55Jsrs ?\nNINE APPOINTED BY THE StaTE DIRECTOR OF EDUCATION*\nA.VI SIT TO MINNESOTA AND WLB\nL°‘T0R HAD A./,f42ST ENJ0YA8LE: VISIT AS THE GUEST OF EASY Z|EBARTH ANO\nERT 0LM8ERG OF ^LB, EARLY IN FEBRUARY. I RAN ACROSS VtlCH OF INTEREST\nIN THE OPERATION OF THIS STATION WHICH l*LL PASS ALONG TO^oS .\nThe earliest operation of an experimental raoio station\nof Minnesota was begun in I9l2. at a time when wireless\n1° the laboratory. Its first use at Minnesota was initi\nf* w* Springer, who, in the absence of Dr. Shepardson, »\nTHE DEPARTMENT OF ELECTRICAL ENGINEERING. PROFESSOR SpR\nRETURNED FROM BERLIN WHERE HE HAD WORKED UNDER Or, SLA8Y\nINTENDED THE INSTALLAT I ON OF THE FIRST RADIO EQUIPMENT I\nENGINEERING ButLDING, THE SHORT DISTANCE TRANSMISSION OF\nALMOST THE ONLY USE OF RADIO*\nat the University\nWAS STILL CONFINED\nated by Professor\nA,S ACTING HEAD OF\nINGER HAD JUST\n* When he super-\nn the old Electrical\nIMPULSE OR CODE WAS\nShE*uER-ME:nTAL station» 8ESUn by Professor Springer, was continued by\nMR. H. M. iURNER, AN INSTRUCTOR WHO HAS SINCE GONE TO VaLE UNIVERSITY\n\"la’ THE first actual broadcast was transmitted from the University\nWHEN FOOTBALL GAMES WCRC DESCRIBED BY WIRELESS. A SPARK TRANSMITS wis\nUSED WITH REGULAR TELEGRAPH SIGNALS. The STATION WAS DEVELOP ING^STEAD^LV\nSoa:yt^t&nfmetnhte:’orld -\"ar’ all a—\nHE BECAME AN INSTRUCTOR IN THE ELECTRICAL ENGINEERING DEPARTMENTl HE HAD\nBEEN AT THE UNIVERSITY OF WISCONSIN EXPERIMENTING WITH A NEW RAOIO TRANS-"
}