{
  "id": "d1369-5",
  "text": "NA£B NEWS LETTER\nPage 6\nMarch I, 1945\nWith the increase in broadcasting time, the staff was enlarged to include;\nMANAGER (FULL-TIME). A PROGRAM DIRECTOR IN CHARGE OF SCHEDULING ANO\nGENERAL PRODUCTION VFULL-TIME, A PROGRAM DIRECTOR IN CHARGE OF DRAMATIC\nBROADCASTS (haLF-TIMe), A PROGRAM DIRECTOR IN CHARGE OF THE SCHOOL OF THE\nAir (half-time), A PROGRAM DIRECTOR IN CHARGE OF SPORTS (oUARTER-TIME).\nIn aodition, three Administrative Fellowships have been granted to grad¬\nuate STUDENTS WHO SPEND HALF OF THEIR TIME AT WLB, WHILE THEY ARE WORKING\nFOR GRADUATE DEGREES, THESE STUDENTS HAVE BEEN CHOSEN FROM PERTINENT\nSPECIALIZED FIELDS SUCH AS MuSIC, Sp£ECH, AND ^OURNAL ISM ,\nPrograms; The programs broadcast from WLB can be classified in three\nBROAD CATEGORIES. ThERE ARE THOSE DESIGNED FOR AN EXPLICIT EDUCATIONAL\nFUNCTION, SUCH AS PROGRAMS FOR DIRECT CLASSROOM USE; THOSE OF GENERAL\nINTEREST, AND OTHERS WHICH ARE PLANNED AS ADULT EDUCATION PROGRAMS WITH\nLESS SPECIFIC APPLICATION THAN THE SCHOOL-ROOM BROADCASTS.\nAll of the broadcasting for classroom use has been done sy the School of\nthe Air, which was begun in September, 1938. At that time programs were\nPLANNED TO SUPPLEMENT WORK IN HIGH SCHOOL CLASSES IN EnGLISH AND VOCA¬\nTIONAL Guidance, junior high school Geography and History classes, grade\nschool Current Events, andReaoing *n the primary grades, a survey by\nQUESTIONNAIRE, CQNOUCTEO THROUGHOUT THE STATE AFTER THE PROGRAMS HAD\nBEEN ON THE AIR A FEW WEEKS, SHOWED THAT MORE THAN 17,000 CLASSROOM\nLISTENERS WERE MAKING USE OF THESE PROGRAMS WEEKLY. The SECOND SEMESTER\nSchool of the Air was expanoed to include programs in German, French,\nand American History. Anot*c r questionnaire was circulated with the\nfollowing results; The total number of classroom listeners each week\nas reported BY SUPERINTENDENTS and PRINCIPALS was 32,932,. 23,007 OF\nthese pupils were in non-Twin City schools. The most popular programs\nin the School of the Air curriculum were old Tales and New From Many\nLands (reading of children’s stories), which has 4,663 listeners, and\nCurrent Events (a weekly news program digested and revised for the 8-12\nAGE VOCABULARY LEVEL) WHICH HAS 4,347 REGULAR LISTENERS. The LEAST USED\nOF ALL OF THE SCHOOL OF THE A|R BROADCASTS WERE THE GERMAN AND FRENCH\nPROGRAMS WHICH HAD A RECORDED 333 LISTENERS. (NOW 135,000 A WEEK IN SCHOOLS•)\nThese programs were not meant as substitutes for subjects in the regular\nCURRICULUM, BUT WERE INTENDED AS SUPPLEMENTARY AND MOTIVATING MATERIAL©\nFrom THE START, THE SCHOOL OF THE A|r WAS CAREFULLY INTEGRATED WITH THE\nState Course of Study, and the programs were approved by the State\nDepartment of Education, and the Raoio Commutes of the Minnesota\nEducation Association,\nIn the second category of general interest is: The Bride’s Program, a\nseries of broadcasts of use to prospective brides in planning their\nWEDDINGS, TRIPS, HOMES, AND FURNISHING, The LARGE DEPARTMENT STORES,\nthe University department of Home Exonomics, and the various Twin City\nEXPERTS ON BUYING AND PLANNING APPEARED ON INFORMAL INTERVIEW FORUMS FOR\nTHIS BROADCAST, ANOTHER TYPE OF PROGRAM WHICH IS PLANNED PRIMARILY\nFOR GENERAL INTEREST INCLUDES THE VARIOUS MUSICAL PROGRAMS, 80TH RECORDED\nAND “LIVE11 , WHICH COMPRISE ALMOST 50^ OF THE STATION S BROADCASTS,\nThere are two dramatic hours a week which are not designed to fill a\nPARTICULAR EDUCATIONAL FUNCTION, On THE LONGEST OF THESE, THE KLB\nPlayhouse broadcast, most of the ©lays have been important and classical"
}