{
  "id": "d1195-10",
  "text": "SATURDAY EVENING\nRadio and Minority Groups\n8:00 p. m.. Ballroom\nChairman: Howard LeSourd, Director, Institute for Democratic Education, New\nYork City\nTopics: Do radio programs on inter-group relations do more harm than good? Are\nprograms about minorities a bore? What are the problems that must be over¬\ncome, and what are the best techniques to use in programs dealing with inter¬\ngroup relations? Has Superman’s crusade against intolerance really affected\nchildren’s attitudes? Have the Armed Forces radio programs been successful in\ncounteracting Nazi propaganda? Should accents and dialects be barred from the\nair? What can be done about employment discrimination in radio?\nParticipants\nAnne M. Cooke, Howard University, Washington, D. C.\nTed Cott, Director of Programs and Operations, Station WNEW, New York City\nI Josette Frank, Staff Adviser to Children’s Radio Committee, Child Study Association of\nAmerica, New York City\nHarold Franklin, Program Director, Institute for Democratic Education, New York City\nRobert B. Hudson, Director of Education, Columbia Broadcasting System\nGeorge Jennings, Director, Radio Council-WBEZ, Chicago Board of Education\nGeneral C. T. Lanham, Chief, Information and Education Section, War Department\nRobert K. Richards, Director of Public Relations, National Association of Broadcasters\nOccupational Opportunities in Radio\n8:00 p. m.. Room 1540\nChairman: Walter B. Emery, Attorney, Federal Communications Commission\nParticipants\nLeslie G. Arries, General Manager, Station WTTG, Washington, D. C.\nJ. N. Bailey, Executive Director, FM Association, Washington, D. C.\nArmand Hunter, Director, School of Radio, Temple University\nCarol Irwin, Producer, “Theatre Guild on the Air”\nGrace Johnsen, Manager, Continuity Acceptance Department, American Broadcasting\nCompany\nHarry Skornia, Director of Radio, University of Indiana\nPromotion of Educational and Public Service Programs\n8:00 p. m., Room 1337\nChairman: Louis M. Stark, Manager, School Service, Westinghouse Electric Cor¬\nporation, Pittsburgh\nPromotion of Informal Educational Programs. Lyman Bryson, Counsellor on Public Affairs,\nColumbia Broadcasting System\nPromotion of Programs for In-School Listening. Victoria Corey, Station KDKA, Pittsburgh\nPromotion of Music Programs. Dwight Herrick, Manager, Public Service Department, Na¬\ntional Broadcasting Company\nPromotion of Agricultural Programs. Herb Plambeck, Farm Service Director, Station WHO,\nDes Moines\nPromotion of Public Affairs Programs. Robert Saudek, Director of Public Affairs, American\nBroadcasting Company"
}