{
  "id": "d1195-13",
  "text": "SUNDAY MORNING\nNational Organizations and Radio\n9:30 a. m.. Room 1440\nChairman: Howard London, Radio Director, National Foundation for Infantile\nParalysis, New York City\nPanel Discussion: National Organizations vs. Station Program Operations\nRadio News\nProgram Arranged by National Association of Radio News Directors\n9:30 a. m.. Room 1212\nChairman: Sig Mickelson, News Director, Station WCCO, Minneapolis\nTopic: Writing and Building News Programs—A Study of the Proper Content of\nNewscasts\nBen Chatfield, News Director, Station WMAZ, Macon, Georgia\nJack Krueger, News Director, Station WTMJ, Milwaukee\nJack Shelley, News Director, Station WHO, Des Moines\nCurley Vadeboncouer, Station WSYE, Syracuse\nFM Educational Stations\n9:30 a. m.. Room 1337\nChairman: George Jennings, Director, Radio Council-WBEZ, Chicago Board of\nEducation\nParYCmn*™ N T A»mp Director, Station WDTR, and Supervisor of Radio, Detroit Board of\nWtt t iam B. IfEVENSQN. Directing Supervisor of Radio, Station WBOE, Cleveland Board of\n‘ESTucatiM.\nH B. McCartyDirector, Station WHA, University of Wisconsin\n^^SSSsCcoordinator of Programs, Station WNYE, New York City Board of\nEducation\nWilliam Sknf^r. Director, Station KUSC, University of Southern California\nRal^'!&eetle, Director, Radio Department, Louisiana State University\nRadio Production\n9:30 a. m., Hall of Mirrors\nChairman: Mitchell Grayson, Free Lance Producer, New York City\nThe Real Problems Confronting Network Producers Today. Edward A. Byron,\nDirector and Co-Author, “Mr. District Attorney”; and President, Radio Directors\nGuild, New York City\nThe Documentary Broadcast and The Use of Single Voices in Non-Dramatic Pro¬\ngrams. Robert Saudek, Producer of “World Security Workshop and Hiro¬\nshima”; and Director of Public Affairs, American Broadcasting Company\nThe Preparation of the Documentary Broadcast. Robert Lewis Shayon, Producer-\nDirector-Writer, Columbia Broadcasting System\nNew Trends in Production. Mitchell Grayson\nM"
}