{
  "id": "d1195-2",
  "text": "CONFERENCE NOTES\nRegistration Procedure. The Institute Registration desk will be located in the\nlobby of the Deshler-Wallick Hotel. Advance registrants, however, will obtain\ntheir tickets and badges at the WCOL Information Center near the registration desk.\nThe general registration fee is $5.00, which includes a copy of the proceedings,\nEducation on the Air, 1947 (separately priced at $3.50), and admission to all meet¬\nings. General registration for wives of members attending is $3.00; single-session\nregistration is $.75; and general registration for students is $1.00. These latter regis¬\ntrations admit persons to the meetings, but do not include a copy of the proceedings.\nGeneral registrants will be admitted to all meetings by badge; single-session regis¬\ntrants must present tickets. Students in high schools and colleges will be required to\npresent fee cards or other evidence of school membership when requesting student\nregistrations.\nThe Institute for Education by Radio is a cooperative conference maintained\nthrough the interest and support of its members. The Ohio State University grants\na small allotment to cover a portion of the expense, but the bulk of the cost for\nthis annual meeting and for the printing of the proceedings is supplied by con¬\nference registration fees. The Institute pays neither honoraria nor expenses for its\nspeakers, and it is the custom, in furtherance of the cooperative character of the\nmeeting, for speakers and chairmen to pay registration fees on the same basts as\nother participants.\nAnnual Institute Dinner. Tickets for the dinner, Sunday evening, May 4, if\nnot purchased in advance, may be obtained at the registration desk; the price is\n$3.50. All reservations for the dinner must be made by Sunday noon, May 4. Dress\nwill be informal.\nOfficial Conference Proceedings. Each year the proceedings of the Institute are\npublished under the title, Education on the Air. The yearbooks may be purchased\nat $3.50 a copy from Ohio State University, except the 1935 yearbook which is\navailable from the University of Chicago Press. There was no conference in 1945,\nbecause of wartime travel conditions, so no yearbook was published for that year.\nIssues for 1930, 1940 and 1941 are out of print. A reduced price for back copies\nis made when they are purchased in sets. A set of the proceedings of past years is\non display at the conference registration desk.\n•\nAll meetings are scheduled on Eastern Standard Time.\nOpen discussion on matters of radio education is one of the chief functions of\nthe Institute. Members are urged to take part freely in discussion.\n•\nThe exchange of materials among the members of the Institute has proved\nhelpful in the past. Tables will be provided outside Institute headquarters on the\nsecond floor where this material may be placed. Members are encouraged to bring\nsuch materials for distribution.\n3"
}