{
  "id": "d466-120",
  "text": "H O h ^ ® Q %\nWUOA-FM-\nv T 91.7 ON YOUR FM DIAL \" J m\n\"THE VOICE OF THE UNIVERSITY OF ALABAMA\"\nSept. 29, 1952\nEXTENSION DIVISION\nUNIVERSITY OF ALABAMA\nUNIVERSITY. ALABAMA\nBOX 2002\nR\nA\nD\nI\nO\nB\nR\nO\nA\nD\nC\nA\nS\nT\nI\nDear Si,\nYour letter of Sept. 25, saying \"-I am completely\nbehind on what has gone on.T* disturbs me a bit. On Sept. 17\nI wrote you a four page letter which I thought you'd get\nimmediately upon your return and which was designed to bring\nyou up to date. I have sent a number of carbons of other\ncorrespondence which were intended to further fill you in\non details. I*to enclosing my file copy of the letter of\nSept. 17, just in case you did not get the original. I± you\ndid get it and -didn't read it, you've not a damned thing to\nyell about so I've no remorse and-no smypathy for you.\nGlad your trip was exciting and fruitful. I shall be most\neager to get more details.\nThe \"committee\" which you asked about was the one\nI named, after conferring with every member of the board,\nto screen the list and arrive at one name to recommend to\nthe Board for the job of Executive Director. I named Burton,\nAllen, and myself to that committee for a number of reasons\nand upon the advice of most of the Board. Dunn was named\nby one member as his suggestion, but the letter to Schramm\nwas reason enough for not putting him on. Hull, Schooley,\nand Schramm were in Urbana, and Jim, so all of us worked\non the list. Wilbur and I flew to BattleCreek one after¬\nnoon for a conference with Masters and VanDuyn.\nI think Wynn is our best bet, but we need a\nconference with him. I*11 talk to Burton Monday and then\nset up the meeting in Washington on the evening of the\n16th. and the morning of the 17th. if he feels as the\nothers do that it should be held. Please keep that time\nfree on your calendar if possible.\nIf anything else comes up you need to know\nabout_concerning anything that happened while you we re\naway, please call me or write. We are supposed to be\nspecialists in communications, but our biggest problem\nseems to be failure to communicate adequately.\nBest always,\nGraydon\nMEMBER OF NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS"
}