{
  "id": "d1299-0",
  "text": "NATIONAL ASSOCIATION ON EDUCATIONAL BROADCASTERS\nNovember 22, 1948\nTOi All Active and Associate Members All Regions\nEDOM: Dick Hull, Station WOI, Ames, Iowa\nRE: Special Enclosures\nThe material accompanying this memorandum deserves a word of explanation, and\nis worthy of your study.\nENCLOSURE #1 - Address by Wayne Coy, ECC Chairman, at Indiana Radio Conference\nEvery educational broadcasters, who seeks’to understand current\nFCC thinking should study this talk thoroughly,. In our opinion\nit is Mr. Coy's effort to spell out the ECC philosophy in re\neducation and also to. put the problem squarely up to educatdrs.\nThis is more than pleasant or idealistic talk.\nIf you will read between the lines a little, you can see it\nindicates the ECC's idea ofwhat we should do—by \"we\" I mean\nnot only NAEB members, but colleges and universities in general.\nTHIS IS THE HIND OF MATERIAL YOUR - PRESIDENT SHOULD SEE AND READ.\nENCLOSURE #2 - Address by Ben.iamin Cot tone, General Counsel of the ECC at the\nannual NAEB meeting in Urbana.\nMembers and associate members will find study of the text of\nCottone1s remarks well worth the effort in determining future\npolicy and action—both with respect to EM and TV.\nTHIS IS NOT FOR GENERAL DISTRIBUTION, KEEP IT IN YOUR OFFICE.\nENCLOSURE #3 - Official minutes of the annual NAEB meeting at Urbana, Illinois\nThis material, like NAEB newsletter, comes punched for insertion\nin 3-ring notebook. Many members have found it valuable for per¬\nmanent file and ready reference to keep these reports in a heavy\n8 x 11 ringbinder notebook.\nREPORT ITEM - A committee on Television, headed by Harold McCarty, director of\nWHA, University of Wisconsin, is studying the situation as it\napplies to NAEB members, especiallymth reference to the ultra-\nhigh frequency band.\nAny member having special information or interest in this area\nis urged to report immediately to McCarty.\nAttached are two news stories re the NAEB Annual Meeting at Urt>ana«»-~One from\nBILLBOARD and one from VARIETY. They may be of interest as detached and differing\nreports of the same meeting when compared with the official NAEB minutes."
}