{
  "id": "d1299-0",
  "text": "NEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. XXVI NO. 2 FEBRUARY 1961\nNeed Engineers to Go to Africa\nNAEB is in the process of completing a government\ncontract which will send a technical team to an Afri-\n-ean state, whidv-with U. S. help, is expanding its\nradio broadcasting (both medium and short wave)\nsystem. Although the contract is not completed, the\npressure for speedy action is such that we have been\nauthorized to begin informal recruitment.\nThe two positions we wish to fill are:\n• Radio Transmitter Engineer — to serve as con¬\nsultant in the installation, operation, and maintenance\nof transmitters and antennas and train native personnel\nin these functions.\n® Radio Studio Engineer — to serve as consultant\non operation, improvement, and maintenance of all\nstudio equipment and conduct training programs for\nnative personnel in basic electronics and in the oper¬\nation and maintenance of studio and control room\nequipment.\nThe assignments are for two years, with departure\nat the earliest possible date. Consultants may be ac¬\ncompanied by families. Anyone wishing to be con¬\nsidered for these assignments should write imme¬\ndiately to the NAEB at 1346 Connecticut Ave., N. W.,\nWashington 6, D. C.\nNAEB Goes to IERT\nThe annual NAEB luncheon at the IERT will be on\nFriday, April 28. John Burns, president of RCA,\nwill be the speaker.\n• The NAEB utilization committee will sponsor a\npre-conference session on utilization of radio and TV\nin elementary and secondary schools on Wednesday,\nApril 26. Concurrently there will be another session,\nnot sponsored by the NAEB, on utilization for mili¬\ntary and higher education.\nNAEB Offers Grants-in-Aid\nThe NAEB Board of Directors has approved a\nprogram of grants-in-aid to support the develop¬\nment of outstanding radio programing, to replace the\njoint NAEB-NETRC project of this nature which\nexpired last year.\nApplications for grants, which will be limited to\n$1,000 each, will be accepted from any NAEB insti¬\ntutional member through May 1, 1961, and awards\nwill be announced on June 15, 1961.\nThis year the ceiling on grants is lower than in\nprevious years in order to encourage applications\nin those instances where modest outside assistance\nmay mean the difference between a mediocre series\nand an outstanding series.\nDetailed information about submitting applica¬\ntions (which, as in the past, must be accompanied by\npilot tapes) may be obtained by writing 119 Gregory\nHall, Urbana, Illinois.\nPurdue Needs Linguists for Seminar\nPurdue University is sponsoring an international\nseminar on instructional television in October, 1961.\nWarren Seibert writes that he would like to identify\nlanguage-skilled NAEB members to perhaps assist\nin interpretation for the multi-lingual seminar. Lan¬\nguages particularly needed are French, Spanish, Ger¬\nman, and various Oriental onesTNAEBers interested\nshould contact Mr. Seibert, TV program research con¬\nsultant, Purdue University, Lafayette, Indiana.\nDirectors Elected\nIn the runoff election for the NAEB Radio Board,\nR. Edwin Browne, KFKU-KANU, University of\nKansas, was named from Region V; and Ken Kager,\nKUOW, University of Washington, from Region VI.\nNAEB convention - October 23-26, 1961\nWillard Hotel - Washington, D. C.\ni"
}