{
  "id": "d1299-2",
  "text": "the Russian prize-winning film, “Ballad of a Soldier.”\nThe radio presentation was part of a package of non¬\npolitical arts and science features received by WOI\nfrom the U. S. S. R.\n► Featuring experts in the housing and planning\nfield, WNYC, New York City, is broadcasting a\nseries of discussions on “The Battle Against Urban\nBlight.”\n► Astronomy in lay terms is the subject under dis¬\ncussion currently over the Alabama ETV network\nand also over KQED, San Francisco. Scientists from\nthe space flight center at Huntsville, Alabama, will\nbe featured on the former and Carlos Mundt, author,\nlecturer, and former San Francisco State College pro¬\nfessor, will handle the programs for KQED. Both\nseries will stress space science.\n► WNYC, New York City, will begin in July to\nprepare one-minute tapes giving information on the\nlatest conditions involving highways, bridges, schools,\ncolleges, Ifnd other public facilities. The information\nwill be transmitted to other radio and TV stations\nwanting the service and to the telephone company,\nwhich will offer the information via a direct dial\nsystem. Money for six additional WNYC staff mem¬\nbers and extra lines for the station will be provided\nby the city.\n► Foreign press reaction to the Laotian situation is\nbeing translated and interpreted on a weekly hour-\nlong program over KQED, San Francisco. Pan\nAmerican World Airways is flying in daily copies\nof newspapers from Red China to be translated dur¬\ning the program. Other airlines are providing news¬\npapers from other parts of the globe.\nPERSONNEL\n► Lloyd Ellingwood has been appointed executive\nproducer at WTTW, Chicago. He was previously\nwith Chicago’s commercial WGN-TV. Dan W. Law-\nlor, formerly producer-director at KETC-TV, St;\nLouis, has been appointed producer-director at\nWTTW.\nWhich States Have ETV Commissions?\nIt would be appreciated if NAEBers in states hav¬\ning ETV commissions would send the name of the\ncommission, the contact person, and the address to\nHarold Hill, 119 Gregory Hall, Urbana, Illinois. This\nexcludes Alabama, Florida, and Oklahoma, about\nwhich we have such information.\nNetwork Fees Raised\nFor the first time in over five years, assessment fees\nfor members of the NAEB Radio Network will be\nincreased as of July 1, 1961. The extra money will\nbe used to pay for new services which have been\ninstituted (such as a modest grant-in-aid program,\ndescribed elsewhere in this issue, and the news pro¬\ngram originating in Washington which will soon be\noffered via the network) and to start building up\nthe equipment reserve, which was exhausted by the\npurchase of new duplicating equipment recently. De¬\ntails about the fee increases were mailed to all net¬\nwork members last month.\nBOX SCORE\nTotal\nAM\nstations 3517 (includes\n39 noncommercial stations)\nTotal\nFM\nstations\n946 (includes\n190 noncommercial stations)\nT ota 1\nTV\nstations\n581 (includes\n54 noncommercial stationsj\nGroup Insurance Plan Postponed\nBecause too few NAEBers evidenced interest in the\ngroup health and accident insurance and in the\ncatastrophe insurance mentioned in the December\nNewsletter, discussions with the insurance company\nhave been discontinued for the present.\nTHE PRESIDENT'S SAY\nThe Center (NETRC) has announced that it will\nshortfy—operr a Washington office!\nThis announcement may remind some of the\nstory of the young Abe Lincoln who, in providing\nan inventory of household goods to be offered for\nsale, enumerated them as follows: 1 stool with leg\nmissing, 1 chair with seat out, and one rifle that might\nbe worth looking into.\nLet’s do some looking into it—together. Is a\nCenter office in Washington a gun at our head? Or\nis it an additional arm, close at hand, to help carry\non a common campaign?\nThe Center’s move to open an office in the na¬\ntion’s capital is based on its growing realization of a\nneed for expert on-the-spot engineering and staff\nhelp to serve its network stations and to provide for\nits own sources of information upon which to base\nCenter positions; the immediate stimulus for acti¬\nvating the office is the upcoming modification of\nthe JCET. (See enclosed Washington Report.)\nThe intention of the Center to come to Washington\nhas provoked a number of concerns—and confer¬\nences. Was this encroachment? Would it mean unpro¬\nductive conflict and wasteful competition? Who’s to\ndo what? And to whom? Or with whom?\nRealizing the sense it makes to coordinate common\nefforts, the NAEB chose to make this matter the\noccasion for a fresh approach to NAEB-NETRC\nrelationships. A day-long meeting was held January\n19 of officers of both agencies to (1) establish a\ncommon ground for understanding and cooperation\nand (2) develop a joint plan for reallocation of for¬\nmer JCET staff services.\nI opened the meeting by reminding everyone that\nour initiation of this meeting was in keeping with\nNAEB’s traditional position of doing whatever it\nFEBRUARY 1961\n3"
}