{
  "id": "d1557-0",
  "text": "APPLICATIONS BEING TAKEN FOR ADDITIONAL PERSONNEL FOR SAMOAN ETV PROJECT\nIt is expected that the second and third phases of the educational and instr¬\nuctional television project in American Samoa will get underway early in the new year.\nThe NAEB is now accepting applications for positions in the secondary television\nschool program—appointments effective July 1, 1965*\nThere will \"be a need for fourteen secondary school subject matter teachers who\nhave had successful on-camera teaching experience on the Junior and Senior High School\nlevel. There will also be need for principals and in-school instructional supervisors.\nIn addition to the instructional personnel, there will be a need for additional\nproducer-directors, cameramen, engineers, etc.\nPersons interested in becoming a part of this new development in educational\ntechnology should send a complete personal and professional resume to Mr. Vernon Bronson,\nDirector of Research and Development, NAEB, 1346 Connecticut Avenue, N.W., Washington.\nr\nNAEB COMMENTS ON FCC REGULATION OF CATV SYSTEMS\nThe NAEB recently presented its comments to the FCC regarding two dockets now\nbefore the Commission, Docket No. 14895 and Docket No. 15233> both concerning government\nregulation of CATV systems.\nIn brief, the NAEB stated that it concurs with the Commission’s recognition of\nthe potential educational value of CATV systems. Further, it shares the Commission’s\nconcern that such CATV service develop as a complement to, and not as a substitute for,\nlocal educational television service.\nThe NAEB pointed out that educational broadcasting stations would reach many\nrural areas which were not likely to be included in CATV systems. Therefore, consider-\nation should be given to having the growth and development of—CATV systems come under\n^continuing regulation by the Commission.\nNAEB OPPOSES DELETION OF VHF RESERVATION IN EVANSVILLE, INDIANA\nThe NAEB recently filed with the FCC its opposition to the proposed petition to\ndelete reserved Channel 9, Evansville, Indiana, and reassign that channel as a commercial\nassignment at Hatfield, Indiana-Owensboro, Kentucky.\nThe Southwestern Indiana Educational Television Council has shown much interest\nin activating Channel 9 in cooperation with the many other educational facilities in the\ntri-state area. The Owensboro on the Air Corp., however, in petitioning for the re¬\nassignment has recommended closed-circuit as a means of serving the educational needs\nof the Evansville area.\nThe petition to delete the Channel 9 reservation has also been officially\nopposed by Gilmore Broadcasting Corporation of Indiana, operators of Evansville UHF\nstation WEHT."
}