{
  "id": "d1771-2",
  "text": "the layout of the plexiglass panel mounting the com¬\nponents (see photo), we’ll be glad to mail them to\nyou upon request.\n*****\nWe are also in receipt of a brochure, from Mr.\nHaahr of WOI-TV, of a color television recording and\nreproducing system developed by Dr. William\nHughes of the Iowa State College Experiment Sta¬\ntion. The system uses 35mm black and white film.\nElectronically, the brochure states, the ICS system\nis not much more complicated than current black and\nwhite film chains. Mechanically, it is much simpler\nthan even the simplest black and white film chain\nsince it uses a continuous (non-intermittent) film\nmovement. If you wish the brochure on this color\ntelevision recording and reproducing system, write\nto the Director, Engineering Experiment Station,\nIowa State College, Ames, Iowa.\n*****\nThere’s an excellent article in the June 1958\nRCA Broadcast News by John H. Roe, titled “How\nto Get Good Picture Quality from the TK-15 Studio\nVidicon Camera.” This paper discusses the use of the\nnew 7038 vidicon and tabulates the important points\nto remember to obtain maximum picture quality. It\nalso tabulates steps in camera set-up procedure. The\nimportance of lighting is stressed as well as the\nnecessity for correct adjustment of target voltage,\nbeam current, illumination and lens openings to give\nmaximum signal to noise ratio, low lag, depth of focus\nand normal output. The article has been reprinted\nand is available from RCA upon request.\nThe B.B.C. has developed a video tape recording\nsystem which they call Vision Electronic Recording\nApparatus. The May 1958 technical issue of the\nE.B.TJ. Review contains a paper by Dr. P. E. Axon\nof the Engineering Research Dept, of the B.B.C.\nwhich gives technical details of this equipment.\nThe B.B.C. version uses %-inch wide magnetic\ntape running at a tape speed of 200 inches per second,\nthus a 20^-inch reel of tape is required to record a\n15-minute program. Three tracks are laid down\nlongitudinally on the tape, two of the tracks record\nthe video signal and the third track records the ac¬\ncompanying sound. The three heads are mounted in\na single stack so that sound is in sync with picture.\nA second head stack permits continuous monitoring\nof sound and picture.\nIn the B.B.C. system, the yideo .signal is split into\ntwo frequency bands, 0—100 kc and 100 kc - 3 me.\nThe 0—100 kc video band frequency modulates a\ncarrier which is recorded on one track. The higher\nvideo band from 100 kc - 3 me is recorded on the\nsecond video track in a conventional manner. The\naudio signal also modulates an FM carrier of 250 kc.\nIn the recording mode, a servo system locks the\nspeed of the capstan to the frequency of the 50 cycle\nAC supply by use of a light source, photo cell-dc-amp-\nlifier combination. In the reproduce mode, the speed\nof the capstan is controlled by comparing the re¬\ncorded 50 cycle synchronizing signals with the TV\nstation’s sync signals to derive a correction voltage.\nIn addition to an erase head, there is also a cueing\nhead which has been added\nto assist in editing taped pro¬\ngrams. This editing system\nis subject to further develop¬\nment. At present the cue\nhead is fed through a sep-\narate recording amplifier\nfrom a 30 kc oscillator.\nThis frequency is used as\na “marking” device by pres¬\nsing a “cue” key at the point\ndesired for cutting. This\ncauses a 30 kc burst to be re¬\ncorded on the sound track,\nwhich does not interfere with\nthe subsequent playbacks of\nthe tape at normal tape\nspeed. This “mark,” how¬\never, does produce an audible\nsignal when the tape is\nmoved slowly past the re¬\nproducing head to provide a\nSEPTEMBER 1958\n3"
}