{
  "id": "d1781-3",
  "text": "- Monday Evening Engineering Session -\nJohn Doak, of the University of Illinois, discussed .the problems involved in\nconstructing a directional antenna system and referred especially to the experience\nof WILL in.installing its new system.\nCarl Menzer. of WSUI, talked of the possibilities of an educational net-work\nby means of a rebroadcasting arrangement. Ho urged all members to test the\nreception of other educational stations to see whether or not a usable signal was\navailable.\nA general discussion on a variety of subjects followed. It Included\nthe coaxial cable, transmitter maintenance, and television.\n(Tuesday Morning Session)\nA. James Ebei. WILL chief engineer, reported on \"What1s New in Broadcast\nEquipment.\" He began by saying, \"Most new developments are refinements of ideas\nalready in use. There are many gadgets on the market, but these are largely\nfrills which may be added to equipment.\" He mentioned numerous new devices\noffered for sale but said that with most of them it is necessary to use them for\na period of time to determine their value,.\nJohn Stiehl. WHA chief operator, reported on \"Recording Technique and Equip¬\nment.\" He mentioned ways in which recording machines could be used in voice study,\nmusic teaching, and programs for broadcasting. He gave many interesting ideas on\nthe care, maintenance, and use of the recorder. He said that it is well to have\none or two persons familiarize themselyes with the machine and let then handle it\nexclusively. This will, in the long run, assure better results and less waste.\nProf. F. S. Siebert. of the University of Illinois, gave a most interesting\ninterpretation of \"Regulations and Copyright Law.\" The problems of educational\nstations are different from those of commercials and not so full of controversy.\nUnder copyrighted literary material there are three classifications (1) Drama,\n(2) Lectures, Sermons, etc., (3) Other works, books, magazines, etc. Under Drama\nno free privileges are allowed for non-profit production. \"Lectures and Sermons\"\ncan be performed if there is no profit use. \"Other Works\" pay no attention to\nnon-profit use and may, apparently, be performed without restriction. These are\nthe provisions under the existing copyright laws.\nA new copyright lav/ is being pushed under which everything is automatically\ncopyrighted. A plan for enabling owners to sell speqific serial rights, novel\nrights, movie rights, radio rights, etc. is also beinjg sought.\nEducational broadcasters should be at hand when 'the new legislation is\nproposed to be sure that it is favorable to their interests, concluded Mr. Siebert.\n(Tuesday Afternoon Session)\nElmer G. Sulzer, organizer of the University of Kentucky* s mountain listening\ncenters reported on \"Listening Groups\". He discussed needs for group listening and\nthe technique used in organizing the groups.\n\"Programs which lend themselves to discussion are essential to good group\nlistening.\" said Sulzer. \"Always keep your audience in mind when you are planning\nthe programs,\" he warned.\nSpecialists are needed in organizing groups, and constant encouragement is\nneeded to keep the local leader and. listeners on the right track for successful\ngroup discussions. Mr. Sulzer related many interesting incidents connected with\nthe listening centers in the remote mountain areas of Eastern Kentucky. The full\nstory is told in a booklet published, by the University of Kentucky."
}