{
  "id": "d1781-4",
  "text": "(Tuesday Afternoon Session)\n- President McCarty, presiding -\nBUSINESS MEETING\nSecretary’s report was given by II. A. Engel, summarizing the activities of the\nyear.\nPresident McCarty reported on the representation of the Association during the\nyear at national meetings.\nElection of Officers A nominating committee consisting of Jos. F, Wright, WILL\n(chairman), Mildred Seaman, KFKU, and Elmer G. Sulzer, University of Kentucky made\nthe following recommendations -\nPresident - Carl Menzer, WSUI, University of Iowa\nVice President - H. A. Engel, WHA, University of Wisconsin\nTreasurer - W. I. Griffith, WOI, Iowa State College\nExecutive Committee:\nGarland Powell, WRUF, University of Florida\nHomer Heck, WNAD, University of Kansas\nHarold G. Ingham, KFKU, Unoversity of Kansas\nLuke L, Roberts, KOAC, Oregon Agricultural College\nC. A. Taylor, WESG, Cornell University\nH. B. McCarty, WHA (retiring president)\nExecutive Secretary: to be chosen by Executive committee and officers.\nMr. Menz er requested that President McCarty be urged to accept the nomination\nas President for the coming year. Mr. McCarty declined. Poll of members sustained\nthe committee’s nominations.\nBy instructing the Secretary to cast a unanimous ballot, the nominees of the\ncommittee v;ere elected by the representatives.\nResolutions adopted\nTo Payne Foundation requesting continuance of National Committee on Education\nby Radio.\nTo N.C.E.R. to have the services of that organization continued.\nTo retiring treasurer B. B. Brackett for long and faithful service.\nTo Mr. F. F. Nalder, for Mr. Nalder’s service to the Association.\nTo the University of Illinois for its service as hosts to the Convention.\nSelection of Executive Secretary\nIn a conference Frank Schooley, of Y/ILL, was selected as Executive Secretary\nfor the following year to succeed H. A. Engel, who had asked to be relieved of the\noffice.\nAN APPEAL\nHelp your new secretary to help you’. Make it a point\nto send him your news notes regularly, and to put him\non a very special mailing list to receive 30 copies of\nall printed material you have available. Only through\nyour cooperation can these services succeed. Your\nretiring Secretary, H. A. Engel."
}