{
  "id": "d820-19",
  "text": "Preprinted from\nTV & Radio Engineering\nAugust & September, 1953\nSum-and-Difference Multiplexing for\nBinaural Sound on One FM Channel\nWITH SUM-AND-DIFFERENCE MULTIPLEXING, TWO HIGH-FIDELITY CHANNELS\nHAVING GOOD SIGNAL-TO-NOISE RATIOS ARE OBTAINED — By M. G. CROSBY-\nABSTRACT\nThe techniques of applying additional channels to a stand¬\nard frequency-modulation transmitter, by means of a super-\naudible subcarrier in the range of frequencies between 20 and\n75 kc., are briefly reviewed with respect to the circuits which\nmay be applied, the cross-modulation problems, and the sig-\nnal-to-noise ratios obtained.\nA new method of applying the two channels of the bin¬\naural system is described, in which improved signal-to-noise\nratios are obtained for the subcarrier channel, which normally\nhas a poorer signal-to-noise ratio than the main channel. The\nsystem also has advantages with respect to balancing the\nnoise received on the main and subcarrier channels, and\nprovides non-degraded monaural reception.\nIT is 'the object of this paper to point out some of the\nproblems involved in using multiplex techniques to apply\nboth channels of a binaural sound system on a single FM\ncarrier. The basic system, which can be adapted either to\nan FM broadcast transmitter or the sound channel of a 'tele¬\nvision transmitter, employs a superaudible subcarrier in the\nrange of frequencies between 20 and 75 kc. This subcarrier\nis frequency-modulated by the second binaural channel. Ex¬\nperiments have shown that it is possible to apply such a\nsuperaudible subcarrier without appreciably affecting the sig-\nnal-to-noise ratio of the main channel, and with negligible\ncross modulation between the two channels.\nFM multiplexing is not new. E. H. Armstrong, in his\nearly FM work, reported the application of telegraph, fac¬\nsimile, and program material on multiplex channels. Multi¬\nplex Development Corporation worked with facsimile multi-\nT-i\nFIG. 1. ABOVE: BASIC FM MULTI¬\nPLEXING ARRANGEMENT. RIGHT:\nRECEIVER CIRCUITS REQUIRED\nH\n\"ICHAN. A\nplex on the Rural Radio Network in New York State and\ndemonstrated various multiplex applications including binaural\nsound. The concern of this paper is the particular method\nof applying the two channels to the multiplex system.\nBasic System: Fig. 1 shows the usual multiplex system ar¬\nrangement. The FM modulator stage must be broadbanded\nto accept modulation frequencies up to 75 kc. This permits\nthe application of a subcarrier, which may employ a carrier\nfrequency of approximately 45 kc. frequency-modulated ap¬\nproximately ± 15 kc. One of the binaural channel inputs is\n*President, Crosby Laboratories, Inc., Box 233, Robbins Lane, Hicksville,\nL. I., N. Y.\napplied to the main modulator in the conventional manner,\nand the other modulates the subcarrier generator. The maxi¬\nmum modulation of the main channel and the subcarrier\nchannel is usually determined by cross modulation problems.\nHowever, values of 50% modulation on both channels, such\nthat the main channel has a frequency deviation of 37.5 kc.\napplied from binaural channel A, and the subcarrier channel\nproduces frequency deviation of 37.5 kc. from binaural chan¬\nnel B, have been used successfully. It is desirable to apply\nas much modulation from the subcarrier as possible, since\nthis channel has the poorer signal-to-noise ratio.\nAt the receiver, the main channel is detected in the usual\nmanner, and a subcarrier receiver is connected to the output\nof the FM detector system ahead of the de-emphasis net¬\nwork. A high-pass filter may be employed in the subcarrier j\nreceiver to reject the main channel. The high-pass filter\nis followed by the usual limiter and discriminator system to !\ndetect the frequency modulation on the subcarrier.\nAnother means of applying the subcarrier modulation is\nshown in Fig. 2. This system employs a form of multiple\nphase modulation1 applied by successive stages, so that the\nresultant modulation is the sum of the separate modulations.\nUse of this principle for subcarrier modulation is described21\nby E. H. Armstrong.\nThis arrangement, making use of an auxiliary phase modu¬\nlator, has the advantage that it can be readily employed\nwith existing transmitters. Also, cross-modulation and trans¬\nmitter noise problems are less severe. If the system of Fig.\n1 is used, in which the main frequency modulator is merely\nbroadbanded to accept the higher subcarrier modulation fre¬\nquencies, the cross modulation introduced by that modulator\nmust be kept extremely low. In addition, certain FM trans¬\nmitters of the phase-shift type begin with a carrier frequency\nso low that it is quite near the highest modulating fre¬\nquency applied by the subcarrier. It would be questionable\nwhether those FM modulators would be capable of accepting\nmodulation input extending to 75 kc.\nSignal-to-noise Ratio: Fig. 3 shows the signal-to-noise ratio\ncharacteristics obtained at the output of the FM discrimina¬\ntor in the main channel of the FM receiver. The noise at\nthis point has the familiar triangular spectrum characteristic\nof a frequency-modulation system. The output of the main\nchannel applied to the de-emphasis network is the spectrum\nOAB. The de-emphasis network reduces this noise to ap¬\nproximately the area given by the spectrum ODCB. In this\nway the usual high signal-to-noise ratio is obtained on the\nmain channel.\nIt will be noted that the subcarrier, which may be at*\n1 M. G. Crosby, U. S. Patent No. 2, 104, 318, Jan. 4, 1938.\n3 U. S. Patent No. 2, 630, 497, March 3, 1953.\n4k"
}