{
  "id": "d820-6",
  "text": "Hovnter 12, 19\nMr# Paul B# Rickard, Director\nRadio end Television\nWayne University\nDetroit 1, Michigan\nDear Mr* Rickards\nYour letter of January 29, 195k to Dr# Skornie was forwarded to Mr# Men-\nzer, Chairman of the Engineering Committee who gave it to m last July.\nOnly recently when I was in Camden at RCA, have I had an opportunity to\nget some first hand information on the problem of FM multiplexing.\nI was introduced to a Mr. Coulton of the RCA Engineering Products Division,\nin charge of new product development. who had witnessed'a demonstration of\nFM multiplexing. They have had inquiries from networks and other cousaar-\ncial broadcasters regarding the development of FM multiplexing for the\ntransmission and reception of programs of binaural sound on a single channel#\nObviously this is quite a different problem than the multiplex network which\nyou envision where the FM station would be transmitting different programs.\nMr. Coulton says the transmission of two different programs is entirely\nfeasible| however additional filtering would be necessary to keep down\ncross talk between channels.\nAs far as the cost of the equipment is concerned, Mr. Coulton made a \"rough\"\nestimate that the necessary equipment for multiplexing n&$rt cost $5000 per\nstation with an additional $2000 worth of test equipment to maintain the\nnecessary tolerances. He would not make any commitment on the cost of the\nreceiver for such a system. In any event the cost of multiplexing trans¬\nmitters and associated receivers would depend to a great extent upon how\nmany such units were riiamfactured.\nAs regards a nationwide network, it is obvious that while it rai^it be pos¬\nsible to maintain bandwidth on such a system the problem of signal to noise\nratio would be a very real on if we were to attempt a transcontinental\nnetwork. A look at the radio coverage map of HAEB lumbers would indicate\nthe possibility of a Midwest network extending from Ohio through Indiana,\nIllinois, Wisconsin, mnaoseta, Iowa and possibly to Kansas and Oklahoma.\nA Hew England network mi$it also be a possibility but from there on, the\nseparation between stations is such that I do not believe networking would\nbe feasible."
}