{
  "id": "d1470-2",
  "text": "for the Division of Continuing Education of the Oregon State\nSystem of Higher Education, in Corvallis.\n► Ben Yablonky, radio-TV specialist of the University of\nMichigan journalism department, was in Quito, Ecuador, for\ntwo weeks in October, on a visiting lectureship at the invitation\nof the International Center for Higher Studies in Journalism\nin Latin America. The center was conducting an eight-week\nseminar for sixty leading Latin-American journalism educators\n► F. Gerald Bench has joined the staff of KOET, Ogden Public\nSchools (Utah), as producer-director. He was formerly a di¬\nrector at commercial KSL, Salt Lake City.\n► Allan S. Timms, former IT A Electronics sales manager, has\njoined the Adler Electronics staff as a field sales engineer. He\nwill cover New York and New England.\n► Vic Christenson is the new director of the Nebraska Council\nfor Educational Television. He was formerly the superintendent\nof schools at Royal, Iowa, and has twelve years of teaching\nexperience, as coach, classroom teacher, principal, and\nsuperintendent.\n► The Wayne State University department of speech has two\nnew members — Robert K. Tiemens, assistant professor of\nspeech, and Charles R. Clardy, instructor in speech. Tiemens\ncomes to Wayne from Northern Illinois University and has\nworked at commercial KTIV-TV at Sioux City. Clardy has\nworked at commercial stations in Texas and Oklahoma, as well\nas Miami University and the University of Houston.\n► WUNC (FM), University of North Carolina, announces the\nreturn of Robert L. Hilliard to his position as director of radio\nand associate professor of radio, television, and motion pictures.\nHe had been on leave as consultant on TV in higher education\nfor the New York State education department. Donald B.\nUpham, who acted as director during Hilliard’s absence, has\nbeen named director of operations for WUNC and a member\nof the teaching faculty. Frost Branon, a senior, is student station\nmanager.\n► The University of North Carolina department of radio, TV,\nand motion pictures announces the following: Wesley Wallace\nhas been appointed chairman of the department for a five-year\nperiod. John Ehle is on leave to serve as cultural and educa¬\ntional advisor to the governor; he is replaced by a guest\nprofessor, William Hardy. Earl Wynn has returned from a\nsummer of working with and studying new motion picture tech¬\nniques. John Clayton is involved in the production of radio and\nTV materials for the North Carolina Tercentary Commission\nand for the Civil War Centennial Commission. Eric Salmon,\nBritish actor-producer-director is a guest professor.\n► Samuel D. Estep of the University of Michigan Law School\nis in Geneva, Switzerland, attending the International Tele¬\ncommunications Union Extraordinary Conference on Space\nFrequency and Radio Astronomy Allocations. He is an author¬\nity on space law, and terms the conference a “key meeting in\nthe field of space research.” Being determined are such matters\nas legal regulations of space communication satellites. After the\nsix-week conference, Estep plans to visit several Western\nEuropean capitals to meet with broadcasting officials and gov¬\nernment personnel in regulatory agencies similar to the FCC.\n► Robert Blakely, former vice president of the Fund for Adult\nEducation, and dean of extension at the State University of\nIowa, has joined the staff of the Center for the Study of Liberal\nEducation for Adults for a nine-month period as consultant.\n► Herbert A. Seitz, associate professor of radio-TV at Indiana\nUniversity, has received a grant from the National Academy\nof Television Arts and Sciences and the Westinghouse Broad¬\ncasting Corporation to study the problems of converting a\nBroadway play to a TV drama.\n► Raymond C. Giese has been named general manager of\nWOSU-TV, Ohio State University, replacing Raymond J.\nStanley, who resigned to become director of the ETV Facilities\nProgram with the USOE. Stanley was also acting director of\nthe IERT, and Richard B. Hull, director of the OSU Tele¬\ncommunications Center, will assume the IERT directorship.\nNAEB Headquarters: Suite 1119, 1346 Connecticut Avenue,\nN. W., Washington, D. C., 20036. Phone 667-6000. Area Code 202.\nGENERAL\n► Mary Anne Franklin, TV consultant for the Richmond (Va.)\nPublic Schools, writes that the committee which has been\ncampaigning since May for money to activate the city’s allo¬\ncated Channel 23 has raised enough for a station. September,\n1964, is the on-air target date. The Richmond Federation of\nPTA’s has inaugurated a campaign for studio funds. Last\nmonth, school officials (superintendents, directors of instruction,\nand school board members) met for an all-day session to explore\nprograming needs, both in-school and community, and to esti¬\nmate the extent of possible participation.\n► KOET (TV), Ogden Public Schools, and KUSU-TV, Utah\nState University, are investigating the possibility of installing\nspecial microwave equipment to link the two stations; this\nwould mean expanded coverage for both stations.\n► Among the talks at the Audio Engineering Society’s con¬\nvention in New York last month was one on attempting to\ncommunicate with beings from other worlds, based on a\nlinguistic analysis of language and mathematics. New York\nUniversity’s Associate Dean Russell F. Smith gave the speech.\n► WUNC (FM), University of North Carolina, reports equip¬\nment changes during the summer. The 50,000-watt transmitter\nwas overhauled and an 800-foot antenna installed. A new multi¬\nplex unit was installed; the studio was rebuilt, and now in¬\ncludes a newly installed Western Electric dual-channel board.\nA new production studio has been added for news and special\nevents. The department of radio, TV and motion pictures has\na new half-million-dollar home this fall. In addition to class¬\nrooms, auditorium, and offices, the new addition to Swain Hall\nhas a 42x52-foot TV studio, control room, engineering facilities\nroom, radio studios, recording laboratory, and extensive\nfacilities for the photo lab and motion picture production.\n► This fall Oregon’s ETV stations KOAP, Portland, and\nKOAC, Corvallis, have moved to a full broadcast day — from\n9 a.m. to 10:30 p.m.\n► Boston University is offering an evening course on the broad¬\ncast commercial, aimed at advertisers and advertising students.\n► Wilbur Schramm, director of Stanford University’s Institute\nfor Communication Research, says that what the world needs\nis a good $5 battery radio. In a paper for a U. N. conference,\nhe said the developing countries could “jump the barriers of\nilliteracy and powerlines” with such a radio as they could with\nno other device.\n► New York University’s School of Education has received a\nUSOE grant to support a new linguistics demonstration center.\nThe major project of the center will be the production of a\nTV series for NET. Neil Postman, associate professor of\nEnglish education at NYU, will direct the center.\n► In October, its first anniversary month, KUAC-FM, Uni¬\nversity of Alaska, increased its broadcast day — now to be\nfrom noon to midnight. Charles Northrip, station manager, says\nthe increase is in direct response to listener requests for FM\nradio in the late evening hours.\n► On November 17, WUFT, University of Florida, celebrates its\nfifth year on the air.\n► Lampasas, Texas, schools are receiving programs from\nKLRN-TV, Austin-San Antonio, on an experimental basis\nthrough facilities of Tele-Vue of Lampasas, a TV cable cor¬\nporation. Tele-Vue put sets in the school free of charge for\nthirty days of observation.\n► WMHT, Mohawk-Hudson Council on ETV, is broadcasting\nnow at twelve times its former power. With the installation of\nthe new transmitter, Donald Schein, station manager, said vir¬\ntually every home and classroom in northeastern New York\nshould be able to receive a good picture and good sound.\n► The College of San Mateo is scheduled to be on the air in\nFebruary, 1964, with KCSM-TV. Its FM operation is planned\nfor this fall. The ETV outlet will serve as an ITV center with\nprograms for college credit. The hope is for a full “College of\nthe Air” eventually, with a full curriculum leading to the\nbachelor’s degree. Deyrol E. Anderson, operations manager,\nwrites that he would like to extend a welcome to NAEBers\narriving in San Francisco for the NAB convention next winter.\nHe says the stations are unique in that they were built as an\nNovember, 1963\n3"
}