{
  "id": "d1181-0",
  "text": "July, 1955 I\n~ . . ,, . THE PRESIDENT'S PAGE\nHello Againi\nFirst, X want to thank the. many good NAEBers who responded to my request for reac¬\ntions to possible changes in our constitution and by-laws* Lot of good comments\nreceived* Jim* Miles former coranittee has many good ones on file, too* By^early\nfall you'll have some formal proposals on which to react. You'll get the pros and\ncons. And whatever we can get done by mail-, we'll mail vote*\nThere's really nothing much new to report on the NAEB Convention. Things are tnov- •\ning along in rather good shape, and as dates draw nearer there'll be more announce¬\nments*\nRegion V is planning meeting on Tuesday, October 25* *\nThe Board of Directors is; meeting the same day. The president has called for the\nfirst session at 10 a.m* that day. Directors, please note* r\nNAEB activities seem to be moving right along in many directions. From what I\nhear things are well set for a mighty fine TV Production Workshop at Iowa. Rudy\nBrets, Ed Stasheff, and John Winnie seem to be having lots of communications in -\nsetting up the Workshop,\nThe Engineers Workshop seems to be in good shape, as well as in good hands. . Cec\nBidlack and Carl Menzer, Engineering Committee chairman, look like they've lined,\nup a good session, or should I say many good sessions, for the TV engineers.\nThere are a couple of items of business that face the Board, and like all Board\nbusiness it is the business of the members. What Regional meetings will be held\nthis year?\" If you want one in your region, better let your Director know. As noted\nabove, Region V is planning meeting, in connection with convention. Maybe you'd\nlike to do the same for your region. Or you may be like Ed Adams in Region VI,\nEd wants to hold a meeting prior to convention for his region and in his region.\nIf you want help, let your director know, so that he can get dope before the Board.\nThere's the problem of what kind of seminar or Seminars to hold in 1955-56. Shall\nwe hold one for radio? for TV? for research? If so, what kind, and for whom?\nYour ideas would be most helpful.\nHope you'll note the addition to mailing with Newsletter this month. Plans call\nfor program idea in both radio and television with each Newsletter Mailing. There\nare intended to reach your program director, so may I suggest you pass them along\npronto.\nTV Program Report No. 1 comes from Bill Wood, WQED, Pittsburgh. There'll be another\nnext month from some other source. I don't know the contributor for Radio Program\nReport No. 1, but think Ken Wright's committee will have an enclosure, too.\nInternational Relations Committee Chairman Sy Siegel reports that he's been busy\nwith Prix Italia. And he's been busy in other areas of our international relations."
}