{
  "id": "d1181-0",
  "text": "SPECIAL BULLETIN\nRelease Date October 9, 1931\nTO MEMBERS\nTHE ASSOCIATION OF COLLEGE AND UNIVERSITY BROADCASTING STATIONS\n(and co-workers of a few stations not affiliated with the Association)\nSince the release of the special bulletin mailed to members of the Association of\nCollege and University Broadcasting Stations on September 17 some very interesting\ncommunications have been received from over the country from program managers and\ndirectors. A collection of this material will no doubt be of general interest to\nall members. Below you will find \"highlights\" from some of these reports*\nFROM JOE Fa WIGHT, UNIVERSITY PUBLICITY DIRECTOR AND DIRECTOR OF STATION WILL, UNI¬\nVERSITY OF ILLINOIS, URBAN/,: \"The only thing we have in the way of records made by\nUniversity of Illinois organizations is a two-faced Victor record which was made by\nthe University Band when it went to Philadelphia with the football team in 1927. Both\nsides of the record contain Illinois songs, I should be quite happy to send compli¬\nmentary copies of such a record to members of the Association in case they care to\nuse them,\n\"Your ’Special Bulletin' was a dandy, full of news and good chatter, and I hope you\nwill find time to do it more frequently,\n\"I see your point with regard to the work that Miss Dearth of 1/iiNAD has been doing.\nLast year we got from some western outfit continuities built along certain lines\nwith the suggested records to go with the continuity. We used perhaps fifteen or\ntwenth of them and, have another such group tied up in bundles for filling programs\nthis year.\" (NOTE—I wish to make immediate application for complimentary copies^of\nthe record mentioned by Mr. Wright, as we expect to have a special college night in\nthe near future over Station WNAD at the University of Oklahoma. Will other directors\nwho are interested in accepting his offer of having complimentary copies sent to them\nkindly get in touch with him immediately,)\nFROM MR, J. C, JENSEN, DIRECTOR AND ENGINEER, STATION WCAJ, NEBRASKA WESLEYAN UNI¬\nVERSITY, LINCOLN: \"Your very interesting news letter has just been received. I\nhasten to reply on two or three points. In the first place I ajn in communication\nwith one of our graduates in New York, who is in a position to get favorable prices\nfor us on recording equipment. We are expecting to purchase such equipment at an\nearly date. As soon as we have any special results to report, we will send you full\ndetails. The records we already have were made in a Lincoln Speak-O-Phone studio,\nat a cost of $2.50 each.\n\"Regarding the applications of WOW, KHQ, and WEE I for 5000 watts. WOW withdrew their\napplication last week, and a telegram just received informs me that the hearings on\nthe other applications have been postponed from September 22 to October 12. It will\nhelp our cause if a number of the college stations will send letters to the Commission\nprotesting against granting an increased power to any of these stations.\n\"Regarding the questions at the close of your letter. Our class in Public Speaking\nhas been putting on radio debates which have seemed to be reasonably popular. The\nresponse you get will depend on the type of question* discussed, and on the prepara¬\ntion of the debaters* To get the best effect over the air, the debaters should not\nbe too dignified but should have a sense of humor and ’go after’ each other more than\nin the usual collegiate debate. Your second question concerns sponsored programs for\noutside organizations. We have given time to the American Legion, the P.T.A., the\nW.C.T.U. The work of the P.T.A, has been most appreciated because it makes the widest"
}