{
  "id": "d1181-1",
  "text": "-2-\nappeal to our audience. The programs of the W.C.T.U. have not always been of the\nhighest class, but have on the whole been commendable. The American Legion is given\ntime on special occasions-, as is also the Salvation iinmy, and both have given good\nprograms and produced favorable reactions.\n\"As to non-credit courses in Radio, we have offered several of this kind. If any of^\nthe members are interested in the general plan I can send them circulars on request.1\n(NOTE_I wish to add here personal comment on one point raised in Hr. Jensen’s report;\nnamely, the use of teams in radio debates. At our local station—WAD—wo have had\na very extensive public speaking program of all types for the past five years. In\nthis State there is a forensic organization known as the Oklahoma Junior College For¬\nensic Association. Tie always make arrangements to present over the station the final\nchampionship debate between the two junior colleges \"surviving the various tournament\nrounds.\" In this particular debate we have a studio judge group made up of eleven.\njudges selected from the faculty of the University of Oklahoma. In addition to this\ngroup of studio judges we have seventy-five radio judges made up of prominent alumni,\nattorneys, educators, etc., scattered, in all sections of tho State listening in to\nthe debate in their own homes. These seventy-five radio judges report to us by long\ndistance—station to station calls to secure the best possible rato—within ten.minute\nafter the close of the debate. You can see tho possibilities of a tie-up of this kind\nY;g have found that it is one of tho most popular types of programs sponsored. There\nis an endless amount of detail work for sovoral weeks before this final debate in\nsending out special bulletins to the group of radio judges, securing their assurance\nthat they will participate in the program, etc. All effort exerted on this project,\nhowever, is ten times worth its cost in \"good will\" toward the station.\nAnother recommendation to program directors follows: In practically every state\nthere is an organization known as tho state high school debating league. This organi¬\nzation is made up of from 100 to 350 of the loading high schools in each of the states\nThis school year the subject being used by 28 of these states (the subject selected\nbv the National University Extension Association Debate Committee for the cooperating\nstates) is, RESOLVED: THAT THE SEVERAL STATES SHOULD ENACT LEGISLATION PROVIDING FOR\nCOMPULSORY UNEMPLOYMENT INSURANCE* We recommend that you use as many debate contests\namong your larger and better high schools as you can possibly include in your program.\nWe use’ at least eight each season. The response is excellent. We have a.set-up some¬\nthing similar to the plans as outlined for the finals of the Oklahoma Junior College\nForensic Association. The rivalry of the teams, the experience gained on the part of\nparticipants, and the \"good will\" feature introduced in behalf of your station is\nwell worth all effort expended in carrying forward this program, tor the information\nof our various program managers and directors throughout the country I wish to list\nhere the official manager or director of each of these high school debating leagues\nin the cooperating states, I am giving you this list from my files of tho National\nUniversity Extension Association and it is accurate in every respect and completely\nup to date. I would suggest if vou are interested in this project that you get in\nactive touch with the director of the high school debating league in your State and\nhe Will be able to give you some very valuable suggestions as to teams debating in\nthe organization and in this way you can select the nearby teams or any others you\nwish to use and schedule them to meet some other strong outstanding teams and really\nhave an excellent program. I will appreciate a report from any station manager or\nprogram director who uses any of the teams debating unemployment insurance this.school\nyear, as I wish to incorporate this report in the N.U.K.A. report on debate activities\nover the country. The following is the list giving the name of the director, his\ncomplete address, and any. special comment needed--A copy of this special bulletin is\nbeing sent to the state director of the debate league in each of the states listed\nin or\"1 or that he may be acquainted with this announcement before requests reach him\nfrom the offices of the program managers in his state:\nJ. T. Reid, Director of University Extension Division, Albuquerque, New Mexico.\nyr, J. Kay, Head of Public Speaking Department, University of West Virginia, Morgan¬\ntown, Vilest Virginia."
}