{
  "id": "d1181-4",
  "text": "November 8* 1930\nThe Walter H. Baker Company\nBoston, I assachusetts\nGentlemens\nAs your records mil show, you have deposited with the Department of Public Informa¬\ntion of the University Extension Division, Norman, Oklahoma, many copies of your one\nact plays ■’which they send out to local clubs, high schools, etc., in the State of\nOklahoma, and from which these organizations select the particular plays they want,\nand order from the Company. I am informed that this service has increased your busi¬\nness in Oklahoma materially in the past two or three years, and we now have another\nproposition which we feel will increase the service still more.\nOfficials of the University of Oklahoma broadcasting station, 7JNAD, desire permission\nto broadcast on our educational programs, when our various professors from the College\nof Fine Arts, School of Dramatic /rt are discussing for dramatic clubs over the State,\n’’The One Act Play\", four of your plays. The plays we desire to broadcast with the\naid of dramatic students in the School of Dramatic Art are as follows:\n1. Yihere But in America. 2. Brothers* 3. Finger of God. 4. Joint\nOwners in Spain.\nIf you kindly grant us this permission we will make the following announcements im¬\nmediately after the broadcast of the play by the students: ’’The copyright of this\nplay is owned by the H. Baker Company of Boston. He have been granted special\npermission by the W. H, Baker Company to use this play this evening as a radio broad¬\ncast in order to stimulate the use by educational groups of high class materials.\nThrough the courtesy of this Department of Public Information, University Extension\nDivision, Norman, Oklahoma, where samples of the Vi, H*. Baker Company plays are on\ndeposit, you may secure several plays at one time which belong to this Company from\nwhich you may select the one act play you desire to use in your club or schools.\nKindly write the Department for any further information.\"\nTill you kindly advise by return mail as we are making up our educational programs\nfor the next several weeks, and will need your permission not later than November 15i\nSincerely yours.\nT, M* Beaird, Program Director.\nNovember 12, 1930\nC-O-P-Y\nMr. T. K, Beaird\nExtension Division\nThe University of Oklahoma\nNorman, Oklahoma•\nDear Mr. Beaird:\nHe have carefully considered the request\nwhich you have made in your letter of November 8th, and our decision is to authorize\nyou to broadcast the plays\nWHERE BUT IN AMERICA\nBROTHERS\nFINGER OF GOD\nJOINT OWNERS IN SPAIN"
}