{
  "id": "d1654-2",
  "text": "MEMO FROM THE EXECUTIVE DIRECTOR\n—Harry Skornia\nThe very few days I am able to be in the office this\nmonth, between snatches of vacation, necessary trips,\nand the various seminars, workshops and other meet¬\nings, forces this column to be brief this month.\nIn fact, I could almost say that it is not by me at\nall, but rather by Arthur Wells Foshay, executive\nofficer of the Institute of School Experimentation at\nColumbia University. Dr. Foshay was the first\nspeaker at the NAEB Seminar on Instructional Uses\nof Radio and TV at Purdue University July 22-25.\nDr. Foshay graciously agreed to my quoting him\nhere.\nHe began by pointing out the ambiguity of the\nterm “educational broadcaster” which leads to fre¬\nquent misinterpretation and even to some mis¬\nchievous distortion. If he were privileged to select\nour name, now that he knows us well from our Re¬\nsearch Seminar, Washington Conference, and the re¬\ncent one, he would suggest ABE—the Association of\nBroadcasting Educators. I must be too brief to\nelaborate. But I hope you will reflect on the not-too-\nsubtle difference implied in the distinction he makes.\nIf affects our behavior and objectives, even if we pre¬\nserve our present name, of course.\nDr. Foshay next defined profession; a professional\nis someone who does something to people who don’t\nknow very well what’s being done to them. This\nwould be distinguished, for us, from entertainment,\nby adding “with a high moral purpose.”\nDr. Foshay feels that educational TV and radio\ncan deal with all the steps in the learning process\nwhich he defined as starting with a feeling of dis¬\nsatisfaction, taking a hard look at the problem,\nfocusing to define the goal, organizing efforts, and\nending by gathering and interpreting the data.\nHe feels the child being educated needs to learn\nabout the learning process, not have it concealed.\nEducation should teach mep not merely to think, but\nalso to he and do.\nFinally, Dr. Foshay suggested some criteria for\nprogram evaluation which I feel have been all too\nneglected in evaluation blanks of most of our mem¬\nbers. To give a few samples of the very fundamental\nquestions we need to ask about the impact of a pro¬\ngram, I might mention:\n—Does the program convey a high-level attitude\nor concept of the student or man, and respect for\nthe disciplines. This implies dignity and mobility\nin concept of all men portrayed.\n—What significance is given to skills being taught\nif such is the objective? Why learn these? What\ndo we expect the student to do? Are these high\ngoals?\n—Does the program offer clarification of data, or\nonly the data, cold, subject to distortion and am¬\nbiguity?\n—Does the content extend knowledge—and the\ndesire to learn?\n—Do you cause the student to think or feel,\nreally? Do you check on this? Or have you only\nchecked his memory?\nThese are a few questions Dr. Foshay asks, far\nbetter than I have been able to phrase them from\nhurried notes.\nTwo other statements, as food for thought:\n“An educationist is a custodian of the morality of\nour culture.”\n“A seventeenth century mathematician could\nwalk into many present day algebra or mathematics\nclasses and have not a single surprise.”\nTo those who see themselves merely as gad'geteers\nor technicians, I found his words especially challeng¬\ning. I was sorry not to have been able to stay for\nthe entire seminar. However, with the fine hosting\nby James Miles and his staff, the fine consultants\navailable, and the selective winnowing (26 were\nselected out of 83 applicants) which resulted in un¬\nusually highly qualified participants, I feel that this\nis one of the NAEB’s finest seminars to date. We\nshall try to share all of them, as much as possible,\nwith all of you soon.\nWith Frank Schooley on an overdue vacation, I\nextend his greetings as well, and wishes for a fine\nsummer and vacation to you all.\nNETWORK NEWS\n—Bob Underwood\nThis promises to be a rather busy month for the net¬\nwork staff: the fourth quarter offering is being dis¬\ntributed and orders are being recorded, the 1959 in¬\nschool offering audition tapes and manuals are to be\nduplicated and distributed, and the first quarter 1959\ngeneral offering goes in the planning stage.\nWhat with vacations keeping the staff one or two\nshort all the time the activities of this month indicate\nless chance of daydreaming on the part of those here,\nincluding me. Seriously, the men who do the actual\nduplicating and packing week after week deserve a\ntremendous amount of credit for keeping this service\ngoing. During the summer we are running around\n800 tapes a week plus extra orders and now, with in¬\nschool auditions to be dubbed, the work load is pretty\nheavy. Yet, the tapes keep rolling out right on time,\nthanks to the energy of these fine workers.\nAUGUST, 1958\nAre Planned And We\n3"
}