{
  "id": "d1654-5",
  "text": "U. OF ALABAMA GRANT\nWILL ASSIST IN-SCHOOL TV\nThe Alabama In-School Television Project for 1958-\n59 will receive part of the support of a $105,000 grant\nmade recently to the University of Alabama by the\nFund for the Advancement of Education.\nAccording to an announcement by University\nPresident Dr. Frank A. Rose, the university will\nshare the grant with Alabama Polytechnic Institute,\nthe Greater Birmingham Area ETV center, and a\nproject coordination office located in the State Dept,\nof Education.\nETV funds will be used to continue and enlarge\nthe Alabama school TV program for next year when\nschool telecasts will be made available over the Ala¬\nbama ETV Network from 9 a.m. until 3 p.m. Mon¬\nday through Friday.\nETRC RECEIVES GRANT\nFOR RELIGIOUS PILOT PROGRAM\nThe Lilly Endowment, Inc., of Indianapolis has\nawarded a grant of $8,520 to the ETRC for develop¬\nment of a pilot program in religious drama, according\nto a recent announcement of Robert B. Hudson,\nprogram coordinator for the Center.\nSpecifically, the filmed pilot program will aim at\ndetermining whether the “interrupted-rehearsal tech¬\nnique” can be an effective tool of religious education\non television. In this technique, the director inter¬\nrupts the play rehearsal from time to time to inter¬\npret characterization and meaning.\nIf the method proves effective for TV, Hudson\nsays that an effort will be made to arrange for pro¬\nduction of a series of TV programs in religious educa¬\ntion. Programs would be broadcast by the Center’s\naffiliated ETV stations. Plans are now underway\nfor the pilot production.\nWGN-TV GIVES TIME\nFOR TEACHER TRAINING\nCommercial Chicago station, WGN-TV, will make\navailable one-half hour a day this fall to be used by\nChicago Public Schools to present an in-service train¬\ning program in reading for teachers from kinder¬\ngarten through the eighth grade.\nThis represents the equivalent of a grant of more\nthan $70,000 in time charges and production costs\nby WGN-TV to the Chicago Board of Education\nover a 36-week period.\nBelieved to be a unique undertaking by a com¬\nmercial station, the program will provide in-service\nassistance to new teachers coming into Chicago\nschools as well as serving as a refresher course for\nother teachers.\nN. Y. REGENTS BUY\nTIME ON WPIX (TV)\nNew York States’s Board of Regents voted last month\nto contract with WPIX (TV), New York, to use its\nstation’s daytime facilities for educational program¬\nming.\nWOR-TV, New York, had announced earlier it\nwould lease its daytime schedule for educational pur¬\nposes, but the June 30th issue of Broadcasting re¬\nported that WPIX (TV) had underbid WOR-TV.\nThe Regents have agreed to pay WPIX (TV)\n$250,000 for use of the station on weekdays, 10 a.m.\nto 5 p.m. for 46 weeks, starting September 15.\nNYU PLANS ADDITIONAL\n\"SUNRISE SEMESTER\" COURSES\n“We are moving toward a full four-year college pro¬\ngram on television,” said Dr. John E. Ivey, executive\nvice president of New York University after an an¬\nnouncement of expanded plans for NYU’s course-for-\ncredit television program, “Sunrise Semester.”\nUtilizing pre-breakfast time donated by WCBS-\nTV, “Sunrise Semester” is scheduled to expand' this\nfall from one to four courses, offered from 6:30-7:30\nweekday mornings and from 7-8 a.m. Saturdays.\nThe program was started last year with a course\ntitled “Comparative Literature 10,” presented by\nNYU Prof. Floyd Zulli, Jr. at 6:30 a.m. weekdays.\nA total of 117 qualified applicants paid $90 to enroll\nthe first semester and WCBS-TV estimated some\n120,000 persons in four states watched the show reg¬\nularly.\nAccording to the July 21 issue of Broadcasting,\nthe success of “Sunrise Semester” stems from six years\nof cooperative educational broadcasting between\nWCBS-TV and NYU.\nAlthough all of the required time for a full four-\nyear college program probably could not be cleared\nby WCBS-TV, NYU has not yet approached' other\nstations for a similar arrangement, according to War¬\nren A. Kraetzer, director of NYU’s office of radio¬\ntelevision.\n—N A E B—\n6\nThis Coming Fall\nNEWSLETTER"
}