{
  "id": "d1654-6",
  "text": "SYRACUSE OFFERS TRAINING\nTO INTERNATIONAL STUDENTS\nFor the first time this fall, Syracuse University’s\nDepartment of Radio and Television will offer a pro¬\ngram for international student training in broadcast¬\ning.\nDr. Eugene Foster, department chairman, said\nthat the program is designed to help countries abroad,\nespecially those of Africa and the Middle and Far\nEast, more fully utilize their broadcasting potential.\nThe eight-month program has been built on the belief\nthat radio is the most effective means of communica¬\ntion for countries that need to make available more\ninformation that will raise the standard of living and\nexplain political policies.\nInternational students will be taught how to de¬\nvelop a radio system in their homelands that will fur¬\nther citizen education and provide an effective outlet\nfor communication to other countries. Special train¬\ning will be given to station managers, program di¬\nrectors and directors of news and educational broad¬\ncasts.\nSyracuse University’s Radio and Television De¬\npartment has been active in a long-range plan to im¬\nprove Iranian radio. In 1954 Dr. Foster spent six\nmonths in Tehran as a consultant on radio for the\nInternational Cooperation Administration Mission.\n*****\nThe Conference on World Literacy by Television\nmeets August 8-9 in Memphis, Tenn. under sponsor¬\nship of the Memphis Chamber of Commerce. It will\nfeature talks by communications experts and educa¬\ntors.\nA REMINDER TO EMPLOYERS\nNearly 150 qualified applicants are presently on file\nwith the NAEB Placement Service, yet placement\nfacilities are far from being fully used.\nThe free NAEB Placement Service was established\nfor, and has served, not only job applicants but also\nemployers who benefit by obtaining suitable per¬\nsonnel for their organizations. We would like to\nremind employers that it is to their interest to take\nadvantage of the opportunities which the service\nprovides.\nAll applicants seeking placement through the\nNAEB are carefully screened before they are included\nin our files. Only persons with experience and suit¬\nable educational backgrounds are considered. When\nthis screening process is completed, employers have\nan excellent list of qualified, trained candidates from\nwhich to select.\nPLACEMENT SUPPLEMENT\nAugust I - Young married man, 31, with M.F.A. desires a\nposition as instructor, producer, director or program di¬\nrector for radio or television operation. Candidate of¬\nfers 7 years commercial radio and TV experience with 4\nyears classroom experience on secondary and college\nlevel. Good voice, excellent experience records. Pre¬\nfers metropolitan area in East. Others considered.\n$5,000.\nAugust 2 - Experienced announcer, news director, seeks creative\nposition in radio or ETV. Can write, film and produce\nmovies; edit single and double system sound. Prefers\nposition as TV producer, director, writer, announcer or\nprogram director; in radio, as station manager or news\ndirector. Male, 28, married, A.B. Location open.\n$5 - 6,000.\nAugust 3 - Resourceful producer-director, 29, married, wants\nchallenging work in an ETV station where he can use\ncreative abilities. Good commercial experience covering\nvariety of production positions and directing. M. S. in\ntelevision. Prefers Southeast, Southwest or West.\n$4,800 minimum.\nAugust 4 - Available immediately: experienced teacher and\nproducer-director in commercial and educational TV.\nThree years in secondary education; five years in tele¬\nvision production. Over 100 educational kines produced\nand directed for national distribution. Desires position\nwith particular responsibilities in forward-looking college,\nuniversity, community, or ETV station. Married man, 35,\nA.B. Location open. $7,500.\nAugust 5 - Young man, 21, single, with Associate of Applied\nScience degree from institute of technology wants a\nsituation working as a floor manager or cameraman in\nETV station. One year of ETV experience; willing to work\nup from bottom. Prefers eastern or midwestern city.\n$2,900 minimum.\nAugust 6 - Ambitious young man, completing master's de¬\ngree in educational administration with 18 graduate\nhours in television, desires position in educational TV.\nAvailable upon completion of academic work in February,\n1959. Broad educational background, wide travel ex¬\nperience, 3 years service as Army officer. Married, 26.\nLocation open. $5,800.\nAugust 7 - TV production supervisor, operation supervisor, pro¬\nducer-director, instructor-lecturer—thoroughly experi¬\nenced in all phases of TV operation—seeks responsible\nposition with ETV station or production center and/or\nteaching position with accredited institution. Three\nyears solid commercial experience; 3 years in ETV film,\nkinescope, and closed-circuit production; 4 years col¬\nlege teaching in radio/television. Male, 32, married,\nM.A. Prefers Midwest but location is open. $7,500.\nAugust 8 - Television producer-director desires employment in\nETV in supervisory or administrative capacity. Six years\nexperience in educational broadcasting and public school\nteaching, 5 years as professional symphony musician.\nProduced and directed all types of programs from\nlecture/demonstration to opera. One year's adminis¬\ntrative experience. M.M., B.Ed., married, licensed\nteacher. Prefers Southeast, South, or Southwest. $6,500\nminimum.\nAugust 9 - Woman with MA in education, MS in library service\nI year doctoral-level work in Instructional Materials (in¬\ncluding audio-visuals, radio, TV) and 7 years professional\nexperience would like a position in educational broad¬\ncasting. Single, 32, licensed teacher. Prefers Chicago\narea. $6,000.\nWe can supply a station with an engineer, art\ndirector, or imaginative producer. We can help an in¬\nsituation in its needs for an ETV consultant or an\nexperienced administrator willing to set up a new\nstation. But we cannot offer our services unless we\nhear from those who need it. If you have an opening,\nwe hope to hear from you.\nAUGUST, 1958\nWe Hope We'll Get\n7"
}