{
  "id": "d1654-7",
  "text": "BOSTON UNIVERSITY HOSTS\nINTERNATIONAL SEMINAR\nSixteen broadcasting experts from ten foreign coun¬\ntries are now participating in the 1958 International\nSeminar on Radio and Television at the Boston\nUniversity School of Public Relations and Com¬\nmunications.\nThe seminar, under sponsorship of the Inter¬\nnational Educational Exchange Service of the U. S.\nDepartment of State, started July 17 and will extend\nuntil November 13. During this time, the group will\ntour representative studios in commercial and educa¬\ntional radio and television, visit the Voice of America\nfacilities in Washington, D. C., as well as attend\nseminar meetings at Boston University.\nFor further “mutual exchange of professional\nideas,” the participants will spend a month\nworking individually at local studios throughout the\ncountry for the purpose of gaining first hand infor¬\nmation.\nTHIRTEEN BROADCASTERS\nCLAIM \"PIONEER\" STATUS\nA number of responses have come in to our query of\nlast month about “Radio Pioneers.” We were happy\nto hear from so many people who, as one respondent\nsaid, “admitted” eligibility requirements of at least\ntwenty years experience in radio and/or television.\nTo date, membership in the Pioneers Club has\nbeen claimed by: Cecil S. Bidlack, NAEB’s Tele¬\nvision Engineer; Mrs. Gertrude Broderick, radio and\nTV educational specialist from the Office of Educa¬\ntion, Washington, D. C.; Robert Coleman, former di¬\nrector of WKAR-AM-FM at Michigan State Uni¬\nversity, East Lansing; Marguerite Fleming, manager\nof Board of Education station KSLH (FM), St. Louis,\nMo.; Roy Flynn, director of radio-TV at Florida State\nUniversity, Tallahassee; Burt Harrison, program man¬\nager of KWSC (AM), State College of Washington,\nPullman; and H. B. McCarty, director of WHA-AM-\nFM-TV, University of Wisconsin, Madison.\nAlso included in membership are: Carl Menzer,\nstation director of WSUI(AM) and KSUI(FM),\nState University of Iowa, Iowa City; Allen Miller,\ngeneral manager of KWSC (AM), State College of\nWashington, Pullman; Frank E. Schooley, director\nof university broadcasting, WILL-AM-FM-TV, Uni¬\nversity of Illinois, Urbana; Loren Stone, manager of\nKCTS(TV), University of Washington, Seattle;\nElmer Sulzer, director of radio-TV at Indiana Uni¬\nversity, Bloomington; and Luther Weaver, NAEB\nmember, founder and instructor of the first radio\nwriting course at University of Minnesota, frequent\nwriter on broadcasting, president of Weaver-Gardner,\nInc., St. Paul, Minn.\nIf you are qualified for membership in this group\nof “Pioneers” we’d like to hear from you. Contact\nthe Newsletter Editor at NAEB Headquarters.\nNEWS OF MEMBERS\nGENERAL\nAlabama’s ETV Network is the first educational\ntelevision operation to receive a citation from the\nGeneral National Federation of Woman’s Clubs in its\nnewly added awards category of educational TV pro¬\ngramming. The honor was given recently on behalf\nof the networks adult programming.\n^ An Ampex video-tape recorder was delivered to\nWGBH-TV, Boston, last month as a gift of the\nSpaulding Foundation.\nPROGRAMS\n^ A new summer series from WTTW, Chicago,\ntakes the form of an anthology of editorial comment\non a variety of subjects. Entitled “Montage,” the\nseries includes programs on the story of the circus\nin Chicago, social climbing, and the values of a street\ngang. The programs, written and researched by\nWTTW staff members, were telecast in July and will\nextend through August.\nPERSONNEL\ny J. Daniel Logan is the new station manager of\nWDET, Wayne State University. His 15 years of\nprofessional broadcasting experience includes serv¬\nice to Ohio University as chairman of its radio-TV de¬\npartment. Since 1954 he has been radio program di¬\nrector of WDET.\n^ Dr. Harry J. Skornia, NAEB executive director,\nhas been named a member of the Executive Com¬\nmittee of the U. S. National Commission for\nUNESCO, according to Max McCullough, executive\nsecretary of the commission. Dr. Skornia recently at¬\ntended a study group meeting to discuss the role of\nthe commission.\n► Norbert J. Hruby leaves the office of radio-tele¬\nvision at the University of Chicago to become as¬\nsociate dean of the University College of the Uni¬\nversity of Chicago. All programs that he has been\nassociated with are now produced by Burton Moore\nand Alec Sutherland, director of broadcasting.\nTo See You All\nNEWSLETTER"
}