{
  "id": "d1654-8",
  "text": "TV TECHNICAL TIPS\n—Cecil S. Bidlack\nIn almost every television station operation, occasions\nhave arisen when the intercommunication between\nthe director and the camerman is not loud enough to\novercome ambient noise. Donald K. Haahr, of the\nWOI-TV staff, sends along the methods used there\nto overcome this difficulty as developed by two of\ntheir engineers, Thomas F. West and Leo E. Runge.\nThe two most obvious program offenders are\nsportscasts and musical productions. Quick camera\nchanges during the climax are important, yet this is\nusually the time of most program volume. Our ill¬\nustrations show two of the three methods used at\nWOI-TV to assure its cameramen getting necessary\ninstructions in spite of program or crowd noise.\nThe first step in this improvement was to con¬\nstruct a bracket which mounts the microphone as¬\nsembly of a Western Electric Type 52 AW headset to\na war surplus double cushion headset (see photo).\nThe WOI-TV crew likes them because they offer\nintercom to both ears, at the same time blocking un¬\nwanted sound from the normally used ear. They are\nrugged and they are more comfortable, especially in\ncold weather.\nThe second step was to incorporate an amplifier at\nthe director’s position which fed a higher talk level\nto the intercom circuit. The talk voltage was raised\nfrom the usual .5 volt normal level to approximately\n3.0 volts, which is about the maximum, above which\ncross talk may be observed in the video circuits of\nthe camera cable. The addition of a key switch al¬\nlows the director to have the line audio amplified on\nhis headset alone. One disadvantage is that the di¬\nrector’s mike is amplified into his own ear piece.\nAs a result of this second step it became evident\nthat it would be desirable to have an amplifer at each\nheadset location with its own volume control; in this\nway the audio in the intercom circuit could be normal\nmike level. The third step was to build a transistor\namplifier in a x 21/4\" x 4\" aluminum minibox\nshown on the panning handle of the camera. The\npower supply is self-contained and to date the bat¬\nteries have lasted over three months using them\nabout three hours per week on remote pick-ups. The\ncost of materials is less than ten dollars per unit.\nIf you’d like to complete constructional details of\nthese amplifiers including a parts list, schematics and\nthe layout of the plexiglass panel mounting the com¬\nponents (see photo), we’ll be glad to mail them to\nyou upon request.\n*****\nWe are also in receipt of a brochure, from Mr.\nHaahr of WOI-TV, of a color television recording and\nreproducing system developed by Dr. William\nHughes of the Iowa State College Experiment Sta¬\ntion. The system uses 35mm black and white film.\nElectronically, the brochure states, the ICS system\nis not much more complicated than current black and\nwhite film chains. Mechanically, it is much simpler\nthan even the simplest black and white film chain\nsince it uses a continuous (non-intermittent) film\nmovement. If you wish the brochure on this color\ntelevision recording and reproducing system, write\nto the Director, Engineering Experiment Station,\nIowa State College, Ames, Iowa.\n*****\nThere’s an excellent article in the June 1958\nRCA Broadcast News by John H. Roe, titled “How\nto Get Good Picture Quality from the TK-15 Studio\nVidicon Camera.” This paper discusses the use of the\nnew 7038 vidicon and tabulates the important points\nto remember to obtain maximum picture quality. It\nalso tabulates steps in camera set-up procedure. The\nimportance of lighting is stressed as well as the\nnecessity for correct adjustment of target voltage,\nbeam current, illumination and lens openings to give\nmaximum signal to noise ratio, low lag, depth of focus\nand normal output. The article has been reprinted\nand is available from RCA upon request.\n*****\nThe B.B.C. has developed a video tape recording\nsystem which they call Vision Electronic Recording\nApparatus. The May 1958 technical issue of the\nAUGUST, 1958\nSheraton-Fontenelie\n9"
}