{
  "id": "d232-100",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVICE-PRESIDENT\nGRAYDON AUSMUS\nWUOA, University of Alabama\nUniversity, Alabama\nTREASURER\nFRANK SCHOOLEY\nWILL, U. of Illinois\nUrbana, Ill.\nEXECUTIVE DIRECTOR\nJAMES MILES\nGREGORY HALL, U. of Illinois\nUrbana, Ill.\nGENERAL COUNSEL\nMARCUS COHN\nCafritz Building\nWashington, D. C.\nREGIONAL DIRECTORS\n☆\nRegion I\nPARKER WHEATLEY\nWGBH, Lowell Institute\nBroadcasting Council\nBoston, Mass.\nMaine, New York, Connecticut, New\nHampshire, Massachusetts, Vermont,\nRhode Island, Pennsylvania, New\nJersey, Delaware and Maryland.\nRegion II\nALVIN GAINES\nWABE, Board of Education\nAtlanta, Ga.\nVirginia, West Virginia, Alabama,\nKentucky, Tennessee, North and\nSouth Carolina, Georgia, Florida\nand Mississippi.\nRegion 111\nWALDO ABBOTT\nWUOM, U. of Michigan\nAnn Arbor, Mich.\nOhio, Michigan, Indiana, Illinois\nand Wisconsin.\nRegion IV\nRICHARD B. HULL\nWOI, Iowa State College\nAmes, Iowa\nIowa, Minnesota, North and South\nDakota, Nebraska and Wyoming.\nRegion V\nJOHN DUNN\nWNAD, U. of Oklahoma\nNorman, Okla.\nMissouri, Kansas, Colorado, New\nMexico, Oklahoma, Arkansas, Texas\nand Louisiana.\nRegion VI\nALLEN MILLER\nKWSC, State College of\nWashington\nPullman, Washington\nMontana, Washington, California,\nIdaho, Oregon, Nevada, Arizona,\nUtah and Territory of Hawaii.\nDIRECTOR OF STUDIES\nDALLAS W. SMYTHE\nIllinois University Communica¬\ntions Research Institute.\nUrbana, Illinois\nSECRETARY AND\nPUBLICATIONS EDITOR\nBURTON PAULU\nKUOM, U. of Minnesota\nMinneapolis, Minnesota\nPRESIDENT\nSEYMOUR N. SIEGEL\nWNYC, Municipal Broadcasting System\n2500 Municipal Building\nNew York 7, N. Y.\nAIRMAIL SPECIAL DELIVERY\n8 January 1953\nMr* Graydon Ausmus\nNational Association of Educational Broadcasters\nGregory Hall\nUniversity of Illinois\nUrbana, Illinois\nDear Graydon:\nI have your letter of January 3. Unfortunately I just\ncouldn't make it to the meeting on the 8th and 9th in Urbana\nmuch as I should like to*\nSeldom has a month been so busy for me as this past month,\nand never has a week been like the one I’ve just gone through!\nOur opening Minneapolis Symphony telecast last Sunday was highly\nsuccessful, but it left in its wake a tremendous number of details\nto be taken care of before the next program goes on the air Janu¬\nary 11. With Rudy Bretz out of town all week I had to do some addi¬\ntional work, (incidentally, the new Television Production Center\nwhich we talked about during our last meeting in Chicago gave us\n17500 to kinescope this series, that being the first grant they’ve\nmade anywhere, which is another reason that we want the programs to\ngo out just as they should.)\nThen there is the matter of our educational television\nnetwork. The legislature opened this week, and subcommittees from\nour statewide television committee met three times. Yesterday I\ngot together with the president, the two vice presidents, the\ndirector of public relations, and the dean of the extension division\nto draw up a resolution which the regents are expected to pass\ntomorrow after its review by one of the subcommittees this morning.\nI have to be around when important meetings of this kind are taking\nplace in order to do the leg work when Mr. Morrill calls. So that’s\njust another reason why I had to stick around Minneapolis this week.\nBut I will send along a few ideas for you boys to kick around\nin Urbana. In the first place I am not quite clear in my mind about\nthe educational television seminar for which FAE promised 15000. If\none were to assume that I might have much to do with managing an\neducational television network, which would be the best thing for me\nto do: stay here and see our bills through the legislature, thus\ngetting acquainted with the various factions with itiiich the network\nwould have to deal, or go to a seminar out of the state? I know I’d\nlearn a great deal from such a meeting, but maybe I’d do better to\nstay here while this is all developing. What do you think? And\nhow would this apply to other people in the position in which I may\nbe if and when we get a network here?\nRepresenting nonrcommercial, educational, radio and television stations, workshops, and production\ncenters, owned and operated by colleges, universities, school systems and public-service agencies."
}