{
  "id": "d232-116",
  "text": "University of Minnesota\nGeneral Extension Division\nMinneapolis 14\nRadio Station KUOM\n770 ON YOUR DIAL\n15 February 1953\n(dictated February 11)\nMr. Robert B. Hudson\nDirector of University Broadcasting\nUniversity of Illinois\nUrbana, Illinois\nDear Bob:\nThank you very much for sending me a copy of your memo of January 31 to Graydon\nAusmus.\nBet me say in all sincerity that this is exactly the memorandum I was waiting\nfori ^ome of these developments are beginning to confuse me very much. The purposes\nof the television seminar have never been placed in sharp focus for me, and I wasn't\nable to understand what would result from such a meeting. This state of confusion\nwas heightened by my missing several recent NAB^ meetings on account of television\ndevelopments at home which required my staying in Minneapolis. At our meeting in\nhew lork a couple of weeks ago I was confused on a number of developments but was\ninclined to blame my failure to follow the trend of events upon my absences from a\ncouple of recent meetings and upon a. recent bout with the flu.\nBut your memo of January 31 clarified things very well. As you can see from\nthe enclosed letter, I am writing to Graydon and the Board giving the project my\nentire and enthusiastic support.\nThe television network developments in Minnesota are proceeding very well. Our\nOitizens1 Committee director, Walter Finke, is doing a bang-up job. He has managed\nto make peace between the University and the Minneapolis Public Schools and pretty\nmuch on University ternsl (I am enclosing a copy of my memo of December 22 to\nPresident Morrill which — publicized only after the president had seen it and had\nmade a few changes in it — has been accepted as the basis for procedure.) The\nBoard of Regents passed a resolu/tion (a copy of which is enclosed) which the\nMinneapolis School groups were willing to accept. And the president of the Minnesota\nBroadcasters Association together with the heads of WCCO-AM and TV have publicly\nsupported our request to the legislature.\nCnly this morning I had a long telephone talk with the folks at Marshall — one\nof the towns chosen for a supplementary station, this taking the form of a conference\nbetween the Marshall station radio program director, the superintendent of schools,\nand the mayor down there who interviewed me as to our plans. This presumably will\nbe broadcast by the Marshall station shortly. The folks at Marshall are very excited\nabout having television brought to their community.\nI am going to try to stick pretty close to home from now until the end of the\nlegislative session, about the 5th of April. During my last trip to New York a\nfew decisions were made about funds to be requested from the legislature in the\nmaking of which I should have been present. The answer of course is that I had\nbetter stick pretty close to home until this is all settled."
}