{
  "id": "d232-12",
  "text": "-11-\n-s ”19^9 Radio Audience Analysis.” Broadcasting, (January 16, 1950),\nPP.2UA\n-9 \"Public Taste in Entertainment.” Fortune, XXXIX.(march 19h9), pp. U3-U\n— -, ”Radio vs TV.” Sales Management, (November 20, 19h9), p. 72.\n——-, \"University of Illinois Completes Study of Radio Habits.” Advertising\nAge, XX (April 11, 19l*9), p. 50.\n-, Urban Teenagers as Radio Listeners and Customers. National Broad¬\ncasting Co .7 February 191*9. P. 113.\nBaker, Kenneth, \"American Mass Media in Action: An Analysis of Radio’s Pro¬\ngramming.” pp. 51-72 in Lazersfeld, Paul F., and Stanton, Frank, eds..\nCommunications ResearcTT~19l*8-19l*9. New York: Harper & Brothers, 191*9.\nBeville, Hugh M., Jr., \"Surveying Radio Listeners by Use of a Probability Sam¬\nple.” Journal of Marketing, XIV(October 191*9), pp. 373-8.\n---> The True Dimensions of the Radio and Television Audience.\nNew York: National Broadcasting Co., 19U9.\nBogart, Leo, \"Fan Mail for the Philharmonic.” Public Opinion Quarterly, XIII\n(Fall 1910), pp. U23-3U.\nBridge, Harry P., Practical Advertising. New York: Rinehart & Co., 19l*9. P. xxii\n/ 81*2. -\nBrown, Lyndon 0., Marketing and Distrioution Research. New York: Ronald Press,\n19U9. P. 612\nBryson, Lyman, ed., The Communication of Ideas. New York: Harper & Brothers,\n1950. * ;\nButler, James J., \"Radio Doesn’t Satisfy Washington Readers.\" Editor and\nPublisher, LXXXII (April 23, 19l*9), p. 96-D.\nFisk, George, Defining and Measuring Radio audiences. Pullman: State College\nof Washington, October 191*9. °. vii /1*0.\nHarrell, T. ¥., Brown, D. #., and Schra.jn, W., \"Memory in Radio News Listening.”\nJournal of Applied psychology, XXXIII (June 191*9), op. 265—7U*\nKlapper, Joseph, Effects of Mass Media. New York: Bureau of Applied Social\nResearch, Columbia University, August 19U9- iii / 166.\nLaybourn, G. p., and Longstaff, H. D., \"Certain Correlates of Attitudes toward\nRadio Commercials.” Journal of Marketing, ILLL (April 19h9), pp. UU7—58.\nLazersfeld, Paul F.., \"Impact of Radio Commercials and Ads in Newspapers Compared\"\nBroadcasting, XXXVII(October 21*, 19h9), o. ll*D.\n-, and Berelson, Bernard, Analysis of Communication Content.\nNew York: Bureau of Applied Social Research, 191*9.\nResearch for Action\" op\nCommunications research '\nand Dinerman, Helen, \"American liass Media in action:\ny|®»f5^?W4r;|ul&Fg#oagdrSta2tgn, Frank.e*"
}