{
  "id": "d232-133",
  "text": "PUBLIC AFFAIRS (Cont.)\nBp* S. B* Worthington, Secretary-General, Scientific Council for\nAfrica* (Council organ!2*4 by the governments of Britain, Franca,\nBelgium, Portugal, South Africa and South Rhodesla)\nJohn Kiano, student at Stanford diversity, member of the Kiyuky\ntribe, Konya.\nJohn H* Dalton, graduate student in economics, University of Cal*\nifornia, spoolallst in African Affairs, former resident in Africa.\nHorth Africa\nBom Landau, IJ.S. advisor to the U.B. on Morocco, member of the\nfaculty of the American Academy of Asian Studies.\nEleanor Knight, former resident of Morocco, presently at the Uni¬\nversity of California.\n2SE&S5SB&&SL.Int.nrl.gai.\nRalph Bnnche, Interviewed on United nations Trusteeship.\nMI EQUITY RlM).STt A documentary series of four twenty minute programs on the\nattitudes of Junlor-Hi^i students on such subjects as race, narcotics,\nsex, housing, parents and teachers. These programs were recorded on\nlocation at a Junior High school serving a lower socio-economic group. Many\ni of the youngsters interviewed In this series are described by teachers and\nsocial workers as “delinquent*. The techniques used in assembling the\nprogram material was that of separate group interviews, conducted by a\nguidance counselor, of negro boys and white boys, negro girls and white\ngirls. The age of those interviewed ranged between fourteen and fifteen.\n* Interview” is actually a misnomer for the material recorded in that it is\nentirely spontaneous and unceasored conversation between the teen-agers\nand the one adult in the program.\nTK& LAW AND THE PROPHETS$ A series of six half-hour discussion programs devoted\nto an exposition of the jurisprudence of Justice Holmes, Benjamin C&rdosa,\nLearned Hand, and others. The series will be produced In cooperation with\nthe San Francisco Bar Association and with various faculty members from\nBo alt Hall, University of California School of Law. Primary era basis in\nthe series will be on the philosophy of law.\nAfiCHITSCTUKSt A series of conversations on contemporary American, particularly\nwestern styles of architecture. Participants in this series include six\noutstanding American architects: Bernard Maybeck, .Prank Lloyd Wright, Pietro\nBelluschi, Edward Stone, Richard Heutra and W. W. Wooster. Three half-\nhour programs."
}