{
  "id": "d232-140",
  "text": "Box 2002\nUniversity, Alabama\nMay 29, 1953\nEr. Burton Paulu\nKUOK, University of Minnesota\nMinneapolis, Minnesota\nDear Burton t\nYour Gunflint Lodge meeting sounds very, very exciting. Sorry\nI was out of town when your letter came and was a little late getting my\nreply to you. I certainly expect to be on hand and, as I indicated to you,\nwould be happy to share a cabin - with hot aid cold running water - with\nsomeone else. You may be interested to -kriow that the reason I am concerned\nwith hot water is that it was the only form of heat available in ny cabin\nat National Music Camp and X certainly don’t want to freeze for a week.\nI am leaving Saturday for Washington and will be out of the\noffice a week. X expect to see VanDuyn for a conference and will take up\nthe matter of contributing to your trip. I may simply ask Bob to handle\nit as a personal matter between you and him because Frank and others feel\nthat we must secure funds for all three of our men on the same basis. I\nfeel safe in predicting, however, that the matter can be arranged.\nI have had no word from Si or George on the $15,000.00 BBC project\nor on the $1,000.00 offer beyond a note from Si saying that if the Center\nwill not give us the full $$6,000.00, we should turn the fi$,000.00 back\nto them. Originally, he had promised to attempt to secure additional funds\nto match the 1$.\nOne of my immediate concerns is appointing a committee within\nNAEB which will contact foundations outside of the Center and the Kellogg\npeople for funds. This some committee should be a creative one to make\nproposals in terms of major productions* Cm you make some suggestions?\nGeorge is being a recalcitrant about terminating the work of the\nAdult Education Committee. I made this request of him, as you know, upon\nthe recomraendation of Dick and the Executive Committee. If I need any\nsupport on it, I trust you will add your bit.\nOur House of Representatives approved 82 to 2 our TV Bill\nTuesday of this week. The Bill asks for $$00,000.00 and the creation\nof an educational TV Commission. The House Bill, will reach the Senate\nfor reading Friday of this week and for action Tuesday of next week. I\nhave done all I can in the way of pulling state-wide support for it and\nwe expect it to pass the Senate by a not too generous margin. Conceivably,\nit could be defeated in the Senate. Since I have done everything I can,\nI am going to stand by and hope without too much high blood pressure."
}