{
  "id": "d232-142",
  "text": "NATIONAL ASSOCIATION OF E D\nTION AL BROADCASTERS\nMr. Graydon Ausmus\nStation KUOA\nUniversity of Alabama\nUniversity, Alabama\nOFFICE OF THE VICE PRESIDENT\nKUOM, University of Minnesota\nMinneapolis ll, Minnesota\n12 June 1953\nDear Graydon:\nI an dictating this over the telephone from home where I an spending Thursday\nand Friday of this week helping to take care of Sarah who just had her tonsils out.\nI note in your letter of May 29 to Louis Hill that you referred to an Executive\nCommittee meeting at 9*30 AM on June 21 at the Conrad Hilton Hotel in Chicago. I\nreferred to this in my letter to you of June 2, but I have not received any direct\nnotice from you about the meeting. So unless I hear from you to the contrary, I\nwill assume this is a formal commitment (and that NAEB funds will be available to\ndefray the cost of the meeting,). I an therefore writing to the Conrad Hilton to\nreserve a room for me for Saturday, June 20, and shall be available for meetings\nthe morning of June 21,\n1 shall look forward to talking to Louis Hill about some of his projects,\nespecially the music ones since his list of subjects had some very exciting possibilities.\nRelative to Skornia and ^teetle attending the Grand Marais meeting, Skornia\nis already among the invitees. Also we sent a copy of the May 21 memorandum\nannouncing details for the meeting, in addition to which I wrote him again several\ndays ago telling him to get in his request for reservations immediately.\nAs you may already know from other sources, although neither Fletcher nor\nGriffiths ezpect to attend. Bob Hudson will probably be there to represent them.\n(You will recall that we invited either or both of them)\nYour letter of June 10 including the postscript about my receiving funds from\nthe Kellogg Foundation arrived today, and I had ray secretary read it to me over the\ntelephone. Your assistance here is enormously appreciatedl Sarah's tonsilectomy\nbesides her broken leg several months ago provides me with additional personal\nmotivation to secure extra funds. Of course that in itself is no reason why Kellogg\nor anybody else should give me financial assistance — it merely increases my need —\nbut I think our case is good in itself.\nI will be looking forward to seeing you in Chicago on the 21st. In case you\nget into Chicago on the evening of the 20th, you might give me a ring in my room\nfor a chat.\nWith best personal regards,\nYours sincerely.\nBurton Paulu\nManager\nBPicjm"
}