{
  "id": "d232-161",
  "text": "Mr. Graydon Ausmus\n-3-\nOctober 26, 1953\nphatically that there can be no supplements to the expense allowance\nas now set up for any reason whatsoever—so purchase of a tape\nrecorder and playback, for example, would be out of the question.\nOf course I expect to read a good deal about the BBC, about education\nin England, and other related subjects. But in the last analysis,\npersonal consultations will have to be the main method of gathering\ninformation. So far I*ve had consultations as often as I*ve wanted\nthem. It will be up to me to arrange more—many more—infuture weeks\nand months.\nItem (2)—telling the BBC and British educators about American\neducational broadcasting and the NAEB—may not appear so important to\nall NAEB’ers as to you, since you had a chance to negotiate with them\nduring your week here. Actually, little is known here about American\neducational broadcasting. Educational institutions in England ho not\noffer courses on broadcasting or do much mass media research. And of\ncourse they do not run their own stations. Therefore our work is all\nnew to them, and their impressions of our work are qualified. For\nexample, the annual report of BBC for last year contains a few lines\non the North American service as follows: \"A striking increase of\n160 per cent in the amount of rebroadcasting by individual stations\nin the U.S.A. was accounted for largely by the stations belonging\nto the National Association of Educational Broadcasters, with whom\nthe BBC has collaborated closely. Some of these stations have com¬\nparatively small audiences.\nTo tell our story I have tentatively laid out these plans: collect\nvia Harry Skornia many books on American educational broadcasting in\ngeneral for distribution to BBC people, their library,and the Em¬\nbassy library: get a good many copies of NAEB publications and re¬\nleases for the BBC, for radio and book critics on magazines and news¬\npapers, and for educators; make talks and reports on American\neducational broadcasting; set up auditions of records and tapes of\nour better programs; and arrange to meet as many as possible oi tne\nkey people concerned.\nNow, what help do I need from you in order to carry out these plans?\nFirst, information on the current status of our BBC relationships.\nI have copies of your July 20 report on your European trip, and of\nGreene*s letter to you of July 10. But I do not know whether or not\nthe Board has accepted these terms, if the $56,000 has been raised,\nand if so, from what sources. In addition to this information, X\nshould have summary reports on just what programs we ve taken in the\npast from BBC, how many stations carried them, and reports on\naudience response if available.\nSecond, much NAEB material. When I wrote to Hariy last weeK I re¬\nquested five to six copies of each NAEB publication, but think this\nnumber should be upped to twenty-five or so. Thus wide distribution\ncan be made without delay for reorders. As to records, one set of"
}