{
  "id": "d232-163",
  "text": "Mr*- Grey don Ausmus\nOctober 26, 1963\n!ee® the American School which would have been the only alternative\nm Chelsea.. Our house contains six rooms, heated by a combination of\ncoal ^grates, gas grates, and electric heaters,, plus a coal burner to\nprovide hot water. 1 have no idea what it will cost us to keep\nmoderately warm in cold weather* but our coal bins seem to empty out\nas if by magic already I There are no laundry facilities whatsoever,\nso we have to send out all the laundry except what Frances can do by\nhand—and a family the size and ages of ours has a lot of laundry. Food\ncosts will probably run about the same as or a little lower than at\nhome, with canned goods higher, fruits the same, and meats and fresh\nvegetables lower. Transportation from out here is a big item (and I\nmight add that when we go sightseeing we load the three children and\nTommy*s stroller into a public bus or subwayl) X mention all these\npersonal items merely to indicate that we are not proposing to finance\na year of luxury with any funds we get, but merely to maintain a normal\nmoderate standard of living.\nAs for a supplementary expense allowance, the rules here permit of no\nincreases above the level set for all Fulbright scholars, even though\na person doing my job incurs many expenses which most Fulbrighters\nFor examPle? I am paying—as I have already explained-\n$100 for the TV set I am renting. I can do some travelling in the\nBritish Isles on ray expense allowance, but it will cover only rail\ncosts and not meals or other expenses. Luncheon costs must come from\nmy family living allowance; yet X cannot receive red-carpet hospitality\nfrom the BBC without repiprocating, or work with educators, critics,\netc. without incurring entertainment costs. And although my London\nUniversity^ adviser strongly recommends a look around at broadcasting in\nthose Continental countries whose programs are easily received here, I\ncannot use Fulbright funds for any out-of-UK travel costs except\ntransportation, and shall not have enough money to cover much of that.\nSurely my secretarial costs will be high once a good correspondence\nwith all of you is begun, but here again I can obtain no relief.\nWhat do we do about all these things? Well, here*s a. recap of my\nspecific requests:\n(1) Please brief me as thoroughly as possible on the present status of\nNAEB-BBC negotiations, and indicate specifically what sort of things\nyou and the Board would like me to do over here, and what general\npolicies should be followed.\n(2) Will Harry please send me the books and publications, NAEB and\notherwise, listed in this and my October 16 letter, which have not\nalready been sent or ordered?\n(3) I could use $1200 to keep me solvent in the States and meet my\nextra professional expenses here. (This should be in dollars rather\nthan blocked sterling, which can be used in the sterling area only.)\nBut in view of the NAEB*s own financial problems, 1*11 just say on this\npoint: my needs are down on record]"
}