{
  "id": "d232-170",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n147 Argyle Hoad\nEaling\nLondon, W. 13\nJanuary 11, 1954\nMr. Graydon Ausmus\nPresident, National Association of Educational Broaacasters\nStation Y/UQA\nUniversity of Alabama\nUniversity, Alabama\nDear Graydon:\nI recently received a very nice letter from John Dunn which in¬\ndicated in passing that there would be a meeting of the Board of Directors\nin Ames on January 21st. This prompts me to make a few commenxs aoout\nNAEB-BBC relationships, in case the Board should discuss the raising oi\nmoney for the acquisition of BBC programs. Knowing that you are often\naway from home, I shall send carbons of this letter to both John and Dick\nHull, so it surely will reach the Board.\nI have listened to a great many BBC broadcasts since arriving here,\nseveral months ago, and have tried to appraise them not only on the basis\nof whether or not they are “good\" programs—if it is possible to agree\nupon what constitutes a M good program'1—but especially with a view to\ntheir use by NAEB stations. Generally speaking, I have decided that, so\nfar as NAEB is concerned, BBC dramatic material is by all odds the most\nuseful. In this category I would include standard plays, such as\nShakespeare, Chekhov and the rest; some of their lighter plays—both\noriginals and adaptations; and what they call \"feature\" and we refer to as\n\"documentary\" broadcasts.\nThere also is much fine music on the BBC, and I should be delighted\nto have KUOM, for example, broadcast some of it. But here we encounter\ncopyright and union complications—which probably are in themselves in¬\nsuperable; we have the problem of the tape duplicator; and tne fact 1S\nthat we do not need much music in view of the amount now available on\nl.p.'s. For these reasons I do not think we should find the BBC an\nespecially good musical program source.\nTheir talks and discussions I think we should find least helpful.\nMary Somerville and her BBC Talks staff are extremely capable and hard¬\nworking, and their devotion to their work is exemplary. Our question,\nhowever, is—how much of the BBC talks output would be acceptable on\nAmerican educational stations, rather than whether or not the output is\ngood in Great Britain. Due to such factors as differences in interests\nbetween the two countries, accent problems, pacing differences, the\ntendency of the British to be less incisive in statement than we.are,\nand the fact that these programs are often of odd lengths, I seriously\ndoubt the usefulness of many BBC talks for the tape network. When we\nadd to all these considerations the fact that headquarters already has a\ngood supply of NAEB-produced talks which we should use whenever we can,\nX incline strongly to the belief that, for NAEB, BBC talks are not going"
}