{
  "id": "d232-171",
  "text": "Mr. Graydon Ausmus\nr2r-\nto be very helpful.\nThere is another department in the talks division, though, which\nturns out a lot of material which might be very useful to NAEB schools\nbroadcasting. Much of their material is local and/or topical, and some\nof it might raise accent problems too. But some of the schools output\nwould be very useful—the Music and Movement series for younger chilcren,\nfor example. If and when we are in a financial position to ask for specific\nBBC programs, I should investigate the in-school services rather thoroughly.\nIncidentally, I am having lunch with John Scupham, the head oi the depart¬\nment, and some of his staff next Friday, and am learning all I can of\ntheir work.\nIn connection with BBC talks, I should say a word about the six\nhalf-hour Keith lectures which recently were broadcast over the BBC by\nJ. Robert Oppenheimer, the American physicist. In view of the fact that\nmuch publicity preceded the series, and because Oppenheimer^himself is so\nable and distinguished, a good deal was expected of the series, and some\nof this preliminary enthusiasm may have been relayed to you. However,\nthe general consensus of opinion around the BBC (off-the-record, of course.)\nwas that the talks did not live up to expectations. A number of the\nLondon radio critics who enthusiastically anticipated the series, expressed\ngrave doubts once it was under way because of its extremely techniccil\nnature. Thus Lionel Hale in The Observer on January 3 wrote: “...the\nKeith Lectures, though at first I kept up with Dr. Oppenheimer, soared\nway out of my sight”, and the London Times, wrote editorially on January 11\nsaying in effect, because Oppenheimer*s talks were not as successful as\nsome of the other Keith lectures, don’t give up.\nI am enclosing a copy of the Times editorial. When you read it,\nremember that the Times, with ex-BBC Director General Haley as^editor, _\nis very pro-BBC; apparently there has been so much criticism of the series\nthe paper felt some defense was needed.\nThis of course is the kind of series which NAEB would be eager to\ncarry if suitable, and it might be of some value simply because of the\nprestige surrounding it. However, in view of the mixed reception given\nthe lectures here, if there is any likelihood of the Oppenheimer talks\nbeing taken by our network, I would suggest that several of them be mon*\nitored by the NAEB program acceptance committee.\nThe BBC Transcription Service has been recording a few things—\nmostly dramatic—for release to us in the event we are able to raise\nmoney to carry through the terms of our agreement. They have begun to press\nme for suggestions as to what to do with the things they have put on ice\nso far. I should appreciate a little advice as to the current status of\nour negotiations in raising funds, so that I’ll know what to tell them.\nBoth Creshkoff and I are going to Belgium in February at the\ninvitation of the Belgian Ministry of Public Instruction, to speak.at an\neducational television conference in Brussels and also to lecture in\nsome other as yet undesignated Belgian cities. Perhaps Hovey will be\nthere, too: but if so I haven’t heard about it. I am hoping to arrange\na trip to both Home and Paris while on the Continent, for I feel that\nanyone this close to Europe should examine broadcasting operations in\nseveral European countries if possible. Creshkoff, Hovey and I also"
}