{
  "id": "d232-181",
  "text": "Box 2002\nUniversity, Alabama\nFebruary 23, I9$k\nDr* Burton Paulu\nc/o Fr* Graham Hovey\nVia Ocaia, U3 (Int* 11)\nHome, Italy\nDear Burtons\nYour letter of February 17 raises two or three questions to which I should\nlike to respond.\nFirst, there are two or three elements of surprise in it* In all of my\nconversation® with everybody in the BBC lest summer no one would listen to the\nidea of a token contribution and Basil, long before I went over tter% made it\nquite clear that at no point was I to even mention a token contribution* If\nyour impression \"that a token contribution might help our position\" is correct,\nthere has been a complete reversal of attitude. Frankly, at this point I don't\nknow whether the $15,000 originally offeree by Scotty is still available, par¬\nticularly in light of the fact that the Center has now taken over all of those\nnegotiations which involve programs* Skornia and I are to see Hewburn next week¬\nend and we might approach the subject of the availability of that |j>l5,00Q* In\nthe meantime, I doubt that it would be wise for you to get the hopes of the BBC\nboys up on this score*\nI am not surprised that your suggestion concerning your helping select programs\nwhich are being sent over here did not meet with open-armed enthusiasm* In iry\nconference with Grisewood last summer, he asked me what specifically you would be\ndoing in England and I mentioned the possibility of your helping select programs\nto come this way* Hie and Looker, who was present, both bristled quite visibly at\nthe suggestion and gave me to understand that the decision for overseas programs\nwas strictly a staff decision. I wish you joy on that score.\nI must confess that I have serious doubts that there will be any money for\nthe BBC or any other overseas service unless NAEB launches its own fund raising\ncampaign, independently of FAE and the Center*\nHarry may have some report to make soon on the Fulbright arrangement* I\nsuggested some time back that he send a special notice to all NAEB stations asking\nthem to begin planning in terms of securing a Fulbright scholar for next year* I\ndon't know what progress he has made or whether he has secured any letters from\nmember stations or not* If he has not, he should begin some specific contacts to\ntry to place the three scholars from the U.lC*, France, and Italy* When I talked\nto Young in December he told me that the funds approved for the scholar from Italy\nand from France at Miles' and Hull's shops were adequate. The breakdown on the\nreturn U.K* scholar occurred in the negotiations between Parker Wheatley and Basil\nThorton* Parker had agreed to accept a scholar from England and began conversations\nwith Thorton concerning it*"
}