{
  "id": "d232-211",
  "text": "January 3# 1957\nDr. burton Paula\nKtJOM* One SMy Hall\nUniversity of Mlnneaota\nMinneapolis 14, Minnesota\nDear Burton:\nSorry I didn’t et up tills week-end, but unless travel\nplans are changed, won't make It. Asked Otey to call you this morning.\nHave a sv ' estlon for consideration* Froa start of head¬\nquarters operations, \" I think we have had certain wa«t»8 in jiving\nnone arsons too much In way of \"free conics.\" And, I have been ~\nparty to starting and carrying on. Harry and I have discussed, and\nHarry has worked toward reducing \"free copies\" In many arena.\nFor example, when Harry took over we gave officers ton free\ncoles of the Newsletter only to find out many were wasted. It's now\nout down to five or less.\nPersonally, I feel an officer-director should he willing to\naccent one free or complimentary copy of everything. His own mmber-\nehlinstitutional or pereonal, brings him an additional copy for\nstaff use.\nThis leads me to urging adoption of some such plan as com¬\nplimentary cedes for regular publications, limit of two to individuals.\nThis would go* for Journal, Newsletter, Fact sheets.\nI would suggest that when Individuals need additional copies,\ndecisions b© mad© ur-on basis of need and copies available, but\nall such fcx for rded to Ho- .quarters. In this way, for example, a\nhundred copies in headquarters could go where greatest need and good\nwould be Indicated. I should think the Executive Director, or\nExecutive Director upon recommendation of any..of fleer or director\nmight make occasional exception for good of cause, but we wouldn t\nhave machinery set up month after month to give excessive copies,\ninvolving printing and r^stage costs.\nOn the JOURNAL, exception should be considered. For examine,\nwe don’t pay for articles. Itr practice has been to send two copies\nto authors/ I would be dis3;x>se& to give an a< Itlonal ten u i -on re-\n■*t. without charge. Ov< .hove, there should be a charge. Maybe\nstJLOtt here is too liberal, but IL/ry and I have discussed end\nthis looks good at this date."
}