{
  "id": "d232-30",
  "text": "Clark, H. A., \"Television Is Moving In On Us.\" Clearing House. XXIV (January\n1950), op. 259-63. --\n.Corbett, Thomas E., New Directions for Television. New York: Brownlee Pub¬\nlishing Co., I9I1.9I p\".’\"59. : ~~\nDallaire, Victor J., and staff, \"Television Today.\" Printers Ink, CCXXVI\n(February 18, ±91x9), p. Ul.\nDavis, Evangeline, \"Video, I Love You.\" Atlantic Monthly, CLXXV (March 1950),\np. 87.\nDeckinger, E. L., \"Will Television Absorb Radio?\" Advertising Agency, (January\n1550), pp. 70-1. -\nDuMont, A. B., \"TV Predictions for ’i*9.\" Radio and Television News*. XU\n(March 19l*9), pp. 1*0 /.\nDunlap, 0. E., Jr., \"How You See By Television.\" Science Digest, XXV (January\n19h9), pp. 30-iu -\nEly, Owen, \"Television: The Miracle Industry.\" Analysts Journal, (First Quarter\n1950), pp. 19-21. -\nGinsberg, M., \"What Every Family Wants to Know About Television.\" Science\nIllustrated, IV (January 19l*9), op. 19-29. -\nGould, Jack, \"Television, in Big Strides, Advances Across the Nation.\" New\nYork Times, (April 2l*, 19i*9), p. xx, Sec. 10. -\n-9 \"Television’s Role; Must Chart Its Own Course and Not Become Merely\na Medium.\" New York Times, (February 20, 19U9), p. 11.\nHarrington, R.\nP. 199.\nI*., Your Opportunities in Television. New York: McBride, ±9h9.\nHavemann, E., \"Breaking into Television.\" Life, XXVII (September 19, ±9h9)s\npp. 93—li A\nHoffman, S. S., \"Television Grows Up.\" Conference Board Business Record, VII\n(January 1950), pp. 3U-6. \" --~\nJohnston, P. A., \"Television Makers Uniformly Optimistic.\" Barron’s, (April 11.\n19h9), PP- 7 A -\nJust, P. A., \"Television: A Challenge to Investment Thinking.\" Commercial\nand Financial Chronicle, CLXX (Oetober 13, 19l*9), pp. 11*50 /. —\nLohman, Sidney, \"Television Network Expansion in 19l*9.\" New York Times,\n(March 6, 19l*9), o. 11. -\nManchester, H., \"TV Will Change You.\" Nation’s Business, XXXVII (June 19l*9).\npp. 1*0-2 A -1\nMcCaffery, J. K. M., \"Uneasy Chair.\" Publishers’ Weekly, CLVI (September 10.\n19h9), P. 13lil. --"
}