{
  "id": "d232-41",
  "text": "- 41 -\n--/’Television and Education.” Educational Screen, XXVIII (March 1949),\npp. 107-11.\n-- \"Television and Telephone Can Be Combined to Bring the Classroom\nto the Shut-In Child.\" American Teacher, XXXIV (April 1950), p. 14.\n-———, \"TV Notes.\" Scholastic, LV (October 12, 1949), p. 29.\nBack, J. L., \"Television Teaches the Doctor.\" Hygeia, XXVII (September 1949),\npp. 604-5 /•\n' Beauchamp, 17. L., \"Education and Television.\" School Review, LVII (’March .1949),\npp. 127-9.\nBrecher, E. M., \"TV, Your Children and Your Grandchildren.\" Consumer Reports,\nXV (May 1950), pp. 231-2.\nDale, Edgar, \"Television and Education.\" News Letter (Bureau of Educational\nResearch, Ohio State University)» XIV (May 1949), pp. Y, 2-3, 4.\nDeily, H. E., \"Jersey City Lays Television Groundwork.\" New Jersey Educational\nReview, XXII (May 1949), pp. 326-7.\nDivisia, Margaret, \"What Tlelvision Means to the Teacher.\" Hollywood Quarterly,\nIV (Summer 1950), pp. 403-6*\nEddy, 17. C., \"Television as an Educational Tool.\" Trust Bulletin, (December\n1949) , pp. 28-9*\nGable, M. A., \"Public Relations Values of Television.\" Nation's Schools,\nXLIII (June 1949), pp. 56-8 /. ' * \" 7\n—————, \"Teacher! Here Comes Television.\" Educational Screen, XXVIII\n(February 1849), pp. 68-70*\n—  -—, \"Television Is At Your Service Now.\" School Management,\nXVIII (December 1.948), pp. 4 /y Same, condensed. Educational Digest,\nXIV (February 1949), pp. 5-7.\n--———— ^ \"Television Is Hei'e to Stay.\" Journal of the National Education\nAssociation, XXXVIII (September 1949), p. 462.\nGibson, E. D., \"Business Education in Television.\" Business Education World,\nXXX (May 1950), pp. 447-8. '\nGorton, S. R., \"Distributive Education Meets a Training Need.\" American\nVocational Journal, XXIV (October 1949), p. 9.\nHaihfeld, Harold, \"UN Telecast Inaugurates A-V Week.\" Audio-Visual Guide,\nXVI (March 1950), p. 19.\nHau'ssman, A. M., \"Television for Teaching.\" Social Studies, XLJ (February\n1950) , pp. 62-5."
}