{
  "id": "d232-49",
  "text": "University of Minnesota\nGeneral Extension Division\nMinneapolis 14\nRadio Station KUOM\n770 ON YOUR DIAL\ni*»ceutber 19, 1951\nMr* 4mms Miles\nGregory Hall\nUniversity of Illinois\nUrban*9 Illinois\nbear Jlai\nTour letter of December 5 has had to wedt\" until tddi® for an\nanswer because of the problems attending ifrom pm& acid to\nMinneapolis* -\\ \\ \\\nOn page 2 you propose fc \"awMtiflgi plintn^- committee charged\nwith the duty to investigate all possible cress ii'fbctix^ edupsiionsl\nradio today..*•* 1 am all in^avor of hom\\noyi of committee to do that,\nbut 1 think the committee aifoul4 either 'be ©ur>*6ard of Directors, or\nsome other ,roup made up/ler£ely\\©f its k *bf*s - ss for eyacipl©, our\nexecutive Committe© wiiidh is already It eptist^nco. 1 make this suggestion\nbecause i think tii^s ii soj close tb th4 dfevelbpraoEit of the organisation\ntar t uds siiaul*Ube\\ bone other venr close bo$9ci of Directors ’ supervision,\nend 1 Uiink >hp^besi w|ay to do this is/fo^ft to be done by board members.\nThere is «1m/the fact\\ thai. our bosrd/includes some of the nest experienced\nend best qualified men\\(e haf®* y^7\nI Am to the su^geciir*H#s3ich this committee might take up, X think\nthat your ii^t of nine fs very good and surely will serve as a starting\npoint* latur^ily, uW ^omitiee will more or less write its own agenda\noncti it logins' ^\nOn piprj\"you suggest the holding of a seminar in the summer*\nMay 1 offer for your consideration and also for that of the hoard of\nDirectors, making the 1952 convention into something of a seminar? X\nrealise that combining the features of a convention with those of a\nseminar is a hard order, tut 1 would like to have a chance to discuss\nwith a number of you and also with Win bchraam ways end means by which\nwe could have a pretty good study atmosphere at our 1952 meeting*\nin reading your letter of December 5 mod the accompanying\nappendices I was prompted to look into KUbM flies in order to see how\nmuch we had about the two AUcrton House conferences* For some reason\nor oti^er the only thing we h? ve is a mlmeegrsphod 30-page sti tmont\nentitle B^aucitiont1 rroedcasting, Its Aims and Responsibilities.\" If\nyou have oilier material on either or both of the Allerton House"
}