{
  "id": "d232-5",
  "text": "Lewis, Fulton, Jr., \"Critique on.a Critic.\" Public Opinion Quarterly, XIII\n(Fall 19k9X, : --—-~3\nMillspaugh, Martin, \"Trial by Mass Media?\" Public Opinion Quarterly, XIII\n(Summe r 19h9) ■, pp.' 3 28-9 •\nMuhlen, N., \"Comic Books and Other Horrors; Prep School for Totalitarian\nSociety?\" Commentary, VII (January 19h9)9 pp. 80-7. •\nOliphant, H.N., \"Fulton Lewis Jr., Man of Distinction.\" Harper’s Magazine,\nCXCVIII (March 19i*9), pp. 76-8U.-\nStrout, Richard, \"The British Won’t Work.\" New Statesman and Nation, XXXVIII\n(October 1, 19k9), pp. 351-2. ---\nWheatley, K.E., \"Anomalies of Radio Speech.\" American Speech, XXIV (October\n19U9), pp. 213-15. -■- •\nWinnet, N.S., \"Judge Looks at Comics, Movies and Radio.\" Parents Magazine, XXIV\n(October 19U9), pp. 39 /\nU. Programs\na. General\nAnonymous, \"A/ to the Halls to Ivy.\" Scholastic, LVI (May 3/ 1950),.p. 19T\n— -, \"Inside Radio; Picture Story.\" Coronet, XXV (February 19U9), pp.\n1U7-62.\n---) \"Little Miffed Moppets; Juvenile Jury.\" Readers Digest, LV\n(September 19^9)> pp. U7-8.\n-Round Table Memorandum. Chicago; University of Chicago Radio Office.\n-9 t»gam’s Dream Comes True; NBC’s This is Your Life.\" Life, XXVI\nXXVI (June 13’, 19U9), pp. 129-32. -\n--— > \"Speaking of Pictures; People Are Funny.\" Life, XXVI (January 17,\nX9h9), pp. lit-16. *\n— --y \"Travelers Tell All; Welcome Travelers, Broadcast from Chicago over\nABC.\" American Magazine, CXLVIII (August 19h9), pp. 36-7,\nBryan, J., 3d, \"Radio's Most Embarrassing Moments.-\" Saturday Evening Post,\nCCXXI (April 23, 19U9)9 pp. 2U-5 A -\n1 •\nCarson, Saul, \"WFDR.\" New Republic, CXXI (July ]*, 19h9), pp. 20-1.\nChorney, J., \"WHOD, Little United Nations.\" Christian Science Monitor Magazine\nSection, (April 22, 1950) y P* 11. 7 '-\nKent, George, \"Antidote for Dial-Hopping.\" Saturday Review of 'Literature\nXXXII (December iO, 19U9), pp. 18, 28-9. \" \"\nmsin, H.L., \"Clear the' Air*.\" Scholastic, LIV (March l6/19h9)\\ p.*22.\nMuller, E., \"Family Doctor of the Seven Seas.\" United Nations World, IV\n(my 1950), pp. 2i;-6. :---—"
}