{
  "id": "d232-63",
  "text": "February 6, 1?$2\n% / '\nTO: Waldo Abbot, Graydon Ausmus, John Duma, Richard Hull, Alvin Gains®,\nWiliy.sni Harley, H. B* McCarty, Jones Miles, Allen Miller, George Probet,\nFreric Scbooley, Seymour Siegel, Ralph Steetle, Dallas Scythe, Parker\nWheatley\nFROM: Burton, paulu\nSUBJECT: Graft version of Minutes of January 15, 19, 20 Meetings of NAEB Executive\nCommittee, Board of Directors and Adult Education Committee*\nAttached hereto is a draft of the minutes of the nestings listed above*\nIn view of the complexity of some of the issues taken up X have decided to circulate\nthere in tentative draft form before putting them into final to*\nWill you please return these when you are through making eny changes or\ncorrections you deem necessary and let me have your reaction within the week so\nthat X may get these out in final form*\nItems on which 1 have questions are covered below in this impersonal\nmemorandum in order to expedite matters*\n.mss' Would you want to provide m with about 25 more copies of your\nJanuary lk memorandum and accompanying materials to issue as Appendix A to the final\nform of the minute®? It might facilitate future reference to these materials by\nmembers of the Board if such materials were attached even though they had been\npreviously distributed to the members*\nMiles: Ditto for you Proposal Elaboration as Appendix £.\nProbst; Ditto for Tennis Court meeting as Appendix C* Also, whet was\nthe date of this meeting? Would you like to supply m with enough copies of your\nletter to Fletcher of January 3 as Appendix D?\nHarley: Will you please check for accuracy of ray statements as to yo^r\nreport on the Mult Education project (pegs I*)? •\nSiegel: Would you supply ms with a corrected list \"of eoMmittd|p so X can\nincliuifl It as Appendix E2 £„vJSfc- .*\nSchooley: Will you please exeaiae critically my references to your report\non the last page of the minutes* If you wish m to attach copies of your report\nwould you send me about 25 so that X can put them on as Appendix F«\nSiegel and Bunn: Will you please give me more information as to the\nlocation ojP ine high point high school referred to in the next to the last paragraph\non the last page*\narp"
}