{
  "id": "d232-87",
  "text": "-a-\nb* the wnxM&m of Minnesota as licensee\nVJho should be the licensee of Minnesota*s noncommercial educational\ntelevision stations? First, let us determine who under the lm could\nbe the licensee* The Federal Communication Commissions television rules\nprovide til at a noncommercial educational television station may Jtbe li¬\ncensed only to nonprofit educational organisations,** public or private*\nIn Minnesota therefore such a station might be licensed either to a single\ninstitution or agency (college, university, or public school system), or\nto e corporation created for that purpose, made up of several such edu¬\ncational institutions one organizations* Good reasons may be advanced\nfor either of these alternatives. Licensing to a single institution «—\nthe University of Minnesota in particular — aey seem preferable for the\nfollowing reasons:\n(1) The stations would acquire stability if licensed to an already\nexisting institution, organization or agency, rather than to s new cor¬\nporation set up especially for that purpose* They also could benefit\nimportantly from the extensive administr ative services which a going\ninstitution could provide.\n(2) The University of Minnesota is immediately qualified to serve\ns& licensee, because of the state-wide nature of its educational functions,\nthe extent of its general resources, and its radio and television broad¬\ncasting experience* It would be the logical focal point for the many\nsnd diverse educational groups which would be involved in programming the\nstation; it would offer the most productive single source of program\nmateriel (even though wide use must certainly be made of the educational\ntelevision program resources of the entire state); and its thirty years\nas radio station licensee would provide a valuable experiential background\nagainst which to develop the new educational television network*\nFurthermore the University could male© available to the television project\nsuch services as the following: fiscal procedures — payroll and purchasing;\nlegal arrangements — the letting of construction bids and the assumption\nof contractual obligations; the maintenance of records; and physical\nplant administration. Direct broadcasting costs would have to be paid\nfrom funds appropriated expressly for that purpose, but most of the special\nservices listed shove would be available to the project at considerably\nless cost if the University were the licensee. On the other hand, if a\nnew independent corporation were the licensee, it would need to devote\na sizable portion of its fund3 and personnel to setting up end maintaining\nthese administrative snd service functions*\nG« THE MINNESOTA EDUCATIONAL TELEVISION COMMISSION\nIf the University cf Minnesota were the licensee of these stations, how\ncould active participation by the rest of the Minnesota educational community\nbe enlisted and assured? To accomplish this the University would propose\nand require a state-wide Minnesota Educational Television Commission which\nwould: insure that these stations effectively serve the educational tele¬\nvision needs of the entire state; give the Minnesota educational community"
}