{
  "id": "d232-98",
  "text": "January 6, 19$3\nDr. Burton Paulu\nKUOM, University of Minnesota\nMinneapolis, Minnesota\nDear Bor tom\nThank you for sending mo a copy of your memo to\nPresident Morrill dated December 22. This is a constructive\npiece which I think should be forwarded to Halph Steetle for\npossible JCET distribution.\nI shall call you either Thursday or Friday while in\nUrbana for specific reaction to two or three tilings. The purpose\nof this quick letter is to bring you up to date on two develop¬\nments. X had a call from Griffiths and Fletcher this morning.\nThey had received copies (how X do not know) of Miles* memo on\nthe proposed TV training project. Two or three statements in\nJim*s communication caused Griffiths and Fletcher considerable\nconcern. They were afraid we were attempting to go around or\nignore the program launched by them under their scholarships,\nfellowships, and internships plan and felt that we were approach¬\ning a far too ambitious undertaking. The attitude expressed\nby telephone represented an abrupt about-face because he had\nnot only requested me to submit a plan fbr a rather extensive\ntraining program during our conversation at Sacramento, he\nmentioned it in a later letter. I had a feeling today that\nFletcher had perhaps put the MbeeM on Griffiths who may or\nmay not have spoken out of school. I had attempted to calm\nthe troubled waters and tried to assure them that we were\nmerely interested in exploring the full needs for TV personnel.\nThey both agreed that we should go ahead with this but hoped\nwe would not ignore the\"plans being made by their own group.\nI shall talk to Wilbur Schramm and Bob Hudson concerning this.\nIn addition to this matter, Fletcher discussed with\nme the NAEB Advisory Committee to the President of the new\nCenter. Dick Hull*s name has been submitted to the Center\nBoard as the educational broadcaster to be named to the Board\nand action will be taken on this nomination at an early date.\nFletcher asked me to request that the Executive Committee of\nNAEB name a four-man Advisory Boqrd who would work with Dick\nHull as an Advisory Committee to the President of the new\nRadio and TV Center. He made it clear that this committee\nwas not to be appointed by the President but was to be named"
}