{
  "id": "d1190-3",
  "text": "University of Oklahoma - Director of Broadcasting is responsible only\nto the President# All departments at the University are invited\nto participate in programs and over 100 faculty members contribute,\nIowa State College - I had no direct testimony on their administrative\nsetup, but I rather gather that Griffith calmly and efficiently\nruns that station..\nUniversity of Michigan- Under Extension Service which has an Advisory\nBoard appointed by the President#\nPROGRAMMING:\nSome rather interesting programs were suggested at the meeting.\nIowa State College operates a radio lending library and has over 2000\nmember. The Radio Director* conducts a survey among these members\neach year, asking each to submit a list of 5 books they'd like\nto have in the library. Each member pays 3 dollars and gets some\n20 stamps entitling that member to 20 bocks. They are allowed to\nkeep a book out for 2 weeks and may renew the same book for an\nadditional 2 weeks b;' mailing ^ on a postcard (which saves post¬\nage) another 3tamp# There is. a fine of 2^ a day for overdue books.\nBooks are read on thi radio by a woman who is paid 3 dollars ada^y\n25 minute program# :5he must read the book over beforehand, editing\nit to eliminate all profanity and liquor scenes# They do not send\nbooks out to the hos/iti ls but sell them old books at 50£ a copy.\nMany people give subscriptions to the Radio Library as Christmas\ngifts. They do not seem to pay any attention to copyrights until\na publisher objects, then they cut books published by that company\noff the ilr for the'future. The station also reviews magazine\narticle/ on the air. Jhe book club is better than self-supporting#\nWisconsin - vUsconsin has excellent scripts in a series called \"Following\nCongr/ss.\" These are oased upon the Congressional Record. You\nmembers can get U copies of an individual program for $1*50. It\nis a very good program# Wisconsin also runs a political forum $\nweeta* before tho prirrary and 3 weeks before the election giving\ntimr to oil parlies on the ballot. So far, there has been no\ndifficulty. The station does not ask for advance copies of the\nscript, there is no censorship, but regulations are laid down in\ne meeting of ail participants beforehand#\nPurdue - Tried out courses on the air (Mechanical Drawing). Enrollment\nfee was 14 dollars In which part was refunded. 200 students were\nneeded, only 10 enrolled. Purdue is planning to read complete\nShakespearean playB, Possibly with a narrator.\nMinnesota - Finds their Convocations good radio material. Informs visit¬\ning speakers in ady&nce1 that their programs are not only to be\nheard in the auditorium, but also over the air. Minnesota also\nmanages '.o include in contracts, with lecturers and musicians, a\nclause stating thao the lecture or concert may be broadcast#"
}