{
  "id": "d1684-1",
  "text": "NAEB NEWS LETTER\nJuly I, 1941\nPage 2\n\"Thank you for your letter and the suggestion that transcriptions\nof the \"Speaking of Liberty” series be made available for non¬\ncommercial radio stations. We have discussed distributing recordings,\nBUT THE EXPENSE, AS YOU KNOW, IS RATHER HIGH, AND MUCH AS WE WOULD\nLIKE TO DO SO, I'M NOT SURE THAT OUR BUDGET WILL PERMIT IT. I WILL\nHOWEVER TAKE THE MATTER UP WITH THE COUNCIL EXECUTIVES AMD SEND YOU\nWORD A LITTLE LATER ABOUT OUR DECISION.”\nNEW FM STATION FOR SAN 01 EGO\nThe San Diego (California) Unified School District has been granted a\nCONSTRUCTION PERMIT BY THE FEDERAL COMMUNICATIONS COMMISSION FOR A\nNON-COMMERCIAL EDUCATIONAL BROADCAST STATION TO SERVE 55 EDUCATIONAL\nUNITS IN THAT AREA. It IS AUTHORIZED TO OPERATE ON 42,300 KILOCYCLES,\nWITH I KILOWATT OF POWER, EMPLOYING FREQUENCY MODULATION (FM).\nThe San Diego school system intends to utilize this service to advance\nits educational program by rebroadcasting to SPECIFIC classes or schools\nRECORDED TALKS, PLAYS, MUSICAL PROGRAMS AND EVENTS OF AN EDUCATIONAL\nOR HISTORIC NATURE, PROVIDE THE VARIOUS SCHOOLS WITH TALKS, PLAYS,\nMUSICAL PROGRAMS, AND OTHER SPECIAL ACTIVITIES AS PRESENTED BY CLASSES\nIN THE SCHOOL SYSTEM, AND, INCIDENTALLY, TO TRAIN STUDENTS IN THE\nFIELD OF RAOIO COMMUNICATION.\nThe cost of the system is estimated at slightly more than $6,000. It\nIS PROPOSED TO LOCATE THE TRANSMITTER AT 348 WEST MARKET STREET, SAN DlEGO\nUoKo TO PRESENT KY. MOUNTAIN SERIES ON MUTUAL\nAll of the wealth, tradition and color of the Kentucky mountains and\nITS PEOPLE WILL BE REVEALED IN A NEW SERIES OF WEEKLY THIRTY-MINUTE\nBROADCASTS OVER THE COAST-TO-COAST NETWORK OF THE MUTUAL BROADCAST ING\nSYSTEM, TO BE PRESENTED ON SATURDAYS, 1.00 TO 1.30 P.M. COST STARTING\nJune 7.\nTHE SERIES, ENTITLED \"FROM THE KENTUCKY MOUNTAINS,\" WILL BE A PRESEN¬\nTATION of the University of Kentucky radio studios in Lexington, which\nWILL ORIGINATE THE PROGRAM THROUGH MUTUAL S LEXINGTON AFFILIATE, WLAP.\nCombating the more spectacular impressions o? the Kentucky hills,\nWHICH HAVE BEEN PICTURED AS A RENDEZVOUS OF MOONSHINERS, SNAKE-WORSHIP-\nERS, CHILD MARRIAGES AND FEUDS, THE \"FROM THE KENTUCKY MOUNTAINS\" BROAD¬\nCASTS WILL PICTURE THIS AREA AS IT REALLY IS, SAYS ELMER SULZER.\nNo U. E« A. COMMITTEE ON RAOIO REPORTS\nThe Committee on Radio of the National University Extension Association\nREPORTED TO THE ASSOCIATION THIS YEAR THAT:\nReports from member institutions of the N.U.E.A. as well as from\nNON-MEMBER INSTITUTIONS INDICATE STEADY PROGRESS IN THE FOLLOWING\nFEATURES of educational broadcasting:\nA GREATER EMPHASIS UPON PROGRAM PRODUCTION.\nEstablishment of radio libraries.\nEstablishment of courses in radio broadcasting and its use.\nIncreased use of recordings.\nOrganization of councils for cooperative production of broadcasts."
}