{
  "id": "d1738-2",
  "text": "-11-\nBart Griffith, new Vice-Chairman, is busy planning arrangements for the St, Louis Convex\ntion. Ho has appointed Neal Balanoff of Stephens College as chairman of local arrangements,,\namong which may include a long stop-over at a local brewery. Bari says that he has asked\n^or sessions for R-TV-Film based on the excellent attendance at the Washington Conven\ntion. He encloses a questionnaire which he asks you to fill out and return tc him immedi *\nately.\nSPEECH ASSOCIATION OF AMERICA\nOffice of the Executive Indiana University\nVice-President January 1L, I960\nFederal Communications Commission\nSecretary, Mary Jane Morris\nWashington 25, D. C,\nGentlemen:\nThe Speech Association of America, an organization of over 7,500 members, drawn from\nuniversity, college, and secondary school faculties, represents broad interests in radio\ntelevision, public address, theatre, and speech correction, By action of the Administrative\nCouncil on December 30, 1959. the Association designated the Executive Vice-President to\npresent a statement on its behalf to the Federal Communications Commission, relative to\nDocket No. 127B2, Order for Investigatory Proceeding, adopted February 26, and amended\nNovember 9, 1959,\nI. INTRODUCTION\nThe Speech Association of America deplores the failure of the radio-television Indus\ntry to provide balanced programming worthy of an educated and democratic society. The\nIndustry has failed to live up to its potentiality as an agency for disseminating knowledge,\nincreasing public awareness of crucial issues of the day, or improving the public taste in\ndrama. Even as a medium for entertainment, radio-television too often fails to meet the\nreasonable standards of enlightened audiences, instead, the industry's twenty-one inch image\nof man projects a callous contempt for human life, maudlin sentimentality, and brutality.\nExaggerated and misleading advertising is common currency on the networks and encourages a\ncynical attitude toward truth and weakens public faith in the integrity of the spoken word.\nThus radio-television, instead of fostering social, intellectual, and moral values,, en\ncourages the public to expect violence and deceit as commonplaces of human behavior,\nII. ANALYSIS\nBroadcasting, especially’' television„ is comparatively young* We have been witness m\na brief span of years to its technical development, its expansion of programming -including\nsome of very high calibre, and its acceptance in the American home as a carrier of adver*\ntising and other persuasive messages. We are now entering, however, an era of evaluation,\nand are questioning whether the time is not at hand when we might exp>ect maturity from the\nindustry, and the provision of those services, other than commercial and technical, for\nwhich the pioneering broadcasters and legislatures held high hopes.\nRecent Congressional investigations of the broadcasting industry and the studies by\norganizations of private citizens have identified apparent weaknesses in the structure of"
}