{
  "id": "d1738-4",
  "text": "-13-\nIII. RECCMMENUATIONS\n1. There should be more careful screening of applicants for frequencies and channels\nin the spectrum. Licensees should be selected on merit alone, once the Federal Communica¬\ntions Commission is satisfied that economic qualifications are met* As a guide to prospec¬\ntive applicants, the Commission should set forth more specific rules for balanced program¬\nming.\n2. The regulatory function of the Commission should be more widely publicized, and\nthe Commission should actively solicit comment from the public about broadcasting practices.\nFor example, all renewal hearings should be held in the area of the station under considera¬\ntion, and careful Commission checks of programming promises and fulfillment should be\nsupplemented by testimony from interested representatives of the public.\n3. The Communications Act should be amended to give the Federal Chm .nications Com¬\nmission the power to license and regulate networks as well as individual atatlona. The Act\nshould further be amended to define adequately the role of the Commission in judging and\nregulating progranming and advertising both on the networks and on individual stations.\nThe Act should also empower the Commission to revoke licenses in cases where stations or\nnetworks abandon their program responsibilities in favor of advertisers, agencies, and in¬\ndividual program packagers, and where this results in sub-standard programming.\n4. The Commission should support directly, and encourage commercial broadcasters to\nsupport, the educational broadcasting movement,, A nationwide educational broadcasting\nservice should be available to every home in the nation.\n5. Congress should provide additional funds to enlarge the staff and expand the\nfacilities of the Commission and to raise the salaries of commissioners. Only with an ex¬\ntensive and competent staff can any of the preceding recommendations successfully and\npromptly be effected.\nIV. CONCLUSION\nIt is our conviction that the viewing public is well aware that a station or a net¬\nwork—when it chooses to accept responsibility and display initiative in sound progranming\nand ethical advertising—can provide superior programs that will be acceptable both to the\naudience and to the advertiser. What is needed to insure that stations and networks will\naccept that responsibility is a firm and guiding hand from the Federal Communications\nCommission, the public guardian of the people's air waves. The Speech Association of America\nbelieves that the incorporation of the above recommendations will provide the Commies on\nwith appropriate and necessary authority.\nRespectfully submitted.\nJ. Jeffery Auer\nNote: the above statement was written by these\nofficers of the Speech Association of America:\nJ. Jeffery Auer, Executive Vice-President* Robert\nG. Gunderson, Vice-Chairman, Rhetoric and Public\nAddress Interest Group; James E„ Lynch, Chairman,\nRadio-Television-Film Interest Group Herbert A.\nSeitz, Advisory Committee, Radio-Television-Film\nInterest Group."
}