{
  "id": "d228-15",
  "text": "Copy sent to Dr. W. Stone 2/16/62\nj THE OHIO STATE UNIVERSITY\nx.. TELECOMMUNICATIONS CENTER\n2470 NORTH STAR ROAD\nCOLUMBUS 21, OHIO\nRichard B. Hull, Executive Director\nFebruary 9, 1962\nEditor\nNEWSWEEK\nNewsweek Building\n444 Had I son Avenue\nNew York 22, New York\nDear Sir:\nAs a long-time admirer of Raymond Holey1* PerspectIve and’as a manager\nof commercial and educational broadcasting stations for/twenty-five\nyears, I was astounded at the factual errors and^nistaken conclusions\non educational television legislation which a^peansd m the article,\n\"School Aid in a New Dress\" (Perspect iv^^JanuerW 29/ /j962} .\nFor example: H. R. 132 would\nAssignment of television chi\nthe Federal Communicat i^s\nThe bill simply\nequipment by educj\nUSOE control. Pi\nmay and do parti\nThe bill is not\nHouse interstate\nhefs available to education.\"\nssionaJ^Sower delegated to\n\"\"the U, S. Office of Education,\nor the purchase of television\nlate and local authority, not\nexcluded from benefits since they\nr6fit community television organlzations.\"\njkre of the USOE, but a product of Senate and\n_ Sign Commerce Committees. The bill is a bi¬\npartisan measure endorsed by leaders In both parties. First introduced\nby Senators Bricker (R. Ohio) and Hagnusson (0. Washington), the bill did\nnot pass unnoticed but has been reviewed In extensive public hearings\nover a three year period In both Houses of the Congress.\nThe suggestion that the growing list of U. S. educational television\nstations (whose total is 65 and not 54) would be subject to USOE control\nis sheer fantasy. These stations, like their commercial counterparts,\nare protected against censorship or program control by outside agencies\nunder the Communications Act of 1934.\nHr. Holey*s lack of information on the technical aspects of this legisla¬\ntion and of television regulation is paralleled by his observations on\nthe recently released educational television report of the USOE Hedia\nPanel which, he alleges, revealed how the USOE would tell states and local\nagencies **what to teach.\" As the former chairman of this panel, a citizen\ngroup composed of business men, educators and engineers, which served\nunder two national administrations, I am forced to conclude in this par¬\nticular instance that Hr. Holeyls sources of information are biased or\ncompletely inadequate.\nTeaching Aids Laboratory • Office of Seminars and Workshops • Ohio School of the Air • Video Recording • WOSU—WOSU-FM—WOSU-TV • Closed Circuit TV"
}