{
  "id": "d228-40",
  "text": "issued by\nAMERICAN COUNCIL\nON EDUCATION\n1785 MASSACHUSETTS AVE., N. W.\nWASHINGTON 6, D. C.\nMarch l6, 1962\nHouse Approves By a rollcall vote of 337-68 the House of Representatives on\nETV Bill, Limits March 7 passed HR 132, introduced by Representative Kenneth\nGrant Recipients Roberts (D-Ala.), to provide $25 million in matching grants\nto governmental and private, non-profit agencies for the\nconstruction of educational television broadcasting facilities. (See also this Bulletin,\nVol. XI, Ho. 9)\nAmendment Limits Usefulness of Bill--While HR 132 passed the House substantially as re¬\nported from the Committee on Interstate and Foreign Commerce, the House adopted by a non¬\nrecord teller vote of 69-66 an amendment offered by Representative Robert Griffin (R-Mich.)\nto strike from the bill any authorization for non-profit community educational television\norganizations to receive grants for construction of educational television broadcasting\nfacilities. As passed with the Griffin Amendment, HR 132 would now make grants availa¬\nble to:\n\"(A) an agency or officer responsible for the supervision of public elementary or\nsecondary education or public higher education within that state, or within a political\nsubdivision thereof, (B) the state educational television agency, (c) a college or uni¬\nversity deriving its support in whole or in part from tax revenues, or (D) a non-profit\norganization consisting solely of entities referred to in the preceding clauses of this\nparagraph and which is organized solely to engaged in educational television broad¬\ncasting. 11\nIn the debate on his amendment, Mr. Griffin explained that its intention was to pre¬\nvent business or labor organizations from getting control of educational television\nfacilities by their participation in community, non-profit educational television\norganizations. He also suggested that in getting the program underway it would be\nbest to limit it to educational institutions.\nSpeaking against the amendment, Representative Oren Harris (D-Ark.), Chairman of\nthe House Interstate and Foreign Commerce Committee, pointed out that the Griffin\nAmendment would deny funds to community educational television organizations such as\nare now in operation in San Francisco, Jacksonville and St. Petersburg, Fla., Chicago,\nBoston, Detroit, Minneapolis, St. Paul, Cincinnati, Toledo, Pittsburgh, Memphis, and\nWashington, D. C. In its present form, the Griffin Amendment limits the provisions\nof HR 132 to public educational institutions or to agencies established by public edu¬\ncational institutions. There was no record vote on the Griffin Amendment, since HR 132\nwas debated as a committee amendment in the form of a substitute rather than as an\noriginal bill.\nConference with Senate Requested--In the first session of the 87th Congress, the Senate\npassed S 205, introduced by Senator Warren Magnuson (D-Wash.), authorizing grants of\n$1 million to each state for construction of educational TV. No matching would be re¬\nquired for these grants, but they would be made only to the state educational agency,\na state educational television commission, or to state-controlled colleges or universities.\nThe House has substituted its version of HR 132 as amended for the text of S 205\nand requested a conference with the Senate to resolve the differences between the two\nbills. House conferees will be Representatives Oren Harris (D-Ark.), Kenneth Roberts\n(D-Ala.), Morgan M. Moulder (D-Mo.), John E. Moss (D-Calif.), William L. Springer\n(R-Ill.), Arthur Younger (R-Calif.), and Paul F. Schenck (R-Ohio."
}