{
  "id": "d228-84",
  "text": "\"(f) If, within ten years after completion of any\nproject for construction of educational television broad¬\ncasting facilities with respect to which a grant has been\nmade under this section—\nM(l) the applicant or other owner of such facilities\nceases to be an agency, officer, institution,\nfoundation, corporation, or association described in\nsubsection (a) (1), or\n\"(2) such facilities cease to be used for educational\ntelevision purposes (unless the Secretary determines,\nin accordance with regulations, that there is good\ncause for releasing the applicant or other owner from\nthe obligation so to do),\nthe United States shall be entitled to recover from the\napplicant or other owner of such facilities the amount bearing\nthe same ratio to the then value (as determined by agreement\nof the parties or by action brought in the United States\ndistrict court for the district in which such facilities are\nsituated) of such facilities, as the amount of the Federal\nparticipation bore to the cost of construction of such\nfacilities.\n\"RECORDS\n\"Sec. 393. (a) Each recipient of assistance under this part\nshall keep such records as may be reasonably necessary to\nenable the Secretary to carry out his functions under this\npart, including records which fully disclose the amount and\nthe disposition by such recipient of the proceeds of such\nassistance, the total cost of the project or undertaking in\nconnection with which such assistance is given or used, and\nthe amount and nature of that portion of the cost of the\nproject cr undertaking supplied by other sources, and such\nother records as will facilitate an effective audit*\n\"(b) The Secretary and the Comptroller General of the\nUnited States, or any of their duly authorized representatives,\nshall have access for the purpose of audit and examination\nto any books, documents, papers, and records of the recipient\nthat are pertinent to assistance received under this part.\n-4-"
}