{
  "id": "d228-89",
  "text": "AUTHORIZATION OF APPROPRIATIONS FOR CONSTRUCTION GRANTS.--\nIn recognition of the urgent need for the construction of\nadditional educational television broadcasting facilities the\nconference agreement authorizes the appropriation for fiscal\nyear 1963 and the 4 succeeding fiscal years of not to exceed\n$32 million, In the aggregate, for construction grants. The\nHouse amendment had authorized the appropriation of not to\nexceed $25 million while the Senate bill authorized the\nappropriation of not to exceed $51 million for the making of\nsuch grants.\nIf sufficient applications are submitted and approved to\nutilize available funds authorized by the conference agreement,\nnumerous additional educational television broadcasting\nfacilities will be constructed because of the requirement that\nthese Federal grants must be matched.\nThus, it is expected that the Federal funds authorized by\nthe conference agreement will be effective in providing a much-\nneeded initial momentum to get this large and badly needed\nexpansion program underway at the earliest possible date.\nIn order to assure proper coordination of construction of\neducational television broadcasting facilities within States\nwhich have established State educational television agencies,\napplicants for construction grants within such States are\nrequired to notify the agency of each application for a grant\nwhich is submitted by them and the Secretary of Health,\nEducation, and Welfare, in turn, is required to advise the\nagency of the disposition of each such application.\nADMINISTRATION.— The conference agreement places the\nadministration of the program in the Secretary of Health,\nEducation, and Welfare. The House amendment placed the admin¬\nistration of the program in the Commissioner cf Education.\nThe conferees placed the responsibility for the execution\nof this program in the Secretary of Health, Education, and\nWelfare rather than in an office or bureau of the Department of\nHealth, Education, and Welfare, because of the realization that,\nif the relatively small program provided for by this legislation\nis to be carried out speedily and effectively, it must be given\nproper priority among the many other important and far-reaching\nprograms which are now administered by the Department of Health,\nEducation, and Welfare. Under no circumstances should this\nprogram be subordinated to or tied in with other Federal\nprograms in the field of education. This could only result in\nunavoidable delays which would prevent the achievement of goals\nwhich the conferees seek to accomplish by this legislation.\nThe execution of this new program will quite likely involve\nthe establishment of policies and the rendering of decisions for\nwhich ready precedents may not be available. By placing the\nresponsibility for the execution of this program in the Secretary\n-9-"
}