{
  "id": "d1621-2",
  "text": "r* NAEB NEWS LETTER. . . . . . --...(..PaqE 3,....,,.,,.,AueuST I, f 944\nSTATIONS COMMAND IN THE PRESENT MARKET INDICATES THE SELLERS MAY SE PRO¬\nFITING FROM THEIR LIEN.ON A RADIO FREQUENCY WHICH THEY HAVE BEEN AUTHOR¬\nIZED TO USE UNDER THE COMMUNICATIONS Act OF. 1934, BUT WHOSE OWNERSHIP\nUNDER THE AqT IS RESERVED TO THE PUBLIC.\nChairman Fly’s letter which cites several such recent transfers of radio\nFACILITIES, FOLLOWS IN PART S\nmThe Congress has had before it proposals to limit the amount of\nconsideration to the value of the PHYSICAL PROPERTIES \\OF RADIO\nstations) transferred but no provision of this character has\nBEEN ADOPTED o The STATUTE DOES MAKE EAR THAT THE FREQUENCI E S\nARE NOT IN ANY WAY THE PROPERTY OF THE LICENSEES. IHE COMMISSION\nHAS REJECTED AND IS PREPARED TO REJECT AMY TRANSFER WHICH ON ITS\nFACE INVOLVES A CONSIDERATION FOR THE FREQUENCY e THE COMMISSION,\nAPPARENTLY CONStSTANT WITH CONGRESSIONAL POLICY, HAS APPROVED\nTRANSFERS THAT INVOLVE GO ING-CONCERN VALUES, GOOD WILL, ETCo\n. There remains, however, a serious question of policy and one on\nWHICH THE LAW IS NOT CLEAR, AS TO WHETHER THE COMMISSION SHOULD\nAPPROVE A TRANSFER WHEREIN THE AMOUNT OF THE CONSIDERATION IS\nOVER AND BEYOND ANY AMOUNT WHICH CAN BE REASONABLY ALLOCATED TO\nPHYSICAL VALUES PLUS GO 0NG—CONCERN AND GOOD WILL, EVEN THOUGH THE\nWRITTEN RECORD DOES NOT ITSELF SHOW AN ALLOCATION OF A SUM FOR\nTHE FREQUENCY. OyR CONCERN IN THIS REGARD IS HEIGHTENED BY THE\nTREMENDOUSLY HIGH PRICES WHICH RADIO STATIONS ARE COMMAND NG IN\nTHE PRESENT STATE OF THE MARKET. THIS IS ILLUSTRATED 3Y THE FACT\nTHAT ONE LOCAL STATION WAS SOLD FOR A HALF-MILLION DOLLARS AND\nSOME REGIONAL STATIONS ARE SELLING FOR A MH.UON OR MORE*\nft is the Commission’s policy to disapprove of transfers which\nOBVIOUSLY REPRESENT THE ACTIVITIES OF A PROMOTOR OR BROKER, WHO\nIS SIMPLY ACQUIRING LICENSES AND TRAFFICKING IN THEM. UNDER THE\nPRESENT STATE OF THE LAW, HOWEVER, IT SS NOT CLEAR THAT THE COM¬\nMISSION HAS EITHER THE DUTY OR THE POWER TO DISAPPROVE OF A TRANSFER\nMERELY BECAUSE THE PRICE I! S INORDINATELY HIGH - EVEN THOUGH IT MA*\nWELL BE DEDUCED THAT A SUBSTANTIAL CALUE IS PLACED ON THE FREQUENCY o\nli ABSENCE OF A CLEAR CONGRESSIONAL POLICY ON THIS SUBJECT, WE\nTHOUGHT BEST TO DRAW THE MATTER TO THE ATTENTION OF YOUR OWN COM-\nMITTEE AND THE HOUSE COMMITTEE ON INTERSTATE AND FOREIGN WDMMERCEo\n—Schools v"
}