{
  "id": "d916-16",
  "text": "RADIO STATION\n91.7 MC\nWHOM\nUNIVERSITY OF MICHIGAN\nWALDO ABBOT. DIRECTOR OF BROADCASTING\nANN ARBOR. MICH.\nDecember Ilf, 1953\nE. G. BURROWS, program director\nMr, Graydon Ausmus, President\nNational Association of\nEducational Broadcasters\nBox 2002\nUniversity, Alabama\nDear Graydon:\nI have just returned from a 10 day trip to Florida which\nI made on a yacht on the Inland Waterway. It was a wonder¬\nful experience and I think that you would have enjoyed the\nflora and the sunshine of the trip.\nOn my return this morning I find your letter of December if,\nrelative to the Acceptance Committee. I read it over once\nand I think it is an excellent listing of the duties and\nresponsibilities of the Acceptance Committee. I am rather\nsorry that your letter makes neither Miles nor Sulzer avail¬\nable for the committee but 1*11 try to think up some sub¬\nstitutes. I picked those two because they are rather\nconveniently located to Urbana and I felt that the expense\nof bringing the committee together would not be so great.\nI don*t want to suggest anybody from the school broadcast\ngroup because they have their own types of programs rather\nthan the adult programs that we judge for the Acceptance\nCommittee. Of course, a small committee is easy to work\nwith but on the other hand it is quite a responsibility to\nselect programs for the Tape Network and I don*t want anyone\nto say, \"that the three members who are doing that acceptance\nare exerting a great a great deal of authority—more than\nthey deserve.\" That is a criticism that we had when Holt\nwas doing the whole selecting job. Ifd rather just have\nthree members because you can get things in. What would\nyou thinkg of adding to the three that we now have, myself,\nDawson and Harley, somebody like Camille Halyard, or\npossibly Robert Higgy of WOSU. Keep it small and I»11 abide\nby your decision, naturally.\nAnother thing in favor of a small committee is that there\nwould not be the travel expense to meet at Headquarters with\nSkornia and Holt. Also I»m rather curious about this\ncommittee because in the past I received communications from\nHolt, listing myself. Buck, Salley, Dawson, Harley, Siegel\nand you, all as members of the committee. I can understand\nhow Siegel and you can be ex officio members but I don*t"
}