{
  "id": "d916-2",
  "text": "C0I2\nThe City of New fork\nMUNICIPAL BROADCASTING SYSTEM\nJanuary 29, 1953\nMr* Frank Schooley\nUniversity of Illinois\nUrbana, Ill*\nDear Frank:\nI under that you are now in control of the Network and I am therefore making a\nbrief report on the up-coming available programs from Hadiodiffusion Francaise.\nI am enclosing herewith a list of the complete French plays by the Comedie Frapcaise\ntogether with the timings* Three of these have already arrived and the other ton\nare being forwarded. Each program opens with a presentation by Tauchard, the\nDirector of the Comedie Francaise in English. He explains what the playis about cad\nwhat the scenes are. thereafter the show is in French.\nI need not indicate to you that this is the top dramatic group in France and the\nplays represent the best of French literature.\nI am also enclosing a list of one-hour programs on contemporary French music\nwhich have been made expressly for NAEB. Thiols considered a remarkable series\nbecause it is designed to inform listeners on the work being done by contemporary\nFrenchcomposers, and the background material was obtained from the composers chem-\nselves. The latter explain their compositions, describe the influences they have\nundergone and explain thQir composition with the latest innovations* Their re¬\nmarks are illustrated with their own choice and when they are not played by the\ncomposers themselves they are played by Franco’s finest artists. The continuity\nin French runs approximately 10 minutes in interview form. I am told that the ser¬\nies is very well produced and represents the cream of the present-day musical\noutput.\nIn addition to these two series there is up-coming seven half-hour programs in\nEnglish on the life and work of Victor Hugo, and sis half-hour programs on the\nlife and works of Honors de Balzac.\nI on not writing to you at this time concerning -the International University\nof the Air series on \"Energy and Civilization\" end \"Genetics.\"\nI will also write to you further concerning the new Radio Italians, programs which\narc on their way.\nWith all best wishes, believe me.\nCordially yours,\n/signed/\nsns-lg\nSeymour N. Siegel\nDirector"
}