{
  "id": "d916-35",
  "text": "msisi®s«yswi\nMstesUSS\nThe H&EB Tap® Mwk is the most important# the most ‘vital function of the\nHaSB» It brings a real sendee to every jnenfcer station® ^hlle we have had a few\nstations withdrawing this year because of the high oost of the sendee# they are\ngreatly in the minority® In order to zasdntain oar E^mborship# and to increase it#\nson® changes should be made both in the selection of program and in the rules and\nregulations of the Tape Network*\nThe Fall Program Offerings for 1953 are a ease in point® They are nighty\nthin® For ©sample# in Package #39# four hours of Hisie From Ioterlochen are\noffered® These should have been divided# with pert offered during the stssaar and\npart in the fall® Cbe fourth of the entire offering was music *— all from one\ninstitution® This is badly balanced# and shows a lack of consideration for variety\nIn the same offering was a series of plays in a foreign language® Such pro**\ngrams are acceptable for use in language classes — but do not attract adequate\naudiences to warrant their national offering by the Network®\nThe other five offerings ware continuations of previously used programs*\nNothing new# nothing startling® Good programs# but routine®\nIssue #40 offered French Music Festivals# %ys of Ifehkind# and the Payne\nCocosunioation Award programs® tfely $g& jg£ tlysg qradncad Jgjjr jg naeb\nsta|ifln® To quote from the Statement of Purposes\"of the MKB Tape Networks \"The\nTap© Network shall provide for* (l) the Interchange mcmg member stations of\nprogram© jjsm tfoemafllBaa produce® This is done to provide a wider range of\nprogram material# to stimulate the xqpgrsding of local program standards# and to\nencourage the production of broadcasts in nosded subject areas®0\nBoring the past six months# less than one-half of the network offerings have\nbeen produced by member stations®\nIt is a source of pride to a member station to have one of its programs\naccepted for the MSB Tap© Network® Too constant rejection of such programs will\ndiscourage stations from submitting proposals® Mhen the Educational Center takes\nover the FAS productions«— Votes of Europe# tfeys of Mankind# the Jefferson\nseries — and when stations also begin receiving foreign programs from the inter**\nnational information services# we will have nothing to fall back on if the MSB\nmember stations don't submit proposals® If we do not have active contribution and\nparticipation by our own group# the MEB will have lost a very vital function*\nIn this connection# I personally received nine audition tapes from the MSB#\nall submitted by member stations# during the past summer* I was given a very few\ndays to vote on them® 1 voted favorably xmon all# with reservations concerning\njust one® But the headquarters staff put only one of these programs on the Fall\noffering list® How did the other members of the Acceptance Committee vote on these\nprograms? Bid they nJJ, vote unfavorably? 1 ask this because I have sever been in»\nformed concerning the vote of the members of the Acceptance Coasdttee on any single\nproposal* Or did MSB headquarters simply dismiss our vote?"
}