{
  "id": "d723-117",
  "text": "Hr. Marvin D. Miller\n- 2 -\nOctober 2, 1956\nActive members paying an additional Network Fee. These programs are distri¬\nbuted by means of tape recordings and are basically for adult audiences.\nHowever, programs are also provided for in-school use. (See assessment in¬\nformation below for charges for these services.)\nDues for Active membership in the MAEB are based on rated transmitter power\nof the member, as follows:\nClass A - 5 kw and over - 150.\nClass B - 1 to 4.9 kw - $25\nClass C - Less than 1 kw - $L5\nAs I mentioned above, Network fees, if you desire to use its services are\nadditional. IXie to recent action by the NAEB Executive Committee, ve are\nable to allow new members to take three years to reach the full Fee (which\nis that fee Indicated for the third year in the table below). Therefore,\nNetwork Fees, also based on transmitter power (as above), are as follows\nfor the new stations:\n1st, Year,\n$400.00\n250.00\n150,00\n$600.00\n375.00\n225.00\nClass A\nClass B\nClass C\n500.00\n300 00\nAs mentioned above, there is a slight additional fee for the in-school ser¬\nvice if the station elects to use it too. This is one-fourth of the regular\nfee, or $2.00 per reel used by the station, whichever is less. Several of\nour stations do not operate during the summer months and they are permitted\nto take the regular offerings during three quarters of the year, plus the\nin-school offering, without the payment of any additional fee for the use of\nthe in-school programs.\nYou will notice that the annual Network fee amounts to a very small charge\nper hour of programming received — approximately 38£ for the first year\nfor a small station like yours. — although ve do not permit stations to be\nbilled at an hourly rate for programs used; they must pay the entire annual\nfee, because we wouldn*t be able to operate the Network at these low fees\nin any other manner.\nIn addition, stations must pay postage for tapes received from, and shipped\nback to, the Network. For a station in your locality this will amount to\napproximately $120.00 a year, if you use approximately all of the tapes\navailable."
}