{
  "id": "d723-121",
  "text": "Mr. R. H. Lunday\nSeptember 8, 1955\nstation, whichever is less. Several of our member stations, operated\nby school systems, do not operate during the summer months. They are\ntherefore permitted to take the regular offerings during three quar¬\nters of the year, plus the in-school offerings, without the payment\nof an additional fee for the use of the in-school programs.\nYou will notice that the annual assessment fee amounts to very small\ncharge per hour of programming received (Approximately: Class A - Si.00,\nClass B - $.63, Class C - $.38, for the first year), although we do\nnot permit stations to be billed at an hourly rate for programs used —\nthey must pay the entire annual assessment whether they use all or only\na part of the offerings made by the Network.\nIn addition, stations must pay postage for tapes received from, and\nshipped back to, the Network. For a station in your locality this\nwill amount to approximately $120.00 a year, if you used approximately\nall of the tapes made available.\nFour times a year, on a quarterly basis, member stations subscribing\nto the Network service are sent an \"offering” showing what programs\nwill be offered by the Network during the ensuing 13 weeks. 'I am en¬\nclosing a copy of the latest offering for your information.) The sta¬\ntions then indicate which program series they want to receive. This\norder form is returned to Headquarters and tapes are shipped weekly,\ntwo or three weeks in advance of broadcast dates.\nAfter the stations have used the programs they may either return the\ntapes to us, or if they want to keep a certain program in their files,\nthey may return any good tape and get credit. We keep records of all\ntapes shipped to stations and those returned and can tell at all times\nhow many tapes a given station owes us.\nI believe the material I sent last /pril will give you a good idea of\nthe other NAEB services and the materials and publications made avail¬\nable to members whether or not they subscribe to the Network service.\nIf you have any further questions, please do not hesitate to let me\nknow, and we would be more than happy to consider your application for\nmembership.\nSincerely,\nHEH:cr\nEnc. 2\nHarold E. Hill\nAssociate Director"
}