{
  "id": "d723-144",
  "text": "December 11, 1956\nHr. William King\nState Coordinator of ETV\nDepartment of Education\nState House\nTrenton, New Jersey\nDear Mr. King:\nWe are very pleased to see that your department of education has been granted\na CP for a new educational television station. The forces of educational\nbroadcasting are growing stronger every day, and, as the association of\neducational stations in the United States, we feel that you will be interested\nin learning something about our organization and the services it provides to\nmembers. Incidentally, more than 90% of all educational radio and television\nstations in the United States belong to the NAEB (including all the ETV sta¬\ntions now on the air).\nI am enclosing some materials which will give you more general details about\nthe Association, and under separate cover am sending samples of the reports,\nsurveys and other services we regularly make available to member stations.\nAnnual dues in the Association (both current and those approved by the member¬\nship for 1958) are shown on the enclosed schedule.\nThe great majority of workshops and seminars sponsored by the ' AEB in recent\nyears have been in the area of television. We have conducted three educational\ntelevision Production Workshops, two TV Engineering Workshops, a TV Station\nManagement Seminar, a Serainar to \"clarify and appraise the contribution that\neducational television stations can make to the service of the American people,\"\nand have awarded nearly 100 scholarships to persons engaged in educational\ntelevision to permit them to attend regular institutional workshops and academic\nsessions. All of these projects have been designed to enable personnel at NAEB\nmember institutions to increase their professional abilities, and at little or\nno cost to such personnel or the institutions. This past summer we held a TV\nUrogram Planning Seminar and a TV Staging and Lighting Workshop, and we have\nexpanded our ETV scholarship program as evidenced by the enclosed announcement\nof this year's scholarship awards (now already awarded).\nIf, during the course of the next year before you get your station on the air,\nyou need Engineering advice, our TV Engineer, Mr. Cecil Bidlack, will be glad\nto come to Trenton to help or advise you, at no expense to your organization."
}