{
  "id": "d723-18",
  "text": "Mr. H. E. Williams\nFebruary 20, 1956\n—2—\nscale has been set up whereby new stations do not pay the full fee until\nthe third year. Annual Network assessments are based on the same power\nclassifications as membershipt\nClass A\nClass B\nClass C\n1st year\n1400.00\n250.00\n150.00\n2nd year\n$600.00\n375.00\n225.00\n3rd year\n1800.00\n500.00\n300.00\nIn addition, member stations must pay postage both ways on tapes shipped\nto and from the Network. For a station in your area this would amount\nto approximately $27.50 a year if you availed yourself of all the pro¬\ngrams made available by the Network. (There is a strong possibility that\nthere will soon be Congressional action to lower rates for educational\nrecordings, which would make postage payments considerably lower.) Even\nwith the postage charges you see that the cost per hour of programming\n(for 400 hours, or more) is very low.\nIn addition to the regular Network service described above (a sample Net¬\nwork offering is included in the material being sent separately), we make\navailable in-school programs to those stations who do in-school broadcasting.\nFor this service a station pays an additional fee of one-fourth of the\nregular assessment, or $2.00 per real, whichever is less. However, since\nmany in-school stations are not on the air during the stunner months, such\nstations are allowed to substitute the in-school programs for regular pro¬\ngrams they would receive during the summer, and thus pay no additional fee\nfor the in-school service.\nRegarding your request for the name of a consulting engineering firm to help\nin filing your application with FCC, we are suggesting the following since\nthey are geographically closer to you. This may mean a savings since no\ndoubt travel to Walnut Ridge would be involved. The firms are:\nA. Earl Cullum, Jr. Everett L. Hillard\nInwood Post Office Comnercial Radio Equipment Co.\nDallas 9, Texas P.0. Box 7037\nKansas City, Missouri\nBoth of the above firms are members of the Association of FCC Consulting\nEngineers. We Suggest that you write to them for an estimate of their\ncharges for the services you require. If you would prefer someone located\nin Washington, D. C, we refer you to the Broadcasting-Telecasting Yearbook\nor the Professional Directory of any issue of this magazine.\nIf, after you’ve had an opportunity to look over the materials I’m send¬\ning, you have any questions about the NAEB, please let me know, and we’re\nlooking forward to the opportunity of serving you.\nSincerely,\nHEHjjy\nEnclosures 3\n9*1,\nHarold E. Hill\nAssociate Director"
}