{
  "id": "d723-39",
  "text": "1956\nApril 2h,\nMr. Hariy Wilklow\nPortage Township Schools\nPortage, Michigan\nDear Mr. Wilklow:\nDr. Skomia has asked me to reply to your letter of April 17, in which you\nrequested information which might be helpful to you in planning a 10-watt\nFM operation.\nIn the attached envelope I am sending some materials which I believe will\nbe helpful, and I trust that the following answers to your specific ques¬\ntions will be of some value.\nThe only manufacturer still making 10-watt FM transmitters is the Gates\nRadio Company, Quincy, Illinois. The price of this transmitter is 1295*\nAntennas vary in cost from $50 for a single bay (with a gain of 0.8) to\n$1150 for four bay antenna (with a gain of 3.8). Of course, any tower you\nneed to mount the antenna on will be an additional cost and will depend\non what you decide you need. There will also be the cost of the trans¬\nmission line from the transmitter to the tower.\nOther equipment you might need will depend greatly on the type and extent\nof your programming. However, you will need microphones, a speech input\nsystem of some sort, transcription tumtables(s), monitoring loudspeak¬\ners, and possibly a tape recorder. Microphones range in price from $50\nto $150; speech input consoles from $925 up; speakers, $30 up; transcrip¬\ntion turntables, $275 up; and tape recorders, $600 up. All of this is for\nprofessional type equipment.\nYour station will have to be licensed by the Federal Communications Com¬\nmission. All requirements are given in Part 3, FCC Rules and Regulations\nConcerning Radio Broadcast Services, January, 1956 edition. This may be\nobtained for $1.50 from the United States Government Printing Office,\nWashington 25, D. C.\nThe transmitter may be operated by students holding a Radiotelephone Third\nClass Operator*s permit, however ttiey may perform only the following func¬\ntions:\n1) Turn transmitter on and off\n2) Make external power supply adjustments\n3) Make external adjustments to insure modulation within the limits\nrequired."
}