{
  "id": "d723-40",
  "text": "Mr, Harry Wilklow\nPage 2\nApril 2k9 1956\nIn the event that the above adjustments are not effective in brihEPny\ntransmitter into proper operation, the third class operator must turn the\ntransmitter off.\nAny otter maintenance upon a 10-watt transmitter may be performed by a\nradiotelephone second or first class operator or a radio telegraph second\nor first class operator. He need not be in regular, full-time employment\nby the station, but may be employed to maintain the equipment and super¬\nvise its operation.\nSeveral of the smaller educational stations use students in nearly all\ncapacities - as engineers, announcers, writers, etc., but it is wise to\nhire as large a professional staff as your budget will permit, at least\nin supervisory capacities.\nI regret that we do not have on hand at this time any program schedules\nfrom 10-watt stations, but there are several 10-watters in Illinois, Indi¬\nana and Michigan, so I have listed these below in case you should want to\nwrite to them for program schedules or other suggestions:\nWNIC, Northern Illinois State College, DeKalb, Illinois, Robert\nEsmond. Director, Radio-TV\nWEPS, Elgin High School, Elgin, Illinois, E, H. Hoke, director of\nRadio Education\nWNUR, Northwestern University, Evanston, Illinois, Donley Feddersen,\nChairman, Dept, of Radio-TV\nWOVE, School City of Gary, Indiana, Edwin Carmony, Supervisor, A-V\nEducation, $2h Garfield Street\nWORE, DePauw University, Greencastle, Indiana, Herold Ross, Station\nManager\nWVSH, School City of Huntington, Indiana, M. McCabe Day, Director\nWWHI, Wilson Junior High School, Muncie, Indiana, John Maier, Director\nWYSN, New Castle-Henry Township High School, New Castle, Indiana, Miss\nJuanita Rucker, Director\nWSKS, School City of Wabash, Indiana, James Oliver, Director, A-V Education\nWRPR, School District of Highland Park, Michigan, Second and Glendale\nAvenue, Robert Stevens, Program Director\nOf course, we sincerely believe that one of the most profitable moves an\neducational station can take is to join the NAEB. And no programming is\nso inexpensive as that obtained from the NAEB Radio Network. Therefore,\nwith your permission, ^ should like to tell you something about the NAEB,\nits activities and services. In the attached envelope I have enclosed\nsome materials which will tell you more about our organization and a few\nsamples of the types of reports, surveys, etc., we make available to the\nmembers."
}