{
  "id": "d723-41",
  "text": "Mr. Hariy Wilklow\nApril 2ii, 1956\nAnnual dues in the Association, including a subscription to our monthly\nNewsletter and the above mentioned materials, are based on rated trans¬\nmitter power, as follows:\nClass A - 5 kv and over - $50.00\nClass B - 1 - U.9 kw - 25.00\nClass C - Less than 1 kw - 15.00\nIn addition to the above, member stations enjoy the benefits of our Place¬\nment Service, legal counsel, help in meeting day-to-day problems, the oppor¬\ntunity to meet, in seminars, conferences and conventions, with other educa¬\ntional broadcasters to consider mutual problems, and, for the payment of\nan additional assessment fee, the use of our tape network.\nThe NAEB Network, which distributes over I4OO hours of programming, via\ntape recording, per year, is open only to members of the Association.\nThrough the Network you have an opportunity to broadcast some of the best\neducational programs from all over the country as well as a chance to have\nsome of your better programs receive wider distribution. In addition,\nbeing able to rely on the Network for eight or more hours of programming\nper week permits your staff to spend more time on the development of out¬\nstanding programs.\nBy recent action of the NAEB Executive Committee, new members are allowed\nto join the Network without paying the full assessment fee. A graduated\nscale has been set up whereby new stations do not pay the full fee until\nthe third year. Annual Network assessments are based on the same power\nclassifications as membership:\n1st year\nSKBSO'\n250.00\n150.00\n2nd year\n375.00\n225.00\n3rd year\nmw;w\n500.00\n300.00\nClass A\nClass B\nClass C\nIn addition, member stations must pay postage both ways on tapes shipped\nto and from the Network. For a station in your area this would amount\nto approximately -27.50 a year if you availed yourself of all the pro¬\ngrams made available ty the Network. (There is a strong possibility that\nthere will soon be Congressional action to lower rates for educational re¬\ncordings, which would make postage payments considerably lower). Even with\nthe postage charges you see that the cost per hour of programming (for I4.OO\nhours, or more) is very low.\nIn addition to the regular Network service described above (a sample Net¬\nwork offering is included in the material being sent separately), we make\navailable in?-school programs to those stations who do in-school broadcast¬\ning. For this service a station pays an additional fee of one-fourth of\nthe regular assessment, or $2.00 per reel, whichever is less. However,"
}