{
  "id": "d723-45",
  "text": "May 16, 1956\nV\n&\n'y?*\nMr# Michael J. Airibrosino\nTelevision Coordinator\nSchenectady Public Schools\nOffice of the Coordinator\nMont Pleasant High School\nSchenectady* New Y0rk\nDear Mr. Ambrosino:\nJust about the same time your letter requesting information about NASS\nmembership arrived Harry Skornia returned from our Region I meeting with\nthe information that you will soon replace Eugene Foster as Executive Sec-\nre atiy of the Fmpiie State FM School of the Air, This has caused some\nHconfusion in the ranks’* and we would greatly appreciate a little infor¬\nmation#\nIs the Empire State FM School of the Air permanently located at Syracuse\nand do you move there, or do the headquarters of the School of the Air\nmove to Schenectady when you become Executive Secretary# Our problem is\nthiss our Associate memberships are institutional (or, in some cases, or¬\nganizational) and we have always assumed that the School of the Air was\npermanently located at, and really a part of, Syracuse University# There¬\nfore, technically, the University has held the membership — even though\nit also holds an Active membership because of WAFR, Now, if the School\nof the Air is really a separate entity, and not a part of the Univer¬\nsity, it should be considered the member and would continue to hold mem¬\nbership even though the executive offices might be moved# I raise this\nproblem because we would like to get it straight in our own minds, but\nalso because I'm not sure whether or not your request for information\nabout membership was a result of desiring membership .ter the School of\nthe Air or for Schenectady Public Schools. At any rate, below is the\ninformation you wanted, and I have included information about Active\nmembership, just so you will know more about the Association#\nThe NAEB has three categories of membership, as follows:\nActive - Educational institutions, public service organizations,\netc# owning and operating their own radio and/or tele¬\nvision stations#\nAssociate - Institutions (as above) not owning stations, but operat¬\ning production centers and regularly producing programs over\na commercial outlet#"
}