{
  "id": "d723-46",
  "text": "Mr. Michael J. Ambrosino\nPage 2\nMay 16, 1956\nAffiliate - Any organization or individual interested in the general\nfurtherance of educational broadcasting.\nFor Active members with radio stations, dues in the association are based\non rated transmitter power, as follows:\nClass A - 5 kw and over - $50.00\nClass B - 1 - U.9 kw - 25.00\nClass C - less than 1 kw - 15.00\nTelevision stations with less than 5 kw video power pay $50.00 and those\nwith 5 kw or more video power pay $100.00.\nAssociate and Affiliate members pay $10.00 a year. For this fee members\nreceive our monthly Newsletter: the various reports and surveys we publish\nperiodically; services of our Placement Service, television engineer, legal\ncounsel, management consultant, etc.; plus the normal day-to-day services,\ninformation, and advice that any national organization gives its members.\nIn the attached envelope I am enclosing the latest issue of the Newsletter\nplus a few brochures which will tell you more about the NAEB and its activi-\nties.\nIn addition. Active members with radio stations may use the facilities of\nthe NAEB Radio Network upon payment of an annual assessment fee. The Net¬\nwork distributes approximately eight hours of programming, by tape record¬\ning, weekly, to members subscribing to its service. This fee is also\nbased on power (with the same power classifications as membership) and a\nnew station does not have to pay the full fee until the third year it is\nin the Network. The fees are:\nClass A\nClass B\nClass C\n1st year\ntf&C)So6\n250.00\n150.00\n2nd year 3rd year\nW;oo IBoo.ob\n375.00 500.00\n225.00 300.00\nStations must also pay postage both ways on the tapes shipped to and from\nNetwork Headquarters here in Hrbana, Illinois. Still even a Class A sta¬\ntion paying its full third-year rate is paying only a little over $2.00\nan hour for better than ijOO hours of programming from the Network in a\nyear. This is about the most inexpensive programming a station can do.\nThere, in brief, is the information you wanted, and we*re looking forward\nto your application for membership. Hope you will forgive our apparent\nstupidity about the School of the Air situation, but I*m sure you under¬\nstand, and we would appreciate your answers to the questions I*ve raised.\nIf we can answer any other questions or send you any other information,\nplease let me know.\nSincerely,\nHEHjcr\nEnc. C&-I, ^ 9, % 9, ♦ , P-Ss\nHarold E. Hill\nAssociate Director"
}