{
  "id": "d723-61",
  "text": "July 13, 1956\nDr* L. E. Drewrey\nOuachita Clinic\n222 Van Buren Street, N.W.\nCamden, Arkansas\nDear Dr. Drewrey*\nIn reply to your letter of July 7, I an sending you under separate cover some\ninformational materials which might be helpful to you in establishing an educational\nFM station* I am also sending a list of the, ether materials we have available\nfar sale, and am enclosing a few brochures which will tell you more about the NAEB.\nSince you might be interested in NAEB membership, especially if you do start a\nstation, I have set forth below some information about membership*\nThe NAEB has three categories of membership, as follows t\nActive - Educational institutions, public service organizations, etc* owning\nand operating their own radio and/or television stations*\nAssociate - Institutions (as above) not owning stations, but operating\nproduction centers and regularly producing programs over a\ncommercial outlet*\nAffiliate - Any organization or individual interested in the general\nfurtherance of educational broadcasting.\nFor Active members with radio stations, dues in the association are based an\nrated transmitter power, as follows i\nClass A - 5 kw and over - $50.00\nClass B - 1 - 4.9 kw - 25.00\nClass C - less than 1 kw^- 15.00\nTelevision stations with less than 5 kw video power pay $50.00 and those with\n5 kw or more video power pay $100*00\nAssociate and Affiliate members pay $10.00 a year. For this fee members receive\nour monthly Newsletter* the various reports and surveys we publish periodically;\nservices of our Placement Service, television engineer, legal counsel, management\nconsultant, etc*; plus the normal day to day services, information, and advice\nthat any national organization gives its members.\nIn addition. Active members with radio stations may use the facilities of the\nNAEB Radio Network upon payment of an annual assessment fee. The Network dis¬\ntributes approximately eight hours of programing, by tape recording, weekly, to"
}