{
  "id": "d723-87",
  "text": "Enc.: Directory (free of charge), application forms for affiliate membership\nSeptember 11, 1?£6\nMr, Herbert Wells\nDepartment of Broadcasting & Films\nBoard of Foreign Missions\nRoom £2ii\n1$6 Fifth Avenue\nNew Ydork 10, New York\nDear Mr, Wells:\nThis is in response to your letter of September 5 to Dr, Harry Skornia\nconcerning the initiation of a relationship between the organization\nyou represent and the National Association of Educational Broad¬\ncasters, Naturally, we are pleased to discuss the possibility of\nsuch a relationship, and I am happy to answer your questions,\n1, Your organization is eligible for affiliate membership in NAEB,\nIn connection with that, I am enclosing the proper nssmbership\napplication forms. Will you please return them to me as\nsoon as possible?\n2, The annual charge for affiliate membership is \"10,00,\n3* We would be pleased to receive programs from you for possible\nuse over the NAEB Radio Network, an NAEB service to active members.\nOur programming is primarily cultural, with drama, music, docu¬\nmentaries, interviews, panels, lectures, etc, forming the types\nof programs we present. We have no production facilities*\ntherefore, it is necessary that all programs received by us from\nmembers of any classification be on tape and not in script form,\n1*. Our sole interest is in taped programs, and we do not engage in\nscript exchange. However, there is a possibility that some of\nour stations would be willing to engage in such an exchange with\nyou. For your information, I am enclosing anNAEB Directory of\nmembers, and I urge you to contact as many stations as you wish\nregarding scripts.\nI regret that we are unable to enter into a script exchange with\nyour organization, but at the present time our facilities will not\npenn^4??cx 9X1 ^^Jaking on our part. At the same time, I feel th&t\nan affiliate membership in our organization will be to your benefit\nsince it will enable you to remain in close contact with educational,\ncultural broadcasters in this country.\nThank you for your interest. I look forward to hearing further from\nyou regarding this matter.\nSincerely,\nREU/rafb\nC £ t\nEobert E. Underwood, Jr.\nNetwork Manager"
}