{
  "id": "d723-88",
  "text": "'A*tsr yKfu\nSeptember 11, 1956\nMr, Herbert bells\nDepartment of Broadcasting U Films\nBoard of Foreign Missions\nRoom 52li\n1£6 Fifth Avenue\nHow Ydork 10, Now York\nDear Hr, Wells«\nThis is in response to your letter of Saptectoor 5 to Dr. Harry Skoraia\nconcerning the initiation of a relationship between the organisation\nyou represent and the National Association of educational Broad¬\ncasters. Naturally, we are pleased to discuss the possibility of\nsuch a relationship, and 1 am happy to answer your questions,\n1, Your organisation is eligible for affiliate membership in KAF3.\nIn connection with that, X am enclosing the proper membership\napplication forms. #1X1 you please return them in to me as\nsocn as possiblo?\n2, The annual chargo for affiliate menberchlp is 10.00.\n3, We would bo pleasid to receive programs from you for possiblo\nuse over the HAF3 Fiadio Network, an HAFB service to active members.\nOur programing is primarily cultural, with drama, music, docu-\nlontarios, interviews, panels, lectures, etc, forming the types\nof programs we present. We have no production facilities*\ntherefore, it is necessary that all programs received by ue from\nmembers of any classification be on tape and not in 3cript form,\nii. Our sola interest is in taped programs, and we do not engage in s\nscript exchange. However, there is a possibility that som of\nour stations would be willing to engage in such an exchange with\nyou. For your information, X am enclosing enlttF.B Directory of\nMembers, and I urge you to contact as many stations as you wish\nregarding scripts.\nX regret that we are unable to enter into a script exchange with\nyour organisation, but at the present time our facilities will not s\nVg88r°MiktiM\nsince it will enable you to remain in close contact with educational,\ncultural broadcasters in this country.\nThank you for your interest, X look forward to hearing further from\nyou regarding this natter.\nSincerely,\nmu/rafb , C C: '\nabort F. Underwood, Jr.\nNetwork Teenager"
}