{
  "id": "d723-89",
  "text": "Telephone ALgonquin 5-5000\nCable Address “Inculcate, New York\"\nTHE PRESBYTERIAN CHURCH IN THE UNITED STATES OF AMERICA\nRECEIVED\nINTO AU P headquarters\nIN\nEcumenical Mission THE\nTOC\nBOARD OF FOREIGN MISSIONS\n156 FIFTH AVENUE, NEW YORK 10, N.Y.\nHSEP u 1066\nSeptember 5> 1956\nDr. Harry Skornia\nN. A. E. B.\n14 Gregory Hall\nUrbana, Illinois\nDear Dr. Skornia:\nSome months ago, this office initiated correspondence\nwith your organization relative to the exchange of broadcast\nmaterial. This correspondence was not completed, and I have\nbeen asked to persue it further.\nWe are associated in the op eration of Radio Station\nHLKY in Seoul, Korea, its director at present working out of\nthis office. This is a non-commercial, Christian broadcasting\nstation, wdth a program schedule which is approximately one-\nthird evangelical and two-thirds cultural, broadcasting pri¬\nmarily in the Korean language.\nOne of our greatest problems in programming this\nstation is in the securing of high calibre non-copyrighted\ndramatic scripts. The United States would seem the logical\nplace to find such material, but to date we have been relatively\nunsuccessful.\nThere are several questions we would ask:\n(1) Would we be eligible for any type of membership\nin the N.A.E.B.?\n(2) If so, would there be any cost to us?\n(3) We understand that members of your organization\nare expected to originate a certain proportion of your programs\nin exchange for membership. We would be happy to fulfill this\nobligation, but wonder what specific types of program we might\ncontribute.\n(4) Our primary interest is in scripts, not in\ntapes. These scripts we would then translate into Korean. Is\nit possible our end of the exchange might be thus worked out?\nIn the event a workable arrangement would not be ef¬\nfected between our two organizations, could you suggest any other\nINTO ALL THE WORLD TOGETHER In Evangelism, Education, Theological and Lay Training, Medical Service, Student Work, Litera¬\nture and Literacy, Broadcasting and Films, Community Services, Interchurch Aid, Relief and Rehabilitation, Interchange of\nMissionaries and Fraternal Workers."
}