{
  "id": "d836-105",
  "text": "-3-\nJanuary 19 - Former program director with large educational radio station\nwants management or program director position in ETV. 5 years experience\nprogramming for commercial stations, as well. Presently with the U.S.\nInformation Agency in Pakistan, but position terminates end of this\nmonth. Male, 34, married, B.A. Location open. $7500.\nJanuary 20 - University director of radio-TV, experienced teacher-prod¬\nucer wants a position in educational broadcasting as program director,\nor producer. Wants to teach. 4 years professional theater and radio\nwork, 5 years teaching and producing. Male, 41, PhD., married.\nLocation, salary, open.\nJanuary 21 - Production assistant and writer in commercial TV with 12\nyears experience in radio wants same type position in educational broad¬\ncasting. Woman, 33, A.B., single. Location open. $75/wk.\nJanuary 22 - Young man, 27, single, with commercial and educational\nexperience in radio-TV and movies desires change to express himself in\nETV. Now commercially employed as film manager and producer. Loca¬\ntion, salary, open.\nJanuary 23 - Young woman, 23, M.S. in Communications with 1 year dir¬\necting and producing experience at educational station, wants position\nas program assistant, assistant director or producer in ETV. B.S. in\nHome Ec. Location open. $3500.\nJanuary 24 - PhD., male, 51, married, director of education and research\nlast 10 years for leading midwest station. Also taught 15 years various\nuniversity music courses. Wants position in ETV in administration,\nresearch or programming. Location, salary, open.\nJanuary 25 - Production manager of large midwest educational station -\nAM & FM operation, college teaching experience, radio workship super¬\nvision . Interested in management of smaller educational radio station\nwith good facilities. Male, 32, M.S*, married. Location open. $5500.\nJanuary 26 - Producer-coordinator, area chairman in radio-TV, 15 years\ncommercial experience, 6 years college-level teaching, 3 years director\nof ETV workshop, much experience producing ETV programs. Male, 43,\nPhD., married. Looking for a challenge. Location open. $6000."
}