{
  "id": "d836-106",
  "text": "-4-\nJanuary 27 - Producer, director, writer, has packaged and produced\nover 200 educational and public service TV programs, organized work-\nship for large university, teaches college-level. Wants administrative,\nproducer or program director position. Male, M.F.A., 35, single.\nLocation open. $6200.\nJanuary 28 - Associate director presently employed at third largest orig¬\nination point for CBS-TV, desires switch to ETV as program director or\nproduction manager. Male, married, 25, B.A. Location open. $125/wk.\nJanuary 29 - Recent TV workshop graduate with B.S. in business admin¬\nistration, wishes position in ETV as production assistant. Male, 25,\nsingle. Location open. $70/wk.\nJanuary 30 - TV electronics engineer, instructor and technical writer,\nover 13 years experience in electronics. Project engineer on 3 network\nstations. Substantial experience teaching radio-TV. Male, 47, married,\nB.S. Wants in metropolitan area of New York. $110/wk.\nJanuary 31 - Young woman college graduate in Communications seeks a\nposition on the production staff of an educational broadcasting station.\n23, B.S., single. Location open. $2600.\nJanuary 32 - Male, single, 37, M.S. (Syracuse) with 10 years experience\nas a professional entertainer and on the air experience as a producer-\ndirector of educational programs, wants position as producer-director\nwith educational station. Location open. $5000.\nJanuary 33 - Male, married, 29, M.A. in Education, wants start in\neducational broadcasting as production assistant. Desires Northeast\nlocation. Salary open.\nJanuary 34 - Education graduate with some radio experience as an an¬\nnouncer wants position as announcer or production assistant in ETV.\nMale, 27, A.B., married. Location open. $4500.\nJanuary 35 - Executive producer of special films for a branch of U.S.\nArmy, 17 years experience writing, directing and producing films,\nexpert at pre-production planning. Wants position as film director\nor producer-director in ETV. Male, married, 42. Location open but\nprefers New York state. $10,000."
}