{
  "id": "d836-107",
  "text": ".-5-\nJanuary 36 - Male, 49, single, producer-director on major networks\nat present employed as instructor in radiorTV school, desires, position\nin ETVas producer-director, writer, administrator.. Location, salary,\nopen. '•\nJanuary 37 - Male, 49, single, M.A. in sociology, desires;position in\nETV as assistant producer or researcher. Has worked as research and\nproducer on part of a 30-minute show on an ETV station. Location open.\n$3600.\nJanuary 38 - Former head of TV research and planning at major univer¬\nsity, desires position in educational programming. 10 years profes¬\nsional experience in writing, directing, producing motion pictures,\nTV and radio - both coasts and overseas. Male, 29 „ B.A., single.\nLocation open. $500/mth.\nJanuary 39 - Retired Army officer engaged as research assistant with\nnational foundation for educational administration, interested in admin¬\nistrative position with ETV. Qualified teacher and has broadcasting\nexperience in Armed Forces, foreign and commercial radio. Male, 55,\nM.S., married. Location, salary, open. ; v\nJanuary 40 - Writer, 27, M.A., married, seeking radio-TV position.\nHe has worked with BBC for 2 years, has contributed to U.S. and British\nperiodicals, has good news background. Location open. $4500.\nJanuary 4-1 - Woman, 52, married, M.A., with teaching background and\nseveral TV workshop certificates desires position as writer, or program\n. assistant in ETV. Desires locate in New York City and vicinity.\nSalary open.\nJanuary.42 - Male, 26, married, B.A., desires position as music direct¬\nor in educational broadcasting. Has worked on both commercial and\neducational radio. Announces, as well as acting music director.\nLocation open. $4500.\nJanuary 43 Teacher (8 years) who has been writer-director for educa¬\ntional and commercial film company, wants producer^coordinator posi¬\ntion in ETV. Has supervised live TV show for national organization.\nMale, 45, M.A., married. Prefers locate in West or Midwest. $6500.\nJanuary 44 - Announcer on commercial radio-TV. for 15 years desires\nswitch to educational broadcasting. Also taught for 8 years and written\nfree-lance. Male, 37, A.B., married. Location open. $5000."
}