{
  "id": "d836-111",
  "text": "-9-\nJanuary 68 - Young woman, 23, B.A., desires position in ETV. Much\nexperience acting, directing, stage managing, designing and scenery\ngained in college and summer theater. Wishes position as assistant\ndirector, production assistant or designer. Single* Location open.\n$75/wk.\nJanuary 69 - Ph.D. in audio-visual education, writer-producer of early\nETV series, commercial film story editor, also experienced in film-TV\ncrew, teaching and acting, desires position in any combination of writing-\nproducing, teaching or related film work. Male, married, 37. Location\nopen. $4800.\nJanuary 70 - Station manager of large ETV station desires position as\nproducer-director or in administration. An idea man thoroughly experienced\nin radio-TV, 8 years teaching experience, award-winning specialist in\nlow budget production. Male, married, 39, M..S. Location open. $7500.\nJanuary 71 - Science and math high school teacher desires ETV position.\nHas completed classwork at Stanford on Ed .D. with emphasis on science\neducation through TV. Can write, has worked on floor of commercial\nstations and produced educational shows. Male, 37, married, M.E.\nLocation open .$5000.\nJanuary 72 - Experienced manager, now assistant director at college ETV\nstation, desires more challenging position. Wishes college-level teaching,\nmanager or assistant director of ETV station. Male, 37, married, Ph.D.\nLocation open, $6000.\nJanuary 73 - TV producer-director with 2 1/2 years experience in ETV,\ndesires new position. Has had experience in children’s programs,\nmodern dance, panel, quiz, news and other informational programs - with\nand without scripts . Creative, yet attentive to details . Prefers to find\nposition in the South, but wiil go anywhere. Male, married, 32, B.S.\n$5500-6500.\nJanuary 74 - Male, 31, married, B.S., is now production manager at\nMidwest ETV station, desires move to new location so he can finish his\nM.A. in English. Can be producer-director as well as production mana¬\nger. Will teach. Has 3 1/2 years commercial TV training, 7 years in\nradio. Locate on either coast or Great Lakes area. $6000.\nJanuary 75 - Producer-director at commercial TV station desires switch\nto ETV. Much technical experience - permanently responsible for 5\nregular shows. Male, 29, married. Schooled in Germany and U.S.\nLocation open. $4500-5000."
}