{
  "id": "d836-113",
  "text": "-11-\nJanuary 84 - Male, 23, B.S., married, at present supervisor of radio-TV\nproduction for a small college, desires position as news director, prod¬\nuction manager or special-events producer in educational broadcasting.\nCan also shoot, edit, and plan films, has experience with news, pro¬\ngramming and writing. Desires locate in the East. $500/month.\nJanuary 85 - Program manager for commercial TV station with 7 years\nexperience as producer-director and administrator as well as program\nmanager, wants to be station manager of an ETV station. Male, 32, A.B.,\nmarried. Location open. $9,500.\nJanuary 86 - Male, 30, married, presently employed as maintenance\nsupervisor at an ETV station, has also worked as an audio engineer and\ntrained many student engineers. Wants a position as audio or video\nengineer, can work on kinescopes and operations. Location, salary,\nopen.\nJanuary 87 - Recent radio-TV graduate, now production assistant in an\nETV station wants similar position in another station, as a cutback in\noperations threatens job security. Can direct and announce. Male, 22,\nB.A., married. Location open. $350/month.\nJanuary 88 - Male, 26, married, to receive M.S. in radio-TV in February,\nwishes a position leading to producer-director, production director,\nor program manager in an ETV station. Will go anywhere. $4500.\nJanuary 89 - Producer-director in commercial TV desires similar position\nin educational broadcasting. Has 6 years experience in radio; 6 in TV.\nIs also a writer whose scripts won 2 national awards and a teacher.\nMale, 32, married, M.A. Desires locate in the East. Salary open.\nJanuary SO - Experienced writer-producer, commentator, has his own\nnetwork programs, seeks educational broadcasting post in the West or\nNew England. Widely published writer on musical subjects. Male, 28,\nmarried, Ph. D. Salary open.\nJanuary 91 - Male, 34, married, M.A. has done work as writer, producer,\nfilm director and editor, and assistant director wants a similar position\nin ETV. Has 9 years experience in films and commercial TV. Location\nopen. $65/wk.\nJanuary 92 - Male, 30, single, stage manager for New York theatrical\ncompany, wants to produce-direct for ETV. Has 350 hours producing-\ndirecting TV programs. Desires South or West, $50/wk."
}