{
  "id": "d836-117",
  "text": "-14-\nJaniiary 110 - Film director and floor manager for commercial TV station\ndesires switch to ETV. Also has been chief cameraman and continuity\nwriter. Male, 30, -single. Location open. $55/wk. \"*\nJanuary ill - Experienced film technician, many years of office ex¬\nperience in several fields including motion pictures, managerial and\nsupervisory capacities. Male, 40, married. Desires location in\nSouthern California. $100/wk.\nJanuary 112 - Male, 45, married, with 20 successful years in commercial\nradio-TV, now employed as program director, wants to switch to an\nETV station near a college or university where he can finish his academic\ndegree. Prefers locate in East or Midwest. $6500.\nJanuary 1T3 - Male, 48, single, Ph.D., desires positidn as program\ndirector or continuity writer with ETV. - Has had advanced degrees in\nradio-TV, some practical experience. Location open. $5000.\nJanuary 114 - Creative writer for network TV wants switch to ETV.\nHas written freelance for “Cavalcade of America/' “Theatre of the\nMind\" and many documentaries. Male, 48, married, B.A. Prefers\n- locate on* either coast. $10,000.\n•January 115 - Assistant producer-director for 3 years in major ETV\nUHF station desires advancement. Has theater, radio background.\nWoman, 27, B.A. (working on M.A.) single. Prefers West or Midwest\nlocation. $3 50/month.\nJanuary 116 - Director of women's programs for radio and TV wants\nswitch to ETV. Has also been copywriter, talent, and producer.\nWoman, 37, separated. Prefers locate in New England.; $100/wk.\nJanuary 117 *- Male, 31, single, B.F.A., stage director, co-writer\nand producer of special events shows; has been art director at leading\nETV station, wants producer-director position in ETV with opportunity\nto double as art director. $6500.\nJanuary 118 - Male, 25, B.S., married, with much past experience\nas radio announcer, desires position in educational radio. Prefers\nMidwest location, $4000.\nJanuary 119 - Woman commentator^ 51, producer, actress, writer,\nwith considerable standing in commercial radio-TV, wants educational\nbroadcasting position . Will forfeit financially to do so. Location\nopen* $7000. ’ ‘"
}