{
  "id": "d836-118",
  "text": "-15-\nJanuary 120 - Radio-TV director, after 10 years with commercial.\nbroadcastingv seeking position as college teacher with ETV hookrup\n. or theatre group*; Has personally produced over 1000 live TV programs\nand over 10 Q film commercials. Male ,29, single, B, S. Location\nopen. $10,00.0. 'V: * .\nJanuary 121 - Artist, has worked for ETV station and has production\nexperiencei wants permanent ETV position. Young lady, 24, B.F.A.,\nsingle. Location open. $ 65/wk.\nJanuary 122 - Male, 29, married, M.A. and working on Ph.D., has\nbeen teaching radio-TV at university level last 3 years, been familiar\nwith radio since 1939:, with TV since 1951. Wants teaching position\nor combination,teaching and program planning. Location open. $5000.\nJanuary 123, - Program director, continuity writer and women's com¬\nmentator for commercial radio station wants similar position in\neducational radio. Woman, single, 39, M.A. Location, salary open.\nJanuary 124.Male,35, married, Ph.D., 6 years college teaching\nincluding ^radio-TV courses, 4 years high school teaching and comri\nmercial radio experience, desires position in educational broadcasting\nin programming or administration. Prefers locate in northern Midwest.\n$5000.\nJanuary 125 - Producer-writer, announcer, director of more than\n1000 educational broadcasting programs seeks affiliation with\neducational.station in similar capacity. Also interested in public\nservice programs. Male, 39, single. Location open. $400/month.\nJanuary 126 - Artist, a director of animated color cartoons for UPA,\npaintings have been exhibited nationally, 2 years teacher of art at\nlarge university, also talented in writing, music, color and layout\nfor TV. Desires position as ETV art director. Location open. Male,\n31, married, M.A. $7000.\nJanuary 127 - Young man, 26, single, B.S. in Journalism with minor\nin broadcasting, desires educational broadcasting position. Location\nopen. $3 2 5/month.\nJanuary 128 - TV producer for armed forces whose past experience\nincludes being film editor for network TV station, wants position in\nETV where there are opportunities for graduate work. Male, 32,\nmarried, B.S. Location open. $5000."
}