{
  "id": "d836-123",
  "text": "NAEB PLACEMENT SERVICE\nAnyone wishing to register with the NAEB Placement Service should write to Mr,\nRobert E. Underwood, Jr,, 14 Gregory Hall, Urbana, Illinois, and the proper\nforms ^ill be forwarded to you by return mail. Also, any inquiries concerning\napplicants should be addressed to Mr. Underwood.\nThe following descriptions of personnel registered with us are taken directly\nfrom the Placement Service Forms.\nAugust 1, AMBITIOUS, RESOURCEFUL, RELIABLE young woman wishes a position which\nwill provide an opportunity for work, study, and promotion. Qualifications:\nactive participation in numerous phases and activities of society, school, and\nchurch since childhood; five years of college work in the field of music educa¬\ntion which includes a bachelor’s degree and ten graduate hours; a desire to be\nof creative service to society.\nAugust 2. Young man, 25, College graduate, married veteran. One year exper¬\nience in commercial television, three years Workshop experience. Desires a\nposition teaching or a combination of teaching and directing. Excellent refer¬\nences and good potential. Some teaching experience and proven leadership ability.\nNo locational preferences, but desire work-inspiring conditions. Ready to settle\ndown and start family.\nAugust 3. Wanted: Job in a television station. Prefer work in the educational\nfield of TV. Have had radio and teaching experience.\nAugust 4« JACK-OF-ALL-TRADES seeks interesting, challenging position. Now\nemployed Director Radio-TV, major university. Thoroughly experienced in edu¬\ncational as well as commercial mass media including radio, tv, motion pictures\nand theatre. Eight years teaching experience. Administrator, producer, director,\nwriter, promotion, talent or what have you. Award-winning specialist in low\nbudget production. If you need an idea man who can follow through capably, thoro¬\nughly and efficiently, I’d like to try to fill the bill.\nAugust 5. Need someone with these qualifications? BA degree, production exper¬\nience, Special Services Officer, presently directing. Available immediately.\nAugust 6. EIGHT YEARS EXPERIENCE IN RADIO including jobs as Music Director,\nAss’t Program Director, Station Manager, planner of live and recorded programs\nof fine music, continuity writer, and announcer (esp0 good at ad-lib interviews).\nPresently, Music Director, Station KEAR, San Francisco. Had own program on WQXR,\nNew York City and for two years on WILL, Urbana, Illinois, Has also taught\ncourses in music literature and music history at University of Illinois, at M. I.T.,\nUniv. of Connecticut, Hunter College. Has also lectured extensively before adult\naudiences. Can furnish finest references. Has splendid background in music\nstudy, radio experience and college teaching. Wishes to locate job with education¬\nal radio and/or TV station (preferably as Program or Music Director) combined,\nif possible, with teaching duties in college music or radio department. Graduate\nof Amherst College. 4 years of graduate study at Harvard. Available immediately,\nAugust 7. Desire TV job as Producer-Director. MS, Radio-TV, University of Illi¬\nnois. 2-g- years commercial radio experience (announcer, copy writer, and newsman)\nplus teaching experience. Will teach broadcast courses; might consider other\nproduction jobs."
}