{
  "id": "d836-130",
  "text": "NAE3 Placement Service\nNovember\n1954\n-3-\nwith educational institution as radio-TV producer or radio-TV station\nwhich seeks educational or public service program director*\nNov. 17 Experienced manager and production director in both commercial\nand educational television desires position with new educational TV\nstation or with college or university radio and television department.\nBackground includes 20 years of experience in the field. Undergraduate\ndegree in electronics; doctorate in education. Qualified to teach all\nphases of radio and TV production and management, as well as graduate\ncourses in communications and communications research. Metropolitan\narea preferred. Salary should be commensurate with that offered for\ncorresponding responsibility in commercial TV. Presently employed in\nlarge university*.\nNov. 18 A. B., University of llichigan, 1953. TV production and rele¬\nvant courses at Columbia and llichigan. No military obligations. Per¬\nsonable, versatile, creative. Supervisory directing experience at col¬\nlege and summer camp*\nNov. 19 Young man - 27, single; experience in commercial PH ”good music”\nstation as announcer, music commentator and member of program dept;;\n3.S. in Political Science, M.A. in Iiusic; high scholarship; editor,\ncollege literary magazine; concert experience as pianist and composer;\nexcellent references. Hill consider part-time teaching in connection\nwith position.\nNov. 20 Young man, 27, seeks position as writer, director and/or pro¬\nducer of educational TV programs. Three college degrees, widely travel¬\ned, four years college teaching (drama) experience. Knowledge and\npractical experience of TV production techniques.\nNov. 21 You want a practical administrator and broadcaster who knows\nthe big picture as well as the details from the inside of commercial\nbroadcasting. You need the man who wrote this*\nNov. 22 notion picture cameraman: 6 years intensive skill and know¬\nhow related to 16-35mm cinematography, recording (optical, tape, disk),\nediting, laboratory processing practice (black & white); have Navy high\nspeed photography experience; member SKPTE; self-reliant; inventive;\nrelocate if required; desires challenging, responsible position where\ntechnical knowledge and ingenuity will be fully utilized*\nNov. 23 Han who has taught 14 years, experienced in: grades 4-12,\nschool administration, coaching all athletics, dramatics. Kural and ur¬\nban living, railroader, merchant seaman, 3.S. in Elementary Education,\nll.A. in Secondary Education, 63 quarter hours advanced graduate study\nbeyond II.A. 6 weeks TV institute, 2 weeks radio-TV workshop. Desires\nwork in educational TV or radio, in college or educational station.\nNov. 24 Young woman with B.A. in theatre and two years experience in\nradio and TV production, audience building, and promotion, will com¬\nplete I1.A. in Speech (centering in radio and TV) in February, 1955*\nHas produced two adult education TV series and has assisted on many"
}