{
  "id": "d836-143",
  "text": "NAEB PLACEMENT SERVICE\nAnyone wishing to register with the NAEB Placement Service should write to Mr. Rob¬\nert Underwood, Jr., 14 Gregory Hall, Urbana, Illinois, and the proper forms will\nbe forwarded to you by return mail. Also, any inquiries concerning applicants\nlisted below should be addressed to Mr. Underwood.\nThe following descriptions of personnel listed with us are written by the appli¬\ncants themselves, and are taken directly ffom the Placement Service forms.\nDec. 1. Experienced announcer, director, producer, now in commercial recording,\nwishes to return to TV. Desires position demanding good work, but giving responsi¬\nbility and freedom of execution. Two years of ”on camera” work as commercial an¬\nnouncer, supplemented by responsibility of completely producing many of shows han¬\ndled. Proficient technician who can also think.\nDec. 2. Man desires position in educational TV. B.S. in speech and radio. M.S. in\nadministration and supervision. Seven years educational and commercial experience\nin radio, TV, audio-visual instruction and motion picture production and distribu¬\ntion. Licensed in New York State as teacher and supervisor.. Presently employed in\nmotion picture production and distribution work. Available immediately.\nDec. 3. Available for immediate employment. Young man, 35, wants position in ETV.\nEquipped byti&ining and experience to handle wide range of problems. Can fit into\nany organization. Looking for opportunity to combine creative ability with tech¬\nnical know-how in educational field.\nDec. 4. Age 30, seeks radio-TV position in New York. B.A. and M.A. degree. Exper¬\nience in commercial writing and teaching. Have good knowledge of music, theater,\n^ and literature.\nDec. 5. I have been thoroughly trained in radio and television. My radio exper¬\nience includes announcing, programming, and management. Two educational programs\nI produced received national citations from the Ohio Institute. I am looking for\na challenging position with an organization interested in or active in television.\nDec. 6. Production, script, research. Versatile young woman with commercial sta¬\ntion and network experience in informational and cultural programming. A.B. with\ndistinction, Cornell.\nDec. 7. Are extra hands needed in your station’s OPERATION? Do you want a person\nwho is creative, capable, energetic, enthusiastic, loyal and willing to work? A\nperson who is experienced and well trained in all aspects of broadcasting—program\nplanning and building, radio and TV writing, production, acting, announcing, audience\nmeasurement and savoir faire?\nDec. 8. TV Workshop graduate, age 23, seeking apprentice position with TV station.\nAble to work camera, dolly, cables, lighting, etc. Salary secondary. Will travel\nif necessary.\nDec. 9. Woman desires position utilizing background and training in education and\nTV. Taught English in secondary schools for 5 years. Recently completed graduate\ncourse of study in radio-TV with M.S. degree. Single,36, references.\n'\nDec. 10. Interested in getting located in the creative fields of television. My\nB certificate from the summer institute of radio and TV of Barnard College and the\nNBC attests to the fact that I am a person of ideas. I can be of valuable service\nto any producer."
}