{
  "id": "d836-144",
  "text": "PLACEMENT—2\nDec. 11. Experienced writer, producer, director of film for theatre and TV. A.B.,\nM.A., secondary certificate, course work completed toward PH.D. in literature.\nBroad background in film production as free lance and for commercial producers.\nSeven years experience as college instructor of literature, journalism, writing,\npublications. Married, veteran, two children. Highest references from industry\nand education.\nDec. 12. Director of public service and educational programs for midwest commercial\nTV station seeks position as program director for educational station. Holds Doctor\nof Education degree in educational foundations and is former college instructor.\nOver ten years’ experience in education and teaching. Experience in theatre and\ndramatics activities. TV experience consists of two years as producer and director\nof public service and educational productions plus first-hand knowledge of studio\noperation. Complete details of background and experience upon request.\nDec. 13. Thoroughly trained in all phases of TV production. Can handle all from\ndolly pushing to directing and producing. Will work anywhere. Thoroughly trained\nin all phases of radio broadcasting. Can handle all from news to classical music.\nFamiliar with console.\nDec. 14. Industrial designer-artist desires full time position in educational TV\nas Art Director. Will ’’double\" as production assistant. College graduate. Six\nyears experience product design, advertising art, model making, small shop operation.\nKnowledge of TV station operation and procedures; has handled all phases of TV art,\nflip cards to set design, at educational station. Prefer Northeast or North Cen¬\ntral states.\nDec. 15. Production manager-doubles in brass as scenic designer-painter, graphic\nartist and lighting director, etc. Educational station and top New York network\nexperience. Ideal man for small, budget-minded station. Married—two children.\nWish to relocate in Midwest, South or East. Best references. Reasonable salary\nrequirements.\nDec. 16. Hollywood TV-radio producer-writer-M.C. Director of more than 1000 educa¬\ntional video-radio programs seeks affiliation with educational station in similar\nor other capacity. Also interested in affiliation with educational institution as\nradio-TV producer or radio-TV station which seeks educational or public service\nprogram director.\nDec. 17. Experienced manager and production director in both commercial and educa¬\ntional television desires position with new educational TV station or with college\nor university radio and TV department. Background includes 20 years of experience\nin the field. Undergraduate degree in electronics; doctorate in education. Qual¬\nified to teach all phases of radio and TV production and management, as well as\ngraduate courses in communications and communications research. Metropolitan area\npreferred. Salary should be commensurate with that offered for corresponding\nresponsibility in commercial TV. Presently employed in large university.\nDec. 18. A.B., University of Michigan, 1953* TV production and relevant courses at\nColumbia and Michigan. No military obligations. Personable, versatile, creative.\nSupervisory directing experience at college and summer camp.\nDec. 19. Young man-27, single; experience in commercial FM \"good music\" station as\nannouncer, music commentator and member of program dept.; B.S. in Pol. Science, M.A.\nin Music; high scholarship; editor, college literary magazine; concert experience\nas pianist and composer; excellent references. Will consider part-time teaching\nin connection with position."
}