{
  "id": "d836-146",
  "text": "PLACEMENT—4\nDec. 28. PRODUCER-DIRECTOR: Four years TV experience with major network.Solid back¬\nground in film. Extensive managerial & organizational experience. (Supervised first\nTV network in Japan as Consultant to Japanese Government. 1952-54) Desires Program\nDirector, or suitable creative programming position.\nDec. 29. 4 YEARS DIRECTOR TV, DRAMA, CINEMA, with West Coast Professional THEATRICAL\nSCHOOL. Competent to handle organization and development of Educational TV or Mo¬\ntion! Picture Dept. 15 years Show Business experience; including work as Night Club\nComedian. Capable photographer, still and Cinema. Will work ANYWHERE.\nDec. 30. Major network writer-director-producer, specializing in music, public ser¬\nvice and educational programs, desires responsible position as program supervisor\nfor educational television station. Harvard educated, wide esperience in newspaper\nwork, radio, TV and films, here and abroad. Recipient of Nieman Fellowship. Married,\naged 40, prepared to relocate for long-range opportunity.\nDec. 31. Mature executive and educator interested in developmental job in planning\nand producing educational TV programs which feature current public affairs analysis\nand comment, and which capitalizes on the potentialities of the visual medium. Has\ndeveloped written proposals and sample formats for such programs. No formal train¬\ning or paid work experience in broadcasting, but broad executive experience in re¬\nlated fields: l) Experience in analysing public events and presenting their meaning\nin simple and concise form. Special ability for getting ’’inside the news” relying\non open sources and contacts in the Government. Facility in research and writing.\n(Fh.D. in Political Science, intelligence work experience in OSS, Dept, of State;\npresent job Chief of Instruction, Federal Civil Defense Staff College.) 2) Exper¬\nience and experimentation in making combined verbal and visual presentations (”brief-\nings”) for laymen, including conceiving and designing special visual materials. (In¬\ntelligence work in military. State Department, and OSS; and also teaching and cur¬\nriculum development in present job.) 3) Familiarity with current trends in informal\nadult education. Acquaintance in adult education profession. Active in AEA.\n4) Discussions on news and public affairs program problems with network commentators\nand executives.\nDec. 32. School of Radio Technique graduate, thoroughly capable of all phases TV\nProduction, Programming with wide cultural background in Art, Music, theatre and\nliterature, desires opportunity to offer his talents as Floor Manager, Program\nAssistant and Studio Technician to your station.\nDec. 33. Position wanted in Educational TV for woman, 29; B. A., Masters Degree in\nArt, three years teaching experience, Art, Grades 1-12; business experience in Jour¬\nnalism, Mural Painting, Sales and Market Research. Interested in permanent work\nwith opportunities for advancement.\nDec. 34. Man — Experienced teacher - producer , wishes work in\neducational television. During semester 1953-54, assistant producer of The Living\nBlackboard series, televised by WPIX, New York under the auspices of the New York\nCity Board of Education. His article, ”An Educational TV Network,” appeared in\nthe August, 1954, The School Executive. Additional experience: teaching, book\njacket design, editing. Would accept part time teaching in connection with job.\nB.S. English, Columbia University. M.A. Hunter College. Working tow'ard Ph.D. at\nNew York University. Radio training at Hunter College. Television training at the\nAmerican Theatre Wing."
}