{
  "id": "d836-148",
  "text": "PLACEMENT SERVICE\nPAGE 2\nEeb. 5. Position desired: Production Manager, Program Director or\nProducer-Director. Bachelor of Arts Degree - Major in Speech and\nTheatre Arts. Over four and one-half years experience in radio and\ntelevision. Radio - Staff announcer, Sports Director, Program\nDirector. Television - Staff announcer, Producer-Director, Contin¬\nuity Director. Prefer position in Northeast section of United States.\nFeb. 6. Producer-Director position desired by Technical Director\nof large* commercial television station. Background includes, work\nas television cameraman with New York network station, training m\nthe production of documentary and educational films, and a liberal\narts degree from a top university.\nFeb. 7. I am a graduate of the Television Workshop of New York.\nI took a 480 hour course in Studio Operations, I graduated on\nAugust 25, 1954, and I am applying for a. j.ob as a Television Studio\n•Technician. I am qualified to work as a cameraman, video operator,\nmike boom operator, audio and turntables and as a floor manager.\nI studied Remot'e OperationsLighting and Special Effects, Scenic\nLabs and Film Labs; also, 60 hours of Theory and Terminology.\nFeb. 8. Now employed in commercial radio-television station,\ndesire to enter educational radio-television. Wide experience at\nseveral. Eastern''radio stations, including two 50kw stations, and\nat two television stations, one VHF, one UIIF. Harvard S.3. and an\nAM in English. Taught English eight years, six in college,, two\nin prep school. Free-lance writing nationally andregionally.\nWould be good supervising students in college station, warned,\n3,4. Need at least $5000 a year.\nFeb. 9. Intelligent, original young woman with extensive artistic\nand scientific background, interested in educational research,\nbroadcasting, or production. Willing and able to begin at secre¬\ntarial level.\nFeb. 10. Experienced announcer, director, producer, now in com¬\nmercial recording, wishes to return to TV. Desires position\ndemanding good work, but giving responsibilitjr and freedom of\nexecution. Two years of \"on camera\" work as commercial announcer,\nsupplemented by responsibility of•completely producing many of\nshows handled. Proficient technician who can also think."
}