{
  "id": "d836-149",
  "text": "NAEB PLACEMENT SERVICE\nAnyone wishing to register with the NAEB Placement Service should\nwrite to Mr. Robert E. Underwood* Jr., 14 Gregory Hall, Urbana,\nIllinois, and the proper forms will be forwarded to you by return\nmail. Also, any inquiries concerning applicants listed below\nshould be addressed to Mr. Underwood.\nThe following descriptions of personnel listed wi th us are written\nby the applicants themselves, and are taken directly from the\nPlacement Service forms.\nJan. 1. Experienced in producing and M.C.*ing educational tele¬\ncasts for youngsters and adult audiences. Degrees in music and in\ncommunications. Competent pianist and conductor. Desire position\nin TV production, preferably with on-camera work.\nJan. 2. Producer, director, writer. Professional and educational\nexperience. Workshop founder and coordinator. University lectures.\nLive TV, stage, film experience. Offer must be above $6000, Short\nterm production or counselling assignments.\nJan. 3. UNIV. GRAD. *54, trained for RADIO-TV. Rich exper. in\nSinging, Directing, Teaching. Some Journalism. Seeks work on\nProgram, Commercials, Continuity, Production, etc.\nJan. 4. Former Head of TV Research & Planning at major university\ndesires position in educational programming. Ten years professional\nexperience in writing, directing, producing motion pictures, TV,\nradio, both coasts and overseas.\nJan. 5. Intelligent, original young woman with extensive artistic\nand scientific background, interested in educational research,\nbroadcasting or production. Willing and able to begin at secre¬\ntarial level.\nJan. 6. Now employed in commercial radio--televisioh station,\ndesire to enter educational radio-television. Wide experience at\nseveral Eastern radio stations, including two 501cw stations, and\nat two television stations, one iVHF* one UHF. Harvard S.B. and an\nA.M. in English. Taught English eight years, six in college, two\nin prep school. Free-lance writing nationally and regionally.\nWould be good suvervising students in college station. Married,\n34. Need at least $5000 a year.\nJan. 7. Long record of success in curriculum-building, school\nstation operation and production of radio and television programs.\nInterested in a position of responsibility where maturity and ex¬\nperience count. Combines educational and commercial experience.\nJan. 8. Network television producer, director, writer, with five\nyears in television, and seven years in related media, seeks ex¬\necutive producer position with educational television station."
}