{
  "id": "d836-158",
  "text": "6,\nII. THE PLACEMENT OFFICER SHALL ESTABLISH AND MAINTAIN WHATEVER FILES ARE\nDEEMED NECESSARY FOR THE SUCCESSFUL OPERATION OF THE PLACEMENT SERVICE.\nSTATEMENT\nThe purpose of the files listed below is to insure the keeping of\naccurate records of all Placement Service activities and to provide quick\nand efficient means of reference with regard to the status of any and\nall applicants.\nAt present, the following files are in use by the Placement Service:\nA. ACTIVE FILE\nThis file contains the credentials of all applicants who have\ncompleted their Placement Forms. Prior to the printing of the\nPlacement Forms all letters of inquiry concerning the Placement\nService were placed in this file. The present file was estab¬\nlished when completed Placement Forms began to be received.\nSince October 18, 1954 every effort has been made to establish\na definite Active File. A form letter (hereafter referred to\nas Form Letter I and found in Appendix B) was sent to the over\ntwo hundred-fifty applicants who had received and not returned\nthe Placement Forms. This procedure was very helpful in en¬\nabling the Placement Officer to determine who did and who did\nnot wish to make use of the Placement Service. The response\nto this letter has been good and has hastened the establishment\nof definite Active, Inactive and Dead Files.\nB. INACTIVE FILE\nThis file contains all applicants who have received and not yet\nreturned the Placement Forms. When the completed forms are\nreceived, the applicants file is transferred to active status.\nPrior to the first mailing of the Placement Forms there was no\nInactive File. This file was established for the purpose of\nindicating to whom the Placement Forms had been sent.\nSince October 18, 1954 this file has been reorganized. The\nresponse to Form Letter I has cleared the file of those who\ndid not wish to use the Placement Service.\nC. DEAD FILE\nThis file contains the material on those who have not responded\nto Form Letter I or who have not chosen to take advantage of\nthe Placement Service,\nPrior to October 18, 1954 there was no dead file.\nSince October 18, 1954 this file has grown as the Active and\nInactive Files decreased slightly. This trend is not to be\nconsidered as reflecting a lack of interest in the Placement"
}