{
  "id": "d836-161",
  "text": "9.\nThe condition of the Active File is less than satisfactory. While a large\nmajority of the applicants' files are in good order, some are minus from\none to four complete sets of forms and reference statements. These miss¬\ning sets were sent out prior to October 18, 195^ and record of where\nand when they were sent has been misplaced. The question of how these\nmissing sets will be replaced is yet to be determined. With the creation\nof new files and the establishment of definite procedures, it is felt that\nthis problem has been corrected or at least the danger of its repetition\nconsiderably lessened.\nSince the arrival of a large file cabinet, the Placement Service has more\nthan adequate room in which to arrange its files in an orderly fashion.\nIt shall be the duty of the Placement Officer to check and re—check these\nfiles in order to insure a maximum of efficiency. likewise, the Placement\nOfficer shall add any new files he deems necessary.\nIII. THE PLACEMENT OFFICER SHALL DETERMINE WHATEVER PROCEDURES ARE NECESSARY\nFOR THE EFFICIENT OPERATION OF THE PLACEMENT SERVICE.\nSTATEMENT\nThe purpose of the following procedures is to insure that all necessary\nsteps are taken in the processing of files and reports and to guard against\nthe misplacement or inaccurate keeping of records.\nThe procedures determined at this time are as follows:\nA. PROCESS OF APPLICATION FOR ACTIVE FILE STATUS\nThis procedure is designed to insure that all necessary forms are\nsent to the applicant and that their sending is properly recorded.\nT he steps taken in this procedure are:\n1. Letter of application is received.\n2. Folder is assembled and mailed,\na. 5 copies of Forms 1 thro-ugh 7\nb. 1 copy of Form 11\nc. 1 copy of Form 12\nd. 1 copy of Form 13\ne. 1 copy of Instruction Sheet\nf. 1 copy of General Statement Sheet\n3. Applicant is entered on Inactive Mailing List.\n4. Application letter is placed in the Inactive File.\nB. . PROCESS OF COMPLETING ACTIVE FILE STATUS\nThis procedure is designed to insure that all necessary steps\nare taken to install the applicant in an active status.\nThe steps taken in this procedure are as follows:"
}