{
  "id": "d836-165",
  "text": "* V\n13\nSUMMARY\nThe most obvious method of publicizing the Placement Service is through the\nNAEB Newsletter Supplement. This publication v/ill cover all members of the*\nNAEB, but it is felt that more than this area should be covered. Therefore,\nit is recommended that the Placement Service seek by appropriate means to\ngain attention in other trade magazines and newspapers and, if possible,\nin magazines and other publications not specifically devoted to television\nand radio.\nIn regard to the Newsletter Supplement, it is felt that perhaps a list of\njob openings should be included with the applicants' advertisements. Naturally,\nthere would be no mentioning of the employers' names, and all actions regarcU\ning these advertisements would center around the Placement Service. If\ndesired, the Placement Service will obtain the v/ritten permission of the\nemployer to circulate his need. It is felt that this extra service would\nincrease the desire of employers to make use of the Placement Service, It\nis strongly felt that any and all publicity received by the Placement Service\nwill increase its prestige and contribute to its expansion. (See Appendix G.)\nGENERAL SUMMARY\nIt is felt that the above report is generally self-explanatory. With the\ngrowth of the Placement Service, it has been necessary to give greater\nattention to the keeping of accurate files, hence so much devotion of space\nto the filing system, procedures, etc.\nIt may be safely stated that the Placement Service has passed its settling\ndown stage. During the first year of its operation many errors were made.\nIn many instances the Placement Service has learned of pitfalls the hard\nway? by falling into them. Yet much has been accomplished, and it is felt\nthat the above report is encouraging in that it narrates a tale of progress.\nWhile there is much to be done, the Placement Service enters its new year\nconfident that it can successfully conclude any task assigned to it, and with\nthe promise that it will continually seek to improve itself and its service\nto educational broadcasting.\n5-1-55"
}