{
  "id": "d836-171",
  "text": "PLACEMENT SERVICE, MAY, 1955: PAGE 6\nsupervisor for educational television station. Harvard educated, wide experience\nin newspaper work, radio, TV and films, here and abroad. Recipient of Nieman\nFellowship. Married, aged 40, prepared to relocate for long-range opportunity.\nMay 49. Young ambitious man, with a Radio Telephone License, desires a position\nwith your T. V. Studio. Diversified background in Production, Staging and Light¬\ning Techniques, also specialized in camera and control room operation. Salary\nopen. AVAILABLE IMMEDIATELY.\nMay 50..Director of Public Service and Educational Programs for Midwest commercial\ntelevision station seeks position as Program Director for educational station.\nHolds Doctor of Education degree in Educational Foundations and is former college\ninstructor. Over ten years’ experience in Education and Teaching. Experience\nin theatre and dramatics activities. Television experience consists of two\nyears as producer and director of public service and educational productions plus\nfirst-hand knowledge of studio operation. Complete details of background and\nexperience upon request.\nMay 51. I am an Elementary School Teacher interested in securing an administrative,\nguidance or supervisory position in your school system beginning next September.\nAt the end of this year I will have successfully completed six years teaching\nexperience on the elementary level, having taught all the grades from one to\neight and combinations of the same. My experience ranges from the one room school\nto the modem ranch type structure I am teaching in at the present time. Age 31,\nmarried, two children, veteran. MA degree in Educational Administration and\nGuidance. Fully licensed. Personal interview will be appreciated.\nMay 52. Assistant professor with twelve years teaching experience desires position\nin creative television programming. In fifth year of continuous television pro¬\nduction of award winning programming. Familiar with all phases of production,\nphotography (still and motion) art-work, narration, hosting and writing. Academic\nrank desirable but not essential.\nMay 53«. Script writer, 26, female, 3 years experience commercial radio, seeks\neducational affiliation. B.S. in journalism, P. G. work in education, member\nAWRT and DAVI. Prefer east or middle west.\nMay 54* SITUATION WANTED: Young woman, 27, wTith BA and MA from Stanford University\nin theatre, production and TV; teaching certification and experience; radio, TV,\nand.stage background. Available for position in Educ. TV: prod., directing,\nscript or research. Ideas. New station or established. Salary open.\nMay 55. Long record of success in curriculum-building, school station operation\nand production of radio and television programs. Interested in a position of\nresponsibility where maturity and experience count. Combines educational and\ncommercial experience.\nMay 56* Trained in TV and Film, experienced film technician, many years of office\nexperience in several fields including motion pictures, managerial and super¬\nvisory capacities.\nMay.57# Network television producer, director, writer, with five years in tele¬\nvision, and seven years in related media, seeks executive producer position\nwith educational television station."
}