{
  "id": "d836-172",
  "text": "PLACEMENT SERVICE, MAY, 1955: PAGE 7\nMay 58, WANTED...CHANCE TO BE CREATIVE! Young woman, 23, with Bachelor’s degree\nwith highest distinction from Purdue University in journalism and theater, and\nyear’s intensive experience in commercial radio and television continuity, plus\nabout everything else in small station, deeply desires position in educational\nRadio and/or TV, which involves chance for quality writing and programming.\nMay 59. Trained?...From PEN to PENTODE! Work?...That»s what I want’ Specialty?...\nPROGRAM CO-ORDINATION, of course’ Why? \"of course\"...That’s what I KNOW. Spec¬\nifications?..^^. University of Washington - 1953; M.S. - TV Programming -\nSyracuse University - 1954. Uh—Draft?.. .Honorable discharge - W.W. II - Radio\nTechnician - U.S. First Army Signal Corps - ETO. Resume?..*0n request. Inter¬\nview?... Say when.\nMay 60. Young woman for production and programming. Active, hard worker, varied\nexperiences. Master’s degree.\nMay 61. Young man, ambitious, reliable, willing to travel, fully familiar with\nall phases of studio operational television and telesine room operations, in¬\ncluding training in directing, producing and lighting seeks a position which will\nutilize these abilities. Salary secondary.\nMay 62. STOP!!I You say you’re looking for a young, ambitious and married man\nwith a good speaking voice, who can sing and play 16 instruments; who can do\nan announcing or MC job, as well as production work and who will travel?? If\nyou’re interested-\"JUST LOOK ME UP, ANYTIME\"..,.\nMay 63. Graduate - Pratt Institute - Advertising Design - 1949? Producer, Director,\nArt Director, TV Training Programs, 3i years - Special Devices Center, Port Wash¬\nington, NY. Producer - Motion Picture Training Films, 2 years, U.S. Naval\nPhotographic Center, NAS Anacostia, Washington, D. C. Experience in all phases\nof production, Educational Television and Training Films.\nMay 64. PROGRAM DIRECTOR-WRITER-ANNOUNCER, now employed in commercial radio at\n$6500 a year, will accept a cut in pay in exchange for constructive work in ed¬\nucational field. Professional writer for six years, five of them in radio plus\nhalf-year in TV. Exceptionally good announcer. Possessor of 32 years,one wife,\nthree children, college degree classical music library and highly developed\ndistaste for Business Broadcasting.\nMay 65. Industrial Designer-Artist desires full-time position in Educational TV\nas Art Director. Will \"double\" as Production Assistant. College graduate. 6\nyears experience product design, advertising art, model making, small shop\noperation. Knowledge of TV Station Operation and procedures; has handled all\nphases TV art, Flip—cards to Set Design, at Educational Station. Prefer North\nEast or North Central States.\nMay 66. High School and Television Workshop graduate with Photography background\ni^ishes permanent position in Television Studio, Control Room or Film Department.\nMay 67. I offer to prospective employers in educational television and radio a\nunique combination of practical teaching experience in English, speech, and drama-\na wide and varied educational background — and several years’ work in continuity\nwriting, programming, and air work in commercial radio. I have also had consid¬\nerable platform speaking experience. My aptitude for and practical work in stage\ndirection should also be helpful in many areas of television. My ten years of\nteaching were in both secondary and collegiate institutions. For the past three"
}