{
  "id": "d836-21",
  "text": "3\nNATIONAL CITIZENS COMMITTEE FOR EDUCATIONAL TELEVISION\nSUITE 602, RING BUILDING\n1200 I8TH STREET, N. W.\nWASHINGTON 6, D. C.\nMr. Harry Skornia\nNational Association of\nEducational Broadcasters\n119 Gregory Hall\nUniversity of Illinois\nUrbana, Illinois\nDear Harry:\nApril 19, 1954\nreceivfd\nnaeb headquarters\nAPR 20 1954\nPM\n' €\nThanks for your letter of April 15 about\nthe placement service. I presume that being away you\ndid not receive my previous note expressing joy that\nNAEB will shortly be in position to do a real place¬\nment job. You will recall that I have been the one most\neager to see you get going in this, for I feel that this\nis going to be one of the very vital requirements for\nthe success of educational television, and I do hope\nthat you will have sufficient budget to do the scale of\njob that should be required. Incidentally, it has\noccurred to me that some means should be found for\ngiving in-service training, and up-grading to some\nof the people who come along who have good experience\nrecords of one sort or another but little or no actual\ntelevision experience.\nOur own efforts in this regard have been\nquite minor and incorporated in our regular budget.\nWe simply assigned one of our girls to pulling the\nvarious letters, etc. we had received together, and\nshe devised a form which she circulated to past appli¬\ncants to get a measurement of their present interest\nand experience. It’s not an extensive file at all, and\ncertainly nothing such as there should be. She will\nget it bundled up and off to you as soon as she can.\nI was hopeful that Mr. Walker could get\ndown to Washington so he could see the problems we\nconfront (and Ralph, of course, too) and thus be in\nbetter position to serve us. I presume that we shall\ncontinue to get letters, people will continue to drop\nin, etc. , and we shall have to have some way of tak¬\ning care of them, and assuring proper follow-through.\nBut all this can be worked out as we go along.\nCordially,\n7 do\nRobert R. Mullen\nExecutive Director"
}