{
  "id": "d836-22",
  "text": "COPY\nNATIONAL CITIZENS COMMITTEE FOR EDUCATIONAL TELEVISION\nSuita 602, King Building\n1200 18th Street, N.W.\nWashington 6, D. C.\nApril 19, 1954\nMr. Harry Skornia\nNational Association of\nEducational Broadcasters\n119 Gregory Hall\nUniversity of Illinois\nUrbana, Illinois\nDear Harry?\nThanks for your letter of April 35 about the placement service.\n•* presume that being away you did not receive my previous not© expressing\njoy that MSB will shortly be in position to do a real placement job. You\nwill recall that I have been tHe one most stager to so© you get going in this,\nfor I feel that this is going to be one of tie very vital requirements for\nthe success of educational television, and I do hope that you will have\nsufficient budget to do the scale of job that should be required. Incidentally,\nit has occurred to k© that some msans should be found for giving in-service\ntraining, and up-grading to seme of the people who come along who have good\nexperience records of one sort or another but little or no actual television\nexperience.\nOur own efforts in this regard have been quite minor and incorporated\nin our regular budget. We simply assigned one of our girls to pulling the\nvarious letters, etc, we had received together, and she devised a form which\nshe circulated to past applicants to get a measurement of their present interest\nand experience. It66 not an extensive file at all, and certainly nothing such\nas there should be. She will get it bundled up and off to you as soon as she\ncan.\nI was hopeful that Mr. Walker could get down to Washington so he\ncould see problems w© confront (and Ralph, of course, too) and thus b* in\nbetter position to servo us. I presume that we shall continue to get letters,\npeople wi'l continue to drop in, etc., and we shall have to have some way of\ntaking care of them, and assuring proper follow-through. But all this can be\nworked out as we go along.\nCordially,\nRobert R„ Mullen\nExecutive Director\nNAE3 Headquarters\nApril 21, 1954"
}