{
  "id": "d836-38",
  "text": "3\nIf, *954\nRECEIVED\nNAEi3 HEADQUARTERS\nMAY 1 3 1954\nMr. Don Walker\nEducational Television and Radio\nPlacement Service\n19 Gregory Hal I\nUrbana, Illinois\nDear Don:\nAM PM\n7|8|9|10|n|'12|||2i?j4!8|?\ni\nMAY 1954 G-H'°\nIt Is good to know that tha WEB Educational Radio and\nTelevision Placeewnt Service is getting under way. Staffing\neducational stations with competent individuals Is one of the\nmost challenging tasks we face; It is also one of the most\nrapidly developing areas of responsibility as I am sure you\nhave already discovered.\n. for +h« P°st +hr«« years retained correspondence\nend records of Individuals Interested in positions in educational television\nstations, pending the ©stabIishment of a permanent placement agency. It now\nseems appropriate to transfer these files to you for incorporation Into\nyour total program.\nWe attempted only a general job classifications Station Manager, Program\nManager, Producer-Director, Junior Producer-Director, Chief Engineer, Writer,\nResearch, Legal, Promotion and Public Relations. Those who cannot be\neasjfy classified have been retained in a miscetianeous folder. Records of\nthose who hove obtained positions are In a folder entitled \"Placed\".\n^ *M individuals in our personnel file are included on a master list. In\naddition we have kept an alphabetical card file for easy reference. These,\ntogether with correspondence and information about each applicant are being sent\nto you under separate cover. We have notified ail of the 78 applicants that\ntheir records are being transferred to you. In the future all requests for\ninformation concerning positions In educational television will be referred\nto you.\n. ** realize the tremendous organization job you face in bringing\ntogether the applications assembled by the NAEB, the NCCET and the JCET.\nAs the patternc* operation emerges from this reorganization period we\nhope you will keep us informed of developments.\nSincerely,\nRalph Steette\nExecutive Director\nEnclosures (under separate cover)\nRS:BC:r /\ncc: Ausmus, Skornia, NCCET."
}