{
  "id": "d836-48",
  "text": "FUND FOR ADULT EDUCATION\nlTOL W errtwoTr^h° WenueT\n-©4 4- -e-R-E-E'H-9^'-i9-E-ET -\nPASADENA 5, CALI FORN IA\nJanuary 21, 1955\nMr. Frank E.ySchooley\nPresident, National Association\nof Educational. Broadcasters\nUniversity of Illinois\nlU Gregory Hall\nUrb&na, Illinois\nDear Mr. Schooley:\nRC .. .J /ED\nN i-.'.U J 'ARTERS\nk 0 iuoo\nP M\nJl?l?lW.1|12|l|2|8|4|5|?\ni\nYou will recall that Mr. Graydon Ausmus received a letter\n*1* dated March 26, 195^ from The Fund for Adult Education,\nannouncing the approval of a grant of $7>000 for one year\nbeginning April 1, 195^, to the National Association of\nEducational Broadcasters to make possible the establishment\nof a regular, comprehensive personnel service aimed at\nserving the needs of the entire field of educational tele¬\nvision and radio.\nYou will recall also that a letter dated April 23, 195^ to\nMr. Ausmus announced another grant of $7,000 to the\nNational Association of Educational Broadcasters for the\npurpose of continuing the personnel placement service for\na second year beginning April 1, 1955•\nIn discussions you have had with Mr. G. H. Griffiths of our\nstaff and from Dr. Harry J. Skomia's letter dated December 13,\n195I4. to Mr. Griffiths, it appears that it would be desirable\nto bring the time period covered by these grants into line\nwith your regular fiscal year ending June 30 and that in order\nto maintain continuity in the personnel placement services to\nJune 30, 1956 an additional amount of $1,500 is required. It\nis my pleasure to inform you therefore that the Fund has ap¬\nproved a grant of $1,500 to provide for the continuation of\nthe personnel placement service to June 30, 1956. The\nprovisions and terms of this grant will be the same as those\nset forth in my letters of March 26, 195^ and April 23, 195^\nto Mr. Ausmus with respect to the earlier grants.\nMr. Griffiths will continue to be in close touch with you.\nOur Board would like to receive a progress report on this\ngrant by May 1, 1955 io time for its meeting later that\nmonth. An audited financial statement at the end of your\nfiscal year would also be appreciated."
}