{
  "id": "d836-50",
  "text": "cc: Messrs. Blakely\nGriffiths!\nNims\nSkornia\nYoung\nMAR 2 0 1954\nPM\nl?l?lVlV(ll|J2| 118| 4| SjC\n1\nMarch 26, l$$k\nMr. Gf^don Ausnms, President\nNational Association of Educational Broadcasters\nBox 2002 /\nUniversity, Alabama\nDear Mr. Ausmus;\nIt gives me great pleasure, on behalf of our Board of Directors,\nto tell you that the Board, at its meeting on January 20, 1954,\napproved a grant of $7,000 for one year beginning April 1, 1954\nto the National Association of Educational Broadcasters to\npossible the establishment of a regular, comprehensive personnel\nservice aimed at serving the needs of the entire field of\neducational television and radio. A check in the amount of $7,000\nwill be sent by our accounting department to Mr. Harry J. Skornia,\nExecutive Director of the National Association of Educational\nBroadcasters.\nOur Directors understand that this service will place on an\norganized and more efficient basis the placement and personnel\nclassification functions at present handled by a variety of\norganizations. It is understood that the director and secretary\nof the placement bureau will be full-time staff employees of the\nNational Association of Educational Broadcasters. Systematic\nefforts will be made by them to maintain files as nearly complete\nas possible on all qualified personnel seeking positions in the\nfields of educational television and radio. This service by the\nAssociation will be made generally known both among its member\nstations and others, and inquiries from all sources, whether NAEB\nmembers or not, concerning personnel will be given full attention.\nIn short, it is understood that this grant will make it possible\nfor the NAEB to meet all present and prospective needs for a\ngeneral personnel placement service in all aspects of educational\ntelevision and radio.\nOur Board would appreciate a progress report on this project in\ntime for our annual meeting, which will take place in October 1954.\nSuch a report should be in our hands by the first of October. At\nthe close of your fiscal year we should appreciate an audited\nfinancial statement with respect to the project."
}