{
  "id": "d1179-1",
  "text": "is responsible for producing the new Washington\nradio report being developed for the NAEB Radio\nNetwork. He will also investigate other program\nsources in the capital. He is on leave from WBKY\nuntil June.\nMrs. Schmidt Leaves NAEB\nRose Schmidt, staff associate, is leaving her NAEB\npost this month to accept a position with the bio¬\nchemistry department of the University of Illinois.\nMrs. Schmidt has been with the NAEB since Jan¬\nuary, 1959, starting as secretary and being promoted\nto staff associate in January, 1960.\nNAEB Starts Sabbaticals File\nAnyone interested in working on short-term com¬\nmunication projects in connection with the NAEB\nduring the next three years should notify the Wash¬\nington office now. Information needed is:\n• When leave can be taken from your institution—\nand for how long.\n• Your general field of interest.\n• Your qualifications and background.\n• Would you be interested in short-term projects of\ntwo or three months’ duration? Or must it be a full\nsemester or year assignment?\n• Financial requirements.\n• Willingness to go overseas.\nNAEB Tour and Group Insurance\nSeveral people have written in for more information\nabout the NAEB plans for a tour of broadcasting\nfacilities of the world and about the group insurance\nproposal. Both of these items were mentioned in the\nDecember Newsletter. More information will be forth¬\ncoming when it is apparent that there is enough\ninterest in either plan. A minimum of 20 to 30 people\nwill be necessary for the tour to be organized.\nInstitutional Member Changes\nElectron Corporation, of Dallas, Texas, has joined the\nNAEB as an Industrial Associate. The company manu¬\nfactures low-power television transmitting and auxil¬\niary equipment, CCTV cameras, video monitors, video\nswitchers, audio consoles, and TV translators.\nElectron says it can supply a complete low-power\nVHF or UHF station for as low as $30,000, from\nengineering services to cameras, transmitter, and an¬\ntenna. The company’s first such installation was edu¬\ncational KRET-TV at Richardson, Texas.\nThe most recent NAEB Active members are\nFranklin College of Indiana (WFCI), the Greater\nToledo ETV Foundation (WGTE-TV), The River¬\nside Church, New York City (WRVR), and the\nWeber County School District, Ogden, Utah (KWCS-\nTV). The latter was formerly an Associate member.\nInstitutions to join recently as Associates are the\nUniversity of California Medical Center, San Fran¬\ncisco; the College of Wooster, Wooster, Ohio; and\nLos Angeles State College, Los Angeles. Two in¬\nstitutions changed from Affiliates to Associates:\nHenry Ford Museum, Dearborn, Michigan, and the\nChicago Board of Rabbis—Broadcasting Commission.\nNew Affiliate members are the State University\nof New York at Fredonia and the American Medical\nAssociation.\nIndividual Member Roll Passes 700\nDuring the month of December, the 700th Individual\nMember joined the NAEB. During the year 1960,\nthese memberships increased at the rate of 100 each\nsix months.\nI960 Convention Rated\nOf the 370 official registrants at the 1960 conven¬\ntion in San Francisco, 155 returned the post-confer¬\nence questionnaires. On the whole these people con¬\nsidered the convention quite successful, with 121\nrating the convention at the high end of the scale;\n24 rated it midway; and 6 rated it below the mid¬\npoint of the scale.\nThe general session speakers were considered the\nmost effective part of the convention—with 61 votes.\nInformal discussion followed with 33, sectional meet¬\nings with 17, business sessions with 15, and exhibits\nwith 13.\nSome of those responding to the questionnaire\nmade suggestions for improving future conventions.\nAmong these were:\n• Have more work sessions in which the general\nmembership may take an active part.\n• Have more time for small group discussions.\n• Have more sectional meetings, particularly for\npublic school people.\n• Have a more orderly and organized procedure,\nwith more time for business and better speakers for\nsmall group sessions.\n• Stress current problems and future prospects of\neducational broadcasting.\n• General sessions are too “general”; keep sessions\n“down to earth.”\nMost people felt that there was enough advance\npublicity (113); that they were personally involved\nin the convention (93) ; and that the conference\nschedule was neither too heavy nor too light but\nabout right (120).\nAs to exhibits, 141 respondees said they visited\nthe exhibits, 119 talked with exhibitors, 105 received\n2\nNEWSLETTER"
}