{
  "id": "d1696-3",
  "text": "percentages frequented the movies two or more\ntimes weekly. There was a tendency in all age-\ngroups toward relatively higher percentages of\nattendance for children from unfavorable homes.\n•\nTHREE helpful articles on the preparation of\nradio talks on home economics appeared in the\nNovember, 1935, issue of the Journal of Home\nEconomics. These are now available, bound to¬\ngether in reprint form, and may be obtained from\nthe Journal, 620 Mills Building, Washington,\nD. C. Suggestions based on long experience in\nbroadcasting are offered by Judith Waller, of\nthe National Broadcasting Company; Zelta\nRodenwald, of KOAC, the state-owned broad¬\ncasting station at Corvallis, Oregon; and Helen\nCrouch Douglass, of the United States Depart¬\nment of Agriculture.\n•\nENGLAND has grown intensely interested in\ncolor, says Lloyd Knechtel in the March issue of\nthe American Cinematographer. “New or nearly\nnew color-processes are springing up overnight\nlike so many weeds. As is well known, Techni¬\ncolor is putting up a plant near London. . . .\nOne—of my most interesting experiences came\nwhen we were testing the process, and I had the\nprivilege of filming some of the parades held in\nconnection with King George’s Jubilee last sum¬\nmer. It was a magnificent spectacle, and with\nthe reds and blues predominating in the flags\nand uniforms, made a striking color subject.”\n•\nAN EXCELLENT opportunity for music edu¬\ncators to become familiar with the radio and the\nintricate techniques of broadcasting music is\noffered by the Music Educators Radio Forum.\nThe Forum is sponsored by station WHK at\nCleveland, under the direction of Larry Roller,\nand has contact with some two hundred music\nsupervisors in the northeastern district of Ohio.\nThe second meeting of this organization was\nheld on March 22 at Cleveland, and included,\nbesides discussion, two informative talks and two\ndemonstrations of radio music programs.\n•\nOF WHAT are motion-picture snowflakes made?\nHow are sound pictures recorded? What is a\n“proxy,” and what does a “cutter” do? Movie¬\nmakers by John J. Floherty answers these ques¬\ntions to the accompaniment of excellent candid-\ncamera shots. The book is labeled “for all ages,”\nbut should have special appeal for young people.\nIt is a Doubleday-Doran book and sells for $2.\n•\nTHE author of the first article in this issue,\nMeredith Page, is Director of the Radio Work¬\nshop and Research Associate of the Bureau of\nEducational Research, Ohio State University.\nNEWS OR VIEWS\nTeachers who have groups of pupils interested in mak¬\ning studies of the content of news reels may find the\nfollowing data and classifications useful. The findings are\nfor the year 1931—32. It will be noted that in this year the\nrelationship between war-army-navy and world-peace items\nwas twelve to one. Further study in 1933 disclosed seven\nwar items to one peace item, while in 1935 the ratio was\nabout eight war items to one peace item.\nTABLE I\nType of Subject-Matter Contained in Two Newsreels\n—\nX\nY\nCategory\nRank\nAccording\nto\nFrequency\nPercentage\nof\nDifferent\nRank\nAccording\nFrequency\nPercentage\nof\nDifferent\nItems\n(1)\n(2)\n(3)\n(4)\n(5)\nSports.\n1\n14\n1\n30\nAnimals, birds, fish, insects....\n2\n9\n12\n2\nWar, army, and navy.\n3\n9\n2\n12\nAviation (civil).\n4\n7\n4\n5\nEngineering a-nd scientific mar¬\nvels and inventions.\n5\n7\n20\n1\nAccidents, fires, storms, wrecks,\nand disasters.\n6\n6\n16\n2\nConventions, reunions, contests,\nparades, festivals, pageants . . .\n7\nS\nS\n5\nGovernment and civic officials.\n8\nS\n3\n10\nEconomic conditions.\n9\ns\n9\n3\nCuriosities and freaks.\n10\ns\n25\n0.3\nPolice and criminal activities. .\n11\n4\n7\n4\nGovernmental, political, and\ncivic affairs.\nI2\n4\n8\n4\nReligion.\n13\n3\n19\n1\nEducation and instruction.\n14\n3\n14\n2\nCommerce, transportation, and\nindustry.\nIS\n3\n18\nCelebrities.\n16\n2\n11\n2\nProhibition and liquor.\n17\n2\n6\n4\nChildren and their activities. . . .\n18\n2\n17\n2\nEntertainment.\n19\n2\n24\n0.6\nFashion shows.\n20\n1\n15\n2\nWorld peace.\n21\n0.7\n22\ni\nBeauty contests..\n22;\no-5\n23-\n0.7\nExploration and adventure.\n23\n0.5\n26\no.i\nMusic.\n24\n0.2\n10\n2\nScenic splendors.\n25\n0.2\n21\n1\nDancing.\n26\n0.1\n13\n2\nTotal..\nIOO\n| IOO\nHere are some questions that should be asked in connec¬\ntion with news reels: Why do war items predominate so\nstrongly over peace items? Is the heavy emphasis on sports\njustified in terms of public interest? How should you rank\nthe various news reels in relation to their fairness and lack\nof bias in presenting the news? Edgar Dale"
}