{
  "id": "d1251-2",
  "text": "(3)\nApr, !8 - Parties and People\nApr© 23 - \"Over There”\nUnit 8; \"It Shall Not Perish\"\n(Post War problems * World War 2, summary and good citizenship)\nApr. 30 - Challenge to Democracy\nMay 7 - Blackout\nMay 14 - \"The People, Yes\"\nIn the fields of school broadcasting, W H a is especially well situated\nTO FURTHER THE \"DEFENSE EFFORT\" (QUOTES BECAUSE 0 F THE DACK OF A DEFI¬\nNITION)© Teachers in service and station workers cooperate to make this\nA PRACTICAL COURSE FOR SCHOOL LISTENING©\nAdult and Youth Listening\n\"Following Congress,\" a feature of the Wisconsin College of the air,\nFOR FIVE CONSECUTIVE YEARS, IS GIVING LISTENERS WEEK-BY-..EEK REPORTS\nON CONGRESSIONAL DEBATE-ANO IN THESE TIMES THAT ANS DEFENSC^^\nPRESENTS THE PROS AND CONS HEARD IN CONGRESS ON SUCH TOPICo A®\nSERVICE, ARMAMENTS, NEUTRALITY REVISION, AND OTHER SUBJECTS WHICH MAKE\nTHE HEADLINES. *T PRESENTS AUTHENTICATED REPORTS IN 1 HE BELIEF THAT\n\"an informed nation is one of America’s best defenseSo\nOther Wisconsin College of the Air courses bearing °n the current\nWORLD SITUATION, CONSIDERING ITS RELATIONSHIP TO THE UNITED ^TATt^S\nare \"The World Today Through Literature,\" in which outstanding works\nBY SE1 ECTEO AUTHORS ARE CONSIDERED, AND \"EXPLORING AMERICANA, A STUDY\nOF THE ELEMENTS WHICH MAKE UP THE CITIZENRY OF THE UNITED STATES.\nW h A Originates Land Grant College Broadcast.for Nejwork\nOn November 19, the National Farm and Home hour (on n!'wTLCoLi-ge’\nSENTED FROM THE RADIO HALL STUDIOS AS THE MONTHLY LAND ^ANT COLLEGE\nPROGRAM.- THE KEYNOTE OF THE PROGRAM WI^LLBE^THE P.A^OF A^REA t\nW IHC. I IHu 1 W ---\npkuukamo- The keynote of the program will\nUNIVERSITY IN THE CURRENT CRITICAL TIME AND IN A POST-VAR WORLD.\nThe program was written and will be presented under th- direction\nThe PROGRAM\nOF w H A WORKERS\nAmong the stock announcements used on W H A in October are those from\nU. S. Maritime Commission, U. S. Marine Corps, U. S. Army, U. S. Navy,\nNAB Manpower Announcements, Defense Bonds, and Wisconsin Motor\nVehicle Department. (TRUCK MOBI LIZA.ION SURVEY)\nW NYC REBftOAQCASTS ROOSi?' \\LT TALKS\nFollowing its regular custom of rebroadcasting important defense\nTALKS FOR THE BENEFIT OF THE HOUSEWIVES AND OFF8CE WORKERS OF THE\ncity W N Y C, New York's own Station, scbeduled two rebroadcasts\nof President Roosevelt’s \"Navy Day\" speech. The rebroadcasts, in\ntranscribed form, were heard at 7:30 and I I:\\3 a.m« on Tuesday,\nOctober 28th©"
}