{
  "id": "d1506-0",
  "text": "1346 Connecticut Avenue, N.W.\nWashington 6, D. C.\nPhone North 7-6000\nVol. II No. 3\nMarch 1963\nI have just read with interest the January issue of the Carnegie Corporation\nQuarterly,which is devoted to Education and Politics. Since many thoughts contained\ntherein echo some ideas I have been trying to express recently, I have chosen to\nreprint the lead article.\nThere are some perfectly decent words that nice Americans seldom use\ntogether in the same phrase. \"Education\" and \"politics\" are two of them.\nWhile each word is quite all right on its own (although education is con¬\nsidered to be superior because it is \"spiritual\" while politics is \"era^s\"),\nthe two in combination seem to conjure up images of graft, corruption,\nand even \"propagandizing.\"\nActually, the notion that politics and education should not have any¬\nthing to do with each other is based on a misunderstanding both of politics\nand of the role of education in a democracy and how that role is deter¬\nmined. And the idea that they do not have anything to do with each other\nflies in the face of the facts.\nPublic education is paid for by public funds, and public funds are\nraised, and allocated, through the political process. Through this pro¬\ncess, the community-~as small as the township, as large as the nation—\ndecides both the total amount it is prepared to spend for a host of public\nbenefits, and how the total amount will be split up among them all. In\nshort, the political forum is where the citizenry fights about the things\nit cares about; it is where the public assigns priorities and establishes\nits values in rank order.\nNot everyone comprehends this trading out of interests in the politi¬\ncal market place. That is *ne reason why many political decisions do not\nin fact reflect accurately the most widely held public values but do •ften\nreflect those of \"interests\" which understand the political process very\nwell indeed. In these cases, where does the fault lie except with those\nwho are either too lazy or too naive t» press the case effectively for\ntheir own \"interests\"?"
}