{
  "id": "d1451-0",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nBULLETIN\nNorman, Oklahoma May 25, 1935\nPresident: W. I. Griffith, Iowa State College\nVice-President: H. G. Ingham, University of Kansas\nSecretary-Treasurer: B. B. Brackett, University of\nSouth Dakota\nExecutive Secretary: T. M. Beaird, University of Oklahoma\nGreetings to NAEB Members and Friends:\nThis was to have been the April bulletin; however, because of the Institute at\nColumbus and because contributions were rather slow in coming in it has turned out\nto be the May bulletin instead—and probably the last bulletin for this school\nyear. The next issue will probably be sent out in September.\nAs you know, the time and place of our annual fall conference are now being consid¬\nered* You have probably received a form letter and a ballot from President\nGriffith. Your cooperation in sending in your vote soon will be appreciated very\nmuch.\nWe are glad to advise that a number of new members have been added to the NAEB—-\nboth station members and associate members. We have had requests from several\nstations for membership blanks like the one published in the March bulletin. For\nthat reason, another blank is included with this bulletin.\nWe trust that you will have a pleasant summer’s work—and vacation.\nT. M, Beaird\nWNAD\nKUSD\nThe following news items and comments were sent in by Dr, B. B. Brackett, Director\nof Station KUSD, University of South Dakota, and Secretary-Treasurer of the NAEB.\n\"The University of South Dakota and the staff of KUSD regret very deeply that\nPresident Herman G. James is to leave at the end of June for the Presidency of one\nof the Ohio State Institutions—the Ohio University at Athens, Ohio. President\nJames has shown unusual interest in educational broadcasting while at the University\nof South Dakota. He has spoken over KUSD many times. Last September he attended\nthe annual meeting of the NAEB at Kansas City, and was one of the three regular\nspeakers on the session in charge of our association at the recent Institute for\nEducation by Radio at Columbus, Ohio. Dr, James spoke on democracy and the Radio’\nand his address was one of the very finest given at any of the seven sessions\nthe Institute,\n\"It is not definitely known here at this time what will be the attitude towards\neducational broadcasting of I. D, Weeks, State Superintendent of Public Instruction\nfor South Dakota, who will succeed President James on July 1. However, there is\nreason to believe that Superintendent Weeks, as President Weeks, will heartily"
}