{
  "id": "d1451-5",
  "text": "NAEB-May-6.\n,fWe decided that the thing educators must do first to improve the radio programs is\nto learn how to write excellent scripts.-——V*e talked the matter over with Dr..\nW. W. Charters, dean of the School of Education, Ohio State University, and chairman\nof the Radio Institute since its inception six years ago. He immediately suggested\nthat a meeting of educational script writers be called to discuss their problems\nat the close of the morning session Wednesday.”\nEDUCATIONAL SCRIPT WRITERS CONFERENCE\n(As reported by Miss Blanche Young in a letter to Dr. W, W, Charters)\n\"It was suggested: (l) That we attempt to secure some sample copies of successful\nscripts from national broadcasters. (3) To have these critically analyzed by some\nexpert. Mr. Allen Miller of Chicago University suggested that Mr. Cooper,\nContinuity Editor for NBC there might be willing to help us do this. In a conver¬\nsation later with Miss ViTaller about this matter, she said that Mr. Cooper would\nprobably be glad to help us in this way,\n\"(3) After this large group of scripts is secured and classified into different\ntypes, a list of these with descriptions be made and sent to those who were present\nat this meeting, so that they can order copies of scripts in which they are inter¬\nested. These scripts are to be used for study purposes only and are to cost\nprobably ton cents to defray the cost of mimeographing and mailing. To do even this\nmuch would require not only a great deal of time but expense in postage and\nsecretarial services to care for handling. It was the general vote of those present\nthat I take charge of the organization of a committee and appoint on that committee\nthoso persons who were determined to be most helpful and who had the time to give\nto the work. Miss Pauline Gibson of the Scholastic Radio Guild in Pittsburgh\noffered to help secure different types of scripts since they have already started\nsuch a collection at their office. She is, however, now on a leave of absence until\nAugust and will not be at her desk in Pittsburgh until that time. However, she\nwill try to collect some scripts from radio stations she happens to visit throughout\nthe west and northwest in her summer travels,\n\"Some such plan to exchange educational scripts was apparently started by Mr. Loucks\nof the National Association of Broadcasters and'failed because it was discovered\nthat people sent only their second best scripts, saving their best for future sale\nor use in other ways. Joe Ries, of WLW, offered tho suggestion later in a conver¬\nsation that scripts sold to large stations arc sold with one time broadcast rights\nonly and that the station would not have the right to give any one a copy of such\nscripts. He also said that the bost material on the air is kept by the broadcaster\nfor publication later n or for resale. So unless we can assure the script writers\nthat we want the scripts for study purposes only, we may have difficulties\nstarting such a service. Before writing to ask for scripts, it should be determined\ndefinitely how they are to be used. Besides, script:waiters may object to our havin\nscripts mimeographed for resale even for study purposes*\n\"The idea of having a lending library of scripts was brought up, but it was\ndecided that those present would prefer to pay ten cents for a copy and keep it\nfor use when they were ready, rather than have the bother of mailing back the\nscript at a certain time.\n\"The following suggestions can be carried out, however. 1. To notify the\nNational Association of Educational Broadcasters of this proposed plan and have one\nof their meetings set aside at the September meeting for a discussion of.the\nproblem. 2. To have an exhibit of sample scripts at the next Institute in Columbus"
}