{
  "id": "d1451-6",
  "text": "NAEB-May--7.\nand a further discussion of the problem#\" ——-\nWriters of educational scripts who attended the meeting reported above included:\nBetty (Elizabeth) Boone, WHAT, Philadelphia Shut-In Society, 2100 Arch\nStreet, Philadelphia\nClarence T* Peters, WKZO, Central High School, Michigan Public Schools,\nKalamazoo, Michigan\nVem Hansen, WHA, Madison, Wisconsin\nMarguerite B* Felber, 727 North Howard Street, Akron, Ohio\nKatherine Hunter, League of Nations Association, 203 South Dearborn\nStreet, Chicago ,\nFrances Scudder, Director, Syracuse Home Bureau, 406 Seitz, Syracuse,\nNew York\nMrso Clara Ea Neal, WGAJR, Travel Club of the Air, 8909 Detroit\nAvenue, Cleveland, Ohio\nBruco E„ Mahan, Director, Extension Division, State University of Iowa,\nIowa City\nPaulino Gibson, Scholastic Radio Guild, Chamber of Commerce Building,\nPittsburgh, Pennsylvania\nAllen Miller, University of Chicago, Chicago, Illinois\nMarjorie Dunipacc, Ohio State Library, Columbus, Ohio\nAlva W. Smith, Ohio State University, Columbus, Ohio\nDr* W. 17. Charters, Ohio State University, Columbus, Ohio\nFred Reeder, Technical High School, Indianapolis, Indiana\nBlanche Young, Assistant Director, Department of Publications,\nIndianapolis Public Schools, Indianapolis, Indiana\nREMINDERS\nThe College of Arts and Sciences of the University of Florida which presents a\nfifteen-minute broadcast over Station WRUF each Tuesday and Thursday ovening during\nthe college year has what appears to be a very effective method of seeing that the\nbroadcasts are presented as scheduled# The Doan of the College has a radio com¬\nmittee, and each member of this committee has charge of the addresses to be broad**\ncast by several departments# Those who are to present the addresses are sent a\nletter some time in advance of the broadcasts and are requested to supply two\ncopies of the address to the proper membor of the Radio Program Committee# One\ncopy of each address is required to be given to the director of WRUF one week in\nadvance of the broadcast# This is a station requirement#\nPHANTOM MASK\nPhantom Mask, national radio drama fraternity, which was organized at the University\nof Oklahoma in 1931, has recently completed its year’s activities with a high\nschool radio play production contest# This contest, and a similar contest\nsponsored early in April for Oklahoma junior colleges, were the first contest of\nthis kind ever held in this section of the country. These contests will be annual\nevents as they proved very popular and interesting this year*\nOther activities sponsored by Phantom Mask included a radio-play writing short\ncourse in December, and the third annual radio-play writing contest which closed\nin February. In addition, about thirty plays wore broadcast over WNAD."
}