{
  "id": "d1824-1",
  "text": "NAEB NEWS LETTER.FEBRUARY 1, 1941.Page 2\nthe University of Wisconsin from the spark-transmitter days in\n1915 to the present* It is well accepted by schools, clubs, and\nother groups wishing program material.\nHarold Engel, WHA public relations, will be in charge of radio\nactivities at the University of Wyoming again in the 1941 summer\nsession. He vail teach a visual education course in addition\nto two radio courses.\nABBOT ON LEAVE\nWaldo Abbot is on a Sabbatical from the University of Michigan\nfor the second semester. From Feb. 15 to March 15 he plans to\nbe in New York reading proof and getting out an index for his\nrevised edition of the Handbook on Broadcasting. His New York\naddress: Beaux Arts Apartments, East 44th St. On March 15th\nhe*s heading South. For the next 30 days his address will be:\nCoccoloba Cottage, Fort Lauderdale, Florida. Then try to catch\nhim. Joe Maddy is Acting Director of Broadcasting at Michigan\nduring Waldo* s absence.\nWNAD ASKS FOR NEW WAVELENGTHMORE TIME\nWNAD, University of Oklahoma radio--station, has made application\nto the federal communications commission for a new wave length,\neffective March 29, which will give it unlimited daytime operation,\nHomer R. Heck, director, has announced.\nThe present frequency of 1010 kilocycles which the station shares\nwith KGGF, Coffeyville, Kan., will be changed to 640 kilocycles\nand broadcasting hours will be stepped up from 9 hours a week to\n54 if the request is granted.\nWith the change will come the erection of an antenna tower on the\nwest edge of the university golf course and the moving of the trans¬\nmitter from the Engineering laboratory to the Fieldhouse. Studios\nwill remain in the Union tower.\n\"These changes will give us a possible range of 350 miles and almost\ncomplete state Coverage, whereas our present range is less than\n100 miles,\" Reck said.\n\"We have chosen a frequency not particularly desirable to commercial\nstations for daytime operation, so there seems to be nothing to\ninterfere with the approval of the federal communications commission.\"\nH. H. Leake, production manager of WNAD, has outlined a tentative\nschedule which calls for broadcasts from classrooms and the present¬\nation of concerts and lectures for use in music, history and science\nclasses.\nLeake said that many of the present weekly programs will be extended\nto daily programs and that the state department of agriculture,\nhealth, and education will have a chance to broadcast their activities*"
}