{
  "id": "d1725-1",
  "text": "n.A.E.B. Kews Letter\nFebruary 15, 1939\nPage 2\nPractical reauirefbetj fc reccrdikg- s.„uip lent\nBy Lr. E. D. Peterson, ElectroBound Products, Inc.\nEditor’s Note - This article, by Lr* Peterson, is based upon some\nof the remarks made at the x^entucky convention and was prepared\nespecially for NAEB members.\n1. TURNX<i3LEJ - This unit should be fabricated from material that\nwill not bend or warp so that the surface presented to the record\nis substantially flat and parallel to the line of travel of the\ncutting head. It is practical to fabricate a turntable that will\nnot vary more t.ian plus or minus .003 of an inch in any direction\nwhile being rotated. It should be heavy enough and so designed\nthat it wll not easily vibrate or ring or rumble when receiving\na slight mechan&aX impulse. 1\n2. TUiiNTABLE BEARING - Ball bearings or roller bearings have not\nbeen successful to date for this purpose because of tihe rumble they\nintroduce. A 16\" turntable should have at least a 1 inch diameter\nshaft and a bearing about 4 inches long. The weight of the turn¬\ntable is usually received by a large ball at the .lower end of\nthis bearing. This ball should rest on a glass-hard flat surface\nso that it will not form indentations as the ball in rotating\nwill raise and lower slightly causing a vertical displacement of\nthe turntable, which in extreme instances, may result in a thump¬\ning sound 'in the recording.\n3. LATHE The cutting head carriage should be designed so that\nthere is a minimum chance of any lateral play; that is, when the\ncutting head carriage is engaged with the lead screw or any device,\nthe cutting head should not have any perceptible movemdat in either\ndirection of the movem^it the cutting stylus. Needless to say,\nthe bearing surface the carriage rides across the record on should\nbe smooth and not function as a lead screw as well. This would\nre Quire the carriage to ride on a threaded rod which would wear\nit \"and allow the gradual development of side play in the cutting\nhead.' The assembly that guides the cutting head across the record\nshould be within 3j Inches of the center of the table or in line\nwith the center of the table so that any play in the guide rods or\nany other assemblies used to control a lateral travel of the cutting\nhead will not be unduly amplified. The lead screw should have as\nmany threads to the inch as possible as this will in turn drive the\ncutting head at a more uniform speed. It i3 also very desirable\nto have the carriage e pige as many threads on the lead screw as\npossible to eliminate uneven spacing of lines due to any Irregu-\nlarli&es4 in 'tlieie : a screw. It is very Important that everything\ncontributing to the irregular spacing of grooves, as an irregulari¬\nty of only .001 of an Inch may drop the -maximum pem lssable record¬\ning level as much as 10 I)B.» some means of easily adjusting the\nangle are readily obtained. The mechanism that drives the lead\nscrew should be so arranged * that it will reverse the motion and\nchange the speed of the lead screw. This will allowthe cutting\nof records fro.: inside out or outside in and at variable lines\nper inch with one lead screw. The better machines now incorporate\na line spreader as standard equipment. This is a very useful\ndevice for indicating the exact location of any passage on a"
}