{
  "id": "d1872-2",
  "text": "NAEB NEWS LETTER.•..JULY 1, 1940....Page 3\nown station, ir> shown in perusal of the station’s daily programs\nwhich are made available in mimeographed form to newspapers and radio\npublications. Looks like Director Novik must be busy this summer,\nwith usual run of programs, plus the special ones from the New York\nWorld’s Fair.\nINDIANA’S RADIO WORK CONFERENCE\nAllen Killer, URC, Chicago, Jim Ebel and Frank Schooley, WILL, were\namong the NaEB members seen at the North Central Radio Work Conference\nheld on Indiana University campus June SO, and 21. The conference\nwas held under the direction of NAEB’s and Indiana’s Bob .alien,.\nMajor Armstrong was on hand to discuss frequency modulation. There\nwere other highlights, but most of the conference was an open-forum\nwith all in attendance participating in the discussions. Incidentally,\nplan to see the new building on the Indiana campus which will house\nthe future Indiana U. radio facilities, drama, speech, and public\nAuditorium. Professor Lee Norvell personally conducted a tour of\nradio people at the time of the conference.\nSYMPOSIUM ON RADIO AND LIBRARIES\nThe NaEB Executive Secretary participated in a panel discussion on\nRadio and Libraries at the second annual Library Institute of 'Washington\nUniversity, St. Louis, on June 12th. Others on the panel were: Miss\nHarriet Edwards, Educational director of KMOX; John Tinnea, program\ndirector of KWK, and Rudy Dailmeyer, in charge of radio activities,\nWashington University.\nPRESENT LICENSES EXTENDED TO OCTOBER\nIn order to permit further studies of the frequency assignments to\nstations under the North American Regional Broadcast Agreement, the\nFederal Communications Commission has extended standard broadcast\nstation licenses expiring August 1 for an additional two months, to\nOctober 1. The Commission will announce at a later date the procedure\nwith respect to the licensing of facilities which will be available\nunder the provisions of this agreement.\nThe new order applies to all standard broadcast stations, and auto¬\nmatically extends the expiration date of all licenses for which\napplications for renewals have been filed® Modified licenses to cover\nthe new expiration date will not be issued.\nLicensees who have not as yet submitted renewal applications are\nnotified that in order to permit operation after August 1 applications\nfor renewal, based on the present authorized facilities, must be filed®\nHowever, if an application for renewal covering the period beyond\nAugust 1 has been filed, It will not be necessary to re-file such\napplication under the provisions of the new order.\nLicensees required to post the Commission*s order attached to\ntheir licenses in accordance with the rules governing posting of\nlicenses.\nSOME FCC ACTIONS\nKOAC, Oregon State College, has had its petition for rehearing and"
}