{
  "id": "d1129-2",
  "text": "NAEB NEWS LETTER\nPaQE 3\nJanuary, 1946\nPLICATIONS FOR NEW NON-COMMERCIAL STATIONS PENDING BEFORE THE COMMISSION\nFCC COMMISSIONER WILLS OPPOSES CONCENTRATION OF BROADCAST OWNERSHIP.\nA MEMBER OF THE FEDERAL COMMUNICATIONS COMMISSION STATED THAT DIVERSIFiEC\nCONTROL OF BROADCASTING STATIONS IS NECESSARY TO GUARD AGAINST THE PRO¬\nSPECT OF SOME American Hitler*\nThis statement came from FCC member William H. Wills in a speech pre¬\npared FOR broadcast (OVER « SAID WiLLS:\n”BY dispensing the control of AMERICAN BROADCASTING AS WIDELY AS POSSIBLE\nAMONG AS MANY DIVERGENT GROUPS AND INDIVIDUALS AS POSSIBLE, WE HOPE\nTHAT NO POWER CAN ARISE TO MISUSE AMERICAN BROADCASTING AS BROADCASTING\nHAS BEEN MISUSED ABROAD.\n“The Prospect of some American Hitler utilizing the tremendous power\nOF THE human VOICE OVER CUR BROADCASTING STATIONS IS MADE EVEN WORSE WHE^\nWE CONSIDER THE POSSIBILITY OF PROJECTING THE SIGHT AS WELL AS THE SOUND\nOF DEMAGOGUERY BY MEANS OF TELEVISION.”\nWills continued, saying; “In the United States, we have sought to\nAVOID THE DOMINATION OF BROADCASTING BY GOVERNMENT OR ANY INDIVIDUAL OR\nGROUP OF PROVATE 'INDIVI DUALS* WE SEEK OUR PROTECTION FROM THE MISUSE\nOF RADIO THROUGH THE MAINTENANCE OF COMPETITION.\n“The scope of the awful'catastrophe which Hitler let loose upon our worlc\nIS SO vast that we SHOULD NOT LET THE OTHER ASPECT OF HIS DIVILISH TECM“\nNIQUES MAKE US FORGET THAT IT WAS IN CONSIDERABLE PART RADIO BROADCAST¬\nING WHICH BROUGHT HIM TO ABSOLUTE POWER.”\nWILLS SAID IMPROVED MEANS OF BROADCASTING, INCLUDING TELEVISION AND\nFREQUENCY MODULATION (FM) BRING POSSIBILITIES FOR EVIL AS WELL AS QOODc\nHe SAID AT LEAST 2,000 FM BROADCAST STATIONS, AND PERHAPS MORE, AS CON¬\nTRASTED WITH FEWER THAN 1,000 STANDARD BROADCASTING STATIONS NOW ON THE\nAIR ARE EXPECTED TO BE BUILT,\nNOV IK LEAVES WNYC.\nMorris S. novik, former director of New York's municipallv-owned WNYC\nIS SPECIALIZING IN PUBLIC SERVICE RADIO SINCE HE LEFT HIS CITY JOB.\nYou MAY REMEMBER HE TENDERED HIS RESIGNATION TO FORMER MAYOR LaGuaRDIA\nTO TAKE EFFECT AT THE SAME TIME LaGUARDIA LEFT OFFICE.\nNOVIK is ACTING AS RADIO CONSULTANT TO LaGuARDIA AND WILL PROBABLY TAKE\nON SOME LABOR ACCOUNTS, PERHAPS HELPING DEVELOP FM PADIO PLANS FOR THE\nInternational Ladies Garment Workers Union. Latter outfit recently ap¬\nplied TO THE FCC for several LICENSES, AND IS EXPECTED TC GET AT LEAST\nAN FM OUTLET IN NEW YORK.\nIn his BUILDUP OF LaGuardia as a radio personality, Novik not only super¬\nvised THE N. Y. Mayor’s Sunday broadcasts over WNYC, but also placed"
}