{
  "id": "d1129-3",
  "text": "NAEB NEWS LETTER\nPage 4\nJanuary, 1946\nPROMOTIONAL ARTICLES IN ABOUT A HALF DOZEN NATIONAL MAQS DURING THE LAST\nYEAR, AND GENERALLY SPREAD THE WORD COAST-TO-COAST ABOUT LaGuARDIA AS\nA COLORFUL RADIO FIGURE.,\nWhen the Mayor finally was signed for two Sunday spots--15 minutes Sunda\nnights on the ABC WEB for Liberty mag, and 25 minutes Sunday noon on\nWJ2, N, Y,—LaGuardia by-passed talent agencies who were after him, the\npersonal rep work for him being done entirely by Novik,\nFLU EPIDE.VIC STARTS SCHOOL OF THE AIR SERIES,\nWhen the flu of near epidemic proportions hit Columbia, MOo, and caused\nTHE CLOSING OF ALL PUBLIC SCHOOLS FOR FOUR AND ONE-HALF DAYS LAST WEEK\nSTATION WFRU OFFERED ITS FACILITIES TO SUPT« OF SCHOOLS ZiEGLERo HE\nASSEMBLED 22 SCHOOL MARMS, REPRESENTING GRAMMAR AND HIGH SCHOOL AND\nMAPPED OUT ENTERTAINMENT, VIA THE ETHER, PLANNED FOR ASSEMBLIES DURING\nTHE SCHOOL WEEK*\nAll programs were given the highest priority in spot promotion and news-\nCASTSo While the shools were shuttered, two progpams, one 15 minutes\nand the other 30 MINUTES WERE AIRED FOR THE STUDENTS. A HEAVY STUDENT\nLISTENING WAS REPORTED AND NOW THE SCHOOL AUTHORITIES ARE WORKING OUT A\nREGULAR PUBLIC SCHOOL HOUR ON KFRU*\nTHIS AND THAT.\nYour editor has been on ThE loose again during the past month....\nVISITED Iowa, Wisconsin, and Michigan....William E. porter who prepare©\nAND presents MUSICAL ChATS ON WSUI, IS A WELL KNOWN AUTHOR. H|S\nLATEST, ”H|DE-0UT”, HAS JUST BEEN COMPLETED IN THE SATURDAY EVENING\nPost. You may see it some day as a movie....Had a long chat with Mac\nAND Harold Engle while in Madison on New Years Day...Harold is back in\nTHE saddle producing LIKE THE HaROLD OP OLD ONLY BETTER. HE HAD SOME\nVERY INTERESTING AND EDUCATIONAL EXPERIENCES WHILE WORKING FOR UNCLE\nSame.Waldo Abbot has some temporary studios under construction and\nCOMPLETE PLANS FOR A NEW RADIO UNIT IN ONE OF THE NEW BUILDINGS BEING\nCONSTRUCTED IN THE NEAR FUTURE ....ThE TEMPORARY SETUP INCLUDES TWO\nSTUDIOS, A CONTROL ROOM AND AN OFFICE FOR W'ALDO. ThE CON’ST RUCT I ON IS\nANYTHING BUT EMPORARY SINCE ALL THE NECESSITIES OF FINE ACOUSTICAL\ndesign are INCLUDED. ThE STUDIOS WILL BE TURNED OVER TO THE SPEECH\nDEPARTMENT WHEN THE NEW RADIO UNIT IS COMPLETED.....TALKED WITH CaRL\nWesser, consultant for the University of Michigan for some time....\nThey are trying to select a transmitter to order for the new station....\nReceived nice cards with seasons greatings from many NAEB membeps. Same\nTO YOU AND MANY MORE OF THEM,...TAKE OFF TOMORROW NOON FOR OhI 0 STATE.\nHope to confab with Bob Hiqgy while out there on the clear channel pro¬\nblem. ,, .Orchi ds TO John Ounn for the helpful information he submitted\nFOR Clear channel presentation....Don*t forget your NAEB Dues...Our\nDREAMS FOR 540 KC HAVE BEEN DASHED FOR AT LEAST ANOTHER YEAR BECAUSE\nTHE Navy still sees a need for the frequency.The surplus property\nSITUATION needs A GOOD BLAST OF TNT OR BETTER YET SOMETHING IN THE\nATOMIC LINE. ThE EQUIPMENT IS THERE BUT HOW CAN EDUCATION GET IT THRU\nALL THE BOTTLE NECKS, SIDE PRESSURE, AND LACK OF ACTION..,AnY SUGGESTION"
}