{
  "id": "d1667-0",
  "text": "/\nMEETING OP NATIONAL ASSOCIATION EDUCATIONAL BROADCASTERS AT\nCOLUMBUS* OHIO, MAY 7 , 'X/r1 1935.\nDuring the noonday Interval between sessions of the Institute for\nEducation by Radio at Columbus , Ohio, on May 7th,1935, in response\nto the invitation of President Griffith, an Informal conference was\nheld of members of the National Association of Educational Broadcasts#\nand friends of the association. At. 1:20 p.m, the following persons\nwere in attendance or consulted about the questions Involved soon\nafter that time.\nB.B.Brackett, University of South Dakota\nFranklin Dunham, Radio City, N.Y.City\nHarold A.Engel, University of Wisconsin\nW.I.Griffith,Iowa State College\nVern Hansen, Univrsity of Wise.\nH. C. Harshbarger , University of Iowa\nH. R. Heck , University of Okia.\nR. C. Higgy, Ohio State University\nW. F. Heimlich, Ohio State University\nBruce E. Mahan, State University of Iowa\nCarl Menzer, State University of Iowa\nAllen Miller, University of Chicago\nMrs.Clara Neal, 88o9 Detroit Ave.,Cleveland,Ohio\nArmstrong Perry, National Press Bldg.,Washington, D.C.\nH. G. McCarty, University of Wisconsin\nElmer G. Sulzer, University of Kentucky\nJos. F. Wright, University of Illinois\nMiss Blanche Young, Indianapolis (Ind.) Public Schools.150 N.\n(Meridian St.\nMr.franklin Dunham, Educational Director, NBC, Radio City, N.Y.City,\nreported that the NBC had a wealth scripts on their past programs,\nand asked if the members of the NAEB would like to use this material,\nif the NBC would permit It to be used. If permitted at all , the use\nmight consist In merely studying this script to guide in building\nnew programs or It might be possible to get consent to actually use\nfor broadcasting certain programs or parts of programs. Mr. Dunham\nsaid it was only his own idea that something In these lines might be\npossible, but he did not know that the NBC authorities would grant\nsuch permission. He only wished at that time to get; the reaction of\nour group to such a proposition.\nIn the second place, Mr. Dunham thought it might be possible that\nhelp of the NBC specialists might be extended to NaEB program directory\nIn building their programs. This was also uncertain, and we were\nasked what we would think about such a plan.\nIn the third place, Mr. Dunham thought it possible that some of the\nvery large cha#In broadcasts might be extended to the NaEB stations\nat a very low cost, if the individual stations might care to pay\nperhaps §50.00 for each program so furnished. In this as in the two\nother suggestions, the ideas were those of Mr. Dunham only , and he\n/asking/was merely/whether we were enough interested to justify him in carry¬\ning the ideas back to the NBC people with the assurance that the NAEB\nmembers wished him to do so."
}