{
  "id": "d1667-2",
  "text": "- 5 -\nSHORT FLASHES FROM THE FIELD\nWILL - University of Illinois* Jos. F. Wright, in a recent visit at News-\nLetter headquarters, reported that George Jennings, of the YfTLL staff, will, on\nMay 1, go to New York, on a General Education Board Fellowship, to study radio\ntechniques used by commercial broadcasters.\nWESG - Cornell University. Working with short-wave Chas. A. Taylor sends\nthis report:\nThe New York State College of Agriculture, in cooperation with stations W2XAD\nand W2XAF of the General Electric Company at Schenectady is broadcasting a series\nof international short wave addresses on the agriculture of the Northeastern United\nStates. The series began on February 25 and will continue until May 18, thirteen\nweeks with two broadcasts each Tuesday. One broadcast is given on W2XAD in English\nand is released at two-thirty in the afternoon and aimed for reception in (real\nBritain and Y/estern Europe. The other is broadcast in Spanish from W2XAF at 7:15 to\nSpanish .speaking countries of America and the West Indies. Essentially the same\ncopy is used for both broadcasts.\nin the different countries. The other purpose is to explore the methods and possi¬\nbilities in agricultural broadcasting by short wave to other countries. Incident¬\nally, we hope that these agricultural broadcasts will furnish some relief from the\ninternational broadcasting of politics and war news. We are finding many inter—\nagricSlturegS nobody seems to have known about international interests in\nSo far we have been able to provide as speakers for the Spanish program\ngraduate students in this University whose homes are in the various Spanish-\nAmerican countries. We hope to maintain that arrangement throughout the series.\nWNAD - University of Oklahoma. WNAD is broadcasting from beautiful new studios\non two floors of the Union Tower at the University of Oklahoma. The tower and\nstudios were built with the aid of Federal funds through the Works Progress Admin-\nlstration. They represent the finest in acoustical and engineering treatment, are\nbeautifully decorated, and are equipped with the latest word in broadcasting\nparaphernalia.\nWNAD is now broadcasting thirteen hours each week, and estimates that ap¬\nproximately one hundred fifty students go before the microphone during this period.\nA course in radio announcing has been inaugurated again this year, and the demand\nwas so great that admission to the class had to be made through passing a strenuous\naudition. Many new programs are to be found in the schedule this year.\nHomer Heck returned to the station as program manager after a fifteen-month\nleave of absence, during which time he directed the white collar program for the\nWorks Progress Administration. He is continuing his work in connection with radio\ndrama, and interest has grown on the campus and in the state to such sin extent that\nmore of this type of program are being broadcast this year than ever before.\nNAEB ADMINISTRATION - 1956-57\nPresident - H. B. McCarty, WHA, University of Wisconsin\nVice president- Carl Menzer, WSUI, University of Iowa\nSecretary-Treasurer - B. B. Brackett, KUSD, University of South Dakota\nExecutive Committee\nC.E. Damrnon, WBAA, Purdue University\nR.C. Higgy, WOSU, Ohio State University\nE.P. Humbert, WTAW, Texas A. & M. College\nW.E. Phillips, WILL, University of Illinois\nC.A. Taylor, WESG, Cornell University\nExecutive Secretary - H.A. Engel, WHA, University of Wisconsin"
}