{
  "id": "d1784-0",
  "text": "□□□□ m\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 GREGORY HALL URBANA, ILLINOIS\nNAEB EXECUTIVE COMMITTEE MEETING\nAmid wintry weather in Minneapolis, the NAEB\nExecutive Committee met January 10 and 11 to de¬\ntermine future plans and courses of action. Among\nother things, the Committee - consisting of President\nBurton Paulu, Treasurer Robert Coleman, Secretary\nJack McBride and ex-officio Executive Director\nHarry Skornia - formed 1957 NAEB committee mem¬\nbership and assignments. (The listings appear else¬\nwhere in the Newsletter.) Since Vice-President Rich¬\nard Hull was unable to be present, the Committee\nagreed President Paulu should discuss the main hap¬\npenings when he saw Hull in Columbus January 16.\nThe possibility was raised of setting aside a\nspecial day during the IERT to continue the NAEB\nluncheon. The idea was to have the luncheon serve\nalmost as a mid-year NAEB convention, with a busi¬\nness session immediately after the meal. Following\nthis idea, Paulu met the IERT Planning Committee\nJanuary 17, and results should be heard soon. He also\nplans to meet with the Institute Committee at Colum¬\nbus to set the date for the Utilization Day program.\nThe Executive Committee discussed this year’s\nTV Seminar-Workshops and the Kellogg Grant Work¬\nshop-Seminar; and forwarded their views to the Pro¬\nfessional Advancement Committee. Among other\nitems discussed were possible reruns of NAEB pro¬\ngrams, staff, space and budget problems of Head¬\nquarters, better orienting of young NAEBers, NAEB-\nJCET-ETRC relationships, distribution of NAEB\npublications and the future convention program.\n—NAEB—\nNAEB COMMITTEES FOR 1957\nThe following is a listing of all committees and\ncommittee-members appointed by the Executive Com¬\nmittee at their last meeting, Jan. 10 and 11.\nExecutive Committee: Burton Paulu, President;\nRichard Hull, Vice-President; Jack McBride, Sec¬\nretary; and Robert Coleman, Treasurer.\nAdvisory Committee to the President of the\nNAEB Newsletter\nVol. XXII, No. 2\nFebruary, 1957\nNAEB Newsletter, a monthly publication issued by the\nNational Association of Educational Broadcasters, 14 Gregory\nHall, Urbana, III., $5 a year, edited by Mrs. Judith Stevens.\nApplication for 2nd class mail privileges pending at Urbana,\nIllinois.\nETRC: Burton Paulu, Ch.; Frank Schooley, Jim\nRobertson, Armand Hunter, and Richard Hull, ex\nofficio.\nFoundations Committee: Frank Schooley, Ch.,\nBurton Paulu, Richard Hull, and James Miles.\nPermanent Financing Committee: James Miles,\nCh.; Richard Hull, William Harley, and Edward Ros¬\nenheim, Jr.\nAssociate Members: Robert Schenkkan, Ch.;\nRichard Bell, Harold Gregory, Frank Williams, Ger¬\nald Willsea, and Bill Cumming.\nAwards and Citations: Graydon Ausmus, Ch.;\nH. B. McCarty, Allen Miller, McCabe Day, Judith\nWaller, and Hugh Mix.\nEngineering Committee: *Carl Menzer, Ch.; B.\nA. Holmberg, ‘Keith Ketcham, Edward Kratt, Bob\nHiggy, John Boor, 'John Brugger, ■'John Chenoweth,\n■Fred Ramley, and George Murphy.\nGranis-In-Aid: Edward Rosenheim, Jr., Ch.; Lar¬\nry Frymire, Edwin Browne, and Harry Lamb.\nInternational Relations: Seymour Siegel, Ch.;\nKathleen Lardie, Marvin Alisky, Lawrence Creshkoff,\nI. K. Tyler, Bill Bender.\nMembership: Frank Schooley, Ch.; Kendall\nCrane, Lucille Ruby, Worthington Gregory, Edwin\nAdams, Howard Curtis, Richard Bell, and Uberto\nNeely.\nOrganizational Liaison: Gertrude Broderick, Ch.;\nGraydon Ausmus, Francis Byrnes, Franklin Dunham,\nAnna Hyer, Clara Logan, Vanett Lawler, Mrs. Lois\nMcCarthy, Mrs. Dorothy Smith, Ralph Steetle, Ray¬\nmond Wittcoff, Bart Griffith, Leslie Spence, Sydney\nHead, and Fred Garrigus.\nNEWSLETTER\nPage I"
}