{
  "id": "d1784-5",
  "text": "The first of this month Cohn and Marks, legal\ncounsel for NAEB, filed a protest to the FCC against\namending Section 3.182 (c) and (v) of the FCC\nRules and Regulations. This section provides pro¬\ntection to broadcasters that render a unique program\nservice.\nTEACHING BY TV\n► TV courses in 2nd-year Algebra, Trigonometry\nand Physics are being taught to high school students\nin twelve high schools in Oklahoma. Instruction is\npresented daily over KETA-TV, Oklahoma City.\nTests, notebooks, and assignments are graded by the\nTV teacher and returned to school; and scores are\ncomparable to those of regular classes in the same\nsubject.\n► WTHS-TV, Miami, started a new TV course on\nPsychology February 7th. The series will run 12\nweeks and features Dr. Jack Kapchan of the Uni¬\nversity of Miami Psychology staff. Upon paying\na $3 fee and passing a final exam, viewers will be en¬\ntitled to a certificate of completion.\n► Cincinnati Public Schools has put out “A Study\non the Effectiveness of TV as a Medium of Instruc¬\ntion in High School Chemistry 1955-56.” This mimeo¬\ngraphed study is based on a chemistry TV course\nWCET, Cincinnati, ran March through April, 1956,\nfor the city’s public schools.\n► High school seniors through TV are earning col¬\nlege credits in a new course presented by the State\nUniversity of New York, State College for Teachers\nat Albany, in cooperation with the Mohawk Hudson\nCouncil and General Electric station WRGB. This\nfirst credit offering via TV in New York State is also\navailable for credit to qualified adults who receive the\nprogram at home. The course, “Introductory Ge¬\nography,” started February 4th and is televised at\n11 a. m. three times weekly.\n► “Survey of English Literature,” a University of\nWichita TV course for college credit, is being telecast\nover KARD-TV, a commercial station in Wichita,\nKansas. The course deals with 18th century to pres¬\nent-day English authors, and is taught by Dr. Morton\nRosenbaum of the University of Wichita.\n► Two TV courses are being offered by Indiana\nUniversity over WTTV. “Individual Study in\nGuidance” and “Introduction to American Govern¬\nment II” are the two TV-home study courses for col¬\nlege credit.\nLETTER FROM PARIS\nBy Keith Engar\nThe French Broadcasting System maintains a\nunique section called “The Club d’Essai” — tryout\nclub. It’s devoted to experimentation in Radio and\nTV, to the publication of a first-rate periodical called\nCahiers d’Etudes (which contains many articles in\nEnglish — it’s a cosmopolitan, international periodi¬\ncal devoted to radio-TV), and to training students in\nskills for radio-TV.\nTo my knowledge, no French university offers\nsuch skills courses, and the Broadcasting System is\nforced to. This has the worthy effect, however, of\nmaking broadcasting more of a profession, for there\nis a genuine attempt to employ successful graduates\nof the course. More than skills is taught. Lectures\nare given in the Sorbonne Amphitheatre Turgot by\nvarious specialists on such subjects as “Theories of\nInformation,” “Poetry on the Radio,” and “The\nAesthetics of Broadcasting.”\nThe experimental work is bold in conception.\nRecently a troupe of actors and technicians went to\nGrenoble to attempt an experiment in “Radio del’\nArt” or radio drama by improvisation. The pur¬\npose of going on location was two-fold: Parisian fa¬\ncilities of RTF are not readily available, and the lo¬\ncale of the scenario was a bell factory.\nThere is a dandy bell factory near Grenoble,\nand the actors were given the opportunity to im¬\nprovise under realistic conditions. A psychologist\n(an American Fulbright) was on hand to record re¬\nactions of the actors.\nRecently the founder of psycho-drama par¬\nticipated in a film which attempted to demonstrate\nuses of this technique for the training of actors.\nWhen the Club d’ Essai essays such a film, personnel\naren’t sure how the experiment will turn out, but\nthey have the true spirit of adventure. I daresay\nthey will become more well known in international\nbroadcasting circles as times goes on.\n—NAEB—\nSeymour N. Siegel, director of WNYC, has\nnotified us at the NAEB that three additional\nbroadcasting organizations have joined the interna¬\ntional competition of the Prix Italia Prize. These\nare the Swedish Broadcasting Corporation, the Israel\nBroadcasting Service and the Yugoslav Radio.\nThe 1957 World Radio Handbook is out now, list¬\ning old friends and new in the broadcasting-television\nworld. The book performs a fine service and pro¬\nmotes better understanding between peoples of the\nworld. New York representative is Gilfer Asso¬\nciates, Box 239 Grand Central Station, New York 17,\nNew York.\nNEWSLETTER\nPage 5"
}