{
  "id": "d1784-9",
  "text": "of Coleman’s in-school telecasts over the Alabama\nETV Network. Prof. Coleman’s course “Parlons\nFrancais,” is shown three times weekly to high school\nviewers.\ny The 10th annual Western Radio and TV Confer¬\nence will be held on the University of Oregon campus\nin Eugene, February 14-16, 1957. There will be talks\nby the new Governor of the state of Oregon, Robert\nD. Holmes, who has had a long career as a commer¬\ncial broadcaster, Dr. H. K. Newburn, president of the\nETRC, and a session on the Bell Telephone Com¬\npany’s new “Science Series” for TV.\ny Gertrude Broderick’s recently revised “List of\nEducational AM & FM Radio and TV Stations by\nState and City” is out. Copies have been sent to each\nstation, but additional copies are available on re¬\nquest from the Department of Health, Education &\nWelfare Office of Education, Washington 25, D. C.\ny WGBH-TV, Boston, got a tremendous build-up\nand coverage of activities in Jack Gould’s column in\nthe January 13th New York Times. This is the third\noccasion in a few weeks that Gould has raised the\ntorch for educational broadcasters. He praised NBC’s\nstep in aiding ETV men and fought for WNYC when\nit faced the prospect of suspending its evening pro¬\ngrams. Never let it be said educational broadcasters\ndon’t appreciate this influential friend. These articles\ndo much to bring our problems to public attention.\ny The English course for illiterates presented over\nWKNO, Memphis, had an excellent write-up in the\nJanuary 28 issue of Life magazine. As mentioned in\nthe January Newsletter (p. 6, 2nd col.) this is the\nfirst in a series of articles in national magazines about\nWKNO’s project.\ny WILL-TV, University of Illinois, won the law¬\nsuit that has been pending against them for more\nthan two years when the Illinois Circuit Court de¬\ncided the University of Illinois was legally entitled\nto use state funds for support of the TV station.\nThe plaintiffs, two taxpayers, argued that the\nUniversity has no right to use tax money for a TV\nstation that benefits only a small part of the state’s\npopulation. Their suit was financed by the Illinois\nBroadcasters Association, an organization of Com¬\nmercial broadcasters.\nPERSONNEL\ny Frank D. Jacoby, formerly executive producer\nof Products Service,, Inc., has joined the Metropol¬\nitan Educational TV Association, Inc., as director\nof production.\ny The appointment of Norman Cousins, editor of\nthe Saturday Review, to the Board of Directors of\nthe ETRC has been announced. The appointment\nis effective immediately. The Center’s Board of\nDirectors met February 1 and 2 in New York City.\ny For the 5th consecutive year Rob Downey, news\neditor of the Michigan State radio WEAR and\nWKAR-FM, has been re-elected executive secretary\nfor the Radio TV News Directors Association.\nDowney was re-elected by a unanimous vote of the\nBoard of Directors of the RTNDA at its annual\nconvention.\nPROGRAMS\nY The first TV coverage of Harvard University’s\nfamed Godkin Lectures was presented by Boston’s\nWGBH-TV, January 8, 9, and 10. British Labour\nParty Leader Hugh Gaitskell delivered this year’s\nlectures on “The Challenge of Co-existence” before\nlive WGBH-TV cameras and simultaneously over\nWGBH-FM.\ny Also, WGBH-TV broadcast live the CBS nation¬\nwide network Odyssey production “Satan in Salem”\nJanuary 27. The broadcast was specially arranged\nby the Essex County Tourist Council which contri¬\nbuted the cost of broadcast lines from WNAC-TV to\nWGBH-TV, as well as the WBGH-TV operating\ncosts.\n“Satan in Salem” showed the habits of mind and\ncharacter traits that lay behind the Salem witch¬\ncraft trials. The trials themselves were re-enacted,\nbased word for word on existing records.\ny Illinois Senator James O. Monroe was interviewed\nover WILL, University of Illinois, on its “Illinois\nEditorial Review” program January 25. Senator\nMonroe answered questions on probes facing the cur¬\nrent session of the state legislature, his career, and\nhis belief in personal journalism.\ny WILL-TV is presenting a new series of 14 pro¬\ngrams intended to help interpret the uniqueness and\nproblems associated with each major college on the\nChampaign-Urbana campus. The programs feature\nthe deans of different colleges in informal interviews.\ny WNYC, New York, is expanding its live music\nprogramming at a terrific rate. The “German Fes¬\ntival of Light Music” series, which started January\n7, features contemporary compositions of some of the\nfinest of post-war Germany’s artists and musical\ngroups in concerts ranging from jazz to chamber\nmusic.\nNEWSLETTER\nPage 7"
}