{
  "id": "d910-12",
  "text": "-11-\nof thanks for programs submitted, for participation of staff members in\nnational radio organizations, and in whatever other manner is proper and\nexpedient.\n4. Could the NAEB, at each appropriate level, make a study of salaries,\nqualifications, academic standing of institutions represented, and other\npertinent data, and inform top administration of their standingv;ith com¬\nparable institutions, not so much with the purpose of pressure for up¬\ngrading of radio-TV personnel but for establishing as favorable a climate\nfor Radio-TV personnel as exists for other colleges and departments of\ninstruction.\nIII. Will the NAEB keep in mind that some member stations become tape-nappers\nout of necessity occasioned by a wide difference in school calendars?\nIV. Will the NAEB remember that station budgets for promotional work are limited.\nAnd therefore network offerings unless they carry their own promotional mat¬\nerial (such as did The Jeffersonian Heritage) should be timed so that they\ncan be included in the station’s regular catalog...most of which are pre¬\npared in summer, therefore, fall and winter network offerings should be\nmade available by June...or else have their independent promotional kits.\nV. Would the NAEB be strengthened or weakened if there were more formal re¬\ncognition of different operational status of member? (This was directed -\nlargely at the Institute's failure to group according to function and\ngrouping all 10-watts together rather than recognizing that a college 10-\nwatter had little in common with a small school system’s 10 watt station.)\nVI. Looking toward the potential increase in membership from an enthusiastic\nand widespread group of young people, the group suggested that all rela¬\ntionships with wire-wireless stations be explored open-mindedly.\nVII. And, recognizing the excellent work b eing done by the NAEB at the national\nlevel through its affiliation with JCET.and NCCET, the Ohio gang commends\nthe NAEB for its support of educational TV, and solicits its continued\nsupport in Ohio planning both at the State network level, and at the indiv¬\nidual member station level.\nAnd the Ohio gang formally requested its chairman to indicate to the National\nAssociation of Educational Broadcasters its recognition of the outstanding work\nbeing done by its officers, its appreciation of their work individually and col¬\nlectively, and to assure the officers that the above questions and suggestions\nwere in no way critical,but were brought forth in recognition of the objectiv¬\nity of approach to problems invariably demonstrated by the officers of NAEB.\n###########\n23 May — 12 p.m.\nLUNCHEON — ’’Report on FM Promotional Campaign\", Waldo Abbot, WUOM\nThe month of May was devoted to FM promotion throughout southeastern Michigan.\nThere was little cost, but considerable effort involved. Plan of a ction was or¬\niginally sketched out at a February meeting of distributors, manufacturer's\nagents, and broadcasters. NARTB and NAR Manufacturers cooperated.\nAt the advance meeting, the group selected May 1st to start the drive because of\nthe lively sports appeal...events that would be channelled out chiefly through\nFM. Distributors promised to have an adequate number of FM sets in hands of\ndealers. WJR, Detroit, promoted a series of binaural broadcasts. WXYZ, Detroit,\nscheduled special opera nights. WUOM arranged a number of special programs, re¬\ncorded pick-ups of community events in various towns in the area, and aLso printed\nand distributed an FM dial chart. The Detroit \"Free Press\" ran a full page"
}