{
  "id": "d910-133",
  "text": "b, The provision, by television, to the entire area, of\nthe contributions of great teachers now available in\nonly a few educational centers*\nc* The economy of network operation. The five stations now\noperating separately, but producing about 120 hours per\nweek of educational programs could double, triple or\nquadruple their program services if they could use each\nother’s programs. Such an expansion of program schedules\nwould become possible at only a fraction of the cost of\nproducing an equivalent number of programs in their own\nstudios (if that were possible at all, regardless of\nexpense)•\nd. The resources of six states and of a large number of stations\ncould be combined to give better quality programs,\ne. Regional instead of merely parochial programs would become\npossible,\nf. A pattern for a national educational network might be\nestablished. In any case the pattern would be very\nuseful for other regional networks in other areas,\ng. The existence of a network would in itself provide a\nstrong stimulus for the establishment of additional\neducational television stations.\nIf these and other desirable results might accrue from the establishment\nof a regional network, why is sucha network not already established? The\nanswer lies in the facts that*\na* No one knows what the program resources of the area are\n(or might be if more stations were established),\nb* No one knows what pattern the engineering (including\nrouting) of the network should follow,\nc* No one knows what the cost of establishment o.f a network\nwould be,\nd. No one knows what the cost of operation of a network might be,\ne. No thought has been given to an administrative and policy\nstructure under which a network might operate.\nIt appears reasonable that few legislatures, private foundations or\nstate departments of instruction are likely to recommend establishment of a\nregional network or expenditure of funds on any part of such a network until\nanswers to these problems are provided. Such answers can be given only on\nthe basis of a thorough study of the steps \"which must be taken to establish\na regional network."
}