{
  "id": "d910-62",
  "text": "April 18, 1963\nMr* Warns G. Sulser, Director\nRadio and ^television Oaiammieatlc^\nIndiana university\nBlooaington, Indiana\ntear Bromo:\nI Bftttat to discuss vith you, at the time of the Region XII meeting in Chicago,\na couple or the points you raised In your letter of tereh 8, to Jim Milos -\nregarding the f&ct that apparently your staff members were ignored not only\nvhen the Region III progam was drawn up, but also when the BAEB ccsssitteas\nwere appointed.\nAs am who has served long and itelthfully as chteraaa of some of HAHD‘a “toughest,r\ncommittees, I think you know how they are appointed. Xhere are several considera¬\ntions, of course. la the first place, to be appointed to an MSB ccesaittee a\nperson needs to be either an Individual member of the Association, or the official\ncontact person from a member institution (in the case of the network ccsamittees,\n5S£Hf5fe. contact persons may be appointed). Shi© means that there are souse 1500-1600\npeople eligible to be appointed to committees. gv-en weeding out duplication (that\nis, not appointing people to any new eoBsaittee assignment while they are still\nserving a tern on another committee), as we have teen attempting to do in recent\nyasra, we still tew only room for a total of 200 committee ©eaters, of which only\na third are appointed cacti year. Since we have over 300 institutional members\nal^> m cm*t mm have an average of asm committee mater per institutional\n®“*? ~ iaflude “^ <* **» many qualified individual members not connected\nwith institutional members.\nSo, you see, we're not txying to slight anyone » we’re trying to spread ccmsmittee\nappointments around insofar as possible, and at the same time we try to appoint\nthose people we feel will do the best Job* You had served a© chairman of the PS\nccOTttto© tor some time and had asked to be relieved, and I guess we simply didn't\nrealise that no other Indiana staff members were on a committee.\nGf course, as you know fro© your experience as a chairman, m also try to consider\nfor appointment those persons who© the chairman suggests because he feels they\nwill te able to contribute md will be good westers. Sfcese contacts arc usually\nmade at HAEB regional and national meetings, oik! you said that few of your people\ncame to our aeetlngs most of the time.\nI hope you will interstate that I m not trying to make excuses, but «w-»wiy\ntrying to explain a rather oomplesc situation, with which you are vexy familiar*\nI hope that if you feel that any of your staff are particularly qualified to"
}