{
  "id": "d910-95",
  "text": "WUOM ANN^RBOR\nTHE UNIVERSITY OF MICHIGAN, ANN ARBOR, MICHIGAN\nwvr p 104.1 mc-\nVY V IV GRAND RAPIDS\nOctober 8, 1962\nDear Colleague;\nWelcome to the conference on Music Programing for Educational Radio!\nThe official program for the conference is enclosedo You will note that the speaker\nfor the final luncheon is Mr. Abram Chasins, music director of The New York Times\nStations, WQXR, AM-FM, in New York City. Mr, Chasins distinguished himself as the\nfirst to initiate his own weekly network series of talking-playing radio broadcasts\nin 1932, He is one of the most versatile figures in contemporary music, winning fame\nas a pianist, composer, teacher, author and commentator. He will be present for the\nentire conference. From his wide experience as a musician and radio personality, he\nwill evaluate and summarize the conference and speak from a great store or practical\nfact.\nThe purpose of the conference is to afford an opportunity for the free exchange of\nideas, Don!t plan to come and be talked at! The \"speakers\" at various sessions\nhave been instructed to limit their remarks to a very few minutes You, the con¬\nferees, will then take over. Informality will be the order of the day. Please\nkeep this in mind between now and then. Jot down perplexing questions. Be prepared\nto tell others how you do it. Please note the session on library procedures.\nBring along any special forms you may have evolved (40 copies should be sufficient)\nor a duplicated sheet with an outline of your library procedure. For the Wednesday\nmorning session, be prepared in like manner. If you have originated a special\nseries of programs in music, even though you may have used readily-available mate¬\nrials, be prepared to tell about it. Bring duplicated copies of the series con¬\ntent for distribution to fellow conferees.\nWe believe a free exchange of ideas in a strictly informal atmosphere will be a\ngreat help to all in attendance, Be prepared to share your ideas - and your\nperplexities!\nAs a special courtesy while you are on campus, Tuesday evening you will have an\nopportunity to see a gala performance by Uday Shankar Hindu Dancers,\nThe dead line for reservations is October 30, Mail your reservation today. You\nare welcome to the conference even though you may not have returned the preliminary\nreservation card in July.\nCordially,\nMusic Director\nHBW/alc\nEnclosures"
}