{
  "id": "d1825-0",
  "text": "A E B\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 GREGORY HALL URBANA, ILLINOIS\nMEET YOU IN ST LOUIS!\nTime is drawing near for the NAEB’s 33rd Annual\nConvention to be held October 29 through November\n1 at the Statler Hotel in St. Louis.\nThe bustling activities and’ tireless efforts of those\nentrusted with program arrangements are presently\npaying off in the emergence of a fun and excitement-\npacked program schedule that is sure to please even\nthe most discriminating conventioner.\nHowever, if you haven’t had an opportunity to\ntake a look at the program, and if you are\nstill undecided whether you should attend, here is a\ndescription of what St. Louis holds in store for you.\nJudge for yourself whether you can afford to miss it.\nFirst Day — VISITS TO GRANT'S FARM\nAND ST. LOUIS EDUCATIONAL STATIONS\nFollowing registration, beginning, Tuesday morn¬\ning and special meetings of NAEB committees and\nBoard, buses will leave for Grant’s Farm, estate of\nMrs. August A. Busch Sr., for a three-hour visit.\nThe 275-acre tract, which embraces land formerly\nfarmed by the famous Ulysses S. Grant, contains a\nnumber of noteworthy attractions including a cabin\nbuilt by Grant, a Bauernhof (farm yard) modeled\nafter the central building of European estates and a\nminiature zoo with a honest-to-goodness elephant.\nVisitors will be transported to each of these points\nby miniature sight-seeing trains with a seating capa¬\ncity of 58 each.\nWhile on the farm, registered visitors will be serv¬\ned a luncheon through the courtesy of Anheuser-\nBusch, Inc., which maintains and operates the farm as\na public service.\nThe buses will leave Grant’s Farm at 2:30 p. m. to\ntake visitors on a tour of the St. Louis educational\nstations KETC and KSLIL By 4:30 visitors will re¬\nturn to the Statler where the remaining hours until\nthe 8 p. m. General Session will be taken up by com¬\nmittee meetings.\nNAEB Newsletter\nVol. XXII, No. 10\nOctober, 1957\nNAEB Newsletter, a monthly publication issued by the\nNational Association of Educational Broadcasters, 14 Gregory\nHall, Urbana, III. $5 a year, edited by Hans J. Massaquoi.\nThe General Session of the day, presided over by\nPresident Burton Paulu, will feature welcoming re¬\nmarks by Mayor Raymond R. Tucker of St. Louis;\nDr. Philip J. Hickey, president of the American Assn,\nof School Administrators; and Raymond Wittcoff,\nchairman of the St. Louis Educational Television\nCommission.\nThe session will include an address by Dr. Harold\nC. Hand, University of Illinois professor of education,\nwho will speak on the subject “The Process of Change\nin Public Education.”\nAn informal get-together at 9:30, for which a\nnumber of St. Louis commercial stations will furnish\nrefreshments, will bring the first Convention day to\na close.\nSecond Day — NAEB LUNCHEON AND NBC BANQUET\nAn NAEB noon luncheon in the Statler’s im¬\npressive Missouri Room and a banquet at which the\nNBC will be host to the NAEB, will highlight the\nsecond Convention day.\nDuring the luncheon the focus will be on speaker\nGeorge R. Town, director of the Television Alloca¬\ntions Study Organization. Program arrangements for\nthe NBC banquet are still in progress at the time of\nthis writing, but tentative plans point toward grand\nentertainment replete with music and speaker.\nPreceding the two events are a morning session\nfor members only, which will be devoted exclusively\nto Association business, and a period during which a\nnumber of study groups will hold individual sessions\nuntil noon.\n1"
}