{
  "id": "d1825-6",
  "text": "bids to President Paulu with a copy to Dr. Skornia,\nand to submit them by Nov. 4, to enable Board action\nby Nov. 15.\nWayne Coy Dies Of Heart Attack\nWe deeply deplore the passing of a long-time\nfriend and promoter of educational TV and radio,\nWayne Coy, 53, president of WFBM Broadcasting,\nInc.\nMr. Coy, who died on Sept. 24, a few hours after\nbeing stricken by a heart attack during a reception\nat the Indianapolis Athletic Club, was a former chair¬\nman of the FCC and a special aid to President Roos¬\nevelt. In 1952 he left the government to become\npresident and manager of KOB and KOB-TV, Al-\nquerque, N. M., owned by Time, Inc. He returned\nto his native Indiana as president of WFBM when\nTime acquired the broadcasting company early this\nyear.\nNEWS OF MEMBERS\nGENERAL\nThe largest number of weekly pupil viewers of in¬\nschool TV in any community in the country is claimed\nby Philadelphia. According to a survey of pupil audi¬\nences from Oct. 1, 1956, to June 1, 1957, conducted\nby the Philadelphia Public Schools’ Division of Radio-\nTV, 160,000 pupils per week view the in-school tele¬\ncasts while 410,000 pupils utilize the radio broad¬\ncasts.\n^ The completion of its production center in the\nCarnegie Endowment Bldg. 345 East 46th Street,\nhas been announced by META. The center is New\nYork City’s only TV facility devoted exclusively to\nthe production of noncommercial programs for the\nmetropolitan area.\nIn its new studio, META, a non-profit organiza¬\ntion dedicated to furnishing a cultural-informational-\neducational TV service for the community, will pro¬\nduce both live and recorded programs for presenta¬\ntion over existing local stations and' for distribution\nto other ETV stations across the country.\nThe center was made possible by grants from the\nNew York Foundation, Avalon Foundation, Fund for\nAdult Education, Rockefeller Brothers Foundation,\nOld Dominion Foundation and the Carnegie Endow¬\nment for International Peace.\n► To extend the effective range of educational sta¬\ntion WUNC-TV, Chapel Hill, N. C., three North\nCarolina stations WSOC-TV, Charlotte, WLOS-TV,\nAshville, and WUNC-TV, Chapel Hill, have joined to\nrelay the latter station’s signal, Harold Essex, vice\npresident-general manager of WSJS-TV, Winston-\nSalem has announced. He said the new arrangement\nwill provide a nearly statewide network.\nPERSONNEL\nMiss Judith Waller, NBC’s director of education and\npublic affairs, will be among 10 prominent persons to\nserve as judges in the 1957 Grocery Manufacturers\nof America Life Line American Trophy Awards Com¬\npetition.\n► The judges, including William R. Hearst\nJr. Hearst Newspapers; Andrew Heiskell, publisher of\nLife Magazine; and Ivy Baker Priest, U. S. treasurer,\nwill select one newspaper food editor and one radio\nfood editor to receive a trophy for outstanding food\nreporting as a public service to U. S. homemakers.\nThe awards will be made Nov. 11-13 at the Wal¬\ndorf-Astoria in New York City.\n^ The University of Alabama has announced the ap¬\npointment of Walter Heeb Jr., and Carlos R. Beisang\nto its broadcasting staff. Heeb, a former staff di¬\nrector for WBIR-TV in Knoxville, Tenn., was named\nproducer-director for the University TV studios. Bei¬\nsang, who just completed his work in the UA Depart¬\nment of Radio and TV, is the new traffic manager for\nWUOA-FM.\n► Dr. Erling S. Jorgensen, formerly on the faculty of\nMichigan State University, has joined the University\nof Montana staff as acting director of the school’s\nradio and TV studios and associate professor of\njournalism, responsible for the radio and TV teach¬\ning program.\n► The appointment of two men to major staff posi¬\ntions was announced by Dr. Sydney W. Head, chair¬\nman of the University of Miami’s (Florida) Radio-\nTV-Film department.\nShannon R. Wallace, former WTJV, Miami, pro¬\nducer-director, will instruct advanced students of TV\nana supervise production as associate professor.\nWilson P. Griffith, also from WTVJ, will be producer-\ndirector and teach TV production and direction tech¬\nniques.\n► Civic leader Philip S. Boone and Dr. Glenn S.\nDumke, president of San Francisco State College,\nhave been named new directors of the Bay Area\nEducational Television Assn, at the organization’s\nmeeting of the board of directors.\n► Veteran NAEBer Waldo Abbot has been awarded\nan honorary lifetime membership in the Michigan\nAssn, of Radio and Television Broadcasters. The\naward was made in recognition of Abbot’s pioneering\nwork in college broadcasting. He celebrated his 69th\nbirthday on Sept. 13.\nOCTOBER, 1957\n7"
}