{
  "id": "d1825-9",
  "text": "ETV FOR PRISON AND\nREFORMATORY INMATES\nFifty Stateville (Ill.) prisoners and 20 inmates of the\nIllinois State Reformatory for Women at Dwight\nhave enrolled in the Chicago City Junior College’s\nTV offering on WTTW, according to Stateville War¬\nden Joseph Ragen and Reformatory Superintendent\nRuth Biedermann.\nThe 50 men receive their TV instruction in a\nStateville High School classroom under the super¬\nvision of its director, Harry Givens. Afternoon study¬\ning is done in the TV classroom and evening study¬\ning in the cell blocks. The Stateville Library pro¬\nvides the necessary text and reference books. As¬\nsignments and the grading of exams are handled by\nthe regular CCJC staff via mail.\nCourses offered to prisoners are identical to those\noffered to “regular” TV students. First semester\nstudies include English, biology, physical science and\nhumanities. Upon successful completion of 64 sem¬\nester hours, an Associate of Arts degree will be\nawarded.\nThe experiment, according to Ragen, is aimed pri-\narily at determining how to use TV in the educational\nprogram at Stateville. If successful, it may be ex¬\npanded in the future to include a greater number of\nmen.\nThe program for the 20 inmates of the Dwight Re¬\nformatory for Women is believed by Clifford G.\nErickson, CCJC’s head of TV education, to be the\nfirst college TV program offered to women reform¬\natory inmates.\nSuperintendent Biedermann, while terming edu¬\ncation as “an important part of our rehabilitation\nprogram,” hailed the TV project as an opportunity\nfor inmates who completed high school to begin their\ncollege work.\nBoth male and female inmates whose last address\nwas Chicago are exempted from tuition payment, ac¬\ncording to a ruling by Frank R. Schneberger, attorney\nfor the Chicago Board of Education.\n—N A E B—\nDocumentary reports for possible use in radio\nbroadcasts on the background, process and results\nof the Hungarian revolution have been collected and\nare presently published by two eye-witnesses, Josef\nG. Farkas, a native of Hungary, and Diether Gross-\nherr of Germany.\nThe collected material will be available in the\nform of four manuscripts. Persons interested in ob¬\ntaining copies of these manuscripts should write for\nfurther information to Josef G. Farkas and Diether\nGrossherr, Grunwalderstrasse 198c, Munic 9, Ger¬\nmany.\nWE NEED YOUR HELP!\nBecause of the restricted circulation of this News¬\nletter we are depending largely upon you for giving\nthe forthcoming NAEB Convention the kind of\npublicity that will make for record attendance.\nWe therefore urge you to help us spread the good\nword among your friends and staffs. You can\ndo this by either word of mouth or by making\nthis issue available to others. We certainly ap¬\npreciate your help.\nNEW ORGANIZATIONS AIM:\nCOMMERCIAL SUPPORT FOR ETV\nThe founding of the Organization for National Sup¬\nport of Educational Television (ONSET), has been\nannounced by Edward L. Ryerson, president of the\nChicago Television Assn, and former Inland Steel\nCo. chairman of the board, who will head the new\norganization.\nONSET will seek to further ETV by developing\nprograms and inviting industry to act as patron for\nthese programs. Sherman H. Dryer of Sherman H.\nDryer Productions, an ONSET director, assured that\nunlike commercial TV “sponsors,” ONSET “patrons”\nwill excercise no influence over program content.\nAccording to Ryerson, ONSET will join forces\nwith existing agencies and organizations in the ETV\nfield.\nOther directors of the new organization are Robert\nL. Foote, attorney with Sidley Austin Burgess and\nSmith; Irvin B. Harris, chairman of the board of\nScience Research Associates; and John W. Taylor,\nexecutive director of the Chicago Educational Tele¬\nvision Assn.\nTV TECHNICAL TIPS\n—Cecil S. Bidlack\nDuring the second week of September, I had the\nopportunity of visiting CBS Television City in Holly¬\nwood and both its kinescope and videotape recording\ninstallations. Consequently, I can give you a brief\nfirst-hand report of my observations.\nCBS has five Ampex prototype videotape\nmachines installed and in service. Since most of the\nWest Coast television network programs are delay¬\ned, I had the opportunity of seeing VTR pictures in\nthe control room and on the air. The picture quality\nis excellent although a light fine grain noise could be\nseen both in the control room and on my hotel room\nreceiver. The amount of this noise varies with re¬\ncording heads and with head life. However, the\ntaped picture is a noticeable improvement over the\nkinescope recordings I saw in Los Angeles last\nOctober.\n10\nNEWSLETTER"
}