{
  "id": "d1075-0",
  "text": "A E B\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 GREGORY HALL\nURBANA, ILLINOIS\nNAEB PLANS FOUR SEMINARS\nCurrent NAEB plans include four coming seminars,\nthree of which are scheduled during summer, and one\nfor May.\nThis month’s meeting will be a Video Recording\nWorkshop for technical personnel May 5 - 9 in\nChicago. For further details on this workshop, see\n“TV Technical Tips,” page 12.\nCONFERENCE ON INSTRUCTIONAL TV\nA conference on Instructional Uses of Television and\nRadio will be held at Allerton House, the University\nof Illinois conference center near Monticello, Ill.,\nJuly 21 - 25. This seminar is designed for two groups\n—educational broadcasting personnel responsible for\nplanning instructional programs, and persons in\nteacher-training institutions responsible for instruct¬\ning courses such as teaching methods. The meeting\nwill primarily concern instructional TV at the public\nschool instructional level.\nFor the July session on Instructional Uses of TV\nand Radio, each NAEB Active and Associate member\nmay nominate one person from each or either of the\ntwo groups. Applications should be submitted in five\ncopies.ro Dr. Harry J. Skornia, Executive Director,\nat NAlEB Headquarters, no later than June 1 with\nthe following information included: (1) institution\nand/or station represented (2) name and present\nand future responsibilities of nominee, plus other per¬\ntinent information (3) specific recommendation by a\nsuperior indicating why the person was selected over\nothers (4) a signed statement by the nominee that\nhe will attend the full session and submit a 500 word\ncritique.\nTransportation expense, room and board at the\nseminar will be paid for the applicants chosen by an\nNAEB committee. Funds for the seminar are made\npossible by a Ford Foundation grant.\nNAEB Newsletter\nVol. XXIII, No. 5\nMay, 1958\nNAEB Newsletter, a monthly publication issued by the\nNational Association of Educational Broadcasters, 14 Gregory\nHall, Urbana, III. $5 a year, edited by Jane Lombard.\nMEETING FOR COLLEGE ADMINISTRATORS\nThe first NAEB conference dealing with university\nand college administrative problems as related to Tele¬\nvised Instruction has been scheduled for August 24 -\nSeptember 4 at Purdue University, West Lafayette,\nInd. This conference, exclusively for college and uni¬\nversity representatives, should not be confused with\nthe July seminar for teacher-training and station per¬\nsonnel.\nThe Conference on Televised Instruction will pro¬\nvide service to colleges and universities interested in\nlearning how to integrate closed or open circuit TV\ninto the total instructional program of the institution.\nDelegates named by college administrators will study\nand plan the coordination of instructional TV\nmethods for the entire institution. It will also provide\nthe opportunity for some now active in the broadcast\nfield to exchange information and ideas.\nThis conference is also the first NAEB-sponsored,\nself-supported meeting. The NAEB Board of Di¬\nrectors has made available sufficient NAEB funds\nto underwrite traveling and living expenses of the\nconference leaders. No honorarium will be paid. In¬\nstitution administrators will be urged to send' repre¬\nsentatives to the meeting and to pay for them a $100\ntuition fee, plus their traveling and living expenses.\nAny profits from the venture will be added to the\nNAEB general treasury.\nInvitations to attend the conference on this basis\n1"
}