{
  "id": "d1075-10",
  "text": "mature and literate.’ It is to the thoughtful saver of\nleisure time—or perhaps just simply the thoughtful\nperson—that WNYC and WNYC-FM appeal most.\nIt is at 830 kc on the conventional radio set and 93.9\nmg. on your FM dial that the best in literature, music,\npublic affairs discussions and radio drama is most con¬\nsistently available. It is because thoughtful New\nYorkers are ‘investing in the best’ use of their leisure\ntime that we report happily a welcome increase in\nlisteners and supporters.”\n► A proposal involving the use of instructional TV\nfor elementary and high schools of San Francisco was\nrecently made to more than 400 school districts by\nthe community ETV station, KQED.\nThe project envisions an instructional service of\n15 hours of programming a week, for a total cost of\nabout $165,000 for the school year to be shared by the\nschool districts on the basis of total student enroll¬\nment.\nThe proposal was made possible by the enactment\nof permissive legislation, passed by the last regular\nsession of the state legislature, allowing school dis¬\ntricts to contract with KQED for instructional use of\ntelevision.\nPROGRAMS\ny This month WGBH-FM started a new program\nseries, “The Creative Mind,” which explores the\ncreative process as it pertains to American artists\nand scientists in the twentieth century.\nThe weekly series features an exceptional line-up\nof creative personalities, such as theologists Louis\nFinkelstein, Reinhold Niebuhr and Milton Nahm who\nappeared on the first program. Future guests will in¬\nclude architect Frank Lloyd Wright, choreographer\nAgnes deMille, theoretical scientist Harlow Shapley\nand composer Aaron Copland.\nThe, series was produced by WGBH-FM under a\ngrant from the ETRC and will be distributed by the\nNAEB.\ny Mrs. Anna Eleanor Roosevelt is featured in the\nnew “Heritage” series, produced by WQED, Pitts¬\nburg, and distributed last month by the ETRC. In\nthis weekly series of four TV programs, Mrs. Roose¬\nvelt is joined by Henry Morgenthau III and Dr.\nClarence Cramer, dean of Adelbert College.\nEach guest on “Heritage” talks informally of his\nlife, work and philosophy, either appearing with a\nguest or alone. Mrs. Roosevelt discusses her lonely\nchildhood, her first meeting with Franklin Delano\nRoosevelt, and her work with the UN after his death,\nconcluding with her views on the world today and\nher hopes for the future.\n“Heritage” was a Peabody award-winner for “im¬\npeccable taste and integrity” in television education.\nIt was cited for having “opened the eyes of American\nadults and students to the richness of our educational\nlife.”\n► More than 100 man-hours go into the weekly pro¬\nduction of a 15-minute Sunday evening news program\ntelecast by WTTV from the studios of Indiana Uni¬\nversity’s radio and television service. The program,\nan all-student production under faculty supervision,\nserves a double purpose in covering campus, state\nand national news as well as training future radio-TV\nnews men and women.\nPreparation for the Sunday show starts the pre¬\nceding Monday with a conference to select campus\nsubjects for movies. During the week, student\ncameramen shoot film and live shots, edit and write\nthe script before the Sunday presentation.\ny A four week introductory course in basic astron¬\nomy was started April 21 on WPIX, New York. “A\nGlimpse Into Space,” the first astronomy offered to\nNew York TV audiences, will be seen as part of the\nseries, “META Presents.”\nThe telecourse with its accompanying syllabus\nprovides the layman with an understanding of the\nbasic laws governing astronomy and brings him up to\ndate on the principles of our own space age and its\nmachines. James S. Pickering, assistant astronomer\nat the American Museum-Hayden Planetarium de¬\nlivers the course each week, using visuals to study the\nsolar system and the possibilities of life elsewhere in\nthe universe.\n► A special program entitled “Air Pollution” was\npresented last month by the Chicago Technical\nSocieties Council on WTTW, Chicago. The telecast\nconsisted of discussion and demonstration of air\npollution problems in major cities, with special ref¬\nerence given to Chicago’s proposed air pollution or¬\ndinance.\nPERSONNEL\ny Dr. H. K. Newburn, president of the ETRC since\n1953, announced last month that he will leave this\nposition in September. This decision corresponds\nwith his expressed intent to return to university ad¬\nministration after a five-year period with the Center.\nBefore becoming the first full-time head of the new\norganization, Dr. Newburn was president of the Uni¬\nversity of Oregon for eight years, and before that was\ndean of the College of Liberal Arts at the State Uni¬\nversity of Iowa.\nMAY, 1958\n11"
}