{
  "id": "d1075-6",
  "text": "Joint Council of Educational Television, Ben Adler\npresident of Adler Electronics, Inc., and Dr. Alexander\nJ. Stoddard of the. Fund for Advancement of Educa-\ntion.\nThe proposed bill, orginated by Sen. Warren Mag-\nnuson (D-Wash.), is of vital interest to educational\nbroadcasters since it provides up to $1 million to each\nstate for ETV. At its last meeting, the NAEB Board\nof Directors approved support for this bill and its\ncompanion House bill, the Boggs Bill (H.R. 9634).\nJOHN WEISS\nDIES IN CRASH\nThe NAEB mourns the recent death of John K. Weiss\nwho was killed April 6 in an airline crash near Mid¬\nland, Mich. A hard-working educator and friend of\nthe NAEB, Mr. Weiss was traveling from his home\nin Harrison, N. Y., to attend a conference at Central\nMichigan College of Education. He had served as\nvice-president of the Fund for the Advancement of\nEducation since 1951, when it was founded by the\nFord Foundation. Mr. Weiss was also a trustee for\nboth the Horace Mann School and New York State\nUniversity.\nPEABODY AWARDS RECEIVED\nBY EDUCATIONAL BROADCASTERS\nr\nEducational broadcasters were well represented in\nthis year’s announcement of the George Foster Pea¬\nbody Awards. Half the television stations honored\nthis year were educational stations which seems to\nindicate the spirit of educational broadcasting’s\nachievement.\nOf this year’s awards, one went to WGBH-TV\nalong with WGBH-FM, Boston, for local radio-tele¬\nvision news, one to WQED, Pittsburgh, for televised'\neducation, and another to WKAR, East Lansing,\nMich., for radio education.\nLouis M. Lyons, Harvard University news com¬\nmentator, was responsible for the Boston station’s\naward in local radio-television news. He has broad¬\ncast on WGBH-FM since the station went on the air\nin 1951 and simultaneously on WGBH-TV, when it\nstarted operating in 1955. His program, “Back¬\ngrounds,” offers an analysis of issues and events with\ninterviews of national leaders in every field of current\npublic interest.\nThe award to WQED was given specifically for\nits “Heritage” series. The citation it received com¬\nmended the station for “impeccable taste and in¬\ntegrity” in originating its distinguished programs.\nThe series was also cited as having “literally opened\nthe eyes of American adults and students to the rich¬\nness of our intellectual life.”\nWKAR’s Peabody award is the first given to a\nuniversity-owned radio station since 1942. Selected\nfor this honor was the 15-minute, weekly broadcast,\n“You Are the Jury,” which originates at WKAR and\nwill be distributed by the NAEB tape network. The\nHighway Traffic Safety Center of Michigan State\nUniversity and WKAR share the honors for their\noutstanding traffic safety series which presents drama¬\ntizations of traffic problems with discussion and an¬\nalysis by motorists and Center experts.\nOTHER AWARDS\nA Public Interest Award for exceptional service to\nsafety was given by the National Safety Council to\nKQED, San Francisco, primarily for its 13-week pro¬\ngram series, “Safety On The Job,” which devoted each\ntelecast to a different aspect of industrial safety. The\nseries was presented in cooperation with the American\nSociety of Safety Engineers.\nA half-hour television program, “We Proudly\nHail,” brings the University of Texas radio-television\ndepartment a George Washington Honor Medal and\n$100. The recognition is one of the 1957 Freedom\nAwards of the Freedoms Foundation at Valley Forge.\nA program combining patriotic music and a talk, “We\nProudly Hail,” was televised on KTBC-TV, Austin.\nWBUR, Boston University, has received an\naward from the National Headliner Club for its doc¬\numentary series, “Impact,” which has highlighted\nDIRECTORY CHANGES\np. i\np. 10\nP. 13\nP. 17\nP. 30\nP. 33\nAffiliate Members 55\nDelete:\nAdd:\n(under WTVS (TV) )\nHenry Brown, Sen. Mgr\nFranklin Bouwsma, Exec. Sec.\nDelete:\nAdd:\n(under WUNC-FM)\nJohn Young, Dir.\nDonald Knoepfler, Dir.\nDelete:\nAdd:\n(under KUED (TV) )\nC. Richard Evans\nDr. Keith Engar\nAdd:\nChicago Rabbinical Association\nHenry H. Mamet, Exec. Dir.\nRadio-TV Commission\n72 East Nth St.\nSuite 500\nChicago 5, Illinois\nHArrison 7-5863\nDelete:\nAdd:\n(under Twentieth Century Fund)\n330 W. 42nd St.\nBRyant 9-8117\n41 East 70th St.\nLEhigh 5-4441\nMAY, 1958\n7"
}