{
  "id": "d1075-9",
  "text": "RECOMMENDED READING\nEducational television wins praise from J. C. Wynn\nin his article, “Teaching Takes to the Air,” from the\nApril 19 Presbyterian Life (p. 32). Examining the\nnew teacher-pupil relationship that the medium\ncreates, Wynn credits several cities with successful\nefforts in instructional programming. Highlighting the\narticle are words of praise for NAEB’s Dr. Harry J.\nSkornia, describing his extensive contributions to\neducational broadcasting.\nA portion of Dr. Skornia’s recent address to Pres¬\nbyterian leaders in Alaska has been reprinted in the\nJanuary-March issue of The Christian Broadcaster,\npages 13-16. In the text, he advises religious radio\nbroadcasters in ways to program more effectively,\ngiving attention to the approach used, importance of\nlistener response, and promotional projects.\n(Copies of Presbyterian Life may be obtained for\n15 cents by addressing the publication at McCall\nStreet, Dayton 1, Ohio. Single copies of The Christian\nBroadcaster are available as long as they last for 50\ncents at National Council of Churches of Christ, 156\nFifth Avenue, New York 10, N. Y.)\n* * * * *\nIn the April 12 issue of TV Guide, a two-page feature\narticle describes the programs and plans of the\nMetropolitan Educational Television Assn. It gives\ndetailed comment to the series, “The Living Black¬\nboard,” and includes pictures of this and three other\nseries offerings. In praising META, the article pro¬\nvides a fine biography of the organization.\nAn addition to the field of audio-visual education\nis the “audiofile,” a cross-indexed card reference\ncenter for information about educational tape and\ndisc recordings, with assistance through reviews for\nselecting and using the audio materials. For further\ninformation on this service, write audio file, Box 1771,\nAlbany 1, N. Y.\nIDEA EXCHANGE\nEd. Note: The following item is a sample of the type\nof contribution we would like to include in a regular\n“Idea Exchange” column. If your organization or\ninstitution has originated a new program idea, instruc¬\ntional system, or some other idea of value to NAEB\nmembers we would appreciate hearing from you.\nTwo original program ideas come from KUED at\nthe University of Utah, Salt Lake City. During the\nUtah Broadcasters Assn, convention, the station pre¬\nsented a salute to the state broadcasters in the form\nof a panel discussion of “The Broadcaster in the\nCommunity.”\nKUED has also started a seven-week half-hour\nseries entitled “Mosaic.” This series provides a weekly\npanorama of schools and community, and has nu¬\nmerous purposes in promoting careful use of leisure\nthrough announcement of public recreational facili¬\nties in the state and outstanding fine arts events,\nand through circulating news about colleges, public\nschool activities, communications, TV, radio, news¬\npapers and magazines.\nNEWS OF MEMBERS\nGENERAL\ny The initial phase of the first Massachusetts in¬\nschool television is now underway. Instructional pro¬\ngramming has been studied and evaluated during the\npast months by the Massachusetts Department of\nEducation’s audio-visual extension service and the\nEastern Massachusetts Council for School Television\nin cooperation with a number of other related groups.\nPrograms from WGBH-TV, Boston, will be re¬\nceived by elementary schools in the coverage area,\nto supplement the school curriculum. Plans are to\nstart this spring with one half-hour per day for thirty\nweeks during the year. Teachers selected from schools\nof the state are required to participate in a series of\ntraining courses which began last fall.\ny Last month KSLH marked its eighth year of serv¬\nice to the schools and community of the St. Louis,\nMo. area. Programming to a total classroom audience\nof about 250,000, the station has broadcast 71 radio\nseries during the past year. In addition to in-school\nbroadcasting, programming for college and adult audi¬\nences is scheduled every afternoon. NAEB statistics\nshow that KSLH’s “Let’s Find Out,” a science pro¬\ngram for primary grades, has the largest national\naudience of all classroom broadcasts heard in the\ncountry.\ny In the May - June Masterwork Bulletin from sta¬\ntion WNYC, WNYC-FM, New York, Director\nSeymour N. Siegel explains the philosophy behind his\nstation’s success: “THOUGHTFUL SAVING\nof leisure time, as of money, means investing after\ncareful consideration. It means choosing forms of\nleisure—time usage appropriate to the individual’s\ncircumstances. The investor of time, looking about\nand noting the uncertainties of the world in which he\nlives, seeks the greatest possible return. Because radio\nlistening is on the increase more thoughtful ‘time in¬\nvestors’ are seeking a program service which is, ‘adult,\n10\nNEWSLETTER"
}