{
  "id": "d1663-0",
  "text": "6 the national association of educational broadcasters\nli, No. 8 DuPont Circle Bldg.^ Washington 6, D.C. J^y 12, I961 \nro POSTAL BILL FAVORS EIXJCATIOMAL IIMRESTS\nOn July 11, the House Post Office Committee met in Executive session to consider\nHR-790^ ( introduced by Rep. Henderson, D-Ohio) which would generally raise postal\nrates, but which would classify handling of educational materials and library materials\nas part of the \"public service operation\" of the Post Office Department, and would re¬\nsult in no increase in the rate for educational or library materials. \"Public service\"\nclassification of these materials would mean that any loss incurred by the Post Office\nin handling these items would not be considered a part of the operating deficit of the\nPost Office and pressure to make these classes of mail self-supporting woiild thus be\neased both now and in any future postal legislation. Congress each year makes a spe¬\ncial appropriation to cover such \"public service operations,\" and in the past has\ndetermined the amount of such appropriation. Bie new bill woilLd provide for the Post¬\nmaster General to estimate each year what such services would cost, separately from the\nregular operating budget. The Postmaster General has endorsed HR 790^*\nThe NAEB (along with the HETRC and others) opposed the original bill- HR-64l8 (see\n\"Washington Report\" Vol. II, No. 6) which would have raised the rates for educational\nand libraiy materials 1-2^ per pound, and this bill was at first shelved by the committee,\nbut later re-opened for consideration. Although both bills were to be considered, it\n' was reliably reported that primary consideration would be given in the July 11 hearing\nto HR-7904.\nKERR BILL WOULD MAKE SURPLUS PROPERTI AVAILABLE TO ET7\nOn June 21, Sen. Kerr (D.Okla.), with Sen. Monroney, introduced S-2119, a bill to\namend the Federal Property and Administrative Services Act of 19^9 so as to permit do¬\nnations of sui*plus property to schools for the mentally retarded, schools for the\nphysically handicapped, educational television stations, and public libraries.\nThe NAEB is filing a letter, urging passage of this bill, with both, the Senate and\nHouse committees on Government Operations. little opposition to this legislation is\nanticipated.\nFEDERAL AID TO ETV\nThis legislation (reported on in \"Washington Report\" Vol. II, No. 6) was considered\nby the House Committee on Interstate and Foreign Commerce in Executive Session on July\n11. Although previously approved by the Subcommittee on Communication and Power, the\nfate of this legislation is still doubtful, although Chairman Oren Harris has indicated\nhis support of the bill. If passed by the Interstate and Foreign Commerce Committee,\nthe bill would still have to get through the Rules Committee before being considered by\nthe full House. If passed as it now stands there would follow a House-Senate conference\ncommittee to iron out differences between the House bill and the IVfegnuson bill which\npassed the Senate 67-13, l^rch 21.\nFCC ACTIONS\nUpon request of WHYY, Inc., and with the consent of all parties, the FCC (June 21)\nscheduled the following procedural dates in Wilmington, Deleware, TV Channel 12 proceeding:\nAugust 15- Notification of witnesses desired for cross-examination; September 19- Further"
}