{
  "id": "d229-111",
  "text": "—5—\nWhile it is proposed that a National Conference of related parties be held\nas soon as possible following funding to suggest priorities in development\nof programming, the following are envisioned as reasonable initial offerings:\nf;\n1. A bi-weekly half-hour series on educational innovation, drawing on official\nuniversity projects, experimental colleges, experimental course offerings,\ninstitutional changes involving improved student participation In decision-;\nmaking, new learning communities, research projects, other related matters.\n2. A weekly series on campus events of national interest and importance, ^\nhour in length.\n3. A weekly series from Washington on the Federal government and higher\neducation, \\ hour, relating Congressional committee work and floor\naction, important decisions and work being done by HEW, USOE, NIMH,\nand other pertinent governmental bodies»\n4. A bi-weekly half-hour series dealing specifically with the problems and\nneeds of black students and other minority group students. '\n5. A bi-weekly half-hour on student-related community action for change.\n6. A monthly program, one hour, produced with the cooperation of minority\ncommunities, featuring the views of members of those communities, edited\nonly for program quality.\nIt is clear that the diversity of offerings would grow rapidly as staff\nmade new contacts. Initial staffing is seen as: field staff, one full-time\nstaffer in each of the following areas: West Coast, Rocky Mountain-Southwest,\nMidwest, Southeast, Northeast (total: 5)j Washington-based staff: director of\nCenter, engineer, producer, administrative secretary, part-time secretary (total: 5)\nThe general administrative staff and facilities of the National Student Association\nwould provide for printing, mailing services, and other necessary administrative\nfunctions.\nField staff would be reporters, trainers, and representatives of the Center in\ninitiating contact with new groups for cooperation in program development. The\ndirector would have administrative and program responsibilities."
}