{
  "id": "d229-13",
  "text": "STEREO FM RADIO\nDIRECTOR OF\nBROADCASTING\nRECEIVES\nnf.rn\nJUN1 2 1970\nKSJR / COLLEGEVILLE\nKCCM / FARGO-MOORHEAD\nKSJN / MINNEAPOLIS-ST. PAUL\nSTUDIOS AND OFFICES COLLEGEVILLE, MINNESOTA 56321\nJune 9, 1970\nNational Educational Radio\n1346 Connecticut Ave. N. W.\nWashington, D. C. 20036\nGentlemen:\nThis is in reference to Memo No. 73 of May 29 regarding the amend¬\nment to S. 3558 which will require educational stations receiving CPB\nsupport to retain records in case of complaints and the FCC amend¬\nment concerning underwriting.\nI feel that the Senate amendment is definitely restrictive and will be\ndifficult to comply with. The fact that CPB now requires a copy of any\nprogram specifically underwritten by a grant from the Corporation does\nnot bear on this issue. CPB's requirement is only for specific programs,\nbut it is my understanding that the Senate amendment pertains to all pro-\ngrams involving issues of \"public importance\". The latitude of definition\nof such terminology is extremely far-reaching and, it seems to me, would\ninvolve keeping records of any and all programs that might be construed\nas constituting unfair treatment.\nThe sheer physical problems such as storage space and personnel to handle\nrecord keeping impose an onerous burden on noncommercial stations which\nare, for the most part, sorely understaffed and overworked already. Far\nmore important, however, is the Pandora's box that such an amendment\nmay open. The intention of the Public Broadcasting Act was that stations\nshould be free of any outside interest, including governmental. In light\nof recent attitudes towards the media expressed by the current administra¬\ntion— specifically Mr. Agnew—and also Pacifica's current dilemma, this,\namendment gives cause for further alarm, especially when \"news type pro¬\ngrams\" would be subject to the amendment.\nIt seems that this amendment could well be the first step toward loss of\nbroadcasting freedom. Such records could be easily obtained by govern¬\nment and used in such a manner so as to determine further governmental\ncontrols. Also, the question arises why this imposition should be made on\nnoncommercial but not on commercial broadcasters. Perhaps it's because\ncommercial stations are not so easily controlled since they are not largely\ndependent on government funding as are noncommercial broadcasters. Our\nposition makes us an easy target for control.\nTELEPHONE: 612/363-7702"
}