{
  "id": "d229-14",
  "text": "National Educational Radio\nPage 2\nJune 9, 1970\nIn reference to the FCC amendment regarding the rules concerning\nprogram underwriting of noncommercial stations I am happy to see\nthe clarification that costs may include operating expenses as well\nas production costs. However, the problems set forth in your memo\nare very real ones. The on-air announcement of program underwriters\nis the most appealing aspect which stations can use in soliciting support\nfrom commercial sources. Since such sources are primarily interested\nin getting their name exposed, noncommercial stations will be seriously\nhampered in this aspect of fund-raising if we are unable to offer as much\nidentification of underwriters as possible. Strict interpretation of \"by\nname only\" identification is exceedingly prohibitive in our specific situa¬\ntion.\nWe currently have two existing stations with a third under construction.\nThese stations are part of a proposed network throughout Minnesota. Be¬\ncause we do not serve a single city, but rather 75% of the state of Minne¬\nsota, we are able to draw underwriting support from many different areas\nin the State. Since on-air announcements are heard in different areas of\nthe state it is imperative that we be able to give a location for the firm\nor organization underwriting a program so that listeners who may not be\nfamiliar with the underwriter are assured of complete identification. This\nis a matter of being fair to the underwriter and being able to offer him\nsomething in return for his money. Obviously we can’t compete with com¬\nmercial stations in selling air time, but we must be able to offer full credit\nto underwriters since they view contributions to noncommercial stations\nas a business proposition and not as an out and out donation.\nThe same thinking applies to the limitation which is imposed on announce¬\nments for general contributions for a broadcast day. We are fortunate to\nhave many individuals who periodically provide expenses for an operational\nday. Since that day is 19 hours long, three announcements would be widely\nscattered and can hardly be considered due acknowledgement. Our state\nwide coverage also applies here. Name only identification certainly would\nnot constitute true and effective identity of person (s) making contributions.\nI hope that these thoughts will betaken into consideration by NER and NAEB\nand incorporated into the information brought to the attention of the concerned\nparties.\nMichael W. Obler\nDirector of Broadcasting\nMWO;ln"
}