{
  "id": "d229-32",
  "text": "TAPPING BLACK TALENT\nMeanwhile, public broadcasting this summer was tapping\nthe talents of a number of black stage directors -- and\nthereby remedying what has been a lack of blacks thor¬\noughly acquainted with directing television.\nIn Boston at public television station WGBH-TV, under\na CPB grant, black stage directors were breaking into the\nmedium by working first alongside experienced TV direc¬\ntors and later on their own, in directing plays in the On\nBeing Black series of 15 original 60-minute dramas. Among\nthe directorial talents tapped for the series are Edmund\nCambridge of the Negro Ensemble Company, Lloyd\nRichards of New York University’s School of Arts, Roy\nAllen, assistant director of CBS-TV’s Black Heritage,\nGeorge Bass, formerly of the Spanish-English Theatre in\nHarlem and the Longwharf Theater in New Haven, and Stan\nLathan, director on Say Brother, WGBH-TV’s black public\naffairs show.\nIN WASHINGTON\nThis summer in Washington, three black students are\nworking in television production at WETA, as part of an\nexperimental training project financed by a grant from the\nCPB. The three are Phylicia Allen, 21, drama major at\nHoward University and a native of Houston, Tex.; Cary\nBeth Cryor, 21, a Baltimore artist and photographer, and\nLeon Collins, 20, of Washington, who is majoring in\ncinematography and TV production at Howard.\nWORLD PERSPECTIVE\nAs new blood streams into public broadcasting, other\nprograms have been keyed to perfecting the professional\ncapacities of those already working in public broadcasting.\nOne such pilot project is the Fellowships Abroad program,\nunder which four young public broadcasters will work and\nstudy for a year with broadcasting organizations in other\ncountries. The Fellows, recently announced, are Raymond\nG. Dilley, 29, director of school services for Vermont\nEducational Television; James H. Lewis, 26, director of\nnews and public affairs at WJCT-TV, Jacksonville; Juris\nJansons, 26, news director of KUOW, Seattle, and Jack\nMitchell, 27, public affairs director at WHA, Madison. Mr.\nDilley is going to Japan to work with Nippon Hoso Kyokai\n(NHK) at the network’s Tokyo headquarters; Mr. Lewis, to\nSweden to work with Sveriges TV at the network’s\nStockholm headquarters; Mr. Mitchell, to London to work\nwith the BBC, Mr. Jansons, to Toronto to work with the\nCBC.\nFOCUS ON DON WIECHEC\nFilm-maker Don Wiechec is working at CPB this summer as\na research associate with the Director of Program Develop¬\nment, Robert Carlisle. A native of Philadelphia, Don\nreceived a B.A. in creative writing from the University of\nPittsburgh. Following graduation in 1965, he entered the\nMarine Corps as a 2nd Lieutenant and was promoted to\nCaptain after one and one-half years. He served in Vietnam\nas the officer in charge of civic action operations for a town\nof 18,000 people and was awarded the Vietnamese Com¬\nmendation Medal for effectiveness. In 1968 he was released\nfrom active duty and entered the Institute of TV and Film\nat New York University. Now at 26 years, Don Wiechec is\npart of the group known as “the gapped generation.”\nIn the fall he returns to the Institute which he is\nattending on a fellowship from the Kosciuszko Foundation.\nWhen he completes his two-year course there he would like\nto work in public television. He believes public television\noffers the individual, through his local station, an opportun¬\nity to have a say in - and a commitment to what goes on in\n-- his town. “It becomes a sounding board - an electronic\nsounding board - that seems to be the biggest hope for this\ncountry,” he says.\nHe believes youth programming must appeal to youth\nby treating them in terms of their own self-respect, by not\ntalking down to them or moralizing. “You’ve got to appeal\nto their perception,” he says. He cites, as an example, how\nto present a problem, such as drug addiction, as a poison in\nsomebody’s personality. “If you show enough of these\npeople and if what you show is the essence, then that’s very\nstrong and stark and could be much stronger than any kind\nof narrative or statement an expert could make.”\n“Tripped Up” is the film that Don and his wife and\nfellow filmmaker, Betty, produced on drug addiction. The\nfilm takes a new attitude toward drugs, Don says. There is\nno preaching. Instead, the film combines drama and\nsustained interviews, with a multi-racial cast. It was filmed\noutdoors in the Amsterdam Project behind Lincoln Center\nin New York.\nIt came about after concerned parents in the Lincoln\nSquare Neighborhood Center decided to stage a street\ntheatre to show how bad the drug problem was in their\nneighborhood. They improvised a hard-hitting play, half¬\ntherapy, half-drama.\nDon made the play into a film. He condensed it,\nstepped up the pace, used the people of the neighborhood\nas actors, and included a series of sharp-focus, “holding”\ninterviews with the addicts and pushers in the second part\nof the film -- a technique which Don believes gives very\ngood insights into their personalities. “We didn’t get aimless\nstatements,” he says. “We got the most hair-raising, honest\nbaring of their souls.”\nThe film emphasizes the hopeless situation of the\naddicts. But it should accomplish the aim Don Wiechec has\nenvisioned -- to enable youth to perceive “how it is.”\n5"
}