{
  "id": "d229-82",
  "text": "The network Manager, Miss Landreth, has been in Urbana since June 2.\nShe will remain there until June 28* On June 19, the Production\nCoordinator (David Eccleston, formerly of WAMU, Washington, D. C.) will\ngo to Urbana for the final week’s dubbing operation. He will, of course,\nfamiliarize himself with policies and procedures.\nThe myriad of details accompanying a move of this nature are\nfalling into place. Telephones have been ordered, new mailing labels\nsecured and stamped, transfer of mail from Urbana to Washington is\nbeing accomplished. There is no need to bother you with the detail,\nbut the proposal as outlined is developing. There are no major difficulties\nA minor difficulty is one which we anticipated — namely, the\nattrition of staff in Urbana when official work was received of the\nmove. The difficulty has been resolved and production is on schedule.\nOur plan included the utilization of Ampex Corporation personnel\nfor a complete overhaul of equipment and assistance with the physical\nlayout and installation of the equipment in Washington.\nAs yet no major variance has occurred in the budget submitted to\nCPB by KERN for this relocation. I envision no problems in this area.\nThough the move is not yet completed, two benefits have already\naccrued. First, the staff of NERN while inexperienced ia young and\nvital. The enthusiasm and the desire to \"make something out of the\nnetwork\" is manifest. Secondly, the fact that NERN is moving to\nWashington has resulted in a variety of contacts. (This may be not\nonly because of the move but also because there is an awareness that\nNERN has more funds available than ever before in its twelve year\nhistory).\nRegardless, we are being contacted by numerous organizations\nregarding cooperative program efforts and activities. Agencies include\nEERN, BBC, CBC, the University of Missouri School of Journalism, Radio\nNederland, the Music Educators National Conference, the National\nEndowment for the Humanities, etc. The list is small but it is clear\nthat the liaison between NERN and potential program sources will be\ngreatly enhanced.\nThe neatt fifteen days are a critical time, but we expect the\nproject to be completed as indicated in our initial proposal.\nThe NAEB Treasurer, E. A. Hough, has been alerted to provide\nfinancial reports to you on or about October 1, 1969, January 1, 1970\nand a final summary after thecclose of our fiscal year on June 30, 1970.\nA special project fund has been established and detailed accounting\nwill be provided. My review of the budget on this project indicates\na desire on CPB’s part to accomplish the project within the limits of\nthe grant but to allow NERN considerable flexibility in the expenditure\nof funds so long as the benefits accrue to the benefit of NERN and the\naffiliated stations."
}