{
  "id": "d229-86",
  "text": "one half hour per week. We do not plan to rush about after specials or\none shots at this time. The approach we are following is one proposed\nby A1 Hulsen (among others on NERNPAC) when comments were requested.\nThe NER Board feels the Hulsen proposal was general in nature but\nnonetheless provides an opportunity for radio to move toward news and\npublic affairs as the sfcfetions want.\nAs you know, negotiations are in progress with Roger Penn, president\nof NERN, to contract with NERN to produce one or more public affairs\nseries. NERN has no production capacity. The cross fertilization of\nNERN-EERN is mutually beneficial and lets us plant the seeds of a\nproduction capability coupled with a news and public affairs bureau\nthrough an exceedingly small scale.\nWe are also discussing development of an in-depth background\nprograms with Ed Lambeth of the University of Missouri School of\nJournalism. Missouri sends eight students to Washington, D. C. each\nsemester for internship work related to their Master’s Degree program.\nLambeth is seeking a means of utilizing some interns under his\nsupervision in radio news, and we eneision an arrangement between the\nMissouri interns and NERN.\nAt one time, NER considered making secondary grants to stations\nfrom the support monies provided NERN. That approach has generally\nbeen discarded though it is possible that small amounts of money might\nbe utilized in this fashion — primarily on a matching basis or a\n’push over the top* basis for an individual station.\nSome concern has been indicated that CPB will frown on the\nacquisition of programs from outside sources such as BBC, CBC, Jon\nArthur and other production sources. We view this pattern as an initial\nstep and agree that as time passes there should be more innovation and\nmore actual production in place of outright purchase. The direct\npurchase concept is utilized so that in October, 1969 an impact will\nbe made on the program offerings distributed to NERN affiliates.\nThe main thrust of NERNPAC, the NER Board, the Network Manager and\nmyself has been to work for improving the quality and quantity of\nprogramming NERN can offer stations. The utilization of the $65,000\nsupport grant coupled with the distribution of appropriate programs\nfrom 23 direct station production grants will result in the best\nofferings NERN has ever made to its affiliates. Most important to\nthe stations is that we are reflecting their needs and decisions\nwithout increasing their costs.\nI will advise you of any significant developments in the\nutilization of the support grant as they occur. Our fiscal office,\nE. A. Hough, has established a separate account for this grant. Precise\naccounting will be maintained.\nYour comments and reaction will be welcome.\nSincerely,\nRAMskh\ncr: I.andreth\nRobert A. Mott"
}