{
  "id": "d354-71",
  "text": "5\nsome of the particularly striking phrases and to present summaries of some of\nthe important talks.\nThe opening orientation session was attended not only by the twenty partici¬\npants in the Seminar and the five staff members, but also by the entire staff of\nStation KSLH and a dozen administrators from the St. Louis Public Schools, includ¬\ning Mr. Philip J. Hickey, Superintendent of Schools, who presented the official wel¬\ncome to the group.\nDr. Harry Skornia, Executive Director of the National Association of Educa¬\ntional Broadcasters, also welcomed the group, and expressed appreciation to the W. K.\nKellogg Foundation whose generosity had made the Seminar possible. He described\nthe Seminar as \"an historic jumping-off place for in-school broadcasting,1' pointing\nout that it was the first such conference to be devoted to the problems of the in¬\nschool radio writer. He added, \"I hope you will all feel the great responsibility\nwhich rests on your shoulders and will come up with ideas and techniques to imple¬\nment the growth of school broadcasting.11\nMiss Gertrude McCance, Supervisor of School Broadcasts, Department of Educa¬\ntion for the Province of Manitoba, Canada, outlined the wide and varied contribu¬\ntions which school broadcasts could make to the educational growth of boys and\ngirls and emphasized the responsibility which rested on program planners and writers\nto present only the highest quality production and writing. \"We have an opportuni¬\nty,\" she said, \"to bring to the classroom stimulation for the mind and imagination\nand to help develop critical appreciation of good radio in the minds of our stu¬\ndents.\"\nMiss Betty Girling, Director of the Minnesota School of the Air, reminded\nthe group that the fundamental unit of all communication media is the writer. She\ncalled upon the writers present to accept an important responsibility. \"In the\nworld today, words are being used to confuse, to mislead. As writers for educa¬\ntional radio we must clarify, present facts in a logical way, be rational. But"
}