{
  "id": "d354-89",
  "text": "23\nlevel committees, to determine the general content of a series; to select the grade\nlevel for which it is to be beamed.; and to help select the teaching personnel who\nwill appear on the program. KETC does not use \"package shows\" prepared by indi¬\nvidual schools or systems, but assigns a staff member, a writer-producer, to work\nwith the TV Planning Committee which has been developing each series. When ideas\nhave crystallized, and when talent has been selected, the station1s writer-pro¬\nducer will work with the Planning Committee*s chairman on the details of each in¬\ndividual program. These Planning Committees include representatives of the St.\nLouis, Belleville and other public school systems, as well as representatives\nof the parochial, Lutheran, County and private schools.\nThe station cooperates with committees in surveying television receivers,\nand in making recommendations. Specifications include 21-inch screens, simpli¬\nfied controls, etc. Many schools have already bought either one set per floor,\nwith a TV viewing room on each floor, or one set per building. Money has come\nfrom Board of Education funds, or from donations by individuals or PTA groups.\nMr. Goggin also introduced Mr. Martin Schneider, one of his staff writer-\nproducers, who described the specific way in which he had worked with one of the\nTV Planning Committees in planning and producing a series which had been kine-\nscoped for use after the station went on the air.\nThe morning session concluded with both halves of the Seminar merged again\nto view two sample kinescope programs, one produced in the early experimental\ndays with single-system sound, and one produced more recently with its sound\ntrack recorded separately on 16 mm. magnetic tape. The superiority of the latter\nwas readily apparent to the entire group.\nThe visit to KETC created a great deal of interest in the problems of writ¬\ning and producing educational television programs, although most members of the\nSeminar had had little contact with TV in the past and did not anticipate being\ninvolved in television in the near future."
}