{
  "id": "d1381-1",
  "text": "-2-\n>'THE AMERICAN FAY”\n\"Translating into action their growing irritation v^dth the (Ohio) Institute\"\n(Variety, March 5) the national networks are reported to be cool toward the May\n1947 session. ]®C delegation is reported to be cut from 25 to 5, and CBS from\n19 to 3.\nThe gripes are that they don’t want to talk about the \"evils\" of advertising,\nor hear somebody lambasting the industry. One N.Y. Exec, is quoted as saying, \"I\nguess the boys think they've heard McCarty’s speech\".\nThat the disadvantage, imposed by the huge attendance lessens the attraction\nof the Institute for those vjho come with a purpose cannot be denied. Many of the\nold timers long for the return to the conditions which prevailed in the days when\nDr. W. W. Charters played the gracious host on the campus.\nMEMBERS DIN VARIETY AVARDS\nKUOM, of the University of Minnesota, and WNYC, New York City municipal station,\nwon 1946 Showmanagement Awards given by VARIETY for outstanding performance..\nFourteen awards were made, and two went to non-commercial stations. That is\na good average, considering the fact that the commercials outnumber the educationals\nby a score of about 40 to 1.\nKUOM, under the direction of Burton Paulu, received its,.- recognition for\n\"Expanding Radio's Social Usefulness\" by its programming during the polio epidemic\nlast summer. It expanded the kind of programs which have long made it a leader\nlocally, and so won the national recognition,\nWNYC, under Director Seymour Siegel, won the Award for \"Responsibility to the\nCommunity\" by its airing of the controversy over the five-cent subway fare, and for\n\"other notable services to the citizens of Nev; York\". It is called \"The most\nintelligently operated non-commercial radio station in America\",\nTEST THE BLUE-BOOK\nFor more than a year, raucous echoes have been floating up and down the columns\nof the press of this country. Freedom of speech, the \"Am.erican way\", bureaucratic\ndictatorship, censorship, and other equally emotionally appealing terms have been\ncarelessly used to discredit the Federal Communications Commission and its now\nfamous \"blue-book\". The Social Responsibility of Broadcast Licensees.\nPrivately many station operators admit the validity of the blue-book charges,\nand see in its recommendation the basis for sound and profitable operation for\nthemselves, 9.S well as better listening fare for their listeners. But the \"industry\"\ncontinues to picture itself as the persecuted martyr.\nAfter thirteen months this theme is no longer convincing. The industry has had\nample time to instigate a test case to find out for itself whether or not the FCC\nis overstepping its rights, and just what the public’s interest in radio is. A\ntest case might cost some small station (guinea pigs are used instead of elephants\nin laboratories) its license-but what is that in comparison to the pictured\nhorrors attendant to the \"government regulatioh\"feared by broadcasters?\nObservers believe that there is lacking the strength of conviction which would\nprecipitate a once-and-for-all test and decision in the matter.\nMight it be that this brave big noise is but whistling in the dark? Can it be\nthat despite the call for a show-down there is no real desire to have one? Might\na Supreme Court decision upset the status quo by deciding that the public has a\ngreater stake in broadcasting than it has been allowed to believe it has?\nThe public is interested. The broadcasters are concerned. In the interests of\nboth the Federal Communications Commission should precipitate a test case—inasmuch\nas the \"industry\" lacks the temerity to do so."
}