{
  "id": "d1381-1",
  "text": "National Association of Educational Broadcasters\np R E SIDSNT'S MEMO\nDecember i, L9&2\nVoi. 1, floTTr\nWashington, b.CTT\nThe 2000 Megacycle Question\nThe introduction of this question into the consideration of the\nappropriation to implement the ETV legislation is a cause for con¬\ncern—on two scores. First, as enunciated by Congressman Bow\n(R. Ohio), it is used to suggest that it is such an inexpensive\nmethod of providing ETV that there is no need for the government to\nappropriate funds for standard ETV broadcast development. Second,\nas used by Congressman Ashbrook (R. Ohio), it is being used as a\nmeans of catering to all elements who are opposed to federal aid to\neducation and ’’interference” of national government with local af¬\nfairs Recently the U.S. Chamber of Commerce and the School Boards\nAssociation have picked up this angle and are urging their members\nto back the 2000 me development (as against standard broadcast) as a\nmeans of preserving local autonomy and preventing control by outside\n’’forces.” This general thesis has also been promulgated m the\nRepublican Congressional Committee Newsletter, which warns that ETV\noffers a potential for the Kennedy Administration to propagandize\nthe public schools and give US0E a means of controlling what is\ntaught in them. ^ «\nThe suggestion of substituting the 2000 me system in place of\nstandard ETV is answerable on the basis of the use limitations of\nthe proposed system. (See Washington Report No. 15, November 1,\n1962). Similarly, the fallacy of hypothetical (1/5—1/3 less) cost\ncomparisons. It has the flexibility of multiple channels, but a\nsix-channel system to cover a county would cost about ^300,000\nenough for a first-rate ETV station with much broader coverage. We\nare now working out some more precise cost estimates as a basis for\nrealistic cost comparisons.\nThe local autonomy angle is much harder to combat. It has a\nlot of emotional appeal, reinforcing as it does certain well-estab¬\nlished fears and predispositions, and enough validity to gain some\nacceptance on a rational basis.\nThe judgment in each case, of course, ought to be made on what\nkind of job needs to be done and which system or combination of\nsystems is best suited to that purpose. The proposed new service\ncertainly has some splendid virtues and will be a useiul addition\nin education’s kit of tools. But it must be recognized for just\nwhat it is (a kind of closed-circuit multiple address system for\nspecial instruction of limited audiences) and not promoted as the\nanswer to all of education’s needs in the instructional uses o T .\nNAEB has always been in favor of any educational tool which has\nbeen responsibly tried and tested; the danger here is that a tool\nwhich' has not had such a testing”may be used as a weapon to inhibit\nthe development of a tool whose usefulness to education has been\nthoroughly proven."
}