{
  "id": "d1071-2",
  "text": "-3-\nNATTONAL COMMITTEE ON EDUCATION BY RADIO REORGANIZED\nUp in front, carrying on in the cause of educational broadcasting, is a ro—\norganized National Committee on Education by Radio.\nReaching the end of its original five-year period the National Committee is\nenabled, by an additional grant from the Payne Fund, to continue on a reduced\noperating basis for at least two years more. New headquarters in New York city,\na. now secretary, new statement of purpose, and new work projects — these are\nthe major changes.\nThe reorganization was brought about at a meeting of the Committee in Wash—\nington January 20 and 21. Our Association was represented by President McCarty.\nBecause of the reduction in budget, it was decided to close the Washington\noffices and accopt the donated part-time services of S. Howard Evans of the\nPayne Fund as Secretary, centering activities and functions at Ono Madison\nAvenue, Now York City, where Mr. Evans is already located.\nYou should hoar from tho new Secretary shortly. His first bulletin is in\npreparation and should reach you within a few days. Mr. Evans takes hold of the\nwork with eagerness, insight, and ability. The National Committee is indeed for¬\ntunate to have his leadership in tho enterprise which was carried forward with\nsuch determination and unflagging spirit by Tracy F. Tyler and Armstrong Perry\nduring tho past five years. For tho present. Dr. Tylor is to continue on some\nspecial research work for tho General Education Board, and Mr. Perry, with an\noffice in 'Washington, is busy at his writing.\nTho National Committee is fortunate also in having President Arthur G.\nCrane of tho University of Wyoming as Chairman. Ho is giving time, energy, and\nhis best thinking without stint. Vteth him as Chairman, and Mr. Evans as Secre¬\ntary, wc may expect an abundance of activity and drive toward tho re-stated pur¬\npose of the National Committee on Education by Radio:\n\"To promote tho use of radio for educational, cultural, and civic purposes.\"\nNEW MEXICO TAKES STOCK OF RADIO\nAfter a brief leave of absence from his duties at WHA your Secretary,\nHarold A. Engel, has just returned from New Mexico where ho completed a survey\nand a plan for state-radio. A few years ago State College leased its station to\na newspaper. Tho state now wishes to regain tho facility for educational and\ngovernmental service.\nTho plan for operation, which was adopted by tho state officials, embodies\nsomo safeguard features which may apply in other states. A copy of the KOB re¬\nport was included in your recent exchange packet.\nThe New Mexico situation will bear watching. Hearings before tho commis¬\nsion arc sot for March 25. Will their facility bo saved for state service, or\nwill it be lost? What will bo the deciding factors?\nNEWS-LETTER HEADQUARTERS AT MADISON\nHereafter, sond notes for this sheet to tho Secretary at Madison, Wisconsin.\nMake notes on your calendar now to remind you each month to sond in your news."
}