{
  "id": "d1071-6",
  "text": "A RECORDING MACHINE FOR N.A.3.B*\nV/hafc could you do with a recording machine* one of the finest instantan¬\neous recorders available — a machine that makes transcriptions suitable for\nbroadcast?\nWhat could our members accomplish for themselves and the Association by\nhaving the uso of such a machine for a time?\nYos, nogotiatiens are under way and just about completed for the purchase\nof a fine recording outfit for the use of N.A.E.B. members on a rotating sched¬\nule, limited time basis* This is to bo made possible through a grant from one\nof the foundations* Tests by v/HA engineers on three different recorders during\nthe past throe months have brought remarkably fine results and have resulted in\nthe selection of a machine recommended for purchase*\nOne of. those machines is already in service at YJHA, bought and paid for by\nthe Wisconsin State i/Icdical Society* The Society plans to build a library of\nrecorded health talks for broadcast over the state stations and for distribution\nto local medical associations and stations* In return for technical attention\nand care, the recording machine is to remain at VfHA and bo available for general\nservice* (A hint t« other stations?)\nho have been talking for years about exchanging program ideas and informa¬\ntion. Hero, then, is a chance to exchange not merely note and manuscripts but\nprograms in their original sound and spirit. Tho records, mind you, have wide\nfrequency range, low surface noise, and clear quality. With practice and skill\nfrom experience, an operator can make records which are good enough for broad¬\ncast over any man’s radio station*\nNow, how sha11 WG tho most of this opportunity? What could the mach¬\nine do for you? .Aid what contribution could you make to others? Let’s have\nsome ideas on tho subject to help put this project through*\nLET’S TRY THESE ON OURSELVES\nAre wo looking ahead?\na* vshat do wo need most to do a better job of broadcasting?\nb. Do we know what our \"next stops\" are?\nc* What obstacles are most persistent in holding up progrooo?\nd. Have wo stopped to figure out a course which will lead to a solution\nof tho problem?\nc. In tho case of facilities being made available on a basis of a\nrecord of service and use of present facilities, what could wo\ndemand?\nf. Arc wo looking ahead in technical improvements?\ng. What about television, facsimile, short-wave, high fidelity -- and\nother undetermined quantities? Arc wo experimenting?\nh. Arc our programs such as to warrant listeners tuning in again?\ni» Do we have an adequate studio layout, or are wo making definite\nprogress toward getting bettor quarters?\nj* Have wo given those who would like to bo our friends enough of a\nchance to help in building a better radio service?\n(Grade your own paper — and use your own judgment about telling the\nscore.) °"
}