{
  "id": "d919-40",
  "text": "THE UNIVERSITY OF CHICAGO\nChicago 37 . Illinois\nTHE COLLEGE\nNovember 26, 1957\nJfc*. Robert Hudson\nProgram Manager\nEducational Television and Radio Canter\n2320 Washtenaw Avenue\nAnn Arbor, Michigan\nDear Bobs\nBy now I am sure that Ray Stanley baa told you that the Committee on\nGrants-in-Aid of the N.A.E.B. has approved the proposal for a commissioned\nradio series to be produced through the Foreign Policy Association* At\nthe same time, perhaps he has indicated that our approval proceeded\nprimarily from a recognition that only this program series, if any, seems\ndestined to receive support from the Center as an element in the \"American\nin the Twentieth Century\" project for the current year — that if the\nForeign Policy Association series were not approved, no Center funds would\ngo Into radio programming for the current year, beyond the grants already\nawarded*\nIn short, we approved the Foreign Policy aeries with some uneasiness\nand it is to make the sources of that uneasiness a matter of record that,\nas spokesman for the Committee, 1 am writing you now.\nFirst, let me say that there was initially soma confusion as to the precise\nroles to be played by grants and contracts respectively in implementing\nthe three-year \"American in the Twentieth Century\" project. Perhaps\nimproperly, I had assumed at the time our ad hoc committee set up the entire\nproject that each year the Center and the NlA.E.B., working in complete\ncollaboration on all phases, would seek to approach our goals as closely\nas possible through the grants-in-ald program, relying upon the U3e of\ncontracts to augment programming in areas where grants proposals wore\ninadequate. I now understand that an arbitrary figure of around $40,000\nis all that is available under grants-in-aid, regardless of the value of\nadditional program proposals which would require exceeding that amount.\nAccepting this policy (with some bewilderment as to the principle frets\nwhich it derives), we imagined that, following the announcement of grants\nawarded, there would be a deliberate, systematic, joint assessment of\nareas relatively neglected by the grants series, followed by a sustained,\nthoughtful effort to restore balances by defining the kinds of series\nneeded and establishing appropriate contract arrangements to meet the\nneeds thus defined* In effect, we assumed that the year would end with\na solid combination of grants and contract programming, the whole of which\nwould move substantially toward the attainment of our educational objectives."
}