{
  "id": "d919-54",
  "text": "THE NAEB AND B?S SERVICES\n1\nRevised slightly frca\n(Skornia Remarks: “Services of the NAEB\"\nGiven at International Seminar\nBoston University, October 10, 1957)\nGeneral Statement:\nThe NAEB is essentially a three-fold organization:\n— The “trade association\" of educational radio and TV stations\n— The educational Radio Network; this function for TV is served by the\nEducational Television and Radio Center\n— The \"professional association\" of educational broadcasters as individuals;\nthis latter role is relatively new, and ve would not assert that this role\nis as yet being fully performed*\nAs the oldest organization in the field of educational broadcasting in the\nU« S. (founded in 1925) the NAEB is one of the parents of several other\norganizations:\n— 'Hie JCET, for which the NAEB was one of the first fund-raisers, of\nwhich Richard B. Hull, of the NAEB, was the first Executive Director\n— The ETRC, the creation of a \"Network Center\" having been recommended to\nthe FAE by the NAEB Board in 1952*\nThe NAEB grew essentially, in its first years, out of the few surviving\neducational radio stations of the U. S., which existed in the 20*s and 30*s.\nThese were clustered in the midwest, with few exceptions* The NAEB*a\ngeographical location in Urbane is an outgrowth of this development, spreading\nwestward and more recently southward and eastward.\nIn addition to providing a rallying point, an exchange post of ideas for\neducational broadcasters, ami as a thread of coBanon interests through three\ndecades, the NAEB has worked steadily towards education® s securing and\noperating increasingly its own radio and TV facilities because of a number\nof concerns. Some of these are old; some fairly recent. These include:\n—» Concerns about the senses of values vhlch mass media may teach, even\nthough unconsciously, if used only by end for commerce.\nConcerns regarding the effects of excessive spoon-feeding, and \"spectatoritis\"\nin many areas of public life. The danger that \"knowing about\" things\nmay come to be considered a satisfactory end in the life of responsible\ncitizens to the detriment of \"doing things about\" problems, as dynamic\ndemocracy requires.\n— Concerns regarding the development of \"other-directness\", undue concern\nwith \"what others will think\", or \"keeping up with the Joneses.\" Con¬\nformism Is a quality which totalitarianisms spend millions to create\ndeliberately in their subjects. In a democracy, individualism must be\nprotected and nurtured.\n— Concerns lest radio and TV may be overlooked as valid tools of education,\nin order to make it more effective and widespread. Far this use rigid\ninsistence on high educational standards Erast prevail."
}