{
  "id": "d919-81",
  "text": "Vteo W Bo Hill\nPag® So* 3\n* -\nJWtfowy 1, 1957\nVwomw ana tto period of tine was datandned, and maid to subject to audit. lew\nmold bom anteentio eovarage f® these caninsrs, but as yea mold advise of\nof —rti iMfag. the policy mold to endorsed with the appropriate graded rates\nfir the oniaass and by final audit tto correct premia® detesninad far all\nseolnars. and the advance deposit prealtra oreditsd against soah proper earned\npresaiuw for eesinsro as detaraiaed by the individual twain® eadersaswntOo\nTto seteduhs Of rates far esah t»aias, pm lecafcicn, per day weald to\ndetenlned as ftiUsvst\nfirst fear days - 100$ af senual rates (as quoted in paragraphs atoms)\nBast few days - 9058 ef manual rates\nHast amen days - 296 cf aszaaal rates... — '\nOw fifteen days - 10? of aanual rates\nWith further reference to ear cccvarsation, you advised there were so\ncentraotaal agraorants of szgr type either in oennectian with tto office or\nIn connection with too soninara. Oar tost estisssto of year ooHprehecsiTO bodily\ninjury liability jarenri.ua and property daaeea liability \\\\resXm far tto rates\nindicated berotofms for tto elrauastanass as wa new toa? then mold to as\nfiUomt\nl .....\nBodily\nLiability with\n34»lt9 SftMO/W.OOO\nIdcMl&ty with\nUnits off 850/30.000\nomcm\nft 15.40\nft 6.30\nSsalnsrs (Deposit)\n147,36\n303.95\nSpecial Ccmaffage tseatom\nfM\nshSS\nOoetmeato B»X« - tf\n3.85 tg\nshoe\nISE35\nTto atom preadba charges stow coverage for bodily injury as an csseurrencs\nat an nessinal pweasha which we zecamasd. Tto basis off\nquotation as respects tto naaintazo is subject to Bureau approval but wo do not\nanticipate ary difficulty in this respect.\nTto protection under this type of contract is snteaatio as ws have mntieaod\nbefore far the eayasuras Insured and there could to additional pmastaa derailed\n£rm elevators, if sty ware operated by yea, operations perfonasd by independent\nabstractors «r aiy eantrasttal agracneats in writing ones yon base assured\nliability af others, to raeomend this as tto broadest coverage fir tto risk\ninvolving the wideegsead and varied operations such aa yea hove."
}