{
  "id": "d693-14",
  "text": "Who mu ^Backstop\" this Project\nPrincipal mm 0taffff Meters\nKXttflAM g. ymit> President of tbe BationaX Association of Educational\nBroalStir7” KSSSly Professor, Division of &*dIo-TeXevision Education,\nIhiiwersity of Wisconsin m& Program Director, Wisconsin State Broadcasting\nService. Xa this position; responsible for programing of eight-station Wis¬\nconsin State Hf Detweaek and university stations and Wh-ff. Schedule\nincluded mjteoBSln School of tbs Air, providing 10 radio program per week\nfor 600,000 pupils around tbs stats and eight ftr program per week for\nschools In Madison area. Pot station WBA-T? on the air, managed its operation\n1954-1960. ad years experience la announcing, script writing, production,\nand programing pins teaching courses la radio and seminars in television\nfffly teachers*\nZa 1951-32* served as Program coordinator for JfAEB Adult Education\nProgram (Fund for Adult-Ford Foundation) which produced such disting¬\nuished radio series as *Vays of Mankind,* “Jeffersonian Heritage •* fibs\nserved as coiwnjdtant on EOT stations for Detroit School System and\nUniversity of Dew Hampshire and ss a amber of advisoiy boards for instruc¬\ntional OT projects far the U.S. Office of Education, currently: Texas\nState Edae^f^wlt Microwave Project and Alameda State del b»-flP' Training\nProgram far Specialists.\nlas traveled widely promoting exchange of educational materials,\nrepresenting American educational broadcasters at international meet¬\nings, end consulting with mew nations establishing cur improving\nradio and television system far education. In 1952, visited broad¬\ncasting systems in Englandf France, Italy, and Switzerland; in I960:\nTurkey, Iron, The Sudan. At the invitation of the U.S. State Depart¬\nment, presented a paper cm Instructional television at the International\nSeminar of OT Arts am Sciences, fkmtreux; la 1961, delegate to the\nmm International Conferee# on Schools Broadcasting and President of\nthe \"ChMlnslsm cm Sound »nd Ttelevision 'in the pieht Against Illiteracy. **\nMember of the mission sent by the U-S. State Department to investigate\neducational broadcasting potentialities in literacy education la Bogota\nand of team brought in by American Samoa to study feasibility of DPT\nfor Samoan School System.\nMBQW K« HILL Vice President. Has been in educational broadcasting\nsince 19Ao. ixperienc* m writer, soaeoaesr, director, producer, prodoc-\ntion director, and program director of educational radio station. Das\nplanned and produced many award winning programs. Served on faculty of\nthe College of Journalism and Ctewsmieations, University of Illinois, 1947-\n1954, teaching courses in radio and television. Mm been with the DADS\nsince 1954, first as Associate Director and then Flee President. Spent\nsix years as Aray officer during world Mstr II j fbur year# in anasunleatloas\n(including 10 on tin faculty of the Field Artillery Communications\nSchool (6 months m supervisor, 6 months on the ConsuBicatlcms dese&reh\nstaff) and two years planning and supervising inter-service communications\nsystems in the Pacific theater). Das written numerous articles and booklets"
}