{
  "id": "d693-15",
  "text": "on educational broadcasting and relate sndia. Mesiber at the Rational\nIndustry Advisory Council (FOC), alternate water of the Educational Media\nCouncil. Education: Accountancy, University oflilinois, WO-,\nK.S., Mass om*aunieatione, University of Illinois, 195b.\nVEfflfOB B303SQ®, Director of toseareh and Development, Rational Assoc i*-\ntion of Etae'atlowa Broadcasters. Fbrwrly, Assistant Director of test-\nruction in charge of Radio and television Education in tint Dads County\n(mam) Florida schools. In this position he introduced radio, end later\ntelevision, instruction into tbs instructional program of Florida'0\nschools; designed and used one of the first closed-circuit television sys¬\ntem tor instructional purposes in the United States; and established the\nfirst school for television production and operations in the public schools.\nHe has served as a consultant in instructional television techniques\nto the University of Virginia, Auburn university, Uaiversity of Florida,\nUniversity of JO.am, and the University of Hiseonsin. He has been a\nconsultant in educational television planning for the states of Kansas,\nnorida, Dehrasku, Georgia, and west Virginia, and the cities of tash-\nrille, BorfoUt, Charlotte, Orlando, and Rio (Sc Janeiro.\nIn hie current capacity with the HAEB, he has contacted a national\nsurvey of ten needs of education for television frequency allocations;\nconducted a study of the educational aye tea of Aneriean Sana, which\nresulted in the redesign of that system based upon the extended use of\neducational technology; and is now engaged in a surrey of personnel\ninvolved in educational television in the anted States and in a study\nof the distribution of channel* in the television spectrum.\n-TAMES A- TET.muB. Assistant Director, Office of Research and Develop-\nraent, fetita&'Ssoelation at Educational Broadcasters. Has previous¬\nly Executive Secretary, tapirs State IK School of the Air, fyracuse,\ntaw tart; Instructor in television and Director of Studio Training,\ntelevision and Radio Center, Syracuse adversity, tort, vith the\naspire State TO School of ten Air involved coordination of instructional\nradio program presented to classroom throughout tow Tort State on a\nfifteen-station network. At Syracuse University, teaching concerned\nproduction end educational aspects of television, including semnars for\nforeign broadcasters, educational television wortshipo, and regular cours¬\nes in television production ata studio operations. Bm mitten several\narticles, book reviews, a laboratory annual, end reading resource book\nin connection with above wort.\n333CT? F-. CmSHHOOa. J3.. UAEB totwort totagw. too beta with the HAE8\nfor seven years and served as totwort Manager tbs past six. As euch has\ndevoted his primary attention to educational radio programing, selection\nand scheduling of program for the totwort, both to the in-school area and\ngeneral cultural programing area. This background mkes him atalrtbly\nsuited for the proper selection of educational tutorials for the highest\ncaliber. Education: M.S. «■ B.B., English, university of Illinois."
}