{
  "id": "d693-6",
  "text": "3\n€• Gemmni nmt figm QgSd i\n1. She Bern Office Staff will be selected on the beats of\nprofessional twining and experience, with consideration for the ability\nto adopt to the unique requlreoeirts at a hone office back-stopping\ntlen neoeeaary Her effective field support 1b a project of this nature.\na. She Project (hwrdlmstor-ProcicrMiwrt Officer will he given\na thorough grounding in the objectives end processes of the total project,\nwill he made acquainted with the personnel and procedures of the AID in\nWashington, and will he allMMd a period of tine to establish Us hone\noffice organisation sad working arwagMeate with the BIOS organ!-.at ion.\n» is anticipated that hy the tins the fire* of the Meld Staff ace ready\nto go to Ugeria that the Project Coordinator would he able to aeccapcay\nthen and spend a atalann of thirty to slaty days becaslng acquainted with\nthe local situation la each of the regions, conferring with the officials\nresponsible for education and educational broadcasting, getting a feel\nfor the project aa a whole, and developing rapport with the Makers of\nthe Weld Staff, as well as with the staff of SKAZD/Pigerla and Higcrian\nofficials. During the absence of the Project Coordinator on such a trip,\nthe administrative functleas of the hone office will he carried on hy the\nregular IKSB eneeatiwe staff.\n3* Xt- In tlmt tli# Fytjwl iwfr*\n«t least two trips annually to tho field to check -upon progress, avenues\nof ceanunloations, etc. It la proposed that such trips he planned in\nconjunction with dXD end QBAXD^Ugeria, ead teat they be ante at ante\ntime as any he autu&Uy beneficial to tee sgeney end to the project.\nk. tee Project Coordiaator^Procuroaent Officer will he ae\nprofeooioaclly qualified In both tee technical and educational ejects\nof the project ae neafeare of tee Field staff, only in this way can tea\nproper professional rapport he established wad the sensitive ecaamicatli\nachieved teed will aake possible an effective hone office sawvice and\nliaison program.\nXX Plaid Feraonael and Services\n*• SMLESSSBBBi\n1- tee Pield Staff will consist of four faU-tla© technical\nspecialists and toe short-tar» consultants, tea of the full-tine Meld\nStaff will ha Educational Sadlo-television Specialists} one will he a\nGraphic Artie* experienced in television production; and one will he on\nEducations! fedio-felevlaion Writer-Producer, tee short-tow consultants\nwill tei 1} a specialist in in-school utilimtion research and evaluation\nof tea aedla, aad 2) a specialist la teacher-training tax elasarooe utilise-\non# &£ the £*2ii*tia» %fp (i>iipntii m\niawKw Field Staff teatear and win act ae Chief of Party la any ianedlat*\ncar necessary oa-tee-apo* ccnSamrees or m®0t$sAi»w with other nenfeers of\ntea Meld Staff, or with asMB/Mperla.\n’"
}