{
  "id": "d693-8",
  "text": "5\n„_. __ *• ** «***• toe* cooperate tad waric in concert with to®\niJiserian Coordtoafc iag Cemmlttoe to to termed to to* federal Ministry of\n■*■**»• — —T — —r ~i«im-iin nurtiiiS itiSrii m\n«Ato* project «toff will to through too asdto/Jttgeria tadte-felevtolen\nCoordinator, If one is pwrSM, or If not, through the Sealer Meld Staff\n, 3\\ 16 to participating la toe ptoantog eat protest!on\nof instructional MtoUU and radio and tatevtotea programing, toe various\nmatmn of too 9Udd staff »m wik to toMla with toe local aattorl-\nttoe to toato Mgertoa personnel cowterparts to toe tom® and\ntoto we toe specialties of each neater of toe staff. toe staff mu aleo\n■eto pirns to establish continuing pragmas of to-servicc training mad sp-\n8resting to these area#.\n%. toe aastUtoiy services of toe project will include toe tena-\n■estoUen of swab toerieaa research to radio end television toatrwettoB as\n■V he applicable to toe XMtetoa situation. toe project staff will also\nivovito a eoapratenate* look at toe prnasnt production and utiliaiiioa of\ntoetwe-ttooal radio and televteton to Siberia ate mate* critical mto>\nttoa af toe finding*, with such roesmmeteattona as aar to indicated tor\ntoproweaeat af toe projest. Za toe process af establishing an evaluation\nof toe present radio and television school project, plans and necMaento-\ntime will to rate for a continuing program of research and evaluation,\ntolto will affect koto production of material and classroom utilization.\n. _*• **? Of broadcast instruction to toe classroom\nis as important ae tea ta^tera of radio sad television matte ate\nproteetlm. tech of toe value of the radio and television techni^ae weald\nbe lost without toe 2e-«slapoaat of esjwivulenfc tochnioues among the class¬\nroom teachers, toe training of teachers for classroom utilisation torolrae,\nto many toetaaoea, a reorientation at elasamm methodology, to aim case,\ntoe tost trained traditional classroom teacher vUl ham to to taught to\nadapt to his or her efforts to swUmentlns sad reinforcing toe conceptual\nteachings provided bp wall organised radio and television 1mm. tola\ntea continuing process and to to maet effective should be done la-service\nwith a dally etoesroem providing a practical laboratory, toe n*iite»y\naarwteae of tola project will include net only an evaluation of the\nutilisation at radio and television teaching to toe classroom, but aloe\na gdan ter a emtinuias pragma of to-aamee teacher tratotog to classroom\natillrattoa. She Initial eftert my be efteeted via continuing demonstra¬\ntion woakshnpe ate small pilot pragmas of in-service teacher education\nto toe teebte$ws of madia utilisation.\n6. tWi* it to expected tote toe neater* of toe field staff\nand toe Sms Office Staff will vote to close cooperation with mAXB/Hlgerla\nate atg«rton authorities, it to also rapeette toot toe MK8 will to tele\nto provide an added measure of «■*»»»♦'< ate knew-hev ittnmfnn;\nteem toe broad experience ef toe SUB organisation end toe mltlpltolty\nof talent# ate osnpetanctoe afforded by its professional mmtimhtj"
}