{
  "id": "d1251-3",
  "text": "(4)\nU. OF MICHIGAN ON AIR AGAIN\nThe University of Miqhigan started its 16th season of broadcasting\non W J R, Detroit, on October 25th ano 6ts second on W CAR, Pontiac,\nMichigan*\nAmong the programs which will be on the a^r from Michigan campus this\nYEAR WILL BE DR* JOSEPH E0 MADDY”S HISTORIC HYMN SERIES; DISCUSSION\nOF WORLD EVENTS BY PROFESSOR PRESTON SLOSSONj MEDICAL DRAMA; ”WHM\nSave Democracy'* ; short story dramas; campus news; and a Lati n-$mer i can\nGOOD-WILL SERIES*\nProfessor Waldo Abbot has been in charge of radio since its start\nat Michigan* This year he is being assisted by David Owen, who was\nWITH CBS FOR 12 YEARS AND WAS THE ORIGINAL JACK ARMSTRONG*\nCHICAGO RADIO COUNCIL NEWS\nWilliam Sener, formerly of W S U f, Iowa State University, has\nJOINED THE STAFF OF THE RADIO COUNCIL OF THE CHICAGO PUBLIC SCHOOLS\nAS ASSISTANT TRAFFIC MANAGER*\n\"The Radio Workshop in the High School”, a publication of the Sckqoil\nBroadcast Conference, 228 North LaSalle Street, has gone through\nA COMPLETE REVISION AND ILLUSTRATIONS HAVE BEEN ADDED * THE BOOK,\n66 PAGES, MIMEOGRAPHED, WAS RECENTLY ADOPTED BY THE PAWTUCKET,(RHODE\nIsland) Public Schools as the text for high school workshops* she\nBOOK SrLLS FOR TJFTY -STMTS AND MAY BE OBTAINED BY WRITING (HE SCHOOL\nBroadcast Conference, 228 N* LaSalle Street, Chicago, Illinois*\nThe Central Radio Workshop, an activity of the Radio Council of the\nChicago,Public Schools has organized for a fall series of programs\non Americanization* Made op of boys and girls selected after\nauditions from every high school and junior college in Chicago,\nthe Workshop, under the direction of George Jennings, is acting\nAS A TRAINING CENTER FOR YOUNG PEOPLE ACTIVELY INTERESTED IN RAD80*\nMembers of the group recently presented a Round Table on Safety\nfor the National Safety Congress in annual meeting at Chicago,\nand will take part in several panels at the School Broadcast Con¬\nference*\nThe “Program Side of Radio*’, a vocational monograph written by\nGeorge Jennings, program director of the Radio Council, hicago Public\nSchools, has been published -by the Bellman Publishing Company,\nBoston* 1 <\nThe Central Association for Okildhood |oucation is scheduled to meet\nTODAY IN THE STUDIOS OF THE RADIO COUNCIL TO DISCUSS THE PART RADIO\nIS PLXYING IN KINDERGARTEN AND PRIMARY EDUCATION. SPEAKERS WILL\ninclude Martha Blair Fox, writer and (story-teller for the Council,\nJuliet Forbes, continuity writer, E. h. Anoresen, Chief -ngineer,\nStation V; 8 E Z, and George Jennings, Program Director."
}