{
  "id": "d1800-11",
  "text": "TECHNICAL COi ITTTEES SET AT IEXICO MEET\n-12-\nThree technical committees were established in November by the World High Frequency\nBroadcasting Conference meeting in Mexico City. Tasks ahead include examination\nof propagation curves for the entire world, power requirements, signal-to-noise.\nratios, adjacent channel ratios, directional antenna studies, etc. The Priorities\nand General Principles Committee have begun their preliminary work.\nScheduled to core before the Plenary Session is the question of Israel’s admission\nto the Conference. While the Credentials Committee temporarily admitted Israel\nas \"observer attached to the United Nations,\" the Israel Delegation refused to\naccept this position.\nA committee has been established to set dates and location for the lourth Inter—\nAmerican Telecommunications Conference (now tentatively set for Caracas in\nFebruary 1949).\nThe United States Delegation has been augumented by the recent arrival of Kenneth\nNorton, Bureau of Standards and William Stone, State Department.\nFOUR WOI 511 HEADLINE RUTGERS UNIVERSITY FORUM\nInternational views on the topic \"What About Equal Rights for Women\" were aired\nthis month by Margaret T. Corwin, dean of the New Jersey College for Women of\nthe New Jersey State University! Nrs. Francis W. Hopkins, president of New Jersey\nLeague of Women Voters5 Dr. Ida Bobula, director of Sarolta College for Women in\nBudapest, Hungary; and Hiss Eva Canbia, member of the U.N. Commission on the status\nof women from Uruguay.\nRutgers University Forum programs are released Tuesday nights over 4 New Brunswick\nAL and FL outlets and transcribed for re-broadcast over 5 other stations through¬\nout the state at a later time.\nDEATH TAKES WKAR STAFF IBI3ER\nRobert W. Kamins, 25, news editor and special events director of I ichigan State\nCollege’s radio station WKAR, died Sunday afternoon (November 28) at Sparrow\nHospital in Lansing.\nKamins, who received his B.A. and Hi.A. degrees from 1 ichigan State College, had\nbeen in ill health for several years with a kidney ailment, and had been con¬\nfined to the hospital for the past week.\nA student announcer at WKAR during his college career, Kamins served as news\neditor of station WKZO in 1945-46 before returning to NSC to take work on a\nmaster’s degree. He joined the staff of WEAR as news editor and special events\ndirector in July 1947. He was assistant director of the \"Adventures in Music\"\n\"Life on the Farm\" programs of WKAR, a product of \"THE NEWS AND YOU\", and announ¬\ncer for various news programs.\nA member of Pi Kappa Delta, honorary forensic society, Kanins was, at the time\nof his death, district governor of Alpha Epsilon Rho, National honorary radio\nfraternity.\nHe is survived by his parents. Nr* and Mrs. Samuel Kamins and one brother, Arthur^\n23, of 1212 Parkview, Lansing. Burial was in the lit. Hope Cemetery at 12 noon\nI'onday. __ ___["
}