{
  "id": "d1800-15",
  "text": "-16-\nrecording WILL START‘ON CUE FROL P5TRILL0\nResumption of commercial recording under tho royalty trusteeship plan endorsed by\nboth the AFM and the recording industry hin ,os on James C. Petrillo's ordering the\nmusicians back to work* The U. 30 Department of Justice, while declining to\ngive an opinion on whether or not the trusteeship plan is legal,indicated it would\nnot prosecute either AF1I or the recording industry if recording is resumed.\nWTIC PLEDGES ANNUAL GIFT OF 310,000 TO SY!PHONY\nStation WTIC has pledged '510,000 per year for the next three years to the\nSymphony Society of Connecticut to help finance the recently reorganized Hart¬\nford Symphony Orchestra,\nNEW 50,000 WATT FL NON-COI LERCIAL STATION IN CHICAGO\nChicago's first and only 50,000 watt FI. s tat ion, WliBI-FN, recently went on tho\nair. Since 1943 the 1 ,'oody Bible Institute has operated the station at 1000 watts\nin connection with its 5000 watt A1 outlet, WLBI. While the ceiling power allow¬\ned in Chicago by the FCC is 40,000 watts with a 500 foot antenna, WI BI-FI.' was\ngranted a permit to operate at 50,000 watts because its antenna was only 490\nfeet high.\nAntenna and transmission lino to bo used in tho enlarged station operation wore\ninvented by WiFi's chief engineer, A. P. Frye and received the approval of tho\nFCC. According to Frye, tho WIBI transmitter will carry 10,000 watts and will\nactually run at 7,500*watts. However, with the multi-bay antenna which Frye has\ninvented the power will be multiplied 8 times. Allowing for some line loss, total\nERP will bo 50,000 watts.\nThe new antenna consists of a total of 32 folded dipoles of copper pipe attached\nto the four sides of tho original WMBI tower at intervals of seven and a half\nfeet. . ' . Using. this antenna gives tho effect of multiplying the power by\neight. „_\nTRANSFER OF VOICE OF AI ERICA” RECChi ENDED BY HOOVER C0UIISCION\nTransfer of the State Department's international information program, including\nshortwave broadcasting and motion pictures, to an independent Government cor¬\nporation, has been recommended by the Committee on Organization of the Executive\nBranches headed by former President Herbert Hoover. Such a corporation, it was\nproposed would bo given frequent and constant advice by tho private agencies of\nthe mass communications, through advisory committees representing films, radio,\nand press. __\nALABAIA. UNIVERSITY STUDENTS IAKING SPECIAL STUDY OF RADIO\nStudents in the radio department at tho University of Alabama, home of NAEB\nstation WU0A-FK, are hearing discussions currently of various phases.of the.radio\nindustry presented by industry representatives. Tho planned scries is a joint\nproject of the Radio Department of the University and the Alabama Association\nof Broadcasters.\nQuest speakers thus far have included William Fineshribor, CDS general program\nmanager; Raymond Gram Swing, former KBS commentator, and many regional representa¬\ntives. Radio activities at the University of Alabama arc jointly headed by Leo\nMartin, head of Radio Arts Department, and Graydon Ausmus, WTJ0A-FH manager and\ndirector of NAEB Region II."
}