{
  "id": "d1800-2",
  "text": "-3-\nUHF MOVE FORECAST BY COY IN CHICAGO VIDEO ADDRESS\nOpening of ultra-high frequency channels to commercial television in the near\np. future was predicted in Chicago in mid-NOvember by the best-qualified person in\nthe country, FCC Chairman TTayne Coy, Speaking at a special TV luncheon of the Rotary\nClub of Chicago, Coy said the Commission \"is studying the possibilities of adding\nmore channels, employing those in a higher part of the radio spectrum. He are now\nholding conferences with industry leaders to determine if equipment can be\ndeveloped to operate in this upper region. I predict that we are going to be able\nto add those higher channels soon.\"\nThe luncheon was attended by nearly 1,000 persons, including most of top Chicago\nexecutives of the four networks, and presided over by Alfred J. Barboro, president\nof Rotary Club of Chicago, who introduced I. E. Showerman, NBC.\nRegarding the question of obsolescence of present receivers in the event of the\ninstitution of UHF channels, Coy said, \"Several manufacturers have assured us that\nwhen additional channels are added, they will be able to produce adaptors at reason¬\nable prices that will enable the present sets to time in the new stations.\"\nSees Coast-to-Ooast Tele Soon\nWithin two years, the Chairman estimated, coast-to-coast tele will be a reality with\nabout 400 stations in operation. \"My opinion is that we will have 1,000 stations\non the air in seven or eight years from now,\" he added.\nDubbing TV the \"most powerful, most effective and the most profitable medium for\nmass merchandising yet devised,\"Coy said the medium in the long run will ;iserve\nto create larger advertising expenditures\" for all media despite a possible\n\"temporary loss of advertising volume by one medium or another\" to video.\nThe other media, however, will have to make widespread changes because of the compe¬\ntition for the advertising dollar, Coy said. \"As television progresses, persons\nconducting both television and sound stations will, I believe, abandon the latter\nto concentrate on the former because of the incompatability of the two services\nunder one management. Sound broadcasting in the metropolitan areas will always\nbe necessary to supplement television. In the rural areas it id.ll be expanded,\"\nhe said.\nMEMBERS OF THE TELEVISION INDUSTRY 1ST IN NEW YORK THIS MONTH for the fourth\nannual conference of the Television Broadcasters Association. Members of the in¬\ndustry from all over the country heard FCC chairman Wayne Coy predict the TV\nfreeze would soon be off, discussed TV problems ranging from management \"do’s\nand don’t\" to day-time programming problems, concluded TV is a healthy industry,\ngrowing fast, still full of \"growing pains\", but well on the way out of adolescence\ninto a predictable maturity.\nNEW TELEVISION NEWSLETTER FOR CHICAGO PUBLIC SCHOOL PERSONNEL\n\"Television News\" is the title of a new monthly newsletter, prepared by Lester\nJ. Schloerb, of the Chicago Radio Council (WBEZ-FM) for the General Superinten¬\ndent’s committee for the Study of Television.\nA sample mailing of this excellently x/ritten and concise publication, is being\nsent to all NAEB members through the courtesy of 1 r. Schloerb. Additional re¬\nquests for information about \"Television News\" should be sent directly to him\nin care of Radio Council, WBEZ, Chicago, Illinois"
}