{
  "id": "d1800-4",
  "text": "-5-\nr*\nTELEVISION REPORT—EXPERIMENTAL STATION W-X-B-V--KANSAS ST AT'.7! COLIEGE\nKansas State College in Manhattan, one of the few pioneers among American colleges\nin the field of television, is in the midst of a project that will be of wide inter¬\nest in the television field.\nRealizing that the cost of construction and operation is one of the factors in the\ndevelopment of television, Kansas StateTs department of Electrical Engineering,\nheaded by Prof. R. G. Klooffler, is testing the feasibility of providing television\nservice with a low power transmitter to a small community, at a reasonable cost.\nWith this objective in mind, members of the Electrical Engineering faculty and\ngraduate students in the department have built the transmitting and pick-up equipment\nof the College!s experimental television station, WXBV, from war surplus and college\ngift material.\nIn addition, the station provides research projects for graduate students in Electri¬\ncal Engineering. And it provides laboratory facilities for use with a four-hour\ntelevision course offered by the department.\nWXBV is licensed to operate with a peak power of 400 watts, but the maximum power is\nnot being utilized at this time. The effective radius of its signal is about\nseven miles,\n•-Operation thus far has been limited to experimental work; lost programs televised\nhave been aimed at specific audiences and have been quite informal. One such pro¬\ngram was presented recently as a demonstration for a group of Kansas newspaper\neditors meeting at Kansas State.\nPlans calls for the addition in the immediate future of a movie projector so that\n16-mm educational films can be added to the live programs. Journalism and radio\nspeech departments at Kansas State are studying the possibilities of adding courses\nin television programming and television news to acquaint students with television\ntechniques. The Kansas Extension Scrvj.ce plans to experiment in the field of adult\neducation work through the video medium,\nKansas State first began work in television as a project of its Engineering Experi¬\nment Station and the work has continued to date as a project of this branch of the\ncollege. Construction of equipment was among the early projects of the Electrical\nEngineering department in that field* In 1932, the college was granted an experi¬\nmental license and began television programs in that year, continuing until 1940*\nThe war brought a halt to activities temporarily, but construction of a, new station\nwas begun after V-J day and in February, 1940, a new experimental license was granted.\nProfessor K. H. Martin, now associated with the Applied Physics Laboratory '.at John\nHopkins University, was in charge of the recent television work, and did much of\nthe original construction and design of the situation. The current work on WXBV is\nbeing conducted by Kenneth Hewson, Robert Dennison, Wga, R. Ford, and Prof, J. Edmond\nWolfe, all of the Electrical Engineering Staff.\n—Robert D. Hilgondorf\nProgram Supervisor, Station KSAC\nTELEVISION WITH YOUR BUS RIDE, TRAIN TRIP, OR CROSS\" COUNTRY FLIGHT is predicted\nby John Craig, TV manager of Croslcy Division of AVCO, as excellent means of\neljminating passenger monotony and fatigue. Experiments thus far in railway\ncoaches and airliners have proven successful as well as TV tests on inter-city\nbusses."
}