{
  "id": "d1800-7",
  "text": "-8-\nFACSII-ILE AND TELEVISION DOMINATE ST. LOUIS N-A-R-N-D MEET\nNearly 100 radio news editors gathered in St* Louis, No., November 12-14 for the\nthird annual convention of the National Association of Radio News Directors.\nThe group included men from seven educational institutions-—Columbia University,\nUniversity of Illinois, Iowa State College, University of Lessouri, University of\nKansas, Northwestern University, and the University of Nebraska—and represented\nthe largest block on hand, with the exception of the strong representation from\nIowa radio stations.\nReaction to such round-tables as \"The Small Station Newsroom,\" \"Special Methods of\nMunicipal Reporting,\" \"Radio-Newspaper Relations\" and the like was good, but the\nstrong facsimile—television overtones of the meeting perked listening ears up\neven more.\nNews editors were told of the success of election coverage by facsimile in Miami,\nFlorida, (The Miami Herald) and at Columbia, Missouri, where the University of\nMissouri is operating equipment on loan from the St, Louis Star-Times. Missouri\nis experimenting on the typographical aspects of facsimile, to determine which\nfaces lend themselves most successfully to the publication of the radio-newspaper.\nRadio men were assured that facsimile is \"not a trick that belongs only in the\nrealm of the newspaper world,\" but that it can be successfully operated by an\nindependent radio station without a newspaper tieup. Facsimile, according to\nJohn T, Bills, of WQA1'-Miami, may bring the daily newspaper to the field of country\njournalism, where the weekly has ruled supreme.\nOthers saw facsimile as an important radio factor in the presentation of statisti¬\ncal matter such as market reports. Statistics must necessarily be held to a\nminimum in aural broadcasting most radio men agree.\nKSD-TV, one of the nation’s most successful television stations from the standpoint\nof programming, furnished a convention highlight. Delegates to the confab were\nconducted through KSD-TV in small groups while a \"live\" show was produced,\nA television panel was the concluding event of the convention. Held in the KSD-TV\nstudios, it brought the radio newsmen into the sphere of actual TV broadcasting.\nThe stations represented by newsmen are in various levels of television planning,,,\nranging from actual broadcasting, through building, on down to primary paper work.\nNetwork and wire service representatives spoke of expanding facilities for tele¬\nvision operation, stations now operating television outlets compared notes, and\nothers came from the meeting convinced that only time is slowing the television\nadvance. The KSD-TV panel demonstrated the monotony of viewing a newscaster while\nho road 15 minutes of news and in turn showed excellent use of pictures accompanying\nnews copy.\nSpecial Report by Harry Heath, ISC Dept, Jlsm.\nand Robert I-ulhall, WO I News Editor\nARE THEMSS YOUR PROGHAi PROBLEMS?\nJim Miles, Director WBAA, provides a list of themes used on their Purdue\nUniversity station as a start toward a complete listing of possible themes.\nEach record is accompanied by the name of the show and a brief description.\nHe suggests that each HAEB member add to the list. The WBAA list is avail-\nable at ITAEB Headquarters,"
}