{
  "id": "d207-109",
  "text": "b) That the establishment of Asian prizes in different fields of broadcasting be\nadopted in principle and that these prizes be held within the framework of the\nfuture annual conferences, provided that the conference decides on furnishing\na budgetary basis for such prizes. In the absence of prizes, presentation of\n“honorary” awards could then be considered.\nc) That the conference adopt the proposal by NHK to hold the Asian Music\nFestival through the exchange of recordings.\nd) That the conference accept with thanks the expression of readiness by NHK\nto respond to a request by the participating organizations that it compiles a\nclassified catalogue of Asian music on the basis of information supplied by\nthe participating organizations.\nThe Committee heard with gratification the remarks by the representative of the UN\non their joint project for the Asian region in preparing a series of radio and TV pro¬\ngrams under the auspices and with the financial support of the UN. The Committee\nexpressed its hope and wish that similar projects will be undertaken in the future.\n3. On the training of staff:\na) That survey of training facilities in Asia for programing and engineering staffs\nand the collection of data on such facilities be undertaken by the participating\norganizations for submission to and compilation by UNESCO and NHK for\nready referential purposes.\nb) That the participating organizations encourage the exchange of engineering\nand programing staffs among themselves.\nc) That the conference adopt a program of joint training of staff of the partici¬\npating organizations. The Committee recommends that an approach be made\nto UNESCO to lend financial support to this educational project.\n4. On questions of copyright in broadcasting:\na) That the conference recommend to participating organizations to exchange\namong themselves up-to-date and fullest possible information on copyright\nlegislation in their respective countries.\nb) That in the exchange of programs, the supplying organization clear the re¬\ncipient organization of all responsibility or liability under the copyright laws.\nThat it further the understanding of the conference that any exchange material\nreceived from a participating organization will be used by the recipient organi¬\nzation for broadcast purposes only.\nThat is the result of the Program Committee and I would like at this point to ac¬\nknowledge the help of the members of the Program Committee during the delibera¬\ntions, the staff of NHK assigned to the Committee, the help of the representative of\nthe UN to the conference and lastly but not least the secretarial help. Thank you.\n17"
}