{
  "id": "d207-111",
  "text": "Item l-(6) Utilization of magnetic recording standard tapes.\nDetailed explanations were given by the Japanese delegation concern¬\ning the standard magnetic recording tapes processed by NHK with the\naid of reference materials thereof.\nFurther detailed information was sought by the Indian representative.\nThe Committee noted with satisfaction NHK’s offer to supply such\nstandard tapes on request to other member organizations.\nItem 1—(9) Discussion on the pooling of the know-how and resources in Asian\ncountries for making cheap-priced receivers available, etc.\nMr. Obhrai, the United Nations and UNESCO representative, em¬\nphasized the necessity to popularize cheap receivers in under-developed\ncountries for the reason that radio constitutes the most powerful means\nof mass communication in such areas. He also referred to the research\nactivities on low-cost receivers now being stimulated by UNESCO in\ncooperation with the International Telecommunication Union. The\nIndian representative fully agreed to this, and requested the Japanese\ndelegation to explore the possibility of development of low-cost re¬\nceivers.\nItem 1-(1), (5) and (8)\nThese were taken up for discussion together.\nItem 1— (2) Discussion of technical problems involved in the radio stations of the\nAsian region.\nThe Committee agreed that they might safely omit the discussion of\nthis item, since the aim of this proposal would be attained by the dis¬\ncussion of other technical problems in the rest of the agenda.\nItem 1—(7) Discussion on FM transmission, microwave links for TV, etc.\nThe question of reliability of transistors in equipment for the main\nbroadcasting chain was discussed. It was realized that as far as\nstability and reliability were concerned, the time appears to have\narrived for more general usage of transistors in all manners of equip¬\nment required for broadcasting purposes even including precision\nmeasuring equipment. It was reported by the Japanese delegation\nthat MESA type transistors are in current usage up to frequencies\naround 100 Mc/S and that they were now being developed to operate\nas high as 500 Mc/S. Possibilities of scatter propagation techniques\nas applicable to broadcasting needs was discussed and the Japanese\ndelegation stated that they would provide a report on this subject after\nconcurrence with KDD and NTT.\nItem 2— (1) Relay of telecasts among Asian countries.\nThe Japanese delegation tabled a proposed scheme for the linking up\nof Asian countries with television hookup somewhat on the lines now\nadopted for Eurovision. Although this was a little premature at the\npresent moment, the idea is to be followed up in future years. Such\ncoverage was to be achieved by microwave links either using scatter\npropagation or with ordinary repeater stations located at suitable dis-\n19"
}