{
  "id": "d207-114",
  "text": "ANNEXE D\nTHE FOURTH ASIAN BROADCASTERS’ CONFERENCE\nI. GENERAL RESOLUTIONS\nThat this 4th Asian Broadcasters’ Conference agree as follows:\n1. Accepts the Review of Development since the previous conference submitted by\nNHK, serving as Secretariat for the Third Asian Broadcasters’ Conference, and\napproves its incorporation in the permanent records of the Conference. The Con¬\nference expresses warm appreciation for the services of NHK in this regard.\nExchange of Information and Material\n2. Records with satisfaction the progress made in implementing the recommendations\nadopted at the Third Asian Broadcasters’ Conference regarding the promotion of\nregular exchanges of programme and materials (Radio and TV) and recommends\nthat in furtherance of these objectives, the scope of these exchanges be extended\nto include the following in Radio and, where practicable, in TV.\n(a) Talks by eminent personalities\n(b) Children’s programmes\n(c) Advanced educational matter for University students\n(d) Plays and features based on folklore\n(e) Drama\n3. Agrees that members should provide other members with programme material\nincluding TV films and programme facilities on request. Where, however, sub¬\nstantial costs are involved, these should be met by the requesting country.\nTraining and Exchange of Staff\n4. With regard to the training and exchange of staff, notes that headway has been\nmade in implementing the recommendations made at the Third Asian Broadcasters’\nConference, e.g., training courses have been made available by NHK in Tokyo\nwhere already some 64 students from 12 member countries have received training.\nIn addition, at the suggestion of UNESCO, NHK has established a central train¬\ning institute in Tokyo where concurrently with the holding of this Conference, 25\nstudents from 10 of the organizations participating in this conference commenced\na course in educational television sponsored by UNESCO with the cooperation of\nthe Japanese National Commission for UNESCO. However, little progress has\nbeen made in implementing the recommendation regarding the collection of data\non training facilities in Asia for programme and engineering staff, nor has much\nbeen done in the direction of exchanging engineering and programming staff\namong the participating organizations.\n5. Records its appreciation of the action of NHK in orgnaizing regular and frequent\ntraining courses and hopes that this example will be followed by other participat¬\ning organizations. In addition to regular courses, the Conference recommends\nthat ad hoc courses should be arranged by participating organizations for pro¬\ngramme and engineering staff as and when feasible. With regard to the unimple¬\nmented recommendation of the last Conference, the Conference urges participating\norganizations to accept their responsibilities in this direction.\n22"
}