{
  "id": "d207-2",
  "text": "2,\n(4) Techinioal Library; We are building up in Tokyo a modest technical\nlibrary which we expect to be considerably developed when an engineer\nis added to the ABU staff in Tokyo. The Library comprises mainly\nreports, monographs and other similar material contributed by\nmembers and we would welcome contributions particularly of material\nthat would be of interest to members in developing countries.\nYou will receive a catalogue from Tokyo and additions to the Library\nare published in the Newsletter.\n(5) Annual Contribution: As you know NAEB's contribution for a full\nyear would be SUS1000, i.e. 10 units at the existing value of the unit\nof contribution for associate members which is $US100. However,\nClause 4 of Article 15 of the Statutes states that a member which joins\nduring the course of a fiscal year \"shall be liable for payment of\none-twelfth of the annual subscription or contribution for each full\ncalendar month still to run until the end of the said fiscal year.\"\nThe ABU's fiscal year runs from July to June and as NAEB's application\nwas accepted in October, it will be necessary for your organisation\nto pay only for 8 months in the current year, that is, $US666.66.\nAs the subscriptions and contributions from members are used in meeting\nthe running costs of our offices in Tokyo and Sydney, we ask some of\nour members to send their payments to Tokyo and some to Sydney, to\navoid extra work for our staff in transferring funds. In the case\nI of NAEB, we would like the payment to be sent to the ABU's bank .\nj account in Sydney which iss /\nAsian Broadcasting Union, Account No. 800-283\nI Park and Castlereagh Street Branch\nI The Commonwealth Trading Bank\nSydney, Australia.\nYou will already know that, as stated in the Statutes, the Headquarters of\nthe ABU are in Tokyo but when I became Secretary-General in 1965 it was\nagreed that I should normally carry out my responsibilities from Sydney\nand our work is therefore divided between the two centres. My office in\nSydney comprises myself, my Assistant, Miss Betty Cook and my secretary,\nMiss Susie Wan, to whom will shortly be added Mr Kang Chong Soo a journalist\nfrom South Korea who will be responsible for the ABU Newsletter and various\nother duties. In Tokyo we have our Honorary Deputy Secretary-General, Mr\nIchiro Matsui, who was until his recent retirement one of NHK's most senior\nofficers, two Assistants, Mr Roku Ito and Miss Fumie Mizuhara and a typist,\nMiss Gunji. As mentioned earlier, an engineer is to be added to the Tokyo\nstaff as soon as possible. Copies of correspondence are exchanged regularly\nbetween the two offices so that we are constantly in touch with each other's\nwork.\nWith kind regards,\nSe ere t ar y-Gen era1—\nMr William G. Harley,\nPresident,\nNational Association of Educational Broadcasters,\n1346 Connecticut Avenue NW,\nSuite 1101 Dupont Circle Building,\nWASHINGTON. D.C.20036,\nU.S.A,"
}