{
  "id": "d207-67",
  "text": "4. Small Company : Big Project\nGrampian Television, the ITV Company servicing the N.E. of Scotland, is\nto participate in a new project aimed at promoting greater international\nunderstanding. The project, the production of a monthly ABU Magazine,\nis being undertaken by 11 members of the Asian Broadcasting Union.\nK.R. Bellini, Grampian’s Programme Planning Controller, who represents\nthe company on the Asian Broadcasting Union says: \"We hope to show the\ngreat advances which are being made in this country both socially and\nindustrially through the medium of these international news magazines.\"\n5. More ATV Success in America\nATV Network has just completed a new seven million dollar colour televi¬\nsion programme deal in the United States. ATV was the first British\ntelevision company to sell to an American network a drama for full show¬\ning coast to coast. This was \"Ivanov\". Now C.B.S. has bought four major\ntwo hour dramas including Noel Coward's \"Present Laughter\" and \"The\nPrisoner\".\n6. Tyne Tees TV Participates in Ireland Festival\nIreland held its festival of folk music and folk-lore in Dublin. The\nGolden Harp competition,one of the features of the Festival, was for\ntelevision programmes on 2nd - 6th October. The competition was organised\nby Radio-Telefis Eireann under the patronage of the European Broadcasting\nUnion. Tyne Tees Television entered a special half hour version of its\nprogramme \"These Happy Sounds\".\nNHK Programmes Win Italia Prize 1966 (From NHK)\nAt the 1966 Italia Prize competition which took place in Palermo, Sicily,\nthe NHK entries, \"What Happened Up There?\" and \"Comet Ikeya\" won the\nItalia Prize for TV documentaries and that for radio stereophonic work,\nrespectively.\nIt was the first time for NHK to win the grand prix in the TV documentary\ncategory of the Contest and the second time to win the Prize in the\nstereophonic work category.\nSenior Staff of BBC. VJDR and NDR Visit NHK to Observe Colour IV (From NHK)\nDuring the last week of October, the following three groups of senior staff\nof BBC (London), WDR (Cologne) and NDR (Hamburg) visited NHK respectively\nto observe the activities of NHK in the field of colour television. Each\nof the groups spent a few days in Tokyo to discuss the relative problems\nwith the NHK staff and to see the facilities in operation:\n- 18 -"
}