{
  "id": "d207-69",
  "text": "also be extended at a cost of approximately $2 million. All in all the\ndevelopment of Broadcasting Services in Sabah and Sarawak within the\nFirst Malaysia Plan will cost the Government around $10,2 million.\n9 XLia (By Felix Puerto, RTM)\nTelevision Malaysia first started as a pilot service with a transmitter\nof lOkW E.R.P., serving only the capital city area of Kuala Lumpur. It\nwas commissioned on December 28th, 1963, and was initially planned as a\nnetwork for the then Federation of Malaya, but is now envisaged to embrace\nthe whole of Malaysia as a national service.\n1) Development\nDuring the first six months of pilot service. Television Malaysia tele¬\ncast an average of 24 hours per week in four languages: Malay, English,\nMandarin, and Tamil. Since then much progress has taken place in many\nrespects including, among other things, the coverage areas, number of\naudience, and the volume of production.\n2) Studios and Stations\nTelevision Malaysia first started with only one small-sized studio.\nAnother studio was soon added and these studios together with the Out¬\nside Broadcast van and film camera facilities have enabled television\nMalaysia to sustain a weekly transmission time of approximately 50 hours,\nof which about 45$ is produced 'live' or recorded in the studios.\nStage by stage, new transmitting stations were constructed and at the\ntime of writing, a total of 10 transmitting stations are in existence.\nThese transmitters cover approximately 75$ of the peninsular Malaysia,\nmost of which area is on the West coast. Very recently the transmitter\nat Bukit Bakar, .Kota Bharu, has been put into operation under test and\nthis marked the beginning of work to introduce TV on the East coast of\nWestern Malaysia. The transmitters are linked by a microwave system\nleased from the Telecoms Department. By this method all programmes\noriginating from the main station at Kuala Lumpur are transmitted simul¬\ntaneously to the other stations.\n3) Programmes\nTelevision Malaysia endeavours to provide a variety of types of programmes\nin order to suit a variety of tastes of the cosmopolitan population of\nMalaysia. Dictated by this general principle, the types of programmes are\nas follows\n(a) Talks (including forums and discussion)\n(b) Entertainment (musical, light variety, drama\nand comedy, sports)\n(c) Information (news, news magazine and documentary)\n(d) Educational\n(e) Religious\n(f) Nationalism (patriotic programmes)\n(g) Others\n- 2.7%\n- 64.2$\n- 15.8$\n- 3.6$\n- 0.4$\n- 2.6$\n- 10.7$\n- 20 -"
}