{
  "id": "d207-82",
  "text": "- 2 -\nin making fully effective the projects we already have in hand and in planning\nfurther co-operative efforts in the years ahead. I am sure that our existing\nmembers would warmly welcome NAEB*s participation, knowing the sincerity of your\napproach to using the broadcasting media for worth while purposes*\nAs to encouraging international understanding, the ABU is gradually developing\nprogramme exchanges and exchanges of information among its members in a number of\ndifferent fields. We have of course various practical problems such as differences\nof language but we believe that genuinely valuable exchanges can be put into\noperation which will help the peoples of ABU countries towards a better under¬\nstanding of each other. We naturally hope that the associate members in other parts\nof the world will take part in these activities.\nIn this regard I should add that all the full members of the ABU are anxious that,\nas the Union grows, it will be able to provide valuable services for the associate\nmembers in other parts of the world. The members in the Asian/Pacific area\ncertainly consider it is a duty - in fact a privilege - to assist colleagues in the\nUnion from other regions as fully as they can. They would like, for example, to\ngive the fullest possible assistance and co-operation to representatives of associate\nmembers who may wish to gather material for radio or TV programmes in the Asian/\nPacific area.\nYou will understand that in this early stage of its work that ABU has, inevitably,\nmany financial problems. While a few of the flill members in the Asian/Pacific\narea are large organisations, the majority have veiy limited budgets and can afford\nto pay only small annual subscriptions. On the other hand, these smaller members\nworking in developing countries have an urgent need for the assistance in improving\ntheir own services, in staff training etc. which the ABU could provide. The Union\nis, in other words, facing a very large task with only a very limited imcome from\nits own resources.\nThe arrangements regarding the financial contributions of members are set out in\nArticle 14 of the Statutes, from which you will see that there is a scale of\nsubscriptions for full members under which the number of units of subscription paid\nannually by each full member is related ot its annual operational budget. At the\nfirst General Assembly last November the value of the unit mentioned in this scale\nwas fixed at /lOO (.U.S.). As I have indicated above, some of our full members in\ndeveloping countries could not find ftinds to pay much more thah about /lOO per annum,\nso it is unlikely that the value of the unit will be substantially increased in\nthe near future - rather more than half our present full members are in Groups A\nto D in the scale in Article 14*\nAs stated in Article 14(3)> the annual contributions paid by associate members are\nnormally fixed at half the number of units payable if the organisation concerned\nwere a full member but you will also note that there is an upper limite of 15 units,\nthat is, no associate member could be asked to contribute more than 15 units per\nannum. This latter provision of the Statutes is not likely to be altered bacause\nour Union does not want to feel under too great a financial obligation to its\nassociate members.\nIn the case of an association such as NAEB it would be normal to take the total\nrevenue of the members as a basis for determining the number of units payable\nas an annual contribution. This has been donf, for example, for the Federation of\nAustralian Commercial Broadcasters which is already an associate members in their\ncase we use the figures published annually by the Australian Broadcasting Control\nBoard (roughly equivalent to the FCC). However, if there would be problems about\nthis approach for NAEB, we could go into the question of a suitable alternativeo\nI am attaching copies of a form, seeking some information about your otganisation,\nwhich you would need to send with your application. We have tried to make it\nsuitable for use by associations as well as single organisations, but if any\nsections of it present problems for you I hope you will let me know. Its main pur¬\npose is to obtain information demonstrating eligibility in terms of our Statutes\nand the matter of assessing the annual contribution.\nIf, as I very much hope, NAEB,intends to seek associate membership, all that would be\nrequired would be to write a letter to our President, Mr. Maeda, stating that NAEB\nwishes to become an associate member and attaching one copy of the form. There is\nno need for me to give you Mr. Maeda*s address as I realise that itis already\nwell-known to you.\n./3"
}