{
  "id": "d207-93",
  "text": "STATUTES\nOF\nTHE ASIAN BROADCASTING UNION\nPreamble\nTaking into account the provisions of Articles 55 to 59, 62 to 64 and 70 of the United\nNations Charter as well as the various resolutions of the previous Asian Broadcasters’\nConferences and in implementation of Resolution No. 2 adopted at the Fourth Asian\nBroadcasters’ Conference held at Kuala Lumpur in August 1962, the broadcasting\norganizations of a national character or associations of such organizations (hereinafter\ncalled “broadcasting organizations”) of Asia and the Pacific hereby agree to establish\na Union under these Statutes.\nArticle 1: Foundation\n1. The Union shall be called the “Asian Broadcasting Union” (hereinafter referred\nto in abbreviation as ABU).\n2. The meaning of “Broadcast” employed herein shall be the same as employed for\nthe same word used in 28, Section 2 of Chapter 1 of the “Radio Regulations an¬\nnexed to the International Telecommunication Convention” as adopted in 1959 in\nGeneva. “Asia and the Pacific” as herein employed refers to the countries which\nlie substantially between the longitudes of 30 degrees East and 170 degrees West.\n3. The Union shall be of unlimited duration.\n4. The Union shall obtain and possess legal status in accordance with the laws of\nthe country where it shall have its seat.\n5. The seat of the Union shall be at Tokyo, Japan.\nArticle 2: Objectives\n1. The ABU shall have no political or commercial aims.\n2. The objectives of the ABU shall be:\na) to support in every appropriate field the interests of broadcasting organizations\nwhich have accepted these Statutes and to establish relations with other broad¬\ncasting unions and other organizations;\nb) to promote and coordinate the study of all problems relating to broadcasting\nand to ensure the exchange of information on all matters of general interest to\nbroadcasting services;\nc) to promote all measures designed to assist the development of broadcasting in\nall its aspects;\n1"
}