{
  "id": "d207-98",
  "text": "nary session shall be convened within a period of not less than 3 days and not more\nthan 10 days.\nSubject to the provisions of Clause 11 of Article 3, Clause 3 of Article 5 and Clause\n3 of Article 16 the decisions made at the reconvened session of the General Assem¬\nbly shall be valid regardless of the number of the members present or represented.\n4. The General Assembly shall elect a Chairman and two Vice-Chairmen.\nThe Chairman shall preside over the proceedings and maintain order at various\nsessions and meetings.\nThe Vice-Chairmen shall assist the Chairman and/or act as Chairman in the latter’s\nabsence.\n5. The General Assembly shall appoint a Secretary-General who shall be in charge\nof administrative and secretarial arrangements of the General Assembly.\n6. A register of attendance shall be kept by the Secretary-General for each sitting\nof every session of the General Assembly.\n7. The minutes of each sitting of the General Assembly shall be drawn up by the\nSecretary-General and submitted to the Chairman for his approval and signature.\nThe minutes shall be confirmed at the next ordinary session of the General As¬\nsembly.\n8. When voting is necessary, the following procedures shall be adopted:\na) Unless otherwise provided for in these Statutes, any proposal, in order to be\nconsidered as accepted, shall obtain more than half of the votes validly cast.\nIn case of a tie, there shall be a second vote. If the second voting still results\nin a tie, the proposal shall be considered as rejected.\nb) In case of equal votes in the election of the President or the Vice-Presidents,\nthere shall be a second vote and if necessary a third. If the third vote still\nfails to produce a majority, candidates who have obtained an equal number\nof votes shall draw lots and the winner shall be elected.\nc) Voting shall be by show of hands unless a nominal vote is requested, except\nthat, in the election of the President and the Vice-Presidents or whenever re¬\nquested by three or more of the full members present, a secret ballot shall be\nemployed.\nd) In case of an urgent matter occurring during the interim between the sessions\nof the General Assembly and if such matter requires decision by the General\nAssembly, the President may take a vote by post or telegraph, which shall be\nsubject to ratification by the subsequent General Assembly.\ne) In the absence of any decision to the contrary, the deliberations by the General\nAssembly and all documents relative thereto shall be confidential.\nf) The details of the working procedure of the General Assembly other than those\nprovided for in these Statutes shall be decided from time to time at each ses¬\nsion.\nArticle 11: Access to the General Assembly\n1. Access to sessions and meetings of the General Assembly shall be limited to the\ndelegations and representatives of the members. The President may authorize or\n6"
}