{
  "id": "d207-99",
  "text": "invite any persons or representatives of any organization whose opinion is con¬\nsidered to be useful to participate in the General Assembly during the relevant\ndiscussions.\nArticle 12: Committees and Study Groups\n1. The General Assembly may set up Committees and/or Study Groups wherever\nnecessary.\n2. The competence and activities of such Committees and/or Study Groups shall be\nconfined to their terms of reference as assigned to them by the General Assembly\nat the time of appointment.\nArticle 13: Permanent Services\n1. The ABU shall establish and maintain a Secretariat as a permanent service at its\nheadquarters.\n2. The President shall appoint or dismiss the head of the Secretariat in consultation\nwith the Vice-Presidents and subject to the confirmation of the General Assembly.\n3. As the chief executive officer of the ABU, the head of the Secretariat shall be re¬\nsponsible for the administration and supervision of the permanent secretariat. He\nshall assist the President generally and shall, in particular:\na) carry out the administrative and secretarial work connected with meetings of\nthe General Assembly and afford necessary assistance to Committees and Study\nGroups;\nb) implement the decisions of the General Assembly;\nc) prepare the draft budget;\nd) collect and keep up-to-date materials and issue publications as deemed neces¬\nsary;\ne) assist the members in the exchange of programmes and in the training of broad¬\ncasting personnel;\nf) communicate with and maintain liaison with other organizations;\ng) administer and control the property and funds of the Union;\nh) engage or dismiss personnel of the Secretariat, subject to the approval of the\nPresident, and\ni) perform such other appropriate duties as directed by the President or a Vice-\nPresident nominated by the President.\nArticle 14: Financial Obligations of Members\n1. Every full member of the ABU shall pay a subscription for each fiscal year; like¬\nwise, every associate member shall make a contribution.\n2. Subscriptions:\na) The total amount of subscriptions payable by full members and the share to\nbe borne by each full member shall be fixed at the ordinary session of the\nGeneral Assembly.\n7"
}