{
  "id": "d1616-0",
  "text": "NEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. 29, NO. 4 APRIL, 1964\nETV Positions Open in Samoa\nAs the NAEB’s ETV project in Samoa moves toward realiza¬\ntion, more positions are opening for broadcasters and teachers.\nThese are all two-year appointments. Prospective applicants\nshould write to Vernon Bronson, 7400 S.W. 100th Street,\nKendall, Miami, Florida, 33156.\nThe following will be needed in June:\n1. Transmitter engineer to handle six transmitters for\neight hours in the evenings.\n2. Videotape men (2) to keep three machines in opera-\n_ tion.\n3. Projectionist.\n4. Cameramen (2) capable of doing own adjustment.\n5. Producer-directors (3) with in-school or ITV ex¬\nperience.\n6. Research teacher (1) and studio teachers (4), all\ncertified elementary teachers with TV experience.\n' In September, the following will be needed:\n7. Principals-TV supervisors (8). Must know utiliza¬\ntion and/or have experience.\n8. Top-grade teacher with M.A. or supervisory or utili¬\nzation experience.\nc\nOffer Summer 1964 R-TV Courses\n• Both graduate and undergraduate in both radio and TV—\nUniversities: Fordham, Georgia, Indiana, Kent State, Maine,\nMarquette, Michigan, Minnesota, New York, Ohio State,\nPennsylvania State, Southern California, State U. of New\nYork at Geneseo, and Wisconsin. Colleges: Eastern Washing¬\nton State, Emerson, Morehead State, Towson State, William\nand Mary.\n• Both graduate and undergraduate in TV only—Universi¬\nties : Arizona State, Bowling Green State, Chattanooga, Colo¬\nrado, Denver, Detroit, East Tennessee State, Eastern New\nMexico, John Carroll, Lehigh, Miami (Ohio), Northwestern,\nPacific, Purdue, Redlands, Rhode Island, Seton Hall, Toledo,\nUtah, Washington State. Colleges: Chico State, Colorado\nState, Orange State, San Diego State, Winthrop.\n• Both graduate and undergraduate in radio only—Colleges:\nBall State Teachers, Rhode Island.\n• Graduate only in both radio and TV—Universities: Boston,\nFlorida, Hofstra, Iowa, Kentucky, Massachusetts, Nebraska,\nNorth Carolina, West Virginia. Colleges: Appalachian State\nTeachers, Virginia State. Also Pacific School of Religion.\n• Graduate in TV—Universities: Arizona, Columbia, De-\nPauw, Eastern Michigan, Hawaii, Kansas, Missouri at Kan¬\nsas City, Notre Dame, Oregon State, Wayne State. Colleges:\nChapman, East Texas State, Murray.\n• Graduate in radio—Universities: Duquesne, Northwestern.\nColleges: Montclair State.\n• Undergraduate only in both radio and TV—Universities:\nIllinois State, Miami (Florida), Omaha Municipal, South¬\nwestern Louisiana. Colleges: Central Washington State, Fres¬\nno State, Grand Canyon, San Jose State, Weber State.\n• Undergraduate in TV—Universities: Loyola of Los An¬\ngeles, Texas Woman’s, Utah State, Washington, Western Il¬\nlinois. Colleges: Brooklyn, Los Angeles State, Montana State.\n• Undergraduate in radio—Universities: Bradley, Missouri\nat Kansas City. Colleges: Alice Lloyd, East Texas State,\nKansas State Teachers, Kearney State, Western Washington\nState.\nHistory & Archives Committee Seeks Home\nThe NAEB History and Archives Committee is preparing\nplans for the collecting and housing of historical data and\nmaterials related to the development of educational radio and\nTV in this country. Currently the committee is seeking an\nagency qualified and willing to assume the responsibility of\ngathering, evaluating, and preserving the material. There have\nbeen volunteers, but the committee will welcome others. Write\nto the committee chairman, Harold Engel, at WHA, Univer¬\nsity of Wisconsin, Madison.\nITV Conference Draws 200\nSome 200 persons attended the recent NAEB-University of\nMissouri conference on the improvement of teaching by TV.\nParticipants came to the national meeting at Columbia from\n30 states and 4 foreign countries.\nRepresentatives of the military services, prisons, busi¬\nness, and video engineering were among those outside the\nelementary-secondary and higher education fields who sat in\non the sessions. Participants viewed samples of telecourses,\ninspected University of Missouri ITV, and toured the new\nlearning center at Stephens College, in which there are facili¬\nties for group or individual viewing and listening for every\ntype of audio and visual learning resource material.\nA book covering the proceedings is in preparation and\nwill be on sale in the future.\nRadio Programs in Spanish Available\nStations interested in receiving, at a nominal sum, 20-minute\nprograms in Spanish about Spain should write to : G. L. Vaz¬\nquez, Jr., Educational Programs, Musica de Fondo Motiva-\ncional y Para Deleitar, Jose Antonio, 57, Madrid (13), Spain.\nTip for Owners of RCA TT-5A\nCharles L. Widney, executive secretary of the Columbus\nchapter of the Academy of TV Arts and Sciences, writes that\nthere are a number of new and used 8D21’s gathering dust at\ncommercial VHF stations that have converted to “air” from\nthe water-cooled 8D21. He says that interested ETV stations\nshould contact David I. Green, 3711 South Latawah Street,\nSpokane 36, Washington, to find out where these might be\nobtained.\n1"
}