{
  "id": "d1616-2",
  "text": "^ Hartford N. Gunn, Jr., general manager of WGBH, Bos¬\nton, was recently awarded a trophy by the New England\nChapter of the Public Relations Society of America. The an¬\nnual award is to “the citizen whose work has made the most\nbeneficial and lasting impact on the region.” Last year Bos¬\nton’s major was the recipient.\nSTATE AND REGIONAL\n^ Maine’s ETV network is well under way. WMEM-TV,\nPresque Isle, became operational February 17, joining WMEB-\nTV, Orono, which went on the air in October. Both stations\nare VHF, have effective radiated power outputs of 316,000\nvisual and 150,000 aural watts. The network’s third station, to\nbe in Calais, will be operational later this year. Production\nfacilities for the three stations are nearing completion in\nAlumni Hall at the University of Maine.\n^ Ohio’s ETV network offices have been moved to Room\n301, 21 West Broad Street, Columbus—a state-owned build¬\ning which houses several other agencies and commissions.\n^ The Delaware Governor’s Committee on ETV hopes to\nhave a state ETV network by September, 1965. A group of\n27 members of the state’s legislative assembly, plus other\nstate officials and educators, visited Columbia in January to\nstudy South Carolina’s closed-circuit network.\n^ Utah State University inaugurated KUSU-TV last month,\nto put Utah’s fourth ETV station on the air.\nGENERAL\n^ Gale Adkins, director of radio-TV research at the Univer¬\nsity of Kansas, has released a preliminary report on a survey\nof the FM audience in Lawrence, Kansas. One of his find¬\nings is that the educational station, KANU, is listened to\nmore than twice as much as its nearest competitor. There are\na dozen commercial FM stations which can be received in\nLawrence.\n^ The mayor of Pittsburgh proclaimed the month of February\n19 to March 19 WQED Month. During that time the station\nwas seeking $250,000 from local business and residents to help\nfinance its operations for the next year.\n^ Leonard Berkowitz, professor of psychology at the Univer¬\nsity of Wisconsin, wrote in Scientific American recently that\nfilmed violence is potentially dangerous. He said that his ex¬\nperiments indicate that aggression depicted in TV and motion\npicture dramas can arouse certain members of the audience\nto force or assault.\n^ Technical papers discussing the expanding roles of motion\npictures and TV in education will be presented April 13\nduring the 95th SMPTE conference April 12-17 in Los An¬\ngeles.\nThe University of Oklahoma will host, April 21-25, the\nfourth annual TV Newsfilm Workshop. Other sponsors are\nthe National Press Photographers Association, Field Enter¬\nprises Educational Corporation, and the U. S. Air Force.\nINSTRUCTION\n^ WGTE-TV, Toledo, reports that 1700 7th-graders are vol¬\nuntarily viewing French courses before school starts in the\nmorning. Interested volunteer teachers assist the students in\nclassroom exercises following the 15-minute telecourses.\n^ WFUV-FM, Fordham University, will soon carry a test\nprogram of the TuTorTape programed instruction in basic\neducation and vocational training. The hope is that this method\nof instruction will fight unemployment and give the dropout\nan opportunity to learn under a different technique than the\nclassic lecture study format, which he rejected once. WFUV-\nFM was selected for the test because of its years of testing\nwith FM multiplexing. Normal transmission of the station’s\nprograming will not be affected, since the instructional ma¬\nterial will be broadcast on four FM subcarrier channels.\n^ Cinderella was recently presented in Spanish by some 50\n2nd-graders of Lake Silver, Florida. The production was\nNAEB Headquarters: Suite 1119, 1346 Connecticut Avenue,\nN. W., Washington, D. C., 20036. Phone 667-6000. Area Code 202.\nstaged in conjunction with a beginning-Spanish TV program,\nand featured costumes, original music composed by a local\nteacher, and dance routines of a local choreographer.\n^ Oregon educational broadcasters hosted the second annual\nWest Coast ITV conference March 23 and 24 in Corvallis.\n^ The Tri-County ETV Council has announced a new plan, to\nbe initiated in September, which will provide four channels\nto transmit ETV courses for Chicago-area pupils. Leaders\nof the Chicago ETV Association and MPATI helped with\nthe plan. A daily schedule on CETA channels 11 and 20 and\nMPATI airborne channels 72 and 76 will bring 38 courses of\ninstruction to the schools.\nPROGRAMS\n^ KLRN-TV, southwest Texas, has a weekly program spot¬\nlighting local museums. One program featured the life and\ntimes of John Wesley Hardin, Texas desperado, using rare\nphotographs and items from the museum at Southwest Texas\nState College, San Marcos. Another program showed antique\ncars from a private museum at Geronomo, Texas. Deck Yoes\nproduces the Museum series.\n^ WQED, Pittsburgh, is presenting a 13-week TV course in\nreligious studies for the layman.\n^ A bulletin from WUNC-TV recently announced “An Al¬\ntogether Engaging and Uncommonly Entertaining Program of\nReadings of Poems and Essays by one of our most distin¬\nguished writers, Mr. Thad Stem, Jr., of Oxford . . . read\nwith a personal note or two by the author himself.” The 53-\nminute program was shown twice within two weeks—once to\nbe seen and once to be “savored.”\n^ Four radio programs on international arms control and dis¬\narmament have been developed by the University of Michigan\nbroadcasting service. Interviews with some of the world’s top\nexperts in the field were taped during a symposium at the\nuniversity, and have been scheduled for rebroadcast over 37\nMichigan stations, the English language service of the Voice\nof America, and other educational stations.\nPLACEMENT\nPERSONNEL AVAILABLE\n(For information, write Miss Julie Hunt, Placement Service,\nat the NAEB office in Washington.)\nApril I Engineer, BEE degree, 29, married, 2 children, is\nseeking position as engineer for new ETV station. Pres¬\nently employed. Wide range of engineering experience;\ncolor TV design and development, television mainte¬\nnance, construction supervision, electronics instructor,\nFCC 1st class license. Salary required $10,000, location\nopen.\nApril 2 Ph.D., male, age 40, married, wants executive posi¬\ntion as educational radio or TV station manager, or as\nbroadcasting service director. More than 25 years ex¬\nperience in commercial and educational radio-TV in\nproduction and administration, as well as college teach¬\ning and administration in broadcasting. Work anywhere\nexcept in South, South-Atlantic, Texas, or Florida. Mini¬\nmum salary: $12,000.\nApril 3 Married male, age 33, currently working on Ph.D. in\ncommunications, with emphasis in TV and education, is\nlooking for an institutionally-based ITV and/or ETV op¬\neration. July 1964 graduation will mark 13 years of\nteaching and professional broadcasting experience. Wants\nto produce televised educational programs and to teach\nin TV. Would prefer Midwest or West Coast progressive\ndepartment, with potential for advancement. Asking sal¬\nary of $8000.\nApril 4 Experienced international broadcaster-teacher is search¬\ning for imaginative post in university as director of\nbroadcasting services. Ph.D. late this summer; many ar¬\nticles; one book. Specialties: communications writing\nand_ international broadcasting (comparative systems).\nAge 41, presently teaching and on major station. Sal¬\nary: $10,000 level.\nAPRIL 1964\n3"
}