{
  "id": "d1906-2",
  "text": "< NAEB NEDS LETTER.... OCT. 15, 1940.... Page 3\n7JB0E* s net? frequency allocation is 42.5 megacycles end its power has\nbeen doubled to 1000 watts*\nWNYC ADOPTS QUIZ FORMAT\n\"Educational Quiz Shows\" will form an important part of the adult\neducational programs broadcast by T7NYC in conjunction with the Board\nof Education in New York City, it was announced’recently in the Radio\nDaily. The city-owned station will include broadcasts dealing with\nEnglish, current events, vocational guidance, and consumer education\nand will use the quiz technique in several cases to appeal to house¬\nwives who, it is stated, make up a large part of its audience.\n\"City High School 'Quiz,\" which Is on the air Fridays, 4:15-4:45 p.m„,\nbrings the \"city*s brightest high school youngsters\" to the microphone\nand \"Education Studies the News,\" Mondays, Is45-2 p.m., uses newspaper\nmen and commentators as guests. \"The High School Speaks,\" started\nOctober 10th as a forum on Current events.\n\"Helping the Student Find Himself,\" Tuesdays, l:45-2p.mf, will aid\njob-ecekers, while \"High School English Series,\" Wednesdays at the\nsame time, is being presented to aid adults.\nWSUI ADVENTURES IN STORYLAHP\nAdventures from the pages of the storybook,—stories of Kobi the Swiss\nboy, of Little Eagle the Navajo, or of Kongo the Elephant,—are\nbrought to the air over TSUI on the program Adventures in Storyland.\nAs the program comes to the air each Monday and Thursday afternoon at\n3:00, children in the elementary schools throughout Iowa gather to\nlisten to these selected stories. Adventures in StoryXand is planned\nespecially for the third, fourth, fifth, and sixth grades.\nThe stories chosen are from a list of books selected each year as the\nbest children* s books published and reooramended by the Iowa Pupil* s\nReading Circle. Adventures in Storyland is planned under the direction\nof Mr. Dwight K. Curtis of the University Elementary School, and the\nlist is compiled by Miss Mabel Snedaker, children*s reading specialist,\nand Mr. Curtis. The program is heard twice weekly,—'the Monday\nbroadcast being designed to appeal especially to third and fourth\ngraders while the Thursday presentation is for those In the fifth\nand sixth grades.\n3EE| EDUCATION BY RADIO\n\"The Monopoly Investigation\" and \"New Program Possibilities Created\nby Frequency Modulation\" are the subjects of articles appearing in\n\"Education by Radio,\" edited by S„ Howard Evans, executive secretary\nof the National Committee on Education by Radio. T7e commend them to\nyou.\nFALL PROGRAMS AT U3AJ\nH. TT. Harmon, Actinw Director of NfSAJ, Grove City College, says that\nhe has sent NAER members copies of the B3AJ fall semester programs.\nHarmon wtitess"
}