{
  "id": "d838-4",
  "text": "RBH-136\nMEMORANDUM\nTOi R.A.E.B. Gffioers and Directors\nFROM* Richard B» Hull, Preaidant\nIncorporation and 8 out hem Baptist 10-Watt Petition\nIncorporation —* There is & possibility we may get financing\nfrom a foundation* To officialise auoh a grant, it is necessary that N*A*E*B*\nbe duly Incorporated as a non-profit corporation in order that the contributor\nmay avail himself of tax-exemption by gifts to suoh a corporation. Since the\nUniversity of Illinois some years ago was designated as our official headquarters,\nW. I. Griffith asked Frank Schooley at TULL to investigate methods and cost of\nincorporating in Illinois* Cost is only |10.00. Legal processing can be fur¬\nnished without charge by University of Illinois lawyer. There Is'sorae reason\nfor haste if we secure monies within the 192# tax year, mil you vote and add\nany comment® you wish?\nAPPROVE _____ DISAPPROVE\n************\nB* Baptist lQ~73att Petition — A copy of FCC docket Ko. 97lp is\nattached reproeenting the joint petition of the Radio Commission of the Southern\nBaptist Convention and the Executive Board of the Baptist General Convention of\nTexas, and announcing oral argument for same. In essence they ask the FCC two\nthings *\n1. FCC grants of FM lew-power frequencies for non-commercial,\nreligious stations similar to educational low-power grants.\n2. FCC grants of such stations either in the 88-92 mo. educa¬\ntional band, or new rules allowing such grants elsewhere in\nthe FM spectrum. w.r\"\nAttached are copies of letter from Clifford Durr, former FVC Commissioner,\nand Everett Parker, DI roc tor, Protestant Radio Commission, which are self-\nexplanatory.\nThe situation is highly confusing because Leonard Marks of Cohn and Marks is the\nBaptist lawyer $ Whereas Marcus Cohn of the same firm is our attorney. This contra¬\ndiction ms discussed at our annual meeting end discussed with Cohn, who is willing,\nif necessary, to oppose his partner.\nAt that time, the group voted to oppose this informally with the FCC as we had\ndone previously. The issue, I am told, in the FCC's eyes, is the First Amendment\nand free speech* Privately, I understand, the Baptist petition may be rejected."
}