{
  "id": "d838-6",
  "text": "RBH #81\nRADIO DEPARTMENT\nof the\nBAPTIST SENEPAL COFTCTTIOR OF TEXAS\nBaptist Building Dallas 1, Texas\n11 February 1949\nMr. Richard 3. Hull\nPresident, fl.A.E.B.\nIowa Stete College\nAmes, Iowa\nDear Mr. Hull;\nI appreciate very much your letter of February 2 inviting me to write an\narticle for the H.A.E.35. newsletter. I am inclosing the article with this\nletter and hope it is satisfactory.\nIn the past, 1 have corresponded with your executive secretary Mr. Morris\nS„ Novik of Hew York, and in our correspondence I have told him of our\nwork. I tried to contact him when 1 was in Hew York City last December,\nbut was unable to do so.\nI do believe that our organizations have something in common with reference\nto PM broadcasting. In the first place, I believe that low power FM is the\nanswer to getting PM 82ts in the home. Our Texas Baptist Radio Department\nis sponsoring some nln■» or ten FM commercial station hex© In Texas., We\nnow have seven construction permits, with one of the seven on the air, XMHB,\nBelton, Texas. FM hers in the South has not developed as fast as it has in\nyour section or in the East. People do not have Hi sets to listen to the\nbroadcasts. Standard broadcasters have not helped FM by giving one-hundred\nper-cent duplication of their AM stations. Her© is where I believe low power\nPM comes in for the churches.\nIt was not my Idea to get low pcver PM transmitters? only for Baptist churches\nbut for all churches, ind our petition now before the PCC in Washington, or\nthat will be before them within the next week, so states t}ial it is for all\nchurches. I would certainly like for your organization tip have an under¬\nstanding of what we are trying to do, because we are asking that these low\npower PM sets be in the 88 to 92 megacycles, which Is the educational band.\nI cannot see where ther^ would be any conflict between colleges and schools\nworking together with churches sharing frequencies* In other words, the\nchurch will do most of their broadcasting during the week days. In this\nway they could share frequency, and certainly the time could \"be worked out\nto a mutual understanding and to the benefit of both. 1 do not believe there\nis any organization that can get more FM sets in the homes in a city than\nthe churches can."
}