{
  "id": "d1818-1",
  "text": "NAEB MEWS LETTER\nPage 2\nJULY I, 1943\n“Beyond Victory - What?“, designed to help build a well informed public\nOPINION ON POSTWAR PROBLEMS, WILL BE PRESENTED EACH WEEK BY \"NYC COOPERAT¬\nING with the World Wide Broadcasting Foundation of Boston, and the Carnegie\nEndowment for International Peace0 It will be heard over more than 100\nlocal stations in all parts of the United States and by listeners overseas\nover Boston's short wave station WRUL„ It is available to NAEB members.\nTHE CURSE OF RADIO\nThe worst thing about the radio is not the soap opera and syrupy radio\nserial, nor the crime-busting doctors, nor the sponsorship of the Lone\nSentinel by the Makers of Crackies. No, the worse thing about the radio\nis that it isa “mindfiller“ with tr*sh as much of its product.\nBy “mind-?iller”, I MEAN something that suggests thoughts to the mind.\nAll kincs of things suggest thoughts to the observer such as one's daily\nemployment or the normal events of life or what one reads or what one\nhears.\nThe right to suggest thoughts in people's minds is an exceedingly precious\none, and something that can lead to great human disasters as well as to\ngreat human good. The radio, beyond any other medium, has become the most\nIMPORTANT MIND-FILLER THERE IS BY VIRTUE OF THE FACT THAT IT CAN SUGGEST\nTHE SAME THOUGHT TO MILLIONS U»ON MILLIONS OF PEOPLE AT ONCE.\nIt CAN DRIVE HUMANITY OVER THE BRINK, AS IT HAS DONE IN THE CASE OF GERMANY.\nBy means of the hypnotic spell of der Fuehrer's guttural voice millions of\nproud Germans have marched upon their neighbors and reduced themselves to\nTHE LEVEL OF A NATION OF DIABOLICAL LUNATICS.\nMind-fillers are not necessapily bad; for example, the sight of a house\nBURNING CAN MOTIVATE PEOPLE TO SAVE THE HOUSE. The RADIO, HOWEVER, IS A\nMIND-FILLER, WHICH FILLS PEOPLE'S MINOS MOST OF THE TIME, WITH FALSE\nSITUATIONS, ALLOWING THEM NO CONSTRUCTIVE THINKING AS FAR AS THEIR OWN\nPERSONAL EXISTENCE, THEIR OWN IMPROVEMENT, AND THEIR OWN PROTECTION IS\nCONCERNED.\nThe RADIO SAVES TOO MANY PEOPLE FROM THE PAIN OF ORIGINAL THOUGHT; IT FILLS\nTHE LIVES OF TOO MANY PEI SONS WITH THOUGHTS ABOUT UNREAL EVENTS AND THINGS\nOF GREATLY EXAGGERATED IMPORTANCE AS FAR AS SOCIETY IS CONCERNED.\nBetter far that most people throw their radios out of the window and learn\nANE”‘ THE JOY OF THINKING THEIR OWN THOUGHTS, THAN THAT THEY SHOULD CONTINUE\nTO FILL UP ON THE SERIAL, “HrR VAGABOND HUSBAND*', OR THE MUSIC OF DOPEY\nDorsett's Jive Hounds. -Patrick J. Brummbaer in THE MILWAUKEE TURNER\nWNYC SURVIVES BATTLE\nWNYC, Municipal station in Ne*- York, survived a stormy City Council session\nwhich overrode Mayor LaGuardia's veto of most of the cuts in the city\nBUDGET. After the smoke had subsided from the battle-royal-and-name-call-\ning Council meeting, the controversial $106,000 item for maintenance of the\nstation remained in the budget. The Mayor was sustained on several other\nITEMS, PARTICULARLY THOSE OF EDUCATIONAL AND PUBLIC HEALTH NATURE."
}