{
  "id": "d1818-2",
  "text": "NAEB NEWS LETTER\nPage 3\nJuly !, 1943\nChange of heart on part of Councilors who voted to sustain the Mayor in his\nSTAND ON THE ST TI ON IS ATTRIBUTED MATERIALLY, TO SUPPORT GIVEN TO THE\nSTATION BY LOCAL NEWSPAPER EDITORIALS AND. STORIES POINTING UP THE STATION'S\nCOMMUNITY SEfVICESo THE STATION, HOWEVER, WITHIN THE PAST WEEK OR T'fO,\nHAD OCCASION TO RENDER COMMUNITY SERVICE ON TWO IMPORTANT FRONTS—RECRUIT¬\nING BLOOD DONORS FOR THE RED CROSS AND AIDING DURING THE MILK STRIKE*\nNewspapers played up these activities.\nThe STATION NOW FACES A MANPOWER PROBLEM. It HAS TWO VACANCIES ON ITS\nANNOUNCING AND PRODUCTION STAFFS, BUT INASMUCH AS THE SALARIES, $2400 AND\n$2600 ARE HIGHER THAN THE STATION HAS BEEN ABLE TO OFFER IN THE PAST,\nMorris Ncvik, director has a bit more hope in being able to obtain announ¬\ncers WITH INTEREST IN MUSIC AND IN GENERAL PROGRAMMING. MUSICAL PROGRAMS,\nPARTICULARLY RECORDED OPERAS AND SYMPHONIES HAVE ALWAYS HAD A PROMINENT\nPLACE IN THE STATION'S SCHEDULE.\nDuring the Council's discussion of the WNYC item in the budget, the Mayor\nCAME IN FOR PERSONAL ATTACK. AFTER HOLDING THAT THE ALLOTMENT WAS IN THE\nBUDGET ILLEGALLY, ONE OF THE COUNCILMAN DESCRIBED THE MAYOR WHO USES THE\nSTATION FREQUENTLY, AND HAS A REGULARLY SCHEDULED TALK ON SUNDAYS, AS A\n\"DISAPPOINTED GENERAL\" WHO IN HIS \"BEDTIME STORY PROGRAM IS FUNNIER THAN\nTHE COMICS.\" He CHARGED THAT THE MAYOR ON THIS PROGRAM, \"PLAYS V'AR\nCORRESPONDENT, NEWS COMMENTATOR, CRITIC OF FEDERAL AGENCIES AND MANY OTHER\nROLES IN DISCUSSING 40 SUBJECTS IN A HALF HOUR. -RADIO DaILY\ni\nDOTS AND DASHES\nWhat did you contribute to ihe current NAEB NEWS LETTER?...... Broadcasters\non the WHA Wisconsin School of the Air programs, including \"Afield with\nRanger Mac,\" judged the best educational radio program ini the country,\nRECEIVE NO PAY Fr-OM THE SCHOOL OF THE AI R..... BuRTON PaULU, WLB, MINNESOTA,\nIS LISTED ON THE TEACHING FACULTY OF NYU's SUMMER RADIO WORKSHOP.WHA,\nWSUI AND WILL HAVE RECENTLY PRINTED SUMMER PROGRAM SCHEDULES..."
}