{
  "id": "d1664-12",
  "text": "EDUCATIONAL NEWS BULLETIN\nA DECALOG OF SUCCESS IN CLASSROOM\nUSE OF RADIO\nBy\nB. H. Dajuiow\nDirector, Ohio School of the Air\nRadio, like automobiles, has become such a definite part of our ex¬\nperience that most of us feel ill at ease when we do not have constant\naccess to it. We listen not only in our homes but in all manner of\nplaces of business, factories, and even as we ride in trains, buses, air¬\nplanes and automobiles. It is an accepted part of our daily life. We\nare keeping more closely in touch with the world’s happenings than\never before. The rank and file of our people are learning to recognize\nmusic and drama that were hitherto the property of a comparatively\nfew.\nAnd the end is not yet. Even before television comes there is to be\nan increased use of radio. When television arrives it will indeed be\npitiful if our day by day education of ourselves shall not be speeded\nup to the extent that the automobile has improved travel over the horse\nand buggy period.\nBefore mentioning the measures which must be taken to make a\nsuccess of the classroom use of radio, let me point out a major change\nwhich must take place in American broadcasting. More attention must\nbe given to those people who want to be educated as well as entertained.\nSince most of them will be working in the daytime, those evening hours\nwhich are now dedicated almost exclusively to entertainment must give\nway. There must be some periods for those who want the educational\nprograms to be of a more formal nature than the educational broadcasts\nnow available in the evening.\nWe must provide definite review courses in history, geography and\nlanguage for those who do not understand college terminology. In fact\nthe one series should be for those who can not “read readin’ or read\nwritin but who can hear hearin’.” Every one of them can appreciate\nthe fascinating history of this new nation on the new continent. They\ncan all get its geography, even if their only maps are road maps; they\ncan all use their teaching of English because it may give to him not\n-10-"
}