{
  "id": "d1664-15",
  "text": "WESTERN STATE TEACHERS COLLEGE\nSOME RADIO NUBBINS FROM THE STATE WHERE\nTHE TALL CORN GROWS\nBy\nW. I. Griffith\nDirector, Radio Station WOI, Iowa State College, Ames, Iowa\nWe believe that Radio has now passed the experimental stage and\nthat it has advanced to the stage of being recognized as an important\nagency of education.\nWe believe that Radio has a very great influence on the listener.\nWhether the influence is beneficial or detrimental will depend almost\nentirely upon the content of the material and manner of broadcasting.\nWe are more familiar with the wishes of the WOI Radio audience\nthan with any other groups. Judging by their response we believe that\nthey are interested in educational material that really offers some in¬\nstruction, and in high class entertainment numbers, worthy of being\nbroadcast by a college station, that really adds to the sum total of the\nlisteners’ culture and appreciation of the most worth while things in\nlife.\nFor several years WOI has broadcast a morning program known\nas a Matins period. At seven o’clock in the morning a hymn is used,\nfollowed by the reading of a Psalm or other passage of scripture, with¬\nout comment. A member of the college faculty or a local clergyman\nthen gives a five minute discussion on some worthwhile thought for\nthe day, and the period is then closed by the use of another hymn. The\nsame speaker usually uses the time throughout one week, which gives\nabout thirty minutes for the development of six thoughts which are\nusually related. Mimeographed copies of the six short addresses are\noffered to listeners. The number of requests usually varies from one\nhundred to three thousand. A permanent mailing list is not main¬\ntained for the reason that the men and women responsible for the\npreparation and broadcasting of the material, do so without other re¬\nward than that of reading the cards and letters of appreciation. No\nclaim is made that these series of semi-religious broadcasts are of in¬\nterest to all listeners within our broadcast range, but the claim is made\nthat a very high per cent of the sober, substantial, bread-and-butter\ntype of citizen is very much interested, and feels that we are render¬\ning a service that is satisfactory to him, and that his day is not\nstarted quite right if for some reason he is unable to tune in.\n11"
}