{
  "id": "d1664-17",
  "text": "WESTERN STATE TEACHERS COLLEGE\nEDUCATIONAL BROADCASTING\nJudith Waller\nEducational Director, Central Division National Broadcasting Company\nThe use of radio in the school room is a moot subject, while a num¬\nber of series have been worked out and broadcast for classroom use,\ntheir educational value is doubtful. There are few, if any, very good\nschool broadcasts on the air today anywhere in the United States. There\nare a number of experiments being made and there are programs that\nmost of us have heard of; for instance, the Ohio School of the Air;\nthe Cleveland experiment, the Wisconsin School of the Air; the school\nof the air which we have been running in Chicago; the Standard\nbroadcasts on the Pacific Coast; the experiment in Rochester, and a\nnumber of others—not counting the network broadcasts for the schools,\nthe Damrosch hour, and the American School of the Air. Frankly,\nwith a very few exceptions, I do not consider these schools of the air\nsuccessful in the same way I consider, shall we say, “One Man’s Fam¬\nily’ or “Amos ’n Andy” successful programs.\nThe very nature of radio is such that it must vitalize a speaker and\nhis subject matter to hold the attention of the listener. On a platform\na speaker even though he or she has not much personality can hold the\naudience in front of him. But over the radio a negative personality\ncannot expect to attract to say nothing of hold the attention of either\nan adult or child audience. I am convinced that a speaker to be suc¬\ncessful over the radio must be sincere, convincing and able to project\na vivid personality that stimulates his audience to some form of activity.\nThere are too few such speakers available and, therefore, straight\nspeeches over the radio are, in the majority of instances, not successful\nor wanted by the listening public. So other ways must be found of\ngetting the message across. This can be done through changes in voice\nto lift the monotony of an uninteresting speaker, round tables, dramati¬\nzations, questions and answers, etc. The simpler and the more informal\nthe programs are, the better. I do not consider broadcasts by children\nto be of value or of interest to any but the relatives and teachers of\nthe children broadcasting.\nDown at Columbus, Ohio in May at the Ohio Institute for Radio\nEducation, a number of the various schools of the air presented records\nof their programs for criticism, and were incensed when they were told\nthat the programs were negative in attention-getting or in value. They\ncontended that thousands of school children listened to and enjoyed\nthem every week, not realizing, or at least, not acknowledging that the\n- 17-"
}