{
  "id": "d1664-22",
  "text": " .THE .EDUCATIONAL NEWS BULLETIN\nPROFESSIONAL NEWS ACTIVITY\nDr. James O. Knauss, of the Social Science Department, has been\nkeeping people in Kalamazoo informed about the Italo-Ethopian affair\nthis fall. On September 16 he addressed the Exchange Club; on Sep¬\ntember 19 he addressed the Comstock High School; on September 24\nhe gave talks before the Hi-Y club of Central High School and be¬\nfore the Y. M. C. A.; on October 2, Dr. Knauss also addressed the\nKalamazoo Kiwanians.\nMr. Carroll P. Lahman, Men’s Debate Coach, spoke on “How\nthe Subject Matter of Speech and English courses Can Contribute\nMost to the Citizens of Tomorrow” at the Michigan Educational Asso¬\nciation meeting in Battle Creek, October 10, 11.\nMr. E. D. Pennell, of the Department of Commerce, has just com¬\npleted a study of the physical organization of the commercial depart¬\nments in the North Central public high schools of Michigan. The sur¬\nvey was made in collaboration with the Division of Secondary and\nVocational Education of the State Department of Public Instruction.\nThe report of the findings will be published this fall.\nMr. James W. Boynton, of the Chemistry Department, addressed\nthe Rotary Club of Vicksburg October 11, on “The Effectiveness of\nWar Gases”. Mr. Boynton attended the Michigan Conference of\nJunior Colleges, Physical Science Section, in Grand Rapids, October 25.\nMiss Myrtle Windsor, and Miss Ada Hoebeke, of the Language\nDepartment, attended summer school at the University of Michigan.\nMiss Ruth Van Horn, of the English Department, attended sum¬\nmer school at Columbia University. Miss Van Horn has recently had\ntwo poems published: “Give me the Silver Pavement” in Bozart-West-\nminster, and “On Hearing Ravel’s Le Gibet” in Bard.\nMr. Charles Starring, of the Social Science Department, attended\nthe first term of the summer session of the University of Chicago, and\nthen took an extended motor trip through the west as far as the Pacific\ncoast.\nDr. Edna Lotz, of the Special Education Department, and Mr.\nHomer L. J. Carter, of the Research Department, attended the meet¬\ning of the American Psychological Association in Ann Arbor, September\n4, 5, 6. On Thursday, October 10, Mr. Carter discussed “The New\nType Examination, Its Advantages and Disadvantages” in Battle Creek\nat the meeting of the Michigan Educational Association. Mr. Carter\n-22-"
}