{
  "id": "d1664-26",
  "text": "THE EDUCATIONAL NEWS BULLETIN\nGLEANED FROM THE MAGAZINE RACK\nAre you a graduate of an “eminent” university? See if your alma\nmater is mentioned in the article in the June Atlantic by Edwin R.\nEmbree. This appraisal of American Universities appears under the\ntitle “In Order of Their Eminence”.\nAre you weary of hearing about “transfer of training”? Even if\nyou are, the expression “Pseudo-Science” might possibly intrigue you\nor even irritate you. Turn back to the May number of The Mathe¬\nmatics Teacher for a scholarly, well-written article on “Transfer of\nTraining and Educational Pseudo-Science” by Pedro T. Orata.\nShall the teacher swear or not swear? No, we are not talking\nabout profanity. Over one-third of the states have recently enacted laws\nrequiring teachers to take an oath of allegiance. A good history of this\npresent day “educational movement”, with arguments pro and con, is\nfound in the June number of School Life. It is written by Ward W.\nKeesecker.\nWould you like to teach in a more attractive environment? If you\nare not satisfied with the square, dingy, uncarpeted, hard-seated place\nyou call your class-room, you should derive some comfort and perhaps\nsome practical suggestions for improvement from reading Charles E.\nPackard’s article, “Beauty in the Classroom” in the Journal of Educa¬\ntion for July 17th.\nSh-sh-sh. Let us just whisper the information that there is an ac¬\ncurate, scientific article on sex education in Parent's Magazine for\nAugust. Written by Francis Bradshaw, it is entitled “Sex Problems\nin the Teens”.\nEducational innocents who have not yet learned the “facts of life”,\nwill be startled and perhaps shocked by a reading of “We Buy New\nStudents”, written by Thomas M. Johnson, a former college publicity\ndirector, for the Reader s Digest, September number. Such terms as\n“hornswoggling”, “shanghaiing”, “go-getter”, “high-pressure”, “gyp\nstudents”, and “docking salaries” are somewhat unusual for an article\non an educational topic, but add tremendously to reading interest.\n“The flounderings of psychology, and the bickerings of psychologists,\ndamage its prestige. *** A science that can endure the ravages of two\n-26-"
}