{
  "id": "d1664-3",
  "text": "the educational news bulletin\ntime to articulate appreciation of and constructive suggestions for the\nbest the radio has to offer.\nSecond, some faculty members apparently question if there is any\nplace for the local radio station except for local advertising and chain\nprograms. They will grant that there is a place for local newspapers,\nbut they fail to grant similar justification for the local broadcasting\nstation. Emphasis is necessary to get them to prepare their radio pro¬\ngrams in terms of the needs and interests of Southwestern Michigan\nwhich is largely rural. A “listening audience consciousness” must be\ndeveloped. I am one who believes firmly that publicly owned and con¬\ntrolled institutions of higher learning have an obligation just as surely\nto their service area as to campus students. As elementary and high\nschool teachers are expected to learn the techniques of visual and\nhealth education, so should college teachers master new techniques of\npresenting their subject matter.\nThe third difficulty encountered is in assuring the faculty perform¬\ners that any one is listening. It is difficult to put any personality into,\na talk when one cannot envision listeners; particularly is it difficult to\nmaintain an easy conversational style even when one is participating in\na roundtable. To help secure an audience, each six or twelve week\nbroadcasting period 5,000 printed programs were mailed or otherwise\ndistributed among our potential listeners, in addition to the weekly\nannouncements carried in the “Teachers College Herald.” A number\nof postcards and letters of commendation and requests for copies of\ntalks have been received chiefly from our “listening area” within a\nradius of 100 miles of Kalamazoo. During the past year approxi¬\nmately 1,000 were sent out.\nFourth, one justification of local broadcasting is the personal ac¬\nquaintance or knowledge of the speaker held by many of the listeners.\nAny publicity value accruing to the College must come from the high\nquality of the program using faculty members personally known to many\nof the listeners. And so we have been very anxious that the voices of\nour people seem as natural as possible. Any one at all familiar wit\nbroadcasting knows that such entails auditions. Failure of wives at\nhome to recognize the voices of their own husbands has encouraged\nauditions. ,\nAnd what for the future? Are we interested in the possibilities of\nbroadcasting for the schools in our area, and especially those small\nschools whose curricula most need enrichment?\n- 2 -"
}