{
  "id": "d1664-30",
  "text": "THE EDUCATIONAL NEWS BULLETIN\nNEW BOOKS\nPoems of Gerard Manley Hopkins, edited with notes by Robert\nBridges. Second edition. 4th printing, 1935. Oxford University\nPress. Critical introduction by Charles Williams. 159 pp. and ap¬\npendix of additional poems. $3.00.\nAlthough the Jesuit priest, Gerard Hopkins, wrote in the 70’s and 80’s, he\nwas first published in 1918, by Robert Bridges. MacLeish prophesies Hopkins\nwill be the father of a poetic generation; Van Doren likens him, at his best,\nto Herbert, Wordsworth, and Milton. Many of the poems are flawed by his\nexperimentation in rhythmics, but his masterly handling of technique is mostly\nadmirable and beautiful. Moreover, Hopkins has something to say.\nPublic Administration, by John M. Pfeffner. The Ronold Press,\n1935. pp. xii, 525.\nIf it be true that the ability of the administrator is often unequal to the\nproblems of administration, a volume such as this should be welcomed by\nfriends of good government.\nThe book is divided into five parts and twenty-four chapters. The parts\nare organization, personnel, financial administration, adminstrative law, and\npublic relations.\nThe United States has not followed European countries in demanding\ntrained administrative officials. However, the increased scope of governmental\nactivities—some very technical—has increased the demand for trained ad¬\nministrators in the various units of our government.\nPresent and future administrative officials will find this book very helpful.\nA Dynamic Theory of Personality, by Kurt Lewin. Translated by\nDonald K. Adams and Karl E. Janer. McGraw-Hill Book Company,\nInc., 1935. pp. ix, 286.\nFor those looking for a scientific explanation of the dynamic personality\nthis book will prove to be stimulating and perhaps convincing. The eight\nchapters, which are a collection of originally independent articles, are vivid\npresentations of the dynamic point of view in psychology.\nThe most interesting chapters to this reader were the ones dealing with\nthe structure of the mind, environment forces in child behavior and develop¬\nment, the psychological situations of reward and punishment, education for\nreality, and a dynamic theory of the feeble-minded.\nThe book, though difficult to read in certain parts, is interesting to the\nstudent of modern psychology. The translation merits commendation.\nThe Foundations of Human Nature, by John M. Dorsey, M. D.\nLongmans, Green and Co., N. Y., 1935. pp. xiii plus 488.\n-30-"
}