{
  "id": "d1664-31",
  "text": "WESTERN STATE TEACHERS COLLEGE\nThis is a book on mental hygiene, written from the point of view of the\nmodern dynamic theory of personality. Of special interest to teachers are the\nchapters on “Pedagogical Treatment” and “What to Educate For.” Any one\ninterested in the question of personality development will find this work of\npractical value.\nModern Public Education; its Philosophy and Background, by Isaac\nDoughton, Head of the Department of Education, State Teachers Col¬\nlege, Mansfield, Pennsylvania. D. Appleton-Century Company, 1935.\npp. xx, 729.\nThis book is an attempt to integrate the history and philosophy of educa¬\ntion into one treatment, with the major emphasis upon the philosophy of edu¬\ncation, and even more particularly upon the philosophy of contemporary public\neducation in a democracy. Instead of being an impartial presentation of all\nthe current philosophies, this book is frankly intended as a justification of the\nchild-centered philosophy. Written from the point of view of the “New Educa¬\ntion”, it naturally puts most emphasis upon John Dewey’s contributions to edu¬\ncational thought. The book fails to give adequate treatment to such current\nconceptions of education as those of the nationalists, the traditionalists, and the\nessentialists, but it does provide an excellent basis for an understanding of the\nphilosophy of that group of educators who are dominant in American educa¬\ntional leadership today, the so-called progressives or experimentalists.\nThe Social Ideas of American Educators, by Merle Curti, Professor\nof History, Smith College. Charles Scribner’s Sons, 1935. pp. xxii, 613.\nThis, the tenth volume of the Report of the American Historical Associa¬\ntion on the Social Studies in the Schools, presents an authentic analysis of the\nsocial ideas of leaders in American education from colonial times down to the\npresent. This careful study of the social thinking of American educators should\nprove interesting and valuable, not only to those immediately concerned with\nthe social studies, but also to that growing body of teachers and citizens who\nare engaging in the study of the general development of educational theory.\nThe chapters on Horace Mann, the Social Reformer, William T. Harris, the\nConservator, Francis W. Parker, the Democrat, G. Stanley Hall, the Evolutionist,\nWilliam James, the Individualist, Edward T. Thorndike, the Scientist, and\nJohn Dewey, the Experimentalist, are especially stimulating and very much\nworth reading.\n- 31 -"
}