{
  "id": "d530-127",
  "text": "REPORT TO THE FUND FOR ADULT EDUCATION\nfrom the\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nI. GENERAL SUMMARY STATEMENT AND BACKGROUND\nAs one of the oldest professional organizations in America, started in 1925 >\nthe NAEB existed for many years as an organization in which the representatives\nof some twenty or thirty institutions owning and operating college stations met\nmore or less informally together once or twice a year, whenever conferences of\nlarger or more important groups saw them assembled. It was not a particularly\nstrong or confident group since in virtually every bout in which real (usually\ncommercial) competition was encountered, educational broadcasting had come out\nsecond best. The number of educational stations had already been virtually\ndecimated, being reduced from over 200 to some 30 between the early 1920*s and\nthe early 194G*s.\nMost members of the small organization realized that this situation was due\nlargely to lack of genuine organization, lack of adequate budgets, lack of status\nwithin their own organizations (which frequently meant lack of respect for the\nmedium of radio, which was thought of and too often characterized by the sales¬\nman and the nshowman” approach), and lack of representation at the national and\nhigher educational levels.\n*\nThe possibility of opening up new space in the spectrum, as FM was being\nconsidered, along with the above conditions, led to increasingly serious dis¬\ncussions of a recognized and reserved place in the American educational picture,\nand specifically in the wireless spectrum, for educational broadcasting. This,\nit was thought, would prevent a repetition of the earlier decimation in which\neducation, in many areas and respects the pioneer in radio in America, lost some\nof the finest station channels in the United States to commercial broadcasters,\nand almost completely lost out in competition for clear channels which have\nlater proved to be worth millions."
}