{
  "id": "d530-129",
  "text": "3.\nThe limits of this sort of operation were soon reached. However, a start\nhad been made. A trial effort had proved the validity of the idea, which had\nbeen heretofore untested. Further meetings were held to refine the plan, which\nwas developing, of what the NAEB and its member stations could do if adequate\nfinancing and a central office were available.\nOut of these meetings came a five-year plan of routine procedures, plus the\nideas also for special projects. During this period according to this plan, an\neducational network would be launched, a central office for the Association would\nbe established, and professional, service and research activities would be\ninaugurated which would put educational broadcasting on its feet and on the map.\nThe first part of this plan (funds for Headquarters and Network office and\noperation) found realization in the W. K. Kellogg Foundation grant of 1951> to\nrun through June of 1956. Grants for the special projects visualized were\nreceived from the Ford Foundation and, later, the FAE.\nAt this stage it can safely be stated that more has been accomplished in\nthe first three-year period of these grants than even the most ambitious and\nvisionary NAEB Board members or consultants expected. Although accomplishments\nwere far above those anticipated, the size and complexity of the tasks and prob¬\nlems which continued to develop and emerge were even more so, for wireless\ncommunications turned out to be one of the fastest-changing and fastest-develop¬\ning fields in the world. However, in one respect: the ability of stations to\nsupport their own association financially (as was visualized in a schedule of\nfazing out Kellogg Foundation support for both Network and Headquarters operation,\nso that both were self-supporting or nearly so by 1956) a sobering discovery was\nmade.\nThe financial resources and qualifications of those schools which became FM\nlicensees as the new spectrum space opened up were not of the same order as those\nof the earlier stations, which had been used as the basis of the projection which"
}