{
  "id": "d530-137",
  "text": "11\nPeople Under Communism, less widely promoted, has also recently begun to\nmeet with wider distribution and greater understanding during the past year.\nAll in all, these series as an example, followed by Grants-in-aid to help\ndevelop local abilities to produce high-quality programs, are believed by us\nto have provided an impact on the communications structure in America which\nshould indeed be gratifying to both the FAE and the Ford Foundation. The\nNAEB is proud of the role it has been privileged to have in this effort.\nB. Newsletter, and Publications Exchange\nDuring this year, as always in the past, the number of pressures from\nday to day deadlines and other sources on the Executive Director (and later\nalso on the Associate Director) have been such that the Newsletter has not\nreceived the maximum or optimum attention it deserves. Nevertheless it is\nbelieved that it has been considerably improved. It now contains regular\nfeatures from NAEB Fulbright Scholars abroad, and is generally improved in\nboth its international and local values (Exhibits 1 and 2). In view of the\ninternational background and interests of the present Executive Director, as\nmentioned earlier, regular free exchanges of publications have been instituted\nwith most of the nations in Western Europe, as well as Australia, and certain\nEastern nations, such as Japan. In a recent Journal of the Italian Radio Sys¬\ntem, distributed in Italian, worldwide, three out of the first five lead quo¬\ntations were from the NAEB Newsletter. The flow of materials in French, Italian,\nGerman, and Japanese, plus those from Australia, Canada, and Britain are in¬\ncreasingly informative and friendly illustrations of one of the little-known\nfacets of NAEB Headquarters activity.\nThe use of NAEB materials (manuals, reports, scripts, recordings) around\nthe world is beginning to grow, and is being encouraged in spite of the prob¬\nlems of language, customs and duties, and other hazards. We treasure especially\nhighly the thank-you notes reaching us from Pakistan, Egypt and other areas in"
}