{
  "id": "d530-140",
  "text": "lit,\nPrix Italia Jury for entries in the musical category, is Mr, Henry Leff,\nDirector of Radio and Television at the City College of San Francisco, who is\nalso studying in Europe during the next year and representing the NAEB.\nDuring the past year, also, NAEB President Graydon Ausmus, thanks to funds\nfrom a separate ETRC-FAE grant, represented the NAEB and the U, S. at the In¬\nternational Conference of Music Education for Youth and Adults, in Brussels,\nBelgium. While in the European area, he also spent one week at the BBC, and\nin conferences with representatives of the French and other broadcasting organi¬\nzations at a time when various conferences brought various key broadcasting\npeople together. A brief report on his visit, as well as that of Mr. Siegel\nand letters from abroad by our Fulbright Scholars, have been carried in various\nNAEB Newsletters, where further details can be found.\nSuffice it to say here that all the above trips were richly rewarding in\nthe contacts, understandings and exchanges established. The NAEB is now looked\nto as representative of American radio and television in the International Uni¬\nversity of the Air organization, which it has officially Joined, and in the\nnumerous other organizations and relationships developing in both Radio and\nTelevision in a shrinking world.\nIn addition to the above foreign representation, the NAEB was represented\nas often as possible at dedications, conferences, workshops and other similar\nfunctions in the United States. The NAEB President visited new television sta¬\ntions, and/or assisted in their dedications, at Los Angeles, Houston and other\nlocations, as well as making well over a score of public appearances at various\nconferences. The NAEB was represented by its Treasurer, Mr. Frank Schooley,\nat the dedication of Station WQED-TV in Pittsburgh. The Executive Director,\nfollowing a whirlwind study-tour, on an FAE study grant, to visit over 30 key\nNAEB members in all six Regions, also represented the NAEB at various tele¬\nvision station dedications. University President inaugurations, meetings of"
}