{
  "id": "d530-143",
  "text": "17.\nThese thousands of hours of programs have been distributed to 81 member\nstations. Last year Network membership reached 85 stations, but when the assess¬\nment fee was increased in the steps prescribed for leaking the NAEB as nearly\nself-supporting as possible, during the five-year period of the Kellogg Founda¬\ntion Grant scheduled to end in 1956, the number of stations dropped to 78.\nSince that time the number of Network stations has slowly increased to the\npresent membership of 81, as more educational stations have gone on the air.\nAccording to the recently completed study of the NAEB Research Committee, the\nNAEB now has a potential radio audience of eighty million; half the population\nof the United States, plus parts of Mexico and Canada, for its program services.\nThe television audience has not yet been accurately tabulated.\nIn 1952 the NAEB was distributing 6 hours and 1;5 minutes of programming\nper week to 65 stations. It is now servicing 81 stations with 7 hours and 15\nminutes weekly, not including a heavy load of in-school programs. This means\nthat approximately 1,000 tapes per week are sent out from NAEB Network Head¬\nquarters. In peak periods during the past year, in fact, over 1,200 tapes a\nweek were sometimes mailed.\nThe sources of Network programs are increasingly becoming our own member\nstations. However, a great many program series have been contributed by such\nagencies as the American Foundation for the Blind, UNESCO, The American Society\nof Friends, the Cooper Union Forum, and the Air Training Command, Some programs\nfrom the British Broadcasting Corporation have been distributed to NAEB sta¬\ntions, and Network Headquarters has been the traffic office, arranging for the\ndistribution of many other BBC programs directly to member stations. One series\nfrom Radio—Italians and ten series from the French Broadcasting System were\nalso broadcast by NAEB stations during 1953-5U. The use by the French Broad¬\ncasting System of Jeffersonian Heritage has already been referred to (page 8)."
}