{
  "id": "d530-145",
  "text": "19,\n1. ASSOCIATE MEMBERS COMMITTEE: This year, as in the past, NAEB associ¬\nate members have asked to be included in the program service of the NAEB Net¬\nwork, The principal hindrance to this is the problem of rights and legal re¬\nstrictions. However, steps have been initiated to determine the number and\nneed of associate members for program service. If the requests warrant it,\nsome means will be found to supply the want. (See attached letter to Richard\nBell, dated April 19, 19%h, Exhibit 8). The radio solution to this problem\nis likely to be of interest to the ETRC in its relations with commercial TV sta¬\ntions in the numerous areas where educational stations are not available or in\nsome cases are not yet'even planned,\nA second request from this committee is that the associate members have\nthe right to vote in the affairs of the Association. Voting privileges have\nso far been* restricted to active members, i.e. representatives of actual sta¬\ntions with transmitter facilities. All reports are now in to the Constitution\nCommittee on this request, and this problem will be voted on at or before the\nOctober, 19%h, New York Convention.\n2. CONSTITUTION COMMITTEE: This committee has spent a great deal of time\non a re-evaluation and study of the NAEB Constitution. They have formulated\nchanges in the Constitution which clear up ambiguities and make revisions in\nsuch matters as dues, voting privileges and procedures, the qualifications\nof the national officers, standards of accreditation of prospective NAEB mem¬\nbers, etc. The chairman of this committee, James Miles, has recently submitted\nto the members of this committee, to NAEB Directors, and more recently to the\nentire membership a draft of the proposed constitutional changes which will be\napproved at or before the llew York NAEB 'fall -convaition. As .soon as this is accom-*\nplished, and subject to the availability of funds, a new brochure will be issued\nwhich will carry the new NAEB Constitution and by-laws with the most recent\nchanges and amplifications."
}