{
  "id": "d530-151",
  "text": "25>.\n11. RADIO NETWORK ACCEPTANCE COMMITTEE: During the past year this committee\nhas auditioned 80 series of programs for possible use over the NAEB Network.\nThis is of course beyond the work of the In-School Program Committee whose\nactivities, as outlined above, it does not duplicate. This means that approxi¬\nmately 800 reels of tape have gone out from Network Headquarters to the members\nof the committee for auditioning only. During the past year, the committee has\napproved 43 of these proposed series and several special programs for the\nNetwork.\nThe work of this committee also includes acknowledgement of audition series\nsent. In a new function exercised through the Network Manager, constructive\ncriticism of all series submitted is passed on to the submitting institution\nfor the improvement of future series. This has undoubtedly been one of the\nhardest-working and most conscientious of all NAEB committees.\n12. RADIO PROGRAM PLANNING COMMITTEE: At their August 21-22, 1953,\nmeeting in Washington, D. C., this committee discussed several prospective series\nto be produced by the NAEB alone or in cooperation with other agencies. Some\nfilm series were also discussed. Since that time general liaison has been\nmaintained between this committee, Headquarters, and the Acceptance Committee,\nin order to achieve more coordinated offerings on the NAEB Network. This\ncommittee is essentially a long-term planning group.\n13. RESEARCH COMMITTEE: This committee conducted a survey of pay scales\nin educational stations and prepared a report based on the findings\n(Exhibit 17). Coverage maps (Exhibit 18) have been prepared and distributed.\nThese maps show the extent to which educational radio stations blanket a great\nportion of the country. Similar maps are planned for television. Notable\nalready is the extent to which successful educational television stations seem\nto be clustering in areas originally ’’opened up” by educational radio: the Mid-"
}