{
  "id": "d530-28",
  "text": "1. PRODUCTION WORKSHOP. The number of participants will be limited to 30 repre¬\nsentatives of accredited institutions or organizations who have an educational\ntelevision station, who hold a construction permit for an educational television\nstation, who have applied for such a station, or who are engaged in the produc¬\ntion of educational television programs. Participants will be selected on the\nbasis of educational radio and television experience, education and experience\nin the related arts, and on the basis of the contribution to educational tele¬\nvision which they are or will be in a position and likely to make.\na. Selection of participants will be made by the NAEB Workshop and Training\nCommittee.\nb. Participants will receive $5.00 per day up to $100.00 toward lodging and\nfood. NO TRAVEL will be paid.\nc. Participants in the 1953 Production Workshop, held at the University of\nIllinois, are not eligible for attendance at the 1954 workshop.\n2. APPLICATIONS. Applications should be submitted in seven copies and should\nspecifically include the following items:\na. Institution Represented: Name, TV status, and TV activities.\nb. Applicant: Name, title, present responsibilities and qualifications, and\nlikely activities and duties for the next five years.\nc. Recommendation of Superior: Name, title, and signed letter of recommendation\nfor the applicant, including information as to why this applicant was\nselected over possible other candidates.\nd. The following statement, signed, and dated, by the applicant:\n\"If accepted, I agree to attend for the full period of the Workshop. I\nalso understand that NAEB’s contribution to the expenses involved shall not\ninclude any transportation and, for living expenses, shall be limited to\n$5.00 per day and may not exceed $100.00 for the full period. All personal\nexpenses beyond this $100.00 will be borne by me or my institution.\"\nApplications should be mailed to Dr. Harry Skornia, Executive Director, NAEB,\n14 Gregory Hall, Urbana, Illinois, and must be received not later than July 1,\n1954. Successful applicants will be notified by August 1, 1954.\nImportant Note to Applicant: Please indicate conspicuously at the top of\napplication whether you are applying for TV Production Workshop. TV Engineering\nWorkshop. or a Scholarship."
}