{
  "id": "d530-3",
  "text": "EXHIBIT 24\nNAEB Television Engineering Workshop\nOctober 19-27, 1954\nNew York Area\nTentative Roster\n1.\n2.\n3.\n4.\n5.\n6.\n7.\n8.\n9.\n10.\n11.\n12.\n13.\n14.\n15.\n16.\n17.\n18.\n19.\n20.\n21.\n22.\n23.\n24.\n25.\n26.\nMr. Lawrence Anderson, Radio Hall, University of VJisconsin, Madison,\nWisconsin\nMr. William Gordon Benson, Radio Station KUOM, University of Minnesota,\nMinneapolis, Minnesota\nMr. James H. Bonney, Chief Engineer, Station WBUR, Boston University,\nDivision of Communication Arts, 84 Exeter Street, Boston 16,\nMassachusetts\nMr. Lawrence A. Brogger, Radio Station KUOM, University of Minnesota,\nMinneapolis, Minnesota\nMr. A. J. Boggioni, Radio Station WOSU, Ohio State University, Columbus\n10, Ohio\nMr. John R. Brugger, Chief Engineer, Radio Station WILL, University of\nIllinois, Urbana, Illinois\nMr. Charles W. Brooke, Jr., Television Station WQED, 4337 Fifth Avenue,\nPittsburgh 13, Pennsylvania\nMr. K. Winston Bugg, Chief Engineer, Radio Station WABE, Board of Education,\nCity Hall, Atlanta 3, Georgia\nMr. Gerard Colliot, Radiodiffusion Francaise, 972 Fifth Avenue, New York\n21, New York\nMr. Harold D. Gorsuch, Radio Station WOSU, Ohio State University, Columbus\n10, Ohio\nMr. Charles E. Houston, Associate Professor, Electrical Engineering, Texas\nTechnological College, Lubbock, Texas\nMr. Kyriacos Joannou, Chief Engineer, Radio and TV Services, Oklahoma\nA & M College, Stillwater, Oklahoma\nMr. Lawrence A. Larson, Radio Station KUOM, University of Minnesota,\nMinneapolis, Minnesota\nProf. E. M. Lonsdale, Electrical Engineering Department, Electrical\nEngineering Building, State University of Iowa, Iowa City, Iowa\nMr. Carl Menzer, WSUI, University of Iowa, Iowa City, Iowa\nMr. Guy H. Peden, Jr., Radio Station VJOSU, Ohio State University, Columbus\n10, Ohio\nMr. C. D. Phillips, TV Laboratory, State University of Iowa, Iowa City, Iowa\nMr. Walter Rechenberg, Jr., Television Station WQED, 4337 Fifth Avenue,\nPittsburgh 13, Pennsylvania\nMr. Frederick M. Remley, Jr., Television Office, University of Michigan,\n310 Maynard Street, Ann Arbor, Michigan\nMr. Robert Schlorff, Chief Engineer, Radio Station WDET, Wayne University,\nDetroit 1, Michigan\nMr. W. Worcester Smith, Assistant Professor of Electrical Engineering,\nUniversity of Massachusetts, Amherst, Massachusetts\nMr. Joseph E. Stuckey, Chief Engineer, Radio Station WU0A, University of\nAlabama, Box 2002, University, Alabama\nMr. Ralph R. Townsley, Radio Station WBAA, Purdue University, Lafayette,\nIndiana\nMr. Johnny F. Wahlfeldt, Broadcast Engineer, Television and Motion\nPictures, University of Illinois, Urbana, Illinois\nMr. Gordon Ward, Radio Station WDTR, 9345 Lawton, Detroit, Michigan\nMr. Noyes W. Willett, Radio House, University of Texas, Austin, Texas"
}