{
  "id": "d530-37",
  "text": "s\nc\n0‘\np\nI\nNATIONAL PROJECT IN AGRICULTURAL CQffi«ICATIONS\nW?LLS HALL - MICHIGAN STATE COLLEGE\nEAST LANSr.' G, MICHIGAN\nJuly >, 1954\nMr. Harry Skornia\nDirector, National Association of\nEducational Broadcasters\n14 Gregory Hall\nUrbana, Illinois\nDear Mr. Skomi/.s\nThis is n rely a question of in;airy. Would NPAC, if it could develop\nin cooperatior with the land-grant alleges a suitable program format, be\neligible for me of your grants in ridio?\nThere 3 s a very positive and definite need for a series of radio\nprograms, cl scuasion type, djaling ui\\v the over-all agricultural policy\nin a strictly unbiased manner. There ie a great deal of this material\ngoing rut ever the air new but it is usually slanted to the wishes of the\nUSDA m th(> Farm Bureau, the Farmers5 Uni-a or some other group or organi¬\nsation which has an interest in putting ovt* its particular type of story.\nI think a series of 13, maybe 26, discussion type radio programs with\nsome top people could do a great deal to clar3i> national thinking on the\nbasic problems in imerioan agriculture at thif ticae* We have been flirting\na little bit with the idea here but our present «\\mds are pretty well com¬\nmitted to a whole series of other projects. he han© not, up to now, entered\nthe production field and I do not know whether it vo&d be feasible even now\nto do it. It was my thinking that possibly we could nordinate a series of\ngenuine public discussion types of tapes that would be t'oreciated and under¬\nstood by the NAEB audience and possibly some of the cornu six***! audiences\nlater.\nThis is merely an inquiry as you see, not an application\nRegards.\n/a/ Stanley Andrews\nStanley Andrews\nExecutive Director\nP. So The survey returns are coming in in pretty big volumo now and at this\npoint there seems to be sentiment overwhelmingly in favor of sane sort\nof central facility for the exchange of television film clips. Gome\nup and see us.\n7/6/54mr"
}