{
  "id": "d530-48",
  "text": "Mro Harold Hill\nJuly 7* 1954\nPago Two\nfruitfully occupied for a co&plste two weeks. I say this without in aay way attaint¬\ning to imply that I know so dam much about TV that I don111 need the tins in it*\nhut rather with the realisation that I haws just so much tins and money available—\nboth the t±m and money are coming out of ms* not ray univsrslty~<»and I mat make the\nheat possible use of that time*\nI wonder* therefore* whether the NAEB (providing it is interested in my scholarship\napplication at all) would continue to be interested were I to propose a program that\nincluded these items*\n1* A .week at Iowa State* working- long hours to soak up all 1 can from-the good\npeople ther® land concentrating upon the management end.)\n2. One or two days at the educational television and radio center* Inn Arbor * just\nviewing good 15 and 30 minute films made specifically for television. I feel that 1\ncan learn much by this experience since it will sharpen my own appreciation of what\nis and is not good quality svie-ssaking for TV.\n3. Two or throe days with <mraer@ial stations in Chicago* working with members of\ntheir news and commercial staffs* on the job* and having interviews with management\nexecutives.\n4» Two or throe days with commercial stations in Los Angeles* working with members\nof the news and commercial staffs on the job* and interviewing management executives.\nIn each of these cases* I can make all my own contacts. As a result of the entire\nprogram* I feel I could pack away more specific information that will lead more\ndirectly to helping in our program here* and more which can be passed along through\nour eurrleulm: to our students., that I could with the total program concentrated\njust on Iowa State College. The total program obviously would cost mbre time and\nmoney than I originally intended* but the results would seem enough better to make\nthe extra investment worthwhile.\ni\nI am sending a copy of this letter to our Prof, Thompson* who°s working on\nhis dissertation this sum&sr in Gregory Hall (in Bill Ode0a office)* with the\nthought that he could supply any further background on our local situation that\nyou might wish to have. I don°t mean to be rushing you on this* but my schedule is\nsuch that I°ll appreciate a reaction as soon as possible.\nMost sincerely*\n/»/ Gordon A. Sabine\nGordon A. Sabine\nDean\nSchool of Journalism >\nee* W. ho Thomson* 119 Gregory Hall* University of Illinois"
}