{
  "id": "d530-49",
  "text": "July 19, 1954\nT©,- ■\nSeSB Officers\nOn© I8 m been working on for soma time.\nSiegel, please react®\nMINNESOTA MIRING ft MNlFACT^im GOMTOT\n' CC I*. )¥ A &\nSaint Paul 6, Minnesota\nJuly 15, 1954\nDr. Harry Jc Skornia\nMSB\nThanks much for the wealth of infonoation and material you sent me on the activities\nof the MSB. I think you have some terrific materials. Several of our advertising\ndepartment staffers saw your brochures and their remarks were highly complimentary 0\nI911 &oo what we can do about getting seme stories published in the various trade\nmagazines, but 1 think vi have a good angle which will work in a number of newspapers\nover the country. It®ft this*\nWe9H do a good story on the HAHB Tape Network and send‘ft <— together with a couple\nof ©specially good photos to the newspapers in each of the 80 or so cities in\nwhich you have an outlet* We911 suggest to the editors that *here9e a significant\nnational story with a good local angle — your own F M radio station 0* We811 also\nsupply him with the mm of the person to contact at th station, and than suggest\nhe may want to get the local angle plus a picture or two on his owns\nIf it works «*» and 1 think it will — we should b© able to get a number of good\nfeature length stories in papers from coast to coast. Naturally, this Should-be\ngood publicity for the NABB and really excellent publicity for the local NABB member\nstation®\nFor the local contacts, I'll use the nones listed in the green directory ©f October\n26, 1953, with the corrections on the errata (and addenda sheet of 5/U/54 and\nsnent #3 of 6/28/54 Are there any ©the and do each of these\nstations carry all or part of your taped programs?\nLet me know what you think of this and if you &gre@, I911 do the story for your\napproval. Also, I will then arrange for a photographer to come in and shoot th©\nnecessary picturesc Tim must be really top notch, dramatic shots if they9 re to\nscore or even attract the editors9 attention «— in newspapers over th© country©\nAgain, thanks much.\nour 3 truly,\n• /a/ Eon Anderson\nEonald L« Andersen\nProduct Hews"
}