{
  "id": "d530-63",
  "text": "-2-\nMeanwhile, however, the work of the association had to go on. One of the tasks\nwhich the members wished to undertake without undue delay was the starting of an\nexchange of programs which might be considered a sort of experimental mutual network\noperation. In 1950 this project was started. Tapes of programs were distributed\nfrom WNYC in New York, at first, the programs being ttbicycled” from station to\nstation. There were few resources except a box of postage stamps, and a stack of\ntapes (both gifts), and a great deal of good will and enthusiasm. The number of\nprograms which could be this exchanged was small. Loss and damage were high. Nerves\nand tempers were frequently frayed. The limits of this sort of operation were soon\nreached. However, a start had been made. Further meetings were held to refine the\nplan, which was developing, of what the NAEB and its member stations could do if\nadequate financing and a central office were available.\nIn this plan it was visualized that, over a five-year period, a network would\nbe launched, a central office for the Association and home for the network set up,\nand professional, service and research activities inaugurated which would put\neducational broadcasting on its feet and on the map. This plan and dream found\nrealization in the W. K. Kellogg Foundation grant of 1951.\nAt this stage it can safely be stated that more has been accomplished in this\nthree-year period just passed than even the most ambitious and visionary members of\nthe NAEB Board, or its wise consultants, expected could be accomplished during the\nfirst three ye^rs of the projected five-year plan. Although accomplishments were far\nabove those anticipated, the size and complexity of the tasks and problems which con¬\ntinued to develop and emerge, were even more so, for wireless communications turned\nout to be the fastest-changing and fastest-developing field in the United States.\nThe financial resources and qualifications of those schools which became FM\nlicensees as the new spectrum space opened up were not of the same order as those\nof the earlier stations, which had been used as the basis of the projection. Efforts\nto get them to take over the full cost of the Network were not able to be as\naccelerated as had been hoped. Too rapid a rate ran the risk of forcing many to drop\nout because of inability to keep up with too rapidly rising a rate structure.\nOriginal plans and ambitions have had to be tempered with realities. Success is now\nassured, and will be realized in this venture, but perhaps somewhat more slowly than\nmany had hoped, and with a somewhat larger number of fatalities than was expected.\nThe cost of the struggle for channels for education in television (in which the\nNAEB took a leading part, a former NAEB President becoming the Executive Director of\na new Organization, the Joint Committee on Educational Television (JCET), which\nrallied the forces and organized the campaign which ended in success) and of the\nservices needed by prospective and actual educational TV stations, out of all pro¬\nportion to their number, has also proved far higher than anticipated. A larger share\nof the budget than was earmarked has had to be budgeted for television if educational\ntelevision was to become a reality, and if the NAEB was to remain the central\nassociation of both TV and radio for education. Fortunately much of the material\nneeded was in this context produced by NAEB committees. For out of the Kellogg\ngrant, and one of its most important products, has come what we believe is probably\na unique stituation in which much of the work of an Association is actually and\neconomically done by committees, as many of the NAEB's finest and most useful pub¬\nlications will reveal."
}