{
  "id": "d530-76",
  "text": "must be adequately justified. The traditionally small operational budget of the\nIMES (as distinguished from specifically earmarked grants.'* also accounts for the\nenforced frugality of the MSB in oxpendiag travel funds, ©to. Generally trips\n< • ' -V. V .. rvMi : *7, • 7. '•\nseveral functions,are to be carried out. The same is true for the-other expenses\nof the organisation.\nto.gjf4g.IUJl* What are the realistic prospects of further development over the\nnext two to five years — list of stations planned, with realistic estimates of\ntheir opening dates, hours of operation, potential audience, local interest, etc.?\nRealistic prospects for further development for radio alone would indicate\non the basis of the record of the past few years (sine© the advent of television\nas well as before) that five to ten educational radio station® will b® going on\nthe air each year. An increasing number of these stations, however, will be 10-\nwatt stations of limited coverage and hours. EM i@ generally becoming the educa¬\ntional medium in radio, as cojsmeroial radio deserts it, partly because channels\nare available and partly because, much to the disadvantage of the overloaded\nstaffs, it ha® the reputation of being a 9cheapw medium. Development of listen-\nerahip is slow and painful in this secondary medium, as it is likely to be in DBF\ntelevision. I’c will be recalled that education has no channels reserved for it in\nAM radio, and that both AM and W are sources of frequently almost overwhelming\ncompetition to the usually inadequately promoted FM educational radio stations\nnow going on. This laakes it iterative that educational television not in any way\ndiscredit them or ®kiok them while they are down,® for a very slight reverse is\nfrequently enough to cause their liquidation. And this, by an illogical process\nof extrapolation which th© present writer cannot explain, is frequently construed\n*>y opponents, sea© educators, and even th© public, as one more proof that ^schools\nshould stick to education® rather than ^getting into® radio or television."
}