{
  "id": "d530-77",
  "text": "-5-\nEadio is? then, quite frequently a stepping stone to television or at\nleast a keystone in the ^communications thinking** or testing which precedes serious\nefforts to secure educational television. It should also not be forgotten that in\nmany areas of the United States, and for many purposes-, radio will hny§ to continue\nto be the most economical medium for the distribution of many materials, and the\nonly wireless medium which, like it or not, will be financed in some areas for\nmany years to oomo. There is probably atm soma truth in the words of Professor\nAubrey Castell, distinguished University of Oregon professor, speaking to the HAEB\nRegion ?I Convention last Octobers\n“I as convinced that when a university adds a radio station it adds\nfar more to its resources than it will when it adds television to its\nradio. A university without radio is drastically cut off. A university\nwith radio but without television is not drastically out off. A uni¬\nversity can do a great deal for its customers, given broadcast facilities.\nBut the nature of its clientele and th© nature of its materials are ouch\nthat not aa much proportionately 1® added when you pass from broadcasting\n(i.e. radio) to television.tt\nSomehow or other, than, we must make sure that educational television\npromotion is not at th© expense of radio. Otherwise soma of the foundation ©tones\nwe® 11 need later may turn up missing. It would b® a -rent tragedy if educational\ntelevision wore wittingly to contribute to the failure of education to realise\nthe full potential of radio, if and where this can be avoided. The 104 *birds\nin th© hand*1 are still doing a significant Job of education in America.\nQuestion 3s What are th© crucial problem© for this year, the next, and thereafter?\nCrucial problems for the coming year include survival through the testing\ntime which this period is proving to be for educational television. They include\nstudies, for which w© ©11 have pressing needs, of the interrelationship of the\nmedia, and of the overweening importune© of good programs."
}