{
  "id": "d530-80",
  "text": "—S—\nTo what extent are good productions Important now? Why? How can\nthey be produced^ What would it cost? What are the prospects of financing these\nproductions? How can they be produced so as to develop interest, experience, and\nstandards among educators? How can ideas for production be stimulated?\nThere is no question that good productions are important from the outset0\nfcfeny whose support is needed for educational television will judge forever, or\nalmost forever, on first impressions. Latent resources are not enough, as the ME8\nand ETRC have discovered. It costs money to exploit them, just as it costs money\nto drill for oil, and to refine it, once it is gotten out of the ground. For this,\nfinancial support ie needed. The band-to—mouth deadlines under which most small\nstations operate prevent devoting adequate time for planning and quality work.\nAt least a half million dollars a year are needed for financial assistance\nto make the most economical us® of the potential for delivery of Information by\neducational radio stations. Probably 10 to 15 million dollars per year would\nreally be needed for adequate production of educational television programs, if\nthe proportion generally found by business to apply between plant investment,\nproduction costs, and delivery expenses, were to be made applicable. It is of\ncourse doubtful that this sum can be secured. However too small a target should\nnot be settled for without a considerable effort. And a part of the funds secured,\nfor some time to come, will need to be used for promotion and local help to develop\ncommunity support and public understanding. For all this Foundation help will\ncontinue to be needed.\nThe combined ETRO-HAEB grants-in-aid would seem to be one of the many\nways in which standards are being raised in the producing institutions. So are\nthe scholarship and workshop programs of the HASH, and the other services it pro¬\nvides, as partly listed under the comment on Question 1."
}