{
  "id": "d530-82",
  "text": "of faculties for participating in programs and the securing of active participa¬\ntion of administrative and content specialists in program planning? illustrate\nsom of the other problem® invol^d in the whole area,\nA great deal, of progress is already being made through committee activities\nof such association® as the MEB? whose liaison ooam&ttae contains representatives\nof nearly all the related media area© as advisers. This committee, in the present\ncontingency, has turned out to be one of the most important of all HAEB committees.\nIn a realization of its key position, it has undertaken the coordination implicit\nin its central association position. But the tempo of this sort of liaison work\nalso must be increased. For this also fund® are needed. This is also, then, a\nlegitimate are* for requests for foundation support.\nQuestion 7s What are the near future and longer-run future conceptions of Educa¬\ntional TV and Radio as a network blanketing the country? are regional or national\nhook-ups feasible? Are chains contemplated? How many stations in what cities are\ncontemplated?\nI believe the white spaces on any map of educational stations will be\ntoo large to make it practical to expect such stations to be interconnected,\nalthough this arrangement is sometimes used regionally in a fev areas (Wisconsin\nprobably\nand Michigan). Similar regional arrangements will/prevail, but on a lesser scale\nfor many years, in educational television. In fact some sober thought should be\ngiven to the way in which educational television coverage will duplicate and coin¬\ncide with that on the attached KAEB Radio map. As in radio, the outlying stations\nmost quickly get into troubles which frequently render them less dependable in the\nlong haul than the more centrally located Bid-western ones.\nThe attached directory of fS&ES members gives an idea of geographical\ndistribution so far for both radio and television. Exact predictions for tele-"
}