{
  "id": "d530-84",
  "text": "-12-\nCooperation is generally fairly good among these groups, more in tribute\nto the personalities involved, as has been remarked, than to any adequate coordina¬\ntion. In faot the set-up as it exists (with many trying to do virtually everything\nfor and to the sometimes confused stations) would seem certain to cause waste\nmotion and some misunderstanding, as mentioned later in this report.\nVirtually all other educational organizations are gradually being involved,\nbut this takes time. No»on© of the above organizations has any magic formula or\nexclusive channel for such involvement, which coshes in many ways and at many\nlevels, and must continue to do so. The efforts of the HASB in this area, as\nalready explained, are the only ones specifically known to this writer well enough\nto describe here.\nIt is our belief that of the five organizations, the only ones actively\nengaged in securing such involvement of educators in and for both television and\nradio are the ETRG and the MSB, ao the (future) network and the association of\neducational broadcasters, respectively. There is some question in the writerh\nmind if the ACE-TV Committee should not also eventually undertake to extend its\nliaison functions to include radio as well.\n** the organizations want something done to foster their development\nover the next few years, what is it? What plan does it have? What would it cost?\nWhat parts can be financed by local or other support? Recognizing that foundation\naid must be temporary for a few years at best, where could Its aid be of greatest\nhelp?\nMost of the organizations mentioned and represented here would undoubtedly\nlike to have their futures assured. However this simple a solution may not be\npractical. A more realistic approach would seem to be an objective evaluation of\ntk® .BSgl&ggR rather than the organizations needed, and of which organizations are\nconstituted for beet providing these services. This will involve consideration of"
}