{
  "id": "d530-99",
  "text": "MSB HEADQUARTERS\n14 Gregory Hall\nUrbana, Illinois\nNAEB Educational. Television Production Workshop\nAugust 23 - September 10, 1954\nMichigan State College, East Lansing, Michigan\nHnatax.\n1. Mir. Thoms J. Brophy, Office of Radio-Television, NEW ICRK UNIVERSITY,\nWashington Square, Sew York 3, Hew York\n2c Mr*-John C* Grabbe, Director of Broadcasting, RADIO STATION KGVN? COLLEGE\nOF THE PACIFIC. Stickton, California\n(Simmer address? National Masic Camp, Interlochen, Michigan)\n3, Mr* Charles B. Gilbert, RADIO STATION ESDI, ST. LOUIS BOARD CF EDUCATION,\n1517 South Theresa Avenue, St. Louis 4* Missouri\n4* Dr. Levin Goff, Department of Speech, STATE UNIFERSTTT CF IOWA,\nIowa City, Xowe\n5c Mr, John Henderson, RADIO STATION WBAA. PURDUE UNIVERSITY, Lafayette,\nIndiana\n6o Mrs, Lr. C* MoN&bfe, Director of Broadcasting, MILLIKIN UNIVERSITY, Decatur,\nIllinois\n7. Mrs. Maude Kemper Riley, Editor of Publications, THE ART INSTITUTE OF\nCHICAGO,, Chicago 3# Illinois\nMiss Margaret Siegley, Assistant Director of Radio and TV, OKLAHOMA CITY\nPUBLIC SCHOOLS, Oklahoma City 6, Oklahoma\n9. Miss Hilary Whittaker, Department of Speech, WAYNE UNIVERSITY, Detroit. 1,\nMichigan\n10. Mr. Anthony W, Salts, Department of Speech, UNB'ERSITY CF MASSACHUSETTS,\nAmherst, Massachusetts\n(Summer address? Department of Speech, University of Wisconsin,\nMadison, Wisconsin)\nXX, Dr* Harry W. Knepler, Division of liberal Studies, ILLINOIS INSTITUTE CF\nTECHNOLOGY, Chicago 16, Illinois\n12. Mr. W. Perron Halverson, Box 99 - Abbott Ball, NORTHWESTERN UNIVERSITY,\n710 North Lake Shoxe Drive, Chicago 11, Illinois\n13. Mr. S. Donald Robertson, Department of Speech, RADIO STATION KFJM3\nUNIVERSITY CF NORTH DAKOTA, Grand Forks, North. Dakota\n14. Mr* Ralph J. Tangney* Program Manager, RADIO STATION WGBH-FM and WGBE-TV\n(WGBH EDUCATIONAL FOUNDATION), Symphony Hall, Boston 15, Massachusetts\n15. Mr. John E. Young, Manager, RADIO STATION TOC, UNIVERSITY CF NORTH CAROLINA,\nChapel Hill, North Carolina\n16. Mr, Roland E Fens, Director, RADIO STATION KSTC. KANSAS STATE TEACHERS\nCOLLECT , Pittsburg* Kansas"
}