{
  "id": "d1599-0",
  "text": "PRESIDENT'S C0L1M\nA century and a quarter ago Alexis de Tocqueville observed that Americans\nwere an association-minded people, that they had a passion for getting together.\nPerceptive as he was, the scholarly Frenchman could have hardly forseen that today\nin this country there would be some 20,000 \"getting togethere\" with an annual attend¬\nance estimated at 10 million.\nAlmost anyone in the U.S. can attend some kind of convention, whether he be\nhod carrier, teacher, lawyer, or candlestick maker. The conventions vary greatly\nin purpose, size and usefulness. At one extreme is the raucous jamboree where horse¬\nplay and revelry overshadow more setious aims; at the other, are the sedate gather¬\nings of various learned societies and scientific organizations.\nWhy do professional people spend time and money to attend conventions? The\nWashington Post recently categorized the people who had come to the American Bar\nAssociation convention as: lawyers who look upon the AM as a trade association\nto promote their interests and protect their bread and butter; politicians who are\nconcerned with power, with who is elected to office, with who makes policy; crafts¬\nmen who came to learn, who listen to panels on highly technical subjects, and\ngather Information to help than in their private practice, and socialists, who came\nto see their old buddies, to tell tales, to live it up.! *\nWere these same types present at the NAEB convention at San Francisco? Yes,\nto some extent4 and these disparate approaches pose a major problem, i.e., planning\nan agenda to satisfy a wide variety of expectations and interests. Should the pro¬\ngram be planned to provide a lavish banquet of many morsels or with a few main\ncourses and several special side dishes? Should people be stuffed with a continu¬\nous diet of raw meat or have a little light wine and an opportunity to relax occasion¬\nally between servings? Does our convention fit the needs of a varied membership as\nindividuals as well as the purposes of the composite membership which is the assoc¬\niation? Is it serving a genuine purpfse or is it merely a social convention?\nAnswers to these questions depend upon what one conceives to be the purposes\nof a MSB convention. Among other things, I suggest it should attempt to:\n1. Advance the general aims of the associations improving the professional\nqualifications of educational broadcasters and the quality of educational and gener¬\nal broadcasting; working \"to the end that the educational, cultural and technical\nbenefits of broadcasting may be extended to all*\" The agenda should be planned\naccordingly, since its parts take on added force as they are preceived to be\nrelevant to these purposes.\n2. Charter new courses. This is the opportunity for setting new directions,\naccelerating recent moves, adding momentum to current projects, reinforcing, re- Zf\nfocusing, or revising policies. While adhering to the general purposes, new goals\nneed to be set and specific approaches selected. 'The convention is our only oppor-\n3. Provide a reverberation chamber. For these three days out of 365 thej\nmembers are in group milieu 'that' makes them highly attuned to HAEB concerns both\nas receptors and stimulators* The convention should create a sort of cyclic-res¬\nponse mechanism by which officers and members interact with one another. The\nadministrator should stimulate the audience with his conception of how and what\nis to be done; the audience should, through its reactions, stimulate him, and,\nin turn, the administrator restimulate the members k through his heightened sense\nof their wishes and feelings as well as the sharpened focus and increased force he\nderives from their suggestions\" and insights."
}