{
  "id": "d1599-2",
  "text": "-3-\ngathering and disseminating information was part of my job, and asked them why\nthey objected. I was then accused of dealing with the enemy. I told them that\nI had no reason for looking upon the Latin American delegations or countries\nas enemies of the United States. One of them replied that this conference\nwas essentially a business deal and that in a business deal it was al?/ays cus¬\ntomary to look upon the other party as an enemy and keep from him any information\nthat might help his cause.\nThey then attacked the accuracy of ray statements. I asked them to point\nout any error that I had made so that I might send out a corrected statement to\nthe persons who had received the present one. They were unable to point out any\nerror, but thought the profits reported for Australia might be more or less. I\nsuggested that if there wore anything wrong with the report I would be glad to\nsend any report which they might prepare to the same persons who received mine.\nI was then told that they had no later or more accurate figures and would not\ngive them to the delegates if they had them.\nI explained that in gathering the information in foreign countries I had\nbeen introduced by officials of our own country and that usually an interpreter\nfrom the staff of a consulate had assisted me; then my report of the interviews\nhad been submitted in writing to the consulate, and by the consulate to the\npersons interviewed, and all corrections suggested had been made. The two\nAmericans who were attacking me then expressed contempt for the United States\nDepartment of State.\nOne of these men objected particularly to that part of my report in which\nI quoted figures that he himself had prepared and which were published in Senate\nDocument 137. He said they were out-of-date and misleading. I asked him if he\ncould give me later or more accurate figures, so that I could send them to the\ndelegations. He said none was available. I reminded him that I had included\nin my report also statements by a vice-president of his own organization bring¬\ning the information up to date in a general way for 1932 and saying something\nconcerning 1933. He replied that, since I was present at the hearing where these\nstatements were made, I must know that this official was confused and unreliable\nin his statements at the time. I reminded him that I had not quoted from the\nextemporaneous statements of the official, but from the typewritten statement\nwhich he had carefully prepared for the hearing. He again expressed lack of\nconfidence in this official.\nFinally. I invited these men to prepare statements for me to submit for\npublication in the Bulletin of the National Committee. One of them said that he\nwould do so.\nI called on the various Latin American delegates and secured information on\nbroadcasting in their respective countries. This has been added to our files\nof information gathered in visits to 38 countries, interviews with officials of\n77 countries, and world-wide correspondence.\nSeveral times I was asked how many broadcasting channels wore needed by the\nUnited States. In reply I always quoted statements made to mo by competent\nAmerican engineers that 90 channels were needed but that equally good coverage,\nor better, could be maintained by fewer stations provided present pov/er limita¬\ntions wore removed and stations scientifically located, pewerod, and channeled\nwith a view to providing the best possible national coverage.\nThe Latin Americans expressed appreciation of the attitude of the National\nCommittee in exchanging information."
}