{
  "id": "d206-1",
  "text": "THE FLORIDA STATE UNIVERSITY\nTALLAHASSEE\nMarch 21, 1961\nUNIVERSITY BROADCASTING SERVICES\nMr* William G. Harley\nJ&dio Hall\nUniversity of Wisconsin\nMadison, Wisconsin\nDear Bill:\nI am, as you know, at the moment extremely sensitive to the fact that educational\nbroadcasting is in a state approaching the frenetic. We who have been trying to\nawaken other educators, service agency people and the public to the potential¬\nities of educational radio and television have perhaps succeeded too well. We\nnow find all manner of upstarts who want to come into the fold. We are shocked\nto find that many of them are already well established within the fold, that\nthey have some strong opinions which are not at all compatible with ours. We\nall want to run our radio stations and our TV stations according to what we\nconsider the established, traditional ~ therefore defensible — patterns we\nhave helped to shape through many years of close association with one another\nthrough NAEB.\nWe deal in personalities, we hark back to precedent, we engage in semantic\ngymnastics....and meanwhile the pace accelerates, the confusion becomes multi¬\nplied. We are at a point where somebody must yell halt.\nMy reaction to the draft of proposal for NAEB-NETRC working relationships is\nthat it is a good a statement as can be formulated at the moment. Unless we\nassume good faith on the part of NET, we might as well stop talking, declare\nNAEB a rival organization to NET and choose up sides. This would obviously be\na pathetic waste of leadership, talent and money.\nI think the statement defines some areas of responsibility for both organizations\nas clearly as they can be defined. It indicates others where one organization\nwill carry a primary responsibility, supported by the others. I don*t see how\nwe can be more explicit without creating conditions which limit the development\nof educational broadcasting.\nIt seemed to me that some members of the NAEB Board are trying to develop a\ndocument which will be binding for all time. The nature of educational broad¬\ncasting and the pace at which it is accelerating make this inpossible. Whatever\ndocument is developed will be interpreted by responsible officials of NET, NAEB\nand JCEB. If things reach the point where it is no longer a practical instru¬\nment, it will need to be revised in the light of experience and current conditions.\nThe proposal pointedly makes no reference to the NAEB tape network. It has been\ndescribed as the most important asset of NAEB, therefore not to be lightly\nrelinquished. But I am worried about the NAEB tape network. It, together with\na vast library of LPfs and occasional locally produced remote concerts and\nrecitals and talks, constitutes the program offerings of WFSU-FM. (Plus a few"
}