{
  "id": "d206-10",
  "text": "ot\nmaFLQFP^PQSAL FOR NAEB-NETRC WORKING RELATIONSHIP\nPOLICY ON FORMATION AMD LIAISON WITH GOVERNMENT\nIn their respective roles in the educational broadcasting field and as constituent\nmembers of JCEB, NAEB and NETRC accept the responsibility for alerting\nJCTB to matters of national importance wherein a determination of educational\npolicy may be useful or required. Both NAEB and NETRC will assume their\nshare in this formulation of such policies and will communicate to their respective\nconstituents whatever policies or positions may thus be established.\nTo the extent that tire above commitment involves day-to-day liaison with\nCongress and its committees and with the FCC in matters broadly affecting\nthe educational broadcasting field, NAEB will accept the primary responsibility.\nIf may be expected to take leadership and to maintain initiative in these\nmatters, and in addition to employing its own personnel will also work closely\nwith NETRC in order to utilise the past experience and present competence\nN^TRC Washington staff together with the interest and Influence of\nMETRO offers, board members, and affiliates.\nIt is understood that any organisation shall be free to make an independent\nrepresentation to government when it may deem this advisable, but should\nat least inform associated organizations of its intentions before doing so.\nSTATION ACTIVATION\n'J/t'\nit\n<0\nPrimary responsibility for development of additional educational Stations methods\nof Interconnection thereof, and new patterns of program distribution w 11/rest\nwith METRO.\nEngineering and legal services of its Washington office together with allied\nactivities of its other departments (especially station relations) will be\nutilized to this and.\nNAEB's supporting activities will include stimulation of greater use of radio and\ntelevision, as in item IH below.\niSIMMIIONO^mTEKEglLAMD USE OF BROADCASTING MEDIA BY EDUnftTTOUaT.\nAGENCIES\n*“f ls a contlmUng responsibility of all constituent members of JCEB,\nNAEB wu! assume primary responsibility for such stimulation through its\nprofessional activities, publications, research library and reports, and the\nconsultative activities of its many members."
}