{
  "id": "d206-13",
  "text": "MEMORANDUM\n27 March 1961\nTO: Dick Hull and Jim Miles\nFROM: Harold E. Hill\nRe the draft of the Milwaukee Board minutes I sent you. I have received the\nparagraphs that Chris Donaldson wrote to go in the minutes, reflecting Schwarzwalder’s\nposition. Ihis will result in the following insertions:\nOn page 8, line 11, after “personnel in the NAEB Board”, the following will be\ninserted: Subsequently at Mr. Harley’s request, Mr. Donaldson submitted, in\nwriting, the following statement, incorporating “the substancs of Dr. Schwarzwalder’s\nposition“Beginning with the poor judgement of meeting with NETRC in its own\ncamp, the error has been compounded by even accepting seriously the terms offered\nNAEB. But to analyze briefly: station and network activation should never become\nCenter functions; NAEB should not be confined to Just ‘stimulation of greater use of radio\nand television*; nor should it accede to the Center’s intention to control international\naffairs, etc. NETRC*s suggestion that the NAEB President be a guest at regular\nNETRC Affiliates Meetings is in no way equal to NETRC*s suggested representation\nat NAEB board meetings and is absolutely, unequivocally unacceptable. Too,\nNAEB’s membership in JCEB whose \"Washington office is now financed by NETRC,\nplaces NAEB in the questionable position of subordination to NETRC. The Center's\noffers are absurdly insufficient and ratification of the terms presented will indeed\nmean the end of NAEB as an effective organization. Finally, it should now be evident\nthat NAEB must fight for its very existence.”\nOn page 9, before the last two lines on the page, insert the following new\nparagraph: “Mr. Donaldson was also requested by Mr. Harley to submit, in writing,\na summary of Dr. Schwarzwalder's position on the channel 12 matter. The following\nstatement was subsequently received: ‘The NAEB performed very badly in this matter\nand has placed itself in the ridiculous position of declining assistance to an important\nmember organization in a dispute in which NAEB should have been a pillar of strength\nand leadership, The very name of the organization clearly states that it is. an\nassociation of Educational Broadcasters . The stated purpose of the organization\nalso makes dear its role in such cases. There should not even be a question of what\npolicy to follow. There does, however, seem to be confusion over the role of the\nNAEB Legal Counsel in the matter. Despite that firm's long and loyal tenure, is it not\npossible that if^. welfare has become confused with NAEB’s? Legal Counsel does\nnot make policy near should the awareness of Legal Counsel’s other interests affect\nNAEB policy. NAEB must support its member organizations and, where necessary,\nseek other counsel to assist in the implementation of that policy. The fact of NAEB’s\ntimorous vacillation in this matter which offered the perfect opportunity for NETRC to"
}