{
  "id": "d206-19",
  "text": "m -STIMULATION OF INTEREST AND USE OF BROADCASTING MEDIA\nBY EDUCATIONAL AGENCIES\nWhile this is a continuing responsibility of all constituent members of\nJCEB, NAEB will assume primary responsibility for such stimulation\nthrough its professional activities, publications, research library and\nreports, and the consultative activities of its many members.\nNETRC* s supporting activities normally will result from its regular\nservices to stations on the air and about to come on the air, and\nspecifically through its efforts toward Station Activation, as In Item\nII above.\nIV- NON-BROADCAST USES OF RADIO AND\nTELEVISION IN EDUCATION\nNAEB will assume responsibility for all services to closed circuit\ntelevision users, with the exception of furnishing actual program\nmaterials supplied by NETRC. NAEB also will maintain close relations\nwith those in audio-visual and teaching device development so that\neducational broadcasters generally may be kept aware of important\ndevelopments in these related fields.\nV. INFORMATION SERVICES\nNAEB will be responsible for collection and publication of research\nfindings and will endeavor to establish a national clearing house and\nreferral center for all those requiring data on any aspect of the use\nof radio and television in education. NAEB also will continue to publish\na weekly Washington Report, a monthly Factsheet (similar to that\npreviously issued by JCET), and its regular professional Newsletter and\nscholarly Iournal . It will also maintain a directory of educational\nradio stations.\nNETRC will publish the Directory of Educational Television Stations\n(formerly tssued annually by JCET) and will maintain its present\npublications. NET News. Inside Channels, and NET Annual Reports\ntogether with such other special reports or publications as may be\nnecessary to Interpret activities of NETRC and affiliated stations to each\nother, to the field, and to the general public.\nNAEB and NETRC will attempt to coordinate their publications in order\nto avoid duplication and to service adequately all those engaged\nin or interested in educational radio and television."
}