{
  "id": "d206-2",
  "text": "Mr. William G. Harley\n- 2 -\nMarch 21, l?6l\nseries picked up here and there.) The University administration has never\ndirected me to operate a cultural entertainment service for a small —\nthough fanatically dedicated — segment of the community. I can think of\nmany other uses to which the station could be put. I do not see how, in\nthe light of legislative pressure to increase faculty production, to bring\nall possible media to bear on the learning process, to justify activities in the\ncold terms of practicality — in view of all this, I do not see how the Uni¬\nversity can continue to operate a egg-head program service. If the adminis¬\ntration attempts to bring the radio station in out of its orbit, many NAEB\nprograms will have little meaning.\nEver since we went on the air with the TV station, I have been concerned\nabout a closer relationship between programs on radio and TV. We use the TV\nstation for many purposes which could as easily or better be served by radio.\nIf we related the two, we could launch something on television, follow it up\non radio, freeing some TV time to initiate offerings in other areas. But our\nviewers and listeners do not think of the services as complimentary. Our\ninstructional departments do not. The radio station and the television station\nare actually competing for the same audience.\nI do not think that the Center could, at the present time, do anything about\nthis. But I think that coordination and inter-relating of program material\ncan more easily be accomplished by a single program service, for both radio\nand television.\nIf the Center means to compete with NAEB through the present kind of BFA\noffering, this is a far cry from the kind of thing I have in mind* If the\nCenter would merely expand BFA to include the NAEB tape network, this would\nnot really change anything for the local station. But if the Center intends\nto develop some really new concepts in programming with built-in cross\nsupport of radio and television, then this is new and exciting possibility.\nThis is being written hurridly as my reaction to you. I am afraid I might be\nmost uncomfortable to have copies of it circulated among members of the\nBoard.\nIn a nutshell, I endorse the proposal as drafted, assuming that the day-to-day\nimplimenting of it will be handled with the same care and breadth of vision\nthat went into developing it.\nBest regards.\nRF/as"
}