{
  "id": "d206-24",
  "text": "da Menzer? \"NAEB was organized to protect and to serve Educational\nBroadcasting stations. Although its functions have broadened and it\napparently looks toward acting as a professional organization for\nthose interested in Educational Broadcasting^ -its function of serving\nthe broadcasting stations which make up the rank ;and file of its\nmembership is still of primary importance, if all suggestions pro-\nfx»s@d are accepted NAEB will, in ray opinion, lose not only its effec¬\ntiveness but its usefulness as well. NAEB has pioneered in many\nfields which have been important and which promise to become more so.\nBy accepting this proposal, it appears that the waiority of these\nthings will not only be given up with no apparent return, but NAEB\nwill also give up its rights to engage in any such future activities.\nIt is for these reasons, as well as other obvious ones, that I oppose\nthe acceptance of this proposal.\"\ne, Tettemer: \"A swindle .... Yetr my own feeling is that all this\nis. probably inevitable. NAEB has never really acted as if it wanted\nto be a 0 leader organisation0. As far as people in responsible posi¬\ntions are concerned NAEB seems to be outclassed by the Center\"0,\nf0 Vogls \"The announcement by the Center that they are opening a\nWashington office to* in effect, do for the Center wSiat the NAEB office\nwould do under the 9quid pro quo0 settlement, seems to scuttle ail\nprior proposals Without the honest support of the Center, reinforced\nby an annual fee commensurate with the service it would receive, I do\nnot see how NAEB can even pretend to represent the trade-professional\nside of the businessOpening of the Center’s Washington office clearly\nshows that the Center has no intention of relying on NAEB to represent\nthem in any way* With this obvious declaration of non-support, I can\nsee no justification in discussing further the transfer of the radio\nnet to NET,\nAside from sharing the cost of a banquet for Scott Fletcher in Milwaukee,\nI don’t see that NAEB receives anything concrete from White’s'offer0.\nHis token fee of $1500 a year, plus the possibility of a few individual\nmemberships, cannot seriously be considered 0support0 for NAEB.\nTo give the radio network to NET, to share (compete) with the Center\nfor representation in Washington through two separate offices is a\ndamn site leas ihan the ’separate but equal0 outrage that reduced the\nSupreme Court to helpless laughter099\n3. To all this let me add my own view. The Center’s offers are pitiably\ninsufficient. The Executive Coraraittee should have been ashamed to submit\nthem to the Board, Station and network activation should never become\nCenter functions.\nNext, since the Center0s action in taking over JCBT deprives NAEB of all\nexcuse for performing trade association functions and leaves it (if this agree¬\nment is ratified) only the professional association functions, I fail to see\nwhy a station* as such* should belong to NAEB under the proposed new agreement."
}