{
  "id": "d206-36",
  "text": "<U)\nengineering and legal counsel to advise and assist it—as will\nHETRC in its liaison with governmental administrative and regu¬\nlatory bodies. It is apparent that considerable cross-consul¬\ntation and sharing of experience and knowledge among the two\nagencies* engineers and attorneys will be desirable. Such\njoint effort should afford the educational broadcasting field\nthe finest possible advice and counsel in all engineering and\nlegal affairs, yet defines areas of leadership and initiative\nto be occupied by each organization.\nBeyond this, HA.EB will furnish the services of its\nengineering and legal counsel to its constituents as in the\npast. Since these constituents are primarily individuals, (*)\nIt is envisioned that such counsel will deal to a considerable\nextent with personnel matters, labor questions, problems of\nnon-broadcast users of television and radio, and whatever\ngeneral matters emerge from legislative liaison described\nheretofore.\nNETRC will furnish the services of its engineering\nand legal counsel to stations {#) on the air and about to\ncome on the air In much the same manner as has been don© in\nthe past by personnel and by NMMs own attorneys.\n3. Stimulation of interest In greater use of television\nand radio by educsit lonal. cultural, and governmental\nInst t tab Ions.\nWhile all three educational broadcasting agencies\nconstantly are involved In doing this, the primary responsi¬\nbility for such stimulation shall be vested in NAEB, with its\nassociated activities in publication, research reports, and\nprofessional advancement. JCEB concurrently may assist in\nsuch efforts within the educational community, and NETRC\nwill assist through its constant contact with stations on\nthe air and about to come on the air. . }\nJC&.V- fTtodV V-'\n4. Development of additional educational stations,\nmethods ofinhercorinectlon thereof, and experi¬\nmentation with new di sferibuFion pat terns.\nSince NETRG is basically a pro ram agency serving\nand also depending upon stations, the primary responsibility\nfor new station activation shall rest with the Center, and\nall of Its departments including the engineering and legal\nservices of its Washington office will be utilized to this\nend. NAEB, with its responsibility for stimulating greater\n#HOTE: Until such time as a closer working relationship may\ndevelop between educational radio stations and NETRC, radio\nstations may expect to receive oounsel from KAEB."
}