{
  "id": "d206-4",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nOFFICE OF THE REGIONAL DIRECTOR\nApril 20, 1961\nMr. William G. Harley\nPresident, NAEB\n1346 Connecticut Avenue N.W.\nWashington 6, D.C.\nDear Bill:\nI have refrained from attempting word or line changes to the\nproposed letter of agreement with the NETRC for two reasons.\nFirst, I feel you who are \"on the ground\" and working actively\nwith the problems are in a position to do the best job. Second,\nI doubt that such a document as this can successfully be contrived\nby a committee as scattered as our board is between its meetings.\nHowever, in advance of the Columbus meeting I would like to\nput some thoughts on paper as background to the deliberations. I\ndon’t do this with any feeling that I am instructing or preaching\nto you or any of our board members. Instead, I hope that clarifi¬\ncation of points on which I might be in error will serve construct¬\nively to dispel any misinterpretations I may have of our present\nposition.\nIn the first place, I don't think any reasonable person can\ndoubt that certain agreements must be made between the NETRC and\nthe NAEB. I won't waste time in belaboring the obvious necessity\nof these agreements. Further, we should all realize that agree¬\nments will be made as questions arise in the day-to-day conduct\nof the business of the two organizations. Our only choice is\nwhether these agreements are formal and between organizations, or\ninformal and between the working presidents and their staffs.\nIt is my feeling that the main obstacle to constructive agree¬\nments between organizations at this point is a widespread distrust\nof the NETRC within NAEB. This distrust runs the scale from mile\nuneasiness to the concept of the NETRC as a \"monolithic evil\" - and\nthose who hold the most extreme view are not without a good deal\nof company.\nThis NAEB feeling most often finds expression in such phrases\nas \"I don't trust Jack White.\" White has become synonymous with\nthe Center and, as the highest Center official known to the major¬\nity of NAEB members, he has personally been the target for NAEB\nmembers' uneasiness with the Center."
}