{
  "id": "d206-42",
  "text": "-2-\na. Leadership in developing positions on national\nissues affecting educational broadcasting. In this\nrole it would serve to alert the frETftC and the Council\non matters in which they should take a position and\nassist in such formulation via information and data.\nb. Representation of education’s interest in matters\n6f allocations policy. Preparation of agruments in\nresponse to FCC proposa1s, development of briefs\ncovering special needs of education in the electronic\nspectrum, and initiation of proceedings benefiting the\nlong-range interests of education in the electronic\nspectrum.\nc. Defense of educational assignments. Maintain\nconstant vigilance against any attempt to delete a\nreservation or to proceed against an educational\nassignment. All parties affected will be alerted\nimmediately and assistance provided in preparation\nof counter-filings.\nd. Direction of appearances and activities relating\nto allocations, reservations and regulations. Coordin¬\nation of testimony, recruitment of witnesses, marshall¬\ning of depositions in support of education’s case.\ne. Service to communities, institutions, and agencies\ndesiring to establish stations or networks. Assistance\nin pre1iminary planning, preparation of forms, and\npresentation of petitions for addition of channels\nwhere unavailable.\nf. Assistance in non-allocation legal matters:\nCopyright, talent, union, customs. Press for recog-\nnition of the special non-profit status of education\nand principle of ability to pay so that educational\nbroadcasting is not saddled with the patterns in rights\nand union areas set in imitation of commercial prac¬\ntices. NAEB maintains a management consultant service\nto advise educational broadcasters in union relations.\ng. Representation of U, S. education in international\nagreements affecting broadcasting” Leadership in\ne s t a b 1 i s'h i ng international a g re erne n t s related to space\ntransmission. (The International Telecommunications\nUnion has appealed to the U. S. for such help and it\nis suspect if carried on only by armed services or\nthe commercial industry.) Participation through EBU\nin development of international agreements relating\nto copyright and talent fees."
}