{
  "id": "d206-43",
  "text": "-3-\n(NETRC legal services would be concerned with: representation\nfor network problems, international broadcasting agreements and\nparticipation in international discussions on copyright, talent\nfees, etc., development in cooperation with NAEB of Center\npositions on national issues.)\n2. Engineering Services\nIn no aspect of educational broadcasting do educational\nagencies so traditionally flounder (due to inadequate testi¬\nmonial help and lack of experience and resource) as in the\nengineering area. Consequently, there is a constant and grow¬\ning need for first-rate professional assistance for education.\nThe engineering service, like the legal service, will not\nreplace the need for qualified consultants employed directly,\nbut will help institutions to reach the stage where such con¬\nsultants take over. More importantly, studies will be under¬\ntaken in the national, international and space areas — studies\nwhich are necessary if education is not to be left out of the\nallocations which the next few years will bring.\nNAEB engineering service will undertake activities in\nthese categories:\na. Technical information: correspondence and office\nvisits with persons seeking to establish radio or TV\nstations, closed-circuit installations, microwave\ncircuits, state or regional networks.\nb. On-the-spot consultations: visits to areas planning\nETV activities and seeking special engineering advice.\nThis includes not only single station developments but\nthose involving multi-channel educational networks for\nboth radio and TV.\nc. Channel allocation studies: conduct continuing\nstudy of allocations toprovide additional or changed\nassignments in UHF or VHF for ETV and maintain search\nfor opportunities to increase or improve education's\nallotment of radio and television frequencies.\nd. Preparation of special engineering statements: in\nsupport of filings by NAEB or other organizations to the\nFCC in matters relating to educational broadcasting. This\nincludes preparation of engineering data and technical\nopinion, serving as expert witnesses before the FCC, and\nworking closely with legal counsel in writing of briefs.\ne * Continuing assistance to operating stations and\nclosed-circuit installations. While most of the engineer¬\ning service is directed at stations or networks in the\nplanning stage, operations in-being are often in need of\nadvice or assistance regarding problems that arise from\nnew or revised regulations of the FCC or from actions\ninitiated by commercial interests."
}