{
  "id": "d206-45",
  "text": "-5-\nj. Perform a facilitating role in the distribution of\ninformation through NETRC and other channels as well as\ndevelop feed-back channels via NAEB's constituency and\nthose of other groups and the general public, to make\npossible sounder guidance for national political leaders\nand representatives.\n(NETRC*s activities in the information area will relate to\ndissemination of information to its member stations and handl¬\ning inquiries about the ETV movement, how to start a station,\netc. In addition to correspondence, office visits, etc., it\nwill continue to publish NET News, Inside Channels, and its\nAnnual and other reports.!\n4. Station Activation\nThe most neglected area, in many respects, of the ETV\nmovement. Since the demise of NCCET little has been done\non a national scale to activate the unused channels via\narousing citizen interest and support for ETV at the local\nlevel. Yet with 267 channels remaining much needs to be\ndone in the way of helping to stimulate and coordinate commun¬\nity, state and regional interest in planning educational\nstations and networks.\nNAEB will activate the following plan designed to assist\nin the organizing of civic action, establish ETV commissions,\nand planning for successful fund raising or other financial\nsupport.\nA special Station Activation Committee will be appointed\ncomposed of representatives from each of NAEB’s six regions.\nEach state will have a station activation committeeman serving\nto coordinate the work of state committees in their regions.\nEach state committee will (1) seek to stimulate and;\npromote community activity in all areas where channels have\nbeen allocated within its region (2) provide on-the-spot\nconsultation, address public meetings, and assist in other\nways at the local level (3) arrange for flow of materials and\nother support activities from the national office and help\nin their application.\nIn situations where local leadership is not forthcoming\nor requires augmenting, arrangements will be made wherever\npossible to move in an experienced manager for a two-four\nmonth residence to serve as interim manager for the new station.\nHe will organize community resources and support and remain\nuntil such time as the work of activating the channel was well\non its way. The Placement Service, Management Consultant\nService and Management Training Program, will be utilized\nin helping to train and process staff for the new station."
}