{
  "id": "d149-6",
  "text": "THE PUBLIC RADIO STUDY\nCollege Study Director\nVincent M. Badger\n1384 Massachusetts Avenue\nCambridge, Massachusetts 02138\n(617) 864-0219\nApril 10, 1969\nDear Sir:\nThe Ford Foundation and the Corporation for Public Broadcasting are\njointly sponsoring a study of college and university radio stations in the United\nStates. This project has grown out of a recently completed investigation of\nnoncommercial radio broadcasting by the Public Radio Study.\nAs you know, both the Corporation and the Foundation have a vital inter¬\nest in the role of broadcasting in American life. Two aspects of college and\nuniversity stations are of special interest in this study: their growing impor¬\ntance as influential voices to their audiences, and their status as training\ngrounds for future leaders in broadcasting.\nThe attached questionnaire is the most important part of this study. We\nunderstand how staff and time problems can make answering questionnaires an\nunwelcome task to most stations. We have therefore tried to design this ques¬\ntionnaire to require as little time as possible. Its apparent length is deceiving:\nmost questions are multiple choice. The questionnaire should not take more\nthan half an hour or so to complete.\nYour assistance is crucial to the success of the study. A good return will\ngive the Corporation and the Foundation invaluable direction in funding and\ninitiating projects, and in dealing with grant requests in this area. Both organi¬\nzations are interested in defining a positive role for themselves in relation to\ncollege and university stations, but this cannot be done without your help.\nIf, in answering the questionnaire, you feel that any point requires more\ndiscussion than is possible in your response, please indicate this fact. We\nwill make every effort to contact you, either in person or by phone.\nThank you for your contribution to this important effort.\nSincerely,\nVincent M. Badger\nAn independent study under grants from\nThe Corporation for Public Broadcasting and The Ford Foundation"
}