{
  "id": "d1502-0",
  "text": "WASHINGTON REPORT\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVol. IV, No. 9 DuPont Circle Building, Washington 36, D.C. June 24, 1963\nGOLDIN PROMOTED IN FCC\nDr. Hyman H. Goldin has been appointed (June 17) to the position of Assistant\nChief of the Broadcast Bureau for policy and planning. Dr. Goldin has been serving\nas Chief of the Broadcast Bureau’s Research and Education Division (formerly the\nEconomics Division until 1961) since 1948 where his assistance in educational broadcast\nmatters has been invaluable.\nAPPLICATIONS RECEIVED FOR ETV GRANTS\nHEW reports that six applications for matching-fund grants under the ETV\nfacilities act have been received (as of June 19)• These six requests total\napproximately $1,250,000 and are from: Chicago ETV Assn, (to activate second station\non Ch. 20), Hampton Roads (Va.) ETV Assn., New Jersey ETV Corp., Pennsylvania\nState U., and South Carolina ETV Center for two different projects.\nAlthough requests should be sent in as soon as possible, they should not be\nsubmitted until all information is complete. Some applications have had to be\nreturned because of incomplete information, and this has resulted in considerable\ndelay.\nFCC TERMINATES INQUIRY OF WNDT PROGRAMMING POLICIES\nOn May 29, the FCC terminated its inquiry into whether grants received by\nWNDT, Ch. 13, New York, \"were in any way conditioned or related, expressly or by-\nunderstanding, on a change in WNDT’s plans with respect to meeting the needs and\ninterests of its areas.\" The Commission stated, \"On the basis of the information\ncontained in your response and in the letters from NBC, the Commission is satisfied\nthat no grant of funds to you from a broadcasting interest or anyone else was\nconditioned on any understanding or commitment by you with regard to WNDT’s programming.\"\nIN-SCHOOL SETS TEMPORARILY EXEMPTED FROM ALL-CHANNEL REQUIREMENTS\nBy a Second Report and Order in Docket 14-769, the FCC (on May 29) amended\nits all-channel TV broadcast receiver rules to exempt sets manufactured on or before\nApril 30, 1966 shipped to educational institutions for use in in-school instruction\nprovided that their shipping cartons are marked \"For In-School Use Only.\" In so\ndoing, the FCC denied blanket exemption requests for institutional users in general.\nHEW ETV RESERVATIONS REQUESTED\nOn June 4, Southern Illinois U. (Carbondale - WSIU-TV), requested amendment\n- of rules so as to allocate and reserve for noncommercial educational use Ch. l4\n(Alton) and Ch. l6 (Newton). Also requested substitution of Ch. 55 for Ch. l6 at\nOlney, and Ch. 67 for Ch. 28 at Vandalia."
}