{
  "id": "d1502-1",
  "text": "cations--following the city-by-city assignment pattern of TV.\nIn-brief,. the of\nrnmrnfrriali ntivM^-Tirr^r^ J \"\" ™niarTM I nitJ —a..\nnhangPR are expected t<^?revei±..£ur^ Angraa-aed\ngrowth-^f-tfae-mie^^\nNothing was done about the matter of AM-FM duplicate programing nor was educa¬\ntional FM touched--an outcome which accords with the comments filed by NAEB. However,\nEFM stations in the three 91 Me channels adjacent to the commercial limit must meet\nmileage separations affecting the three lowest commercial channels.\nPROGRESS ON ETV LEGISLATION ADMINISTRATION\nOfficials in HEW and USOE involved in the administration of federal funds for\nETV are making good progress in the development of rules and regulations governing\napplications for grants, and in the acquisition of staff to process them.\nDr. John Bystrom, as Assistant to the Secretary for ETV, and Dean Costin, as\nDeputy Assistant, have been working closely with Charles Zellers, Executive Officer of\nthe Educational Assistance Program (USOE), iprwho|^pffice the operational responsi¬\nbility will reside. Together with lawyers^jfromHEW and thg^FCC, Dr—.Kymaa- JB—Getfli n,\nrrh-iP-pj Rpapfl.prh aafl -p^ii have been working on\nformulation of application forms and statements of rules and procedures.\nOn July 16 this group met with staff members of NAEB and NETRC in an all-day\nsession to review and react to tise initial drafts. (changes growing\nout of this meeting are being incorporated in revised drafts to be shown to a task\ngroup of ETV people representing various regional interests being brought to Washington\nby NETRC to meet with HEW administrators August 5-6. Later in the same month the NAEB\n9 Board is invited to a similar session and the JCEB will confer on August 21.\nNAEB, which has been in almost daily contact with administrators working on the\ninterpretation of the law, is pleased at the sincere disposition of those in charge to\nseek advice and coun^l from the individuals and professional organizations closely\nconnected with development of the legislation and the ETV movement. Further encourage¬\nment comes from indications that those in charge are sensitive to the intent of Con¬\ngress that the bill go into effect fast, that the moneys provided are moved as rapidly\nas possible into the states, and that this be done with a minimum of red tape.\nMeanwhile, Bystrom & Co. is preparedit for appearance\nbefore the House subcommittee in charge of supplemental appropriations^ probably this\nweek flvv. t°/(/Z ^\n<^-*Other major problem: securing the right man for the still unfilled post of\nDirector of the new branch in USOE charged with processing grant applications.\nRELAXATION IN RADIO OEERATOR REQUIREMENTS\nThe Commission propose^ to relax its commercial radio operator rules for certain\nstations so they may use qualified operators with first-class permits on a part-time\nbasis instead of full-time as now required. This would include non-commercial educa¬\ntional FM stations with power up to 25 kw. Such operators would need to be on call and\nbe required to check the transmitter at least four times weekly. Comments due October\n3-\nEgy... ."
}