{
  "id": "d1502-2",
  "text": "y Vol. Ill, No.~~12 ' DuPont Circle Building, Wa'shington ~E, D.C. August 5, ±9&2\nFCC RESERVES ADDITIONAL CHARNELS FOR ETV\nFollowing the pattern contained in NAEB's national plan for channel reserva¬\ntions, the FCC last week added ZJ new channels for ETV in Florida (12), Georgia (6),\nand Kentucky (9). The action was a follow-up to its decision to consider and approve\nstate ETV network plans, wherever feasible, without regard to the overall proceedings\naffecting reallocation of channels. In so doing, the Commission said, \"it is placing\neducators on notice that any TV assignments are subject to change by Commission deci¬\nsion in Docket 14229 with respect to ETV needs on a national basis in which the\nNational Association of Educational Broadcasters has filed a survey.\"\nIn addition, FCC, in response to request of the Board of Regentd of New\nMexico University, proposed a new VHF educational channel in Hatch, New Mexico, by\nshifting Channel 12 from Silver City.\nFCC PROPOSES NEW SERVICE FOR ETV\nThe FCC (July 25) proposed a new class of service to promote ETV by using chan¬\nnels in the 1990-2110 Me or 2500-2690 Me band to transmit instructional programs to\nschools and other selected points. The new service, in effect, a multiple-addressed\nsystem to supplement ETV broadcast service, would enable a central transmitter to\nserve scattered schools or other locations which would convert the transmissions for\nviewing on conventional receivers. Sufficient channels would be available to permit\nsending different subjects simultaneously to different classrooms.\nCosts are expected to be less than closed-circuit and microwave relay systems.\nFCC estimated that a single-channel system serving 25 schools would cost from one-\nfifth to one-third of the cost of a moderately-powered broadcasting station doing the\nsame job.\nIn areas where it would be impossible to provide needed service from a central\nstation, transmitters could be licensed as repeaters. Rules would also permit use of\ntransmitters as relay stations to interconnect systems or to bring in programs from\neducational or commercial stations. Comments due September 17.\nFCC OVERHAULS FM BAND\nOn July 26 the FCC revised its FM rules to set up new coverage classes and\ntightened mileage separations. Subsequently it will issue a table of channel allo¬\ncations ^following the city-by-city assignment pattern of TV.\nNothing was done about the matter of AM-FM duplicate programing nor was educa¬\ntional FM touched—an outcome which accords with the comments filed byyNAEB. However,\nEFM stations in the three 91 Me channels adjacent to the commercial limit must meet\nmileage separations affecting the three lowest commercial channels."
}