{
  "id": "d1852-1",
  "text": "NAEB NEWS LETTER*..._'-. .Page\nUTILIZATION CLINICS IN-CHICAGO\nUTILIZATiON CLINICS TO AID TEACHERS IN THE USE Of EDUCATIONAL RADIO\nPROGRAMS AND ALSO fO AID PLANNERS* PRODUCERS Af RS TOWARD\nPRODUCING THE MOST USEFUL PROGRAMS, ARE BEING HELD WEEKLY BY THE\nRadio Council of the Chicago Public Schools.\n\"FREE COMPANY” ON WNYC\nWNYC, New York City's Own Station, will revive the dramas presented\nAND WRITTEN BY THE \"FREE COMPANY\" LAST YEAR, IT HAS BEEN ANNOUNCED\nBY M. So NOVIK, DIRECTOR OF THE STATION. THE PROGRAMS WILL BE\nBROADCAST ON FRIDAY AFTERNOONS, BEGINNING JANUARY 23RD AT 5*.00 TO\n5:30 p.Mo\nWritten by some of the outstanding names in American literature, the\nPROGRAM WAS DEVOTED TO DRAMATIZING THE BENEFITS OF DEMOCRACY,\nShortly after its inception over the Columbia Broadcasting System,\nTHE PROGRAM CAME UNDER FIRE FROM THE AMERICAN LEGION. THE PROTESTS\nWERE WITHDRAWN, HOWEVER, WHEN IT WAS LEARNED THAT THE BROADCASTS\nWERE PROOUCED WITH THE SANCTION OF THE UNITED STATES GOVERNMENT,\nAmong the works to be presented in the series are \"The States\nTalking\" by Archibald MacLeish, \"The Mole on Lincoln’s Cheek\" by\niviarc Connelly, \"Freedom’s A Hard-Bought Thing\" by Stephen Vincent\nBenet, ano \"People With Light Coming Out of Them\" by William\nSaroyan, Actors for the show will come fro?*i the leading Broadway\nplays and the programs will be directed and produced by Mitchell\nGrayson,\nAlso, plans are now under way for the Third WNYC American Music\nFestival, it was announced. Presented each year from Lincoln’s\nBirthday, February 12 to Washington’s Birthday, February 22nd,\nthe Festival is a comprehensive survey of every branch of American\nMUSIC FROM SWING AND folk SONGS TO THE WORLD PREMIERES OF NEW\norchestral works by American composers.\nPUBLIC AFFAIRS PROPOSAL\nMiss Marion Humble, educational publicity director for the Public\nAffairs Committee, reports that the committee is planning to ex¬\nperiment WITH RECORDINGS BASED ON THE PAMPHLETS STARTING WITH\n\"Better Nursing for America.\" Scripts may be made available to\nTHE EDUCATIONAL STATIONS, THROUGH THE NAEB SCRIPT EXCHANGE.\nHECK ON OKLAHOMA U. WAR COUNCIL\nHomer Heck, supervisor of WNAO, has been named to War Aid Council"
}