{
  "id": "d1077-19",
  "text": "15\nSTM! ARY\nThe fiHires presented in this budget analysis certainly\nindicate to the experienced Director or Manager of an\nEducational Station that, in general, a±ter tnirty yeaiS,\neducational radio is stilly in rn.cst instances, ve±y nnsoung.\nfinancially. In the majority of cases, directors are faced\n\\rith the problem of running systems without any fuel go\ncarry them along.\nIt remains a mystery to this investigator how, on the\non° herd, directors ere able to operate, and, on the other,\nhow these very same directors keep doing excellent work in\nprogramming. Of particular concern to members of the MS ■,\nshould be the ouaiity of personnel used at these stations.\n4<-ain, in all too many instances, we find staff salaries\nare below those paid to other faculty members and below those\nsalaries paid in commercial.\nWe can not ignore the fact that many clerks in the Puollc\n\"-- jrw ^ore than many producers, wricors, pro¬\ngram directors, and announcers.\nIt is no wonder that commercial broadcasters are con-\nPtmrfv taking the cream in personnel, when the above men¬\ntioned\" conditions exist within cur field of education.\nAdministrators, at least many of them, are apparently\nnot cognizant of this important fact. No reputable insti¬\ntution \"in this country permits a consistent bleeding witnin\nits^structure. True, there is a turn-over of faculty members\n■In general, but it is from one institution to another; only\na small minority leaving the profession ecmpletelv.\nIt would be difficult to discover recognized institu¬\ntions allowing major departments to be bled of key personnel\n;-'o -’-he oxterUthat thev allow de~vtm nts of radio and\ntelevision to be bled. Salaries,today, won’t hold trained\npeople, and consequently, directors are not able to bulla\na sound, well-trained, and well-balanced staff.\nOf particular concern should be the over-emphasis.given\nto staffing a station with student help. Although it is the\npolicy of many educational stations to train students\nfor the industry. it would appear, nevertheless, that some\ninstitutions use this as an inexpensive meows of staffing\nth° major positions. Examination of those tables dealing"
}