{
  "id": "d1077-6",
  "text": "o\nPurposes of This Study\nActually very little has been known about the^operating\nbudgets of educational stations in America. Administrators\ntoo long have had to guess at what might be a feasible\namount to be appropriated for these services. In some in¬\nstances, administrators havenft been certain as to hot; rauoh\nof the education-pie-dollar should be released to meet the\ndemands of thousands of parents, teachers, and organisations\nfor educational television.\nIf administrators have been in the dark, about the exact\nfinancial picture of educational broadcasting, so, ton, hove\nmany directors and managers» Through word of mouuh, grape¬\nvine, and vague rumors about what tfthe other fellow had for\noperating, the Directors have been given as confused a pic¬\nture as the one received by their administrators.\nThis study, only made possible by the willing and ex¬\ncellent members of the National Association of Educational\nBroadcasters, will attempt to eliminate some of the guess\nwork concerning the over-all budget picture of educational\nstations„\nAnother purpose of this study has been to determine\nthe number of people employed on various staffs. Few figures\nconcerning the number of personnel at educational stations,\nhas been available.\nOf particular Importance, too, is the amount of time\nor the number of hours of broadcasting being done at edu¬\ncational stations. This part of the picture has been\ncloudy; and, also, little has been known as to how great or\nhow limited have been the number of hours furnished to\nc omrnerc i al s tati ons.\nThe Procedure of the Study\nThis study was aided by the willingness of fifty-four\nNASD Directors'to release their operational figures. ^Tfis\nnumber of directors represented a little mere than fifty\nper cent of the NAEB station membership at the time the\nmaterial was gathered. In view of the fact that a svwoy-\nin-depth might have resulted In fewer responses, It was\ndecided that a fairly brief questionnaire, covering 1954\nbudgets, would be sent out. This technique resulted in an\nexcellent cross section of the stations in this country.. A\ncopy of the questionnaire, found in the appendix, was mailed\nto\" each Director,"
}