{
  "id": "d1077-62",
  "text": "58\nColleges and Universities, 10 Watts\nREMARKS\nMiami University, Oxford, Ohio\nWe also operate a carrier-current station WRMtJ scrae\nfifty plus hours per week. This station receives $1000.00\nstudent fee grant per year. It earns approximately\n$3,000.00 per year commercial time. Thus a total of\n$4,000,00 might well be added to arrive at a total broad¬\ncasting allocation picture.\nUniversity of Massachusetts\nWMAU is a student-operated enterprise, governed bv a\njoint student-faculty Radio Policy Board of 12 members.\nFinancial support comes from funds supplied bv the Student\nSenate; this year’s budget being $2,200.00. This figure\nwas hardly adequate, but at the time it was all that our\nStudent Senate \"could spare. By this time you must have\nrealized that WMUA does not have any full-time paid\nemployees; all personnel are members of the University\ncommunity. Programming is done with the advice of the\nUM Speech Dept.\nWMUA inaugurated FM operation this past fall after having\noperated as a carrier-current station for 4 years. Our\nGE 10 watt Fid transmitter was paid for by the Commonwealth\nof Massachusetts, as will our new studio facilities which\nare Included in the new Electrical Engineering Building\nnow under construction here on the campus. As more\nimprovements occur in both our physical plant and our\nprogramming we shall have to engage some paid personnel\nto carry out our hopes. As yet, however, nothing defin-\nate has'been determined along these lines.\nAs for TV, several UM faculty members were responsible\nfor organizing the Western Massachusetts Educational\nTV Council and this group has gone on to secure a UIIF\nchannel for Amherst,...\nNorthwestern University\n...I regret that it is not possible for us to break\ndown our budget into specific categories. WNUR operates\nas a part of the Department of Radio and Television and\nhas no budget of its own. Similarly it is impossible\nto isolate funds for television development from the\nbudget of the department,..."
}