{
  "id": "d61-20",
  "text": "K\napproximately 45 kc., is located quite far up in the triangular\nnoise spectrum. The level of noise fed to the subcarrier re¬\nceiver channel is almost as high as the AM noise, which would\nbe represented by OEFG. The subcarrier channel, therefore,\nhas a handicap which becomes greater as the subcarrier is\nmade higher. Some improvement may be obtained by the\nuse of frequency modulation pre-emphasis and de-emphasis,\nbut after all expedients have been used to improve the signal-\nto-noise ratio of the subcarrier channel, it is still as much as 40\ndb poorer than that of the main channel.\nSuch a signal-to-noise ratio distribution in a transmission\nsystem for binaural sound departs considerably from what\nwould be classified as the ideal system. The binaural system\nis only as effective as the poorest channel. Therefore, a sys¬\ntem which has an excessively high signal-to-noise ratio on one\nThe subcarrier receiver uses about five tubes and may be\narranged in the form of an adapter which is connected to\nthe detector output of any FM tuner or TV sound channel.\nThe adapter provides two outputs for the two loudspeaker\nchannels.\nOne possible arrangment for such a system is shown in\nFigs. 5 and 6. A Browning FM tuner is in the top section\nof the cabinet; below this is a Crosby Stereosonic subcarrier\nreceiver, whose two outputs are fed to the Fisher preamplifier-\ncontrol units in the next two compartments. Audio power\namplifiers are in the spaces below. An RJ speaker system\nis at each side of the cabinet.\nPerformance: The lower curve in Fig. 7 shows the difference\nin amplitude between the sum and difference binaural chan-\nFIG. 3, LEFT: NOISE IN STANDARD SYSTEM. FIG. 4, CENTER: SUM AND DIFFERENCE MULTIPLEXING METHOD. FIG. 7, RIGHT: S-N RATIO IMPROVEMENT\nI channel has its transmission range limited by the transmission\nrange of that channel. This makes satisfactory reception\ni possible only in areas of rather strong signal strength; as\nthe signal becomes weaker, the background noise becomes\nlouder in one channel of the binaural system in a rather an¬\nnoying manner.\nSum and Difference Transmission: An arrangement is\n.shown in Fig. 4 which can overcome some of the usual difficul¬\nties experienced in binaural FM transmission. This involves\nfeeding the sum of the outputs of binaural sources A and B to\none channel, and the difference between the outputs to the\nother channel. The sum of A + B is fed to the main FM\nchannel. This produces a level which may rise to a level\napproximately twice that of A or B alone. The difference\nbetween the two outputs, A - B, is fed to the subcarrier chan¬\nnel. This produces a level which may be considerably lower\nthan that of A or B alone. The actual difference in level de¬\npends on the microphone spacing used when picking up the\nbinaural material. For close microphone spacings, the dif¬\nference output is considerably less than the sum output.\nIn order to obtain maximum utility when the difference\ncombination is applied to the subcarrier channel, it must\nbe amplified by a factor K so as to fully modulate the sub-\ncarrier channel. At the receiving end, the output of the\nsubcarrier channel must then be attenuated by the same\nfactor before the sum and difference outputs are recombined\nto obtain the separate binaural outputs. Thus, speaker A\nreceives the sum of (A + B) + (A - B), or a quantity equal\nto 2A. Speaker B receives the difference between A + B and\nA-B, or a quantity equal to 2B. In this way, the two chan¬\nnels are separated.\nThe transformers in Fig. 4 are shown only for diagram¬\nmatic simplicity. In the case of the receiver especially, it\nwould be much more economical to use phase-inverter tech¬\nniques rather than transformers. When this is done, the only\nadditional circuitry required at the subcarrier receiver for the\nsum-and-difference system is one tube and a few resistors.\nnels. This curve was obtained by comparing visually the\namplitudes of the sum and difference combinations on a\ndual-channel oscilloscope. The binaural material which was\nused to obtain the data for this curve was obtained by Harold\nT. Sherman on experimental rehearsal recordings at Carnegie\nHall. It will be noted that the difference between the two\nlevels is greatest at the closest microphone spacing, 8 ins., at\nwhich it is approximately 14 db, and decreases to approximate¬\nly 10 db as the microphone spacing is increased to 12 ft."
}