{
  "id": "d1222-1",
  "text": "-1-\nTV TECHNICAL TIPS NO. 9\nJune, 19^5\nBy Cecil S. 3idlack, NAEB TV Engineer\nIt’s hard to believe that another month has rolled around and time for another\nNewsletter. Seems like we always write this column under pressure. Wonder why\nthe 25th of the month always finds us away from the office so that Jan is starting\nthe stencils before we even begin this.\nLooking back over the month several things of note seem newsworthy. First, work\non the Technical Directory was completed and the stencils sent to be mimeographed.\nThen copy for the second issue of the Engineering I-iewsletter was assembled, sten¬\nciled, reproduced and both placed in the mail. The Technical Directory went to all\nactive members, associate members, and those listed within, while the Engineering\nNewsletter went only to this Technical Directory list.\nSo far only a couple of bricks have come our way because we failed to list stations\nand staff; we dodged by stating that they had failed to return the Technical Direc¬\ntory cards. We thought we made things easy by addressing and even stamping them\nfor return. We knew we didn't have everyone and thought possibly they weren’t\ninterested so we'll try again - but don't wait for our letter. If your station and\ntechnical crew aren't listed we'd be mere than glad to include them on a correction\nsheet in the near future.\nThen, at long last, page proofs for the report of the first NAEB TV Engineering\nWorkshop went to the printer. We hope to have this in the mail soon.\nThe NAEB Engineering Committee met in Washington, D. C. the evening of May 22 and\nalso on Way 23rd and 24th. Five members of the Committee were on hand for the meet¬\ning. Tnose present in addition to Chairman Menzer of WSUI, were Brugger - WILL-AM-\nFK-TV, Kolmberg - KUOM, Ketcham - WOI-AM-FM-TV, and Kratt - WNYE. Bob Higgy of\nWOSU-AM-FM-TV was temporarily ill and unable to make the trip. Cy Braum of JCET\nand Cecil Bidlack NAEB TV Engineer were also present. Chairman Menzer had a very\ncompresensive agenda prepared, which the committee covered item by item.\nA great deal of time was spent in discussing the detailed program of the 1955\nEngineering Workshop. In the next Newsletter we hope to list complete details of\nthe program. Technical aspects of the NAEB Network were discussed at considerable\nlength and some exploratory work is being done on the cost of an experimental live\nnetwork with transmission from station to station on a \"round robin\" basis by FM,\nAM, wire or FM multiplex. A method of quality control for the tape network was\nalso considered. Mien the committee recommendations are carried out improved fre¬\nquency response is possible not only as regards the tape \"originals'1 but also the\nduplicates which network members receive. Some of you will be hearing more of\nthis venture and be asked to participate.\nChairman Menzer unlocked the door of the committee room Monday afternoon (24) and\nthe committee was able to visit the fine broadcasting equipment displayed at the\nNARTE Convention, a full report of the new developments in broadcast equipment"
}