{
  "id": "d1222-10",
  "text": "-IO¬\nMETER SO THAT THE DUPLICATING EQUIPMENT CAN BE MAINTAINED IN FIRST\nCLASS SHAPE WITH A MINIMUM OF EFFORT-\nLooks like WILL-TV, here at the University of Illinois, has become\nNo. lij. OF THE NON-COMMERCIAL EDUCATIONAL TELEVISION STATIONS ON THE\nair. The WILL-TV test pattern has been on a few times and John\nBrugger, WILL-TV Chief Engineer, and his staff are hot on the trail\nOF A NON-ARCING CONDENSER THAT WILL ENABLE THEM TO FIRE UP THE TRANS¬\nMITTER ON FULL POWER. By THE TIME YOU RECEIVE THIS, THE 12 BAY GE\nANTENNA ON THE TOWER OF ILLINOIS MEMORIAL STADIUM SHOULD BE RADIATING\nPROGRAMS ON CHANNEL 12. THIS WILL PROVIDE TV SET OWNERS IN THE\nChampaign-Urbana area with a chance to hear a second local station.\nUp to now many had no choice of programs except those on the local\nCOMMERCIAL STATION WClA ON CHANNEL 3*\nIncluded with this issue of the Newsletter is a copy of the report of\nthe NAEB Engineering Committee on new AM and TV equipment shown at\nthe 1955 NARTB Convention and Exhibition. It will go to all members\nas well as to those listed in the Technical Directory. Additional\ncopies may be secured upon request.\nOn June 22, the Federal Communications Commission adopted a proposal\nTO PERMIT TELEVISION STATIONS TO BE BUILT USING AS LITTLE AS 100\nWATTS EFFECTIVE RADIATED POWER. ORIGINALLY THE FCC PROPOSED LIMIT¬\nING THE 100 WATT STATIONS TO CITIES OF 5^,000 OR LESS; HOWEVER, IT\nFINALLY DECIDED THAT THERE SHOULD BE NO POPULATION MAXIMUM OR MINI¬\nMUM ANTENNA HEIGHT RESTRICTION AS LONG AS THESE LOW POWER STATIONS\nPROVIDE NECESSARY SIGNAL STRENGTH OVER THE CITY SERVED. THE NEW\nORDER IS EFFECTIVE AUGUST 1, AND APPLIES TO BOTH EDUCATIONAL AND\nCOMMERCIAL STATIONS.\nA NUMBER OF MANUFACTURERS HAVE DEVELOPED EQUIPMENT IN ANTICIPATION OF\nthis action. Where live vidicon cameras are used it is possible to\nOBTAIN COMPLETE STATION EQUIPMENT FOR ^$0,000. THIS MAY ASSIST IN\nTHE DEVELOPMENT AND GROWTH OF EDUCATIONAL TELEVISION SINCE EDUCATION¬\nAL INSTITUTIONS HAVING CLOSED CIRCUIT EQUIPMENT CAN OFTEN GET ON THE\nAIR FOR CONSIDERABLY LESS THAN .^0,000.\nThe Standard Electronics Corporation of Newark, N« J, has developed\nA NEW RADIO STUOIO CONTROL SWITCHING UNIT KNOWN AS \"StUDICOn\" WHICH\nENABLES STUDIO OPERATORS TO SELECT PARTICULAR CHANNELS FOR TRANSMIS¬\nSION OF THE STUDIO OUTiUT. THE ^StUDICOn” ELIMINATES THE NECESSITY"
}