{
  "id": "d1222-11",
  "text": "11\nFOR A MASTER CONTROL WHILE RETAINING THE ADVANTAGES OF A MASTER CONTROL\nSYSTEM. The FIRST INSTALLATION IS 3EING MADE AT WQR-AM-FM AND WILL\nEFFECT A SAVINGS OF $60,000 A YEAR IN OPERATING EXPENSES FOR THE STA¬\nTION.\nAudio connections are made to the \"Studicon\" simply with patch cords\nSO THAT INSTALLATION CAN BE MADE WITHOUT INTERRUPTION OF PROGRAMMING.\nThe IVOR facilities include twelve studios feeding four channels. A\nCONTROL SOX LOCATED IN EACH OF THE STUDIOS PERMITS THE OPERATOR TO SE¬\nLECT ANY OR ALL OF THE FOUR CHANNELS AND FEED THE STUDIO OUTPUT TO THE\nAPPROPRIATE CHANNEL. TALLY LIGHTS INDICATE \"CHANNEL IN USE11 AND \"STU-\nD|0 ON.\" An EMERGENCY LINE AMPLIFIER MAY BE SWITCHED IN IN EVENT OF A\nFAILURE OF THE OPERATING LINE AMPLIFIER, WITH A TALLY LIGHT INDICATING\nTHIS CONDITION. THE CONTROLS ARE DUPLICATED FOR EACH CHANNEL WITH AN\nELECTRICAL INTERLOCK SYSTEM PERMITTING ONLY ONE STUDIO TO FEED A PAR¬\nTICULAR CHANNEL AT A TIME. HOWEVER, BY USE OF A \"BYPASS\" POSITION IT\nIS POSSIBLE TO INTERRUPT A PROGRAM ORIGINATING AT ANOTHER POINT, AND\nWHEN THE BYPASS IS RELEASED, THE ORIGINAL OPERATING CONDITION IS RE¬\nSTORED.\nA NOTE FROM HERB EVANS OF WTHS-TV SAYS THAT THEY EXPECT TO HAVE TEST\nPATTERN ON THE AIR AUGUST 1 5 0N CHANNEL 2 IN MIAMI, FLORIDA.\nThe 22nd RCA TV Technical Training Program will be held in Camden,\nN. J. during the week of Sept. 26. This five-day series of technical\nLECTURES AND DEMONSTRATIONS WILL COVER BOTH MONOCHROME AND COLOR TV\nsystems. Reservations may be made through your RCA Broadcast Field\nRepresentative.\nMr. Clement E. La Fond has been hired as Chief Engineer for the Memphis\nCommunity Television Foundation. Mr. La Fond was formerly Chief of\nEngineering Instruction, Radio-Television Department of the University\nof Houston, Houston, Texas. His experience includes two years as en¬\ngineer at KUHT and five years at KUHF-FM where he assisted in the in¬\nstallation OF BOTH STATIONS. He RECEIVED A BACHELOR OF FINE ARTS DE¬\nGREE in 1951 and a Master of Arts degree in 1953 Radio and Tele¬\nvision at the University of Houston. For his master!s thesis, he\nTREATED THE VARIOUS PROBLEMS OF TELEVISION STATION DESIGN UNDER THE\ntitle, \"An Inquiry into the Basic Requirements for Television Station\nPlann1ng•\"\nr"
}