{
  "id": "d1222-15",
  "text": "Figure 1 is a block diagram of the present proposed system. Although the system\nis not yet completed, Mr. Idol believes it should perform satisfactorily. Drift¬\ning of circuits will result in a very slight picture displacement which will not\nbe too objectionable. A check on the adjustment may be made by transmitting a\ntest pattern from a studio and observing the picture received off the air. Adjust¬\nments may be made while actually on the air with little inconvenience or effect\non the received picture.\nAdmittedly this system is a fairly complicated one. However, even as development\nprogresses, simplifications present themselves, and, as they do, they are intro¬\nduced.\nMr. Idol hopes that readers of the Engineering News?_etter may have suggestions re¬\ngarding this problem. He believes IHat once tEe\"‘SetFoi^E’ studios begin operation\nand when multiple studio operation in Alabama becomes an accomplished fact, this\nproblem will, become very real to these localities too. He feels that by pooling\nideas we may be able to find a solution more readily.\nEditor1s Note: Due to the size of the block diagram of Figure 1, we were forced\nto use two pages for this diagram. However these are mimeographed so that you\ncan remove p. 17, join it to page 16 to produce the complete block diagram.\nNAEB Placement Service\n¥e*d like to call attention of technical personnel to the fact that NAEB is oper¬\nating a Placement Service here at NAEB Headquarters in Urbana. From time to time\nwe have inquiries from AM and TV stations who have positions open for technical\npersonnel. Unfortunately there are few, if any, names of technically trained\npeople in the Placement Service files who are seeking other positions.\nWe are not trying to entice you from your present position. If you are unhappy\nwhere you are, or are seeking to better your position, perhaps you should be reg¬\nistered with the NAEB Placement Service so that you may hear about these position\nopenings. There is no charge for this service. Your registration will be kept\nconfidential and your present employer will not be contacted unless or until you\ngive us permission.\nFor further information on the NAEB Placement Service, address your inquiry to\nRobert E. Underwood, Jr.\nNAEB Placement Service\nlb Gregory Hall\nUrbana, Illinois"
}