{
  "id": "d1222-3",
  "text": "-3-\nAnother development shown for the first time at the NARTB Exhibits was the RCA color\neffects equipment. By the use of a standard black and white vidicon camera, a color-\nplexer and other accessory equipment it is possible to originate color commercials,\nprogram titles,' and station identification color effects from black and white slides\nand art work. The black and white video signal is fed into the colorplexer and by\nthe use of a simple output switching system many varied color effects may be pro¬\nduced. The effects produced were in two colors such as red on blue, green on red\nor many other two color combinations as selected by the operator. Such a system\ncould be used for color station identification breaks or commercials adjacent to\ncolor programs without a full complement of color equipment. The equipment used\nfor producing these color effects would be required at a later date for color film\nreproduction or for live color originations.\nIn addition, RCA was displaying a new type live color TV camera chain, as well as a\nnew Universal Multiplexer for color TV broadcasting which permits multiplexing both\nsingle-V monochrome and 3-V color film camera chains so that the same projectors\ncan be used for both color and monochrome film projection.\nMany manufacturers displayed color equipment. General Electric had its field se¬\nquential system in operation which in conjunction with its chrcmacoder produced NTSC\ncolor signals. GPL was displaying a new 3-Vidicon color film camera. Dage display¬\ned a 3-Vidicon live industrial color camera about one-half the size of a black and\nwhite image orthicon camera. They were also showing a convertible monochrome to\ncolor vidicon film camera. % the use of one vidicon, monochrome film could be\nreproduced* By the addition of two more vidicons and necessary accessory equipment\nthe same film camera could be converted to color. Dage also had on display its com¬\nplete low power TV package, illustrating the possibility of equipping a TV station\nfor less than si>52,000. GPL had in operation monochrome live cameras - one of them\nremotely controlled as well as a 3-V color chain for film and slide. Philco exhibit¬\ned two complete operating 16 mm and 35 mm film systems, as well as a newly developed\ncrossbar switching system for local and remote video switching and a new dual light\nsource for its color scanner.\nWhile much color equipment was in evidence such equipment items as new MampliphaseH\n50 kw All transmitter was on display by RCA to be available later this year. Sarkes\nTarzian was showing a new line of vidicon monochrome equipment and new film pro¬\njector and slide projection equipment. Kay Labs were also showing vidicon monochrome\nequipment with one camera equipped with a Zoomar lens. General Communications had\na complete line of studio video and audio control equipment. Adler Labs displayed\ntheir low power TV transmitting equipment as well as satellite and booster equip¬\nment. Raytheon had a new high pov/er color telev: sion relay system on display as\nwell as a microwave audio channel. The latter makes it possible to transmit high\nfidelity audio over existing video relay links. They were also showing microwave\nrelay equipment designed especially for the transmission of field sequential CBS\ncolor from mobile or fixed locations.\nThere were displays of lighting equipment as well as color test equipment. Gates and\nRCA were both showing new 3-speed broadcast quality turntables. Gates was featuring\nits new Hi-Watter line of AM broadcast transmitters as well as audio control equip¬\nment. Obviously it is impossible to mention all those who were displaying equipment\nat the 1955 NARTB Convention* We have mentioned but a few to give an idea of its"
}