{
  "id": "d1222-7",
  "text": "7«\nThere you have a brief rundown of what has tentatively been lined up for the 1955\nNAEB TV Engineering Workshop.\nEducational television stations will soon have three microwave installations in\noperation linking together multiple studio operations. The first of these is at\nWUNC-TV at the University of North Carolina and has been in operation since last\nDecember. The other two microwave systems are those of the Alabama Educational TV\nCommission now in partial operation and the one at the Detroit Educational Televi¬\nsion Foundation.\nAt WUNC-TV, all switching between studios is done at the transmitter, located some\neight miles from Chapel Hill, N. C. This is also the location of the film chain and\nkinescope recorder. Studios are located at Chapel Hill, Raleigh and Greensboro.\nThe Greensboro circuit has a repeater station while the circuits to Chapel Hill\nand Raleigh are single hop transmissions.\nWith this type of operation, picture roll over becomes a problem due to the switch¬\ning of composite signals at the transmitter. Mr. Charles A. Idol, Engineer in\nCharge of the Raleigh studio, is making a study of the problem as a masters thesis.\nWe hope soon to be able to report on his solution to this problem.\nIn Alabama, to the best of our knowledge, only the circuit between Birmingham and\nMb. Cheaha (Munford) is in service. This is a two hop circuit as are the circuits\nbetween Tuscaloosa and Birmingham and between Mt. Cheaha and the Auburn studio.\nAn additional circuit with a relay point will be required between Auburn and An¬\ndalusia when the transmitter at Andalusia goes on the air.\nIn Detroit, the transmitter is located adjacent to the Detroit Public Schools studio\nand the system film chain. This location is corrected with studios at Wayne Uni¬\nversity, and the University of Detroit by microwave links.\nThe June 1955 issue of Tele-Tech has as a supplement a complete electromagnetic\nspectrum chart which shows all 1955 FCC Frequency Allocations.\na#*##*###*#\nGeneral Electric Co, publishes a handy capacitor and color code chart which should\nbe useful over your work bench. Write Mrs. G. Bamerick, Advertising Distribution\n& Supplies, Broadcast Equipment, GE, Electronics Park, Syracuse, N. Y. if you wish\na copy.\n####**#*•**#\nBerten Holmberg, Chief Engineer of KUOM has forwarded us copies of an 'article on\nmotion picture film winds, a paper classifying film stocks titled \"A” WIND OR nBn\nWIND — Which is it? We*11 include it in the next issue of the Engineering News¬\nletter, but if you wish a copy now, write to us at NAEB Headquarters.\nr"
}