{
  "id": "d1264-5",
  "text": "PERSONS REGISTERED AT RADIO INSTITUTE (Cont.)\nKoon, 0, M. — Ohio School of the Air, State Dept, of Education\nLambert, Richard S. — British Broadcasting Corp., London, England\nLaPrade, Ernest — National Broadcasting Oorp., New York City\nLeBaron, Harrison D. — State College, MontevalloAla.\nLeeder, Joseph A. — Dept, of Music, Ohio State University\nLewis, Earl W. — Stephens College, Columbia, Mo.\nLindTeyT^arTow — Ohio State Museum, Ohio State University\nMahan, Bruce E. — Extension Division, State University of Iowa\nMartin, A. E. — 152^ White St., Kansas City, Mo.\nMaynard, George — National Broadcasting Corp., New York City\nMelvin, Mrs. Edna — Reeb School, Columbus\nMenzer, Carl — Station WSUI, University of Iowa, Iowa City, la.\nMercer, C. H,.— Dalhousie University, Halifax, N._S.\nkichaelT R. JJ, -- Virginia Polytechnic Institute, Blacksburg, Va.\nMiller, Alice Floyd — Shepard & Lawrence, Inc., Book Trails\nMiller. Allen — University of Chicago\nMunguia, Enrique, Jr. — Mexican Embassy, Washington, D. C.\nNewton, Wm. — 42S S. Parkview Ave. , Columbus\nPalmer, Ruth — Ohio State University, (Student)\nPerry, Armstrong — U.S* Office of Education, Washington, D. 0.\nPhilput, Mary F. — University of Pittsburgh Studio of Station KDKA\nPierce, W. H. — Columbia Broadcasting System, New York City\nPitman, Paul M. — Station KPO, San Francisco, Calif.\nPowell, Garland — Station WRUF, Gainesville, Fla.\nPfTceT E..HT^-^Ohio State University, Dept, of Romance Languages\nRobe, T. S. — Frazeysburg, 0*\nRussell, John M. — Carnegie Corporation, New York City\nSalisbury, Morse — U.S. Dept, of Agriculture, Washington, D. 0.\nSayers, Frances Clarke — American Library Assoc., Chicago, Ill.\nSee, A. M. — Eastman School of Music, Rochester, N. Y.\nSmith, Iowa — Ohio State Archaoiogical Museum, Ohio State Univ.\nSmith, Sereno E. — Station WCAH, Columbus, 0.\nStarkie, Dr. Walter — Trinity College, Dublin, Ireland\nSulzer, Elmer G. — Station WHAS, University of Kentucky\nSutton, Vida R. — National Broadcasting Corp., New York City\nTaylor, Charles A. — Cornell University, Ithaca, N. Y.\nTaylor, G. Lloyd — Sparks Withington Co., Jackson, Mich.\nThomas, Cloea — Dept, of Music, Ohio State University\nTully, Frank — DeGraff, Ohio\nTyson, Levering — American Assoc, for Adult Education, New York City\nWaller, Judith C. — Station WMAQ, Chicago, Ill.\nWhite, Harry E. — British Museum, London, England\nWill, Roland G. — Ohio State University (Student)\nWilliams, Adolphus G. — l6lS Hunter Ave., Columbus\nWilson, H. Earl — Dispatch Publishing Co., Columbus\n■ Wright. Joseph F. — University of Illinois, Urbana, Ill.\nYoung, Josephine — National Broadcasting Corp., New York City\nZimmerman, George H. — Station WCAH, Columbus, Ohio\nA> 'Fb&VJ<c f, lUtuAp-ittk,\nyj/J, , Q HA « a lJ,"
}