{
  "id": "d768-10",
  "text": "COPY\n246 Mo. High Street\nPEOPLES BROADCASTING CORPORATION\nColumbus 16, Ohio\nNovember 2, 1953\nMr. Howard S. Frazier\nSuite 723, Bond Building\nWashington 5* C.\nDear Mr. Fraziert\nI have your letter about Mr* George Bernstein.\nMr. Bernstein was employed as my assistant from March, 1952 to March,\n1953. When we became dissatisfied with the operating results of our\nWashington radio station, WOL, I assigned Mr. Bernstein to that station\nas manager. He did a thorough job of analyzing the problem and made\ndrastic cuts in operating expenses through the re-organization of work\nassignments. This left us with surplus personnel and Mr. Berstein\nwas able to help those people get jobs in other places and leave the\nemploy of our organization feeling that they hat been treated fairly.\nOur business was largely concentrated in agilance accounts and\nMr. Bernstein, recognizing the changes taking place in Washington due\nto fancied or real fear or unemployment by government workers,\nconcentrated his sales activity in diversifying our accounts. He\naccomplished this task with some real success.\nWe sold WOL, subject to the approval of the Federal Communications\nCommission, because Mr. Bernsteinfs analysis of the situation convinced\nus that a 250 watt station in the Washington area was not a big enough\nproperty to carry on the type of programming that we wish to offer.\nMr. Bernstein was very honest in his analysis, although he recognized\nthat his recommendations would create a dislocation problem for him.\nOur radio organization is small, although we plan to enlarge. I do\nnot see a place where we can adequately use Mr. Bernstein’s abilities\nin the near future. I feel it would be unfair to attempt to hold him\non a job which would not exercise his full capabilities® The personnel\npeople in our owner organisation, the Farm Bureau Insurance Companies,\nfeel there is a possibility of placing Mr. Bernstein in our Insurance\nCompanies, but I do not feel this would be a satisfactory type of\nactivity for a man who has been active in the broadcasting industry.\nThe work would be entirely different, and away from Mr. Bernstein’s\nmajor interest.\nI wold be glad to discuss Mr, Bernstein with those who might be\ninterested in employing him, and will be pleased to recommend him. He is\nhonest, intense, and a hard worker — a man with good ideas and a high\nloyalty and understanding toward those to whom he reports and those whom\nhe supervises.\nSincerely yours,\n/s/ Herbert E. Evans\nHerbert E. Evans „ „\nVice President - General Mgr."
}