{
  "id": "d768-11",
  "text": "THE COOPERATIVE LEAGUE of the U.S.A.\nWashington Offices 125 Vermont Avenue, N.W., Washington 5, D*C.,\nNAtional 8-8765\nWallace J. Campbell, Director\nJack T. Jennings, Assistant\nNovember 4, 1953\nMr. Howard S. Frazier\nSuite 726 Bond Building\nWashington 5, D. C.\nDear Mr. Frazier:\nThis is in response to your request for information about\nGeorge A. Bernstein in connection with his application for a\nposition as station or sales manager, program director or\nassistant to executive, through your Broadcasters Executive\nPlacement Service.\nDuring three of the four years which I served as president of\nthe Cooperative Broadcasting Association operating Radio Station\nWCFM, George Bernstein served as our general manager, and since\nit was a small station, also had over-all responsibility for sales,\nprogramming and other operations, so that he has become well-qualified\nin each of those fields.\nAs you know, the FM section of the radio industry has been a\nstepchild, and any success achieved in that field takes on added\nimportance because of that fact. WCFM also had the handicap of\nbeing a forthright liberal station, and its cooperative ownership\nmy 1 o h vconfused some of the commercial people in the field.\nIn spite of these three factors which might normally be interpreted\nas handicaps in the industry, Mr. Bernstein was successful in raising\nthe stationfs revenue from s^800 a month to over 04,000 a month\nduring that period. At the same time he cut operating expenses from\n08,000 a month to $5,000 a month without sacrificing any of the\nexcellent programming for which the station has now become famous.\nUnder his initiative the Cooperative Broadcasting Association\nsponsored the organization of the WCFM Recording Company which\nrecorded and marketed its first half-dozen important recordings\nunder Mr. Bernstein*s management. The undertaking was doubly\nimportant because it was the only record company of its kind in\nWashington, and on the creative side, made it possible for\nWashington musicians to have access to recording facilities. Of\nparticular interest was the fact that a number of the recordings\nhave been made by the National Gallery of Art Symphony Orchestra\nunder the direction of Richard Bales. It was Mr. Bernstein who\nmade arrangements for this recording.\nMr. Bernstein left WCFM to become assistant to the general manager\nof the People’s Broadcasting Company in Columbus, Ohio, at a\nsubstantial increase in salary. You vmdoubtedly have further references\nfrom him in regard to that phase of his activities.\nSincerely yours,\nTHE COOPERATIVE LEAGUE\n/s/Wallace J. Campbell\nWalaee J. Campbell"
}