{
  "id": "d768-17",
  "text": "December 7, 1953\nMr* Harry Skorhla\nExecutive Director\nThe National Association of Educational Broadcasters\nGregory Hall - University of Illinois\nUrbana, Illinois\nDear Mr.* SkorniaS\n’ I am writing at the suggestion of Mr* Graydon Ausrmas\nof .the University of Alabama, with whom ‘I spoke today by telephone*\nI w&s introduced to Mr* Ausmus by a mutual friend of ours,\nRalph Steetle-» This letter of application is sent in the hope\nthat .1 may be considered to fill the position of Associate\nDirector of the National Association of Educational Broadcasters.\nRealising that it is difficult to outline some fifteen\nyears in the broadcasting industry in a:single letter of\napplication, I will endeavor to make this letter as informative,\nas possible*\nI am thirty-one years oldP married, and have twin sons*\nMy fifteen years in the broadcasting SM&ugtry\" started in 193$\nwhen I was a junior at Burg&rd High School, Buffalo,. New ibrk5\ndoing part time dramatics at WGR and WKBW, Buffalo* The next\nyear when I was graduated from Burgard. T accepted a full time\nposition with WHLD9 Niagara Falls, Neiw York, as Chief Announcer\nand later program director* From there 1 moved to WBNY, Buffalo,\nas News Editor, from whence I went into the United States Airforce*\nUpon discharge from the Air Force, November, 1943, X\nwent to Station WBEN (NBC) where I did the ESSO Reporter newscasts\nfor several years* VJhile with WBEN, Buffalo, I was the station?s\nSpecial Events and Public Affairs Director, and during this period\n(during World liar II'} I received a commendation from the United\nStates Treasury Department for outstanding achievement in the\nfield of' public service programming*\nIn 1945 1 was stimmoned to Washington, D. C0 to head\nup the Mutual Broadcasting^Systeias Special Events and Public.\nAffairs’-'Department imder B|dt44 Harris® This included the\npreparation and production of numerous public service and news\nprograms from the nation?s capital® In 1949 I was appointed\nWhite H^use Correspondent and subsequently H0use and Senate\nCorrespondent * My duties at this time Involved attending the\nweekly-. White House Press Conferences and spending the major pa©t\nof m3?- day on Capitol H|XXo In order to report accurately on House\nand Senate legislation, it was imperative that I keep in close\"\ntouch with the members of Congress, and it was during this period\nthat I made many vaL liable friends on the hill, friendships which\nare still very warm. Other duties included daily contact with the\nOffice of the Vice President of the United States, Departments of\nState, Defense and other Executive branches of the government and\nagencies, such as the Federal Communications Commission, Veterans"
}