{
  "id": "d768-20",
  "text": "December 7, 1953\n1240 Bryden Road\nColumbus, Ohio\ns COPY\nMr. Harry J. Skornia\nExecutive Director\nNAEB\n14 Gregory Hall\nUniversity of Illinois\nUrbana, Illinois\n* Dear Mr* Skornia:\nI enjoyed my very short visit last Thursday with you and\nMr. Hdlt. The problem of launching my projected Report in Europe with\nproper sponsorship and distribution in the United-States remains unsolved;\nand I suspect I shall be obliged to shelve this idea temporarily. A*\nyou well know, the category \"information specialist” in radio both\nin government and in private agencies such as RFE and the late RFA is\nvery much surplus right now$ and I, very frankly, have been casting\nabout for something to do since my return from the Orient.\nTo find something that is genuinely satisfying and\nabsorbing in institutional oc educational radio is also something of a\ntask? and therefore, I came over to Urbana to have a first-hand look\nat the organization of NAEB because, purely from hearsay, I was\ninterested. From my talk with you during your lunch hour, I gather\nthat there will be a specific*opening on the staff for a program\ndirector. This is emphasized, further, I note, in your letter to\nMr. Graham Hovey in Rome in which you point out the need for a o. ogram\ndirector who can and will handle administrative details particular\nto policy, program exchange materials, a kind of traveling liaison\nwith other NAEB members and one who can decide, perhaps, on what\nNAEB really wants.\nFollowing your suggestion, too^ that I might make\napplication for this job, I should like to make a tentative application!\nMy reservation being that an outline of exactly what duties are entailed,\nwhat authority and responsibility would accompany the job, and\nother lines and limits be made clear from the start. I hope you will\nagree that this is a reasonable demand! and I rather regret that I had\nnot stipulated this before when taking my assignment with the Rot Weiss\nRot in Vienna? and while being briefed for the job in Manila recently\nwith the Committee for Free Asia.\nI do believe that my past training and experience\ncould be profitably used somewhere in the NAEB hierarchy! and perhaps\nthl/5 job might be the very one which I could develop and (dare I say)\n\"grow in” on a long-range view. Perhaps you will understand, after\na series of short-term assignments, I am rather concerned that my next\njob in radio hold out the expectation of definite long-range work,\nprovided, naturally, things work out to mutual satisfaction. I gather\nthat NAEB is an expanding organization and shows signs of being here to\nstay! Perhaps you will see better than I how my qualifications and"
}