{
  "id": "d768-3",
  "text": "Curriculum vitae\nARTHUR ALEXANDER BARDOS, born April 26, 1921, in Budapest, ’Tungary,\nNaturalized citizen of the U.S. December 30, 1943* Married, no children,\nProtestant,\nEducation: Graduated from secondary school with highest honors in Budapest,\nHungary, A.B, in Cinematography: University of Southern California, 1943*\nM,A, in Comparative Literature: University of Southern California, 1948,\nCourse work and general examinations completed, with thesis in progress,for\nPh, D, at Harvard, 1951,\nLanguages: Fluent in German, French, and Hungarian.\nMilitary service: 1943-1946r U.S. Amy Air Force, Amy Specialized Training\nProgram, Psychological Warfare Division - SHftBF. Discharged with the rating\nof Technician 3rd grade. 1949-1952, 2d Lt., Military Intelligence Reserve,\nTeaching: 1946-1948: Teaching assistant in German, University of Sovthem\nCalifornia. 1948-1951: Torching fellow in German, Harvard University,\nB-rnadcflgtlng; While in military service, was assigned to the German service of\nRadio Luxembourg during its operation as the official voice of SHAEF; diJ in¬\ntelligence analysis and prisoner of war interrogations; wrote and spoke political\nand military commentaries; wrote features and radio plays for translation ?nto\nGerman or broadcasting in English; was assistant editor and editor, respectively,\nof youth and farm programs. After a year at Radio Luxembourg, was transferred\nas Associate Features Editor, to Radio Frankfurt, then center of the \"South\nGerman Network,\" serving the American Zone of Germany; discharged from military\nservice and employed by the War Department to continue to work at Radio Frank¬\nfurt.\n1945-1946: As editor, then Control Officer and, finally, acting\nChief of Station, participated in setting up what is now the \"Hessian Radio,\"\nin selecting and training a new programming staff, 5n introducing to Germany\nsuch radio techniques as round tables, newsreels, etc., and in organizing the\nfirst post-war German \"school of the air. \" Resigned position in order to\npursue graduate work,\n1951 to present: Radio Program Officer at the American Embassy in\nVienna, in charge of program operations for the three-station (210 kw) Red-White-\nRed network, covering most of Austria. While in this position, has worked for\ncloser cooperation between RWR and other European Eroadcasting organizations,\nintroduced such programs as the \"RWR World News Roundup\" and \"Arthur Meets the\nCritic\" to Austria, contributed to the greater political activation of the net¬\nwork in the U. S, interest. Was during a recent five-month period acting Radio\nOfficer, charged with full responsibility for the operation of the network."
}