{
  "id": "d768-31",
  "text": "f\nHr* Greydon Ausmus\nPresident\nNational Association of Educational Broadcasters\nUniversity of Alabama\nUniversity, Alabama\nDear He, Awmxmt\nAt the suggestion of Ralph Steetle, I am writing you a brief\nsummary of my background for possible consideration as Washington\nrepresouta11 ve of X1AES in the event such a position is created*\nI an SB yea rs old, married* father of a son, 3 (and antici¬\npating arrival of a second child}* I am a native of Washington.\nU.C. and have spent my entire life, with the exception of overseas\nArmy duty, in this city*\nAH my experience 1ms been in the field of writing* It in¬\ncludes five years on the staff of The Washington Post as sports\nwriter, city end national news events reporter and az assistant\ncity editor, the post I held when I resigned in June 1952 to accept\nmy present XK>sition* In addition, I served feu: 20 months in the\nWashington bureau of the Associated Press. Following V-B Pay, I\nwas assigned to the Army newspaper Stars and Stripes and subseauently\nserved ao European norm editor in Paris, covering Western Europe*\nUIlc Stars and Stripes, I also worked as a rev^felte man for\nthe European edition of tho Sew York Bor aid Tribune (old Paris Herald)\n& t & time when civilians were unobtainable •\nI also have writing experience in Government service. I v/orhed\nfor ten months in 1945 as & newsmen for the Office of War Information*\ncovering various Federal agencies and writing daily news stories for\noverseas transmission. Upon my return from Army service in Hay 1946,\nI Joined the public affairs section of the State Bepartme&t and served\nnntn -949 as a writer, handling special articles, mamohlets and speeches\nxor top DeparMtent officials, principal!y on econonic matters.\nIn my present position, I have been responsible for covering\neducational TV for the past 18 months cji& fool I am Intimately con-\nwith tiie 'Problem in this field. I have had weelOy contact\nwith Ralph Stcctle, Bob Mtollen and others in positions of leadership.\n^ °ourse, I have been re snortsible fen: covering news of\nofficial Washington — involving considerable liaison with the ECO*\ncongress and other branches of the Government concerned with TV problems."
}