{
  "id": "d768-35",
  "text": "Page 2\n(TetfT£tir>f\"- description...NAE . Associate\n3- MiMes\na. Newsletter.\nb. Numerous cojanittee reports.\nc. Thesos and other special papers submitted to NAEB for publication.\nd. Tapes and/or continuity (in emergencies).\ne. Reports from NAEB staff employees.\nf. Such items as listed under III, 1, above.\n4. amu^s.\na. NAEB Network personnel (Network Manager, Traffic Manager, Administrative\nSupervisor, packing, shipping and duplicating personnel).\nb. Other NAEB staff* Placement, Engineering, and Secretarial.\na. Keeping Executive Committee, Directors and proper eomoitteea and/or the£s\nchairmen informed of all except routine business. Policy checking.\nb« Close checking with all groups in related work* DAVI, UFPA, ETRG, JCET.\nI&CET, etc. and Foundations providing support.\n6. Negotiating\na. With Foundations, Corporations, Universities, labor unions.\nb. With publishers, recording companies, bidders for NAEB contracts,\napplicants for positions.\na. At dedications and conferences where NAEB must be represented (such as\nUNESCO, American Council on Education, Speech Association of America,\nMusic Educators National, Conference * American Association of Agricultural\nCollege Editors, Division of Audio Visual Aids fcf National Education\nAssociation), Joint Committee on Educational Television, an^ others)\nb. At NAEB national, regional and member-station conferences.\nc. Far visitors from abroad, guests and visitors at Headquarters.\n8< tottaa Btaateia.\na. Daily correspondence with NAEB members, NAEB officers, the general public,\nauthors, researchers, publishers, critics, grantees, Fulhright scholars, etc.\nb- Committee business and correspondence.\nc* Week-end and night-time emergencies.\nd. Traveling, helping members mend fenoes at home (meeting and reassuring\nsuperiors etc.), being where needed or meeting member-needs in advance if\npossible, almost instinctively. Helping plan local, regional, NAEB and/or\nnon-NAEB- sponsored meetings, workshops, projects to promote the cause of\neducational oanaunications, principally radio and television.\nft\nHarfy J. Skomia\nExecutive Director\nJanuary 7, 1954"
}