{
  "id": "d768-61",
  "text": "CONFIDE iTM\n3) Aim Arbor: From Detroit we went to Ana Arbor where w® visited the\nCenter, TJeriHCFwas possible for Cecil BicOLack also to get acquainted with\nthe staffs, as he had' done :5m Toledo sad Ifetro.it as well.\nThis was the first visit for both of us. We viewed a number of the films\nand kinss which the Center is distributing or planning to distribute. We settled\ndetails of approval of Grants-in-Aid in radio, based on the recoussendations of\nthe Grant-In-Aid Committee, and mm able to expedite this considerably while\nin town.\nDr% Hewtem and 1 drove from Ann Arbor to Jackson together and had an ex¬\ncellent opportunity for very basic discussion during this'time. This can be\nfurther reported on orally although 1 believe there was nothing essentially\nnew in the general agreement which continues to emerge regarding the way in\nxihich our two organizations see themselves as the on-going ones in the rhdio\nand television area, I have ’taken a very strong stand against say suggestion\nthat -the radio network could in any way be compromised as sn NABB operation\nat this terns, except as mentioned under the Jackson report below, Basic dis¬\ncussions revolved around reactions to the five-organisation meetings taking\nplace 3.12 Washington during the past few months. In this, too, general agree-\nrnent of the viewpoints of the MSB, the ETRC, and the FAS seem to be emerging,\nk) Jacksons Because of ay crowded agenda, Stanley Andrews and Francis\nByrnes of the iPAC were kind enough to corns to Jackson from East Lansing for\ndiscussions of common problems with Br, NeWburn and myself. The meeting was\nsuggested by me in answer to various questions recently raised by Andrews con-\nceriling' the desirability in our opinion of their possibly setting up a tape\nanchor film and film clip distribution and production facility.\nFrom the discussion it emerged that the job which HPAG intends to do must\nbe done largely throu^i commercial outlets. Educational, outlets, although ap¬\npreciated, would not provide adequate distribution. The problems of the ETRC\nand the NAEB, if faced with my attest to handle production and distribution\nfor the HPAG (except on a very limited basis) also would be insurmountable.\nFor both are geared to a much smaller distribution mechanism than the several\nhundred (commercial) stations the HPAG is interested in.\nBefore we broke up, 1 suggested teat we try to make available to the HPAG\nfor a trial offer to its agzdcnltnraUy-interested farm editors, one of our\ntaped agricultural series —» probably* & Grant-In-Aid production already avail-\nabl©* The Center would make available such a series also in television. Out\n°r exP®rieac® secured in this trial run Blight emerge the desirability of\nell of us endorsing the creation of perhaps a c omms relalXy- ope rated center\nfor distribution purposes only which could handle such jobs for all organisa¬\ntions, Tills does not mean that such a commercial center would take over the\nHetwork, However, when three hundred commercial stations ask for one of the\nMSB programs on tape, if all other clearances could be provided, tee distri¬\nbution job in this case could be turned over to such a Center,\nIn view of tee Center’s inability also to handle such large scale distri¬\nbution, this seemed tentatively of interest to teem as well. Following the\ndiscussion m had, tee HPAG left with the impression that the creation\" of either\na production or distribution facility by them out of Kellogg Foundation funds\nwas out of the question, since the job, once described, would be more compli¬\ncated than they at first thought."
}