{
  "id": "d768-63",
  "text": "CONF\nra 6) Since Wallace Gamean, in chaise of the Western State\nTeachers 0olTsg§7 FM station, had earlier told me of their acquisition of a\nmore powerful transmitter, which they were able to purchase from a Battle\nCreek comssercial FM station which had discontinued operations, im stopped\nhe-;re at his request to give him technical advice, provided by* Cecil B';disci-\nTb.e problem is essentially one of what to do to avoid interference with tele-\nvision as they go to the higher power, I believe this problem need not b®\nfurther outlined here since it-is a technical one.\nOne of the most ijaportant aspects of the acquisition of the mw trans¬\nmitter, is the fact that it was made possible by a grant from the W. X\nKellogg Foundation.\nGame&u had earlier called ms on this to see if 1 thought this would\nin any wsy endanger the HASBss relations or status with Kellogg, Since it\nwas a Battle Greek station that was involved., and since this was the first\nbroadcast problem in which Dr, Sesy (in the absence of Bob VanBuyn)» person-\nally- became interested, I told Wallace that Pm sure we wouldn't want* to hold\nhim up.\nIn mj meeting with Dr, Sesy, I expressed our pleasure at their support\nuo the ment of some f??£00, of this MEB member station,\n, 7) Chicago2 Last stop on the four-dey trip was the Conrad-Hilton Hotel\nwhere, by previous appointment, 1 spent a few hours with G. E, Griffiths of 9\nthe FAB. A number of the recent notes of which you have been receiving copies\nare *ehe outgrowth of this discussion. Also discussed with him were the meet-\n^ heid in Washington, the results of which the FAE will probably\n©waii-o before making any fundamental long-range commitments to anyone, and an\ninformal discussion of what sort of support would be adequate for the MEB in\nPossible discontinuance of the Kellogg grant and assumption of Wash-\noffice and public relations possibilities commensurate with our respon¬\nsibilities. -\nIn th~s context, I think xt is essential that we not delay unduly getting\nan answer out of Kellogg on the Washington office. For Mr, Griffiths indicated\nuo me vh® fact that they would like to take a look at a complete proposal for\nf total operation in cose m believe that we could assume all or a Por¬\ntion of the tasks and duties now carried on by other FAE financed organiza¬\ntions. TMs is strictly confidential and strictly conjectural and indefinite.\nHeedless to say, we both kept the discussion in this regard on an extremely\ngeneral am inconclusive level. However, the desirability of a statement of\nohe lung term rises! needs and plans of the EASE combining in a single picture\nour entire budget, regardless of' source, appears important* 1 hopefwith the\nhelp of Frank Schooley and Harold Hill, to have this readv for you at the time\nof the Directors5 Meetings in Hew York,\nIn a general wsy, I reiterated the general sort of statements I had ear-\nlx©*, mace in the coismeni/S on the Calkins questions which you earlier received.\nI should like to state that I have never left a meeting with Mr. Griffiths\nwithout feeling that a warm rapport exists. I believe he is convinced of the\nfact that we can and do, more economic ally than anyone else, perform msmy of"
}