{
  "id": "d768-89",
  "text": "II-C\nBenefits: When injury shall wholly and continuously disable the\ninsured to the extent that he is prevented from performing every\nduty of his occupation, he will be paid 50% of his base weekly\nsalary (at the time of his accident) subject to a maximum of $150\nper week for the duration of the disability with a lifetime maximum.\nIn cases of disability caused by sickness, he will be paid 50% of\nhis base weekly salary subject to a maximum of $150 per week for\n260 weeks, or to age 65, whichever occurs first. However, if\ndisability occurs after the insured’s 63rd birthday, and before his\n65th birthday, the weekly indemnity will be paid for the period of\nsuch disability, but not to exceed 104 weeks.\nNOTE: Any questions about any of the above insurance plans should\nbe directed to the Vice President’s office.\nRetirement Benefits\nEach NAEB employee employed through the University of Illinois\nbecomes a participant in the University Retirement System. For such\nemployees the Association shall contribute to the Retirement System\nsuch amounts as are required by the System: each such employee shall\nlikewise contribute the amount specified by the Retirement System.\nEmployees not employed through the University of Illinois are covered\nby Social Security, with the Association and the employee making such\ncontributions as are required by law.\nTIAA-CREF\nCertain executives of the Association, designated by the NAEB Board\nof Directors, will be eligible for inclusion under the TIAA-CREF\nplan. Payments, which vary according to salaries, are made monthly\non a matching basis, with the employee and the NAEB each paying\none-half of the monthly contribution.\nNOTE: According to a policy established by the Board of Directors\nin 1959, the President and Vice President have each received an\nincrement of 8.477% of their base salary, in lieu of a retirement\nplan. Since the institution of the TIAA-CREF plan for certain\nexecutives (calling for a contribution by the Association) this added\nincrement is reduced by the amount of Association contribution to the\nTIAA-CREF plan.\nVacations\nIn general, the following vacation periods, with pay, per year, will\nbe allowed:"
}