{
  "id": "d768-95",
  "text": "PURCHASING PROCEDURES\nWhen Purchase Orders Must be Used\nExcept for items costing less than $10 (which may be purchased\nby the use of Petty Cash), Purchase Orders are required for every¬\nthing except rent, salaries, tax payments, insurance, utilities, and\ntravel (see Travel Regulations for information about Travel Authori¬\nzation Forms).\nAuthorization Required\nPetty Cash purchases — Purchases of less than $10 where\npayment by check is not practical may be reimbursed from Petty Cash\nThe regular Petty Cash slip will be used and must be authorized by\nan appropriate member of the Administrative staff (See Ad:n. Staff\nlist.)\nPurchases of less than $50 — must be authorized by an appropriate\nmember of the Administrative Staff.\nPurchases of $50 to $500 — must be authorized by the appropriate\nDivision Executive Director, or, in the case of General Administration,\nby an officer of the Corporation.\nPurchases of $500 or more — must be authorized by the appro¬\npriate Division Executive Director(s) and an ificer of the Corpora¬\ntion, or, in the case of General Administration, by two officers of\nthe Corporation.\nProcedures - General Office Supplies\nGeneral Administration will maintain an inventory of all office\nsupplies except imprinted papers. The purchase of these supplies,\nand the maintenance of an adequate inventory, will be under the\nsupervision of the Secretary to the President. Persons wishing to\ndraw supplies will fill out a ’'General Supplies Requisition Slip,”\nand present it to the receptionist or the Secretary to the President\nin order to obtain supplies. The requisition slips will then be\ntransmitted by the Secretary to the President to the Accounting\nOffice so that the supplies may be charged to the appropriate bucket.\nImprinted papers will be handled as a separate item and subject to\nregular purchasing procedures.\nProcedures - Other than Office Supplies\nThe following steps will be followed:\n1. A ’’Purchase Requisition” will be prepared in duplicate by\nthe originating office with the proper authorization as indicated in\nthe \"Authorization Required\" paragraph above. For items costing\n$25 or more, the originating office must obtain at least two price\nquotations and explain selection of supplier. This information\nmust be attached to the original copy of ’’Purchase Requisition” and\nforwarded to the Accounting Office. The duplicate will be retained\nin the originating office."
}