{
  "id": "d1315-2",
  "text": "Class Range of Income\nR. 800,001— 900,000\nS . 900,001— 1,000,000\nT. 1,000,001— 1,250,000\nU. 1,250,001— 1,500,000\nV . 1,500,001— 1,750,000\nW . 1,750,001— 2,000,000\nX. 2,000,001— 2,500,000\nY . 2,500,001— 3,000,000\nz. Over— 3,000,000\nSection 3. CERTIFICATION OF INCOME.\nAnnually on the call of the Secretary-Treasurer of\nthe Association each active member shall certify\nto him its class based upon its volume but not\ndisclosing its actual volume in accordance with\nSections 1 and 2 above. The information con¬\ntained in any individual certification shall not be\ndisclosed to any person other than the President,\nVice President and Secretary-Treasurer. In the\nevent an active member is unable to determine its\nclass at such time it shall continue to pay dues\nbased upon its previous classification until it can\ncertify its class based upon its income of the past\nyear, at which time the dues payable on such last\ncertified class shall be retroactive to the begin¬\nning of the calendar year.\nSection 4. AMOUNT OF DUES—ACTIVE\nMEMBERS. The Board of Directors shall deter¬\nmine each year the dues applicable to each of the\nclassifications set forth in Section 2 above. The\nschedule of dues so adopted shall be mailed to\neach active member at least thirty days prior to\nthe beginning of the calendar year to which the\nschedule is applicable. Dues shall be paid in ad¬\nvance annually, semi-annually, quarterly or\nmonthly.\nSection 5. AMOUNT OF DUES—ASSO¬\nCIATE MEMBERS. The Board of Directors\nshall determine the dues for associate member¬\nships or various classifications thereof. Notice of\nthe amount of such dues shall be mailed to each\nassociate member coming within such classifica¬\ntion at least thirty days prior to the expiration\nof his or its membership year. Such dues shall be\npaid annually in advance.\nArticle VI\nDIRECTORS\nSection 1. GENERAL POWER. The Board\nof Directors shall determine the policies of the\nAssociation and shall direct its officers to do all\nthings necessary to carry out its policies. The\nBoard of Directors shall have power to take title\nto real and personal property in the name of the\nAssociation and to execute mortgages or trust\ndeeds on such property to secure payment of the\nsame and to borrow money in behalf of the Asso¬\nciation.\nThe Board of Directors by a two-thirds vote of\nmembers shall elect a President and Secretary-\nTreasurer upon such terms and conditions as it\nmay deem proper.\nThe Board of Directors shall have the power to\nenact, amend and promulgate Standards of Prac¬\ntice or Codes and to establish such methods to\nsecure observance thereof as it may deem advis¬\nable.\nSection 2. CLASSIFICATION, NUMBER\nAND ELECTION. No person shall be qualified\nto serve as a Director of this Association unless he\nis an active member or the duly certified repre¬\nsentative of an active member. The number of\ndirectors is hereby fixed at thirty.\nA. DISTRICT DIRECTORS. There shall be\none director elected from each of the seventeen\ndistricts. Directors from “even” districts shall be\nelected in even numbered years and from “odd”\ndistricts in odd numbered years. All such direc¬\ntors shall be nominated and elected in the follow¬\ning manner: At least sixty days prior to the ex¬\npiration of any District Director’s term of office\nsuch District Director shall fix a time and place\nfor a meeting of all active members having their\nmain studios or places of business in such dis¬\ntrict. The Secretary-Treasurer shall be notified\nand immediately upon receipt of such notification\nshall cause to be mailed to the accredited repre¬\nsentative of each active member in good stands\ning in such districts a nominating petition and a\ncertified list of all persons eligible to be nomi¬\nnated as District Director in each district respec¬\ntively. Each representative of an active member\nshall be entitled to place in nomination for Dis¬\ntrict Director one person whose name appears\nupon such certified list. The representative shall\nsign his name to the nominating form and return\nit to the firm of Certified Public Accountants\ndesignated by the Board of Directors within fif¬\nteen days of the date of the original mailing, and\nthe names of those nominated in each district\nshall be certified to the Secretary-Treasurer. The\nSecretary-Treasurer shall, not later than thirty\ndays before the date set for the meeting, as here¬\ninbefore provided, mail to the representative of\neach active member in good standing in such dis-\nC 3 ]"
}