{
  "id": "d82-18",
  "text": "PROGRESS REPORT July 18, 1963\nContract # OE-3-16-007\nA Pilot Series of Six Kits of Filmed and Published\nMaterials Illustrating Proper Teacher Utilization of Broadcast Materials\nProject Director- Dr. Clair R. Tetiemer\nOn February 16 and 17, 1963 the Utilization Project Advisosy Committee of five\nspecialists, the Project Director and Assistant Project Director held a planning meeting\nin Chicago, Illinois. The purpose of this meeting was to determine the phases of\nbroadcast utilization to be covered in the pilot phase of the project, the content to be\nincluded, and the method of presentation for each. At this meeting several particular\nphases of utilization were discussed and decisions were made as to the ones which should\nbe covered in these six demonstration kits of teaching materials. Following this the\ncommittee prepared an outline to be followed for each kit. Several names of people\nwere suggested to be contacted to draft preliminary scripts for each kit. It was the\nfeeling of the committee that in order to obtain the very best continuity throughout\nthe kits one writer should be employed to draft all six scripts. It was also felt that the\ncommittee^ experience and background in the field of utilization could be more easily\ntransmitted to one writer therefore reducing the chance that the work done by the writer\nwould not produce the intended product. A copy of this outline is attached.\nThe unanimous choice for the writer was Mrs. Marye Benjamin of Austin, Texas.\nFollowing the meeting the Project Director contacted Mrs. Benjamin to see if she would\nbe available to write the six script treatments. She accepted the project and agreed\nto do all six treatments.\nTo carry out a most important phase of the project, the promotion of the library service\nand the materials ?t will include,articles were written for the NAEB Newsletter and the\nRCA Educational Newsletter. A brochure announcing the NAEB Teaching Materials\nLibrary was also prepared and distributed through presentations at National and Regional\nmeetings and direct mail. A copy of this brochure is attached. From the responses to\nthe articles and the brochure a mailing list has been established containing the names\nof persons who wish to procure the kits of materials for use in their particular location\nas soon as they are available.\nIn order to further promote the library service the Project Director and Assistant Director\nattended the DAVJ Convention held in Denver, Colorado April 22, 1963 to April 26, 1963.\nDuring this time special presentations were mad® outlining the project and the materials\nthat would result. At these presentations and through direct contact several hundred\nbrochures announcing the library service were distributed.\nOn March 29 and 30, 1963 the Project Director, Assistant Project Director and Mr. Lewis\nRhodes representing the Advisory Committee met with the writer, Mrs. Marye Benjamin to\ngo over with her each of the outlines prepared by the committee. The purpose of this\nmeeting was to communicate to Mrs. Benjamin all of the information resulting from the\nmeeting of the Advisory Committee and to familiarize her with the necessary background\ninformation to write the script treatments."
}