{
  "id": "d82-35",
  "text": "SUMMARX OF PROJECT B-096\nMarch 23, 1961\nStudy of the Feasibility of Developing Demonstration Materials\nfor Classroom Utilization of Educational Broadcasts\nOne of the most serious problems facing educators when they\nbegin using educational broadcasts in their classrooms is\ndeveloping utilization \"knowhow\". Considerable agreement\nhas been reached as to the value of the teaching team approach\nwhen television or radio is used. Much has been learned about\nthe developmental and broadcast end of this team, but the class¬\nroom teacher, the second and possibly the most important swrober\nof the team, has been left to shift for himself. Local school\nsystems and a few other educational groups have made some\nattempts to help the teacher develop utilization skills. Pro¬\nbably the most serious deficiency In these utilization courses\nor workshops has been the lack of adequate demonstration material.\nThe purpose of this project is to explore the feasibility of\nmaking available to local groups, kits of materials to help them\ndevelop or improve classroom utilization of educational broad¬\ncasts. The kits are primarily intended to be used with groups,\nbut this does not preclude individual use. The project has\ntentatively indicated a need for three types of kits to be\ndeveloped. The first would be a complete demonstration kit of\nmaterial, these would be packaged in some mailing container\nform and would Include all of the films, slides, recordings,\nprinted material and instructions necessary to cany on a\ncomplete utilization demonstration. The second type of kit\nwould consist of an outstanding example of classroom broad¬\ncasting along with the necessazy printed material to permit\na local specialist to make a utilization presentation. The\nthird type of kit would consist of films, outlines and other\nutilization materials produced by other organizations and\ndistributed through a central library service. An example\nof this is the. Department of Audio-Visual Instruction of the\nNEA, film The Second Classroom."
}