{
  "id": "d82-60",
  "text": "APPEND I X D\nINSTRUCTIONAL TELEVISION PROGRAM SELECTIONS\nFOR THE PROGRAM EXAMPLE LIBRARY\nProgram T—101 “Animal Adaptation\"\nThis twenty minute television program Is from the series\nScience For You produced by the Milwaukee Public Schools.\nOne of the fundamental purposes for these telecasts is to\nbring to teachers and pupils those science experiences which\nmight not be possible In each classroom. This Is the 7th\nlesson In a 13 program series planned to help teach science\nin 4th grades. On this program the children discover how\ndifferent animals are adapted to eating plants or meats, or\nplants and meats. The lesson Is used as enrichment for\nregular self-contained classrooms.\nProgram T-102 \"Speech Time\"\nThis fifteen minute television program Is from the series\nCatholic Schools of Milwaukee Presents produced by the Depart¬\nment of Education, Archdiocese of Milwaukee. \"Speech Time\"\nis a course in speech improvement for first graders. It aims\nto Improve the speech habits of primary grade children through\nobserving the television teacher demonstrate the correct place¬\nment of sounds in Isolation, riddles, nonsense sylables, poems,\nand stories. These audio techniques are supplemented by video\nmaterials, such as pictures and charts. This program is a\nreview and shows many different visual and audio techniques\nused throughout the series. It Is an example of an excellent\nteacher who has very good eye contact, a relaxed personality\nand makes good use of getting children to respond to the\ntelevision teacher.\nProgram T-103 \"Poetry\"\nThis fifteen minute television program Is from the series\nStories produced by KETC Channel 9, St. Louis, Missouri. The\nseries of eight programs is designed for the primary grades.\nIt's main consideration is the children's enjoyment of books,\nthe beginning of a life-long habit of reading, \"Poetry\" Is\na simple presentation using two long poems \"The King's Break¬\nfast\" and \"Belinda and the Dragon\", and a number of short\nones. Visuals are used after the poem and harp music lends\nan extra something when the pictures are shown."
}