{
  "id": "d82-79",
  "text": "APPENDIX F (nine)\nKits specifically designed for utilization workshops\ncould be of tremendous value,, and would certainly reduce the\nstrain on those responsible for organizing said workshops.\nWe always attempt to collect pertinent publications for\ndistribution at our workshops, but Invariably miss some of\nthe most pertinent ones and Include some less pertinent. A\ncurrent bibliography (kept up to date) on pertinent research\nand projects Is frequently requested by workshop participants,\nand would be most helpful. I believe that materials Included\nIn such a kit should be of a general rather than of a specific\nnature due to problems peculiar to various locales.\nThis Is a very significant and challenging project which\nshould provide a real service to educational broadcasting.\nThe value of In-school broadcasting is measured by utilization\nThe nebula of our joint experience needs to be crystal!zed\nInto a useful tool.\nHr, David W. Marxer, Program Director\nBroadcasting Services, University of Alabama\nUniversity, Alabama\nLetter - March 22, i960\n* * * *\nToday's classroom teacher is both challenged and frus¬\ntrated by the task of keeping up with l) new methods and\ntechniques now available, thanks to the electronics and\ncommunication fields, and 2) the body of Information changing\nand Increasing with each new scientific or sociological ad¬\nvancement .\nLike Tennyson's brook, we teachers may \"go on forever,\"\nbut the boys and girls we teach are with us such a short time\nthat we need every available means of l) enriching our pro¬\ngram, 2) assisting us to use to maximum advantage every re¬\nsource that can be brought Into the classroom, and 3) making\nthe best instruction available anywhere - available everywhere\nHow rich a learning environment even I could provide for\nmy students If I had available and knew how to use the tele¬\nvised talent of Anne Slack, the Casals Master Class, the\nHeritage Series, Van Cllburn, Robert Oppenhelmer, Robert\nFrostl But how tragic If they are only guests In my class¬\nroom when they could become part of the family If I only\nknew what to do with them.\nHiss Wanda Mitchell, Director, Television Department\nEvanston Township High School, Evanston, Illinois\nLetter - June 19, 1961"
}