{
  "id": "d82-80",
  "text": "APPENDIX F (ten)\nAs the use of new media in the schools has multiplied\nover the past decade many who were working closely with\nthese media realized that they would be accepted or dis¬\ncarded In direct proportion to the training that the utilizer\nhad undergoneo\nA two-fold problem presented itself: one, there was a\ngroup of teachers already in-service without the necessary\ntraining; and two, there existed a lack of knowledgeable\npersonnel on the staffs of teacher education Institutions\nto do the proper training of pre-service teachers. Inasmuch\nas we were presenting telecasts to elementary and secondary\nclasses throughout the central portion of the State of Mich¬\nigan, Central Michigan University attacked the first problem -\nthe in-service teacher. We have, for the past two years,\ntaught a course, TV in the Classroom through our Field\nService Division, This course was structured on one currently\nbeing prepared by the Association of American Colleges of\nTeacher Education,\nAs a teacher of this course I was in the embarrassing\ndilemma of having to “talk about a visual11 medium because\nlittle was available In the way of demonstration materials.\nSoon I found that by begging friends at ETV stations I could\nborrow materials that demonstrated the studio teaching end\nof televised Instruction. Nothing was available, either\nvisual or printed, that had any demonstration value for the\nclassroom utilization area. It Is only within the last year\nthat printed materials have begun to appear in texts, booklets\nfrom DAVI, MPATI, the Ford Foundation, etc.; but still the\narea of actual visual demonstration materials remained barren,\nI understand that MPATI, and some others, have recognized\nthis need and are beginning to prepare materials of this\nsort for their own use. If there were only some way that\nthese materials could be made available to teacher training\ninstitutions and/or we could be made aware of their existence\nas they are developed. It Is obvious that the number of\nteachers with knowledge of broadcast utilization could be\nincreased many times over throughout the country.\nI have heard about the study that your committee is under¬\ntaking and wish to inform you of my wholehearted support,\nif not now, then whenever these materials are made available\nfor purchase or loan.\nMr. Lewis A. Rhodes, Director of Television\nCentral Michigan University\nMount Pleasant, Michigan\nLetter - June 16, 1961"
}