{
  "id": "d1733-0",
  "text": "N-A-E-B news letter\nNational Association of Educational Broadcasters\nMadison, filseonsin — June 16, 1937\nMEMBERS PICK ILLINOIS FOR 1957 MEETING\nThe 1937 annual convention will be held at the University of Illinois,\nin Urbana, on Monday and Tuesday, September 13 and 14 according to the choice\nof members in a mail poll. Both Cornell and Purdue had also extended cordial\ninvitations to be hosts to the convention this year*\nJos. F. Wright, manager of TOLL, will be in general charge of arrange¬\nments for the meeting. The URBANA-LINCOLN HOTEL has been designated as conven¬\ntion headquarters. Members are asked to send suggestions concerning the meetings,\nprograms, and other details to Mr. Wright. Further arrangements will be an¬\nnounced in the July NEWS-LETTER.\nEXCHANGE PACKET RECESS\nThe June exchange-packet will be the last regular mailing uMl early\nOctober when the stations* new fall bulletins are ready. Special mailings will\nbe handled if warranted. Members are asked to remmd their secretaries to send\nin their contributions to the \"exchange-packet\" on October 1.\nMORE MEMBERSHIPS RECEIVED\nRenewals of membership have been received from WNAD, University of\nOklahoma, and WOSU, Ohio State University, according to a report from Treasurer\nBrackett.\nDAMMON LEAVES WBAA POST\nClarence E. Dammon, who has contributed so largely to the growth and\nexpansion of Purdue*s broadcasting activities during recent years sends us this\nnote:-\n\"You might be interested to know that on July 1, I am retiring from\nactive charge of the station here at Purdue in lieu of a promotion in the ad¬\nministrative organization of the University. However, I shall continue an\nactive interest in the station and the development in educational broadcastmg.\nI shall remain a member of the University radio committee and have some influence\nin directing the radio policy* I believe I have made my contribution during\nthe past four years and it is now tie for a new man to come in and make a con¬\ntribution along the lines which we need strengthened.\n\"My new work will be as Assistant Director of Personnel for the univer¬\nsity in charge of personnel for a certain number of the schools. My work with\npublic relations will be expanded and I am to devote more time to industrial\nand business contacts. The whole set-up is very promising and I am lookmg forward\nwith considerable enthusiasm to the future in this administrative development.\n\"I don*t believe any mention of this is necessary. As I said before\nI will be keeping up an acti¥ interest and participation in the NAEB, and in the\npolicy shaping work of our activities here.\"\nCongratulations and lots of luck, Clarence! We know you*11 be a booster\nfor WBAA and radio education in your new capacity too. We do mention it because\nour members want to know of your advancement."
}