{
  "id": "d1733-6",
  "text": "5 -\nsuggest that those universities may be riding free on a ticket\npaid for by the universities which operate their own stations?\nDo I make myself clear? I am suggesting that the mere presence\nin the field of a number of educationally owned stations, ac¬\ncompanied by the threat of their growth and increase in power,\nmay have something to do with the amount of educational broad¬\ncasting heard over commercial stations. I know broadcasters who\nhave acknowledged that their educational efforts are considerably\ninfluenced by the agitation of educational stations and outside\norganizations. When you look about and make careful, or even\ncasual, observations, you are led to question the sincerity of.\nthe commercial broadcaster's interest in education. You suspect\na certain amount of \"window-dressing.\" You ask why educational\nprograms cannot be heard at favorable hours. You wonder how\nmuch present time allotments for education on the air could be\nmultiplied. You have a greater understanding of the problems\nand conclusions reported in the recent booklet, \"Four Years of\nNetwork Broadcasting\".\nSo we have a third answer for our question of Why the\nEducational Radio Station? It’s this, that there can be no\nguarantee of fairness and permanence for education which is de¬\npendent upon commercial outlets.\nI have a further comment for the gentleman who says,\n\"Why bother to operate your own university station? You can get\ntime from the commercial broadcasters\". The answer goes something\nlike this: We have in Madison two rather large theatres. They\nare pretty much on the red plush and gilt variety, \"showy\" in\nother words, but they are spacious, and the seats are comfortable.\nOccasionally those theatres are used for lectures or educational\nmeetings. Once- each year, for example, the Southern Wisconsin\nTeachers Association holds its general morning session there.\nThe theatres is fine for that purpose. It accommodates more people\nthan the nearest high school auditorium, and the theatre is con¬\nveniently located. But notice, I said that it's a morning meeting;\nthe theatre rniist be cleared by the time the show starts at one\noTclock. What about the afternoon sessions? What about the sec¬\ntional meetings for special groups? They must be held elsewhere,\nof course. Education hasn't a chance in competition with enter¬\ntainment under circumstances like that, and the same seems to apply\non the air.\nNo doubt school boards could save money by holding\nclasses in theatres, in town halls, churches, and vacant stores.\nBut public-spirited citizens, recognizing the peculiar needs of\neducation, are not content to compromise on buildings and equip¬\nment. They recognize the importance of providing a home for\neducation, with unrestricted hours for its use. They are not\nsatisfied merely to take what space they can get in a plant owned\nand controlled by another agency. Educators with a similar broad\nview of educational broadcasting will not make education sub¬\nservient to advertising and entertainment. They will insist upon\ncontrolling and operating facilities."
}