{
  "id": "d1733-7",
  "text": "6\nBut what the cost to a university owning and operating\nihnnr^trGnSflt:'CI,? 1 find thorc is considerable misapprehension\nabout the costs incurred in.the technical operation of a station.\n?rei-1?^er that an institution engaged in educational broad-\nst^ff a transmitter of its own must nevertheless provide\n{“Cilities.ior program planning and production, for\n®publicity, and secretarial work. It should have\n^udl0J ?? lts own campus to accommodate rehearsals and\nbroadcasts, and it may have to provide travel funds to send\nst?dios located in other cities. In considera-\n?£ a4 these items, the - extra cost for actual transmitter\n^nvestment and operation adds relatively little to the total\nr^lete. cost.for all operating expenses of the '\n4 4 * th? university, including technical expense,\n££°fram Production, staff, and administration, is less than one\ncent per year per citizen in the reception area.\nAside from the independence enjoyed by the institution\noperating its own station, there are other benefits. Who can\n?2inSa4,for examPi°> the good that comes from sending out into\ntine world groups of student workers trained in radio, with edu¬\ncational backgrounds, standards of appreciations, and critical\nlistening habits developed at a university station? And who\nwould belittle the social value of a fine university station\nwnicii sets a standard by which commercial service is compared and\ncontrasted? We see frequent evidences of this cultivation of\nbetter tastes and more critical listening in the areas served by\neducational stations. Such improvement of standards has definite\nsocial.value, and of course the answer to this whole question of\neducational or commercial operation of stations should be based\nUj?<?n, 5\" consideration of the ultimate, not the immediate, expense\nand the ultimate return to society.\nbave, then, these reasons for championing the cause\nof the euucational broadcasting station: (a) the experience of\nthe past demonstrates the wisdom of preventing unlimited explojta-\nt^on.o£ Public resources, (b) we must provide for perfect freedom\nof euucational communication, (e) there is no guarantee of adecuate\ntime and permanence-for education over commercial stations, and\nlastly, (d) educational stations contribute definite social values\nresulting from the training of personnel and the-1 cultivation of\ncritical tastes. The educator who sees these factors and the many\nothers involved will insist upon independent operation of radio\nfacilities. His conscience and his sense of social responsibility\nwill not let him shift to merchants and manufacturers the final\ndecision on questions of policy relating to use of the radio. '\nSomething there is in the educator that cries out for the oppor¬\ntunity to experiment with the fine art of living free from control\nof the experiment by persons or groups engrossed in conducting\na business.\nTnis opportunity, for the s«ake of the future and in spite\nof any failures of the past, we claim for the educational institu¬\ntions of America.\nThatf s why — the educational radio station."
}