{
  "id": "d1508-2",
  "text": "NAEB NEWS LETTER\nPage 3\nOctober I, I942\nBus. I C £.1.1 ,UATJ.QiL\nProblems which might involve the non-profit educational, municipal stations\nAS A RESULT OF THE PETRILLO ACTION IN STOPPING MUSICIANS FROM RECORDING\nAND TRANSCRIBING MUSIC WERE DISCUSSED. THE ASSOCIATION INSTRUCTED\nPresident Engel to appoint committee to study the problems resulting\nFROM THE PETRILLO ACTION AND TO BRING IN ITS FINDINGS AND POSSIBLE\nrecommendations at the November meeting of NA£8 in Chicago. Novik and\nHanna were nameo to the committee.\nStation Reports\nIn a round-robin report of station activities were heard some of the\nfollowing interesting data* Mike Hanna for vVHCU, explaining that he was\ndirectly responsible to President of Cornell for operation of his station;\nCarl menzer telling of a new transmitter# new studios, and change in power\nT0 5 KVVJ?av and n,qht w8th directional antenna; Novik, WNYC - his station\nGIVES 485* OF ITS TIME TO WAR EFFORT PROGRAMS, 60$ OF ALL TIME TO MUSIC»\n20/a OF MUSIC IS LIVE, WNYC WON VaIRIETV AWARD, 2 ALVAROS AT. OHIO STATE,\nAND REBROADCASTS IMPORTANT PBULIC SERVICE PROGRAMS; LEE NcnVELL, 8 NOIANA,\nTOLD OF REMOTES FOR WHAS AND I NO IANAPOL1 S1 BOS COLEMAN, V;KAR# TOLD OF\nCARRYING AT LEAST 50/» MUSIC, PROGAMS FOR 10 STATE EPARTME.VTS, HAVING\nGEOGRAPHY OF NEWS, AND HAVING AVAILABLE FOR USE AP. UP, AND tNS; GRIFFITH\nTOLD OF WAR TROUBLES, INCLUDING LATE SUNRISE; (-;\"0f ~ JENNINGS FOR CHICAGO\nRaoio Council strebtidd upcoming School Broadcast Conference, November\n10-12; Mac McCarty told of Dear Sir (and later .used Scmooley ano Major\nKent on program), us ft of classroom broadcasts on WHA* Jensen told of\nPROBLEMS BEEPING OPIRATORS AT WCAL, OF OPERATING 33 HOURS A WEEK, IN¬\nCLUDING 12 on Sundays and of carrying Wake Up, America, direct from the\nBlue Network; Joe Weight told of Sunday operation, new electric organ,\nNEW STUDIOS, WAR PROGRAMS, ETC. FOR WILL; M|K£ HaMNA EXPLAINED THE SALE\nTO TIME SUPPORTS ALL WHCU BROADCASTING, He 1S DIRECTLY RESPONSIBLE TO\nCornell president, runs three MM# workshops, has full tim6 staff, feeds\nCBS AVERAGE ONCE A WEEK AND CARRIES MANY CBS EDUCATIONAL PROGRAMS.\nOther Highlights\nDean F. 0. Holt, University of Wisconsin Radio Committee, welcomed the\ngroup. Major Harold W. Kent, War Department, gave one of his usual\ntypical inspiring yalks (which we'll leave off the record); w. I. Griffith\nJOINED WITH OTHERS IN AGREEING TO HELP WANTED PROGRAM8 (SINCE MEETING\nHE'S HAD WORD FROM JOHN J. CORSON, CHIEF OF INDUSTRIAL AND AGRICULTURAL\nEmployment, War Manpower Commission, saying: “The last of essential\nOCCUPATIONS IN THE COMMUNICATIONS INDUSTRY HAS NOT SEEN J 3SUED, BUT IT IS\nUNLIKELY THAT OTHER THAN TECHNICIANS WILL BE INCLUDED “OR “ME RAO? 0 IN¬\nDUS TRY* .... A3 OF SEPTEMBER I8)..»CaRL MeK2ER LEO BRIEF DISCUSSION ON\nEQUIPMENT PROBLEMS...Griffith WANT? ScHOOLEY to LIST THE NAME OF THE\nGates Radio and Suih\\»ly Company, Quincy, III. which has issued the pam~\nphlet, \"Keeping on the a §r*.a..Treasurer Griffith reported presence of\n$691.92 in NAEB treasury as of September 12...Schooley made an optimistic\nreport as Executive Secretary (optimistic at Menzer's request;...Some\nof the boys got wet in Fuller's boat on the Wisconsin lakes...All en¬\njoyed an outing Friday evening at Blackhawk Lodge"
}