{
  "id": "d1862-10",
  "text": "-10-\nMr. Griffin suggested that the best answer to the world problems\nof ignorance, propaganda, and political and economic under¬\nstanding is to develop everywhere the best educated people\npossible, and then to rely on their best judgment for achieving\na peaceful world.\nProfessor Harold Lasswell also provided food for thought\nfor educational broadcasters. With political conventions in\nthe offing he pointed out that the U. S. two-party system is\nso fluid, with senators and representatives crossing party\nlines so freely, that a little well-placed and informed effort\ncan often be very productive on specific problems. He ques¬\ntioned whether our foreign policy is as much a result of plan¬\nning as of the pressures of the day. He regretted the decline\nof courageous outspokenness: The bright student is \"bright\nenough to keep his mouth shut.” People are inclined to with¬\ndraw from security risks, or to deny (in applications or forms\nthey must fill out) contacts with people whose sincere and\nminority thinking might not be popular. He raises the ques¬\ntion of the invasion of privacy (hidden microphones, phone\ntaps, drug confessions etc.), but he regrets even more the in¬\ndifference of people to this invasion.\nHe pointed out the dangers of decline of local autonomy:\nthe tendency of people increasingly to do as is done in the\nsocial, economic, and political layers above us. He regrets\nthe growth of public apathy and the alienation of people from\npublic affairs and asks whether we*re trying to run a social\nsystem without conscience, and failing to build conscience and\nregulators into our children.\nIn brief he called for more serious awareness of the pos¬\nsibilities of mass media for meeting some of the same problems\nof our democracy that Walter Lippmann has so courageously\nand clearly brought to our attention.\nHenry Cassirer1s addresses at the NAEB Luncheon and Plenary\nSession on the IERT presented an excellent picture of tele¬\nvision around the world, and of the serious role that radio\nstill must play, particularly in those countries which will,\nfor the foreseeable future, not be able to afford TV sets for\nhome listening. He mentioned the great growth of Rrench tele¬\nclubs and group listening and discussion developments in\nJapan and in Italy where 7,000,000 people see TV in public\nplaces but where only 200,000 sets have been sold. On the in¬\ncome base of many people in other nations, radio is the only\neconomically and technically feasible contact individual\nfamilies will have for some time with the wireless mass media."
}