{
  "id": "d1862-15",
  "text": "-15-\nWESTERN RESERVE UNIVERSITY TELECOURSES\n(Harold E. Hill, Associate Director, represented the\nNAEB at the Third Chicago Area Educational Television Con¬\nference April 28, at the Illinois Institute of Technology.\nFeeling that the talk given by Dean Leslie E. Brown, Cleve¬\nland College, Western Reserve University, contained information\nof value to all institutions planning to offer telecourses,\nMr. Hill has prepared the following summary, based on notes\ntaken at the Conference.)\nDean Brown opened his remarks by pointing out that the\nproblems of an educational institution broadcasting over a\ncommunity ETV station are much the same as those of an institu¬\ntion broadcasting over a commercial station, in that in neither\ncase does the institution have control over more than a very\nfew hours of the program schedule.\nDean Brown outlined the administrative organisation\nwhich Western Reserve has set up for giving telecourses. The\nUniversity has a Broadcasting Council of five faculty members\nand four administrative officers, appointed annually by the\nPresident. This Council has control of the University*s weekly\nradio roundtable, the Sunday afternoon TV program and the tele¬\ncourses. The University administration feels that the faculty\nshould have control of telecourses, and no telecourse is offered\nthat isn't a course that is a regular part of the University's\nofferings.\nIn October or November of each year the Council tenta¬\ntively selects six or eight courses to be considered for broad¬\ncast the following academic year. Four of these are finally\nselected for airing. Two three-hour courses are offered each\nsemester - one on a MWF sequence and one on a TTS sequence, so\nthat there is a solid half-hour block, Monday through Saturday,\nat the same time every day. After the Council makes the final\nselection of courses to be offered, Dean Brown works with the\ndepartments concerned and all plans are made at the same time\nthe department is drawing up its regular schedule and teaching\nassignments for the following year. They have an agreement,\nfor two years in advance, with the station (WEWS) for a set\ntime for the broadcasts - always in the morning, of course.\nThe telecourses follow the same vacation schedule as the\nregular University courses.\nBrown works with the instructors assigned to the tele¬\ncourses on preparation of a home study guide. The study guide\ncontains a summary of each lecture to be given in the course."
}