{
  "id": "d1862-18",
  "text": "-18-\nWestern Reserve does not have a correspondence division,\nso all written assignments from telecourse students come to\nBrown1s secretary who has the responsibility of getting them\nto the instructors concerned and then getting them back. They\nhave no problem with telecourse students falling behind\nacademically, although they may fall a little behind in getting\nin assignments once in a while.\nThis detailed reporting of Dean Brown1s talk is not meant\nto imply that the rest of the conference was less valuable.\nMany important contributions, which time and space prevent\nour reporting on here, were made by such speakers as Jim\nRobertson, Program Manager, WTTW; George Crothers, Director of\nEducational and Religious Broadcasts, CBS; Ned Rosenheim,\nDirector of Radio and TV, University of Chicago; Warner G.\nRice, Chairman, Department of English, University of Michigan;\nBrice Harris, Chairman, Department of English, Pennsylvania\nState University; and Henry J. Knepler, Coordinator of Educa¬\ntional Television, Illinois Institute of Technology.\nTwo additional comments, it would seem, are worthy of\nattention here, in view of the increased attention being paid\nto the role of educational TV. Jim Robertson, in reporting\non WTTW’s progress, pointed out one very serious public rela¬\ntions problem that faces WTTW, as well as all educational\nstations: How do we make those persons who happen to see\nsomething they don’t like on an ETV station aware of the fact\nthat somewhere else in the program schedule there are probably\nprograms that will be of interest to them? This job of \"public\neducation\" about the many possibilities of ETV is one of the\nmost important facing educational broadcasters.\nThe other comment we wanted to underline was made by\nGeorge Crothers. He likewise posed a problem: Are ETV\nstations going to teach listeners a specific subject, or are\nthey just going to arouse the interest of listeners so that\nthey want to find out more about the subject on their own?\nSurprisingly, in view of the fact that commercial broadcasters\nare rarely in a position to do so, Mr. Crothers did not seem\nto feel that ETV broadcasters should attempt to fill the\nformer role. On the contrary, it seems to us that this is\none \"void\" with which educational broadcasters should concern\nthemselves.\n*****\nPlease have information in for the Newsletter in by the\n25th of the month."
}