{
  "id": "d1862-23",
  "text": "*24-\nFor public relations programs, the responsibility in about\nhalf the institutions reporting is to the president, the\nresponsibility for academic training is most frequently to the\ndean of liberal arts, and in nearly two thirds of the institu¬\ntions reporting Radio-TV is organized as a department.\nThe Committee reports it is difficult to make any conclud¬\ning remarks regarding the administrative relationship between\nRadio-TV organizations and departments of Audio-visual aids,\nPhotography, Drama, Journalism, or Speech, except to say that,\nin a majority of cases among the schools replying, some ad¬\nministrative relationship does exist. The two most common\nrelationships are: Radio-TV under the administrative supervi¬\nsion of the Speech Department, and Radio-TV in the School of\nCommunications•\nMiami University is now engaging in closed-circuit tele¬\nvised education as a result of a grant from the Fund for the\nAdvancement of Education. This operation is a part of a\nlarger research project sponsored by the Ford Foundation and\ndesignated as ESIP (Experimental Study in Instructional\nProcedures)• Looking forward to great increases in enroll¬\nment at colleges and universities, it is hoped through this\nstudy to pursue further the possibilities of television as a\nmeans of solving the coming educational crisis.\nFour classes via television are being taught this\nsemester. These originate in the University1s new television\nstudio and are sent by coaxial cable to classrooms in another\nbuilding. In each classroom there are two 21M monitors with\nfifteen to twenty students watching each.\nCourses being taught include Human Biology, Educational\nPsychology, Physiology and Sociology.\nA listing of theses and dissertations on radio-television\nsubjects from the University of Southern California is avail¬\nable from Kenneth Harwood, Chairman, Department of Telecom¬\nmunications, University of Southern California, University\nPark, Los Angeles 7, California."
}