{
  "id": "d1169-0",
  "text": "n\nA E B\nm\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. 29, NO. 5\nMAY, 1964\nNAEBers Attend International Conference\nWilliam G. Harley, Richard Hull, and Vernon Bronson offi¬\ncially represented the NAEB at the recent international edu¬\ncational broadcasting conference in Tokyo. They were invited\nto participate by the hosting Japan Broadcasting Corporation.\nHarley talked on ITV in the U. S. at the plenary session;\nHull served as president of the commission on correspondence\ncourses through broadcasting; and Bronson reported on the\nNAEB Samoan project at the session on technological aid to\ndeveloping countries.\nOther NAEBers who were conference observers were\nTedson Meyers, Jack McBride, Paul Rickard, Harold Wig-\nren, and R. C. Williams. No NAEB funds were used by\neither participants or observers.\nNAEB President Harley, along with Basil Thornton and\nJack White, met two days more at the request of the U. S.\nDepartment of State concerning a U. S.-Japanese information\n*—v exchange center on ETV materials.\nDivisions Will Have \"Day\" at Convention\nMembers of various NAEB Divisions will meet in sessions\ndivided along Division lines on one day of the coming con¬\nvention in Austin. Members should notify their Board mem¬\nbers of topics they would like covered.\nRadio Seminar Booklet for Sale\nNational Educational Radio: A Blueprint for the Future, the\nreport of the NAEB seminar in Chicago January 29-31, 1964,\nmay be obtained for $1.50 a copy from the NAEB publica¬\ntions office in Urbana.\nACBB Announces May 26 Program\nAgain this year the American Council for Better Broadcasts\nwill meet in conjunction with the IERT. Among those on\nthe program will be Edward Stanley, director of public af¬\nfairs for NBC, who will speak on problems of programing.\nThose who will discuss his speech are Garnet Garrison, di¬\nrector of broadcasting, University of Michigan; Warren R.\nEbinger, from Kansas City, Missouri; Mrs. Louise Walker,\nsupervisor of schools, Montgomery County, Maryland; and\nFrederic Heimberger, vice president of Ohio State University.\nBurton Paulu, director of radio and TV broadcasting, Uni¬\nversity of Minnesota, will speak at the luncheon—a first-hand\nobservation of how European newscasters regard American\nnewscasters. Other topics slated for the day concern local\nprograming (WAGA-TV, Atlanta), the broadcaster’s influ¬\nence on the use of words, and team teaching.\nThe ACBB will convene at 8 a.m. May 26; the IERT\nbegins that evening and continues for two days. Registration\nfor ACBB is free (except for the luncheon, which is $3) for\nIERT participants, $1 for others. Meetings will be at the\nColumbus Plaza, 50 North 3rd Street, Columbus, Ohio.\nETV Division Names Appy VP\nGerard L. Appy has been appointed vice president of the ETV\nStations Division of NAEB, effective May 1. Appy comes to\nthe NAEB from the University of Georgia, where he was\nassociate director of the Center for Continuing Education.\nGUNN JOINS TV BOARD\nHartford N. Gunn, Jr., has been appointed to the NAEB TV\nBoard replacing Appy. Gunn is general manager of the\nWGBH Educational Foundation, Cambridge, Massachusetts.\nNew NAEB Institutional Members\nRADIO DIVISION\nMarshall University, WMUL (FM), Huntington, West Vir¬\nginia ; Western Illinois University, WWKS-FM, Macomb,\nIllinois.\nSUSTAINING\nThe Crowell-Collier Publishing Company, New York\nINTERNATIONAL ASSOCIATE\nThe Instructional Television Trust, Tel Aviv, Israel. This is\nthe first member in this category.\nINDIVIDUALS\nIn the last two months, there have been 88 new Individual\nMembers.\nRegion VI Forms Networking Committee\nA regional committee is studying radio networking affairs\nfor NAEB Region VI. Core members of the group were ap¬\npointed by John Witherspoon, the region’s Radio Board rep¬\nresentative, when Region VI met in conjunction with the\n1964 Western Radio & TV Conference in late February.\nThere were two sessions at the regional meet—one for\nall members, primarily to discuss the NAEB reorganization,\nand another for the Radio Division.\nFilms and Tapes Available\n• Stations may obtain free films for sign-on or sign-off—\nfeaturing the Salt Lake City Mormon Tabernacle Choir at\nMt. Rushmore singing “America the Beautiful” (2 minutes)\nand the National Anthem (1 minute). Write: Publicity Di¬\nvision, South Dakota Department of Highways, Pierre, South\nDakota.\n• Radio stations can obtain a series of programs in Spanish\nabout Spain for a $2 handling charge per program. The 20-\nminute programs, entitled Espana es Asi, are being produced\nby professional talent and feature the history, art, amusements,\nfood, and music of each of the 52 Spanish provinces. Write\nG. L. Vazquez, Jr., Educational Programs, Musica de Fondo\nMotivacional y Para Deleitar, Belmusic, Jose Antonio, 57,\nMadrid 13, Spain.\n1"
}