{
  "id": "d1169-1",
  "text": "News Notes\nPROGRAMS\n^ WMSB, Michigan State University, has presented a four-\nprogram series called “Film Experimental,” which examines\nnew techniques in filmmaking. Talented filmmakers presented\nsamples of their work and then joined host Arthur Weld, as¬\nsociate professor of TV and radio, in discussing the reasons\nand symbolic meanings of their films.\ny Abilene (Texas) Christian College has produced several\naward-winning radio programs recently. A special program\nprepared for the Mutual Broadcasting System during the\nChristmas season won a first-place award in the honors com¬\npetition of the Southwest District of the American College\nRelations Association. Another program, “The Story of Our\nFlag,” produced and announced by Lowell G. Perry (direc¬\ntor of radio and TV at the college) over a local commercial\nstation, was awarded a George Washington Honor Medal\nby the Freedoms Foundation in Valley Forge. Norman Jeff¬\nerson, a student at the college, prepared a program for the\nAmerican Foundation for the Blind, and in competition his\nprogram was awarded a $100 cash prize and designated first-\nplace in the documentary division.\n^ Auburn University’s TV studio is producing a once-a-month,\nhour-long, original drama, using faculty members and wives.\n^ The University of Connecticut received an American Foun¬\ndation for the Blind citation and award for a half-hour radio\ndocumentary, “Twenty over Two Hundred.” Donald E. Nel¬\nson, director of the university radio-TV center, produced the\nprogram, which analyzed the problem of legal blindness.\n^ TV Theatre, Wayne State University’s live TV drama se¬\nries, recently presented “A Merry Death,” a harlequinade writ¬\nten originally for the Russian stage by Nicholas Evreinov.\nStudent husband-and-wife team Werner and Karen Harten-\nberger produced and directed.\n^ As an aid for listeners who want to plan week-end reading,\nmovie attendance, and theater-going, Philadelphia’s WUHY-\nFM is providing a weekly program of criticism each Thurs¬\nday evening. Called “Critic at Large,” the program will fea¬\nture Bruce J. Bloom as the reviewer.\nGENERAL\n^ Boston University has changed the name of its PR and\ncommunications school to the School of Public Communica¬\ntion.\n^ KQED, San Francisco, has started a group travel plan for\nits members. So far nineteen flights are scheduled during\n1964-65. On April 5 KQED celebrated its 10th anniversary.\n^ NAEB Industrial Associate Adler has announced that the\nFCC has granted Adler official acceptance for its 2500mc TV\ntransmitter, making it the first and, so far, only, such trans¬\nmitter acceptable for authorized use ill the 2500mc educational\nfield.\n^ Stanford University has developed a film on its flexible\nscheduling system for high schools. The system breaks away\nfrom the traditional 55-minute, 6- or 7-period school day,\nand class times range from 20 minutes to 2 hours or more,\ndepending on the subject. A computer is used to organize\neach school week. Some 6,000 students in five high schools\nhave been studying under flexible scheduling since September.\n^ On May 28, WNAS will celebrate its 15th anniversary.\nOn that date, 1949, WNAS, the first 10-watt FM station in\nthe schools of America, broadcast the commencement exer¬\ncises of New Albany High School, Indiana’s oldest public\nhigh school. After seven years of successful low-power oper¬\nation the station increased its power to 850 watts. Vernon\nMcKown, director of A-V education for the New Albany-\nFloyd County Schools, says he is proud of the fact that in\n1948 they decided to start with a student staff and that “we\nhave letters in our files showing that our method of opera¬\ntion was studied and successfully used from Long Island to\nHawaii and from New Orleans to Huntington, Indiana.” He\nalso wants to say “thank you” to the more than 275 former\nWNAS staff members, one of whom is now a highly re¬\ngarded CBC Network producer and award winner.\n^ Ampex Corporation ieports that it has delivered more than\na million dollars’ worth of VR-1500 portable videotape TV re¬\ncorders in the first three months of production and has a\ngrowing backlog of orders presently in excess of two and a\nhalf million dollars.\n^ WCET, Cincinnati, is telecasting on Sunday afternoons for\nthe first time in its nine years of operation. Good drama,\nopera, symphony concerts, jazz, feature documentary films,\nand ballet provide the program content.\n^ The ETV Association of Metropolitan Cleveland will soon\nfile for a CP for Channel 25 and for a grant under the ETV\nFacilities program. The group hopes to have the station on\nthe air this fall.\n^ RCA has announced a new portable AM-FM classroom\nradio for high-fidelity reception.\n^ Indiana State College, Terre Haute, will soon receive a\nused FM transmitter from the Wabash Valley Broadcasting\nCorporation, parent company of commercial WTHI-AM-FM-\nTV. WTHI will have a new transmitter. Indiana State, which\ncurrently has a CP for WVIS (FM), will also have its an¬\ntenna side mounted on WTHI’s 549-foot Channell 10 tower\nin downtown Terre Haute.\n^ Melvin A. Goldberg, vice president for research of NAB,\nwas the principal speaker for Indiana University’s annual\nradio-TV banquet April 30.\n^ The Milwaukee Radio TV Council has launched its first\nfund drive, in its 20th year. This year the council has or¬\nganized 10 teleclubs in which young people meet regularly\nwith adult discussion leaders to exercise judgment of TV pro¬\ngrams.\nWNYC, New York, will carry regular broadcasts from the\nWorld’s Fair.\n^ Commercial WJR, Detroit, has donated a campus radio\nstation to Northwood Institute, Midland, Michigan. The news\nrelease from Northwood says that the campus station “will\nprovide facilities for the further development of the advertis¬\ning curriculum in the broadcast area.”\n^ WFSU-TV, Florida State University, has installed a new\nEMI all-transistorized vertical interval switcher.\n^ The New York Times for Sunday, March 8, carried a fea¬\nture about WRVR (Riverside Church FM station) called\n“Station with a Civic Conscience.” The article states that\nthe documentary “Birmingham: A Testament of Non-Vio¬\nlence,” produced by WRVR staffers, served to catapult the\nstation from a relatively obscure position to one of national\nprominence. Critics have called the documentary, which has\nbeen distributed by the NAEB Radio Network, a significant\nmilestone in radio journalism.\n^ The governor of Pennsylvania proclaimed April 1 as\nWQED Day in honor of the Pittsburgh station’s 10th birth¬\nday.\n^ WMUK (FM), Western Michigan University, has a new\nphone number: 383-1921 (area code 616).\n^ WHYY-TV and WUHY-TV-FM have moved from Chest¬\nnut Street to 4548 Market Street, Philadelphia.\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 119 Gregory Hall,\nUrbana, III. 61803. $5.00 a year, $7.50 including Washington Re¬\nport. Editor: Betty McKenzie. Editorial assistant: Skip Robinson.\nPhome 333-0580. Area Code 217.\nReporters:\nRegion I —Michael Ambrosino, EEN, 238 Main St., Cambridge,\nMass.\nRegion II —Shirley Ford, WUOT, University of Tennessee, Knox¬\nville.\n—Lou Peneguy, AETC, 2151 Highland Ave., Birming¬\nham, Ala.\nRegion III —McCabe Day, WVS'H, School City of Huntington, Ind.\nRegion IV —Richard Vogl, KTCA-TV, 1640 Como Ave., St. Paul,\nMinn.\n2\nNEWSLETTER"
}