{
  "id": "d1169-3",
  "text": "y “The Sightless Day,” a half-hour WHYY-TV, Philadel¬\nphia, documentary showing the work and activities of the\nUpsal Day School for Blind Children, was presented recently\nin cooperation with the Junior League of Philadelphia. The\nprogram, narrated in part by Joanne Malatesta, blind princi¬\npal of the school, studies several blind and multiple-handi¬\ncapped pre-school children in activities designed to acclimate\nthem to home, school, and neighborhood living experiences.\n^ “The American Race Crises,” a new radio series produced\nat the New School of Social Research and originally record¬\ned by Station WINS, New York, is being made available to\nWICR-FM, Indianapolis, listeners by the Johnson Foundation\nas part of the Wingspread Lecture Series.\n^ “Where do butterflies go when it rains” was asked in\n“Our America,” an original play written, produced and per¬\nformed by Youth in Motion, Waco, Texas, research theater\nfor children, and the Trinity University Ideas in Motion\ngroup. Children, ages 6 through 18, acted and pantomimed\nsome of their questions and impressions of life on the KLRN-\nTV telecast of the play.\n^ George Koltanowski, international chess master, explains\nthe game’s history, folklore, and basic operation to viewers\nof WNED-TV, Buffalo, on the new series, “Koltanowski on\nChess.”\n^ From the University of Alabama, the Alabama ETV net¬\nwork is presenting “Pianist at Work,” in which a faculty\nmember from the University’s music department illustrates\npiano teaching methods and materials, interpretation and prac¬\ntice.\n^ “Chats on Writing” is a new series from WEDU in Tampa-\nSt. Petersburg, Florida. Taught by a U. of Florida professor,\nthe programs take up readability, restraint, imagery, begin¬\nning, and the like.\nPublications\n• TIO has just issued a four-pager, “Balanced Criticism\n1964,” a brief illustration of disagreement in critics’ evalu¬\nations of commercial TV offerings. Write to 666 Fifth Ave¬\nnue, New York 19, N. Y.\n• Teacher’s guides to NBC-TV’s “Profiles in Courage” se¬\nries are available from NBC Teacher’s Guide, Room 788J, 30\nRockefeller Plaza, New York, New York 10020.\n• Advice on how teachers may protect their rights in edu¬\ncational TV programs, films, teaching machines, and other\nnew instructional' media is contained in Fred S. Siebert’s 62-\npage study, Copyrights, Clearances, and Rights of Teachers\nin the New Educational Media, just published by the ACE.\nWrite for copies to the Commission on Academic Affairs,\nAmerican Council on Education, 1785 Massachusetts Avenue,\nN. W., Washington 20036.\n• Teacher-Tested Ideas is a new publication from the New\nJersey Department of Education, Trenton, N. J., for $1, 111\npages.\n• HEW has just published a 532-page catalog, “U. S. Gov¬\nernment Films For Public Educational Use—1963,” a list and\nbackground of over 5,000 motion pictures and filmstrips. $3.00\nfrom Supt. of Documents, U. S. Government Printing Of¬\nfice, Washington, D. C., 20402—their catalog number\nFS5.234;34006-63.\n• Eight Years of TV College: A Fourth Report has been\nissued by Chicago City Junior College and the Chicago Board\nof Education.\n• Mary Ann Cusack’s article, “Ethic for Broadcasting,”\nwhich appeared in the May-June NAEB Journal, has been\nreprinted in the October California Parent-Teacher.\n• Birns & Sawyer Cine Equipment Co., Incorporated’s free\nnew “Rental Catalog No. 4,” an illustrated, 64-page detailed\ndescription of professional motion picture and still photo¬\ngraphic equipment available for rental, is available from 6424\nSanta Monica Boulevard, Hollywood, California, 90038.\n• Microwave Filters, Impedance-Matching Networks, and\nCoupling Structures by G. L. Matthaei, professor of electri¬\ncal engineering at the University of California, Santa Barbara,\nLeo Young, head of the microwave techniques program of the\nElectromagnetics Techniques Laboratory at the Stanford Re¬\nsearch Institute, and E. M. T. Jones, director of engineering\nat TRG-West, contains 1087 pages, plus index, has 539 il¬\nlustrations, and costs $22.50 from McGraw-Hill Book Com¬\npany, 330 West 42nd Street, New York, New York, 10036.\n• The American Universities Field Staff’s new books cata¬\nlog is available from the AUFS, 366 Madison Ave., New\nYork, New York, 10017.\n• Three publications by John C. Woodward, Attitude and\nAchievement Comparisons for Direct and Television Classes\nin Biological Science, Report 3, The Effect of Immediate\nFeedback on Learning in the Humanities, Report 7, and\nThe Effect of Immediate Feedback on Learning in Social\nScience, Report 8, are available from the Office for the\nStudy of Instruction, Merrick 111, University College, Uni¬\nversity of Miami, Coral Gables, Florida. The project is sup¬\nported by a grant from the Fund for the Advancement of\nEducation.\nPLACEMENT\nPERSONNEL AVAILABLE\n(For information, write Miss Bonnie Decker, Placement Service,\nat the NAEB office in Washington.)\nDecember I Single female, 22, graduate of the University of\nWisconsin-Milwaukee Jan. 1965, B.S. degree. Speech\nmajor, emphasis in broadcasting. Seeking position in\nprograming or research, etc.\nDecember 2 Teacher, male, 26, married, wishes employment in\neducational broadcasting. Three years teaching experi¬\nence. University degrees A.B. and B.S. with majors in\npsychology, speech and English. Practical experience in\neducational radio, but would prefer educational tele¬\nvision. Salary range around $5500. Excellent references.\nWould relocate.\nDecember 3 Teaching and/or ETV station management posi¬\ntion desired by married, 32 year old father with Radio-\nTV Ph.D. expected in June, 1965. Currently employed\nas business manager by major market ETV station (U).\nMinimum salary: $8500.00.\nDecember 4 Experienced ITV producer-director seeks adminis¬\ntrative, teaching-research, and/or production position.\nGood academic background (speech-TV-film); wide\nrange of interests in arts and humanities. Ph.D. expected\nin August, 1965. Married male, 26. Minimum salary:\n$8000.\nDecember 5 Creative man desires to relocate as television\ndirector. Spent four years with CBS and has worked in\nradio. Has very strong musical background. Awarded\nM.A. degree in television production from New York\nUniversity. Age 37, single. Minimum salary: $7000.\nPOSITIONS AVAILABLE\nDEC-1 North Central ETV station seeks young producer-di¬\nrector to begin work January I, 1965. Salary is open\nand will be based on experience.\nDEC-2 Midwestern community ETV station seeks creative pro¬\nducer-director. Bachelor's degree and one year practical\nexperience mandatory. Salary commensurate with back¬\nground and experience. Position open immediately.\n4\nNEWSLETTER"
}