{
  "id": "d1872-1",
  "text": "NAJEB NEWS LETTER.... JULY I* 1940,. .Page 2\nin authorizing daytime and limi ted™ time standard broadcast stations\nto begin operation at 4 A.M., local standard time.\nThe new order of the Commission does not change any of the rules and\nregulations regarding standard broadcast operations which apply to\nthe regular broadcast day* which is defined as that period of time\nbetween local sunrise and 12 midnight local standard time, additional\nhours are granted during the experimental period which is defined in\nSection 3.10 of the Commissions rules as that time between midnight\nand local sunrise; consequently* any interference which may result to\nstandard broadcasting will be experienced chiefly during the \"experi-\nmental period.\"\nPending further Order of the Commission or amendment of the Rules and\nRegulations and effective immediately the FCC has issued Order No. 74\nwhich provides:\n\"(a) the provisions of Sections 3.6* 3.8, 3.9* 3.23* 3,79 and 3.84\nshall not prohibit the operation between four o’clock a.M. * local\nstandard time* and local sunrise* of standard broadcast stations\nlicensed to operate during day time hours or limited time hours;\n\"(b) nothing contained in outstanding instruments of authorization\nfor such stations shall prohibit such operation;\n\"(c) the period 4:00 A.M. to 6:00 A.M.* local standard time* shall\nnot be included in determining compliance with Sec. 3.71 (as amended\nJune 4* 1940) of the Commission’s Rules and Regulations.”\nSTATE RADIO COUNCIL FOR OKLAHOMA\nRepresentatives of every major educational* culture and service\ngroup in Oklahoma have been invited to assist in the organization of\nan Oklahoma State Radio Council in a meeting called for July 11 and\n12 at Norman* according to Homer Heck* Director of WNAD. The function\nof the Council will be to plan, and develop radio programs. Action in\n1AD participation in the Council has already been approved by the\nUniversity Board of Regents. Full details will be found in the\nEWTENSIOjT DIVISION NEWS of the University of Oklahoma. Homer will\nbe glad to send you a copy in case you have missed the article.\n’THE ROCKY MOUNTAIN RADIO COUNCIL\nHarold Engel* WHA, is the author of the main article in EDUC TI0N\nBY RADIO* second quarter, 1940* which has just been published. The\narticle relates thoroughly and in typical Engel fashion the complete\nstory of the origin and progress of the council. Don’t miss it,\nULTRA-HIGH FOR KENTUCKY\nElmer Sulzer* Director of Radio Activities for the University of\nKentucky* says that present plans are to keep the ultra-high\neducation station (42*900 k.c.) at Beattyville on amplitude. As\nsoon as problems at Beattyville are ironed out* the technical staff\nat AHA5 is going to start work on an F.M, transmitter.\nANYC PROGRAMS\nThe multiplicity of services being offered by ./NYC* New York City’s"
}