{
  "id": "d1782-0",
  "text": "Vol. Ill, No. 6 DuPont Circle Bldg., Washington 6, D.C. April 20, 1962\nFEDERAL AID TO ETV PASSES CONGRESS\nBoth the Senate and the House of Representatives passed, this past week,\nthe compromise bill (resulting from the meeting of the conference committee pro¬\nviding Federal aid to ETV. It should be signed into law shortly after May 1.\nBecause of the importance of this legislation, the bill is reproduced\nbelow in its entirety for your information. Cohn & Marks are now working on an\nanalysis and interpretation of this bill and this information will be made availa¬\nble to the membership after the bill is signed into law. The NAEB is naturally\nanxious to provide all possible cooperation in working with NAEB members in this\nmatter.\nThe compromise bill is now entitled: \"An Act to amend the Communications\nAct of 1934 to establish a program of Federal matching grants for the construction\nof television broadcasting facilities to be used for educational purposes,\" and\nthe bill is added, as Fart IV, to title III of the Communications Act. The com¬\nplete wording of the bill is as follows:\nSEC. 390. The purpose of this part is to assist (through matching grants)\nin the construction of educational television broadcasting facilities.\nSEC. 391. There are authorized to be appropriated for the fiscal year\nending June 30, 1963, and each of the four succeeding fiscal years such sums, not\nexceeding $32,000,000 in the aggregate, as may be necessary to carry out the purposes\nof section 390. Sums appropriated pursuant to this section shall remain available\nfor payment of grants for projects for which applications, approved under section\n392, have been submitted under such section prior to July 1, 1968.\nSEC. 392. (a) For each project for the construction of educational tele¬\nvision broadcasting facilities there shall be submitted to the Secretary an\napplication for a grant containing such information with respect to such project\nas the Secretary may by regulation require, including the total cost of such project,\nand the amount of the Federal grant requested for such project, and providing\nassurance satisfactory to the Secretary -\n(1) that the applicant is (a) an agency or officer responsible for the\nsupervision of public elementary or secondary education or public higher education\nwithin that State, or within a political subdivision thereof, (b) the State educa¬\ntional television agency, (C) a college or university deriving its support in\nwhole or in part from tax revenues, or (d) a nonprofit foundation, corporation, or\nassociation which is organized primarily to engage in or encourage educational tele¬\nvision broadcasting and is eligible to receive a license from the Federal Communi¬\ncations Commission for a noncommercial educational television broadcasting station\npursuant to the rules and regulations of the Commission in effect on April 12, 1962;\n(2) that the operation of such educational television broadcasting facili¬\nties will be under the control of the applicant or a person qualified under paragraph\n(l) to be such an applicant;\nn"
}