{
  "id": "d1782-1",
  "text": "PROGRAM SUMARY\n- 2 -\nMonday Morning Session\n—Mr. Wright, presiding—\nDean C. M. Thompson, was introduced by Mr. Wright and in behalf of the\nUniversity of Illinois welcomed the delegates to the campus. He characterized the\nradio and the automobile as the two factors exerting the greatest influence on\nAmerican life. ’’Few of us”, he said, ’’fully realize the important part the radio\nplays in guiding our thinking.” He acclaimed the radio as tho greatest factor in\nunifying the American people.\nH, B, McCarty. President of N-A-E--B, sounded the keynote of the convention when\nhe optimistically reviewed the objectives of the Association and again pointed\nto the need for individual demonstrations of what could be done. He called\nattention to the renewed efforts of commercial broadcasters to entrench further\nthe ’’American system” by high-pressure methods. ’’They”, he said, ’’realize that\nthey are subject to criticism. Congressional attitudes and public opinion are\nnot entirely favorable to their position. The present is an opportune time for\neducational broadcasters to demonstrate their place in the picture.”\nEvery station should have its plans for the future, based on real needs,\nwell defined. The essential requirements for getting ahead, he said, are,\nstrong local support, a good program service, and cooperative action between\nstations.\nIn concluding, he said that the problem of radio educators is the problem\nof facilities. Educators can build programs, they can hold audiences, they can\nrender a service-if they can but have the opportunity and assurance of access\nto the radio audience.\nHi. Ls_ Griffith. WOI, in speaking on the topic ”How Educational Stations\nWin and Hold Listeners” said that careful audience studies should be made in\neach station’s aroa to determine the real interests of minority as well as majority\ngroups. \"Too often”, said Mr. Griffith, ’’stations are run in the ’interest,\nconvenience, and necessity* of the fellow who runs the radio station.”\nPublicity on programs is essential to building audiences. He cited the use\nof station facilities, printed programs, newspapers, person-to-person talks,\nstudio visits, congenial announcers, service to non-profit groups, and a good\nprogram service as factors not to be overlooked.\n”To repel listeners effectively”, interjected Mr. Griffith, ’’use all the free\ntranscriptions, ballyhoo scripts, and ’chicken-pie supper announcements’ that come\nin.”\nA specific program service is necessary. It is impossible to serve all of\nthe people all of the time; but it is possible to serve a large portion well.\nL. A. Astell. of the University of Illinois, reported on an investigation of\n’’Auditory Education” he had worked with. In secondary schools, Mr. Astell said,\nthe radio must keep pace with educational trends. He mentioned the inter-school\nunification possible and the possibilities for training in service.\nPhysical equipment in schools must be adeq uate. Good receivers and. amplifiers\nare needed, as is acoustical treatment for comfortable listening. An administrative\norganization and capable consultants should be available for effectively using radio\nin the schools."
}