{
  "id": "d1782-1",
  "text": "(3) that necessary funds to construct, operate, and maintain such educa¬\ntional television broadcasting facilities will be available when needed; and\n(k) that such television broadcasting facilities will be used only for\neducational purposes.\n(b) The total amount of grants under this part for the construction of\neducational television broadcasting facilities to be situated in any State shall\nnot exceed $1,000,000.\n(c) In order to assure proper coordination of construction of educational\ntelevision broadcasting facilities within each State which has established a State\neducational television agency, each applicant for a grant under this section for a\nproject for construction of such facilities in such State, other th€tn such agency,\nshall notify such agency of each application for such a grant which is submitted\nby it to the Secretary, and the Secretary shall advise such agency with respect to\nthe disposition of each such application.\n(d) The Secretary shall base his determinations of whether to approve\napplications for grants under this section and the amount of such grants on criteria\nset forth in regulations and designed to achieve (l) prompt and effective use of all\neducational television channels remaining available, (2) equitable geographical dis¬\ntribution of educational television broadcasting facilities throughout the states,\nand (3) provision of educational television broadcasting facilities which will\nserve the greatest number of persons and serve them in as many areas as possible,\nand which are adaptable to the broadest educational uses.\n(e) Upon approving any application under this section with respect to any\nproject, the Secretary shall make a grant to the applicant in the amount determined\nby him, but not exceeding (l) 50 per centum of the amount which he determines to\nbe the reasonable and necessary cost of such project, plus (2) 25 per centum of the\namount which he determines to be the reasonable and necessary cost of any educational\ntelevision broadcasting facilities owned by the applicant on the date on which it\nfiles such application; except that (A) the total amount of any grant made under\nthis section with respect to any project may not exceed 75 per centum of the amount\ndetermined by the Secretary to be the reasonable and necessary cost of such project;\nand (B) not more than 15 per centum of any such grant may be used for the acquisi¬\ntion and installation of microwave equipment, boosters, translators, and repeaters\nwhich are to be used to connect two or more broadcasting stations. The Secretary\nshall pay such amount, in advance or by way of reimbursement, and in such install¬\nments consistent with construction progress, as he may determine.\n(f) If, within ten years after completion of any project for construction\nof educational television broadcasting facilities with respect to which a grant has\nbeen made under this section -\n(l) the applicant or other owner of such facilities ceases to be an agency,\nofficer, institution, foundation, corporation, or association described in subsection\n(a) (1), or\n(2) such facilities cease to be used for educational television purposes\n(unless the Secretary determines, in accordance with regulations, that there is good\ncause for releasing the applicant or other owner from the obligation so to do),\nthe United States shall be entitled to recover from the applicant or other owner of\nsuch facilities the amount bearing the same ratio to the then value (as determined\nby agreement of the parties or by action brought in the United States district\ncourt for the district in which such facilities are situated) of such facilities,\nas the amount of the Federal participation bore to the cost of construction of such\nfacilities.\nSEC. 393. (a) Each recipient of assistance under this part shall keep\nsuch records as may be reasonably necessary to enable the Secretary to carry out\nhis functions under this part, including records which fully disclose the amount\nand the disposition by such recipient of the proceeds of such assistance, the total\ncost of the project or undertaking in connection with which such assistance is"
}