{
  "id": "d1226-1",
  "text": "AUTOMATIC LOGGING AUTHORIZED\nFCC has issued final rulemaking authorizing use of automatic devices for\nmaintaining maintenance and operating logs. The full text of the 28-page FCC\nreport, giving complete details on this matter, may he obtained from NAEB by sending\n50^ in coin or stamps to cover the cost of reproduction of the document and mailing\nand handling. However, your order must be received here by April 1, and cash or\nstamps must accompany the order. This arrangement was made possible through the\ncooperation of our engineering consultants, Jansky & Bailey.\nADDITIONAL ETV CHANNELS\nOn Feb. 20, FCC invited comments by April 1 on petition by Fa. Ed. Network\nStudy to add 1 VHF and 4 UHF channels for ETV use in that state.\nOn Feb. 27, the Board of Regents of the University of the State of New York\nrequested the institution rule making proceeding to provide 17 additional UHF TV\nchannels reserved for non-commercial ETV channels in the state of New York.\nOn March 6, FCC invited comments to proposals by Twin City Area ETV Corp.\n(KTCA-TV) for reservation of Ch. 17 as a second ETV channel in Minneapolis-St. Baul;\nby Kentucky Authority for ETV to reserve Ch. 33 for ETV in Hazard, Ky., and delete\npresently reserved Ch. 19 in that city; and by Western tfoshington State College to\nreserve Ch. 18 for ETV in Bellingham, Tfesh.\nMPATI has requested the specific reservation of six UHF channels for use in\nairborne TV, and on March 5, FCC extended to March 15 time to file reply comments in\nthis matter.\nOn March 5, Florida ETV Commission filed petition requesting amending of Table\nof Assignments to shift Ch. 22 from lakeland to Tampa and reserve it for ETV, adding\nCh. 70 to lakeland.\nNEW ETV CHANNELS ASSIGNED BY FCC\nOn Ifeirch 6, FCC (in Docket 14687) assigned Ch. *53 to Hempstead, N.Y. and\nreserved it for ETV use. Related matter of assigning a UHF commercial channel to\nRiverhead, N.Y., was deferred until a later stage in the over-all UHF allocation\nstudies in Docket 14229.\nAlso, on March 6, FCC finalized rule making in Docket 14846 and transferred\nthe ETV from Ch. 17 to Ch. *4 in Dickinson, N. D., with Ch. 17 reverting for commercial\nuse. Dickinson State Teachers College had originally requested additional reservation\nof Ch. 4, while retaining Ch. 17 as reserved, but FCC declined to grant dual\nreservation until need therefor is more clearly developed.\nFCC granted (March 13) to University of Maine, license for new non-commercial\neducational television station to operate on Ch.*13 in Calais, Maine.\nMISCELLANEOUS\nHearings on the HEW budget for 1963-64, which includes funds for ETV matching\ngrants, were slated to start today (March 15) in Congress.\nMorton WLshengrad, who wrote several of the scripts in the Jeffersonian\nHeritage series for the NAEB, died of a heart attack Feb. 13* He was 49.\nTelevision Digest reports WHA-FM is now broadcasting FM stereo. According\nto nathTR records, this is the second educational FM station to adapt for stereo. The\nfirst was KANU-FM, Lawrence, Kansas."
}