{
  "id": "d479-122",
  "text": "FL Bulletins— 24/4\nsucceeded Mrs Gardiner, who became 111 after adding the TV Instruct\ntion to an already full schedule* The school adminiatration eveiv*\ntually ruled that TV teaching should be credited §§ half of & ygg*\nmei teaching scheduleo Mrs Bingham, however, a former high school\nFL teacher, is now a Washington parent, who volunteered to do the\nteaching without ©ompe»eation0\n\"Let®# Speak Spanish\" began am day after the French program, on\n2 October 1952, with Dr Elisabeth Carter of Miner Teachers Collage\nas the instructor until February 1953® Since that time, the pro®\ngram has been taught (Thursdays, 9*45-10*00) by Mrs Doris Sewell\nof the Kelly Miller Junior High School 0 The reduction in time for\nthe second year, and the crediting of TV teaching as half a normal\nschedule, applied of course to the Spanish series as well as to\nthe French,\nLanguage instruction is a major purpose of all programs, which are\nintended to serve as models for classroom pronunciation of words\nand id ions related to the pupils8 experiences. The teacher spends\na half hour before the day of the telecast with the whole daas\nfrom whom the studio group (2 boys and 2 girls 1 is drawn. An\nattempt is also made to haw the mimeographed lesson sheets for\neach lesson In the hands of the numerous participating teachers\n(during 1952-5% at least 259) at least a week or two before the\ntelecast.\nThe two programs have an approximate audience of 59000=»7^000\nviewers e By the end of the 1953-54 school year, & total ©£\nmyograms had been telecast. The present TV director is Mr Frank\nSlinglaad (Ms predecessor, Mr Carl Degen), Much credit for the\nplanning of these programs must go to the directors of FLs in\nthe Washington public schools. Miss Emilie Margaret White (Division\n19 white) and Mr Clyde Co McDuffie (Division 2, colored),\n3° Buffalo, New York, 4 December 1952\nThe station owned by the Evening flaws in Buffalo, WBBIMffa thus\nfar probably holds the record for continuous FL instruction,\nhaving begun ’’Fun to Learn about latin America” on 4 December 1952\nand having kept the program on the air every Thursday at 5*00 p,mo\nthereafter, even during the summer months. After his first 13-\nprogram series. Professor Manuel H, Guerra of the flew lark State\nCollege fey Teachers, Buffalo, was invited to continue indefinite-\nHis 15-minute program is designed to promote FL study and to teach\nconversational Spanish \"as a game\" to children in grades 1-7 by a\nvariety of devices, including songs, dances, story-telling, dra¬\nmatic skits, geography lessons, films, and the use of humor,\ndivers visual materials, cultural Information, and occasional\nguests, \"Children*» theatre in Spanish\" is emphasised a\nNawi&Xly 5 children participate in the program with the teacher,\nhaving practised'or rehearsed in the Spanish Workshop at Jamestown\nHigh School, Last fall, this group was ©banged, and the children\n(from different schools) are now rotated every 9 or 12 weeks®"
}