{
  "id": "d479-131",
  "text": "Someone leaned over and switched the radio off. A silence hung over the room\nfor a long minute. The sixteen men and women gathered in the comfortable living\nroom gazed thoughtfully at each other; then, a woman stirred in her chair and spoke.\n\"The Eskimos may have had a tough time surviving in the snow and cold,\" she\nsaid thoughtfully, ’’but at least they didn’t have mental hospitals crowded with\npeople who have found the problems of daily living more than they can handle.”\n”1 agree,” a man sitting opposite her declared. ’’Mental illness is more a\nthreat to our survival here in America than the climate or lack of food.”\nOne by one the o^her people in the room joined in a discussion of the problem\nof survival. They considered how mankind everywhere - from the beginning of the\nhuman race - has pitted his skill and inventive ingenuity against great odds. Their\nconversation ranged from the discovery of fire to the development of the new wonder\ndrugs, now bringing under control diseases which have periodically threatened to\ndestroy mankind. The discussion lasted for an hour and a half and then broke up\ninformally over coffee and doughnuts which the hostess brought in.\nWHAT WAS THIS ALL A30UT?\nThese men and women were participating in a WAYS OF MANKIND home discussion\ngroup. On this evening they had listened to a gripping drama - \"Survival” - of\nfour men battling to survive in the Arctic after a plane crash. The remarkable tech¬\nnology and Arctic wisdom (possessed by one in the party) worked for them in a sus¬\npense-laden struggle to survive, the outcome of which was left to the imagination of\nthose who listened.\nThe group met regularly on Thursday nights for a period of nine weeks to\nlisten to other programs in the WAYS OF MANKIND series, dramatically portraying\n”how people live together in different times and places.\" They listened and then\ndiscussed the problems that people face in living together in the modern, complex\nAmerican society.\nThis was an informal group of men and women, most of whom had known each\nother before coming together to talk about the ’’ways of mankind.\" They were parti¬\ncipating in a novel educational experience rather than playing bridge, watching TV,"
}