{
  "id": "d479-132",
  "text": "-2-\ngoing to the movies, or engaging in some other choice frcm the wide range of oppor¬\ntunities available in the community for leisure time activities.\nThis group was one of almost one hundred such groups that met regularly -\nusually in homes - during the WAYS OF MANKIND experiment, carried on in San Bernar¬\ndino, California, from April to the middle of June, 1953.\nJUST ANOTHER DISCUSSION GROUP?\nThe WAYS OF MANKIND Experiment represented a new departure in informal educa¬\ntional programs for adults. It was an initial exploration to determine whether it\nis possible - and practical - to mesh together in one powerful educational movement\nseveral elements which have never before been combined. Specifically, the experiment\nhad these distinguishing characteristics:\n1. Groups of people met regularly for nine weeks to listen to an outstanding\nradio program and then to discuss it. This was the first sustained combination of\na radio program and discussion groups in the United States.\n2. A large daily newspaper - the San Bernardino Sun-Telegram - cooperated by\nprinting weekly, in advance of the broadcast, ’’discussion guides.” These were sup¬\nplementary articles on the same subject as the broadcast, followed by questions\ndesigned to stimulate discussion.\n3. Most of the groups were natural ’’friendship groups” consisting of people\nwho enjoyed each other and found the experience a worthwhile substitute for other\nthings they might have been doing . (Very few groups were of the formal type with\nstrangers brought together under a trained discussion leader. ) This is a virtually\nuntried method for organizing discussion groups. It offers an exciting new oppor¬\ntunity for extending adult education to people not normally reached by other\nmethods.\n4. The men and women who organized these home discussion groups were chiefly\npeople without previous experience in leading discussion. Yet the meetings were,\naccording to competent observers, vital, penetrating in the depth they reached, and\nachieved a higher degree of participation than is usual except for the most seasoned\ndiscussion group."
}