{
  "id": "d479-137",
  "text": "-7-\nCommerce, and San Bernardino Valley College’s Community Education Project in a sig¬\nnificant Experiment of national interest.\nPROMOTING THE PROGRAM\nAll the promotional effort had two main goals - to interest large numbers of\npeople in listening to the program, and to build up attendance at a special PREVIEW\nof the Experiment, held two days prior to the first broadcast. While widespread\npublicity was given to the importance of organizing discussion groups, the preview\nwas looked to as the chief method of actually stimulating people to commit them¬\nselves to the organizing of groups. (Details on the PREVIEW are given in a subse¬\nquent section of this report.)\nTne promotional campaign included these elements? (l) individual presentations\nto key individuals and groups; (2) a large banner across the main street of town\nannouncing the program and inviting people to attend the preview; (3) a newspaper\nand radio publicity and advertising campaign; (4) preparation and distribution of a\nslick paper brochure describing the experiment in detail; (5) publicity releases to\nhouse organs of local organizations; (6) an informal build-up by interested people;\nand (7) the PREVIEW itself.\nOf these promotional techniques, the newspaper and radio campaign and the\ndistribution of the brochure may be of special interest to readers of this report.\nThe Community Education Project bought 564 inches of display advertising space in\nthe San Bernardino Sun-Telegram and fsser amounts in small weeklies and dailies in\nnearby communities. The advertising copy was prepared jointly by the advertising\ndepartment of the Sun-Telegram, the Community Education project, and the Valley Col¬\nlege faculty member who handles publicity for the College.\nThe newspaper advertising was broken into three phases: (l) a \"teaser” cam¬\npaign to create interest, leading up to the release of the major advertising. Using\nthe Experiment’s initials - Vi 01- small three by five inch ads, appearing in sev¬\neral places in the paper each day for a period of ten days, gave successively more"
}