{
  "id": "d479-138",
  "text": "-a-\ninformation each day about the program. This culminated in the release of an 80 inch\n(almost a half page) ad on the Friday night before the Preview. Slightly smaller*«ds\nappeared morning and evening for the next four days (except for Saturday evening)\nwith the last one appearing the evening of the Preview itself. On the Sunday before\nthe Preview a special ad appeared in the Society Section, especially inviting the\nladies to attend.\nThe third phase of the advertising began the night before the first broadcast.\nAnother 80 inch ad announced the first program - \"A Word in Your Ear.\" The next two\nradio programs were supported by 40 inch ads the day of the broadcast, and subsequent\nprograms by a 15 inch ad on the day of the broadcast itself.\nIn addition to the advertising, the Sun-Telegram gave generously of its news\ncolumns to articles about the Experiment.\nRadio advertising consisted of 50 floating spots on each of two local stations\nfor four days leading up to the Preview and for the two days intervening between that\nand the first broadcast. In addition Radio Station KFXM, which carried the program,\ngave running publicity to it for the week preceding the Preview. Spot announcements\nconsisted of a short excerpt from the first program, (the wolf call from \"A Word in\nYour Ear\") together with pertinent details as to time and place.\nThe slick paper brochure was distributed not only to the mailing list which\nthe Community Education Project had developed throughout its first year, but to a\nvariety of other \"natural\" community centers. Bulk supplies were placed with the\nlibraries, book stores, council of churches, P-TA’s, Chamber of Commerce, laundromats,\ncertain filling stations, and certain coffee counters in drugstores and cafes known\nto be gathering places. Key individuals were also given copies to distribute to\ntheir contacts. A delay at the printers prevented as widespread an advance distribu¬\ntion as had been desired."
}