{
  "id": "d479-144",
  "text": "-14-\nAn especially interesting and successful group was composed of people who had\nin common a well-developed aversion to racial and religious prejudice, its members\nbelieving that people should be accepted on their own merits without regard to arti¬\nficial differences. This group included Caucasians and Negroesj Catholics, Protes¬\ntants and Jews; and Mexican-Americans* The occupational background of these people\nvaried extremely, including a plumber, a lawyer, a school teacher, a domestic worker,\ngrocery store owner, a retired business man, and a P-TA leader.\nIt is essential in attempting to organize groups on a natural ’’friendship”\nbasis to understand the importance of identification; it is the key to success. As\nstated above, identification will usually be on the basis of social-economic back¬\nground, but other factors - as the Experiment demonstrated - may sometimes prevail\nfor some people.\nIn general, an analysis of the kinds of people in Ways of Mankind groups re¬\nvealed that most of them came from white collar, business, and professional groups.\nOne major insight clarified by the Experiment, therefore, is that promotion for\nfuture programs of this kind must emphasize involving more people from a wider range\nof population segments at the early, interest building stage. Of particular impor¬\ntance is it to identify those individuals who appear to have prestige and natural\nfollowings in their own social groups. These will frequently be individuals whose\nnames never appear in the newspapers and are generally unknown in the community at\nlarge. For example, if it is desired to reach the employees of a shop, mill or\nstore, it is more important to find out whom these employees regard as leaders in\ntheir daily life and to interest these leaders than it is to interest the manager,\nowner or foreman. It is desirable, of course, to reach these people too, but they\nare not always the best way to reach the bulk of the employees. Careful study of\neach situation is the only road to success. There is no magic formula."
}