{
  "id": "d479-152",
  "text": "-22-\n4. Publicity and advertising alone will not bring discussion groups into\nexistence. An enormous amount of leg work and the careful involvement of people\nwho are leaders in various population segments is necessary. Publicity should be\ndirected toward discovering these leaders, enlisting their help, and making easier\ntheir job of attracting interest within their prestige circles. There is a two-\nstep process in the use of mass media to promote a programs (a) The material must\narou-se. the interest of opinion leaders in various community groups; and (b) the\nopinion leader must bring the material actively to the attention of his group,\n5. In enlisting people at the early stage, it is important to see the com¬\nmunity in termsof its major population segments. Identification of people with\neach other - usually, but not always on the basis of social-economic background-\nis the correct basis for slicing up a community into population segments,\n6. The newspaper can best be used to stimulate interest in the program,\nkeep groups in touch with each other, develop a feeling of camaraderie, and to\ndramatize and interpret the program. Material designed to supplement the radio\nbroadcast can be distributed separately by mail or in bulk supplies to groups\nwhich register. Sources of supplementary material, to be found in libraries and\nother places, can also be pointed out to grupp members,\n7. Home discussion groups can function effectively without trained dis¬\ncussion leaders. Trained leaders can perhpps best be used as resource persons to\nsit in occasionally with groups and to help them analyze their difficulties,\n8. Finally, a program of this sort should not be an isolated activity.\nIt draws on the leadership developed in other kinds cf liberal adult education\nprograms and becomes itself a major way of developing additional leadership. It\nneeds to be set firmly in the context of a growing and broadening community-wide\nprogram,\nTne Ways of Mankind” Experiment was an initial and limited reconnaissanoein-\nto a no-man’s-land of education. Enough evidence was gathered to reveal that an ex¬\nciting opportunity of almost unbelievable proportions awaits those individuals and\ninstitutions who will grasp it.\nEugene I. Johnson and John E, Harder"
}