{
  "id": "d479-163",
  "text": "-2-\nare to be brought to a fully effective radio style of personal speech\nthrough revision and re-translation which do not do violence to Tocque¬\nville* s true meaning. These episodes may be imaginative in style but\nmust accurately represent the historical conditions of Tocqueville*s\nobservations at home in France and in America.\nThe consultants will provide the writer with a definition of\nthe aim and scope of each particular program and also a list of the\nmaterials to be drawn upon by the writer in creating the program. The\nwriter will be provided with an over-all picture of the complete series,\nso that he may see how the particular program is to fit in. The con¬\nsultants will search for the \"capsule incidents\" which hold the great\nideas in the compass of a small human experience. The writer will thus\nhave adequate specific incidents to illustrate Tocqueville*s complex\npicture of the tension between equality and liberty and the effects on\nthe whole range of national and personal life of the passion for equal¬\nity as well as what the remedies of free press and free association can\nachieve in preserving the advantages of democracy, if}, its political,\nsocial, and economic aspects, without its defects. Although the classic\nwork by Tocqueville, Democracy in America, has been usually utilized\nfor its political and governmental contribution, in this series we pro¬\npose to draw on its entire contribution in the area of culture, manners,\narts, etc., to give a picture of the entire American society.\nMeans: (l) The character of Tocqueville. At the beginning,\nTocqueville is visualized as an intelligent, ambitious, energetic young\nman of 25, well-educated and of aristocratic background. His family and\nfriends had been caught in the flow of the turbulent, rough-and-tumble\nFrench revolutionary stream; several immediate relatives had been im¬\nprisoned and guillotined. His early education had been by a private\ntutor, a Catholic priest, to whom he remained devoted until the latter* s\ndeath while Tocqueville was in America. His early training gave him a\ndeeply religious faith, although he did not continue as a practicing\nmember of any church. His father, restored to government posts after\nNapoleon*s fall, set him to the study of the law; he became an assistant\njudge at about 22, and it was in the course of his judicial work that he\nmet his lifelong friend, Beaumont.\nThis background suggests some of the factors of conflict which\nmoulded his personality and outlook. His aristocratic family background\nis one of tragedy in revolutionary France. He has, however, an idealistic\nbent, and is interested in the good of humanity. This turns his mind to\nthe new ideas about democracy and equality. He recognizes and remains\nattached to the older political and social values. He is worried by the\nmaterialism of French politics. His social sensitivity is evidenced by\nhis interest in improving and humanizing the French prison system; this\nobjective is, indeed, the immediate motivation of his trip to America.\nBut beyond this objective, he sees the wider vistas of the whole Ameri¬\ncan experiment in Democracy which he wishes to observe at first hand and\nappraise from the standpoint of its relevance for France (and Europe\ngenerally).\nPhysically short in stature, and never (throughout his entire\nlife) robust, he has a lively, volatile disposition. Always courteous in"
}