{
  "id": "d479-66",
  "text": "NAEB TAPE KETWOBK\nPROGRAM LIST\nPROGRAM LIST\nSeries 53-3 (Winter-353)\nTitles MODERN VIEWS OF MAN & SOCIETY -\nTypes Talk\nTimes SDsCO\nNog i 8 programs\nOrigin! WHOM\nAudiences General\n10 THE CRITICAL FUNCTION—Anthony West. During the war Hritish-bom critic\nand novelist West wa© vd.th the British Broadcasting Company* Sine© his\narrival in the United States, he has been book reviewer for Tlmeand at\npresent is serving in that capacity for the New Yorker.\n2o THE INTER-RELATIONS OF PUBLIC HEALTH AND MEDICAL CARE OVER THE LAST\nCENTURY—Richard H. Shryook, director of the Institute of the History of\nMedicine at Johns Hopkins University Medical School*\n3o MAN AND STATE IN COMMUNIST COUNTRIES—Nicholas Nyardi. As former minister\nof finance of Hungary, Dr* Nyardi was called upon to negotiate with\nMoscow in the matter of Russian claims against his country* Despite\nstrong Russian pressure, Dr„ Nyardi urged Hungary, unsuccessfully, to\nparticipate in the Marshall Plan. Ho went into voluntary exile in 1948\nand arrived in this country shortly after. My Ringside Seat in Moscow\nis his latest publicatione\n4c EUROPEaS REVOLUTION IN VALUESs ROOTS OF T0TALITAPJANISM»1871-1952-™\nPeter Vlereck. Mr. Viereck is professor of Russian history at Mount\nHolyoke; College and was awarded the Pulitzer Prize for poetry in 1949»\nHe is well known for his prewar oxpom of Nazism, Mkfcapolitice. and to*\nhia continuing attack on Communism, Ooneeryatiamini Revisited.\n5o THE SOCIAL AND EDUCATIONAL IMPLICATIONS OF RELIGION TODAY—Panel discus¬\nsion with Bishop Richard Emerich, Harlan Hatcher, president of the Uni-\nvarsity of Michigan, and professor Frank Huntley a»' moderator.\n6. MYTHS AND HEROES IN NEW AMERICAN FICTION—Malcolm Cowley. An important\nfigure In the field of letters for thirty years, Mr. Cowley has distin¬\nguished himself as critic, editor, and translator. From 1929 to 1944\nhe was an associate editor of the New Republic. Eo has edited Whitman,\nHawthorne, Faulkner, Hemingway, and Scott Fitzgerald.\n7. LAW, FREEDOM, AND HUMAN ACTION IN HISTOHYr-Sidnsy Hock. Mr. Hook is\nchairman of the Philosophy Department at Washington Square College,\nNew foi% University. He has written extensively in many fields, on Karl\nMarx, social myths and democracy, the hero in history, and education to?\nmodem man.\n8. THE LIVELY ARTS AND THE GREAT AUDIENCE—Gilbert Saldes. Since the pub¬\nlication of his first book on the subject of the popular arts some years\nago, Mr. Ssides has basn interpreting the radio, television, and motion\npictures. Fron 1937 to 1945 he was director of television for the Coluia-\nbia Broadcasting system. As a newspaper correspondent and as one of the editors\nof Collier3 s and the Dial, he observed his materials with a keen eye."
}