{
  "id": "d479-74",
  "text": "IIAEB TAPE NETWORK\nPROMOTION ‘ PROMOTION\nSeries 53-11 (Winter—053)\nTitle! REPORT FROM EUROPE\nType* Talk—-comment on people., places, events\ntimes 15sOO\nNo*j 13 programs\nOrigins WBM\nAudience? General\nThe people of continental Europe .today — their t all;-' lives, activities,\ninterests and problems — these are the subjects op the informal comments and\nrecollections by a member of the Purdue University Department of Modem\nLanguages; Professor Eerie S# Randall, in the REPORT FROM EUROPE.\nThe series seeks to convey in an informal and entertaining manner a sens©\nof the life, manners, and general mores of the per-j.le of %ropej to increase\nunderstanding of and appreciation for people cf tm r ,\nThe series will avoid politics, e chromics end history as such, end will\ndenote rather the daily living of our friendly Burcoeen no Ighlrcrc —what\nthey do and think and say about things in general i rA about Americans in\nparticular.\nThe first four programs-in this series coal vita iae French,, 'hair\nlanguage, customs, cities and towns, and their cult-ur®. Professor\nRandall will speak of the dinner habits of f..,c It a i oisns, the amount of\nwork the people of Normandy and Brittsvy kaye deny in rebuilding their war\ndevastated homes, and of the soaring Gothic linsj-j cf the Cathedral at\nChartres* In the following programs he will calf: oi Spain and of Germany*\nProfessor Randall is s. long-time stellar perfc-rE3r on WBM. He is\nnow Adting Read, of the Dept* of >b&n: I a : \" . . 1 originated\na course in Language pronunciation which was first tried out over W3AA\nbefore being offered in the university .cat--'.- planned this series\nof talks before visiting Europe and thus looked at and visited many places\nwith the thought of reporting to the radio audience*\nHe has made repeated visits to ^tareps, livirp and n.iing- there for\na total of several years. He married . I ‘ s several of\nthe continental languages fluently, and knows the ytopic intimately* Prom\nhis experience with them during the war and aft with\ntrue knowledge and understending* Els comments vill to a, opl®.rented by\nthose of ethers in the coceaunity who have vacantly ss turned fron abroad."
}