{
  "id": "d479-80",
  "text": "(RELEASE #1)\nFROM: RADIO STATION WXXX\nADDRESS\nPHONE FOR RELEASE: (DATE)\nWIFE-STEALING WAS A PROBLEM EVEN WITH ESKIMOS, NAEB FINDS\nEven the crude and leaderless early Eskimos had their\nproblems of law and justice, and their own primitive ways of\nsolving them, according to \"The Case of the Borrowed Wife\",\ninitial program in the new National Association of Educational\nBroadcasters series on \"The Ways of Mankind\",\nAs an adult education project of the NAEB, the \"Borrowed\nWife\" program is the first of a cubseries of six presentations on\nLaw and Justice, a group which in turn is part of the second\n{’Ways of Mankind\" series of thirteen half-hour broadcasts. The\nentire new series, like the first \"Ways of Mankind\" series which\npreceded it, is designed to show how human being live together in\ndifferent times and places.\n\"The Case of the Borrowed Wife\", which tells how an Eskimo\nhusband sought satisfaction when a bachelor friend made off wft h one\nof his two wives, will be heard over Radio Station -- (Name) -- on\n(date) -- at -- (time). Walter Goldschmidt of the University of\nCalifornia was project director for the broadcast, as for the entire\nseries, with the opening program written by Lister Sinclair and\nproduced by Andrew Allan.\nThe narrative of the initial broadcast tells how Kaakajik,\nStone Age Eskimo, has no tribe-leader or system of authority to\nwhich he can appeal when his friend Kooitse lures away Tupaaja, one\nof Kaakajik’s two wives. Though Inik, the second wife, remains\nfaithful Tupaaja is fascinated by the glamor of the successful\nhunter, Kooitse, contrasting with the frequent failures and frustrations\nof Kaakajik.\nThe radio listener hears how Kaakajik, without any court,\nlaw or established code of ethics to guide him, takes matters into\nhis own hands under primitive concepts of law and justice. The drama\nunfolds to show how even in this settlement, the outraged husband is\ndogged by the s ame apparent failures and frustrations that blunted\nhis harpoon on the walrus-hunt.\nm ### m"
}