{
  "id": "d479-81",
  "text": "FROM: RADIO STATION //XXX\n( RELEASE #2)\nADDRESS\nPHONE\nFOR RELEASE: (DATE)\nIFUGAO INDIANS PAID OFF DEBTS WITH PIGS, NAEB PROGRAM SAYS\nDebts had to be paid even among the Ifugao Indiana of the Northern\nPhilippines \"many years ago, before the white men took to discouraging\nhead-hunting among their people, and made it so much harder for a young\nman (Ifugao) to improve his position in society\".\nThe payment of just debts -- after the determination of what just\ndebts really were --is the problem of law and justice forming the theme\nof the second program in the \"Ways of Mankind\" series of thirteen\nhalf-hour broadcasts produced as an adult education project by the\nNational Association of Educational Broadcasters.\nEntitled \"The Case of the Bamboo-sized Pigs\", the forthcoming\nprogram will be heard on -- (date) -- at -- (time) -- over Radio Station\n-- (name).\nThe new \"Ways of Mankind\" series, for which Dr. Walter\nGoldschmidt of the University of California was project director, is the\nsecond under this general title produced by the NAEB. The first six\nprograms constitute a subseries on Law and Justice, with two other\nsubseries accounting for the remaining broadcasts. The \"Bamboo-sized\nPigs\" program, one of the Law and Justice subseries, was written by\nLister Sinclair and produced by Andrew Allan.\nDr. E. Adamson Hoebel, Professor of Aithropology and Dean\nof Letters and Science at the University of Utah, served as special\nconsultant for the Law and Justice subseries.\nWhen debts were incurred among the Ifugao Indians, the obliga¬\ntions had to be met. These early people felt that an insult sometimes\nwiped out an insult, just as a death sometimes wiped out a death. The\nproper payment of reparation, however, wiped out everything. If they\ncould only determine and agree upon what proper payment was!\nSkillfully and with expert dialogue, the new program on the Ifugao\ntells how the debt was contracted, how it pyramided and how it nearly\nbecame a cause of bloodshed among a people who attempted to avoid un¬\nnecessary fighting. Currency in the case consisted of bamboo-sized pigs.\nOnce the proper settlements were made, all was well again. From that day\non, there was peace.\nm ### m"
}