{
  "id": "d479-83",
  "text": "FROM: RADIO STATION WXXX ( RELEASE #5)\nADDRESS\nPHONE FOR RELEASE: (DATE)\nASHANTI CHIEF WIELDED POWER BY PEOPLE'S WILL, NAEB FINDS\nIn ancient days, all the land of the Gold Coast of Africa was\ndivided into territories. Over every territory the Ashanti people had\nplaced their chief, who, with the inspiration of his ancestors, dispensed\neven-handed justice. He praised some and blamed others, ordering some\nto pay and others to be killed. The spirit of the Ashanti was strong in\nthose days.\nAshanti justice and the method of its administration form the theme\nfor \"The Forbidden Name of Wednesday\", newest in the second radio\nseries on \"The Ways of Mankind\", thirteen half-hour broadcasts produced\nas an adult education project by the National Association of Educational\nBroadcasters.\n\"The Forbidden Name of Wednesday\", for which Dr. Walter\nGoldschmidt of the University of California was project director, will\nbe heard over Radio Station -- (name) -- on -- (date)) -- at -- (time). This\nbroadcast is one of a subseries of a six on Law and Justice. The entire\n\"Ways of Mankind\" series is designed to show how people live together\nin different times and places.\nSpecial consultant for the Law and Justice subseries was Dr. E.\nAdamson Hoebel, Profeasor of Anthropology and Dean of Letters and\nScience at the University of Utah. The \"Forbidden Name\" broadcast was\nwritten by Lister Sinclair and produced by Andrew Allan.\nThe entire broadcast tells how it was in the old days of the Ashanti,\nwhen a private quarrel between two men, of interest only to themselves,\nmight, by the swearing of forbidden names, be made a quarrel in which the\nentire tribe took an interest. Once the tribe entered the picture, the entire\nfracas was settled by the chief, through due procedure of Ashanti law and\nby the will of the people.\nAlso, once the tribe became interested, fees had to be paid, for\nthe court and its \"attendants\" had to be supported. \"When a chief is going\nto compel you to do something, a \"court official\" says at the conclusion\nof the broadcast, \"he does so by the authority of the people\","
}