{
  "id": "d479-84",
  "text": "FROM: RADIO STATION WXXX (RELEASE #7)\nADDRESS\nPHONE FOR RELEASE: (DATE)\nNAEB AVERS YUROKS LIVED MUCH LIKE US\nWith \"The Life of a Yurok\", the National Association of Educational\nBroadcasters brings to its listeners the first of four programs prepared\nto offer each hearer the experience of living as the Yurok Indians of\nNorthern California lived within their stone-age culture. The set of four\nYurok broadcasts is part of the second \"Ways of Mankind\" series which\nthe NAEB is presenting as an adult education project.\nWritten by Charles Israel, produced by Andrew Allan, and with\nDr. Walter Goldschmidt of the University of California as project director,\n\"The Life of a Yurok\" will be heard at -- (time) -- on -- (date) -- over\nRadio Station -- (name).\nFor the series of four presentations on the Yurok, Alfred L. Kroeber,\nProfessor Emeritus of Anthropology of the University of California, acted\nas special consultant.\nIn their Northern California home, the Yurok Indians lived along\nthe banks of a beautiful mountain river, teeming with salmon. Acorn,\ndeer and other products of the forest were part of their daily fare. These\nIndians, who lived in hand-hewn plank houses clustered together into\nsmall villages, had a way of life which in some ways was like our own and\nin some ways was different.\nThey sought wealth, which was a measure of importance, hut this\nwealth was largely connected with their religion. Men loved their wives,\nwhom they bought with sea-shell money. These Indians worked hard, for\nwork was a virtue. Like people everywhere, they suffered sickness and\ndeath, and cured their sick as best they could by the magical powers of their\ndoctors.\nPeople everywhere have developed their own way of life to meet\nthe needs of their particular time and place. But, as \"The Life of a Yurok\"\nseeks to show, people live in terms of their culture. They love and hate,\nfeel anxiety and pride, are born and die. And so, in this truly Indian story,\nthe radio listening public is taught * to understand, as anthropologists\nunderstand, the life of a Yurok."
}