{
  "id": "d479-85",
  "text": "FROM: RADIO STATION WXXX (RELEASE #8)\nADDRESS\nPHONE FOR RELEASE: (DATE)\nYUROKS TREATED WOUNDS WITH POULTICES, THOUGHT EVIL SPIRITS\nCAUSED DISEASE\nWhile the early Yurok Indians of Northern California were much\nlike us, in many ways they were different, and nowhere is this difference\ngreater than in their medical practice, according to the anthropological\nstudy which forms the basis for \"The Reluctant Shaman, A Study in Yurok\nCulture\", a radio program in the second \"Ways of Mankind\" series presented\nby the National Association of Educational Broadcasters as an adult educaticn\nproject.\nThe new program, one of four designed to tell something of the\nstone-age culture of the Yurok Indians, will be heard over Radio Station --\n(name) -- at (time) -- on -- (date). With Dr. Walter Goldschmidt of the\nUniversity of California as project director, the newest program was written\nby Charles Israel and produced by Andrew Allan. Special consultant was\nAlfred L. Kroeber, Professor Emeritus of Anthropology at the University\nof California.\nAs the narrative of the newest Yurok story unfolds, the radio\nlistener hps impressed upon him that death and illness face humans every¬\nwhere, and ail- cultures provide attempts to cure the sick. It is dhown that\nthe Yurok treated wounds with Poultices, but believed disease to be caused\nby evil spirits.—-— . - |IU\nThe shaman was their doctor, who sucked outthe evil spirits.\nShe -- the Shaman was always a woman -- had to have a special calling,\nspecial powers and special training in the magic of her profession. Under¬\nstanding and psychology had to be her true tools, along with faith.\nIn some cases, the psychology was clear, for then the disease could\nbe recognized as based on guilt. Through the radio story of \"The Reluctant\nShaman\", the radio listener follows the story of how one young woman became\na shaman - fight as she would against the calling -- and then went on to be¬\ncome an adept and successful practicer of her profession.\n### m m"
}