{
  "id": "d479-86",
  "text": "FROM: RADIO STATION WXXX (RELEASE #9)\nADDRESS\nPHONE FOR RELEASE: (DATE)\nNAEB RELATES A YUROK \"HORATIO ALGER\" TALE\nThe Yurok Indians of Northern California believed that any person\ncould get ahead if he worked hard, kept trying and did not let pleasure\ninterfere with his objectives. This belief was a point of similarity of the Yurok\nin his stone-age culture to our philosophy today.\nIn \"The Sea-Monster and the Bride, A Study in Yurok Culture\",\na one-half hour broadcast in the thirteen week second series on \"The Ways\nof Mankind\", the National Association of Educational Broadcasters tells a\ntrue \"Horatio Alger\" story of a boy winning a girl through bravery and\npersistence.\nProduced as an adult education project, \"The Sea-Monster and the\nBride\" will be heard over radio station-- (name) -- at -- (time) -- on\n(date). Within the framework of the \"Ways of Mankind\" series, this new\nprogram is one of a set of four presentations designed to offer the radio\nlistener the experience of living as the Yurok Indians did in earlier times,\nAlfred L, Kroeber, Professor Emeritus of Anthropology of the\nUniversity of California, was special consultant for the four-program Yurok\nsubseries. Dr. Walter Goldschmidt, anthropologist of the University of\nCalifornia, supervised production of the entire \"Ways of Mankind\" series.\nCharles Israel wrote \"The Sea-Monster\", and Andrew Allan produced it.\nIn a short narrative opening the new broadcast. Dr. Goldschmidt\nexplains that the Yurok had their own stores of personal victories through\npluck and luck, and \"The Sea-Monster and the Bride\", told as a true story,\nis one of them. The Yurok Indians also believed in romantic love.\n\"Many peoples marry according to kinship, convenience or pre¬\narrangement; not so the Yurok\", Dr. Goldschmidt says. They fall in love\nwith a one-and-only -- despite the fact that they must pay the price in money.\nWe will find in this story a familiar pattern of behavior -- though hedged about\nby different customs -- just because the Yurok feels about marriage, success\nand virtue very much as we do\".\n### m ###"
}