{
  "id": "d1627-5",
  "text": "UBAA REPORTS INDIANA FARM SURVEY RESULTS\nJim Miles, manager NAEB station WBAA(Purdue University) reports completion of a sur¬\nvey done by Harold Schmitz, farm radio editor for the station, on \"What Farm People\nWant From Radio.\" County agent mailing lists, with random sample, furnished 3000\nnames with a 15% reply to a mail questionnaire.\nBest listening time is reported as 12:00-12:30 p.m, for Indiana. Farmers prefer to\nhear a specialist with a straight talk.\nFarmers prefer 5-10 minutes of music — enjoy familiar songs.\nFarmers want an evening farm program and a market broadcast at approximately 7:00\np.m. — would like weather and news broadcast at 8:00 or 8:15 P.m.\nIndiana farm women prefer to listen from 8:30 to 9:00 a.m. and want weather reports,\nmarket news (especially egg and poultry markets), want home economics and club news.\nprefer straight talk method of presenting information.\nNATIONAL ASSOCIATION CF BROADCASTERS PLAN \"IRRITANT THEORY\" TESTS\nNAB plans a research project to test \"irritant theory\" or radio advertising. Justin\nMiller, NAB prexy, described survey plan of trying to find out how effective the\npractice is of gaining listener attention by \"irritating them a little\".\nThe new NAB code (\"Standards of Practice\") set up at the Los Angeles national meet¬\ning sets up a maximum time schedule for commercials. Miller said, however. NAB is\ngoing to look into the quality of radio advertising, as well as its length. He\nreported the NAB has departments devoted to both sales and program fields which will\naid broadcasters in living up to the new standards.\nSYRACUSE UNIVERSITY GRANTS CITATION TO BROOKS\nNAEB associate, Syracuse University, through its radio workshop, granted William\nF. Brooks, vice president of NBC, the workshop citation for \"outstanding contribu¬\ntions in the field of radio and journalism\" at a dinner in late May. Brooks is in\ncharge of news and international relations Tor NBC.\nRCA PRESIDENT PREDICTS ATOMIC-POWERED RADIO RECEIVERS\nDavid Sarnoff, RCA president, predicts that radio and TV sets of the future may be\npowered by atomic energy. \"It is no idle dream,\" he said, \"to envisage that radio\nsets of the future may take their power from tiny capsules of atomic emergy.\"\nSarnoff believes that television holds the greatest promise for the future of radio,\nand he predicted we shall witness the gradual fusion of sound broadcast with tele¬\nvision.\nNEW YORK UNIVERSITY OPENS SUMMER RADIO WO-RSHOF\nDates for the 194& Summer Radio Workshop of New YorkUniversity have been announced\nfor June 28 to August 6. Operative over a 12-year period, the workshop remains\nprimarily interested in standard radio broadcasting, advises students especially\ninterested in television, FM, etc., not to enroll. Workshop attempts to give\nbroad, working perspective of standard radio field, limits enrollment to 60 persons.\nInformation may be obtained by writing to 100 Washington Square East, Division of\nGeneral Education, New York University, N.ew York City,"
}