{
  "id": "d631-12",
  "text": "WINTER ADDRESS\nANN ARBOR, MICHIGAN\nSEPTEMBER - JUNE\nSUMMER ADDRESS\n1NTERLOCHEN, MICHIGAN\nJULY AND AUGUST\n,s«\nIW\nk?i\nNATIONAL MUSIC CAMP\nW. W. CHARTERS, TRUSTEE\nDIRECTOR EMERITUS, BUREAU OF\nEDUCATIONAL RESEARCH,\nOHIO STATE UNIVERSITY\nServing America's Gifted Youth\nORCHESTRA - BAND - CHOIR - RADIO - DRAMA - DANCE - ART\nAffiliated with the University of Michigan\nFRANKLIN DUNHAM, TRUSTEE\nCHIEF OF RADIO, U.S. OFFICE OF\nEDUCATION\nJ. JOSEPH HERBERT, TRUSTE\nATTORNEY-AT-LAW, AND REGENT\nUNIVERSITY OF MICHIGAN\nCLYDE VROMAN, TRUSTEE\nDIRECTOR OF ADMISSIONS,\nUNIVERSITY OF MICHIGAN\nId -/%\nA^ril 25, 1950\nJUDITH WALLER, TRUSTEE\nDIRECTOR OF PUBLIC SERVICE AND\nEDUCATION, CENTRAL DIVISION\nNATIONAL BRbADCASTING COMPANY\nMr, Chris Donaldson\nProgram Manager\nBroadcasting Station 101\nIowa State College\nAmes, Io-wa\ni NATIONAL BF$QA\nWv<| )\ncl\nft -\nDear Mr. Donaldson:\nOur engineers have ascertained that it will cost us about\n$1.50 per 60-minute program to make Magnecord tape copies\nof our programs (at 15 or 7i speed) provided the stations\nfurnish the tape—which should be TYPE 111A Scotch Tape.\nOur engineers would like to know the type of tape equip¬\nment used by the stations desiring the transcriptions.\nThey prefer to make the recordings at 15 speed.\nFor your information I am enclosing a schedule of broadcasts\nfrom Interlochen for the coming summer, together with a list\nof NASB stations interested in receiving the programs. These\nprograms will be fed by wire to Station WEAR (Michigan State\nCollege, East Lansing) and to Station WUOM (University of\nMichigan. Ann Arbor), then relayed to a number of FM stations\nin southern Michigan. We expect to record the programs on\nMagnecord Equipment at the time of the broadcasts, omitting\ndates and station identification. We would ship the trans¬\ncriptions the day following each broadcast, by express, mail\nor airmail. We can arrange for an exchange of tape in whatever\nmanner is most suitable to the stations.\nIf you care to arrange a circuit of five stations which would\nuse any series of programs in succession (using the same\ntranscriptions) the Camp will assume the cost of recording,\nso the only expense would be postage and return of tape. For\na circuit of three stations the Camp would assume half of the\nrecording expense, so each station would receive the trans¬\ncriptions for 250 per 60-minute program.\nWe are ready to complete arrangements for the transcription\nservice and will appreciate hearing from you as to your wishes.\nSincerely,\n-s\nseph E. Maddy, Presi.dent\nJEM:mb\nAn educational institution incorporated not for profit"
}