{
  "id": "d631-23",
  "text": "j. p. boGrdrez »\nDirector New York\nWILLARD C. WICHERS\nDirector Midwestern Division\nTHE NETHERLANDS INFORMATION BUREAU\n(A Government Agency of The Netherlands)\nTHE NETHERLANDS INDONESIA NETHERLANDS ANTILLES and SURINAM\nCABLE ADDRESS: NETHINFORM\nTELEPHONE: 3174\nIN REPLYINGPLEASEJREFEELTO\nno. 10-3&B-*'CWs Bu\nMIDWESTERN DIVISION\nNETHERLANDS MUSEUM\nHOLLAND. MICHIGAN\nOctober 31, 1949\nMrs* Gertrud© G. Broderick\nRadio Education Specialist\nFederal Security Agency\nOffice of Education\nashington 25, D. C.\nBeer Mrs, Brodericks\nYour letter of October 14, addressed to me at our Mew York office, has been sent\non her© for reply* Some months ago I had a discussion and subsequently corres¬\npondence with Dick Hull, President of the National Association of Educational\nBroadcasters, relative to the use of our transcriptions after they had been\nbroadcast•\nMr* H. Emory Sills, the Head of our Radio Department at New York produced a\nseries of transcription? which had, in the opinion of many of our educator\nfriend©, great value fro® the standpoint of audio education* As a matter of\nfact, Mr. Kills intended that this series could be used for classroom instruction\nin some instances*\nDick Hull agreed with me that wider use should be sought for the transcriptions,\nmid gr&ciousl volunteered to explore the possibilities with you* Now, Mrs*\nBroderick, some time has elapsed and ~m find ourselves in the embarrassing\nposition of not being able- to offer these series because most of the® have-\neither* been destroyed by the radio station, or have found thei, way into school\nlibraries*\nThe only exception to tills is the eerie© THE DUTCH STUDENTS S?KAK of whicr Sr.\nEllis informs* me, some 30 set© are on hand. We are forwarding a set of teds\nseries to you for audition. Meantime, in order th t you may have some impressions\nof other program# produced by Mr. Ellis in the past, I' aa sending you descriptive\nmateriel on ECHOES OF A CENTURY and the pro,gram HOLLAND—TODAY AMD TOMORROW.\nI trust that when our last series is projected, we may provide you with full\ninformation, and have your cooperation in distribution after they have been used\nby the radio stations.\nMeantime, I am taking the liberty of enclosing four copies of & script program,\n\"Feminine Vignettes\" prepared by Miss Natalie Hall, Assistant Radio Officer* be"
}