{
  "id": "d631-56",
  "text": "Mr. Allen Miller, K#30 (continued)\nI should indicate to you that KWSC has apparently had more\ndifficulty with the Network than all the other stations\ncombined. I do not know what the reason for this is. It\nmay be with the station immediately proceeding you. 01?,\nit may be with the short time interval. Or, it may be with\nthe U.5. Mails on the west coast.\nAt any event, this gives us a basis of experience from which\nto make any departure in future planning. No matter how\nhorrible t e results have been, and in the last analysis\nfinal decision on this must come from you, I think the\nexperience has been well worthwhile as a basis for future\nplanning.\nAs to the Dr. Wagner series, I am not differing with your\nanalysis of the content one whit. This, however, is a\nproblem which I brought up at Allerton, wherein I indicated\nthat I did not want my personaly judgment to be the deciding\nfactor concerning the offering of programs to the Network.\nIt was for this reason that Hull set up a program committee.\n'I suppose that I may have been somewhat confusing in calling\nthe Wagner series a commentary. Actually, any single talk\nis not a commentary. A series of talks by the same individual\nhowever, may well fall into the commentary classification,\ncertainly in the minds of the general public.\nWhile we would be delighted to use one talk by Dr. Wagner\nhere at WHIG, if we were to put her on a regular basis, it\nwould be projecting one personfs opinions over a long space\nof time. A talk is too closely akin to the field of news\ncommentary for us to handle. Maybe this reasoning should\nnot be used in connection with any of the other NASB stations.\nFrankly, I do not know. As I indicated to you, I did not\nfeel free to make an official offering if the series cannot\nbe presented on WNYG.\nIf the Program Committee decides that the Wagner series\nshould be officially offered, I am all for it. In the\nmeantime, try hot to think too badly of us, here in New\nYork. Perhaps after the Louisville meeting, the whole\nproblem of the Network will be solved to everyone’s\nsatisfaction.\nWith all best wishes, believe me\nAs ever,\nSeymour N. Siegel\nDirector\nsns:L\ncc to: Richard Hull; Jim Miles; George Probst"
}