{
  "id": "d1188-2",
  "text": "(3)\nIOWA STATE TEACHERS ASSOCIATION - \"The FUTURE OF A TROUBLED WORLD MAY\nWELL DEPEND ON HOW WISELY WE MAKE USE OF RADIO,\" SAYS Or. JAMES “oV'LAND\nAngell, president emeritus of Yale university and NBC educational\ncounselor*, The jowa State Teachers association takes advantage of\nradio's place in education by presenting a dramatic program, \"The Key\nof Liberty*\" This series, heard the fourth Saturday of each month is\nbased on the Educational Policies Commissions significant book, The\nEducation of Free Men in American Democracy.\nLEST WE FORGET - \"We, the people of the United States, in order to form\na more perfect union——\" Every American recognizes that.8\nI, AN AUSTRALIAN - The average Australian knows far more of America than\ndo Americans of Australia* But WSUI listeners have a weekly opportunity\nto learn about the Anzacs each Thursday when Professor Hew Roberts, a\ngraduate of the University of Western Austalia and Merton College of\nOxford, presents \"I, an Australian.\"\nUNITED STATES IN THE TWENTIETH CENTURY -~History DOESN*T cover just\nTHE MEDIEVAL AGES OR PAST YEARS—HISTORY IS BEING MADE RIGHT NOWS AND\nWSUI BRINGS YOU THE \"UNITED STATES IN THE TWENTIETH CENTURY,\" REVIEWED\nby Professor H. J* Thornton of the department of history.\nU. S, DEPARTMENT OF AGRICULTURE - \"FOOD WILL WRITE THE PEACES\" That\nSLOGAN IS THE NUCLEUS OF a SERIES OF BIWEEKLY PROGRAMS OVER WSUI PRE¬\nSENTED IN THE INTEREST OF NATIONAL DEFENSE BY DEPARTMENT OF AGRICULTURE\nDEFENSE BOARDS* A UNITED STATES DEPARTMENT OF AGRICULTURE DEFENSE BOARD\nHAS BEEN ESTABLISHED IN EVERY COUNTY IN IOWA. EACH MEMBER OF THESE\nBOARDS FROM •OWA, JOHNSON, OEDAR, SCOTT, LOU ISA,MUSCAT INE, WASHINGTON,\nHenry, Des Moines, and Lee counties is responsible for several broad¬\ncasts DURING THE YEAR. ThE AGENCIES TO BE REPRESENTED ON THE BROADCAST\nare: The Agricultural Adjustment Administration, the Fiural Electrifi¬\ncation Administration, the Soil Conservation Service, the Farm Credit\nAdministration, the Federal State Cooperative Extension Service, the\nProduction Credit Administration, and the Farm Security Administration*\nUNIVERSITY STUDENT FORUM ON THE AIR - At a time when HASTY CONCLUSIONS\nARE A DANGEROUS EVIL, WSUI OFFERS A PROGRAM WHICH AIMS TO PRESENT 80TH\nSIDES OF CURRENT PROBLEMS, NATIONAL AND INTERNATIONAL. THE \"UNIVERSITY\nStudent Forum of the Air,\" heard each Friday is an attempt to strengthen\nTHE PRINCIPLES OF THE DEMOCRATIC SYSTEM ANO TO SUPPORT OHE AMERICAN\nGOVERNMENT IN THE PRESENT EMERGENCY.\nTHE WEEK IN GOVERNMENT - Your GOVERNMENT IS IMPORTANT TO YOU—BUT DO\nYOU KNOW—00 YOU UNDERSTAND WHAT HAPPENED THIS \"WEEK IN THE GOVERNMENT\"?\nDr. Jack T. Johnson of the department of political science presents\nan inside view of what*s happening in Washington. He goes behind the\nheadlines, explaining events in the international scene and the im¬\nplications of official activity in the United States*\nTranscribed programs,written spot announcements, or other program\nMATERIALS HAVE BEEN USED WHEN SUPPLIED BY THE FOLLOWING GOVERNMENTAL\nagencies: Treasury Department, War Department, unived States Civil\nService, United States Army Recruiting Service, United States Navy,\nFlying Cadet Training, United States Department of Justice, Federal\nSecurity agency, and the United States Maritime Service*"
}