{
  "id": "d1188-4",
  "text": "(5)\nt\nElmer Sulzer has officially and formally invited the gang to hold its meeting\nT THE NIVERSITY OF ENTUCKY. SUGGESTS ONE DAY OF THE MEETING ON THE\nCAMPUS AND ANOTHER AT ONE OF THE MOUNTAIN LISTENING CENTERS. ELMER SAYS*\nBELIEVE THAT MORE EFFORT IN A STUDY OF THE LIKES AND DISLIKES OF THE\nPOTENTIAL LISTENING AUDIENCE AT FIRST HAND (AND NOT OVER THE DESK) WOULD BE\nMOOT VALUABLE TO ALL OUR MEM8ERS•M\nOther places suggested on the\nYou MAY PREFER EVEN OTHERS.\nBALLOT HAVE BEEN PASSED ALONG TO YOUR SECRETARY\nList 'em. List the order of perference.\nWe want to get the place picked no later than December.\nRemember now to mark the dates in your calendar — September 4 and 5.\nCAPTAiJsLKENT CHAIRMAN OF A£R\nCaptain Harold W. Kent, director of the Radio Council of the Chicago Board\nof Education and now on duty in the Public Relations Bureau of the War De¬\npartment, is serving as chairman of the newly formed Association for Educa-\nTION BY RADIOo\nEh!oRIrLh’oM?ERSH,PS ,N THE association are now open to educators, broaocasters\nand others interested in education by radio. See the next packet for\nAPPLICATION BLANKS OR WRITE TO ROBERT HUDSON, ROCKY MOUNTAIN RADIO COUNCIL,\nHudson is serving as executive secretary.\nNAEff SCRIPT EXCHANGE\n°UR 0FT 70 Elmer Sulzer, Bob Allen, and Fred Conger for action on starting\nThE NALB SCRIPT EXCHANGE. Op COURSE, THANKS TO ERWIN A START WAS MADE, OR I\nSHOULD SAY AN ATTEMPT WAS MADE TO SECURE THE PRO FFERED COOPERATION.\nErwin is still hopeful, but certainly the secretary isn't very encouraging.\nThe strains of the songs sung at Purdue were all too familiar to me.\nCALL LETTERS ASSIGNED CH1 CAPO EDUCATIONAL FM STATION\nWBEZ WILL BE THE CALL LETTERS OF THE CHICAGO BOARD OF EdUCATION*S NEW FM\nstation. Work is proceeding on the construction of the station, a Chicago\nRADIO MANUFACTURER IS DEVELOPING AN FM SET ESPECIALLY FOR USE IN THE CHICAGO\nPublic Schools.\nThe Raoio Council of the Chicago schools resumed its 10 regular in-school\nSERIES AND TWO LEISURE TIME PROGRAMS DURING THE WEEK OF OCTOBER 6.\nDOPE FROM W B A A\nA NOTE FROM OR. M. D. STEER AND ONE\nINFORMATION OF SPEECH EQUIPMENT OF !\nfrom Cibb Williams advise me that requested\nNTEREST TO BROAOCASTERS ANO ON WfJAA SOUND"
}