{
  "id": "d430-110",
  "text": "LEARNING AND ATTITUDE CHANGES\nFROM VIEWING A TELEVISION SERIES,\nRESULTING\n‘BON VOYAG\nBy WILLIAM A. BELSON\n{Research Psychologist, Audience Research Department, B.B.C.)\nI.—Introduction and aims. II.—Method: (1) design ; (2) subjects ; (3) test\nprocedure. III.—•Findings : (1) details related to the design and to the analysis ;\n(2) effects of the programme. IV.—Summary.\nI.—Introduction and aims.\n‘ Bon Voyage ’ was a series of four television broadcasts included in successive\neditions of ' Leisure and Pleasure ’ (a Tuesday afternoon programme for women)\nfrom August 11th to September 1st, 1953. It was broadcast because the large\nannual flow of English visitors to France suggested that viewers contemplating\na first visit to France might welcome a programme which, in an entertaining\nway, taught them useful words and phrases and gave them information such as\nwhere to get a passport, the value of French money, and how to use the Paris\nUnderground. It was hoped that the programmes would also serve to allay\napprehensions about making a first visit to France, particularly those appre¬\nhensions which spring from an inadequate knowledge of the language.\nThe programme was built around conversations between two people, one\nof them giving facts and the other asking questions. There was constant visual\nillustrations, sometimes in the form of film, sometimes through the showing of\nobjects (e.g., pieces of French money), and on one occasion through a dramatised\nsketch. The first programme dealt mainly with what was involved in actually\ngetting to France, the second with the buying of food and drink, the next with\nsight-seeing and the last with buying useful items and returning to England.\nMany of the French words and phrases were presented in caption form. Where\npossible, they were illustrated pictorially, and in all cases they were presented\nin the type of situation in which the visitor would be likely to need them. There\nwas quite a lot of planned repetition (of the French words and their English\nmeanings) and in the last of the programmes there was a re-presentation of the\nmain words given during the series.\nThe purpose of this study was to find out to what extent the aims of the\nprogramme were achieved. Accordingly, the inquiry was addressed to three\nquestions, namely, to what extent did viewers {a) learn the French words and\nphrases presented, (6) learn the general information presented, (c) sustain a\nreduction in their apprehensions about language and other difficulties involved\nin making a trip to France.\nII.—Method.\n(1) Design1.—A research design sometimes advocated for studying the\neffects of exposing people to certain conditions involves the making of measure¬\nments before and after that exposure, a control group being used to assess (and\nthereafter eliminate) the effects of purely extraneous events or influences. For\n1 The conduct of this study involved several statistical and methodological innovations,\nbut it was considered better to by-pass these as much as possible in the present paper so\nthat the main findings might emerge more clearly. A full description of them in the context\nof this study is, however, available in the writer’s unpublished paper “ A Technique for\nStudying the Effects of a Television Broadcast : Learning and Attitude Changes.”\n31"
}