{
  "id": "d430-111",
  "text": "32\nLearning and Attitude Changes\ntwo reasons, however, it is not generally possible to use this approach in studies\nof the effects of broadcasts. In the first place, it is essential that the listening or\nviewing upon which the results are to be based should be entirely normal (i.e.,\nnot influenced either by pre-broadcast testing or by any knowledge that tests\nare to occur). Secondly, it is often impossible with television broadcasts, to say\nin advance of the programme precisely what its content will be—as would be\nnecessary in a comparison of ‘ before ’ and ' after ’ knowledge of specific words\nor facts. For these reasons it is necessary that a research design be used which\nallows all th^necessary testing to be done after the broadcast.\nAccordingly, immediately after the last broadcast in the ' Bon Voyage ’\nseries (of four programmes) relevant knowledge and attitude tests were made on\neach of two large groups of people. One group was made up of viewers who had\nseen one or more of the four ‘ Bon Voyage ’ programmes, while the other group\nconsisted of people who did not have television sets and who had not seen any\nof the ‘ Bon Voyage ’ programmes. Each group was tested for its knowledge of\nthe French words and phrases and of the facts presented in ‘Bon Voyage ’\nand after this came an assessment of those attitudes which it was thought the\nseries might affect.\nDifferences between the two groups in respect of these tests would, of\ncourse, be attributable to a combination of (a) the effect of the programme and\n(b) pre-broadcast differences between the two groups (i.e., members of the viewing\ngroup might, prior to the broadcast of the series, have known more or less of the\nwords and phrases eventually presented than did the non-viewing group).\nTo eliminate that portion of the difference between the two groups which arose\nout of such pre-broadcast differences, a refinement of normal matching technique\nwas used.\nThe general principle of this refinement can be stated quite briefly. What\nusually happens in matching procedure is that some members of either group are\nrejected until the two groups are the same in terms of one or more characteristics\nwhich the research worker thinks are the important ones (e.g., age, educational\nlevel, intelligence). The present technique differs from this in two respects. Firstly,\nthe various characteristics in respect of which, matching is to be done are selected\nempirically as the best of those immediately available. Secondly, there is no discard¬\ning of subjects : instead, the score of the non-viewer group is adjusted through a\nregression equation or through a simple weighting of sub-groups to provide an\nestimate of what it would have been had the two groups not differed in respect of the\nmatching characteristics. A comparison of this adjusted score with the score of the\nviewer group then provides a direct estimate of the programme’s real effect. Since\nin this study the non-viewing group is being used to provide estimates of the pre¬\nbroadcast scores of the viewing group, the convention is adopted here of referring to\nthese adjusted scores as the pre-broadcast scores of the viewing group.\nTo put this method into effect, however, it is necessary to include in the testing\nprocedure assessments of a range of those characteristics which seem likely to be\nrelevant as matching criteria. At the end of testing it is then possible (through\ncorrelation methods) to determine which combination of these characteristics gives\nthe highest multiple correlation with the variable being studied2—i.e., which of them\nare the best available criteria for matching purposes. Since in this project three\nseparate variables were being studied, separate matching criteria had to be set up for\neach. Some details of these matching variables are given in this section and there is a\nbrief account, in ‘ Results,’ of the selection procedure and its outcome.\nOne final feature of the technique is that a system of built-in checks is used to\nshow to what extent the matching procedure has been successful in eliminating the\n(expected) pre-broadcast differences betw en the two groups. Details are given in\nan appendix obtainable from the Documents Unit of the DSIR.\n2 Using the Wherry-Doolittle formulae."
}