{
  "id": "d430-112",
  "text": "William A. Belson\n33\n(2) Subjects.—Viewers who had seen one or more of the ‘ Bon Voyage ’\nprogrammes were available from either of two sources. In the first place, the\nB.B.C.’s Audience Research Department conducts daily surveys of listening and\nviewing which provide information about which programmes people happened to\nhear or view on the previous day; in the course of this survey a record is made,\nfor each person interviewed, of name, address, social group, occupation, age, sex,\nand various other details. The names and addresses of persons who happened\nto hear one or more of the first three ‘ Bon Voyage ’ programmes were, therefore,\navailable before the last broadcast took place. In the second place, members\nof the B.B.C.’s viewing panel normally complete reports on programmes which\nthey happen to view in the ordinary course of events. Here, too, it was possible\nto note the names of those people who had been exposed to at least one of the\n‘ Bon Voyage ’ programmes. Letters of invitation were sent to people selected\nfrom each of these two sources, provided they lived within travelling distance\nof Broadcasting House (where the tests were to be made). In all, 42 per cent, of\nthose viewers who were invited attended the session. Non-viewers were recruited\nmainly from the records available from the Survey of Listening and Viewing\nand some 35 per cent, of those invited attended. Care was taken, of course,\nthat the manner of recruiting and assembling the groups should not (prior to the\noccurrence of the tests) have any influence at all upon normal post-broadcast\nconcern with the series or any of its content.\nIn the selection of each group, a standard technique was used to reduce volunteer\nbias. The normal audience of ‘ Leisure and Pleasure ’ (the programme within which\n‘ Bon Voyage ’ appeared) was classified in terms of age, sex and social group.\nPrevious work had established the attendance rate to be expected, using standard\nletters of invitation, within each ‘ age /social class ’ sub-group, and these rates were\ntaken into consideration in issuing invitations, the aim being to ensure that with\neach group the people who actually came were representative of the ‘ Leisure and\nPleasure ’ audience in terms of age, sex and social group. One outcome of this was,\nof course, a rough matching of these two groups, though it could never be assumed\nthat matching in terms of age, sex and social class was sufficient for the purpose in\nhand.\nIn all, approximately 100 viewers and 120 non-viewers came as invited to\nBroadcasting House, meeting in the evening in groups of 15 to 25. Viewers and non¬\nviewers met separately. The first of the viewer meetings occurred two days after the\nlast of the ‘ Bon Voyage ’ broadcasts and the other meetings followed on consecutive\nevenings, viewer and non-viewer meetings being held simultaneously or alternately.\n(3) ' Test procedure.—While a certain amount of each evening was devoted\nto orienting the groups to the tests ahead, the essential steps were as follows.\nMembers of the groups (a) were ‘ reminded ’ in some detail of the four ‘ Bon\nVoyage ’ programmes and were asked in each case to write down whether or not\nthey had viewed it; (b) were given a list of twenty-six of the French words and\nphrases presented in ‘ Bon Voyage ’ and were asked to write down each one’s\nEnglish meaning opposite it ; (c) were given the same list of twenty-six words\nand phrases and asked to choose the correct meaning from six proffered words\n(multiple choice) ;3 (d) were asked to write down answers to a number of\nquestions about facts actually presented in the programme ; (e) were given an\nattitude test dealing with issues concerned directly or indirectly with making a\ntrip to France.\nThe list of French words and phrases contained such terms as ‘ parlez vous\nAnglais,’ ‘ ou est,’ ‘ l’addition,’ ‘ timbre,’ ‘ douane,’ ‘ pourboire,’ ‘ la gare\n3 The reason for testing by both creative response and multiple choice methods was to\nprovide an estimate of learning at each of two different levels of intensity, thereby broaden¬\ning the picture of effect achieved."
}