{
  "id": "d430-115",
  "text": "36\nLearning and Attitude Changes\nTABLE II\nChanges Produced (Post Broadcast Groups).\nVariable under study\nNon viewers’ Scores\nUnadjusted Adjusted\nAverages Averages\nViewers’\nScores\n(Averages)\nSignificance\nof Difference\nKnowledge of words pre¬\nsented in ‘ Bon Voyage ’\nCreative Response1\nMultiple Choice1 .\n4 -894\n9-47\n5-31\n9-97\n6-21\n11-68\nP= -023\nP= -001\nKnowledge of facts pre¬\nsented in ‘ Bon Voyage ’2\n8-54\n9-08\n10-10\nP= -021\nAttitude on issues related\nto visiting France.3\n+ 15-38\n+ 17-65\n+ 11-80\nP= -005\n1 Score out of 26.\n2 Score out of 29.\n3 +17-65 represents a relatively favourable and confident attitude.\n4 These figures are unadjusted for ‘ attendance bias ’ (i.e., less than half the people\ninvited actually attended) ; when such adjustments are made, however, the estimates of\namount of change produced by the programme are virtually unaffected.\nThe figures in this table, taken along with those given in the appendix,4\nconstitute fairly conclusive evidence that the programme ‘ Bon Voyage ’ has\nled to a small but definite increase in its viewers’ knowledge of both (a) the\nFrench words and phrases presented and (b) the facts presented, and that it has\nalso produced a somewhat less favourable attitude towards visiting France.\nThe change in word knowledge at the creative response level was from 5 -3\nwords known out of the twenty-six to 6-2 out of twenty-six (i.e., about 4 per\ncent, of the words which were new to the viewer were learned) ; at the multiple\nchoice level it was from 10-0 to 11-7 (an 11 per cent. gain). Put another way,'\nthis means that there was a 4 per cent, gain at the level of actually volunteering\nthe correct meaning and a further 7 per cent, at the level of merely recognising\nthe right word (i.e., if it were seen). The score for factual knowledge rose from\n9-1 out of twenty-nine to 10-1 (a gain of about 5 per cent.). Examples of the\nquestions asked have already been given and it may be taken that the score of\n9*1 means that viewers had, prior to the broadcast, a reasonable grasp of-a little\nless than a third of the facts on which questions were asked.\nA number of' circumstances appear to have contributed to the relative\nsmallness of these gains—-circumstances which, it is important to note, are likely\nto dominate or to condition those teaching programmes which are meant to reach\na wide or general viewing public. In the first place, ‘ Bon Voyage ’ was presented\nwithin the context of a larger, regular Tuesday programme for housewives.\nWhile this gave it a wide audience, it seems unlikely that the persons exposed to\nit tuned in specially for the teaching aspect of this somewhat a-typical section\nof the full programme ; they appear, rather, to have been quite ordinary house¬\nwives, undistinguished by any particular desire to improve their French—as\ndistinct from, say, an adult education class in French. In the second place, to\nhold this wide audience, the programme had to be a piece of genuine entertain¬\nment and this put an obvious limit upon the rigorousness of the teaching method\nwhich could be used. Thirdly, while there was no progressive fall in the size of\nthe audience seeing successive programmes in the series, there was relatively"
}