{
  "id": "d430-122",
  "text": "202\nAUDIO-VISUAL COMMUNICATION REVIEW\nRESEARCH PROJECTS—FALL 1955\nNine courses were taught over closed-circuit television during\nthe fall semester of 1955. These included: Air Science, General\nChemistry (2 sections), Business Law, General Psychology (2 sec¬\ntions), Psychology of Marriage, Principles of Economics, Music\nAppreciation, Introduction to Education, and General Speech.\nTwenty-four instructors and 2,400 students were involved in\nthe various experiments during th§ semester. In all, about 17\nexperiments were conducted. Several of these included comparisons\nof televised and face-to-face instruction, but in the main they dealt\nwith different and more detailed problems. It should be noted\nthat some of the same problems were studied in the context of\nseveral different courses.\nThe problems may be classified under four main headings:\n1. The effects on student achievement of varying the size of\nthe classes in the TV receiving classrooms (range studied: 15 to\n200 students).\n2. The effects on achievement of the use of assistants to super¬\nvise television classes.\na. Amount of supervision (range studied: none to full¬\ntime supervision).\nb. Kind of supervisor—student peer, seniors, graduate\nassistants, faculty.\n3. The effects on students’ achievement and attitudes of sev¬\neral different patterns of instruction designed to provide for stu¬\ndents’ questions, discussion, and problem solving:\na. Two-way microphone system.\nb. Thirty-five minute lecture plus 15-minute discussion\nperiod led by graduate assistants.\nc. Two lectures a week followed by a full period of dis¬\ncussion and problem solving led by graduate assistants.\nd. Rotation of groups into and out of the TV origination\nroom where the principal instructor presented the\ninstruction.\n4. The use of a “free-choice” situation as a measure of stu¬\ndents’ attitudes towards the acceptance of televised instruction.\nIt would seem that closed-circuit television provides unusual\nopportunities for educational research. In a given course it is"
}