{
  "id": "d430-124",
  "text": "204\nAUDIO-VISUAL COMMUNICATION REVIEW\nsignificantly higher mean achievement score than the other groups.\nOn the second examination no significant differences were found\nbetween this group and other comparable groups.\nAmount of supervision. The amount of supervision in the\nseveral television receiving rooms was varied in the Psychology\ncourse during the second five weeks of the semester. Some classes\nhad no supervision except for a graduate assistant who recorded\nattendance and then left the room. Other classes were supervised\nfor part of each class period (one assistant monitored several\nrooms). Finally, some classes had full-time supervision. During\nthis part of the study the graduate assistants merely kept attend¬\nance records, acted as observers and maintained a “reasonable”\nlevel of discipline. They were also rotated among the groups.\nComparisons of the achievement scores of the groups revealed\nno significant differences as a result of these varied treatments of\nsupervision or “monitoring.”\nKind of supervisor used. During the first semester of the\nproject faculty members were used as observers and supervisors in\nthe TV receiving rooms. Graduate students were used as teaching\nassistants in most TV classes during the fall semester of 1955.\nHowever, in the Air Science course it was possible to conduct an\nexperiment in which proctors of varying status were used in the\ndifferent receiving rooms. These rooms were supervised: (a) by\na staff instructor, (b) by a cadet officer (senior), (c) by a student\nselected from the class, and finally, (d) one classroom was unproc-\ntored. Comparisons of students’ mean achievement scores among\nall these groups revealed no significant differences.\nIt should be noted here that students in the ROTC classes are\naccustomed to discipline in their military classes, and thus these\nsituations may not be typical of other college classrooms. For\nexample, in one course, Music Appreciation, it was not possible to\nprovide a teaching assistant in each room at all times. A staff\nmember recorded attendance in each class, then left. Many students\nin this course reported on an attitude survey that they were dis¬\nturbed by other students who talked during the playing of musical\nselections. An effort was made to reduce talking by an appeal to\nstudents to develop an honor system and to exercise self-discipline.\nDuring the current semester (spring 1956) most television\nclasses are supervised either by seniors or by graduate assistants\nwho perform a variety of tasks."
}