{
  "id": "d430-125",
  "text": "FURTHER STUDIES OF THE USE OF TELEVISION 205\nThe me of two-way communication system. One approach to\nthe problem of providing for questions from students in TV class¬\nrooms is to install two-way communication between these and the\norigination room. In the Air Science course during the final five\nweeks of the semester it was possible to make comparisons between\nthe achievement of students in two rooms equipped with micro¬\nphones and the achievement of students in two rooms not so\nequipped.\nFrom time to time during his presentation the instructor\nwould pause and ask for questions. Students in the rooms with\nmicrophones would then ask questions which would be repeated\nand answered by the instructor so that everyone could hear them.\nStudents asked a number of questions but comparisons of achieve¬\nment scores of the groups showed no significant differences; nor\nwere there differences in general attitude towards the course as a\nresult of opportunities for two-way communication. This method\nwill be given further study in other courses.\nThirty-five-minute lecture followed by 15-minute discmsion.\nDuring the last five weeks of the General Psychology course it was\npossible to make experimental comparisons between several treat¬\nments which involved a 35-minute lecture presentation followed by\na 15-minute discussion period used in the following ways:\n1. Some groups of students had a 15-minute discussion led\nby graduate students. The principal instructor provided some\nmaterial to be used for “starter” questions if necessary.\n2. Some groups by means of TV observed and listened to a\ndiscussion conducted by the principal instructor with a group of\neight students in the origination room. This observation of discus¬\nsion was called “vicarious” discussion.\n3. Other groups were given no opportunity for such discus¬\nsion. These students could study their notes or textbooks or leave\nthe classroom.\nAnalysis of results indicated no significant differences in\nacademic achievement; nor were there differences in general atti¬\ntude toward the course as indicated by a rating of level of apprecia¬\ntion of the course. However, there was a highly significant differ¬\nence (p<.01) in attitude toward the discussion arrangement.\nThe groups which were given an opportunity for direct discussion\nwere much more favorable toward this discussion arrangement\nthan were students who “listened in” or did not have any discus-"
}