{
  "id": "d430-131",
  "text": "FURTHER STUDIES OF THE USE OF TELEVISION 211\n4. Room conditions and seats were more comfortable in the\nsmaller TV receiving rooms.\nThe reasons given for remaining in the large auditorium were:\n1. Color in the demonstrations was considered important.\n2. Smells produced by chemical reactions were considered\nimportant.\n3. The blackboard was visible for longer periods, even after\nthe professor had progressed to a new topic.\n4. Some expressed a vague feeling that it was better to stay in\nthe large auditorium even if the seats assigned were at the rear of\nthe room,\n5. A few expected to be moved up to the front of the room.\nThe students were also asked how certain they were that they\nhad made the right choice. The students in the TV rooms were\nmore certain than were those who remained in the rear half of the\nlarge auditorium. This may be an indication of the fact that only\nthe students who had definitely positive attitudes towards televised\ninstruction moved out of the large auditorium, whereas those who\nremained included, in addition to those who might be strongly\nnegative, a proportion who were neutral or somewhat ambivalent.\nMost of the attitude questionnaires in the various courses have\nindicated a fairly large neutral group.\nOther problems. Two other problems were investigated. Dur¬\ning the first semester (spring 1955) many students in the\nChemistry course reported that note-taking was a problem because\nthe cameras did not remain focused on the blackboard notations\nafter the instructor had commenced to develop a new topic. In an\nattempt to remedy this problem mimeographed lecture outlines\n(one to two pages per lecture) were provided for all students in the\ncourse during the semester under review (fall 1955). In response\nto a questionnaire about the difficulties of note-taking in this\ncourse, most students indicated “fairly easy,” and there was no\nmarked difference between the responses of the students in the\nlarge auditorium and those in the TV classrooms. Prepared notes\nseemed to solve the problem.\nThe question of viewing distance from a TV receiver was also\nstudied to a limited extent. In general, a standard has been adopted\nwhich is based on some earlier research by the Instructional Film"
}