{
  "id": "d430-133",
  "text": "FURTHER STUDIES OF THE USE OF TELEVISION 213\nmaterial presented in the lectures in addition to that available in\nthe textbooks. Where appropriate, problem-type items are included\nwhich are intended to test knowledge and application of principles\nas well as recall of detailed facts.\nSpecial efforts are being made to develop tests for measuring\nlearning which results from the visual presentation of material.\nWORK IN PROGRESS DURING THE SPRING 1956 SEMESTER\nDuring the spring 1956 semester, 12 courses are being presented\nover television with a total of 14 sections: General Psychology\n(2 sections), Introductory Accounting, Principles of Economics,\nGeneral Speech, Business Law, Political Science, Sociology, Music\nAppreciation, Air Science, Introductory Course—Education, Gen¬\neral Chemistry (2 sections), and Electrical Engineering. These are\nprincipally introductory courses in which enrolment pressures are\nhigh. Some 3300 students are involved and there are 38 hours of\ntelevised classes each week. The problems under study may be\nsummarized briefly as follows.\n1. Adaptation. During the first semester of the project\ncourses were televised with little'Or no adaptation to television. In\nthe fall 1955 semester instructors in various courses began to\nexplore the possibilities of making use of the potentialities offered\nby television for presentation of instructional materials. It was\napparent that much could be done in this direction without making\na classroom presentation into a commercial “show.” During the\ncurrent semester more systematic efforts are being made to capital¬\nize on the potentials of television for presenting close-ups, demon¬\nstrations, short films, guest speakers, discussion panels, still pic¬\ntures, slides, diagrams, and other graphics. Some instructors are\noriginating their presentations from a small classroom with no\nstudents present; others have 15 or 20 students in the origination\nroom; still others prefer a large origination room with 100 to 150\nstudents.\n2. Teaching assistants in TV classrooms. Efforts are being\nmade to use teaching assistants more effectively in the TV class¬\nrooms. Their duties may include: taking attendance, leading dis¬\ncussion sections, answering questions, proctoring examinations,\nwriting examination questions, correcting examinations, counseling\nstudents individually or in small groups out of class, keeping care¬\nful records of what is taught, systematically observing student"
}