{
  "id": "d430-134",
  "text": "214\nAUDIO-VISUAL COMMUNICATION REVIEW\nbehavior, and meeting with the principal instructor to discuss\nteaching methods and to report student reactions to the\npresentations.\n3. The free-choice technique is being extended to two other\ncourses—Political Science and Business Law. In the Political\nScience course approximately 220 students were given five weeks of\ninstruction in TV receiving rooms followed by five weeks of instruc¬\ntion in a lecture auditorium. Following this the students were\nasked to express their preference for televised or face-to-face\ninstruction for the remainder of the semester. These verbal prefer¬\nences indicated that 51 percent would prefer televised instruction\nand 49 percent face-to-face instruction in the auditorium. A week\nlater the students were told that they would have a free choice\nbetween instruction in the TV receiving rooms and face-to-face\ninstruction in the auditorium. This free choice was repeated on\ntwo successive class periods. The actual choices showed that 71\npercent of the students went to the TV receiving rooms and 29 per¬\ncent to the auditorium where the instruction originated for the\nremainder of the semester. A follow-up study is being made of the\nstudents whose actual behavior was different from their verbal\nexpression of preference.\nIn the Business Law course after eight weeks of instruction\nin which groups of students rotated every two weeks between the\nTV receiving rooms and the lecture auditorium the students were\nasked to express a verbal preference for the remainder of the\nsemester. Forty-two percent indicated a preference for television,\n54 percent preferred face-to-face instruction, and 4 percent indi¬\ncated no preference. A week later when an actual free choice was\ngiven 47 percent of the students went to the TV classrooms and\n53 percent to the lecture auditorium.\n4. Additional courses are being sampled for appropriateness\n(four new courses have been added) and are in exploratory periods\npreparatory for experimentation.\n5. Other ways of using TV are being investigated, for example,\nas a means of fully utilizing large auditoriums, by televising the\ndemonstrations through four or six receivers situated in the same\nroom.\n6. Several equipment problems are being studied. Comparisons\nare being made among several methods of sending the television\nsignals to the receiving classrooms. Work is being done to deter-"
}