{
  "id": "d1274-0",
  "text": "September 1J> 1964\nVolume V Number 14\nADDITIONAL TEACHERS NEEDED FOR SAMOA\nThere is an immediate need for ten additional elementary teacher-principals\nfor the new elementary television schools in American Samoa. Because of an unex¬\npected spurt in construction, ten additional new consolidated elementary television\nschools will be ready for opening this month. Each of these schools must have a\nqualified American elementary school teacher, who has had experience in using\ntelevision instruction in the classroom, in charge as principal.\nThe American principal will supervise the native Samoan teachers in the use of\ntelevision instruction and related classroom techniques. They will live in a new\nmodern home at the school site located in a native village, but will be in constant\ncommunication with the television instruction center.\nPersons who are selected for these new and interesting positions will have\na unique opportunity to participate in a totally new development in educational\nmethods that is attracting world-wide attention. The salary is excellent and the\ncollateral benefits and working conditions are attractive. The Samoan climate is\ntropical and healthful and the scenery is among the most beautiful in the world.\nThe contract period is two years, but can be extended indefinitely. Trans¬\nportation is provided two ways for employees and all dependents, and personal\nand household goods are packed and shipped without cost.\nQualified elementary teachers with television utilization experience who are\ninterested may have an immediate interview by phoning, writing or wiring NAEB\nHeadquarters in Washington.\nHILLIARD APPOINTED TO FCC POST\nDr. Robert Hilliard has been appointed Chief of the Educational Broadcasting\nBranch of the Federal Communications Commission. He succeeds Dr. Lawrence Frymire\nwho resigned in August. Hilliard leaves his post as Associate Professor in the\nDepartment of Radio-Television-Motion Pictures at the University of North Carolina\nto accept the FCC position sometime in mid-October.\nDr. Hilliard edited Understanding Television, published this summer by\nHastings House, and is the author of Writing for Television and Radio, published\nin 1962 by Hastings House. He received a Ph.D. from Columbia University in 1959,\nand was a consultant to the Division of Educational Communications in the New York\nState EducationDepartment in 1962-1963*"
}