{
  "id": "d720-2",
  "text": "Article VIII - Annual Meeting\nSec. 1* The Annual Meeting of the Association shall be the annual meeting of its\nloerJTof Directors.\nSec. 2. The Annual Meeting shall be held at the time and place designated by the\nExecutive Committee, providing that the date shall not be earlier than April 1\nnor later than June 1 in each calendar year.\nArticle IX - local Chapters\nSec. 1. Local and regional chapters of AERT members may be formed upon written\napplication to the National Board of Directors. Application shall include copy\nof the local constitution and a roster of a Eiinimum of 12 active members. Chapters\nwill operate in the manner prescribed in the By-laws.\nArticle X - Vacancies in Office\nSec. 1# All vacancies in the offices of the Association and in its Board of Directors\nshall be filled by appointment of the Board of Directors until the next annual election\nof officers*\n< Article XI - Amendments\nSec* 1. Proposals for amendments to the Constitution may be made by the Board of\nDirectors, and must be made by the Board of Directors upon initiative petition\nsigned by fifty active members of the Association.\nSec. 2. Proposals for amendments to the Constitution must be circulated among\n‘^Ke\" active members of the Association not less than two months nor more than four\nmonths before they are submitted to vote of the membership. Circulation shall be\neither by mail or by means of publication in the official organ of the Association*\nSec* 3* Voting on amendments on the Constitution shall be by mail ballot. The\nratloS and a full statement of the proposed amendment shall reach the active\nmembers of the Association not less than thirty days before the date set for the\nvote on the amendment. Distribution of the ballots and the accompanying proposal\nshall be by mail or by means of publication in the official organ of the Association*\nSec* iw Actual amendment to the Constitution shall be by an affirmative vote of\ntwo-thirds of those active members of the Association voting on the proposal."
}