{
  "id": "d720-33",
  "text": "THE MASSACHUSETTS ASSOCIATION FOR BETTER RADIO AND TELEVISION\nANNUAL REPORT 1954-1955\nThe year 1954-1955 indicates many different trends in the emphasis placed on Television, especially Educational Television,\nand Radio Programs. Our Association has attempted to keep pace with the advances made and in accordance with our policy,\nhas helped to encourage and to promote the programs enjoyed by our members and friends. How has this been accomplished?\nL PROTECTS\n1. A questionnaire was sent to members and others interested asking them to list (a) programs they had enjoyed with their\nchildren (b) programs they had enjoyed watching with adults. The tabulated results were sent to our members and to the\nBroadcasting Stations, the Stations in turn sent us the programs which they classified as “best.”\n2. A Pilot Study of Television Viewing made by the Massachusetts Department of Education, MAFBRAT, and a group of\ngreater Boston High School Students. This Study was an outgrowth of a previous Study made but with a different approach.\nThe 1952-1953 Study was made in the Boston Public Schools, grades 9-12, also some independent and suburban schools. Ques¬\ntionnaires were prepared and filled out by the students. The 1954-1955 Study was based upon the students’ own comments and\nevaluations. They met several times as a Committee with Mr. Kelsey B. Sweatt and Dr. Frank Hawkes of the State Board of\nEducation and two members of MAFBRAT. The State Board cooperated magnificently in issuing a report on the results of\nthe Study. The reports of both studies had a wide circulation.\n3. A Survey of Public Opinion is in process at the present time to ascertain what kind of programs people would like to see\non Educational Television. (See sheet enclosed). The answers will be checked in early Fall and the results sent to\nmembers and to Broadcasting Stations.\nII. MEETINGS\nThe Executive Board has met once a month and has held two special meetings.\n1. In December, we tendered a Reception to Dr. Harry Lyle, Director of the Commonwealth of Massachusetts Board of\nEducational Television. Dr. Lyle, who had recently come to Boston, told us what he would like to see accomplished on his\nProgram.\n2. In January, we held a cooperative meeting with the Boston Branch of the American Association of University Women at\nwhich time the Students’ Committee participated in a Panel Discussion with Mr. Sweatt and Dr. Hawkes as leaders. It was\nespecially gratifying to have parents of the students in the audience and to enter into the discussion.\n3. In April, Mr. Edward G. Sherburne, Jr., recently appointed Director of Programs, WGBH-TV, Educational Channel 2,\nwas our speaker. He gave a very clear presentation of the plans underway for Channel 2. The Programs began May 2.\nMr. Sherburne was very ready to answer questions which were uppermost in the minds of many present.\nIII. MISCELLANEOUS\n1. We have continued our cooperation with TV and Radio Stations, with the Citizens’ Committee for Educational TV, and\nwith many other groups.\n2. We subscribed for the Scholastic Magazine in order to have a clearer understanding of the interests of high school students.\n3. A representative from our Board was a delegate to the four UNESCO Workshops held at Boston University. The Na¬\ntional Committee on UNESCO requested the University to hold these Workshops. A report of the results will be sent to the\nNational Committee.\n4. A course on Television will be given at Emerson College next Fall, we hope many of our members will be interested to\nconfer with Prof. Dudley for further details.\n5. Our sincere thanks go to President McKinley of Emerson College for his unusual cooperation in permitting our Associa¬\ntion to hold all meetings, executive and general, at the College. This has been a great asset in many ways.\nWe have received many helpful suggestions from our members as to what they would like to have MAFBRAT do. We are eager to\nhave more. Please send them to our Secretary, Marie L. Paraboschi, 3825 Washington St., Roslindale.\nWe need more members. The larger the membership, the more we can increase our usefulness to the community. Send in your\ndues and get others to join us. Try to get at least one new member.\nRespectfully submitted by the Executive Board, MAFBRAT\nOFFICERS 1955-1956\nDirectors\nPresident .\nVice-President .\nRecording Secretatry\nTreasurer___\n_ Dr. Mabelle B. Blake\n... Mrs. Francis C. Welch\nMiss Marie L. Paraboschi\n..Mr. John M. Lord\nMrs. Mary Craven\nProf. Charles Dudley\nMrs. Anthony DiCredico\nMr. Norman Meyer\nMr. Kelsey B. Sweatt\nMrs. J. K. Roulston\nMrs. Herbert Wollner\nMr. Roy V. Whisnand"
}