{
  "id": "d720-4",
  "text": "- 5 -\nArticle II - Duties of Officers\nSec# It President# The president shall preside at the meetings of the Association*\nand at the meetings of its Board of Directors and of its Executive Committee. He\nshall appoint all committees not otherwise provided for in the By-laws. He shall*\nin consultation with the Executive Committee* prepare programs for meetings of the\nAssociation. He shall call meetings of the Board of Directors or of the Executive\nCommittee whenever he deems it necessary or whenever he is requested to do so by\nthe majority of the membership of either body respectively# He shall perform all\nother duties usually pertaining to the office of president#\nSy * 2# First Vice-Fr esidyt» The first vice-president shall assume the duties\no? the president in case of vacancy in the latter*s office* or while the president\nis unable to perform his duties because of absence or illness.\nSec# 3# Second Vice-President# The second vice-president shall assume the duties\nof the president in ease of vacancy in the office of the president and first vice=*\npresident* or in the event of the illness or absence of both the president and the\nfirst vice-president#\nSec# U# Secretary# The secretary shall keep a full and accurate record of the\nproceedings of all meetings of the Association* of its Board of Directors, and\nof its Executive Committee# Upon notification by the president of a meeting of\nthe Board of Directors or of the Executive Committee* the secretary shall mail\nnotices to all members of the group involved at least fifteen days prior to the\ndate of the meeting# The secretary shall notify the treasurer of actions by the\nExecutive Committee approving the disbursement of funds.\nSec# Treasurer# The treasurer shall receive and hold in safekeeping all\nmoneys paiS to the Association# He shall make investments of surplus funds in\nthe treasury of the Association upon direction of* or with the approval of, the\nExecutive Committee# He shall give such bond as may be required by the Executive\nCommittee with the cost of such bond to be at the expense of the Association. The\ntreasurer shall make disbursement of funds of the Association as directed by the\nExecutive Committee. The treasurer shall submit monthly financial reports to the\npresent, to the chairman of the budget committee* and to such other individuals\nas the Executive Committee shall direct# Each year as soon as possible after the\nclose of the fiscal year on April 30* but in no event later than July 1* the\ntreasurer shall have an audit of the books conducted by an auditor selected or\napproved by the Executive Committee. Copies of the audit shall be mailed by\nthe treasurer* promptly upon completion* to all members of the Executive Committee.\nSec. 6# Board of Directors. The Constitution provides that the Board of Directors\nsffiCTbe the“p61icy‘1TnhPfIng“agency of the Association. Hence it provides, further,\nthat the Board may propose to the members that amendments be made to the Constitution.\nChanges in the By-laws of the Association shall be at the discretion of the Board\nas provided later in the By-laws# The Board shall examine the Constitution and by*\nlaws of local and state organizations seeking recognition as chapters of the\nAssociation to determine that they are consistent with the Gpnstit tion and By-laws\nof the Association."
}