{
  "id": "d720-5",
  "text": "Business may be transacted by the Board by mail, in which event every member of\nthe Board shall be notified by the secretary by registered mail of the proposal\nat least thirty days before the date designated for the counting of votes of the\nmembers of the Board. Responses are to be returned by registered mail to the\nsecretary who shall notify all members of the Executive Committee promptly of the\nresults of the mail vote. Affirmative votes of the majority of those Board\nmembers voting shall authorize action except in those instances where a two-thirds\nvote is especially stipulated in the Constitution or By-laws, in which event the\naffirmative vote of two-thirds of those members of the Board actually voting shall\nfulfill the requirements.\nIn actual meetings of the Board the presence of one-third of the members shall\nconstitute a quorum. The annual meeting of the Board shall be open to all members\nof the Association.\nThe Constitution provides that the Board shall be the governing agency of the\nAssociation. Therefore, the Board shall determine the amounts of money to be\nexpended by the Association in its various areas of activity.\nSec. 7. Executive Committee. The Constitution establishes the Executive Committee\nSuTTEe admir^strative agency of the Association. It shall assist the treasurer\nin preparing a proposed budget for action by the Board of Directors at its annual\nmeeting. The Executive Committee shall authorize the disbursement of funds wiuiln\nthe budget approved by the Board. The Executive Committee shall determine the\ntime and place of the annual meeting and shall assist the president in arranging\nits program. It shall receive and act upon reports of all committees. It shall\nemploy such assistance as it deems justified to carry out the activities of the\nAssociation within the budgetary provisions approved by the Board. In no more\nthan four years duration.\nA majority of members of the Executive Committee shall constitute a quorum.\nBus:J ness may be transacted by the Executive Committee on the basis of mail votes\nprovided the secretary shall, at the request of the president, or a majority of\nthe Committee, distribute the items for action by registered mail fifteen days\nbefore a date designated for counting of votes. Members of the Committee shall\nreturn their votes by registered mail to the secretary before the designated date.\nThe secretary shall notify all members of the Committee promptly of the results\nof mail votes. Action shall be by a majority vote of those members of the\nCommittee voting#\nThe Executive Committee shall review the ballots received by the Secretary in\nall mail votes by the Committee and the Board at the first meeting of the\nExecutive Committee after such balloting has been recorded.\nSec. 8. Standing Committees. The president shall appoint a Committee on\nITOffiamoi’araWd 'a' Bo&rd.srTtellers each for terms of one year coincident with\nthe fiscal year. The membership of neither group shall exceed five. The Committee\non Geminations shall prepare election slates and distribute ballots as P^ed\nlater in the By-laws. The Board of Tellers shall count all the ballots in elections\nor referendums in which the active membership votes and shall report the results\nimmediately upon completion of the objections or referendums."
}