{
  "id": "d720-6",
  "text": "- 7 -\nArticle III - Terms of Office\nSec. 1. Officers. Terms of the officers of the Association shall be for two years.\nSeca 2. (a) Board of Directorso Ex-officio members of the Board shall serve terms\nconcurrent with tHe terms of the office by virtue of which they are members of the\nBoard, (b) Regional Directors shall be elected for terms of two years, (c) Members-\nat-large in the Board shall Be elected for terms of four years. One member shall\nBe elec ted each year except when additional vacancies occur among the members-at-\nlarge.\nSec. 3* Executive Committee. Members of the Executive Committee shall serve\nterms concurrent with the terms of office by virtue of which they are members of\nthe Committee.\nSec. B* Dates of Tenure. All new officers, and new members of the Board and of\nWe Executive Committee shall take office on the first day of the fiscal year\nfollowing their election.\nSec. 5>« limitations of Tenure. No elected, officer or member of the Board shall\nserve for twosuccessive terms in the same office.\nArticle 17 - Annual Election\nSec. 1. Preparation of Ballots. The Committee on laminations shall prepare a\nslate^of three candidates for each office. These shall be assembled as the\nofficial ballot providing space for the writing in of additional candidates by\nvoters, and then duplicated by the secretary of the Association for distribution.\nNo candidate shall be proposed by the Committee on Nominations for more than one\noffice, nor shall voters either write in any one name for two offices or write\nin a name already appearing on the slate prepared by the Committee on Nominations.\nSec. 2. Mailing of Ballots. The secretary of the Association shall send the\nofficial Ballot io all-'active members of the Association via first class mail not\nlater than March 1. Die completed ballots shall be returned to the Board of Tellers\npostmarked not later than midnight of April 1.\nDie Secretary shall include in the official ballot an accurate and complete\naddress to which completed ballots are to be mailed for the Board of Tellers.\nSec. 3. Preferential Ballot. Each voter is required to indicate a first, a\nsecond, and a third preference among the candidates for each office.\nSec. B. Invalid Ballots. All ballots received by the Board of Tellers with\npostmarks'’ la ter than midnight of April 1 will be invalid.\nAny ballot containing a vote for the same name for two different offices will be\ninvalid for both offices in which such votes are cast.\nAny ballot not containing a first, a second, and a third choice for each office\nwill be invalid for each office in which such ommiesions occur."
}