{
  "id": "d720-72",
  "text": "MiAR $ q\n1955\nASSOCIATION FOR -EDUCATION BY RADIO-TELEVISION\nOffice *f the President, c/9 U.S, Office ef Education\nWashington 25, D. C.\nDear Fellow Member tf AERT:\nSTOP1. Don't throw this in the wastebasket l It is an impfrtant reminder that\nyou should not miss our upcoming meeting on Tuesday, April 12, in Columbus, Ohi».\nAERT Day was a red-letter day a year age, and the Program Committee has outdune\nitself to present an even better program this year. The morning session will be\ndevoted to radio, and the luncheon and afternoon sessions, to television*\nBut first we foregather at 9 a.m. for an informal get-together over the coffee\ncups. Here mil be your first opportunity to meet up with #ld friends. Our head¬\nquarters for the day will be the HALL OF MIRRORS, in the Deshler-Hilton, so please\nplan to c#me early and spend the day.\nThe formal program opens promptly at 10 o’clock, with an address by Leon Levine,\ndirector of radio-television activities at Columbia University. You won’t -want t#\nmiss his penetrating observations of present-day radi*, the changes, the adjust¬\nments that have taken place in order to sustain its ever-prominent position in the\nmass-communications picture.\nWouldn’t you like to hear a spirited discussion by a group of experts on just\nhow a radio program for classroom use is developed from the time it is little more\nthan a germ of an idea in the mind of a superintendent or a station manager, until\nit unftlds into a program to which children will listen? There will be plenty #f\naudience participation too, so come prepared.\nAERT will be ’’Sweet Sixteen” this spring, s* our luncheon is to be a gala\nbirthday celebration. By popular demand, we are returning this year to the MARAMOR\nRESTAURANT, which is just a short walk from the hotel. Here you can expect plenty\nof good fun, and the best in food. Y0u won’t want to miss the opportunity to hear\nQeorge Fiala’s talk on TV Makeup. He is the chap who does those ingenious makeups\non the weekly CBS \"Masquerade Party”. Share in the fun when he presents \"AERT’s\nMystery Character”! Our newly elected officers will be introduced for the first\ntime. If you’re a Charter Member, come prepared to take a bow! Price fnr the\nluncheon is $3.00.\nWhen we reconvene in the HALL OF MIRRORS at 2 p.m., our keynote speaker will be\nRobert T. Herridge, the gifted VICES-TV producer of \"Camera Three\", He will be\nfollowed by a demonstration by Kathleen N, Lardie, and a group of high school\nchildren, on the use of a television program in a literature class.\nAt 4:30 we adjourn to the Newctmers’ Reception, Won’t you please fill in the\nolank below and forward it to me at once so we can know how many to plan for.\nPlease note also that a general membership meeting will be held in the AiRT Suite,\nThursday, April 14, at 8 a.m. A small charge of 50 cents per person will be made\nfor breakfast of coffee and rolls. Do say you’ll come ’.\nGertrude Broderick, President\nr will\ny*.\nwill not\nI will ^ ^ will not_\nY lj(UJ C^JLi Ur4J0.\nbe present at the annual AERT Day Sessions on April 12.\nattend luncheon; will_wsUrl not at.ffind breakfast,\n-ic. a.\nSigned"
}