{
  "id": "d720-8",
  "text": "TOs LAM\nFROM: JAR\nRE: AERT Constitution\nNovember 2, 1955\nIt seems to me that the following items in the Constitution and By-Laws would\ntend to restrict our activities.\n1. —Constitution — Art. II, Sec. 2 — States that qualified institution or\norganization must be \"engaged in educational broadcasting\" in order to be eligible.\nI can foresee our approaching institutions which have an interest in E-radio and\nETV, but which are not actually \"engaged” in it.\n2. -By-Laws - Art. I, Sec. h - Essentially the same thing is stated again, to wit:\n\"Radio stations, educational institutions, and organizations engaged in educational\nbroadcasting may become institutional members.\" Can using radio and TV in the\nclassroom, perhaps from films and transcriptions, be construed to mean being\n\"engaged in broadcasting?\" And shouldn't we make some provision for outside\ninterests which might have a more passive interest, not actually being engaged\nin such programming themselves?\n3. -By-Laws - Art. I, Sec. 6 - Dues. Active member, $5 - Associate Member, $3,\nLife Member, $25 - Institutional member, $50 for national organizations and\n$15 for regional and local organizations. By-Laws stipulate in this section that\nchanges in the amount of dues of any class pf membership shall be by a two-thirds\naffirmative vote of the Board of Directors.\nli.-By-Laws - Art. I, Sec. 7 - Local chapters. By-Laws specifically state that\nlocal chapters will be allowed to retain only fifty cents of the annual dues. As\nyou know, we've got a chapter that's retaining seventy-five cents. Somethin's\nwrong somewhere]\n5.-By-Laws - Art. I, Sec. 8 - Says that subscriptions, without membership, may be\nmade available only to college and school libraries, and public libraries. Also *\nstipulates that annual subscription fee is $3 annually. At present, we're getting\n$Iu Again, there's a fly in the ointment. Also says that subscription rates may be\nchanges by an affirmative vote of two-thirds of the Board of Directors."
}