{
  "id": "d806-10",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nBLIND COPY\nJanuary 13, 1953\nDr* Wilbur Schramm\nDean, Division of Communications\nUniversity of Illinois\nUrbana, Illinois\nThe National association of Educational Broadcasters\nhas boon searching since September, 1952, through a committee\nappointed for this purpose, for a person to replace Hr. James\nMiles as Executive Director of the organisation* This committee\nhas sent inquiries to all of the leading educational institutions\nin the country engaged in educational broadcasting, has contacted\na number of college presidents, several foundations and other\neducational agencies for suggestions* Approximately 150 possible\ncandidates have bean screened and we have interviewed lU or 15\npeople interested in the position*\nAfter this lengthy period of searching for the right\nperson to replace Hr* Miles, the Board has reached a unanimous\ndecision and wishes to recoin; end to the University of Illinois\nfor this position Mr. Barry J. Skomia who is now serving as\nRadio Officer with the State Department in Austria* This\nappointment should become effective on approximately May 15, 1953,\nand continue for three years*\nWe feel that this is a very fortunate choice in that\nMr. Skomia is regarded most highly by the educational broad¬\ncasters throughout the country and ha© been a member of the MAE®\nfor many years. He is at present on leave from Inciana University\nwhere he has held the title of Director of Radio for several\nyears* He holds the doctorate degree from the University of\nMichigan, is co-author of a very successful textbook on educa¬\ntional radio, and has served as consultant for the overseas branch\nof the Voice of America on one or two occasions prior to his\ncurrent tour of duty. We feel that Mr. Skomia will be a waxy\nvaluable worker for the advancement of educational broadcasting\nin America and is a man of such stature as will bring credit\nto the University of Illinois through his association with that\ninstitution. We may hope also that he will further cement the\npleasant and friendly relationship which the MAE® has enjoyed\nwith the University of Illinois. It is a pleasure to recommend\nhim to you*\nSincerely yours.\nQAtpse\nGray don Ausmus\nPresident"
}