{
  "id": "d806-136",
  "text": "U&iv&r®ity* Alabama\nBueeniber i** 1953\nFir* Waldo Abbot\nStation WCm\nUniversity of Michigan\nAnn Arbor* Michigan\nDear Waldo I\nThe various communications from you mid from John concerning the listwork\nAcceptance Committee work point up the absolute necessity for clarification\nof the operation of this Co®wdttee in the very near future*\nFirst* regarding the members of tkts Committse* Both you and John Java\nindicated that Buck md Salley have not been too constructive* In reconstituting\nthe Committee then I shall drop these two names and add one or two others*'\npreferably one* Holt suggest® Files and Sulser* X have other assignment* for\nboth of them and would rather not gat them involved* If you hsva any additional\nsuggestion* of someone whom you know will work* fire them to me by return mail\nbecause I aspect to get all committees established n^xt m&k» Would it. be\nsimpler to restrict the Committee to only three?\nAs to the responsibilities of your Committee* let m add to dsfina them\nas I see them in light of recommendations that haw been made and in light of\nmy om thinking in the matters\n1* Tills Committee should bear the full responsibility for screening\nall programs and. program ideas which are submitted for the network* At nc\npoint should John Holt ham to approve or reject a series of programs* He\nhas his hands absolutely full handling and supervising the physical and tschni*\ncel problems involved, in network distribution* All new programs submitted for\nnetwork distribution should bo sent to John Holt who will make copies for each\nmeniber of the network Acceptance Committee and fire them immediately to the\nCommittee* It will then become the responsibility of each member of the Com¬\nmittee to send his vote* including a brief evaluation of the series to Waldo\nand return the tapes to John* Waldo should then summarise briefly the reactions\nof the Program Acceptance Committee and send & statement of acceptance or re¬\njection to the organisation submitting the pxegrsm* It will then be John1®\nresponsibility* consulting with Sfccraia* to schedule the series for distribution*\nIt should never be necessary far the Program Acceptance Committee to\nlisten to more than two or three programs in a series and on that simply make\na decision concerning the entire ©cries proposed* Bo additional tapes within\nthis series should be sent to the Program Acceptance Committee*\n2® In the case of special foreign broadcasts* Siegel should bear the\nfull responsibility for determining whet is and is not to be scheduled «■« after\nthe Itetwork Acceptance Committee has agreed upon the total number of hours of\nprograms from foreign country* including BBC material* which may be distributed\nduring any one week or period on the network*"
}