{
  "id": "d806-139",
  "text": "Hr* Allen Hiller\nPage 2\nX&CeRfcer 5, 1953\nOil a policy level, it seems desirabX© to me that we have lore than one\nagency producing educational programs in tlie U.SJU, both radio and TV* The\nprinciple involved further obviates the necessity that NAEB do some producing\nthis year* If in the first year of the Center’s operation it is responsible\nfor all production and NaeB is responsible for none* a precedent is set which\nmay be difficult to break should it appear desirable to do so in the future*\nApparently it is the plan of the Center to avoid a definitive agreement of\nany kind with NAEB and proceed to establish relationships by action* If this\nis true, NAEB must da likewise*\nThors are a number of questions which wa need to answer daring the current\nyear* flsrhaps we will have time at the meeting of the full Board in January to\nfight through them. I shall list sots© of then and would appreciate your giving\nsome serious thought to them*\n1. What should be the relationship of NAEB to the Center?\na* Are an Advisory CorMttee to the President of the Center\nand a station manager on the Center Board the only liaison\ndesirable?\nb* What should be the full scope of responsibility of the\nliaison Committee?\n2© Should the Center bs the sole producir^ agency in both radio\nand TV or should NAEB continue to produce some programs for\nradio and launch a limited TV production program also?\n3 a Should NAEB be the distributing agency for all radio and TV\nprograms or should these functions be turned ever to the\nCenter also?\nli* Xs it conceiwble that the Center could become a collecting,\nenabling, producing, and supervising group and NAEB a network\ndistribution group?\nAnother tough problem is tho question of fund raising*\n1* Is it deairablo that the Canter arid NABB coordinate fund raising\nactivities?\n2* Should NAEB seek funds from outside sources independently of\nthe Center?\nFrankly, X think it is time for NAEB to decide what it propose© to do.\nI’d Xik© to have your most thoughtful reaction to tfr© following possibilitiest\n1* Continued operation by MSB of the radio network and continued\nimprovement of it*\n2, Establishment of our own TV network*\n3* Seek funds freely for such projects &s we fool need developing*"
}