{
  "id": "d806-38",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nOFFICE OF THE PRESIDENT\nJune 15 9 3-953\nBox 2002 j;F;j ,0\nUniversity, Ala*\nDear Prank,\nThanks far doing it again—turning out a superior piece\nof work, that is. Your \"thing” to Bob is just right.\nAs you say, we’ll have to eat crow if the Board turns\ndoitfn our project to schools but I think we Heedn’t worry.\nAsk your secretary how a woman iho is pregnant be more\npregnant than another who is preganant. Perhaps this\nis the lingo of a woman which only another woman would\nunderstand. Me, I’m always mystified by the sweet little\nold things anyw ay—pregnant or not.\nThe girl I have now is not pregnant and jolly-well better\nnot be—no husband and no prospect. She shore hell is slow\nabout turning out work—maybe that explains it. When she\ndoes get out out it it better than the way it started (from\nme) and I need that kind of help too—but I’m getting a\nlittle worried about the pile on the desk.\nThanks for the reports, etc. Hope Hull is better and do\nhope Wheatley is progressing nicely. I always thought\nhe went to the psychiatrist for some mental probldm he\nhad. I’ve read that psychiatrists can cure ulcers. Just\nyou hold together old boy until after the Aug. meeting and\nI’ll not be worried about you after that. The month in die\nSoouth should put you back in shape.\nSeriously, Frank, I am really grateful for all the good work\nyou have do ne, particularly during this last stretch. I\nsuppose I’m the only one who really knows how much work you’ve\nturned out and Mven I can only guess at it. You’v© been\na terrific help to me. Hope your secretarial situation\nimproves. If It doesn’t, perhaps we should ask that some\nof the TV money be diverted for training secretaries. I\nSaid that to Skornia this morning and I think he took me\nseriously.\nI’m arriving Chicago by air Saturday night ab©ut 9:30 and\nwill be at the hotel at 10:30. Hold down the fort.\nLew Hill writes that he cannot come to Chicago but Is sending\nhis program man to get the details all settled. Name, Richa rd\nMoore.\nSee you Saturday night."
}