{
  "id": "d806-40",
  "text": "COPY\nJuly 27, 1953\nWr. C. Scott Fletcher, President\nFord Foundation Adult Education Fund\n914 t. Green street\nPa a& dene, California\nDear Mr# Fletcheri\nThe National Education Aseoelation wishes to establish a continuing\nservice which will help teachers and school systems to uee television for\neducational purposes in the classroom and in the hows*\nSuch a service will include demonstrations at educational conventions\nand conferences including the annual meetings of the 48 national state\nassociations, all of which are affiliated w*th the HEA. It will provide\nfor the preparation of teachers in the use of educational television before\nthey enter the profession and afterwards* It will coordinate expertmentation\nand research in the use of television in the classroom and the home, and dis¬\ntribute the results to all school systems of the United States. It will\ndevelop courses for uss in teacher training institutions and make outlines\nfor the guidance of state departments of education and state school officials*\nThe service will help teachers and administrators answer ths following\nquestions among others I\n1) 1/hat school studies may be eff ctively aided by educational\ntelevision?\n2) How can televi sion programs used for classroom purposes be\nproperly correlated with the curriculum?\n3) How may classroom and television schedules be adjusted in a\nway to employ most effectively telecasts for classroom use?\n4) What receiving equipment will be ost effective in the\nschools at various levels from the first years through high\nschool? Should there be a televi sion receiving room in\neach school building car should there be receiving facilities\nin each classroom? What sise of screen must be used? How\nmany pupils can uss one receiving sot?\n5) What classroom visual aids should be available to supplement\nths telecasts received?\n6) What should be the administrative set-up for the followingi\na) Participation of classroom teachers in the planning\nof classroom telecasts for the *tudi«m which they\nteach?"
}