{
  "id": "d806-44",
  "text": "September 3, 1953\nHr* G* H* Griffiths\nFind for Adult Education\n914 East Green Street\nPasadena 1, California\nDear Bills\nHerewith the interim report on the status of the FAB Graats-in-Aid for\n1952* 1 thirls you ^suv my mosorandum of August 11 to all Grantees* Ae yon\nwill notice from the attached reports,in Boat cases the project is not yet\ncomplete*, A final report is awaiting completion of those not finished\nplus copies of exhibits and other data in some oases*\nx*\n1* University of Miami 1 Television aeries entitled FRONTIERS OF THE SEA\nThe recent report from the University of Miami, signed by Sydney\nW* Hoad, raids? ®Ihs University of Miami undertook to produce ten\nfiftcen~minute film© for television* All shooting md editing have\nbeen completed* Inasmuch as 'the same head title and tail credits\noriginals are being used for each film these have to be transferred\nfrom one film to another as each is release printed* This at present\nis the only source of delay* One film has already been mailed to NAhB,\ntwo more will be mailed today, and the rest will fee mailed within the\nmonth*0 (All throe of these films have been received by KAEB, and\nused for instructional purposes at the Television Workshop, now In\nprogress at Urbam*)\nA laivcr letter from Mr* Head confirms the fact that the series\nwill not be finished until approximately the end of September*\n2* University of Minnesota* TELEVISING _THE MIHNEAi 0LI5 SIMKiONI ORCHESTRA\nHr. Burton I-Piu3.ii has cent us the following, memorandum on this\nmatter* The promotional materials to accompany his memorandum will be\nhold for forwarding with his final report, to include the article re-\nferred to* As soon as the ap. misal of the kinds mentioned is completed,\nthey will bo turned over to the Center.\n9 The Minneapolis Symphony Orchestra Television series has been\nconcluded* Programs were presented on Sunday afternoons from 2s30 to\n3i3Q p.ra* on the following da.toes January 4» 11, 18, 25? February 22?\nMarch B9 22, 29? and April 5."
}