{
  "id": "d806-49",
  "text": "Mr, G* H. Griffith®\nftige 6\nFord Foundation®\n\"Received grant-in-aid from Fund for Adult Education October, 1952*\nInitial planning and contacts were fade prior to this date*\n\"Production team, including writer-producer* Dr* Walter B« Jones,\nresearch co-ordinator and senior consultant, find Thomas DeJamette,\nphotographer and technical assistant#\n\"Beginning I November, 1952, this terra traveled throughout the South—\na predetermined area including eleven southeastern states* Virginia,\nWorth and South Carolina, Georgia, Florida, Kentucky, Tennessee,\nArkansas, Mississippi, Alabama and Loui jl&na—assembl ing tape recorded\nand film actuality#\n\"In addition to actuality acterir*., outside research was conducted\nalong the subjects of tourist trade, agriculture, forestry ana its\nrelated industries, cool, iron i nd steel, petroleum, building materials\nand building activity, miscellaneous m'.ning, salt domes and subsequent\nwealth, chemical industries, tellies, \\over, the lower Mississippi\nRiver and waterways of the South, trans ortation and world tr&d% as\nwell as the economic history of the Sou, b.«\n\"In addition to Dr# Jones, other ccnsultants for this radio and\nfilm study of the \"new\" South included ir# Stewart J. Lloyd, retired\ndean of chemistry. University of Alabama, and now Assistant State\nGeologist, and others*\n\"The radio series was further authenice ted by tape recorded\ninterviews with the following people—outs ending personalities\nin their respective fields, such as, Alexander Nunn, executive\neditor of Progressive Farmer* Dr* L#G# ifecDowell, director of\nresearch, Florid? Citrus Commission; Wiliia; £# Crooks, Rome, Georgia,\nplant manager, Cclanese Corporation; Thomas V# Martin, chairman of the\nboard, Alabama Power Co*; Col* A* F# Clark, •-%, commanding officer,\nMempMs Division, U# S* Army Corps of Engineers, end others,\n\"Also included were interviews with workers, management, scientists\nand economists, Investors and distributors#*«, liscst every phaa* of\nSouthern life war explored#\n\"Tape recorded excerpts were interwoven \\ith written observations,\nnarrated by Walt Whitaker, and enhanced with a vale and on-the-scene sound\neffects. Thus, the following eighteen documen ary programs were produced*"
}