{
  "id": "d806-53",
  "text": "Mr. G. H. Griffiths\nPage 10\nThcrkild Jacobsen* Professor of the Oriental Institute*\nUniversity of Chicago*\n71 o So!ae American Vorthies\nA series of programs on curious md interesting figures in the\nAmerican past* men who are often forgotten* Ths programs are based on\ndiaries* journals* and other books of personal record* Robert E«\nStreeter* Professor of ISnglieh at the University of Chicago* conducts\nthe programs*\nXII* Hie Witer at ^>rk\nPrograms composed of selections from letters* diaries and journals\nof writers* illustrating their conceptions of fiction and the\nparticular problems which ®ack encountered in his writing#\n10# Grinnell College? PLAYERS* PROJECT\nHerewith the statement received in answer to a request for an. interim\nreport on this project*\n«The Grinnell College Radio Players* project under the NAKB through the\nFund for Adult Education is proceeding on schedule* and it is expected that\nell parts of the project will be completed and delivered actually before\nDecember 1, which is the time called for in our contract*\n\"We h-ve bought* edited* and produced the 13 patriotic plays* and every\nreaction from those who participated has been most favorable# They have\nnot been publicly presented as yet and will not be so until the series begins*\nprobably in October, on cur regular time on WOX,\n«The writing of the book is coming veil* and there is no reason to believe\nthat the contracted copies will not be delivered to the NAEB in advance of\nschedule#\n»W© arc very liappy not only to have been invited to participate in this\nover-all project but with what we have done and are doing on our particular\nunit her© at Grinnell#”\n11. Indiana University* INDIANA FOLKLORE\nHerewith the statement received from Director Elmer G« Sri. a or 3\n”Please be advised that our project is completed* the tapes have been filed\nin your office* end our business office has been instructed to return to you our\nunexpended balance*"
}