{
  "id": "d806-54",
  "text": "Mr. G. H<» Griffiths\nPago 11\n\"This series has not been offered to Indiana stations as yet although\nwe will issue a form! armouncesaent to all of the eonsaereiul stations in\nthe state next week, I night state, however, that we ere running it at the\npresent tine on our own station, UFIQ, and we have received a request from\nour iksuth Bend Center to run the series in that area under their supervision\nand KL3G at Muneie has also requested it, I have no doubt but what at\nleast 25 or 30 stations in this state will ultimately air the series®n\n12* University of Michigan* THEY FOUGHT ALONE\nThis* series is mu ociapleto, Quoting from the most recent letter\nfrom Director Wald^j Abbot*\n•'Under separate oov^r by express I am shipping to you the 13\ntape© of the Fund for Adult Education, special grants project*\nnTho University of Michigan project was originally called \"Freedom\nto Learn14, We now use that as a subtitle and in an effort to make the\nprograms more exciting, attractive — the title is \"They Fought Alone®,\nlou can start dubbing these for network distribution* We would prefer\nthr.c they not be released by stations until October 1, for that is\nwhen we will release these programs over our two stations*\n\"Within the next two weeks X will mail to you 500 copies of a little\nannouncement of the series* which I ho, e you will distribute to every\nprogram director of NAEB stations as a method of inducing them to request\nand carry this series of programs. You can send extra copies to anyone\nthat would be interested, I think a number should go to Rand for Adult\nEducation officers. Ford Foundation people, etc,\n\"I will mail in as soon as I get wy statement from the University\ncontroller an expense account showing how the funds allocated to us\nhave been expended* If I haven8t done everything that I should do,\nplease let me know,\"\nThe controller8e statement, mentioned by Mr® Abbot, has also been re¬\nceived, but is not included with this interim report, because of length\nand nature. It reveals that a balance remains of #115,31 unexpended by\nthe University of Michigan*.\n13. University of North Carolina* AMERICAN ADVINTUHE\nTide series is rot yet complete, Herewith the report from Mr® John Ehle,\n* copies attached"
}