{
  "id": "d806-63",
  "text": "' I Crusade for Freedom\nA Project of\nTHE AMERICAN HERITAGE FOUNDATION\n345 EAST FORTY-SIXTH STREET, NEW YORK 17, N. Y. . OXFORD 7-3939\nEdwin L. Weisl\nSecretary\nG-a\nOctober 5, 1953\nIn my telegram of Wednesday I said I would send you details of the\nclosed meeting at the Pentagon in Washington on October 21st,\nThe session will be briefed by high government officials on con¬\nditions in the strategic satellite countries behind the Iron Curtain. The\nprogram and methods of operation of Radio Free Europe, which broadcasts\npractically around the clock to this critical area, will be presented, as\nwell as other activities of the National Committee for a Free Europe. This\nsession has been arranged at the suggestion of President Eisenhower to give\noutstanding leaders of American life a close look at this situation and what\nis being done to bring the truth to the captive peoples of Europe, sustain\ntheir hope and strengthen their will to resist Communist domination.\nIn addition, plans will be discussed for the forthcoming educational\nand fund-raising programs of the Crusade for Freedom, a project of the American\nHeritage Foundation, in which we hope to have your participation and assistance.\nIt is hoped that you will make every effort to attend this afternoon\nsession and a dinner following it at the Mayflower Hotel where we will be ad¬\ndressed by the Hon. Walter Bedell Smith, Under Secretary of State and formerly\nour Ambassador in Moscow; by Walter Reuther, President of the CIO, and others.\nIt would be appreciated if you will fill out and mail the enclosed\ninformation card. Also enclosed is our tentative program.\nThis letter will assure admission to the Pentagon meeting.\nSincerely, t\nChairman(j>f the Board\nBoard of Trustees: William D. Askren Barney Balaban Chester 1. Barnard, Don Belding James G. Blaine Harold W. Brightman Thomas D'A. Brophy\nLeo Burnett Tom C. Clark Gen. Lucius D. Clay Henry L. Corbett John Cowles William W. Crocker John W. Davis Fred F. Florence Henry Ford II\nFord C. Frick Bruce Gould Philip L. Graham Eric Johnston Robert Lehman Henry R. Luce Charles Luckman J. A. Martino\nJohn L. McCaffrey Timothy A. Mclnerny George Meany Harvey S. Mudd Earl Newsom Louis A. Novins Irving S. Olds Arthur W. Page\nMrs. Robert P. Patterson Samuel F. Pryor Walter P. Reuther Edward L. Ryerson David Sarnoff Paul R. Scott McGregor Smith Paul C. Smith\nRobert G. Sproul Niles Trammell Frank C. Walker DeWitt Wallace Thos. J. Watson Edwin L. Weisl Charles E. Wilson Robert E. Wilson\nEnel-2\nHFII:vw"
}