{
  "id": "d806-93",
  "text": "Footnoteft\n1} For Station B, where two salary figures are shown for a position, this do©®\nnot represent an actual salary ranges rather the smaller figure is based on the\nassumption of non-union employees (occasionally part time) , while the larger\nis the salary that would have to be paid if it 1b necessary to hire union\nemployees for those positions. This does not apply to **secretarial.n In this\ncas© the tv.o figures represent the salary range of the various seerotarios.\n2) If non-union, this work will be clones by non-paid student help.\n3) Also scee non-paid student help*\n4) Also non~paid student assistant directors.\n5} Entire staff, except for maintenance engineers, also teaches. Teaching load always\nat least two full-time courses, usually more.\n6) All jobs, other than those indicated as having a salary range, are handled by\ngraduate students.\n7) $1250 is paid to each of ti o graduate assistants for half-time on a 10-month\nbasis. They are floor managers during production periods end are charged with\nadditional responsibilities in supervision of students in lab, preparation of\ngraphic materials.\nB) Also functions as traffic manager for th© time feeing.\n9) Department heads, such as research, operations, program, production, etc.\nhave academic rank and can range from instructor to professor with a resultant\nwide salary rang© of $3600 - 11,000.\n10) Student help used in supplementing the studio production crews and on\npart-time assignment in programming for writing said announcing. Qualified\nstudents supplement regular cameramen and projectionists, and occasionally\naudio engineers if necessary. The largest urn of students is in studio\nproduction! such as props, scenery, writers, dolly pushers, director's\nassistants, etc. Student rate is 80^ per hour except where specialized\ntraining and abilities arc needed in which case hourly rate can range up\nto t*l»50.\n11) All professional members of the staff also teach.\n12) Do not have a Program Director.\n13) Do not us© professional cameramen.\n14) Hourly rate for part-time student help.\nm Also us© students at an hourly rate of $1.50-2.00.\n16) Actually Writer-Director©"
}