{
  "id": "d229-11",
  "text": "THE UNIVERSITY OF TENNESSEE\nDIVISION OF UNIVERSITY EXTENSION\nCommunications and University Extension Building\nCircle Park\nKnoxville, Tennessee 37916\nDEPARTMENT OF RADIO SERVICES\nRADIO STATION WUOT\nSTATE RADIO TAPE NETWORK\nSPEECH & DRAMA LEAGUE\nTAB\nJune 8, 1970\nPHONE 615/974-5375\nMr. Robert Mott\nExecutive Director\nNational Educational Radio\n1346 Connecticut Avenue, N. W.\nWashington, D. C. 20036\nDear Bob:\nI have studied the Senate amendment to Section 399 of the Communications Act\nof 1934 as contained in sub-paragraph (b) and I have no strong objection to the\namendment. The language is sufficiently obscure to permit any kind of interpretation\none may desire to make. For example, what is a ’reasonable time’, or who determines\nif a program involves an issue of public importance ?.\nIf the amendment is to be used as an instrument of harassment to browbeat the\nlocal station manager to follow a certain party line, then I say to heck with them; I\nwon’t accept their money! I’m sure you are aware that as soon as the honorable\nNicholas Johnson and his company begin to encourage the public to police the educational\nstations, we will be swamped with demands to justify every station break and PSA that\nis aired. It will be the strike application situation all over again. You know that every\nchance listener who tunes in for the last five minutes of a one hour program can do a\nmuch better job of programming an educational station than someone who has worked\nat it for twenty years.\nMy reaction to the latest strategy by those guardians of the airwaves is, ’’who’s\non first?”. If their objective is to cut off all public and private support for educational\nradio programming, they have made a most effective move. It seems incredible to me\nthat at a time when hope and life giving funds are being pumped into educational radio\nin an appreciable amount, the Commission would decide to shut off the pump.\nI still intend to broadcast the TEXACO Metropolitan Opera. It will sound like\nthe devil when we finish chopping it up, but I will continue to broadcast it until I\n'namic Future...\nDistinguished Past...\n1794/1969\n• Civil Defense • Conferences • Correspondence Study • Evening Classes • Extension Library • Films •\nHeadstart • Municipal Technical Advisory Service • Radio • Television • Title 1, Higher Education Act of 1965"
}