{
  "id": "d229-30",
  "text": "Continued from page 2\n• KEBS-FM, San Diego, is exploring the undersea world\nin 13 half hours.\n• WAMU-FM, Washington, is broadcasting a series of\ndialogues on urban problems.\n• WFSU-FM, Tallahassee, is documenting the changes\noccurring in the tribal cultures of America’s Indians.\n• WOUB-FM, Athens, Ohio, is setting up an Action Line\nto help people in Appalachia.\n• KUER, Salt Lake City, is producing Music and Other\nFour Letter Words, a series on ways in which music can\nexpress ideas contained in other arts.\n• KUAT, Tucson, is documenting the experiences of\npoverty area school dropouts.\n• KSAC, Manhattan, Kansas, is chronicling the life of\nDwight David Eisenhower.\n• WMKY, Morehead, Ky., is celebrating the traditions,\nthe culture, and the resourcefulness of the people of\nAppalachia.\n• KANU, Lawrence, Kansas, is exploring a wide variety\nof psychic phenomena.\n• KFJC-FM, Los Altos Hills, Calif., is documenting\nAmerican Street, the interaction and attitudes of\npeople of diverse ethnic backgrounds all living on the\nsame block.\n• WKAR-AM-FM, East Lansing, is producing a weekly\npublic affairs program in Spanish for the local Mexican\nAmerican community, which has no other medium.\n• WDET, Detroit, is probing how poor are preyed upon\nin the marketplace.\n• KVSC-FM, St. Cloud, Minn., is exploring The Minn¬\nesota Within, the territory of the psyche charted by\nSinclair Lewis in his novels.\n• KUOW, Seattle, is celebrating the splendors of English\nverse through the centuries in Nest of Singing Birds.\nStartling new forms of television are being developed at the\nNational Center for Experiments in Television set up last\nSpring with CPB backing at KQED, San Francisco. Cur¬\nrently in production at the center is Heimskringla, or the\nStoned Angels, a work by Paul Foster, Tom O’Horgan, the\nLa Mama Troupe, and Robert Zagone, and produced by\nBrice Howard, director of the center. The work is a\ncombination of open theatre and chromakey videotape\nmixing. First, there is a script. Paul Foster (author of Tom\nPaine), based it on the legend of Vineland the Good and\nLeif Ericson’s discovery of America. Next, rehearsals. The\nLa Mama actors cast lots at the beginning of each rehearsal\nto see which roles each would play. O’Horgan moves them\nin and out of the script and through group exercises and\nimprovisations. Then Foster and O’Horgan work with\nZagone on the chromakey mix, and then return to\nrehearsals again, in a continual interplay of electronic space\nand actor movement. An earlier working title for\nHeimskringla, or The Stoned Angels was The Tribe.\nHenry Hewes, drama critic of The Saturday Review, who\nobserved the work in rehearsal, said that the play has\nestablished “a dialogue between experimental theater\npioneers and experimental TV pioneers that cannot help\nbut benefit both.”\nA LOOK AT THE COUNTRY\nIn August, James Day took over as president of National\nEducational Television. To NET headquarters at Columbus\nCircle in New York City, Mr. Day carried the reputation he\nhad won with his leadership of KQED, San Francisco,\nmaking it into one of the most innovative and effective of\nall public television stations. His approach to the challenge\nof the new post is flexible. “I didn’t run (for the job), so I\ndon’t have a platform,” he told The Milwaukee Journal in\nJuly, at the time of the Wingspread Conference. “I hope to\ndo at NET what I did at KQED - create an atmosphere in\nwhich artists can feel free to practice their art.”\n“My interest is less in formal education than in\nstudying the critical situation this country is in...and in\nmaking us feel more like human beings.” Mr. Day didn’t\nhesitate to plunge in. For starters, he drove across the\ncountry on his way to his new post, to get a feel of the way\nthings are at the grass roots.\nTalking to the Journal about the way he helped build\nKQED in his 16 years as manager of the station, Mr. Day\nsaid “we have really had to stick our necks out because we\nfelt we had to fight indifference.” As a result, “indifference\nis not something we’ve suffered from.”\nMr. Day has been general manager of KQED since the\nstation was founded in 1953. In that time the station\ndeveloped not only into a major force in the life of the San\nFrancisco region but also into a prime source of national\nprogramming distributed by NET and other agencies.\nBefore joining KQED, Mr. Day was deputy director of\nRadio Free Asia in San Francisco (1951-53). Before that,\nfrom ’49 to ’51, he was on the staff of General Douglas\nMacArthur in Japan, specializing in the democratization of\nthat nation’s radio stations. From ’46 to ’49 he was director\nof public affairs and education for the National Broad¬\ncasting Company in San Francisco. He served as an officer\nin the United States Army from ’41 to ’46.\nBorn in Alameda, California, December 22, 1918, Mr.\nDay is a 1941 graduate of the University of California at\nBerkeley.\nHe is a trustee of the Town School for Boys in San\nFrancisco, a member of the board of directors of the Far\nWest Regional Laboratory for Educational Research and\nDevelopment in Berkeley, a member of the advisory board\nof the Bay Area Science Fair, and a lecturer in the\ndepartment of communications at Stanford University.\nA winner of many professional awards and citations,\nMr. Day was chairman of the Television Advisory Com¬\nmittee for the State of California. He is a founder of the\nWestern Radio and Television Association, and was its\npresident from 1947 to 1965.\n3"
}