{
  "id": "d229-45",
  "text": "Your points c, d, e, f are okay. Do we agree that it will be\npermissible for a non-public radio station manager to attend the\nregional meetings at his own expense? He would not vote. He could\nInvolve himself in discussion, i suggest that the six regional\nmeetings be concluded no later than December 19 and, if possible,\nby December 12. The January meeting of the board sljjpuld be held\nas early as possible in the month. I agree that CPB and NER/NAEB\nshould not be officially represented at this meeting. We need to\nspell out necessary procedural details so the board can function.\nThe February meeting of public radio station managers should\nnot conflict with the meeting of WEST in San Fransisco February 24-27.\nI do not feel that the public radio station managers can, as you\nsuggest, \"revise\" the directors* plan. Hear, discuss, review, react,\netc. is appropriate but won’t the board decision be final policy?\n(I see no real problem here).\nIn planning we should indicate fchat we 'hope* NPR will begin\non July 1 but make &t clear that what actually happens will be a\ndecision of the board.\nI certainly agree that the user stations and their board consider\nand resolve the issues of the news bureau and the administration of\nthe interconneetion.\nIn summary, I think your schedule has merit, but I am concerned\nregarding the February period. Assuming an early February meeting\nof the public radio station managers, time will still be short to\nemploy staff and actually activate interconnected, live programming\non July 1. Even though I see this as critical, I am not suggesting\nthe schedule be changed. Let us hold to it - and see if it can’t be\npulled off.\nI note nothing in your time table regarding the start of\ninterconnection negotiation with AT and T. Am I correct in assuming\nthat as soon as public stations are identified and the board has\napproved the public concept, Quayle can begin negotiation?\nMary Lynn Moody afid staff are anxious to help in the planning\nof the regional and national meetings. Lead time is required and\nit is assumgddthat an appropriate financial arrangement would be\nreached between NAEB and CPB for the services of the NAEB convention\nstaff.\n5. CPB at the convention. I believe we have given this adequate\ndiscussion.\n6. BFA-NERN change in relationship. We desire none unless it will\nwork to the advantage of CPB, NPR, the stations, etc. In other words,\nI suggest the status quo unless there is a need for NERN to step in\nand ’rescue* BPA and its program resources."
}