{
  "id": "d229-9",
  "text": "UNIVERSITY OF ILLINOIS BROADCASTING\nJune 2, 1970\nMr. Robert Mott, Ex. Dir.\nNatl. Ed. Radio Network\n1346 Connecticut Ave. N.W.\nSuite 1223\nWashington, D.C. 20036\nDear Bob:\nYou inquired about stations’ bans on broadcasts of political\ncandidates in the May Member Information Service. We do\nobserve such a ban at W I L L as a reflection of University\npolicy and I suspect that the general shortage of candidate\nbroadcasts is the result of similar policy at other institutions.\nYou also inquire, in a recent Memo to Managers, about the\nlikely effect of the Senate’s amendment to the Public Broad¬\ncasting Financing Act of 1970 requiring the retention of\nrecords of public affairs programs by stations receiving\nTitle II assistance. I am not a manager, but I do have a\nfew thoughts on this matter.\nYou appraise the record retention requirement as a means of\nreducing the chance of government influence over program\ncontent by providing a ready means of showing the actual con¬\ntent of a controversial program. It seems to me that any\nrequirement that a record be kept is automatically a form\nof intimidation, albeit a mild one. If anyone accuses a\nstation of bias, it is up to the accuser to provide concrete\nevidence of it, not the station to prove its innocence. A\nstation might well wish to keep records for its own pro¬\ntection*, but why should it be required to do so?\nMoreover, a requirement that certain broadcast material be\nrecorded ignores radio’s character as an essentially ephemeral\nmedium. True, the greater part of most stations' programming\nis pre-recorded, but nothing about the medium dictates that\nthis be so. Some of the more significant programming being\ndone such as WBFO’s weekend storefront broadcasts and KQED’s\nstreet radio project, is spontaneous and live on-the-air.\nOf course it could all be taped off the air but it might\nrequire a substantial amount of tape to record all broadcast\nperiods for three months which include references to \"an\nissue of public importance\". This could be a burden to many\nsmall stations, and to the investment in tape we would have\nto add the labor of recording and indexing the material as\nwell as the factor of keeping another recording machine\navailable for this use at all times when it might be required.\nRadio, Television, Motion Pictures Area Code 217/WILL & WILL-FM 333-0850 / WILL-TV 333-1070 / Motion Pictures 333.-0279 Urbana, Illinois 61801"
}