{
  "id": "d229-91",
  "text": "The directors decided that NER will consider restructuring\nNERN when the following conditions are met:\n1* That NERN will be the base for a non-commercial\nradio network operated as a semi-autonomous\norganization*\n2. That restructuring will lead to stronger program\nservice* Program quality and the number of pro¬\ngrams produced must be improved and increased.\n3. The network would have a separate Board of\nDirectors made up of representatives of using\nradio stations. The network board would be\nresponsible to the NER Board of Directors.\n4. The NER is appropriately compensated via subsidy\nfor the loss of the network.\nWhen developments relating to the establishment of PBS and\nthe relationship of NERN/BFA are more clearly defined, the\nNER Board will take a more detailed position on the restructur¬\ning of NERN.\nNational Educational Radio Functions\nThe process of identifying roles and functions of CPB and NER\nshould continue. The NER Board believes that several of the\nactivities identified for CPB in the Public Radio Study should\nbe carried out by National Educational Radio. These include:\n1. Establish and maintain relationships with legal,\nengineering and research consultants who would pro¬\nvide information and assistance to radio stations\nthrough NER.\n2. Develop and disseminate data on the audiences of\npublic radio stations.\n3. Assume responsibility for the promotion and public\nrelations activities for public radio. The responsi¬\nbility for public radio program promotion and public¬\nity would be assigned to NERN or its successor net¬\nwork.\n4. Serve as the information channel for used radio\nequipment among public radio stations and from\ncommercial stations.\nPersonnel\nThe NER Board assumes that CPB will not establish the Public\nRadio Bureau recommended in the study. NER believes that\nthe Corporation staff should include personnel designated' to\nwork with radio and to develop plans for projects discussed"
}