{
  "id": "d1021-104",
  "text": "■\n-JV-TE'.; fepteifoar 29s X9i4\nHerewith a brief sumramy of the flying trip I mads last week ifith Cecil\na general vsy it provide;, the occasion to visit for the first\n,tim3 thr. fit: at. Ann Arbor, and K-}j$pgg in Battle Creek. It also was based\na wet in; echedulad with St i'.rry Andrews; of HPAC and tewburn in Jackson,\na'd informal ciscues.lons with J 13 Griffiths in Chicago on September\n®87 raci .ded« ..’U tr gladf,; . apgl.emr .> orally is law York as needed.\n1) Toledo; Her;.* I found the hr..nation -leas encouraging as far as the\nproposed educational television station is concerned than I found it -a year\nago, The present Chairman of lie Television Committee, is not sold on ETV*\nProgress looks slow and painful.\nOr, the other hand, progress :.uade by Millys Electronics, which now has\na complete package ready for UHF station /. does show considerable progress,\nnicy will have .an exi Ibiiino art the Me-* Tor!:: Convention at which it will\nba possible to:? you o Craw your own conclu;- j.ona more adequately than 1 can '\nrecord them hare. Suffice it *>o •% t:.r: Bldlack and 1 found this an encour¬\naging new element in both the UB'P and ETV picture*\nwhe^e. 1 had also paid a .v^pQSjSSnpr^ I found'*'\noliac educatno^al television plans had had to be somewhat compromised in view\nof the inability to secure as broad financial support as was\" anticipated.\nSince Pan! Rickerrd c: a .more adequately report on this than Is X shell not go\ninto ary great detail on this -point at this, time.\nAlthough :. In obviously only a personal reaction, I do feel that it\nin generally essential' that in such organizations a coordinator be provided,\nrather than having the schools involved administer their portions of the sta¬\ntion time independently, as if they were sbared~tirae stations» This was w\nprincipal, concern regarding the Detroit ETV setup, as reported to Panic\n¥hile there Paul took m in -.ogee President Clarence K .lberry, with Vice\nin the need for the proposed meeting of presidents at the Mew fork Convention,\nand agreed to att..-. *. Paul v 2 ; ' c. tree justly concerned with the fact that\"\nhe wouldn’t want his president to atter.ei if, in all other cases, only repre¬\nsentatives of the presidents of other Institutions could make it* Thisi^a\nparTW tEo reason 2 or the hasty canvas instituted on this matterc"
}