{
  "id": "d1021-63",
  "text": "Law Offices\nCOHN and MARKS\nCafrits Building\nWashington 6, D. C,\nOctober 13, 1953\nMr* Harry J. Skornia\nExecutive Director, MSB\nUniversity of Illinois\n119 Gregory Ball\nUrbans, Illinois\nDear Harry:\nI have looked into the questions raised by the Oklahoma schools and by\nthe University of North Carolina concerning the preferential mailing\nrates for sound recordings and for 16 mm film and film catalogs. Your\nletters of September 18th to Mrs. Tucker of the Oklahoma schools and of\nSeptember 30th to the University of North Carolina are absolutely correct.\nSections 34.83 and 34*84 of the postal regulations are substantially\ndifferent, although both relate to fourth class postal rates. However,\nthere are two different postal rates provided for thereby. The book rat©\nas provided for by Section 34.84 is 8 cents for the first pound or\nfraction thereof plus 4 cents for each additional pound or fraction thereof.\nIn contrast, the library rat© is 4 cents for the first pound or fraction\nthereof, and 1 cent for each additional pound or fraction thereof, but\napplies only to parcels addressed for local delivery in the first, second,\nor third zone, or within the State. Thus, the specificity of Section\n34.84 applying the substantially higher book rate to 16 mm film and film\ncatalogs precludes its applicability to other types of recordings which\nare provided for at the lower library rate of Section 34.83.\nAs you undoubtedly know, both of these provisions of the postal regula¬\ntions affording a preferential postal rate for the mailing of films and\nrelated material for educational use, stem from Public Law 141 which was\npassed by the 83rd Congress on July 20, 1953. This Act amends Sections\n204 (d) and (a) of the Postal Rate Revision and Federal Employees Salary\nAct of 1948 which relates to Fourth-Class (Parcel Post) mail. The\nlegislation aid its history make clear that Section 1 thereof (now\nSection 34.84 of the Postal Regulations) was designed to make mail rates\n(the higher fourth class rate) then applicable to permanently bound books\ncontaining no advertisjjjg matters also applicable to 16 mm films and\n16 mm film catalogs when sent through the mails except when sent to\ncommercial theatres. Section 2 thereof (now Sectidn 34.83 of the Postal\nRegulations) was designed to make mail rates (the lower fourth class\nrate) then applicable to books containing no advertising matter when\nsent by public libraries, organizations, or associations not organised"
}