{
  "id": "d1021-89",
  "text": "Tos NAEB Board and Skornia\nKay 20, 195U\n/\n•S\nFromt Oraydon Ausmus, President\nSubject: Center grants-in-aid for educational radio programs 195U“55\nand NAEB deficit\nBy* the enclosed copies you will see that X have accepted, as per\ninstructions of the Board the Center gr«nts-in~aid proposal a3 out¬\nlined in Newburn* s letter of March 10 and have requested that he forward\nthe $20000 00 administration fee toSchoelay at an early data, Since this\nis an NAEB project, it is correct that it go to Schooley and not to the\nU of I where an additional slug would be taken outo\nIn light of our financial condition I would suggest that about $500.00 be\nearmarked for a meeting of the Grants-in-Aid Committee which I will\nappoint and that the remaining $l500o00 ba transferred to the headquarters\nbudget to help cover our deficit, I further suggest that Schooley and\nSkornia implore the treasury of the U of I not to take the standard\nadministration fee out of this $1500,00 but permit all of it to apply\non our deficit© I do not predict success for this attempt but still feel\nit is worth a try©\nFUND FROPOS/L fE. THE DEFICIT. Xou will recall that the Board approved\ntransfer of funds from TSg’IIaeB treasury into the headquarters fund to\ncover a portion of our deficit, subject to my conference with VanDuyn©\nActing in good faith with the Foundation I believe it is now appropriate\nfor us to make this transfer of the $3000,00, or more if we can safely\ndo so, into th© headquarters budget. Mien I receive word from Schooley\nand/or Skornia that the grants-in-aid surplus and the NAEB surplus have\nbeen transferred to the headquarters deficit, I will write Bob that we\nhave reduced the \"potential” deficit by that much and request a suggestion\nfrom him concerning the remaining “pctontial” deficit,\nI believe this is a strictly legal and desirable procedure and unless a\nmajority of the Board, by air-mail letter to Skornia or Schooley (carbon\nto me please), indicates an opinion to th© contrary by early next week,\nthese gentlemen should proceed as suggested©"
}