{
  "id": "d1021-90",
  "text": "July lit, 19*\nMEMO TO* NAE3 BOARD OF laRKCTORS\nFROM* GBAYDON AUSKUS\nSUBJECTS MISCELLANEOUS\nX* WASHINGTON MEETING, JUNE 30, HEPHESENTATIVES EDUCATIONAL TV GROUPS*\nI have a 'wire from Skornia saying he is mailing a report to the Board\non this meeting* You may be interested in a brief reaction from me*\n1* It was worthwhile to have the top representatives (President or\nChairman of the Board and the Executive 5 of each group get to¬\ngether so all would understand better what the others are try¬\ning to do# I am opposed to meetings just for the sake of meet¬\ning, but this group should get together at least twice a year*\n2# The meeting engenders a feeling of mutual respect and a sense\nof team work*\n3* Hie group agreed to meet two more times but not in any sense\nas a new council or organization* The purpose of the second\nme sting would be to further explore the job ahead, anaylze\nresources available and funds needed* The third meeting would\nbe a conference of this group with representatives of as many\nfoundations as possible for the purpose of laying out before\nfoundations the accomplishments to date, the job ahead, and\nsupport needed to do the job* MAEB will not be committed to\ngive up anything in either of these meetings* Instead, we will\nbe in a position of cooperating with the other groups, not in\nmaking specific requests but in attempting to involve more\nfoundation support for the total job to be don®#\nII* MEETING OF THE ADVISOR? CM'.STtBB TO THE PRESIDENT OF TIE CENTER\nJULY 9, 19ft* From the JCET Board meeting in New York on the 7th,\nI went to Ann Arbor for an all day meeting of the MASS Advisory Committee\nwith Dr* Newbum and his staff* Present for NAEB, Probst, Dunn,\nAusmus - and Hull ex-official#\nThis meeting was enlightening, encouraging, and very pleasant* We have\nestablished good rapport*\nThe morning was devoted to reports on the Center *s progress and plans\npresented by Dr. Hewbum and the members of his staff* Briefly the\nCenter*\n1* Now distributes five hours of programs per day to the six\nstations on the air.\n2. Is utilizing relatively little material produced by those\nstations - because the stations are so involved in these early\nstages of operation that they can divert little energy for the\nproduction of programs for national distribution* Both Newburn\nand Hudson expect this picture to change as soon as the stations\nhave gone through the shake-down* Most Center distributed"
}