{
  "id": "d1576-0",
  "text": "THE PRESIDENT'S PAGE\n_Mayy 1955 I\nDear NAEBer:\nLet's get down to a consideration of some of the problems facing NAEB, and in\nparticular what the members would like to have done with the association's con¬\nstitution and by-laws.\nIf I may, I'd like to indicate here the major problems, as I see them, related to\nthe constitution and by-laws* If I'm right, some or all members would like to\nsee some changes made. If the majority does, then we'll get the chages affected.\nThese possible changes include the following:\n1. Change the name, or retain the present name. And, if changed, to\nwhat name.\n2. Change the method of electing Regional directors, providing for\nnomination and election by members within the region; and/or by mail.\n3. Re-districting. In particular, consider dividing Region VI so\nthat distances do not hamper so much the relationships and opera¬\ntions of the district. This raises the question of adding a Re¬\ngion, thus adding one member to the Board of Directors.\n4. Voting. This means reconsideration of the present voting. Is\nit equitable? And, consideration of some voting privilege for\nassociate members. On what basis?\n5. Voting. Making provision for voting by mail, or by mail and pre¬\nsent method.\n6. Office qualifications. Do v/e have only active members qualified as\noffice holders? Or, do we permit associate members to hold office?\nIf so, what offices? Or, would an associate member-at-large,\nnominated and elected by the associates be the answer to representa¬\ntion and voice?\n7. Standing committees. Should the by-laws indicate certain standing\ncommittee that the president should appoint, and leave to presi¬\ndent’s discretion in appointing others?\n8. Term of office. Should by-laws provide for all officers to hold\noffice from convention to convention, or for the calendar year\nfollowing election? Or, all officers serve from convention to\nconvention, with exception that treasurer shall serve on calendar\nyear, or fiscal year basis?\nWhat do I propose to do about these? Well, my idea is to get your reactions to\nthe above. I'd appreciate them. I'd also ask you to refer to my numbering\nabove. Then, after you've had this chance to indicate any problem I nay have\noverlooked, we'll get together a document in which proposals will be more formal!/\nindicated. Along with proposals would be the pros and cons. You'd have a chance\nto consider both sides, or perhaps more than two sides.\nIf we can get to this stage, then I'd think we might have a straw ballot by mail,\nor suspend the rules and have an official ballot by mail. You might indicate\nyour thoughts here, too.\nIf we can get all of these things done, or decided democratically that we don't\nwant to do them, by no later than the 1955 convention, I think we will have ac¬\ncomplished something. Won't you agree?"
}