{
  "id": "d1576-1",
  "text": "NAEB NEWS LETTER\nMarch 1, 1941 .. Page 2\nprograms, and is seeking advice and suggestions from Negroes\nthroughout the United States to be considered in making further\nplans. To be included in the series will be the Negro's par¬\nticipation in; Music, literature, art, religion, exploration,\ninvention, scientific research, agriculture, industry, labor,\neducation, civil and military service, theatrical and sports\nactivities.\n“BOOKS AND THE NEWS” ON DISCS\nA series of radio programs discussing and interpreting selected\nbook and magazine material against a background of current\nevents has been prepared by the Library of Congress in v/rshing-\nton and now is available on transcriptions free to all radio\nstations in the country for broadcasting purposes, it has been\nannounced by Archibald MacLeish, Librarian of Congress. The\nseries, known as “Books and the News'* is the first of several\ngroups of broadcasts being prepared at the Library by the\nRadio Researoh Project which was established in January.\nThe new project, financed by a grant from the Rockefeller\nFoundation, is engaged in investigating the 1 2f\nradio as a medium by which pertinent parts of the record of\nZeAcln culture maintained in the Library of Oongre.B may\nbe made available more directly to the general public.\n, etpff of exDerienced radio writers end technicians assigned\nEducation, is chief of the project.\n“UTILIZATION PRACTICES*' NOW AVAILABLE\nCopies of \"Utilization Practices\" are now ;aJal£g£ip!“ ***\nSchool Broadcast Conference. Hoom 1. 228 . m-service\nChicago. :Utb^^«futilizatfon procedures for specific\nteacher actual tested ut 1112^10^? ° „How oaJn x U8e\nprograms. Answers ^ever-p suggestions ahich may be\nthis program?\" « is broadcast. Selected fj>om\nadapted to any in-schoolra comnetition, spon-\nentries in the first annu^ utilization^ ^ h4ve a\nsored by the School BroadcastOon «n want \"Utilization\nradio in your classroom or school Y°u\nPractices\"? By mail, only fifty cents.\nGOOD NEIGHBORING BY.RADIO\nVictor Llona, Director of “Peru\nCalls You,\" Radio National"
}