{
  "id": "d891-102",
  "text": "RADIO (SUBS PREVIOUS)\nWASHINGTON—THE F-C-C TODAY HEARD CONTRARY DEMANDS THAT RADIO\nBROADCASTING BE STRICTLY POLICED AMD THAT IT BE ALLOWED TO FUNCTION\nCOMPLETELY FREE. THE VIEWS WERE VOICED AT HEARINGS ON THE F-C-C'S\nSEVEN-YEAR OLD BAN ON EDITORIALIZING OR SIDE-TAKING BY RADIO STATIONS\nIN ELECTIONS OR OTHER PUBLIC CONTROVERSIES.\nHENRY C.FLEISKER, ASSISTANT PUBLICITY DIRECTOR FOR THE C-I-Q—\nPLUMPED VIGOROUSLY FOR KEEPING THE BAN. HE SAID THE CIO OBJECTED \"TO\nANY MOVE THAT WOULD PERMIT RADIO BROADCASTING STATIONS TO GIVE\nEDITORIAL EXPRESSION TO THEIR OWN CORPORATE VIEWPOINT.\"\nOH THE OTHER HAND, THE REV.CARL MCINTIRE, SECRETARY OF THE\nAMERICAN COUNCIL OF CHRISTIAN CHURCHES, TOLD THE COMMISSIONERS:\n\"RADIO SHOULD, BE AS FREE AS THE PRESS IN EVERY PARTICULAR. IT\nIS IN THE PUBLIC INTEREST THAT THE PEOPLE OF THE COMMUNITY KNOW\nWHERE THEIR RADIO STATIONS STAND, JUST AS THE PUBLIC KNOWS TODAY\nWHERE NEWSPAPERS STAND ON VARIOUS ISSUES AND PROBLEMS.\"\nTHE POLICING SUGGESTION CAME FROM ANGUS MCDONALD, WHO READ A\nSTATEMENT BY RUSSELL SMITH, LEGISLATIVE SECRETARY OF THE NATIONAL\nFARMERS UNION. AMONG OTHER THINGS, THE STATEMENT COMPLAINED OF THE\nTREATMENT SMITH SAID WAS GIVEN TO HENRY WALLACE WHEN HE OBTAINED\nMUTUAL NETWORK FACILITIES TO ANNOUNCE HIS PRESIDENTIAL CANDIDACY.\nTHE PROGRAM ORIGINATED FROM THE STUDIOS OF WGN, MUTUAL AFFILIATE IN\nCHICAGO OWNED BY THE CHICAGO TRIBUNE, BUT, SAID, SMITH, \"WAS NOT\nCARRIED ON THE AIR BY WGN ITSELF.\" __\nj M^S.NOVIK, RADIO CONSULTANT AND EXECUTIVE SECRETARY OF THE\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS, WAS ANOTHER\nWITNESS. HE URGED THE COMMISSION \"TO SPELL OUT\" WHAT IS MEANT WHEN A\n[BROADCASTING LICENSE IS GRANTED \"IN THE PUBLIC INTEREST, CONVENIENCE\nAND NECESSITY.\" HE COMMENTED THAT SOME STATIONS \"SEEM TO PREFER\nBING CROSBY TO PUBLIC DISCUSSIONS.\"\nPRESIDENT ERIK BARNOUW OF THE RADIO WRITERS GUILD SAID HIS\nORGANIZATION STRONGLY OPPOSED ANY EASING OF THE RULE AGAINST\nEDITORIALIZING BY RADIO STATIONS.\nSN053PES 4"
}