{
  "id": "d891-109",
  "text": "BROADCASTERS\nWASHINGTON 6, D. C.\nVol. 16, No. 10, March 8, 1948\nMayflower Rule Hearing Opens in Capital;\nThree Major Viewpoints Heard During Week\nHThe President of the United States said that radio\n“must be maintained as free as the press.\"\n“No creature of Congress, such as the Federal Com¬\nmunications Commission,” said Justin Miller, NAB presi¬\ndent, “can do any of the things which the Constitution\nforbids Congress to do. Specifically . . . it can do nothing\nwhich abridges freedom of speech or press, within the\nlimitations of the First Amendment.\"\nU But the Federal Communications Commission of 19^1\nsaid: “. . . the broadcaster cannot be an advocate.”\nRanging over the disputed ground between those\nopposed ideas, the long-awaited re-hearing of the\n“Mayflower” rule began Monday (1) in Washington,\nbefore the FCC sitting en banc. Opening with testi¬\nmony by presidents of three nationwide networks,\nopposed to the abridging “Mayflower” rule, and pro¬\nceeding through various shades of agreement and dis¬\nagreement, the hearing was recessed at the close of\nFriday’s testimony until April 19. Opponents of the\nrule, broadcasters themselves, isolated the field of con¬\ntroversy on Monday. Advocates of the abridging rule,\nthrough much of the week, seemed to be conducting\nseveral separate raiding operations on the fringes\nof the area.\nResult of this preliminary skirmishing was that the\nweek’s witnesses divided themselves roughly into three\ngeneral classifications, rather than a neat two-sided\nargument. Witnesses took positions for air editorials,\nagainst air editorials, and for editorials with quali¬\nfications and limitations.\nFor Editorial Right. A cohesive case for the right\nto editorialize was presented by the three network\npresidents, Mark Woods of ABC, Frank Stanton of\nCBS, and Niles Trammell of NBC, and several other\nwitnesses. They contended that operation of radio\nin the public interest demands vigorous editorializing,\nthat the FCC has no right to dictate program types or\ncontent, and that the prohibition would prevent radio\nfrom growing to its best form as a stimulant to public\nthinking.\nMr. Woods told the Commission that the “May¬\nflower” rule, while it prevents stations from furthering\ntheir own ends by editorializing, also stops radio from\nserving the best interests of the public.\nMr. Stanton said that there are only two bases for\nthe rule, both invalid: the “scarcity theory” and the\nfear that radio editorials would be reactionary. The\nscarcity theory is already disproved by the fact that\nthere are now more radio stations than newspapers, he\n(Continued on page 180)\nSecond NORC Survey Shows People Approve\nOf Radio and Oppose Governmental Control\nAn impressive majority of the American people ap- ,\nproves of the w:ay radio is doing its job and opposes\ngovernment control of broadcasting, the nationwide\nsurvey just completed for NAB by the National Opinion\nResearch Center of the University of Chicago reveals.\nThe findings of the NORC survey were to be analyzed\nat a news confereiice luncheon in New York today (8)\nby Dr. Paul Lazarsfeld, of Columbia University, co¬\nauthor of the book, The People Look at Radio. With\n125 representatives of leading newspapers, network\nand station news staffs, magazines and other media,\ninvited to the luncheon, plans were being made for\ncomplete revelation of the NORC results.\nBased on a scientific sample of the population, the\nindependent survey shows that 70% of the people feel\nthat radio in their communities is doing an excellent\nor good job. This percentage compares with 59%\nsaying that schools are doing excellent or good jobs,\n63% approving the work of newspapers, 42% rating\nlocal government excellent or good, and 76% believing\nthat churches are doing excellent or good work.\nThe survey represents the only effort to ascertain\nthe direct reaction of the public to the presentation\n(Continued on next page)\nOft tlte OtvLide\nRepresentatives of news media have agreed to\nstudy Defense Secretary Forrestal’s proposals to\nfurther insure security of military information,\n(p. 182)\nCriticism of new questionnaires proposed by\nFCC has been invited by the Broadcasting Com¬\nmittee of the Advisory Council on Federal Re¬\nports. (p. 183)\nMiss Pat Griffith has joined the NAB Washington\nstaff to direct women’s activities, including liaison\nwith AWB. (p. 184)\nNAB President Justin Miller has been presented\nwith a bronze medal by the Annual Advertising\nAwards for “distinguished service to radio.” (p. 184)\nPlans for the 1948 NAB Convention, to be held\nduring May in Los Angeles, have been further\ncrystallized by a special NAB Board sub-commit¬\ntee. (p. 182)\nMARCH 8, 1948 —179"
}