{
  "id": "d891-110",
  "text": "JUSTIN MILLER, President\nA. D. WILLARD, JR., Executive Vice-President\nC. E. ARNEY, JR., Secretary-Treasurer\nKENNETH H. BAKER\nDirector of Research\nRICHARD P. DOHERTY\nDirector of Employee-Employer\nRelations\nHAROLD FAIR\nDirector, Program Department\nROYAL V. HOWARD\nDirector of Engineering\nFRANK E. PELLEGRIN\nDirector of Broadcast Adver¬\ntising\nDON E. PETTY\nGeneral Counsel\nROBERT K. RICHARDS\nDirector of Public Relations\nARTHUR C. STRINGER\nDirector, FM Department\nTO EXPEDITE MAIL AND CALLS:\nBe sure to address all communications with NAB to 1771 N Street,\nN. W., Washington 6, D. C. Neither the New York nor the Los\nAngeles office is now open.\nMembers are also reminded that the NAB telephone number was\nchanged to DEcatur 9300 when the new headquarters building was\noccupied last year.\nof news, entertainment, information, community serv¬\nice and a host of other features provided to the nation\nby the various mass media.\nAnswering a detailed question on various forms of\ngovernment control, 76% opposed federal regulation\nof radio advertising, 65% opposed control of contro¬\nversial issue programming, 67% were against control\nof over-all educational programming, 59% opposed\ngovernment control of accuracy of radio news, and\n52% were against control of profits of radio stations.\nAdvertising Preferred. Considering another ap¬\nproach to the same question, 76% said they would\nprefer radio programs as they now are, with adver¬\ntising, to paying an annual license fee of $5 to get the\nsame programs, if that were possible.\nThe NORC Survey was the second of its kind to be\nmade by the research organization. The first survey,\nmade in the winter of 1945-46, was analyzed by Dr.\nPaul F. Lazarsfeld and Harry Field in The People\nLook at Radio, published by the University of North\nCarolina Press.\nSuggested originally by the National Association of\nBroadcasters, as a continuing nationwide appraisal of\nthe public’s attitude toward radio, as a means of as¬\nsessing the job being done by radio, the survey is one\nof broad scope and detailed investigation.\nStudy Analyzed by Lazarsfeld. Analyzed again by\nDr. Lazarsfeld, the new survey looks into public atti¬\ntudes toward advertising, singing commercials, the\nmarket for serious and educational programs, and pos¬\nsible government regulation, among other subjects.\nNew subjects were added to this new survey’s inter¬\nview, and the phrasing of some questions was altered\nslightly to achieve greater precision in details.\nCited as an example of altered questions by Dr.\nLazarsfeld in his analysis of the survey was the last\nsurvey’s query on accuracy in news broadcasts. In\nthe 1945 survey, the sample was asked: “Which of\nthese powers do you think the Federal government\nshould have over radio stations?” Among the powers\nlisted was the one to “see to it that news broadcasts\nare truthful”. Sixty-six per cent answered that the\ngovernment should have this power.\nDr. Lazarsfeld explained that the question confused\nits hearers because it covered two elements. The new\nquestion asked: “Do you think that somebody—either\nthe Federal government or the radio industry itself—\nshould see to it that radio news broadcasts are accu¬\nrate?”\nThose answering “yes” were further asked: “Who\ndo you think should do that—the Federal government,\nor the radio industry itself?”\nA total of 52 % said the radio industry should do\nit. Thirty per cent believed the government should\ndo it, seven per cent thought nobody should, and 11%\nanswered: “I don’t know.”\nProbing into the listeners’ attitude on commercials,\nthe survey brings to light the fact that a minority,\napproximately 9 per cent of the audience, has a strong\nconviction against advertising over the radio. Dr.\nLazarsfeld pointed out that the whole set of facts re¬\ngarding the listeners’ attitude toward commercials\nduplicates almost completely the findings of the first\nsurvey.\nSinging Commercials? Investigating singing com¬\nmercials, which Dr. Lazarsfeld’s analysis said had re¬\ncently “become the symbol of the controversy over\ncommercial advertising,” the survey added a new fea¬\nture to its interview questions.\nAnswering the detailed question, 37% said they\nliked singing commercials better than the straight\nkind, 43% said they did not like them as well, 18%\nsaid it made no difference, and two per cent did not\nknow.\nCross-checking the answers against those from\npeople approving and disapproving commercial adver¬\ntising in general, Dr. Lazarsfeld’s analysis found that\npeople approved of singing commercials who also ex¬\npressed mild approval of advertising in general, pre¬\nferred music to the spoken word in general programs,\nwere not devoted to serious programs, and had a rela¬\ntively less serious outlook.\nKits containing news releases, speech material, and\nthe memorandum by Dr. Lazarsfeld analyzing the find¬\nings, were sent to NAB member stations in advance,\nto allow wide local release of the survey results. Broad¬\ncasters were urged to make speaking engagements\nwith civic clubs, to utilize the prepared speech material.\nMayflower Rule Hearing Opens in Capital;\nThree Major Viewpoints Heard During Week\n(Continued from page 179)\nsaid, and the fear of reaction reflects an unjustified\ndistrust of the broadcasting industry.\n“Broadcasting today is only half free,” he said. “It\nis entitled to the same freedom of expression as that\nexercised by other media of communication.”\nMr. Trammell told the FCC that no Federal agency\nhas the right to require radio stations to conform to\n(Continued on next page)\nMARCH 8, 1948 —180"
}