{
  "id": "d891-140",
  "text": "SOCIAL RESPONSIBILITY OF RADIO 103\nwe took the initiative ourselves, because we had the courage to\nassume community leadership.\nI think it is safe to say that the campaign was more effec¬\ntive, simply because it was our plan. Our people had faith in\nus. They knew we were acting in their interest. This did not\nprove to be a controversial issue. If it had developed into such,\nwe would have felt it incumbent upon us to give access to the\nexpression of other views. Someone had to take the initiative\nin the first place to stimulate public thought. KFXJ did so\nby means of editorials.\nLast year, Colorado was among the states most seriously\nthreatened with a polio epidemic. The disease spread to an\nalarming degree in some sections of the state. A meeting was\ncalled of our city and county health authorities, school officials,\ncivic leaders, and laymen. The topic discussed was “What Can\nWe Do To Stop Polio?”\nIt was generally agreed that a county-wide quarantine of all\njuvenile activities might help. But the further question was:\n“How Can We Sell the Public the Idea?” Because we believed\nin the plan, KFXJ agreed to present a series of editorials on\nthe subject. We called in doctors and health authorities to\nappear as guest speakers. We editorially endorsed the plan for\na Central Polio Control Committee, empowered to enforce\nemergency health measures. Our county encompasses an area\nof 3,313 square miles. Within 48 hours after launching our\neditorial campaign, there was, to all practical purposes, 100\nper cent county-wide compliance!\nWe also have promoted projects for slum clearance, for\nsupervised recreational facilities for youth, for an enlarged\npolice force with better pay for its members. We are vigorously\nsupporting the needs of education in Colorado, where a particu¬\nlarly acute shortage of teachers exists. We are promoting\ncultural activities such as the Mesa County Community Concert\nseries. We take an active part in many youth programs. KFXJ\nannually sponsors the Intermountain Junior Rodeo and sup¬\nports the Junior Livestock Exposition in connection with it.\nThese are projects someone had to start and someone had to\nadvocate. There are other examples, but I have probably dwelt\ntoo long on our activities.\nSummarized briefly, here are my views:\nRadio has the right to editorialize. Any attempts to deny"
}