{
  "id": "d891-15",
  "text": "Soparato Views of Commissioner Jones\n1. i agree that radio station licensoos may editorialize over their own\nfacilities* I believe that any document establishing this policy requires a\nreversal of the Mayflower broadcasting Company decision, 8 FCC 333, which\nfully and completely suppressed and prohibited the licensee from speaking\nin the•future over his facilities in behalf of any cause* All licensees,\n.considered this Mayflower decision as applicable to each of them, I believe\nthat the Commission thus violated the First Amendment and that the Con-*.,\nmission should .'acknowledge the unconstitutionality of the mayflower decision\nand rule that the licensee may speak.\n2* Since the Majority do not acknowledge the applicability^ of the First\n•Amendment, in determining whether the licensee may use his own microphone to\n'-advocate- causes, it is not surprising that tho Mayflower decision is quoted\nwith apparent approval* They seom to urge that any relaxation of complete\n.suppression is by tho sufferance or leave of the Commission* They have pr.o- .\nscribed their permission with prospective conditions in terms of fairness,\nseveral examples of”which are described seriatim, and then they concludej\n\"It should bo recognized that there can be no one, all embracing formula\nwhich licensees can hope to apply to insure the fair and balanced presenta¬\ntion of all public issues*” For do I find any assistance to the licensee,\nor any clarification- of the constitutional questions in the separate opinion\nof Commissioner Mobster. YJhon the Commissioner picks legal assumptions from\ntho ether, as; \"Freedom of speech over the air is not at issue* The right\nor privilege of access to the radio microphone is the issue\", the coiling\nof oversimplification is unlimited to' reach most any unconstitutional con-,\nelusion*\n3* Tho Commission ednnotos. \"oditorialization” with\" \"news\" and \"comment\"*\nThe relationship of commentators and licensees, including network licensees,\nis such that und-.r the majority view commentator oditorialization cannot be\nignored and fairness should attach to them if their opinion is to have any .\nmeaning of consequence to the industry.\n4. In taking the position I do in this matter that licensees shall be^\nfree without previous restraint to exorcise their constitutional right to\neditorialize, I wish to make it clearly understood that I also believe that\nin a revocation or renewal proceeding the Commission-has -tho right to re—■\nview the overall past performance of the licensee including now a roviow of\none additional facet — oditorialization over, his own facilities oy a\nlicensee .and according to ray viow by commentators — to determine whether\na finding can be made that he will operate his radio facilities in the\npublic interest, convenience and necessity* This power of the Commission, to\nreview the overall operations of the licensee as the steward of the public\nis as far as- the polos from an ambiguous prospective guide'the .majority is\nadopting here to cover a specific'segment, of the licensee’s obligations\nunder tho jb.ct."
}