{
  "id": "d891-172",
  "text": "DAVID LAWRENCE declares:\nU\n'Liberals' for Free Speech\nExcept in Radio Broadcasts\nLAWRENCE.\nWASHINGTON, D. C.—There's lots of\ntalk on “liberalism” and “civil rights” and\n“free speech” emanating from radicals here¬\nabouts, but when it comes\nto applying the principle to\nradio broadcasting, their\nidea seems to be to restrict\nit or to let the government\napply virtual censorship or\nto regulate it by. govern¬\nment decree.\nThe opposition, which\nwants the radio opened up\nso that opinions can be ex¬\npressed freely, is considered\n‘reactionary” or at least\nthat is the main basis of the\npresent edict—the fear that\nprivate companies owning\nradio stations may not be tools of the radi¬\ncals and may possibly introduce a conserva¬\ntive point of view once in a while.\nActually it is amazing that in free\nAmerica the question of whether radio\nstations shall be permitted to express edi¬\ntorial opinions should be debated. Maybe\nMoscow papers had better not notice the\nhearings going on now.\nMaybe the fact that the Federal Communi¬\ncations commission, a government agency,\nforbids editprial expressions—which will be\na surprise to most Americans—ought to be\nconcealed lest the communists cry “Hypoc¬\nrisy.” . vy\nUSURP POWER,\nBut the truth is that an owner of a radio\nstation cannot express his views as does the\neditor or owner of a newspaper or periodical.\nThe excuse for all this is that the wave\nlengths are limited in number and hence the\ngovernment must regulate their use. Now\nthere are plenty of channels. Multiplicity\nhas resulted from inventions.\nThe original idea was that regulation\nshould merely prevent mechanical collisions\nor interferences and that wave lengths or\n“frequencies” should be allocated to stations\nthat could perform program service.\nGradually the Federal Communications\ncommission usurped the power given to it\nby congress to handle mechanical alloca¬\ntions and insisted on going into program\ncontent.\nIt is denied, of* course, ^hat the commis¬\nsion does this but when it issues an order\nforbidding editorial expressions there can be\nno doubt about the implied censorship of\nviews.\n“DEMOCRACY DANGEROUS.”\nThe argument is advanced that radio is\ndifferent from newspapers or periodicals in\nthat persons of limited knowledge or intelli¬\ngence could be easily misled by agitators and\nthat the government must always keep con¬\ntrol.\nThis is but another way of saying that\nthe people of America cannot be trusted\nand that democracy is dangerous.\nIn the course of the last several years\nmany agitators have, by one means or an¬\nother, gotten a hearing on the radio. The\npeople sometimes turn off these speakers or\nlisten with amused tolerance. America has\nnof suffered because of the free expressions\nof opinions that have come from programs\nwith speakers on controversial.’ subjects.\nSPLITTING HAIRS.\nTo say that the owner may. not express\nan opinion over his own radio station or hife\nany speakers to express views on current\nquestions but that he may permit outside\nspeakers to express editorial views is to\nsplit hairs. Yet this is exactly what the\nruling of the Federal Communications com¬\nmission does. js\nThe contention is made that the ruling\nshould require an owner of a station to\nallow time for “both sides.” Publishers do\nthis through letters from readers and by\nprinting the news which day by day con¬\ntains plenty of expressions of editorial\nopinions in the form of interviews by op¬\nposing sides.\nOften one side gets printed one day, and it\nis several days before there is a reply. The\nowner of a publication doesn’t feel that this\ndelay is his responsibility. It may be bad\npublic relations for the protagonist but the\ndelay is not the Responsibility of the medium\nof expression.\nsfc * * *\nMEANING OF FREEDOM.\nA sensible owner of a radio station will\ntry to get both sides or lose public patron¬\nage, but to impose a government rule re¬\nquiring him to do so is to edit the program\nof his station. It is better to allow for\nthe occasional instances of abuse than to\npermit the government by law to regulate\nso-called “impartiality” or to say what is\n“both sides.” Often there are a dozen sides\nto a controversy.\nIt was the late Oliver Wendell Holmes,\nassociate justice of the Supreme Court of\nthe United States—the greatest liberal of\nthem all—who defined freedom of speech\nas “freedom for the thought we hate.”\nMaybe the governmental agencies which\ncall themselves liberal do not know the true\nmeaning of that quotation. It is surprising\nalso to find the American. Civil Liberties\nUnion forgetting that definition, too, and in¬\nsisting at the hearings on a continuance of\ngovernment censorship by means of regulat¬\ned program content. V\n(Reproduction Right* Reserved.)"
}