{
  "id": "d891-18",
  "text": "- 4 -\nmy opinion, be contrary to' t‘he First Amendment and therefore .invalid , as an\nunconstitutional abridgment of freb speech*\n,9'* , It is, however; suggested 'that since licensees : are in. effect trustees\nof the'.airwaves for the public, the‘Commission may condition the grant of.\nthe, radio station, license on the duty of the licensee.to refrain from\neditorializing. I caniiot, however, subscribe to.this- contention* In my .\nopinion, cases such as United Public Workers v. Mitchell* 330 U.S.* 7.5, and\nMcAul'iffe v* Mitchell; 155 Mass.' 21-6, dealing with\", prohibitions on. political\nactivities by Civil Service employees are not at all applicable hope. Those\ndecisions rest, solely on the peculiar nature of the relationship of the\ngovernment, as an employer, to persons in its employ. -The United Public\nWorkers case makes clear-that the extraordinary evil of political partisan¬\nship by classified employees of government is so substantial as to warrant\nan interference with the normal freedoms guaranteed by the1 Constitution* I\ndo not believe that any such evil is here involved. Whatever the evil that\nmay .result from editorializing’ by licensees, I do not believe it .is so sub-\nstantial .as to warrant the deprivation of the civil rights of- the ..licensee.\nAccordingly, I believe that any condition imposed .on a radio station licensee\nwhich prohibits editorial!zation by the licensee constitutes-the imposition\nof an unreasonable and Unconstitutional condition in violation of the ‘First •\nAmendment.\n10. My..objection to the manner in Which the majority approaches• the\nproblems presented_does not constitute a mere preference as to the route\nby which it reaches its decision*' It reflects rather what I believe’to\nbe.a fundamental difference in approach to the Commission's regulatory\npowers.with respect tp the programming policies of licensees. Whatever■may\nbe-the constitutional validity of the approach the Commission takes, I\nbelieve..the fundamental policy against previous restraint, of' speech requires,,\nthe Commission to meticulously avoid the- imposition of prospective conditions\nupon speech of licensees that is entitled to the protection of the -First\nAmendment, , » ' .\n11. We should; I believe, pay particular attention to the manner in .\nwhich the bo.dy- of 'law with respect to the Commission’s powers over t,he\nprogramming policies of licensees has arisen,' Section- 326. of, the Communioa-*\ntions Act expressly prohibits the Commission from exercising any powers of\ncensorship. The Commission on the other hand has been givon full power in\nconnection ’.vith its licensing functions to determine whether an application\nfor a station-license or tfor renewal of such a license would serve\" the public\ninterest, convenience or necessity. Moreover,- application'of the policy against\nprevious restraint on. speech, is,, not at all inconsistent with this.'power, and the\nbody of law=with respect to the.Federal Radio and*Federal - Communications Com**\nmission has grown,upon the.assumption'that no previous restraint should\nbe' imposed upon radio.speech but that the Commission may\"in.connection\nwith its regular review of each station’s operation determine whether or\nnot the operation of the station h’as been in the. public interest.. In the\nwords of Justice Croner* \"It may, • therefore; be set-.-down as: a fundamental\nprinciple that under these constitutional guarantees /of free speech/\nthe citizen has in the first instance the right to utter or publish~his senti¬\nments although,'of course, upon condition that he is responsible for any abuse\nof that right* Rear v,\"Minnesota Ex Rel Olson,'283 US 697, 51 S. Ct. 625,\n75 L. Ed.- 1357.” Trinity .'.lethodist Church, South v. Federal Radi a Commission,"
}