{
  "id": "d891-186",
  "text": "LIMIT POWER OF RADIO STATIONS\n927\nof program service, particularly whenaich list eners have available to them pro¬\ngrams from other stations closer to them.\nIn reaching its conclusions in this matt?:-*, the committee is urged to con¬\nsider the unique public service rendered by.educational and non-profit stations\nand the principle that the resources of American educational institutions should\nbe available to the citizens which support them. The quality of program service\nshould b© the determining factor rather than the technical and arbitrary yard¬\nstick of protecting the coverage of c.l ear-charnel stations to unreasonable limits\nUpon this basis, there would be an improved broadcast service to the rural\naudiences, with programs designed to meet their special local needs. This pro¬\nceeding could not achieve s more worthy goal,\nSenater Rrad, That is an excellent statement, Mr, Hull, Thank you very\nmuch.\nMr, Hull, i.nank you, sir,\n(The letters referred to by Mr, Hull follows)\nWESTERN GRAIN AND FEED ASSOCIATION,\nDe i I cines 9, Iowa, April 9, 194&\nSenator CHARLES W, TOBEY,\nChairman, Interstate Commerce Committee,\nSenate Office Building, Washington, 9. C„\nDEAR SENATOR TO BEY: A year ago I was interested in securing up-to-the-minute\ngrain markets for the benefit of our fanners aid grain handlers.\nWe contacted commercial broadcasting stations with the idea of purchasing\na 1-minute market broadcast of the grain markets each half hour during the\nmarket session,, The commercial broadcasting stations were not interested; the\ncost would have been prohibitive if they had fc sen interested* With the Farmers\nGrain Dealers Association, radio station WOI, Ames, was contacted and through\ntheir cooperation with the State department of agriculture we secured the broad¬\ncasting of up-to-the-minut® markets each half hour from the time the markets\nopened until it closed, 5 days a week. This is valuable information to the\nfarmers as well as the grain handlers,\nI am reciting this instance to indicate the excellent service given by\nradio station WOI, Ames, Iowa, The station is anxious to continue this service\nand to be permitted to broadcast at night. If nighttime were made possible, the\ncollege would be able to present to farmers and to dealers more of th© seasonal\nlong-time outlook information which is so essential during these times of rapidly\nchanging economic conditions. After 3 years of presenting testimony to the\nFederal Communications Commission a decision is expected soon.. Whether or not\neducational and public-service broadcasting stations, such as WOI, may continue\nto serve their taxpayers, who pay for their operations, and to extend that\nservice to night broadcast. At the present time Iowa State must be given special\npermission even to broadcast their athletic ©rants at night."
}