{
  "id": "d891-187",
  "text": "LIMIT POWER OF RADIO STATIONS\n928\nSurveys indicate that a large percent of the Iowa farmers want the night\nfarm programs whieh they cannot and will not get from the big radio stations,\n©specially the information on economic outlook and firm and heme practices.\nIt is not necessary to go into the details with you as to how many more people\ncan be served by night broadcasts.\nAnother reason that I am writing you at this time is that on the FCO there\nare four new members. These new members have not had an opportunity to hear\nall the testimonies that have been presented. We are sure that if they war©\nacquainted with the exact conditions, they would be in favor of extending the\nrequest, not only of the educational and public-service stations, 3ueh as WO I,\nbut to other similar stations.\nIn a recent issue of the D@s Moines Tribune there was an editorial set¬\nting out briefly and accurately the situation here in Iowa. It reads as folloxfs:\nNIGHT TIME FOR WOI\n\"Out of approximately 200 educational radio stations in this country origi¬\nnally, only thirty-odd have survived. One of the most important of these sur¬\nvivors is Iowa*s WOI at Ames. WOI and eight other noncommercial stations have\nbeen in a dispute before the Federal Communications Commission for several\nyears regarding night broadcasting. They are limited to daytime programs now.\n“Objectors to nighttime for these educational stations are the largest\ndear-channel stations of the country. Some of them are on the same wave length\nas educational stations whieh want to broadcast at night.\n\"There are three possibilities for FOG actioni £l) A break-down of the\nclear channels, (2) reallocation of the clear channels, (3) complete support\nof the clear-ehannel stations in their proposal to maintain their channels and\neven increase power from 50,000 watts to 750,000 watts for 2 stations in each\nof 10 regions of the country.\n\"The educational stations, including WOI, do not ask a break-down of dear-\nchannel service. They merely ask that they be allowed night time. In W0I!s case,\nthis would mean that a Los Angeles clear-channel station on the same wave length\nwould have only a slight overlapping of its audience at night, unless its power\nshould be increased beyond 50,000 watts.\n\"Station WOI has for many years been a valuable supplement to commercial\nIowa radio service. Undoubtedly, it is handicapped by being limited to daytime\nbroadcast. Many of the farm and home information features in which it special¬\nizes would be more effective at night when the radio listening audience is so\nmuch larger.\n\"Whatever the decision of th© Senate committee or the FCC on clear-channel\nbroadcasting may be, we hope that WOI can be given permission for night time.\nIts fine record of service to Iowa people entitles it to a fair break.\"\nH©r© in Iowa we are all anxious that WOI will be permitted to continue as\nthey are now operating with th© addition of night broadcasts*"
}