{
  "id": "d891-4",
  "text": "7. Tliis affirmative responsibility on the part of \"broadcast licensees\nto provide a reasonable amount of time for the presentation over their facili¬\nties of programs devoted to the discussion and consideration of public issues\nhas been reaffirmed by this Commission in'a long series of decisions. The\nUnited Broadcasting Company (UHKO) caso j • 10 FCC 675„ emphasized that this\nduty includes the making of reasonable'provision for the discussion of con-\ntroversial issues of public importance in the community served, and to make\nsufficient time available for full discussion thereof* The Scott case, 3\nPike & Fischer, Radio Regulation 259, stated our conclusions that this duty\nextends to all subjects of substantial importance to the community coming\nwithin the scope of free discussion under the First Amendment without regard\nto personal views and opinions of the licensees on the matter, or any deter¬\nmination by the licensee as to the possible unpopularity of the views to\nbe expressed on the subject matter to be discussed among particular elements\nof the station1 s listening audience. Of., National 3 to ad c a s t ing.^. Company v-\nUnited States. 319 U.S. 190; Allen T. Simmons, 3 Pike & Fischer, R.R» 1029,\naffirmed; SAmnons v. Federal. Communications .Oo.nnias.ioa» 169 F. 2d 670,\ncertiorari denied, 335 U.S. 346; Bay State Beacon. 3 Pike & Fischer, R.R.\n1455, affirmed; Bay .State,. Beacon V, Federal Comrmnicatj^ms_^nission, U.S.\nApp. D.C., decided December 20, 1948; Petition of Sam Morris.. 3 Pike c* Fischer,\nR.R. 154; Thomas U. Beach, 3 Pike & Fischer R.R. 1764. And the Commission\nhas made, clear that in such presentation of news and comment the public in¬\nterest requires that the licensee must operate on a basis of overall fair¬\nness, making his facilities available for the expression of the contrasting\nviews of all responsible elements in the community on the various issues\nwhich arise. Mayflower Broadcasting Co.. 8 F.C.C. 333; United Broadcast-\ning Co. (THKC) 10 F.C.C. 515: Cf. UBU;\n£ Broadcasting Co.. Inc. 4 Pike k\nFischer, R.R. 244 (memorandum Opinion!\n). Only where the licensee’s discretion\nin the choice of the particular programs to be broadcast over his facilities\nis exercised so as to afford a reasonable opportunity for the presentation\nof all responsible positions on matters of sufficient ir ortanco to- be af-\nfprded radio time can radio bo maintained as a medium of freedom of speech\nfor the people as a whole. These concepts, of course, do restrict- the\nlicensee’s freedom to utilize his station in whatever manner he chooses but\nthey do so in order to make possible the maintenance of radio as a medium\nof freedom of speech for the general public.\n8. It has been suggested in the course- of the hearings that licensees\nhave an affirmative obligation to insure fair presentation of all sides of\nany controversial issue before any time may be allocated to the discussion\nor consideration of the meatter. On the other hand, arguments have been\nadvanced in support of the proposition that the licenseels sole obligation\nto the public is to refrain from suppressing or excluding any responsible\npoint of view from access to the radio. We- are of the opinion, however,\nthat any rigid requirement that licensees adhere to either of those ex¬\ntreme proscriptions for proper station programming techniques would serious¬\nly limit the ehility of licensees to serve the* public interost. Forums and\nround-table discussions, while often excellent techniques of presenting a\nfair cross section of differing viewpoints on a given issue, are not the\nonly appropriate devices for radio discussion, and in some circumstances"
}