{
  "id": "d891-8",
  "text": "V\n- 9 -\n15. Similarly, while licensees will in most instances have at their\ndisposal production resources making possible graphic and persuasive tech¬\nniques for foxceful presentation of ideas, their utilization for the promul¬\ngation of'the licensee's personal viewpoints will not necessarily or auto¬\nmatically lead to unfairness or lack of balance. While uncontrolled utili¬\nzation of such resources for the partisan ends of the licensee might con¬\nceivably lead to serious abuses, such abuses.could as well exist where the\nstation’s resources are used for the sole use of- his personal 'spokesmen. 1\nThe prejudicial or unfair use of broadcast production resources would, in\neither case, be contrary to the public interest.\n16. The Commission is not persuaded that a station’s willingness ta ■\nstand up and be' counted on these particular issues upon which the licensee\nhas a.definite position may not be actually helpful in providing and main¬\ntaining a climate .of.fairness and equal opportunity for the expression of\ncontrary views. Certainly the public has less to fear from the open\npartisan than from the. covert propagandist. On many issues, of sufficient\nimportance to be allocated broadcast time, the station licensee ‘may have\nno fixed opinion or viewpoint -which he wishes to state or advocate. But\nwhere the licensee, himself, believes strongly that one side of a contro-\nversial issue is correct and-shoul „ -prevail, prohibition of his expression\nof such position will not of itself insuref air presentation of that issue\nover his .station’s facilities, nor would open advocacy.necessarily prevent\nan overall fair presentation of the subject. It is not a sufficient answer\nto state that a licensee snould occupy the position of an impartial inspire,\nwhere the licensee is.iri fact partial. In the absence of a duty to present\nall sides of controversial issues, overt editotalization'by station licensees\ncould conceivably result in serious abuse. But.where, as we believe, to be\nthe case under the Communications Act, such a responsibility for; a fair'\nand balanced presentation of controversial public issues exists, we cannot\nsee how the open espousal of one point of view by the licensee should\nnecessarily, prevent him from affording a f air opportunity for the presentation\nof contrary positions or make more difficult the enforcement of the statutory\nstandard of fairness upon any licensee.\nIV. It must be recognized, however,, that the licensee’s opportunity\nto express his own views as part. of a general presentation of varying\nopinions on-particular controversial issues, does not justify or empower\nany licensee to exercise his authority over the selection of program\nmaterial, to distort or suppress the basic factual .information upon which\nany truly fair and free discussion of public issues must necessarily\ndepend. The. basis for any fair-considertlon of putiLic is-sues, and\nparticularly those of a-controversial nature, is the presentation'o-f\nnews and information concerning the basic fact's of the controversy in\nas complete and impartial a manner as possible. A licensee would be\nabusing his position as. public trustee of th se important means of mass\ncommunication were he to withhold from expression over his facilities\nrelevant news or facts concerning a controversy or to slant or distort\ntho. presentation of. such news* ITo discussion of the issues involved'in .\nany controversy can b.e fair. or in. the’ public int erest where such dis-"
}