{
  "id": "d891-87",
  "text": "OFFICE OF RADIO EDUCATION\nI. Keith Tyler, Director\nTHE OHIO STATE UNIVERSITY\nHoward L. Bevis, President\nCOLUMBUS lO\nMarch 8, 1948\nMr. Richard B. Hull\nStation ¥01\nIowa State College\nAmes, Iowa\nDear Dick:\nI am enclosing a copy of my testimony before the hearings of\nthe FCC on editorializing. I was the last witness before the\nhearings were recessed until the middle of April. Incidentally,\nthe chief counsel inquired whether there was anyone in the audience\nrepresenting the National Association of Educational Broadcasters.\nThat organization had filed to appear and apparently no cancellation\nhad been received by the Commission. Some of the folks told me that\nthey thought it was too bad that the NABB was not represented. I\nbelieve that a common point of view could have been found to represent\nour members.\nAs you probably know, Senator Tobey, on behalf of the Interstate\nand Foreign Commerce Committee of the Senate, has requested the FCC\nnot to announce a decision in the clear-channel case until the Senate\nhas time to act. This definitely puts the FCC on the spot because it\nis supposed to reach a decision in time for the international meeting.\nChairman Coy was going to have a conference with Senator Tobey in the\nhope of being able to find a solution to the problem. Apparently the\nSenator wants the clear-channel matter settled by legislation instead\nof T?y the regulatory body. This seems to me an improper use of legis¬\nlation in a highly technical matter but it is one of those things. I\nam merely saying that you should not expect a decision on the clear-\nchannel matter in the near future unless Senator Tobey is convinced by\nChairman Coy of the need for withdrawing the request for postponement.\nWhile in Washington I haa a nice chat with all the new commissioners\nand found them uniformly interested and friendly with education. I\nthink the Commission will constitute as good a body as we have had.\nSincerely,—\ntitjC\nI. Keith Tyler\nIKT:cmh\nV'\nEnclosure"
}