{
  "id": "d1588-1",
  "text": "-2-\n* * *\nOPA, IN CLOSING, COMMENDS WASHINGTON RADIO STATIONS\nThe District Information Executive of the extinct Office of Price Administration\nhas written the following to Radio Station KWSC, Pullman, Washington — \"All of\nthe radio stations in the district have been most helpful and cooperative,\nespecially KWSC, which found time to use all of the radio material that we sub¬\nmitted. We were especially appreciative of the time you gave recently when the\nMoscow and Pullman areas were placed under rent control. At the time we found it\na bit difficult to get over to the people in that vicinity the fact that it would\nbe necessary for them to register all rental units. After your program the per¬\nsonnel in the two offices reported a greatly increased activity in that area. We\nwant you to know that we realize fully that, had it not been for the special pro¬\ngrams which the radio stations made available to us, we could not possibly have\ngiven the up-to-date information the public desired and needed. May we take this\nopportunity of thanking you for making it possible to have completed our job of\ndisseminating information and keeping the public informed at all times...\"\n* * *\nRADIO WORKSHOP ANNOUNCES FIRST DRAMATIC PRODUCTION\nThe newly formed radio workshop, in conjunction with KWSC, will present its first\ndramatic production over the station at 8:30 p.rn., February 24 when \"The Pussycat\nand the Expert Plumber \"Who Was a Man\" will be presented.\n♦ * *\nFORMER KWSC-ER MARRIES\nHal Moan, one-time KWSC announcer and recently employed by KHJ, Hollywood, Calif.,\nmarried Miss Ora Spoor of Sandpoint, Idaho on December 27. They will live at\nBurbank, California.\n* * *\nKWSC PRODUCTION MANAGER AMONG NATIONAL JOURNALISM\nFRATERNITY CANDIDATES TO RECEIVE HONORS\nSigma Delta Chi, national journalism fraternity, initiated several prominent West\nCoast editors and journalists on January 17, including John Blake, KWSC Production\nManager; Harold Cassill, Managing Editor of the Spokane Chronicle; Malcolm\nGlendinning, Managing Editor of the Spokane Spokesman-Review; and Paul Stoffel,\nEditor of the Pullman Herald.\n* * *\nREPRINT OF LETTER TO HIE HEAD OF THE NSC YOUNG MEN'S\nCHRISTIAN ASSOCIATION FROM RADIO STATION KWSC\nThis station is programming now six out-and-out religious broadcasts a week. Some\nare excellent and some are but fair, frankly. But they do this - they give voice\nin this region of the state to religion itself, on the working days of the week.\nI do not think that religion is a Sunday subject\" only; It\"enhances tlTe Hays when\nman works..... The series of 15 minutes each, and the speakers come from Eastern\nWashington, from different churches, with different ideas and different manners;\nbut all bring Ihe Message and equitably use the broadcasting power of the State\nCollege of Washington in the interest of the public. Yet there continues to be a\nvacuum - seemingly in people themselves - which it is your duty - and, I know, ours\nto try to fill. It is the vacuum of the mind when religion is considered. From\nthe public school system, religion is greatly excluded. Ihe Christian school de¬\nlivers to society one generation after another with a thoroughly secularized men¬\ntality. The churches try, impossible of achievement, to teach Christian religion\nto youth with a pathetic hour a week in Sunday schools. It is too large a task;\nyouth grows into adulthood with a sense that religion is for one day and at that"
}