{
  "id": "d1458-1",
  "text": "THIS IS US\nWe’re pretty strong in numbers, now, what with the SCHOOL OF\nTHE SKY, surveys, et cetera and so forth. Our little niche is\nfairly bulging with staff members, and sometimes we get in each\nother's way. But not too often. You might like to know who we\nare, so here goes. Of course, there's Doc Harry J. Skornia — he s\nthe boss. Robert Lee still is production supervisor; 0-eorge C.\nJohnson, radio education director, and Fred L. C-erber, producer-\ndirector, the SCHOOL OF THE SKY. Those are the powers. The lesser\nlights are: Charles L. Aidman, post graduate, assistant for\nROUNDTABLE and WORKSHOP; Fred Brewer, senior, script writer just\nleaving for writing position at WOWO; Mrs. Elaine Doenges, PG,\nassistant for PLAYHOUSE and CHILDREN'S CORNER; Mrs. Kay Jones,\njunior, assistant for SCHOOL OF THE SKY; Richard D. Kern, junior,\nassistant for SCHOOL OF THE SKY; William H. Potter, senior,\ntechnician; James H. Ratcliffe, senior, technician; Suzanne Reeder,\nsenior, producer FOLLOWING CONGRESS; Donald Walstrum, PG, back\nafter a few years absence, assistant for FROM FREEDOM'S FORGE,\nproducer of TOWN HALL, and script writer; Leonard Wenner, PG,\nscript writer; George W. WilleforcL, PG, radio music assistant,\n(on a new joint appointment with the School of Music) and Mrs. Jule\nShaw, PG, director'THE CHILDREN'S CORNER.\nThe secretarial staff is: Mrs. Mary Eloise Sines, Doc's Girl\nFriday and Mrs. Frances U. Sasse, Johnson and Gerber's stenograph-\nical slave. Also around here for a while was Georgabell Henley,\nwho was working on our most recent survey, as part of her non¬\nresident term work at Bennington (Vermont) College; Betty J. Roesti,\nwho types scripts, surveys and other documents for us, and.\nMrs. Jean Mullan, who keeps up our transcription files and keeps\nbusy (typing) too.\n# #\n* *\nTOWN HALL TONIGHT\nEvery Wednesday at 8:3^ p.m., this program goes on over\nWTOM, Bloomington.\nTOWN Hj^LL is something new we've added to our roster, although\nwe don't have to worry too much about it because we've got out¬\nsiders doing most of the work; Two faculty members and two\nstudents sit down at microphones and discuss current issues —\nsuch as \"Should Price Control Return?\", \"Are Our Civil Rights\nBeing Threatened?\" etc. Following the discussion, the audience\ncan chime in with comments and cuestions. That makes the\nbroadcast almost an audience participation show — modern shades\nof Massachusetts, and all that.\n* *\n-2-"
}