{
  "id": "d1458-5",
  "text": "of fine arts at the University School here in Bloomington. Miss\nMargaret Rufsvold, head of library science at I. U., planned the\nFriday “Story Book\" broadcasts. Miss Maxine Dunfee, instructor\nof education at I. U., rounds out the list of advisors.\nOur first •program was something just short of monumental.\nTiTe had Governor Ralph Gates, State Superintendent of Public\nInstruction Ben H. Watt, and I. U. President Herman B Wells on\nthe opening broadcast. Since then, we1ve resorted to lesser\nknown talent — mainly students interested in radio. Got a fine\ncron of actors and writers, too, we'll tell you.\nWe1ve had all kinds of cooperation from Indiana radio\nstations, and, as a sort of a \"thank you\", we'll list them. All\nexcept WSUA and WCSI, which take the broadcasts direct, pay about\n$500.00 for the ETs, besides giving us the time, which runs into\nmoney.\nAM Stations, 2:15-2:30 P.m. daily: WCNB, Connersville;\nWJOB, Hammond; WSBT, South Bend; and WSUA, Bloomington.\n9:30-9:45 a.m. daily: W0W0, Fort Wayne. 6:30-6:45 a.m. daily:\nWBOW, Terre Haute. WIBC carried them for a while, but with new\nmanagement, interested in getting \"in the black,\" they are no\nlonger with us. Fortunately W0W0 and WOWO-FM took over about\nthe°time WIBC dropped out, at the end of the first semester.\nFM Stations, 2:15-2:30 p.m. daily: W30W-FM, Terre Haute;\nWCN3-FM, Connersville; WCSI, Columbus; and WMLL, Evansville.\n3:00-3:15 p.m. daily: WCTW, New Castle; and WOWO-FM, Fort Wayne.\nWBOX, Louisville, carried them through the first semester, but\nalso dropped, them because they couldn't stand, the expense, and we\nobviously couldn't either. Even if we could., out of fairness to\nthe other stations which do pay, we couldn't have done it.\nAs you can see, there're FM, AM, network and independent\nstations on the list -- probably one of the largest educational\nnetworks in the Union, and certainly one of the most varied.\nWe record all the programs a week in advance, while WSUA\nand WCSI are carrying them live, — and let us tell you that\nwhen the two-week Christmas vacation rolled around we had to\nhustle. We keep the broadcasts on even through vacations, so\nthe children can acquaint their parents with them. Our Audio-\nVisual Department has a lot of new equipment, and the ETs they\nturn out are of professional quality. The A-V Department handles\nthe mailing of the ETs, too, and collects the cost from the\nstations. The platters are filed for redistribution to schools\nas a part of regular audio offerings.\nPrograms are cast in the d.ramatic and semi-dramatic form.\nMister Bill, our Social Studies narrator, and Mister Andy, of\nthe Science show, have endeared themselves to the hearts of Hoosier\ntots, as the saying goes. Our Story Lady — who is Jan Tyroler\nof New York State --can tell children's stories in such a\nfashion that we wish we weren't getting bald. Miss Martha,\nof the Art series, can almost make you think you've paint on\n(continued on next page)\n-6-"
}