{
  "id": "d1458-7",
  "text": "We opened last October with a three-time broadcast about \"Our\nFederal Constitution,\" bringing in notable I. U. experts in the\nfield. \"Prices and Price Control,\" \"Problems of World Food.\n\"Palestine,\" and the \"Taft-Hartley Law\" are Just a few of the\ntimely subjects we’ve covered so far. If we know the world (ana\nthe moderator), there'll be a lot more timely, interesting subjects\ndiscussed in the Sundays to come.\n* * * * #\nI, U. RADIO WORKSHOP\nWe Just would stick our necks outl But we thought it vould\nbe nice to do a half-hour dramatic show every week. So we did.\nOn Thursday evenings over WTOM and ^9XKZ, local stations. That\nwas last semester, and right now we’re heading into the- last lap\nof that series, which proves that we never learn.\nBut we rather think we did a fairly nice Job with our\nWORKSHOP productions last semester, although one of the local\nstations somehow continually got its wires crossed and we kept\nfading in and. out, and once in awhile some strange voice would\nfloat in out of nowhere, out of another remote amplifier cut in\nby mistake, as from a political speech.\nBegan the WORKSHOP with a series of six dramatic broadcasts\ncalled \"Neither Free Nor Equal.\" The scripts were broadcast\noriginally by WCCO, Minneapolis. Doc got hold of them from\nE. W. Ziebarth, CBS’s Central Division Education Head, and we\nrewrote them and produced them in our own inimitable style.\nThe results were most gratifying. The urograms dealt with\nracial prejudice and. discrimination. Pretty forceful urograms,\nand we’re glad to report that the acting was pretty good, all\nthings considered. Fred. Brewer did the seriating, and also wrote\nanother show, \"The House That Didn’t Want To Be Lived In, which\nfollowed the prejudice series. Fred Berber (too many Freds\naround here, we'll tell you right now) also wrote a couole of\nshows for us, and. his \"Case 423\" had all of us on the edge of our\nseats. Bob Lee waved his hands in the control room throughout.\nHe didn’t lose a pound, either.\n•it # #\nOOPSi SORRY1\nWhy can't radio people be nice, calm people? We ask ourselves\nthat quite a lot around, here. But it Just seems they never will\nbe.\nBob Lee started things off quite neatly just before the fall\nsemester began by wrapping himself, his wife, a couple of non¬\ndescript characters and his car around, another car. It all\n(continued on next page)\n-*8-"
}