{
  "id": "d1458-8",
  "text": "happened one peaceful Saturday afternoon up near Martinsville.\nBob got a few cracked ribs out of it — and won the law suit,\ntoo! Not to be outdone in the accident field, ^red Gerber came\nthrough, also. His studio couch caught on fire in his apartment\nlate one night. Seems Fred couldn't find, the ash tray, so he\njust left a lighted cigaret stub behind the couch. His wife\nfollows him around, now, with an ash tray.\nThe Skornias have a paragraph in this article, too. Mrs.\nSkornia bumped. into another car one day a short while ago. Just\na little paint scratched off Doc's shiny new Studebaker. Cost\nfive bucks to fix, but it rated \"major accident\" publicity.\nThat’ll teach her to report every little accident to the police.\n*****\nWHAT DO YOU MEAN \"CALL TO ORDER\"?\nWhile we're talking of wives, the Skornia and Lee better-\nhalves have a new commercial urogram on the air over WTOM called\n\"Call To Order.\" It obviously has nothing to do with the Univer¬\nsity or the Radio Department, but shows that the radio bug is\ncontagious, particularly within families. It originates from\nthe Council Chamber of the City Hall. Weekly participants always\ninclude Mayor Tom Lemon and. as moderator, the Reverend. Douglas\nRae. It's sponsored by the Black Lumber Co., local firm. Prizes\nare given by Bloomington merchants each week for the best question\non the topics being discussed: Water, Taxes, Health, Recreation,\nJuvenile Delinquency, etc,, all at the local level. Doc and Bob\nare very proud of their wives' brain-child. Taking care of that\nplus their non-brain children keens them almost as busy as their\nhusbands.\n*\n* *\n•’Flu* PLANS\nWhat's the status of I. U.'s contemplated. 10KW FM station,\nWFIU? Well, tell you. Except for emergency space, which must.\nbe torn down again, soon, and. self-liquidating construction, like\ndormitories, — there's no building. And. we need space before we\ngo ahead. — can't do any more from present facilities. As you\nknow, our equipment and control roomaren't even really ours, since\nthey are also the PA console for the Auditorium. Gets sort of\nrough sometimes. We'd, like to say-. But no, better not\nstick our necks out!\nIncidentally, if we do get a station, any ideas what the \"F\"\ncould stand for in our call letters? Asked for WVIU (\"V\" for\n\"voice CofJ\") but that was already gone, like WIU, and. many others.\n* * * * *\n~9~"
}