{
  "id": "d1543-3",
  "text": "-4-\n(3) To perform or exhibit a work “publicly” means:\n(A) to perform or exhibit it at a place open to the\npublic or at any place where a substantial\nnumber of persons outside of a normal circle of\na family and its social acquaintances is gathered;\n(B) to broadcast a performance or exhibition of the\nwork to the public, or to transmit to the public a\nbroadcast of any performance or exhibition other¬\nwise than as a common carrier;\n(C) to communicate a performance or exhibition of the\nwork to the public by means of any device or\nprocess.\nC. Section 6. Limitations on exclusive rights: fair use.\nNotwithstanding the provisions of section 5, the fair use of a copy¬\nrighted work to the extent reasonable, necessary or incidental to a\nlegitimate purpose such as criticism, comment, news reporting,\nteaching, scholarship, or research is not an infringement of copyright.\nIn determining whether the use made of a work in any particular case\nis a fair use, the factors to be considered shall include:\n(1) the purpose and character of the use;\n(2) the nature of the copyrighted work;\n(3) the amount and substantiality of the portion used in relation\nto the copyrighted work as a whole; and\n(4) the effect of the use upon the potential market for or value of\nthe copyrighted work.\nD. Section 8. Limitations on exclusive rights: exemption of certain\nperformances and exhibitions.\nNotwithstanding the provision of section 5, the performance of a\nnondramatic literary or musical work, or the exhibition of a pictorial,\ngraphic, or sculptural work, is not an infringement of copyright in any\nof the following cases:\n(1) performance or exhibition of the work by instructors or pupils\nin the course of face-to-face teaching activities;\n(2) performance or exhibition of the work by or in the course of a\nbroadcast or other transmission made for reception solely\nwithin nonprofit educational institutions;\n(3) performance or exhibition of the work in the course of services\nat a place of worship or other religious assembly;"
}