{
  "id": "d337-12",
  "text": "(RELEASE #2)\nFROM: RADIO STATION WXXX\nADDRESS\nPHONE\nFOR RELEASE: (DATE)\nLOYALTY OF SOVIETS EXPLORED BY\nPROFESSOR FAINSOD\nIt is important for the countries of the West to exploit the sources of internal\ndisaffection which exists in the Soviet Union, but such exploitation is not the\nmagic wand which will solve-all our problems. Our major effort must be\ndirected elsewhere -- toward rallying the military, political, economic and\nmoral strength of the West to resist Soviet aggre-s-siom.\nSuch are the conclusions of Professor Merle Fainsod of the Russian Research\nCenter at Harvard University, as-voiced in a. half-hour talk \"The Loyalty of\nthe Soviet People\", to be presented by the National Association of Educational\nBroadcasters, The talk will be part of the notable series, \"People Under\nCommunism\", produced by the NAEB as an Adult Education Project,\nThe talk on Soviet loyalty will be broadcast by Radio Station WXXX on -- (date)\n— at (time) -- .\nIt is in the non-Soviet parts of the world. Professor Fainsod finds, that the\ngreat opportunities for creative and constructive action beckon. It is there,\nthrough intensive and unedning rallying of the strength of the west;, that our\nmajor energies -must be concentrated,\n\"As long as the Communist ruling group retains its firm control of the police,\nparty and administrative apparatus of the Soviet state, \" Professor Fainsod\ndeclares, \"our efforts to undermine the political cohesiveness of the Soviet\nUnion through propaganda can be of only partial effectiveness, \"\nAt one point, the speaker warns that the capacity of the totalitarian regime\nto mold the minds of the young while they are still plastic and malleable is\na formidable weapon. Whether or not this indoctrination, sruvives the trials\nand tribulations of later life, according to Professor Fainsod, it has played\nand may continue to play a role of crucial significance in replenishing the\nlife energies of the regime.\n* * * * 30- * * * *"
}