{
  "id": "d337-14",
  "text": "(RELEASE #4)\nFROM: RADIO STATION WXXX\nADDRESS\nPHONE\nFOR RELEASE: (DATE)\nNAEB BROADCAST EXPLORES\nSOVIETY \"THOUGHT CONTROL\"\nA discussion of the Soviet regime's monopoly of mass communication in\nRussia and the regime's consequent ability to control what the Soviet\ncitizen sees and hears about events in the outside world, is featured in\nthe latest of talks in the \"People Under Communism\" radio series currently\nbeing produced by the National Association of Educational Broadcasters.\nThe speaker for this newest talk, entitled \"Thought Control in the Soviet\nUnion\", is Alex Inkeles of the Russian Research Center at Harvard University,\nan international authority on the Soviet and one of the NAEB consultants for\nthe complete \"People Under Communisni' series.\nThis story of universal adaptation by the Soviet government of the media of\nmass communication -- the newspapers, the radio, motion pictures, and\neven literature --to the Communist Party's ends, will be told over Radio\nStation WXXX at -- (time) -- on -- (date)\nIn discussing the chances of the West to counteract the Soviet regime's mono¬\npoly of communications within the U.S.S.R., Professor Inkeles says that to\nfind the answer one must look not so much to American counter-propaganda,\nas to factors internal to the Soviet system. For, he contends, the contra¬\ndiction between the promise of Soviet propaganda and the realities of Soviet\nlife is the greatest weakness of the regime's efforts to obtain the allegiance\nand support of its population.\nProfessor Inkeles notes that the amazing repetitiveness of Soviet mass\ncommunication strongly suggests that the Russian leaders have little faith\nin the extent to which the people have adopted the maxims put before them.\nAfter more than thirty years of Soviet rule, Professor Inkeles emphasizes,\nthe Communist Party finds that it still cannot relax its extraordinary con¬\ntrols over mass communication, but must, in fact, intensify them.\n* * * * 30 >:< sjc"
}