{
  "id": "d337-24",
  "text": "7 ^\n-5-\nconsultant has the responsibility for insuring accuracy • If in the\nview of the consultant a particular device in the script or aspect\nof the script conveys an impression that is not true or justifiable,,\nthen his judgment prevails. This approach has been proven to be\nsuccessful in producing highly significant and effective programs\nwhich were good radio® The more accurate and the closer the script\nis to the life processes of Russian civilization, the greater and\nmore infinite the number of dramatic possibilities.\n8) The finished scripts must be approved by the consultant® In the\nfiles there must be a letter stating the opinion of the consultant\non the script and recording his decision that it justifies broadcast.\n9) In certain situations, research memoranda on topics are already\nin process or completed® The decision to give a memorandum to the\nwriter is to be made by the consultant after examining the research\nmemorandum® The consultant should determine when and what research\nmemorandum should be given to the writer. It is very important that\nthe writer not structure his thinking in advance of consultation.\n10) After the finished script has been approved by the consultant,\nit is then the responsibility of the Project Director t© determine\nwhether it is suitable for production. If he believes that further\nchanges should be made, he can suggest them to the consultant and\nwriter® The consultant must approve enough of these changes to make\nthe script suitable for production in the Project Director’s view,\notherwise the script is not produced. Ideally, all program efforts\nwhich have reached the stage of a finished script would be of a qual¬\nity that would justify production. In practice, this i© not going\nto be possible, and a certain casualty loss must be expected. This\nis the price that is to be paid in order to give freedom of decision\nto the consultant.\nIf the consultant has provided his written approval, and now the\nProject Director has recorded his written approval that the script\nshould be produced, the next step in the procedure is to sand the\nscript to Mr. William Harley, Program Coordinator of the Lowell\nproject, for his approval. After the Program Coordinator has given\nhis approval, the script is produced.\n11) It Is impractical to have all five consultants read and approve\nevery script. The Project Director is free to get the opinion of\nanybody about any script. The Program Coordinator is free to get\nthe opinion of anybody about any script. In summary, then, a script\napproved for production should have attached to it the written state¬\nment of approval by the consultant, the Project Director, and the\nProgram Coordinator.\n12) In a certain prescribed number of cases, generally the first\ncouple of programs in each series of programs, or those that deviate\nsharply, the Special Committee will direct the Program Coordinator\nto make his approval dependent upon approval by the Special Committee."
}