{
  "id": "d337-33",
  "text": "2. Leadership as crucial factor, versus initiative from below*\n3• Bolshevist philosophy of history as a guide to action*\n4# Expansionism: \"Russian” or \"Soviet\"?\n5* Can Soviet ideology change from within or only be changed from without?\nHas it shown and will it show equal intensity of drive?\nTypes of Programs\nI* Discussion® by Western students of Soviet system and policies; preferably\nwith differences of view®.\nII* Discussions between American students of problem and ex-Soviet citizens*\ni.e.* ex-Soviet administrators* army people* students* propagandists*\nliterary people and scientists. Some of these can be conducted entirely\nin English now; others* by fading out Russian voices and leading in Eng¬\nlish translations.\nIII. Arranging to hear an excerpt from Soviet English-language radio and dis¬\ncussion between U.S. and ex-Soviet citizens of its meaning and how a Soviet\nperson interprets it.\nIV. Discussions with ex-Soviet non-Russian (i.e., Tartar* Ukrainian* and others)\ncitizens of the nationality question* in its political and cultural aspects.\nV. Representation of typical discussions or situations from Soviet life* with\nintroductory and injected commentaries; l.e«, an author who is defending\nhis manuscript against the censors; a kolkhoz chairman who is brought on\nthe carpet.\nVI. Suitable life-histories of ex-Soviet and satellite citizen®* presenting the\nimpact of the Soviet system on them.\nVII. While a good deal of advance planning will be necessary for many of these\nprograms* others must be geared to immediate events or striking news.\nSources of ex-Soviet materials and speakers\nI. Harvard interview project; certainly rich in material; live interviewees\ncan be picked up from its project in New fork.\nII. Columbia interview project in literature; much rich material now available.\nIII. Research Program on the USSR* under Free Russia Fund* Inc.; will have\"\ngrowing body of material and some English speakers.\nIV. National Committee for a Free Europe; good material on satellite nations\nand also some satellite citizens with direct experience in the USSR.\nV. Selective utilization of material acquired through various Russian* Ukrainian*\nBelorussian, and other national committee:s and cultural organizations."
}