{
  "id": "d337-44",
  "text": "MINUTES OF MAY 29 MEETING - Page 4\nfurther discussion it was made clear that William Harley is to be the administra¬\ntive arm of this Special Committee of the NAEB in carrying out the terms of the\nFord grant* It was agreed that Probst, as chairman» should negotiate with Harley\nto employ him at the agreed salary.\nThere was discussion of the problem of whether the salary was suffi-\nient. It was pointed out that the responsibility of the Job was very great.\nIt was further pointed out that his was the crucial task on whether sufficient\nachievement would come to make possible a renewal of the grant. After examina¬\ntion of known salary ranges in various university activities at the University\nof Wisconsin, University of Illinois, and University of Chicago, and after\ncomparison of this activity with other comparable positions of responsibility,\nit was agreed that the amount of salary was satisfactory and desirable,\nHull moved and it was adopted unanimously that the letter of trans¬\nmittal from Mr. Fletcher to Mr. Lowell and the letter of transmittal from Mr.\nFletcher to the Committee in making the grant be made a part of the record of\nthese minutes. They are in Appendices A and B.\nThe problem of auditing, bookkeeping, and fiscal accounting procedures\nwas raised. Hull moved, and McCarty seconded a motion \"That William Harley,\nRalph Lowell, George Probst, and Parker Wheatley are a committee of four to\nwork out the details of the fiscal procedures.” This was unanimously agreed to.\nWheatley agreed to ask Ralph Lowell to request a Boston auditing firm to prescribe\nthe desired accounting procedures. It was agreed that William Harley9 as exec¬\nutive of the Ford grant-in-aid, would authorise all disbursements and send them\nto Lowell Institute for countersigning. It was agreed that Probst would be\nresponsible for authorising Harley*s salary and expenses. It was further agreed\nthat it would be desirable to have a weekly trial balance on the expenditures\nao the grant is in operation in order to have an adequate protection against\nembarking on projects which, it might develop latery would not be executed for\nlack of funds.\nThe problem of program conferences was then raised. Siegel moved\nand Hull seconded a motion \"That William Harley and Probst are empowered to\nspend up to $10,000 to develop immediately program conferences.\" This was\npassed unanimously. Siegel moved \"That Siegel be designated to explore the\nproblems of promotion and publicity, to find out who was available for tl is\nwork in New York, and consult with William Harley and then report back to the\nCommittee a recommendation for a budget and personnel for a promotion and pub¬\nlicity operation directed from New York.\" This was seconded by Hull. Hull\npointed out that news flows from East to West. After discussion of this motion\nand the related problem of sub-dividing the tasks of the Committee and making\nCommittee members individually responsible for particular areas where their\ncontribution would be greatest, this motion failed of adoption* Wheatley\nstated his strong conviction that each member of the Committee should contribute\nwhatever he could in all areas of work facing the Committee, and no task or\narea should be assigned to any member of the Committee as his sole responsibility."
}