{
  "id": "d337-8",
  "text": "FROM: RADIO STATION WXXX (RELEASE #6 )\nADDRESS\nPHONE\n(Date of Release Issuance)\nFOR RELEASE: (DATE)\nThe new series of seven one-hour programs under the general title of\n’'People Under Communism\" presented by the National Association of\nEducational Broadcasters, will present \"Pattern of World Conflict\"\non Radio Station WXXX on -- (date) -- at -- (time)\nThe program treats of Communist diplomacy in action, on the theory\nthat to defend freedom we must know the aims, methods and techniques\nof Soviet rulers. The producers of the new broadcasts hold that in the\nconflict with world Communism the people of the free world cannot afford\nto be indifferent or cynical or over-emotional. We must be objective\nand exact because there is no other way in which we can understand\nthe meaning of the conflict. And if there is no understanding, freedom\nis menaced.\n\"Pattern of World Conflict\" was written by Joseph Mindel on the basis of\nmaterial supplied by Dr. Philip E. Mosely, director of the Russian\nInstitute at Columbia University. Frank Papp was producer.\nDuring World War II, Dr. Mosely was adviser to the State Department.\nAs such, he was an expert at the Moscow Conference in 1943, the Potsdam\nConference in 1945, and at meetings of the Council of Foreign Ministers\nat London and Paris in 1945 and 1946. He has spent an estimated 2,000\nhours as a United States government representative in face-to-face\nnegotiations with Russians on International Commissions.\nIn this broadcast in the new series we learn, through dramatization and\nnarration, that the Soviet \"Pattern of World Conflict\" consists of four\ntechniques -- propaganda, intimidation, negotiation and the seizure of\npower. As long as the two systems -- the Communist and the Democratic\n-- exist in the same world, we are told, they must be in conflict.\n\"Within the countries that are dominated today by the Ssrviet Union, and\neven within the Soviet Union itself, people hope that we will be strong\nto preserve the peace, \" Dr. Mosely said in discussing this broadcast.\n\"But, we cannot make and keep friends and allies if we try to boss hem\naround. We have to make a constant effort to understand their needs and\ntheir fears to make our own aims those which they can fully share and\nsupport. \"\n& ^ * 30"
}