{
  "id": "d1811-3",
  "text": "Third, we must be able to make a convincing case for the desirability of\nassigning education's 15 consecutive 200-kilocycle FM channels adjacent\nto and continuous with the commercial FlVl band, so that homes having\nstandard AM-FM receiving-sets will be able to receive the school-station\nbroadcasts. This argument rests, of course, on the assumptions, first,\nthat educational FM broadcast stations will want to reach home listeners\nwith adult-education programs end programs of a general informational\nnature not likely to be made available over commercial stations; second,\nthat educational FM station's are likely to be used (’to some extent, at\nleast) to bring educational programs of a supplemental nature to student\nlisteners during out-of-^school hours; third, that these stations are\nlikely to be used to bring to young adults, just out of school, types of\neducational programs calculated to expedite their transitional adjustments\nto adult social, occupational, and civic responsibilities of community\nliving; and fourth, that one of the most important uses of the educational\nFM stations will be that of broadcasting programs designed (a) to\nexplain the work and purposes of the schools to their respective communi¬\nties, (b) to present actual examples of pupil performance and achievement,\nby way of demonstrating to parents wliat the schools are accomplishing,\n(c) to inform the public regarding the nature, methodology, and relative\nmerits of new instructional techniques, systems of grading, administrative\norganization, and the like, (d) to promote critical analysis of the obli¬\ngations of public education in relation to the preparing young people for\neffective participation, culturally and economically, in contemporary\nlife, and (e) to enlist community support for educational policies.\nIt should not be difficult to find ample evidence to support the validity\nof these four assumptions. Programs of these general types have been\nbroadcast, already, by school systems and colleges which are now operating\ntheir own FM stations.. In addition, most of the state plans which have\ncome to the attention of this Office indicate that program services of\nthese kinds are intended. Hence, when testifying, at the hearings, it\nwould be well to explain, in some detail, what types of programs designed\nfor out-of-school listening are intended, (in addition, of course, to pro¬\ngrams designed specifically for in^school listening).\nIn this connection, it might be well to point out, by way of caution,\nthat any witness whose testimony indicates an interest in broadcasting\nonly programs designed for in-school listening may possibly be challenged\non the grounds that a school-system does HOT actually need am FM station\nif it has no interest in reaching out-of-school listeners — that, if it\nneeds only to reach in-school listeners during school hours, it can do\nthis more easily and more economically by simply constructing studios\nwith recording facilities, and producing its educational programs in\ntranscription form, to be played, as needed, either over school central\nsound systems, or over portable transcription players to individual\nclassroom groups’. It is perfectly true, of course, that any of the\nsmaller school systems, not able to afford the cost of an FM broadcast\nstation (or unable, because no channels happened to be available locally,\nto construct its own station), would be able, in this manner, to develop\na valuable recorded-program service. In fact, it is not unlikely that"
}