{
  "id": "d1811-6",
  "text": "that the demand for educational FM channels in this area will be great.\nenough to necessitate some compromises between states in order to- provide\nfor enough stations in the total area to insure service from at least\none station to every school and school home. (Connecticut witnesses might\npoint out, also, that a number of the school systems and colleges now\nbeing planned as production centers to serve orgional stations should,\nideally, have their own transmitters.)\nWitnesses for the -State of Maryland can show a situation which is similar,\nin many respects to the situation in Connecticut. Maryland will require q\nminimum of five educational FM stations in order to provide service\nthrough the state. Since one channel assignment can be repeated in the\nState to serve two stations (one of them at Salisbury, end the other in\nwestern Maryland, shielded from the first by the Caeapon Range), only\nfour channels will be required, BUT, in view of the fact that only\nalternate channels can be assigned, Maryland's needs will require a total\nhand width equivalent to seven consecutive channels. As in the case of\nConnecticut, Maryland’s needs cannot be considered apart from the require-\nrnents of neighboring states. Within normal interference range of Maryland’s\nfive stations, a total of ten other educational FM stations is already\nbeing planned — two in West Virginia, four in Pennsylvania, two in New Jersey\npne in,Delaware, and one in D. of ,C. In addition, there is reason to\nexpect that still another educational FM station, to serve the Alexandria,—\nArlington—Fairfax area, will be planned in the very near future. Thus,\nMaryland’s five stations will have to considered in relation to what will\namount, eventually, to at least a fifteen-station regional frequency-\nassignment pattern.\nTestimony of the kinds indicated (from Office of Education witnesses-,\nand from State Department of Education witnesses representing Ohio,\nMichigan, Connecticut, and Maryland) should be able to make a reasonably\nconvincing case for Commissioner Studshaker’s contention that education\nmust have a minimum of at least 15 consecutive 200-kilocycle channels in\nin order to meet the neecis already in sight.\n(As a matter of personal opinion, I am inclined to believe that education\nwill eventually need more channels than this, but hesitate to suggest tly¬\ning to make a case for more than 15 now, lest our demands seem unreasonably\nhigh. I truly believe, however, that we can show a legitimate need for a\nminimum of 15 channels, in the light of the present status of station\nplanning, and that present planning is definite enough to give reasonable\nassurance that a sufficient number of educational FM stations will be\nconstructed within the next three or four years to utilize a 15-channel\nband to its full capacity. However, if any of the other educational\nwitnesses have reason to believe that more than this number of channels\nwill be needed within the next few years, they should consider themselves\nperfectly free to ask, in the course of their testimony, for the allocation\nof a greater number.)\nFinally, in addition to the kinds of testimony already indicated to sup¬\nport the claim that more channels are needed by education, it would\nprobably be desirable fo** each of the other witnesses appearing for educa¬\ntion to include some statement in his testimony as to the minimum number"
}