{
  "id": "d1812-11",
  "text": "-12-\nFour Recommendations Made\nFour measures were recommended for adoption by the New York State Bar Association in\nthe repbrt from its committee on civil rights:\n1. No photographs, moving pictures, television or radio broadcasting of Con¬\ngressional or executive hearings should be permitted while any witness is\ntestifying, except at public hearings on pending legislation.\n2. Where hearings are conducted on pending legislation, the necessary appar¬\natus for photographs, moving pictures, television and radio broadcasting\nshould be as inconspicuous as possible.\n3. No radio broadcasts or telecasts of Congressional or executive hearings\nshould be commercially sponsored.\nU. All Congressional and executive hearings should be governed by a code of\nprocedure embodying the above rules.\nThe committee consists of thirty men and women from various parts of New York State.\nLouis Waldman is chairman. Members of the association will vote on the recommenda¬\ntions at its annual meeting from January 2l*-26 inclusive. According to the report,\nits proposals are applicable to state as well as Federal investigations.\n\"Grave Questions11 Involved\nAt the “sensational\" Kefauver committee hearings, the report said, “witnesses were\nrequired to testify against their will before television, newsreel, klieg lights,\nflash bulbs and nation-wide radio.\" It asserted this had given rise to “grave ques¬\ntions of constitutional law and public policy.\"\nThe committee reported it had not found “any sound constitutional basis for the\nassertion sometimes made that television newsreel, radio or the camera have rights\nguaranteed by the first amendment to record proceedings which are a part of official\ngovernmental investigations.\"\nPublic Not Really Served, Says Report\nIt expressed doubt that the value of such reporting to public education was enough\nto make up for the loss to individual rights.\n“Equally doubtful,\" it added, “is the existence of any right in the public to hear\nthe legislative or executive proceedings while they are in progress.\"\n“Only those moods of the witness or the committee which appeal to the current\npopular fancy are caught and reproduced, particularly in the case of newsreel and\ncamera,\" continued the committee. \"Even as to radio and television there is great\npressure on members of the committee to telescope and compress the hearings, selec¬\nting for their public sessions the most sensational witnesses and the most spectac¬\nular part of their testimony, in a measure staging the hearing to accommodate the\nmedia over which it is carried.\"\nSearch for Truth Impeded\nThe committee pointed out the \"danger that legislators may use the tremendous\nnational audience for personal advantages at the cost of a dignified and fair pro¬\nceedings.\""
}