{
  "id": "d1812-12",
  "text": "-13-\nIt held that the search for truth probably was impeded when a witness was \"compelled\nto testify\" in proceedings \"conducted in an atmosphere of klieg lights, clicking\ncameras, flash bulbs, and the mechanical devices used by radio and television.\"\nThere is increased danger, it added, that \"reputations and careers will be blasted.\"\nIn hearings to find facts and recommend legislation or to inform the public, the\ncommittee held, widespread coverage by television, radio and newsreel \"may violate\nthe most basic rights of a witness being questioned about details of his personal\nand business life.\" It cited the pressure of \"stage\" fright and \"mike\" fright as\naffecting calm reflection and ability to answer questions properly.\nTelevision and radio coverage, the report added, multiply the \"unfairness\" to\nwitnesses inherent in Congressional hearings, because of their limitations on de¬\nfense witnesses and cross-examination.\nConstitutes a \"Third Degree\" Procedure\nCommercial sponsorship, it continued, impairs the dignity of proceedings and also\nmay force a witness \"to testify under compulsion for the financial benefit of a\npurely private business concern.\"\n\"A serious constitutional question arises,\" the report went on, \"when a witness ap¬\npearing under subpoena refuses to testify on the grounds that television, radio and\nnewsreel subject him to severe mental and physical strain and he is unable to think\nclearly—that the lights, cameras, microphones and recording devices, the thought of\nmillions of watchers and listeners, and the heat and confusion, make the hearing a\n’third degree.’ The ’third degree’ method of eliciting information has been\nroundly and universally condemned by bar and bench as inimical to the interest of\njustice and violative of due process.\"\nPropose Only Limited Radio-Tv Coverage\nWhen public hearings are conducted in administrative investigations, said the com¬\nmittee, there should be no television, newsreel, camera or radio if the hearings are\njudicial or semi-judicial in nature. In non-judicial hearings of this type, it held,\nprocedures should be established to protect individual rights and prevent the\nGovernment \"being held up to ridicule and contempt.\"\nIn hearings on pending legislation, where \"inconspicuous\" cameras and microphones are\nrecommended, the reported added that these machines should be shut off in \"unusual\"\ncases if a witness so requests. Witnesses at such hearings whose reputation is\ndamaged by testimony, it held, should have a chance to \"rehabilitate\" themselves.\nWHEN WILL THE COMMISSION MAKE ITS DECISION?\nFCC Commissioner Sterling in New York City (October 31, 1951) said: \"We are striv¬\ning to issue our final order and table of allocations by some time in late February\nor the early part of March, 1952, and I think we will do it unless we encounter an\nunforeseen booby-trap.\"\nChairman Coy in Biloxi (November 3, 195>1) told the NAEB convention: \"Suppose that\nthe Commission . . . could resolve the problems and announce its decision by Feb¬\nruary 1. Then if we were to allow, let us say 60 days for the filing of applica¬\ntions, we would come to the first of April before the first grants could be made."
}