{
  "id": "d1812-16",
  "text": "-17-\nOn November 26th Mr. Neher completed a series of scheduled visits to all nine state\ncolleges. These trips were planned to assist the college faculty staffs in the\nevaluation of their radio resources and facilities and to offer suggestions and help\non equipment and production problems. Conferences were held with the college pres¬\nidents, members of the faculty radio committees, and other faculty people concerned.\nMr. Neher looked over physical equipment such as microphones and recorders, in¬\nspected auditoriums and rehearsal rooms to evalute their acoustical properties and\nfitness for broadcasting, and attempted to help determine the program resources which\nwould produce the best contribution to state-wide listening from each college.\nFour Ways to Increase Participation\n^here appear to be four ways in which the colleges may increase their participation\nin the State Broadcasting Service:\n1. Make tape recordings of notable speakers, outstanding concerts, or other\nfeatures or events which would be of interest to the state as a whole.\n2. Join with other state colleges in planning and presenting a “State College\nHour,\" wherein each college would contribute a half hour program every\nninth week.\n3. Contribute to the adult education features of the Wisconsin College of\nthe Air, by recording outstanding lecturers and courses for broadcast\nover the network.\n1*. Give additional help to teachers-in-training in the use of the School of\nthe Air as a classroom teaching supplementary aid.\nThe State College Hour is scheduled to begin January 8 and will be heard at 2:00-\n2:30 each Tuesday. Present planning indicates that there will be broadcasts in the\nfield of speech correction, folk music, classic drama, vocational guidance and\nteacher recruitment, and the value of sports and extra-curricular activities for\ncitizenship.\nThe activity mentioned above as item h has already resulted in the scheduling of\nSchool of the Air and state station staff members for demonstrations and utilization\nworkshops during the summer sessions of three state colleges, and others will un¬\ndoubtedly be arranged. Each of the teacher training directors has expressed en¬\nthusiasm and great willingness to expand School of the Air service by increased at¬\ntention to radio utilization in their methods courses and by assisting in arranging\nmore demonstrations and workshops.\nOutside Programs Listed\nOutstanding programs presented recently from the Wisconsin State Colleges include:\na. Concert by the Apollo Club of Minneapolis recorded by Eau Claire State\nCollege at the Northwestern Teachers Convention.\nb. Gerhart Seger, main speaker at the convention of the Northeast Wisconsin\nEducational Association in Oshkosh.\nc. Stevens Point State College assembly programs—D. C. Everest, President of\nthe National Forestry Association; Colonel.Don Mendoza, Peruvian Minister\nof Education; and Dr. Adams speaking on the \"Bounties of Nature.\""
}