{
  "id": "d1812-17",
  "text": "-18-\nd. River Falls State College mixed choir Christmas concert broadcast during\nthe holidays.\nIn addition to increased activity among the state colleges, other state agencies and\ninstitutions are participating in the program expansion:\nState Highway Commission—A daily report of the condition of major highways in Wis¬\nconsin,broadcast at 9:20 A. M. over the state stations and rebroadcast by five, com-\nmercial stations.\nBoard of Health—Two special programs on home safety for the holiday season.\nWisconsin Colleges—Milton College choir performance of the ”St. John Passion'* by\nBach broadcast November 22nd. Lawrence College choir performance of the '’Messiah'*\nbroadcast Christmas Eve at 9:00 P. M.\nService to Commercial Stations Increases\nCommercial stations in increasing numbers are taking advantage of the availability\nof state station programs for rebroadcast. A short summary:\nSports—University of Wisconsin basketball broadcasts are now carried by 26 com¬\nmercial stations, all of them cooperating in the Department of Agriculture plan\nwhich takes care of the normal charges for line costs and expenses of the Athletic\nDepartment in return for the broadcasting of several announcements in promotion of\ndairy and other agricultural products. The list includes two Illinois stations and\none in Iowa.\nWeather Forecasts—Rebroadcast by five commercial stations.\nDaily Highway Reports—Rebroadcast by four commercial stations.\nSchool of the Air—Rebroadcast in its entirety by three stations and partially by\ntwo others. WATW, Ashland, has just given notice of cancellation of the series,\nhowever, because the time has been sold.\nFarm Program, Homemakers' Hour—Rebroadcast entirely by one station each, partially\nby s everal others.\nViews of the News—Daily cross section of editorial opinion presented by Roy\n•• Vogelman, rebroadcast by WEAW, Evanston, Illinois.\nManufacturers Plan Special FM Promotion\nWisconsin has been named as one of three special areas chosen for test campaigns to\npromote FM radio set sales. The campaign is a joint project of the Radio Manufac¬\nturers’ Association and the National Association of Radio—Television Broadcasters,\nand will have the cooperation of broadcasters, set makers, distributors and dealers.\nThe campaign will open in North Carolina January 21, Wisconsin February U, and the\nDistrict of Columbia March 1. One manufacturer reports that recent intensification\nof sales efforts in Wisconsin has increased sales four to five times over the rate\nof several months ago.\nThe moral: When people know about the availability of receivers and a distinctive\nprogram service in the same area, there is no ‘*FM problem.”"
}