{
  "id": "d1812-2",
  "text": "Page 3--NAEB NEWS LETTER\n> RFC LOAN FOR WRUL\nThe Reconstruction Finance Corp. has authorized a loan of $40,000, in\nconnection with the national defense program, to the World Wide Broad-\ncasting Corp., which operates international shortwave stations WRUL\nand WRUW, Boston. (See Broadcasting, June 30, Page 39).\nWOOLFRIES LEAVES WOI\nAndy Woolfrles, for 19 years farm service director of v/OI and well-known\nto the WOI audience has left the station for similar work with the\nCowles® group in Dee Moines. Andy is known, too, for his announcing of\nathletic events and for his handling of the classical musical programs.\nFQC ACTI0N8\nThe San Diego Unified School District, of San Diego, California, was\ngranted a permit for a new-non-commercial educational broadcast station\nto operate on 42,300 ko, with 1000 watts power, unlimited time. (6/25/41).\nWHA, University of Wisconsin, was granted special authority to remain silent\non July 4 in order to observe Independence Day. (6/30/41).\nWRUF, University of Florida, filed application for increase in hours of\noperation from limited to unlimited and Installation of directional\nantenna for night use. (7/9/41).\nWOSU, Ohio State University, was granted modification of its construc¬\ntion permit for new transmitter, change in frequency, increase in power,\nfor installation of new transmitter; 820 kc; 5 kw; limited. (7/3/41).\nKFJM, University of North Dakota, Grand Forks, N.D., was granted author¬\nity to determine operating power by direct measurement of antenna la-\nput. (7/IX/4I).\nUniversity of Illinois, was granted permit for new non-commercial edu-\ncatlonal broadcast station to operate on 42,900 ko, 250 watts, unlimited\ntime, FMp (7/I6/4I).\nKWLC* Luther College, Decorah, Iowa, was granted temporary authority\nto operate special time on July 16 In order to broadcast Luther College\nsummer session convocations. (7/I7/4I).\nWNYC, City of New York, was granted special permission to operate\nspecial periods after sign-off time on specified dates in July and\nAugust. (7/2I/4I).\nWSUI, University of Iowa, was granted temporary authority to reduce\nhouTB of operation from unlimited to f,hourer,f^ly<^“/^UBt 4 t0\nSeptember 24 In order to observe vacation period. (7/38/41).\nFrank E. Schooley"
}