{
  "id": "d1812-20",
  "text": "-21-\ntutions and of the special leader classes representing them. In order to\napproach or experience integrity, the individual must know how to be a\nfollower of image bearers in religion and in politics, in the economic order\nand in technology, in aristocratic living and in the'arts and sciences. Ego\nintegrity, therefore, implies an emotional integration which permits partic- .\nipation by followership as well as acceptance of the responsibility of\nleadership. Webster's Dictionary is kind enough to help us complete this\noutline in a circular fashion. Trust (the first of our ego values) is here\ndefined as ’the assured reliance on another’s integrity,’ the last of our\nvalues. . . .And it seens possible to further paraphrase the relation of\nadult integrity and infantile trust by saying that healthy children will\nnot fear life if their parents have integrity enough not to fear death.\"\n(underlining supplied)\nThus far in the book Erickson has been developing his analytical tools. And formu¬\nlation of these tools is the book’s most important offering to the reader such as\nI am, and I suspect, you are. For they serve to help understand how we get this way.\nWe can borrow them, adapt -them if we please, and use them, individually. They alone\njustify the reading of the book.\nErickson goes on further, however, with three more chapters in which he tries out\nhis tools on three contemporary cultures. Chapter 8, \"Reflections on the American\nIdentity,\" explores polarities in our culture with particular reference to \"Mommism,\"\nJohn Henry, and the Adolescent, Boss and Machine. Chapter 9 deals with the values\nin Nazi culture. And Chapter 10 he devotes to the values in the life of the\nRussians. His final chapter is an over-view of the conceptual and methodological\naspects of the book and its thesis, entitled \"Conclusion: the Fear of Anxiety.\"\nIn recommending this as \"must\" reading, one final word on its readability. The\nauthor writes well, by which I mean he writes clearly. He has to use a good many\ntechnical terms from the field of psychology, but he explains them adequately for\nthe general reader as he introduces thou. You will, I think, find this a book you’ll\nwant to own, and refer to many times after a first reading.\nNEWS FROM THE JOINT COMMITTEE ON EDUCATIONAL TELEVISION\nSUMMARY OF JCET STATEMENT ON TV CHANNEL RESERVATION IN MAJOR EDUCATIONAL CENTERS\nWHICH ARE NOT IN METROPOLITAN AREAS\nThe JCET recently informed the Federal Communications Commission that, after \"con¬\ntinuing study,\" it had come to the conclusion that if an educational station is the\nsole source of programs for a major educational center, it should be \"permitted to\nbroadcast programs which at present are available only from commercial network\nsources.\"\nProblem is That of the Single Station Area\nAlthough in its original statement to the Commission the JCET had requested the res¬\nervation of some VHF channels by use by educational institutions in standard metro¬\npolitan areas to which only a single VHF allocation was to be made, it subsequently\nwithdrew that request and recommended instead that such a single VHF channel be\navailable both for educational and commercial use. In its recent statement the JCET"
}