{
  "id": "d1812-21",
  "text": "-22-\nre viewed the fact that it had originally asked the Commission \"for the reservation\nof one VHF channel in all major educational centers outside the metropolitan areas,\"\neven though such WF channel might be the only one in its locality* The JCET then\nwent on to say;\nThe Commission, in its tentative allocation plan, reserved for educational use\nthe single VHF channel allocated in a number of major educational centers out¬\nside metropolitan areas. In others, a single UHF channel was similarly re¬\nserved. For example, in ... the southeastern portion of the United States,\nsome of the major educational centers to which the Commission has allocated a\nsingle channel and reserved it for education are University, Alabama, where\nVHF Channel 7 has been reserved. State College, Mississippi, where VHF\nChannel 2 has been reserved, and Chapel Hill, North Carolina, where VHF\nChannel h has been reserved. ,,\nIn the continuing study which the JCET has given to the entire problem of\neducational television, it has come to the realization that a special prob¬\nlem exists in major educational centers which do not receive television ser¬\nvice from other television stations.\nCommercial Tie Ups on Interim Basis Only\nThe JCET supports the concept of making available a full television program\nservice. The JCET believes that the one best hope of providing the citizen\nin a democracy with the background information he requires to cope with his\nproblems lies in the provision of a sufficient number of non-commercial educa¬\ntional television stations whose primary aim is the fulfillment of his needs.\nIn the standard metropolitan areas potential full program service is avail¬\nable by the provision of channels for both commercial stations and non-com¬\nmercial educational stations. In the major educational centers a full pro¬\ngram service can be provided during the interim before additional channels\ncan be utilized only if the single educational station operating in the area\nis permitted to broadcast programs which at present are available only from\ncommercial network sources. ...\nThe Commission in considering the development of television in each educa¬\ntional center could make it possible for the educational television station\nto render a full television service. The Commission should consider the\nneeds of a public dependent on a single station for all television service.\nIn placing this problem before the Commission, the JCET states unequivocally\nthat the major educational centers under discussion have a continuing need\nfor the insurance of orderly development of educational television made pos¬\nsible by the reservations proposed. Precisely the same process of organizing,\nplanning, and cooperative development is required in the major educational\ncenters as in the metropolitan areas. The reservations proposed by the\nCommission are indispensable if educational institutions are to have a fair\nopportunity of moving forward in the field of educational television. What¬\never temporary arrangements must be considered in light of this problem of\nthe major educational centers should be construed neither as a method for\nfinancing operations of non-commercial educational stations nor a departure\nfrom the basic philosophy of the Commission^ proposed reservations for non¬\ncommercial educational purposes."
}