{
  "id": "d1812-22",
  "text": "-23-\nJCET Still Requests Non-Commercial Educational Reservations\nThe JCET reaffirms its conviction that education has an unparalleled respon¬\nsibility in the field of television. The impressive evidence provided by the\neducational establishment to the Commission, as summarized in the eight-part\nBrief of the JCET, proves conclusively and without question that educators\nhave accepted their responsibility. The Joint Committee on Educational Tele¬\nvision is convinced that the public can best be served through the reserva¬\ntion of channels for non-commercial educational television, and that reser¬\nvations are indispensable, both in standard metropolitan areas and in major\neducational centers, for the development of television that will be truly in\nthe public service.\nJCET OPPOSES COMBINED HEARINGS FOR UHF AND VHF APPLICANTS\nThe Joint Committee on Educational Television, representing American education in the\ncurrent television allocation proceedings, recently filed a statement with the\nFederal Communications Commission emphasizing the importance of a rapid development\nof television service in the Ultra High Frequency band. One hundred and twenty-\nseven of the 209 channel assignments proposed for education by the Commission last\nMarch are in the higher frequency band, and the JCET is looking out for the inter¬\nests of hundreds of educators already planning for the utilization of those chan¬\nnels. At the same time, JCET reminded the Commission, a complete nation-wide\ntelevision service is possible only with the use of the UHF band.\nThe seven Commissioners, now considering evidence in support of educational reserva¬\ntions in both VHF and UHF broadcasting bands, besides statements from those who want\nto operate the proposed 1800 commercial television stations, must also plan for the\nprocessing of applications which will be filed after the \"freeze.’1 It is in this\nconnection that the JCET presented its argument strongly opposing combined hearings\nfor UHF and VHF applicants.\nThe \"one-pot\" theory advanced by the Federal Bar Association, says JCET, would put\nboth types of applicants in the same hearing; the best qualified to receive VHF\nassignments, the lesser qualified, UHF. Hearings may take two or more years, during\nwhich time no grants w>uld be made to anyone in the cities involved. Such a delay\nat this critical period would discourage educators to move toward the utilization\nof their reserved UHF channels, according to JCET.\n\"The only effective way of removing the experimental tag from the UHF band is to\nhave as many UHF stations as possible on the air as quickly as possible. The oper¬\nation of such stations, particularly in the large cities, will also give manufac¬\nturers the necessary incentive to produce and market UHF converters and all-band\ntelevision receivers. For an educational station in the UHF band to do a signifi¬\ncant educational job, it must have a large audience equipped with sets capable of\nreceiving educational programs.\"\nThe educators state that since the demand for UHF facilities is not as great as that\nfor VHF, \"it is conceivable that in large cities a number of UHF, grants could be\nmade without hearing, thus stimulating earlier development of the UHF service.\"\nVHF channels in the Very Hi$i Frequency band are numbered 2 through 13. UHF chan¬\nnels in the Ultra High Frequency band are numbered lU through 6£. VHF channel No. 1\nhas been deleted from television service and turned over to the mobile radio ser¬\nvice. The 108 television stations now in operation are in the VHF band."
}