{
  "id": "d1812-4",
  "text": "-5-\nthe audience of educational programs in about the same proportion as they held in\nthe sample*\nAlso from the study it was indicated that the audience for educational radio pro¬\ngrams is normally composed of a disproportionate number of persons in the “1*0 or\nmore1* age category, and that this ratio cannot be permanently affected by promotion\nfor adult programs.\nTWO NAEB MEMBERS—WNYC AND WFUV—COMMENDED BY \"NEW YORK TIMES11 RADIO CRITIC\nJack Gould, New York Times radio critic, took occasion to compliment two NAEB active\nmembers in a recent article in his daily column in the Times, “Radio and Tele¬\nvision.” Mr. Gould wrote: '\nA long-overdue drive to advance frequency modulation radio, which, in the\nNew York area in particular, offers a listener an almost sublime escape\nfrom routine-broadcasting drivel, is scheduled to be started next month\n/January/ by the set manufacturers and FM broadcasters.\nThe initial promotion efforts are to take place in rather widely scattered\npoints—North Carolina, Wisconsin and Washington, D. C.—but there are\nother evidences of increasing interest in FM on a broader basis.\nSignificantly, the Radio Corporation of America, which wields a strong in¬\nfluence in set manufacturing circles and in recent years understandably has\nbeen somewhat preoccupied with TV, has brought out an excellent combination\nFM and standard receiver. With TV set sales having subsided in recent\nmonths, apparently there is at least an even chance of the FM field enjoy¬\ning more attention. w\nWNYC Music Mentioned\nActually, Hie attractions of FM for the discriminating listener in New York\nhave increased rather than lessened with the advent of TV. For what never\nhas been generally understood is that many of the types of programs for\nwhich a substantial minority of listeners have been pleading already exist\nin generous quantity on FM.\nFine music? There is an abundance to be found on FM. Not only are all the\nprograms of WQXR and WNYC duplicated on FM, with its far greater freedom\nfrom interference and superb fidelity of reproduction, but there are also\nWFDR and WABF, FM outlets only, with a wide choice of classical fare. After\nWNYC signs off at 11 P. M., its FM affiliate goes on for four more hours\nwith music.\nBelieve it or not, the millenium for many a listener is to be had on FM,\ntoo. Station KE2XCC, the experimental station of Major Edwin H. Armstrong,\ninventor of the modern FM system of broadcasting, plays music—popular,\nlight and classical—hour after hour without so much as a word spoken.\nAnother station, WGHF, is the outlet of \"Storecasting” during the daytime\nhours, which means there’s music and plugs for grocery products. In the\nevening hours it provides virtually straight restaurant music."
}