{
  "id": "d1812-7",
  "text": "-8-\nKWLC (LUTHER COLLEGE) MARKS TWENTY-FIFTH ANNIVERSARY\nStation KWLC, Luther College’s 25>0-watt station in Decorah, Iowa, marked the 25>th\nanniversary of the first broadcast from Luther College in December,\nLuther College, with an enrollment of seme 600 since Korea, maintains a U-hour\nbroadcasting day, sharing time with local commercial station KDEC in Decorah, Iowa.\nKWLC carries original student programs of news, comment, and religious activities,\nwith occasional use of original manuscripts. Daily programming offers convocation\nprograms, news, serious music, student musical programs, religious programs by\nlocal pastors and campus special events. With access to network and news service\nand with equipment including professional console turntables, tape recorders and\nmicrophones, KWLC does a constant service to its listening area, what it calls \"pro¬\ngrams with a conscience,'1 Recent moves include expansion into selected night-time\nspots on station sharing time, including a popular science quiz.\nRadio pioneer at KWLC is chief engineer Oliver Eittreim, responsible for keeping the\nsignal going with some kind of words or music to maintain the station license back\nin its incubator days. A dinner and program marking the occasion is slated for\nJanuary 18. Principal speaker will be Dr. Orville Dahl, Director of Higher Educa¬\ntion for the Evangelical Lutheran Church, which owns Luther College.\nLuther College and KVIC have produced a number of radio and TV men now employed in\nreligious and secular broadcasting in the Upper Midwest, Present director is Lee\nEitzen, a Luther alumnus who finished graduate work in music at the University of\nMichigan in 19^0.\nSIEGEL APPOINTED RADIO-TV CHAIRMAN FOR UNESCO CONFERENCE\nSeymour N. Siegel, NAEB President and Director of Radio Communications for the City\nof New York, has been appointed Chairman of the Radio and Television Committee for\nthe Third National Conference of the United States National Commission for UNESCO.\nThe meeting will be held at Hunter College, 69th Street and Park Avenue, Manhattan,\nJanuaiy 27-31.\nThe following industry committee will serve with Mr. Siegel: Arnold Hartley, Program\nDirector of WOVj Carl S. Ward, General Manager of WCBS; Charles Baltin, Vice-Pres¬\nident of WHOM; Leon Goldstein, Vice-President of WMCAj Dave Driscoll, Director of\nNews and Special Events for WOR; Richard Park, Program Director of WNEWj Chris J. .\nWhitting, Director of the DuMont Television Networkj Ted Cott, General Manager of\nWNBCj Helen Sioussat, Director of Talks for CBS and Doris Corwith, Supervisor of\nTalks for NBC.\nThe purpose of the conference is to bring together a group of leaders, broadly rep¬\nresentative of American life, to consider ways to improve our understanding of and\nparticipation in world affairs, particularly through the United Nations and the\nSpecialized Agencies. Some two thousand persons are expected to attend.\nWOSU DOES NEW POLIO SERIES\nFor several years Ohio State University’s WOSU (Columbus) has broadcast special pro¬\ngrams and spot announcements about infantile paralysis. Then polio became a per¬\nsonal matter to William Ewing, Program Supervisor, when his daughter Lorita was at¬\ntacked by the disease. He and Mrs. Ewing made daily visits to the Children’s Hos¬\npital in Columbus where Lorita was confined."
}