{
  "id": "d1724-1",
  "text": "NAEB NEWS LETTER\nPAGE 2\nDecember 15, 1941\nin evidence. Burton Paulu, Minnesota, was there, too, Blanche\nYoung, Juliet Forbes, Luella Hoskins, Marion Panko, Mary Agnes\nSchroeder, Jean Simpson, J. Robert Miles, Seeley Reid, H. 8.\nSummers, Nopman Woefel, Kenneth Barelett, W. W. Charters, Judith\nWaller, Tom-Rishworth, Sterling Fisher, Bill Sener, Dave Owens,\nWo B. LEVENSON, AND OTHERS TOO NUMBROUS TO MENTION,\nWNYC AND DEFENSE *\nHere is a summary of some of the activities of WNYC, New York City’s\nOwn Station, during the twO7 days, (Sunday and Monday, December 7 and\n8o\nSunday, December 7, put on the first radio announcement of the raid\non Hawaii, (Exact time 2:25:15 p.m.) Thanks to the Associated Press\nand the fact that we were in the middle of a news report period.\nPresented summaries of the latest news at 3:00 p.m., 3:30 p.m., 4:00\np.m,, 4:15 p.m., 5:00 p.m, and every half hour after that at 20 minutes\nAFTER THE HOUR AND TEN MINUTES BEFORE THE HOUR. REMAINED ON THE AIR\nUNTIL MIDNIGHT TO BRING BULLETINS AND SPEC^ljL ANNOUNCEMENTS, WNYC S\nREGULAR SIGN OFF TIME IS 5:30 P.M, BROADCAST THE MAYOR S SPEECH\nDIRECT FROM CITY HaLL, EXCLUSIVELY AT 5:15 P.M, AND FED IT TO NBC,\nMutual and WHN at 6:00 p,Me\nMade the following special announcements during the course of the\nevening:\n(1) All Naval personnel to report for duty at once,\n(2) All personnel of Mitchell Field to report at once.\n(3) All personnel of Floyd Bennett Field to report at once0\n(4) Naval recruiting offices to open at 8:00 a.m.\n(•5) Marine recruiting office to open at 7:30 a.m,\n(6) Air raid wbrdens and members of the Fire Department\nAuxiliary Coprs to stay near telephones in case of\nEMERGENCY CALLS,\n(7) Transportation facilities now available for men from\nMitchell Field at Pennsylvain ia Station.\nActed as a clearing hour, passing announcements to radio\nstations throughout the city.\nMonday, December 8, News summaries every hour on the hour, with news\nbulletins inserted into programs whenever warranted. Broadcast the\nPresidents speech at 32:30 p.m. Rebroadcast the President s speech\nat 4:15 p.m. Arranged for sound truck to carry the broadcast and\namplify the speech to crowds at City Hall Plaza. Sound truck takes\nRECORDING UP TO TIMES SQUARE AND PLAYS IT FOR CROWD AT 2:30 P.M.\nSound truck amplifies rebroadcast for crowd at Sub-Treasury Building\nat 4:15 plMo Broadcast the following special announcements:\n(I) Navy and Marine recruiting offices open at 8:00 and\n7:30 p.m. respectively."
}