{
  "id": "d1865-11",
  "text": "determined definitely that there is a considerable need and desire for this type\nof instruction. Enrolments have steadily mounted each quarter with as high as\n1200 different students enroled in a single course. The total enrolment has\nvaried from 624 to 1538. The average student enrols for three radio courses.\nWith the assistance of the bureau of educational research of the Ohio State\nUniversity, a detailed analysis of enrolment cards for the autumn quarter, 1934,\nwas made. A complete report of this analysis can be secured upon application to\nthe bureau, but I should here like to call your attention to a number of signif¬\nicant findings. We found that 75 of the 88 counties of Ohio were represented in\nthe enrolment. The students' ages ranged from 17 to 80 years, the median age\nbeing 31. 18 percent were under 20 years of age; 12 students were over 60; and\none ¥/oman was 80# The women were older than the men, median ages 33 as compared\nwith 24. The women students were three times as numerous as men. 85 percent of\nthose enroled were American born. 88 percent gave town and city addresses, the\nremaining 12 percent rural. Approximately one person in' each four indicated a\ndesire to sometime secure credit for the work. Those persons desiring credit\nwere almost always jrounger people who entertained a desire to attend college. 23\npercent of those enroled during the autumn quarter had been previously enroled in\nthe radio junior college. 88 percent of the enroled students were high-school\ngraduates, 16 percent having graduated from high school between 1930 and 1934.\n35 percent of those enroled reported having attended a college or university,\n15 percent having received a degree. 19 percent reported having attended business\nor other professional schools since their graduation.\nIt can clearly be seen from the above infoiroation that the work of the radio\njunior college appeals to a medium-aged group. Their desire is largely to secure\nadditional instruction without regard to receiving any type of credit for their"
}