{
  "id": "d1865-13",
  "text": "-5-\nthe many details involved. The operating budget, which includes the salary of these\nthree people and all office supplies, printing, and postage, has totaled about\nP2000 for each three-month period. In addition to this, *150 per month has been\npaid at the rate of forty cents per hour for the ten FIS/*, students. When authoriza¬\ntion was given during the spring quarter to frank the material mailed to students a\nsaving of ;it>200 per month was effected. This franking privilege was obtained thru\nthe Emergency Schools Adminstration and is now extended to all authorized relief\nprojects.\nThe Ohio Emergency Schools Administration employed from fifteen to twenty county\nradio supervisors during the past year to assist in publicizing radio classes thru-\nout the state. These county radio teachers were supervised by the administration,\nand, unfortunately, were not very well organized. Several of the county radio\nteachers were quite active and successful in interesting students in the program\nof the radio junior college, but for the most part these couty radio teachers con¬\ntributed little to the work. Their duties were to acquaint all people, as fully\nas possible, with the program by securing articles in the press and making appear¬\nances before clubs and other meetings. They assisted, to some extent, in enroling\nstudents in their own localities. A few classes were organized and met regularly\nto listen to and discuss the radio lectures. As an example of what can be done\nby such a county teacher, under proper conditions, the activity in Erie County,\non the shore of Lake Erie, 125 miles north of Columbus, can be cited.\nThe county teacher at that point organized three classes which met regularly\nduring the past year. She organized her people in such a way that there would be\nno hesitation about meeting in the homes of the listeners, thus contributing some¬\nthing of a social value to the class. Frequent notices of the class meetings were\ncarried in the news and societ^r columns of the county papers. The average group"
}