{
  "id": "d1865-19",
  "text": "-5-\nchannels would be sufficient for such a systeml^fproadcasting knows no state\nJr\nines. It is as broad as the air, and the air belongs to everyone* XtHbSf'\nunreasonable to ask that the public shall have for public broadcasting service\nliT\npercent of the air, leaving percent to private monopoly,\nparticularly when the public, thr|>ij^ its government, creates and protects the\nrights of private monopoly?\nThe establishment of a government system for public broadcasting is\nnot government monopoly* jt i^s not fascism in, radioj it is not the English\nhvj 1 ... e\nsystem^ third governmental chain operating parallel to and coincident with\nthe two private chains avoids the danger of governmental monopoly. The combin¬\nation of public and private systems is the strongest advantage offered by the \\\nplan proposed. T^e current arguments against a complete governmental system\ndo not apply to the combined system.%*|^reedom of the press is secured not so\nmuch by law as by the multiplicity of independent publishers. No newspaper\ncan be too partisan, too misleading, too inaccurate, or it will be caught up\nand exposed by a competitor. There are limitations beyond which no newspaper\ndare go in editing the news, in coloring the facts, in repressing the truth.\nbecause some competitor will reveal\n1^4\naction. |^A radio system for America,\ncomposed of great private chains, a public chain, and affiliated local public\nstations, affords the utmost possibility of checks and balances. To capture\ncontrol of such a system would be well-nigh impossible. Freedom of speech on\nthe air would be assured within the unavoidable limits of radio’s facilities an<\nresources. America has placed her faith for safety and security in systems of\nchecks and balances. Forty-eight state^ sovereignties, are checks upon each\nother and upon the federal government. Legislative, executive, and judicial\nbranches of government check and counter-balance each other. A system of broad¬\ncasting for America, including private chains, public chain, and local public\ncontrol' broadcasting lies in the fact that the programs are nation wide, appeal—\nK\nstations^, presents a combination which assures safety .4* e great me{a|6be of"
}