{
  "id": "d1865-3",
  "text": "-4-\nIn my opinion, we now have in charge of radio regulation, a Commission which is\nmore favorable to the point of view of the educational groups than has been the\ncase since the first Radio Commission was appointed. May I indicate some of the\nfactors which lead me to the conclusion?\nHonorable Aiming S. Prall, chairman of the Federal Communications Commission,\non April 10, 1935, speaking over a combined NEC and CBS network, stated:\n\"The Federal Communications Commission is determined to clear the\nair of offensive programs and to encourage to that end broadcasters,\nwho, regardless of the success or failure of the future of broadcast¬\ning, count only its present financial possibilities.\nLess than a month later, speaking before the sixth annual Institutefor Edu-\ncation by Radio, Chairman Irall told us:\n\"You have my assurance now that we are ready to cooperate fully\nwith you and to contribute as far as possible to the final and complete\ndevelopment of a definite, practical, and workable plan for t.ie exten¬\nsion, expansion, and modernizing of education by means of radio broad-\ncasting.”\nTwo months later Chairman Frail informed the members of the National As¬\nsociation of Broadcasters that the Federal Communications Commission had \"injected\na bit of New Deal in radio during the past few months.\" he further elaborated\nupon the intention of the Commiosion to eliminate fraudulent advertising as well\nas programs not clearly in the public interest. He made it clear that, whereas\nthe Commission w: s not permitted to censor programs, it could and would consider\nwhether the programs which had been broadcast complied with the mandate of serv\ning public interest, convenience, and necessity, and emphasized the fact that\neach broadcasting franchise was contingent upon such a yardstick.\nA second member of tile Federal Communications Commission who has appeared\nin the public eye because of his public addresses has been Commissioner George\nHenry Payne. Mr. Payne is a widely known and experienced journalist. Altho he"
}