{
  "id": "d1865-9",
  "text": "THE OIiIO ntERGMJCY RADIO JUNIOR COLLEGE*\nThe Ohio Emergency Radio Junior College was established in February 1934 as a\ncooperative project of the Ohio Emergency Schools Administration and the Ohio State\nUniversity. The purpose of this project has been to make available instruction of\ncollege level to radio listeners within the range of Station UOSU, the station\nowned and operated by the Ohio State University.\nThe courses presented in the Radio Junior College are, for the most part, spe¬\ncial courses prepared and adapted for radio presentation. In a few cases regular\nuniversity classroom courses have been broadcast when these were found to be well\nadapted to radio presentation. These latter courses were principally of the lecture\ntype in which the class participated to only a limited extent. The instructors\nfor all courses have been members of the regular faculty of the Ohio State Univer¬\nsity, and the radio courses have been considered in most cases as part of their\nregular teaching load. Courses have been broadcast in Spanish, history, psychology,\nEnglish, political science, French, sociology, philosophy, engineering, education,\nart appreciation, home economics, geography, music, and poultry husbandry. Some\nof these courses have been broadcast three or four days each week.\nThe Ohio Emergency Schools Administration, a division of the state relief or¬\nganization, administered largely thru the federal relief administration, has co¬\noperated in providing funds for the employing of office assistance, printing and\nmimeographing of supplementary lesson material, BtuJLling and distribution of such\nmaterial, county radio teachers, and all office supplies and materials. The univer¬\nsity has contributed the facilities of the station, the instructural staff, and\nthe supervision of the work. In addition ten university students were employed\n*An address by R. C. Higgy, director, radio station 17QSU, the Ohio State University,\nbefore the annual convention of the National Association of Educational Broadcasters,\nIowa City, Iowa, September 9, 1935. Mimeographed and distributed thru the courtesy\nof the National Gommittee on Education by Radio, 1201 Sixteenth Street .Washington,\nD. C."
}