{
  "id": "d1332-0",
  "text": "NPA-E-B NEWS LE.TTEP\nNational Association of Eduoational Broadcasters\nMadison, Wisconsin — March 21, 1936\nNAEB MEETINGS AT OHIO INSTITUTE\nThe annual meeting of the Institute for Education by Radio will be held at Col¬\numbus, May 4, 5 and 6. On Monday evening there will be a closed meeting of the\nNAEB members who are in attendance* Among the topics to be discussed are the for¬\nmulation of a more definite policy and statement of objectives, convention plans,\nfacilities, the Federal Radio Education Committee, transcriptions, and other\nproblems which concern those present*\nThe general session on Monday afternoon will be arranged by the N.A.E.B., and\nPresident McCarty will preside*\nAll members who can get away for the Columbus Institute meetings are urged t©\nbe there. Each year this affords an excellent opportunity to keep abreast ef de¬\nvelopments in the techniques of educational broadcasting. Practical problems in\nscript writing and production will come in for considerable attention this year,\naccording to advance information* Will you be there?\n1936 MEMBERSHIP DUES COMING IN\nTreasurer B.B. Brackett reports that memberships for the current year have\nbeen received from the following stations: WESG, WEvj, WCAC, KOAC, WILL, KFJM,\nKFDY, WBAA, KWSC, WHAZ, WrSAJ, WSUI, WOI, WTAW, WCAL, WHA, KUSD, WHAD, And KFKU.\nIf your station isn't listed, check up on the matter now* Some directors have\ncomplained that their institutions are unable, under regulations, to pay for their\nmemberships. Others, under similar restrictions, have managed to handle it. The\nanswer seoms to be \"Where there's a will, there's a way.\"\nNAEB TRANSCRIPTION LIBRARY\nOur goal of a recording machine for the use of members in transcribing out¬\nstanding educational features is within short reach of realization*\nCarl Menzer, WSUI, is heading up a committee to make final tests, financial ar¬\nrangements, and plans. It is expected that within a month the project can be com¬\npleted and service started. Now, wise use of a recorder and the building of an\nexchange transcription library mil require careful planning. So far, there has\nbeen little response to the invitation in the February News Letter calling for\nsuggestions. What are your thoughts on tho matter?\nDepend upon it, recording quality will be excellent. None of this tubby,\nscratchy stuff we've had in the past from instantaneous recorders. A machine such\nas we hope to acquire has been in use at WTIA for several weeks, with gratifying re¬\nsults. Transcriptions for broadcast are being made and used regularly. Programs\nwhich have been recorded and broadcast include talks, dramatizations, and a 14 min¬\nute record of the University Concert Band of 80 pieces.\nPlanning a Transcription Exchange will be one of the subjects for consideration\nat the Columbus meeting of NAEB members. Meanwhile, let's have your ideas for de¬\nvelopment of this promising service."
}