{
  "id": "d1332-6",
  "text": "-7-\nWHA - University of Yfisconsin* Director McCarty reports a now plan ty which ho\nhopes to \"bring out*' radio talent oarly in the student’s college career* He is re¬\nceiving applications frora students who will noxt fall enter the university and who\nwish to get in on a club for freshraen boys* Only 10 will be accepted* These must\nhave recommendations from their principals or tcachors before they will bo consid¬\nered. They will be given regular training and later will have regular broadcasting\nassignments* This will provide them with good experience and will give tho station\na wider range of helpers. Heretofore proficient announcers have been grabbed up\nfor commercial work as soon as they wore trained* Mac beliovos in the saying \"Got\n’em young and train ’em”, or something like that,\nMEMBERS GET \"TREASURE TRAILS\" SCRIPTS\nArrangements have boon completed with tho National Park Service for free use of\ntho new \"Treasure Trails\" sories of dramatic sketches* The first throe of the t»hir-\ntoon episodes have been received and are being included in tho exchange packet which\nis now going out* Others will roach you as they are released#\nThis series is now being broadcast over at least a portion of tho NBC Blue net¬\nwork, 5j30 to 5;45 EST on Saturdays* The scripts are well written to present in\ncolorful, dramatized from the adventures of a typical American family touring the\nnational parks,\nBROOKINGS INSTITUTION OFFERS TRANSCRIPTIONS\nTho free use of a serios of fine electrical transcriptions is offered our mem¬\nbers through the Institute of Economics of tho Brookings Institution* They deal\nwith problems associated with tho distribution of wealth and income in relation to\neconomic progress. Information is presented informally in dialog and round table\ndiscussion stylo.\nThere are five electrical transcriptions available* Each of these programs\nrepresents a meeting of tho board of tho \"All American Corporation.\" This mythical\ncompany is faced with problems which confront all business today* In simple and\nunderstandable language, tho story of how thoso difficulties have developed, and\nhow they may be remedied, is unfolded*\nTo get these transcriptions, write Mr* Vernon Lyon, The Brookings Institution,\nWashington, D.C., referring to tho arrangement made for N.A.E.B* members*\nTHE KOB HEARINGS POSTPONED\nHearings before the F*C.C* in tho KOB case through which tho State of Now\nMexico hopes to acquire the station for educational purposes have again boon post¬\nponed, Set previously for March 25, tho case has been continued by the Commission\nto come up oh May 25, Horace L. Lohncs reports from Washington.\nNEWS LETTER HEADQUARTERS\nTo simplify the collection and distribution of information, our next News Letter\nwill again bo issued from Madison* Address comments and contributions for the bul¬\nletin to our Executive Secretary, Harold A. Engel, WHA, Madison, Wis* Tho estab¬\nlishment of definite headquarters for the News Letter should help to insure stand¬\nardization and regularity. More work for McCarty and Engel, but more efficiency\nfor the organization perhaps."
}