{
  "id": "d943-0",
  "text": "BRIEF REPORT TO THE W. K. KELLOGG FOUNDATION\nfrom the\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nAs one of the oldest professional organizations in America, started in 1924,\nthe NAEB existed for many years as an organization in which the representatives of\nsome twenty or thirty institutions owning and operating college stations met more or\nless informally together once or twice a year, whenever other conferences saw them\nassembled. It was not a particularly strong or confident group since in virtually\nevery bout in which real (usually commercial) competition was encountered, educa¬\ntional broadcasting came out second best. The number of educational stations had\nbeen virtually decimated, being reduced from 200 to 20, between the early 1920*s\nand the early 1940's.\nMost members of the small organization realized that this situation was due\nlargely to lack of genuine organization, lack of adequate budgets, lack of status\nwithin their own organizations, (which frequently meant lack of respect for the\nmedium of radio), and lack of representation at the national and higher educational\nlevels.\nThe possibility of opening up new space in the spectrum, as FM was being con¬\nsidered, along with the above conditions, led to increasingly serious discussions\nof a recognized and reserved place in the American educational picture, and\nspecifically in the wireless spectrum, for educational broadcasting. This, it was\nthought, would prevent a repetition of the decimation mentioned above, in which\neducation, in many areas and respects the pioneer in radio in America, lost some of\nthe finest station channels in the United States to commercial broadcasters.\nDuring the 1940's modest efforts were made by NAEB leadership to begin to hold\nconferences with some of the outstanding educational planners in the nation. The\nNAEB's confidence in its mission and task was strengthened by several factors: l)\nits success and leadership in rallying support to secure specific allocations in the\nFM broadcast spectrum for educational use exclusively; 2) the friendliness and\nunderstanding with which its proposals and thoughts were met in the FCC as then\nconstituted; and 3) the apparent favor with which certain Foundations looked upon\nits plans and proposals.\nIn the late 1940's funds were secured for the first of what was to be a series\nof three Allerton House conferences, at which broadcasters, subject matter\nspecialists, and social scientists particularly met together for two-week periods,\nlong enough to begin to hammer out blueprints for the future. Out of these meetings\ncame a dream. ..but also broad outlines for what, it now became obvious, would require\nconsiderably larger resources than the NAEB had at its disposal, plus a permanent\nstaff and office. Plans were drawn up which could be presented as requests for\nFoundation support."
}