{
  "id": "d943-50",
  "text": "COPY\nW. K. Kellogg Foundation\nBATTLE CREEK, MICHIGAN\nOctober 22, 1954\nDr*. Harry J. Skoroia\nExecutive Director\n■attou&i A ssociation of Educational\nBroadcasters\nUniversity of Illinois\nUrbuaa, Illinois\nDear Harry*\nToday is the first opportunity I have had to really study your\nletter of September 29 concerning the Foundation making a further\ncommitment to cover your new associate director* s salary for the\n1955-56 fiscal year, which is the filial year of our commitment.\nThe first payment Qf $22,000- out of the additional $32,000, which\nwas committed February 22, 1954, was for the 1953-54 fiscal year. On\nAugust 17, 1954, we aide a payment of $50,500 which included the second\npart of the new commitment in the amount of $10,000. You will recall\nthat the original pay ant for the fiscal year, 1954-55, was $40,500* '\nOf our total cossaitssent of $277,350, this then leaves a balance of\n$34,Oil- for the final fiscal ye r, 1955-56.\nI not© that you indicate the associate director will have served\n& year and a half, although we have made payments including two full\nyears1 salary# I wonder, therefore, if this would make a difference in\nthe amount you will need for his salary for the fi cal year, 1955—56*\nThis is the major uedian in my mind, to/ever* Are y-u not\ngoing to have the s-„. art you expect'd for the year, 1955-56, that\ncaused- you not to re uent a third-year sal ry for the associate\ndirector? It Is a bit awkward for us to say to our trustees at this\ntime that the additional camitment of $32,000 should have boon\n$40,743.20.\nOne other uestioa. You indicate that, unless budgetary\nprovisions for hi a salary can b© added to the earlier a. . .roved Kellogg\ngrant expected for the 1955-56 fiscal year, you shall i-ve to drop\nyour associate director a year before the expiration of the re t of\nthe present Kellogg grant. What will ha- on to him at the end of the\n1955-56 fiscal year if we should make the additional commitment of and\npayment of a sufficient amount to carry him through the 1955-56 fi cal\nyear?\nI am -sorry that other Foundation obligations will prevent me\nfrom belay with you a.,.a in Hew York City. I have written Graydon"
}