{
  "id": "d943-68",
  "text": "2\nIntroduction\nThe NAEB In-School Radio Program Writers* Seminar of 195U was held at Sta¬\ntion KSLH, St. Louis, Missouri, June 7-11* 195U. It was conducted by a Director\nand three Consultants, and was addressed by a number of guest speakers, half of\nthem drawn from the St. Louis Public Schools. The Seminar was attended by 20\nwriters, representing 18 educational stations from lU states. It was made possible\nas a regularly budgeted item in the NAEB grant from the W. K. Kellogg Foundation.\nThe need for the Seminar was first voiced by the NAEB In-School Program Com¬\nmittee, and was later reviewed and approved by the NAEB Board of Directors. It was\nfelt that the increasing emphasis on the admittedly urgent proglems of educational\ntelevision, since 195>2, had created a tendency to overlook the needs of educational\nradio in many quarters. A Seminar devoted to meeting some of those needs, specifi¬\ncally the problems of the writers of in-school radio programs, would not only help\nmany of the NAEB member stations, but would also have far-reaching effects on the\nin-school programs received by a growing in-school audience which was recently\nfound to be well over a million. In actual execution it was found impractical to\nexclude television completely as will be noted in this report. • .\nMr. Graydon Ausmus, NAEB President, then appointed Miss Marguerite Fleming,\nDirector of Station KSLH and both a member of the NAEB Board of Directors and Chair¬\nman of the In-School Program Committee, to assume the responsibility of organizing\nsuch a Seminar. Miss Fleming and the committee secured the following Seminar lead¬\ners: Miss Gertrude F. McCance, Supervisor of School Broadcasts, Department of Edu¬\ncation, Winnipeg, Manitoba; Miss Betty T. Girling, Director, Minnesota School of\nthe Air, Station KUOM, University of Minnesota; Mrs. Helen Stanley, formerly Script\nEditor, Wisconsin School of the Air, and Instructor in Speech and Radio Writing\nat the University of Wisconsin; and Edward Stasheff, Associate Professor of Speech,\nUniversity of Michigan, who served as Director of the Seminar."
}