{
  "id": "d943-90",
  "text": "21*\nFor the afternoon session, the Seminar was divided into three groups. Over\na third of the members had requested a session on the fundamentals of radio writ¬\ning, since it developed that although they were currently charged with the respon¬\nsibility of writing whatever local scripts were being produced on their respective\nstation, they had had little or no formal training in radio writing. Some of\nthem had been so recently given radio writing assignments for their school sta¬\ntions that they had had no opportunity even to master the standard texts in the\nfield.\nAccordingly, Miss Girling met with this group for a two-hour session on fun¬\ndamentals. At the same time, Mrs. Stanley met with another group who had been\nworking in the field for a good many years, and who had studied writing for radio\nover a considerable period of time. This group discussed problems of a more ad¬\nvanced nature. Still a third group met with Mr. Stasheff to discuss the problems\nof writing for educational television, and to analyze a number of TV scripts, made\navailable by Station KETC, the University of Michigan, and the New lork City Board\nof Education Station, WNYE. Enough scripts were available to give each of the\nhalf-dozen members in this group two or three samples to take home for further\nstudy.\nFor the second part of the afternoon, the entire Seminar met in joint ses¬\nsion once more. Problems posed by members of the Seminar were discussed by the\nSeminar staff and by members who had had considerable experience in those prob¬\nlems. Space limitations do not permit more than the listing of these: How to\nOrganize and Plan an Interview Series, and an Individual Interview Program; Quality\nvs. Quantity in Educational Radio Production; Problems in the Use of Student Tal¬\nent; Problems in Individual Formats.\nIt had been planned originally to devote an entire day to the problems of\nwriting various program types, and so the last point was postponed until the fol¬\nlowing day. In the evening the Seminar met again to hear and discuss four more"
}