{
  "id": "d1153-1",
  "text": "In granting the applications, the Commission stated: \"We recog¬\nnize that as shown by the complaints here, such provocative programming\nmay offend some listeners. But this does not mean that those offended\nhave the right, through the Commission's licensing power, to rule such\nprograms off the airwaves, No such drastic curtailment can be coun¬\ntenanced under the Constitution, the Communications Act, or the\nCommission's policy...we are charged under the Act with 'promoting the\nlarger and more effective use of radio in the public interest.and*\nobviously, in the discharge of that responsibility, must take every\nreasonable precaution to avoid inhibiting broadcast licensees' efforts\nat experimenting or diversifying their programming.\"\nTo the charge which had been issued that the applicants were\nmembers of the Communist Party and were using their stations as instru¬\nments of that Party, the Commission asserted that \"on the basis of infor¬\nmation obtained from Government sources, the Foundation, and our own\ninquiry, we do not find any evidence warranting further inquiry into\nthe qualifications in this respect of Pacifica Foundation.\"\nLOS ANGELES ETV RECEIVES CP AND HEW GRANT\nThe FCC, on Jan. 27, authorized a CP for TV Channel ^28 to\nCommunity Television of Southern California to provide the first non¬\ncommercial educational television service to the greater Los Angeles\narea. Also, HEW assisted with a grant of $468,790, awarded under the\nETV Facilities Act.\nFCC Chairman Henry commented that \"community and educational\nleaders in Los Angeles have worked diligently toward the development\nof educational television for their community and are to be commended\nfor this result of their efforts.\" When Channel *28 comes into service\nin the LA area with its population of some 8 million, ETV will be availa¬\nble in all the major population centers of the nation.\nFCC REPORT FOR SALE\nThe annual report of the FCC for the fiscal year 1963 is now\non sale at the Government Printing Office, Washington, D.C. 20402, for\n50 cents a copy. The 170-page report notes developments since July\n1,1963 in such areas as satellite communication, broadcast, safety and\nspecial radio, monitoring and other field engineering, technical research,\nfrequency allocation and use, and other subjects.\nJCEB-NEA MEETING EMPHASIZES NEED FOR MULTIPLE CHANNEL ETV ASSIGNMENTS\nA conference called by the Joint Council on Educational Broad¬\ncasting and the NAEB met in Washington, D.C., Jan. 27-28 to consider\na National Policy for ETV Channel Assignments. It was the consensus\nof the conference TEat a greater proportion of the limited TV channels\nshould be reserved for education and that multiple assignments to any\ncommunity not be restricted as now proposed in Docket 14229 of the FCC.\nThe conference urged the Sec. of HEW to establish a Citizen's\nCommission augmented by small work-study teams of competent full-time\ntechnical personnel to make an intensive and continuing study to start\nimmediately and to report, if possible, within the time provided by\nthe FCC for Docket No. 14229 comments. This Commission would examine\nsuch topics as the relevancy of UHF-TV to community's educational, social\nand welfare needs, the economics of ETV, and technological questions\npertaining to types of broadcast systems and their relationship to edu¬\ncational technology and the determination of functional broadcast areas.\nA report of the Conference is being prepared at present by the\nNAEB."
}