{
  "id": "d1734-0",
  "text": "N A £ B NEWS LETTER\nNATIONAL ASSOCIATION 01** EDUCATIONAL BROADCASTERS\nNovember I, 1944\nNAEB NAMES NEW OFFICERS\nFrank E. Schooley, Assistant Director of Radio Station W I L L at the\nUniversity of Illinois and for the past few years Executive Secretary\nof the National Association of Educational Broadcasters, was elected\nPRESIDENT OF NAEB FOR THE 1944-45 TERM AT THE ANNUAL MEETING OF THE\nASSOCIATION, HELD MONDAY, OCTOBER 23 AT THE MORRISON HqTEL IN CHICAGO.\nAllen Miller, Director of KOAC, Corvallis, Oregon and former director\nof the University Broadcasting Council in Chicago, was re-elected vice-\npresident.\nW. I. Griffith, Director of WOi at Ames, Iowa, who has long served\nNAEB AS SECRETARY-TREASURER, WAS RE-NAMED TO THAT POST.\nThe NAEB Executive Committee selected: Carl Menzer, WSUI, University\nof Iowa, member-at-large; £. W„ Ziebarth, WLB, University of Minnesota;\nft. J. Coleman, Michigan State College; M. S, Ncvik, Municipal Broad¬\ncasting System, New York City; John W. Dunn, Acting Director of WNAO,\nUniversity of Oklahoma, and Jim Miles, Program Director of W8AA,\nPurdue University.\nIn a special meeting after the close of the convention, A. James Ebel,\nCHIEF ENGINEER OF WILL* WAS NAMED EXECUTIVE SECRETARY TO SUCCEED FRANK\nSchooley.\nTHE NOMINATING COMMITTEE WAS COMPOSED OF THREE PAST PRESIDENTS, H. B,\nMcCarty, WHA, University of Wisconsin, chairman; W, I. Griffith, and\nCarl Menzer. The committee was named by Frank Schooley, selected by\nATTENDING DELEGATES TO SERVE AS CHAIRMAN FOR THE NAEB MEETING AT THE\nOPENING OF THE CONVENTION ON SUNDAY AFTERNOON, OCTOBER 22.\nCONVENT ION WELL ATTENDED\nIn attendanceaat one or more meetings of NAEB were H* 8, McCarty, WHA:\nCarl Menzer, WSUI; J«m Miles, WBAA; Waldo Abbot, University of Michigan\nJim Ebel, WILL} Harry Skornia, Indiana University; Bob Coleman, WKAR:\nE, W. Ztebarth, WLB| Kenneth Christiansen, KUSD; Wallace Garneau,\nWestern Michigan College; W, l0 Griffith, wot; Mrs. Margaret Tyler;\nW0SU; S. Novik, WNYCj Joe Wright, WILL; and Frank Schooley, WILL.\nCONSTITUTION ftEV.I SEP\nProvision for membership in NAEB, as provided in the Constitution, were\nREVISED IN ACCORDANCE WITH PROCEDURE SET UP WITHIN THE CONSTITUTION.\nAction in changing the provisions was taken after careful consideration\nBY ALL IN ATTENDANCE. A COMPLETE, REVISED COPY OF THE CONSTITUTION,\nWILL BE SENT ALL MEMBERS WITH THE DECEMBER I ISSUE OF THE NEWS LETTER.\nArticle I, as now amended reads:"
}