{
  "id": "d1734-3",
  "text": "True, the classroom teachers, the extension workers,\nand the administrators of our universities have failed to realize\ntheir opportunity. They have been slow in awakening to the edu¬\ncational possibilities of broadcasting. But slowness is one\nthing, and surrender is another. And in my judgment, the educa¬\ntors of America cannot properly be charged with surrender of the\nidea of educational broadcasting. They hadn*t yet grasped the\nidea when they gave up their transmitter licenses. They didnft\nrealize what they had, more!s the pity, perhaps! But thereTs\nsomething more encouraging in this than there is in the belief\nthat scores of educational stations failed, that they set out to\ndo something and found it was wrong or impossible. Our conclusion\nmust be this, that many of those stations were licensed for labor¬\natory experiment, not for educational extension, and that they\nhad reached their objective when they stopped.\nBut the demise of so many college and university sta¬\ntions cannot be so easily dismissed. What of the others, where\nthere was awareness of the stations importance and anxiety to\nretain it? Mr. Frost has indicated as the major reasons for\ndiscontinuance: indifferent faculty attitudes and public apathy.\nTo those I would add with considerable more stress than he gave:\npressure from commercial interests seeking facilities, and faulty\nfederal administration of the limited radio resources.\nWe should have learned our lessons about conservation\nby the time we came to dealing with radio frequencies. We should\nhave remembered that America has squandered every single natural\nresource it ever possessed — land, forests, oil, minerals, wild\nlife — everything. But we are an aggressive, optimistic people —\nand we forget so easily. We should have said to the custodians of\nradio frequencies: Drive through the cut-over forest wastelands\nof the Lake States. Visit the barren, eroded farms of the \"dust-\nbowl” . Observe the ruthless waste of coal, natural gas, and oil\nresources. Witness the thin remnant of a once abundant wild life,\nand see the results of the exploitation of our fish and game.\nThen consider whether or not it is wise to leave entirely to the\nbusiness of selling, the control of the public resource of radio.\nWhy the Educational Radio Station? First, because\ndown through the years we have found that the public interest in\nthe handling of any public utility must be safeguarded. Public\ngood and private gain just do not go hand in hand indefinitely.\nWe have a certain amount of conservation of radio re¬\nsources in the small share of facilities held by educational in¬\nstitutions, and we have heard today about the current achievements\nof a few of these stations. I donTt know ho?/ impressive this\naccount is for the average observer, but to me the record of ac¬\ncomplishment in the face of all obstacles is remarkable. These\nstations are making good. Admitting their v/eaknesses — and there"
}