{
  "id": "d1734-4",
  "text": "5\nare plenty of them, I know — these stations still are progressing.\nThey are exploring program sources and fields untouched by,other\nstations. They are devising techniques and training broadcasters.\nThey are building audiences and encouraging critical radio lis¬\ntening. They are seeking to advance public tastes and elevate\nexisting wants, not merely to satisfy them. They occupy a unique\nposition and are performing distinctive services. They should*\nbe protected and expanded, for it appears inevitable that the\ngreatest prospect of improvement in American broadcasting lies\nin the development of radio stations nurtured in educational homes.\nExcept for these relatively few educational stations,\nbroadcasting as conducted in this country is a business. And\nwhile we all cheerfully agree that business brings us an abundance\nof material pleasures and a fuller life, we must agree also that\nthe security and progress of a free people depend not upon bus¬\niness but upon education and enlightenment. Whence comes such\nenlightenment? Surely no one expects unbiased, authentic, con¬\ntinuing, soundly organized, or constructive educational and social\nenlightenment to result out of a business.\nWhere, then, does the trusteeship for social enlighten¬\nment rest? Obviously with the educational system, with the schools,\nthe colleges and universities. As President Herman G. James of\nOhio University said in addressing this Institute two years ago:\n”A calm, dispassionate estimate of the situation would\nshow that with all their real and imaginary shortcomings in these\nopposing directions, educational Institutions constitute the\nonly hope for unbiased, unselfish considerations of public ques¬\ntions. That they are in their very nature more inclined to view\nmatters objectively than either private business, governmental\nadministrations, or crusaders of any type, is not merely theoreti¬\ncally true, it is actually true. Indeed, if we deny that, then\nnot only is education a fata morgana, but all human progress and\neven human salvation are dreams that need not even be pursued\nany longer.\nT,So I am forced to the conclusion that the fundamental\nand sufficient safeguards against the dangers inherent in radio\nto free speech and through it to democracy lie in the safeguarding\nof a decent proportion of the facilities of the air to such educa- r\ntional institutions. Whether all of them are used or not, whether\nthose that are used are used in the most efficient and effective\nway or not, whether the group of listeners is large or small, the\nfundamental consideration Is that these facilities should be defin- t\nitely and lastingly protected against encroachment either by the\npolitical administration that happens to be in power or by the\nspecial interests of those writh or without property. Better a\nsilent hour, or many silent h .-urs, if need be, than a pre-emption\nof facilities that would prevent the shedding of as much light as\npossible by disinterested educational agencies wherever such\nlight becomes available.”\nt/"
}