{
  "id": "d1734-4",
  "text": "November I, 1944\nNA£B NEWS LETTER...PAQE 5.\nIndiana composers* Harry Skornia is in charge*\nCooper, a native of Columbus, Indiana and an alumnus of Indiana University,\nIS A COMPOSER BY AVOCATION AND MANY OF HIS WORKS HAVE BEEN PRESENTED ON\nNATIONAL RADIO NETWORKS* SEVERAL OF HIS COMPOSITIONS WILL BE PLAYED ON\nthe Sunday program on WIRE,\nSTUDEBAKER TESTIFIES BEFORE FCC HEAR IMG\nThe Federal Communications Commission has been asked to prepare for the\nDAY WHEN EDUCATIONAL RADIO PROGRAMS MAY TAKE THE PLACE OF PRESENT HOMEWORK\nMETHODS IN THE NATION8S SCHOOLS.\nUnited States Commissioner of Education, Or, John Studebaker, told the\nGROUP that 28 STATES ARE PLANNING COMPREHENSIVE FREQUENCY MODULATION BROAD¬\nCASTS ALONG THESE LINES — DESIGNED TO REACH INTO EVERY SCHOOL AND HOME\nWITHIN THEIR BORDERS* ThE EDUCATOR ESTIMATED THAT THESE STATES REPRESENT\n51 PER CENT OF THE NAT!ON®S AREA AND 75 PER CENT OF ITS POPULATION*\nIN ADDITION, SAID STUDEBAKER, EDUCATIONAL F~M STATIONS ARE BEING PLANNED\nLOCALLY BY CITY SCHOOL SYSTEMS, COLLEGES AND UNIVERSITIES IN SIX OTHER\nSTATES*\nThe education commissioner urged that 15 F-M channels be set aside after\nTHE WAR FOR EDUCATIONAL PURPOSES* THIS FIGURE WOULD BE THREE TIMES THE\nPRESENT NUMBER* STUDEBAKER ALSO ASKED THAT AT LEAST TWO TELEVISION\nCHANNELS ALSO BE RESERVED FOR SIMILAR EDUCATIONAL PURPOSES*\nTYLER SEES CHANGES IN FUTURE\nA REVOLUTION in EDUCATION UNDER THE IMPACT OF NEW RADIO TECHNIQUES AFTER\nTHE WAR WAS FORECAST BY I* Kg: I TH TyLER OF OHIO STATE UNIVERSITY AND\nPFFSIDENT OF THE ASSOCIATION FOR EDUCATION BY RADIO* TyLER OFFERED HIS\nPREDICTION AT THE CLOSING SESSION OF THE SCHOOL BROADCAST CONFERENCE IN\nChicago on October 24*\nJl.ET'3 NOT root. OURSELVES,\" HE TOLD NEARLY 500 DELEGATES TO THE CONFERENCE-\nIF WE ACHIEVE OUR OBJECTIVE IN DEVELOPING RADIO FULLY IN THE SCHOOLS,\nIT WILL MEAN A REVOLUTION IN EDUCATION.”\nThe ideal cituation, Tyler said, would be a radio in every schoolroom after\nTHE WAR AND A TELEVISION THEATER IN EVERY SCHOOL* To COMPLETE THE PICTURE,\nHE ADDED, THERE MUST BE TEACHERS WHO UNDERSTAND RADIO AND WHO HAVE MASTERED\nITS USE AS AN AID IN EDUCATION. TyLER DECLARED THAT ONLY ONE SCHOOL IN\nFIVE HAS EVEN ONE RADIO TODAY, AND ONLY ONE TEACHER IN 30 UNDERSTANDS THE\nUSE OF RADIO FOR TEACHING*\nThe Ohio educator said he expected that the number of standard A.m.\nBROADCASTING STATIONS IN THIS COUNTRY WOULD BE REDUCED TO ABOUT 100 BY\n1955 — Most of them operating on clear channels. The number of commercial\nF.M. STATIONS, HE SAID, WOULD INCREASE TO ABOUT 3-THOUSAND, AND THE NUMBER\nOF EDUCATIONAL F.M* STATIONS ABOUT 300. ONLY ABOUT 300 TELEVISION TRANS¬\nMITTERS WILL BE IN OPERATION, HE PREDICTED, AND THE PUBLIC GENERALLY WILL\nVIEW TELEVISION ONLY IN THE THEATERS*"
}