{
  "id": "d1512-2",
  "text": "NAEB NEWS LETTER.Page 3..February t| J94-5\nAs A RESULT ALL APPLICATIONS AND ALL CONSTRUCTIONS UNDER V’AY V*l LL BE CRIT¬\nICALLY REVIEV'ED AS TO NEED*\nThe PRACTICAL result of this ORDER WILL BE TO STOP THE »avE OF A.V. APPLIC¬\nATIONS FOR NEW STATIONS. ThiS w|LL GIVE SOME EDUCATIONAL INSTITUTIONS A\nCHANCE TO COLLECT THEIR WITS AND THEIR APPROPRI AT IONS IN ORDER TO IMPROVE\nTHEIR FACILITIES BEFORE ALL AVAILABLE OPENINGS ARE TAKEN IN THE BROAD¬\nCAST BAND.\nSUNDAY BROADCASTS ON IVKAR\nPlans already made for future expansion of broadcasting services at\nMichigan State College contemplate eventual full time operation and the\nUSE OF the new FreouENCY iV'ODULATION TYPE OF TRANSMISSION. MuCH OF THE\nPLAN CANNOT BE ACCOMPLISHED UNTIL AFTER THE WAR WHEN MATERIALS ARE\nAVAILABLE. ThE FIRST STEP IN THE DEVELOPMENT HOWEVER IS TO BE TAKEN\nTHIS MONTH, when WKAR BEGINS SuNOAY OPERATION, EFFECTIVE JANUARY 7 WKAR\nWILL BE ON THE AIR EACH SunOAY FROM I ! 00 TO 6^00 P.'V.. WITH A PROGRAM OF\nEDUCATIONAL FEATURES AND GOOD MUSIC.\nHighlighting the Sunday broadcasts will be a weekly message by Or. John\nA. Hannah, President of Michigan State College, who will be heard at\n6i00 p.M. each week. President Hannah will tell of the many sefvices\nthe College provides for the citi7ens of Michigan and will draw from\nits ninety year history, incidents which have made the College one of\nthe nation’s leading educational institutions.\nFM WORKSHOP AT OHIO STATE\nOne of the first educational FK'-...freouency modulation—station workshops\nTO BE HELD IN THE UnITEO StaTES IS SCHEDULED FOR JUNE 19 TO JULY 27,\nWITH sessions at Oh10 State University and in Cleveland.\nThis workshop, with registration limited to IOO, will offer a curriculum\nDESIGNED TO PREPARE PERSONNEL FOR THE MANY FM EDUCATIONAL RADIO STATIONS\nEXPECTED TO BE IN OPERATION AFTER THE END OF THE WAR.\nWith Or, I.’Keith Tyler, director of radio station at Ohio State, in\nCHARGE, the '\"OPKSHOP IS SPONSORED JOINTLY 3Y THE UNIVERSITY, THE STATE\ndepartment of EDUCATION, THE U.S. OFFICE OF FdUCATION, AND CLEVELAND\nPUBLIC SCHOOLS.\n(See the December 1st issue of the Mews Letter for details of-the WHA\nFM CONCLAVE.)\nRegistration will not be limited to Ohioans, although many persons are\nEXPECTED FROM Oh10 SCHOOL SYSTEMS AND COLLEGES PLANNING TO SET UP FM\nSTATIONS.\nFull-time faculty, according to Or. Tyler, will include six to eight\nPERSONS expert IN THE FREOUENCY MODULATION FIELD, w|TH OTHER SPECIALISTS\nFROM TIME TO TIME REPRESENTING COMMERCIAL RADIO, GOVERNMENT, AND SCHOOL\nSYSTEMS. First five weeks of the course will be at Ohio State, with\nACTIVITIES OF THE SIXTH AND FINAL WEEK AT FM STATION WBOE, OPERATED BY\nTHE Cleveland board or education. Registration fee, not yet definitely\nset will be from $15 to $25, Tyler says."
}