{
  "id": "d1512-5",
  "text": "NAEB NEWS LETTER.6....,.'..February I, 1945\n’ANYC*S UNIQUE SERVICE WAS IMMEDIATE. Art SOCIETIES AND SIMILAR GROUPS HAVE\nCITED WNYC FOR OUTSTANDING MUSIC AND CULTURAL PROGRAMS—THE CoLUMBUS, Oht0\nInstitute for Education by Radio” has yearly RECOGNf?ED its contributions\nTO THE FIELD OF EDUCATION—PUBLICATIONS SUCH AS \"VaRIETy” AND ’‘BILLBOARD**\nHAVE AWARDED THE STATION CITATIONS FOR \"PATRIOTIC LEADERSHIP*' AND \"PUBLIC\nSERVICE. Since 1938, ‘ANYC has received fifteen citations. Today, more\nTHAN TWO DECADES AFTER ITS BIRTH, lANYC CAN BOAST OF THE FINEST MUSIC\nSCHEDULE IN QUALITY AND QUANTITY OF ANY RADIO STATION IN THE COUNTRYo\nThis became more than ever evident when vinyC finally won permission to\nEXTEND its BROADCAST TIME TO lOJOO P.M. EACH EVENING.\nThe past several years have seen a pronounced growth in concert broad¬\ncasting OVER WNYC, The WEEKLY Wednesday and J^riday night broadcasts of\nTHESE VERY StaDIUM ^ONCERTS HAS APPROACHED A TECHNICAL PERFECTION THOUGHT\nIMPOSSIBLE away BACK IN J924. In ADDITION BROADCASTS OF (iuiLLIARD SuMMER\nSchool Concerts by the nation’s foremost artists, the Goldman Band Concerts\nFROM the parks, ANO OTHER SUMMER CONCERTS ARE HIGHLIGHT FEATURES OF V»NYC*S\nWARM-WEATHER SERVICE TO J^EW Yqrk's MUSIC APPRECIATIVE CtTI7ENS. ThEN AGAIN\nTHE YEARLY WNYC AMERICAN MySIC FESTIVALS (FEBRUARY THROUGH 22) HAVE\nACHIEVED A UNIQUE PLACE IN THE HISTORY OF RADIo’s CONTRIBUTION TO THE\nDEVELOPMENT OF AmeRICa's NATIVE FORMS OF MUSICAL EXPRESSION. A NOTED\nCRITIC REPORTED LAST YEAR, “WNYC HAS DONE MORE FOR AMERICAN MySIC IN ONE\nWEEK THAN Nev' YqrK S OTHER RADIO STATIONS ACHIEVE THE YEAR ROUND.\"\nMORTON GoULOf THE OUTSTANDING YOUNG AmeRICAN COMPOSER, HAS STATED, \"I\nSHOULD LIKE TO SEE THIS WNYC FESTIVAL IDEA DEVELOPED IN OTHER STATES ALL\nOVER THE COUNTRY ANO ON A NATIONAL SCALE. I, PERSONALLY, FEEL VERY\nGRATEFUL FOR THE OPPORTUNITIES WNYC^S FESTIVALS HAVE AFFORDED ME AS A\nCOMPOSER,\"\nWith the development of Frequency Modulation broadcasting and the in¬\nauguration OF V'NYC-Fiv/I about TYO YEARS AGO, RADIO CONCERT-GOERS ARE ABLE\nTO LISTEN TO STATIC-FREE BROADCASTS OF LEADING CONCERTS AS THOUGH THEY\nWERE SITTING RIGHT IN THE AUDITORIUM. WNYC«.FiV1 ih ITS VERY FIRST YEAR\nESTABLISHED THE ENVIABLE RECORD OF BROADCASTING MORE \"lTve\" CONCERTS\nTHAN ANY OTHER Nev’ YqRK FM STATION, ThE SE INCLUDED THE INNOVATION OF\nBallet Broadcasts directly from the orchestra pit at the ^’ietropolitan\nOpera House. The popularity of the WNYC-Fm station has been proven by\nTHE ACTUAL MAIL RESPONSE RECEIVED ON THE QUIZ PROGRAM ASSOCIATED WITH\nTHE Ballet broadcasts.\nThe STUDIOS and offices of the City Station occupy a good part of the 24th\nFLOOR of the Municipal Building. The broadcasting facilities include five\nstudios, three large studios for program production ANO TV'O small announ¬\ncing studios. Each of the large studios has its separate control room\nWHILE one of the ANNOUNCING STUDIOS WQRKS OUT OF THE MaSTER CONTROL ANO\nTHE OTHER OUT OF THE CONTROL ROOM FOR ONE OF THE LARGE STUDIOS. AlL OF\nTHESE STUDIOS INCORPORATE THE LATEST ACOUSTICAL DESIGN AND ARE EQUIPPED\nWITH THE BEST TECHNICAL EQUIPMENT AVAILABLE —TAKE IT FROM AN ENGINEER WHO\nVOULD LIKE TO HAVE SOME OF THAT STUFF TO WQRK WITH.\nThe master control board is of the ppe-set type making the switching of\nA NUMBER of PROGRAMS SIMULTANEOUSLY A RATHER SIMPLE MATTER. Th£ ANNOUNCERS\nHANDLE THE TURNTABLES AT WNYC SO THAT THE JOB OF THE CONTROL ’JIEN IS\nGREATLY SIMPLIFIED."
}