{
  "id": "d1512-6",
  "text": "NAE0 NEWS LETTER\nPage 7\nFebruary 1945\nThe i KW Western Electric Fm transmitter is also located in the master\nCONTROL ROOM ALONG Y'lTH ALL OF ITS ASSOCIATED EQUIPMENT. ThIS TRANSMITTER\nOPERATES VERY NICELY AND IN CONNECTION V>l TH THE ANTENNA SYSTEM ON TOP OF\nTHE BUILDING PUTS OUT A BEAUTIFUL SIGNAL. ThERE ARE FOUR RECORDERS IN\nTHE RECORDING ROOM VHICH ARE USED REGULARLY TO^ RECORD PROGRAMS BROADCAST\nON Vi'NYC and FOR RECORDING WKYC OROGRAMS FOR BROADCAST ON OTHER STATIONS.\nAt the Nev' York City Center, the site of Stoko’*ski’s broadcacts and the\nORCHESTFA REHEARSAL BROADCASTS, THERE IS A CONTROL BOOTH V'lTH COMPLETE\nEQUIPMENT IN THE REHEARSAL ROOM ON THE FOURTH FLOOR. From THIS SPOT THERE\nARE MIKE LINES DOY'N TO THE AUDITORIUM WHERE SYMPHONIC CONCERTS ARE BROAD¬\nCAST. All in ALL THE City Station has a very complete technical layout\nABLY OPERATED BY A STAFF OF l5 ENGINEERS.\nI HAD THE PLEASURE OF GOING OVER TO THE C|TY CenTER AND WITNESSING ONE OF\nTHE ORCHESTRA REHEARSAL BROADCASTS. V|rGIL ThOMPSON, MUSIC CRITIC FOR THE\nHerald Tribune, was conducting a rehearsal of his second symphony. The\nSYMPHONY ITSELF WAS oRETTY POOR TO THIS UNTRAINED EAR AND V|RGIL*S CON¬\nDUCTING IS NOTHING TO WRITE HOME ABOUT BUT THE BROADCAST TECHNIQUE WAS\nSUPERB. The OICKUP of the orchestra was well BALANCED AND AT THE SAME\nTIME THE CONDUCTOR COULD BE HEAfD CLEARLY FOR ALL HIS COMMENTS. ThEY\nSAY WHEN THE REGULAR CONDUCTOR, ^-EON BaRZIN, IS IN CHARGE AND THE COMPOSER\nOF THE WORK IS PRESENT TO COMMENT ON THE INTERPRETATION, THE BROADCAST IS\nREALLY OUTSTANDING. Th|« IS^CERTAINLY A PROGRAM IDEA THAT COULD BE USED\nBY A NUMBER OF THE MEMBER NAEB STATIONS.\nThe RECORD library is something TO MAKE A MUSIC LOVER*S MOUTH WATER. ^N\nIT CAN BE FOUND RECORDINGS * NEVER KNEV^ EXISTED BEFORE. ThE FILES OCCUPY\nTHREE V'ALLS OF THE ROOM AND EXTEND ALMOST TO THE CEILING. ThERE ARE A\nNUMBER OF OFFICES W'H I CH ARE ALL Y^ELL APPOINTED AND WELL USED. ThEY WERE\nIN THE MIDST OF A REDECORATION JOB V'HILE I WAS THERE BUT THE UNFINISHED\nPART STILL LOOKED BETTER THAN THE FACILITIES MOST OF US HAVE TO W'ORK WITH.\n'/•HEN IT IS FINISHED l*M SURE THE STATION WILL BE A SIGHT TO BEHOLD.\nI HAD HOPED TO LIST SOME OF*THE OUTSTANDING TALENT THAT REGULARLY APPEARS\nON '/-NYC AND ViJNYC-FM LIVE SHOWS BUT THAT WOULD MERELY BE A LISTING OF ALL\nTHE OUTSTANDING CONCERT ARTISTS AND ORCHESTRAS OF THE DAY. It SEEMS THAT\nWORRIE*S PROBLEM IS NOT SO MUCH ONE OF OBTAINING OUTSTANDING ARTISTS AND\nPROGRAMS BUT RATHER ONE CF SELECTING THE BEST FROM THOSE AVAILABLE.\nThe time was getting late when w’E got around to discussing future plans\nAND A report on THEM WILL HAVE TO COME AT ANOTHER TIME. YqU MAY REST\nASSURED, however, THAT THE C|TY STATION WILL TAKE FULL ADVANTAGE OF ANY\nNEW? DEVELOPMENTS.IN THE FIELD AND WILL CONTINUE TO OFFER AN OUTSTANDING\nSERVICE TO THE PEOPLE OF THE New YoRK AREA.\nAlthough I have put a great deal of emphasis on the */NYC music features,\nTHIS DOES NOT MEAN THAT THE STATION 00£SN*T HAVE A NUMBER OF GOOD NON-\nMUSICAL educational and cultural BROADCASTS. ThE COLLEGES 'AND SCHOOLS\nIN THE AREA REGULARLY FURNISH OUTSTANDING LECTURES AND DISCUSSION PROGRAMS.\nThe Sunday afternoon broadcast of the Mayor is a feature that attracts\nONE OF ^£w York’s largest listening audiences. The music is most out¬\nstanding to me, however, because it represents a type of program which we\nALL wish VE had but FIND IT DIFFICULT TO OBTAIN,"
}