{
  "id": "d1512-8",
  "text": "NAEB NEWS LETTER\nPaGC 9,\nFebruary I, 1945\nMore important is the folloving quotation from the letter, ’‘May I ado\nTHAT IT SEEMS TO ME THAT EVENTUALLY W8AA V»'{LL HAVE TO EMPLOY PERHAPS TVO\nFULL TIME MEN TO DO NOTHING BUT CANVASS THE STATE AND EXPLAIN OUR PROGRAMS\nAND DETERMINE HOY' THEY ARE BEING USED.’\nThe spring term schedule for the University of the Air has some very\nINTERESTING PROGRAMS LISTED. SenD YOUR REQUEST TO JfM MilES AT ’ABAA |f\nYOU ARE INTERESTED IN THE PROGRAM IDEAS CONTAINED IN THIS BULLETIN.\nTHIS AND THAT\nSo SORRY TO HAVE MISSED CaRL Iv*:EN7ER WHEN HE CAME TO OUR FAIR CITY TO BROAD¬\nCAST A BASKETBALL CONTEST BETY-EEN HIS HaY'KEYES AND OUR FAIR IlLINI. THE\nSCORE—Illinois 43-Ioy'a 42, heart failures 10, sore throats 6,273. Sooooo\nSORRY Carl. (It®ll be murder y-hen I go out to my Alma Mater in March and\nBE Carl*s guest)....The IR£ convention in New York was the biggest ever,\nOVER 2000 ATTEND I NG .... Ran INTO AndY HamMERSHM I OT , FORMER ’AOSU Ch I E F\nEngineer. He is doing a great job NBC in the developmental section....\nW. L. EvERITT, NEV* PREXY fop the ire did a swell job of keeping the extra\nFM discussion session under control Saturday afternoon. He is to be the\nNEW HEAD OF THE EE DEPARTMENT AT ILLINOIS AFTER THE WAR. Oh10 *S LOSS\nIS OUR GAIN.\nNoVIK*S SECRETARY, WlSS DaVIES, HAS THE NICEST VOICE ON THE TELEPHONE l*VE\nEVER HEARD AND INCIDENTALLY SHE DOES A GREAT JOS FOR MoRRIE; PRACTICALLY\nRUNS THE STATION AT TIMES....SprAKING OF SECRETARIES, I THINK ORCHIDS FOR\nOL'R Miss Johnson are over due. Outside of her regular duties which are\nMANY, she HAS TO TAKE CARE OF ALL THE OUTSIDE RACKETS ScHOOLEY AND FbEL\nGET THEMSELVES INVOLVED WITH. Be|nG PRACTICALLY THE ONLY LITERATE MEMBER\nOF OUR STAFF, THE BIG JOB OF CORRECTING THE GIBBERISH TURNED OUT BY YE\nEDITOR FALLS ON HER NOT TOO BROAD SHOULDERS. My TYPEWRITER SPELL3lIKE\nA SECOND GRADER AND I HAVEN'T FOUND ANY PUNCTUATION MARKS ON IT YET..\nThere are signs of new activity in Kentucky. Hope ^lmer will favor us\nWITH some of his post-war PLANS....•F YOU DON *T GET THE BBC SCHEDULES\nregularly better write for THEM AT 620 Fifth Avenue., New Yqrk 20....\nNote the KOAC School of the Air Bulletin which is enclosed. Looks good\nTO THIS department....BrOADCASTING IS CELEBRATING ITS 25TH ANNIVERSARY.\nThere is some doubt about v'HO dun it fust but there is no question about\nTHE FACT THAT WHA vaS THE FIRST EDUCATIONAL STATION FOLLO’^'ED BY 'A'LB AND\nWILL IN THAT ORDER. INCIDENTALLY, WHA is IN THE RUNNING FOR THE FUSTEST\nPRIZE WITH KOKA, WWJ and OTHERS.\nHad a NICE LETTER FROM 0|CK HuLL OF 'AO | GIVING THE WHOLE STORY OF THEIR\nBATTLE FOR EARLY MORNING OPERATION. It IS NOT A CLOSED ISSUE YET SO WE\nMAY BE HEARING FROM THAT DIRECTION IN THE FUTURE.... L | T>IE R 1 GET SOME\nSQUIBS FROM OKLAHOMA FOR THE Ne'aS LeTTER OR I’lL TELL THE ENTIRE MEMBER¬\nSHIP OF NAEB WHAT I KNOW ABOUT NaT £rwIN, FORMERLY ONE OF MY COHORTS AND\nNOW AT WNAD. It’s blackmail Nat and you don't have the medium to tell\nTHEM WHAT YOU KNOW ABOUT ME....I*M GOING TO TURN MY SCOUTS LOOSE ON SOME\nOF THE REST OF YOU IF YOU DON *T CRASH THROUGH TOO....HaD A NICE TALK\nWITH Waldo Abbot and Dave Owen whilst up at Ann Arbqr for basketball\nBROADCAST. They are all agog with plans for the new FM station. \\ hope\nTHE ALLOCATIONS OOn't MESS THINGS UP TOO MUCH."
}