{
  "id": "d1591-21",
  "text": "NABB Nows Letter...«Sept» 15, 1939 Page 22\nRawlins, R« E«, Jr\nSadenwater, Harry\nSands, Mary A.\nSchooley, Frank E.\nSeaman, Mildred X.\nSaner, William Ho\nStarrak, J. 0*.\nStewart, W. Ec\nWaller, Judith C.\nWhite, Mo Ra\nWoolfries, A.\nWright, Joe\nAMONG THE MISSING\nUniversity of So Dakota KXJSD, Vermillion, Do Dakota\nRCA Mfgo Co\nCamden, New Jersey\nUniversity of Wisconsin WHA, Madison, Wisconsin\nWILL, Urbana, Illinois\nKFKU, Lawrence, Kansas\nWSUIg Iowa City, Iowa\nWOI, Ames, Iowa\nW0I, Ames, Iowa\nNational Broadcasting Co.Chicago, Illinois\nWashington State College KWSC, Pullman, Washington\nIowa State College Ames, Iowa\nUniversity of Illinois WILL, Urbane, Illinois\nUniversity of Illinois\nUniversity of Kansas\nUniversity of Iowa\nIowa State College\nIowa State College\n.Absent were faces of those usually seen in attendance and of those; who\nwere all set to attend, but,. Elmer Sulzer, University of Kentucky,\nfpund himself too busy at the sessions and has expressed his regrets\nat his inability to answer roll call, early or late. Garland Powell,\nDirector of WRUF, found a job on his hands.when the Governor of\nFlorida vetoed the radio station budget and instructed the State\nBoard of Control to leas© the station* Luke L« Roberts, KOAG, had\nplanned on being present, but found at the last minute funds would\nnot be available for the trip. Similar circumstances prevented\nHomer Heck and Henderson Leake, WNAD, from making their appearance.\nM. Co Jenson, WCAL, ha© a battle with hay fever « and lost. Gilbert\nWilliams8 WBAA, wasn’t back from his vacation. Waldo Abbot was \"lost”\nin the nbrthlands.\nFLY ASSUMES DUTIES WITH FCC\nJames Lawrence Fly, new FCC chairman, assumed his duties in the early *\npart of the month. Fly was born at Seagoville, Dallas County, Texasa\nFebruary 22, 1898. He Graduated from Dallas fTexas) High School in '\n1916, and entered the United States Naval Academy, Annapolis, Maryland,\nthe next year (1917). He received his commission as ensign in 1920\nand remained in the Navy until 1923 when he resigned.. Entered Harvard\nLaw School in 1923; received L.D.B. degree in 1926.\nMr. Fiy*s first legal training was received from the law firm of\nBurllngham, Feeder, Hasten and Fearey, Hew York City, whore he served\nas a law clerk while attending Harvard Law School (1925). He was\nadmitted to the Massachusetts and Hew York State Bars In 1926, and\npracticed with the fins, of White and Gas©, Hew York City, until 1929."
}