{
  "id": "d1434-24",
  "text": "religious strife. If this station is simply deleting controversial state¬\nments that would stir up the feelings of somebody who belonged to an¬\nother faith, I think the station is to be commended.\nMr. Wakely:\nThat is not the case in our particular situation. We are supported\nfinancially by Jewish organizations as well as the Protestant Councils\nof three cities, Albany, Troy, and Schenectady. We are interested\nonly in doing the kind of a job that the National Conference of Chris¬\ntians and Jews is doing. We are trying to promote good will be¬\ntween religious groups.\nChairman Tyler:\nI think we are getting into the area of the station’s responsibility.\nLegally the station is responsible for everything that is broadcast. It\nhas to exercise editorial discretion. The question is how far it should\ngo. I don’t know if there is any definite answer.\nMr. Sig Mickelson:16\nI wish to say a few words about this question of editorializing on the\nair. Personally, I am strongly in favor of taking a vigorous stand on\nmatters of public interest. I think we have done so at our station. Many\nstations are doing so. Generally speaking, however, I do not believe we\nare ready. We do not have the qualified researchers to go into these\nquestions and produce the facts on which to base our positions.\nWhen editorializing on the air comes, it should not be a case of the\nmanager exercising his personal opinions, as publishers of some news¬\npapers have done.\nChairman Tyler:\nThat seems to be a good note on which to close. I will attempt\nbriefly to summarize. We have clarified the fact that there is in this\ngroup no difference of opinion on the matter of presenting vigorously\nmatters of public interest which are not particularly controversial. On\nthe other hand, we have had the extreme proposal that “radio stations\nshould be as free as the newspapers.” In between we have the twilight\nzone of matters of partisanship. Here we found some difference of\nopinion, both among the audience and in this panel, as to just how far\nradio might go.\n18 Station WCCO, Minneapolis."
}