{
  "id": "d1730-0",
  "text": "WASHINGTON REPORT\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVol. IV, No. Ill DuPont Circle Building, Washington 6, D.C. February 8, 1963\nFEDERAL ETV LEGISLATION SITUATION\nCongressional law-making, it is well to remember, is a two-phase procedure:\n(l) the enactment of enabling legislation, and (2) appropriation of funds to carry¬\nout the provisions of the legislation.\nThe 87th Congress passed an act providing for Federal grants of $32 million\nto the states on a matching basis for construction or improvement of ETV facilities.\nThe 88th Congress will be asked to appropriate funds to implement the act.\nHere is what has been requested:\n$2 million (for balance of fiscal 1963) to provide for approximately 9 new\nstation grants and 3 expansion grants.\n$7 million (for fiscal 1964) to provide for approximately 30 new station\ngrants and 18 expansion grants.\nSince needs cannot be accurately predicted until applications have been\nreceived and accepted, the ratio of grants for new stations to those for expanding\nexisting facilities may be altered.\nThe request for ETV appropriations must be presented to 4 separate committees:\nthe 1983 request to the Subcommittee on Deficiencies and Supplemental: of the House\n(Chm. Albert Thomas, D.) and the Senate (Chm. Spessard Holland, D., Fla.) and the\nSubcommittee on Labor, Health Education and Welfare: of the House (Chm. John Fogarty,\nD., R.I.) and the Senate (Chm. Lister Hill, D., Ala.). Frank Bow (R., Ohio), who\nfeels that UHF 2,000 me developments obviate the need for standard broadcast\nstations and, therefore. Federal ETV assistance, is still a member of the House\ncommittee on supplemental appropriations.\nHEW officials will probably be called in to hearings of these committees\nbeginning in mid-February. If funds are forthcoming, it is expected the program\nmight get under way in early March. NAEB estimates that about $20 million is now\navailable in state appropriations ready for matching as soon as the Federal grants\ncan be applied for.\nMARKS* 1 COMMITTEE MOVES TO REVAMP COMMUNICATIONS ACT\nA special Committee of the Federal Communications Bar Association, headed\nby Leonard Marks, NAEB General Counsel, last week released a report calling for\nsweeping revisions in the concept and practice of Federal regulation of broadcasting\nand replacing the FCC with a new agency composed of an administrator, court, and\nfive-member policy-making body. Stated objectives new set-up is designed to accomplish:\n(l) speedier processing of cases; (2) more orderly planning for long-range uses\nof broadcasting; (3) better system of establishing criteria in issuing station grants,\nand (4) surer protection against political influence upon outcome of contested cases.\nThe Marks' Committee report, which calls for a thorough overhaul of both\nthe FCC and the Communications Act under which it operates, will be given serious\nstudy by the Congress as well as the Commission and the Industiy."
}