{
  "id": "d1730-1",
  "text": "INSTRUCTIONAL BROADCASTING GROUP MEETS\nOn January 28th, 9 NAEB people involved in the instructional uses of TV at\nvarious levels met in Washington to discuss (l) how this particular group within the\nmembership might best be organized and given appropriate representation inside\nthe NAEB structure and (2) whether it would be useful for NAEB to sponsor a national\nconference on Instructional Broadcasting (radio, as well as TV) this Spring.\nThe participants, who came at their own expense in response to Pres. Harley's\ninvitation, endorsed the general approach of an NAEB reorganization based upon\ncouncils representing special interest categories within the membership and recommended\nthat NAEB go ahead with plans to hold the conference. The week of May 13 was chosen\nas the date and the group agreed to serve as a steering committee for the conference.\nThose attending were: Leslie P. Greenhill, Penn State; Roy J. Johnson, University\nof Miami; Robert F. Lesher, Hagerstown; Charles J. McIntyre, University of Illinois;\nDr. Bart Griffith, University of Missouri; Lt. Colonel Robert E. Wood, Air University,\nMaxwell AFB; Dr. Stephen C. Hathaway, Miami of Ohio; Iynn Kalmback, ETV Center,\nSouth Carolina; and William Ewing, Ohio State University.\nBROADCAST ACTION OF FCC\nBy Memorandum Opinion and Order, the Commission designated for hearing\napplications of Central Wisconsin Television, Inc., for additional time to construct\nTV station WCWT (Channel 9), Whusau, Wis., and for assignment of CP to Midcontinent\nB/cg Co. for $34,439. On its own motion the Commission made the Wisconsin Citizens'\nCommittee for Educational Television, Inc., which filed opposing petitions, and\nWisconsin Valley Television Corp. (WSAU-TV, Channel 7, Wausau), parties to the\nproceeding. The hearing issues will determine (l) whether Central Wisconsin has\nbeen diligent in proceeding with construction of the station, whether trafficking\nis involved, and whether it has been candid in its representations to the Commission;\n(2) when and under what circumstances the Citizens' Committee learned of the proposed\nsale of WCWT, sought to acquire its construction permit, from whom it obtained the\nnecessary funds, and the amount obtained and terms and conditions thereof; and (3)\nfull facts surrounding Wisconsin Valley agreement to donate funds to the Citizens'\nCommittee, whether latter had an agreement or understanding with Wisconsin Valley\nto file the instant petitions, and whether Wisconsin Valley has engaged in a course\nof action which constitutes an abuse of Commission's processes.\n(The Citizens' Committee's original intention was to acquire the CP held\nby Central Wisconsin TV Inc. and turn it over to the University of Wisconsin for\nETV.)\nThe initial hearing is scheduled for March 4th.\nNAEB-USOE CONTRACT\nThe USOE announced this week a grant to the NAEB for \"a pilot series of\nsix kits of filmed and published materials illustrating proper teacher utilization\nof broadcast materials.\"\nThe project involves the preparation of six demonstration kits for use by\nschool and college administrators, teachers and potential teachers and are designed\nto illustrate, on film and in published materials, teacher utilization of broadcast\nmaterials in the achievement of sound educational purposes and goals. In general,\neach kit will consist of a 30 minute l6mm sound film and the necessary supplementary\nmaterials and directions to facilitate its use. Some kits will contain printed\nmaterials which may be retained by the users.\nThe project director is Clair Tettemer, Director of School Programs and\nResearch, KTCA-TV, St. Paul/Minneapolis."
}