{
  "id": "d1453-1",
  "text": "NA£8 N£»S Lema.,\n..oAprsl I> 1944\noI!rpRorLI°'’pr!.!:IfJ^“ SECOND Annual Science\nWay Program, Penicillin, the Wonder Orus: Senetics, Training fob the\nFuture; Bird 1 dent i pi oat ion Contest; WhaI Chemistry can oi porfowA*\nSoLam'\"'\"® 'S^A S^ie^ce Day Recognition\nTHESE PROGRAMS ON W N V p;\nm^crophones^w^Nl NrQF^°'^'^ 3;30 P.M. during the month op *pril, wnyC's\n^ Brooklyn Museum to broadcast a special\nDiSTiNGmsNEn°rN^f«Tr'^‘'^“ ignited Nations,\" Featuring\nserIeT^ LI NTMt^rJ\"' respective pields op music, the\nE%%”:lfT';TSHE'M;iE^:r THl'slRrL'^°\"\"^\"'°\" .NSTRUMENTS on\nRunning now por over 16 weeks, \"New Yorkers All-Heroes All\", presented\nweekly over New York City's Own Station WNYC has now built up a good-sited\nlistening audience. \"New Yorkers All-Heroes All\" is written, prooucIo\npprcr*T^^^^° Mitchell Jablons, WNYC«3 Publicity and News Editorc ^\nPresented every Monday evening at 8jI5 p.Mo, \"New Yorkers All\" Is a\nSew York's ?Yo.ptrrr“ \"\"\" outstanding exploits op some op\nTMcuIrri*.-! AVERAGE SONS AND DAUGHTERS WHO HAVE DISTINGUISHED\nOECrRAT^^rACCO^SrNLJr^\"\n«*CHMANINOPP. ONE OP THE POREMOST\nON MARCH 28TH AT 6.00 P.M. WNYC PRESENTED A SPECIAL MEMORIAL PROGRAM OF\nRachmaninoff'S works performed by Sidney Sukoenig, pworam of\nUoLA Hayes, regular metpo-soprano recitalist on WNYC's Friday Evening\nOF Langston H^GHE^r\n\"THrOEATM^np'*L’’ofn'<?®^’^ MUSIC. Included were Cohen's setting for\nwLe ^ B AN Old Seaman\", Still's \"Birth of a Rose\", \"The Negro\n®ONDS, AND the INCREASINGLY POPULAR \"SoNGS TO A\nWARK V IRQjR gy “RICEo\nCork's Municipal Station presented the first in a new series op\n(a?nn*R-Tn^o'‘'.''? ^‘-''nninq The Post-War World\" on Tuesday. March 21st\nif,’, SERIES, PRESENTED IN COOPERATION WITH QuEENS COLLEGE\nWILL HEREAFTER BE HEARD WEEKLY ON TUESDAY EVENINGS AT 8!00 P.M. TAKING\nTHE FORM OP FREE AND SPONTANEOUS FORUM DISCUSSIONS, EACH BROADCAST WILL\nDEAL WITH A CERTAIN TOPIC OF POST-WAR ECONOMIC OR POLITICAL INTEREST, AND\nWILL BE HEADED BY A MEMBER OF THE QuEENS COLLEGE FACULTY WHO 18 AN AUTHORITY\nON that particular FIELOo\njoining the Army, \"Art in New York\", the City Station\nJi C S SPECIAL ART NEWS AND INTERVIEW PROGRAM 18 BEING TAKEN OVER BY\n^ UAWYER-TURNEO-ARTI STo HeaRO EACH WEDNESDAY AFTERNOON\nAT 3*30 PoMo Art in New York features interesting discussions on the\nNEW TRENDS OF ART» AND INTERVIEWS WITH THE T0WN*3 LEADING ARTISTS AND\nART CRITICS,\nNew York City*s Own Radio Station - WNYC, cooperates with the New York\nc-ity Board of Education to present a new daily series of programs to be\nHEARD Monday through Friday at 1s46 p«Mo These programs, written,"
}