{
  "id": "d1453-3",
  "text": "HA£B NEWS LETTER.... . . P^qe 4. Z. ,.\nCHICAGO SCHOOLS ADD «PA» SERVICE\nApril 1,1944\nThe director of the Chicago Public School Radio Council on March S9\nANNOUNCED THAT EARLY NEXT MONTH THE DAILY BROADCASTING OF NEWS WILL BEGIN\nIN THE city's PUBLIC SCHOOLSo The -^CHOOL RaOIO COUNCIL AcTING D| RECTORj\nGeorge Jennings, said the broadcasts will use the regular radio news\nSERVICE OF Press Association, radio branch* of the Associated PresSo\nJennings said the Board of Education has approved a contract with Press\nAssociation for installation and maintenance of the servicEc The broad¬\ncasts WILL be made over THE BqaRD'S OWN FREQUENCY MODULATION STATIONo\nJennings added that the Chicago schools will be the first in the country\nTO have such service.\nThe new school service will be directed to elementary pupils. Regular\nNEWS REPORTS WILL BE EDITED AND REWRITTEN AND NEWS STORIES WILL SERVE\nAS BASES FOR LESSONS IN GEOGRAPHY, HfSTORY, C|VICS AND OTHER SUBJECTS.\nixits and dashes\nWHA News Letter reveals that Harold Lngel is now stationed temporarily\nAT Madison; that Margot Baer Morris js now employed by WO'AS at Champaign,\nIllinois..Max Krone mentioned above is an Illinois graduate, class of\n1923...,What topics shall we arrange to discuss at our Columbus meeting'I’\n....Suggested are these twoJ Keith Tyler on Radio co-ordination at Ohio\nState University. And, representation of NAEB on the Radio Technical\nPlanning Board....The Junior Town Meeting League is planning a meeting\nat the time of the Ohio Institute,...Don't overlook the contents of the\nNAEB Packet with this News Letter,,..A Radio Committee is now investigating\npossibilities for Columbia University to engage more in educational broad¬\ncasting, . ..KWSC, Washington State College, was given permission to deter¬\nmine operating power by direct measurement of antenna power by the rcc ON\nMarch tO..,.W9XUI, University of Iowa, was granted renewal of its\ntelevision license to February 1, 1945, by the FCC on March 22....Western\nMichigan's application for a CP for FM station was received by FCC and\nreturned to applicant on March 17..,.The FM apc^lication of the Evanstonj\nIllinois, Board of Education was received and returned by the FCC on\nMarch 20.,,.The FM application of Central Michigan College of Education\nWAS received and returned by the FCC ON March 22...,kuS0, University of\nSouth Dakota, has recently added PA (AP) news to its listener service.\n—-SCHOOLEY"
}