{
  "id": "d829-24",
  "text": "Illustrative example\nWMVS-Milwaukee: The Department of Education of the Catholic\nArchdiocese, directed by Uonsignor Edward Goebel, uses the\nstation for in-school programming on the same basis the public\nschools do. They request time and it is allotted to them. For\nthis they pay the same \"cost-sharing\" rate as the public\nschools - $110 per half hour.\nAt the present time they broadcast one hour a week, and\nthey hope to expand their offerings next year. This was one\nreason they wanted the UHF channel (second); the public schools\nand the Catholic schools both have need for the same broadcast\ntimes, and the new station will permit this.\nAlso9 next year, the Catholic schools will make use of the\nscience program and the music program broadcast by and for the\npublic schools.\nMarquette University has done some general programming on\nWMVS, but no direct instruction, although they have been\noffered the opportunity. The Lutheran schools in Milwaukee\nhave also been offered the same as the Catholic schools but\nhave not used any time as yet.\nWBBH- Boston: In-school programming is done through\nthe Massachusetts Executive Committee for Educational TV,\nwhich produces \"2f-Inch Classroom”. Schools cooperating\npay into a state fund held in escrow for the Committee, and\nthe state agency contracts for the programs. Programs are\nplanned by the Committee.\nThe Archdiocese of Boston utilizes 14 different program\nseries (in-school) during the current school year. Programs\nare also used by the Dioceses of Fall River, Mass., and\nWorchester, Mass.\nThe parochial schools make consistently higher use of\nin-school TV programs in the *GBH area than do the public\nschools. Msgr. O’Leary is on the Massachusetts Executive\nCommittee referred to above.\nLutheran schools in Rhode Island also make use of the\nWGBH programs. Representatives from the Archdiocese also\nserve on the advisory committees a programs are being planned.\nEight non-tax supported institutions of higher learning\nare amon& the 12 organizations making up the Lowell Institute\nCooperative Broadcasting Council - the organization operating\nWGBH. These eight are: Harvard, MIT, Boston University\n(Methodist), Boston College (Jesuit), Tufts, Brandeis (Jewish^,\nAmerican Conservatory of Music, and Northeastern University.\nThese institutions assist in the production of programming\nfor the station - both general and programs for college-level"
}