{
  "id": "d829-30",
  "text": "88 HOT REMOVE\nmm HJSAIX5UARTBRS\n1348 Connecticut Avenue,, MeW\nWashington 6, D,CB\nTos NASB Actives and Associates\nFrom3 William G. Harley\nRes Amendment to H»R» 132 affecting community KTV corporations\nDates March 13, 1962\nAs I*ra sure you are aware, the House, in passing HoR. 132 providing\nfor Federal assistance to ETV, at the same time passed an amendment\nexcluding tine nonprofit community BTV organizations from the bene¬\nfits of this legislation* The amendment, which was introduced by\nRep. Griffin (R.-Mich.), was introduced apparently because of his\napprehension that the benefits of this legislation might be made\navailable to persons or groups who were not properly qualified as\neducationalo He said that the wording of the definition was so\nbroad that chambers of commerce or labor organizations might be\neligible for aid®\nIt appears to be the determination of the leadership on both sides\nof Congress to see to it that this is removed in the Conference to\nproduce the compromise between the Senate and House versions of the\nlegislation® However, it would appear to be pertinent to see to it\nthat the Conference Committee is fully aware of the views of the\neducational community about this amendment and that in addition the\nmembers of the House of Representatives, where the amendment was in¬\nserted, are fully apprised of the attitude of their constituencies\nregarding this amendment*\nThe various professional organizations, HEW, and the FCC will convey\ntheir concerns about this matter in communications to the chairmen\nof the two Committees on Interstate and Foreign Commerce* Some ex¬\npressions of interest from the community stations, community station\nlicensees, and those with CP*s would certainly be in order—both to\nMr* Harris and Mr. Magnuson and to the representatives from those\nareas in Congress. If a member of the Conference Committee represents\nan area served by such a station, a letter to him would also be\nappropriate*"
}