{
  "id": "d829-41",
  "text": "-2-\nSenate conferees have not yet been appointed) but they will be headed by\nSenator Magnuson, chairman of the Senate Commerce Committee.\nCouncil Statement At the request of Representative Frank Thompson, Jr.\nIssued on Bill for (D.-N.J.) chairman of the Select Subcommittee on Educa-\nEducational Quality tion of the House Committee on Education and Labor,\nPresident Logan Wilson of the Council has submitted a\nstatement concerning the Administration’s proposed legislation to improve educational\nquality (See this Bulletin, Vol. XI, Nos. 6 and 7)- Subcommittee hearings were\nscheduled on March 1 to 7, and the Council's statement was submitted for the record\non March 6. The Association of State Colleges and Universities, composed of 158\npublic institutions of higher education, requested that its concurrence in the views\nexpressed be made known to the subcommittee.\nThe statement follows:\nThe American Council on Education is a council of national educational associa¬\ntions and organizations and of approved institutions of higher education including\nuniversities, colleges, and junior colleges. Its present membership includes 145\nnational and regional educational associations and more than 1,000 educational\ninstitutions. Its scope of concern with Federal legislation is stated as follows\nin the words of the Council's Board of Directors:\n\"The legislative concern of the Commission on Federal Relations\nof the American Council on Education is primarily with Federal\nlegislation that affects colleges and universities. The Commission\nrecognizes, however, the need to strengthen education at all levels--\nelementary, secondary, and higher--and believes that the Federal\nGovernment must assume significant responsibility for assisting\nin this strengthening through legislation appropriate to the needs\nof each level of education.\"\nWhile HR 10145, the proposed \"Improvement of Educational Quality Act of 1962,\"\nis concerned with instruction in schools below college level, institutions of\nhigher education are necessarily extensively involved. In Title I of the bill\ninstitutions of higher education would be involved in three ways:\n1. In the operation of institutes for advanced study by elementary and second¬\nary school teachers and supervisors in those subject matter areas where there is\nneed for improved quality of instruction.\n2. In accepting teachers awarded scholarships for a year's full-time study.\n3. In designing and carrying out projects to improve the quality of an insti¬\ntution's own program of teacher education.\nHR 10145 has not been reviewed by the Council's Commission on Federal Relations\nand it is not possible for us, therefore, at this time to endorse the Administra¬\ntion's proposals as such. It is clear, however, that the proposals are directed\ntoward the repair of serious deficiencies in our educational system and that the\nproposal is worthy of the most serious consideration by the Congress.\nThose provisions of HR 10145 that would affect the relationship of higher\neducational institutions to the Federal Government appear to be consistent with\nthe policies governing such relationships advocated by the Council's Commission\non Federal Relations. As presently drawn, HR 10145 would enable colleges and\nuniversities to render effective assistance in developing better programs for the\ntraining of school teachers, leading to an improvement of the quality of"
}