{
  "id": "d829-42",
  "text": "and NATIONAL AFFAIRS\n-3-\ninstruction in our elementary and secondary schools. The Council has every reason\nto believe 'that its member colleges and universities would cooperate to the fullest\nextent possible with the Office of Education in helping carry out the provisions of\nTitle I of HR 10145 and the expanded program of cooperative research proposed in\nsection 202.\nAdvance Indirect The Subcommittee on Executive and Legislative Reorganiza-\nCost Determination tion of the House Government Operations Committee on\nClears First Hurdle March 8 voted unanimously to report to the parent com¬\nmittee HR 6984 which would make a technical change in\nthe method of contracting between the Federal Government and universities.\nIntroduced by Representative Julia B. Hansen (D-Wash.) the bill would permit\nFederal agencies to include a predetermined indirect cost rate in contracts for\nresearch carried out by educational institutions. The chairman of the Subcommittee,\nRepresentative William L. Dawson (D-Ill.), is also chairman of the full Committee\non Government Operations. The bill is regarded as noncontroversial; favorable\naction by the full committee is expected.\nTestimony in support of HR 6984 was presented by Dr. Clarence Scheps, vice\npresident and comptroller, Tulane University, who represented the American Council\nin hearings before the subcommittee. Dr. Scheps pointed out: \"This bill permits\nthe Government and the institutions to agree on a predetermined indirect cost rate\nat the time of entering into a research contract. At the present time, indirect\ncost rates are provisional and are subject to amendment at the end of a fiscal\nperiod after the Government audit is performed.\"\nDr. Scheps said, \"It is believed that the elimination of the provisional rate\narrangement will be of mutual advantage and benefit to both the universities and the\nFederal Government. From the universities' point of view, predetermined indirect\ncost rates will permit the planning of budget operations on the basis of firm con¬\ntracts and will eliminate the necessity,, on occasion, of having to obtain additional\nfunds from the Government when upward adjustments in overhead rates are authorized\nas a result of the Government audit. Conversely, when the audited rate proves to be\nlower than the provisional rate, the universities must attempt to find funds in their\nbudgets in order to make appropriate refunds to the Government.\n\"From the Government's point of view, the authorization of the predetermined\nrate will permit contracting officers to negotiate with institutions for a period\nin excess of a year, if this is mutually desirable. Moreover, in instances where\nthe audited rate is higher than the provisional rate, Federal agencies have had\ndifficulties in providing the additional funds required in order to fully reimburse\nthe institutions in accordance with contract terms.\"\nA companion bill, S 1586, introduced by Senator Henry Jackson (D-Wash.) is\npending in the Senate Committee on Government Operations.\nHouse Committee The House Committee on Interstate and Foreign Commerce\nApproves Health on March 8 voted out HR 4999* the Health Professions\nProfessions Bills Educational Assistance Act sponsored by Representa¬\ntive Oren Harris (D-Ark.) and supported by the\nAmerican Council on Education. The bill will be formally reported to the House at\na later date, after which it must be scheduled for floor action.\nCommittee Substitutes Loans for Scholarships—The committee amended the bill by\nchanging the proposed scholarship program for students of medicine, dentistry, and\nosteopathy to a loan program administered by the institutions. Other than this\nchange, the bill's provisions are substantially those recommended by the Kennedy"
}