{
  "id": "d829-91",
  "text": "The conferees adopted this language in the light of the\nfollowing representation made by the Federal Communications\nCommission in its memorandum relating to the provisions of the\nSenate-passed bill and the House amendment thereto:\nIn this connection, you are advised that under the\nCommission’s rules and policies, qualified\napplicants for the reserved noncommercial educational\nstations have been limited to the following:\n(a) One or more duly accredited public or private\neducational institutions, organizations, or bodies;\n(b) A municipality or other political subdivision\nwhich has no independently constituted educational\norganization;\n(c) One or more tax-supported cultural organizations\n(e.g., public libraries); and\n(d) An association of nonprofit community\norganizations chartered by a State to engage in\nnoncommercial educational broadcasting. Such groups\nhave been broadly representative of the educational,\ncultural, and civic groups in the community and have\nincluded public or private educational organizations\nor representatives.\nThus, a single nonprofit organization, unless it\nwere an accredited educational organization or a tax-\nsupported cultural organization, would not be\nconsidered eligible to receive a license for a\nnoncommercial educational television reservation.\nINTERCONNECTING APPARATUS.— The conference agreement limits\nto 15 percent of any grant, the amount that the recipient may\nutilize for the acquisition and installation of microwave\nequipment, boosters, translators, and repeaters which are to be\nused to connect two or more broadcasting stations. The purpose\nof this change is to assure that most of the available funds\nwill be used for putting new educational television broadcasting\nstations on the air. Expenditures made to interconnect stations\nwith each other should be incidental to this primary purpose.\nCOMMONWEALTH OF PUERTO RICO.-- The conference agreement\nadopts the provisions of the House amendment making the\nCommonwealth of Puerto Rico eligible to participate in the\neducational television construction grant program.\nOREN HARRIS,\nKENNETH A. ROBERTS,\nMORGAN M. MOULDER,\nJOHN E. MOSS,\nW. L. SPRINGER,\nJ. ARTHUR YOUNGER,\nPAUL F. SCHENCK,\nMANAGERS ON THE PART OF THE HOUSE.\n-11-"
}