{
  "id": "d1486-4",
  "text": "NaEB NEWS LETTER ... May 15, 1941 .. Page 5\npresentation of a broadcast service to the public through programs\nof devotional, cultural, and entertaining natures,, as its slogan\nsuggests, KWLC is literally the “Radio Voice of Luther College”—*\nand all the broadcasts endeavor to promote the Kingdom of Christ\nthrough Christian education.\nThe broadcasts that go out from KWLC are representative of nearly\nall the departments at Luther College. Included are presentations\nof religion, music, drama and speech, news, current developments\nin science and art, literature, history, library activity, public\nand community affairs, athletics, and other touches of campus life.\nAlthough the plans are not complete in detail; construction will\nbegin soon for larger quarters in the tower of C. K. 1'raus Gym¬\nnasium, where Studio A is new located. On the third floor of the\ntower will be housed the transmitter, control rooms with a view\ninto the studio and auditorium, together with office space. At\npresent the activity is coordinated between the transmitter and\noffices in Larsen Hall and Studio a. Regular broadcast emanate\nas well from other points on the campus, such as Music Hall,\nAuditorium stage, and Main Building Chapel,\nIt is expected that the compactness and unity of the planned\nset-up will make for greater efficiency res\\ilting in a higher\ndegree of perfection.\nAnother desirable feature to be brought about by the change in\nequipment is full daytime operation. Due to a time-sharing\narrangement with a former Decorah station, KWLC is, at present,\nlimited to specified hours of operation, spread throughout\nthe day.\nGENERAL ELECTRIC OFFERS INTERNATIONAL PROGRAMS\nIn response to a reouest fox the non-commercial educational\nbroadcast stations to Mr. J, R. Sheehan, Program manager of\nInternational Broadcasting for General Electric has responded\nas follows:\n“We are very happjr to grant you full privilege to rebroadcast\nprograms originated by us for our short wave stations. You\nunderstand that it is not within our power to grant this per¬\nmission when it concerns programs, which we rebroadcast from\nthe Networks. I am sure, however, that the National Broad¬\ncasting Company will cooperate with you to the limite of its\npowers and suggest that you contact them for the additional\npermission.\n“We are adding your name to oxxx mailing list and you will receive\nan advance program schedule,: I trust that should you find it\ndesirable and possible to carry some of our programs, you will\nadvise us so that we may call attention to this fact in places\nwhere it would be to our mutual advantage.”"
}