{
  "id": "d272-101",
  "text": "This consideration has been entirely from a personal point\nof view, which seems to be the natural one under the circumstances.\nIt has led to the conclusion that I should go on record as hereby\napplying for the job of manager of the NAEB Tape Network0 As\nindicated earlier, I have great confidence in the possibilities\nof this opportunity. It is not a job that I would want permanently\nbut it is one that I would be anxious to have for two or three\nyears. I would like to be around until it is a going concern.\nThere remain a couple of questions. I would like to know\nmore definitely what the salary is. My proposal for the summer\nis as follows: That I be given a half-time appointment for the\nsummer. This will allow me to carry a heavier academic load for\nthe summer session. The time would be a bookkeeping device.\nI am nore than willing to put in as much time as I possibly can.\nA full time appointment would be in order as of September.\nAs to television. If the NAEB job materializes it would\nstill be possible, it seems to me, to be of some help with the\nmany problems of TV. Whether it would be by consultation,\nhelping to train crews, or whatever, I would be willing and\nanxious to do everything possible. I could not of course give\nit the time that would be possible on another basis, but I could\nbe of some help. While on the subject of television, and\nthinking that perhaps the matter of pe sonnel would one day be\nund<r consideration, I would like to offer the name of a likely\nprospect. He is Dick Mall, currently an instructor in radio at\nOhio State. Dick was formerly head of the radio section at\nKansas State. He came to Ohio State to work on a PhD, which\nhe has completed except for his thesis. He has had considerable\nexperience in radio, both commercial and educational, and is\nnow working part time at ’.LE-C, the Crosley TV station in\nCoiambus. He is a capable man, and a very nice person in\naddition.\nThis seems to complete ray part of the process. I now bow\nout to await the ultimate decision."
}