{
  "id": "d272-129",
  "text": "November 28, l?£l\nMr. Seymour Siegel\nDirector, WNYC\nMunicipal Building\nChambers Street\nNew York, New York\nDear Syt\nIf this letter gets by with less than four pages I will be surprised.\nHowever, I did want to write you my opinions on various matters and\nreport on others before seeing you next weekend.\nIn response to your letter of November 20, I have been working on the\nschool problem. I will take part in a panel set up by George Jennings\nduring the SBC next week. I had planned to go to Cleveland to confer\nwith Bill Levenson this week; that was not possible. We are giving it\nmuch thought, and I am sure will evolve a plan which the school stations\nwill buy. Incidentally, I am enclosing a list of those who have ac¬\ncepted Packages 3 and U, knowing that they will have to make contri¬\nbutions to the Network after January 1. You will note that a good\nmany of the school stations are included.\nRegarding the fourth paragraphs in the November 20 letter regarding\nBoard Meetings, I have done considerable sole searching, as well as\nfile searching and come up with the follow ng:\nIn the budget approved at the September New York meeting, there was\na $2,000 item for Kellogg Board Meetings. This was in the amount of\n$2,000, $1,1*00 of which has already been spent. Second, in the\nminutes of the June Allertgn Board Meeting, I would like to call your\nattention to Page 2, Item%; to Pare 1*, Items 1 through 5>; and to\nAppendix A, Page h, Item 3* All of these, I believe, point to the\nfact that we should have quarterly meetings of a small Executive\nKellogg Committee for the purpose of implementing the Kellogg grant.\nMy notes indicate that we agreed in principle at Bilox/to the fact\nthat this Board could just as well be regionally centered close to\nIllinois so that travel expenses might be kept to a minimum. Need¬\nless to say, the NAKB Board can meet at your call, but I would be\nremiss in my duty if I did not strongly object to paying for such\nmeetings from Kellogg Funds. I feel that this would put the entire\nproject in jeopardy and mi$it very well prevent us from securing the\ngrants already promised for ensuing years."
}