{
  "id": "d272-150",
  "text": "stations*\nI am blissfully unaware of any \"inertia*, \"terminal\nconditions\", or \"frozen thinking\" in this office. I am\npainfully aware of the lack of duplicating equipment. It\nis well past time that such equipment were installed and\noperating. We have chosen to go slowly, Jim perhaps more\nthan I, for the simple reason that a sum of money of this\nsize is not apt to be available more than once. We have,\ntherefore, felt it wise to get the best equipment for the\njob—for whatever we get, we are stuck with>*for a long\ntime. *\nI have not taken a survey on the subject—such could be\ndone very easily, of course—but from the unsolicited comments\nthat have come in here the majority of the stations favor\nthe package system over the old method. It allows them the\nmaximum flexibility in scheduling. We are currently mailing\nfifteen programs. On the old basis this would mean fifteen\nstation groupings and fifteen mailing schedules. The reduction\nin red tape, paper work, and administrative detail was not\nintended to lighten our work week here in the office but to\nassist the stations in getting the maximum service with a\nminimum of failures and confusion. After careful consideration\nof the problem of providing maximum program service to more\nthan sixty stations, we decided that the package method\nwas the only answer until all stations could be handled on an\nindividual and separate basis.\n2. Programming policies. The kinds, the quantities, and\nthe purposes of programs offered by the network represent a\nhighly complicated problem. It is not, in ray opinion, an\nopen and shut case. There are many possible asnwers to the\nproblem, and it seems to me that either the board or a\ncommittee, or both, should consider the possibilities over ^\nperiod of a year or two before finally settling on permanent\nprogram policy. This als°requires a rather careful study\nof the member station^to determine their needs, and equally\nas important, their desires. But, this is no help in the\nimmediate problem.\nXkKxgx There is no benefit to be derived from an argument\nabout the semantics of a word such as, \"propaganda*. Suffice it\nto say that to my mind, propagandising for Shakespeare and\nMozart and propagandizing for the Federal Security Agency are\nhorses of quite different hues. Many experts in the area, Zechariah\nChafee, Jr. and Fred Siebert—to name a couple—^re alarmed at the\ngrowing practice of governmental agencies l&t hir/e*^op-salary\npublic relations men and spending many tax dollars in selling\nthemselves to the public. This coupled with the technique of\nfiltering outgoing information through these public relations\norganizations may have serious consequences to our traditional\nfree access to all the facts."
}