{
  "id": "d272-47",
  "text": "-3-\nRelationship of Radio and TV in a University\nOhio State University has applied for a television license* Much planning\nhas preceded its application* Much more planning will be needed before OSU can\nestablish and put a television station into operation, assuming a television license\nis issued. It is to be expected that responsible OSU officials would appreciate\nreceiving information which would help them in the establishment and operation of\na TV station.\nWE at WOSU assume that our primary responsibility Is to extend the ser¬\nvices of the university to adult Ohio listeners. Should this also be the chief\nconcern of the television statiori^r should the TV outlet be used primarily as a\ntraining laboratory for students aspiring to find work in television? Or should\nit be used for both purposes? Another important question is should radio and\ntelevision be combined and operated under one management thus using some of the\nsame equipment and personnel in both broadcasting media?\nUntil OSU officials feel they have the answers to these and other ques¬\ntions, they will find it difficult to make adequate decisions on the kind of build¬\ning needed, amount and kind of equipment to order, and qualifications of televison\npersonnelo One means of helping these OSU officials to acquire some of the neces-\nsaiy information would be for the NAEB to make available to them descriptions of\nexisting television operations such as at Iowa State College and Michigan State\nCollegeo\nJob Evaluation\nRegardless of whether or not Ohio State University obtains a television\nstation, it can continue to improve its radio station© One way for inprovement\nis for the station staff to make an evaluation of the work which each member does*\nThis self-evaluation could be more effectively accomplished if staff members had\njob descriptions of other university radio stations* Would it be possible for NAEB\nto devise a self-evaluation farm tfo.ich radio workers could use in describing their\njobs and rating them? Secondly, could NAEB circulate these descriptions among the\ninterested stations?\nGroup and Leadership Training\nCommercial firms, industries, labor unions, educationo©©.©all have this\none problem in common, that of group and leadership training. Staff members of\nan educational radio station must work together as a team© Sometimes their team¬\nwork suffers from inadequate leadership; other times from lack of knowledge among\nstaff members to work as members of a group© Could the NAEB provide regional\ntraining centers where station personnel, ranging from station manager to the\nstudent working part time as announcer, could go to loam more about how to play\ntheir roles as group members and group leaders? Workers in the fields of speech\nand adult education should be able to assist in organizing such regional training\ncenters.\nWe suggest the following names of discussants for any future meetings\nplanned to consider the above problems:"
}