{
  "id": "d1316-1",
  "text": "Article IV\nby the affirmative two-thirds vote of the entire\nBoard of Directors by secret ballot at a regular or\nspecial meeting; provided, however, that no such\nvote shall be taken until such member shall have\nbeen advised in writing by registered mail of the\ncharges preferred against him at least fifteen days\nbefore such vote by the Board of Directors. Such\nstatement shall be accompanied by a notice of the\ntime and place of the meeting of the Board of\nDirectors at which such matter will be considered\nand the member or his or its representative shall\nhave the right to appear before the Board of\nDirectors and be heard in answer to the charges\nbefore final action shall be taken.\nSection 4. CONVENTION AND MEETINGS.\nA. ANNUAL. An annual convention of the\nAssociation may be held each year at a time and\nplace to be determined by the Board of Directors.\nAt the same time or such other time as the\nBoard of Directors may determine an annual\nmeeting of the membership shall be held for the\ntransaction of any business which may properly\nand legally be presented. Written notice of such\nconvention and/or meeting shall be sent to each\nmember at least thirty days prior thereto.\nIn the event such annual meeting shall not have\nbeen held by December First of any year the\nSecretary-Treasurer shall designate an annual\nmeeting to be held at the principal office of the\nAssociation between the dates of December Six¬\nteenth and Twenty-Third of such year.\nB. SPECIAL. Special meetings of the mem¬\nbers may be called by the Board of Directors.\nUpon written request of one hundred active\nmembers of the Association, setting forth a\nspecific subject or subjects to be discussed at such\nspecial meeting, the Board of Directors shall call\nsuch a meeting to consider such specific subject or\nsubjects.\nNotice of any special meeting shall be mailed to\neach member at his last recorded address at least\nfifteen days in advance (with a statement of time\nand place and information where herein required\nof the subject or subjects to be considered).\nC. QUORUM. At any duly called meeting\ntwenty per cent of the active members shall con¬\nstitute a quorum for the purpose of transacting\nsuch business as may come before the meeting.\nIf less than a quorum is present a majority of the\nactive members present may adjourn the meet¬\ning from time to time until a quorum is present.\nNo member shall be entitled to be represented at\nany meeting by proxy.\nDISTRICTS\nThe United States and its dependencies shall\nbe divided into seventeen districts numbered one\nthrough seventeen. “Odd” districts shall be all\nodd numbered districts; “even” districts shall be\nall even numbered districts. The Board of Direc¬\ntors shall, by resolution designate the states and\ndependencies or parts of them to compose each of\nthe seventeen districts and the Board of Direc¬\ntors may, by resolution, change such designations\nfrom time to time.\nArticle V\nDUES\nSection 1. ACTIVE MEMBERS. Each active\nmember shall pay dues based on net receipts from\nthe sale of time received by the member during\nthe previous calendar year or such portion thereof\nas any member station has been in active opera¬\ntion. Net receipts from the sale of time are de¬\nfined as billings based on gross rate for broadcast¬\ning service, less time, frequency and volume dis¬\ncounts and advertising agency commissions, if\nany, and including net billings to the networks,\nprovided, an active member operating a standard\nbroadcast station and an associated FM station\nin the same community shall pay dues based upon\nthe combined net receipts from the sale of time\nfrom both stations.\nSection 2. CLASSIFICATION FOR DETER-\nMINING DUES. For the purpose of determining\ndues the stations shall be classified as to range of\nincome as follows:\nClass\nRange of Income\nA.\n.. $ 0—$\n25,000\nB .\n25,001—\n50,000\nC.\n50,001—\n75,000\nD .\n75,001—\n100,000\nE.\n100,001—\n125,000\nF .\n125,001—\n150,000\nG.\n150,001—\n175,000\nH.\n175,001—\n200,000\nI .\n200,001—\n250,000\nJ .\n250,001—\n300,000\nK.\n300,001—\n350,000\nL .\n350,001—\n400,000\nM .\n400,001—\n450,000\nN.\n450,001—\n500,000\n0.\n500,001—\n600,000\nP .\n600,001—\n700,000\nQ.\n700,001—\n800,000\n[21"
}