{
  "id": "d1408-0",
  "text": "EDUCATION BY RADIO\nVOLUME 5, NUMBER 6, MAY 16, 1935\nSelling Radio to College Authorities; A National Plan1\nArthur G. Crane\nPresident, University of Wyoming, and Vicechairman, National Committee on Education by Radio\nWhy should it be necessary to sell radio to college\nauthorities? To one alert to the possibilities of uni¬\nversal communication this is a foolish question.\nRadio, with its tremendous values, should sell itself. Professors\ncovet audiences and radio offers millions of listeners dis¬\ntributed nation-wide. Why need to convince faculties of the\nvalues of broadcasting?\nWhile we are asking questions, let us propound some harder\nones and the answers may clear the minor puzzles. Why did\nthe American people permit an instrument so vital to popular\ngovernment as instantaneous and universal communication\nto be seized and devoted exclusively to selling goods, making\nall other uses subordinate and incidental?\nIn spite of America's boasted aggressiveness in business\nfields, as a nation she has been exceedingly slow in realizing\nand envisioning values in the realm of social welfare. During\nthe early years of radio development everyone’s attention was\ncentered on material progress. The noise of the dollars jingling\nby drowned the few feeble voices proclaiming in the wilderness\nthe public welfare values of an intimate talk to every one of\nthe nation’s firesides. America was preoccupied, ignorant,\nand neglectful of intangible social services. It has required the\nchastening of calamity to force America to study social science.\nA new instrument, little understood, unappreciated, still\nexperimental, offered free entertainment. The novelty, the\nthrill of getting far-away stations, satisfied the fans who played\nwith the new toy. Advertisers were giving us free programs—\nwhy pay for them? It is not surprising that we failed to realize\nthe importance of the new gadget, especially since its public\nutilization required immediate public expense. Furthermore,\naltho support by advertising increased the cost many fold,\nthe tax was concealed and each listener fatuously thought the\nother fellow paid it.\nThat broadcasting was worthwhile, school administrators,\nalways pressed for funds, had to convince themselves as well\nas trustees, legislatures, and faculties. Furthermore, all of\nthem had to be satisfied that the services of broadcasting\ncame within- the purview of the universities. Only recently are\ndemonstrations at hand showing the true field of service for\nbroadcasting. Such service includes, among other things, an\nextension and amplification of previously established univer¬\nsity services.\nDuring the period of experimentation, academic faculties\nwhich ventured into the new field failed to appreciate the\nlimitations of the new medium and the new technic required\nto hold an unseen audience. Often too much was expected of\nthe new instrument. Failures in extending conventional class¬\nroom lectures to radio listeners brought discouragement. This\nwas particularly true in the face of rising costs made necessary\nin order to keep pace with invention, discovery, and develop¬\nment. Obsolescence of equipment, added to unsuitable pro¬\ngrams and the difficult task of learning a new technic, caused\nabandonment of many promising stations. Just try to teach a\nuniversity faculty any new tricks if you wish to test the strength\nof academic inertia, of tradition, habit, and convention.\n1 An address before the Sixth Annual Institute for Education by Radio, Columbus,\nOhio, May 7, 1935.\nToday the few remaining university stations have demon¬\nstrated the public service possibilities of radio in programs\nto the public and private schools, in public forums, in pro¬\nmoting public business, in general health instruction, in en¬\nlarging, amplifying, and extending adult education, and in\nmaking available the results of research. If, at the outset, we\nhad been able to envision the situation today, at least a share\nin the air would have been reserved for exclusive public use.\nThe same conditions which lulled the citizens of the nation\ninto allowing this wonder of the century to be devoted to sell¬\ning goods also made it necessary to sell broadcasting to the\ncolleges. Thru clear, convincing demonstrations of the value\nof broadcasting to American culture and government there is\nyet a chance to sell this instrument to both the universities\nand the public.\nWhat is needed today is a plan which gives promise of con¬\nserving for public purposes a share in the air. The present\nAmerican system of broadcasting is an almost incredible ab¬\nsurdity. Our country stakes its existence upon universal suf¬\nfrage, upon the general intelligence of its citizens, upon the\nspread of reliable information, upon the attitudes and judg¬\nments of all the people; and then consigns exclusively to pri¬\nvate interests this means of general communication. As a\nresult, its use for general public welfare becomes inevitably\nsubordinate and incidental.\nThe absurdity becomes more apparent when we deal with\na limited natural resource belonging to all of us and save\nalmost none of it for our own general use.\nThe absurdity passes comprehension when we not only give\nup our public birthright but tax ourselves for the support of\ncommissions to protect private monopoly in the use and con¬\ntrol of that which belongs to the nation.\nThe absurdity becomes tragic when the vital values of radio\ncommunication to a democracy are considered. Culture, in the\nbroadest sense, entertainment of the most wholesome kind,\ninformation vital to public welfare, team work to make effec¬\ntive government by the people—all these are within the gift\nof broadcasting, but each must now await the pleasure of the\nadvertiser. Great public agencies interested solely in Amer¬\nican welfare must plead before a federal commission, beseech¬\ning it to grant a small part of the air for public use not\ndependent upon the gratuity of advertising. The spectacle\nwould be humorous, were it not so tragic.\nThe National Committee on Education by Radio, a body\nrepresenting nine great national educational agencies, has\nstudied the entire situation for more than four years. It now\npresents a definite, concrete plan to save a share of facilities\nfor public use and to give the listeners who pay the bills a\nlarger and freer choice of programs. The Committee proposes\na plan which, it is hoped, will receive general discussion, and\nwill serve as a rallying point for those who desire to use this\ngreat radio agency as an instrument to advance and unify\na mighty nation.\nOf all principles safeguarding American institutions, the\none affording the greatest protection is freedom of speech.\nWithout it, freedom of thought is nullified. Freedom of speech\nincludes freedom of the press as well as freedom in all means\n[211"
}