{
  "id": "d1408-6",
  "text": "W O I\n64 0\nMARKET NEWS\nTHROUGHOUT\nTHE DAY\nTERMINAL MARKET NEWS BY LEASED WIRE FROM THE U.S.D.A* - P.M.A.\nINTERIOR IOWA REPORTS FROM FEDERAL-STATE MARKET NEWS SERVICE\nTHROUGH COOPERATION, EXTENSION SERVICE, IOWA STATE COLLEGE\nAS REPORTED BY “CAP\" BENTLEY WOI*S MARKET NEWS EDITOR\nON YOUR\nDIAL\nAMES IOWA\n6>9Q ,6.12-5 AM, - MQflfoy SafrAEfeY (Central Sfenflara Time)\n1* Review of the previous days markets at Chicago*\n6*40 - 6144 AM - Monday through Saturday\n1* Review of the previous days hog market at Chicago and on the Interior*\n2* Review of the previous days lamb and sheep market on the Interior*\n3* Early estimates of livestock receipts at the mid-west markets*\n8:55 - 9;00 AM - Monday through Saturday\n1. Opening Chicago hog market.\n2* Estimates of livestock receipts at 8 miad-west and totals for 12 public markets*\n9:45 - 1Q:00 AM - Monday through Saturday\n1. Weather report for Iowa and neighboring states.\n2* Opening Chicago grain futures market*\n3* Opening Wall Street stock market*\n4. Opening report on the Interior la* and so* Minn, hog market.\n5* Opening report on the Interior la* and so. Minn, sheep and lamb market.\n6. Dressed meat report from New York City.\n7. Opening hog market at midwest terminals.\n10:30 - 11:00 AM - Monday through Saturday\n1. Chicago grain futures as of 10:15.\n2. Chicago live poultry and spot egg report.\n3. Iowa weather report.\n4* Mid-morning report on the interior hog market*\n5. Mid-morning report on the interior lamb and sheep market.\n6* Mid-morning reports on hogs, cattle and sheep for 7 mid-western Terminal markets.\n(On Saturday weekly summaries of all classes and all markets.)\n7* The Chicago spot egg report between 10*58 and 11*00*\n11:39 - Hi 31 AM - Montoy through Saturday\n1* The Chicago grain futures as of 11*15.\n2. Mid-day Wall Street stock market.\n13:00 - Boon - Monday thrmn-h Saturday\n1. The Chicago spot egg report.\n12*15 - 12*20 PM - Monday through Saturday\n1. Weather summary for the midwest. (Tuesday and Friday 5 day forecasts.)\n2. Summary of hog trading at the midwest Terminal markets up to the noon hour.\n3* Suramar of the Interior hog trading up to the noon hour.\n4. Summary of cattle trading at the midwest Terminal markets up to the noon hour.\n5. Summary of sheep and lamb trading at the midwest Terminals up to the noon hour.\n6. Summary of the Interior sheep and lamb trading up to the noon hour.\n7. The Chicago egg prices for US extras and current receipts.\n8. The Chicago quotations on the nearest grain option as of 12*00 noon.\n9. Estimates of livestock numbers expected at midwest Terminals.\n1*30 - 1*50 PM - Monday through Friday\n1. Chicago* a* Spot Egg; b. Egg Futures; c. Live Poultry\nNew York* a. Spot Ifeg; b. Live Poultry\n2. Iowa weather summary. (Tuesday and Friday 5 day forecasts.)\n3. The closing reports on hogs for 7 midwest Terminal markets.\n4* The closing report on the Interior hog trade.\n5. The closing reports on sheep and lambs for 7 midwest Terminal markets.\n6. The closing reports on the Interior sheep and lamb trade.\n7* The closing Chicago grain futures and cash sales with comments on the days trade.\n(Saturday this grain report is given at 12*30 PM)\n8* The closing reports on cattle for 7 midwestern Terminal markets*\n9. Estimates of livestock receipts for tomorrow*s trading at 6 midwest Terminals*\n2:39 - 3:30 PM - Monday through Pritey\n1. Closing Wall Street stock market.\n6*12 - 6*15 PM - Monday through Friday\n1. New York* a. Wall Street close* b. Bond close; c. Cotton close\n2. Chicago* a. Grain close; b. Spot egg; c. Live Poultry\n3. Hogs - Midwest Terminals and the Interior la* and so* Minn* close*\n4. Cattle - Midwest Terminal close.\n5. Sheep - Midwest Terminal and the Interior la. and so* Minn, close#"
}