{
  "id": "d1628-12",
  "text": "ELECTION RETURNS ON FACSIMILE\n-13-\nFor the first time in history a special event was broadcast by facsimile. The May\nelection returns in Miami, Florida, were printed on eight facsimile receiving sets\nby the MIAMI HERALD1s fax station, u'QAM-FM. Receivers were set up in seven hotels\nand at the University of Miami,\nSENATOR TOBEY CHARGES FCC INFLUENCED BY \"POWERFUL RADIO INTERESTS’*\nActing chairman, Senator Tobey (R-New Hampshire) of the Senate Interstate & Foreign\nCommerce Committee charged, in effect that the FCC has been influenced by \"powerful\nradio interests in this country,\" Tobey1s statement came as the Senate committee\nbegan hearings into accusations that the Radio Corporation of America (RCA) has\nattempted to stifle developments of FM broadcasting in order to promote television.\nMajor Armstrong, inventor of reviewing progress of FM, accused the FCC of placing\na \"roadblock\" in the path of FM by refusing, prior to the war, to assign FM proper\nfrequencies*\nAsked by Tobey, if the conditions he described indicated that the FCC had been under\nthe influence of \"powerful radio interests in this country\" Armstrong replied,\n\"There is no doubt about it,\"\nThe accusation against RCA were made by Tobey and Armstrong last April 23 as the\ncommittee ended inquiry into clear channel and superpower broadcasting*\nDr. Charles B, Jolliffe, executive vice president in charge of RCA laboratories,\nand the corporation’s chief engineer, denied that RCA favored television over FM,\n\"We do not take a stand,\" he said, \"in favor of one of these services as against\nthe other. We believe in both, and ?/e are convinced the needs of both can be ad¬\nvanced without a feud between the two. In our opinion the way to promote FM is to\npromote FM and not to fight television,\nSENATOR CAPEHART TANGLES WITH TOBEY\nSenator Homer Capehart (R,Indiana) accused Senator Tobey (R.New Hampshire) of treat¬\ning witnesses unfairly and of trying to act as \"judge, jury, and prosecutor\" in his\nquestioning of industry representatives in hearings on FM development, Capehart\ncalled for an end to the hearings stating, \"I’m sure the chairman (Senator Tobey)\nhas already made up his mind that RCA and FCC are wrong,\"\nBILL TO REST!JCT USE AND OWNERSHIP CF STATIONS IN NETWORK SERVICE\nRepresentative Harry Shephard of California has introduced a bill providing that no\nstation could be owned or licensed to any network\\ it further stipulated no station\nbe allowed to devote any two consecutive hours pf program to network, Shephard’s\nbill would also prohibit any manufacturer of radio equipment to own a network or\na station.\nGOTHAM SPEAKS THROUGH WNYC\nNAEB member station YfNYC, owned and operated together with WYC-FM by the city of\nNew York is praised in a special feature article in the May, 194$ issue of the\njWESTERN ELECTRIC OSCILLATOR. Describing in detail the work of UNYC' and WNYC-FM,\n' thiscomplete history of the New York Municipal Broadcasting System described the\njgrowth and development of this citizen-owned public service radio enterprise.\nParticularly interesting and worthwhile is the description of WNYC program planning\nand program activities--activitfep which have resulted in a 3*5 Hooper rating for\nthe first quarter of 1943. The article is well worth considerable study by any ed-|\nucational broadcaster in the U,S. It answers the question; \"Can you educate and j\nserve and. still attract significantly large audiences,\" The answer is \"yes\". The i\narticle tells \"why\" and ’’how’’."
}