{
  "id": "d1771-1",
  "text": "7) Simple operation from front.\n8) Twenty-one-inch screen.\n9) Controls on back for all adjustments—height,\nwidth, H and V line centering; H and V hold,\netc.\n10) High definition video circuits—five hundred\nlines.\n11) Transformer power supply with paralleled\nfilaments.\n12) RF—video switch for air or closed circuit use.\n13) Separated audio input.\n14) Loop AC from set to set.\n15) Loop audio from set to set.\n16) Loop video from set to set.\n17) Frequency corrected audio—curtailed below\n200 N.\n18) Five-watt minimum audio output.\n*****\nWe’d like to call your attention to the April 1958\nRCA Broadcast News as it contains a number of items\nof interest for both radio and television engineers.\nThis issue contains a detailed description of how the\nRCA Videotape Recorder operates, as well as articles\non automation in television programming, precision\noffset TV carrier operation, design of a combination\ncontrol room/announce booth in addition to the\nusual descriptions of radio and television equipment\ninstallations. Technical details of a new 500 - 1000\nwatt am transmitter, a 2 kw VHF television trans¬\nmitter, a universal coaxial transmission line, and a\nnew ultra-directional television microphone are also\nincluded.\nTV TECHNICAL TIPS (August)\nIn almost every television station operation, occasions\nhave arisen when the intercommunication between\nthe director and the cameraman is not loud enough to\novercome ambient noise. Donald K. Haahr, of the\nWOI-TV staff, sends along the method’s used there\nto overcome this difficulty as developed by two of\ntheir engineers, Thomas F. West and Leo E. Runge.\nThe two most obvious program offenders are\nsportscasts and musical productions. Quick camera\nchanges during the climax are important, yet this is\nusually the time of most program volume. Our ill¬\nustrations show two of the three methods used at\nWOI-TV to assure its cameramen getting necessary\ninstructions in spite of program or crowd noise.\nThe first step in this improvement was to con¬\nstruct a bracket which mounts the micropflpne as-^\nsembly of a Western Electric Type 52 AW h^,dset to\nThe WOI-TV crew likes them because they offer\nintercom to both ears, at the same time blocking un¬\nwanted sound from the normally used ear. They are\nrugged and they are more comfortable, especially in\ncold weather.\nThe second step was to incorporate an amplifier at\nthe director’s position which fed a higher talk level\nto the intercom circuit. The talk voltage was raised\nfrom the usual .5 volt normal level to approximately\n3.0 volts, which is about the maximum, above which\ncross talk may be observed in the video circuits of\nthe camera cable. The addition of a key switch al¬\nlows the director to have the line audio amplified on\nhis headset alone. One disadvantage is that the di¬\nrector’s mike is amplified into his own ear piece.\nAs a result of this second step it became evident\nthat it would be desirable to have an amplifier at each\nheadset location with its own volume control; in this\nway the audio in the intercom circuit could be normal\nmike level. The third step was to build a transistor\namplifier in a 21/4\" x 2*4\" x 4\" aluminum minibox\nshown on the panning handle of the camera. The\npower supply is self-contained and to date the bat¬\nteries have lasted over three months using them\nabout three hours per week on remote pick-ups. The\ncost of materials is less than ten dollars per unit.\nIf you’d like to complete constructional details of\nthese amplifiers including a parts list, schematics and\n2\nENGINEERING NEWSLETTER"
}