{
  "id": "d1538-0",
  "text": "Volume V, Number 6\nApril 8, 1964\nNAEB FILES COMMENTS ON UHF PROCEEDING AND MPATI EXPANSION\nThe NAEB filed with the Federal Communications Commission last Friday (April 3)>\nits own proposed UHF television channel assignment plan. In its comment, NAEB strongly\nurged the Commission to adopt the NAEB plan because it presents the most efficient\ndistribution of UHF assignments and provides the most information about over-all tele¬\nvision channel allocations in the United States. The plan submitted by NAEB was developed\nin connection with its study of the use of computer methods to calculate television\nchannel allocations. It proposes 609 more assignments than the FCC's plan, and recommends\n909 UHF educational reservations. (See also ^.shington Reports on November 8 and\nDecember l6, 1963•)\nCopies of the NAEB plan and copies of the comments filed with the Commission are\navailable upon request from the Vkshington office.\nNAEB also filed last Friday, comments concerning the proposed expansion and\nregularization of airborne television services offered by MPATI. NAEB opposed the MPATI\nproposal and indicated that it would seriously retard the development of a system of land-\n^ based television stations to meet a variety of educational needs, both in the schools\nand throughout the community.\nAt most, the NAEB believes that the Commission should do no more than to continue\nthe two channel service now being offered to the mid-west area until such time as regular\nlocally-based television stations or other interconnection systems are activated. \"MPATI\nservices should, like translator services, be licensed only as a secondary service which\nis not permitted to cause interference to the direct reception of any television broadcast\nstation...NAEB further believes that if the key problem is appropriate distribution of\neducational materials, that the FCC should explore other means of interconnection (for\nexample: microwave links along the lines of the proposed Eastern Educational Network or\nthe various statewide microwave proposals), to achieve the beneficial objectives which\nMPATI proposes.\"\nFARGO ETV RECEIVES HEW GRANT\nApproval of a $130,173 grant to help the North Central Educational Television\nAssociation, Inc., Fargo, establish North Dakota's first educational television station\nwas announced April 1 by Anthony J. Celebrezze, Secretary of Health, Education and\nWelfare.\nThe new station, KFME-TV, Channel 13, will offer instructional and general-\ninterest programs to more than 160,000 persons within a 50-mile radius of Fargo and\nMoorhead, Minnesota. Estimated school population in the area is 50>35^ students in\n128 educational institutions.\nTotal cost of the project is estimated at $205,270. Federal funds will be used\nto purchase a tower and transmission and studio equipment. The station will augment its\neducational service through a program agreement with KTCA, an existing educational tele-\nvision station in Minneapolis-St. Paul.\nThe approval brings to l6 the number of grants approved since funds for the five-\nyear program first became available last May. The over-all approved grant total is\n$3,023,1^5."
}