{
  "id": "d1538-1",
  "text": "APPLICATIONS FOR ETV FUNDS ACCEPTED\nThree new applications for a total of $854,434 have been accepted for filing\nunder the ETV Facilities Act. These applications are:\nClover Park School District 400, Lakewood Center, Washington, for $99*831; to\nexpand facilities of Station KPEC-TV, Channel 56, at Iakewood Center; total project\ncost $133*108.\nThe Trustees of Indiana of Indiana University, Bloomington, Indiana, for $285,644,\nto activate Channel 30 at Bloomington; total project cost $495,842.\nNorth Dakota State Board of Higher Education, for the University of North Dakota\nand North Dakota State University, for $468,959, to activate Channel 2 at Grand Forks;\ntotal project cost $919,874.\nFCC TO INQUIRE INTO FREQUENCY SHARING BY TV AND LAND MOBILE\nThe Commission took -the following actions concerning the allocations of frequencies\nto the various non-Government radio services in the radio spectrum between 25 and 890 Me:\n1. By Report and Order, denied various petitions for reallocation of TV and other\nchannels to non-broadcast services and terminated its current inquiry into frequency\nallocations in that part of the spectrum (Docket 11997)* NAEB filed comments opposing\nthe various requests.\n2. Instituted an inquiry into the optimum frequency spacing between assignable\nfrequencies in the land Mobile Service and the feasibility of frequency sharing by\ntelevision and the land Mobile Service, specifically inviting the Joint Technical Advisory\nCommittee and the Electronics Industries Association to comment on channel spacing in\nthe band 150.8-162 Me and on the feasibility of land mobile sharing VHF television\nchannels.\n3. Established an Advisory Committee for the land Mobile Service to study growth\nproblems of land mobile use under the chairmanship of Commissioner Kenneth A. Cox, with\nJames E. Barr, Chief of the Safety and Special Radio Services Bureau, as vice chairman.\n4. Proposed rule making for a limited trial program of primary/secondary inter¬\nservice usage of existing unused or lightly used land mobile frequencies in the 150.8-162\nand 450-470 Me bands in the state of California only and limited to the first 500\nqualified applicants.\nFCC ACTIONS: VHF EDUCATIONAL TELEVISION CHANNEL ASSIGNMENTS\nBy Reports and Orders, the Commission amended its TV allocations table to (l) assign\nand reserve for noncommercial educational use, TV Channel *2 in Columbia, North Carolina\n(Docket 15227) and (2) reserve Channel 8 in teiycross, Georgia, to enable Georgia State\nBoard of Education, which operates station WXGA-TV on that presently unreserved channel\nto apply for Federal Aid from the Department of Health, Education and Welfare (Docket 15144).\nThe Commission invited comments to Notice of Proposed Rule Making looking toward\namending its TV table of assignments to add VHF Channel *9 to Grandview, West Virginia,\nfor noncommercial educational use. The Board of Governors of the University of West\nVirginia petitioned for the assignment and stated that it hopes to serve 11 counties in\nthe southeastern sector of the state.\nWETA MOVES OFFICES TO NEW LOCATION\nThe offices of the Greater Washington Educational Television Association (WETA-TV),\nare now located in the Jefferson Building, 1225 Nineteenth Street, N.W., Washington, D.C.\nThey moved to their new location April 1."
}