{
  "id": "d737-15",
  "text": "THE STATE UNIVERSITY OF IOWA\nIOWA CITY\nDepartment of Psychology\nApril 18, 1959\nMr. A. J. Ebel\nRadio Station WILL\nUrbana, Illinois\nDear Mr. Ebel:\nCarl Menzer has supplied me with acopy of the\nNAEB ,fInstantaneous Recording Machine Tests” for my criticism.\nI am enclosing a list of suggested modifications of the procedure\nwhich have evolved from the experiences of Dr. J. M. Cowan, Director\nof the Romance Languages Recording Laboratory, and myself.\nWe are compiling a complete bibliography on disc\nrecording which we hope to publish soon in Electronics. Also,\nDr. Cowan Is translating Buchmann and Meyer:,fEine neue optische\nMessmethode fur Grammophon-platten.\" This is the article which\nis of fundamental Importance in all recording machine measure¬\nments. It will be published shortly, in English.\nWe are in favor of using the diffraction pattern\n(light-band width) as a basis for all measurements of frequency\ncharacteristics and linearity.meThe recording levels should also\nbe set from a earefully determined measurement of light-band width\nand subsequent conversion to stylus velocity in cm/sec.\nRecently I spent four days at the RCA Recording\nStudios in Chicago observing the methods they use in recording\nall kinds of records. One striking thing presented Itself, and\nthat was that they had no standard recording level, but put all\nthe level on the discs that would allow a commercial pickup to\nplay them back without damaging the record. This is a function\nof the type of program and composition of the sounds entering\nthe system.\nDr. Cowan and I have been working out a set of\nstandards for acetate recording which will enable anyone who\nknows anything at all about the game to closely approximate\nthe commercial recordings. As soon as we have these completely\nworked out we will send you a copy.\nIf there is anything I can do to help in getting\nthis instantaneous disc recording practice stabilized I shall\nbe only too glad to do so.\nVery sincerely yours.\nPaul E. Griffith,\nElectrical Technician"
}