{
  "id": "d737-42",
  "text": "Conn Chromatic Stroboscope\nin the same direction, the pattern may be brought\nto a standstill, or made to “sleep.” The pointer\nwill then read “—20” on the graduated scale above\nthe adjusting knob, thus showing directly how\nmuch the 435 cycle tone is flat compared to the\nstandard A, the reading being expressed in hun¬\ndredths of a semitone (cents). If the entire piano\nhad been tuned to equal temperament on this\nlower pitch standard, then all strings would pro¬\nduce stationary patterns with the pointer at\n“—20.”\nObviously any frequency in the range concerned\nwill always be within 50 hundredths of a semitone\nfrom some note of the standard scale. To learn\nhow much is its deviation, it is only necessary to\nadjust a knob until the appropriate pattern comes\nto rest. The only judgment required lies in decid¬\ning when the pattern is stationary. No compari¬\nson tone is ever sounded, and all counting of beats\nor estimation of drift speed is eliminated. Further¬\nmore, deviations are read directly from a single\nscale which serves for all notes. This is a unique\nFig. 2\n(Twice Actual Size)\nadvantage of the Chromatic Stroboscope over\nother tuning and measuring devices which lack\nthe adjustable feature.\nTo a certain degree the Chromatic Stroboscope\nserves to pick out the component frequencies in\nthe sound falling upon the microphone. If, for\nexample, F and A tuning forks be sounded simul¬\ntaneously, the first correctly tuned and the other\nsharp, a stationary pattern will appear in the “F”\nwindow while another pattern appearing at the\nsame time in the “A” window will move to the\nright. Measurement of each frequency may thus\nbe carried out independently.\nMost musical tones are complex, consisting of\na number of component frequencies. Relying\nupon the selective action just mentioned, one may\nmeasure the individual frequencies of these com¬\nponents. Thus, when required, the intervals be¬\ntween them can be found. The same selective\naction permits measurements to be made in rela¬\ntively noisy locations without experiencing any\ninterference.\nOriginal Development for Testing\nWind Instruments\nThe Chromatic Stroboscope was developed by\nC. G. Conn, Ltd., as a means of measuring the\nintonation of wind instruments. The old method\nwas to count beats between the tone being played\nby the musician and that of a tuning bar or organ\nsounded at the same time. Long experience with\nthis method showed that the musician making the\ntest would tend to “lip” the tone so that it would\nmore nearly agree with that of the tuning bar.\nOften this “favoring” was done unconsciously and\neven despite the musician’s resolve not to do so.\nThe Chromatic Stroboscope avoids this diffi¬\nculty by having a standard of frequency which is\ninaudible. Comparison with the tone of the\ninstrument is made by an independent operator\nand is entirely visual. In practice, the musician\nmaking the test is usually not even allowed to\nknow how the tones he is producing are showing\nup. The tendency to “lip” into tune is thus\neliminated, and the normal intonation of the\ninstrument may be arrived at.\nSince the old method of counting beats was very\ntedious and time-consuming, an aim in the design\nof the new apparatus was to make it easy to\noperate and rapid in measurement without mak¬\ning any sacrifice of accuracy. This aim has been\nrealized to such an extent that it is now possible\nto measure the individual notes in a legato pass¬\nage. It has been found that in many cases a\nmusician will sound his tuning note unnaturally,\nthe reason probably being psychological. Under\nsuch circumstances the error may be minimized\nby having the musician play a passage in which\nthe note occurs, and making the measurement\n“on the run.”\nHas Wide Variety of Uses\nWhile the Chromatic Stroboscope was developed\nby C. G. Conn, Ltd. primarily as a measuring\ndevice for testing the intonation of wind instru¬\nments, it has been found adaptable to a wide\nvariety of uses where the accurate measurement\nof frequency is involved. As various persons in\nother fields became acquainted with the instru¬\nment, they immediately saw how it could be\napplied to their own problems of sound measure¬\nment. For example, piano manufacturers and"
}