{
  "id": "d737-43",
  "text": "Conn Chromatic Stroboscope\ntuners saw in it an accurate device for measuring\nthe tuning of the piano. Formerly the only record\nof how a piano was tuned was the memory of the\ntuner. With the Chromatic Stroboscope an accu¬\nrate written record may be kept, the deviation of\neach tone from standard being tabulated. By\nsetting the adjustment knob to these readings, the\nstrings of another piano can readily be brought to\nhave exactly the same tuning. In like manner any\narbitrary scale, such as a just scale, may be set up\nfrom a calculated table. No adjustment is re¬\nquired for tuning to standard equal temperament.\nObviously, the same procedure can be applied in\nthe tuning of any other instrument.\nTeaching Ear Training\nTeachers of music, bandmasters, and orchestra\ndirectors see in this device a means of ear training.\nMost students now have no other guide in learn¬\ning correct intonation than by listening to another\ninstrument. If the intonation to which they listen\nis inaccurate, they will become accustomed to a\nfaulty scale. If all members of a class or ensemble\nlearn to play correct intonation as shown by the\nChromatic Stroboscope, they will all learn to play\nthe same correctly tempered scale. Limited ex¬\nperience with the stroboscope in this connection\nhas revealed some remarkable progress by stu¬\ndents who formerly played with faulty intonation.\nTo aid those players of instruments which are\nbuilt in keys other than C, a transposition indi¬\ncator is provided. For example, if an Eb instru¬\nment is to be used, the pulling of a knob will\nchange the label at the Eb window to C, this being\nthe written note that must be played in order to\nproduce a stationary pattern at the Eb window.\nWavering on sustained tones is another fault\nwhich can be corrected by using the Chromatic\nStroboscope. Such wavering produces oscillation\nof the pattern. The student can correct this by\nlooking at the pattern and sounding the note in\nsuch a manner that the pattern stops oscillating.\nTeaching of Harmony and Theory\nHarmony and theory teachers see in this in¬\nstrument a valuable aid in their work. The in¬\ntervals of the just scale, as determined by the\nharmonic overtone series, may be demonstrated\nwith the Chromatic Stroboscope. How far these\nintervals depart from those of the tempered scale\nmay be read directly on the instrument. Notable\ndifferences occur in the third, the major third\nbeing 14/100 of a semitone flatter (—14 cents) and\nthe minor third, 16/100 of a semitone sharper\n( + 16 cents) in just intonation than in the tem¬\npered scale.\nThe Chromatic Stroboscope thus makes it\npossible to find out whether just or tempered in¬\ntonation is preferred in a given chord combination.\nFor example, a certain chord as played by a wood¬\nwind quartet was definitely unsatisfactory. By\ntrial the different instruments were tuned until all\nmembers agreed that the chord was pleasing.\nThen the frequency of each note in this pleasing\ncombination was measured and analysis of the\nresults showed that the chord was nearly in just\nintonation. This indicates that under some con¬\nditions intonation other than that provided by\nstrict equal temperament may be desirable. The\nChromatic Stroboscope permits the careful study\nof such effects.\nIt should be pointed out that, although readings\nare in terms of the tempered scale, the device does\nnot prescribe that the musician use this scale in\nhis performance. The adjustable feature allows\nany other possible scale to be investigated.\nUse in the Psychology Laboratory\nThe device is admirably suited to investigating\nsuch phenomena as absolute pitch. A subject may\nbe asked to sing, for example, a previously chosen\narbitrary series of notes. The frequency of each\nmay be measured, rapidly and accurately, without\nallowing the subject to hear a reference tone at\nany time.\nFig. 3\n(Actual Size)\nThe study of subjective pitch has recently be¬\ncome of importance. An observer is asked to\nadjust the frequency of one tone until it appears to\nhave the same apparent pitch as another, fixed\ntone of different loudness. The frequency of any\nvariable sound source used in such experiments\ncan readily be found, the reading being in hun¬\ndredths of a semitone deviation from some note\nof the standard equally tempered scale."
}