{
  "id": "d1627-15",
  "text": "-16-\nEDUCATORS URGED TO SPEED UP PLANS FOR ESTABLISHING SCHOOL-OWNED FM RADIO STATIONS\nHundreds of additional FM radio broadcasting stations should be established by-\neducators within the next few years to make full use of the 20 channels reserved\nfor educational broadcasting, according to Wayne Coy, Chairman of the Federal\nCommunications Commission, writing in \"FM for Education,\" a bulletin just released\nby the Federal Security Agency. Mr. Coy states that the reserved channels, if left\nunused, might have to be assigned to commercial broadcasters.\nQuoting from.'Mr.Coy1 s article, \"FFC Views FM Educational Broadcasting\"; —\n\"To judge the value of this section of the ethereal public domain which the Commiss¬\nion has allocated for education, I suggest a look at the spirited competition which\nhas arisen for assignments in the 80 channels allocated for commercial broadcasting.\nAlthough only relatively few FM receivers are in the hands of the public, 400\ncommercial FM stations are now in operation, 600 are under construction, and 120\napplications are pending. This activity is building potential audiences for the FM\neducational broadcaster* I look for from 2,000 to 3,000 FM stations on the air within\nthe next few years. Eventually the Commission expects FM to supplant AM in all but\nthe sparsely settled rural areas.\"\nIn a foreward to the Office of Education publication, John ¥. Studebaker,\nCommissioner of Education in the Federal Security Agency says: \"This\nsecond and revised edition of \"FM for Education\" presents endouraging\nevidence of the rapid growth in the utilization of this valuable edu¬\ncational tool since the end of the war. The availability of transmitter\nequipment and FM receiving sets is no longer a bottleneck. Dozens of\ncolleges, universities, and school systems situated in various parts of\nthe United States have made applications for FM frequencies. As of\nApril 1948 some 100 school systems and colleges were on their way to FM\nstation ownership ahd operation.*,. It is my confident belief that radio\nas a tool of education is entering upon a new era in the United States.\"\nThe publication invites the attention of teachers of electronics, educational\nFM station planners, and of State and local' school administrators to the facts\nthat FM radio equipment is comparatively inexpensive to install and maintain\nand that FM offers superior reception and transmission for educational pro¬\ngrams. It furnishes suggestions for planning, licensing and utilizing FM edu¬\ncational radio stations owned by schools, colleges, and universities. Exper¬\niences of leading educational systems with FM stations are highlighted.\n\"FM for Education\" (revised) was prepared by Franklin Dunham, Chief of\neducational Uses of Radio Section, Office of Education, with the assist¬\nance of Ronald R. Lowdermilk and Gertrude G. Broderick. Copies are on\nsale for 20 cents by the Superintendent of Documents, U. S. Government\nPrinting Office, Washington, 25 D5C.\nNEW FM NETWORK FORMED, IN, NET! YORK STATE\nOrganization meeting of a new radio FM network to be called the \"Colonial Network\"\nwas held in early May at Syracuse, N*Y. Announcement was made by Gerald Mayer,\npresident and general manager of WKRT-FM in Cortland, N*Y. Action followed confer¬\nences over a period of weeks in which a group of independent central and western\nNew York FM broadcasters developed plans for a regional FM network using an \"Off the\nair\" pickup rather than telephone or coaxial lines."
}