{
  "id": "d1627-4",
  "text": "NATIONAL RADIO COUNCIL ORGANIZATION IK PROSPECT??,???\nA plan to organize local radio councils in cities throughout the country into a\nNational Radio Council was reported as an outgrowth of discussion by radio council\nrepresentatives at the Ohio Radio Institute.\nIt Is estimated that there are 60 radio councils in operation throughout the country\nwith the most effective groups located in Minnesota, Iowa,Utah, Ohio, Tennessee,\nNorth Carolina, Missouri, Michigan, Illinois, Risconsin and California.\nMrs. George Fielding Eliot, wife of the radio commentator,was reported to be active-\n’ ly engaged in the organization work.\n1 NAAB, the National Association of Educational Broadcasters has a\n| Radio Council section, headed by Mrs. Margaret Stoddard, of the\nj Cedar Rapids (Iowa) Radio Council. This group holds associate raem-\n| bership in NAEB.\nPresent councils differ considerably in objectives and methods of work. Some have\nacted as a sort of OWI clearing house for local radio outlets, screening public\nservice material and groups before station permit broadcast; others called \"pro¬\nduction councils\" actively engage in the planning and preparation of programs,\nand still others content themselves with critical and advisory function,\nOVER 65*000 VETERANS STUDYING RADIO\nA recent study by the Vetoranfe Administration revealed there are a total of 65,225\nveterans training under the GI bill for jobs in the communications and broadcast\nfield.\nNearly all the veterans are enrolled in accredited educational institutions. Nearly\ntwo-thirds of the total are taking courses in radio and television mechanics; their\nnumber amounts to over 43,000 trainees. More than 17,000 are in general radio and\ncommunications. No clear figuro on the number engaged in production and program\ntraining work is available.\nN-A-E-B SALUTES ANOTHER NEW EDUCATIONAL STATION IN TOLEDO\nAnother important addition to the growing roster of school FM broadcast stations\nis WIDS, FM outlet of the Toledo, Ohio Board of Education which began a regular\nschedule of operation, five days per v/eek, on May 11, 1948.\nThe entry of WIDS at Toledo into FM school and adult non-commercial broadcasting\nmarks the third major agency in Ohio to enter this field. Long time educational\nstation operators in Ohio, YIBOE in Cleveland and WOSU At Ohio State University\ntake special pleasure in greeting their new sister station.\nWIDS in addition to providing valuable supplementary broadcast features for the\n! Toledo Public School System is expected to be an invaluable training ground for\n1 students of radio operation, programming and production."
}