{
  "id": "d1177-10",
  "text": "-10.\nLargely because of the foregoing reasons, industry has standardized upon the two\nterms, \"Standard\" and \"Non-Standard\" emulsion position which correspond to the two\ninherent image relationships that might exist upon a 16mm. film. Once ^ a film has\nbeen exposed and processed to produce an image it is possible to classify its emul¬\nsion position by visual inspection in accordance with simple rules such as those\noutlined in the following section.\nHow to Tell Emulsion Position By Inspection\nIn order to determine the \"Emulsion Position” of a particular 16mm, film, either\nnegative or positive, the following rules apply without restrictions,\n\"Standard Emulsion Position\" - Hold up a piece of film vertically with the\ntop of the picture upward,’ Left and right picture detail appear normal only\nwhen emulsion surface is away from the eye, (In the case of 16mm, sound rel-\nlease film the sprocket holes will be on the left.)\n\"Non-Standard Emulsion Position\" - Hold up a piece of film vertically with the\ntop of the picture upward. Left and right picture detail appears normal only\nwhen emulsion surface is toward the eye. (In the case of 16mm, sound release\nfilm the sprocket holes will be on the left.)\nIf on a 16mm. sound release film, the sprocket holes should be found to be on the\nright side instead of the left, then, assuredly, someone has \"goofed\" in the print¬\ning procedure. Such a print has a \"hybrid\" or ambiguous emulsion position and cannot\nbe projected without accepting the fact that \"left and right\" will be reversed on\nthe screen.\nTo be meaningful to the projectionist such inspection must be made directly on the\nprint or film which is intended for projection rather than by examination of nega¬\ntives or intermediate duplicating stock. Since the emulsion position reverses it¬\nself each time contact printing occurs, great care must be exercised when predict¬\ning the emulsion position of the release print on the basis of one*s inspection of\nthe negatives.\nA Proposal for Simpler Terminology\nEven at best the terms \"Standard Emulsion Position\" and \"Non-Standard Emulsion Posi¬\ntion\" are awkward choices for terminology which must undergo such frequent verbali¬\nzation when discussing these matters. Furthermore, if one takes a cross-section of\navailable l6mm. prints in daily usage, there seems to be nothing particularly stan¬\ndard about emulsion position except the definition alone. A goodly number of prints\nwhich are made by what we normally call the \"double system\" end up with the emul¬\nsion facing the projection lamp, which is strictly \"Non-Standard\" according to SMPTE\ndefinitions.\nAnother failing of this terminology is that it does not serve to specify either the\nlocation or type of sprocket perforations on a particular film. This is of course\nof little concern to a projectionist since single perforated film will only thread\nin one manner when fed heads first. However, there are instances in printing pro¬\ncedure where one must make rather discreet choices involving both sprocket position\nand emulsion position in order that the final print be projectable in a correct man¬\nner."
}