{
  "id": "d1177-13",
  "text": "■13-\nin that the \"wind\" of the sound negative is identical to that of the single perfor¬\nated raw stock which is used to load the sound recorder, provided that the sound is\nplayed into the recorder in the normal or intelligible manner. . Should the sound be\nplayed into the recorder in the reverse or \"gibberish\" direction, the resulting ex¬\nposure becomes the opposite to that of the raw stock which is being used. This can\nbe Summarized in the following manner: /;\nRule 3—\n\"Wind\" of Sound Feed Wind of\nRaw Stock Playing Direction Exposure\nCase 1 A Forward A\nCase 2\nA\nReverse\nB\nCase 3 B Forward B\nCase h B Reverse A\nSince both the final picture printing negative and the sound optical negative will\nin turn be used to expose the same release print, it is obvious that their \"wind\"\nmust be the same. In other words, an \"A Wind\" picture printing negative calls for\nthe preparation of an \"A Wind\" sound printing optical negative, and vice versa.\nConsideration Involving 35mm. Film\nIt is possible that the previously outlined method for classifying films into two\nbroad types can also be applied to the field of 35mm. motion pictures. Since the\nproduction of professional movies involves multiples of one additional printing op¬\neration, the resulting standard emulsion position is toward the projection lamp.\nTo allow for this situation, the SMPTE standards concerning 35mm. emulsion position\nare directly opposite to those which they define for 16mm. film. Accordingly,\n\"Standard Emulsion Position\" for 35mm. films is in the direction of the light source\nwhile the emulsion position facing the screen is \"Non-Standard.\"\nConclusion\nIt may be interesting for the reader to know that the foregoing approach to classi¬\nfying 16mm. film and attendant operations was evolved from the sheer ignorance of\nhow to properly apply the existing standards. The incident which led to this situ¬\nation occurred when a kinescope recorder was purchased by the University of Minne¬\nsota and its operation was commenced by a group of radio engineers who knew little\nor nothing about film techniques.\nUsing only fragmentary knowledge regarding winds and emulsion positions, this group\nbegan to converse in a language which was found upon later examination to be com¬\npletely inconsistent with that in prevalent usage by film technicians. Nonetheless\nthe definitions seemed to work rather well and permitted film handling operations\nto be scheduled with little or no misunderstanding.\nr"
}