{
  "id": "d1177-8",
  "text": "-8-\nCLASSIFYING 16MM. \"EMULSION POSITIONS\" AND \"FILM WINDS\"\nBy Berten A. Holmberg\nChief Engineer\nRadio Station KUOM\nGeneral\nOne of the more vital abilities which a person who handles 16mm. motion picture film\nshould have is that of being adept in classifying film stock according to its \"wind\"\nand its \"emulsion position.\" Often this must be done in a minimum of time and under\nlighting conditions which are far from optimum. Since a mistake can waste much valu¬\nable film, it is well to commit a few simple rules to memory.\nAfter a discussion of these rules and corresponding definitions, there will be pre¬\nsented herewith a proposal for simplifying certain terminology and practices related\nto 16mm. film production.\nRaw Stocks—\"A Wind and B Wind\"\nThe first of these terms, \"wind\" refers to the manner in which single perforated\n16mm. raw stock is wound onto cores as supplied by the film manufacturer. While\nraw film is always supplied with its emulsion wound toward the center of the core,\nthere still remains the alternative of spooling it in such a manner that the row of\nsprocket perforations is either on the near or the far edge of the roll when it is\nplaced into position in a camera or printer.\nA little experimentation with a few feet of single perforated film will show that\nthe position of the perforations is determined by one*s choice of the film end that\nis attached to the center of the core when commencing winding. This assumes, of\ncourse, that one winds the film with the emulsion toward the center of the core as\nis standard practice for raw stock.\nIn order to allow for differences in design and manufacture of various film handling\ndevices which may call for one or the other sprocket position, it is customary for\nmanufacturers of film to supply 16mm. single perforated stock in either of two\n\"winds\" which they designate as \"A Wind\" and \"B Wind.\" These can be quite easily\ndistihguished from each other by inspection and the application of a simple rule.\nAfter verifying the fact that the emulsion is on the side of the film toward the\ncore, it is merely necessary to hold up the roll of stock in such a position that\nthe outer tail of the film hangs down from the right edge of roll. When held in\nthis position \"A Wind\" stock has the sprocket perforations on the edge nearest the\nobserver, while \"B Wind\" stock has the perforations on the edge away from the ob¬\nserver. Obviously it is possible to develop a similar rule based on having the tail\nof film hanging down from the left edge of the roll. Whatever the case may be, it\nis best that one or the other rule be used consistently so as not to become confused.\nActually, film which is supplied as one type of \"wind\" can be converted to the other\ntype by the simple operation of rewinding it onto another hub with the emulsion fac¬\ning the axis."
}