{
  "id": "d1338-0",
  "text": "TV Engineering\nNewsletter\n14 Gregory Hall\nUrbana, Illinois\nn.M.ifiWfti\nPhone 7-6611, Ext. 3394\nNAEB ENGINEERING NEWSLETTER No.l\nWell here it isl Issue No.l of the NAEB ENGINEERING NEWSLETTER.\nThe first week in January we mailed a card questionnaire to all member and\nAssociate member stations of NAEB seeking the names of those chief engineers\nwe did not know. The response was very gratifying and now we have a mailing\nlist of over 100 chief engineers of educational radio and TV stations. And\npractically all of them wanted to receive an engineering newsletter.\nPerhaps this first issue will be disappointing - maybe it will be what you\nwant - at any rate it*s a beginning. If you have some ideas on what it should\ncontain, we*d be happy to have them. My feeling is that it should, and can\nbe, a medium for the exchange of information of interest to technical person¬\nnel. We*11 welcome your contributions to it and publish your articles so that\nothers can benefit by your experiences. If there*s something you want to know,\npossibly one of our readers may have the answer and by publishing your ques¬\ntion you may be able to get the solution.\nAs a starter, we thought we*d collect the material of interest to engineers\nfrom the regular NAEB Newsletter. Perhaps a few of you have read them, but\nI*m sure many of you have not. We*11 be starting with the 19$h TV Engineer¬\ning Workshop program. Many of you did not hear of it in time to apply. We\nare happy to announce that a grant has been made by the Fund for Adult Edu¬\ncation which will enable us to hold the 195£ TV Engineering Workshop. Plans\nfor it are already being made so be on the lookout for an announcement of it\nlater.\nWe*re mailing this initial issue to all who returned our questionnaire cards.\nThose who asked for more cards will be receiving them soon. Will you PLEASE\npass this copy around so that it is seen by your entire, technical staff even\nthose at the transmitter, sometimes they*re forgotten when things like this\nreach the studio. You can also be of help to us by noting if we have this\ncorrectly addressed to you. If we haven*t will you please send us a two-cent\npostcard saying \"This is jny correct address’* and be sure to print or type it\nso we can read it. Then we*11 be sure to reach you without delay.\nWe want to be of service to you. Send us your comments, suggestions, news\nitems, problems, list of equipment you need, surplus equipment for sale and\nwe*11 do our best. If there*s enough material to make this a monthly publi¬\ncation instead of bi-monthly we*11 change our plans. ^\n/(js •/ . j A\nGecil S. Bidlack\nFebruary 10, 1955\nCSB:cr"
}