{
  "id": "d1338-10",
  "text": "TV TECHNICAL TIPS NO. 3\nCecil S. Bidlack\nNAEB TV Engineer\nDeadline for the December Newsletter has been moved up to permit ye Editor, Miss\nRosaline Biason, to bask in the sun in Arizona and caught ye TV Engineer with his\ntypewriter down, so it looks like TV tips will turn into a gossip column for this\nissue.\nThe NAEB TV Engineering Workshop has passed into history and until all the returns\nare in, only the biased opinion of the writer can be given as to its success,. From\nthe attendance standpoint it was a huge success, with 100$ attendance at all ses¬\nsions except for the day Ai Boggioni of WOSU was confined to the hotel with a bug\nhe picked up in the big city. The 8:15> A.M. New York Central train to Pleasant-\nville on October 21 and 22 looked like; an NAEB. Special and on Friday (22) NAEB;/;\nExecutive Director Dr. Harry J. Skornia attended the morning session at the Gen¬\neral Precision Laboratory plant in Ossining.\nWe have received many compliments on the Workshop/and with much discussion of the\nconduct of future workshops are inclined to believe that it was a success. As a\nfirst experience, we learned a great deal about running a workshop and are anx¬\niously awaiting the critical comments of the individual members of the group to\nguide us in the future. ,\nThe Sunday meeting at the Biitmqre with the Officers and Directors of NAEB was a\nhuge success and I was very happy that the opportunity had been provided for the\nengineers to express their Views and was very much Pleased that so many took\nadvantage of the’ opportunity. Our Wednesday morning roundtable also was a good\nsession and in future workshops more time will be allotted to just such sessions as\nthis-; since the exchange of ideas seems to be one of the most valuable by-products\nof a workshop. . ,\nThe Radio Corporation of America, General Precision Laboratory, Allen, B. DuMont\nLaboratory, -National Broadcasting Company, and Columbia Broadcasting System: were\nexcellent hosts and the wan looking engineers arriving in Philadelphia On Octo---\nber lB left' New York at the end of the workshop with their cheeks filled out and\nbelts at least one notch larger. Where did you put all that food?- As Gleason\nsays, \"You«re a gooooodocrowd,\" and I*m sure* it was with a. bit of regret that we.\nhad to leave it all and return to the routine;'of our respective jobs.\nLast week I expected a flurry of reports with their accompanying expense accounts;\nbut as of this date,only about a third of the'reports of individual members are in.\nWe have placed those expense checks in'the mail.\n; * -x- -x- * -* * * x\nNAEB Headquarters is on the move! That is,' the office at lU Gregory Hall has\nbeen rearranged. The cause of the great upheaval was the purchase of a mimeo¬\ngraph machine. Only Secretary Winifred Coatney Stayed put, with the rest of us\n\"checkers\" being shifted about with great aplomb by Harold Hill. The object of\nit all is greater efficiency. Dr. Skornia, Hill, and myself are now in the \"exec¬\nutive suite\" (a corner of the big room behind a row of filing cabinets) with"
}