{
  "id": "d1338-13",
  "text": "•14-\nTV TECHNICAL TIPS NO. 4 - •\nby\nCecil S. Bidlack, NAEB TV Engineer\nThe- NAEB Engineering Committee met at the Hotel Sherman in Chicago on Friday,\nDecember. 17. Present were Chairman Carl Menzer of WSUI, Bob. Higgy of WOSU, Bert\nHolmberg of KUOM, John Brugger of WILL, Keith Ketcham of WOI and WOI-TV, and\nmyself. Cy Braum of JCET was present as a guest. Ed Kratt of WNYE could not be\npresent. The meeting had a two-fold purpose:!) to decide on future technical\nworkshops, and 2) to plan methods of carrying out a professional recognition and\nadvancement program for technical personnel.\nThe Committee has decided to ask for suggestions in planning the TV Engineering\nWorkshop for 1955. It is believed that the proper place to hold the next workshop\nis at an educational television station during the first two weeks of September.\nSubject to final approval of funds, the workshop will last five days and will be\nconducted on an advanced level with the participants limited to those with previcus\ntelevision experience. These will be people in key positions in TV organizations,\nsuch as the chief engineer or kinescope recorder operator who would be able to\nderive the maximum from the instruction given and return to their home stationSand.\npass the information on to the remainder of their staffs.\nThe Engineering Committee would appreciate your suggestions on the program of the\nworkshop. Send them to Carl Menzer, WSUI, State University of Iowa, Iowa City.\nIn order to accomplish the second objective as listed above, the Committee must\nfirst know who these people are. It directed the NAEB TV Engineer to begin the,\npreparation of a roster of Technical Personnel in Educational’ Television and\nRadio.. This will be np easy task, but with the Research Committee, which is now\nworking on a ”Who*s Who in NAEB,” and the cooperation of the membership, we should\nbe able to come up with the desired information. There also seems to be a demand\nfor an Engineering Newsletter or a supplement to the regular NAEB Newsletter which\nwould go directly to the Engineering Department instead of a file basket and then\nto the waste basket. The idea of an Engineering Newsletter was also suggested at\nthe NAEB TV Engineering Workshop held in October. It is believed that it could\nplay a vital part in the exchange of technical- information and ideas. Contribu¬\ntions from members would be gratefully accepted.\nThere was also much discussion of an NAEB Engineering Handbook, with sentiment'\nsomewhat divided as to the need for same. Perhaps the readers of this column\nmight have some ideas on the subject, if so please send them along.\nMany other items were discussed during the day, including engineering salary scales\nand job classifications. Other topics covered the NAEB Network, the possibility ■\nof forming an FM network, tape quality, standards for audio and video recording,•-\nand the possibility of holding state or regional meetings. work of the NAEB\nTV Engineer was also discussed with Committee sentiment being that he should serve\nas a clearing house for information and in an advisory'capacity rather than offer\nservices in*direct competition with consulting radio and television engineers.\nIt was good to get together. By carrying out the ideas submitted at this meeting\nduring 1955, the Engineering Committee will remain one of the most active in\nthe NAEB."
}