{
  "id": "d1338-14",
  "text": "-15-\nNAEB Executive Director Harry J. Skornia and your TV Engineer \"hit the road\"\ntogether for nine days begining November 29. They made a \"great circle\" tour with\nstops at KTJHT in Houston, FAE Headquarters at Pasadena, KTHE in Los Angles, KQED\nand the AVA Convention at San Francisco, KPFA in Berkeley and KCTS and KUOW in\nSeattle. It was a flying trip but we were able to see, hear, and watch at close\nrange, the actual programming and operation of some of our NAEB member stations.\nTraining of program, production,and engineering personnel is an integral part of\nthe operation of KUHT, KQED, and KCTS. While it may have disadvantages, it is\none way out of that bugaboo of the high operating cost associated with television\nprogramming. In Houston, students at the University man all studio operating\npositions except for a video control engineer. The KUHT transmitter is manned by\nfull-time staff engineers. In San Francisco, students at the John O’Connell\nVocational School where their main live studio is located operate the studio equip¬\nment as a part of their training, while the transmitter is manned by full-time\nemployees. In Seattle, at KCTS, the transmitter is located at the Edison Technical\nSchool. It was modified for Channel 9 and is operated and maintained by Edison\nstudents under the supervision of Nick Foster, in charge of Radio and Television\nTraining. At the studio, on the University of Washington campus, all operating\npositions are covered by students. However, Chief Engineer John Boor, or his\nassistant, line up and expand the cameras and then supervise the video operation..\nRotation and the constant changing of personnel are the most obvious disadvantages\nof the training type of operation. Does the training pay off? Just ask John\nSchwarzwalder of KUHT who lost fourteen of his students in one fell swoop when a\nnew commercial station opened in Houston and was staffed with his students. The\ngoing was rough for a while but the operation continued with the new group taking\nover and rapidly acquiring the necessary polish under operating pressure. And\ndon’t think the pressure isn’t there. KUHT sometimes does twelve live shows back\nto back in a 24 by 30 foot studio.\nKCTS was well under way towards rebuilding and rewiring their studio control room\nafter a fire which destroyed their control room equipment on November 19. Fortun¬\nately the equipment loss was covered by insurance but the sub-floor had to be\nreplaced and all wiring had to be torn out and replaced. Damage was confined to\nthe control room. The field type cameras, camera controls and power supplies had\nbeen set up in the studio and were not touched by the flames. They put their first\nlive studio program on the air December 7. Regular programming begins the first\nweek in January.\n*f if if if if if if if if if if\nTwo features not previously seen in TV studios were observed at KCTS in Seattle—\ntrolley ducts and a scenery track.\nThe trolley duct is manufactured by Trumbull Electric and consists of a metal duct\napproximately five feet long mounted on the ceiling and open towards the floor\nwhich contains two enclosed bus bars one for each side of the AC line. Wattage\nof each section of duct is 5 kw and three flat connectors may be inserted anywhere\nalong the length of the duct by compressing the spring clips on the connector.\nInternal brushes make contact with the bus bars when the clips are released. This\narrangement is a very flexible one since the clips may be plugged in anywhere along\nthe five foot strip; it also saves cable and the necessity for handling long length\nof light cable • and thus speeds up lighting. It also allowed KCTS to install\nsmaller power circuit capacity and benefit from a lower rate since the electrical\ncode required them to install sufficient capacity to supply full power to every\nelectrical outlet."
}