{
  "id": "d1338-17",
  "text": "-18-\nTV TECHNICAL TIPS No. 5\nby\nCecil S. Bidlack, NAEB TV Engineer\nNewsletter deadline time is here again and once more the heading of this column\nshould read '’Wanderings of the NAEB TV Engineer\" rather than the above. Two\nweeks out of the office are not very conducive to the preparation of technical\ntips. However, perhaps by detailing some of my experiences, my readers (if any)\nmay pick up some ideas which might loosely be construed’.: as technical tips.\nJanuary 10 and part of January 11 were spent in Memphis at the request of Keith\nNighbert. We inspected possible studio and transmitter locations; met with Mr.\nJulian Bondurant and Mr. Robert Pharr of the Board of Executive Trustees of the\nMemphis Community Television Foundation to discuss their problems; and made recom¬\nmendations. We can report optimism that progress is being made towards obtaining\nwhat promises to be a source of continuing financial support which, if secured,\nwill permit the Board to obtain studio and transmitter sites, hire a staff, and to\nrealize their long sought goal of seeing educational Channel 10 on the air in\nMemphis.\nLate afternoon of January 11 found us in Tuscaloosa, Ala., where NAEB Past President\nGraydon Ausmus and WUOA Chief Engineer Joe Stuckey proudly showed us how work was\nprogressing on the remodeling and expansion of their present FM studio facilities\nfor television. Work was well along on the masonry for the second floor. With\ncontinued good weather they hope soon to have the addition under roof and the\nbuilding completed by March 1. The additional space will give them one 38 by 50\nfoot TV studio, one 14 by 20 foot TV studio, a TV control room, a large shop for\nthe construction of scenery and props, a kinescope recording and processing room,\nengineering shop, ample office space, dressing rooms as well as space for the FM\nstudios and transmitter. A 200 foot micro-wave tower was already erected, the\nmicro-wave equipment installed in the FM control room, and passive reflector\nmounted on the tower. The micro-wave dish and transmitter head were on hand, with\ncompletion of the installation held up until outside building construction was\nfinished. The WU0A-FM antenna will be side mounted on the micro-wave tower and\nStuckey was busy with hack saw, tubing, and blow torch revamping the antenna for\ntheir 91.7 me frequency. The University of Alabama studios will be one of three\nprogram originating points for the Alabama Educational TV Network. The Channel 7,\nMt. Cheaha (Munford),transmitter wenton the air with its first film program on\nFriday, January 7, 1955. Other transmitters will be located at Birmingham (Channel\n10) and Andalusia (Channel 2). Studios will also be located at Birmingham and\nAuburn (under construction) with future studios planned at Montgomery and Mobile.\nTuesday evening we spent screening kinescopes from the ETRC Center at Ann Arbor.\nWednesday morning we drove Graydon to Birmingham to the new building of the Exten¬\nsion Division of the University of Alabama to the office of Rudy Bretz. We\nbrought good luck in the person of the telephone installer who was connecting\ntheir phones. Incidentally the- number is 53-5602. Chief Engineer James Evans\nhas set up a temporary control room in the outer office with two G.E. camera\nchains, switcher, and sync generator with a temporary studio in the adjoining\nbuilding auditorium. The studio is \"hot\" daily from 3:30 until 5 p.m. during which\ntime Rudy is training a number of people in the many skills required for live\nstudio operation. He is also helping with promotion and publicity. I accompanied"
}