{
  "id": "d1338-18",
  "text": "-19-\nhim to the WABT (commercial) studios atop a hill overlooking Birmingham where\nRudy appeared as a guest being interviewed on an afternoon TV program. He dis¬\ncussed the programs soon to be seen on Channel 7 in Birmingham from the transmitter\non Mt. Cheaha. Incidentally viewers reported good reception of the initial broad¬\ncast over a wide area. We did not attempt to visit the transmitter site on Mt.\nCheaha since I have been invited to return'to Tuscaloosa again. At the time their\nstudio goes on the air we will- help them get started and also be checked out with\nthem on their GPL kinescope recorder and film processor. I left Birmingham on\nthe 4 p.m. plane for Raleigh-Durham and Chapel Hill and WUNC-TV.\nThursday morning (13th) Robert F. Schenkkan, Director of Television for the; Con¬\nsolidated University was contacted and soon turned me over to Alan MacIntyre who\nis Chief Engineer for the entire system. I accompanied Alan to the studio in .\nSwain Hall on the Chapel Hill campus, to the transmitter on Terrell's Mountain in\nChatham County eight miles from the campus and to the micro-wave relay station on\nCane Creek Mountain. Friday I visited the studio in Raleigh and on Saturday the\nstudios in Greensboro.\nNorth Carolina can truly claim to be the world's first educational television\nnetwork. It has three live programming studios^at Chapel Hill, Raleigh and Greens¬\nboro. Its viaicon film chain is located at the transmitter where the switching\nbetween studios is accomplished. It has a small bus which has been converted\ninto a mobile unit and which has already been used several times for programs\noutside the studios. It is programming from 3:30 to 10 p.m. daily and from 6 to\n10 p.m. on Saturday and Sunday-with a majority of these hours being live'program¬\nming.\nThe North Carolina network is completely RCA-equipped. The Raleigh studios at\nState College are located in a new building designed especially for television.\nIn addition to the 10,050 sq. ft. of studio space and its associated announce\nbooth and control, it has a large scene shop, art studio, dressing rooms, and\noffice space. It is equipped with two RCA studio type cameras and also has a pro¬\njection room which is not equipped. In Greensboro, studio facilities are located\non the campus of Woman's College where a laundry building has been remodeled to\ngive a 11,210 sq. ft. studio plus all the other necessary television facilities.\nIt, too, is equipped with two RCA studio type cameras and has an unequipped pro¬\njection room. In Chapel Hill, Swain Hall as been remodeled from a cafeteria to\nprovide 11,241 sq. ft. of studio space and is equipped with two RCA field type\ncameras and controls. At present, these are installed in the mobile unit when\nthe occasion demands field use.\nThe transmitter is an RCA type TT25BL and is located on Terrell's Mountain with\nan effective radiated power of 100 kw from a six bay RCA antenna rising 798.5 feet\nabove ground. Excellent reports of reception have already been.received from many\nparts of. North Carolina and surrounding states. The Chapel Hill' and Raleigh\nstudios beam their video and multiplexed audio signals by micro-wave on one hop\nto the transmitter while the Greensboro studio micro-wave signal is repeated at\nan unattended relay station at the top of Cane Creek Mountain. Five complete\nmicro-wave units are used, two Raytheon and three Philco units, with audio being\nmultiplexed on the video carrier in the 7000 me band. At the time of my visit\nWUNC-TV engineers were working with factory representatives to eliminate video\ncrossover into the audio channel. In addition to the local and long distance\ntelephone system there is a 26 me radio cue link between studios and transmitter.\nAs I left, MacIntyre was. looking for a two-headed engineer with eight arms for the\ntransmitter. Such a beast could easily do the necessary switching between the"
}