{
  "id": "d1338-20",
  "text": "-21-\nby General Electric from a distribution amplifier to a $0 kw television trans¬\nmitter is tested in its place in a normally functioning television system before\nbeing packed for shipment, Friday morning January 21 found me back at my desk\nin Gregory Hall trying to get back into the swing of office routine.\nNEW TV PROJECTOR AVAILABLE\nTo meet the universal need for equipment with which to project a television\nimage on a screen large enough to be viewed by several hundred people, the Fleet-\nwood Corporation, of Toledo, Ohio, announced recently the immediate availability\nof its model FL-1001 Television Projector.\nCapable of projecting a clear, bright, well defined picture up to 9 foot by 12\nfoot, this new and completely mobile piece of equipment can be used in individual\nclassrooms for special groups, in large auditoriums to cover the entire student\nbody, PTA organizations, as well as for sales demonstrations and closed circuit\nconferences. The unit is designed to be used in those places where community\nwatching is the only way large groups can view television programs.\nThe FL - 1001 is completely self-contained in a functional heavy duty metal cabi¬\nnet which houses built-in speakers for smaller groups; plug-in facilities for\ndriving remote speakers; a television receiver capable of receiving all channels;\nand is equipped to receive a television signal direct from network lines.\nPower supplies, amplifiers, and video units are mounted on sliding racks, offer¬\ning immediate accessibility for service. The FL-1001 operates on 110 volt alter¬\nnating current. Channel selector audio control, and focus regulators have been\nengineered for simple, easy operation. Overall size of the unit is 2k\" wide,\n36m deep and U8\" high; unit has an approximate shipping weight of 1*00 pounds.\nx -SC- -* x x X -SC- * x x\nALABAMA EDUCATIONAL TV ON THE AIR\nThe nation*s first state-wide ETV network entered its initial stage\nof active programming when Munford—main link in Alabama*s ETV net¬\nwork—started regular telecasting on January 7. The Munford trans¬\nmitter is connected by micro-wave relays to Birmingham, University,\nand Auburn, and Andalusia.\n■sc- -sc- X XXX X X X X X\nThe Federal Communications Commission made final on January 13\nits plan to give Michigan five more educational TV channels. This\nbrings to 16 the number assigned to the state.\nThis makes 25'7 channels now reserved exclusively for education\nin the nation."
}