{
  "id": "d1338-4",
  "text": "-5-\nThe above will give some idea of the scope of the NAEB Engineering Service to\ndate. It was established to serve educational television in general and NAEB\nmembers in particular. To be helpful, we must know how or along what lines you\nneed help. That is one reason Bidlack is visiting educational television sta¬\ntions now on the air. Data on technical facilities of existing educational\nTV stations is being compiled and will be distributed on request. He has plans\nto conduct a survey of engineering department salaries, working conditions,\netc. of member stations. He will use the Newsletter to provide technical tips\nwhich may be helpful. Let him know how he can serve you.\nNAEB NAMES PARTICIPANTS IN TV ENGINEERING WORKSHOP\nTwenty-six persons were named by the NAEB Engineering Committee as participants\nin the NAEB Television Engineering Workshop to be held in the New York Area\nOctober 19 through 27* During the Workshop the participants will visit the\nRadio Corporation of America, DuMont, and General Precision Laboratories in\nthe area in addition to various discussions and demonstration of television\nequipment.\nThose named to the Television Engineering Workshop are:\nLawrence Anderson, University of Wisconsin\nWilliam Gordon Benson, Station KUOM, University of Minnesota\nJames H. Bonney, Station WBUR, Boston University\nLawrence A. Brogger, Station KUOM, University of Minnesota\nA. J. Boggioni, Station WOSU, Ohio State University\nCyril M. Braum, JCET, Washington 6, D.. C.\nJohn R. Brugger, Station WILL, University of Illinois\nCharles W. Brooke, Jr., Station WQED-TV, Pittsburgh, Pa.\nK. Winston Bugg, Station WABE, Atlanta Board of Education\nGerard Colliot, Radiodiffusion Francaise\nHarold D. Gorsuch, Station WOSU, Ohio State University\nCharles E. Houston, Texas Technological College\nLawrence A. Larson, Station KUOM, University of Minnesota\nProf. E. M. Lonsdale, State University of Iowa\nCarl Menzer, Station WSUI, State University of Iowa\nGuy H. Peden, Jr., Station WOSU, Ohio State University\nC. D. Phillips, State University of Iowa\nWalter Rechenberg, Jr., Station WQED-TV, Pittsburgh, Pa.\nFrederick M. Remley, Jr., University of Michigan\nRobert Schlorff, Station WDET, Wayne University\nW. Worcester Smith, University of Massachusetts\nJoseph E. Stuckey, Station WUOA, University of Alabama\nRalph R. Townsley, Station WBAA, Purdue University\nJohnny F. Wahlfeldt, Television and Motion Pictures, Univ, of Illinois\nGordon Ward, Station TWDTR, Detroit Board of Education\nNoyes W. Willett, Radio House, University of Texas\n' *X- -X- -X- -X- -X- # -x- -X- -Xc -x-\nRCA has developed a wireless lapel microphone which Jack Lescoulie demonstrated\non the NBC \"Today\" show recently. It is expected the new mikes will be in pro¬\nduction before the end of the year."
}