{
  "id": "d1338-8",
  "text": "-9-\nTV TECHNICAL TIPS NO. 2\nCecil S. Bidlack\nNAEB TV Engineer\nIf Educational Television is to build the audience it deserves, staff members of\nthe individual stations must be super critical not only of program content and\nproduction but of the technical aspects of its operation as well. Contributing\nto the popularity of the educational radio station was the fact that there were\nno commercials, the programs included considerable good music, both classical and\npopular, and the technical standards of the station could be maintained fairly\neasily. Because of its complex nature, a good educational television program\nwill be achieved only if careful attention is given to details of program, pro¬\nduction, and engineering.\nOn the program side, educational television cannot hope to compete on a populari¬\nty basis with the network extravaganzas whose single program budget would run the\neducational station for a year. However there is enough sameness in commercial\nprogramming so that educational stations can appeal to those discriminating people\nwho are tired of variety shows, hard luck stories, and often-repeated movies. On\nthe production side, we can compete, especially at the local level, with other\nstations in the community. Engineering-wise we are in direct competition . Good\npicture quality and operating practices are a big help to program and production\nin putting their output across to the public.\nFirst let's talk about television audio. Everyone concentrates on the picture\nand audio is only incidental to those just starting in television production. As\na check on your audio quality turn the picture off and listen critically to TV\naudio in a quiet room. You’ll be amazed at the things you can hear. Most control\nrooms are noisy—there’s air conditioning.noise, blower noise and conversation.\nNo wonder we are not aware of studio noises made by talent, the shifting of props,\nand the shuffling of the cameramen’s feet as they dolly in and out, or the noise\nof the floor man whipping his PL cable to get more slack. If you add to this no\nsound treatment in the studio, a faulty boom mike suspension, and no effort to\ntalk the boom mike into a proper position, (as low as possible and out in front\nof the performer) you are operating near the point where reflected sound entering\nthe microphone almost equals the direct sound pick up. These conditions are not\ndreamed up—they were actually observed by the writer recently at at least one\neducational TV station.\nWe should be continuously striving for the best in picture quality. How can you\njudge picture quality on poor monitors? Yet I have seen a station where the only\nsatisfactory monitors operating with good contrast were the two field type camera\ncontrols with seven inch kinescopes..\nGood focus is one of the fundamentals of a good picture. You can have everything\nelse right; but if the picture is soft, it’s a poor picture. Personally I can’t\nenjoy a movie due to my television experience since I am constantly mentally try¬\ning to sharpen the focus. And many times it isn’t my imagination. I have observed\na test pattern on the air which looked soft, yet when I asked the video engineer\nif they checked focus on the test pattern slide, he assured me it wasn’t necessary,\nsince the slide projector had been focused. Yet when I focused the projector the"
}