{
  "id": "d433-88",
  "text": "ARTICLE III\nMeetings\nSection 3. 01. Annual and Special Meetings. Annual meetings of members\nshall be held either within or without the State of Illinois. An1 annual meeting shall\nbe held each year between the third Tuesday of October and the third Tuesday of\nNovember on a day and at an hour to be determined by the Board of Directors, pro¬\nvided that the meeting sites shall be selected by the Board three years in advance\nand on the following rotational basis: starting in 1965, and each fourth year there¬\nafter, the annual meeting shall be held in the District of Columbia; starting in 1967,\nand each eighth year thereafter, the annual meeting shall be held in the West;\nstarting in 1970, and each eighth year thereafter, the annual meeting shall be held\nin the East; starting in 1972, and each eighth year thereafter, the annual meeting\nshall be held in the South. All other annual meetings shall be held in the Midwest.\nSpecial meetings of the members may be called by the Board of Directors, the\nPresident, the Secretary or by members having one-tenth of the votes entitled to\nbe cast at such meeting.\nSection 3. 02. Notice of Meetings. Written or printed notice stating the\nplace, day and hour of any meeting of members shall be delivered, either person¬\nally or by mail, to each member entitled to vote at such meeting, not less than\nfive nor more than forty days before the date of such meeting, by or at the direc¬\ntion of the Board of Directors, the President, the Secretary or persons calling\nthe meeting. In case of a special meeting, the purpose for which the meeting is\ncalled shall be stated in the notice. If mailed, the notice of a meeting shall be\ndeemed delivered when deposited in the United States mail addressed to the mem¬\nber at his address as it appears on the records of NAEB, with postage thereon\nprepaid.\nSection 3. 03. Quorum. The members having one-tenth of the votes which\nmay be cast at any meeting shall constitute a quorum at such meeting. If a quorum\nis not present at any meeting of members, the majority of the members present\nmay adjourn the meeting from time to time without notice.\nARTICLE IV\nRegions and State or Area Chapters\nSection 4. 01.\n(a) Regions. The Board of Directors shall designate areas within the geo¬\ngraphic limits of the United States to compose Regions and may change such desig¬\nnations from time to time upon the approval of a majority of the voting members of\nNAEB.\n(b) Regional Councils. A Regional Council of NAEB shall consist of the\nDirectors of NAEB residing in each Region together with the Presidents of state or\narea chapters, if any, resident in such Region. In the event no NAEB Divisional\nDirector is resident in any such Region, each respective Division Board may de¬\nsignate a Regional Councilman for such Region. Each Regional Council shall hold\nannual or more frequent regional meetings for the purpose of electing officers and\nconducting such other activities as may advance the purposes of NAEB in that\nRegion.\n-7-"
}