{
  "id": "d433-91",
  "text": "be called by the President or, if he is absent or is unable or refuses to act, by any\nthree directors.\nSection 5. 12. Organization of Directors* Meetings. At all meetings of the\nBoard of Directors, the Chairman of the Board, or, in his absence, the Vice-\nChairman of the Board, or, in the absence of the Chairman of the Board and the\nVice-Chairman of the Board, a chairman chosen by a majority of the directors\npresent, shall act as chairman of such meeting and preside thereat* The Secre¬\ntary, or, in his absence, an Assistant Secretary, shall act as Secretary at all\nmeetings of the Board of Directors. In the absence from any such meeting of the\nSecretary and all the Assistant Secretaries, the chairman of the meeting may ap¬\npoint any person to act as Secretary of the meeting.\nSection 5. 13. Notice of Meetings - Waiver. Notices of the annual meetings\nshall be given not less than five nor more than forty days prior to the date thereof\nand notices of any regular or any special meetings shall be given not less than five\nnor more than forty days prior to the date thereof. Each notice shall specify the\nplace, the date and hour of the meeting, and, in the case of special meetings, the\ngeneral nature of the business to be transacted thereat. Notice may be given to\nany director personally, by mail, or by telegram, charges prepaid, and may be\nwaived in writing by any director, either before or after the meeting. Notices of\nadjourned meetings need not be given except when the adjournment is for a period\nof thirty days or more. Notices shall be given by the Secretary or, if he is ab¬\nsent, by an Assistant Secretary, or, if they are unable or refuse to act, by any\ntwo directors.\nSection 5. 14. Quorum - Adjournment. The presence of one-third of the\nmembers of the Board of Directors shall constitute a quorum for the transaction\nof business. In the absence of a quorum, any meeting may be adjourned from\ntime to time by the vote of a majority of Directors present thereat, but no other\nbusiness may be transacted except as provided in Section 5. 09 of this Constitution\nand By-laws. At any such adjourned meeting at which a quorum is present, any\nbusiness may be transacted which might have been transacted at the meeting as\noriginally noticed.\nSection 5. 15. Consent to Meetings. The transactions of any meeting, how¬\never called and noticed, shall be as valid as though had at a meeting duly held after\nregular call and notice, if a quorum be present, and if, either before or after the\nmeeting, each of the directors not present in person signs a written waiver of no¬\ntice, or consent to the holding of such meeting, or an approval of the minutes there\nof. All such waivers, consents, or approvals shall be filed with the corporate\nrecords or made a part of the minutes of the meeting. Any action which, under\nlaw, may be taken at a meeting of the Board of Directors may be taken without a\nmeeting if authorized by approval in writing signed by all of the directors and filed\nwith the Secretary of NAEB.\nSection 5. 16. Voting Rights - Proxies Prohibited. Each director including\nthe ex officio Director shall be entitled to one vote. No director may vote by proxy\nARTICLE VI\nDivision Boards\nSection 6.01. Division Boards. The Board of Directors may, by resolution\nadopted by a majority of the directors in office, designate and appoint those\n- 10-"
}