{
  "id": "d1676-18",
  "text": "A Non-Partisan Citizens’ Organization for Public Service\nThe NATIONAL ECONOMY LEAGUE\nNational Headquarters\n280 Madison Avenue\nNew York, N. Y.\nAshland 4-2480\nDecember 15, 1934\nWith great respect I write to ask the nature of the\nimpression that would be made upon you if the holders of the\n128,000,000,000 worth of United States government bonds now\noutstanding should demand that you make a law requiring our\ngovernment to pay off the whole $28,000,000,000 right away\nalthough most of it is not due for many years to come. Would\nthis impress you as a fair demand? If financially possible,\nwould it be a wise and trustworthy protection of the interests\nof the whole American people whom you represent in the Congress?\nIf so, would you think well of trying to raise the\nwhole $28,000,000,000 at once by taxation, or trying to borrow\nit from somebody else, or avoiding both of these disagreeable\nendeavors by running the whole sum off the printing press in\nnew additional money? You would have in mind that such a de¬\nmand for immediate payment, if made upon you, would represent\nthe insistence of thousands and thousands of little American\ndepositors - all of them American voters - in the American\nbanks which hold the bulk of the bonds.\nI think I understand the impatience with which you\nhave read this letter thus far.\nBut is there any difference, save in degree, be¬\ntween such a demand and the demand of some of the veterans of\nthe last war that you pay off to them right away the bonus\nthat is not due until 1945, ten years away? What is the\nnature of the impression that this bonus demand makes upon you?\nNow the demand for immediate payment of the national\ndebt is, thank heaven, not likely to be made, but the bonus\ndemand lias been made and will be made again the moment the\n74th Congress, of which you are a member, convenes three weeks\nhence. Immediate payment of this bonus, which was accepted by\nthe veterans as an obligation due in 1945, and not in 1935,\nwill cost the rest of the American people well over\n$2,000,000,000. Will you take this out of us in taxes all at\nonce, or try to borrow it from somebody else, or run it off the\nprinting press in inflated money?"
}