{
  "id": "d1676-2",
  "text": "naeb members represented at radio conference\nThe NAEB and several member stations were represented at the First National Con¬\nference on Educational Broadcasting held in Washington on December 10-11-12. A pro¬\ngram of the sessions is included in the January exchange packet.\nAmong those present were several Association officers: President H. B. McCarty,\nVice-President Carl Menzer, Secretary H. A. Engel, and three members of the Execu¬\ntive Committee? C. E. Daramon, R. C. Higgy, and C. A. Taylor. Present also were Mr.\nJos. F. Wright of Illinois, Major Garland Powell of Florida, Mr. A. 0. Lee of St.\nOlaf College. Practically all of these had scheduled places on the program or par¬\nticipated in the sectional meeting discussions.\nAs one of the agencies sponsoring the Conference, the NAEB was well represented.\nAmong the 718 persons registered, the break-down shows this division:\n227 from national educational organizations\n141 from colleges and universities, and public school systems\n109 from Government agencies\n59 from commercial broadcasting companies and agencies\n33 from libraries and museums\n25 representatives from 17 foreign countries.\nContrary to the reports in the commercially-minded press that the solution to\nthe radio education problem would come through the improvement of programs by educa¬\ntors, observers took away other ideas. There was ample evidence of a continued\ndrive to further entrench the \"American System\". On the other hand came a strength¬\nened conviction that the fundamental limitations of commercially dominated facilities\nwill never permit the ful?.est exploration and development of radio as an educational\nforce.\nIf anyone had any doubts as to the desirability of the control by education of\nadequate broadcasting facilities, they must have disappeared. This reaction came\nin spite of the precautionary warning that \"any discussion of such controversial\nsubjects as the allocations of wave-lengths will be scrupulously avoided\".\nSecretary of Interior Harold Ickes welcomed the guests to the conference and\nsignificantly acknowledged the potentialities of radio as an educational aide. He\ncommended the radio program experimentation being carried on by the federal office\nof education.\nChairman Anning S. Prall, in speaking on \"American Radio\" slapped the present\nsystem on the back and stood firm for the status quo. Educators saw little hope in\nhis remarks for any improvement in their status.\nJohn W. Studebaker, U. S. Commissioner of Education, made a plea in behalf of\nthe interests of education for continued efforts in the adaptations of radio. The\nlast of six goals listed was \"more adequate support for educational stations.\"\nHondrik Willem Van Loon, author and journalist, added a touch of humor to his\nstory of the \"Social Responsibility of Broadcasting\". He rapped the failure of\nbroadcasters to.prepare and plan adequately for educational broadcasts, criticized\nlengthy commercials, and favored private ownership of radio."
}