{
  "id": "d1196-1",
  "text": "The Institute for Education by Radio, an activity of the Bureau of Educational\nResearch, was established in 1930 at the Ohio State University. Its purpose is to\nprovide an annual meeting for joint discussion by broadcasters, educators and civic\nleaders of the problems of educational broadcasting. The program is devoted chiefly\nto consideration of the techniques and program policies of radio broadcasting. The\nInstitute passes no resolutions, and its officers are limited to an honorary director,\nW. W. Charters, founder of the Institute; a director, I. Keith Tyler, Director of\nRadio Education; and an executive secretary, Ardis Hillman Wheeler, both of the\nOhio State University. The annual program is developed from the suggestions and\nrecommendations of those attending the Institute in previous years. The committee\non the 1947 program consists of the Institute officers with the addition of William H.\nEwing, Program Supervisor, Station WOSU; A1 Albinger, Program Director, Sta¬\ntion WCOL; Irwin A. Johnson, Director of Public Service, Station WBNS; and\nJohn Moses, Production Manager, Station WHKC—representing Columbus radio\nstations; and T. C. Holy, Director, Bureau of Educational Research; Herschel\nNisonger, Chairman, University Radio Education Committee; and Harrison B.\nSummers, Professor of Speech—representing the Ohio State University.\nThe Exhibition of Educational Radio Programs is again a feature of the Insti¬\ntute. This year’s is the eleventh such competition. All network entries are being\nevaluated by a special panel of judges in New York City; James Macandrew, Co¬\nordinator of Programs, Station WNYE, New York City Board of Education, serves\nas New York coordinator. Programs from stations, regional networks and organiza¬\ntions, after being sifted by preliminary screening committees, will be judged in\nColumbus during the week preceding the Institute. The final judges for the 1947\nExhibition are: Robert Saudek, Director of Public Affairs, American Broadcasting\nCompany; Dorothy Blackwell, Assistant Director of Audio-Visual Education, St.\nLouis Public Schools; and E. W. Ziebarth, Education Director, Central Division,\nColumbia Broadcasting System. Grateful acknowledgment is made to all these per¬\nsons for their loyal and gracious service to the advancement of radio education. The\nawards will be announced at the general session on Saturday morning, May 3."
}