{
  "id": "d1196-5",
  "text": "SATURDAY MORNING\nAddress: Howard Wilson, Carnegie Endowment for International Peace; and\nDeputy Executive Secretary, Preparatory Commission for UNESCO\nPanel Discussion\nHerbert Abraham, UNESCO Relations Staff, United States Department of\nState\nFloyd Brooker, Chief, Visual Education Section, U. S. Office of Education;\nSpecialist on Educational Films at London and Paris Conferences\nG. L. Carnes, Liaison Officer for UNESCO, United Nations\nArno Huth, Authority on European and International Broadcasting, Geneva\nand New York City\nR. S. Lambert, Supervisor of Educational Broadcasts, Canadian Broadcasting\nCorporation; formerly Counsellor on Radio for UNESCO\nI. Keith Tyler, Director, Institute for Education by Radio, Discussion\nChairman\nDiscussion from the Floor\nJudges’ Report on the Eleventh American Exhibition of Educational Radio Programs\nSATURDAY AFTERNOON\nWORK-STUDY GROUPS, First Session\nAll Groups Meet at 2:00 p. m.\nThe work-study groups devote themselves intensively to problems in the general fields indicated.\nEach chairman has selected a panel of resource persons to give expert advice. The agenda for each\ngroup has been developed by the chairman through correspondence with members.\nAgricultural Broadcasts\n2:00 p. m.. Parlors H, I, J\nChairman: Larry Haeg, Farm Service Director, Station WCCO, Minneapolis; and\nPresident, National Association of Radio Farm Directors. Secretary: Dana\nReynolds, Information Specialist, Radio Service, United States Department of\nAgriculture\nTopic: Clinic on Farm Broadcasting\nTranscriptions of outstanding agricultural programs will be played and discussed.\nAllen Miller, Director, Rocky Mountain Radio Council, Denver, Discussion Chairman\nThe Junior Town Meeting\nProgram Arranged by Junior Town Meeting League and Educational Film\nLibrary Association\n2:00 p. m.. Parlors A, B, C\nCo-Chairmen: I. C. Boerlin, Pennsylvania State College, and President, Educational\nFilm Library Association; and W. Linwood Chase, Boston University, and Presi¬\ndent, Junior Town Meeting League\n6"
}