{
  "id": "d1196-7",
  "text": "SATURDAY AFTERNOON\nChildren's Programs\n2:00 p. m.. Ballroom\nChairman: Dorothy Gordon, Moderator of Youth Forums, The New Yor\\ Times\nA portion of this program will be broadcast over the Mutual Broadcasting System,\n3:30-4:00 p. m., EST.\nTopic: Is Radio Meeting the Needs of Our Children?\nEdward M. Brecher, General Manager, Station WQQW, Washington, D. C.\nDr. Iago Galdston, Executive Director, Medical Information Bureau, New York Academy of\nMedicine\nEdgar Kobak, President, Mutual Broadcasting System\nLouis A. Lurie, Director, Child Guidance; Assistant Professor of Psychiatry, Medical College,\nUniversity of Cincinnati; Assistant Editor, American Journal of Orthopsychiatry\nMrs. James C. Parker, Vice-President, National Congress of Parents and Teachers; and\nPresident, Camp Fire Girls, Inc.\nJulius Yourman, Director of Research and Counseling, New York State Division of Veterans’\nAffairs; and Educational Adviser, National Self-Government Committee\nPanel 'Participants\nLouis G. Cowan, Radio Production, Inc., “Quiz Kids”\nOlga Druce, Benton and Bowles, Inc., New York City; and producer-director of “House of\nMystery”\nJosette Frank, Staff Adviser to Children’s Radio Committee, Child Study Association of\nAmerica, New York City\nMarcelle LaMonte, Coordinator of Radio, General Mills, Inc.\nJames F. Macandrew, Coordinator of Programs, Station WNYE, New York City Board of\nEducation\nThe Rev. Everett C. Parker, Director, Joint Religious Radio Committee\nAlbert N. Williams, Radio Editor, Saturday Review of Literature\nMusic Broadcasts\n2:00 p. m.. Room 216\nChairman: Abram Chasins, Music Consultant, Station WQXR, The New Yor\\\nTimes, New York City\nTopic: Is the Musical Public Adequately Serviced by Radio?\nTed Cott, Director of Programs and Operations, Station WNEW, New York City\nCharles R. Delafield, Supervisor of International Exchange Broadcasts, Canadian Broad-\n^■'\"\"\"Tasfing^^riwi^on\nFranklin Dunham, Chief of Radio, U. S. Office of Education\nSylvan Levin, Ifusic Director, Station WOR, New York City\n^ Burton Paulu, Manager, Station KUOM, University of Minnesota\nRadio Research\n2:00 p. m.. Parlor G\nChairman: John Gray Peatman, Associate Dean and Associate Professor of Psy¬\nchology, City College of New York; and President, Office of Research, New\nYork City\nThe PGR Approach to Show Doctoring. Sherman P. Lawton, Coordinator of\nRadio, University of Oklahoma"
}