{
  "id": "d1692-3",
  "text": "by TIO sponsors, and to alert them to materials and services\nwhich station staffs can use. . .\n• What Is NHK Doing is the title of a monthly report being\nissued by the Japan Broadcasting Corporation. Copies are\nfree of charge, and the contents may be freely used. Write the\nPublic Relations Board, Nippon Hoso Kyokai, Tokyo, Japan.\n• In its 147-page report, the Special Committee on Con¬\ntinuing Education in Alaska outlines major centers of con¬\ncern and suggests possible approaches to solutions. These rec¬\nommendations were made after a 15-month study by the\ncommittee, a group of distinguished Canadian and United\nStates educators. Under the area headed “Extension of In¬\ntellectual and Cultural Resources,” of 19 recommendations\nmade, 8 have to do with educational broadcasting.\nExperts Study Communications in India\nThe Ford Foundation has sent a group of specialists to India\nto examine the country’s communications system, recommend\nfuture development. The four are Robert B. Hudson, pro¬\ngraming vice president, NETRC; Wi'lbur Schramm, director\nof Stanford’s Institute for Communication Research; C. R.\nCarpenter, Pennsylvania State University; and Lloyd Som-\nmerlad, a newsman from Australia.\nFar East Has Opening for ER Specialist\nThe NAEB has been asked to make recommendations for a\nspecialist in educational radio to assist a Far East country\nwith developing and writing course material at the elemen¬\ntary level. The specialist should be able to train local educa¬\ntors in both writing and producing radio lessons, which will\nbe designed to supplement the instructions presently offered\nin village schools. Fluency in French is required; and the\nassignment will be for a period of one year beginning ap¬\nproximately July, 1963.\nNAEBers who are interested in being considered for this\nassignment should contact the Placement Office, NAEB\nWashington Office.\nPLACEMENT\nPERSONNEL AVAILABLE\n(For information, write Mrs. Jacqueline Swain, Placement Serv¬\nice, at the NAEB office in Washington.)\nMarch I—ETV management or production. M.A. in communi¬\ncations; currently represents NEA on nationally televised\npublic-affairs series on ABC-TV network; formerly pro¬\ngram manager and producer-director for university ETV\nstudio; 7 years industrial experience in management, ad¬\nvertising, and public relations. Age 34, married, 3 chil¬\ndren. Location open; salary minimum $10,000.\nMarch 2—Young lady would like position in the creative end\nof ETV; writing, sets, properties. B.A. in English, minors\nin art, radio and TV. Age 22, single. Location open in\ninterest of gaining experience; $4,000 minimum.\nMarch 3—ETV management/administration. M.F.A. radio-TV;\nexperienced in all phases of radio-TV; 2 years with\nlarge NY military TV production center as special proj¬\nect officer and chief of research branch. Prefers ETV\nposition where administrative experience and national\ncontacts may be utilized. Married; military obligations\nfulfilled Feb., 1963. Salary minimum $8,500.\nMarch 4—Executive position in production-direction, station\nmanagement. Ph.D. in sociology (mass communications);\n10 years commercial network experience in production.\nMale, age 38. Five figure salary.\nMarch 5—Experienced international broadcaster-teacher seeks\ncreative-administrative post with liberal arts college as\nprogram manager for radio-TV. Will complete Ph.D.\n1964 in international TV program exchange; welcome\nteaching or research assignment in comparative broad¬\ncast structures. Age 39, single, Protestant. Salary mini¬\nmum $8,000.\nMarch 6—Responsible programing or management position\nM.A.; experienced in radio, television, and film. Age 29,\nmarried male. Slight preference for Southwest; will\nseriously consider any location; minimum salary $6,500\nMarch 7—Mature, creative woman broadcaster seeks program¬\ning position in educational station aiming for excellence.\nM.A. in speech and drama with extensive training in\neducational and community theater directing; added ex¬\nperience in speech and drama teaching on college level;\n10 years commercial and educational broadcasting ex¬\nperience. Will consider any location in or outside U. S.;\nsalary not less than $6,000.\nMarch 8—Creative, imaginative young man desires position\nwith administrative responsibilities with progressive sta¬\ntion; will consider producer-director position with ad¬\nvancement. B.A. degree; experienced in both educa¬\ntional and commercial TV fields; presently employed as\nproducer-director with Midwest educational station. Age\n35, married, 2 children. Prefers Northeast, West Coast,\nArizona, or Florida; salary, $7,500.\nMarch 9—Young woman with recent M.A. in TV will be avail¬\nable for position stressing TV production and directing\nin fall, 1963. Wide production experience includes ex¬\ntensive work with directing of musical programs; pres¬\nently employed as full instructor and director of broad¬\ncasting activities in a midwest college. Prefers western,\nsouthwestern metropolitan location, but primarily desires\na creative and expanding TV situation.\nMarch 10—Graduate assistant from Temple University depart¬\nment of ITV desires production-direction position in in¬\nstructional TV field. M.A. in communications in June.\nBest assets: references and experience. Male, age 23.\nLocation open.\nMarch I I—Science specialist desires opportunity to improve\nscience instruction. Doctorate; 4 years ETV science co¬\nordination, production, and presentation at all school\nlevels; 20 years classroom experience.\nMarch 12—A 21-year-old single woman desires job as pro¬\nduction assistant at an ETV station on the East Coast\nor West Coast. Stanford graduate with A.B. in anthro¬\npology and honors in social sciences. Secretarial skills\nand background of interests and experiences applicable\nto ETV.\nPOSITIONS AVAILABLE\n(In order to be considered by these institutions, the reader\nmust be an Individual Member of the NAEB, with credentials\non file with the NAEB Placement Service. Non-members can\nsave time by sending the $10 annual dues and $5 Placement\nregistration fee at the time of inquiry.)\nM-l—Instructor in radio-television. Must be able to teach\ncourses in television production and directing, as well as\nproducing and directing television programs; extensive\nwork in area of CCTV. M.A. required. Southern college;\nposition open July 15.\nM-2—Experienced ETV producer to join staff on a permanent\nbasis to create and develop ETV series for national dis¬\ntribution via NET. Particular qualifications include cre¬\nativity, as expressed in new ideas as well as new treat¬\nments for TV of old ideas; the ability to find and develop\ntalented people; and the ability to make mature and edu¬\ncated judgments about a wide variety of program needs.\nMidwest ETV association; salary, $8,000-$10,000.\nM-3—Di rector of radio and TV. Involves two areas of respon¬\nsibility: general manager of FM and campus-limited broad¬\ncasting station and to serve as liaison between university\nand TV stations as specific assignments arise. M.A. of\nbetter. Midwest university; immediate opening.\nM-4—Academic teaching position; to teach advanced under¬\ngraduate and graduate level courses in radio-TV and to\nsupervise the academic programs and research work of\nmaster's and doctoral students. Desire person with research\ninterests, particularly in experimental research in TV and\nrelated areas in communication. Ph.D., or very near, a\nmust. Midwest university; immediate opening.\nM-5—Video maintenance and operations supervisor required on\nFlorida FM-TV-closed-circuit university staff. Chance to\nassist in planning and construction. Position open July I;\nexcellent salary.\nM-6—Technical director; supervision of maintenance of TV\nequipment. Eastern college; position open August, 1963.\n4\nNEWSLETTER"
}