{
  "id": "d1692-54",
  "text": "55\nCOMMENTS BY STUDENT SURVEY-CALLERS, FOLLOWING SURVEY,\nEaeh'student wfes asked to turn in a report, along with his survey tables and\ncards. The intention of this was to ascertain the effect of the survey on the\nstudents, and to weigh the desirability of continuing such surveys, if only for\nthe student§3 sake Be1ow:are a few excerpts from these reports, loosely\nclassified and without comment, to eliminate editorializing from this section.\nFor comments based on the survey and student reports, see Summary observations.\nA, on the cooperativeness of Listeners\n1 *| was surprised and pleased by peoples' attitudes They were cooperative\nin every way,.many of the people I talked to were so interested in the\nsurvey that I found it difficult to cut the conversations short. Many of\nthem wanted to know if the survey would really have an effect upon radio\nprogram offerings,\"\n2 \"I was surprised to receive such close cooperation from the people whom\nI contacted,, This raised a question in my mind — are all people in the\nUnited states as cooperative or was it just a case of helping a local or\neducational organization?\"\n3, * The most important thing I learned from this survey deals not directly\nwith radio, but with people, I discovered that the survey was almost fun\nto make, l say \"almost15 to keep it from appearing too easy. My greatest\nsurprise was this fact,\"\n4= \"The thing, I believe, that surprised me most was the response that I gpt\nat 9•00 Sunday morning I imagined that people would be rather perturbed\nto receive a phone call for survey on the only morning of the week that\nthey could sleep, but surprising enough out of the ten calls I was\nsupposed to complete on Sunday morning only two people, were, not at home,\nand l did not get one person out of bed K\n5c \"| learned that most peoplg„were very eo-ope rat ive and ! enjoyed talking\nto most of them I becanje relaxed after the first few calls and the.\ndreaded interviews became enjoyable conversat ions,. It is surprising how\nmany people really like to discuss their likes and dislikes of radio.\nOne lady talked and talked about how much she enjoys the Sunday evening\nprograms, we discussed everything from the comedy shows to the churches\nof the air \"\n6 \"Many people seemed very wi 11 i-ng- to a-1r any grievances -ttiey had about\nradio with me, and when | told them that our compilations would be\npassed on to the networks they felt as if their time was not being\nspent in vain,\"\n7 \"The one think I liked about this survey was a chance to deal with*\npeople and find out what their spontaneous reactions are .when someone\nsuddenly pops questions at them, I found that most people are very\ncourteous and don't mind taking a little time to answer the quest sons,\n8- \"Many people took the survey as sort of a joke Especial*y in.\nFrankfort, (it Is a-town of some 15.000 people) where a survey seems\nsomething of an oddity,\""
}