{
  "id": "d1692-57",
  "text": "56\n22= Kl learned that an accurate survey must depend upon the way In which\nquestions are asked. Too many timesf If not warned in advance, we\ncould have “ put words into peoples'1 mouths, • Even different-\ninflection of a question produces different answers, in the last\nanalysis, though, the individual differences of student surveyors\nmay produce only random effects, which tend to cancel,*\n23= \"To me this survey not only tells us something of peoples listening\nhabits but reflects to some extent the very fibre of the public,*\n24= Hn America broadcasters give the audience what it wants,*- What is\nmeant by “audience*?: The actual or the. potential listeners? We also\nhear that radio programming is designed for the, masses. What masses?\n; If a conclusion may be. drawn from the, persons ! contacted, the,masses\nare not listening, if radio programming is controlled by the tastes\nof the present listeners, it is not-' necessar i ly meeting the needs of\nthe majority. By my survey, the majority isn't 1IstenTngr\"\n25= *Those who don’t listen often have, an objection to radio-, I believe\nthat radio needs to know those objections. It seems even more\nImportant than the popular,ty of existing programs. Is this the only\nsurvey for radio that Is Interested In the reactions of all people—\nlistener and non-listener al l kef *»\n26, \"Another thing I learned from this survey Is that no radio surveys\ncan be 1,00% dependable,\n27, \"This report taught me less about radio 1istening, than about radio\nnon-listening- Only about fourteen from forty-nTne had their radios\non, and of these, only a few knew what they were listening to,,!\n28c \"It seems that the majority of the radio listeners 1isten with about\na quarter of an ear, and engage in other activities while they do so.\nMany people put the radio on and leave the room, '\nC= The Public’s Opinion and Understanding of Radio\n1, \"By such surveys the radio 'ndustry may become more conscious of the\nlack of concern it stirs in the average American home. Also the\nminority that think radio Is worse Should be taken more seriously\nfor an active minority can be more powerful than an inactive majority,\"\n2, M enjoyed talking to the different variety of mankind, some stupid,\nsome intelligent, some —- the *! don’t care* kind, \\ believe what\nsurprised me most was that people don’t pay too much attention to\nradio and the majority of those I talked to thought that radio was\ngetting better.*\n3, 'From my survey,I I think sponsors would be wise to run a lot more\ngood musical programs„ and not place so much emphasis on comedy,*\n4= \"Before I made my calls,; S was almost certain that most everyone\nwould *rant and rave* about,commercialsP but amazingly enough they\nwould quietly give their objections and some didn’t have any object¬\nions at all (or else they didn't tell me),\"\n5= “The majority of the people: I talked to disliked radio commercials\nbecause of too much breaklng~up of fifteen and thirty minute programs,\nand especially the use of commercials during station breaks,\"\n6= M discovered that if i made them feel that their opinions would be\n\"aired* and that their \"gripes* would be used to good advantage^\nthey were more willing to co-operate.. Reactions are friendlier when\npeople think their ideas are important and will be carefully con¬\nsidered^\n7= Pi do not believe that the average listener seriously thinks about\nthe radio. He uses the radio for enjoyment^ which is naturalf but\nvery seldom thinks about his likes and dislikes and how they can be\namended. If he doesn’t 1Ske. the program., he. just “turns it off®.\"\n8, I* I would conclude from my calls that radio is making neither a very\nfavorable impression nor an exceptionally poor one, but is at a\nstandstill,\""
}