{
  "id": "d1692-60",
  "text": "59\nthe answers to some of the questions we would like to have answered, we do\nbelieve the number of calls is large enough to give adequate answers to\nsome of the other questions we ask the listenerso Though there is a\ncertain subjectivity to many of those questions, the number of replies per\nquestion for these questions at least usually runs into the hundreds=\nHence our emphasis, in the results of this survey, on what we believe are\nthose parts based on figures large enough to be valid, and not, to our\nknowledge, available elsewhere.\nB. on Rating All Programs Together\nWe were surprised again this year to find that, althoughcertain variety\nprograms are in first place, in audience ratings- most listeners, from\nthe point of view of programs they liked best, and would apparently like\nleast to lose music news and several others rate above variety. Basket-\nball for example- seems to take on greater meaning after noting listening\nresults : is there not a danger that disproportionate importance is orten^\nattached to the types of the top few programs, with a consequent art meal\nshift of emphasis of the balance of all programs offered? If ratings are\nfollowed closely would everyone not end up with variety programs? Does\nthe rating evidence we have prove that people want more variety programs\nor only that Bob Hope or Fibber is their favorite program once a week,\nwhereas what they would really miss most, and like more of- is must e'¬\ner news— or sports— or forums? Does anyone know how many variety or\nquiz programs the average listener will or can :'take-= or absorb during\nthfe average week? what would happen to American radio if, for two years,\nno surveys were taken, or available and the industry’s own creativeness\nand good sense determined all offerings?\nC comparisons with Last Year’s Findings\nFrankly, one reason we wished to take this year's survey was to compare\nlistening this year with that of a year ago. The radio station situatson\nin Bloomington has changed greatly, and we believe this change Is being\nduplicated throughout the nation In the opinion of those of us who\nspent many hours scrutinizing network schedules and listening to programs,\nfor awards committees and enjoyment there have also been, this year in\nour opinion a far greater number of better-produced programs of social,\nc.v’c. political and cultural significance than last year. Never before\nhave there been so many fine documentary and well-produced programs. Do\nthe listeners know this? The student surveyors, when asked this question,\nreported almost unanimously that in their opinion there was only a very\nsi'qht awareness of this improvement, and that discouragingly few.listeners\nstill know nothing of it The same lack of information about these finer\nprograms still seems to exist. Familiarity still seems to be mostly with\nthe high-rating established shows while new, even significant progranjs\ndiem unheard because of low ratings or rather because few people ever\nknew about them, ; is more adequate promotion of new programs, new ideas\nand new talent not needed if they are to establish themselves? ;If new\nblood is to be developed must it not be given more help, and a longer\nperiod of apprenticeship? How were Jack Benny’s or Fibber McGee’s or\nBob Hope's ratings the first year they were on the air?\nAlthough isolated attacks are being made by many stations and networks\non the great problems of the day and of the world listener awareness\nseems to indicate that concentrated impace is still missing in ail tgo\nmany cases. The greatest communicating medium in the world seems still\nnot to have found itself fully as an instrument of peace and under-\nstanding Four-network cooperation of the sort outlined in Variety and\nBillboard magazines nearly a year ago discussed at the W scons.n\n; IrisHTuTe and later presented to the Advertising Council by Mr Kobak.\nwould still seem desirable, although the wrte: is aware of the\nattitude of the networks toward four-network offerings — an att.tude\ntraceable to wartime experiences. Is it not worth another trial? Are\nthese times not serious enough to justify one more attempt, at. such\ncooperation, and joint co-production pools, on perhaps a one-a-week\nbasis even'if only experimentally, or during the summer season? Need\nthe same mistakes be repeated? Are networks satisfied with summer\naudiences summer accomplishments and the job radio is doing in the s\nfield of world awareness? The indifference so many people show to the *\ngreat problems of today and to radio, which during the war was such a"
}