{
  "id": "d1734-1",
  "text": "WESTERN STATE ACTIVITIES\nAccording to a report from Walter G. Marburger, chairman of the committee\non Radio Education at Western State Teachers College, the institution concluded\nits season on May 27 and will continue in the fall over WKZO, Kalamazoo, Michigan.\nIn his letter he says:-\n\"Durmg the year we have put on 64 broadcasts using 112 students, 40\nfaculty members and 8 others not connected with our college. In addition to\nthese about 25 others have assisted in writing manuscripts, coaching, etc. Four\nof these broadcasts were entirely from sound recordings and two others were in\npart recordings. We have used a recording of our school song to introduce and\nclose our programs. We hope to acquire better recordmg equipment by fall.”\nKFDY DENIED SPECIAL BROADCAST REQUEST\nA report from the F.C.C. Broadcast Division dated June 1, includes\nthis item:\nKFDY So. Dak. college Denied special temp. Auth. to operate\nBrookings, S. Dak. from 8 to 9:50 PM, CST* May 24 and 51,\nin order to broadcast special concert\nby State College Military Band, and from\n5 to 4:50 PM, CST, June 7, in order to\nbroadcast program commemorating the 25th\nanniversary of Agrl. Extension work in\nSo. Dak. Action taken 5/22.\nWhen a request for afternoon time for a broadcast of that character\nis denied how can some of the programs on the air be justified?\nDOES IT MAKE US VULNERABLE?\nUnder the present radio set-up educational stations are obliged to play\nthe game according to rules not designed primarily to fit their needs. Neverthe¬\nless we must conform to the practises in force - or be subject to such criticism\nor prejudice as may follow.\nIn the past it has been the custom for some educational stations to be\noff the air during the summer. Some still recess with their institutions. F.C.C.\nreports dated June 1 list six such authorizations. In some cases the commercial\nstations with which hese educational stations share time take over the extra\nhours, thus strongtuning their claims to full-time operating rights.\nThe problem within the institutions is a very real one. Limted budgets\nsometimes make it impossible to carry on during the vacation period. The sign-\noff is in most cases not because of choice. Be that as it may, every effort\nshould be made to use to good advantage the maximum facilities granted by the\nF.C.C. Only in this way can .an adequate defense be arranged in case of an attack,\nor additional facilities be secured.\n(Special attention is called to the talk by NAEB President H. B. McCarty which\nis attached to this news-letter. It is a pertinent reply to the question \"Why\nthe Educational Station?\")"
}