{
  "id": "d1734-2",
  "text": "NAEB NEWS LETTER.......Page 3....,.. .November I, 1944\nFOR BOTH GROUPS SHOULD BE DOUBLED* UN ORDER TO G8VE THE ASSOCIATION A\nLARGER WORKING FUND NEEOED TO CARRY ON THE FIGHT FOR EDUCATIONAL BROAD¬\nCASTING* NO FORMAL ACTION WAS TAKEN# BUT THE PRESIDENT WAS INSTRUCTED TO\nPOLL ALL NAEB MEMBERS ON THE PROPOSITION. The EXECUTIVE COMMITTEE WAS\nEMPOWERED TO ACT, IF, IN ITS JUDGMENT, ACTION WAS DESIRABLE.\nCONVENTION PROCEDURE AND COMMENTS\nIn accordance with the wishes expressed by the NAEB members, THE CONVENTION\nWAS GIVEN TO DISCUSSION OF EDUCATIONAL BROADCASTING PROBLEMS AND THE BUS¬\nINESS OF THE ASSOCIATION. No FORMAL TALKS WERE PRESENTED AT THE MEETINGS,\nALTHOUGH Mr. F0 At MaPES OF THE PROCUREMENT Of VI SION, TREASURY DEPARTMENT,\nDID TALK INFORMALLY WITH THE GROUP A80UT THE DISPOSAL OF SURPLUS EQUIPMENT\nAND SUPPLIES BY THE GOVERNMENT. The RFC REGIONAL OFFICES WILL HAVE RADIO\nEQUIPMENT FOR DISPOSAL, IF ANY, AND IF YOU ARE INTERESTED IN EQUIPMENT,\nYOU SHOULD GET IN TOUCH WITH THE DIRECTOR OF THE RFC REGIONAL OFFICES\nNEAREST YOU.\nAs A MATTER OF RECORD, THERE WAS SO MUCH INTEREST IN THE PROBLEMS OF NAEB\nAND ITS MEMBERS THAT THE CHAIR FOUND IT DIFFICULT TO BREAK UP SCHEDULED\nMEETINGS. IN ADDITION TO THE PLANNED SESSIONS, THE MEMBERS VOTED AN EXTRA\nsession for Monday morning. The Sunday night meeting, scheduled to last\nTWO HOURS, WAS FINALLY ADJOURNED AFTER H p.M. SOME OF THOSE PRESENT\nEXPRESSED THEMSELVES AS BELIEVING IT TO BE THE BEST NAEB CONVENTION OF\nRECENT YEARS.\nPRESIDENTS MESSAGE\n/N ASSUMING THE JOB AS EXECUTIVE SECRETARY, AND EDITOR OF THE NAEB NEWS\nLETTER, j«m Ebel announceo to the newly-elected NAEB president that the\nNews-letter w^ould carry a presidential message each month. No sooner,\nSAID THAN DONE. ScHOOLEY SAYS•\nleM GRATEFUL FOR THE HONOR OF HEADING NAEB, Now, THAT*S A BIT FORMAL\nFOR ME AND SOME OF THE NAEBers, WaLDQ AbBOT SAYS I W'R I TE BETTER WHEN I\nSTART ShOOTIN8 FROM THE HIPS. WELL, ANYWAY, I APPRECIATE THE HONOR ANO\n' LL DO MY BEST TO SERVE NAEB, AND THAT TO ME MEANS SERVING THE ASSOC**\nI AT I ON—ITS MEMBERS AND ITS AIMS.\nNOW, THE AIMS ARE IMPORTANT, And, ACTION IS IMPORTANT TOO. If I GO TO\nSLEEP ON THE JOB, JUST GIVE ME A KICK IN THE PANTS. And, DON6T WORRY IF\n\\ FEEL LIKE IT i°M GOING TO DO A BIT OF KICKING MYSELF. I EXPRESSED\nMYSELF RATHER CRUDELY AT THE CONVENT I ON—FOR WHICH I APOLOG1ZE—BUT I SAY\nTHAT IT IS HIGH TIME NAEB DO SOMETHING. W‘E 9 VE MADE A START AT THE RECENT\nFCC hearing. There is more to be done.\nNAEB CAN HELP NOT ONLY EDUCATIONAL BROADCASTING IN GENERAL, BUT YOU IN\nYOUR INDIVIDUAL INSTITUTION. And, WHENEVER \\ CAN HELP, JUST LET ME KNOW.\nMore later.\nGIVE JIM A HAND, AND SOME HELP9ll\nPresenting, Jim Ebel, your new Executive Secretary. Jim has no soft job.\nHe’ll have to have the help of every NAEB member. Give it to him."
}