{
  "id": "d834-20",
  "text": "OF\nEDUCATIONAL BROADCASTERS\nDear Graydon:\nOFFICE OF THE VICE PRESI\nNorman\nMay 2k\n, Oklahoma jVfJ ^\n• 1954 -/(Y\nCongratulations on the prospect of moving so rapidly and so well in the direction\nof ETV on your campus. For the past month we have been in one of the tightest and\nmost devasting situations I have ever experienced. As you know, our revenue bond\nissue had to be broug ht before the State Supreme Court for their approval# To\nmake a long story short and sad, the court has not been favorably inclined. In\nfact, we’ve had a terrible time to delay a decision ( which would have been against\nus) in order to bring pressure and argument in our favor. As a matter of law this\nhas been eattremely delicate to handle. Walter Emery has been here since last\nThursday. His knowledge of Oklahoma Law and procedures, together vdth the nation¬\nwide information at his disposal has been extremely valuable to us. A strategy\nmeeting is called for today noon ( we’ve had a number in the past several days)\nto map out our attack. Time is of the very essence with us for we stand to lose\nsome $1,000,000 or better in facilities and cash unless we meet certain deadlines\nwhich are not too far off. So, you can see that I have not been in the very best\nof mind and body.\nHoi\\>ever, I’ve tried to think in terms of NAEB and its overall good in spite of\nour difficulties. Here are some reactions for whatever they’re worth.\n1. Last June at Madison, I voiced the fear that NAEB was becoming involved in too\nmany things and that sooner or later there would be a violent reaction against\nus. That fear still holds true today; if we had a large paid staff, devoting their\nfull time ( as in the case of JCET and NCCET or ETRC) we might well handle a wide\narray of projects, etc. I still say that we must concentrate on a relatively few\nbut highly important items, pushing them through to a conclusion.\n2. Sorry but I would lay a bet giving big odds that Kellogg will let us stew in\nour own troubles, assuming that we’ve gotten ourselves in this predicament and\nwe can get out the best way we can. I think Bob knows this but is friendly and hates\nto tell us the horrible truth until he is forced to do so. In fact, it is my\nhumble opinion that our difficulties vdll color next year’s appropriations even\nthough they have been pledged. Recall, that one of the gravest accusations against\nNAEB was the fact that we WERE NOT FINANCIALLY RESPONSIBLE AND COULD NOT HANDLE\nFUNDS. If you have an opportunity to meet with Bob before any formal action is\ntaken...then I would say DO SO AT THE EARLIEST POSSIBLE OPPORTUNITY. But I do not\nthink the opportunity will present itself. I take the view that Kellogg is through\nvdth NAEB and we can expect very little more from that source. I hope I'm wrong,\nbut it is my opinion we should proceed with that in mind.\n3. I am in favor of a distinctive front page design which at least would be printed\nand together with a decent back would bind all materials we put out. This cover\nwould be standard, with the actaul title changing from time to time ( see accompany¬\ning example for our Oklahoma School of the Air)"
}