{
  "id": "d834-6",
  "text": "TO t The President, Officers & Regional Directors of NAEB\nFROM; John Wo Dunn_5/7/5k\nI believe it is time for NAEB to set up certain standards fori\n(1) Admission to membership in NAEB for Actives and Associates\n(2) Continuing Membership in NAEB for Actives and Associates\n.Ever so often we talk effusively about \"professional upgrading of personnel\" but very\nlittle has been said about \"professional upgrading of the educational broadcasting\nenterprise as a whole*\"\nIn the case of personnel, much has been done in the way of seminars, regional meetings,\netc** I honestly believe we have more people thoroughly imbued with the ideals and\nconcepts of educational broadcasting than we did five years ago* Undoubtedly this has\nhad an effect on station and production center operations.\nBut actually we*ve done very little about setting up standards or goals in educational\nbroadcasting from an operational viewpoint* For active membership our main concern has\nbeen that the institution have a CP for a radio or TV station; for associate members,\nthat they produce over some commercial outlet. And that*s just about all. No where,\nno time have we ever tried to say anything about minimum requirements as to physical\nand broadcast equipment, studios, staff, music libraries, programming, hours of opera¬\ntion, audience building efforts, general effectiveness, etc*\nThe result; there are doaens of stations, I daresay, that are no better today than\nwhen they came into NAEB. Ho effort, has been made to stimulate them to higher\nstandards or goals* Now this often involves challenging administrations and their mis¬\nconceived ideas of values and even delivering concentrated broadsides. All of you are\naware of the professional accrediting agencies (medicine, law, pharmacy, etc.) Until\nsome outside agency can look a situation over and make a factual report & recommenda¬\ntions, administrators too often pay no attention to what local people might have to say,\nI feel sure that the. majority of NAEBers would welcome the help that NAFB could give\nthem in pointing out to their administrations the strong and weak points of their opera¬\ntions.\nFor a long time, I*ve felt that every new Active and Associate member applying for\nmembership in NAEB should be thoroughly checked by a visiting committee — even if this\ncommittee consisted only of one top-notch broadcaster representing NAEB,\nAs a result of this check-up, the applicant would either be denied membership ( and\ntold exactly why but with the right to reapply in 6 months time) or admitted as an\nActive or Associate Member into one of three classifications: A - B or C membership.\nMinimum standards would have been previously set up for each classification.\nAs a member of NAEB, any Active or Associate member may progress from one classifica¬\ntion to another BUT may also be demoted or even suspended from any classification un¬\ntil certain defects in operation and organisation are remedied. This would involve\nperiodic inspections by the Association. For Class C (the lowest) this might be once\na year; for Class B once eve.ry two years; For Class A, once every three years. By\nspecial arrangement, any member might request an inspection be made for certain specific\npurposes provided the actual costs of such a special inspection were met by the member\nrequesting the action.\nPlease note that this classification is NOT based on power or the sise of the sponsor¬\ning institution. This is an entirely new concept of membership classification\nBOTH for Active and Associate members©"
}