{
  "id": "d1867-2",
  "text": "high school students commented upon the network show, Mr.\nNovak, immediately after watching it.\ny KRMA-TV, Denver, has hit the halfway mark in its pro¬\nduction of The Glory Trail, a 10-part panorama of the Amer¬\nican West. KRMA is producing the series for NET, and the\nfirst broadcast is scheduled for March 14, 1965. Denver Post\ncolumnist Jack Guinn is writing the series, and Manny Al-\nbam, jazz arranger and composer, is writing the music scores.\nTom Mossman, director, and Bob Heskett, producer, are both\nKRMA staffers. Red Fenwick, narrator, is also a Post col¬\numnist.\ny WTTW, Chicago, is broadcasting Hear the Whistle Blow,\na 13-program series on America’s railroads, from the 1831\nsteam engine to the proposed Levatrain, a passenger train\nwhich wil'l glide on a cushion of air at speeds up to 500 mph.\nWTTW film director Robert C. Seipp produced the series.\n^ KLRN-TV, San Antonio-Austin, last month presented a\nseries about the gauchos of Latin America, filmed by Edward\nLarocque Tinker. The films were lent to KLRN by the Tinker\nFoundation.\n^ Survivors of the atom-bombing of Hiroshima and Naga¬\nsaki were interviewed locally on WMHT, Schenectady, May\n25 in a program, “Ambassadors of Peace.”\ny The Faces of Self is a series just presented by KLRN-TV,\nwhich will be available later to other TV stations. Marye\nBenjamin wrote the scripts for the programs dealing with\nmental health principles as they pertain to daily life. She also\nproduced the series, with Bill Moll directing and Beulah\nHodge narrating.\ny Emphasis on live telecasting of athletics of high schools in\nseven counties and St. Petersburg Junior College drew en¬\nthusiastic viewer mail approval for WEDU, Tampa, which\nplans additional coverage next year.\ny WHA-TV is videotaping for playback this fall a series\nof 20 half-hour Piano Master Classes currently being con¬\nducted for promising Wisconsin students by Paul Badura-\nSkoda, visiting Brittingham Professor of Music this semester.\n^ To aid teachers in teaching principles of Communism,\nWDCN-TV, Nashville, is telecasting a series based on an\ninstitute at Vanderbilt University last summer on the Nature\nof Communism.\nPERSONNEL\ny Robert D. Squier, TV program director for the University\nof Texas and KLRN-TV, is taking a six-month leave of ab¬\nsence to join the NET staff in New York City as production\nmanager of the public affairs program “At Issue.”\n^ New personnel at WFSU-TV, Florida State University, are\nEddie Mitchel Franklin, art director; Gene Thaxton, assist¬\nant art director; and John A. Roberts, production assistant.\nRichard Puckett, former art director, has left WFSU to\nbecome director of the LeMoyne Art Foundation in Tallahas¬\nsee.\ny Emanuel L. Strunin has been appointed manager of adver¬\ntising and public relations for the Amecom division of Litton\nIndustries. He was director of public relations for Adler\nElectronics prior to its acquisition by Amecom.\ny William Mellown, Jr., former school principal, has joined\nthe staff of the Alabama state education department’s ITV\ncoordinator office as assistant to the director.\n^ Louis Lyons, retiring from his Harvard University post last\nmonth, will continue his news broadcasts over WGBH, Bos¬\nton, and will join the station staff.\nNashville’s WDCN-TV reports two new staffers: Harold\nowery, from the Alabama ETV network, to become a pro¬\nducer-director, and Peter Bretz, from a commercial station\nin Columbia, Missouri, camera crew chief.\ny Judy Haubens has resigned as community-program pro¬\nducer at WMHT, Schenectady. She is now living in Herki¬\nmer, New York, with her new husband, the Reverend Vernon\nA. Austin.\nNAEB Headquarters: Suite 1119, 1346 Connecticut Avenue,\nN.W., Washington, D.C., 20036. Phone 667-6000. Area Code 202.\n^ Jerry Madden, WHA-TV producer-director, will leave the\nUniversity of Wisconsin at the end of the summer to become\ndirector of television at Evanston Township High School,\nEvanston, Illinois.\ny Dale Lewis has been engaged as film director for the\nBirmingham studio of the Alabama ETV network.\ny Samuel Gould, president of WNDT, New York, has been\nappointed president of the State University of New York, ef¬\nfective September 1. His successor at WNDT has not been\nnamed.\ny Werner J. Severin, assistant in TV research at the Uni¬\nversity of Wisconsin for two years, has been named assistant\nprofessor of journalism at the University of Alaska.\ny Another Wisconsin research assistant, Craig Eben, assumes\nnew duties this summer as supervisor of A-V instruction in\nthe Wheaton (Ill.) public schools.\nTRAINING\ny WTTW joined with Chicago-area firms employing sales¬\nmen to present a 10-week course in sales training recently.\nThe Chicago Association of Commerce and Industry pre¬\nsented the series, designed to enable firms with small sales\nforces to train their men with the same degree of profession¬\nalism that large companies can afford.\nGENERAL\n^ Chicago Area School Television, Inc. (CAST) has been\nformed to replace the Tri-County ETV Council. CAST’s\npurpose is to make available to all schools in the area class¬\nroom utilization of TV and to provide the programs at the\nlowest possible cost.\ny WQED, Pittsburgh, expects to reach its community cam¬\npaign goal ($250,000) for the first time in its 10-year history.\ny Texas has a new TV advisory committee organized to\nstandardize technical equipment to be used by tax-supported\nagencies in the state, so that interchange of videotapes and\nother equipment will be possible.\n^ CBS has contributed $100,000 to the 1964 operations of New\nYork’s WNDT.\n^ In surveying its viewers, WQED-TV, Pittsburgh, found\nthat they came from a broad occupational and educational\nrange. The study was conducted in cooperation with a NET\nnation-wide programing survey.\n^ On May 18 the first transmission of medical information\nvia subscription TV was shown over Channel 18, Hartford.\nThe first program was videotaped at the Mayo Clinic. Also\nincluded was a sequence videotaped especially for the pro¬\ngram at a hospital in Glasgow, Scotland.\n^ An experimental series of two-way FM radio programs\nwas conducted in Utah in early May. The radio system was\nestablished between the University of Utah medical college\nand several hospitals in the state, at which physicians con¬\ngregated to take part in the discussion. The system was used\nin combination with KUER (FM).\n^ With its grant under the ETV Facilities Act, Utah pfians\nto extend the KUED signal throughout the state via a trans¬\nlator network, the first of its kind in the U. S. With this\nsystem, 100% of the schools and 99% of the population will\nreceive an ETV signal.\n^ WFIU, Indiana University, expects to have installed by the\nend of the summer its new RCA lOkw FM transmitter. The\nunit will be equipped for possible future stereo broadcasting.\n^ Concordia Lutheran College has announced that it will join\nthe Texas Educational Microwave Project beginning in the\nfall.\n^ Former FCC Chairman Newton Minow has been elected\nto the Chicago ETV Association board of trustees.\ny For the first time, WHYY-TV, Philadelphia, this year will\ncontinue broadcasting throughout the summer.\ny A University of Michigan study reports a rise in the num¬\nber of radio-TV editorials, with 54 of the state’s 132 stations\nreporting the use of editorials. In 1949 only 1 station pre¬\nsented editorials, 3 in 1956, and 17 in 1960.\nJULY 1964\n3"
}