{
  "id": "d888-103",
  "text": "2\ninstance, we shall be on the air for 9*600 hours or 27\noperational hours per day, of which a little more than half\nare for Dutchmen abroad and the inhabitants of the overseas\nparts of the Netherlands Kingdom, and a little less than\nhalf for the foreign countries in which we want to make our\ncountry better known, and to foster goodwill.\nOur compatriots with whom we maintain contact in\nthis way belong to the most heterogeneous population groups.\nThere are those living in the overseas parts of the realm;\nthose serving in the Royal Netherlands Navy and with the\nMerchant Fleet; Dutch immigrants in other countries; mission¬\naries and specialists working in the emergent countries.\nTheir interests are also widely divergent, but they are all\neager for news from the mother country. Often, too, they are\nin need of encouragement, sometimes of advice and help. In\nthis connection we think in the first place of spiritual aid,\nand guidance for our emigrants. We ourselves knew all too\nwell during the last war what radio can mean.\nIn those dark days of the war there was a very\nstrong need of encouragement. And this was given through the\ngood offices of the B.B.C. Thanks to the hospitality of this\norganization transmissions in Dutch to Dutchmen all over the\nworld were made possible. And as a true Mother of Her people,\nthe then Queen Wilhelmina realized the tremendous moral\nsupport Her words could give to millions of them. Thus it\nwas twenty years ago..,.\n(FLASH FROM RADIO BROADCAST QUEEN WILHELMINA)\nIn this way, Your Majesty, we derived strength from\nQueen Wilhelmina*s words.\nBut even today there are sometimes people of our\nnation in difficulty, or even in danger, who need help....\nperhaps through the medium of radio. For instance on January\n25th last Yte were Informed by the Foreign Ministry that Your\nMajesty’s embassy in Leopoldville could not establish contact\nwith Dutch nationals in the Congo, who were known to be in\ndanger. We were asked to broadcast an evacuation instruction\nto these people, and interrupted our programme to do so....\n(FLASH EVACUATION INSTRUCTION)"
}