{
  "id": "d888-106",
  "text": "- 5 -\nvariety and spread, and in this connection we are thinking\nparticularly of more transcription programmes for the\nterritories under development. In this way we can make a\nmodest contribution towards, say, the solution of their\nteaching problems. I am thinking, for instance,of a series\nof guest-lectures for the development areas, comprising\ncourses in French and English with discussions between\nstudents from the areas concerned.\nFor more than a year now, our transcription work has\nbeen extended to include television-transcription for the TJ.\nstation in Curacao. In close and amicable collaboration with\nthe Netherlands Television Foundation (N.T.S.) and the\nFoundation for International Cultural Co-operation (STICUSA),\nwe supply Telecuracao with selections from the Dutch News\nJournals and from various Dutch television programmes, some¬\ntimes also specially adapted coverages, and, finally, our own\nT.V. greetings programmes..\nWe are also supplying Venezuela with cuts from the\nT.V. News Journal, with narration in Spanish.\nSo the scope of our Transcription Department is very\nwide and varied.\nReturning to the actual sound-transcription, special\nmention must be made of the pioneer work in the sphere of music\nwhich has been done by our Dr. Jos Wouters. His gramophone-\nrecord series with spoken text entitled “Five Centuries of\nDutch Music” was recently praised in glowing terms by the\nNetherlands Minister of Education, Arts and Sciences, Dr. Cals.\nThe Director of the Amsterdam Concertgebouw Orchestra,\nMr. Heuwekemeyer, told the press some little time ago that,\nwhile in the United States, he had become aware of the fact\nthat much of the popularity of his Orchestra was due to the\npublicity which Radio Nederland's programmes had given it.\nBut besides serious music we also devote a great\ndeal of attention to the lighter vein. Works of this kind, by\nDutch composers and played by Dutch musicians form, another\nrewarding field for our Music and Transcription Departments.\nThese programmes provide hundreds of foreign broadcasting-\nstations with moments of relaxation in their transmissions....\n(FLASH LIGHT MUSIC)"
}