{
  "id": "d888-44",
  "text": "Cr^\nJuly 2k§ 1961\nMr• J.W. Acd&f\nHead, Central Programme Service\nRadio Nederland Wereldomroep\nHilversum, Netherlands\nBear Mr. Acdai\nThank you for your letter of July 19. After the first flush of success\nwith test program #1, we have had bad luck with programs 2 and 3*\nThe transmission on July 14 was blocked out completely by interference\nof one sort or another. The transmission on July 21 was better but\nnowhere near as good as the first and, to our way of thinking, not good\nenough for rebroadcast purposes. Under separate cover I am sending you\na recording of test programs #1 and #3 so that you can compare the results.\nWe are hopeful that present difficulties are temporary and that the\nexcellence of the first transmission will be the rule and not the\nexception. It does prove, however, that we should not rely on the short-wav\ntransmission if the program is to be distributed to NAEB stations on a\nregular weekly basis. Standby programs on tape will be necessary.\nI have begun to receive comments on the first program from the NAEB\njudging committee. One person remarks \"Since most of the other press\nreviews now distributed give European impressions of American problems,\nit would seem appropriate that we have a compilation of European views\non Europe. The analysis provided by correspondents in Paris, Lisbon,\nand Bonn are for the most part concise and to the point.*\nAs soon as I have received other statements I will pass them along to\nyou. Let me raise two minor technical matters for your consideration.\nThe use of music at open and close is effective when quality of\ntransmission is assured. However, the music distorts easily on short-wave\nand may be more distracting than helpful. Secondly, if it should fit in\nwith your policy, some mention at the end or beginning of the program by\nyour announcer that the program is being transmitted for use by member\nstations of the NAEB radio network would be appreciated.\nThe problem of timeliness will always be with us. My guess is thqt we\nshould allow ten days from time of transmission to time of broadcast on\nNAEB stations. Tapes sent from the Netherlands will add another three\ndays at most to this delay. Of course, stations able to pick up the\nshort-wave broadcasts direct will have no such problem. I am in the\nprocess of surveying our network stations as to their ability to receive\nyour broadcasts. However, I suspect that the percentage will be small\nuntil stations can be stimulated to install proper equipment.\nCordially,\ncci Underwood, Hill\nE.G. Burrows"
}