{
  "id": "d888-52",
  "text": "- 2 -\nHammarlund HQ-145C ($280) or HQ-180C ($440). the Halliorafters\nSX-101A ($400) or SX-111 ($250) and SX-100 ($300). In the field\nof Reveiver Kits there are the Heathkit RX-1 and GC-1A ($275\nand $110 respectively) and the Knight R-100v$100). As to the\nantenna, while this may present no problem to you, we feel\njustified in making one or two concrete suggestions. After all,\nshortwave communication has its own specific demands and this\nband is no longer in common use in the United States.\nFor amateur purposes there are a number of simple and inexpensive\nantenna types available, such as the dipole and L-antenna. A\nmodem version of the dipole referred to in the enclosed\nbrochure is the folded dipole. This has a characteristic impedance\nof 300 ohms and a figure-8 sensitivity characteristic and is\nthus highly sensitive to signals hitting it at right anglfes.\nThe directional effect of this type can be increased by the\naddition of a reflector - a wire or metal rod about 1/I0th\nlonger than the dipole - placed i-wavelength behind the dipole\n(looking from the transmitter, of course). The addition of\nsuch a reflector will have the effect of reducing the impedance\nof the array to about 240 ohms and to match this correbtly to\nthe input impedance of the receiver it is necessary to employ\na i-wavelength stub whose characteristic impedance is mean\nproportional to that of the dipole and the 300 ohm ribbon which,\nin turn, is matched to the receiver.\nAs you will see, our brochure contains details of several\nantenna types. In addition to these we would mention the Mosley\nSWL-7 kit, details of which will be found in the July issue\nof \"Popular Electronics\". Considerable information on the\nsubject of antennas is to be found in the \"Radio Amateur’s\nHandbook\".\nWe are aware that a number of stations have already purchased\nequipment primarily for the reception of \"European Review\".\nShould any problems arise during installation or the construction\nof the antennas, do not hesitate to call on our advisory services.\nWe trust that the foregoing will contribute to the continuity\nand quality of reception and that the basis will be laid for a\nlong period of profitable cooperation between us."
}