{
  "id": "d888-59",
  "text": "transmission via Dutch transmitters, or (for later trans¬\nmission within or outside the national borders) in the form\nof recordings made by a technical process.\nThe schedule halfway through 1961 comprised 12 transmissions\ndaily in Dutch, 5 in English, 4 in Spanish, 2 in Arabic, and 1\neach in Indonesian and Afrikaans. At the week-ends there are\nsome deviations because on Sunday, for instance, there are no\ntransmissions in English, Spanish and Afrikaans. On that day\nEdward Startz’s multilingual Happy Station programmes are on\nthe air five times, beamed in different directions.\nAbout one half of the contents of the programmes referred to\nin the regulations consists of spoken word; the other half being\ndevoted to music. A very important item in every transmission\nis the news, which is generally followed by a spotlight, analysing\nor backgrounding a topic of current interest. Talks, on-the-spot\ncoverages, sound-pictures, religious services, press reviews, family\ngreetings, concerts of light and serious music, interviews, all these\nform the pattern of the transmissions, making it possible to bring\nevery important facet of Dutch life to the ears of an international\naudience.\nRadio Nederland is not the exponent of any specific religious\nor political trend. Nor is it a state institution. It is an organization\ngoverned by free men, with its own independent place in society,\nand aiming to serve the interests of the country by worthily\nrepresenting it on the air. Radio Nederland works to this end\nby maintaining contact with Dutch nationals and immigrants\nliving in other countries, and by holding high or making known\nthe name and reputation of the Netherlands abroad. “Projecting”\nthe Netherlands abroad, we sometimes say, and by this we mean\nsomething else, and something more than just showing the\ncolours. The aim and purpose also prescribes an active general\nfurthering of Holland’s export trade.\nThe daily transmissions in the Dutch language serve very hetero¬\ngeneous groups of listeners. They comprise those living in the\noverseas parts of the realm, Surinam and the Netherlands Antilles,\nand in Netherlands New Guinea; those serving in the Royal Nether¬\nlands Navy and with the Merchant Fleet; Dutch experts working\nabroad, missionaries, Dutch nationals in Indonesia, and, finally,\nthe many thousands who have emigrated in the course of the\nyears and have settled in other countries.\n7"
}