{
  "id": "d888-61",
  "text": "With regard to Surinam and the Netherlands Antilles Radio\nNederland’s task lies in strengthening the ties between the mother\ncountry and these overseas parts of the realm, by supplying in¬\nformation on the Netherlands in the fullest sense of the word.\nThe international news broadcast by Radio Nederland to those\nterritories gives special prominence to events and developments\nin the Caribbean area.\nThe Dutch community in New Guinea is kept abreast of the\nhappenings in the world, and in particular in the Netherlands.\nThe Dutch seafarers naturally have their interests strongly rooted\nin the homeland, and the longer their absence the more eagerly\ndo they follow the happenings in their own country. Not only\nare they given general information on world and home affairs,\nbut — perhaps even more important to them — the small “common\nor garden” things are not neglected. Sports items and spoken\nmessages from wives, children and other relatives form the topics\nof conversation on board for days afterwards.\nThe interest displayed by the many Dutch experts employed in\nforeign countries, and that of the workers in the missionary field,\nis also motivated in most cases by the anticipated return, sooner\nor later, to the mother country. In that respect they are in the\nsame position as the seafarers, though each group may be interested\nin different programme items.\nThen there is the — now very diminished — Dutch community\nin Indonesia. In view of the political developments, and especially\nsince December 1957 when the Indonesian authorities banned\nthe import of publications in Dutch, these people have obviously\ncome to rely more than ever upon their daily short-wave contact\nwith the Netherlands. Radio Nederland has become almost the\nsole source of news in their own tongue, and numerous letters\nfrom listeners in Indonesia bear witness of their appreciation.\nThe position and focus of interest of the Dutch immigrants are\nagain different. The reasons why they have left the Netherlands\nto live and work elsewhere may vary, but the majority of them\nhave retained a desire to hear regularly from and about the Old\nCountry. The letters received by Radio Nederland from immigrants\nleave no doubt about this. Our transmissions to Australia and\nNew Zealand, to Canada, South Africa, Brazil and all the other\ncountries where Dutch immigrants have made their homes, do\nnot appear to retard their adjustment to the new environment\n9\nEdward Startz with his\ntraditional “nice cup of tea”"
}