{
  "id": "d888-62",
  "text": "but, on the countrary, to promote assimilation. Many of them,\nespecially the women, find they help them through their difficult\nmoments. No wonder the item “Netherlands News Journal” — a\ndaily survey of events great and small in the life of the Old Country\n— enjoys such popularity among this category of listeners.\nHowever, the value of the transmissions does not lie only in the\nsphere of human feeling. Keeping in touch with the Netherlands\nhas also a useful economic effect. In this way the immigrants act,\nas it were, as economic outposts. What they hear via Radio Neder¬\nland about new Dutch products is passed on by them, so\nthat here again the transmissions contain a strong export-stimu¬\nlating element. This kind of information is broadcast in news\nitems, reportages and other programmes.\nBesides the transmissions in the Dutch language, Radio Neder¬\nland, as has already been said, also broadcasts in English, Spanish,\nArabic, Indonesian and Afrikaans. The purpose of these trans¬\nmissions is to give the foreign listener an impression of Dutch\nlife and thought; to tell him of Holland’s aims and aspirations,\nof its accomplishments, its working methods and its products. In\nputting on these foreign language programmes, with their spiritual,\nsocial, political, scientific and cultural elements, the material pur¬\npose is by no means forgotten. Here, too, the stimulation of Hol¬\nland’s export trade is ever in mind. Experience has taught that all\nkind of subjects which, on the surface, seem to have little or\nnothing to do with the country’s economy or overseas trade, can have\na clearly noticeable influence in those directions. They can create\nthe right atmosphere for subsequent business dealings. But Radio\nNederland also has a direct approach in this respect. The develop¬\nments in the fields of Dutch industry and agriculture are regularly\nbrought to the ears of the foreign listener by means of news items,\ntalks, interviews and on-the-spot coverages, though never in the\nform of a “commercial”. Radio Nederland does not make direct\npropaganda, but has the interests of the entire fields of Dutch\nbusiness, industry and agriculture at heart.\nIt is impossible to assess in figures what the result of these trans¬\nmissions has been to date. But their effectiveness is often reflected\nin the listener’s mail. Requests from foreigners to be put into\ncontact with Dutch manufacturers, inquiries about Dutch agri¬\ncultural and cattle-breeding methods, and about the touristic\npossibilities in this country, these are but a few examples of the\n10"
}