{
  "id": "d888-99",
  "text": "Some genera] hints\nLightning protection\nWe are frequently asked to suggest a method of\nprotecting receivers from damage by lightning,\nshould the aerial be struck. The best method of\ndoing this is, of course, to isolate the receiver\nfrom the aerial and connect the latter directly\nto earth, for instance by means of a switch.\nSuch a switch is shown in fig. 6. In case of a\nstorm it is only necessary to throw the switch\narm from the upper contact to the lower one.\nThere are also proprietary lightning safety devi¬\nces on sale. These usually consist of a gas-filled\ncartridge with a connection for the aerial at\none end and to earth at the other. A sectioned\ndrawing of such a device is shown in fig. 7.\nIn the event of high tension reaching the aerial,\nwhich would be dangerous for the receiver, the\ncartridge will act as a fuse, isolating the receiver\nand allowing the excess current to pass safely\nto earth. An automobile spark plug may also\nbe used for this purpose, but only as a temp¬\norary measure. Connect the aerial and lead-in\nto the receiver to the central electrode of the\nplug and connect the “body” of the plug to\nearth. The excess tension will then jump across\nthe gap and go to earth. It must be repeated\nthat this should only be used as an emergency\nmeasure.\nWhen using a dipole aerial, that is one with a\ntwin lead-in, it is necessary to isolate both leads\nagainst lightning damage. This can be achieved\nby the use of two switches (as shown in fig. 6)\nor by two cartridges of the type shown in fig. 7.\nThe earth connections of the two switches or\ncartridges may be joined and a single wire then\ntaken to earth.\nThe earth lead\nGenerally speaking, a good “earih” can be\nobtained by the use of a metal rod several feet\nlong driven into the ground, or by a metal\nplate of any shape buried about three feet in\nthe earth. Both must be connected by means of\na single wire, preferably of a non-corrosive type,\nto the receiver or other contact point destined\nfor connection to earth. A metal water supply\npipe makes an excellent earth. Part of the pipe\nshould be cleaned with emery-paper or scraped\nwith a knife, and the earth wire attached to\nthat spot by means of a metal clip.\n7"
}