{
  "id": "d898-26",
  "text": "CHAPTER..S..1—LAWS OF N„ J. 19 A1\nAPPROVED.. .AAjL.A.L..\nASSEMBLY, No. 120\nSTATE OF NEW JERSEY\nINTRODUCED JANUARY 22, 1968\nBy Assemblymen PARKER, W. L. SMITH, BROWN, MABIE\nand HORN\nReferred to Committee on County and Municipal Government\ni An Act authorizing boards of chosen freeholders to create county\nj heritage commissions and prescribing the membership, powers\nand duties of such commissions.\n|\n1 Be it enacted by the Senate and General Assembly of the State\n2 of New Jersey:\n3 1. The board of chosen freeholders of any county is authorized\n4 to create, by resolution, a county heritage commission to be com-\n5 posed of 5 residents of the county to be appointed by the board\n6 for terms of 5 years, except that of the members first appointed\n7 one member shall be appointed for a term of 1 year, and one mem-\n8 ber each for terms of 2, 3, 4 and 5 years. Vacancies shall be filled\n9 in the same manner for the unexpired term. The members shall\n10 serve without compensation but with the consent of the board they\n11 may be reimbursed for expenses incurred in the performance of\n12 their duties as members of the commission.\n13 2. The commission shall organize as soon as may be following\n14 appointment of its members, and annually thereafter, by election\n15 of a chairman from among its members.\n16 3. A county heritage commission shall be responsible for the\n17 development of county programs to promote public interest in\n18 local and county history and with the approval of the board, and\n19 within the limits of funds appropriated or otherwise made avail-\n20 able to it, undertake the restoration, operation, maintenance and\n21 preservation of real property acquired by the county pursuant to\n22 Revised Statutes 40:32—6 or otherwise.\n23 4. The commission, as from time to time authorized by the board,\n24 may establish museum and cultural’ programs, exhibits and dis-\n25 plays including the fine and performing arts, engage in archaeo-\n26 logical, genealogical and historic research, publish reports and"
}