{
  "id": "d898-55",
  "text": "page three\nMr. QuayIe\nFebruary 26, 1969\na substantial share of its potential audience? A pre¬\ncise factor could be established to determine how far\nshort a station's signal coverage lies from its potential\ncoverage based on fully authorized effective radiated\npower•\n3. The Licensee. Ihe great majority of educational\nradio stations are licensed to colleges and universities.\nIn the main these are public though some are private and/or\nsecular. Other stations are licensed to public school\ndistricts or administrative boards of districts. Others\nare licensed to religious institutions. Still others\nare licensed to student governments of colleges and\nuniversities.\nStations licensed to religious institutions should not,\nin the main, be identified as public stations. There\nwould be exceptions to this as in the case of WRVR,\nlicensed to the Riverside Church in New York City but\na public station in the finest sense of that word.\nStations licensed to student body governments are not\npublic. The intent of these stations (normally a Class D\n10 watt FM) is to serve the student body at the college\nor university.\n4. Personnel. A significant key in defining public radio\nis the quality of staff. Unless there is an adequate\nprofessional staff, a station should not be categorized\nas public. Those stations operated by a student staff\n(college or high school) with a faculty advisor are\ncertainly due scrutiny. There are many stations with\na core professional staff that utilize students in cer¬\ntain roles. The main factor is: Does the radio station\noperate with professional competence with primary de¬\ncisions being made by professional broadcasters and edu¬\ncators? If not, support should be withheld or limited.\n5. Schedule of Operation. Many educational radio stations\noperate on an intermittent basis utilizing a portion of\nthe broadcast day, programming certain days of the week\n— or signing off for periods of one and two weeks at"
}