{
  "id": "d898-84",
  "text": "EDUCATIONAL TELEVISION STATIONS\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nPHONE: 667-6000 • 1346 CONNECTICUT AVENUE . WASHINGTON, D.C. 20036\nFebruary 12, 1969\nMEMORANDUM\nTo: ETV Station Managers\nFrom: C. Scott Fletcher\nA division of\nThe appointment of John W. Macy, Jr. as the president of the\nCorporation for Public Broadcasting, pleases me immensely. I have\nknown him for over ten years. I am sure you have read the excellent\nCPB news release about John Macy, and you also have seen and heard\nhim on television. I wish to give you my personal appraisal of this\noutstanding man for whom I have great respect and affection.\nEarly in 1958, the Fund for Adult Education - established by the\nFord Foundation in 1951 - decided to embark on a major national program\nentitled \"Education for Public Responsibility.\" In letters written to me\nas president of the Fund, the plan was warmly endorsed by President\nDwight D. Eisenhower, Vice President Richard M. Nixon, and by former\nPresidents Harry S. Truman and Herbert Hoover. The Board of Directors\nof the Fund approved my request to appoint two special consultants on\nthis vast and intricate concept. The two men were John W. Macy, Jr.,\nthen executive vice president of Wesleyan University, Middletown,\nConnecticut and Harlan Cleveland, then director of the Maxwell Graduate\nSchool of Citizenship at Syracuse University, and currently U. S. Ambas¬\nsador to NATO. Both men were active consultants until they accepted their\nassignments with the Kennedy Administration in 1961.\nLater I had the privilege of working with John Macy and his Civil\nService Commission associates in many voluntary activities, from 1961\nuntil I returned to Florida in 1967. These activities involved programs\nin the field of education for public responsibility, but with different names.\nFor example, for nearly two years I worked with a group of key civil\nservants selected by John Macy, in order to develop an ETV series con¬\ncerning civil servants and their public responsibilities. This activity has\ncome to a temporary halt because of lack of funding.\nJust last October John Macy wrote to me at length describing the\nnew Federal Executive Institute. He noted that \"The conceptual foundation"
}