{
  "id": "d1150-0",
  "text": "Office of Executive Secretary\nUrbana, Illinois\nOctober 1, 1940\nDO YOU NEED HELP?\nThere are in the HAEB files a number of applications of young men\nwho are interested in educational radio, These men would be glad\nto have you consider their qualifications* If you need new\npersonnel on your staff, why not try the HAEB wav'? Here they are?\nRoy Co Vogelman, 7803 38th Ave,, Kenosha, Wieconsin( formerly OTA)\nCharles Crumpton Stevenson, 161 West 54th Street, Hew York City\nRuss Johns, 330 East 50th Street, Hew York City*\nAlbert Do Goudreau, 309 Bryant St., Kalamazoo, Michigan(formerly TOO)\nWarren Moore, Jr«, 315 S, Hope St*, Ada, Oklahoma(formex’Xy WNAD)\nFurther information is available from HAEB, or write to the Individuals\nmentioned above*\nIT8 S YOUR FUTURE OH WOI\nGoing to school by radio no longer ia a fantasy to Iowa high eohocl\nstudents*\nHundreds of them laid aside their books this year and tuned in the\nfirst of a series of \"radio school11 programs which ttIII be a regular\nclassroom feature every Monday fron now until school \"lets out,\"\nThe series, \"It!s Your Future,\" is being broadcast from WOI, the\nIowa State College station by the Department of Vocational Education,\nIts purpose is to acquaint high school students, many of whom are\nalready wondering about after-graduation jobs, with the vocational\nopportunities awaiting them. Professor A, H, Hausxath of the\nVocational Education Department, is in charge of the series.\nFar from a new thing, the vocational guidance school has been on the\nair for 4 years,. Last year at least 300 Iowa high schools tuned in\nthe program regularly at 3s15 in the afternoon.\nIn every case the vocational guidance speakers axe leaders in their\nfield. Before the \"mike\" they are interviewed by Professor\nHausrath about the opportunities, the physical, mental and educational\nrequirements of their work, and the usual financial returns* Some¬\ntimes high school students participate in the broadcast as inter¬\nviewers."
}