{
  "id": "d1150-4",
  "text": "ACHIEVEMENTS OF THE NATIONAL COMMITTEE ON EDUCATION BY RADIO\nBy J©y Elmer Morgan, Editor, The Journal of the\nNational Education Association, and Chairman, The National\nCommittee on Education by Radio\nThe National Committee on Education by Radio was organized during the winter\nof 1930 when it mapped out a five-year program for the protection and development\nof this new field. Within two years, in spite of the depression and confusion in\nthe national life, it has moved forward with remarkable effectiveness. Its\nachievements include the followings\nFirst, the Committee has made constant efforts to protect college and univer¬\nsity broadcasting stations against powerful attacks by commercial interests.\nSecond, by the maintenance of specific clearinghouse service to college and\nuniversity broadcasting stations, the Committee has encouraged the development\nof educational broadcasting in such institutions.\nThird, the Committee has successfully discouraged the effort to establish\nradio advertising in the schools. Referring to the original intention of the\ncommercial companies, Orrin E. Dunlap, Jr,, writing in the New York Times for\nFebruary 5, 1933, admits nThe idea that tooth paste, pencils, pons, candy, bread\nor motor cars can be advertised to schools under commercial sponsorship has been\nabandoned. Teachers will not telerate it,”\nFourth, the Committee has sponsored a nationwide survey of educational broad*\ncasting in the land-grant colleges and separate state universities.\nFifth, thru its bulletin. Education by Radio, the Committee has gathered the\ngreatest collection of writings which exists in this field. By spreading such\ninformation among people who occupy positions of power and influence it has sown\n4 l\nthe seeds for the radio reform which is as inescapable as tomorrow's sun. Its\ninfluence in this direction was clearly evidenced in the action taken by the\nDominion of Canada which has revised its radio system to provide for both dominion\nand provincial needs under public operation."
}