{
  "id": "d1744-1",
  "text": "2\nU.N. RADIO KITS OFFERED\nChristopher Cross, U.S. Radio Liaison Officer for the United Nations offers\nNAEB members help with their air efforts in behalf of the U.N. in the form of\nradio kits.\nThe September l6 kit included the following scriptss\n\"Let's Talk It Over\"s three five-minute scripts. Interviews with farmer,\nveteran and doctor.\n\"Round Table\"s one 15-minute script for participation by local educator,\nwoman, newsman and merchant.\n\"In the Common Interest\"; one 15-minute script for two local personalities.\n\"The General Assembly\": one 15-minute script for interview with\nprominent local person.\nSpot announcements! ten spots, 20 seconds.\nTo get on the mailing list for these free materials and regular day-to-day\nreleases of news, write to Mr. Cross at Radio Division, Dept, of Public Information,\nUnited Nations, Lake Success, New York.\nRADIO AT BYU\nT. Earl Pardoe, Chairman of the Radio Committee at Brigham Young University at\nProvo, Utah reports on the activities of KBYU-the five-watt IBS station on the\ncampus. The organization of this miniature station follows the regular station\nmanagement plan-with a president, production manager, continuity writers, ot\ncetera. The Speech Department is responsible for the activity, and a radio club\nserves as a feeder for personnel and program talent.\nSix hours of programs per day will be provided from campus studios. It is\nplanned to sell certain spot announcements to pay the operating costs. Campus\nmusical groups, the lecture bureau, the drama department and the Extension Division\nall contribute to the program fare.\nStudent talent is encouraged in various ways. Radio majors participate in\nthe year's series of 36 radio dramatic productions. Original radio skits are\nstimulated through prizes and special recognition.\nSumming it up, Mr. Pardoe says s\"We have no ambitions of at any time going\ncommercial. We are vitally concerned in serving our community on the highest\npossible artistic and educational level.''\nTHE LABOR MARKET\nWANTEDs Script and continuity writer. Half-time with opportunity to do\nUniversity work toward degree. $1500 for ten months' appointment. Write! Dean\nFrank T. Stockton, University of Kansas, Lawrence»\nWANTED? Radio producers full-time, $228 per month to stait. Open now.\nCollege graduate, production experience required. Writes Burton Paulu, Radio KUOM,\nUniversity of Minnesota, Minneapolis.\nAFM O'KS SCHOOL MUSIC BROADCASTS\nJames C. Petrillo on September 23 in Chicago signed an agreement with the\nMusic Educators National Conference and the American Association of School\nAdministrators permitting school musicians to broadcast and to cur disks on a non¬\ncommercial basis. Though NAEB had been assured its interests would be safeguarded,\nno representative was at the conference. Non-commercial stations have heretofore\nenjoyed freedom in musical matters, and the situation remains unchanged by the\nChicago pact.\nI Vm'Lh SEE YOU IN CHICAGO-—OCTOBER\"25-26-27 ]"
}