{
  "id": "d1819-0",
  "text": "NAEB NEWS LETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nFrank E. Schooley, Editor, Station WILL, Urbana, III.\nJuly I, 1943\nINDIANA U. AIDING 0 W I\nRadio Director Harry Skornia of Indiana Univefsity has disclosed that\nSTUDENTS ON THE CAMPUS ARE PREPARING RADIO MATERIAL DESIGNED TO INCREASE\nTHE INVASION JITTERS OF THE AXIS* SkORNIA SAID THAT LANGUAGE PROFESSORS\nTRANSLATE SKITS AND TALKS INTO NINE DIFFERENT TONGUES, AND STUDENTS HAVE\nBEEN FOUND WHO CAN SPEAK THEM FLUENTLY. THE MATERIAL THEN IS TRANSCRIBED\nIN THE UN I VERS ITY1S RADIO DEPARTMENT AND SENT TO THE OFFICE OF WAR INFOR¬\nMATION in New York. The OWI distributes the transcriptions for broadcast\nFROM SHORT-WAVE SENDING STATIONS. THE PROJECT WAS STARTED A80UT EIGHT\nMONTHS AGO.\nCODE FOR COiVuvigNTATORS\nA COMMENTATORS* COEE OF ETHICS, STRESSING OPPOSITION TO CENSORSHIP IN ANY\nFORM EXCEPT FOR THE PUBLIC SAFETY, HAS BEEN ADOPTED BY THE ASSOCIATION OF\nRadio News Analysts. The association membership includes many network\nCOMMENTATORS.\nAS GENERAL AIMS, THE COMMENTATORS® CODE LISTS FIRST, \"To MAINTAIN THE\nINDEPENDENCE AND PRESTIGE OF THE PROFESSION,” AND SECOND, hT0 IMPROVE THE\nSTANDARDS OF ANALYTICAL NEWS BROADCASTING IN TIME OF WAR.”\nThe six PART CODE IS DESCRIBED AS CORRESPONDING TO the ESTABLISHED practices\nof the National Association of Broadcasters. It cites three big needs for\nCOMMENTATORS AS PAINSTAKING ACCURACY, SOUND JUDGMENT AND GOOD TASTE, AND\nTHE AVOIDANCE OF SENSATIONALISM. It SAYS ADVERTISING MATERIAL IN THE GUISE\nOF NEWS OR PERSONAL OPINION IS UNDESIRABLE. And THE READING OF COMMERCIAL\nANNOUNCEMENTS BY RADIO NEWS ANALYSTS IS AGAINST THE BEST INTERESTS OF\nBROADCASTING.\nOn CENSORSHIP, THE CODE SAIDS ”THE ASSOCIATION OPPOSES ALL CENSORSHIP OF\nBROADCAST MATERIAL, EXCEPT INSOFAR AS DULY REQUIRED BY GOVERNMENT AUTHORITIES\nIN THE INTEREST OF PUBLIC SAFETY DURING A NATIONAL EMERGENCY.”\nWNYC BROADCASTS NEW CARNEGIE PEACE ENDOWMENT SERIES\n“Beyond Victory - What?”, a nev* series of radio programs of interest to the\nENTIRE COMMUNITY, STARTED OVER STATION WNYC ON FRIDAY, JUNE 18, AT 8 P.M.\nDr. Nicholas Murray Butler, distinguished President of Columbia University,\nCivic leader, and President of Carnegie Endowment for International Peace,\nI NAUGUT.AT ED THE SERIES WITH AN ADDRESS ON ”AMERICA*S ROLE IN THE POSTWAR\nWorld.” To give the ideas of young service people on this important\nsubject a Sailor, a Wave and a Marine were included."
}