{
  "id": "d1270-11",
  "text": "HINTS FOR THE PROGRAM DIRECTOR\nVETERAN'S DISC SERIES\nNinth series of \"Here's to Veterans\" is now in production it was reported by\nCharles E. Dillon, Assistant Director of Information for Radio and Television,\nVeteran's Administration, Washington, D.C. Series No. 8 has just been distri¬\nbuted to radio stations. Series Ho. 7 is being carried by a total of 1,503 AM\nand FM stations. Each series runs 13 quarters, (Recommended ty NAEB).\nVeteran's Administration reports 24 TV stations currently carrying VA film\nspot series, \"Your VA Visitor.\" June 11 was the date of VA television confer¬\nence for the eastern seaboard.\nFARM SAFETY COUNCIL MATERIAL\nNational Safety Council and U. S. Department of Agriculture together with Ameri¬\ncan Farm Bureau Federation, National Grange, Farmer's Union, and other rural\norganizations are sponsoring National Farm Safety Week (July 25-31). Special\nspots and transcribed material (also spot and short talks) are available from\nNational Safety Council. Address them at 20 North Wacker Drive, Chicago 6,\nIllinois. (Activity recommended by NAEB, Program directors, however, will want\nto check ET spots in terms of own audience and policy format).\nCOMMUNITY CHEST SERIES\nCommunity Chests and Councils of America, Inc., is sending to local chapters this\nmonth a series.of four minute transcriptions in which 18 radio personalities\nnarrate human interest stories, highlighting the work rendered to communities by\nvarious welfare services. There are 18 different stories which can be used as\nfive-minute features, as spots in a recorded musical show, as inserts by local\ncommentators, or as opener for a 15-minute program. Title is \"Red Feather Story\nTellers\". For details see your local Community Chest organization. (Activity\nrecommended by NAEB, but series has not been checked by NAEB. Local policy will\ndetermine).\n'RESEARCH REPORT' ON NAEB'S KOAC\nKOAC (Oregon State College) is featuring a news series called \"Research Report\",\nan accounting of activities and achievements in the field of medical science.\nInformation for the series is prepared on authority of the National Society for\nMedical Research with the endorsement of the University of Oregon Medical School,\nthe Oregon Medical Society, and the State Board of Health.• Programs are aired\nat 8jOO p.m.\nFARM & HOME RADIO SURVEY INFORMATION\n-lIHadio as a Source of Agricultural and Homemaking Information\" is the title of\na talk given by Gladys Gallup, assistant chief Division of Field Studies and\nTraining, United States Department of Agriculture. A summary of recent extension\nradio surveys, gives some very worthwhile information on (1) radio and its\nimportance as an educational medium for farm families(2) general studies covering\nU.S.D.A. extension work, including radio, (3) studies limited to radio alone."
}