{
  "id": "d1270-13",
  "text": "*14*\nAPPLICATIONS (FREQUENCY MCDULATIOnFcOLLEGE, UNIVERSITY, INSTITUTIONAL\nExtension Completion Date\nHUCM-The Regents of the University of Michigan, Ann Arbor, Mich. - Modification\nof construction permit (B2-PED-26, as modified, which authorized a new noncommer¬\ncial educational FM broadcast station) for extension of completion date.\nFor FM Permanent License\nWBOE-Cleveland City Board of Education. Cleveland, Ohio (Mark C. Schinnere, super¬\nintendent) - License to cover (BPED-71 as modified) which authorized changes in\nnoncommercial educational broadcast station.\nModification of Construction Permit\nWHSF-STATE OF WISCONSIN, State Radio Council, Madison, Wise., - Modification of\nconstruction permit \"(BPED-89, which authorized a new noncommercial educational\nstation) to change frequency from 89.7 me., to 91.3 me., and make changes in\nantenna system.\nExtension Completion Date\nKMHB-Mary Hardin-Baylor College. Belton. Texas - Modification of construction\npermit (B3~PH-i033> as modified) which authorized a new FM broadcast station\nfor extension of completion date.\nModification of Construction Permit\nYJBEZ- Board of Education, City of Chicago, Chicago,Ill. - Modification of\nconstruction permit (BPED-80, as modified), which authorized changes in non¬\ncommercial educational broadcast to change ERP from 14.5 to 15 KVJ and make changes\nin antenna system,\n*** •***\nACTIONsTmPLITUDE MODULATION)\"COLLEGE. UNIVERSITY. AND INSTITUTIONAL\n1250 KC - Modification of Construction Permit\nKFKU- University of Kansas. Lawrence, Kans, - Granted modification of license to\ncorrespond to YiREN license so that share-time operation may continue (BML-1274).\nFINDINGS OF FACT HE HEARING\nKansas City Broadcasting Co., Inc., Kansas City, Mo,. Graceland College of\nthe Reorganized Church of Jesus Christ of Latter Day Saints, Independence. Mo. -\nGranted joint petition for extension of time to submit proposed findings of fact\nin re their applications (Dockets 8415 and 8870), and the time was extended to\nJune 24."
}