{
  "id": "d1270-15",
  "text": "-16-\nLOW-POWER FM BROADCASTING IS PROPOSED\nThe FCC June 17, 1948 proposed to amend its rules to permit FM broadcasting by\nnon-commercial educational stations with 10 watts or less of power, and to waive\ncertain requirements to promote this type of service.\nFavored by the U, S. Office of Education, low-power transmitter are already in\napplication stages at several universities, including Syracuse and DePauw. Syracuse\nhas conducted experiments for the past year with a 2J- watt transmitter.\nLow-power FM broadcasting would be authorized in the 88-92 me, band now allotted\nto the non-commercial educational service. The FCC notice said that”such a station\ncould get on the air for an expenditure of a few thousand dollars.\" It added that\nsuch a station could cover ntwo to five miles.,,\nStatements or briefs are to be filed by those interested on or before July 26, 1948,\nGRADUATED SCALE OF TELEVISION BROADCASTS AUTHORIZED BY COMISSION RULES AMENDMENT\nAdoption of rules amendments providing a graduated scale of television broadcast\nprogramming during early license periods were announced by the FCC. The amended\nrules, proposed May 6, 1948, would permit a program operation schedule beginning\nwith a 12-hour week schedule, distributed over five days with not less than two\nhours daily.\nOnly comment filed in the proceeding, the FCC said, was one from Paramount Pictures,\nInc,, which asked a 28-hour program week, particularly for stations operating in\nmetropolitan areas of 500,000 population or more. This comment was rejected with¬\nout prejudice to later petition for further amendment.\nThe operating schedule set up by the new change in the rules is as follows:\n(1) First 18 months: Not less than two hours daily in any five broadcast days per\nweek, and not less than a total of 12 hours a week.\n(2) Between 18 and 24 months: same as above, but not less than 16 hours per week\n(3) Between 24 and 30 months: same, but not less than 20 hours per week.\n(4) Between 30 and 36 months: same, but not less than 24 hours per week,\n(5) After 36 months: not less than two hours in each of the seven days of the week,\nand at least 28 hours per week.\nGENEVA CONFERENCE COMPLETES ASSIGNMENT ~~ ~~\" '\nThe High Frequency Broadcasting Conference ended its work in Geneva, Switzerland,\nlast week, with a unanimous vote to submit to the nations of the world the\nfrequency assignment plan developed in Working Group 3* under the leadership\nof Curtis Plummer, vice chairman of the planning committee, in accordance with\nthe Atlantic City directive.\nThe plan, which is not yet available for detailed study, will be submitted to\nthe Mexico City Conference October 1*\nThe United States Delegation to the Geneva Conference was under the chairman¬\nship of Forney A. Tankin of the State Department,"
}