{
  "id": "d1270-16",
  "text": "LOT-POWERED AND LOW COST FM BROADCASTING FOR EDUCATION\nWith FCC approval in June of low-powered FM transmission and licensing, the\nSyracuse University experiment vindicated, and the way is open to literally\nhundreds of school, college, and university FM stations* Low-powered educational\nbroadcasting now has the official approval of the FCC and the U. S. Office of\nEducation.\nSyracuse University in April, 1947 installed a new type 2§- watt (low-powered)\ntransmitter with studios in the main library building of the university, and\ncommenced experimental operations using a General Electric transmitter.\nOperating under experimental call letters WAER. the station transmitted on a\nwavelength of 88.1 megacycles. The station signal is clearly heard over a 3 mile\nradius on all Aft receivers. In many places it can be heard at a distance of 6\nmiles.\nIn other words, a transmitter of this type can cover the average shcool system\nin cities of from 5.000 to 50*000 throughout the United States•\nIf expansion is desired later, additional power units can be added to the basic\ntransmitter unit to step up radiation to 250 watts or more with the aid of sep¬\narate power stages to cover areas of 50 to 75 miles.\nThe cost is not high! Basic cost for the low-powered transmitter is less than\n$2000. and that of the additional povfer unit for 250 watt ■ operation less than\n43000.Studio expenses and equipment and input equipment vary according to the\nneeds and wants of the institution. A basic installation can be made for under\n43500 complete.\nThis 3500 dollar cost compared with $15,000, $25,000, and $100,000 for higher-\npowered installations simply means it is feasible now, for the first time, for\nhundreds of institutions to begin radio operations where previously financial\nceilings prevented this development.\nGeneral Electric Company reports to N-&-E-B, delivery can be made with 30 to 60\ndays on this new type transmitter. Installation of the complete transmitter unit\nand antenna can be made in a single day.\nN^A-E-B Headquarters—Iowa State College, Ames, Iowa— is prepared to furnish\ninformation to member stations and others interested in FM and AM educational\nbroadcasting. With over 90 member institutions in 30 states, N-A-E-B is\nsingularly well-equipped through experience and philosophy to offer aid,\ncomfort, and advice to prospective educational broadcasters.\nTWENTY YEARS CF BROADCASTING AT CORNELL UNIVERSITY\nCharles Taylor, extension editor and pioneer radio broadcaster at Cornell U.,\nhome of N-A-E-B member station, WHCU, has just prepared and printed a 44~pag©\nbulletin, \"Twenty Years of Extension Broadcasting.\" In this bulletin he reports\nalmost everything Cornell has done in radio—services to stations throughout the\nstate and operations of the college station, WHCU. He reviews activities ranging\nfrom college radio courses to TV experimentation. To secure a copy write to\nNew York State College of Agriculture, Cornell University, Ithaca, New York."
}