{
  "id": "d1270-18",
  "text": "-19-\nSURVEYS AND GRADUATE STUDENTS????\nAn increasing number of stations report a continuing flood of requests for survey\nr information from students of all ages and levels in scores of institutions.\nTypical request from a student who maybe (li an advanced graduate student;\n(2) a casual graduate student; (3) any radio course enrollee, high school or\n.junior college, involves spending 15 minutes to 2 hours filling out questions\non staff, policies, salaries, etc,. of tho educational station being queried.\nMuch of this material will be turned to good useage as in the case of advanced\nstudents to wit.studies such as those conducted by Indiana University under Skornia\nor the University of Wisconsin under McCarty. At the same time much of it is strict¬\nly T/aste motion on the part of both the student and the station; it is time-\nconsuming and unv/arranted«\nSuggestions for some central method of handling this problem will be appreciated.\nShould N-A-E-B set up a clearing house to evaluate or clear such inquiries?\nIf such a plan were in operation any station manager could simply refuse to\nanswer inquiries unless the letter carried N4A-E-B certification. That re¬\nfusal could carry the admonition to clear with the N-A-E-B Survey Committee\nSURVEYS. QUESTIONNAIRES, AND NEW EDUCATIONAL STATIONS\nInquiries of another kind are also flooding N-A-E-B stations. Concensus of most\nmembers is that every attention should be given to properly and adequately ans¬\nwering these questions. For instance a Board of Education in some ma.ior U.S. city\nsends a detailed questionnaire about salary, staff, operating policy, etc*, with\nrespect to your station, or a college or a university makes the same survey approach,\nAgain suggestions as to how some simple and basic method of handling might be\nadopted would be appreciated. For one thing members might well send to N-A-E-B\nheadquarters a list of studies they have done and whether or not reprints or copies\nof such studies are available.\nN-A-E-B is still waiting for permission to distribute Skornia's study of 20 edu¬\ncational stations made at Indiana University. This study and others such as\nthe one recently completed b y Robert Davy at VJHA (University of Wisconsin) will\ndo much to simplify answering questions of this kind.\nPROGRAM DIRECTOR WANTED AT KUSD. SOUTH DAKOTA\nIrving Merrill, director of N-A-S-B station KUSD, University of South Dakota at\nVermillion, S.D. has an opening for a program director. Position involves dir¬\nection of programs and teaching of orientation course in radio at the University\nVermillion is located 30 miles from Sioux City, Iowa* KUSD has new studios,\ntransmitter, and participates in comprehensive radio teaching program operated\n, by university department of speech. Contact Irving Merrill, KUSD. Vermillion,S.D«\n: PROGRAM MANAGER WANTED AT N-A-E-B STATION\nN-A-E-B station located in Midwest, operating with 5000 watts, serving large\nrural-urban area wants program manager January 1, 1949 or shortly before. Appli¬\ncant should have both commercial and educational station experience, bachelor's\ndegree in science or arts, be prepared to sho?; record of previous administra¬\ntive responsibility and experience with program and production problems. Job\nwill entail supervision of program department and coordination of FM and AM pro¬\ngram operation. Excellent salary, permanent tenure if satisfactory. Contact\neither M.S. Novik, NAEB Secretary, Room 370 at 630 Fifth Avenue, Mew York City\nor Richard Hull, N-A-E-B Headquarters. Station WOI, Ames, Iowa._"
}