{
  "id": "d1270-2",
  "text": "-3-\nWASHINGTON LUNCHEON FOR RETIRING COMMISSIONER DURR\nA testimonial luncheon was given to Clifford J. Durr, retiring Commissioner of\nthe Federal Communications Commission who voluntarily concluded his period of\nservice on the radio regulatory body June 30.\nAttending the event, given by the National Lawyers Guild, were several hundred\ngovernment officials including members of the Supreme Court and the Court of Appeals.\nFormer \"trustbuster\" Thurman Arnold, described Durr as the Conscience of the\nBroadcasting industry\". Wayne Coy, FCC chairman called him \"an exultant believer\nin democracy\".\nSenator Claude Pepper lauded Durr for his \"unique sensitiveness to the public\ninterest\", Tributes were paid him from many sources including Harold Ickos.\nformer U, S. Secretary of the Interior; Charles Denny, former FCC chairman, and\nmany others.\nDurr, who addressed the group briefly« spoke again on the theme of greatest con*\ncern to him—civil liberties and the rights of man. He decried the trend toward\nuse of nor.\".judicial sanctions by government and the trend toward controlling\npeopled thinking in this country. \"The trend toward controlling people's think*\ning,\" said Durr, 11 is as dangerous here a3 in Germany, Japane or Russia—and we\nhave less excuse for it here,\"\nDurr, whose future plans he says are indefinite, has been sought, it was reported\nfor the presidency of several colleges and universities.\nFRIEDA B. HENNOCK APPROVED AS NEW FCC MEMBER\nWith Senate confirmation of her appointment to succeed Clifford Durr on the\nFederal Communications Commission, Frieda B. Hennock becomes the first woman\nto be appointed to high public office since Frances Perkins was Secretary of\nLabor, Miss Hennock is a Democrat from New York City, and a feminist.\nMiss Hennock, attractive, personable, able, was born in Poland 43 years ago.\nAgainst the wishes of everyone but herself decided to be a lawyer when she\nwas 18 and. in Brooklyn. To pay for a night school law course she worked all\nday on Wall Street in a law office. Admitted to the bar at 21 she enjoyed a\nspectacular and financially successful career trying criminal cases.\nIn 1941 Miss Hennock became the only woman partner in the stately, old law\nfirm of Choate, Mitchell and Ely. She is taking the FCC job, admittedly a\nfinancial comedown (not long ago she made $50*000 on a case turned down by\n18 other law firms), because she says the FCC needs somebody who understands\nconstitutional law in granting licenses to radio and television stations,\nbecause she has a feeling for government, and because she is a woman,\n\"The FCC, says flrtiss Hennock, \"is a quasi-judicial commission...the commission\nneeds a lawyer—not a programming expert.\"\nMiss Hennock intends to resign from her New York lav/ firm connections, and plans\nto move to Washington early in July to take up her new duties with the Federal\nCommunications Commission*"
}