{
  "id": "d1270-6",
  "text": "FCC'S COY MAKES PLEA FOR DISCRIMINATING RADIO LISTENERSHIF\nWayne Coy, chairman of the Federal Communications Commission, speaking at the 70th\ncommencement exercises of the Cincinnati College of Music, made a plea for\n’‘educated” listening as a basic part of American citizenship.\nHe pointed out that every citizen should know and understand that the radio fre¬\nquencies are part of the public domain and therefore part of every citizen’s\nheritage. Coy also stressed that every citizen should be familiar with the\nrelationship between the FCC and private broadcasters and should know something\nabout broadcasting.programming and production methods.\nEmphasizing the importance of radio as an educational force. Coy said, “The broad*\ncasters, the schools, and the parents, working together, can make radio an in-\ncreasingly effective force in American life.” This remark underscored an earlier\nOBSERVATION THAT ’’every schoolroom in America, should, by now, be equipped with a\nradio set. It should be freely integrated with the classroom work...as a major\neducational tool. As soon as television becomes available in a community, the\nschoolroom should be equipped with a television screen—the electronic black*\nboard of the future...\"\nThe Cincinnati'. College of Music conducts a special radio department made\npossible by cooperation of commercial broadcasters in this Ohio city. One\nhighlight of this year’s Commencement exercises (the 70th) was awarding of\nthe degree of Bachelor of Fine Arts in Radio Education-*the first time\nsuch a degree had been granted anywhere in the country. FCC Commissioner\nCoy hailed the event as \"a great compliment to Cincinnati's radio broadcasters\nas well as to this institution (the College of Music)”\nCoy emphasized the heavy responsibilities of the radio broadcasters (to the pub¬\nlic and to the society in which he functions)...”in this day of increased radio\nfacilities and of heightened social, economic and political problems.”\n“These problems” he said, \"call for more attention by the radio listener. In a_\ndemocratic society whore the people own the radio channels but entrust them to\nprivate individuals for operation the people have a real responsibility in a,_,\ncommon effort to insure maximum benefit*.from those channels.”\n\"It is futile to assume, as some have in the past.” Coy said, ’’that the listeners\ncan discharge this responsibility merely by tuning in the programs they like and\ntuning out the ones they don’t like. The listener can play a far more effective\nand intelligent role than that.”\nTo illustrate his point. Coy described the work of the Cleveland Radio Council\nas an example of \"organized community effort\" to achieve this end, \"Broadcasters,\nhe declared, ’’^for their part, can help by providing suitable programs as an in¬\ncentive to intelligent juvenile listening. And they can cooperate in every sound\nendeavor with the schools and the parents to meet the radio needs of the community,\"\n■X -X’K ■X’X 'X1\nSETON HAIL COLLEGE OFFERS SPECIAL SUMMER RADIO COURSE !\nSeton Hall College with the aid of leading network and agency specialists is offer¬\ning a six-weeks course in radio advertising at its Newark Center. Course.began ’\nJune 28. Subjects covered include agency operation, commercial copy writing, pro-\ngram production- publicity and promotion. Coordinator for the course is Joseph\nF. Keating of the Mutual Broadcasting System’s program department."
}