{
  "id": "d1270-9",
  "text": "-10-\nSTANFORD-NBC SUMMER RADIO INSTITUTE OFFERS 14 COURSES\nThe 194S Stanford-NBC Summer Radio Institute is offering 14 courses of study-\nin commercial and educational radio from June 17-August 28. Courses range from\nprofessional management sequences to radio program planning and scheduling. In\naddition to the usual subjects of announcing, music, writing, etc., the Institute\nwill have a special section in public interest broadcasting and radio for teachers.\nInstitute teaching personnel includes Allen Miller, director of the Institute (also\ndirector Rocky Mountain Radio Council); John Elwood, general manager, KNBC; Mrs.\nInez Richardson; Hal Wolf; John Grover; Tony Freeman; Budd Heyde; Dr. Jan Pepper;\nDick Bertrandias; Malcom Meacham; John Thompson; Alfred Crapsey, and Marjorie\nMcGilvrey.\nCOLUMBIA RECORDS TO MARKET NEW TYPE PUTTER\nA new type phonograph record which plays 45 minutes on one 12-inch double-face\nplatter will soon go on the market. Produced by Columbia Records, Inc., the new\nrecord is known as the '‘Columbia LP (long-playing) Micro-groove11 record.\nPlatters turn at 33 l/3 R?M as compared with 78 RPM for conventional records. They\nwill retail for as much as 62 percent less than the price of the usual record. A\nnewly-developed record-player readily attachable to any radio or combination is\nrequired for the Microgroove records. Players retail for $29.95 and will be manu¬\nfactured by Philco and Columbia Records.\nLP Microgrooves are grooved three-thousandth of an incfc v/ide and contain about\nthree times to the inch as many grooves as the conventional phonograph record.\nThe player mentioned above measures 15 by 14 by 6 inches*\nNYU WORKSHOP HEADED BY LANDRY\nRobert J. Landry, author of “This Fascinating Radio Business” and former secretary\nof the CBS program board, is director of New York University’s Summer Radio Work¬\nshop which began June 28. Dean Paul A. McGhee, Division of General Education\nat NYU in announcing Landry’s appointment, stated that the workshop is a six-\nweek group of courses for professional radio people.\nPrevious instructors at the NYU Workshop have included Burton Paulu, director of\nN-A-E-B station KUOM (University of Minnesota) and Seymour Siegel, director of\nN-A-E-B station WNYC (New York Municipal Broadcasting System),\nEPISCOPAL CHURCH PLANS NEW RADIO APPROACH\nA, new type of appeal is being attempted by the National Council of the Episco¬\npal Church in conjunction with the Mutual Broadcasting System. A budget, re¬\nported to range upward of $15,0GQ.per week with 500 MBS stations tied in.will\nhave its first airing in October.\nInitial program will feature Walter Hampden, emcee for the series, who will star\nin “Cyrano de Bergerac. Dramatic approach will see selction of plays with\nspiritual appeal. This theme will be re-emphasized in closing announcement\npointing out solace church offers people in a troubled world. The Episcopal\nChurch has no proselyting in mind—instead will extend direct invitation to\npeople not affiliated with any church."
}