{
  "id": "d1372-0",
  "text": "J '\nI\n* t.\nNEWS NAEB LETTER\nNATIONAL ASSOCIATION •- EDUCATIONAL BROADCASTERS\nFrank E. Seliooley, Editor, Station WILT^A^ii^nal,^Illinois\nc\nTHE LAND OF MAKE-BEL!EVE\n'-by'Robert Wilkinson\n“The success of the KW3C School of the Air feature, £t X Land of Make-\nBELI EVE j CAN BE CREDITED TO THE BELIEF THAT GOOD ENTERiV 3NMENT IS AN\nINTEGRAL PART OF EVERY CHILD5S EDUCATION.”\nThis quotation from the Spring, 1942, School of the Air vlletin of\nKWSC, THE RADIO SERVICE OF THE STATE COLLEGE OF WABHINGTC'V EXPRESSES\nA FACT WHICH DEVELOPED FROM THEORY.\nThe Land of Make-Believe is one of the 5000 watt station1 3 tuvi we^k^y\nFEATURES WHICH ARE DESIGNED ESPECIALLY FOR RECEPTION IN TIE :? JBL I C N.\nSCHOOL CLASSROOMS OF THE NORTHWEST. SCHEDULED FOR PR I MAR GRADES,\nThe Lund of Make-Believe is heard each Monday asternoon from 2s00 to\n2:15. ——\nSeven school semesters ago Kenneth Yeend, director of the station, and\nOTHERS RESPONSIBLE FOR THE PLANNING OF THE KWSC SCHOOL OF THE A|R ASKED\nA QUESTION OF PRIMARY SCHOOL TEACHERS, PRINCIPALS, AND SUPERINTENDENTS.\nWhy, they aske cannot a radio program which offers stimulati <g enter-\nTAINMENT BASED UPON STORIES FAMILIAR TO CHILDREN HAVE REAL EDUC ATTONAL\nVALUE? The EDUCATORS REPLIED THAT IF CHILDREN SHOWED CONSIDERABLE INTER\nEST IN A DRAMATIC STORY—TELL f NG PROGRAM IT WOULD BE EDUCATIONAULY JUST¬\nIFIED. Any way it was worth a trial, \\\nIt got one. The Land of Make-Believe went into production in September,\n1939* with Lady Make-Believe furnishing continuity to a series if fiftee\nDRAMATIZATIONS OF CHILDREN^ STORIES. TEACHERS FOUND THEIR PUPILS\nEXCITEDLY ATTENTIVE; THE YOUTHFUL LISTENERS GREW TO KNOW LADY M*KE-8ELIE\nAND TO LOOK FORWARD EAGERLY TO HER WEEKLY VISITS WITH DRAMATIZE! STORIES\nThey were fascinated by this friendly lady who could make their favorite\nCHARACTERS STEP FROM THE PAGES OF THEIR STORYBOOKS TO LIVE AND ALK FOR\nA QUARTER OF AN HOUR.\nOn February 16, 1942, the first program in the current se es was pre¬\nsented. ”EpAM|NONDAS” WAS ITS TITLE, a SKILLFUL TREATMENT OF THE FAMIL6\ntale. Lady Make-Believe has returned to the “land of the story-book\npeople”; the Old Woman in the Shoe has gone back to her own large family\nfrom the yet larger radio family. Now the children are taken to the\nSCENES OF THEIR FAVORITE STORIES ON A MYTHICAL MAGIC CARPET. PROGRAMS"
}