{
  "id": "d1197-10",
  "text": "page 4\nMatyi, John, Student, OSU, Elizabeth, N.Y.\nMaaon, Jay E., WJTN-FM, Jamestown, N.Y. Deshler 629\nMason, Mrs. Jay E., Jamestown, N.Y. Deahler 629\nMennet, Earl F., Dir., Supt. of Schools, Almeda Co., Oakland 7> Calif. Chittenden4ll\nMeuser, Edwin H., Ex.Secy. Be. of Am. Missionaries, Am. Luth. Ch.,Columbus\n^j^nzer, C. H., Dir. Station WSUI, Univ. of Iowa, Iowa City Deshler\n^KerrifieId, John F., Agr. Dir., WJ, Detroit 31, Mich. Deshler 765\nMickelson, Sig., Dir. News & Spec. Events WCCO, Minneapolis, Minn*\nMiddleton, Arthur J., Radio News Editor, Battle Creek, Mich.\nMiller, Nadine Eleanor, Dir., Press Relations, C.E. Hooper,Inc. N.Y.\nMiller, Galon R., Dir. Audio-Visual Ed., Wabash H.S., Wabash, Ind.\nMills, Helen M., Reference Librarian, O.S.Museum, Columbus, Ohio\nMoats, M. Delle, Radio Chairman, Natl. Womans' Relief Corps,Defiance Deshler 1123\nMoench, G. Frederick, Chr. Health Comm.,Natl.P & T Assn. Hillsdale,Mich.Deshler 1229\nMoody, Carl 0., Det. Be. of Edu., Detroit 6, Mich.\nAdore, Clarence C. Prog. Mgr. KOA-NBC, Denver 2, Colo Deshler\nMorgan, Howard C. Ex. Secy., Intercol. Peace Sp. Assn, Richmond, Ind.\nMortland, Jacqueline L. WBNS, Columbus 15, Ohio\n'Murrow, Edward R., V.Pres., CBS, New York City Deshler\nDeshler 1878\nDeshler\nFt. Hayes 902\nNi^onger, HerschelW., Dir., Bur. Special Adult Edu., OSU Columbus 10\nv&rovik, M.S., Radio Consultant, New York City Deahler\nOsterholt, Roxie Louise, Michigan State College, East lansing, Mich. Deshler 460\nPack, Richard M., Dir. of Pub., WOE, New York City Deshler 518\nPaine, Gene C., Student, Oklahoma, Norman, Okla.\nPalmer, Eva., Dir, Battle Creek Public Schools, Battle Creek, Mich. Deshler 1738\nPapier, Jerre, Student, South High School, Columbus, Ohio\nPardoe, T. Earl, Head of Radio Div., KOVO, Provo, Utah Deshler 1206\nParle, Grace, Teacher, St. Louis Public Schools, St. Louis, Mo. Deshler\nPaul, Gregory H., Student, OSU, Columbus 6, Ohio\ny^P&ulu, Burton, Mgr. KVOM, Univ. of Minnesota, Minneapolis 14, Minn. Deshler 1031\nPe^ce, James H., Asst, to Ex. Secy. Hennepin Co.T.B. Assn.Mpls., Minn.N.House 709\n[j^!ambeck, Herb H., Farm Service Dir., WHO, DesMoines, 7> Iowa Deshler 765\nPollitt, Anne M,, Radio Chr., Jr. League of Toronto, Toronto, Ontario Deshler 322\nPorter, R. Russell, Coordinator of Radio, Univ. of Denver, Denver, Colo.Deshlerl256\nPribble, Vernon H., Gen. Mgr., WTAM, NBC, Cleveland 14, Ohio\nRagle, Eugene N., Prog. Dir. WOOL, Columbus, Ohio\nRamsey, Norman A. Supvr., Bur. of Ed. Res., Columbus 2, Ohio\nR^avis, G. H., Asst. Supt., Public Schools, Cincinnati, Ohio Deahler 601\nV^ohards, Robert K., Dir. of Pub. Relations, Nat. Assn., Washington 6\nRidley, Walter N., Pres. Am. Teachers Assn., Va. State Coll.,Petersburg Iltchford337\nvRoberts, Luke L., Dir. of Ed., KGIN, Portland 7, Ore. Deshler 1465\nRoegge, Beulah M., Script Writer, Chicago Public Schools, Illinois. Deshler 667\nRogers, John S., Student, Univ. of Minnesota, Minneapolis 5 Deshler 840\nRomaine, Prof. Westervelt B., Dir. of Television, Am. Univ., Wash. l6.Neil House 870\nRosenb'ium, Sid., Student, OSU, Columbus 31 Ohio\nRosenthal, Robt. H., Student, OSU, Columbus 5> Ohio\nRothen, Marshall G., Dir. of Broadcasting, Rutgers Univ, New Brunswick, N.H. D.1217\nRowell, E. J., Asst. Dir. Inf., PMA,USDA, Washington 25, D.C. Deshler 442\nRowland, Howard, Student, Univ. of Pittsburgh, Pittsburgh, Pa."
}