{
  "id": "d1197-12",
  "text": "REGISTRATIONS\nfor the\nSEVENTEENTH INSTITUTE FOR EDUCATION BY RADIO\n(Saturday, May 3)\n1947\nAbeloff, Irvin C., Gen. Mgr. WISE, Richmond 19, Fa. Deshler 1750\nAbraham, Hert L*, Dept, of State, Washington, D. C.\nAllen, Nimrod B., Ex. Sec’y, Cols. Urban League, Columbus, Ohio\nAltenbernd, Thomas C., Student, 0. S. U., Columbus, Ohio\nAugello, Joseph L., Student, Wayne Univ., Detroit 19, Mich. Fort Hayes 323\nBachman, John W., Dir. of Radio, Baylor Univ., Waco, Texas Deshler 603\nBaker, Charles T., (Student), OSU, Columbus, Ohio\nBaker, Fred G., (Student), Kent State Univ., Strongsville, Ohio Deshler 1077\nBelaney, Wm. L., (Student) OSU, Columbus, Ohio\nBell, Collins J*, (Student) OSU, Columbus, Ohio\nBenfield, Edward C. (Student) Miami University, Oxford, Ohio\nBennett, Charles E. (Student) OSU, Columbus, Ohio\nBildersee, Max U., Supervisor N.Y. State Ed. Dept., Albany 1, N.Y Deshler 1170\nBittermann, Helen R., Sales Rep., WBNs, Columbus, Ohio\nBracken, Mary C. (Student) Stephens College, Columbis, Mo. Deshler 1537\nBradley, Joline D., (Student) Stephens College, Stephens, Mo. Deshler 1537\nv^S^echer, Edward M. Gen. Mgr., WQQW, Washington 3, D.C.\nBrock, Para Lee, Dir. of Ed., WATL, Atlanta, Ga. Deshler 363\nBrokhahne, Van Rensslelaer, Production Mgr., WNYE, Brooklyn, N.Y. Deshler\nBrown, John A., (Student) OSU, Columbus, Ohio\nBrown, Peggy C., Chr. Radio Programs, Girls Scouts, Ft. Collins, Colo. Deshler 440\nBurks, Cleva A., Asst. Ext. Ed., AES, U. of Ark., Little Rock, Ark. Neil House 110\nButler, Mrs. Clyde II., Pres. Radio Council of Cleve., Lakewood, Ohio Deshler 466\nBullock, Jim L. (Student) Kent State Radio Workshop, Kent, Ohio Deshler 823\nCahil}, Eugene F., (Student) Mich. State College, Battle Creek, Mich. Deshler 724\nCallaway, Joe A., Dir. of Radio Ed., Mich. State College, E.Lansing . Deshler 4lp\nCameron, James B., Script Writer WBOE, Cleveland, Ohio Chittenden 204\nCarlson, Glenn C., (Student) OSU, Columbus 15, Ohio\nCassidy, James, Pub. Relations Dir., WIW, Cincinnati, Ohio\nvefiarters, VI. W., Dir. Res. Ser., Stephens College, Columbia, Mo.\nChase, Frances B.,2d Asst. English, Wayne Univ., Detroit, Mich.\nCheney, Ann M., 225 E. Pacemont Rd., Columbus 2, Ohio (Student)\nChester, Giraud, WHA, Madison, Wis.\nChute, Margaret M., Pub. Ed. Sec’y, Cleve. Urban League, Cleveland, 0. Deshler 820\nClark, Delores (Student), Moulton Hall, Kent State Univ., Kent, Ohio Deshler\nClarke, Helen, Consultant-Dietetics, Columbus 5, Ohio\nClarke, Lucille, Radio Chief, New York 10, N.Y.\nClarke, Walton D., Dir. of Radio, Kent State University, Kent, Ohio Deshler\nCleaver, Chas. R., News Editor, WRRN, Warren, Ohio\nY>06leman, Robert J., WKAR Michigan State College, East Lansing, Mich. Deshler 1221\nCoyle, Wm. E., Radio Director Wash. Evening Star, Washington, D.C. . Neil House 667\nCrangle, Marjorie S., (Student), Denison Radio Class, Granville, Ohio Deshler\nCummings, James E., Asst. Dir. Dept, of Ed., Washington, D.C. Deshler 563\nDeshler 774\nDeshler 1276\nDeshler"
}