{
  "id": "d1197-16",
  "text": "Shackson, Lee, Director, Otterbein College, Westerville, Ohio\nSheldon, Paul W., Pub. Director, Am. Town Meeting, New York l8, N.Y.\nSilsbee, Deborah S., (Student) Denison University, Elyria, Ohio\nSlack III, Louis M., (Student) OSU, Columbus, Ohio\nSlager, Fred C., Prin., Central High School, Columbus,Ohio.\nSmiley, Robert K., (Student) Kent State University, Kent, Ohio\nSmith, Royer L. (Student) University H.S., Columbus, Ohio\nSnyder, Nan, Stephens College (Student), Papillion, Neb.\nSommer, Sandra M., (Student) OSU, Columbus, Ohio\nSpence, Mary Leslie, Educ. Ch., Madison, Wls.\nSpicer, Verna (Student), OSU, Columbus, Ohio\nSpriggs, Mrs. Chas. 0., College Station, Texas Virginia\nSpriggs, Chas. 0., Professor, A & M Ocllege, College Station, Texas Virginia\nStandish, Jean T., Pub. Relations, Radio Sta. of Mich., Detroit 2, Mich.\nStephenson, Kathleen E., H. Dem. Agt., New Martinsville, W. Va., Deshler 1232\nStone, Sidney, Radio Director, Bowling Green State Univ., Bowling Green,0.\nStroh, Janie (student) College of Wooster, Wooster, Ohio\nSunerkrup, Meredith E. (Studnt) Stephens AER, Columbia, Mo. Deshler 1537\nSwisher, Carol J. (Student) University High School, Columbus, Ohio\nDeshler 1346\nDeshler\nDeshler 718\nDeshler 1537\nDeshler\nTait, Elton B., Ext. Radio Ed., Pa. State Collage, State College, Pa. Neil House 732\nThompson, Penn, Field Rep., Am. Fat Salvage Comm., New York City Neil House 779\nThompson, Wayne N., Asst. Prof. Univ. of Missouri, Columbia, Mo. Deshler 430\nThompson, Wm. H., Director, 0. C. of Ch., Columbus, Ohio\nTigert, John J., Pres., Univ. of Florida, Gainesville, Fla. Seneca 828\nTrout, Thomas W. (Student) OSU, Columbus, Ohio\nUpchurch, Mrs. Glenn, Teacher, Bd. of Ed., Akron, Ohio\nUray, Rick, (Student) Kent State University, Kent, Ohio\nDeshler 325\nDeshler 823\nVan Ness, Mary E., (Student) OSU, Columbus, Ohio\nVitcha, Leonard A., Scriptwriter, WBOE, Cleveland, Ohio\nWagner, Paul H., News Dir. WOSU, OSU, Columbus 10, Ohio\nWeeks, Mrs. Chas. G., V. Pres, Radio Council of Greater Cleveland, Ohio Deshler 466\nWeir, Thomas A., Head, Social Science, VTP, St. Louis, Pub. Sch., Mo. Seneca 329\nWells, Ella Richey, Dramatics Instru., Barrett Jr. High, Cols., Ohio\nWetherby, Carol L., Grasse Pointe Farms 30, Mich. Fort Hayes 322\nWetherbyy, Joseph C,, Dir. of Radio, Wayne University, Detroit, Mich.Fort Hayes 323\nWhite, Bettie Jo. (Student) WOSU, OSU, Columbus, Ohio\nWood, William A. Acting Chief, Div. of Pub. Liaison, Dept, of State, Wash., D.C.\nFort Hayes 10l4\nWoods, Mrs. Ruth, Teacher, Indianapolis Public Schools, Indiana.\n^Woodward, Luther E., Field Consultant, Natl. Comm., New York 19, N.Y. Deshler 706\nWoolfries, A. G., 3416 Oakland, Ames, Iowa Deshler 408"
}