{
  "id": "d1197-8",
  "text": "page 2\nDailey, Robert W., Radio Dir., McCann-Erickson, Cleveland, Ohio\nDavis, James D., Asst. Prof., Michigan State College, East Lansing\nDean, Mr. Mrs. John N., Chr. for Radio, Fort \"Worth 7, Tex.\nDebus, Elaine, Writer & Prod., Div. of Audio Vis. Ed., St. Louis, Mo.\nDelafield, Charles, Canadian Broadcasting Corp., Toronto, Ontario.\nDempsey, Wm. C., Grad. Asst. WSUI, Iowa City, Iowa.\nDial, Harold E., Student, OSTJ, 5&37 Hayden Run Rd., Amlin, Ohio\ny?5unham, Dr. Franklin, Chief of Radio, U.S. Office of Ed., W\"ash.,D.C.\nDunham, Mrs. Franklin, Arlington, Va.\nDurr, Clifford J., Commissioner, Fed. Communications Comm., Wash.,D.C.\nSeneca\nDe shier 1574\nDeshler 1471\nDeshler 937\nDeshler 927\nDeshler\nDeshler\nChittenden 54)\nEdwards, John B., Wash. Correspondent, Am. Brdctg. Co., Washington,D.C,\nEdwards, Virginia, Radio Comm., St. Louis Bd. of Education, St. Louis Deshler 1761\nEliott, R. E., Dir. Pub. Relations, Detroit YMCA, Detroit 26, Mich. Deshler 1024\n^J^lJery, Walter B., Attorney, FCC, Chevy Chase, Md. Deshler 1020\nFardig, Sheldon P., Director WMBI-WDLM, Chicago 10, Ill.\nFarris, Frank M., Pres., WLA.Y, Sheffield, Ala.\nFarris, Genevieve B. WLAY, Sheffield, Ala.\nFell, JohnW., Prog. Dir. WCMI, Ashland, Ky.\nFinney, Marie, Dir.,State Dept, of Ed., Austin, Texas Deshler\nFisher, Mrs. H. Glen, Radio Chr.-Writer, Grand Rapids 3> Mich.\nFoltz, Ruth M., Coordinator, Cleve. Bd. of Ed., Cleveland, Ohio Deshler\nFordale, C. Louis, Student, Columbia University, New York, N.Y. Deshler\nFoster, Eugene S., Instr., Syracuse Univ., Syracuse, 10, N.Y. Deshler\nFoster, L. Fernald, ASR (Delta Chapter, Mich. State Coll., E. Lansing Deshler\n1773\n766\n1023\n461\n^irli\nBTirling, Betty T., Dir., Minn. School of Air, Minneapolis 14, Minn.\nGlade, Carl F., Student, OSU, Columbus, Ohio\nGolterman, Elizabeth, Dir., Div. of Audio-Vis. Ed., Pub. Sch.,St.Louis\nGose, Jean, Ed. Director, KMOX, St. Louis, Mo.\nGrayson, Mitchell, Producer-Director, Free Lance, New York City l6\nGrimmon, James W. Dir. of Audio-Vis. Ed., Ontario Dept, of Ed.,Toronto\nDeshler 737\n1471\nDeshler\nDeshler\nDeshler\nDeshler\nEackett, Retta, Ex. Secy. T.B. Assn., Morristown, Tenn. Deshler\nEaes, Larry, Farm Service Dir., WCCO, Minneapolis 2, Minn. Deshler\nHamilton, John L., Film Officer Br. Inf. Ser., Chicago 1, Ill. Fort Hayes\nHammond, Laurence, Pres., Laurence Hammond Productions, New York 19 Neil House\nHanna, Julia Mary, Radio Consultant, WBEZ, Chicago 1, Ill.\nHanson, Dr. J. B., Rep., Radio Monte Carlo, Monaco Ville\nHanson, Dyer Louise B.M. Founder, Grenelle, Paris, France\nHarrison, Henriette K., Natl. Radio Dir., New York\nHawkins, Gordon, Dir. Westinghouse Radio Stations, Inc.,Phila., Pa.\nHawkins, Sewell C., Asst. Dir. Ext., Univ. of S.C., Columbia 19, S.C\nHeberer,Miles, Dir. Radio Bur., State of N.Y., Albany, N.Y.\nHelman, Edwin F., Coordinator, WBOE, Cleveland, Ohio\nHemmeter, Kenneth W., Student, Mich. State College\nHenley, Joseph Q. Announcer WLCS, Baton Rouge, La.\nHenry, Joseph B., Chr. of Radio - Church Fed., Dayton 2, Ohio\nHerrick, Dwight B. Manager, Pub. Ser. Dept., Natl. Br. Co., New York\nHejritt, Harvey S., Sales, RGIL, Van Nuys, Calif.\nlinden, Vincent A. Ed. Rep., RCA, Glendale 7, Calif.\n/Highlander, John P., Prog. Dir., WSUI, Iowa City, Iowa\n518\n635\n405\n548\n805\n228\nDeshler 667\nDeshler 1260\nDeshler 1260\nDeshler\nDeshler\nBr.Lincoln 102\nDeshler 1778\nDeshler 1740\nDeshler 461\n1469\nDeshler\nDeshler 1053\nFort Hayes 515\nDeshlerl225\nDeshler 927"
}