{
  "id": "d200-35",
  "text": "MSB Headquarters\n1346 Connecticut Avenue, N.W.\nWashington 1, D.C.\nMEMORANDUM\nTO: NAIB Radio Beard\nFROM: Harold E. Hill\nRE: Use of HAEB Programs by the Educational Radio Network\nDATE: October 5, 1962\nSince the announcement by the NETRC in July that it had established a radio department\nand would assume operation of the live, interconnected Educational Radio Network,\nthe NAEB staff has been working with members of the NETRC staff on a mutually agreeable\nplan for the use of NAEB Radio Network programs by the ERN and member stations. (You\nwill recall that last October the Board approved a plan, to go into effect July 1, 1962,\nfor the use of NAEB programs by non-member stations which might rebroadcast programs\nof NAEB Network members. Although meant to be applicable to any such use, this plan\nwas designed primarily to meet the needs and problems of the ERN as then constituted,\ni.e., a group of stations working together rautuilly to improve their programing with¬\nout the benefit of outside support and coordination. The plan adopted at that time\nis, it seems to the staff, nob suitable as the basis for an agreement with the ERN\nas now constituted. Thus, the discussions mentioned above.)\nAfter two sessions with Don Quayle, newly appointed Director of Radio Services for\nthe NETRC, lengthy discussions with NAEB members involved in the ERN, and considerable\nstaff discussion, we have determined that the arrangement outlined in the enclosed\nproposal is equitable and mutually beneficial to both the ERN and the NAEB. Tiis\nproposal, has been discussed informally with Don Quayle (and he is new being sent a\ncopy of the attached, proposal), who has expressed the informal opinion that such an\narrangement will be satisfactory to the NETRC, perhaps with minor modifications. Vfe\nhave told Quayle that the staff cannot make a formal agreement of this nature without\nits being considered by the Board of Directors.\nTherefore, the staff is asking that the Radio Board consider this matter at their\nmeeting in Fniladelphia and make a recommendation to the full Board, (in order to\nsave \"orientation time\" at the Board meeting, informational copies of this memo, and\nthe attached proposal, are being sent to all other members of the Board.) As with\nother matters to be considered by the Board, it is assumed that this proposal will be\ndiscussed by NAEB members when they meet with their Board members in their respective\nRegional meetings at Fniladelphia and at the special meetings set aside for TV stations\nand radio stations. Then, a decision can be reached by the Board at the Thursday\nsession.\nTie staff recommends approval by the Board of the proposed NAEB-SRN agreement.\nHEH/mlm\ncc: Other NAEB Board members\nRobert E. Underwood, Jr.\nE. G. Burrows, Cbm., NAEB Network Program Committee\nXarry Frymire, Ohm., NAEB Radio Planning Committee"
}