{
  "id": "d200-38",
  "text": "September 21,1962\nMr. Ken Kager, Operations Manager\nUniversity of Washington\n325 Communications Building\nSeattle 5, Washington\nDear Ken:\nFirst let me thank you for invaluable contributions to the Executive\nCommittee meeting and express my regret that, after traveling that long\ndistance, there was not more time to take advantage of your presence. I\nblame myself for not percieving that we should have arranged a night\nmeeting as well.\nOne of these days I promise to respond to the points you have made in\nyour excellent memorandum.\nThe purpose of this particular communique is to pass along a letter\nfrom Graydon Ausmus, who conveys the alarming news that he may lose\nhis FM station. If this kind of situation is widespread, it indicates need\nfor some rather drastic and speedy action by NAEB.\nI suggested some time ago, you remember, that the Radio Planning\nCommittee and the Radio Board consider this problem to be their Number\nOne concern. It seems to me that one of the most useful steps that could\nbe taken in this connection would be to try to compose a memorandum which\nsets forth the most cogent and compelling arguments we can muster for the\npreservation of educational radio stations in the face of this sort of budget\ncompetition with ETV. I attempted to put some of this down in the letter I\nwrote to the Members of the Board of the Toledo Station when it was\nthreatened (see attached)—evidently I was not very persuasive since they\nwent right ahead and voted to do away with the station. I am sure a\nCommittee composed of some of our best people in the Radio field could\ncome up with a much better statement than mine. E$en if this did nothing\nmore than compel our people to do some hard thinking about the unique\nqualities of educational radio, it would be a worthwhile undertaking. It\nwould also be a useful document for any educational radio station manager\nto have in case he gets asked administrator-type questions along the line\nanticipated by Brother Ausmus."
}