{
  "id": "d200-5",
  "text": "November 9,1962\nDr. Loren Stone\nManager, KGTS-TV\nUniversity of Washington\nSeattle 5, Washington\nDear Loren:\nMy major regret about the convention was that l never got to talk to you, as\n1 had fully intended. Perhaps then X could have dispelled some of the apprehensions\nyou seem to have about the intentions of NAEB.\nIt is also unfortunate that you were not involved in another conversation—-the\none in the Board meeting which led to the motion to refer any possible package TV\nproduction to the ETV stations. If you had been, I believe you would not hold to\nthe notion that the Board is not concerned with what the Association doe*“to\nor tor the ETV stations/* This action was in direct response to the expressed\nconcern of the stations about NAEB engaging in TV production. It provides for\na referral procedure (which is what you and Gunn argued to from the start).\nThis permits consideration of possible special types of program and production\nand their evaluation as individual proposals. If the majority of stations, after\nconsidering a specific proposal on its merits, are opposed, it won't be under**\ntaken.\nBy now you will have received my memo to the stations. I believe that\nthis report accurately reflects the attitude and intentions of the Board toward\nthe ETV stations. Concerned as it must be to the interests of the entire member¬\nship, it was particularly responsive to the problems of the TV stations and\nexpressed this sensitivity by adopting the production referral procedure, by\nrequesting the Executive Committee to study ways of establishing structural\nchanges or procedures which would provide to more direct and responsive\nrepresentation to the TV stations, and by arranging the convention schedule\nto provide for more extended discussion and agenda attention re their special\ninterests *\nFinally, I am sure that I speak to “Hull, Miles, etc/* in saying that we\nrecognise shortcomings in the present Board structure election procedure and\nin the Washington staffing as they affect the TV stations and are sincerely\ndetermined to improve this situation. 1 trust that you, as a sincere person\nwith similar concerns, will cooperate in trying to work with us in finding the\nbest solutions. We need your help, Loren, and will welcome the constructive\nsuggestions we know you can contribute."
}