{
  "id": "d200-63",
  "text": "Lowell Institute Cooperative Broadcasting Council\n\\L/ \\\\T /~\"1 T) TT Educational television Channel 2, radio 89.7 me. and motion pictures\nW VjDil UNiversity 4-6400\n238 Main Street, Cambridge U2, Massachusetts\nMay 17, 1962\nMr. Richard B. Hull\nChairman/ Combined NAEB Board\nThe Ohio State University\n2470 North Starr Road\nColumbus 21, Ohio\nDear Dick:\nI am not sure whether this letter should be directed\nas Chairman of the Combined NAEB Board, I know tl\nwith the matter eventually. v-——\nYou asked me to write any comments thjrtrT^ight haveN^ohpeming the recent\nBoard Meeting in Columbus at the yERT. I ink** I expressed,both\nin and out of the Board Meeting, inf p&icephfor the action of the Board in\nsetting up TV production on a contmpr^gm^'through NAEB without getting\nsome reading, if not positive frc*m the active TV members of the\nassociation. As I said thex^^dJaV^ sfqc\\repeated a number of times, I\nam personally willing to glV^com^ietb^isu^o^; to letting NAEB try its hand in\nthe TV production business^ wthouglrour own experience with our small\nregional network convinceeNmVthat It JLsja very expensive and time consuming\nbusiness). HowevCrTtlJe 00 rhmhodJ&oard*s action in striking out the amend¬\nment to bring thi/tefthe vote orthe-adtive TV members does not seem reason¬\nable, particularly where the ^principal explanation for the Board's action is the\nfeeling that the nWm^ers woula be so weak-kneed that they could not be\ntrusted to decide the is^ue in/their own best interests as well as in the inter¬\nests of the associatibnjf outside pressure were applied to them.\nI had an opportunity to place a telephone conference call to Dick Burdick (WHYY),\nMike Collins representing Les Martin (WNED), Keith Nighbert (WENH), and Don\nSchein (WMHT), and, at a later time, Don Taverner fWQED). I think there is\npretty general agreement that they would be quite willing to see the NAEB under¬\ntake a trial run of TV program production. On the other hand, they are equally\nconcerned about the Board's unwillingness to taring this to the TV membership.\nI thought that their feelings would be quite strong on this, and this has proved\nto be so. They have asked me to take a firm position that the TV production\nproposal be laid out in a very concrete form so that the method of operation\nwould be clear to ail concerned and then brought to the attention of the TV mem¬\nbership for their opinion. There was some feeling in Region I that this arrangement\nyou, Ray, or BUI; but\n1 you will be concerned"
}