{
  "id": "d200-69",
  "text": "HAEB HEADQUARTERS\n3.346 Connecticut Avenue, N.W.\nWashington 6, D.C.\nmmmm\nTO: HAEB Board of Directors\nFROM: Harold E. Hill\nDATE: March 21, 1962\nEnclosed is a copy of a nemo ire sent on February 20 to the members of the HAEB Radio and\nTelevision Planning committees relative to the FCC proposal to institute licensing fees\nfor broadcast stations. Informational copies of the memo were sent to Dick Hull, Board\nChairman, Raymond Burlbert, TV Board Chairman, and Ken Kfcger, Radio Board Chairman. Hurl-\nbert, I believe, duplicated the memo and distributed it to the rest of the TV Board.\nIn response to the memo, we received seventeen replies. Of the 10 member TV Planning\nCommittee, only 5 expressed opinion. All were in favor of a token fee ranging from $10\nto $30. Of the nine members of the Radio Planning Committee who responded, 5 were in\nfavor of a nominal fee, 3 against a fee of any kind, and 1 ms undecided. She three\nTV Board members who wrote about this were all in favor of a token fee.\nShe reasoning of all those in favor of a small fee was similar. Riyment of a fee would\nbe \"an indication of interest and support\" on the part of those in educational broad-\ncasting; it would be in the \"best professional interests, \" and it would \"help to counter¬\nact the impression that the educational broadcaster is 'along for the ride.*\" The majority\nof those assenting were, naturally, in favor of the fee only if both non-cousnercial and\ncommercial licensees were expected to pay. Sane indicated that the token fee suggested\nin our memo ms too high and that a much smaller fee should be proposed for educational\nstations.\nIhe dissenters thought payment of a fee by the educational broadcasters a \"dubious honor.\"\nOne felt that non-payment would be more valuable recognition of educational broadcasting\nthan payment of a nominal fee. \"Do we not demean ourselves when we say1’, *We cannot pay\nthe whole fee, but here's a nickel for your trouble, anyway'\"? Another more technical\nobjection ms that broadcast stations (both commercial and non-commercial) should \"be in\nthe same category as newspapers, magazines, journals, etc*, none of which are required to\npay a federal licensing fee.\" One of the Board members pointed out that since stations\nuse the public domain in terms of the Communications Act of 1934, the Government \"should\nbear the expenses of Issuance and review.\" Two respondents felt that neither commercial\nnor educational stations should pay a fee.\nObviously we want to file comments on this matter with the FCC, end we would appreciate\nyour comments and suggestions so we may consider them along with those received from the\ntwo committees.\nWe must file with the FCC before April l6, 1962; therefore, may we have your ccamnents not\nlater than April 2? (Obviously, those Board members who have already written us on this\nmatter need not do so again.)\nEEH/mlm\nInformational cc:\nHAEB Radio Planning Committee\nHAEB 17V ELanning Committee"
}