{
  "id": "d200-70",
  "text": "NATIONAL\n--\nASSOCIATION\ntfj?, O'* Or & .\nOF EDUCATIONAL\nBROADCASTERS\nMr. William Harley, president\nNAEB, Suite 1119\nDuPont Circle Office Building\n1346 Connecticut Avenue, N.W.\nWashington 6, D.C.\nOFFICE OF THE REGIONAL DIRECTOR\nMarch 7, 1962\nDear Bill:\nI want to tell you again how much we all appreciated having you\nwith us for the Region VI meeting in San Francisco. Short though it\nnecessarily was, I*m sure the meeting was successful, largely due to\nyour presence. Wonder if you were as surprised as I at how fast\nthings are moving in California?\nIn addition to thanking you for making the trip out to see us,\nI want also to set down some of the things I mentioned briefly in the\nshort time we had to talk privately about NAEB matters, particularly,\nmy thoughts about the upcoming Board meeting.\nIn the few Board meetings I have been privileged to attend, I\nhave felt some frustration each time because of the length of the\nagenda as compared to the scheduled end of the meetings. While I\nthink most, or all, of the items considered were necessary, they nev¬\nertheless were so time-consuming there was little, if any, time left\nfor the principal function of the Board. I couldn*t help being\nreminded of Jim Miles* accurate, if elaborate, phrasing: ..Adminis-\ntrivia should be relegated to the President and his staff. Only pol¬\nicy considerations should come before this Board in order that from\nits wisdom it may truly guide the overall destinies of the Association.\"\nI would substitute the word \"administration\" for \"administrivia\"\nin Jim*s writing, in recognition that neither you nor Harold have\ntime for trivia, either. And certainly many administrative matters\nmust come before the Board. Yet, the Board is not fulfilling its\nobligation if it allows such matters to preoccupy its attentions.\nSection 1 of Article 6 of the current By-Laws is quite specific: \"The\nBoard of Directors shall determine the policies of the Association\nand shall direct its officers to do all things necessary to carry out\nits policies.\"\nBecause administrative and policy decisions for an organization\nas large, as varied, as geographically far-flung and as diversified\nin member interests as the NAEB may require unpredictable amounts of\ntime for proper formulation, I propose that the Board discontinue the\npractice of setting, in advance, a date and time for final adjournment.\nWhen Board members have assembled for their semi-annual meeting, I\nbelieve they should adjourn only when there is consensus that all of\nthe work of the Board is done as well as it can be at that time and\nplace."
}