{
  "id": "d200-71",
  "text": "Mr. William Harley\n3-7-62 Page 2\nWhat I am really saying, then, is that NAEB Board members\nshould go to Columbus with a primary objective of looking after the\ninterests of the NAEB. If it is necessary for the full Board, the\nsub-Boards, or Board committees to meet during IERT sessions (except\ngeneral sessions) they should do it. Further, if it becomes neces¬\nsary to stay over to Saturday — or Sunday — they should stay. I\nhave no reason to think this would be necessary, but I think it is a\ncontingency that should be prepared for in advance.\nI would like to see the Columbus Board sessions begin with a\nmeeting ;df the full Board, on a day and at a time set by you and Dick.\nI think this first session should not have a set ending time -- that\nis, if its purpose isn*t achieved in time for the IERT keynote session,\nthen the same business should be resumed at the next session. I would\nsee this first session as a general discussion of policy matters, and\nwould propose that we adopt as a ground rule that no motions could be\nmade or acted upon. This should be a \"brainstorming\" session -- an\nattempt simply to discover and define areas that should receive Board\nconsideration.\nI would propose an agenda something like this for the first ses¬\nsion:\n1. Usual report to the Board from you and Harold.\n2. Presentation of the proposed budget, and a financial report.\nThis would be for background information, and not for action at that\ntime.\n3. Distribution of a list of items proposed by NAEB's officers\nand committee chairmen for the agenda of the \"action\" session of the\nBoard.\n4. \"Brainstorming\" session, in which every member of the Board\nhas an opportunity to bring up ideas about NAEB activities and poli¬\ncies for general discussion. I*m enclosing a short list of the kind of\nsubjects it would seem to me should be discussed, simply for illustra¬\ntion of what I have in mind.\n5. Assignment, by the chairman, of some of the topics that might\nemerge from this session to either the Radio Board, the TV Board, or\nto a sub-committee of the full Board, along with instructions as to when\nthe full Board will re-convene.\n6. Adjournment of the first session.\nChairmen of the appointed sub-committee(s), and the chairmen of the\nRadio and TV Boards, should then consult and, in coordination with the\nIERT schedule, set times for their various groups to meet. (The chair>\nmen of the Radio and TV Boards would likely have additional items for\nconsideration by their respective groups through advance preparation\nbefore the Columbus meeting.) The sub-groups would then meet and com¬\nplete their assigned tasks."
}