{
  "id": "d200-82",
  "text": "CHANNEL\nSTUDIOS—UNIVERSITY OF WASHINGTON\nTRANSMITTER—EDISON TECHNICAL SCHOOL\nKCTS-TV\nTTLE5,WASHINGTON RECEIVED\nNovember 3, 1961 HEA0OUART£RS\nSEAT\nBill Harley, President\nNAEB\nWashington, D. C.\nNOV 6 196!\n1.1,12,1,2,9,4)5,5\nl\nDear Bill:\nAs you know the Television Board held a special meeting with the\nmanagers of the ETV stations during the course of the recent NAEB\nconvention and subsequently the Board met, separately, to consider\nsome of the matters recommended to it by the stations.\nThe following matters are reported by the Television Board to the\nPresident of the Association, either with recommendation or for\ninformation:\n1. It was the urgent request of the stations and is recommended\nby the Television Board to the staff and to the Convention Committee\nthat a special meeting time be reserved at all future NAEB con¬\nventions for a meeting of the managers of the ETV stations with\nthe Television Board to permit discussion of matters of common\ninterest and concern to the television stations.\nThere was considerable expression by the television station\nmanagers that there was too little in the agenda of the convention\nthat was of direct interest to the managers and it was their hope\nthat future conventions could schedule sessions (concurrent with\nothers, probably) that would provide a source of specialized infor¬\nmation for ETV station people. The convention provides the only\nopportunity, outside the NETRC managers meetings for the stations\nto exchange information with each other -- and structured meetings\nseem to provide a useful starting point for such exchange.\n2. The stations gave their support to the recommendations from the\nMadison Seminar that NAEB undertake to inventory the television\nprograms available from sources other than the Center and develop\nand maintain a catalog of such information. This should include\nprograms available for dxchange among the stations and programs\nbeing produced by non-TV station production sources. There was no\nagreement reached amon^ the stations on rates to be charged for\nexchange of video tapes, and it developed that the previously agreed\nrate for exchange of kinescopes of 50q per minute is no longer in\ngeneral use.\n3. The stations requested and the Television Board approves a\nrequest to the NAEB Board and the Development Committee that the\nUniversity of Washington Seattle Public Schools King County Schools Seattle University Seattle Pacific College Seattle Public Library"
}