{
  "id": "d1148-0",
  "text": "Vol. IV, No. 13 DuPont Circle Building, Washington 36, D.C. August 30, 19~63\nETV PROGRESS REPORT\nOf the applications filed with the FCC since January 1, 1963, 13 of the\n48 UHF were educational and two of the 15 VHF were educational.\nTarget dates for new ETV stations coming on this fall are Sept. 12 - WHYY-TV,\nCh. 12, Wilmington, Del.; Sept. 15 - WNTV, Greenville, S.C.; October 1 - WEIQ, Ch.\n42, Mobile, Alabama; Nov. 1 - KFME, Ch. 13, Fargo N.D. (Claire Tettemer is new\nGen. Mgr.); Jan. 1, 1964 - KUSU-TV, Ch. 12, Logan, Utah.\nPEACE CORPS TRAINING FOR ETV\nA group of l6 Colombians and 18 Peace Corps members have been attending a\ntelevision training course at KUON-TV, Lincoln, Nebraska, in preparation for staffing\nan adult education project on TV in Colombia. After completing the course (August 31),\nthe group will have a brief vacation and then report to Washington,September 11.\nIn the Capitol City, the group will be entertained at the Broadcasters Club, meet with\n<_ USIA and NAEB officials, and visit studios of WETA-TV. Remainder of itinerary:\nSeptember 13, Hagerstown; September 14-19, New York (NETRC, networks, WNDT);\nSeptember 20, depart for Bogota.\nHEW ANNOUNCES ADDITIONAL FILINGS\nMost recent application for Federal ETV grants (listing total estimated project\ncosts): School District of Kansas City, Mo. $136,000 to expand KCSD-TV, Ch. 19;\nFlorida Central East Coast ETV Inc., $465,358 for new station at Orlando; Bowling Green\nState U., $132,779 for new station at Bowling Green, Ohio; Oregon State Board of\nHigher Ed., $141,723 for expansion of KOAP-TV, Ch. 10, Portland and $277,678 to expand\nCh. 7, Corvallis; U. of S.D., $19,135 for expansion of KUSD-TV, Ch. 2, Vermillion; and\nBoard of Ed., Ogden City, $75,062 for expansion of KOET, Ch. 9, Ogden,Utah. Total\napplications accepted for filing to date: 24. The first grants are expected to be\nmade by September 1.\nNAACP (Aug. 13) withdrew requests for extension of the comment period on\napplication for funds for WHRO-TV, Hampton, Va. and new stations to be built at\nCharleston and Greenville, S.C., which it said would be operating in areas which\npractice school segregation. When NAEB pointed out extension would prevent stations\nfrom getting on in time for school year, NAACP withdrew so as not to obstruct comple¬\ntion of plans.\nINTERNATIONAL ITV MEETINGS\nThe European Broadcasting Union (of which NAEB is an associate member) has\nannounced that the Second International Conference of Radio and Television Organiza-\ntions on School Broadcasting will be held in Tokyo, April 9 - 15, 1964. The first\nconference took place in Rome in December, 1961 with RAI as host. NHK will serve as\nhost for the second conference and the Organizing Committee will meet in Rome in\nOctober."
}