{
  "id": "d1148-0",
  "text": "Volume V Number 17\nDecember 2k, ±9$+\nNAEB PUBLICATIONS SERVICE IMPROVED\nSeveral changes are being made in the NAEB Newsletter and Washington Report\nto expedite and improve the service of these publications to NAEB members. The\nchanges will be put into effect with the January issues.\nMost of the information previously published in the bi-weekly Vfeishington\nReport will be available through Divisional Newsletters, and the Washington Report\nwill be published as an occasional paper reporting and commenting in depth on\nspecial topics.\nThe printing and mailing schedule for the Newsletter has been revised to\naccommodate last minute news items. Institutional Members of the Association will\nreceive the Newsletter via first class mail.\nTo enlarge the space available for news, the placement information will be\ndistributed in two different ways. Persons seeking positions (personnel available)\nwill appear as an insert with the mailing to Institutional Msmbers; positions avail¬\nable will continue as a part of the Newsletter.\nNAEB RECEIVES FORD FOUNDATION GRANT\nA grant of $600,000 to the NAEB for the support of a three-year program\nfor the improvement of televised teaching was announced on December 7 by NAEB.\nThe project will center around a program of national and regional seminars\nand field consultant service for institutions using or planning to use television\nfor instruction.\nThe appointment of a staff for the project will be made shortly after the\nfirst of year, and specific details of the program will be announced at that time.\nHARLEY APPOINTED TO ADVISORY COMMITTEE\nAssistant Surgeon General A. W. Christensen, Chief of the Public Health\nService, Bureau of State Services, has announced the appointment of NAEB President,\nWilliam G. Harley, to the new Advisory Committee on Health Education and Communi¬\ncations.\nThe committee will review all health education and communications research,\ntraining, and practices in the seven divisions which comprise the Bureau of State\nServices. It will recommend priorities and changes which ’’will enable the Bureau\nto keep abreast of technology and fulfill its responsibilities with greater\neffectiveness.\"\nHarley will serve on the committee's panel on communications and behavioral\nresearch."
}