{
  "id": "d1148-1",
  "text": "o\nUSOE PUBLISHES NEW MAGAZINE\nBeginning with a December-January issue, the U. S. Office of Education\nwill publish a new magazine, American Education, which will report \"to the\npeople of the United States on the Federal Government’s role in education.\"\nIt will replace the magazine. School life and Higher Education and will appear\n10 times a year.\nThe subscription price is $3.00 a year and subscriptions may be ordered\nfrom Superintendent of Documents, Government Printing Office, Washington, D. C.\n20402.\nETV APPLICATIONS ACCEPTED FOR FILING\nTwo applications totaling $530,705 have been accepted for filing under\nthe ETV Facilities Program. The applications are from:\nWashburn University of Topeka, Kansas, for $213,937 to activate Channel\n11 at Topeka. Total cost of the project is $427,873*\nThe Board of Regents of the Universities and State College of Arizona\nfor $316,719 to expand the facilities of Channel 6 at Tucson, Arizona for use of\nthe University of Arizona there. Total cost is estimated at $524,249•\nHEW GRANT TO ARIZONA STATE UNIVERSITY\nApproval of a grant of $141,295 to Arizona State University, Tempe,\nArizona was announced on December 10. The money will be used to expand facilities\nof Channel 8, KAET-TV, at Tempe, through the purchase of a videotape recorder,\nantenna, tower and transmitter. An additional 20,500 people, including 8,465\nstudents in 24 schools, will be served.\nFCC BEGINS STUDY OF STEREOPHONIC SOUND FOR TV\nThe FCC has begun an inquiry to determine whether stereophonic sound in\ntelevision broadcasting is desirable. It has issued a Notice of Inquiry inviting\ncomments on the subject until January 22, 1965. The closing date for filing reply\ncomments is February 8.\n\"It is the purpose of this proceeding to determine whether or not the\nemployment of stereophonic sound in TV broadcasting will add to the realism or\notherwise contribute a worthwhile improvement to the overall portrayal of the\nprograms presented by TV broadcast stations and if so, what system of producing\nstereophonic sound transmission and reception should be employed. Pertinent data\nobtained experiments and tests will be most helpful. Data is also desired as to\nthe effect of stereophonic sound transmission on the quality of picture and sound\nreception both for monophonic TV receivers and for those equipped to receive the\nstereophonic sound transmissions accompanying the picture transmissions. We will\nalso be concerned with bandwidth requirements as well as costs and complexity of\ninstalling and operating transmitting and receiving equipment.\""
}