{
  "id": "d1148-1",
  "text": "Word has just been received from Henry Cassirer, from the Paris UNESCO\noffice, that the UNESCO ETV Seminar, scheduled for Mexico City, Oct. lU - Nov. 10\nhas been postponed until the first semester of 1964. NAEB had been requested to\ngather suitable film materials for use in the lectures.\nFCC ACTIONS\nThe Commission (July 30) granted the petition of the Board of Education of the\nCity of Atlanta to reserve a second UHF channel for educational television in that\ncity by shifting Ch. 57 from Marietta, Ga. to Atlanta and reserving it for non-com¬\nmercial use.\nPetitioner, which now operates WABE-FM said WETV, Ch. 30, asserted that one\nETV channel in Atlanta, with projected enrollment increases of 31$ and 21$ by 1970\nfor secondary and elementary schools, cannot provide sufficient program offerings at\ndesirable times for elementary and secondary school service, in-service training\nand research, and adult programs. The second channel is to be used primarily for\nhigh school courses for credit.\nAtlanta will beccmethe sixth city to acquire multiple ETV facilities.\nNAEB OPPOSES DELETION OF CHANNEL 48\nOn August 26, NAEB, through its general counsel, Cohn and Marks, filed a\npetition in opposition to a request by Chapman Radio & TV Co. requesting deletion\nof the reservation for non-commercial use of Ch. 48, Birmingham. Comment cited\nNAEB \"Survey of the Needs of Education for TV Channel Allocations,\" which pointed\nout that long range needs for ETV will require more than one outlet in many cities\nand specifically urged retention of Channel 48 so that educational authorities,\nwhile not having to apply for it at the present time, would have it available in the\nfuture for the completion of their State-wide ETV system.\nDALTON LEAVES NCTA\nWilliam Dalton, who has served as President of the National Community TV\nAssociation, Inc., since January, 1961, has resigned as of September 30. Dalton was\nprimarily responsible for the push to involve his members in extending services of\nETV stations in communities CATV operators serve. He established ETV Policy Council,\nscheduled educators to speak at national and regional conferences, and appointed\nLoren Stone (KCTS-TV) as a consultant on educational application of Community TV\nantenna systems.\nNCTA published two reports re ETV; \"Guidelines Concerning the Responsibilities\nof the CATV Industry in Education\" and \"ETV and the Role of CATV.\" Of the CATV\nsystems now able to receive ETV stations, 90$ are providing extended coverage.\nSignals come from 23 ETV stations and MPATI.\nIn a recent letter to Chairman Henry, Dalton said that ETV would be available\nin the near future to \"an additional 40,000 homes, 174 elementary and high schools,\nand nine colleges\" through the facilities of 27 NCTA operators presently installing\nfacilities to pick up ETV signals."
}