{
  "id": "d991-4",
  "text": "-5-\nThe President reported the appointment of a Special Interim\nAdvisory Committee regarding steps toward strengthening the Ameri-\ncan Council on Education with the following membership: 0. C.\nAderhold; Louis T. Benezet; C. Clement French; Edmund J. Gleazer,\nJr.; Thomas H. Hamilton; Gaylord P. Harnwell; David D. Henry, ex\nofficio; Theodore M. Hesburgh, C.S.C.; 0. Meredith Wilson; and\nLogan Wilson, ex officio. It was VOTED that authorization be\ngiven to the continuance of this Committee until the President of\nthe American Council on Education meets with the new Board of\nDirectors.\nThe President reported the resignation of J. L. Morrill as\nChairman of the Africa Liaison Committee and the appointment of\nArthur S. Adams as Chairman. He also announced the appointment\nof the following new members: R. Taylor Cole and Payson S. Wild.\nNew Business\nUpon request from the Committee on Urban Renewal, supported\nby the President's recommendation, it was VOTED to establish the\nproposed urban renewal project subject to the availability of\nfinancial resources. In brief this project would establish an\noffice to supply special services to colleges and universities\ndirectly involved in urban renewal programs, including detailed\ninformation on the progress of such programs, a close liaison\nwith the Federal Urban Renewal Agency, and access to expert legal\ncounsel on matters of general policy. It is believed that the\nfifty or more institutions directly concerned would be willing to\nunderwrite the costs of such a project for an experimental period\nof three years. The proposed annual budget is $47,585.\nThe request from the United States Office of Education\nregarding a project of simplifying and standardizing degree nomen¬\nclature and degree abbreviations was presented. Lnterest of the\nCommittee was expressed and it was VOTED to authorize the Presi¬\ndent to appoint a special committee to consider ways and means\nof proceeding with the project.\nThe President reported a request from the United States\nOffice of Education that the Council undertake a project con¬\ncerning problems of copyrights, royalties, compensation, and\nteacher rights in the production, performance, and distribution\nof educational radio and television programs, educational films,\nand programs for teaching machines. It was VOTED to approve the\nproject, to receive the necessary funds, and to authorize the\nPresident of the Council to organize the project. The Committee\nexpressed the view that people that are centrally concerned with\ninstructional work in colleges and universities should be in¬\nvolved."
}