{
  "id": "d867-12",
  "text": "\"RURAL” is more than the negative, or opposite, of \"urban” or \"metropolitan.”\nRural is a distinct and positive form of social organization. This is recognized\nin the existence of rural sociology as a distinct profession within the general\ndiscipline. Understanding this distinction is the necessary prerequisite to\nformulating policies and strategies for an attack on rural poverty.\nThe Facts of Rural Life\nThe first difference is that in rural areas fewer people occupy larger spaces.\nThe population of the 16 counties in Eastern Montana, for instance, averages out\nto little more than two per square mile. This immediately introduces factors of\ntime and distance that directly affect the delivery of services of all kinds:\neducation, health, shopping, libraries, employment, law enforcement, religion.\nThe cumulative effect has been defined by Professor Carl Kraenzel, foremost\nrural sociologist of the Great Plains, as \"the social cost of space.\"\nCentralization of services is important in cities; OEOfs health thrust\nthere has been to create \"one-stop\" health centers. In rural areas, this\nfean-tgrVfcirieach of the decentralized service stations must be\nmulti-purpose. The county court house houses the Extension agent, the Public\nHealth nurse, the mental health-retardation-alcoholism-comprehensive health\ncommunications agent, as well as the sheriff, the judge, and the Commissioners.\nThis, in turn, means that the political presence of the County is more\ninvolved, and more visible, than is true in the highly specialized metropolis.\nThe CAA relies on the membership, and the support, of the County Commissioners,\nwho have the power to budget their participation - or to block any action at all.\nIt means, further, that all organizations and plans for improving living\nconditions and economic status interlock with each other, and with the prospects\nfor economic viability and advancement of the area as a whole. Hygiene and\nsanitation, preventive medicine and acute or long-term treatment, schooling and\nvocational training and jobs, communications and transportation, along with"
}