{
  "id": "d867-16",
  "text": "December 3, 1968\nMEMORANDUM\nTOs William G. Harley\nFROM: James A. Fellows\nThe discussions about Title III of the Public Broadcasting Act\nthroughout the convention suggest that there is some confusion,\nnot only about the activities of the Commission on Instructional\nTechnology, but about the wording of the Act and what a reasonable\ninterpretation of it might be.\nIt seems unlikely that either the Commission, its staff, various\nad hoc groups that have been summoned to \"advise\" the staff,\nor other current \"inputs\" will have any clarifying effect upon\nthe role and the outcome of the Commission. So here is a try\nat a new approach; it may not resolve the question entirely but\n•it could give us a new vantage point from which to study and project\nthe work of the Commission.\nWhat did the Act say? It authorized the Secretary of H.E.W. \"to\nconduct ... a comprehensive study of instructional television and\nradio (including broadcast, closed circuit, community antenna\ntelevision, and instructional television fixed services and two-\nway communication of data links and computers)* and their relation¬\nship to each other and to instructional materials such as video¬\ntapes, films, discs, computers, and such other aspects thereof as\nmay be of assistance in determining whether and what Federal aid\nshould be provided for instructional radio and television and\nthe form that aid should take, and which may aid communities,\ninstitutions, or agencies in determining whether and to what\nextent such activities should be used.\"\nNote that the study is to be of instructional television and radio\n(all forms of transmission, not just broadcasting) and that it\\is\nto be electronically comprehensive (dealing with electronically\nprocessed information, whether the output be on a picture tube or\na computer print-out). Nor is it to be so broad that it deals\nall hardware for the display of information, except as this\n* The parenthesis is in the Act"
}