{
  "id": "d867-4",
  "text": "-3-\nkeenly aware that in many instances students and educators are disappointed\nwith television because of poor programming. Unfortunately, however, they\nblame the television medium rather than the educators or teachers who\ndevelop the various programs in the first instance. I am also aware of why\nNEA takes such a vigorous and negative attitude. They are concerned with\nprotecting teachers of the trade union type of attitude. Many teachers\nare prone to regard television and radio in a negative fashion for several\nreasons: the most obvious is because they do not understand good teaching\npractices in the first instance and they fear the instrusion of televised\ninstructional programs which have been prepared and taped with superior\nteachers. I could continue indefinitely but you know and the others who\nare receiving a copy of this memorandum know the pros and the cons of\nthe entire situation.\nAs I said in my other memorandum our major job is to see that the\nCommission receives every possible shred of evidence which will help\nthem appreciate the value of teaching by television provided the programs\nare superior in every way--and that means not only contact, but the\npsychology used by the superior teacher in attracting and holding the\ninterest of the students and making indelible impressions on his mind\nconcerning the subject matter being taught.\nOur primary job is to persuade the Commission to recommend more than\nanything else that additional objective and responsible research be carried\nout before conclusions are reached about the value of teaching by television\nand/or radio. Unless we can prove and show the station managers what we\ndid, what we said, then if there is a move away from televised instruction\nby public schools through ETV broadcast stations we will have to admit\nfailure on our part for not having properly programmed our campaign to\nthe Title III Commission. So far I have not read anything that we have\nsent to the Commission that I would rate as good.\nCSF/mah\ncc:\nMr. William G. Harley\nMr. James A. Fellows\nMr. Robert Mott\nMr. Robert Maull\nAttachment"
}