{
  "id": "d167-16",
  "text": "University of North Carolina in chapel hill r North Carolina State College of Agriculture and Engineering in raleich * The Woman’s College in Greensboro\nJOHN YOUNG\nDirector of Television\nMarch 23, 1965\nCHAPEL HILL\nMr. Harold E. Hill\nExecutive Vice President\nNational Association of Educational Broadcasters\n1346 Connecticut Avenue\nWashington, D. C.\nDear Harold:\nI’m sorry you could not be with us in Williamsburg. I think it is fair to\nsay that the sessions were very meaningful, and we had very good attendance\nconsidering the distance from many sections of our Region. We played musical\nchairs with the various meeting rooms, making changes at the drop of a hat.\nThis resulted from the fact that Hugh DeSamper could not predetermine the prob¬\nable attendance at the various sessions, held as they were in rooms varying widely\nin size.\nTwo actions were taken in which you might be interested. Jim Etheridge pro¬\nposed in absentia that the base of leadership for the Region be broadened. Earlier\nRegion II had determined that the director for the individual member division would\nbe the nominal head of the Region. (This action was taken as an expedient measure\nfollowing the reorganization of NAEB. ) In Williamsburg a resolution was unanimously\nadopted creating a Region II Executive Committee composed of 1) any national\nDirector of any division who resides in Region II; 2) an elected regional director\nfor any division which does not have a national director living in Region II;\n3) the conference chairman for the next regional conference, to be selected by the\ncommittee. The resolution as it passed incorporated the idea that the Executive\nCommittee would elect its own chairman. No terms of office were specified in the\nresolution as it passed.\nAn election was held by the television membership, and Holt Riddleberger was\nelected as Region II Television Director (Regional Director). Therefore,\nJim Etheridge (Individual), Roy Johnston (Instructional), Marjorie Newman (Radio),\nJim Petersen (Institutional), and Holt Riddleberger (Television) comprise the new\nRegion II Executive Committee.\nThe other action I mentioned is not really an action at all - it is a matter\nleft quite indefinite. It concerns the site selection for the next Region II meeting."
}