{
  "id": "d167-18",
  "text": "WUNC-TV\n/ Channel ^\nTHE UNIVERSITY OF NORTH CAROLINA\nUniversity of North Carolina in chapel hill * North Carolina State College of Agriculture and Engineering in raleich * The Woman’s College in creensboro\nJOHN YOUNG March 23. 1965\nDirector of Television\nCHAPEL HILL\nMr. James Etheridge! Jr.\nExecutive Secretary\nFlorida ETV Commission\n303 Dodd Hall\nFlorida State University\nTallahassee. Florida 32306\nDear Jim;\nI think the happiest news of the Williamsburg Conference was the report\non Sunday morning from Bill Gilbreth that your good wife has finally begun to\nrespond favorably to treatment. We thought of you many times throughout the\nconference, and you continually had our best wishes. Of course we missed you,\nand I know you regretted not having been there. It was a most pleasant confer¬\nence - the Williamsburg Conference Center is an excellent place to meet, and\nHugh DeSamper and his Host Committee did a very fine job. The shifting of\nrooms became something of a joke but really didn't interfere with the content\nof the meeting at all. We had plenty of meeting rooms that varied widely in\nsize from auditorium types to small conference table rooms. Hugh DeSamper\ncould not judge just how many would attend each session, and we frequently\nfound that we needed to swap or change rooms as the attendance at the varying\nsessions could be more accurately predicted. The information you mailed to us\nwas distributed and proved quite helpful. We presented your proposal for broad¬\nening the base of leadership, and it was unanimously adopted. Holt Riddleberger\nwas elected as Regional Television Director, and so it seems as though the fate\nof Region II is closely tied up with the citrus crop - all five of our regional dire¬\nctors are Floridians. I suggested that the directors hold a meeting in Williams¬\nburg, but this didn't prove practical, and so the new executive committee has\nnever formally met. Perhaps that's just as well and will give you an opportunity\nto meet with them in Florida. It would certainly seem appropriate to me for you\nto call a meeting* I shall enclose a copy of a letter I'm sending Harold Hill\nreporting on the situation.\nThank you for your telegram. The flowers could express only to a limited\ndegree our real concern. Now a few random comments. Betty Smith planned\nexcellent sessions for the instructional division. I heard comments to this effect"
}