{
  "id": "d167-21",
  "text": "John Young, Director of Television, WUNC, University System of North\nCarolina, has been appointed General Chairman of the Region II NAEB Con¬\nference to be held at Colonial Williamsburg, Virginia, March 19-21, 1965.\nAt the request of James Etheridge, Jr., Executive Director, Florida\nETV Commission, Tallahassee, national Individual Member Director of\nRegion II, Young will appoint such Conference Committees as he deems\nnecessary and, with Hugh DeSamper of Colonial Williamsburg and co-hosts,\nwill be in general charge of the annual Region II sessions.\nEtheridge said that he and other national directors in the region \"will\nassist Mr. Young and his Committees in any way that he wishes.M\nPrior to the re-structuring of NAEB, the Region II Conference adopted\na motion designating the new Region II Individual Member Division director,\nwhomever elected,,to be Chairman of the Region II Conference. Later,\nEtheridge was elected to the national Board and thus became \"interim chair¬\nman\" of Region II.\n\"I hope the first business session of the Williamsburg Conference will\nconsider broadening the leadership of, and participation in. Region II\nactivities -- enlisting representatives of all Divisions of NAEB and of\nspecial fields of interest, perhaps as a Region II Executive Committee\nwhich would elect the Region II Chairman,\" Etheridge said.\n\"In addition to the service of other Divisions' national directors\nin Region II, I earnestly hope that increased participation by engineers\nand all technical personnel, by producers-directors, and by \"TV teachers\" --\nboth studio teachers AND classroom teachers -- can be vigorously promoted,\"\nEtheridge added. He offered his assistance toward these objectives.\n\"I am deeply grateful to Mr. Young for acceding to my plea that he be\nGeneral Chairman of the Williamsburg Conference sessions, and I am sure\nhis able leadership will be supported by the full cooperation of everyone\non whom he calls,\" Etheridge said.\nM #"
}