{
  "id": "d167-25",
  "text": "2\nCuyler P. Fields, Box G, Winthrop College, Rock Hill, S. Cr (Winthrop Coilege)\nJohn Fiske, Box 8021, Univ. of Miami, Coral Gables, Fla. ( Univ. of Miami )\nRoy Flynn, Winthrop College, Rock Hill, S, C. (Winthrop College)\nDuane Franceschi, 202 Dodd Hall, Florida State Univ., Tallahassee, Fla. (WFSU-TV/FM)\nLee E. Franks, 10 Columbus Circle, New York, New York ( National Educational Television)\nMrs. Mary Anne Franklin* 809 East Marshall St. Richmond 19, Va. (Richmond Public Schools)\nRobert Fredrickson, Television Education, Room 482, Education Building,, Raleigh, N, C.\n(N. C. State Dept, of Public Instruction)\nDr. Lawrence T. Frymire, FCC, Washington, D.C. (FCC Chief, Educational Broadcasting Branch)\nLynn E. Giese, 330 Carlton Terrace, Athens, Ga, (WGTV - Univf of Ga.j\nGerald E. Gpdfrey, 129 Cindy Lane, Birmingham 14, Ala. (Birmingham Area ETV Studio)\nMrs. Mary P. Gordon, Television Education* Room 482, Education Building, Raleigh, N.C.\n(N. C. State Dept, of Public Instruction)\nLuther R. Gower, 603 Owen Building, Columbia, S, C. (Southern Bell Telj and,Tel* Co.)\nPaul Grady, III, Box 8021, University of Miami, Copal Gables, Fla. (Univ, pf Miami)\nRobert W. Grimes, 2326 Broadmoor Place, Gulfport, Miss. (WUTC-TV Keesler AFR)\nRobert H. Hallowell, III, 1 LeFevre Lane, New Rochelle, N, Y. (Adler Educational, Systems)\nFrank R. Hamlett, Jr., 106 High Point Pr,, Pensacola, Fla. (Pensacola Junior'College)\nJohn R. Haney, WUFT-TV, University of Fla., Gainesville, Ela. (WUFTrTV)\nMrs. John R. Haney, 3Q8 SW 40th Terrace, Gainesville, Fla.\nJohn R. B. Hawes, Jr., Television Education, Room 482, Education Building, Raleigh, N. C,\n(North Carolina State Dept, of Public Instruction)\nJames R. Herd, 2420 SW 34th Ave., Miami, Fla* (WTHS-TV, Channel 2)\nEdward L. Herp, 202 Dodd Hall, Fla. State Univ., Tallahassee, Fla. (WFSU-TV/FM)\nHarold E. Hill, 1346 Connecticut Ave. Washington, D.C. (Vice President, NAEB)\nL. L. Hinton, 612 W. Lane St. Raleigh, N« C, (Minnesota Mining and Mfg, Co.)\nNelson Hitchcock, WXGA, Box 61, Waycross, Ga. (WXGA-TV, Univ, of Ga.)\nChester R. Imes, WETV, 740 Bixmark Road, NE, Atlanta, Ga. (WETV - Atlanta Board of ETV)\nRoy J. Johnston, Box 8021, Univ. of Miami, Coral Gables, Fla. (Univ, of Miami)\nMr. and Mrs. Wendell W. JohnsOn, 821 South Gay, Auburn, Ala. (Auburn ETV)\nDan Joiner, 518 N. Florida, Deland, Fia. (Stetsop Univ^,)\nWendell D, Jones, ETV Department, Auburn University, Auburn, Ala. ( Auburn ETV\nNetwork)\nLewis W. Kendrick, Chief, Television Center, Building 1402, Maxwell AF Base, Ala.\n(Air University, USAF)"
}