{
  "id": "d167-60",
  "text": "to compete. It is undoubtedly true that program for program\ntelevision will attract more attention and this its own\nvirtue since the end purpose of broadcasting is of course,\nto communicate. But it £i aIso a .ood deal mort -pensive\nand should be relieved of the temptation to do that which\nradio does as well and more cheaply. ■ or tin- r since they\nare of one purpose and frequently unde- one ownership, such\ncompetition should lead easily to a process of natural select¬\nion .\nBut first radio has to actually do those things :? t can do\nas well or better - and more cheaply. t set this as ur\nchallenge.\n'\ncan exploit the moat natural., available, a-*3 ooteo : thy.\nresource the world hass the great minds that either reside\non our campuses or are not far distant in terms of access¬\nibility. Television has made quite a collection of »uch\n\"conversations\" lately. t should have been done by radio.\nt think our failure here is in our lack of cootd.? nation,\nnationally we lack a central nervous system. . Th > igh the\ntremendous work, over and above the call of committee assign¬\nment, of such as Ed Burrows and many before him, we have\npulled some good programs out of some of our institutions\nand, most recently, out of Washington. These latter are the\ntype television might have done if radio hadn't done them\nfirst. ETV may still do some of them if it feels it will get\nsubstantial coverage we donflt. X think n this respect we\nowe our efforts considerably more promotion. But that is\nstill another topic we could profitably spend time on.\njuq -Jndc.. >d ’S a -n. r. . -v.-my who ha-’ managed t > hold\ntogether the ~v»s1tig¥^i5T a networks—\na distribution system is not a network of the order we nr i.\nWe need people who are out soliciting programs\nespecially from us, from our institutions. They will b\nsensitive to our description of what we feel >u* network\nshould be, but; neither the description nor the solicitor s\nof any use without the other.\nCertainly this will take, money. But don't think any one\nof us really believes m -e the real problem. We\napparently are all willing i contribute when we are satis¬\nfied that we re going t get our money's-worth. But of e"
}