{
  "id": "d167-71",
  "text": "Hr. Lou Peneguy, Page 2, June 22, 1962\ncouldn’t attend, strikes a very familiar note with me. Often in the\npast that has been the case with NAEB seminars—and thus the report\nwas held up for, sometimes, over a year...which is obviously ridiculous,\nlately though, based on a suggestion by Harold Hill, we’ve been able to\nget things done more speedily by miles. However, I can’t see any way\nthis could be applied £». your situation, because it involves holding\nan editorial committee for a few hours after everybody else has gone\nhome—to whip the thing into shape for me to take it and get it started\nthrough the printing mill.\nAnyhow, let’s plan now to have it different for Region II coverage\nin NAEB publications next year. If you’ll send me advance info on\nyour meeting, the theme if any, when and where it will be, and the\nspeakers and topics as they’re scheduled. I’ll get stories in the NL.\nThen, afterward, we can either run the Journal-worthy speeches in the\nJournal, as we are Engar’s this year...or we can offer them all, as\nduplicated here, at a nominal sum, as we did Region III speeches this\nyear.\nBy the way, you’ll be interested to know that Lew Rhodes (as member¬\nship chairman in charge Of Individual Members and Affiliates of NAEB)\nsent letters on June 15 to everyone not already an NAEB member who\nattended the Region II meeting, Inviting him to become an Individual\nMember. We already have about ten new members from this—and it was\nless than a week ago that the letters were mailed! So perhaps by\nnext year’s regional meeting, more of your people will be receiving\nthe Journal and Newsletter and will know why you’re asking for the\nadvance info!\nThanks again for writing—and now as the ^un slowly sinks into the\nWest (with NAEB fanfare fading off, etc.). I’ll stop. Gad, I’m getting\nlong-winded lately. Before NAEB I hardly ever wrote a letter than ran\nmore than one page in length. Wonder what that signifies?\nBest,\n(Mrs.) Betty McKenzie\nPublications Editor\nBMC/dp\nMr. Harold E. Hill\nblcc:"
}