{
  "id": "d167-8",
  "text": "2-10-66 - 1\nSOUTHERN AREA CONFERENCE\nThe Region II Council of NAEB is rapidly completing plans for the 1966 Conference\nto be held in Memphis March 31 through April 2. Because of the interest evidenced\nby neighboring Regions, the meeting is being designed as The Southern Area\nConference, sponsored by Region II, and invitations are being sent to our\ncolleagues in nearby Southern states.\nKEYNOTE SPEAKER\nWe are pleased to announce that our keynote speaker will be Governor Frank G.\nClement of Tennessee. Governor Clement is known for his interest in educational\nbroadcasting, as indicated by the state's progress in this area during his service\nas governor from 1953 to 1959, and with the development of Tennessee's ETV network\nduring his current administration.\nCONFERENCE FACILITIES\nWe are also pleased to inform you that the Conference will be held at the Holiday\nInn-Rivermont. Originally constructed as a private club and hotel, the Rivermont\noverlooks the Mississippi, and is just a few minutes from downtown Memphis. The\nclub was purchased recently by the Holiday Inns, resulting in a considerable\nreduction in room rates for our meeting. Enclosed is a brochure describing the\nbuilding's facilities and accommodations.\n1967 CONFERENCE SITE\nIt is not too early to begin some planning for our 1967 Conference, and those\ninterested in hosting next year's meeting are asked to send their proposals to the\nchairman of the Site Selection Committee,. Mr. Edward Herp, manager of WFSU-TV\nin Tallahassee, Florida. Invitations should be received in Tallahassee by March\n25, so that they may be considered at the March 31st Conference. Also serving\non the Site Committee are Mr. John Haney of the Georgia ETV Network in Atlanta,\nand Mr. John Young, manager of WUNC-TV at Chapel Hill.\nREGISTRATION AND RESERVATION\nWe have also enclosed a combination Registration and Reservation Form for the\n1966 Conference which we hope you will complete and return to the undersigned\nat your earliest convenience. An accurate and early registration for the meeting\nwould greatly aid the Conference Committee in making your visit as informative\nand enjoyable as possible. Of course, you may separate the Registration and\nReservation forms and send them in at different times, if you find this more\nconvenient.\nNAEB Region II\nWKNO-TV\nMemphis"
}