{
  "id": "d1648-0",
  "text": "A E B\nNEWSLETTER\nNATIONAL ASSOCIATION O F E D UCATIONAL BROADCASTERS\nVOL. 28, NO. 10 OCTOBER, 1963\nShayon to Keynote NAEB Convention\nRobert Lewis Shayon, radio-TV critic for the Saturday Re-\nview for some fourteen years, will give the keynote address\nat the NAEB convention on Monday, November 18. His topic\nwill be “Responsibility in Educational Broadcasting.”\nShayon has been producer and writer for the radio series\n“You Are There,” and in 1959 he wrote, produced, and nar¬\nrated the series “Everybody’s Mountain,” a series about edu¬\ncational mountaintops which was offered to NAEB Radio\nNetwork stations.\nUtilization Committee to Prepare Bibliography\nGale R. Adkins, chairman of the NAEB Utilization Commit¬\ntee, has asked Newsletter readers to suggest magazine or\njournal articles to be included in an annotated bibliography\nbeing prepared by his committee. The bibliography is to con¬\ntain a selected listing and brief annotations of the best ar¬\nticles dealing with the utilization of radio and TV programs.\nSend recommendations to Adkins at Flint Hall, University\nof Kansas, Lawrence.\nIndividual Member Addresses Needed\nThe directory of NAEB Individual Members is being pre¬\npared (to appear as part of the January-February NAEB\nJournal). All who anticipate address changes as of January 1\nshould notify Mrs. Dotty Templeton, NAEB, 119 Gregory\nHall, Urbana, Illinois 61803.\nSylvester to Address NAEB Convention\nArthur Sylvester, Assistant Secretary of Defense for Public\nAffairs will speak on “Broadcasting Public Affairs” at the\nNovember 20 general session of the NAEB convention. On\nthat same day he will address a luncheon co-sponsored by the\nNAEB and the Milwaukee Radio Television Council. His\ntopic will be “Government Information in a Free Society.”\nCommittees to Meet at NAEB Convention\nFollowing are those committees whose chairmen have sched¬\nuled meetings during the NAEB convention:\nSunday, November 17\n3:30 p.m.—Radio Network School Committee\n4:00 p.m.—Professional Development Committee\n6 :30 p.m.—Industry Relations Committee\n8 :00 p.m.—Personnel Placement Committee\nWednesday, November 20\nNoon—ETV Commissions Committee\n\" —Engineering Committee\n\" —Industry Relations Committee\n\" —International Relations Committee\n\" —Membership Committee\n\" —Permanent Convention Committee\n\" —Professional Development Committee\n\" —Publications Committee\n\" —Radio Advisory Committee\n\" —Radio Network Committee\n\" —Research Committee\n\" —Utilization Committee\nMusic Directors to Meet\nIndiana University’s WFIU will host an NAEB music con¬\nference October 22-23. Station music directors from Illinois,\nIndiana, Kentucky, Michigan, Ohio, and Wisconsin have been\ninvited. Mrs. Kathryn Fraser, supervisor of music programs\nat WFIU, reports that the conference will be patterned after\nlast year’s Region III conference at Ann Arbor. There will\nbe sessions on music programing, music recording, and music\nclearances. A special feature will be the first recital of a new\ncomposition written by the I. U. composer in residence, and\nplayed by the I. U. quartet in residence.\nGrant Increased for Utilization Kits\nThe USOE recently granted another $54,000 to the NAEB\nfor production of utilization kits. The kits, “illustrating proper\nteacher utilization of broadcast materials,” are to be ready\nfor use sometime after the first of the year. The additional\nmoney will allow production on film instead of tape.\nClair Tettemer, general manager of WFME, Fargo, North\nDakota, is director of the NAEB utilization project. Serving\non his advisory committee are: Elaine Afton, KETC, St.\nLouis; Charles Hettinger, Pittsburgh Public Schools; Arlene\nMcKellar, Wisconsin School of the Air; Wanda Mitchell,\nEvanston Township High School; and Lew Rhodes, Central\nMichigan University.\nNAEB Acquires New Industrial Associate\nMicrowave Services International, Inc., has joined the NAEB\nas an Industrial Associate. The firm headquarters in Denville,\nNew Jersey.\nPublications\n• Copies of a speech describing the 2500-megacycle closed-\ncircuit service for ITV are available, free, from the Indus¬\ntrial Products Division, Adler Electronics, Inc., 1 LeFevre\nLane, New Rochelle, New York.\n9 Four Theories of the Press is a new book published by the\nUniversity of Illinois Press. Authors are Fred Siebert, Theo¬\ndore Peterson, and Wilbur Schramm. The “four theories”\nare the authoritarian, libertarian, social responsibility, and\nSoviet Communist concepts of what the press should be and\ndo. Price of the paperback is $1.25.\n• Recently received in the Newsletter office was a copy of\nExploring the Ways of Mankind, by Walter Goldschmidt. The\nauthor states in the preface that the book is designed so that it\nmay be used in conjunction with Album I of the NAEB series\nWays of Mankind. Since the books Readings in the Ways of\nMankind (printed to accompany Albums I and II) have been\nout of print for some time, this book provides an alternative.\nHolt, Rinehart and Winston are the publishers.\n• Comparative Research on Methods and Media for Pre¬\nsenting Programed Courses in Mathematics and English is the\ntitle of a report recently published by Pennsylvania State\nUniversity. It reports on the results of a Title VII project\nthere under the direction of C. R. Carpenter and L. P. Green-\nhill.\n1"
}