{
  "id": "d1648-1",
  "text": "• September 5 is publication date for The People Look at\nEducational Television, by Wilbur Schramm, Jack Lyle, and\nIthiel de Sola Pool. The 210-page hard-cover book is an audi¬\nence survey of nine ETV stations. $5.50 from Stanford Univer¬\nsity Press.\n• The NEA has issued a directory of CCTV installations, with\nsome perspectives for the future, written by Lee Campion and\nClarice Kelley. Called “Occasional Paper No. 10,” copies are\nfor sale through DAVI.\n• Soon to be published by Asia Publishing House, 119 West\n57th St., New York, is Understanding Indian Music. The pre¬\npublication note says it is probably the first book of its kind,\nand that Author Baburao Joshi “explains clearly and concisely\nthe intricate and subtle nuances of Indian classical music.” Price\nwas not given.\n• Kliegl Bros, has a 12-page brochure on “Lighting for the\nVidicon Camera,” prepared especially for ETV and CCTV use\nby the Illuminating Engineering Society. Complimentary copies\navailable from the TV department of Kliegl Bros. NOTE their\nnew address: 32-32—48th Avenue, Long Island City 1, New\nYork.\n• Two free reprints are available from Educators Progress\nService, Randolph, Wisconsin: “Audio Materials and the\nChanging Classroom or Audio Materials and Their Challenge\nto the Present Day Teacher,” by Walter A. Wittich (from the\nnew 1963 Educators Guide to Free Tapes, Scripts, and Tran¬\nscriptions, $5.75 from Educators Progress) ; and “Learning,\nTeaching and the Curriculum Guide,” by John Guy Fowlkes\n(from the new Elementary Teacher1: Guide to Free Curriculum\nMaterials, $7.50).\n• Jam Handy has announced a new series of six filmstrips\n“Using Punctuation and Capital Letters,” designed to help m\nteaching English in Grades 3 to 6. For description and order\nblank, write Jam Handy, 2821 East Grand Boulevard, Detroit 11.\n• The July issue of EBU Review is a special agricultural\nbroadcasting number. Single copies available for 70 cents from\nEBU, 1, rue de Varembe, Geneva, Switzerland.\nNew NAEBers\nACTIVE .\nEastern Mennonite College, Station WEMC, Harrisonburg,\nVirginia.\nAFFILIATE\nCentral Virginia Educational Television Corporation, Rich¬\nmond.\nINDIVIDUALS\nThomas F. Baldwin, East Lansing; Arthur Allan Bartfav,\nFlint; Mrs. Virginia K. Bartlett, Sandwich, Massachusetts,\nEnsign Paul E. Bell, Jr., New York; Don R. Browne, Bos¬\nton; Elmer Brunsman, Jr., Allston, Massachusetts; Mrs. V-\nD. Cahill, Kent,- Ohio; Anthony Chapp, Kansas City, Mis¬\nsouri; John B. Cooper, III, Philadelphia; Charles J. Cope¬\nland,’Columbus; Mrs. Rosita E. Cota, Tucson; George Des-\nsart, Philadelphia; Norman Finkelstein, Chelsea, Massachu¬\nsetts; Alexander J. Friedman, Cambridge; Mrs. Alice Gill,\nNashville; John Glade, Lafayette; William Hawes, Fort\nWorth; William J. Hetzer, Jr., Brookline, Massachusetts; W.\nP. Hilliker, Tr., Cambridge; Joel M. Hochberg, Brooklyn; R.\nA. Isberg, Berkeley; Ronald I. Katzin, Calgary, Alberta,\nCanada; Vann M. Kennedy, Corpus Christi; Harry Kublin,\nNewton, Massachusetts; Russell C. Janson, Canton, Ohio;\nEsther M. Joyce, Youngstown, Ohio; L. Joseph LeBritton,\nWaverley, Massachusetts; William B. Lenz, Boston; Franzi\nAscher-Nash, Elmhurst, New York; Takaya Machida, Bos¬\nton ; Jeremiah F. Madden, Madison; Herbert L. Nichols, Wash¬\nington; V. Gerard Noonan, Brookline, Massachusetts; Iola\nParker, Chapel Hill; G. G. Petersen, Fairhope, Alabama;\nDoris H. Platt, Madison; Ebrahim Rashidpour, Bloomington,\nIndiana; Oscar Reed, Jr., Silver Spring; Joseph M. Ripley\nII, Madison; Robert C. Rowe, Albany; Aaron L. Shansky,\nMilwaukee; John S. Snell, Athens; Dr. Richard J. Stonesifer,\nPhiladelphia; George H. Strimel, Jr., Bloomington, Indiana;\nDr. J. W. Warfield, Detroit; Robert C. Wiegand, Colum¬\nbus; Charles G. Woodhouse, Klamath Falls, Oregon.\nRegional Meetings Scheduled for Convention\nMembers of the NAEB will have a chance to discuss Board\nagenda items with their regional directors at meetings on\nTuesday, November 19. The Board will not meet to take\naction until after the convention, on Thursday, November 21.\nLuncheon meetings at noon on November 19 have been\nscheduled for Regions I, III, IV, and V. Members of Region\nII will meet at 12:45 p.m., after members have lunched\nseparately. The price for the luncheons will be $3.50.\nBretz Joins National Education Sciences Staff\nRudy Bretz, until recently head of ETV at UCLA, has joined\nthe National Education Sciences Corporation as vice presi¬\ndent in charge of television systems planning. The organiza¬\ntion was formed early this year by David M. Snow, Ana¬\nheim (Calif.) school board member, who was responsible for\nthe launching of the Anaheim ITV project. NES announces\nitself as the first consulting firm specializing in the new edu¬\ncational methods and media.\nArthur Heiss Dies\nArthur S. Heiss, A-V consultant at Maxwell Air Force Base,\nand an NAEB member, died August 25.\nWRVR Programs Acclaimed\nThe radio documentaries recorded last May in Birmingham\nby a team from WRVR, the FM station of the Riverside\nChurch in New York, have received acclaim from the public\nand from reviewers. Jack Gould, in the Nezv York Times,\ncalled the series a “. . . first class journalistic coup ... a\nremarkable social document for the ear . . .” Herm Schoen-\nfeld, in Variety: “. . . radio journalism at its best . . .” John\nHorn, in the New York Herald-Tribune: “. . . fine example\nof radio-journalism enterprise ...”\nNAEB network stations have been offered the series, and\nfifty members have ordered it to date. A number of other\nstations have ordered the programs direct from WRVR.\nTapes have been made available for broadcast by the Voice of\nAmerica, Radio Free Europe, the BBC, the Swedish Broad¬\ncasting Corporation, and the Swiss Broadcasting Corporation.\nListener mail in response to the tapes has been arriving at\nWRVR from all over the United States. Characteristic of the\ngeneral public opinion was a letter which labeled the series\n“magnificent journalism” having “intensity that no TV re¬\nportage could ever match and vividness well beyond what is\npossible for the newsman depending upon the written word.”\nA number of tapes have been rented or purchased for use\nby discussion groups, and tapes are being used directly for\ninstruction in high school social studies classes, university\nseminars, and in advanced social science research.\nNews Notes\nPERSONNEL\n^ James Robertson, vice president for network affairs,\nNETRC, has resigned his position in New York and will\nassume the duties of general manager of the forthcoming Los\nAngeles ETV station on or before November 1.\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 119 Gregory Hall,\nUrbana, III. 61803. $5.00 a year, $7.50 including Washington Re¬\nport. Editor: Betty McKenzie. Phone 333-0580. Area Code 217.\nReporters:\nRegion I —Michael Ambrosino, EEN, 238 Main St., Cambridge,\nMass.\nRegion II —Shirley Ford, WUOT, University of Tennessee, Knox¬\nville.\n—Lou Peneguy, AET'C, 2151 Highland Ave., Birming¬\nham, Ala.\nRegion III —McCabe Day, WVSH, School City of Huntington, Ind.\nRegion IV —Richard Vogl, KTCA-TV, 1640 Como Ave., St. Paul,\nMinn.\n2\nNEWSLETTER"
}