{
  "id": "d790-0",
  "text": "Graham Hovey — letter from Italy No. 1 >/p‘jl\nr Recorded in Rome, October 13, 1954 S'l-K-Hz- ' 'AU;j WEADQUARTF^\nTape runsj 13 *35\nIVUV 1354\n(First of two programs on American Fulbri^it scholars in Italy), <7/ft9/10,11 to -\nThis is Graham Hovey, recording the first in a new series of radio Letters from Ita4y\nfor the Rational Association of Educational Broadcasters — the RAEB Network.\nMy guide book calls Perugia \"the empress of hill-set cities\" in Italy and I'll settle\nfor that designation, I fell hard for this empress at first sight on the mid-summer day\nin 1944 when she was liberated by the British army. And I have gone back to Perugia on\nevery occasion when I could find an excuse for doing so. I am not the only American who\nfeels this way. You will meet another in a few minutes.\nThe ancient heart of the city of Perugia rests at the top of a steep hill, some 1500\nfeet above sea level and close to the geographic center of the Italian peninsula. From\nthis crest you can look out across hundreds of acres of the rolling countryside of the\nregion of Umbria, of which Perugia is the capital.\nUmbria is a lovely patchwork of hills and valleys in greens and browns, punctuated\nwith slender elms and oaks and poplars — and, of course, the cypress trees and umbrella -\npines which do so much for so much of the Italian landscape.\nFrom Perugia’s crest, on a clear day, without half trying, you can see Assisi, the\ncity of St. Francis, white against the side of Mt. Subasio, 25 kilometers to the east.\nOff the other side you may glimpse the mirror that is Lake Trasimeno, where Hannibal won a\nbattle, but not a war against the RomaHs in 217 B. C. At dusk, off this crest, you see\nsunets which critics would call exaggerated if ever a painter could capture them on canvass,\nBut its location is not all that makes Perugia the empress.\nIn some respects, Perugia is a modem city of nearly 100,000, sprawling ever farther\ndown the hillside. But its main street runs for less than half a mile along the crest,\nthrough the ancient heart of the city.\nThat street must be one of the most remarkable in the world. They call it the Corso\nVannucci, in honor of the great renaissance painter, Pietro Vannucci — Raphael’s teacher,\nwho took the name Perugino, after the city where he lived and worked.\nAlong that short street of several hundred yards, if you stroll slowly and observe\ncarefully and glance frequently down the vicoli. the side lanes that spin off the Corso,\nyou can spot evidences of all the great periods in Perugia’s known historyi from Etruscan\nthrough Roman through me die val and renaissance to the up—to—date. And on the Corso\nVannucci in Perugia, one can stroll slowly and observe leisurely.\nIn all parts of Italy you find pedestrians not convinced that the automobile is here\nto stay. But in Perugia every evening, the authorities make testament of their faith that\npeople are more important than autosj that going \"a spasso,\" as Italians say — strolling\nfor pleasure in a lovely setting — is an essential part of the good life. For two hours\nthey block off the Corso to all vehicles for almost its entire length. And by the thou¬\nsands, the Peruginians come out in good weather to take the air before supper, strolling\nback and forth with their friends, unhurried and undisturbed.\nSome of the strollers will linger for a while at one end of the Corso, where the hill\ndrops away from the wall in sharp staggers. For this is the best spot from which to watch\nthe elements gradually assemble, then gradually dissemble, those exaggerated sunsets over\nLake Trasimeno way — sunsets against whose crimson is always silhouetted a single, thin\nline of now-black trees on the rim of the western horizon."
}