{
  "id": "d790-103",
  "text": "dovey •• 2\nguerrilla warfare expert, Luigi Longo# He ait a dawn a aouple of rows and a\nPit to the right of Togllatti.\nLongo was trained in revolutionary techniques and tactics in Moscow.\nHe is a veteran of fighting with the international brigades in the Spanish\ncivil war and the northern Italian underground in World War II. If the Commu-\nnists ever should take over Italy, many observers believe the combination of\nstrong man Longo and senator Pietro Seochia of the Cominfoma might reduo*\nTogllattl to figurehead status or shove him out of the picture altogether.\nBut even the humor-less, gray-haired, 54-year-old Longo does not fit the\nCommunist revolutionary stereotype in appearance, andhe usually remains silent\nin the Chamber, apparently preferring to do his rabble-rousing at party rallies.\nThe man who does look like American newspaper cartoonists think a Commun¬\nist revolutionary should look is Giuseppe di Vittorio, the secretary general\nof Italyfs biggest labor union, the Co/emunist-dominated CGIL. Di Vittorio has\na broad,-powerful torso fitted onto short legal a large, squarish head, with a\nheavily-lined, dark-complexioned face and a thick shook of black hair. He\ngenerally sits in the second row from the well of the Chamber.\nMy characterization of him as the stereotype of the Communist revolution¬\nary in appearance may be unfair. Italian friends of mine who are strongly\nanti-Gommunist say Di Vittorio is, by all odds, the most typically Italian of\nany of the Communist loaders. Ttiey think he might be the one most apt to balk\nat following the undiluted Moscow line if the Communists actually gained power\nin Italy.\ncase more Communist deputy certain to be pointed out to you at Montecitor-\nlo is far less important, but far more attractive than Togliattl, longo or\nDi Vittorio. 3he is Laura Diaz, who got into politics after serving in the\nanti-fascist underground during World War II In the port city that we call\nLeghorn and the Italians call Livorno.\nilgnorlna Diaz was the real glamor girl of Italian Communist ranks when\nshe first came to aontecltorlo. At 34 she is still a slim, attractive brunet,\nwho generally sits near DI Vittorio in the second row of the first section.\nIncidentally, Blgnorina Diaz is one of 33 women deputies in a Chamber of\n590 members. Qf those 33, the Communists have 16j the governing Christian\nDemocratic party has 11; the left-wing Socialists four and the Monarchists two.\nWell, I have gone into such detail about the Communist deputies Q&fc to\nglamorize them in any way nor to make them seem more formidable than they\nactually are.\nBut Americans impatient with the Italian government for not taking strong\nenough measures against communis® need to be reminded that the problem looks\ndifferent at this end. It is one thing to cope with the Communists in a country\nsuch as our own, where they have never been able to poll 100,000 votes, and\nwhere the problem la one of espionage and sabotage. It is quite a different\nthing to cope with the Communists in a country where they and their allies\ncommand the allegiance of better than one out of three voters.\nThose 143 Communist deputies and 75 fellow-traveling Socialists canH\nsimply be wished out of existence. Neither can they be legally thrown out of\nthe Chamber, so long as they play the parliamentary game according to the rules,\nwhich they generally do.\nspeaking of the socialists allies of the Communists, their leader,"
}