{
  "id": "d790-107",
  "text": "Graham iiovey — Letter from Italy Ho. 16\nRecorded in Rome, February 6, 195^\nTape runs * 13? 20\n(Third in a series of four broadcasts on the Italian parliament in relation\nto the January political oriels)\nThis is Graham Hovey, Send ins fro® Home another Letter from Italy, pro*\nduced for the Rational Association of Educational Broadcasters with the cooper*\nation of Radiotelovlsione Italians and the United States Information Service.\nIn my previous Letter X examined some similarities and some differences\nbetween congressional debate in Washington and parliamentary debate in Italy.\nBut I didn't get around to saying much about the most striking difference of\nall.\nIt is the surface manifestation of that very basic structural difference\nbetween a government of coordinate branches, with checks and balances between\nthem, and a government that is formed from the parliament and can be put out\nof existence by vote of the parliament.\nPerhaps I can Illustrate the visible difference In this way*\nWe all know that a few weeks ago President Elsenhower went up to Capitol\nHill to deliver his annual message to Congress on the state of the union. And\nthen tho President went back down the hill to his executive offices in the\nWhite House.\nHe subsequently has sent up to the Hill various messages, asking the\nCongress to enact specific adminlstrat .on programs into law and to appropriate\nthe necessary money to finance those programs. From time to time he may use\nthe power and prestige of his great office to attempt to persuade the lawmakers\nto enact a particular measure -* or perhaps to block one which his administra¬\ntion opposes.\nBut it's entirely possible that the Resident will not return to Capitol\nHill in person for the rest of this legislative session. He would resent\nsenators and congressmen coming to the White House and trying to run the exe¬\ncutive branch for him, and he knows that they are Jealous of the powers of their\ncoordinate branch and resent too much interference from the executive.\nBut let's suppose for a moment that the President was an elected member\nof the House of Representatives from his native state of Kansas.\nAnd let's suppose that every memoer of the President1a cabinet was either\na congressman or senator.\nAnd now let's suppose that after delivering that message on the State of\nthe Union in January, the President had to sit there in the well of the House\nof Representatives while the House debated his program.\nSuppose he had to sit there at a bench located just under speaker Martin's\nrostrum, flanked by the members of his Cabinet, andhear himself and hi a program\nraked over and over by vigorous and sarcastic and sometimes vitriolic critics.\nAnd let's carry it one atop further?\nsuppose that after sitting through all this debate, the President and his\ncabinet had to remain on that bench during & ro 11call vote of the House which\nwould determine not only the fate of the program, but actually whether the\nEisenhower administration would stay in office or be thrown out."
}