{
  "id": "d790-113",
  "text": "Hovey — 2\nOne of Italy * a outstanding your^ hlstorlamt Vittorio O&brieUUL, has\nsaid\" ’ It Is a sad fast that the Italian people finally accepted fascism out\nof sheer weariness, waitings for leadership from ouong the legally chosen — a\nleadership that never cars©.\"\nT>& Gasper 1 was actually saying $\n'The Italian people arc again getting weary of parliamentary ticker lag and\nstalemate | they are again getting; tired of waiting for effective uemoeratlc\nleadership* Lot’s net proofs timte until they *..&in accept totalitarianism\n— whether communism or a new brand of fascism — out of sheer weariness*\nre Gaspsrl's words were addressed to all the democratic oartie© and, as\nha med© clear, even to the Monarchist a, who claim to he democratic but are\ngenerally not considered a p&rt of the deBoers tic bloc in parliament.\nout Be $aoperl obviously was speaking especially to hie one time cabinet\ncolleague, Giuseppe Saragat, leader of the right-wing Socialists, the party we\ngenerally call the Social Demoerata. And the reason for tils concentration on\nbaragat was lamed late, not primarily historical. For as the parliamentary\nfight over the FmMml Borermmst was evolving it was clear that the verdict\nwould hinge m the decision of the Social Demoorats, with their 19 votes. 3ut\neven hare Be Gasperi could have drawn a somewhat Questionable parallel with\n1,920. He could have said to Sarrgat:\nlook, the failure of the socialist party and the Catholic oarty to Join\nforces in n common effort permitted Italy to fall into fascism/ Let's net\nrepeat that failure in the face of the threat of ooimmmlsm*\nI said that parallel la questionable because S&rugat’o party today only\nremotely resembles the I tall ait Socialist party of the pre-fascist era. The\nSaragat party is distinctly a minor party facing the possibility of extinction!\nthe Socialists of 1920 wore the biggest single party in Italy, with 157 scats\nin the Chamber*\nToday’s counterpart for the 1920 Socialist party would be Pietro Seoul's\nPartito boclallsta Italian©, whooh has 75 Chamber seats. And hero the parallel\nIs somewhat clearer. For Kami today follow© the oscoa line almost as' faith¬\nfully as Italian Communist party chieftain, Muairo Tagllatti.\nIn other words, Henni la following the policy that In 1920 was known as\n\"MiuritoUflat\" a policy of adhering tv> the Ctoniriunlst international line and\nworking for the destruction of bourgeois democracy and its replacement by the\ndictatorship of the proletariat*\nI say the parallel is clearer because the Italian Socialists of the ore-\nfascist period gradually adopted \"ftvdUaaliam,’1 after the Soviet revolution*\nThis kept them from cooperating with tho Catholic party in the face of the\nrising throat of fascism.\nThus, the word *ma89lmalll«09 * with its historic overtones, was hurled\nacross the Qhambor floor at Hennl during the January debate. It was what\nPremier Fanfani meant when he answered hie critics Just before the chamber\nvoted and said t\n*The Christ tan Democratic party would be willing to make a political\nmarriage with Hanoi, but it suspects that on the night of the wedding it would\nfind in the bridal chamber Hetrni replaced by fegliaitl** And amid the general\nlaughter, Fanfani added:"
}