{
  "id": "d790-118",
  "text": "Hovey — 2\nAs against the 56 per cent who liked Americans best, 22 per cent listed the\nGermans first! 12 per cent preferred the French! and three per cent preferred\nthe British.\nIt seems possible that the ©vents of last autumn in Trieste had something\nto do with the weak British showing.\nAs I have said, 56 per cent of all Italians coiled said they liked Americans\nbest. But when DOXA centered on those who said they were Communists or support¬\ners of Pietro iiennl’ft fellow traveling Socialist party, the results were very\ndifferent, cf this-group, 40 per cent preferred the French; 36 per cent listed\nthe Germans first, and only 21 per cent chose the Americans, as you can see,\nthese results among the Communists and their allies would seem to fit in with\nofficial party attitudes to some extent.\nJouiAA next broke down the results for members of the Social Democratic party,\nthe Republican party and other democratic left-of-center groups — and the change\nof sentiment was pronounced. Seventy per oent of this group of Italians preferred\nimericans; 14 per cent liked the Germans best; 10 per cant preferred the French,\nand six per cent the British.\nWhen DQ)U got to the largest of the Italian parties — the Christian Demo¬\ncrats — gg per cent preferred Americans to nine per cent each for Germans and\nFrench, and two per cent for the British. iJext In line were the liberals and\nMonarchists, whose preferences were listed together. Jlxty six per oent of them\npreferred Americans! 22 per cent the Germans; 10 per cent the French, and two\nper cent the British.\nWhen DQaa reached the far political right, where the heirs of Benito\nMussolini hold forth, it found the most striking difference of all from the\ngeneral trend*\nOf the Italians who said they supported the neo-Fascist Italian Gooial Move¬\nment, or mi, 74 per cent preferred Germans. Only 24 per cent of the neo-Fasclat\nsympathizers listed Americans first; two per cent favored the French; and the\nBritish had no supporters at all.\nDUMA made one more division >n this first question — a division between\nItalian men and women. Bo far as Italian men were concerned, their collective\npreference was a tossup between Americans and French, only ten per cent put us\nin fourth place and another ten per cent designated the French as least popular.\nBut the women gave Americans a slight edge, only five oer cent of them put us in\nlast place, while seven per oent designated the French.\nItalian men and women also differed in their attitudes toward tho Germans.\nOnly 16 per cent of the men said they had the least sympathy for the Germans,\nwhile 33 per cent of the women liked the Germans least among the four nationali¬\nties*\nBut perhaps I have given too much attention to this matter of sympathy for\ndifferent nationalities. It is hardly a constructive thing, even if interesting.\nFor its second major question, DOXA asked Italians to select three adjectives\nfrom a list of 24 that would best describe Americans. And the adjective chosen\nmost often was the word, “generous.* Thirty eight per cent of Italians polled\nused “generous* a® one of their three adjective® by which to describe Americans.\nIn second place, with 37 per cent, was the word, “practical. ”\nNineteen per cent of the Italians polled said Americans were “vain,* but\nsight per cent said we were “modest•“ Another 19 per cent used the adjective."
}