{
  "id": "d790-123",
  "text": "Hovey — 2\nAmerica aims to dominate the world, and an additional 40 per cent said the state-\nment was partly true.\nWhen it sot around to Russia and the Russians, the DOXA agency did not ask\nthe same questions that perhaps you or X would have asked. In fact, there is no\nsingle result that provides a clear-cut teat of Italian sentiment between Ameri¬\ncans and Russians or between American and Soviet foreign policies. DOXA made\nwhat X would call — without intending any criticism — an oblique approach to\nthese questions. Nevertheless, I thought the DOXA results were interesting, and\nworth passing along to you.\nHere is D0XA*3 first question to its scientific sample of Italian citizens —\nand remember that the wording is that of DOXA and not my own * DOXA said this i\n*As you know, soar? western scientists have delivered to Russia the relative se¬\ncrets of the atomic boiab. According to you, have they worked for peace, or have\nthey increased the peril of war?rt\nOf the men polled, 24 per cent said that scientists who had turned over re¬\nlative atomic bomb secrets to Russia had worked for peace* an every 50 per cent\nsaid these scientists had Increased the danger of war. Among the Italian women,\nonly 14 per cent of those polled said the scientists who had passed over atomic\nsecrets to Moscow had worked for world peace* 44 per cent said such scientists\nhad Increased the ooril of war. Among the men, 13 per cent expressed the opin¬\nion that such action by the acimatlsts had no effect, one way or another, on the\nchances for war or peace* among the women, 12 per cent gave this same answer.\nTwenty seven per cent of the women polled said simply that they did not know\nhow to answer the'question* only 10 per cent of the men made that response.\nDOXA and the magazine Olomo summed up this section of the question in this\nway* Among the men, thoae who thought scientists who passed atomic secrets to\nRussia were increasing the risk of war outnumbered by two to on© those who\nthought such actions contributed to peace; among the women, those who thought\nsuch scientists had increased the chances for war outnumbered by three to one\nthose who thought those actions contributed to peace.\nThe article in alamo by the DOXA polling agency then broke down these re¬\nsults according to tWe educational background of the Italians polled. I don#t\nwish to throw too many figures at you, so perhaps we’ll confine our examination\nof this phus© of the question to two groups# But first I should report that the\nmore education a person had had, the stronger, generally, was his feeling that\nscientists who passed atomic secrets to the soviet Union were increasing the\nperil of war, rather than contributing to peace.\nAmong Italians who had gone only to elementary school, or had not attended\nschool at all, 21 per cent thought scientists delivering atomic secrets to\nRussia were working for peace, as aginst 41 per cent who said such scientists\nwere increasing the risk of war. In this category, 13 per cent said such action\nby scientists would have no effect on the chances for peace or war, and 24 per\ncent said they did not know how to answer the question.\nBut when only university graduates were interviewed, the result was striking¬\nly different*\nIn the university group, only nine per cent of the Italians polled regarded\nthe passing of atomic secrets to aoscow by western scientists as a contribution\nto world peace. Aixty eight per cent of t'uem said such action increased the per¬\nil of war. Only nine per cent said such passing of secrets would have no effect,\none way or another, on the chances for peace, and only five ?er cent of these\nuniversity graduates said they did not know how to answer the question."
}