{
  "id": "d790-13",
  "text": "Hovey — 4<\nA self-appointed \"marquis” named Ugo Montagn® was linked with the 00 sc — and the\nConaamists promptly exploited a photograph of Premier Soelba with Montagna at a wedding\nreception. The chief of Italyfs national police, Dr* Tomasso Pavone, was mentioned and\nresigned under fire. The Ctommunists exploited the fact that for several years Favone'e\nboas had been Signor Soelba, who was — and is — minister of the interior, in charge of\nthe national police and carabinieri. The 32-yeajN-old son of Italy's foreign minister,\nAttilio Piooioni, was charged by a young women with having been the \"assassin\" for a dope\nring allegedly headed by Montagna. Signor Piooioni resigned from the cabinet September 18\nand three days later his son, Oiampiero, was arrested and charged with manslaughter, \"aggros\nveted by the use of drugs,• in the Montes! ease. Montague and a former Home police chief\nwere also arrested.\nThat is where the matter stands at the time this program is recorded. It should be\nnoted that not one shred of evidence has been introduced by anyone that links Premier Soelba\nwith the Montesi case or any mishandling of the affair by the polios. Not a shred of evid-\nenoe has suggested any implication of Attillo Piooioni* But Soelba was interior minister,\nand thus head of the police, at the time the kontesi girl's body was found, and he hod posed\nfor a picture at a reception with Ugo Montagna* And Signor Piooioni was the father of the\nyoung man arrested for manslaughter in the oasef a father who had publicly proclaimed hie\nfaith in the seal's innocence.\nIhat was all the Communists needed} that was a formidable political stick IKXXXSHB0B9\nwith whloh to beat the government in a country where people have historic\nreasons for suspecting corruption in government. The Communis to were not alone in this\neffort. In fact, some of the most sensational charges in the case originated with a\nmagazine whose political orientation was ultra right-wing.\nPersons who have known him well over many years say there is no more honest man in\nItalian public life than Mario Soelba. But even some of his friends and strong supporters\nbelieve his government could have handled the Monte si case with greater political skill.\nSomehow, the government seamed to get itself on the defensive. There is no evidence\nthat any government minister ever interfered in cny way with the Italian judiciary's hand¬\nling of the o&se. But somehow, the government failed to get across to the people its true\nattitude, which was, in effect! \"This is a matter for the judicial handling, not the\npolitical arena. Justice will take its course and let the chips fall where they may.\" Borne\ncritics say thrt Signor Piooioni should never have taken the job of foreign minister at the\ntime the Soelba government wss formed last February, because his son's name had already\nbeen mentioned in the Montesi case.\nIt is evident that much damage has been done to the standing of the Soelba government\nand. therefore, to the Italian democracy by this affair. A Home correspondent of the great\nTurin newspaper, I* Stamps, remarked recently that neither the Trieste accord \"nor the other\ngreat problems of\"ir<ternational relations on tap have, in the least, districted political\nattention from ... the Montesi affair.\" And another writer for the same newspaper warned\nthat in ligfrt of the Montesi oase it would be \"simple-mindedness\" to conclude that the\ngovernment had emerged, reinforced, from the votes of confidence.\nBut, ae I indicated earlier, the Montesi case is not the only factor in the present\ndegree of uneasiness in Italian government and democratic party ranks.\nI hops to examine these other factors in subsequent letters from Italy.\nGraham Hovey reporting. This Letter from Italy was recorded in Home studios of\nRadio televisions Italians for the national Association of Educational Broadcasters — and\nthis is the HASH Network."
}