{
  "id": "d790-130",
  "text": "Hovey — 3\nIt Is the progressive income tax to which Signor Contini gives much of\nthe credit for this phenomenon! the income tax and the inheritance tape. He\ntells his Italian readers — and I quote t\n\"Individual enrichment — rapid and gigantic j industrial success due to a\nfortunate stroke on the stock market! the fabulous destiny of the Rockefellers,\nCamegles* Fords* Morgans* Asters; all the legendary Images of capitalistic\nAmerica tyrannized by a few Wall street magnates* now belongs to the past/'\nHe says that of 150 million Americans today* only 72 hhve annual incomes\nexceeding a million dollars and only 12*000 own properties worth a million*\nAnd ho adds that in 1929* those figures were 500 and 21*000* respectively*\nObviously* Signor Contini believes today1a situation is healthier than that\nwhich existed Just prior to the Great Depression*\nHe cites the fact that an American earning §50*000 must pay half of it to\nthe government In taxes* and says the levy on higher Incomes is stepped up to\nthe point where the government claims 93 per cent in the top bracket• And he\nsays* of the America that this tax system has helped to creates\n\"It is 3till possible to create colossal business revolutions* but it is\nnot possible to amass enormous fortunes except* I am told* in Texas* which\nfinds itself in a full phase of development and constitutes the exception to\nthe rule*\"\nSigner Contini then tells his readers in ^essaKKero that the inheri¬\ntance tax also has helped to discourage excessive accumulations of wealth and\nhas encouraged fractionalizing and dispersing of shares of stock in the great\nAmerican industries. Thus* he says* the real proprietors of Gwift & company\nare the 64*000 shareholders* and he adds that no one of these* 5bfiSDQS3Bfc \"not\neven Swift*\" holds more than one per cent of the stock*\nHe tells his Italian readers that this kind of system was called \"social\ncapitalism\" in a poll conducted by an American magazine* And Signor Contini\nbelieves this system is \"the fruit of a slow revolution* made and won with a\nfiscal policy* rather than with barricades*\"\nSignor Contini concludes that it 13 not only the economic* military and\npolitical power that has pushed America to assume* almost in spite of Itself*\nthe function of western world leadership* It is* he says* the American\nsystem's \"democratic sincerity* its vitality* its modernity, its fascinating*\nconstructive* solid cosmopolitanism'1 which* in Aignor Cent ini* s opinion* is\n\"the sure sign of a higher destiny of a unified civilization.\"\nAldo Ganonlcifs article in the weekly ».ondo* the one called, \"white\nCommunism* the Permanent Revolution in the U.3.A.* Is much broader in scope\nthan that of Eraanno Contini in Mesaaftgero* Signor Canonic! believes that\nit has been vigorous intervention by the federal government on many different\neconomic and social fronts which has given the United itatea its mixed econo¬\nmic system that he says has been well defined as \"a permanent revolution*\"\nAnd why does Gignor Canonicl call our* system \"white Communism/' *ell*\nfirst of all because he says it is impossible* in good faith* to characterize\nthe American system as \"capitalism,\" though it is capitalist.\" Second because\nSignor Canonic! could not accept the names suggested for our system by readers\nresponding to a poll conducted in 1951 by This freek magazine — names such as\n\"the new capitalism,\" \"proletarian capitalism* 1 wproductivism*\" and \"democrat¬\nic economy.\" Btor did he believe that the abstraction* \"The American way of\nlife,\" hit the mark*"
}