{
  "id": "d790-134",
  "text": "Hovey — 2,\nOddly enough, it was a epee eh he gam nt one such function that led lndireetlv to hi.\nth^t-'^mf^L^® Ulrlnal 5SlT 0n4FebruaIy 8 PJld ohnpgod by President Sinnudi with\nthe t< 8k of forming a government# Here is the wny it happened s\nSoelba was one of a good many leaders of the Christian Demoor tic oartv who\nieprdeT0,1 «»** *«*«* mX?/?£iTirz ?fappy\nf?li! ?*ch could 150 \"bought only with a policy of drift and inaction\nsn the Italian domestic front, while Mg problems grew bigger# They feared that a t»cit\nM?narC?l3tS WOtt¥ ref,<>t 8gRln8t th* Christian toornti and the other\nlemocmtic parties in subsequent elections#\nSo,\n^1“-!™ It*1*1*'** °onatit,ueney_in Bifi-I'eeenbor «* deliver-\n9d a speech at a party rally in Hovers# In that speech, he celled in Effect\n?OUr“psrty 1)6 Casperi coalition, saying this was the best method of inL^i^r”\nsocial and economic progress and strengthening the bases of Italian democracy#\n- , «,^1i\\bridl0f at the SoePa speech, particularly because it came at a time when other\nChristian Democrats were openly indicating their uneasiness at the course Pella was following#\nSo, when Pella on December 19 precipitated the crisis that was to result in the resiana-\ntion of his government 17 days later, he mentioned the Soelba Hovers speech as onff^orf\n_ j ** motioned an article written for a Christian Democratic weekly by Aleide de Gas\nP * 1 «^ioli fo5mer Ppe®iep referreA to the Pella cabinet as \"a-friendly aoverrment.«\nsupposedly meaning th t it was not a party government# * 9\nl!r1lti0n ir‘ parllwner!tar3r Sovernmertal systems that the man primari-\nly responsible for bringing down one government should be entrusted with the job of formir&\nIts successor. »t least It happens thet way In Italy. 8\n„ Q^i,fp0Jal re88on vW pella resigned was the veto the Christian Demooratie party lead¬\ners sought to impose on an ultra-conservative, Salvatore Aldisio, whom Pella rished to name\nas minister of agriculture. And the man who pressed home that party veto of Aldisio was\nAmin tore Fanfar.i, leader of the so-oalled \"Democratic Initiative\" left-wing faction of the\nChristian Democr?oy#\nthe, w,OTltt*n rul90» *•»«# that President Einaudi should give Fan-\n££ svsrg.‘Wtfs rrrs saswisss; as rsr\nKsnfani the responsibility for forming a government to replace the pflle government. ^\nToll, as everyone now knows, Fanfnni tried and failed- He w\nto 260, on J'nurry 30, when he asked the Chamber of Deputies for a vote of confidence^!!*!8\ngovernment composed entirely of Christian Democrats, except for a single independent!\nOn the surf-oe, then, the two Christian Demoorsts aside from Fenfsni. who had had\nto do with Fella's fall were Aleide de Qasperi and Mario Soelb*! * h° W m08t\nThis interpretation was unfair to De Oasperi* who aetuallv nnt Q\nto close the breach between Pella dnd the p?rty aid keep Pell/lT^m]^ *?*£*?\nWritten the editorial which described Pella's cabinet as\nISorats w!«rt«^*tfRr*S!r°r‘Ber With p'rty 804 00UKtry the\" Seelba. And, if the Christian\nOomocr ts were to attempt to reconstruct the four-party democratic coalitior to\nAecessity for depends oe on the Monarchists, the best man tL^ob Sb^o!sS^\n*° had established that four-party coalition in the first place — De Oesperi. 7\nhead ^the^v^e^^T^hls1?^!6”63 0OT,pelllrl8 t0 Be °88peri ** he -«««M *»* ***» as"
}