{
  "id": "d790-135",
  "text": "Hovey — 3\nHe had felled in his attempt to constitute a government following the 1953 elections.\nSome weeks afterward, De Qasperi had taken on the thankless job of secretary of his party.\nHe had done so beosusd he feared the great heterogeneous Christian Democracy was in real\ndanger of splitting into half a dozen parties. He felt — and many party members agreed —\nthat he was the man who would have the best chance to hold the party together and reforge\nit as an effective political instrument,\nIt*s a safe guess that that job has been even harder than D© Oasperi anticipated, And\nthere are real doubts that any other Christian Democratic leader would hrve a ohar.ee of\nsuooess,\nI have repeatedly examined the heterogeneous character of the Christian Democracy on\nthese programs. One fairly recent example will serve to illustrate the point. After Fan-\nfan i fell, the party directorate quarreled long and bitterly about which direction it should\ntake, The decision to follow the recommendation of Scelba*© Dovers speech and at empt to\nre-form the old four-party democratic coalition was adopted February 3 by only a seven vote\nmargin — 122 to 115* That will give you an idea of how touch-and-go the internal Christian\nDemocratic party situation often is on very basic policy matters. It will give you a rough\nidea of how precarious Scelba*s support within his own p rty actually Is at the moment.\nAnyhow, De Gasperi felt that it was his duty to stay on as party secretary and do his\nbest to hold the party together in support of the new coalition government.\nWith De Gasperi eliminating himself, then, the choice of Scelba was virtually inevit¬\nable, It was Scelba who had started the agitation for a reconstruction of the four-party\ngovernment! a proposition which his party directorate had accepted, even if by a narrow\nmargin. There was no one else of comparable stature who had taken this line so decisively.\nAnd from the standpoint of parliamentary protocol, it had bee Scelba*e ovara speech that\nhad helped precipitate the Pells crisis.\nThose ar© the real reasons, then, why President Einaudl conferred the burden of forming\na new government on Scelba on February 8*\nIt was not, as some observers have assumed, that Einaudi felt the Italian situation\nhad become so shaky that the hardboiled Sicilian policeman had to be called in to push a\ntough policy toward the Commu ists.\nIn fact, those who know Scelba best will tell you that he is a devoted democrat. They\ndefend his record as interior minister *nd claim that his flying squads never broke up a\npeaceful, law-abiding political rally — by the Communists or anyone else.\nBut in those critical postwar ye- rs when the Italian political situation was touch and\ngo, Scelba did tfot hesitate to use the police power to the fullest to enforce the laws and\nrecreate respect for the authority of the government. Probably not even Scelba himself\nwould contend there were no police excesses in that period,\nWhen he first took over as interior minister, Scelba asked for a report on the condi¬\ntion and morale of the national police. When h© got that pessimistic report he is said to\nhave remarked, grimly* \"If 1 were a Communist I would start the revolution tomorrow,**\nThe Communists mad© their most serious bid for power after the attempted assassination\nof their leader, Palmiro Togli^tti, in the summer of 1948. Scelba had been interior\nminister for only a year and a half.\nThe Communists called a general strike to protest the attempt on Togliatti, and the re¬\nsponse was impressive. Then it became apparent that they intended to prolong the strike and,\nif possible, to us© it as a weapon with which to bring down the government. At this point,\nworkers began to go back to their jobs. There were riots, but Scelba*s flying squads and\nrejuvenated carabinieri were \"ble to cope with them. More important, Scelba kept his head."
}