{
  "id": "d790-140",
  "text": "Hovey — 3.\ngood pciture, Guttuso does 00 using means that completely contradict Ms neo-realist theo¬\nries. Therefore, one might say that Guttuso unconsciously follows the ro 1 of the \"Thir'\nForce.\"\nLikewise, the best of th© more extreme abstract painters, such as Herbin, Menas&ier,\nEsteve ©n H&rtung, though professing pure abstraction, show a clear world of images in\ntheir paintings.\nCritical theories are useful basically only as helps in understan ling works already\ncreated, ftrery artist who really works creates an esthetic of his own. It is only bad\nor me-iocre painters who make use of theories for th© actual construction of their works.\nIn the final analysis, avery artist is alone, and has his own problems to solve. It\nis not the road that makes the artist, but the artist who makes the road.\nHOF'Ti /oil, I would like to know, Signor Del Dr ago, ho- you woul describe your own\nwork. I no to that you once referred to your .American friend, David Chapin, as a painter of\n♦♦realist” themes. But you emphasised that you meant \"realist,\" and not \"neo-realist.\"\nWould you place yourrelf in that same category?\nPEL BRAGG t Yes, absolutely. I am a realist, not a neo-realist. I am a realist be¬\ncause I believe in th© inspiration that comes from the world outsi te the artist — an actual,\nobjective, human world. I believe in the images that I receive from nature, even if they\nmust, of necessity, be modified by my spirit and by my feelings, an by the demands of\npictorial composition at the moment of creation. My realism, therefore, is a lyrical\nrealism. Thus, a girl dressed in violet may change to violet © whole landscape.\nHOVTYt The critics said your first personal exMbltion, back in 1950, was dearly\n\"cubist.” You, yourself, colled your work of that period \"neo-Cubist,\" I believe. But\nthen you obviously mad© a rather sharp turn as a painter, and when you held your next per¬\nsonal exhibition in 1952, the critics noticed a great change, flhat was responsible for\nthat change, and how woul you escribe it?\nDEL DftAGOs dhen a young man seeks, he changes.\nHOVEYt You said, on occasion of this 1952 exhibition at Home, that you had no other\ndesire than to present th© life around your village of Filacciano — to represent, in your\nwords, \"this serene acceptance of grief and labor, enlightened at times by a song that knows\nnostalgia and hope.\" Then you added that this was a difficult position for a painter to\ntake in these times. Why o you think it is a ifficult position?\nDSL DHAGO* A work may have a political-economic aspect, or a poetical—religious aspect,\nIt is this secon aspect that interest© me. That is, the eternal character of work — of\nwork as a myth. Here in this countryside, th© gathering of the olives, the gathering of the\ngrapes, the threshing of grain, assume the aspect of ritual. They are always repeated in\nthe same, season rhythms that will change little in the centuries to come. Many people are\ninterested in that which changes. I am interested in that which does not change. Certain\nplaces, certain colors, a certain relationship between an arm and the branches of a tree* a\nrelationship of th© Mps of women to th© greet jugs they carry upon their heads; between the\nheir on their heads and th© grass under their feet — all these things, these relationships,\nare eternal. They are eternal because for centuries they have formed th© very poetry of\nlife.\nThe difficulty is to discover these things anew. This is difficult precisely because\nthese themes have been exploited so much in the past. It is also difficult to travel a road\nwhich the abstract painters fin too naturalistic, an th© neo-renlists fin- too abstract.\nBut this road is thr true road — the true ay of art. Certainly it would be easier for an\nartist simply to take a place in the ranks of on© of these two official conformisms —\nabstraction or neo-re- lism."
}