{
  "id": "d790-146",
  "text": "raham Hovey —• Letter from Italy So. 21\nNARB network\nRecorded in Rose, March 14, 1955\nTape runs* 14«00\nRECEIVED\nNAEB HEADQUARTERS\nMAR 311955\n(A look at Premier Scelba and Foreign Minister Martino on the ocoasi\nvisit to America).\ni\nThis is Graham Hovey, recording in Rome a Letter fr-ra Italy for the network of the\nnational Association of Educational Broadcasters. These programs are produoed with the\ncooperation of Radiotelevision© Italians.\nThis particular Letter from Italy is designed to coincide, as far as possible, with\nthe official visit to the United States of the Italian prime minister and foreign minister.\nThere will he plenty of information available — In the press and on radio and television\n—. about the objectives of that visit and what develops from it. But I thought it might\nbe a good idea to devote this program to a look at the men themselves, and the policies\nthey have stood for in Italian government and politics.\nBoth Premier Mario Soelba and Foreign Minister Gaetano Martino are Sicilians, and\nthey are approximately the same age. There is a temptation to say that any resemblance\nbetween the two men ends at that point. This would not be entirely accurate, as will be\nclear in a few minutes. But in appearance, personality, professional background and\npolitical party preference, it is true, the two men are quite dissimilar.\nMany of you pwobably could identify Scelba*s picture, if you saw it in your news¬\npaper. He has been in the thick of public life almost constantly in post-World War II\nyears, much of the time as minister of the interior in cabinets of the late Aloide Be\nGaspori. He is short, stocky and bald, with a broad, oval face, prominent nose, and\nsharp, widely-set eyes.\nIf Scelba looks the part of the politician — and many believe he does — Gaetano\nMartino seems perfectly cast as foreign minister, so far as appearance is concerned. Re\nis a man of only medium height, but he carries himself in a manner that seems just a bit\naustere — in the best tradition of the diplomat. He looks younger than his 54 years,\nbut his grey hair adds just the right touch of maturity to his distinguished bearing.\nScelba*s ingenuous smile is that of the public man. Martino smiles as often as\nScelba, but it seems a bit forced? again, the word \"austere\" comes to mind.\nIf Soelba locks the part of the politician, it may be in cart because he has always\nbeen a politician, from the time when, as a boy, he sat at the feet of the famous Sicilian\npriest, Bon Luigi sturzo, and got his first political schooling.\nMartino*s background was very different. He entered active politics only after World\nWar II. Prior to that, he was a university professor and a scholar with more then a\nhundred published works.\nMario Scelba was bora Sept. 5, 1901, at Caltagirone, in the interior of Sicily, just\nnine months after the birth of Gaetano Martino in Messina, not far away.\nCaltagirone was also the birthplace of Bon Sturzo, who, in fact, served as mayor of\nthat city from 1905 to 1920. As a boy, Scelba studied classics with Bon Sturzo in the\nclassroom and politics outside. The priest-politician founded Italy*s Popular party —\nthe forerunner of today’s Christian Democratic party — in 1919, which was about the time\nyoung Scelba cam© to Rome to study law.\nSoon Scelba was serving as Sturzo*s personal secretary in the Popular party. As\nfascism tightened its grip on Italy, Bon Sturzo was obliged to go into exile, but Scelba\ncontinued his political activity a© a journalist for Popular party newspapers until\nMussolini suppressed the anti-fascist parties and press."
}