{
  "id": "d790-149",
  "text": "Hovey — 4\nInterestingly enough, one of the biggest fights with his own party cane when Scelba\nnamed Martino minister of education* The Liberals demanded this position as rart of\ntheir price for participating in the Scelba government* The Christian Democrats had\nmaintained a tight grip on the education ministry during most of the postwar years, and\nmany observers felt they would never give it up. And they were able to put one of their\nown in this job once again when Scelba moved Martino to the foreign office last fall.\nAnyhow, Scelba eventually reconstituted the democratic coalition. His is a cabinet\nof Christian Democrats, Social Democrats and Liberals, with the Republicans supporting,\nbut not actually participating. And this government now has lasted well over a year.\nHow much longer it will last is anybody1 s guess. Martino's Liberal party recently\nthreatened a crisis over an issue of farm tenant contracts. The Republicans are be¬\ncoming restless. In any event, the Scelba government is bound by constitutional pro¬\nvision to resign formally after the election of a new president of the republic next\nmonth.\nHow well Scelba has done in his year as premier is also a live debating topic. In\nterms of actual legislation to carry out his program, he has not compiled an impressive\nrecord. But he did bring off the return of Trieste to Italy, He and Martino will go to\nWashington with the ratification of the European Union treaty in their pockets. He has\ngiven stability to a country that seemed to be faltering and stumbling toward some kind\nof totalitarianism.\nIf democratic government survives and flourishes in Italy, Scelba will surely get\nconsiderable credit. He was the man who never at any time lost faith in it. H© was the\nChristian Democratic leader who always vigorously opposed a turn to the right and a bid\nfor support of the Monarchists. He has opposed with equal vigor any decisive turn to\nthe left, and a bid for the support of Pietro Nenni's Socialist party, v/hich nearly\nalways follows the Communist line.\nIf democratic government eventually gives way in Italy, the crackup of the Christian\nDemocrat-Social Democrat-Liberal-Republican coalition could be the first signal. And it\ncould turn out that Scelba headed the last serious attempt to make such a democratic\ncoalition government work.\nAs I said earlier, the political fortune of Gaetano Martino, too, would seem to be\ntied to success for this democratic coalition idea which he has strongly supported. But\nperhaps this is not quite so certain as it is in the case of Mario Scelba. For Martino\nhas made enough of an impression on the country to figure prominently in speculation\nabout the new president of the republic, to be elected very shortly.\nAt this moment, Martino's chances of succeeding President Einaudi in May would seem\nto be of the \"daikhorse\" variety. Some Italians feel that at 54 he is too young, Some\nfeel he has advanced a little too rapidly. But given an early deadlock in the presiden¬\ntial assembly, Martino might make it. He then would have to place himself above the\npolitical battle.\nThese, then, are the two men from Sicily — Mario Scelba and Gaetano Martino — who\nwill be visiting fashington about the time you hear this broadcast* two Italian states¬\nmen different from one another in many respects but agteed in their stand for middle\nroad democracy at home, and a pro-western, European unity policy abroad.\nGraham Hovey reporting. This Letter from Italy was recorded in Rome studios of\nRadiotelevision© Italians for the National Association of Educational Broadcasters —\nand this is the NAEB Network."
}