{
  "id": "d790-16",
  "text": "Hovey — 3\nBut Soelba, a devout Catholic himself, stood up to Ms party on these matters and, with\nthe help of Be Gasperif he won its support for his coalition cabinet.\nIn writing a Letter from Italy last March about prospects for the new Soelba government,\nI said that the premier *s number one political probiim would probably be his own party.\nOn that occasion, I wrote* \"Soelba*s success, or lade of it, will certainly hinge to a\ngreat extent on how well Be Gasperi ... is able to hold the Christian Democracy in line\nfor him.\"\nBow Be Gasperi is gone and there is no one who can replace him and lesser men are doing\ntheir best to hold the cover on a political pot that is simmering, if not yet boiling*\nIt is not only the Christian Democratic pot that is simmering, to be sure. The deep\nsplit in the government-supporting Liberal party came to the surface again this summer when\nthree members of the loft faction resigned from the directorate. Some left-wing Social\nDemocrats are criticising their leader. Vice Premier Giuseppe Sarag&t, for being too vigor¬\nous in his defense of the Soelba government. Even in the tiny Republican party there is\ndissension over whether it would be better actually to participate in the government or con¬\ntinue the present policy of remaining aloof but supporting Soelba in parliament.\nBut it is the Christian Democracy — still by far the largest of Italy*s parties — that\nholds the real power of life or death over the Scelba government* And therefore it is the\nsimmering in his own party that is causing Soelba his greatest concern*\nHhe strong man of the Christian Democracy is now Amintor© Fsnfeni, who belongs to a\ndifferent political generation than Soelba. Fenfani*s left-oenter \"Democratic Initiative\"\nfaction took decisive control of the party machinery at the national congress in Naples in\nlate June, not without leaving some political soars.\nThis development marked the end of one chapter in post-World War II Italian politics and\nthe beginning of smother* For the younger mne of the \"Democratic Initiative\" had come to\ntheir majorities during the Fascist period and inevitably had been influenced by that fact.\nThe older followers of Be Gasperi, as I have said, came out of the old Popular party, with\nits anti-fascist tradition. Mario Scelba was one of the youngest members of this Old Guard\nand is virtually its only survivor still in high party and government position.\nFanfani took over the party secretaryship a month prior to Be Gasperi *s death, with the\nofficial blessing of the elder statesman. But Be Gasperi remained by far the most influen¬\ntial figure in the party.\nAs labor minister, agriculture minister and, finally, interior minister in the cabinets\nof Be Gasperi and Pella, th© 46-year-old Fanfani demonstrated gre~t energy and administrative\nability* He has a flair for dramatizing causes and programs — and for not underplaying his\nown role in them. Thus, a public housing program for workers, launched while he was labor\nminister, became known as \"the Fanfani program.” And thus a 3L-page booklet on th© land\nreform program, issued while he was agriculture minister, contained no less than seven photo¬\ngraphs of Signor Fanfani.\nThese qualities unquestionably stand Fanfani in good stead as he ,^oes up and down the\nItalian peninsula, trying to spark new enthusiasm and new organising efforts by the local\nunits of the Christian Democracy*\nBut Fanfani has yet to demonstrate the patience and the knack for promoting cohesion\nthat enabled Be Gasperi to hold the party together. In fact, he has the reputation for being\nimpatient — a young man in © hurry — and that has contributed to the current political\nuneasiness and confusion."
}