{
  "id": "d790-170",
  "text": "Fag© 11\nBemotions to URA FAOM M!\na quick look at anything important. I'm not near a typewriter now, but nora\nare the convents 1 remember and 1 mad® some pimm calls on my way out of the\ncity and here are the reports*\n\"Buoyed the informal style ©f this series,\"\n\"like tb© editing ©f the news the way this announcer handled it**\n\"This series gave me an excellent picture of the Italian scene, 1 wish I\nhad been, able to hear more of the broadcasts.\"\n\"I learned much from the reporting of the Italian cabinet crisis,\"\nf^he programs on the Italian parliament sessions were excellent.\"\n*% favorite program in this intelligently handled series was the one in\nwhich the three BAEB fellowship men shared the broadcast, I found\ntheir pooled point® of view extremely stimulating**\n*8ow, John, 3 don't know if the above cements written out this way will\nhelp, but no typewriter, no secretary and being va<mti on-bound at long last,\nthey're the best I can meter m Kay 1 add my hearty endorsement of all of\nthem* \"KBPS was proud t© offer this fins series, Me al: need to learn isore\nabout our 'neighbors across the Atlantic*' Any series which contributes to\nour greater understanding and perception such, as this one did is of great\nvalue to ue and to the communities our stations serve*” I hope, John, this\nscrawled, resume will help, l*m ashamed of this \"mess? but couldn't Ignore\nyour pleaJ\n\"Matt of great Importance to me is your notice saying you wil. substitute\nAaerjjHttfi.idUSaBtfato. on 6 programs— 1 That is horrible. Me have dupli¬\ncated, special manuals for the series—spent lets of money and paper and time—\nrearranged the series order and Columbus comes first in October. Special\ndate, time and broadcast title list® have all been duplicated and issued\nschool-system vide—80Sdo thin to me—FLEASEJJJJ Send us the original,\nlist—FIMSE, Did you know that the tap® series didn't follow the sequence\nof the list in the manual—that the tapes war® all numbered differently?\nThat threw us off—so we rearranged the whole thing ourselves to fit our\ndates best. I'll air mail this special today to you. Sorry I got agr mail\nso late,”\nSincerely,\n/»/ ftrt\niatrlcia 1. Creep, Mgr*\nNo* 24 • VfBAA\n*A belated answer to your recent request for evidences of listener response\nto the jUGFOflr mm mu series*"
}