{
  "id": "d790-6",
  "text": "Hovey — 2\nFor the Fulbright grantees in these two categories, the orientation was optional; they\nhad eleoted to oome to Perugia. In some instances they had wished to sharpen their usage of\nthe Italian language in the practical courses at the University for Foreigners. Others had\nwished to \"broaden their knowledge of the whole range of Italian life end history — in short,\nto get intellectually acclimated \"before starting the year’s work.\nAfter the month at Perugia, Miss Terese Anastasia, supervisor of physical therapy at\nBellevue hospital in Hew York City, would lecture at the University of Rome medical school.\nProfessor Shepard Clough of the Columbia university history faculty would teach American\neconomic history at the University of Turin. David leeks, professor of agricultural economic!\nat the University of California, would lecture on land economics at the University of Padua.\nAmong the research scholars, a Connecticut college history instructor, Miss Irene Neu,\nwould go to the University of Catania, to carry on research on economic relations between\nSioily and the United States in the 19th century. A Cornell economist, Professor Alfred\nKahn, would conduct research on private and governmental capital formation in Italy since\n1945, at the University of Home.\nProfessor John Black of Ohio State university would do research in experimental phone¬\ntics at Catholic university of Milan.\nBut the vast majority of the Fulbrighters — 91 in all — were in the student category.\nThese were generally younger persons — many of them June graduates of American colleges\nand universities. They had competed for — and won — more modest Fulbright scholarships\nfor a year of graduate-level work.\nTheir fields of learning ran. the gamut from classics to criminology; from sculpture to\nphysios; from geography to cinema tography. Some would do research for masters * theses or\nPhi, D. dissertations. Others would engage in strictly professional! training. In the\nlatter group were 10 painters, 10 voice students and five pianists.\nThe group included two husband-wifo teams. Dante Germino, an M. A. Qraduage in political\nscience from Harvard, had received a Fulbright scholarship to study relations between Italian\nstate and party under fascism, at the University of Rome. His wife, Virginia, an M. A. in\nhistory from Radcliffs college, had received her grant to study the oounter-reform and the\nItalian baroque, at the same institution. Thomas and Jane Morgan, Ph. D. and M. A., respec¬\ntively, from the University of Illinois, had received their scholarships to do special\nresearch in physics at the University of Milan.\nAnd there was a Catholic priest, Father Richard Schuler, from St. Thomas college of\nSt. Paul, Minn., who would study musicology at the University of Rome.\nInevitably, some of these students would ask, as some of their predecessors hadi Why\nare we brought\"together as a group for our orientation, given the wide range of our fields\nof interest? why the decision to take all of us to Perugia, rather than dividing us into\nsmall groups and assigning us to several different Italian university centers?\nThe Italian Fulbright program is administered by an Italo-American group known as the\nAmerican Commission for Cultural Exchange with Italy. Its executive secretary, Miss\nCipriana Soelba, explains commission thinking about orientation and Perugia*\n(COMINCIA IL 2TASTR0 HUMERO THE)*\nSCEL3A* First, the Commission reached the basic decision tint organized orientation\nwas desirable. We thought it would provide quicker adjustment to a new environment; more\nrapid progress with language proficiency; and more accurate understanding of a foreign\npeople."
}