{
  "id": "d790-74",
  "text": "Rovey — 2\nThe other democratic parties — the Social Democrats* Liberals\nand Republicans — no longer share the responsibilities of Governing * as\nall of them once did in the De Gasperi governments. And if the Christian\nDemocrats are in a period of transition, these “lay\" democratic parties,\nas the Italians call them, are in periods of genuine crisis. To be blunt\nabout it, they ar©facing the possibility of political extinction.\nTheir showings in the June elections were bad enough. The next\nelection might wipe them out.\nThis would surely be an unfortunate development for the Italian\ndemocracy, as many Christian Democrats would agree. These three parties are\nneeded. They contain some of the most intelligent and devoted men in Italian\npublic life, whether in or out of the government, these parties exert an\ninfluence on the Christian Democrats of a kind that neither the totalitarian\nleft nor right is capable of exerting. They help the majority of Christian\nDemocrats keep their sometimes unwleldly party in the middle of the road.\nAnd they provide a democratic alternative to the Christian Democracy for\nItalians unwilling to vote for a Catholic party.\nAnd so more than Just those who vote for the Social Democrats,\nLiberals and Republicans are watching with concern the efforts of these\nparties to clarify their positions and firm up their ranks. I think these\nefforts should be of interest to Americans, who, after all, have a rather\nlarge stake in what happens to the Italian democracy. And so I thought I\nwould devote this Letter from It§|y to a brief review of the current posi¬\ntions of these three democratic parties and their efforts to improve those\npositions.\nFirst of all, here is what happened to these parties in the\nelections of last June*\nThe Social Democrats, largest of the three, dropped 600,000 votes\nfrom their 1948 total. They polled a million, 200 thousand, and their\nrepresentation In the Chamber of Deputies went down from 33 to 19.\nThe Liberals, who had polled just over a million votes in 1948,\ndropped to 800,000, and won only 14 Chamber seats compared with 19 in the\nprevious parliament.\nThe Republicans polled only 439*000 votes and dropped from nine\nChamber seats to five.\nOne of two questions generally comes to the mind of a foreigner\nexamining these unhappy election results. The first one is, why don't these\nparties combine forces for added strength? And the second question isi why\ndon't these parties throw their combined support to Premier Pella and parti¬\ncipate in his government, if they are eager to keep the Christian Democrats\nin the middle of the road?\nThe answer is that both of these courses have been considered,\nand, up to now, rejected, for reasons having to do with the election vaults\nand the differing characters and different problems of the parties involved.\nLet1b take up that second question first* why don’t these three\nparties support Pella? Together they have 38 votes. If they withhold these\n38 votes, Pella has no alternative to accepting the 40 Chamber votes of the\nMonarchists and paying a price for their support."
}