{
  "id": "d790-77",
  "text": "Hovey — 5\nsix-year tenure in Britain* He would like to see the three parties unite\non a program that would be a cross between the Hew Deal and British Socia¬\nlism. He speaks not of early victory at the pollsf ?^ut only* of the possi¬\nbility of building a strength comparable to that of the Henni Socialists\nin the next election* That would mean a combined gain for the three parties\nof half a million votes and doubling their present strength of 38 seats in\nthe Chamber of Deputies*\nSuch a strengthening of these three parties would surely be a\nhealthy development for the Italian democracy. And the public debate on the\nLa Malfa proposal has been interesting and stimulating. But it has gone on\nfor a month now* without concrete result* One wonders if these parties have\nthat much time. One wonders whether such & debate is not a luxury* given\ntheir present situation.\nSignor La Malfa apparently believes so. His latest comment on the\nsubject was an article in the Republican party newspaper under the headline*\nrtComedy of the JSqulvocals.* In that article. La Malfa says* rtThe minor\nparties know that which they do not want* but they know little of what they\ndo want.* And he adds that by going their separate ways* the Social Demo¬\ncrats* Liberals and Republicans in the next elections will risk going \"more\nor less rapidly to the bottom*rt\nThe discussion among the parties has been considerably livened\nrecently by the proposal of a Christian Democratic leader for a resumption\nof the old four-party coalition* Former Interior Minister Mario Soelba\noalled on the Social Democrats, Liberals and Republicans to come back into\nthe fold in order to work for a program of social and economic reforms and\nthus beat off the challenge from both left and right.\nI hope to examine the 3celba proposal in relation to the position\nof the Christian Democracy in a subsequent broadcast.\nGraham Hovey* signing another Letter from Italy. This program was\nrecorded in the Rome studios of Radio Italians for the National Association\nof educational Broadcasters — and this 1© the NAEB Network.\n###"
}