{
  "id": "d790-83",
  "text": "Graham Hovey — letter from Italy Mo* 10\naccorded in Kome, January 6, 1954\nTape run® 14j30\nThis i® Graham Hovey, sending from Home a second letter from Italy con-\ncoming the political crisis that came with the fall of the government of\nPremier Giuseppe Pella* These programs are produced for the national Associ*\nation of Educational Broadcaster® with the cooperation of Hadio Italian®.\nIn the first of these two radio letters on the Italian political crisis\nI tried to Indicate why a showdown between Premier Pella and hi® own Chris¬\ntian Democratic party probably would have come eventually even if it had bee:\naverted for the present.\nPella has never been what politicians call \"a party man;’* he had never\nbeen the party * s choice for prime minister| and he was unwilling to accept\nthe party’s veto of hi a choice for agriculture minister of & man who had\nopposed the party1® land reform program.\nBat l added, in that first Letter devoted to the subject, that the fall\nof aella was Just a symptom of a deeper and broader political crisis which\ntoday grips all Italian democratic parties, but especially the Christian\nDemocrats. And today I should like to examine that deeper and broader crlsi\nas it affects Italy’s biggest partyi the party that has had the primary re¬\nsponsibility for governing the country for more than eight critical postwar\nyears.\nI should emphasise again that these lines are being recorded in advance\nof the designation of a new premier by Italy’s president, Luigi Einaudt* 3u\nthe analysis of the crisis in the Christian Democratic party may help explai\nwhat happened to Pella and some of the difficulties that probably will con¬\nfront hi® successor.\nX said that this deeper and broader crisis affects all Italian democra¬\ntic parties.\nI might add that I had prepared part of a series of letters from Italy,\nexamining the current situations of these parties, before the present crisis\nbroke. And I was waiting only for the Pella cabinet to be reorganized befor\nexamining the position of the Christian Democrats. X believe that in spite\nof the changed situation caused by the fall of Pella, those previously-pre¬\npared analyses will stand up. But if you hear them you should keep In mind\nthat I had no crystal ball and that they were prepared in advance of Pella’s\nresignation on January 5*\nTo Europeans accustomed to party unity and responsibility, Italy’s\nChristian Democrats make little sense. And even to Americans, accustomed to\na Democratic party broad enough to cover Harry S. Truman and Harry P. Byrd,\nor a Eepublican party heterogeneous enough to embrace Senator George Aiken o\nVermont on one hand and senator John Brisker of Ohio on the other — even to\nu®, the Christian Democracy is an astonishing coalition*\nA couple of years ago an American Journalist, Leo J* Wallenberg, des¬\ncribed the Christian Democratic party as *’a rainbow with a spectrum ranging\nall the way from a faint pink to a Fascist black, or at least gray. And an*\nItalian writer has referred to the party as \"a very peculiar and treacherous\norganism.\" It is, said this writer, \"an amalgam of a mass party, a politics\nmachine, and & medley of conflicting economic interests, each component de¬\npending on a different center of force*\" This Italian writer thought the\nmass party was provided by the tie with the Catholic church* The political"
}