{
  "id": "d790-90",
  "text": "*ovey — 3\nBut foreigners hear most about Italy’s president, of course, when a\ncabinet crisis occurs* It is to the president of the republic, as you have\nheard, that the premier resigns his cabinet* And it is the president of the\nrepublic who charges someone with the job of forming a new government*\nA few minutes ago you heard & tape recording of Premier Pella announcing\nhis resignation to a crowd of reporters waiting in one of the halls of the\nPalazzo Qulrlnale outside President Einaudi’s office*\nThat Pella resignation started a rather extensive series of conferences\nby President Elnaudl* Some of these conferences represent protocol and even\ntradition — if a republic not yet eight years old can have tradition. But\nmost of them are very important* The President must sound out all shades of\nItalian political opinion in order to figure out what new combination of\nministers under what prime minister will be able to get a vote of confidence\nfrom parliament and get on with the job of governing the nation*\nPresident Elnaudl started his series of conferences by calling in his\npredecessor — former acting President Enrico de Nicola* Next to come was the\nonly former premier still In parliament — Alcide de Gasperl* Then came\nSenator Cesare &©rzagora, a political independent who presides over the Senate\nand the Hon* Giovanni Gronchi, a Christian Democrat who is president of the\nChamber of Deputies* After them came all the leaders of the parties, from the\nCommunists on the Left to the neo-F&solst Italian Social Movement on the Right\nFour days after the crisis had begun with Pella’s resignation. President\nElnaudl concluded his consultations* This ended the.second phase of the\ncrisis. Reporters were Invited into the President’s office and one of them,\nof course, was a Radio Italiana newsman with microphone* Here is the voice\nof President Luigi Elnaudl as he spoke to newsmen and concluded this phase of\nthe crisis:\nEINAUDI (second-Ape begins): 11 Vi ringrazio della vostra assistenza\nattraverso la quale 1’opinion© pubblica e esattamente edotta del regolare\nsvolgimento dell© consult&zioni tuttavla oircondate dal doveroso rlserbo.*’\nHOVEY (translating): MI thank you foxwour assistance, through which\npublic opinion is accurately (or exactly) informed of the regular development\nof the consultations, still necessarily surrounded by secrecy or reserve.w\nThe journalists, as always, were trying to get more than President\nElnaudl was willing to give them at that time*\nBut on Tuesday, January 12, the President was ready for the next step*\nSignor Pella was summoned back to the Qulrlnale at 10:30 in the morning and a\nfew minutes later the secretary general of the Presidency, Ferdlnando Carbone,\nemerged from Elnaudl’s office andhere is what he told the waiting newsmen:\nCARBONE (third tape begins): *11 President© della Repubbllca ha confer-\nito l'lncarico all’on Pella di formare il nuovo Govern©• L'on* Pella nel\nrender© grazie per la rirmovata prova di fiduoia, ha espresso 11 proprio oon-\nvlncimento che 1 superior! interessi del Paese e la oonnessa esigenza di\nassiourare © rafforzare l*unlta del suo partito rendono preferlbile l’affida-\nmento dell’incarlco ad altra persona* II President© della Repubbllca nell1\napprezzame i motlvl, ha preso atto della rInunGla ©d ha ringraziato l’on*.\nPella per 1’opera da lul svolta al servizio del Paese.M\nHOVEY (translating): Signor Carbone said: **Th© president of the Repub¬\nlic has conferred on the Hon. Pella the burden of.forming a new government.\nThe Hon* Pella, in rendering thanks for the renewed evidence of trust, has"
}