{
  "id": "d790-93",
  "text": "Graham Hovey — Latter from Italy Ho* 12\nRecorded in Rome January 18f 1954\nTape runs! 12?55\nThis Is Graham Hovey with another radio Letter from Italy and the date¬\nline i Rome. These programs are produced for the Rational Association of\nEducational Broadcasters with the cooperation of Radiotelevisione Italians.\nIn my previous Letter from Italy I tried to demonstrate how a cabinet\ncrisis begins in Italy and how the -President of the Republic takes the first\nsteps necessary to resolve much a crisis. If you heard that Letter you heard\nthe voice of Giuseppe Pella, as he announced his resignation as prime minis¬\nter. You heard President Luigi Einaudi, thanking Italian newsmen for keeping\nthe public informed about the development of the crisis. And, finally, you\nheard Amintore Fanfanl tell the nation — through a Radio Italians microphone\n— that President Einaudi had asked him to form a new government azkl that he\nhad accepted \"with reserve.\"\nThat1 a about where we left Italy1 s January political crisis in that pre-\nvlous letter. The ball had passed from President Einaudi to Signer Fanfanl.\nAnd Fanfanl was about to begin the exhausting series of conferences with the\ncountry's political leaders to discover whether he could command enough\nsupport to form a government and end the crisis.\nLet’s pick up the Fanfanl story at that point. You’ll recall that Fan-\nfani had-accepted President Einaudi1 s assignment with the traditional\nreserve\" at about 12 noon on Tuesday. January 12. Almost everyone expected\nthat Fanfanl would go back to Einaudi1 s study at the oulrinal palace in three\ndays, four at the latest.\nItalian politicians have a theory that a premier-designate should not\nwait much longer than that before doing one of two things* either deciding\nto go ahead with the attempt to form a government or informing the president\nthat the situation does not look promising and that he must be relieved of\nthe commission.\nThey say that pressures on a man in that position invariably mount as\ntime pasaasj that the prices exacted by individual politicians and political\nparties for participation in the new government or support of it inevitably\ngo up if the premier-designate seems uncertain.\nAnd the politicians and editorial writers also say that it’s lust bad\nbusiness to keep the country on the hook beyond that first 72 or 96 hours.\nThey say the people are apt to lose faith in their governmental system,\nparticularly in a nation such as Italy, where the present democratic system\nis only eight years old.\nwell, Fanfanl didn’t go back to the ^lirinal® on Friday — and he didn’t\ngo back on Saturday, either. The fact la that he was having his troubles.\nAt one point during those days, according to a report circulating in Rome,\nFanfanl was almost at the point of giving up his attempt.\nI won’t go into detail at the moment on the reasons for those Fanfanl\ntroubles. -They had something to do with that heterogenous character of\nFanfanl’s Christian Democratic party that was the subject of a previous Letter.\nThey had something to do with the fact that Signor Fanfanl is a highly con¬\ntroversial figure on the Italian political scene| one who has been in the\nthick of bitter political fights involving such questions as land distributions\nlabor legislation! public housing. And his difficulties stemmed also from the"
}