{
  "id": "d1788-3",
  "text": "MAY e, 1943.\nNAE8 NEWS LETTER.. PAGE' 3\nWNVC SCHEDULES SERIES PORTRAYING WARTIME AMERICA'S WAY OF LIFE\nNew York's municipal station WNYC adds to its increasing list or dramatic\nTEATURES WITH THE FIRST BROADCAST IN 1TS NEW \"FREEDOM'S WORKSHOP1' SERIES\non SUNDAy, May 2nd. the New series, to be heard wEEftv at that hour, will\nFEATURE NEW SCRIPTS OUTLINING AMERICA'S WAV OF LIFE IN WARTIME, AS WELL AS\nSCRIPTS OF GREAT MERIT THAT HAVE ALREADY BEEN PRODUCED ON OTHER STATIONS\nBUT WHICH ARE IN KEEPING WITH THE SASIC \"FREEDOM'S WORKSHOP1' IDEA.\nThe initial broadcast is titled\"an American Prizefighter,\" with the script\nadapted from one of his own short stories by George a8ness, who will direct\nTHE VYNYC SERIES.\n\"SOLID STUFF\" STILL HAS A PLACE\nEditor's note: The following article originally appeareo in the march, i943»\nissue OF PUBLICITY problems, published by the American College Publicity\nAssociation. Author of the article is Jos. f. Wright, Director of WILL. It\nIS REPRINTED HERE OVER PROTESTS OF THE AUTHOR—I.E., MY BOSS...FES.\nGenerally speaking, college and university broadcasting is of two kinds:\nTHAT WHICH IS SUPPLIED TO COMMERCIAL AND OTHER STATIONS NOT EDUCATIONALLY\nOWNED, INCLUDING THE NETWORKS, AND THAT WHICH IS DONE OVER THE INSTITUTIONS*\nOWN RADIO STATION.\nMost colleges and universities reach the public through the facilities owned\nBY OTHERS. *HESE EFFORTS MAY RANGE FROM FIFTEEN MINUTES A DAV OR WEEK TO\nSEVERAL PERIODS AMOUNTING TO A TOTAL OF SEVERAL HOURS DURING ANY GIVEN WEEK.\nON THE OTHER HAND, THERE ARE ABOUT 25 INSTITUTIONS WHICH OPERATE THEIR OWN\nSTATIONS WHILE SOME OF THESE ARE ON THE AIR JUST SUFFICIENTLY TO MEET THE\nREQUIREMENTS OF THE FEDERAL COMMUNICATIONS COMMISSION, OTHERS ARE ON THE\nvery limit of time allotted them under their Federal license. Many of the\nLATTER STATIONS START BROADCASTING IN THE EARLY MORNING ANO CONTINUE THROUGH\nTHE EVENING HOURS! OTHERS ARE RESTRICTED TO DAYTIME OPERATION BECAUSE OF\nLICENSING COMPLICATIONS"
}