{
  "id": "d1560-3",
  "text": "-in¬\ndent of Documents, Government Printing Office, Washington, at a cost of 10\ncents, also includes standards of good engineering practice applicable to non¬\ncommercial educational broadcast stations.\nThe Commission in Section k.131 defines a non-commercial educational\nbroadcast station as a station licensed to an organized nonprofit educational\nagency for the advancement of its educational work and for the transmission of\neducational and entertainment programs to the general public. In Section h.132\nthe Commission provides that a non-commercial educational broadcast station will\nbe licensed only upon a showing that the station will be used for the advance¬\nment of the agency'»s educational program, particularly with regard to use of\nthe educational system consisting of several units.\nThe Commission recognizes two phases of the service of educational broad¬\ncast stations: First, the transmissions to specific schools for classroom work\nand, second, the transmission of adult educational and entertainment programs\nto the general public.\nThe Commission requires each applicant for a new non-commercial educa¬\ntional broadcast station to make a complete showing as to the plans for programs\nof the station. For example, a. municipal or common school system may use an\neducational station for classes transmitted simultaneously to the several units\ncomprising the educational system. Where a prospective applicant is not itself\nengaged in the operation of several units of an educational system, a complete\nshowing should be made of the cooperation with the several schools in the pro¬\nposed service area which should include agreements or statements from the heads\nof such schools, for example, a university or college.\nDevelopment of education through radio is also being furnished by the\nFederal Radio Education Committee. Organized in 1935 under the Federal Commu¬\nnications Commission, this committee is a cooperative effort on the part of\n-4-"
}