{
  "id": "d1560-5",
  "text": "NAE8 news «.eTThit.................,PA„ 6...-............,.yULV I, 1945\nTO RURAL AREAS* AT THE cUNE 20 HEARING ON ALLOCATIONS BELOW 25.000 KC.\nSanSaRO0STAtIonrO'h!,^^ £RE«UENCIES ARE NEE°EO TO ACCOMMODATE NEW\nNational 8J* Fraz,er# d,rector of Engineering for the\noustrv's R. ?n b«oaocasters and a panel chairman of the in-\nOUS RV s RADIO TECHNICAL PLANNING BOARD? RECOMMENOED THAT THE FEDERAL\n~CAT,0NS COMMISSION ENLARGE THE PRESENT SAND TO 530 OR 520 KILO-\nTENDING rT°TOSfiAOTKrT 'F K,,-0CYCt-ES BE ADDED TO THE STANDARD BAND, EX-\nIt LEAST 530 KC?° 00 RAZ,ER asked fcc To «o farther and extend it TO\nNgjfr RAO 10 BUlLPiNG PROPOSED FOR UNI VCRS8 TY OF IOWA\nILr?^U!!iCAT,0N3 Center* oesigneo to keep the University and the state\nABREAST OF FAST*MOVING DEVELOPMENTS IN PRESS$ RAOIO? TELEVISION AND\nVISUAL AIDS? IS ONE OF THE FIRST BUtLOINGS THE STATE UnI VERSITY*0F IOWA\n72 E2ECT WHCN MATER,A1-E become ava.lable,\" declared President\nVirgil M. Hancher recently in a broadcast to s!u.I. a^umn, aSI friends*\nThe building will house journalism, publications, visual education,\nradio, and television, \"It is being planned.\" President Hancher de-\nGLARED? WTH THREE PURPOSES IN V8EW--TQ PROVIDE FAC I L I T 8 E S FOR GIVING\ntSeJ l°Z\\T °’RLS ™E eEST TRA(NfNG IN THESE COMmSn^ItION ME^S\n1.2 ANYWHERE, to MAKE THE UNIVERSITY MORE USEFUL TO NEWS¬\nPAPERS AND RADIO STATIONS OF THE STATE THAN IT HAS EVER BEEN. AND TO\nw2th* EVERYEpoS«??BL NES8ES® MANUFACTURERS, ANO HOMES OF THE STATE\nWITH EVERY POSSIBLE ORAL AND VISUAL EDUCATIONAL AID,\"\nTHIS AND THAT\nAmong the NAEB-ers at the Surplus Properties Conference in Washington\nWHA™WCHU°°WTAWF tASTJ!',0,N™ WER5 REP*ESENTATIVES from WSUf. WNAD, KUOM,\nON THE VHF ur.«i',o222 * » \"Menzer OF *3 COOPERATING WITH FCC\nON THE VrlF MEASUREMENT AND RECORDING PROGRAM* CaRL WILL MAKE THE FCC\nENGINEERS MONITORING THE RECORDING EQUIPMENT AT HOME IN IOW^cItv I'm\nsure,.,.. Speaking of VHF, we saw some interesting fielo strength re-\n2rom WG?RMAp!x?on I'm!2sN' y',CH'eAN SH0W,N(S some terr<fic signal strengths\n2222c „ T0N* MaSS y°ur Editor has enjoyed East Coast fm broad-\n2211?.,! iUA9 THREE Innings, almost solid transmission the entire\nEVENING. -OCKS LIKE SPORADIC E IS SAVING \"amen\" TO THE FCC,,, Oon'T\nFORGET THE FM SHORT COURSE AT WISCONSIN JULY 29 TO AgGUST II.\no2212--LZeR D0*'N Kent0°kv WAV IS PRESIDING OVER A LISTENERS R^DIO IN¬\nSTITUTE JOINTLY SPONSORED BY THE UNIVERSITY OF KENTUCKY, THE AMERICAN\nBroadcasting System and Radio Station WLAP, g,Ve us a report? I2«r\nBelmont Farley of the NEA tells us that they are putt^nS fu“\nMAN TO VORK ON UTILIZATION PROMOTION IN THE SCHOOLS» He I N0i CATES THAT\nthere is a need for training in this fielo..The Cle2r C^SnIl Com?\nmittce should have something to peport in the Aueus; Newsletter?*’ a2?\nCOROING TO THE QUEST!ONAtRES PRACTICALLY EVERY OPERATING STATION IS\niSSES!*™'!! 22Tp2R,NOr’TS FAC!u,TtES—• Our haw S? gweI?ng ?s\nextended to Miss Pearl Rosser who has just seen elected to associate\nmembership in the NAE8, Ye Foitor’s oesk is pileo high (it always"
}