{
  "id": "d1113-0",
  "text": "Office of Executive Secretary\nUrbana, Illinois\nApril 15, 1940\nIi.IPQRTiiNT BUSINESS FOR COLUMBUS MEET\nDon’t forget that NAEB will have an important closed meeting in\nconnection with the Eleventh Institute for Education by Radio at\nColumbus, Ohio, on April 29th. Herewith are a number of items of\nbusiness which have been suggested. Others' may be added. Order here\nis not necessarily related to importance.\n1. Frequency Modulated Radio Stations.\n2. Phonograph Record Licenses.\n3. Copyright Law Revisions.\n4. Rebroadcasts of WRUL Programs.\n5. Required FCC Phonograph Record Announcements.\n6. Proposed Revision for FCC Annual Financial Reports.\n7. McGregor Educational Transcriptions.\n8. NAEB Transcription Exchange.\n9. NaEB Script Exchange.\n10. FRED Script Exchange.\n11. Broadcasting Commercial Sustaining Programs.\n12. Member Report of Activities.\n13. Officers’ Reports.\n14. Howard Evans.\n15. Bill Boutwell.\nNow you can see for yourself that there is plenty to do at Columbus,\nnot to mention what you may be doing at home. Hope to see you in\nColumbus April 29, 30, and May 1.\nCQIiT/lISSIONER RECOMMEND FAV0R.J3LY ON La GU^RDIA PETITION\nRecommendation that radio station /NYC, New York City’s municipal\nand non-commercial broadcast station, be permitted to pick up and\nrebroadcast international programs of station ./RUL, Boston, was mad©\nto the Federal Communications Commission April 4th by a special\ncommittee comprising Commissioners George Henry Payne, acting chair¬\nman in the absence of Norman S. Case, and T. A. M. Craven.\nThis general recommendation, which climaxed hearings on the subject,\nwas unanimous. The committee called attention to testimony by Mayor\nFiorello E. La Guardia of New York City, and Professors tVilliom Y.\nElliott and Harry Rowe Mimno of Harvard University. Professor\nElliott contended that such a grant would be in the interest of\neducation in general, as it would make available to the public at\nlarge the great resources of our universities; that it would enable\nnon-profit radio stations to render better public service; that"
}