{
  "id": "d1113-1",
  "text": "NAEB NEWS LETTISH. • • • APRIL 15, 1940.. ..Page 2\nrebroadcasting without the use of wires is feasible; that there would\nbe no interference with existing communications, and no one’s interest\nwould be injured.\nThe committed pointed out that rebroadcasting of international programs\nis not prohibited by international convention; that no use of an inter¬\nnational frequency for primarily domestic purposes is involved; that\nthe use of wires for feeder purposes places a serious expense on\nnon-profit stations; that there are no legal bars to picking up and\nrebroadcasting such programs, and further, \"if there exist technical\nobstacles to this form of rebroadcasting, it is important to learn\nhow these obstacles can be removed.*'\nAccordingly, the committee proposed amending rule 4.10(d) of the\nCommission to make the authorization possible. There was some\ndifference of opinion as to the exact wording. Commissioner Payne\nrecommended the following change:\n\"4*10(d) Authority will not be granted to rebroadcast in the United\nStates the programs of an international broadcast station located\nwithin the limits of the North American Continent, except upon a\nsatisfactory showing that the rebroadcast programs in question are\nintended solely for non-profit purposes and are not commercially\nsponsored.w\nCommissioner Craven suggested this rewording of the rule:\n\"4.10(d) AUghority will not be granted to rebroadoast in the United\nStates the program of an international broadcast station located\nwithin the continental limits of the United States, except upon a\nsatisfactory showing in the following respects:\n™(1) that such rebroadcasting will not detract from the primary\nfunction of an international broadcast station, the programs of\nwhich are being rebroadcast; and\nn(£) that the technical quality of the rebroadensting will be reason¬\nably free from distortion and noise, as well as reasonably free from\nthe effects of fading. The Commission will afford to applicants a\nreasonable opportunity to secure facts concerning the proposed\ntechnical performance,\"\nKVvLC JOINS NAEB\nKJLC, Luther College, Docorah, Iowa, has joined the ranks of the\nNational Association of Educational Broadcasters. Welcome, and may\nwe be of service to you. Director of K/LC is Mr. F. C. Gamelin.\nSEE PaCKIST\nAccompanying the News Letter in the NAEB Packet is a copy of the\nFrequency Modulation booklet which Howard Evans obtained for the\nNttJSB members. Howard says to tell you boys that they are boing\nsent with his earnest suggestion that they be examined carefully.\nTo which the executive secretary of NAEB adds \"Amen\"."
}