{
  "id": "d1113-2",
  "text": "' NAJSB NEWS LETTER.. . * APRIL 15, 1940. . e .Page 3\nWOI RATES EDUCATIONAL RADIO AND RECORDING\nThe \"Visiting the Production Centers\" section of the April 4th issue\nof EDUCATIONAL RADIO & RECORDING is given over to WOI - the Voice\nof Iowa State College, If you don’t already know what Professor\nGriffith and his gang are doing at Ames, you’ll enjoy reading this\narticle,\nFOR PRESENT NO LICENSE NEEDED FOR RECORDS\nPending decision from appeal in the courts major record manufacturers\nwho previously had announced their intentions of charging license\nfees from radio stations using phonograph records now have notified\nstations that pending further notice no fees will he charged. Any\nNAEB members who have submitted payment to RCA-Victor will have the\nfee returned by the company. Just in case you hove missed recent word,\nwe quote here letters and telegram received from Decca, Columbia,\nand RCA•\nLetter from Rca-Victor reads:\nftCamden, New Jersey, April 12, 1940. Following the decision of the\nUnited States District Court for the Southern District of New York\nin the case of RCa Manufacturing Co. Inc. v. WNEW, et al. (commonly\ncalled the Whiteman case), we announced a plan whereby upon payment\nof established license fees many of our phonograph records would be\nmade available to radio stations for broadcasting purposes, We\nalso informed all stations that in the event the courts should\nultimately hold that we do not have the right to license our records\nfor this purpose, all license fees paid to us by the stations would\nbe returned,\n\"It now appears that final determination of the various appeals taken\nin the Whiteman case will be delayed longer than we had anticipated.\nMany groups have expressed to us the thought that stations ought not\nto be called upon to pay us license fees until the case has been\npassed upon by the Appellate Court. We have, therefore, decided to\nterminate all licenses heretofore extended to the stations by us and\nto refund all license fees paid to us thereunder. Meantime we wish\nto inform you that until further notice from us to the contrary we\nshall not make use of our records for radio broadcasting purposes\nthe basis of any claim against you, very truly yours, RCA MANUFACTURE\nIMG COMPiiHY, INC.\"\nTelegram from Columbia says:\n\"Bridgeport, We confirm that our consistent policy remains unchanged\nof refraining from taking action against broadcasters for performance\nour records. We will not bring action or make claim against your\nstation arising use Columbia Brunswick Vocallon records and will give\nyou due notice if circumstances cause us hereafter to alter policy\"\n(Signed) Columbia Recording Corp Bridgeport Conn\"\nLetter from Decca Records, Inc, says:\n\"Heretofore we advised you that the United States District Court for\nthe Southern District of New York rendered a decision holding that"
}