{
  "id": "d1069-1",
  "text": "Education at Airlie House, W&rrenton, Va. A group of some 50 leaders in American\nhigher education attended to consider the next decade of ETV development. Dr.\nSamuel B. Gould, president. Educational Broadcasting Corp. of New York City, gave\nthe keynote address. Among others who participated were FCC Chairman Newton N.\nMinow, Gov. LeRoy Collins, president of the NAB, and representatives of the Voice\nof America, USOE, and the Commerce committees of both the House and the Senate.\nOn the final day of the Seminar, a session was presented by professional\neducational broadcasters, chaired by NAEB Pres. William Harley, at which NAEB*ers\nRichard Hull, John Meaney, and Les Greenhill presented reports, illustrated by\nfilms, of the current status of ETV, followed by a report by NETRC Pres. John White.\nSOUTH DAKOTA- WYOMING VHP CHANNEL SHIFTS\nOn April 10, the FCC finalized rule making (14842), assigning Ch. 11 to Lead,\nETV Ch. *9 to Rapid City, and switching ETV reservation from Ch. *22 to Ch. *10 in\nPierre, S.D. This was accomplished by substituting Ch. 7 for 9 in Sheridan,\nand Ch. 4 for 7 in Lander, Wyo. Rule making stemmed from petitions by the S.D.\nState Supt. of Public Instruction and commercial interests.\nETV CH. 3 SHIFTED IN NEW MEXICO\nOn April 10, the FCC finalized rule making (14903) and shifted ETV Ch. *3 from\nRoswell to Portales, N.M. Shift had been requested by Bd. of Regents of Eastern\nN.M. Univ. in cooperation with State Dept, of Ed.\nNORTH CAROLINA REQUESTS ADDITIONAL ETV CHANNELS\nThe Univ. of N.C., Chapel Hill, has requested (April 26) the FCC to amend the rules\nso as to provide for additional ETV channels necessary and essential to a state-wide\nETV network. They have requested one additional VHF channel and six additional\nUHF channels be reserved. This would involve also the moving of four channels to\ndifferent towns.\nMISCELLANEOUS FCC ACTIONS\nGranted (April 9) CP for new Class D noncommercial, educational station to\nHampton Institute, Hampton, Va., to operate on 88.3 me, at 10 w.\nGranted (April 12) CP for new noncommercial ETV station on Ch. *13 to North\nCentral ETV Assn., Inc. Fargo, N.D.; ERP 105 kw visual, 63 kw aural; antenna 390 ft.\nGranted (April 22) Subsidiary Communications Authorization on sub-carrier\nfrequency of 20 kc to WETL(FM), South Bend (ind.) Community School Corp.\nGranted (April 22) CP to KFJC(FM), Foothill Jr. College District, Los Altos,\nCalif., to install new antenna and make changes in antenna system; remote control\npermitted.\nApril 23, granted license to WRVR(FM), Riverside Church, NYC, covering changes\nin antenna height, type, and system.\nGranted (April 24), CP to Univ. of New Hampshire, lurham, for a new Class D\nnoncommercial educational FM station to operate on 90*3 me, with 10 w.\nGranted (April 30) CPs to Albany (N.Y.) Medical College for new remote pickup\nstations.\nApril 10 waived Sec. 3.71(a) of rules to permit WHAZ, Rensselaer Polytechnic\nInstitute, Troy, N.Y., to operate daytime from noon until 5 P*m. or until local\nsunset, whichever is earlier, Monday through Friday, also other daytime hours for\nspecial events and programs, without share-time arrangement with stations WPOW and\nWEVD, New York City, but continued nighttime share-time arrangements.\n, Granted (April 15) CP to WHA-TV, U. of Wis., to change ERP to 158 kw visual,\n79.4 kw aural; type transmitter, antenna and equipment; transmitter location; and\nantenna height to 740 ft."
}