{
  "id": "d1519-10",
  "text": "as a substitute for instruction*! films (530-01-1).\n3„ Color Color, unless it is essei tial to the subject being taught,\ndoes not increase the effective! ess of television training (20-TV-l)«\nGo SPECIALIZED TELEVISION APPLICATIONS\n1. Training Device Viewing Training devices may be televised to a\nlarger group than can normally see them (530-01—1). Thirty-one\nprinciples for improving visibility have teen discovered (20-TV-2).\n2. Security Applications Television signals containing classified\ninformation con be transmitted to the classroom over a closed cir¬\ncuit cable (476-02-53).\n3. Critical Factors Television expense and labor can be more easily\njustified when the training situation is dangerous or mass train¬\ning is essential (530-01-1).\nD. INCIDENTAL TELEVISION INSTRUCTION (Audience may or may not watch)\n1. Dramatizations Dramatic treatments brought about less learning\nthan other types of treatment (476-02-82).\n2. Attitudes Polls have shown a definite acceptance by civilians of\nprograms dealing with book reviews, social problems, history, lec¬\ntures etc. (530-01-1).\nRECOMMENDATIONS\n1. Television should be used in training when the unique charac¬\nteristics of television ma’ e its use clearly advisable (Dangerous\nsituations, special application*).\n2. Since television is a good instructional media it is important to\ndiscover whether it can practically compete with other instruc¬\ntional media. This can be done by considering its cost, average\neffectiveness, personnel requirements and programming requirements.\nTelevision systems should be developed and put in use that tend to\nset television in a better competitive position (minimum equipment\nand personnel).\n3. Television film records should be produced competitively with sim¬\nplified filming techniques such as newsreel type films and mag¬\nnetic sound track films. They should be produced to meet the spe¬\ncific needs of the military not presently met by the photographic\ncenters.\nCopied: NAEB Hq.\n6/20/54 Jy"
}