{
  "id": "d1519-5",
  "text": "4. Specific Films. Specific conteit in films is reeuired to meet specific\ninstructional objectives, Filina with broad superficial con'bent aimed\nat a generalized audience are likely to be less effective than films\nwith well specified content aim 2d at an audience of known characteris¬\ntics (-19, »*3l).\n5. Specific Audience. Films should be prepared for a specific audience\n1-31).\n6. Purposeful Use, Use films to taach.. Films are likely to be more ef¬\nfective if they arc integrated into the curriculum, and if they are\nrelated to carefully formulated instructional objectives (-31)•\n7. Consistent Use. People learn to learn from films (-20), When films\nare used as fill-in, for entertainment, or if the content does not\nappear to the trainee to be pertinent to the course being studied,\nthere is likely to be less learning than would otherwise be the case\n(-24).\nFOR THE FILM PLANNER AND PRODUCER\n1. Camera Angle. Show a performance on the screen the way the learner\nwould see it if he were doing the job himself (-5).\n2. Rate of Development. The rate of development of a film should be\nslow enough to permit the learners to grasp the material as it is\nshown (-17).\n3. Succinct Treatment. Presenting only the bare essentials or rapid\ncoverage of subject matter may ce very ineffective (-11).\n4* Show Errors. Learning perform ice skills from films will be in¬\ncreased if you show common errors and how to avoid them (-17).\n5. Repetition. Organize a film so that important sequences or concepts\nare repeated in a variety of ways (-17). Repetition of films, or\nparts within a film, is one of the most effective means for in¬\ncreasing learning to a required level (-12).,\n6. Organizational Outline. Films which treat discrete factual material\nappear to be improved by the use of an organizational outline in\ntitles and commentary (-33)*\n7. Introductions. Present relevant information in the introduction and\ntell the viewer what he is expected to learn from the film (-8).\n8. Summary. Summarize the important points in the film in a clear con¬\ncise manner. Summaries probably do not significantly improve learning\nunless they are complete enough to serve as a repetition and review\n(-8).\n9- Visual Potentialities. Take advantage of the ability of the motion\npicture medium to show motion, .0 speed up and slow down motion, to\ntelescope and otherwise control timing of events and processes, to\nbridge space, and to organize events and actions (-19, -31). The\nvisuals and commentary in a film .should reinforce each other (-18)-"
}