{
  "id": "d1519-6",
  "text": "lOo Picture-Commentary Relationship, The commentary of a typical in¬\nformational film appears to teach more than only the pictures of\nthat same film when learning is measured by verbal tests (-18).\nThis does not necessarily mean that the commentary has greater in¬\nherent effectiveness than picture s5 it may mean that procedures are\ncurrently relying more heavily on commentary than on pictures or on\nthe optimum integration of the two. With films designed to teach\nperformance skills, where learning is measured by nonverbal tests,\nthe pictures appear to carry the main teaching burden (-4).\n11. Concentration of Ideas. Ideas or concepts should be presented at a\nrate appropriate to the ability of the audience to comprehend them\n(-7).\n12. Commentary. The number of words (per minute of film) in the com¬\nmentary has a definite effect on learning. Care should be taken\nnot to \"pack” the sound track (-/>, -11, -17).\n13. Use of Personal Pronouns. Use direct forms of address (imperative\nor second person) in film coramen varies. Avoid the passive voice\n(-4)<-\n14. Nomenclature„ Introduction of new names or technical terms in a\nfilm imposes an additional teaching burden on learners, and may\nimpede the learning of a perform* nee skill (-11, -17).\n15. Special Effects. Special effects used as attention getting devices\nhave no positive influence on learning (-9),\n16. Optical Effects. A film in which such optical effects as fades,\nwipes, and dissolves have been replaced by straight cuts, teaches\njust as effectively as a film which uses these effects (-34)»\n17. Steroscopic Films. In the one erperiment conducted, the addition\nof stereoscopic vision did not ir crease learning of a motor skill\nperformance (-32).\n18. Color. Experimentation has not jet demonstrated any general over¬\nall increased learning as a result of using color in instructional\nfilms (-28).\n19- Music. Preliminary experimentation suggests that music does not\nadd to the instructional effectiveness of an informational film (-19).\n20. Pre-testing. Scripts, workprints, demonstrations and final prints\ncan be evaluated quickly using the learning profile method of film\nevaluation which requires a group of trainees to estimate their\nown learning (-23).\n21* Film Loops. Short film loops wh.ch can be repeated continuously as\nmany times as desired, appear to be a good way of teaching difficult\nskills (-25, -26, -27).\n22. Participation. Learning will increase if the viewer practices a\nskill while it is presented on the screen, provided the film develops\nslowly enough, or provided perioc s of time are allowed which permit\nthe learner to practice without missing new material shown on the\nscreen (-17).\n-6-"
}