{
  "id": "d1519-7",
  "text": "FOR THE INSTRUCTOR\nlo Let the Film do the Instruction. Good films can be used as the sole\nmeans for teaching some kinds of factual material and performance\nskills. Where the instructional situation makes it advisable, take\nadvantage of this possibility (-13, -17, -26, -29).\n2o Instruct Students to Learn from Films. Tell the viewers firmly that\nthey are expected to learn from the film and if possible, tell them\nthat they will be tested and do so (-24). This procedure will result\nin increased learning.\n3. Increase the Amount of Learning, Learning can be increased by repetitive\nshowings (-12,-16), pre-testing (-35), post-testing with knowledge of\nresults (-30), and introducing the film and stating the purpose and\nimportance of the showing (-24).\n4. (fee of Study Guides. Ability to learn from films improves with\npractice in learning from films (-20), Trainees will learn more\nif printed study guides are usee before and after film viewing (-13).\n5. Distractions, Note-taking should not be encouraged during the'\naverage film showing because it interferes with attention and hence\nlearning (-21).\n6. Use Film Loops in the Practice /rea. One showing of a film dealing\nwith a complex skill may be insufficient (-29). Show a film in the\npractice area so that the student can easily refer to the film\nmodel as often as necessary. This can be accomplished by rear\nprojection of film loops on daylight screens in the work area\n(-25, -26, -27).\n7. Use Mental Practice. Men can partially learn to do a skill by\nwatching a film and imagining that they are performing the skill\nand by going through the skill 1 mentally”, even though they do\nnot have the equipment available (-27). Films can provide a model\nfor guided \"mental” practice.\n8. Length of Film Sessions, Film viewing sessions of informational\nmaterial can extend to at least one hour without reduction in\ntraining effectiveness (-3).\n9. Evaluate Film Showings. Do not assume that learning has occurred\nas a result of showing a film. Evaluate the effect of a film by\ngiving a test (-30, -31).\nFOR THE STUDENT\n1- Learn from Films Alone, You car learn from films alone (-13), and\nthe more films you see, the more you learn from other films (-20),\n2. Learning is lour Job. Films maj contain many pleasant devices that\nmight cause you to forget their serious instructional purposes.\nFilms are being used to train you and you are expected to learn\nfrom them (-9, -23, -24).\n-7-"
}