{
  "id": "d1519-8",
  "text": "3. Discover the Instructional Purpose. If it Is not clear to you, ask\nyour instructor what the purpose is of the film s'owing, and how\nthe material relates to your training (-31).\n4° Nomenclature. Ask your instructor which names of parts must be\nlearned (-11,; -21).\n5. Make Certain You are Learning. You will know when you are learn¬\ning (-23). If you do not think you are learning call this to your\ninstructor* s attention (-25)»\n60 Watch for Outlines, Outlines or titles organize a film presentation\nand indicate how the various topics are related (-33)° It will\nhelp you to learn if you will look for and study them carefully.\n7. Concentrate on the Sound. The sound track often covers the important\nmaterial to be learned in an informational film (-18).\n8. Mentally Practice. Imagine that you are doing the job, or mentally\nimitate the operations when you are learning from a skill training\nfilm (-27).\n9- Ask for a Re-showing. If you didn*t learn the first time, ask for\na repeated showing (-12).\n10. Note-takingYou may miss something if you try to take notes during a\nfilm. Don111 take notes unless you have plenty of time and will\nreview them (-21).\n11, Ask for Test Results. If you are tested on film content, ask to\nhave the correct answers to the questions explained to you after\nthe test so that you can improve.’ your learning (-30).\nSUMMARY OF INSTRUCTIONAL TELEVISION RESEARCH REPORTS\nLIVE INSTRUCTIONAL TELEVISION FOR Tf-E CLASSROOM\n1. Effectiveness A television program can be at least as effective\nas comparable means of instruction (476-02-S2, 476-02-S3),\n2. Acceptance Television .instruction is well liked (476-02-S2y\n53O-OI-I5T Well prepared programs were highly acceptable after\nan eight week period of television training (476-02-S3).\n3* Mass Training Television is a feasible and effective means for\ninstructing widely separated groups (476-02-S2, 476-02-S3).\n4. Principal Problems (476-02-S3)\na. Procurement and training of personnel for planning and pro¬\nducing television lessons.\nb. Procurement of television equipment and personnel to main¬\ntain it.\n5* Retention of Learning Most learned material was retained over a\nsix week period(47&-02-S3)*"
}