{
  "id": "d1519-9",
  "text": "6. Level of Instruction All grades of personnel learned from\ntelevision programs (476-02-S3).\n7* Novelty Effect In 1950 trainees said that the television in¬\nstruction they received was more effective than the average\ntraining film This instruction was carefully prepared, skill¬\nfully presented and the trainees tried to learn (476-02-83).\n8. Effective Presentations Items that were explicity covered were\nwell learned. Sketchily treated items were not learned\n(476-02-S3).\n9. Dramatic or Factual Learning occurred when specific informa¬\ntion was presented. Little learning occurred from dramatic\nor situational presentations (47*>-02-S3).\n10. Introductions Speeches by high-ranking officials were with\nfew exceptions too long, quite boring, poorly reproduced and\ndetracted from the instructional value of the programs\n(476-02-S3).\n11. Screen Size Twelve to twenty inrh television screens were\nsaid to be adequate by trainees (476-02-S3).\n12c Applicability A criteria check list has been developed to\ndetermine courses of instruction which are suited for tele¬\nvision instruction (530-01-1).\n13„ Single Crmera One television camera will fulfill most mili¬\ntary training needs but for reliability and flexibility, two\ncameras are more desirable (530-01-1).\n14* Instructors Qualified instructors can be trained to teach by\ntelevision in a relatively short time (530-01-1).\n15. Minimum Equipment Television Experience has indicated that a\nminimum of equipment gives the greatest training per dollar ex¬\npended for televising instruction (530-01-1).\n16. Courses Effective television training has be n carried out in\nlarge number of subject areas (530-01-1).\n17. Films Films are effective on television (530-01-1, 476-02-S2,\n476-02-83).\n18. Television Recordings (kinescope;*) Film recordings of tele¬\nvision programs are a valuable by-product (530-01-1, 20-TV-l,\n476-02-S2).\n19. Mobile Television A mobile television studio and associated\nequipment can be used to present and record television programs.\nFILM RECORDINGS OF TELEVISION PROGRAMS\n10 Effectiveness Film recordings of television programs (kine¬\nscopes) are very satisfactory for military training even though\npicture quality may be poor (20-TV-l, 476-02-S2).\n2. Use Kinescope recordings were recommended for training instruc¬\ntors, duplicating lessons, disseminating now developments and"
}