{
  "id": "d1286-3",
  "text": "This possibility was mentioned by Samuel Greenberg, chair¬\nman of the finance committee of the state Senate, in a recent\ninterview.\n^ Hopes were sparked for a return to Saturday broadcast¬\ning by the Wisconsin State Radio Council network at a re¬\ncent legislative hearing. Questioning by the legislators con¬\ncerned what kind of programing could be offered, rather than\nchallenged the proposal that the service be restored.\nINSTRUCTION\n^ Two series of ten half-hours each have been produced in\nFlorida to aid in instructing studio teachers and utilization\nteachers. The series are available on videotape or 16mm film;\na study guide accompanies each series. They were produced\nat WEDU, Tampa, by the radio-TV division of the Florida\nInstitute for Continuing University Studies. For information,\nwrite: Florida ETV Commission, 303 Dodd Hall, Tallahassee.\nTexas A&M University is setting up a TV studio and\ndistribution system. Meantime, the university has contracted\nwith TEMP to produce a series of lessons in English com¬\nposition.\n^ Reporting on a study of the Peace Corps ETV project in\nColombia, Nathan Maccoby, Stanford University professor of\ncommunication, said that ETV, coupled with the ancient\nSocratic method of teaching, is apparently the most effective\nlearning method for youngsters in less privileged countries.\nOn the Huntley-Brinkley program April 14, in a report on\nthe same ETV project, the statement was made that it has\nbeen so successful that a number of other countries are in¬\nterested in starting such projects.\nGENERAL\n^ WRVR, New York City, was the only radio station se¬\nlected this year for a 1964 George Foster Peabody award.\nThe award, presented April 26 at a Broadcast Pioneers lunch¬\neon, was for “distinguished and meritorious service.”\n^ KFME (TV), Fargo, N. D., plans to have new equipment\ninstalled and operating in its studios and control rooms by\nJune 1. The station, which celebrated its first anniversary in\nJanuary, will then have complete studio facilities for live and\nrecorded programs. KFME has contracted with Concordia\nCollege, Moorhead, Minn., to produce and broadcast the col¬\nlege’s freshman and sophomore English courses; this marks\nthe first major use of educational broadcasting by any insti¬\ntution of higher learning in the area.\n^ Construction is scheduled to begin this month on Alabama’s\nsixth ETV station, in Huntsville.\n^ KUID-TV, University of Idaho, was scheduled to begin\non-air broadcasting by the end of April, forming the first\nlink in the proposed Idaho ETV network. Stations in Boise\nand Pocatello will complete the net, which will cover 90% of\nthe state. KUID-TV operates on Channel 12, 115 kw visual\nand 58 kw aural power. Northern Idaho, eastern Washington,\nand northeastern Oregon are in the coverage area, which in¬\ncludes 150,000 adults and 40,000 school children.\n^ Construction has begun on the Lehigh Valley ETV station,\nBethlehem, Pennsylvania. The target date for scheduled pro¬\ngraming is September, serving a 70-mile radius and broad¬\ncasting over Channel 39.\n^ KWSC-TV, Washington State University, now has a UHF\nrepeater station in operation in Clarkston, which adds a po¬\ntential 45,000 new viewers.\n^ WMVS-TV, Milwaukee, is broadcasting two or three hours\na week in color.\n^ Beginning June 1, KUHT-TV, Houston, will operate a\nnew full-power transmitter which can carry programs into 23\nGulf Coast counties which have at least 600,000 students. The\nUniversity of Houston has created a new coordinating agen¬\ncy to plan expanded programing with school officials. Mrs.\nDorothy Sinclair, a supervisor of radio, TV, and film pro¬\nduction for the Houston schools for 13 years, will direct the\nagency. KUHT’s coverage will increase from the current\naverage radius of 30 miles to one of 80 to 90 miles.\n^ A new company, Colorado Video, Incorporated, has en¬\ntered the electronic communications and instrumentation field,\nas announced by its president, Glen Southworth. Initial em¬\nphasis will be on specialized large-screen oscilloscopes, avail¬\nable in three or four months.\n^ KWSC-TV, Washington State University, sent a camera¬\nman with the university student body president to Selma, Ala¬\nbama, to cover the march from a student’s point of view.\nTransportation was financed by contributions received during\na one-day campaign.\n^ The University of Michigan and Time-Life, Inc., Broad¬\ncasting, have jointly established a graduate radio-TV intern¬\nship program, claimed as the first in the nation. Under the\nplan, the student will continue to be enrolled at the univer¬\nsity while working at WOOD-WOOD TV, a Time-Life sta¬\ntion in Grand Rapids. The station will give the intern all¬\nround training and responsibility at current salary rates.\nPLACEMENT\nPOSITIONS AVAILABLE\n(For information, write the Placement Service, at the NAEB\noffice in Washington. In order to be considered through these\nchannels, the reader must be an Individual Member of the\nNAEB, with credentials on file with the NAEB Placement Serv¬\nice. Non-members can save time by sending the $10 annual\ndues and $10 Placement registration fee at the time of in¬\nquiry.)\nMay-1 Experienced TV producer-director sought by north-\nwestern university with well-equipped film and TV fa-\ncilities. Requires man who can teach TV production\ncourses at university level as well as produce quality\nprograms for both CCTV and state-wide distribution.\nOpportunity to associate with growing, energetic de¬\npartment of film and TV production. M.A. required. Sal¬\nary: $6800 to $7200 per year, rank according to quali¬\nfications. Open July I, 1965.\nMay-2 Cameraman with at least two years experience in cam¬\nera operation, lighting, and set erection needed by\nWashington, D.C., noncommercial TV station. Salary\nopen. Position available immediately.\nMay-3 Instructor or assistant professor with Ph.D. or strong\nM.A. needed for rapidly developing radio-TV depart¬\nment at northeastern university. Duties include teaching\nbroadcasting courses and serving as faculty manager\nof FM station; ample opportunity to use both ETV and\nCCTV facilities on campus. Salary and rank according\nto experience and academic background.\nMay-4 North suburban Chicago area ITV system seeks co¬\nordinator for township-wide activities; strong background\nin public school education and administration. Should\nbe an enthusiastic and effective communicator, open-\nminded individual, far-sighted in ability to determine op¬\nportunities for creative advancement in pursuit of edu¬\ncation. Background in TV techniques desirable. Twelve-\nmonth contract; position open September, 1965.\nMay-5 Curriculum director and program director needed by\ndeveloping 2500mc ETV service with public school sys¬\ntem in Northeast. Salary and rank dependent on educa¬\ntion and experience.\nMay-6 Instructor of speech/assistant director of radio-TV for\npublic relations sought by New England university for\nSeptember, 1965. Position will carry double title and\ndouble responsibilities, i.e.: teaching basic speech cours¬\nes, assisting in supervising two student-operated campus\nradio stations, and production of radio and TV programs\nfor release to educational and commercial stations. Cam¬\npus ETV station in planning stages. Salary: $6,200 to\n$8,000 for nine months, twelve-month appointment prob¬\nable by 1966.\nMay-7 Assistant professor sought by major Midwestern uni¬\nversity's radio-TV department, predominantly teaching\nassignment. M.A. required, Ph.D. desirable. Salary range\nbetween $7,400 and $8,500 per year.\nMay-8 Instructor in speech/broadcasting needed by Midwest¬\nern university with expanding ETV program. Master's de¬\ngree necessary. Salary and rank open, dependent on in¬\ndividual's background and experience.\n4\nNEWSLETTER"
}