{
  "id": "d1352-0",
  "text": "N-A-E-B NEWS LETTEP\nNational Association of Educational Broadcasters\nMadison, Wisconsin—October 20, 1936\nF.C.C. ALLOCATION HEARING\nThe NAEB was represented at the allocation hearing before the Federal Communi¬\ncations Commission on October 5, 1936 by Prof. Edward Bennett of the University of\nWisconsin and President H. B. McCarty, with a statement included from R. C. Higgy,\nStation WOSU. The case was based on the necessity for recognizing social consider¬\nations, as well as those purely technical, in making any study of allocations.\nComplete copies of both speeches will be sent to all NAEB members, in the next few\ndays. BROADCASTING magazine, Oct. 15, contains an extensive report of the hearing.\n’’Read all about it”l And allow for the bias.\nOFFICERS ELECTED FOR THE YEAR 1936 - 1957\nPresident II. B. McCarty, WHA, University of Wisconsin, Madison\nVice Pres. Carl Menzer, WSUI, University of Iowa, Iowa City\nSecy-Treas. B. B. Brackett, KUSD, University of South Dakota, Vermillion\nExecutive\nCommittee: C.\nR.\nE.\nF.\nW.\nC.\nExec. Secretary\nE. Daramon, V/BAA, Purdue, West Lafayette, Indiana\nC. Higgy, WOSU, Ohio State University, Columbus\nP. Humbert, WTAW, Texas A & M, College Station\nF. Nalder, KWSC, Washington State College, Pullman\nE. Phillips, WILL, University of Illinois, Champaign\nA. Taylor, WESG, Cornell Univer, ity, Ithaca, New York\nH. A. Engel, WHA, University of Wisconsin, Madison\nNAEB CONVENTION NOTES\nThe NAEB meeting in Madison August 17-18 brought together a fine group of\nearnest educational station workers. Two days of discussion and conference re¬\nsulted in renewal of conviction and effort to explore and assert the place of\neducation on the air.\nSupplementing intimate talk of station problems, program ideas, and recording\ntechniques, speakers from Washington and New York focused attention on national de¬\nvelopments. C. M. Jansky, Jr., Consulting Radio Engineer, gave a thorough analysis\nof allocation problems and fundamental engineering principles affecting educational\nstations at the Oct. 5th F.C.C. hearing. He stressed the importance of considera¬\ntions such as freouency assignment, territorial location, and station efficiency,\nas well as power. Fading and interference characteristics of ultra-high frequencies\nwere also described.\nS. Howard Evans, Secretary of the National Committee on Education by Radio, in\na stimulating talk gave assurance of continued support to educational stations irom\nthe National Committee. He pointed to present obstacles and inequalities and called\nfor the three parties most vitally concerned in broadcasting to face their responsi¬\nbilities squarely. ’’The government,” he said, ’’must determine what the status of\nits regulating body shall be. Commercial broadcasters must recognize their limita—^\ntions and admit that they cannot do the whole .job of broadcasting. And non-commercial\ninterests must find the money and the means to be more constructive in their radio\nactivities.”\nWilliam D. Boutwell, of the U.S. Office of Education, reported on the Federal\nRadio Education Project and told of its growth and plans. Program production by an\nagency of the federal government is a significant development in educational broad¬\ncasting, and NAEB members will do well to keep in touch with this activity, (Write\nto the Office of Education for the bulletin, Airways to Learning, if you haven’t seen\na copy.) Boutwell proposed publication of a brochure telling the story of education¬\nal stations and offered the assistance of his office in editing material. Ev^ns\nagreed to solicit funds .^or printing from the National Committee on Education by\nRadio and was successful in doing so. Our thanks to Boutwell and Evans and their\norganizations."
}