{
  "id": "d1352-2",
  "text": "- % -\nlast year's staff have returned. Three of our last year's staff now have positions\nwith other radio stations.\n’’The second item is that we have resumed our broadcasts for the Arsenal Tech¬\nnical Schools of Indianapolis and increased the number of programs integrated with\ncourses to ten. The listening audience will vary from one hundred to seven thou¬\nsand for these programs.\n\"The third item is that we have -initiated a cooperative arrangement with the\nLafayette City Schools to broadcast three programs to the grade schools. Geography\nin the News will be broadcast to the fourth, fifth, and sixth grades. Story Time\nwill be broadcast to the first, second, and third grades, and Great Inventions and\nTheir Inventors to the fourth, fifth, and sixth grades. We shall continue our\nstudio in the Jefferson High School in Lafayette from which we will broadcast a\nweekly one-half hour program on Wednesdays by the high school students, and a pro¬\ngram on Fridays by one of the grade schools. There are nine grade schools in\nLafayette.\n\"Perhaps the most outstanding experiment this season will be our Hoosier Town\nHall. Each Thursday from 11:00 to 11:50 we will broadcast from the class room of\nProfessor Lull a discussion of the technique and principles of public discussion\nand argumentation. Thr.s instruction will be related to a definite current subject.\nBy previous arrangements with luncheon clubs, schools, etc. in nearby communities,\nwe will assign succeeding dates to certain communities for an actual public dis¬\ncussion to be held in cooperation with this broadcast. These groups will be res¬\nponsible for promoting the forum and urging all the people to listen to the broadcast\non Thursday morning. Then two members of the class will be sent out by the Univer¬\nsity to the community to conduct the actual public forum. If the individual has\nlistened to the broadcast, he has received instructions as to form and techniques\nand an introduction to the subject to be discussed.\"\nWTAW - A & M COLLEGE OF TEXAS\n\"Radio Station WTAW,\" reports Director E. P. Humbert, \"completed one yeer of\nits Farm and Home program over the Texas Quality Network September 16, 1936. It\nwas a happy birthday, going out over WFAA Dallas, WBAP Fort Worth, KPRC Houston,\nand W0AI, San Antonio. The program covers a large territory of the Southwest. It\nis 100 per cent educational.\"\nWQSU - OHIO STATE UNIVERSITY\nAs usual Ohio is in full swing again, according to the report from Director\nR. C. Higgy who sends this word:\n\"The Fall Quarter program of the Radio Junior College includes courses in Ohio\nhistory, psychology — child development, a Radio Ghoir Festival, French, rural\neconomics, and English literature. Broadcasts from two to five times per week in\neach of these courses have been arranged, many paralleling the regular University\ncourse work. The Summer Quarter, 1936, completed the tenth quarter of the Radio\nJunior College, with a total course enrollment of over 22,000, over 9,000 different\nindividuals participating. Large enrollments are being received from the more\nsparsely settled counties of the state, indicating definitely that those persons\nhaving fewer educational opportunities are tuning in the Radio Junior College courses\nin large numbers. Audience analysis shows that 98.6$ of those enrolled have attended\nhigh school, and 35$ hrve attended a college or university. WPA assistance in pro¬\nviding office workers, materials, and postage will again be continued for the Fall\nQuarter.\n\"A combined mail response and engineering survey of the W0SU audience has been\ncompleted, and the re,suits published in mimeographed form. The analysis of the\nstation's mail by counties over a three year period is shown to compare very"
}