{
  "id": "d1808-0",
  "text": "/\nREPORT OF THE N.U.E.A. COMMITTEE ON RADIO\nMAY 1941\nPROGRESS\nReports from member institutions of the N.U.E.A. as well as from\nnon-member institutions indicate steady progress in the following features of\neducational broadcasting:\nA greater emphasis upon program production#\nEstablishment of radio libraries.\nEstablishment of courses in radio broadcasting and its use#\nIncreased use of recordings#\nOrganization of councils for cooperative production of broadcasts#\nBetter cooperation between schools and commercial stations#\nAn increasing recognition of university obligation in broadcasting\nfield.\nEstablishment of adequate broadcasting staffs and radio budgets#\nImproved publicizing of programs#\nEstablishment of local studios for radio work shops, both as train¬\ning centers and producing centers•\nROCKY MOUNTAIN RADIO COUNCIL\nThis is a formal organization of 27 institutions and agencies in\nColorado and Wyoming for cooperative production of broadcasts• The Council is\nfinanced by funds from foundations as a demonstration in cooperation. The\nCouncil has finely equipped studios and offices at 21 East 18th Avenue, Denver.\nThe Council assists members in the following ways:\nGives expert advice and counsel.\nClears copyrights.\nMakes recordings at central studio or on campus with portable equipment.\nContacts broadcasting stations•\nMaintains booking service for broadcasts#\nMaintains radio library#\nTrains broadcasters, gives auditions#\nPublicizes council program#\nEdits scripts.\nRehearses broadcasts.\nConducts listener surveys.\nOperates transcription exchange for schools.\nThe Council started operations November 1, 1939. In the first nine\nmonths, 795 Council broadcasts were participated in by 16 institutions and\nagencies. In July, the Council, following audience surveys, was granted funds\nfor three-year extension of the demonstration. Experience of the nine months’\ntest period was highly satisfactory. Producers and broadcast stations cooperated\nwell. The cooperative production of broadcasts is resulting in a rich program\nfor the region without undue burden upon any of the producing agencies. The\nCouncil is stimulating local organization, the establishment of local studio"
}