{
  "id": "d1808-5",
  "text": "-6-\noperated in close cooperation with the Lee County Board of Education. Each of\nthe 54 schools in Lee County will be equipped with receivers. The University\nof Kentucky College of Education has carefully developed a thirty-minute program\nto be broadcast to Lee County schools each day of the week designed to supplement\nthe students* regular work.' In addition, broadcasts will include news, agri¬\nculture, homemaking, health, weather, time, and numerous other services. Mr.\nElmer G. Sulzer is Director of Radio Activities•\nLOUISIANA - Louisiana State University reports a general improvement in broadcast\ntechniques and programs following a special twelve weeks course in broadcasting\nfor agricultural extension staff workers who participate in numerous broadcasts\npresented by the Extension Division.\nMICHIGAN - During the past year the University of Michigan presented 19 radio\nprograms over three commercial stations: WJR, Detroit; WCAR, Pontiac; WMBC,\nDetroit. These stations provided their facilities free, the University paying\ntelephone tolls on programs to the station*s transmitter. The University Broad¬\ncasting Service is an adjunct of the University Extension Service* It is under\nthe control of a University Committee on Broadcasting and its Director since 1925\nhas been Professor Waldo Abbot. The facilities are used by students in the De¬\npartment of Speech. Classes in the fundamentals of radio, radio dramatics, radio\nwriting, radio speech, and laboratory in the recording and reproduction of speech\nare offered. The University has been granted authority for a frequency modula¬\ntion station but the application has not been filed.\nMINNESOTA - The University of Minnesota has its own radio station, WLB. It is\nadministered as a department of the Extension Division with Richard R. Price,\ndirector of the General Extension Division and Richard Paulu, manager of WLB, in\ncharge. University lectures, courses broadcast from the classroom, musical pro¬\ngrams and miscellaneous educational programs are regular features. The Univer¬\nsity School of the Air, carried over the North Central Broadcasting System, a\nregional network of ten stations in Minnesota and North and South Dakota, had over\n50,000 classroom listeners each week of the past year.\nMISSOURI - The College of Agriculture at the University of Missouri presents a\nfifteen minute program devoted to timely discussions of farm problems daily ex¬\ncept Sunday over several Missouri stations.\nWashington University reports increased radio activity on the campus.\nPrograms are presented regularly over KMOX, a local'CBS station; over KSD, the\nlocal NBC station on the Red Network; and over KXOK, a local station.\nMONTANA' - Most of the broadcasting is done from the studios of KGV0, a commercial\nstation, although there are some broadcasts from the campus by remote control.\nAn All-University Radio Committee composed of instructors who offer radio courses\nand whose departments include radio work, forms policies and practices for the\nentire campus. The University works in collaboration with the Montana Council on\nCivic Broadcasting. Radio activity is limited due to lack of facilities but plans\nare under way for centralized campus studios•\nNEBRASKA - For several years the University of Nebraska has utilized the facili¬\nties of a commercial station affiliated with CBS. Increasing network demands\ngradually eliminated educational broadcasts of the Institution. For two years\nbroadcasts have consisted of crop and weather reports and five minute discussions"
}