{
  "id": "d1808-7",
  "text": "-8-\nSOUTH DAKOTA - The major trend during the past twelve months has been toward in¬\ncreased student control of station policies and practices until KUSD is almost\nentirely student operated. Actual control is vested in a faculty radio board\nand faculty direotor who is the director of the University Information Service.\nEmphasis has been placed upon educational and public service broadcasts and upon\nbroadcasts by and for children.\nTENNESSEE - The Division of University Extension provides six fifteen minute pro¬\ngrams each week over WSM, NBC outlet in Nashville; four fifteen minute programs\nper week over WNQX, Columbia outlet in Nashville, and a half-hour weekly pro¬\ngram over WROL, another NBC outlet. Arrangements are made with local stations\nthroughout the state for the use of transcriptions. Oscar E. Sams is in charge\nof radio work at the University of Tennessee.\nTEXAS - The year 1939-40 was the first for the University of Texas to maintain\na constant series of programs through two state-wide chains. The programs origi¬\nnated from the University’s new studio. Radio House, officially opened in October,\n1939. Radio House was constructed and furnished with the latest radio equipment\nat a cost of approximately $25,000. It is administered by the Department of\nPublic Relations. Radio has its own staff, assisted by a faculty committee which\nhelps determine the radio policy. Dramatic productions originate in the Radio\nWorkshop with results tested by the Bureau of Research in Education. A total of\n256 broadcasts were presented last year. Two radio conferences were held on the\ncampus, one in cooperation with the NBC and the other in cooperation with educa¬\ntors interested in radio.\nWISCONSIN - The University of Wisconsin owns and operates WHA (940 kc, 5000\nwatts). Eight full-time and six part-time workers are in charge of the station.\nA Committee on Radio Broadcasting is authorized to formulate and recommend\nbroadcasting policies of the University, although station WHA is on the budget\nof the State Department of Agriculture. During 1939-40, WHA broadcast 58\nhours a week at a total cost of $26,960, or about $8.80 pet broadcasting hour.\nThirteen programs, planned especially for school listening, are presented each\nweek over the ’Wisconsin School of the Air. The Wisconsin Research Project in\nSchool Broadcasting, financed by the General Education Board, was terminated in\nSeptember, 1939. The Wisconsin \"College of the Air\" is in its seventh year and\nincludes ten courses or weekly series of broadcasts. During a typical week as\nmany as 150 students participate in WHA programs. The station offers a record¬\ning service to University and state departments. State departments, other\neducational institutions and civic organizations carry their messages to the\npublic over station WHA."
}