{
  "id": "d138-180",
  "text": "oage 4\n\"ROLE OF THE CLASSROOM TEACHER\" - Film Content Outline\nThe classroom teacher is seen considering briefly different types\nof behavior. . .what would be seen on the screen . . . what\nwould be appropriate in the classroom.\nWhat behavior is expected to result from this lesson? What are\nsome appropriate activities?\nd. A specialist in student needs, interests, strengths, and weaknesses.\n(1) Classroom reacher is seen drawing upon his knowledge\nof the class as a group, his knowledge of the situation,\nhis knowledge of individual students, to get this\nparticular class ready to view this particular lesson.\nHe makes sure that the students have what they need\nto have and know what they need to know to get\nthe most from the lesson. (Materials at hand,\ninstructions clear, practice in viewing and listen¬\ning skills, readiness for content, interest aroused,\nawareness of what they are to watch for and what\nthey are expected to do as a result.)\nHe organizes the physical classroom in the best way\npossible to permit maximum viewing, to enable\nhim to assist those who may have trouble.\n(2) Classroom teacher is seen actively involved with the class\nduring the telecast.\nHaving stimulated interaction during the lesson with\nquestions, things to watch for, instructions for notes,\nor some special activity for working along with the\ntelevision teacher during the telecast, the teacher\nwatches the television lesson, watches his students,\nmakes notations (demonstrated) on the lesson or on\nthe students1 reactions. . .to guide him in working\nwith his students or in making evaluations for the\ntelevision teacher after the telecast.\n(3) The classroom teacher is seen making a quick, careful check\nto see how successful the television lesson has been in\nachieving its purpose. . .to determine which areas need\nreinforcing, clarifying, or expanding.\n(4) Classroom teacher is seen involving the students in the class:\n(a) in total group activities. . .where the whole class\nis involved in the same process. . .\n(b) in small group activities. . .for special projects."
}