{
  "id": "d813-28",
  "text": "* 10 -\nT&© question was then asked about the separation of Church and\nState and the us© of public funds* The reply was that in tho\nDetroit plan a subscription approach will iaclud© all* la Los\nAngoloe the Board of Control will bo too largo- for any single\norganisation to control, and the problem will b© handled •• ■\nin that way*\nfhon 10 the proper time to ask for tolovisaion consultants? Any\ntime you got two or more people together, just writ© and ask* Of\ncourse you may bo beyond needing consultants*' la many places\nlocal groups have gone so far on their own that there is little\nthe national organisations can do to kelp thorn* After a certain\npoint, it snot bo your baby* *\nThe issue was then raised as to whether or sot certain of bho\nassisting organisations wore not overwhelming HAlSB’s ’grass root©**\nHas NCCET really don© what it was sot up to do? In on© locality\nit has promised to use its influence, but so far nothing has boon\ndone* It ha3 seat down a handsome brochure, ^greatest Inventi©a\n3iae© Printing** but the brochure states that educational tolovi^ ■\neioa will cost $500,000 for the first year’s operation* This state*\nmoat is enough to kill 200 potential applications by itself*\nContact with HOC 1ST on this point produced only the answer that\nHew. York ^tat© had been embarrassed by underestimating costs*\nFinally, when a consultant came down,- hie attitude was *C©3b doesn’t\nenter into this * you can sell it no matter what the cost* *• There\nis a real,danger that these self-constituted groups are going to\n\"love us to death* unless they listen to us in the ’grass roots’*\nMr* Ausmus said .ho would convey to H0CJ3T these throe aajor sugges¬\ntions: 1} that it maintain closer liaison with local group©., 2)\nthat it act distribute literature without permission, and 3) that\nwhen it agrees to do something, it carry out its pledge* It-was\nfurther pointed out that 'consultants coming from the national\norganisations to local communities must know educational philo¬\nsophy and process©© else thoy will •embarrass the cause of eduea*-\ntioaal television*\nTh© discussion turned to costs, and it was pointed out that on\nChannel 15, for example* ©a© could go on the air for #7.50000 to\n300,000 minimum, with a projector and film operation, no cameras*\nHowever, the objection was raised that it is possible to. sell in\nreverse- and that when educational TV goes on the air it must bo\ngood in order to gain continued support* Of course commercial\nbroadcasters, to judge from reports of applications in Broadeastlag»\nare going to go into television at'all kinds of different invest^,\nBent levels6 ••\nThe preliminary report oa Sfew Jersey*3 plans was road* It was\npointed out that both Alien DuMont and 3agetroa of ECA wore members\nof the Commission drawing up the report, and go the cost factor\nwas likely to be accurate. They planned to spend #340,000 for\ntechnical equipment: Of- this, #162,000 will be transmitter ©quip*\nmeat, #165,000 studio equipment, ami #31,000 video recorder. Annual\noperating ©spaas© has been estimated at #190,000*"
}