{
  "id": "d813-35",
  "text": "17\nspecial tiifficult!esa WABE has programmed such shows as PEOPLE\nUNDBR OOSmUNISy, THIS IS TUB ENEMY, and others 0 ‘.7 ABE broadcasts\nwith a power of 48OO x?atte, end is at the ond of its fourth year\nof operation* It is on from 8:55 a.a© to 5:00 p.nw They have\nno budget. There are sis high schools, sis elementary0 6 inter¬\nmediate schools#.and six upper elementary schools using the station©\nThey produce 13 shows a week and use 4 NAEB shows© The schedule\nis made up with very careful attention to grad® availability eo aa\nto be on the air at the most convenient hours for the teachers,,\n*£ach elementary program is repeated three times a week; high echo>l\nprograms are repe&tod seven times a day* The teacher© ha?a compl t<s\nfreedom; .no ones checks on their use of th© program although a\nreport of listening is requested©\nTelevl sion\nIn television, after the Southern Regional Conference which we.a\nheld in Atlanta, a Governor's Conforenc© was called * Th© Board of\nRegents wore to make a request. This action went to the Governor\nand he is holding it© K© also is econoay-mind©de tut has stated\nthat h® will writ© the FCC requesting a delay in the June 2 dead¬\nline* Meanwhile,, JaBB-T? is going forward. The station will bo\ngoverned by a board of all the educational institutions ia the arm.\nThey are planning a set-up which include*® 50* x 100* studios^ 1\nradio studio0 1 mobilo unit, and a video recorder. Their applica¬\ntion went in on the first of March©\nKENTUCKY: Miss Camille Halyard, Manager, NBKY-FM, Lexingt on©\nRadio\nThor© ar® two principal activities in Kentucky: iVFPL ia\nperhaps th© only radio station in th© country owned by a library.\nIn this fabulou© operation, the library possesses copies of pract «\nsally ©very educationally useful program available anywhere, end\non© can borrow the©© program!? as on© would borrow a book. Dii-eet\nlines from the local stations permit tho library to record programs\nfor in-school non-commercial listening; 38 pairs of lines to th©\nschools permit the teachers to request and receive over a private\nwire practically any program desirod© There is a new threo-kllow tt\ntransmitter for school broadcasting and a 50-kilowStt transmitter\nfor music.\nWBKY-FM at the University of Kentucky operate® with a great deal\nof student holp - th© teaching department and th© station have, th#\nsame staff - and after recent reorganization (a chert of which wa.t\nshown), this is now a very efficient operation© They hav© also\nadded an extra man this year to handle production© Tho University\nhas always doao a lot with commercial stations© They do a series\nevery day, five days a week, mailed out on tape® to as'many as 48\nstation©. These are largely program© produced for public service\norganizations© ffBKY is- on the air 3 hours a day at present and\nhopes shortly to go on 6 hours a day.\nTel ©vi ©3. on\n£ ha t about tel ©vision? Not too much has boon- don© about television\nin Kentucky. They ar® just beginning a- foundation program in ©dura¬\ntion which is designed to oil min at© some of th© most serious defi^\ncisncies in tho primary and secondary school system®, and so ther-i\nwill not bo - and perhaps ought not be under the elrouxastanees -\nany state-wid© effort in educational talovieion© Actually,, only\non© educational television channel has been allocated to th© Stat"
}