{
  "id": "d813-39",
  "text": "20\nlast Jua3, f/U3C has been putting on© program, TH3 UNIVERSITY FORUM,\non a commercial station. In April they plan to go on commercial\ntelevision* The Junior League has kept radio alive in the schools\nin this community. They have found an ’angel* to pay for program\nrentals and persuaded stations to donate time* A regular report\nform is in us© among the schools and prepared laanuals are available\nto teachers for NAiSB shows* There are still serious difficulties\nin lack of receivers and usage of equipment.\nTeloviel on\nNot very much progress has been mad® \\Tith the 4 allocations for\nSouth Carolina. Although the Superintondent of Public Instruction\nhas espro3SGd interest* ha feels reluctant to approach the governor*\na meeting hao been called for the Columbia area on March 16 and\n600 to 7OO invitations have boon sent out to persons within a 60-\nmil© radius of Columbia*, an area including 9003000 persona - 25O5OOO\nof them children* At this meeting an effort io going to b© mad© to\narouse soia© real interest* The state has had an vlS^OOOjOOO surplus,\nbut tit© governor has already allocated these funds* It i® not con¬\nsider©# practicable to approach the present Assembly. Th© folk®\nin Ciarlo^ton have worked hard because the Charleston allocation\nis th© moat vulnerable one* It is.too early to say’ whether they\nwill be successful or not. It is hoped that the Columbia group\nwill manage to arouse public support for a station in that area.\nNo action in ©%pect®& with the other two allocations,,\nVIRGINIA: Carroll B. Lusk, Virginia Museum of Via© Arts.\nIFhsrJTo &r© no educational stations in Virginias Th© University of\nVirginia operates a carrier currant station 18 hours a day. This\nis claimed to be the world’s largest carrier current station,\n(Alabama: please note). The station has a yearly staff of on©\nhundred. Five courses in Radio aro offered by th© Department of\nSpeech. New quarters for radio and recording and apeoch were\nopened in January, 1953* The department now has three programs a\nKook on commercial stations, thro© more planned9 and has also\nplanned a tap© network©\nIn Arlington th© school system has programs thro© times a week on\ncommercial stations* The main objoet of these is pupil participa¬\ntion. They hav® been emphasising the use of handicapped students\nas a remedial procedure and have had remarkable success with\nstudents experiencing speech, hearing, and reading difficultlos»\nand also with mentally retarded students©\nT®1 ©vi si on : _ . . ., „\nlrh©F STTFTn educational television allocation to Charlott ®sville0\nbut th© University of Virginia has no fund© for such work, end au\nfar ae its new known, hae no plana* The Arlington school system\nput 6& hours of television programs on commercial stations last\nyear and is this year producing a series on alternate Saturday®©\n*>. series on school work has boon planned for th© spring* WKAL\nhas, however, reneged on the proffered time for hhi$ series. ^\n(All educational broadcast©rs, pleas© not®). Arlington will offer\nthi**\"©©rios to another station* They hav© a high — powored Speech"
}