{
  "id": "d813-46",
  "text": "- -2? -\nlevels of education.\nThat all reels b© labeled i*ith program titles and real sequence.\n* * * *\nThe report for Group III was presented by Mr. V/alt Whitaker. The\nfollowing recommendations woro made:\nPromotion of N*t.EB Tape Network Programs\nTh© need for a survey of promotion for tapes was discussed, both\non the lo®al lsvol and from NAEB. 1) Information; 3) Mailing\npi0co; 3) Gimmicks. It was emphasized that promotional materials\nar© needed in advance.\nRecording and E T{S_(Program and Product ion Aid)\nTn© need for gone contraliziag agency (NAEB) furnishing informa¬\ntion on available materials of this ©ort was brought up. Some\nschools do not have a sufficient number of records and ET*S for\ntheir uao. It was recommended that MASS compile Information that\nwould be useful for the member stations in writing away for ET*3\nand for transcription services. Also, that NAEB contact record¬\ning companies for the purpose of arranging free distribution of\nrecords or for buying th© records at a reduced raio* It was\nmentioned that no help has come from either the recording company\nor the distributor when those companies were approached by most\nindividual stations.\nPublish a list of companies which in turn publish the timing of\nmusic o\nAcceptance Committee (Uniformlty of Materials)\nRevise the rules and standards on the programs in regard to the\ntiming of the programs under consideration for distribution.\nEliminato excessively long talk programs. Conform to radio timing\nFarm out program ideas to the regional members, for NAEB coverage\nwith or without budget assistance - or the individual members for\nproduction in fields in which certain schools excel. One of\nthe chief purposes being to avoid duplication in production.\nNf»EB and the Chicago Center\nThe unanimous feeling about this matter was that NAEB should\nnot be subordinated to the Center inasmuch as the years of work\nwould be in Jeopardy, that the former organization should control\nthe selection and distribution aspects of the programs to\neducational stations.\nUp-Grading Personnel for Radio and TV (Encourage students)\nA broad knowledge of th© field should b© required as well as\nspecific knowledge. The pay scale should be as high as it can\ngo to fit the local picture. NAEB should help survey th© Hold"
}