{
  "id": "d813-56",
  "text": "FOREWARD\nIt is sometimes difficult at the moment of an experience to express the deep¬\nest feelings and convictions of a group. It is certainly temeritous to\nattempt it after the moment, when the group has dispersed. But on the basis\nof fragments of conversation in work sessions and at lunches, in conferences\nand in moments of relaxation, and from some hints contained in letters re¬\nceived after the conference was over, I should like to attempt the improbable.\nThe work we do, year-in, year-out, in Radio-Television education, despite its\npublic nature is essentially lonely work, because in Region II, certainly, it\nis pioneer work. At its best, it is pioneering work everywhere, and this con¬\ncept of our work as pioneers holds significance for the meeting which we have\njust concluded. The word ’pioneer* connotes more than the opener of frontiers;\nit connotes the hospitable house, the helping hand, and, yes, the understanding\nheart. It connotes, even for us in civilized, settled Twentieth Century America,\nbanding together for the common cause. We in the Southeast have a particular\naffinity with the frontier and with Causes, Lost - and Won. In coming together\nin our common cause, we did these things:\nWe learned to know and respect that hospitable house, our own house, the NAEB\n- thanks largely to the always lucid, often brilliant, talks of Ausmus,\nSchooley, Miles, and Siegel.\nWe offered to each other, gropingly perhaps, but eagerly, the helping hand -\n’exchange’ was the watchword of every discussion session.\nWe saw with new understanding the cause in which hearts and hands and minds are\nenlisted - to make these miraculous media serve the purpose a great Region II\nwriter has expressed:\nTo every man his chance, to every man,\nregardless of his birth, his shining,\ngolden opportunity - to work, to be\nhimself, and to become whatever thing\nhis manhood and his vision can combine\nto make him.\nThis, seeker, is the promise of America.\n.... Thomas Wolfe,\nUniversity of North Carolina, ’05"
}