{
  "id": "d813-75",
  "text": "-17-\nchannals, and it has been recommended that approximately two additional channels\nfor educational use be sought in order to provide adequate coverage of the entire\nstate.\nNORTH CAROLINA? John Young, WUNC, Communication Center,\nUniversity of North Carolina\nRadio\nThere are 3 active educational radio stations in North Carolina; 2 operated by\n• school systems - WHPS, a 10-watt FM station in High Point, and WGPS, a 10-watt\nFM station in Greensboro. Both of these do in-school broadcasts. In addition,\nWGPS does 1-1-J- hours of programming each day which is rebroadcast by WFMY, a\npowerful commercial station (FM) in Greensboro. WUNC, the University’s FM sta¬\ntion operating- at an e.r.p. of 1450 watts, is on the air from 3 to 3^ hours a\nday, 7 days a week. WUNC is operated as one of the projects of the Communication\nCenter which has as its goal the extension of the University to all the people\nthrough all the mass media of communication. WUNC, therefore, has - in theory\nat least - no permanent staff and no budget. In practice, one staff member of\nthe Communication Center devotes approximately two-thirds of his time to the\nstation, and the student engineer is paid; all the rest of the help is volun¬\ntary. WUNC has made a considerable effort in the area of foreign-originated\nprograms. The Communication Center’s additional radio activities include pro¬\nducing special program series for other agencies. One series underway at the\nUniversity is, AMERICAN ADVENTURE, being produced under a grant from the NAEB-\nFAE. A number of Communication Center series are carried on commercial sta¬\ntions either by tape or FM network, North Carolina being extremely fortunate\nin the great number of active FM stations in the state.\nTelevision\nThe first activity in educational television in the State of North Carolina\nwas the Consolidated University’s conference last June, drawing together 150\ndeans and administrators from the three campuses. After two days of study, upon\nthe advice of the conferees, the University formed £ Television Advisory Council,\ndirected the writing of a 115-page volume on theory, costs, and adminstration\nof educational television in the University, and recommended the jppointment\nof a State Television Commission. Governor Umstead has appointed such a Com¬\nmission, and Earl Wynn has been appointed its Executive Secretary. Local com- 1\nmittees have been formed in each of the eight communities to which allocations\nwere made, and there have been a number of meetings, state-wide and community—\nwide, in an effort to get the best possible plan. It might be said that ”every-\none has met everyone else.” President Gray has made the point that the Univer¬\nsity will activiate no more than one channel, Channel 4, in Chapel Hill. ' The\nother 7 allocations are the problem of the rest of the state. If the University\ndoes activate Channel 4, it will be a completely educational, non-commercial\nventure. There will be studios on all three campuses. The state’s position is\nthat it will engage in enough activity to demonstrate intent and thus reserve the\nother channels. Several communities, however, may go ahead on their own on a\nsmall scale. No money has been requested from the legislature for the next two\nyears except for study purposes. The University is seeking private funds to\nactivate Channel 4*\nSOUTH CAROLINA: Ernest Lent, WUSC, University of South Carolina\nRadio\nWUSC is the only educational radio station in South Carolina. The project was\n^ conceived 13 years ago and has now been on the air 9 weeks. This is a 10-watt\nstation, programming 37 hours a week. WUSC carried 4 NAEB shows in the morning"
}