{
  "id": "d1005-122",
  "text": "TO: Members of the HAEB Research Ctanittee®\nFrom: Sam L0 Becker\nBate: April 24, 1958\nSubject: Meeting of the KARR Research Committee at the (Kilo State\nInstitute, May 12-15«\nFirst of all, X am sorry to say that I will not be able to attend\nthe Institute o There are so many items of business which demand the\nattention of the Research Qm®it tee, however, that it seems to me\nImperative that those mashers who are in attendance meet in order to\ndiscuss the issues involved. Bhfortunately, there is no money avail¬\nable to pay the expenses of cosmittee members to attend the Institute\nHowever 3 If enough members are already attending to make a meeting\npossible and if it is impossible for this meeting to be held during\nthe formal period of the Institute so that meshers must come a day\nearly or stay a day after the Institute ends, hotel and meals can be\npayed for this one day. As I understand it, funds are not even avail¬\nable at this time for the expenses of Board members in general, who\nwill also be meeting. 1 would like to know if you are planning to\nattend and if you believe that it will be possible for you to meet\nwith the committee during the regular period of the Institute or\nwhether you believe it will be necessary to remain and meet the day\nfollowing the Institute.\nWe do not yet know how much money there will be for research\nactivities next year. The extent of such activities depends on the\nsuccess of Faulu, Skornia, and the others who are working on this\nproblem. We know that we will have $2,000.00 for sure — possibly\nfar more. I believe that w© need to plan for any eventuality. There¬\nfore, I think that these are subjects which need discussion and your\nideas:\n1. If we have just $2,000.00, how can this be spent most profitably?\na) Should we continue the Grants-In-aid? If so,\n(1) Should we redefine their purpose?\n(2) Should we be more specific in the announcement about the\nsorts of expenses to be paid? The kind of research in which\nwe are interested? The kind of research in which we are not\ninterested? For example, you might think it desirable in a\nparticular two or three year period to try to encourage a\nseries of studies on the ©pinion leaders and educational\nbroadcasting. (Washington as you recall, is doing one similar\nto this.) This might be a partial answer to our need for a\nbetter measure of educational broadcasting intact."
}