{
  "id": "d1005-132",
  "text": "April 11, 195S*\nDr* Burton Paulu\nDirector of Bedlo and Television\nUniversity of Minnesota\nMinneapolis 14, Minnesota\nDear Burton:\nWith the Columbus meeting coming up, 1 would like to pull to*\ngather an agenda for the consideration of the research committee *-\neven though 1 will not be able to make it to the meeting this year*\nThere are a number of issues which need to be discussed and settled,\nif possible* Most of these are dependent, in part, upon the financial\nsituation for the coming years* Is the probability of an increase in\nresearch funds known yet? It seems to me that the committee will be\nunable Intelligently to discuss any plans unless they know whether\nthey are talking about $500.00 worth of plans, $5,000*00 worth,\n$50,000.00 worth, or $500,000.00 worth*\ntee of the members of the research committee has raised the\nquestion of whether this committee should worry about men who are\npossibilities for director of research for the KAEB. It would seem\nto me to be futile for anyone to worry about such a thing until we\nknow whether there is to be money for this position* 1 would think\nthat we should not ask people to waste time on problems which may\nnever develop*\nOne real problem that the committee needs to worry about is a\nbetter definition of the goals of the grants-in-aid program and the\ncriteria for election of recipients of such grants* This would help\nnot only the selection committee but those who want to request such\ngrants* 1 believe that one of the reasons we have not received more\nhigh quality proposals is that our announcements have been too vague.\nI also think it would be helpful if we could get the announcement out\nthree or four months before requests are due* For exaaple, if we\ncould get the announcement out by the end of September and requests\nwere due the mad of December, researchers would hsve time to develop\nadequate proposals* This would give them time to investigate the\nrelated research, to formulate good hypotheses and sound research\ndesigns* Most of the studies which have been financed up to this\npoint hsve not been based on any sort of hypotheses or, even more\nimportant, theory* Consequently, they have little but historical\nvalue* They contribute little to our real understanding of how to"
}