{
  "id": "d1005-30",
  "text": "Mr. Kenneth Harwood, Chairman\nJanuary 16, 1938\nPage 3\nI am also bothered by her last paragraph on the last page. It sounds\nas though the NASH research money will be used for \"publicity\" for\nthe series and a number of other things. X am not sure that this Is\njustifiable. X also do not see why we should pay this girl a salary\nto work on her master's thesis nor the travel expenses for performers\non the television programs. Perhaps we could pay for the Purdue tests\nand materials for testing — not for 'Hiscussioa.* 6100.00 maximum.\nCollage of St, Thomas comas In a poor last. The hypothesis, as\nstated. Is not testable. As a matter of fact. It Is meaningless with¬\nout a specific criterion — or operational definition of \"successfully,\"\nwhich is not given. WO never do find out what they plan to measure ~\nwhat kind of data they plan to obtain. If they can coma up with a\ntestable hypothesis and operations by which it can be tested, the\nquestion Itself is Interesting. X could see giving them $230.00 if\nthey did the above and agreed to gather at least a good portion of\ntheir data by depth or focused Interviews. Do not think you can get\nmuch on a subject of this sort by questionnaire*.\nAll of ay comments, as 1 look back at what X have said, sound\npretty presumptuous. 1 do not know how far we can go In suggesting\nimprovements In research designs, nils is rather delicate, (hi the\nother hand, if properly put, X do not know why suggestions cannot be\nmade — especially if the suggestions come with greenbacks to soften\nthe blow.\nX hope that the above Is helpful. As soon as X received these\nproposals, X realised that X gave you a devil of a job. X ms sure\nthat you will act wisely. Let me say also that after all the returns\nare in, it seems to me that you should feel free to use your discretion\nin the interpretation of the results and the action which you take.\nAs in most such matters, at one point, some one person must simply\nmake some decisions. X think you can do it wisely — using our sug¬\ngestions as suggestions, rather then as a strait-jacket.\nBy the way, X asked Harry Skornia to have Percy Tannenbaum look\nthese over also and give his reactions, which you should receive.\nTheir offices are just across the hall and X felt this would give one\nadditional judge — to make your life more complex.\nSincerely,\nSam L. Becker\nSLB:mw Director, Division of\ncc: Dr. Hurry Skornia Television-Radio-Film"
}