{
  "id": "d8-10",
  "text": "-6~\nare exceedingly important in attracting readers to articles.\nOrdinarily titles should not he mere labels, nor should they he so\ngeneral that they could be used over another article as well.\nThey should he related to the content of the article, should be\nshort (five or six words), and should be complete sentences or\nprovocative phrases.\nMajor articles should carry subtitles of about two lines* Such\nsubtitles perform several important functions. They can arouse\nthe reader*s interest in the article, they can amplify the title by\nfurnishing further clues as to the content of the article, they\ncon leave an impression on the person who merely flips the pages,\nand they afford an additional element in page layout.\n7. Subheads. Subheads such as those used in the issues of\nFovember and December, 1956, should be continued. They sustain reader\ninterest in the articles; they relieve the monotonous grayness\nof the pages.\n8. Periodicity. After weighing the various alternatives, we\nrecommend that the magazine be published eight times a year —\nOctober- through May.\n9. Inventory* To achieve a desirable balance of content\nin each issue and from issue to issue, the editor needs a good\nbacklog of manuscripts. Mo magazine can depend on unsolicited\nmanuscripts. The editorial board and officers of the MAKE can be\nhelpful in scouting manuscripts, but in soliciting articles they\nshould make no commitments as to when the copy will appear In the\npublication; this decision must be made by the editor.\n10. The Editor*p Responsibilities and Duties. Mo magazine can\nfunction effectively without editors whose duties and responsi¬\nbilities are clearly defined. As the history of magazines in¬\ndicates, no magazine for long can be stronger than its editors.\nThere are two aspects to the editorship of the magazine.\n1. The editor-in-chief ie responsible for what goes\ninto the magazine. He provides harmony within each issue and\ncontinuity from issue to issue; thus he establishes the editorial\npersonality and policy of the magazine. He can do much for the\nlong-term benefit of the magazine and association distinct from\nthe printed page; for example, he can build goodwill through\ncorrespondence and through personal appearances at conventions, etc.\nSince he is responsible for the basic policy of the magazine, he\nshould have a grasp of educational broadcasting, its problems and\npersonnel. He need not be well versed in the techniques of magazine\nproduction. To do his job as he should, the editor-in-chief should\nhave a good deal of autonomy. The editorial board should decide\nupon broad matters of policy, and the editbr Should be free to get\nthe advice of the editorial board whenever he think's he needs it."
}