{
  "id": "d8-103",
  "text": "MEB RgADQOARTERS\n.1346 ConnecMilchit' kvenue, N.W.\n■tfeSaS5&TritT6i'>DoC.\nSFP P7\nTO; All NAEB Committee Chairmen\nFROM; Harold E. ;<•c\n^ '' UNfUERSITYOf'iLlinciF\nBE; Committee Reports at Convention\nDATE: September 25, 19^1\nAs has been the custom in the past, all committee chairmen are invited to present reports of\ntheir committee activities during the business sessions of the convention.\ntthile it is not essential that a report be presented by each and every chairmen, it would be\nnice to have such a report, however brief. If you, as chairman, are unable to attend the\nconvention, perhaps you could designate another member on your committee to present a report,\nand so inform said committee member.\nIf you care to present a report, we would appreciate your holding it to not aore than 10\nminutes. We would appreciate, too, your preparing your report in written fora so that we\nmay have it for the complete record of the convention and for the official f^.ies of the\nAssociation. This written report might well be only a page or two, and you could then use\nthis as a basis for expanded oral remarks.\nIf you would care to have your report duplicated for distribution at the convention, this\nwould be fine* and I would estimate that about 200-250 copies should be run off. Vtoile it is\nhoped that chairmen desiring to distribute their reports can have them duplicated and bring\nthem to the convention, we will try to duplicate for you any reports sent in by October 9*\nIf you follow the latter procedure, perhaps you can prepare the report on ditto master and\nsend it to us in that form so that all we have to do is run it off.\nFor all reports to be duplicated, may I suggest the format Indicated below? Such uniformity\nwill give a better appearance to the reports.\nCommittee reports will be started at the first business session which wf.ll be held Monday\nafternoon, October 23, Those not presented at the time will be presented at the final business\nsession on Thursday morning, October 26.\nmu you please let me know by October 4 the answers to the following;\n1- Do you plan to present a report?\n2- Approximately how long will it be?\n3- Will it be duplicated by you for distribution?\n4- mil you want us to duplicate it for distribution?\nNATIOML ASSOCIATION OF EDUCATIONAL BROADCASTERS\nReport of the xxxxxxxxxxxxxx Committee\nPresented at the NAEB 37th Annual Convention\nOctober 23 - 26, 1961, Washington, i>.C,\nmlm\n9/25/61"
}