{
  "id": "d8-109",
  "text": "University of Minnesota\nMinneapolis 14\nOFFICE OF THE PRESIDENT\nOctober 16, 1961\nMr. Frank E. Schooley\nUniversity of Illinois\nUrbana, Illinois\nDear Frank:\nThanks for a copy of your agenda (October 13, 196l) covering the meeting\nof the NAEB Publications Committee on October 23, 1961 in Washington, D. C.\nMay I comment on the items in the order in which they have been placed in\nyour memorandum:\n1. I enthusiastically endorse your idea of a thumbnail picture and\nsketch of each author, preferably at the beginning of the article (at least\nthe picture should be there). The sketch, as is frequently done, might appear\nin a section entitled ”0ur Authors” or language of that nature. At any rate\nthe photo and sketch are both ”musts.”\n2* I have been unable to locate ”the letter from the Ampex person.” Was\nit in Educational Radio-TV? Or was it in a previous issue of' NAEB Journal?\nIf so, which one?\n3* Perhaps all of us are reluctant to indicate our reactions to the long\nand boring splurge about the Washington office. Whatever criticisms we make\nabout ”Soap Serials” (and they seem amply justified) could be made of this\ntrivia. Public relations people have long since established the fact that\nresults, rather than words, are the basis upon which an educational project\n(as distinguished from a commercial product or service) should be presented\nto its clientele. This principle applies whether the efforts are made in\nbehalf of a public school, a university, or an educational broadcasting organiza¬\ntion. If the Washington office is doing a good job (and all of us trust that\nit is) the members will find out soon enough. The question that arose in my\nmind as I read the article was this: Why not a listing of the specific services\nthe office had rendered to the members during its first year* Perhaps there\nmight have been a tabulation of the number of letters written and received,\nnumber of telegrams sent and received, number of office calls, number of public\naddresses made by staff, number of staff articles in professional publications,\nnumber of ETV stations given assistance in applications to FCC, etc. These\nand similar activities seem to me to be the reasons for the office and the extent\nto which these sorts of things are done in a competent and successful manner\nis the only true measure of the office and its staff.\nU» It may be difficult (and almost impossible) to secure a balance in the\narticles as between television and radio but there are some outstanding people\nwho have much to say about radio and are using it effectively even though some\nappear to think that TV is the only medium worth attention today (a position with\nwhich I happen not to agree)."
}