{
  "id": "d8-114",
  "text": "To: NAEB Publications Committee\nWalter finery .A <^A\"/\nPhilip Lewis\nTracy Tyler/\n‘' Pat Hazard\n^Howard Martin\nArt Weld*\nLeo Martin4\nElmar Sulser u\nBernarr Cooper •\nProm: rank S. Schooley, Chairman\nRe: Committee meeting at Convention\nWe Shall meet around a breakfast table at the Marriott Motor\nHotel on Monday morning* October 23. The hour will be approximately\n8 o'clock* although 1 know some will be handicapped by early hour,\neither through loss of sleep or train travel.\nWhen 1 prepare meeting agenda* I frequently note that Item*\nare not necessarily In order. So it la here. However, to give us\nall a similar starting bases. I'll list some items suggested or\ncomments made:\n— i believe the editing would be enhanced if a thumbnail\npicture and sketch of each author appeared at the first\nof each artiCXSTX for one would like to know a little\n. /more about who the various people contributing the\n* articles are (Obviously, regarding Educational Radio-TV,\nOctober, 1961.)\nI doubt the ethics of Ineluding the letter Aram the Aapex\nperson. This is patently promotion for Ampex, and by\nrights we should Include similar loose letters from every\nother supplier.\n— While I hate to eay this and will probably get no where\nwith this comment, I thought that the report by Harley was\ngreatly below the dignity of a magazine of the type we\nwant our publication to be* In fact, the whole tone of\nthe article reverted to the informal trivia of years back\nthat I thought we had been successful In eliminating. If\nthe article had confined Itself to a short statement of\nthe faeta that NAEB members should know, I would have no\nobjections. I had a feeling in reading the article that\nBill was on the defensive and trying (a) to Justify a\nplush layout, and (b) to let us know how hard the staff\nwas working.\n~ Content-wise, X got the Impression that the publication\nwas off-balance, with too many of the articles dealing\nwith educational television and very little attention\npaid to radio; but X can understand the problems of an\neditor in the matter of material solicitation, so X\ndoubt If anyone should be blamed for this."
}