{
  "id": "d8-166",
  "text": "MICHIGAN STATE UNIVERSITY east lansing\n^ v> 4b\nCOLLEGE OF COMMUNICATION ARTS • DIVISION OF MASS COMMUNICATIONS • DEPARTMENT OF TELEVISION AND RADIO\nPublications Committee Journal Study\nSTANDARDS FOR EVALUATION\nTYPE A - These articles should reflect work done in the highest\nscholarly tradition. Primarily, they ought to deal with\nrecent research, new facts and ideas that can be related\nto the interests of all members of the NAEB rather than\nto groups with special needs or desires. Occasionally\nthis publication should include an article which,\nalthough not the result of significant recent research,\nnevertheless presents basic ideas in a creatively new,\ndynamic.^ and challenging manner. I am thinking particularly\nof an article like Colby Lewis’s classic, \"Force in\nCamerawork.\" Included also in this publication would\nbe papers dealing with the rapidly expanding world of\nInternational Broadcasting. Perhaps the significant\ntest of an article appearing In this publication would\nbe its acceptance as a \"primary source\" in later research,\nits use in the classroom and society as well.\nTYPE B - A publication like the HAEB Newsletter should contain,\nin addition to articles and notes now present, the\nfollowing types of information:\n1. Cerent developments in Educational Television\non a National scope; for example, Newton Minow*s\naddress to the NAEB Convention.\n2. Notes on the current activities and reorganization\nplans of the NAEB itself. Thus any internal\ndevelopments will be reported In this monthly\ncommunications source.\n3. Brief descriptions of new products recently\nintroduced to the growing Educational Television\nmarket.\nTYPE C - I agree with those who advocate a new \"how-to-do-it\"\nmagazine devoted exclusively to the many reports on\ncurrent techniques in televised Instruction and the\nnewly-found uses of broadcasting. Articles should be\nboth descriptive and didactic in nature, containing\nthe perrennial audience analyses, testimonials, words\nof wisdom, and exhortations to greatness."
}