{
  "id": "d8-174",
  "text": "I’ve contacted several others, bat haven’t heard from them yet.\nJuly-August - Plan an ”international” issue.\nHave on hand an article, \"Teaching by Television in Italy.” by Dr.\nFrank lezzi, new at Hofstra College ; two by F.B. Rainsberry, CBC;\nand permission to reprint from several publications short articles\nwhich may be of interest.\nPromises: Ilarjorie Lundin on Radio Sweden; an article on Netherlands\nbroadcasting; and I hope one on Latin-Arae rican broadcasting, with accent\non educational; and something from Paulu on British broadcasting.\nI’ve written to IJilbur Schramm re the UNESCO mass communications meeting\nin Bangkok; a gentleman who recently returned to this country from\nVenezuela where he was active in the W industry; the producer for All-\nIndia Radio, who is planning an Indian version of \"Sunrise Semester”;\nthe director of the international broadcasting dept* of the Japan Broad¬\ncasting Corporation, for an article on etv after one year (The 1st\nanniversary was in January sometime); the director of E.B.U.; and the\ndirector, radio, of the republic of Korea. So far I haven’t heard\nfrom any of these.\nSome other articles I have promises for are: (I won’t list all the people I’ve\nwritten to but haven’t yet gotten\nnibbles.)\n1. Dr. C. Walter Stone on summary of accomplishments under Title VH.\n2. Art Hungerford on META’e demise.\n3. Representative William Avery on his recent bill on etv.\n!u Dage T7 on their mobile modular system illustrating how it would be useful\nfor etv applications. (I’ve written the other Industrial Associates, but\nhave no definite promises yet.\n5>« Leo Geier on Johns Hopkins Television, celebrating its 12th anniversary now.\n6. Dr. Albury Caste 11, Chairman, Dept, of Philosophy, University of Oregon.\n?• Dr. Edgar Dale.\n8. Gilbert Seldes.\n9. Don Buell, Michigan State University, on the theme, \"TV has not destroyed the\ntheater.”\n10. Marlowe Froke, Journalism Dept. , University of Pennsylvania,\nand quite a few others.\nI would appreciate any comments, additions, deletions, etc., you would recommend*\nI’m taking all this space to list everything, because I want you to know generally"
}