{
  "id": "d8-183",
  "text": "page 2\nk) While strongly endorsing the Yearbook concept, the Committee unanimously\nrejected the proposal to use the Jamiaiy-february issue of the NAEB Journal for\nthat purpose.\nWith the diversification of interests and the tremendous growth in total\nmembership, the current six issues may soon be Inadequate*\nThe Committee recommended that the proposed Yearbook be financed by (a) the\nbudgets from miscellaneous NAEB annual publications aRcT(b) income from advertising\nin the Yearbook,\n5) The Committee unanimously approved a motion to increase the subscription\nrate from $iuOG to $6,00 a year,\n6) The Committee approved the publication of the Inschool Broadcaster\nnewsletter by the Radio Network School Committee,\nFollowing publication of Vol, I, No, 1, October, 1963, James Fellows stated?\n,,,,,it has suddenly occurred to me that with all good intentions,\nthe Radio Network School Committee may be undertaking a project which\nshould have cleared with the Publications Conmittee, or certainly with\nyou as overall Publications Editor, The Newsletter itself, which we\nwould like to have as an occasional publication developed by the Radio\nNetwork School Committee, explains the function that we have in mind\nand the method far getting information,\nI would kind of like to have your reaction before we pursue\nthis any further, and I am sorry that I didn’t think to check with\nyou on this sooner.\nReacting favorably to fellows* inquiry, the Publications Committee, however,\nrecommended that original copies of each issue of the Inschool Broadcaster (or\nany other special interest newsletter) be forwarded to tlie Publications Editor•\n7) The Committee unanimously approved the following statement of the\ndivision of publications responsibility*\na) Broad general policy (what publications there should be, how\n”r often each aioula appear, budgetary limitations, advertising\npolicy, staff appointments, other considerations regarding\nthe place of publications in the over-all NAEB picture) •\nShould be decided by Board or Officers, on advice of Publications\nComaiDEtee and s^afT.\nb) Execution of general policy (which should be clearly defined\nand to\"iiX5l^e iong«iem plans, general content, general format,\ngeneral tone of each individual publication).\nShould be responsibility of the edltar-dCHChief of each publication,\nlie may delegate ihe responsiEHiEy to\"oHSer editors iff he sees &i»\nlie can also seeklielp iroin ihe lSibl3!cations Ccramiitae, *\""
}