{
  "id": "d8-26",
  "text": "February 19, 1958\nTracy F. Tyler\nRev. Fr. R. F. Grady, S.J.\nEdward Stasheff\nLady and Gentlemen:\nIn lieu of a meeting, I'm writing a f<?w thoughts on the work\nof the Publications Committee, for your reactions and your help.\nFrankly, I’ve been unhappy about last couple Issues of the\nJournal. They should have been better.\nOn the other hand, I think we have strengthened with the\nStasheff-Willls-Tincher series, which we’ll republloh as handbook in\nJune. I believe the Fact Sheets will add stature to the magazine.\nThere'll be eight in each of the next two issues.\nWe’ve been short on some good articles. And shcrt on pictures.\nI think this is especially true as regards radio. I've cried, and\nI’ve failed to secure help from a couple of areas. I’ll l<sep trying.\nEd Stasheff has suggestion for Inclusion of Technical. Tips.\nThis feature might also add to service of the Journal. I’ll .’rite\nEd on this topic.\nNow some thoughts about the future, for your reactions, tco0\nThe February Issue, at printer, will be on NAEB. I think it\nwill be useful, but I also have in mind, perhaps the first edition\nnext fall, an issue that will give an overfall picture of educational\nbroadcasting. Maybe it should induce closed-circuit TV, too?\nMy idea is to Include two or three maps, perhaps one showing ETV\nstation coverage, another radio ed coverage in the US. Any ideas,\nwelcome.\nL\nftLAF.R PTIRI.TCAT.inHS.COMMITTK\nWilliam Bender\nMrs. Gertrude Broderick\nFranklin Dunham\nElmer G. Sulzer\nJTEEJ\nI think we should strengthen the Journal with more book\nreviews. Father Grady has offered to help with books• How about\neach member of the committee offering to serve as a reviewer, or\nprovide us with the name of a person who will review books for the\nJournal when asked? How about it?\nHow to increase Journal circulation 1b another problem.\nI’m not unmindful of some problems with the NAEB NEWSLETTER,\nbut operationally it doesn’t bother me as much. Headquarters staff\nagrees with belief in tighter editing, but there’ll be editorial\nchange there shortly, so Immediate future poses a different type of\nproblem.\nOne other Journal Idea, we’ve aimed at articles In length\nbetween 1200 and lj?60, Unless you object, I’m raising the maximum\nto 2000. I think this will increase chances of getting some better\narticles.\nHelp.\nAny suggestions, any articles.\nHelp. Help.\nany pictures will help.\nrank E• Schooley\nChairman"
}