{
  "id": "d8-31",
  "text": "GENERAL DIRECTIONS\nArrangement of Information\n1. First, group your rate-card information\nunder the sections shown on the sample\ncards.\nInclude each of the sections. Keep the\nsame order, and do not combine or omit\nsections.\n2. Repeat information, if necessary, in dif¬\nferent sections; or give a cross-reference to\nthe item number where the information is\nfirst stated.\n3. Describe each item clearly. For example,\nunder 13 (d), print “Depth of column\n12% inches,” rather than “12% inches.”\nSpecifications for Printing\n4. The card should measure 6x3% inches to\nfacilitate filing.\n5. 120 pound Bristol Board is recommended.\n6. Use black ink and at least 6 point type for\nclarity and readability.\n7. Arrange information in two columns read¬\ning from the top to the bottom of the\ncard. Or, if you prefer, in two columns\nwithin horizontal rules.\n8. The rate card may be single or multiple\npaged. (See model cards).\nIn printing a double card, leave a strip of\nblank space on the reverse side where the\nfold occurs. The fold should occur at the\nbottom of the card.\nPrint card so that it “tumbles” — that is,\nwhen it is turned over, top to bottom, the\nreading is continuous.\nIndex Line at Top of Card\n9. Center the publication name on the index\nline. Logotype of name may be used; also,\ninsignia of media associations and audit¬\ning organizations.\n10. At the far left, show the frequency of issue,\nname of publishing company, the address\nand the telephone number of the publica¬\ntion.\nNumbering of Rate Cards\n11. In the upper right corner, show the num¬\nber, the issue date and the effective date\nof the rate card.\n12. Number successive rate cards consecu¬\ntively. A card showing a change in only\none or two items, however, may be indi¬\ncated by using the number of the last rate\ncard plus a letter suffix (for example: Sa).\nWhen this scheme is used, each whole num¬\nber will represent a rate card substantially\ndifferent from the previous card."
}