{
  "id": "d8-38",
  "text": "NAEB Headquarters\n14 Gregory Kali\nUrbana,Illinois\nMEMO\nTo: NAEB Publications Committee (Frank Schooley, Gertrude Broderick, Philip Lewis,\nEd Stasheff, Elmer Sulzer, Tracy l^rler)\nFrom: Betty MCKenzie\nDate: August 27, 1959\nAs I understand them, these are the decisions reached at the meeting on August 24* If\nanyone understood otherwise, please let me know*\nJOURNAL - There will be issues in October, November, December, 1959* Beginning in I960\nthere will be six issues per year, published on alternate months: January,\nMarch, May, July, September, November*\nWhen possible, there will be a photo on the cover* Contents on back cover*\nBeginning in I960, fact sheets will be on colored paper* (The fact sheet brings\nto mind a problem in stitching - the fact sheets would not be easily removable\nfor filing if Journal is other than saddle-stitched, to which some of you\nobjected at the meeting.)\nBeginning in I960, I will experiment with interior format - and wait for\nreactions*\nPublications Committee will help solicit articles, pictures, etc* (Please ask\nfor articles 1500 words or less, photos the author has or suggestions as to\nwhere photos might be obtained, plus biographical notes on author.)\nEDITORIAL BOARD - Sohooley and MCKenzie will get together and send to Committee a list\nof possible areas for representatives on Board* Coamaittee members will suggest\nnames*\nQUESTIONNAIRE - Schooley and MCKenzie will prepare a possible questionnaire to be\npresented at convention. Committee members to make suggestions and return\npronto so we can have prepared for convention.\nNEWSLETTER - No pictures.\nBasic Newsletter to be four pages - plus inserts for directory changes and\nplacement supplement.\nNews items to be up front. Will try to keep promotional stories to a minimum.\nPresident and executive director to be limited to back page on alternate months.\nIf this space is not filled by him, editor will use for rfore news items or\npromotional material.\nWin investigate further the possibilities of having printed offset - with two\ncolors on cover side."
}