{
  "id": "d8-48",
  "text": "Anal ysis^\ntion costs and income\nmlI\nNewsletter - The cost of printing the W for. the first seven months\ni960 averaged #99*26 per month. Average of four months of mailing\ncosts is 139*18. Thus, the average cost of printing and mailingCthv\nNL is $139*44 per month. In preparing the budget, th^s haj been\nrounded to #1*>0 per month, or $1800 for the 12 months.’ CJ ~\n\\\\ ?, ..\nJoy1 - The cost of printing the Journal for the firptf)four issues ffi\ni960 has averaged $1,289*85 per issue. This cost has risen sharply .\nthis year in line with the Publications committee's recommendatton that\nthe format be dressed up, more illustrations be used, and more articles\nbe included. This was felt essential and was also felt to be Justified'\nsince the Journal now appears only six times a yeaf, thus permitting\nmore money~io be spent on each issue. The mailing co^ts for the J6urr0i\nhave averaged $62.31 oer issue. Thus the total printing and m il ing\ncosts have averaged $1,352.16 per issue. This has been rounded to\n$1,400 per issue, or $8,400 per year. \" —\nIncome - In order more accurately to indicate actual cost of these\npub) leatione, we started in i960 to transfer from dues $2 per year\nfor each Journal and $2 for each Newsletter sent to members in all\ncategories. 'Thus, since Class A Actives receive three copies of each,\n$6 was transferred for the Journal and $6 for the Newsletter, and so\non.) Since the $2 has proved inequitable, in 1961 $3 wiI1 be transferred\nper Journal and $1.50 per Newsletter. In addition there are paid\nsubscriptions to each publications:. Since approximately 20% of the\nsubscriptions are handled through subscription agencies at agency dtsoounts\naveraging 25%f a 5% allowance for such discounts hat been subtracted\nfrom the subscription income. The Kellogg grant which provided for a\nfull-time editor nrnvideri fund*\nto the Journal to be sent to leading educators and administrators.\nThis current year $800 was transferred from the Publications (Editor)\naccount to the Journal account for these subscripticns (200 Cl the regular\nsubscription atxi rate of $4). We are limited by postal law a* to the *\nnumber of free copies we are allowed to distribute and still keep our\nsecond class permit’. As our membership continues to grow we twill be\nable to send out more free copies and thus transfer a little more to\nthe Journal account. Experience is showing that the per unti cost of\nthe Journal drops fairly rapidly as the number printed and mailed in¬\ncreases, \"so a moderate increase in memosrsnip will likexy rssuis --; n,npVT\nthe Journal being self-supporting, on the basis outlined above, by the\nmiddTe~6f 1961. *\nNewsletter: Subscriptions 82 V $5\n* Less est. agency discount\nTfd. from Membership dues\nTotal NL income\nJournal: Subscriptions 553 C $4\nLess est. agency discount\nTfd• from Membership dues\nTfd. for comp, subscriptions\nProm sale of reprints, ind. copies,\nTotal Journal income\nTotal expense (printing and mi a ling, only),\nTotal income, both publications\nAnnual operating deficit\nboth publications $10,200.00\n8,874.50"
}