{
  "id": "d8-86",
  "text": "iEPARTME\nRADIO BUILDING\n3 TELEVISION SERVICE\nNT OF RADIO AND TELEVISION\nINDIANA UNIVERSmM l£D\nBLOOMINGTON, INDIANA ' ^ ^Tl@V\nSfp 25 8 ;* ?\\a\nu ■*-' hii\nSeptember 2£, 1961\n& WIUC\nUNIVfftsirv *-\n-nsliY Qf iLL ,NCfc.\nMr. Frank Schooley\nDirector of Broadcasting\nGregory Hall\nUniversity of Illinois\nUrbana, Illinois\nDear Frank:\nI am enclosing an article by Jim Lynch for publication in a future issue\nof our magazine. I think the article is a good one, and if you feel like¬\nwise, you might forward it on to Betty.\nI would like to pass on to you a few comments on the issue of the magazine\nI have just received, and you can take these for what they are worth. I\nshould say at the outset that I thought the issue was well edited, and, as\na whole, exceedingly creditable. Now here are ray suggestions and criticisms:\n-I believe the editing would be enhanced if a thumbnail picture\nand sketch of each author appeared at the first of each article.\nI for one would like to know a little more about who the various\npeople contributing the articles are.\ndoubt the ethics of including the letter from the Ampex person.\nThis is patently promotion for Ampex, and by rights we should in¬\nclude similar loose letters from every other supplier.\no\nWhile I hate to say this and will probably get no where with this\ncomment, I thought that the report by Harley was greatly below\nthe dignity of a magazine of the type we want our publication to\nbe. In fact, the whole tone of the article reverted to the infor¬\nmal trivia of years back that I thought we had been successful\nin eliminating. If the article had confined itself to a short\nstatement of the facts that NAEB members should know, I would have\nno objections. I had a feeling in reading the article that Bill\nwas on the defensive and trying (a) to justify a plush layout, and\n(b) to let us know how hard the staff was working.\n__1^ Content-wise, I got the impression that the publication was off-\nbalance, with too many of the articles dealing with educational\ntelevision and very little attention paid to radio; but I can under¬\nstand the problems of an editor in the matter of material solici¬\ntation, so I doubt if anyone should be blamed for this."
}