{
  "id": "d8-92",
  "text": "JOURNALISM QUARTERLY SURVEY--2\n6. Following is a list of articles appearing in the Winter, 1961, edition of\nJournalism Quarterly. Please check, under the appropriate headings, the\nextent to which you have read in each of the articles listed.\nARTICLE\nTrends in Newspaper Ownership and Inter-Media Competition\nLoss in Country Weekly Newspapers Heavy in 1950s\nEffects of Cancer Scares: The Residue of News Impact\nThe Newspaper Reporter in a Suburban City\nCongress and the Standing Committee of Correspondents\nMark Twain as Journalist and Liberary Man: A Contrast\nEconomic Intervention: Prelude to Press Control\nAdditional Data on Variables Related to a Press Freedom\nReporting a Gold Rush\nResearch in Brief\nBook Reviews\nMagazine Bibliographies\nForeign Bibliography\nNews Notes\nAEJ 1960 Convention Minutes\nAEJ Groups* 1960 Financial Report\n7. How well does Journalism Quarterly keep its readers up to date on research in\nthe area of mass communications?\nVery well_ Quite well_ Fairly well_ No opinion_ Not very well_\nNot well at all_ It doesn't_\n8. Do you think there is a need for another publication, on the plane of Journalism\nQuarterly, in the area of mass communications?\nDefinitely_ Probably_ Possibly_ No Opinion_ Possibly not_\nProbably not_ Definitely not_\n9. Do you think Journalism Quarterly needs to publish more than four times a year?\nDefinitely_ Probably_ Possibly_ No Opinion_ Possibly not_\nProbably not_ Definitely not_\n10. a. Do you feel you can be as well informed on mass communications in general by\nreading Journalism Quarterly as by reading any other journal devoted to mass\ncommunications or a related area?\nDefinitely_ Probably_ Possibly_ About the Same_ Possibly not_\nProbably not_ Definitely not_\nb. What other scholarly journals, if any, are of most value to you? Please\nlist in order of relative value.\nRead All\nRead Part\nRead Tables\n>\n■a i\na) 5\nOS CO\nDidn't Read\nBut Intend To\nDon't Intend\nTo Read\n1.\n2.\n3.\n4.\n5.\n6."
}