{
  "id": "d1721-14",
  "text": "-15-\nThe exhibition is held annually in conjunction with the Institute* Awards of merit\nare presented to the exhibitors of the outstanding broadcasts for the purpose of\nstimulating the broadcasting of significant educational programso These awards. will\nbe announced April Ilia Award-winning programs will be available for listening in the\nInstitute audition rooms»\nThe recorded programs were entered by 193 individual exhibitors, 90 by commsrciaX\nstations .and networks, 62 by educational, institutions. and 1*1 by national and local\norganizationso The breakdown by program classification reveals that 66 are cultural\nbroadcasts, covering art* science, literature and music» Sixty -one deal with per-\n^onal and social problems, and 59 are public issue^programs* Fourth most popular\ncategory is that of none-time shows,** with 52 entrieso\nEvaluation of the radio entries is being handled by cooperative judging centers lo¬\ncated in various cities throughout the U* So All television shows ar© being graded by\na committee in Columns. Judging centers are headed by well-known, authorities in\nradio and television education*\nKUSD JTAKbS TO AIR WITH NEW FACILITIES\nIncreased power,, new transmitter equipment, a change of frequency, andlonger broad¬\ncasting dav ax'© a feature of the expansion program of the University of South Dakota\nradio station, This expansion, in the planning process for two years, took effect\nMarch 8, according to Keith Nighbert, station manager*\nStation power was increased from §00 to 1000 wattss and its frequency changed from 920\nto 690 kilocycleso The daily broadcast schedule was extended three hours daily, ex-\ncept Sunday.n to the period from 9?30 a0m0 to sunseto\nThe University purchased 25 acres of land a mile north of Vermillion on which to build\na new transmitter building to house the necessary expansion equipment* Two 280-foot\nsteel antenna-'3s were erected to beam a directional ray predominately east arid west of\nthe University city*\nDedication Ceremonies Held\nDedication ceremonies, a reception, and an open house were scheduled for March 8* Tne\nnewly-erected transmitter was the scene of dedicatory ceremonies at 9$30 a»m« on that\ndateo Governor Sigurd Anderson and members of the South Dakota board of regents mad©\nan appearance at this ceremony * About 300 guests from all over the state were ^ invited\nto the reception from 10-:;00 to 11s 00 a0m« on the third floor of the student union\nbuilding at the University* Open house was held at the ^station on the fourth floor of\nthe same union building during the afternoon for those interested in touring the\nstudios*\n* Special Children*s Feature Planned\nSpecial programs were directed to the children as part of the expansion ceremony., and\n' treats were given them at the March 8 open house. Children's programs broadcast on\nthe first day of expansion included: \"Candy Cans Lane.\" a program of music and pas¬\ntry, narrated by Allis Rise., director of the South Dakota School of the Air\"Three\nBilly Goats Gruffa musical drama presented to KUSD by the University of Minnesota;\nand \"Ginger Pie,\" a dramatic program from the Detroit public schools."
}