{
  "id": "d1721-17",
  "text": "-18-\nTV DEVELOPMENTS AT MICHIGAN STATS COLLEGE\nArmand Hunter, Director of Television Developments at Michigan State College (East\nLansing), writes to bring News-Letter readers up-to-date on developments there?\nnWe have received one large piece of new equipment—a perambulator booms and we ex¬\npect delivery on a video recorder (kinescope) sometime in February,,\n“Present plans call for recording a number of program series on kine for distribution\nto TV stations now broadcasting in the state 5 and for working out several graduate\nstudy projects for the M0A0 in Horticulture and Agricultural Engineering using the\nrecorder* In addition, we will record programs from a number of college departments\nand from state and local educational and public service agencies for evaluation and\nstudy in the development of future series and for statewide distribution* Other re¬\nsearch and utilization plans are in the formation stage; and I will let you know\nabout them as they materialize*\n“We are planning to do a closed-circuit program demonstration during Farmer*s Week\n(January 29-31) - a series of three programs in the fields of Horticulture, Agricul¬\ntural Engineering, and Poultry Husbandry, Programs will originate as remotes from\nthe large stage of the Auditorium Building, and be viewed as live productions, at the\nsame time they are observed as TV broadcasts on the closed-circuit over receivers set\nup throughout the auditorium and the audience. Another special closed-circuit broad¬\ncast is scheduled for origination in the studios and observation in the auditorium of\nthe Natural Science Building on February 27th, This one will be done for all college\nfaculty reviewo\n\"We continue to package the Saturday A*M. program for broadcast over WJBK-TV, Detroit,\nfor the Agriculture Extension Division; but will put it on kine as soon as possible,\nrather than take it “live** to Detroit, as is now the case. One or two additional\nspecial demonstrations and remotes will be set up for Spring,\"\nUNIVERSITY OF MICHIGAN GETS FM RELAY AS GIFT\nThe transmitter, tower, and all equipment of Station WAJL-FM in Flint, Michigan, have\nbeen presented to the University of Michigan, it is announced by Waldo Abbot, WUOM\nmanager and director of NAEB’s Region III. Station WAJL will be operated as a relay\nstation, thus improving the reception of University of Michigan programs in Flint and\nthe Saginaw Valley area* The tower of WAJL is located on the top of the Hurley\nHospital, the highest point in the area.\nThrough the use of this relay the fine music programs, all the University sports—\nfootball, basketball, and baseball and the educational programs presented by WUOM\nwill be available to all FM owners in the Flint area. WUQM-FM broadcasts on 91*7 meg,\nWAJL-FM has been broadcasting on 107.1 meg. with 1*00 watts ERP. The latter frequency\nmay be changed by the Federal Communications Commission.\nIt is anticipated that at frequent intervals University of Michigan Extension classes\npresented in the Flint area will be picked up for broadcasting, reports Abbot. The\noperation of WAJL by the University of Michigan will also permit additional local pub¬\nlic service programs and cooperation with the FM station of the Flint Public Schools.\nThe operation of Station WAJL by the University will start as soon as the approval of\ntransfer of license has been given by the Federal Communications Commission. The\nterms of the gift permit the University to move the equipment if it so wishes, and\nthus to make it the first relay station in a possible state-wide FM network."
}