{
  "id": "d1721-19",
  "text": "SIEGLVij 'r» -Ji-il'iiO WHO WOUiD ABQjuIbli WNYC\n\"Democracy will function only if its citizens have developed a reasoned judgment which\nmakes informed choices possible* WNYC is constantly translating government into terms\npeople can understand.\"\nThose statements were contained in a letter sent to Thomas J. Miley* Executive Vice\nPresident of the Commerce and Industry Association of New York, by Seymour N. Siegel*\nDirector of Radio Communications for the City of New York and head of WNYC * and made\npublic on February 11. This letter was in answer to the charges made by Miley on\nFebruary h that \"there is no justification for burdening our taxpayers with the cost\nof operating WNYC*\" and that the station should drop all of Its television film acti¬\nvities. Siegel* in his letter* noted that* as a business man* Mr. Miley knows \"that\ngovernment requires the latest technological developments to do an efficient job*\" and\nthat \"the management of any business would be short-sighted if it did not keep up with\nthe latest scientific and technicaldevelopments.\"\nHe then went on to point out that WNYC \"makes a distinct contribution to the culture\nof the people of this City by maintaining an adult* literate and mature standard of\nprogramming which is not otherwise available to our citizens.\"\nSiegel Gives Examples of City Station’s Services\nSiegel cited a number of specific examples of WNYC programming in the public Interest\nwith which Miley was \"apparently unfamiliar\"?\nThe station*s City Food Guide* he wrote, \"not only permits consumers to learn of food\nbargains in these days of high living costs, but makes a distinct contribution to the\nbusiness community when it eliminates gluts in the market places. The fact that no\ncommercial radio station is now carrying this service* even though when the Department\nof Markets inaugurated it many years ago it was scheduled on every radio station in\nthe City* underlines the fact that it is unfair to place the burden of such service\njust on the commercial radio station managements of this city.\"\nOn the subject of public health Siegel wrote? \"No radio station in America devotes\nas much time to the public health as does WNYC. The Academy of Medicine presents a\nspecial program* ’For Doctors Only*’ on the City Station which is designed to bring\nthe 33*000 physicians in this area up-to-date on the latest therapeutic advances in\nmedicine. No commercial station could afford to devote this amount of time for this\nimportant purpose.\"\nDefends TV Film Unit\nAnd as to Miley*s attack on the WNYC TV film unit the letter pointed out? \"Audio¬\nvisual aids are accepted devices in our educational system. The combination of sight\nand sound adds to the learning process of our citizens* both young and old. The pre¬\nparation of training films and the presentation of television programs by WNYC?s Tele¬\nvision Film Unit is done at infinitely lower cost than if such visual aids to an under¬\nstanding of government were made commercially.\"\nMr. Siegel also reminded Mr. Miley that \"insofar as the other commercial stations of\nthe City are concerned* only a week ago* when the Comptroller of this City addressed\nyour Commerce and Industry Association on the problems of City Finance* there was only\none radio station in the city which brought this particular discussion to our citizens.\nThat station was WNYC.\"\nMr. Siegel declared that WNYC has become an integral part of the City’s life and that\nNew Yorkers depend upon it for information and news* especially in times of disaster."
}