{
  "id": "d1721-20",
  "text": "-21-\nCost Should Be Borne By All\nHe pointed out that \"since everyone benefits, the cost should be borne by everyone,,\nWe would no more think of asking the New York Telephone Company to defray the cost of\nour telephone service, or the Western Union to give us telegraph service on a gratis\nbasis, than we would of asking commercial^radio stations to devote as much time to City\ngovernment as is necessary in the public inheresto\"\nIn conclusion, Mr. Siegel informed Hr. Miley that the mail received both at WNXC and in\nMayor Inpellitteri*s office \"has been in unanimous opposition to your stand®\nPIANO LESSONS BY RADIO OFFERED BY WUOM\nSince October 19 $1 the University of Michigan£s WUOM has presented a half-hour piano\nlesson by radio each week0 The teacher is James Lo Buckborough, Supervisor of Music\nin the Highland Park (Michigan) schools® Listeners registered for the course in ad¬\nvance and each one received a specially prepared book to be used m conjunction with\nthe radio lessons®\nDesigned primarily for adult students of the piano, the course proved so^successful\nthat it was being repeated with new material in February. About 1*50 listeners parti¬\ncipated in the piano lesson program during the fall semester. Many of these are\ntaking the new series as review. The new series is being taught by Mr. Buckborough\nagain with the added feature that Waldo Abbot, director of WUOM, was acting as a piano\nstudent in the studio with the instructor to serve as a guide and con.ro! for „h.\nlessons®\nAbbot On-the-Air-Piano Student\nAs a promotion piece Abbot distributed the following letter over his signature for\ndistribution to prospective listenersg\n\"Dear Piano Student?\n\"I have always wanted to play the piano, just enough for relaxation. I don t\nknow one note from another, I have never touched a key, but I do have a sincere\ndesire to learn. Mr. Buckborough says he can teach me the fundamentals if I\ncooperate. So I am going to start taking the WUOM piano lessons on Wednesdays\nat *??!!? pom®\n\"Mr,, Buckborough will repeat the introductory course using the book\nmailed to you® If you have misplaced your book write for another one®\nlessons will proceed much slower because I will be the control pupilo\nhave two pianos in the studio, one for the teacher, one for the pupil,\nbroadcasts®\nthat was\nThe\nWe will\nfor the\n\"So many listeners wrote me\nwas too early for them that we\nruary 6th®\nthat they worked and that the ligl£ hour on Tuesdays\nchanged the time to £§l£ Wednesdays starting Feb-\n\"I will try to represent you in taking these \"lessons so if you have any prob<=\nlems send them to ire and you will hear them discussed the following week over\nWUOM® I will look forward to hearing from you®\""
}