{
  "id": "d1721-27",
  "text": "UNIVERSITY OF CALIFORNIA OFFERS TV SCRIPT COURSE\nThree television courses are included in the new bulletin of evening classes released\nby the University of California Extension,, First course to get under way was 19Tele¬\nvisa on Writing/9 to be conducted by Marvin Young of Ruthrauff & Ryan,, Inc® * beginning\nMonday* Jan® lU at the NBC studios in Hollywood0\nEdgar J® Leaman* television consultant to the board of directors of the Screen Direc¬\ntors s Guild of America* is conducting a \"Survey and Workshop\" starling at the UCLA\ncampus February 21. Bulletins are available through the University Extension offices\nLos Angeles®\nANNUAL REPORT OF WISCONSIN UNIVERSITY RADIO COMMITTEE AVAILABLE\nThe editor of the News-Letter has received a copy of the annual report of the\nUniversity of Wisconsin radio committee for the calendar year 1951* In its six¬\nteen single-spaced mimeographed pages it reviews succinctly the yearns radio\nactivities at that University* and reports on TV plans for the future® Free\ncopies are available upon application to Ho B„ McCarty at WHA«\nWUOA PLANS SEVERAL NEW RADIO SERIES\nThe University of Alabama! WUOA is developing several new program projects* chief\namong which is \"Alabama Document\" which presents a concentrated study of Alabamans\nnatural resources--told in dramatic form and featuring on-the-spot recordings® This\nseries of ten 30-minute programs* produced by Walt Whitaker* program director* and\nLeRoy Bannermsm* Script Writer* under the direct supervision of State Geologist*\nWalter B® Jones,, is currently scheduled by a 10-station network® However, due to the\nmany requests from other stations* Graydon Ausmus* Director of the Radio Broadcasting\nServices* announced that the series was being made available in package form late in\nFebruary® Subjects includedg Ground Water* Surface Water* Crystalline Area and Build\ning Stones| Coal* Steel* and Iron5 Oil and Gas| Soil5 Forestry^ Wildlife Resources|\nand Chemical Industries®\nWUOA has been asked to submit for use on the Egyptian State Broadcasting Services in\nCairo a series of classical music programs featuring the University of Alabama music\n.faculty® A set of six thirty-minute programs featuring the University String Quar¬\ntet is being sent to Egypt by the Stale Department in Washington® WUOA is also pre¬\nparing a series of four programs for state-wide distribution for the Alabama Garden\nClub* and a set of six shows for the Alabama Department of Public Welfare explaining-\nnew welfare laws and regulations®\nWDUQ PROGRAMS LISTED IN NEWSPAPERS\nB« Kendall Crane* manager of the Duquesne station WDUQ* sends the editor the January\n29th copy of the Pittsburgh Sun-Telegraph containing the WDUQ program listing for\nthat day* across which he has writteng \"Finally broke into print—1/28/^2 ®\"\nWnat luck have you had in getting your station! programs lis ted in the daily news¬\npapers? The two'stations with which the editor has recently been associated—KUOM\nand WO I—have regular listings in their respective local newspapers® And he knows\nthat WNYC gets good space in at least some of the New York papers® But what is the\ngeneral practice? Are the programs of most NAEB members nr in ted or left out? Some\ncorrespondence on the subject addressed to the editor might help those members who\nhave not yet been able to \"break into print\" as Ken Crane has just done®"
}