{
  "id": "d1721-29",
  "text": "-30-\nMARCH 15' IS CLOSING DATE FOR SLOAN HIGHWAY SAFETY RADIO AWARDS\nThe National Safety Council invites nominations for its Public Interest Award for^\n19£U Awards for exceptional service to safety will be given to newspapers as well\nas to radio and television stations and networks.\nThe radio awards will be presented for the eleven most outstanding radio contribu¬\ntions in the field of highway safety during 1951* Of these six will be for sustaining\nand five for commercial programs. Nominations may be made by the nominee, or by any¬\none who obtains the written approval of the nominee. Official nomination blanks may\nbe obtained from Paul Jones, National Safety Council, U29 North Michigan Avenue*\nChicago 11, Illinois.\nPRESIDENT MICHIGAN UNIVERSITY TO BROADCAST TO PEOPLE OF STATE\nHarlan Hatcher, new president of the University of Michigan is appearing before the\nmicrophone in a radio series of '’Reports to the People of the State of Michigan.19\nThese informal quarter-hour chats will be heard once each monthj the first one was\nscheduled for the latter part of February. Dr. Hatcher became the eighth president of\nthe University on September 1, 195>1<> His reports will deal with affairs of the Univer¬\nsity, its alumni, and the University’s services to the people of the state.\nWUOMc the University of Michigan station, will transcribe on tape or disc and distri¬\nbute these programs each month to all Michigan stations wishing to carry them.\nAN ANNOUNCEMENT\nby\nBURTON PAULU, NEWS-LETTER EDITOR\nSECOND EDITION OF BIBLIOGRAPHY BEING PREPARED\nPlans have just been completed to prepare a second edition of the NAEB Bibliography\norieinal.lv issued as a News-Letter Supplement two years ago. NAEB members can be of\ngreat help in collecting material for the new edition.\nThe original bibliography listed most of the books and magazine articles on the non-\nengineering aspects of radio and television printed between January 19^9 and May 1950.\nThis necessarily had to be compiled mainly through reference to such bibliographical,\nguides as the Readers Guide to Periodical Literature, Education Index, Public Affairs\nInformation Service^ etcV, and by combing the book review sections of the major learned\nIevision and allied fields0 We did not have the large staff which\nwould have been necessary to do much original research.\nUnfortunately this process resulted in missing a number of articles by well-recognized\nauthorities in and out of NAEB which were published in periodicals not covered by the\nregular guides. This tine I should like to avoid such omissions as far as possible.\nHence the following request*\nPlease send m as soon as possible information about books and articles on thenon-\nengineering aspectFoTTadlo and television published between Janua^ 1^9 and_,t^e_\npresent which are not indexed in or reviewed by such sources as those listed above."
}