{
  "id": "d1721-31",
  "text": "“32-\n”A good percentage of time is devoted to fine music. In addition to familiar and stand¬\nard works5 unusual and little heard compositions are included. Broadcasts of record¬\nings of performances by visiting artists and university musical groups and soloists\nbring residents close to the campus. Outstanding artists and musical groups in towns\nand cities throughout the state are brought to them in the same manner.\nPolitical Forums\n’’Expert readers help listeners keep abreast of their reading with daily chapters from\ngood books, both old and new. Recordings of the Cooper Union Lecture Forum and BBC\nWorld Theatre are on the schedule. Political forums are provided during elections,\nwith both sides of issues presented. Time on the air is available without charge or\ncensorship to all qualified parties and independent candidates. During legislative\nsessions legislators outline all phases of current bills.11\nSATURDAY REVIEW PRAISES KUOM BROADCAST\nnStation 60,\" a one-hour radio documentary produced by KUOM at the University of\nMinnesota.) was reviewed by Robert Lewis Shayon, radio and television producer., writer\nand critic, in the February 2 issue of the Saturday Review of Literature. The program\nwas originally produced by KUOM for the University*s Centennial celebration. It is\ncurrently being heard nationally over the 75 member stations of the National Association\nof Educational Broadcasters.\n\"Station 60,\" based on a true case history from the hospital files of the University of\nMinnesota, tells about a young girl whose deafness was due to emotional disturbances\ninstead of a physical defect. The story traces the case history from diagnosis to a\ndramatic recovery through the work of the University hospitals* psychiatric clinic.\nText of the Review\nThe review is quoted below:\n’’Member stations of the NAEB Tape Network will broadcast, at odd times during the late\nwinter and early spring months, an hour-long documentary, ’Station 60,5 written by Mayo\nSimon and directed by Northrop Dawson, Jr. The director is on the staff of the University\nof Minnesota’s radio station KUOM, and the author, formerly of the same staff, is now at\nIowa State College, working on the Fund for Adult Education TV project established by the\nFord Foundation.\n*”Station 60’ is the case history of a sixteen-year-old girl successfully treated for psy¬\nchosomatic deafness by a university mental health team. Except for a professional psychi¬\natrist who narrates the broadcast, the cast and technicians who produced it were all stu¬\ndents. ’Station 60’ is, without qualification, the finest campus-produced documentary I\nhave heard.\n’’Simulating clinical scenes, it unfolds with rare artistry a general image of the mental\nhealth department’s work, skilfully modulated, as it were, on the carrier-wave of the\npatient’s special story. Done entirely without music, sensitive and often eloquent in\nwriting, direction, and acting, there isn’t a single educational cliche in ’Station 60,’\nnot even a commercial one.\n’’The sound patterns of the psychiatric testing machines evoke a subtle emotional atmos-\nphere| the dialogue, marked by the natural hesitancies, repetitions, and gropings-for-\nthought of conversational speech, and by the bold use of the pause is creative realism^\nand the superb climax, in which the doctor with almost brutal aggressiveness propels his\npatient over the borderline to a cure, is a tour de force of tension and suspense®"
}