{
  "id": "d1721-6",
  "text": "b. In-School programs.\n(1) It is the recommendation of the in-school committee that it meet semi¬\nannually, these meetings to take place the two days preceding the Ohio\nState Institute and the two days preceding the annual NAEB Convention.\n(2) All in-school programs will be selected by the in-school committee at the\nmeeting delineated in (1).\n(3) Between meetings of the in-school committee* school programs will be given\n\" a preliminary screening, so that the remaining programs can be given a\ncareful evaluation at the meeting.\nRecommendation on Auditioning of Programs by Network Headquarters\nThe NAEB Program Acceptance Committee recommends that:\n1. Before a series is accepted by network headquarters, as wide a sample of individual\nprograms as possible should be carefully auditioned. (This^is not intended to pre¬\nclude the offering of occasional timely series without previous auditioning.)\n2. Every effort should be made to carefully audition all individual programs before\nthey are distributed to member stations. Such auditions will be conducted by a\nresponsible person.\n3. Based on the auditions indicated in 2, the Network Manager will:\na. Withdraw any undesirable programs. . ^ «\nb. Notify stations well in advance of any material that may raise questions oi\ntaste, obscenity, ethics and similar problems. ,\nc. Notify stations in all cases where individual programs have not been so screened.\nk. Network headquarters will solicit, secure, and distribute available scripts and\nother descriptive materials about series and individual programs. This should in¬\nclude all materials useful in the promotion of NAEB programs.\nThe above measures will apply within the limits of time and personnel.\n6. None of the above is designed to relieve station managers of any responsibility.\nThe network cannot guarantee that all programs will conform to individual station\npolicy or to the strictest rules and regulations in.all.cases. Both legally an\nmorally the broadcast licensee assumes full responsibility for everything broad¬\ncast by its transmitter. This is intended to be assurance.that network heacquarters\nwill do all it can to make the editing job as easy as possible.\nMiscellaneous Conclusions and Recommendations\nfreneral purpose of network. The network should devote its major effort to ^e^^ri-\nbution of \"Ire 11-planned ”and~\" executed programs of significant educational and.cultural\npurpose. It should offer a distinctive service of substantive programs having relatively\nlong-term value.\nThis does not exclude programs of a timely nature, which require special handling, but\nsuch programs should, in view of present facilities, constitute a minor portion of h\nservice."
}