{
  "id": "d1721-8",
  "text": "-9-\nLater Report to Provide More Details\nDuring the study week all of the program time of the seven TV stations serving the New\nYork area was observed and studiedo Independent double monitoring for reliability-\ncheck purposes was conducted on the eighth seto\nIn addition to the preliminary results released on January 22, ^ a later report will ^pro¬\nvide additional information including a study of the amount, kind and context of violence\nin TV programing, and a special analysis of (1) programs appraised favorably and ^un¬\nfavorably by TV critics, and (2) programs standing high and low in audience acceptance $\naccording to program rating services0\nSome highlights in the preliminary release are as follows?\nThe seven stations provided 11o3 percent more program time in the\nthan in 195lo In the 1952 week a total of 62? hours, 25 minutes\nwas clockedo\nTime on the Alrg\nstody~lreeir~\nProgramming by Class of Program? All drama programs in 1951 were 33o2 percent of total\npro^amTi me 0 fc===E=195=2 the comparable figure had risen to 1*2 oh per cento\nDrama programs for the general audience in 1951 were 25oh percent of total time?, in\n1952, 35o7o\nDrama programs for the child audience in 1951 were 7o8 percent! in 1952, 60? percent\nThe classification of children's programs does not include all programs available to\nchildreno In order to qualify as a children»s program, a program has to be manifestly\nintended for the child audience (by specific program content or advertising content,\nor by format)o\nThe largest sub-class of Drama, Crime Drama, totaled in 1951 IQoO percent of total\nprogram time\" in 1952 it was 3Lho8 percent,, In 1952 Crime Drama (general) was luoO\npercent. Crime Drama (children) was 0o2 pereento\nThe second largest sub-class of Drama programs. Western, totalled 7o8 percent in 1$$13\nand 8o3 percent in 1952a In the present study. Western Drama (general) was h<>2 per¬\ncent, and Western Drama (children) was hoi pereento\nOf the general classes. Variety programs were quantitatively second to Dramao The\ntotal of Variety programs in 1951 was l8oh pereento This year the comparable total\nwas 10o9 pereento\nThe Variety (general) class in 1951 was X3o6 percent! in 1952, it was 6«2 pereento\nChxldren8s Variety in 1951 totalled 201 percent! in 1952 it amounted to 2oh pereento\nDo nestle Variety in 1951 totalled 2o7 percent! in 1952 it was 2o3 pereento The\nDrama and variety programs together accounted for 5lo6 percent of all program tine\nin 1951? in 1952 these types of programs aggregated 53<>3 pereento\nChildren8s programs in 1951 were 12 „ 5 percent of total program time* in 1952 the\ncomparable figure was iloO pereento Domestic programs in 1951 were 10o2 percent!\nin 1952 they totalled 10o8 pereento Sports programs were 10ol percent of total\nprogram time in 1951.? in 1952 they were 8oh pereento"
}