{
  "id": "d883-4",
  "text": "2\nected by Earle McGill, and produced by professional cast from the project.\nBroadcast December 20, 1937, from 10:30 to 11:00 P.M. over Station WABC,\nNew York, and the CBS Network.\ne. For use in school by primary children (approximately Grades I-IIl).\nHONORABLE MENTION. \"Rhythm Imitations.\" From the series, \"Rhythm Games\nfor Children,\" of the Wisconsin School of the Air. Planned and produced\nby Station WHA at the University of Wisconsin. Written by Mrs. Fannie\nSteve, produced by Frederick Fuller and given by Mrs. Steve. Broadcast\nMarch 4, 1938, from 2:00 to 2:15 P.M. over Station WHA, Madison, Wisconsin\nf• For use in school by elementary children (approximately Grades IV-VI).\nHONORABLE MENTION. \"Story of Glass.\" From the series, \"Stories about Fam\niliar Things.\" Planned and produced by the Rochester School of the Air.\nWritten, directed and produced by Elizabeth W. Cross. Broadcast February\n23 1938, from 2:00 to 2:15 P.M. over Station WHAM, Rochester, New York.\nHONORABLE MENTION. \"Journeys in Music Land.\" Broadcast of February 23,\n1938. One of the series of the Wisconsin School of the Air. Planned and\nproduced by Station WHA of the University of Wisconsin. Given without\nscript by Professor E. B. Gordon and student group. Broadcast February\n23, 1938, from 2:00 to 2:15 P.M. over Station WHA, Madison, Wisconsin.\ng. For use in school by junior and/or senior high-school pupils (approximately\nGrades VII-XII)\nFIRST AWARD. \"Carnival at Nice.\" From the series, \"French for High\nSchools,\" of the Wisconsin School of the Air. Planned and produced by\nStation WHA of the University of Wisconsin. Written by Mile. Germaine\nMercier. Directed by Walter ICrulevitch and given by members of the Uni¬\nversity French department. Broadcast January 14, 1938, from 11:30 to\n11:45 A.M. over Station WHA, Madison, Wisconsin.\nHONORABLE MENTION. \"News Today, History Tomorrow.\" A weekly broadcast\nof the Rochester School of the Air. Written, produced and given by Paul\nC. Reed. Broadcast February 18, 1938 from 1:30 to 1:45 P.M. over Station\nWHAM, Rochester, New York.\nII. Entries by Commercial Stations\na. For general use. Lecture, talk, speech.\nFIRST AWARD. \"English Foreign Policy.\" From the series, \"The Story Be\nhind the Headlines.\" Planned and produced by the National Broadcasting\nCompany and the American Historical Association. Written, directed and\nproduced by Cesar Saerchmger. Broadcast Maroh 11, 1938 from 7,15 to\n7:30 P.M. over Station WJZ, New York City and the NBC Blue Network.\nHONORABLE MENTION. \"Raymond Gram Swing.\" One of a regular weekly ser¬\nies, planned and produced by Station WOR, Newark, New Jersey. Written\nand given by Raymond Gram Swing. Broadcast Mondays from 8:30 to 8:45\nP.M. over Station WOR and the Mutual Network. Date not given."
}