{
  "id": "d883-5",
  "text": "3\nb. For general use. Demonstration or participation program.\nFIRST AWARD. \"NBC Home Symphony.\" Broadcast of March 13, 1938. Planned\nand produced by the National Broadcasting Company. Written, directed and\nconducted by Ernest La Prade. Broadcast March 13, 1938, from 12:00 to\n12t30 P.M. over Station WEAF, New York and the NBC Red Net-work.\nc. For general use. Dialog, round-table conversation, interview, debate, ques¬\ntion and answer.\nFIRST AWARD. \"Cooperation -with Government.\" From the series, \"America's\nTo-wn Meeting of the Air.\" Planned and produced by the National Broad¬\ncasting Company and To-wn Hall, Inc. Arranged by George Denny, Jr. Dir¬\nected by Joseph Bell. Speakers, Willkie and Jackson, Broadcast January\n6, 1938, from 9:30 to 10:30 P.M. over Station WJZ, New York, and the NBC\nBlue Network.\nd. For general use. All forms of dramatization.\nFIRST AWARD. \"The House That Jack Didn't Build.\" From the \"Columbia\nWorkshop\" series. Planned and produced by the Columbia Broadcasting\nSystem. Written by Alfred Kreymborg. Directed by William N. Robson\nand produced with professional cast. Broadcast January 15, 1938, from\n8:00 to 8:30 P.M. over Station WABC, New York, and the CBS Network.\nFIRST AWARD. \"Madam Curie.\" From the \"Columbia Workshop\" series. Plan¬\nned and produced by the Columbia Broadcasting System. Written and dir¬\nected by William N. Robson and produced with a professional cast. Broad¬\ncast January 29, 1938, from 8:00 to 8:30 P.M. over Station WABC of New\nYork City and the CBS Network.\ne. For use in school by primary children (approximately Grades I-III).\nNo entries.\nf. For use in school by elementary children (approximately Grades IV-VI).\nFIRST AWARD. \"Your Health.\" Broadcast of January 5, 1938. Planned and\nproduced by the National Broadcasting Company and the American Medical\nAssociation. Written by Russell Edgely. Directed by Gordon Hughes and\ngiven by Dr. William H. Bauer and professional cast. Broadcast January\n5, 1938, from 2:00 to 2:30 P.M. E.S.T. over Station WMAQ., Chicago, and\nthe NBC Red Network.\nHONORABLE MENTION. \"The Frog and the Butterfly.\" From the series \"Folk\nTales of the Western World,\" of the American School of the Air. Planned\nand produced by the Columbia Broadcasting System. Written by L. J. Mat-\nschat, directed by Earle McGill and produced by professional cast. Broad¬\ncast March 10, 1938, from 2:45 to 3:00 P.M. over Station WABC, New York,\nand the CBS Network.\ng. For use in school by .junior and/or senior high-school pupils (approximately\nGrades VII-XIl).\nFIRST AWARD. \"Propaganda.\" From \"Exits and Entrances\" series of the\nAmerican School of the Air. Planned and produced by the Columbia Broad-"
}