{
  "id": "d1257-1",
  "text": "NAEB NEiVS LETTER.Page\n..February 1, 1943\ngeneral manager of WHOU, Ithaca, N« Y.. and chairman of the AER survey\ncommittee*\n\"SOUS OF THEIR FATHERS” OK K F K ,U_\nA radio series, \"Sons of Their Fathers,\" was inaugurated f®®**^* flaa\nstation KFKU. This weekly series of programs consists of stories of Kane s\nmen and hoys in the oresent war; unusual or courageous a*T®:“*]f*°u20_ee_\nstories, sad or humorous stories, of native Kansans ifc our fitting force •\nEach broadcast consists of one story*\nA number of interesting stories whioh should be of ^®*®®*\nKansans have been sent to the Kansas Biographer to be told by him on these\nbroadcasts.\nHo material will be used on these broadcasts Which does not oonform with\nthe regulations of the United States Office or Censorship.\nHEAR. MICHISAN STATE. CARRIES STATE PROGRAMS\nTo function fully in a democracy, government must keep thepeopleawareof\nwhat is happening, especially in ^ose departments wnioh administer jiblic\nresources and activities. For years WEAR has been able Jo serve!m*-- -~\naeiiias Whereby the departments of state government have discussed their poi\nidee and problems with the people of Mlohigan.\nSeven departments, all of which are working in the\nheard each week during this month. They have a message for eve y\nwho is interested in the welfare of his state.\nTuesday at Is00 —\nWednesday at 1:00\nWednesday at 2:30\nThursday at 1:00 -\nFriday at 1:00 —\nFriday at 2:00 -\nSaturday at 5:30 -\n- Michigan Department of Agriculture.\n-Michigan Department of Health.\n_-Michigan Civil Service Department.\nMichigan Insurance Department.\n* Michigan Highway Department.\nMichigan Department of Public Instruction.\n- Michigan Conservation Department.\nSome day the war will end and until that day every wwld°\nnt*8 SSrHSTiS Sri involved and\" some POssiW.efSolution.._\n^Sr^^eecL^roI.^K^has been'a ^ber of th4 Michigan\nState College faculty for sixteen years,^during^whioh\nolosely associated with debate as.-.., *...rr •- • _\nthe student dieousslons over WEAR for several years.\nLeaders throughout the world h^^ ^^g ^^^eala^rovld^inBpirAtio^to"
}