{
  "id": "d1257-1",
  "text": "2.\n)\nFGG INVESTIGATION BEGINS\nThe Federal Communications Commission has recently decided to investigate charges\nof monopoly in radio broadcasting. Broadcasting has contained information on the\naction of the Commission. Now, if you haven’t done so already, read what the cur¬\nrent issue of Education by Radio has to say about it.\nEBS AND BROADCASTS VIA ¥ 0 I - W S U I\n¥01, Ames, Iowa, is planning to erect a \"beverage” antenna for reception of WSUI\nand thereby solve part of the summer static trouble. At present, these two sta¬\ntions are exchanging about 10 hours of programs each week.\nBUILDING A CONCENTRIC TRANSMISSIONJLINE\nThose who heard John Doak, University of Illinois, tell about the newly built\ntransmission line of WILL at the NAEB convention last fall, may soon find the data\nin print. COMMUNICATIONS has accepted an article based on the paper lor publication:\nSOME NOTES ON THE USE OF PHONOGRAPH RECORDS\nEditor's Note - This is the second in a series of articles by Professor F. S.\nSiebert, J.D., University of Illinois School of Journalism, on copyright which\nwill appear in the NAEB NEWS LETTER:\nThe March 1, 1938 issue of the NAEB NEWS LETTER presented the opinion of Orland S.\nLoomis, Attorney General of the State of Wisconsin, on the matter of restricting\nthe use of phonograph records on the air. The matter had been brought up by the\nRCA-Victor Manufacturing Company. Mr. Loomis's opinion was that the restriction\nwNot licensed for radio broadcast,\" when placed upon a record, was no valid re¬\nstriction and therefore could be disregarded by broadcasting stations, and particu¬\nlarly by those broadcasting stations which were not operated for profit.\nThe opinion of Mr. Loomis did not make it clear that the present copyright act,\nalthough it includes musical compositions, does not extend to mechanical records of\nthese compositions. When a composer seeks a copyright on his musical composition,\nhe can restrain the use of this composition by a record manufacturer, but when the\nrecord manufacturer secures the permission of the author and complies with the\narrangements made with the author, a record of this composition cannot be copyright¬\ned under the present copyright act. This means that any restriction made by the\nmanufacturer on the use of the record is invalid. However, the copyright act, when\ncomplied with, prohibits the use of a musical composition \"for profit\" so that the\noriginal copyright of the composer is carried over to the record and prohibits the\nuse of the record when performed for profit as a violation of the original copy¬\nright .\nRecord manufacturers have made appearances at several congressional hearings at\nwhich recommendations for amendments to the present copyright act were discussed.\nThe manufacturers were unanimous in their request for a copyright in the particular\nrendition or interpretation. Such an amendment, however, has not yet been adopted\nby Congress.\nThe present status of the use of musical records for broadcasting purposes is this:\nWhere the musical composition itself has not been copyrighted, there can be no re¬\nstriction of any kind on the use of a record made from this composition. Where,\nhowever, the original composition has been copyrighted and the record manufacturer\nhas secured permission of the composer to make a record, such record can be used\nonly where the performance is \"not for profit.\""
}