{
  "id": "d1257-2",
  "text": "NAEB NEtfS LiCTTEH*\n.Page ..February 1,\n1943\nan Interview with one of these world leaders is described by ??^ern\nM* Bartlett, who has for years carried on such interviews as a Dr*\nBartlett, author, traveler, and leoturer, has recently come to Lansing* He\nhas been on the faculty of Springfield College and Boe.on University and\nwas for three years at Teaching University in China. He is the author of a\nnumber of booksf one of which bears the title of his radio program.\nTHE SYRACUSE RADIO WQHK3H0P AMD THE WAR\nSyracuse University's radio programs for the next few months are concerned\nwith the suhjeot most vital to us all --- America'8 -^h^nternretatlon\nprograms are Informative and will provide background for thelnterpretatlon\nofwar newe; some are designed to inspire Skater loyalty and intereet ln_\nAmerican inetltutione, and others are concerned directly with citizen war\nmorale, according to an announcement by William Pearson Tolley, Chancellor.\nExperts from the University's faculty will Pissent most of *he programseo\nthat yo« may obtain authoritative material, men\nthe staff work Incidental to these features Is &Y 2*5* SfSiI training\npreparing for technioal radio work In our war effort and by girls training\nto take men* s plaoes in radio station operation*\nThe Workshop was cooperatively built In 1937 Py Syracuse University and\nradio stations WFBL jftad WSYR. It ie one of the few oaaes ln the ^ited\nStates where broadcasting stations have cooperated with a large university,\nnot only in building studios but also by partly:Mb?ary^d\norocrams as well* The studios are looatfcd in the University hiorary ana\nooniistSof8eightrooms, including tow studios, two reception rooms, offices,\nand a control room and transoriution center, ^acn u&y raf*e.\neity students participate In one or more of the University’s radio aotiviti®.\nThepersonnel for Workshop programs consists o cue director, Eenne Hnnner\nBartlett; Dorothy Ward, In charge of sorlost and £.^duction; Kathryn Hopp ,\nsecretary; and Lawrence Barnes, engineer. All o.c the 3taffwork in ^tting\nprograme on the air is handled by students preparing for professional\nradio work. In the last few years almost 100 University students have gone\ninto commercial broadcasting. Fully a third of these are now in the nation\narmed services®\nKOAO APPLIES FOR AUXILIARY TRANSMITTER LICBI_SE_\nThe Federal Communications Commission reports that KOAC, Oregon ^tate,\napplied for a license to use formerly licensed main transmitter as an auxii\niary with power of 1 KW. The application was filed with the FPO on January\n11.\n—Schooley"
}