{
  "id": "d1894-4",
  "text": "Dr. F. F. Nilder\nDr. Frank F. Naiacr, Program Director of station KWSC\nand a member of the NAEB Executive Cuumitteo, died on JV nuary\n17 at hib homo In Pullman, Wt ahington. Death was caused by\na heart attack, a recurrence of an ailment which nearly took\nhis life a year ago.\nBora at Puniiurst, Australia, Fr-nk Nulder c<aae to the\nUnited St: tv.?s onriy in his childhood and spent most of his\nlife in the State of Washington.\nFor seventeen years Dr. Naluer was uirector of general\ncollege extension. Radio becarae an integral part of his ac¬\ntivities when ho envisioned tho possibilities of using it for\nintimately reaching his people. He was placed in charge of\nradio programs in 1923.\nHis was a constant struggle for more power for the\nstation, a better frequency, and more money with which to\ncarry on the work. From 250 watts power he saw KWSC grow to\nthe 5000 watts it had at tho time of his death.\nIn 1901 Washington State conferred the bachelor's degree\nupon Ft; uk Nt lrior. In 1902 an M.A. came at Columbia, and in\n1916 a Ph. D. at the University of California. His career\ntouched upon various educational tasks - superintendent of\nschools, state department of public instruction, director of\nprison education, and extension service.\nSince its beginning, the National Association of Educa¬\ntional Broadcasters has enjoyed the counsel and help of Dr.\nNalder. His steadfastness of purpose, tempered by a keen\nsense of humor should be an inspiration to those who carry\non his work.\nThe Association mourns the passing of an able leader.\nCALIFORNIA REPORT\nAccor-*inj to « note in BROADCASTING. (February 15) \"Construction of two\n50,000 watt broadcast stations to be operated by the University of California at\nBv-rkoli>y and at Los Angelos is proposed in a bill pending before the state legisla¬\nture of California. Appropriating $500,000 for the project, the bill provides that\nthe operation of the stations would be under the supervision of the college. No\nprovision, however, is made for procurement of frequencies for the projected sta¬\ntions, Past st^to efforts of this character have been nullified by the repeated\ncourt decisions holding radio to be an instrumentality of interstate c omraerce\nsubject only to the jurisdiction of the Federal government.\""
}