{
  "id": "d1665-19",
  "text": "WESTERN STATE TEACHERS COLLEGE\nEDUCATIONAL CONFERENCES\nAs a part of their summer session programs a number of Michigan\neducational institutions featured special conferences. On July 10 and\n11 the University of Michigan’s School of Education sponsored its\nsixth annual Summer Education Conference. The discussion centered\naround the topic “American Education in the Future—a Series of Pre¬\ndictions”. The third annual Out-of-School Education Conference was\nheld at Michigan State Normal College on July 17. Reports were\ngiven of various educational projects which are being carried on out¬\nside the school room, and special emphasis was given to those for youth.\nThe Western State Teachers College sponsored a number of confer¬\nences in which both students and laymen participated and which brought\nto the campus specialists in such fields as character education, visual\neducation, mental hygiene, social welfare agencies and a number of\nothers of particular interest to teachers. Outstanding among these\nspecial occasions was the second Adult Education Conference which\nfeatured talks, demonstrations and group conferences and concluded\nwith a public forum.\nImmediately following the close of the summer session the Central\nState Teachers College was host to the annual meeting of the Mich¬\nigan County School Commissioners. In addition to listening to topics\nof general interest discussed by outside speakers, the commissioners\nspent much time in informal discussion of problems of special interest\nto them.\nThe National Association of Educational Broadcasters held their\nannual meeting at Iowa City, September 9 and 10. The program was\nplanned for station managers, engineers, program directors, and all\nothers interested in educational broadcasting.\n“A National Forum on Country Life Programs” was held at the\nOhio State University from September 19 to 22 under the auspices of\nthe American Country Life Association. A one-day preliminary con¬\nference on “Services Essential for Effective Rural Living—and How to\nGet Them” was conducted under the direction of the Home Economics\nDivision of the U. S. Department of Agriculture.\nManistee was host to the annual conference of Michigan City su¬\nperintendents of schools on September 20 and 21. Among the topics\nconsidered were “Selling Education to the Masses”, “New Techniaues”.\n“Desirable School Legislation” and “Tenure”. Each topic was irttro-\n-19 -"
}