{
  "id": "d1665-21",
  "text": "WESTERN STATE TEACHERS COLLEGE\nEDUCATIONAL QUOTATIONS AND CLIPPINGS\nDr. William John Cooper, professor of education at George Wash¬\nington University; United States Commissioner of Education from\n1929 to 1933, died on September 19 at the age of fifty-two years. Dr.\nCooper was elected superintendent of schools at Fresno, California, in\n1921. In 1926 he held the same position in the San Diego school\nsystem. In 1927 he was appointed state superintendent of public in¬\nstruction and state director of education, which post he held until he\nwas appointed United States Commissioner of Education.\nThe gift of $5,000,000 as an endowment for the Graduate School\nof the University of Michigan has been announced. The donor is the\nHorace H. Rackham and Mary A. Rackham Fund of Detroit. The\ngrant supplements many anonymous gifts which Mr. Rackham made\nto the institution during his lifetime. One million dollars will be used\nto construct an independent building for the Graduate School, while\nthe balance will become a perpetual endowment. The enlarged grad¬\nuate school will be a memorial to Mr. Rackham.\nThe Kalamazoo Public Schools and Western State Teachers Col¬\nlege at Kalamazoo are co-operating in the establishing of a new demon¬\nstration class in special education at the Woodward Building with Dr.\nEdna Rickey Lotz as teacher. This class will be in addition to* the\none that has been maintained by Western State at the Paw Paw Train¬\ning School and will provide greatly enlarged facilities for student-\nteacher participation as well as a center for public school clinical studies.\nRepresentative Edward A. Kenney, Democrat, of New Jersey, in¬\ntroduced in the House on August 3 a resolution providing that all\nrevenues collected by the United States from the estate of Will Rogers\nbe set aside as a trust fund to be known as the “Will Rogers Student\nAid Fund.” The fund thus created would be administered by the\nCommissioner of Education until Congress established a permanent\nagency to administer it for student aid.\nDr. Henry J. Gerling, superintendent of the St. Louis public\nschools, has pledged personally $25,000 to help to repay losses of 20,000\nschool children in two closed banks. Dr. Gerling offered the money\nafter the St. Louis Court of Appeals had affirmed a decision that denied\npetitions of the children to have their claims against the Savings Trust\nCompany placed in the preferred class.\n- 21 -"
}