{
  "id": "d1665-28",
  "text": "THE EDUCATIONAL NEWS BULLETIN\nDr. George H. Hilliard\nEditor, The Educational News Bulletin\nWestern State Teachers College\nKalamazoo, Michigan\nDear Dr. Hilliard:\nI came away from the campus without handing you the copy for\nthe page in the October issue of the Educational News Bulletin titled,\n“Concerning Students and Alumni”. As you know, the Michigan\nEducation Association meetings are always in vogue during the month\nof October and I find myself nearly 600 miles away from home attend¬\ning the first one of this year.\nIron Mountain, Iron River, Ironwood—surely this part of Michigan\nis rightly named, The Iron County. Then too, I should speak about\nthe weather. The last 100 miles we drove through a snow storm.\nDown from the north over the Big-Sea-Water came Keewaydin bring¬\ning with it snow and ice. Residents of Ironwood say October 4 is\nearlier than the first evidences of winter should appear, but neverthe¬\nless, we drove through one-to-three inches of snow. This “Land of\nHiawatha” is a beautiful place with the branches of the evergreens\nbending with the weight of the first snow, however I assure you that\nthe climate was somewhat of a surprise to one having driven out of a\ncommunity still awaiting its first frost.\nTwo-Hundred Thirty-Five graduates of Western State Teachers\nCollege are living in the Upper Peinsula. Not all of them are teach¬\ning, but a large percentage are and we have alumni on the faculty at\nNorthern State Teachers College, in the high schools of the area, and\nin the grades. Some graduates are in administrative positions—super¬\nintendents of schools, principals of high schools, educational directors\nin CCC camps, and county commissioners of schools. It surely is a\nprivilege to be here and talk with them about their work and they al¬\nways want to know about the welfare of students attending college\nfrom their neighborhoods.\nWhat a chance the alumni secretary has to become familiar with\nthe geography of Michigan. Already at this meeting of Region No.\n7, I have seen graduates from Amasa, Bessemer, Cedar River, Chassell,\nCrystal Falls, Ewan, Escanaba, Gladstone, Ironwood, Kenton,\n-28 -"
}