{
  "id": "d1665-8",
  "text": "WESTERN STATE TEACHERS COLLEGE\nand effectively in various parts of the United States. Another errone¬\nous impression frequently held is that any programs which are educa¬\ntional are uninteresting if not boring. This may sometimes be the case,\nbut not necessarily so. However, educational broadcasting includes\nmore than the aforementioned types of programs. Probably it includes\na major portion of the material presented by radio, whether it be talks,\nnews, discussions, debates, plays, eye-witness accounts of current events,\nor music. To be called educational, the only requirement is that the\nprogram must effect a change in the attitude of the listener.\nIf we assume such a broad definition as this we realize at once that\nmost programs are educational because most programs influence the\nhearer in one way or another. If that influence is desirable and in the\nright direction, radio is beneficial. If the listener is affected neither\nfor better nor for worse, the program is valueless. If, on the contrary,\nhe is injured in any way, then radio is harmful. To be truly educa¬\ntional in the strictest sense the material must be presented in an un¬\nbiased manner and must exert a positive influence on the listener.\nIt is clear when studied in this way that American radio broad¬\ncasting appears at a decided disadvantage. The individuals who are\nin control of the programs are not educators; they are not cultural\nleaders, but instead, are salesmen. Their sole purpose is to gather\ntogether the largest possible audience. When that audience has been\nassembled, their entire jeffort is directed toward selling it some article or\nservice. If the program which accompanies the sales talk accomplishes\nsome good, all the better, but if so, it is incidental.\nThere are two kinds of broadcasting stations in the United States:\nthe commercial stations with which all of us are familiar and the edu¬\ncational stations which are found only in certain areas. The former\nconstitute approximately 98 per cent of the available radio facilities of\nthe country. In many instances they present a few excellent educational\nprograms. In Michigan, for example, one of the Detroit stations\nbroadcasts daily programs from the University of Michigan. A station\nat Kalamazoo has been presenting a program sponsored by Western\nState Teachers College. These two examples illustrate one way of\nreaching the listeners with beneficial programs. We need more broad¬\ncasting of this sort. We need also a greater appreciation on the part\nof educational, civic, and cultural leaders of their responsibility in\nbringing to the attention of the listening public the value of such pro¬\ngrams to the end that more listeners take advantage of them.\nThe difficulty involved in presenting educational programs over\nsuch stations is that the stations are controlled by commercial interests.\nMost of them have set aside for commercial purposes the hours of the\n- 7 -"
}