{
  "id": "d1095-1",
  "text": "July 16, 1932\n1020 KC HEARINGS BEGIN MONDAY (continued)\nKGGE, Coffeyville, Kansas; WCCO, Minneapolis, Minn.; WEAR, East Lansing, Mich.;\nKJR, Seattle, Washington; KDKA, East Pittsburgh, Pa.; WBAL, Baltimore, Md. ; WILM,\nWilmington, Del.; WBSO, Needham, Mass.; WCFL, Chicago, Ill.; WNYC, New York City;\nWPCH, New York City; WHDH, Gloucester, Mass.; WEEU, Reading, Pa.; WSAJ, Grove City,\nPa.; WTIC, Hartford, Conn,; WCBA, Allentown, Pa.; WWSW, Pittsburgh, Pa,; KQV, Pitts¬\nburgh, Pa.; WTEL, Philadelphia, Pa.; WWJ, Detroit, Michigan? WHP, Harrisburg, Pa,\nWSAN, Allentown, Pa.; WNBW, Carbondale, Pa.; John Brownlee Spriggs, Washington,\nPa.; WOWO, Fort Wayne, Ind.; WWVA, Wheeling, West Va.; WHAM, Rochester, N. Y,; WJJD,\nMooseheart, Ill.; WEBC, Superior, Wisconsin; KFUL, Galveston, Texas; KDYL, Salt Lake\nCity, Utah; WNBZ, Saranac Lake, N. Y.; KTSA, San Antonio, Texas; KLCN, Blytheville,\nArk.; WFAM, South Bend, Ind.; WSBT, South Bend, Ind.; WN3.0', Washington, Pa.; WHBC,\nCanton, Ohio; WHBU, Anderson, Ind.; WFBM, Indianapolis, Ind.; '31st Street Baptist\nChurch, Indianapolis, Indiana.\nCBS OBSERVES TELEVISION ANNIVERSARY\nStation WABC and the coast-to-coast Columbia network will be synchronized with\nW2XAB’s television facilities when the first anniversary of Columbia*s regular trans\nmission of television programs will be celebrated from 9;00 to 9:15 p.m., EDST,\nThursday, July 21st. The same event will also inaugurate regular broadcasting of\nsimultaneous sight and sound on one wave-length, a revolutionary development in\nvisual broadcasting*\nTWO NET/ RADIO STANDARDS\nThe American Standards Association has just approved two new national standards\nfor radio.\nThe standards•were developed by the technical committee on Radio working under\nthe procedure of the Amercan Standards Association, with the Institute of Radio\nEngineers and the American Institute of Electrical Engineers directing the technical\nwork. Alfred N, Goldsmith, vice-president of the Radio Corporation of America, is\nchairman of the committee.\nThe first of the standards applies to certain details in the manufacture of\nbroadcast receivers which it is desirable to have uniform in the sets of all manu¬\nfacturers.\nThe second standard specifies dimensions for many of the principal types of\nbases and sockets of vacuum tubes used in both receiving and transmitting. The types\nof base covered in the standard are four-pin bases of the large and small type;\nlarge four-pin base without bayonet pin; large five-pin base without bayonet pin;\nfour-pin transmitting tube base; lai-ge transmitting tube base; four-pin sockets for\nrece receiving tubes and five-pin sockets for receiving tubes,"
}