{
  "id": "d1543-10",
  "text": "- 11 -\nFor the purposes of this section, “ Non-drama tic copyrighted\nworks'* shall include works in the categories listed in Section\n1 (1), (2), (5), and (7) of this Act, and “dramatic copyrighted\nworks\" shall include works listed in the categories in Section\n1 (3), (4), and (6) of this Act.\"\nL'. Since the data relevant toprccfof infringement is peculiarly in the hands\nof the copyright owner, the buraen of proof should properly be placed on\nhim by an added provision in Section 6 as follows:\n“Provided that non-commercial use by a non-profit educational\ninstitution or organization for non-profit educational purposes\nshall be presumed to be such 'fair use’ unless the contrary be\nproved. ’'\nE. Retention of the duration of present copyright provision, a 28 year\ninitial period plus a 28-year renewal period. As an alternative,\nsupport for the Register’s own proposal in his 19 61 Report to the\nCongress: a 76-year total term, comprised of an initial 28-year term\nplus a 46-year renewal term.\nVII. WHAT’S AHEAD ON COPYRIGHT?\nA. The Register will submit a revised Bill for introduction early in the next\nsession of Congress (possibly in January). It will then be scheduled\nfor hearings before the judiciary committees of the House and Senate\nor their subcommittees (possibly in March). When such hearings are\nheld, educational groups along with all interested parties will have the\nopportunity to file written statements or provide oral testimony.\nB. When the hearings are complete, the Bills may be reported out with\ncommittee recommendations (possibly in May). The next step is to\nobtain a rule from the House Committee on Rules, which is necessary\nbefore the House version can be considered by that body. This might\nor might not be forthcoming during the first session. As a guess, it will\nbe at least a year and a half before Congress gets around to considering\na revision of the Copyright Law. The interim extension of the present\nlaw expires December 31, 19 65.\nC. In the meantime:\n1. The Ad Hoc Committee will continue to hold meetings with other\ninterested groups, examine and refine its position, and confer\nwith the Register.\n(2) Non-dramatic would include literary, musical, pictorial and sound recording works;\ndramatic would include dramatic, and choreographic works, pantomimes, and\nmotion pictures."
}