{
  "id": "d1543-12",
  "text": "-13-\nprograms which contain complete copyrighted works or major portions thereof.\nThis, they fear, would destroy the market for such works and deprive the\npublisher of legitimate profit. The reflection of this concern is to be found in\nthe removal of the not-for-profit exemption and the prohibition against\nrecording of any kind - audio or video, open or closed circuit. Incidentally,\nlawyers are not agreed that educators have the right to record copyrighted\nmaterial under existing law - except of minimal portions under certain circum¬\nstances. However, this “right” is commonly assumed and educational broad¬\ncasters have generally proceeded on the theory that they could record any\nmaterial which they had a right to perform. The new law allows little room for\nsuch assumption; it makes it clear that the making of copies - even a single\ncopy - without permission of the copyright owner is prohibited.\nThe concern of authors and composers that their works will be exploited by\neducational broadcasters by exposing them to millions of people (all educational\nbroadcasting, radio or TV, tends to be equated with ETV Channel 13, New York)\nwithout payment of any kind, is reflected in the Bill by limiting educational\nexemptions in this area only to certain performances of copyrighted works via\nclosed-circuit.\nThese and other provisions reveal a lack of understanding of the true nature of\neducational broadcasting - its diversity, operation, purpose, and differences\nfrom commercial broadcasting. These misconceptions must be corrected if\neducational broadcasting is to get more sympathetic attention and adequate\nbenefits in the drafting of the new bill.\nIn the months ahead, educational broadcasters, I suggest, must hold to two\nresolutions; (1) to remain firmly welded to the Ad Hoc Committee so that all\nintegral parts of education maintain a strong unified position and (2) to keep\nthe avenues of communication open to all interested parties in order that we can\ngain an understanding of the views of others and at the same time promote their\nunderstanding of our concerns.\nIt is vital for educational broadcasters to realize that copyright law revision\ninvolves a great many considerations and that people representing the copyright\nowners are no less earnest and sincere than they in feeling that their positions\nrepresent the true public interest.\nIn the next of these memoranda, I will attempt to reflect the views of textbook\npublishers, authors, and music publishers on the proposed revision of the\ncopyright law in order to provide NAEB people with an appropriate perspective\non the total terrain. As broadcasters, and as a part of the educational\nconstituency, we have certain principles we should uphold by all appropriate\nmeans; as citizens we are concerned with the overall welfare of our society.\nAccordingly, we must be zealous in encouraging proper recognition for education\nin copyright revision, but at the same time we must make a sincere effort to\nparticipate in a dialogue which attempts to synthesize or reconcile conflicting\ninterests and views and from which can emerge a law which will truly promote\nthe broad public interest."
}