{
  "id": "d1543-4",
  "text": "-5-\nIV.\n(4) performance of the work, otherwise than in a broadcast to the\npublic, without any purpose of direct or indirect commercial\nadvantage and without payment of any salary, fee, or other\ncompensation to the performers, if:\n(A) there is no direct or indirect admission charge, or\n(B) the proceeds, after deducting the reasonable costs of\nproducing the performance, are used exclusively for\neducational, religious, or charitable purposes and not\nfor private financial gain.\nOther relevant sections of the proposed revision would: (1) expand the\nduration of the copyiight from the present 28 years, renewable for another 2b\nyears, to the life of the author plus 50 years; (2) permit the Register of Copy¬\nrights to exempt any categories of material from the requirement that two copies\nbe deposited in the Copyright Office for the use of the Library of Congress or\npermit him to require the deposit of only one copy or phonorecord; (3) provide\nfor mandatory statutory damages for even innocent infringers.\nANALYSIS OF PROPOSED BILL AS IT RELATES TO EDUCATIONAL BROADCASTING\nA. Sections 5, S\nThese sections deprive educational broadcasters (using radio and\ntelevision, open and/or closed circuit) of rights enjoyed for a long time\nunder the “for profit” clause - the right to perform copyrighted\nhistorical, poetical, literary material of a non-dramatic nature, and also\nmusical material so long as such material is not dramatized and is not\nperformed “for profit.” These sections remove the “for profit”\nprotection from the law, and in the broad view, substitute nothing\nreally beneficial in its place. Specifically, these sections would:\nX. Prevent exempted use for open-circuit (radio and TV) broad¬\ncasting .of any copyrighted material, i..e., books, articles,\nstories, music, graphs, maps, charts, paintings, photographs\nand other pictorial material by:\na. Imposing prior clearance or royalty payments for all\ncopyrighted material used in broadcasting.\nb. Obliging educational radio and TV stations who\nproduce a high proportion of their own programming and\nwho are therefore specially dependent upon free and\nimmediate access to a vast variety of support materials\nfrom which to custom-build programs covering a wide\nrange of subject matter to suffer delays inherent in\nclearance procedures."
}