{
  "id": "d1543-7",
  "text": "-8-\n1. Gives no assurance to an educational broadcaster as to when\nhe can use copyrighted materials or how much can be used\nwith impunity; consequently, unless he consults a lawyer\nbefore preparing a broadcast, he risks a law suit. (Good\nintentions or ignorance are no excuse under statutory damage\nprovisions.)\n2. Places the burden of proof upon the one claiming “fair use“\nas a defense; hence, an educational broadcaster sued for\ninfringement would be obliged to supply proof concerning\ncertain enumerated factors, the relevant data of which is in the\npossession of the copyright owner (plaintiff).\nC. Section 20\nThis provision, which radically changes the present duration of copy¬\nright by adopting a basic period measured by the life of the author plus\nfifty years, would:\n1. Curtail education’s access to copyrighted materials by extend¬\ning the period before which copyrighted works go into public\ndomain.\n2. Lengthen the term of copyright to an extent which experience\nindicates is neither necessary or advisable for all works.\na. Under present law providing an initial 28 year period,\n65% of the copyrighted materials are not renewed.\nb. The new Bill would mean that this 85% non-renewed\ncopyrighted material (which would otherwise go into the\npublic domain from the 29th year) could remain protected\nfor a hundred years or more - often needlessly.\n3. Create a highly complex system of variable and multiple\ndurations that would make it difficult to ascertain what copy¬\nrighted material is in the public domain, e.g,, when or whether\nthe copyright proprietor died.\nV. BASIC POSITION OF THE AD HOC COMMITTEE ON THE BILL\nA. The Ad Hoc Committee believes that the present copyright law should\nbe revised and up-dated because it is outmoded.\nB. The Ad Hoc Committee is unalterably opposed to any revision which\nwould deprive education of existing rights under the present law and\nwhich would fail to protect and advance the vital rights of education\nunder the copyright statute. For this reason, the Ad Hoc Committee on\nCopyright Law Revision is unalterably opposed to the enactment of\nIT.R. 11947 and S.3 008 (especially sections 5 and 8) in their present\nform."
}