{
  "id": "d317-132",
  "text": "APPLICATION TO THE COMMISSIONER OF EDUCATION* U.S. OFFICE OF\nEDUCATION* DEPARTMENT OF HEALTH, EDUCATION* AND WELFARE* FOR\nFUNDS TO SUPPORT A PROJECT UNDER THE PROVISIONS OF TITLE VII\nOF THE NATIONAL DEFENSE EDUCATION ACT OF 1958. (P.L. 85-8§l*)\nAddress?\nSubmitted bys\nTwin City Area Educational Television Corporation (KTCA-TV)\nSt* Paul 8, Minnesota\nTelephone Numbers Midway 5-5565\nInitiated by? John C. Schwarzwalder, General Manager\nTransmitted bys Loring M« Staples* President\nDates\nJanuary 27* 1959\nI. Project Titles A Study of the Steps Necessary to Establish a Regional\nEducational Television Network.\nII* The Problems The states of Wisconsin* Minnesota, Iowa* North Dakota*\nSouth Dakota and Nebraska* though their area is not so densely populated\nas that of some other states* now contain five television stations devoted\nto education. These ares KTCA-TV (Minneapolis-St. Paul), KUON-TV\n(Lincoln* Neb.), WHA-TV (Madison, Wise), WMVS-TV (Milwaukee) and WOI-TV\n(Ames* Iowa). The first four of these stations operate on channels\nreserved for education; the fifth* owned by Iowa State College* operates\non a commercial channel* but pioneered in educational broadcasting. All\nof these stations are broadcasting live educational programs but none is\ninterconnected by microwave transmission except the stations at Milwaukee\nand Madison, Wisconsin. There are additional VHF channels reserved for\neducation at Duluth, Minnesota; Minot and Grand Forks, North Dakota;\nBrookings and Vermillion, South Dakota; and Des Moines and Iowa City, Iowa.\nThere is also a very strong possibility that an additional VHF channel will\nbe reserved in the area of Appleton* Minnesota, which is located some two\nhundred miles due West of Saint Paul. In addition, there are eighteen\nunused, reserved UHF channels in the six states.\nIt is obvious that microwave interconnection of not only the existing\nchannels but those VHF channels which will be built in the future with\ngrants from government at the state and national levels (and, possibly*\nfrom private sources) is highly desirable. Such interconnection would\nhave the following educational results?\na. The provision* by television, of first-class basic educa¬\ntional programs* at both the in—school and adult levels*\nto areas presently without opportunity to receive such\nprograms."
}