{
  "id": "d317-136",
  "text": "-5-\n1o Engine ering Survey*\nA survey by competent professional engineers to da¬\nte mine experimentally the route or routes for a net¬\nwork to follow for the most economical results in terms\nof potential audience and potential program resources®\nThis will include a lehgthy field survey.\n2® Program Surveys\nA survey by competent professional personnel in educa¬\ntional television to determine the educational tele¬\nvision program resources of the area* and a thorough\nstudy of areas of strength* weakness and duplication®\n3® Policy and Administrative Survey, Including Finances*\nA survey by competent professional personnel in educa¬\ntional television to date mine what policies would be\nacceptable to those in charge of, or likely to be in\ncharge of, the educational television effort in each\nstate, which would also be acceptable from a practical\noperating point of view® The costs of the network,\nequipment, the cost of the new stations to be established\nand the operating costs of both must be determined and\nbroken down by states.\nCoordination of information produced fcy the above into a\nRegional Educational Television Network Plan.\nThis can be done only after the three surveys listed are\ncompleted. It will require the assistance of consultants\nin education, government and television®\nB. Approximate Time Schedule*\nJuly 1 — Oct® 1, 1959 Engineering Field Survey\nJuly 1 — Oct. 1, 1959 Programming Field Survey\nOct. 1 — Dec. 1, 1959 Policy and Administrative Survey\nDec. 1 — Feb* 1, I960 Coordination and Formation of Network Plan\nFeb. 1, I960 — Mar. 1, I960 Publication of Surveys & Network Plan\nC. Expected End Product*\nA usable plan for an educational television network, which will inform\neach state officer, legislator and educational administrator in the\nsix states as to what his state must do to establish such a facility,\nwhat the cost will be and what he can expect his constituents to\nreceive if such a network is activated® This plan will be in the form\nof a printed report® The report will also be available to others and,\nit is to be hoped, will stimulate creation of other regional networks®"
}