{
  "id": "d317-3",
  "text": "-2-\nMINUTES OF MEETINGS\n22 May — 10 a.m.\nSome 7^ representatives of Region III and station guests were present at the open¬\ning meeting of the 3-day conference. They were welcomed by Waldo Abbot, director\nor Region III and host for the meeting.\nIn his greeting, Abbot sketched the purpose for the gathering: an informal get-\ntogether and workshop by Region III-ers to examine the NAEB. He pointed out\nthat the success of the meetings would hinge on the amount of \"give-and-take\"\nthat could be stimulated.\nBurton Paulu, Vice-Pres. NAEB:\nPaulu sketched the history, goals and ideals of the NAEB. The organization is\nroughly 25 years old. Present membership can be broken down as follows:\nActive members & Station Operators.98\nAssociate members.83\nAffiliate members.  17\nIncome for the NAEB is dependent upon dues, fees and special grants. This\nsupports such activities as: annual convention, regional meetings, publications\n(Newsletter, Bibliography of Radio and TV, Surveys, etc.), and operation of the\nTape Network.\nPerhaps the most important function of NAEB is giving leadership to and champ¬\nioning the ideals of educational broadcasting. In that connection, NAEB has\nadopted the philosophy that its membership is comprised of \"educators who broad¬\ncast; not broadcasters who educate.\"\nIn the field of leadership, NAEB's achievements have been highlighted by three\nseminars which dealt with the basic ideas of broadcasting:\nAllerton House Seminar.  19^9\nProgram Seminar....195°\nSchool Broadcasting Seminar.1952\nAn up-coming seminar is scheduled for June 21-27 at the University of Wisconsin\nto study educational television: its social role, relationships to other mass\nmedia, potential for adult and classroom education, and the basic program phil¬\nosophies involved.\nIn the field of program development, the NAEB has received financial backing\nfrom the Fund for Adult Education to plan and produce several outstanding series\nsuch as THE JEFFERSONIAN HERITAGE, VOICES OF EUROPE, PEOPLE UNDER COMMUNISM,\nand WAYS OF MANKIND. It has also stimulated the development of programs at\nthe membership level by gaining additional financial help from the Fund for\nAdult Education and the W. K. Kellogg Foundation.\nA further achievement has been the organized movement, in which NAEB played an\nimportant role, to reserve the 2b2 TV channels for educational purposes. Fur¬\nther, the Fund for Adult Education is establishing a resource center for TV\nprogram development, for which a five-man NAEB advisory committee has been set\nup at FAE's suggestion.\nThese achievements in educational broadcasting have been made possible by a com¬\nbination of three factors: a growing public need for educational material;"
}