{
  "id": "d317-32",
  "text": "REPORT TO:\nMembers of Region III, NAEB.\nREGARDING: 1962 National NAEB Convention.\nThis yearts NAEB conclave was such a good one that I felt it wise\nTO TAKE THIS OPPORTUNITY TO REPORT ON SOME OF THE MAIN FEATURES OF THE\nMEETING. IF YOU WERE PRESENT THEY MAY REMIND YOU OF SOME OF THE THINGS\nTHAT YOU HEARD AND SAW) AND IF YOU WERE NOT THERE PERHAPS IT WILL MAKE\nyou plan to attend the next one in Milwakee November 17-20, 1963 at\nTHE SCHROEDER HOTEL.\nFirst, some facts and figures. This was the biggest and best NAEB\nConvention yet. There were over 500 registered at the meeting. There\n38 distributors and several were turned away. Hotel accomodations\nwere fine. Meeting spaces were well arranged for easy access, and the\nindividual sessions themselves were well attended. Weather was nearly\nperfect, and shopping areas were close for the wives as well as those\nWHO TRIED TO TAKE HOME THINGS TO THEIR WIVES. RECEPTIONS WERE WELL\nATTENDED AND THE CONVERSATIONS FLOWED FROM VERY EARLY MORNING TO VERY\nLATE NIGHT. The WHOLE CONVENTION WAS HIGHLIGHTED BY LISTENING AND\nWATCHING BOTH THE ORIGINAL AND AUDIO AND VIDEO TAPE REPLAYS OF THE\nPresidents first message on Cuba. This set the tone for the confer¬\nence WHICH WAS A GOOD SOLID HARD-WORKING THOUGHTFUL AFFAIR.\nThe whole conference had been organized around a ’Professionalism\"\nTHEME WITH B|LL HARLEY LEADING OFF WITH HIS PRESIDENTIAL ADDRESS ON\nMonday night, and Charles Siepmann closing out with his stirring and\nTHOUGHT PROVOKING SPEECH AT THE FINAL WEDNESDAY NIGHT BANQUET. MIXED\nBETWIXT AND BETWEEN WERE SERIOUS CONCERNS ON THE PART OF THE VARIOUS\nPRACTICING GROUPS WITHIN NAEB. THE TELEVISION STATION OPERATORS PERHAPS\nSET THE PACE BY MAKING STATEMENTS OF THEIR FEELING THAT THEY WERE NOT\nAS WELL REPRESENTED AS THEY SHOULD BE WITHIN NAEB. It DIDN’T TAKE VERY\nLONG FOR THE OTHER GROUPS TO GET INTO THE ACT. THE RADIO STATION PEOPLE\nSOON LET THEIR DESIRES BE KNOWN, FOLLOWED BY THE INSTRUCTIONAL TELE¬\nVISION PEOPLE, THE INDIVIDUAL MEMBERS AND OTHERS.\nAmple time was made available for regional meetings as well as for\nMEETINGS OF THE INTEREST GROUPS. COMMENTS FROM MANY PEOPLE INDICATED\nTHAT THIS WAS THE BEST PART OF THE CONVENTION AND THAT MORE EFFORT\nSHOULD BE PUT IN THIS AREA AT FUTURE MEETINGS. THE BOARD TOOK NOTICE\nOF THIS DESIRE AND HAS GIVEN SUCH INSTRUCTIONS TO THE MlLWAKEE PLANNING\nGROUP.\nThe Board at its meetings had other considerations, such as\nPROPOSALS FROM A SUBCOMMITTEE SUGGESTING THE CREATION OF NINE REGIONS\nRATHER THAN THE PRESENT SIX. THERE WERE ALSO PROPOSALS TO CREATE\nSEVEN REGIONS AND TO CHANGE IN A VARIETY OF WAYS THE COMPOSITION OF THE\nBoard to allow for a more equitable representation of all classes of\nMEMBERSHIP. THERE WAS CONSIDERABLE DISCUSSION OF THE NAEB AS AN\nUMBRELLA GROUP COMPARED TO THE N.E.A. ONE PROPOSAL WAS PRESENTED TO\nthe Board at its Thursday morning session calling for the organization\nOF SUBGROUPS, COUNCILS, INTEREST AREAS, ETC., WITH POWERS TO DESIGN AND\nPROMOTE A PROGRAM OF ACTIVITIES FOR THAT PARTICULAR GROUP AND DO A\nNUMBER OF OTHER THINGS, ALL WORKING UNDER THE NAEB BOARD. ALL OF THESE"
}