{
  "id": "d317-33",
  "text": "2\nPROPOSALS WERE REFERRED TO THE EXECUTIVE COMMITTEE FOR FURTHER STUDY.\nAll Board members were asked to present their very best ideas to this\nGROUP SO THAT A CONCRETE PROPOSAL COULD BE SUBMITTED TO THE ENTIRE\nMEMBERSHIP IN THE VERY NEAR FUTURE.\nI LEFT THE CONVENTION AND THE BOARD MEETINGS WITH THE FEELING THAT\nMEMBERS WERE MORE VOCAL AT THIS PARTICULAR MEETING. THEY EXPRESSED\nTHEIR WANTS IN A FORM THAT THE BOARD COULD TAKE ACTION ON. THE BOARD\nNOW HAS TAKEN POSITIVE STEPS TO IMPLEMENT THEM. CERTAINLY A GREAT DEAL\nOF GOOD SHOULD COME FROM THE PH ILADELPH 1 A.MEETING .\nOF PARTICULAR INTEREST TO THE RADIO STATION OPERATORS WAS THE\nAPPROVAL IN PRINCIPAL OF THE NEW OPERATING MANUAL FOR THE NAEB NETWORK.\nThe RADIO BOARD AND THE FULL BOARD GAVE ADDITIONAL POLICY DIRECTIONS TO\nTHE DRAFTERS OF THIS DOCUMENT WITH INSTRUCTIONS TO SUBMIT IT BACK TO THE\nFULL BOARD BY THE FIRST OF DECEMBER AND TO THE MEMBERSHIP BY THE FIRST\nOF THE YEAR. A REVISED DRAFT WILL BE READY FOR PRESENTATION TO THE BOARD\nAT ITS SPRING MEETING IN COLUMBUS IN THE SPRING. FINAL DISTRIBUTION\nSHOULD BE MADE BY JULY I, 1963. THIS DOCUMENT SHOULD REGULARIZE ALL NET¬\nWORK PROCEDURES AND SHOULD MAKE IT EXCEEDINGLY EASY FOR MANAGERS OF\nSTATIONS AFFILIATED WITH THE NETWORK TO UNDERSTAND THE OPERATION OF THIS\nCOMPLEX PIECE OF MACHINERY, AND TO ENABLE THEM TO TAKE THE BEST ADVANT¬\nAGE OF THE SERVICES PROVIDED.\nThe main topic in the television area was whether NAEB should do any\nPRODUCTION IN THE TELEVISION FIELD. At SEVERAL REGIONAL MEETINGS AND\nAT THE TELEVISION STATION MANAGERS MEETING STRONG OPPOSITION WAS VOICED\nTO THIS, BASED ON THE FEELING THAT ONE 0RGAN IZAT I 0N_IN THE EDUCATIONAL\nTELEVISION PRODUCTION FIELD WAS ENOUGH, AND THAT NALB HAD A JOB TO DO TO\nWORK FOR THE TELEVISION STATIONS IN AREAS OTHER THAN PRODUCTION, AND\nTHAT IT NEEDED TO SPEND MORE TIME IN DOING THIS JOB. OTHERS FELT THAT\nNAEB HAD SPREAD ITSELF TOO THIN ATTEMPTING TO DO TOO MANY THINGS AND\nTHAT IT SHOULD GET SOME OF THESE JOBS DONE PRIOR TO STARTING OFF ON SOME\nNEW APPROACH. THE BOARD AT ITS FINAL MEETING AMENDED ITS MOTION TAKEN\nLAST May TO AUTHORIZE THE PRESIDENT TO DISCUSS ANY PROPOSAL FOR PROGRAM\nPRODUCTION MADE TO HIM, TO CONSULT WITH THE TELEVISION STATION OPERATORS\nREGARDING THESE PROPOSALS, AND TO SECURE APPROVAL OF THE FULL NAEB BOARD\nBEFORE PROCEEDING TO IMPLEMENT THEM.\nIF YOU HAVE ANY STRONG FEELINGS ABOUT ANY OF THE ABOVE MENTIONED\nITEMS MAY I URGE YOU TO WRITE TO D|CK HULL OR ME AT YOUR CONVENIENCE.\nIF YOU ATTENDED IN PHILADELPHIA WE ARE GLAD YOU CAME AND HOPE YOU ENJOYED\nYOURSELF AS MUCH AS WE DID. If YOU WERE UNABLE TO MAKE THIS MEETING WE\nARE SORRY YOU MISSED IT, AND HOPE SINCERELY THAT YOU WILL MAKE THE NEXT\nONE IN MlLWAKEE.\nINCIDENTLY, YOU MIGHT CHALK DOWN EITHER AUSTIN, TEXAS, OR MEMPHIS,\nTennessee for the 1964 convention.\nDick Hull, Region III TV Director\nJim Miles, Region III Radio Director"
}