{
  "id": "d317-53",
  "text": "- 2 -\nFollowing out the suggestions of the committee meeting held in Milwaukee,\nsession meetings may be of four types:\n1* For interested persons who are not engaged in program\nproduction| these may be designated as nAu Sessions.\n2. For persons engaged in broadcasting and/or program pro¬\nduction) these may be designated as UBU Sessions.\n3. For persons who are engaged in the technical phases of\nradio or television, including studio control room\npersonnel as well as designers and producers of graphics\nand/or films; these may be designated as \"Cn Sessions. I\nFor committees and special group meetings$ these may be\ndesignated as nDw Sessions.\nThere will be one of these session periods on Monday morning, 10:1*5 a.m.\nto 11:30 a,m.j two session periods on Monday afternoon, 2:30 p.m, to\nh p.m. and U:30 p.m. to 6 p.m.$ two session periods on Tuesday, 8:30 a.m.\nto 10 a.m. and 10:30 a.m. to 12 noon.\nThe cost of one or more of the conference meals may be borne by a com¬\nmercial group or groups. One of these is EMI, which has agreed to under¬\nwrite a noon luncheon on Monday, Do you know of others? The Local\nPlanning Committee feels that a registration fee of $10 may be needed\nto cover all the costs of the conference, With anything less than this\nsum, the conference will not be able to pay expenses of special speakers\n(if any) from off our campus. Participants in sessions are assumed to\nbe registered for the conference and are not to receive reimbursements*\nWhat is your reaction to this matter?\nOn the enclosed sheets I have indicated the various session meetings,\nwith my suggestions of topics to be considered at each. Will you please\nexamine these carefully and suggest more specific topics for as many of\nthe sessions as you can, together with the names and addresses of persons\nwho might deliver the main talks and in addition persons who might be Lo^V-\nchairman of each session. In this regard it may be a good idea for the\nmembers of our committee to act as chairman for as many sessions as\npossible.\nOne further point, the enclosed sheet calls for at least twenty sessions.\nThis may be too many. Perhaps you can suggest some way of limiting the\nnumber of these sessions.\nSincerely,\nGecrge C, Johnson, Director\nEducational’'Radio and Television\nGCJ:fo\nEnclosure\n(Chairman, Regional and Local Planning\nCommittees of NAEB Region III)"
}