{
  "id": "d317-7",
  "text": "-6-\nDinner, Michigan Union\n22 May — 6 p.m.\nGuest Speaker,\nEarl V, Moore, Dean, U. of M. School of Music\nDean Moore extended the ’’official welcome” of the University to conferees. Kis\ninformal remarks touched on the relationship of radio to music education. He\nsketched the history of UM’s ’’Festival of Song” series which had its foundation\nin the radio work done years ago by Dr. Joseph Maddy in the field of musical\ninstruments. There have been tremendous services performed by radio in the mus¬\nical field; there are equally great or greater possibilities for TV to carry on\nand augment radio. Both media are necessary for the fullest expression of ab¬\nilities in art and music.\nMentioning the value of FM, Moore said that the art of music is the art of sound,\nand thus the art depends upon the best possible quality of transmission.\nPANEL\n’’What are the Goals of the Educational Station in the Light of the Institution\nWhich Supports It?”\n22 May — 8 p.m.\nModerator: Kathleen N. Lardie\nParticipants: Willian Bender, Jr., U. of Michigan—’’Public relations\nJ.J. Stillinger, Cleveland Public Schools—’’Teaching”\nM. McCabe Day, WVSH, Ind.—’’Education\"\nPaul Rickard, Wsyne University—\"Publicity”\n(BENDER) Any institution dependent on the public for support must recognize pub¬\nlic opinion. The institution itself is responsible to promote public understand¬\ning of the spirit, history, goals and accomplishments of that institution. The\nobjective, contrary to popular belief, is not to form public opinion, but rather\nto inform. The public can then make its own decisions.\nIn one fashion or another, all programs are \"educational.\"Consequently, we must\nseek some other means or criteria to guide us in program development beyond that\nof \"education.” The public relations criterion can be one of our most import¬\nant guides.\nSignificance of a \"public relations\" approach to programming:\n1) It makes greater demands for showmanship to attract and hold audiences.\n2) The best medium is the one which reaches the largest audience.\n3) It requires a broad selection of program subject matter to accurately re¬\nflect and interpret the scope of the institution’s activities.\n(STILLINGER) If you present a good program, you hope that something worthwhile\nwill go on in the mind of the listener. We have found the greatest enthusiasm\nfor programs that fit closest into the curriculum...when that program is a def¬\ninite help to the teacher rather than an \"extra duty.\"\nWe at WBOE are chiefly concerned with the program that goes into the classroom\nand the job it is doing. Some of our advantages: (1) Station located in build¬\ning with the school administrators; they can see it in operation, and feel a"
}