{
  "id": "d317-97",
  "text": "MUSIC PROGRAMMING FOR EDUCATIONAL RADIO\nTUESDAY, NOVEMBER 6, 1962\n10:00 a.m.—Registration\n12:00 noon—Luncheon, Rooms 101-102, Michigan Union\nHost: Garnet R. Garrison, Director of Broadcasting and Professor of Speech, The University of Michigan\nGreeter: Michael Radock, Director of University Relations, The University of Michigan\nSpeaker: Dr. John A. Flower, Associate Dean and Associate Professor of Theory, School of Music, The University of\nMichigan. “Some Aesthetics of Program Building”\n2:00 p.m.—General Session\nMUSIC LIBRARY PROCEDURES\nChairman: Dr. Laszlo Boehm, Music Director, Department of Radio and Television, Wayne State University, WDET\nResource Persons: Kathryn Fraser, Supervisor of Musical Programs and Clearances, Indiana University, WFIU;\nKenneth Cutler, Music Director, University of Illinois Broadcasting, WILL\n3:25 p.m.—Coffee\n3:35 p.m.—General Session\nRIGHTS AND COPYRIGHTS\nFor the broadcasters: Edwin G. Burrows, Associate Director, Broadcasting Service—Radio, and Manager, The Uni¬\nversity of Michigan, WUOM\nFrom the industry: Leonard Feist, President, Associated Music Publishers, New York\n6:00 p.m.—Dinner: Rooms 101-102, Michigan Union\nHost: Garnet R. Garrison\nSpeaker: James B. Wallace, Dean of the School of Music and Associate Professor of Music Literature, The University\nof Michigan. “The Music School and Radio—Indispensable Partners”\n8:30 p.m.—Entertainment\nUDAY SHANKAR HINDU DANCE COMPANY\nHill Auditorium\nWEDNESDAY, NOVEMBER 7, 1962\n9:00 a.m.—General Session\nPROGRAM RESOURCES\nChairman: E. G. Burrows\nResource Persons: Elizabeth Monschein, Writer-Producer, Music Programming, Wisconsin State Broadcasting Service,\nWHA\nHarry B. Welliver, Music Director, Broadcasting Service—Radio, The University of Michigan, WUOM\n10:20 a.m.—Coffee\n10:30 a.m.—General Session Continues\n11:30 a.m.—Informal Business Meeting\n12:00 noon—Luncheon: Rooms 101-102, Michigan Union\nHost: Garnet R. Garrison\nSpeaker: Abram Chasins, Music Director, WQXR, AM-FM, The Radio Stations of the New York Times, New York.\n“Yes, but!”"
}