{
  "id": "d427-0",
  "text": "January 5* 1954\nMr, James M, Morris, Director\nStation EG&C-AM\nOregon State Agricultursl College\nCorvallis, Oregon\nSear Jims\nWanted to get a reply off to yon at mm, tut first wanted to do eome-\nthing about it, The attached will suggest wt.it Xs ve tried to get started* X\nsuggest that you also contact Bob Coleman, JiA Miles, Carl Manser, H. B» McCarty,\nFrank Schodey, and any others who my have been in this hassle, to see what\napproach they have found most useful* (X*m wading them copies of this and your\nletter and X hope they* 11 help all they can, directly,)\nSince X believe education^ broad©: sting has significantly grown during\nthe past few years X believe attention coin'd be called to the many unique HAEB\n(FAE, BBC, Exchange, Grant-In-Aid in«Sehcol) program services you are offering,\nXs there any way in which you ca , concentrate attention on that area which would\nbe blanked out by their interference, dramatizing its needs and referring to part\nstatus as a \"consumer” of your p/ograms?\nX think the increasingly efficient way in which significant educational\nservices are organized and coordinated 5.? your state could also be used to rally\nsupport by various organizations there, contrasting (your state-w5.de unique service)\nwith the essentially local propo :a1s lifcvly to characterize the Lewiston proposal.\nThe KAEB as such can of course net intervene, Cohn and Marks could best\ntoll us how far we could go, 1/ indeed we should directly play any role, in this\nmatter, in view of our statur as a tax-exapt and therefore \"non* lobbying\" type of\norganization. As licensee you conoid, and should, of course both take the lead and\nrefer to NAEB-af filiationr and fellow (college, university, land-grant, school)\nstations as a part of yw resources.\nNot having myrelf gone through all t ils, these are the beat X can do, along\nwith tho enclosures Vm attaching, X hop© thy may at least be suggestive.\nAnd please jail on us for anything Hise which we can specifically provide.\nSincerely,\nHJStdo\n009 Executive Committee\nDire tor®\nExecutive Director\nMcCarty\nGtJjmm\nyiles\ntlenzer\nCohn & Marks"
}