{
  "id": "d427-106",
  "text": "4\n4r £*%**■\nWe shall continue to keep in close touch, and if any basic decisions\nneed making, we have all agreed to present the problems involved to our\nrespective boards.-\nI hereby invite reactions to the above „\n£) Battle Greeks After a year and a half on the job, 1 had never visited\nthe Wo Ko EeTTogg'Tdundationo Dr* Maurice Sesy extended an invitation for me\nto stop by and I did soe He also had sn opportunity to shake hands with Cecil\nBidlack, although m was generally the case at all our stops, while 1 was talk¬\ning to Dr. Secy, Cecil was busy in discussions with Wallace Came an of Kala¬\nmazoo, who was in Battle Creek also at 'this time,\nI had the jiagressipn. fromgg^hourl J&jgt everything\nwas in pretty good shape. He made clear to rns, In answer to ny indirect ques¬\ntions, that no decision has been made by the Kellogg Foundation regarding\neither the continuance or discontinuance of its support of the MSB* A couple\nof the other recent notes to Kellogg, of which you will by now have received\ncopies, are also the outgrowth of this discussion*\nI pointed out, as far as our Foundation relations are concerned, that we\nhad always discussed with Kellogg first our long-range plans* We also always\nsubmitted to Kellogg first all requests which would affect our basic operation*\n1 outlined the basic discussions now taking place in Washington among the vari¬\nous organisations concerned* I told him of the joint efforts of the NAEB and\nthe NPAC in many areas* I told him ojj -die need for w to know soon the Kellogg\nreaction to our Washington office Jy<5lh*this connection I explained the logic,\nin our opinion, of approaching them first,. since the basic Headquarters mech¬\nanism and organization was entirely Kellogg-established, and we wanted to pre¬\nserve credit where credit was due unless Kellogg specifically gave us a re¬\nfusal on tills point, after hearing all aspects of it. If they were not in¬\nterested, I pointed out, we would obviously have to take 3,t up with other pos¬\nsible sources of funds.\nI pointed out that, with two exceptions (Engineering and Placeman!) all\nFAE Projects were on a project to project basis, with unused funds return¬\nable at the conclusion of each, while the Kellogg Project was of a firmly-\nrooted on-going , , I c^le^ab-cention t_o, ihe, fact-that recently\nare the products of the past few years. of their grant beginning to be pub¬\nlicly recognized*\nI indirectly indicated the regret that we would feel if Kellogg were to\ncease its support of the NAEB at the point when the latter is achieving the\nsort of genuine stature which would reflect the greatest credit on Kellogg.\nI al&o indicated that all our relations would gladly be frankly discussed\nwith Kellogg if they requested more material or ouch discussions. I also\nexpressed the hope that our recent reports would provide a satisfactory\nanswer to the question so often raised about \"Where the NAEB is going,\nIn Dr- Sesy I found a most Intelligent grasp of the situation in very\nprorapt fashion* He reassured me of their continuing interest and mentioned\nthat Bob VanDuyn, to whom he was leaving relations with the NAEB, would be\nback in this country from England the following week*\nI found this stop a most encouraging one in view of the earlier pessi¬\nmistic impressions I was beginning to gather from various discussions in our\nKellogg ralatlacoa?,"
}