{
  "id": "d427-129",
  "text": "Item No, 2\nTO: NAEB BOARD OF DIRECTORS 11-17-54\nFran: Frank E. Schooley\nRe: NAEB depository\nTreasurer Coleman requests designation by the NAEB Board of\nDirectors of the East Lansing State Bank as depository for\nNAEB funds in the hands of the NAEB treasurer. This is not\nonly a convenient bank for the treasurer, it is also one of\nthe best banks in the Lansing area. Michigan State College\nuses this bank for most of its checking accounts, including all\npayrolls and general business. As of October 7, 1954$ the\nresources of the bank were listed at $11 <,650,494«$9«\nincluding cash and U. S. obligations in amount of $6,701,493o95•\nIt is necessary for us to adopt the following resolution:\nffBe it resolved that all checks, drafts, notes or orders drawn\nagainst said account be signed by any of the following:\nR. J. Colemans, Treasurer\nwhose signature shall be duly certified to said bank, and that\nno checks, drafts, notes or orders against said Bank shall be\nvalid unless so signed.\n\"Be it further resolved, that said Bank is hereby authorized and\ndirected to honor and pay any checks, drafts, notes or orders so\ndrawn, whether such checks, drafts, notes or orders be payable to\nthe order of any such person signing and/or countersigning said\nchecks, drafts, notes, or orders, or any of such persons in their\nindividual capacities or not, and whether such checks, drafts, notes\nor orders are deposited to the individual credit of the person\nso signing and/or countersigning said checks, drafts, notes or\norders, or to the individual credit of any of the other officers\nor not. This resolution shall continue in force and said Bank\nmay consider the facts concerning the holders of said offices9\nrespectively, and their signatures to be and continue as set forth\nin the certificate of the Secretary or Assistant Secretary,\naccompanying a copy of this resolution when delivered to said Bank\nor in any similar subsequent certificate, until written notice\nto the contrary is duly served on said Banko\""
}