{
  "id": "d427-22",
  "text": "Steetle\n-2-\nrun a commercial station for 3 months. \"If you want tc know how much a TV station\nj to operate, ask a commercial broadcasterw was hie basic theme,\nWe ~-*re then described as *\nclassy collection of crackpots who want to spray education\nover boys and girls in the classroom by te evision**\n| •* o.r elaborated on this particular, idea by colorful references to the membership\n4' •' - \"-ittonal TV group in Chicago. He commented that he really knew\nthey were like because he was & member of the group. Troubles in Chicago\ntouased briefly and highlighted by his statement that the present. chair#-\nwould $100*000 rig’t now to get out of the job. Hobody will take it for\n: ess than $25C*009,CW\n.. all of the above he added the followings\nKite-hell repeated that statement twice, as if to ‘underline it, in concluding\nvhat, :•. d developed into a moot vicious piece of propaganda against the develop,\n-ent of educational television. His remarks were obviously filled with extreme\nv^er-cial bias, from the radio and television broadcasters point of view, as\n. il as the interests of the film industry in keeping television out of\nSo~ petition with films for the classroom audience* '\nt is; probably of little importance here, but Mr. Mitchell then proceeded to\n©velopithe film industry as the benevolent profescion which has \"poured millions\nf <io\" v&a into films for a quarter of a century without, getting anythin* back.'*\n• giving hie audience a preview of a new film on'GREAT RELIGIOUS FAITHS, he\n•lSecured the 2] years of work which has gone into the production of the film\nver expecting to get our money back out of th<\n- tragic pert of the evening*8 address was the fact that a number of the audio-\n’ ' ' •&! in attendance were *sold* on the idea that educational television\n> to be left, alone. The costa are too high, returns in classroom\n:• at''- are - low, there \"a nothing in educational TV that films can\"4 do\nbetter, etc.\n■•H •s my firm belief that this address by Maurice Mitchell before the Oregon\nJ dlo^Visual Association was a part of the planned campaign of those who oppose\n• eat‘opal television. You will recall their participation in the campaign\n' n vaa waged by opponents at the 1953 session of th*> Oregon Legislature.\n- obaHy this address by ’Mitchell fits into the jig-saw pus ale which you see\no • The national level. It seems to fit into place right here in Oregon, too\n■ looking forward to seeing you at the Western Radio and Television Confer*.'.c--\n;• on the 1 8th.\nBest regards,.\nJames!. M. Morris\nProgram Manager,’ KOAC\neMM'jbno"
}