{
  "id": "d427-24",
  "text": "Page 2\nMembers of the Board NAEB\nFebruary 9, 1954\nb) No mass purchase likely to be needed* Kith the\nstocks wq liave on hand it~”seems \"to\"me we have a\nsafety factor which will allow us to observe\nwhich albums are being sold in the fieldo Thus,\nWays of Mankind might be going rapidly so an\norder would' feave to go in for 300 albums to be\npressedo There is no reason to assume that all\nwould move at the same pace so no mass purchase\nis likely* If it is, business will be good\nenough that we should be happy to take extra¬\nordinary steps to finance the need.\nc) Revolving fund for pressing should be maintained«\nEntirely ‘apart frdm the a7frangemenl with ElBF, it\nseems to me we must either tap a general revolving\nfund when pressings are needed or we must accum¬\nulate a revolving fund for new pressings before\nthe revenue from sales of records is tapped for\nother NAEB uses.\n3) Price cohsiderations\na) EBF recommends increase in price. A price of\n\"PnT, 50 for~tne~~J efferson ian ^Heritage and $42.50\nfor albums of tHe\"otSer™\"series allows the sales¬\nman sufficient return to encourage his effort at\nselling* Their experience with the sale of\nquality films of special utility at high price\nhave been quite successful.\nb) Division of responsibility. (Probst^s letter)\n'SW to assume'^expense of merchandising, promoting,\nbilling, invoicing and distributing* NAEB to\nmaintain the inventory, to store, and to mail on\norder of EBF* (this leaves doubt as to the mean¬\ning of ’’distribution” as a responsibility of EBF)\nc) NAEB finaneial return * 50$ of sales price brings\nTiTa gross“To\"MeF of $18.75 and $21.25 per album\nwhich would leave a net of approximately $10~$12\nafter cost of pressings and mailing.\nd) Price increase to be announced by NAEB. If NAEB\nJoin^rn^trmF in the \"enterprise, SAfeS is to announce\nthe increase in price before any announcement is\nissued about the joint activity.\n4) Faulty side\nSeveral customers have complained that one side of the\nJeffersonian Heritage is faulty* It is my understanding\nfhaf Sf\"'SlegeTTias'met resistance from Columbia on\nwhether the side is faulty. Since the complaints con¬\ncentrate on the one side it seems evident to me that it\nis at least out of conformity with the rest of the album*"
}