{
  "id": "d427-31",
  "text": "&JULXJJUJLX LAM\nTO?\nmm*\nDATE? FEBRUARY &, 1954\nPlease note paragraph 3» and give me any thoughts you may have on this*\nIt may mean consideration of the possibility and desirability of the\ncreation of a second TV distribution facility, and Isd be grateful for\nyour thinking before I go up*\nCJLE1\nNATIONAL PROJECT IN AGRICULTURAL COMMUNICATIONS\nFebruary 15» 1954\nDear Mr* Skornias\nIt gives me great pleasure to inform you that the Conference on Agricultural Films\nfor Television has been scheduled for March 15*16 in Room 101, Kellogg Center, Michigan\nState College.\nYou and others interested in educational motion pictures and television programs\nare cordially invited to participate in a review of the problems and possibilities re¬\nlating to using and exchanging agricultural motion picture footage for television.\nPurpose of the conference is to determine the need, mutual desirability and\nfeasibility of establishing a facility to make agricultural motion picture footage\navailable to all concerned with programming and producing television shows* If it\nseeme appropriate, we will then consider and develop recommendations on standards,\npolicies, and procedures for the establishment of such a facility*\nTwo weeks prior to the conference date, a reminder will be sent to you in the\nform of questions, problems, and suggestions received from interested groups through*\nout the country* These might help your pre-conference thinking*\nPlease complete the enclosed reservation blank and return it immediately to the\nKellogg Center, here at Michigan State College.\nWe are also enclosing three copies of a voucher which will take care of your\ntravel and expenses as requested. If you can complete a duplicate set of these and\ngive them to us at the end of the conference, we will process them for Immediate pay»\nmeat*\nTravel under this project is exempt from Federal taxation and enclosed are four\ntax exemption forms for your use when purchasing your tickets.\nWe are certain your ideas and efforts will contribute to the development of\nways for making effective agricultural motion picture footage available for television.\nSincerely,\n/a/ Stanley Andrews\nStanley Andrews\nExecutive Director\nSAjjf\nEnclosures"
}