{
  "id": "d427-37",
  "text": "VGBH\nO.DFJ\nLOWELL INSTITUTE COOPERATIVE BROADCASTING COUNCIL\nMarch 3, 1954\nMr* John Holt\nNetwork Manager\nNAEB Tap© Network\nUniversity of Illinois\n14 Gregory Hall\nUrbana, Illinois\nDear Johns\nOn March 17, 18 and 19, we will be broadcasting live the Harvard Godkin\nLectures by A dial E. Stevenson on the subject A Troubled World* The in¬\ndividual titles for the lectures ares\nI* Ordeal of the Mid-Century\n2- Perpetual Peril\n3» Some Cautionary Comments\nWe intend to tape record the complete lectures off the air, and I am\nwriting to you and to 1 NIC to ascertain whether you are interested in\nreceiving these lectures for immediate distribution, as a special,\non the NAEB Tape Network*\nI anticipate that the three lectures will run an hour and one-half to\ntwo hours each* The first hour or so being the lecture $ the remainder\nof the period, questions from the audience* We have had a great deal\nof experience with this type of audience pick-up covering the Godkin\nLectures by Senator Douglas in 1952, and General Lucius B* Clay in 1953.\nThrough an elaborate battery of microphones we intend to pick up every\nquestion.\nThe Godkin Lectures are an annual series at Harvard concerned with \"the\nessentials of free government and the duties of the citizen.\" In the past\nthey have turned out to be solid explorations in the fields of government\nand foreign policy, skirting political partisanship.\nI have made an initial request for permission to broadcast tap© recordings\nof the lectures on the NAEB Network, and if you and Harry give me the go-\nahead I feel confident that final permission can be received.\nI feel strongly that these lectures might well turn out to be a high point\nof broadcasting for the network, and feel that a great deal is to be gained\nthrough immediate distribution. Can you give me a decision on this so that\nthe necessary arrangements can be carried through?\nVery truly yours,\n/s/ Ralph\nRalph J. Tragney\nProgram Manager\nRJTsjm"
}