{
  "id": "d427-65",
  "text": "TO s Executive Director, Officers and Directors, NAEB\nFROM: John W. Dunn 11:05 a.m. CST 4/22/54\nFirst, I must protest that our Executive Director does not give enough time for his\nletters to travel to distant points, be analyzed and replies formulated. His letter\nregarding Novik, etc, mailed at 8:30 p.m. April 20, arrived in Norman at 9:00 a.m.\nApril 22. Hence, everything had to be pushed aside in the hope that an air mail\nspecial delivery might get to Headquarters by the 23rd. We are FORCED to operate\nwithin the limits of our budget; hence long distance calls and telegrams are used\nonly in times of greatest need.\nIn out? attempt to be so \"hugh-hush\" we have become too general in our statements\nabout the \"human relations project.\" Certain things must be spelled out for every\none concerned.\n1. We must emphasize to NAEB members and others that Novik’s services must be the\nresult of a REAL need after all local efforts have failed. Otherwise, the poor guy*11\nbe kept hopping *round the country needlessly. Also, this will make local person\nanalyze more carefully his own situation and the resources at hand.\n2. Novik (bless him) and all others concerned (including NCCET & JCET) must know\nthat requests for Novik*s services must be channeled through the Executive Director\nof NAEB. In making request for his services, member must reveal to NAEB Exec. Dr.\nthe salient points regarding the difficulty at hand so that Novik and other interested\nparties can be notified. In other words, we must not leave the impression that all\nit takes is a crook of the finger to get Novik there. With this information under\nhis belt, Novik can best plan his strategy and perhaps get information he needs before\nleaving New York.\n3. Members requesting Novik1s services should be aware that his request will be made\nknown to other interested parties —* either in his own area or nationally.\nIn this connection, I can see no value attached to reporting to everyone. If, for\ninstance, it*s strictly in realm of TV, then it should be reported only to those who\nare actually in TV (either with CP or applicant).\nFull Board of Directors should be notified at once. Exec. Dr. should use judgement.\nIf he anticipates request is a \"hot potato\", then he should wait for Board Recation\nby telegram within given period before requesting Novik to move in. Otherwise,\nnotification of Board would be routine.\n4. Nowhere have we required Novik and interested parties with whom he would be work¬\ning to file any kind of written report. This should be done for several reasons: (1)\nto protect NAEB’s interests in case any eyebrows are lifted; (2) to serve as a guide\nin the future when FAE project is no longer with us. Files should be restricted and\nmade available only to NAEB Members who need them for study.\nI look askance at the gathering which is projected for Chicago. I think there’s danger\nthere for such a meeting immediately lifts everything out of the local and puts it\non a national scale. There will be a tendency to reduce the whole thing to a common\ndenominator. I see no reason why NCCET & JCET should be present. Exec. Dr. should\nnotify them of how they should proceed to use this service the same as everyone else.\nThe more Novik can operate as a \"lone wolf\" the better off we*11 be."
}