{
  "id": "d427-66",
  "text": "Box 2002\nUniversity, Alabama\nApril 22, 1954\nMemo To: NAEB Board\nFrom: Graydon Ausmus, President\nFollowing our meeting in Columbus, I had a lengthy conference\nwith Morris Novik concerning a contract with him as NAEB\nmanagement and personnel consultant. We arrived at the following\ntentative agreement.\n1. NAEB will retain Morris at an annual fee of $2500.00.\n2. On days when Morris travels for NAEB he will receive\na perdiem of $75.00 plus expenses. It is understood\nthat on trips where he must spend one day going and\none day returning, he will receive a perdiem for one\nof the two travel days in addition to the time he\nspends at the site.\n3. He will receive no perdiem for work which he does from\nhis own office but will bill NAEB for long distance\ncalls which he makes In connection with NAEB business,\n4. Our contract with Morris will be on the basis of a\nsix months trial period - at Morris* Insistence- subject\nto renewal.\nIt is further understood that Morris will be working as the\nNAEB consultant, but request for his services may be referred\nto Headquarters by the Center, NCCET, and JCET. It is also under¬\nstood that Morris* services will be on a local station rather\nthan on a national organizational basis. It is hoped that he\nwill be called in by locsl organizations before problems between\nlabor and management in the local community have developed to a\npoint of conflict.\nAs you will note from my carbon to Miss Howard, NAEB is requested\nto give a progress report on this project prior to the FAf Board\nMeeting in October and is expected to give an audited report at\nthe end of our fiscal year.\nIf you have any objections to any of the details of this proposed\ncontract please send me an immediate note on it, otherwise I will\nInstruct Harry to formalize this contract with Morris as soon as\nhe receives the $7000.00 check from FAE. I would suggest a con¬\ntract date of April 15 in as much as Morris Is already at work,\nI would also suggest that his expenses prior to April 15 on this\nwork be picked up.\nFor your information, the retainer of $2500.00 is less than half\nthe reteiner paid by JCET for their legal consultants."
}