{
  "id": "d427-73",
  "text": "TO:\nFROM:\nSUBJECT:\nHairy J. Skornia\nHarold E. Hill\nraia *\nReport on attendant© at CNO TV Workshop* held at the University\nof Toledo, April 20-24, 1954\nAs you know, I attended tic TV Workshop* sponsored by the\nCounoil of National Organisations* hold at the University of Toledo,\nApril 20-24, 1954, as the represents biv© of the NAEB. You will recall\nthat we felt that it me important that the NAEB be represented at this\nworkshop for two basic reasons: (1) The NAEB should b© an active\nparticipant in the affairs of the CNO, both for the benefit to be\nderived therefrom, and to keep the CNO ond its member organizations con¬\nstantly aware of the NAEB and its activities in the field of education}\n(2) To determine, through participation in this workshop, in what ways\nthe HA!SB ©an be of most service to ether national organization© in the\nfurtherance of their purposes and of education in general.\nAs stated in the CNO announcement, this workshop was \"conducted\nfor key personnel from national organisations which are participating\nin the Council of National Organizations, and which are or will be con¬\ncerned with utilization of television for educational purposes.”\nThe CNO Television Committee i«s fortunate in getting the\ncooperation of the University of Toledo., Willy*,' Motors, Ino., and the\nGreater Toledo Educational TV Foundation in making the workshop possible.\nRepresentatives from 28 national organization!' attended the five-day\nworkshop.\nThe work of the workshop was divided into three general categories?\n1. General sessions\n2. TV Programming Work Groups\n3. Application and Transfer Groups\nGEJ8SRAL SESSIONS — These were designed for purposes of (a) orientation\nand organization, (b) resource Information, ond (3) inter-comunioatlon.\nTopics discussed at the various general sessions vers as follows:\n1. General organization god purposes of the workshop.\n2. General introduction io Willys TV equipment.\n3. \"What is good educational television?\" ~ Panel\nDiscussion.\n4* Viewing of sampl? progress on kino see-3, Parte of\nthree general sessions wora devoted to this."
}