{
  "id": "d427-74",
  "text": "Report on attendance at GNO TV Workshop\nPage 2\n5. tfTh® role, possibilities, and limitations of TV\nfor education and agency goals,\"\n6. ^Determining procedures for workshop ©valuation.\"\n7. \"How to build a TV program.\" This was built around\nthe showing of four kinescopes made at NKAR-TV for\nNFAG, showing how TV can beet be used for educa¬\ntional purposes (principally in agriculture).\n6. \"Mset our allies.9 Brief talks by representatives\nfrom such organization® as the KGCET, JGET, etc.,\nfollowed by general discussion.\n9. \"Adult learning and television.\"\n10. \"Mobilising community forces for education by TV.**\nPanel discussion.\nH, \"Toledo and education by television. **\n12. General summary and ©valuation of workshop.\nTV H10GBAHMH© WORK GROUPS - The workshops were divided into three program\ngroups, under the leadership of Arraand Hunter* Keith Tyler* and Ted\nSherboume. for the purpose of developing and presenting an educational\nTV program over the closed circuit facilities provided at the workshop.\nThese groups devoted their first several sessions to discussions of\nprogram types, how to got the cooperation of local, ccraeroial stations,\nhow to plan a series of TV programs, etc. They then proceeded to plan\nand rehears® an educational TV program. Through this process they were\nmade more aware of the many problems that oaa be encountered in the\npreparation of programs. Finally, cash of the three program groups pro¬\nduced its program, over closed circuit facilities, on the final morning\nof the workshop. These programs ware then evaluated by the entir© group,\nAPPLICATION AND TRANSFER GROUPS - This is merely a fancy title for\n\"How do we take what we8ve learned at this workshop homo with us and put\nIt to work.\" Thar© were three of these groups, also. However, the\npersonnel in these groups differed fro® that in the above groups. These\ngroup meetings were devoted to discussion of how best to use television\nfor educational programs, how to make the knowledge acquired at the\nworkshop available to participants own organization, how to make best\nus© of this knowledge, etc.\nThis workshop was designed primarily for national organisations\nwho, in their general educational and promotional activities, would have\noccasion to make us© of television for the furthering of their work.\nTherefore, only two or three of the participants were very familiar with\neither radio or television, except to the extent that soma of them might\nhave appeared on programs.\nI explained, at the opening session when participants were\nintroducing themselvos, that my role in being there was a little different\n— that the MSB was interested in learning what it could do to help these\norganizations make the best uso of television, whether it be over our own\neducational stations or commercial outlets."
}