{
  "id": "d427-75",
  "text": "Report on attendance at CNO TV Workshop\nPage 3\nAlong this same line, Armand Hunter and I met with the CNO\nTelevision Committee, at their- request, to dismiss just what the MSB\nmight be able to do to cooperate in this endeavor. I suggested one\nproject which 1 said I would propose to our organization, but I emphasized\nthat it would merely be a suggestion on my part and that I would have no\nsay in the final decision. The following is a brief resume of the pro¬\nposal I made:\nTHAT THE N® SHOULD ATTEMPT TO OBTAIN FUNDS FCR THE\nPRODUCTION OF A SERIES OF THREE OR FOUR KINESCOPES DESIGNED\nTO TEACH LOCAL ORGANIZATIONS BOW TO MAKS THE BEST USE OF TV\nFOR PRESENTING EDUCATIONAL AND INFORMATIONAL PROGRAMS.\nTHESE PROGRAMS COULD BE SIMILAR TO THE SERIES OF FOUR PRO-\nBUCED BX MvAR-TV FOR EPAC. EXCEPT THAT THEY WOULD BE MORE\nGENERAL. THE NPA£ KINBS ARE TOO SPECIFICALLY AUCD AT\nFARM ADVISORS AND HCm ECONOMIC ADVISORS TO BE (F MUCH\nGENERAL USE. WHEN NECESSARY FUNDS ARB OBTAINED THE ffAEff\nSHOULD COMMISSION OHS CF ITS TV MEMBERS TO PRODUCE THE\nSERIES. (WKAR-TV MIGHT WELL BE THE LOGICAL CHOICE, DUE TO\nITS EXPERIENCE WITH THE NPAC SERIES.) TON THE SINES WERE\nCOMPLETED AND COPIES MADS, THEY WOULD BE TURNED OVER TO\nTHE CgO FCR DISTRIBUTION, ON A* LOAN BASIS, TO LOCAL CHAPTERS\nOF Ggo MEMBERS WISHING TO TRAIN THEIR PERSONNEL IN THE USES\nCF ££* THESE KIKES WOULD NOT BE AIMED AT A GENERAL AUDIENCE\nAND WOULD NOT IE ACTUALLY SHOWN OVER 17 STATIONS. KINESCOPE,\nRATHER THAN FILM, HAS CHOSEN BECAUSE IT WOULD BE AN EASIER\niEEHGP. (THIS WAS ARMAND HUNTER'S OPINION ALSO, I BELIEVE.)\nThat was the proposal I told the CNO TV committee I would trans¬\nmit to my organization. X believe in this project wholeheartedly. I\nbelieve that funds o^uld be readily obtained for such a worthy project,\nand I feel that it is well within the realm of our organisation to\n©salat in th® general upgrading of educational and informational programs\npresented by national organizations. We certainly are interested in\nthe whole area of educational television, and it seems to ms that this\nis one way In which we-can significantly contribute to better programs.\nWe are Interested in seeing good educational programs appear on commercial\nstations, as well as our own educational stations, and the commercial\noperators would be more likely to woloom© organisational programs that\nare produced with a little more ^know-how. *\nI also mentioned to the CNO TV committee that several of our\nmambors were interested in holding TV workshop® for members of local\norganizations, such as th© Girl Scouts, League of Women Voters, etc.,\nthat will be using television. (This as a result of our workshop\nquestionnaire.)"
}