{
  "id": "d427-8",
  "text": "FRCM*\nMEMO TOs John Dunn\nHarry J. Skornia\nMarguerite Fleming\nJim Miles\nJim Macandrew\nJohn Henderson\nJ. J. Stillinger\nDATE* January 12* 1954\nSUBJECT* IERT\nThe first three persons mentioned will receive copies of Gertrude\nBroderick3 s letter of January 4 to Graydon Axumia, and Graydon9*\nJanuary 8 letter to me naming the three of you to be the NAEB IERT\nCommittee. The other three persons listed above are included here in\n▼lev of a statement by Gertrude Broderick that an AERT session would\nlike to be devoted to the sort of thing the School Broadcast Conference\nused to do* provide a demonstration of possible ia-sohool use of pro¬\ngrams* Would you three* particularly, please suggest programs that you\nthink might be suitable? Some of the programs which the people here\nthought might work, in radio* are 70EICX LA FRANCE, MEETING THE SITUATION*\nand MAKING FRIENDS WITH MUSIC. Would you please recommend what vqu think\nmight be used?\nComing back to the General Session of the IERT, our luncheon will be held\nApril 8. Would you* Jim, please handle this as Graydon suggests? Let ms\nknow if you want me to get a speaker. But 1 would like to know by Wednes¬\nday if I am to do this.\nWould you* Marguerite* be good enough to plan and supervise NAEB exhibits?\nLet me know what you need from Headquarters and m shall comply.\nTheodore Streibert, Director of the U.S. Information Agency* has already\naccepted my invitation to address the MEB-Planned General Session of the\nIERT Thursday Evening* April 8. The NAEB luncheon is scheduled for the\nsame day.\nBoard meetings are scheduled for April 5 and 6. A meeting room has been\nrequested for these two days for from 9*00 AM to 10*00 PM. I shall also\nreserve a suite in which NAEB Executive Committee and Directors can go\non meeting after 10*00 PM each evening.\nMore as developments occur. I shall be in touch with you to be sure our\naspects of the IERT are completed in time, and are outstanding.\nOne suggestion 1 would like from any or alls What possible £2 kinescopes\nor films might be shown at the AERT-Planned sessions of the sort Gertrude\nis interested in setting up?\nNAEB Executive Committee\nNAEB Directors\nJohn Holt\noos"
}