{
  "id": "d324-10",
  "text": "-2-\n2. Comments on the proposed amendments were received from\nthe petitioners, the NARTB an! ABC^/and from over 300 standard, FM,\nand television licensees and permittees and other parties concerned\nwith broadcasting* ' Only three parties, th& American Federation of\nMusicians, Charles V. Balthrope, President of KITE (AM) and KITE-FM,\nSan Antonio, Texas, and licensee of Station KENN, Kennedy, Texas, and\nRichard B. Blanchard, Jr,, of Hollywood, California, express opposition\nto the proposed amendments ©r their objective of relaxing present\nrequirements. Most of the parties urge the adoption of the NARTB\nproposal or its substance; but a number of parties recommend that the\nlanguage of the proposed amendment be clarified or modified in some\nrespects, as more fully discussed below. A few parties maintain that\nthe present mechanical recordation rules are adequate but that no\nharm would ensue from the relaxation of the rules as proposed, pro¬\nvided practical adherence to their requirements can be assured. Many\nof the parties favoring adoption of the amendment proposed by the NARTB\nstate that while they also favor the adoption of the proposed amendment\nto the waiver provision (Section 3.118(6)), the need for the waiver\nprovision would be eliminated by revising the mechanical reproduction\nrules along the lines proposed by the NARTB,\nNARTB COMMENTS\n3. In support of the proposed amendment, the NARTB agrees •\nthat the proposed amendment should also apply to Section 3.£83 (non¬\ncommercial. educational FM) as proposed in the Notice, and urges that\nthe argumaits presented in its petition warrant its adoption. In its\npetition the Association urged that the present rules governing mechanical\nreproductions are outmoded in the .light of the great strides .which have\nbeen made in the recording, transcription, broadcasting and telecasting\nfields, as well as the existence of a more sophisticated audience response.\nWhile the Association subscribes to the broad principle that the public\ninterest is best served by the elimination of industry practices delibera¬\ntely calculated to mislead or deceive the public in any way, it urges\nthat the present rules extend a protection neither warranted by the\nactualities of broadcasting nor in reality desired by the public. NARTB\nsubmits that there is little possibility of .deceiving the public by\ndeletion of the announcement that a broadcast is accomplished by means\nof mechanical reproduction, except with respect to those programs in\nwhich the element of time is of such special significance that the\nimpression or belief would be created in the.mind of the.public that\nthe event or program is, in fact, occurring simultaneously with the\nbroadcast. The Association concedes that newscasts, political speeches,\npanels, forums, news commentators and special events are vested with'\nsuch public significance and, in general, have gained such widespread\nlistener attention as to warrant the safeguard that, if broadcast\nthrough means of mechanical reproduction, .they should be announced as such.\n2/ ABC also .filed on June 1, 1956, a Petition for Expedited Action or\nInterim Relief which in light of our action here is now moot."
}