{
  "id": "d324-104",
  "text": "UL^ <f Mufa Vt\nFOR INFORMATION OF__\nLaw Offices\nDow, Lohnes and Albertson\nMunsey Building\nWashington 4, D*C.\nSeptember 16, 1954\nMr* Frank E, Schooley\nRadio Station WILL\nUniversity of Illinois\n119 Gregory Hall\nUrbana, Illinois\nDear Mr. Schooley8\nWe are enclosing a copy of a Notice of Proposed Rule Mbking (Docket No.\n11164), released September 16, 1954, ip<whifeJa the Camaisbfon proposes\nto revise its existing rules and policies regarding the construction and\noperation of television inter-citv/relay stations. In substance, the\nproposal is tc change the Rules amd Regulajdtons so that the Commission,\nAt its discretion and on an interim basi^f may authorize television\nstations to operate their own intercity relay systems in preference to\nusing expensive common caxrler^b^lities. The proposed rules are directed\nprimarily toward tho problem presenW Hv the application of the present\nregulations to television stations lqpatea in relatively small communities\nwhere the common carrier changes are hot in line with the economic prospects\nof those stations operating on a profitable basis.\nComments in cpitfSscTibri wl^h^the jpdposed Rules and Regulations must be\nfiled by Nowfeber 8, 1954. We relieve you might wish to file such comments\nand in all Probability, $ou have quite a good deal of information on hand\nwhich would] be of intcresjb to the Commission in connection tf.th this\nparticular proceeding. point out that it is likely that the proposed\nrules will oe vigorously/opposed by the common carrier companies and that,\ntherefore, thwsjjroba^jdfities of the adoption of the proposed rules would\nbe greatly increased if the Commission were to receive strong support\nfrom those members of the broadcasting industry whose interests are, or\nmay be, directly involved in this matter.\nWe would appreciate having the benefit of your views with respect to the\nCommission^ proposal, as set forth in the enclosure, and to know as\npromptly as possible whether you desire to have comments prepared and filed\non your behalf in that matter.\nend\nCopied NAEB Hq.\nSept. 28, 1954 jy\nCordially yours,\n/s/ Earl R, Stanley"
}