{
  "id": "d324-11",
  "text": "HAFTS maintains that no real benefit results from requiring programs\nin which the element of time and significance is not of special\nimportance to be announced as being mechanically reproduced since\nunder present conditions a mechanically reproduced program is often\nsuperior to a live program; the possibilities of deception are minimal;\nand such announcements serve only to disrupt program continuity and\nto irritate the public* HARIS submits that the public is more concerned\nwith technical quality and program content than with the method by\nwhich the programs are broadcast* -Idle the Association recognizes\nthat under its proposal the public may occasionally believe that a\nmechanically reproduced urogram is a live broadcast, it urges the\napplication of a rule of reason and that public interest considerations,\ninherent in ,fhigh program” content call for service to the public free\nfrom announcements of the obvious. ith respect to delayed programs\nin which the element of time is of special significance, NAH5EB contends\nthat broadcasters may be expected to present such programs in a manner\nand with such announcements as rill inform listeners adequately of the\ncircumstances. The Association notes that it approves the ABC proposal\nfor amending paragraph (a)(0of Section 3* 118 of the rules but that its own\nproposal rill achieve the results sought by ABC,\n4, The majority of the parties supporting the proposed\namendment advance arguments similar to those of HARIS* They also urge\nthat the mechanical recordation rules for Ah, F.., TV and noncommercial\neducational FA broadcast stations should be made uniform. They claim\nthat the present rules have become outmoded through technological\nadvances, industry growth and public acceptance and no longer serve\nany useful purpose where the element of timeliness is entirely\nimmaterial to the listener or viewer; that the value of such programs\nas news, sports events,weather reports, auction sales of live stock,\npolitical speeches, panels, forums, and those of an emergency nature\ndepend upon the time element involved and should be announced; and\nthat the proposed amendment recognizes the necessity of informing the\npublic of a mechanical reproduction when a ctuestion of timeliness is\ninvolved and contains adequate safeguards to insure that such programs\nare announced and that deliberate misrepresentation is prohibited. They\nstate that the present rules were adopted to prevent misleading the\npublic as to whether the broadcast was live or recorded at a time when\nlive broadcasting was the standard and mechanical reproduction program\nmaterial was technically inferior and constituted only a minor part\nof a station1 s program structure? that today the need for a distinction\nbetween live and recorded programs, except where a question of timeliness\nis material, no longer exists since recorded programming has reached near\nperfection, the majority of transcribed broadcasts are accepted by the\npublic in the same light as \"live” presentations, the bulk of a stationls\nprogramming is recorded, and the public^ awareness of programming\ntechniques is such that listeners could only be misled by deliberate\naction on the part of the broadcaster. It is pointed out that the"
}