{
  "id": "d324-19",
  "text": "*11-\nw\ntelieve to be warranted cover network programs transcribed and rebroadcast\none hour later because of the time differential resulting from the adoption\nof day3ight saving time in some areas and network programs delayed as much\nas three hours because of the time zone differences between the place where\nthe programs originate and where they are rebroadcast. Standard broadcast\nstations have been operating since 1947 under a provision in the AM mechanical\nrecordation rules waiving identification requirements to accommodate daylight\nsaving time differences and requiring in lieu thereof only a single daily\nannouncement as to all delayed network programs broadcast by means of tran**~\nscript ion for this reason. We believe that the daily announcement has proved\nto be adequate to identify such programs under the circumstances; and we have\ntherefore embodied the waiver provision in all the mechanical recordation rules\nand we have eliminated the requirement that the Commission be advised of any\nnetwork or station taking advantage of the waiver. Although consideration was\ngiven to the suggestion that the requirement of a daily announcement with\nrespect to programs delayed because of daylight saving time should be deleted\nentirely or should be required only where the time element is significant,\nwe are convinced that the daily announcement serves a useful purpose and that\nless confusion and less opportunity for misunderstanding will arise if it is\nmade applicable to all programs delayed because of daylight saving time,\nparticularly when it imposes no great burden on broadcasters. We also believe\nthat there is merit to the proposal of ABC to extend the daylight saving time\nwaiver to accommodate time zone differences, and the new mechanical recordation\nrequirements contain a similar waiver provision with respect to such broadcasts.\nIn light of our experience with the daylight saving time waiver and the long¬\nstanding practice of broadcasting stations to delay network programs to adjust\nfor the time zone in order to broadcast them locally at appropriate times, we\nbelieve that a requirement that each such program be separately identified is\nno longer necessary and causes needless program interruption and that a daily\nannouncement will suffice to identify all such delayed programs.\n17* Authority for the adoption of the amendments herein is contained\nin Sections 4(i), 303(f) and 303(r) of the Communications Act of 1934, as\namended.\n18. In view of the foregoing, II IS ORDERED, That effective\nNovember 7_, 1956, Part 3 of the Rules and Regulations IS AMENDED\nas set forth in the attached Appendix.\nFEDERAL COMMUNICATIONS COMISSION\nAttachment: Appendix\nAdopted; October 3, 1956 Mary Jane Morris\nSecretary\nReleased: October 8, 1956\nNOTE; Rules changes herein will appear in Amendment 3-33."
}