{
  "id": "d324-2",
  "text": "NAEB HEADQUARTERS\n14 Gregory Hall\nUrbana, Illinois\nOctober 29, 1956\nTO: ALL NAEB MEMBERS\nRE: FCC RULING ON IDENTIFICATION OF RECORDED PROGRAMS\nIn its public notice #36946, dated October 4, 1956, the FCC amended\nthe rules covering the identification of recorded programs. Furnished\nherewith is a digest of this order and the exact amendments.\nIn substance, these amendments relax the present AM, FM and TV iden¬\ntification requirements for recorded programs to require uniformly an ap¬\npropriate announcement, either at the beginning or conclusion of the\nbroadcast, only with respect to recorded programs or material in which the\nelement of time is of special significapce and the lack of an announcement\nmight create the impression or belief in the mind of the listener or viewer\nthat the event or program is, in fact, occurring simultaneously with the\nbroadcast.\nNo identification will be required for recorded programs one minute\nor less in duration, and waiver of the recorded announcement requirements\nwill be permitted when network programs are transcribed and rebroadcast\none hour later by stations on standard time during the annual periods in\nwhich daylight saving time is in effect and where network programs are\ntranscribed and rebroadcast at a later hour because of the time differen¬\ntial. Under the waiver provisions only a single daily announcement is\nrequired to identify all such programs transmitted for delayed broadcast.\nThere is no requirement that the Commission be advised by any network or\nstation taking advantage of either waiver.\nThe amendments make it clear that they do not require mechanically\nreproduced programs to be announced as such when the time element is not\nof special significance; they require only one identifying announcement\neither before or after the broadcast of recorded programs at the option\nof the licensee when the time element is significant.\nThe changes are, in general, along the lines of proposals of the\nNational Association of Radio and Television Broadcasters (NARTB) and\nthe American Broadcasting Co. (ABC). Hie proceeding was initiated Nov.\n16, 1955. It affects the AM rules (Sect. 3.118); TV (Sect. 3.653); FM\n(Sect. 3.288) and noncommercial educational FM (Sect. 3*588).\n1. Section 3*118 is amended to read as follows:\n§ 3.118 Mechanical reproductions. r\n(a) No mechanically reproduced program consisting of\na speech, news event, news commentator, forum,\npanel discussion, or special event in which the"
}