{
  "id": "d324-20",
  "text": "APPENDIX\nSection 3.118 is amended to read as follows:\nI 3.118 Mechanical reproductions.\n(a) No mechanically reproduced program consisting of a\nspeech, news event, news commentator, forum, panel\ndiscussion, or special event in which the element of\ntime is of special significance, or ahy othef-\nprogram in which the element of time is of special\nsignificance and presentation of which would create,\neither intentienally or otherwise, the toression or\n\"belief on the part of the listening audience that\nthe event or program being broadcast is in fact\noccurring simultaneously with the broadcast, shall\nbe broadcast without an appropriate announcement\nbeing made either at the beginning or end of such\nreproduction or at the beginning or end of the program\nin which such reproduction is used that it is a\nmechanical reproduction or a mechanically repro¬\nduced program: Provided, however, That each such\nprogram of one minute or less need not be announced\nas such.\nfaux—\n(b) The exact form of identifying announcement is not\nprescribed, but the language shall be clear and in\nterms commonly used and understood# Any other pro¬\ngram mechanically reproduced or series of mechanical\nreproductions, including a mechanical reproduction\nused for background music, sound effects, station\nidentification, program identification (theme music\nof short duration) or identification of sponsorship\nof the program proper, need not be announced as\nprovided in subsection (a), but the licensee shall\nnot attempt affirmatively to create the impression\nthat any program being broadcast by mechanical\nreproduction consists of live talent.\n(c) The requirements of subsection (a) are waived with\nresnect to network programs, transcribed and rebroadcast\nat a later hour because of the time zone differentials\nbetween the place, where the program originates and\nwhere it is rebroadcast, this waiver being applicable\nwhether the off-the-line recording is made by the\nnetwork itself at one of its key stations or by an\nindividual station, but only when the off-the-line\nrecording is for broadcast at an hour not exceeding\nthe time zone differential between the plane where\nthe program originates and where it is rebroadcast,\nEach station which broadcasts network programs at a\nlater hour in accordance with this waiver shall make\nan appropriate announcement at least once each day\nbetween the hours of 10:00 a.m. and 10:00 p.m.,"
}