{
  "id": "d324-29",
  "text": "- 6\nwarrant the provision of the proposed service9 then the pro¬\nposed Section 4,903 should be amended to provide that any low\npower television broadcast repeater station must protect not\nonly all existing operations, but all future television broad¬\ncast operations authorized by the Commission against inter¬\nference as defined in that Section, Unless such protection\nis explicitly written into the rules, it is very possible\nthat the creation of VHF boosters will result in an adultera¬\ntion of the Commissionfs Television Allocation Plan, which,\nin order to bring service to very small groups of persons, may\npreclude large numbers of persons from receiving adequate tele¬\nvision service, particularly from educational television\nstations,\n9, The NAEB recognizes that the Commission has a deep\nconcern about the potential harmful effects of booster opera¬\ntions in the VHF band. That provision of the proposed Section\n4.903^c) which attempts to subordinate the VHF booster opera¬\ntion to all other classes of television broadcast stations is\nobviously an attempt to minimize this potential harm. The NAEB\nis of the view, however, that such provisions as those just\nreferred to may prove ineffectual in achieving the desired\nresult. Whatever the legal status of VHF boosters might be\nunder the proposed rules, and whatever the rights thus created\nin the operators of such stations, it is clear that substantial\nsegments of the public may come to rely on the service rendered\nby VHF boosters. Those people will not be interested in the\nlegal status of the station on whose service they have come to\nrely, and there would undoubtedly be serious practical problems\nraised if a VHF booster operation were wiped out by interference\nfrom another station, particularly if the signal of the inter-\nusable one in the area receiving booster\nservice. In addition, it is probable that serious legal\nquestions would also be raised, despite the unequivocal pro¬\nvision in the proposed rules."
}