{
  "id": "d324-31",
  "text": "NAEB HEADQUARTERS\n14 Gregory Hall\nUrbana, Illinois\nExcerpt from FCC’s Amendment to Part 3 of the Commission’s Rules to extend CONELRAD\nto the Noncommercial Educational FM and the International Broadcast Services\nAccordingly, It Is ORDERED that Part 3 of the Commission’s Rules and Regulations\nBe AMENDED to include the rules set forth in the Appendix attached hereto, effective\nJanuary 2, 1957 or on such earlier date as the Commission, by subsequent Order,\nmay designate.\nAPPENDIX\n\"Change title of Subpart G to read ’CONELRAD FOR STANDARD, FM, AND TELEVISION BROAD¬\nCAST STATIONS’.”\nSUBPART H - CONELRAD FOR NONCOMMERCIAL EDUCATIONAL FM, AND INTERNATIONAL BROADCAST\nSTATIONS.\n3.1001 Scone and Objective\n(a) This subpart applies to all radio stations in the noncommercial educational\nFM and the international broadcast services located in the Continental U.S., and\nis for the purpose of providing for the alerting and operation of radio stations in\nthese services during periods of air attack or imminent threat thereof.\n(b) The objective of these CONELRAD rules is to minimize the navigational aid\nthat an enemy might obtain from the electromagnetic radiations from radio stations\nin the noncommercial educational FM and international broadcast services, while\nsimultaneously providing for a continued radio service under controlled conditions\nwhen such operation is essential to the public welfare.\n3.1002 Alerting\n(a) All radio stations in the noncommercial educational FM and the inter¬\nnational broadcast services licensed by the Federal Communications Commission are\nresponsible for making provisions to receive the CONELRAD Radio Alert Message and\nthe CONELRAD Radio All Clear. (As used herein the term \"licensed by\" includes every\nform of authority issued by FCC pursuant to which a radio station may be operated,\nincluding constructions permits, station licenses, temporary authorizations, etc.)\n(b) The CONELRAD Radio Alert will be initiated by the Commanding Officer of\nthe Air Division (Defense) or higher military authority.\n(c) The provision of an adequate receiver, to monitor any standard, FM or TV\nbroadcast station either by aural or by automatic means, during all hours of operation\nof noncommercial educational FM or international broadcast stations, will be con¬\nsidered as compliance with the requirements of paragraph (a) of this section. Other\nmeans of receiving the CONELRAD Radio Alert may be authorized by the Federal Com¬\nmunications Commission in special cases."
}