{
  "id": "d324-32",
  "text": "-2-\nNote: Every standard, FM and TV broadcast station will be notified of the\nRadio Alert by telephone calls or by radio broadcasts. Immediately upon receipt\nof the Radio Alert, each standard, FM and TV broadcast station will proceed as\nfollows on its normally assigned frequency:\n(1) Discontinue the normal program in progress.\n(2) Cut the transmitter carrier for approximately 5 seconds.\n(Sound carrier only for television stations).\n(3) Return the carrier to the air for approximately 5 seconds.\n(4) Cut transmitter carrier for approximately 5 seconds.\n(5) Return carrier to the air.\n(6) Broadcast 1,000 cycle (approximately steady state tone for\nfifteen seconds).\n(7) Broadcast the CONELRAD Radio Alert Mfessage as follows:\n•’We interrupt our normal program to cooperate in security and\nCivil Defense measures as requested by the United States Govern¬\nment. This is a CONELRAD Radio Alert. Normal broadcasting will\nnow be discontinued for an indefinite period. Civil Defense\ninformation will be broadcast in most areas at 640 and 1240\non your regular radio receiver.”\n(8) The CONELRAD Radio Alert Message will then be repeated.\nThe CONELRAD Radio Alert Message, as set forth in (7) of this note is worded\nin a manner suitable for reception by the public; however, the message is also the\nCONELRAD Radio Alert. When this CONELRAD Radio Alert Message is received, all\nlicensees must immediately comply with the CONELRAD operating procedure. The precise\nCONELRAD Radio Alert Message, above, will be broadcast only in the event of the\nactual Alert. In the event of a CONELRAD test or drill, broadcast stations will\nmake an announcement that a test or drill is taking place.\n3.1003 Operating During a CONELRAD Radio Alert.\n(a) Noncommercial educational FM broadcast stations, upon receipt of a CONELRAD\nRadio Alert, will interrupt the program in progress, and broadcast the CONELRAD Radio\nAlert Message as in subdivisions (7) and (8) of the note to Section 3-1002. The\nstation will then discontinue its carrier and maintain radio silence for the duration\nof the CONELRAD Radio Alert.\n(b) International broadcast stations, upon receipt of a CONELRAD Radio Alert\nwill interrupt the program in progress, may make a brief sign-off announcement not\nlonger than one minute, and, except for those stations specifically authorized by\nthe Federal Communications Commission to continue transmitting, stations in this\nservice will leave the air and maintain radio silence. Stations in the international\nbroadcast service permitted to continue transmitting will be individually authorized"
}