{
  "id": "d324-55",
  "text": ".. ^\nBefore, the •• 'wc ■\nFEDERAL COMMUNICATIONS COMMISSION\nWashington. 25, P. C. 25585\nIn the Matter of )\nAmendment of Parts 2 and 3 of the ) Docket No. 11559\nCommissions Rules and Regulations )\nto revise frequency allocations in )\nthe Territory of Alaska in the band;\n72-100 Me. / . )\nNOTICE OF PROPOSED RULE MAKING\n1. Notice is hereby given of rale making in the\nabove-entitled matter.\n2. On September 7, 1955, the Commission adopted an Order\n(FCC 55-931), effective October 12, 1955, in this proceeding, which,\nin part, amended Part 2 and Part 3 of the Commission’s Rules so as to\nreallocate in the Territory of Alaska only the frequency band 76-100 Me\nfor the exclusive use of Government radio services and the non-Government\nfixed service. Prior to the adoption of the above Order, this band of\nfrequencies was available for assignment to FM and TV broadcast stations\nin the Territory of Alaska.\n3’. Among the amendments adopted in the above Order, Sections\n3.203 and 3.20U of the Rules were revised so as to prohibit the assignment\nof frequencies for FM broadcast stations in the *3.1 Me through 99.9 Me\nband /Channels 201 through 260) in the Territory of Alaska. ^ Since the only\nfrequencies allocated for noncommercial educational FM broadcasting in\nSection 3.501 of the Rules are 88.1 Me through 91.9 Me, and those frequen¬\ncies are among those which have been reallocated in Alaska, there are now no\nfrequencies available for noncommercial educational FM broadcast use in\nAlaska.\nk» The Commission proposes to conform Section 3.501 with Part 2\nand Sections 3.203 and 3.20i±, as revised, and also to provide therein that\nthe frequencies allotted for commercial FM broadcast use in thev100.1-107»9\nMe band (Channels 261 through 300) will also be.available for noncommercial\neducational FM broadcasting in Alaska. To date, no FM broadcast assignments\nhave been made in Alaska, and wo.are of the view that this band of frequen¬\ncies can accommodate all the commercial and noncommercial educational FM\nbroadcast assignments which may be required in Alaska, in the future."
}