{
  "id": "d324-56",
  "text": "-2-\n5. In view of the foregoing, it is proposed to amend Section\n3.501 cf the Commission’s Rules as follows:\n(a) Insert the paragraph designator (a) after the\ntitle of Section 3.501.\n(b) Add a new paragraph (b) to read as follows:\n(b) In the Territory of Alaska, the fre-\nr . 4 quency band 88-100 Me is allocated\nto Government radio services and the\nnon-Government fixed s'ervipe only.\nThe frequencies 88.1 Me through 91.9\nMe (Channels 201 through 220, inclu¬\nsive) will not be assigned in the\nTerritory of Alaska for use by non¬\ncommercial educational FM broadcast\nstationsj however, frequencies in\nthe 100.1-107.9 Me band (Channels\n261 through 300, inclusive) will be\nassigned for such use.\n6. Authority for the issuance of the proposed amendment is con¬\ntained in Sections U(i), 303(c), (g) and (r) of the Communications Act of\n193U, as amended.\n7. Any interested party who is of the opinion that the amendment\nproposed should not be adopted, or should not be adopted in the form set forth\nherein, may file with the Commission on or before January 2, 1956,\na written statement or brief setting forth his comments. Comments in support\nof the proposed amendments may also be filed on or before the same date.\nComments or briefs in reply to the original comments may be -filed within 10\ndays from the last day for filing said original comments or 'briefs. No. addi¬\ntional comments may be filed unless (l) specifically requested by the Commis¬\nsion or (2) good cause for the filing of such additional comments is estab¬\nlished. The Commission will consider such comments before taking final\naction in this matter, and if ary comments appear to warrant the holding of\na. hearing or oral argument, notice of the time and place of such hearing or\noral argument will be given.\n7. In accordance with the provisions of Section I.76I4. of the Com¬\nmission’s Rules and Regulations, an original and lit copies of all statements,\nbriefs, or comments shall be furnished the Commission.\nFEDERAL COMMUNICATIONS COMMISSION\nMary Jane Morris\nAdopted: November 30, 1955 Secretary\nReleased: December 5, 1955"
}