{
  "id": "d324-59",
  "text": "-3-\n7. In our Notice of Rule Making in this proceeding we pointed out\nthat on-channel boosters represent one method of providing uriserved areas\nwith television and that the authorization of such boosters was the subject\nof a separate rule-making proceeding (Docket No. 11331). In that proceeding\ncareful consideration will be given to the feasibility of authorising\nboosters., in addition to translators* as a means of providing service to\nisolated communities* as suggested by the above parties. We are now ready\nto take final action on translators. The public interest would not be\nserved by withholding this means of bringing service to isolated communities\nuntil all problems in the booster proceeding can be resolved. We wish to\nemphasize* further* that in authorizing translators at this time we are\nin no way prejudicing any action we may take in the booster proceeding,\n8. WSM, Inc.* Western Slope Broadcasting Company* Inc. (KFXJ-TV)*\nGrand Junction* Colorado* Archer S. Taylor* Missoula* Montana* C. J.\nCommunity Services* Inc.* the Washington State TV Reflector Association and\nCongressman Magnuson urge that translators should not be restricted to the\nlU upper UHF channels. They argue that these frequencies may not be well\nsuited for translators because of \"ghosting” reflections. Receivers for\nreception on these channels* they contend* are marked by lack of sensitivity\nand stability and by a high noise level. The difficulties encountered in\noperating on these frequencies and the lack of suitable equipment are re¬\nferred to; and it is argued that such operation would be very expensive.\nThe parties submit that a VHF transmitter would not require conversion of\noutstanding sets and at the same time would provide a superior service.\nThey argue that VHF translators would be cheaper than UHF and* therefore*\nwould make it economically possible to provide more multiple services to\nisolated communities. It is accordingly suggested that all UHF channels\nand the VHF channels should be made available for translator use.\n9. W'e believe the above proposals that translators be authorized\non VHF channels and all UHF channels are unsound. They overlook the fact\nthat only by confining translators to the less congested top li|. UHF chan¬\nnels can we find a sufficient number of channels meeting the required protec¬\ntive spacings* and generally relax: operating and licensing requirements to\nmake the authorization of translators possible. Also* VHF translators would\nrequire extensive engineering measurements to determine interference with\nexisting stations and the use of such channels would be highly inefficient\nwhen considered in terms of the overall frequency allocation requirements.\nMoreover* we are convinced that Channels 70-83 are com¬\npletely adequate to meet the needs of the translator service. With respect\nto the contentions that suitable'equipment for operation on Channels 70-83\nis lacking* Adler Electronics has represented that equipment is now ready\nfor type testing. We are confident the television industry can furnish low\ncost equipment to provide satisfactory translator service. While UHF\nequipment at- this stage in its development may be sqmewhat more expensive\nthan comparable VHF equipment* and UHF translators will necessitate the\npurchase of UHF receivers or conversion of outstanding sets* these dis¬\nadvantages are more than offset by the fact that only by confining trans¬\nlators to this band can the operating requirements be sufficiently relaxed\nto make translator operation economically feasible in small communities."
}