{
  "id": "d324-61",
  "text": "-5-\n13. Jerrold Electronics Corporation, Philadelphia, Fa,, also\nproposes a combined use of translators and community antennas, Jerrold\nsubmits that there are many areas where the cost of establishing community\nantennas may be prohibitive and that translators would not solve the problem\nin such areas because of insufficient financial support. Jerrold contends\nthat since anyone could receive the transmissions of a translator without\ncost merely by procuring a receiver, there is no. well established method\nfor -supporting them. Jerrold proposes a combination translator and community\nantenna system, with the translator used to provide, the link between the re¬\nceiving antenna site and the cable distribution terminal of the community\nantenna system. Translators would be employed to beam the signals from the\npoint at which originating signals can be received to the center of the\ncommunity, where they would be distributed by means of a conventional com¬\nmunity antenna system. Jerrold submits that under its plan, the translator\nwould provide an economic means of bringing television signals to the centers\nof population and thus of providing a means of financia.1 support.\n111.. The Commissions proposal contemplates that translators will\noperate on the top Ik UHF channels, which have been allocated for broad¬\ncasting. Translators will function as broadcast'stations, with their\ntransmissions intended for reception by the general public. We do not be¬\nlieve that we would be warranted in authorizing translators, operating on\nbroadcast frequencies, to function as a part of a point-to-point communica¬\ntion service in conjunction with community antennas. The proposals for com¬\nbined use of translators and community antenna systems/ involve difficult\nquestions of basic policy, some of which are before the Commission in other\nproceedings. The public interest would not be served by delaying the es¬\ntablishment of translators until those questions can be resolved, and the\nproposals for combined use of translators and community antennas are being\nrejected at this time, k/\n15, On February lU, 1956, Lenkurt Electric Company, San Carlos,\nCalifornia, filed a petition for amendment of Part 18 of the Rules or,\nalternatively, for reallocation of the 890-9U0 He band to the‘common carrier\nfixed service. On April 2l±, 1956, an engineering study was submitted in\nconnection with this petition, 5/Two of four alternative proposals advanced\nk/ To the extent that it can be accomplished under the Rules as adopted\nherein, a community may use a master antenna‘to which individual television\nreceivers are connected by cable in lieu of individual receiving antennas for\nreception of the signals of a television translator station. It is expected\nthat arrangements of this sort may be used to serve small \"shadowed\" areas in\nindividual communities where a line-of-sight transmission path from a suit¬\nable translator site to all parts of the community cannot be found. However,\nsuch stations may not be operated so as to deliberately preclude direct re¬\nception in areas where such direct reception is feasible,\n5>/ This study was accompanied by a petition .for acceptance of late comments\nin the present proceeding. It is urged in support of this petition that the\npreliminary studies leading to formulation qf the engineering study had not\nbeen completed at the time comments were due in the present proceeding, and be.\ncause the effect of the study on this proceeding could not then be ascertained,\nit was not possible to file, timely comments. Since it appears that the late\nfiling was not due to lack of diligence, and will not adversely effect expedi¬\ntious disposition of this matter, the petition for late filing is granted."
}