{
  "id": "d324-64",
  "text": "-8-\"\n* 22'. The .rules-as proposed require' applicants to list all other\ntranslators within a 30^r.iile radius. RSTi'-IA suggests that this requirement\nbe relaxed to' specify -other translators within 15 miles of the .proposed\nstation* urging that this represents a more realistic figure with relation\nto possible interference.' We believe this suggestion has merit and it is\nbeing adopted by deleting' the provision from, the rules and incorporating\na requirement for data within lp miles in the.application form.\n23. Sylvania suggests that Section U.702(c) as proposed be\nclarified to indicate that \"channel assignments*' as used therein means\nthe'channel assignments whether or not in use. This entire provision has\nbeen revised in order to clarify.its meaning.\n2lu Several parties advance suggestions for an increase in the\nmaximum power output of translators above the 10 watts proposed. The\nWashington State TV Reflector Association recommends 31.6 watts; the\nCitizens of Flathead Valley* Montana, suggest '60 watts; and WSH proposes\n100 watts. Upon carefully considering the foregoing suggestions., we have\nconcluded that the 10 watt maximum power requirement should be retained\nuntil data based on actual experience with translators operating under a\nvariety of conditions is obtained. Such data will demonstrate whether the\nmaximum power now authorized is adequate, or whether more power is necessary\nor desirable. The experience obtained in this initial stage will also assist\nus in evaluating the possible effects that increased power might have on\nother translators and other services. In retaining the 10 watt maximum,\nwe point out that no limit is placed on the maximum effective readiated\npower which may be achieved by translators through the use of horizontally\nor vertically directive transmitting antennas. The use of such antennas\nwill make it possible to concentrate the signals in areas intended to be\nserved.\n23'. RETMA and Sylvania suggest ‘that the proposed rules should be\nmodified to specify that spuriotis emissions, including radio frequency\nharmonics should bo attenuated no less than 60 db below the visual power\nof the translator. They maintain that the standards as proposed would\ntend to increase the cost of the operation, thereby d sfeating- the purpose\nof translators. We believe this, proposal has merit and the rules are\nbeing revised accordingly.\n26, Sylvania submits that the proposed frequency tolerance of\nplus or minus 10 kc, or plus or minus 1 kc, if. offset, is unduly restric¬\ntive since at the highest translator frequency a 10 kc tolerance would re¬\nquire the frequency to be held to .0011$; and Sylvania suggests that the\ntolerance requirement be relaxed to plus or minus 0.01%. Sylvania urges\nthat there is no commercial equipment available at reasonable prices for\nachieving such a tolerance as that proposed, Sylvania also submits that\noffset carrier operation is unnecessary since in light of the low power\nemployed, there should be little inter-translator interference. Upon.our\nstudy of the foregoing comments, we have concluded that the frequency\ntolerance proposed may be unneessarily rigorous, and we are reducing the\nrequired tolerance to .01% a.s urged. We are also deleting all provisions\nrelating to offset carrier operation, Individual licensees, however, may, by\nmutual agreement, employ offset carrier techniques to meet unusual inter¬\nference problems within the broader tolerance adopted."
}