{
  "id": "d324-65",
  "text": "-9*\n27. WSM submits that Section lu 763(a) should be revised so\nthat each applicant for a translator would be required to show that he\nhas permission to rebroadcast programs sufficient to meet the minimum\noperating requirements of Section 3.651 of the Commission1s rules\ngoverning regular television stations. We believe that this suggestion\n.might unduly restrict the development of translators in this developmental\nstage and it is net being adopted,\n28. Western Slope suggests that responsibility for identifying\nthe call letters, frequency and location of translators should be placed\nwith the originating station, and thst such identification should be re¬\nquired only at the start and end of the originating station*s broadcast day.\nWestern Slope contends that the proposed aae of Horse Code for station\nidentification would interrupt program service and annoy viewers and that,\nbecause of the limited range of translators, would be of little value for\nmonitoring purposes. We see no need for altering the proposed requirements\nfor station identification. We find little likelihood that these require¬\nments will result in any undue hardship to the translator operator or\nannoyance to viewers since the identification breaks of the translators\nwill generally coincide with those of the originating station. Furthermore,\nwe do not believe that identification of translators by the originating\nstations would be practical, and such a procedure would hamper monitoring\noperations.\n29. Section b.731(b)* as prqposed, provides that a change in\nthe identity of the station being bebroadcast should, to the extent\npracticable, be accomplished at such times that interruption or incomplete\nretransmission of individual programs will not result. M0sby»s,Ino.\n(KGVO-TV), Missoula, Montana, suggests that this, requirement be deleted\nas unnecessary, urging that the-provision attempts to compel an operator by\nrule to employ his best judgment in the operation of a station. This pro¬\nvision has been clarified and the language‘objected tc by Mosby*s, Inc. has\nbeen deleted.\n30. Sylvania suggests that Section 14.734(a) should be modified\nto include the same restrictive provisions as contained in Section U.766(a)\nwith regard to the grade of commercial operator license required in order to\nmake the two provisions consistent. We believe this suggestion has merit,\nand the rules are being' revised to make it clear that holders of a tem¬\nporary limited radio telegraph second class license or an aircraft radio¬\ntelephone authorization cannot be in . charge at the translator control point.\n31. Section 1*. 734(d) of the proposed rules would require that\nobservations of the signals transmitted by a translator be made at least\nonce each hour. Sylvania, Western Slope and Archie S. Taylor maintain that\nthis requirement would be unduly burdensome and is unnecessary inasmuch\nas all apparatus will be type tested and presumably capable of stable\noperation. They point out that since translators may operate from 12 to 16\nhours per day, the proposed requirement would entail employment of at least"
}