{
  "id": "d324-70",
  "text": "- 3 -\nthat short tost transmissions may bo made during the period of suspended\noperation to check the efficacy of remedial measures.\n(c) In each instance where suspension of operation is required,\nthe licensee shall submit a full report to the Commission after operation\nis resumed, containing details of the nature of the interference, the source\nof the interfering signals, and the remedial steps taken to eliminate the\ninterference.\nADmim ISTj.Lai IVE PRGCSPl'RE\n§ 4.711 Administrative procedure. See Sections 4-11 to 4.23\ninclusive.\nLICENSING POLICES\n§ 4.731 Purpose and permissible service, (a) Television broadcast\ntranslator stations provide a means whereby the signals of television broad¬\ncast .stations may be retransmitted to areas in which direct reception of such\ntelevision broadcast stations is unsatisfactory due to distance or interven¬\ning terrain barriers.\n(b) 4 television broadcast translator station may be used only\nfor the purpose of retransmitting to the general public, on one of the\nchannels provided herein, the signals of a television broadcast station, or\nof another television broadcast translator station operating on a channel\nother than the one on which the retransmission is made. The retransmitted\nsignals shall not be significantly altered as to content or technical\ncharacteristics other than in frequency and amplitude.\n(c) 4 television broadcast translator station may retransmit the\nsignals of different television broadcast stations or different television\nbroadcast translator stations during different periods of its operation in\norder to provide programs best suited to the needs of a particular community.\n(d) Retransmission of the signals of any station shall be made only\nin accordance with the provisions of Section 4*784.\na television broadcast translator station may be issued to any qualified\nindividual, organized group of individuals, broadcast station licensee, or\nlocal civil governmental body upon an appropriate showing that plans for\nfinancing the installation and operation of the station are sufficiently\nsound to insure continuation of the operation for the period of the license,\n(b) more than one television broadcast translator station may be\nlicensed to the same applicant whether or not such stations serve sub¬\nstantially the same area, upon an appropriate showing of need for such\nadditional stations.\n(c) Only one channel will be assigned to each television broadcast\ntranslator station. Additional television broadcast translator stations"
}