{
  "id": "d324-72",
  "text": "- 5 -\n(5) The transmitter and its associated controls shall\nbo so installed and protected that they arc not\naccessible to other than duly authorized persons,\n(b) In the event that the control point is not continuously manned\nby a qualified operator, the transmitter shall be equipped with suitable\nautomatic devices which will place it in an inoperative condition when no\nsignal is available for retransmission. In addition to the automatic and\nmanual controls, a television broadcast translator st at ion may be turned' on\nand 'off by a time snitch.\n(c) If remote control is proposed at a new tL.1^: vision broadcast\ntranslator station, the application for construction permit shall be\naccompanied by a shoring as to the manner of compliance pith the above\nconditions. Any proposal to change a television broadcast translator station\nfrom direct control to remote control shall be submitted in the form of an\napplication for modification of existing authorization accompanied by the\nabove shoring of compliance*\n§ 4*735 Pcvcr limitations, (a) 4 television broadcast translator\nstation \"ill not be authorized to operate pith, transmitter power output in\nexcess of the rated power output of the transmitter and in no event shall\nthe rated peak visual power output of the transmitter, be in excess of 10 watts. The\npower output of a television broadcast translator station is considered to\nbe the product of the direct current and voltage applied to the plate circuit\nof the final radio frequency amplifier multiplied bv on efficiency factor\nsupplied by the manufacturer,\n(bJ No limit is placed upon the effective radiated power \"!hich may\nbe obtained by tho use of horizontally or vertically directive transmitting\nantennas. .\nI 4,736 Emissions and bandwidth* (a) The license of a.television\nbroadcast translator station authorizes the transmission of the visual signal\nby amplitude modulation (a5) and the accompanying aural signal by. frequency\nmodulation (F3)*\n(b) Standard width tel .vision channels '.ill be assigned and the\nemissions of a television broadcast translator station shall be confined to\nthe authorized channel in accordance with the Television Technical Standards\ncontained in Part 3> Subpart 2 of this chapter,\n(c) Spurious emissions, including radio frequency harmonics, more\nthan 3 ale above or below the upper and lower edges, respectively, of tho\nassigned channel shall be attenuated no loss than 60 decibels below the visual\ntransmitter power. Greater attenuation will be required if such spurious\nemissions cause interference to any radio service."
}