{
  "id": "d324-97",
  "text": "■5-\nVIII. PRACTICALITY OF PLAN\nThe basic principle underlying the microwave relay system described\nherein is already in operation in Wisconsin. This is the principle of\npicking up television frequencies (including both sound and picture signals),\nconverting them to microwave frequencies, relaying them to a second tele*\nvision station and converting them again to television frequencies.\nStation WEAU-TV, Eau Claire, gets its network programs in this manner\nfrom Station KROC-TV, Rochester, Minnesota0 Signals from KROC-TV on Channel\n10 are picked up on a receiver at a point approximately 25 miles southwest\nof Eau Claire, converted to microwave frequency and then relayed to WEAU-TV,\nwhere they are converted back to television frequencies and transmitted over\nChannel 13*\nThis principle of pick-up and rebroadcast on different frequencies is an\nessential feature of the state FM network, tested and proved by years of\nsuccessful operation.\nThe relay plan contemplates use of certain towers of the Motor Vehicle\nDepartment's relay system to support the television microwave antennas in\nreturn far MVD use of FM radio towers at Delafleld and Chilton, as well as\nother mutually advantageous arrangements. Considerable savings would result\nfrom such cooperation^\nIX. FCC RULES AM? REGULATIONS\nPresent rules of the Federal Comuunications Commission \"permit privately-\nowned microwave links to be used for connecting local and remote studios\n(including studios in other cities) to the TV transmitter with which the\nstudios are associated, so it is possible to plan educational TV operation\nof this nature with likelihood of approval.\" This is an opinion by C. M.\nBraum, formerly on the engineering staff of the FCC, now Engineering Consul¬\ntant, Joint Committee on Educational Television, Washington, D.C.\nMoreover, the FCC has before it a petition requesting relaxation of its\nrules pertaining to inter-city relay stations and has invited comments and\nproposals from interested parties. In its announcement of September 16,\n195U (Public Notice 10851) the FCC has indicated a concern about situations\nin which the usual conditions and charges may deter the development of\ntelevision services.\nIn view of these considerations and others, such as the extensive use of\nprivate microwave relay systems by pipe line companies and other utilities,\nit is expected that public agencies dedicated to education and public\nwelfare will be given the necessary authorization to provide microwave relay\nservices as described herein,.\nSource of Microwave Relay Information and Estimates: Glenn Koehler, Professor\nof Electrical Engineering, University of Wisconsin; author, \"Circuits and\nNetworks,\" college textbook being published by The Macmillan Company, Novem¬\nber, 195a; co-author, \"Ultra High Frequency Techniques,\" D. Van Nostrand & Co.;\nauthor, section on Audio Frequency Amplifiers, \"Radio Engineering Handbook,\"\nMcGraw-Hill; Technical Director, Wisconsin State Radio Council."
}