{
  "id": "d1062-1",
  "text": "2\nJ\nTHIS PUSHBOTTQN TYPE OF RECEIVER\nWithin recent months certain manufacturers of radio receivers have been marketing\nsets of the pushbotton type with no manual control. The Northern California Broad¬\ncasters Association has taken definite action in an effort to get manufacturers to\ndiscontinue this type of set. What think you of this action? Perhaps this topic\nshould be discussed and perhaps action taken at the fall meeting.\nMARK ETHRIDGE RETIRES AS NAB HEAD\nDid you read his message as retiring president? You should! I presume it was mailed\nto all radio stations.\nEDUCATION BY RADIO IN FORUM\nA provocative editorial on Education by Radio by Henry Goddard Leach appears in the\nJune FORUM and CENTURY. In it you will find praise for Walter Lemmon and W1XAL.\nYou will find it worthwhile to read it.\nORDER YOUR COPY NOW\nIf proceedings of the Second National Conference on Educational Broadcasting are to\nbe printed, more copies must be sold. Pre-publication price is $2. If you wish a\ncopy of the proceedings of the meeting held in Chicago, send your order to Mr. C. S.\nMarsh, Executive Secretary, Second National Conference on Educational Broadcasting,\nc/o American Council on Education, 744 Jackson Place, Washington, D. C.\nWSUI RECEIVES SPECIAL AUTHORITY\nThe FCC has granted WSUI, State University of Iowa, permission to reduce its hours of\noperation to a minimum of nine hours daily instead of the unlimited time in order to\nobserve the summer vacation period.\nWSAJ SUSPENDS OPERATION\nFCC has granted WSAJ, Grove City College, Grove City, Pa., permission to suspend oper¬\nation from June 15 to September 22 because of the summer vacation.\nKOAC REDUCES SCHEDULE\nKOAC, Oregon State Agricultural College, Corvallis, has been granted permission by\nthe FCC to operate from 8 a.m. to 2:50 p.m. and from 6:50 to 8:00 p.m. during July\nand August Instead of unlimited time as licensed.\nKWSC RECEIVES SPECIAL PERMISSION\nIn line with grants to other educational stations, the FCC has given KWSC permission\nto wave rule 151 and reduce hours of operation during the summer months."
}