{
  "id": "d1200-0",
  "text": "NE.WS NA6LB GETTER\nN AKONAL ASSOCIATION - EDUCATIONAL BROADCASTERS\nFrank E. Schooley, Editor, Station WILL, Urbana, Illinois\nOctober I, 1941\nRADIO AND DEFENSE: ON WNYC\n•‘for the instruction, enlightenment, entertainment, recreation and\nWELFARE OF THE INHABITANTS OF THE C8TYo.e»H\nIn PROVIDING INSTRUCTION, ENLIGHTENMENT AND IN THE DIRECTION OF\nWELFARE FOR THE CITIZENS OF METROPOLITAN NEW YORK, THERE IS NO\nGREATER DUTY FOR WNYC TODAY THAN AN ALL-OUT NATIONAL DEFENSE PRO¬\nGRAM.\nMayor F. h. LaGuardia, sn his capacity as Director of Civilian De¬\nfense, USED WNYC TO MAKE THE FIRST ANNOUNCEMENT OF THE ALUMINUM\nCollection Campaign in New York City on July 16. From that time un¬\nis l THE CAMPAIGN WAS OVER, WNYC WAS IN THE FOREFRONT, THE MUNICIPAL\nSTATION STAFF PREPARED ANNOUNCEMTNTS TO BE USED NOT ONLY BY WNYC,\nBUT FOR ALL STATIONS THROUGHOUT THE CITY.\nIn THE CAMPAIGN FOR REGISTRATION OF VOLUNTEER AlR RAID AND FlRE\nWardens, WNYC also used every facility to help.\nDuring the week the New York municipal station takes to its listeners\nA COMPLETE PICTURE OF THE NAT I ON8 S NATIONAL DEFENSE PROGRAM, PRESENTED\nARE PROGRAMS AND INFORMATION ABOUT JOBS IN DEFENSE INDUSTRY,. SELECTIVE\nSERVICE INFORMATION, NEWS ABOUT NATIONAL DEFENSE PROGRESS, INFORMATION\non what New Yorkers can do to help the program, and six da sly news\nBROADCASTS OF UP-TO-THE-MINUTE DETAILS OF AMERICA8S DEFENSE EFFORTS.\nComplete coverage of the events of the National Defense Exhibition at\nGrand Central Palace is one of the station\"s featured programs. The\nSERIES WILL RUN FOR THE DURATION OF THE EXHIBITION, SEPTEMBER 20 TO\nOctober 20, The daily programs are being devoted to particular ex¬\nhibits AT THE SHOW INCLUDING TWO BY THE FIRE DEPARTMENTS, A TALK ON\nBLACKOUTS BY CHIEF ENGINEER NlCHOLAR KELLEY OF THE DEPARTMENT OF WATER\nSUPPLY, AND TALKS ON DEFENSE BY MEMBERS OF THE POLICE DEPARTMENT, THE\nRed Cross, the American Women8s Volunteer Service, the Anti-Waste\nKitchen, and other defense organizations.\nMINUTES EACH WEEK-DAY DURING OCTOBER.\nOn October 6, WNYC will inauguarate a series of\nprograms on ’’Economics"
}