{
  "id": "d1200-4",
  "text": "NAEB NEWS LETTER\n-5-\nOCTOBER I, 1941\n15. Programs of Interest to Women, KFKU.\n16. University of Kansas News Letter, September 27, 1941.\n17o School Broadcast Conference announcements.\nI8o WILL radio programs, October-November, 19410\nW R U L PLANS EXPANDED PROGRAM\nPlans to “try to break the German people away from the yoke of Nazi ism”\nBY MEANS OF”INTENSIFI ED” RADIO BROADCASTS FROM AN AMERICAN SHORT WAVE\nSTATION THAT IS BESIGNED TO BE THE MOST POWERFUL IN THE WORLD, HAVE BEEN\nDISCLOSED BY WALTER S. LEMMON, PRESIDENT OF THE WORLD WIDE BROADCASTING\nFOUNDATION.\nFounder of station W R U L, which now is the strongest short wave unit in\nTHE WESTERN HEMISPHERE, LEMMON SAID THE FEDERAL COMMUNICATIONS COMMISSION\nHAD AUTHORIZED THE ESTABLISHMENT OF NEW TRANSMISSION FACIBITIES THAT WOULD\nEVENTUALLY ADD ANOTHER 100,000 V'ATTS OF POWER TO THE FOUNDATION^ RADIO\nARM,\nHE SAID HE KNEW OF ONLY ONE OTHER SHORT WAVE STATION, A RUSSIAN ONE, THAT\nWOULD APPROACH IT IN POWER, AND DECLARED IT WOULD BE MUCH STRONGEa THAN\nH|TLER*S RADIO VOICE AT ZEISENv\nDeclaring plans already had been made to ’’double oir broadcasts within\nSIXTY DAYS TO THE GERMAN PEOPLE AND TO THE GERMAN-SPEAKING PEOPLE IN\nOCCUPIED COUNTRIES,” HE ADDED* ”UP TO NOW, OUR BROADCASTS TO THE GERMANS\nHAVE BEEN MAINLY DIGESTS OF NEWS, BUT NOW, WE * RE REALLY GOING TO MAKE A\nDRIVE TO REACH THE PEOPLE AND SHOW THEM WHAT THEY HftVE LOST IN CULTURE\nUNDER THE HITLER REG I ME .”\nKFKU RESUMES BROADCASTING\nOn THE STROKE OF THREE IN THE AFTERNOON, MONDAY, SEPTEMBER 29, KFKU\nRESUMED ITS SEVENTEENTH YEAR OF BROADCASTING TO THE RADIO AUDIENCE OF\nKansas and neighboring states. Programs have been arranged for all ages\nAND INTERESTS.\n“America in Crisis” will be the theme of this year’s University of Kansas\nRoundtable dicussions. Some of the topics, listeo for the next two months\ninclude: ”Hitlerss Strength if Russia Loses;” “Our Relations with Russia;”\n“After Convoys—What?”; ’’The Federal Tax Bill of 1941;” “Price Fixing;”\nand “Extending Social Security for Farm Labor.”\nThe department of English is sponsoring three programs from station KFKU,\nThese are designed to help listeners to become better acquainted with new\nBOOKS AND TO INTRODUCE (OR RE-INTROOUCE) THEM TO SIGNIFICANT PIECES OF\nLITERATURE WHICH ARE A PART OF OUR CUffyURAL HERITAGE.\nAnother new feature to be presented from KFKU this year is the Speaking\nro Women program which will discuss many consumer problems pertinent to\nOUR_ PART.I CULAR REGION--SUQH AS PURCHASING, HEALTH AND NUTRITION, TEXTILES,"
}