{
  "id": "d1344-0",
  "text": "N A £ S NEWS LETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nA, James Ebel, Editor, Station Hill, Urbana, III*\nDecemser lf 1944\nCOMMISSIONER WALKER ON TELEVISION\nA TREMENDOUS EXPANSION OF RADIO AND TELEVISION AFTER THE WAR, WAS EN¬\nVISIONED by Federal Communications Commissioner Paul Atley Walter in an\nADDRESS WHICH CLIMAXED A THREE-DAY REGIONAL RADIO CONFERENCE AT STEPHENS\nCollege in Columbia, Missouri.\n“Radio after the war will revolutionize and improve American industry\nAND THE POSTWAR EXPANSION SHOULD BE F8NANCI ALLY PROF I TABLE TO BOTH\nINDUSTRY AND LABOR, * HE SAID. 15 8 F DEMOCRACY IS TO ENDURE, IT IS IM¬\nPERATIVE THAT WE KEEP A FREE RADIO. If WE ARE TO HAVE A BALANCE OF\nCONTROL, WE MUST HAVE EFFECTIVE GOVERNMENT REGULATION OF THE RADIO IN¬\nDUSTRY, WHICH IS ONE OF THE BEST SAFEGUARDS AGAINST POLITICAL CONTROL.*\nTo BE EFFECTIVE, THE SYSTEM MUST HAVE MANAGERS WHO ARE MORE THAN DOLLAR-\nMINDED— WHO WANT RADIO TO BRING MAXIMUM SOCIAL BENEFITS, HE SAID.\nKFKU FEEDS TWO SHOWS TO KANSAS STATE NET\nTWO QUARTER-HOUR PROGRAM SERIES, “YOUR KANSAS GOVERNMENT* AND “KANSAS\nUnlimited,* originating in the studios of KFKU, the University of Kansas\nSTATION, WILL BE CARRIED WEEKLY 8Y THE KANSAS STATE NETWORK, BEGINNING\nNovember 9, Stations KFB1, at Wichita; KSAL, Salina; WH8„ Kansas City;\nKVGB, Great Send; and KTSW, Emporia are the Kansas stations carrying these\nBROADCASTS. The PROGRAMS HAVE BEEN WORKED OUT IN COOPERATION WITH OFFICIALS\nOF THE STATE GOVERNMENT AND MEMBERS OF THE KANSAS INDUSTRIAL DEVELOPMENT\nCommission. The “Your Kansas Government* series was arranged through\nW. E. Turrentine, executive secretary to the Governor; and “Kansas Un¬\nlimited” WAS PREPARED IN COOPERATION WITH Ee LONG, SECRETARY—DS RECTOR\nof the Kansas Industrial Development Commission.\nCURRENTS AT WORK ON WKAR\nAs A GUIDE TO WISE SELECTION OF ELECTRICAL APPLIANCES AND EQUIPMENT, A\nNEW SERIES OF PROGRAMS ON WKAR HAS BEEN ARRANGED TO INFORM THE CONSUMER\nOF DESIRABLE CHARACTERISTICS TO BE SOUGHT IN MAKING HIS PURCHASES.\nThe series, titled “Currents at Work for You,\" is to be heard each Monday,\nWednesday and Friday at Is46 p.m. on the Michigan State Station. The\nDRAMATIC EPISODES REVOLVE AROUND THE EXPERIENCES OF THE Farm SERVICE\nAdviser, who is known in every Michigan county. Written by J« Kenneth\nRichards, the programs will tell about wiring, motors, washers, milkinq\nMACHINES AND EVERY OTHER ELECTRICAL APPLIANCE.\nCONGRESSIONAL SESSIONS TO BE RECONSTRUCTED\nThe public is scheduled to hear what goes on in the halls of Congress.\nA New York radio station, WMCA, has announced that, beginning December\nthird, IT WILL BROADCAST CONGRESSIONAL PROCEEDINGS AS RECONSTRUCTED FROM\nTHE CONGRESSIONAL RECORD. The PROGRAM WILL BE PRESENTED BY PROFESSIONAL"
}