{
  "id": "d1344-3",
  "text": "NAEB NEWS LETTER\nPage 4..\nDecember l, 1944\nIncidentally, too, Dave (Call me Jack Armstrong) Owen spent one year at\nTHE UNIVERSITY TEACHING SP0ECH IN THE *20’so Hg LEFT THE UnIVER8«TY TO\ngo to Northwestern, where he stayed a year or two, and then went into\nCOMMERCIAL RADIO WITH BLACKETT, SAMPLE, AND HuMMERT, A COUPLE OR THREE—\nOR MAYBE MORE—YEARS AGO, DaVE RETURNED TO THE UNIVERSITY WITH A PROF¬\nESSORIAL TITLE IN THE DEPARTMENT OF SPEECH TO TEACH RADIO SPEECH COURSES.,\nTmAT^ THE STORY ON BROADCASTING AT THE UNIVERSITY OF MICHIGAN AS SEEN\nTHROUGH TME EYES OF THE NAEB PRESIDENT* FOR ADDITIONAL OETAILS, INQUIRE\nof Waldo Abbot* Additional copies, Waldo, of this News Letter are\nOBTAINABLE FOR A FEE.\nNext month, don*t forget, we8ll recount our findings on our visit with\nBob Coleman at Michigan State in Past Lansing,\nMUSiC FEATURES ON WNYC\nLooking over the wealth of program publicity from WNYC impresses one\nWITH the MANY FINE MUSICAL FEATURES BROADCAST BY THAT STATION. JUST TO\nMENTION A FEW, THERE ARE THE BROADCASTS FROM THE Fr|CK COLLECTION CHAMBER\nMusic Series featuring world famous instrumentalists, the Public Library\nConcerts, the National Orchestral Association orchestra, the John Harmes\nChorus, the New York City Symphony with Stokowski, and the New York City\nCenter Opera Company, the Childrens Opera Company, and the Brooklyn\nMuseum Concerts. Regular features of these programs are artists such\nas George Copland, Alexander Schneider, and Leopold Stokowski, Morris\nwe congratulate you on this fine array of talent and at the same time\nWE ENVY YOU.\nLETTER TO THE EDITOR\nMy dear Mr. Ebel: Kindly notice that formality. Mm looking through\nMY LAW BOOKS FOR THE CORRECT FORM TO USE IN SUING YOU FOR LIBEL. *N\nyour Newsletter of November 1st you refer to me as “The inimical Waldo\nAbbot of Michigan.” According to Webster9s Dictionary, the word inimical\nis defined as “unfriendly, hostile, having the disposition of an enemy,\nantagonistic.\" This statement of yours has done great damage and injury\nto me on the University campus which will give me ample opportunity to\nprove damages, unless satisfactory apologies are forthcoming.\nI should know that an engineer shouldn4t be expected to look up defini¬\ntions of words. Outside of this one error, congratulations on the\nNewsletter and your new job. !t is my intention to call you worse things\nsometime in the future. Cordially yours, Waldo Abbot (£ditor’s\nnote: I object. The author of all but one item in the last News Letter\nwas hizzhonor the president. You should know that words like that are\njust not found in an engineers vocabulary. Thanks for the congratulations\nANYWAY.)\nECHOES OF THE FCC ALLOCATION HEARINGS\nThe Allocation Hearings that started September 28, J944 ended November 2,\nLASTING A TOTAL OF 24 DAYS. The RECORD CONTAINS NEARLY 5,000 PAGES IN\naddition to 529 exhibits. More than 200 witnesses from all branches of\nTHE RADIO INDUSTRY TOOK PART, EDUCATION MADE A FINE PRESENTATION OF"
}