{
  "id": "d1344-4",
  "text": "NAEB NEWS LETTER.„PA0E .. ,0£CEMBE* I, 1944\nTHEIH NEEDS AND SHOULO FARE WELL IN THE FINAL ALLOCATION® The DECISION\nON THE ALLOCATIONS IS EXPECTED TO 3E MADE SHORTLY 0\nMAJOR PROBLEMS JO BE SETTLED BY THE FCC WITH THE ASSISTANCE OF ALL THE\nTESTIMONY ARE 5 (I) SHOULD FM BE IN THE VICINITY OF 50 MC OR 100 MC; (2)\nShould television start operation with present standards, should tele¬\nvision WAIT FOR DEVELOPMENT OF a FINER PICTURE USING MUCH HIGHER FRE¬\nQUENCIES, OR SHOULD BOTH SYSTEMS BE AUTHORIZED; (3) SHOULD FACSIMILE BE\nASSIGNED TO SEPARATE CHANNELS OR MULTIPLEXED; AND (A) WhaT AND HOW MUCH\nSPACE SHOULD BE SET ASIDE FOR AVIATION, POLICE, AND OTHER EMERGENCY\nSERVICES. NO ONE CAN ENVY THE TASK OF THE FCC IN THESE MATTERS BECAUSE\nTHEIR DECISIONS WHICH WILL DETERMINE THE FUTURE OF THE WHOLE FI ELO OF\nRADIO, ARE BOUND TO BE UNPOPULAR IN MANY QUARTERS« \\\nIn ADDITION TO THE MANY EOUCATIONAL PRESENTATION REPORTED FROM THE\nHEARINGS, THE STATEMENT MADE BY MORRIS NoVIK ON FACSIMILE IS WORTHY\nof notee While much time was spent on the worthwhile service facsimile\nCOULD DO FOR THE FIRE AND POLICE SERVICES OF A LARGE CITY, YET HE MADE\nA GOOD POINT FOR ITS POSSIBLE EDUCATIONAL USES® Th»S PART OF HIS TESTI¬\nMONY BACKS UP THE STATEMENTS MADE BY CaRL M£nz£r FOR NAEB ON THIS SUBJECT®\nTHIS AND That\nMlCHIGAN9S TENTATIVE FM NET PLANS SHOW COVERAGE OF THE STATE WITH FOUR\nHIGH POWER STATIONS® MENZER IS WORKING ON STATE NET PLANS AS ARE WE\nHERE IN &LLINOIS. \\f YOU HAVE ANY STATE NET INFORMATION PASS IT ALONG\n,,.,Nat Erwin, who specializes in practically everything, including\nCocker Spaniels, has a pet program on WNAD now,,,„A glance at the WNAD\nPROGRAMS SHOW MANY INTERESTING LIVE SHOWS® HOPE WE CAN GET SOME INFORM¬\nATION ON THEM,o«oHeARD W0S8S SWELL MORNING PROGRAMS WHILE IN tOWA A\nwhile back. Brought back memories of my youth when as a grade school\nRADIO BUG 5 LISTENED TO Andy8S MUSIC Shop ON WOf ANO CaRL MenZER®S\nBASKETBALL BROADCASTS ON WSUI THIS News LETTER SEEMS LONQ, DON *T\nWORRY, l LL TAPER OFF, KEEP ON SENOlNG IN THE INFORMATION, I *M\nCLEANED OUT NOW.\nFCC ACTIONS\nUniversity of New Mexico applied for non-commercial educational station\non 42,100 KC with 250 Watts,\nUniversity of Iowa granted extension on their FM construction permit\nto 7-16-45,\nUniversity of Oklahoma applied for Non-Commercial educational station\non 4S*300 KC with 3 KW0\nFULLER TO COfriS BACK BY CHRISTMAS\nCaptain Henry\ncoming back to\n\"Fred* Fuller has stopped playing\nPLAY WITH THE ORGAN AT WHA0\nWITH BOATS AND 18\nWord has just been received that WHA8s music o*rector-on-leave has\nTURNED IN THE SHIP HE * 9 BEEN COMMANDING wD0WN UNCCfc*, AND EXPECTS TO\nBE BACK HOME BY THE HOLIDAYS,"
}