{
  "id": "d1695-1",
  "text": "NAEB HE®S LETTER\nPage 2*,.......*....* January I? 1944\nCity's Station WNYC at 8;00 p.m* on Monday evenings, beginning January 3o\nThe title is based on the fact that every 40 seconds? on the average, a\nNew Yorker enters a hospital as a patient*\nListeners will be invited to ask questions, voice complaints? and describe\nINTERESTING HOSPITAL EXPERIENCES FOR TREATMENT IN EITHER THE DRAMATIC OR\nINTERVIEW PORTIONS OF FUTURE PROGRAMS® JOHN H0 HAYES, ADMINISTRATOR OF\nLenox Hill Hospital? will be interviewed as the hospital authority on the\nFIRST PROGRAM, AND WILL ANSWER QUESTIONS COMMONLY ASKED OF HOSPITAL PEOPLE•\nRADIO NEWSWR1TING AWARD DEADLINE FEBRUARY I\nSigma Delta Chi is accepting nominations for the 1943 professional award\nfor RADIO NEWSWRITING up to February I*\nNominations — All Awards? except for Courage in Journalism are offered\nto individuals on the basis of specific examples of work done by Americans\nand published or broadcast in the United States during the period of\nimiAHX kiifim 2££EHa&a. 2L. m\nNominations need not be mads on any specific form; but each must be\naccompanied by a clipping {manuscript in radio division) with the name\nof the author, name of publication or broadcasting station, and date of\npublication or broaocast* Also, a statement revealing the circumstances\nunder which the assignment was fulfilled should accompany the nomination?\nPROVIDING THE CIRCUMSTANCES WERE OF SSGNIF5CANCE* No manuscripts or\nclippings will be returned*\nNominations ano accompanying material must be received by February I, 1944,\nAND SHOULD BE ADDRESSED TO o\nProfessional Awards Committee\nSigma Delta Ch§\nSuite 1384-86\n35 £ast Wacker Drive\nChicago I? Illinois\nThe AWARDS proper consist of bronze medallions with accompanying certi¬\nficates*\nNOTES FROM AND ON THE GANG\n8URT0N PAULU, Manager WL8, Minneapolis, writes? \"When I sent you information\nabout WLB’s Minneapolis Symphony broadcasts for the year? i didn’t have\navailable quite all of the data which was determined later* As things\nstand now? we are broadcasting a total of sixteen concerts by the orchestra\nthis year* There are three children’s concerts in Minneapolis? three in\nSt* Paul, and ten Sunday afternoon concerts for adults*\" (For the life of\nme, I can’t find at this moment the original communication, but, if found,\nWILL INCLUDE IN THE NEXT NEWS LETTER* JUST DECIDED I WOULDN’T LEAVE THIS\nOUT . )\nHAROLD INGHAM, Director, KFKU, writes? \"For a short time preceding the\nSchool Broadcast Conference in Chicago last month, 1 seriously considered\nthe possibility of attending for at least a day or two* Unfortunately,"
}