{
  "id": "d1695-1",
  "text": "Master Antenna\nDistribution System\nInstallation Procedures\nObviously, existing buildings not so equipped constitute an immedi¬\nate major problem. It is in this area that these practical sugges¬\ntions specifically apply.\nEvery television receiver requires a certain level of signal energy\nfrom the antenna to permit it to function properly and convert this\nstimulus into distinguishable images. An antenna source capable of\nsupplying many times the necessary threshold signal level for a\nsingle set could be channeled or distributed to a number of receiv¬\ners, each utilizing its necessary portion of the signal output. This\nis the principle underlying the master antenna approach. The distribu¬\ntion arrangement is similar to the conventional power wiring setup\nin which plug-in outlets are available in all strategic room locations.\nTwo distinct adaptations of this system are in current use. The first\nis an outdoor antenna oriented for the most efficient pickup of the sta¬\ntions involved, and connected to an electronic amplifier (see illustra¬\ntion). In this way the signal strength can be raised to any reasonable\nlevel. From this central amplifier location, cables are run to outlets\nin the various viewing rooms. This setup gives optimum results; but\nit is comparatively costly, requires proportionately greater mainten¬\nance, and must be powered by the regular lighting circuit during the\nhour s that the school is in operation. The installation and engineering\nof this type of master antenna is relatively complex, and may be\nsomewhat beyond the endeavors of the novice.\nThe alternate system is a feasible approach to the problem. It re¬\nquires less expense to maintain and operate and is much more\nsimple to install. First, it is necessary to install a high-gain tele¬\nvision antenna on the roof or atop a mast. (See illustration) Gen¬\nerally, the higher the antenna, the stronger the pickup. Where a\nreasonably good signal is obtainable the operation of four receivers\nfrom a single antenna is practical. It is recommended that a stacked\narray (several separate antennas connected together on the same\nmast) be employed for increased pickup if the location can supply\nonly a moderate signal.\nIn the event that the signal strength level in a particular location is\nnot enough to drive as many receivers as desired, it is then neces¬\nsary to install a second antenna with its own lead-in and distribu¬\ntion system. Thus, a school with three separate antennas can op¬\nerate several television receivers simultaneously from each an¬\ntenna. Although more antennas are involved than with the system\nemploying the electronic amplifier, this may still result in a saving\nin cost.\nA practical way of locating and orienting a television antenna on a\nschool roof, when special test equipment is not available, is to bring\na small television receiver up on the roof, and connect it as for nor¬\nmal operation. It will be necessary to furnish a power extension\ncord to the receiver site. The cord can be plugged into an outlet on\nthe top floor and drawn through a skylight or an open window. After\nhooking up the test set with a long lead-in from the antenna, raise\nthe antenna in the air on a 10-foot pipe held in the hands. With this\narrangement the mobile antenna is \"walked\" to various locations on\nthe roof. Some areas will prove much more effective than others"
}