{
  "id": "d420-10",
  "text": "Oregon State System of Higher Education\nDIVISION OF CONTINUING EDUCATION\nDIVISIONAL RELATIONS\ninformation services January 27, 196£\n220 Agricultural Hall\nUniversity Campus\nCorvallis, Oregon 97331\nMr. Harold E. Hill\nVice President\nNational Association of Educational\nBroadcasters\n131*6 Connecticut Avenue\nWashington, D. C.\nDear Hal:\nMany thanks for your letter of January 8, regarding the Region VI\nmeeting at the Western Radio and Television Conference scheduled for\nnext month at the Sheraton Hotel in Portland.\nWe are delighted to know that you are going to be in Oregon and\nlook forward to having an opportunity of talking and working with you\nduring the sessions and during the time in which you are looking over\nthe facilities in the city of Portland for the national NAEB convention.\nI note that Luke Lamb has asked me to sit in on a meeting on the\n16th, and I will be most happy to do so. Of course we are all plugging\nfor the 1967 NAEB convention in Portland. I am confident the gang could\ndo a wonderful job for you.\nAs to the Region VI meeting at the WRTC in February, it has been my\nexpectation that those of you from the national office and from the\nvarious regional organizations (radio, television, instruction, and\nindividual) would be taking the program times under your wing developing\nthe actual content. I would be happy to name anyone or all four of your\nregional directors to be chairman of the evening meeting and I am assuming\neach one will take that role in the sectional meetings on Friday morning.\nYou have already received a letter from John Crabbe written back on\nDecember lUth in which he was predicting that the Thursday evening session\nwould be engineered by someone from headquarters and John expressed the\nhope that Vernon Bronson would be available to assist in the session for\nindividual members. He also expressed doubt that there would be suffi¬\ncient interest in the individual member section on Friday morning that\nmost of the subjects of interest to individual members of the KAEB would\nhave been covered in the regional meeting on Thursday night. How do you\nfeel about this?\nDivision of Continuing Education Serves the state of Oregon Through Facilities and Resources of Colleges and Univer¬\nsities of the Oregon State System of Higher Education, and in Cooperation with Other Educational and state agencies.\nimi"
}