{
  "id": "d420-104",
  "text": "A Report on the\nEDUCATIONAL TELEVISION AND RADIO CENTER\n(to NAEB Regional Meeting)\nby\nDr. H. K. Newburn, President\nI am pleased to talk with you here in Eugene. I do not think I need to\nconfess, however, that I am not going to add very much to your technical knowl¬\nedge in the area of radio and television. Perhaps, instead, I can give you,\nbriefly, some of the underlying educational thinking which has gone into our\nplans for the Educational Television and Radio Center.\nI told Mr. Starlin, when he passed along Mr. Miller*s invitation for me\nto speak tonight, that I would be glad to accept if I could do so in an in¬\nformal manner, and if I could take advantage of the opportunity to gain as\nmuch from you as I might be able to give. I say this because, as all of you\nknow, the NAEB was one of the organizations instrumental in the establish¬\nment of the Center, and we are building upon a sound and well-established base\nin educational radio developed by many of you people.\nThe Center is an independent, non-profit, educational corporation. I use\nthe word independent advisedly because although our resources come from the\nFund for Adult Education we operate as a separate unit, responsible to our\nown Board of Directors. I think this is one of the most important things\nwhich I can mention because it is pretty generally misunderstood over the\ncountry.\nI am afraid many people, for example, feel we have unlimited funds and\nthat we are going to employ a staff of somewhere in the neighborhood of two\nor three thousand people. At least, that would be the conclusion one might\ndraw from the mail which we have been receiving. Such is not the case, how¬\never, and the Center*s financial resources are in reality quite limited.\nAs to our Board of Directors, we are highly pleased with the broad rep¬\nresentation which it provides. It is made up not only of leaders in the\nfield of education, but of representatives from business and the professions\nas well. There *s a banker on the Board, an outstanding lawyer, a leading econo¬\nmist, and, of course, a representative from your own ranks, Dick Hull.\nOn the financial side, the Center has funds for overhead operations for\nabout four years and for programming for approximately three years. Thus far,\nthe original source of funds has been the Fund for Adult Education, an inde¬\npendent organization created by the Ford Foundation. Both the Fund and the\nFoundation, however, have taken the view—which I fully support—that the\nCenter should not become primarily associated in the minds of people with any\nparent organization, but should attract financial and other support from a\nmuch broader base. Thus, we are hoping, over the years, to find additional\nsources of support to balance out the aid which we presently have. That the\ncorporation eventually will become, in a sense, self-supporting is the hope\nof those who have organized it. This raises a problem of serious implications\nto all of us here."
}