{
  "id": "d420-123",
  "text": "9 o p *\nHAEB members for Region VI will meet in Eugene, Oregon on October 16-17,\n1953 according to Allen Miller, HAEB Director for the region which includes eight western\nstates and the Territory of Hawaii* Station KMX of the University of Oregon will serve\nas the host institution* The host committee consists of Glenn Starlin, KV’AX, Chairmen}\nPatricia L« Green, Station KBPS, Portland Public Schools and James M* Morris, Station\nKOAC, Oregon1 s state-owned station*\nDelegates frost Arizona, California, Hawaii, Idaho, Montana, Nevada, Oregon,\nUtah and Washington are to meet for registration at 9 am on October 16 in the new Union\nBuilding on the campus «f the University of Oregon where all of the meetings are to be\nheld except those utilising television equipment. The latter will be held in the radio\nand television studios of the University of Oregon*\nNational headquarters will be represented by Graydon Auszans, WUGA, President*\nDr* Harry J* Skomla, Executive Secretary; and Frank Sehooley, WILL, Treasurer. After\nreports on the affairs of HAEB and on the condition of educational radio and television\nin other parts of the country, the meeting will follow the example of previous regional\nmeetings by concentrating on a group attack on common problems and by exchange of experiences*\nWhile group activities will be emphasized addresses have been scheduled by\nDr* Harry K* Newborn, Director of the Educational Television and Radio Center of Ann Arbor,\nMichigan on plans for the Center* by Dr. John R. Richards, Vice-Chancellor of the Oregon\nState System of Higher Education on mobilizing ©ODsmmity interest in educational television j\nand by Dr* Alburey Castell of the University of Oregon on social and philosophical Im¬\nplications of mass media*\nMeeting periods will extend from 10 am on October 16 until adjournment at 5 pm\non October 17* Transportation is via United or West Coast Airlines, Southern Pacific\nRailroad, or U* S. Highway 99.\n(copy mad© Oct. 14, 1953)"
}