{
  "id": "d420-25",
  "text": "Flemming\n3\nNot long ago I was testifying before the House Committee on Education and Labor )on the\nelementary and secondary education bill. One provision of the bill gives to the Commissioner\nof Education authority to establish criteria which could have a major impact on the way in\nwhich elementary and secondary education develops in this country. I was asked by a member\nof the ^ommittee whether I thought the Congress should write into the law its ideas of the\ncriteria that should be promulgated. I responded in the negative. I said that I felt it was\nbetter for the Congress to delegate this authority to the Commissioner of Education. I\nrecognized that it would be possible for the Commissioner of Education to abuse that delega¬\ntion of authority. I said that whenever that takes place - if it does take place - it is then\nincumbent upon the members of the educ ational community and the friends of education to\nappeal his decision as far as they can within the executive branch, and, if they do not get\nrelief, to go to the appropriate committee of the Congress and ask for relief. Our system\nof checks and balances can be utilized in such a way as to protect our basic freedoms in all\nwalks of life, but it will not operate to protect those freedoms unless we are willing to become\ninvolved in the operations of government, to express ourselves and to call for action when we\nfeel that action is required.\nThere is one other relationship between the field of education and this whole issue of involve¬\nment to which I would like to call attention. I believe that education must do more than it has\ndone and is doing to educate students for involvement in the life of our day. Let me cite two\nexperiences to point out what I have in mind.\nLast summer the United States Public Health Service gave a grant to the student government\nof the University of Oregon to enable 15 students to participate in the programs of county\nhealth departments here in the State of Oiegon that are carried on in the migratory labor\ncamps. I spent a day visiting those camps and talking with the students who were partici¬\npating in the program. At the end of the day as I reviewed the conversations that I had\nwith the students I was struck by the number of students who said to me - \"As a result of\nthis experience I have decided to change my vocational objective. And when I return to\nthe University in the fall, I am going to follow quite a different course of study than I\nwould have followed if I had not had this experience.\"\nTwo days later I attended a meeting of the Advisory Council of the PeaosCorp in Washington.\nDuring the course of the day Mr. Shriver made it possible for us to listen to six persons\nwho had invested two years of their lives in the Peace Corp in other countries and who were\nback at PeaosCorp headquarters. I also had the opportunity of sitting beside a returned Peace\nCorp volunteer at a luncheon. Here again I was .struck by the fact that four out of the seven\nwith whom I had the opportunity of coming in contact said, \"As a result of my experiences\nin the Peace Corp I have changed my vocational objective. I am going back-(some of them,\npersons who had finished, they thought, their formal educational program) to an educational\ninstitution in order to obtain the training that I will need in order to meet my new vocational\nobjective.\"\nIn other words, those University of Oregon students who participated in that migratory labor\nproject, the Peace Corp volunteers who spent two years serving others in other countries\nlearned by doing something. They had experiences which provided them with insights that\nno educational institution is capable of providing in a convincing manner.\nI have also been very much aware of the fact that we have developing in all of the communities\nof our nation increasing demands for persons who are trained to serve in what we have come\nto think of as community service occupations. This is a job classification that the Department\nof Labor is beginning to recognize. Those who use it are thinking of occupations in both the"
}