{
  "id": "d420-28",
  "text": "Flemming\n6\nnational sovereignity in order to avert it. The other group regard nuclear force primarily as\na form of advanced military weaponry at the call of the national sovereign state. \" We may\nagree or we may disagree with Mr. Cousin's classification„ Are we willing to become involved\nin discussions that revolve around an analysis of this kind? Are we willing to look at what may\nbe some of our built-in prejudices in the light of a world that has been changed by nuclear power?\nAs I read the accounts and as I listen to the broadcasts of what is going on in Viet Nam at the\npresent time my mind goes back to the days when I served as a member of the National Security\nCouncil,, I know something about the kinds of briefings that are taking place around the National\nSecurity Council table. As a result of the briefings to which I have listened, I believe that we\nshould in season and out of season become involved in explorations that are designed to open up\nsome pathways that we might be able to travel that would not lead to a nuclear war.\nI am wondering what we think of the current discussions relative to the United Nations. Is this\nsimply an argument over whether or not Soviet Russia and France should pay their dues and what\nwould happen to them if they do not pay their dues? Of course it isn't that simple. It is far\nmore involved than that. As I have listened and read about these discussions my mind went\nback to my days in college when I was an inter collegiate debator and in those days one of the\nfavorite topics for debate was - Resolved that the United States should cancel the war debts.\nThere were those who just simply would look at the question and say, \"Well, why should we?\nWe loaned them the money, why shouldn't they pay it back to us?” I am sure there are those\nwho look at this issue involving the United Nations and say, \"They owe it, don't they? They\nought to pay and if they are not going to pay it, they ought to be thrown out, one or the other.\"\nAnd yet there is far more at stake than that. As far as the future is concerned are we willing\nto become involved in the kind of thoughtful discussion that tends to open up for us what is\ninvolved in this particular issue and then are we willing to join those who believe that we must\nleave no stone unturned to preserve an effectively functioning United Nations? This world of\nours cannot survive a nuclear war. Somehow or other we've got to become involved in these\nissues to the point where we find a way out.\nOne other area is the field of religion. We face some interesting issues in this area in our\ncountry. Here again we are inclined to stand on the side lines rather than become involved.\nThe Supreme Court of the United States again has presented us with one of those issues in its\ndecision saying that under our Constitution students in our public schools cannot be put in a\nposition where they are forced to either observe or participate in services of worship. Some\npersons became concerned over that decision. Personally I feel that it was a sound decision\nboth from the standpoint of constitutional law and from the standpoint of sound policy. I do\nnot want the government to compose prayers which a school board orders a teacher to offer\nin the classroom. That is not the proper function of government by any means. But I\nrejoice in the fact that Justice Clark in one of the decisions after making it clear that com¬\npulsory prayers and Bible reading in the public schools'were in conflict with the Constitution,\nwent on to make it clear that the public schools not only had the right but he thought, and the\nCourt thought, an obligation to provide the students in our public schools with the opportunity\nof learning something about religion. For many, many years because of the uncertainty and\nthe controversy revolving around worship services at the opening of the school day, we have\ndeveloped an attitude on the part of persons in public education at all levels which in effect\nhas said - look, if you want to stay out of trouble you just stay clear away from religion.\nThe Supreme Court has now made it clear that under the Constitution of the United States it\nis perfectly legal to offer courses about religion. How many courses are being offered about\nreligion in our elementary and secondary schools and in our public institutions of higher\nlearning? Not very many. For many years we have been in the process of developing\ngeneration after generation made up of a large percentage of religious illiterates. We are\nstill in the process of doing that."
}