{
  "id": "d420-85",
  "text": "Castell -6-\nin what you want to say. These very things which make less than fifteen minutes\ntoo little, make more than thirty minutes too much. If you are working your\nlistener as hard as he has a right to expect, don't ask him to stay with you be¬\nyond thirty minutes. Demand close listening; but don't demand it for more than\nthirty minutes, because you won’t get it. (2) Presuppose as close to nothing as\nyou can. Supply what your listener has to have to follow you. This may cramp\nyour style; but put up with the cramps, if you want listeners. This is not to\"\nsay that your listeners are ignorant. They aren’t; but they don’t have your spe¬\ncialized knowledge and they haven't given as much thought to your topic as you\nhave. Your language is esoteric. Your information is esoteric. Your pattern of\nthought is esoteric. These are obstacles to be overcome. (3) Don't attempt\n\"academic serials.\" Assume that you are playing a one-night stand, even if\"you\naren't. A studio is not a class room. When you dismiss a class on Monday there\nis a reasonable presumption that it will return for more on Wednesday and Friday.\nYou cannot assume that about a radio audience. Whatever your point is, you must\nget it across here and now. You cannot say \"This will become clearer as we pro¬\nceed\", or \"your outside reading will development my point for you.\" (3) Do not\nseek to edify or exhort. There is nothing wrong with edification or exhortion;\nbut they are not your assignement. Your business is to interest, to inform, to\nclarify, to challenge, to criticize, to invite minds to range wider and deeper,\nto raise questions of principle, to point out presuppositions. These are the\nstock-in-trade of academic broadcasting. They are worth going after for their\nown sakes. You are an academic, not an ecclesiastic or a politician. ‘This does\nnot mean \"be cynical\", or \"be neutral on everything\", or \"be coldly impersonal.\"\nIt means consider your listeners as minds or intellects to be informed, not as\nwills to be shaped or souls to be saved. (10 Remember always that you are not\naddressing a captive audience. This is one of the small number of ways in which\nthe studio differs crucially from the class-room. You may lose touch with your\nstudents but normally they continue to sit there. They can't tune you out. Un¬\ntil the bell rings there is little they can do about you. But you don’t have that\nkind of hold one your radio audience. They don't have to stay with you; and, what\nis more, they don't have to pass your tests. With them you are up against free\nmen. You must keep it coming and keep it good. (£) Remember also, that between\nyour mind and the minds you are addressing there is only your voice and their ears.\nThis is another crucial difference between studio and class-room. In a manner of\nspeaking, your listeners are stone blind. What difference would it make to you in\nclass if your students were all blind? The force of this analogy was brought\nhome to me once when I had a blind boy in class. I accosted him one day in the\ncorridor and asked \"How are things coming on? Everything alright?\" He said \"As\nwell as can be expected.\" The tone of his voice led me to say, \"What do you mean,\n'As well as can be expected'?\" \"Well,\"he said, \"all I can do is hear your voice.\nI can't see your face. I can't see what you put on the board. Vihen you draw dia¬\ngrams or jot down phrases—and you do a lot of that—I lose touch. In fact, being\nin class is something like listening to the radio.\" He made my point in that\nlast remark."
}