{
  "id": "d420-94",
  "text": "-6-\nI am glad to see that the folks thought that the number of programs offered on\nthe Network was okay. I had long felt that the Network programs should occupy\nsomewhere between £ and 10% of the operating schedule. I know that in many\ncases they occupy far more but I am sure that with a station operating over 50\nhours per week, Network programs do not occupy more than this. Here at TtfBAA,\nit»s closer to the $%>, as I am sure it is at WSC and a number of others. The\ncurrent offering contains about as many programs as stations can assimilate.\nOn the other hand, it*s about as many as can be culled from the number which\nare offered to Headquarters regularly.\nThe editing problem is one that can be whipped. One of the best ways to\noperate anything of this nature on a mechanical basis is to do it at one place\nwith one man. He can catch the obvious discrepancies in time; he can take care\nof the mechanics of getting the proper introduction, of getting enough infor¬\nmation for publicity, of getting the proper times. He, however, cannot do the\nanalysis that might be done by one of the other methods you suggested unless\nhe happens to be a very unusual person. Therefore, while this tends to look\nvery good mechanically it has some drawbacks from the aesthetic point of view.\nIf you get this aestheticism by having a number of stations listen and criti¬\ncally analyze each Network program before it is offered, you get yourself into\nan almost impossible detail-weighted position. I think our past experience\nwith attempting to produce programs by a committee leads us to believe that\nonly broad policies must be set down by the Committee and these must then be\nleft to an executive to handle in the manner which best fits. Of course, send¬\ning it around to the member stations to do \"for free\" helps the budgst but\nthe numerous details frighten me. I was happy to note that you finally arrived\nat the position that Network programs were better than when the Network started\nnearly four years ago, and that they will certainly get better every year the\nNetwork operates."
}