{
  "id": "d420-99",
  "text": "•11-\ncontact with a man in our subject field before. I wish that every NAEB sta¬\ntion could have such an experience with such an individual,\n9) NATIONAL SCRIPT EXCHANGE. This certainly is an old clinker. You\nwill remember in the first grant-in-aid project we thought we had an answer\nto this problem when one of the grantees asked for money to select scripts and\nto publish a book of them. These scripts were not barn burners perhaps, —\nthey were good, and they were used, I am sure, in a great number of places.\nThey were edited well, production notes were in good shape and they were free\nfrom copyrights and so forth. Nevertheless, the membership just did not like\nthe idea and I fear will never like the idea of exchanging scripts. I»ve had\nyoung producers here take apart scripts written by established veterans, and\nsay that they were just so much pap. Perhaps this is pure ignorance, but may¬\nbe too it means that we have our own way of expressing ourselves. The only way\nis for each to write his own or cause them to be written for us with our ideas\nspecifically in mind. I am afraid that we at WBAA did not produce airy of the\nprograms that were written under that grant-in-aid. We still have the scripts,\nmaybe someday we* 11 find them better than we had originally thought. I know\nthat we would have nothing to contribute to a national script exchange and I\nhave yet to see very many scripts that I would like to pick up and try to uti¬\nlize on a regular basis from another NAEB member.\n10) SHOULD THE NAEB CONTINUE TO BE IN THE PRODUCTION BUSINESS? This has\nalmost gone down the river. It is certainly true that it takes facilities to\nmake such production possible. Facilities indicate need for large capital in¬\nvestment. Therefore, it seems to me that the grants-in-aid are about as far\nas we can go in this direction. The grants enable us to use the already exist¬\ning facilities a little more than they are being used at the moment. It will\ntake someone with a lot of money to set up facilities equivalent to some of"
}