{
  "id": "d920-62",
  "text": "Item 7\nSeptember 2k, 19^7\nDr. Burton Paulu\nPresident, NAEB\nUniversity of Minnesota\nMinneapolis, Minnesota\nDear Burton:\nThe Operations and Development Committee met twice in conjunction\nwith the recent ETV Station Managers Seminar at Allerton House. A\nquorum was present and, since Harry Skornia had to leave the Seminar,\nHarold Hill attended the meetings representing Headquarters.\nThe results of the meetings are described in the enclosed which\nwas sent to the complete committee membership for comment and cor¬\nrection. In addition, in order to insure accuracy, a copy was for¬\nwarded to John Schwarwalder• Replies have been received from him\nand all but one of the committee members as of this date.\nAs a consequence, this committee chairman is forwarding the en¬\nclosed (with minor suggestions from the committee included) for Board\naction. As you will note, there are three items of action recommended,\neach of importance and significance to the Association.\nSince each will need serious discussion by the Board, possibly\nyou will want the enclosed duplicated for distribution to the Board\nprior to the St. Louis meeting, I will bring along to the Board\nmeeting the committee members* replies containing their comments con¬\ncerning the enclosed.\nThe committee recommendation that the Television Operations and\nDevelopment Committee be dissolved by the Board and that new committees\nbe named is of extreme importance to the entire Association. With the\nrapid growth of ETV throughout the country, there is a consensus of\nthe committee and indeed of the Allerton Seminar group that NAEB needs\nto take a serious look at itself as regards its relationships to the\nETV members,\nI look forward to the Board meeting and to discussing the en¬\nclosed, This third recommendation could possibly be the most impor¬\ntant order of business to come out of St. Louis.\nSincerely,\n/s/ JM\nJack McBride\nSecretary\nJ:b\ncc: Harry Skornia, Harold Hill and the Operations and Development\nCommittee"
}