{
  "id": "d920-74",
  "text": "—2—\nS—Inara. Travel end Research^ This item In the present budget inoludes funds for\n^ Office (r) travel. Board and Executive Committee meetings, NAEB Committee meetings and\nactivities (such as reports, etc.). Regional meetings, an annual seminar, and Research\nactivities. This item is currently budgeted at $13,000. The proposed budget does not\nhave an item strictly synonomous with this, but has a $2,000 item for travel, plus another\n$5,000 item for \"Committee meetings. Board meetings. Officers supplies and expenses, etc.\",\nmaking a total of $7,000 apparently available for items similar to those now provided far.\nOne exception is that supplies for Officers are presently charged against the Supplies end\nExpenses item of the current budget. Therefore, to allow for supplies, postage, telephone,\netc., for officers approximately $250 a year should be deleted from the $7,000. Also, the\nproposed budget does not allow specifically for the 5% Administrative charge, so it too\n(in the amount of $1,562) will also have to be deducted from the $7,000, leaving $5,188,\nSupplies ®hi» item is currently budgeted at $5,550 and inoludes, in addition\nto the normal office supplies and expenses, some funds for purchase of minor equipment\nitems and for duplication of certain surveys, reports, etc. The proposed budget lists\n$2,000 for this Stem.\nBablioationg; There is no separate amount for this item in the current budget, and while\nthe Newsletter wee mimeographed this expense was merged to the publications portion of\nthe Applies and Expenses item. The Journal has never previously been considered in the\nHeadquarters budget. The proposed item of $6,000 appears appropriate for the printing,\nediting and mailing of both the Newsletter (now printed) and the Journal.\nANALYSIS OF SERVICES* In studying the Information set forth below, the information set\nforth shove should be kept In mind, i.e., that the Network uses, but does not help\n^ support, the Headquarters staff} Headquarters presently profits considerably from the\npresence and personnel of the Engineering and Placement Services and these may not always\nbe in existence; end the comparative amounts budgeted for the services. The following\nlist should not be considered as entirely exhaustive, but it does represent fairly well\nthe services performed. CKLy enough detail has been given to outline the services.\nThe code markings are rather complex, but are necessary to complete analysis. One of\nthe following code markings appears in the margin to the left of each of the services\nperformed s (Symbol following heading indicates disposition of that entire activity of\nservice)\nA • Deemed imperative for the success of the organisation and would (and could)\nproKhlyHbs oontinued-at, or near, the present level.\nB - Of considerable lnportanb»,-4)ut weald has. to be aoneubat reduced,\nc - Of considerable importance, bulNuoald bare to be greatly reduced.\nD - Of considerable importance, but would probably have to be eliminated.\nE - ^Jtant, if Association is to maintain its present stature, but must\nbe eliminated anyway due to lack of ftonds.\nF • Peripheral benefits * to be g'H^mted.\nDirectories!\nD Up-to-date listing of all educational stations in U.S0 (member and non-member)\nF Separate list of stations owned and operated by schools or school systems\nA Detailed records of the entire raen&ership"
}