{
  "id": "d217-70",
  "text": "TWO\nBETTER BROADCASTS..NEWS LETTER\nTHEY WORK FOR\nBETTER RADIO-TV\nAmerican Legion Auxiliary\nWriting in the national magazine of the\nAmerican Legion Auxiliary, Mrs. J. Howard\nMcKay, its Radio-TV Chairman, applauds\nresults of the ACBB Project:\n“Broadcasters and sponsors value this\nmethod of expressing opinion because it\nrepresents the reactions of many people\nand also answers many questions missed\nby telephone surveys, such as ‘What were\nthe good and bad features about the pro¬\ngram?’ In the process, they discover that\nthey can no longer judge the effectiveness\nof a program by the number of listeners it\nhas, because (and this is a surprising fact)\npeople do tune to programs they consider\ninferior, and they do it for a variety of\nreasons: Because there is nothing better\navailable: because they find the sound re¬\nlaxing whether they are listening to it or\nnot; because of the necessity of listening to\nthe choices of other members of the family.\n“Listeners enjoy taking part in the Look-\nListen Project because it encourages the\nmonitors, during the brief time the program\nis on the air, to get out of the rut of their\nlistening habits and to attend with fresh\neyes and ears to what is being presented.\nThey end up knowing not only whether or\nnot they like the program but, more im¬\nportant, why they do (or do not, as the\ncase may be). The answer is important to\nthe whole family, since most families own\nbut one TV set and therefore it is the whole\nfamily’s enjoyment that is at stake. . .”\nAmerican Association of University Women\nDr. Susan B. Riley, the President of the\nAmerican Association, writes of the Look-\nListen Project, “The project is still in my\nthinking one of the most practical approach¬\nes which have been devised for testing pop¬\nular reception of radio and TV programs.”\nMany branches of the AAUW across the\ncountry participated in the 1954 project.\nDr. Eleanor F. Dolan, Higher Education\nAssociate in AAUW, has recently prepared\na descriptive Bibliography of Radio and\nTelevision, classified as to subject matter.\nUnited Church Women\nLast year the United Church Women\nmade a survey of children’s programs and\nreactions to them in one area. The most\narresting conclusion it reached was that\nprograms on the air for children, with very\nfew exceptions, made no constructive con¬\ntribution to the children. Such a conclusion\ngives food for thought.\nNational Council of Teachers of English\nMembers of the National Council of\nTeachers of English are active on the\nACBB Committee on Schools and Colleges.\nMany State Groups Cooperate\nCALIFORNIA\nAccording to recent reports, Miss Lulu\nBredlow, Radio-TV Chairman of the Cal¬\nifornia AAUW, is planning three practical\nworkshops on Radio-TV. Each will feature:\na demonstration of developing criteria for\nevaluating a TV program; a panel com¬\nposed of students who will show how the\nreading habit can be dramatized; and a\ndiscussion of the teaching of radio-TV pro¬\ngram evaluation to high school students. A\nreport will be made on “Leaves and Dials,”\na project started by the former chairman,\nMrs. William Haupt, which encourages\nbetter reading for children by means of\nradio-TV. The Look-Listen Project will be\nexplained. Last year this group contributed\nsignificantly to the Project.\nILLINOIS\nMay 15, 1954, at the Annual Meeting of\nthe Illinois Council on Motion Pictures, Ra¬\ndio, Television, and Publications, one of\nthe three state groups suggesting the forma¬\ntion of ACBB, Mrs. Louise Trask Conn\ntold of the aims of ACBB. She said of it:\n“It provides information about radio and\ntelevision and what other listeners are do¬\ning, and sharpens one’s faculties of evalu¬\nation and serves as a channel through which\nwe can express our opinions effectively.\nMonitoring for the Look-Listen Project keeps\nus reminded that in evaluating programs it\nis as important to express praise as to com¬\nplain. Sometimes stations work hard to pro¬\nduce a fine program and you and I enjoy it,\nand say nothing. In total discouragement,\nthe people back of it take it off the air,\nthinking no one cared for it; and they will\nbe doubly reluctant to try a similar program.\n“The Look-Listen Project is, therefore, an\nimportant project for all groups and citizens.\nIt is your opportunity to help develop the\nkinds of programs you feel are in keeping\nwith our American heritage; for listeners,\ntheir children, and the nation. are being\nmolded by radio and television.”\nMASSACHUSETTS\nThe Massachusetts Association for Bet¬\nter Radio and Television sent to its mem¬\nbers requests for opinions. Many respond¬\nents requested more programs such as:\n“Voice of Firestone,” “Life is Worth Liv¬\ning,” “Omnibus,” “Victory at Sea”; more\neducational programs for children, forums,\nreligious programs, and good music; also for\ninitiation for Foreign Language Programs\nand kinescopes of foreign TV programs.\nLOCAL GROUP ACTIVITY\nLevittown, New York\nSOME STUDY HELPS\nIn preparation for two weeks of monitor¬\ning of network programs for the Look-\nListen Project, January 11-24, 1954, the\nLevittown, N. Y., branch of AAUW had\none meeting on the subject, a week before\nJanuary 11. Mrs. F. G. Salfeety reported it:\n“Books, booklets and articles had been\ncollected and distributed a month or so be¬\nfore the meeting. At the meeting we touched\non the most important or pertinent points in\nthe booklet, “The Radio Listener’s Bill of\nRights” by Charles A. Siepmann; the chap¬\nter, Public Service Programs in the book,\n“Radio—the Fifth Estate\" by Judith Wal¬\nler; the chapter, What Every Production\nDirector Should Know in the book, “Radio\nProduction Directing,” by Albert R. Crews;\nthe booklets, “Let’s Learn to Look and Lis¬\nten”; the booklet, “The Listener Speaks\nAgain”; the booklet, “Enjoying Radio and\nTelevision”; as well as a few newspaper\ncolumns by Harriet van Horne, John Cros¬\nby, and Jack Gould.”\nThe four booklets mentioned sell at a\nsmall total of $1.40. The two books from\nwhich chapters were used are probably in\nyour library.\nNOTE: From members at all levels (na¬\ntional, state, and local) it is helpful to us in\npassing on your experience to others, if\ncopies of reports you prepare for your\ngroups are also sent to ACBB Headquar¬\nters, 423 N. Pinckney.\nTrend Toward Monopoly of\nMass Communications\nWhere an area has only one newspaper\nand its owners own the one radio station\nand own (or seek to own) the one television\nstation, the danger of thought control is ob¬\nvious. One of the first things that Nazis and\nCommunists have done is to seize the fa¬\ncilities of mass communication. This condi¬\ntion exists in many parts of the United\nStates. Nothing untruthful need be said to\ngive an untrue picture—merely important\nparts of the truth omitted, one side given—\nin short, the supply of information con¬\ntrolled.\nNo Villainous Intention\nIt is natural that purveyors of news\nshould acquire radio stations which spend\npart of their time giving news. Even more\nnatural that radio stations should want to\nacquire television, with its similarity in\nprogramming. All this.with no idea of con¬\ntrolling thought. But what happens when\na public issue touches the coffers of the\nowners (and so many issues do touch\nprivate purses)? It takes people of shining\nhonesty and well trained, analytical minds\nto detect where their own prejudice (not\ntheir reason) dictates their choosing of facts\nto present. Some will do better than others.\nBut, in general, will a fair, balanced pic¬\nture of the issues be given?\nThat question is back of the resolution to\n“recommend that studies be made of the\ntrend toward monopoly of mass communi¬\ncations,” passed last April at the ACBB\nConvention. What agency may undertake\nsuch a study has not yet been ascertained.\nMeantime, during this October residents\nof areas where the newspapers, the radio\nand the television are controlled by the same\npeople will have a chance to notice whether\nthe news reports they get are balanced.\nThat is, they can judge well if they read\npapers and magazines that give many points\nof view.\nKeeping a log of the presentation of news\ncan be an exciting game:\n1. Select what you consider the four most\nimportant issues in the fall political cam¬\npaign;\n2. Keep track during the last week in\nOctober of the three most important daily\nnewscasts or commentaries and newspaper\nitems;\n3. List the important news items not men¬\ntioned in each.\nThat will make an interesting record.\nIf you prepare such a report for yourself\nor to give to some organization, won’t you\nplease send a copy also to ACBB Head¬\nquarters. Some of your observations may\nhelp to give direction to a study of present\npractices.\nNEEDED: SALESMEN\nUnder the caption “Needed Salesmen” an\neditorial in Broadcasting-Telecasting said\nin June, 1954: “Within the past month a\nnumber of important advertisers have criti¬\ncized the quality of salesmanship in con¬\ntemporary broadcasting, particularly in\nradio. In essence their criticism is that\nbroadcast salesmen don’t know how to sell.”\nSome time ago, Jack Mabley wrote: “I’m\nnot against commercials—I just like ’em pain¬\nless. No superlatives. No harsh irritants.\nInformative,”"
}