{
  "id": "d217-72",
  "text": "FOUR\nBETTER..BROADCASTS..NSWS LETTER\nA New Age\nBy Dr. Louis Forsdale, Asst. Professor,\nTeachers College, Columbia University\nA friend of mine who is a teacher of\nscience once described for me the plight of\nscience teachers in these times. “In college\nI learned my physics well enough,\" he\nsaid, “but when the atom bomb exploded\nmuch of my learning became obsolescent.\nNow I have to give myself a college course\nevery day to keep up.”\nI remember that comment today because\nit states so well a parallel problem which\nfaces those of us who are English teachers.\nOur subject has been changed too, not by\nfission and fusion, but by the new media of\ncommunication—film, radio and television.\nThere was a time when English teachers\ncould work almost exclusively with the\nskills of reading, writing and perhaps speak¬\ning, for the basic media of communication\nwere print and face-to-face speech. Then in\nrapid succession the three new media\nchanged our communication environment.\nAs my colleague, Professor Lennox Grey,\nhas pointed out, it is probable that for\nmost people today the bulk of their liter¬\nary experience comes not through print but\nthrough radio, film and television. If this is\ntrue—and I have no reason to doubt it—\nthen English teachers must turn their eyes\nand ears to the newer media and study\nthem. And to the traditional skills of read¬\ning, writing and speaking, we must now\nadd listening (to radio, for example) and\nobserving (film and television, for ex¬\nample).\nWhile accepting this new obligation, Eng¬\nlish teachers must learn enough about the\nnewer media to help their students discover\nthe best which each medium has to offer,\nand this is a difficult assignment. After all,\nwe have been trained to understand, re¬\nspect and teach about words, generally\nprinted words. Now we are faced with a\nmedium like television which combines pic¬\nture, language, sound and music in mu¬\ntually reinforcing fashion.\nHow can English teachers (and other\nteachers) go about the job of becoming stu¬\ndents, and subsequently teachers, of the\nnewer media? The Committee for the Study\nof Television, Radio and Film of the Na¬\ntional Council of Teachers of English is\nstudying that problem, along with other\nproblems, but materials are not as yet\navailable from this group. Meanwhile I have\nmade a list of suggestions, for myself main¬\nly, but also for others who may be reading\nover my shoulder. These suggestions con¬\ncentrate on television because that ubiquit¬\nous and attractive medium urgently calls\nfor our attention, but with a little verbal\njuggling you can read radio and film into\neach of the suggestions.\n1. Watch television. Before you can\nhelp students gain discrimination in viewing\ntelevision, you need to know the medium\nfrom personal experience. (Still I know\nteachers who refuse for one reason or an¬\nother to watch television.)\n2. Look at everything — baseball,\nwrestling, soap opera, news, commentary,\nmusical programs, and look at them without\npreconceptions.\n3. Accentuate the positive. In all of your\ntelevision viewing, seek the best. It takes\nbut little talent for a mature adult to spot\npoor programs, but it is a truly creative\ntask to identify the fine programs which\nNEWSLETTER, NOVEMBER 15\nwill contain a Selected Bibliography and\nGuest Editorials.\nfleetingly appear on the screen.\n4. Don’t praise or condemn programs\nby categories. All Shakespeare on televis¬\nion is not necessarily good; all crime drama\nis not necessarily bad.\n5. Evaluate television in terms of its own\npotential, its own problems. Seek actively\nto discover the unique genius of the me¬\ndium. Look at drama, for example, as tele'\nvision drama, not as stage drama.\n6. Watch creatively for new talent\namong writers, designers, actors. There are\nserious workers in the new medium whose\nnames are not generally known in other\nmedia (the Chayevskys, Footes, Segals,\nGitlins, Murrows, among them).\n7. Read the critics and discuss programs\nwith friends and colleagues, but in the last\nanalysis stand by your own opinions.\n(In two future articles I hope to discuss\nsome procedures which English teachers\nmight use to help students gain discrim¬\nination in viewing television, and then make\nsome observations about the peculiar na¬\nture of drama on television.)\nEDUCATIONAL TV\nThe National Citizens’ Committee for\nEducational Television says, “When doc¬\ntors, lawyers, businessmen, housewives,\nboy scouts, girl scouts, all representing na¬\ntional organizations, but perhaps more im¬\nportant representing the interest of Ameri¬\ncans in improving themselves—if all these\npeople in hundreds of communities can\namass more than $15 million in assets, as\nis the case, then it would seem that edu¬\ncational television is on a firm base.”\nBefore application for a license is made,\nthere must be fairly good indication that\nmoney to build and operate the station\nwill be forthcoming. It takes time for the\npublic to become informed and to see that\nmoney is available. Yet in almost every\narea that will be served by channels now\nreserved for education, citizens are working\nto raise money for them.\nFederal Communications Commissioner\nRosel Hyde has assured educators that they\nwill have the channels reserved for them\nas long as there is interest in them. Last\nApril this Council (ACBB) recommended\nthe retention for education, for at least\nten years of all television channels now\nreserved for educational purposes.\nHOUSTON\nThe University of Houston gives 16 tele¬\ncourses. The psychology course reached\nAmerican Council for Better Broadcasts, Inc.\n423 N. Pinckney, Madison, Wis.\nMEMBERSHIP—open to groups and individuals\nwho will work to encourage better\nradio-TV\nprogramming (professional broadcasters ex-\ncepted).\nDUES—National Groups\n$25.00\nState Groups\n$10.00\nLocal Groups (over 20)\n$3.00\n50-200 Members\n$2.00\nLess Than 50\n$1.00\nIndividuals\n$1.00\nNEWSLETTER—5 issues annually to each mem¬\nber. Subscription price to non-members, $1.00\nfor 5 issues.\n10,000 people. The cost of the station was\n$300,000; its operation, $65,000 a year.\nThese courses are expected to save the uni¬\nversity $10,000,000 in its building program.\nOklahoma and Houston are experimenting\nwith 600 people in home nursing to see\nwhether classroom or Educational TV pro¬\nduces the better results.\nMICHIGAN\nThe University of Michigan surveyed\nthe audience for its Sunday afternoon edu¬\ncational program over WWJ-TV, Detroit.\nA state-wide audience of 800,000 sees it.\nA larger portion of people in the middle and\nhigh income brackets watched it than those\nreceiving less than $3000 a year. But even\none-fourth of the low income group had\nseen the University program. About one-\nthird of the adults with grade-school edu¬\ncation and two-thirds with a college educa¬\ntion said they were viewers of the pro¬\ngram. In other words, a great many people\nin all groups of our society want to know—\nenjoy learning.\nBETTER PROGRAMS\nFOR YOUTH! a plan\nPart of the ACBB Program for 1954-1955\nFor twenty years and more respected\nbodies of adults have inveighed against the\nabundance of violence on programs for chil¬\ndren—a legitimate complaint. Favorable re¬\nsults have not followed. Statistics show that\ntoday there is more violence than ever be¬\nfore on the air, especially in children’s pro¬\ngrams—proof that complaint, ALONE, does\nnot bring results.Is the public helpless?\nOr Is It Time for a Plan?\nTo change the picture, three things are\nobviously necessary:\n1. existence of constructive, entertaining\n(though not necessarily fictional) programs\nfor young people at the peak of their lis¬\ntening time;\n2. teaching in the schools of criteria\nfor evaluating programs at home;\n3. encouragement by home and com¬\nmunity of such programs and such teaching.\nAs the good programs become popular, the\npoor will give away. Programs will really\nchange for the better.\nTo encourage such a program of action\nwas the decision of the ACBB Convention.\nIt emphasized that a full hour of construc¬\ntive programs for the older child was de¬\nsirable between 5-6 p.m. and for the whole\nfamily between 7-8 p.m.\nDoes This Happen By Itself?\nMembers of ACBB: 1. can see that our\nHeadquarters, 423 N. Pinckney, Madison,\nWis., receives news of such full hours of\ninteresting, constructive programming, 5-6\np.m. and 7-8 p.m. daily;\n2. can ask teachers to help the children\nto arrive at standards of excellence in pro¬\ngrams;\n3. Can encourage in their communities a\nsensitiveness to the worth of the programs\nbetween 5-6 and 7-8 p.m.\nWon’t YOU do one of these things?\nAll stations are invited to send their\nschedule of programs for these hours. We\ncan give some publicity in the Newsletter,\nand by letter to members in different areas.\nWe have now the schedules from three sta¬\ntions which have young people in mind\nas they program."
}