{
  "id": "d1366-0",
  "text": "SURVEY OF EDUCATIONAL RADIO PROGRAM DEVICES\nBy: S. W. Jones, Manager KFDY\nSouth Dakota State College, Brookings, S. Dak.\nFiguring out a questionnaire which could cover the subject and also yield re¬\nturns finally resulted in series of questions the answers to which were estimates\nby those to whom the questionnaires were sent.\nThe questionnaires were .sent to colleges, universities and other publicly owned\nradio stations. Sixteen of them replied. The material furnished by the sixteen sta¬\ntions, when cast up in tables, is indicative of how educational radio programs are\nbuilt and which ones are considered to be most effective, but should not be taken as\nconclusive.\nm a glance at the tables, it is seen that a system of points was used to rate\nthe various items. The ratings submitted on the questionnaires were added together\nfor each heading and averages taken. The smaller the figure then, the higher the\nrank.\nThe most significant thing brought out in the tabulation is that talks by the\npersons who wrote them are considered most effective by the stations reporting and\nare also most widely used. Music, for background, introductions, interludes etc;\nplaylets are ranked second in effectiveness, but are actually the least frequently\nused as shown in Table 1. This brings up the question propounded in a recent song\nhit: \"What to do about it?\" Certainly more than: \"Let's put out the lights and go\nto Sleep.\" Arranging and making use of music and plnylets, of course, requires more\nwork and more personnel. T^ latter item is perhaps the limiting factor in most\ncases.\nThe comments of m^ of those replying to the questionnaires are what moke the\ntabulations valuable. Portions of some of these comments are reproduced below. The\nportion of the letter reproduced from L. L. Longsdorf, program director of KSAC,\nKansas State College, is especially roco,amended for your perusal. He offers some\npractical suggestions.\n(more)"
}