{
  "id": "d1366-1",
  "text": "-2-\nfrom 5 to 20 minutes. That is one reason why we do very little broadcasting of music\nwith the exception of music appreciation for our 4-H Clubs of Kansas and student re¬\ncitals. We do not have a regularly scheduled program, with but one or two exceptions,\nwhere wo schedule Department of Music faculty members.\n\"We have been attempting to improve our programs by instituting the past year\ntwo one-act plays, or as you term them, playlets, each week. These are staged by\nfaculty members and students in dramatics.\n\"I believe our biggest step forward in creating interest is that of setting aside\na 20-minute period four days a week in which students enrolled in our elementary as\nwell as advanced radio speaking courses interview specialists on the6!£P°rt\non state, national, and international affairs. This proves to be a building block\nin not only the type of subject matter given and the fact that trained students ar\ngiving it but that these students have a large listening audience in their home towns.\n\"Many of our subject matter talks deal especially with our Extension activities\nor ore centered around local people. By talking up what they are doing, . 0 'evc ,,e\nare assisting to maintain a local listening audience. It is our attempt in these\ntalks,wiach are used as press articles and radio talks, too, to cover all acti\nof the state at different times, not confining our stories to any one spot.\n\"We are finding much interest being taken in broadcasting Extension Schools by\na set-up of radio and film strips, synchronized. You are probably familiar with t\nplan already. This, is the basis on which we broadcast experimental programs this\npast winter, and it has proved most effective. Through our county agents we arrange\none or more meeting places in the county. The film strip machine is set up to illus¬\ntrate the talks as broadcast from our station. We utilize a gong system for warn g\nour county agents when to turn to the next picture. We have had all the Wfrom 1/\nto as high as 50 counties tuned in to a single program. The attendance at tnese\nmeetings ranged from 10 to as high as 175 at a meeting.\n\"The possibilities that were offered in these experimental radio-film strip\nsynchronized programs suggested the possibility of a state-wide general hook-up. So,\nbased on this plan we are broadcasting a two-hour program from 7:00 to 9.00 p.m. on\nJune 17 over three of our commercial radio stations, the program being devoted to co¬\noperative marketing. We have three teams in the field at the present time arranging\nlocal meetings. We expect 90 counties to participate. The reason for my explanation\nof this set-up is to show you how we are attempting to, utilize pictures as an emo¬\ntive device in securing a radio audience,\" L. L. Longsdorf, Program Diroc or, ,\nKansas State College.\n\"Our radio programs are composed almost entirely of talks. We believe that\nvarious other devices may be used to advantage where people are employed who can con¬\ncentrate on tne preparation of material. Our broadcasting material is all prepared\nby agricultural workers who are specialists in subject matter rather than in piescn-\ntation.\" E. C. Hollinger, Assistant Director of Extension Service, State College,\nNew Mexico.\n\"Dote that we fail to get the kind of programs we prefer. If possible, we would\nhave the subject matter of all formal talks presented, as dialogues, questions and\nanswers or in short plays.\" - B. B. Braokott, Director, KUSD, U. of S. D.\n\"It is difficult to establish a 'ranking' of this sort—each device is effec¬\ntive in its way, when used appropriately, and with good technique. However, I p ace\ntalks at the noad of the list, feeling that the listener desires to near, m person,\nthe authority for what is being said.\" W. L. Kaddcrly, K0AC, Oregon State Agricul\ntural College.\nimm"
}