{
  "id": "d466-102",
  "text": "page 2\nIn Paragraph 5, John raises the question of zA intensive mcitbersfcip campaign.\nThis should bo a continuing and constant activity of every s&Gsber of the Board\n^•..•certainly of each Regional Direebor «nd the Ex®cutiva Director. In tarms\nof active members, I thought we had worked out a system thereby *>ur Wellington\nattorneys would forward to the HfiEB Headquarters regularly a list of all appli¬\ncations for CPs. The procedure agreed upon at one time tms that the Executive\nDirector would fire that applicant a barrage of literature on IttEB* sending car¬\nbons to the Regional Director of the institution involved. The Regional Director\nthen would follow up immediately with additional encouraging letters, as well as\nsending an application for racmbercfclp. If the Ea&cuiive Director sends applica¬\ntions for membership, then the Regional Director would not need «o do so. The\nExecutive Director should keep a permanent file of all applications for educational\nstations and CPs granted* If the institution involved has not become a meaber of\nthe organisation within « voyy short period* he and the Regional Director should\nwrite follow-up letters and/or call on the institution. This way* the Executive\nDirector would have his own file of all educational institutions on the air and\ncould tell at a moment^ notice whether or not that institution is a washer of\nWEB.\nI am in complete agreement with Joten*S views of long standing that the Regional\nDirector should be the contact man with every member and prospective member in\nhis region. Every Regional Director should write every regional member a personal\nletter soliciting information and news which he would pass on to the EEWSIETTER\neditor at least twice every year. The permanent files, however, need to be kept\nin the Headquarters* office because we all know the shift from year to year of\nRegional Directors. It would be a very good idea if tfc* Executive Director, upon\nthe election of a new Regional Director, would forward to that Regional Direotor\na complete list of all active and associate members in that region, as well as a\nlist of alL non-member broadcasting Institutions. If I appear to labor this\nmembership question too heavily, it is because I have, like John, long been aware\nof the fact that the strength of this organization lies in the vigorous promotion\ncampaign for new members and the \"personalised” individual masnbar-Regional Director\nrelationship.\nThe keynote in John* s Paragraph 6 is the long wait between the period that an\napplication comas in aid the date when it is finally approved. I agree with Ids\nsuggestion that the Chairman of the Membership Cosrcitteo should receive the\napplication for membership Immediataly after it is received by the Regional Direc¬\ntor or the Executive Director and should proceed without delay to poll the Member¬\nship Committee for a vote on admission of this applicant. He should add *o his\nMeaber ship Committee each time the Regional Director of the region in which die\napplicant is located. If there is no question concerning the membership, he should\nforward to the Executive Director immediately a statement of approval of the\napplication and the Executive Director in turn should send a notice of acceptance\nand a membership certificate to the new station or associate member. As John\nsuggests, the action of the Board later could be a matter of form.\nI should like to say finally, in regard to membership, that this is a subject which\nhas been discussed at various rustings and I urge John to combine the suggestions\nof all of the &anbers of the Board and of his Committee, and prepare in brief\nform a statement of procedure in this regard for approval of the Board at its\nBattle Creek meeting. This subject has been discussed too many tiroes with nothing"
}