{
  "id": "d466-108",
  "text": "Board thought it desirable* I told him you would be back\nby that time and it was something you should decide* I\ntry to avoid making any decisions because of your absence,\nand you may be assured that I am delighted that you are-back\nin the country and back in the KAEB saddle* I certainly\nhope you will follow up on such suggestions as I have\nmade only if you think it desirable to do ao* Believe me,\nI have no desire to assume any of your responsibilities,\nand I find myself constantly wishing you were around to\nride herd on these various matters that come up*\nThe meeting with VanDuyn and Masters was entirely\npleasant and satisfactory* They were definitely of the\nopinion that we were tying the Executive Director down\ntoo much, and I frankly pointed out that it had been\nnecessary for the good of the organization to spell out\nin great detail the plan of operation which we expected\nfrom him, I asked VanDuya for a specific statement of\nthe relation which he felt should be maintained between the\nE. D* and the Board, and his statement followed very closely\nthe relationship we have been shooting at - reporting,\nchecking, advising, ciiperating* I assured him the Board had\nno interest in approving the E. D. *s requisitions for pencils*\nI believe are in complete agreement and there is certainly\na fine, cooperative feeling there* Both VanDuyn and Masters\nstated that the Foundation would have to reconsider the grant\nas though it were an entirely new request should we decide\nto move the headquarters from Urbana* As you probably know,\n■ ilbur was pretty r.nd after getting Jack Dunn’s tirade about\nSchramm domination* He, Wilbur, at the end of this meeting,\nprivately told me he had no intention of naming a new head¬\nquarters representative \"for the time being\", so I feel\nbetter about that.\nI had a lengthy conference with Bob Saturday afternoon\nafter everyone else had left, and I have a better feeling\nabout our relations with the FAE. I gathered that the\n$50,000.00 grant was one that they were watching with con¬\nsiderable interest and hope and that they were in no wise\nprejudiced against considering requests from us at a later\ndate* He seemed to be receptive to the idea that the\nFoundation committee should be a creature of the Board\nand that funds could be handled by the Board rather than\nby committees selected by the FAE* Incidentally, Jim\nstill has not received the $80,000*00 check, but I forgot\nto discuss this with Bob*"
}