{
  "id": "d466-11",
  "text": "•\\jyuoA-FM-\nVT 91.7 ON YOUR FM DIAL * T *\n\"THE VOICE OF THE UNIVERSITY OF ALABAMA\"\nEXTENSION DIVISION\nUNIVERSITY OF ALABAMA\nJanuary 3, 19^2\nUNIVERSITY, ALABAMA\nBOX 2002\nR\nA\nD\nI\nO\nR\nO\nA\nD\nC\nA\nS\nT\nI\nN\nO\ns\nE\nR\nV\nI\nc\nE\nS\nMr. Seymour Siegel\nRadio Station 1NYC\nMunicipal Building\nNew York City, New York\nDear Si:\nWith your full knowledge of ray wholehearted admiration, support, and\nloyalty to you and the unbounded respect with which I have always viewed\nyour operations, you will, I am sure, accept a minor spanking from me.\nVery briefly, I am not at all doubtful that Frank’s failure to report\nto you and the Board on the financial status of NAEB has been most annoying\nand certainly if he has been derelict in his duties he needs to be pulled\nup by the boot straps. Y0ur letter of December 28, however, was too strong,\nparticularly in view of your having forwarded copies to members of the Board.\nIt could result only in completely antagonizing Frank and should never have\nbeen written. Please consider yourself duly spanked.\nMay I reaffirm my absolute confidence in what you are doing and my\nappreciation for the very excellent way in which you have always conducted\nNAEB affairs. I think I have a clearer picture than anyone of the enormous\namount of work and thought and the large portion of your heart that you have\npoured into this organization. All of the membership are grateful to you\nand all of us are extremely proud of you.\nYou must realize, however, that few people are as efficient as you are\nin handling their own problems, as well as organizational jobs, and be a\nbit more tolerant of the weaknesses of others. I have been aware for some\ntime of the very great pressure that NAEB affairs was placing on you and\nof the demands on your time which it is making. You of all the people I\nknow in the organization are big enough to handle it, however, and I am\ncompletely confident that you will continue to do so.\nLoving you like a brother, I suggest that you write Frank Schooley with\ncarbons to other members of the Board reaffirming the fact that you do need\na statement from him but apologizing for the brushess of the letter you\nsent under the date of December 28. I think it will warm up a cold spot\nthat your other letter created. Furthermore, don’t let me hear any more\nbaby-talk about quitting an office because it has run into some snags.\nIf you can’t iron out the rough spots, I know well that I could not and,\nwhat is more, would not tackle the job. I know of absolutely no one in the\nMEMBER OF NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS"
}