{
  "id": "d466-116",
  "text": "x©AV52\nHr. %aydon Ammm * 2 -\nInasmuch as Bob Van Byn* is concarnad} I am delimit ad that ha la\ncoming, to Minneapolis aal 1 can see mo objection whatsoever to hio\nattending lbs open mooting of the .Board of Directors. Neither cam I\nsoo any objection to Me being present during that portion of the\ndosed meeting which has to do with mj discission of the Kellogg Grant.\n1 m not no certain* house#*, that he ought to be present during any\nof the other discussions during any executive sessions of the Board of\nDirectors*\nAfter talking to Dick (and he is a very sick boy) I m calling a meeting\nof the Board of Directors to meet in Minneapolis starting the evening\nof November 2nd. In the notion of tho mooting I am asking individual\ndirectors to notify Burton so that ho can make the neeessazy reservations\nat the Canter of Continuation Study. Be will also arrange for a meeting\nroom for the 2nd, 3rd and 4th. 1 will not be able to be present because\nl still have to run our election night coverage here in Hew folk. Although\nI wiU be up most of the night of November 4th, X expect to be on the\ni A.M* plane November 5th arriving in Minneapolis a little before moon.\nX am hopeful that X will be able to grab a few pours sleep and be prepared\nto Join the deliberations on the afternoon of the 5th* 1 am asking Jim\nMil** to work up an agenda for the Board meeting* One of the first things\nfor the board to do would be to approve any action that we take in\n.msMngton. Another thing would be to discuss the possibility of an\nAUsvten type seminar on TV. X have had nothing official concerning\nthe 55000* ford grant. X believe the original offer was made direct\nto Dheatley. The Board could decide when thie seminar should be held\nand what it should consist of. If it is in the winter-time X hope that\nsomebody picks out a place where there is a great deal of sun.\nAnother thing that the Board should consider is the report of the\nGrant-In-Aid committee* X m writing letters of appreciation to o&ch\nmember of the Committee. Although there will be a great deal of difference\nof opinion ae to the final remits, nevertheless, they deserve every\npossible credit for a Job welldene*\nThe New# release concerning the Hew fork and Chicago Monitoring Studies\nwill emanate from Now fork as soon as we have some definite date when it\ncomes off the press. X have r«?<niested Miles to send mo 50 copies of each\nof the editions for distribution to ths Press and, of eourso, will work\nwith Bellas In connection with any news releases espcially of tho lew fork\nstudy.\nThe Adult Education Committee netting in New fork this pest week-end\n(minus Dick) took plaoo.\nTho Valeo of Europe series is an exceptions! contribution and Is to be\nreleased the middle of November, i.e* after November 16th* There are\n2D- half-hour programs as the initial offering* Altogether there are\nlikely to be 120 programs* Everybody is tremendously enthused about this\nand X m hopeful that it will attract as much attention as the Jefferson"
}