{
  "id": "d466-132",
  "text": "November lhs 1952\nTO i\nExecutive Committee and Committee of Five, NAEB*\nmailed to all members o ‘ th© Board®\nCarbons to\nSUBJECT* NAEB-FAE Meeting* HAEB Strategy Meeting.\nFROM*\nIf you have not already done so, you will receive very soon an in¬\nvitation to meet 'with Mr* C® Scott Fletcher and othsr representatives of the\nFAS at the Blackstona Hotel in Chicago at 2 o*clock on the afternoon of\nDecember U* This invitation is being extended to all members of the Execu^\ntive Commit toe m. d to the Committee of Fiv© with expense® paid by FAE. Since\nthis will bring together all of those p©opl<% except two or three, whom I had\nplanned to invite to cur strategy meeting in Urbans on the 2l*th and 25th,\nthere ie no reason fear pursuing that mooting, but there if; svery reason for\nus to plan to stay over the evening of December U and th® morning of December\n5 to do the job we had laid out for the earlier meeting.\nQraydon Ausmus, President, NAEB®\nPrior to this meeting in Chicago - not later than Wednesday, Novem¬\nber 26-1 should like to request that you search the most remote reaches of\nyour soul and prepare a full and detailed statement on the subject m discussed\nat the post-session Board meeting in Minneapolis - the full nature, scope and\ninfluence of MASS in the years ahead and a complete breakdown of th® points\noutlined on the attached sheet* I do not present this outline as a final one\nnor as one I think you should follow but rather as a tool to use in your\nthinking rather than to define and limit your thinkieg« I urge, however, for 7 /\nyour own benefit and for th® benefit of the organisation, that you do a thorough / J\nand painstaking job on this* V\nI am inviting, at NaEB expense, two additional people to our mooting\nin Chicago and adding them to meet with th© Board on the afternoon of December\nk immediately following our meeting with Flatcbsr® Those two people are\nMerritt Ludwig and Jack Dunn. The reason for inviting Ludwig go®® back to\nour last meeting in Minneapolis vfcer© all were agreed that an expert in group\ndynamics should have beon present at our Friday night Board meeting and in\nsome of the other mootingo to capture on ptpor while? it was happening th©\nsense and essence cf the thinking of our group. This will b® Merritt*s job\nat Chicago® If this is an experiment, it is not an expensive one. If I m\nwrong, I beg your indulgence, but I sincerely bolisve that from Ludwig®*\nreport of our mooting in Chicago will come on© of the clearest statements of\nthe total thinking of this group that m have boon able to got on paper since\nthe organisation mo established. I m asking John Dunn to come to this\nmeeting because ho hag always maintained an independent attitude where many\nof us are inclined to be swayed by the thinkii^ of the other people* John\nalso represents th© thinking of a large segment of this organisation more\nfully than any of the others of us «• not a brake, but a ballast.\nThrough the courageous, intelligent, and imaginative leadership\nof Dick Hull and his close associates during the years when ho was president"
}