{
  "id": "d466-137",
  "text": "Mr. James Miles\nNovember 18, 1952\nPage 2\nput such a book on NAEB tape net. Nevertheless, it is available,\nand I should be delighted to make it available in thirty minute\npackages for distribution by the net to any stations which wart it.\nIt may not do the superintellectual job which we need to do in\nlarge measure, but I believe it will have great popular appeal\nfar many of our stations and is worthy, at least, of the considera¬\ntion of the program acceptance committee.\nAnd speaking of committees, there are a few new ones\nwhich I shall appoint within a few days. Until I have had time\nto completely revamp the committee setup, I shall ask that all\ncommittees appointed by Si continue to function until notified\nof any changes. On the whole, I think the committee setup was\nexcellent and only a few changes will be made. By action of\nthe Board on Thursday morning in Minneapolis the new president,\nSeymour Siegel, and George Piobst are to constitute our committee\non international affairs. It occurs to me that that might be\na good committee to handle the Fulbright Scholarships.\nI hope you did not misunderstand my question concerning\nthe relationship of the president and the headquarters operation.\nI have no concern with meddling in any branch of the operation\nthat is running well and I congratulate you on the efficiency with\nwhich our headquarters operation is functioning. I am confident\nthat it will continue to so function and have no interest in\ntaking on any responsibilities concerning it other than those\nwhich would normally accrue to the office of president. I\ntrust you will observe the good practice of sending me carbons\nof significant correspondence - blind copies or acknowledged\ncopies - so I can keep up with any significant activities\nfrom headquarters office.\nThe revised constitution was approved by action of\nthe Saturday afternoon Board meeting, but Si announced that it\nwould go into effect thirty days from that date. I do not know\nwhether this is the necessary waiting period or not, but it is\nstill good business. I can see no reason, however, for your\ndelay in sending out notices to prospective members under the\nnew constitution^^iiiMHB^ and would suggest that you proceed\nto do so. furthermore, I think you should proceed with plans\nfor new printing of the new constitution. A committee was\nappointed to make a revision of our total dues structure with\nFrank Schooley as chairman (you probably have the names of the\nother members of that committee in your notes). The dues struc¬\nture should not become a permanent part of the constitution nor\nbylaws, however, but should be printed as a separate flyer."
}