{
  "id": "d466-2",
  "text": "Bee* 26i\nPage 2#\nNow* to react toJEft's letter of December 21st* in reference to the\ntape network operation* (Incidentally* I think eveffi member of the\nBoard id obligated by hie acceptance of the appointment to react to\nall of the questions which arise so all may profit by the ideas of\nthe others*)\nI know nothMg about the FS& series but I do kenw that it points\nup the need for the activation of our program acceptance eoaaadttee*\n\"(ho now constitutes that committee andTioW (ioes i't pperatVftiicS\nleads to another questions Who decides what types cf new programs\nare needed by member stations? What determines the ratio of talks*\nmusic* drama* etc* to be offered? And Who?\nI hold no brief or beef for the current method of tape distribution#\nJfy one reaction to it has bedn that there is a terrific pile of\ntaps tied up in the •package\" systemj however* this is just one\nmore exauqOe of the sort of thinfc which needs thrashing out in\na committee^wfith reports feeding out to the total Board and\nthe full membership* If the \"package\" technique is the most\ndesirable from the headquarters viewpoint* let«s have it pointed\nup through discussion* then make it clear why to all concerned*\nAs broadcasters we are not doing a good QoS of communicating\nideas ■HK^id’fcteA^BBLgMiwai between ourselves*\nThis page an^bne half boils down to a simple fact* wefve tossed Jim\nand Dick into the job of running the network and other NAEB business\nwith too little direction from the Board* They are doing a super job)\nbut not always just as individual members would have it done* We have\nfailed to relay our ideas to them and they have failed to interpret\ntheir ideas to us in a few instances* The committee which I suggest\nbe activated and kept activated will clear this two-way communication\nproblem and make 'for smoother operation all the way up and down#\nlours for a good 1952*\nCarbons to all members of the Board\nSincerely*\nGraydon Austins"
}