{
  "id": "d466-22",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVICE-PRESIDENT\nGRAYDON AUSMUS\nWUOA, University of Alabama\nUniversity, Alabama\nTREASURER\nFRANK SCHOOLEY\nWILL, U. of Illinois\nUrbana, III.\nEXECUTIVE DIRECTOR\nJAMES MILES\nGREGORY HALL, U. of Illinois\nUrbana, Ill.\nGENERAL COUNSEL\nMARCUS COHN\nCafritz Building\nWashington, D. C.\nREGIONAL DIRECTORS\n☆\nRegion 1\nPARKER WHEATLEY\nWGBH, Lowell Institute\nBroadcasting Council\nBoston, Mass.\nMaine, New York, Connecticut, New\nHampshire, Massachusetts, Vermont,\nRhode Island, Pennsylvania, New\nJersey, Delaware and Maryland.\nRegion II\nALVIN GAINES\nWABE, Board of Education\nAtlanta, Ga.\nVirginia, West Virginia, Alabama,\nKentucky, Tennessee, North and\nSouth Carolina, Georgia, Florida\nand Mississippi.\nRegion III\nWALDO ABBOTT\nWUOM, U. of Michigan\nAnn Arbor, Mich.\nOhio, Michigan, Indiana, Illinois\nand Wisconsin.\nRegion IV\nRICHARD B. HULL\nWOI, Iowa State College\nAmes, Iowa\nIowa, Minnesota, North and South\nDakota, Nebraska and Wyoming.\nRegion V\nJOHN DUNN\nWNAD, U. of Oklahoma\nNorman, Okla.\nMissouri, Kansas, Colorado, New\nMexico, Oklahoma, Arkansas, Texas\nand Louisiana.\nRegion VI\nALLEN MILLER\nKWSC, State College of\nWashington\nPullman, Washington\nMontana, Washington, California,\nIdaho, Oregon, Nevada, Arizona,\nUtah and Territory of Hawaii.\nDIRECTOR OF STUDIES\nDALLAS W. SMYTHE\nIllinois University Communica¬\ntions Research Institute.\nUrbana, Illinois\nSECRETARY AND\nPUBLICATIONS EDITOR\nBURTON PAULU\nKUOM, U. of Minnesota\nMinneapolis, Minnesota\nPRESIDENT\nSEYMOUR N. SIEGEL\nWNYC, Municipal Broadcasting System\n2500 Municipal Building\nNew York 7, N. Y.\nJanuary 9, 195>2\nMr. Seymour Siegel\nRadio Station WNYC\nNew York City, New York\nDear Sis\nThis is a subject about which I should have written you sooner but\nwhich should be given consideration by the Board on the 18th.\nDr. J.R. Morton, Director of Continuation Education in the Exten¬\nsion Division at the University of Alabama,who was the University\nrepresentative at the Biloxi convention (not by accident) is the\nNational University Extension Association chairman on atomic energy\nand last year, through cooperation of the AEC, promoted with money\ncontributed by the AEC the traveling exhibit on atomic energy, a\nproject costing upwards of $100,000. This project, conceived and\nsupervised almost entirely by Dr« Morton, has pleased the AEC\nimmensely and they are now ready to listen to other ideas from him.\nDr. Morton win write you a letter within the next few days\nsoliciting the suggestions and support of the NAEB for a project\nadult education on atomic energy utilizing radio. I think it will be\na very excellent opportunity for us to capitalize upon a contact and\nperhaps get some additional money for the production of programs for\nour network. He will probably ask that you set up a committee to work\nwith him and my purpose in writing in advance of his letter is to\ntell you that I personally feel that it is an opportunity which we cannot\npass up. Incidentally, Dr. Morton formed a very high opinion of the\nmembership of NAEB at the Biloxi meeting and said on a number of occasions\nthat he thought it was a wide awake and intelligent group of people\ngoing about important business in a business-like way.\nA second point worthy of consideration is that Dr. Morton has just\naccepted a position as consultant with the adult education division\nof the Ford Foundation and will devote half of his time to this job.\nIt is at this point 100# secret. His assignment, I understand, will\nbe to make an inventory and evaluation of the adult education activi¬\nties of the extension division arms of the colleges and universities\nof the country—including educational radio stations. This latter\nassignment of his obviates my interest in our cooperating vigorously\nwith his atomic energy project. I think you might even wire him an\ninvitation to meet with the Board in New York if you get his letter\nconcerning the AEC business soon enough.\nAs I have indicated, this letter must be held in the strictest\nconfidence. In the first place, he does not know that I know of his\nRepresenting non-commercial, educational, radio and television stations, workshops, and production\ncenters, owned and operated by colleges, universities, school systems and public-service agencies."
}