{
  "id": "d466-35",
  "text": "ebruaiy 19# 19!>2\nPresident\nh*eb\nmm\nlew York City# N*I*\nMr* oa&bcmr 2-iegel\nBear ii*\nIt was good seeing you in Illinois and' you have my admiration still\nfor naming a good show* In retrospect, 1 doubt the value cf our visit\nto Pilbur in terms of its clprifie tion of any issues involved* I am\nnot disturbed about it, however, •. eca.se Hour is too busy to concern\nhimself about HAKE) business, including the Kellogg grant and he is further¬\nmore a thoroughly nice guy and we may depend upon his approval and support\nof practically anything we outline*\nI think the pirns we made for MSB seminars etc* are excellent and\nwill make our annual report, as well as our projects for next year, look\nvery good. I hope that next year we will e able to divert ore money for\nresearch than we have been able to do this year because of the emphasis\nthat was placed upon research in the original grant* In this regard# by\nthe.way, wouldn't it be & good idea for you. to write : 11 : 1. ©di&tely\nand request th t he begin right away the comparative analysis that bllbur\nsuggested, balancing BAI3 operations. (st tion logs, personnel, otcf) of a\nyear ago with a ccKapsrable week at this -point# hy guess would be that Balias\ncan dr: this with the aid of one part-time cretary for a couple of months\nat very little cost to us. Ibis seems to m to be a project for eallas\nrather than one which Jim and Pick can, cr should, handle and one which\nis a nisu.:.t9* If you agree with m on this, I would suggest that you con¬\ntact bxlbur immediately asking him tc get to work on it. It will take\nsome time.\nAfter this last meeting, I begin to feel that our operations are not\ntil just something we are planning to do but 1 am sudceutly aware that wa\nhave accoe^lished a great deal and now have scmo thing to show. I%ch of\nthis accomplishment may be attribute a directly to your leadership, tc\nyour being one jump bead in the thinking and planning#\nTurning to more immediate matters, do you want me to plot the agenda\nfor the Columbus meeting or will you? If the former# please compile a\nlist of subjects which you feel must be covered at Columbus -.nd we can\ngo over them at the Oklahoma meeting* If I am to be responsible for\ndrawing up the agenda# I will write each member of the Board about the\nmiddle of March ..sking for suggestions for the agenda and then compile\nthe agenda from those suggestions, as well rs suggestions Tom you# Jim#\nand from my own thinking* The Columbus meeting will be a rough session"
}