{
  "id": "d466-44",
  "text": "February 29, 1952\nMr* Seymour Siegel\n\\mc\nSrm Tork City, H.X.\nDear Si?\nIhaaak you for your letter of February 25 concerning the meeting\nof the Board at Columbus. The first general session of the Institute\nis at 8?00 P.M. on Thursday. Do you think that the HAEB Board can\ncomplete all of the necessary business from 9*00 Thursday morning\nuntil sis that same day or should we ask the Board to meet Wednesday\nevening with the Axecutiv® Committee meeting perhaps Wednesday at \\\n2*00\nSince several of the coascittee chairmen which you appointed at\nthe Gotham meeting are planning special sessions with their respective\ncommittees coincidental with the Institute, would it not be wise to\ncormmicate with these chairmen as soon as possible requesting that\nthey keep all day Thursday free for a full meeting of the Board and\nperhaps designating Wednesday afternoon and Wednesday evening for\nspecific time for meeting of committees? If we ask for a meeting of\nthe Board. Thursday morning or Wedneday evening, can N/JSB pay a portion\nof the expenses that will be incurred?\nPerhaps all of these are questions we can thrash out at the\nExecutive CoserdLttee meeting in Norman. However, the matter of a\nspecific meeting time of the Board should be set right away and members\nof the Board notified of it so they will not arrange conflicting\ncommittee meetings* If you agree with !rse on this, perhaps it would\nbe a good ioea for you to write mei&ers of the Board setting up the\nmeeting date. If you prefer, I will write them but I don't want to\ndo so without your approval*\nThanks for getting the Merton matter straightened out. I think\nDallas has been a little pro-nature in his conaminicaticns on the\nsubject but it is a good trait to have ideas formulated ai d get things\nrolling. The bey is a fireball and will work well with Morton.\nI shall be happy to serve as chairman of this coussittee and\nwill beep in mind our conversation of a more inclusive stuc^r of N/'E8\nstudies in conversations with Morton.\nKeep the old fightin* spirit high. Kill look forward to hearing\nfrom you.\nG&/ns\nSincerely,"
}