{
  "id": "d1354-3",
  "text": "News Notes\nPersonnel\n^ George E. Schnei'dewind appointed as¬\nsistant director of field services for NET,\nNew York. He was former program super¬\nvisor for WHA-TV, University of Wis¬\nconsin, Madison.\n^ David L. Phillips joined WPSX-TV,\nPennsylvania State University, as producer-\ndirector. Formerly with WMBD-TV, Pe¬\noria, Ill.\n^ Robert H. Ellis, manager, KAET, Ari¬\nzona State University ETV and assistant\nprofessor, Mass Communications Depart¬\nment, elected president of the Phoenix\nChapter of the Academy of Television Arts\nand Sciences. The first ETV broadcaster to\nserve the highest office of ATAS in the\nState.\n^ Mrs. Lela Jane Sumner appointed ele¬\nmentary science teacher for KLRN, Chan¬\nnel 9, San Antonio.\n^ Joe P. Wood, Superintendent, North\nEast Independent School District, San An¬\ntonio, elected Chairman of KLRN’s Ad¬\nministrative Committee.\n^ John R. Provancher, former assistant\nnews director, WOOD-TV, Grand Rapids,\njoined the Television staff of Western Mich¬\nigan University.\n^ Bob W. Rowland, former educational\ntelevision specialist with the Educational\nTelevision Program of the Office of Edu¬\ncation in Washington, D.C., appointed as¬\nsociate director of the Mississippi Authority\nfor Educational Television.\n^ Seymour N. Siegel, director, Municipal\nBroadcasting System, elected to the Board\nof Directors of American Friends of The\nHebrew University.\n^ Robert D. Bergeron, former Program\nAdministrator, Syracuse University’s Ex¬\ntension Division (University College),\njoined WEDH, Hartford, as director of\nContinuing Education.\n^ Mrs. Gertrude G. Broderick, educational\nmedia specialist, Media Dissemination\nBranch, Office of Education, named by\nMrs. Dorothea Kempa-Rohne, newly elected\npresident of the International Association of\nWomen in Radio and Television, to serve\non the Board of Directors. Mrs. Broderick\nis the Board’s only U. S. representative.\nEXPANSION:\nWETA, Channel 26, Washington, D.C.\nwent dark for several days in June, the\nshutdown marking the first step in major\ntechnical improvements under way. By mid-\nAugust, WETA expects to' increase power\nto more than one million watts, covering\ndead spots in the greater metropolitan area,\nwhich includes Maryland and Virginia sub¬\nurbs.\nSIDELIGHTS\nResourceful Knox College senior Ingrid\nBletzer could not get from Galesburg, Ill.\nto Amherst, Mass., in time for an inter¬\nview, so she sent the next best thing—a\nvideotape, which demonstrated beyond doubt\nher ability to handle first graders. The tape\nwas made as part of a Knox College pro¬\ngram recording student teachers in action.\nNAEB Personnel Service\nPOSITIONS AVAILABLE.AUGUST 1966\n(For information, write Miss Yasmine Mirza, Personnel Service, at\nthe NAEB in Washington. In order to be considered through these\nchannels, the reader must be an Individual Member of the NAEB,\nwith credentials on file with the NAEB Personnel Service. Non-mem¬\nbers can save time by sending the $15 annual dues and $15 place¬\nment registration fee at the time of inquiry.)\nAug I Public Relations Director for Big Ten University. Journalism background with\nwriting and public relations experience required. B.A. degree minimum re¬\nquirement. Salary range $6500-$7000.\nAug 2 Copywriter and Promotion Director for educational radio station at Univer¬\nsity >orf Alaska. Script writing and all standard promotion work (news re¬\nleases; program guide; advertising). Masters degree preferred; will consider\nBachelors. Twelve month position. Salary $9,600. Future opportunities in TV\npossible. Open immediately.\nAug 3 Large southeastern university has opening for a producer-director for its\nCCTV system. B.A. required. Science background helpful.\nAug 4 Experienced television engineer wanted to operate and maintain a CCTV\nmobile unit and to assume responsibility for the technical aspects of produc¬\ning video tapes for use in college classes. Salary dependent upon experience\nand qualifications.\nAug 5 Producer-director for northwestern ETV station. B.A. degree and willing to\nperform a variety of production assignments (all types of programs at all\nlevels). Consideration will be given k> candidates with limited experience but\nsubstantial training in broadcasting. Graphics and/or photography abilities\nare desirable but not essential. Nine-month position. Salary $5500-$6500.\nAug 6 Chief Engineer with professional experience and First-Class license. Duties\ninvolve assuming total technical responsibilities, including maintenance of\nstudio and transmitting equipment, supervision of full-time professional and\nstudent technical staffs, preparation of engineering reports, purchase of equip¬\nment, design and construction of new systems, and occasional on-the-air oper¬\nation of equipment. Salary $7000-$8000 plus liberal vacation, insurance and\nretirement benefits.\nAug 7 Producer-Director with M.S. or M.A. in Communications or B.A. or B.S. with\nextensive production experience. Creative person wanted for northeast state\nETV network.\nAug 8 Director of Programing or Program Manager with M.A. or M.S. in Com¬\nmunications desirable, with extensive experience in all phases of ’ETV produc¬\ntion and programing. Salary open.\nAug 9 Broadcasting Engineer. Outstanding opportunity with pioneer, educational\nradio and television station. Western university with small town atmosphere.\nWonderful family community. Salary commensurate with experience. An equal\nopportunity employer.\nAug 10 Producer-Director. Professional required. Staff appointment with usual bene¬\nfits. Large university with excellent facilities. Creativity encouraged and fos¬\ntered. Salary approximately $7,000 per year. Available Sept I, 1966.\nAug I I Leading lighting firm has an opening in its Sales Engineering Staff that will\nenable the candidate to deal with both educational and commercial Tele¬\nvision personnel and will offer the opportunity to design lighting control\nsystems for a variety of TV applications. A good technical background is es¬\nsential although a degree in Engineering is not required. Salary open.\nAug 12 Midwestern public school system has opening for a Radio Director. Position\ncalls for an outstanding candidate. Main responsibility would be setting up a\nprogram primarily used by elementary schools. So<me responsibility in teach¬\ning students at the college level in radio.\nAug 13 Maintenance engineer for radio-TV station of public school system in the Mid¬\nwest. Candidate should be able to perform maintenance on all studio and\nfilm equipment and FM and TV transmitters. Competitive salary.\nAug 14 Producer of in-school programs for elementary school. Preparation and pro¬\nduction of radio programs, newscasting, special program production and an¬\nnouncing. Must be able to initiate ideas for program series and pursue their\ndevelopment. Script writing required, as well as script editing. Liaison work\nwith teachers. Applicant should be able to handle typewriter for rough copy\nwork. Requires BA or MA in Radio, Speech, Theatre or in Education. Previous\nfull time radio experience desirable. Salary range $6000-$6200. University\nbenefits.\nAug 15 Radio-TV technician for Speech School for large midwestern university. Gen¬\neral duties involve supervision of students and complete maintenance of Radio-\nTV operation within the University. Minimum starting salary $7,000.\nAug 16 Electronic Technician with full technical and limited management respon¬\nsibility for all operations and maintenance involved with a closed-circuit TV\nplayback facility utilized in the distribution of ETV programs. Applicants\nmust have three years general experience in the field and two years special¬\nized experience in the maintenance and operation of television equipment.\n4\nNEWSLETTER"
}