{
  "id": "d728-160",
  "text": "NAEB HEADQUARTERS\nOctober 13, 19$2\nTOj NAEB Board\nFROM* Jim Miles\nGentlemens\nIn late August whan we were readying the fall offerings on the tape network, there\nwas considerable talk about MUSIC FOR THE CONNOISSEUR* All reactions we had received\nhere at headquarters indicated that it was far and away the most successful program\never put on the network*\nMr. Randolph*s position with WNYC is somewhat different from that of most of those\nwho appear on our stations for the love of it* He does not have a full-tin®, basic\nuniversity salary upon which to draw* Thus, any tims devoted to the preparation and\nairing of this program must be taken away from son® of his income producing effortso\nDave and Sy Siegel talked about this at some length and finally suggested that the\nnetwork pay $1.00 per program per station for the show. They then wrote me about it.\nI did not like the idea because of the extra bookkeeping involved and the precedent\nthereby set for shows on the network. I felt that Randolph was valuable to us and\nthat we should in some way retain him. We had discussed many times employing network\n\"consultants” and so it was my idea that Randolph be retained as a consultant.\nSpecifically, my deal was that I would propose and recommend to the board for con-\nsideration at the Minneapolis meeting that we”pay Randolph $1,000 for the fiscal\"'’\nyear 195<W3, during which time he would prepare at least three MUSIC FOR THE\nCONNOISSEUR series of thirteen programs each. Second, he would be on the lookout\nfor additional musical material in the New York area available for network use.\nThird, he would ba available for specific consultation work from time to tin®, but\nif we called on him to do this, we would pay his traveling expenses.\nRandolph agreed to this proposal and submitted immediately the first series of\nprograms of MUSIC FOR THE CONNOISSEUR. It is currently on the tape network and\nhas been accepted by fifty stations.\nHe has secured for us the rights to the Little Orchestra public dress rehearsal\nbroadcast, a nd we will offer these programs in the spring 0\nHe has agreed to come to the NAEB Convention at Minneapolis, and I have agreed to\ncover his expenses to that convention. Burton has him scheduled to appear Saturday\nmoning, November 8, on one of the general sessions.\nThis is the entire story0 I heartily recommend that you approve this proposal.\nThere is sufficient money in the tape network budget to handle it, and I do not\nbelieve it will be setting a precedent which we do not care to follow. I would\nlike to further reconsnend that this be made a matter for the agenda at the\nMinneapolis board meeting."
}