{
  "id": "d728-18",
  "text": "MINUTES\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nBOARD OF DIRECTORS MEETING\nAllerton House, Monticello, Illinois\nJune 8-9, 1951\nAPPENDIX A\n* * * * * ***■*■******■**■*■*#**■*■*#*#***#*■*■****##**\nMEMORANDUM TO THE NAEB BOARD OF DIRECTORS 6.8.51\nfrom Wilbur Schramm\nSubject: Report of Progress\nBackground of the Kellogg grant\nAt the Lexington convention the members of NAEB approved by vote the proposal\nI made to them at that time, speaking for my colleagues at the University of\nIllinois. Later I reduced my proposal to writing, and it was formally accepted by\nthe President of NAEB.\nThat memorandum is here available for anyone who wants to reread it. I shall\nreproduce briefly the pertinent quotes:\n\"Our chief interest in housing this network,” I said, \"is in being able to\nbuild around it a program of activities, services, and research which will improve\nthe efficiency and quality of the network and react to the benefit of all the\neducational stations.” With that purpose in mind the University of Illinois was\nto attempt to raise funds for such a program as the following: \"Purchase of\nequipment for multiple tape duplication.... Funds to operate this tape exchange,\n, providing that the member stations are willing to take over this basic operating\ncost on a gradual plan over a five-year period......A continuing series of\nAllerton seminars..A central office for the program, with a director to be\nresponsible for exchange of information, for such central services as promotional\nmaterials, and in general fo^naking the program of maximum use to the stations.....\nExperimental work.\nAfter the Lexington meeting, we entered at once into a long series of talks\nand correspondence with the W. K. Kellogg Foundation, who were mst friendly and\nhelpful. A tentative proposal was submitted before Christmas, a 100-page pro¬\nposal in extenso in February, and finally a printed formal proposal to the Founda¬\ntion-copies of which have been made available to your President-in March. In\nApril the Foundation Board approved the grant. There were however still a few\nthings to be worked out, and it was not until May 23 that President Emory W.\nMorris of the W. K. Kellogg Foundation was able to write me formally that the\ngrant had been approved. This meeting now assembled at Allerton was arranged\nfor the first available time after formal notice had been received."
}