{
  "id": "d728-19",
  "text": "-10-\nThe Grant\nThe grant is for a sum\nhis letter of notification,\nin the amounts indicated in\nof $21*5, 3$0, to be made available, says Dra Morris in\n\"to the University of Illinois over a five-year period 7\nthe proposal of April, 1951.\"\nThese amounts, for the five years, are respectively\nm&o\n$$o,5oo\n$1*5,500\n$Uo,5oo\n$3U*ooo\nas outlined in the printed proposal*\nThe first year's grant is tentatively divided: $19*350 for equipment for the\nnetwork, $21,500 for network operation, and $3l*,000 for the project built around\nthe network* Full details are in the printed proposal*\nThe University has not yet received the Foundation's check to cover the first\nyear's activities, but the check is expected momentarilyo Nor has the Foundation\nstated when it plans to announce the grant* Therefore, no publicity should be\ngiven the grant as yet*\nConditions of the Grant\nIn notifying us of the grant. President Morris said that the conditions in\nthe printed proposal, plus seven special conditions listed in his letter, would\nconstitute the basic agreement. The seven conditions are:\n”1. Any changes in the budget as submitted by you should be approved by\nthe Foundation in writing prior to the expenditure.\n\"2. Any annual unexpended balance will be deducted from the ensuing year's\npayment. If, however, at the end of the fifth year there is an unexpended bal¬\nance, we will give consideration to a request for its use to support the program\nfor an extended period of time.\n\"3. The fiscal year for this project will begin and continue each ensuing\nyear from the first of the month on which the initial payment is made.\n\"1*. The Foundation will expect to receive from the National Association of\nEducational Broadcasters an annual progress report and evaluation of the total\nprogram and a statement concerning your plans and budget for each ensuing year.\n\"5* At the close of each grant year it will be necessary that we receive\nfrom the accounting office of the University of Illinois, a signed financial\nstatement showing disbursements made under this grant.\n\"6. If in the development of this project it becomes necessary for the\nNational Association of Broadcasters to reduce its commitment, the Foundation\nwishes to reserve the right to do the same."
}