{
  "id": "d728-31",
  "text": "NAEB HEADQUARTERS\nFebruary 1* ly$2\nTO MEMBERS OF THE NAEB BOARD OF DIRECTORS:\nTo say that I am fed up with hearing about the so-called directory of\nEducational Stations” which Dallas had compiled would be the understatement of the\nyear® I think we can all agree on one thing* It was mislabeled. Dallas and I dis¬\ncussed this before he had it mimeographed and decided it was not a matter of grave\nimportance. Evidently we were as wrong as we could be. I would merely by-pass this\nat the moment were it not for your insistence that I cause to have prepared \"an ac¬\ncurate, up-to-date, list of NAEB members.”\nDallas has assured me, and I am sure you trust his honesty as I do, that\nthis listing was an accurate compilation barring clerical errors of the answers he got\nto a mail questionnaire* This questionnaire, I am sure, was scientifically designed,\nit was mailed to the best list available, repeated reminders were sent, and in the\nend, answers (which now seem inaccurate) were received from only forty-nine members.\nThe above process took the better part of a year.\nOn or about October 1, I sent letters to 117 educational stations. I have\nreceived, to date, replies from about forty-two of these. I also wrote to thirty-nine\nassociate members and to date have received answers from about fourteen* My experience\nwith past questionnaires leaves me to believe I may, by the issuance of several follow¬\nup letters, get twice the number of replies., This, of course, would by no means give\nus a complete Ust of members and their facilities. I suggest this will never be com¬\npletely up-to-date, that maybe in two or three years through a series of visits, re¬\nports, etc. we will know considerable about 90 per cent of our members. About all I\ncan promise you in the near future is an accurate list of those stations who have\npaid their tape network assessment fee and those institutions who have paid their\nNAEB dues. On a certain specific number of stations, perhaps thirty, maybe forty, I\nwill be able to supply detailed information including number and name of staff members,\nnumber of studios, hours on air, facilities, etc.\nVery honestly ray best attempts to devise a questionnaire which could be sent\nto any small number of stations or institutions has been fruitless. When you get be¬\nyond the sheer call letters, frequency, and power, you get into tremendous differences\nwhich only a personal evaluation can rationalize.\nI trust that this will, in some measure at least, show you why what has been\ncalled a \"simple housekeeping function” has not been completed.\nJSM:bc\ncc: Dallas Smythe\nH. B. McCarty\nSincerely,\nJim Milas\nExecutive Director"
}