{
  "id": "d728-44",
  "text": "MISCELLANEOUS CONCLUSIONS AND EBOOMMEHDATIONS\n1 General purpose of network., The network should devote its major\neffort to the distribution of well-planned and executed programs of significant\neducational and cultural purpose* It should offer a distinctive service of sub¬\nstantive programs having relatively long-term value0\nThis does not exclude programs of a timely nature, which require\nspecial handling, but such programs should,^ in view of present facilities;, consti¬\ntute a minor portion of the service.,\n2o \"Propaganda\" programs. A lengthy discussion was held on the in¬\nherent \"propaganda\" nature of programs oxi.gina.ted by governmental agencies, foreign\ngovernments and similar organizations, It was felt that no general, policy of\nexcluding such programs could be justified. Rather, each series should be judged\non its individual merits\nThe committees do not object to pro grains originated by governmental\nagencies, international organizations, and foreign governments > It does feel that\nthe network should not be used for indiscriminate promotion of such organizationsc\nSeries originated by such organizations should be judged on the same basis as other\nprograms«\n3<> Salley recommended that networks and other organizations producing\nprograms be approached regarding the release to the tape network of such outstand¬\ning series in their archives as, CBCss YOU ARE THERE, and NBC5s dramatizations of\ngreat novelso\nho Music programs• The committees generally agreed that music offerings .\nby the network should consist of programs of a distinctly unique character., The\nnetwork should not waste its time, money, and facilities* distributing music per¬\nformed by artists and consisting of compositions normally available on commercial\ntranscriptions, or re-' %-ngsv\nThere it so-s? doubt as to the desirability of distributing more or\nless traditional music pevfonned by the best college aM university groupa* This\nwould bear further examination* In fact, some study needs to be made before a\nfinal policy on musical programs can be delineated*\nThe in-school committee recommended that a questionnaire study be\nconducted to determine deadlines, and scheduling problems for in-school programs«\n6® The Network Acceptance Committee recommended that network headquarters\nissue a memorandum on the following?\na® Dubbing of network programs for re«u$c.\nb > Dubbing of network programs for non-broadcast u.se0\nc > Policy against supplying non-member stations with network programs.\nd > Policy against use of network programs by campus wired-wire 1 ess\nstations"
}