{
  "id": "d728-69",
  "text": "TRAVEL ••• HOTEL ••• MEALS INFORMATION\n\\\nEXHIBIT V^-A\nALL SFSCT'^TS OF THF NAEB REGION V CONFERENCE WILL BE HELD IK THE OKLAHOMA MEMORIAL\nUNIO\" BUILDING ON THE MAIN CAMPUS CF THE UNIVERSITY OF OKLAHOMA, NORMAN\nNORMAN, OKLAHOMA IS LOCATED APPROXIMATELY 19 MILES SOUTH 0* OKLAHOMA CITY\nIF YOU ARE COMING BY RAIL,*.NORMAN is on the Chicago-Galveston main line of the Santa\nFe with 3 trains daily each way-north and south. Some of you may find it more\nexpedient to come to Oklahoma City on the FRISCO, ROCK ISLAND or M K & T. Con¬\nnections at Oklahoma City for Norman by rail are not always convenient. There\nare busses every hour from Oklahoma City to Norman, but if you so desire, we\nwill be glad to meet you in Oklahoma 0ityo\nNOTE: You will be furnished Tax Exemption Certificates for rail and Pullman\ntravel. You must secure from ticket agent at time of purchase of accommodations\na RECEIPT for the same. This receipt must be saved and used in filing your\nclaim for reimbursement0\nIF YOU ARE COMING BY AUTO...NORMAN is located on U.S. Highway 77o (U.S. 66 inter¬\nsects 77 at Oklahoma City). Follow U.So 77 into Norman. If you are traveling\nsouth, tur# RIGHT at the FOURTH traffic signal; if you are traveling north,\nturn LEFT at the FIRST traffic light. After making turn, proceed on BOYD STREET\nto the SECOND traffic signal. Turn left here on ASP STREET. The Oklahoma Mem¬\norial Union Building is the SECOND building on your RIGHT. NOTE: Be sure to\nkeep record of mileage from city limit of your home town to city limit of Norman.\nIF YOU APE COMING Bv AIR...Braniff. American, Continental & Central Air Lines all\nhave flights into Oklahoma City^ using Will Rogers Air Port which is located\nsome distance from Oklahoma City. If you plan to come by air, it will be more\nconvenient for us to meet you at the air port rather than in downtown Oklahoma\nCity. Private planes may land and find accommodations at the University’s own\nair port in Norman.\nNOTE: You will be furnished Tax Exemption Certificates for air travel. You must\nsecure from ticket agent at time of purchase of accommodations a RECEIPT for same.\nThis receipt must be saved and used in filing your claim for reimbursement. You\nwill be allowed equivalent of 1st class rail and Pullman on air travel.\nHotel-like accommodations my be had at the Extension Study Center on the North Campus\nof the University. Reservations have already been made to house all of the delegates\nvery comfortably. Two people will be assigned to a room, but all rooms are commodious\nand furnished with single beds. The price per person per night is $1.75 Transporta¬\ntion to the Main Campus will be furnished, cars leaving at stated intervals. NOTE:\nYou must obtain a receipt for hotel accommodations no matter what the price. This re¬\nceipt must be used in filing your claim for reimbursement.\n«**#*#***#\nFor those arriving early, luncheon and dinner on the 2?th may be had in the Union8s\nbeautiful MING ROOK at reasonable prices. Breakfast on the 28th, in Will Rogers Cafe¬\nteria. All other meals on the 28th, 29th. and 30th will be group affairs and will\nbe served in private dining rooms of the Union#\nSchedule of prices as follows for group meals: Breakfast, $1.25; Luncheon, $2.00;\nDinner, S3.00; tentative reservations have already been made for all group meals.\nNOT*': Delegates will purchase^ meal tickets for all group meals at time of registra¬\ntion. You must keep a record of what you spend for meals."
}