{
  "id": "d728-74",
  "text": "EXHIBIT VIII\nRESIGN V* NATIONAL ASSOCIATION EDUCATIONAL BROADCASTERS\nTO___DATE March 14* 1952_\nFROM John W* Dunn* Regional Director_SUBJECT Regional Conference\nSome of the ACTIVE members have suggested that stations either send in or bring In\nto the conference exhibits of forms and materials used in transacting station busi¬\nness, e.g., station logs, work sheets for engineers, recording notices, etc® If\nmembers care to do this, we‘ll furnish space for exhibits*\nPresident Seymour Siegel informs us that Wilbur Schramm may be with us for the con¬\nference* Wilbur is one of the outstanding authorities in the field of communications\nand heads up the Division of Communications at the University of Illinois *\nJim Miles reports that conference members will have the opportunity of hearing the\nfirst production in the series. Our American Heritage* Some fine acting here*\nThe Executive Usmaictee of Wiui»i>-S5ieg6l, Ausmus, Paulu, Schooley & Mile©--*fill be\nin session here on the 27th* This assures us more than ever that these outstand¬\ning leaders in educational radio will really be here for the conference*\nMany of you are taking advantage of NAEB’s generous offer to provide hotel and meals\nfor TWO delegates if 1st class transportation and Pullman is applied on car expenses\nto Norman* This is a fine spirit and we appreciate it very much*\nHere is a check list which we want you to study very carefully. If there isn’t a\ncheck mark in any of the columns by the side of your institution, please send in that\ninformation which we have requested just as soon as possible* WE NEED IT in order to\ndo our job of running the conference for you.\nCONFERENCE INVITATION CONFERENCE TRANSPORTATION, MEALS QUESTIONS FOR\nSENT TO INVITATION HOTEL INFORMATION SATURDAY MORNING\nACCEPTED RECEIVED FROM MEMBER SESSION RECEIVED\n--!\n1\n1\n£\nUniversity of Kansas\nKansas State College\nTulsa University\nOklahoma A & M\nAlbuquerque High School\nOkla. City Board of Ed*\nSt. Louis Board of Ed*\nTexas Western College\nLouisiana State Univ.\nHave you started work on YOUR SELF-EVALUATION report for the afternoon session of\nMarch 29th? Remember: TWO SESSIONS of the conference depend on this self-evaluation\nwhich we’re asking all of the active and associate members of Region V to prepare\nIN WRITING and present*\nDon’t forget that it’s less than WO WEEKS until the 1st Regional Conference ever\nheld in NAEB convenes* YOU can’t afford to miss this conference.\nTHE CONFERENCE NEEDS YOU,\n,YOU NEED THE CONFERENCE"
}