{
  "id": "d1562-0",
  "text": "Office of Executive Secretary\nUrbana, Illinois\nFebruary 15, 1940\nEditor9e Notes Every NAEB member should be interested in progress;\ntherefore, should be interested in frequency modulation* The\nfollowing article, prepared by Jim Ebel, Chief Engineer of WILL,\nis' presented here to whet your interest.\nFREQUENCY MODULATION\nBy A. James Ebel, Chief Engineer, WILL\nFrequency modulation, is it just a grand pipe dream or is it the\ncoming thing in radio broadcasting? That question is before the\ncommission, the industry, and the general public today. Of more\nimportance to us is, where does educational broadcasting fit in this\npicture? The answer to this and many other kindred questions is not\nat hand at the present time. It is one of those intangibles with\nwhich we will have to live for several years before anything of\ndefinite value will be known.\nOur purpose in presenting this discussion is to outline some of the\nestablished facts and then to raise certain questions which axe\npertinent. No attempt will be made to discuss the technical operation\nof frequency modulation because the author is far from an expert on\nthe subject. Rather, we have included a partial bibliography of\nfrequency modulation which may be consulted for that information.\nFirst iet us review the advantages of the frequency modulation\nsystem. Probably the outstanding attribute of the system is the\nnoise reduction. For wide band frequency modulation this can be shown\nto be 35 DB, Note that this is reduction and not elimination.\nSecondly, the system can transmit a wide range of audio frequencies\nwithout increasing the signal to noise ration. Thirdly, the system\nfrom transmitter input to discriminator output (i.e. seoond detector\noutput) exhibits a greater dynamic range for the transmission of\nmusic. In the fourth place, due to the limiter action the interference\nratio between stations is two to one Instead of 35 to 1, simplifying\nthe allocation problems insofar as a single frequency is concerned.\nAnd, finally, wide band frequency modulation has a number of\nengineering niceties which must not be overlooked. All of the host"
}