{
  "id": "d1562-1",
  "text": "NASB NEWS LETTER...,.Feb 15, 1940,•♦.Page 2\nof problems caused by the variation of amplitude at high powers are\neliminated* Linearity need not b® maintained beyond a limited\ndegree both in transmitter radio frequency sections\"and receiver\nradio frequency and intermediate frequency sections. In some respects\nit is almost a dream come true to the operating engineers.\nNow having examined the advantages of this system, let us mention a\nfew of the disadvantages. In the first place a wider band is needed\nfor each allocation (200KC for frequency modulation, 30KC for amplitude\nmodulation of equal fidelity). In the second place there will be a\nvery definite adjacent channel problem because the action of the\nlimiter tends to nullify the selectivity curves of the radio frequency\nand intermediate frequency sections. In the third place, service area\nis limited to about 100 miles over flat terrain (note that trans¬\nmission is possible beyond the first horizon). However, frequency\nmodulation will give more coverage per watt up to a oer^aln point.\nAnd in the fourth place the receiver tuning problem is rather difficult\nBecause of shape of the discrimination characteristic, each station\ncomes in at three points, two of them giving rise t°*ather poo\nreception. (One solution is the use of push button tuning, with all\nits evils)\nWith the above material in mind, let us raise two more\nquestions. First, does the listening public want^^fidelit^al ^\nsecond, cannot amplitude modulation transmit as high fidelity as\nfrequency modulation1?\nThe widespread use of tone controls on ^e fadioe of present day\nleads us to wonder if high fidelity is realiy desired. It is true that\nthe high tones in most receivers are unpleasant to listen to because\nof distortion and unequal distribution.\naverage receiver outs off between 4,000 and 5,000 cycles a true\npicture of the high tones is not presented, especially w&en the\nbass is often attenuated at the same time. However, the economic\ndemand.8for thepoor present day receivers is further reason to wonder\nabout the acceptability of high fidelity.\nThe fundamental listening habits of the American people are tied up\nplay bridge or engage in other diversions.\nFurthermore there is the question a8 gmi 11ed* at its normal\nbroadcast stations \\s . oonsldsratlon they most\nSU'diu “ STSS old question of quality ««»•\nquantity.\nAs pessimistic as this may seem it does to°\ns' hsunsu^y^j .gs-"
}