{
  "id": "d1562-2",
  "text": "Page 3\nuHAEB HEWS LETTER*...Feb 15, 1940.\nrespects; there is no reason why their listening habits cannot be\nchanged. Oddly enough however the education could well start at\nhome* I am not sure that all educational stations and their personnel\nare ©old on high-fidelity themselves*\nAssuming for the moment that high fidelity is considered desirable\nlet us consider the question as to whether frequency modulation is\nthe answer to the problem, whether satisfactory results may be obtained\nby amplitude modulation. A number of studies have been made to\ndetermine what the maximum frequency need be for high fidelity\ntransmission. The answer seems to be that very little if any improve¬\nment Is gained by transmitting frequencies above 10,000 cycles*\nRecent studies with respect to permissible distortion seem to\nindicate that with wide frequency response the figure must be\nreduced to two percent.\nLet us now examine a typical high fidelity system in the light of the\nabove questions. The allowable dynamic range—i.e* volume range\nbetween the softest and the loudest passages, is limited on the one\nhand by the neighbors who will probably object to full volume\npassages and on the other by the intrinsic noise level of the room.\nThis limits the dynamic range in the listeners room to not more\nthen 60 DB and often as in the case of apartment buildings to a much\nlower figure. Considerable frequency distortion is introduced by\nstanding waves in the listening room, spatial distribution of the\nradiated sound, and the variation of aosurption with frequency.\nRemember, all of these limitations are introduced by environment\nbefore the reproducing system is even considered.\nThe next link in the system is the loud speaker. The best speakers\nat the present time introduce considerable frequency and amplitude\ndistortion. The amplitude distortion is of two types; nonlinear\ndistortion and transient distortion* The second type is most\nobjectionable and contrary to common belief occurs at both low an<I\nhigh frequencies. It is a type of distortion which tends to make the\nhigh notes sound more piercing than normal.\nIn the audio amplifier of the receiver very little distortion of\neither type need he introduced. The noise level is up slightly\nhowever, knd tends to curtail the dynamio range to a minor degree.\nAll of the distortion considered thus far is oommon to both systems\nand will not he ohanged. hy the ohange in system of transmission.\nTaking the next link to he from transmitter input to detector output,\nit is'agreed that the F. M. system will have a deoided advantage\nover A.M. with respect to noise level. Therefore the dynamio remge\nof this section of the transmission system will he wider for F.K.\nthan fox A.M. However the A.M. system oan he made to have a dynamio\nrange of 50 DB. With respect to frequenoy andamplltudedlstortipn\nthe systems oan he made of equal fidelity, although the BalJaiSZSl\nIncreases with an increase of acceptance, band ini the sys .e^\nWhen we consider the speech inp4t systems which are oommon to both\nA.M* and F.M. we find that there is a further limitation of the"
}