{
  "id": "d1562-5",
  "text": "HAE8 NEWS LETTER,...Febo 15, 1940...Page 6\nWier, I, R, s Frequency Modulated Transmitters, Eleotronios. p. 30,\n(Nov. 1939) o\nFrequency Modulation—A Revolution in Broadcasting, Electronics.\np, 10, (Jan. 1930).\nShelby, Robert E*s A Gathode-Ray Frequency Modulation Generator,\nElectronics, p. 14, (Feb. 1940).\nCarnahan, 0, W0 and A. V. Laughren* Frequency Modulation in\nTelevision—A Sympositim, Electronics, p. 26, (Feb. 1940).\nFM HEARING POSTPONED\nAt the request of a number of interested parties for more time in\nwhioh to complete their material, the informal hearing before the\nFederal Communications Commission in the matter of aural broad¬\ncasting on frequencies above 25,000 kilocycles, whioh was scheduled\nfor February 28, 1940, has been postponed to March 18, 1940.\nThe final date for the filing of written statements, sketches,\ndrawings, eto., in connection with argument, has been extended to\nMarch 11. In order to expedite the proceedings, witnesses will\nnot be permitted to read prepared statements into the reoord during\nthe hearings.\nFCC TO ACCEPT EXPERIMENTAL F-M APPLICATIONS ON NON-BROADCAST BANDS\nTo obtain more factual data about frequency modulation for services\nother than broadcast, the Federal Communications Commission today\nannounced that it will accept applications for such experimental\nauthorisations on the frequencies allocated to those services\nabove 30,000 kilocycles.\nThis applies to such services as emergency, aviation, and those\nmiscellaneous radio services not directly involved by the Commissions\ninformal engineering hearing, scheduled to begin February 28,\nprimarily to consider frequency modulation as applied to the standard\nbroadcast service.\nFrequency modulation is claimed to offer definite advantages over\nexisting amplitude modulation systems in the police end aviation\nservices. In the police service, eaoh system is under the direct\ncontrol of one licensee who can plan and control the installation\nand operation of both the transmitting and receiving systems.\nThere are approximately 1,000 police radio systems with more than\n6,000 transmitters (including headquarters and patrol oars' now\nusing amplitude modulation.\nOn the basis of the reports required to be submitted under the\nexperimental rules, and after observation of operation by Commission\npersonnel, decisions will be reached as to whether and under what\nconditions frequency modulation can be regularly authorized for\nuse in the non-broadcast services."
}