{
  "id": "d1562-6",
  "text": "NAEB NEWS LETTER\nPage 7\nDecember I, 1941\nOregon, states, *'Do ‘you recall how we jsed to i ;-r 'duri no 1917\nAND 1918? MUSIC WAS A MORALE BUILDER THEN, AND IT IS NO LESS\nOF A MORALE BUILDER TODAY.\" MUSIC FOFJ MORALE—.—T* iAT IS THE SLOGAN\nWHICH MAKES THIS PROGRAM A VITAL FACTOR IN REALISING THE KOAC\nSchool of the Air theme, \"The -American 'hild i a kiag Demo¬\ncracy* M\nEvery day those of us in thf United St/ves come to healizz more\nTHE IMPORTANCE OF OUR SOUTH AMERICAN NE| HB' * HE AMERICAN\nCHILO SHOULD BECOME AS CON* ERRANT WITH *HE L Ti M AMERICAN CUL¬\nTURE AS HE IS WITH THE Cl f TURfc QF OLD El .'POE, THIS IS VITAL\nIN ACHIEVING PAN' AmEFWWI UNDERSTAND! NG » ' SOL I DA ft T Y * iV.RS.\nMarie Ring Erickson, 'rofuSsor of Art m the Oregon Uollege of\nEducation, has made .n extensive research to compile a list of\nVISUAL MATERIALS TO BE LAAQ IN THE CLASSROOM AS SUPPLEMENTALV\nAIDS TO A WEEKLY P iOGR AM Oi* PAN AMERICAN ART* MRS. ERICKSON\nWILL PERSONALLY CONDUCT THE SERIES*\nWith world affairs moving as rapidly as they ar/today, it is\nNOT D1FF10*-T for ADULTS TO Kl*.£P ABREAST Of* THE TIME, BUT IT IS\nA NEAR ,*VPOSS I 8$. Lf TY FOR CHILDREN TO REAL I F.E HOW WORLD SHAKING\nEVENTS WILL EFFECT THEM. THE ORDINARY NEW:; BROADCAST MOVES TOO\nsv ,ruY, IS TOO FULL OF LARGE WORDS NOT YET INCLUDED IN ELEMEN¬\nTS ■< VOCABULARIES, AND SHIFTS FVOM EurC^C 10 ASIA AND BACK!-\nAmerica in such rapio succession, that it is far beyond the\nCOMPREHENSION OF CHILDREN*\nBecause a knowledge of current events is important in the under¬\nstanding OF DEMOCRACY, THE KQAC SCHOOL OF THE AlR PRESENTS A\nSUMMARY OF WEEKLY EVENTS IN A PICTORIAL STYLE THAT IS SIMPLE\nENOUGH TO BE UNDERSTOOD BY STUDENTS IN THE INTERMEDIATE GRADES*\nThat this type of broadcast is achieving the desired result is\nEVIDENCED BY a TYPICAL LETTER RECEIVED FROM THE TEACHER OF A\nONE-ROOM SCHOOL NEAR ALBANY, MRS* U H. VaNDERPOOL*.\n“I FEEL THAT THE NEWS BROADCAST IS VERY OUTSTAND ING\", SAYS MRS.\nVANDERPOOL* 11 I T DOES MORE TO KEEP UP INTEREST IN CURRENT EVENTS\nIN OUR SCHOOL THAN ANY OTHER SOURCE*’1 ^\nOther highlights of the KOAC School of the Air broadcasts include\nA PROGRAM ON CHILD READING, DIRECTED BY Ml SS MARCELLA HlLLGEN,\nCHILDREN1S LIBRARIAN IN THE CORVALLlS PUBLIC LIBRARY* ALONG WITH\nATTRACTIVELY TOLD STORIES, MISS HlLLGEN GIVES PARENTS TIPS ON\nCHILD READING, WITH SPECIAL ATTENTION PLACED ON BOOKS THAT EM¬\nPHASIZE DEMOCRATIC LIVING*\nMiss Dora B„ Sheffsky, supervisor of the 6th grade in the Monmouth\nTRAINING SCHOOL, IS PRODUCING A GROUP OF INTERVIEW PROGRAMS AND\nSHORT DRAMATIZATIONS ON THE THEME OF SAFETY AND HEALTH, BOTH OF\nWHICH ARE ESSENTIAL TO DEMOCRACY."
}