{
  "id": "d1004-13",
  "text": "MEMORANDUM\nOctober 21, 1957\n10 : Board of Directors, National Association of Educational Broadcasters\nFROM : Irving Rc Merrill, for th9 Research Committee\nSUBJECT : Purchase of the Nielsen Coverage Study \"by the Association„\n1* At the August meeting of the Research Committee, it was unanimously\nagreed that the Association he urged to purchase \"NCS 42,n a nation-wide radio\nand television coverage study conducted in the spring, 1956®\n2® One provision was attached: the price must he right, Merrill was\ndelegated to follow through, in cooperation with Paulu and Skornia, on negotia¬\ntions already iniated. On October 2, Skornia and Merrill met with Mr, John K,\nChurchill of the Nielsen Company in Chicago, We were convinced that the Company\nhad made a final offer,\n3, Following this meeting I have carefully examined the situation again,\nand on behalf of the Research Committee submit the following recommendations:\na. Purchase of Complete Circulation Reports, \"CCR”, consisting\nof data for both television and radio showing, by State,\nfurther broken down by counties (listed alphabetically) for\nall stations having reportable coverage in each of these\nareas, Price $1,155»\nb. Purchase of an additional copy of same data, bound separately\nfor each State, separate volumes for television and radio.\nPrice $ 60,\nTotal $1,215.\n4, What do we get for $1,215?\n1 Bound volume giving coverage data county by county\nfor the entire nation for radio\n1 Bound volume giving coverage data county by county\nfor the entire nation for television\n46 State folios, giving coverage data county by county\nfor the State for radio\n48 State folios, giving coverage data county by county\nfor the State for television\n5, Row would this be used?\na. Keep the bound volumes as a permanent reference at NAEB head¬\nquarters „\nb. Ship out, at individual member station request, the appropriate\nState folio, letting the member photostat, etc, pertinent pages,\n(Pm positive this is o,k, with Nielsen, Harry!)"
}