{
  "id": "d1004-134",
  "text": "PICTORES PICTURES PICTURES PICTURES\nPICTURES\nPictures to tell stories, pictures that illustrate the powers of AV\nmaterials, pictures that are important, pictures that are technically\nsuperb, pictures you are proud of, pictures you'd like to have in your\nown files.pictures'.\nDAVI's new official and professional journal INSTRUCTIONAL MATERIALS\nneeds pictures.\nWe need good pictures first of all for the front cover.\nHere the picture will be set in a black background\nor wide border, hence it should be light rather\nthan dark.\nWe need pictures to illustrate articles.\nWe need pictures that really tell picture stories, stories\nthat use only small blocks of print.\nTechnically , our requirements are:\nPictures for the cover will be 7i *;* bled on right and\nbottom.\nThis is essentially a vertical picture and will probably\nbe cropped from an 8 x 10.\nWe would like the negative in order to play around with\nvignetting, cropping, and intensities.\nPictures for the interior of the magazine.\nWill run all sizes. If we really had a \"world beater\",\nwe would give over a full page to it, size 8j x 11^.\nWe would like the negatives of these pictures as well.\nWe would also appreciate receiving good line drawings, of the kind that\ncan be used as borders, or can be used as art work to tie in with specific\narticles. As a starter, good line drawings of children at a sand table; an\ninstructor at an overhead projector; children viewing a picture; children\nclustered around a model; all kinds of projectors and recorders, and other\nequipment such as cameras, splicers, and the like. We hope to use many of\nthese on the borders of articles.\nWhat kinds of pictures should they be? What kinds would you like to\nsee in your publication? What kinds of pictures are \"good\" pictures for\nthis purpose?\nWe will give credit for all pictures published and, where requested,\nwill return the negative. Please send pictures to DAVI headquarters,\n1201 Sixteenth St., N.W., Washington 6, D. C."
}