{
  "id": "d1004-134",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nOFFICE OF EXECUTIVE DIRECTOR\n14 GREGORY HALL\nURBANA, ILLINOIS\nApril 15, 1958\nDr. Sam I. Becker\nExecutive Secretary\nTelevision Center\nState University of Iowa\nIowa City, Iowa\nDear Sam:\nBefore Paulu says Skornia \"will tell you\" (a natural remark, since we\nkeep the Kellogg \"books\"), 1*11 react to your letter of April 11.\nYou can make $2,000.00 worth of plans, for sure. Whether for publications,\nprojects, meetings, committee travel, or grants-in-aid, or a combination,\nwill be your committee decision.\nAs you know, we have a request, still in draft stage, in Ford hands (in¬\nformally: it was sent to Weiss; he was routing it for reaction when he\nwas killed in plane crash). Research was #1 on our new request list\n($>87,700.00 per year for five years). We can*t count on this yet. We\nmay get all, part or none. We*11 have to move fast if and when we do\nget it. Some pre-thinking on possible Research Director might be in\norder, but I*m too superstitious to suggest your passing this on to anyone.\nI would earlier have said I thought we*d get all or part. Now I don*t know.\nBut we *11 keep trying.\nIf we need to take an interim trial grant in research, we are also ready\nto discuss with Ford a $30,000.00 or so one year grant. This is the same\nsize as we have currently for engineering. It provides for an engineer,\nsecretary, space, supplies and expenses and some travel, publication, and\nother expense. I trust you* 11 go along with all this.\nWe had hoped to be further along by now. As it is, you can count on the\nminimum, hope for the compromise at least, and pray for the maximum.\nI agree with your concerns regarding continuance of grant-in-aid, in view\nof our minimal budget, unless we call *em specifically graduate student\ngrants or some such. To an institution $200.00 or so looks weak in\nprint, as well as being weak in fact. But we *11 follow any directives\nthe committee sets up, as we always try to do, subject to Board blessing.\nThe revised timetable should be a must (for research and other grant-in-aid\nprograms, I might add)."
}