{
  "id": "d1004-138",
  "text": "®alia Ijaasee\nUNIVERSITY BROADCASTING SERVICES\nApril 28, 19$8\nMr# Sam Becker, Chairman\nNAEB Research Committee\nTelevision Center\nState University of Iowa\nIowa City, Iowa\nDear Sam:\nI*m sorry I won’t be able to attend the Institute. I don’t know if I wrote\nto you about the matter of being bounced by a piano teacher who has just\nbeen made Chairman of the new Dept, of Radio and Television——the instructional\nside, that is, and who will use the transportation money set aside for my\ntrip in order that he may attend# If I sound a bit sour about it, I am# —After\nall since the fellow has only played five or six piano concerts on radio this\nmakes him an expert in broadcasting instruction? —Nuts.\n1*11 take your letter point by point:\nla I am very much in favor of continuing the Grants-in-aid.\nl)Yes, we need to reSefine the purpose, this depending upon\njusl^jd^ tryipg tQ *gach.\nneed to be very specific in our announcements about what expenses\nf we intend topay# As the voting turned out lust time, this didn’t\n7®e^mucTY*^ifferenee, however, since the situation might be different\nnext time, we should spell it out now. Actually, we used to have a\nclear idea as to just what we would pay for, but these ideas were lost\nwhat with the change in committee membership#\n3)Right. Announcements should go out early. We haven*t been able to do\nthis before but I see no reason why there isn*t arrive time to get it\noff on the right start for this fall.\nU) I would just as soon see all of the $2,000 used for the Grants, but\nfinal action on this depends upon what the committee sees for other\nneeds.\nb Some of this money could be used for committee projects. The idea strikes\nme that committee projects should be approved right along with those\nthat are submitted by other applicants.\n1) The importance or rather, ”how much” depends upon the quality of the\nother applications.\n2) What committee project? —I see no limit on this—again it depends\nupon how many good projects are submitted. 5flovi*\nc. If the project is important enough we certainly.use some money to get\nit published. —Didn’t NAEB pay all of the printing costs for the Monitor\nstudies.\nd. If we only have $2,000 I would not like to use any part of it for a\nmeeting. With such a small amount, although certainly an improvement\nover what we’ve had before, it seems to me we should apply it directly\nto as many projects as we can.—If more than that becomes available,\nthen we better meet as soon as possible."
}