{
  "id": "d1004-148",
  "text": "rELE-DIGEST*\nfor 5 PROGRAMS on\n[E NATURE OF THINGS”\nOver-all Format:\nIn this series Jiminy Cricket dramatizes information pertaining to the five animals:\nThe Camel, the Elephant, the Beaver, the Giraffe and the Horse. Each program is some¬\nwhat biographical in nature with time spent on the historical as well as the modern\nbackground of each animal.\nJiminy Cricket’s “Answers To Things”\nLots of things puzzle me and when Pm puzzled do you know what I do? I look it up\nin books. That’s where I find out the answers to things.\nJiminy’s Song:\nnHr-*-=-1 ...-T-—v-\nC7\nn.i ./3.U j i.^\\i M i 3=\nWHY DOES TU£ W0R1D GO A - ROUND AND ROUND? AND WHY DOES A BlP-D HAVE\ni-Jo 1\nWIN06?\nf Cj\nwhy doesthe rain come a-rain- in’ down that's the nature of\nthings 1\nThe Camel\nProgram: Camel comes from the ancient Semitic word ‘gamal’—to carry. The camel\nis called the “ship of the desert.” Camels carry heavy loads (maybe as much as 1300\nlbs.) across the desert, all day, at 3 or 4 m.p.h. This great burden bearer has been, for\ncenturies, man’s most useful animal.\nFifty or sixty million years ago the camel was about the size of a rabbit and lived\nright here in North America. But this little camel gradually grew larger and more like\nthe camel of today. Long ago, the single humped animal went to Africa and the two¬\nhumped camel travelled north and across Siberia. So, the camel vanished from\nNorth America.\nThe Camel is well adapted to life in the desert. His eyes are set high up for good\nviewing. Long lashes protect them during windstorms. His nostrils close up to keep out\ndust. His strong, sharp teeth can nip tough roots and thorns. A Camel can hold enough\nmoisture in his body to last for about 9 days. His hump is a kind of lunch box that can\nhold as much as 80 lbs. of fat. His feet are large so he can walk on the sand without\nsinking down. When he walks he picks up both legs on one side of his body at the same\ntime. This makes him hard to ride. Camel milk is used extensively by the Arabs. The\nCamel is covered with fine, soft hair which man uses for cloth.\nThis Tele-Digest has been prepared by Mrs. Margaret Divizia, Supervisor „ . , 1_rr ,\n• r, aj-ts- ic t > , ,’ . - ^ Copyright 1955 Walt Disney Productions\nm Charge, Audio-Visual Section, Los Angeles City Schools. All Rights Reserved Printed in U.S. A."
}