{
  "id": "d1004-29",
  "text": "Hr* Kenneth Harwood, Chairman\nJanuary 16, 1958\nPage 2\nIn the light of this, 1 would place Oregon fourth, even though\nthe application is far too vague. He can't have thought about this\nfor more than fifteen minutes. E.g., he talks about the teacher*\nproducer relationship •* certainly an Important area for study —\nbut most of the proposed questions for his interviews have nothing\nto do with this relationship. It seems to me that much more thought\nneeds to be given to this project* He needs to think through the\nspecific hypotheses which he wants to test or the major questions\nhe wants to answer. The content of his interviews — and planning\nfor his .Interviews — can only be done in the light of these hypotheses\nor questions* I think that we should also know his sample else*\nThis Is not worth more than $250. •* at the most* 1 would say, how*\never, that if his report Indicates that he is on a worthwhile track,\nand has answered these questions, we would look favorably on an extended\nproposal next year*\nHebraska 1 would place fifth* She has some interesting posslblli*\nties but this is all so vague that I am not at all sure that she plans\nto take advantage of any of these possibilities* E.g*, under extra\ntypes of research which she says \"could91 be done with extra money\n(by the way, does that mean that all of these will be done if we give\nit to her???)\n1* a* Attitude tests from Purdue* What hypothesis does she\nplan to test with this? Used only at the end for view*\ning groups will probably contribute nothing to anyone's\nknowledge* These measures are only relative*\nb* What is the purpose of measuring attitudes toward tele*\nvision and toward these specific topics? What valid\ngeneralisations will she be able to make when she gets\ndone?\nc* This does not take more than a few dollars* A decent\nclerk can get this Information and tabulate it in a few\nhours.\n2* Says that she is going to analyse additional groups. What\nkind of analysis? For what purpose? To test what hypotheses?\n« She will vary the discussion procedures for what purpose?\nShe would measure the effect on what? Again, what hypotheses\nwould be tested by this process?\n3"
}