{
  "id": "d1004-35",
  "text": "-2-\nApxdl 19, 1955\nMrs* Anna L* Hyer\n\"I suggest the inclusion in Part IV of the bibliography AUDIO RECORD,\nSept.-Oct., 1954, 1954-1955 Tape Recorder Directory published by Audio\nDevices, Inc., 444 Madison Avenue, New York, N. Y. (Note by H.J.S.i\nI’ve added one)*\n\"I would revise the second and third paragraphs under £e&~\nduction Par. 4, P* 32, as follows t\n\"The recent development of television camera equipment using vidicon\ntubes made possible a complete television video system (not including\naudio) with two live cameras for around $12,000. This equipment, however,\nhas certain limitations which should be recognized before its purchase.\n#l) present state of vidicon equipment development requires a minimum of\n200 foot candles of incident light for good picture quality. Image\northicon cameras (professional TV type) can make acceptable pictures with\n50 foot candles. This high light level requirement necessitates studio\nair conditioning and in one instance cost of air conditioning for a\nvidicon studio was four times the cost of the vidicon equipment.\n**2) Picture quality of vidicon equipment is not adequate for \"on the air\"\noperation except in isolated ooramunities having no other TV service.\nMuch vidicon equipment is made for industrial closed circuit work and\ndoes not supply the necessary synchronizing pulses or meet FCC requirements\nfor on the air operation.\n\"3) Vidicon camera equipment for training purposes should have adequate\nsize viewfinder kinescopes. A 3\" viewfinder is too small to adequately\njudge definition or focus especially on a green phosphor screen.\n\"If distribution of the video signal over a considerable distance is\nrequired, some type of non-radiating transmitter such as a Du~nitter or\nMonitran will be required as well as a coaxial distribution system frcm\nprogram source to the receiver locations. The video signal alone cannot\nbe transmitted over coaxial cable for any appreciable distance without\nequalization. By the use of a closed circuit transmitter, both audio\nand composite video signals may be transmitted for several thousand feet\nwith good to noise ratio. Ordinary VHF television receivers may\nbe used without modification as monitors.\n\"A comparable field type image orthicon professional TV camera system,\nincluding two cameras, sync generator, switcher, and master monitor, will\ncost in the neighborhood of $45,000.\"\nI hope this is helpful. Let us know when we can be of further help.\nP. S. This should be a very fine manual. Congratulations to the people\nwho have prepared it.\nSinoerely,\nHJStjy\nEnclosure\nHarry J. Skoraia\nExecutive Director"
}