{
  "id": "d1004-60",
  "text": "23\nsufficiently compact and easily used (Fig. _).\nHSfhen the number of titles exceeds 2000, it is well to consider a drum type\nfile, like the Cardineer, which will accommodate up to ££00 cards (Fig. _)•\nThese cards are usable for twelve months* They slip into and out of a locking\ndevice on a rotating drum, which can be turned either manually or electrically\nto locate any cards. Much booking time and space is saved by the use of this\ntype file when large numbers of titles are regularly dealt with.\nThe problems involved in developing a uniform procedure for the booking of\naudio—visual equipment and materials are many. Procedures in use range from\nthose in which all equipment is furnished \"free\" for campus needs to a most com¬\nplex system of internal charges for all supplies and equipment* Booking proce¬\ndures need constant evaluation, study, and improvement.\nAccurate information on all costs of inventory, on costs of servicing and\nmaintenance, on transportation, and other costs of day-to-day bookings and\nservice should be maintained. Records should be kept of campus as well as off-\ncampus service (Fig. _). In practice, a cost accounting form maybe prepared\n'in triplicate. The first sheet is the booker!s record, copy two is the user*s\nconfirmation record, and copy three, in a more durable weight, is the permanent\nbookkeeping and accounting card.\nMost educational institutions have found that operator assignment sheets\nare necessaiy for each job. These sheets also serve as an accounting-data\nsheet from which payroll time forms are made up for each operator. Visual\nschedule boards (Fig. _) are recommended as a means of providing complete in¬\nformation on operator assignments and the location of equipment and materials.\nRecommended space allocation for booking of materials, equipment, and\noperators: 100 - UOO sq. ft.\nb. Storage of Materials - The proper storage of instructional materials is\nimportant to insure good service. Materials cannot be of service when they are\nunsystematically packed into overcrowded spaces, stacked carelessly in cabinets."
}