{
  "id": "d1004-62",
  "text": "2$\nthese.\nObviously, attempts to store in the center all the instructional materials\nwith which a center deals would be not only unsuccessful but would be highly un¬\ndesirable. Some of the chief functions of the center, those of expediting dis¬\ntribution; promoting wide use of many types of materials; encouraging individual\ninitiative in seeking out and securing new materials and ways of using them, may\nbe jeopardized if the center is primarily a depository and lending agency. Spe¬\ncialized materials peculiar to a specific department or ones used very frequently\nshould be stored in these departments. They should, however, be purchased and\ncataloged thru the center.\nRecommended space allocation for storage of materials: I4OO sq. ft. minimum\nfor the small college. Space needs vary greatly with the number and variety of\nmaterials; i. e., 60 - 80 sq. ft. should be added for each additional 1000 films\nto be stored. It is important to allow for 100 percent expansion of space needs\nfor materials storage.\nCo Storage, Maintenance, and Distribution of Equipment - Space and facili¬\nties mue t be provided for the storage, maintenance, and distribution of equip¬\nment. As with materials, equipment should be easily accessible and should be\nkept in repair, ready for use. Adequate, dry, and well-ventilated space, equipped\nwith work tables and dustproof cupboards, should be provided for storage and ser¬\nvicing of equipment. This space must be well illuminated. Space should be pro¬\nvided in or adjacent to the center where teachers and students may come for in¬\nstruction arri practice in the operation of equipment. The equipment storage and\nservicing space should be arranged so as to provide easy access to a ground floor\nentrance available to delivery men and others.\nAlso in this area, one may expect to find sturdy, nonmetal tables for use in\nthe inspection, testing, and repair of those pieces of equipment requiring elec¬\ntricity in their operation. It is recommended that these tables be grounded and\nset on rubber floor mats. Recessed storage cabinets maybe built into the lower"
}