{
  "id": "d1004-78",
  "text": "either by establishing the clinic as a descfete unit or as a part of a\nuniversity-wide psychological services bureau. Being a part of a larger bureau\nhas advantages in that the services of other specialists can be utilized easily.\nClinical psychologists, vocational counselors, psychometrists, and other spe¬\ncialists can work together with the reading specialist, and the reading spe¬\ncialist, in turn, is available to them. Often vocational problems and other\nacademic problems are related to reading, and the working together and exchange\nof ideas and personnel can strengthen the services of both offices. Most\nclinics have medical and psychiatric consultants available thru the university\nmedical school.\nWhile the activities of a university-wide clinic are more complex than\nthose of a small college, some of the. needs are similar. Minimum staff for a\nsmall program would consist of a reading specialist and a secretary. Minimum\nstaff can work satisfactorily in a small program if the aid of other specialists\ncan be utilized. A university program that expects to provide individual\ndiagnosis and instruction, classes in reading-study skills, and education\ncourses would require expanded staff and facilities.\nSpace and Facilities\nIt is advisable to locate the clinic on one floor which would provide\none large room, one or two small testing rooms, at least one small room equip¬\nped with blackboard and shelf space for individual instruction, and one office.\nMinimum space for a reading clinic would include an office and a small testing\nroom and/or room for instruction. In the large classroom a blackboard and\nbulletin board are necessary, as well as shelves for books and pamphlets,\nconveniently located outlets for projection, and light control provisions to\npermit use of projected materials.\nIf the university or college has an audio-visual center from which equip¬\nment can be obtained, such as projectors and recorders, and a film or curricu¬\nlum library from which films and filmstrips can be borrowed, then a minimum of"
}