{
  "id": "d976-152",
  "text": "May 29# 1950\nMr* Richard Hull\nStation WOStl\nOhio Slat® University\n2400 North Starr Road\nColumbus 21, Ohio\nDear Dick:\nFor your drafting Job, which is difficult in any ©as®, X*d like to get you my best\nideas of the moment, without delay.\nThe first, unrelated to specific items given below, is this: When Jt®s in draft\nby you, how about sending to Wilbur Schramm who has a great gift for words and\nprecision? Bob Sh&yon might also react, if &®s explained in a brief not® that\nthis is a sort of **csedo®* being developed for special distribution*\nSome of the ideas {meanings for the NAEB of the Washington Meeting, i*@o what\nit means we must or should dob\n•*As the broadly-based Association, responsible for both radio and TV, closed\nand ©pen circuit, it is incumbent on us to pursue with energy and vigilance the\nactivation of all types of broadcast facilities for education: AM frequencies as\nthe occasion may arise; FM frequencies: for a distinctive alternative program\nservice as well as a supplement to TV for directly educational uses; television,\nboth closed circuit and ©pen circuit; and eventual local, regional and national\nnetwork intoconnsction of the educational resources of the nation In ell these\nmedia*\n*®As one of the parent organisations of other groups, distinguished from the NAEB\nby more specialised and limited functions in television parUcidariy, the NAEB\nstands ready at all times to engage in mutual consultations and coocdlnative efforts\naimed at securing for American education greater benefits and greater educational\nuses of all electronic communications media*\n•’’Recognising the need for new types of research to provide the evidence needed\nto sound planning, it is incumbent upon the NAEB, with its long history of re¬\nsearch in television and radio, to assume increased leadership. Initiative, plan¬\nning and coordinating functions in research. Only with such research will the\nnew meanings and dimension® of this medium as an instrument of education and\nunderstanding be revealed."
}