{
  "id": "d976-194",
  "text": "Memo of Telephone Conversation\nwith Lester Kelson\nJune 24, 11*15 PM\nLester Kelson ms in Brfeana for a conferenee sponsored by the School\nof Education*\nWhen I found out from Jack J&Brid© that Mr* Nelson would bo in town,\nI left the following note fcr him at the Hotel desk of the Xllini Union,\nwhere he had a reservation:\nJune 23, 1953\nn£©ar ®?o Nelsms\nSince the NAEB Board is ©eating Wednesday all day in\nChicago, I should appreciate an opportunity to see you\nor talk to you very briefly tonight (Monday) or any\niiiae tomorrow, at your convenience*\nhose phone is 6-9154*\n% office phrne is 7-6611, Extension 3394*\nSincerely,\nHairy Je Skarnia\nExecutive Director*5\nHaving no reply to this first note (I later found he was delayed in getting\nit), I left the following esses\n•June 24, 1958\n^Bear *&•* Nelson:\nPerhaps I should have explained in sy earlier note: I wished only\nto ask if spy reply might be available to our last request (copy\nattached) about using funds for the purposes outlined after July 1,\nas was done last year*\nOtherwise we shall bo faced with cancelling two workshops (Teacher\nUtilisation and ETV Managers) for which arrangements have been made\nand participants and consultants selected® (Cop5.es of announcements\nwere attached).\nMr. Mil is on vacation, and Mr® Paula has resigned to accept the\nFusd®s study grant. We are having a Board meeting in Chicago tomorrow\nto plan future steps. It is only because of this timing that I bother\nyou. I had no intention of protesting in any way or discussing the\nearlier decisions: in reaction to our large request; and in reaction\nto our two-year interim request.\nI am tied up as Toastmaster of a banquet tonight fresa about 6:15 to\n9:00 or so. If possible, however, I should be grateful to know in\ntime for tomorrow8 s meeting, so I may report to our Board meeting\nwhether any decision has been made or implied on our last request\nonly.\nSincerely,\nHarry J. Skornia1'"
}