{
  "id": "d976-195",
  "text": "A division of\nEDUCATIONAL TELEVISION STATIONS\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nPHONE: 667-6000 • 1346 CONNECTICUT AVENUE • WASHINGTON, D.C. 20036\nJune 13, 1968\nThird Report on Programming for the Disadvantaged\nCompiled by Michael Hobbs, ETS Staff\nI\nDrama for Los Angeles' Spanish-speaking population, consumer education\nin Houston, more jobs in South Carolina, riots programs in Rochester, and a\nstate wide radio and TV participation in Wisconsin are among the many new\nprograms listed here in ETS' Third Report.\nETS intends to continue to compile and circulate reports about this pro¬\ngramming as fast as stations send information to ETS about them. (See also\nETS Managers' Memo Report: Program for Disadvantaged Workshop. )\nA great deal of programming on ETV stations might be appealing and useful\nto ghetto residents as it is to others in the community. Though it is not designed\nas a direct response to the specific needs of the disadvantaged, all the adult\neducation programs on language, arts, auto mechanics, religion, etc., might\nproperly be considered as programs serving ghetto audiences. The scope of this\nreport is limited to programming specifically for and about the disadvantaged and\ntheir problems.\nIt stands to reason an effective immediate answer to that need can come\nin the stations' regular public affairs programs -- rather than a \"crash program\"\nof new production. Also, in the rebroadcast of previous programs which are\nparticularly suitable for the purpose.\nThere is increasing emphasis on ghetto problems in programs like WTTW's\n\"Chicago Roundtable\" and National Educational Television's \"News in Perspective\"\nand \"Regional Report\", and in most of the stations' regular news or interview\nprograms. Many stations have aired or are rebroadcasting the series of programs\non \"The History of the Negro People\" and the NET documentaries like \"A Time\nfor Burning\", \"What is Prejudice\", \"The Way It Is\", \"From Protest to Resistance\"\n\"Still a Brother\", and \"Color Us Black. \"\nThis is a summary of new initiatives -- direct responses with \"special\"\nprogramming to the challenge of the President's National Advisory Commission\non Civil Disorders."
}