{
  "id": "d976-21",
  "text": "Ft- £'sKF~\nDr. Dave Berkman\n90 EIGHTH AVENUE\nBROOKLYN. N. Y. 11215\n(212) STERLING 3-0833\nDear Bill Harley:\nI've now read (l) your basically evasive response to my letter; (2) Richie Myers'\nindictment— unintentional, of course!— of ETV in general, and Southern ETV spe¬\ncifically, for its failure to serve its black constituencies; (3) Art Hungerford's\ndocument on personnel practices which, among other defects, seems more concerned\nwith raising, a priori, the spectre of the potential side effects of any proposed\nremedies, than with the totally devestating nature of the disease which these\nmight be proposed to cure*\nLet me first direct myself (in reverse order), to each of these communications; and\nthen make a final attempt to lay it on the line in as simple and direct a manner as\npossible, so that I can elicit a response equally as unequivocal— and one devoid\nof the evasion and obfuscation which has characterised MSB's previous responses to\nthe twin problems of racial discrimination in educational broadcasting's program¬\nming and personnel practices*\n[j. realize, of course, the difficulties this presents for an organization in which\na German Shepherd ETS tail wags a Mexican hairless-sized MSB body. Yet, wouldn't\nit be a wonderful world in which morality was concealed to have paramountcy over\npragmatism????\n/T. .but, I digress*.. *.<,/\n(l) Art Hungerford's Personnel document:\nMere, in his Q~airs is there anything which would indicate we're attempting\nto to obtain a fix on the racial situation? (Or, is that the point?!?!) Where\nare the meaningful—albeit ticklish— questions, such as: Bo you have any\nblack personnel on your staff? If so, how many? In what positions?\nWhy, where attention is addressed to the Neighborhood Youth Corps program I\ndeveloped for training ghetto youngsters to assume entry-level, technical\npositions, does he * distort the whole thing by stressing the problem of\nthe deficiencies these youngsters display, whereas the actual program began\nwith a recognition of these— and then proceeded to show how they could\nbe realistically overcome?\nFinally, why are we left with an implicit assumption that any potential pool\nof black personnel is totally deficient in the skills, qualities, and expert¬\nise necessary to qualify one for employment in educ[%ional broadcasting,\nwhen the fact is -that literally hundreds of thousands of blacks possess\ndegrees, years of experience, and expertise in educ/tj^ion? (Certainly the\nmajority of professional blacks are in eduq%ion0) Let me submit that it's\none heckofalot harder to turn a broadcaster into an educator— the task we\nattempt to accomplish with, perhaps 75/-> of our present personnel— than\nto teach an educator what he has to know about radio or TV. (i don't know\nwhat in, say, Ray Hurlbert's background qualifies him to head the Alabama\nETV network, but I'll bet there are a hundred black Alabama educators\nequally qualified!!! /in fact, if you want a definition of the Millenium,\nit will be when Hurlbert— or Baird's— #2 main'is^iaScjT)\nf v i* A ~\n\\2) Richie's^collection of material \"which will indicate what’s being done*,*\n/for (sic!) the disadvantaged:\""
}