{
  "id": "d976-24",
  "text": "I rs)\nA division of\nEDUCATIONAL TELEVISION STATIONS\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nPHONE: 667-6000 • 1346 CONNECTICUT AVENUE • WASHINGTON, D.C. 20036\nJuly 22, 1968\nFourth Report on Programming for the Disadvantaged\nKen Clark, Project Director\nYour response to the need for information between stations has\nbeen encouraging. I urge you to continue sharing in the dialogue.\nAs this Fourth Report on Programming will indicate, much is being done.\nHOT PRODUCTIONS:\nWQLN, Erie is underway with a public forum in which black members\nof the community are taking an active participation. Prejudice,\nHousing, Job Opportunities have been treated so far with strong viewer\nreaction. In addition, one full discussion aired concerned.young\npeople and their attitudes toward Life as they see it. The series\ncontinues with journeys through Mental Health, The Arts, Local Edu¬\ncation, Urban-Suburban Annexation and other local interest topics.\nA strong station commitment toward a balanced black-white exchange\nsuggests WQLN is in this program area to stay.\nCONTACT: Robert J. Chitester, General Manager\nIn Florida, the Dade County Community Relations Board and the\nCommunity Television Foundation are moving with a daily program through\nwhich they hope to communicate with young Negroes. ”Itfs Our Bag\" has\na magazine format with a variety of features. ItTs interesting to\nnote that the show’s T,JobTs for Real” insert was cancelled because\npromised jobs for youth in that part of the country failed to materialize.\nHowever other features make the series a lively weekday half hour.\nProducer Bea Baxter enlisted the militant United Black Students\nat the University of Miami to take charge of the \"We Are History\"\nsegment providing research, scripts and visuals. Meetings of the\nDade County Youth Council which often zero in on the dropout and\nmilitancy scenes are taped live.\nA regular newscast called \"News in Black and White\" with one\nblack youth and one white youth sharing the newscasting honors has\ncaught the viewers’ interest.\nAnother weekly feature, \"Law and Justice\" has black younsters\ntalking to local law enforcement officers and ... by pre-arrangement.••\nno holds are barred as the kids ask the hard questions that affect\ntheir daily lives."
}