{
  "id": "d976-25",
  "text": "2\n”A New Way to See” is really a photo workshop where young people\ntake cameras to shoot their homes and neighborhoods as they see them.\nThe purpose is the title as the kids begin to find another way of\ncommunicating ... their pictures telling more than they can say.\nThe Housing Hangup, Integration vs. Seperatism, The Performing\nArts, a talent show tied into three such shows already underway in local\nschools and parks ... these are only a few of the features of ”ItTs Our\nBag.” The show hosted by .Sylvia Rolle and co-hosted on a rotating\n'basis by DJTs from the rock-and-soul radio station WMBM extends its\naudience each night when the audio track is replayed on WMBM, a station\nthat hits the black youth where they live.\nCONTACT: Bea Baxter, Producer, ”ItTs Our Bag”\nKCET, Los Angeles is enthusiastic about its \"Black Perspective”\na series that for the first time gives the Southern California black\npress an outlet. Frankly patterned in meet-the-press format, the series\ntakes on a variety of guests and issues. The difference: the questions\nare posed by black reporters who query out of gut level experience.\nCONTACT: Charles Allen, Program Director\nKTCA-TV, the Twin City Area Educational Television Station is tackling\nsocial and economic problems confronting the black population with\n\"Black Voices.*’ The program also showcases black art, theater and\nhistory. The idea of the program is stated at the top of each show,\n\"Black Voices is for black people, but anyone can watch, can listen,\ncan think.”\nThe Twin Cities station also program a fiteen minute production\ncalled \"The Runner” produced by and for the approximately 20,000\nChippewa and Sioux Indians in the area. The programs are straight¬\nforward news presentations, giving information concerning affairs at\nthe reservation, updating information from all Federal Agencies which\ndeal with Indians and Indian community problems. Special note: members\nof the Twin City Indian community are in. the process of themselves\nraising money in order to insure continuation of the series.\nCONTACT: Joseph T. McDermott, Director,of Project Development\nfor the Twin City Area Educational Television Station.\nWMSB, East Lansing connected with a group of ADC mothers on a\nproject called ’’Welfare Rights Mothers Visit Kathe Kollowitz.” The\nwomen, either thought of negatively (or not at all) by the community\nwere invited to visit a travelling exhibit of prints by Kathe Kollowitz.\nThen they sat down and talked about the experience ... about the prints,\nabout art, about themselves in relation to art. They did not discuss\nbeing on welfare. They talked, out of their own valid intelligence,\nabout the art that touched them as human beings.\nThe Community was astounded. Who ever heard of women on relief\ntalking about art? East Lansing did, and the town learned something."
}