{
  "id": "d976-67",
  "text": "June 26, 1968\nETV REPORTER\nPage 5\nA NUMBER OF THE NATION’S TOP INDUSTRIALISTS WILL BE INTERVIEWED IN A NEW\nseries, \"Faces of Business—USA,77 being produced by WNDT (Ch. 13) New York. Appear¬\ning in the series of six color programs will be Henry Ford II, Chairman of the Board of Ford\nMotor Co.; John J. Johnson, President of Johnson Publishing Co.; James J. Ling, Chairman\nand Chief Executive Officer of Ling-Temco-V ought, Inc.; Charles F. Luce, Chairman of the\nBoard of Con Edison; David Rockefeller, President and Chairman of the Executive Committee\nof Chase Manhattan Bank; and Joseph C. Wilson Chairman of the Board of Xerox Corp.\nEach program will consist of a 30-minute interview conducted by T. A. Wide, a member of the\nFortune magazine board of editors. The series will premiere July 9 at 7:30 P. M. with an ap¬\npearance by Xerox Corp. 's Wilson. Betsy Pilat Marston will produce the series, which was\nmade possible by a public service grant from the George F. Baker trust.\nNEW ETV LITERATURE AVAILABLE FROM —\nRSA Information Service, Social and Rehabilitation Service, U. S. Dept, of Health, Edu-\ncation and Welfare, Washington, D. C. 20201. A new catalog of films on mental retardation,\nwhich lists both professional and non-professional films dealing with the nature of mental re¬\ntardation, its causes, general treatment and prevention, is available free on request. Other\nfilms listed describe the more specific aspects of diagnosis, clinical treatment, rehabilitation\nand control.\nAmpexCorp.', 401 Broadway, Redwood City, Calif. 94063. A new 16-page brochure\ndescribes the firm’s capabilities for designing, engineering, and installing complete televi¬\nsion systems, including broadcast TV stations, remote units, closed circuit systems, and\nother audio and video systems for broadcast, military, educational, medical, business and\nindustrial applications.\nA GROUP OF PUSHING, SHOVING \"HIPPIES, \" SHOUTING OBSCENITIES, INVADED THE\nstudios of WNDT (Ch. 13) New York Tuesday night while the station was on the air and\ntook over the facilities before being subdued by police. The intruders, numbering about\n20, including several women, knocked down a guard and punched their way past two mem¬\nbers of the station’s staff. Six men and one woman were arrested but the rest escaped.\nThe entire incident, including the shouting of a number of four-letter words, went out\nover the air. Staff members said they were afraid the intruders might wreck the sta¬\ntion if they were cut off the air. Former Astronaut John Glenn, who had appeared on\na program preceding the one disrupted by the hippies, looked on in astonishment during\nthe incident. Station officials said they will charge the arrested individuals with crimi¬\nnal trespass.\nWET A (CH. 26) WASHINGTON IS ASSISTING THE TEACHER ORIENTATION PROGRAM\nof Project Head Start in the District of Columbia and parts of Maryland. This week the\nstation is airing five 20-minute Head Start films at 3:40 P.M. Head Start is directed at\npre-school children whose background and experience place them at a disadvantage as they\nbegin formal schooling, and provides these children with intensive training during the sum¬\nmer months designed to reduce that disadvantage.\nTHE MEXICAN GOVERNMENT HAS ORDERED 50 MARK 10 VIDEO PROCESSING AND\nautomatic gain control amplifiers from Ball Brothers Research Corp., Boulder, Colo.,\nfor processing of video pickups from the Summer Olympic Games. Delivery will be at\nthe rate of 10 units in June, 10 in July and the final 30 in August. They will be instal¬\nled at several locations in Mexico in time for the beginning of the games in October."
}