{
  "id": "d1687-0",
  "text": "OFFICERS\nEXECUTIVE COMMITTEE\nPRESIDENT! JDS. F. WRIGHT, WILL\nVice-President: w. i. GRIFFITH, WOI\nIOWA STATE COLLEGE\nAMES, IOWA\nSecretary-Treasurer\nB. B. BRACKETT, KUSD\nUNIVERSITY OF SOUTH DAKOTA\nVERMILLION. SOUTH DAKOTA\nOffice of Executive Secretary\nT. M. BEAIRD, WNAD\nUNIVERSITY OF OKLAHOMA\nof\nCollege and Univ'e/^ity\nBr-\nFebruary 7, 1933\nSPECIAL BULLETIN\nFIRST ZONE: DANIEL E. NOBLE, WCAC\nCONNECTICUT AGRICULTURAL COLLEGE\nStorrs, Connecticut\nSECOND ZONE: G. R. FAINT, WJBU\nBUCKNELL UNIVERSITY\nLEWISBURQ, PENNSYLVANIA\nTHIRD Zone: GARLAND POWELL, WRUF\nUNIVERSITY OF FLORIDA\nGainesville, Florida\nFOURTH Zone: H. G. INGHAM, KFKU\nLawrence, Kansas\nFifth zone: h. V. CARPENTER, KWSC\nSTATE C □ LLE □ E GF WASHINGTON\nPULLMAN, WASHINGTON\nAt Large: R« C. HIGGY, WEAQ\nOHIO STATE UNIVERSITY\nTO MEMBERS\nof\nTHE ASSOCIATION OF COLLEGE AND UNIVERSITY BROADCASTING STATIONS\n(and educational officials cooperating with the Association)\nThe Associated Press reported from Washington on the afternoon of Feb¬\nruary 3 that President Hoover last Friday named Professor J. C. Jensen\nof Nebraska Wesleyan University to be a member of the Federal Radio Com¬\nmission. The Association of College and University Broadcasting Stations\nhas been working on this project for several months. We have now completed\nthe first major step—the naming on the part of the President of Professor\ndensen to the Commission. It is needless to state that it will be very\ndifficult to get Senate action on confirming appointments at the present\ntime.\nOfficials of the Association urge your immediate action in behalf of Pro¬\nfessor Jensen. Kindly wire your Senators, even though they have already\nendorsed Professor Jensen, to confirm his appointment. Due to limited\ntime and change in the Administration in the course of the next few days\nit is necessary that this action be followed immediately.\nOfficers of the Association desire that all members of our group have\nwires on the Senators’desk* not later than Monday, February 13. It is\nimperative that w act now. The hard part of the battle has been won,\nbut there is still much to do. Act t*d<ay in the interest of educational\nbroadcasting!\nSincerely yours,\nJos. F. Wright, President.\n(Signature authorized by wire)\nBulletin released by T, M, Beaird,"
}