{
  "id": "d1753-3",
  "text": "* Workshop Grants-in-Aid\n* Research Grants-in-Aid\nFoundation Relations (handled principally by Foundation Re¬\nlations Committee Chairman, Frank Schooley, with assistance\nand reports prepared by Skornia and other staff)\n* Reports and questionnaires (many sections fot reports are pre¬\npared by others, of course, and many questionnaires are as¬\nsigned or referred)\nPress Relations (providing materials and guidance on request for\nnational magazine articles, such as the recent Reporter article,\nReader's Digest, Life etc.) (mostly by Skornia and Hill)\n* Research Exchanges and Liaison with other Research groups\nCommittee Relations with some of the following committees are\nhandled by various individuals, depending on the problem\ninvolved, or the action or data required. For instance, tech¬\nnical data for any committee would be supplied by Bidlack.\nOrganizational Liaison (mostly Skornia with Chairman\nBroderick)\nAdvisory Committee to the President of the ETRC (chan¬\nneled by Skornia to Paulu)\nAssociate Members Committee\nEngineering Committee (Liaison is principally through Cecil\nBidlack)\nProgram Grants-in-Aid Committee (principally handled\nby Hill except for policy)\nInternational Relations Committee (Chairman Sy Siegel\nhandles far more of the load in this area than a committee\nchairman should have to)\nMembership Committee (except on knotty problems, these\nrelations are delegated to our Traffic Manager, Margaret\nEnderby, and to Frank Schooley, who also handles voting\non membership, for individual members)\nProfessional Advancement Committee (and sub-committees)\n(generally Skornia and Hill, with Bidlack for engineering\nand technical)\nPublic Relations Committee (liaison now handled principally\nby Harold Hill)\nPermanent Financing Committee (Harold Hill does most of\nthe Headquarter work)\nResearch Committee (principally Skornia)\nTelevision Development Committee (Skornia with Hill)\nRegional Meetings (Hill and Skornia principally with par¬\nticipation also by Bidlack)\nConvention Committees (both Hill and I serve here, as do\nSchooley and many others)\nUtilization Committee (principally Skornia, to date)\nPublications Committee (most of the work with this com¬\nmittee is done by Schooley)\n*****\nIn addition to the regular on-going activities in¬\nvolved in the above (and the list is not exhaustive)\nthere are many requests for “everything you have”\non ETV or radio, several hundred letters a year from\nstudents, researchers and the general public, letters\nfrom a good many of our now over 1,300 members\nand some of the 2,000 or more additional staff mem¬\nbers at their stations (we wish they would become in¬\ndividual members!), requests for data on clearance,\ncopyright, postal (and postal legislation) problems\nand various others which occur on a fairly frequent\nbasis. Many of these have to be handled by all of us\ncooperatively, depending on the problem.\nFinally, I might mention the foreign journals, for¬\neign language correspondence, and other foreign re¬\nsearch and other reports which I must handle, since\nthere are no other linguists on the staff.\nWhen you consider also the several score days\neach year when three of us especially, (Skornia, Hill\nand Bidlack) must be “on the road” for meetings,\nconventions and other NAEB business sometimes for\nas long as ten days or two weeks at a stretch, and the\nfact that I teach one course the first semester of each\nyear, I trust you understand even more why you will\nsometimes receive a reply from a person other than\nthe one addressed. We believe you want delays min¬\nimized and only in this way can we make sure that\nyou get what you need as promptly as possible.\nI hope you all know me well enough to know that\nI’m not trying to impress you with how “busy we\nire,” or “how hard we work.” That definitely is not\nthe intention. The purpose is to give you a perspec¬\ntive on what we do, which we’ve always been too busy\nto take time to give you before. I assume you could\nall draw up equally impressive lists for yourselves, for\nI know you, too, are busy—in fact, we too, often hear\nthrough different people from those we address at\nmany of your shops. But if you write me, and some¬\none else answers, I trust you’ll now understand.\nThat’s it! Thanks for allowing me to put it on this\npersonal a basis. And thanks to non-member NAEB\nNewsletter readers for understanding this “house-or¬\ngan” use of our publication on this one occasion to\nanswer many queries at once.\nNETWORK NEWS\n—Bob Underwood\nThe 1958 In-School Offering has been selected at a\nmeeting of the NAEB Radio Network School Com¬\nmittee in Chicago. The offering, together with audi¬\ntion tapes, will be in the hands of member stations\nnot later than Sept. 1 (Issue #35). The deadline\nfor orders is Nov. 1, and actual distribution will begin\nwith Issue #48 (Dec.l) .\nTwelve series comprise the new offering. All are\nbrand new, there being no re-issues as in former years.\nA few of the areas covered in this offering are Com¬\nmunity Life, Social Studies, Poetry Appreciation,\nCitizenship, and Health and Safety. Also included\nis the first in-school grant-in-aid series, When Men\nAre Free, produced by station WHA, University of\nWisconsin. This series deals with the concepts of de¬\nmocracy and should be of great interest to all mem¬\nbers. After hearing two sample programs, I can say\nthat this series would interest adult audiences, too.\nThe fall regular offering is in the finishing stages,\nand we hope to get it to the stations well in advance\nof the ordering deadline. This offering will be one of\nthe largest ever made by the network, and we look\nfor wide acceptance from member stations. Release\nof new grant-in-aid series will begin in the fall offer¬\ning; so you can see that there are some good series\nahead. We hope you will like them.\nAt this time we are checking and re-checking our\ntape inventory balances before sending statements to\n4\nNEWSLETTER"
}