{
  "id": "d1753-6",
  "text": "pistol grip which turns the meter on when it is picked\nup and turns it off when it is put down.\nThe meter measures an approximate three degree\nangle of view although an area several times that\nbeing measured is seen through the eyepiece surround¬\ning the black dot which indicates the measured area.\nSpectral response closely matches the C.I.E. lum¬\ninosity curve. Full scale readings of 50, 500, 5000 or\n50,000 footlamberts can be obtained by the use of a\nrange control on the side of the instrument. Its cost\nis slightly less than $400.\n* * * * *\nRCA tube engineers are working on a new one-\ninch vidicon tube similar to existing types but which\nwill have much higher sensitivity. The new tube can\nbe operated at higher signal electrode voltages than\ncurrent types and thus provide an appreciable in¬\ncrease in sensitivity. The new tube can be used for\ncolor or monochrome TV and also in industrial cam¬\neras. Samples have been provided to equipment man¬\nufacturers.\nFCC ACTION\nThe FCC issued a grant, authorizing the Centenary\nCollege for Women, Hackettstown, N. J., to operate\na noncommercial FM radio station on Channel 220.\n(► Butler University in Indianapolis, Ind., has ap¬\nplied to the FCC for permission to set up a TV sta¬\ntion. The station is to operate on commercial Chan¬\nnel 39.\nA REMINDER TO EMPLOYERS\nSince the NAEB established its free Placement\nService, many qualified persons in the field of ed¬\nucational broadcasting have benefited by this\nService through gainful employment in suitable\npositions. Not only has this Service helped ap¬\nplicants, but employers have benefited equally\nthrough obtaining qualified personnel for their or¬\nganizations.\nWe at the NAEB would like to remind em¬\nployers who lack information about our Placement\nService that it is to their interest to take advantage\nof the opportunities which it provides. So far, our\navailable placement facilities are far from being\nfully used.\nEmployers who would like to make use of our\nfree placement Service have the assurance that all\njob applicants who seek placement through the\nNAEB are carefully screened by us before we in¬\nclude them in our files. Only persons with experi¬\nence and suitable educational backgrounds are con¬\nsidered.\nHURLBERT REPORTS ON EUROPEAN TRIP\nTV in the U. S., both ETV and commercial, is far\nadvanced in production quality as compared with its\nEuropean counterparts, according to Raymond Hurl-\nbert, Alabama ETV Commision general manager.\nHurlbert returned recently from a 4-week vacation\nin Europe where he visited the BBC in London, and\nthe French, Swiss and Italian TV centers in Paris,\nZurich and Rome.\nRaymond Hurlbert, General Manager of the Alabama\nETV Commission\n“England, France and Italy,” Hurlbert com¬\nmented, “are in the midst of a huge construction pro¬\ngram of massive TV studios as if to rival old Holly¬\nwood film studios.”\nAfter questioning those Europeans “who could af¬\nford to buy TV sets and pay the annual tax on them,”\nhe found that they were as critical of TV program¬\nming as TV viewers in this country.\n—NAEB—\nFollowing a request by one of our readers who became\nconfused, we would like to point out that the story\nand picture featured on page 5 of the June Newsletter\nunder the heading “NEWS OF MEMBERS,” in¬\nvolves two separate institutions, the University of\nMiami in Florida and Miami University in Ohcford,\nOhio.\n—Editor\nJULY, 195.7\n7"
}