{
  "id": "d1100-1",
  "text": "-2-\nA request has been submitted to USOE for a Title VII Grant to fund a study of the\nfeasibility of such a national communications system for radio and specialized\nacademic functions. The NAEB radio seminar to be held in Chicago, in January,\nwill center its deliberations around this development - one which has already won\nwidespread expressions of interest and approval by university presidents, govern¬\nment officials, and communications specialists.\nBROADCAST TELEVISION\nThis fall's meeting of the Center Affiliates (October 5-8) was fraught with expectancy\nand uncertainty, some concern and considerable resolution.\nThe Ford-Center move to, in effect, “give\" them a specialized program service and\nnothing more, meant that stations now had “released\" money to spend but also that\nthey were now on their own; they must make their own decision on how best to\nproceed to protect their welfare and insure their continued growth and well-being.\nAt the meeting of the previous fall, the Affiliates Committee was directed to come\nin with a recommendation as to what organizational structure was best suited to\nserve the ETV stations; in light of the Ford-Center move, this matter now took on\nenhanced importance. In discharging its responsibility, the Committee agreed to\na hearing for the NAEB president and subsequently invited him to address the\nAffiliates and distribute a memorandum. This was entitled:\nNAEB and ETV: A NEW OPPORTUNITY\nThis memorandum identified two major needs which new policy directions of NETRC\nhave created. (1) The need for stronger representation for ETV stations in Washington\nand (2) the need for a mutually-operated ETV station Program library Service to\nsupplement the specialized NET offerings.\nNAEB proposed to meet these needs in two ways:\n1. The establishment of a TV Station Division (as a part of the proposed new NAEB\norganizational structure to be voted on at Milwaukee) as an autonomous operation\naffording TV stations maximum pursuit of their particular aims (without dilution in the\nconcerns of the total membership) and a means of developing a.Washington office\nwith such staffing and service as they desire and are willing to pay for.\nThe memo then lists suggested services which such an operation might provide in\nWashington (political, education, legal and engineering consultation, station\nactivation, and information) together with the supporting service NAEB Headquarters\nwould provide to reinforce the work of the TV Division. Suggested budget: $114,750.\n2. The Television Program Library is described as a self-supporting, low-cost,\nmutual operation which would be set up at some member university and to v\\h ich\nstations would contribute their outstanding programs. For a basic fee they would\nbe able to select 80 hours of programs per year, with additional hours paid for at\na proportional hourly rate. A one-time-only capital investment fee would be\nassessed at the time of joining the service in order to establish the necessary"
}