{
  "id": "d802-10",
  "text": "2\ntimes were picked because many of the committee would be attend¬\ning anyway* However* at least two members of the committee are\nnot permitted by their institutions to attend any meetings at\nthe institution1 s ejspense.)\n(2) All in-school programs will be selected by the in-school committee\nat the meetings delineated in (1) *\n(3) Between meetings of the in-school committee school programs will\nbe given a preliminary screening* so that the remaining programs\ncan be given a careful evaluation at the meeting*\n3o Specific program recommendationso (These suggested needed areas of\nprogramming are listed in the order given* and do not imply ary land\nof priority*)\n( 1) Social Sciences—areas such as mental health* child development*\nfamily relations* etc.\n(2) International understanding* To include background materislon\non crucial geographical areas of the world*\n( 3) Artistic and eultitral|programs of uniqueness and high quality*\n( h) Historical perspective on current world affairs. Interpretati\nof currant affairs in the light of historical parallels.\n( 5) School programs—more programs designed for elementary grades.\nLess emphasis on programs in area of social studies.\n( 6) School—natural sciences and nature study,\n( 7) School—rhythmics» (BBC program, MUSIC AND MOVEMENT* with Ann\nDriver suggested as excellent prototype. It was suggested that\nwe check with BBC on whether this program might be made available.\n( 8) Commonly useful areas of assorted inf oamation. programs designed\nfor the lay-listener in legal problems* house buying and build¬\ning* budget for a family* and similar areas.\n( 9) School-physical sciences for High School level.\n(10) National problems. More detailed elaboration of -these .and inter¬\nnational problems.\n(11) Folk music.\n(12) Music. Confined to unique programs not available from usual\nrecording sources.\n(13) Dramatised history. (Such as YOU ARE THERE.)\n(Ik) Make greater use of one shot* or non-series programs. It was\nfelt that a considerable number of programs not part of organised\nseries could be utUAzed by the stations.\n(15) General health programs.\n(16) School— development of social attitudes at upper elementary level*"
}