{
  "id": "d802-101",
  "text": "'\nANN ARlIoR\n*\nWHOM\nA/(cA\nljs\n91.7 M.C.\nWFUM\n107.1 M.C.\nUNIVERSITY OF MICHIGAN\nANN ARBOR. MICH.\nWALDO ABBOT. DIRECTOR OF BROADCASTING\nE. G. BURROWS, PROGRAM DIRECTOR\nAugust 30, I 954\nMr . John Holt\nNAEB TapeNetwork\nUniversity of Illinois\nGregory Hall\nUr ban a, Illinois\nDear John:\nDECEIVED\nNAEB HEADQUARTERS\nKUG 3 1 1954\n» M pffl\n?iMM1l1.2|l|2|3|4|6|(5\nl\nHere are my votes on various programs that\nshould have been auditioned by me previously. I’ve been out of\ntown on vacation in the northwoods where there was no tape\nrecorder.\nDOORWAY TO THE FUTURE—These are excellent\nprograms, well produced, very dramatic and they seem to have,\nwhat I would call a commercial flavor. I wondered about that\nand l looked up to find that they were broadcast over the\nAmerican Broadcasting Corp. Network and I imagine largely\nwritten and produced by the ABC. They are so good that I feel\neducational broadcasters might be a little jealous of the job\nthat was done by ABC, In one or two instances, there is a timely\nnote injected into a program, such as; ” this week.1* Furthermore,\nsome program content may hurt the feelings of some listeners.\nThe anitit segregation bill which forms the basis of program No. I\nmightcause some stations to reject the series. Program No. 2 on\ncompulsory education is just as good a program as No. I. I vote\n’’yes” for the series.\nFor the second time I vote against this series.\nHerald Tribune Foams entitled THE WORLD WE WANT. It does not seem\nthat the program brings to the University station anything that is\ndifferent than can be produced by the University itself, if it has\nany foreign student enrollment. I donTt think it would add anything\nto our program schedule. There is too much talk by the woman\nmoderator. The language dialectsmake the program difficult to follow\nand it does not hold attention. I think it is an excellent program\nfor each station to put on itself. We have such a program here at\nthe University but I do not feel that it is a network program and\ntherefore, vote \"no” for THE WORLD WE WANT.\nCONTOUR COUNTRY submitted by WOI #9—there is\nnice writing of introductory material and it is very well narrated.\nThe program series might be of interest to schools and colleges\nhaving their interest in the field of agriculture. Program #9\nseemed to be rather slighting to the city wife. I don't think"
}