{
  "id": "d802-123",
  "text": "MEB TAPE NETWORK\n14 Gregory Hall\nUrbana, Illinois\nMemos\nTos\nFroms\nRes\nStation Managers\nStation Chief Engineers\nNetwork Headquarters x\nDuplication of tapes5 Half-trhok heads\nSeptember 30, 1954\nAs m believe most of you are now aware, tapes coining off of the NAEB dupli¬\ncators are recorded by 90 mil (half-track) heads* These tapes can be played on\neither' half \"track or full-track machines«\nMr * Cecil S* BidXack, our Television Engineer, who has kindly consented to\ngive Network Headquarters the benefit of his electronic experience , upon asking\nMr* Francis Rawdon Smiths, the manufacturer of the electronic component of the dupli¬\ncators., for the reasons for using half-track heads, received the following reply?\nr 1\nfd | uJ,dtK\n( ~lHC? **‘0\nvh~ —\nMo.|f\n. 7>aaK\n( S o m i l)\n“lour query regarding the advantage of 90 mil recording heads will perhaps\nbe answered by the attached rough sketch* This represents the inter-section of\nthe gap in a playback head which is out of alignment (as will quite often be the\ncase in radio stations using tape programs), and the magnetic pattern produced by\na short wave length, high frequency sound recorded with a head in proper azimuth*\nThe cross-hatched area represents the intersection of these two, and is proportional\nto the output of the head* If the alignment of the playback head were perfect, the\nentire 246 mil area would be cross-hatched* As shown above, 1/3 of this area is\ncross-hatched, though more than 2/3 of the area corresponding to a half-track (90\nmil) recording is cross-hatched. Accordingly, th© output from a playback head\nwhich is misaligned would be only slightly down, though the output from a full width\ntape would be down more than 10 db. in the illustration shown.\n“This advantage of reduded sensitivity to misaligned playback heads is\noffset by the slightly reduced output from the 90 tn-n tapes.”\nWe hope and trust that this information will be of interest to you."
}