{
  "id": "d802-130",
  "text": "Mr. Waldo ibbot\nPag. 2\nOctober 12, 195k\nMATTHIAS HER KAHLKB (C. of Chicago)\nI suppose thie was n»re3y pulled out of & symphonic program, the way It\nopen#. Moat of the male libraries mould contain this information, and\nmoat of our stations hare similar coaraentaiy which they prepare for use\nwith classical music. MO.\nIMITATIOH OP CHRIST (0. of Chicago)\nBey, they really had religion this week didn't they? This might be a good\ntim© to comment that maybe the committee ought to make acme sort of policy\nregarding these one-program submissions. Chicago seems to have sent a lot\nof one and two shot stuff. Don't think this Ball has much on it, if you'll\npardon me. I don't like his reading or interpretation. I'm beginning to\nbe afraid that I'm unduly harsh with these 0 of C offering*, but I still\nhare to vote *3&%\nHICOIEM03 (0. of Chicago)\nLength of 21iJ0 ia not good. Too much similarity of voices. The acting\nia pretty good, but I don't think many program directors would have much\nuse for a single dramatic program, especially of this odd length. There¬\nfore, even though 1 enjoyed listening to this, ay vote is MO.\nmmmm in old abb mew xwamd (a. of Chicago)\nPrograms v«*y in length from 15*30 to 30*30 — this alone makes them diffi¬\ncult to program and thus is a strike against them. On the other hand, I\nthink that Simpson is a fine speaker. This is one case where I'm willing\nto let the individual program directors worry ebout how to program them, if\nat all, therefore I vote 188. HQWTfER, if approval of this series would\npreclude the inclusion of a series with more nomx program lengths, I\nwould be willing to authorise Holt to delete it, but maybe it can be thrown\nin as an extra sine® probably not many will take it, due to the lengths.\nTHE MMim OF BELIEF III 0GB (0. of Chicago)\nM0—se® first program series at start of letter.\nWill eee you in Mew York. Maybe we can get a vote out of Halyard there (Hi,\nCam).\nCordially,\nHarold B. Hill\nAssociate Director\nHEHtcp\nGGt Members ©f Radio network Acceptance Committee\nHolt"
}