{
  "id": "d802-132",
  "text": "Page 2\nMr. John Holt\nOctober 25, 1954\nWe have a staff writer of continuity for music comments upon\nsymphonic programs and operas. We have a very fine library,\nbiographical and analytical material. I’d rather have it pre¬\npared in my own institution and I feel most other stations\nusing such a program would feel the same. I therefore, vote\n\"NO.\"\nIMITATION OF CHRIST--one program. It was my\nunderstanding with the Acceptance Committee that they would make\nan effort to select those programs submitted which cannot be cb ne\nas well as by local or individual member stations. I feel that\nl can get a man on the University campus to give as good a talk\nas the one that is given in this program. There is a place for\none and two shot and even six shot programs in the NAEB offerings\nhowever, it would seem that these would have to be a lending\nlibrary sort of an idea. So that when I needed a one shot or\na fifteen minute program l could go and pull out something like\nthis and use it. But, as an offering of the Network to be used\nand returned...I can’t see it. I’m not in favor of such programs\nMy vote is ^NO.1*\nN1CCD EMUS--He re is another program with a peculiar\ntiming--2l/30. It would require a great deal of cutting or of\nfilling to make it useful. I’m afraid it is a mistake for a\nstation such as the University of Chicago to submit to the\nNAEB Tape Network every program that it records. 1 think the\nstation manager, Mr. Hunt should select those which he considers\nwould be acceptable to NAEB and send only those in, rather than\neverything out of his file. I remember some years ago when we\nwere considering the grants-in-aid of 1952 they had something\nlike 15 programs from Fordham University, just about everything\nthey had on the air. The number of programs overwhelmed the\nCommittee with the result that Fordham did not get a grant. If\na good program is selected and submitted, it will be considered,\nbut where you just send in everything you got in the closet...\nI’m against it.\nPURITANISM IN OLD AND NEW ENGLAND--Here they go on\ntheir regular timing--some programs are 15/30 which is too long,\nothers are 30/30 which is also too long...how do you schedule\nsuch a thing. I hate to repeat but ^NO.11 But, refer the\nacceptance to John Holt. If he can work Out the timing...it is\nthe best of the whole darn flock of religious programs from the\nU of C.\nUNIVERSITY OF CHICAGO CHOIR—I 'don *t think it is\na bright scintillating program by any means. The comments were\nnot significant. The quality was fair, although when themusic"
}