{
  "id": "d802-146",
  "text": "THE UNIVERSITY □ F TENNESSEE\nDIVISION OF UNIVERSITY EXTENSION\nBOX S 4 5 □ , UNIVERSITY STATION\nKNOXVILLE\nRADIO AND TELEVISION SERVICES April 26, 1955\nRADIO STATION WUOT\nreceived\nnaeb headquarters\nAPR 28 19o5\nAM\nTO : Waldo Abbot, John Holt, Jim Slack, Hugh Mix\nFROM : Jack Westbrook, Chairman. Network Acceptance Subcommittee\nSUBJECT: PURDUE BAND OP THE AIR, LOS CONCERTS FOR YOUNG PEOPLE,\nROOTS OP JAZZ, and AMERICAN ADVENTURE\nPURDUE BAND OP THE AIR—Yes by Mix and Westbrook. No by Slack.\nThe production of this program is satisfactory and the recording good.\nObivously this is a better band than many or most NAEB members can\nboast. Actually the program Is nothing any competent producer could\nnot turn out, and it is probably unnecessary to say that the content\nis of no significance at all. However, many stations may not have the\ntime and facilities to produce something like this and they can use\nthis to fill some vacant 15-minute slot. The views of Mix and Slack\nare known.\nLOS CONCERTS FOR YOUNG PEOPLE—Yes, unanimously. Slack and Mix\nhave transmitted their views. These are very charming and worthwhile\nfor the Intended audience. I would guess that some of the value of\nthe programs are lost in the recordings, for these seems to be some\nreferences to visual material or events not readily apparent from the\naudition programs.\nROOTS OP JAZZ—We have two positive votes on this offering.\nSlack's views being known, I agree with his general reaction to the\nprogram(s) dealing with slavery, though I doubt the Indictment is\nunnecessary. The program appears to be extensively documented, and\ncovers a pertinent period of cultural history. Actually, I feel\nthe series is concerned more with__s ocial problems than with jazz,\nand, if this is the intent, then I feel such intent is poorly ar¬\nticulated. Certainly, I would assume the presentation could be\nbrightened up considerably, and the recordings I received were\ninferior. Nevertheless, since jazz is an important and legitimate\ncategory of music in our culture, I feel it will be a worthwhile\nprogram for distribution. WUOT is already airing a substantial\namount of jazz (for the sake of jazz alone) each week.\nAMERICAN ADVENTURE—Two yeses. Slack's and my views coincide\nalmost completely. I would add that the production is good—tho\nI have personal prejudices and ideas that would altered it had I\nbeen the director-producer—and the recordings I received were at\nbest mediocre."
}