{
  "id": "d802-155",
  "text": "University of\nMinnesota £\nGeneral Extension D-ru-ism-w\nMinneapolis\n[f T)tvtst<ynt\nRadio Station KUOM\nNovember 18, 19%\n770 ON YOUR DIAL\nMr. Waldo Abbot\nRadio Station WUGM\nUniversity of Michigan\nAnn Arbor, Michigan\n<‘7\nDear Waldos\nl\nJust a month late, I'm catching up on some earlier audition tapes thjfet have been\nsitting on ray desk with mute accusation md reproof. Herewith my Sincere apologies\nfor not getting the votes in sooner. < ; f\nI still have two boxes to go, from the earlier ^batches,\"hut will hope to clean tern\nup this week. / ^—- \\ \\ \"\n< \\ \\ ! \\ \\\nAt any rate, I vote \"NO\" oni \\ \\ ) / \\ >\n! /\nMy reasons are about the seme. a# Harold1e on this one. The sample\nlectures were well pp sented, very learned aid sincere. But I don't\nthink there 's anything here that jcouldnVt pretty near be matched by\nmany communities? locklly. I] tod, Would prefer a religious series\nthat represented! all creeds 4- if weaver decide to launch religious\nbroadcasts on th* Hftfe Network. Personally, I think this is an area\nthat the individual station? should take care of in their own way,\naccording to the needs and^resources of their particular community.\nWhich, again, is not to say that this isn't a very worthwhile\nseries for the U4 of Chi. to broadcast for their listimers, and I'm\nsure it Was wej£ Received,\n(2) U^^-eMfcAOO CHOIR »•> U, OF CHI.\nThe \"nothing that can't be duplicated at home\" routine is getting\nto be a cliche among us, but it still holds true here. Nice choir,\npoor mike pick-up. We've got half a dozen choirs in the Twin Cities\nthat could match this one, and I'm sure many other NAEB Stations could\nclaim tlie same.\n(3) PURITANISM IN PUD AND NEW ENGL/ND (U, OF CHI.)\nFirst, I don't like the varying lengths. Second, I think this la\na rather specialized topic to be presented alone — i.e., not in re¬\nlation to, and in sequence with, a broader historical survey of Am¬\nerican philosophical thought. I didn't like Simpson as much as"
}