{
  "id": "d802-175",
  "text": "/l/J, 4 . J * .\nCEi\neadc\nTO:\n/\nJohn Holt, Waldo Abbot, John\nRegnell and Jim Slack\nA M\nDATE:\nNovember l£, 1955\nFROM:\nHugh M. Mix : ’ •’ 12* * '\nSUBJECT:\nThe Child Beyond, UNESCO GIFT\nCoupon Program, Homage To Poets,\nAmerican Adventure, New World of\nAtomic Energy, Urban Frontiers,\nMonitor-New World, Vistas of\nIsrael, Panel on Columbo Plan\nThe Child Beyond: In spite of the fact that the dramatic scenes in these\nprograms are over-produced to a great extent, and in spite of the\nfact that they are, as Regnell says, corny, I feel that they have\nsome good points “which in a certain measure overshadow these in¬\nadequacies, I vote ■yes\".\nUNESCO Gift Coupon Program: The level on this program was very low, but I\nam assuming this happened in the dubbing room and is not true of the\noriginal programs. Vote \"yes\".\nHomage To Poets: A half hour seems a long time for a poetry program, and\nthough this may sound like blasphemy to poetry fanatics, I think the\nprogram could stand a little more production. And yet I find the\nprograms entertaining even though I am not a devotee. I'll vote \"yes\",\nand give them a try,\nAmerican Adventure: I don't quite see how the same title fits this new series,\nbut the programs are good. Vote \"yes\".\nNew World of Atomic Energy: Good program. Vote \"yes\".\nUrban Frontiers; I hate to see a good idea go down the drain, but here's\nanother example of Grant-in-Aid money being spent with little visible\n(or audible) result. As a true documentary, this could have been a\ngood series. As it is, it fits into the category of amateur dramatics.\nDoesn't a college this size have any mature voices who can say a line\nwithout sounding like they're reading? It just doesn't sell the idea.^\nWhat about research—they certainly didn't have to do much on this series.\nVote \"no\".\nMonitor—New World: \"Yes\".\nVistas of Israel: I am not clear on whether this is a series or a one shot\nprogram. It is well done, of course, but I would like to know more\nabout it. My impression of the program is that it presents only in\na superficial way facts about Israel along with a health serving of\npropaganda—emotional propaganda at that, since it compares present\nday Israel to frontier America. Any programs on Israel that went on\nthis station would have to be more meaty, dealing with some of the more\nserious problems of Israel and their solution, her relationship with the\nUnited States, Britain and her Arab neighbors. Vote \"no\".\nPanel on Columbo Plan: This program was recorded at such a low level that\nI wasn't able to get much out of it. In fact, I only heard about two\nthirds of it. I would like to withhold my vote until the other two\nmembers of the committee are heard from."
}