{
  "id": "d802-2",
  "text": "MISCELLANEOUS CONCLUSIONS AND RECOMMENDSTIQNS\nlo General purpose of the network® It appeared that the consensus of\nthe group was that the network should devote Its major effort to the dis¬\ntribution of well-planned and executed progress of significant educational\nor cultural purpose* It should not attempt to cospete with the major oora-\ninercial netowkrs in timely reports on world affairs* Nor should it attempt\nin any way to duplicate services provided by commercial broadcasters u:.i\nsufficient quantity* Rather, the tape network should seek to supplement both\ncommercial broadcasting, and its member stations* programming*\nThis does not exclude programs of a timely nature, where they are\nof value and in such quantities as can be readily handled, but such programs\nshould not receive major emphasis* Major emphasis should be on long range,\nsubstantive programs*.\n2® Federal Security Agency series. The committee was unanimous in\ntheir opinion that tins series was considerably below the desired standards\nin the writing and production* A lengthy discussion was carried on about\nthe inherent }*propaganda51 nature of programs originated by governmental\nagencies and similar organizations* It was felt that no general policy of\nexcluding such programs could be justified. Rather, each series shod' be\njudged on its individual merits*\nThe committee doss not object to programs originated by govern-\nnental agencies, international organisations, or foreign governments * .It\nfeels that the network should not be used for indiscriminate promotion of\nsuch organizations* Series originated by such institutions should be\njudged on 'the same bases as other programs.\nThe present series was rejected not because it was done by the\nFSA, but rather because it is, in the opinion of tbs committee* a poor\nseries of programs*\n3* The committee felt that its recommended procedures for selecting\nprograss to be offered on the network should be universally applied* To\navoid conflicting consnittraents, occasions of inability to deliver as\npromised, and similar embarrasing situations all. negotiations for programs\nshould be channeled in accordance with the procedures outlined in\nAppendix nTJv’ a\nIi* Music programs* The comittees generally agreed that music offer¬\nings by the network should consist of programs of a distinctly unique\ncharacter* The network should not waste its time, money, and facilities\ndistributing music performed by artists and consisting of compositions\nnormally available can commercial transcriptions, or recordings*\nThere is some doubt as to the desirability of distributing more\nor lass traditional music performsd by the best college and university\ngroups., This would bear further examination* In fact, some study needs to\nbe made before a final policy on musical programs can be delieneated."
}