{
  "id": "d802-30",
  "text": "Busing tiia past six months* lass than oswMmlf of the network aCferlngs\nhave been produced by Maber ErtaUaua.\nIt Is a source of paid© to a iim&m? station to have am of its program\naccepted far the 22AEB Sap® lietwcrk. Too constant rejection of mail programs will\ndiscourage stations £rm siflx&tting proposals* Wbm the Mucatioml Center takas\nover the FAE productions — Voices of Europe, Mays of Mankind, The Jefferson\nseries — and when stations also begin receiving foreign prqgrazas from the inter¬\nnational infamatim services, we will have nothing to fall back on if the MASB\nraoaber stations don't subnit proposals* If w® do not have active contribution and\nparticipation by our am group, the HAEB will have lost a very vital functioa.\nIn this caraectim, I jwrsanslly received nine audition tapes £raa the\nKAEB, all suhnitted by nenbor statics, during the past stasaor* I was given a very-\nfew day’s to veto on Uses. I voted favorably upon all, with rosormtions cKSnoorning\njust one. But th® 3®adquarters staff put only am of these prolans on tho Fall\noffering list* How did tbs other srnbers of th® Acceptance Corasittoe vote on these\nprograms? Bid they jjJ]* vote isifavorably^ I ask this because I have never been in-\n£aemd (xancorning th® vote of th® sobers of tho Acceptance Comaitt®® on any single\nproposal. Or did HAEB lieadquartors singly diisaiss our veto*\nTh® offerings of tho MSB Tape network for this Ml lack variety, and they\nare very think picking* I cannot underatsusd why j^mbors have not yet been offered\ntha Fund for Adult Education tomtaKbWdjd programs. Vfe were required to have them\nall at 2IAE3 H^dqtmrters hy August 1st at th® very latest. There must he at least\nseven series of progress that are available. They were chosen because they we\n©aoollant program* V&y aren't they being distributed?\nfrankly, it would soon to m that th® Fund for Adult Education would get\ndisgusted with th® Tap® Bstwork* Tl» Fund put up §80,000 and all it has received\nso far if a report. Th® member stations who won am*rda have all broadcast their own"
}