{
  "id": "d802-32",
  "text": "mmusamm\nand talk* Too laany lmXfr4&ar programs. 1% aaraaH mar© 15^dnute programs rmd©\navailable?\nHour regarding tfo© Program. Planrdng Comittee# It ban done a wentafbX job\nin obtaining ©aceHeat program and fSasaaiaX support from outside agencies# A\nnow and equally competent omMttm should be appointed for this purpooo# How*\never, I think the listwork Acceptance Caarndttoo almOd not ady be amowerod, but\nalso Instructed, to surest program Dories to mmber stations which could be\nproduced on a cooperative basis* Program could be developed and coordinated\nthrough the Acceptance Cocsalttee which would be of groat vain©, with a number of\nmember stations activoly participating and con&rilmti^ to the project* For ©an\natiplG, every cm of ns has sane kind of a IxwikHanthcr pragma* If thirteen member\nstations could each develop cm in a indues — am really outstanding program in the\nparticular area — wo could avoid duplication among ourselves, and perhaps have a\nmuch better series in the mid* Haybe such programs would be commissioned, and\nmembers told what to produce for a network series, and thus overcame the Imaards\nof catd>-as^i^ offering her mombera and screening by the Committee.\nAt the Columbus meeting of the Acceptance Camittee in 1953# certain\nrecOBsasidatice33 wore made (Appendix B, I&qacufciv© Coeaittea, 2*S^r 7# 1953)* Among\nthe veoasam^tlazs um the foSlowings ■Threcy offerer is to be infeas^d concerning\nthe disposition of his proposal within one month*1* This z*ooaapendation X© not being\nobserved* (TOR submitted an American Family series in August, and still has 33\ntapes tied up awaiting action* Ho adaiawledgaeni of receipt of the proposal, no\nnotice of disposition# And this is not an isolated case*)\nFoma to bo sent to each Acceptance Caaaitteo mt£x& we mireqgraphed at\nHeadquarters# Just cm has been used, for the ^a^itpeapfpas series* Other axplip*\ncations ear® in letter fora, which fail to give the required infCRsaatim* 3ug@estians\nfrom the University of Chicago contain no inf cassation as to the length of the\nprograms* Ife received no ferae at all, or infection of any kind, about the Africa"
}