{
  "id": "d802-37",
  "text": "March 19# 1954\nX\nProm vValdo Abbot, Chairman Acceptance Committee\nTo Northrop Dawson, KUOM, University of Minnesota, Minneapolis, Minn.\nBerten Holmberg, KUOM, University of Minnesota, Minneapolis, Minn®\nCamille Halyard, WBKY, University of Kentucky, Lexington, Kentucky\nHarold Hill, WILL ' University of Illinois, Urbana, Illinois\nJohn Holt, NAEB Tape Network, Urbana Illinois, Grayden Ausmus, Pres\nMembers of the Network Acceptance Committee:\nI have received letters from the new members of this committee\nasking for information concerning the procedure of the Network\nAcceptance Committee. This is hard to outline. However, I will\ngive you my conception.\n1. A station desiring to submit a program or series of programs\nfor acceptance by the Tape Network of NAEB will fill out o\ncopies of the submission form and forward these to the Tape\nNetwork, John Holt, Urbana©\n2« Upon receipt of the forms and a sample tape or tapes submitted\nby the station the Tape Network Headquarters will make dubbings\nand will send a tape together with the submission form to each\nmember of the Network Acceptance Committee.\n3. Each member of the acceptance Committee will send a report\nupon each of the tapes received to v/aldo Abbot, University of\nMichigan, with his comments either accepting or rejecting the\nprogram.\nk. Abbot will keep a score sheet showing how the votes are cast\nupon each of the programs submitted and when a vote has been\ncast by each member he will send the final vote to John Holt\nat Headquarters and to each member of the Network Acceptance\nCommittee.\n5. After the members have auditioned the tapes and sent in their\nvotes concerning the programs they will return the tapes to\nthe NAEB Tape Network Headquarters in Urbane.\n6o An effort shall be made to get a variety in the selection of\nprograms, in other words, not all should be talk programs or\ndrama programs, or music programs. We should mix them up and\nget some variety 30 that the offerings to stations will be\nvaried.\nI attach hereto copies of the rejection sheet that I will mail\nto the stations submitting programs which are rejected by the\nCommittee. This rejection sheet will give you an idea of the\nthings that we look for in considering the acceptance of a\nprogram by the Tape Network Committee. You may use these for the\nbasis of your reports, adding personal comments."
}