{
  "id": "d802-40",
  "text": "Station WGBri\nLowell Institute Cooperative\nBroadcasting Council\nSymphony Hall\nBoston 15, Massachusetts\nApril 5, 1954\nMEMORANDUM\nto: Harry J„ Skornia\ncc : NAEB Board of Directors\nNAEB Program Planning Committee\nNAEB Network Acceptance Committee\nFrom; Parker Wheatley\n1° bodkin lectures of Adial E. Stevenson\nI really appreciated your letter of April 1 about Adlai Stevenson’s Godkin\nLectures.\nlou. did the correct thing, of course, in observing the instructions of the\nDirectors. I simply did not find your earlier note clear as to reasons for\ndelay and possible rejection of the lectures. Now I do.\nI do not believe Mr. Stevenson’s lectures were political in the sense of being\npartisan and ’’Democratic\", excepting for a few quips to the Harvard audience\nwhich I would want eliminated. In fact, I wrote Mr. Stevenson’s assistant,\nWilliam Blair, Jr., about recommending a complete audition of the tapes and made\nsuggestions for preparing them for national broadcast over the NAEB Tape Network.\nI did not commit NAEB, nor did I assume approval by Mr. Stevenson, Meanwhile,\nthe following telegram has been received:\nApril 1, 1954\n’’Governor Stevenson’s publishers strongly opposed to distribution\nof tape recordings of Godkin Lectures. Therefore Governor feels\nhe cannot give permission. Sorry but hope you will understand.\"\nWilliam Blair, Jr.\nThis will settle everything unless NAEB wants me or itself wants to request\nMr. Stevenson to reconsider his decision. Personally, educationally and publicly,\nit seems to me that the United States could benefit greatly by such lectures,\ni, even if they were construed as political, which in the finest sense of politics\nthey are and should be. I would defer this to better informed persons in poli¬\ntical science and government but believe the tradition of the \"loyal opposition\"\nis one which thoughtful American* believe ws might well consider here in this\ncountry,\nAllen Miller grabbed the ball and offered to duplicate the tapes himself for a\nlimited distribution. Alas, the telegram above forecloses on his generous offer\nfor the time being unless the NAEB decides it wants to get busy and go after\nStevenson’s lectures. My offer above still stands.\nI would be particulary pleased to know how many stations reply to Allen’s memo\nof April 2 offering the Godkin Lectures, The response might make a real difference\nin getting permission to distribute the lectures."
}