{
  "id": "d802-41",
  "text": "Harry J» Skorrda\n•2-\nApril 5, 1354\nII. Distribution of \"Memorial Me8sags on the Death of Major Edwin Ha Armstrong\"\nTills is a good place to reply indirectly to kaldo Abbot and his kind lotter of\nMarch 30 about the \"Memorial Message on the Death of Major Edwin li. Armstrong*\"\nFirst, I was quite surprised to hear from Is a Ido about this because I had not\nhad the slightest idea this little piece Has still being considered for broad¬\ncast, If I had known I would have asked for the withdrawal of the original\noffer at once. Clearly, this had to be duplicated and issued within the week\nfollowing the Major's tragic death and broadcast within two weeks. The only\nother possibly acceptable date would have been a Saturday night some weeks later\n(I don't want to take the time to find the date) when a final memorial program\nwas presented on the Major's station in Alpine before it officially and forever\nleft the air. Frankly I doubt w© suggested its immediate use, although we may\nhave. That you did get it out apparently and that many stations did use it\nis pleasing to us but also a little pussling in view of Waldo's note.\ntialdo may be correct when he says that \"the program was somewhat over emotional\nin its presentation.\" Certainly it would sound over-emotional two months after\nthe major's death, although perhaps not so over-emotional on the day of his\ndeath or within a couple of weeks after it. My urge to offer it was based upon\nhis very great interest in NAJKB FM development, his close association with Mr.\nJansky who is wo11 knownto many of us and who has often helped the NAEB and some\nof its member stations, I believe, and our own organisational and personal re¬\nlations with him. Apparently the Major is considered by those in authority to\nbe one of the great inventive intelligences of all time and perhaps the last\nof great individual inventors, as I believe the Mew yoric Times put it.\nIll* NAEB Tape Network Procedures\nIt would help persons like us, certainly, and I should hope all member stations,\nif information such as you gave me in your April 1 letter were issued to each of\nus routinely so we would know the capabilities of our organization at any given\ntime and sciriething of the needs and interests in receiving program suggestions\nand tapes, be have been sending things to you in the belief that we were help¬\ning educational broadcasting, the NAEB and interested member stations when and\nif an offering were accepted. he have no complaints at all but rather con¬\nsiderable gratitude for what we have been receiving from our members and what\nwe have attempted to give. I would add simply this: that now as a non-member\nof the Board and as a member of only two committees I have a very specific\nunderstanding and sympathy for the reports I used to hear discussed while on\nthe Board - that member stations did not know sufficiently what was going on\nand what was being decided which might afi'edt them. If I failed as a Board\nmember to appreciate this situation, however good the reasons were then and now\nmay be, I apologize and go on record in favor of some communication system\nwhich goes beyond the Newsletter and which is more direct and timely. For"
}