{
  "id": "d802-45",
  "text": "The MaBB Network (Operations?-) Cogalttefl will be responsible for informing\nof its progress, decisions, recommendations, etc., members of relevant committees\nand members, project managers, directors, and executives of the NAEB, It will\nalso be responsible for seeing that replacements on and additions to the NAEB\nNetwork Committee are completely informed of the purposes and all past actions\nof the committee.\nThe Executive and Associate Directors and the Network Manager will act as\nex officio-advisory members of the NAEB Network Committee, as they do with all\nother Network-oriented committees.\nMotes on the Proposed NAEB Network (Operations?) Ccmroittee\nThe Chairman. Vfe strongly recommend that Jim Miles be given this job.\nMiles not only directs a member station and is not a member of any of the\ncommittees whose work bears on the Network, but, as a former Executive Director\nof the NAEB and manager of the Network, he has a great deal of Network know¬\nledge which will be useful to the proposed committee, and he ha© an appreciation\nof the various points-of-view involved in the Network project. He is probably\nthe most qualified candidate available for the job.\nThe Committee Members. Drawing more than one member for the proposed\nNAEB Network Committee from each of the other Network-oriented committees would\nresult in a group so large that it would probably be unwieldy and ineffective,\nespecially if representatives from other conmdttees were later to be added to\nthe membership. As proposed, the membership would run*\nMiles, Chairman\nfrom Network Acceptance Committee - its Chairman, Abbot\nfrom In-School Program Committee - its Chairman, Fleming\nfrom Radio Program Planning Committee - its Chairman, Sckooley\nfrom International Relations and\nPublic Relations Committees - its Chairman, Siegel\nfrom Engineering Committee - its Chairman, Menzer\nAt present the International Relations and Public Relations Committees\nhave the same chairmen, of course. If in the future they should have different\nchairmen, one more member would automatically be added to the NAEB Network\nCommittee.\nThis looks like a very strong working committee. Its members are\nexperienced and respected people who direct member stations, and Headquarters\nshould be able to work well with them.\nAnd Headquarters looks forward to working with the NAEB Network Committee\nif this proposal is approved."
}