{
  "id": "d802-87",
  "text": "i\nAugust 17, 1954\nMr. Waldo Abbot\nRadio Station WUCM\nUniversity of Michigan\nAnn Arbor, Michigan\nDear Waldo*\nSons more votes — maybe ve’ll get ,em all done within a few more days*\nI certainly hope so.\nDOORWAY ID THE FUTURE - National Citizens Commission for the Public\nSchools.\n— YES - Very well presented story of the growth of education in this\ncountry* The one we beard on the segregation decision by the Supreme\nCourt made timely reference to \"last week,” but this could be corrected*\nAlso, this program, and maybe others we didn’t hear, might not go over\nso well in the South, but that1 a up to the individual stations. Peel\nthese are a littls over-dramatic, but maybe that’s what we need in\neducational broadcasting once in a while,\nTHE WRITER AT WORK - U, of Chicago\n— HO - The extreme jgglgiion in length of these programs is such that\nit would be almo- t*?or individual station program directors to use them\n\"as is** except as fill for other programs. And the Hq. network staff\ncertainly doesn’t have time to prepare fill for these to make them uniform.\nAlso, the programs don’t really give the listener a feeling of having\naccomplished anything by listening. It may be slightly amusing to hear\nthe personal correspondence of others, but what value a$ it? Maybe\na little comment in connection with the reading of the letters might help,\nbut I doubt it. The on© on Fitzgerald, is the better of the two, it seems\nto me, and is a well-told autobiography, but might be presented in a\ndifferent manner. The other sample program, leaves the listener groping,\nfor the first several minutes, wondering just what is going on,\nHAZARDS TO EDUCATION - U. of Chicago\n— YES - Primarily because I believe In the »guest speaker” type of\nprogram, so long as the speaker is a recognized expert in the field\nupon which he is speaking and delivers his material in an interesting\nfashion. Also, I think the network should try to offer shorter series\nthan the conventional 13, when the subject matter warrants. There are\nmany times that the program director is looking for good program material\nof shorter duration. Also, like to have some programs that can be used\nalone, as one-shots — these, I think, fill that bill, too."
}