{
  "id": "d802-9",
  "text": "APPENDIX \"D1\nHEGOMffimTIONS OF THE NAEB NETWORK ACCEPTANCE COMMITTEE AND THE IN-SCHOOL\nPROGRAM COMMITTEE ON SPECIFIC METHODS OF IMPIEMENTING BASIC RECOMMENDATIONS\nON PURPOSES AND PROGRAM ACCEPTANCE STANDARDS\nlo Methods of determining programing needs*\nA* Polling of member' stations* (Recommended that this be dona.)\nB, Recommendations of committee members*\nC, Securing the recommendations of subject matter experts*\nD, RecomisBndations of MEB officers and headquarters staff*\nSpecific methods of selecting programs for network offering.\nA. General programs*\n(1) The NAEB Network Acceptance Gorarnittee id. 11 meet at the call of\nthe chairman in consultation with the headquarters staff. The\nheadquarters office can request a meeting of the committeeo\nApart from such meetings as may be called the committee will\ncontinue to be a consultative body for the headquarters staff.\n(2) Network headquarters will compose offering schedules in accord\nwith the followings\n(a) Headquarters will noraalfy select the programs to be dis¬\ntributed*\n(b) It will refer to the members of the committee all programs\nof a doubtful nature, or which involve points of network\npolicy, or for which it desires the weight of committee\nsupport for its decisions*\n(c) It will inform the committee members in advance of offering\nwhat programs are to be included*\n(d) Committee members reserve the right to request an opportunity\nto audition any program*\n(e) Committee members will continue to make whatever recommenda¬\ntions they ds812*8 to the network staff*\n(f) Network headquarters will endeavor to make arrangements\nwhich'will enable it to offer the bulk cf network programs\nat least three months in advance* This is not intended to\nexclude such programs as must be handled on a more immediate\nbasis *\nB« In-School programs.\n(1) It is the recommendation of toe in-school committee that it meet\nsemi-annually* These meetings to take place the two days pre¬\nceding the Ohio Stole Institute and the top days preceding the\nannual NAEB Convention* (There is involved a question of\nfinancing some or all of the expenses of committee montoers* The"
}