{
  "id": "d1081-1",
  "text": "labor relations in educational television. The position is taken that the\nmatter of compensation for professional educators must be evaluated within\nthe total educational context and must be worked out among educators within\ntheir own profession; it is not a matter for outside interference or control\nby specific trade unions.\nHENRY NAMED TO FCC\nE. William Henry, 33-year-old Memphis attorney, has been nominated by\nPresident Kennedy to succeed John S. Cross on the FCCm Cross, whose term\nofficially expired June 3O9 will continue to serve on the Commission until\nHenry's appointment is confirmed by the Senate .A Henry had worked actively\non the Kennedy Presidential campaign. He feels there is room for improvement\nin television programming and that it is up to the industry to provide it.\nHowever, the government should act if the industry doesn't.\nSIXTHS FEDERAL AID TO ETV\nCei+e+trre. £\n7~& Ott y - Z-f\nOn August 28, representatives of HEW appeared before the House Appro¬\npriations committee to ask for $4.75 millions dollars for operation of the\nFederal aid to ETV program for the balance of the fiscal year. However,\ncertain members of the committee indicated they felt that the nsa FCC pro¬\nposal for ±hut new ETV service in the 2000 me band might make appropriations\nunder the ETV legislation unnecessary0 HEW presented a detailed report showing\nhow the two systems are totally different, and both needed. No action has\nyet been taken by the House committee. In viewot^ this fact9 and that the\nmatter still has to be pEe&eh4ea 1 the Se nate^co mm ft tee, it is gstisr'allly\nbe possible for HEW to make any grants for ETV construction\nwithin the 1962 calendar year.\nFCC PROPOSES ALL-CHANNEL TV RECEIVER RULES\nTo implement the 1962 law requirement that all TV receivers shipped in\ninterstate commerce be able to receive both UHF and VHF signals, the FCC\nproposed, on Sept. 12, rules for technical compliance which, upon adoption,\nwill give manufacturers time to completely switch over to all-channel set\nproduction by April 30, 1964. The proposals are the result of conferences vmfrg\nEIA and reflect views of makers fa of TV receivers and tuners. The 1964 tar¬\nget date is being proposed to give manufacturers opportunity to incorporate\napproved standards in thetr 1965 models (1964 models havejalready been designed)\nwhich will be designed by June, 19639 produced early in 1964, and put on sale\nby June, 1964. The April 30, 1964 date is pegged to the manufacture of the set.\nOne made before that date would be marked to show it had been manfuactured\nahead of the deadline and could thus be shipped for sale on any subsequent date,\neven though not meeting all-channel r equirements. Comments to the proposed dx\\j(\nru 1* makingpar-e 'tmrited by October 22*\nDEINTERMIXTURE PROCEEDINGS TERMINATED\nOn Sept. 12, the FCC terminated eight deinter mixture proceedings\ninvolving Madison, Wise., Rockford, Ill., Hartford, Conn., Erie, Fa., Bing-\nhampton, N.Y., Champaign, Ill., Columbia, S.C., and Montgomery, Ala. The\nCommission took this action because, as it informed Congress, enactment of the\nall-channel receiver legislation is a major change in the circumstances pxxx\naffecting these previous deinter mixture proposals and a sufficient period of\ntime should be allowed to indicate whether the all-channel requirement will\nachieve the Commission's overall allocations goals.\nNAEB OPPOSES SHIFT OF CH. 47 TO NEW YORK CITY\nIn line with its general recommendations for ETV channels contained in\n\"The Needs of Education for Television Channel Allocations, \" the NAEB filed"
}