{
  "id": "d1774-5",
  "text": "people with the courage to take issue with nonsense-\npeople who feel that controversy is not necessarily\nbad—that open, intelligent, concerned discussion of\ncontroversial problems is essential if we are to chal¬\nlenge the people of our nation to intelligent problem¬\nsolving. It will be people who believe our educational,\nsocial, cultural and economic systems are to be used,\ninfluenced, and kept dynamic for the greatest good\nof our people—not merely be complied with or ad¬\njusted to.\nIf these objectives are to be achieved, our As¬\nsociation must be transformed into a nation-wide\nmovement and effort, guided by and listening to the\nbest minds in our nation. As educators and educa¬\ntional leaders we must here propose, and resolve to\nperform, in a manner worthy of the needs of our age\n■—or abdicate to others who can and’ will do so.\nWe need to counteract the concept of education,\nnow so often falsely conceived of as odd bits of in¬\nformation or culture, or “success gimmicks” aimed at\nincreasing the individual’s income-earning potential\nor popularity. We need to resist the concept of\nscience as essentially “vocational education.” We need\nto think of education as an organized, life-long effort,\nto enable man to realize as richly and fully as pos¬\nsible, his full human potential for citizenship in a\nfree society.\nThe eyes of millions of people in new-born and\nbackward nations are on us. They look to us for\nleadership. How we use mass media in our present\nsituation will in part determine whether or not we as\na nation deserve or continue to exercise world leader¬\nship. The influence which educational television and\nradio (if adequately developed can exert in this\ntotal problem should not be under-estimated.\nThough far behind us in this area now, within\nthe next ten years, it is our belief that Russia will be\nillustrating to the world what can be done with radio\nand television as a part of their educational system.\nWe would hope that it will not take a Sputnik in this\neducational area as well, to awaken us, and cause us\nto become organized in making maximum use of our\npresently still superior electronic resources.\nThere can be no serious question in the minds of\nintelligent people regarding the superiority of de¬\nmocracy, based on belief in the importance of the in¬\ndividual. But, to quote Woodrow Wilson: “Demo¬\ncratic institutions are never done—It is a strenuous\nthing this of living the life of a free people; and we\ncannot escape the burden of our inheritance.” How¬\never small the part we can play in meeting the educa¬\ntional needs of our nation and the world' may be, we\nmust meet it wisely, courageously and promptly.\nDIRECTORY CHANGES\np.\n1\n135 Active Members\n96 Associate Members\np.\n4\nDelete:\n(under KPFA)\nLewis Hill\nAdd:\nHarold Winkler\np.\n7\nDelete:\n(under WIAN)\nBetty Barth\nAdd:\nNancy Hendricks\np.\n20\nDelete:\n(under Birmingham Area ETV)\nDr. Harry M. Lyle\nAdd:\nDr. Earl E. Sechriest\nNETWORK NEWS\n—Bob Underwood\nAt this month’s NAEB Annual Convention, time\nhas been set aside for listening to network programs\n(mainly present and future series); also, there is to\nbe a “What’s Your Problem?” session. While I hope\nyou don’t have any real problems with the network,\nI would appreciate your dropping by our network\nbooth. Potential network members are invited to\ncome by, examine the network materials which will be\navailable, and discuss the possibility of receiving\nnetwork service. I’ll be happy to explain the net¬\nwork’s operation to any NAEB member, and for\nyou Associate members we’ll have a catalog of net¬\nwork programs which you may obtain for broad¬\ncast over your local station.\nI am very happy to report that the response to\nthe fourth quarter offering has been excellent, in¬\ndicating that we are offering the type of programming\ndesired by stations. If you have any suggestions on\nthe type of material we could add to our offering, I’ll\nbe glad to hear from you.\nAs of this writing I am working on the offering\nfor the January - March period of next year, and it,\ntoo, should find a good market among network sta¬\ntions. Once again we will be offering nine hours per\nweek to all full-time stations plus a bonus series and\nsome special one-shot programs. I’ll have more de¬\ntails on this at a later date.\nThe response to our appeal for tape returns has\nbeen good, but there are still a number of stations\nwhich could send back large numbers of tapes. If you\nare a responsible person at one of these stations, will\nyou please see that the network tapes are returned\nregularly? Your help and cooperation is deeply ap¬\npreciated.\nSubmissions still are a bit slow in the fifteen-\nminute class, so if you have any series in this time\n6\nSee You In Omaha\nNEWSLETTER"
}