{
  "id": "d1198-0",
  "text": "-f T'l^U - Uoof\n£bbct, Waldo, Dir. of Broadcasting, Univ. of Michigan, Ann Arbor.\nAckerson, Ruth E., Teacher, Sr. High School, Springfield, Ohio.\nAdams, Edwin H., Exec. Officer, Dept, of Radio Edu., Univ. of Washington, Seattle 5.\nAdams, William J., Program Manager, WHEC, INC. 40 Franklin St., Rochester, N.Y.\nAdkins, Gale Roy, Asst. Director, Radio House, Univ. of Texas, Austin, Texas.\nAlbinger, Albert R., Production Mgr., WOOL, Columbus 15, Ohio.\nAhn, George B. Jr., Dir. of Pub. Relations, Pa. State Council of Christian Edu.,\nThird & Reilly St., Harrisburg, Pa.\nAnderson, Kenneth H. Asso. Dir., Natl. Comm., 59 E. Van Buren St., Chicago 5-\nAuer, J. Jeffery, Dept, of Speech, Chr., Oberlin College, Tberlin, Ohio.\nBaird, Thomas, Dir., Film Div., British Inf. Services, 30 Rockefeller Plaza, N.Y.\nI&rdon, Florence A., Teacher, Lindblom Technical H.S., Chicago, Ill.\n^arnouw, Erik, Writer - Radio Courses, Columbia University, New York City 27.\nW^artlett, Dir., Radio Workshop, Syracuse Univ., Syracuse 10, N.Y.\nBatchelder, Mildred L., Library Specialist •• Am. Library Assn., 50 S. Huron St.,\nChicago 11, Ill.\nBauer, W. W., Dir. Bur. of Health Edu., AMA, 535 N.Dearborn St., Chicago 10, Ill.\nBaumgartner, Ira, Supt. of Schools, Bd. of Edu., Sylvania, Ohio.\nBaylor, David M., V.Pres & Gen. Mgr., WJMO, 2157 Euclid Ave., Cleveland, Ohio.\nBell, Richard H., Dir., Religious Press & Radio, First Community Church,\n1320 Cambridge, Blvd., Columbus 8, Ohio.\nBellamy, Richard K., Mgr. of Publicity, Benton & Bowles, Inc. 444 Madison Av.,N.Y.\nBender, Armin N. Supvr. of Special Services, WHAM, 111 East Ave., Rochester 4,N.Y.\nBennett, Henry Garland, Pres., Okla, Agr. & Mech. College, Stillwater, Okla.\nBergoffen, Wm. W., Information Specialist (Radio), U.S.Forest Service, Wash. 25.\nBertermann, Eugene R., Dir. of Radio, The Lutheran Hour, St. Louis 18, Mo.\nBickel, Mrs. Clyde E., Cc-Chr., Radio Committee, Gen. Fed. of Women 's Clubs,Mich.\nBillings, Clarke,Mrs., Chr., Comm. Radio Workshop, Salem, N.C.\nBlack, John W., Prof, of Speech, Kenyon College, Gambler, Ohio.\nBlanchet, Mrs. Harold J., Chr. of Radio, Junior League, Saginaw, Mich.\n1S6gen, Paul L. Dir. of Radio, University of Nebraska, Temple 3, Lincoln, Nebr.\nBorel, Richard A., Station W3NS, 33 N. High St., Columbus 15, Ohio.\nBoutweli, Wm. D., Asst to Publisher, Scholastic Magazines, 220 S. 42d St., N.Y.\nBower, Warren, Asst, to Dean, Div. of Gen. Edu., N.Y. University, N.Y. 3.\nBrady, Thomas A., V Pres. University of Missouri, Columbia, Mo.\nBrawley, Harry M. Edu. Dir., WCHS, Lee St., Charleston 1, W. Va.\nBray, Sally, Dir., Health Edu., Cols. T.B. Society, 503 Oak St., Columbus 15, 0.\nl/^ryson, Lyman, Counsellor on Pub. Affairs, Columbia Broadcasting System, New York\nBrecher, Edward M., General Mgr., WQQW, Washington 8, D.C.\nBrown, Rex W., Asso. Dir. of Information, A & M College, Fort Collins, Colorado.\nCanowitz, Lois A., 744 S. l8th St., South High School, Columbus 6, Ohio.\nCari Cari, Claire H., Dir. of Sta. Relations, Gardner Adv. Co., St. Louis 1, Mo.\nCarter, Joan E., Women's Prog. Dir., Fetzer Broadcasting Co., Kalamazoo 99, Mich.\nCarter, Marian S., Dir., Radio Forum Div., The Town Hall, Inc., New York 18, N.Y.\nCasperson, Chas., Student, South High School, Columbus, Ohio."
}