{
  "id": "d1198-11",
  "text": "page 5\nSadler, Jr., W.H., Dir. of Radio Relatione,Am.Leg.Dept. of Texas,Austin Deshler 121+2\nSeel, Helen, Curriculum Asst., Bd. of Ed., Cincinnati, Ohio Deshler 464\n^Bener, Wm. H., Gen. Mgr. KUSC, Univ. of S. Calif., La. 7, Calif. Deshler\nSiedel, Frank, Writer, The Ohio Story, Cleveland, Ohio Seneca\nSkon, Harold L., Student, OSU, Columbus, Ohio\nABlcornia, Mrs. H. J., Indiana University, Bloomington, Ind. Deshler 14-22\nSlade, George W., Asst. Dir. Lowell Inst., .Boxton l6. Mass. Deshler 1029\nSouers, Millard B., Student, Denison University, Granville, Ohio Deshler\nSteinberg, Bertha, Asst. Director, N.A. Ser. French Brdcstg.System,N.Y.Chittenden528\nSteininger, Reed, Student, OSU, Columbus, Ohio\nSterner, Alice P., Teacher of English, Barringer H.S., Newark, N.J. Deshler 975\nStiles, Emma L., Eng. Teacher, BIS, Lancaster, Ohio\nStone, Alvin W., Radio Editor, Columbus, Ohio\nStowell, Thomas C., Dir. of Pub. Health Edu., Albany 6, N.Y. Deshler 551\nSulenski, Henry A., Student, OSU, Columbus, Ohio\nV^ulzer, Elmer G., Univ. of Kentucky, Lexington, Ky.\nSymons, Sheila K., league Rep., Saginaw Jr. League, Saginaw, Mich. Deshler 650\nTaylor, F. P., Co. Agr. Agt., Steubenville, Ohio Southern\nThomas, Robt. David, National Sales, WBHS, Columbus 15\nTinsley, Emily N., Ex. Sec'y, Cols. Council for Democracy, Columbus\nTobin, Patricia E., Commentator WWJ, Detroit 3* Mich. Deshler\nTompkins, Mrs. Roy R., Okla. A & M College, Stillwater, Okla. Deshler\nTonkin, Joe, Field Service Officer, USDA, Radio Service, Wash. D.C. Deshler\nTotten, Hal, Farm Director, WGN, Inc., Chicago 11, Ill. Deshler\nTrenton, Margot J., Instructor in Radio, Stephens College, Columbia, Mo.Deshler\ny^FJyiLer, Margaret C., Supervisor Ohio School of the Air, Columbus, Ohio Deshler\n315\n1342\n418\n1771\n1550\n454\nVan Deventer, Denver, Div. Director, Empire Crafts Corn, Newark, N.Y.\nVenn, Elma L., Production Asst., WOSU, Columbus 10, Ohio\nWaddle, Thelma I, Supervisor, Pittsburgh Bd. of Ed., Pittsburgh, Fa .-Ft .Hayes 604\nWagner, JayE., Student, WOOL, OSU, Columbus 10, Ohio\nllMakefieId, Ray C., Commissioner FCC, Washington, D. C. Deshler 660\nWhalen Lucretia C., Teacher, Frick School, Pittsburgh 15, Pa. Ft. Hayes 6’04\nWhan, F. L., Head, Speech and Radio Dept., U. of Wichita, Wichita,Kans. Seneca\n[/Meeting, C. Maurice, Dir. Information Service,Natl. Farm Coun., Wash.6 Deshler 776\nWilliams, Catharine M., Instructor, OSU, Columbus 10, Ohio\nWilliams, Don, Asst. Prof. Dept, of Speech & Radio, U, of Wichita, Kans. Seneca\nWilliams, Harry L., Director, Radio Parish, Nashville 4, Tenn. Deshler 1556\nWoelfel, N., Director Teaching Aids Lab., OSU, Columbus 10, Ohio\nWood, Jean L., Chief Radio Program Sect., Armed Forces Ser./Washington Deshler\nWorcester, Charles A., Farm Service Dir., WMT, Cedar Rapids, Iowa Deshler 451\nYeager, Connie R., Student, OSU, Columbus, Ohio\nYoung, George L., Dir. of Pub. Relations WKBN, Youngstown, Ohio"
}