{
  "id": "d1198-2",
  "text": "Page 3\nGehman, Henry Nevin, Asst, to Sec’y of Bicentennial, Princeton Univ., New Jersey.\nGinn, Edwin H., Asst, in Padio, Boston Univ. Bur. of Publicity, Boston, Mass.\nGist, Wm. Colvsr, Go. Agt., Ext. Ser., College of Agr., Wellsburg, W. Va.\nGoodbold, Mrs. Geo. V., Pres., Padio Council of Greater Cleveland, Ohio.\nGoodrich, Bob, Student at South High School, Columbus, Ohio.\nGordon, Dorothy, Moderator of Youth Forums, N.Y. Times, New York l8.\nGrant, Lowell E. Dir. of Padio, Flint, Pub. Schools, Flint 3, Mich.\nGreen, Darrell B., Dir. of Engineering, Ohio University, Athens, Ohio.\nGrubler, Dorothy (Mrs.) Public Infor. Dir., Am. Ped Cross, Dayton 2, Ohio.\nGruenberg, Mrs. Sidonie M., Dir., Child Study Assn, of Am., New York 19, N.Y*\nGudaitis, William V., Univ. of Detroit, Detroit 21, Mich.\nHaas, Mark L., Sdu. Dir., WJP, Fisher Bldg., Detroit 2, Mich.\nHaddox, Barbara, WBNS, 33 N. High St., Columbus, Ohio.\nHardy, Leslie P., Dir. of Adult Edu. University of Akron, Akron, Ohio.\n.Mytfard, Frederic, Station Mgr.,KW3C, State College of Washington, Pullman, Wash.\ndSnderson, John D., Edu. Supv. WBAA, Purdue Univ., Lafayette, Ind.\nHibbler, Bill, Student at South High School, Columbus, Ohio.\nHiller, Ola B., Director of Padio, Pontiac Pub. Schools, Pontiac 18, Mich.\nHoke, Evelyn S. Dir. of Teaching Materials Ser., Ball State T. College, Muncie,Ind\nHolbert, Bernard, Chief Eng., KSAC, Kansas State College, Manhattan, Kansas.\nHolme, Nancy, Dir. of Edu. KNX, Col. 3. System, Hollywood 28, Calif.\nHorchow, Mrsl Joseph, Pub. Chr., Instructive Dist. Nursing Assn., Columbus 19.\nHorn, Pobert C., News Dir., WMAN, Mansfield, Ohio.\nHoward, J. Gordon, Pres., Otterbeln College, Westerville, Ohio.\nHudelson, Ben A., Edu. Dir., WBZ, Boxton 16, Mass.\nHutchinson, Carl P., Edu. Dir., Ohio Farm Bureau, Columbus 16, Ohio.\nHuff, Warren C., Coke Oven Ammonia Research Bureau, Columbus 15, Ohio.\nHuffington, B. Walter, Radio Dir., Am, Red Cross, Washington, D. C.\nHughes, Pay 0., Moderator, WWSW, Pittsburgh 6, Pa.\nHunt, Elise, Teacher, Stephens College, Columbia, Mo.\nHunter, Armand L., Chr. of Padio-Speech-Theatre, Temple Univ., Philadelphia 22,Pa.\nHuth, Arno, Padio Consultant, Lecturer, Foreign Correa., New York 19, N.Y.\nHyde, Nelvin, De^n of the College, Mount Union College, Alliance, Ohio.\nJacobs, Stephen, Student, Antioch College, New York (290 Riverside Drive)\nJohnson, Irwin, WBNS, 33 North High St., Columbus 15, Ohio. ^\nJohnson, Willard L., V. Pres. Natl. Conf. of Christians & Jews, New York lo, N.Y.\nJohnstone, G. W., Dir., Radio Dept., Pub. Relations Div., Nat. Assn. M-frs, N.Y.2C\nJones, Florence H., Radio Con., Free Lance, Norwalk, Conn.\nKadri, Said S.K., Delegate, Egyptian Min. of Edu. Bur., Washington 8, D.C.\nKaiser, Russell C., Prog. Dir., KWh, St. Louis 8, Mo. . .\nKane, Rev. George L., Dir., St. Francis Xavier Univ. of the Air..Antigonish. N.S.\nKavanaugh, John F., Pub. Relations Sec’y., Am. Friends Ser. Comm., Phila. 7, Na.\nKearful, Mrs. Viola S., Pres, Saginaw Radio Council, Saginaw W.S., Mich.\nKelly, Albert E., Manager, WOOL, Columbus 15, Ohio. (l,W.Va\nKelly, Virginia E., Dir. of Audio-Via. Education, Kanawha Co. Schools, Charleston\nKetcham, Pres. Charles B., Mt. Union College, Alliance, Ohio.\nKeur, Cornelius, Pres., Christian Broadcasting Assn., Chicago 4l, Ill.\nKinany, G.E., Dir., Egyptian Edu. Bur., Min. of Edu., Washington 8, D.C.\nKing, Eugene H., Mgr., Program Operations, WOP, New York 18, N,Y.\nKirk, Mi33 Lillian, Dir., Pub. and Client Relations, WKBW, Buffalo 3> N.Y.\nKirk, Marguerite, Dir., Dept, of Libraries,-V.A., and Padio. Newark 2, N.J.\nKnight, Bob, Student, South High School, Columbus, Ohio.\nifobak, Edgar, Pres., Mutual Broadcasting System, New York 18, N.Y.\nKoerper, Karl, Managing Dir., KMBC, Kansas City 6, Mo."
}