{
  "id": "d1268-10",
  "text": "-8-\nsome idea of proportional representation, I am sure that John Dunn, when he\nmade up the Districts, and the Board when it approved them, many years ago,\nhad a combination of houses in mind, I am happy that you threw this whole\nmatter back to the Directors — I think that’s where it belongs — someone has\nto work out an equitable plan. Perhaps there are other districts that like¬\nwise need some breaking up for geographical purposes alone. You will remember\nthat at your insistence, the Constitution Committee this past year took steps\nto make it possible for the Board to create anywhere from five to ten Regions.\nIf I am not mistaken, this was one of the few things which met with informal\nsupport at the business meeting in New York City this last fall (October, 193>U),\nThus the membership agrees with your thinking that the Board should come up\nwith a definite plan for redistricting.\n£) ANNUAL MEETING. I couldn’t agree with you more. Certainly it would\nlend strength to the Association if the meeting were always held in the Chicago\narea. But perhaps your solution of one in Chicago, then on the East Coast,\nthen Chicago, then one on the West Coast, then Chicago again, is a good answer,\nI am sure this will come up for more discussion in Chicago in 19££ and your\nrecommendation should be presented at that time.\nI would like to comment on one other thing that was sort of tossed in\nbackwards at this meeting. I believe it was Pat Greene who made the statement\nthat we did not have a tradition of meeting on institution campuses. If we\ndo not have, it’s because it was broken down by the meetings at Biloxi, at\nNew York, and now by this meeting-to-be in Chicago. I believe that if you\nwill check all the rest of the meetings, national and regional, you’ll find\nthat they were held upon college campuses. I, for one, think they should con¬\ntinue to be held on college campuses. The facilities are good at the larger\ninstitutions, and prices are usually less expensive than in the major cities."
}