{
  "id": "d1268-24",
  "text": "-22-\nwe would prefer to have it handled by contract rather than developing our own\nstaff to do the job.\nQuestion—Pat Green: Will there be any distribution to commercial stations\nof anything which the Center handles?\nNewburn: That is a basic policy question which has not yet been settled by\nour Board. Our present thinking, which I am glad to check with you, is that\nthere should be no distribution to commercial outlets until the materials\nhave been shown in that area on the educational stations. After they have\nbeen shown on educational stations, and if we have the necessary rights, the\nmaterials might be made available, some of them, to commercial stations.\nGreen: If there is no educational station in that area, however, and there\nmay not be one for some time, will such a program be available for use in that\narea until there is an educational station?\nNewburn: Generally no, if there is any reason to think there will be an edu¬\ncational station in that area. On the other hand, where there clearly will\nbe no station for some time to come, we might make materials available to an\neducational institution for use on time donated by a commercial station. At\nleast, we are considering that possibility.\nBarrett: I wanted to ask about the potential acceptance of your editorial\npolicies—that is your selection policies—by colleges, universities, state\norganizations, public school districts, and so forth. Do you expect any\nproblems in this respect?\nNewburn: Our evidence at the moment would indicate that stations which are\ngoing to be on the air in the next few months are so eager for help that such\nissues will not come to the front immediately as much as they might later.\nWe do think this is a problem—and your question is a good one—but we intend\nto do everything we can to solve it before it arises. I already have indi¬\ncated our plans to draw in large numbers of educational consultants, from all\nfields, to consult often and carefully with station managers on major items\nof program policy and through research to establish the areas of greatest\nneed in the minds of educational leaders throughout the country.\nThere is still another way to offset any tendency for program control\nfrom a central source. That is to make programs adaptable to the local situ¬\nation. Thus, for example, by supplying twenty minutes of film material for\na thirty-minute program, we permit the local station to build its own local\ndiscussion for the remaining portion of the time. I believe this method has\nreal possibilities and we are seriously considering it.\nAusmus: Many of us who have been the most active in educational television\nare concerned that in its first year of operation educational television may\nnot put its best foot forward. In other words, the real potential of the"
}