{
  "id": "d1788-4",
  "text": "NAE8 h'ENS LETTER........PAGE .MW I* * 9^3\nMO ONE QUESTIONS THt NEED TOR IMPROVEMENT 0?* MAW PROGRAMS OFFERED PV COLLEGES\nAfiP tJHl VERB* TIES* tVUSTHER THOSE. PROGRAMS GO OUT OVER A NOW*QWEO STATION\nOP. OVER A COLLEGE*OWNED STETSON,. GoMflERCI AL RADIO |TS£LP ADMITS THAT IT\nTOO HAS ROOM *“011 IMPROVEMENT HERS AMR THERE, %T t AM NOT ?ll COMPLETE AGREE¬\nMENT WITH THE GENERAL STATEMENT THAT EVERYTHING EVANA71 WO TROM A COLLEGE\n\\\nOR ON:VERS I TV MUST HAVE “SHOWMAN3HtP M ^00CAT IONALLY OWNED STATIONS RECEIVE\nAMPLE FAN MAIL TO INDICATE THAT THE TYPE or THING THEY ARE DOING IS APPREC¬\nIATED *>NJ WELCOMED BY A S? 7.A31.E GROUP.\nOBVI0U3LV A COMMERCIAL STATION HAS WORKED HARD TO DEVELOP ITS AUDIENCE\nTHROUGH THE SCIENCE OF SHOWMANSHIP ON THE AIR. ^0 GAMBLE WITH L08ING EVEN\nA SMALL PERCENTAGE OF THIS AUDIENCE BV PRESENT5NO A POOR COLLEGE PROGRAM f 3\n.MORE OP A CHANCE THAN THE COMMERCIAL STATION WANTS T0 TAKE, ?N SPITE OF\nTHIS $A»3LCf HOWEVER, MOST STATIONS HAVE GIVEN GENEROUS PORTIONS OF THEIR\nBROADCAST TIME*\nThose institutions which get to a radio audience onlv once or twice a year\nHAVE NO EXCUSE, IN MV OPINION, FOR PRESENTING OTHER THAN A SHOW WHICH, WHILE\nIT TELLS A MESSAGE THE INSTITUTION WANTS ITS LISTENERS TO KNOW, CAN BE MADE\nSO ENTERTAINING THAT BOTH THE STATION MANAGER AND THE LISTENERS WILL FEEL\nWELL REPAID FOR THE INVESTEMENT OF TIME, HOWEVER, TO EXPECT AN INSTITUTION\nTO PRESENT PROGRAMS SEVERAL TIMES A WEEK WHICH ARE CRAMMED FULL OF SHOWMAN¬\nSHIP AND ENTERTAINMENT VALUE JUST IS NOT IN THE CARDS, UNLESS YOUR DEFINIT¬\nION OF SHOWMANSHIP IS DIFFERENT THAN MINE*\nEven these semi-cccasiowal broadcasts all too often have * sad fault: they\nARE SO PACKED WITH PROPAGANDA AND MATERIAL OF INTEREST TO SUCH A LIMITED\nGROUP THAT THE EFFECTIVEMfS3 «F THE WHOLE SHOW IS LOST* WS SHOULD REMEMBER\nTHAT SOME OF THE MOST EFFECTIVE PU 31.1 Cl TV |S THAT WHICH IS PUT ACROSS IN A\nMOST UNOBTRUSIVE MANNER. IT IS FAR BETTER TO ttSNEAK IT |NW THAN IT IS TO"
}