{
  "id": "d1788-6",
  "text": "-NAEfl NEWS LETTER.. RASE 6,.MAV '* '9 3\nTHAN THAT WHICH INVITES INTO THE STUDIO AN AUTHORITY WHO READS FROM\nMANUSCRIPT. ’HERE IS NOTHING WORSE IN RADIO THAN TO SIT AND LISTEN TO SOME¬\nONE WHO IS OBVIOUSLY READING. SINCE AN EXTEMPORANEOUS LECTURE IS FAR BETTER,\nTHIS GROUP OF CLASSROOM BROADCASTERS ARE THOSE WHO KNOW THEIR SUBJECT\nMATTER SO WELL AND HAVE PRESENTED (T SO OFTEN THAT THEY SIMPLY TALK INFORM¬\nALLY, BUT DEFINITELY, TO THE CLASSROOM AUDIENCE, ^OR THE MOST PART THEY\n00 A GOOD JOB. »E USE A LAPEL MICROPHONE WHICH GIVES THE LECTURER ABSOLUTE\nFREEDOM INSOFAR AS HIS CLASS IS OONCERNEO.\nI SHALL BE THE FIRST TO AOMIT THAT OUR PROGRAMING TAKES WS IMMEDIATELY OUT\nOF THE “MASS AUOIENCEM CATEGORY, LISTENERS IN OUR AREA ARE NOT CHEATED,\nHOWEVER, FOR THEY HAVE ACCESS TO AT LEAST TWENTY-FIVE OTHER STATIONS AND\nTHEREFORE ARE NOT DENIED THE ENTERTAINMENT TYPE OF PROGRAM, CONVERSELY,\nTHOSE WHO 00 NOT FIND STA8SFACTI0N IN COMMERCIAL PROGRAMS HAVE AN OPPORTUNITY\nTO LISTEN TO WHAT WILL IS DOING, AFTER ALL, WHY SHOULDN'T THE WILL PROGRAM\nSCHEDULE BE PREDOMINANTLY EDUCATIONAL? DURING ALL ITS 75 YEARS THE Un|VER«\nsity of Illinois has never seen fit to introduce burlesque shows, vaudeville,\nETC, TO ENTICE STUDENTS TO ATTEND, ShOUCJ^N 8 T ITS RADIO STATION FOLLOW A\nLIKE PATTERN? WE FEEL IT OUR DUTY TO THE PEOPLE OF THIS STATE TO MAKE IT\nPOSSIBLE FOR THEM TO HEAR PROGRAMS THAT WILL GIVE THEM MORE THAN MERE\nENTERTAINMENT,\nAT RANDOM: Dio your engineers reao the article by A0 James c.bel, Chief\nEngineer for WILL, in the April issue of COMMUNICATIONS? Article was titled,\n“Characteristics of High Fidelity Systems,h..Herbert Scott, Director of\nExtension for the Diversity of Oklahoma for last 16 years, has entereo\nthe U„ S. Navy.Waldo Abbot, Ojrector of Broadcasting for the University\nof Michigan, has dispatched another letters his former “studes\", Waldo\nsays it really doesn't take much effort, byt Dave Owen, also of Michigan,\ninsists Waldo spent a week on the latest effort.The Wisconsin School\nof the a,r ,s in its twelfth year, with A registered enrollment of 303,"
}