{
  "id": "d558-13",
  "text": "TO s Board of Directors and Officers «*» page 2 — June 10* 1953\nAt tit© regular JCET Board meeting in Washington on Wednesday,\nlittle of significance transpired except announcement of the approval lay\nFAB of the SRSB«JCET request for §36,000 for a two-year regional T? project\nand the foxmLation of the now well*publ±cizad letter to Harold Fellows in\nwhich JCET thanked the ccsF.crcial broadcasters across the nation for their\nvery extensive contribution to and support of educational television stations\non the local levels* Th© records show forty-nin© applications in, end\nanother six or eight in the preparation stage*\nOn Thursday I spent about an hour and a half with Hr• Arthur Adana,\nPresident of the American Council on Education, • and with Hiss Eunice Parker,\nwhom he has assigned to the special ACE TV project* Dr* Adams very clearly\nanalysed the various contributions being mack* in the dsveXopeaent of educa¬\ntional television, and in his characteristically keen way pointed out the\non® neglected area* This is the function which the AGE project will perform*\n“The establishment of the Casraittee,n Dr. Afeas s.aid, \"aims principally\ntoward inducing a maximum amount of participating activity in behalf of*\neducations! television on th® part of educational organications and teacher*\nThe Council will provide for periodic stock-taking of the degree and nat^e\nof participation of tho groups involved in the development of educational\ntelevision.” Hiss Parker is doing an excellent job of collecting information\non activity in tho educational. TV field by groups and organisation© all over\nthe country and will make IMs information available on a continuing basis*\nI also had a lengthy conference with Basil Thornton, North American\nDirector of the BBC, as a prelude to ay trip to London the first of July.\nA recent communication from John Dunn reopens a subject which we shall,\nsettle at the Board meeting (exact time to ba announced later) at the MSB\nTV Seminar in Madison tho week of the 21st. That is the establishment of\nan HABB Advisoey Council composed of representatives of other organisations\ninterested in the communications field* I h&v© asked John to prepare a\nmororandum on this subject as an aid to Allan Millar* s Organisational Liaison\nCommittee and will expect him and AULsn to work on this together. The need\nfor closer cooperation between all organisations interested in the media of\nmass communication becomes more and more evident. That was the purpose of\nour sending a representative to the AETA-Speech Association of America m®t-\ning in December and of sy attending the DAVI meeting in January, and it Is\nthe purpose of our sending Earl to the University Film Producers Association\nKaoting in August* Vfo have been working on an exchange of complimentary\nmemberships with various organisations and I raceivsd yesterdsy a compli-\nmentsxy membership in the AAACE — the first of a number of such exchanges*\nVSa still need a conference of representatives of thee© various national\norganisations and HAE3 will provide a real service by taking the leadership\nin bringing about such a meeting* This t;*p® of conference carefully planned\nwould appeal to the American Council on Education and X think m might expect\nsome money ffroia them, for such & conference* John and Allan b© advised*\nX still have not had replies free a few of you on the various subjects\nraised in ay long memorandum of Hay 26. X am particularly eager to hzm\nyour reactions to the program and station problems consultation project\nwhich I have outlined*"
}