{
  "id": "d558-17",
  "text": "August 26, 1953\nMEMO TO2 NAEB Bo«rd of Directors\n5B0M: Gray don Ausmus, President\nDick Hull will officially represent NAEB at the UNESCO meeting\nscheduled In Minneapolis the middle of September* I have written\nrequesting that Harry Skornia be named a representative to the\nconference and that Si Siegel bo extended an Invitation also* I\nhave accepted an invitation*\nI have asked Si Siegel to be the NAEB representative on the\nRadio and Television Committee for the observance of United Nations\nDay, October 24* He will meet with reps of NARTB at the United\nNations Building in Hew York, September 9, for the first planning\nsession.\nThe Advisory Committee to the President of the Center (including\nDick Hull, Member ex-officio) and the Executive Committee plus Ralph\nSteetle and Bob Hudson met the first week in August for a most\nintensive study of NAEB—Center relations and to make recommendations\niAdvisory Committee only) on certain matters facing the Center0\nThis report, which represents some of the most rugged thinking that\nhas been done in our group in several years, will be sent all members\nof the Board as soon as Burton finishes the re—draft0 When you read\nit, I believe you will agree with me that it is a significant\ndocument. Credit for the excellent section on programming belongs\nin large part to Harold McCarty. There are some recommendations\nwith which you may not agree, as is my own case, and some of the\nrecommendations represent a digression from earlier decisions of the\nBoard; however, it is a document based on conditions which exist and\nupon the majority opinion of the committee* I believe you will feel\nas I do that It deserves our strongest and most enthusiastic support*\nAugust 21 and 22, Probat, Wheatley, Sohooley, and I met In\nWashington to work on programs for *53~*54» It was a real trick\ngetting Schooley away from his Chesapeake Bay vacation and getting\nWheatley away from his million dollar baby In Boston but the results\nwere worth it* Wo came up with ideas for ten to fifteen broadcast\nprojects to be tried in cooperation with existing agencies and\norganizations (with money) in subjoct matter areas deserving attention,\nand planned some cooperative broadcasts as well a3 several \"big time”\nproductions* A full report will be forthcoming.\nThe Adult Education Committee will meet in Boston, September 14,\nto summarize and close out its two year production activities*\nPaulu and I will represent the Executive Committee at the session*\nThis will mark \"finis’* to one of the most important enterprises in\nNAEB annals* The motto still remains, \"Onward to greater\naccomplishments*n"
}