{
  "id": "d558-53",
  "text": "MINUTES FOR EXECUTIVE COMMITTEE MEETING NAEB HEADQUARTERS, URBANA\nILLINOIS, NOVEMBER 17, 1953\nPresents President Ausmus, Vice President Dunn, Secretary Hunter,\nTreasurer Schooley, Executive Director Skoraia\nThe Executive Committee met to discuss problems of headquarters\nnetwork operation. The agenda prepared by Director Skcraia was the basis for\nthe discussion and deliberation0\nAgendas\n1) TV monitor study .The committee approved the engagement of a local attorney\nto draw up a contract for the next New York Monitoring Study. Six possible bidders for\nmaking the study we e recommended by the Research Committee and accepted by the\nExecutive Committee with additional bidders to be suggested by Treasurer Schooley\nand Professor We Schrausn should they have additional firms to recommend. It was agreed\nthat the time of the Study would be kept secret according to the suggestion made by\nSiegel in order to eliminate the danger of the New York stations loading the selected\nweek with unrepresentative programs. The Executive Committee approved allocation oF 1\nJ $2500 in funds for use by the NAEB Research Committee in necessary travel expenses.'\n2) Question of the deadline fer the publication of the next New York TV\nresearch study: The Committee agreed tb?.t an attempt should be made to meet a May\npublication date, on the study project for January, because the particular week in\nJanuary is to be kept secret but no deiinite publication date can be set other than the\ngeneral one of the month of May, 1954.\n3) Grants-in-aid* Skoraia to irite to producers of last ysar«s grants in aid\nprograms who are delinquent and rbquiru them to complete the series. The distribution\nof the g^ants-dn-aid program is to be rnecked with the contract in order to determine the\nproper method of distribution and the handling of the credits. Information on the\nrelease of these programs is to be seni to Siegel for promotion and publicity. The 1953\nseries should be made available for release in January, 1954. NAEB headquarters vill mail\nthe released series to the Educational TV and Radio Center with whatever evaluation of\nthe programs is available. Copy of the report to the Center covering the programs and\nthe grants-in-aid project should be seat to Bill Griffiths of the FAE. The Committee a-\nthat the film credits on TV grants-in-aid programs should read as follows,\"Pro¬\nduced by (station or organization) for the National Association for Educational\nBroadcasters under a grant from the Educational TV and Radio Center\". These credits\nwould be given at the end of the program. All new grants in aid contrasts and agree¬\nments should contain the provision that the program is to be distributed locally first\nby the producing station or organization. Skornia is to revise the contract and agree¬\nment also to include television, to e/jver periodic reports by specified dates, to set\ne Cksasletion deadline of July 1, that programs must conform to established time periods\n(one-quarter or one-S&lf hour, etc.) to include funds for publicity and promotion of the\nprogram series, and that the finds granted vdll be released on an established schedule"
}