{
  "id": "d558-55",
  "text": "3.\n9) The FAE request for information on the NAEBs Discussion of the committee\nbased upon the draft prepared by Skoraia 11-11-53.\na. (First four peges) To be condensed to one paragraph.\nb. (Page 5) To ?>e revised to a general abatement and eliminate the specific\ncharacter.\nCo (Page 6 and 7) Engineer®® salary to be set at $15,000 subject to downt\nward revision. Travel, clearical assistance, operating expenses to be\nset at $15,690 for a total of $30,000. 5% of this total should be\nallocated to the NAEB headquarters for administrative purposes. Placement\nand editori/il assistant positions should be made responsible to the NAEB\nand all references to coordination with other organizations and agencies\nshould be eliminated.SAlary of this placement position to be set at\n$4000 with office equipment, supplies and expenses set at $3000 for a\ntotal of $\"000. 5% of this toatl should be allocated to the the NAEB for\nadministrative purposes.\nd. (Page SB) This section should be eliminated from the FAE report. The\nquestion of the rental of additional space and facilities for head¬\nquarters :.s to be taken up with the Kellogg Foundation. Schooley\n/O l reported 3od#lsq. ft. of space available at an estimated annual rental\n' J of $4800. The NAEB could absorb this rental for one year if necessary.\n1 I The Committee recommended that the request be made to the Kellogg\nFoundation but that the NAEB absorb the cost for the first year if\nnecessary, okomia and headouarters to work out this problem of space\nneed and transfer of headouarters as soon as possible.\ne. (Page 8C1) Question of uniform standards of recording, editing tape,\nfilm and engineering and technical standards is to be handled by the\nNAEB Engineering Committee. Principle of self-help to be followed in\nconnection with school operated stations and new developments. Question\nof the international exchange statndards and problems should be in¬\ncluded in the request for the full-time NAEB engineering position and\nthe total engineering service package. The European trip and conference\nfor the engineer is not to be moved or included in the request.\nf. (Eliminate page 10 and first half page 11)\ng. Rewrite and revise the whole consultant service section, clarifying the\nproposal, justifying its need more effectively, and including promotion\nand publicity activities for both radio and television.\nh. (Page 14B) Eliminate this section as it stands and transfer it to the\nsection dealing with the seminar project and workshop request.\ni. (Page 15E) Revise this section on workshop and seminars to include\neight projects at $8000 each for a total of $64,000. Also include a\nstatement of the contribution made by the colleges and institutions\nwhere the workshops and seminars will be held."
}