{
  "id": "d1535-12",
  "text": "5\nCOMMERCIAL RADIO FORECAST FOR FRANCE\ni\nHenry White of International Radio, Paris, forecast a re-birth of commer¬\ncial radio in Prance in a statement early this month. He outlined a 7-station\nnetwork and declared that Post Parisian, a 60?000-watt station now operated\nby the government will probably become'private enterprise after January 1.\nNEW 0FPICE OP EDUCATION BOOKLET\nThe U. S. Office of Education-Radio Manufacturer^ Association Joint\nCommittee has now released copies of its second major study, \"School Sound\nRecording and Playback Equipment\" for school use. Purpose is to serve as a\nguide for school administrators, school station directors, and teachers in\nselecting and using recorders and playback equipment. The book, for instance,\ncompares relative merits of disc, magnetic tape, and wire recorders.\nGROWING- SKELLaC SHORTAGE THREATENS NEW DISCS\nCommerce Department officials indicate that recent sharp drops in shellac\nimports may bring about a new disc crisis if the trend continues. Both\nCommerce and State Department sources attributed the decline to the unsettled\npolitical situation in India where the U. S. gets most of its supply.\nRECORDING STUDIOS RUSH TO BEAT PETRILoA) DEADLINE\nCnristmas, 1947, will be just another working day for hundreds of musicians,\nproduction personnel, talent, and engineers in the race to record as much as\npossible before the December 31 deadline declared by Petrillo to be the end of\nAFM recording.\nThere seems to be little doubt that Mr. Petrillo means his ban to be\nliteral and indefinitely permanent. It is consistent with his previous state¬\nments and his basic attitude on the kind of competition transcribed radio music\npresents to APM musicians.\nnational association op education broadcasters folder available\nThe new folders describing the purpose, operation, and plan of N-A-E-B\nis now available. Jim Miles (WBBA, Purdue University) prepared the publication\nwhich described what N-A-E-B is , what N-a-E-B needs, what N-a-E-B. offers, and\nwho may join the organization. Membership rates according to wattage are stated\nand a listing of membership by regions is included. (Polders may be obtained\nfrom any N-A-E-B officer listed on the front page of the Newsletter.)\nWOMEN BROADCASTERS IN ILLINOIS-WISCONSIN RECEIVE UNUSUAL ADVICE\nChicago—Women broadcasters of Illinois and Wisconsin received some\nunusual advice today. A speaker at their regional meeting in Chicago told\nthem, \"Stop thinking of American women radio listeners as someone always mixing\nup a cake.\"\nGeorge Jennings, Director of the Radio Council of the Chicago Board of\nEducation, was the apeaker. He added:\n\"Use the same imagination and ingenuity required for stirring up a new\ncake, in stirring up the thinking of your listeners.\"\nRadio women of the two states were here to discuss merchandising, educa¬\ntion and agency relations in radio."
}