{
  "id": "d1535-14",
  "text": "(in\nrl\n-3-\nMAYPLCnvBR HEARING- POSTPONED TO MARCH 1\nThe FCC P°stP°ned the so-called ’’Mayflower Case Hearing” until March 1\nT:;LfdvalS0 re'sot the deadline date for the filing notice of appearances!\nrs have gone from the JTCC to a list of organizations and individuals ex¬\npressing the hope that .they would appear at the hearing and express opinions\non the question of editoralizing by broadcast licenseesover the stations\nwhich they are licensed to operate.”\nOf th\\oafe. as defined by the ICC are \"whether the expression\nitcuial opinions by broadcast station licensees\" is in the public interest,\n®~.to \"determlne the relationship between any such editorial expression and the\naffirmative obligation of the licensees\" to present fairly and equally all sides\noi controversial issues,”\ntes*i?veofah?nal As®°°latioa of Educational Broadcasters have been invited to\ntes.iiy at this .larch 1 hearing, and initial preparation of a statement is under-\nvvay y iiarold Engel, Assistant Director and Harold McCarty, Director of WHA\nuniversity of Wisconsin, Madison. *\nThe Mayflower Broadcasting Corporation, affiliated with and owned I\n• kf the Yankee Network, had applied for a renewal for WaAB (Boston).!\nThe record showed that;during 1937 and 1938, this station had j\nbroadcast the frankly editorial views of the owners. The BCC re- i\n' minded them (end thus the whole industry) that the practice would\nnot be permitted, in a decision issued in 1941. In effect this *\ndenied the broadcaster a “voice of his own” and created what has )\nbeen called the ’''common carrier” definition of radio.\n. ]ssv-es are basic ones, but sorting out the real from the alleged issues\ndlf^cult task. Mr. Justin Miller, president of the NAB, commercial trail10\no ganization, states publically his opinion that the Mayflower decision consti-\n°J oensorshiP> a flaunting of the lirst Amendment, and that radio\nX; s i6 aS frSe fS its.00asil1' newspaper, This view is not in practice\ny many within this same NAB, namely, those who feel the law, simply\ny ^ng controversy on the air to a minimum,leaves more time open for more\nprofitable business. A great deal of honest confusion exists.\n°n the othe1, hand SrouPs such as the National Association of Radio News\n{reelf.,taking Up the cudgel in defense of the first Amendment and\nithout qualification the decision was and is wrong.\nconfu“n£Skinite il''“E?IOi® EA310\" asks \"^^her in the present bedlam of\ncontused thinking,., we need more voices on the air or more clear voices?”\n-r~\nn, 84010 10 EEACH imtENCE PEOPLE must BE harnessed,\nitnroa&awja. task oi educating the people, we\nn„ TEhIT f! 1 ITti PE0GHAMS Fashioned ioe the Taste oi a small audience\n0i • •™hGH!AT ChALL3*B TO RADIO AS A SOCIAL INSTRUMENT IS THAT\nPTOPII1^™ ^-^-^6 T0 CAPT0HS ,JE> ml& Tm ATTENTION oi masses oi the\nPiOPLe SO ThAT THeY MaY Be ABLE CITIZENS OI THEIF. COUNTRY — AND OI THE 'WORLD\nAllen Miller, Director\nRocky Mountain Radio Council"
}