{
  "id": "d1535-4",
  "text": "-5-\n✓\n1TSXT YBAR 1000 FH STATIONS FOR 100 MILLION SOL LAP. S\nr'-\nFI-'LA (Frequency Modulation Assocation) announced it expects the total 3PM\ninvestment during 1948 to reach the 100-million dollar level with more than\n1000 3PM stations (both educational and commercial) in operation*\n3PMA. which acts as the liaison agency “between set manufacturers, the FCC,\nand 3PM applicants and operators are interested primarily in furthering the\ncause of a bigger and better FM radio industry in the U.S. Their Washington\nheadquarters are located in Washington.\nRADIO SURVEY AT UNIVERSITY OF ILLINOIS\nA study of urban, village, and farm radio listening by C. E. Sandage,\nProfessor of Journalism at the University of Illinois discloses:\n1. Amount of listening varies with age and sex as well as residence in\ncity, village, or farm with adults listening more than children under\n17; women listening more than men regardless of place of residence, and\nurban listeners spending more listening time on Sundays in contrast\nwith Monday through Friday habits of rural listeners.\n2. Choices of programs vary little between men end women of like age\nand occupation, but differences of choice are marked between urban,\nfarm, and village residents.\n3. Listening is to programs rather than to stations, with none of the\nfive stations measured able to claim a completely loyal audience,\n4. Relationships between the time ofday, place of residence, sex of\nlistener, and size of audience are marked*\nSandage, whose study was published in Opinion and Comment, August, 1947,\nrecorded the results of more than 330,000 quarter-hours of listening. The\nresults of the study although specifically representative of Champaign County,\nIllinois, have some general significance.\nIOWA RADIO SURVEY FOR 1947\nThe 1947 IowaRadio Survey, the tenth consecutive annual study of radio\nlistening habits in the state of Iowa has recently been released by the Central\nBroadcasting Company (NBC station WHO), Des Moines. The study conducted by\nDr. F. L. Whan, University of Wichita, Wichita, Kansas, deals with the listening\nhabits, preferences, program and station attitudes of radio listeners in one of\nthe most homogenous population areas in the U.S, It is worth study as an over-all\npicture of rural listening habits.\nAMERICAN CANCER SOCIETY DISCS\nThe American Cancer Society is preparing a series of 13 documentary programs\ndesigned to cut the rising toll of the dread disease. Partipants will be World\nTTar II veterans and Screen Star Ralph Bellamy who will handle narration. Titled,\nr,It Can Happen to You1' the 15-minutes programs will be transcribed in Hew York\nand offered for distribution in the near future."
}