{
  "id": "d1535-5",
  "text": "E-H ASSOCIATION ASKS FOB. 3-THAR LICENSES\nMA1 s Executive Director, J. IT. Bailey, says EM should he given an equal\nopportunity with the AM system. EM production has increased from a mere\ntrickle in January to two million sets annually in November.\nThe 369 Eli stations on the air now are providing service for a potential\n60-million people, Bailey says, and EM \"broadcasters must be given sufficient\nsecurity by the government to protect their investment.\nEMA sent a letter to the FCC through its counsel, Leonard Marks, pointing\nout that when the one-year license period was $et up, there were only 50 stations\non the air and stated under the Communications Acts,the FCC is authorized to\nlicense'1 stations for three years.\nLAND GRANT COLLEGE ASSOCIATION APPOINTS PAD 10 COMMITTEE\nRussel I. Thackrey, Executive Secretary of the Association of Land Grant\nColleges at 1406 G Street, Washington, D.C. announce d the new radio committee\nappointed at the annual meetings.\nPresident H. L, Bevis of Ohio State University was appointed chairman for\na one-year terra; President Charles S, Eriley of Iowa State was appointed for a\ntwo-year term, and Dean Philip Donnell, Vice President of Oklahoma A. & M.\nCollege was appointed for a three-year term.\nEach Committee member1^ school has a station either in operation or planned\nfor operation in the near future on both the EM and the AM band, e.g., Ohio\nState University (WOSU), Iowa State College (WOl), and Oklahoma A. & M. (HOAG).\nUETT YORK BOARD OF EDUCATION (WNYE.-EK)\nHew York’s Board of Education station, WUYE opened its tenth year of\nbroadcasting school programs this fall. In line with the new city school\npolicy ITTYE’ s bulletin describes for teachers the programs to be heard over\nthe entire school year, rather than for a single term.\nInstallation work has begun on a new transmitter. When this work is\ncompleted T7NYE will transmit with 10,000 watts making it one of the most power¬\nful educational EM stations in the entire country. Many schools are planning\nto acquire EM receivers during the coming year, so reception and extension\nprogram utilization will be greatly increased.\nSeven new programs on WNYS range from kindergarten story favorites to nature\nstudy, music and history programs, forums,special UN broadcasts, ahd an opera\nseries featuring Metropolitan stars.\nHARDING COLLEGE STATION ASICS FOR MORE P0TrER\nStation WHBQ,, Harding College, Searcy, Arkansas, testified before the FCC\nin behalf of the school’s application to increase power of its station (WHBQ\nMemphis) which the college purchased a year ago. Benson stated most farmers\nin the area are small cotton farmers and that improved but costly cotton culti¬\nvating and picking machinery may put them out of business.\nBenson stressed the need for a campaign of agricultural education to\nprepare farmers for these technological changes so they can undertake diversified\nfarming and continue to earn their livelihood."
}