{
  "id": "d1521-10",
  "text": "-11-\nFCC MATES STATMFHT OH POLITICAL BROADCASTS\nThe Federal Communications Commission ruled January 31 that a radio station may_\nnot censor the content of political broadcasts, even when the material may appear\nto he libelous.\nThe Commission further expressed the view that a station operator may not he held\nfinancially responsible for such libelous matter going on the air. It said\nCongress intended to forbid the operator from invoking censorship.\n’’The actual sneaker is, of course, completely liable for the contents of his\nremarks,” the Commission noted.\nTJHLS Case\nThe case at issue involved a renewal of license for radio station WHLS at Port\nHuron, Michigan. The Commission announced that it proposed to renew the WHLS\nlicense, following a two and one half year study of an instance in which the sta¬\ntion refused all political \"broadcasts. The case dates \"back of an April, 1945* city\nelection.\nA candidate for city commissioner obtained free time on WHLS to discuss a proposed.\n\"bond issue. After the broadcast, the station announced it would give equal time\nfree, as provided \"by the law, to any responsible party desiring to present con-\ntrary views. However, some persons opposing the candidate who spoke, Carl B. Muir,\nentered -private objections to some of his statements. The station management, after\nlooking over proposed scripts for future broadcast decided to refuse any addition¬\nal free or -paid time during the campaign.\nFCC Enters Case\nThe. Commission came into the case to decide whether censorship was involved. In\ntoday’s decision, the Commission said the. station had acted as a censor hut there\nwas no evidence of ’’deliberate or willful attempt to violate” the Communications\nstatute.\nFCC Opinion - Federal Authority and Libel\nThe Commission said; ”!fe are of the opinion that the -prohibition against an.y\ncensorship by licenses of •political speeches by candidates for office is .absolute,\nand no exception exists in the case of material which is either libelous or might.\ntend to involve the station in an action for damages.” However, the FCC added:\n’’The nrohibition against censorship in connection with political broadcasts ..appears.\nclearly to constitute an occupation of the field by federal authority, which..under\nthe law would relieve the licensee of responsibility for any libelous matter\nbroadcast in the course of a speech coming under section 315 (of the Communications\nAct, relating to political broadcasts), irrespective of the provisions of state\nlaw 7s"
}