{
  "id": "d1521-12",
  "text": "-13-\nDOROTHY LSFlS RESIGHS FROM FAB\nDorothy Levis, director of listener activities for the National Association of\nBroadcasters and organizer of the Association of Nomen Broadcasters formally\ntendered her resignation to Justin Miller, President of FAB. The resignation of\nMrs. Lewis was motivated by the FAB decision to close the Few York office and to\nmove her department activities to the Washington headquarters of the organization.\n- * a o # Jvbwis ) V'.n.u i cOcivcu. ci ui udt ion irom un© ixir-L\na vice president of ANB.made a statement on radio\nscoues oi America ana was mao.e\nresponsibility worth much con-\nsiderationi ,fThe task of educating listeners for\nan appreciation of the magnitude\nof our free system of broadcasting is only begun.\nRadio education, still in a\npioneer stage, offers a challenge. Radio’s role in the emancipation of the world’s\none billion illiterates staggers the imagination.\nCloser cooperation between pub-\nlie groups and broadcasters can expedite the processes.H\nCALIFORNIA LEADS THE FAT I OF IF NUMBER OP BROADCAST STATIONS\nCalifornia has more broadcasting stations than any other state in the Union, and\nTexas, according to a recent FCC report, is second. The 48 states and possessions\nhave a total of 3,119 authorizations for M, FH, and Television facilities, in¬\ncluding stations on the air, and those now being constructed,\nCalifornia has 228 and Texas 223 such authorizations. Next in order are Pennsylvan¬\nia vith 183, Few York with 178, Forth Carolina with 132, and Ohio with 128. Texas\nheads the list in standard stations with 153, followed by California with 139,\nPennsylvania vith 98, Nev York vith 89, and Forth Carolina with 86.\nCalifornia has the most FM and Television grants while Montana, Vermont, Alaska,\nand Hawaii have no FM authorizations. Eighteen states and the possessions are\nstill without Television grants. Puerto Rice has 23 standard grants, exceeding\nthe number of such authorizations in 14 states.\nThe National Association of Educational Broadcasters now registers non-commercial,\neducational stations in 25 states including 32 AM and 25 FI! stations, many of them\nin the more densely -populated areas of the U.g.\nN^A-E-B STATION NNYC T7ElDLrTES MUSIC FESTIVAL PROGRAMS\nMore than 100 special programs, including a dozen free public concerts, have been\nscheduled by NNYC for its ninth annual American '\"usic Festival, which will be held\nfrom February 13 to 22,\nBetween 50 and QO of the city’s musical organizations and sphools will participate\nin the fete, Featured music will ru^ from folk songs to symphony, including\npremieres of 30 new works by American composers. Opening concert was held in\nCarnegie Hall at 5:00 p.m, op Lincoln’s birthday and featured the 102-piece U.S.\nArmy Band. Morton Gould appeared as guest conductor for two of his own composi¬\ntions.\nOther scheduled events include.the Stnyvesapt String Quartet, at Town Hall, 3;00\np.m. on the ,16th; Stradivarius String' Quartet, at the Frick Museum, 3:00 p.m, on\nthe 15th; tfcp F.Y.U. Festival at the University Auditorium, 9:00 p.m. on the 16th;\nCantata Singers, 18th at 9:00 pTm. at Metropolitan Museum; national Association of\nConductors and Composers, Times Hall, 8;30 p,m, on the 20th; Ascap concert at Times\nHall, 3:00 p.m. on the 14th; Juilliard Schobl of Music, 8:30 pfm, on the 13th.\nTwo concerts of folk songs will be aired, one on the 15th and the other on the\n22nd,"
}