{
  "id": "d1521-16",
  "text": "-17-\nNFJr5 FROM REGION II — Regional Director - Gravdon Ausmus, UUQA, University .Alabama\n(Virginia, West Virginia, Alabama, Kentucky, Tennessee, North and South Carolina,\nGeorgia, Florida and Mississippi.\nAlabama\nThe Extension Department at the University of Alabama conducts an extensive series\nof broadcasts on education subjects, ranging from good health and good government\nto music and discussion activities. Cooperating stations include NAP I, UMFT, UGAD,\nUJBY, Wm and WEBC.\nFlorida\nN-A-B-B Station URUF, University of Florida, Gainesville, was authorized to change\nits hours of operation from part-time to unlimited.\nTennessee\nHarding College, Memphis, Tennessee, has received a conditional grant for a new\nFII broadcasting station.\nGeorgia\nN-A-E-B Station UABE-FM, Atlanta Board of Education, is proceeding‘with program\nand construction plans to activate its new operation. Dr. I. Keith Tyler recently\nadvised with Mr. Ira Jarrell, superintendent of the Atlanta school systems on these\nproblems.\nTennessee\nLeMoyne College ip Memphis has applied for a new standard station on 1400 kc with\n250 watts, unlimited time. The application is contingent on Memphis, being\ngranted a change in operating assignment,\nAlabama\nN-A-B-B station ’UJQA-FM, University of Alabama, scheduled to be on the air this\nspring under the guidance of Graydon Ausmus, director, has been supplemented by\nUAFM (low radiation station) palled \"Radip Alabama” under the direction of Leo\nMartin. The campus station |s used as a rehearsal and practice laboratory by\nthe radio teaching departmentf\n**:;<* *\nFIN’S FROM REGION III - Regional Director - Frank E. Schooley, WILL, Urbana, Illinois\n(Ohio, Michigan, Indiana? Illinois and ’Wisconsin)\nIllinois\nUniversity of Illinois (N-A-E-B member station WILL) held a communications conferen¬\nce in mid-January. This meeting on mass media problems (press, radio,films) was\nthe first session of the newly-established institute of Communications Research\n(Details elsewhere in Newsletter).\nOfoio\n\\\nDr. I. Keith Tyler, Director Institute for Education by Radio at Ohio State Univer¬\nsity (N-A-E-B member station WOSU) reports a record total of entries j,n the\nInstitute educational programs exhibit).\nPresident H. L, Bevis, Ohio’ State University, Chairman of the Land Grant College\nRadio Committee reports interest in the clear channel hearings before the FCC,\nis collecting briefs filed by all parties."
}