{
  "id": "d1521-2",
  "text": "CLEAR CHANNEL ARGUMENT (CONT.)\n-3-\nN-A-E-3 MEMBERS\nN-A-E-B with members in 24 states and Hawaii, operating 22 AM and 19 FM stations,\n•noted also that 18 of its members operate daytime only or limited time, and said\n\"The unique public service rendered bv educational and non-profit stations\" should\nbe considered in deciding the clear channel case.\" Hot opposed to clear channel\nassignments as such, N-A-E-B asked that the question of breakdowns should be decir\nded in each instance on a comparative basis, considering the program service offer¬\ned by each N-A-E-B station on’a channel in relation to the effect its nighttime\noperation would have on areas where there may be audiences now receiving service\nfrom dominant stations.\nCC3S and Regional Briefs\nThe two networks (NBC and CBS) which have affiliation with a majority of the clear\nchannels reiterated their request for the status quo• The present clear channel\nstation operators (CCBS) presented the same plan they promoted last year—that the\nFCC provide for a minimum of 20 750,000 watt clears around the country with 16\nmembers of CCBS and 4 others; their brief was by Lewis Caldwell. The Regional\nBroadcasters Committee (Attorney Paul Spearman) charged that present clear channel\noperation results in \"overlapping and wasteful duplication of secondary service\nareas\" and insisted that 1-A clear channels be broken up to provide for two or more\nstations on each such frequency. They further charged that many \"clear\" stations\nhave turned over most of their night programming to the networks.\nSurprise Testimony\nSurprise testimony came from clear ..channel atadLioii.JHLEA.*-. Pittsburgh (operated by\nUestinghouse) and a member of CCBS, who backed away from the group plan and said\nthat super-powered static qs\"will not solve the issue involved.\" Thus they essen¬\ntially assume the network \"status quo\" position.\nHew Commission Members\nOnly 2 of the present FCC Commissioners have been members of the Commission through\nthe entire course of the clear channel testimony—Paul ^alker and Clifford Burr.\nRosel Hyde has heard all of the testimony through the past year. Hew to the case\nofficially, and now occupied with study of the record, are Wayne Coy, Chairman;\nR. F. Jones, George Sterling, and E; M. T,Tebster.\n... SIGNIFICANCE\nThe N-A-E-B stations, which are party to the clear channel hearings, merely typify\nin a particular instance, the need to preserve, protect and expand all educational\ntechnical radio facilities to reach and serve, daytime and nighttime, as large an\naudience of men, women and children as possible. Hearly one-third of the radio\nlisteners in the U. S, are not receiving or hearing the kind of programsthey need\nand want. Commercial broadcasters, serving the other two-thirds of American listen¬\ners are providing, for the most part, the kiqd and type of programs which are\nwanted. Furthermore the pattern and nature of their programs are to a large extent\ndictated by economic necessity..Hith them we have no quarrel. Our opportunity,\nour challenge, and our duty is to serve that other one-third—to provide with all\nthe skills and resources at our command through adequate facilities—THE MAJORITY\nOF THAT RADIO MINORITY NON ONLY SERVED IN PART. HE DO NOT UANT AND MILL NOT\nACHIEVE THE LARGEST AUDIENCE IN THE COUNTRY—BUT T7E DO ,TANT A MAJOR PORTION OF\nTHE AUDIENCE WE SET OUT TO SERVE. THIS MEANS THOUSANDS UPON THOUSANDS OF LISTEN¬\nERS, NOT SCORES AND HUNDREDS."
}