{
  "id": "d1521-21",
  "text": "-22-\nFEDERAL.COMMUNICATIONS COMMISSION\nJanuary 10, 1948 (Educational) February 2, 1948\n-V ' NEV/S—APPLICATIONS—ACTIONS\nEnd of STA*s for AM Stations Proposed\nThe Commission proposed to change its rules so as to abolish special temporary\nauthorizations for standard broadcast stations, effective April 15, 1948. \"STA’s\"\nas they are known in brief, developed when AM stations were the only broadcast\nmedia and few daytime or limited time stations were in existence. Today the grow¬\ning number of authorizations for operation in off hours is having a detrimental\neffect on regular nighttime broadcast service in many areas. Some requests are so\nrecurring as to constitute a series of broadcasts beyond the hours for which the\nstations are licensed. The Commission sees no further need for such STA’s in view\nof the opportunities for full-time FM operation, especially since many of the AM\nstations concerned have FM authorizations. \"Diligent efforts toward the early\nestablishment of FM service,\" says the Commission, \"will more than adequately\nsatisfy public needs\" in this respect. The Commission proposes to change Section\n1.324 of its rules accordingly. Written comments from persons who may be opposed\nwill be received by the Commission on or before February 28.\nAMPLITUDE MODULATION APPLICATIONS\n850 KC - Antenna Measurement\nKFUO - Evangelical Lutheran Synod of Missouri, Ohio, and other states, Clayton, Mo.\nAuthority to determine operating power by direct measurement of antenna power.\n770 KC - Modification.Construction,Permit\nWCAL - St, Olaf College. Northfield, Minn. - Modification of construction permit\n(BP-5919, as modified, which authorized installation of new transmitter) for\nextension of completion date,\n1250 KC - Transmitter Change\nKTW - The First Presbyterian Church of Seattle, Washington. Seattle. Wash. -\nConstruction permit to make changes in transmitting equipment.\nAPPLICATIONS (FREQUENCY MODULATION) COLLEGE AND UNIVERSITY\nModification Construction Permit\nKOKH - The Board of Education of the City of Oklahoma City, State of Oklahoma,\nOklahoma City, Okla, - Modification of construction permit (B3-PED-76 as modified)\nwhich authorized a new noncommercial educational broadcast station for extension\nof completion date.\nModification Constructicn Permit\nKOKH - The Board of Education of the City of Oklahoma City. State of Oklahoma,\nOklahoma City, Okla. - Modification of construction permit (B3-PED-76 as modified)\nwhich authorized a new noncommercial educational broadcast station to specify studio\nlocation as Classen High School, 1800 N. Ellison, Oklahoma City, Okla.; change\ntransmitter site to Classen High School, 1800 N, Ellison, Oklahoma City, Okla.;\nmake changes in antenna system and change commencement and completion dates."
}