{
  "id": "d1521-3",
  "text": "-4-\nFF3RUARY CLIP-SHEET\nRadio industry representatives opened the new year with a recommendation to the\nWages and Hours Administrator that all station staff announcers be considered\n\"as professionals1' under the Fair Labcr Standards Act.\n******\nThe U. S, Court of Appeals says it has no authority to act on a complaint by\nHearst Radio, Inc,,—owner of UBAL, Baltimore—against statements in the 1S46\n\"Blue Book\" of the FCC. Hearst maintained the FCC public service document exposed\nit to \"public shame.\"\n******\nHew labels for new facilities were decreed by the FCC. All television and FM\nstations are now to have six-letter designations. The letters \"FM\" or \"TV\" will\nbe put at the end of the conventional 4-letter station designations,\n* *****\nThe FM Association declares new stations will go on the air during 1948 at the\nrate of 50 per month. How operating are 380 FM stations; 630 others are authori¬\nzed for construction within a year. Activation of all applications will make FM\navailable to 80^ of the population.\n******\nA Detroit station (WJ) estimates that since 1938 his station has paid more than\n8115,000 for music which was never used; the money was paid at the rate of $5.00\nper hour for many hours ip which musicians did not play.\n******\nNBC president, Niles Trammel, told a Senate Interstate & Foreign Commerce Committee\nof a new radio communication system (Ultrafax) which can send one million words\nper minute.\n******\nAFM Union chief Petrillo, as a follow-up to its lift of the band on FM music\nprogram duplication,gave the Continental (FM) Network permission to arrange\nprograms of live music,\n******\nThe National Association of Broadcasters asked the FCC for proceedings to determine\nwhat would constitute the most effective use of the frequency 540 kilocycles in\nthe United States. Nations at the Havana Conference Recommended wider use of\nthis band.\n******\nWestern Union contemplated expansion of its radio relay system may result in addi¬\ntional television network facilities. The company is building the system, using\nradio beams, instead of wires or cables, primarily for its own use; it is, however,\nalso installing television relays on some tower units.\n* *****\nEdwin Armstrong, inventor of FM, charges again that the FCC has made a major\nblunder in assigning FM broadcasting to the 100 megacycle band. Congress was\nurged to assign FM broadcasting to the 50 megacycle band, Armstrong says the\nefficiency of the system has been reduced by the change, the work of 5 years in\nbuilding up EM destroyed,"
}