{
  "id": "d1521-5",
  "text": "MAJOR ARMSTRONG CHARGES FCC ¥ITH MAJOR BLUNDER\nMajor Edwin Armstrong, professor of electrical engineering at Columbia University,\ncharges that the Federal Communications Commission made a major blunder in assign¬\ning FM broadcasting to the 100 megacycles band. He urged Congress to assign FM\nbroadcasting to the 50 megacycle band. Armstrong charged \"As a result of the\nCommission’s blunder, the work of 5 years in building un FM has been largely destroy¬\ned the efficiency of the system has been reduced, and its introduction to the\npublic generally has been retarded by a period of from 2 to 3 years.\nDETROIT SUNDAY EVENING HOUR BECOMES SUSTAINING-\nThe American Broadcasting Company stated that the Sunday night hour’s broadcast\nby the Detroit Symphony Orchestra will become a sustaining program after February\n1, ABC says it will continue the program each evening on a sustaining basis, and\nthat it will be called the Detroit Symphony Orchestra Program instead of the\nDetroit Symphony’s Sunday Evening Hour.\nNATIONAL CONFERENCE OF CHRISTIANS AFP JBrrS MARE RADIO AUARDS\nCitations to radio networks and stations for contributions to understanding and\nrespect among the American people were announced this month by Dr. Everett Clinchy,\nconference president. This is the fourth year such awards have been made.\nThe awards were made to CBS for the ’’Liberty Road Series” on the CBS School of\nthe Air; to Mutual for its program, \"Fury of Man\" on Exploring the Unknown Series\";\nto the ABC for\"The Good Samaritan\" in the \"Greatest Story Ever Told.\"\nOther awards were made to the Institute for Democratic Education for the tran¬\nscribed series, \"Lest TTe Forget;” to UNETf for \"Little Songs on Big Subjects;\" to\nUQ^R for the \"Hew York Times Yodth Forum,\" both in New York. Awards went to UCCO,\nMinneapolis for the series, \"Neither Free Nor Equal;\" to WKY* Oklahoma City for\nthe series, \"Creed, Color and Cooperation;\" to ICSFO, San Francisco for consistent\nattention to inter-group relations; and to VffiBM, Chicago for the series, \"Democracy\nUSA.\"\nA MILLION UORDS A MINUTE FOR THE EYE, NOT TEE EAR\nNBC president Niles Trammel told Congress about a new radio communication system\n(uitrafax) which sends a million printed words per minute. He stated in his\nopinion that the newspapers of the future may be delivered by radio. Each printed\npage is treated as a picture and flashed in rapid succession. At the receiving end,\npages are reproduced by new high-speech photographic processes for quick delivery.\nNiles, testifying in favor of removal of government controls on broadcasting,thinks\npending bill the Senate Interstate and Foreign Commerce Committee is considering,\n\"would put the shadow of Nazi censorship behind ever?/ American broadcaster.\"\nThis statement was typical of many statements made in support of eliminating\nall FCC controls in recent hearings. The implication Niles made—that radio broad¬\ncasters will become publishers with the use of Ultrafax—is another example of\nNational Association of Broadcaster’s effort to define newspaper and radio as\nsimilar media which should be treated in the same way by the government."
}