{
  "id": "d1521-8",
  "text": "-9-\nVQICF OF AMERICA BILL ^IGFBD BY PRESIDENT\nIn January after passage of \"both houses of Congress, President Truman signed a\nbill designed to provide a sound legislative authority for the international\n\"broadcasting operations within the State Department.\nSenator Smith Calls for More Dollars\nA similar but not identical bill was passed by the House last year. Senator\nAlexander Smith reporting the bill for the Foreign Relations Committee had high\npraise for the work done in the past by the OWl and currently by the international\nbroadcast divisions of the State Department. More support is needed, Smith said.\nBritian, he pointed out, is spending more than three times as much as the U.S,\non shortwave broadcasting, and the Russians at least two or three times as much\nas the British. (Current U.S. budget is approximately 12 million dollars).\nSmith stressed the Committee’s feeling that it is important for the State Depart-\nment to use \"private American agencies (in this task) as much as possible.\"\nMore Information\nA greatly expanded information and education program, whose object is to make\nthe United States and its people better known and more familiar to the people in\nother countries is expected, now that the \"Voice of America\" bill has been signed,\naccording to Rep. Karl Mundt, Republican of South Dakota, sponsor of the legis¬\nlation.\nShortly after the President signed the bill the purpose of the legislation was\nexplained to listeners in all parts of Europe and South America by Rep, Mundt,\nand his co-sponsor, Sen. Alexander Smith, R. of Hew Jersey, over WRUL, shortwave\nstation with transmitters located in Boston, and operated by the World Vide\nBroadcasting Foundation.\nLauds Private Organizations\nRep. Mundt pointed out that private enterprise organizations, such as the World\nWide Broadcasting Foundation, which have proved themselves an excellent means\nfor carrying out the international good-will building envisaged by the \"Voice of\nAmerica\" bill probably will receive assistance from funds provided in the Act as\nan independent agency,\n\"In this Act,\" Rep, Mundt explained, \"it is emphasized all the way through that\nas far as possible, private organizations and facilities such as WRTJL, existing\neducational foundations and others, shall be incorporated in this work. So far as\nthe government can stimulate cooperation from these private agencies, the govern¬\nment itself will withdraw because we want to encourage the private initiative in\nthe way Americans do things in this entire enterprise.\"\nCongratulates ff-A-S-3 Station WRUL\nRep, Mundt congratulated Walter S. Lemmon, president of the World Wide Broadcast¬\ning Foundation, who acted as moderator on the international broadcast, for the\nwork which WRUL has done in the past."
}