{
  "id": "d1867-11",
  "text": "AMERICAN HISTORY IN SONG\nGrades 4-8 Thursdays, 1:30-1:45\nHere are the stories of men who have made the history of our land\ntold simply and interestingly for children in the intermediate grades.\nEach program pictures an important personality in American history,\nusing appropriate music and song to illustrate. These stories with\nsong are designed to highlight the classroom experiences of children\nin the early study of history. Miss Roberta Connally will present\nthis series.\nSCHEDULE\nNovember\nSeptember\n19 Christopher Columbus\n26 The Indians\nOctober\n3 William Penn\n10 Betsy Ross and Our Flag\n17 George Washington\n24 No Broadcast (Teachers' Convention)\n31 Abraham Lincoln\n7 Robert Fulton\n14 Alexander Graham Bell\n21 The First Thanksgiving Day\n28 No Broadcast (Thanksgiving)\nDecember\n5 Thomas A. Edison\n12 The Liberty Bell\nTO TEACHERS AND PRINCIPALS\nBecause teachers have been so anxious to learn how to use school\nbroadcasts more effectively, we have prepared manuals for these\ncourses with teaching aids, possible classroom activities, some draw¬\nings, and descriptions of the material used in the broadcast. Be sure\nto use the order blank on the last page of this bulletin for requesting\nteacher's manuals for any or all courses. Most of the courses de¬\nscribed in this bulletin will be offered again in the spring term, from\nJanuary 27 to April 25, 1947, even though spring programs may not be\nlisted. All courses except \"Books Bring Adventure,\" \"American His¬\ntory in Song,\" and \"Great Men of Music\" will be on the air in the\nspring term.\nWe would like to call your attention to other educational programs\nheard on WBAA which may be of interest to your pupils and to you.\nAll current programs are listed on pages eight and nine. Of particular\ninterest is \"Following Congress,\" a 30-minute dramatization of recent\ncongressional debate taken from the Congressional Record. Also,\nthere will be a series of six programs for children presented by the\nLafayette Chapter of the Indianapolis Symphony Society in October\nand November. They will deal with symphony music and music ap¬\npreciation! In early December, at the beginning of the Metropolitan\nOpera season, Vassie Darnell will present \"Memoirs of the Opera\"\neach Friday afternoon. Each program will feature operatic music and\ncomment on the opera next to be presented on the air by The Met in\nNew York.\n— 12 —"
}