{
  "id": "d1310-2",
  "text": "NAEB NEWS LETTER*..Page 3......September i, 1942\nENGEL VISITS KOAC and KWSC\nNAEB President Harold a, Engel took advantage or his West Coast\nTEACHING ASSIGNMENT THIS SUMMER TO VISIT MEMBER STATIONS IN OREGON\nand Washington. Summarizing his visits he reports:\nKOAC, OREGON STATE COLLEGE, CORVALLIS, OREGON. - With Dean V, V.\nCaldwell, who is directing the progress or the station in addition\nto his duties with the General Extension Division., I visited KCAG\non june 26 and 27. The station had just completed tests on its new\n5 KW transmitter with its new vertical radiator located several miles\nnorth or Corvallis. It is a modern and complete - as modern and complete\na transmitter set-up as a station could ask FOR.\nAt the studios Mrs. Zelta Rodenwald, James Morris and 8urton Hutton\nWERE CARRYING THE BRUNT OF THE PROGRAMS IN THE SUMMER INTERIM. The\nSTATIONWWAS OPERATING ON A 10—TO-10 SCHEDULE OF TWELVE HOURS DAILY.\nThe KOAC studios on the University or Oregon campus at Eugene are\nSUITABLE FOR LIMITED USE AND REPRESENT AT POTENTIALITY WHICH IT SEEMS\nSHOULD BE FURTHER DEVELOPED IF THE TALENT OF THE INSTITUTION IS TO BE\nUSES TO THE FULLEST MEASURE * A DIRECT LINE CONNECTS THE (CENTER IN\nEugene with the station at Corvallis forty miles away. There is a\nCLOSE CONNECTION BETWEEN THE SPEECH DEPARTMENT AND THE RADIO ACTIVITY\nON THE CAMPUS.\nKWSC, WASHINGTON STATE COLLEGE, PULLMAN, WASHINGTON ~ On July 16 I\nSTOPPED AT THE CAMPUS IN PULLMAN TO MEET THE K‘S0 WORKERS AND SEE THE\nstudios. .Manager Kenneth Yeend, chief operator Pendleton and a gracious\nsecretary were on hand to show me the station. Allen Miller was away\non vacation at the time. The stations program schedule listed twleve\nHOURS DAILY AND REPRESENTED MORE OF A LOAD THAN a LIMITED STAFF COULD\nBE EXPECTED TO CARRY. D|RECTOR YeenD, SN ADDITION TO STATION OPERATION,\nWAS TEACHING A SUMMER SESSION RADIO CLASS IN A STUDIO-CLASS ROOM\nADJACENT TO THE STATION CONTROL ROOM.\nThe KWSC transmitter is housed in a separate building on the edge of\nTHE CAMPUS. The ANTENNA MAST IS NEARBY. The COLLEGE IS LOCATED ON THE\nTOP OF A HILL OVERLOOKING THE CITY, SO THE ANTENNA IS ELEVATED WELL ABOVE\nTHE SURROUNDING WHEAT LANDS WHICH BLANKET THE AREA. The TRANSMITTER\nIS A CREDIT TO THE STATIONS ENGINEERS, REGULAR AS WELL AS STUDENT,\nFOR THEY HAVE, UNDER CERTAIN PHYSICAL DISADVANTAGES, COME OUT WITH\nAN EFFECICENT SET-UP.\nWAR CONTRIBUTIONS OF W H A\nh.,.In A TYPICAL WEEK (WEEK ENDING AUGUST I,1942) 80 WAR-EFFORT\nPROGRAMS TOTALLING 20j* HOURS WERE BROADCAST. »HIS DID NOT INCLUDE\nSCORES OF SPOT ANNOUNCEMENTS AND GENERAL PROGRAMS IN WHICH WAR\nINFORMATION AND APPEALS WERE INCORPORATED.\n“These programs are planned for people of all ages, from children\nAGED FOUR TO ADULTS IN THE GENERAL AUDIENCE/ THEY ARE DESIGNED TO\nBUILD MORALE AND FIGHTING SPIRIT, TO DlfREGT CIVILIAN PARTICIPATION,\nTO SEEL WAR BONDS, AND TO PROMOTE UNDERSTANDING OF THE WAR ISSUES....15"
}