{
  "id": "d1310-3",
  "text": "NAEB Personnel Service\nPOSITIONS AVAILABLE.October 1966\n(For information, write Miss Yasmine Mirza, Personnel Service, at\nthe NAEB in Washington. In order to be considered through these\nchannels, the reader must be an Individual Member of the NAEB,\nwith credentials on file with the NAEB Personnel Service. Non-mem¬\nbers can save time by sending the $15 annual dues and $15 place¬\nment registration fee at the time of inquiry.)\nOct I Director of Educational Television to serve as a Canadian university's senior\nauthority on ETV. This dynamic, growing university is developing CCTV fa¬\ncilities, in addition to programing for adult audience off-campus. Candidate\nmust have record of outstanding achievement in educational television, in¬\ncluding past executive responsibility. Consideration will also be given to\ncandidates unusually experienced in documentary film production, educational\ntelevision production, or with audio-visual education background. Salary up\nto $15,000.\nOct 2 Executive Producer-Director for state ETV network. Candidate must have ex¬\nperience producing and directing instructional television programs. Work con¬\nsists mostly of instructional and documentary programs, both TV (pre-recorded)\nand film. Minimum qualifications include BA degree plus three years expe¬\nrience. Salary $8,000 minimum. _ _ .\nOct 3 Chief Engineer for Big Ten University. Position entails supervision of technical\noperation, maintenance and periodic updating of television origination, re¬\ncording and closed circuit transmission equipment; supervision of six engi¬\nneers and four cameramen pius student assistants; planning and estimating\nfor expansion and improvement of production and distribution systems; and\ninnovation in the development of new instructional uses of television. CCTV\non this major university campus is a major instructional strategy and will con¬\ntinue to grow. Salary and benefits commensurate with ability and experience.\nOct 4 Producer-Director for minimum two year assignment in overseas ETV. Prefer\ncandidates with BA degree plus production experience in ETV. Excellent bene¬\nfits, good living conditions. Salary $7,500.\nOct 5 Head of campus CCTV system—produce and direct telecourses and enrich¬\nment of materials; engender faculty enthusiasm for teaching by television;\nteach studio and control room production classes; plan and direct video-tape\nprograming and tie-in with dial-access system; work as creative team member\nin Educational Services' administrative unit which consists (in addition to TV)\nof audio-visual resources, library, etc.; plan TV and electronics distribution\nportion of new Communications Center building; must have MA or Ph.D.;\nsalary dependent on number of years experience and degrees held.\nUS Army Aviation School in the Southeast has the following openings;\nOct 6 Television Production Specialist—to direct ETV productions and assist in all\nphases of TV production development to include the setting of lights and TV\nscript research. Minimum one year experience in educational and/or com¬\nmercial broadcasting. MA (or close) preferred, BA degree acceptable. Ap¬\nproximate starting salary $7,700. , .\nOct 7 Writer (Television)—to develop and write television scripts on Aviation or¬\niented subjects from various source inputs such as teaching lesson-plans, tech-\nnical manuals and personal interviews. Minimum one year experience in edu¬\ncational and/or commercial broadcasting. MA (or close) preferred, BA de¬\ngree acceptable. Approximate starting salary $7,700.\nOct 8 Television Studio Assistant. Camera operation, lighting, etc. Excellent oppor¬\ntunity for recent Radio-TV graduate looking for experience with chance for\nfuture advancement to Producer-Director, Immediate opening. Salary $5,000-\n$5,500. . ,\nOct 9 Television Technical Specialist for new CCTV system; experience with quad¬\nrature video tape recorder, RF transmission system; audio-visual maintenance.\nPrefer First Class Radio-Telephone license. Salary dependent upon qualifica¬\ntions.\nAVAILABLE\nImproving Instructional Television, Pro¬\nceedings of the Third Annual Instructional\nTelevision Conference—a joint project of\nthe NAEB’s Instructional Division and the\nDivision of Communications Services, Uni¬\nversity of Miami. Contributors include Dr.\nGeorge E. Bair, educational director, South\nCarolina ETV network; Dr. Lois V. Edin-\nger, president, National Education Associa¬\ntion; Dr. Warren F. Seibert, head, instruc¬\ntional media research unit, Purdue Univer¬\nsity. Some current issues explored: “The\nAmerican Position in World ITV,” “In¬\nstructional Values in Adult Education by\nTelevision,” “An Educator Challenges In¬\nstructional Television.” $2 per copy, 50c\nfor any two individual sections. Write\nNAEB, 1346 Connecticut Avenue, N. W.,\nWashington, D. C. 20036.\nThe Journal of Creative Behavior, new\nquarterly published by Creative Education\nFoundation, through the office of the Cre¬\native Problem-Solving Institute, State Uni¬\nversity of New York. Includes bibliography,\nresearch abstracts, book reviews, confer¬\nence and project reports. First issue will\nbe out in December. $8, four issues. Write\nE. A. Brunelle, editor, 92 Hayes Hall, State\nUniversity of New York, Buffalo, N. Y.\n14214.\nJournalism Monographs, No. I, August,\n1966, published by the Association for Edu¬\ncation in Journalism. A compilation of\nfive papers by Walter Emery on broadcast¬\ning systems in Belgium, The Netherlands,\nPortugal, Hungary and Yugoslavia. $3 per\nyear. Write managing editor, Professor C.\nRichard Kind, School of Communication,\nUniversity of Texas, Austin, Texas 78712.\n1966 Elementary Teachers Guide to Free\nCurriculum Materials, $8.75 per copy. Re¬\nprints of piece included called “Effective\nLearning and Teaching Demands a Wide\nVariety of Materials,” by Dr. John Guy\nFowlkes is free on request from publisher—\nEducators Progress Service, Randolph, Wis¬\nconsin 53956.\nGuide to U. S. Organisations in World\nAffairs, summarizes aims, activities and\nservices of 403 voluntary agencies, reports\nviewpoints on subjects ranging from Afri¬\nca to Viet Nam. Also provides listing of\norganization’s officers, size of staff, mem¬\nbership information. $1 per copy. Write\nForeign Policy Association, 345 East 46\nStreet. N. Y., N. Y. 10017.\nMagazines and records are available at\ncourtesy rates, savings up to 50% for edu¬\ncators and college students. Ask for Educa¬\ntor’s Magazine Guide and courtesy cards.\nEducational Subscription Service, S. Point\nPlaza, Lansing, Michigan 48910.\nFilms\nReturns from Space, reports on applica¬\ntions of space age technology. For example,\na portable oscilloscope, developed for the\nman-in-space program, is now finding ex¬\ntensive use in medicine. Free. 28 minutes/\ncolor. National Aeronautics and Space Ad¬\nministration, Code FE, Washington, D. C.\n20546. Phone ac 202 962-2516.\nCandid Expose of Offenders\nThe NET sponsored half-hour program\ncalled “The Sexual Offender: Safe to be\nat Large?” has received good reviews from\ncritics for its effort to dispel the popular\nmyth that molesters “look evil,” and for\nbringing to public attention a subject that\nis taboo. The show centers on a group\ntherapy session at a mental institution near\nTacoma, revealing patients—as deeply dis¬\nturbed by their uncontrollable behavior.\nIt is implied that offenders can undergo a\nrelearning process, perhaps be cured of\ncriminally deviant behavior. KWSC, Wash¬\nington State University’s ETV produced\nthe program.\nKUON ON THE MOVE\nKUON, Channel 12, University of Ne¬\nbraska, has acquired a $184,000 mobile\ntele-production studio, which will extend\nprograming to seven stations, covering all\nof Nebraska, parts of Kansas, Iowa, South\nDakota, Wyoming, Missouri and Colorado.\nNinety documentaries are scheduled for\nproduction on-location: 30 for Project Head\nStart, a 30-series history of Nebraska, 30\ndealing with handicapped and gifted chil¬\ndren. Later on the van will be utilized for\non-the-spot telecasts of state and local\nhappenings.\n4\nNEWSLETTER"
}