{
  "id": "d683-114",
  "text": "OPENING HEARINGS ON H. R. 6736\nTHE PUBLIC TELEVISION ACT OF 1967\nJuly 11, 1967\nThe urgency of supplying specific and accurate financial cost projections\nfor the proposed Corporation for Public Television was repeatedly stated today\nby members of the House Interstate and Foreign Commerce Committee who\nheard testimony from John W. Gardner, Secretary of Health Education and\nWelfare on behalf of the Public Television Act of 1967. Secretary Gardner was\nthe only witness to appear before the Committee on the initial day of hearings\nwhich are scheduled to run through July 21. He was accompanied by Dean W.\nCoston, HEW Deputy Under Secretary and Paul A. Miller, Assistant Secretary\nfor Education and Ralph K. Huitt, Assistant Secretary for Legislation.\nCommittee Chairman Harley O. Staggers (D-W. Va. ) made it clear that\nthe proposed legislation would not exceed a three year authorization. The ETV\nFacilities Act, which expired at the end of June, covered a 5-year span. The\nthree-year appropriation will give the next Congress an opportunity to review\nthe progress of educational radio and television and act as it sees fit, Rep.\nStaggers stated.\nSecretary Gardner praised the Committee for its recommendations to\npass the Educational Television Facilities Act of 1962. \"Hindsight, which al¬\nways possesses 20-20 vision, reveals the wisdom of Congress' actions in\npassing that legislation\", Mr. Gardner said.\n\"Today, the circumstances for approval of this bill are no less timely.\nWithout your approval of this proposal, the facilities made possible by previous\naction will be incomplete monuments to a great hope. \"\nRep. Torbert Macdonald (D. -Mass. ), chairman of the Subcommittee on\nCommunications and Power, and Rep. William Springer (R. -Ill. ) chided Sec.\nGardner for his lack of information on the total projected cost for the operation\nof the Corporation for Public Television. Rep. Macdonald advised the witness\nthat \"you should have the answers to the costs of this program. I don't know why\nyou don't have those figures right now. \" \"This is a good program, \" Rep.\nMacdonald said, \"but how is it going to work? \" Secretary Gardner will pro¬\nvide in writing the full House Committee with these cost projections soon."
}