{
  "id": "d683-13",
  "text": "- 2 -\n1. An important distinction exists between an inter¬\nconnected national program \"distribution” system and a \"network”\nsystem. \"Distribution” involves an interconnection system which\ndelivers programs unrelated to scheduling and unidentified as\nemanating from a common source. The local station so intercon¬\nnected selects that programming it chooses to run, tapes it for\nconvenient scheduling, and rejects whatever it wishes. A \"network”,\non the other hand, is an identifiable entity and generally inter¬\nconnects stations for simultaneous multiple broadcasts. Section\n390 (a) (3) of S. 1160 prohibits the Corporation from owning or\noperating a network.\n2. It is essential to the full development of a viable\nnoncommercial educational nationwide service that educational\nstations, both television and radio, have access to a \"network\"\nservice, as defined above. Two such networks — NET and HER —\nexist today, though lamentably underfinanced. These networks\nwere specifically created to meet the needs of local stations for\na regular supply of qualify programming. Section 396 (a) of\nS. 1160 declares that the general welfare would be encouraged by\neducational broadcast service not only \"in particular localities\"\nbut \"throughout the United States\", and encourages a \"national\npolicy\" which would make such service \"available to all the citi¬\nzens of the United States\". The corporate purposes outlined in\nSection 396 (g) include assistance for \"one or more systems of\nnoncommercial educational television or radio broadcast stations\nthroughout the United States.\" At least three separate sections\nof the bill (Sections 396 (a) (2), (4), and (g) (1) (A) ) emphasize\nthe desirability of diverse programming sources. There is thus\nample provision in S. 1160 for the Corporation to foster such a\nsystem of networks, be they the two mentioned above or others.\n3. Interconnection, whether for \"distribution” or for\n\"network\" purposes, raises potentially delicate program decision¬\nmaking problems. At some juncture, a decision must be made re¬\ngarding the choice of product to be placed in the system, if only\nbecause of capacity limits. In many instances program content\nwill be a significant decisional factor. For these reasons, the\nNAEB strongly favors the second and third options in the above-\nquoted statement of Dr. Killian. More specifically, the NAEB\nbelieves that the Corporation would best serve its own interests\nas well as those of educational broadcasting by exercising \"its\ninterconnection responsibility by special contractual arrangements.\"\nThe complexity of operational needs, the urgency for a regular pro¬\ngram service of high quality, and the desirability of scheduled in¬\nterconnection from the viewpoint of the local station, all require\nday-to-day decisions that may best be made by other experienced\norganizations under specific contracts. Likewise, the NAEB be¬\nlieves that a mutual authority, including representatives of the"
}