{
  "id": "d683-84",
  "text": "-3-\nSec. 396(e)(1).\nSeems entirely too restricting insofar as \"other compensation\" which\nwould deny some very distinguished officers of the corporation such\nthings as royalties and consultation fees. A strong conflict of interest\nclause ought to be used but it should not go so far as to deny all other\nforms of compensation. We note in this Section also that the officers\nof the Corporation serve at the pleasure of the Board whereas good\nadministrative procedure calls for the officers to serve at the pleasure\nof the President and the President, of course, serves at the pleasure\nof the Board. (Reference: the Carnegie Report, it shows 6 executives\nas officers of the Board and here they plus the Chairman and the Vice\nChairman would serve under Board appointment rather than presidential\nappointment. We don't agree.)\nSec. 396(e)(2)\nSeems ordinary but we should take the opportunity to endorse this in\nstrong language - that no political test or qualification shall be used,\netc. We should make similar emphasis on (f)(3).\n\"Purposes and Activities of the Corporation\"\nSec. 396(g)(1).\nWe of course endorse.\nSec. 396(1)(B).\nRaises a major question regarding exclusivity arrangements held by\nNET. The paragraph presumably would allow interconnection systems\nto go to all educational TV and Radio stations as distinct from the fact\nthat NET demands exclusivity in each area at this point. We can support\nthe bill's position, ignore it, or seek a modification in it which would allow\nthe systems themselves to determine those who may be able to receive\ntheir programs. We also note that it speaks of a system where subsequent\nparagraphs speak of one or more systems. We think that it's important to\ninsert \"one or more systems\" in line 13 of B to make this consistent with\nthe other language in the bill as well as previous statements by ETS.\nSec. 296(C).\nIs more permissive than B. C deals with station systems rather than\ninterconnection systems. NET at present generally exists as a system\nof stations and again the exclusivity point must be raised. NET could be\nexclusive in the distribution of tape under (C) but could not be exclusive\nunder the interconnection systems approvable under (B). Again we think\nthey must be consistent to begin with and second we must face how we\nfeel about this in policy terms.\nSec. 396(D).\nIt's been suggested that other words be added to clarify \"or other\nactivities\". Such additional words might be \"including such as distri¬\nbution use or selection of programs\"."
}