{
  "id": "d683-85",
  "text": "-4-\n5ec. 39C(2)(A).\nIf we carry out the recommendations of our stations we mean to see that the\nCorporation is \"nonoperational\". This min our dpinion, deletion of\nthe word \"contracts\" in all subsequent places in this Title, including\n(b) and (e).\nSec. 396(B).\nAgain the word \"systems\" should be added to make (B) parallel with (B) on\nthe previous page.\nSec. 396(C).\nWe believe (C) includes equipment necessary for the production of programs\nby stations as well as for the operation of those stations. (Carnegie appears\nto be quite specific on this in its report. V/e may also want to put in our\ndefinition of the usual distinction between operation of a station and specific\nprogram production. )\nSec. 396(D).\nWe would take the Corporation out of the operational aspect here by in¬\nserting \"to establish and maintain by means of grants a library, etc. \"\nWe also note that library must be made plural because more than one\nalready exists.\nSec. 396(E).\nBesides deleting contract, we would want to be sure that stations and sys¬\ntems can lease facilities from such organizations as AT&T and that there¬\nfore these words should be deleted: \"public or nonprofit private\" thereby\neavmg the door open to any agency from whom we wish to lease equipment.\nIn the same paragraph in order that such facilities be used additionally for\nclosed circuit or data or other purposes as a subordinate activity after they\nhave served their function of interconnection for radio or TV broadcasting\nwe would add the words \" suitable for the purpose of but not limited to\ndistribution and transmission\", etc.\nSec. 396(F).\nAppears fine.\nSec, 396(G).\nSeems to duplicate the entire Title I of the Act and appears therefore to be\nredundant to us. If it is dealing with planning, we've already spoken to\nplanning in Title I. We are opposed to duplicate passages in various titles\nbecause they would appear to add great possibility for confusion in the Act's\nadministration. Therefore, we question the entire (G) paragraph unless it\nis so severely limited that it is dealing with public relations or meetings, etc.\nas pre-planning activities in selected communities.\nSec. 396(H).\nV/e would again make non-operational by saying \"to foster through grants"
}