{
  "id": "d683-86",
  "text": "research, \" etc.\nSec. 396(3).\nSeems acceptable, although there is a typographical error on page 17,\nline 1 \"or network or interconnection ...”\nSec. 396(h).\nWe certainly agree and should cite our FCC satellite testimony points in\nsupport.\nSec. 396(k)(l).\nWe must cite as a good first step. (With due caution we may want to\nrefer to the Carnegie and ETS Models in their future projections. )\nSec. 396 (2).\nRaises several questions. We assume first that \"appropriation\" refers\nonly to Title II's $9 million appropriation. However, can we assume that\nthe limit on grants spoken to and again deleting contract, refers only to the\nfederal appropriation of $9 million? The question then is, what about any\nlimit on a grant, for example, from CBS of $1 million? Is it limited in\nany way? We believe it should be although the suggestion is added perhaps\nthat we should accept interconnection in this because interconnection is so\nvastly more expensive. We feel also that the word \"station\" in line 11, is\nan oversight and should be changed to \"applicant\" to make it parallel with\nthe language of (B) on page 15 which allows for many other applicants than\njust stations.\nTitle III.\nWe made no detailed analysis of these points assuming that Lew Rhodes\nwould. But we make these major notes:\n1. We must recognize the body of research already done primarily by\nUSOE with a large help from the Ford Foundation over the last decade\nto almost the entire list of suggested topics. To approve this title in its\npresent form with these present list of topics would be to say that $10\nmillion of federal money and probably that much in Ford Foundation\nmoney has gone virtually to no purpose. I think that would be an un¬\ndeserved slap at USOE and Ford Foundation. We must make it clear\nthat the only research which should be done should be directed to new\ngoals and new purposes not otherwise done and that they could put their\nmoney to at least one good purpose would be to collate all previous\nexisting research which we don't believe has ever been done. As a matter\nof fact we've had a terrible time getting lists from the Office of Education\nof even the wording of the Titles of various previous studies they have\nalready funded.\n2. We must recognize that there is some significant good instructional\nTV now going on which should be supported in its action phases and not\nmerely studied. At least a token effort ought to be funded from this title"
}