{
  "id": "d683-98",
  "text": "Congress o£ tfje States\nJOou$e of Skepvegentatibeg\nCommittee on interstate nnfci jforeijjn Commerce\nl\\oont 2125, jtaaPburn Mousse Office JSutliung\nSEIastfjtngton, 3D.C. 205X5\nJune 27, 1967\nNOTICE OF PUBLIC HEARINGS\nThere will be PUBLIC HEARINGS by the full Committee on Interstate and Foreign\nCommerce promptly at 10:00 A.M., beginning: TUESDAY, JULY 11, 1907, in Room\n2123, IlAYBURN BUILDING, on\nH.R. 6736 (Staggers, W. Va.), H.R. 6845 (Pepper, Fla.), H.R. 7670 (Macdonald,\nMass.), H.R. 7746 (Friedel, Md.), II.R. 774C (Garmatz, Md.) , H.R. 8402\n(Eilberg, Pa.), S. 1160, H.R. 10200 (McCarthy, N.Y.), H.R. 10400 (Moorhead,\nPa.) -\nTo amend the Communications Act of 1934 by extending and improving\nthe provisions thereof relating to grants for construction of\neducational television broadcasting facilities, by authorising\nassistance in the construction of noncommercial educational radio\nbroadcasting facilities, by establishing a nonprofit corporation\nto assist in establishing innovative educational programs, to\nfacilitate educational program availability, and to aid the opera¬\ntion of educational broadcasting facilities; and to authorize a\ncomprehensive study of instructional television and radio; and for\nother purposes.\nII.R. 4140 (Robison, N.Y.), H.R. 6042 (Pepper, Fla.), H.R. 6783\nNob.), II.R. 7826 (Button, N.Y.) -\nTo amend the Communications Act of 1934 to extend and enlarge the\nprogram of grants for educational television broadcasting faci¬\nlities\nIt is requested that each witness file five (5) days in advance with the\nCommittee Clerk five (5) written copies of his statement, aid furnish at\nleast seventy-five (75) additional copies at the time of Ills appearance, for\nthe use of the Committee and the press.\nPlease advise whom you represent, if you wish to appear as a witness, c?: file\na statement for the record, and, if so, whether you are for or against the\nproposed legislation, and, if you desire to testify, the amount of time re¬\nquired.\nW. E. Williamson, Clerk\nBy direction of the Chairman."
}