{
  "id": "d1385-0",
  "text": "OFFICERS\nEXECUTIVE COMMITTEE\nPRESIDENT; R. C. HIGfSY, WEAO\nOHIO STATE U N IVERS ITY\nCdlumbus, Chid\nVice-President: CARL M ENZER, WSU I\nSTATE UNIVERSITY OF IOWA\nI O WA □ ITY, I OWA\nFirst Zone: DANIEL E. NOBLE, WCAC\nCONNECTICUT AGRICULTURAL COLLEGE\nStorrs, Connecticut\nSecond Zone: J. B. HASSELMAN, WKAR\nMICHIGAN STATE COLLEGE\nSecretary-Treasurer:\nB. B. BRACKETT, KUSD\nUNIVERSITY OF SOUTH DAKOTA\nVermillion, South Dakota\nar\\A\nthird Zone: GARLAND POWELL, WRUF\nGainesville, Florida\nFOURTH Zone: W. I. GRIFFITH, WOl\nAMES, IOWA\nSPECIAL HJLLSTIN\nRelease Date April 14, 1932\nfifth Zone: H. V. CARPENTER, KWSC\nSTATE COLLEGE OFWASHINGTON\nPullman, WASHINGTON\nAT large: CHARLES A. CULVER, KFMX\nTO raffiSRS\nof NORTHFIELD, MlN^\nTHE ASSOCIATION OF COLLHCtS AND UNIVERSITY' BROADCASTING STATIONS\n(and a special request mailing list)\nMany interesting letters have recently been received at this office. In this\nbulletin several, which I believe will prove of interest to our members, are quoted.\nIf you have any suggestions regarding the problems discussed, please write to this\noffice, and they will be included in future releases to Association members.\nFROM MR. W. L., IiADDHRLY, ?ROGRAl''l DIRECTOR, STATION KOAC, OREGON STATE AGRICULTURAL\nCOLLEGE, CORVALLIS, OREGON: *’I have your special bulletin of February 24, contain¬\ning the suggestion that each member of the Association prepare a statement on the\nSeven Points listed by Professor Jensen. Furthermore, that the statement be filed\nwith Federal Radio Commission and our representatives in Congress.\n■'On June 15, 1927, Vire were assigned to a frequency of 1110 kilocycles with unlimited\ntime. In a general reassignment of frequencies on November 11, 1928, we were given\nunlimited time on 560 kilocycles and this later ^ras voluntarily changed to 550 kilo¬\ncycles which''Was better for our purposes.\n\"As I said in a previous letter, we now hold an unlimited license on 550 kilocycles\n\"Under these circumstances it seems to me that we are not justified in complaining\nof the treatment that we have received at the hands of the Federal Radio Commission.\nI am referring, of course, to our oim station.\n\"Of course we feel that we should not be required to operate 12 hours a day to\nhold our unlimited license and that rule 151 of the new regulations of the Federal\nRadio Commission should exclude from its provisions stations like ours (this is a\nnew rule to take the place of general order 105). In other words, ¥/e feel very\nkeenly that our present unlimited license should be available to the state of Oregon\nfor developments in the future and that it is unreasonable to require us to broad¬\ncast 12 hours a day in order to hold that license. However, this is quite aside\nfrom the purposes behind Professor Jensen’s suggestions. Our stateirant on those\npoints would indicate that in the matter of assignment, time and power we have\nreceived fair treatment.\n\"Perhaps you have read the article by Director Maris of this institution on ’Is a\nR. dio Budget Justified?’ Copy of Education b'.’' Radio, Volume II, No. 4 T^hich carries\nthis article is enclosed.\"\n'ANOTHER LETTER FRQEvf FIR. KiADDIP--LY REL'..DS AS FOLLOWS: ’’Thank you very much for the\n3opies of the radio plays 'rji Ohio Enoch Arden’ and ’The Underground Railroad’\nsupplied through you by WSuJi).\n\"Through the National Collegiate Players at this institution we have made some\nprogress in the last few weeks in presenting radio plays and we certainly would like\nto be put on the mailing list to receive additional manuscripts of this sort that"
}