{
  "id": "d1385-2",
  "text": "3.\nCourt of Appeals in the District of Columbia decided the case in favor of VvCAJ.\nThis case will doubtless serve as a precedent in other similar attempts on the part\nof commercial stations. There are two errors in the report of the Court. One is\nobvious when they speak of the poT/er used by ^ICU as S50 kilowatts. However, the\ncourt failed to look into the record very closely or they would not have made the\nstatement that WCiiJ is now licensed to broadcast with 250 ’.iratts and has a much small¬\ner service area than The fact of the matter is that we have never held a\nlicense for ‘250 watts and are operating with a full 500 watts power, 100^ modulation.\n’♦In regard to the letter from Joe ’^ri^t in which he mentions the RCA-Victor monitor\nequipment, I have on hand a letter fron this company offering a 10^ discount to\neducational stations.\n\"■ve have been working for seme time with some experiments in electrical transcription.\nWe were finally forced by circumstances to make a number of recordings with the equip¬\nment on hand, and achieved results which are quite satisfactory so far as repro¬\nduction of speech is concerned, although not altogether acceptable for music. We\nobtained a supply of the RCA-Victor needles and blank discs for home recording. Our\nAudak pick-up was weighted down with a \\?eight of about one pound and used as a recor¬\nding instrument. The regular studio condenser microphone and line amplifiers were\nused in connection with a Silver-Marshall power amplifier with a 245 tube in the last\nstage. By running the disc at 33 RPM an 8 minute address can be put on one side of\na 10 inch disc. This method has a lot of possibilities for the summer time when\nmost of us have trouble in getting talent, We can record any address at the same\ntime it is being broadcast, and other stations could doubtless do likewise. If\n4 or 5 of our members v;ill agree to exchange such material with us v/e will proceed\nto record a dozen or more of our talks on educational subjects during the T'emainder\nof the school year and exchange wife them for summer programs,\n”I note the troubles you are having with the Federal Radio Conmiission. Keep fighting\nthem, obtain competent attorneys, make full use of Armstrong Perry, and of your\nRepresentatives in Congress, and you will win out in the end.”\nBELOW IS QUOTED A LETTER FROM m. R. C. HTOGY, DIRECTCR OF STATION /T140, OHIO STATE\nUNIVERSITY, COLUI'/IBUS: ”In accordance with your letter of April 4, I am sending to\nyou all available copies of the two radio surveys recently completed.\n”I am enclosing a letter received from Armstrong Perry and suggest that you insert a\nrequest in one of your bulletins in the near future for stations to experiment with\nthe reception of W8XAL, short wave transmitter, to see if such a scheme would\nbe practical,\n”Your suggestion about the meeting in Columbus is quite satisfactory to me, and I\ntrust you are in position to announce it to the Association and suggest some definite\nform of meeting, or items to be considered at the meeting, I will be glad to cooper¬\nate in every way and only wish that I had further time to work upon it.\n\"Ue have been having quite a busy time here at USAD, the Federal Radio Commission\ncase and the purchasing of new transmitting equipment, has been a responsibility, as\nwell as a large task and is only partially completed. Ee expect to apply for a\nconstruction permit and contract for the purchase of our new station equipment next\n¥7eek,”\nTHE FCLIC^aNC LETTER UAS SENT TO MR. HIGGY BY MR, iUMSTRONG PERRY, DIRECTOR OF THF\nSERVICE BUREiUJ OF THE NATION/X COMMITTEE ON EDUaiHON BY R/DIO: \"Recently I asked the\nFederal Radio Commission what its attitude was tov/ard the transmission of advertising\nprograms by experimental relay broadcasting stations. I have received the following\nreply: ♦This wall acknowledge the receipt of your letter of March 16 in which you\ninquire-”Does the Federal Radio Commission permit the broadcasting of advertising on\nshort waves which are reserved for inter-continental broadcasting?” The Commission\npermits the transmission of advertising programs by experimental relay broadcast"
}