{
  "id": "d1385-24",
  "text": "July 23, 1932\nPage 23\nLetters\nHappy Hayseeds\nGentlemen:\nOne afternoon in April three ordinary\nlooking men came into our studio and re¬\nquested they be given a trial on the air,\nexplaining they were the Happy Hayseeds,\nplaying old time music. As this was not\nunusual they were given little attention other\nthan being assured that we would give them\na tryout. The leader advised that they were\nnot the regular type, but were good. Having\nheard that before, we were little impressed,\nbut assigned them to a period that heretofore\nwe had little call for in a commercial way,\n6:30 to 7:00 a. m.\nAfter getting them started we paid little\nattention to them until our attention was\ncalled to their program by the school teach¬\ners of two of the schools here, advising that\nnearly all the children were talking about\nthe Happy Hayseeds. Naturally we became\ninterested, made a sponsor an offer which, af¬\nter considerable persuasion, was accepted, the\nhour and the program both being wrong\naccording to the sponsor. After three days,\nthis sponsor, the Meyers Barnett Company,\ndealers in hardware, homeware and Oliver\nimplements, signed an exclusive contract for\ntheir services and have maintained a daily\nprogram at this hour, 6:30 to 7:00 a. m.,\nand today we believe the Happy Hayseeds\nare one of the most popular individual pro¬\ngrams on the West Coast, their mail is daily\nincreasing and they are in constant de¬\nmand. The secret of their program is the\nfact that they play the old favorites (not a\nhaywire orchestra), a guitar, banjo, violin and\nharmonica, but as the fourth man is able\nto double on the banjo, violin and harmonica,\nthe program is changed from time to time.\nA personal appearance drew over two thou¬\nsand people last week, some from as far\nas 80 miles. This we believe gives food\nfor thought for some stations that may be\nin the same position we were a short while\nback . . . thirty minutes or an hour that\nis considered too early to be commercially val¬\nuable, and yet find it to be their greatest asset\nwith the proper thing.\nW. E. Baker.\nRadio Station KGDM,\nStockton, California.\nThe Musical Vaughns\nSir:\nJust a few lines to let you know that\nThe Musical Vaughns who have been on\nthis station since January 15 will conclude\ntheir engagement here shortly, and will take\na short vacation and then start, September 1,\nan indefinite engagement over KFEQ at Saint\nJoseph, Mo.\nThe Musical Vaughns are a family trio\nconsisting of Mother Vaughn and her two\nsons, Jerry and Eddie Vaughn. All three\nare announcers and are reputed to be the\nmost versatile trio on the air. They play a\ndozen instruments, sing, dance, or do almost\nanything. The Vaughns have been together\nprofessionally since 1916, in many fields of\namusement. When they go to KFEQ at St.\nJoseph, Mo., this will be the twenty-first\nradio station over which they have appeared.\nIn leaving KGIZ, want to say truthfully\nthat we have never met finer managers than\nMr. and Mrs. Kelso, the station owners here\nat KGIZ. And I am sure we are leaving\nhere, as from all other stations, with the best\nwishes of the owners. And that we have\ndelivered our services well and faithfully.\nThe Musical Vaughns.\n.By Jerry Vaughn.\nIN THE CENTER OF THE DIAL\nChildren’s Hour\nGentlemen:\nFor some years we have conducted a chil¬\ndren’s hour, between 5:30 and 6:00 o’clock,\nover WNAX of Yankton. About two years\nago, we conceived the idea of doing some\ngood in the way of encouraging primary\ngrade children to study harder and bring\ntheir average grades up to around 90% or\nbetter. In connection with this, we offered\na certificate to any child, who in any given\nmonth would bring his grades up to an\naverage of 90, and that certificate would\nstate that the child had received unusual\nmerit along these lines. We offered at the\nend of the year a substantial prize to the child\nwho had the highest average of the year.\nDuring the past school year, we made\nthe same proposition, and have in our files\nover 5000 letters from children who have\nbrought their grades up to 90 or better, and\nat the present time are checking results and\nwill send to the one having the highest\naverage a Shetland pony. There will be ten\nprizes offered and given, many of which are\nin the nature of medals.\nNow, if you figure that 10% of the chil¬\ndren who are regular listeners to this pro¬\ngram will have an average of 90 or better,\nit would indicate that not less than 50,000\nchildren are regular listeners.\nJohn P. DePagter.\nRadio Station WNAX,\nYankton, South Dakota.\nKARK Makes Big Gains\nSir:\nIt might be interesting to the part of the\nindustry singing the blues to note that an\nobscure 250-watt station in Little Rock, Ar¬\nkansas, with two competitors, has made real\nprogress in this reconstruction period. In the\nsix months just ended, we have doubled the\ngross income of our station over January,\nand have built and paid for one of the finest\nbroadcast quarters in the state. Our three\nstudios, with artists’ lounge, reception room,\nand offices, are without question the most\nartistic, cool, comfortable, and practical of\nthose of any small station, and with our\ndance hall and big studio connection down¬\nstairs, we do believe there isn’t a better\nbroadcast layout in the state.\nWhen I came here in January, conditions\nwere very bad. Our studios and equipment\nwere not so good and our \"circulation” was\nnothing to brag of. The plan of popularizing\nthe station with unusual programs and unique\nfeatures attracted listeners to such an extent\nthat advertisers called on us. The manner of\n.diagnosing each client’s problem, using a\n■special idea to fit his case, putting it over\nand making it click, has won us a big per¬\ncentage of the more representative adver¬\ntisers, and so confident are we of our ability\nto get results that we will take certain ac¬\ncounts on a percentage basis.\nManage,, Donald E' Bennett'\nRadio Station KARK,\nLittle Rock, Arkansas.\nBest Radio Magazine\nGentlemen:\nI wish you would tell Tom Stevenson that\nthe Broadcast Reporter is the best radio\nmagazine published, and the only one that\nI read as soon as it comes, and read through.\nFred J. Hart,\nRadio Station KQW,\nSan Jose, Calif.\nKELW\nBurbank, California\nON THE AIR 6 HOURS DAYTIME\nWITH LOTS OF GOOD TALENT\n•\nThe audience of a station can be\nmeasured by the quality of\nits broadcasts. Here are a\nfew of our programs.\n• Cactus Mac\n• ”57” more or less\nTEXAS COWTOWN BOYS\n• Dr. Thornton—noted lecturer\n• Maxine Converse—noted so¬\nprano\n• San Fernando Valley Cham¬\nbers of Commerce\n• Texas Longhorns\n• Ruth Overton — personality\ngirl\n• Essie Locy—evangelist\n• Rev. Chas. W. Opie\n• Pentacostals Churche’s\n• Bruce and His Texas Cow-\ntown Boys\n® Spanish Gardens — program\nSpanish Rumba and Tango\nMusic.\nKELW\n780 Kcs.\nIN THE CENTER OF THE DIAL\nHARRY COGAN, General Manager\nI. PARKER, Assistant General Manager\nBOB KAUFMAN, Commercial Manager\n3702 Magnolia Boulevard,\nBurbank, California\nThe Only Rural-Serving Radio Station in\nSouthern California"
}