{
  "id": "d1385-4",
  "text": "July 23, 1932\nPage 3\nNational Broadcast Reporter\nA weekly magazine, published in Washington. D. C.. dealing with all phases of radio broadcasting and presenting the\nnews of the Radio Commission, the courts. Congress, engineering developments, equipment, programs, advertising, and\nall other matters affecting stations.\nThomas Stevenson, Editor; William P. Boyer, Business Manager, Barr Building, Washington, D. C. Lloyd Jacquet,\nAssociate Editor, 130 West 42d Street, New York City. W. L. Gleeson and Company, Western Representatives,\n1924 Broadway, Oakland, California.\nVol. 3\nJULY 2 3, 1932\nNo. 4\nThe Trend of Radio Broadcasting\n. On September 1,\nLicense the new rates of the\nFee American Society\nof Composers, Au-\nthors and Publish¬\ners are scheduled to go into effect. Dur¬\ning the past few months, the Negotiating\nCommittee of the National Association\nof Broadcasters has been attempting to\nwork out something with the Society.\nIf the Committee has had any success,\nit has been quite successful in keeping\nir secret.\nDoes the Society insist on a full quart\nof blood? Is it willing to compromise\nonly on two pints? Or is it willing to\nagree to a plan that seems fair not only\nto the stations but also to the publishers,\nauthors and composers?\nThen National Broadcast Re¬\nporter has such a plan, which it re¬\nspectfully submits herewith to the in¬\ndustry and to the Negotiating Commit¬\ntee for consideration. The Committee\nmay have thought of it already. In any\nevent, the plan seems reasonable to Na¬\ntional Broadcast Reporter.\nBroadcast stations should pay a fair\nrate for the use of music, but they should\nnot be gouged. The amount paid should\ndepend on the amount of music used\nand, to a large extent, on the benefits\nderived by the station.\nThe Plan\nUnder National Broadcast Re¬\nporter's plan, a checking committee\nwould be established, either by the Asso¬\nciation of Broadcasters or by the Broad¬\ncasters in conjunction with the music\nrepresentatives.\nEach station would supply the Check¬\ning Bureau with complete copies of its\nprograms each day. These programs\nBy Thomas Stevenson\nwould show all the music used by each\nstation each day.\nFrom the programs, the Checking Bu¬\nreau would determine what amount of\nmusic used was controlled either by the\nSociety or by the numerous similar or¬\nganizations that have sprung up during\nthe past few years.\nEvery station would pay each such or¬\nganization a given amount for each piece\nof music used. The Checking Bureau\nwould determine the amount due each\norganization, collect from the station,\nand pass the money along to where it\nbelongs.\nRates\nRates would vary for different classes\nof stations. A station of high power\nshould pay more than a station of low\npower. A station in a thickly populated\narea should pay more than a station in\na sparsely settled section. A station not\noperating for profit (school and\nchurches, for example) should pay a\nvery modest fee, if any.\nAll these items are reflected in the rate\ncard of the station, which is the self-\nmade yardstick developed by the broad¬\ncasters themselves. Stations, therefore,\ncould be charged on the basis of their\ncard rates for time.\nFor example, stations of Class A\nmight be those with rates up to $50 an\nhour; Class B, those with rates up to\n$100 an hour; Class C, those with rates\nup to $150 an hour, etc.\nThe amount to be paid by stations of\neach class for each piece of music could\nbe determined by negotiation. For ex¬\nample, Class A might pay 10 cents for\neach 12 pieces of music; Class B, 15\ncents for each 12; Class C, 20 cents for\neach 12, etc.\nThe music itself also could be classi¬\nfied into groups as to their popularity,\nvalue, or use.\nAdvantages\nThis is the only system which will col¬\nlect for the use made of a copyright.\nThe more used, the more money col¬\nlected. And no author, publisher or com¬\nposer can object to that. No station\ndoes.\nFrom a station standpoint, the system\nhas the following advantages: it provides\na real check as to where the production\nmoney is being spent; it allows of cor¬\nrect music budgeting; it makes it possi¬\nble to see how, and why diversification\nshould be made in program material;\nmore even distribution of music; bal¬\nanced with more dramatic and other\ntypes of material will result.\nStations would not be required to\nopen their books to the Society. The\nstation would have settled the copyright\nbusiness once and for all, not only with\nthe American Society but with other\nsimilar organizations.\nDouble payment would be elimi¬\nnated. At present both the networks and\nthe stations affiliated with them pay for\nthe same music. The transcription man¬\nufacturers and the stations pay for the\nsame music.\nHarmony\nCertainly the Society could not object\nto such a plan. The only ground for\nargument would be the amount to be\npaid for each piece of music, which\ncould be settled by negotiation.\nft would serve to bring about better\nfeelings between the Society and the\nstations.\nVol. 3, No. 4, National Broadcast Reporter, published each Saturday by National Broadcast Reporter. Editorial and executive offices, Barr\nBuilding, Washington, D. C. Publication offices, Clifton Avenue and Pavson Street, Baltimore, Maryland. Entered as second-class matter at\nthe post office at Washington, D. C. under the act of March 3, 1879, and additional second-class entry at Baltimore, Maryland. Subscription\nprice, $5.00 annually. Single copies, 25 cents. (Copyright 1932 by National Broadcast Reporter.)"
}