{
  "id": "d1413-7",
  "text": "n\nn\nFrom THE BILLBOARD\nSeptember 20, 19$2\nNAEB Matches Challenge\nTHREE SERIES TOP-FLIGHT UNDER\nFORD FOUNDATION 300G GRANT\nBy JUNE BUNDY\nNew York, Sept. 13.—Last year the Fund for Adult Education, established by\nthe Ford Foundation, turned over a $300,000 grant to the National Association of Edu¬\ncational Broadcasters for the purpose of producing radio programs of ‘‘historical and\ncontemporary significance\" which will “inform and entertain as well as educate.'*\nTo date the NAEB has turned out three new series on tape under the Ford\ngrant—'‘The Ways of Mankind,'* “People Under Communism,“ and “The Jeffersonian\nHeritageThe last named was launched Sunday (lb) by member stations of the NAEB\ntape network. The show was aired over WNYC in New York at 1 p.m. The series will\nalso be made available to commercial stations on a sustaining basis, and it is ex<*\npected that at least one of the three series will be broadcast over a national network.\nPoor Predessors\nHeretofore, the best argument in favo? ' commercial radio has been the fact\nthat the average non-commercial educational pro^ i all too often was both soporific\nand sophomoric, full of immature intellectual prevsnses, and seldom redeemed by any\nhonest vitality or originality.\nThe educational broadcaster's stock answer to this accusation has always\nbeen that the light of his programming know-how was obscured by the handicap of his\nnext-to-nothing production budget. Consequently, Ford's $300,000 grant to the NAEB\namounted to a put-up-or-shut-up challenge to the radio educator.\nHappily for all concerned, the first three series (reviewed here) repre¬\nsent a definite triumph for the ivy league set. All three shows are distinguished by\ntop drawer production values, good taste and (perhaps most important of all) a solid\nsense of showmanship.\nStakes Involved\nFull-cognizant of the stakes involved, the NAEB committee spent months\n^-lining up man power and facilities for the first three shows. Scripting standards on\n'People Under Communism,'* for instance, were so high that eight top radio writers\nthrew in their typewriters before the hour-long series received a final okay. Tech¬\nnical advisors put in months of research, fine-combing each script to assure complete\nauthenticity.\nThe committee's painstaking efforts are clearly evidenced in the excellence\nof the final products. Admittedly some portions of the shows reflect a little too\nmuch care for the good of their own pacing.. However, now the initial pressure to\n\"produce*' is off, the committee will undoubtedly relax its perfectionist policy\nenough to safeguard future shows from the danger of see dng stuffy."
}