{
  "id": "d1413-9",
  "text": "From THE BILLBOARD\nSeptember 20, 1952\nTHE JEFFERSONIAN HERITAGE\n(The Living Declaration)\n* RADIO—Re viewed at a special pre-broadcast hearing at WNYC, New York.\nProduced by the National Association of Educational Broadcasters. Producer-director,\nFrank Papp. Writers, Morton Wishengrad and Milton Geiger. Music, Wladimir Selinsky.\nTechnical advisor. Professor Dumas Malone, Department of History, Columbia University,\nCast: Claude Rains, others._______'.---_—\n\"The Jeffersonian Heritage11 is a 13-week half-hour series dealing with the\nlife, times, principles and philosophy of TSDmas Jefferson. However, its purpose is\nnot biographical, but rather to show'how Jeffersonian ideals have guided generations\nof American statesmen up to the present day. In line with this aim, the initial,\nprogram ’’The Living Declaration,” reviewed, spotlighted Jefferson’s part in writing\nthe Declaration of Independence.\nThe entire series is based on the research, writing and advice of Professor\nDumas Malone, of Columbia University, -who checked and rechecked every line of dialog\nto be sure it carried the proper Jeffersonian flavor. Producer-director Frank Papp,\nhas showcased the professor’s material in laudable fashion, with Wladimir Selinsky’s\nmajestic background music particularly impressive. However, major credit for the\nseries’ success belongs to actor Claude Rains.\nRains’ Job\nIn an attempt to imbue the program with a genuine feeling of history in the\n.making, the script often subordinates dramatic action to Jefferson’s philosophy.\nConsequently Rains delivers lengthy first-person narratives .and completely dominates\nall of the dramatized segs. In most cases other cast members do little more than\nfeed him lines.\nThis one-man script treatment was undoubtedly necessary to the spirit of\nthe series, but the fact remains that under such an arrangement the oasic quality of\nthe series is 99 per cent dependent upon the stature of its leading performer. For¬\ntunately, the NAEB realized this, and spent a sizable share of its Ford bankroll to\nsnare the right man for the role—Claude Rains.\nThe legit-flicker star’s flexible vocal range and quietly authoritative\nunderplaying enables him to sustain audience interest thru-out solilqquies which\nwould totally defeat many an able actor.\nWithout Rains or someone of like stature, ’’Jeffersonian Heritage” would be\ntalky and uninspired. His importance to the series was emphasized earlier by the IM\nNAEB itself> when the committee postponed production on the show for two months until\nRains could fit it into his schedule.\nThe first show in the series registered maximum audience impact, via Jeffer¬\nson’ s vain attempt to have an anti-slavery clause written in the constitution and\nRain’s convincing explanation of Jefferson’s tolerant religious views.\nThe series Ttfill endeavor to relate Jeffersonian history with current world\naffairs iiiienever possible. Titles of forthcoming programs include: ’’The Democrat and\nthe Commissar,” ’’Light and Liberty” and \"What the Jeffersonian Heritage Keans Today.”"
}