{
  "id": "d1342-0",
  "text": "NEWS NAEB LETTER\nNATIONAL ASSOCIATION » EDUCATIONAL BROADCASTERS\nFrank E. Schooley, Editor, Station WILL, Urbana, Illinois\nNovember I5> 19^*1\nFIFTH SCHOOL BROADCAST CONFERENCE\nPresident Harold A, Engel has called a meeting of MAEB for Thursday\nnoon, December 4. The meeting will be held in conjunction with the\nFifth School Broadcast Conference, which will be held December 3-5\nin Chicago.\nOf the Conference, the Radio Daily says: \"Relationship of education¬\nal radio to the national defense effort will be one of the prime\nconsiderations of educators and broadcasters at this year's Fifth\nAnnual School Broadcast Conference to be held here at the Congress\nHotel December 3-5 preliminary program notes released yesterday indi¬\ncate. One of the most important of the annual educator-broadcaster\nGET-TOGETHERS ON EDUCATIONAL PROGRAMMING OF THE YEAR PAST, THE S. B. Co\nTHIS YEAR AGAIN WILL FIND ALL NETWORKS AND NUMEROUS INDEPENDENT\nSTATIONS COOPERATING IN WORKING TOWARD BETTER, MORE ENTERTAINING AND\nSCIENTIFIC USE OF THE MEDIUM IN AUGMENTING THE WORK OF SCHOOLS AND\nUNIVERSITIES.\"\nDEFENSE ON K U S D PROGRAM?\nPerhaps because of the isolationist sentiment of South Dakota, KUSD\nHAS LAGGED BEHIND OTHER EDUCATIONAL RADIO STATIONS IN THE PRESENTA¬\nTION OF DEFENSE PROGRAMS. AT PRESENT, THE RADIO VOICE OF THE\nUniversity of South Dakota has only one program which might be\nCLASSIFIED AS A DEFENSE BROADCAST. THIS IS \"SERVICE WITH A SMILE,\nBROADCAST FOR 15 MINUTES EACH FRIDAY. THE PROGRAM FEATURES NEWS\nOF THE UNIVERSITY AND SOUTH .DAKOTA BOYS IN THE SERVICE OF OUR NATION,\nAND NEW'S OF THE DE'FENSE PROGRAM. The OFFICE FOR EMERGENCY MANAGEMENT\nprom Iseo in September to send KUSO 5-minute transcribed summaries\nOF THE DEFENSE PROGRAM ACTIVITIES, BUT THIS HAS NOT BEEN DONE. A\nROUND-TABLE DISCUSSION CONDUCTED BY THE OIRECTOR OF THE UNIVERSITY S\nBusiness Bureau and dealing with the relationship of business to de¬\nfense WILL SOON BE STARTED.\nDEFENSE PROGRAMS ON W K A R\nWith National Defense very much in the public consciousness, several\nPROGRAMS HAVE BEEN PLANNED BY W K A R, MICHIGAN STATE COLLEGE, TO KEEP"
}