{
  "id": "d1342-1",
  "text": "NAEB NEWS LETTER\nNovember 15, 1941\nPage 2\nCITIZENS INFORMED OF ACTIVITY 3Y STATE ORGANIZATIONS AND TO DESCRIBE THE\nIMPORTANCE OF MATERIALS IN THE DEFENSE EFFORT,\nProper diet to assure health during the emergency will be stressed in a\nprogram by the Michigan Nutrition in Defense Committee, heard each mon-\noay at 3:15. Dean Marie Dye, of the Home Economics Division, is chair¬\nman of this committee and in charge of the programs.\nEach Tuesoay, at 3:15, the Michigan Defense Council presents information\nOF ITS WORK IN STATE AND OF THE COOPERATION GIVEN BY STATE DEPARTMENTS\nAND ORGANIZATIONS.\nOn Wednesday, at 3:15, Professor C. C. DeWitt, of the Department of\nMetallurgical and Chemical Engineering, will tell about metals and\nCHEMICALS WHICH PLAY AN IMPORTANT ROLE IN DEFENSE, WHERE THEY ARE OB¬\nTAINED ANO HOW USED. NEWS OF THE ARMY, WITH LATE3T INFORMATION OF THE\nMOVEMENTS OF MICHIGAN MEN AT FORT CUSTER AND OF THE ARMY IN GENERAL IS\n'HEARD EACH FRIDAY AT 2:15.\nAfillAf 11!-gg-AL.Q,T.P.f U°\n“Over a two week perioo we gave away over 1700 of the memo pads. The\nYouth Court is conducted by the head of the Sociology Department and\nEACH WEEK HE HAS A GROUP OF UNIVERSITY STUDENTS TO DISCUSS WITH HIM\nPROBLEMS THAT ARE OF INTEREST AND THAT CONFRONTS YOUNG PEOPLE OF TO¬\nDAY. SO FAR THIS YEAR, I FEEL THAT WE HAVE MADE VERY NOTABLE PROGRESS\nIN OUR RADIO WORK HERE AT THE UNIVERSITY. WE HAVE HAD A NUMBER OF NEW\nBROADCASTS ADDED TO OUR SCHEDULE, AND AT THE PRESENT TIME, ARE BROAD¬\nCASTING BETWEEN 20 AND 23 PROGRAMS A WEEK OVER THE LOCAL STATION, KGFF.“\n«| LOOK FORWARD EACH MONTH TO RECEIVING THE NAEB NEW3 LETTER. I THINK\nTHAT SO FAR THIS YEAR, IT HAS OEEN MUCH BETTER THAN THE ONES WE RE¬\nCEIVED LAST YEAR,“\n“In ABOUT TWO WEEKS WE ARE STARTING a NEW 3ERIES OF BROADCASTS WHICH I\nTHINK WILL BE OF INTEREST. THE PROGRAM WILL BE CALLED WARS AND THE\nWorld, Each week during this series of broadcasts, different members\nOF THE FACULTY WILL DISCUSS HOW WARS HAVE EFFECTED LITERATURE, MUSIC,\nART, RELIGION, ETC. ENCLOSED YOU WILL FIND MY SELECTION FOR THE 1942\nNAEB Convention Meeting Place.m\nASKS ALL EDUCATION TO SHOULOER DEFENSE TASK \nFederal Security administrator Paul V. McNutt today announced a plan\nBY WHICH HUNDREDS OF THOUSANDS OF TEACHERS, EDUCATIONAL LEADERS, ANO\nCITIZEN VOLUNTEERS CAN PARTICIPATE IN NATIONAL DEFENSE. He ISSUED A\nCALL FOR VOLUNTEERS TO THE SCHOOL AND COLLEGE CIVILIAN MORALE SERVICE\nTO BE DEVELOPED BY THE U. S. OFFICE OF EDUCATION. IN SHAPING PLANS FOR\nRECRUITING VOLUNTEERS THE OFFICE OF EDUCATION IS COOPERATING WITH THE\nOffice of Civilian Oefense."
}