{
  "id": "d1342-3",
  "text": "NAEB NEWS LETTER\nNOVEMBER 15\nPage 4\nor EDUCATION FOR A 8TR0NG AMERICA* MONDAY EVENING StORGE BAXTER\nSmith, dean, presented his impressions of the School of Education\non the reoular serier, “Exploring the Univcrsitv.m On Tuesday\nevening, Or, Forrest C* Allen ano the physical coucation staff\nMEMBERS 018CUSSE0 THE SCHO r Eftu TRESS*\nOn wconesoay evening the regular University of Kansas round-table\ntopio was “Education for a Strong America.* On Thursday afternoon\nspoke J. W. Twcnte on “Safeguarding School Support** The series\nWA8 COMPLETED ON FRIDAY WITH A ROUND-TABLE DIGCU8SI0N SV ST AFF\nMEMBERS FROM UNIVERSITY ACAOCMtC DEPARTMENTS ON “ENRICHING FAMILY\nLite**\nSaftKSgS.ARE PN w S A 0\nShakespeare*s works arc coming to life again in a new and enter¬\ntaining FASHION OVER WNAD THIS YEAR IM A PROGRAM TITLED “TALES\nfrom Shakespeare.*\nAdaptations of the baro’s entire group of plays are being presented\nON THE 30-MINUTE PROGRAM GIVEN EACH WEDNE30AV. IN ADDITION, ORIGINAL\nMU8IC IS BEING C0MP08E0 FOR USE WITH THE INDIVIDUAL PLAYS AND JOSEPH\nH. Marshburn, 0. U. English Professor, is giving technical commen¬\ntaries FOLLOWING EACH PRODUCTION ON SHAKESPEARE13 SOURCES OF PLOTS\nANO CHARACTERS, AND GENERAL ANALYSES OF THE PLAYS*\nActors in all the dramatizations arc university students. Adapta¬\ntions ARE BY NOEL fcANO, HEAD OF THE WNAD SCRIPT DEPARTMENT, AND HO¬\nMER Heck, WNAD supervisor, is production director* The original\nmusic is by Mrs. Helen Weiss, Philadelphia, Pennsylvaia, graduate\nSTUDENT 8TU0YING ST 0. U* ON A FELLOWSHIP.\nmmsim. ra* *oTuca&\nLexington, Ky.—(Intercollegiate Press)-The University of Kentucky\nHAS THE DISTINCTION AND ADVANTAGE OF BEING THE ONLY UNIVERSITY IN\nTHE COUNTRY WHICH, AT THE PRESENT TIME, IS PRESENTING FIVE WEEKLY\nRAO10 PROGRAMS ON THE COAST—T0-C0A8T NETWORK OF THE MUTUAL BROAD¬\nCASTING System. No other University has such a big listener au¬\ndience, ACCORDING TO INFORMATION RECEIVED HERE*\nThe FIVE PROGRAMS CURRCNTLY PRESENTED ARE “OUR ARMY AT WORK ANO AT\nP-,:Ym WH*CH IS a PRESENTATION OF THE EXPERIENCES, EMOTIONS, ANO\nEVENTS IN THE LIVES OF MEN IN SERVICE IN THE UNITED STATES ARMY,\nNAVY, MARINE AND FLYING CORPS TRAINING CAMPS, NOW BEING BR0A0CA8T\neach Tuesday from 1:30 to 1:45 p.m*. a scries now featuring talks\nby President h. L. Donovan of the University in a discussion of\n“Backgrounds of Our Constitution,\" goes out each Tuesday from 1:45\nto 2:00 p.m*; ano a broadcast of musical and eventful memories of\nDAYS GONE SV, a FEATURE RADIO BROADCAST EACH WCONESOAY FROM THE\nUniversity studios at 1:45 to 2:00 p.m*"
}