{
  "id": "d1342-4",
  "text": "NAEB NEKS LETTER\nNovember 15, 1941\nPage 5\n\"Music of the Americas\" is another interesting musical feature which\n18 BROAOCAST FROM THE UNIVER8ITY EACH THURSDAY FROM 1:30 TO 1:45 P.M.,\nAND WHICH CONSISTS OF MU8IC BY COMPOSERS OF THIS HEMISPHERE, PRE¬\nSENTED by the University stuoio orchestra, a good amount of South\nAmerican music is included in this series, in an emphasis of the\n\"good neighbor\" policy.\nDramatized stories from our own hemisphere make up the final program\nOF THE FIVE IN THE SERIES, AND 1NCLUOE STORIES TO TEASE THE IMAGINATION,\nTO QUICKEN THE 0AY*9 PACE, AND TO AROUSE AN APPRECIATION NOT ONLY OF\nOUR OWN FOLKLORE AND LITERATURE, BUT ALSO OF THOSE OF OUR NEIGH80RS\nTO THE NORTH AND THE SOUTH. THIS IS A THURSDAY FEATURE AT 1:45 P.U..\nWRUF TO JOIN MUTUAL\nW R U F, University of Florida, will join the Mutual Broadcasting\nSystem in the very near future, barring unforeseen circumstances.\nMajor Garland Powell, director of the station, announced on November 5.\nPlans for hookup with Mutual have seen progressing steadily for several\nMONTHS, AND a CAMPUS POLL TAKEN LAST YEAR SHOWED ALMOST UNANIMOUS STU¬\nDENT 'SENT IMENT FAVORING THE MOVE.\nMajor Powell stated that discussions with Mutual chieftans in New\nYork have seen completed, and work now is progressing on acquiring\nnecessary equipment ano arranging wire connections.\nCapitalizing on forthcoming national chain affiliation, WRUF is\ngoing aheao with attempts to obtain directional antennas, which will\nENCLUDE FULL TIME OPERATIONS. AT PRESENT WRUF CONFLICTS IN WAVE\nLENGTH WITH STATION KOA, DENVER. If PRESENT PLANS MATERIALIZE,\n\"Voice of Florida\" fans will de able to tune in favorite eocal ano\nMBS programs from early *til late.\nWMYC...STftaT$\nWNYC, New York 1s Municipal Broadcasting Statcon, has gotten its\nholiday series of spot announcements concerning Christmas mail\nUNDER WAY EXTRA EARLY THIS YEAR IN VIEW OF THE NATION'S DEFENSE\nNEEDS.\nThe announcements urge listeners to mail early, wrap packages securely\nANO ADDRESS PLAINLY, MAKING PART ICULAR’ REFERENCE TO GIFTS GOINQ TO\nTROOPS AT DISTANT ARMY CAMPS AND WORKERS AT DEFENSE OUTPOST8.\nMEET AT WI SCONS IN NEXT VEAR.I\nWHA ANO THE UNIVEhSITV Of WISCON8IN EXTEND A CORDIAL INVITATION TO"
}