{
  "id": "d582-26",
  "text": "THE ASIA FOUNDATION\n105 Market Street, San Francisco 5, California • YUkon 2-4640\nFebruary 18, 195$\niC\nMr. Frank E. Schooley\nDirector of Broadcasting\nGregory Hall\nUniversity of Illinois\nUrbana, Illinois\nDear Mr. Schooley:\nOur office in Pakistan has suggested that we write to\nyou concerning our Book Gift Program in the possibility that you\nmay wish to send books to your colleagues in Asia.\nOn our part, the Asia Foundation is interested in\ngetting a better understanding of current Western thought among\nprofessional people in the several countries of Asia. We know\nfrom experience that while a book by itself may be effective, a\nbook presented by a friend can have powerful effect among people\nwho have been cut off from the West or have only a distorted\npicture of us.\nWe would be happy to defray the costs, up to $20.00,\nof books, magazines or journals of your choosing, that you might\nsend your colleagues in Asia, without embarrassing the recipients\nor causing them to feel overly obligated to you. (In some instances\nthe -American donor has expressed an interest in receiving an\nAsian periodical or pamphlet dealing in his particular field to\nalleviate any feeling of obligation on the part of the recipient.\nThis procedure, however, is left to the discretion of the donor.)\nReimbursement would be made promptly by us on receipt of titles\nforwarded and names and addresses of recipients.\nFor your information we are attaching an Asia Foundation\nbackground statement and a copy of our book program, in which the\nabove plan is outlined. We would appreciate receiving your thinking\nin the foregoing plan and any comment you may care to make on the\nprogram in general, although if you agree to participate, you may\nproceed without further communication.\nYou may wish to inform other colleagues of youis of\nthis plan. Books should be sent in single copies marked ’'Gift.”\nThank you for your consideration.\nEnclosures\nCarlton Lowenberg\nOperations Department"
}