{
  "id": "d1701-0",
  "text": "' f\nf\nANNUAL MEETING OP THE NATIONAL ASSOCIATION OP EDUCATIONAL BRO AC ASTERS*\nIOWA CITY? IOWA? SEPTEMBER 9 AND HO ,1935.\nThe annual meeting at Iowa City on Monday and Tuesday, September 9 and\n10 , 1935 did not have a large attendance, but was one of the raos t\nprofitable ever held by the Association. The number formally register¬\ned was slightly under 20 , but several were present and took part in\nthe various meetings that might have registered, yet did not do so.\nThe complete program of the various sessions was carried out practical¬\nly as listed in advance, those on the programs Who could not attend\nsending sending carefully written papers that were read by others who\nwere familiar with the subject under discussion.\nThe first session was called to order by President W. I. Griffith,\nIowa estate College, Ames, Iowa, at 10:00 a.m, September 9, In the\nRiver Room of the Iowa Memorial Union, Iowa State University. Vi^ce\nPresident Harold G. Ingham, Director of KFKU, Lawrence , Kansas, was\ncalled to the chair. Eighteen were present.\nDean Kay of the Iowa State University then welcomed the Association\nto the University and the city In a very cordial way, and pointed out\nhow radio could help in a social development of mankind that would\ncorrespond to the technical and mechanical developments of the present\nage.\nAt 10:15 President Griffith responded by thanking Dean Kay for his\nvery fine welcome, and explaining why our Association should hold\nmeetings like the present one. Exchange of ideas , discussions as to\nhow eduactional broadcasting programs can be made even more worth\nwhile, informal and round table conversations on subjects not even\nlisted in the formal programs , mentioned , as reasons for these\nmeetings.\nAt 10:50 a.m. Harold A. Engel, Promotion Manager, WHA , Madison, Vfts.\nspoke on * A Radio Instrospection\". He urged all members of our group\nto put forth every possible effort to develop all phases of the\nphysical equipment and program material. He suggested that many of us\nappeared to be doing our work halfheartedly, and not making the devaL-\nopment of our work that was really possible. The very remarkable way\nin which those in charge of WHA had developed fine studios and studio\nequipment from unused rooms and second hand materials was explained.\nAt 11:27 a.m. a paper written by Charles A. Taylor of WE3G, Cornell\nUniversity, Ithaca, N.Y., entitled w A Syndicated Radio Service\", was\nread by M. C. Jensen, Manager of WCAL,3t* 01af College, Northfleld,\nMinn. The paper explained how material for broadcasts of agricultural\ninterest was sent out feo and used by 24 different stations In New York\nState and adjacent territory. How the material was collegfced in large\npart *rom the listeners themselves , and then put into broef , concise\nitems. None of them more than a few minutes long. These are read by\nthe announcers of the commercila stations to which the material i3 sent.\nAt 11:45 President Griffith read a letter from T. M. Beaird, Director\nof WNAD, University of Oklahoma and Executive Secretary of our Associ¬\nation. .as Chairman of a Committee on Proposed Recorded\nPrograms. a cornmlttef* ?<+• +-Vi^ yawoMo"
}