{
  "id": "d1701-0",
  "text": "Office of Executive Secretary\nc>om , Illinois\n11 .1, 1939\nHONOR ROLL FOR 1939\nSeventeen members of '-iave actuaftty crashed (or cashed) through with\n** payment of dues fox^ 3»39, according to Treasurer W. I. Griffith. Others\nhave payments In process, lor example, we know of payments in process\n^ for WNAD and WO£U. But if you have over-looked this all-important matter\nplease attend wo it at once so that we may have 100 per cent payments by\nMay 1. The Honor Roll as of March 35th is as follows!\nCornell University, Ithaca, New York - WESG\nGrove City College, Grove City, Pennsylvania - WSAG\nIowa State College of Agriculture, Ames, Iowa - WOI\nOregon State Ag. College, Corvallis, Oregon - KOAC\nRensselaer Polytechnic Institute, Troy, New York - WHAZ\nSouth Kcota St. College of Mines Rapid City, S. D. - WCAT\nState l .versit; of Io\\ , Iowa City, Iowa - WSUI\nSt. Olaf College,, North; ield, Minnesota - WCAL\n\\ University of Illinois, irbana, Illinois - WILL\nUniversity of Kansas, Lawrence, Kansas - KFKU\n♦University of Kentucky, Lexington, Kentucky\n■\"University of Michigan - Ann Arbor, Michigan\nUniversity of 1 I. ~ Grand Forks, N. Dak. - KFJM\nUniversity bf Wisconsin - Madison, Wisconsin - WHA\n♦Western St/r.te Te.uere College - Kalamazoo, Michigan\nState College c ./aldington - Pullman, Washington - KWSC\nWorld Wide broadcasting Foundation - Boston, Mass. - W1XAL\n* Associate Memberships.\nPLAN TO ATTEND NAEB MEETING IN COLUMBUS\nAs has been the practice fox'* many years NAEB will hold a closed meeting\nin connection With the annual Institute for Education by Radio at Ohio\nState University. The Institute will be held May 1, 2, and 3 in Columbus <\nBe there. The NAEB meeting is scheduled for Monday evening.\nP0N»T OVERLOOK THE PACKED\nThere Is much valuable information exchanged via the NAEB packet. Don't\nfail to use it. .The Ohio Radio Script Library lietinge are included with\nyour April 1 \"Hews Letter\". MSB member a may borrow scripts on the basis\nlisted in the bulletin. See what other NAEB members are doing - at WNAD,\nV/XML, WILL, Kentucky, W LB, W3AJU KFKU, et al."
}