{
  "id": "d1701-2",
  "text": "( 3 )\nprograms be o^ered to both educational and commercial stations alike\nsubject only to the condition that they should not be used in any way\nf*or commercial purposes.\nAt 6;45 p.m, the delegates and about as many lady friends sat down to\ndinner in the Fiver Room of the Memorial Union. After the dinner Dr.\nBruce S* Mahan , Director of Extension , State University of Iowa,\nas toastmaster of the occasion, presented a male quartet from the\nBurlington Junior College, together with their director, and w© were\nfavored with several very fine selections. Then the toastmaster In*\ntroduced President A.G.Crane , University of Wyoming , Laramie ,Wyom¬\ning, who addressed those present on \"the Supplemental Broadcasting\nSystem , Proposed by the National Committee on Education by Kadio. \"\nThe presentation was made by Dr, Crane in the forceful and effective\nmanner for which he is known. Then followed a considerable number of\ninformal questions and comments on the proposed plan all of which were\nanswered most satisfactorily by Dr. Crane. Most of those in attedanoe\nremained in informal discussion and conversation upon the chief sub¬\nject of the evening until 10:00 p.m., when were informed it was time\nto close the building.\nThe first session of Tuesday, September 10th, was culled to order at\n9:45 a. m. by President Griffith, 17 delegated being present at that,\ntime.\nDr.P. H. Ojemann, Iowa Child Welfare Research Station, State Univers¬\nity of Iowa, presented the first address of t-fta day , on \"Accomplish¬\nments and future of the Radio Child Study Club. \" The work was explal\ned to have been designed to advise parents to treat their children\nintelligently and to care for them both physically and mentally* The\nwork was outlined in a printed bolder , and its divisions are there\nmade clear. £300 listeners were enrolled last year. The work was teg\nlargely conducted through through listening groups, and ltris believed\nmeeting of groups has an important soclM €€eect .\nAt 10:30 an address was made by Prof. H. C? Harshbarger , Production\nManager of W3UI, Iowa City, on \"The Relation of the Speech Department\nto the Unuversity Radio Station \", was t?ea d by Prof. Harry 0, Barnes.\nThe writer had made tests in speech comprehension , using phonograph\nrecords. The comprehension op the listener did not exactly follow his\nintelligence test rating. Something more than intelligence was found\nto be involved. Illustration aids in comprehension . Also repetition\nhelps to fix Pacts. Program research is very important for the suc¬\ncess of educational broadcasting.\nCourses related to broadcasting at the University of Iowa offer 3\nhours credit for two semesters. There are courses in radio managa\nment. In radio speech and In continuity writing.\nIn 1933, 17 colleges and universities gave some kind of courses in\nradio.\nAt 11:00 a.m.. Dr* Tracy F* Tyler, Secretary and Research Director of\nThe National Committee on Education by Radio, Washington, D.C., address¬\ned the meeting on \"A Message from the N.C.E.R. The said that one\nImportant service of the Committee had been the employment of Mr* Horac£\nLohnea to give expert legal advice to members of our Association on\nmatters Involving our status before the Federal Communlcations Commiss¬\nion. Since the original grant of funds for the support of the N.C.E.H.\nwas for a five year period and that time will expire on December 30,\n1935, it is doubtful whether the Committee can continue its work after\nthat date"
}