{
  "id": "d1701-4",
  "text": "grammar. An other objection is that too many .speakers aro put on a\nsingle debate. In most cases two speakers , one an each side is to be\npreferred. Some people want to hear only one side of a debate. The\nvoice and the grammar of student debaters are not always than those\nof faculty mambers.\n'lie speaker believed that all in all student, radio debates ware\njustified*\nAt 2:30 p#ra,, \"Andy\" 0,Woolfries, WOI Announcer, Ames, Iowa, presented\na most interesting talk on the \" WOI Music Shop\". He said this feature\nhas been on the air since 1925, It started with borrowed records,played\non a regular phonograph and picked up through a microphone. Began using\na pick-up’1 reproducer of the O.F. type before they were on the open\nmarket. After a while we began to put on request numbers to learn how\nmany were listening? and we continued this until we were getting 1000\nrequests a day , when we were compelled to stop. We began purchasing\nour own disks and using only the very best kind of music. Later we\nwere getting so few reports from our listeners that we thought it must\nbe true they did not like our kind of music. We therefore made this\ntest. We $$>ayed \" On Wings of 3onc\" by Mendelssohn and followed this\nwith a record of modem jazz, asking our listeners to report which\nkind of music they preferred. \" Oft Wings of Song\" received a most over¬\nwhelming majority. Since then we have had no doubt that our listeners\nprefer the very best kind of music : and we have built up a musical\nlibrary of records on that evidence.\nWe no'^have ?100 records, practically all that have been made of the\n°3000ri°all'!r °Ut di3!rS Pru<la music. The coat haa been about\nife believe we have educated our listeners in music uppBaciation by\nrlvinp them better and better music , while not telling them that we\nware doing so.\nOur listeners comprise cultured people. They write us on good paper,\nthey use good grammar. Many letters are typewritten.\nAt about 3:10 p.m. the regular annual business session was called.\nThe Secretary-Treasurer reported 23 regular and active members and\n9 associate members. Some minor bills **or the past :/ear had not been\npresented, and when these had been paid the balance on hand would b©\napproximately v 300,00. Detailed st$©m©nts were offered to those\ndesiring them. The report was accepted and approved by regular vote.\nIt was further reported by the 3ecr©fcary*-?re&aurer that at the last\n!Rn^uli.1?ee^lng.it was voted t0 3@Rd J.F.WMght , the retiring President\nto Washington to represent our /Association at a hearing before the\nFederal Communications Commissionj and that it was then thought best\nto pay his expenses from a special fund for that purpose, and eight\npledges had been made at that time to meet such expenses. Since on3y\nfour of the pledges of $10:00 each had been paid , It was suggested\nmon0y so be either returned to those making\nPfclal contributions or be applied to future dues , if either &\nThis0wa^ 8+2Uld b? requested by those who had made the payments\nThis was voted by the members present. h u\nThe nominating committee, appointed earlier during thifcs meeting, with\nT. Cr. Ingham, KT^FTTJ as Chairman, then reported the following ticket as\nproposed officers for next year. g ticket, as"
}