{
  "id": "d1885-1",
  "text": "NAEB Personnel Service\nPOSITIONS AVAILABLE ^\n(For information, write Miss Yasmine Mirza, Personnel Service, at\nthe NAEB in Washington. In order to be considered through these\nchannels, the reader must be an Individual Member of the NAEB,\nwith credentials on file with the NAEB Personnel Service. Non-mem¬\nbers can save time by sending the $10 annual dues and $10 place¬\nment registration fee at the time of inquiry.)\nProducer-Director for VHF University station in southwestern market. Prefer\nperson with minimum of BA degree, some directing experience in ETV.. Must\nbe capable of working with both faculty, community leaders, and aiding in\ntraining students. Prefer someone who has had experience in set building\nand graphics. _ ...\nNeed July I two experienced producer-directors. Strong in producing-direct-\ning-lighting. Faculty staff status. One position requires some news background.\nBoth require minimum BA degree. Expanding ETV station going full power\nand complete color in new building. Excellent state benefits and working con¬\nditions. Salary open. .\nCommercial Artist for ETV. To produce graphics, mock-ups, models, signs,\nsets, and other similar materials for use on various programs. This, person\nwould work with the Producer-Directors at the direction of the senior Pro¬\nducer-Director and/or the Coordinator of Educational Television.\nTV Producer-Director for Northeastern college CCTV system. Minimum quali¬\nfications include 15 hours beyond a Bachelors (MA degree preferred), and\nthree years experience with educational institutions. Salary range: $5960-\n$8,000 for 9 months. . . .\nLarge Eastern University has opening for an ITV production specialist to\nbe responsible for assisting, advising and guiding faculty members with\ntheir televised courses. BA degree required. Applicant should have taken\ncourses in radio, television and film production. Additional courses, in edu¬\ncation and psychology very helpful. Salary depends on qualifications and\nexperience. ,.\nCoordinator of ITV Programs. In addition to the usual producer-director\ntelevision skills, the individual should be fundamentally concerned with stu¬\ndent learning. He should enjoy working with university faculty and be in¬\nterested in the opportunity of working in a strongly multi-media, research\noriented activity. The position is at a large midwestern university wjth ex-\ntensive and varied television programs and facilities. Some teaching is pos- ^\nsible. Salary: plus or minus $9,500, depending upon qualifications.\nAudio-Visual Coordinator. Newly established Instructional Resources Center\nin Northeast college has opening for a person with strong background and\ntraining in film, TV, and transparency production. MA degree. preferred.\nApplicants must have general academic knowledge for working with faculty.\ntionali'sm in Music”; KNME-TV, Univer¬\nsity of New Mexico, for “Elementary Sci¬\nence—5” and “Zoology—Fish” ; WETA-\nTV, Washington, for “Deadline I” and\n“What Are the English Language?”;\nWNDT(TV), New York, for “Where\nThere’s Smoke, There’s Danger”; WNYE-\nFM, New York, for “The Negro in Amer¬\nica” and “Giving Away Suzanne”; and\nWOSU, Ohio State University, for “Con¬\nrad Wei'ser, Master of Delay.”\nThe IERT, which sponsors the awards,\ndevoted its full effort to the awards this\nyear, since there was no spring meeting.\nCreated in 1930, the IERT’s annual meet¬\nings served as a meeting-ground for com¬\nmercial and noncommercial broadcasters\nduring a time when there were no formal\nmembership organizations in broadcasting.\nNow that many specialized groups have de¬\nveloped, the IERT’s national advisory com¬\nmittee has recommended that the IERT\nconcentrate on making the Ohio State\nAwards the most comprehensive evaluation\npossible of educational-informational pro¬\ngraming in broadcasting and other forms of\nelectronic program distribution.\nPierce Named Director of\nNew Education Commission\nWendell H. Pierce, superintendent of the\nCincinnati schools, has been named execu¬\ntive director of the Education Commission\nof the States. The Commission was es¬\ntablished recently by the Compact for Edu¬\ncation, and will meet in Chicago June 13-\n14 to discuss its initial study projects and\nto choose a permanent headquarters for the\nCompact.\nSeven delegates (normally including the\ngovernor, a state senator, a state assembly-\nman, and four top educators) from each\nmember state form the Commission.\nProposed study projects include financing\nelementary and secondary education, com¬\nmunity-centered education after high school,\nvocational and technical education, coor¬\ndinating state higher education systems, at¬\ntacking special problems of urban schools,\nimproving communications between educa¬\ntors and politicians and public, and the\nproblems resulting from consolidation of\nschool districts.\nNERN Stations Cover\nMET's Closing\nWBUR, Boston University, produced a\nspecial program for NERN distribution\ncovering the closing night of the Metropoli¬\ntan Opera in New York City April 16.\nWalter Slezak, who flew to New York\nfrom Switzerland for the closing, anchored\nthe program. WBUR is also producing a\ngrant-in-aid series for NER on the history\nof the Metropolitan Opera.\nMarie Speer to Leave ETS\nMarie Speer, assistant to the executive\ndirector of NAEB’s TV division, will leave\nJune 15 to join her husband in Guantanamo,\nCuba. She has been with the NAEB about\ntwto years.\nTurkish Radio-TV\nWants Tape Excerpts\nThe Turkish Radio and Television Or¬\nganization is launching a magazine type\nprogram covering subjects in social devel¬\nopments, arts, science, technology, educa¬\ntion, sports, amusement, medicine, human\ninterest. They would like to receive tape\nexcerpts and scripts from American broad¬\ncasters to use on the program. They would\nalso like recordings of sound effects and\nfolk songs and dances peculiar to this\ncountry. Write: Central Programing De¬\npartment, Mithat Pasa Cad. 47 Ankara,\nTurkey.\nSummer Workshops & Courses\nBoston U. July 11-August 20. 9th ITV\nsummer workshop. 6 graduate credits\nin either broadcasting or education.\nWrite: Dr. Murray Yaeger, School of\nPublic Communication, Boston U., 640\nCommonwealth Ave., Boston, Mass.\n02215.\nNezv York U. July 25-September 2. 9th\nsummer motion picture workshop. 8\ncredits, graduate or junior-senior level.\nWrite: Dept, of TV, Motion Pictures,\nand Radio, New York U., Washington\nSquare, New York, N.Y. 10003.\nNorthwestern U. June 20-July 30 and June\n20-August 13. Summer TV internships,\nETV-ITV, TV production, film, radio,\ngraduate research. Write: Dept, of\nRadio, TV, and Film, School of Speech,\nNorthwestern U., Evanston, Ill.\nStanford U. June 20-August 12. 24th radio-\nTV-film institute. Write: Dept, of\nCommunication, Stanford, Calif. 94305.\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 119 Gregory Hall,\nUrbana, III. 61803. $5.00 a year. Editor: Betty McKenzie.\nNAEB Headquarters: 1346 Connecticut Ave., N.W., Wash¬\nington, D.C., 20036. Phone 667-6000. Area Code 202. TWX 202-\n965-0299.\n2\nNEWSLETTER"
}