{
  "id": "d1861-2",
  "text": "American Baptist Radio-TV Awards\nAmong the categories for the 1963 American Baptist Radio-\nTV awards are: “To the individual(s) in broadcasting who\nhave been commendably instrumental in furthering Christian\noutreach by innovations in the use of the media, or by seeing\nthat the media are used more effectively than before” and\n“To the local radio or TV station which does an exemplary\njob of searching out community needs and problems and then\nproduces pertinent, balanced programming to meet them.”\nMarch 1 is the deadline for entries. For more information\nand entry blanks, write to 1963 Radio-TV Awards, Ameri¬\ncan Baptist Convention, 475 Riverside Drive, Room 1745,\nNew York 27.\nNews of Members\nPERSONNEL\n^ Larry Walcoff has left his position as program director\nat WSUI, Iowa City, to become assistant director of school\nservices for WQED-TV, Pittsburgh.\n^ Lindy Wade, formerly at UCLA, is now assistant in re¬\nsearch and publications for the Santa Clara County (Cali¬\nfornia) Office of Education.\n^ New additions to the staff of Michigan State’s WMSB\n(TV) : R. Bradley Cummings, film cameraman and editor,\nformerly with the University of Georgia Center of Continu¬\ning Education; Duane G. Straub, TV cameraman, formerly\nwith WTOL-TV, Toledo, and WOL-TV, Ames, Iowa;\nPatrick Siemon, TV cameraman, formerly student unit pro¬\nducer at WMSB; Hanley Michelson, director, formerly with\nWGTV, University of Georgia; and Mrs. Margaret Mc-\nCutcheon Lauterback, assistant to promotion director, for¬\nmerly with KOA, Denver, and KBOL, Boulder, Colorado.\n^ William H. Seibel, director of ITV, Temple University,\nwill conduct a European communications study tour this\nsummer. Under sponsorship of the U. S. National Student\nAssociation, the group will visit BBC studios, watch pro¬\nduction of ETV at Associated-Rediffusion, visit stations of\nRadiodiffusion-Television Francaise, visit headquarters of the\nItalian radio-TV system, observe operations of Italian ETV,\nvisit Austrian national TV and radio stations, visit studios\nof Radio Free Europe in Munich and the Munich station of\nVoice of America, and see the Brussels International TV\nControl Center of the European Broadcasting Union, which\ndirects all TV operations for Eurovision. Films and the\npress will be studied also, as well as radio and television.\n^ Vernon Bronson, NAEB’s director of special projects, will\npresent a paper on technology before the U.N. conference in\nGeneva, Switzerland, February 14-19.\n^ George L. Arms, who has spent the last two years in Ni¬\ngeria working on school programs and aiding with adult pro¬\ngrams (see NAEB Journal for March-April 1961, September-\nOctober 1961, and January-February 1963, for his experi¬\nences), is back in Nigeria on a new project. In a letter, he\ndescribes this as “helping to develop a substantial library of\nfilms, tapes, etc., of educational interest, for use on radio and\nTV stations in Nigeria, and backing them up with carefully\norganized teachers’ notes, pupil booklets . . . and hopefully\nto do some research on several of the techniques to see which\nworks best, and most economically . . .” Arms was formerly\noperations manager for KETC, St. Louis. The current proj¬\nect in Nigeria Is sponsored by the Agency for International\nDevelopment, for which Dick Rider is heading up the radio,\nTV, and audiovisual programs in Nigeria.\nGENERAL\n^ KUSD-TV, State University of South Dakota station, is\nnow transmitting from a new mast-mounted antenna recently\nplaced on the existing antenna tower. Studios and engineering\nspaces have recently been enlarged and remodeled.\n^ WWWS, East Carolina College, backed a UNICEF drive\nwith a College Radiothon. James Shuman, staff member,\nNAEB Headquarters: Suite 1119, 1346 Connecticut Avenue,\nN. W„ Washington 6, D. C. Phone 667-6000 Area Code 202.\nbroadcast for 36 hours continuously to boost college contri¬\nbutions ; the broadcast was climaxed by a dance sponsored by\nWWWS staffers.\ny This month the eight ERN stations begin broadcasting a\nRussian language course. The 40 half-hour programs will be\nbroadcast three times a week, and are being produced at\nWFCR-FM, Amherst, Massachusetts.\n^ “Jokelore of the Western World,” a program series pro¬\nduced by WUOT, University of Tennessee, will be broad¬\ncast in Turkey. The Turkish Embassy has accepted the pro¬\ngrams and will translate them into Turkish. The programs deal\nwith the first jokes ever told, and included among the first\ncomedians is Nasreddin Hojah, a Turk.\n^ WHA, University of Wisconsin, and WUOM, University\nof Michigan, are planning an experimental program exchange.\nWith Michigan’s relatively new WVGR (FM) in Grand\nRapids, it is hoped that rebroadcast difficulties can be over¬\ncome.\n^ On the day after President Kennedy’s speech to the nation\nregarding Cuba, Florida State University’s WFSU-TV gave\nits viewers a “Special Report on the Cuban Situation.” The\nstation provided a photo story of the background of the Cuban\nbuildup and steps taken by the U. S. since Castro; there\nwas also a special telephone report by a Miami correspond¬\nent—on the situation of the Cuban refugees.\n^ WHYY-FM, Philadelphia, after the President’s message,\npre-empted its scheduled programs and went on the air con¬\nsiderably earlier than its regular sign-on time, in order to re¬\nport up-to-the-minute U. N. proceedings and news com¬\nmentaries. Other ERN stations joined WHYY in carrying\nsome of these programs.\n^ Wisconsin teachers study ETV: At a state teachers’ con¬\nvention in November, ETV planning in Wisconsin was one of\nthe major topics for discussion; at a one-day conference of\nthe Southwestern Wisconsin Supervising Teachers Associa¬\ntion, the entire morning meeting was devoted to televised in¬\nstruction.\n^ A 12-page special section of The State and The Columbia\nRecord, Columbia, South Carolina, for Sunday, September\n23, was devoted to the state’s closed-circuit ETV network.\nOver half the section was devoted to ads tied in with the\nsubject of ETV. Among the articles were some under these\nheadlines: “How Will S. C. Meet Education Challenge?”\n“S. C. ETV Students Score at Top on National Tests,”\n“Large Staff Backs Up ETV Teacher at Studio,” “Classroom\nTeachers Are Key to Success of Teaching Team,” “Teacher\nShortage Turns Many Administrators to ETV,” and “Doc¬\ntors Go Back to Classrooms without Leaving Home Town.”\n^ By the end of this academic year, Ohio State University\nestimates enrollment in TV classes for credit there will reach\n17,500—some 2,000 more than last year. Major use of TV\nis to transmit lectures to large-enrollment courses such as\nmathematics, zoology, and health education- The lectures are\ntransmitted either via a nine-channel CCTV system, or over\nWOSU-TV. ITV activity keeps WOSU’s three videotape\nrecorders busy from 8 a.m. to 11 p.m.—sometimes longer.\n^ Syracuse University is slated to receive 15 million dollars\nfrom Mr. and Mrs. Samuel I. Newhouse for “the world’s\nlargest and most advanced” study center in mass communica¬\ntions.\n^ The Nebraska Council for ETV reports that more than 12\nper cent of that state’s school children are viewing educa¬\ntional telecasts produced by the Council; almost 20 per cent\nof the state’s elementary teachers are using ETV in their\nclassrooms.\n^ December 18 saw the first broadcast of the Alabama ETV\nnetwork’s new member, WAIQ-TV, Montgomery. This is\nthe state network’s fourth station, and the only UHF oper¬\nation.\n^ Last month Ampex announced a portable TV tape recorder\nl/20th the size and l/4th the cost of previous models. It oper¬\nates on household current, weighs 130 pounds, and is priced\nunder $12,000.\nJANUARY, 1963\n3"
}