{
  "id": "d1861-33",
  "text": "-35-\nThe first major production of the Louisiana Educational\nTelevision Comission was a series of six quarter-hour films\nfor television titled ,f You... And Your Income Tax,\" produced\nin cooperation with the U.S. Internal Revenue Service and\nLouisiana State University, Tulane University, Southwestern\nLouisiana Institute, and Northeast State College.\nThis series was designed to aid the taxpayer in filing\nhis annual income tax return but also served another Important\nfunction. It highlighted and gave a practical demonstration\nof one of the most vital Commission functions: producing a\nseries of programs drawing upon the resources of more than one\ninstitution and providing the necessary coordination and pro¬\nduction \"know-how.\"\nThe informal pattern of approach was used in order to at¬\ntempt to breathe as much life as possible into what can be a\nvery dull subject. The format consisted of a \"stooge\" visiting\nvarious professors of accounting, all of whom have private\npractices, to find out how to properly file his return. One\nof the \"experts\" was a professor of law and an attorney who\nspecialized in tax matters and who was one of the guiding mem¬\nbers of the Tulane Tax Institute.\nA new technique for presenting simulcasts is being ex¬\nplored by the Radio-Television Bureau of Arizona State Col¬\nlege at Tempe this semester.\n\"Ideas,\" a series of illustrated lectures by top faculty\nmembers at the College, is presented on KPHO-TV, Channel 5 in\nPhoenix, each Sunday at 4:00 p.m. During the week prior to\neach program, a special rehearsal is held in the College’s\nradio studios, and the rehearsal is recorded.\nDuring this rehearsal, no reference is made to visual\nmaterial; only the verbal part of the program is recorded for\nradio presentation, with appropriate opening and closing,\nover KPHO Radio.\nFollowing the recording, the visual elements of the tele¬\nvision program are added and prepared for showing. In this way,\nmuch of the preparation of the program can go into both a radio\nand television series, but special versions are prepared for\neach medium, meeting the different requirements."
}