{
  "id": "d956-129",
  "text": "University of Minnesota\nGeneral Extension Division\nMinneapolis 14\nRadio Station KUOM\n770 ON YOUR DIAL\n30 September 1952\nMr* Gray don Ausmus\nWUQA, University of Alabama\nUniversity of Alabama\nDear Graydon:\nI nave your letter of September 22 relative to Wynn and the others*\nWhen I was in New York last week I checked with Warren Bower. He would not\nbe interested in the position. Upon thinking the matter over carefully, I am\ninclined to suggest that we not consider the other candidate whom I was supposed\nto investigate, That means that the two names on ray list may be crossed off.\nI think we ought to meet the candidates prior to the convention. There will\nbe enough things to do at the convention without getting mixed up with that, too.\nI say that in spite of the fact tnat I am extremely reluctant to travel anywhere\nat this points our tremendous television developments here at the University of\nMinnesota, preparation for the convention, and the other projects that I have to\ntake care of, have just swamped me. However, if worse comes to worse, I might be\nable to run down to Chicago for a day’s session.\nI have a tentative commitment for October 11-15 but could arrange a day in\nChicago on the 18th if necessary. And in a pinch I might be able to come down for\nthe 11th or 12th although I should very much rather not.\nIn this connection may I repeat the proposal which I threw out in Urbana:\nthat we meet in some place like Chicago or Detroit rather than in a spot like ^ast\nLansing or Urbana. It takes almost an extra day to go and come from planes like\nMichigan State or the University of Illinois on account of the need to change\ntransportation and the difficulty of obtaining direct connections. But if we meet\nin Chicago, for example,-- which would be ray first choice — we could all reach it\nin a hurry.\nI was in New York for a couple of days last week and talked to Sy to bring\nhim up to date on NAEB developments. I was not quite clear in my own mind about\nthe projected meeting of the Board of Directors and the Adult Education Committee\non November 2, 3 and U# Would you write to him to give him the dope so we can\nmake our plans? It is important that I know about this as soon as possible so\nthat I may reserve rooms for the group here.\nI trust you television plans are developing well in Alabama. Ours are doing\nvery well here right now.\nWith best personal regards.\nBP:CJM\nBurton Paulu\nManager"
}