{
  "id": "d956-159",
  "text": "RADIO STATIONS\nAM\n64O KILOCYCLES\nFM\n9O.9 MEGACYCLES\nTHE UNIVERSITY OF OKLAHOMA\nNORMAN• OKLAHOMA\nAug. 30, 1952\nDear Graydon:\nEver since Ames, I've been pondering the problems we raised regarding the\nposition of Executive Director but not getting too far. Let me say that I\nthink you've done an excellent job in presenting the problem to the Board.\nEven the honorable Mr. Paulu couldn’t have done better.\nThe qualifications which have been set up for the Executive Directorship\nare high, so high that I doubt seriously if we can get anyone to fill the\nposition. Frankly, I don't know of anyone of that caliber who'd be inter¬\nested in the place. George Probst (even though I don’t always agree with\nhim) might do; Russell Porter was mentioned. I haven't had any contacts\nwith Porter in several years. I think he'd be a good prospect. Neither of\nthese measure up to the high qualifications we've set, but they approach.\nI'm wondering if Probst would be acceptable to Kellogg?\nSuppose we do find someone (Porter & Probst excepted) who is acceptable.\nOur present criteria regarding relationship of Executive Director & Board\nof Diredtors would need overhauling. To begin with, I'm wondering if a\nhigh-powered man would be interested in routine matters; on the other hand,\nwould we want him to fool around with membership 3-ists , etc. when he might\nbe tackling bigger problems and jousting with the windmills of industry\nand high finance.\nActually our present rules call more for an Executive Secretary, perform¬\ning, in the main, routine duties which are rather well defined. If we\nacquire this Olympian character, we must broaden the duties, powers and\nresponsibilities of the position. Some people might think this is already\nso (Waldo's memo), but actually it is not the case. These changes should\nbe made before any contact is made so that we can spell out in 1,2,3 fashion\njust what the guy must expect. Certainly, we should not be indefinite. In\na way, that's where a lot of our trouble has been.We should be able to make\nquite clear What his duties and responsbilitie3 are* We should be explicit\nin this matter of final Board approval on all matters involving policy.\nEven Scott Fletcher recognizes that this is a MUST in his relationship with\nhis own board.\nIf this post is to be more of an Executive Secretary, then I believe Irving\nMerrill might be as acceptable as anyone. Irv has grown up considerably,\nhas an abundance of energy and drive, is young and free for the moment,\nknows educational broadcasting and operations and what's more important is\nacquainted with the majority of NAEB members.\nAs ever.\nJohn W. Dunn"
}