{
  "id": "d956-189",
  "text": "UNIVERSITY OF ILLINOIS • DIVISION OF COMMUNICATIONS • URBANA\nOffice of the Dean\nMessrs, Seymour N. Siegels August 6, 1952\nGraydon Ausinus\nFrank E. Schooley\nBurton Paulu\nParker Wheatley CONFIDENTIAL\nAlvin Gaines\nWaldo Abbot\nRichard B. Hull\nJohn Dunn\nAllen Miller\nGentlemen:\nI hope you will forgive me for communicating with the whole NAEB\nboard, I am doing it to save as much time as possible. Time is of the\nessence, for Jim Miles* president insists that Jim come back to Purdue by\nNovember 15.\nThis is a body blow, because it comes awfully late in the summer,\nafter many persons have made firm plans for the fall, and also because it\ncomes at an extremely bad time for our relations with the Kellogg Foundation.\nI*m sure I don*t have to tell you that the Foundation was very much worried\nafter our board meeting at Battle Creek, and when Jim and I were summoned up\nthere to present the formal report and request for the second year we got a\nsevere grilling. I don*t like to have these delicate relations further\nstrained by a change in directors.\nIt does no good to say that it would have helped if President\nHovde had told Jim this last April, when he assured Jim a second year*s leave.\nThe point is, it has happened, and we have to repair the damage as best we can.\nAs I see it,\n(1) We*ve got to move fast. We can’t afford now, as we did before,\nto spend several months looking for a director. Especially if we get an\nacademic person, we have to get him before the academic year starts. Whoever\nwe get, we have to get him in here, or on a Ford fellowship, for a month or\ntwo before Jim leaves, so he catches on to what happens in this operation.\n(2) We’ve got to get a man for the next four years — if we want to\nkeep Kellogg interested. Kellogg is extremely allergic to changes in directors\nIf we propose a new director for one year, I think we’ll lose our grant. On\nthe other hand, if we tell Masters that we have to face the loss of Jim some¬\ntime anyway, and by changing now we can get continuity — supposing, of course,\nthe new man works out all right — for the rest of the project time, then we\nhave a pretty good case.\n(3) When we know our man, we have to present this matter very care¬\nfully to the Kellogg people. I’ll try to guide you from my experience with\nthem, but please don’t throw me to the dogs as you did last May in Battle Creek"
}