{
  "id": "d956-61",
  "text": "Th® tine from Ton’s divorce through his leaving\nHadio House was one of great ©notional upheaval.\nPerhaps mar® so for him than it would have been\nfor a man of lesser stature. But at no time when\n©rials seemed to be surmounted only by crisis, did\nTom Hlshworth loose sight of, or neglect his duty\nto Radio House and to Educational Hadio. At no times\ndid Ills personal problem fog his thinking about the\nJobs at hand. I know. I was there. I directed him\nin a show the day he announced quietly to the staff\nthat he and Jan© wore getting a divorce. I did a\nremote broadcast with him the day after the President’s\noffice informed Tom that he \"was under invest igatioti.tt\nChock with Ha rye Benjamin as to Toa’s carrying out of\nduties up to the time of his leaving. Check with Al\nJohnson, of the TJ. T. 3rarm Department. (Chock\nvitfo. Bill Cavncss, another script writer there. Ask\nDr, 33* ?* .Conklo or Tom Hppmi If the Radio Committee\nwas dissatisfied with the calibre of Tories work. Ask\nany psychiatrist how much groundless, personal slander\nany on© man can stand before his own judgment takes\nhim to another place.\nA£ the time of Tom’a leaving ho had promised Hugh\nProcter, Texas Education Agency, six additional shows\nin the Hadio House ©erics \"Is Anybody Home.\" A lesser\nman would hav© turned the remaining six shows back\ninto tii© Radio House hopper. Tom promised Procter\ntn&t since his voice was on the first six tapes, he\nwould, m soon as he obtained tape equipment, record\nth© final six shows. Tills lie did at Interlochen.\nTam kept Ms promise, prompted by his belief In the\nthings ho had built at Hadio House, and Procter re¬\nceived the show© well ahead of air tine.\nI cite this to further my point that emotional upheavals\nhave not Impaired Tow Hlshworth’a capability. Tom’s\ncapability stems from a thorough knowledge of the\ntools of radio AMD from a deep and sincere belief in\nradio as a social and educational force. Tom’s nersonal\nproblems arc Ms own, but they will never overshadow\nhis ability, faith, and vigor for hie chosen field.\nAsk any of us who -have been close enough to Tom to\nknow.\nSincerely,\nH. C* Morris"
}