{
  "id": "d913-107",
  "text": "DEM0N8TRIITI0N KITS-\nFOR UTILIZm INSTRUCTIOHAL TELEVISlOH\nPurpose of Kits\nTo provide a coordinated series of demonstration kits to assist teachers and broadcasters\nin developing effective patterns of instructional television utilization in elementary\nand secondary classrooms.\nHow You Can Use These Kits\nThesekits have been designed for group use in teacher's meetings, workshops, seminars,\nand university education classes. Each kit contains afilm and a teacher's manual. Al¬\nthough each kit is self-sufficient and may be used individually, the materials have been\ndesigned as a coordinated whole. It is recommended that the kitsbe usedin sequence.\nKits Availabie April 1, 1965\nTwo kits covering different aspects of television utilization will be available for distribution April 1, 1965.\nWhen complete, the series will consist of six kits. As additional kits are produced, they will be added to the\nservice. The kits released as of April 1, 1965, are:\nKit ^\nKit 5\nPreparing the\nTelevision Lesson\nA Case Study in the\nElementary School\nThe film in this kit traces the preparation of an in¬\nstructional television science lesson for the upper\nprimary or lower intermediate grades. It demon¬\nstrates the steps involved in the production of a\nprogram, the amount of time and care given to\nmake this a lesson which can be utilized effectively\nin the classroom.\nThe film in this kit shows how one sixth-grade\nteacher used a television lesson on oceanography\nto reinforce important science concepts, to intro¬\nduce a broader area of understanding and to\nstimulate group and individual activities appro¬\npriate to the needs and interests of her particular\nclass.\nThe Film\nEach kit contains a 16 mm color sound film approximately\n28 minutes in length. While the films make a complete\npresentation, they are intended to be used in conjunction\nwith correlated group activities.\nService Charge\nThere will be a $5.00 Service Charge for each kit which\nyou will keep for a minimum of three days. Arrangements\nmay be made to use the kits longer. However, an additional\nfee of 50 cents per day will be charged.\nThe Manual\nThe teacher's manual contains information for both kits.\nIt details how the films can be used and provides supple¬\nmentary information for the group meetings. A copy of the\nmanual will besent to you at least two weeks prior to your\nuse of the first kit so that you will have time to plan the\nteaching lessons. The manual will be returned with the\nkits. However, if you wish to retain the teacher's manual\nfor your library, it may be purchased for $2.50.\nThis project sponsored by The National Association of\nEducational Broadcasters under a contract with the United\nStates Office of Education, Department of Health, Edu¬\ncation and Welfare.\nHow to Obtain\nThere will be a limited number of copies of these kits a-\nvailable. The earliest orders received will be booked\nfirst. Place yourorders as far ahead as possible, and wher¬\never possible, give at leastone alternative date. The kits\nwill be sent prepaid, insured and are to be returned the\nsame way. To order, write or call:\nNAEB Teaching Materials Library\nVo K FM E-TV/Channel 13\nHighway 81 South\nFargo, North Dakota 58101\nArea Code 701 232-8921"
}