{
  "id": "d1593-0",
  "text": "NAEB NEWS LETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROAOCASTERS\nFrank E0 Schooley, Editor, Station WILL, Urbana, 111,\nJuly I, 1944\nSUPPLEMENTS\nWith this issue you’ll find two supplements* One, a listing of our\nMEMBERSHIP AS OF JULY I* And, TWO, A QUESTIONNAIRE FOR YOU TO FILL OUT\nFOR THE GUIDANCE OF THE EXECUTIVE COMMITTEE IN SETTING TIME AND PLACE\nFOR THE FALL NAEB CONVENTION.\nHAVE YOU SEEN WISCONSIN BULLETIN?\nI think H. 8* McCarty has sent all NAEB members a copy of his \"Bulletin\nof the University of Wisconsin Radio Education.\" If you haven’t seen\nit, write to Mac and he’ll be glad to send you a copy.\nFUTURE NAEB PACKETS\nThe NAEBers meeting in Columbus approved the suggestion of the Executive\nSecretary to cut down the amount of mailing in the NAEB packets. You\nCAN HELP BY USING THE SUPPLEMENTAL LIST OF MEMBERS AND ADDING NAMES TO\nYOUR OWN MAILING LIST. We®LL CONTINUE TO GIVE SERVICE ON SPECIAL\nPUBLICATIONS BUT * T1S AGREED THAT DIRECT MAILING WILL ACTUALLY GIVE\nBETTER SERVICE IN MOST CASES.\nTHE WILL ANNUAL REPORT\nYOU MAY BE INTERESTED IN READING THE WILL ANNUAL REPORT, WHICH JOE WRIGHT\nHAS JUST SUBMITTED TO HIS PRESIDENT. A COPY IS ENCLOSED FOR YOU. OTHERS\nOF NAEB STATIONS WILL BE DISTRIBUTED WHEN YOU SUPPLY THEM. Or, YOU MAY\nMAIL THEM DIRECT.\nHOW ABOUT SOME CQNTR18S?\nDid you ever spend your Fourth of July holiday doing the NAEB work?\nTry IT SOMETIME AND YOU’LL FIND HOW MUCH WORK IS INVOLVED WHEN SO FEW\nOF THE MEMBERS CONTRIBUTE ANYTHING FOR OUR News LETTER. HOW ABOUT AN\nARTICLE FROM GLENN JONES OR ELDON BaRR OF KWSC? Or, A NOTE FROM ALLEN\nMiller? Tom Johnston of PurdueI1 Harry Skornia of Indiana? E.W.Ziebarth\nof Minnesota? Virginia Hawk of /INAD? Mildred Seaman or Harold Ingham\nOF KFKU? Or, any OF YOU?\nCOUNCIL ON RADIO JOURNALISM\nRepresentatives of the National Association of Broadcasters and the\nAmerican Association of Schools and Departments of Journalism have held\na preliminary meeting to plan formation of a Council for Raoio Journalism.\nShall NAEB seek representation on the Council? Some of the NAEB stations\nWILL FIND THEMSELVES REPRESENTED INDIRECTLY IN THE PRELIMINARY WORK, WITH\nJournalism faculty from Indiana, Minnesota, Iowa State, Iowa, and Illinois\nin attendance."
}