{
  "id": "d1593-1",
  "text": "The Institute for Education by Radio was established in 1930 at the Ohio\nState University. Its purpose is to provide an annual meeting for joint discussion\nby broadcasters, educators and civic leaders of the problems of educational broad¬\ncasting. The program is devoted chiefly to consideration of the techniques and pro¬\ngram policies of radio broadcasting. The Institute passes no resolutions, and its\nofficers are limited to an honorary director, W. W. Charters, founder of the Insti¬\ntute; a director, I. Keith Tyler, Director of Radio Education; and an executive\nsecretary, Ardis Hillman Wheeler, both of the Ohio State University. The annual\nprogram is developed from the suggestions and recommendations of those attending\nthe Institute in previous years. The committee on the 1946 program consists of the\nInstitute officers with the addition of William H. Ewing, Program Supervisor,\nStation WOSU; Howard Donahoe, Program Director, Station WCOL; Irwin A.\nJohnson, Director of Developmental Programs, Station WBNS; and John Moses,\nProduction Manager, Station WHKC—representing Columbus radio stations; and\nT. C. Holy, Director, Bureau of Educational Research; Herschel Nisonger, Chair¬\nman, University Radio Education Committee; and W. Hayes Yeager, Chairman,\nDepartment of Speech—representing the Ohio State University.\nTwo groups of Institute judges have given much time and effort in the final\njudging for the Tenth American Exhibition of Educational Radio Programs. One\ngroup, divided into twelve sub-committees, has been completely responsible for all\nnational network programs, which were judged “live” in New York. James\nMacandrew, Coordinator of Programs, Station WNYE, New York City Board of\nEducation, has acted as coordinator and Institute representative in New York for\nthis evaluation procedure. Another group has met in Columbus just preceding the\nInstitute to hear the programs from stations, regional networks and organizations,\nwhich were sifted by preliminary screening committees. This group consists of\nCharles F. Church, Director of Education, Station KMBC, Kansas City, Missouri;\nMitchell Grayson, Free-Lance Producer, New York City; and Ruth Weir Miller,\nPhiladelphia Public Schools. Grateful acknowledgment is made to all these out¬\nstanding persons for their gracious service to the advancement of radio education.\nThe Institute expresses its deep appreciation to:\nThe General Women’s Committee of the Institute, which is responsible for\ngeneral hospitality, and particularly for the arrangements at the Newcomers Recep¬\ntion and the Annual Dinner. This committee consists of the following: Mrs.\nFrank J. Lausche, honorary chairman; Rhea McCarty, AWD Past Treasurer, chair¬\nman.; Mrs. Howard L. Bevis, vice-chairman; Mrs. John W. Bricker; Mrs. Howard\nStenzel, President, Columbus AAUW; and Mrs. Herman Hoster, President,\nColumbus Junior League.\nThe Women’s Station-Relations Committee of the Institute, which is responsible\nfor general liaison with Columbus radio stations, for all local arrangements on\nbehalf of the Association of Women Directors, and for hospitality to the women\nrepresenting other radio stations. The committee consists of the following: Fern\nSharp, Station WBNS, chairman; Kay Keltner, Station WCOL; Rita Thomas,\nStation WHKC; and Miriam Foltz, Station WOSU.\nMr. Robert C. Higgy, Director of Station WOSU, for taking charge of technical\nequipment arrangements.\nThe staff members of the Department of Spech, Ohio State University, for\nassistance in general hospitality.\nThe staff of the Ohio State Lantern for assistance in press coverage at the time\nof the conference;\nThe students of the South High School Radio Workshop, Columbus, and\nstudents of Ohio State University for assistance in admissions, ushering, etc."
}