{
  "id": "d1593-12",
  "text": "SATURDAY EVENING\nBroadcasting by Local Youth Organizations\n8:00 p. m.. Red Room, Neil House\nChairman, Elizabeth M. McStea, Director, Department of Public Relations, Camp\nFire Girls, Inc.\nTopics\nHow Can Radio Assist Youth Organizations in Realizing Their Objectives?\nHow Are Youth Agencies Utilizing Radio as a Public Relations Technique or as\na Publicity Tool?\nWhat Methods Are Used by Youth Agencies through Radio to Point Up Their\nEducational-Recreational Program ?\nCan You Educate the Community to Encourage Youth Programs?\nWhat Production Assistance Can Youth Agencies Expect from Radio Stations?\nWhat Are Youth Agencies Doing to Meet the Standards of Radio Broadcasters?\nAre Youth Agencies Utilizing the Resources of the Community in Their Radio\nPrograms?\nWhat Type of Youth Programs Has Been Most Successful at the Local Level?\nIs It Advantageous for Youth Organizations to Pool Their Resources Periodically\nby Conducting Joint Radio Programs?\nParticipants\nDorothy Gordon, Moderator of Youth Forums, The New Yor% Times, Discussion Leader\nMeyer Bass, Director of Youth Service, National Jewish Welfare Board\nL. R. Bucher, Scout Executive, Boy Scouts of America, Columbus\nJesse Butcher, Director of Radio, United Service Organizations\nCharlotte Demorest, Secretary for Radio, Federation of Protestant Welfare Agencies\nRussell Elliot, Director of Public Relations, Young Men’s Christian Association, Detroit\nW. H. Ewing, Program Supervisor, Station WOSU, Ohio State University\nIrwin Johnson, Director of Developmental Programs, Station WBNS, Columbus\nFlorence Jones, Radio Consultant, Girl Scouts, Norwalk, Connecticut\nMax Karl, Director of Public Service, Station WTCN, Minneapolis\nCatherine Klumph, Instructor in Radio Writing, Syracuse University\nEverette Lande, Radio Instructor, Chicago Boys’ Clubs\nEloise Walton, Public Relations Associate, Community Chests and Councils\nDorothy M. Yontz, Radio Chairman, Camp Fire Girls, Inc., Columbus\nRadio and the Negro\n8:00 p. m.. Parlors H# I, J, Deshler\nChairman, Anne M. Cooke, Howard University, Washington, D. C.\nTopics\nAttitudes of Unions and Guilds toward Negroes in Radio\nExisting Programs Designed to Increase Democratic Attitudes and Behaviour\nProblems to be Faced in Effecting Similar Programs\nRadio Programs Which Do Not Encourage Good Intercultural Relations\nParticipants\nGertrude Broderick, Federal Radio Education Committee, United States Office of Education\nOwen Dodson, American Film Center, New York\nAbram Hill, Director, American Negro Theater\nB. A. Jones, Professor of Social Science, Talladega College\nWalter N. Ridley, President, American Teachers Association\nWilliam H. Tymous, Secretary, Washington Veterans’ Congress\nSidney Williams, Secretary, Cleveland Urban League"
}