{
  "id": "d1593-13",
  "text": "SATURDAY EVENING\nProblems of Radio Production\nArranged by Radio Directors’ Guild\n8:00 p. m.. Hall of Mirrors, Deshler\nChairman, Anton M. Leader, Vice-President, Radio Directors’ Guild\nParticipants\nR. Verle Johnson, In Charge of Radio Production, Texas Forest Service\nEarle McGill, Free Lance Director, New York City\nWilbur B. Stark, Station WMCA, New York City; and Director, ALS Production\nPublic Health Broadcasts\n8:00 p. m.. Room 1540, Deshler\nChairman, Dr. W. W. Bauer, Director, Bureau of Health Education, American\nMedical Association\nT opics\nWhen and Why Can Radio Be a Valuable Medium in Health Education?\nWho Should Originate Health Education Broadcasts?\nWhat Type of Program Is Most Effective?\nComparative Values of Live Programs and Transcriptions\nWhere and When Should Health Education Programs Be Spotted?\nHow Can Effectiveness Be Evaluated?\nParticipants\nGerald A. Bartell, Production Director, Station WHA, University of Wisconsin\nHomer N. Calver, Secretary, The Public Health Committee of the Paper Cup and Container\nInstitute, New York\nMary P. Connolly, Resident Lecturer, University of Michigan School of Public Health\nDr. Bruno Gebhard, Director, Cleveland Health Museum\nHarriet H. Hester, Free-Lance Writer, Chicago\nRobert Hudson, Associate Director of Education, Columbia Broadcasting System\nEllen Lovell, Director, Public Relaiotns, National Tuberculosis Association\nKenneth R. Miller, Director, Public Information Service, American Social Hygiene Associa¬\ntion\nDr. Lon W. Morrey, Director, Bureau of Public Relations, American Dental Association\nLuke L. Roberts, Educational Director, Station KOIN, Portland\nRobert Saudek, Director of Public Service, American Broadcasting Company\nMuriel F. Steward, Director of Health Education, Hennepin County Tuberculosis Associa¬\ntion, Minneapolis\nMrs. Nathan Straus, Director of Educational Programs, Station WMCA, New York\nJudith Waller, Public Service Director, National Broadcasting Company, Chicago\nDr. Carl A. Wilzbach, Health Commissioner, Cincinnati\nDr. Clark H. Yeager, Chief, Medical Section, The Institute of Inter-American Affairs\nSavel Zimand, Executive Director, New York City Cancer Committee\nM"
}