{
  "id": "d1593-14",
  "text": "SATURDAY EVENING\nRadio and Veteran Rehabilitation\n8:00 p. m.. Room 1440, Deshler\nChairman, Robert P. Heller, Producer of Assignment Home, Columbia Broadcast¬\ning System\nParticipants\nJoseph Brechner, Director of Radio, Veterans’ Administration\nLenard Kaufman, Director of Public Relations, New York City Veterans’ Service Center\nTy Krum, Producer, National Broadcasting Company\nWomen's Programs\nProgram Arranged by Association of Women Directors, NAB,\nin Cooperation with Radio Service, USDA\n8:00 p. m.. Ballroom, Deshler\nChairman, Alma Kitchell, Station WJZ, New York; President, Association of\nWomen Directors\nTheme, Radio’s Role on the Food Front\nSpeakers\nChester Davis, Organizing Chairman, Famine Emergency Committee; and President, Federal\nReserve Bank, St. Louis\nPaul S. Willis, President, Grocery Manufacturers of America, Inc.\nPanel Participants\nMildred Bailey, Vice-President, Association uf Women Directors; and Director, Food Is Fun,\nStation WCOP, Boston\nMary I. Barber, Kellogg Company, Battle Creek\nBeulah Karney, What’s Cookin’?, Station WENR, Chicago\nMarjorie Husted, Director of Betty Crocker Program, General Mills, Inc., Minneapolis\nJane Tiffany Wagner, Director, Home Is What You Make It, NBC University of the Air,\nNational Broadcasting Company\nSUNDAY MORNING\nSunday, May 5\nThe entire Sunday schedule of the Institute has had to be arranged\nin terms of the current time situation because of network originations.\nNetworks are operating on Eastern Daylight Saving Time, and local\nColumbus time is Eastern Standard.\nInstitute members should note that the work-study groups are sched¬\nuled at 9:00 a. m. promptly. Time for a sandwich and a cup of coffee is\nprovided from approximately 11:30 until the noon session, which is\nscheduled at 11:55. The noon session should be over by 2:15 p. m.,\nwhich allows time for late luncheon. Since the Institute dinner is set\nat 7:30 p. m., this schedule, though rugged, should not be too great a\nhardship for sturdy Institute members."
}