{
  "id": "d1593-21",
  "text": "MONDAY MORNING\nRadio Critics Talk to Program Directors!\n9:30 a. m., Parlor H, Deshler\nChairman, Robert K. Richards, Editorial Director, Broadcasting Magazine\nPanel Participants\nWilliam Cline, Assistant Manager, Station WLS, Chicago\nBetty Forsling, Radio Editor, Newsweek Magazine\nThomas C. McCray, Eastern Program Manager, National Broadcasting Company\nRobert Stephan, Radio Editor, Cleveland Plain Dealer\nWhat Services Can Foreign Information Centers Render\nto American Radio?\n9:30 a. m.. Room 1440, Deshler\nChairman, John Rennie, Director of Press and Radio, British Information Services\nPanel Participants\nJean Clos, Production Manager, Station WHAS, Louisville\nTed Cott, Program Manager, Station WNEW, New York City\nEmory Ellis, Director of Radio, Netherlands Information Bureau\nFrank Nipp, Director of Radio, Chinese Ministry of Information\nRadio and Adult Education\n9:30 a. m.. Parlor J, Deshler\nChairman, Herschel Nisonger, Acting Director, Bureau of Special and Adult\nEducation, Ohio State University\nPanel Participants\nP. H. Frederick Chao, Representative, Chinese Association of Adult Education\nHarold A. Engel, Assistant Director, Station WHA, University of Wisconsin\nWilliam Ewing, Program Supervisor, Station WOSU, Ohio State University\nMrs. Homer E. Frye, Director, Columbus Town Meeting\nKelsey B. Sweatt, Superintendent of Public Education, Massachusetts Department of Edu¬\ncation\nSocial Responsibility of Radio Public Relations\n9:30 a. m.. Room 1337, Deshler\nChairman, Christopher Cross, Liaison Officer, American Broadcasters and Radio\nPress Informtaion Department, United Nations\nParticipants\nWilliam J. Barlow, Publicity Director, Station WLW, Cincinnati\nGeorge Crandall, Publicity Director, Columbia Broadcasting System\nLen Decaux, Public Relations Director, CIO\nSydney Eiges, Publicity Director, National Broadcasting Company\nMark Haas, Publicity Director, Station WJR, Detroit\nDavid Heffernan, First Assistant Superintendent of Schools, Cook County, Illinois\nJohnny Johnstone, Radio Director, National Association of Manufacturers\nE. M. Kirby, Public Relations, National Association of Broadcasters\nEarl Mullin, Publicity Director, American Broadcasting Company\nJim O’Bryon, Publicity Director, Mutual Broadcasting System\nJo Ranson, Publicity Director, Station WHN, New York City\nSam Serota, Educational Director, Station WIP, Philadelphia\n22"
}