{
  "id": "d1569-0",
  "text": "NEWS NAEB GETTER\nNATIONAL ASSOCIATION » EDUCATIONAL BROADCASTERS\nFrank E. Schooley, Editor, Station WILL, Urbana, Illinois\nMarch 1, 1943\nWORD FROM ENGEL\nThe Executive Secretary has received a letter from Harold Engels retired\nNAEB president, and there now follows an expurgated editions\n* No, your truly hasnH fallen off the earth « or been sent to Australia -\nyetc I have been pretty busy - and have neglected my correspondence - no\napologies or excuses*\nI0 ve missed the contact with NAEB* Mow is It going? Why not send me a News\nLetter once in a while - to the above address? You must be carrying on in\ngood shape - with plenty of war-time problems to solve*\nAfter finishing an orientation (refresher, they called it) course at Camp\nCallan, California I was shipped up the coast to Seattle early in January*\nMy first assignment was to a search-light battery in the hills south of the\ncity - a part of the outer circle of defenses* That really was rugged\nservice* I nearly froze to death in that cold spell we had* The Californal-\nto-Washingt©n contract was hard to take* After that I went up to radar\nschool at Paine Field (and those radio plane detectors are as close as I ve\ncome to ladll)* When I got back from there I was assigned as Special Ser¬\nvice Officer for the 313th Regiment CA, and am now stationed in the city of\nSeattle* This is a very interesting job and the kind of thing I ye wen*®J\nto do* I handle social events, athletics, recreation, educational activities\nand morale for the solders* There is never an end to the work, but that\nhelps to keen it interesting* We cover the city from end to end* Before\nlong I®11 know the town and its activities hotter than the natives do*\"\nHarold0 s address is 1st* L*8* Harold A* Engel, Hg* 212th C«A* (AA), Seattle,\nWashington* I0m sure he9 d be glad to have a word from you*\nNAEB MEETS IN COLUMBUS ON MAY 1\nActing NAEB president, Gilbert (Gibbs) Williams, WBAA, has called a meeting\nof NAEB for the evening of Saturday, May 1, in Columbus, Ohio. *he meeting\nis scheduled jointly with the Institute for Education by Radio whioh will\nbe held by Ohio State University, April 30 through May 3*\nIt has been suggested that NAEB arrange an additional session, perhaps\nSaturday afternoon, on the same date and dispense with the annual Fall\nmeeting of NAEB* Matter is being referred to Executive Committee* If you hawa\nany suggestions, fire away* In the meantim®, Vd suggest you plan on getting\nto Columbus, especially in view of probably cancellation of our Fall meeting®"
}