{
  "id": "d1569-1",
  "text": "NAEB NEtfS LETTER*..\nHERE* 9 MOTHER QUESTION\nPage 2\nMarch I, 1943\nHow do you feel abour soap operas? Are you using them on your station?\nIf you have used them, do your listeners like them? Has it improved or\nlowered quality of your programs?\nANOTHER SCRIPT FOR EXCHANGE\n\"Rendezvous with Destiny\" a dandy dramatic oroduction written and produced\nfor WNYC, New York City, has been submitted to the NAEB script exchange\nand is now available* to any or all of our non-commerolal stations* Thanks,\nNoviko\n\"BOOKS AND AUTHORS\" SCRIPTS AVAILABLE\nThe Bock-of-tfce-Honth Club has announoed that it weekly radio script,\nBOOKS AND AUTHORS, is available without charge- to directors of college and\nuniversity radio stations and to instructors in courses in radio and speech*\nBOOKS AND AUTHORS is designed to offer a complete fifteen-minute book program\nand presents a panorama of news and reviews ol representative new books\nin varied fields*\nThe script will be sent upon request, and there is no obligation* Those\nwho write In to ask for the script regularly should address thtlT xe^ieetB\ndirectly to the Educational Department, Book~of~the«Month Club, 385 Mad¬\nison Avenue, New York City*\nWQ3U BROADCASTS N&Y3 FOR CHILDREN\nIf you8 re interested in a different kind of news broadcast, tune in HCSU'\nOhio State University, any Thursday at 1*45 Ucra* CWT* You will hear a news\nbroadcast for children — but one which attracts an ever-increasing number\nof adult listeners* The broadcaster is C«W* Pettegrew, WOSU program direc¬\ntor, who had his own son Ronnie in mind when he started the weekly program\n18 months ago*\nPettegrew gives the younger generation — youngsters of the fourth, fifth,\nand sixth grades especially — credit for plenty of Intelligence. He wades\nright into such complicated subjects as manpower, taxes, the India problem,\nthe war budget, women in the war, tactics and j.ogistlcs*\nThe Ohio State broadcaster knows he has a large audience* Recently he made\na sisjsgS announcement, buried in the news program, offering a free war\nmapo In the next few days he received 2300 pieces of mail, many of them\nmultiple requests for sohool classes of 30 or moreraerabers*\nwJOURNEYS BEHIND THE NE\\?3W ON W H C U\nWHCU, Cornell, has Inaugurated a weekly 15-mlnute programfor ln-school\nIt lntfSret; for the younger minds. In simple, undefendable terms,"
}