{
  "id": "d1755-2",
  "text": "BROADCASTING: A GILT-EDGE FIELD OF EMPLOYMENT\nWHAT MAKES A JOB A GOOD JOBf\nThe worker Has many wants to satisfy In relation to his Job. Some are real; some ar<.\nimaginary; some are conscious; some are so vague that be can' t clearly define them bimself.\nTo the fellow who gets low wages, a good job is one which pays well. To the worker\nwho worries about layoffs and unemployment, a good job is one which offers security. To\nthe employee who suffers personal indignities at the hands of his supervisors, a good job\nis one where people are treated in a friendly, human fashion. To those who render loyal,\nefficient service which goes unnoticed by management, a good job offers recognition and\nrewards to those who deserve them. To the man performing a routine, repetitious task, a\ngood Job is one which offers opportunities for personal advancement and tfilch gives the work¬\ner a sense of pride in his accomplishments.\nTo different persons, a -good* Job means different things. There Is no 100% standard\nby which we can measure -degrees of Job satisfaction- for everyone. Even If this were pos¬\nsible, employees, being human, would still look longingly at the grass In some other fellow\",\nyard.\nBut, in all fairness to thanselves, employees should ask themselves at least two ques¬\ntions:\n(1) Sow do our jobs stack up with those held by our friends and acquaintances and with\nthose we know about in other companies and industries?\n(2) Do our jobs produce a sense of personal satisfaction?\nRADIO JOBS ARE GOOD JOBS\nIt would be silly to say that broadcasting is, for all people, an ideal place to work\nor that everyone in radio has a fine Job.\nBut, If you take an overall audit of the radio Industry, you will find much to Justify\nthe conclusion that -Broadcasting Is a ollt-Edge Field of Employment-, some basic facts to\nsupport this contention are:\n(1) From 1937 to 1947, total wage payrolls of full-time employees in radio increased\n217% whereas an increase of only 135% took place in industry os a whole.\n(2) Average annual and weekly incone per radio enployee is the second highest (now\nprobably the highest) of any industry in the tation. In 1846, the average annual\nearnings for all full-time radio employees (Including free-lance talent and other\nnetwork talent) were $3,964 as contrasted with $2,359 for all private Industry;\n$2,660 for public utilities; $2,612 for manufacturing; $2,400 for wholesale and\nretail trade, and $2,567 for finance, brokerage and insurance.\n(3) The average weekly wage scale of fall-tine radio station staff personnel (exclusive\nof network employees) was 272.00 in July 1927, as compared with $49.26 for employees\nin manufacturing; $56.10 for electric light and power; $52.65 for insurance, and\n$61.36 for finance and brokerage. Obviously, the over-all average weekly income\nfor combined station and network personnel (including free-lance talent) was ap¬\npreciably above $74.00 in July 1947."
}