{
  "id": "d1755-4",
  "text": "Much has been said and much more will be said of guaranteed annual employment. Yet for\nyears, employment security has been a reality for broadcast technicians, staff announcers, and\nother station personnel, even though this fact Is not always fully appreciated. The next step\nforward may, Indeed, be the evolution of specific plans vdiereby many stations and networks\nwill assure annual employment and Income to certain enployees who have proved their Job quali¬\nfications during some prescribed minimum period of employment.\nThere are. Indeed, substantial areas of Job security within the horizon of the radio In¬\ndustry — but only If we maintain sound operating conditions. We must lift the barrier of\nuncertainty created by union featherbedding, by dogmatic and arbitrary demands for constantly\nhigher wage scales by certain radio unions without regard for the trend In total station In¬\ncome. We must avoid wage spirals generated by the pressure of certain groups who seemingly\nhave a selfish disregard for ownership profits and for the wages received by other groups of\nstation employees. The major radio unions and radio employees must display a genuine undei^\nstanding of the economic factors underlying station operations; they must appreciate the need\nfor operational flexibility; they should comprehend the significance and nature of deprecia¬\ntion and maintenance costs; they should recognize the clear distinction between net Income\nand gross Income.\nFundamentally, the basis for all employment and Income security Is a sound, profitable\nand progressive enterprise. Herein rests the only means of achieving employment security for\nall American workers. No government laws can buy it; no union, by Itself, can make It pos¬\nsible.\nRADIO WAGES AH OR 6 THE BEST IR THE RATI OR\nNext to security, most persons desire an adequate wage for the work being performed.\nAll of us — executives and rank-and-file employees — regard income as purchasing power and,\nhence, there is an ever-present desire for larger wages. However, the wage we get also re¬\nflects our personal dlgilty and pride. We are concerned with our pay In relation to what\nothers in our company and In our community are paid. The absolute amount Is mighty Important,\nbut so Is the relative amount. For this reason, management must give full consideration to\nthe relative Importance of Jobs, and, thereby, establish equitable salary brackets. Further¬\nmore, Just and deserved Increases In pay to Individuals In accordance with their capacities\nand performances are very essential to the wage structure of the Individual ccapany and the\nIndustry.\nMo wage structure is completely sound uhich does not recognize individual productivity,\ntotal labor efficiency and the opportunities for promotion and advancement based upon per-\nsonal merit. Conversely, rigid group wage patterns which submerge individual initiative and\nretard individual advancement are, in reality, bad for workers and for the business enterprise.\nRadio pays its employees very well. In July 1947, the overall average weekly wage rate\nof full-time broadcast station employees (excluding network personnel and free-lance talent)\nwas approximately $74.00, with actual take-home pay running higher for a substantial number\nof employees. As a whole, the average annual Income per employee In radio Is either the\nhighest or the second highest of any field of business In the United States. This slight\nconfusion as to the No. 1 or No. 2 place of radio arises from the comparatively incomplete\ndata on the Motion Picture Industry. Some statistics place Motion Pictures ahead of Radio;\nother data indicate that It is second to Radio. If the total Motion Picture field. Including\nproduction and distribution. Is compared with the overall radio picture, Including station\nand network personnel (staff and free-lance), broadcasting undoubtedly now stands No. U as\nregards average weekly and annual Income per employee.\n-5-"
}