{
  "id": "d1755-6",
  "text": "The demand for and use of various types of employees and free-lance artists by the In¬\ndustry and by individual stations does not follow a completely fixed, rigid pattern which\nbears no relationship to the wages paid. Talent and operational costs must be paid for by\nthe sponsor. We have now reached, the marginal point where higher time and talent costs will\nresult in decreased program •sales to sponsors or the creation of program structures utilizing\nfewer persons.\nThere never was a time, and never will be a time, when workers and management could have\nmore real Income by producing less. Only as we expand the total produced income of a given\nteam of workers can we Increase the wages of each and every worker who comprises that team.\nWe use the word \"team* because in our modern type of society workers and management collabo¬\nrate in group production. The Individual, despite his personal talents, in the factory,\nstore, bank, or radio station is as incomplete a production unit as one man on a baseball\nteam. This \"producing\" team in radio requires technicians, announcers, secretaries, sales¬\nmen, writers, supervisors and various other employees.\nFLEXIBLE OPERATIONS NECESSARY IN MANY STATIONS\nIt is also significant to note that, broadly speaking, the overall efficiency of a sta¬\ntion determines the level of wages and the number and types of persons to be employed. Un¬\nfortunately, certain radio unions in their individual effort to \"make Jobs\" for their present\ncrop of members have destroyed flexibility and have frozen Job opportunities.\nEspecially In small stations is Job flexibility necessary. Here is the training ground\nfor most of the announcers, technicians, writers, supervisors, managers, etc*, of the radio\nindustry* The young men and women who begin their careers in the small station anticipate\na diversified program of activities so that they may receive a well-rounded training. Fur¬\nthermore, without this flexibility of staff personnel, small stations can't meet the costs\nnow imposed upon them and, thus, are unable to pay the wages which otherwise would be possible.\nBoth management and unions must accept the principle of flexible operations, especially\namong small and medium-sized stations. If they fail to do so, they will increase the number\nof failures among the small market broadcasters and close the door to the future supply of\nskilled broadcast personnel — whether program, technical, commercial or managerial. It is\ngratifying to find that not a few top officials of radio unions are sympathetic to the need for\nfull productivity and efficiency based upon the specific operational requirements of indivi¬\ndual stations.\nBROADCASTERS LIBERAL IN AOOPTION OF EMPLOYEE BENEFIT PLANS\nA supplement to an adequate wage system is an adequate program of employee benefits and\ninsurance. It is Indeed better that workers should look to Industry as the source of protec¬\ntion for themselves and families than to regard the government as the smug harbor for secu¬\nrity and economic refuge.\nIn addition to maintaining high wage scales, the radio industry has been extremely lib¬\neral in its development of profit-sharing, bonus and employee benefit plans.\nIn a recent survey conducted by the EERD, it was found that of the 461 stations covered:\n44.9% had a hospitalization Insurance plan;\n36.8% had a life Insurance plan;\n34.1% had a profit-sharing bonus plan;\n26.2% had a medical services benefits plan;\n23.9% bad a cash sickness plan;\n13.7% had a permanent disability plan;\n9.1% had a retirement plan;\n1.3% had other types of plans;\n37.1% had no plans. - '"
}