{
  "id": "d1681-1",
  "text": "V\nr>\n/\n-\nNAEB ER......- . .-\nRemember, the Association has\nEducation by Radio. Jpscftr\n21 East 18th Street, uInver, Colopado> vr..\n- .....\nJOINED THE AER?\nFROM YOU.\nWNYC DRAMATIZES Of-: ACTIVITIES IN Mfc.VV.S>\niOW\n«We Are Prepare^ cram dramatizing the many defense activities\nWHICH ARE NOV' UNQt: ’ Y 0 ■ cGTECT AMERICA IS BEING PRESENTED BY\nWNYC, New York station. The new show replaceo “Creative\nAmerica.”\nWritten and directed by Mitchell Grayson, the program devotes a\nhalf hour each week to one fact of the Civilian and armed defense,\nranging from the work of the Army Interceptors to Air ?U id Wardens\nand the Consumer Division of the Office of Production Management.\nA SPECIAL FEATURE OF THE PROGRAMS IS A QUESTION PERIOD IN WHICH\nMEMBERS OF THE AUDIENCE ASK ABOUT ANY PART OF THE WORK THAT THEY\nDO NOT UNDERSTAND.\nNAEB SCRIPT EXCHANGE\" STARTS.\nWe promised you that as soon as we had heard from ENOUGH NAEB\nMEMBERS, WE10 START THE NAEB SCRIPT EXCHANGE. NaT H. ERWIN, NAMED\nits first Director, who is production director at WILL, has set\nUP A LIST OF RULES AND REGULATIONS TO GOVERN(THE USE OF THE SCRIPTS.\nAlso, we’re listing the scripts available. 5t isn’t too late for\nYOU TO ASSIST BY SENDING YOUR FIRST SCRIPTS, OR FOR SOME OF YOU\nEARLY BIRDS TO SEND MORE.\nConditions Under Which Scripts May Be Used, according to Erwin, Are:\n1. Original script must as returned within ten days to Nat H. Erwin,\nWILL, University of Illinois, Urbana, Illinois along with one copy.\n2. Credit must be given the author and the source from which it came0\n3. Scripts may be altered to fit the need of the production.\n4. Postage must be paid both ways ey the borrower.\nCLASS MAIL UNLESS TWENTY (20) IDENTICAL COPIES ARE\nMAILING, THEREFORE CHEAPER MAILING MAY BE OBTAINED\n(Scripts are first\nIN THE SAME\n8Y USING EXPRESS.\n5. not more than four scripts will be mailed at one time to the\nborrower.\n6. SCRiPTS ARE AVAILABLE ONLY TO NAEB MEMBERS, AND MAY BE USEO ONLY\nfor non-commercial purposes."
}