{
  "id": "d1520-11",
  "text": "-12-\nHINTS TO THE PROGRAM DIRECT OH\nAmerican Legion Platters\nAmerican Legion is mailing 15-minute transcription programs','pn Universal Military\nTraining to approximately 1000 U.S. radio stations. Discs present Dr. Daniel A.\nPoling and Senator Edward Martin in talkswhich answer criticisms'of UMT by plan’s\nattackers. Audition carefully if used. UMT in its presently- described form is\nan extremely complex issue—so complex many Army and Navy mop-are not willing\nprivately to state a categorical ’’yes” or \"no”.\ntThat About Public Service Plugs\nEvery educational station is bombarded with reams of \"prepared copy” to forward\nvarious public service campaigns. You will find many of these projects such as\nAmerican Red Cross, March of Dimes.American Cancer Society, highlyworthwhi1e. Are\nyou taking full advantage of the opportunity to plug local events and regional\nevents of important and worthwhile groups in your listening area? Several stations\nhave found an excellent public relations device in marking each plug used with\ndate and time, filing the plugs according to cooperating organisation, and then\nat 3-month intervals sending back the ’’cancelled plugs” with a covering letter.\nThis is proof of performance, and very gratifying. \"Cast your bread on the waters”\nso to speak.\n******\nFrench Transcriptions\nApproximately 200 stations from coast-to-coast, including £2 50-kilowatters in\n24 cities, plan to carry programs prepared by the North American Service of the\nFrench broadcasting System. This was revealed last night by Robert Lange,\ndirector of the Service, who has just completed a tour of outlets in the U. S*\nand Canada.\nPrograms, in England, are produced in Paris and designed to give American audiences\na true picture of French life, with emphasis on public events, music and wnter-\ntaigment, ^ange gaid.^ .Most_ s^9vrs^,aret,aired, in this poultry; via ET’s, he continued,\ntat ions ’will' take'tlcem G?ive viaSs£orfwa?e.\nLange also outlined a sked of six new shows available to U.S. stations. These\ninclude: ’’Tour de France,” a weekly visit to a city or province; \"French Cavalcade,”\nvariety; \"French in the Air,” a practical course in French; \"Five Centuries of\nFrench Music”; \"This ‘r,reek in France,” interviews with news personalities and a\nroundup of French opinion, and \"Mr, Jones Goes to Paris,” interviews with Americans\nin the French capital.\n********\nSEVENTH TRANSCRIBED VA SERIES TO BE READY\nThe new seventh series of 13 quarter-hour HERE’S TO VETERANS transcriptions has\nbeen recorded b:/ the Veterans Administration and will be available to stations\nlate in February for use during March, April and May, it was announced last week\nby Charles Dillon, assistant director of VA Information for Radio and Television.\nThe series will consist* as usual, of capsule versions of well-known network\nprograms, including many new ones. The complete list of 13 shows includes discs\nof the Eddie Howard Show, Club Fifteen, My Friend Irma, Music America Loves Best,\nSpike Jones’ Spotlight Review, Highways in Melody, the Dick Eaymes Show, the A1\nJolson Show, Sammy Eayefs Serenade, Abe Burrows, Jimmy Durante, the Bill Goodwin\nShoitf, and Bob Hope,\nThe programs have been approved by the Advertising Council, the AFRA, and the AFH;\nThe sixth series, now on the air, is being used by 1,288 AM and FM stations. The\nseventh series may be ordered from the Information Division of the nearest VA\nBranch Offices, Branches are located in Boston, New york, Philadelphia, Richmond,\nAtlanta, Dallas, St. Louis, Columbus, St. Paul, Denver, San Francisco, and Seattle*"
}