{
  "id": "d1520-15",
  "text": "-16-\n- NEWS FROM REGION I — Regional Director - Seymour Siegel, ^FYC, Few York City\n(Maine, Few York, Connecticut, Few Hampshire, Massachusetts, Vermont, Rhode Island,\nPennsylvania, Few Jer.sey, Delaware and Maryland)\nVn ‘\nMassachusetts\nF-A-E-3 station, URUL, the Forld-Uide Broadcasting Foundation outlet with’trans¬\nmitters in Boston, is arranging two quarter-hour interview shows with the English\ncasts of two Broadway plays, \"The Winslow Boy,\" and \"Power Without Glory.\" Players\nwill he interviewed and out their impressions on transcriptions. Later URUL will\nbeam the programs to England.\nFew York\nColumbia University proceeds with plans for its EM broadcast development. Univer¬\nsity now has facilities in the transmitter at Alpine, Few Jersey set up by Major\nEdwin Armstrong.\nFew Jersey\nF-A-E-B station UBGO-FM goes on the air for the first time February 5 with formal\ninauguration ceremonies. Congratulations to supervisor Uilliam Pfeiffer (a Wiscon¬\nsin alumnus) and the Newark, Few Jersey Board of Education (Details elsewhere in\nNewsletter),\nConnecticut\nA new series of programs directed to young people, titled \"On the Move\" aimed at\nshowing religious convictions in action on the part of organized projects as well\nas individuals has been started on TfAYZ. Interdenomination in nature program is\nwritten and produced by Marjorie Frantz and broadcast in cooperation with the New\nHaven Council of Churches on Sunday afternoons.\nEdvard Weeks, editor of the ATLANTIC, is now on the air at 1:15 p.m. (EST) over ABC\nPennsylvania\nPennsylvania State College is exploring further problems in the FM broadcast field,\nJ. 0, Keller, assistant to the president there recently requested a copy of Elmer\nSulzer1s article \"Setting up the FM Station,\" (F-A-E-B headquarters has an ample\nsupply of this publication on hand.)\nTemple Universitv, Philadelphia, Pennsylvania, went on the air with a new college\n(low-radiation) station, UTRI, on January 22, 1948. A very unusual and attractive\nbrochure described the dedication ceremonies.\nFew Jersey\nRutgers University, New Brunswick, Few Jersey is producing and broadcasting a\nseries of programs called \"Rutgers University Forum\" on Tuesday (8;05-8:30 p.m.)\nover FAAT, FJLK7’1UD,WCTA’& ttSNJ. Programs are directed by Marshall G. Rothen,\ndirector of broadcasting for Rutgers.\nfew York\nN-A-E-B station UNYC, New York Municipal outlet formally will dedicate its new\n10,000 watt FM operation on February 11, 1948. Major O’Dwyer will throw the\nswitch opening the new transmitter. (Details next issue)\n\"Junior Reporter\", a new weekly show produced in cooperation with the New York\nBoard of Education, began January 30 from 6:30-6:45 p.m, over UNBC. Program features\nEd Herlihy and four junior high students in a discussion of current topics, chosen\nby student body. Show is plugged in school papers and re-broadcast by Board of\nEducation station VJNYO-FM."
}