{
  "id": "d1520-4",
  "text": "-5-\nCQLLPGE PUBLICITY 'TUTDRS URGES TO STUDY RADIO METHODS\nAt a late January meeting in New York of the American College Public Relations Asso¬\nciation, college publicity workers were urged to acquaint themselves with all phases\nof network and radio industry operation in order to provide stations with material\nsuitable for broadcasting. Speakers were Dr. Lyman Bryson, CBS public affairs\ncounselor; Sydney Eiges, NBC vice-president in charge of press; Jack Paige MBS,\nspecial events director, and Joseph Beal, N.Y. City College School of Business.\nBeal warned the group that colleges are unable to prepare cony **good enough for\nairing because of ignoranee of radio techniques,** and added, **Co lieges deserve a\nsound spanking for their apathy towards radio.1*\nBryson advised the meeting not to \"jazz up” educational programs in an effort to\nobtain popular acceptance but to try to reach instead the great number of listeners\nfor a particular type show. He also admonished the group to prepare material that\nis different and exciting and at the same time suitable for broadcasting.11\nColleges'not now in radio, Eiges said, have missed the boat, but still have marve¬\nlous opportunities in television. He stated schools not now preparing for television\nare **way behind the times.11 He urged the publicists to **get in on the ground floor1*\nand grow with the new industry.\nPaige urged the group to evaluate what they had to offer in terms of what it will\nmean to the general public. Pie outlined the techniques and needs of special events\nproduction. He stated that radio is entertainment, and college special events must\nbe entertaining and interesting to everyone.\nBBC REGISTERS T*ITH TJ.S. IDTDER RODION AGENT'S -SECTION\nThe North American Office of BBC registered as an agent of BBC in London with the\nDepartment of Justice. In its registration statement, the Office said ,fthe basic\ntheory of the BBC’s North American operations is to portray from London the\nBritish way of life, its progress, institutions, art music, and thought, and the\npoint of view of its public to America., and conversely, America to the British.\nU,S. HAY BE LOSING BATTLE OP IDEAS ABROAD —INADEQUATE BROADCASTS\nGeorge Hamilton Combs, !7HN(New York) commentator, returning from a four months\ntour of Europe says most Europeans are woefully ignorant of the U.S. He believes\ninsufficient funds and the absence of an integrated program for the State Depart¬\nment* s OIC are the reasons, rather than staff incompetence anywhere along the line.\nCombs expressed disappointment with the American Eorces Network for not measuring\nup to its possibilities. AFN* s powerful transmitters are heard all over the conti¬\nnent and have made its broadcasts the '*showcase of American radio throughout\nEurope.** However the primary purpose of AFN is to entertain occupation troops,,\nand the civilians all over Europe who turn to AEN do not get the Hslice of America**\nwhioft. they might well receive.\nEuropean radio. Combs found, was almost uniformly ’’dull” and limited, in scope.\nProgramming is comprised mainly of canned classical music(mostlyvocad or chamber\nmusic)', with 11 no lilt1*, and~Ts interspersed with government messages and^ official\nspeeches. Television is practically unheard of on the continent, except in\nEngland where ’’you hear of it, but never see it.**"
}