{
  "id": "d1483-1",
  "text": "News Letter\nJune I, 1946\nPAGE 2\nDurr spoke in a symposium on radioes post-war obligations during the\nFriday evening session of the 16th Annual Institute for Education by\nftAOlOo\nOther speakers on the symposium included the president of the National\nAssociation of Broadcasting, Justin Miller; the president of New^York^s\nRADIO station W=»M-C-A, Mathan Straus; the vice-president of the Comumbia\nBroadcasting Company, Davidson Taylor; and Ho 8p McCarty of the University\nOF Wisconsin.\nDurr declared that nearly seventy per cent of FM applications come from\nOWNERS OF STANOARO BROADCAST STATIONSa\nSaid Durr; the standard broadcasters for the most part propose to use\nTHEIR NEW FM STATIONS MERELY AS ADDITIONAL OUTLETSo ThE NEW SYSTEM 6S\nADMITTEDLY SUPERIOR BUT IT NEEDS NEWCOMERS AND HENCE NEW COMPETITION.\nSCIIiNTlgTS oAY PLACE IS PARAMOUNT\nThree experts attending the Institute agreed that the prevention of any\nTYPE OF WAR IS THE WORLD‘8 NUMBER ONE PROBLEM. TheY SAID THAT IT TOPS\nEVEN THE PROBLEM OF DEVISING SOME CONTROL FOR ATOMIC ENERGY.\nTheir statements were broadcast over the University of Chicago Round Table\nProgram on Sunday. The experts were the Atomic Physicist, Or. Harold Urey^.\nvice-president Reuben Gustavson of the University of Chicago and Dean\nJoyce Stearns of the Washington University Graduate School in St. Louis.\nDr. Urey summed things up this way; \"nothing in this century is more\nimportant than the prevention of war, not even control of the atomic\nBOMB,\" Gustavson added that biological warfare might be even more\nFRIGHTFUL AND FAR-REACHING THAN ATOMIC WARFARE AND HE SAID IT WOULD\nMOST SURELY HAVE BEEN USED IN THE RECENT WAR IF THE ATOMIC BOMB HAD NOT\nENDED THE CONFLICT.\nCOLLEGE STUDENTS WANT MORE SERIOUS PROGRARS.\nThe Institute heard how college students feel about radio. According\nTO THE INTERCOLLEGIATE BROADCASTING SYSTEM, SEVENTY PER CENT OF COLLEGE\nSTUDENTS DO NOT LIKE WHAT THEY HEAR OVER THE AIR.\nVeterans and upper-classmen want to hear more serious programs, news\nBROADCASTS, AND COMMENTATORS.\nIn PRESENTING THE RESULTS OF A NATION-WIDE COLLEGE POLL, THE RESEARCH\nDIRECTOR FOR THE INTERCOLLEGIATE EROADCASTING SYSTEM, HARRIET LlNTON,\nPOINTED CUT THAT WHILE COLLEGE GRADUATES ARE ONLY A SMALL PART OF THE\nLISTENING AUDIENCE, THEY ARE ABOVE AVERAGE IN BUYING POWER AND IN\nPOTENTIAL INFLUENCE.\nWALKER RENOMINATED FOR F C C\nPRESIDENT Truman nominated Paul A. Walker of Oklahoma for reappointment\nTO THE Federal Communications Commission. The nomination went to the\nSenate for confirmation on May 13."
}