{
  "id": "d1483-2",
  "text": "NAEB NEWS LETTER .. May 15, 1941 . . Page 3\nIn cooperation with official agencies.\"\nMr. Kent is also chairman of a committee on organization which\nis expected to draft a constitution in the near future. The\nother members of this committee are Belmont Farley, Robert\nHudson, Hazel Kenyon, Carl denser and Leonard Power.\nThe FSEC Bulletin will be glad to receive suggestions f.cm\nanyone who cares to comment on the above purposes, or any\nother reasons for the existence of such an association. Send\nin your name if you would like to become a charter member,\nand be assured that the constitution will be democratic in\nits provisions.\nARM3TR0NG BOOSTS EDUCATIONAL FK STATIONS\nThe Service Bulletin of the FREC carries a significant story\nfor all interested in the educational FM station. We quote:\n\"Major Edwin H„ Armstrong has instructed manufacturers of\nFM equipment to reduce their charges, to educators, by an\namount equal to his royalty, less the nominal amount of\n$1„00<, Boards of education will profit thereby, and total\nsavings will be no sm&l}, item in total installation cost.\n\"Major Armstfong expresses his very significant aid to\neducational broadcasting in the following letter to Dr.\nJohn W. Studebaker, U. S. Commissioner. The letter was\nread to those present at the Twelfth Institute lor\nEducation by Radio.\n’Dear Doctor Studebaker:\n’I have been much gratified with the reports that are reaching\nme about the experiments with FM transmission conducted by the\nCleveland Board of Education and I have been considering for\nsome time what might be done to further encourage other, similar,\nprojects.\n•From time to time letters have come in from educational institutions\nrequesting information about royalty rates under my Frequency\nModulation patents in the event that these institutions s]™uld\ndecide to erect stations and construct transmitters themselves.\nIt has seemed to me that it might help the development of this\nnew branch of radio if I should arrange to issue licenses, to\nthose educational institutions which are interested in going\nahead, at a nominal royalty of One Dollar. This is to advise\nyou that I am willing to do that.\n, there be anv way in which I could assist ther cause of\neducational broadcasting by the furnishing of technical advice\nor information, I hope that you will always feel free to call\nupon me for it. “Very sinedrely,\n\"Edwin H. Armstrong* \""
}