{
  "id": "d1483-5",
  "text": "NAEB NEWS LETTER . ♦ May 15, 1941 Page 6\nHOW ABOUT THOSE DaTa7\nWhat transcription services and transcriptions are you using?\nOr, are you going to tell? 01%,did you fail to see the request\nin the May 1 issue of the News Letter? Or, have you been too\nbusy to answer?\nDEFENSE FOR DEMOCRACY ON WNVC\nYou*11 find interesting the foreword in the May-June issue of\nprograms for WNYC, You''11 also find an innovation on the center\nspread - the urograms outlined hour by hour and day by day* If\nyou don11 have a copy drop i note to Novik and he111 be glad to\nsend you a copy,\nSUCCESSFUL RADIO interference CONFERENCE AT ILLINOIS,\nA„ James Ebel, Chief engineer of WILL, assisted by staff members\nof the University’s Electrical Engineering Department, engineered\na successful Radio Interference Conference on the Illinois campus,\nMay 10, More than 200 persons from eight states and the District\nof Columbia were in attendance, ^ine technical discussions in\nwhich 15 outstanding speakers participated were presented to those\nattending. The bancuet speaker was Dr„ L, P. Wheerer, Chief of\nTechnical Information Service, Engineering Department, Federal\nCommunications Commission,\nAROUND THE RADIO CIRCUIT\nArticles in the May issue of AROUND TIIS RADIO CIRCUIT include:\n\"The Mountains Come to Radio,” by Elmer G, Sulzer; Portland\nPublic Schools and Radio ,,f by Hazel Kenyon; f New York City has\nProblems of Its Own,\" by James F, Macandrew; *Transcription\nLibrary Service for Rocky Mountain Region, by Robert B. Hudson,\nBritish Columbia School Broadcasts,” by Kenneth Caple, and others,\nTEXAN ON EDUCATION AND RADIO\nAustin • Texas, Sixty-five pox cent of Texas farm homes have\nradios but only 8 per cent of the farm boys and girls use 'them\nto tune in on educational broadcasts, a University of Texas radio\nresearch expert claims.\nInstilling \"dial-consciousness” into Texas school boys and girls\nrill be one of the future school teacher's moat important functions,\nDr. A. L. Chapman, director of the University’s Bureau of Research\nin Education by Radio, declared.\n••One of the most important needs today of meet listening communities-\nbig or small—is an awareness of where the better programs can b„\nfound,\" he said. \"Newspaper radio logs are not sufficient.\nKith recent surveys revealing that Texas 91 teen-age farm youth prefer\nhill-billy music to all other forme of radio entertainment combined."
}