{
  "id": "d955-44",
  "text": "- 10\n\"The student staff members prepare a special program on activities at\nthe station which is taken to community organizations. This is the\nextent of indoctrination.\"\n^\"Policy manual, monthly meetings, and weekly house organ THE BEEP SHEET.\"\n\"On joining staff and frequently during weekly staff meetings.\"\n\"Very heavily—students as well as staff.\"\nr \"Every man is ajp.r. man in our concept. All producers of programs accept\nthe ptabUc relations aspect as one of their included responsibilities.\"\n\"Constantly in little things but not in organized fashion.\" pC\n> \"We do not have a full time p.F. man, therefore, each staff member is\nurged at our weekly meetings to assist in some way in our public\nrelations projects.\"\n[\"We depend upon a 3 credit undergrad,, course in Pub iv‘‘Relations to provide\nall with basic techniques.\"\n\"Most staff members participate in speakers* bureau (limited activity).\"\n\"Often and as much as possible.\"\n\"At weekly staff meetings we often discuss relations and determine policies.\nSuggestions also received at staff meetings. We eternally stressTfact\nthat we represent the University, that our very being depends upon our\nrelations with the public.\"\n\"No formal indoctrination—it's something we*re conscious of.\"\n\"Via personal discussion and at staff meetings—remind them of fact that\nthey represent the station — and to act and dress accordingly.\"\n\"Our students run our station for the most part and we try to instill in\nthem public relations consciousness as frequently as possible.\"\n\"Everyone is briefed frequently on PR responsibilities, programming or\nother changes. This includes students as well as full time staff.\"\n\"Constantly. Not particularly by ‘indoctrination* but simply by constant\nawareness that _is a powerful public showcase of the (institution).\"\n\"Great extent.\" ^\n\"By having them go with me on calls or doing some of the legwork.\"\nf\"Speeches often given, programs planned often for P.R.\"\n\"For the last five or six years we have been trying to stress that\n^ promotion is as important as production. We’re not always successful\nin this indoctrination, but it has helped.\"\n\"Impress on all the need to keep the publicity girl advised of story\nmaterial.\"\nContinuing the quotations, this time from the Class II (school) stations:\n\"Have practically no faculty staff but everyone remotely connected with\nthe station is well aware of the importance of good public relations\nand work toward that end.\"\n\"Weekly staff meetings.\"\nf'The school program director maintains regular contacts (by visitation)\nwith all building radio coordinators, and teachers requesting infor¬\nmation and assistance. The station manager maintains contacts with\nlocal radio and TV stations, and the press.\"\n\"Not very greatly.\"\n\"We feel that it is an important duty in every job, since we deal with\nfthe public in one way or another, with each program.\"\n\"Little.\"\n\"At every opportunity.\"\n\"Only one staff member.\""
}