{
  "id": "d955-83",
  "text": "CALIFORNIA HfADQUAftTfRS .\nMltNAID f XAMINS. (mcMim Vi*»A«<jdMtf\nVttA SIIVI. **Jk $«vk« Director\nDALI CLAKK, N*w York CiwMln\nCANON-AT-CUFYON\n15? Cm* IiW Aviwm*. N*w Y*ct ?t, N. Y\nTIMM—r f-6070\nJuly 5» I960\n190 Necth Canon Drfcr.\na_i-- UNL --\nW¥#riy rom, v,-*v.&\nT«MpU«w OmMot WMt\nHarry J. Skprnla, President ,\nNational Association of Educational Broadcasters\n14 Grapery Hall\nUrbana, Illinois\n- • a... 1 r.r_ilaro 1 >1 „__\nFor vnat. they are worth- as a number of year Public Re¬\nlations Comm! t-tee, way I make three comments in regard\nto the June 23 letter sent to yor by Leslie F. iiarcus\nof Michigan State University, relat-np to his Idea for\na National Educational Radio and Television Week.\nFirst, treating this idea construct!vely (that is, with¬\nout stressing negatives), the October date is too near.\nIf a plan like this were executed, the preparation would\nbe all-important. At least six months in advance would\nbe needed for developing a plan of attack.\nSecondly, you would need a minimum of $25,000 as a\nStarting budget, even if the very first-step were to\ntry to get the educational stations themselves to raise\nthe funds.\nThirdly, the determination for such a week would fall\nin the province of the United States Chamber of Commerce.\nTo discuss the time element and the preparation, a full\njpi on#T pw&OTOrv to erperiTOPWirto, perhaps —-\nwith some auxiliary help, would have to be engaged to\nmake such an errort a continuous one.\nA fin nee committee would ave to be appointed to examine\nthe situation as far as the funds for such a project were\nconcerned. U. S. Government, state government, local\ngovernment, citizens1 groups, etc., would all have to be\nbrought into the play to pay for the effort.\nNational weeks are set by the U. S. Chamber. This organi¬\nzation puts out a calendar of 3uch weeks and days a Ml\nmonths. It ls> not difficult to have the date set but it\nmust be set far in advance so that word of it can be\nspread by the United States Chamber of Commerce.- Word\nof it Is spread by the Chamber so that professional\npublic relations and advertising apencies can have & -»\nchance well In advance to tie on.to the promotion."
}