{
  "id": "d20-109",
  "text": "BOX 3638. G.P.O..\nSYDNEY.\nCABLE ADDRESS: ASBUN. SYDNEY\nASIAN BROADCASTING UNION\nOFFICE OF THE SECRETARY^?ENERAL\n29 November, 1967.\nTO: ABU LIAISON OFFICERS\nPROCEEDINGS OF ABU FOURTH GENERAL ASSEMBLY\nWe are now starting work on the preparation of the printed Proceedings of the recent\nGeneral Assembly in Singapore and I would be grateful if you could advise me as soon\nas possible about the number of copies your organisation will require*\nAs in past years, the Proceedings will be printed in two Volumes:-\nVolume I containing the minutes and documents relating to the plenary, sessions;\nthe minutes, reports and documents of all the Ccmmittees except the\nEngineering Committee, and the report of the Engineering Committee.\nVolume II containing the minutes, report and documents of the Engineering\nCommittee.\nVolume Ilwill therefore be mainly of interest to the engineering staff of member\norganisations while Volume I will provide the information required by those who are\nnot engineers.\nWill you please state on the questionnaire belcw the number of copies of each Volume\nwhich your organisation will require. As the cost of air mail postage is hi£h, we\npropose to send one copy of each Volume to members by air. Ihe remaining copies\nrequested will be sent by sea mail.\nCHARLES HOSES.\nSecretary-General.\nSir Charles Hoses,\nSecretary-General,\nAsian Broadcasting Uhion,\nBox 3636, G.P.O.,\nSYDNEY. AUSTRALIA.\nOn behalf of.Warn'of l&gmUaUoh).1 wish to reQ-uest\nfollowing copies of the Proceedings of the Fourth General Assembly of the ABU\nshould be supplied to our organisation:\nVolume'I ... copies\nVolume II ... copies\nIhe copies of Volume I intended for our organisation should be addressed to:-\nName:\nAddress:\nThe copies of Volume II intended for our organisation should be addressed to:-\nName: ...\nAddress: .\nWe have noted that one copy of each Volume will be sent by air and the remainder\nby sea mail.\nPete\nI'BZgnai^eT\n(Position!"
}