{
  "id": "d20-112",
  "text": "ASIAN BROADCASTING\nUNION\nOFFICE OF THE SECRETARY-GENERAL\nBOX 3636 G.P.O., SYDNEY\nCABLE ADDRESS: ASBUN. SYDNEY\n8th January 1968\nIn the January issue of the ABU Newsletter, which has just been\nsent to members, you will find a short article about NAEB which\nwe compiled from a printed booklet sent to us by a member of your\nstaff, Mss Moran. We followed as closely as possible the wording\nof the booklet, with the aim of avoiding factual errors, and we\nhope you will think that the article is a satisfactory summary.\nAs I feel sure that NAEB can be of great help to our members in\ndeveloping countries, I would have liked some emphasis to have been\nplaced on this possibility but hesitated to depart from the printed\n£\n*\n/ The preparation of this article reminded me that, in your letter\nof 4 December, you mentioned that the ABU had been placed on the\nmailing list for NAEB's monthly Newsletter. We have not yet\nreceived any copies of this publication and this has made us wonder\nwhether it is being despatched by sea mail, which takes a long time.\nIf it is possible, we would be very grateful to receive copies by\nair so that, if we can quote from it in the ABU Newsletter, such\nquotations will not be 'dated'.\nIn the printed booklet sent by Miss Moran, I noticed also reference\nto a bi-monthly Journal. We would also welcome copies of this\npublication, if you would care to supply them to us.\nI am very sorry to worry you about these detailed matters. I hope\nthat you will soon be able to nominate your ABU Liaison Officer\nand ABU Technical Liaison Officer, as mentioned in my letter to\nyou of 1 December, so that we can send them ABU correspondence\nabout routine matters.\nI will be leaving Sydney on 13 January for a very crowded journey\noverseas to which I do not look forward with enthusiasm: my days\nwill be crowded with work and there will be a good deal of overnight\ntravelling. The main reason for this trip is the meeting of the\nregional broadcasting Unions on space communication, which is being:\norganised by UNESCO in Paris on 24-26 January. In the absence of a\nregional Union in North America, UNESCO is inviting '’appropriate\nrepresentation” from your area and I have heard that Alphonse Ouimet\nwill be representing Canada but do not yet know the names of the\nU.S. delegates.\nI am taking the opportunity of visiting the USA on my way to Paris\nand of carrying out various assignments for the ABU in Europe; on\nmy way home I have agreed to carry out a mission for UNESCO in Asia.\nIt is these additional tasks which have resulted in a very busy\nitinerary covering about 5 weeks, during which I visit some 15 cities.\nI will be in New York on 15 to 17 January but unfortunately will not\nhave time to go to Washington. In case you should happen to be in\nNew 3?ork at that time, I expect to be staying at the New York Athletic\nClub but could be contacted through the office of the ABC (Australia) -\nMr Charles Buttrose, ABC North American Representative.\nWith kind regards,\nMr William G. Harley,\nPresident, National Association of\nEducational Broadcasters,\nWashington.\n/ Your^si sincerely, •/\nV_^ (- ^\nCHARLES MOSES\nSecretary-General"
}