{
  "id": "d20-30",
  "text": "i o-vv^d\nASIAN BROADCASTING UNION\nBOX 3636. G.P.O..\nSYDNEY.\nCABLE ADDRESS: ASBUN. SYDNEY\nOFFICE OF THE SECRETARY-GENERAL\nOFFICE OF THE SECRETARY-GENERAL\nTO: ; ABU MEMBERS\nU.U. CONFERENCE ON THE EXPLORATION AND PEACEFUL USES OF OUTER SPACE\nAs members will know, the General Assembly of the U.N. in 1966 decided to\narrange a Conference on the Peaceful Uses of Outer Space to examine \"the\npractical benefits of space programmes on the basis of scientific and technical\nachievements, and the opportunities available to non-space Pox^ers for intern\nnational co-operation in space cctivitios, with special reference to the needs\nof the developing countries\".\nThis Conference is to be held in Vienna on 14 to 27 August 1968. It will be\nconcerned with all the practical uses of space research which can now be foreseen\nincluding broadcasting and communications services, meteorology, navigation aids\netc. Special attention will be given to means by which the results of space\nresearch can be of practical use to the developing countries, particularly in\neducation and training projects*\nAs a^preliminary to the Conference, the U.N. has published a booklet entitled\n\"Spade Research and Technology: Benefits to Developing Countries\". Copies of\nthis booklet have been widely distributed but copies of the chapters on\nCommunications and on Education and Training are attached for easy reference*\nThe chapter on Education and Training should be of special interest to many of\nthe ABU's members*\nThe Governments of ABU members will already have been invited to send delegations\nto this Conference and it is hoped that a considerable number of them have been\nable to accept* My purpose in writing to members now is to draw attention to the\ndesirability of the interests of broadcasting organisations being adequately\nrepresented in the delegations. There is a natural tendency for the telecommuni¬\ncations authorities - those concerned with telephone and other similar services -\nto be regarded as being the appropriate body to be concerned with space\ncommunication and, consequently, there is a danger that the needs and interests\nof broadcasters may be overlooked*\nIf your country is to be represented at the Conference, it would be valuable for\na member of the broadcasting staff to be included in the delegation. If this\nis not practicable, we hope that your organisation will make contact with the\nthe delegates from your country, with the aim of making sure that they will\ngive attention to the discussions on the use of space communication for\nbroadcasting and that the needs of broadcasters are adequately represented*\nI would also like to remind members that the Director of the U.N* Radio\nand Visual Services Division, Mr Jean d'Arcy, has recently written to ABU\nmembers about radio and television programme coverages of the Conference.\nABU members interested in sending a member of their own staff to cover the\nConference should get in touch with the Information Service, UNIDO, P.0* Box 707,\nVienna, Austria* The U.N* staff will be providing a coverage on shortwave\nradio and on television and film: members wishing to use these services should\nalso make contact with UNIDO at the Vienna address.\nCHARLES^MOSES\nSecJretai^Seneral\n15th July 1968"
}