{
  "id": "d20-31",
  "text": "Chapter I. Communications\nThe need for communications satellites developed out of the rapidly, growing\nneed all over the world for real-time communications over long distances. The\nbasic attraction of communications satellites is their ability to view large seg¬\nments of the earth, thereby permitting point-to-point communications over large\ndistances.\nIn addition, the cost of a satellite link is to all intents and purposes constant\nwith distance, while the cost of ground links varies directly with distance. As a\nresult, the communications satellite system becomes more and more competitive\nwith ground-based communications systems as the cost of satellite links goes down.\nThus the satellite is already the least expensive way of sending a moderate\nnumber of trunk messages over distances of 1,500 miles or more, and it is\nalready possible to envision a system in which this economic break-even point\nwould come at distances of 100 miles or less for even a single channel.\nThis means that, in the not-too-distant future, satellite communications between\nsingle users can be expected to become commonplace, particularly if high total\ncapacity and simple access to satellites could be provided. In this event, a major\nincrease in the flow of information across the face of the globe would result, lead¬\ning to enormous economic and social changes, particularly in the developing\nnations.\nIt might be useful to note that communications satellites are usually divided\ninto three classes: point-to-point, broadcasting, and distribution satellites.\nThe point-to-point satellite is intended for point-to-point communications, and\nis able to handle all kinds of traffic—telephone, telegraph, facsimile, data trans¬\nmissions. exchange of radio and television programmes, etc. To minimize the\npower requirements for such satellites, large and sophisticated receiving terminals\nare generally required on earth. These satellites are actually only an extension of\nexisting radio relay systems technology, and only one new facility is provided—\nintercontinental transmission of television programmes. Aside from that, they\nonly broaden, although on an enormous scale, the facilities offered by earth-bound\nradio communication systems and underground or submarine cables.\nThis type of satellite has been the subject of considerable study and experi¬\nmentation. and reached the operational stage in the United States' Early Bird and\nthe Soviet Union’s Molniya satellites.\nSatellites which arc capable of transmitting radio and television programmes\ndirectly to home receivers are called broadcasting satellites. In other words, they\nwould be used to beam a signal directly to radio or television sets of the conven¬\ntional variety, although the sets might require special antennas or pre-amplifier\nsystems. Tnis would mean that the satellites would have to be capable of trans¬\nmitting a very loud signal, which would significantly increase power requirements.\nBetween these two extremes lie a large number of possible satellites of medium\n5"
}