{
  "id": "d20-34",
  "text": "“would be well advised to follow the repeated recommendations of the\nUnited Nations and the rru, and to unite their efforts in the establishment of a\nglobal system, giving them equal opportunity to use space communications.”\n2. Those responsible for mass communications and education in the various\ncountries should carry out economic studies co-ordinated at the international level\nand aimed at demonstrating the economic impact of satellite systems, thus justi¬\nfying their establishment.\n3. Adequate international studies and planning would be necessary for the\nprogressive and well-balanced development of such mass communications and\neducational broadcasting services, with special attention given to the technological\nand economic advantages of joint projects, and particularly those of a regional\nnature.\nWhen looking to the future, there is little question that it is the direct broadcast\ntelevision satellite which has the greatest potential, since it is capable of broad¬\ncasting information to huge audiences scattered over very large areas. In fact, it\nwould not be amiss to say that such satellites really open a whole new dimension\nin information\nHowever, direct broadcast satellites would need a good deal of power to re¬\ntransmit signals with sufficient strength to be picked up by ordinary home tele¬\nvision receivers. Direct broadcast satellites would also require very large antennas\nwhich could be erected in space and then accurately pointed at the area to be\ncovered. Preliminary work is under way on the development of such antennas.\nIf power-source and antenna development is vigorously pursued, direct broad¬\ncast television satellite capability might be available by the mid-l970’s.\nThe application possibilities of communications satellites are truly breath¬\ntaking. One of the most obvious of these applications would be in commerce and\nindustry. In the long run, it is inevitable that commercial and industrial com¬\nmunications over long distances via satellite will become less expensive than cable\ncommunications.\nOn the governmental level, greatly expanded communications facilities could\nmean better access to information sources and, possibly, less delegation of\nauthority. It could also permit better global representation with fewer personnel.\nIn international affairs-—-between Departments of Foreign Affairs and embassies\nor consulates, or for representation at international conferences, in the United\nv»»«;r,nS or in other international organizations—a satellite system could mean\nmore efficient and more timely contact.\nWithin national governments, a communications satellite could provide better\nrepresentation at all levels and more democratic procedures. With a better in¬\nformed public, and with the possibility of automatic and instantaneous opinion\nsampling and voting, much greater public participation at all levels of government\nwould be possible.\nThe value of the communications satellite in education is, of course, a subject\nin itself (see chapter VII), Suffice it to say here that its potential in this area is\nvirtually limitless.\nIt is interesting to note that, as direct television broadcast satellites become\nfeasible, it would be possible to bring educational programmes not only to school\nclasses, but also directly to the boot, Im ffaie evuot, oduradoa would so leapr\nbe provided only for the young, but would also be available to adult*. Tbe com¬\nmunications satellite could thus conceivably change the entire nature of education.\n8"
}