{
  "id": "d20-37",
  "text": "If this is in fact the case, the next decade if, likely to witness the most significant\n,Trld hi5,wy- \"*•\"»- of rtSteSSK\nproaciCdSt directly to ground receivers at local schools or to around relav stations\n&££&£££££.* —\n^ «“*. wl*» «* is not true. the fault is generally\nraftor-n. ^ ?0rn ,'.ra,1fi‘0”5 or disadvantages of the television medium, bu't\nWrsff inadequacies in the way the materials are arranged and presented\non?a few havre“tr U™tCd Staie’'. ltaiy• ,aPa° and Nigeria, to mention\nSucatoTta?^l^Zr F'nmem,n* \"?th “* “* of ground-based television in\nMucatron for a number of years, and have achieved excellent results. In Italy\nschM?7hS™ Pro*ramme fIled “Telescuola” was established to reach middle-\n^ ‘ ' m rc*'°\"s where nc‘,her nor school buses were available.\nThe programme not only proved very worthwhile for the school children, but\nnurntwns 1^”,',“ \"umba? °f adults as well. When it was found that large\nnumbers of adults, many of them illiterate, were also watching “Telescuola\" a\nrd,r\"“H°,Pro~!,T prescn,ed which was directed towards the needs\nadvtnJee Of twers‘ *“ senes a,so proved wry active. An unexpected\n?br?w, 8 u these Programmes was that many children learned to read before\nthey were old enough to go to school,\neJno^ea»’nieleViSifn is “sed 10 meet a wide variety of educational, as well as\nforam hd£d ff the rost-'var ^od, agricultural television\n• lh fa™5r5 how t0 *row more f00d- and other programmes\n,V\" h°me eC0n0mic5 and I,ygiane. Today, there are innumerable\neducational television programmes in Japan,\nlanma^wW^? **’\"•« I” co,ultri«s Nigeria to create a common\nfoiifri m hlh!n „« ,C ex,s,s:.And' surprisingly, educational television has been\nm,cd'um. m fadlitatin* ,h<! settlement of pioneers in pre-\naously uninhabited parts oi Siberia, Alaska, Canada, Australia and Tibet,\nrhe programmes offered in educational television around the world ranee\nsTmolLt kind of6 Wh°H d °1 uhUman knowk^—tt™ instruction in the\nagTU! Urf Mat!d feea!th Practices to courses in higher mathe-\nto .phyj,CS‘ *nf whli? most the field agree that a good deal\nifttTe donht thJTf “ lmPro^n8 programme content and format, there can be\nlittle doubt that television is already a very important educational medium.\n^ ShoukJ direct rry broadcasts not appear feasible, the earliest capability for\nteicvi^« broadcasts would appear to He in the community broad-\nfir r?f/?a(Ch‘ ?“*£ a ftel5lte’ in a synchronous orbit, would offer the\npotential for etv telecasts directly to major educational facilities or communities\n^lwfnmUnIsty br«adlaSt Sate!!lte wou?d aP-pcar *° be a iogical first steo for\ndeveloping nations. Such a system, capable of beaming etv programmes to* edu¬\ncational and community facilities over sub-continental areas, could be achieved\npy the early 1970 s,\nAn alternative system would involve the installation of nation-wide communi-\nf\" capabI<! ?C, re-iransraitting television programmes from satellites\nvia radio re!a>s or co-axial cables, but building communications systems of this\ntype coulo take as much as a decade in some eases, and would be completely\nimpractical m others. One solution might be to effect this television distribution"
}