{
  "id": "d20-38",
  "text": "by means of a distribution satellite with a television channel and several associated\nIT * The-V0,?e c\\anRels «>uid carry sound in different languages or\ndialects when associated with fnc television channel or could broadcast indc-\npendent radio programmes. A system of this kind would not be limited geo-\ngraphically and, in fact, could be tailored to almost any desired size or shape.\nBritish science writer Arthur C. Clarke, in a memorandum presented to unesco\nseveKil years ago noted that, while direct radio broadcasting from satellites could\nbe extremely useful m teaching languages, the full potentials of etv could not\nwmdd £ed Vntim WCre transmitted- He pointed out, for example, that it\n3**\"* frf’ ? l0t lmPossible’ t0 teach Pe°PIe how to write a language\nwithout the capability of showing them what the letters looked like.\nDirect broadcast satellites also pose certain problems, since it would be far\neasier to use pm and/or short-wave than to transmit to conventional am radios.\nTT»e problem, of course, is that in those areas where broadcasts are most urgently\nneeded, there are few fm and/or short-wave receivers.\nJS7?' ,direc' radio broad«“\" from satellites represent a\nj P 'T/t sa!fI1,te ETV' Clarkc »n interesting interim step\nand ful!\"*ale television. This he referred to as the “electronic\nBlackboard —a cheap and simple, slow-scan, facsimile-plus-sound receiver which\ncould operate on normal radio band-widths, without requiring the thousand-fold\nM^rfJ ,.rbtndT'd?./?:dCd ,b7 television. Since it would require less than to\nlcmTof ^obal tekvWom' W0W ** P°WCr and fequcncy.allocation prob-\nf thlf kind c<?uld ^P^uce line drawings and cartoons at an ade-\nfor .educat,0Ral Purposes, where the same picture usually has to stav\nIongcr’ ^Half-tones could not be transmitted, of course,\nbut would really not be necessary.)\nhn^rk„ert?°nCfiV?d °.ft!h.iS rc.ceiver as the remote equivalent of a teacher’s black-\nboud, noting that, with its aid, languages could be taught to people who did not\nshare a single word of their instructor’s tongue. It would thus be suitable for\ntaping programmes for classes with millions of students.\nthe rin!T:PaCt °r S.U,Ch ad'v|ce could be enormous. Clarke gives as an example\nMonscnor J Salcedo in the mountain village of Suiatenza,\n™™’a- '?,d,'n a.™esco publication. MonseRor Salcedo set up a small radio\nSaZ toh^riSe^8\" Cff°rt rKlUCC “d ProvWe ™-\nStarting with a few hours of broadcasting on Saturday nights to perhaps fifteen\nreceivers, and an audience of some 5,000 listeners, in 1948. the programme grew\nhvSioi°UrS/f-br°adCattS da?y t0 16,000 recdwB and »*»** 200,000 listeners\nmy i/*\\nd *'X ye.f” later’m I960> broadcasts were attracting an audience of\nmore than a million listeners.\n“Wilb a modest investment.” the unesco document on this extraordinary\nfeat notes. Monsenor Salcedo has radically transformed rural life over a large\npart of Colombia. Through communal reception, supported by first-level main¬\ntenance by parish priests, he has provided a broadcasting system suited to the\nmeager resources of the people and responsive to their needs.”\nIt is not at all difficult to believe that direct radio or television educational\nbroadcasts from satellites (or, for that matter, the use of Arthur Clarke’s “elec¬\ntronic blackboard**) would have an even greater impact on the developing nations\nand could go a long way towards reducing or eliminating illiteracy and ignorance.\n32"
}