{
  "id": "d20-43",
  "text": "2.\nagreement and the solution of these problems is very important to the further\ndevelopment of the use of space communication in broadcasting. The ITU is the\nproper authority through which solutions, and international agreement on them,\nshould be sought, and. it is therefore highly desirable that action towards\nthis end should be taken by the ITU as soon as possible.\nAttached is a copy of a letter from the Secretary-General of the ITU, Mr Mili,\ndrawing attention to the work which the ITU has already done in this field.\nThe Annexes to the letter also contain information about the ITU's proposals for\nfurther action.\nAnnex 2 points out that the ITU is recommending to its member Governments\n(referred to as Administrations) that a World Administrative Radio. Conference\nshould be held in the latter part of 1970 or early in 1971. It is now a matter\nfor Governments to give their views about this proposal and ABU members are\nrequested to do all they can to encourage their own Governments to press for\nthis Conference to be held as early as possible.\nAnnex 1 and the explanatory statement attached to it contain interesting\ninformation on the work now being done by the agencies of the ITU in the field\nof space communication. It will be noted from page 4 of the explanatory state¬\nment (headed Annex to Resolution No R637) that it is proposed that the other\nmeeting mentioned by the ABU's Administrative Council - the Xllth Plenary\nAssembly of the C.C.I.R. - should be held early in 1970* As the studies now\nbeing undertaken by the C.C.I.R. lead towards the World Administrative Radio\nConference referred to above, it is important that the C.C.I.R. Plenary\nAssembly should also be held as early as possible. The ABU's Administrative\nCouncil therefore hopes that ABU members will draw the attention of their\nGovernments to the desirability of the C.C.I.R. making rapid progress with\nits studies and the holding of its Plenary Assembly.\nIncidentally, there appears to be a typing error in the last line of Mr Mili's\nletter: as the letter was dated 26 June 1968, it seems clear that the date in\nthe last line should be May 1969.\nCHARLBS MOSES\nSecretary-General\n15th July 1968"
}