{
  "id": "d20-5",
  "text": "ASIAN BROADCASTING UNION\nPROGRAMME AND ENGINEERING COMMITTEE MEETINGS, SYDNEY 1969\nG.P.O. BOX 487, SYDNEY 2001\nTELEPHONE: 31-0211\nCABLES: \"ABCOM\" SYDNEY\nABU SECRETARIAT\nAUSTRALIAN BROADCASTING COMMISSION,\nBROADCAST HOUSE,\n145 ELIZABETH STREET,\nSYDNEY, AUSTRALIA\nEXCHANGE OF SHORT FILMS ON FARMING\nP/19\nIn this exchange, which has been in operation for about 3 years the\nABU members taking part send to each other, once in each 3 months, short\nfilms about farming or farming life in their own countries. It was\noriginally intended that members should be able to make, from the con¬\ntributions they receive, magazine programmes that would give their\naudiences an interesting account of farming activities in various parts\nof the ABU region.\nThere have been problems about this exchange from the beginning and we\ndo not know of any case where a member has in fact been able to make a\nseries of programmes of the magazine type from the films it has received,\nroblems have included the fact that some of the participating members\nd*d contribute films or did not contribute them at the right time*\nthe fiim supplied m some cases was of poor technical quality and some\nmembers said they could not use films received because the subjects were\n° ,no intfrest to their audiences. The Secretariat has given much time\nand effort to try to overcome these problems but the results have not\nbeen very encouraging.\nAt the Programme Committee meeting in 1968 it was suggested that one of\nthe participating members might write to the others to try to obtain\ninformation which could be used in improving the exchange. The NZBC\nagreed to undertake this task and it later sent a questionnaire to the\nUARTO)5 memberS whlch were stlil taking part (ABC, AIR, NHK, RTH, and\nAttached is a.summary, supplied by the NZBC, of the replies received\nfrom the participants. This summary is being drawn to the attention of\nthe Programme Committee because it appears that the exchange is not at\npresent of much value to the participants and it should therefore be\neither altered or abandoned.\nThe main points in the replies to the questionnaire appear to be:\n(a) In each 1 round* of the exchange, each participant sends to each of\nthe others taking part a print of a short film, the cost of prints\nand airfreight being paid by the senders. The majority of the\nmembers taking part are using none, or very few, of the films\nreceived. Thus they are achieving very little for the costs in-"
}