{
  "id": "d20-51",
  "text": "- 3 -\na) Telecommunication satellite orbits\nOrbits for telecommunication satellites generally fall within\nthe limits of 500 and 40,000 kilometres above the earth’s surface. Of\nparticular importance in recent years is the unique circular orbit in the\nplane of the earth’s equator wherein the satellite is moving in the direction\nof the earth’s rotation at an altitude of approximately 36,000 kilometres\nabove the earth’s surface* In this orbit, a satellite rotates synchronously\nwith the earth and is thus stationary with respect to the earth’s surface.\nIt is expected that a number of satellites In this orbit will be in close\nphysical proximity and will be operating on the same frequencies. The\nminimum physical spacing between satellites in the stationary orbit will\ndepend on the resolving power of the receiving equipment and the degree\nto which the power from the transmitters can be focused to a narrow beam*\nLocation of satellites in the stationary orbit also presents problems\nconcerning the transmission delay and access to the satellite communication\nsystem by a multiplicity of earth terminals* These characteristics must be\nconsidered in the integration of satellite communications into world tele¬\ncommunication systems*\nb) Propagation and noise\nThe effects of propagation and radio noise on space telecommoni.cations\nare being studied since they determine the most suitable frequencies for\ntransmission in both directions between a space vehicle and the earth’s\nsurface* Frequencies for space telecommunications below 100 Mc/s are\nseverely influenced by the earth’s ionosphere and frequencies above about\n5,000 Mc/s are influenced by the constituents of the earth’s atmosphere.\nThese studies of the influence of the atmosphere and ionosphere fall within\nthe work already being done by C.C.I.B* Study Group V (Tropospheric Propagation)\nand Vi (Ionospheric propagation) as transmission to and from a apace vehicle\ndiffers only in detail from those of terrestrial services.\nc) Interference problems\nIn view of the occupancy of the radio frequency spectrum and the\nconsequent frequency allocations which have been made by the competent radio\nconferences, a considerable amount of frequency-sharing must be accomplished\nbetween space communication services themselves, as well as between space\ncommunication services and terrestrial services. As the present frequency\nallocation stands, especially the latter problem is being considered by tha\nC*C*I.K. The concept of limiting the strength of a signal from a satellite\nat the earth’s surface has been introduced, so that this signal should not\ncause interference to terrestrial systems and yet be of sufficient strength\nto provide a satisfactory signal for space services. A second interference\nproblem is between the transmitter of a ground station of a satellite service\nand the receivers in & terrestrial service and, conversely, interference caused"
}