{
  "id": "d20-59",
  "text": "Page - 2\nI am attaching for the information of your organisation a schedule show¬\ning a comparison of the arrangements adopted at previous General Assemblies\nwith those which will be adopted for the Fifth General Assembly in New Delhi\nnext November. I am also asking our Secretary-General, Sir Charles Moses,\nto send to all our members more detailed information about the new arrange-\nments. I myself would, however, like to emphasise that the total period required\nfor all the various meetings will not be longer than previously and that the new\narrangements should be more economical in time and expenditure for those of\nour member organisations which are able to send more than one delegate to our\nGeneral Assemblies. For those members which have only one representative\nat these annual meetings, the situation will be much the same as previously\nalthough the meetings will be in a different order.\nIn accordance with the plans outlined above, it now gives me much pleasure\nas President of the ABU to clarify the arrangements mentioned in my letter of\n1 May 1968 and to advise you that, within the period 13 to 23 November referred to\nin that letter, the Fifth General Assembly is convened in New Delhi on 20 to 23\nNovember and the meetings of the Programme and Engineering Committees are\nconvened in New Delhi on 13 to 15 November. Members will note from the at¬\ntached schedule that part of the intervening will be occupied by the meetings of\nthe Juries for the ABU Prize and of the Administrative Council.\nOn one of these days our host organisation, All India Radio, is also making\narrangements for the delegates to visit Agra, so that they may see the Taj Mahal\nand other ancient and beautiful buildings. The date selected for this break in our\nwork, Tuesday 19 November, has been chosen so that as many of the delegates\nas possible will be able to participate in the visit to Agra and we hope that the\nmajority will be available for this opportunity to make contact with part of the\nhistory of the host country.\nI share the hope of our hosts that it will be practicable for all our members\nto be represented at the meetings in November. I will look forward warmly to\nmeeting the delegates and to having their assistance in considering the future\ndevelopment of our Union in the interests of our members and in contributing to\nthe growth of broadcasting in the ABU region.\nYours sincerely,\nMr. William G. Harley\nPresident\nNational Association of Educational Broadcasters\n1346 Connecticut Avenue, N. W.\nWashington, D. C. 20036\nU. S. A.\nEnclosures"
}