{
  "id": "d20-6",
  "text": "~ 2 -\nP/19\n(b) The reasons for this appear to be that\n(i) Members taking part have different ideas about the type of\nfilms they want: some want only films that would be of\nimmediate practical value to farmers in their own countries,\nwhile others would accept films that show farming life in\nother countries without being instructional.\n(ii) Because of the great differences in the types of agriculture\nin various parts of the ABU region, some of the films\nreceived are about rural industries that do not exist in the\nreceiving countries and therefore they have no instructional\nvalue in the receiving country.\n(iii) Information sent with the films is often inadequate, so that\nthe receiving organisations are not able to explain the\nfilms, in their own languages, to their own audiences. It\nappears that the participants supply films originally\nproduced for their own programmes but do not always provide\nenough background information for the films to be understood\nin other countries.\nIn view of the great differences in rural industries in various parts of\nthe ABU region, it seems that there would always be difficulties about\nselecting subjects that would be of interest to most of the other\ncountries. This applies particularly in cases where the receiving\norganisation wants instructional films, containing information that\nwould be relevant to the work of farmers in its own country.\nThe Programme Committee may consider that the exchange should be con¬\ntinued but should be altered, in the hope of making it more useful.\nOne possibility is that the number of exchanges could be reduced and the\ngeneral subject for each exchange could be agreed on in advance, so that\nall the participants would supply film on the selected subject. For\nexample, junior farmer activities are of interest in most countries and\ni^ the participants were to supply a short film on junior farmer work\nm their own countries the contributions might be of value to all concern¬\ned. There are no doubt a number of other subjects of this kind that would\nbe of interest to all the countries concerned. If the Programme Committee\nthinks that this type of exchange should be tried out, it would be nec¬\nessary for the Committee to select the subject or subjects for the coming\nyear.\nABU members which have TV services for farmers are specially requested\nto pass on this report to the members of their staff who are respons¬\nible for their farm programmes, so that their delegates to the Programme\nCommittee can be fully briefed before coming to the Committee meeting."
}