{
  "id": "d20-71",
  "text": "- 3 -\nunauthorized uses of \"their broadcasts\", Article 3 defines \"broadcasting\"\nas the transmission by wireless means for public reception of sounds or\nof images and sounds. In the case of satellite broadcasts, however, the\noriginating organization does not transmit images and sounds for public\nreception. It transmits signals (which cannot, for frequency reasons, be\nreceived by the public) towards the satellite, and the satellite returns\nthem to an earth station which channels them to the domestic television\nnetwork, and it is the latter which broadcasts for public reception and\nthus carries on \"broadcasting\" within the meaning of the Home Convention.\nThis means, paradoxically, that under the Home Convention the signals\ntransmitted via satellite are protected for the organization that receives\nand broadcasts them, but not for the organization that originates them.\nb) The Home Convention protects not only broadcasts in the above-\nmentioned sense, but also phonograms and the contributions of performers,\nV.yith respect to the latter in particular, the Convention requires highly\ncomplex national legislation, with the result that to date, seven years\nafter its signing, the number of countries that have ratified it is very\nsmall (ten only, among which developing countries form an infinitesimal\nminority). To meet the immediate need for protection of television signals,\nin the interests first and foremost of developing countries, revision of\nthe Rome Convention is not a course that can be seriously considered because\niv would leave untouched the problem of the complicated but nevertheless\nessential domestic legislation required under Article 26. Furthermore, the\ndeveloping countries - which are precisely the countries for whose bene¬\nfit the protection of broadcasts transmitted via satellite is sought - rare¬\nly possess a national phonographic industry or performer troupes requiring\nprotection in foreign countries, and thus have little interest in becoming\nparties to the Rome Convention even if it were revised to include the pro¬\ntection of signals transmitted via satellite.\nHence the drafting of a new convention solely for the protection\nof television signals transmitted via satellite, as requested by the UNESCO\nmeeting of experts, is vital and urgent if the developing countries are to"
}