{
  "id": "d20-73",
  "text": "BOX 3636. O.P.O..\nSYDNEY.\nCABLE ADDRESS: AS9UN. SYDNEY\nASIAN BROADCASTING UNION\nOFFICE OF THE SECRETARY-GENERAL\nPRIX JEUNESSE INTERNATIONAL\nMUNICH, 7 - U JUNE 1968\n(Report by the Secretary-General)\nAlthough a short statement about the Prix Jeunesse was included in the July\nNewsletter, I feel that members - particularly those with TV services - would be\ninterested in more detailed information about the competition itself and about\nthose programmes which may be suitable for inclusion in the television services\nof members*\nThe Prix Jeunesse is an international competition for television programmes for\nchildren and young people submitted by broadcasting organisations or by\nassociations of broadcasting organisations*\nProgrammes may be entered in the competition in one of four categories:\nfor children’s programmes (up to 7 years); for children’s programmes (from\n7 to 12 years); for youth programmes (from 12 to 15 years), and for youth\nprogrammes (over 15 years). In each of the four categories the entries are\njudged under two headings: (a) information and instruction, and (b) drama and\nentertainment. A prize and a commendatory award may be conferred by the juries\nin each category and under both headings; therefore eight prizes and eight\ncommendatory awards are available for competition.\nIn addition to the normal Prix Jeunesse prizes and awards, three special prizes\nwere made available this year. One special prize was donated by UNICEF and\nconsisted of the opening bars of a new composition specially written by Prof*\nCarl Orff and signed by him; this was awarded for the programme which best\ndepicted the application of the Rights of the Child. Another special prize was\ndonated by the German UNESCO Commission for the programme which most contributed\nto mutual understanding among young people of different nations; this prize\nconsisted of a.lithography by Andre Masson. The third special prize included\nan original painting by an internationally famous artist; it was donated by the\nPrix Jeunesse Pouhdation for the best human interest programme which is simulta¬\nneously suitable for widespread international exchange and therefore capable of\nfurthering international understanding.\nThe prizes for the Prix Jeunesse competitions are substantial. This year each\nof the eight prizes and the special prize donated by the Prix Jeunesse Foundation\nconsisted of a bronze statuette and a sum of DM10,000 (about $US2500), and each\ncommendatory award included a certificate and DM3000 (about $US750).\nParticipants may enter up to 5 programmes but the total time of all entries should\nnot exceed 65 minutes. The programmes entered must have been produced and\nbroadcast within the two years preceding the competition. Programmes which have\nbeen awarded prizes in other competitions are admitted but no programme may be\nawarded a Prix Jeunesse prize more than once.\nThe Prix Jeunesse International competitions, which are sponsored jointly by the\nBayerischer Rundfunk (Bavarian Broadcasting Corporation), the Bavarian Government\nand the City of Munich, are held at two-yearly intervals, the first and second\nhaving.been held in 1964 and 1966.\nThe judging of the entries is carried out by the panels of 9 jurors each,\none being responsible for the programmes intended for children up to 12 years\nof age, the other for the two classes directed to youth audiences. The jurors"
}