{
  "id": "d20-82",
  "text": "NOTES\nA highly entertaining programme, not only for Category III\nhut Category IV and every adult who enjoys quick moving fun.\nStrongly recommended. Black and white. Durations 20 minutes.\nEnglish.\n\"Disc-Jockeys\" (Belgian Radio-TV)\nThe programme \"Disc-Jockeys\" appeals equally to hoys and girls.\n-It should he emphasized in particular that the factual information on the\nmilieu in which the jockeys present their programme, in itself hecomes part\nof the entertainment, an attraction which forms an artistic whole\n.together with the presentation of hits, songs and chansons.\nFurthermore, the film subtly and inoffensively corrects some of the\nideal conceptions that young viewers may have of the life and work of\ntheir idols.\nThe entertaining presentation of reality attracts the young viewers and\ninduces them to form their own judgment.\nNOTES\nThis show would appeal to the over 15 years group just as much as,\nif not more than, to the 12-15 y^ars old. Adults might find it noisy\nbut it is a genuine lively teenage entertainment programme.\nDuration: about 42 minutes. Filmed in black and white. English\ncommentary, songs in various languages, mostly English. Some\ndialogue in French but the action makes a knowledge of French\nunnecessary.\nCategory IV:\n\"Gente Joven\" (Young People) (University of Chile)\nThe programme meets the interests of young people with a well-balanced\nblend of music, interviews and instruction.\nThe idea to lead young people - precisely questioning - to comment\non problems of their life deserves special mention.\nNOTES\nA potpourri of music - instrumental and vocal - mostly popular,\nmixed with interviews with young people. Black and white. An\nEnglish commentary is provided. Duration: 28 minutes.\n\"For Bright Minds\" (Z.D.F., Germany)\nThis programme can serve as a model for solving the problem of directly\ninducing young viewers to logical thinking.\nii special attraction lies in the supreme skill of the presenter who knows\nhow to present rather abstract material in a lively manner.\nNOTES\nA programme for intelligent children, introducing card and other\n\"brain\" games of an intellectual kind. Black and white.\nDuration: about 32 minutes. A commentary in English is provided."
}