{
  "id": "d20-91",
  "text": "Since the 1967 General Assembly the Malaysian Government has given permission\nregarding the use of the Klang Station, if considered suitable, and Radio-\nTelevision Malaysia has also offered very important assistance including the\nservices of its staff to carry out the necessary measurements and the\nprovision of additional accommodation for the equipment, without charge to\nthe ABU. The Chairman of the ABU Study Group 1, Mr. Nomura of NHK, has also\nre-examined the proposal and has pointed out that the necessary equipment\ncould be hired, which would greatly reduce the cost of the project.\nThe Council has therefore decided that the ABU should proceed with this\nengineering project, at an estimated cost of $US3,500. During the second half\nof 1968 a preliminary investigation will be undertaken at the Klang Station to\nconfirm that its suitability as a location at which to conduct the survey and,\nassuming this is the case, steps will then be taken to proceed with the survey\nwhich will be undertaken during a period of about 12 months.\nProgramme Activities\nThe Council was disappointed to learn that it has not yet been possible to\nsecure funds to finance the first of the proposed series of educational films\nfor children, which was to have been produced in Malaysia and Singapore\nthrough collaboration among the ABC, RTM, RTS and the BBS. The Council is,\nhowever, aware that the Secretary-General is actively pursuing this matter\nand it is hoped that it will be possible to proceed with the project.\nThe Council is also aware t hat the ataff of the Secretariat has devoted much\ntime and energy to work associated with various programme exchanges, the\npossible use by members of entries in the 1967 ABU Prize and other activities\nintended to increase the useful programme material available to member\norganisations.\nOther Activities\nThe Council noted that, in addition to major projects such as those mentioned\nabove, the Secretariat has given attention to a number of other matters\nincluding the reprinting of the ABU Statutes, the printing and distribution\nof Volumes 1 and 11 of the Proceedings of the 1967 General Assembly, the\npublication of a booklet containing the addresses on administrative and legal\naspects of broadcasting given at the General Assembly, the improvement of the\nABU Newsletter, the preparation of the revised conditions for the ABU Prize\nand the provision of various other services to members.\nHaving examined with satisfaction the work done since the General Assembly last\nOctober, the Council turned its attention to a number of new proposals and plans\nfor future ABU meetings. Among these were:\nSeminar for News Editors\nOne of the ABU*s associate members in the U.S.A., Time-Life Broadcast Inc.,\nhas suggested to the Secretary-General the possibility of arranging a seminar\nfor senior news staff in member organisations in the ABU region, on the\nunderstanding that funds would be secured from sources outside the ABU to\nmeet travel costs.\nAfter examining this proposal, the Council believes that it would be of value\nto ABU members and has therefore authorised the Secretary-General to pursue it,\nprovided that it would not involve any substantial expenditure from ABU funds."
}