{
  "id": "d20-92",
  "text": "Friedrich Ebert Stiftung\nThe Secretary-General also reported on discussions with the Friedrich Ebert\nStiftung, a foundation in Germany which organised a seminar on mass communica¬\ntions in Tokyo in the latter part of 1967 and is interested in undertaking\nother activities in the Asian area, some of which would be concerned with broad¬\ncasting.\nThe Stiftung is particularly interested in the field of broadcast news and in\neducational programmes and has already produoed a series of television\nprogrammes teaching Physics which has been widely used. In this case also, the\nCouncil authorised the Secretary-General to pursue his discussions about\npossible collaboration with the ABU.\nExchange of Information on Books and Periodicals\nThe Council adopted a proposal made by KBS, the host organisation for its\nmeeting, that the Secretariat should collect from members information about\nbooks or periodicals on broadcasting, published in their own countries,\nindicating the language in which they are available. It is proposed that the\nSecretariat diould collate this information and distribute it to members, so\nthat they may get in touch with each other about publications which they\nwould like to purchase for their own use. Additions to the original list\nwould be included, from time to time, in the ABU Newsletter.\nChinese Language Activities\nAs a result of the Chinese Language Radio Programme Seminar held in Taipei in\nNovember 1967, the BCC made available to the Council a series of recommenda¬\ntions submitted by the Seminar about activities intended to assist other\nmembers which have transmissions in Chinese. These included proposals for\nfurther Seminars, the organisation of a competition for radio documentaries in\nChinese, and exchanges of programmes and information.\nThe Council warmly commended the BCC for its efforts to assist other members.\nWhile it was considered that the ABU could not itself undertake these projects,\nwhich would involve a large amount of work, the Council hopes that the BCC will\nbe able to undertake at least some of them for the benefit of other interested\nmembers.\nAssistance to Members whose Facilities have been Damaged\nAt the suggestion of KBS, the Council discussed the question of providing\nassistance to member organisations whose equipment or buildings have been\nlost or seriously damaged as a result of natural or man-made disasters. It\nwas pointed out that there have recently been some cases in which such disasters\nhave occurred and the Council was pleased to learn that, in these cases, some\nmembers have already provided assistance, through gifts of equipment or in\nother ways.\nIt was agreed that if similar events occur in the future, the Secretariat\nshould obtain from the member concerned a list of the facilities damaged and\nshould circulate this list to other members, so that they may provide assistance\nif they are able to do so.\nFuture General Assemblies\nFor some time the Council has had under consideration the arrangements for\nthe ABU's annual General Assemblies. The membership of the Union has been\ngrowing rapidly and the Council recognised that the increase in the number of\n5"
}