{
  "id": "d20-94",
  "text": "C/42\nREPORT FROM THE CHAIRMAN OF THE ABU STUDY GROUP ON\nSPACE COMMUNICATION\nAs the President will be aware, circumstances have prevented me from attending\nthis meeting of the Administrative Council as had been planned* However, there\nare a number of matters, including one of some urgency, that I wish to present\nto the Council through the ABC’s representative at this meeting. I propose,\nbecause of my absence, to touch only briefly on the present position regarding\nsatellites but there are some matters arising from my attendance at the recent\nmeeting in Istanbul of the E.B.U. Legal Committee and Satellite Working Party\nwhich are of direct and important concern to us.\nThe Satellite Picture\nAt present, so far as I am aware, only two member organisations, NHK and the\nABC, are at present participating in satellite exchange* A new earth station\nhas been constructed for Japan and the first Australian commercial earth station\nas distinct from special purpose earth stations, was officially opened at Moree\nin N.S.W. on March 29 last. This occasion was marked by an exchange of programmes\nbetween the ABC and NHK. Both organisations have since used their up-dated\nfacilities for programmes from America on highly topical events. The ABC is\nstill awaiting advice on the official rates for the satellite segments but on\nthe wholesale rate established for the common carriers in the United States, it\nappears that the rate from the gateway city, San Francisco,, to the satellite* will\nbe the same for Australian users as it is for broadcasting organisations in\nJapan. We are hopeful that the rate from the satellite to Sydney will be very\nmuch the same or not markedly different. While the rates are still perhaps\nhigher than we would like, it must be recognised that we are very much better off\nin respect of costs than are European broadcasting organisations who are still\nbattling, with some more success than before to achieve recognition of their\nstatus by the European Communication Authorities. It is quite certain that\nno reduction of rates can be expected until the launching of the Intelsat III\nSatellite series. This series will provide communication to Europe as well as\nto North America when the third of the series - an Indian Ocean Satellite - is\nlaunched. In both Japan and Australia plans are well ahead for the construction\nof earth stations to work with the Indian Ocean Satellite. In the meantime, the\nsatellite picture is less favorable for Pacific users. Both satellites of the\nIntelsat II series now in synchronous orbit are malfunctioning to a minor degree\nand I understand are not capable of providing colour transmissions of the desired\nstandard. This, of course, is a critical factor for NHK in relation to the\nOlympic Games, but since our Japanese colleagues would be better informed on\nthis aspect, I will not traverse it further. The key to the future is the\nlaunching of the Intelsat III satellites. COMSAT, the managing agent, are\nreasonably confident that the Intelsat III satellite for the Atlantic will be\nlaunched and in operation before the Games in Mexico, but there is no such\ncertainty about the Intelsat III satellite for the Pacific. At the moment December\nseems a much more likely date.\nSatellite Rules\nConsiderable attention was paid by the E.B.U. Legal Committee at Istanbul to the\nnecessity for a standard set of rules to govern satellite transmissions. Broadcasters\nwithin the E.B.U. area have had difficulty, as mentioned earlier, in obtaining a"
}