{
  "id": "d830-13",
  "text": "Committee I\nCbaizmn: HerrlU\nMwiberei Gaitiner, Moore, Flick:, MarqTiis, Cheydleur, Adkins, Newcmb, Merrill (chairman),\nQerjuogr (secretary).\nMerrill I !Rje purpose of the main meeting was educational broadcasting research in the\nbroad seme. People learn a commercial. Do people learn in the same way from ET^t\nWe want to write a non-partisan document on research, neither pro nor con ETV.\nIs the cate^ny we were given to work on workable? Are there any modifications?\nOur category iss\nStimulus is a bad word from the standpoint of the sociologist.\nOur subject matter can be seen on different levels of the size of the stimulus class.\nWhen we get finished the main group (ccjimoittee of the wh le) will attempt to organize the\nthree committee reports.\nGARDNERS Here is the EIF station output. There are two problems at least.\n1. Decision about what is being attempted to be accomplished if you like what you\nconsider good— the problem of goal selection. This is related to WILL TOU SDHFIWE?\nA surviving station must put out what will be accepted.\nPrograawing poli^ ust be decided with this (survival)in irdtid.\nIf you want to teach some particular course, e.g. Psychology la, this is a tactical\nissue. The strategic issue is to survivej to devel<^ music appreciation, etc., are the\nfl-inte of the station; these are largely strategic matters too. Putting on a particular\ncourse is taotioal.\nThe first problem is the image in the mind of the audience of #iat will happen when\nthey turn on the ETF channel. The audience must feel it needs what will hsqppen when they\nturn the station on.\nThe second prDblem is the tactics of programming.\nDo you needs **great** musicians, etc., to appear.\nA further problem is the kind of audience, a) truck-driver, b) executive, c) teen- ,\nager, d) ambitAcus young man, etc., etc.\nThis relates to the timing of the program.\nEach audience has its own configurations of Interests, needs, emotional desires, etc.\nThe promm must satisfy these oonfigurations."
}