{
  "id": "d830-14",
  "text": "MSRRlLLs fi^r# Is a parsn'thetiloal rmaik • Classroom boroadcas’bing is only one par^ of “bhe\nentix^ fisM. We must txixn to the broader issues of ETV,\nQARDMERi ^siness executives (like stati on managers) find it very haxd to give a precise\nTOsewhable statement of research problems. It is not their job, not their training to\nbe able to do so. They are too buay running the station.\nEducational W says that evexyone should pay for it, like a State University, even\nif everyone does not use it.\nIt is doubtful if we can just give a dassroom course competing with University\nE^nslon courses. Why set up another extension course? Naother extensions school?\nIt is a more expensive way of doing the work.\nCHKrumR: Costs will be $2.18 per semester per student in ray Sktate according to\nCov. Collins.\nGARDNER: Do you believe that?\nMARQUpj We set up another axbsnsion course on TV to reduce the costs of extension\nt/6&0nxTi^ •\nGpJUOYx Kaybe the cost is not what deteimines whether people will want it. Maybe\nthere are other motivations than cost that determine public acceptance.\nMERRILL; indx Let’s call our subject \"output\", not \"stimulus\".\nHARQfJISi Let’s call our subject \"program\".\nMOORE; How do^w translate Gardner’s ooraraents into research? I have some notes on\nhis comments attenuiting to make research suggestions sot of them:\n1. Who gives support for ETVt\n2. What contents does ETV have?\n3. How do you capture an audience?\n4* What values is ETV trying to oemonunioate?\n5. What are the techniques used (should be used) b ETV?\n6. What is the image produced hy ETV in the public?\n7. Is there anything loaique produced by BTV?\nnon-rtiM^u, variable, not gemane to the\nMOOHE: Hy wibject. aU did relate to the work of thi. eoeimittee.\nconeiderlng\n^UOTj Our researeh »ibjeot (for thi. comnitt..) Involve. ... in whlrii\nexpe^n^ primary espetlmental factor, th. thing not hrt^\n«y*^^A<sall^r varied) i. the stlmtaue. We have to nae some ^rtieulS*\nrespon.., ^ tteae are nre. MaWy kept oonatant. Oth^oomaitte.\n■tudy eaee. where toe res onw is varied (committee in) or the aidlsnce (cOTiuittee II)\niMt^Sr then consider factorial w^riments in which we try.^for^\ninstance, two kinde of presentation (a stimulus variable) on two different au^nees."
}