{
  "id": "d830-23",
  "text": "Comjdtteo II\nthe same time that we seek to delve into the needs of the potential audience,\nws should make every effort to interest social scientists in including studies of\nthe status of educational broadcasting as part of the scope of larger studies of\nthe web of social interrelationships o We may find that educational broadcasting\nhas cast the educator in a new role of not only writing the test materials but of\npublishing the text and disseminating it® In thus defining a new function of\neducators, we force changes in the people repponsible for educating others to cope\nwith change. What educators want to teach must be subordinated, and modified\ninto harmony with what a reasonable minority of the population wants to know.\nEducators must face up to the necessity of using public funds in ways that produce\na defensible yield per dollar.\nOnce basic needs are established thiwugh research on the potential audience\nwe can turn to question# abofut approaches to handle actual audiences© A natur^al\ndivision in educational toroadcasting (especially television) seems to be between\ntwo types of audiences.©©Captive and faree© There is a parallel division in points\nof view ai^ the kinds of questions we will pose in research on audiences©\nIn the captive audience situation w® are more concerned with teaching mom\nefficiently what anst and should be taught. In the free audience situation, w©\nare more Interested in teaching things in such attractive fashion that large\naudiences will be attracted to voluntary learning.\nHaving these two orientations poses the initial problem of how the educational\nstation can project an unambiguous image and the subsequent research followup of\nwhether the station has been successfia in doing so. We can list some of the probloms\nfor research under the captive and free audience condtions©\nFor captive audiences:\nWhat lessons, se^nts of subject matter, are traditionally difficult for students?\nWhat areas of knowledge are movinf so fast that many teachers actually are not up to\nthe minute in their own subjects? What blocks of information are so unambiguouf^y"
}