{
  "id": "d830-6",
  "text": "Burton PaulUf President\nnational Association of Educational Broadcasters\nStation KtJOK\nQoiversity of Minnesota\nMinneapolis, Mimesota\nPear Burtoni\nl^n the strong and positive recownendstion frcm the participants and re¬\nsource people at the NAEB Besearch Seminar, as well as the unaninious\nopinion of the members of the BAEB Research Committee, at the Columbus\nmeeting, it is respectfully requested that the RAEB Board of rirectors\nseriously consider ways and means by which a full time tdrector of Research\nmay be appointed to the Headquarters staff*\nAlthou^ fuller details will be given in the final report from this Seminar,\nit is envisioned that the Research lUrector would work directly under the\nResearch Committae and the Executive Director of NAEB, that his duties\nwould be defined by the committee based \\spon the many specific recommenda¬\ntions now being written into the Seminar report. An in^ortant recommendation\nto come out of this Seminar vdll probably be one suggesting that an advisory\ngroup be added to the Research Committee* It was felt that the Com ittee\nwould profit considerably by having the continuing advice from recognised\nauthorities in psychology, sociology, and the other disciplines, in helping\nthem shape a master plan*\nSince the Seminar study itself will not be conflated for several months,\nthe Research Committee, nevertheless, did want to call this request to the\nimmediate attention of the Board*\nConsiderable discussion was devoted in the final Research Committee meeting\nas to the qualifications and duties of this appointment* It was agreed\nthat since not only the man would have to be well qualified in broadcasting\nresearch as well as possessing ^i^e desirable characteristics found in the\ntype of person who must appear before individuals handling important fund-\nsotnrces, his minimum salary then should be set at |12,000*CX) per year.\nDetails obviously need to be worked out, however, once again we wish to let\nthe Board know at this early date the general thinking of the Research\nConriittee*\nRespectfully,\nRaymond D. Cheydleur, Chairman\nHAEB Research Committee\ncci Harry Skomia\nairmail"
}