{
  "id": "d1656-2",
  "text": "- 3 -\nRESOLUTIONS\nM. S. Novik (Chm.) H. H. Leake, Win. Senor, and Irving Merrill made up the\nresolutions committee which proposed that the following be adapted?.\n(A) Be it RESOLVED that the NAEB here.' assembled petitions the\nFCC to make available additional periods of time for the\npresentation of new and significant testimony in the\nclcar-channel hearings by the several member stations of\nthe NAEB directly and indirectly concerned.\n(B) Be it hereby RESOLVED that the National Association of Educational\nBroadcasters report to members of the California Legislature\nthat NAEB, representing 31 educational broadcasting stations\nthroughout the nation, has examined the California Plan for\nNon-Commercial educational and Public Service broadcasting\nas set forth in Assembly Bill -1514. It approves the plan\nas a well-designed basis for public service broadcasting,\nand unanimously urges its enactment despite opposition.\n(C) WHEREAS, Radio stations belonging to Land Grant Colleges in\nMichigan, Wisconsin, Illinois, Iowa, Indiana, Ohio and\nMinnesota have associated themselves for the purpose of pro¬\nmoting exhaustive surveys to determine the effectiveness of\ntheir broadcasting programs in the field of agriculture, the\nNational Association of Educational Broadcasters, believes\nthat the findings of the proposed Midwestern Cooperative\nRegional Radio Research which they sponsor will prove of great\nvalue not only to the participating Land Grant Institutions,\nbut also to all educational broadcasters. Therefore be it ^\nRESOLVED that the NAEB gives its fullest endorsement to the project\nand urges that it be instituted and carried to completion as\nrapidly as possible in the interest of better service to\nthe people.\n(D) ’\"HEREAS, Treasurer V.I. Griffith has long been faithful in.his\nattendance at NAEB meetings his presence is greatly missed at\nthis session, therefore be it\nRESOLVED that the NAEB express to Mr. Griffith its regrets at his\nabsence, and with it the hopes of the members for the speedy\nrecovery of Mrs. Griffith from her recent illness.\nThe resolutions were adopted.\n! EMBER SHIP\n(A) Discussion of the campaign for new members of the organization was\ncontinued. Action was taken to ma.ke possible more speedy approval of\nnew members. The executive was empowered to carry the names of new\napplicants in the Newsletter, with the notation that said members will be\nconsidered as approved if no objection is received within 3D days.\n(B) Approval was given to the plan of pro-rating dues of new members on\na month-to-month basis when applicants are received into the organization\nduring the period between January 1 and the following January.\n(c) Motion was made and carried for a bulletin for promotion purposes,\nincluding application blank,to be compiled and printed for distribution\nthrough the Regional Chairmen. Jim Miles was authorized to compile the\ninformation for the bulletin, submit it to the executive committee for\napproval, and then arrange for printing."
}