{
  "id": "d1656-4",
  "text": "GUESTITORIAL\nHow to Fill \"Fill-Program\" Time\nWith more and more educational stations being given grants—the question arises\n(particularly from the uninitiated) - \"how do I fill all of the time the.FCC expects\nme to be on the air.\" The ansv/er may solve itself once with the talent immediately\navailable performing the things they already know. But this is soon over and the\npersons responsible become more aware of the problem of satisfying the monster time-\nsatisfying the monster with palatable fare too.\nNow let’s suppose your new station proposes to broadcast from 8s00 AM to\nlOsOO PM, six days a week-that’s 84 hours a week—How can I fill 336 quarter-hours\nor 168 half-hours each and every week 52 weeks a year?\nWell, here’s one way. Buy some services that cost relatively little and\nrequire only partly trained help to handle. Then use these services to the.fullest.\nFor example: - Most transcription services will provide the music and continuity\nfor about 25 hours a week of programs. Most news sorvices will provide 18 hours\na week of news, markets, sports, et cetera. Many transcriptions arc available from\nprivate sources———BBC’s \"Freedom Forum\" and \"Bone.on 'Letter , french Radio s\n\"Paris Newsreel\", Wcstinghousc*S \"Adventures in Research\", G.E.’s \"Excursions in\nScience\", the Navy’s \"Winnie the Wave\", the Army’s \"Proudly we Hail\" and the VA's\n\"Here’s to Veterans\". These, of course, arc only a few-many others could be\nadded by all present day educational broadcasters. I would estimate that at least\n6 hours of programs weekly are available from those sources.\nLet's add up:\nTranscription service 25 hours\nNews service lb \"\nVarious transcriptions 6 \" _\nTOTAL- 49 hours\n49 of the 84 hours taken care of just like that! Sure, it ./ill require some\nwork-possibly the equivalent of one full-time clerk each week to handle these\nservices. But what about the cost? “ .\nonly:\n: .’inimum\n$1200 yearly\nLet’s look at that too. These arc estimates\nTranscription service\nNows service\nVarious transcriptions\nTOTAL COST\nOne file clerk_\n1200\nfree\nMsximum\n$1800 yearly\n1800 \"\nfree\n’\"\"$2400 ycarlv $*3600 yearly\n1650 \" \" 2000\nTOTAL COST FOR 49 HOURS\nAverage per hour cost of service\nAverage per hour cost of employee\n\"-4050 yearly $5600 yearly\n$0.95\n0.65\n$1.45\n0.80\nAVERAGE PER HOUR COST\n$1.50\n$2.25\nAll of which means that if you have a program budget of 15,000 yearly\n(exclusive of operating costs) you will only have spent l/3 of your budget for\nnearly 2/3 of your time on the air. Conversely you can spend 2/3 of your budget\non l/3 of your time and improve the real thing we’re trying to do namely-to\npresent educational broadcasts that educate.\n-Jim Miles, Radio WBAA, Purdue\nNext month's Guestitorialist: Russell B. Potter, Columbia University"
}