{
  "id": "d316-102",
  "text": "3.\nfor basic education. Bledsoe may not be quite the key figure\nthat I hoped, but his enthusiasm for my efforts plus his\nmany, many contacts suggest that he be kept in mind.\nFor the next two weeks I shall proceed with a syllabus\nin order to have sample materials in the hands of the committee\nin lots of time for meeting our December 1st deadline with\na test design. Also, I shall send some of this material to\nFoshay, since his deep interest in the effort is quite\nindependent of any prospect of being taken on as a paid con¬\nsultant.\nNow that I am back on base, I shall keep in closer touch\nwith you, although it does happen that I have not been able\nto shake off the miserable virus that I had when I was in\nChicago and may have to take a bit of a rest.\nI especially look forward to seeing Burns of R.C.A.,\nat the NAEB meeting. Let us by all means get the full story\nfrom him about the playback for video tape, because if it\ncomes within ordinary price range at all—say $500 or less—\nit will land us in the middle of a more intense phase of\nl^/the ETV revolution than has been foreseen. As we discussed\nit in Chicago, it means for one thing the loosening up of\nall the rigidities caused by channels and schedules. It is\nthe ultimate in decentralized individualistic use of what\nhas up to now appeared as a mass medium. It Is a turn of\nevents not unlike the suddenshiftfrom medieval oral teaching\nin the university to the silent private use of the printed\nbook at times and places of one*s own choosing. It would have\nthe same effect on TV that TV had on radio in bringing out\nthe personal and private aspects and the effect on study\nprograms would be speeded up very much. Perhaps we aught,\ntherefore, to concentrate this media project consistently\ntoward a processing of the syllabus materials in video tape\nform. Perhaps you yourself, or both of us, might make a\npersonal approach to Bums before the NAEB meeting in order to\nfind out how much thought he has given to the educational\nconsequences of his new gimmick. For, in one sense, it\nrenders existing educational procedures obsolete—almost\nacross the board.\nAt General Electric Management Centre, last Monday,\nI referred to Bums* announcement of this project pointing\nout that it would shake the production and marketing procedures\nof all electric equipment as nothing had ever done.\nI happened to have lunch with the head of the lamp\ndivision of General Electric and asked him, casually, whether\nthere were literature on lighting as a media of human\ncommunication. It had never occurred to him to think of\ncontinued..."
}