{
  "id": "d316-156",
  "text": "■3-\nbfisi® for all that followed. So that we may now be in the position , so\nfar as literacy is concerned, of propping a superstructure without a\nbase.\nDuring the recent centuries w® seem to have been as oblivious of\nthis over-all pattern of our Western culture as the humble tortoise is\nof the articulate design on its shell. It is hard to see how anybody\ncould have been more subliminal than Western man since Gutenberg.\nBut the electronic age is becoming alert to the dangers of the\nsubliminal whether in psychology or politics and education. The all-\nat-onca, many-levelled awareness of the electronic age discourages the\ncontinuation of the single-plane depths of unexsmined subliminal back¬\nlog of literate man.\nIn this time of co-existence, itself resulting from instantaneous\nmovement of information, we are confronted fey predominantly oral cultures\nlike the Chinese and the Russian• These oral peoples take to electronic\nand nuclear modes of organisation more readily than we do with our cen¬\nturies of linear and sequential training of perception. The nuclear\nphysicists have to master the non-visual and non-Euclidean modes of order\ntoday. But since the telegraph, the press has presented a non-lineal\nmosaic, and so have radio and television.\nAll of my work has tended more and more to center on the misunder¬\nstandings and clashes that occur between these two basic types of order\nin experience and organisation; namely, the visual and the auditory.\nFor the basic patterns of eye and ear are typically non-verbal in their\nmessage in most of their media occurrence. And it is even more confusing\nat first for some to learn that the mosaic of a page of telegraph press is\nnauditory1' in basic structure. That, however, is only to say that any\npattern in which the components co-exist without direct lineal hook-up\nor connection, creating a field of simultaneous relations, is auditory,\neven th© some ©f its aspects can be seen. The items of news and adver¬\ntising that exist under a dateline are inter-related only by that date¬\nline. They have no inter-connection of logic or statement. Yet they\nform a mosaic whose parts are interpenetrating. Such is also the kind\nof order that tends to exist in a city or a culture. It is a kind of\norchestral, resonating unity, not a logical unity of discourse. It is\nnot necessary to be satisfied with such a state of affairs once it is\nunderstood.\nPersonally, I feel none of the fervor in favor of such order, as an\nideal to be sought for, that is not uncommon among anthropologists. Ify\nnotion is that this kind of order is inseparable from electronic tech¬\nnology and that such auditory order quickly wipes out or brainwashes\nvisual kinds of order by subliminal action. As a teacher of language\nand literature I am aware of th® values to be had from these in their\nprinted form. But I am also aware that the artists, poets and musicians\nof the past century have unanimously abandoned visual structure in their"
}