{
  "id": "d316-163",
  "text": "-10-\nof modern technique an authoritarian system cm do without\nthis. The means of communication alone permit it to mechanize\nthe work of subordinate leadership. As a consequence a new type\ndevelops: the uncritical recipient of orders*11 (Albert Speer,\nGerman Armaments Minister in 1942, in a speech at the Nuremberg\ntrials, quoted in Hjalmar Schacht, Account Settled. London, 1949,\np. 240.)\nSpeer does not dissociate the effect of electronic media from some\nof the special features of German cultural organisation. And, for ex*\nample, what he notes about the older type of organisation as calling for\n\"men who could think and act independently\" is quit® the reverse of the\nsituation seen in U. S. business by Peter Orucker. For the new situation\nin America is precisely the one that calls for such \"authority of know*\nledge.\" Whereas the older literacy, at least in the 0. S., fostered\nthe pattern of delegated authority. What seems to have occurred in Germany\nand Japan under electronic impact was the brainwashing of a recently as¬\nsumed literacy and reversion to tribal cohesion and pre*individualist\npatterns of thought.\n1 have said (and X hope X am wrong) at various times that we ought\nto expect a steady trend toward irrational tribal behavior in North\nAmerica, as our youngsters get saturated with the all-at*once auditory\nexperience of our new madia. Such tribal experience was still intact\nand available to the Jap and the German. But for us to retribalize would\nbe quite a different matter. And in the global village created by our\nelectronics there would, of course, b© room for only one tribe — the\nhuman family itself.\nXt would seem obvious that our responsibilities as educators and\nbroadcasters is to understand our media and their effects just as an\nX-ray expert should understand the effects of his medium and not permit\npatients to receive an overdose. X-rays units can get \"hot\" but they\ndo not make good space-heaters. And we must learn how far we can safely\nproceed in applying new media to older educational purposes without\ndestruction of older goals and achievements.\nMoreover, since the saturation in a medium may occur outside\nschool contexts before any school use is attempted, we must know what\nare the relevant educational uses of such media. \"Saturation\" in English\nas the mother-tongue occurs by three or four years of age and the tradi¬\ntional educational superstructure is based upon that prior saturation.\nHave we used a similar wisdom in relation to the new media? As they\ncease to be codes, and invade and structure our entire beings and all\nareas of cur sensibility, they become \"languages\" themselves. Pictorial\nmedia tend to be non-verbal it is true.\nBut so are writing and printing non-verbal in their primary phases.\nOnly gradually do they pc meat© the verbal and spoken areas. The Morse"
}