{
  "id": "d316-164",
  "text": "■11-\ncode if known and experienced daily by everybody would quickly cease\nto be a code* The African drum and whistle languages are not codes but\nlanguages to African notlves. So with their dances. Ms, comics, and\nmovies are not codes in Horth America but basic languages. That we have\nnot yet begun to teach their grammars is as natural as it is for pre¬\nliterate man to ignore the written or visual mode of his language.\nGrammar comes from the Greek \"written.\" And education would seem to\ninvolve the translation of experience into a new mode.\nWe can begin, then, to consider the relevance of gransaars for\nmedia which have become languages all within our own century. What¬\never may be the educational advantages of traditional graraEtars now\napply to our new media. Yet one of the effects of the new auditory\nmedia has been to dissuade people from the cultivation of grammar. Hay\nit not be that the translation of the auditory structure of a language\ninto a grammar or visual structure, is, ultimately necessary in order to\nconfer personal adequacy of control over experience? But as we regain\nauditory space via the electronic revolution, we fail to see the relevance\nof visual grammar?\nHay not the translation of one sense into another, and of one language\ninto another be the irreducible modality of education, just as it is the\nIrreducible mode of nuclear investigation? May not this training confer\nthe detachment and criticism necessary for viable civilized man anywhere,\nanytime?\nFor the Greeks numbers were indications of auditory structure not\nvisual structure. Ernst Cassirer in The Problem of Knowledge tells us\nhow the vogue of Euclidean geometry depressed and retarded the study of\nnumbers and arithmetic for centuries.\nToday the effect of new auditory modes on the young will naturally\nsensitize them to number theory in a way which is taken for granted in\nold oral cultures like Russia, Hungary, Poland, etc.\nToday it is impossible to predict at what moment on® may make a\nlarge break-through into new dimensions of awareness. Because such a\ncasual fact as that the sound waves on the wings of a jet plane become\nvisible just a moment before breaking through the sound-harrier, such\na fact may be encountered for the first time in a newspaper or in over¬\nheard chat. It has profound implications for the dynamics of sight\nand sound and tells us much about their power and habit of transmutation.\nThe radio tube principle, pushed far enough, led to TV.\nIt was Flaubert in the middle of the last century who first alerted\nhis time to the subliminal power of bad pictorial forms. His people are\nall shown as victims of atrocious ccmsoercial art and communication. His\nown concept of le mot juste (which our age translates as The Most Juice)\nis auditory, not pictorial. For it implies an all-at-once order of words."
}