{
  "id": "d316-29",
  "text": "naeb headquarters\nNOV 5 1959\nNovember 2, 1959\nl\nDr. Marshall McLuhan\nDepartment of Extension\nUniversity of British Columbia\nVancouver, British Columbia\nDear Marshall!\nI received your letter and manuscript of October 21 and have attempted to go\nover the material quite carefully. Since you asked for comments, I will try\nto indicate some of my impressions of the introduction and syllabus.\nFirst of all, it seems to me that the first program should be devoted to an\noverview of the course, which would briefly survey the entire range of comr*\nmunication media and illustrate the problems in terms of some simple communica¬\ntion model, iou pointed out yourself how important it is for the individual to\ndevelop a Gestalt of the whole field, and from the standpoint of learning theory\nit would seem to be crucial to give your high school youngsters an adequate idea\nof the purpose and scope of the course at the beginning*\nSecondly, I am a little concerned about the capacity of 11th graders to function\nat the abstract level which would probably be necessary to fully grasp the im¬\nplications of some of the material you are presenting. If you could begin with\nmore concrete statements of the issues and move gradually to the more abstract\nimplications of them, the chance of comprehension on the part of these students,\nin my opinion, would probably be improved.\nMy third comment concerns the production problems that your syllabus suggests.\nIt seems to me that you ought to capitalize on the fact that the course makes\nuse of three different media: video-tape television presentations, printed\npage assignments, and face-to-face contact in discussion sections. X think\nthis point might profitably be made in the overview program I suggested and\nbe capitalized on throughout the course.\nI am becoming convinced, Marshall, that before we go much further we should\ntake one of these potential presentations as outlined in the syllabus and\nthink it through in more detail, both from the television production stand¬\npoint and in terms of the capacity of the target group, 11th grade high\nschool students, to fully understand. This might give you an opportunity\nto become more familiar with the problems of a TV presentation and might\nalso be a way to make some of the material in the syllabus more sensitive\nto the capabilities of the target group.\nI think you also ought to consider restricting the range of coverage of each\nprogram more than you apparently have. Various studies of educational tele¬\nvision programming have shown that it is generally uiwise to try to present\ntoo many ideas in a single presentation. Better results are obtained by\ndealing thoroughly and imaginatively with fewer concepts. The problem of"
}