{
  "id": "d316-30",
  "text": "Dr* Marshall McDuhan\nNovember 2, 19$$\nPage 2\nevaluation widen we shall face will also be easier when the program content\nis somewhat more circumscribed*\nIf I am not being presumptuous, 1 should like to call your attention to an\nexcellent one-chapter treatment of the problems of mass media communication\nwhich might be quite useful to you. It is Chapter 28, \"Effects of the ASass\nMedia of Communication,\" by Carl 1. ilovland of Yale University, in Volume II\nof the Handbook of Social Psychology, edited by Gardner Lindzey. Incidentally,\nin conneetion wiOT a project oi mine, I was recently in Dew Haven working with\nDr# novland• He is dying of cancer but continues to work as usual, snowing a\nremarkable attitude toward his situation# Although I seriously doubt that he\nwould be available for any personal involvement in this project, his chapter\nshould communicate to you the way some of us in social psychology regard the\nproblems you have undertaken, and it might give you some useful ideas. His\ndiscussion of the distinction between speculative assertion and research sup¬\nported results in this area is particularly relevant.\nDespite the preceding comments, Marshall, one cannot help being Impressed by\nyour often brilliant insights, enthusiasm, and capacity to get the work done.\nMven though much modification may still be necessary, you certainly have the\nsyllabus off the ground. To summarize my observations, just try not to get\nit too far off the ground.\nBy the way, 1 am enclosing the report which 1 promised you, prepared for the\nFund for the Advancement of Education, concerning the pilot phase of an earlier\nproject of ours, which explored the usefulness as a teaching device of filmed\ninterviews with great contributors to a discipline, in this case Carl Jung and\nErnest Jones* #• expect to continue this project, eventually completing and\nevaluating an entire course of filmed interviews. I think this is a promising\nutilization of film and/or television as teaching media at a more, as you\nwould say, \"literate\" level*\nI hope the preceding comments and suggestions will be of some value to you\nas you further develop the syllabus. I know that ..e shall all be interested\nin watching it as it develops.\nCordially yours.\nRichard I. Evans\nProfessor of Psychology\nRIEtjmb\nEnclosure\nect *t)r. hariy Skornia\nDr. Samuel L. Decker"
}