{
  "id": "d316-33",
  "text": "Pag* 2. - Progress Report - Sept. Nov\nSeptember 29-30th \\\nConsulting ArlKur Wells Foshay, at vheHBraaferJ&Hn Institute at\nTVachers College about objectives and procedures. His feeling\nis that anSyllabus and an approach which might seem very stiff\nto adults would be somewhat easier for students from Grade II\nonward. The peculiarity of media material is that, like the\nvernacular, it is thoroughly known at a very young age. To\nteach the well-known presents very different problems from\nteaching the unknown. In the first case, the teacher Is always\ninvolved as co-learner, and the learner involved as co-teacher.\nSeptember 3lBt-0ctober 19th\nbuilding tentative Syllabus .\n^c^oiion an<Pcritique of same at Arden House Management Center.\nAt Management Centers, there are a variety of executives from\nvarious communication areas of industry. This wide cros8**eotlon\nOf men offers a very rigorous testing ground for any concept\nabout new media. By and large, these men share the preconcep¬\ntions about media which derive unconsciously from the monarchy .\nof the printed word. Having no stake in textbook or procedure*)\nderived from the book as teaching machine, they are much more\nready to inspect new media and the power of new media for im¬\nposing their own assumptions upon the unsuspecting.\nand discussion of Syllabus with the NA2B committee\nmembers at the NAEB convention in Detroit. By and large, they\nftflt that the Syllabus was immoderate in its demands on a\nGrade XX level. Bob Schafer, of Wayne State, volunteered\nto consider the Syllabus with a flew of implementing its pro¬\ncedures with film and kinescope, and asked to have this con¬\nsidered in detail in the second week in December.\nmss*\non\nin W<\ni Syllabus procedures with many\nWashington.\nembers of theJBQD '\n_^ over the Syllabus problems with a group of Toronto High\nSchool teachers of Grade XX. They, have agreed to give the\nSyllabus a series of trial-runs right after Christmas. We have\nconsidered what is the best medium to start off with. They\naij* going to begin a study in which they are on a parity with\ntoeir students. The idea of learning along with their students\nis a novelty which appeals to them very much. The suggestion\nthat there should be two teachers in each class-room, in order\nto; give stress to dialogue and learning, rather than to teaching\nwas a suggestion which they are prepared to consider\n•continued..."
}