{
  "id": "d316-9",
  "text": "-2-\nSkornia...\nThis irrelevance may well be the problem of\nthe PCC for years to come. Like the Hollywood\ncode, general public concern about media content\nleaves the controllers of media almost entirely\nfree to govern the media as media. Perhaps we\nought to ask ourselves how far it is the newspaper\nand not the book which structures our bias in\nmedia study.\nWhile in New York, I took off a day to talk\nwith Gilbert Seldes and Charles Siepmann. Con¬\ntrary to the prediction of Forsdale, Siepmann came\nover at once to our media approach. Seldas never -\nwill. Siepmann grasped at once the importance of\nthe structuralist approach to media as providing\nan over-all and unified theory of social change. He\nsaid, at once, \"this supersedes the Marxist approach\nto change, that is change as explained as emanating\nfrom the means of production rather than the means\nof communication. The thing that has baffled Siep¬\nmann in his many years of work in the U.S.A. is the\nabsence of dialogue. The upper class English never\nwent literary all together, so that they feel a\nquick sympathy for those electronic forms which re¬\ncreate the conditions of dialogue in our midst to¬\nday. Siepmann does not feel the threat to his mode\nof existence from new media such as does his opposite\nnumber in the Ivy League of North America. As Matthew\nArnold revealed to the world a century ago, the\nEnglish aristocracy is barbarian and oral, not liter¬\nary.\nSeld£s, by comparison, has an intense literary\nand newspaper bias in all media approaches. I would\nsay that we could get our bearings from the Seld&s\ntype fairly adequately.\nFrom the enclosed photocopies of letters from\nBob Schafer and Roger Leatherman, you can see some of\nthe benefits of Media Log for taking soundings and\nbearings, and for getting some help as well.\nIn approaching media for Grade XI teaching,\nForsdale fs man had spent much time describing the way\nin which the various media are established and control¬\nled as businesses. All that he left out was any re¬\ncontinue ..."
}