{
  "id": "d316-92",
  "text": "October 9, 1959\nDr. C. Walter Stone, Director\niiducattonal ftadia Branch\n8. S. Office of Education\nDopertnent of Health, Education and Welfare\nWashington 25, D. C.\nDear '..’alters\nAttached ia a copy of sy letter of today to Harebell. This is the first I'to\nbeen able to get back to his project.\nThe nesting mot well. However, since sees of the people gate consultant\nfee* to cone, we (the HUES) will base to relrbureo then ia soae way (outside\nthe contract mossy free OSCE). Trawl only will be curated to the contract.\nCounting their usual rates, m bad at least |l,SOO worth of consultation\ntalent provided ly the MBS. All were in attendance except Harwood and Smarts.\nQwtefnl for Dick .vans. He got the project nailed dams hotter then wane.\nIf X ray quote from Bectorts letter to m (since I had to team early the\nlast afternoon}1\n•I was extremaly pleased with tea ootcow of the mating. frankly, X was not\noverly optimistic when X started far the meeting bat X believe that it proved\nto be quite fruitful. Hot a great deal more was secocyliahed after yon loft.\nIt was agreed that tersball weald develop a fairly coeytete and specific\nsyllabus of the course and have it circulated to us ty October' 15th. This\nwould also include a statement of the goal* of the course which might provide\nidaaa for the development of new kinds of instruments for seaauring these\noutcomes. The next step, tee envelopment of s design, oust wsit upon our perusal\nof this material because the design cannot be developed without knowing tee\nbehavioral goals of tee course - and we could not @st HarahsU. pinned dam ranch\non this point Thursday, tees we get the syllabus, the follortag jobs auet be\ndonst outline of tee osporlncntsl design including tee aosylcs to be used;\ntbs kinds of instruments to be utilised for tee ooltectiori of data} a descrip*\ntion of tee sort of treatment tee control groups get in rater to counterbalance\nany Hawthorns effect} s careful development of budget, etc."
}