{
  "id": "d316-99",
  "text": "Uimmsm of Houston\nSeptember 29, 1959\nfir, Harry J. Skornia\ntoeeutiw Director\nItUflMl Association of\nIdueational Broadcasters\nlit Oragory Hall\nUrbam, Illinoia\nOaar Harryi\nI was vary plaaaad that «# vara abla to gat tha NA£B Titla Til ra-\naaareh project doom to a reasonably oparational level. Dow, Marshall should\ntat tbs syllabus of tha \"Teaching Perception of Madia11 in shapa for fortjr\nfiva 30-miixuta ridso-tapad presentation*. I believe our daadlina on this\nvat Daoanbar 1* After —1 nl\"g tha contant of tha syllabus, tha evalnatlem\nproblem will bs aora claarly dafinad and tha final form of a dafanaibla\nrasaarch design can ba fashioned.\nAs I saa it, thars are two possibilities as far as tha Office of\niduoation is conoerasdi (1) Tha rasaarch dasitn and a budget encompassing\ntha necessary continuation funds could ba more or lass informally submitted\nto Valter Stone. The question is, oould they automatically authorise oom-\ntlunation funds which oould conceivably run as high as $100,000 (depending\non the elaborateness of tha tape productions and the siae and geographies!\nlocation of the samples of high school students to be ueed) without board\napproval or (2) they might want the new research design to bo resubmitted\nae ostensibly a new projact to ba competitively evaluated. If this latter\nle correct, than tha Job of developing tha rasaarch proposal would ba s\nmuch greater one than under (1) above. At any rata, tha masting wae inter-\neating end I ***** your preeenoe there provided e valuable cohesive ele¬\nment, not to mention, of course, an interesting participant ae well.\nAs you requested in Chicago, tha following items are e breakdown at\non tha trips (find appropriate receipt# enclosed)\nRound trip 1st dess air fart, Houston-Chioago $156,97 .\n. 23,60-***«*•**\n... 16,00\nI. 19.00\naosllaaaoua ••««««••• k*3>\nTotal $220.07\nZ hops tint all wont wall on your Mow York trip, Oled that we got ths\n(^4 ■\nHotel\nTipe, mi"
}