{
  "id": "d1745-3",
  "text": "/NoAe-£cB, News Letter, May 1, 1939\nPage 4\n“There are about two dozen education institutions with radio facilities\nwhich do not engage in commercial broadcasting.“\nMOHS ON THE FAMILY LIFE FORUM\nBecause we thought there would be considerable Interest in the Family\nLife Forum, we ashed Homer Heck and Harold Leake to give us more dope\non the broadcasts* Harold ^eake writes:\n“The Family Life Forun is a series of broadcasts under the direction\nof Dr. Alice Sowers, Professor of Family Life Education. The network\npays the charge between Norman and the key station, KTOK, in Oklahoma\nCity, and the University installed and rents a permanent loop from\nWNAD to the local test board* Just lately the project has been Joined\nby another station which does not belong to the network, located at\nEik City, which picks up the broadcasts off the air and rebroadcasts\nthem listeners say, satisfactorily.“\n“The Family Life Radio Forum is a series of broadcasts consisting of\nlectures, Informal discussions, and dramatizations on subjects pertain¬\ning to child guidance and family relationships*“\n“The purpose of this Radio Forun is: (1) to give information to indivi¬\nduals and to study grouos, (2) to stimulate further reading and study\non the part of listeners, and (3) to demonstrate some methods of adult\neducation* It will be of interest to parents, teachers, young people,\nsocial workers, librarians, leaders of youth organizations, and all\nother individuals and groups Interested in education for family living.\n“Two types of memberships are possible0 Individuals may become members\n(1) by signing the enrollment blank, and (2) by becoming members of a\nradio* grouo. Suggestions for organizing and conducting radio discus¬\nsion grouos will be mailed upon request. Questions and references for\neach broadcast will be mailed in advance to all individuals and groups\nwho enroll as memberso*\n“There is no enrollment fee and no charge for copies of broadcasts which\nwill be mailed to members*\n“Groups meeting each week will follow a continuous family life series.\nThe broadcasts have been arranged, however, so that groups meeting once\nor twice a month will also find subjects pertaining to a genera^ tnene,\nas follows: „ , ^ .\nFirst Tuesday - General Family situations\nSecond Tuesday - School Problems at Home\nThird Tuesday - General Family Situations\nFourth Tuesday - Character and Citizenship Development\n“At the end of the Forum, certificates will be nailed to all organiza¬\ntions which sponsor groups that complete the course; and to alx indi¬\nvidual members who listen to at least eighteen broadcasts*\n*For further information write to Dr. Alice Sowers, Professor of Family\nLife Education, University of Oklahoma, Norman, Okla.19"
}