{
  "id": "d1609-0",
  "text": "N A S 8 NEWS LETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nFrank E. Schooley, Editor* Station WILL', Urbama, III.\nJune I * 5 943\nWORLD WIPE SERIES AVAILABLE TO NAEB MEMBERS\nThe following letter from Walter *5. Lemmon, President, World Wide Broadcast¬\ning Foundation, speaks for itself:\nH In response to your letter of May 22, we have indeed planned to include\nthe Association of Educational Broadcasters in the list of stations to\nRECEIVE OUR TRANSCRIBED PROGRAMS DEALING WITH THE PROBLEMS OF THE POSTWAR\nWORLD. I THINK THIS SERIES WILL BE OF DISTINCT EDUCATIONAL VALUE, AND A\nVERY TIMELY ONE, We HAVE ALREADY HAD A NUMBER OF REQUESTS FROM MANY PARTS\nOF THE COUNTRY, BUT WE CERTAINLY WANT TO INCLUDE THE STATIONS OF OUR\nASSOC I AT I ON.\nThere is also another Series we have prepared in cooperation with the\nAmerican Philosophical Society of Philadelphia, which i think would be of\ninterest, particularly to Association member-3. This Series is called \"The\nInternationalism of Science\" and consists of a series of talks by eminent\nscientists in various fields of science, such as astronomy, oceanography,\nGEOLOGY, SEISMOLOGY, ETC., BRINGING OUT HOW THE PROGRESS OF SCIENCE HAS\nBEEN ADVANCED THROUGH INTERNATIONAL COOPERATION. We HAVE JUST STARTED\nRUNNING THIS SERIES OVER OUR SHORT WAVE STATION WRUL TO ENGLISH SPEAKING\nLISTENERS IN ALL PARTS OF THE BRITISH EMPIRE, AND WE ARE PREPARING A LIMITED\nNUMBER OF TRANSCRIPTIONS FOR DISTRIBUTION TO LOCAL STATIONS IN THE UNITED\nStates. If you are getting out a circular to member stations, I wish you\nWOULD ADVISE THEM OF THE AVAILABILITY OF THIS SERIES, WHICH WILL COVER ABOUT\nEIGHT FIELDS OF EXPLORATION. THE PROGRAMS ARE ALL ONE-QUARTER HOUR IN\nLENGTH.\nWith the facilities of our short-wave stations being utilized by the\nGovernment, we are turning the attention of our Foundation Program Staff\nto the development of many educational features for domestic listeners, and\nI AM GLAD TO LEARN OF YOUR CONTINUED INTEREST IN OUR EFFORTS.\"\nw ANSWER I I-jG YOU\" AVAILABLE TO NAEB STATION'S\nMr. Stephen Fry, BBC, 630 Fifth Avenue, New York City, advises that trans¬\ncriptions of \"Answering You\" will be made availaBle to NAEB members\ndesiring to use the program on the air. Those attending the Ohio Institute\nHAD AN OPPORTUNITY TO SEE AMO HEAR THE AmERICAN-END OF THE BROADCAST.\nWNYC AND WILL ALREADY ARE USING THE PROGRAMS. PERHAPS OTHERS, TOO. |F\nYOU WISH TO RECEIVE THE SERIES, WE SUGGEST YOU WFITE DIRECT TO MR- ^RYe\n\"ORDER COAL NOV;\" STfi AVAILABLE TO NAEB\nH. A. Gray, Deputy Solid Fuels Administrator for War, has advised NAEB that\nIF ANY MEMBERS OF OUR ASSOCIATION HAS NEED FOR THE RECORDS OF THE SERIES\nPREPARED TO PROMOTE ORDERING OF COAL NOW, HE WILL BE GLAD TO FURNISH THE"
}