{
  "id": "d1609-3",
  "text": "NAE8 NEWS LETTER\nPage 4\nJune I, 1943\nCEREMONIES BEING HELD AT CENTRAL PARK MALL ON SUNDAY, MAY I 0, MARKING THE\nCITY OBSERVANCE OF \"l Am An AMERICAN Day.\" VICE PRESIDENT HENRY A. V* ALL ACE >\nWHO RECENTLY RETURNED FROM A GOOD WILL TOUR OF LATIN AMERICA WAS THE\nPRINCIPAL SPEAKER, WNYC BROADCAST THE ”1 AM An AmEFICAN ^AY1' RALLY FROM\n3 TO 5 P.M., WHICH MEANS THE CITY STATIONAS LISTENERS ALSO HEARD CHIEF\nJudge Irving Lehman of the State Cour of Appeals lead thousands of citizens\nin the Oath of Allegiance to the Flag, a major feature of the observance,\nFCC SETS ASIDE WNYC Pr~ IT\nThe Federal Communications Commission, on June I ? set aside an order\nPERMITTING NEW YORK City's RADIO STATION WNYC TO EXTEND ITS EVENING\nBROADCASTING TIME FROM SUNSET TO TEN P.M, At THE SAME TIME IT ORDERED\nA REHEARING OF THE ISSUES RAISED BY THE ORDER. THE COLUMBIA BROADCASTING\nSystem contends that wr YC broadcasts after sunset interfere with the\nCBS Minneapolis station, WCCO,\nVHAS GIFT TC U.K. DOUBLES LISTENING CE TERS\nThe executive committee of the University of Kentucky board of trustees\nIN EXECUTIVE SESSION ON THE CAMPUS LATE IN MAY, ACKNOWLEDGED HW|TH GRATITUDE1'\nA FINANCIAL GIFT TO THE UNIVERSITY FROM RADIO STATION WHAS, LOUISVILLE,\nWHICH MAKES IT POSSIBLE FOR THAT INSTITUTION TO PRACTICALLY DOUBLE THE\nNUMBER OF ITS MOUNTAIN RADIO LISTENING CENTERS, THE PRESENT TOTAL OF 4l\nCENTERS WILL BE INCREASED TO ALMOST 80, UNIVERSITY OFFICIALS ANNOUNCED,\n\"COOLEflE PUBLIC RELATIONS BROADCAST 1NG\"\nThe Ohio State Institute for Education by Radio round table on College\nPublic Relations Broadcasting under the chairmanship of Jos, F„ Bright,\n0irector of Public Information and Director of Radio Station WILL at the\nUniversity of Illinois, approached the subject from five different view¬\npoints, T, T0 Frankenberg, Public Relations Counsel, Columbus, Ohio,\ndefined \"What Are Public Relations?\"; Harold Schellenger, Director of\nPublic Relations for Ohio State University, discussed \"Radio Public\nRelations Dividends To The College and University\"; Ross Bartley, Director\nof Public Relations for Indiana University, presented his ideas on\n\"Appropriate Themes Or Subjects For Utilizing Radio For Public Relations\";\nWalbo Abbott, Radio Director of the University of Michigan, tolo the group\nhow to \"Build Public Relations with Commercial Stations By Developing\nPrograms That Will Keep Them Happy\"; Julia Mary Hanna of the Chicago R*dio\nCouncil told of \"Public Relations Benefits That Accrue From In-School\nBroadcasting\"; and Judity Waller, Director of Public Service and Education,\nNational Broadcasting Company, cautioned ths listeners on \"Ho^ Not To Seek\nPublic Relations Through The National Networks.\"\nCopies of what all speakers said are not available, but we thought you*d be\nINTERESTED IN COMMENTS OF THOSE WE HAVE, SO WE1 RE GIVING YOU RATHER DETAIL¬\nED REPORTS ON REMARKS BY FOUR OF THE SPEAKERS,\nT. T, Frankenburg: In order to get down to brass tacks on so large a\nSUBJECT AS COLLEGE PUBLIC RELATIONS IN SO SHORT A SPRCE OF TIME AS IS HERE\nAVAILABLE, IT IS NECESSARY TO ASK THAT SOME THINGS BE ACCENTED AS FACTS\nWHICH, IF NEED BE, COULD BE PROVED BY TESTIMONY AND BRIEFS,"
}