{
  "id": "d1609-4",
  "text": "NAEB NE’VS LETTER\nPage 5\nJune I, S 943\nColleges need improved public relations for at least two reasons.,\n(1) Colleges and College people are a very small minority of the population,\nCERTAINLY NOT OVER 5fO ANO THE PUBLIC IS SELDOM WELL DISPOSED TOWARD\nMINORITIES.\n(2) Colleges continually tend to get away from the vernacular. They are\nPROGRESSIVE IN THINKING BUT CONSERVATIVE IN ITS EXPRESSION. The PUBLIC\nPREFERS CONSERVATIVE THINKING AND MODERN EXPRESSION. If COLLEGES MADE\nBRICKS AND COBBLED SHOES THEY WOULD REFER TO THEIR ACTS AS CERAMICS AND\nAPPLIED VOCATIONAL TRAINING.\nThe FUNDAMENTAL FACTS COLLEGES FACE AR NO DIFFERENT FROM THOSE WHICH CON¬\nFRONT CORPORATIONS, INDUSTRIES, BANKS, POLITICAL PARTIES, AND PROPAGANDA\nMOVEMENTS. All OF THESE HAVE PROGRAMS TO WHICH A MAJORITY ARE OPPOSED OR\nINDIFFERENT OR IGNORANT.\nTO MEET THIS CONDITION A WIDE RANGE OF EXPEDIENTS IS AVAILABLE. The ONLY\nPHASE THAT DIFFERENTIATES A COLLEGE PROBLEM FROM OTHER PrOBLEMS IS THE\nDEGREE TO WHICH IT MAY BE BILLING TO INVOKE CERTAIN KNOWN REMEDIES.\nThe BODY POLITIC, LIKE THE BODY PHYSICAL, RESPONDS TO CERTAIN STIMULI,\nRESISTS CERTAIN FORCES, TENDS TO IMMUNIZE ITSELF AGAINST REPEATED ATTACKS;\nCHANGES WITH CONDITIONS SO THAT WHAT IS EFFECTIVE AT ONE TIME MAY NOT BE\nAT ANOTHER.\nThis body of indifference, opposition, ignorance, prejudice, or fear can\nBE MOVED, MITIGATED, NULLIFIED, OR CONVERTED BY THE APPLICATION OF THE\nPROPER MEANS, AT THE PROPER TIME, AND OVER A NECESSARY PERIOD.\nWithin this field of stress and strain lies the province of the director\nof public relations.\nFor the better understanding of the term public RELATIONS, THE WORDS SHOULD\nBE TRANSFUSED. It IS THE RELATION OF THE PUBLIC TO THE PROJECT THAT IS\nIMPORTANT TO THE PUBLIC RELATIONS COUNSEL. He MAY KNOW THE WHOLE LIFE AND\nHISTORY OF THE COLLEGE WHICH RETAINS HIM; THAT HELPS, BUT HE MUST KNOW\nPUBLIC REACTIONS - THAT IS ESSENTIAL* WHEN HE KNOWS THEM HE CAN APPLY OR\nSEEK TO BRING INTO BEING FORCES THAT WILL CHANGE THAT PUBLIC INTO ONE MORE\nAGREEABLE TO HIS COLLEGE. ALWAYS HE MUST APPROACH HIS PROBLEMS FROM THE\nEVER SHIFTING VIEW POIN$ OF' THE PUBLIC, AT LEAST THIS PUBLIC. He IS IN THE\nPOSITION OF A PHYSICIAN WHO MUST KNOW SYMPTOMS BEFORE HE CAN PRESCRIBE\nREMEDIES.\nLike a military lader, he may make either a defense or an attack. He can\nDEVISE PROJECTS THAT WILL INTEREST HIS PUBLIC. He CAN CREATE AN ENTIRELY\nNEW PUBLIC. He MAY AMALGAMATE SEVERAL EXISTING PUBLICS. He NEED NOT\nAGREE WITH HIS PUBLIC, HE MUST KNOW ITJ HE MUST AT LEAST SEEM TO HUMOR IT.\nNo public in America can, for long, be driven* But it tends always to reach\nA CERTAIN LEVEL OF INTELLIGENCE AS WATER SEEKS ITS LEVEL.\nTo deal with his public the Po R. Man has many mediums. Newspapefs,\nMAGAZINES, MAIL, RADIO, MOTION PICTURES, PUBLIC ADDRESSES, MUSIC, DEMONSTRA¬\nTIONS, CONTESTSABE a FEW. He NEED NOT BE INTIMATE WITH ALL THE TECHNIQUES\nOF ALL OF THEM; HE CAN BUY THAT KNOT LEDGE. He MUST KNOW THE PSYCHOLOGY"
}