{
  "id": "d1609-7",
  "text": "NAEB HEWS LETTER* . .....Page 8.. .....June I, 1943\nCo Create friendly relations by accepting all gifts the stations are\nBILLING TO GIVE YOUo\nDo Recognize the commercial stations' problems of maintain an audience\nFOR THEIR SPONSORS,\nE„ Never let the station downl\nFo Cooperate in emergencies by shifting programs.\nBefore asking for time, examine the station's schedule and ask for\nthat time which is not filled in by a sponsor or by an outstanding\nsustaining program.\nH. Then submit a definite outline of program which will fit into the\nstation's DAILY SCHEDULED\nlo Do EVERYTING IN YOUR POWER TO PUBLICIZE THE UNIVERSITY PROGRAMSo\nMiss Judith Walters What a subject' After you have heard all these gentle¬\nmen TELL YOU HOW GOOD YOU ARE AND JUST WHAX YOU SHOULD DO TO GET ON THE\nRADIO, HOW YOU SHOULD DO IT, AND THE BENEFITS TO BE DERIVED THEREFROM, NOW\nYOUR CHAIRMAN COMES ALONG AND PUTS ME ON THE SPOT - THE BALLOON IS ALL\nBLOWN UP, REAOY TO TAKE OFF, AND HERE I AM HOLDING A PIN BEHIND MY BACK JUST\nREADY TO DO THE DEFLATING? In REALITY, 1 SHOULD HAVE BEEN THE FIRST PERSON\nTO TALK - I SHOULD HAVE TOLD YOU WHAT NOT IDO DO AND THEN LET THE REST OF\nTHEM TELL YOU HOW WRONG I WAS. W|LL, LET US LOOK AT THE PICTURE A MOMENT.\nIN THE FIRST PLACE, TIME ON ANY NETWORK IS EXTREMELY VALUABLE - THAT TRUISM\nMOST OF YOU HAVE HEARD MANY TIMES BEFORE. VALUABLE FROM TWO STANDPOINTS -\nEVERY PROGRAM SCHEDULED HAS A DOUBLE DUTY TO PERFORM, IT MOST TO CATCH AND\nHOLD THE ATTENTION OF THE LISTENER FIRST AND SECOND IT SHOULD ENCOURAGE THE\nLISTENER TO STAY WITH THE STATION TO HEAR THE PROGRAM TO FOLLOW. So TIME\nIS VALUABLE FROM A LISTENER STANDPOINT AND IN ADDITION FROM A SALES STAND¬\nPOINT. Every fifteen or thirty minutes given to any group or organization,\nMEANS A FIFTEEN OR THIRTY MINUTES WITHDRAWN FROM SALE, MEANS LESS REVENUE\nTO THE STATION. Ir THE PROGRAM BOOKED IN THAT PERIOD, AS A SUSTAINING\nFEATURE, IS INTERESTING ENOUGH TO HOLD THE ATTENTION OF MANY LISTENERS, THE\nGOODWILL BUILT FOR THE STATION, BROADCASTING THE PROGRAM, AND IN TURN FOR\nTHE NETWORK, JUSTIFIES THE GIVING OF THE TIME. So, I SHOULD SAY, THAT THE\nFIRST WAY, NOT TO SEEK PUBLIC RELATIONS THROUGH THE NETWORKS, WAS TO ASK\nFOR TIME AND THEN OFFER A POOR PROGRAM.\nIn THE SECOND PLACE, IN ASKING FOR TIME, WHAT IS YOUR OBJECTIVE? ^0 OFFER\nA PROGRAM OF INTEREST TO THE GENERAL PUBLIC REGARDLESS OF ITS INTEREST IM\nTHE SCHOOL YOU REPRESENT, OR MERELY AS ANOTHER MEANS ©F ACQUIRING BORE\nPUBLICITY - ANOTHER ITEM TO ADD TO YOUR SCRAP-BOOK AT THE END OF THE YEAR,\nWITH NO THOUGHT OF YOUR OBLIGATION TO THE STATION OR THE PUBLIC* F THAT\nIS TRUE, THAT IS THE SECOND LINK IN THE CHAIN OF HOW NOT GO SEEK PUBLIC\nRELATIONS THROUGH THE NETWORK.\nIm THE THIRD PLACE, LET US SAY TOU HAVE THE TIME AND A GOOD PROG RAM - IN\nOTHER WORDS YOU DO HAVE SOMETHING UNDERSTANDING OF THIS NEW MEDIUM, RAD 0,\nAND yoL ARE DEFINITELY CONSCIOUS OF YOUR RESPONSIBIL.TY WHEN YOU ACCEPT THE\nTIME ON A NETWORK, ANOTHER GOOD V'AY OF NOT BUILDING PUBLIC RELATIONS"
}