{
  "id": "d1742-0",
  "text": "NEWS NACB GETTER\nNATIONAL ASSOCIATION •- EDUCATIONAL BROADCASTERS\nFrank E. Schooley, Editor, Station WILL, Urbana, Illinois\nDecember I, 1942\nENTERS SERVICE\nPresident Harold Engel has been commissioned\narmy (Anti-Aircraft, Coast Artillery) and 'f\non the West Coast. Gilbert 0. Williams, WBAA\nNAEB Acting President.\nin the United States\nNOV SERVING HIS COUNTRY\n, IS NOV SERVING AS\nMcCarty joins o k i\nH. B. McCarty, director of State Station *HA since 1931 and\nASSOCIATE PROFESSOR IN THE DIVISION OF RADIO EDUCATION AT THE\nUniversity of Wisconsin, has been called for service »mth the\nOffice of War Information. He has been granted a leave from his\npresent duties and vill report for duty in New York City on December I\nas Senior Program Technician -ith the Overseas Branch of the 0 i.\nThe federal government has taken over privately owned shortwave\nstations ano till build others to a total of uo transmitters. These\nVILL BE BEAMED TO THE FAR CORNERS OF THE EARTH ANO OVER THEM THE\nGOVERNMENT1S CAMPAIGN OF PSYCHOLOGICAL WARFARE v !LL BE WAGED.\nMr. McCarty will be charged with the responsibility for maintaining\nEFFECTIVE USE OF A PORTION OF THESE BROADCAST ING FACILITIES AND THE\nSCHEDULING Or PROGRAMS TO APPEAL TO THE VAMOUS NATIONALITY GROUPS«\nIn 1930 Mr. WcCatty received a master's degree in Speech at the\nUniversity of Wisconsin* having previously been awarded a b.a. at the\nUniversity of Illinois, as a graduate student at Wisconsin, he\nBEGAN ANNOUNCING OVER AHA IN 1929. WHEN THE PLAN FOR EXPANDING THE\nSERVICE OF WHA WAS STARTED HE BECAME DIRECTOR OF THE STATION IN 1931.\nThe Wisconsin School of the Air, which no'*( supplies in-school\nSUPPLEMENTARY PROGRAMS FOR THOUSANDS OF CHILDREN EACH WEEK, ’A.\nmartm'SJ mr. McCarty in the fall of 1931. In IS35, he was sent to\nEngland by the General Education Board to study the educational\nBROaSca^InG BEING DONE IN THAT COUNTRY. WHILE ABROAD, HE OBSERVED\nTHE METHODS OF THE BRITISH BROADCASTING CORPORATION IN THE PRODUCTION\nOF PROGRAMS AT BROADCAST.NG HOUSE IN LONDON, ANO WATCHED THE USE OF\nTHE PROGRAMS IN CITIES ANO RURAL AREAS OF BRITAIN.\nMu McCarty is well-known nationally for his leadership in Radio.\nIN RECOGNITION OF HIS WORK, HE WAS MADE PRESIDENT OF THE NATIONAL"
}