{
  "id": "d1645-1",
  "text": "NAEB Requests Program Schedules\nThe NAEB would like to receive regularly two program\nschedules from each member radio or television station—one\nat the Washington address and one at the Urbana address.\nGene E. Kenny Dies\nGene Kenny, NAEB member, was killed in a flying accident\nat Clear, Alaska, on April 6. He was a personnel representa¬\ntive for RCA at Clear.\nFollow-up Notes on NAEB Region II Meet\nThe May Newsletter reported on the Region II meeting in\nTampa, but the following items were received after the dead¬\nline had passed for that issue.\n• Hill Bermont, program and production director, WGTV,\nAthens, Georgia, chaired the session on graphic arts and re¬\nports that it was a practical meeting, concerned with usage\nand working experience, and that no theoretical problems were\ndiscussed. During the meeting it was suggested that next year\nthere should be, besides the graphic arts session, one on pro¬\nduction. An exchange system through which southern sta¬\ntions could share production ideas was also discussed. [Ed.\nnote: Along this line, see item elsewhere in this Newsletter\nre the upcoming column in the NAEB Journal called “Pro¬\nduction Forum.”]\n• Mrs. Marydale Gray, WEDU-TV, Tampa, reports that\nabout 45 conferees met to discuss the area of formal instruc¬\ntion. It was the consensus of the group that future confer¬\nences should provide for the discussion of existing problems\nrather than an exchange of successful practices in the field.\nThere was much discussion of videotaping and the advantages\nof “live” versus taped programing.\nNAEB Will Sponsor Technical Day\nEngineers will be able to hear reports on new equipment and\nto discuss NAEB technical projects at an all-day session\nwhich will run concurrently with other meetings at the na¬\ntional convention in Milwaukee in November. This will not\nreplace general technical sessions of the convention. The\nNAEB Engineering Committee and Jansky & Bailey, NAEB\nengineering consultants, are planning the session specifically\nfor engineers.\nCorrection of Error in April Newsletter\nThe figures on page one in the story “Who Are Individual\nMembers of NAEB?” do not add up, as was pointed out to\nthe editor by an astute April Newsletter reader. Left out was\nthe figure of 33 “Miscellaneous” Individual Members. These\nare lawyers, doctors, librarians—people whose professions are\nnot directly connected with education or broadcasting.\nPeabody Award Goes to \"Carnival of Books\"\n“Carnival of Books,” long offered to NAEB Radio Network\nstations, has won the Peabody Award as an outstanding series\nfor youth and children. Mrs. Ruth Harshaw serves as creator\nand hostess for the program for WMAQ, Chicago commercial\nstation.\nAlabama Broadcasters Create AAEB\nAt an organizational meeting in Birmingham in late April,\nRaymond Hurlbert, general manager of the Alabama ETV\nCommission, was elected president of the new Alabama Asso¬\nciation of Educational Broadcasters. Hurlbert stated that the\nnew organization will benefit an estimated 100 persons in the\nstate who are actively involved in educational broadcasting-\nproduction or engineering, plus many classroom teachers who\nutilize the broadcast services. Members of the AAEB execu¬\ntive board are: Graydon Ausmus, director, University of Ala¬\nbama Broadcasting Services; Mrs. A. Bates, Birmingham\nArea ETV in-school instructor; Dr. Kermit Johnson, Alabama\nEducation Association president and superintendent, Jefferson\nCounty Schools; Louis Peneguy, AETC information director;\nBritt Thompson, Hayes Aircraft executive; Robert Ware,\nstudio chief engineer, Auburn University TV; and Dr. Edwin\nWilliams, Jr., in-school coordinator, state department of edu¬\ncation. AAEB address: 2151 Highland Avenue, Birmingham.\nITV Symposium Info Published Via Tape\nBoth audio and video tapes are available on the one-day sym¬\nposium on “Television as a Means of Instructional Communi¬\ncation” which took place January 26 on the Berkeley campus\nof the University of California. The audio recordings may be\nborrowed for two weeks free of charge. For the video re¬\ncordings, there is a charge of $3 per reel plus postage and\ninsurance. For more information, write Ken Winslow, Head,\nTelevision Office, 15 California Hall, University of California,\nBerkeley, California.\nSummer Workshops Offered\nAbilene Christian College. Radio workshop June 10-21. Co¬\nsponsored by the Texas Association of Broadcasters and\nthe college. Faculty will be outstanding radio broad¬\ncasters from throughout Texas, who will discuss com¬\nmercial radio, and other faculty members for other phases\nof radio. Write Dr. Lowell G. Perry, Radio Workshop,\nAbilene Christian College, Abilene, Texas.\nBoston University. Summer ETV workshop July 15-August\n24. Methods and techniques for effective in-class instruc¬\ntion via open or closed-circuit TV. Participants create\nprograms and present them over CCTV. Write Dr. Mur¬\nray R. Yeager, Associate Professor of Broadcasting,\nBoston University, 640 Commonwealth Avenue, Boston\n15.\nFordham University. Two ETV courses, July 3 to August 14:\n“Television in the Service of Education: A Survey of\nETV” and “Classroom Utilization of Television.” Grad¬\nuate and undergraduate credit. Five-day conference on\n“The New Media and the Schools,” August 19 to 23. To\ninclude utilization, ETV facilities, team teaching, ETV\nat all levels, foundation and government research and\naid, etc. Write: Chairman, Communication Arts Dept.,\nFordham University, Bronx 58, New York.\nHofstra University. TV workshop for teachers and adminis¬\ntrators, July 1 through July 19. Designed to acquaint\nteacher and administrator with latest techniques of prep¬\naration and presentation of ETV programs, and with\neffective utilization. Write Dr. Frank Iezzi, Director,\nSummer TV Workshop, Hofstra University, Hempstead,\nNew York.\nIthaca College. Broadcasting institute for high school juniors\nand seniors, September 13 and 14. Theme: “What kind\nof people does broadcasting need?” Each applicant should\nsend name, age, school, class, home address, and tele¬\nphone number—and a typed statement of 100-300 words\noutlining why he is interested in broadcasting or an allied\nfield. Applications close June 15. Mail to Prof. Royal D.\nColle, Chairman, TV-Radio Department, Ithaca Col¬\nlege, Ithaca, New York.\nNew York University. 28th annual workshop in television and\nradio, June 24 through August 2. Full-time professional\ntraining course in the technical and creative techniques of\nbroadcasting. Write Warren Bower, Assistant Dean, Di¬\nvision of General Education, New York University, 1\nWashington Square North, New York 3, New York.\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 119 Gregory Hall,\nUrbana, III. $5.00 a year, $7.50 including Washington Report.\nEditor: Betty McKenzie. Phone 333-0580. Area Code 217. Report¬\ners: Region I—Michael Ambrosino, Ruane Hill: Region II—Shirley\nFord, Lou Peneguy: Region III—McCabe Day; Region IV—Richard\nVogl.\n2\nNEWSLETTER"
}