{
  "id": "d1645-3",
  "text": "Angeles; Dr. Alexander Piper Runciman, St. Louis; Gregg\nN. Sallee, Sr., Anaheim, California; Saul N. Scher, Brook¬\nlyn; Louise Schwandt, Pell Lake, Wisconsin; William M.\nShimer, Albuquerque; Richard Wayne Shoemaker, Colum¬\nbus; Jack D. Sipe, Miami; Capt. Charles P. Stephens, Ran-\ntoul, Illinois; George F. Thoma, Escanaba, Michigan; Mich¬\nael Vidor, Santa Monica; Philip Weinberg, Peoria, Illinois;\nBernard Weisberger, New York; James C. Wulliman, Mil¬\nwaukee.\nNews Notes\nPERSONNEL\n^ Russell L. Casement has been appointed executive director\nof KRMA-TV, Denver, effective July 1.\n^ Robert P. Crawford, director of broadcasting at Queens\nCollege, has been granted a Fulbright award for the fall\nsemester at the University of Glasgow in the field of educa¬\ntional television.\n^ Three of the eight CBS Foundation News Fellows for\n1963-64 hail from educational stations. They are: Will I.\nLewis, news director, WUFT (TV), University of Florida;\nDonald C. Miller, program supervisor, KUSD-AM-TV, Uni¬\nversity of South Dakota; and Robert Richter, manager of\nspecial projects, KOAP-TV, Portland, Oregon.\n^ Kenneth Harwood, professor of telecommunications at the\nUniversity of Southern California, has been elected to two\nposts in the AAUP recently. He was elected to the governing\nboard for a three-year term, by nationwide competitive ballot\nof the 54,000-member association. At the 49th annual meeting\nof the organization in late April, he was elected chairman of\nthe Assembly of State and Regional Conferences. Harwood\nhas served on the NAEB Board of Directors and is presently\non the Membership Committee.\n^ Mrs. Fannie Mason Steve, conductor of the Wisconsin\nSchool of the Air’s “Rhythm and Games,” has received the\nfirst special McCall’s Golden Mike Award for “outstanding\nservice to the youth of America.” Mrs. Steve has been broad¬\ncasting over WHA, Wisconsin’s state radio station, since 1931.\nWHA also received a citation for making Mrs. Steve’s work-\npossible.\n^ Another teacher in the educational broadcasting field, Mme.\nAnne Slack, won a McCall’s Golden Mike for “outstanding\nservice to the American future by a woman broadcaster.” Her\nprogram, “Parlons Francais,” is carried by 46 TV stations in\nthe U. S. and Canada.\n^ Colonial Williamsburg’s Hugh DeSamper has been promoted\nto director of the press bureau and will now have responsibil¬\nity for newspaper and magazine liaison as well as radio and\nTV.\n^ Herbert Howard, manager of the University of Tennessee\ntape network, has been named editor of the Tennessee Asso¬\nciation of Broadcasters Newsletter.\nGENERAL\n^ Looking forward to the target date (September 1964) for\nits own station, Central Florida ETV announces considerable\ngrowth in the use of ETV through donated air time by three\ncommercial stations in Orlando—Channels 2, 6, and 9. Be¬\nginning in 1961 with only two programs in conversational\nSpanish, the eight-county ETV development has grown from\n24,000 pupils viewing each school day to 81,000 pupils view¬\ning six in-school programs. Added to the two Spanish pro¬\ngrams have been two elementary science programs, one in\nAmerican history, and a series on “Americanism vs. Com¬\nmunism” loaned by WEDU, Tampa.\n^ RCA has announced three new sound distribution systems\nsuitable for school use. They include a low-cost consolettc\nwith 10-watt program amplifier and up to 16 paging or sound\ndistribution areas, and a larger 20-watt unit with up to 26\npaging areas. The third system is identical with the 20-watt\nunit, with the addition of an AM-FM radio tuner for back¬\nground music.\nIraq Needs Experienced Professors\nThe Fine Arts Institute in Baghdad, Iraq, wants experienced\nAmerican professors to fill the following vacancies for the\nacademic year 1963-64: radio and television production; mo¬\ntion picture production; and stage design, lighting and man¬\nagement. Salary will be paid in local currency; travel allow¬\nances and housing benefits are stated in the contract. For\nfurther details, write Mr. Patrick K. Robbins, The American\nFriends of the Middle East, 1607 New Hampshire Avenue,\nN. W., Washington 6, D. C.\nPLACEMENT\nPERSONNEL AVAILABLE\n(For information, write Mrs. Jacqueline Swain, Placement Serv¬\nice, at the NAEB office in Washington.)\nJune I—Imaginative young man, 27, seeks ETV writing/pro¬\nduction position demanding multiplicity of talents. M.A.\nin radio-TV; over 5 years professional experience in all\nphases of ETV-radio (including writing-producing-direct-\ning for Armed Forces Radio and TV Service); strong\nbackground in film, theatre, acting, and in education\nresearch. Prefers new station. Salary open.\nJune 2—Desires to relocate summer or fall in administrative\nand/or creative role. M.A. in radio-TV; currently direct¬\ning all radio-TV activities for major university, including\nprogram planning, production, writing, liaison for inter¬\nnational and network broadcasts. Male, 33, wife and\nchild. Location open; salary negotiable.\nJune 3-—Newsman with special emphasis on writing, producing\nand narrating documentaries and special feature for\nradio/TV. M.A. in TV, Northwestern U.; commercial ex¬\nperience in writing and producing for radio and TV;\nadditional experience in business administration. Salary\nrange $6,000-$ 10,000 depending upon responsibilities.\nJune 4—Radio-TV and speech instructor and producer. M.A.\nin radio-TV; 4 years ETV experience as producer-director.\nAge 26, married, veteran. Prefers Pacific coast; mini\nmum $6,500.\nJune 5—Producer-director. B.S. in radio-TV; 3 years experience\ndirecting over 2200 live instructional television programs\nwith CCTV school system. Age 30, married, veteran.\nLocation open.\nJune 6—ETV director available. Ed.D. (administration & ETV).\nSolve your ETV problems: surveys, organization, imple¬\nmentation, evaluation, workshops, \"telephone tieback,\"\nairborne. Male, age 44, married. U. S. or abroad; sal¬\nary $14,000.\nJune 7—Single man, 21, will obtain B.A. in September, 1963,\nfrom Wayne State U. and desires full-time work after\ngraduation in directing-producing area. Willing to work\ntoward M.A. Location open but Southwest or western\nU. S. preferred; salary $5,000-$5,500.\nJune 8—ETV production manager. B.S. in broadcasting; M.A.\nin public relations; 2 years experience. Male, 28, single.\nLocation, except for Southwest, open; salary $6,000.\nPOSITIONS AVAILABLE\n(In order to be considered by these institutions, the reader\nmust be an Individual Member of the NAEB, with credentials\non file with the NAEB Placement Service. Non-members can\nsave time by sending the $10 annual dues and $5 Placement\nregistration fee at the time of inquiry.)\nJ-l — Producer-director experienced with live and taped pro¬\ngrams. Must have had responsibility for producing and\ndirecting full series. Location: East Coast.\nJ-2—Staging and lighting manager. Responsible for studio set¬\nup, lighting and supervision of set construction; new,\nexceptionally well-equipped large university, two-studio\nTV unit. M.A. desired. Salary determined by qualifica¬\ntions. Location: East Coast.\nJ-3—TV visuals and graphics artist. Experience in lettering and\ncartooning; knowledge of photography helpful; new, ex\nceptionally well-equipped large university, two-studio TV\nunit. M.A. desired. Salary determined by qualifications.\nLocation: East Coast.\nJ-4—Producer-writer. Alert, mature, production-teaching or¬\niented male who wants to grow with a UHF in-school\nETV station. Preferable that candidate be certified to\nteach; M.A. desired. Location: West Coast.\n4\nNEWSLETTER"
}