{
  "id": "d1645-7",
  "text": "CLASSROOM TV NO THREAT\nTO TEACHERS\nFears that TV in schools might reduce classroom\nteachers to “baby sitters” and “monitors” are un¬\nfounded, according to Miss Jean Moser, a veteran\nhistory teacher in the Hagerstown Schools, Md.\nMiss Moser arrived at her conclusion after nearly a\nyear of sharing the “spotlight” with TV teachers in\nher school’s county-wide closed circuit TV project.\nIn a detailed report to the Educational Television\nand Radio Center in Ann Arbor, Mich., Miss Moser\ndescribes the effectiveness of TV as a supplementary\ninstruction device.\nShe attributes the success of the Hagerstown pro¬\nject mainly to the careful planning which preceded\nthe program and to the creation of TV teacher-class¬\nroom teacher teams. Under this arrangement, TV\nteachers are responsible for work that TV can do best,\nwhile classroom teachers attend to those areas of in¬\nstruction which require direct contact with the pupils.\nThus, classroom teachers handle discussions, clear\nup misunderstandings, direct and supervise activities\ngrowing out of TV lessons and help pupils develop\ndesirable habits. TV is primarily used to stimulate in¬\nterest and to demonstrate.\nThe fact that the TV teacher appears to be look¬\ning directly into each student’s eyes serves, according\nto Miss Moser, to increase students’ attention. She\nbelieves that the average student’s interest can be\nheld by TV instruction approximately 30 minutes.\nInstructions beyond that limit, she holds, might be\nlost.\nMiss Moser is convinced that the classroom\nteacher part of the team must be a better qualified\nand more forceful teacher than traditional teaching\nmethods require. She also stresses the importance of\na thorough background in child psychology and teach¬\ning techniques.\n“Thanks to television and the way we are using\nit,” Miss Moser concludes, “we are providing better\ninstruction in the subject matter fields than we pro¬\nvided by traditional methods.”\nThe Hagerstown project is aimed at bringing\nclosed-circuit TV instruction to 18,000 pupils in 25\nschools by 1958.\nFirst graders at Hagerstown, Md., respond readily to TV lessons, now an accepted part of\nclassroom instruction. Mrs. Bonita Cookly's pupils have some quick answers to her discussion questions.\n(Photo supplied by the Educational Television and Radio Center, Ann Arbor, Mich.)\n8\nNEWSLETTER"
}