{
  "id": "d1335-0",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BHD ADC AST JOBS\nHBB#X5\nJuly 28, 1948\nAmes, Iowa\n/\nDear K-A-B-B Member;\nSome tiro® ago the H-A-K-B Clear Channel Committee seat you tentative copies\nof the memoranduiu brief to bs presented in the oral argument in re the\nClear Oh innel Bearings before the FCC,\nI nm now enclosing the final» corrected brief as it wa© presented by Mr\nMarcus Cohn, attorney representing th© National Association of Broadcasters\nin this matter.\nThe National Association of Educational Broadcasters hat a dual interest in\nthis clear channel issue. As you know nine of Us somber stations (WHYC,\nWKAH, WHCU, XUOM, WCALt WNAD, W'OSU, KOAG, ?OI) »ere directly concerned, in\na larger sense, however,, this case typified th® whole matter of the rights\nand privileges of educators to broadcast and serve special publics, The\nspecific problems—those of securing adequate time and power to reach and\nnerv® in the fullest sense those audiences dependent on these nine N-A-E-B\nstations—is the problem and duty of every educatiosml station for each of\nits audiences.\nThis particular case, new before the FCC, illustrates again the fact that\neducational stations, in a very real sense, d&. represent trie only. .liipZl&L ^\nvoice** in the U. S, Badlo. It Illustrates another consideration which should\njaake each of us do a little introspective searching—how well and tow broadly\nare each of us actually serving our audienr.e? Bow well are we responding to\nth© needs of our particular locality or region? In short are we doing a job\nw® should fight for to cio better—and a job which will inspire others to\nsupport our efforts/\nIf African commercial radio serves and satisfies two-thirds of the listening\npopulation what about the remaining one-third? Are we serving all of it. or\nthe upper b or 10 percent? Are we serving the MAJORITY OF OUR MINORITY\nAULIEHCB? If we are no;, are we radio stations public address systems?\nSincerely yours\nPresident\nEBB;CLD\nEnc„ 2\n?.S. Also enclosed is Richard B* Hnll»s statement before the Senate Investi¬\ngating Committee number S„ 2231, April 14."
}