{
  "id": "d1335-14",
  "text": "in the cLaA&xoom\nThe amount of preparation which the\nchildren should have will depend to a\nlarge extent on the type of program to be\npresented. Some programs may best be\nused as a climax to a series of activities\nor a unit of work. In any program where\nthe content may be unfamiliar to the\nchildren, enough experiences should be\nplanned beforehand so that the broad¬\ncast will be as meaningful as possible to\nthem. This may include clarification of\nunfamiliar words or terms, reading, re¬\nsearch, reports, discussions, or handling\nof visual aids. In a travelogue, a study\nof the map of the particular area to be\ncovered might well precede the broad¬\ncast.\nOn the other hand, there may be pro¬\ngrams which are a taking-off point, de¬\nsigned to stimulate interest in a new\nfield. Here the major emphasis would\nbe upon post-broadcast activity. A\ndramatization of the housing problem\nmight be an example of such a program.\nPreparation would involve little more\nthan setting the stage for listening, with\nthe program acting as the stimulus to a\nstudy of the problem.\nNo factor is more important in de¬\ntermining the effect of a broadcast on\nchildren than the attitude of the teacher.\nThe class will, in most cases, be as en¬\nthusiastic or as indifferent as she. The\nteacher who obviously looks forward to\nhearing the program, listens attentively\nand shows her enjoyment, gets far better\nresults than the one who turns on the\nradio and then corrects papers or looks\nout the window while the program is on.\nVarious techniques may be used to\nmake listening more effective. Generally\nspeaking, anything that will tend to dis¬\ntract the attention of the listeners should,\nif possible, be eliminated. On the whole,\nthe less activity in the room the better,\nexcept during those broadcasts which\ngive directions for the children to fol¬\nlow. Showing pictures, pointing to maps\nand so forth should usually be done\neither before or after rather than during\nthe program.\nAny minor adjustments which will re¬\nmove strain and make listening more\npleasant should have been made before\nthe program is turned on. Providing a\nwell-ventilated room, reseating children\nso that those who have difficulty in hear¬\ning are near the radio, adjusting shades,\nand making sure that there will be no\ninterruptions all make for more effective\nlistening.\nJjJ XPERIMENTS tend to show that\npupils who take notes during broad¬\ncasts do not assimilate and retain as\nmuch of the content as those who de¬\nvote their whole attention to listening.\nThis is particularly true of elementary\nschool children where lack of skill in\nwriting and spelling makes note-taking\na slow process. Writing during a broad¬\ncast with the purpose of reproducing\nparts of the content should certainly\nnever be a forced activity. If statistical or\nspecific factual material which may be\nvaluable later is given, the teacher may\nwish to write this down herself. Dur¬\ning certain types of broadcasts, however,\npupils should feel free to jot down ques¬\ntions which arise in their minds or points\nwhich they wish to discuss later.\nThe activities arising from a broad¬\ncast will depend on the teacher’s pur¬\npose in using it, its value for the chil¬\ndren, and the degree of interest it has\naroused. Certain types of programs may\nlead to much more discussion than\nothers. The teacher may wish to em¬\nphasize or enlarge certain points, or help\nthe children to clarify issues that have\nbeen raised. A good discussion period is\nrarely one that attempts to check on\npupils to see how much of the content\nof the program they have retained. Such\ndiscussion should, rather, arise naturally\nfrom the children’s interest in the sub¬\nject and their desire to talk about it.\nThe teacher can also, through discus¬\nsion periods, help to develop a critical\nattitude in pupils toward points of view\nexpressed in radio programs. This is prob¬\nably more important with reference to\nout-of-school than to in-school listening.\nChildren should learn not to accept\nblindly whatever they hear on the radio.\nThe person who is able to think critically\nand to evaluate opinions and sources of\ninformation will be most capable of deal¬\ning intelligently with life situations.\nDevelopment of this ability is one of\nthe principal objectives of education."
}