{
  "id": "d1335-2",
  "text": "t\nif\nREPORT TO I EIBER-S — 194B ANNUAL IEETING\nTHE 22IID ANNUAL MEETING OF THE NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nwas held October 10,11,12 on the University of Illinois carpus with member\nstations, MILL \" TTD WIUC, together with the Institute for Communications Research\nacting as joint nosts. (A complete registration list is attached to this report).\nFive of the six NAEB regions were represented; West coast director and members\nwere unable to be present, either at the NAEB meeting or the School Broadcast\nConference in Chicago following the Urbana meeting. Washington was only West\nCoast state represented.\nSESSIONS OPENED SUNDAY EVENING T7ITK AN ADDRESS BY DR, FREDERICK SIEBERT. director\nUniversity of Illinois School of Journalism, a prominent authority in the field\nof radio and newspaper libel law, who testified as an expert in the \"Mayflower\"\nhearing before the FCC last year. Speaking as a representative of the Institute\nfor Communications Research, he addressed the group on \"The Right to Know\" and\nthe problems in this area that modern communications technology has called forth*\nM. S. Novik, NAEB executive secretary and well-known radio consul'ant in New York\nCity reported on the current status of FM, expressing a confidence in its future,\nreviewing in this connection the problems of big and little business, trans¬\nmitter and receiver situation, and the question of advertising and promotion,\n*There is considerable evidence to indicate the promotion problem will be aided\nby the decision of some key manufacturers to place full emphasis behind FN,\nON MONDAY. SESSIONS OPENED TTITH A BUSINESS 1EETING. and were followed by a series\nof reports which included:\n\"Operation Policy in an AN' Non-Commercial Outlet\" - Jim Miles, WBAA,\n• Purdue University\n\"Indiana U. Survey of Educational Stations\" - Robert Lee, Acting. Radio\nHead, Indiana University\n\"Meaning of n Land-Grant College Station\" - R. C. Bentley, Market Editor\nWpl, Iowa State College\n\"Wisconsin’s State FN Nework—It’s Promise\" - Harold McCarty, Director,WHA\nUniversity of Wisconsin\nMONDAY AFTERNOON SESSIONS INCLUDED:\n\"Low-power FN Opportunities and Costs\" - Dr, Franklin Dunham, U.S.Office of\nEducation & Ed. Jones, WAER, Syracuse\nUniversity\n\"Story of WNYC-N.Y. Municipal Bdcst.System - Seymour Siegel, Stations WNYC\nand WNYC-FM\n\"The Board of Education FM Station\" - Dr. I. Keith Tyler, Director Ohio\nRadio Institute\n\"KOAC and the Clear Channel Case\" - H. H, Leake, Director of Radio\nOklahoma A & M College\n\"Report on the FCC Television Hearings\" - Carl Menzer, Director WSUI AND\nKSUI, University of Iowa\nTHE ANIMAL BANQUET MONDAY NIGHT HIGHLIGHTED THE 1940 ANNUAL MEETING with- an\naddress and a highly useful question and answer period by Benedict Cottone, Gener¬\nal Counsel of the Federal Communications Commission(copies of the Cottone address\nare appended to this report). Climaxing the evening was an address by Dr. hTilbur\nSchramm, director, Illinois Institute for Communications Research, who spoke on\n\"lass Communications Concepts\" stressing the incredible growth of communications\ntechnology in new world of television, ultra-fax, facsimile, FM and a host of\nother devices and the cultural lag, and the social and technical problems raised\nby this development."
}