{
  "id": "d1335-5",
  "text": "-4-\nDiscussion of separating function of Soeretary-Treasinger into two positions was\nconcluded with a vote it bo left to the discretion of the Board of Directors.\nMotion by Abbot, University of Michigan (liUOM), Second by'Coleman, Michigan\nState. College (brAR),. Motion carried.\nDiscussion of Constitutibn a.hd. possible changes resolves itself into recommenda¬\ntions it be held over' for action by Board, of Directors just taking office.\n\\\nOther Busiho s d\nVice-president John Dunn (University of Oklahoma) (XJNAD) discussed a more extensive\nregional plan for the Association, calling attention totiieirabsence at the current\nmeeting, and the need for more such mem bers in broadening the base of Association\nactivity and making its operation more practical on local and regional levels.\nDunn called for a more intensive plan for regular regional meeting with^regular\nsessions planned for February or March. H. H. Leake, Oklahoma A & 1(KdiG)\nstressed,the necessity for careful programming and thorough planning for such\nmeeting.. McCarty, University of Wisconsin, asked that more detailed plans be\ndeveloped for such meetings, requested' careful statement of who and what potential\nmembers would be. ' Further discussion was carried on by Schoolcy, University o±\nIllinois (WILL); Menzor, University of Iowa (WSUl), and Steetle, Louisiana State\nUniversity (WL3U).\nAbbot, University of Michigan. (WOK) stressed need for aid, advice and consulta¬\ntion to small colleges,.hnd said KALB must show ability to assist these schools,\nWright, University of Illinois(WILT) asked how regional MALE organization could '\nhelp members broadcasting over commercial stations. President regretted\npresent inability to provide complete operations brochure to institutions re¬\nquesting advice, suggested such an item bo developed. _\nExecutive Secretary\nNovik, NAEB executive secretary, reported on his office and duties, stressing\nneed of concerted action and cooperation and practical approach in fulfilling\nNAEB■objectives.. He reported briefly on FM situation in the East, his appearance\nbefore FCC in Mayflower hearings, and offered services of his office in securing\nspecial educational transcriptions available from various foreign and domestic\nagencies in New York, Novik presented Treasurer's report in absence of W. I.\nGriffith (Iowa State College, NOl). Novik underscored recommendation.for\nregional meetings, suggested sufficient college administrators participate as\nwell\"as broadcasters.. Wright, University of Illinois (WILL) moved report\nacceptance, and Coleman, Michigan State College (WAR) seconded. Motion carried.\nPresident'-s Report _\nHull, Iowa State College1(WOI),; road FCC Commissioner V Walker's letter regretting\ninability to1attend meeting, rccbmrbMing^ rapid:development of FI channels.\nStated belief NAEB strength lays in institutional membership, either associate\nor active and suggested' 'subscription list for newsletter to accommodate indivi¬\nduals. Suggested Committee on religious Policy for Association. Reported growth\nof NAEB to°95 members. Reported NABB's participation in Clear Channel hearings\nbefore the FCC, Johnson Bill hearings before the Senate, various member partici¬\npation in Mayflower and other' FCC hearings. Reported NAEB activity with.respect ^\nto FCC STA ruling, Reported' various- consultations and advices to educational\ninstitutions who have begun or plan to begin institutional broadcasting.with^ x\nstations of their own. Reported possibility of international organization of\nNAEB. Exhibited map showing distribution of NAEB member stations and associate"
}