{
  "id": "d1665-10",
  "text": "THE EDUCATIONAL NEWS BULLETIN\nday best suited to listening. Colleges, universities, school systems, and\nother educational agencies, when given any time at all, have been forced\nto take the least desirable hours. , .\nThe educational stations are those owned by the states, by educa¬\ntional institutions, and by other nonprofit agencies. They constitute\nanother means of reaching the listeners with educational programs.\nMost of these stations have been meagerly financed and their assign¬\nments of frequency, power, and time on the air have been unsatisfactory\nfor serving their constituents. Michigan has one station of this type\nWKAR, operated by the state college at East Lansing. In the neig 1-\nboring states of Ohio and Wisconsin are found two of the better\nfinanced and more effective educational stations. The establishment\nof similar stations in other states would be desirab e. Financial con\nsiderations are the only ones which so far have delayed this forward\nprogram. ,\nIf most of the American radio stations are to continue to be sup¬\nported by commercial advertising, it is essential that some means be\nadopted for insuring the presentation of suitable educational programs.\nIt has been suggested that the Federal Communications Commission\nrequire of all licensees the setting aside of certain definite hours in the\nevenings as well as during the day time and that the use of these hours\nbe controlled by the responsible educational authorities. If such a\nscheme were put into effect many of the present difficulties would be\neliminated. It would go far in restoring free speech and in eliminating\nthe present vicious commercial censorship. However, some of the weak¬\nness to which attention was called by Mr. Bliven and Commissioner\nPavne would still persist. . , ,\nAnother solution to radio’s problems is the proposal made by the\nNational Committee on Education by Radio. It has received wide-\nspread approval among educational, civic, and governmental leaders.\nThis proposal is for a noncommercial chain to parallel the present com¬\nmercial networks. Briefly, the plan contemplates a system to be con\ntrolled bv national, regional, and state boards. The selection of mem¬\nbers of these boards would be so well safeguarded as to take them com¬\npletely out of politics and make them wholly representative of the edu¬\ncational and cultural life of the nation. A more comp ete description\nof the plan can be found in the May 16, 1935 issue of Educatwn by\nRadio, which can be secured free by writing our organization in Wash-\nington, D. C.\nRegardless of what changes may take place, there is one measure\nwhich listeners could take that would improve the present situation.\nIt involves the assuming of a more critical attitude toward programs.\n- 8 -"
}