{
  "id": "d1665-13",
  "text": "WESTERN STATE TEACHERS COLLEGE\nonly the use of words but the confidence which makes for salesmanship.\nAnd progress must be carried forward on the spearpoints of salesman¬\nship.\nWe should also be putting on the air a continued training some¬\nwhat on the level of the high school but let it be courses untroubled by\ntoo much difficult terminology. Thus there should be economics en¬\ntitled, “Learning to Make a Better Living”; Sociology, “Learning to\nLive Together”; Civics entitled, “Uncle Sam at Work”; English and\nRhetoric under “Every Man a Salesman”.\nThere is no sufficient reason that every school house of America\nmight not voluntarily become the home of ai night school. The Super¬\nintendent of Schools might seek volunteer discussion leaders who would\nlisten with the adults gathered at the school building each evening.\nThese leaders would listen and then lead the discussion. They could\nthen add such teaching as their own mastery of the subject permitted\nand give to those who desired it a chance to fill out a carefully devised\ntest sheet which would show whether or not they had arrived at mas¬\ntery of each lesson. The desks, the blackboards, the maps and other\nequipment of the school would then be rendering their services to added\nthousands.\nSuch courses need not be as formal as the broadcasts which are\nsent into our schools by such efforts as the Ohio School of the Air, the\nWisconsin, the American, and others. Nevertheless, many of the same\nconsiderations would apply to this “Night School of the Air” as ap¬\nplies to the daylight ones.\nThe following decalogue is one used by the Ohio School of the\nAir to emphasize that the successful use of radio broadcasts is a matter\nof teamwork between the broadcaster and the classroom:\n1. Provide satisfactory radio equipment.\n2. Listen in small groups, preferably in classrooms.\n3. Allow each class to listen only to the features intended for them.\nInsist on close attention, always.\n4. Study the Courier, interest the class in the course as a whole.\n5. Develop their interest in every broadcast, provide necessary ground\nwork, prepare.\n6. Learn how to receive three types of broadcasts with their varying\nrequirements:\n(a) Motor activities\nAllow children to follow directions of the microphone teacher\nas in rhythmics, learn to sing, etc.\n(b) Visual activities\n-11 -"
}