{
  "id": "d1665-2",
  "text": "THE EDUCATIONAL NEWS BULLETIN\nWESTERN STATE TEACHERS COLLEGE\nVOLUME VI OCTOBER NUMBER 1\nREFLECTIONS AND ANTICIPATIONS\nAn Editorial by\nWm. McKinley Robinson\nDirector, Western’s Radio Hour, 1933-1935\nWe are indebted in this issue of the BULLETIN to a group of\nauthorities well known in the field of educational broadcasting. All\nof them have faith in the potentialities of the radio when understood\nand used as one of our most powerful educational agencies. As yet,\neducators on the whole have not seriously considered its possibilities.\nWestern State Teachers College has been among the first of the\nteachers colleges to incorporate regularly scheduled broadcasts among\nits accepted activities. Four years ago it entered the field through the\ngenerous co-operation of the local broadcasting station, WKZO. Two\n15-minute broadcasts each week plus Sunday half-hours twice a month\nhave been scheduled during the academic year.\nThe most trying experiences of the director have been with attitudes\nof scepticism or condescension. In mentioning these, I do so because\nthese are the points at which we need most help. Let me hasten to\nadd, however, that actually these were overshadowed by1 the response\nreceived from our listening audience and by the co-operation and hard\nwork of faculty members and outsiders asked to participate. Some of\nthe 15-minute roundtables broadcast required, according to reports, from\nfifteen to twenty-five hours for preparation.\nFirst, many faculty people even yet look upon radio programs as be¬\ning primarily cheap and vulgar, having about the same relation to the\nlistening audience as the penny tabloids have to the newspaper reading\npublic. A few entertain for the radio such contempt that they will not\neven have one in their homes; however, this number grows smaller all\nthe while. In casual conversation with almost any member of the\nfaculty, one finds he listens to certain broadcasts and wishes he had\nmore time to listen to more of the many worthwhile programs avail¬\nable. I sometimes wonder whether we school people have not devoted\ntoo much time to criticism of the weaknesses of the radio and too little\n- 1 -"
}