{
  "id": "d1665-23",
  "text": "WESTERN STATI TEACHERS COLLEGE\nalso discussed “The Clinical Approach to the Problem of Remedial\nReading” at the Elementary section of the Michigan Educational Asso¬\nciation in Detroit on October 11.\nMr. Herbert Slusser, of the English Department, spoke on “Some\nObjectives in the Teaching of Oral Interpretation of Literature” at\nthe Michigan Educational Association meeting in Battle Creek, Octo¬\nber 10, 11.\nDr. John P. Everett, of the Department of Mathematics, presented\na paper on “Students’ Marks” at the meeting of the Faculty Science\nClub held at the home of Mr. John Fox, of the Department of Physics,\non October 16.\nDr. George H. Hilliard, of the Department of Education and\nPsychology, lead a discussion on Remedial Reading at the meeting of\nthe Michigan Educational Association, on Thursday, October 10 in\nBattle Creek. T. he discussion followed an address given by Dr. Wm. S.\nto the Rural Section. On Friday, October 11, Dr. Hilliard led a\ndiscussion following an observation lesson in Remedial Reading given\nby Mrs. Ruth Coates, a former student of Western State Teachers\nCollege, at the meeting of the Michigan Educational Association.\nDr. Smith Burnham, of the Department of Social Science, spoke on\nthe Constitution at a dinner meeting of the local post of the American\nLegion on September 10. On September 17 he gave two addresses in\nconnection with Constitution Day activities. In the afternoon he spoke\nto the Detroit chapter of the Sons of the the American Revolution and\nin the evening he addressed a joint meeting of the Masonic lodges of\nKalamazoo. On October 5, Dr. Burnham presided at the Centennial\nDinner of the State Historical Society in Battle Creek.\nMiss Mathilde Steckelberg, of the Language Department, was\ngranted one year leave of absence. She is teaching German at the\nUniversity of Nebraska. Miss Magdalene Lau of Lincoln, Nebraska\nis taking Miss Steckelberg’s work for the year.\nMiss La Verne Argabright, of the Nature Study Department, gave\na talk to the Training School at the assembly period on October 3.\nThe subject of her address was “Birds of the Kellogg Sanctuary” .\nOn October 29, Dr. W. R. Brown, of the English Department,\nspoke to the Jackson Women’s Club on “Trends in Contemporary\nFiction”.\nMiss Mary Moore, of the Home Economics Department, Miss\n-23-"
}