{
  "id": "d1665-4",
  "text": "WESTERN STATE TEACHERS COLLEGE\nA BRIEF GLANCE AT ADULT\nEDUCATIONAL BROADCASTING\nBy\nLevering Tyson\nDirector, National Advisory Council on Radio in Education\nThe period for making categorical statements about the radio in\neducation is over. In more ways than one we need a breathing spell.\nApparently, we are going to have it. As long ago as 1921 enormous\nhopes were voiced that the then entirely new phenomenon of broad¬\ncasting would revolutionize American education; that our school pop¬\nulation would experience new inspiration in a novel and wonderful\nway; and that a new era of distributing enlightment had dawned.\nLater, as the so-called adult education movement started, all this en¬\nthusiasm was translated into the new field.\nNow what has happened ? The writer believes few know or realize.\nCertainly, the radio hasn’t changed except that it has become more\nflexible, more powerful and more generally available. We know its\ninfluence has expanded enormously. But actually what residue exists\nof all the fervently expressed dreams of a decade ago?\nActually, haven’t we merely come to our senses? In the first place\nwe have discovered that while the radio has its uses in education, and\nthey are admittedly very great, nevertheless it has its liabilities and\ndifficulties pedagogically which must be recognized and admitted be¬\nfore its assets can be realized. Never before have we had an instru¬\nment by which whole populations can be reached simultaneously, whether\nthe contemplated audience is a city or a country or a region or a na¬\ntion. The implications are enormous. The responsibilities are stag¬\ngering. It is just too early in the development of this art of com¬\nmunication to indicate its ultimate place in education. He who at¬\ntempts it is brave indeed, if not unintelligently rash.\nHowever, there is no doubt that we have entered upon a period of\ninquiry into and study of the radio. That needs no particular brand\nof courage nor of daring but it does demand intelligence and patience.\nOn the one hand we have a device which startles and maddens us with\nits possibilities. On the other we have a social order which some think\nis changing rapidly and which others are determined to defend; and\nthe role of education and adult education in such times is an important\none.\nHow can the two be fitted together? The writer believes that those\n- 3 -"
}