{
  "id": "d1665-5",
  "text": "THE EDUCATIONAL NEWS BULLETIN\nwho accept the responsibility of a teacher or an educator can not ignore\nthese considerations when considering radio. Decisions will have to be\nmade but they should be arrived at only after thorough objective study\nof all the problems involved. We know “the American public” listens\nto the radio. We of the National Advisory Council on Radio in Educa¬\ntion have experimented with various types of programs on serious sub¬\njects of public concern. We know large audiences are ready to hear\nwhat well informed people have to present over the air. But we know\nalso that large as are the audiences which have been built up for these\nprograms, they can not compare with the hosts who listen to “popular”\nentertainment, or to some of the various programs which the commercial\nbroadcasters, with their wide experience, have made attractive by the\nuse of “techniques” to which the usual listening audience is now ac¬\ncustomed. It doesn’t matter how authoritative the content of a radio\nprogram is, it is no good at all if no one listens to it. That is the big\nlesson to be learned from the experience of the commercial broadcasters.\nThe educator, until recently, has refused stubbornly to recognize this\nfact.\nWhile the educator has lagged behind in developing uses for this\nnew device, the demagogue and the propagandist has seized it for his\nown. One of the biggest problems facing the broadcaster today is to\ndevise means whereby he can protect himself against cleverly conceived\nattempts to use the air for all manner of propaganda for this or that\npet theory or hobby. The enormous listening audience built up by the\nlate Huey Long is a case in point. If the agitator and demagogue\ncan harness the forces of radio in their interest and educational officials\nrefuse to study it and use it for public purposes, the ultimate result will\nbe tragic. Yet that is exactly the situation today.\nThe production of radio programs about important subjects of an\neducational nature, and I am using education in a broad sense—is one\nof the biggest adult educational problems today. There are huge un¬\ntapped resources of learning to draw upon. In our colleges and uni¬\nversities and school systems we have authorities and scholars who can\nfurnish us with material which will provide the background for pro¬\ngrams seemingly without end. Public officials and eminent citizens\nare available for advice and counsel. Yet no method of organizing\nthis reservoir of talent and erudition into programs which will be ac¬\nceptable generally to the radio audience has yet been found.\nThere are many bright spots, however, which are straws showing\nthe direction of the wind. In the first place the broadcasters them¬\nselves are now willing to give as much help as they can in this matter\nof techniques. Their experience in producing popular programs, no\n- 4 -"
}