{
  "id": "d1665-6",
  "text": "WESTERN STATE TEACHERS COLLEGE\nmatter what our individual opinion of them may be, has been success¬\nful in creating audiences. Somewhere in their procedure there is some¬\nthing which will give educators the clue. In the next place, educators\nthemselves have come to be willing to experiment. No longer is the\nopinion held against all comers that an erudite class room lecture de¬\nlivered by a prominent 'expert, is educational broadcasting. Dialogues,\nround tables, discussions and other forms of presenting “talks” programs\nhave appeared in relatively large numbers in the last few years. Even\nbackground music has been injected into some programs with no alarm¬\ning consequences. Our own Council has definitely considered the or¬\nganization of radio work-shops as laboratories for trying out program\nideas and techniques,—in other words experimenting in a place where\nlogically trials should be conducted, rather than experimenting on the\nv-r-' The first of these work-shops has already been established at the\nUniversity Broadcasting Council in Chicago. Finally, there seems\nio be a realization that the guerrilla warfare between education on the\none hand and commercial broadcasting on the other should end. The\nFederal Communications Commission, under the chairmanship of Dr.\nJohn W. Studebaker, United States Commissioner of Education, has\nestablished a committee to effect mutual co-operation between broad¬\ncasters and educators so as to combine the educational experience of the\neducators with the program technique of the broadcaster, thereby bet¬\nter to serve the public interest.\nAll these factors are working toward an ultimate solution of a\nmost important educational problem of extremely significant public\nimport.\nThat man has had a liberal education who has been so trained in\nyouth that his body is the ready servant of his will; whose intellect is\nlike a clear, cold logic engine, ready to be turned to any kind of work\nand spin the gossamers as well as forge the anchors of the mind; whose\nmind is stored with a knowledge of the great and fundamental truths\nof Nature; one who is full of life and fire but whose passions are\ntrained, to hate all vileness, and to respect others as himself.\n—Thomas Huxley.\n- 5 -"
}