{
  "id": "d1659-1",
  "text": "-2-\nCALIFORNIA BROADCASTERS OPPOSE EDUCATIONAL RADIO\nTrade magazines have reported activity on the part of both the Northern and\nthe Southern California Broadcasters Associations to stifle in its initial stages a\nproposal of the University of California for a state-wide network of educational FM\nstations.\nWhether or not the information was supposed to have been released to the public\nis not known; but it has stirred to action those who see better things ahead for\nradio and its listeners.. NAEB members are particularly concerned over the\nimplications of the situation. If it can happen in California, it could happen\nelsewhere-though it is expected that commercial broadcasters in.other^states\nhave less greed and more faith in themselves than displayed by their California\nbrethren.\nIn reply to an inquiry on the matter from your President, the following letter\nwas received from FOG Commissioner Paul A. Walker:\nFebruary 12, 1947\nDear Mri Engeli\nI have your letter of the 5th instant calling my attention to an article\nin Broadcasting Magazine of February 3» 1947, entitled \"Seeks State FM,\" This\narticle states that \"The University of California is aiming at formation of\nan FM network controlled by the State's Department of Education, and is seeking\nan appropriation of 41,750,000 for that purpose,\" It then adds this significant\nsentence:\n\"Conscious of this threat to freedom of expression, as well\nas implied competition, both Northern and Southern California\nBroadcasters Associations are preparing stretegy.\"\nOur attention has also been called to an article in the February 5, 1947\nissue of Variety entitled, \"California Broadcasters Oppose Planned State-School\nFM Chain.\" This article carries a Hollywood, Feb, 4 date line and recites:\n\"California broadcasters today (Tues.) took their initial\nstep at thwarting the creation here of a state-financed, and school-\ncontrolled FM station chain,\n\"An immediate investigation will be launched into the whys,\nwherefores and hows of the plan before it gets into bill form for\npresentation to the current legislature in Sacramento. With the\nnecessary information in hand, the broadcasters will then seek\nto organize a united front of commercial station operators and\ndevise the means to combat the powerful and wealthy academic-\npolitical lobby fathering the plan.\n\"Broadcasters are determined not to leave the threat on\nits own in the hope that it will not get through or, perhaps, be\nstymied by some existing State or Federal laws prohibiting such\noperations. Once before a similar bill wras in the making, but it\nnever got to the presentation stage. No such chance will be taken\non the newcomer.\n\"Planners of the FM chain here state that no commercial\noperation is intended. However, commercial or non-commcrciql,\nbroadcasters want no part of what they feel 7/ill be definite\ncompetition for audiences.\"\nThese two articles present the tragedy of the situation."
}