{
  "id": "d1659-5",
  "text": "From: Radio City\n-6*\nTH E SECRETARY'S PAG E\nWhere Do We Go From Here?\nDo We Fold Up or Grow Up?\nRecently, over 200 FM enthusiasts — operators, engineers, manufacturers —\ngathered at the Hotel Statler in Washington, D.C. to talk about FM, to exhibit FM\nmodels and to hear Charles Denny, Chairman of the Federal Communications Commission,\nin the presence of the full Commission, reiterate his support of FM and assure the\ngroup of complete support and recognition by the Commission.\nThe meeting was important and interesting to me because, for the first time at\nany meeting of broadcasters, one was able to speak with people who were really\nexcited about the future of FM; some actually were planning programs to compete\nwith AM.\nThe Washington meeting was the first public one since a Steering Committee was\norganized at last fall’s NAB session in Chicago. The spark plug behind the whole\nidea was Judge Roy Hofheinz, owner of KOPY in Houston, Texas, a station that has\nbeen giving the big fellow plenty of competition. The meeting moved at a fast pace;\nthere were a few invited speakers, and by and large, they were all timely and to\nthe point. Before the day was up, the plans of the Steering Committee were accepted\nand Frequency Modulation Association - FM - was organized. Roy Hofheinz was\nelected President, and Bill Bailey of Broadcasting, was elected the full time, paid,\nExecutive Secretary, to operate from new offices in Washington.\nFM has decided on an elaborate campaign of promoting FM, and more important,\nthey seem very anxious to help new FM station operators. If they did nothing else\nbut made it possible for new stations to benefit by the promotional experience of\nthe other fellows, it would be well worth the dues of £100 a year. Of course, they\npropose to do more than just that, and that is where NAEB comes in.\nWhere do we go from here? What should we advise the new educational groups\nwhich have received licenses or filed applications? Do we recommend FMA and then\ntry to get a lower rate, or do we set up our own organization?\nRonnie Lowdermilk is reported in the trade press as having met with the FM\npeople and urged them to set up a special rate of &25.00 a year for educational\ngroups. I would take Ronnie's opinion, hands down, on anything that has to do with\nengineering. He certainly has been plugging at the U.S. Office of Education long\nand hard. But I am not sure whether that is the way out for us, and just because I\nam not sure, I'm putting it right on the line for the rest of you to think about.\nfrost of you have had much more contact with educational groups than I have.\nDo you think they would have the same freedom in a strictly promotional organization,\nor not? If the answer is no, then certainly NAEB, rather than a new FM educational\norganization. If this is correct, then it seems to me we must come to the conclusion\nthat NAEB line up, as soon as possible, a meeting of the key educational people who\nare interested in FM or who have already filed for FM stations.\nFebruary 25, 1947\nRoom 5052\n30 Rockefeller Plaza\nNew York, New York\nMorris S. Novik\nExecutive Secretary"
}