{
  "id": "d1659-6",
  "text": "-7-\nSTATION REPORTS\nWNYC-New York City.\nSeymour Siegel has just guided his station through an 11-day American Music\nFestival. This is an annual event between Lincoln's and Washington’s birthdays\nwhich focuses on America’s musical heritage. In addition to well-known music, the\nworks of new composers and artists were performed. New York's foremost musical\norganizations participated in specially arranged programs.\nUsing land lines between the Canadian Broadcasting Corporation and New York,\nWNYC is planning for an exchange of programs. CBS has been using the lines for\nUnited Nations reporting, and an exchange of four programs each way is reported in\nthe planning stage.\nKWSC-Washington State College. Pullmaru\nA dynamic noise suppressor has been procured. \"We heard about it in October,\"\nFred Hayward said, \"just about the time that maintenance of high program standards\nwithout frequent repetition of preferred transcriptions was proving a real problem\nto us, as to many broadcast stations. The problem had been \"solved\" in the past at\nKWSC through the frequent use of commercial phonograph records, but unfortunately\neven the best of such records are characterized by a high background noise level;\nthis is particularly apparent on high-grade receiving sets. KWSC was particularly\ninterested, consequently, \"Hayvard declared, \"in a demonstration on December 22 of\na ’Dynamic Noise Suppressor’ which promised to eliminate all surface scratching\nand remove the usual hollow7 base distortion without any sacrifice to the high\nfrequencies.\nKWSC announces a policy of feeding its best personnel into commercial radio.\n\"We will have KWSC graduates contact the commercial stations; we will know the men\nand women well enough to give any manager a clear appraisal beforehand of the\napplicant’s ability. Each one will have won an A.B, degree and have had a four-\nyear college education. Farming out to commercial stations during summers, practical\nw°rk engineering, working in music, traffic or production, announcing, newscasting\non.a regional, and intensive study under a commercially-backgrounded staff- these\nthings w/ill give interested trainees, we think, the showmanship and know-how which\nhas made radio, cultured or not, the great force it has become. It will not harm,\nand it may help.\".says the manager.\nWBKY-University of Kentucky, Lexington.\nElmer Sulzer, after reading the report last month says: \"Don’t you know that\nWBKY was never an FM station at Beadttyville and ceased operating there completely\nthree years.ago, moved to the University campus in Lexington and started there as an\nFM station in March 1945? Tsch, Tsch.\" (Sorry, Elmer, your Editor was away those\ndays.)\nA teaching.department headed by Sulzer lists courses as Radio Today, Radio\nAnnouncing, Radio Drama, Radio Regulations, and Advanced Radio Announcing. Courses\nin script writing and production are contemplated for next year.\nWHA-FM-University of Wisconsin, Madison.\nThe first transmitter in the state—wide network of FM stations being set up under\nthe auspices of the Wisconsin State Radio Council will go on the air at 12:00 o'clock\nnoon on March 30. It will be located on the University of Wisconsin campus in\nMadison and will use 3 Kw. power on the 91.5 Me. frequency.\nWHA-FM will operate in close conjunction with WHA from the Radio Hall studios.\nA regular schedule of broadcasting beginning in the iate-afternoon and continuing\nthroughout the evening will be maintained. The late-afternoon programs will be\ncarried simultaneously on AM and FM, until WHA is obliged to leave the air at sundown.\nThis will provide an opportunity for a comparison of quality and coverage."
}