{
  "id": "d1735-3",
  "text": "NAEB NEWS LETTER.*.\nEbel, speaking:\nPage 4\nNovember 1, $944\n' F°” JME REC0RD» 'T SHOULD BE STATED THAT MV APPOINTMENT TO THIS\nPOSsIa?LITV nr noTrL LCFT ™E CH,CAB0 MEETING, SO THAT THERE WAS NO\nPOSSIBILITY OF OBJECTION ON MV PART, BUT IF YOU CAN TAKE IT SO CAN I.\nI T I S GO I NG TO BE\nTHE NEVIS LETTERS\n$*LL PUT ScHOOLEY\nDOUBLY NECESSARY FOR YOU TO SEND MATERIAL ALONG FOR\nSO LET S GET GO I NG• \\f f DON *T HEAR FROM YOU SHORTLY\nON YOUR TRAIL WITH BOTH GUNS BLAZlN*.\nWISCONSIN STATE RA010 COUNCIL FORMED\nThe first public action to promote the establishment of a State FM network\nWAS THE MEETING HELD OCTOBER 30TH OF A NEW STATE RADIO C0UNCILc TH£ ORGAN¬\nIZATION WAS SET UP AT THE SUGGESTION OF THE UNIVERSITY OF WISCONSIN BOARD\n2!^^fQENTS’ <T ,S C0MP0SE:D 0f HEADS OF VARIOUS EDUCATIONAL AGENCIES OF THE\nST AT E o\nFirst job of the group will be to \"stuoy frequency modulation and make\nC0MMfsSf|l0NP\"EPARC APPUCAT,0NS F0R F,V! CHANNELS TO THE Federal COMMUNICATIONS\nTWO COMMITTEES WERE SET UPi A\nFrank Holt, director of the Un\nTECHNICAL COMMITTEE, HEADED BY\nRadio Committee*\nCOMMITTEE ON PROGRAM SERVICE HEADED BY\nf versity Department of Public Service; a\nOr* E-wbank, Chairman of the Universi ty\nGovernor Goodland was named honorary chairman of the council*\nEXECUTIVE SECRETARY* 9\nH. 80 McCarty,\nThose attending the meeting, besides those named, were® President C. Ae\nuykstra; Warren Clarke, Agriculture Extension; C8 J0 Anderson, Dean of\neducation; L0 Aqolfson, head of the Extension Division; He Button,\nDirector, Department of Agriculture; John Calahan, Superintendent of\nducation; and C* Lc Grieber, Director of Vocational Education\nBEVIS, OHS0 STATE UNIVERSITY, TESTIFIES\nAn Ohio educator told the Federal Communications Commission on October II\nthat U* S. colleges and universities will probably do a lot of education\nwork by radio after the war * Ooctor Howard L, Bevis, President of Ohio\nState University, saio the universities would like to use three times the\npresent number of non-commercial educational F-m broadcast channels*\nHowever, the schools consider television rather remote from an educational\nviewpoint, although they are interested in its possibilities* Doctor\nBevis recommended that more standard channels be assigned to educational\nUSES AND THAT 15 F-M CHANNELS BE SO ALLOCATED*\nI NOI ANA DRAMATIZES COOPER LIFE\nThe life of Associated Press General Manager Kent Cooper was dramatized\nSunday morning, October 12th over radio station WIRE of Indianapolis.\nThe program is one of a series being presented by Indiana University on"
}