{
  "id": "d561-10",
  "text": "-FCC-\n12/20/66\nPg.3\nIn the ultra-high frequency television table of assignments we find the upper\nf UHF channels not allocated, but these are left free for assignment to small\ncommunities for their local television station to be operated at low power\nwith a limited service in mind. The 10-watt FM stations can serve the same\nI purpose for the radio audience and can be utilized in communities which other¬\nwise do not have assignments or where an additional channel is needed.\nWe suggest that regardless of what plan is adopted for the educational FM band\nthat the currently operating 10-watt stations be allowed to continue on the\nair with no time limit to their operation. If a plan is not adopted to set\naside channels 201, 202, and 203, for non-commercial educational use by 10-\nwatt stations then we believe that the table of assignments should be made up\nwith the existing 10-watt station in mind, and they should be allowed to oper¬\nate indefinitely subject to other license requirements.\nApparently there is some concern regarding the programming of some 10-watt\nstations. Too much time is spent in entertainment type programs which re¬\nsemble programs of many commercial stations except without commercials. Un¬\nfortunately there are many higher powered educational stations whose pro¬\ngramming leaves much to be desired at times. We do not believe that all 10-\nw att stations should be penalized for the poor operation of a few. There\nare other regulations which adequately govern this type of situation. The\n\"Promise vs. Performance\" is generally a good way to determine whether a sta¬\ntion is living up to its intended goals. Short term license renewal and, in\nextreme cases,license revocation are adequate methods of enforcing compliance\nwith the regulations. We also believe that the plan for educational FM networks\nwould be very expensive for most college FM station budgets, unless there was a\nplan for federal or state assistance, in subsidizing the network costs.\nRespectfully yours.\nDon Dick\nSecretary, La Sierra College Broadcasting Company\nGeneral Manager, KSDA\nRoy Steck\nChief Engineer, KSDA"
}