{
  "id": "d561-105",
  "text": "UNIVERSITY OF NEVADA\nReno, Nevada\nAUDIO VISUAL\nCOMMUNICATION CENTER\nPage 2\n2) As a member of the National Educational\nRadio and the Intercollegiate Broadcasting\nSystem, KUNR-FM is able to present educational\nand informational programs that have been\nproduced on a professional level. Educational\nand classroom lectures are also obtained from\nthe University of Colorado and Washington State\nUniversity.\n3) Since the University of Nevada is non-denominational,\nreligious programming consists of general religious\nprograms made available to the station through\nvarious national organizations.\n4) Public affairs programs are constantly requested;\nand such local programs as the Political Science\nDepartment’s program introducing political\ncandidates during the recent elections, the\nUniversity's guests, lecturers and events are\nrecorded and presented on the station.\n5) Throughout every broadcast day, frequent announcements\nare given to public service organizations on the\ncampus and throughout the Reno-Sparks area.\nMost of the above programs are not available on the other\ntwo FM stations in the Reno-Sparks area. One station maintains a format\nof popular music. The second station provides a varied format that\nranges from the popular to the classical,..but there is no attempt to program\nfor a specific audience; while this station does furnish news and editorial\nprogramming, they broadcast only a small fraction of any type of informational\nor educational programming, if any. KUNR-FM furnishes a programming that\nwould not be economically feasible or practical to the other FM stations in\nthis area.\nThe 10 watts of power under which the station operates is\nthoroughly.adequate. The geographical position of the University of Nevada\npermits this power to reach throughout the Reno-Sparks area. The population\noutside this area is minimal and too distant. Increase in power would not\npermit the station's signal to get out of the basin, which is surrounded by\na mountainous terrain."
}