{
  "id": "d561-110",
  "text": "MEMORIAL UNION • UNIVERSITY OF NEW HAMPSHIRE\nDURHAM, NEW HAMPSHIRE\n90.3 MCS.\nJanuary 16, 1967\nNational Educational Radio\n1346 Connecticut Avenue, N.W.\nWashington, D. C. 20036\nDear Sirs:\nFirst, I would like to apologize for sending in this questionnaire a few\ndays late. It is very important to us since we plan to expand, and I\nwanted to try to give you full and complete answers.\nAs you probably know, the F.C.C. issued Docket # l4l85 in November, and\nsince then WUNH-FM has made plans to expand to ten kilowatts, hopefully\nby 1969. The major stumbling block to realizing our goal is money. At\nthe present time there are no federal funds available ( I infer this from\nyour questionnaire. ); the University can not afford the expense of our\nexpansion; and it appears that we will have to tax the students to get\nthe necessary $45 - 50,000 for the initial investment.\nFederal funds support educational television, and it is my opinion that\nthey should also support educational radio. If the F.C.C. can issue\nDocket # 14185 proposing the abolishment of all ten watt educational FM\nstations and the establishment of high power stations in their place,\nthen certainly the government should help these smaller stations go high\npower. The government can not expect to crush these small stations in\nhopes that larger ones will take their places without some sort of mone¬\ntary assistance.\nWhen it comes to University funds, there are none for educational radio.\nThe University is already supporting an educational television station.\nIt has started an expansion plan that will end in 1972 with a second plan\nbeing drawn up at the present time. The University realizes the value of\na radio station, but there is only so much money in the budget, and we do\nnot have a very high priority.\nAll of this leads up to an increase in the student activity tax. As we\nsee it, this is the only way to get the amount of funds necessary for the\nexpansion of WUNH. Whether or not we will be allowed to take this course\nof action is another matter. It means raising some sixty-five (65) thou¬\nsand dollars in two years, and at least twenty (20) thousand every year\nthereafter for our annual budget. The problems of funds are not simple\nones."
}