{
  "id": "d561-111",
  "text": "-2-\nWUNH-FM will have an excellent opportunity to serve New Hampshire and the\nNew England area within the next few years. Construction will soon start\non the Kellogg Center, also known as the New England Center for Continuing\nEducation. This center is being financed by, and is a joint project of\nall six New England states. The Center will provide vast programming ma¬\nterial for the Eastern Educational Radio Network. It is hoped that N.A.T.O.\nwill hold conferences there and that many world-renowned people will visit\nand speak there. It will create an opportunity to supply education to the\npeople of New Hampshire, Nev; England, and the Eastern United States, not\nthrough classrooms, but through the media of radio and television. Oppor¬\ntunity is at our doorstep, and it must not be allowed to slip through our\nfingers for lack of funds.\nFor years, WGBH-FM from Cambridge, Massachusetts has begged the University\nof New Hampshire to increase the output of its FM station. WGBH, being\nthe mother station for the E.E.R.N., made plans many years ago for an edu¬\ncational radio network to run from Maine to the Carolinas. We failed to\nfulfill our part of the plan for lack of funds. Instead of a five to ten\nkilowatt station, we built a ten watt station. We are the void between\nBoston and Orono, and now we want to fill that void, but we need help.\nVast resources are at our fingertips. Men who are experts on China, Latin\nAmerica, South East Asia, economics, physics, and geology are here. Poets,\nauthors, and musicians visit here and read or perform their masterpieces\nhere. Senators and foreign ambassadors lecture here. University scientists\nhave launched satellites. University professors have traveled all over the\nworld for the United States State Department. This knowledge and talent is\nsitting here waiting to be tapped and delivered to the millions of people\nwho are not in college, who are not able to come and listen to this store\nof talent. These resources are not being used in their full potential -\nfar from it, to be exact.\nWe have so much to offer the people of our state and the New England area,\nbut no way of delivering it. WUNH is not the only ten watt station with\nplans and potential; others undoubtedly need government aid just as we do.\nI have stated what we can offer you and our audience, and I now ask what\nyou can offer us. Will we be able to receive monetary assistance from the\ngovernment?\nThe need has been established, and being a student, there is little more\nI can do about the situation. You have the ball now, but if I can assist\nyou in any way please let me know.\nSincerely\nStephen H. Thompson\nGeneral Manager\nSHT/cw\nend."
}