{
  "id": "d561-113",
  "text": "~-'• ^ 'V V \\v,.v.\nl-'LL*?': -i? \"-.hr:.*#* l!hrt2r r. L2\n^ - ~?ZZ*0 * *>T ^ >y. . •; . . -\nand V2tZ&.r»QT Vl **\nDecember 7, 1966\nThe comments set forth here deal with most of the issues mentioned in the\nrecent FCC Notice of Inquiry in the matter of revision of FM broadcast rules in\nregard to educational FM. In addition, certain other matters not specifically\nalluded to in the present Notice are briefly discussed#\nThe writer*s interest in these matters stems from the original Notice of\nInquiry of July 5» 1961, which elicited from this source, on September 19, 1961,\nsorvo fairly specific \"Comments# . concerning the upcoming needs, as I perceived\nthorn, for both commercial and educational FK. At least one of my 1961 suggestions\nthat Class A commercial stations’ maximum facilities be increased from 1 ku to”Ykw\nwas api'jarontly accepted.\nCertain of the conclusions discussed here in regard to educational FI' -re\nidentical to those propounded five years earlier; in other areas, I have modified\nmy views somewhat; a majority of the matters, however, are relevant only to the\npresent discussion and are given as full a consideration as possible before male -\nTHE PROBLEM\nThe development of educational IK radio in the United States has been anythin*-\nbut orderly. Stations of extremely low power and operating short, sometimes\nsporadic schedules with seemingly little sense of destiny have found their war\nonto the 88 to 92 megacycles’ portion of the spectrum in a haphazard geographical\nconxxguratmon. A map showing the 50 uv/m contours of the 315 presently author!r ;\neducational FL stations would reveal large land areas and population center. • re¬\nserved ty even a single station. Such important states as Hew York and Penns*-—.-\ncompared to the upper midwest, are comparatively unserved. FK educational\nin the oouth is spotty, with Alabama’s VJOOA reoortedly \"temporarily off tho\n„ .Ck'-i1.en^?Untain0and plains states are similarly underserved. Such large r*\n*2+>ICan?’ T^r±e‘ Omaha, Denver, Fresno, Savannah am: :h* tvx>\nCharlestons are without educational FK service.\nPorm^wr,000 stato, ..isconsin, has a complete educational FV. network, 1*\nand ?0I?T aro known to have plans„ and it is this writer's intc\n?*S}PS in wew York to subr>lit a detailed plan for a New York *>Ut'\neducational EM network.\nDespite these problems, educational FT' channels are attracting r.r-.r c*. \"t -\nSr, an increasing rate. According to Jerrold Sandler, executive dim t rf\neducational *^dio, writing in late 1966, some 20 ;\neducational radio licensees have gone on the air during the past tv r*.\nrise in .educational Fl-I assignments since 1956 is indicated in Tat > ^\ncomparable commercial FN data#"
}