{
  "id": "d561-114",
  "text": "1966\nTABLE I\nTHE EVOLUTION CF FK RADIO, 1956 TO 1966\ni960\nTotaliPo£ Channel\n\"| • — — —\nTotals\n‘er^Channel^JC nor, *\nEducational\nstations:\n1\n136 | 6.7\n1\n166 j\nB.3\ni ■\n122*0\nCommercial\nstati6n3.\n1\n1\n3^6 } 6,8\ni\n»\ni\n801 j\n10o0\n1\n146*7\n»\n•over 19:>-\n315\n,1808\nPer Channel'{finer.1'\nd\n15.5 '89.B\n22.6 1260O\n’“•‘over 2960\n*<<r' ? . ; , i : tnblo 01* arx\\cnn.of.tr., such no tho FCC proposes for tho\n' r \" :'1, 'V- rJliCi -lonal P°rt*..on of the FK band, io v rr.eelately apparent from a\nat la bio I. f«- -m which it nay bo noted that. while ~..0 overall rate of occu¬\npancy nor enamel lias risen more sharped for the oommorcial as opposed to the\nnoncommercial sector, it may be inferred that the more recant rate of comerell\nincrease is proportions cels'- less than that for educational IT as a look at the\npercentage changes appearing tilth the last two sets of data trill reveal!\n»upt11!^: nt\\?cx?9% iz isVf “r1\nassignment table nears a point of saturation the rite of I,\nwill undoubtedly taper off, with possiiae fuittre g^h Ukelv 2 S°£V ,\nto the last source of available channels - educational W U^ t0 1)6 COnfinea\nT’.X CLA333\nOF EDUCATIONAL KM ST; ;iGNS\n^ C£? 3. Pr°P°sal to extend to noncommercial FK the s^nie standards as for\n“ recfrd to classes of stations, powers and antenna h^ts and «in-\n™d:ta^,'I-\"t!iS^G^\":.f!?!^tAi0n^;lp?c-ir3.t0 Pis ^server to be entirely\nof maintain Inc tho exact ratio of or, Class A channel for\nfour Class 3/0 channels vns is tho caso t:i th corn- rcia* FT) my be -actioned Jn\nwor of Oio fact tha* ,109# or 66 per cent, cf tho *M5 • duel Mori.il\noperating nith Class A focilttles t ‘ kw at v\\V dw* «-«* t*rra$\n?at ioar? err*\nm ■ < r\nr I :!? •\nClass that Lt is the lower rov^r facilities\nmost favored by educational organizations; hence, a creator proportional access v:\nthem should bo provided. I*y specific recommendation m to agree with tho FCC\nproposal to make Channels 201, 204, 206, 208 and 216 Class A, \\rith the remainder\nbecoming B/C. In addition, I uould recommend that another channel, such as t*o.\n213 (90„5 me.), with but tiro higher-power authorizations, be added to the Class A\nlist. 3.f possible, the seven affected stations should change frequencies to a B/C\nchannels similarly, those stations of lower power that do not wish to or are unable\nto qualify for the higher-power reservation should move to Class A frequencies <> At\nthis point, it should be mentioned that, according to the writer*s own recordsf there\nare only five stations operating with more than the 'Class A maxima on the ,f5~e orig¬\ninal affected frequencies, as opposed to the FCC°s estimate of \"about"
}