{
  "id": "d561-115",
  "text": "-3-\nTHE COLLEGE AKD TOIXVERSITI STATION\nTn the reservation of specific educational FK channels, a special case can\noe made in favor of thecolleGe-univc^ity-licensed^aUon ^ ^ ^ be\nfully 68.5 percent of ^\"^^^^ies? Pereas the remainder are licensed\ntoTvS^ty of1\"croups or institutions^ ranging Libr^.\n£SSS fotlXt^ns UcSfedDato birds of education. high schools, state\nagencies and other nonprofit organizations.\n_ . Tihie tt tt will bo noted that the extent of collegxate-con-\nto tho various states «= can expect the ^essure from gi-source^more^. ^\n:a>\nInasmuch ns tho collogo-univcroity arca accounts for more than two-thirds of all\neducational Fi: authorisations, it is itnporativo that, for thxs development to\ncontinue, specific channel assignments be made wherever possible in communities\ncontaining colleges without FM stations, b’e would then expect the states awarded\nthe highest number of new educational reservations to be the ones with (.a) a low\npercentage of institutions presently having FM, (b) a high number of institutions\nwithout FK, and (c) a large land area.\nExcluding the states with fewer than six institutions of higher learning,\nit will be noted that FM saturation at the colleges and universities, on an\nindividual state basis, is invariably less than 50 per cent. In the more populous\nstates, the percentage tends to drop, with New York having more institutions (7b,.\nwithout radio than any other state. As a guideline, the examples of such large\nstates as Indiana and Ohio, with 42.9 and 35-9 percent saturation respectively,\nshould be expected across the country as educational FM matures.\nNOTE: Table II appears on page 4.\nTEN WATT OPERATION AND THE PUBLIC INTEREST\nCurrently, according to the FCC, about 45 percent of all educational FT stations\nare limited coverage, 10-vntt operations. Many of today’s higher powered stations\nactually began as 10-watters. but having found that 10 watts was not adequa\nincreased their power. This was particularly true in larger urcan centers, such\nas Duluth-Superior, where both former 10-watters have since uppea their P» 1\nhowever, the trend is apparent as well in the small towns where 10-watt operation\nwas originally thought to be sufficient, as was the case in Greencastle, Ind.\n(John Guy. \"Nation’s First lO-V.'atter Increases Power.\" NAEB Journal, Sept.-Oct.\n1963).\nThe writer agrees with the FCC-expressed premise that \"operate. . with such\n• limited power does not usually represent an efficient use of scarce spectrum\nspace, since coverage is often limited to a few miles.” This is in conformity\nwith uy September 19. 1961 contention that the power maximum Ox the Class D\neducational station should be raised from 10 watts to the equivalent of the"
}