{
  "id": "d561-117",
  "text": "Class A commercial station. The proposals made relative to a freezo on new 10-\nwatt stations,, and the requirement that existing 10-watt stations be given until\nthe end of their license period before having to seek an increase in power or\nface the prospect of deletion, especially if another applicant proposes a\nmutually-exclusive operation with a power above the minimum for the class of\nchannel upon which the station would operate, are valid. Ky suggestion is to\nallow continued operation of 10-watt transmitters as translators to extend the\ncoverage of regularly-licensed EFM stations — translators that would be\nunattended and exempt from the station identification rule0\nIn order to offset the burden placed upon new or existing applicants in\nrr-etir~ the rew minima for the class of channel upon which they would operate,\n: -.jould propose a relaxation of the rule requiring daily transmitter inspection\nv a ?irot Class engineer for stations up to 3 kw ERP, and to allow students\n:v ‘.r.e facilities to use a restricted operator permit rather than a\nde.t-endorsod licenso. A major problem facing college stations\n* rr •' r grv.;ps of students to taako trips to an FCC district office\n• : • • ymr, and to wind up with 50 or more FCC licenses\nmX pUstured on ihe walls and win he radio station's\nTV CHAWJEL SIX IKTERFEREKCE\nConcerning the possible problem of interference to TV Channel 6V which was\nalluded to in the FCC notice, it appears that by keeping Channel 201 (88.1 Kcs.)\na Class A channel, much of the potential problem is immediately resolved. With\nTV stations generally operating with higher power and antenna heights than was\nthe case in 1961, the \"problem\" of interference to*this service from educational\nFI may be more hypothetical than real. If there is a problem, it is more likely\nto one of high-powered TV interfering with lower-powered educational FM recep¬\ntion. With development in the commercial FM band being as intensive as it now\nas, consideration should, in fact, be given to returning such educational FM\noutlets as V.FBE Flint, WMUK Kalamazoo, WFXU Bloomington” and KUOW Seattle to the\neducational portion of the band to which they belong. This Is vital, for by\ndefinition, commercial broadcasters are barred from the educational part of the\nband, while an educational station is seemingly at liberty to invade the\ncommercial FM band. The possibility exists that television operators may actually\nencourage the removal of educational FM services to the commercial channels in an\nsixoro to reduce or eliminate competition in the selling of air-time.\nPRIORITIES IK ASSIGNING CHANKELS\nIn anticipation of the future needs of the educational FM service the\nfollowing guidelines in the assigning (and subsequent granting) of channels are\nsuggested:\n1. Statewide or regional organizations for the purpose of developing\nnetworks, utilizing high-powered stations capable of off-air relay — rolying\nmainly upon Class B/C channels.\n2. Colleges and universities, both now and in the futuro, the most likely\nsource of further educational FM growth — Class A assignments and Class B/C\nchannels unused under \"l\"."
}