{
  "id": "d561-118",
  "text": "-6-\n3, Public School Systems. The development of separate stations solely\ndevoted to daytime in-school instruction, however, should be discouraged as a\nwaste of valuable public frequencies. Intensive utilization of SCA multiplex\ntechniques on existing or proposed educational or even commercial FK stations\nc^n instead supplant such non-broadcast usages of the medium. Where such stations\nalready exist (e.g., VfflOE Cleveland; VJBGO and WNYE Newark-New York; KSIH St.\nLouis; VJBEZ Chicago), they should be encouraged to devote at least some of their\nprogram output to the needs of the at-home audience and to operate at times other\nthan purely in-schcol hours. Otherwise, the establishment of separate, snare¬\ntime stations to cater to the nighttime, weekend and summer FK audiences should\nbe permitted on ther.e frequencies.\n• 4. Miscellaneous groups*, listener-sponsored radio, labor unions, junior\n'colleges, trade schools, individual schools within a system, churches, libraries,\nmuseums_for the stcond, third and fourth community assignments, on a first-\ncome, first-served basis.\noperating schedules\nAlthough not disex3oed in tho FCC notice, tho final proposal is a reiter¬\nation of ono advocatod by tho xnriter in 1961 — that educational FK stations be\nexpected to adhere to the minimum operating schedules of commercial FM stations,\nparticularly when that ninimum is only 36 hours weekly, as it is at present.\nEFK stations could be exempted from operating during school vacation periods, but\nit would be reasonable to expect them to maintain a schedule during the summer\nsessions by the time of the expiration of the first license period. This would\nserve to make the educational radio service a reliable one from the standpoint\nof hours of program output and constancy of signal to the public.\nSUMMARY\n1. This paper provides general support for the recent FCC proposal to\ncreate a table of allocations for the educational portion of the FK broadcast\nband. It also concurs with the proposal to adhere to the same system of Class A\nand Class B/C channel designations, and the implementation of commercial FM\nmileage separations for educational stations in Zones I, IA and II.\n2. Agreement is expressed for the eventual phasing out of the 10-watt FK\nstations, except for their use as satellites to extend the coverage of regularly-\nlicensed operations.\nft\n3. Corz-crcial TV charges of FK interference ray stor. riore froa ^cononic\nthan engineering reasons.\n4. Priorities in the assignment (and subsequent granting) of channels are\nsuggested.\n5* Minimum hours of operation should be specified, particularly for those\neducational FM stations in their second license period and beyond.\nStated above have been several proposals which, it is hoped, may provide\nan approach by which the educational FK broadcast service can develop into the\nvital national resource that should be its destiny.\nRespectfully submitted,,\nBruce F„ Elving ^ -"
}