{
  "id": "d561-119",
  "text": "u\nL\nsot\n\\22*&\ni\nAM - 1340 KC\nFM - 91.5 MC\nRADIO BROADCAST SERVICES\nOHIO UNIVERSITY\nDecember 29, 1966\nATHENS, OHIO\nMr. Ben F. Waple\nSecretary\nFederal Communications Commission\nWashington, D.C. 20554\nDear Mr. Waple:\nI would like to react to your Notice of Inquiry, Docket No. 14185,\nregarding the revision of FM broadcast rules as they relate to the\nallocation of frequency and technical standards of educational FM stations.\nAs you have undoubtedly anticipated, this docket has created considerable\nserious discussion on the part of educational FM broadcasters. I might\nmake it clear that we are not particularly influenced by this Notice of\nInquiry since Ohio University has applied for and indeed did receive this\nmorning a construction permit to substantially increase the power and scope\nof its FM operation. My reaction is more out of a consideration for those\neducational stations who may want to continue utilizing the educational\nband of frequencies at 10 watts of power.\nThe intent of the Inquiry, as I see it, is to try to upgrade or to\neliminate those 10 watt facilities which do not serve much of an educational\npurpose. We all know there are a number of these. However, there are many\n10 watt stations—primarily associated with school systems—which are\ncontributing to the educational process and who are accomplishing the\npurpose for which the 10 watt FM station was originally intended. I would\nnot want to see the position of these stations jeopardized. For them to\nincrease their power might not help them since it might impose financial\nas well as programming burdens on them which they could not conceivably\nhandle. What is to be gained if they are already achieving their goals.\nIt seems to me that in order to protect these stations the criteria for\njudging whether a station is fulfilling its purpose should be based on its\nperformance or program schedule rather than on its power. If you find in\nyour review of a station's composite week at license renewal time, that\nthis station, in your estimation, is not fulfilling the purpose for which\nit was intended and is indeecha \"parrating\" of a commercial operation then\nthat station should be asked to change its programming or turn in its license.\nI think it is advisable to encourage those FM stations which can foresee\nwithin the province of their responsibility serving a larger regional\naudience to apply for an increase in their power. There are some larger\noperations—most of whom already have.considerable FM power—who can justify\nWe pm UNIViBilTV FM §?Aff@W m m§"
}