{
  "id": "d561-124",
  "text": "-2-\nThus, stage one should consist of a border-to-border educational\ncampaign among radio listeners and possible listeners, using all the\ntechniques of persuasion, exposition, demonstration, and whatever else\nis required - to convince potential listeners that radio - true radio -\nhas not become obsolete, nor has it lost any of its impacto\nIt should be pointed out that the great majority of present-day\nteachers and administrators are unfamiliar with the potential of radio\nas a teaching medium, or are enamoured of what they are ready to believe\nis the paneeea of instruction by television* Others may feel that any\ndeparture from the formula of teacher-pupil confrontation in the flesh\nis prostitution of their calling. Such conditions demand as much\nattention be paid to educating educators to the potential of radio, as\nis being directed toward the layman.\nAmong the many methods which may be employed effectively, on of the\nmost persuasive Is making available radio as it can be, produced and\npresented by various radio-oriented groups from educational organizations „\nIt is suggested that increased effort be expended on the part of educational\ngroups - in the absence of a local educational radio station - to step\nup activity to interest the local radio outlet to provide some time for\neducational and cultural programs (within a logical listening time segment),\nand also to stimulate the station personnel to assist in the conception,\npreparation and presentation of such programs. Your subcommittee\ncooperation is standard operational procedure, and is to be highly\ncommended.\nThis cooperation notwithstanding, it is a hard economic fact that\nthese stations are in business to show a profit, however altruistic and\ncooperative their managements would prefer to be. As an unfortunate result,\neducational - or non-commercial - programs MUST be relegated to time seg¬\nments not presently sponsored. These segments vary with the station and\nthe legion* Even when prime time is made available to educational organi¬\nsations there is no assurance it will not be pre-empted by a commercial\nprogram. And this is as it should be. It*s not reasonable to expect a\nbroadcasting station, existing for one purpose to underwrite a diametri¬\ncally opposed type of broadcasting with an entirely different objective.\nCooperation should be appreciated but not demanded.\nIt should be pointed out further that reliance on commercial radio\nbroadcasting stations be continued only so long as educationalorganizations\nin the area are without a non-coumercial outlet, even though such an outlet\nbe of low power.\nIn the area which some Olympian academicians refer to as the \"nuts\nand bolts\" aspect of radio; programming for state-wide consumption, there\nare some tried-and-tru® practices to guide the network planners.. Since\nsequential connection of network stations is not, feasible at the 6utset,\nand because of the necessity to qffect a* sympathetic atmosphere- if the\nidea is to flourish, it is suggeajfcdd that programs on tape - both direct\nteaching and motivational - be obtained from approved sources and made\navailable to schools indicating their interest in and desire for such\nprograms, these to be offered to presently cooperating commercial stations,\nor available non-coranercial outlets."
}