{
  "id": "d561-133",
  "text": "ALBRIGHT COLLEGE^\nREADING, PENNSYLVANIA 19604\nalso*\nTHE INTERCOLLEGIATE BROADCASTING SYSTEM\nDecember 22, 1966\nCommittee on Educational Radio\nFederal Communications Commission\nYAishington, D.C.\nm\n91.3FM\nPHONE : 374 - 3274\n(area code 215 )\nDear Sirs;\nAs manager of a lOw educational outlet I would like to offer\nopinions to the committee concerning the matters of an alloca¬\ntion* of FM channels and elimination of 10w stations#\nIt is my opinion that if properly organized, a network of\neducational stations could be established# The greatest problems\nwould be the actual organization of such a network and financing\nsuch a project. Attempts at linkup of college stations has been\ntried several times by the Intercollegiate Broadcasting System In\nour area, however, these seemed to have failed because direction\nwas not strong enough and member stations did not have the finan¬\ncial backing to attempt such a venture# Because educational FM\nis noncommercial, many stations, especially on the college level,\nmust go to the school for finances, a system which allows very\nlittle excess money for such ventures. If a sponsor and a leader\ncould be found, it is our opinion that such a network could be\norganized.\nIt is our opinion that the lOw outlet should be eliminated\nfrom the educatiOiial band. As manager of such a station, we rea¬\nlize its limited power and inability to adaquetely cover our\nlistening audience with even a minimum strength signal. We feci\nthat if an organization or college is willing to make the necessary\ninvestment to begin a radio station, that the small additional\namount of money necessary to raise pov/er should be allocated also.\nWe also feci that the lOw outlet should be permitted to the\nlicensee during the first period. Because many of these educational\nstations are organized by colleges with no experienced personnel,\nwe feel that a lOw outlet would be advantageous to these groups\nuntil enough personnel have gained experience so as to present a\nmore sophisticated sound. At the end of the first period, the\nlicensee would then have the option to increase power to the\ninimum established by the commission or forfeit their license,\ne suggest that 25Ow be made the base after the first period."
}