{
  "id": "d561-136",
  "text": "In the Matter of\nRevision of FM Broadcast. Rules,\nParticularly as to Allocation\nand Technical Standards\n(Educational FM Channels)\nRe: Docket No. 14185\nThe Federal CommunIcatIons Commission:\nThe Public Library of Nashville and Davidson County, Tennessee,\nlicensee of WPLN, 90.3 me, hereby submits the following comments In regard\nto the commission's Notice of Inquiry, dated November 14, 1966. The num¬\nbering herein corresponds with the numbering of the Commission's document.\n1. Rev Iew of Proceeding. No comment.\n2. Proposed FM Table of Assignments. (I) The library concurs In the\nbelief that a nation-wide Table of Assignments for educational FM stations\nwould best serve the educational radio needs of the country. (2) Further, the\nlibrary supports the present policy of reserving the frequencies from 88.1 to\n91.9 megacycles for educational broadcasting. (3) We propose that the first\ncriterion In preparing assignments should be existing facilities now In use.\n3. Single Signal Coverage, The principal aim of providing single\nsignal coverage to as much of the population and area of the country as\npossible In so far as state-wide and regional networks are concerned Is\nstrongly supported. Assignments in this respect should be made so that\nevery individual residing In these United States should have access to at\nleast one source of educational broadcasting. With today's Increasing\ntendency toward urbanization, single signal coverage would serve the needs of\nthe more populated urban areas and residents In the less populated surround¬\ning areas, and at the same time provide one means of Interconnection for\nstate-wide and regional service.\nIn preparing assignments meeting this aim, we equally strongly\nrecorrcnend that In no way should assignments be made that would hinder the\ngrowth of facilities of lesser signal coverage within the same area. In\nTennessee the population tends to be concentrated around four metropolitan\nareas. Interconnection between these areas Is a must, but there are many\nInstitutions In lesser populated areas of the state that do and could\nadequately support smaller broadcast operations. Assignments should be\nmade to provide for the growth of such facilities. Smaller educational\ncenters would thus provide many resources not otherwise available to the\nentire state.\nNo recommended table of assignments for Tennessee Is available at\nrhls time. However, plans are already underway which will ultimately pro¬\nvide recommendations which will meet the needs of Tennessee. The next\nmeeting will be In Nashville on January 17, 1967. The Commission will be\nadvised of recommendations resulting from this meeting."
}