{
  "id": "d561-138",
  "text": "/rrv^, v+^t * (\nJ v r THE UNIVERSITY OF TENNESSEE\nTHE UNIVERSITY OF TENNESSEE\nDIVISION OF UNIVERSITY EXTENSION\n14 AYRES HALL\nKNOXVILLE\nDEPARTMENT OF BROADCASTING SERVICES\nRADIO STATION WUOT\nU-T TELEVISION\nSTATE RADIO TAPE NETWORK\nTENNESSEE HIGH SCHOOL SPEECH AND DRAMA LEAGUE\nTENNESSEE ASSOCIATION OF BROADCASTERS STATE OFFICE\nDecember 27, 1966\nIn the Matter of\nRevision of FM Broadcast Rules,\nParticularly as to Allocation\nand Technical Standards\n(Educational FM Channels)\nRe: Docket No. 14185\nThe Federal Communications Commission:\nThe University of Tennessee, the state university and land-grant institution of the state\nof Tennessee, and licensee of WUOT-FM, 91. 9 me, hereby submits the following comment\nin regard to the docket stated. Comments will be made on those phases of the Commission\nNotice of Inquiry dated November 14, 1966 which are of concern to The University of Tenn¬\nessee. The numbering of the comments coincides with the numbering of the various points\nof inquiry in the Commission document.\n1. Review of Proceeding. No comment.\n2. Proposed FM Table of Assignments. The University urges the Commission to\nadopt a nationwide Table of Assignments for educational FM stations, continuing the present\npolicy of reserving such assignments for non-commercial use in the 88.1 through 91. 9 me\nband. The University further urges the Commission to protect all present assignments,\npower authorizations, and separation requirements of existing educational FM stations,\npermanently in the case of regular facilities, and as hereinafter stated under comment 5\nfor 10 watt facilities.\n3. Single Signal Coverage. The University urges the Commission to pursue the\nprinciple of providing for single station coverage to as much of the population and area as\npossible. There are at present four educational FM stations in Tennessee, two under\nconstruction, and at least three more in advanced planning stages. Such involvement makes\na state network a distinct possibility within the next few years. The creation of such a\nnetwork would be greatly facilitated by providing for at least ten Class C stations in Tenn¬\nessee. There are at present three Class C stations on the air, and seven more would be\nneeded.\nBut the University is equally convinced that additional assignments in the Class A cate¬\ngory will be needed if statewide participation is to be achieved in Tennessee. Certainly single"
}