{
  "id": "d561-139",
  "text": "FCC Comment—page 2.\nstation coverage over a wide area is essential, but in certain areas of the state the local\neducational and political climate is such that financial and personnel resources can only be\nutilized fully if smaller local stations are members of the state network in addition to the\nhigher powered stations. Such secondary stations may well be limited to 3 kw as provided\nfor Class A stations; in fact, smaller school systems and institutions of higher learning\nwould in some cases prefer to operate smaller stations with resultant savings in capital\noutlay and operating costs if such stations can still be part of a state network. The problem\nis simply that even if Class C stations would cover the entire state without local Class A\nstations, such a network would not provide means for utilizing the many resources of\nsmaller but important educational centers, and a large-station only network would be far\nless successful in getting full statewide financial support...\nThe following table is included only as a guide, and has no official approval or even\ntentative agreement among the other educational FM stations. It is offered to illustrate the\nproblem of ten Class C stations being supplemented in several parts of the state by eight\nlower-powered stations.\nMemphis )\nNashville )\nKnoxville )\nChattanooga (area) )\nTri-cities of Johnson City, )\nBristol, Kingsport )\nMonteagle )\nCookeville )\nMartin )\nJackson )\nLebanon )\nAthens )\nClarksville )\nColumbia )\nCrossville )\nGreeneville )\nHenderson )\nOak Ridge )\nMurfreesboro )\nthese areas would need Class C\nfacilities, one station with\nsub-channel capabilities for\nnetworking purposes. But in\naddition, several of the areas\nwould need additional channels\nfor local needs only.\nThese areas have large state or\nprivate colleges, branches of\nother institutions, or some\nspecial reason for requiring\nlocal facilities. Class A stations\nwould be acceptable, perhaps, but\ninterested groups in the areas\nmay file additional comment.\nA precise engineering statement of the locations of various stations cannot be made\nwithin the time allotted by the Commission for comment, but plans are now underway and\nhave been for some time to proceed with network planning which will include engineering\nstudies.\nThe next planning meeting for state networking of FM stations will be in mid-January,\n1967, beyond the date of filing comment or replies, but the Commission will be informed\nas plans develop."
}