{
  "id": "d561-147",
  "text": "December 20. 1$66\nFederal Communications Commission\nWashington, Do C.\nGentlemen:\nAs the director of a 10 watt educational FM station, I would like to state our\nposition on the proposed change to class A station as presented in Docket No, 14185*\nThe increase in power dictated by this change would present such hardships to\nthe small stations as to put many of them out of business.\nOne of the major considerations of a school district is finance. The initial^\nchange over, as well as continued maintenance would force a large increase in station\nbudgets. Some of the figures of this expense are listed below, some have been approx¬\nimated but are accurate representations.\nFrequency monitor (Gates)\nModulation monitor (Gates)\nPower output meter\n250 watt transmitter (Gates)\nthe additional salary of an engineer to make daily tr nsmi\n;;iooo.\n600.\n250.\n4000.\nAside from the fact that many school districts cannot or will not meet this ex¬\npense, the added power usually will do nothing to add to the station’s purpose, nor\nwould a plan to convert to a carrier current operation.\nTo be specific, WOAK’s original application stated its objectives as:\n1. To train students in the broad field of broadcasting.\n2. To assist teachers by broadcasting programs on all levels for in-school listening.\n’S, To act as a bridge between the schools and the community.\n4. To'render community service by supplying serious educational and cultural programs.\nThe fact that students are actually \"on the air\" gives the needed impetus to stive\nfor quality programs. *et added power does not change this condition curcuit basis\nthis attitude would necessarily change. However, it is impossible to link the buildings\nwithin the school system, using public utility lines.\nAlso, added power wPuld increase station coverage? but since its primary goal is\nto serve the community %oin§ outride of the city limits is not. really necessary.\nMany small communities have ho reed to go beyond their average ten mile radius. We\nservice the community of Royal Oak by broadcasting the City Commission Meetings and a\nweekly sports event from the high schools.\nIf the forces of the po.ex* increase forces the 10 watt station out of existance,\nthey would no longer be able to act as both an important part of the community ana school\ndistrict while educating students in the techniques and evaluation of broadcastingo"
}