{
  "id": "d561-34",
  "text": "To: Federal Communications Commission From: Board of Education, Twp.\nWashington, D. C* High School District 203\nCook County, Illinois\nNew Trier Township High School\nCOMMENTS IN REGARD TO FCC DOCKET No. l4l85\nWe note with grave concern the proposals contained in Docket No. l4l85\nwhich we feel to he a serious threat to the existence- of low-powered non¬\ncommercial educational FM broadcasting.\nBACKGROUND INFORMATION\n1) One of the most valuable and basic qualities of educational radio is that\nit has been permitted under regulations of the Commission to flourish in a\nhealthy climate of local control by public schools and other licensees who\nhave discovered it to be a unique means of assisting the educational programs\nof communities which it serves. In a closely related development the Commission\nhas authorized the Instructional Television Fixed Service. One of the major\nfactors inducing schools to consider using this new service is that local\ncontrol of program content is available to a degree not previously possible.\n2) Six years ago the Board of Education of Township High School District 203,\nCook County, Illinois, authorized the construction of WNTH pursuant to regula¬\ntions of the Federal Communications Commission. The station serves the villages\nof Winnetka, Wilmette, Glencoe, Kenilworth, Northfield, and portions of North¬\nbrook, all of which comprise New Trier Township, Cook County, Illinois. This\ntownship is located in north suburban Chicago in a high-density residential\narea. The combined population of the township is approximately 60,000.\n3) With the planning of a second high school now in operation, New Trier\nbecame interested in the development of the Instructional Television Fixed\nService. Application was made to the Commission for four channels in this\nservice, and call letters KZG-66 were eventually assigned to the Board of\nEducation of the High School district as licensee. The joint participation\nof the several elementary districts which comprise the Township High School\nDistrict led to the formation of the New Trier Township Instructional Television"
}