{
  "id": "d561-35",
  "text": "Council. KZG-66 went on the air on November 21, 1966, with programs prepared\nby local educators designed for virtually all grade levels and in most\ncurriculum areas. As the second high school was constructed, architectural\nplanning was made for a satellite WNTH studio, in order to broaden the\nbase of operations for educational radio in the township. Equipment for\nthis studio has been purchased and is now in process of installation. It\nwas felt advisable to do everything possible to insure quality reception\nof the WNTH signal throughout the station's primary coverage area, and\naccordingly the original antenna was later replaced with a four-bay high\ngain array.\n4) The above general facts are presented in order to make it clear to the\nCommission that this forward-looking high school district has done and is\ndoing everything in its power to provide a superior educational program for the\nchildren in its seven combined communities by taking full advantage of the\nfrequencies and services made available to it by the Federal Communications\nCommission.\nSTATEMENT OF POSITION\n5) it is felt by the Board of Education of New Trier Township High School\nthat the proposals contained in Docket No. l4l85 related to ten-watt non¬\ncommercial educational FM broadcase stations will work a serious hardship\nupon school systems and colleges which currently operate at low power levels,\nand upon WNTH in particular. One of the factors which school administrators\nmust consider in deciding whether or not to embark upon a program of educa¬\ntional broadcasting is that of cost. If the proposals contained in the above\ndocket are put into Rule form, the additional cost of driver units, final\namplifier, required monitoring and frequency measuring equipment would be very\ndifficult for the average school system to contemplate. In addition, the\nprobable necessity of having immediately available the services of an engi¬\nneering person with the FCC First-Class Commercial license would in many cases\nrequire the employment of a full-time professional member of the school staff."
}