{
  "id": "d561-37",
  "text": "- 4 -\nthe summer vacation period to teach courses in Radio Workshop, Broadcast\nSeminar, and Production, using the WNTH facilities while off the air for\nintensive student training. Pupils culminate their summer workshop experience\nwith a week of live programming at the conclusion of the term. The initial\nweeks of the school year in the fall are used for similar training purposes.\nIt is during this period that a student staff of almost 100 persons is trained\njLn the operation of the station* We submit that if school stations are forced into\n\"broadcast day schedules whiqh are unrealistic in terms of teacher-student time,\neffort and expense, they will \"be forced to discontinue their Broadcasting, for\nwe place a high premium upon the energies of our teaching faculty and a high\npremium upon the requirements to be met by the students themselves during their\nhigh school years. If the low-power educational station is able to work satis¬\nfactorily within the total educational framework of the school, then it has a\nvaluable and unique contribution to make. But if it is to be subjected to the\nsame rigorous standards imposed upon commercial broadcasters it cannot fulfill\nits educational obligations.\n10) We are in agreement with those portions of Docket No. l4l85 which show\nconcern for the calibre of programming by some educational stations, and we would\nendorse the Commission's position that educational broadcasters have a responsi¬\nbility to the communities their stations serve in this regard. The business of\nthe public school is to educate. The business of noncommercial PM broadcasters\nis similarly to educate, but it is also a fact that a major part of the business\nof an educational broadcaster is in the education of the students who participate\nin the operation of the station. It is these young people, every bit as much\nas the listener, who benefit from the operation of a secondary school educa¬\ntional PM station. The educational broadcaster has a responsibility to them\nfully equal to that of his responsibility to his listeners. His station is\nfull of young, enthusiastic and energetic people whose creativity in program\nproduction, whose ingenuity in seeking out specdaL events worthy of community\nbroadcast, whose public speaking abilities and skill at interview are constahtly\nbeing challenged. More than six hundred students have taken direct and active\npart in the operation of WNTH since its inception; of these a considerable\nnumber have moved ahead to serious study of communications at the college and\nuniversity level. Indeed, many students who received their first exposure to\nthe broadcast media through their WNTH experiences have distinguished themselves,\nthe station, and New Trier Township High School by having achieved considerable\nstature in the fields of radio and television."
}