{
  "id": "d561-4",
  "text": "The 10 watt station also serves as the basic replacement of the carrier\ncurrent AM redio service that has been used by many colleges. With the great\nbuilding boom of new housing facilities and dormatories on many campuses, it\nhas become impractical to continue carrier current AM operation, and a 10 watt\nFM station has resulted. One of the inherent problems of a low-powered AM\ncarrier current station is keeping the power low enough to be within the legal\nlimits as required by the FCC rules and regulations.\nSince many educational institutions seem to condone the start and the op¬\neration by students of a 10 watt station, involving little or no supervision\nfrom the faculty or the college administration, the programming broadcast over\nthese facilities is not necessarily well regulated. Popular music in some\ncases rock and roll full time, constitutes the programing. The FCC should re¬\nquire the educational institution to indicate in the license review forms to\nshow the type of supervision that is exercised over the operation of the\nfacility or school administration.\nIn the areas where there is a major population center, with a great dis¬\ntance to the next population center, the 10 vatt station does not necessarily\nperform the best function for fostering good non-commercial service to the\ncommunities. In cities with a population of over 100,000, the 10 watt station\nwill not usually provide adequate coverage of the community, as it is normally\nnot located in the geographical center. Therefore, to provide coverage that\nhas a signal strength sufficient to be received by a short indoor antenna, more\npowder is needed..\nThe feeling in most major metropolitan areas is that the 10 watt station\nis not adequate to serve the community. But, since this type of station is the\neasiest to get started, the FCC does not do away with this type of station\nentirely. Instead it requires the licensee of such a station to increase his\nminimum power or submit a statement showing good cause as to why this could"
}