{
  "id": "d561-61",
  "text": "Ottawa Univehsity\n0 ttawa, Kansas\nDecember 20, 1966\nRe: Docket No. 14185\nFederal Communications Commission\nWashington, D.C. 20554\nGentlemen:\nWe make the following comments regarding the proposed rule-\nmaking discussed in Docket No. 14185:\nOur chief concern is with the future of the 10-watt educational\nFM stations. Ottawa University has operated such a station,\nKTJO-FM, since 1951, on a frequency of 88.1 mHz (Channel 201).\nOur station has emphasized good music, educational programs, and\ncommunity relations. It has served as a laboratory for courses in\nradio, taught by the speech and drama department, and it has also\naided in the training of students in the physics department.\nKTJO-FM has thus served the community of Ottawa, Kansas, and\nit has been an important part of the educational program of Ottawa\nUniversity. We hope to be able to continue the operation of the\nstation.\nOttawa University is a four-year liberal arts college, founded\nin 1865. It is located in Ottawa, Kansas, a city of 12,500 popula¬\ntion, about 50 miles from Kansas City. The University has been\naccredited by the North Central Association of Colleges and Secon¬\ndary Schools continuously since 1914. Enrollment for the fall\nsemester 1966 was 1028. Because of the nature of a liberal arts\ncollege, there is no professional department of radio. However,\nmany students who have taken the radio courses in the speech and\ndrama department and/or worked on the staff of KTJO-FM have\nhad training and experience which has been a valuable part of their\ntotal educational experience. A number of former staff members\nof KTJO-FM have also gone into full-time professional work in\nradio upon graduating from Ottawa University, including Dan Bellus,\nRobert Palmer, Bernard Hawley, Barry Rohde, Benton Weiss, Ron\nWalker, and Jon Pritchard. They have worked at all levels of opera¬\ntion, including station manager and network positions. Ross\nDavidson and Richard Bayha are now in graduate work in radio and"
}