{
  "id": "d561-62",
  "text": "television in other universities. A number of physics majors who\ngained experience on our station are now in electronics work,\nincluding Norris Haight, Don Houser, and Richard Ives. Two of\nthe current staff members of KTJO-FM are now employed part-\ntime by the local commercial station, KOFO.\nCurrent programming of an educational and curricular nature\non KTJO-FM includes broadcasting of the weekly lectures of the\nSocial Science Divisional course Man in Society, and review\nmaterial for the Fine Arts Divisional course Man and the Arts.\nPrograms have also included live performances by music stu¬\ndents and faculty, programs of special interest to Ottawa Univer¬\nsity women, and topics of current interest presented by students\nin political science.\nIn addition to the above curricular programs, the following\ninstructional, cultural, religious, public affairs, and public service\nprograms are broadcast by KTJO-FM: The Sunday morning\nservices of the North Ottawa Baptist Church; dramatic radio pro¬\nductions by the radio classes; Election Night, 1966; Campus news;\nCampus sports; United Nations News; Citizens' Council Forum;\nForum of Unpopular Notions; Page Two (Southern Illinois Univer¬\nsity); Projection; Kansas Afield; Perspective; Layman's Hour;\nWould You Believe; This Week in Agriculture; Focus on Music;\nLiving Faiths of Man; Face to Face with Yourself; This Restless\nWorld; Satellite; Investments. All local sports events of Ottawa\nUniversity are broadcast by KTJO-FM, and all away games of the\nUniversity not broadcast by the local commercial station KOFO\nare carried by KTJO-FM.\nMost of the programs described above are not available from\nother stations received in Ottawa. Moreover, the only FM stations\nreceived in Ottawa which emphasize good music are KXTR, KANU,\nand KTJO-FM. KXTR (Kansas City) does not put a strong signal\ninto Ottawa, which leaves KANU (the educational FM station of the\nUniversity of Kansas) and KTJO-FM as the only satisfactory signals\ncarrying the kind of music for which FM is especially suitable. If\nour station were taken off the air, our listeners would be deprived\nof this good music, carried by KTJO-FM, as well as most of the\nspecial programming listed above.\nOttawa is not served by a TV station on Channel 6, and conse¬\nquently KTJO-FM does not interfere with any TV station. In fact,\nsome listeners in Ottawa use Channel 6 on their TV sets to receive\nKTJO-FM. FM channel 201 is a suitable channel for this area.\nIn our operation we do not have staff members giving full time\nto radio. Dr. W. D. Bemmels, Professor of Physics and Dean of"
}