{
  "id": "d561-63",
  "text": "the College, holds a First-Class Radiotelephone license and\nsupervises the technical operation of KTJO-FM, Mr. Michael S.\nTwedt, Assistant Professor of Speech and Drama, supervises\nthe programming and the general operations of the station. For\nour type of operation, the simplicity of the FCC regulations for\nthe 10-watt educational FM station is ideal. The costs of operation\ncome from the University budget, and since Ottawa University is\na private institution, the economy of the 10-watt station is impor¬\ntant to us.\nMoreover, we find the 10 watts e. r. p., with our present\nantenna, to be adequate to serve the city of Ottawa and our campus.\nIf we were required to go to higher power, the added financial\nburden of installation and maintenance of the added equipment\nwould be important to us.\nWhen the license for KTJO-FM was issued in 1951, many of\nthe commercial stations had tried FM and had given it up. Opera¬\ntions such as ours, with programming of a cultural level not avail¬\nable on the AM channels, and with programming peculiarly suited\nto the technical advantages of FM, helped to bring FM along to its\npresent state of popularity.\nOttawa University has operated a campus-limited carrier-\ncurrent AM station since 1942. When KTJO-FM was put into\noperation, the carrier current station was not discontinued. It\n\"simulcasts\" the KTJO-FM programs, but it also carries light\nmusic for students at times of the day when our FM station is not\non the air.\nIn view of all of the above considerations, we hope that no\nrule changes will be made which will interfere with operations of\nKTJO-FM with its present transmitter power output and on FM\nchannel 201. Since slightly more than half of the existing educa¬\ntional FM stations are operating with a transmitter power output\nof 10 watts or less, those stations surely represent an important\nand significant broadcast service.\nSincerely,\nAndrew B. Martin\nPresident\nABM:am"
}