{
  "id": "d561-66",
  "text": "Lowell Institute Cooperative Broadcasting Council\n\\ A/C\"* D l-J Educational television Channel 2, FM radio 89.7 me\n/iA V V D I I 725 Western Avenue, Boston, Massachusetts 02134\nUNiversity 4-6400\nComments - Docket 14185\nProposed Table of Educational FM Channels\n3.A. 2. -\nRegional networking; Eastern Educational Radio Network,\nwhich depends on high-power \"key\" station for off-the-\nair pickup and relay from Boston-Amherst, Mass .-Albany, N.Y.\nThe rest of the network (south along the eastern seaboard)\npresently depends on tape exchange, but would hope to\nbe able to move eventually to off-air pickup and relay.\n3.A.3. -\nLive stereo broadcasts by WGBH-FM of local community\ncultural events. Stereo requires more power to put the\nsame quality signal the same distance. News and public\naffairs; coverage of developments in the state capital\nis of importance to the entire state. This requires high\npower for (1) broad coverage area (2) inexpensive off-\nthe-air networking.\n3.A.5. -\nSee comments above. Because of diversity of services and\nsources of support for educational radio stations, the Table\nof Allocations should provide for diversity in facilities.\nEducational radio which are not part of a school or university\nbudget require a broad base of voluntary financial support,\nwhich high power and wide coverage area are virtually\nessential to insure. Likewise, there are many areas which,\nfor the foreseeable future, would be totaly lacking educational\nradio service absent high power stations. (An example\nis Cape Cod in Massachusetts.)\n3.C.\nEverything possible should be done to encourage 10-watt\noperations to (1) seek higher power, and (2) broaden their\nservice to the community. As educational radio matures as\na total community service, there is less need for, or\njustification for, operations which are so limited in scope\nand power.\nCouncil Members\nLowell Institute, Boston College, Boston Symphony Orchestra, Boston University, Brandeis University, Harvard University, Massachusetts Institute of Technology,\nMuseum of Fine Arts, Museum of Science, New England Conservatory of Music, Northeastern University, Simmons College, Tufts University, Yale University\nAffiliations National Educational Television, Eastern Educational Network, National Association of Educational Broadcasters, Eastern Educational Radio Network"
}