{
  "id": "d561-8",
  "text": "for\nCoJjfa\n11735 CAMPUS DRIVE\nRIVERSIDE, CALIFORNIA 92505\nselective listeners\nPhone 689-4321, Ext. 256\nDecember 20, 1966\nFederal Communications Commission\nWashington, D. C. 20$5U\nGentlemen:\nThis is a reply to the notice of inquiry issued by the FCC recently (Docket\nNo, 11*185) regarding the FM channels set aside for use by non-commercial ed¬\nucational stations. The plan is to assign a number of channels for each lo¬\ncality based strictly on a population basis and to eliminate gradually the\n10-watt FM stations in preference to the stations operating with higher power.\nIn theory, perhaps, the 10-watt stations are not utilizing the frequencies to\nbest advantage. However, there are other things to consider other than what\nmay appear to be theoretically advantageous.\nFirst of all, the table of assignments does not give much flexibility. For\nexample, the local area where KSDA is located has a population of approximately\n300,000 in the combined Riverside/San Bernardino areas. We have five non-com¬\nmercial educational FM stations on the air. Now according to the table of the\nallocation plans there will be four assignments made to an area this size.\nThis means that in the local area there is one more station on the air than\nwhat would be allowed going by the new allocation plans. There should definite¬\nly be more flexibility allowed in the table of assignments because in certain\nareas there are more schools than in others. And there should be more oppor¬\ntunity for these schools to operate their own stations.\nWe believe that the answer to the problem comes with the fact that the FCC\nshould consider assigning channels for non-commercial educational use from\nchannels 201* through 220, and save the bottom three channels for use by 10-\nwatt stations, and move all of the current 10-watt to these channels. Most\n10-watt stations already operate on these channels. And therefore a move\nto these frequencies would not affect very many stations. Then the higher\nfrequencies would be available for assignment, for use by higher powered\nstations.\nThe use of channels 201 through 203 by the 10-watt stations would give the\nadded flexibility needed to allow other schools to operate their own radio\nstation and in addition would minimize interference to television channel 6\nby keeping the station’s power on frequencies next to the channel limited to\n10-watts transmitter output. This would greatly reduce the amount of inter¬\nference on channel 6 and would allow sufficient band width in most areas to"
}