{
  "id": "d561-85",
  "text": "-3-\nMonday, March 1 - 1:30 p0m« - Legislative Issues: Education, Taxes, etc.\nState Representatives William Frenzel (C-Goiden Valley), Paul\nOvergaard (C-Aibert Lea), Martin Sabo (DFL-Minneapolis), Stan\nEnebo (DFL-Minneapolis) answer questions from University of\nMinnesota students\nTuesday, March 2 - 1:30 p„m. - Legislative Issue: The Governor’s Program\nGovernor Kai'l F* Rolvaag discusses his legislative program with\nmembers of the Citizens League of Minneapolis\nThursday, March 4 - 4:45 p,m0 - Legislative Report: University Research\nDean Paul V„ Grambsch of the University School of Business\nAdministration tells how the school’s research contributes to\nthe state economy and to Minnesota business\nFriday, March 5 - 4:45 p0m. - Legislative Report: Higher Education\nRepo Rod Searle (C-Waseca) explains his approach to co-ordinating\nhigher education in Minnesota\nMonday, March 8 - 1:30 p„m, - Legislative Process, Lecture #4\nDre Charles Backstrom tells how a bill becomes a law in the\nlegislature\nTuesday, March 9 - 1:30 p.m0 - Legislative Issues\nSenator Robert Dunlap (C-Rochester) discusses legislative\nissues with members of the Citizen’s League of Minneapolis\nThursday, March 11 - 1:30 p«nu - Legislative Issue: Reapportionment\n\"The Rural-Urban Conflict and Reapportionment\" is analyzed\nby Dr. Robert F0 Berkhofer JrQ, Assistant Professor of History\nand Dr„ Charles Backstrom, Associate Professor of Political\nScience, both of the University of Minnesota\nThursday, March 11 - 4:45 p„m* - Legislative Report: University\nExtension Dean Willard Thompson of the University’s General\nExtension Division tells how the University serves the state in\na variety of ways\nMonday, March 15 - 1:30 p0rru. - Legislative Process, Lecture #5\nDr0 Charles Backstrom describes the role of the chief legislator:\nhow the Governor influences legislation-\nTuesday, March 16 - 1:30 p„nu - Legislative Issues\nRep* Fred Cina (DFL-Aurora) discusses legislative issues with\nmembers of the Citizen’s League of Minneapolis\nThursday, March 18 - 1:30 p„nu - The Legislative Process: The Role of\nCaucuses and Parties in the legislature, Participants include\nHouse Speaker Lloyd Duxbury and Rep, DoD, Wozniak (DFL-St0 Paul)\n)"
}