{
  "id": "d561-9",
  "text": "-FCC-\n12/20/66\nPg.2\nallow the current 10-watt stations to move to these frequencies without ap¬\npreciable interference. It would also give room in many areas for new sta¬\ntions to be built on these frequencies when the assigned channels had become\noccupied.\nWhen approximately fifty percent of the non-commercial educational FM sta¬\ntions in the United States are in the 10-watt category it is hard to believe\nthat this type of station should be eliminated. The contribution of the 10-\nwatt FM station to the field of educational broadcasting is much greater than\nthe inefficiency factor caused by the use of a number of stations operating\nwith low power.\nThere are several reasons why 10-watt stations should be allowed to continue\nto operate. The first reason is the cost factor. Many colleges are not able\nto build large FM stations to begin with. However, they do want to get on the\nair. A low power 10-watt station allows them to get on the air for a minimum\namount of expense. After the value of the radio station is proved, and per¬\nsonnel have experience in operating the station, many times these stations\nthen go up to higher power and are able to serve a larger area. So the 10-watt\nstation actually proves its value in the fact that it becomes a stepping-stone\nto greater service by the school which is running the station, in that later\non chances are it will increase to higher power and serve a larger area.\nThere is an incentive to start with low power when small funds are available.\nFor example, KSDA is cooperating in a tape exchange network with five other\ncollege operated FM stations. Of these stations four started out as 10-watt\nstations. And of the four that started out as 10-watt stations three of them\nhave either increased their power or currently have construction permits to do\nso. We wonder how many of these stations would be operating at all if they\nhad not first started out as low-power stations and later increased and expanded\ntheir facilities as funds became available.\nSecond, in some areas, 10 watts is the most economical power with which to\noperate. For instance, in small communities centered around the school higher\npower is not needed nor is ti economical.\nA third reason is that to begin with in certain c ases the engineering person¬\nnel may not be available for a larger operation. Since daily transmitter\nchecks are not required with a 10-watt station, and certain other engineering\nprocedures are not required, an engineer can properly maintain a small station\nwhile getting more experience, and the college can in time train more person¬\nnel for their first or second class license. After personnel are properly\ntrained, then they would be capable of operating the station at higher power\nand the personnel would be available to make the daily transmitter checks and\nperform proper maintenance of the equipment."
}