{
  "id": "d561-90",
  "text": "I'm sure I voice thousands of people's appreciation for the beautiful music\nplayed on Saturday mornings*.. We don't take this fine program for granted,\nyet* in our busy homemaking days we probably enjoy the program without\nacknowledging. Thank you so much! (Mrs. A. Greenspan* Minneapolis)\nWotan is pleading with his stubborn wife at this moment (and what a Wotan is\nGeorge London!). It's almost too difficult to write a proper letter of\nappreciation to KUOM for these Saturday afternoon programs of the Ring while\nthey are being performed — but I don't want to postpone telling you how very\nmuch they are enjoyed. I have been a Ring enthusiast since I was ten years\nold, which is nearly pre~World War I. Wagner has been \"in\" and \"out\" several\ntimes since then but somehow it takes more than Adolf to ruin such music...\nAgain, many thanks for this music. Who needs to go to Bayreuth? (Winifred\nNetherly, Stillwater, Minnesota)\nHow many times I have been indebted to you for the 2*30 p.m. musical programs\non KUOM!. As you are playing the Elliott Carter double concerto for piano\nand harpsichord at this moment, I'm reminded of a talk on Elliott Garter's\nmusic which I gave to the music section of the Women's Faculty Club at the\nUniversity of Minnesota two or three years ago. Thank you again for your very\ndevoted service to music. (Mrs. Mary A. Van Wagenen, Minneapolis)\nAll your comments on music are most interesting and X enjoy all your programs\nvery much, especially \"Ad Libitum\" with your interviews. I'm also very happy\nto be on your mailing list and receive the KUOM program guide. Thank you\nvery much for everything. (Mrs. S. Keifer, Burnsville, Minnesota)\nI was unable to attend the concert at Northrop Auditorium this year which\npresented Charles Ives* Fourth Symphony. I was grateful for the\nopportunity to listen to this controversial work on KUOM. I appreciate very\nmuch the work and effort involved in recording and presenting these concerts\non radio. Please continue them next summer. (A KUOM listener)\nThis is to express appreciation for the Wednesday evening concerts of the\nMinneapolis Symphony. The highlight of the series for me was the \"Watts\nConcert.\" These concerts are very much appreciated for those of us who cannot\nafford to be there in person. Thank you. (M.I. Cornwall, Minneapolis)\nWe are overjoyed to have a really fine state station within earshot again.\nWere for years devotees of WHA in Madison, Wisconsin, then spent six years in\nthe desert. Please send your program bulletin post haste. (Mrs. James G.\nMiller, Rochester)\nThank you for interviewing Dr. Edward Francel of the School of Social Work\non Monday, March 14, to highlight National Social Workers Month. Station\nKUOM, with its large and special audience, has helped to publicize the need\nfor more persons to enter the field of social work where a serious manpower\nshortage exists. This public service is sincerely appreciated. (Mildred\nPtashne, Caseworker, Child Service Division, Hennepin County Welfare Department)\nMonday, November 28, at 1:00 p.m. you reviewed books for Christmas giving. I\nwas driving and unable to write down the titles. Is it possible to get a list?\nI was particularly interested in the four or five books on Russia for children.\nIt was frustrating not to have access to paper and pencil. Thanks for your\nhelp. (Louise Rayner)\nI am enjoying the historical novel you are reading at present on \"Your Novel.\""
}