{
  "id": "d561-92",
  "text": "Last Saturday’s \"Essay on Cars\" was fabulous, a classic! Your programs\nare the last few ones where I cars hear good classical anisic and discussion\nof controversial subjects* Keep it up* (Gordon R. Coffin, Long Lake)\nHow I enjoy your programs, both on radio and TV. I have listened to \"The\nMinnesota Theatre of the Air\" all summer and enjoyed it. I hope it may be\ncontinued* (Dulcie Kees, St* Paul)\nThough I was unable to hear all of the '^Theatre of the Air” productions,\nthe ones I did hear were enjoyable* As an avid listener to your station\nsince moving to Minnesota in 1961, I especially appreciate the variety\nand scope of programs* Good music is available on FM, but little else*\n(Mrs. Rose Marie Cassidy, St* Joseph)\nWe do enjoy your programs. \"Variety Music Hall” and \"The Evening Concert\"\nare part of my day* (Florence S. Rawland, St. Cloud)\nWould it be possible to have a copy of Dr. Nichol*s speech on \"Public\nAffairs Forum\" today? It was excellent and I would like to have my\ndaughter, who is a University student, read it. Thank you* (Mrs. R. M*\nCanner, St. Paul)\nThe \"To See Ourselves\" series has been very fine* I just listened to the\nconversation between Dr. Tillich and Dr. Rogers. A blind friend of mine\nwas also listening and is very anxious to get a tape or a record of the\ndiscussion* (Mrs. J. 3* Corey, Minneapolis)\nDo you have a printed program listing your regular offerings? I am\nparticularly interested in securing one just now as I am setting up\na bulletin board for our faculty and students to try to illustrate where\nthey can find good radio or television listening or viewing. I have\nenjoyed you programs. (Mrs. Sanita G. Smith, Associate Professor, Stout\nState University, Menomonie, Wisconsin)\nPlease repeat the program by Professor Goram on \"Biology and the Future\nof Man\" broadcast on \"Public Affairs Forum.” I found it fascinating but\nso startling I am sure I missed some of his points. For about ten years\nI have listened to \"Public Affairs Forum\" on KUOM and hope you will\ncontinue this type of broadcast forever. Thanks for continuing my education.\n(Mrs. Robert Day, St. Paul)\nMy husband and X both listen to most of the lectures given by KUOM and\nenjoy them immensely. You have also inspired me to make another try at\n\"War and Peace,\" and I am even enjoying it this time. (Katherine Howard,\nMinneapolis)\nA kudo to Robert Boyle for his topic selection and presentation of news.\n(W.W. Caldwell, Minneapolis)\nThese talks (by Dr. Donn Mosser on \"Doctor, Tell Me\") were superb. He\ndid his job in an excellent and forthright manner* They presented to the\nattention of the listeners information that cannot be repeated too often.\n(Willard D. White, M.P., Minneapolis)\nWhat a wonderful opportunity to be able to hear your classroom lectures\non \"The Geography of Minnesota.\" We look forward with real excitement\nto hearing what you have to say...an example of real scholarship and the"
}