{
  "id": "d561-96",
  "text": "Mr. Ben F. Waple\nPage 2\nt\nA channel search indicated that there are no other acceptable\nchannels that would allow proper operation of the relay system\nbetween Collegeville and New Brighton.\nFor these reasons we would like to ask the FCC to classify\nchannel 216 in Minneapolis-St. Paul as a Class \"C\".\nIt is our suggestion that because of the wide dispersion\nof 10 watt stations now occupying the spectrum of the\neducational band, that the FCC consider the allocation of\nclass \"A\" channels on a city by city basis when the allocation\ntable is drawn up. It should then be possible to insert the\nnecessary \"A\" channels, alloting them to 10 watt and other\nstations presently beneath the \"A\" technical ceiling.\nIt is our opinion that it would be most undesirable to limit\nexisting educational FM stations of power greater than 10 watts\nto the ceilings of Class \"A\" stations when there is an alter¬\nnative unused or 10 watt channel in the same city that could\njust as well be so limited.\nWith regard to a power and height ceiling for educational\nstations we would again urge the FCC to limit the educational\nchannel only where necessary for the protection of Canadian\nFM stations. We do agree, however, that the milage separation\nfor class \"C\" commercial stations be adopted for the educational band*\nKSJR-FM,presently under construction permit of 37,000 watts, may\nin the future be the feed station for a network of educational\nstations in Minnesota. If this were tobe the case, it would be\ndesirable to increase both vertical and horizontal power to a\nlevel which would allow ont- the-air network operation. It is\npossible that the required power would be in excess of lOOkw\nand 2000 feet and therefore undesirable and not necessarily in\nthe public interest to have that as a maximum ceiling.\nTherefore we would like to encourage the FCC to limit only\nthose stations that might possibly cause Canadian interference,\nas they have done in the past with channels 218, 219, and 220\nin protecting the commercial band.\nIn summary, we specifically request that channel 216 in New\nBrighton, Minnesota be delegated-a \"Class C\" channel; that all\nClass \"A\" channels be allocated according to the possibilities\nof each city and that class \"C\" channels be limited in power\nand height only where necessary for interference protection of\nCanadian stations.\nSincerely,\nWilliam H. Kling\nDirector of Broadcasting\nWHK:ko"
}