{
  "id": "d561-98",
  "text": "Minneapolis-St. Paul\nWinona\nNorthfield\nSt. Peter\nPipestone, Minnesota\nThus far formal.applications for stations in Collegeville\nand Minneapolis-St. Paul have been accepted for filing by\nthe FCC on behalf of St. John's University, a jnember of the\nMinnesota Private College Council. The Collegeville\napplication has been granted a construction permit and call\nletters KSJR-FM. Should the FCC grant the application for\na station in Minneapolis-St. Paul the first link of this\nproposed network will be established. ,\nIn addition, the College of St. Benedict has recently been\nconnected by telephone line to the KSJR studios, thus\ncompleting the first inter-college connection. The third\nlink would be the re-activation of WCAL-FM at the College of\nSt. Olaf, a class \"C\" station which has been silent for\nfifteen years.\nIf licenses for stations in the above listed communities\nwere granted by the FCC, the other private colleges would\nthen be interconnected to the studios of the nearest\ntransmitter, allowing any college to feed the network,\nthrough a coordinating center, and yet leaving provision for\nindividual stations to broadcast a locally originated program\nof local interest, separately from the network.\nProgramming will be appropriate to the liberal arts nature\n•of the private college. The emphasis will be on cultural,\nfine arts* public affairs, general education and religious\nprogramming. It is intended also to offer timely and informa¬\ntive national and international news and commentary on public\nissues, applying these issues to and indicating their\nsignificance to the local broadcast area. Existing relation¬\nships established between KSJR and the Eastern Educational\nNetwork will enable it and proposed additional network stations\nto benefit by even greater diversification of.viewpoint and\nphilosophy. This mechanism will not only help to generate\nmore and better programs, but will allow for a more equal\ndistribution of the country's resources.\nIn addition we propose to use the 67 kc subcarrier for multi¬\nplex broadcasts to specialized audiences such as doctors,\nlawyers, and local government leaders as well as classroom\ninstruction for elementary, and secondary schools. We propose ."
}