{
  "id": "d1662-0",
  "text": "' • July, 195-6\nPresident’s Page\nDear NAEBers:\nSome people think of June as a vacation month, but I didn’t find it so.\nLots of things were happening. For example, NAEB held regional meetings in\nthree areas — V, VI, and IV.\nIt was my good fortune to attend meetings in Denver and San Francisco,\nwhile Skornia made the meeting in Minneapolis. The meetings arranged by\nSchwarzwalder and Adams, our regional directors, were exceedingly good. They\nhad help, too, on the home grounds from Henry Mamet at Denver and from Dick\nMarsh in San Francisco.\nThe president had an opportunity to talk shop with all the NAEBers while\nattending the meeting, and obviously saw many an ol! friend. It was a wonderful\nfeeling to note the intense interest in educational broadcasting, in the members’\nconcern for the use of radio and television for education.\nIncidentally, both Regions V and VI indicated that as of this time they\ndid not wish to have their regions changed by action of the Board or convention.\nThe decisions were reached by unanimous consent, if I recall correctly.\nThis being the case, the president does NOT now propose that any Regional\nDivision changes be made by the Board of Directors, which was empowered to do\nso at the last convention.\nThis doesn’t mean that changes can’t be made, but chief concern originally\ncame from the Region VI group. Even in two years, opinion has changed. To\nforce a change upon any region is not the desire of the officers, I’m sure.\nLet’s say that at anytime the subject needs to be reviewed, we’ll do it.\nMeanwhile, there would be no objection to have NAEBers within one state consider\nattachment and detachment from a particular region for special cause. If such\nwishes are expressed, certainly the Board will consider. Until that time comes\nalong, let’s drop the subject.\nRegion VI took another action, and I must say that the president shares\nthe view expressed. It concerns meeting places for our annual convention.\nRegion VI feels that two out of every three years the NAEB annual convention\nshould be held in the heart of the USA, and that means around the Chicago area.\nFurthermore, when held out of the heart, Region VI members believe that said\nmeetings should rotate from east to south to west to east, so that all sections\nof the country get a chance on ’’proximity” every third year. The proposal will\nbe presented to the 1956 convention as an amendment to the by-laws. Region VI"
}