{
  "id": "d1079-0",
  "text": "NEWS LETTER ON\n1730 EYE STREET, N. W.\nFREQUENCY MODULATION\nISSUED WEEKLY FOR MEMBERS OF\nFM BROADCASTERS, INC_\nWASHINGTON 6, D. C.\nVOL. 2, NO. 16\nApril 20, 19L5\nLISTENING SURVEY FOR CLEAR CHANNEL HEARING\nA survey of the amount and kind of listening done by families outside the pri¬\nmary service areas of U. S. radio stations—the largest ever attempted by a govern¬\nment agency—-was proposed by FCC staff representatives on April 18 at a meeting\nattended by 28 industry attorneys and research men. The information would be used\nin connection with the forthcoming clear channel hearings.\nAlthough industry supported the proposal it felt the -survey should include\nlistening both yd.thin and without the primary areas, a suggestion which would double\nthe survey's scope. The original plan would involve sending out 200,000 mail ques¬\ntionnaires and personal interviews in 50 to 70 representative counties. The survey,\nto be completed by mid-summer, will not overlap the proposed BMB listening census.\nIndustry was urged to take part in planning the technique and questions. Networks\nand other radio groups were invited to share the costs with the FCC. Research men\nfrom the Budget Bureau, Census Bureau and Department of Agriculture have been as¬\nsisting the FCC in planning sampling techniques.\nTIGHTER RULES ON STATION REPORTS\nThe FCC on April 17 issued an order in Docket No. 6756 proposing a revision\nof rules relative to the filing of financial, ownership and other reports by lic¬\nensees of standard, FM, television and international broadcast stations. It seeks\ndeletion of Rules 1.361 and ii3*l end the substitution of new rules calling for fin¬\nancial reports at the end of each year, copies of contracts 30 days after execution,\nownership reparts each March 1 and interim ownership reports within 30 days after\nchanges occur. Copies of the order are being mailed to all licensees. Oral argu¬\nment has been set for May 21 at 10.30 A.M. Appearances must be filed on or before\nMay 9 and must be accompanied by brief,\nPORTER OPENS PHILCO RELAY LINK\nThe late President Roosevelt was eulogized by FCC Chairman Paul Porter in a\nspeech y/hich marked the opening of Philco's Washington-Philadelphia television re¬\nlay link on Tuesday evening, April 17. The Chairman spoke from the Statler Hotel\n’where selected newsmen witnessed a demonstration of the broadcast taking place over\nstation WPTZ Philadelphia. Pointing out that ’’obstacles of a technical and economic\nnature...must be overcome before television can be made available on the same wide¬\nspread scale as sound broadcasting,\" he congratulated Philco on this \"first\" as an\nexample \"of the vigor with which these problems are being attacked,\"\n2 - 16 - 365"
}