{
  "id": "d1079-1",
  "text": "We have seen, I believe, that whatever the program, whoever directs it,\nthere is inevitably education. I think our Committee interprets education as\nsomething broader than mere formal school instruction. The programs which come\nto my home, which my children listen to, exert an educational influence. I some¬\ntimes tremble as I listen to some of the programs, and yet, in order to make a\nproper discriminating selection of programs for those children, I have to, in the\nparlance of the west., \"ride herd\" on that radio continuously.\nWe are looking at education in its broadest sense, the influence which in¬\nformation and entertainment and exhortation exert through the radio upon the\nAmerican people.\nOur Committee has given this careful study. We have many contacts through\nour schools, through our broadcasts, through our tests of programs, through our\ngeneral acquaintance with the country. We cover the nation, we have millions\nof friends and listeners and it has been seen by this Committee that there is a\ngrowing public sentiment realizing the importance, increasingly, of this new\nmedium.\nWe believe there has been a growing dissatisfaction with some forms of present\nbroadcasts. We believe there has been a growing demand for the privilege on the\npart of listeners to turn on their dials to things of substantial interest and\nworth. Now, we do not mean by that that the listeners whom we represent are all\nof them high brow, that they are all of them looking all of the time for some\nsubstantial information; they like entertainment the same as you and I do, but\nthere are times when their interest is in something deeper and more substantial.\nWe feel that possibly the present programs have underestimated the level of\nAmerica*s interests.\nI was disappointed the other day in hearing a man prominent in the radio\nworld and speaking, I suppose, with some authority, state that in his opinion in\nthe future radio broadcasting in America would become solely entertainment, and\n-2-"
}