{
  "id": "d1079-2",
  "text": "then he added that the entertainment would be at the street level*\nNow, I do not believe that that really is a correct representation of those\ndirecting presentday radio. I think that demeans the American public. The\nAmerican public, all of them, want entertainment, but there are also times when\nthey are interested more deeply and more keenly in things of more substantial\nworth.\nThe National Committee on Education by Radio has persistently during its\nfour years of study sought a solution for America’s problems which would cause the\nleast disturbance to our present system. Men have invested their millions of\ndollars in the present American system and it is doing wonderful things. We are\nappreciative of the splendid things being sent out over the great chains. We\nare appreciative of the services they have rendered. Many of our own educational\ninstitutions broadcast over the commercial stations, and that is fine where it can\nbe done, where the geographical and other conditions warrant it.\nThe Committee has continuously sought for some solution that would give us\nin America the benefits of the public systems and private systems, so, anything\nI say today should not be construed as ill-tempered criticism of the existing\nsystem. We are not giving the criticisms of the existing system from any spirit\nof antagonism. However, in presenting our case'we have to call attention to some\nof the natural and inevitable limitations of the present system.\nThe system which we propose, probably will have its limitations. It is\ndifficult to find any human institution that is one hundred percent perfect.\nThere are some inevitable limitations to the present system; they are ob¬\nvious. It is controled privately; it exists for the purpose of making money for\nits owners (It must if it persists and continues). Its revenue is chiefly de¬\npendent upon advertising; therefore, the advertiser inevitably has the final word\non many things.\nBeing dependent upon income from advertising, it necessarily must seek the\n-3-"
}