{
  "id": "d508-1",
  "text": "KIT MO. 6.- -THREE TNCHES FROM LEARNING (The High School T^r-w\nand the Television Lesson)11\nGENERAL STATEMENT OF THE FILM;\nThis film makes the same statement in general as that made by\nthe film in Kit No* 5. To confront the student with television,\nto see that he receives the television lesson and the message it\nimparts, is simply to bring that message to the threshold of\nlearning. It remains for the student himself, with the skillful\nguidance of his teachers, to move the message across the last three\ndifficult vital inches... from his eye and his ear to his brain_\nwhere learning takes place.\nThis film concerns inself with exemplifying the ways in which\nthe high school teacher may integrate the television lesson into\nthe previous learnings and the ongoing experiences of students\nin order to insure maximum learning, it points out that the\ntelevision segments of any unit of study must be...or be made to be...\nan integral part of that unit...that the students must be aware\nof the relationship of the television segment to the total learning\nsituation...that the classroom teacher must control the use of the\ntllevision segment to create a wholesome, dynamic learning situation.\nWe see the teacher working with a specific group as introduction\nto the large-group viewing of the television lesson to come. This\nis a social studies lesson on WORLD CULTURES. We observe the\ntelevision teacher's presentation (where primary concern is with\nthe elements common to all learners)...see how this large-group\npresentation enables other teachers to improve their approaches\nto individual or special needs and problems for their particular\nstudents...watch the varied approaches designed to follow-through\non the lesson concepts in the light of individual and group dif¬\nferences. ^\nReference is made to differences in secondary school utilizations\nmore student-directed activity; teachers as subject matter special¬\nists, but tending more to consulting and guiding students toward\nresources than to dispensing facts? scheduling problems in high\nTeachers are reminded that however we may improve the instruments\nof learning, learning still takes place...not in the television\nstudio...not on the television screen...but in the minds of the\nboys and girls in the classrooms. THEIR classrooms:"
}