{
  "id": "d508-15",
  "text": "Outline - Film 6: \"Examples from the Secondary School\nPag© 5\nSecond day: Each group had to make presentation of plan to total class.\nClass evaluated plans and best plan received extra credit.\nVI. ILLUSTRATION IN DEPTH (Excerpt from television lesson shown)\nENGLISH class (LITERATURE) 10th grade (Utilization in accelerated group)\nUnit: \"Are Things Really What They Seem?\" (Emphasis on the multilevel approach\nto appreciation)\nTo accept things at their face value frequently is to deprive ourselves of an\nabundance of truth and gratification. Lewis Carroll*s fantasies, Alice in\nWonderland and Through the Looking Glass are used as bases of study (l) to\nillustrate how the process of investigation can enlarge meaning and essence\nin the humanities as well as in science, and (2) to suggest significant\nrelationships among the various areas of human activity which may pass un¬\nnoticed by the superficial student.\nA. EXCERPT: UTTER PART OF TELEVISION LESSON\nHighlights from the personality and pursuits of the Reverend Charles Lutwidge\nDodgson, young Oxford Don and Mathematical Lecturer of Christ Church...\nending with a river picnic (on July 4, 1862) with the three daughters of Oxford\nDean Liddell.. .and the story-telling session in the shadow of a hayrick.. .the\nstory revealed as a continuing narrative destined to become \"Alice in Wonder¬\nland.\" Television teacher has touched on the puzzles and riddles which were\nso much a part of his relationship with Alice Liddell and other children. The\nlesson is left with an open end, with the television teacher raising questions\nabout the story, its nature and essence. Is it just an amusing story for children?\nDoes a mathematician and logician and teacher Him off those areas of his mind\nand self when he is dealing with children? Why would he tell a story\nlike this to three little girls? is it a \"teaching\" story? If so, what is he\ntrying to teach? Why would a logician tell such an illogical story?\nB. PREPARATION: The classroom teacher gives the two fantasies of Lewis Carroll\nas a reading assignment. Portions of the stories are read aloud\nin class. With the whole class the teacher discusses the\nstudents1 reactions to the stories now...there reactions to the\nstories when they were experienced by the students as younger\nchildren. The discussion touches on the levels of appeal...\nthe rhythms and word sounds., .the impact of character and\nscene.. .the outlines of the plot.. .the desire for meaning\nequated with the freedom to fantasize. The class discusses the\nnature of fantasy.. .the meaning of \"logical\" and \"illogical\"\nand the relationship of these concepts to fantasy and to reality.\nThe class discusses differeng approaches to characterization,\nas portraits of individuals, as symbols of groups or ideas."
}