{
  "id": "d1195-9",
  "text": "SATURDAY EVENING\nSECTION MEETINGS\nAll Groups Meet at 8:00 p. m.\nRadio and Adult Education\n8:00 p. m.. Room 218\nChairman: Paul Sheats, Associate Director of Extension, University of California,\nLos Angeles\nTopic: What are the critical needs in adult education today which make extended\nuse of radio imperative? In what ways are these needs now being met by both\ncommercial and educational radio stations? Are there any hopeful leads available\nfrom current experimentation either as to new content or methods of presentation?\nGertrude Broderick, Assistant RadioJEduca^n^SpedaUst^ U^S^CtfB.a_of<E<iusationi\nOrville Hitchcock, Department of Speech, University of Iowa\nH. B. McCarty, Director, Station WHA, University of Wisconsin .\nRalph McDonald, Executive Secretary, Division of Higher Education, National Education\nAssociation (invited) _ „ IT ■\nHerschel W. Nisonger, Director, Bureau of Special and Adult Education, Ohio State Uni-\nJenotncs Pierce, Manager, Public Service and Public Relations, Western Division, National\nBroadcasting Company\nDeveloping Live Programs on Small Stations\n8:00 p. m.. Room 216\nChairman: G. Richard Shafto, General Manager, Station WIS, Columbia, South\nCarolina\nParticipants ..... .\nIrvin G. Abeloff, Manager, Station WLEE, Richmond, Virginia\nWilliam J. Adams, Program Director, Station WHEC, Rochester, New York\nRobert T. Mason, Station WMRN, Marion, Ohio\nHarold Fair, Director, Program Department, National Association of Broadcasters, Wash¬\nington, D. C.\nThe High School Radio Workshop\n‘ L00 p. m.. Room 1212\nChairman: Edwin F. HELMA^J^ordinator of Senior High School Broadcasting,\nleveland Board qL\nRadio Workshop—A Report by Those Who Use Its\nProducts\nThe High School Administrator: Ola B. Hiller, Director of Radio, Pontiac Public Schools;\nand Assistant Principal, Senior High School, Pontiac, Michigan\nThe High School Teacher: Elizabeth Herbert, John Adams High School, Cleveland\nThe High School Pupil: Tom Moody, South High School, Columbus\nThe School Radio Station: Van Rensselear Brokhahne, Production Manager, Station WJNYh,\nNew York City Board of Education . . , .\nThe Commercial Radio Station: Sam Serota, Educational Director, Station WIP, Philadelphia\nEvaluation by Panel"
}