{
  "id": "d556-16",
  "text": "nmmmL associawok of\nSHOT IT IS A8B DOSS\nThe national Association of Fdncat tonal Broadcasters (MEB), organized\nin 19^> i» a aonjarofit organisation. It was incorporated in 1951 onto\ntbs laws of the State of Illinois, as tbs national headquarters was then\nlocated in Urbana, [and bus bean ruled tax exempt by tbs Bureau of Internal\nl^vetroe of tbs Ufctted States Treasury Beparfcasat.\nmis the Traduction and matributiou Division* of HAE8 are still\ncentered in Drfeaaa* tbs national headquarters is strategically located in\ntbs nation's capital In tbs Dupont Circle Building. Use policies of tbs\nAssociation ore determined by the Board of Directors elected by HAEB mem¬\nbers. Membership in the society includes not only the top-rated profession*\nels in tbs field but tbs principal educational Institutions is the country.\nThus, tbs H4EB bes access to tbs best minds is the various disciplines of\nlearning and, in addition* through ©ea&er coamittses working In the fields\nof particular interest to tbs individuals and institutions represented in\nthe Association, is * truly aei&er-based organisation.\nThe IAES is tbs only notional professional society for those engaged\nin educational and Mmasfelsa television and radio, both on-tbc-alr\nand closed-circuit; for those who teach broadcasting in universities and\ncollets; for those who utilise edacmtional broadcasting in the classroom!\nand for those who subscribe to the purposes and lections of the Association\nsuch as institutions* associations and organisations threugxmt the Tteiied\nState© and in several foreign countries.\nto&ership in the mm includes more than 1*000 educators concerned\ndirectly with educational broadcasting, such as staff amafcer* of educational\nstations* production centers and closed-circuit installations^ public ser¬\nvice departments of cosoiercial stations and networks; professional people\nteaching or using educational broadcasting! m& educators developing and\napplying educational broadcasting techniques. It also includes Individuals\nand organisations associated in other ways with educational broadcasting;\n176 educational institutions and organisations which own and operate 2S7\nradio and TV stations; 125 educational institutions which act as production\ncenters* regularly producing educational programs independently or over\ncosraereial outlets* or operating closed-circuit TT InstaHatlcms; 68 educa-\nt local Institutions or public service organisations interested in promot¬\ning educational broadcasting; and 10 industry associates* representing\nfinas engaged in the manufacture or sale of broadcast and auxiliary equip¬\nment and which desire to further the scope and quality of educational\nbroadcasting.\nThe Association serves its members usd the field of educational\nbroadcasting through workshops, semlimrs* regional and national conferences;\nlegal, management and engineering services; sad throng publications in\nthe radio m& television feilds* Including a monthly newsletter, a Wash¬\nington Bcport md a bimonthly journal supplemented vitw aSSSSn Fact facets."
}