{
  "id": "d556-2",
  "text": "mamxm rnmmrnL maw m> mansion mro\nBackground\ntom mx tfltctlW9^ of any society be achieved without two\nkinds of IsvestMent—l^vestaent In htsaatn resources- ns veil m investamnt In\nthe development ®f material resources. Both must be concurrently developed*\neach Is dependent upon the other. This means that educational opportimities\nmost he provided that will liable people everywhere to develop their capac¬\nities to their highest capability.\nSadie and television, which can teach more to mere people in less time\nthen any devices ever developed, provide the optimum technological means of\nachieving the Increased e**! * ^>twww»tl «bA vocational strides\nacross a broad case of population so vital in the forward progress of a\ndeveloping society.\nIn a country such as Migeria, where the percentage of illiteracy is hi#\nsad the rese«*c*s available for Its reduction limited, traditional methods and\ntechniques of instruction are inadequate to the pressing needs. Consequently\nradio and television have been recognised as a means of making major progress\nin the provision of learning opportunities.\nthe plan here proposed, builds upon the important beginnings already\nmade' im the use Of electronic media for education in Algeria, and proposes\nto significantly increase the effectiveness of existing efforts in radio-\ntelevision education through a cooperative pooling and sharing of local\nresources, supported by AID, and coordinated by the KABB.\nSuch a project, we believe, will prove conclusively the usefulness of\nradio and television in improving and accelerating Higerian educational\ndevelopment, but will also provide a demonstration of the break-through of\neducational technology which the whole world, but especially the less-\ndeveloped nations, urgently needs sad mu*&ts.\nApproach\nIbis Is a plan for a project in radio and television education to be\ndeveloped by the Agency for International Development in cooperation with\nthe Government of Algeria. It is designed to capitalise on the beginnings\nalready underway In the use of educational technology in the four regional\ngovernments of the Federation of Nigeria, and, through their cooperation,\nreinforce and share resources in a coordinated and intensified effort to\nimprove and. speed the quality m& extent of Higerian educational develop¬\nment by mmm of radio and television."
}