{
  "id": "d556-7",
  "text": "4\n2. She Educational Jtedio-Selsrvlsion £peci«lirts will be persona\n«a» tmlwti am e®«rt«e«4 to tto field of both radio and television\nbww^attag, wit* particular amtoaln aa the aae of these aadto aa applied\nto formal and eystmative education. SBsaae persons will ham ecMpetanee\nend experience in the various phases «f developing, producing, and recording\nprogrm swterial of a systematic nature for use to tto formal classroom,\nas well as to the hm and other centers, Pomona maimed by the MSB\naa StoeattomO. Sadio-feleviaitKt Advisors will ham am background to\ntaatotoc a«t wUl ha oowMaa* to toto* mrtom m*am af tha Ucariaa\nstaff to radio end television operation and product ion.\n3* fha Graphic Artist assigned to this project rill ha a parson\nexperienced to ell areas of visual out crisis. Ba will to Able to assist\narterially to Arratoptag special staging and background effects that will\nenhance tto wtoaal pvaaeatottoa; to Assign and produce effective visuals\naad graphics to eonjunetton with television jwodaettoaj and to assist to\nthe erttoltotamt of standards tor elides aad photograph* that esa to\neffactively used to educational television production.\n4. But Educational aadio-®Jlevisien ArltamPxodacer will to\ntoairaUy an educator, tot trained md eaperiasced to rnmatotog specific\neotowa content for radio aad television jweoertrtioiis. Ba will to aWloetod\n«n the toads af his understanding af the media, and on the basis of hto\n“ tetwtoadtog of the touehtos-laamtog processes aa related to too asdto.\n5* She Consultant to aeaaamh aad Evaluation will to mpericawed\n**&ta<m±mmAlm a^| ula^a ^ e*J\nin-school utilization of *adto-tolo*toi«B instruction and of evaluation\nmeh instruction.\n6. She VMcWiisaiww^ specialist watt bo aslantart oa tto\ntoaia of hto background aad experience to tto general field of education,\nwith particular reference to eqperimee to tto training of toaetors rt\nvwrtous school levels to utilise organised television msmtotas to tto\nctoasmep, aad to totegrate sank use tote the total day-to-dgr setoel\nexperience. *\n*•\n1» She four fuU-tla* technical specialists will to assigned to\nthe three region, as outlined to tto BXS prospectus. Howaver, it to under¬\nstood that these specialists will to available to consult with am another\naad la advise with each of tto interested Ktalrtvtos, including tto Ktatotxy\n«f Zaforwrtion, rt meh times and to such matters* as 1toy am called upon.\n®ats, toils each of toe regional gemxnmrt bodies to Blgerto will to pro-\nyjtod with at least me special advisor , wa would aspect to establish *\n*mooxytowrtor*th«**Se\n■ .■*■ ***\n■wmmmmm: * *."
}