{
  "id": "d817-12",
  "text": "bO:\nProm:\nDate:\nSUBJECT\n/4\nAEB Network Acceptance Committe\nG. burrows, Chairman\nMay 3, 1961\nReport on Columbus Meetings\n7\nThe Network Acceptance Committee held two meetings at the\nIERT in Columbus on April 26 and 27» 1961. Present were Mssrs. Giese,\nEfolen, Quayle, Regnell and Burrows; network manager R. Underwood;\nLen Press and Harold Hill.\nThe continuation of SPECIAL OP THE WE?K on an indefinite\nbasis was approved. Conversations with the Voice of America Indicate\nthat they will continue to supply tapes to NAEB,without cost, of Wash¬\nington press conferences, speeches, etc. These will be channeled\nthrough the NAEB Washington office and will, for the present, continue\nto be edited and packaged at WUOM for network use. This can be accom¬\nplished without the presence of a network program director in Washing¬\nton (a capacity in which Len Press has been serving informally),\nthough the addition of such a position to the Washington staff is high¬\nly recommended.\nSince Press will be leaving Washington at the end of May, it\nwas left up to him to determine in the next couple of weeks whether\ncontinuation of the fifteen-minute WASHINGTON REPORT will be feasible\nduring the summer months. The two commentators who have so far appeared\non the programs may not be able to continue without editorial and pro¬\nduction assistance. It Is anticipated, in any ease, that WASHINGTON\nREPORT can be resumed in the fourth quarter and become a regular feature\nof the network offering.\nThose present had not had sufficient opportunity to listen to\nthe SPECIAL OP THE WEEK and WASHINGTON REPORT to judge the merits of\neither or to suggest improvements. It is hoped that all members of the\nAcceptance Committee will listen to these programs and offer construc¬\ntive comments as time goes on.\nThe inauguration of the live educational network on the East\nCoast (ERN) will make possible the distribution of ”hotw news and com¬\nmentary from Washington, New York, etc. In time a link with the mid¬\nwest may provide the opportunity for more stations to receive such pro¬\ngrams. In the meantime, the NAEB tape network will have to rely on\ntimely but not dated programs. The possibility of originating a news\nprogram for NAEB on an East Coast shortwave facility, which could then\nbe carried nationwide, was discussed. Press indicated he would check\non the possibilities. The Voice of America, because of its legal com¬\nmitment to program for overseas audiences, could not originate such a\nprogram for NAEB. However, Its present news and commentary programs\nare available for use by NAEB stations able to pick up their shortwave\nsignal. Information on this and other similar services will be dis¬\ntributed to member stations.\nAt the request of Harold Hill, the Committee discussed a\nproposed revision in the network fee structure. Certain recommendations\nwere made to the Radio Board and the revised plan should be announced\nIn the near future."
}