{
  "id": "d817-13",
  "text": "-2-\nAfter lengthy negotiations by NAEB with the State Department\nto serve as liaison for an exchange of programs with the Soviet Union,\nthe \"contract” was awarded to BFA, for reasons that remain obscure.\nThis official sanction of an exchange does not seem to prohibit NAEB\nfrom obtaining and distributing Russian materials in any way it sees\nfit. The Committee approved of more programs like THE SICKLE AND THE\nSOIL, particularly those packaged v/ith commentary by educational stations\nConversations with John Wiggin of the VOA, relative to further\ncooperation between VOA and NAEB were reported to the Committee. The\nsituation regarding SPECIAL OP THE WEEK has been mentioned above. In\naddition, several program series produced by the VOA will be submitted\nto the Committee for judging on the regular basis. These include:\nPOOD POR THE WORLD, TACTICS OP COMMUNISM, U. S. IN SPACE, MEN IN THE\nWHITE HOUSE, and a series on Africa. Other programs of a one-time or\nparticularly timely nature will be sent direct to Urbana for distribu¬\ntion as specials, e. g. ANATOMY OP A BROKEN PROMISE. Wiggin will at¬\ntempt to expedite the release of such programs and information on them\nto NAEB in the future.\nFuture relations between the Canadian Broadcasting Corporation\nand NAEB were discussed. CBC has tentatively proposed making available\ncertain \"low budget\" productions to NAEB at a cost of $2f>0 per program,\nthe \"step-up\" fee which CBC must pay to Its unions for programs aired\nin the U. S. If this proposal were accepted, stations wanting the\nprograms could pro-rate the oost among themselves. Any decision; on\nthis proposal has been held up pending other developments. Under dis¬\ncussion between EBN and CBC is a plan whereby a limited number of CBC\nprograms would be exchanged for programs produced in this country with¬\nout cost to either organization. Once CBC had released a program to\nERN it would then be available for tape distribution to other NAEB mem¬\nber stations in this country without cost. The Committee agreed any\nsuch arrangement, if carried through, would be to the advantage of all.\nWe will await further word from ERN before advocating purchase of these\nprograms.\nA plan to Inaugurate a LECTURE OP THE WEEK (only a tentative\ntitle) was approved. All NAEB stations will be Invited to select from\ntheir files one-time lectures of particular significance with either\nlocal or nationally-known speakers. These lectures will be screened\nby the committee and as soon as a good backlog is available, distribu¬\ntion will begin. In this way single lectures that are seldom submitted\nto NAEB can be brought into circulation. This proposal will be distri¬\nbuted soon to all members.\nThe network will begin distribution of at least one five-\nminute series this summer. There are several other possible five-minute\nseries being considered, but nothing firm at this date. Programs in the\narea of general science are being prepared and submitted by both WEAR\nand WGBH. The Committee, as always, should be on the lookout for new\nIdeas In this as well as other formats. *"
}