{
  "id": "d817-15",
  "text": "//*/\nt,\nMay 10, 1961\nMr. John Wiggln,\nSpecial Projects Officer,\nVoice of America, tJSIA\n330 Independence Ave SW\nWashington 25, D.C.\nDear John*\nAs chairman of the Network Acceptance Committee of the National\nAssociation of Educational Broadcasters, I know I speak for all NaEB\nmembers as well as my own WUOM in expressing appreciation to the\nVoice of America for their willingness to exchange program materials\nwith the educational stations in this country# I am sure that not only\nwltl educational stations continue to provide materials which can\nbe sent overseas but that the American public will benefit from the\nchance to hear what VGA is Itself doing#\nNAEB has for some time been broadcasting the Forum lectures# We have\ndistributed ANATOMY OF A BROKEN PROMISE and other one-time special\nprograms. We are planning to distribute TACTICS OF COMMUNISM\nbeginning in July# My committee is giving consideration at the moment\nto the FOOD FOR THE WORLD series and will consider, as soon as sample\ntapes are sent, MSN IN THE WHITE HOUSE, THE U.S. IN SPACE, some of\nthe previously recorded programs on African nations and the Mark Twain\nprogram.\nAs I have discussed with you on several occasions, NAEB is interested\nin keeping abreast of what is new on the VOA docket. I hope you will\nbe able to continue sending us Information on such programs as they\nare released# The more timely ones can be given immediate distribution#\nThe less timely series can be held for insertion Into our regular\nnetwork offerings.\nIt Is my understanding that VOA would have no objection to the use of\nits news commentary programs being rebroadcast via shortwave by\neducational stations# If you can send me further information on the\npeople, times, and frequencies, I would like to disseminate this\ninformation among the member ship#'\nYou expressed an Interested at one point in the possible use of the\naudio of a TV show being produced here on Shakespeare# I have a tape\nof one of these programs which I forgot to give you in Ann Arbor# It\nwill be sent along separately for you to listen to and judge#\nIf there is anything that I personally or the NAEB at large can do\nthat will help Implement or Improve the find existing relationship\nwith VOA, don't hesitate to let me know#\nCordially,\nE.G. Burrows"
}