{
  "id": "d1333-10",
  "text": "tapes would be terrific.\nFrom the Floors There was further general discussion of\nthe matter of'clearing network programs for use on a\nsustaining basis by associate members on commercial out¬\nlets. There were suggestions that all new programs sub¬\nmitted to the network be scrutinized immediately for\nclearance* thus to begin building a fund of programs\nwhich associate members could use. It was pointed out\nthat some stations submitting programs, do not them¬\nselves know what parts or elements of the programs are\ncleared or not, so they could hardly be depended upon\nto give assurance to headquarters.\nSkornia: Displayed a large map of the TJ. S. just pre¬\npared by the NAEB Research Committee showing the location\nand coverage patterns of all educational stations in the\ncountry. He noted the rather complete coverage in the\nmidwestem area and contrasted it with the great white\nareas where no NAEB stations are located. He said\ncopies of the map were being mailed to the membership.\nFrom the Floor: A question concerning how the program\nGrant-In-Aid committee functions.\nSkornia: This year there were a total of 32 applications\nfor grants. There was $U0,000 available for granting.\nApplicants turned in proposals, some of them very elaborate,\nbut they all had to fill out a summary sheet giving the\nprogram title, number in the series, length, content,\nwhether the institution had received a previous grant, etc.\nHills Continues- - -The committee met in Chicago having\nfirst had a look at the summary sheets on each proposal.\nSkornia: Some applications were eliminated immediately\nbecause they came from individuals or organizations whose\nobject was not really educational in the sense intended\nby the grants. Next the committee decided to set aside\napplications from organizations which had received a\nprevious grant-in-aid for \"first round\" consideration.\nOthers, upon further consideration, had to be eliminated\nbecause they could not grant all the rights necessary to\nallow future distribution of the programs as NAEB had in¬\ntended it. Some applications included requests for capital\nexpenses and these had to be eliminated fhom their budgets\nbefore considering the rest of the application. After\nthese preliminary steps the committee proceeded to examine\napplications and listen to audition tapes, and then made\nits final decisions on the grants.\n~ 7 -"
}