{
  "id": "d374-114",
  "text": "The Honorable Oren Harris\n2*\nMay l5, mi\nThe need la emphasized by these «lttiXV«Uanit\na* livestock* ft stable industry* could use the channel for recent\ninformation and weather warning**\nb. Learning could be enhanced by regular channeled program* under\ntha University Agriculture Extension Satiric#*\nc* Mining 1* still somewhat dependent upon exploration* Haro tha\nTV could b# used for infomotlon and forums.\nd* Oil prospecting is continuous* Regular foruas could bt esteb-\nlishftd*\n#* Stats and local government officials could readily gat information\nto th® public without tha blaa which sometimes accompanies per¬\ntinent releases through private agencies*\nf. Education in Civil Defense for self-protection in time of natural\ndisaster* military or national emergency could reach all the\nstole*$ citizenry*\nOperation awl responsibility for such educational programs would of ne¬\ncessity be the State education Department*** not necessarily to comply\nwith Sec* 2* Clause (b) (2) of H*R. 965, but because Wyoming Constitution\nand Statutes place the responsibility for education under the State Super¬\nintendent of Public Instruction awl the State Board of Education.\nIf and when B.R* 965 becomes law, Wyoming will establish s state-wide\ncommission representative of industry, agriculture and education with re¬\nsponsibility for progressing and scheduling and encouraging widespread use\nof the facilities.\nIt is our hope that H*8. 965 will be enacted into law. Wyoming is presently\nmoving in a manner designed to make use of such legislation immediately*\nAlready, a state-wide school committee on educational media is active In\nusing such commercial TV as Is available*\nThe results of the present survey on educational needs are being studied*\nPreliminary investigation projects a coat of not less than one-half million\nnor raora than ©no million dollars for putting a state-wld# educational TV\nprogram through both closed circuit and educational channels.\nWyoming*s Council for Educational Media enthusiastically urges the enact¬\nment of H*S. 965*\nVery truly yours.\nJack R. Gage\nGovernor\nVUhs"
}