{
  "id": "d374-119",
  "text": "Issued by Florida Educational Television Commission / Room 112, Knott Bldg. / Tallahassee, Florida\nDecember 2, I960\nFLORIDA IS WAY OUT FRONT !\nOf the 50 ETV stations on the air in the Nation, Florida has five of them -- more\nthan any other state. (See list, addresses, Page 3).\nWhen Floridars fifth ETV station -- WFSU-TV, Channel 11, Tallahassee -- went\non the air Sept. 19, I960, it coincidentally became the 50th ETV station in the country.\nSTATE NETWORK\nFlorida's five stations are linked in a State network by means of the production\nand exchange of video tape-recorded courses and programs. The Commission has found\nthat for current purposes the video tape network is not only the most economical method\nof transmission, but also provides flexibility for local curriculum planning and scheduling.\nFROM KINDERGARTEN TO ADULT EDUCATION - -AT HOME\nThe range of courses being broadcast runs from programs for pre-school age chil¬\ndren in their homes, through elementary, secondary and junior college in-classroom\ninstruction, to university level, adult education courses and general information and cul¬\ntural programs.\nAn estimated 300, 000 students are receiving some instruction or enrichment pro¬\ngrams via educational television. The total of such \"TV students\" has approximately\ndoubled in each of the last two years, and it appears that this rate of increase will con¬\ntinue if necessary broadcasting and receiving facilities are made available.\nUniversities and junior colleges are working out procedures by which regular col¬\nlege credits can be earned at home by taking courses by TV.\nWHAT HAS ETV DONE? WHAT CAN IT DO?\n1. MAINTAINING QUALITY INSTRUCTION, in spite of mounting enrollment pressures\nand problems, has been -- and is -- the primary aim of the Commission and the many\nclassroom teachers and administrators who are so earnestly working with us, but --\n2. ETV HAS ALSO SAVED MILLIONS OF DOLLARS in terms of doing many essential\ntasks at substantially less than traditional methods cost.\nSupt. Joe Hall of Dade County says that ETV, used with the \"extended day\"\nschedule, has eliminated the need for approximately $4 million worth of new\nclassroom construction. Some school plants are handling up to 30% more\nstudents than they were constructed for -- because ETV makes fuller use of\nauditoriums, gymnasia, cafetoriums, choral rooms, band rooms and other\nlarge, high-cost space with limited use heretofore.\nSupt. Hall also says ETV has made possible a more efficient and economical"
}