{
  "id": "d374-4",
  "text": "2\nIn February of 1953, the first Governor's Advisory Committee on Educational\nTelevision met under the co-chairmanship of Dr. John Bartky of Stanford Uni¬\nversity and Mr. William Joyce of Pasadena. Throughout the year it continued to\nmeet, gathering information and advising fledgling community organizations, and\nby November it had prepared its recommendations for Governor Warren (see Appen¬\ndix A). In February of the following year it resubmitted these recommendations\nto his successor, Governor Knight, with the added recommendation that the committee\nbe kept in existence another year in order to complete its work. Governor Knight\ndid not act to continue the committee and it went out of existence early in 1954.\nIn the meantime, on November 1, 1953, the first educational channel in Cali¬\nfornia (and the second in the nation) began broadcasting in Los Angeles under\nthe stewardship of the Alan Hancock Foundation of the University of Southern\nCalifornia. The distinction of being first in the State was too soon offset by\nanother, less happy, distinction: it was the first and only educational tele¬\nvision station in the nation to leave the air permanently. The reasons for its\nfailure had little to do with the nature of educational television. Broad¬\ncasting upon an ultra high frequency channel (Channel 28) in an area thoroughly\nsaturated with seven standard band commercial television stations, it was unable\nto attract enough audience to justify its operating expenses. The reason for\nthe small audience may be found in the need for each viewer to invest an addi¬\ntional thirty or more dollars in receiving equipment in order to receive what\nwas, in the Los Angeles area, an eighth channel.\nIn the northern part of the State two community organizations which had been\nformed in the Bay Area and in San Jose, merged in 1952 to form the Bay Area\nEducational Television Association, and by the summer of 1954 had established\nKQED (Channel 9) as one of the pioneers and subsequent leaders in the educa¬\ntional television movement. Similar organizations in Sacramento and Stockton,"
}