{
  "id": "d374-70",
  "text": "OREGON STATE SYSTEM OF HIGHER EDUCATION\nGENERAL EXTENSION DIVISION\nOffice of the Dean\n1633 Southwest Park Avenue\nP. O. Box 1491\nPortland 7, Oregon\nApril 21, 1961\nHem* Gren Harris, Chairman\nCommittee on Interstate and\nF oreign Commerce\nHouse of Representatives\nRoom 1334» House Ottice Bldg.\nWashington* D. C.\nDear Chairman Harris:\nGovernor Hatfield requested me to reply to your letter of inquiry as to the\nextent to which Oregon is prepared to participate in a cooperative federal-\nstate program to promote educational television operation.\nEducational television in Oregon is administered by the State Board of Higher\nEducation through its General Extension Division. Two VHF educational\nstations* KOAC-TV, Corvallis and KOAP-TV, Portland, are linked by\nmicrowave to form the Oregon Educational Network. Programs for the net¬\nwork originate in Eugene, Corvallis, Salem and Portland. Approximately\n70% of the population of the state lies within the service area of the two\nstations.\nV hen federal funds become available * steps will be taken to extend the\nbenefits of educational television to the more sparsely populated areas of\ncentral, southern and eastern Oregon. To achieve such coverage, power\nof the existing stations would be increased and the use of translators and\nboosters would be investigated. It is likely that one or more additional\nVHF stations would be constructed.\nThe interest of Oregon's public and private schools in the use of both broad¬\ncast and closed circuit television is increasing. It is possible that several\nof the larger districts will require VHF stations to serve increasing demands\nwithin the school service area.\nThe State Board of Higher Education, licensee of the ETV stations in Oregon*\nis the agency responsible for the development of plans for the utilization of\nET V funds in the state. The Chancellor of the State System will convene\na meeting of responsible representatives of education at all levels to devise\na plan for the coordinated utilization of funds for the development of educa¬\ntional television in Oregon."
}