{
  "id": "d1207-1",
  "text": "2,\nto bo supplied gratis to cooperating stations* Federal funds night be found\nsince this is properly a phase of adult education. Private philanthropy vri.ll\nprobably be hard to find at present*\n\"2. A governing board to outline policies and direct operations* This\nmight well be the National Committee on Education by Radio, or the College\nBroadcast Association itself* If the control is left to a federal commission\nalready created the movement will tend to become too political in its tone and\nobjectives for use in a university station which represents all the people*\nThis Trould be especially true in the northern states*\nn3* The establishment of a central office in Washington equipped for the\nmaking of master records and duplicates. This office should be in charge of a\nman who is familiar with the technique of broadcasting and who also could make\neffective contacts with government officials and with scientists and organise and\ncarry forward the program as outlined by the Board. Portable equipment should be\nprovided for making records at university centers and other points outside of\nWashington. Estimated cost, salary $3000 plus $500 travelling expense, with\nsecretaiy and mailing clerk at $900 and office rent at $600, Cost of material,\npostage, etc. to be borne by cooperating stations.\n\"I recently recommended the purchase of recording equipment by the TVA as\nthey have no funds available for operating a transmitter at present but might\nreach a large audience through radio stations which should be glad to obtain the\nmaterial they have to offer, I have gone into the whole problem of recording\nsomewhat carefully and will be glad to assist you in any way possible. Let me\nknow what progress you make.\"\nFrom C. A. TAYLOR, NEW YORK STATE COLLEGES OF /AGRICULTURE AND HOME ECONOMICS:\nWI an much interested in your circular of July 20, relative to electrical\ntranscriptions of government activities for radio broadcast. I am afraid I\nhave no definite suggestions to make as to the material required. We could\nuse such transcriptions frequently on our station at Cornell University, and\nwould be glad to have then. I think the transcriptions should be dramatized in\nsome way and be natters of general interest, and tell the story of the wonderful\nreconstruction work that is ©Ding on in this country under Federal direction.\nWe would not be interested in such transcriptions if they were piopogandist\nspeeches. We have plenty of speeches and plenty of propoganda already available\nthrough other sources.\n\"If I can be of further help along the lines of your circular, please let\nme know.\"\nFrom GARLAND POWELL, THE UNIVERSITY OF FLORIDA:\n\"Your nemorandun cf July 20 regarding the use of electrical transcriptions\nby governmental agencies for broadcasting purposes at hand,\n\"After going over this bulletin I con readily see that most of these depart¬\nment heads must be informed in some way as to the usefulness of such an idea*\nLite most department heads, they have little comprehension of the value of sel¬\nling their activities to the people, and the people have little idea of what their\nactivities are, if any* 1*11 venture to soy that one in a hundred people knows\nwhat the Department of Commerce does or what constitutes the Department of Interior\nand its many activities. The American people are woefully ignorant of the func¬\ntions of govexnront. I believe that in presenting propositions of this nature\nto the various branches of government you will have to be very exacting in the\ninformation you desire and the tine they should take up, namely, 14 minutes each\nperiod. For instance, take the Bureau of Foreign and Domestic Commerce, people\nwould be interested in what they are doing and hov; they are doing it, but little\ninterested in a lot of dry facts and figures* The Bureau of Standards has enough\nscientific matters that come under them to give a thousand broadcasts of 14\nminutes each, and very interesting ones, too* Then take your independent officers"
}