{
  "id": "d1207-4",
  "text": "4,\namount of material was available. Thus, it could bo scheduled regularly and\nwould please a consistent audience of interested listeners.\n\"Two other things occur to me. First, that it will be very important in\nview of the bittor fight which will doubtless nark elections for the next few\nyears, that this material be entirely free from propaganda* You know as well\nas I how sensitive sone of our local politicians are to anything which nay re-\nnotely suggest hostile propaganda’. Second, if the recording is to be of\nreasonably high quality it would add greatly to the program if sone nusic were\nincluded. I would suggest that the service bends - Marine - Amy and Navy\nwould furnish very suitable nusic for the opening and closing for these recoi'dod\npro grans.\n\"I expect Griffith to be back in the office by the first of September and\nwhen he arrives I rill see that your letter gets his innodiato attention. Moan-\nwhile if there is anything I can do', do not hesitate to call upon no.\"\nAdditional letters fron various departments of the federal government received\nsince our last bulletin was released to nenbers are as follows;\nFron A, L. FLINT, CHIEF OF OFFICE, THE PLIAMA CANAL, WASHINGTON OFFICE:\n\"The following is a copy of a letter dated July 5, 1954^ recently received\nby this office fron the Secretary of the Interior:\n♦Prof. T. M. Beaird, Executive Secretary of the Association of\nCollege and University Broadcasting Stations, has written the Con-\nnissioner of Education of this Department that the 38 college and uni¬\nversity broadcasting stations throughout the country are very much\ninterested in broadcasting transcriptions of activities and achievements\nwithin the Federal Governnent. This proposal seems to have considerable\nnerit since, if accepted, it would undoubtedly lead not only to a better\nunderstanding between the various Government offices and the colleges\nbut also night become an important means of diffusing governmental infor¬\nmation of general public interest.\n’If your office is interested in making such information available\nto these broadcasting stations, kindly corxiunicate with Professor Boaird\nfor further details. His address is the University of Oklahoma, Noman,\nOklahoma.1\n\"The above quoted corxiunication was brought to the attention of the Governor\nof The Panama Canal and a letter dated July 18th has just been received from him\nstating that he would be interested in receiving further information concerning\nthe broadcasts mentioned.\n\"It would accordingly be appreciated if you would furnish this office, in\nduplicate if practicable, with further details regarding the broadcasting proposal\nreferred to in the letter from the Secretary of the Interior.\"\nFrom WILLIAM STANLEY, THE ASSISTANT TO THE ATTORNEY GENERAL, DEPARTMENT OF JUSTICE:\n\"The Secretary of the Interior has informed the Attorney General of your\nproposal to have the Association of College and University Broadcasting Stations\nbroadcast governmental information of general public interest. The Attorney\nGeneral has requested me to inform you that you my expect the full cooperation\nof this department*\n\"Will you kindLy give me your ideas as to the exact manner in which the in¬\nformation furnished by this Department will be disseminated? The choice of\nspeakers and the length of time which you my bo able to allot will, in a large\nmeasure, dictate our preparation of suitable data.\n\"May I take this occasion to thank you for your kind offer, and express ny\nappreciation of its worth,\""
}