{
  "id": "d1865-0",
  "text": "A MESSAGE FROM THE NATIONAL COMMITTEE ON EDUCATION BY RADIO*\nThe services which the National Committee on Education by Radio renders to\neducational broadcasting are too well known by the members of this audience to need\nmuch elaboration. When the Committee was formed in December 1930 it enumerated\nthose services in its bylaws.\nOne activity which has been extremely important to the members of this group\nis the maintenance of a service bureau \"to assist educational stations in securing\nlicenses and in other technical procedures.\" For several years the Committee has\nemployed an attorney and placed him at the disposal of the members of the National\nAssociation of Educational Broadcasters. He is paid a retainer of $S0O a month.\nThe lack of sufficient financial support will make it impossible for the Committee\nto provide this service beyond the present year. It might be desirable for the\nmembers of your organization to consider means by which sufficient funds could be\nraised to continue the services of Mr. Lohnes or to secure those of some other\nattorney well qualified in the practise of radio law.\nA second function of the Committee has been the exchange of information thru\nits own publications and thru those secured from other sources. The periodical,\nEducation by Radio, which reaches each of you regularly, is now in its fifth year.\nReactions received by the Committee from leaders in educational and civic affairs\nboth in this and in other countries have been convincing as to the influence which\nthis publication has exerted. Other publications of the Committee, such as An\nAppraisal of Radio Broadcasting in the Land-Grant Colleges and State Universities\nand Radio as a Cultural Agency have been in great demand by libraries, colleges,\nresearch workers, and students of public affairs.\n* An address by Dr. Tracy F. Tyler, secretary and research director of the National\nCommittee on Education by Radio, before the Annual Convention of thfi^a-tAanal As¬\nsociation of Educational Broadcasters, Iowa City, Iowa, Septemh"
}