{
  "id": "d1865-16",
  "text": "H0w can America make the best use of instantaneous, universal communi¬\ncation? That is what interests this conference of educational broadcasters.\nThat is what concerns the listeners on nineteen million receiving\nsets. In ancient story Al^adin rubbed a magic lamp^ ar^i powerful spirits fulfilled\nhis every wish. Today radio is a more wonderfulcommanding the spirits of\nA\nthe air. H0w shall we use it? For what shall we wish? We have enslaved nature’s\ngiant, what shall we make him do? It is my privilege tonight to present a plan\nfor assuring for America the best possible use of this new marvel. Before pre¬\nsenting the plan, let us ask ourselves what we wish broadcasting to be and do.\nFirst, /f^radio broadcasting—^this great new agency--^Should be so\nguided and controlled as to insure to this nation the greatest possible social\nvalues. The social welfare of the nation should be the conscious, decisive, * —\nprimary objective, not merely a possible by-product incidental to the greatest\nnet returns to advertisers and broadcasters.\nSecond, x. wholesome needs and desires of listeners should govern\nthe character, the content, and the relative extent and frequency of broadcast\nprograms. Variety sufficient to satisfy the tastes of all groups of effective\nsize should be provided. Material detrimental to the welfare of listener groups\nshould be eliminated, regardless of commercial profit.\nThe listener pays all the bills. The nineteen million receiving\"sets\n\\ A b\nin listeners* homes are over percent of the entire radio investment.\nNew\nsets and supplies cost the American listeners #500,000,000last year alone.\n*/\nj\nThere are no vested,: rights which supersede, the listener’s.\nC/Third, yKesponsible groups, even tho^h minorities, should not be de- i ^ ^\n' ^ JL / /\nbarred from broadca sting privileges because of their relative size, for radio\nis but the amplification and extension of the individual’s free speech and dis- j ^‘ •*\n&\ncussion."
}