{
  "id": "d1865-17",
  "text": "-5-\nFreedom of the press has been maintained in America as the fulfillment\nof freedom, of thought and speech. The telephone, the telegraph, and the mail\nare open to all citizens. In so far as radio1s limited resources will permit,\nfreedom of speechon the air must be assured.\nFourth, f)positive, wholesome broadcasts for youth at home and in schools\nshould be provided. The impressionable, defenseless minds of children and youth\nmust be protected against insidious, degenerative influences.\nRadio must lend it s magic to the service of the schools. Thirty\nmillion of America's youth in schools must enjoy the stimulus of broadcasting\nin music, in drama, in science, in history, in all that will improve instruction.\nRadio must enter the schools, but how can it if advertising must pay the costs?\ne best .America produces of culture, of entertainment, of\nFifth,\nA vi ’P/-v*r»Tnci4* A -P c?+ Ci 4- nr>ci *P4- cV>o 1 1 Vi otro o no avi 4- Vic» o 4 *r* otro A 1 o V\\1 cs 4- r\\ oil 4* Vies\ngovernment of, for>and by the people. Discussion of live,\nDiscussion of live, controversial issues\nof general public concern should be encouraged for the safe and efficient func¬\ntioning of a democracy and should not be denied a hearing because offensive to\npowerful advertisers or other groups.\nBroadcasting must not become merely a means of partisan propaganda.\nCriticism as well as commendation must be allowed on the air. All sides of\nimportant questions should be presented to the listeners. Broadcasting should\nbe used freely for public business and public welfare.\nSeventh, £ Broadcasting must never be permitted to become a monopoly\nof any organization or corporation, private or governmental. The inevitable\ncensorship is too dangerous to democratic institutions. Monopoly of the air\nwould be as menacing as a monopoly of the press. Freedom of the press is as¬\nsured by a multiplicity of independent publishers. It is inconceivable that\nthere could be freedom of the press with only two chains of newspapers permitted."
}