{
  "id": "d1865-20",
  "text": "-6-\ning to young and old, literate and illiterate alike. There is no other means\nof communication which reaches all the people. The press cannot combat false\nstatements, dangerous propaganda, because there is no newspaper or periodical with\nuniversal circulation. Even if all radio listeners were subscribers to the\nsame newspapers, not all listeners would be readers. The only safeguard against\ndangerous broadcasting is counter-broadcasting. The press can never catch up\nwith a broadcast lie. Counter-broadcasting, equal in scope, is the only safe¬\nguard against the menace of false propagandizing broadcasts. £\nHow would such a system of public broadcasting be controlled? The\nplan provides for a series of public boards, state, regional, and national,\neach exercising authority and direction within its own special province. The\nplan provides that these boards be as carefully selected as are judges, and\nthat the members of these boards be leaders in public welfare, in realms of\neducation, religion, medicine, agriculture, labor, music, drama, and in the\ndominant fields of American culture. There is no reason why we cannot secure\n' the public broadcasts as we\nas reliable, impartial and wise administrators\notour jjlfips and\nA\ndolour\n* K\nThe term of office of the members of these\nboards would be staggered so that a minority only i$tas se-le-etetl at any one time.\nThis would prevent sudden seizure of control^ by changes in party government,\neither state or national.\nThe plan provides that local public broadcasting stations shall be\nassured of the right of affiliation with the public chain. The plan does not\npropose that the right of hook-up should not be extended to commercial stations,\nbut the plan does provide that aidn^rofit) public stations shall be assured\nof this privilege. You directors of educational broadcasting know how valuable\nit would be to you in your program making to have the privilege of national\nhoo £2ip, It would enrich your programs, increase your audiences, and multiply\niiw.,\nyour usefulness. It would make available to your programs the best pro-\n4\nduces in entertainment, information^ and statecraft. The National Committee on"
}