{
  "id": "d1865-21",
  "text": "-7-\nEducation by Radio has seen a steady elimination of educatiorr stations, and\niorf^a\nthe creation of a monopoly of private broadcasting, until today non-profit\npublic welfare stations share less than ts^a percent of the radio channels.\nNinety-eight percent of America’s broadcasting is commercial. One of the weapons-? ^\n■v\nused in crowding out public broadcasting stations was the privilege of hook-up\nwith national chains. The plan proposes that this privilege shall be forever v ■>\nassured to the non-profit public stations. 4\nThe plan proposes that there shall be a strong program of research to\nimprove broadcasting technic^, to ascertain public desires, to measure listen-\ners* response. Such a program of research would naturally include cooperative f \\\nexperimentation and its sole objective would be to promote public welfare thrpug^ :\n4 k\n\\ radio. * ^ 4 -\nAnother feature proposed is a broadcasting service assured to public\nstations but not denied to any station. This service would make and distribute ^\nrecordings of notable broadcasts. Already the industry is making large use of\nelectrical transcriptions. A public service bureau might soon create great 4 * j\nlibraries of notable and valuable broadcasts for use by local stations at times''1-\nwhen hook-ups were impossible. Particularly would such a library of recordings-^ j.\nbe valuable in public school broadcasting service. Such a service provided on *\n**\na national scale could readily become self-supporting without iMjajpjgim: expense?\nto the local stations\n\\\nI0u now ask,how can such a system be established? There are many^ays '\nin which beginnings could be made of such a governmental system. The government\ncould construct and maintain a few -u&A stations, or the program could be pre- -*<5 ■%\n1 jw rn 1 m j, ’\\f'v\n. 1\nsented without expensive construction by bi^ying 4p time Mi 'existing\nor by combination of government-owned stations and rented facilities. A govern¬\nment broadcasting program to the a\nz!c~c. c\n\"\\y\ncamps could easily be inaugurated and\nwould be justified by the service to these six hundred thousand asftroll^Ts."
}