{
  "id": "d1865-5",
  "text": "with which we are all familiar and to ?/hich most of us frequently take violent ex¬\nception, In a signed letter which I received a few days ago, a member of the\nCommission made the following statement in referring to those in control of the\nperiodical:\n\"These fellows have thoroly discredited themselves by their tac¬\ntics and their unfairness, as well as their selfishness. If, however,\nthey continue to persist in an attack that is detrimental to the inter¬\nests of radio and intelligent broadcasting, it is quite possible that\na Congressional investigation may be necessary in order to cure the\nsituation,\"\nFor some time educators have realized how important it would be were a study\nto be made of school broadcasting not only in the United States but in the prin¬\ncipal European countries, especially Great Britain. Experiments in the use of\nradio to supplement the work of the classroom teacher have been carried on for a\nsufficient number of years to make it possible now to evaluate the results. As I\nmentioned earlier in my remarks, one of the functions of the National Committee\non Education by Radio is to encourage and participate in research in education by\nradio* When the General Education Board decided to make available the funds nec¬\nessary and invited your speaker to make this study, it fitted in nicely with the\naims of the Committee, In order to collect the data necessary to carry on this\nstudy, your speaker will be absent for several months from his regular duties*\nHowever, services of the Committee will continue as heretofore under the direction\nof my efficient secretary. In this work she will have available the guidance\nand counsel of the members of the Committee, as well as of Mr, Morgan, and Mr*\nPerry.\nIn prosecuting a study of the effectiveness of presenting by radio, materi¬\nals which supplement the classroom work in elementary and secondary schools, I\nshould like to have all of the assistance which each of you can give me* Many"
}