{
  "id": "d1605-3",
  "text": "Denver Bar Association. The station’s The\nGlory Trail, produced for NET, won an\naward from the American Association for\nState and Local History.\nINSTRUCTION\n^ The South Carolina ETV network re¬\nports that over 12,000 students successful¬\nly completed the course, If Disaster Strikes,\nduring the first semester. Twice the air\ntime is available for the medical self-help\nseries during the second semester.\ny WBGO-FM, Newark, is the only out¬\nlet in the East for Chevron School Broad¬\ncast, a half-hour weekly radio concert with\ncommentary produced for classroom use,\nby the Chevron Oil Company. The series\nis broadcast over more than 120 stations\nand reaches 3 million children in over 8,-\n500 schools—mostly in the western states.\n^ St. Petersburg Junior College is using\nits CCTV facilities to present dental post¬\ngraduate courses in cooperation with the\nregional dental association.\n^ The new studio at the Teaching Re¬\nsources Center of the University of Dela¬\nware at Newark will produce two major\ninstruction projects this spring for distribu¬\ntion via the three-channel Delaware ETV\nnetwork. One is an in-service program for\nteachers, a mathematics background course\nfor understanding the current approach in\nelementary school. The other is to acquaint\ncounselors, students, and parents with cur¬\nrent Selective Service requirements and\nwith military career programs open to high\nschool graduates. Other projects include: a\nseries of briefings for the Wilmington Po¬\nlice Department by city officials and uni¬\nversity psychologists and sociologists, the\nuse of videotape machinery in speech lab¬\noratories, and storage of special lectures\nby distinguished faculty members.\n^ In the teacher preparation program at\nthe University of Texas, junior students\nare observing actual classroom instruction\nin two Austin public schools through\nCCTV. Following the TV, the students dis¬\ncuss what they have seen, with the guid¬\nance of their professor.\n^ At St. Petersburg Junior College, Les¬\nlie Smith and Earl Kohler recently com¬\npleted a series on the national government.\nSince such courses undergo constant re¬\nvision, they would like to have anyone\nknowing of films and film catalogs in the\narea of national government and state and\nlocal government send information to:\nProf. Earl F. Kohler, Department of So¬\ncial Sciences, St. Petersburg Junior Col¬\nlege, P.O. Box 13489, St. Petersburg, Fla.\n33733.\n^ Indiana University’s radio-TV service\nnow provides about fifty hours of CCTV\ncourse instruction per week to the Bloom¬\nington, Indianapolis, and Purdue campuses.\n“This is about twice as much,” says James\nPerry, CCTV supervisor, “to about three\ntimes as many students as we’ve done in\nthe past.” He said there has been a very\nsharp increase in the Indianapolis enroll¬\nment.\n^ Nighttime programing began for the\nfirst time on KYNE-TV, Omaha, on Janu¬\nary 31, and one of the programs broadcast\nin the evenings is an instructional program\nin modern mathematics, directed toward par¬\nents. A unique feature is that utilization\ncenters are open to the public in schools,\nwhere adults can watch the program and\nreceive instruction from a professional\nmath teacher.\n^ Elementary schools in the Austin-San\nAntonio area are in the fourth year of\nSpanish instruction by TV, and students\nwho are now in junior high school classes\nof traditional Spanish instruction “definitely\nshow superior ability with Spanish,” says\nTom Ditzel, ITV coordinator for KLRN-\nTV. Preliminary studies indicate that stu¬\ndents who have a TV experience show no¬\nticeable superiority in conversational skills\nand pronunciation. KLRN uses only native\nSpanish speakers so that pupils hear cor¬\nrect pronunciation.\nThe Georgia ETV network telecast live\nfor school youngsters a recent address to\nthe state legislature by the governor. This\nwas the first time permission was given to\ntelecast the joint session. The program began\nten minutes before the address, with histo¬\nrical references to the capitol.\nGENERAL\n^ WNYE-TV, New York, expects to be\nready for broadcasting sometime in mid-\nApril, wihen construction of a new tower\nand transmitter is completed on the roof\nof Brooklyn Technical High School. The\nproduction center is producing and stock- /'“N\npiling programs now for use then.\n^ KLPR-TV, Oklahoma City, is sched¬\nuled to go on the air about March 1. The\nUHF will serve 80,000 square miles with\nan effective radiated power in excess of\n1,000 kw.\n^ San Antonio College (Tex.) has ap¬\nplied to the FCC for an FM station li¬\ncense.\n^ Educational Services, Inc., is setting up\na studio in Watertown, Mass., to produce\nfilms and videotapes for use in training\nteachers. WGBH, Boston, is cooperating.\n^ WBGU-TV, Bowling Green State Uni¬\nversity, moved into new studios in a differ¬\nent building recently.\n^ During 1966 KWSC-TV, Washington\nState University, hopes to expand its pro¬\ngram service to several other points in the\nstate by microwave relay. The project will\ncost $100,000.\ny Construction is expected to begin this\nspring on two new stations for the Nebras¬\nka ETV network—Channel 9 at North\nPlatte and Channel 13 at Alliance.\n^ New Georgia ETV stations have set\nprograming target dates: July 30 for\nWCES-TV, Wrens, and September for\nWCLP-TV, Chatsworth. W S J K - T V,\nSneedville, Tennessee, expects to begin tests\nin June.\nPLACEMENT\nPOSITIONS AVAILABLE\n{For information, write Miss Yasmine Mirza, Placement Service, at\nthe NAEB in Washington. In order to be considered through these\nchannels, the reader must be an Individual Member of the NAEB,\nwith credentials on file with the NAEB Placement Service. Non-mem¬\nbers can save time by sending the $10 annual dues and $10 Place¬\nment registration fee at the time of inquiry.)\nMar I Television studio assistant. Camera operation, lighting, etc. Excellent oppor¬\ntunity for recent radio-TV graduate looking for experience: chance for fu¬\nture advancement to producer/director. Immediate opening. Salary $5000-\n$5500.\nMar 2 Assistant professor qualifying in radio-TV area for major Midwest university. In¬\nvolves supervision and teaching in dramatic and nondramatic writing, radio\nand TV production, etc., in both graduate and undergraduate levels. Ph.D.\nrequired plus college-level teaching experience. $9,500-$ 10,500 plus 10%\nof base pay for half-time summer load.\nMar 3 Creative graphic artist for well-known corporation in large eastern city. Ex¬\nperience in creating instructional materials for TV, motion pictures, filmstrips\nand slides. Salary commensurate with ability. Excellent benefits. Interviewing\nand relocation expenses reimbursed.\nMar 4 Television engineer with three years experience and first-class commercial\nphone license: television technicians preferably with one year experience and\nfirst-class commercial phone license. Openings in ETV office of important\nsouthwestern university. Salary dependent on experience and references.\nMar 5 Assistant professor for Big Ten university. Responsibility for basic production\ncourses in TV-film as well as graduate research required. Interest in creative\nexperience with video and cinematic media desirable. Ph.D. required. Open\nSeptember 1966. $8400, negotiable depending upon background.\nMar 6 Assistant professor of radio-TV. Dual responsibility of teaching beginning and\nadvanced TV production and TV producer-director for east central univer¬\nsity. Research and writing in radio-TV-film required. $8,000 initial salary (ne¬\ngotiable on experience) for 10 months. Advanced degree required, with\nPh.D. or partial preferred but not mandatory. Open September 1966.\nMar 7 Immediate: Need chief engineer. Should have administrative as well as tech¬\nnical competency. Going to full power and complete color in new building\nfacility scheduled for completion 1967. Excellent state benefits, working con¬\nditions, and location.\n4\nNEWSLETTER"
}