{
  "id": "d1197-14",
  "text": "Page 3\nHeuer, Josephine C., Teacher, AER, St. Louis, Mo. Deshler lj+71\nHines, Jean M., Teacher of Radio, Pontiac Pub. Schls.,Pontiac 19,Mich. Deshler 17o7\nHinshaw, Frederick Moore, News Director, WLBC, Muncie, Ind. Chittenden 213\nHitchcock, Orville A., Teacher, State Univ. of Iowa, Iowa City, Iowa Deshler 1201\nHoly, Thomas C., Dir., Bur. of Ed. Pea, OSU, Columbus, Ohio\nHuffman, Margaret E., (Student) OSU Radio Speech, Columbus, Ohio\nl^iftfll, Richard B., Dir. WOI, Iowa State College, Ames, Iowa Deshler\nHunter, Rollin C., Professor of Speech, Ohio Wesleyan Univ., Delaware, Ohio\nWtfermings, George, Dir., Radio Council WBEZ, Chicago 1, Ill.\nJohnson, Arnold C., Farm Dir., WIBC, Indianapolis, Ind.\nJohnson, A. Maxine, (Student), Columbus, Ohio\nJohnson, David E., Prog. Dir., WCAL, Northfield, Minn.\nDeshler\nChittenden 438\nDeshler 1376\nKaczaniier, Paul, (Student) Wayne University, Detroit 6, Mich.\nKamins, Robert W., Grad. Student Mich. State College, East Lansing,\nKarl, Max, Pub. Serv. Director, WTCN, Minneapolis 4, Minn\nKaufman, Edwin L., (Student) OSU, Columbus, Ohio\nKellner, Lee B., (Student) OSU, Columbus, Ohio\nKern, Elizabeth M., Account Executive, WING, Dayton 9, Ohio\nKerns, J. Robert, Mgr. Dir., WHIZ, Zanesville, Ohio\nKlock, Mrs. Dorothy L., WNYE, Brooklyn 1, N.Y.\nKrulevitch, Walter K., Prog. Sup. WHA, Madison, Wis.\nFort Hayes\nDeshler 724\nDeshler 1248\nDeshler 963\nDeshler 1173\nDeshler\nLa Monte, Marcelle M., Coordinator, General Mills, Inc., Minneapolis Deshler 558\n\\ldf£u, Kathleen N., Supervisor Radio, Detroit Pub. Schools, Detroit 6 Deshler 952\nLarson, Jack M. (Student), OSU, Columbus 1, Ohio\nLattimer, M. David, OSU, Columbus 1, Ohio\nLattimer, David W., Asst. Program Dir. WOSU, Columbus 1, Ohio\nLaudin, Iuella S., Co-Chr. Gen. Fed. of Women's Club3, N.Y. 22, N.Y. Deshler 945\nLeatherman, Gladys Teacher, Springfield Sr. H.S., Springfield, Ohio Deshler 1127\nLennox, Wanda M., Wayne University Radio Guild, Prest 27, Mich Fort Hayes 322\nLindley, Laura, B. (Student) Workshop at Denison, Indianapolis, Ind. Deshler\nLinton, David, Program Mgr., Interc. Broadcasting System, New York 17 Fort Hayes 724\nList, Edith C., Teacher, N.'J. State T.C., Newark, N.J. Deshler 147 +\nLofbuck, Wm. J., News Dir., WSAM, Saginaw, Mich. Deshler 547\nLohrenz, Iris C., (Student) Stephens College, Chicago 15, Ill. Deshler 9oo\nMacandrew, James F., Coordinator of Brdctg.,WNYE, Brooklyn 1, N.Y. Deshler 1848\nMoDougall, R. Harold, Co. Agt., Penn State College, State College, Pa.Neil House 157\nMcCarty, Harold B., Dir., WHA -FM, U. of Wisconsin, Madison 6, Wis. Deshler\nMcCue/D. Jeanne, (Student), Columbus, Ohio (OSU)\nMcGinnis, Edith M., Ex. Secy., History Club of N.Y., Bronx 6, N.Y. Deshler 069\nMcGune, PaulW., Commentator WBNS, Columbus, Ohio\nMackey, David R., Staff, Northwestern Univ., Evanston, Ill.\nMaddy, Joseph E., Prof., Univ. of Mich., Ann Arbor, Mich.\nMagee, Mrs, Walter, Advisory Radio Council of Gr. Cleve., Lakewood 7\nMarshall, Eliz. E., Prog. Dir., WBEZ, Chicago 1, Ill.\nMartin, Arthur L., Prog. Consultant, WING-WIZE, Dayton 2, Ohio\nMatchett, Katharine E., Dir. West. Tech. H.S., Cleveland 2, Ohio\nMaxwell, Jessica, Dir. of Prod., Robt. Maxwell Associates, N.Y. City ly\nu^lCrrill, Irving R., Dir. KOSO, Vermillion, S. Dakota.\nDeshler 1177\nDeshler 334\nDeshler 1252\nDeshler 1450\nDeshler 747\nDeshler\nDeshler 307"
}