{
  "id": "d1197-15",
  "text": "page 4\nMerritt, Warren (Student) OSU, Columbus, Ohio\nMichael, Carr, Asst. Dir., Laurence Hammond Prod., N.Y.City Deshler\nMiniace, Dorothy E., Instruc. in Radio, State Teachers College, Milwaukee N.H. 112\nMoreland, Edna, Asst. Treas, WHKC, Columbus, Ohio\nMorehead, H.P., (Student) OSU, Columbus 1, Ohio\nMorehead, Martha, Visitor\nMorris, Emmet, Dir., Audio-Vis.Ed., Bd.of Edu., Maywood, Ill.\n-Munkhof, Loren H., Dir. of News, WOW, Creighton Univ., Omaha, Neb. Neil House 638\nMurch, James D., Treasurer, Natl. Religious Broadcasters, Inc., Cinti. N.H. 619\nMurphy, Florence M,, Radio Dir., WCCO, Minneapolis 8, Minn. Deshler 1048\n%ers, Lawrence, Jr., Instr., Radio Workshop, Syracuse, N.Y.\nNeher, Jack, Associate, Natl. Mental Health Foundation, Phila.. Pa. Deshler 1563\nNelson, Harold E., (Student) State U. of Iowa, Iowa City, Iowa Fort Hayes 502\nNeusbaum, Frank, Pa. State College, State College, Pa. Deshler 1849\nNunmaker, Frances G., Publicist, 0.3. Library, Columbus 15* Ohio\nO'Hair, Kay A., (Student) Stephens College, Columbia, Mo. Deshler 1557\nOliver, Jr., GuyE., (Student) Northwestern University, Chicago 40, Ill. Deshler97I\nOrr, C. Richard, Prof. Radio Denison University, Granville, Ohio Fort Hayes\nPatty, Margaret E. (Stud ent) OSU, Columbus 1, Ohio\nPaugh, Richard L., (Student) OSU, Columbus, Ohio\nPeatman, John Gray, Assoc. Dean, City College of N.Y., New York 31\nPetrie, Daniel M., (Student) Northwestern Univ., Evanston, Ill.\nPfeiffer, Robert A., Radio News WMT, Cedar Rapids, Iowa.\nPierce, Jennings, Mgr. Pub. Ser. NBC, Hollywood, Calif.\nPike, Ann F. (Student) OSU, Columbus, Ohio\nPygman, Clarence H., Supt. of Schools, Maywood, Ill.\nDeshler\nDeshler 971\nDeshler 1046\nDeshler 1054\nDeshler 7^1\nRalls, Margariete, Natl. Fed. Women's Club, Columbus, Ohio\nRead, Hadley, Ext. Editor, U. Of Ill., Urbana, Ill. Deshler 507\nRhodes, Marilyn G. (Student) Univer. of Wisconisn, Madison, Wis. Deshler\nRice, Miss Allis L., Script Writer WBOE, Cleveland 14, Ohio Deshler 737\nRitter, Paul J., Chr. AVA, State Teachers’ College, Montclair, N.J. Chittenden 439\nRobbins, Buren C., Dir. Speech-Radio, Union College, Schenectady, N.Y.\nRoberts, John B., Instr. in Radio, Temple University, Philadelphia 22, Pa. \" 422\nRoby, Howard J., (Student) OSU, Columbus, Ohio\nRoss, Julie, Kent State University (Student), Kent, Ohio Deshler\nRothenbush, Harold P., Contractor, Columbus, Ohio\nRothenbush, Verona F., Teacher J.H.S., Columbus, Ohio\nRowland, Ruth, Pittsburgh, Pa.\nScerback, Clem, (Student) Kent State University, Kent, Ohio\nSchaal, Wilbert, Editor, Va. Agr. Exp. Station, Blacksburg, Va. Deshler 877\nScheetz, Mrs. J. Paul, Radio Comm. - Jr. League of Pittsburgh, Pa. Deshler 450\nSchimmel, Robert C.,- Radio Coordinator, Boston Pub. Schools, Boston, Mass.\nSchweer, Caroline G., Co-Chr. Radio Prog., University School, Columbus, Ohio.\nSchweer, Ronnie, (Student), University School, Columbus, Ohio\nSellers, Philip L., Asst. Co. Farm Agt., Butler, Pa. Neil House 157\nShafts, G. Richard, Gen. Mgr., WIS, Columbia, S.C.\nSheats, Helen T., U.C.H.A., Santa Monica, California Deshler 950\nWheats, Toni H. Assoc. Dir., U. Of Calif. Ext., Los Angeles 24, Cal. Deshler 950"
}