{
  "id": "d1197-5",
  "text": "page 6\nSkornia, Harry J., Radio Director, Indiana University, Bloomington, Ind.\nSmith, Pauline, Pub. Relations Dir., Comm. Chest of Cols. & Fr. Co., Columbus 15-\nSmith, William C., Radio Director, Natl. Council of Cath. Men, Washington 5* D.C.\nSollenberger, Mrs. Mildred, Mary Washington College, Fredericksburg, Va.\n^^Somerville, Mary, BBC London, Br. Broadcasting Corp., New York 20, N.Y.\n^Sparks, Hale S., Radio Administrator, Univ, of California, Berkeley 4, Calif.\n2 ' Sparaokling, Helen (Mrs.), Dir., Women's Div., Licensed Bev. Industries, N.Y. 17*\nv^pearman, Paul, D.P., 4825 Woodway lane, N.W.> Washington 16, D. C.\nStahl, Myrtle,E., Dir. of Edu. Programs, WGN, Chicago, Ill.\nStark, Louis M., Mgr., School Service Dept., Westinghouse El. Corn., Pittsburgh 50\nStauffer, E. S., Teacher, South High School, Columbus, Ohio.\nSteetle, Ralph W., Dir. of Radio, WISU, Louisiana State Univ., Baton Rouge, La.\nStelling, Jack H., Promotion Manager, WKZO, Kalamazoo, Mich.\nStepp, T. Ellsworth,v‘ Head, Dept. Radio Production, Univ. of Colorado, Boulder,Cola\nStevens, Elizabeth C., Continuity Ed., Univ. of Mich., Ann Arbor, Mich.\nStickles, Buddy, South High School Student, Columbus, Ohio.\nStrau^ Helen S., Dir., Edu. Programs, WMCA, New York City, N.Y.\nSt^r, Stanley I., Natl. Dir. of Pub. Relations, New York 16, N.Y.\nJJwnmers, Harrison B., Ohio State University, Columbus 10, Ohio.\nSummers, Leda P., Il8l West First Ave., Columbus 8, Ohio.\nSwisher, Mrs. .Jiark H., Natl. Comm. Member, U.Council of Church Women, Cols., 8,0.\nTacey, William S., Prof, of Public Speaking, Univ. of Pittsburgh, Pittsburgh 15,Pa\nTarr, W. Fletcher, Prof, of Speech & Dir. of Radio, Wash. Missionary College,\n^ Takoma Park 12, D. C.\n2 ^Thpmas, Marjorie M., Instruc. in Radio, Northwestern Univ., Evanston, Ill.\nThompson, Dan H., Dir. of Radio, Natl. Safety Council, Chicago 6, Ill.\nThompson, Margaret (Mrs.), Am. Red Cross, Dayton 2, Ohio.\nTinnea., John W., Asst. Sta. Director, KWK, St. Louis, 8, Mo.\nTompkins, Roy R., Dir., Edu. Sxtension,Okla. A & M College, Stillwater, Okla.\nTraum, Wm. R., Bus. Mgr., America's Town Meeting, Town Hall, Inc., N.Y, l8, N.Y.\nTraviesas, Herminio, Salesman NBC Radio Recording Division, New York City.\nTunick, Irve, Scriptwriter, 118-16 80th Rd., Kew Gardens, N.Y,\nTunick, Mrs. Irve, 118-16 80th Rd., Kew Gardens, N.Y.\nTyler, Dr. Tracy F., Assoc, Prof, of Edu. and Ed. AER Journal, U. of Minnesota,\nMinneapolis 14, Minn.\nVandagrift, Carl W., Program Manager, W0W0, Ft. Wayne 2, Ind.\nViuas, George, Information Spec., U.S. Forest Ser., Dept, of Agr., Washington, D.C\nVogel, PhilT Program Director, WGKR, Box 2909, Charleston, W. Va.\nWagner, Cyril, Radio Dept., The Billboard Magazine, Chicago 1, Ill.\nWaller, Judith C., Dir., Public Service, Cen. Div., Natl. Broadc. Co., Chicago 54.\nWatson, Brooks, Dir. Public Affairs, WMBD, Peoria, Ill.\nWebster, Edward F., Representative, Oxford University Press, N.Y. 11, N.Y.\nWebster, Jeanette, 722 N. Nelson H,, Columbus 5, Ohio.\nWeglein, David E., Public Services, WBAL, Baltimore 1, Md.\n^Wei-tao, Tu, Director, Ministry of Edu,, Rep. of China, Nanking, China.\niJfgTla, Betty, Director of Women's Activities, KRNT, Des Moines, Iowa.\nWenger, Galen L., Speech Instructor, Elkhart H.S., Elkhart, Ind.\nJosephine B., Dir. of Edu., WLS, Chicago 7, Ill.\niWTute, Robert B., Dir., Agr. & Pub. Ser., Central Div., Am. Brdc. Co., Chicago 6.\nWhitsey, Edna A., Asst. Sup. of Music, Bd. of Edu., Cleveland 14, Ohio.\nWilliams, Roswell C., Moderator, Radio & Telev. Guild, Creighton Univ., Omaha, Neb\nWilson, Maryland W., Dir. of Radio Service, Alabama College, Montevallo, Ala."
}