{
  "id": "d1197-7",
  "text": "REGISTRATIONS\nfor the\nSEVENTEENTH INSTITUTE FOR EDUCATION BY RADIO - 19^7\n(Friday, May 2)\nBarnes, Hale, Chr. Radio Dept., Stephens College, Columbia, Mo. Deshler 1360\nAllen, Jean, Student, South High School, Columbus, Ohio\nArn, Alice, Student, South High School, Columbus, Ohio\nAusmua,'Graydon, Dir. Radio Brdctg, Univer. of Alabama, University, Ala Deshler 1219\nDeshler 1660\nDeshler 502\nDeshler\nDeshler\n840\n447\nBalecock, Gertrude G., Teacher, Bd. of Ed., Detroit 6, Mich.\nBailey, J. (Bill) N., Ex. Dir. FM Assn,, Washington 5* D.C.\nBaird, Donald G., Asst. Ed. Dir. KYW, Philadelphia, Pa.\nBarker, Frank S., Dir. Comm. Ser. Bureau, Columbus 2, Ohio\nBarry, Kenn R., Prog. Dir. WUOM, Minneapolis 14, Minn.\nBattles, Roy, Farm Program Dir. WIW, Cincinnati, Ohio\nBeard, Carlynne, Student, South High School, Columbus, Ohio\nBeardsley, T. Isabel, Asst. Pub. Health Ed., Dept, of Health, Albany, N.Y.\nBearup, Thomas Wm., Overseas Rep., Australian Br. Comm., Sydney, Australia Deshler\nBeck, Jan, Student, South High School, Columbus,\nBelth, Norton, Asst. Dir., Jewish Ed. Comm, of N.Y., New York, N.Y. Deshler\nBerlinger, Harry, Student, OSU, 104l Lilley Ave., Columbus, Ohio\nFeinstein, Jack D., 427 Reinhard Ave., Cols., Ohio (Student OSU)\nBerube, Armand, Dir. French Farm Broadcasts, Can.Brdc. Corp.,Montreal Neil Hourse305\nBilsborough, Mary Lou, French Dept., Stephens College, Columbia, Mo. Deshler\nBittmann, Madeline, Ed. Aids Editor, D.C. Heath & Co., Boston 16, Mass.Deshler\nBlack, John W., Prof, of Speech, Kenyon College, Gambier, Ohio\nBlackwell, Dorothy, Asst. Dir. of Audio-Vis.Ed., St. Louis, Mo.\nBlauhut, Don D., Student OSU, 1943 Waldeck Ave., Columbus, Ohio\nBouaird, Kathryn F. Mrs., Radio Asst. Phila. Pub.Schools, Phila., Pa.\nBoyer, Dick, Student, South High School\nBoyer, Martha M., Asst. Prof., Lindenwood College, St. Charles, Mo.\nBrady, Kathryn M., Continuity Writer, WLS, Chicago 7j Ill*\nBriggs, John W., Registrar-Sec'y., Scottish Rite Temple, Des Moines 9\nV^roderick, Gertrude G., Radio Ed. Spec., U.S. Of. of Ed., Wash., D.C.\nBrofee, Linwood H., Agr. Dir., WCSH, Portland 3> Me.\nBrown, Winsor W., Morning News Ed., WMBD, Peoria 2, Ill.\nBurton, Cecile, Chr. Speech Dept., Junior College, N.C., Mo.\nDeshler IO56\nDeshler 929\nDeshler 1858\nDeshler 1460\nDeshler 966\nDeshler 848\nDeshler 1275\nCarlson, Floyd E., As3 0. Prof, of Forest Ext., Syracuse Univ., N.Y.\nCarnes, Gerald L., Liaison Officer of UNESCO, Lake Success, N.Y.\nCarter, Kenneth, Columbia University, New Haven, Conn.\nCastle, Ruth, Teacher of Radio, Bd. of Ed., Kansas City 2, Mo.\nChapman, Alvah L., Div. Bur. Res.in Ed. by Radio, U. of Texas, Austin\nChapman, James P., Dir. of Agr. WTAM, Cleveland l4, Ohio\nChase, K. T., Rural Ed., New York, N.Y.\nChristiansen, Kenneth A., Radio Dept., Stephens College, Columbia, Mo,\nChristensen, Raymond P., U. of Minn. Radio Guild, Minnesota\nCitron, Samuel J., Dir., School Dramatics Dept., Jewish Ed. Comm.of N,\nConnolly, Frank A., Inf. Spec., USDA, Philadelphia 7> la*\nDeshler 432\nChittenden\n.Deshler\nDeshler 344\nDeshler 8o4\nDeshler 620\nDeshler 751\nDeshler 840\nY. Deshler\nDeshler"
}