{
  "id": "d1911-3",
  "text": "NETWORK NEWS\n—Bob Underwood\nThere are a couple of matters which need some at¬\ntention from network members. The first is a double-\nbarrelled matter: your orders for the first quarter,\n1959, and for the 1959-1960 in-school offering. Orders\ncoming in on time really help our schedule which is\nset up well in advance and depends upon the coopera¬\ntion of all member stations. Generally, if your order\nis late we can honor it without delay from the extras\nwe run for each dubbing. However, you always run\nthe risk of our being out of extras; when that happens\nyou must pay for the extra dubbing ($2.00 per reel),\nand you go on our extra work list. Inclusion on this\nlist inevitably means a delay in your getting your pro¬\ngrams.\nIn other words, we’re trying to make it rough on\nthose who order late. Your cooperation in this par¬\nticular field is quite necessary, and’, frankly, we\nhaven’t heard too many valid excuses for late orders.\nTo help yourself as well as us, please order on time.\nIf your order for the current offering is not in yet,\nplease attend to it today because you are late!\nSecondly, will you please give careful attention to\nthe packing of tapes being returned to us? We have\nbegun to lose tapes in the mail due to the boxes com¬\ning open. Please remember that if your tape return\nshipment is lost in the mail (a rare happening unless\nthe box opens) you are responsible for the tapes lost.\nWe cannot give tape return credit for lost tapes. We\nassume the responsibility if tapes are lost coming to\nyou, and we hold you responsible for getting the tapes\nback to us. Please be careful and bind the box\nsecurely.\nElsewhere in this issue there is an article about\na proposed tape exchange between educational in¬\nstitutions here and abroad. While this program is\nopen to all educational institutions, I feel it is or\nshould be of particular interest to network members\nsince they have full recording facilities available. I\nurge you to give this proposal your consideration and\nto inquire around your institution to determine what\ndepartments would be willing to participate in such\nan exchange. I look forward to hearing from you\nabout this.\nWith the coming of the new year we here will be\ntaking stock of things and, as a result, will be send¬\ning out some memos regarding several aspects of the\nnetwork operations. These memos will contain infor¬\nmation which every station staff should have well\ndigested. Please retain this information for future\nreference.\nMay we again remind non-network members that\nwe have some series available for educational use,\nand we will, upon request, be happy to forward de¬\ntails on acquisition and use of these series. Also,\nnetwork members may wish to program some of our\nmore successful past series. Several of these, too, are\navailable under our usual terms. Please write for\ndetails.\nLastly, we of the network staff extended to all\nNAEB members and friends our best wishes for the\ncoming holiday season and good luck in the coming\nyear.\nETV WINS OVER OTHER\nTEACHING METHODS IN TEST\nETV won out over “old-fashioned” teaching methods\nin the first scientific test of results, held in Detroit,\nMichigan. The victory was clear-cut, with proof that\nTV cuts down tardiness, absenteeism and bad be¬\nhavior, and with TV also bringing better progress in\nlearning. The report on the experiment was made\nto the Detroit Board of Education by Dr. Robert S.\nLanston of its Department of Instructional Research.\nAbout 3500 pupils in three elementary, three\njunior high and three senior high schools were en¬\nrolled in TV courses; a “control” group was selected\nfrom comparable students who were instructed in the\nusual manner. All were tested both before and after\nthe TV courses. The experiment continued for a\nyear. All TV classes improved over the “control”\nclasses, Lanston reported,.\nHe cited classes in American literature, 8th grade\nscience, elementary science, world history, in all of\nwhich educational television was the victor.\nNEW IDEAS . . .\nAn excellent idea has been relayed to Headquarters,\nand we are now passing it on to you. If you can use\nit, it would make an interesting program. It is soon\nto be adopted by KING in Seattle.\nIt is an on-the-air program in which a group of\ncitizens—different ones each week—meet with some\nof the station management and talk about the sta¬\ntion’s programs and program policy. Viewers and\nlisteners can ask why the station does this or that\nor why it does not do something else. This sort of\nprogram has many advantages. First of all, you can\nmake your audience feel more a part of the station\nin this way. Not only can those who participate feel\nthis way but, by inviting letters from other viewers\nand listeners to be answered on the air, everyone in\nthe audience can be made to feel a vital part of the\nstation. Secondly, this gives management a chance\nto state its point of view and to clear up many little-\nunderstood factors in broadcasting - especially educa¬\ntional broadcasting. Also, by selecting opinion\nleaders in the community to participate on some of\n4\nNEWSLETTER"
}