{
  "id": "d1911-4",
  "text": "the programs, additional interest in and audience for\nthe station can be developed. And, in addition to\nall of this, the station management might even learn\nsomething from this informal sort of discussion with\nmembers of the audience.\nFREQUENCY MODULATION\nBROADCASTING IN INDIANA\n(.A summary of a 'preliminary report by Elmer G.\nSulzer, Chairman of the Department of Radio-TV\nof Indiana University, and Jean C. Halterman, As¬\nsociate Professor of Marketing, Indiana University\nSchool of Business.)\nThis study is based on the results of a survey by\nmailed questionnaires and personal visitations among\nall 14 of the existing Indiana FM s t a-\ntions. The study presents a summary of the thoughts,\npractices and proposed plans of the managers of these\nstations, in the hope that such experiences may serve\nas a guide for other Indiana broadcasters taking a\ncloser look at FM.\nA chapter is also devoted to a discussion of some\nof the interesting possibilities for FM’s future develop¬\nment in the state. FM has returned in popularity\nfor a number of reasons. Among them are the in¬\ncreased interest in high-fidelity musical reproduction,\ninterest in stereophonic programs, and the desire of\nminority groups for more “upper level” programming.\nIn general, the programming of commercial FM\nbroadcast stations in Indiana parallels the program¬\nming of AM stations, with the FM operation help¬\nful in extending coverage beyond the AM signal area,\nextending the hours of the broadcast day beyond local\nsunset, and providing an opportunity for broadcast\nof certain educational programs and special events\nnot otherwise covered by AM.\nTo serve the FM homes of the state, broadcasters\nare providing a variety of programming materials\nthat ranges from classroom educational presentation\nto popular “rock and roll” music. Yet a balanced\nprogramming is available on FM channels, and the\nlistener has perhaps an even wider choice of programs\nthan on competing media. FM stations are able to\nprovide wide-range sound reproduction, too, with\nvirtually no static. And recent developments aid FM\nstations in moving toward stereophonic broadcasts.\nThe profitability of FM broadcasting will depend\non the ability of the stations to raise rates or increase\nthe number of sponsors concurrent with the increases\nin audience size. And the expansion of audience size\nmust come either from more listeners or from more\nlistening hours per day per listener, both of which\nseem definite prospects.\nDIRECTORY CHANGES\nP. 5\nDelete:\nAdd:\nP. 7\nDelete:\nP. 8\nDelete:\nAdd:\nP. 10\nDelete:\nAdd:\nP. I I\nDelete:\nAdd:\nDelete:\nAdd:\nDelete:\nAdd:\nP. 22\nAdd:\n98 Associate Members\n63 Affiliate Members\n320 Individual Members\nRadio - FM Only 92\nDue to operation.construction per¬\nmits for, 182 stations.\n(under WTUN)\nW. Ernest Vincent\nJohn von Szeliski\n(under Indiana)\nWYSN (FM), New Castle\n(under WBKY)\nMrs. Camille Halyard, Director\nLeonard Press, Acting Director\n(under WMCR-)\nWade S. Jones\nRobert Dye\n(under KUOM)\nBurton Paulu, Director\nSheldon Goldstein, Acting Director\n(under WKNO-TV)\nHarold Martin\nErnest C. Ball\n(under KUH'F)\nRoy Barthold, Acting Director\nJohn Meaney, Director\n(under Indiana)\nNew Castle-Henry Township High School\n(New Castle)\nMiss Juanita J. Rucker, Director\nNew Castle, Indiana\nPhone—374\nETV SHOWS INCREASE\nIN PROGRAM QUALITY\nAn increase in the quality of programming—both in\ntechnical production competence and in the realiza¬\ntion of educational objectives—is the most note¬\nworthy trend in educational television throughout the\ncountry. This was the opinion of Prof. Edward\nStasheff, of the University of Michigan Department\nof Speech, who spoke at the annual Michigan Speech\nAssociation meeting held November 7.\nStasheff based his views on visits to 16 ETV sta¬\ntions and production centers in the Midwest and oc¬\ncasional trips to Boston and New York last year.\nDuring that time, he was on leave from the Univer¬\nsity as program associate for the ETRC.\n“The great majority of ETV stations which I\nvisited revealed a considerable rise in ability to put\nprograms on the air which either matched or often\nsurpassed local programs originated by nearby com¬\nmercial stations. Associated with this development\nhas been a small but significant movement of people\nfrom the commercial stations, even on the network\nlevel, into the ranks of educational broadcasting,” he\nsaid.\nDECEMBER 1958\n5"
}