{
  "id": "d1911-6",
  "text": "POT POURRI\nThe 9th annual (1959) edition of the Children’s\nReading Service Audio-Visual Catalog has just come\noff the press. This revised and up-to-date edition,\nedited by Warren S. Freeman, presents approxi¬\nmately 1000 carefully chosen phonograph records\nand filmstrips from many manufacturers. All the\nteaching aids listed in the catalog may be secured at\nthe best school prices from the central ordering ser¬\nvice of the Children’s Reading Service Audio-Visual\nDepartment. Copies of this new catalog are available\nfree to teachers, librarians, principals or superinten¬\ndents, if requested on official letterheads—otherwise\n25c in coin or stamps.\n—N A E B—\nCollege Teaching by Television, the report of a\nconference sponsored jointly by the American Coun¬\ncil on Education and Pennsylvania State University,\nwas published in October by the Council. This vol¬\nume brings together the varied and sometimes con¬\nflicting experiences of teachers who have used broad¬\ncast or closed-circuit television for instructional pur¬\nposes. The papers and discussions reported cover a\nrange of opinion of faculty and research experts in\nappraising televised instruction, examining its broader\nimplications, and suggesting improvements for the\nfuture.\nExperts discuss such questions as—How does in¬\nstructional television compare with conventional\nmethods of teaching? What are its advantages and\nlimitations? How have students and teachers in\ngeneral responded to its use in academic centers?\nWhat research has been done, and what does it re¬\nveal? Where has televised instruction been tried,\nfor what courses, and with what results? What prin¬\nciples and conditions of learning are involved in the\neffort to improve televised instruction? What are\nsome of the significant concepts of educational tele¬\nvision? What relation do they bear to our cultural\npatterns and educational philosophy as a whole?\nCopies of the book are being sent to heads of in¬\nstitutional members and the secretaries of constituent\nmembers of the Council. Additional copies of this 233\npage volume may be obtained from the Publications\nDivision of the Council at $4.00. The address is\n1785 Massachusetts Ave., Washington 6, D. C.\n—N A E B—\nVoluntary Listener Sponsorship, written by the\nlate Lewis Hill, has been published by the Pacifica\nFoundation (Berkeley, California) under the spon¬\nsorship of the Fund for Adult Education. The book\nis available in either hardbound or paperbound by\napplication to KPFA-FM (Berkeley) at no cost to\nthe recipient. Requests may be addressed to Harold\nWinkler, President, KPFA, 2207 Shattuck Ave.,\nBerkeley 4, California. The supply is limited, so\nplease request copies only if you have a serious in¬\nterest in the subject.\n—N A E B—\nFive new publications of the ETRC are now avail¬\nable through the Center.\nEducational Television Today, a twenty-three\npage booklet, describes the growth and scope of ETV.\nIt explains in some detail the Center’s program\nservice, and the type of programming which is avail¬\nable through National Educational Television. A final\nsection is devoted to the obtaining and distribution\nof N.E.T. programs.\nA revised edition of National Educational Tele¬\nvision Programs For Your Community on Extended\nServices has been prepared and covers N.E.T. pro¬\ngramming available for commercial stations through\nDecember of 1959.\nResearch Report, No. 581, a 1958 Educational\nTelevision Program Survey, has been prepared by the\nstaff of ETRC. The purpose of the survey was to\nmeasure the growth and identify changes in ETV\nprogramming during the year. It covers the stations\nbroadcasting during the week of April 13-19.\nThe ETRC is also preparing a brochure on\n“Heritage”, the WQED continuing program series\nwhich presents conversations with prominent people\nof our times. This is a six-panel, two-color, self\nmailer, designed to acquaint the viewer with the\n“Heritage” programs.\nTo promote “Children Growing”, a N.E.T. of¬\nfering produced by WTTW, Chicago, the ETRC has\nprepared a brochure. The publication features\nSchulz’s “Peanuts” cartoons, which are also used as\nillustrative material on the programs,\n—N A E B—\nA report entitled Closed Circuit Television In¬\nstallations in Educational Institutions has been pre¬\npared by the Joint Council on Educational Television\nand the Committee on Television of the American\nCouncil on Education.\nThe report is dated July, 1958, and gives informa¬\ntion on 133 closed circuit systems used by 119 edu¬\ncational institutions. Class instruction over these\nsystems ranges from first grade through college post¬\ngraduate. There is also a report on military closed\ncircuit installations.\nSingle copies are available free through the JCET\nto educational personnel. Bulk and business orders\nare 30 cents per copy.\n—N A E B—\nThe Readers’ Library Association, Inc. in the\nPhilippines has sent in a request for books. Once be-\nDECEMBER 1958\n7"
}