{
  "id": "d1911-7",
  "text": "fore NAEB members helped them. If any one would\nlike to donate books to the library, the Asia Founda¬\ntion has agreed to collect and forward all pro¬\nvided. The only requirements are that the books be\nin good condition, published after 1945, and are works\nof standard authors. You may contact Mr. Carlton\nLowenberg, The Asia Foundation, 550 Kearny St.,\nSan Francisco, advising him how many and when he\nmay expect them. Your support will be greatly ap¬\npreciated.\n—N A E B—\nAnother request for information has been received\nat Headquarters. Are there any stations which offer\ncourses in business or commercial law? This request\nhas come from the American Bar Association. They\nwould appreciate it very much if you would write and\ntell them what law courses are being offered on your\neducational station. The person to contact is Mr.\nJames M. Spiro, Director of Activities, American Bar\nAssociation, 1155 East Sixtieth Street, Chicago 37,\nIllinois. If you could, please send a copy of your\nletter to Headquarters, so that a list of references can\nbe compiled. Thank you for your cooperation.\n—N A E B—\nNobel Prize winner Glenn Seaborg says combin¬\ning the advantages of television with increased leisure\ntime may enable Americans to catch up with the de¬\nmands of the age. Seaborg, University of California\nchancellor, said that through TV “more than 90 per¬\ncent of American homes can become centers for the\ncontinuance of intellectual development.\nIn an address prepared for a luncheon of business\nleaders at KQED (San Francisco), Seaborg remarked\nthat TV has not been used as widely as it should.\nBelieving that TV can educate more people with less\nteachers, Seaborg added that TV instruction has been\nproved as effective as conventional methods.\n—N A E B—\nThe first effort at forming a statewide FM radio\nnetwork was a success. A joint project of the Indiana\nBroadcasters Association and the Indiana University\nRadio and Television Service, the FM network pro¬\nvided statewide coverage for the Indiana Sports Net¬\nwork football broadcasts during the past football sea¬\nson, and is being used to send the basketball broad¬\ncasts to virtually all of Indiana this winter.\n“The success of the network is largely due to the\nfine co-operation of the state’s broadcasters,” said\nElmer G. Sulzer, Chairman of the Indiana University\nDepartment of Radio and Television, and of the\nIBA’s FM committee. He explained that fourteen\nstations in the state got together to relay the sports\nbroadcasts originating from WFIU. About a dozen\nAM stations have also picked up the broadcasts from\nthe nearest FM station and re-broadcast them on\nAM frequencies. More stations are expected to carry\nthe basketball schedule. He added that the network\nmay have uses other than the relaying of sports\nbroadcasts around the state.\n—N A E B—\nNEWS OF MEMBERS\nGENERAL\ny The academic year 1957-1958 marked the twenty-\nfourth consecutive year of broadcasting of Indiana\nState Teachers College over radio station WBOW,\none of the longest records of educational service over\na commercial radio station for any college or uni¬\nversity in the United States.\ny WTVS, Detroit, recently celebrated its third an¬\nniversary as an educational television station in\nMichigan. Our congratulations and best wishes are\nout to all connected with WTVS.\n^ The Georgia State Board of Education has filed\nan application with the FCC for permission to con¬\nstruct an ETV station which will utilize Channel\nNine in Savannah, Georgia.\nPROGRAMS . ...\n} The University of Alabama is transmitting tele¬\nvision and FM simulcasts on a number of live pro¬\ngrams. In some instances special radio programs are\nbeing designed to supplement the telecasts.\nOne of the new programs being offered on Ala¬\nbama television is a large-scale series entitled “World\nHome.” It is a live production which takes the\nviewers on tours of homes of people around the\nworld, exhibiting their customs and culture and ex¬\nplaining their way of life.\ny Closed circuit takes the limelight with 120\nChemistry labs being taught this year at the Univer¬\nsity of Texas.\n“Science Close-Up”, a 26-program series of half-\nhour kines, is being prepared in cooperation with the\nPhysics, Chemistry, Astronomy and Biology fac¬\nulties and the staff of the Defense Research Lab¬\noratory. The first program, “Space Flight,” sets the\npace for an exciting series. It will be distributed by\nRadio/Television to Texas TV stations.\nAnother production of the film crew is a major\neffort showing blind people working in Texas in¬\ndustry. It is produced in cooperation with the State\nCommission for the Blind.\n^ Each Monday, Wednesday, and Friday morning\nat 11 o’clock North Carolina elementary school\nchildren have a “Rendez-vous en Francais” with Mrs.\nMarian Walter on Channel 4 (WUNC-TV, Chapel\nHill). Mrs. Walter is teaching French in a novel\nway - without reading, writing or translation. From\nthe first day of television class she has spoken only\nFrench, and with the help of impromptu chalk\ndrawings and songs, and two little puppets, Jean\nand Marie, who also speak only French, she teaches\nNEWSLETTER"
}