{
  "id": "d1743-3",
  "text": "- 4 -\n! EDITORIAL\n! j\nI STRAWS IN THE WIND j\nI\nThe storm warnings are upl j\ni\nEchoes emanating from a recent radio conclave indicate that the 1\nbarometer is falling fast. Broadcasters9 flushed with the strength of ;\nbusiness success, are ready to demand that they be freed from virtually j\nall governmental program review9 and that the Federal Communications\nCommission become merely a traffic policeman for the technical aspects\nof radio.\nIn the hysteria of the occasion, this doubtless sounded good to\nopportunists who refuse to tone down the cash register clatter for the\nsweeter music of programs truly in the public interest. To the critical j\nobservers who recalls that the air lanes are public property used license™ j\nfree through the grace of the people, the broadcasters' new defiant\nattitude is a warning. One is reminded of the words of Spencers\n\"It is a dark sign when the owner is seen growing poor,\nand his steward is found to be growing rich\".\n\"Self-rule\" is the cry, as the industry proposes to ram through\n| Congress a measure to divest the FCC of practically all control over\nwhat may be broadcast. The industry would have carte blanche to follow\nits own dictates. Listeners would be left without recourse in the event\nof recurring abuses.\nThis is not \"The American Way\". It smacks of special privileges\nj for the few favored with license-free grants on the public domain. Why\nj ‘does the steward demand to be the master? What evidence have broadcasters\n■given that they are capable of responsible self-rule?\nA new code is proposed* but it—-like earlier versions which bloomed\nto stem criticism of abuses before fading-is doomed before it is adopted.\nj Already it is being openly opposed because of conditions it prescribes.\n! Adherence to the code with its non-definitive provisions would be purely\nI voluntary, and without compulsion, general compliance would be contra¬\ndictory to human nature. Can better compliance be expected of a voluntary\n•code than is shown by the record of conformity to the Radio Act, under\nwhich stations are licensed to operate?\nThe quasi-public aspects of broadcasting cannot be ignored. The\nI public has a larger stake than it realizes. Huffing and puffing phrases\nj isuch as \"freedom of speech\", \"censorship\", \"free enterprise\", \"dictator-\ni ship\" and other propagandists terms are intended to becloud the\nj real issues.\nThis is a time for straight thinking and straight talk.\nThe storm warnings are upl j\nHarold A. Engel I\nPresident, NAEB"
}