{
  "id": "d1092-2",
  "text": "NAEB NEWS LETTER,\nPAGE 3,\nAugust I, 1945\nThe PROGRAM IS A MALF-HOUR SHOW, PRESENTED ONCE EACH WEEK * It MADE ITS\nDfcSUT FrioAY, ApRii. 0# UNDER THE TITLE OF * YOUNG CHICAGO.B PROGRAMS ARE\nor two types: variety entertainment, presented by talented stuocnts, and\n\"public relations* programs presented by various departments of the\nChicago school system*\nSLHMLyilllllS\nIt was a long climb* but l finally got there* Yes* I found the studios\nor WHAZ ON TOP OF THE HILL IN Troy, NEW YORK. NqT ONLY Df 0 I FIND\nRensselaer Polytechnic Institute on top of the hill, or should I say hills,\nBUT I ALSO POUND THAT THe STUDIOS Of WHAZ WERE ON THE THIRD FLOOR OF WALKER\nHall—think that's the building name. I wish l had counted the streets\nprom Seventh Street level to the third floor, but I o«dn9t.\nIn time, I found Professor Dillard J. Williams, head of the Rensselaer\nElectrical Engineering Department, who is in charge of the station owned\nAND OPERATED BY RENSSELAER.\nWHAZ IS UNIQUE AMONG THE STATIONS IN NAEB. PROFESSOR WILLIAMS EXPLAINS\nTHAT IT IS OPERATED PRIMARILY FOR STUDENTS TAKING ELECTRICAL ENGINEERING.\n80TH GRADUATES AND UNDERGRADUATES HAVE AN OPPORTUNITY OF STUOYING THE\nWORKINGS OF THE EQUIPMENT. ThC STUDIO AND TRANSMITTER ARE LOCATED IN AD¬\nJACENT rooms in Walker Hall. The stuoio has been expanded since the\nFIRST BROADCAST BY THE STATION IN SUGUST OF *922. *NO THE TRANSMITTER\nHAS BEEN SO ERECTED THAT IT IS EASY TO GET AT ALL PARTS AND STUDY THE\nOPERATION.\nWHAZ SHARES TIME WITH WEVO AND W88R. IT OPERATES ON MONDAY NIGHTS ONLY.\nPrograms carrieo include those originated on the campus, with a portion\nor the time given to Mutual programs. Programs include student anp\nFACULTY TALENT, THE GLEE CLUB, SYMPHONY ORCHESTRA, AND PLAYERS GROUP.\nWHAZ OPERATES ON *330 KILOCYCLES WITH 500 WATTS POWER. YOUR PRESIDENT\nSPENT AN HOUR OR TWO VISITING WITH PROFESSOR WILLIAMS, DISCUSSING THC\nPAST, PRESENT, AND FUTURE OF RADIO. #C LOOKED OVER THE STUOIOS AND\nTRANSMITTER. We TALKED ABOUT THC FUTURE OF EQUCATI ON, TEXTBOOKS, ANO\nMUTUAL ACQUAINTANCES, ANO WE PROBABLY DIDN'T OVERLOOK THE WEATHER. IT\nWA8 A REAL PLEASURE OF YOUR SERVANT TO MEET ANOTHER MEMBER OF NAEB, OF\nMANY YEARS STANDING. We HOPE WE’LL MEET MORE FREQUENTLY IN THE FUTURE.\nWILLS SWORN IN AS FCC COMMISSIONER\nA roRMER Governor of Vermont, William Ht Wills, was sworn in July 23 as\nA MEMBER OF THE FEDERAL COMMUNICATIONS COMMISSION. WILLS WAS APPOINTED\nby President Truman in June ano recently was confirmed by the Senate.\nHe SUCCEEDS Norman 5, Case. Wills is a Republican*\nNEW PROGRAM DIRECTOR AT WSUt\nArmON BoNNEY HAS ASSUMED his NEW OUTUS AS PROGRAM DIRECTOR OF RADIO"
}