{
  "id": "d385-143",
  "text": "film strip\nFilmstrip not only gives high definition to the dwindling\npower of the book page, but it also gives new intensity to\nthe speech component. In this respect, it is somewhat of a\nreturn to manuscript conditions in which low definition\nvisual code went hand in hand with reading aloud. In print,\non the contrary, the visual being in relatively high definition\nsilent reading occurred and speech slipped into the low\ndefinition of laryngal gesture. To deal with either speech\nor its visual code as if they existed separately is itself a\nform of hypnotic bewilderment.\nFor example, I have found that since switching to charts\nI have begun to stammer a good deal. It is a well known\nfact that writing impairs the memory to an even greater degree;\nie. it sets up a clash between visual and auditory organization\nof experience, but both speech and visual code undergo great\nmodification in the presence of any new technology. Since\nspeech is itself a form of organized stutter, different lang¬\nuages are made up of all the senses simultaneously, but in\nvery different ratios of those senses. French utterance gives\nhigh stress to auditory liaison, with strong tactual and\nkinesthetic completion in non-verbal form. English and German\nstress the kinetic and tactual in verbal utterance, and\nEnglish at any rate almost dispenses with kinesthetic and tactual\ngesture by way of non-verbal completion.\nWhat I am saying is that there is a direct and predict¬\nable relation between image (S-I) and experience (S-C) and\nwhat is omitted in the image must be completed in the exper¬\nience. We cannot resist our innate human desire to complete\nat every instant the cycle of our senses by ever translating\none into the next.\nThus, in film, in which we are camera, high definition\nvisual image (which is also to-day reinforced with sound and\nkinesthesia) is mainly completed in the tactual mode. But in\nTV, the tactual is in the image itself. This is my latest\nbreak-through. Wolflin in his Principles of Art History\nexplains how contour line is essentially tactua1 rather than\nvisual, sculptural rather than pictorial. I had known this\nfor a long time, and considered its meaning in the work of\nSeurat and others, but some block had prevented me from seeing\nits relation to TV, yet I had long been acquainted with the\npeculiar sculptural quality of TV, and aware of its low defin¬\nition visual quality.\nMoreover, whereas in film you are the camera, in TV you\nare the screen. That is to say that in film we are mainly\nextrovert, and in TV mainly introvert. Film favours surface\nand process, but television favours depth and multi-levelled\ncausality or motivation research. Is this not a fairly good\ndescription of the difference between the 20*s and 50*s?\ncontinued..•"
}