{
  "id": "d385-184",
  "text": "Dr. Warren F. Seibert, Page 2, February 12, 1960\nwithout consultant payments. We can't again. Some of this sum (as well as\ntheir travel) should also probably be considered obligated. Wells Foshay,\nDick Evans, Sam Becker, and others have helped, and should still be paid at\nleast $100 or so each out of this, if possible, for past and future consultant\nassistance« There may be some other minor obligations in this respect,\nHere's what I would suggest. By the end of this month, the project will be\n6/10 (six months out of ten) completed. Let's terminate it4htfe* Meanwhile,\nI believe you should not pay the $6,015 listed as payable March 20. lam\nsending Marshall a copy of this to check regarding any obligations he has,\nand any corrections of the figures currently listed here, If you don't hear\nwithin the next ten days, please consider them applicable.\n1 would think that the anticipated balances given in the budget might be com¬\nputed as follows for the new revision, the sums shown below being the sums\nby which the overall budget could be reduced — these balances being returnable\nto you:\nSalaries $ 163.41\nEmployee Benefits 598.00\n* Travel 1,600.00\nSupplies, etc. 203.69\n** Services 500.00\nCommunications 200.00\nConsultant -\nExpected unused balance $3,156.10\n♦Some more travel (possibly one meeting by the Committee) besides\nMarshall's, seems Indicated.\n♦♦1 think we should allocate between $500 and $1,000 for publication\nor mimeographing of final report. Hence this sum is less large than\nit may be when done.\nThis would mean that we would proceed with completion of the project on a min¬\nimal basis in the some four months left to us, with as complete a report, pub¬\nlication of syllabus, and collection of testable materials as possible. We can\ndiscuss the beat uses to be made of these materials after we see them.\nThis would mean reduction of the total contract sum from $35,015 to a round\nsum near $27,000, which w© get by subtracting the $5,015 still payable and"
}