{
  "id": "d385-224",
  "text": "DEPARTMENT OF\nHEALTH, EDUCATION, AND WELFARE\nOFFICE OF EDUCATION\nWASHINGTON 25, D. C.\nDr. Harry Skornia, President\nNational Association of\nEducational Broadcasters\n14 Gregory Hall\nUrbana, Illinois\nDear Harry:\nJanuary 11, 1960\nRECEIVED\nNAEB HEADQUARTERS\nJAN 1 3 1960\nAM Pi\n7|8,»,10,11,12,1,2,8|4|§|«\nl\nIn accordance with your request for information from the project\n#279 file, I am sending the following excerpts from Walter Stone's memo\nof June 5, 1959. This memo sets forth the understandings which were\nreached when he negotiated the grant with you. I gather from our\ndiscussion of yesterday that these items coincide with your recollection\nof the agreements and hope that they will prove helpful in developing the\nfuture course of project action.\nThe excerpts from the memo are as follows:\n\"Experimental aspects of this project will involve the development\nand testing of materials and techniques for utilization to develop student\ninsight into the nature of media, using both in-class and out-of-class\nmedia experience. Among possible insights to be gained would be, for\nexample, effects of radio on newspaper style; awareness of the changing\neconomic structure and politics resulting from radio utilization (e.g., fire¬\nside chats); use of radio to create atmosphere of privacy (i.e. by students);\nthe fact that radio intensifies language barriers; TV influence on choice\nof political candidates (e.g., search for handsomeness); TV roles in\nbypassing literacy to create understanding; development of synthesized\npersonality by TV; interplay of forms illuminating each other, etc.\"\n\".the investigator recommended that Dr. McLuhan be given an\nopportunity, in the space of 4 months to develop a suitable plan and ^\nprocedures for carrying out his project in cooperation with the Research^,\nCommittee on the NAEB, and that his salary be guaranteed for one year.AIn\nthe event that suitable procedures are developed which justify carrying the\nproject forward (these are subject to review by the NAEB and the Office of\nEducation personnel), then the project would be funded as indicated in the\nattached budget statement. The investigator suggested that the project\nmight be developed in four stages: (1) preliminary exploration and planning;\n(2) development of materials; (3) experimental utilization; and (4) final\nevaluation of preparation of report. This suggested staging seemed gener¬\nally acceptable . It was also agreed that the first two stages of the project"
}