{
  "id": "d1075-11",
  "text": "Ralph Lowell, chairman of the Center’s Board of\nDirectors, in expressing his regret at Dr. Newburn’s\ndecision said, “The success of the Center to date and\nthe fact that there are now 29 educational stations in\noperation are due in large part to Dr. Newburn’s\nleadership. His broad educational experience along\nwith his steady guidance have helped greatly to pro¬\nvide a sound educational basis for national educa¬\ntional television.”\n^ Recently appointed Dr. Keith M. Engar will as¬\nsume duties as station manager of KUED, the Uni¬\nversity of Utah station in Salt Lake City, according\nto an announcement by University President A. Ray\nOlpin. Dr. Engar succeeds C. Richard Evans, who\nwill devote his time to his private electronics business\nwhile remaining consultant to KUED.\nDr. Engar has been in radio broadcasting since\n1939 and in television since 1948 when he served as\nproduction manager at KDYL-TV, now KTVT. He\nalso was the NAEB Fulbright research scholar in\nFrance during 1956-57.\n► Elmer G. Sulzer, chairman of the radio-TV de¬\npartment at Indiana University, has been elected\nvice-president for FM radio of the Indiana Broad¬\ncasters Assn. He is the first representative of edu¬\ncational broadcasting to be chosen an officer of the\nassociation which is composed of the radio and TV\ninterests of the state.\nProf. Sulzer is also a new Kentucky Colonel. This\nhonor was bestowed on him by Gov. A. B. (Happy)\nChandler for “pioneering work in the development of\neducational broadcasting.” A native Hoosier, Prof.\nSulzer spent 17 years as director of radio and public\nrelations at the University of Kentucky before coming\nto Indiana University in 1952.\n► Franklin G. Bouwsma, executive secretary of the\nDetroit ETV Foundation, has announced the appoint¬\nment of Joseph Jankowski, Jr., to the position of\nchief engineer of WTVS. A former employee of the\nFoundation, Jankowski has most recently been on the\nTV engineering staff of Wayne State University.\n► A one-year exchange of personnel between KVOK,\nHonolulu, Hawaii, and WGRE, Greencastle, Ind.,\nwill be affected next year. Miss Elizabeth Turned will\ntake the position of Robert Ritterhoff at KVOK, and\nhe will assume her duties as instructor of radio at\nDePauw and program director of WGRE.\nThe Hawaii station is located in the Kamehameha\nSchool for Girls. It is not at present a member of the\nNAEB, but it is a 10-watt FM non-commercial sta¬\ntion similar to WGRE.\n► Raymond Hurlbert, general manager of the Ala¬\nbama ETV Commission, has been invited to act as\nconsultant for an organization for establishing ETV\nby the University of New Hampshire. He was re¬\ncently advisor in a series of seminars held in Dover,\nN. H.\nUniversity President Eldon Johnson anticipated\ndeveloping an ETV network in New Hampshire based\non Alabama’s present network.\n► NAEB member Wells R. Chapin will be in charge\nof the new General Electric Co. regional headquarters\nfor sales of radio and TV broadcast equipment at\nDetroit, Mich. Chapin was formerly manager of\nmarketing administration and product planning for\nthe company’s Technical Products Department at\nSyracuse, N. Y.\n^ The Alumnae Assn, of Huntingdon College has\nselected Miss Evelyn Walker, producer-coordinator of\nradio-TV activities in the Birmingham (Ala.) schools,\nas winner of its 1958 Achievement Award. The award\nrecognizes her interest and achievement in televised\neducation, exemplified by her interest in the NAEB\nand her service to the Alabama ETV network. Miss\nWalker attended NAEB’s first production workshop.\nShe has been head of broadcasting activities in Bir¬\nmingham since 1944.\nTV TECHNICAL TIPS\n—Cecil S. Bidlack\nThirty engineers from educational television stations\nand production centers will attend the NAEB Video\nRecording Workshop to be held May 5 - 9 in the\nstudios of WTTW, the Chicago Educational Televi¬\nsion Assn, station. The Workshop is made possible\nby a grant from the Ford Foundation and is sponsored\nby NAEB to provide attending engineers an ap-\nportunity to increase their technical knowledge and\nability in video recording.\nMuch of the programming supplied educational\ntelevision stations by the ETRC, Ann Arbor, Mich.,\nis recorded on film by the kinescope process. While\na major portion of the workshop program will be de¬\nvoted to kinescope recordings of television programs,\na comprehensive technical description of the Ampex\nVideotape Recorder will be given, followed by a\ndemonstration of the equipment at WGN-TV, The\nChicago Tribune station, where installation has just\nbeen completed. The possibility of a change to record¬\ning programs on magnetic tape is one that has in¬\ntrigued educational station administrators since the\ninitial announcement of this process two years ago.\nOver one hundred of these video tape recorders will\nbe in service at network centers and commercial sta¬\ntions by the end of this month.\n12\nNEWSLETTER"
}