{
  "id": "d1075-12",
  "text": "Highlighting the five-day program will be talks\nand demonstrations by representatives of broadcast¬\ning networks, equipment manufacturers, and allied\nservices, as well as a number of speakers drawn from\nthe ranks of education TV broadcasters.\nThe program of the workshop covers studio prac¬\ntices affecting kinescope recdrding, camera adjust¬\nment procedures, kinescope set-up procedures, stand¬\nardization and control measures, film characteristics,\ndensitometry, printing and processing quality control,\nas well as film laboratory practices. Other topics to\nto be discussed are calibration and measurement\nequipment, sound pick-up, monitoring, equalization,\nand film editing. Several periods have been set aside\nfor group discussion of problems arising from chang¬\ning film stock and processing laboratories, unusual\ntechniques and equipment modifications, experiences\nin dealing with film laboratories and the economics\nof kinescope recording.\nThe Workshop has been arranged and participants\nselected by the NAEB Engineering Committee whose\nchairman is Carl H. Menzer, director of WSUI-KSUI.\nProgram details have been arranged by Duane Weise,\ndirector of engineering for WTTW and Cecil S. Bid-\nlack, NAEB TV Engineer, coordinator for the work¬\nshop.\nThe following persons are scheduled to attend:\nNelson Alquist, kinescope recording engineer, WKNO-TV, Memphis\nCommunity TV Foundation; Samuel A. Barbour, chief engineer,\nWHYY-TV, Metropolitan Philadephia Educational Radio and Televi¬\nsion Corporation Corp.; Rob R. Beldon, chief engineer, WILL-AM-\nFM-TV, University bf Illinois; William Boehme, School of Journalism\nand Communications, The University of Florida; John L. Boor,\ndirector of engineering, KTCS (TV), University of Washington; John\nCullen, chief engineer, KRMA-TV, Denver Public Schools; Roderick\nDavis, chief engineer, TV Center, The University of Kansas; Adolph\nS. Dvorak, chief engineer, KUON-TV, University of Nebraska;\nHerbert Evans, chief engineer, WTHS-FM-TV, Dade County Board\nof Public Instruction, Miami; Edward W. F'urstenberg, W'HA-TV,\nUniversity of Wisconsin; Harold D. Gorsuch, TV technical super¬\nvisor, WOSU-TV, Ohio State University; Edward Graham, Jr.,\nchief engineer, WGTV, Georgia Center for Continuing Education,\nUniversity of Georgia; Lawrence R. Griewski, studio technical\nsupervisor, University of Michigan; James R. Leonard, chief\nengineer, WCET, Greater Cincinnati TV Educational Foundation;\nFloyd Malott, chief television engineer, Radio and Television\nCommunications, Indiana University; Joseph Martel, recording\nsupervisor, META, Inc., New York; Vorce C. McIntosh, chief\nengineer, University TV and Radio, The University of New\nMexico; George L. Murphy, chief engineer, Educational Television,\nAuburn Polytechnic Institute; Robert Nissen, studio supervisor,\nKQED, Bay Area Educational Television Assn., San Francisco;\nC. D. Phillips, chief engineer, Television Center, State University of\nIowa; Merlyn D. Rawson, chief engineer, Department of Tele¬\ncommunications, University of Southern California; Edward Reed,\nKTCA-TV, Twin City Area Educational Television Corp.; R. Taylor\nRogers, WUNC-TV, The University of North Carolina; Ralph Seitle,\nkinescope supervisor, WTTW, Chicago Educational Television Assn.;\nJohn Soergel, chief engineer, Radio and Television Center, Syra¬\ncuse University; Glen Southworth, chief engineer, KWSC, The\nState College of Washington; Joseph E. Stuckey, chief engineer,\nBroadcasting Services, University of Alabama; Linn Towsley, chief\nengineer, WKAR-TV, Michigan State University; James Wulliman,\nchief engineer, WMVS-TV, Milwaukee Vocational and Adult Schools;\nPaul Yacich, kinescope supervisor, WDSU-TV (representing WYES-\nTV), New Orleans.\n*****\nThe NAEB Engineering Committee met in Chi¬\ncago March 17 and 18. Many subjects were discussed\nand among them was the promotion of interest among\nengineers in NAEB and attendance at the NAEB\nnational convention. This year, the convention is\nbeing held in Omaha, Neb., October 14 -17.\nA number of NAEB stations are within easy\ndriving range of Omaha. If we were to schedule a\nmeeting of technical personnel for an afternoon, many\nof you could drive there in the morning, meet in the\nafternoon and drive home that evening. It would\ngive us a chance to get together, get acquainted, have\na special program planned at the convention, or if\nyou choose, no program—just a talk session.\nIt’s also been suggested that we could do the\nsame thing at regional meetings or, in the absence of\na regional meeting, we could get together on our own.\nSuch a meeting was held at WBEZ in Chicago on\nJune 10, 1954. We don’t have any figures on who at¬\ntended or how many; however from the August, 1954\nNewsletter, this meeting was adjudged a success and\nit was suggested that similar meetings might be held\non an annual basis.\nWe’d like to get an expression of opinion on hold¬\ning such a meeting either at the NAEB convention or\non a regional or even a state basis. We hope the per¬\nson who receives this Newsletter will call this to the\nattention of his technical staff and give us its reaction.\n*****\nAnother item discussed at the engineering com¬\nmittee meeting concerned NAEB Educational Televi¬\nsion Scholarships. (See article on p. 5) A grant from\nthe Ford Foundation permits us to offer scholarship\nawards from $75 to $300 to employees of operating\nETV units (stations or production centers) to per¬\nmit attendance at workshops, summer sessions or\nregular university sessions. To date, no technical\nemployee has been granted one of these scholarships\nfor the simple reason that none has applied. We\ncan’t go into the details of the application or other\nrequirements here, but we have the information all\ncompiled in a four-page leaflet and if you’re interested\nwe’ll gladly send you one. There’s no reason why\nsuch funds cannot be granted to technical personnel\nand we invite you to apply if you’re interested in\nfurthering your technical knowledge through a course\nof study.\n*****\nWe don’t have complete details but RCA has\nannounced a new vidicon camera tube, type 7038.\nIt is a one-inch diameter tube, capable of 600 line\nresolution and can be used for color, monochrome,\nlive or film cameras in broadcast or industrial ser¬\nvice. It is more sensitive than previous types, de-\nMAY, 1958\n13"
}