{
  "id": "d1075-3",
  "text": "of you at the IERT, and I wish to extend a special\ninvitation to representatives of those stations now\nnot taking network service to stop by the NAEB\nexhibit. I believe an examination of the benefits of¬\nfered network members will convince you that your\nstations should subscribe to our service. Anyone not\nattending the IERT should write directly to me at\nHeadquarters.\nPUBLICITY AND PUBLIC RELATIONS\n—William Bender, Jr.\nWUOM, University of Michigan\nThe report in this column on “Visitations” drew a\nvaluable postscript from Irving Merrill at WKAR-\nTV, Michigan State University. They have worked\nout a technique for handling large (100 or more)\ngroups which, according to Merrill, “routes them\nthrough the station, provides a demonstration of\nequipment, and allows discussion of their questions,\nall without disrupting the normal activities of the\nstation.”\nThree staff members handle the whole thing. First,\nthey divide the visiting group into three segments.\nThen every 30 minutes, each group moves to a differ¬\nent guide. Of the three staff members, one presents\na technical demonstration, another acts as escort\nthrough the entire station, and the third leads dis¬\ncussions in the conference room. Each repeats his\nperformance for the three segments of visitors, and\nthe tour is over in an hour and a half.\n*****\nHow many of you would favor using an NAEB\n“bug” on your printed program schedules? Elmer\nSulzer, WFIU, Indiana University, thinks we are\noverlooking a continuing promotional item here. He\nrecommends we develop a logotype to identify our\nNAEB membership, and then print it on each\nmonthly schedule. “Bromo” even sketched several\nsuggestions, and urges others to contribute their\nideas for an NAEB “bug.” If any of you have other\nideas, sketches or suggestions, please pass them on to\nNAEB Headquarters.\nSomewhat along this line, Franklin Dunham\n(Washington, D. C.) recently commented on the\nlack of any sort of uniformity and identity in the\nprinted schedules of NAEB stations. Larry Frymire,\nWKAR-radio, Michigan State University, made an\ninformal, exploratory study and concluded: “There is\ngreat confusion among the various program schedules\nprinted by our members. There is a need for some\nstandardization—the problem being what form to\nfollow. This would be a good topic for a clinic ses¬\nsion.”\nFrymire then makes some recommendations from\nhis study of several score programs:\n(a) Use a Grid-style schedule, placed so it may be\neasily unfolded for viewing.\n(b) Use the letter “n”, placed just above the last\nword in the title, to identify programs coming from\nthe NAEB network. Directly below the grid, “n”\nwould be explained in usual footnote fashion.\nA lot of thought and effort lies behind those two,\napparently simple, recommendations. We urge you\nto give serious consideration to adopting them for\nyour own program schedules.\n*****\nFrom Queens College, N. Y., Robert Crawford\ndescribes a vigorous publicity campaign that launched\ntheir new college credit courses-by-radio.\nThe build-up included general news releases, live\nspot announcements, 15-minute radio interviews with\nthe teacher, a special direct-mail piece to adult edu¬\ncation lists, window displays, and commercial ads\nin the New York Times and the Saturday Review.\nThey pulled 1200 requests. Nice going!\n*****\nYou are all thoroughly aware of the Bell System\nScience Series (“Mr. Sun,” “Hemo,” “Unchained\nGoddess”) Publicity for this is conducted by N. W.\nAyer & Son., Inc.\nIn our next column, we’ll give you the inside story\nof their promotional campaign. It’s being prepared by\nDonald C. Thompson, supervisor of Ayer’s P/R\ndepartment.\nFOURTEEN GRANTS-IN-AID AWARDED\nGrants-in-aid totalling $16,665 have been awarded to\n14 institutions planning summer workshops in differ¬\nent aspects of educational broadcasting. These grants\nwill be used to assist the institutions in improving\nplanned workshops by providing additional income\nfor bringing in outstanding broadcast consultants\nwhom they otherwise might not be able to afford.\nRecipients were selected by a special NAEB com¬\nmittee on the basis of workshop objectives, organiza¬\ntion, need, and the contribution which will be made\nto the national advancement of educational broad¬\ncasting. The 14 grants, made possible by funds from\nthe Ford Foundation, range from $400 to $2215. Re¬\ncipients and their workshop objectives are:\n4\nNEWSLETTER"
}