{
  "id": "d1075-4",
  "text": "Central Washington College of Education, Ellens-\nburg, Wash. (Robert Slingland, workshop director)\n- to examine materials and demonstrate to educational\npersonnel and administrators, educational methods\nand use of equipment.\nCollege of the Pacific, Stockton, Calif. (John C.\nCrabbe, director of broadcasting) -to prepare teachers\nand community workers for community-sponsored\neducational TV; workshop in production.\nDenver Public Schools, Denver, Colo. (Gerald J.\nWillsea, director of the radio-TV department) - to\ngive teachers experience in program production of\nTV as an instructional medium.\nFlorida Agricultural and Mechanical University,\nTallahassee, Fla. (Theodore B. Cooper, director of\nthe audio-visual center) - to familiarize audio-visual\nand other school personnel with new procedures and\nequipment as related to ETV.\nFlorida State University, Tallahassee, Fla. (Roy\nFlynn, director of radio-TV) - to provide teacher\ntraining in production and utilization of educational\nTV.\nLowell Institute, WGBH-TV, Cambridge, Mass.\n(Hartford N. Gunn, Jr., general manager) - to train\nteaching personnel in methods of preparing and pre¬\nsenting in-school TV programs.\nMichigan State University, East Lansing, Mich.\n(Colby Lewis, associate professor of speech) - to\nstudy the use of techniques in effective communica¬\ntion of educational programs.\nOregon State College, Corvallis, Ore. (James M.\nMorris, director of ETV and radio) - to instruct\nOregon teachers in the use of TV from schools now\nequipped or soon to be equipped with in-school\nreceivers.\nPeabody College for Teachers, Nashville, Tenn.\n(Felix C. Robb, dean of instruction) - to instruct\nteachers and administrators in uses, methods, and\nproblems of classroom television.\nPurdue University, Lafayette, Ind. (James\nMiles, director of radio-TV) - to provide three work¬\nshops in production procedures for agricultural TV,\nreligious TV and religious radio programs.\nSacramento State College, Sacramento, Calif. (H.\nJ. McCormick, dean of summer session) - to study\nthe problems, policies, preparation and use of in¬\nstructional programs.\nSyracuse University, Syracuse, N. Y. (Eugene S.\nFoster, chairman of radio and TV center) - to pro¬\nvide a study of “TV in the Future of Education” for\noutstanding teachers and administrators.\nUniversity of Tennessee, Knoxville, Tenn. and\nWKNO-TV, Memphis, Tenn. (Kenneth D. Wright,\ndirector, department of broadcasting) - to inform\nstate school leaders on activities and potentiali¬\nties of ETV and to give experience in instruction and\nproduction.\nToledo Public School, Toledo, Ohio, (Harry D.\nLamb, director of broadcasting and station WTDS)\n- to study techniques in adapting teaching procedures\nto TV and vice versa.\nNAEB SCHOLARSHIP\nDEADLINE EXTENDED\nApplication deadline for NAEB Educational Tele¬\nvision Scholarships has been extended to May 23. The\nformer deadline was set at April 1, but this extension\nhas been affected because all available funds have not\nyet been used.\nIn previous announcements and brochures dis¬\ntributed with information on the scholarships, it was\nindicated that multiple copies of applications and\nsupporting letters are required. Now only five copies\nof each are necessary, instead of the indicated eight.\nMade possible by a grant from the Ford Founda¬\ntion, these scholarships are designed to permit per¬\nsons active in educational broadcasting to increase\ntheir professional knowledge either through attend¬\nance at workshops or enrollment in regular academic\ncourses. The scholarship awards range from $75 to\n$300.\nBrochures giving details on material to be included\nin applications were sent to those on the NAEB\nmailing list a few months ago. Additional copies may\nbe obtained at NAEB Headquarters.\nNAEB SCHOLARSHIP\nWINNERS ANNOUNCED\nNine summer scholarship grants of $250 each have\nbeen awarded by the NAEB as part of its program to\nimprove professional qualifications of educational\nbroadcasting personnel.\nThe scholarships, supplying funds for summer\nstudy in workshop or academic sessions, are awarded\nprimarily on the basis of the contribution to educa¬\ntional broadcasting likely to result from attendance at\nthe sessions.\nRecipients of the scholarships are:\nMaurice Borg, Jr., representing the Chicago Edu¬\ncational TV Assn. (WTTW), who will attend the\nNorthwestern University summer session.\nProf. Rolf Hickman, of the. University of Wis¬\nconsin, who will attend the Summer Workshop on\nETV at Syracuse University, August 11-22.\nRoger J. Houglum, representing the Eugene (Ore.)\nPublic Schools station KRVM, for a two-week train¬\ning period at KQED, San Francisco.\nMAY, 1958\n5"
}