{
  "id": "d1347-0",
  "text": "□□an m\nOF EDUCATIOHAL BROADCASTERS\nRepresenting non-commercial, educational AM, FM, and TV broadcasting stations, workshops,\nand production centers, owned and operated by colleges, universities, school systems, and public service agencies.\nJULY 1952\nFOUNDATION GRANTS\nFUT) FOR ADULT EDUCATION GRANTS-IN-AID OPEN FCR APPLICATIONS\nThe NAEB Committee to administer the local programming grants-in-aid from the\nFund for Adult Education of the Ford Foundation (see cover story June *5>2 NEWSLETTER\nfor complete story) has announced the procedure to be followed by stations in apply¬\ning foi* a grant-in-aid. Detailed information is given below s\nAll applications for grants must be submitted in accordance with the following t\nconditions and must be sent to NAEB Headquarters, 119 Gregory Hall, University of\nIllinois, Urbana, Illinois.\nDetails of NAEB-FAE Grants-in-Aid\n1. All applications must be for grants to help produce a series of content-oriented\nprograms in the field of adult education.\n2. Applications may be submitted by any educational institution or school system.\nYou do not have to be a member of NAEB.\n3. Applications may be submitted for a grant in either radio or television or both.\n1*. The grants will not exceed $7,000 in radio or $9,000 in television. Applications\nasking for considerably less than these maximum amounts will receive full con¬\nsideration.\n£. These grants-in-aid are intended to help you help yourself. They cannot carry\nthe entire burden of production costs. They should enable you to hire that key\nperson or do that key thing which makes the production possible.\n6. All radio programs produced with the help of these grants must be suitable for\nuse on the NAEB Tape Network and should be cleared for such use.\n7.\nAll television programs produced with the help of these grants must have more\nthan a local application.\n8. Applications must be in writing. Six copies of all written material should be\nsupplied together with examples via tape or film of your technical ability to\nproduce either radio or television programs.\n.PLAN’TO ATTEND THE 19^2 CONVENTION\n.. MINNEAPOLIS — NOVEMBER 6-7-8\nThe N-A-E-B NEWS-LETTER, published monthly, is distributed'from and distribution should be addressed to: NAEB, 119 Gregory Hall,\nthe national headquarters office at the University of Illinois. N-A-E-B University of Illinois, Urbana, Illinois. Editorial copy and inquiries\nmembers and associate members receive the NEWS-LETTER as part of concerning editorial matters should be sent to the Editor, Burton\nmembership service. Non-members may obtain the publication at a Paulu, Station KUOM, University of Minnesota, Minneapolis 14,\nsubscription rate of $5.00 per year. All inquiries regarding subscriptions Minnesota."
}