{
  "id": "d1347-13",
  "text": "- lit -\nEDUCATIONAL RADIO\nINDIANA U. APPOINTS NEW RADIO-TV DIRECTOR\nElmer G. Sulzer, formerly University of Kentucky radio head, has been appointed\ndirector of radio and television broadcasting at Indiana University. Mr. Sulzer will\ntake over his new post September 1. He will have charge of all radio and television\nprograms originating from the Indiana University campuses at Bloomington and at Indi¬\nanapolis and from the nine adult education centers throughout the state of Indiana.\nHe also will manage the University's FM Station WFIU, a laboratory student training\ncenter.\nNationally known for hig radio achievements during the past 23 years at the Uni¬\nversity of Kentucky, Mr. Sulzer in 19h2 received the Peabody Award for outstanding\npublic service by presenting a radio series that helped to break down radio prejudice\nagainst venereal desease information.. He also established the first national radio *\nnetwork \"school of the air\" from a state university, founded and operated for 13 years\nthe University of Kentucky system of mountain radio listening centers, built the\nfirst university FM station in the United States, established a format for university\ncooperation with industry and communities in radio programs, and has directed for 23\nyears a University of Kentucky program on Station WHAS, Louisville#\nThe new Indiana University radio-TV director is regional director of the Associ¬\nation for Education by Radio, legislative chairman of the Kentucky Broadcasters Asso¬\nciation, and a nerrber of the National Association of Educational Broadcasters aid the\nUniversity Association for Professional Radio Education.\nWFUM, NEWEST MICHIGAN STATION, BEGINS OPERATIONS\nMichigan's newest radio station, WFUM, Flint, went on the air at noon Tuesday,\nJuly 15, carrying programs of the University of Michigan Broadcasting Service. ’ :\nFormerly called WAJL, the station, with transmitter in the Hurley Hospital\nbuilding was given to the Ikiiversity in February. Now the station returns to the\nair under Federal Communications Commission approval with new call letters, a new FM\nfrequency of 89.7 megacycles and new programming.\nThe original plan to operate WFUM from Ann Arbor by a remote control was dis¬\ncarded because of the extra cost,of a telemetering system required by the FCC> accord¬\ning to Waldo Abbot, director of the Broadcasting Service. A full-time transmitter\nengineer will operate the station, which will broadcast programs from the University\nstation WUOM on campus.\nDuring the summer WFUM will be on the air from noon until 10:30 p.m. Monday-\nthrough Friday and 10 a.m. to k p.m. Sunday*\n\"WFUM will bring a new type of radio programming into the Flint area,\" Abbot\nsaid. \"We place strong emphasis on dramatic productions, featuring student and :\nprofessional casts and on classical and semi-classical music.\"\nOne major function of the station will be to extend coverage of the University's\nspecial programs for rural schools, he pointed out. These provide elementary school¬\nteachers with radio teaching aids in history, music and general science. Sports pro¬\ngrams will include play-by-pl^r broadcasts of all University of Michigan games. Free\nmonthly bulletins of WFUM will be mailed to interested listeners#"
}