{
  "id": "d1347-22",
  "text": "‘23*\nTHE THIRD ALLERTON SEMINAR\nReported by\nAlvin M. Gaines\nNAEB Region II Director\nThe Third Allerton Seminar is now historyl\nTwfenty. representatives of school broadcasters met at Allerton House, Monticello,\nIllinois, from June 1$ to 2? to explore the whole field of radio and television broad¬\ncasting to the public and private schools of the United States and -Canada. Thirteen\nstates and Canada were represented•\nThe S.S. (School Stations) Allerton was skippered by Jim Miles, Executive Direc¬\ntor of NAEB, aid officered by four consultants: Harold McCarty, WH&j James Macandrew,\nWNYE$ I* Keith Tyler, Ohio State University^ and Alvin Gaines, WABE*\nIn the Allerton tradition the weather wound up and cut loose with a heat wave for\nthe opening days of the seminar, but soon relented and provided a week of reasonable\ntemperature before speeding the members on their way home with more heat. In case any\nfoimer Allertonites are interested, grandfather bullfrog still makes bass music of an\nevening1\nProfessor Gordon Hullfish, Ohio State University, the first of ten one-day con¬\nsultants, got the seminar off to a flying start on Sunday evening dealing with the\nbasic problems of education in a changing world.\nOn Monday Dean Wilbur Schramm, Division of Communications, University of Illinois,\nbriefed the conference on the National Association of Educational Broadcasters and the\ngrant-in-aid by the W.K. Kellogg Foundation which made possible the establishment of a\ncentral headquarters and the expansion of the Tape Network begun by Seymour Siegel,\nPresident of NAEB.\nCommittees Appointed\nTuesday had been left open for the purpose of orientation and decision by the\ngroup on objectives and means of obtaining them. It was the feeling of the group that\n1952 was a year of decision for educational broadcasters and that, like the First\nAllerton, a written report should be one of the major results of the seminar. The\ngroup spent the day discussing and outlining the problems and resources of school broad¬\ncasters in both radio and television. These were grouped under the following broad\ncategories: Administration, Facilities, Programming, Production, Utilization, Tele¬\nvision and Miscellaneous (which included such items as the NAEB Network and the prob-\n^ lem of script exchange). It is to be noted that these categories were made up of prob¬\nlems and questions coming directly from the operating experiences of the various mem¬\nbers. Throughout the following week committees were appointed to study and report on\nthe major categories.\nOn the organization side, the conference had a rotating chairmanship (in keeping\nwith the nautical theme, the O.D. or Officer of the Day and a Log Keeper). The offi¬\ncers had been briefed previously to be available to the group for advice, but found it\npractically impossible to keep out of the various verbal exchanges. Often as not the\nofficers (and even the Skipper) got their ears pinned back when they got out on a limb.\nSchool broadcasters are just as vocal as their brethren at the university levell"
}