{
  "id": "d1347-24",
  "text": "m2$~\nAllerton Seminar Attendees\nConsultants — H.B. McCarty, Station WHA; James Macandrew, Station WNYE; Alvin\nGaines, Station WABE; I. Keith Tyler, Ohio State University.\nOne-Day Consultants — James A. Schwalbach, Station WHA; John D. Whitney, Station\nKSLH; B.Y. Glassberg, Station KSLH; Harold Hand, Professor of Education, University of\nIllinois; Vernon Fryburger, Asst. Prof, of Journalism and Communications, University\nof Illinois; Dallas W. Smythe, Res. Prof., Institute of Communications, Lniver.ity Q.\n-Ill.; Uilbur Schramm, Dean of Division of Communications, University.of Illinois,\nfilliam E. Levenson, Asst. Supt. of Schools, Cleveland, Ohio; Benjamin m.oom, gamin-\ner's Office, Univ. of Chicago; Martha Gable, TV Coordinator, Philadelphia, Public\nSchools; Cordon Hullfish, Ohio State University.\nMembers - Marguerite Fleming, Station KSLH, St. Iouis, ]'fi.ssouri; M. McCabe Day,\nStation VJVSH, Huntington.Indiana; Kay Lardie, Station ’.JDTR, Detroit, Michigan;\nHaskell Bovter, Station WABE, Atlanta, Georgia;. Dorothy Klock, Station WNYE,. New xo^k,\nN.Y.; Jay Stillinger, Station VJBOE, Cleveland, Ohio; John Maier, Station W/HI, M^.cie,\nIndiana; Patricia6Green, Station KBPS, Portland, Oregon; Elaine Tucker, Station aOKH,\nOklahoma City, Okla.; Harry Lamb, Station VITOS, Toledo, Ohio; Uorthington\nStation WSHS, Floral Park, N.Y.; Clifton Schropp, Station KDPS, Des Moines,\nHiller, Flint (Mich.) Public Schools} Dale Keller, Station VJGPS, Greensboro, H. •,\nEdwin Barrett, Station KSDS, San Diego, California; George Jennings, Station bbEZ,\nChicago, Illinois; Juanita Rucker, Station UYSH, Hew Castle, Indiana; D. P. |*itxe,.\nStation WHPS, High Point, H.C.; Gertrude McCance, Dept, of Educ., Province of Mam to a,\nWinnipeg^ Canada; Merle Kimball, KTOY, Tacoma, Washington.\nPRFT-TMIHARY REPORTS FROM THE ALLERTON SEMINAR ON SCHOOL BROADCASTING\nThe following is a condensation of reports made by various committees atthe _\nrecent Allerton House Seminar on school broadcasting wnich was held at the University\nof Illinois.\nPhilosophy Committee Report\nThe broadcast media of our day are rapidly breaking down old barriers and creat¬\ning new bonds of understanding. In this age of conflicting idealogies these tools are\npowerful forces for good or evil. Our cultural survival may depend in no small mea-\nsure upon the wise use of radio and television.\nSince training for effective living in this modern world is a Primary purpose of\neducation, it is imperative that schools use radio and television with the sane spoils\npurpose with which they use other teaching resources. In considering the contribuUon\nwhich broadcasting can make to education, it should be remembered that it can never\nbe a substitute for the teacher. Programs should be geared to the curriculum at\nvarious grade levels and teachers should be encouraged and trained to use them.\nPotentially, the school station should be organized to provide a broadcast ser¬\nvice which stimulates and enriches classroom instruction, complements the work of the\nteacher, aids in curriculum development, provides opportunity for vocational training\nfurthers school community relationships, and presents programs which meet the needs of\nthe adult members of the community.\nONE-PLANE THROUGH AIR SERVICE TO MINNEAPOLIS FROM NEW YORK,\nWASHINGTON, NEW ORLEANS, LOS ANGELES, SAN FRANCISCO, SEATTLE,\nCHICAGO, DES MOINES AND MADISON"
}