{
  "id": "d1347-9",
  "text": "10\n”1 trust that other philanthropic foundations will study the unprecedented opportun¬\nity that lies in these reservations and will discover their own ways of speeding the\nconstruction and operation of stations. They, too, must realise that time is of the\nessence. *\n\"I wish to take this opportunity to recognize and commend the volutary donations\nmade by private citizens all over the nation to supply a $h0,000 war chest to the\nJCET in its early stages. I am sure that they feel well rewarded when they see how\nmuch was accomplished with their money.\n\"The television boom is on. As of today, more than £00 applications for construction\npermits have, been filed with the ’FCC. And in connection with this tabulation, there\nare two highly interesting points. The first is a most encouraging omen for those\neducational institutions in communities where the educational assignment is in the\nUltra High Frequency band. Of the 500 applications on hand, 200 are for UHF assign¬\nments. Furthermore, 35 are for places already served by Very High Frequency stations.\nThe other interesting point is that as of today, eight educational instituions have\nfiled applications. These are: Bay Area Educational Television Association, Berke¬\nley, California; Lindsay Hopkins Vocational School, Miami, Florida; Kansas State\nCollege, Manhattan, Kansas $ University of the State of New York for station's at\nAlbany, Buffalo, New York City, Rochester and Syracuse.’*\nTWO NEW STAFF, MBM3ERS JOIN JCET\nPaul C. Reed\nThe Joint Committee On Educational Television announced recently-that Paul C. Reed of\nRochester has been added to the JCET staff as Assistant Director. On a year's leave\nof absence from his position as Consultant for Visual and Radio Education for the\nRochester Public Schools, Reed will head the JCET Field Service Program.\nFrom the Committee's headquarters in Washington he will administer an extensive\ntelevision consultant service. He will assign specialists in programming, engineer¬\ning, communications law and administration to conduct exploratory discussions with\neducational groups who plan to utilize the reserved television channels. In addition\nto these administrative duties, Reed will serve as a consultant himself. ‘\nMr. Reed has taken an active part in the organization and the operation of the Empire\nState FM School of the Air, which provides educational radio programs to over 12,500\nclassrooms of the state e$ch week over twenty commercial FM stations. He has been\ninstructor in audio-visual education at Northwestern University, Chicago; American\nUniversity, Washington, D* C.; State University of Iowa, Iowa City; Syracuse Uni¬\nversity; and the University of Rochester.\nIn 1936-37 he was awarded a fellowship by the Rockefeller Foundation to study at the\nColumbia Broadcasting System. In 19h2 he set up a national distribution of 16 mm war\ninformation films for the Office of War Infornation.\nHe has been a board menber for the Film Council of America, aid has served as President\nof the Department of Visual Instruction of t'he National Education Association.\nTHE 1952 CONVENTION WILL BE HELD IN MINNEAPOLIS —NOVEMBER 6-7-8\nIT TAKES ONLY ABOUT SIX HOURS TO REACH MINNEAPOLIS FROM HOUSTON"
}