{
  "id": "d1726-2",
  "text": "*\nf.\n.. ..i.ii.B. Lews Letter\nFebruary 15, 1539 lage 3\nrecording as well as being a means to prevent overcutting on\npassages of high level.\n4*. TUHLTABLE jdlVE - A synchronous motor has been found satis¬\nfactory for driving this unit. 3everal means of coupling the\nmotor to the turntable are in use; namely, belt drive, rim drive\nthrough a rubber idler wheel, and direct gear drive. The belt\ndrive and the rim drive are usually the most satisfactory from\nthe point of not introducing a rumble in the turntable, which\nshows up as a pattern in the record as well a3 being audibld in\nthe recording when low level passages are being reproduced. The\ndirect gear drive will revolve the turntable at exact speed with\nless trouble than the other two methods, but unless elaborate\nmeans are taken to filter out the gear flutter, a considerable\namount of turntable rumble'may be introduced.\n5. CUTTING HEAD - A great deal of information is usually given\nabout the frequency response of a cutting head, but very seldom\nis anything 3aid about what hapens to the frequency response at\ndifferent levels or as to what the straight line volume range\nof the cutting head is at different frequencies* In other words,\nhow linear is the cutting head at the levels encountered In ac¬\ntual recording and.what is the linear volume range. A cutting\nhead whose frequency response is linear from 50 to 5000 C.T.o,\nover a volume range of 40 DB« at usable recording levels will\nmake higher fidelity recordings than a cutting head with ia fre¬\nquency response from 40 to 1G000CC.T.3. that is not linear.\nIt is possible to lower the surface noise and turntable rumble so\nthat the maximum level on the record is 50 D3. higher than the\nnoi3e level at $6 lines per inch. A cutting head that i3 quite\nsensitive is most desirable, otherwise a linear power amplifier\nto drive it becomes quite a problem. If a cutting head requires\na level of minus 6 DB. (0 level, 6 Lw,) to record just above\nsurface noise, then it will require a level of plus 44 DB. which\nis about 150 watts to drive it to maximum recording level. If\nthe cutting heq.d requires a level of minus 16 DB. to record just\nabove noise level, then the power amplifier needs only a level\nof plus 34 DB0 or about 15 watts to drive it. The cutting head\nshould remain a linear device up to levels required to record\nmaximum volume, on the disc at 70 line3 per inch at a sustained\nsingle frequency in ordertto give maximum linear recordings of\naverage speech and music at 120 lines per inch."
}