{
  "id": "d1358-0",
  "text": "NAEB NEWS LETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nFrank E0 Schooley, Editor, Station WILL, Urbana, 111.\nNovember I, 1943\nN.A.E.B. TO .viEET AT SCHOOL BROADCAST CONFERENCE\nNAEB MEMBERS ATTENDING THE SCHOOL BROADCAST CONFERENCE WILL HOLD INFORMAL\nSESSIONS AT 10 A.Mo AND 2:30 P.Mo, SUNDAY, NOVEMBER 28 AT THE fclORRISON\nHotel, ChicagOo Already some members have (indicated their intention to\nBE PRESENT, WHILE OTHERS HAVE ADVISED US THAT THEY LL BE UNABLE TO GET TC\nTHE MEETING. THOSE IN TOWN, PLEASE MAKE A SPECIAL EFFORT TO ATTEND THE\nAFTERNOON SESSION.\nWe NOTICE ON THE PRELIMINARY PROGRAM THAT THE FOLLOWING NAEB MEMBERS ARE\nSCHEDULED TO PARTICIPATES K«IKE HaNNA, CARL “‘ENZER, AlLEN FILLER, ‘“AJOR\nHarold Kent, H„ B. McCarty, Kay Lardiie, and some staff members of the\nChicago Radio Council and WHA0\n\"EXPLORING YOUR UN I VEfiSI TYH on K N AD\nTO ACQUAINT THE PEOPLE OF KANSAS AND 8 TS ENVIRONS WITH THEIR UNIVERSITY\nAND ITS VARIOUS SERVICE TO THE STATE* THE UNIVERSITY OF KANSAS STATION,\nKFKU, offers “Exploring Your University,\" a weekly series of programs,\neach Monday evening at 9:30 o'clock. In opening this series of programs,\nDeanne Wo Malott, Chancellor of the University, said. The making of a\nUniversity is an endless process, never completed, it is a living,\nCHANGING thing—THE MOST IMPORTANT TRAD B T1 ON OF CONSTANT CHANGE. ^PLOR-\ning Your University\" offers an opportunity to become acquainted with the\nUniversity of Kansas and to keep abreast of the changes.\nThe programs will present the various deans and division heads, giving,\nTHROUGHOUT THE YEAR, A BROAD PIICTURE NOT ONLY OF THE UNIVERSITY S\nFUNCTION IN TRAINING STUDENTS UN THE ARTS, SCIENCES, AND THE\nBUT ALSO IN THE MANY SERVICE BUREAUS LOCATED ON THE CAMPUS FOR THE USE OF\nTHE PEOPLE IN THE STATE.\nDuring the month of November,, KFKU will explore six S£H0°!;S\nUniversity: the School of Fiine Arts yith Dean D. M. SiaRThout. School of\nMedicine with Dean H. R. Wah!_; the Graduate School ano the School of lay\nwith Dean J. H. Nelson amd Dean F. *». Moreau; and the school of Education\nand School of Business with Dean «J. W. Twente and Dean F. T. tock .\nEach program will feature- music by organizations ano students in the\nSchool of Fine Arts.\nCOHEN APPOINTED OWi RADIO CHIEF\nThe-Office of War Information has appointed pH,LI'’Ar?OHCJ!’H™ “£|je\"x\nDonald Stauffer as Chief oif the Radio Bureau of the 01.1. Cohen, fornix\nYEARS A RADIO PRODUCER WAS PREVIOUSLY OCPUTY CHIEF OF THC^BUREAU\nStauffer resigned. Cohen wiill handle all requ.^t\nand officials for unsponsor ED RADIO TIME. He also will scheoule ano\nallocate the time made avaiilable by radio stations for government\ninformation programs."
}