{
  "id": "d1358-1",
  "text": "NAEB NEWS LETTER. ...PAGE 2p*.«o.\nMED j CAL AND HEALTH ORGANIZATIONS COOPERATE WtTH Vl'NYC\nNovember I, 1943\nLeading public health and medical societies in Net York City cooperate with\nNew York City’s own station, V.’NYC, in the extensive program of health talks\n(more THAN 6<$ OF ALL HEALTH TALKS HEARD OVER ALL NEW YORK STATIONS ARE\nBROADCAST OVER WNYC/ DESIGNED TO SAFEGUARD AND PRESERVE THE NATION S MOST\nPRICELESS POSSESSION, IN WAR OR PEACE, THE HEALTH OF ITS PEOPLE* STRESSING\nTHE IMPORTANCE OF RETAINING AND REGAINING HEALTH, MORE VITAL NOW WITH THE\nADDED DEMANDS ON EVERYONE, AND AIMING TOWARD THE MOST ADVANTAGEOUS USE OF\nWAR-LIMITED MEDICAL FACILITIES, WNYC AND THE CITY*S HEALTH AGENCIES PRESENT\nA ROUNDED PROGRAM OF HEALTH BROADCASTS AT 11:45 A•M• WEEKDAYS, AND ON\nThursdays at 1:15 p.m*, with prominent medical, dental and welfare author¬\nities as speakers,,\nOn Mondays and Fridays the speaker for \"New York City Health Time*1 is\nPROVIDED BY THE NEW YORK ACADEMY OF MEDICINE IN COOPERATION WITH THE NEW\nYork Tuberculosis and Health Association The Oral Hygiene Committee of\nGreater New York offers advice on dental matters by outstanding members of\nTHE DENTAL PROFESSION ON TUESDAYS* Dr* JEROME PETERSON OF THE New York\nCity Department of Health gives the Wednesday talks on community health\nproblems* Thursday morning’s speaker is from the Medical Society of the\nCounty of New York, ano the alternate Saturday discussions are sponsored\nby the Bronx County .V.edical Society in cooperation with the Bronx County\nTuberculosis and Health Association, and the Kings County Medical Society*\nWNYC TO BROADCAST NEW SERIES OF EDUCATIONAL PROGRAMS\nNew York’s Own Municipal Station WNYC, in cooperation with The City College\nof New York (CCNY), and Queens College, inaugurate two new series of\nbroadcasts featuring noted speakers discussing vital wartime topics\nbeginning this week*\nOn Mondays (8:00-8:15 p.m.) starting November 15th and continuing for the\nnext six weeks, WNYC «N cooperation with the City College of New York will\npresent a series of programs entitled “The Organization of Peace • Dis¬\ncussing post-war problems will be such noted speakers as Prof* Harry J,\nCarman the-initial speaker, followed by Ely Culbertson, bridge expert and\noriginator of a plan for post-war international cooperation, Dr. Alvin\nJohnson, Prof* Harry A, Overstreet, Clark M* £»chelberger, ano Frof* Nelson\nM« Mead, speaking on successive weeks®\nTuesdays at 8:00 p.m*, beginning November 9th, WNYC in collaboration with\nQueens College presents the first in a four-week series of broadcasts\nentitled “Victory Begins at Home“* Rex Stout, noted author, traveller and\nlecturer and member of the Writers Wap. Board, together <»ith Mr* °on Lef.ch\nof the v;Ar Pood Administt ation, and Miss Eula Corbin, well-known ex ert\nnutritionist, will be heard on the second program of the series on November\n16th (Tuesday, 8:00 p*m*) discussing “Food Prospects and Food Us_s ,\nNOTES FROM HERE ANO THERE\nwha reports that Mac McCarty is back to run things on the radio end of\nTHINOS oS Th™IS«»HSIN CAMPUS.... JERRY BaRTELL, WHA, HAS BEEN COMMISSIONED\nIn enI.cn ™ the Bos Dick, formerly WHA, y-as a recent caller and\nANNOUNCER ON WIU_.BILL HaRLEY MAY GO INTO THE SERVICE ONE OF THESE"
}