{
  "id": "d812-42",
  "text": "ASSOCIATION FOR EDUCATION FY RADIO-TELEVISION\nAERT is one of the organisations which sponsors the Joint Committee\non Educational Television, In this way, A^ET endorses JCET activities which\nhave to do with trends, statistics, developments across the nation In the\nestablishment of stations scheduling workshops, engineering, and program\ndevelopments, and so on in the ETV field,\n■* * *\nNATIONAL OFFICERS\nLEO A, l.ARTIN, President; chairman, Division of Communication Arts, Boston\nUniversity, Boston, Nassachusetts.\nER7ARD STASFL'FF, First Vice-President; professor of speech. University of\nMichigan, Ann Arbor,\nMRS, GERTRUDE G* BRODERICK, Second Vice-President; radio-TV education\nspecialist, U,S, Office of Education, Washington, D.C*\nARLENE FcXELLAft, Secretary; associate director, Wisconsin School of the Airs\nUniversity of Wisconsin, Nadison,\nREVi RICHARD F. GRADY, Treasurer; manager, Station 7/USV, University of Scran¬\nton, Scranton, Pennsylvania,\nDIRECTORS AT LARGE\nT.ALTEP P. FiEHY, consultant. Joint Committee on Educational Television, Wash-\nington, D.C, < 9\nJAM*! F. UacAFPRE’., director of broadcasting. Board of Education by Kw Tori.,\nOALE R. ADKIT’S, director. Bureau of Research in Education by fedio-TV, Uni¬\nversity of Texas, Austin. \"\" ’\nHASKELL BOTTER, director of radio education. Station ’‘ABE, Board of education,\nAtlanta, Georgia. 9\nREGIONAL DIRECTORS\nMARTHA GABLE, Forthoastem; assistant director. School and Community Rela-\n. mtI?\"s»\";?ladGlphia, Pennsylvania, Board of Education.\nrwr ' n^vW’ South.oaD!'erni director of public affairs and education, Station\nWEAL, Baltimore, LaryXand*\nE‘.FLI.CK’ rfst c«ntrnl; director, Radio-Television Section, University\noi rebraske, Lincoln* J\nKATHERIKE HATCHETT, Groat Lakes; Station V.BOE, Cleveland Public Schools,\nCleveland, Ohio«\n^College 'tubb^*’ Southwestorn5 director of radio, Texas Technological\n''\"school?^ rlCKLK”J Pacifl° Northwest; teacher, Portland, Oregon, Public\nKMTETH HASATJOB, Pacific Southwest; chairman, Department of Telecommunica-\ntions. University of Southern California, Los Angeles."
}