{
  "id": "d812-45",
  "text": "TO BECOME A MEMBER OF A NATIONAL ORGANIZATION\nEducation by radio is here to stay.\nThe teaching profession and the radio industry need a professional organization to expand the useful¬\nness of this infant, challenging art.\nfit the Twelfth Institute for Education by Radio in Columbus, Ohio nineteen workers in radio education\nheld an informal meeting. They represented, broadly, the field of educational radio interests. They\ndecided to propose to the workers in educational radio the building of an Association for Education by\nRadio.\nWhy?—for seven specific and a host of less tangible but equally important reasons. Here are the seven:\n1. Rapid increase in the ranks of educational radio (approximately 3500 workers in schools, col¬\nleges, stations and associations) creates a need for the trading of experiences.\n2. With foundation grants decreasing, education by radio must fend for itself; we can fend better,\nshoulder to shoulder.\n3. Teachers working in radio and station education directors can secure more recognition for their\nwork if they are members of a strong organization.\n4. Excellent as the Columbus and Chicago meetings are, some all-season center is needed to\nbridge the months between these educational radio \"old home” weeks.\n5. Radio educators unable to attend these meetings deserve encouragement and services that an\norganization can provide.\n6. Only an organization can, at this stage, build up a strong periodical much needed to promote\nand exchange ideas.\n7. There is no Radio Department in the family of the National Education Association. This or¬\nganization will seek such membership.\nPURPOSES OF THE ASSOCIATION FOR EDUCATION BY RADIO\nThe organization of a group under the above title contemplates certain purposes among which are the\nfollowing:\n1. Development of an instrumentality through which persons interested in education by radio\nmay have adequate communication.\n2. Cooperation with the Institute for Education by Radio, the School Broadcast Conference, the\nUnited States Office of Education, and other institutions and groups interested in education by\nradio.\n3. Representation of the interests of education by radio in connection with pertinent legislation,\ncommission hearings, conferences and the like.\n4. Encouragement of experimentation and research and widespread dissemination of findings.\n5. Publication of a news, information and idea service on a periodical basis.\n6. Establishment of this association as a recognized professional voice for those engaged in edu¬\ncational radio activities in civic, religious and educational groups and in the radio industry.\n7. Advancement of such fields as teaching, workshops, documentary radio, educational frequency\nmodulation stations and equipment.\n8. Development of a practical program of promotion of national morale in cooperation with official\nagencies.\n9. Ultimate inclusion in the National Education Association as a member department."
}