{
  "id": "d812-68",
  "text": "FOUR\nBETTER BROADCASTS NEWS LETTER\nOCTOBER 1, 1953\nSome TV Standards\nIn gathering information for his “Tele¬\nvision and Education in the United States,”\nDr. Charles A. Siepmann asked television\nnetworks what they mean by education and\nwhat their relation is to it. He got this\nresponse from NBC, to quote a small part of\nit from the book:\nEducation may be taken to mean \"the\ntotal process by which the individual is\nbrought toward informed adjustment to his\nsociety . . . The materials of reality, of cur¬\nrent affairs, history, the sciences, the hu¬\nmanities, are inexhaustible and fascinating.\nThe people of our country have an appetite\nfor such materials beyond our ability to\npredict; ... We feel that . . . our total\nprogramme output on all hours of the day,\non all days of the week, over the years,\nmust serve the ends of education in the\nbroad sense indicated by our working de¬\nfinition . . . Negatively, we are convinced\nthat no programme may be excused for\ncontributing to the vulgarization of our\nviewers, and we have set up stringent pro¬\ncedures to examine, in advance of broad¬\ncasts, not only scripts but also costuming,\nmovement and characterization which might\noffend the home and audience.\n“We are working under a long term and\nwell considered plan to involve every pro¬\ngramme we have in the task of enlighten¬\nment. This means that we count as partners\nin the task advertisers, advertising agencies,\ntalent agencies, stars, writers, producers,\ndirectors and all engaged in the process of\nproduction.”\nThis is a remarkable statement of policy.\nAny network or station that announces such\na policy should have the active help of the\npublic in living up to it. A letter of appre¬\nciation for a definite program of high qual¬\nity from individuals would help maintain\nhigh quality, especially if the letter were\nheartwarmingly specific about why the\nprogram was fine. Telling friends about its\nhigh points will help to build an audience\nfor it, and so keep it on the air. If a letter\nis to state that some phases of a program\nmight be improved, it would be well to begin\nwith a compliment on the good points.\nDr. Siepmann is Chairman of the Com¬\nmunications Department of New York Uni¬\nversity. The book (125 pp., $1.00) was\nrecently published by UNESCO, and it is\navailable from the Columbia University\nPress.\nEducational Television\nThe Resolutions adopted at Minneapolis\nfor 1953-1954 state that the American Coun¬\ncil for Better Broadcasts will “work to ob¬\ntain and support education television sta¬\ntions—and by its efforts and encouragement\nassist to make educational television pro¬\ngrams of compelling interest and value.”\nAs we work in our different areas, one\ngood source of advice will be the Joint\nHelps in\nHave you heard several commentators on\nthe same day talking about the same news?\nA year ago De Alton Neher recorded such\nexcerpts on tape (25 minutes). It is an ex¬\ncellent spring board for discussion. It can\nbe had for the cost of tape, dubbing, and\nsending. But order well in advance.\n“The Listener Speaks Again,” 2,000\nwords, 1953. (10c) suggests standards for\nprograms. It was prepared by the San\nFrancisco Branch of the AAUW, 1840\nCommittee on Educational Televson, 1758\nMassachusetts Avenue, N.W., Washing¬\nton 6, D.C. It also sometmes sends out\nspeakers to meetings on Educational TV.\nAnother source of help is the National\nCitizens’ Committee for Educational Tele¬\nvision, Ring Building, Washington 6, D.C.\nIt has a 16mm. 25-minute film, “New Vision\nfor Television.” If you want to show it,\nwrite for it well in advance. It is popular.\nYour name on its mailing list will bring\nyou its monthly News Bulletin, which car¬\nries encouraging stories like these:\nWILMETTE\nIn Wilmette, a suburb of Chicago, three\nwomen, led by Mrs. Leighton Cooney, head¬\ned a drive to raise money for Chicago’s\nChannel 11. They roused the whole com¬\nmunity. One man offered the use of his\nprinting press. Another gave paper. A\nclergyman offered the use of the mime¬\nograph. Two publicity writers offered their\nservices. Children in a parochial school\nwrote a play contrasting present TV with\nwhat they hoped educational TV would be.\nOne leader said: “This pioneering was\nbased on faith in the leadership of the uni¬\nversities, colleges, museums and cultural in¬\nstitutions, and faith that within these in¬\nstitutions were knowledges, skills, and un¬\nderstanding which might now be shared\nwith many people.”\nSEATTLE\nIn Seattle the owner of a commercial TV\nstation Mrs. A. Scott Bullitt, sparked edu¬\ncational television. First she scheduled suc¬\ncessful educational programs on KING-TV.\nAfter two years, she said, “We realize from\nour experience that there are natural limit¬\nations to the ability of a commercial-station\nto serve fully and adequately the educa¬\ntional requirements of a community.”\nShe gave the Citizens’ Committee for\nEducational TV, television equipment val¬\nued at $182,000. The fund-raising cam¬\npaign went forward. Seattle has now made\napplication for an educational television\nchannel.\nNEW ORLEANS\nIn New Orleans, where a commercial\ncompany asked the FCC to set aside the\nreservation for educational use of a chan¬\nnel and open it to commercial use, citizens\nwere roused. They asked the FCC to deny\nthe request, an action which it has now\ntaken.\nThe Federal Communications\nCommission\nThe FCC has its problems. It consists of\nseven commissioners with a staff too small\nfor the work that needs to be accomplished.\nCongress established it, told it to grant li¬\ncenses to stations that would “operate in\nthe public interest, convenience, and neces¬\nsity,” but has never given it a large enough\nstaff to review stations’ past performance\nto see whether they kept their promises to\noperate in the public interest.\nThe public should consider definitely\nwhat its interests are. For instance, here\nis a question.\nNewspaper, Radio, AND Television?\nSwamped by applications for TV chan¬\nnels, the FCC has been making decisions\non licenses for channels for which there\nwas no contest. Now it will consider cases\nin which two or more applicants want the\nsame channel.\nOther things being approximately equal,\nwill it lease such a channel to applicants\nowning a newspaper or a radio station or\nboth? Or to those not already possessed\nof one or more means of mass communica¬\ntions?\nDifferent members of the Commission\nwithin the last six months have given dif¬\nferent answers—1. that in such cases it fa¬\nvored those with no radio station or news¬\npaper: 2, that such ownership would make\nno difference with the Commission’s deci¬\nsions. It is not a question of absolute mon¬\nopoly of opinion-forming facilities; for-one-\ncan subscribe to magazines and papers with\ndifferent opinions. The real question, one\nwe should consider most carefully, is this:\nWill ownership of newspaper, radio and\ntelevision (perhaps the only newspaper, ra¬\ndio and television in the area) determine at¬\ntitudes of the majority, so that the owners\nof the mass media will, in effect control\nelections, the passage of bills in legisla¬\ntures, etc?\nFrequency of Licensing\nThe FCC has decided, with one dissenting\nvote, that the licenses of TV stations may\nbe renewed every three years (as with radio\nstations) instead of every year, as has been\nrequired for TV. The reasons given for the\nchange were time saved for the FCC and\ntrouble saved for the telecaster.\nCommissioner Frieda B. Hennock gives\n“the public interest\" as her reason for dis¬\nsenting. For fourteen years, she explains,\nradio stations were licensed every year, till,\nin 1941 the Commission concluded, to quote\nthe FCC, that “the broadcasting industry has\nreached a point of maturity where it ap¬\npears advisable to increase the license per¬\niod to two years.” In 1943 it was in¬\ncreased to three years. Commissioner Hen¬\nnock points out that television is relatively\ninexperienced. With more than 400 TV\nstations licensed since the freeze (15 months)\nthe television industry has not attained ma¬\nturity. Furthermore, the FCC has not had\nthe opportunity, in one year, to review the\nstation's, programming to determine whether\nthey are serving the public interest.\nTo quote the Commissioner, \"My dis¬\nagreement stems from the majority’s iden¬\ntification of the ‘public interest’ with the\nconvenience of broadcast licensees, rather\nthan with higher public interest considera¬\ntions.”\nEvaluation and Discussion Groups\nClay St., and may be ordered from the\nBranch.\n“The Radio Listener’s Bill of Rights,”\n1947, by Charles A. Siepmann, gives the\nset-up of radio in the United States and the\nreasons why the people can have influence\non it. 17,000 words, 20c. Anti-Defamation\nLeague, 212 Fifth Ave., New York 10, N.Y.\n“Let’s Learn to Look and Listen,” revised\n1952. Experts suggest how to evaluate\ndifferent types of programs. 35,000 words,\n50c.\n“En;oving Radio and Television,” revised\n1952. Suggestions for discussion groups in\nevaluation and for writing letters to sta¬\ntions. 35,000 words, 50c.\nFor the last two, write Mrs. Gerald Muel¬\nler, Eagle Heights, Madison, Wis.\nAny of these are good for group dis¬\ncussion or for individual reading.\nThese “Better Broadcasts Newsletters”\nare a bonus for ACBB membership, $1.00 a\nyear for individuals Mrs. C. B. Chambers,\n3480, 7th Ave., N., St. Petersburg, Florida."
}