{
  "id": "d1746-1",
  "text": "NAEB NEWS LETTER...•March 1, 1940...Pag© 2\nstudios and the Washington Hotel where Chamber of Commerce, Kiwantss\nand other important banquets of the community and college are held.\nIt is our intention to broadcast as many of these addresses as\npossible that are given before service clubs and other organizations,,\nAlso* when outstanding individuals visit the town and college and\nmake the hotel their headquarters, we shall endeavor to interview\nthem from the hotel.\n\"KWSC, beginning this semester, is broadcasting an additional hour\neach day and is now on the air seventy-seven hours each week, or\nalmost thirteen hours each week day* The schedule is from 6{45 a.M.\nto 8:00 A.M. and from 10:00 A.M. to 10:00 P.M. with the exception of\nThursday when we leave the air at 7:30 P.M. KWSC shares time with\nKTW, Seattle, and does not broadcast or; Sundays, holidays, or on\nThursdays after 7:30 P.M.\n\"Incidentally, as part of the early morning period from 6:45 to\n8:00 A.M. we have a request program which is bringing in between\n350 and 400 pieces of mail weekly. In addition to the requests,\nthis program features market quotations, news items, weather fore¬\ncasts, and frequent time signals.\n\"Since we have increased our nighttime power to 5,000 watts our\nmail relating to evening programs has increased a great extent.\nLocated as we are in the extreme eastern part of the state, we have\nnever been able to serve the west side effectively because of the\nmountain range which separates us. However, we are now receiving a\nnumber of cards and letters from farmers and other residents of the\nwest side commenting on our agricultural broadcasts, current events,\nand programs of classical music.\n\"Mr. Hugo L. Libby, Chief Engineer, attended the engineering confer**\nence held at Columbus from February 12 to 24.\"\nHURRAY FOR SULZER AT KENTUCKY, TOO\nDid I say no one ever wrote. Pardon me. Here is news about the\ndoings of Elmer Sulzer* Let the Courier-Journal of Louisville tell\nthe - story:\n\"Lexington, Ky., - Informed that the Federal Communications Commi¬\nssion had granted the University of Kentucky a construction permit\nfor a new non-commercial educational broadcasting station to operate\nfrom Beattyville, Elmer G. Sulzer, the university?s director of\nradio activities, said the transmitter probably would be moved to\nBeattyville within th© next two weeks.\n\"After the transmitter is installed, Sulzer said, tests will be\nconducted for another two weeks before the station can begin operat¬\ning® It will be an experiment, he said, as ultra high frequency\nbroadcasting, such as to be done from the Lee County station, never\nbefore has been tried in mountain topography. Th© transmitter will\nbe furnished by WHAS, he said.\n\"The Lee County Board of Education, Sulzer said, will furnish the\noperating personnel for the station, and the university will furnish\nthe be*Vtrry receiving sets, which have been developed at the univer¬\nsity during the last eighteen months."
}