{
  "id": "d1746-1",
  "text": "iM.A.E.B, News Lett er, May 1* 1939\nPage 2\nRECORD PRESSING POPS\nAbout a year ago we ran information regarding pressings made by Clark\nPhonograph Company and by Germett Company, in Richmond, Indiana, Allied\nRadio Corporation, of Chicago, lias recently published a booklet which\nincludes prices for duplicating instantaneous recordings.. The company\nwill be.glad to send you a copy of this booklet, “The Essentials of\nRecording.1*, if you will simply write for it, We understand that the\nRCA Manufacturing Company may inaugurate a pressing service for instan¬\ntaneous recordings, but is not ready to make any public announcement at\nthis time. When the information is available we will include it in the\nNews Letter,\nTHE FEDERAL RADIO EDUCATION CdRITTSE\nDr. Leonard Power has been appointed assistant in charge of reception\nfor the Federal Radio Education Committee, according to announcement\nmade by Dr, John W0 Studebaker, United States Commissioner of Education\nand Chairman of the FREC t\n»Dr, Power will undertake to crosscuts the studies for the Committee\nwhich have been assigned to the Office of Education, Department of the\nInterior, These studies are: A survey of successful cooperative efforts\non the part of broadcasters and educators, another on teacher training,\nand a third on the develooment of an experiment and the idea exchange.\nIn addition, Dr. Power Is expected to serve as coordinator of all re¬\nsearch studies which are being undertaken by the Federal Radio Educa¬\ntion Committee.\n^Preliminary plans for publishing the committee studies were discussed\nin some detail by the Executive Committee* It is expected that the\nfirst publication will be ready In November of this year,\ni'Iu addition to the appointment of Dr, Power, the Executive Committee\nof FREC also approved Dr. Studebaker? s recommendation that his Assis¬\ntant, Dr, 01 F.'Klinefelter, continue to serve as Vice Chairman of the\nFREC, in charge of finances and other general duties, and the designa¬\ntion of hr. William D. Boutwell, as assistant In charge of the Educa¬\ntional Radio Script Exchange and Services\nMSCHOOLS INVADE RADIO STATIONS* BUSINESS .FIELD8*\nThe Chicago Tribune recently carried an article which some of you nay\nhave overlooked. It reads:\n“Many radio stations, operated by so-called educational interests, are\nrapidly broadening their campaigns and are seeking further fields to\nconquer* Three trends arc apparent:;\n*lc These stations are demanding possession of select broadcasting\nchannels,\n»»£0 They are asking higher power permits,\n»3# They arc going more and more into the business of selling radio\ntine to advertisers."
}