{
  "id": "d1746-2",
  "text": "NoA*EoBc News Letter, May 1939\nPage 3\n>\n“Station WHA, operated by the University of Wisconsin at Madison, has\napplied to federal authorities for the 670 channel, now owned by WMAQ,\nin Chicago. It has also demanded that it be allowed to Increase its\npower to 50,000 watts, the highest granted any station in this country.\nStation VvWL at New Orleans, conducted by Loyola University as a commer¬\ncial institution, already has 50,000 watts.\n“Charges have been made that the WHA demands were backed by the politi¬\ncal machine of Gov. Phllio LaFollette, who desired a powerful outlet for\nthe propaganda of his third party movement. The present governor of\njf~ Wisconsin, Julius P. Hell, has requested a delay to study the applica¬\ntion. A stay of sixty days was granted by the federal communications\ncommission.\n“The League of ’Wisconsin Stations has protested against the confiscation\nof the WI4A4 channel, holding that WHA has no need for a full power station\nif it intends only to spread educational Information to the peoole of\nWisconsin. It was pointed out that the university does not use all the\ntime granted It under its present license.\n“Acute observers believe a dangerous precedent would be established If\nthe Wisconsin demands are met. They reason that if WMA'4 can be taken\nfor the university9s benefit, other state institutions could seize the\nrest of the best channels. With such a start, it would not be difficult,\nthese observers hold, to go a steo further and establish government\nbroadcasting.\n“Some of the educational broadcasters do not sell time. WILL, at the\nUniversity of Illinois, and WMBI, at the Moody Bible Institute, are\namong them. So far WHA also has refrained from paid advertising.\nOthers are frankly in business, seeking revenues from sponsors.\n“An unusual situation develooed at Cornell University, Ithaca, N.Y, It\nowned station WESG. Since the communications commission requires that\nall broadcasting time under the license be used, and since the xmiyer-\nslty did not want that much time, it leased its station to commercial\nInterests and reserved only the hours it wanted.\n“WAPI at Birmingham, owned by Alabama Polytechnic institute and Alabama\nState University, was also leased several years ago^ to conmercla_ opera¬\ntors, A sookesman for the institutions said that tnere were not suf¬\nficient funds for good programs and that quasi-commercial operation was\nunfair to the other stations of the state.\n\"There is nothing In the radio regulations to prevent any educational\nInterest with a radio station from engaging in commercial activity.\nAmong the educational institutions that do sell time and their stations\nare;\n\"St. Louis university, WEW; Georgia School of Technology, Atlanta, ..GST;\nRensselaer Polytechnic Institute, Troy, N.X.,t¥HAZ; St. Norbert Col-ege,\nGreen Bay, Wis. ,WHBI and WTA'.J; University of Florida, WRUF; University\nof North Dakota, KFMJ; Port Arthur College, Port Arthur, Tex., KrAC; and\nJohn Brown University, Siloam Springs, Ark., KU0Ao"
}