{
  "id": "d1746-2",
  "text": "NAEB NEWS LETTER.•.*MARCH lf 1940...Pag© 3\n\"The new system, he continued, ’may revolutionise educational broad¬\ncasting*. He said the two-hour Monday-through-Friday programs,\nstarting at noon, would be divided into thirty-minute broadcasts\ndirectly to the schools of the county, fifteen minutes of news,\nfifteen minutes of agriculture, fifteen minutes of a program to be\ncalled ’’The Lee County Family”, and forty-five minutes rebroadcast\nfrom the university.\n’’The period from noon to 1 o’clock will bo devoted to adult\ninterests, the remaining period intended for the county schools, but\nwill be patterned to appeal to adults as well. Programs will be of\na civic, educational, agricultural and entertaining nature.\n\"The station will operate on 100 watts power, unlimited time.\n’’The university plans to equip between fifty and sixty mountain\nschools in Lee County with receivers. It will retain ownership of\nthe equipment, and will supervise the operation through the Lee\nCounty Board of Education. The school board, for its part, will\npay operating expenses, including the salary of a supervisor, who\nwill promote the use of the service by communities and schools\nadjacent to the area.\n\"In 1933 the University of Kentucky established a system of remote\nlistening centers where people could hear educational radio programs\nof standard broadcast stations. On the basis of results, the\nuniversity feels that there is need for establishment of a system\nby which localized education and information, both for school\nchildren and adults, should be provided for in each of the mountain\ncommunities.\n\"This makes the third institution which has taken advantage of the\ntwenty-five-amplitude modulated channels set aside for non-commercial\neducational broadcast purposes. The others availing themselves of\nthese frequencies are WBOE, operated by the Cleveland Board of\nEducation, and WNYE, by the New York City Board of Education?\nMAC GREGOR EDUCATIONAL TRANSCRIPTIONS AVAILABLE\nC0 P. MacGregor, well-known West Coast radio producer, has announced\nthat he is offering schools and colleges 130 of his finest.recorded\neducational features. Thes© transcriptions have been selected by\nDr. Cline M. Koon from the Ma&Gregor library of more than 5,000\nprograms. Dr. Koon is a nationally known authority in education\nand formerly was Senior Specialist in Radio and Visual Education in\nthe United States Office of Education.\nA special rate will be made to the educational stations. Watch for\nit in the March 15th News Letter. In the meantime, if you haven’t\nseen the 1940 Catalogue of MacGregor Educational Transcriptions,\nwe’d suggest you write for it. Address: 729 South Western Avenue,\nHollywood, Calif.\nRADIO TRAINING AT FLORIDA\nThe University of Florida has just issued a bulletin of information\non Radio Broadcasting Training. Among the professional courses in\nradio broadcasting available to the Florida students are Radio"
}