{
  "id": "d1746-4",
  "text": "NAEB NEWS LETTER.•.MARCH 1, 1940...Page 5\nStation managers and program directors generally prefer to have\nforums managed by a non-partisan citizens* committee which repre¬\nsents the various political, economic* and social Interest groups\nin the community, the survey indicated.\nThe Federal Radio Education Committee report emphasizes that\nleadership is being offered by national educational, agricultural,\nchurch, and service organizations to promote public affairs education,\nthat public interest has been aroused, and that the radio industry\nhas an opportunity to capitalize upon this cooperation and interest\nby producing significant and effective educational programs.\n\"I know of no better way to meet the ever increasing need of our\npeople for free and impartially-managed programs of public discussion\"\nsaid FREC Chairman Studebaker today, \"than through hundreds of local\nradio forums, town meetings, and round-table programs giving to the\n82 percent of the families in the United States now reached by radio\nat least the opportunity to get practical help in the choices which\nmust be made if our system of Government is to endure. It is not\ntoo much to hope that in the near future no radio-equipped home in\nthe length and breadth of the land will be without available programs\nin which its members can get up-to-the-minute discussion of local,\nregional, and national problems.\"\nCopies of the Federal Radio Education committee report, \"Forums on\nthe Air\", may be obtained at 25 cents each through the Federal Radio\nEducation Committee, U. S. Office of Education, Washington, D. Co\nOFFICE OF EDUCATION RADIO DIVISION SERVES NATION\nOn occasion of the fourth anniversary of the establishment of radio\nservices by the U. S. Office of Education, Commissioner John W.\nStudebaker said that he is more convinced than ever that radio is\nrapidly becoming one of the most important tools for the quickening\nand enriching of education. At the same time he announced a new and\nexpanded program of radio services and experimentation for the current\nyear*\nPresentation on the air as a live broadcast Is on$y a \"premiere\"\nfor the U.S. Office of Education programs. Hundreds of performances\nby schools, colleges and civic groups by local stations follow. This\nis made possible by the Script Exchange in the U. S. Office of\nEducation which lends scripts for local, noncommercial use and makes\navailable recordings at low cost. The Federal Radio Education\nCommittee, created by the FCC to promote improved broadcaster-\neducator relationships, sponsors this educational service.\nThe Script Exchange preserves outstanding scripts produced not only\nby the U. s. Office of Education but also by other Government agencies,\nas well as those of local educational groups. Now in its fourth\nyear, the Script Exchange has made available more than 250,000 copies\nof scripts to some 12,000 groups in all parts of the country.\nPrevious U. S. Office of Education series now circulating through\nthe Script Exchange are the WORLD IS YOURS (Smithsonian Institution\nseries), BRAVE NEW WORLD (Pan-American Series), LET FREEDOM RING (the\nstory of the Bill of Rights), AMERICANS ALL — IMMIGRANTS ALL (contri¬\nbutions of racial groups to the Nation), WINGS FOR THE MARTINS"
}