{
  "id": "d1746-4",
  "text": "Page 5\n0A«EoB« News Letter, May I, 1939\nLeake further comments on the series of programss \"On alternate weeks\nInstead of the dramatic presentation, the Sooner Family, the speaker\nchooses a panel to give a further discussion of the subject of the talk.\nMost of the speakers have chosen people who represented the different\nviewpoints In family life - parents, teachers, university students, high\nschool and even Junior high school people * Some of the scripts have\nbeen extremely well worked out. On the whole, I think the program has\nbeen well worth while. It *8 had wide publicity and I think has been\nsuccessful,\"\nEDUCATION AND THE PUBLIC\nVi(e reprint here a clipping from “In Hollywood,\" a column by Jimmie\nfldler, which we thought you might like to read;\n\"The most significant development in the picture business - from the\nviewpoints of both producers and fans - is taking place in the short\nsubject field* At long last, Hollywood is discovering that the public\nwants pictures witn an \"educational\" slant, and that, for Hollywood,\nwhich has always regarded anything containing educational value as\nanathema, is a very great discovery, indeed,.\n\"Warner Bros* and Metro-Goldwyn-Mayer have been leading the parade - the\nfirst witr* its patriotic shorts, the latter with a series of really re¬\nmarkable one and two-reelers depicting the drama of science, medicine,\nand biography.\n\"I happen to know that both studios undertook those programs with fear\nand trembling, so ivell-rooted was the fllmville belief that the great\nAmerican public had a 12-year-old intelligence, and therefore could not\nappreciate anything more profound than boy-meets-glrl slush.\n\"Never has any fallacy been more thoroughly exploded. I have yet to see\none of these short subjects in a theater where the audience did not\nexpress approval with a storm of enthusiastic apolause.\n\"The reception that you . . * and you . . . and you . . . have given\nthe shorts is resoonslble for the new cycle in feature production.\nAt least half-a-dozen full-length supers have been made from subject\nmatter first tested in briefles. Dozens more are scheduled.\n\"It must ben an awful shock to the old-tine producers*\""
}