{
  "id": "d1746-7",
  "text": "NAEB NEWS LETTER..•MARCH 1, 1940...Page 8\nconfers upon petitioner a monopoly of the radiobroadcast facilities\nin the community which it is now serving.\"\nWOT0, City of New York* Municipal Broadcasting System* New York City •\nThe application of WNYC requesting authority to increase time of\noperation from daytime local sunset at WCCO, Minneapolis* to specified\nhours (6 A.M, to 11 P.M.* EST)* on frequency 810 ko, which has been\ndesignated for hearing, will be heard on the following issues at a\ndate to be set: (1) To determine whether or not the Commission’s rules\ngoverning standard broadcast stations, particularly Secs. 3.22 and\n3.25 (Part III), properly applied, preclude the granting of the\napplication; (2) to determine the nature, extent, and effect of any\ninterference which would result should the applicant’s proposed station\noperate simultaneously with WCCO and WGY; (3) to determine the nature,\nextent and effect of any interference which would result should\napplicant’s proposed station operate simultaneously with WGY,\noperating as proposed in its pending appl. or with WHAS, operating\nas proposed in its pending application; and (4) to determine whether\nthe DA system will comply In all respects with Sec. 3.45 of Standard\nBroadcast Rules and requirements of good Engineering Practice. (Jan.50)\nWTAW, Agricultural & Mechanical College of Texas College Station, Tex.®\nGranted construction permit to install new antenna and move trans¬\nmitter from E.Z. Bldg. College Station, to College Station, Tex.(Feb.6)\nKFUO, Evangelical Lutheran Synod of Missouri, Ohio and other States,\nClayton, Mo. - Granted special temporary authority to operate from\n1:00 a.m. to 3:00 a.m. CST with power of 1000 watts on March 9, 1940,\nin connection with a DX program. (Feb. 10)\nW0I, Iowa State College of Agriculture & Mechanic Arts, Ames, Iowa -\nGranted special temporary authority to operate from 7:00 p.m. to\n9:45 p.m. CST on March 16, 1940 in ordei’ to broadcast State High\nSchool Basketball Tournament Games only. (Feb«JL0)\nWCAD, St. Lawrence University, Canton, N.Y. - Granted special\ntemporary authority to operate from 3:00 p.m. to 4:00 p.m. EST on\nFebruary 18 and 25, 1940, in order to broadcast program prepared by\nthe American Association of University Women, St. Lawrence County\nBranch, (Feb. 10)\nWBAA, Purdue University, West Lafayette, Ind. - Granted special\ntemporary authority to operate from 7:15 p.m. to 10:00 p.m. CST\non February 10, 12, 17, 19, 24, 26, 1940, and from 7:00 p.m. to\n11:00 p.m. CST on February 21, 1940 and from 6:45 p.m. to 10:30 p.m.\nCST on February 29, 1940 in order to broadcast basketball games and\nGolden Gloves Tournament only. (Feb. 10)\nWRUL, World Wide Broadcasting Corp„, Boston, Mass., Granted\nconstruction permit to make changes in equipment and increase power\nfrom 20 kw to 50 kw at International Broadcast Station WRUL; present\nassignment 6040, 11730, 11790, 15130, 15250, and 21460 kc (Shares\n6040 kc with WDJN, 11730 and 15130 kc with WRUW, unlimited time on\n11790, 15250, and 21460 kc).(Feb. 13)"
}