{
  "id": "d1766-4",
  "text": "SCHOOL OF THE SKY—-SECOND EDITION\nIt's school time again and as we go to press, the\"Indiana\nSchool of the Sky” takes to the air-waves for its second year of\nbroadcasting to the schoolrooms of Indiana and neighboring states.\nThe first year had not drawn to a close before George Johnson\nwas lining up the experts {and those so-called) making plans for a\nbigger and better 48-49 series. What they all came up with looks\nlike this: . Q\nMonday-Book Series for grades 4^to 8\nTuesday —-Music Series for grades 6 to 10\nWednesday-History Series for grades 6 to 10\nThursday—Science Series for grades 9 to 12\nFriday-Vocational Guidance Series for\ngrades 9 to 12\nHeadouarters were set up in the basement catacombs this summer,\nand while some folks were enjoying the beauties of summer, swarms of\nresearch assistants, writers and publicity people worked and wilted\nin the hopes of turning out a better than ever before Series. As.\nyou can see from the above schedule, we’ve grown up this year to in¬\nclude programs especially designed for the secondary schools. Our\nbroadcast outlets thus far include, WSHA, Bloomington; WCSI, Columbus;\nVBOW-FM, Terre Haute; WJOB, Hammond; W0W0, Fort Wayne. The list is\nstill growing. Broadcast time is still 2:15 every afternoon for those\nstations which take us live, and transcriptions are furnished by the\naudio-visual laboratory to those stations who schedule us for other\ntimes. There are twenty-six shows in each Series,.and Fred Gerber,\nafter establishing a basic format for each, has tried to keep the\nscripts and presentations as flexible as possible. This means that\nthis year there are no Mr. Ben's or Story Lady's, but a continually\nchanging groun of characters making their contribution in whatever\nway the writers think best in order to present the material most\neffectively,\nThe \"School of the Sky\" has attracted much attention and favor¬\nable comment from educators and commercial radio people all over the\ncountry. Wo really think we’ve got something which.is not only a\nworthwhile educational feature, but is good entertainment too.\n*******\nAUDITIONS\nWe didn’t rely on Daily Student ads to bring our talent to us\nthis year, Fred Gerber, that old \"School of the Sky\" man went out\nafter the young hopefuls during enrollment week at the Fieldhouse\nwhen they were too confused by the masses of paper being thrust at\nthem to know what they were doing. At any rate, Fred’s ambitious\nscheme paid off dividends to the tune of about 500 prospective actors,\nwriters, and technicians. They and we h vs been falling all over .\neach other at the studio for the past two weeks. It got so confusing,\nthe staff were auditioning each other. With about 200 people yet to\nlisten to, we’ve already signed up some really good people (contracts\nand salaries to be discussed later we tell ’em—-and they believe us\nyeti) Well, we may not make much money, but we have a lot of fun.\n***********\n-6-"
}