{
  "id": "d1243-0",
  "text": "NEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. 28, NO. 8 AUGUST, 1963\nNETRC to Leave Radio\nTV alone will occupy the NETRC in the future, reportedly\nbecause the Ford Foundation has so requested. Most affected\nwill be the eight stations along the East Coast forming\nNETRC’s FM network, the ERN. Formal program service\nover the ERN began in October, 1962.\nAs we go to press, ERN affiliates and NAEB and BFA\nrepresentatives are meeting in Washington to discuss the fu¬\nture of educational radio networking in the U. S.\nZIP Codes tor NAEB\nWashington, D.C., 20036.\nUrbana, Illinois, 61803.\nWestern Radio-TV Conference Releases Program\nThe steering committee for the 1964 Western Radio and\nTelevision Conference has released the advance program for\nits meeting in San Francisco, February 26 through 29. Pre¬\nceding the conference itself will be a one-day symposium on\n“Television as a Means of Instructional Communication,” pre¬\nsented with the assistance of the Los Angeles and San Fran¬\ncisco chapters of SMPTE.\nSession topics are: “For a Third Dimension: Guts or Gim¬\nmicks” (the program element that gives meaning . . . in-\ntellectualism vs. showmanship, eggheadism vs. entertainment—\nis it either/or, or a proportion of both?); community sup¬\nport for radio and TV stations; radio and TV as educational\nmedia; “The ‘Left,’ the ‘Right,’ and a Medium Between”\n(ability of the broadcaster to steer a course between extremes\nof thought); illustrations of specific uses of radio and TV\nin instruction; illustrations of specific public interest broad¬\ncast presentations-; “Assessing Instructional Needs for Tele¬\nvision” ; and a study of the radio and TV professional train¬\ning program at San Diego State College. In addition one ses¬\nsion will be devoted to addresses by Gary Steiner, author of\nThe People Look at Television, and Paul Lazarsfeld, author\nof the previous study, The People Listen to Radio.\nCompetitions\n• Musical Competition of Prince Rainier III of Monaco.\nEntries to be received not later than April 1, 1964. Three\nprizes—for an original piece of chamber music, for an or¬\nchestral work, and for a scenic musical work. For infor¬\nmation, write: M. le Secretaire General du Prix de Compo¬\nsition Musicale, Service des Archives, Palais Princier, Monaco.\n• Playwright Award Competition of the Little Theatre of\nSavannah, Inc. Entries to be received by October 31, 1963.\n$250 award for an original full-length play for arena pro¬\nduction. For information, write: The Little Theatre of Sa¬\nvannah, Inc., 1714 East Gwinnett Street, Savannah, Georgia.\nAnniversaries\nJuly 26—WCET, Cincinnati, 9th.\nAugust 18—WKAR, Michigan State University, 41st.\nHenry Will Speak at NAEB Convention\nFCC Chairman E. William Henry will be the banquet speaker\nat the 1963 NAEB convention in Milwaukee. NAEBers will\nbe able to read about him in the July-August NAEB Journal\nin an exclusive interview by Editor Walter Emery.\nLost: One NAEBer!\nThe NAEB has received a check for Individual Membership\nfrom David G. O’Keefe, P. O. Box 7158. Problem is, we\ndon’t have a city and state. Would anyone knowing the\nwhereabouts of Mr. O’Keefe please write to Mrs. Dotty\nTempleton, 119 Gregory Hall, Urbana, Illinois.\nInternational Study Institute Begins\nScheduled to begin regular sessions in New York this fall,\nthe new International Study and Research Institute is now\naccepting fees for charter memberships. The Institute plans\nto offer non-degree programs on various international issues.\nFor information and application blanks, write to the institute,\nat 41 Central Park West, New York 23.\nNew NAEBers\nACTIVE\nStation WNMR, Northern Michigan University, Marquette,\nMichigan.\nASSOCIATES\nDepartment of Public Instruction, Harrisburg, Pennsylvania;\nFlorida Institute for Continuing University Studies, Gaines¬\nville, Florida.\nINDIVIDUALS\nCapt. Darrell L. Anderson, College Park, Maryland; John C.\nBarker, Springfield, Illinois; James R. Blake, Amarillo; Lt.\nLarry R. Bolls, San Antonio; Charles H. Cooper, Handsboro,\nMississippi; James W. Cox, Jr., San Antonio; Major Wil¬\nliam F. Cunningham, College Park, Maryland; Barbara Cur¬\nran, Syracuse; George Fazenbaker, Orlando; Samuel E.\nFrancis, Sr., Rantoul, Illinois; Tibbs M. Golladay, Gulfport,\nMississippi; Wayne Gratton, Fond du Lac, Wisconsin; Major\nA. C. Hamby, College Park, Maryland; Major Ross E.\nHamlin, Maxwell AFB, Alabama; Ellison H. Hoke, Elgin,\nIllinois; Daniel T. Jones, Huntsville, Alabama; Robert R.\nJones, New York; Lt. Frank W. Kafer, Lackland AFB,\nTexas; Roy M. Ludwig, Aurora, Colorado; Harold Levenson,\nSyracuse; J. Gerald Loughlin, Elmira, New York; Neal D.\nMarshall, Chicago; William G. Mitchell, Gainesville; Ger¬\ntrude M. Moesch, Buffalo; Bradford Norman, New York;\nRichard C. Nudd, Columbus, Ohio; Ben Zion Mushkin, Phil¬\nadelphia ; Lee F. Osborn, Westchester, Illinois; Willy Padilla,\nWashington; James D. Perry, Bloomington, Indiana; Gene\nJ. Petty, Charleston AFB, South Carolina; John S. Porter,\nRochester, New York; Jay Rayvid, Pittsburgh; Charles P.\nSalter, Wichita Falls, Texas; Alice M. Schwartz, Carbondale,\nIllinois; Capt. John D. Sheedy, San Antonio; Lawrence H.\nShepoiser, Wichita; John H. Sherman, Rantoul, Illinois;\nlst/Lt. John F. Smith, San Antonio; William G. Speights,"
}