{
  "id": "d1243-2",
  "text": "|> Evelyn Walker, producer-coordinator of radio and TV pro^\ngrams for the Birmingham Public Schools, is one of 17 peo¬\nple to receive the American Educators Medal Award from the\nFreedoms Foundation of Valley Forge. The award is given\nfor work performed during the year which encourages others\ntoward understanding the American way of life.\n^ Syd Cassyd has been appointed curator of the television\ncollection of the Hollywood Museum.\n^ Dr. Samuel B. Gould, manager of WNDT, New York\nCity’s ETV station, was one of the main speakers at the an¬\nnual conference of the American Library Association in July.\n^ New personnel announced at WDCN-TV, Nashville, are\nGordon Reel, producer-director, and Alice Gill, continuity\ndirector. Reel holds a degree in radio-TV-films from the\nUniversity of Kentucky, where last year he directed tele¬\ncourses in English literature, cultural anthropology, and orien¬\ntal culture. Mrs. Gill holds a degree in radio and speech from\nOhio University and has worked for the Dallas (Tex.) Times-\nHerald, and as a free-lance writer.\n^ Speaking to 30 Vanderbilt University students completing\nwork in a master of arts teaching program, Charles Siepmann,\ndirector of communications at New York University, said that\nAmerica today faces the enemy of “loveless teachers.” He said\nthe real teacher, either in the classroom or on television, must\nbe dedicated and know the inner meaning of his subject and\nlove to teach it. Siepmann opened a series of sessions for the\nteachers last fall and he spoke to them again to close the\nsessions this spring.\nSTATE & REGIONAL ACTIVITIES\n^ A state-wide feasibility study is under way for South Da¬\nkota. Martin Busch, president of the South Dakota ETV\nAssociation and manager of KUSD-TV, states that the study\nwill be completed by the ETV Associates of St. Paul before\nthe state legislature meets in January.\n^ New officers of the New York State Educational Radio\nand Television Association are: Halas L. Jackim, president;\nAlbert Fredette, vice president; John Porter, secretary; and\nMichael Collins, treasurer.\n^ Looking back over the decade since the establishment of\nthe Alabama ETV Commission in June 1953, Manager Ray¬\nmond Hurlbert said: “Gratifying progress is viewed in retro¬\nspect. The growth is measured from an idea to a TV net¬\nwork ; from a few weekly evening hours of films telecast over\none station to a concise, regular schedule aired over four\ninterconnected stations; from teachers at blackboards deliv¬\nering lectures to deans conducting demonstrations using elab¬\norate equipment and films for in-school study; from sporadic\ntelecourse scheduling to a year’s advance planning of pro¬\ngraming under authorization of the state board of education;\nfrom clumsy, amateur staged presentations to quality, live\ntelevision productions . . . Yet, there is room for extensive ex¬\nperimentation and improvement . . . The next decade prom¬\nises even greater challenges, opportunities, and achievements\nfor educational broadcasting in Alabama and the nation.”\n^ WDCN-TV, Nashville, which went on the air last fall, is\nthe first production-broadcast center in the proposed Tennes¬\nsee ETV network. Present plans foresee affiliated stations in\nMemphis, Lexington, Sneedville, and Chattanooga.\nCurrently WDCN is awaiting approval of a request filed\nwith the FCC for a power and coverage increase. Station of¬\nficials hope for approval in time to install the necessary equip¬\nment to go to full power at the beginning of the 1953-64\nschool year. The state board of education has granted the\nstation $503,000—$228,000 for production operations and\n$275,000 for capital equipment.\nThe station serves 43 school systems in southern Kentucky\nand middle Tennessee with in-school telecasts, with an en¬\nrollment in the TV courses of 134,343, according to Robert\nNAEB Headquarters: Suite 1119, 1346 Connecticut Avenue,\nN. W.t Washington, D. C., 20036. Phone 667-6000. Area Code 202.\nGlazier, station general manager. He said the hoped-for in¬\ncrease in power from 16kw to lOOkw “should help us to\nserve 229,000 students in Tennessee alone—and roughly a\nthird of our geographical coverage area will be in Kentucky.”\nWDCN-TV also programs for adults in the evenings.\n^ September 1964 is the target date for on-the-air operation\nfor the ETV station for southern California. To assist in the\nplanning and development of ITV programs for participating\nagencies with the Community Television of Southern Cali¬\nfornia, an ETV planning committee has been formed. At a\nspring CTSC board meeting, Elden Smith, recently retired\nchairman of the executive committee of the Los Angeles\nSecurity First National Bank, was elected CTSC president.\nGENERAL\n^ WHRO-TV, Hampton Roads ETV station in Norfolk, is\nscheduled to move into its own studio building August 1.\nRandy Brent has taken over at the helm, replacing Blair\nMacKenzie, who is directing operations for the NAEB ETV\nproject in Samoa.\n^ Fourteen persons enrolled in the ETV workshop at Win-\nthrop College, Rock Hill, South Carolina, June 10-28. The\nrelationship between the classroom teacher and the TV teach¬\ner was emphasized in the workshop, which carried three hours\nof graduate credit. Participants also studied the broad move¬\nment of ETV in this country and abroad and received suffi¬\ncient production experience to understand the problems of\nthe on-camera teacher. Roy Flynn, associate professor of\ncommunications and director of public relations at the col¬\nlege, was workshop director. He was assisted by personnel\nfrom the college and the South Carolina ETV Center, with\nout-of-state consultants Dona Lee Davenport, director of\nradio and TV, Charlotte-Mecklenburg schools, and Vernon\nBronson, NAEB director of research and development. Dr.\nWilliam Royster represented the state education department.\nThe workshop took place in the new CCTV and radio studios\nof Winthrop College.\n^ Stephens College has announced receipt of a grant enabling\nit to distribute the lectures in three courses by long-distance\ntelephone conference calls to a network of small liberal arts\nand teachers colleges. The first course will be a science seminar\nduring the first semester of 1963-64. Conference calls will\noccur probably once a week, with the science teachers in the\nclassrooms able to ask questions of the science lecturer of the\nday. The other two courses will be offered during the second\nsemester. James A. Burkhart of the social studies faculty\nwill be technical director of the entire project, with Charles\nF. Madden, head of the communications department, serving\nas coordinator. The grant, totaling $47,500, was made by the\nFund for the Advancement of Education.\n^ KUON-TV, University of Nebraska, is participating in the\nstate’s tourism project for the second season by using pictures\nof Nebraska scenes of tourist interest as background for\nthe station’s call letters on station-break slides.\n^ Supporters of WMHT (TV), Schenectady, New York,\nhave launched various projects to gain funds for the station,\npresently suffering a deficit of some $68,000. One of the proj¬\nects was a bike sale, which the William A. Koppe family\ninaugurated, feeling that it not only would be a good family\nproject but would also call attention to WMHT. Many bikes\nwere donated and the Koppes hope it may become an annual\nevent.\n^ WMHT and the Charlotte-Mecklenburg schools (N.C.)\nrecently completed a mutually beneficial equipment swap.\nEach organization had been given transmitters which could\nbe adapted for use on their respective channels—except for\nthe diplexers. The trade of side band filters and diplexers\nsolved the problem for both.\n^ WHYY-TV, Philadelphia, this summer is establishing stu¬\ndios and offices in Wilmington, Delaware, and installing a new\n50kw transmitter and tower in Glassboro, New Jersey. In\nSeptember broadcasting over the three-state setup will begin.\n^ The 1962-63 annual report of radio-TV activities for the\nBaltimore Public Schools reports 256 TV programs and 205\nAUGUST, 1963\n3"
}