{
  "id": "d1860-0",
  "text": "■n a e b\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. 28, NO. 1 \" JANUARY, 1963\nElection Results Announced\nFollowing are NAEB Board members who were recently\nelected to serve two-year terms, from January 1, 1963, through\nDecember 31, 1964:\nRegion I—Radio: Albert P. Fredette, station manager,\nWAMC (FM) Albany Medical College, Albany, New York.\nRegion II—Television: Gerard L. Appy, director, WGTV\n(TV), Georgia Center for Continuing Education, University\nof Georgia, Athens.\nRegion III—Radio: James S. Miles, director of radio-tele-\nvision, Purdue University, West Lafayette, Indiana.\nRegion IV—Television: Dr. John C. Schwarzwalder, gen¬\neral manager, Twin City Area ETV Corporation, St. Paul,\nMinnesota.\nRegion V—Radio: R. Edwin Browne, station director,\nKFKU (AM)-KANU (FM), University of Kansas, Law¬\nrence.\nRegion VI—Television: James Morris, director, educational\nradio and television, General Extension Division, State of\nOregon, acting by and through the State Board of Higher\nEducation, Corvallis.\nDirector-at-Large: Dr. Bart Griffith, director, instruc¬\ntional TV, University of Missouri, Columbia.\nIndividual Member Director: Dr. Harry J. Skornia, pro¬\nfessor of radio and television, University of Illinois, Urbana.\nNAEB Regional Meetings Planned\nRegion II—March 29 and 30, Tampa.\nRegion III—March 17-19, Chicago, at the new Kellogg Cen¬\nter at the University of Chicago. John Buckstaff, of the\nradio-TV office of the U. of C. is planning committee\nchairman.\nHave You Returned Your Questionnaire?\nThe NAEB Office of Research and Development reports that\nmany NAEBers who received questionnaires as part of the\nSurvey of Personnel in ETV have not yet returned them.\nPlease complete and return immediately to the NAEB Wash¬\nington headquarters.\nRome Conference Proceedings Available\nCopies of the proceedings of the International Conference of\nBroadcasting Organizations on Sound and Television School\nBroadcasting in Rome, Italy, in December, 1961, are avail¬\nable on a first-come, first-served basis to NAEB member\ninstitutions. The 722-page book is a collection of papers and\ndiscussions outlining the accomplishments and problems of\nschool broadcasting in 65 countries.\nNAEB institutional members wanting a copy should write\nto the NAEB Washington Office before February 15, 1963.\nNew Film Explains ETV\nThe Bell Telephone System has developed a color film on\n“Television in Education,” which shows a variety of ways\nin which educators are using television. Prints of the 28-\nminute film are available to educators and to the general\npublic, from any Bell Telephone business office.\nUSOE Announces Doctoral Fellowships\nThirteen doctoral fellowships under Title IV of the NDEA\nwill begin in September, 1963. Each provides for three years\nof full-time graduate study leading to the Ph.D. or Ed.D.\nStipends are $2,000 for the first year, $2,200 for the second,\nand $2,400 for the third, plus $400 per year for each depend¬\nent. Each university makes special arrangements for tuition,\nfees, etc.\nAudiovisual Center at Michigan State University, 4 fellow¬\nships. Deadline for application submission: February 1. Re¬\nquest application from Dr. Charles F. Schuller, Director,\nAudiovisual Center.\nAudiovisual Center at Syracuse University, 4 fellowships.\nDeadline or application submission: February 15. Request ap¬\nplication from Dr. Eugene K. Oxhandler, Associate Director,\nAudiovisual Center.\nDepartment of Instructional Technology at University of\nSouthern California, 5 fellowships. Deadline for application\nsubmission: February 1. Request applications from Dr. James\nD. Finn, Professor of Education.\nConventioneers Like Special-Interest Sessions\nThis year as last, the post-convention questionnaires so far\nreceived at NAEB headquarters indicate that the most popu¬\nlar events at the convention were the special-interest sessions.\nThe concurrent sessions for radio, TV, and CCTV ran a\nclose second, with some asking for more time for these.\nRegional meetings at the convention were popular, and\nthere were suggestions that the regional directors query their\nconstituencies early regarding topics and problems to be dis¬\ncussed, from which an agenda could be formed.\nRandom selections from comments on the questionnaires:\n* Use the exhibitors in some type of general session—dem¬\nonstration of equipment, etc.\n* More emphasis on practical application and utilization of\nideas and procedures discussed.\n* Meeting of NAEB Radio Network stations.\n* More opportunities for radio and TV groups to meet\nconcurrently.\n* Need one free evening, especially when convention site\nis a major or historical city.\nIn general, the convention as a whole was considered good\nby the majority of those responding to the questionnaire,\nwith the average rating on a sliding scale from 1 (poor) to\n5 (very good) being 4.\nCalifornia Has Symposium on ITV\n“Television as a Means of Instructional Communication” is\nthe name of a one-day symposium to be sponsored by the\nUniversity of California and the San Francisco Section of the\nSMPTE on January 26. Both audio and video tape record¬\nings of the presentations will be available for loan to indi¬\nviduals and organizations for appropriate uses at modest fees\nto cover mailing and handling.\nThe symposium will bring together TV administrative, pro¬\nduction, and technical personnel from a high school (Fremont"
}