{
  "id": "d1482-1",
  "text": "*NaBB NEWS LETTER ,, May 15, 1341 ..Page 2\na resolution commending the work of NCER during ths past decade\nwas moved by Menzer, seconded by Novik and passed by the association.\nThe Executive Secretary was instructed to send a copy to the Payne\nFund and to the National Committee on Education by Radio,\nOn a motion of Professor Griffith, seconded by Henzer the association\nadjourned to meet again September 5 and 6, the place to be determined\nby the membership,\nSEE BALLOT IN PACKET\nThe meeting at Columbus instructed the Executive Secretary to\npoll again the NAEB membership to determine where to meet. You\nwill note that time was set definitely for September 5 and 6,\nThe place will be either at Purdue University or St. Louis,\nMissouri,\nASSOCIATION OF EDUCATION BY RADIO\nAlso at Columbus a group of persons engaged and interested in\neducation by radio met to consider a plan for a new organization\nfor the promotion of education by radio.\nUnder the leadership of temp* rary chairman, Wm. D, Boutwell, a\ncommittee, led by Harold W. Kent, issued the following statement\nof purposes:\n«Development of an instrumentality through which persons inter¬\nested in education by radio may have adequate communication,\n\"Cooperation with the Institute for Education by Radio, The School\nBroadcast Conference, The United States Office of Education, State\ndepartments of instruction, and other educational radio interests\nin promoting the cause of education by radio,\n\"Representation of the Interests of education by radio in connection\nwith pertinent legislation, commission hearings, and conferences,\n\"Encouragement of experimentation and research and widespread\ndissemination of findings,\n\"Publication of a news, information and idea service on a periodical\nbasis,\n\"Establishment of this association as the recognized professional\nvoice in the field of educational radio among school administrators,\nteachers, and the radio industry,\n\"Advancement of such specific fields as teacher training, workshop,\ndocumentary radio, educational frequency modulation stations and\nequipment,\n\"Development of a practical program of promotion of national morale"
}