{
  "id": "d1482-6",
  "text": "NAEB NJEWS LETTER ., May 15, 1941 . . Page 7\nDr, Chapman placed the responsibility on the schools of calling\nyouth’s attention to good programs available,\n\"It has been proved by one of our bureau’s recent campaigns that\nschool children will listen—and will even be stimulated to read\nmore widely, for example—if specific programs of value are pointed\nout to them,” he added.\nSchool children must also be made propaganda-conscious, he explained.\nThey must be taught to be able to detect propaganda, to discriminate\nbetween good and bad sources of information, and to draw their own\nconclusions from what they hear,\nFCC ACTIONS\nKOAC, Oregon State Agricultural College, was granted modification\nof construction permit (for new transmitter, installation of DA\nfor day and night use, move of transmitter and increase in power)\nfor extension of completion date to July 14, (4/4/41)\nKUSD, University of South Dakota, was granted permission to with¬\ndraw without prejudice its application for construction permit.(4/3/41)\nKWLC, Luther College, applied for modification of construction permit,\nrequesting 1240 kc under NARBA and extension of commencement and\ncompletion dates. (4/4/41)\nWBAa, Purdue University, applied for modification of construction\npermit, requesting change in type of transmitter, amended to make\nchanges in directional antenna for night use and specify 920 kc for\nNARBA. (4/4/41)\nWSIfl, University of Illinois, was granted special permission to oper¬\nate a minimun of nine hours daily during Easter recess. (4/9/41)\nKWSC, State College of Washington, was granted modification of\nconstruction permit, authorizing installation of automatic frequency\ncontrol equipment on 1350 kc under NABRA, and extension of commence¬\nment date to 10 days after grant and completion date to 180 days\nthereafter. (4/24/41)\nWBAa, Purdue University, was granted modification of CP. (4/25/41)\nWTAW, Texas A & M, applied for authority to determine operating\npower by the direct method. (4/28/41)\nKFJH, University of North Dakota, had its application for renewal\nof license and application for modification of license requesting\nspecified hours (3 to 5 p.m. daily) and change of studio site to\nUniversity campus, set for hearing. (4/29/41)"
}