{
  "id": "d1664-18",
  "text": "THE EDUCATIONAL NEWS BULLETIN\npoor children had no say in the matter. The teacher tuned in the pro¬\ngram and sat at her desk at the front of the room while the program\nwas on, and of course the children could do nothing else but listen.\nThe only fair way of testing whether or not those children really en¬\njoyed and got anything from that type of radio program would be to\noffer them their choice of such programs as against the same subjects\ntreated by someone like Lowell Thomas or Carveth Wells. Only then\ncould one be sure which type of programs was the most successful. I\nhaven’t much doubt as to which would be chosen.\nRadio should not be used as a substitute for classroom teaching, but\nrather as a supplementary aid whereby the curriculum may be enriched.\nMany activities having great educational value are lost almost entirely\nunless gotten by means of the radio. We may read about Admiral\nByrd and his South Pole expedition, about the opening of Congress and\nthe President’s message, but when we hear the voices of these men, they\nbecome real human beings and their activities are lifted out of the realm\nof print into that of actual happeings. Unfortunately many of the best\nof these programs come during the out-of-school hours.\nIt must be remembered that very few school superintendents or\nboards of education have taken the subject of educational broadcasting\nseriously enough to give it the thought and attention which is necessary\nto bring it to a successful project. It has seemed to be a frill, a toy,\nand not a necessary part of the school curriculum. Money has been too\nscarce during these trying depression years to lay aside any for experi¬\nmentation along outside lines, and where broadcasters have tried to\nco-operate to bring programs to the schools, they have found an apathetic\nattitude and crowded curricula stumbling blocks to their initiative.\nThere are exceptions—the Wisconsin School of the Air is one. Thvy\nhave done a most interesting piece of work in creative art put on by a\nprofessor of art from the University who has a great deal of personality\nand imagination and the results he has achieved are amazing; they have\nalso done an excellent job through a series of science broadcasts. The\nRochester Public Library reports a successful series of book talks put\non for the schools. The Standard musical broadcasts previously re¬\nferred to have become famous. Where such programs as these are\nused, the best results come when preparation of pupils is given in ad¬\nvance and time is allowed for discussion following the broadcasts. Dif¬\nferences in time and environment throughout the country make it al¬\nmost necessary that programs be local in nature.\nI do not believe that successful school radio programs will be\nrealized until professional people instead of broadcasters are willing to\ntake the time to work out such programs.\n- 18"
}