{
  "id": "d1664-24",
  "text": ", THE EDUCATIONAL,NEWS BULLETIN\nAda Hoebeke, of the Language. Department, and Mrs. .Amelia Bis-\ncomb, of the English Department, were among the instructors chosen\nto be judges of school exhibits at the Hartford Fair.\nMiss Frances Noble, of the Language Department, attended the\nFrench School at Middlebury College, Middlebury, Vermont during\nthe past summer.\nMiss Lucia Harrison, of the Department of Geography and Geology,\nspent the summer in research work at the John Crerar Scientific and\nTechnical Library, Chicago.\nMr. Louis Foley, of the English Department, taught French and\nhad charge of Dramatics at the Ecole Champlain, French camp at\nFerrisburg, Vermont.\nA course of six lectures entitled “Evenings with Books” will be\npresented at the Church School of the Presbyterian Church on Thurs¬\nday evenings. Mr. George Sprau, of the English Department gave the\nfirst two lectures, October 17, and 24, on “Reading and Interpretation\nof Poetry”. Miss Anna French, Librarian, will give the third and\nfourth lectures, one on “Novels of Constance Holme”, and the second\non “Humor in Prose and Rhymes”. The fifth and sixth lectures of\nthe course will be given by Dr. W. R. Brown, of the English Depart¬\nment. The fifth will be a review of a current novel, and the sixth a\nreview of a current biography.\nDr. Elmer H. Wilds, of the Department of Education and Psy¬\nchology, won first place in one of the eight divisions of the national\nessay contest sponsored last spring by State Teachers Magazines, Inc.\nDr. Wilds, whose subject was “Teachers and Social Planning,” was\npresented with the prize money at the state executive secretaries’\nluncheon at the National Educational Association Denver convention.\nDr. Wilds was in Dowagiac, September 24 to assist in the initiation\nof a new home room organization in the Senior High school. While\nthere Dr. Wilds addressed a faculty meeting of Junior and Senior\nHigh school teachers.\nMiss Eunice Kraft, of the Language Department, attended Summer\nSchool at Cornell, University, Ithaca, New York. Miss Kraft spoke\nat the Classical section of the Michigan Educational Association meet¬\ning,, in Battle Creek, on October 11, on “Horace’s Philosophy”.\nDr. William McCracken, of the Chemistry Department, addressed\nthe Student Science Club on October 9.\n-24-"
}