{
  "id": "d1664-7",
  "text": "the educational news bulletin\nEDUCATIONAL BROADCASTING—-AN URGENT NEED\nBy\nDr. Tracy F. Tyler\nSecretary and Research Director, National Committee on Education by Radio\n“Real social usefulness for the radio is an impossibility—as complete\nan impossibility as proper education would be if a large part ot every\nhour in every classroom in the public schools of the country were turned\nover to people who came in and addressed the children regarding break¬\nfast foods, or automobiles, or wooden legs. I don’t blame the advertisers\nor the radio stations for trying to make money; they live in a money¬\nmaking society and simply obey the same rules as everyone else. It does\nseem to me, however, that it is time for society as a whole to look at this\nsituation and decide whether we want it to go on.”1\nWhat a beginning for an article dealing with the general topic c\neducational broadcasting! Yet the statement is not an old one mad^\nduring the early days of radio but is a conclusion voiced during the\ncurrent year by a man who is a keen analyst and observer of the Ameri¬\ncan scene. If this appraisal of radio seems too critical, consider another\nopinion, rendered in this instance by a member of the Commission\ncharged with the regulation of radio broadcasting in the United States.\nIn an address widely commented upon in the press Commissioner Payne\nsaid:\n“When we stop to realize that the radio in this country is practically\nentirely in the hands of those interested solely in its commercial aspects\nwe are inclined to wonder what might have happened to civilization if\nthe press had been for about five hundred years controlled by commer¬\ncial agencies, and educational and political reformers had been unable\nto get their ideas into circulation because the commercial control found\nit could make more money by appealing to the tastes and interests of the\nless intelligent rather than the more intelligent.”2\nIf these statements are true, and I am sure that most of us are\nthoroly in agreement with them, they are a challenge to the American\npeople. They are sufficient proof of the fact that what America needs\nis more educational broadcasting, and less of the present radio fare.\nWhat is educational broadcasting? Too many have the impression\nthat it consists only of broadcasts intended for school use or of pro¬\ngrams in the field of college or university extension. Both of these\ntypes of broadcasts are valuable and are being presented interestingly\n1. Bliven, Bruce. “Public Ownership of Radio.” Proceedings, Ninth Biennial Public\nOwnership Conference, Washington, D. C., February 21-25, 1935, p. 97.\n2. Payne, George Henry, member. Federal Communication Commission, in an address\nbefore the American Association of Agricultural College Editors, Ithaca, N. Y., August\n21, 1935.\n- 6 -"
}