{
  "id": "d1491-1",
  "text": "2\nnational problem of financing educational television stations.\nAt many of these conferences NAEB Committees/ Advisory Committees/\nand Board members also held concurrent meetings.\nIn addition to the meetings held by the NAEB, the Asso-*\nelation1s staff has participated in the conferences of nearly\nfifty other professional associations and government departments\nthat look to NAEB for guidance and representation in educational\nbroadcasting. In a majority of the meetings, NAEB staff were\ninvolved in joint planning or as resource persons to adaress or\nattend sessions. Among these meetings ares\nJCEB-NEA Conference on Television Channel Allocations\nEducational Media Council\nDepartment of Audio Visual Instruction (NBA)\nState Department Foreign Policy Conference\nNew York State Educational Radio and Television Association\nU.N. Meetings on Communications in Underdeveloped Countries\nArmed Forces Television Conference\nCouncil on Medical Television\nUestern Interstate Commission on Higher Education\nInter-University Communication Council of the American\nAssociation of Medical Colleges\nEastern Educational Network\nInstitute for Education by Radio-Television\nSouthern Regional Education Board\nAmerican Association of School Administrators\nNational Association of Broadcasters\nCommittee for the Support of the Public Schools\nAmerican Bar Association\nOkoboji Leadership Conference\nAmerican Council on Education\nNDEA Advisory Panels\nAssociations for Higher Education\nLEGAL ACTIVITIES\nDuring 1964, the NAE3 filed comments in two major proceeding:\nbefore the Federal Communications Commission. Both represented\nthe culmination of careful studies to determine the most satis¬\nfactory position for educational broadcasting*s national mteresto.\nOne, the UHF Assignment Plan, developed for the first time by\ncomputer calculations, was issued by the FCC as an alternate to\nits own manually-developed plan. The NAEB*s pioneering efforts\noersuaded the Commission to use computer tabulations m the develop¬\nment of a third plan to be issued early this year by the Commission.\nA second proceeding concerned the regular licensing of air¬\nborne television channels for educational television purposes in\nthe midwest? the NAEB opposed this proposed action on the basis of"
}