{
  "id": "d1420-4",
  "text": "^ Florida State University’s speech department will play host\nto about 60 students attending the Southeastern Summer High\nSchool Speech Institute June 22 to July 17. WFSU-TV will\ncooperate in the orientation program, and Duane Franceschi,\nprogram director for WFSU, will teach one of the daily\nclasses. In his “Introduction to Radio and Television,” he\nwill include a brief history, the social aspects of broadcasting,\nand practical demonstrations. The class will also actually pro¬\nduce a TV program.\n^ The Alabama ETV Commission has announced a target\ndate of this summer for its fifth station, WEIQ-TV. Of\nnecessity, WEIQ will temporarily operate independently of\nthe state network. The four network stations have a poten¬\ntial audience, according to a recent report, of over 3 million\nresidents, and 812,500 homes with 663,100 TV receivers.\nPROGRAMS\n^ Flatworms performed on the Steve Allen Show a few weeks\nago in a science show directed by University of Michigan psy¬\nchologist James V. McConnell. The theme: How the lowly\nflatworms can learn, remember, and “transfer” memory from\none to another—and what this could mean to man. One start¬\nling finding: Learning and memory are transferable from one\nflatworm to another via cannibalistic ingestion.\n^ WGN-TV, a Chicago commercial station, has won the\nGeorge Foster Peabody Award for Children’s Programs for\nits program series, “Treetop House.”\n^ WGN-TV’s documentary series “All America Wants to\nKnow” last month presented “Must It Be Bail Or Jai'l?” The\nshow, which described the problems of the poor trying to raise\nbail and the aid given them by the Vera Foundation, took\nthe audience inside the detention cells of New York City’s\nDepartment of Correction and followed a young man arrested\non suspicion of felonious assault.\n^ WBUR (FM), Boston University, has just completed its\nfirst season of broadcasting live concerts by the Boston Sym¬\nphony Orchestra direct from Symphony Hall, Boston. It is\nbelieved to be the only University station in the nation to\nbroadcast live concerts by one of the country’s top five sym¬\nphony orchestras on a regular basis.\n^ Westinghouse Broadcasting Company has announced that\nFrank Baxter, professor emeritus of English at the Univer¬\nsity of Southern California, will be host of a radio and tele¬\nvision series on William Shakespeare. The series is being pro¬\nduced at KPIX, San Francisco, with the help of USC and\nthe Shakespeare Birthplace Trust in England.\n^ KAET, Tempe, Arizona, has added a new twist to sports\nbroadcasting. In answer to an athletic conference ruling pro¬\nhibiting live telecasting of baseball games, KAET is “visual¬\nly re-creating” them. Fans watching the station hear the live\naudio portion of the games, while the picture is mechanically\nrecreated in the studio by use of a facsimile field; ball,\nstrike, and out indicator; and running compilation of runs,\nhits, and errors. Action is instantaneously recorded and pro¬\ngramed onto the game board.\n^ For more than a year the Hampton Roads ETV Associa¬\ntion, Virginia, has been producing a special wide-ranging pro¬\ngram in economics five days a week, directed at twelfth grad¬\ners who elect to take the course for credit. In response to\npopular demand, it is now being shown at 9 p.m. each eve¬\nning.\n^ Alabama’s ETV network is airing an 8-week series, “Ala¬\nbama’s Underground,” in cooperation with the National Spe¬\nlunking Association and local Grotto members. Co-hosted by\na former Grotto president, Mike Cram, who is an avid cave\nphotographer, the series utilizes 2,000 pictures to describe ex¬\nplorations into the state’s many caves.\n^ Benjamin C. Willis, superintendent of Chicago’s schools,\nis discussing “Chicago’s Schools in a Changing World” on a\nNAEB Headquarters: Suite 1119, 1346 Connecticut Avenue,\nN.W., Washington, D.C., 20036. Phone 667-6000. Area Code 202.\n10-week series on two commercial TV stations, WGN and\nWBKB.\nINTERNATIONAL NOTES\n^ Television’s contribution to education was pointed up in the\nU. S.. Exhibition at this spring’s 20th Casablanca International\nTrade Fair. Theme of the U. S. exhibition was “Education—\nTool of Modernization.” The show demonstrated advance de¬\nsign instructional techniques and showed the application of\neducation and training to communications, industry, agricul¬\nture, and discovery.\n^ The “International Institute for Advanced Studies in\nCinema,” a unique study of the cinema to be held in Vence,\nAlpes-Maritimes, France, this summer, will join two Boston\nUniversity faculty members, Gerald F. Noxon and Robert\nSteele, and “about twelve students of film from around the\nworld.” The six-week summer program in Vence, where many\nof the “greats” of the French film industry live, hopes to\nfoster a “deeper understanding of the cinema and to make\nfilms.”\n^ Deadline for application for Fulbright-Hays lecturing and\nresearch fellowships is August 1. For application forms and\nadditional information write to the Committee on International\nExchange of Persons, Conference Board of Associated Re¬\nsearch Councils, 2101 Constitution Avenue, Washington, D.C.,\n20418.\n^ Martin Ronan, a 24-year-old Syracuse University graduate\nstudent at the university’s Television-Radio Center, is busy\nbecoming the first American to observe in depth the opera¬\ntion of television in an East European country. Sponsored by\nthe State Department and the Polish Committee on Television\nin cooperation with the university, Ronan is studying Polish\ntelevision principles and practices during a six-week Warsaw\nstay, which began in late May.\nPublications\n• Martin Mayer’s Where, When, and Why is an analysis of\nthe teaching of social studies in American schools, based on\na report submitted to the American Council of Learned So¬\ncieties and the Carnegie Corporation. Harper and Row, 206\npages.\n• The Miseducation of American Teachers by James O.\nKoerner is based on a two-year study of teacher training in¬\nstitutions, supported by the Relm Foundation, Ann Arbor,\nMichigan. Houghton-Mifflin, 360 pages.\n• In print and photos, “The American Interest in UNESCO,”\nnew from the U. S. National Commission for UNESCO,\ndescribes UNESCO’s activities in education, mass communi¬\ncations, science, and culture. The brochure is on sale for 30c\nthrough the Superintendent of Documents, Washington, D.C.,\n20402 (Catalog Number S5.48 :AM3/2).\n• “The Double Standard: Are We Failing Our Schools in\nan Age of Technology?” an article by Lewis Rhodes, director\nof television at Central Michigan University, appears in the\nMarch Michigan School Board Journal.\n• UNESCO itself offers a number of reports and papers on\nmass communications. The latest is Number 41, Space Com¬\nmunication and the Mass Media. This and such other studies as\nMass Media in the Developing Countries (50c) and World\nFilm Directory ($1) are available from the UNESCO Publi¬\ncations Center, 317 East 34th Street, New York 16.\n• The March issue of the E.B.U. Review contained these\narticles: “Role of Broadcasters in Space Communications” by\nLeonard H. Marks, and two articles on children’s program¬\ning, John Regnell’s “Stretching the Imagination” and Paul\nTaff’s “Television is for Children.” The Regnel'l article was\nabout “Stories ’n Stuff,” long-running NAEB Radio Net¬\nwork children’s program produced at WILL, University of\nIllinois.\n• The School Library is the title of a 144-page illustrated\nbook issued by Educational Facilities Laboratories, Inc., 477\nMadison Avenue, New York 22.\nJUNE 1964\n3"
}