{
  "id": "d1420-5",
  "text": "PLACEMENT\nPERSONNEL AVAILABLE\n(For information, write Miss Julie Hunt, Placement Service,\nat the NAEB office in Washington.)\nJune I Producer-director, experienced in instructional tele¬\nvision at major Midwestern university, desires position\nas writer, producer, and/or director on East or West\nCoast or in Great Lakes region. Holds secondary school\nteaching certificate. Graduate of Ohio State University\n(cum laude) in speech with radio-TV specialization. Sal¬\nary open.\nJune 2 Male, 32, married, with one child. M.S. in radio-TV.\nInterested in CCTV on college campus or ETV station.\nPublic school teaching and college teaching experience.\nSalary $10,000.\nJune 3 Married male, 21, interested in working in ETV pro¬\nduction—both program preparation and directing. Col¬\nlege training in preparing and airing TV programs, par¬\nticularly news and public affairs. Spent one summer with\nKDKA-TV in Pittsburgh; has also worked for Penn State's\nCCTV system. Prefer starting salary of about $IOO/wk.,\nbut more interested in earning potential. B.A. with major\nin broadcasting.\nJune 4 ETV producer-director; single male, 24. B.S. in broad¬\ncasting. Presently candidate for M.A. in TV Production,\nJune 1964. On-air TV operations experience in all posi¬\ntions at ETV station while part-time employee as under¬\ngraduate. Produced TV kinescoped programs to be used\nas army training films at Army Pictorial Center in New\nYork. Primarily seeks position in producing and directing\ninstructional and community television programs. Has\nexperience in radio production and will consider posi¬\ntions in radio also. No location preference; more inter¬\nested in the type of work. Salary $6000. Ready to start\nwork May 25, 1964.\nJune 5 Man desiring freedom to help create quality ETV pro¬\ngraming seeks position as producer-director or produc¬\ntion supervisor. Ten years experience in all phases of\nradio and TV with emphasis in educational radio-TV. B.S.\nin business and engineering, M.S. in radio-TV and cine¬\nmatography. Will also consider position with teaching\nstaff in broadcasting department of college or univer¬\nsity. Minimum $7000. Prefer far West or Northeast.\nAvailable August 1964.\nJune 6 Male British immigrant, 33, married, M.Sc. in radio-\nTV (U.S.A.), Diploma in speech and drama, Royal Scot¬\ntish Academy of Music, College of Dramatic Art, with\nextensive TV experience in Britain and Africa, seeks post\nas TV producer-director, salary $7500-$8000.\nJune 7 Director of major university international educational\nbroadcasting training program desires new position of¬\nfering greater opportunity for involvement in broad¬\ncasting management, programing, and research. Experi¬\nenced in most facets of broadcasting. Especially strong\nin writing, directing (radio-TV-motion pictures), and re¬\nsearch. Contributor to forthcoming reader in mass com¬\nmunications, as well as other publications. Doctoral de¬\ngree in August. Married, 29, prefer East Coast or over¬\nseas. $9000 minimum.\nJune 8 Single male, 38, with M.S. in radio-TV, commercial\nbroadcasting experience as announcer and newscaster,\nhigh school teacher of math and English, wants college\nteaching position as news or sports broadcaster or pro¬\nducer of educational programs.\nJune 9 Harvard graduate with one year wireservice experience\nin Chicago seeks chance to learn fundamentals of TV\nproduction with ultimate aim of filming documentaries.\nStrong writing background, some photography, wide in¬\nterest range, travel in Africa, U.S.A., and Europe, great\nenthusiasm. B.A. (Magna cum laude) in sociology and\npsychology, married, 22, will accept any living wage.\nJune 10 ETV assistant program manager would like position\noffering greater scope of responsibility and opportunity\nfor professional advancement. Single male, 37, M.A. in\nspeech (broadcasting). Ten years experience in all\nphases of commercial and non-commercial radio and\ntelevision. Salary and location open.\nJune II Imaginative, single male, 26, seeks job as producer-\nwriter and director with progressive ETV-ITV station. BFA\nin TV production-direction; M.S. in education; secondary\nteaching certificate in radio-TV, speech, language arts.\nExperience: 2 years commercial TV camera, lighting, set¬\ntings; I/2 years high school teaching of speech, English,\ndevelopmental reading. Will consider teaching. Particu¬\nlarly interested in theatre. Prefer West or Midwest. Sal¬\nary open.\nJune 12 TV production and/or supervisory position, domestic\nor foreign, sought by 43-year old married man with 18\nyears professional experience as producer, director, ac¬\ntor in TV, films, radio, and theatre and Bachelor of The¬\natre Arts degree. Credits include: \"Continental Class¬\nroom,\" production manager, NBC-TV; \"Sunrise Semes¬\nter,\" \"Camera III,\" studio manager, CBS-TV; \"Play of\nthe Week,\" \"Open End,\" director of operations, WNTA-\nTV, NY-NJ. $10,500 minimum.\nPOSITIONS AVAILABLE\n(In order to be considered through these channels, the reader\nmust be an Individual Member of the NAEB, with credentials\non file with the NAEB Placement Service. Non-members can\nsave time by sending the $10 annual dues and $5 Placement\nregistration fee at the time of inquiry.)\nJUNE I Engineer for staff of Midwestern university TV station.\nIn general will be responsible for operating and oversee¬\ning both studio and transmitting equipment that nor¬\nmally goes with a television operation, including an\nAmpex videotape recorder. Will be expected to be flex¬\nible in schedule and will be required to work some nights.\nFirst Class license required. Position open July 1964.\nJUNE 2 Tidewater Virginia ETV station desires college gradu¬\nate experienced ETV director. Available June 30, 1964.\nMust be creative. Salary range $5500-$6500.\nJUNE 3 Operations director for Northwest university radio\nstation. Considerable educational radio experience re¬\nquired, also some experience and background in ETV.\nCandidate should have masters degree in the area of\nbroadcasting-speech; good background in most areas of\nmusic. Salary $6000 to $7500 depending on background\nand experience.\nJUNE 4 Producer-director for southeastern university ETV\nproduction center. Masters degree and television pro¬\nduction experience desired. Annual salary from $6000\nto $6500. Open summer 1964.\nJUNE 5 Southeastern university ETV production center has\nopening for senior producer effective summer 1964. Must\nhave extensive TV experience; masters degree preferred.\nSalary up to $7500, depending upon qualifications.\nJUNE 6 Instructor, speech and telecommunicative arts, $6000,\nnine months. Appointee will serve as director of radio\nworkshop, which is both student activity and one- to\nthree-credit course. The appointee will teach three sec¬\ntions of basic public speaking. Possibility of appointment\nat rank of assistant professor at salary of around $8000\nif appointee can teach speech and voice improvement.\nJUNE 7 Television director for CCTV system at large Mid¬\nwestern university. Should have some ITV experience and\nbe capable of working with faculty members of the\nuniversity helping develop TV courses. Should be ver¬\nsatile in ideas and able to prepare and produce course\nmaterial for presentation. Position open September I.\nSalary approximately $6,000.\nJUNE 8 Television center of East Coast university seeks\nyoung man thoroughly experienced in areas of staging\nand lighting. Salary $6-7000; position open September I.\nJUNE 9 Experienced producer-director for New England state\nETV network. Masters required, or course work leading\nto the degree. Position open July I; salary approximate¬\nly $6000 to start; university benefits.\nJUNE 10 Chief engineer for Midwestern college radio station.\nApplicant must be first-class chief engineer, willing to\nwork with students at an educational station, capable of\noperating and maintaining FM transmitter. Position open\nJuly I.\nJUNE II Community ETV station in Great Lakes region seeks\nyoung man as producer-director. Masters degree pre¬\nferred. Salary approximately $5-6000 depending upon\ndegree and experience. Position open July I.\n4\nNEWSLETTER"
}