{
  "id": "d17-1",
  "text": "Works inspired by texts which have already been\npublished are admitted on condition that they have a\ncreative value for broadcast mg*\n5\nEach year the Italia Prise is divided into two\nparts having equal value* of which*\n• one to be awarded to a musical composition\nwith text|\n« end the other* to b© awarded to a literary\nor dramatic work with cr without music«\nThe awarding of ex-aequo prizes is excluded*\n6\nThe Jrad.es shall not examine any entries other\nthan, those submitted by the Broadcasting Qrganiaz®\ntions which have accepted the Statute of the Italia\nPrise and have fulfilled all the conditions laid\ndown by the said Statute*\nEntries of a publicity character will be rejected®\nIn the choice of entries, Broadcasting Organ-\nizations should bear in sdnd the suitability of the\nworks for being broadcast by all the Organizations\nparticipating in the Italia. Prize©\nIt is also desirable that the entries submitted\nto the Juries should be easy to- translate without\nimpairing their artistic value©\n?\nThe Juries shall examine only entries accom¬\npanied by a written statement by winch the Authorp\ninsofar as he is concerned* declares that, under\nreserve of his moral right said for the sole purpose\nof permitting the broadcasting of his work by all\nthe Organizations participating in the Italia Prize*\nhe authorises the said Organizations# should M.s\nwork be awarded a prize, to proceeds\na) with the necessary translations and v fch\nthe indispensable adaptations of the work!\nb) with the recording of the work by means of\ninstruments suitable fox* the mechanical\nreproduction of sound with a view to the\nbroadcasts provided for under c) hereunder!\nc) with two broadcasts of the work either by\ndirect broadcast or in relay or by means\nof instruments suitable for mechanical\nreproduction © For each of these broad**\ncasts the Author shall be credited with\nthe usual amounts paid by the Broadcasting\nOrganization for works of the -same nature*\nHo additional amounts of any kind shall, be.\nclaimable by the Author- m account of the\nfact that the work has been awarded a prize®"
}