{
  "id": "d17-12",
  "text": "Signor Qian Franco Zaffranl\nJuly 31, 1953\nwritten piece for piano, voice and yarioua instmaantal oomblMtio\"..\nAt present he is working on an opera and a Concerto for flute and\norchestra «hi* Hill be premiered by the 0011\nof Piarra Montaus, at the Carnegie Chamber Hall on the night of\nOctober 5, 1953. At present he is teaching at the Manhattan school\nof Music*\nTwo copies of the musical score are being sent to you under\nseparate cover.\nPat* i.ym dramatic woric. the BAEB submite \"The Sea Lion Flippers\".\nThis was witten by Lister Sinclair aid directed and produced by Andrew Allen\nS the Canadian Broadcasting Corporation for the NationalAssociation of\nEducational Broadcasters. It is based on the research, writing and advice\nft professor (alter Oddaehrrddt of the University of\noriginal music wae provided by Luoio Agostini. Copies of the script in\nboth English and French translation are being shipped to you under separate\ncover.\nHAEB's entry for the Italian Free. Association Prise in ths field\nof docummta? broadSLting is \"A word in lour Ear\" - AJtudy ^Language.\nOriginal music here haa aleo been provided by Lucto Agostini, the »« P\nwaawritten by Lister Sinclair and directed and produced by Andrew Alim.\nIt toa studT in the origin and development of language based on m anuals\nof the cultural variations and behavior bet warn one people md another,\nft is ffrfzrm designed to understand the way. of other peoples ao a. to\nprovide a greater international understanding. Coplea of the scripts in\nSth “^iSTand French are being shipped under separate cover.\nBoth \"A ord in Tour Ear\" and \"The Sea lion Flippara\" **ie pro-\nAnead bv the HAEE under the terms of a grant from The Fund for Adult\nFducatlon established ty The Ford Foundation. All right# belong to the\nHAE8 and I am authorised to indicate that the terns of Part 7 of the\nSKfcSi?r4lTd with. Both scripts are to be publlshm by\nTbeBeacon Press, and copies to ngli* will be mad. available to all\nambers of The Prix ftaUa, if requested.\nEach of the three entries abovmmtlonsa run approximately thirty\nminutes.\nIf there is any other information that you require, or any addi¬\ntional material, I hope you will not hesitate to call on ua.\nWith all best wishes, believe ms\nCordially yours.\nSeymour N. Siegel\nDirector"
}