{
  "id": "d17-49",
  "text": "VW*'!\nY' T '-err'\nC5w44»rt^5*\n*4*v4-\nc^<a.*3-«* j\nVk\n) c~\n<!«_( '\nI 'fw-l >\nDr. Harry J. Skornia, Executive Director\nNational Association of Educational Broadcasters\n14 Gregory Hall, University of Illinois\nUrbana, Illinois\nU. S. A.\nH f\\Efc Or.jp-*\nJanuary 14, 1955 ^7/ />;%\n* \"'ty.\n7/Hr*\n70\nDear Harry:\nID hasten to reply to yours of January 10, which I received\nonly a few minutes ago. I*m a bit puzzled by your request for\n”an extra copy of the Prix-Italia announcement(statute) for\nthis year’s entries,” but believe I can clear up the matter.\n1. The Prlx Italia statute is a book of 50 pages. It\ndoes not change from year to year unless the General Assembly\namends it or unless an additional prize and category of compe¬\ntition is added. The only amendments at the 1953 meeting were\n(a) an extension of the time limit for documentaries from 30\nminutes to one hour; and (b) a reduction of the time by which\nPrix Italia entries must be submitted to the secretariat from\nsix weeks before the juries meet to four weeks. Thus, if you\nhave the Prlx Italia statute, you will be able to copy directly\nfrom it in notifying NAEB members of the rules governing their\n1955 entries, which will be confined to (1) musical works; and\n(2) literary or dramatic works, with or without music.\n2. To date there has been no Prix Italia announcement for\nthe 1955 session. It will be forthcoming before long. But, as\nI said in my NAEB News-Letter article, and as I have repeated\nunder point No. 1 of this letter, NAEB must provide a represen¬\ntative for the 1955 session’s documentary jury. This means\nNAEB may not compete in the documentary competition for 1955,\nbut must confine its entries to (1) musical works; and (2)\nliterary or dramatic works, with or without music. (Just as\nfor 1954 we were represented on the music jury and competed\nin the documentary and literary-dramatic classifications).\nI can tell you confidentially that Prlx Italia this year\nwill be in Perugia, beginning about mid-September. You can\ntell other NAEB officers this, confidentially. RAI is not yet\nready to announce it and I’ll send a NAEB News-letter piece just\nas soon as it is released for general circulation.\nI will try to send you another copy of the Prix Italia\nstatute, in the event you do not have one. But it would cost\na fortune to send it airmail, so I hope you can wait three weeks.\n(My postage bill eats up a good portion of my incidental allowance\nanyhow, even with you coming through nicely for me on the air\nfreight charges for Letter from Italy tapes).\nBelieve me, Harry, as Sy knows, I will do anything I can\nto facilitate wider NAEB participation in the screening for Prix\nItalia entries, and anything overall that will improve NAEB’s\nshowing at Prix Italia.\nThanks for the note on the-, additional tapes. I know Cliff\nNaughton will be delighted to(jma® from you.\nBest."
}