{
  "id": "d17-84",
  "text": "Robert F. Wagner,\nMayor\nSeymour N. Siegel\nDirector\nWNYC\nTHE CITY OF NEW YORK\nMUNICIPAL BROADCASTING SYSTEM\nMUNICIPAL BUILDING\nNEW YORK 7, N. Y.\nWHHeHall 3-3600\nWNYC-FM\nAugust 21, 1956\nVAEB\nDr. Harry J. Skornia\nExecutive Director, NAEB\nGregory Hall\nUniversity of Illinois\nUrbana, Illinois\ni\nDear Harry:\nIt is impossible for me to personally get to Rimini this year to represent\nNAEB at the Prix Italia. I believe that I previously indicated to you that\nthere are no funds available and since I have already been abroad once\nthis year, I cannot see my way clear to assume an expenditure out of\npersonal funds. I have therefore designated Bernard Buck to represent\nNAEB at the General Assembly and have so indicated to the Secretary-\nGeneral.\nWe have this year submitted one work in the documentary classification\nentitled, \"Sounds of My City\" which is the closest approximation to the\nactuality concept of the European Broadcasting organizations that I know\nof. I am optimistic about our chances.\nWe have also submitted one musical work, \"The Ruby\" by Norman del Joio,\nsent to us by Elmer Sulzer of the University of Indiana. Altogether there\nwere some dozen entries from NAEB stations this year, which is a marked\nincrease in interest over last year. It is unfortunate that the Jury did not\nconsider these of sufficient competitive excellence to warrant the com¬\nparatively large expenditure in submitting these works. Parenthetically,\nthe $100 expenditure for translation alone, is only one fractional cost.\nPostage for the transmission of the tapes which has been borne by WNYC\nis in excess of $60. Other costs of getting juries together, lunches, etc.\nwill give you some idea of the magnitude of the single operation of merely\nsubmitting what hopefully may bring a commensurate return.\nI am sending to you under separate cover two copies of the English and French\nScripts for both entries. Copies are/hlso being sent to the members of\nthe International Relations Committee and to Frank Schooley. Entrants of\nthe unsuccessful musical and dramatic w/orks are being notified.\nWith all best wishe\nsns -lg"
}