{
  "id": "d17-89",
  "text": "Mr. Prank Schooley\n-2-\nSeptember 25, 1956\nA report from tha Secretariat on the activitiaa of 1956\nindicates that there was an increase in membership in the Prix Italia.\nIreland, MHK of Japan and Poland had become member# Tha Secretary\nreported that the life of the Prix Italia depends on the quality of\nthe eorfe submitted which have, in themselves, spread word of the\ncompetition. The entire concept is useful in shoeing the variations\nin program products of the various broadcasting organisations who are\nmembers.\nDetails on the financial situation will bo forthcoming.\nThe Assembly in Perugia last year gave the task of prtparing\na documentary television prise based on the Italian Radio grant of\ntwo minion lira to the Secretariat. Advice was received from the\nEuropean Broadcasting Union. The question of when the prise was to bo\nawarded in 1957 and 1953 brougit about a long discussion with the lineup\nof thoee in favor of ' 57 against those who felt that television in Europe\nis still \"too fluid'*. This latter group included the United Kingdom.\nIt was decided that 1957 will bo the time for the awarding of the first\nprise after the French Broadcasting System switched its position on the\narrival of its Director-General, Latimer Porch#1* The aforementioned\nsub-committee will work on this aspect of planning as well as the\ndocumentary definition. An interesting discussion took place in con¬\nnection with the question from the BBC as to whether the ITA (the com¬\nmercial television organisation in Britain) would bo eligible. The\nruling was \"only when a member of a sound radio organisation does not\nhave television with entries from other than the present members be\neligible\".\nIt was further decided that all member# could submit ons or\ntwo entries in the television field. This was a concession to countries\nwith multi-lingual services such as Canada. The Juries for 1957 have\nboon named and MASS will bo on the Music Jury. This means wo cannot\nsubmit any musical works in 1957, but we will be able to submit two\nliterary or dramatic works and one documentary.\nI hope to get more detailed information on the entire meeting\nbefore long, but I thought that this preliminary report would bo of\ninterest to you.\nWith til best wishes, believe no\nCordially yours.\nSHS/cb\nSeymour R. Siegel\nDirector"
}