{
  "id": "d1039-10",
  "text": "- 3 -\nL\n50,000 people. All these communities need educational opportunities which\ncan he provided by television, often only by television. Each community,\nwhether large or small, urban or rural, has an equal right to such basic\ntelevision facilities as can be made available.\nThe need, obviously, is great, and it is immediate,\nRoughly three-fourths of the metropolitan centers, most of the smaller\ncommunities, and almost all of rural America, are without educational tele¬\nvision. Each group should have frequencies available for such service when\nit can be established.\nFurthermore, it is imperative that the primary educational television\nchannel in a community be available, where ever possible, in the Very High\nFrequency band. Most of the large population centers are geared for VHF\nreception. Furthermore, VHF offers greater service coverage at less cost\nto television centers embracing several small towns and a large rural\narea.\nUnfortunately, under the present rules of the Federal Communications\nCommission, there are not enough VHF channels available to serve all the\nneeds of education for a primary nationwide system. The survey disclosed\na minimum need for 97 additional VHF channel assignments across the coun¬\ntry, while only 48 are available. And of these 48, only 31 are located\nwhere they fit the pattern of need. Thus, 66 needed VHF channels are not\navailable in the present table of allocations.\nA partial solution of the problem would be to \"drop-in\" additional\nVHF channels in certain areas. It could be accomplished with a slight\neasing of present rules that control spacing of assignments, and a\ndirectionalizing of antennas.\nThe remaining deficit must be met with Ultra High Frequency channels,\nthough the use of UHF for primary service is limited to those communities\nwhich are equipped for it. It is obviously futile to broadcast on fre¬\nquencies which cannot be received by the community.\nAs for the colleges and universities, their administrators agreed\ngenerally that the proper use of television could solve many of their\nteaching problems. And all felt that sufficient channels should be made\navailable.\nThe following table indicates their position on the need for facili¬\nties :\n1. Use or plan to use broadcast television 45.0$\n2. Concerned with inter-institutional cooperation\nthrough television 37.0$\n3« Weed additional channels 82.5$\n4. Present number of channels sufficient for\ntheir needs\n15.0$"
}