{
  "id": "d1039-100",
  "text": "- 93 -\nL\nNEW MEXICO\nNew Mexico, one of the larger states in area, is very sparsely popu¬\nlated. But New Mexico has been developing rapidly, and shows a population\nincrease of almost kQPjo in the past decade.\nNew Mexico has 10 colleges and universities with a total enrollment\nof approximately 17,000, ,and a public school enrollment of approximately\n210,000.\nNew Mexico has five educational television reservations. One channel\nhas been activated, at Albuquerque. This station is a cooperative effort\nbetween the state university and the school systems, and also serves the\ngeneral public.\nThe educational authorities at all levels, as well as the governor\nand the state legislature are enthusiastic about the possibility of edu¬\ncational and instructional television in New Mexico. New Mexico has\norganized a Commission on State-wide Television for Educational Purposes\n(this is referred to as STEP). This Commission has completed extensive\nfeasibility studies, and has developed a state plan for the systematic\ndevelopment of educational television to provide full state coverage.\nDetails of that plan have been carefully engineered and the use for it\nhas been justified. The Commission says:\n\"Use of television for educational purposes has increased\nsharply in New Mexico during the past year, placing the\nstate among the leaders in development and use of this new\nmedium of education. More than 10,000 children in public\nschools within a 110 mile radius of Albuquerque are now\nreceiving a portion of their classroom instruction by way\nof television. It is estimated that 6,000 pre-school-age\nchildren are regular participants in daily television\nkindergarten classes. Hundreds of college students are\nreceiving virtually all of their course material in humani¬\nties and bookkeeping by television. Several hundred\nteachers are participating in credit courses at the graduate\nlevel by means of television. Despite these rather startling\nfigures, the potential value of television to the public\nschools, the colleges and universities, and the general\npublic remains well above present levels of achievement.\"\nTo make sure that the level of achievement in television instruction\nkeeps pace with the value of television to education, the STEP Commission\nhas devised and engineered a comprehensive plan for state coverage for\nthe years ahead. The report from the STEP Commission written by Dr. Claude\nHempen, its director, states:\n\"New Mexico will utilize television for educational purposes\nin three ways:\n1. Open channel VHF broadcasting. There will be four VHF\ntelevision stations needed to adequately serve New Mexico"
}