{
  "id": "d1039-107",
  "text": "- 100 -\nthe planning and experimental stage, but the only way\nthat educational and cultural needs in North Dakota can\nbe met is through broadcast television.\"\nDr. Peterson says he feels that the people will demand educational\ntelevision, that the recent action of the legislature indicates this.\nThe action of the recent legislature was the first legislative support\nthe educators have received in the state-wide development of educational\ntelevision. As a result of the new emphasis and increased desire for\nbroadcast channels occasioned by the legislative action. Dr. Peterson\nstates that he definitely believes that sufficient channels should be\nreserved in North Dakota for the eventual needs of the state.\nThe legislative action, while not great in extent, has the capacity\nto influence the future use of educational television in North Dakota.\nThe legislative action was contained in Senate Bill #179 of the 37th\nLegislative Assembly of North Dakota. It authorized the Superintendent\nof Public Instruction to contract with non-profit corporations for the\nprovision of educational services in the state and made appropriations\nfor this purpose.\nThe sum of $46,356 was appropriated to the Superintendent of Public\nInstruction for the purpose of contractual payments in carrying out the\nprovisions of the act during the two-year period following.\nThe North Dakota State University at Fargo substantiated the sug¬\ngestions put forth by Moorehead College in Minnesota. It said:\n\"The Fargo-Moorehead twin communities have three insti¬\ntutions of higher education - North Dakota State University,\nMoorehead State College, and Concordia College* Even\nthough there is every likelihood that we will have a commu¬\nnity owned and operated station within the year in Fargo,\nat least one ard preferably two channel reservations in\naddition to those we already have would be wise planning.\nIt may be possible to work a single channel reservation\namong the three institutions, but since two are in\nMinnesota, and we are in North Dakota, inter-state financing\nwould be a problem. Two channel reservations, one for NDSU\nand one in Concordia might best fit the long range plan.\"\nNorth Dakota State University also said that broadcast television\nwould help them relieve some of the pressures, particularly in the basic,\nhigh enrollment courses. The university pointed out that broadcast\ntelevision would allow it to serve at home many of those students among\nthe 30$ who come from a 25-mile radius. In addition, broadcast tele¬\nvision would allow it to serve a much broader educational audience. The\nuniversity anticipates a budget for facilities and personnel in the next\nlegialstive session in 1963. A first effort in this direction could be\nin the form of closed-circuit facilities with cable links to the commu¬\nnity owned broadcast station in Fargo. In any event, the survey indicates\nthat the University will ultimately need its own outlet or outlets."
}