{
  "id": "d1039-108",
  "text": "- 101 -\nNorth Dakota now has six channels reserved for education. Three\nof these channels are VHF and three are UHF. The larger areas of popu¬\nlation in Grand Forks and Fargo in the eastern part of the state have\nVHF channels reserved. Should the plans projected hy the State\nDepartment of Education and the ideas of broadcast television use which\nmotivates the legislative interests mature, at least one additional\nchannel will be needed in each of the present outlets. There are at\nleast one or two intermediate areas which would be served well by low-\npower UHF stations. A projection of the plans and aspirations of the\neducators in North Dakota and of the indicated needs shows that at least\neight additional channels need to be reserved for future use. Six of\nthe eight parallel the present locations of assignments and at least two\nare needed to serve as extended satellite stations in isolated areas.\nNorth Dakota will be a vital part of the Upper Midwest Six-State Network\nwhich is now being organized with Minneapolis as its focal point in the\nnorthwest and Omaha-Lincoln as the focal point in the south.\nOHIO\nOhio is a very populous state with seven large metropolitan areas,\nand 14 small centers with populations in excess of 50,000. It has 6l\nfour-year colleges and universities with an enrollment of approximately\n167,000, and four two-year colleges with a total enrollment of approxi¬\nmately 4,000. Its public school enrollment is approximately 1,800,000.\nInstructional television has had considerable development in Ohio.\nFour channels have been activated and the stations operate instructional\nprograms on all levels of education, as well as for the general public.\nHowever, community programming in Ohio has been extremely inhibited by\nhaving all its educational channels in the UHF band. The predominant\nservice in Ohio is VHF and the majority of available receivers in the\ncommunities are therefore tuned for VHF reception only. Considerable\nheadway has been made in some areas, such as Columbus and Cincinnati,\nin procuring conversions to UHF reception, because of the kind and\nquality of programming which emanates from these stations.\nFive UHF channels are reserved for education in Ohio, in addition\nto those now on the air, and an additional channel has been requested at\nAthens.\nIn i960 the Ohio Legislature created the Ohio Interim Educational\nTelevision Study Commission, and charged it with the responsibility for\nconducting an\n'engineering study, and such other studies, as may be neces¬\nsary to determine the feasibility, the cost, and the require¬\nments for establishing and providing state-wide educational\ntelevision network services, whereby the educational television\nprograms, station facilities, and channels now in use or\nobtainable, may be made available to every Ohio citizen in and\nout of school.\""
}