{
  "id": "d1039-11",
  "text": "5. Undecided about need for more channels\nIhe figures alone do not indicate the extent of the need expressed\nby the large proportion of the schools. Nor do they bring out the re¬\nlation of closed-circuit to broadcast facilities. Closed-circuit\nfacilities, wherever used or contemplated, were thought of as additional,\nand often preliminary, to broadcast facilities.\nMost of the schools held that two or more channels were necessary to\nprovide for complex schedules, the number of courses, and the various\nareas of service. And, as the above figures show, many of the schools felt\nmulti-channel service could be shared effectively, a fact which was con¬\nsidered in computing the need for channels.\nThe number of channels needed by any school system, or complex of\nsystems, depended not only on the size of the community but also, to\nsome degree, on the scope of use planned. Method of instruction seemed\nto have some additional bearing upon multiple channel use. Where de¬\nficiencies are greater, and instruction by television is planned as total\ncourse presentation, or as regular systematic instruction on any basis,\nthe need for channels is greater. All these factors were included in the\nfinal projection of total minimum needs for each state.\nThe school systems in the country reported a greater need for edu¬\ncational television than the colleges and universities. While some\nstates and school systems are far in advance of others, with a less urgent\nneed for facilities, the survey showed that over 95 percent of all public\nschools had serious curriculum deficiencies or teaching needs. Most felt\nthey could be met, or greatly helped, by broadcast television.\nDespite the many differences in local resources for development,\nmost states and individual communities indicated that full development\nof television facilities was expected within the next ten years, through\none means or another.\nThe school systems, like the colleges, showed a growing desire for\na cooperative effort. And in many instances, a beginning could be seen\nof a closer relationship between the schools and colleges in sharing in¬\nstructional resources and in academic articulation. Such cooperation\nwas especially apparent where instructional television had been mutually\ndeveloped, or cooperatively used.\nB’or a number of reasons, the schools indicated a greater demand for\nmultiple channels than did the colleges• Differences between elementary\nand secondary instruction, and the added pressure of special education\ndepartments and junior colleges, combined to increase the need for flexi¬\nble schedules and numbers of courses requiring simultaneous broadcasting.\nTable No. 6 tabulates briefly, state by state, the results of the\ntotal survey. The second part of the survey is more graphically pre¬\nsented in the four sectional maps of the United States with the three\ndifferent color patterns, which are attached to the Appendix of this re¬\nport."
}