{
  "id": "d1039-112",
  "text": "- 105 -\nnorthwest, one in the southeast), if possible, and that there should be\nprovision for future dual channeling as more of these small prairie\nschools become dependent upon instructional television as a source of\nquality instruction*\nA projection on this basis, coupled with an engineering projection,\nindicates a minimum need for 17 additional channels for educational tele¬\nvision in Oklahomao\nOREGON\nOregon has one large center of over 100,000 and five small centers\nof over 50,000 population. Much of the population lies in the extreme\nwestern part of the state. More than half the people of the state live\nin small towns or rural areas.\nOregon has 21 colleges and universities with a total enrollment of\napproximately 3^000. Public school enrollment is approximately 375>000.\nThe state has three educational television reservations, two of which\nhave been activated. The three stations are in the extreme northwest\ncorner of the state in the region of the greatest concentration of popu¬\nlation.\nThe two stations on the air, Channel 7 at Corvallis and Channel 10\nat Portland, are owned and operated by the Oregon State System of Higher\nEducation. The General Extension Division is directly responsible for\nadministration of the State’s Educational Television Network. Through\nthe interconnecting of Channel 7 and Channel 10, the Division can provide\ncontinuing education and instructional services to 70$ of the state's\npopulation.\nPlans are now being made to extend broadcast facilities to the\nOregon College of Education, Southern Oregon College, and Eastern Oregon\nCollege. The needs of these institutions are now being documented. As\nyet there are no reservations provided for education in eastern Oregon,\nbut authorities believe consideration must be given the areas of Medford,\nKlamath Falls, Pendleton, La Grande, Bend and Lake View. And along the\ncoast there must be consideration of Astoria, Newport, and Coos Bay.\nThere is also an expected need for multiple low-power channels by commu¬\nnities within the present service range, to serve local school district\nneeds.\nThe Department of Education of Oregon is charged with the responsi¬\nbility for the development, coordination, and approval of all educational\ntelevision programs for in-school viewing for all elementary and secondary\nschools in the state; and for in-service education programs for teachers.\nPresent plans call for providing an in-school teacher service on a state\nnetwork basis for grades kindergarten through grade 12, beginning with\nfive hours weekly and growing to ten .hours within two years. However,\ns‘- the state network will not serve all of the local needs. Demands for"
}