{
  "id": "d1039-117",
  "text": "- 110 -\nthis totals approximately 35. Some modification of\nthis number would be possible if the Commission would\nsee fit to allow us to cover some of these areas by\nfeeding directly from our closed circuit facilities\ninto medium-power translators, providing these trans¬\nlators could be used on some of the lower channels.\"\nDr. Jesse T. Anderson, State Superintendent of Education for South\nCarolina, reports:\n\"Although we have closed-circuit television in South\nCarolina, I have always been an advocate of broadcast\ntelevision and I hope that some day we may eventually\nuse the channels allotted to South Carolina. As for\nour needs, let me say that three channels — one VHF,\nand two UHF -- would not cover the state. We have 1,418\nschools; 6l4 white elementary, 269 white high, 389 negro\nelementary, 146 negro high. Our enrollment this year\nwas in excess of 610,000 and estimates for the present\nyear are 620,000. We expect an annual increase for the\nnext ten years of 10 - 12,000. You can see from the above\nfigures that it would be difficult to cover the state by\nclosed-circuit television, and I have already stated three\nchannels will not cover the state.\"\nWhat Dr. Anderson did say is that South Carolina will need its\nclosed-circuit operation plus an extended operation of open circuit\nbroadcast in order to meet instructional needs. The indicated need of\nthe various communities is for service by 35 low-power UHF broadcast\nstations. Survey respondents said Channel 7 in Charleston should be\nactivated for the general use of that area, along with an additional\nstation in Columbia, center of the state and the state capital. On\ndemands projected by Mr. Kalmback, General Manager of the Closed Circuit\nOperation, and by Dr. Anderson, State Superintendent of Schools, South\nCarolina requires at least 32 additional channels for its future oper¬\nations.\nThis proposal, of course, is based entirely upon service to the\npublic schools. It reflects no extended service for higher education\nin South Carolina. But since, in the general survey, the state university\nand two of the colleges in the western part of the state expressed interest\nin the development of instructional television some provision should be\nmade for future facilities for higher education. Even allowing for the\nsharing by higher education of some of the working facilities envisioned\nby the State Department of Education and the closed-circuit system, there\nshould be at least five additional channels provided for special on-\ncampus service. This would mean a total of 38 additional channels for\neducation in South Carolina.\nL\nSOUTH DAKOTA\nSouth Dakota is another of the large states with a small, scattered\npopulation. It has no large centers of population, and only two areas"
}