{
  "id": "d1039-118",
  "text": "- Ill -\nSw\nin which the population could he considered to approximate 50,000* An\nestimated 9&fo of the total state population is in very small towns or\nin completely rural areas.\nSouth Dakota has 13 four-year colleges and universities and 2 two-\nyear colleges, with a combined enrollment of approximately 14,000.\nPublic school enrollment is approximately 144,000.\nSouth Dakota has four educational television reservations, two\nVHF channels and two UHF channels. None had been activated at the time\nof this survey, but Channel 2 at the University of South Dakota in\nVermillion has since gone on the air. A tentative agreement to partici¬\npate in the Upper Midwest Six-State Educational Television Network\nexists.\nThe largest community — Sioux Falls, in the extreme eastern part\nof the state -- has an unused reserved channel in the UHF band. Survey\nconsultants learned that there has been recent discussion of the pos¬\nsibility of activating this channel. Meanwhile, the public school\nsystem of Sioux Falls has been using some early morning broadcasts on\na commercial outlet.\nDr. M. F. Coddington, State Superintendent of Public Instruction,\nwrites:\n\"South Dakota is a rural state with few communities which\nare large enough to support an educational television\nstation. For this reason little progress has been made\nin this field. We need educational television to supple¬\nment the rather limited instruction which is now available\nin many of our schools. We think that our only hope for\nadequate educational television coverage will be by means\nof a state-wide network. We are interested in the proposed\nUpper Midwest Six-State Educational Television Network.\nThe 1961 Legislature in South Dakota adopted a resolution\nrequesting the State Legislative Research Council to make\na study of educational television and especially the pro¬\nposed network. We believe that sufficient channels should\nbe reserved for South Dakota to establish the proposed net¬\nwork. \"\nMrs. Preston Scott, State President of the South Dakota Congress\nof Parent-Teacher Associations, says:\n\"We have a greater need in South Dakota than some of\nthe more populous areas because of the extreme distances,\nand we will always have some small school systems where\nthe curriculum will be limited. Teacher preparation in\nSouth Dakota is not comparable to that obtainable in the\nlarger systems. For the same reasons the entire popula¬\ntion would benefit greatly by having informational,\ncultural programming available on television. Even now"
}