{
  "id": "d1039-120",
  "text": "Knoxville and Chattanooga, third and fourth largest Tennessee\ncities, have UHF reservations. This has retarded activation in those\ncities. But recently interest has quickened, the survey learned, and\nboth cities expect to make progress during 1961 and 1962 toward activa¬\ntion of channels.\nAt the present time, the Tennessee Educational Television\nCommission is active in administering the operating funds for Channel 10\nin Memphis, and in acting as a coordinating agency for all efforts in\nthe state. Channel 10 in Memphis is operating regularly, but the survey\nfound no plan for, and only casual interest in, an additional reserva¬\ntion for that area at this time. Efforts, apparently successful, are\nbeing made to activate Channel 2 in Nashville, but the survey found\nlittle interest for an additional channel or expanded services.\nChattanooga, through the city schools, is offering three courses each\nweek to elementary school pupils. Interest in activating Channel 56 is\nstrong, and a formal tri-state organization has recently been established\nto further this effort.\nKnoxville has a metropolitan educational television council, organ¬\nized by the University of Tennessee, which is producing seven and one\nhalf hours of classroom teaching each week. The membership of the council\nwill be expanded next year and will begin efforts to activate Channel 20\nin that city.\nEducational leaders in Tennessee generally agree that one more\nreservation is needed between Knoxville and Chattanooga, and that each\nof the four major metropolitan areas will need at least two stations on\nthe air within ten years if it hopes to offer any kind of adequate cur¬\nricula for the various grade levels of school and college. This would\nmean at least five additional reservations for Tennessee.\nDr. Joe Morgan, the State Commissioner of Education, writes:\n\"There will be a need for expansion of television facilities\nwhich will increase the next ten years. The success of the\neducational television station in Memphis and the results of\nexperimentation in a pilot situation in Tennessee schools and\ncolleges has demonstrated the value of educational television\nand will insure its expansion in the future. There is a\ndefinite plan to extend the use of broadcast television and\ntelevision channels should be reserved in sufficient numbers\nto meet the needs of the future in Tennessee,\"\nWith the continuing encouragement of the state legislature and the\nindicated development in Nashville, Knoxville, and Chattanooga and the\nother smaller centers, it is evident that the full use of instructional\ntelevision will require multiple channels for in-school programming^ as\nwell as for the use of higher education, and in extension programming\nfor the general public. On this basis, and projecting the total infor¬\nmation received from data sources in Tennessee (including recognition\nof a need in the Bristol-Johnson City area, in the area between Knoxville"
}