{
  "id": "d1039-126",
  "text": "- 119 -\nteaching, and increasing numbers of students within limited\nnumbers of classrooms and laboratories, and with limited\nnumbers of faculties. Educational television’s potential\nlimit for heightening and extending the quality, as well\nas its assistance in meeting the demands of quantity of\neducation is likewise considered significant. Observation\nof the experiment at the University of Utah in which UHF\nsystems are being employed for distributing the instructional\nmaterials suggest that possibly two or three additional UHF\nchannels could eventually be utilized for education in this\narea.\n\"Our second major consideration centers about the responsi¬\nbility of land-grant universities for carrying educational\ninformation to the citizens of the state. This suggests\nthen, the need for additional VHF channels for education.\nFor the present at least, VHF is the only feasible means\nfor reaching the public over great distances through the\ntelevision medium, land-grant institutions should have\naccess to VHF stations distributed about the state in such\na fashion as to give coverage to most of the state’s popu¬\nlation;, A series of microwave channels to link such stations\ntogether would be an accompanying necessity. Our estimate\nis that a network of seven VHF stations linked together could\nserve the needs of essentially all of Utah’s population. At\npresent VHF channel allocations are being utilized for edu¬\ncation only in Salt Lake City. In addition there are com¬\nmercial VHF channel allocations for which commercial utilization\ndoes not appear imminent and which could possibly be used\neducationally in the state network in the following: Logan,\nChannel 12 (CP - already in possession of the Utah State\nUniversity); Cedar City - Channel 5; Price - Channel 6;\nProvo - Channel 11; Richfield - Channel 13, Vernal - Channel 3.\nWe have already proposed to the Utah Educational Television\nFoundation that these channels be utilized and linked into an\neducational network to serve the state of Utah for adult edu¬\ncation and extension generally and for such in-school needs\nas confront the local districts in each area.\"\nDr. Wilbur N. Vail, State Superintendent of Public Instruction of\nUtah, says that the ultimate objective of the State Department of Education\nfor in-school television is a state-wide coverage through all of the\nmultiple television systems that can accommodate the varying needs of\nindividual districts, and permit them some selection. Dr. Vail says also\nthat there is a rather strong argument favoring the extension of television\ninstruction coverage into small counties. The science, mathematics,\nsocial studies, and foreign language programs, especially at the elementary\nlevels, can be greatly enriched through educational television. He says\nsome small school programs in outlying areas are at present inadequate.\nHe points out that with a multi-channel television system, the educational\nsystem could rebroadcast the programs and materials in many combinations\nand at varying times, and so more efficiently and satisfactorily serve the"
}