{
  "id": "d1039-13",
  "text": "- 6 -\nIntroduction\nL\n•w\nTen years ago the picture of educational television was fuzzy.\nFew had more than an amorphous concept cf television as a medium\nfor educational use. Many of those who did at that time have a be¬\nginning appreciation of the mediums potential in the process of ed¬\nucation were understandably -and legitimately ignorant of the actually\npressing need developing even then for immediate use of this relatively\nunexplored facility.\nNonetheless, there was among educators a growing appreciation of\nmass communication media and a feeling of responsibility for experi¬\nmentation in this field. Initial demands for spectrum reservations\ngrew largely out of this attitude.\nActing jointly, the educators approached the Federal Communications\nCommission approximately ten years ago and persuaded it to set aside a\nportion of the established television spectrum for the general use of\neducation. At that time neither the educators nor the Federal Communica¬\ntions Commission had more than a nebulous notion of the number of fre¬\nquencies actually needed.\nBecause educational needs for television were then in a shadow\narea, the channels finally reserved 2 years later for education have\nseemed in afterthought to have been assigned in an irregular pattern.\nBut, generally, it was not possible for the Federal Communications Com¬\nmission, in logic, to follow, in establishing a Table of Assignments,\na rigid application of the \"priorities\" in its Third Notice. And,\ngenerally, educators were at the time they received them ill equipped\nto question the assigned reservations. They could only accept them,\noften without knowing whether they could, or would, use them.\nPopulation has been one of the Important criteria for distribution\nof assignments. In Its Sixth Report and Order the Commission points out\nthat the following table reflects generally the number of assignments\nmade to cities falling within the indicated population groupings:\n1950 Population of Cities Number of Channels\n(Central City) (Total VHF and UHF)\n1,000,000 and above 6 to 10\n250,000 - 1,000,000\n4 to 6\n50,000 - 250,000\n2 to k\nChder 50,000\n1 or 2\nThere are, of course, variations from this pattern, the Commission\ngoes on to say, because of the many factors and circumstances that had to\nbe considered in connection with making a final judgment as to the exact\nnumber of assignments that should be made for any particular community."
}