{
  "id": "d1039-133",
  "text": "counting Channel 57 which was jointly assigned to Wheeling and\nSteubenville, Ohio. None of the channels has yet been activated.\nThe survey found little concern in the area of higher education with\nbroadcast television in West Virginia. The University of West Virginia,\nat Morgantown, is not contemplating establishment of its own station. It\ndid report that several areas of the University have indicated a strong\ndesire to make use of television as a teaching tool.\nA group of six West Virginia colleges in the north, together with\nthe University, are members of the West Virginia Area Educational .\nTelevision Committee. This group is working toward a cooperative tele¬\nvision course or courses for credit programs on all seven of the campuses.\nConcord College in Athens expressed interest in television. The\nnew Fine Arts Building there is being planned with television studio\nfacilities. Survey consultants were told that in the general area of\nConcord College there are many poorly prepared elementary school teachers\nwho could take needed courses if they were offered by broadcast tele¬\nvision. For a variety of reasons, many of these people are unable to\ntake courses by normal extension methods, or during summer sessions.\nBecause of this Concord College feels that broadcast television through\nits institution would improve the quality of education in the general\nservice areas.\nMarshall College, in Huntington, has under consideration the possi¬\nbility of creating some two-year branches in other parts of the state.\nThe Dean of Applied Science there feels that broadcast television offered\na possibility of teaching some of the courses at these cities some\ndistance from Huntington, and so improve instruction as well as make it\navailable to more students. Marshall College is particularly concerned\nthat reservations in West Virginia are all in the UHF area, and the\nmountainous terrain is a tremendous handicap to them. Some feeling was\nexpressed that multiplicity of low-power channels might overcome the\nhandicap in some instances.\nShepards College at Shepardstown indicated it is looking toward a\nfuture in which it might be able to afford television facilities and\nbroadcast television for in-school, on-campus and extension of college\nservices.\nDr. John R. St. Clair, former State Superintendent of Public\nInstruction of West Virginia, believes that broadcast television can add\nto the general enrichment of all areas of curriculum, and can overcome\npresent curriculum deficiencies. He also indicates the great need for\nthe continuing in-service training of teachers. Dr. Clair believes\nit essential that West Virginia establish a legal authority to develop\neducational television. He says this might be accomplished by developing\nan interest in connection with the centennial year of West Virginia, for\nwhich activities are now being organized for 1964. He emphasizes that\nthere is a need for many more VHF channel reservations for education in\nWest Virginia, a need heightened by West Virginia's rough terrain."
}