{
  "id": "d1039-136",
  "text": "- 130 -\nIn Wisconsin, we anticipate particularly the future needs\nto provide for the sharing of educational resources through\nthe inter-linking of the Madison campus with the University\nof Wisconsin at Milwaukee, and with the extension centers\nand state colleges throughout the state. To accomplish\nthis, it is our conviction that the best possible television\nchannels must be made available to the forces of education.\nDr. G. E. Watson, State Superintendent of Public Instruction, writes:\nSmaller and rural school districts cannot provide diversity,\nquality, and specialization of instruction that is available\nin more populous, favored and wealthy districts. These\nneeds could, in part, be met by broadcast television.\nCertainly there could be improvement. As scope of knowledge\nincreases and amount of training increases, needs for\nincreased and improved instruction will increase. As school\ndistrict organizations accelerate, and other instructional\nmedia are utilized, the need for television will be\nrestrained. At the present time, there is no planning for\nthe extension of broadcast television in Wisconsin by the\none body capable of implementing and planning, namely the\nState Legislature. I believe that the television channels\nshould be reserved in sufficient numbers for education to\nprovide for future needs.\"\nThe Milwaukee Public Schools report that one of the greatest restric¬\ntions of television for instructional purposes is the limited channel\nallocations. The Director of the Television Department of the Milwaukee\nSchools says that he envisions a need for 6 to 12 channels in the\nMilwaukee area to enable television to reach its full potential of instruc¬\ntion there.\nBoth Dr. Harold S. Vincent, Superintendent of Milwaukee Schools, and\nDr. Dwight Peel, Assistant Superintendent in Charge of Instruction, support\nthis position. Dr. Vincent says:\n\"We are finding the television medium an effective tool of\ninstruction and anticipate that its use will continue to\nexpand in the future. We strongly urge that an adequate\nspectrum space be allocated for educational purposes so that\nthe maximum use of the television medium can be reached in\nthe field of education.\"\nDr. Peel says:\n\"The use of television in the regular instructional and\nsupervisory programs of the Milwaukee Public Schools is\nproviding an exceptionally valuable service in terms of\nenhancing the quality of instructional programs and making\npossible certain curriculum offerings which otherwise would\nnot be possible."
}