{
  "id": "d1039-138",
  "text": "- 132 -\nThe University of Wyoming at Laramie is apprehensive that commercial\ninterest will try to take the Channel 8 reservation away from education.'\nIt vigorously opposes such action. The Executive Assistant to the\nPresident, H. W. Benn, writes:\nMWyoming needs educational television. With our sparse and\nscattered population, the use of this medium is particularly\nimportant in providing educational opportunities for the\ngeneral public and in supplementing the instructional programs\nof our schools and junior colleges. State-wide multiple chan¬\nnel broadcasting is needed and there is a definite possibility\nthat television teaching for our university students is also\nneeded. The following information is presented as evidence of\nthe University’s effort to initiate educational television:\n1. A committee has developed plans for a television\nproject. A very detailed study has been made of the facili¬\nties, equipments, and personnel which would be needed.\nNumerous reports and other publications were reviewed and\nsome television stations were visited, and a consultant was\nbrought in to survey facilities and make recommendations,\n2. Some of the foundations have been contacted relative\nto the possibility of donating equipment or providing grants\nto use in starting a station.\n3. A community television system recently contacted\nthe University Board of Trustees relative to a cooperative\nproject on educational television. These programs would be\ncarried to many communities in Wyoming. The Board has\nexpressed further interest in the matter and has authorized\nme to participate in the further investigation of the pos¬\nsibilities of bringing educational television to the people\nof Wyoming.\"\nPresident Humphrey, of the University of Wyoming, has urged every\neffort be made to retain Channel 8 in Laramie. A reported request by a\ncommercial company that Channel 8 be removed from Laramie to Terrytown,\nNebraska, roused educational officials to prevent such a move.\nDr. Velma Linford, State Superintendent of Public Instruction for\nWyoming, is an enthusiastic supporter of educational television. She says\nit is needed in the state for in-service teacher education, for curriculum\nenrichment, and in isolated elementary and secondary schools, for con¬\ntinuing higher education, and for vocational education for courses outside\nthe schools. She feels these needs will increase during the next 10\nyears, and explains that the State Department of Education’s only reason\nfor inactivity in developing broadcast television has been lack of funds.\nDr. Linford is convinced of the value of the medium, and urges that\nsufficient channels be reserved so that Wyoming can serve its sparsely\npopulated areas where the need is greatest*"
}