{
  "id": "d1039-14",
  "text": "According to its Sixth Report and Order, the Commission also concluded\nthat as a further assignment factor it should provide channels for non¬\ncommercial educational services in 46 communities outside of metropolitan\nareas designated as ''primarily educational centers.\" Certain of these\ncommunities were assigned one channel for non-commercial educational use,\nwhereas they would otherwise not have been assigned any channel; others\nreceived an additional channel over and above the number of channels they\nwould have otherwise received.\nThere is little doubt that what amounted in effect to assigning\nchannels to an apparently secondary service to meet an apparently secondary\nneed - coupled with the confusion occasioned by the general intermixture\nof VHF and UHF channels in the assignment tables - inhibited development of\nthe basic educational service. And educators, pressed at all levels to\nfind physical space for the continually increasing numbers of students,\nand often hard put to obtain minimum teaching staffs, were wary of ven¬\nturing into a new and untried method of teaching. These postwar circum¬\nstances contributed heavily to limiting effective experimentation and in¬\nhibited development of educational television.\nStill, the development of the use of television for education during\nthe last ten years has been impressive and significant. The appreciation\nof the potential of educational television has grown beyond any conceptu¬\nalization possible at the time the original allocations of channels were\nmade• There has been measurable progress from the experimental to the\npractical. As old needs have been met by new methods, new needs have\nbeen revealed, and the demand for educational television has grown.\nDuring this period of progress there has been little projection by\neducators, locally or nationally, to determine the real present, or the\npotential, needs for frequencies for education. As its appreciation of\nthe educational service grew the Federal Communications Commission sought\nand suggested possibilities of increasing the development of this serv¬\nice. But it found no sure knowledge upon which to base a studied con¬\nsideration. With an increasing demand for educational television facili¬\nties, coupled with the increasing possibility of a re-design of the\ntelevision channels allocations system, it became urgent for education\nto acquire some definite knowledge of its needs.\nCn November 25, I960, William G. Harley, President of the National\nAssociation of Educational Broadcasters, submitted a statement to the\nU. S. Office of Education on the problem of determining the needs of edu¬\ncation for use of space in the television spectrum. In the statement he\nsaid:\n\"At present education has a total of 267 reservations, of which\nabout one-third are VHF and two-thirds are UHF -- for the re¬\nception of which there are few receivers. In many major cities,\neducation was assigned only VHF frequencies. The failure of UHF\nto develop commercially has made it virtually impossible to es¬\ntablish educational television stations on UHF channels in these\nVHF areas. If more VHF channels are made available, it will be\nimportant for education's needs to be presented whenever there\nis an opportunity for a VHF assignment."
}