{
  "id": "d1039-140",
  "text": "ANALYSIS A HD BECOIMNDATIONS\nThe foregoing report emphasizes the scope of the problem in developing\nAmerican educational facilities and opportunities to meet the demands of\nthe \"atomic-space” society which faces the immediate future of our people,,\nand indicates in a significant measure the extent to which educational-\ninstructional television must be involved in such development#\nThe statistical tables and engineering maps provide an index to our\nneeds, to the resources available, and to the measurable deficiencies; how¬\never it is in the collective recorded recital of the professional experiences\nand informed opinion of the educational community that is found the real\nbasis for understanding and for recommendations as to policies and procedures.\nIt is apparent from this indication that the deficiencies are many, and\nthe need is great. It is also apparent that every tool must be used and\nevery means explored to provide the facilities to improve instruction and\ncultural development qualitatively and quantitatively if the job is done\nthat must be done.\nIn evaluating the projection of need for broadcast television channels\nin this report, it must be remembered that this projection in no way excludes\nthe use of other media, or precludes the use of different methods of trans¬\nmission. It is all of the same cloth. It is all important and essential,\nand in many instances inter-dependent. The projections made here are con¬\nsonant with, and in addition to all other potentials of educational communi¬\ncation.\nIt is evident, however, that broadcast television can be a medium to\nprovide opportunities and amplify resources in general education and syste¬\nmatic instruction that can be accomplished in no other way. And in spite\nof any technical developments which may result from experiments now under\nway, such as airborne transmission or satellite transmission, it seems\nfairly evident that the increasing needs of education must be met mainly\nby the use of standard television channels and land-based transmitters\nlocally controlled and operated. Such control and operation are in keep¬\ning with the basic philosphy and tradition of the American educational\nsystem, and tends to bring into play all the varied aspects and resources\nof the different states and communities.\nThis is not to say that the developing long-range transmission\nsystems, and the expanded number of frequencies which may become usable\nin some form have no place in educational or instructional television.\nThey will undoubtedly play a very important part in some future needs;\nbut the thing we are concerned with is the development and preservation\nand optimum use of the spectrum resources available to meet the indicated\nneeds of the various states and localities in the next decade.\nWith this frame of reference, and an analysis of the information\nobtained in the general survey, and a study of the report of the engineers,\ncertain recommendations are indicated:"
}