{
  "id": "d1039-141",
  "text": "1* Because the channel usages proposed in this report are based on\na minimum, and future pressures and natural changes may establish different\nneeds, the FCC should by policy, in addition to establishing further reser¬\nvations of the recommended channels, give education equal consideration\nwith any other service in any contest for a specific unreserved channel.\nThis is particularly necessary when the channel in question is a primary\nchannel for the educational-community service.\n2. A primary educational television service with a wide coverage\nof a signal compatible with the receiving potential of each community\nis vital to a nation-wide system of instructional and general, informal\neducation. 3h any revision of the rules or in any attempt at reallocation\nand assignment this should be a guiding principle of the FCC.\n3* Because the minimum channel needs for education can not be obtained\nfrom the available spectrum under the present rules, education must oppose\nany plan to abandon any area of the VHF band. This report emphasizes the\nimpossibility of meeting the requirements of education in the next decade\nwith the frequencies of the UHF band alone.\n4. The ’’Table of Availability” presented in this report is designed\nfrom the present table of allocations of the FCC, and many additional\nchannels can probably be \"dropped-in\" in the various states. However\nsuch an effort was beyond the scope of this study. In order to fill the\nestablished need for channels beyond the availability indicated here, all\neducational institutions and agencies must be permitted to drop-in VHF\nchannels where specific engineering indicates it is feasible and practical.\nThis would require adapting rules governing spacing and directionalizing of\nantenna to the specific situation.\n5* Further studies should be immediately and exhaustively made to\ndiscover possibilities of enlarging the service area of the present tele¬\nvision spectrum, especially in the UHF band, and in view of the indicated\nneed of multiple channels for education. The engineers have suggested\nthe practical possibility of more than doubling the present number of\navailable channels by using electronic computer methods in channel alloca¬\ntion studies. This suggestion should be pursued vigorously.\n6. There are some localities where UHF can be used effectively for\nthe primary educational-community service, if appropriate receivers are\navailable and in general use; .but in most instances UHF should serve the\nmulti-channel needs for regular and specialized education, with the\nexception of some of the sparsely populated areas in the West, where it\nis essential to achieve wide coverage at minimum costs. Special consid¬\neration should be given to such areas.\n7» This report shows that each community or educational complex using\ntelevision for systematic instruction will need from two to twelve channels\nfor simultaneous transmission. To assure the necessary placement and\norientation of multi-channel service, the rules governing UHF allocations\nmust be liberalized."
}