{
  "id": "d1039-146",
  "text": "- 141 -\nFigs. 5 and. 6 show a comparison of the detailed Ohio planning with\nthe national study result for the same state. In state educational plans\nundertaken to date approximately 8 VHF and 15 UHF \"drop-in” channels have\nbeen engineered. The procedure in the UHF case is to take a given channel\nand impose the taboo limitations separately. This can be done by assum¬\ning the channel unckir consideration to have a specific geographical loca¬\ntion and imposing the limitations to determine whether a \"go\" or \"no-go\"\nsituation exists. This procedure cane be adapted for computer tabula¬\ntion, *\nA more informative but time-consuming study involves imposing the\nmileage table restrictions on an area-wide basis wherein the results show\nan area of possible \"drop-in\" condition. A graphic example of the result\nof this technique is shown on Fig. 7* Figure 8 indicates the poten¬\ntial use of 3 new VHF drop-in channels in a state system. Actually the\nChannel 4 drop-in shown for the Kearney, Nebraska, area could also be\nused in Kansas if transmitter sites were properly co-ordinated.\nAt this point the question might be asked whether the presently\nassigned channels available plus \"drop-ins\" truly represent the maximum\nnumber of possible channel assignments. A technical research report\nissued by the Federal Communications Commission adeptly summarized the\nresults of theoretical investigations into the problem of frequency\nassignment carried out in Europe and has applied these techniques to the\ncontinental United States.\nThis work indicates that, theoretically, 8,000 assignments are\navailable in the UHF band alone as compared to a far lower number of\nassignments now estimated as available in the UHF and VHF bands com¬\nbined, It thus appears that further practical investigations might be\nundertaken to increase the potential density of UHF channel assignments,\nparticulary in light of the multiple assignment needs for educational\ntelevision. This should be done now, before expansion into the UHF\nspectrum freezes the pattern of allocation into what appears to be a rela¬\ntively inefficient spectrum utilization mold.\nSUMMARY\nA plan for a national television system has been developed requir¬\ning the reservation of a minimum of 633 additional channels for such\nuse• Adoption of this proposal would bring the number of reserved\nchannels to a total of 906 channels. A somewhat greater need is indi¬\ncated by NAEB studies but it probably would not be possible to meet all\nthese needs within the present Federal Communications Commission assign¬\nment plan framework. Some detailed studies of projected single state\nsystems have indicated that the number of new UHF channels which might\nbe added to the Table of Assignments is relatively limited. Exploration\n* \"A Proposal for Determining Nationwide Television Channel Assignment\nPlans by Computer Methods\", Jansky & Bailey, submitted to National\nAssociation of Educational Broadcasters, Washington, D. C.j July, 1961."
}