{
  "id": "d1039-17",
  "text": "3» Present deficiencies in the curriculum — subject areas now being\nneglected (because of a lack of teachers, instructional resources, or physi¬\ncal facilities) which might be provided by the use of broadcast television.\nb. Curriculum improvement and development — additional subject-\nareas which could be provided to meet future needs through use of broadcast\ntelevision.\n5. Opportunities for increasing quality of instruction by expanding\nuse of available research facilities, resource material, and instructional\ntalent through use of television.\n6. Possibility of meeting increasing need for continuing in-service\nteacher education, and advanced study, at reasonable costs.\n7. Possibility of providing more and better instruction to such special\ngroups as handicapped children and advanced learners through broadcast\ntelevision.\n8. Opportunities for extending influence and service of school or\ncollege into the community through broadcast television by:\na. Providing continuing education for adults and out-of-\nschool youth under circumstances and at costs which may make\ngeneral participation possible.\nb. Providing for older citizens regular counseling, advisory,\nand educational services which may be financially and physically\nfeasible.\nc. Providing service which will tend to improve cultural\nand social standards of the community.\nd. Extending benefits of higher education through televised\ncredit courses for off-campus use.\nFrequently, either the central office of the field consultant was\nrequested to amplify these suggested criteria with further detailed infor¬\nmation. These requests were filled.\nBefore taking the survey to the field, a number of conferences were\nheld with the field consultants and the staff to develop among all partici¬\npating in it a universal understanding of the specific objectives of the\nsurvey. Included in these conferences were a study of the specifications\nof the survey proposal and consultation with the staff and with the con¬\nsulting engineers.\nIt was agreed that the base of the survey was the present problem.\nThis included determination of the present use and development of televi¬\nsion for education, and of the present needs of education. It required\nknowledge of present channel reservations, and the availability, or pos¬\nsible availability, of additional channels under present Federal Communi¬\ncations Commission rules and regulations. It embraced present technical\ndevelopments."
}