{
  "id": "d1039-24",
  "text": "\"The potential value of television to the public schools, the\ncolleges and universities, and the general public remains well\nabove the present levels of achievement. The primary purpose of\nthe STEP commission has been to develop a master plan for the\nsystematic extension of educational television opportunities to\nevery community. The (present) signal can be effectively used\nin the schools of 42 of New Mexico's 93 administrative units.”\nA February 1961 report to the Governor of Florida emphasized that the\npurpose of educational television is to provide a \"means of extending the\npowers of teaching in public education, and of raising living and educa¬\ntional standards of the citizens and residents of the state.\"\nInterest in and development of educational television in one state\ngenerates interest and development in neighboring states. Arkansas early\nin 1961 revived the work of its state committee on educational television\nand, later in the spring, Mississippi called a state meeting to promote\nearly development of its educational television channels. When Alabama\nincreased the number of its reserved channels, Florida the following year\nrequested the Federal Communications Commission to allocate 12 additional\nUHF channels to education. Arizona went on the air in 1961 with its\nsecond channel, and New Mexico announced its plan for state-wide educa¬\ntional television. The success of educational television in Minnesota\ninspired the North Dakota legislature to appropriate, for the first time,\nfunds for educational television development in the schools.\nSo the organizational and physical development continues. But there\nis much evidence also of instructional development. Research of various\nkinds is going on and reports of results and conclusions are issued regu¬\nlarly. Professor Egon Guba of Ohio State University in his i960 report\nto the North Central Association Conference pointed out that there is con¬\nsiderable difference between instructional television and televised in¬\nstruction. He suggests that most of the experience to date has been with\ntelevised instruction, and that the full effectiveness of television cannot\nbe assessed until more effort is devoted to instructional television and\nthe whole potential of the qualitative modulation of the teaching process\nby television techniques is brought into play.\nThis suggestion has great significance in evaluating the \"state of\nthe art.\" The efforts to develop true instructional television as opposed\nto televised instruction has indicated the need for better facilities,\nhigher standards, better training, and more and different kinds of research.\nReports indicate some trends in these directions.\nMore effort to determine effective relationships between members of\ntelevision teaching \"teams,\" and to discover the kind of cooperative pre¬\nservice and in-service training needed to develop better techniques is\nbeing evidenced. Current reports indicate rather wide-spread agreement\nfor research and development in this area.\nThe original development of educational television was sparked in\nlarge measure by the concern for general adult education and by the\nrecognized obligation of the land-grant colleges to foster and promote\nextension education. There is evidence that general adult and extension"
}