{
  "id": "d1039-28",
  "text": "The Legislative Commission in Kentucky stated: \"Educational tele¬\nvision is a ’must* for a state predominately rural in population,\"\nInterviews of representative community organizations in Kansas in¬\ncluded the Kansas State Medical Society, the Junior League, the Congress\nof PTAs, the AFL-CIO, and the Press Association, among others. These\nbodies were generally agreed on the need to cover the state with educa¬\ntional television facilities for continuing adult education, Iowa, a\npredominantly rural state, indicated through a representative group of its\ncitizens that the present allocations of educational television channels\ncannot cover the state adequately and serve the needs of the people for\nadult education.\nA community leader in New Mexico declared: \"Educational television\ncan play a more important part in adult education, especially in a state\nsuch as New Mexico where sparsity of population and great distances limit\ncultural and adult educational opportunities.\"\nIn Southern California a group of educators and representative citi¬\nzens, meeting in March 1961 to discuss the community needs for educational\ntelevision, said: \"educational television is necessary to provide an\nadditional educational and cultural force within the community.\"\nIn Arizona a prominent operator of broadcast stations said: \"educa¬\ntional television is absolutely necessary in the state of Arizona.\"\nThese were the sentiments lacing through the survey interviews of all\nthe communities.\nRepresentatives of the League of Women Voters, the American Associa¬\ntion of University Women, and the Congress of Parent-Teacher Associations,\nwho, to the degree this could be accomplished, were interviewed in every\ncommunity, were in agreement on the need of a covering service of educa¬\ntional television. In the American Association of University Women, Miss\nLucille Ledwith, of Nebraska, and Mrs. Worley Moss, of Pennsylvania,\nsummed it up for their organization when they said, in essence; \"This\nfacility is needed to inform and enlighten the public and to raise the\ncultural levels of the various communities.\"\nMrs. Cecil Ewing, of the Maryland Congress of Parent-Teacher Associa¬\ntions declared that educational television has \"A tremendous potential\nfor urgently needed public education in public affairs and parent educa¬\ntion.\"\nMrs. Preston Scott, President of the South Dakota Congress of PTAs\nagreed, but offered the comment that: \"We have a greater need than some\nof the more populous areas for educational television. The entire popu¬\nlation would benefit greatly by informational, educational, and cultural\nprogramming which would be available,\"\nMrs. John DeBries, of New Jersey, and Mrs. Norman F. Patten, of\nPennsylvania, of the League of Women Voters said, a coverage of educational\ntelevision would make it possible to present complete information on local"
}