{
  "id": "d1039-30",
  "text": "- 23 -\nL\nnow offer a general community service because of the incompatability of\nreceiving facilities are: Buffalo, Philadelphia, Columbus, Cincinnati,\nToledo, Detroit, Kansas City, Louisville, Atlanta, Norfolk, and Wash¬\nington, D. C.\nThis record shows substantively the great need in educational com¬\nmunity television for frequencies which are compatible with the receiving\nfacilities in the various communities.\nThere are in the United States in addition to the metropolitan areas\nand the rural areas some 270 centers of population which have more than\n50,000 people. With one exception, none of these now has any educational\ntelevision facilities, or access to any significant general education\nprogramming.\nThese smaller communities have in this survey indicated a need for\nservice, but no general community understanding of how the facilities\nfor it are to be provided. Many of them are centers of education and con¬\ntain institutions of higher learning. Some are the outstanding communi¬\nties in their states.\nFifty-three of the 60 educational television stations now on the air\nwere questioned concerning their community service. Their answers:\nSome community service 45\nPredominant community service 3\nNo community broadcasting 5\nEngage in cooperative community programming 28\nPlan to expand community programming 12\nFeel they cannot or do not meet the needs of\nthe community 40\nFeel they are meeting the needs of the com¬\nmunity at the present time but are doubtful of\nfuture 3\nThis table of responses is significant. It reveals a need in some\nareas for additional channels. It could suggest the conclusion that some\neducational stations are so involved in formal education that they have\nlittle time remaining for general community programming. It could suggest\nalso that in future allocations of television channels for education the\nneeds of community program service be considered separately from provisions\nfor formal education.\nThe responses in this survey of the various communities to the ques¬\ntion of need for community educational television service, study of the\npopulation distribution nationally, and consideration of the service\npatterns of the active educational stations reveal in their cumulative\nevidence an increasing -- in some cases an urgent -- need for a basic,"
}