{
  "id": "d1039-34",
  "text": "first two years of university work. Thus, they might enroll in branches\nnear their places of residence, and then continue their senior college\nwork on our central campus. Dr. Riddle believes that unless we are in\na position to provide the off-campus centers with instruction exactly\ncomparable to that received in Columbus, these students will inevitably\nmove to Columbus for their instruction. Anticipating this problem in\npart is the just completed study of the Ohio Interim Educational Study\nCommission whose recommendations to the 104th General Assembly call for\na 26-station network interconnected by a two-channel reversible micro-\nwave circuit system. I should point out, however, that the plan calls\nfor one-channel network broadcast distribution, and even before action\nhas been taken on this plan, it is apparent that several broadcast\nchannels will be required. (This, of course, is a lesson taught us by\nthe Hagerstown experiment which attempted to solve its problem with a\nsix-channel closed-circuit system, and MPATI which, with an airplane,\nseeks the same solution through broadcast means.)\n5» If a sufficient number of broadcast educational\ntelevision channels is not available during the next 10-15\nyears in the case of the Ohio State University off-campus\ncenters, we must seek some means of multiple channel micro-\nwave relay interconnections. This solution is only a par¬\ntial solution since it would provide point-to-point communica¬\ntion. In addition, I suspect this would present another\nspectrum allocation problem in the television area.\n\"Summing up. It seems to me, that the problem is clearly\none of growing demands by education for access to limited\nspectrum space, a problem which has been complicated by de¬\nmands by non-educational agencies for access to the same re¬\nsources. Hopefully, technology may provide new ways and means\nof using the spectrum more efficiently. In any case education\nshould seek to stake out the largest possible share of the\nspectrum in order to protect itself against the future.\"\nThis thoughtful and comprehensive statement by the head of one of\nthe largest state universities was emphasized and enlarged upon by many\nother college administrators throughout the country. Among their signi¬\nficant statements were:\n\"If broadcast television facilities were made available to us we\nwould attempt to alleviate the shortage of classrooms and teachers\nby broadcasting certain courses taken by large numbers of stu¬\ndents. It is anticipated that a number of the beginning courses\ncould be handled on television. Moreover, we believe broadcast\nfacilities would enable us to enrich the courses now offered,\nby having students view certain parts of the course on television.\nOther educational programs would be broadcast, supplementing the\nwork of the classroom.\n\"We anticipate further increased enrollment, and our legislature\nhas failed to appropriate any funds for additional classroom\nspace; therefore, we shall have to use every possible means to\nreach the increasing number of students we expect to have. I"
}