{
  "id": "d1039-45",
  "text": "administrators at all levels of education should study ways in\nwhich television can he used as an important medium of educa¬\ntion.\n\"The cost of employing television varies greatly in relation to\nmany factors; but it is not prohibitive in terns of normal edu¬\ncational expenditures.\"\nAt the Institute for Education by Radio-Television, at Ohio State\nUniversity in April of 1961, Dr. John L. Burns, President of the Radio\nCorporation of America, commenting upon the progress of the use of\ntelevision for instructional purposes, said:\n\"The real threat is that progress at this pace might dwindle\ninto no progress at all. In Thornton Wilder*s words ’Every\ngood and excellent thing .... stands moment by moment on the\nrazor-edge of dangerl * the increasing demands for new skills\nand higher scholarship coupled with the growing shortages of\nteachers and facilities give a surgical urgency to the nation’s\neducational needs. What must be done to alter educational\ntelevision’s fragmentized character, to move its electronic\nsignals into classrooms from coast to coast, to link its varied\nelements in a planned program of growth? Much has been written\nof educational television’s bright promise in terms of individ¬\nual experiments, but I believe its ultimate promise can be\nrealized only from an overall approach, because the individual\nexperiment is too small to show the way.\"\nThe needs of the future for educational television service, so\nsharply etched by the reports of the communities and the institutions of\nhigher learning, are reflected with even greater intensity in the national\nstudy of the schools grades 1 through 12.\nDocumented in the section of this report \"Needs of the Future Re¬\nflected by the Several Separate States\" is the harsh finding that two-\nthirds of the elementary teachers in one state have sub-standard qualifi¬\ncations. Another state reports more than half its small high schools have\ninadequate curricula. Yet another describes a large area in which 1,600\nchildren have no organized instruction. The superintendent of one large\nstate school system, harassed by perennially over-crowded classrooms and\nan annual shortage of 3,000 to 5,000 qualified teachers, said, \"We must\nshare our good teachers and our instructional facilities.\"\nThese kinds of reports are documented again and again in the survey\nresponses. They point up the great general need for improved educational\nfacilities; they depict a need for improvement in the quality, as well as\nin the quantity, of education.\nThere was, when this study was being organized, a general conceptuali¬\nzation of this need and some opinion of the ability of instructional tele¬\nvision to supply a major portion of the need. But to obtain evidence on\nwhich concrete planning could be based it was determined that survey con¬\nsultants should go to the grass roots of public-school administration to\nattempt to determine in detail the relationship of educational need to\nneed for television channels in the foreseeable future."
}