{
  "id": "d1039-46",
  "text": "In the survey 1,400 representative school systems were contacted by\npersonal interview, by phone, by mail, or by all three means. Forty-\neight states were represented in the survey, and 1,113 school systems\nresponded to it.\nInformation was received from all major school systems. Ihese were\nconsidered to be those with enrollments of more than 12,000. They num¬\nbered 388 and the ratio of contact was 1 to 1, with complete response.\nThe second group of schools contacted was that in which enrollment\nranged from 3>000 to 12,000. There were approximately 2,000 school\nsystems of this size, and 400 were contacted for the survey, or a ratio\nof 1 to 5. Approximately 24-3 of these responded, or 60$ of those con¬\ntacted.\nThe third group of schools was that in which enrollments ranged\nfrom 150 to 3>000. Of the approximately 15,000 systems of this size,\n600 were contacted in the survey, or a ratio of 1 to 25. Approximately\n502 such schools, or sane 83.5$ of those contacted, responded.\nOf all the schools polled, 543 or some 49$ indicated that they\nwere now using television for instruction in some measure. Responses\nof 419 systems indicated that they planned to use broadcast television\nfor instruction In the future or to expand the facilities already in\nuse. The school systems indicating plans for future use amounted to\nroughly 44$ of those replying.\nOf the 744 school systems replying that they were not now using\nbroadcast television, 3^7 or about 68$, indicated that they had curricu¬\nlum deficiencies and instructional needs which could be met by the use\nof television, if facilities were available to them.\nOf all the respondents not now using television instruction, 24\nschool systems, or a bit over 3$ said they had no curriculum deficien¬\ncies nor instructional needs which could be met by television. Eight\nschool systems, or a little over 1$, said they did not know whether they\nhad any such deficiencies which could be met by television. With the\none exception of a school system in group two, all of the negative re¬\nplies came from group three and from among the very smallest systems\nwithin the third group. They reflected lack of experience with instruc¬\ntional television, or were not located close to systems then using broad¬\ncast television.\nThe record is complete on closed-circuit television on only 487 of\nthe school systems reporting.* But, of the 487 so reporting, eight\nschool systems indicated that they were now using closed-circuit tele¬\nvision for instruction and 86 systems indicated that they were planning\nto install closed-circuit television. There was no definite indication\nof the size, or the extent, of the closed-circuit systems being planned.\n*p. 12, Report on Recorded Televised Instructions by McBride and Meierheary,\nstates 300-400 closed-circuit installation, exclusive of military operations."
}