{
  "id": "d1039-53",
  "text": "46 -\nheeds of the future reflected nationally\nV. INSTRUCTIONAL NEEDS REFLECTED BY ACTIVE EDUCATIONAL TELEVISION STATIONS\nThe educational television stations now on the air were questioned as\nto the needs of the future as reflected in their present service, and demands\n\"being made on them for additional service. In addition to the community pro¬\ngramming previously reported, the 60 stations on the air at the time of the\nsurvey were offering the following services in some measure:\n1. In-school instruction\n2. Adult education\n3* In-college instruction\n4. Off-campus college credit\n5« In-service teacher education\n47 stations\n43 stations\n26 stations\n30 stations\n37 stations\nIn addition to the community programming and these educational services,\nthe stations all indicated that they have additional demands for both formal\nand informal instruction which they find very difficult to meet. As a result\nof these demands, 26 of the stations indicated that they plan soon to ask for\nadditional channels - or at least one additional channel.\nThe managers and directors of the educational stations now on the air\nwere asked to indicate their anticipated needs for channel space within the\nnext ten years, based upon the present rate of increase in the demand for ser¬\nvice from their stations. These responses resulted: 17 were sure that they\nwould need several additional channels but were unable to project the exact\nnumber; 9 managers indicated that they would need at least 2 channels; 5 man¬\nagers indicated that they would need 3 channels; 7 managers indicated that\nthey would need 4 channels; 2 managers that they would have to have at least\n6 channels; 1 manager saw need for 13 additional channels within the next ten\nyears, and one manager saw need for an additional 15 channels.\nThese projections of an indefinite number of channels, or of a speci¬\nfied number of channels, are not based upon the needs of the entire educational\ncomplex, but only upon the needs of that area of education which is immedi¬\nately affiliated with the present operation. In addition to the projections\nof these station managers for their own observed needs, there are in most of\nthe communities in which these present stations exist other needs for\ninstructional services. These have been indicated by other sources with\nwhich the existing stations have not yet come in contact."
}