{
  "id": "d1039-66",
  "text": "- 59 -\n'In summary, the Commission projects a capital item for tele¬\nvision of $3>925/000 and a yearly operational charge of\n$900,000 for television and $350,000 for the development\nprogram annually. The two boards of education would probably\nbe wise to view the capital cost of the television phase as\nnew money to be spent by them. Over a ten-year period the\ncost of television is negligible, compared with other expendi¬\ntures in the two systems. As other counties come into the\nMetropolitan Educational Commission, both capital and oper¬\nation expense will be proportionately reduced,\"\nUnder this plan the Atlanta metropolitan system will require several\nmore channels than it now has available.\nThe State Board of Education has established a program to provide in¬\nschool educational television service intended eventually to reach every\nclassroom in Georgia. This program is predicted on the development of a\nstate-wide television network. Planned development of state-wide coverage\nis based on use of all existing facilities in Atlanta and Athens and pro-\nvision of the channels already mentioned. An initial $500,000 has been\nset aside to construct the first new school production center in Atlanta.\n.» RfP°ft® fro“ the schools of higher education and from school systems\nroughout Georgia; the attitude of the school superintendents; and the\nplans of the State Department of Education indicate that more than one\nchannel outiet win have to be provided if Georgia is to achieve the edu¬\ncational excellence and curriculum improvement intended. These plans,\nplus a study of the distribution of Georgia's general population and its\nstudent population and reference to the engineering report, evidence a\nneed in Georgia for at least 18 additional channels.\nHAWAII\nHawaii's Deputy Superintendent of the State Department of Public\nInstruction, Dr, William H. Durr, writes:\n\"Ihe use of television for direct classroom instruction in\nscience, foreign languages, mathematics, and other subject\nareas; the use for adult instruction in language, basic\nreading, and cultural subjects; and the use of television\nfor in-service education of teachers, are the instructional\nneeds which could be satisfied or improved by the use of\nbroadcast television. It is expected that with increasing\nenrollments and with general population increases as more\npeople move to the Islands, the needs which television can\nhelp to meet will increase.\"\nA study of the needs for educational television and potential prasram\nmetVw£th theT bfnf °ond“ctea in Hawali- A survey representative haf\nth! °£ Commissi°ners, the Department of Public Instruction,\nthe Joint Education Committees of the State Legislature, the Governor, and\nmembers of the Department of Public Instruction staff. At\nthis writing no action has been taken but it is expected that activation"
}