{
  "id": "d1039-67",
  "text": "of the four reserved channels in the Islands will be recommended. The\nchannel in Honolulu is to serve as the prime station, and the three\nother channels on the other islands to act as satellite stations to carry\nthe programs over as much of the entire state as possible.\nWhile some of Hawaii's problems are peculiar to itself, it has prob¬\nlems in education in proportion to those of other states. Many areas are\nin need of improvements, some areas of the curriculum are deficient and\ncould be improved or satisfied by the use of broadcast television. There\nis an especial need for outlets for general adult instruction as well as\nfor total community programming.\nDevelopment of facilities for educational television has progressed\nslowly, but the need for facilities is evidenced in the attitude of edu¬\ncators who must cope with the problem of increasing population and other\nevident needs. Study of the population distribution in Hawaii, and of\nthe student population separately, coupled with an engineering projection,\nindicates Hawaii will in the future need more than the four channels now\nassigned it for education.\nIDAHO\nIdaho has two channels reserved for education - one in Boise and one\nin Moscow. Both these localities are in the extreme western part of the\nstate. As it happens, a substantial portion of the population lives in\nthe eastern part of the state where there are no reservations for educa¬\ntion. Idaho Falls, Pocatello, and Twin Falls have indicated an interest\nin developing educational television. This is especially true of the\nIdaho State College at Pocatello.\nDr. Donald E. Walker, President of the Idaho State College, says:\n\"We are a growing liberal arts institution with an enrollment\nof approximately 2,700 students. During the past decade, enroll¬\nment, along with increasingly high academic standards, has grown\nrapidly. Even modest predictions spell at least this much growth\nin the next ten years. Geographically we are located in a posi¬\ntion to serve the educational television needs of the Snake River\nValley, the largest area of population in Idaho,\"\nAnd R. D. F. Engelking, State Superintendent of Public Instruction,\nreports:\n\"The State Department of Education in Idaho feels that tele¬\nvision will play a very important future role in our educa¬\ntional system, Idaho is a long state, with rough terrain.\nUnder present conditions the two channels of television\nreserved for Idaho will not cover all parts of the state. A\nthird channel to serve the eastern part of our state would\nalso be required to get educational information to all parts\nof the state."
}