{
  "id": "d1039-69",
  "text": "- 62 -\nVw\nILLINOIS\nIllinois is a populous state with a large educational system. It\nhas 79 four-year colleges and universities and nine two-year colleges,\nwith a combined enrollment of approximately 186,000. The public school\nenrollment is in excess of 1,660,000.\nThere are fifteen large population centers outside the metropolitan\narea of Chicago. These are well distributed through the north and central\nparts of the state.\nIllinois has three VHF and five UHF channels reserved for education.\nTwo of the channels are activated - one in Chicago serving the community\nand the public schools, and the other in Urbana, serving the state univer¬\nsity and surrounding communities. The third VHF channel, at the Southern\nIllinois University, is expected to go on the air in 1961. This will\nleave five UHF channels scattered throughout the state. None of these\nchanneis is compatible with the major receiving facilities of the commu¬\nnity to which it is assigned.\nDr. George T. Wilkins, Superintendent of Public Instruction for\nIllinois, says:\n\"Educational television has the potential for contributing to\nevery area of the curriculum. Specifically, in-service teacher¬\ntraining, supplementary to personal instruction, presentation\nof required courses to stimulate greater coverage and achieve¬\nment, pre-planned systematic instruction, and general enrich¬\nment. Invariably a society adds to a field of knowledge and\nlooses its bounds upon certain mores. Mass communication,\nespecially educational television, can contribute greatly to\norganize, clarify, and summarize behavioral patterns, and the\ngreat mass of knowledge. We anticipate more and better use\nof educational television. As television is better accepted,\nand used with greater efficiency, it will probably become a\nstate-wide educational medium. At the present time, Southern\nUlinois University in Carbondale is planning to activate edu¬\ncational television beginning in September 1961. There is a\nhigh interest in educational television from both the school\npersonnel at the receiving end, and the communities and univer-\nS2ieS a^ °Pera-ting end. An advisory committee at the\noffice of the Superintendent is being formed to study educa¬\ntional television and its related problems.\"\nJ*! ??illip Lewis> Director of Instructional Materials for the Chicago\n' ?7S: \"To be effective in an optimum manner it will\nbe necessary to provide a number of channels in a single service area.\"\nDr>* Een->a“in Willis, General Superintendent of Schools in Chicago,\nsays. Many more uses could be made with more broadcast channels. The\nt*w?«iare? 38 many as six channels for school use of broadcast\ntelevision in the years ahead.\""
}