{
  "id": "d1039-71",
  "text": "- 64 -\nThe school districts surveyed reflect a great hopefulness and future\ndependency on the experimental Airborne project. To what extent this\nhopefulness and dependency will continue to color the process of activating\nthe reserved channels is difficult to anticipate.\nDr. William E. Wilson, State Superintendent of Public Instruction,\nsays:\n\"I believe the general field of instruction can be greatly\nimproved by the use of television. These needs will increase\ngreatly during the next decade because of the expanding number\nof school children and the continuing scarcity of well-prepared\nteachers. I am sure that there will be a great expansion in\nthe use of television in school instruction in this state during\nthe next few years. I feel the reservation of proper channels\nis necessary in order to provide adequate television service for\nthe schools of our state• \"\nAside from Dr. Wilson and a scattering of college administrators, little\nunderstanding was evidenced in Indiana of a need for multiple channels in\nthe future, with the exception of the proposed experimental project of\nAirborne Television. Survey responses nourished opinion almost to the\nsimilitude of inference that because of concern with this experiment not\ntoo much thought has been given to the implementation of ground-based\nfacilities. But responses from Evansville, Bloomington, South Bend, and\n^ from the State Department of Education indicate that if television is used\nat all in the future in Indiana from locally operated stations - and there\nis evidence that some will be - then certainly more channels will be needed\nto provide this service. How many more is speculative. An engineering\nprojection of need, if ground-based facilities were developed, is that at\nleast 10 more reserved channels would be required.\nIOWA\nThere are 31 four-year colleges and universities in Iowa with a total\nenrollment of approximately 35,000, and 17 two-year colleges with a total\nenrollment of approximately 5,000. Iowa's public schools, well distributed,\nhave a total enrollment of approximately 575,000. There are three large\ncenters of population in excess of 100,000 and eight small centers of popu¬\nlation in excess of 50,000. Iowa has six channels reserved for education.\nOne channel has been activated, in Des Moines. Considerable interest has\nbeen evidenced in the development of other channels for education throughout\nthe state. &\nDavid A. Dancer, Secretary of the Iowa Board of Regents, writes:\n\"The Iowa Joint Committee on Educational Television is a volun¬\ntary organization established ten years ago. Its membership\nincludes representatives of the State Board of Regents, State\nDepartment of Public Instruction, and the Des Moines Public\nSchool System. The Committee as a whole and its individual con¬\nstituent members have sponsored some outstanding educational"
}