{
  "id": "d1039-76",
  "text": "- 69 -\nof the limitations now found in the small Kentucky high schools, and in the\nelementary schools.\nA survey report of the Kentucky Legislative Research Commission was\nsupported by a resolution passed during its i960 session which, because\nof its pertinence and brevity, is here quoted in full:\n\"Whereas, the education of the citizens of this Commonwealth is\none of the largest problems before the General Assembly; and\n\"Whereas, the use of educational television holds promise of\nsolving a portion of the educational problems of Kentucky;\n\"Now, therefore,\n\"Be it resolved by the General Assembly of the Commonwealth of\nKentucky:\n!• That the Legislative Research Commission be, and\nhereby is authorized and directed to conduct a full\nstudy of the use of educational television in the\nC ommonwe alth,\n2. That the Department of Education, the University\nof Kentucky, and such other state agencies as the\nLegislative Research Commission may designate, are\ndirected to cooperate to the fullest extent with\nthe Legislative Research Commission.\"\nFollowing this action, the Legislative Research Commission appointed\nan advisory committee on educational television, composed of educational,\nlegislative, and civic leaders. After studying the report on educational\nneeds, and after consultation with local engineers and with engineers from\nthe National Association of Educational Broadcasters and the Joint Council\non Educational Broadcasting, the advisory committee recommended that a\nstate-wide educational television network be established to \"enrich and\nupgrade the quality of education in Kentucky public schools.\"\nA technical and organizational plan for the establishment of such a\nnetwork was approved by the Research Commission of the University of\nKentucky, the State Department of Education, and other state agencies. The\nGovernor then formally requested the Federal Communications Commission to\nallocate and reserve 10 specific channels to Kentucky for educational pur¬\nposes. In his statement to the FCC the Governor said:\n\"The January 1962 regular session of the Kentucky General Assembly\nwill be asked to approve an enabling act for a state-wide educa¬\ntional television network and to appropriate funds for its con¬\nstruction and operation.\"\nKentucky has 19 four-year colleges and universities and three important\ntwo-year colleges with a combined enrollment of approximately 36,000. The\nmore than 600,000 pupils enrolled in the public school system are fairly\nevenly distributed in small towns and rural areas throughout the state."
}