{
  "id": "d1039-77",
  "text": "There are three centers of population in Kentucky in excess of\n100,000, All are located in the north-central part of the state, forming\na large triangle from Lexington to Louisville to Covington, There are ten\nsmall centers in the state with more than 50,000 population. These are\ndistributed in the extreme eastern and extreme western parts of the state.\nThere is at this writing only one educational television reservation\nin Kentucky, This is Channel 15, in Louisville, an active station that\nservices not only the school systems of north-central' Kentucky, but also\nparticipating school systems in Indiana, In Kentucky six county and\ndistrict school systems participate with the Louisville school system, and\nin Indiana there are six participating school systems on the secondary\nlevel. Through this cooperative effort more than 100,000 children have\nreceived instruction by television from the Louisville educational tele¬\nvision station. There is evidence that additional channels will be needed\nto serve this particular area as more educational institutions come into\nthe picture, as more grade levels are served, and as more areas of the\ncurriculum are taught by television.\nIn its report on the proposed plan for educational television in\nKentucky the Research Commission said:\n\"Because of the normal six-hour length of the school day, a\nmaximum of 12 thirty-minute in-school telecasts per day is pos¬\nsible. This amounts to one per grade level for the public\nschools. If educational television is to have maximum impact on\neducational quality, an hour per day probably should be avail¬\nable for students in the fourth through the twelfth grades. This\nwould require nine hours of programming or 50 per cent more than\nare available from a single channel. Twenty-minute daily programs\nfor the three primary grades would demand another hour per day,\nmaking a total of ten hours,\n\"To provide ten hours of telecasting per school day would require\nsimultaneous use of two broadcast channels covering a specified\narea,\"\nDr. Wendell P, Butler, Superintendent of Public Instruction, says he\nbelieves:\n\"that educational television can be used in the schools with a\ngreat deal of effect and that the increasing needs will force\nthe need and use of television in the years ahead; and that\nadditional television channels should be reserved for the use\nof education in sufficient numbers to provide for the evident\nneeds of the future.\"\nThe attitude and action of the legislature, the studies and reports of\nthe Legislative Research Commission, the activities of the University of\nKentucky and its collateral institutions, and the attitude indicated by the\nState Department of Education demonstrate that Kentucky will develop and\nuse educational television to improve the quality and quantity of education"
}