{
  "id": "d1039-79",
  "text": "The individual teacher would introduce the topic and set the\nbackground and develop interest. Following the televised\nprogram the individual teacher would elaborate on the topic,\nand make necessary adjustments to take care of individual\ndifferences, and check the learning that has occurred. To\nallow this great facility of educational television to go\nunused in our schools would indeed be a great mistake,\"\nMiss Edna Mae Strobel, Coordinator of Education by Television in the\nNew Orleans Public Schools, says, and Dr* James P, Redman, Superintendent,\nconcurs:\n\"At present the entire educational television air-time for\nin-school broadcasting is available to the New Orleans Public\nSchools; however, as peripheral parishes develop their\nprograms, portions of this time will be given to them. When\nthis situation arises, it will be necessary either to decrease\nthe present offerings or to acquire another channel,\"\nDr, Harold H. Gauthe, Supervisor of Instruction in the Lafayette\nParish School System, says:\n\"We certainly are of the opinion that television has its place\nin the instructional program and we plan to make use of it\nwhen an educational television station is established in this\narea,\"\nEvidence found in the survey of the schools is that the parishes\n(counties) are waiting only for the lead of the state to provide them with\nthe facilities to use educational television. The State Department of\nEducation indicates that this provision is planned. No official statement\nwas made, but there is an apparent implication that the development depends\nupon provision of funds by the state legislature or upon procurement of\ncapital investment funds from other than state sources.\nWith the two activated channels, one in the extreme southeastern part\nof the state and the other in the extreme northern part of the state, now\nbeing used for instructional purposes and program production for various\nlevels of education, activation of the other two reserved channels in the\nforeseeable future is anticipated. As the State Department of Education\nindicates, the area in the northwestern part of the state around Shreveport\nand in the central part of the state around Alexandria will also have to\nbe provided with channels if Louisiana is to be properly served. If this\ncomes about and the development anticipated by the State Department of\nEducation is accomplished, this initial service will have to be doubled\nwithin the next decade. In such areas as Baton Rouge, New Orleans, and\nShreveport more than two channels may be necessary to provide the scheduling\non the various levels of education. The least that can be expected, on the\nevidence, will be a doubling of the basic system. This would mean four\nmore channels aaded to the presently reserved group for the basic service,\nand 12 additional channels for the multi-channel schedule needed to serve\nall of Louisiana’s instructional and community needs."
}