{
  "id": "d1039-8",
  "text": "- 1 -\nSummary\nSince 1952 the Federal Communications Commission, has reserved some\n275 television channels of the existing 2;200 for the use of educational\ntelevision.\nBy so acting, the Federal Government endorsed the vital importance\nof education to the growth and development of our society, and the essen¬\ntial role of television as an increasingly necessary aid to education.\nUnfortunately, too little has \"been done as yet in making a reality\nof television’s potential. Only 60 of the channels reserved for educa¬\ntional television are now in operation.\nThe gap appears all the greater when the broad need of our towns\nand cities, public school systems, and colleges for educational television\nfacilities is studied. To provide each state, community, and educational\ncomplex with the projected minimum number of television channels de¬\nvoted to informal and formal educational programs, would require not the\n60 channels currently established, nor even the 275 channels reserved for\nthis purpose, but well over a thousand television channels -- or more\nthan are presently available in the FCC’s Table of Assignments.\nThe present study was precipitated by the increasing demand to know\nthe needs of the American educational structure for television channels\nas precisely as possible. To this end the survey assessed the needs of\nour society for education, and equated them with the resources for meet¬\ning such needs. From this equation was derived the proportionate need\nfor television spectrum space in each state, community, and educational\ncomplex across the country.\nIn examining the need for television facilities, one primary concern\nwas that education must extend \"far beyond the formal system\" of schools,\nand provide opportunities for continuing education at every stage of life.\nEqual attention was devoted to the needs of formal education—the\nproblems confronting the schools and colleges.\nApproximately one-third of all the colleges and universities in the\nUnited States were surveyed, including all but one of the state univer¬\nsity systems. Their reports agreed on several problems:\n1. Continuing large increase in enrollments.\n2. Lack of campus facilities to meet such increases adequately,\nand a corresponding lack of resources to provide such facilities.\n3* Continuing deficit in qualified college teachers, and extreme\nshortages in some disciplines.\n4. Increasing need to make college and university services avail¬\nable to the community at large for continuing and special education pro¬\ngrams ."
}