{
  "id": "d1039-81",
  "text": "- 7k -\nDr. Robert L. Strider, President of Colby College, writes:\n\"Colby has recently joined with our neighboring colleges,\nBates and Bowdoin, in a plan to develop Channel 10, franchise\nfor which is currently held by Bates College as an educational\nchannel. All three colleges are prepared to spend a certain\namount of unrestricted funds for this purpose. Plans are under\nway for the erection of a tower and transmitter, and we hope\nto have the station on the air by the fall of 1961. President\nCharles F. Phillips currently heads the Corporation being formed\nto manage the channel.\"\nDr. Philip A. Annas, Executive Director, Division of Instruction, Maine\nState Department of Education, says:\n\"The private colleges are building an educational television\nstation in Augusta and we are asking the legislature for\nfunds to build a station at the University of Maine with\ntranslators in three other sections of the state.\"\nMaine is developing educational television slowly but surely. Further\nevidence of progress is the participation by Maine in the developmental\nprogram of the Eastern Television Network. Representatives of the\nUniversity of Maine, Bates College, and the State Department of Education\nhave participated in organization meeting of the proposed Eastern States\nTelevision Network.\nIf the five presently reserved channels are activated as proposed by\neducational authorities, and the instructional schedules of the various\nlevels of need are served, Maine will need to have at least five additional\nchannels reserved for education.\nMARYLAND\nIt is difficult to consider the needs of Maryland for educational tele¬\nvision facilities without considering the surrounding area of the District\nof Columbia, and without giving some thought to Delaware. In this particu¬\nlar area there are four large population centers lying around and to the\neast of Washington, D. C. Scattered from east to west there are approxi¬\nmately six small population centers.\nMaryland has a public school enrollment of 540,000. The District of\nColumbia has 115,000. Maryland has 20 four-year colleges and universities\nand eight two-year colleges, with a total enrollment of approximately\n55,000. Maryland now has only one channel reserved for education. This\nis Channel 2k in Baltimore which, for a number of reasons, Maryland has\nbeen unable to activate. However, a great deal of instructional television\nhas been used in the state.\nV"
}