{
  "id": "d1039-82",
  "text": "Dr. Loyal W. Joos, Director, Department of Research and Planning, Board\nof Education, Baltimore County, writes:\nMWe are presently using broadcast television via the three com¬\nmercial stations in Baltimore. We do not have our own station\nas yet. We are looking forward toward the expansion of our use\nof commercial television stations to include actual television\nteaching. We now have closed-circuit in three of our schools,\nand several more are anticipated. One of these has been estab¬\nlished as a laboratory experiment in cooperation with the Johns\nHopkins University. Another is used primarily in teacher train¬\ning. The third unit is now being installed. We believe that\nin the very near future, we will be able to take advantage of\nthe new microwave bands that have been open to educational tele¬\nvision, and begin to unify and expand within the county. Our •\ngrowth in Baltimore County has been so rapid that many of our\nschools, both elementary and secondary, have had to be built\nwithout auditoriums. We feel that television can be used as a\nunifying influence and provide programs both within the indi¬\nvidual school and throughout the community.\"\nDr. Orlando F. Furno, Director of its Bureau of Research, says that\nthe Baltimore City School System is now using television through the facili¬\nties of the commercial stations there. He says they now produce three hours\nand more per week for in-school use and adult education, as well as some for\npublic relations. Dr. Furno concludes: \"There would be great flexibility\nin the use of time if we had our own station.\"\nSince I956 the Washington County School System has used a closed-\ncircuit system involving six broadcast channels and a cable some 85 miles\nlong. Production is done entirely from one center, but production facili¬\nties are available also at other points. This direct teaching program has\nreached some 16,500 elementary and secondary children.\nDr. William M. Brish, Washington County Superintendent of Schools,\nwrites:\n\"Because of our experience with closed-circuit television, we have\nlearned that broadcast television would add a dimension that\nwould be profitable. It would be to include several small elemen¬\ntary schools in the program which are completely out of the\ncircuit now. It would also be possible to broadcast most of the\nadult education programs and perhaps the basic courses of the\njunior college program. By this means the present educational\nfacilities in Washington County would be extended to numerous\npeople. Furthermore, many cultural programs might be broadcast.\"\nDr. Brish makes this statement of observed need of broadcast facilities\nin Hagerstown in the light of his intimate experience for several years with\nthis large scale six-channel operation of closed-circuit television,\nTo use the closed-circuit production facilities to enlarge the school\nprogram into the schools in the surrounding areas not now being served by"
}