{
  "id": "d1039-83",
  "text": "- 76 -\nVw\nthis closed-circuit operation would require at least six channels. These\nchannels could be low-power UHF channels, or they could be part low-power\nand part high-power. In any event, a minimum of six channels would be\nrequired. The same would hold true for Baltimore if it were to emulate\nthis activity.\nt° Provdde 'khe same type of overall direct in-school instruction by\ntelevision that has been so successful, organizationally and academically\nin Hagerstown, Baltimore would need to have at least six channels avail-\n„would present a problem in relation to the adjoining area of\nWashington, D. C., and Alexandria, Virginia, for which some sort of\ncooperation would need to be worked out. In any event, the evidence in\nthe reports from Hagerstown, from Baltimore, and from the District of\nColumbia area shows that 15 to 18 separate channels would be required in\nthe future to service this area properly with instructional television.\n. Dr. Daniel W. Zimmerman, Maryland’s Assistant State Superintendent\nof Schools, says there are no immediate plans to provide a state-wide\nsystem of educational television. But, he says, a state-wide committee\nhas been participating in a study of the overall need for educational\ntelevision, and has set forth a positive plan of use for educational tele¬\nvision. The State Department of Education has looked favorably upon the\nplan and recommended further study.\nDr. Willis H. White, Director, Division\nDepartment of Education, says:\nof Instruction, Maryland State\nWhile Maryland does not have a state-wide plan for broadcast\nj6yfsion' several of the local school systems do have programs\nand these are expanding. The channels certainly should be made\navailable and preserved to such time as the organization and\nfinancing can be accomplished.\"\nDiscussing instructional needs in Maryland that could be satisfied or\nimproved by use of broadcast television, Dr. White also said:\nEducation today faces responsibility that is both old and\nenduring, and new and perplexing. The tempo of our way of\nlife has speeded up. We now live in a culture that is\nacquiring new knowledge at a tremendous pace and is applying\nat an ever increasing rate the discoveries of science to\nindustry, business, transportation, communication, and to all\naspects of everyday living. As a result many new resources\nhave quickly become a regular and accepted part of our lives.\nTelevision for education is an example of a new medium that\nm the course of only a few years has been accepted by the\npublic.\nt1mnfLeVi?eC,C!/eP?rted pointB t0 the need of hew and additional educa¬\ntional opportunities in Maryland. It shows also that educators on all\nadditionairir,T°^1Ze telriSl0C'3 potentlal for Providing a source of\nadditional instruction, and an improvement in instruction .that cannot\notherwise be obtained. There has been enough television at various levels"
}