{
  "id": "d1039-84",
  "text": "- 77 -\nin Maryland so that people responsible for the day-to-day processes of\neducation have become familiar with it. With all of this, Maryland is\none of a number of states which have not yet been able financially, or\nhave not had the channel availabilities, to provide the kind of service\nneeded.\nThe development in Baltimore and the general area of Baltimore is\nundoubtedly tied in closely with the development of Washington, D. C., and\nthe general area of the District of Columbia and Northern Virginia. The\nHagerstown expansion may be involved in the same general development pro¬\ncesses. But it is evident that Maryland needs twelve additional channels\nto provide a minimum service for the area.\nMASSACHUSETTS\nMassachusetts is a relatively small state from which television\nsignals would tend to spill over into surrounding states. It has 67 four-\nyear colleges and universities and five two-year colleges with a combined\nenrollment of approximately 146,000. Public school enrollment is 540,000.\nMassachusetts has three channels one VHF and two UHF reserved for\neducational television. The VHP, Channel 2 in Boston, has been one of\nthe outstanding educational television stations, and serves a large area\nof educational needs in that part of the state. The other two channels\nhave not yet been activated.\nDr. John W. Lederle, President of the University of Massachusetts,\nstates:\n\"The University’s new School of Education, ready for occupancy\nin September, 1961, will be equipped with closed-circuit tele¬\nvision. This will be used for teacher training and the obser¬\nvation of kindergarten and elementary school classes in the\nlaboratory school, which will be an integral part of the School\nof Education building. There are no plans for the establish¬\nment of broadcast television at the University. However, the\nWestern Massachusetts Broadcasting Council, in cooperation with\nthe school systems of western Massachusetts, (outside of the\nsignal range of Channel 2 in Boston), will explore the possi¬\nbility of conducting an exhaustive study and a technical survey\nof the engineering problems involved.\n\"Like many other institutions of higher learning ours too is\nbeing subjected to certain subject matters to the imbalance\nof a rapidly expanding student body and limited personnel and\nlimited facilities. Broadcast television would make it pos¬\nsible to bring the most brilliant and effective instructors\nto the campus. It would enable many faculty members to enrich\ntheir teaching with a wealth of illustrative materials, such\nas well-executed diagrams, working models, the most modern\nlaboratory apparatus and photographs. Such distinctive lecturers"
}