{
  "id": "d1039-87",
  "text": "The rate of general population growth in the metropolitan areas of\nsouthern Michigan during the last 10 years was approximately 30$, while\nin the northern two-thirds of the state it was approximately 15$.\nThere are 13 reservations of television channels for education in\nMichigan* Only one of these — located in a small, rather sparsely popu¬\nlated area in the north-eastern part of the state — is in the VHF band,\nmong problems holding back development by the Michigan educational forces\no the presently reserved channels for a primary educational service has\nbeen that all of the reservations are in the UHF band, while the state\noperates commercially almost 100$ in the VHF band. An estimated 96$ of\nall the receivers in Michigan are designed for reception on VHF frequen-\nTCJfs* Aside from the educational Channel 56 in Detroit, the only other\nuHF operating in Michigan is the commercial station Channel 57,\nin Saginaw-Bay City.\nRecently Michigan State University has arranged to utilize Channel 10,\nocated just south of Lansing and well within the Lansing coverage area,\nm conjunction with commercial interests part-time as an educational\nstation. There also has been a proposal to move educational Channel 11\nfrom Alpena in the northeastern part of the state on Lake Huron to the\ncentral part of the state - in some position that could give coverage to\nareas like Grand Rapids, Muskegon, and Mount Pleasant. Such a relocation\ncould readily result in the development of an extremely valuable public\nservice and instructional service station.\nMichigan is now carrying on a study to determine what is needed to\ngive the state an adequate basic educational television service. Michigan\nhas several collateral problems in education which somewhat inhibit the\neducational television survey being conducted by the Michigan State\nUniversity and the State Department of Education.\nOne seeming problem in education in Michigan is the matter of the\ndivision of control for the various areas of education. For example, there\nis a Board of Regents for the University of Michigan. This is an autono¬\nmous board. There is a Board of Trustees which is an autonomous board.\nls a Board of Education which has charge of general public education\nin the state, in addition to having authority over the various teacher-\ntraining institutions and junior colleges. All of these Boards are elected\nstate-wide, and apparently are answerable only to the electorate. There\nis now some discussion in Michigan of bringing all the institutions of\nhigher learning under state-wide control. The authorities of the three\nlarge state universities are opposed to central control. This general\nclimate of lack of agreement has not hastened a central decision on state¬\nwide use of television facilities in the universities, or of the develop¬\nment of a cooperative operational or programming effort.\nThere is no mistaking the interest in instructional television in\nMichigan, nor the desire on the part of educators on all levels to use it.\nIn the general survey, 10 school districts indicated that they were now\ninstructioB; and 18 responding to the survey indicated\nthat they were planning to use it in the future, as soon as it could be\nmade available to them."
}