{
  "id": "d1039-92",
  "text": "- 85 -\nand is being developed, in St. Louis and Kansas City, Missouri would need\n24 additional reservations.\nMISSISSIPPI\nMississippi is largely a rural state. It has only two areas with\npopulations of 100,000, one is on the Gulf Coast in the resort area, and\nthe other is the state capital, Jackson. Its total school population is\nin excess of 500,000, mostly enrolled in small towns or rural schools.\nMississippi has 17 four-year colleges and universities and 27 two-year col¬\nleges, with a combined enrollment of approximately 33,000. These schools\nare well distributed throughout the state. Five television channels are\nreserved for education in Mississippi — four UHF channels, and one VHF\nchannel at the Mississippi State University.\nNone of these channels has been activated, but activation of Channel 2\nat State College is being discussed.\nDr. James Tubb, State Superintendent of Education, says:\nWe are definitely interested in developing educational\ntelevision in Mississippi, but no definite plans are formu¬\nlated as yet. A committee is at work on recommendations to\nmake to the next term of the legislature,\"\nThis committee met recently in Mississippi with several outside con¬\nsultants to draw together its formal recommendations to the legislature.\nBased on an engineering projection, at least 10 additional channels,\nof varying power will need to be activated in addition to those presently\nreserved in Mississippi, if the state’s institutions of higher learning and\nits small town and rural schools are to be served by educational television.\nMONTANA\nMontana is a large state with a relatively small population, in the\nlast census, of 675,000. The rate of increase is also relatively small.\nBecause of its sparsely settled areas, Montana has a particular problem\nin providing equal educational opportunities to all its people. This makes\nth! ?Se television instruction particularly attractive to the educators,\nand to the people of the state.\nMontana has only four population areas over 50,000, and two population\nareas of more than 25,000. F\n. p1®.S^te Department of Education told survey consultants that there\nis a definite and immediate need for providing quality education on the\nelementary and secondary levels for Montana’s sparsely populated areas.\n1^pointed out that higher education in Montana is in much the same\nsituation as that in which the general public school system finds itself."
}