{
  "id": "d944-41",
  "text": "TO:\nOfficers and Directors, NAEB\nJohn W. Dunn 7/27/5U\nFROM?\nI am greatly disturbed by Harry*a brief not© of July 22nd*\nThe copy of a letter from Robert Van Duyn does not sound like Bob or the\nKellogg Foundation at all* If its tenor be true then Kellogg, in my\nopinion has done a complete about face* Maybe this attitude has been there\nall the time but has not manifest itself until now*\nI am not only puzzled by the use of the word \"disposition” but also the\nvery bald, blunt statement, ?fShould it stay independent? If not, with what\nagency should it become affiliated?\"\nTo begin with either some people are awfully dumb or plain stupid for a\nstudied effect. The position of NAEB in the world of educational broad¬\ncasting has been affirmed not once but many times; its avowed purposes\nhave been set forth in unmistakable language. Even though nothing had ever\nbeen spelled out . . . it is apparent what its role is because of its past\nrecord and the achievements which have been accomplished through blood\nsweat and tears. Therefore, for anyone to challenge the role of the\nNational Association of Educational Broadcasters after thirty years of\ndistinguished achievements for the cause of educational broadcasting is,\nI repeat, being plainly stupid.\nNAEB is not a \"Jonny-corae-lately\" in the field of educational broadcasting*\nIts combined membership represents a great segment of American educational\ninstitutions, its voice is heard in the homes of millions of Americans,\nthe men who guide the destinies of educational broadcast stations as members\nof NAEB are not nit-wits as some would have us believe9 NAEB has not climbed\non any band wagon to wave banners and beat the drums nor has it ever been\nguilty of sounding sweet music to lure the unsuspecting into whirlpools*\nNAEB has maintained for itself and its members the very highest standards\nand the noblest of purposes, it has built slowly but effectively, resisting\nall radical departures from the main-line of its purposes, and thoroughly\nrefusing to sell its soul for a mess of pottage.\nTo have anyone, I care not who it is, dare suggest that NAEB should lose\nits identity, to submerge itself beneath the waters of oblivion is unthink¬\nable. Why stand ue here idle, ladies and gentlemen? The issues are plain,\nthe gauntlet has been cast at our feet. The mandate is clear. Affirm to\nKellogg and to anyone else that NAEB bows to NO ONE that we are independent\nand by the grace of God will continue to be so. This is no time to placate.\nWe should stand firm and give a straightforth answer that indulges in no\ndouble-talk* If we are destined to die, then I would prefer to die honorably\nthan to sell out to the robber barons0\nJUL 2 9 1954\nam pm\n7i*l 1|2|3|4( 5|^"
}