{
  "id": "d316-10",
  "text": "-3-\nSkornia.#.\nferenee to what the media were as powers in them¬\nselves, or what they did to us, or one another.\nTherefore, I shall try to pin-point what they are\nand what they do, filling in their commercial, social\nand political background according to the needs of\nparticular groups. In fact, such filling in makes a\nvery legitimate and feasible project for the students\nthemselves. But unless they know what kind of power\nit is that is being wielded, there is little relevance\nin understanding who wields it. As things are at\npresent, we understand the power and nature of a medium\nonly when it has been illuminated by its successor.\nKnowledge after the event.\nTo-day we must know in advance. And we can.\nAs Heisenberg says, some effects precede their causes\nin the electronic order at least. And sequentiality\nis a useless procedure in a world constituted as a\nsimultaneous field.\nIn Detroit, this week, I shall attempt to dis¬\ncover what the Schafer group can and will do in helping\nalong the media project. At the end of this month, I\nam to spend a day or two in Chicago with the Brittanica\nFilm group. They want to know what is the proper basis\nfor teaching the film medium in schools. Naturally I\nshall learn what I can and insist also on the multi-\nmedia approach as the only possible one for teaching\nany medium at all.\nWith regard to the Syllabus, then, I hope that it\nwill be possible to formulate grammars of all media in\nthe space of two or three pages for each one. These\nbrief instruments I shall try to put together in the\nnext few days. After Christmas, I am going to take a\nshot myself at teaching them in the Grade XI classrooms,\nhereabouts. I expect to be In those classrooms with\none or more teachers making the procedure entirely a\ndialogue affair. Perhaps one benefit of being in the\nclassroom with other teachers will be that I can discover\nmore quickly, from their awareness of class reactions,\nways of improving procedures.\ncontinue...\n^ ^ ^ /lAX<L , X ccU^ fe e<rp-^ fU\n0 d\\)Q(r^y[ \\/sfWaJ( LAjClU TUq. ■"
}