{
  "id": "d316-15",
  "text": "/U\nUniversity of Houston\nCULLEN BOULEVARD\nHOUSTON 4, TEXAS\nDEPARTMENT OF PSYCHOLOGY\nDecember 2, 1959\nNAEB HEADQUARTERS\nDEC 4 1959\nDr* Harry J. Skornia\nExecutive Director\nNational Association of Educational Broadcasters\nUrbana, Illinois i\nDear Harry;\nI received your letter of November 5, and since then I have received\na brief note from Marshall, together with a 15-page ‘'Media Log*11 The text\nof his note is as follows;\n\"Many thanks for your comments on syllabus sample. Enclosed\nis first of series on media matters. What will follow will\ndeal with particular media to get feedback from many. Sylla¬\nbus to get local trial soon.\"\nFrom his note, I assume that the syllabus is already finished, since\nhe indicates it is to be tried out soon. I am somewhat puzzled, however, as\nto how this \"Media Log\" (which contains a notation \"Copyright, 1959\") fits\ninto the picture—is it a part of the syllabus or just a publication of his?\nAt some point this committee member, for one, has apparently lost sight of\nYifhat is going on.\nThe problem as far as the Office of Education staff is concerned,\nparticularly in terms of the monetary factor you mentioned, is, indeed, a\nbit disturbing. I understand that Walter Stone will be leaving after his\nduties for the current year are completed, and Warren Seibert, who is Senior\nResearch Coordinator, will be leaving in June. So far as I know, the only\nresearcher who will be staying on in the new media section is Kal Stordahl.\nI also know, of course, that Franklin Dunham is retiring shortly. Considering\nthe major personnel changes that will be taking place, there should be, as you\nsuggested, a tremendous opportunity to promote government involvement in the\neducational broadcasting movement at a substantial level. Changes are taking\nplace so fast in the power structure of ETV that developments in the near fu¬\nture should be especially interesting to watch. I suspect that the Center\nmeeting in March here at the University involving educational television\nstation officials will be a good occasion to observe some of the emerging\npatterns.\nI nope that all is going well with you in your many and varied\nactivities. Hope to see you soon.\nCordially yours.\nRi Evans\nProfessor of Psychology\nRIE;jmb"
}