{
  "id": "d316-154",
  "text": "Let ma apologise right off for all the distress which my media\nproject will cause specialists in many subjects* I wish I knew some\nway of avoiding this discomfort, but how is it possible to do the cross\nsubject study that this purports to be without disturbing the convic¬\ntions and the acquired knowledge of many people?\nIf I explain that radio and TV are not really consumer media in\nthe full sense that photography and film are, Madison Avenue gets up¬\nset* So do many people in film and in radio and television skills*\nThey are eager to prove me wrong before they have the faintest idea of\nwhat X mean* Personally I am not trying to upset such people* X am\nreally trying to understand media and to discover their unique dynamics*\nBut it is not easy to convince a literary man that your interest\nin the psycho-dynamics of the printed form of codification of informa¬\ntion is anything but malice towards literature* Moreover, he is likely\nto feel personal humiliation that he is, in fact, quite unaware of some\nof the basic effects of the print form upon many of his most cherished\nideas and attitudes.\nThe mere recognition of the existence of the subliminal in ordinary\nhuman experience seems of itself to create fear and insecurity* Since\nevery moment of perception is loaded with subliminal Intake, all of us\nare unaware of most of the factors that shape our experience.\nPersonally, I should greatly welcome any suggestions as to how to\ndiminish the discomfort of other people when their subliminal lives are\ninvolved. But media study must go on*1 And so far the only advice is\nto shut up*\nIt is sometimes said that my approach to media is philosophical*\n1 hope it may soon be seen to be scientific. For a long time philosophy\nhas been associated with systems, with world-views, weltanschaungs, and\ngeneral pictures of things. Since the Renaissance most methods and pro¬\ncedures have strongly tended toward stress on the visual organization\nand application of knowledge* Printing gave enormous stress to such\nvisual process, to differential calculus, and to statistics*\nBut since the early nineteenth century with the arrival of electri¬\ncal problems and processes, mathematics and physics have moved away from\nvisual organization and statistics towards dynamics, time organization,\nand what psychologists refer to as \"auditory space.\" (Auditory space\nis that sphere of simultaneous relations created by the act of hearing*\nWe hear from all directions at the same instant* This creates a unique\nunvisualisable space.)\nTo ask whether either the Renaissance achievement of statics or\nour modem conquest of dynamics is a good thing or a bad thing seems to\nmean: \"what will this do to me?\" The question seems to be a request for\napplied knowledge, but knowledge applied on one level, and for one per¬\nson ££* *!*■"
}