{
  "id": "d316-155",
  "text": "-2-\nTha modern world of dynamics Is an all-at-once world in which\nthere cannot be single levels or one-thing-at-a-tlme awareness. This\nchange is a very bad thing a indeed , for the previous technology and\nfor all of us whose education represents a heavy investment of precious\nyears in acquiring what may now be irrelevant modes of knowledge.\nThe Affluent Society by Kenneth Galbraith opens with a discussion\nof the \"vested interests in acquired knowledge,\" \"the bland leaders of\nthe bland\" whose discourse and perception move evenly in the single\nlines and the single planes of \"conventional wisdom.\" By taking an all-\nat-once view of our economic world Galbraith has so shocked the one-at-\ntime people that the American Journal of Economics has reviewed the book\non the assusption that it is a hoax.\nIn the same way Parkinson8 s Law (by Parkinson) in taking an all-at-\nonce view of the operation of written forms in bureaucratic organization\ntoday, has appeared as a sort of Marx Bros, entertainment. It is a multi-\nlevelled analysis of a complex dynamic.\nConventional sobriety as it affects scholarly decorum would seem\nto be merely the accidental result of the static procedure of taking\none-thing-at-a-time. Such procedure in media analysis is as incapable\nof getting at the dynamics of a medium as are statistics in motivation\nstudy or social dynamics.\nStatistics can tell of a trend, provide a picture or a view, or a\nperspective but cannot reveal causes. In fact, it is only in our century\nthat over-all data and all-at-ence knowledge have so increased that we\nhave moved toward the study of causes in personal and social operations.\nThat is, we are now concerned with causes, not on a single plane or in\nmere sequence but as a total field of interaction and inter-penetration.\nThis leads us to feel about statistics as the beatnik about bikinis:\n\"Man, they seem to reveal all, but they really withhold vital data.\"\nIt is important for us in media work to understand the statics of\nthe medium of statistics and their relation to differential calculus and\nthe older Newtonian picture. For the problems we face are not static\nbut dynamic, because of their nuclear origin and focus. Likewise, the\nmeans at our disposal are no longer mechanical but electronic. And the\ndominant impress which the young today receive (non-verbally) from our\nnew technology is not mechanical or print-oriented but electronic and\ndialogue-oriented•\nThe world of production and management is today grappling with the\nchanges in the patterns of command and of production resulting from the\ntelephone, on one hand, and from the complex synchronization in produc¬\ntion resulting from the use of electronic tapes. The latter have ended\nthe centuries-old regime of the assembly-line. The end of the assembly-\nline in the outer-world could well be a portent for the entire educational\nestablishment. Because Gutenberg provided the prototypical assembly-line"
}