{
  "id": "d316-160",
  "text": "-7-\nI ora sure it will be the reply of the big research divisions of\nMadison Av@. publishing and advertisings including Tims, Life, and\nFortuneo\nthe question, then* arises: Should X, or should I not, seek the\nco-operation of these great enterprises? If Understanding Media is\nfrom one point of view a project to inter-relate in-school and out-of¬\nschool experience by educational articulation of areas that are common\nto both, would it be seriously compromising to ask the aid and counsel\nof the out-of-school areas?\nMuch of the data about the effect of one medium on another is\nto be found only in the experience of the big industries. I spent a\nweek at a radio conference in Vancouver in the spring of 1958. The\ntheme was: What has happened in radio since TV? The answers were\nmost helpful. Radio has changed in its uses and programming since TV.\nIt has switched from a group to a private form, etc.\nWhat happened to the book after the newspaper? To the book after\nthe movie? To the book after radio and TV? Kobcdy seems to know.\nBut what has happened to the movie since TV is much better known,\nand if studied not as a change in our view of the movies but as a\nchange in the uses and forms of the movie, much can be learned about\nthe movie, and about TV and movie at the same time; i.e., much that\ncould not be learned by inspecting merely one-at-a- time•\nTo Illuminate media from within by noting their effect upon on®\nanother is a procedure that 1 should like to have criticised pro and\ncon. It also appears, as I have pointed out, to be the current method\nin the discovery of nuclear structures in physics.\nThe \"contest\" approach to stadia and to the testing of madia efficacy\nin teaching and in public relations and politics is, Z am reasonably\nsatisfied, derivative from the habit of literacy itself. We would not\ntalk about the \"content\" of a tune or a melody. But as soon as man\nlearned how to encode the audible in visible terns (writing) he easily\nbegan to make divisions between ”£©rnT and \"content,\" and between thought\nand feeling, individual and state, and so on. Insofar as these separa*\ntions correspond to real modes of being we should try to retain them.\nInsofar as they are fictions and illusions fostered by the subliminal\naction of media, they need to be considered and criticised with a view\nto their permanent value. Perhaps we shall learn to cherish some of the\nfruits of literacy as we might do with precious artifacts of vanished\nsocieties. Whether it be possible to retain the fruits of literacy with¬\nout the soil and tree of literacy would appear to be the test we are now\nundergoing in the Western world. Certainly we shall learn many new\naspecta of literacy as we study its intact on the ancient cultures of\nIndia and China. For literacy in the West did net slice into ancient\ncivilisations, but struck into tribal societies which wilted under its\nimpact."
}