{
  "id": "d316-162",
  "text": "-9<\nLet us step aside fron teaching a moment and notice what the t@l@-\nphone and other electronic means have done to well-established patterns\nof management and decision-making:\nWe still express the structure of authority, responsibility,\nfunction and rank in organisation in the typical organization\nchart, which shows the chief executive at the top and the lesser\nexecutives as exercising authority delegated by hi®. It is still\ncustomary to explain the existence of organisation by the fact\nthat there Is more work to h® done than any man can do, so that\nhe has to delegate to others what is really part of his job.\nBut this is nonsense in modern organization. The individual\npeople of skill, knowledge and judgment cannot exercise somebody\nelse*© authority or somebody else*s knowledge. They exercise\ntheir own knowledge and should have the authority that befits\ntheir contribution. It is the job that determines the authority\nand responsibility of the holder — and this is original authority\ngrounded in the needs and objective requirements for performance\nrather than in the power of the man above* The only power the top\nnan must have is that of deciding whether a certain contribution\nis needed — and even that, increasingly, must be an objective de¬\ncision according to objective needs of the organization rather\nthan a power decision.\nThat is Peter Drucker writing in landmarks of Tomorrow (p. 96)\n(Harpers, 1959). Delegated authority cannot in the long run be trans¬\nmitted or used by telephone. The decentralization of industry that has\nfollowed upon the break-down of delegated authority has compelled indus¬\ntry to give to all its executives an over-all training in the entire\noperation of their companies and also compelled the study of the entire\nrelation of business to society. In Mazi Germany the clash between dele¬\ngated authority and electronic transmission was given a brief moment of\nattention by Albert Speer at the Nuremberg trials:\nThe telephone, the teleprinter and the wireless made it possible\nfor orders from the highest levels to he given direct to the\nlowest levels, where, on account of the absolute authority be¬\nhind them, they were carried out uncritically; or brought it about\nthat numerous offices and command centres were directly connected\nwith the supreme leadership from which they received their sinister\norders without any intermediary; or resulted in a widespread\nsurveillance of the citizen, or in a high degree of secrecy surround¬\ning criminal happenings. To the outside observer this governmental\napparatus may have resembled the apparently chaotic confusion of\nlines at a telephone exchange, but like the latter it could be con¬\ntrolled and operated from one central source. Former dictatorships\nneeded collaborators of high quality even in the lower levels of\nleadership, men who could think and act independently. In the era"
}