{
  "id": "d316-17",
  "text": "Page 2 - Skornia.\nThe present Media Log which I do not yet know whether\nto date or to number, is introductory only to understanding\nmedia, as is the Syllabus. The plan is to assemble, if\npossible, all the basic insights into all media in order to\nget a fairly complete idea of their inter-mutational\nactions. If our project achieves not more than that, this\nyear, it will be a large gain. It is like Pasteur*s germ\ntheory, or like awareness of radio-activity. You may\nremember that Pasteur was drummed out of the Medical pro¬\nfession for his germ theory. It was so upsetting.\nI have been getting down to cases with a local group\nof High School teachers who will give the Syllabus a run,\nright after Christmas, in several Grade IX class-rooms.\nThey were quite enthusiastic at the idea of having to teach\nsomething about which they knew less, if anything, than\ntheir students. The idea of being on a parity with their\nstudents in an investigation on new lines surprisingly\nappealed to them right off. When I asked about the pos¬\nsibility of there being two teachers present in each class,\nin order to strengthen the dialogue pattern and to throw\nstress on the learning rather than the teaching side of the\nproject or process, they were somewhat vague and uncertain,\nbut not opposed.\nWhat will dawn, fairly soon, on the educational world\nis the awareness that the monologue of the book as\nteaching machine, and the projected further monologue of\nthe teacher as presenter of data, should have ended decades\nago. The new teaching machines with their tutorial dialogue\npattern, as well as ETV in all its forms, imply the need\nfor more than one teacher per class-room. The present view\nis, of course, that ETV merely carries out the old program\nwith new equipment. In other words, the recent ASCD con¬\nference never even began to ask what are the curriculum\nmutations implicit in the new instructional materials.\nI am now ready to fill in the areas of movie, radio,\nand television in the Syllabus. In the test runs here In\nToronto we are likely to begin with these three rather than\nwith printing.\nEnclosed is a sheet by way of progress report for\nWalter Stone* You may feel it desirable to make changes,\nadditions or over-all suggestions.\nWarm regards.\nH.M. Me Luhan/RN\nEnclosure."
}