{
  "id": "d316-75",
  "text": "Sew Media Project,\n96 St. Joseph St.,\nToronto 5, Ont.,\nOctober 15th, 1959.\nProf. Arthur Wells Foshay,\nBox 120,\nTeachers College,\nNew York 27, N.Y.,\nU.S.A.\nBear wellst\nJust had a note from Sam Booker who was much reassured\nabout the project by his encounter with you in Washington.\nSome new yardage on the code-language matter, as follow 1\nThe world of economic speculation has entered on this field\nunder the label uncertainty economics. This concept, borrowed\nfrom Heisenberg, means the shift in economic thinking away\nfrom mechanical models and equilibrium notions to the world\nof actual change and development. It specifically Involves\nbeing poised on the frontier between two order# of fact.\nIndeed it really means the end of economics as a specialist\nor water-tight area and it puts me in mind of teat creative\nfrontier between the worlds of code and language which implies\na kind of non-comltal to either area. Presumably the painter,\nfor example, is one who lives poised on tee frontiers of\nmany kinds of spadlal form, habitually translating one into\nanother by way of discovering or releasing the properties\nback to each and this of course is parallel to the procedure\nof the physicist tea bombards nuclell of unknown structure\nwith those of known structure.\nIn a world of frontiers, political and cultural, we can\nobserve the same release of creative perception or .transla¬\ntion. vie have now to reckon with our new world of multiple\nmedia teioh has succeeded the relatively closed monarchy of\nprint (in which world we all now live) and which forms our\nperception and sensibility in a world of inter-penetrating\nexperience from -*hich unexpected forms are constantly ©surging.\nPrint Itself becomes a means 0? playful activity when pushed\nin newspaper and advertising to its limits of technical\nstress (a fact which m played with in Sspiora.tlo.ns No. 8).\nIs it not a well-established matter of observation that\nany form or technique when pushed to its limits constantly\nmanifests characteristics quite opposite to tee ones which\nit appeared at first? This has often been thrust under\nattention in media study share the development of the use\nof any tom at all displays a reversal of rolls, as for\nexample, roads at first made to bring the country to the city-\nsoon bring the city to the country when Improved, and upon\ncontinued...."
}