{
  "id": "d1717-21",
  "text": "-22-\nCAN NAEB INTERPRET AMERICA TO THE BRITISH?\nBill Ewing* WOSU Program Supervisor* wonders if NAEB can do anything to interpret this\ncountry to the British* who—believes Ewing—are steadily becoming more and more anti-\nAmerican O\nEwing writes to the News-Letter Editors\n\"Last Fall a merrber of our staff, Mrs* Alice Meehan* and her husband went to Eng¬\nland to do advanced study for a year or two. I have had frequent reports from\nthem and find them considerably distressed about the anti-American attitude which\nthey meet constantly. It is even worse than I had thought previous to their com¬\nmunications o I am going to quote a portion of Mrs. Meehan's most recent letter\nand then raise a question which I think should be of concern to NAEB members.\nHere is her statements\nQuotes Letter From Friend in England\n\"As to my understanding the English* I am making no headway. They become more\nof a mystery as each day passes0 I think I wote something of the anti-American¬\nism we find. At first I overlooked all the little barbs.\n\"They resent deep in their hearts the American Aid, and the fact that they are\nno longer the leading power* that America has stepped in. All of this one can\nunderstand* but that they completely close their eyes to an understanding of\nour way of life* distrust us* are under the impression that we are a stupid lot*\nis a little difficult to take. To really understand this one has to live here.\nFor instance* last week we heard a radio address by a Member of Parliament* and\nafter giving many wrong slants to life in the U.S.* closed by saying cricket\nwas the national sport of England* while Americans engaged in strip-poker. The\nrace problem is played to the hilt. We are a nation of be-bop fans* hot-rod\ncars* and Hollywood. In all fairness I must add that there are the educated few*\nbut so few* and the above opinions are held by the majority or mass of people.\n\"Why donyt you get the NAEB to send a series to the BBC* depicting at least\nthat there is another side to our life? Armed forces radio is received here*\nand their fare is a duplicate of commercial radio* without the commercials. The\nVoice of America does very little for the English speaking Nations. See* I?m\ngiving you the job of educating the English to our way of life0\"\nEwing Wonders If NAEB Could Help\nAs a result of all of this Ewing has the following suggestion to make g\n\"Is it possible that educational broadcasters could do something to give the\nBritish people a more balanced viewpoint about America? We receive many pro¬\ngram services from the BBCo Is it perhaps time that the NAEB start sending\nsome programs about America to the BBC? I know of no other organization which\nis in a more strategic position to do this job. It is just an idea and I c er-\ntainly would be interested in the reaction of member stations and those who\nare planning the Network service.\"\nVOICE OF AMERICA SERIES AVAILABLE\nThe Uo S'. Department of State announces the availability to domestic stations of a\ntranscribed series of radio programs on the activities of the \"Voice of America.\"\nThere are 13 quarter-hour programs which may be obtained without charge by writing\nto Associated Broadcasters* Inc.* Box 87, Hollywood* California."
}