{
  "id": "d1717-25",
  "text": "-26-\nSTo LOUIS PUBLIC SCHOOLS EQUIPMENT RECQI1ISNDATIONS\nThe Audio Equipment Committee of the St. Louis Public Schools recently revised its list\nof recommended radio,, record playing, and recording equipment,, This list does not\ninclude the more expensive equipment which, although of excellent quality, is beyond\nthe price range of most schools. Items listed below, in the judgment of the committee,\nseem at the present time the best buys. Approximate prices are listed. The new list\nincludes the following items;\nRadios g St. Louis accepts the NEA Equipment Committee's recommendation of eight-inch\nspeakers as best for classroom listening. Sets recommended include the Freed Eisemann\nAM-FM radio at $87®00, the Zenith AM-FM model H725 at $57*50, and the RCA Victor AM-FM\nmodel 1R81 at $57*90, the latter two especially for home teaching and small group\nlistening.\nRadio Tunersg (without speakers); Magnavox FM Tuner, $57*505 Meissner, Model 8C FM Tuner,,\n$53760| Meissner Model 8 BT FM Tuner, $611,785 Altec AM-FM Tuner and Power Supply, Model\n101B, $299*005 Altec AM-FM Tuner, Model 303A, $280.00.\nTranscription Players? Picturephone, Model B 12, $190.00 j Bell, Model 2078, $175*00|\nPicturephone, Model b8, $175*005 Newcomb, Model TR16 AM, $li|1.00| Dukane, Model lljBlfea\n$135,005 Newcomb, Model TR16M, $127*505 and Masco, Model TP16, $107*00.\nThree Speed Record Player; Newcomb, Model R12, $52.99*\nWire Recorders Webster-Chicago. Model 181, $79*00.\nTape Recordersg Webster Racine, Model 111, $156,505 Webster-Chicago, WebCor Model 210-1,\n$150,005 Bell, Model RT65B, $12h»%0; Dukane, Model 11A55* $130,005 and Pentron, Model\n9T 3C, $116.68.\nMore complete information about these items may be found in Superintendent's Circular\nNo. 2lt, issued January I4, 1952, obtainable from the Division of Audio-Visual Education.)\nSt0 Louis Public Schools, 1517 S. Theresa Avenue, S^. Louis h} Missouri.\nELEVENTH AEC REPORT TO CONGRESS AVAILABLE ON REQUEST\nThe 11th Semi-annual Atomic Energy Commission Report to Congress is available. The com¬\nplete document should be useful as reference and for program ideas, particularly local\nangles.\nThis report includes; brief summaries of the Nevada weapons tests and review of progress\nin nuclear reactors? review of AEC construction program in current expansion, including\nwork stoppages, and report of AEC Labor Panel5 new section on industrial participation\n—a high light of 1951 developments 5 special section on Plant Life Research, including\nfertilizer and soil experiments in 2li states and in AEC laboratories 5 state-by-state\nindex to research in plant life, and state breakdown on isotope distribution summaries\nof latest advances in medicine, radiation effects studies and in nuclear physics re¬\nsearch^ and a financial section with breakdown of U. S. investment by years from 19^0\nthrough 1951*\nThe 75“page index gives latest lists of top AEC and contractor personnel, committees,\netc. Lists, by topics, all unclassified research contracts (includes institutions in\n1±0 states).\nOf interest to TV stations will be the fact that the report includes 12 illustrations\nof which copies can be furnished on request. In ordering please state size and finish\nwanted.\nSend all requests to Radio-Visual Information Branch, Room l6i|. Atomic Energy Commission,\nWashington 25, D. C."
}