{
  "id": "d1380-1",
  "text": "pointed out in the NAEB petition that 93 of the channels contained in the FCC Table\nof Assignments are on Channels 14 and 15, and in 64 cases, this represents the only\nchannel assigned to a given community. Sixteen of these assignments are reserved for\nnon-commercial educational TV stations.\nFCC REAFFIRMS POSITION RE CLEAR CHANNELS\nHie FCC has reaffirmed its previous decision on the use of clear channels. In\ndoing so, it made the following statement: \"The National Association of Educational\nBroadcasters takes issue with our decision not to reserve any of the new Class II-A\nassignments for noncommercial educational use. The Commission recognizes that time\nlags occur before education can receive proper authorization and funds to make\napplication for broadcast facilities. We are not persuaded, however, that the public\ninterest requires reservation of some of the Class II-A stations for educational use.\nThe public interest will best be served if new Class II-A stations can be established\nquickly and start rendering needed service to the public. If there is commercial\ndemand for the frequencies, the public interest would not be served by refusing to meet\nsuch demand and by withholding use of certain frequencies for possibly extended periods\nof time to see if there is sufficient educational interest. On the other hand, should\nthere not be commercial interest in some of the frequencies, the time lag would appear\nsufficient for interested educational groups to pursue the matter. Moreover, we have\nindicated that no such application should be acted upon for a period of 90 days. Thus,\nsame time is afforded all interested parties in charting their future course of action.\"\nKEPPEL APPOINTED COMMISSIONER OF EDUCATION\nFrancis Keppel, dean of the Harvard Graduate School of Education, has been\nappointed, by President Kennedy, to be the United States Commissioner of Education.\nDean Keppel, 46, has been dean of the Harvard School since 1948. From 1955 to 1959,\nhe served as chairman of the American Council of Education's Council on Cooperation\nin Teacher Education.\nOHIO REQUESTS ADDITIONAL ETV CHANNELS\nThe Ohio Educational TV Network Commission has petitioned the FCC, requesting\namendment of the rules to provide additional UHF TV channels, reserved for non-commercial\nETV channels, in the State of Ohio. Altogether they have petitioned for the addition\nof 20 reserved channels, as recommended by the NAEB Spectrum Study, to be accomplished\nby the reservation of certain unused commercial channels and transfer of certain\nother channels.\nMISCELLANEOUS FCC ACTIONS\nOn 12/28/62, the FCC granted CP for new noncommercial educational FM station\nto Allegheny College, Meadville, Ba., to operate on 88.1 Me with 33 watts power.\nOn 1/2/63, granted license for noncommercial educational FM station to WCER-FM,\nThe Cedarville College, Cedarville, Ohio.\nOn 1/3/63, finalized rule making and shifted reservation from Channel *15 to\nChannel *12 for noncommercial educational use in Moscow, Idaho, and retained Ch. 15\nfor commercial use in that city. The University of Idaho had petitioned for reserva¬\ntion of the VHF channel."
}