{
  "id": "d1380-3",
  "text": "-3-\nthe background that you provide your Senator or Representative while\nhe is on ?he local scene will make more effective future contacts...\nafter he returns to Washington.\" ,. _\nIt seems to me that many of us in educational broadcasting\nhave an allergy to political activity that is unenlightened and\nnaiv^ As educators, we quite properly are opposed to having\npoU^cs aflect the content of what is taught; but as educators and\ncitizens in a democracy we not only have the right but the responsi¬\nbility to be concerned about legislation and to make an effort to\nhave wha? we consider the right laws passed and the »™ng ones i d.\nEducational organizations and their constituents are entitled to tak-\na point of view. You have the right and obligation to do what is\nlegitimate Ind proper in a democracy-to try to affect legislation.\nItSbahooves all of us, as effective participants m a democratic\nsystem, to let our representatives know our views.\nMeetings in November\nIst^gldTcation, WNYC-TV, New York, ceremony Gracie Mansion^\ntransferring FCC'experimental UHF channel to New York City\n5th M. Voison, of RTF Paris, State Department Leadership\n™K°g £°5“r, A-arlo,, NAEB contract propos.l\nestablishing ETV system lor Samoan schools\n9th Dan Lacey, President, Text Book Publishers Council, pro-\nposed changes in copyright law\n12th Joint Council on Educational Broadcasting, meeting,\n14th Fred^febert?'Director ACE-USOE study on copyright and\nresidual rights for ETV ..\n15th Learning Resources Institute, annual meeting, Chic g^\n19th Ivan Nestlgen, Under Secretary HEW: ETV appropriation\nplans, station activation .\n20th M. Renaud, U.S. Department of Agnculature Training D .\nDr. Gunnar Helen, Swedish Bi^oadcasting Corporation ^\n27th Prime Minister \"and Ambassador of Somali Republic - ET\nSomali „ ,\n30th Griffiths Davis, Agency for International Development\nStaff *\nTsTE Mr. Labow, Social Security Administration: possible undar-\nwriting of series of programs re Social Security for d\ntribution to educational radio stations. .\n5th E. G. Burrows (Chairman, Network Committee and Network\nManual Committee): consideration of future role\nstructure of NAEB Radio Network and revisions of NAEB\nNetwork Manual , vtatto\nRegion III Music Directors Meeting, Ann Arbor—first NAEB\nregibhaT~workshop of fBis'nature. Conferences with Leonard\nFeist, President, Associated Music Publishers, Inc. re\nproblem of grand rights in use of music by educational\nstations.\n5-7"
}