{
  "id": "d1478-14",
  "text": "-13-\nis fundamentally the old ’’Northwest Territory.” You could cooperate on that\nline with, say, a series of historical programs. Could also established a re¬\ngional script exchange...prossibly, even a regional newsletter. Such a news¬\nletter could cover 10-watters, wired-wireless and others, not just active NAEB\nmembers. One advantage of that would be that a lot of information is interest¬\ning only within the state or region and might not be of sufficient appeal to get\ninto the NAEB national Newsletter.\nQUESTION: How can NAEB help us achieve a more professional status within our own\ninstitutions? There is a need to educate top school adminstrators in regard to\nthe responsibilities needed to conduct broadcasting, to suggest salary levels,etc.\nANSWER: The National University Extension Association and the NAEB recently\nmade a survey, part of which covers salaries and budgets. For example, it will\npoint out what percentage of the institution’s operating costs ought to go into\nbroadcasting...salaries of broadcasters, etc. We’re beginning to find out that\nthere is greater salary difference between the heads of broadcasting and their\nemployees than there is between b roadcasting and other units of the institution.\nThe results of this survey should be available within a few months.\nCOMMENT: Feel a national attitude should be adopted on paying faculty partici¬\npants on radio shows. There is a current dicotomy: in that the teacher on TV\ngets paid for the same thing he would have to do free on radio.\nCOMMENT: On that matter of helping achieve a professional status: We had a\nspace inserted in these annual Faculty achievement reports for ’’Radio Partici¬\npation. n Now if a man goes on the air, he can list the broadcast along with\n’’books written,” ’’articles in professional journals,” ”learned societies,” etc.\nThese reports go right up to the top and give the man a sense of achievement\nand recognition.\nCOMMENT: We are gaining considerable status by bringing in a temporary broad¬\ncasting staff member from the Britsh Broadcasting Corporation. He’ll be paid\nfrom a special fund set up for visiting experts, lecturers, etc.\nCOMMENT: When we launch a new program series, we have an introductory luncheon\nfor the Deans and faculty administrators from the various departments. After\nlunch, we play for them the premier performance of the series. Shows them that\nwe consider this coming series important, and we hope they will, too. We are also\ncareful to point out that we are not having people do things for us, but that we\nare the medium through which the faculty members are reaching their public.\nCOMMENT: NAEB-ers are not all alike in their interests and resources. There\nshould be at least one session in these meetings in which we sm«n stations\ncan assemble and discuss our own problems. Believe the Convention Committee\nshould consider such a meeting for the next convention.\nANSWER: There are differences, true, but there are even more similarities.\nFor example, the public relations problems are the same for a 10-watter or a\n5-thousand watter. Not necessarily a matter of ’’power—output”; however, there\nmay be a logical breakdown according to the ’’purpose” of the station. Is it\nfor student-training? Education? In-school broadcasts?\n23 May-8:00 P.M.\nQUESTION: Education week is coming up in November. Can we get the NAEB maps ix."
}