{
  "id": "d1478-4",
  "text": "money to explore that need and to support programs to fill it has been made\navailable through the FAE, Kellogg, Rockefeller arid other funds; and, thirdly,\nthe NAEB itself has been in a position to provide the necessary professional\nservices to develop these programs.\nHowever, there are still goals which have not been fully achieved. Educational\nbroadcasters must seek to establish themselves in their institutions; within\ntheir institutions they must reach a co-equal status with other positions of sim¬\nilar responsibility. On the local level, there is an obligation to provide the\nsame kind of local, leadership that headquarters provides nationally.\nQUESTION; What is the status of the script exchange? (Bender)\nANSWER; Never developed an active nor effective exchange. Chief difficulty\nwas that the scripts submitted to headquarters were seldom usable by anyone\nother than the donor. Envision future reinstatement of the script exchange, for\nboth radio and TV. (Schooley)\nQUESTION; What service can wired-wireless stations receive through the Associa¬\ntion? (Operator of student station)\nANSWER; Question referred to afternoon session. (Abbot)\nCOMMENT; NAEB has a lot of scripts. Many may be deadwood, but many of them are\nprobably good. NAEB should find somebody to screen through the available mat¬\nerial, and select and discard from those already on hand. (Lardie)\nCOMMENT; Scripts are available for THE JEFFERSONIAN HERITAGE series in book\nform. Probability that WAYS OF MANKIND and PEOPLE UNDER COMMUNISM scripts will\nalso be published. (Schooley)\nQUESTION; Will the JEFFERSONIAN HERITAGE again be available on the NAEB Tape\nNetwork?\nANSWER: Not for the original general distribution. The Tape Network is over¬\nloaded. The HERITAGE is already available on L.P. for broadcast.\nQUESTION: Why is the BBC Theatre so fussy about dubbing and extra distribution?\nOur English Department wants to use RICHARD III and some of the others.\nANSWER: I urge you not to violate our agreement with the BBC. This prevents\nduplication except by the BBC; that is based on their agreement with the unions.\n(Schooley)\nCOMMENT: Those shows can be recorded off the air by Audio-Visual departments and.\nANSWER: That is a violation of the public law on copyrights.' There is a differ¬\nence, according to NAEB legal consultants, between broadcast rights—which are\nsomewhat more liberal—and recording rights.\nQUESTION: Can NAEB provide us with a brief summary of these new copyright laws?\nANSWER: Will be available in the near future. May print it from time to time\nin the Newsletter. (Schooley)\nQUESTION: Can NAEB give us any advice on the Conelrad business? (Plan to clear\nairwaves in the event of enemy air attack.)\nANSWER: Make it in the form of a memo from this meeting. (Schooley)\nADJOURN"
}