{
  "id": "d1478-8",
  "text": "-7-\nsense of ownership. (2) Have supervisors who are vitally interested in radio.\n(3) Receive frequent visits, suggestions and comments from teachers. (4) Sta¬\ntion personnel service all radio receivers in the schools...excellent opportun¬\nity for building pleasant relations with teachers.\n(DAY) Although any program educates, we should be interested in the end-result\nof that education. The Tapenet, from the standpoint of the educator, is the\ncheapest service there is.\nThe goals of our station can be summarized as follows:\n1) Aid to the teacher. Radio is a learning \"tool1* which the child uses outside\nthe school more than he uses books. \"Educators admit Guttenburg lived, but don’t\nrecognize Marconi.\"\n2) Stimulus to the child. We can offer this stimulus via the prospect of the\nchild himself getting on the air.\n3) Relation of school to community. If we can stimulate parents to listen at\nthe same time and to the same programs that their children hear, we will create\na powerful public relations tool.\n(RICKARD) All these (the foregoing comments) are proper objectives which prob¬\nably echo the goals of the institutions represent. One goal is not better than\nanother. In each case, we must carry out the goals of the institution which\nsupports us. If we believe those goals should be changed, we can try to change\nthem. But until the change occurs, we are beholden to follow the established\ngoals.\nThe primary goal at Wayne University is training students, not public relations.\nFor instance, we broadcast sports programs because we want to train sports\nannouncers.\nSUMMARY FROM MODERATOR-OPEN FOR QUESTIONS\nQUESTION: Having a medium of communication, how can you communicate without an\naudience?\nANSWER: You can train students in speech without an audience. (Rickard)\nQUESTION: How can you justify your radio license?\nANSWER: We hope and expect we can do a public service for our audience. But we\nobserve these basic goals regardless of that audience. (Rickard)\nQUESTION: Did you say your institution didn’t care about public relations?\nANSWER: Of course we’re interested in public relations, but it plays a very minor\nrole. (Rickard)\nCOMMENT: The teacher’s greatest contribution is just to be a good teacher. Doing\nthat good job is itself excellent public relations.\n###########\n23 May\n9:00 a.m. - Executive Committee meeting (closed)\n9:00 a.m. - State sessions\nINDIANA SECTION, REGION III\nThe Indiana State Session for the NAEB Region III conference met in Studio C of\nStation WUOM at Ann Arbor, Michigan, at 9:30 A.M. on May 23, 1953. Mr. John A.\nMaier. chairman: Miss Turnell. secretary."
}