{
  "id": "d1478-9",
  "text": "-8-\nSw\nHi\n: V\nIndiana seems to be the center of public school 10-watt FM operation. Low-power\nFM has been successful in meeting the individual readio needs of public schools\nand colleges..\nWhere should transmitters be located in cities? Mr. Maier stated that a building\ntransmitter for each school is needed in a large city radio plan. Mr. Henderson\nquestioned whether enough good programming could be provided for so many stations.\nMr. Day felt that multiple transmitters are needed because of school scheduling\nproblems: in addition, one 10-watt station would not cover a city.\nMuch discussion was held regarding the place of radio at the Indiana state teach¬\ners * convention at Indianapolis. It was recommended that the following point be\nstressed: Since radio is a tool for all, a general session for educational tele¬\nvision-radio is needed. The program might be divided as follows:\na. University services and the part they play in radio-television.\nb. Participation by students, particularly in 10-watt FM stations.\nc. Speech-radio relationship.\nd. NAEB services.\nIt was suggested that the group define a philosophy of educational broadcasting.\nAlthough some schools are convinced that time can be granted by commercial sta¬\ntions for educational programs, the group felt that not enough time can be so\nreceived. Education requires an integrated program of radio-television, not\njust an incidental program contributed by commercial interest. Only a school\nsystem owned and operated by a school can go on the air at any time desired. It\nis necessary to'convince administrators and teachers of the services of radio.\nThis can be done through the AER. Perhaps mimeographed sheets showing the ser¬\nvices of radio-television to Indiana can be distributed to the communities and\nschools to help spread the message.\nIn defining the philosophy of radio-television, the advantages were listed as\nfollows: 1. Service to the community; 2. training of students, with student par¬\nticipation on the station; 3. student motivation for the study of English, Speech\netc. Each school will have at least two large objectives; service to the commun¬\nity and student participation.\nSchool participation leads to some problems. Dramatic production is too diffi¬\ncult for some groups. It is better to have a central workshop drawn from all\nschools for dramatic programs. Speech programs and others requiring little\n’’production’1 will be satisfactory for all. Transportation of students and inter¬\nruption of schedule is a real problem in schools, unless a telephone line to\ncentral studios is provided.\nIn discussing the value of radio to a school system, the group questioned Mr.\nCarmody from the Gary Schools. He said that Gary decided to apply for a license\nto operate a station because they had carried on make-believe radio activities\nwith dummy microphones, etc., for many years. It isn’t necessary to have a sta¬\ntion, to have radio. Radio activities can be carried on with P.A. equipment,\ntape recorders, etc., but administrators should realize that these other activi¬\nties may easily lead to a station.\nIn discussing the various ways of promoting educational radio-television, it was\ndecided to:\n1. Appoint someone to make a map to show the concentration of stations in\nIndiana.\n2. Appoint someone to write an article for the INDIANA TEACHER. (A monthly\ncolumn was also suggested.)"
}