{
  "id": "d1901-1",
  "text": "JOHNSON BILL MEMORANDUM\n-2-\nIn a memorandum accompanying S.2231, Senator Johnson said that the FCC must make a\ndecision in the matter of clear channel broadcasting prior to April 1 in order to\nmeet the deadline (May l) for submission of U.S. proposals for revision of NAFJBA.\nSenator Johnson said that while the FCC is considering the question of superpower\nand clear channel. Congress may express with moral and legal propriety its views as\na proper discharge of its duties and responsibilites* * *\nThe Senator in his memorandum added that because of political, social and economic\nramifications and consequences of superpower, Congress may properly consider the\nproblems raised, which he outlined as follows: (lithe matter of placing such great\npower in the hands of a few persons is to give those persons the power to influence\ngreatly, if not formulate, public sentiment: (2) the need to furnish top programs\nto regional and local stations would no longer exist, thereby destroying economically\n1500-1600 local and regional stations; (3) the customs, habits, occupations, economic\ninterests, social developments and political beliefs vary from county to county,\nstate to state and region to region, and a station of superpower could not hope to\nserve at one and the same time local and distant listeners; and (4) the type of\nallocation proposed would permit more effective and equitable use of those channels\nnow utilized as clear channels•\n■Vr-ic#\nThe National Association of Educational Broadcasters has petitioned Senators Johnson\nand Tobey for permission to present testimony in the forthcoming hearings before the\nSenate Interstate Commerce Committee. Hearings are expected to begin early in April,\n* ***\nWISCONSIN FILES FOURTH FM BID\nHarold McCarty, director of F-A-E-B Station Y.'HA, University of Wisconsin, reports\nthe State Radio Council of Wisconsin has filed with the FCC an application for\nits fourth educational FM station. It is expected that all four of the stations for\nwhich funds were appropriated by the 1945 and 1947 Legislatures will be on the air\nby the fall of 1948.\nWHA-FM went on the air in March 1947 and is now on the air until 10:00 p,m, daily,\nWHAD, to serve the Milwaukee and Southeastern \"isconsin area will be on the air\nMarch 30, Northeastern Wisconsin is to be served from a site south of Green Bay.\nThe fourth station is scheduled to be on the top of Rib Mountain, the highest peak\nin the state, near Wausau. These stations together will serve approximately two-\nthirds of the area of ’'.isconsin, but a considerably higher portion of population.\nFour more stations are planned to complete the statewide coverage.\nIn the initial stages a'direct- off-the-air pickup will be used for rebroadbasting\nthe programs. Later a relay station system will be put into operation.\nSeveral small station o?/ners in Wisconsin recently made protest to the governor\nof the state objecting to the FM network on the basis of ’’socialism” and offered\nas a somewhat improbable alternative to carry the ’’state’s educational features\nthemselves.” Senior members of the industry and educators long familiar with the\nquarter-century contribution of the ’’oldest station in the nation” did not regard\nthe comments as significant.\nThe new FM station in Milwaukee will broadcast with 10 KYI on a frequency of 90.7\nmegacycles. Initial tests in relaying programs from YHA-FM (91.5) indicated the\nchannel separation was insufficient. Plans now are to change ffHA-FM, the key\nstation at the University of Tisconsin in Madison, to 88,7 megacycles."
}