{
  "id": "d1901-11",
  "text": "■12-\nMINNESOTA LISTENERS RESPOND TO NEWSPAPER POLL ON ”COMMERCIALS”\nSome 40 percent of Minnesota radio listeners think commercials are \"uninterestingn\n29 percent would limit radio sales stories to five minutes in each half-hour seg,\nbut 66 percent don’t want to pay a monthly fee for radio programs in lieu of\nlistening to commercials. Those were the highlights of a state-wide survey made\nby THE MINNEAPOLIS TIIBUNE’S noil on the question of radio commercials.\nIn age groups, the greatest distaste for commercials—48 percent—were those 21\nthru 29 years old. Farm folk plumped for the commercials more than city dwellers.\nChief complaints were that commercials were ’’boring.. .too much and too often...\nan insult to normal intelligence.dull and program spoilers.”\n. -Commercials won approval from 23 percent of those polledf while 20 percent of\ndislikers said they’d be willing to pay a monthly fee to get away from the\ncommercials._Next to five-minute spots, two and three-minute commercial periods\nper half-hour was thought’\"fair” by 15 percent. , In the indifferent class were 29\npercent. * ~ .~~~~ ... \" ~ ..\n***\nN-A-E-B SALUTES A NET.' STATION ON THE WEST COAST\nThe National Association of Educational Broadcasters salutes KCVN-FM for a double-\nfirst and a new and important outlet for West Coast educational radio listening.\nFirst, as a California College--1651l Second, to possess a non-commercial fre¬\nquency modulation collegiate radio station — 1947J The College of the Pacific\nand. the students enrolled are mighty proud of KCVN. Moving into the second\nschool semester of broadcasting, KCVN is serving two worthy purposes; first,\nthe training of students in all phases of radio operation and broadcasting; second,\nproviding a broadcast service to the people of Central California with educational\nand informational features as well as entertainment.\nTo view the present modern studios and equipment at KCVN; to see the course offer-*\n(ings in the Radio Department, one can scarcely believe such phenomenal success\nand progress in a decade, under the guiding hand of John C. Crabbe, director.\nKCVN, 91.3 megacycles, broadcasts with 3400-watts to serve Stockton and the\nsurrounding communities with 6 to 10 p.m, programming each day. Saturday WAS\nthe sole day ”of rest” for equipment and operators until athletic schedules in¬\ncluded Saturday with football and basketball. Student producers, operators and\nsportcasters take over to give a play-by-play account of events together with\npre-broadcast, half-time and post-game activities.\nOver forty percent of the programs are prqduced and presented by students in the\nRadio Workshop. Consistently, an ever-iqpreaslng numbep of requests for program\nlogs, testifies to the growing popularity of |{CVN. pride of the College pf the\nPacific!"
}