{
  "id": "d1901-13",
  "text": "DURR SPEAKS FOR FREE SPEECH\n-14-\nFCC Commissioner Clifford J. Durr, speaking in Chicago at the eighth annual conven¬\ntion of the National Lawyers Guild, stated that more and more problems affecting\nnetwork operation are brought to the FCC, among them operations under AM-FM dupli¬\ncation, network television, and the operation of high-power clear channel stations.\nHe expressed his feeling that there was a need for network hearings before the FCC\nin the near future.\nContinuing to champion his philosophy favoring freedom of expression on the,air\nregarding all social, economic and political matters, and groups._Durr stated:\n\"To withhold from the people any information or ideas on the supposition that\nthey have a harmful tendency is as inconsistent with democracy as to deprive them\nof the vote out of fear that it may be exercised unwisely.'1\n\"To the people as a whole must be left the decision as to what is good and what is\nbad. They must know the bad, if for no other purpose than to be able to oppose it\nintolligently• To suppress the advocacy or rational consideration of any ideas by\na threat of punishment is as much an act of aggression against democratic government\nas to deny access to tEo ballot box by force.\"\nNBC SHAKES UP PIBLIC SERVICE DEPART! .ENT\nAdditional changes in the National Broadcasting Company's public service set-up.\nwere effected this month following appointment of Sterling Fisher, formerly adviser\non public affairs and education, as 'manager of the public affairs and education\ndepartment. Margaret Cuthbert was named director of public affairs; Doris Corwith,\ndirector of talks and religious broadcasts, and Jane Tiffany Wagner, director of\neducation.\nDwight Herrick, public service executive, is now on vacation and according to\nreports, will be given a new assignment on his return. This shake-up is the second\nsince the NEC vice-president Kenneth Dyke took over the top programming job in the\nnetwork.\nDyke, committed to a policy of streamlining NBC public service offerings, has\nalready revamped'\"Salute to Veterans.\" ''Doc-tors' Today.\" and is reported to have,\n\"University of the Air\" up for an overhaul. Elements of this show, including\ncertain objectives of \"Your United Nations\"'and \"Our Foreign Policy\" have already\nbeen inserted into NBC's new public service sustainer, \"Living-194^*.11\nDRYS ARE PUSHING CAPPER BILL THROUGH SENATE\nReports from Washington indicate dry forces are quietly rallying strength backstage\nin a last-ditch effort to push through the perennial Capper Bill to ban ligpgr\nannouncements on the air, Drys are reported bombarding congressional committees\nwith petitions to extricate the Capper Bill from the committee for a floor vote,\nMAKE YOUR PLANS NOW TO ATTEND N-A-E-B»S MIDYEAR MEETINGS AT THE OHIO INSTITUTE\nFOR EDUCATION BY RADIO IN COLUMBUS, APRIL 29 TO MAY 3"
}