{
  "id": "d1901-14",
  "text": "ANNUAL DUPONT A'.ATDS\n-15-\nYearly awards were made to radio commentator Edward Miirrow and stations V.'BBM(Chicago)\nand bFIL(Philadelphia). Each will receive one thousand dollars plus a plaque for\ndistinguished public service. The award to Murrow was presented \"in recognition of\nhis initiative in aggressive, independent, meritorious, gathering, interpretation\nand presentation of news through the medium of radio.” Awards to the two stations\nwere \"in recognition and appreciation of outstanding public service in encouraging,\npromoting, and developing American ideals of freedom and for loyal devoted service\nto the nation qnd the community it serves.1'\nYftlYC'S ANNUAL MUSIC FESTIVAL\nNAEB station , EMC and FNYC-FM made its Ninth Annual American Music Festival a\nmemorable occasion for all concerned, receiving ?/ell-deserved praise for this\ngigantic presentation* The Festival, held as in previous years from Lincoln's\nBirthday through 1 ashington1s Birthday, was a gala 11-day radio spotlight on Ameri¬\ncan music.\nMore than 100 specially programmed broadcasts of American compositions were perform¬\ned by American artists of every race, creed and color. Highlight of the 1948 Festi¬\nval was the record number of premiere performances of compositions by Americans.\nParticioating groups included such headliners as the l.S. Army Band, the Philharmonic\nSymphony of New York, Stuyvesant String Quartet, Julliard School of Music, National\nOrchestral Association, American Youth Symphony Orchestra, any number of participat¬\ning colleges and universities, and the Metropolitan Opera Association.\nj YINYC-FM GOES 20 KY.'.\nj New York’s Municipal Broadcasting System, under the direction of director,\nS Seymour Siegel, completed installation of a new Western Electric 20 KF\ntransmitter in time to broadcast the Festival. In special ceremonies\nFebruary 11, attending throwing of the switch, Col. John C, Bennet brought\nMayor 0'Dwyer's greeting. Special guests included Frederick Lack, vice-\npresident of Western Electric, and Major Armstrong, inventor of FM. This\nNew York NAEB outlet now enjoys as much power as any other metropolitan\nradio butlet in the city.\nRADIO DIFFUSION FRANCAISE PLANS COMMERCIALS\nPierre Crenesse, war correspondent and French radio commentator, was introduced\nin mid-March as new director of the French Broadcasting System in the United States.\nHe indicated plans for the inauguration of advertising on Radio diffusion Francaise,\nthe French government-owned broadcasting system. Under the plan, expected to begin\nin the near, future, French radio vdll remain under government ownership, and all\naccounts will be placed through a government advertising agency. Income received\nwill be used exclusively for upkeep, improvement and expansion of broadcasting\nfacilities throughout Francet\nBefore the war there were seycral privately-owned French commercial stations which\nwere taken over by the government during the conflict. RDF npw has 37 stations which\nform 3 networks. PDF is completely divorced. Crenesse reports, from partisan\npolitics. There is no political censorship of an.v kind, and all shades of opinion\nare presented in news and forum programs, Objective of new revenue plan iq ftp, make\nFrench radio system completely independent,\nCBS ADVENTURES IN SCIENCE CELEBRATES ANNIVERSARY\n\"Adventures in Science\", oldest^coast-to-coast science radio program (CBS) will mark\nits 18th anniversary on March 27 with the same speaker who launched the program in\n1930—Dr. Barren S. Thompson of Miami University in Oxford, Ohio."
}