{
  "id": "d1901-19",
  "text": "NEWS FROM REGION l(ConO\n-20-\nPennsylvania\nThe state’s oldest Catholic College, Marywood, is expanding broadcasting work on\na state-wide basis by presenting a new 15-minute program series carried by seven\nstations in eastern and central Pennsylvania, A project of the classes in radio\ntechnique, the programs are produced-and transcribed at WARM by George Perry,\neducation director.\n***\nNEWS FROM REGION II — Regional Director - Graydon Ausmus, WUOA, University,Alabama\n(Virginia,\"\",Virginia,Alabama,Kentucky,Tenn., North'& So. Car., Georgia, Fla.&Miss.\")\nNorth Carolina\nGovernor Cherry has anpointed a State Education FM Radio Committee to explore\nadvisability of the state entering the educational FM radio field,\nGeorgia\nThe Altanta Area Teacher Education Service brought I. Keith Tyler, Director of\nRadio Education at Ohio State University, to Atlanta in connection with the\nprojected opening of the new FM educational station WABE, This station was pre¬\nsented to the Board of Education of the Atlanta City schools by the Rich Radio\nFoundation, Rich’s is an Atlanta department store which has long been interested\nin furthering educational broadcasting. The gift included not only the complete\ntransmitter but also two hundred ’’School Broadcast Conference” AM-FM receiving\nsets for the schools of Atlanta and Fulton County, The station is for the joint\nuse of the city and county, Mr. Tyler was brought in to aid in the planning for\nthe education of teachers in both production and utilization. The station is\nexpected to go on the air experimentally by May and to be in regular service at\nthe opening of school in the fall.\nAlabama\nN-A-E-B station WUOA, University of Alabama, greets a sister broadcasting enterprise\non its campus with entrance into N-A-E-B associate membership of wired station,WABP,\nto be used as a laboratory tool for the university radio instructional program. VABP\nis under the direction of Leo Martin, head of the radio department, Martin was\nformerly an'instructor at the Northv/estern University radio school and prior to\nthat on the staff of commercial station KFJB (Lincoln, Nebraska),\nAlabama\nAlabama College, N-A-E-B member in Montevallo, continues to produce and present\nan excellent series of educational features over cooperating commercial station,\nTAPI, Birmingham, Under the guidance of Maryland rilson, director of radio service\nfor.the institution, the programs heard include ’’Understanding Ourselves,” a guidance\nseries; \"Alabama Music Time”, a regular course in public school music; \"Concerts and\nDrama”;\"Stories of Long Ago and Far Away”; and \"Alabama Feature Page\", stories of\nAlabama people, places and events in the news. An especially attractive brochure\ndescribing all of these programs and including scrips was made available recently.\nThe institution offers a major in speech with specialization in any of six speech\nfields including speech correction, theatre, teaching, interpretation, public\nspeaking, and radio."
}