{
  "id": "d1901-2",
  "text": "-3-\ni\nj MARCH RADIO CLIP SHEET |\ni---l\nNet sale of time on the air by AM radio station and AM networks rose about 5.6\nper cent compared with 1946 according to an FCC report. The four big networks\nand their key stations reported time sales in 1947 of ^72,352,636 — a 1 percent\nincrease for them, A 6,7 percent rise was reported by 821 individual stations.\nSmall part-time stations in this list showed largest gain, reported as 20 percent.\nThe \"Mayflower’1 hearings before the FCC, presumably on radio’s right to editorial¬\nize (actually in terms of testimony offered on many other issues) began this month\nwith more than 100 witnesses booked to testify in this highly complex issue.\nHearings began and were postponed until April 19-\n******\nSenator Tobey (New Hampshire Republican) called on the FCC to postpone decision in\nthe clear channel case until Senator Johnson’s bill (S-2231) to break down clear\nchannel stations could be discussed in Senate hearings.\n******\nJanuary optimism generated by the interim agreement bet?/een AFM and major networks\nis fading in the face of the March 31 deadline, James C. Petrillo, AFM president\nwas advised by the networks they would seek a lower scale for. television than\nfor AM musicians. Complicating the decision was the AM-FM-TV triangle with\nscales and labor policies to be determined for all three facilities,\n******\nDefense Secretary James Forrestal’s plan for voluntary press and radio censorship\nfor keeping wraps on vital security information may never see the light of day\nunless drastically overhauled- A \"secrecy seminar\" with press and radio represen¬\ntatives was held in Washington March 3. Announcement of the plan on the heels of\nother government censorship plans has occasioned a greal deal of concern on the\npart of information media all over the United States,\n******\nAt least 8 network shows are now using movie technique for turning out the finished\nproduct, but the idea is not universally popular. Shows are recorded in advance\nand then edited to remove \"fluffs\" and tired jokes. The four networks are split\ndown the middle on recox’ded shows, NBC and CBS flatly veto platters| ABC and MBS\nsay they are happy with theirs.\n******\nThe FCC has opened hearings on proposed standards for commercial operation of fac¬\nsimile radio. Proponents of fax newspapers say adoption of standards would be\na big boost for their project. Such papers have been produced experimentally for\nmore than 10 years.\n******\nA New York research department says best present estimates indicate 25 million\ntelevision sets will be in use 10 years from now (less than 40 percent of radio.\nsets now in use). FCC now reports 7 TV station licenses...80 construction permits..,\n19 on the air..,113 applications pending,\n******"
}