{
  "id": "d1901-21",
  "text": "Indiana (Gont)\nare being presented as a part of our \"Story Princess of the Music Box” offerings.\nPost card reports show that 300 schools are participating in our service with over\n3000 children hearing the shows. The broadcasts are given each Friday afternoon\nand we are entertaining over 100 children at each broadcast. Following the broad¬\ncast these children make a tour of our studios during which tour we present a sound\neffects demonstration which always meets with the approval of the children. In\naddition to this series we are continuing our 12 other regular series of programs\ninto the classrooms.\nOur second development is the erection and licensing of an amateur station, W9DAK,\nas a unit of our radio experiences for college students. The station operates on\nten meters under the auspices of the Indiana State Radio Amateur Club, a unit of\nour Radio Division. Our students are meeting each week to study code and theory\nin order to qualify for amateur licenses of their own while the station continues\nits operation under the licensed trustee. T'e are having much fun in talking with\nall parts of the continent,\n*** **•*\nNST S FROM REGION IV f Regional Director - Carl Menzer, WSUI, Ior,a City, Iowa\n(Iowa, Minnesota, North and South Dakota, Nebraska and Wyoming)\nMinnesota\nSeventy-five radio news editors and reporters met on University of Minnesota campus\n(operator of N-A-E-B station KU0M) for the second annual Radio News Short Course\nsponsored by the University. Speakers included Larry LeSueur, CBS correspondent.to\nUN|Dr, Kenneth Baker, NAB research directorj and Dr, Wilbur Schramm, head Communi¬\ncations Institute, University of Illinois.\nIowa\nThe Iowa Tall Corn Network is going to broadcast programs originated by N-A-E-B\nmember Io?/a State Teachers College. Herbert Hake, the College Radio Program\nDirector, says that stations KAYK in Waterloo, KTDM in Des Moines, KFVD in Fort\nDodge, KFJB in Marshalltown, and KSIB at Creston will carry the afternoon class-.,\nroom series. The series is designed for all grades from kindergarten through high\nschool. Station KWWL at Waterloo will also carry an adult education series five,’’\ndays per week in the afternoons. The college will be producing eight hours of radio\nbroadcasts per week. The college will make the programs available without cost\nexcept for line charges.\nNEWS FROM REGION V - Regional Director - Ralph W. Steetle« WLSU, Baton Rouge, La.\n(Missouri, Kansas, Colorado, New Mexico, Oklahoma, Arkansas, Texas & Louisiana)\nOklahoma\nJohn Dunn, N-A-E-B vice president, and director of N-A-E-B station WNAD, reports\nthat Oklahoma School of the Air broadcasts are currently being heard in 74 Oklahoma\nschools throughout 16 counties, according to a report by Director Jesse E, Burkett.\nAs of February 3, a total of 4,459 pupils were participating in the In-School listen-\ning programs offered by FNAD. The number of pupils actually served greatly exceeds\nthis total, Mr, Burkett pointed out, since many teachers who are utilizing the broad¬\ncasts have not submitted reports. Over a hundred teachers have responded enthusi-\ncally to the School of the Air series. Participants are now listed in the follow?- •\ning counties, Cleveland, Comanche, Grant, Love, Oklahoma, Pontotoc, Caddo, Canadian,\nGrady, Kingfisher, Lincoln, McClain, Okfuskee and Payne Counties."
}