{
  "id": "d1901-3",
  "text": "NORC(National Opinion Research Center) at Chicago University reported the second\nannual radio survey sponsored by NAB reveals 70 percent of the U.S. population\nthinks radio is doing a good job. Only 9 percent favored government operation of\nradio and only 6 percent thought the government should operate newspapers.\n#*-*•**■*\nATTEMPT TO BREAK PETRILLO RECORDING BAN\nStandard Radio Company, prominent supplier of transcriptions to radio stations,\nordered bandleader Ike Carpenter(under contract to Standard prior to the AFM\nrecording ban) to appear for a recording date. Carpenter refused along with three\nother musical groups similarly approached#\nBasis of request was Standard’s attempt to prove individual contract rights had pre¬\ncedence over AFM rulings. AFM attorneys apparently advised Carpenter that the James\nC. Petrillo union, rather than an individual artist would be held responsible in a.\ncontract suit. Standard is apparently still seeking a court order on the issue,\nAMERICAN FEDERATION OF MUSICIANS ISSUE STATEMENT ON RECORDING BAN\nJames C. Petrillo, AFM president, recently stated his views in the International\nMusician, AFM Journal which followed the lines of his recent testimony before\nCongress. Petrillo had told the House Committee, the AFL ban on recordings, put\ninto effect January 1, was not directed against records made for home use. He said\nit was aimed at the use of records on radio, in coin-operated machines, and other\nways of competition with live music.\nThe Industry Music Committee (speaking for radio broadcasters, transcriptions\nfirms, etc.) said Petrillo's recent conditional offer to lift the recording ban . „ ....\nis \"not a genuine offer to bargain\". They disputed his contention that recordings\nlessen employment opportunities for musicians, stating \"the contrary is the fact.\"\nPetrillo's offer said the union stood ready to resume the making of recordings if\nan agreement could be reached to protect musicians from mechanical competition#.\n(Ed. note: repeated rumors of an agreement between the radio industry and the -\nAFM had not been confirmed when the Newsletter went to press).\nSECOND SURVEY OF NATIONAL OPINION RESEARCH CENTER ON RADIO\nSeventy percent of the American public is said to think radio industry is doing its\njob either \"excellently\" or \"well\". And 77 percent think it would be better for the\ncountry if broadcasting were kept in the hands of private industry.* Those are two\nconclusions reached in the second survey of NORC-*a continuing appraisal of the\npublic attitude toward radio. The survey, suggested by the National Association of\nBroadcasters, has been operated by Dr. Paul Lazarsfeld, Columbia University. More\nthan 3000 persons in all social and income groups were questioned about their\nattitudes toward radio's Commercials, fairness, and cultural value.\nIn the controversial field of radio advertising, 32 percent said they favored it5\nanother 35 percent said they didn't particularly mind; 22 percent said they were\nwilling to put up with it, and only 9 percent wanted it abolished, However, 43\npercent said they did not like singing commercials as well as straight commercials,\nand 37 percent liked them better*\nSeventy-nine percent think radio stations are fair in news presentation. (55 percent\nvoted to give newspapers in general a vote for fairness)# Forty-four percent said\nthey got most of their news from radio. (Lazarsfeld said a much higher percentage\nhad considered radio a primary news service during the war).\n^Editorial note: Last year's NORC survey reported radio \"as doing a better job than\nthe schools or the church.\" It also reported that somewhat more than 50 percent were\nnot aware that radio was subject to government--that is this portion was not aware\nthat radio wavelengths are public and not private property#"
}