{
  "id": "d1901-6",
  "text": "-7-\nCALL FOR STRONGER \"VOICE OF .AMERICA\"\nA statement approving a stronger shortwave service for the United States in the\ninternational broadcast field has come from a group of radiomen and other.communi¬\ncations expert making up the State Department’s advisory committee on radio. They\nrecommend, in view of the critical world situation, the \"Voice of America\" be\nstrengthened to match any other nation, and, urge additional funds and facilities.\nPresident of the National Association of Broadcasters, Justin Miller, was designa¬\nted sub-committee chairman to study long-term policies for international broad¬\ncasting. Other committee members included N-A-E-B member I alter Lemmon, World\n1 ide Broadcasting Corporations Mark Ethridge, Louisville Courier Journal; Lesley\nDunn, Associated Broadcasters. Inc.; G, E. Haggerty, Lestinghouse nadio Stations;\nE. J. Boos, Crosley Corporation; Adrian Murphy, CBS; William Brooks, NBC; Paul\nporter, former FCC chairman; Harold Laswell, Yale Law School; W. H, Dinsmore,\nGeneral Electric.\nSTEPHENS COLLEGE PERSUSS DUAL PROGRAM OF LAD10 EDICATION\nStephens College, Columbia, Missouri, operators of campus station KWWC point out\nin a recent statement of activities and objectives that (l) radio is placing an\nincreasingly important role in modern life, and therefore communes greater interest\nin modern education and that (2) the radio industry offers expanring career.oppor¬\ntunities for both men and women. Therefore, radio director Hale Aarnes administers\nthe radio education program to (l) familiarize students with the functions of\nradio and its social significance as a modern means of communication and (2)\nto give students with a definite career interest in radio the necessary training\nfor satisfying employment. At Stephans in Kl’.i'C operation and management parallels\nthe staffing of a normal, medium-sized commercial station.\nFMA FEABFUL OF DUPLICATION\nThe frequency modulation association has sent questionnaires to more than 400 FM\nradio stations to determine whether present network policies hamper programming\nto meet local needs. Says J. N. Bailey, FMA Executive Directors \"We have had\ncomplaints from members of the FMA that some of the major networks have adopted\npolicies of take all of our programs or none on FM.. In some instances our members\nhave complained that they would be forced to cancel many local-interest programs,\nsuch as high school sports, if they are required to carry a full network schedule\non their FM stations.\n\"If present network oolicies continue FM broadcasters taxing network service\nmight well become network outlets, depriving local communities of a large.measure\nof programs not now available on ordinary radio.\" Network programs.containing\nmusic were made available February 1 to FM stations for the first time since\nOctober, 1945, as a result of joint action of the four major networks and the\nAmerican Federation of Musicians.\nRUTGERS UNIVERSITY FORUMS\nRutgers University, N-A-E-E Member in Km Brunswick,New Jersey, continues to pre¬\nsent a well-produced and timely series of forums dealing with significant problems\nof our timol Using the facilities of V’AAT (Newark) ' CTC (New Brunswick) and SNJ\n(Bridgeton) programs deal with such topics as the effect of New Jersey s new state\nconstitution on the civil liberties of residents. Forums also consider such\napplied aspects of issues-for instance the civil liberties discussion will consider\npossible areas in New Jersey in which civil liberties have been endangered or\ndenied, and will recommend specific action for maintenance of civil rignus."
}