{
  "id": "d1901-7",
  "text": "THE MAYFLOWER CASS—AN EDITORIAL\nDuring 1937 and 1933 the Mayflower Broadcasting Company in Boston followed the\npractice of broadcasting editorials, supporting Candidates or issues favored by\nthose in control of the station.\nThe matter came before the Federal Communications Commission who ordered the sta¬\ntion to stop the practice, ruling that with the \"limitation in frequencies inher¬\nent in radio\" that a \"broadcaster cannot be an advocate.\"\nIn hearings beginning in March before the FCC \"in the matter of editorializing\"\nmore than 100 witnesses representing many points of view began testimony in\nhearing which will continue in April*\nRadio Trade organizations have for several years been conducting a campaign which\nin essense stated that the FCC has in every instance(except the technical) over¬\nridden its authority and is interfering with \"free speech\" and is a threat to \"free\nenterprise\". They have made the Mayflower case the spearhead of their attack\nagainst \"bureaucracy\".\nIt should be noted also that the present FCC has been fully as interested as the\nNAB in having a full and complete review of the case*\nSince \"free speech\" and \"free enterprise\" are assumed to be the heritage of every\nU.S* citizen, the answer appears simple. If a ruling by the FCC prevents free\nspeech—strike it off the books.\nHowever, the Mayflower ruling was an effort (an effort that may well need clarifi¬\ncation) to guarantee free speech - to insure that both sides of a question roaches\nthe public, and that no broadcaster abuse the temporary monopoly he enjoys BY\nPRESENTING ONLY HIS SIDE CF AN ISSUE, AND FORBIDDING OPPONENTS TO SPEAK.\nThe financial and operational requirements of broadcasting (like the press and\nmovies) result in a very few people exercising a very great degree of control over\nwhat the public reads and hears, and sees.\nIn a word, any station operator or licensee has a \"preferred position\". The abuse\nhe can make of his position is obvious. The alleged abuses in the KMPC newsroom\n(Los Angeles) as reported recently by Billboard illustrates the danger; On the\nother hand, this preferred position in the hands of an undeniably qualified licen¬\nsee might work equally well for the common good. The position of the licensee\nobviously must remain a trusted position.\nIn other words radio has become a giant voice, millions of times louder than the\nvoice of any single individual speaking from a single platform. A good idea or a\nbad idea becomes no better or no worse merely because it is amplified, but it does\nbecome enormously more EFFECTIVE for good or ill* because of its loudness*\nWe in America have never been in favoid of the bigger man shouting down the little\nman, and we've written our whole Constitution* the system of checks and balances\nto prevent just that.\nThe concern in the Mayflower case in a 20th century world is that the men with the\nelectric amplifiers be reminded the citizen holds title to his facilities. The\nbroadcaster may own the amplifier, but his right to use it is vested in the people$\nIt is inconceivable in a democracy that a particular station or network should\npresent ONLY its own point of view and no other--or ever be permitted the position\nwhereby they COULD DENY another his right to speak*"
}