{
  "id": "d55-111",
  "text": "September 22, 19$k\nMr. Waldo Abbot\nRadio Station WHOM\nUniversity of Michigan\nAnn Arbor, Michigan\nDear Waldoi\nHerewith my vote* on two aeriea, one of which you may not\nhave received from John Holt yet.\nMAM wnH A mmm * American Foundation for the Blind,\nInc. iouay orientation - we don*t know what we*re getting into.\nMo openers or cloaere. Man who answers questions is introduced,\nall right, but whan It comes tine to answer questions, there*s\nhis voice Ilk® a stranger from the night. {These comments apply\nto Kaltenbora tape, and I think the first in a aeries should do\na better job of letting the listener know what he is in for.\nHearing Kaltenboro is bad enough when you know what*a coming,\nlet alone having him thrust upon you In such a manner.) Holt\nsays now that he*a heard these tapes, he*11 plan to put on\nopeners and closers. Personally, I think they would require quite\na bit more informative and lengthy openers and closers than Met\nheadquarters should be expected to provide. However, keep on\nreading, ’cause I*v© only heard part of one tape (quit on that\none because of guest as referred to above) and after I*ve heard\nmore, I may vote for this thing yet.\n!•» now listening to the Margaret Truman tape. It still\nbothers m that the two \"men with the answers,\" though earlier\nintroduced, are not identified by voice, so we don*t know who\nthey are during the course of the conversation. The subject\nmatter is interesting enough, I believe, and Miss Truman does\na nice job.\nAnd now, Lowell Thomas - Here we don*t have much trouble\nwith identification because these guys us® one another*s names.\nAltogether I*d say that Gregor has found a pretty good de-\nvice for presenting some interesting information about the blind •\ninformation that we should all be interested in. Realising that\nwe won’t all be interested, the us® of well known personalities\nm IBeSe programs will undoubtedly result in a considerably lar¬\nger audience than could be obtained in any other way. I vote IKS,"
}