{
  "id": "d55-122",
  "text": "September 30, 1954\nMemo 2\nTo:\nFrom;\nRes\nStation Managers\nNetwork Headquarters\nA\nSplicing and Rewinding of Tapes\nWe quote from a letter by Mr. Robert C. Higgy, Director, WOSU, to\nMr, Cecil S„ Bidlack, our NAEB Television Engineer;\n**We have been experiencing increasing difficulty with NAEB tapes and\nI thought you would be interested in knowing of the problem involved. As\ntime goes on, more and more splices appear in the tapes being used by the\nnetwork. These frequently cause difficulty in play back when they are\nimproperly made and it seems like most of them are being made very poorly\nnow. We had a tape recently which had many splices in it, most of which\nwere made using ordinary Scotch tape would completely around the magnetic\ntap© including the side with the iron oxide on. These splices caused\ncomplete interruption in the program as well as gumming up of the play\nback heads. Apparently someone made these splices without knowing the usual\nrecommended procedure of putting the tape on one side only and also trimming\nthe width of the tape a bit*\nwThis problem will certainly be a difficult one to deal with and there\nis no easy solution. We inspect our own tapes regularly and made new splices\nusing Scotch splicing tape No. 43., which is made especially for splicing\nmagnetic tapes. A tape can be quickly inspected by holding the reel up\nto a bright light such as a window and most splices are clearly seen. We,\nof course, discard tapes when they have too many splices but we seldom have\nto do this.”\nAs you well know, this same complaint has been made both to Headquarters\nand by Headquarters over the past several years, and we are sure you are\ntired both of mailing it and of hearing it* (We have previously noted having\nfound tapes spliced with cloth medical tape 1 In fact, with everything except\nwornout barbed wire*..) Nevertheless, we must not default the Battle of\nthe Tape Supply because of battle fatigue.\nWe therefore requests That tapes returned to the NAEB have as few\nsplices as possible. That splices be made in the orthodox manner with a\nsplicing tape which is made for this purpose.\nWe also request that, when possible, you do not rewind tape after play¬\ning it. Retain the original reel and return the take-up reel.* This will\ndo away with the inevitable wear on tape caused by a fast rewind.\nHer© at Network Headquarters we splice tape only when we have to fill\nout a 11 short” reel. Editing is done by the wdubw method exclusively. Once\nmore we are going to have to toss out a number of bad tapes—it is impossible\nto estimate just how many at this time. Please help us to keep the number\nof these toss-outs down to an absolute minimum.\nthank you for your attention."
}