{
  "id": "d55-125",
  "text": "ANN ARBOR\nWHOM 9,7M.c.\nFLINT WFUM 107.1 M.C.\nUNIVERSITY OF MICHIGAN\nWALDO ABBOT. DIRECTOR OF BROADCASTING\nANN ARBOR. MICH.\nE. G. BURROWS. PROGRAM director\nMr. John Holt\nNAEB Tape Network\nGregory Ha I I\nUr ban a, Illinois\nDear John:\nOctober 7, 1954\nOCT 8 1954\nMl\n7l9|9|ip(U|12|l|2|3i4|6|9\nL\nreceived\nNAEB HEADQUARTERS\nHere are a few^/ords lacking wisdom\nconcerning tapes#\n,rORGAN MUSIC” --1 've already reported upon\nin a letter,according to my records we’ve heard from Dawson,\nHolmberg, and myself# Account stands, 2 no, I yes. It is up to\nHill and if he votes in favor of it, then we’ve got a tie and\nthen.we leave it up to the fifth wheel—Holt.\nMHCWS THE FAMILY”—I think this is an\nexcellent program idea, but I don’t like the way it was handled.\nIt was too strong in its condemnation of parents. I thought the\nformat was exaggerated. The message would have gone across\nbetter if the listener had not been forced to be so thoroughly\ndisgusted with the parents. When the dramatic part had ended\nnothing had been done—not a constructive ending to the program.\nThe music interludes were distorted on the tape that I listened\nto. After I had read Harold HI I I 1s comments--! think he express¬\ned his feelings better than I am able to. I don’t I ike the\nprogram itself, but I think its purpose, its idea is commendable\nand therefore, I’m going to go against my better judgment and\nvote ”yes\" in favor of it. This leaves the vote for this: 3 in\nfavor and I against, which means a final vote ”yes”.\n\"INTERPRETATION”—I think it sounds like\nan announcer giving a talk—just, who was he? Why should he\nspeak in the first person as authority? Tfaatehasn't been justified\nby any introduction. The program is not built as well as it\nshould be. Here again, I have the opportunity of reading the\ncomments of other members of the committee which I feel is very\nvaluable because I don't have to write so much. I think Hill\nis right. It could be a very valuable program, if it were well\ndone, and therefore, I’m going to vote ”no.” This again leaves\nthe vote, Michigan and Illinois against the program, and the\nSiamese twins from Minnesota favoring it. So again, Mr. Fifth\nWheel Holt you can decide. Although, at Columbus you said, that\nI should decide in case of a tie. If I had my way, I'd still\nsay ”no” for the program."
}