{
  "id": "d55-131",
  "text": "ANN ARBOR\nWHOM\nFLINT WFUM\nUNIVERSITY OF MICHIGAN\nANN ARBOR. MICH.\nOctober 25, I\nWALDO ABBOT. DIRECTOR OF BROADCASTING\nE. G. BURROWS. PROGRAM DIRECTOR\nMr, John Holt\nTape Network Manager\nNAEB\nGregory Hall\nUr ban a , Illinois\nbear John:\nI hope that I will not give the impression of being\nan atheist in the way I consider the recent batch of programs\nreceived from the University of Chicago, In the years of broad¬\ncasting we've tried out many religious series and in every\ninstance I've gotten into trouble. When we talk about some\nreligious character I find a listener who is using a different\nBible or belongs to a different faith who takes issue with the\nstatemzits that are made on our program. When I broadcast a series\nof programs for a particular faith — all other faiths seem to think\nthat they are in political fields and demand equal time on the air\nfor their particular faith. Some years ago the University of\nMichigan tried to start a theological school but it resulted in so\nmuch of a turmoii that it had to be given up. Ministers represent¬\ning different religious faiths could not agree as to what was to\nbe taught in the courses, Consquentiy, I am very cool towards\nprograms of this sort.\nTHE FAITH OF THE CHURCH--six programs. These talks\nare very nicely presented. However, I don't think that the\nAcceptance Committee should determine what is to be taught in the\nway of religion by radio stations of Universities, throughout the\ncountry. This idea of mine conforms with the efforts that have been\nmade in various cities to teach the Bible in classrooms. So, I'm\ngoing to vote “NO.”\nKING LEAR--two programs. A very, very dramatic\npresentation. If it were part of an entire series by Shakespeare\nI would be more favorably impressed. I don't think that it would\nhold listener interest as presented, therefore, I'm goinq to\nvote ”NO.”\nMATTHIAS—one program. I don't know how the University\nof Chicago operates but they get such erratic timing on their\nprograms. A program should be submitted for 14/30 or 29/30 but not\nfor 12/10. This requires a great deal of filling. I think each\nstation writes its own continuity to go along with a music program"
}