{
  "id": "d55-170",
  "text": "TO:\nJohn Holt, Waldo Abbot, Jack\nWestbrook, Ed Slack\nDATE: April 20, 1955\nNAEB headquarters\nam 2(1 baD\n7mi0111,12,1,2,8,4,5,;\nFROM:\nHugh M. Mix\n/•Jy^\nSUBJECT: The Adventures of Tom Sawyer,\nAmerican Adventure, Roots of\nJazz, Carl Sandburg (one program),\nMan With a Question.\nAdventures of Tom Sawyer - I am forced to disagree with Ed on this one. Of\ncourse, the actors are not boys. They don’t pretend to be. Still I felt\nthe interpretation was good and the overall effect was entertaining. At\ntimes I even found myself transported back to the days when I actually\nread the adventures of Tom Sawyer. I’ll vote yes.\nAmerican Adventure - This one is barely under the wire for my money. Except\nfor one or two characters, the acting was very strained at times. A good\nmany of the parts were actually miscast through a use of college students\nwhere a more mature person, or at 3.east voice, was called for. Experience\nwas definitely lacking, although the second program was better than the\nfirst. I found that the tapes sent to me were noisy. On the theory that\nthis was not the universal experience of the committee, I’ll vote yes.\nBut as I said — just barely.\nRoots of Jazz - This program was not nearly so good as it might have been.\nI found three things wrong with it, primarily. First, the programs seemed\nto have no logical progression from one program to another. That is, they\nwere neither a history of the music in a chronological sense, nor were they\nan analysis of the development of jazz from its basic elements to the\npresent day complexity of schools and types. It was simply a hodge podge\nof information. Second, the narrators are so melancholy. This is ap¬\npropriate when talking about spirituals, but not when talking about bop\nand bogey. In other words, there was no variety. Third, the programs\nlacked quality in a technical sense. They were mushy. However, this\nmay not be the fault of the original recordings. Still, I vote yes on\nthe basis that jazz is increasingly being recognized as a legitimate and\ntypically American type of music, and there is a great deal of interest\nin it.\nSandburg - An unqualified yes.\nMan With a Question - On the basis of the informational content alone, yes —\nalthough I think the program could have been presented more attractively."
}