{
  "id": "d55-171",
  "text": "RECEIVED /\nWATQ mTAnmiAOTL-nP /\nNAEB HEADQUARTERS\nMAY 2 7 1955\nTO: John Holt^ Waldo Abbot, Jack\nWestbrook and Jim Slack\ni\nFROM: Hugh M. Mix\nPROGRAM SERIES: Jazz in Transition\nI was just looking at Jack’s reactions to the program, JAZZ IN TRANSITION, after\nhaving auditioned the tapes. In general I agree with his. general criticisms,\nalthough not necessarily with his final conclusion.\nPersonally, I liked the over-all effect of the show. It appeared to me that\nMiller and Gordon know as much about jazz as do the two gentlemen who did\nRoots in Jazz. Also I like the idea of giving live piano illustrations in\naddition to the records, something which the other two did not do. And if the\nreflected personalities of Miller and Gordon leave something to be desired, so\nalso did the personalities in the ’’Roots” program. In fact, I prefer Miller and\nGordon.\nBack to the piano—that always creates a problem. The piano is the hardest single\ninstrument to record and even harder to dub. It has a greater tendency to flutter\nthan anything else except perhaps the violin. This is one problem that should be\nsolved, if possible, before the series is approved (if it is).\nIn addition, the voices sound muffled which also shows poor reproduction. It might\nbe a good idea never to approve a music program for distribution on the network\nexcept those we know can be reproduced adequately. I don’t know about that.\nOver and above this, I must admit that the first thought of a full hour jazz\nprogram left me a little cold. Many people, you know, don’t even like jazz. I,\nmyself, am one of those who like it, but only in small doses. However, once I\nstarted listening to the show I couldn’t leave it. And I think that is primarily\nbecause of the last thing Jack objected to: namely, the program doesn’t limit\nitself to any one thing in a single time allotment so you have no chance to get\ntired of it. To put it in Jack's phrase, \"They jump around.” In my opinion\nthis is what makes the program far superior to \"Roots'! \"Roots”, for me got pretty\ndull after the first ten minutes.\nOn \"Transition” though there was some Jelly Roll Morton, Glenn Miller, Benny\nGoodman, George Shearing, some vocals, etc. And the idea of using Handel to\nillustrate Woody Herman (that isn't exactly what they did, of course) fascinated\nme.\nIf the reproduction problems can be worked out I would like to see some way\ngound to do this series."
}