{
  "id": "d55-174",
  "text": "TO: John Holt, Waldo Abbot\nJohn Regnell, Ed Slack\nDATE: October 12, 19#\nFROM: Hugh M. Mix\nSUBJECT: Unfinished Business, They Bent Our\nEar, Music in the Making\nHad a little trouble auditioning these grant-in-aid tapes because of the blank\nspools. In fact both spools were blank on Unfinished Business.” Can't give\na vote on that, unless, of course, there should happen to be two \"yes” votes\nfrom the other members of the committee, in which case you can count me as\nbeing agreeable.\n\"They Bent Our Ear”: one of the spools was blank on this series, but it didn't\nmatter. This, as was obvious from the second submission, is an excellent\nprogram and gets my \"yes\".\n\"Music in the Making\": This program again demonstrates, I think, the kind of\nthing you run in to when a grant of money is made to a group that doesn't have\na radio station of their own. They quite often come up with a program they think\nis great but which is actually nothing more than the educational stations, operating\non maximum time, do every day. You sometimes wonder what they spent the money for.\nAside from that, however, the actual quality of the programs was very bad. The\nmusic was subject to flutter and was distorted. I know they used a new magnecorder\nand good mikes, according to their submission form, but the state of repair of\na recorder is a lot more important than brand names.\nThe illustrations used on the violin program were rather poorly chosen, to my\nway of thinking. On the average radio receiver the non-musical listener can't\ntell whether you use a bow or a yard stick in the playing of a violin. Since\nthe illustrations didn't come through they actually helped to disprove what\nthe participants were trying to prove.\nOn the Beethoven program, the woman was very hard to understand. Just when I\nwould get to the point where I thought I was getting used to the sound of her\nvoice and her enunciation, she'd go back in the mud again and I'd have to start\nall over straining ray ears to hear her.\nI may be over-critical of this program. I only heard the two programs listed\nabove. Again the tape with the programs on choral music and Italian opera was\nblank. But on the basis of what I heard, I'd have to vote \"no\".\nHMM:Ln\n1 4 lbo5"
}