{
  "id": "d55-25",
  "text": "December 3* 1953\nMr. George Frobst\nOf rice of Enivereity Broadcasting\nUniversity of Chicago\nChicago, miooia\nDear Mr© Probsi*\nOur telephone conversation day before yesterday was feezed by the cacophony of two\nelectrical typewriters, other phene mil®, and various conferences. I was literally\nforced to my knee© and one elbow. Testament to cur crowded condition* This will confirm\nour conversation.\nI. I understood that the Radio Office would furnish copies of \"openers\" for the Chicago\nprograms. These openers will bo read live by local announcer©*\nIX* I hope the American Language tapes can be here soon. We have offered them to the\nstations, and the first program should be duplicated and in the mail within two weeks\nof this date*\nIII. As you s&y, there is seme material which simply will not fit into any standard format\nwithout mutilation. But, unfortunately, we have in the past received numerous odd-\nlength contributions which could and should ham boon cut to sice. When we did cot\ncut it ourselves (and usually it has been a matter of only a few seconds deletion),\nwe received complaints.\nThe program format \"requirements\" are, X believed, an accurate reflection of desires of\nmember stations. X must, therefore, urge that they bo adhered to by contributors-when\npossible. But X cannot \"decree\" them, nor am X certain that X should bo permitted or\nl/ asked to. The Hetwork Acceptance and Xn-School Program Committees will, of course,\ntake format into consideration In their evaluations and decisions* but certainly no\npossible contributor should be forMdjflen on grounds of \"format\" from making a sub¬\nmission which lie thinks maybe of value to HAEB.\nThis format problem does seem pedantic, but it is important* It involves basic\nattitudes, prerogatives, isd duties. X am trying to give ray own polst-of-vlew a rather\nwide circulation in hope that it will help lead toward the general clarification that is\ni/ necessary for the improvement of the network®s service. Xour reaction will be greatly\na predated®\nIt was good to sm you again at Konaaa, and X hope we will meet again before too long.\nJHido\n©es Mr. Thomas Parrish\nExecutive Director\nExecutive Board\n^tv^rS^Aclepl^S Committee\nSfetwork l&snager\nXn-SchooX Program Ccmmittoo"
}