{
  "id": "d55-90",
  "text": "Mr. Waldo Abbot\nPage 2\nAugust 16, 1954\nTHE NEGRO SPIRITUAL - KPFA\n— YES • Maybe I*» crazy, but I like this. In spite of some of\nthe shortcomings, such as poor quantity on some of the recordings\nand weakness of the narrator in places, I think this is an en¬\nlightening and interesting study of on© of the most important\nforms of American music. It also shows for will in future pro¬\ngrams , they say) the direct influence that Negro spirituals had\non the birth of Jazz, which is certainly entirely American in\norigin and growth. It may shock a few die-hards, including some\nmusic directors, but all for it.\nSAMPSON AGONIST ES - U. of Chicago\n— YES - True that this is a one-time shot and that the length\nwill make it awkward to schedule, but I believe w© should have\nmore truly cultural and educational programs of this sort. The\nintroduction, though long, is well don© and pood background for\nthe reading to follow. The reading is very we'1 done, and who\ncan dispute the worthiness of the writing? True, probably only\na minority audience, but isn’t our major purpose to serve those\nwhose tastes are not served by any other broadcasters?\nTEE HOUR GAIJ - U. of Chicago\n— NO - This may be good literature, but I don’t think the pro\nduction is well done, and the listener will become so confused\nand bored that he will refuse to listen. The confused opening\ngets it off to a bad start and it never recovers.\nTHE FOUR AGES OF JAPAN - U. of Chicago\n— NO - We should probably make an effort to know more about the\nJapanese culture, and a noted authority from Japan would certainly\nsee® like a fine source of authentic information. However, the\nmanner of presentation is so deadly that only the most avidly in¬\nterested would bear with it to the end of the program, and even\nthey would be hard put.\nTHE EGOIST IN TRAGEDY - 0. of Chicago\n— YES - An interesting and educational subject, handled in a most\nstimulating manner.\nThat’s at\" for right now, hut I hope to get a chance to audition\nsome more tapes and send you my votes within the next day or two.\nCordially\nHarold E. Hill\nAssociate Director\nHEHscp\nCCi John Holt"
}