{
  "id": "d1864-1",
  "text": "-2-\nI mentioned the Committee’s periodical, Education by Radio* To make this\npublication as effective as possible we need more news from the educational sta¬\ntions. This should concern particularly novel and outstanding projects which the\nvarious stations are carrying on. As an example of the type of article which is\nparticularly effective may I cite the September 19, 1935 issue, advance copies\nof which have been placed in your hands. The article concerning the new studios\nat 17HA and the pictures which supplement the description will not only prove a\nvaluable as suggestion to persons in other parts of the country but will be help¬\nful also to the authorities in charge of 1/HA. be have printed a larger edition\nthan usual of this issue. The extra copies have been furnished free to the\nWisconsin authorities. They will be distributed to key people in the state. The\nNational Committee on Education by Radio will be glad to render a similar service\nto any of the other members of this Association.\nThe members of your Association can assist our organization in keeping in\ntouch with newspapers and periodicals. Clippings, or better still, copies of\npublications containing accounts of educational broadcasting or other material\nwhich might prove valuable would be gratefully received at our office.\nA third function, and an important one, has been to encourage as well as to\ncarry on research in education by radio. The study of radio broadcasting in the\nland-grant colleges and state universities, and the studies made annually of ed¬\nucational broadcasting being done by the state departments of education, the\nstate teaohers associations, and the state congresses of parents and teachers,\nare examples of the work which the Committee has done in the pursuit of this aim.\nTo secure to the people of the United States the use of radio for educa¬\ntional purposes is a function of the Committee to which many of its other aims\ncontribute, but to which they are all subordinate. At the time of the Committee’s"
}