{
  "id": "d1864-12",
  "text": "efforts. The interest expressed, by many of the radio students has been/surprise to\nthe instructors. One professor commenting upon the results of an examination re¬\nmarked: ’'The distribution of grades is almost the same as that for students who\ntook the examination in class. I figure that the radio group is somewhat handi¬\ncapped by lack of a textbook and also by losing twenty minutes of the period in\nthe early part of the course. The result is rather encouraging as to the extent\nto whidh the materials went out on the radio, or discouraging to the university if\nthe students in the classroom don’t get any more by being there than they could by\nsimply listening in from the outside.” This particular course was broadcast di¬\nrectly from the classroom and did include some discussion from tne class. Con¬\nditions were such in this class that the classroom discussions could be broadcast\nsatisfactorily.\nThe continuity of interest in the radio junior collegefrom quarter to quarter\nis interesting. Approximately 4000 different individuals were enroled during the\nfirst five quarters; over 1000 having been enroled for two or more quarters. This\ncontinuity of interest together with a steadily mounting enrolment leads us to\nbelieve that there is a definite place for this program in Ohio. An analysis of\ncourse enrolments and student interest shows clearly that courses, well organizedr\nand for which an extensive mimeographed text or outline is available, are desired.\nCourses using a textbook have also proven satisfactory. One textbook publisher\ncooperated in determining the sales of a certain book used in one of the courses.\nA check with enrolment figures showed that a few more books were sold than we had\nenrolments for. This indicates a much larger audience than our enrolment figures\nshow.\nThe cost of conducting the radio junior college and the amount of effort involved\nmay be of interest. Three full time office workers have been required to handle"
}