{
  "id": "d1864-18",
  "text": "-4-\nNo groups of managers however wise or honest could be trusted with such power.\n^ If freedom of speech on the air is assured, if listeners* rights are\nto be paramount, if responsible minorities are to be protected, if youth is to\nbe safeguarded, if the finest of American culture is to benefit everyone, if the\nincalculable values of universal communication to a democratic government are\nto be preserved, and if the menace of monopoly is to be avoided, the American\npeople must demand an adequate share in the air for public broadcasting service.\nThe National Committee on Education by Radio, in 'which this Association has\nmembership, has studied this question for four years and now presents a plan for\nan American system of broadcasting. The basis of the plan is a public, non|-pro-\ntc\nfit system to supplement but not supplant the present commercial chains.\nThe present commercial broadcasters have done a surprisingly good job\nof broadcasting, considering the limitations inherent ina system supported sole¬\nly by the advertiser. The advertiser pays for time*$jg|| his dominant interest\n/L J '\nis selling his goods public welfare is only incidental. If a program\nslightly below proper standards of good taste and decencyfby its sensationalism^\n’ __....... ■■ ■■.- <■.>\nwill gain\\the largest audience, is satisfactory to the advertiser. If\nother broadcasts interfere with the Mg customers* sales program, the broad¬\ncaster is in a difficult position. He must censor programs by denying time.\nFor example, the agricultural college broadcasts advice to farmers teaching\nthem to make the best use of home-grown feeds. Such programs may offend\nlarge advertisers of patented stock food preparations and the station loses\n& paying customer^ or else the college broadcast must be discouraged. Censor¬\nship is inevitable in the present systemHj|l,he plan proposed is not harmful\nto present broadcasting agencies. It concedes their value and the service\nthey have rendered. The plan does, however, recognize the inevitable limita- *\ntions under which private profit-making broadcasting labors. The third public\nchain, with its affiliated local stations, can be established with little inter-\nference to present agencies. Twenty or twontyHHflwr percent of present available"
}