{
  "id": "d1864-4",
  "text": "-5-\nis not a member of the broadcast division, his study of radio broadcasting has\nmade him more than an ordinary authority in this field. Speaking before the\nharvard University Graduate School of Business Administration on May 14, Com¬\nmissioner Payne placed his finger on the weak spot in American broadcasting when\nhe said:\n\"As the president of the National Broadcasting Company has stated,\nvery frankly, this company was established’as an indirect sales promo¬\ntion agency for the radio manufacturing industry.’ Naturally, with such\na beginning, the character of the program offered was purely commercial,\nand if really fine things have crept in, it has been largely as a sop to\nCerberus, and only because there has been growing, and growing rapidly,\na demand that the cultural aspects of radio should be given more consid¬\neration.\"\nMore recently, on August 21, to be exact, he addressed the American Associa¬\ntion of Agricultural College Editors meeting at Cornell University. He criticized\nthe political activities of the broadcasters. He deplored tha fact that in\nAmerica \"the cultural aspects of radio are made secondary to its commercial as¬\npects.” He ridiculed the idea that radio was or could ever become a \"Fifth\nEstate.\" He pointed to the necessity for the establishment of a bureau of stand¬\nards with regard to the character of radio programs, and then contributed the\nfollowing pertinent observation:\n’\"'/hen we stop to realize that the radio in this country is prac¬\ntically entirely in the hands of those interested solely in its com¬\nmercial aspects, we are inclined to wonder what might have happened to\ncivilization if the press had been for about five hundred years con-\ntroled by commercial agencies, and educational and political reformers\nhad been unable to get their ideas into circulation because the com¬\nmercial control found it could make more money by appealing to the\ntastes and interests of the less intelligent rather than the more\nintelligent.\"\nBefore 1 leave the discussion of the Federal Communications Commission I\nwould like to direct your attention to the attitude held by members of the Com¬\nmission toward one of the trade magazines of the radio industry. It is a publicatio"
}