{
  "id": "d1893-0",
  "text": "N-A-E-B NEWS LETTER\nNational Association of Educational Broadcasters\nMadison, Wisconsin — February 17, 1937\nNAEB PLANS OHIO INSTITUTE SESSION\nThe 1937 Ohio Institute for Education by Radio will be held May 3-5 at Colum¬\nbus. The NAEB is arranging the afternoon session on the opening day.\nNow - we must arrange a program which will reflect the ideals, hopes, and ac¬\ncomplishments of Association members. Every member can be represented in the\nprogram if the proposed plan receives full cooperation.\nIt may work out like this:\nI \"Educational Stations on the March\" (20 minutes)\nA summary of educational broadcasting proper based on members* reports.\nII Progress Highlights (Reports in brief)\nReports by representatives of member institutions in which each will\nexplain some one phase of work which is unique or especially success¬\nful. Maximum time for each - 5 minutes. Stations intending to\nparticipate in this portion of the program must report to the Secretary\nby April 1 to be included in the printed program. Give subject, name\nof representative, and, if possible, send a copy of the report to be\ngiven.\nIll Why the Educational Station?\nTo embody the philosophy of broadcasting by educational institutions,\nunderlying principles, conflicts, discrimination in programs, etc.\n(Who shall do this?)\nNow - about your work! Reports are needed for composing the first item on\nthe program. What is your outstanding feature, and why? What hr.s been your most\nsignificant advance in the past year? What, more than anything else, justifies\nyour existence and continuance? What are vour expansion plans for this year? How\n{jjuch /s your staff, program schedule, and service area being extended?\nWhat (aside from money) do you need most to improve your service and status? What\nare you doing to advance the technical side of radio? Television? Facsimile?\nShort wave? Recording?\nIn these questions you should find a starting point. Let's make this program\na good summary. If you intend to use one of the topics you mention as the subject\nof the 5 minute report, please indicate that.\nNAEB BUSINESS SESSION SET FOR OHIO INSTITUTE\nNAEB representatives at Columbus will meet on Monday evening, May 3, in a\nclosed session for the discussion of Association business. Members are invited to\nbe present. This is an opportunity for the exchange of ideas, and for the plan¬\nning of further activities of the group. In past years this meeting has been very\nvaluable. This will be no exception if a good representation of members is\npresent.\nNAEB Newrs Letter Headquarters, Radio Hall, University of Wisconsin, Madison."
}