{
  "id": "d1893-1",
  "text": "1937 MEMBERSHIP REPORT\nTreasurer B.B. Bracket reports fourteen regular memberships had been received\nby February 8, and that several more were \".in the mill” at the various institu¬\ntions.\nKFDY South Dakota State College\nKFJM University of North Dakota\nKUSP University of South Dakota\nWIXAL World Wide Broadcasting Foundation\nWBAA Purdue University\nWESG Cornell University\nWEW St. Louis University\nWHAZ Rensselaer Polytechnic Institute\nWILL University of Illinois\nWSAJ Grove City College\nWSUI University of Iowa\nY.'TAW A & M College of Texas\nCleveland Collage, Western Reserve University\nWestern State, Kalamazoo\nIf your station is not on the list now - look to your accounting department.\nAnother report will be made next month.\nWe welcome a new member - WIXAL, Boston - non-commercial, cultural, educa¬\ntional. Heard the world around on the short-waves*.\nSECOND CONFER JACK BEING PLANNED\nNaEB President K. B. McCarty has just returned from a Washington meeting\nattended by represent' tivos of the sponsoring organizations for the December 1936\nNational Conference on Educational Broadcasting. He reports that plans are under\nway for a second conference to be held in Chicago during the latter part of 1937,\nproviding funds can be secured to finance the convention. Our Association, as\none of the sponsoring groups, will be expected to assist in planning for the con¬\nference, Send along your ideas and suggestions for such a national assembly to\nMcCarty.\nFIRST AMERICAN EXHIBITION £F RECORDINGS OF EDUCATIONAL RADIO PROGRAMS\nFormidable as the title sounds, we remind you that the time is getting short.\nAll programs recorded must have been used on the air prior to April 1, 1937. Plan\nnow to put your programs on discs, and show the others what you are doing. Win¬\nners will be announced at the Ohio Institute session May 5.\nTHE 1957 CONVENTION. WHERE?\nPlans for next summer’s annual NaEB convention should soon be made. Where\nshall it be? What shall it embody? Recent meetings have been held as follows:\n1934 Kansas City, 1935 Iowa City, 1936 Madison. Home cities of member stations\nhave been preferred recently.\nANOTHER REMINDER\nSome stations have not yet sent in their bulletins, scripts, etc. for the ex¬\nchange packet. \"Exchange”, remember, implies give is well as take. Pack up 30\ncopies of everything available and send it now to Secretary H. A. Engel, Radio\nHall, Madison, Wisconsin. The same applies to the News-Letter. We want reports\nfrom all members."
}