{
  "id": "d1893-3",
  "text": "- 4 -\nMAD - University of Oklahoma, H. R. Heck, Program Director, writes* \"Our\nmusic scho>1 is gr nting a master* a thesis for work done by a graduate student in\npreparation and broadcast of a course in music appreciation. A part of the work\nwill be to make a comparison and defense of his methods as against those of other\ninstitutions that .any be offering work of this kind. In order to do this he will\nneed to make contact with any other educational broadcasting stations over which\nprograms of this type are being broadcast. Does your office have any information\nas to the institutions in the Association that are broadcasting music appreciation\ncourses, formal or otherwise? And, if so, do you have outlines of their courses,\nor will it be necessary for us to contact each individual station? We are very\nanxious to help this young man in securing a master*s thesis credit, and anything\nyou can do for us in obtaining this information will be greatly appreciated.\n(S.O.S. - Please send Mr. Heck any data you may have.)\nWNAD is still head over heels in dramatic work. We are doing more than we\nhave ever attempted before. There is an increasingly large amount of student\ninterest on the campus, and \\ie have done some very successful broadcasts.\nV-HA - University of Wisconsin. Director McCarty announces: Addition to\nRadio Hall, Studio D and five more offices, to be ready for occupancy in March.\nWHA is cooperating in \"Radio Education Institutes\" being held in various\ncities under the auspices of the Committee on School Broadcasting of the Wisconsin\nEducation Association,\nA \"radio short course\" is being offered in WHA studios for Wisconsin legis¬\nlators. Three evening meetings are scheduled: #1. Effective Radio Speaking;\n#2.. Effective Radio Writing; and #3. Hear Yourself as Others Hear You (record\nmaking). First class (limit, 20 men) quickly filled. More planned for succeeding\nweeks.\n\"MUSCLING IN ON THE PEOPLE*S AIR\"\nIt is the theory underlying the American radio system that the people of the\nUnited States own their own air. Radio stations, which are usually commercial\npropositions devoted, to the making of profits, are merely granted licenses for\nthe use of specified air channels by a committee of the people which is called\nthe Federal Communications Commission. These licenses must be renewed at frequent\nintervals, and the people reserve the right (acting through their F.C.C.) to take\nany license awry at the end of any period for which it has been granted. Every\nradio station in applying for a license must sign an acknowledgement that it has\nno vested rights in the air and that the government may refuse to renew the license\nif it feels so dis rosed. A few cases in which renewals ha ve been refused have\nalready occured. So much for the theory.\nRecently, however, another committee of the people, this time known as the\nSecurities Exchange Commission, has begun to take a hand in the game. The S.E.C.'\ni'^.0 no authority to represent the people in controlling radio, but it does have\nauthority over the sale of stock in corporations. It tu.s now used this authority\nin three instances to approve the sale of stock in radio stations to the public.\nWhy do radio stations want to sell stock to the public? Wuil, they probably need\ncapital for bigger and better equipment. Perhaps a few of them may even want\nmoney to spend in improving the quality of their programs. But Variety, organ of\nthe amusement interests, uncovers the real reason for this new move. The station\nthat spreads stock among the public, it says, \"would be relieved of the worry\nelement as the expiration term of its current license approached.\" Spread a radio\nstation*s stock widely enough and although that station’s directors formally ack¬\nnowledge that it has no vested rights in the air there will soon be YLenty of\nstockholders who will believe and insist that it has. Thu F.C.C. should take\ncognizance of this impending raid on the public comain without delay.\n- Thu Christian Century, Dec. 16, 1956"
}