{
  "id": "d767-16",
  "text": "ir *\nBernstein -2-\n5. His social values are high and idealistic. His personal\nimpact on people is generally good - excellent on broad,\nhigh calibered people — good on others. He tends to be\nvery warm and friendly to those who share some of his\ninterests, sincere and tolerant but not intensely\nwarm to those whose interests are mundane and ordinary.\n6. His human relations are oriented more towards the\nsociological or group than they are towards the psychological\nor individual - his interests in broad social principles\nand applications is strong. He thinks more often in terms\nof group influence and interaction than he does in terms\nof individual development.\n7. His insights are sharp. He is very contemplative and intro¬\nspective person who looks at himself objectively. He\nconstantly tests what he wants against the possibilities.\nHis knowledge of his strengths and limitations is excellent.\nHe is willing to accept himself as he is.\n8. His understanding of other people is good, and he has\nconsiderable ability to assess the performance of people\nclearly. He has good ability to see the situation fion the\nviewpoint of another, although he does not habitually do so.\n9. He has good leadership qualities. While neither the high-\npressure salesman nor the rabble-rouser, his poise, purpose\nand confidence are communicated to others.\n10. He has the patience to teach, guide and direct others. He\nwill make few organizational mistakes, and will lead\nand direct others firmly and consistently. For the long\nhaul, he will build a smooth organization based on clear\nprinciples and effective teamwork.\nConclusions and Prognosis;\nIn our opinion, insofar as his psychological qualifications\nare concerned, Mr. George A, Bernstein is superior for the\nposition. He can see the broadest implications of\ncommunications and strives towards long term goals.\nHe has definite upgrading potential in either staff or\nline activities, but it is evident that he will be\nutilized most effectively where his creative intelligence\nand his verbal effectiveness are challenged. For\nmaximum personal growth, we suggest that he heighten\nhis impact on people by being a little more spontaneous,\nenthusiastic and free wheeling.\nRobert W. Henderson\nConsulting Psychologist\nMay 20, 1952\nml"
}