{
  "id": "d767-18",
  "text": "Charles Warren\n~2~\nAdministration and many others. Incidentally, during ray free\nevening hours* I taught public speaking at George Washington\nHigh School in Alexandria, Virginia. a\n• _ ^*n 1951 I left the Mutual Broadcasting System to accept\na position with the GTice of Rent Stabilization as Chief of R«dio\n«Iori^^on Division, where I wrote three weekly radio scripts\nentitled ”The Landlord Meets the Tenant*2, a public service\nprogram heard over hundreds of radio stations around the country.\nAs Chief of Radio for the O.R.S. it was necessary for rae to\nmaintain a constant liaison with Members of Congress, other\ngovernment agencies and commercial radio and television stations\naround the country. During this tenure, I wrote the majority of\nspeeches for the Director of O.R.S., TIghe E. Woods, and\npersonally accompanied him on many of his trips when he was\nschpduJed to speak before various citizens groups and organizations.\nEarly -in 1952, when it became apparent that the O.R.S. would be\ndissolved, I joined the National Broadcasting Company in Washington,\nas Production Director for News, Public Affairs and Special Events.\nDuring this time I produced and originated many public service\nprograms. Two of ray regular network assignments included the\nproduction of Meet the Press” and wThe American Forum of the Air”.\nI also originated and produced my own local radio\nprogram^ known as ^Washington Controversy” which weekly took up\ncommunity problems of particular interest to Washington citizens,\ninis was a panel or forum type of program setting forth the\npros and cons of issues such as flouridatlon of the city’s water\nsupply.*.Segregation in the District of Columbia Public School\nSystem, conditions then existing in the Municipal Hospital*\nCrime and *rwenile Delinquency in the District of Columbia,\nTraffic Control, and similar issues of community interest.\n_ 0 * _ with 1 learned of the financial difficulties of\nthe Sch# of Nursing in one of Washington’s largest and oldest\nhospitals (Garfield Memorial) and undertook as a personal\nproject, not as an assignment from NBC, the task of helping to raise\nthe necessary funds to keep the School of Nursing open in order\nthat graduate nurses might be trained at this highly reputable,\naccredited school. As a direct result of my personal contact\n,Pef Sons in public office and local business^ radio and television\nstations, newspapers, and accompanying -publicity. I am very happy\nto be able to say that the hospital received ffcmds exceeding their\nrequired goal. In appreciation of my efforts, I received a very\nIcind^ letter from the Board of Directors of the Garfield Hospital\nthanking me for my participation in this worthy cause.\n, . ‘ i. At the inauguration of President Eisenhower in Jannarv,\no5h ? 2rodSSSd the 9nfcire proceedings from the United States\nCapitol for NBC."
}