{
  "id": "d767-34",
  "text": "WLmmmjmmaL\n1. GENERAL? Incumbent will serve as assistant to the NASH Executive Director. He\nwill himself be responsible for selected projects, and will generally provide\nassistance in the operation of the MSB National Office in the most efficient,\nfriendly and business-dike manner possible.\nii.\n1. Education of a high standard, to insure that NAEB relations will be\ncharacterised by dignity, cultural understanding, intellectual\ncuriosity, integrity, and tact.\n2. An analytical intelligence, in order to protect NAEB interests in\nnegotiations or situations where the NAEB3 s advantages or cause could\nbe jeopardised by a too hasty or ill-considered statement, agreement,\nconcession or objection.\n3. Willingness and ability to put NAEB business ahead of family convenience,\nwhen necessary; ability and willingness to entertain guests, visitors and\nmembers, sometimes unexpectedly.\n4* Above-average physical energy and steady nerves; not easily ruffled by\ninterruptions, deadlines, and continuous responsibility.\n5. Ability to take criticism without being \"hurt\"; good sense of humor.\n6. Steadiness of career Interest. Not a job for a floater, or for any¬\none interested principally in using singly as a \"stepping stone.\"\nHI*\na. Special reports, articles, questionnaires (average 5 to 10 per month).\nb. Drafting sections of requests to Foundations.\nc. Drafting sections of annual (and more frequent, as requested) reports\nincluding financial, policy, publication, and program statements.\nd. Drafts and proposals for needed contracts, constitutional changes, dues\nand rates recommendations.\ne. Publicity\n(1) .Releases on such developments ass\n(a) Special upcoming programs and series.\n(b) Workshops, seminars, etc.\n(e) Grants.\n(d) Fulbright awards.\n(e) NAEB new publications.\n(f) Special projects.\n(2) Special exhibits for conferences (NAEB and non»NAEB), fairs, etc.\n2V Jto&BBL\na. Radio and television program ideas.\nb. Surveys and studies? Network and Headquarters research.\no. Certificates, membership-cards, pamphlets, ,"
}