{
  "id": "d767-62",
  "text": "->\nWe shall, continue to keep in close touch*\nneed making* m have all agreed to present the\nrespective boards•\nand if any basic decisions\nproblems involved to our\n1 hereby invite reactions to the above .\n5) 2£2®S3 After a yQm* md a half on the job* 1 had never visited\nthe ft. K. Kellogg foundation. Dr. Maurice Seay extended an invitation for me\nto stop by and I did so. He also had an opportunity to shake hands with Cecil\nBidlack* although as was generally the case' at all our stops* while I was talk¬\ning to Br. Seay* Cecil was busy in discussions with Wallace Garaeau of Kale-\nmasoo* who was in Battle Greek also at Ms time*\ni had the impression from the hour 1 spent with Br. Seay that everything\nsa/fis in pretty good shape* He mads clear to kb* in answer to ay indirect ques¬\ntions* that no decision has been made by the Kellogg Foundation regarding *\neither the continuance or discontinuance of its support of the MSB* A couple\nof the other recent notes to Kellogg* of which youf will by now have received\ncopies* are also the outgrowth of this discussion*\nI pointed out* as far as our Foundation relations are concerned* that we\nhad always discussed with Kellogg first our long-range plans. We also always\nsubmitted to Kellogg first all requests which would affect our basic operation,\n.i outlined the basic discussions now taking place in Washington among the vara.-\nous organisations concerned. 1 told him of the joint efforts of the ii&EB and\nthe SPAO in many areas. I told him ojj the need for is to know soon the Kellogg\nreaction to our Washington offic&vv Ttf’thia connection I explained the logic*\"\nin our opinion* of approaching them first* since the basic Headquarters mech¬\nanism and organisation was entirely Kellogg-established* and we wanted to pre¬\nserve credit where credit was due unless Kellogg specifically gave us a re¬\nfusal on this point* after hearing all aspects of it. If they were not in¬\nterested* i pointed out* we would obviously have to take it up with other pos¬\nsible sources of fund®.\n__ I pointed out that* with two exceptions (Engineering and Placement) all\nFAE Projects were on a project to project basis* with unused funds return-\nable at the conclusion of each* while the Kellogg Project was of a firmly-\nrooted on-going type. I called attention to the fact that only recently\nare the products of the past few years of their grant beginning to be, pub¬\nlicly recognised.\nI indirectly indicated the regret that we would feel if Kellogg were to\ncease its support of the MEB at the point when the latter is achieving the\nsort of genuine stature which would reflect the greatest credit on Kellogg.\nI also indicated, that ell our relations would gladly be frankly discussed\nwith Kellogg if they requested more material or such discussions. I also\nexpressed the hope that our recent reports would provide a satisfactory\nzmsmr to the question so often raised about \"Where the WEB is going,\"\nIn Dr, Seay I found a most intelligent grasp of the situation in very\nprdmpt fashion. He reassured me of their continuing interest and mentioned\nthat Bob Vaattiyn* to whom he was leaving relations with the MS®* would be\nback in this country from England the following week.\nI found this stop a most encouraging one in view of the earlier pessi¬\nmistic impressions 1 was beginning to gather from various discussions in cur\nKellogg ralatd.isyH's,"
}