{
  "id": "d767-7",
  "text": "Mr. Harry Skornia\n-2-\nDecember 1, 1953\nIn 1951, I lo^t the Mutual Broadcasting System to accept a position with the\nOffice of Rent Stabilization as Chief of Radio for the Information Division, where\nI wrote three weekly radio scripts entitled \"The Landlord Meets the Tenant\", a public\nservice program heard over hundreds of radio stations around the country. As Chief\nof Radio for the O.R.S. it was necessary for me to maintain a constant liaison with\nMembers of Congress, other government agencies and commercial radio and television\nstations around the country. During this tenure, I wrote the majority of speeches\nfor the Director of O.R.S., Tighe E. Woods, and personally accompanied him on many\nof hie trips when he was scheduled to speak before various citizens groups and\norganizations. 3arly in 1952, when it became apparent that the O.R.S. would be dis¬\nsolved, I joined the National Broadcasting Company in Washington, as Production\nDirector for News, Public Affairs and Special Events. During this time I produced\nand originated many public service programs. Two of my regular network assignments\nincluded the production of \"Meet the Press\" and \"The American Forum of the Air\".\nI also originated and produced my own local radio program, known as \"Washington\nControversy\" which weekly took up conmunity problems of particular interest to\nWashington citizens. This was a panel or forum type of program setting forth the\npros and cons of issues such as fluoridation of the city*s water supply ...Segregation\nin the District of Columbia Public School System, conditions then existing in the\nMunicipal Hospital, Crime and Juvenile Deliquency in the District of Columbia, Traffic\nControl, and similar issues of community interest.\nWhile with NBC, I learned of the financial difficulties of the School of Nursing\nin one of Washington* s largest and oldest hospitals (Qarfield Memorial) and undertook\nas a personal project, not as an assl^iment from NBC, the task of helping to raise the\nnecessary funds to keep the School of Nursing open in order that graduate nurses might\nbe trained at this highly reputable, accredited school. As a direct result of my\npersonal contact with persons in public office and local business, radio and television\nstations, newspapers, and accompanying publicity, I am very happy to be able to say that\nthe hospital received funds exceeding their required goal. In appreciation of my efforts,\nI received a very kind letter from the Board of Directors of the Qarfield Hospital\nthanking me for my participation In this worthy cause.\nAt the inauguration of President Eisenhower in January, 1953, I produced the entire\nproceedings from the United States Capitol for NBC.\nI am presently the Director of Public Relations for the Sheraton Corporation*s two\nWashington hotels, the Sheraton-Park and Sheraton-Carlton (formerly Wardman Park and\nCarlton) This position entails handling the advertising, promotion and publicity, as\nwell as extensive entertaining and general public relations for these two fine hotels.\nSince the recent purchanse of these hotels by the Sheraton Corporation, it is their\nplan to replace all executive personnel with men already trained in Sheraton methods\nor operational procedure.\nI feel that this would be an ideal time for me to return to the communications\nfield, inasmuch, as the move made now will be a decisive and permanent one. I have\nbeen interested in the theory of educational television since its inception and through\nmy good friend Ralph Steetle, have been interested and gratified to learn of the progress\nmade so far in what I believe to be a crucial step forward in bringing culture, education\nand practical benefits within reach of every American.\nVery truly yours.\nCharles Warren\nDirector of Public Relations\ncci Mr. Gray don Ausmus"
}