{
  "id": "d767-88",
  "text": "insuring himself and, at his option, his dependents, provided\napplication for such policy shall be made and the first premium paid\nto the Insurance Company within 31 days after such termination of\nemployment.\nLife Insurance - Manufacturers Life Insurance Company\nWho is eligible: All permanent employees of the NAEB who work 30 or\nmore hours a week are automatically covered by life insurance according\nto the following schedule*.\nAmount of insurance\nAnnual salary over $15,000 ^2\"(T~000\nAnnual salary from $10,000 to $15,000 10,000\nAnnual salary under $10,000 6,000\nAfter age 65 there is a flat coverage, regardless of salary, of $2000.\nWaiting period: Each new employee becomes eligible on the day he\ncompletes 60 days of continuous employment.\nPremium: Paid by the Association.\nConversion privilege: The employee has the privilege of converting\nhis insurance to an individual policy of life insurance if his\nemployment is terminated, provided written application for the\npolicy and payment of the first premium is made not later than 31\ndays after the date of termination of his employment.\nAccidental Death and Dismemberment and Permanent Total\nDisability - Queen Insurance Company of America\nWho is eligible: All employees of the NAEB who work 30 or more hours\na week and members of the Board of Directors are automatically\ncovered by $50,000 insurance should they be killed or permanently\ndisabled while on NAEB business. (There is a specific exclusion\nfor accidental bodily injury incurred while flying in aircraft\npersonally owned.)\nWaiting period: None for coverage. Benefits will be paid within\n180 days following accident.\nPremium: Paid by the Association.\nSalary Continuation - Insurance Company of North America\nWho is eligible: All permanent salaried employees regularly working\na minimum of 30 hours per week, except those employees who for health\nreasons might be declared ineligible by the insurance company.\nWaiting period: Each new employee becomes eligible on the day he\ncompletes 90 days of continuous employment.\nPremium: Paid by the Association."
}