{
  "id": "d762-18",
  "text": "uses which have been made of commercial outlets by-\nassociate members of NAEB who do not have their own\nstations. He then opened a discussion of the role of\nassociate members of NAEB in the organization and in\nparticular changes in the Constitution and by-laws\nwhich would make associate members voting members.\nSkornia: Described the constitutional amendment which is\nbeing voted upon (at the time of the meeting) which, if\npassed would give associate members the vote. He opined\nthat the amendment would pass. He then brought up the\nquestion of why associate members were not able to sub¬\nscribe to the tape network programs for broadcast on\ncommercial stations. He pointed out that the main obstacle\nhas been legal clearance of program materials, licensed\nmusic (ASCAP and ail) in particular. The problem involves\nboth the music publishers and the musicians unions who\nhave been good about giving clearance for non-commercial\nstation use but would raise objections to commercial\nstation use even on a sustaining basis.\nSkornia said he has asked associate member committee per¬\nsonnel to go to work on the problem, to set up some pro¬\ncedure for determining which NAEB programs can be cleared\nfor commercial station use. He said this is an important\nopportunity for \"filling in the white spaces on the map\"\nwhich ought to be exploited.\nFrom the Floor: What about BBC programs? What percentage\nof the BBC programs on the network could be broadcast on\ncommercial stations through associate members?\nSkornia; \"I would guess about a third of them.\"\nFrom the Floor: Would it be possible to go back to net-\nwork programs of last year and before and find a good many\nwhich are free of music or union restrictions and issue them\nfor commercial station broadcast?\nSkornia: Said the music problem is not always present\nsince many tape network programs, such as speeches, do not\nuse music. However, checking back on the union restrictions,\nif any, is almost impossible. The union problem involves\nboth restrictions by union people at the place where the\nprogram was made as well as at the place where it would be\nbroadcast.\nHe said, further, that it is not physically possible to keep\nold master tapes on file for more than about a year. No\nsuitable place for long term storage and the investment in\n- 6 -"
}