{
  "id": "d762-2",
  "text": "August 17, 1961\nMr. Carl H. Menzer,\nDirector, WSUI and KSUI (PM>\nState University of Iowa\nIowa City, Iowa\nDear Carls\nThank you for your letter of August 14. There is an allotment in the bud¬\nget of $100 per region which, is to he used to help underwrite the expenses\nof a regional meeting. However, since not all of your regional members will\nbe attending the Convention, I think it would be rather unfair to use this\n$100 to cover an expense related to the Convention. It would seem to me a\nbetter idea if this money were used at a regional meeting which permitted\nmembers both attending the Convention and not attending the Convention to\nget together.\nShe Madison SeraAnar Report will be sent to all Active and Associate members.\nHowever, the preparation of the Report has been delayed since Betty McKenzie\nis swamped with last minute plans for the September special issue of the\nNewsletter, and is also waiting to hear from Harley on several points to be\nincluded in the Seminar Report. I don't think we can possibly get the Re¬\nport out until after the Convention which means that neither the Board nor\nthe other members will have a chance to see the Report before the meeting.\nHowever, the Seminar may be discussed at one of the business meetings at the\nConvention.\nAs for the possibility of a Regional IV meeting-- Monday morning, October 23,\nhas been set aside for comaittee meetings, however this would conflict with\nthe Board meeting which you and John would have to attend. Tuesday evening\nis the only open evening, but since this is the only free night, it might not\nbe feasible to meet then. Of course, Thursday evening, the 26th, sill be\nopen after the close of the Convention, but there is a tour planned after the\nadjourmnent of the Convention which some of your regional members might be\nplanning to go on.\nHis leaves the possibility of a luncheon meeting, and if you are interested\nin this, Monday, the 23rd and also Wednesday, the 25th, are open. If you should\ndecide to meet on one of these days, you should make arrangementw with the\nl&rriott for the meal, room, etc."
}