{
  "id": "d762-20",
  "text": "From the Floors Does the size of the grant requested or\nthe size of the institution have anything to do with\ngetting a grant?\nSkornia: Gave an example of a small Illinois college which\nasked for and got a $775 grant. He said that size, as such,\ndidn't determine who got a grant; it depended upon the pro¬\ngram proposal and how well the applicant could carry it\nout.\n(There was a general discussion of the kinds of programs\nwhich stations would like to get, the kinds they need most.\nThe discussion was very scattered and inconclusive.)\nHull: Asked Dunn if he would like to make closing remarks\nprior to adjournment for the social hour and dinner.\nDunn: \"The only thing I want to say is to remind you that\nNAEB belongs to all of you. Your officers are elected by\nyou in democratic fashion and these three men (Skornia,\nHill, Holt) are your servants. It's up to you to guide\nthem as to what you want done. • .You should chastise them\nif they need it and you should praise them when it is de¬\nserved. NAEB will grow and flourish only if you as indi¬\nvidual members are growing and progressing and become\nactive participants in the work of NAEB. I hope that we\nwon't be now like a revival meeting where everybody got\nreligion, went down to the mourners bench, wept bitter\ntears, promised the good Lord and everybody concerned he\nwas going to be a good boy from here on; and then he\nusually forgot all the promises he made. It is so easy\nfor us to go back to our own little shop and get back in\nour own little groove....where we never see the horizon\nor what might be in the future. I hope you will be\naggressively-minded in this matter of educational broad¬\ncasting, remember that you are making a contribution to\nyour own particular sphere of influence, but that you are\nalso part of a great national pattern which has been dis¬\ncussed here today. . .a voice that can be heard by 80\nmillion people.\"\n5:30 p.m.\n6:00 p.m.\n6:30 p.m.\n- Adjourned\n- Social Hour, Hotel Sheldon-Munn\n- Dinner, Hotel Sheldon-Munn"
}