{
  "id": "d1043-10",
  "text": "EXCERPTS PROM BOARD OF DIRECTORS* MEETINGS\nPERTAINING TO KELLOGG GRANT\nPROM THE MINUTES OF MAY 1, 2, and 3, 1951\nRichard Rider, Manager of the NAEB Tape Network, submitted a written progress\nreport No* 2, and discussed the report orally. During the ensuing general discus¬\nsion, the President appointed Burton Paulu to the Tape Network Committee.\nPresident Siegel appointed a school program committee made up of Alvin Gaines,\nChairman} Marguerite Fleming} Sam Gould} Kathleen Lardie} and James MacAndrew to\nwork with the NAEB Tape Network program committee in developing school programs\nfor the Tape Network.\nThe Board of Directors voted commendation to Richard Rider for his excellent\nwork as Manager of the Tape Network, and instructed the Secretary to write a letter\nof appreciation to Mr. Rider, with copies to President Stoddard and Dean Wilbur\nSchramm.\nProbst, Siegel, Hudson, Hull, McCarty, and Wheatley of the NAEB Foundation\ncommittee reported on the progress of the Committee*s fund-raising activities.\nTo date grants have been made as follows:-\n(Fund for Adult Education grants listed here)\nBy the Kellogg Foundation —\n$2U5,350 to the University of Illinois as Trustee on Behalf of NAEB, for\nNAEB operations.\nResolved to accept when tendered the Kellogg Grant as specified in the project\nsubmitted to the Kellogg Foundation.\nReceived a telegram announcing that the Kellogg Grant had been made with the\nUniversity of Illinois as Trustee. (However, it was the understanding of the Board\nthat the University of Illinois would leave to NAEB all determination of the way\nin which this fund would be used.)\nResolved that the NAEB Board of Directors be designated as the Board to ad¬\nminister the Kellogg Grant.\nAlvin Gaines, chairman of the School of the Air Tape Program Committee, re¬\nported on the discussions of the Committee. (Attached)\nFROM THE MINUTES OP JUNE 8 and 9, 195l\nRider reported on Tape Network developments since the Columbus meeting of the\nBoard on May 1, 2, and 3, 1951, and outlined some of the problems encountered in\njudging programs and in setting standards for program selection.\nSchramm reported on the nature and purposes of the Kellogg Grant, and sub- .\nmitted a written \"Report of Progress\". (Attached)"
}