{
  "id": "d1043-106",
  "text": "MGraigwood\",\n1107 Wayne Terrace,\nLafayette, Indiana\nApril 8th 1952\nDear Mr. Miles:\nWith regards to our telephone conversation, I am writing to\ntell you some of the ideas that I have in connection with the enclosed\npiece of the NAEB News-Letter.\nFirs. Alice Meehan*s report that England needs to be educated\nto the American way of life is correct. Perhaps the word educate is a\nlittle strong I think understand and appreciate is better® At the\npresent time one feels that it is necessary that there should be a true\nunderstanding between England and U.S.A.; but I know, having lived in\nboth countries that there are many criticisms on both sides based on\nmisunderstandings *\nNaturally each country has a strong feeling of nationalism\nwhich is taught to us at a very early age, built on historic and\ntraditional background, therefore to understand one another is to trace\nback the history, and see how the different customs and habits developed®\nThe customs of each country should be looked upon as a charm of the\nenvironment,- instead of something to compare and ridicule® England and\nU.S.A. speak the same language, so the barrier of speech presents no\ndifficulty* How then is the best way to produce better understanding?\nIn the past newspapers and radios have reported propaganda\nstories, put out by their own government, to sway the people*s thinking\none way or another; but what it failed to do, was to interpret the home\nlife of everyday people—-the majorities in each country. The Middle\nWest in particular is least known to the British, they imagine it as a\nwide expanse of plains made up by a community of farmers® I would like\nto suggest sending to the a series of broadcasts based on dramatic\nexcerpts of family life here in the Middle West* The story would\ndepict a family of four. Mother (active in club life). Father (a business¬\nman), two children, one in High School, and one in University, they\nwould live in an average size town, on an average income® The family\nwould show the result, of their social, economic, religious, educational,\nand historical backgrounds* In this way the British radio listener would\nbecome familiarized with the characters in the story, and learn to\nunderstand the American way of life*\nHere at WAA we have the talent and facilities to undertake\nthis project, and it is perfectly located for our purpose* In as much\nas my background includes dramatic and radio training at the Royal\nAcademy of Dramatic Art, and the BBC, London; my play directing at\nWRAA, Purdue University; and my activities with Purdue International\nAssociation of which I 'am the British chairman, I feel qualified to\noffer my services as Director of this project."
}