{
  "id": "d1043-110",
  "text": "Ralph Steetle\n- 2 -\nMay 12, 1952\n3® Consideration should also be given to the preparation of a film about the\n242 channels to be shown to general groups who might be receptive to such in¬\nformation and whose support might be helpful® The person showing such a film\nwould not have to be informed about educational television—and after all there\nmust be many people willing to help the campaign along who are not prepared to\ngive a talk on the subject®\n4,® The cause must be brought direotly to the key people in education through\nthe organizations to which they belong® The State College meeting was good—\nexoept that not all of the right people came® W© should go to their meetings\ntoo—administrators, superintendents, mayors, club people, eto.— and place our\nspokesmen on their programs® (I know this is being done; but we should do more\nof it®) In this connection, general sessions are very preferable to small radio\ntelevision \"panels” apt to be attended only by those whose interest has already\nbeen aroused.\n5® Reliable cost data must be readily available® They all ask, \"What will it\ncost?\" I am personally gathering data from the Kansas University medical school\nWOI-TV and Michigan State College® There should be a brochure which provides\nsuch data, even though it may have to be muoh qualified®\n6® General program information must be provided® Brochures describing the best\nwork done by the networks, WOI-TV and by schools broadcasting over commercial\nfacilities should be distributed® Speoifio data about formal course presents*3\ntions should be emphasized; the school men are inclined to think in such terms;\nand many of them can be sold on television for direct teaching who are not en¬\nthusiastic about its general educational services® Where have courses been\ngiven? How many people enrolled? What kinds of syllabi were prepared? What\ntuition was charged and how many people paid it? What department of the insti®\ntution was responsible for the program? Personally I am more excited about\nbroadcasting to the general audience, but I am not the man who needs to be sold3\n7® We must provide evidence of program results® Did the \"Whole Town*s Talking”\nbring about any observable action in the communities whose problems it drama®\ntized? What did the armed services olosed-oiroult experiments show about the\neffectiveness of teaching by television? In other words, if we telecast do we\njust broadcast into the void, or do we evoke educationally significant results?\nAfter all, this television is going to cost a lot of money; what do we get back\nfor it in terns of eduoation®-and perhaps public relations too?\n8o Program examples must be made available® There should be a collection of\nkinescope prints for circulation; to show some of these to legislators and ad¬\nministrators at a crucial point in a local campaign may clinch the deal for an\napplication® Your offioe would be a good place to base such a library®\n9. Progress reports should be issued currently® The president of om school\nshould be told what is being accomplished in another on®. Whenever one school\nmakes an application that fact should be mad® known to all the others—and\nremember that college presidents and school superintendents do not read Broad®\npasting and Varietyl ——"
}