{
  "id": "d1043-12",
  "text": "Publications and surveys are also to be encouraged with the purpose of\nstrengthening all educational broadcasting outlets. It is also the intention of\nthe NAEB Board of Directors that this project shall develop an organizational and\nservice structure in order to insure the continuity of this effort to improve,\nenrich, and extend educational broadcasting throughout the U. S.\nThe executive director is to make a qiarterly report to the Board of Directors.\nThe special committee (mentioned in paragraph 1 on page h above) shall meet\nat least four times each year, and oftener if circumstances require. The expend¬\niture of Kellogg Foundation funds in defraying the travelling and living expenses\nof committee members taking part in its meetings is hereby authorized.\nThe President reconstructed the tape network program committee as follows:\nJames Miles, chairman; Bernard Buck (WNYC); H. B. McCarty; Allan Miller; Burton\nPaulu; Frank Schooley; and Keith Tyler. (This new committee omits from membership\ntwo members of the former program committee—George Probst and Robert Hudson. The\nsecretary was instructed to so inform Probst and Hudson.)\nThe Board authorized Rider to purchase recording tape to the extdnt he deems\nnecessary for the current operations of the tape network.\nFROM THE MINUTES \"NAEB SPECIAL KEILDGG BOARD MEETING\" SEPTEMBER li| and 1$, 1S#L\nThere was discussion of the problems of purchasing and using a mass tape dup¬\nlicator. There was also discussion of the work to be done by the new executive\ndirector. Hull stressed the need for his compiling information about all member\nstations and their staffs, and the need for a central NAEB office. Miles said the\nposition as he saw it constituted a sort of triangular relationship among NAEB,\nthe Kellogg Foundation, and the University of Illinois. It was agreed that Miles\nwas to formulate on paper for submission to the Board an outline of the procedures\nhe intended to follow.\nThe Board resolved that the new NAEB position made possible as a result of\nthe Kellogg Grant be designed as that of Executive Director. (Miles reported that\non the University of Illinois Budget it would be carried as Kellogg Project\nDirector.)\nThe Board instructed the Secretary to determine whether or not the creation\nof this position of Executive Director would require any changes in the association's\nConstitution or By-Laws.\nThe meeting adjourned at. 11s50 p.m.\n(Subsequent to the meeting the Secretary examined the Constitution and By-\nLaws and came to the conclusion that no changes are necessary. He also polled\nthe Board of Directors and the Constitution Committee by mail to obtain the\nopinions of their members. All those replying (up to October 16 when these Minutes\nwere dittoed for distribution) agreed with the secretary's interpretation, al¬\nthough several had comments and suggestions on the question. Replies were re¬\nceived from Ausmus, Engel, Gould, Miller, Siegel, and Steetle. Appendix C repro¬\nduces The Secretary's memorandum requesting opinions, as well as the pertinent\nportions of the replies received to date.)"
}