{
  "id": "d1043-123",
  "text": "University of Illinois . Urbana\nOffice of University Broadcasting\nJune 95 19^2\nMr* Waldo Abbot\nStation WUOM\nUniversity of Michigan\nAnn Arbor, Michigan\nDear Waldo:\nApropos our discussion of last Monday about the meeting with Fletcher,\nI am enclosing a copy of the letter which I sent to Seymour Siegel on\nFebruary 29» When I arrived in Columbus on April 17 and was informed\nthat Sy would not be there, X took occasion to call.Graydon.Ausmus out\nof an NAEB board meeting to suggest to him that the proposition which\nScott Fletcher proposed to discuss was of such potential importance and\nof such general interest to educational broadcasters that it ought to\nbe outlined *in a meeting open to the entire NAEB membership. 1 do not\nknow what action was taken on that suggestion*\nIn the matter of the terms of the $80,000 grant to the NAEB for aiding\nin the development of radio and television programs by educational\ninstitutions, I think Mr. Fletcher^ letter speaks for itself. It was\naddressed to the chief administrative officer of the NAEB, and, so far\nas I know, the FAE looks to your executive secretary for a response to\nits invitation. How your executive secretary functions within the NAEB\nis, I assiame, of no concern to the FAE.\nIn discussing the matter informally with Jim Miles, I thought I was\nmaking the above point, and whether or not it was made explicit, it\nseems to me implicit that the proposal was addressed to Jim in his\ncapacity a3 the chief administrative officer of NAEB—an officer vjho would\nact responsibly for the Association under the terms of his appointment—\nand not in any private capacity.\nIf you are reporting Jim accurately, it may be either that Jim misunder¬\nstood what I 3aid, or in trying to underscore what I considered to be\nhis responsibility in the matter, I may have overdrawn the point and\nmisplaced emphasis. In any event, if a more precise spelling cut of\nthe terms of the grant seemed desirable, Jim or the NAEB board, or Jim\nin behalf of the board, could have asked Mr. Fletcher for it. At best\nthe only thing I have to offer in this matter is an opinion, and I am\nsorry that such opinions as I have expressed, either reported accurately\nor with some distortion, contributed to the confusion within the NAEB\nfamily.\nThe NAEB has been experiencing growing pains during the past two or\nthree years as It accepted constantly increasing responsibility and\npower. It may be on the threshold of a dramatically expanding role as\neducational television becomes a reality* It has the opportunity at •\nthis moment to write its own ticket If it Is able to concentrate Its\nattention and Its energies on major problems.\nYours sincerely,\n/a/ Robert B* Hudson\nRBH :imw D irect or\ncc: Jim Miles (\nEUCq\nG\n0\nP\nY"
}