{
  "id": "d1043-125",
  "text": "W. K. KELLOGG FOUNDATION\nBattle Creek, Michigan\nDivision of Education\nC\n0\n7\nY\nJune 9, 1952\n(Dictated June 3> 1952)\nMr. Waldo Abbot, Director of Broadcasting\nRadio Station WUOM\nUniversity of Michigan\nAnn Arbor, Michigan\nDear Waldo:\nI dislike one part of your very gracious letter of May 26.\nI would have been much happier if you had just said \"Bob\"\ninstead of addressing me as you did. Part of the very real\npleasure to have you with us recently was the opportunity of\ngetting better acquainted with each of you, and I hope being\nable to call each other by our first names. I trust I am not\npresumptive. We enjoyed having you with us and hope that you\nwill feel free as a group and individually to come back every\nopportunity you get.\nAlready I have had occasion to make use of my learning experiences\nwith you folks. As I believe I told you several times, one\nof the best ways we have of being sure we make wise decisions\nwith respect to accepting new projects is the similarity we\ncan find with projects In which we have already made grants.\nTo have the privilege of just sitting in and listening to\nyour men discuss their problems enabled me last week to work\nwith development of a brand new program In a way that I could\nnot otherwise have done. I am sure the Foundation will\nprofit and this new project will be much improved by the\nbenefit we have had of your experiences.\nAs to any help I can give you, I am most willing and happy\nat any time to be useful. I have no other function here. I\nhope you won*t hesitate to ask. The kind of meeting we had\ntogether here, to me, is essential in the growth and maturing\nof any organization. NAEB has great potentialities. I look\nforward with you to very full developments this coming year.\nWith very best regards.\nSincerely,\nRVD/es /s/ Robert VanDuyn\nP.S. We have just secured a little house on Gull Lake. It is\non Willow Beach. It would be delightful to have the\nprivilege of seeing you folks out there this summer."
}