{
  "id": "d1043-129",
  "text": "July 7. 1952\nMr* John W, Bunn\nRadio Station WNAD\nUniversity of Oklahoma\nNorman# Oklahoma\nBear John:\nI have before me your memorandum of June 28 with the accompanying proposal\nrelative to the administration of the FAE Grants In Aid* I think you have done an\nexcellent Job of comprehensively summarizing and stating the problem,. I agree with\nyour main points; however# I do have a number of questions about minor details which\nI am reviewing here — with copies to the members of the Board since they* too# are\nconcerned*\nParagraph three of your memorandum reads as follows:\n“Is it still our thought that $h000 should be set aside for the\nadministration of the grants? As stated in the prior memo, no\ngeneral or widespread announcement should be made* Otherwise\nwe*11 have a flock of applications which woa*t mean much except\na lot of work*\"\nI wonder if this is in keeping with the spirit of the grant? I have the idea that\nFletcher wanted the money to be available to as many institutions as possible# and I\ndon*t see how this can be done unless some sort of general announcement is made,, So\nfar as my selfish interests are concerned# the fewer applicants the better! that\nmeans that whatever we send in from KXJOM will have to coapete with fewer entries,? But\nlooking at it from the standpoint of NAEB and our relations with FAE# I wonder if there\nshouldnH be some sort of general annoimcement sent to the ra&io~T7 trade press and to\nindustrial Journals which might coincide# for example# with our News-Letter release*\nPerhaps we can get some guidance here from Jim who has discussed this more with\nFletcher and Griffiths than we have. If there is still doubt# perhaps the question\nshould be put to Griffiths for an interpretation*\nThe title of your dittoed statement reads as follows:\n\"NAEB-FAE GRAHTS-IN-AID\nTHE NATIONAL ASSOCIATION OF EDUCATIONAL BllOADCASTFRS IN COOPERATION WITH THE FUND FQE\nADULT EDUCATION OF THE FORD FOUNDATION ANNOUNCES A SFRIES OF GRANTS-1N-AID TO EDUCA¬\nTIONAL INSTITUTIONS HOUSING RECOGNIZED RADIO AND TELEVISION PRODUCTION CENTERS FORTHE\nPURPOSE OF ASSISTING IN THE PLANNING AND PRODUCING OF DISTINCTIVE EDUCATIONAL RADIO\nAND TELEVISION PROGRAMS.\" (Emphasis added*)\nJohn# I question the underlined phrase* Is it our intention to limit this to\n“recognized\" production centers? I think the question is whether or not an institution\ncan convince us that they would do a good job with any FAE! money we advanced them* Why-\nlimit grants to \"recognized\" production centers? Such a limitation might suggest that\nwe were trying to exclude non-NAEB members# which it is not our intention to do* This\nis a small point of course; it*s a matter of emphasis rather than of basic difference*"
}