{
  "id": "d1043-139",
  "text": "Under the impact of the opening addresses, of a series of demonstrations\nof educational programs, and of informal discussions around the tables in the\ndining room, in the school buses in which participants rode to and from the\n\"Armory Studios\" where most of the program took place, in the lobby of the Inn\nand on walks around the campus, there began to be a broadening vision, a new\nrealization of some of the dimensions of different phases of the problem.\nConsideration was given at the closing session to the possible creation\nof a national commission for educational television. The purposes of this\ncommission would include those mentioned above with respect to the creation,\nrecording, and distribution and interchange of programs of genuine educational\nand cultural significance; the provision of a means by which there might be\nbrought into focus the desires, likes and dislikes, of sections of the public\nwith respect to television programming; and the development of sources of sup¬\nport necessary to realize to the greatest possible extent the potential of\ntelevision, in all of its forms, for informing and educating our people. The\ngroup favored the establishment of such a commission, and urged the Council, in\nconsultation with the Joint Committee on Educational Television, to take such\ninitiative as might be indicated looking to its establishment.\nThe Institute program was developed by Dr. Carroll V. Newsom, Associate\nCommissioner for Higher Education in the New York State Education Department,\nand his staff including E. Arthur Hungerford of the General Precision Laboratories,\nFrederick Hoeing and Mrs. Eunice Collins Parker. Funds to support the Institute\nwere contributed by the Fund for Adult Education, established by the Ford\nFoundation, the Payne Fund, and the Alfred P. Sloan Foundation. A number of\nconsultants with technical and programming experience in radio and television\nwere retained. Demonstrations of \"live programs\" from the Philadelphia Public\nSchools and Western Reserve University were made possible by the cooperation of\nthe Radio Corporation of America in making available the necessary demonstration"
}