{
  "id": "d1043-14",
  "text": "Part 3: Recurring annual budget for the project in general\nSalaries\n(a)\nJames Miles, director\n9,000.00\n(b)\nContribution to retirement policy of Mr. Miles,\nwho is on leave from Purdue University\n(to be paid throu^i Purdue University)\n1,020.00\n(c)\nStenographer\n2,UOO.OO\n(d)\nWorkmen*s Compensation Insurance\n(l<>5% of all salaries)\n171.00\n(e)\nExpense and equipment\n(including travel, publications, workshops,\noffice expenses)\n19,709.00\n(f)\nCost of administration (5£)\n1,700.00\n$ 3l*,000.00\nThe Board directed the Executive Director to draw up a more detailed 1951-\n19$2 budget to be submitted to the Board at its Biloxi Meeting.\nThe Board directed the Executive Secretary to confer with the NAEB treasurer\nand secretary in regard to the division among them of the duties now assigned to\nthe treasurer and secretary, and to make recommendations as to future procedures\nat the Biloxi Meeting.\nPROM THE MINUTES OF NOVEMBER 1 and 5, 195l\nAfter discussing plans for operating the NAEB Tape Network in 1952-53 and\nthereafter, when the Kellogg grant will no longer support the entire operation,\nthe following resolution was unanimously passed:\nResolved that the Board of Directors of NAEB commit the organization to col¬\nlect from those members using the NAEB Tape Network sufficient funds to defray\none-quarter of the cost of the network*s operation effective July 1, 1952, the\nPresident to appoint a committee to draw up plans to accomplish this purpose.\nThe President appointed the committee as follows: Alvin Gaines, Allen Miller,\nand Burton Paulu (Chairman).\nThe President reported that he had concluded arrangements for the BBC to\nsupply 12 dramatic programs to the NAEB Network, and that the BBC had waived some\nre-recording restrictions so that these might be duplicated for NAEB use. The\nprograms include: The Lady*3 Not for Burning; Everyman; King Henry VIII;\nCaesar*s Friends; Wilson of the Antarctic; ¥Ee Young King; The Importance of\nBeing Earnest; Richard II; Measure for Measure; Tartufjfe; Spiders; and The That's\nto>e."
}