{
  "id": "d1043-15",
  "text": "-6-\nThe President reported an arrangement he had made with David Bernstein,\nassistant to the Administrator of the Federal Security Agency, whereby the Agency\nwould — in the words of Mr. Bernstein — “produce a tape copy of a regular weekly\n15-minute program, which would consist of a continuing factual report of the\nAmerican people on developments in health, education, family security, and re¬\nlated fields which are the concern of this Agency.” This would be a 26-week\nseries, distributed to NAEB mentoers through the tape network.\nThere was discussion as to whether or not a by-law change was necessary in\norder to set up the position of Executive Secretary. (See Appendix C to Minutes\nof NAEB Board meeting for September lU-15, 1951•) The Board sustained the\nSecretary*s opinion that no change was necessary, an interpretation concurred in\nby Marks. (Marks stated during the afternoon session, however, that a by-law\nchange would be necessary if the Executive Secretary were to have officer status,\nor were to sign agreements or checks in the name of the organization.)\nMiles introduced Hugh Masters of the Kellogg Foundation who told the Board\nabout some of the Foundation*s work. He said that, in deciding how to distribute\nits funds, the Kellogg Foundation eliminated such possibilities as relief to the\nneedy and pure research in order to finance the application of research; and that\nit worked principally in the fields of health and general education. He also\nsaid that it deliberately takes on some projects with an element of risk. He\nreviewed the experiences of the Foundation with the Rural Editorial Service.\nMasters said that the Foundation exercised a strict hands-off policy re¬\ngarding the administration of the activities it supported, although it wished to\nbe informed of changes in purpose or policy after such grants have been made.\nHowever, the Foundation believes in flexibility and would go along with necessary\nchanges in procedure if prior notification were given.\nMasters said that many of their projects — like ours — have been confronted\nwith the problem of building a staff and of insuring continuity of direction. He\nemphasized strongly that the Foundation is much interested in evaluating the re¬\nsults of the projects they support. They are anxious to avoid publicity in con¬\nnection with the operations they subsidize. Masters said he does not believe\nradio and TV have realized their educational potentialities, and that our project\nshould dig into \"some of these things.*\nMajor Allan R. Scholin and appeared before the Board to\npropose an Air Force Training Center educational series on the NAEB network. Miles\nasked for an opinion as to whether or not the network could properly carry such a\nseries; it was the sense of the group that it could (although no formal vote was\ntaken)•\nThere was discussion of the network acceptance policy, especially as it\npertained to programs which might bring about adverse reactions in certain\ncommunities due to their dealing with sex, politics or other topics to which\npublic opinion in those areas might react strongly. It was recommended that\nMiles and Rider should inform members in advance when such programs were being\ndistributed so that local stations could carefully pre-monitor them if they wished\nto do so."
}