{
  "id": "d1043-16",
  "text": "-7-\nThere was discussion of whether or not commercial stations may carry any\nNAEB Tape Network programs* Rider was instructed to tell all NAEB members re¬\nceiving tape network service that these programs were not to be used over commercial\noutlets because many of the copyright and union releases which had to be secured\nbefore NAEB could have the use of the programs were given under the definite con¬\ndition that they would not be used over commercial outlets*\nExecutive Director Miles reported on the as yet unsuccessful, although exten¬\nsive, search conducted by NAEB Urbana headquarters for a tape duplicator.\nHe asked who should hold title for such capital outlay equipment as tape\nrecorders or duplicators — NAEB or the University of Illinoiso The Board ac¬\ncepted the suggestion of Hudson that NAEB should hold title to such equipment„\nThe President reported the gift of #600 from Cooper Union and the New York\nHerald-Tribune, and said that the money had been used to purchase recording tape\nand a Presto recorder.\nThe President read a letter from Wilbur Schramm, Dean of the Institute of\nCommunications Research at the University of Illinois which reviewed the Kellogg\nproject and offered some suggestions as to future developments* The letter is\nattached hereto as Appendix B.\nThe Executive Director submitted a proposal for raising money to defray the\ncost of operating the tape network in future years* This was referred to the\nspecial committee of Gaines, Miller, and Paulu set up by the Board on November 1\n(See page 1, paragraphs h and 5 of these Minutes above.) with the request that\nthey review the proposal and submit a plan at the general business mseting of the\norganization on November\nThe Executive Director proposed that the News-Letter as now constituted be\ndiscontinued, and instead be sent out on a weekly basis from the office of the\nExecutive Director. This was discussed briefly without decision.\nThe President directed that Smythe work with Miles on ways and means of eval¬\nuating the Kellogg project (See paragraphs 1, 2, and 3, page 3, above.)\nThe Board resolved to extend the appointment of James Miles as Executive\nDirector from November 6, 1951 to August 31, 1952. (Miles was previously appointed\nto this position from September 1 to November 5, 1951; for action, see page 2,\nparagraph 6, Minutes of Board of Directors meeting of September lU-15, 1951.)\nThe President was authorized to appoint an executive committee to come\ntogether at organization expense between meetings of the full Board, with power\nto act in its place, but with the provision that the decisions and actions of\nthe executive committee were to be subject to subsequent review and revision by\nthe full membership of the Board."
}