{
  "id": "d1043-17",
  "text": "APPENDIX A\nReport of Committee on Proposed In-School Net Operation, prepared by Alvin M. Gaines,\nchairman.\nCommittee: Alvin M. Gaines, Chairman\nMarguerite Fleming\n(Mrs.) Kathleen Lardie\nJames McAndrew\nSam Gould\nRichard L. Rider, ex officio\nThe committee on Proposed In-School Net Operation met on the afternoon of\nMay 3, 19S>1. Present were Kathleen Lardie, James McAndrew, Richard Rider, and\nAlvin Gaines.\nMr. Rider gave a brief background of events (from net headquarters point-of-\nview) leading up to the calling of the committee.\nThe need for an in-school broadcast service by the Network was agreed upon by\nall members of the committee. It was also brought out that the present Net\noperations would not mesh with the need of school stations to be able to audition\nprograms months in advance of schedulingo The need for teacher material was also\ndiscussed, and the conclusion was reached that scripts, guides (single sheets)\nand manuals would have to be made available from the originating station. At least\none script (guide and/or manual) for every station expressing interest in the pro¬\ngram would be necessary. The possibility of preliminary auditioning try scripts\nwas discussed. No final conclusion was reached on this.\nTechnical qperations were discussed and Mr. Rider indicated that when the\nnew multiple reproducing machine was available that the Net could handle a greatly\nincreased distribution load.\nTwo major methods were proposed:\n(1) Present bicycle method distributing a complete semester series at one\ntime with a time interval at each station sufficient to audition and dub (if\nseries is accepted) before forwarding.\n(2) A method whereby a station could send tapes to Net headquarters and\nhave a series transcribed for it. This method was not necessarily offered as a\nsubstitute for method 1, but as a supplementary method.\nIt is not the opinion of the committee that these two methods are by any\nmeans the only methods available.\nIt was at this point that the committee felt it necessaiy to know more about\nthe dubbing facilities of the school stations, their interest in the proposed\nnew service and what programs might be available. The chairman was instructed to\narrange for such a survey.\nRespectfully submitted,\nss: Alvin M. Gaines, Chairman"
}