{
  "id": "d1043-184",
  "text": "KAEB HEAD^ARTERS\nW\nDecember 10, 1952\nTO? INSTITUTIONS ON THE PROPOSED NIZAMI ITINERARY\nmmt Jim Miles\nGentlemen:\nIn cooperation with UNESCO, we are arranging a schedule of visits for Mr* Mahmoud Nisomi,\nwho io station director of Radio Pakistan in Rawalpindi« Inasmuch as his travel funds\nare limited and inasmuch as he must start and return to New York, we have arranged some¬\nwhat of a big circle for him* It is obviously impossible with only $200 in travel funds\nfor him to cover the entire United States.\nMr. Nizami started with All India Radio as a program assistant in 1940* In 1943, he was\nmade director of programs, and in 1945, assistant station director. Hhen India was divided\nhe went with Radio Pakistan, still as assistant station director, and then in 1943 was made\nstation director. Bo graduated from the Punjab UMversity with a Bachelor of Arts degree\nin 1945. He has token some work toward his Masters degree but has never received it. In\nhis own estimation, he has a good knowledge of the English language. His knowledge of\nAmerican radio is evidently, from his prospectus, not too detailed.\nAs 1 understand it, he has been in London with the BBC since November 1. He cranes to\nNew York January 1 to spend a month with the Radio Division of the United Nations. When\nhe completes the attached schedule of NAEB visits, he will go to Canada for a month.\nI mentioned above that ho has only a $200 allotment for travel. He has in addition to\nthis a $300 %aintenanoe and travel status.® I cm not sure of the meaning of these words,\nbut X bsliove Mr. Nizami can live perfectly well but rather moderately. In other words,\nif you can arrange for sous lewdest housing and a reasonable place for him to eat while\nhe is under your care, I am sure he will appreciate it.\nI do not have any pictures of tho man and knew really very little about Mm, although I\nam well aware of how carefully UNESCO screens these applications. Evidently both his\nfather and grandfather were attorneys. His father is currently the Assistant Advocate\nGeneral of Punjab Province. Mr* Nizami is married and has a two-year-old girl. He is\nforty-one years of age.\nWill, you please react immediately to the dates I have proposed Mr. Nizami be on your\ncampus? I need to confirm this whole schedule Mthin the next ten days."
}