{
  "id": "d1043-197",
  "text": "- 2 -\nMr. Harry Skornia\nDecember 24, 1952\n(3) On the personal side, the salary is, of course, |10,000 a year. The university\ndoes.have retirement, health and accident, and life insurance, all of which you are\neligible to particpate in. I am not familiar with these inasmuch as I have kept all\n°f my iiisuraiice active at Purdue and hence have not participated here. The housing\nsituation may present some problems although I am hopeful that Will Schramm will\nassign the house which I now have to someone who can occupy it only until, say.\nSeptember 1, 1953. This would, then, at least give you a place to hang your hat\nfor a few months until you made the personal decisions regarding your house in\nBloomington, etc. People here complain about the high prices of houses, but I\nbelieve they are considerably more reasonable that those in Lafayette, Indiana,\nat least. Theee are plenty of houses for sale, and I think with a little work\nyou could more than likely find a home comparable to the one you have in Blooming-\nton for around the same price. Otherwise, living here is, I imagine, very nv**\nliving in Bloomington. The two communities of Champaign and Urbana together with\nthe university have a combined population of 75,000 or more. The University of\nIllinois is quite a music and drama center. The people you will be working with are\nail top-drawer so that I believe socially and economically you will find Chamoaign-\nUrbana a very pleasant place to live.\n(4) The big battle this past year has been to set up the working relationships.\nThere have been the Kellogg — FAE differences; there, have been the personal dif¬\nferences of the Board; there has been the misunderstanding as to the\" function of\nthis office and the uses to which funds from Kellogg might be put; there have been\nsome long, hard discussions which have left a great many of us emotionally disturbed\nat times. As I look upon this now, I think it was all a growing-up process. I\nbelieve these days are past. Certainly it has been possible to get a great deal of\nbasic work done in the past several months that just could not be accomplished\nduring the early days of my tenure here. I think the problem can be summed up by\nsaying that# we have had too much money too fast, and that we have been working with\na board comprised of members who had never been on this type of board before but who\nIt had never worked this closely with a board before,\nall of which made for the difficulties previously mentioned,\nKiis, of course, was not helped any by the presence of Siegel as president of KAEB,\n13 a g?°d Personal friend, but his driving techniques and his New Yorkerish attitude\nhasreadded salt to many a wound. I think, first, that Sy 1ms modified his views\nsemevhat; and, second, that Ausmus as the new president will be totally sympathetic\nwith whatever is done from this office. He is, of course, of an entirely different\ntemperment and will do things in an entirely different manner. On the long pull. I\nbelieve we are working toward the time whan the Executive Director will run the\nassociation, and the president will do the honors.\n(5) As far as the future is concerned, this is highly involved. I m sure you can\nappreciate this by merely looking at the components which go to make up educational\nd°es sAt in a central position, but it is constantly\nprodded by some of the projects which it has had a strong hand in making. There is\nsome discussion completely under the table that JCET will remain as a permanent organi-\ndo/or creational television what NAEB has done for educational radio.\nAll NAEB Board members are aware of this problem, and certain steps are being taken\nto correct this situation, I believe fimly that JGET will have lived its useful life\nin the next two or three years and will pass out of existence. Perhaps NAEB will at\n30rt °f WasMngton Washington dsalft is"
}