{
  "id": "d1043-2",
  "text": "APPENDIX D\nT\nCOPT\nJanuary 3, 1952\nMr* C. Scott Fletcher\nFund for Adult Education\n914 E, Green Street\nPasadena. California\nDear Spotty:\nAs eftairman of the Foundation Committee of the National Association of\nEducational Broadcasters, and as the officially appointed representative\ncf the NAEB by President Seymour Siegel, I send to you a tentative state¬\nment of the approximate requests for funds for various projects which\nthe NAEB would like to submit to the Fund for Adult Education in 1952,\nThis rough memorandum is submitted at this time because I understand this\ninformation would be useful to the FAE and the Ford Foundation in making\nplans for 1952.\nThe Special Committee of the NAEB that you named in your letter of trans¬\nmittal to Ralph Lowell, made up of George E. Prob3t, chairman, Richard\nHull, Harold McCarty, Seymour Siegel, and Parker Wheatley, is also the\nFoundation Committee of the NAEB. As the Foundation Conmdttee, it is\nthe group officially designated by the NAEB to make plans for the develop¬\nment of educational radio and television service*\nIn a two-day meeting in New York on December 8 and 9, 1951> the conmdttee\nengaged in a lengthy examination of the entire problem that faces any\neffort to move ahead in the fields of educational radio and television*\nWithin the limitations of a letter it is not possible to develop the many\nreasons which lie behind some of the following conclusions, but if some\nsketch can be given of our general thinking, it would assist you in under¬\nstanding the attached tentative list of requests. The following represents\nsome of the general views and conclusions of the committee at this times\n1) We are all satisfied with the four areas outlined in the Lowell\nproject. They are inclusive of a wide enough area of important prob¬\nlems and ideas to allow for the development of most of the programs\nthat the NAEB believes should be undertaken as part of general adult\neducation. Our experience on costs thus far have not led us to be¬\nlieve that any increase in the grant for program production expenses\nis needed. There is need for an increase in total resources available\nfor promotion of these programs.\n2) W© believe there is need for a grant to support the costs of\noriginating and producing programs in the same general areas as\nspecified in the Lowell project but with these programs being produced\nby ten or fifteen of the most competent member institutions of the\nNAEB, such a6 the leading state university radio stations and private\nuniversities•"
}