{
  "id": "d1043-20",
  "text": "-11*\nM7. In event of a national emergency we feel that it would be appropriate\nto consider a mutually satisfactory modification of this commitment,»\nThe University and the Grant\nThe University is glad to have the opportunity of providing a home for the\nnetwork and associated project, and will give freely of its advice and help in\ndeveloping the project as it has in developing the proposal and securing the grant.\nThe University asks only that the staff and other participants in the\nKellogg project follow University financial and administrative procedures. For\nthe accounting, purchasing, and other financial services which the University must\nrender in connection with the project, and as a token payment for the room,\nutilities, furnishings, and service the project will require, the University will\ncollect an overhead of % of expenditures. This is accepted practice and amounts\nto about one eighth of the overhead charged to government projects housed in\nuniversities•\nAs soon as the director and network manager are appointed, procedures in con¬\nnection with the grant can be regularized, and the operation can get under way\nas soon as possible after the first check arrives.\nThe NAEB Board and the Grant\nI hope therefore that the NAEB board will take four important actions at this\nmeeting:\n1. Nominate a project director, who will be headquartered at Illinois and\nbe in general charge, subject to policy approval by the Board, of activities under\nthe grant. This is an important position because the director will be responsible\nfor putting much of the drive and imaginative lift into the project, for many of\nthe contacts with and services to stations, and for most of the contacts with the\nFoundation.\n2. Nominate a network manager, who will be headquartered at Illinois and in\ncharge of network operations. This is likewise an important appointment because\nthis man will be responsible for organizing the network on its new basis and keep¬\ning a flow of good programs going over it.\n3. Nominate a working executive committee of three from the board. Travel\nfunds in this grant will not permit bringing the entire board together very often\nduring the year. Between meetings of the entire board, the project executive com¬\nmittee can function.\nU. Take whatever steps are necessary to insure a standards and acceptance\ncommittee that will operate vigorously to set standards and screen the programs\noffered to the network. The University obviously should not take responsibility\nfor this choice of programs, and the project director and network manager like¬\nwise should not have to do so."
}