{
  "id": "d1043-200",
  "text": "December 30, 1952\nTO* MSB Officers arid Directors\nFRCM* Frank E. Schooley, MSB Treasurer\nHE* A number of things*\nlft This is being written by me, in the absence of Jim Miles for a few days, in order\nthat we save time and clear the decks® As you know, Jim leaves his MEB duties to\nreturn to Purdue, effective February 1, 1953« A successor must be selected* Practically\nspeaking, he has been, subject to approval of the Board. Harry Skornia is available,\ncgsk3 June 1, 1953, and will accept® Schooley has corresponded with Skorxda® Idles has\ntalked with and corresponded with him* Morris Bbvik has talked with him a couple of\ntimes within recent months* I believe I speak the truth, when I indicate here that\nmembers of the original ccayjdttee to select a successor, and Board members at the Chicago\nmeeting, were of the opinion that Skornia was the man® Even so, I think you should now\nformally write your approval, or disapproval., to President Ausmus, and address him at\nMEB Headquarters, 119 Gregory Hall, Urbana® On the basis of your indicated vote, the\nExecutive Committee will probably act, come January 8 and 9, 1953*\n2® Since Miles leaves on February 1 and Skornia is not available until June 1, or\nthereabouts, some means of operations must be found® It is proposed for interim\noperation that Schooley will serve in the vacant position on an interim basis® If\nyou have thoughts on this, indicate them, too, in your letter to Ausmus* Here, too,\njust for the records, I should indicate that the Executive Committee and the majority\nof the Board have indicated this is satisfactory, but I believe you should all have a\nchance to indicate your disagreement®\n3® The Executive Committee probably will meet Jammy 8 and 9 in Urbana*\n4* You may re&ch Schooley, as well as Miles, on the MEB telephone® Sams numbers\n7«*66H, extension 2779* There3 s an extension of the extension in Schooley3 s office\non the second floor®\n5. The jMtmS-aanEffi-MaglSifa report is now off the press. Ion will ha sent one\ncopy* However, please do not use for public release, until all publicity releases are\non the market/\n6. The printed Ifew York surveys, of the past two years, in on the press and should be\nin the mails shortly®\n7. Dallas Smyths is headquartered in the t*m Yorker Hotel, getting set for the 1953\nTV monitoring study, January 4*10 o"
}