{
  "id": "d1043-22",
  "text": "-13-\nMINUTES\nNATIONAL ASSOCIATION OP EDUCATIONAL BROADCASTERS\nBOARD OP DIRECTORS MEETING\nBiloxi, fftssissippi, November 1 and 5, 19J>1\nAppendix B\nExcerpts from letter from Wilbur Schramm to Seymour Siegel, October 31, 195>1\n***********\nDear Sy:\nThere is a chance — I see by the weather charts — that I might not make\nit for the Board meeting Friday morning0 Therefore, I am sending this letter by\nDick Rider, who leaves in 10 minutes. If the weather is flyable by tomorrow after¬\nnoon, which is the earliest I can leave, I*11 come and you can tear up the letter.\nIf I don*t get there, 1*11 ask Hudson to represent me where necessary, and you can\nmake whatever use of the letter you wish.\nLet me say, first of all, what a thrill and a joy it is to me to see the\nproject begin to take shape around the network. I*m sure you understand my feel¬\nings on the matter, and I shan*t labor them.\nLet me say, in the second place, that Illinois will continue to try to be a\ngood host and friend to the network and the project. I think Jim will tell you\nthat he and Dick and the staff hare been treated well so far. He may or may not\nknow that this business so far has cost us about $10,000. He will know, however,\nthat we hare given the project some of our best space and remodeled it; and space\nis so precious just now that I myself will have to move out of Gregory Hall as\nsoon as ray new Air Force Research contract starts.\nIt is a matter of great regret to me that I may not be able to be present at\nyour first Board meeting with Hugh Masters. But Jim knows him now, and so does\nBob Hudson. You will find Hugh a keen and critical friend, the best kind of friend\nfor a project.\nI had four matters on ny mind which I hoped the Board would take up. These\nwere:\n1. The Program. I hope you will give Jim all the counsel you can about the\nnature of the program which is being built around the network. What kind of\nmaterials can the central office furnish you? What kind of regional meetings do\nyou want? What can we do about encouraging the making of good programs for the\nnetwork — outside of the Ford programs? We haven* t got $300,000 for the pur¬\npose, but what could we do by distributing a few thousand around the member sta¬\ntions where real ideas and talent are ready to go into programs? What can we do\nto encourage some audience studies among member stations? The project has moved\nslowly thus far because we got our director late; now it should gather momentum\nfast."
}