{
  "id": "d1043-24",
  "text": "*\n-15-\nEXCERPTS FROM BOARD OF DIRECTORS* MEETINGS\nPERTAINING TO LOWELL GRANT\nFROM THE MINUTES OF MAY 1, 2, and 3, 1951\nProbst, Siegel, Hudson, Hull, McCarty, and Wheatley of the NAEB Foundation\nCommittee reported on the progress of the Committee*s fund-raising activities* To\ndate grants had been made as follows:\nBy the Fund for Adult Education (Ford Foundation)—\n$ 90,000 to the American Council on Education on behalf of the JCET*\n$ 25,000 direct to NAEB for a series of TV monitoring studies in\nLos Angeles, Chicago, Atlanta, and New York.\n$300,000 to the Lowell Institute as Trustee for an NAEB-sponsored\nprogram development project.\n$180,000 to Iowa State College, Ames, Iowa, for experimental tel¬\nevision programs over WOI.\n$ 80,000 to WOI-TV, for television equipment. (Title to remain\nwith the Ford Foundation.)\nAfter extended discussion of the way in which the recently received Foundation\nfunds should be administered, the Board took action as follows:\nResolved that the NAEB accept the Ford Foundation grant of $25,000 for mon¬\nitoring studies, and that the President be empowered to appoint a committee to set\nthis project in operation.\nThe President set up this committee as follows: Probst, chairman; Hull;\nMcCarty; Siegel; and Wheatley.\nResolved that the Board of Directors of NAEB accept the grant of $300,000\nfrom the Fund for Adult Education (Ford Foundation) for developing educational\nprograms as specified in the memoranda acconpanying the grant as made on April 5,\n1951. (These memoranda will be issued at a later date as Appendix C to these\nminutes—Ed.) The President is to appoint a committee on the administration of\nthis Ford $300,000 grant in accordance with the terms of the grant* This special\ncommittee of the NAEB (George Probst, chairman; Richard Hull; Harold McCarty;\nSeymour Siegel; and Parker Wheatley) is authorized to plan and administer the\nprograms in the five areas outlined in the grant* The Special Committee will\nkeep the NAEB Board of Directors informed of its plans and operations, and will\nconsult the Board of Directors for suggestions, comments and criticisms of these\nplans and operations* The Special Committee will confer with the Network oper¬\nation manager on questions of educational station acceptance and distribution of\nthese educational radio programs* The Special Committee will arrange with the\nLowell Institute to provide the Board of Directors of the NAEB with continuing\nmonthly reports of the financial arrangements and expenditures of the projects."
}