{
  "id": "d1043-3",
  "text": "Mr. C. Scott Fletcher\n-2-\nJanuary 3, 1952\n3) We do not believe continuation of the $25,000.00 grant for moni¬\ntoring is necessary. The second New Tork monitoring study will be\ncompleted in the next week or eo. You have seen the Los Angeles\nstudy. The Chicago study has also been finished. Wq believe these\nstudies provide a sufficient benchmark and a satisfactorily accurate\nrecord of television content. We believe that funds for one monitor¬\ning study each year would provide a continuing check and would be\nuseful. Further projections can be made for the entire United States\nbased on printed schedules in one and two station coranunities. We\nintend to try to encourage the FCC to undertake monitoring studies\nin these areas now that the ground has been broken.\n4) We agree that there is need for the development of new kinds of\nanalysis of television programming. Wayne Coy, in a speech, asked\nthe educators to attempt to develop criteria for the assessment of\nthe good and the bad in television programs. These are difficult\nproblems, and we propose to tackle them in the beginning on a very\nsmall basis.\n5) There is great interest in the development of the combination of\nresearch studies and promotion that is reported in the diary studies\nexecuted by Professor Sandage of the University of Illinois. Copies\nof this study will reach you under separate cover. Such diary studies\nand promotion programs would bo developed at a number of NAEB member\nstations.\n6) The linking of the NAES stations by a live network arrangement\nis contemplated for the Midwest and Northeast. This has for a long\ntime been a hope of many educational broadcasters, but they have\nlacked the funds for engineering studies and trial runs to map out\nits practicability.\n7) A special project is suggestad in the area of news. This might\nbe linked with some one or more of your existing grants in other areas\nof adult education. The estimated cost of this project is very diffi¬\ncult to assess. The aim would be to present to the listeners in\nAmerica, for both educational and commercial stations, reports of the\nopinion of the leading organs of news in other countries * Very little\nof the opinion of peoples abroad reaches this country through the\nintervening sieve of high cable costs. Perhaps you saw a recent\narticle in the Saturday Review of Literature on \"Our Disappearing\nForeign Correspondents,\" which describes the paucity of news sources\nin foreign areas and the barriers this news must hurdle before it can\nfind some few inches in a newspaper in the United States.\n8) In our discussion with the director and members of the board of\nthe Joint Committee on Educational Television, we have ascertained\nthat they propose to request about $150,000.00 for next year5s opera¬\ntions. Documentation on this request will reach you under separate\ncover.\n9) The W0X-T? television program experimentation at Ames, Iowa will\nbe reported upon and a request submitted for further support."
}