{
  "id": "d1043-37",
  "text": "STATEMENT OF PROGRAM ACCEPTANCE STANDARDS\nThe following statement is intended as a guide in the selection of pro¬\ngrams for use by the Tape Network,, Obviously few programs can meet all the\nstandards listed below; some programs excellently suited for the Tape Network nay\nmeet only a few of them<>\nThe Network as now constituted is to a large ex-sent an outgrowth of the\nfirst A Her ton House Radio Seminar of I9U9? therefore,, it is fitting that the\ncommittees should accept the basic educational programing principles determined\nat that meetingo As phrased by Robert Bo Hudson, \"The Allerton seminar asserted\nthat the aims of educational broadcasting are the broad aims of education;\n\" u «,*education in a democracy has the responsibility of lifting the\nlevel of understanding and appreciation of the people, of giving\nthe individual a knowledge of himself and his society, and of the\ntensions and perplexities in each;\n*«,.9in a free society it is essential that the individual have a\ncontinuing sense of belonging and participating, of keeping up\nwith a complex and fast-moving world;\n\"o.oit is the responsibility of education to foster and further that\nfeeling of belonging and counting.\"!/\nThe committees further agree that programs chosen for the Tape Network\nshould meet certain minimum standards as to; (1) network suitability; (2)\nengineering standards; (3) audience appeal; (U) subject matter; and (5) presen¬\ntation ,\nlo Network Suitability • The pro grams distributed should be of wide¬\nspread interest and should be selected to supplement the program\nresources of individual stations,\n2. Engineering Standards,, The engineering standards of the programs\ndistributed shall conform to the standards di^awn up by the NAE®\nTape Network Engineering Advisory Committee.\n3o Audience Appeal* The programs should attract and hold their\nintended audieaces *\nUo Subject Matter, The programs - again in Hudson's words - should be\n\"distinguished by. „ .high concern for integrity in the selection...\nof materials, and by*.oconsistent dedi.cation to social purpose.\"\nSubject matter chosen should have the effect of;\n\"(1) informing,\n\"(2) stimulating the individual to organize and give meaning to\ninformation,\nITltoSirFBo Hudson, \"Allerton House 19h9, 1950\", Hollywood Quarterly, VoX« V,\n~ Noo 3, p° 239o"
}