{
  "id": "d1043-4",
  "text": "Mr* C„ Scott Fletcher\n-3“\nternary 3, 1952\n10) We feel that the case for establishing the journal of radio-\ntelevision education materials in this country is worth the most\ncareful consideration. In the past, there have been a large number\nof small attempts to publicize the findings and the ideas of the\npeople at work in this field, but none of these previous publication\nefforts have been able to serve what we hope is a growing profession\nin the way that is needed. At the present time, the NAEB publishes\na monthly Newsletter, but this is a very informal and transitory\ntype of publication project. Here it is v?orth noting that one of\nthe possibilities which needs exploration is the examination of\npossible relations with the new journal to be published by the\nNational Adult Education Association*\nAll of the above items will be documented and specified at a later time*\nHowever, there remain some general problems that are unsolved by these\nproposals and which involve specifying on a large scale sums of money\nwhich may or may not be realistic. These problems ares the need for a\ncouple of central television educational programming centers; the investi¬\ngation of possible cooperation with Zenith to experiment in subscription\neducational television, perhaps in Chicago, where Zenith already has\nthe transmitter and is able to operate on channel 2; and the need for\nbuilding up interest on the part of a large number of individuals, founda¬\ntions, state legislatures, etc*, in creating a very large participation\nby education in using the television channels which the FCC proposes to\nallocate* On January 7 in St* Louis a large na.t5.onal meeting ia taking\nplace in an effort to plan the development of a network educational tele¬\nvision programming service* The committee wishes to urge the Fund for\nAdult Education to investigate this particular project and to think\nthrough the problems of providing leadership so that other foundations\nmay become interested in educational television.\nI should be pleased to answer any queries you may have about these var¬\nious projects. I look forward to the opportunity of seeing you in the\nnear future to discuss them with you. I hope you would be interested and\nwill find it possible to meet with our entire committee eooru We are\navailable at your convenience-\nVery sincerely yours.\nGeorge E. Probst\nGEPsPH\nEnclosure"
}