{
  "id": "d1043-41",
  "text": "1.\nRECOMMENDATIONS OF THE NAEB NETWORK ACCEPTANCE COMMITTEE AND THE IN-SCHOGL\nPROGRAM COMMITTEE ON SPECIFIC METHODS OF IMPLEMENTING BASIC RECOMMENDATIONS\nON PURPOSES AND PROGRAM ACCEPTANCE STANDARDS\nlo Methods of determining programming needs.\na* Polling of member stations. . (Recommended that this be done,,)\nb* Recommendations of committee members*\nCo Securing the recommendations of subject matter experts.\nde Recommendations of NAEB officers and headquarters staff.\n2o Specific methods of selecting programs for network offering*\na= General programs®\n(1) The NAEB Network Acceptance Committee will meet at the call of the\nchairman in consultation with the headquarters staff. The headquarters\noffice can request a meeting of the committee« Apart from such meetings\nas may be called the committee will continue to be a consultative body\nfor the headquarters staff*\n(2) Network headquarters will compose offering schedules in accord with the\nfollowing:\n(a) Headquarters will normally select the programs to be distributed.\n(b) It will refer to the members of the coal nit tee all programs of a\ndoubtful nature, or which involve points of network policy, or for\nwhich it desires the weight of committee support for its decisions,\n(c) It will inform the committee members in advance what programs it\nintends to offer.\n(d) Committee members reserve the right to request an opportunity to\naudition any program.\n(e) Committee members will continue to make whatever recommendations\nthey desire to the network staff*\n(f) Network headquarters will endeavor to make arrangements which will\nenable it to offer the bulk of network programs at least three\nmonths in advance. This is not intended to exclude such programs\nas must be handled on a more immediate basis®\nbo In-Schcol programs*\n(1) It is the recommendation of the in-school committee that it meet semi¬\nannually. These meetings to take place the two days preceding the Ohio\nState Institute and the two days preceding the annual NAEB Convention*\n(2) All in-school programs will be selected by the in-school committee at\nthe meetings delineated in (1)®"
}