{
  "id": "d1043-48",
  "text": "STATEMENT OP PROGRAM ACCEPTANCE STANDARDS\nThe following statement is intended as a guide in the selection\nof programs for use by the Tape Network® Obviously few programs can\nmeet all the standards listed below; some programs excellently suited\nfor the Tape Network may meet only a few of themo\nThe Network as now constituted is to a large extent an outgrowth\nof the first Allerton House Radio Seminar of 19ij.9; therefore it is\nfitting that the committees should accept the basic educational\nprogramming principles determined at that meeting® As phrased by\nRobert Bo Hudson* ”The Allerton seminar asserted that the aims of\neducational broadcasting are the broad aims of educations\n”••.education in a democracy has the responsibility of\nlifting the level of understanding and appreciation of\nthe people* of giving the individual a knowledge of him«\nself and his society* and of the tensions and perplexities\nin each;\n\"o..in a free society it is essential that the individual\nhave a continuing sense of belonging and participating* of\nkeeping up with a complex and fast “-moving world;\nnea»it is the responsibility of education to foster and\nfurther that feeling of belonging and counting.ni/\nThe committees further agree that programs chosen for the Tape\nNetwork should meet certain minimum standards as to: (1) network\nsuitability; (2) engineering standards; (3) audience appeal;\n(4) subject matter; and (5) presentation.\n1. Network Suitability. The programs distributed should\nbe of widespread interest and should be selected to\nsupplement the program resources of individual stations®\n2. Engineering Standards. The engineering standards of the\nprograms distributed shall conform to the standards\ndrawn up by the NAEB Tape Network Engineering Advisory\nCommittee.\n3® Audience Appeal® The programs should attract and hold\ntheir intended audiences.\nSubject Matter. The programs - again in Hudson’s words *\nshould be \"distinguished by...high concern for integrity\nin the selection.•.of materials, and by.•.consistent\ndedication to social purpose.” Subject matter chosen\nshould have the effect of?\n”(1) informing*\n”(2) stimulating the individual to organise and give\nmeaning to information*\ni/ Robert B« Hudson* \"Allerton House 19^9* 1950”, Hollywood Quarterly.\nVol. V, No® 3* P» 239o ---- -*"
}