{
  "id": "d1043-68",
  "text": "EXHIBIT IV\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nREGION V HEADQUARTERS NORMAN, OKLAHOMA\nTO ______ DATE February 23, 1952\nFROM John W, Dunn, Director__ SUBJECT Regional Conference__\nThere's good news today for all Active and Associate Members of NAEB in Region VI\nThe Executive Committee of NAEB has given final and complete approval of the\nConference for Region V to be held in Norman on March 28, 29, 30,\nThe Executive Committee has asked that the conference be set up for\nthree days instead of the two as originally planned, So, the opening\nsession will be scheduled for Friday morning at 10:00 a,m. and the\nclosing session will be over by 3:00 p,m, on Sunday,\nThe place of the conference, as stated previously, will be the University of Oklahoma,\nNorman, All sessions will be held in the Oklahoma Memorial Union Building on the Main\nCampus,\nThe top brass of NAEB will be here for all three days of the conference and will be\navailable for all meetings. The group will incldds: Seymour Siegel, WNYC, NAEB Presi¬\ndent; Oraydon Ausmus, WUOA, Vice President; Burton Paulu, KUQK, Secretary and News\nLetter Editor; Frank Schooley; WILL, Treasurer; Jim Miles, NAEB Headquarters, Eke-\ncutive Director of NAEB,\nDON’T FORGET l NAEB Headquarters will reimburse the representative from each ACTIVE\nMEMBER INSTITUTION for the following items:\n1st Class rail transportation and Pullman to and from Norman, Oklahoma\n2, Meals en route to Norman\n3o Hotel and meals while in Norman attending the conference\nPLEASE NOTE: In order to encourage attendance, the Executive Committee has\nauthorized the following: the price of 1st class transportation and\nPullman to and froir. Norman may be applied on automobile transportation\nto and from Norman, If this is done NAEB will pay hotel and meals for\nTWO representatives from each ACTIVE MEMBER INSTITUTION while in Norman\nfor the conference,\nALL Active Members have indicated that they will be free to come for the Con¬\nference, A little later we will ask each of you to indicate which of the two\nplans you will follow. Tax Exemption certificates will be issued those of you\ntravelling by rail.\nSince this is the first time in the history of NAEB that a regional conference has\never been held and since National Headquarters is spending a considerable sum of\nmoney on the conference, we MUST make the program the best possible. The conference\nis for YOU, We'll discuss those things which YOU want discussed.\nTherefore, we need to have from YCU a list of topics which you think are important\nand should be a part of the program, DON’T DELAY l We must have your ideas by\nMarch 1st at the latest."
}