{
  "id": "d1043-70",
  "text": "EXHIBIT V—B\nTRAVEL..•HOTEL...MEALS INFORMATION\nALL SESSIONS OF THE NAEB REGION V CONFERENCE 'CELL BE HELD IN THE OKLAHOMA MEMORIAL\nUNION BUILDING ON THE MAIN CAL'PUS OF THE UNIVERSITY CF OKLAHOMA. NORMAN\n_NORMAN. OKLAHOMA IS LOCATED APPROXIMATELY IQ MILES SOUTH OF OKLAHOMA CITY\n■IL YQU AH^COMINQ BY RAIL.. .NORMAN is on the Chicago-Galveston main line of the Santa\nFe with 3 trains daily each way — north and south. Some of you may find it more\nexpedient to come to Oklahoma City on the FRISCO, ROCK ISLAND or M K ft T. Con¬\nnections at Oklahoma City for Norman by rail are not always convenient. There\nare busses every hour from (klahoma City to Norman, but if you so desire, we\nwill be glad to meet you in Oklahoma City.\n—ISM-epyiNG BY AUTO...NORMAN is located on U.S. Highway 77. (U.S. 66 intersects\ny at Oklahoma City). Follow U.S. 77 into Norman. If you are traveling south,\nturn RIGHT at the FOURTH traffic signal; if you are traveling north, turn LEFT\ntrafflc ttgtoo After making turn, proceed on BOYD STREET to the\nSEC AD traffic signal. Turn left here on ASP STREET. The Oklahoma Memorial\nUnion Building is the SECOND building on your right.\n^jhbhhhhhh**** *****\n^ COKINOBY AIR.. .Braniff. American, Continental ft Central Air Lines all\nhave flights into Oklahoma City, using Vail Rogers Air Port which is located\nsome distance from Oklahoma City. If you plan to come by air, it will be more\nconvenient for us to meet you at the air port rather than in downtown Oklahoma\nCity. Private planes may land and find accomodations at the University »s own\nair port in Norman.\naccomodations may be had at the Extension Study Center on the North Campus\nof jhe nlversity. Reservations have already been made to house all of the delegates\nvery comfortabiy. Two people will be assigned to a room, but all rooms are commodious\n* 4.u « fh „ with beds. The price par person per night is 51.75. Transportation\nto the Main Campus will be furnished, cars leaving at stated intervals.\nNOTE: Tour hotel bill will be paid by NAEB You will NOT have to pay for your hotel\naccomodations but you will have to register at the Extension Study Center.\nrHHHHWHBHHHHHHHHrtHHHH* *\nFor those arriving early, luncheon and dinner on the 29th may be had in the Union's\nbeautiful KINO ROOM at reasonable prices. Breakfast cn the 28th, in Will Rogers Cafe-\nteria. All other meals on the 28th, 29th and 30th will be group affairs and will be\nserved in private dining rooms of the Union.\nSchedule of prices as follows for group meals: Breakfast, $1.25; Luncheon, $2.00;\nDinner, $3°00; tentative reservations have already been made for all group meals.\nNOTE:You will not have to pay for ary of the group meals while in attendance at the\nConference. NAEB Headquarters will pay for all of the meals of the official dele-\ngates from Associate members.\nHeadquarters will be billed by the Extension Study Center and the Oklahoma Memorial\nUnion for all services rendered to official delegates in the way of sleeping accom-\nodations and group meal3$"
}