{
  "id": "d1043-77",
  "text": "2.\nSATURDAY, MARCH 29th\n8:30 a.m. — 9:30 a.m. BREAKFAST SESSION, Dining Rooms 2 and 3 UNION. No formal\nprogram. It is suggested that delegates eat in four general\ngroups: (l) Public School Stations; (2) University and\nCollege M Stations; (3) University and College AM Stations;\n(4) Associate Members.\n10:00 a.m.- 12:00 noon MORNING SESSION, Room 165 UNION. President Seymour Siegel,\npresiding. General Theme: Information, Please I\nRESOURCE PANEL: T. D. Rishworth, Radio House, University\nof Texas; Marguerite Fleming, KSLH; R. Edwin Browne, KFKU;\nJim Randolph, KWGS.\nSiegel, Schooley, Ausmus, Paulu and Miles available for\ncomment.\nTopics selected from those previously submitted by regional\nmembers will form the basis of this two hour session.\n12:15 p.m. - 1:45 p.m. LUNCHEON SESSION, Ming Room UNION. Secretary Burton Paulu,\nKUOM, presiding.\n1:00—1:40 \"The Educational Broadcaster Reports the News\" - Ken Miller,\nNews Editor, Radio Station KVOO, Tulsa\n2:00 p.m. — 5:00 p.m. AFTERNOON SESSION, Room 165 UNION. Vice President Graydon\nAusmus, WUOA, presiding. General Theme: We Evaluate Our\nOperations.\nThis is a session in which ACTIVE and ASSOCIATE members will\nevaluate their operations—a very critical self-analysis\nboth from the view point of what is good, what is bad, and\nwhat they might wish to do. TEN MINUTES alloted each member.\nIt is highly important that the statements be prepared in\nwriting BEFORE the member comes to Norman so that they can\nbe submitted to the presiding officer AFTER the member\nreports,\n6:30 p.m. — 8:30 p.m. DINNER SESSION, Dining Rooms 2 and 3 UNION. Regional Direc¬\ntor John W. Dunn, presiding\n7:30—8:15 \"America1s Role in the Far East\" - Dr. Percy W. Buchanan,\nDirector of the Institute of Asiastic Affairs, University\nof Oklahoma.\n8:30 p.m. - 10:00 p.m. EVENING SESSION, Room 165 UNION. Treasurer Frank Schooley,\nWILL, presiding. General Theme: This Thing Called Educa¬\ntional Televl don.\nRESOURCE PANEL and DISCUSSION LEADERS: Burton Paulu, KUOM\nand Graydon Ausmus, WUOA."
}