{
  "id": "d1043-8",
  "text": "NAEB HEADQUARTERS\n119 Gregory Hall\nUrbana Illinois\nJanuary 11, 1952\nTO ALL MEMBERS OF THE NAEB BOARD OF DIRECTORS:\nyou have by this time received a wire from President Siegel requesting your attendance\nin New York next weekend. I thought you would like to know from me at this time some of /\nthe areas which need to be discussed and on which policy needs to be set. I have not yet\nhad time to work on alternative problems and arguments regarding these matters but I will\ndo so in the next few days and will either send them to you or have them with me when you\ncome to New York.\nRegarding the NAEB Tape Network, the Board should determine:\n1. whether the \"package” arrangement should be continued, or whether more spot\ncoverage should be attenpted. Tied in directly with this is the determination of whetEer\nwe are actually operating a \"network” or whether it should be a \"program service\";\n2. who approves the program offerings on the Network and the balance of those\nprograms, and name a committee with specific obligations;\n3. the policy regarding the amount of money to be paid to stations who originate\nprograms for Network offerings;\nU. the policy regarding in-school program offerings by the Network;\n5o the policy regarding who shall determine what is kept in a master file and\nhow long; and\n6. make solicit policy regarding the responsibility of the Executive Director\nfor the Tape Network *\nRegarding the Headquarters operation, the Board should determine:\n1. what portion of former operations done on NAEB funds should now be done under\nthe Kellogg Grant;\n2. the policy regarding the Executive Director’s plan to visit as many stations\nas possible and the limitations thereon; and\n3* the policy regarding the \"policy letter\" or other ooirmuniques from Headquarters.\nAs regards the project, the Board should determine:\n1. whether cr not there is to be a Planning Group or Committee of Committees;\n2. if the Board is to be itself the Planning group, approve or amend the Working\nCommittees named by Miles;\n3« policy regarding the make-up of these commit teas, whether they can be regionally\ncentered or must have a national flavor; and\nb. the priority of these areas and set a goal on how many should be done this year.\nIt is my idea to present in as much detail as possible a working plan for the Network\nHeadquarters and project operations with several alternatives and with all the urging in\nny being, to work fbr definite policy determination on these matters.\nI am in no way trying to set the agenda, which is the President’s prerogative. These\nare, however, the areas which we here at Headquarters feel need action. I sincerely urge\nthe President to include all of thou in our meeting.\nJim Miles"
}