{
  "id": "d1043-83",
  "text": "(1) its policy,\n(2) its personnel:\nmanagement—their qualifications, status\nin the institution, relation to top ad¬\nministration and the faculty;\nother personnel—their qualifications,\nmethods of recruitment, standards and\nincentives in employment,\n(3) its facilities,\n(4) its audience (in relation to the analysis\nof the community and of the institution’s\npolicy),\n(3) its program: analysis of the program struc¬\nture and evaluation of its effects in re¬\nlation to the community and institutional\nsetting.\nLogistics:\nStudy personnel. Select a distinguished educator\nin the communications area.\n. . . JM&et, Appropriate $13,000 for his use in con¬\nducting the twin studies; out of this sura he should pay ordinary\nstenographic costs and for publication of a report on the study.\n, . Explanation. This is the \"grand design\" study of\nthe station-in-its-setting. The principle value need not lie\"in\nthe fact of having a report published. Rather the large value of\nit is in the establishment of a prote—type of how to determine and\nimplement an appropriate radio policy for an institution. The\nrecognition by all concerned of the administrative implications of\nthe study is perhaps the most important result. In 1932-53 the\nmaker of these studies will have the advantage of the concurrent\nstudy of university extension work about which I reported to you\nin my memorandum on my conversations with Mr. Morton of Alabama\nlast week. Were it not for the fact c£ this other study being\ndone, the budget for the instant proposal would be substantially\nhigher.\nWhere and who. The above proposal should be con¬\nsidered in principle without reference to who would conduct it or\nwhere it diould be done. For what they are worth here are my\nthoughts on these questions, I would recommend that irofessor Charles\nSiepraann be invited tx> conduct the studies. It would seem to me\nthere was a wide field cf choice as to where the studies should be\ndone. I would think ?t unwise to select institutions thought"
}