{
  "id": "d1043-86",
  "text": "WILL, BOB, FRANK AND DICK:\nI have just completed an hour’s conversation with L. 8. Toogood. I\nam more convinced than ever that he is perhaps the smartest man in the tape\nfield today. He speaks from a wealth of experience — and from the practical\noperating point of having to make money. No one has ever said a bad word for\nhim — they agree to his eccentricities, but they also agree to his general\nknowledge and excellence.\n(p\nu\n/r^\nI say all of the above, because he has just given me very convincing\narguments why the majority of the proposed standards arrived at by the NAEB\nEngineering group are absolutely wrong. I could elaborate on them, but I won't\nat this time.\nThe question, as usual, is who do we believe? We'll all admit that\nve had the best engineering brains in our group to work on the problem. They\narrived at certain conclusions. They went further than a comparable KARTB\ngroup went when they worked on the problem several years ago. We don't know\nwhy the NARTB group stopped. Was there Just a lack of need? I've always\nthought so, but now I'm not so sure.\nThe tape problem in general, and the tape duplicating problem in par¬\nticular, seen to be perfectly analagous to the TV problem. TV is compared to\nmovies — tape to disc recordings. The ultimate consumer doesn't care how he\ngets the show, so long as it is good. TV was forced to do many things before\nit was ready — certainly the same can be said of tape.\nThere is a vast difference between the controlled laboratory problem\n— the production problem — and the everyday use problem. Each step takes\nabout so long. The process has perhaps been hurried too much in the case of\n^ both TV and Tape recording.\nThe one big immediate difference with the engineering groups* plans\nand Toogood's recommendation hinges around the Ampex’s. The engineering group\nlooked upon this as the first step in assuring good masters from which good\nduplicates could be made. Toogood says this Is wrong on two counts. (1) The\nAmpex head cannot easily be realigned. Thus, if a bad master is received from\nthe originating station, there is little we can do with the Aapexs' to make it\nsound better. Then, too, the Aapexs have their own peculiar tape problems\nthat cannot be compensated for on other machines. Inasmuch as we have about\n80-90jt Magnecord users on the network — this Is a very real problem. (2)\nWe're putting the cart before the horse. We should first have a machine which\ncan produce exact copies, be they good or bad. Next we should try to improve\nthe originals. As it is, we're working the other way around.\nThis, of course, provides the great dilemma. If we approve of Too-\ngood's ideas on the Ampex's, we may saft$^,000.00 — but we must repudiate"
}