{
  "id": "d1043-97",
  "text": "NAEB HEADQUARTERS\nVw/\nUl9 David Kinley Hall\nMarch 19, 1952\nMr0 J. H. Morton, Director\nNational Stucjy of University Extension\nP® 0® Box 2787\nUniversity, Alabama\nDear Mr. Morton:\nAs I promised in my letter of March 12 to present you with at least a draft of the\nradio section of the NUEA study by March 20, I am enclosing our first effort in this\ndirection® While I must assume responsibility for the contents of this draft, it\ndoes incline recommendations by Executive Director Jim Miles® The present status of\nthis draft is that I mailed it on March lU to the NAEB Special Committee appointed\nto work with the NUEA (Ausmus and Paulu), to the Research Committee, and to the\nofficers of the NAEB® In transinitting this draft to those men, I warned them that\nyour tii©table was such that I would need to send you a draft with whatever amendments\nwere in rny hands by March 19 o\nI give you this detailed background so that you may be prepared for whatever comments\nI may transmit to you next week® The Executive Committee of the NAEB will be meeting\nin Norman, Oklahoma, March 27, and I hope that final action may be taken on this\nproposed draft of the questionnaire at that time®\nW I don*t know whether you propose to prepare a separate set of instructions for the\nuse of respondents in filling out the whole questionnaire® If you do, there prob®\nably are some terras in the radio section which should be defined or explained in\nsuch instructions® For example, question UO refers to “subject matter or professional\nareas•“ Probably we should define this so that answers are uniformly obtained in\nten© of the disciplines or the departments in the institutions, whichever concept\nis uniformly adopted for the whole survey® It may also be desirable to make raore^g*\nclear at the beginning of the radio section the meaning attached to the phrase, “ia-st\nradio or TV activr 1 which is repeatedly used in the questions®\nI tried to draft a questionnaire most of the questions in which could be answered\neither for a radio station operation or a program producing center operation® I\nhope that it is clear that the respondent should identify which of these two operas\ntions is covered by a given questionnaire on the first page® I have also segregated\ncertain groups of questions^;ich it is desired to have both types of operation\nanswer and a group of questions designed only for station operations® Section VI\ndeals with facilities questions comnon to both types of operation® This is the\nsection which covers questions 61 through 76® The next section (which was inadvertent®\nly also numbered Section VI) which covers questions 77 through 89 refers only to\nstation operations® All the other sections are intended to apply to both types of\noperation® Maybe this is all clear enough from the wording of the draft, but it\nmay present a problem®\nI will be out of the city from March 20 to March 23, but when I return to the office\non March 2hp I will gather up and transmit all subsequent comments which have come\n■ in from NAEB people0\nVery sincerely yours.\nDallas W. Smythe\nDirector of Studies"
}