{
  "id": "d1385-9",
  "text": "Page 8\nNational Broadcast Reporter\nSymposium of Views of Agencies On\nRadio Advertising*\nBy J. L. Killeen\nFitzgerald Advertising Agency, Inc.\nWe are convinced that the present\nAmerican method of handling radio\nbroadcasting is the best. It is in accord\nwith American traditions of freedom.\nWe are absolutely against complete gov¬\nernment regulation of programs. We\nare certain the American people will not\nstand for the government’s picking out\ntheir entertainment and educational fea¬\ntures over the air.\nIn other words, we do not see how\nthe air is any different from the news¬\npaper. The government should not have\nthe right to appoint bureaus to prepare\nradio programs any more than it should\nhave the right to print every newspaper\nin the country.\nWe believe that the present tre¬\nmendous increase in radio set owner¬\nship, hand in hand with broadcast ad¬\nvertising, proves that the American peo¬\nple are fairly well satisfied with radio\nas it is. Increased set ownership, of\ncourse, means that a great many Ameri¬\ncan workmen earn money in building\nand selling these sets.\nThere are a fair number of unspon¬\nsored or sustaining programs on the air\nfor those people who do not care to\nlisten to advertising. We believe that\nthe success of the big broadcasting com¬\npanies depends on their popularity with\nlisteners, and, therefore, they can be\ndepended upon to handle their output\nso that they will please the great major¬\nity of people.\nNothing about broadcasting compels\nan American citizen either to own a\nradio set or to listen to any individual\nprogram. He is at liberty to do as he\npleases about it. With one turn of the\ndial, he can go away from a station or\nprogram which he does not like.\nWe do not wish to. convey the idea\nthat we think present radio advertising\nis perfect. -Some of it is annoying. But\nhere, again, the advertiser’s success de¬\npends absolutely on how he pleases the\npublic, and time will cure a lot of bad\nadvertising.\nIn addition to this, the broadcasting\ncompanies, the advertising agencies, and\nthe individual stations are learning\nevery day about how to make their pro¬\ngrams more interesting and attractive\nand their commercial messages more\npalatable.\nTo sum up—we are firmly convinced\nthat there should be no government\n*Taken from letters written to the Federal Radio\nCommission by agencies in connection with the\nproposal to limit radio advertising to mention of\nthe name of the sponsor.\nownership or operation of radio broad¬\ncasting, and that the best interest of the\nAmerican public would be violated by\nsuch a procedure.\nBy C. F. Gannon\nErwin, Wasey & Company, Inc.\nSpecifically I do not think it prac¬\nticable and satisfactory, or even possible,\nto permit only the announcement of\nsponsorship of programs by persons or\ncorporations and still maintain our\npresent structure of broadcasting. My\nbelief is that any curtailment or restric¬\ntion of the advertising phase of radio\nprograms would immediately paralyze\nthe industry.\nOur agency enjoys one of the largest\nvolumes of broadcasting business. In\nthe event of legislative restriction, this\nbusiness would immediately transfer to\nother advertising media or would dis¬\nsolve entirely with extensive loss to the\nadvertisers themselves, to radio net¬\nworks, and to individual stations.\nThere is no question that there have\nbeen, and perhaps are, radio programs\nwith excessive commercial conversation.\nThey have not been numerous, how¬\never, and are likely to have occurred, I\nbelieve, more often on the small sta¬\ntions than on the national networks or\nthe better class stations. There is no\nexisting yardstick that can be applied\nto the percentage of advertising in any\none broadcast. It is essentially a matter\nof technique and craft. The craft is new\nand has the natural deficiencies of a\ngrowing art; so have the motion pic¬\ntures and the publishing field at large,\nboth considerably older. The first objec¬\ntive of any sane sponsor is to attract\nthe largest possible number of listeners\nand leave them more pleased than he\nfound them. Failing this, his campaign\nbecomes unprofitable and soon ter¬\nminates.\nThe average sponsor is neither in¬\nterested nor attracted by the possibility\nof a bare mention of his product, nor\ndo I think the American radio audience\ndesires this. The millions upon millions\nof letters from the radio audience would\nindicate a satisfied state of mind. We\nare perfectly aware that there are a num¬\nber of listeners who have registered\nobjections. We believe, however, that\nthese people belong to a class known\nas \"ready letter writers.” It is also\nobvious that there has been considerable\npropaganda against radio emanating\nfrom competitive interests.\nIn brief, I believe the best programs\nthat money and genius can develop con¬\nstitute the structure of sponsored broad¬\ncasting, which is per se the best broad¬\ncasting today. The fact that radio has\nproved itself a successful selling adver¬\ntising medium should be something to\nrejoice over in this year of our Lord.\nBy Stanley J. Ehlinger\nEhlinger & Higgs, Inc.\nFirst we must take into consideration\nthat radio broadcasting, as we know it\ntoday, has been made possible only be¬\ncause of the fact that national adver¬\ntisers have seen in it sales possibilities\nand have therefore made it a part of\ntheir advertising program. The high\nclass of the radio programs on the air\ntoday is due entirely to the sponsorship\nof advertising, just as we owe to the\nsame factor the present high state of\ndevelopment of newspapers and maga¬\nzines.\nIf you eliminate advertising from the\nair, you do one of two things. You\neither entirely eliminate radio or you\nput it under government supervision\nand tax the listener for the program,\nand what do you have? You can look\nto Europe today and see the type of\nprograms there.\nIt is true that many advertising pro¬\ngrams on the air contain too much sales\ntalk, but this is a natural fault in the\ndevelopment of something new, and\ncan gradually be eliminated. But if you\ntake radio and put it under rigid gov¬\nernment supervision, limiting the adver¬\ntiser in the handling of his programs,\nyou destroy the function of radio as a\nsales builder and you eliminate any rea¬\nson why the national advertiser should\nuse radio. You cannot expect the adver¬\ntisers of America to spend millions of\ndollars for radio programs which will\nbe limited to five or six words such as\n\"This program has been sponsored by\nGeneral Electric.” Such a line would\nmean little compared with advertising in\nmagazines and newspapers where a sales\nstory can be told. In today’s radio pro¬\ngram, if the listener is dissatisfied with\nlong sales talks all that it is necessary for\nhim to do is switch the dial to another\nprogram. In a magazine or newspaper,\nif he does not care to read the particular\nad, all he has to do is turn the page. The\nrelation is obvious. It is the listener, as\nwell as the reader, who is getting his\ndollar’s worth at only a percentage of\nwhat the dollar’s worth costs. It is up to\nthe advertiser to make his program so\nattractive that it appeals to the listener\n(Continued on page 22)"
}