{
  "id": "d1403-0",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nBULLETIN\nIowa City, Iowa October 18, 1935\n(Mailod at Iowa City, Iowa)\nPresident: H. B. McCarty, University of Wisconsin,\nVice-President: V/. I. Griffith, Iowa State College,\nSecretary-Treasurer: B. B. Brackett, University of South Dakota.\nExecutive Secretary: Harold Engel, University of Wisconsin.\nGreetings to Old Members, New Members, and Prospective Members of the NAEB:-\nWe are in hopes that this first bulletin of the year 1935-1936 may be of ser¬\nvice to you. A oopy of the constitution and by-laws of our Association is enclosed.\nYou will note that not only the educational institutions that operate their own\nbroadcasting stations are eligible to membership, but that educational institutions\nthat are doing any broadcasting over commercial stations are admitted to full mem¬\nbership with all rights and privileges. We hope to be able to serve you and we\nknow that you can serve us if you will supply us with your comment, news items\nand constructive suggestions. This bulletin will doubtless reach a number of or¬\nganizations and friends who are interested in various phases of educational pro¬\ngrams. These individuals or groups are eligible to an associate membership in the\nNAEB. We urge you to use the blank that you will find on the last page of the\nbulletin.\nOur President, H. B. McCarty, Director of Station WHA, Madison, Wisconsin,\nis in Europe making a study of radio as it is used for educational purposes. When\nhe returns he will be able to make a valuable contribution to our member stations.\nWe should like to have a large list of active and association members by the time\nthat he returns. We are sure that this is going to be the best year that the As¬\nsociation has ever had if we may enlist the cooperation of all who are interested\nin any phase of the art of educational broadcasting.\nRespectfully submitted,\nW. I. Griffith, Vice-President, NAEB\n#\nOf interest to NAEB members was the annual meeting held at the State Univer¬\nsity of Iowa on September 9 and 10. The meeting was held in the Iowa Memorial\nUnion, and opened with an address of welcome by Dean Kay, speaking for President\nGilmore who was out of the city. A highlight of the convention was a dinner held\nin the River Room of Iowa Union, with Dr. Bruoe E. Mahan acting as toastmaster,\nand the broadcasting by WSUI of President Crane*s address. The convention program\nincluded a number of interesting talks, many of which are to be available soon in\nmimeographed form from the National Committee on Education by Radio. For this\nreason no attempt will be made in this bulletin to supply notes on the formal ad¬\ndresses."
}