{
  "id": "d1403-12",
  "text": "-6-\nin a fight, precipitated here in which the University of Minnesota, Carleton college\nand St. Olaf college, the latter two at Northfield, are pitted against WRHM a com-\nmercial station at Minneapolis*\n\"The educational institutions share the same channel with WRHM and complain that for\npurpose of education, they are barred from the air because YflRHM takes up all of the\ntime in broadcasting commercial advertising.\n\"The educational institutions desire the federal radio commission to assign WRHM to\nanother channel and give them the full time now shared by the three institutions with\nthe commercial station.\n\"The matter has been presented to the radio commission by Representative-C. G. Selvig\nof the ninth Minnesota district, formerly head of the Crookston experimental station^\n\"Outlining the situtation and asking for the readjustment in the name of education\nin a letter to General Charles McK. Saltzman, chairman of the federal radio commission\nRepresentative Selvig says: ’Dear General Saltzman* A short time ago I received a\nletter from the comptroller of the University of Minnesota, in regard to the radio\nbroadcasting situation at the university. He asked me to take this matter up with\nyou in case I felt that the petition of the University of Minnesota, at Minneapolis,\nCarleton college and St. Olaf college of Northfield, Minn., was just and should be\ngranted.\n\">As you are no doubt aware, the University of Minnesota station, WLB, shares the\nbroadcasting channel with Carleton college and St. Olaf college. With these three\neducational stations is joined a commercial station in Minneapolis with the call\nletters WRHM.\n\"’The three educational stations have always been able to agree as to the apportion¬\nment of time. They are now broadcasting about 20 hours a week while ViRHM broadcasts\n104. You will understand that a commercial station that has sold its time will broad¬\ncast anything’to fill that time. The educational institutions, if they have nothing\nworthy to say, keep silent at their hour. For years they have suffered constant en¬\ncroachment from this commercial station and are now pinned down so that they hove no\nelbow room for the development of their trulv educational program.\n\"’Therefore the three educational stations have united in petitioning the federal\nradio commission to assign to them the full time of this channel, which means that\nthey will have to occupy 72 hours a week. They are agreed to do this provided the\nstation WRHM may be put off this channel and onto another channel. WRHM accuses\nWLB of not making full use of its time. This is obviously impossible under the pres¬\nent conditions because when anything worth while comes up to broadcast it is found\nthat there is not time in which to do it, as WRHM has already sold that time to an\nadvertiser. The University of Minnesota, St. Olaf and Carleton college officials\nbelieve that they can fill the full 72 hours, provided the radio commission will grant\neducation its rights on the air.’\",\nFROM DR. B. B. BRACKETT, DIRECTOR OF RADIO STATION KUSD, UNIVERSITY OF SOUTH DAKOTA,\nVERMILLION, DATED FEBRUARY 2s \"I do not see how anyone could express a condition\nnow existing more accurately and more forecfully than Professor Harding does when he\nsays, ’These men (the Federal Radio Commission) .merely cut off the arms,\nlegs and head of an educational station and then allow it to die a natural death.*\nThey do not kill itl Oh nol If it cannot survive under all the restrictions imposed\nwhen placed next to a 50,000 watt station that is classified as a 5000 watt station\nand given all other possible advantages then the educational station ought to die,\njust as a kitten that is thrown under the feet of an elephant ought to die, if it\ncannot avoid being trampled'to death.\n\"The broadcasting chains with their millions of investment and millions of profits\nare certainly using all possible means to pet every broadcasting privilege and ad¬\nvantage ... for it is not at all probable that their present r.x or cot— n:r f:*.- ■ . i"
}