{
  "id": "d1403-2",
  "text": "(b) Individuals of faculties of recognized institutions -who are interested in\neducational broadcasting may become associate members of this association by ap¬\nproval of the executive committee, and a two-thirds affirmative vote of all active\nmembers of the association. Associate members shall have all of the privileges\nof active membership, except that they shall not be permitted to vote or to hold\noffice.\n(o) Any experimental or amateur station, owned and operated by a recognized\neducational institution, may be elected to associate membership.\nARTICLE II.\nDues s\nThe annual dues or registration fees of active members shall be $10, payable\nJanuary 1 of each year. Dues of associate members shall be $2.50, payble January 1\nof each year.\nARTICLE III.\nOfficers:\nThe officers shall be a president, vice-president, secretary-treasurer, and\nsix additional executive committeemen. One committeeman shall be selected from\neach of the five radio zones in the United States, and one shall be a member-at-\nlarge, for a period of one year. These officers shall be elected by a majority\nvote of the active members present at the annual business meeting, which shall be\nheld at a time and place designated by the Executive Committee.\nThe Executive Committee is empowered to select an executive secretary, whose\nduties shall be defined by the Committee.\nARTICLE IV.\nDuties of Officers:\nThe duties of the officers shall be those usually pertaining to such offices,\nand such additional duties as are outlined in the by-laws.\nARTICLE V.\nQuorum:\nfa) A majority of the Executive Committee shall constitute a quorum, thereof,\n(b) A majority of the active members in good standing shall constitute a quo¬\nrum at the annual meeting, or at such special meetings as may be called by the\nExecutive Committee,\n(o) Active members may vote by proxy, provided there is not a quorum present.\nIt shall be the duty of the Executive Committee to allot the number of proxies to\nthe respective districts in such a manner as to constitute a quorum.\nARTICLE VI.\nBy-lawsi\n\" r T^he by-laws of this association may be adopted and amended by a majority vote\nof the Executive Committee."
}