{
  "id": "d1403-5",
  "text": ",6~\n”Our broadcasting opens the night of October 1, and our initial program is to\nbe a two hour one combining all the talent the University affords at this early\ndate.\n\"We do have a new three mike remote pick-up (portable) whioh is something bet¬\nter than we have ever had here and which should provide ample facility for picking up\nour most difficult remote programs.”\n#\nS, W# Jones of KFDY, South Dakota State College, reports the broadcasting of\nfootball games for the first time since the station started.\nOf the work at KOAC, University of Oregon, L, L• Roberts writes t\n“Alexander Hull, an Oregon educator widely known in the state for his musical\nand literary activities, has been added to KOAC’s full time staff of nine persons.\nHelen Miller Senn, instructor of public speaking in the General Extension Service\nof the Oregon State System of Higher Education, is another recent staff addition\nwho devotes half time to coaching plays and preparing material for the high school\nradio guilds,\n’’The high school radio guild idea, an educational feature developed by XOAC\nthis year, is meeting with widespread approval in Oregon schools. The purpose is\nto create and foster interest in better radio broadcasts. This is accomplished by\nproviding guild members with information and suggestions that will help them to\nstudy and analyze radio programs as well as to prepare material for presentation\nover the air.\n\"Referenoes for studying the psychology of the radio audience, and aids for\nanalyzing and writing talks, interviews, skits and plays are supplied by KOAC,\nincluding a cheok sheet for scoring the various types of radio presentations.\n”KOAC announces this fall its plan for coordinating seme of its programs with\ncorrespondence study courses, \"We write a story\" is the title of the series of\nbroadcasts whioh correlate with the correspondence course on ’Short Story Writing. *\n’The ABCs of a homelike home* includes sixteen radio lectures supplementing the\n’House furnishings* study course.\n\"These discussions, presented weekly over the air, are keyed te the topics\nassigned in the study course. Students enrolled for the work listen in and there¬\nby gain additional insight and inspiration in the course. In some cases groups\nform study clubs using the correspondence course outline for guidance and assign¬\nments to club members. They hold meetings for discussion and viewing exhibits at\nthe time of the broadcasts. Enrollments for these courses, which bear college\ncredit, are made through the General Extension Division of the Oregon State System\nof Higher Education, of whioh KOAC is a unit.\n\"The idea of alternating reviews of books for teen age boys and girls with\nradio club meetings dealing with problems of parents of adolescents seems to ’click*\nat KOAC* Club members meet every other Tuesday afternoon to follow an outlined"
}