{
  "id": "d1403-8",
  "text": "A bulletin from University of Michigan Extension Division, Bureau of Radio\nServioe, describing the work of Joseph E. Maddy on the teaching of music by radio,\nMr. Maddy has been extremely successful with this work and the bulletin describes\nthe procedure of organizing listeners.\nA bulletin and sample script from Vaughan MacCaughey, California Teachers\nAssociation, 155 Sansome Street, San Francisco, California, giving details of their\n\"New World Series\" and explaining the \"tie up\" with the Western Division of NBC.\nA bulletin from Miss Blanche Young, Assistant Director Department of Publica¬\ntions, Indianapolis Public Schools, Indianapolis, Indiana, listing content of\nprograms especially arranged for Principals, Teachers, and P.T.A. Radio Chairmen\nand used extensively in public schools.\nA bulletin from Paul C. Reed, Education Bldg., 13 Fitzhugh St., South Rochester,\nNew York, describing courses included in the Rochester School of the Air.\nAn interesting folder from station WHA, University of Wisconsin, Madison,\nWisconsin, announcing and outlining their very successful \"Wisconsin College of the\nAir.\"\n#\nResident McCarty, Engel, et al of WHA, Madison, Wisconsin, are to get out the\nnext bulletin. Unless you have compiled a NAEB Bulletin it is hard to understand\nthe need for contributions from members. In the words of Wright-Sohooley-Fhillips\n\"After all, this series of Bulletins will be what each of us, as members, contribute\nfrom time to time.\"\nLet*s not wait to be asked, but send our notes immediately to Harold A, Engel,\nStation WHA, University of Wisconsin, Madison, Wisconsin.\nI wish to thank those NAEB members who supplied material for the bulletin and\ncontributions which arrived too late will be forwarded to Harold Engel.\nBest wishes from the entire WSUI staff.\nCarl Menzer.\n(Detach here and use. No time like the present)\nProf. B. B. Braokett 1935\nSecretary—Treasurer - National Ass’n. of Educational Broadcasters\nc/o Radio Station KUSD\nVermillion, South Dakota\nDear Sir:\nPlease enroll\n(Name of college or university) ' r ~~~\nas a member of the National Association of Educational Broadcasters, for which I am\nenclosing the enrollment fee of |10,00. Our program is broadcast over Station .\nPlease send reoeipt and put my name on the mailing list to receive the 1935 bulle- ’\ntins.\nYours truly.\nAssociate membership - #2.50"
}