{
  "id": "d1514-0",
  "text": "238 Gregory Hall\nUrsana, Illinois\nFebruary ^5, 8945\nDear naE8er:\nIn my letter of January 5 to you I advised that I would take a mail\nVOTE ON THE PROPOSEO CHANGE IN THE NA£B CONSTITUTION WHICH WOULD\nRE-OEFINE OUR CLASSIFICATION OF MEMBERS.\nI AM ENCLOSING A BALLOT PROVIDING AN OPPORTUNITY FOR YOU TO VOTE FOR\nOR AGAINST THE PROPOSAL * EXACTLY AS APPROVED 8Y THE MEETING IN CHICAGO\nAND* AN ADDITIONAL PROPOSAL WHICH WOULD PROVIDE THAT THE AMENDMENT-\nSHOULD APPLY ONLY TO MEMBERS JO INING AFTER Aprjl I, 1945.\nAlso, you are asked to indicate your wishes regarding a proposal to\nINCREASE DUES FOR THE TWO CLASSES OF MEMBERS. THIS IS A POLL, TAKEN\nFOR GUIOANCE OF THE EXECUTIVE BOARD, WHICH HAS BEEN AUTHORIZED TO ACT\nFOR NAEB0\nNote.* ARTICLE I of the NAEB CONSTITUTION now says*\nMembership;\n(a) Any UNIVERSITY, COLLEGE, OR PUBLIC SCHOOL SYSTEM OF RE—\nCOON I 7 E 0 STANDING ENGAGED IN EDUCATIONAL 8R0ADCASTING OVER A\nRAOIO STATION OWNED AND/OR OPERATED BY IT MAY BE ELECTED TO\nMEMBERSHIP IN THIS ORGANIZATION 9Y APPROVAL OF THE EXECUTIVE\nCOMMITTEE, AND A T^O-THIROS AFFIRMATIVE VOTE OF ALL ACTIVE\nMEMBERS OF THE ASSOCIATION. ^ACH.MEMBER INSTITUTION SHALL BE\nENTITLED TO ONE VOTE.\n(b) Individuals, colleges, and public school systems or\nINDIVIDUALS OF FACULTIES OF RECOGNIZED EDUCATIONAL INSTITUTIONS\nENGAGED IN EDUCATIONAL BROADCASTING MAY BECOME ASSOCIATE MEMBERS\nOF THIS ASSOCIATION BY APPROVAL OF THE EXECUTIVE COMMITTEE, AND\nA TWO-THIRDS AFFIRMATIVE VOTE OF ALL ACTIVE MEMBERS OF THE\nassoci.ation. Associate members shall have all the privileges\nOF ACTIVE MEMBERSHIP, EXCEPT THAT THEY SHALL NOT BE PERMITTED\nTO VOTE OR TO HOLD OFFICE. Any EXPERIMENTAL OR AMATEUR STATION,\nOWNED AND OPERATED BY A RECOGN(7ED EDUCATIONAL INSTITUTION, MAY\nBE ELECTED TO ASSOCIATE MEMBERSHIP.\nAmendment PROPOSAL No. \\ :*\nP.RQ. 9.055.0. AMS.N.PM&N.1.\nThat Article 1 of the Constitution be amended by substitution of\nthe following:\nMembership:\n(a) Any UNIVERSITY, COLLEGE, OR OTHER EDUCATIONAL OR PUBLIC\nSERVICE AGENCY OF RECOGNIZED STANDING ENGAGEO IN EDUCATIONAL,\nNON-COMMERCIAL BROADCASTING OVER A RADIO STATION 0«’NED AND/OR\nOPERATED BY IT OR ANY SUCH AGENCY HOLDING A CONSTRUCTION PERMIT\nFOR SUCH A STATION, MAY BE ELECTED TO MEMBERSHIP IN THIS"
}