{
  "id": "d1849-0",
  "text": "News Release:\nMarch 10, 1947\nN.A.B\nAfter twenty-five years, and at a time when the big networks show a slight defection\nfrom active participation in the NAB, KWSC, the public interest station at Pullman,\n'Washington has decided it should join the national association, KWSC is in a posi¬\ntion now of needing the NAB and its application for membership has been made. Not\nthat the station needs help - it was one of the few among several hundred once-\ngreat non-commercial broadcast stations that weathered the storms of the Twenties\nand Thirties, It was one of those dozen or so experimental stations back in 1917\nwhich went under the call sign of 3KL. KWSC’s official, licensed with own-call-\nsign, 25th birthday is this year. The station has been the most operated in that\nquarter century of any non-commercial institution-owned outlet in the nation. Ope¬\nrated by The State College of Washington, its program hours have been 6:45 a.m,\nto 10:00 p.m., six days a week; it shares time on holidays and Sundays. Its listen-\nable signal extends from British Columbia down through the Inland Empire of Eastern\nWashington, Northern and Central Idaho, into Northeastern Oregon, This area is one\nof the world’s most rapidly developed; the area used 45,000 refrigerator cars to\nship its apples last year - raising more than a third of the commercial apples of\nNorth America; it produced 20,000,000 tons of crops and livestock products - the\ngreatest production on record; agricultural production in 1946 reached a dollar\nvalue of 41*600,000,000 - the leading industry; but mineral production nevertheless\namounted to more than #150,000,000; lumber and logging is stabilized; the area has\nGrand Coulee Dam, of course, but 150 more dams are proposed to develop water power\non the Columbia and its tributaries. KWSC is the only station located in Whitman\nCounty, the world’s wealthiest pea and wheat area. The State College which owns\nthe station has quadrupled its faculty and enrollment in the past 18 months. This\nyear KWSC has renewed or asked for active membership in the AER, BMB, the UAEB, and\nthe NAB because it feels that radio broadcasting is about to meet still greater\nchallenges, some hostile and many progressive, and that brotherhood of all types\nof broadcast stations is necessary for the advance forward.\n*\nPERSONNEL\nPullman, \"Wash., March _j--Diana Bristow', formerly w£th KXR0, Aberdeen, 'Washington\nhas joined KITSC as Accountant.\nPullman, Wash., March ^—Gene Roth, KITSC staff announcer, had a big day recently.\nHe paced the floor all night to be rewarded at dawn with a new son, Garry Michael;\narrived at the station to learn he had been appointed Music Librarian at the time\nof purchase of a whole new transcribed music library. That afternoon Roth finished\nout 24 active hours by taking three mid-year exams at The State College of Yfeshing-\nton where he is studying.\nPullman, Wash., March _--Georgia Elder, KWSC Station Secretary, is back at work\nafter an appendectomy.\"”\nPullman, Wash., MarcJ^^^^^eri0 Haywajpd at public interest station KWSC has had\nlittle home\nmanagement last September. Wife\nhad strep infection of the eyes, then daughter had pneumonia. Now his wife is due\nfor a tonsilectomy and child has measles. Regrets that he didn’t rent a hospital\nroom instead of a house.\nPROGRAM\nPullman, Wash., March ___—Ellen Roberts, formerly with KSAC, Manhattan, Kansas, goes\non the air daily at KWSC, giving lively information on practical homemaking derived\nfrom her own family and ten youthful years of broadcasting. A new feature is Mrs.\nRoberts’ use of KWSC’s magnetic-paper tape recorder which she takes into homes for\ninterviews with her listeners. Ellen neatly scissors and pastes the tape recorder"
}