{
  "id": "d1849-4",
  "text": "•5-\nproduced the work. Listeners had been frequently questioning KWSC as to who\nproduced the recordings so they might be added to their home libraries. Announcer\nthen gives station identification and states there will be a brief pause; in that\nintermission, there is only the ticking of a metronome in the silence of which one\nis free to think or to talk. At the end of the intermission, the next selection\nis announced as simply as before, and then played - timing exactly to 8:59;30.\n* * *\nSAFETY\nPullman, Wash., March _ ~ A letter was directed to Station Manager of KWSC from\nDan Thompson, Director of Radio, National Safety Council, Chicago: \"The National\nSafety Council is very pleased to note KWSC's use of 28 special programs (Most in\nthe Pacific Northwest) on safety during the month of January, 1947. This is a report\nof real public service and I am sure your interest in safety will help prevent acci¬\ndents in your community. Please accept the thanks of the National Safety Council\nfor your continued interest in accident prevention.\" The same day. State Governor\nMon C. Wallgren of Washington reported to the people that in January 1947 traffic\ndeaths were 40 percent lower than same month in 1946.\n* * *\nNOTES\n\"Let's build our hospital to help make this the kind of community we want for our\nloved ones - the kind of community our pioneer fathers hoped it would be\", was the\nkeynote plea of Mrs. Wilson Compton in a radio forum broadcast determining the\nuppermost need of the city of Pullman, Washington. Mrs. Compton's words were\ndelivered over public interest station KWSC. The subsequent hospital drive for\n$200,000 in a town of 5000 people achieved the goal she described.\n\"Mr. Announcer, Dear Sir: Do you remember my calling you in regard to the boy\n(Coast Guard)? Well, instead of calling you back as I said, I decided to drop a\nline. He wrote me he got KWSC station perfectly and enjoyed it very much. He\nand two other boys are in charge of a light-house and nobody else within quite a\ndistance so of course they get lonely. If you have any spare time would it be\nasking too much to ask you to drop him a fev/ lines? He would appreciate it so\nvery much as we all would., I will give you his address: Louis YiL. Brannon, F-l/o,\nc/o Cape Division L/5, Ketchikan, Alaska.Sincerely, Mrs. L. B. Willoughby.\"\n* * *\nRadio Station WTCN, Minneapolis, Minnesota for the second year will award radio\nscholarship to likeliest graduate from city's high schools. Scholarship includes\na year's radio study in a state university or college.\n* * *"
}