{
  "id": "d184-102",
  "text": "CONFIDENTIAL MEMO\nTO;\nNAEB Board\nFROM:\nW. G. Harley\nDATE:\nFebruary 14* 1961\nI hereby resume my former practice when president of sending out more-oi -less\nmonthly memos to the directors in order that they may be made au courant with\ncurrent activities and can, in turn, be responsive to them . The Newsletter,, perforce,\ncan only report on matters appropriate for general attention; obviously, there are many\nactivities in various stages of development about which the directors ought to be\ninformed but which would not be appropriate for public announcement.\n1 conceive of my role to be that of providing leadership in making recommendations\nand initiating projects; yours to react in terms of policy guidance and advice * In order\nto profit from your counsel* I need to keep you fully informed of what8s transpiring\nor is being contemplated* I trust in this way that we can develop a closer and more\nhelpful relationship between the Board and the Headquarters staff.\nAccordingly, I welcome your comments. Feel free, if you wish, to scribble on\nthe margins or back of these memos and return. All reaction is helpful.\n1. Depending somewhat on how things develop in relation to (1) Board\nreaction to the proposed letter of agreement on NAEB-NETRC (a copy of which will\nbe distributed shortly) and (2) on how matters work out in actual practice between\nnow and then as to NAEB-NETRC relationships, I suggest that we plan to have\nJack White and Jim Robertson join the Board for lunch following our Board meeting\nin Milwaukee* March 14.\n2 . NAEB has been asked to plan a session on educational radio for the\nDAVI convention in Miami, April 24-28. These dates, unfortunately, largely\nconflict with those of the IERT. Since I felt it was important both from the stand¬\npoint of inter-organizational relationships and of promoting radio that we accept\nthe invitation, I agreed to take the assignment on April 22, even though it means\n(1) having to fiy out immediately to be in Columbus the following noon and (2) having\nto switch the NAEB Board meeting to Saturday after IERT {April 29). We can't have\nthe Board meeting Friday night because of the IERT Awards Banquet. However, if\nwe start at 9 am Saturday and meet through lunch, we ought to be able to conclude\nby 4: 00 pm in time for most everybody to get home that night. I regret this switch\nbut felt the considerations justified it\nParticipants in the radio session include;\nHartford Gunn\nAi Fredette\nBurton Paulu\nPerson to be\nselected\nInter-connected Live Networking\nTwo-way radio communication\nNew Findings in Radio Audience Research\nNew Development* in Radio Programs tor Schools"
}