{
  "id": "d184-104",
  "text": "CHANNEL\nSTUDIOS—UNIVERSITY OF WASHINGTON\n0\nTRANSMITTER—EDISON TECHNICAL SCHOOL\nKCTS(TV)\nCOMMUNITY TELEVISION SERVICE\nSEATTLE 5, WASHINGTON\nFebruary 13, 1961\nTos ETV Station Managers\nFrom: Loren B0 Stone\nEnclosed is the information on current wage rates at the educational television\nstations as supplied by the station managers*\nI remind each of you that this information is supplied to you in c nfidenc© . it\nwas agreed, you will, recall, that this would be the case0 Since a majority of the\nstations responding indicated it was not within their policy to permit identification\nof tneir station, no station has been identified*\nEight stations «— Tampa, Des Moines, New Orleans, Boston, Detroit, Sto Louis,\nColumbus and Madison — did not reply0 This information is not being supplied them,\nas this is an exchange of information between manager30 Two stations replied but\ndid not supply wage rates for any individual positions, stating that their scales\nwere identical with the “academic** scales for their institutions0\nThu system of Glassification of stations is similar to that used in grr ping the\nstar.ions for METRO fees;; Class A — population of market area above 3*000,000;\n■:tui-;• B — population between 1*500,000 and 3„OCX),GOO; Class C — population from\n•*00,000 to 3,500,000; Class D population 200,000 to 500,000; and Class K ~«\n. op illation below 200,000,\n■it was suggested that separate groupings be made for Northern and Southern stations.\n*• nere such separation would not disclose the identity of individual stations, it has\nbeen dona0 States classed as \"Southern** in this report ares Alabama, Arizona, Florida,\n.'Sorgia, Louisiana* Missouri, New Mexico, North Carolina, Oklahoma, Tennessee & Texas6\n?' the stations responding, four — Chicago, San rancisco, Pittsburgh and dt. Paul -\nPm-toapolis —advised that they have c- ntrqct* «;th labor unions coveriru their\nteclinical personnel and each sent a copy of his contruet0 1 see nothing unusual in\nthe contracts, nor any particular usefulness to u» served in digesting them for each\nof you at this time*, if any of you face labor negotiations, I will supply you with\n- apiary of the provisions of these contracts, or, I know, the managers of toe\n■-irvidual stations will be pleased to assist you with information0\n• supplying » copy of this study to Bill Harley and a copy to JLm .Robertson®\n■ appreciate the cooperation each of. you .av«? the study by supplying information\nabout your own station.. I know ih*?. data will be useful to Bach station manager."
}