{
  "id": "d184-125",
  "text": "COFSf\nW H Y Y\nCOPY\nEducational Radio and Television\nRichard S. Burdick\nManaging Director\nJanuary 4, 1961\nWilliam G. Harley, President\nNational Association of Educational Broadcasters\nSuite 1119\nDuPont Circle Office Building\n1346 Connecticut Avenue, N, W.\nWashington S, D C.\nDear Bill;\nIn reviewing the minutes of the NAEB Board meeting held in San Francisco on\nOctober 15, 1960, I noted certain inaccuracies in the report by legal counsel, Leonard\nMarks. You will recall that I joined the meeting after Leonard Marks had made his\nreport, so therefore I did not become acquainted with it until reading the minutes\nrecently distributed .\nThe inaccuracies in the Leonard Marks report are of such significance and,\nI assume, will be of such concern to the NAEB Board members who are concerned with\nthe representation by Cohn & Marks of a commercial applicant vs. an educational\napplicant in the hearing for a licensee to operate VHF Channel 12, Delaware that I want\nto take this opportunity to bring the corrections to your attention.\nIn paragraph one of his report, Mr. Marks states; * 'Educators in Philadelphia\nfeel that since there is no interest on the part of educational Interests in Delaware,\nIncluding the University of Delaware, to obtain the station that this valuable VHF\nstation should be assigned to Philadelphia, where it could better serve educational\ninterests in that City.\"\nThere are two major inaccuracies in the above statement:\n1) Philadelphia do not feel as stated by Mr. Marks. On the contrary, they are\ngreatly encouraged by the strength and volume of the support of the educational interests\nin Delaware in respect to the WHYY, Inc. application for Channel 12. It is unfortunate\nthat the Leonard Marks statement gives the impression that Delaware educational\ninterests are not interested in seeing the station operated as an educational service,\nmerely because they are not themselves financially prepared to assume the full burden\nof licensees, when in fact they have wholeheartedly endorsed the idea of the channel\nto be operated for education on the premise that the operational responsibility will be\nassumed by WHYY, Inc.\n2) It is not and has never been the intent of WHYY, Inc. to have VHF Channel\n12 assigned to Philadelphia; indeed, the FCC channel allocations preclude such a\nreassignment. We recognize and honor the proprietary right of Delaware to retain the\nchannel within its own state boundaries and have no intentions of trying to hijack it.\nDelaware educational, cultural and civic interests have endorsed our proposal to operate\nthe channel for the service of the entire tri-state area, with a studio to be located in\n1622 Chestnut Street\nPhiladelphia 3, Pa."
}