{
  "id": "d184-130",
  "text": "COPY\nCOPY\nMr. Richard S. Burdick January 30, 1961\nWHYY, foe.\n1322 Chestnut Street\nPhiladelphia 3, Pennsylvania\nDear Dick:\nA memorandum of Cornet-ions and Addfl»daJteja^ 1‘\nI960 will shortly be distributed to all the directors. In accordance with your\nsquest it will contain the contents of your letter of January 4, plus the information\nci Governor Carvel’s request to the legislature for enactment of a joint resolution\nr questing Channel 12 to b© allocated to Delaware for a Delaware-based educational\nt levisihn station.\nX u have also requested a reply to your question about NAEB’s position in this matter\nU view of th© participation of the firm of its general counsel in the proceeding repre¬\nssing a commercial applicant• I am happy to comply with your request.\nX. k major purpose of the NASB is to promote the development and greater\natilhation of radio \"and television in the service of education and the public welfare.\n;o this ©nd it ha© constantly sought on the national level to improve the opportunities\nk.r educational broadcasting and to acquire for education the facilities which it needs\nfi.it la to maximise use of these instruments in education’s service. NAEBf you recall,\nta' tho fight for reservation of FM radio frequencies for education and took the initi¬\nally in organizing the JCET, which conducted the successful fight for the reserved\ncfcvnel allocations in television.\n>. in the Sixth Report and Order certain frequencies were reserved for non-\ncomtircial us© — an outcome th© NAEB fought long and hard to bring about.\nAoccx ingly, these specific channels were set aside exclusively for education and\ncornu, voial applicants denied their use. In the instant proceeding, however, an\neducat:>nal agency is seeking a channel, in effect, assigned for commercial us©,\nhence, :h© position of NAEB’s counsel in independently representing a commercial\napplic&n for a commercial channel is not inconsistent.\nIf th) proceeding involved an attempt by commercial interests to acquire an\neducation ! channel or if it involved attempts to delete a channel reserved for\neducation , the participation, in the proceedings of our counsel would clearly be in\nconflict ©a! our counsel would withdraw from the case •\n3. By tgreement with the JCET, NAEB has never participated in proceedings\ninvolving individual applications but has confined its FCC activities to repre¬\nsenting th© educational broadcasters on matters of broad industry-wide concern"
}