{
  "id": "d184-131",
  "text": "Mr. Richard S. Burdick\n-2*\nJanuary 30, 1961\nand in developing positions on national issues affecting educational broadcasting.\nHence it has not, as an association, involved itself in the Channel 12 proceeding\nIn Wilmington or in any other local situation.\n4. U WHYIf, Inc. should again apply for Channel 12 to be assigned as\neducational and seek to have' this done through a rule making proceeding on the\nallocations table as regards unreserved channels, the NAEB would consider this as\na matter of general concern appropriate to our role as a national association, and\naccordingly, would go all out to support such a petition.\nLsf me emphasis® that the NAEB wants to dp all in its power to foster the growth\nand development of ETV as a national movement and, accordingly, is tally m\nsympathy with the needs of the'Philadelphia-Delaware area for-adequate ETV seme©\nand its efforts id obtain the necessary facilities to bring this about.\nSincerely yours,\nA/ Bill\nWilliam G. Harley\nThe abevd letter was written on the basis of present policy. The Board may wish\nto consider Bering the policy of no local intervention in view of the undoubted\nfact that as state and regional networks develop there will be increasing occasions\nin which educators will be obliged to compete for \"commercial channels.At ^\nprasem, at the FCC is inclined to deny requests for conyamng unassigned\nchannels to reserved status and require education to seek such channels in\ncomparative consideration.\nI personally question th© wisdom of a national association (NAEB or MAE, xor\nthat matter) intervening in cases of local concern. Our appropriate FOG role, it\nseems to me, md th© one we have outlined in connection with th© JCET-NAEB-\nHETRC 'Washington axis, is to represent the educational broadcastlng ind ustry,\nnot individual stations* (stations collectively not individually) on- matters of\ngeneral concern and interest . Accordingly NAEB would represent education's\ninterests in matters of allocations policy: preparation of arguments in response\nto FCC proposals, development of briefs covering special needs of education\nin tire spectrum, initiation of proceedings toenefltting the long range interests\nof education in the electronics spectrum, and in general, directing appearances\nin behalf of education in all matters broadly affecting the broadcasting field\nrelating to allocations, reservations and regulations."
}