{
  "id": "d184-25",
  "text": "PRESIDENT’S MEMO\nTHE BOARD OF DIRECTORS\nWashington, DX»\nAugust 17., 1961\nFollowing up on my promise at the Madison Seminar, I am hereby re-insti-\ntuting the practice of sending the Board of Directors a monthly informal memo to keep\nthem more fully abreast of current, activities of the Association, progress of projects\ns*in the works3 8, and plans for future developments.\nI agree with the criticism voiced by SchwartzwaIcier and others that the Board\nis not being kept sufficiently informed. The Journal and Newsletter, having wide dis¬\ntribution are not appropriate vehicles for distributing information on progress of ne¬\ngotiations or other sensitive matters that are best kept ‘en famiBe 99; hence, this memo\nmethod. Please keep the contents confidential.\nMADISON SEMINAR FOLLOW- IIP\nJack McBride, Chairman of the Permanent Convention Committee, immediately\nfired off a new faemo to his group incorporating suggestions from the Seminar calling\nfor widespread participation of members - particularly newer ones - in convention\nproceedings. Twelve NAEB people are to be selected to present papers and at each\nof the four sessions there will be a chairman, recorder, and three reactors. By so do¬\ning 32 people will be involved on the four sessions devoted to paper presentations.\nJack’s committee is recommending appropriate topics and speakers competent to discuss\nthem.\nAt Schwartzwalder's suggestion ,, I have agreed to appoint an ad hoc committee\nto study the need and feasibility of an NAEB television network along the lines dis¬\ncussed in Madison. Jim Miles (who has video-tape equipment in his back yard) has\nagreed to serve as Chariman; other members will be announced shortly. Incidentally,\nthe Center, USOE and McBride are discussing, next week, plans for the Center’s\nrole as national distribution center for video instructional material,\nPERSONNEL RECRUITMENT\nUrgent requests in the past few days for NAEB to suggest personnel for Feder¬\nal jobs, again points up the importance of our proposal for a national index , Armand\nHunter, a member of the Title VII Advisory Committee and currently acting as a special\nconsultant here In Washington to the USOE, has promised me to do all he can to get\naction on our proposa 1 this month Part of his willingness crises from the need of US¬\nOE to find an immediate replacement for John Meaney, who left June 30 and for whom\nArmand is substituting. This job is the Radio-TV specialist in the Ed, Media Branch.\nXt3s a civil service job with a starting salary of $12,210. This job will become increas¬\ning important - especially if the ETV legislation goes thru - and it’s to our interest to\nget a good man in this spot."
}