{
  "id": "d184-26",
  "text": "This is ©Asa *s - oi a... coming up in D «■. tor s tfucoessot «.. * .4©k\nEider, who is fee Radio-*¥' specialist in fee Meal© U&mz\\ ai 1C A. Dick warns to ac¬\ncept m overseas post In Nigeria a no wishes to leave as soon as possible * With our\nincreasing reiauonsMps wife. IC-4* it is clearly important that we nominate an able\n.■ .an as pick** replacement „\nThe National Space Agnecy is looking ior three men in communications-though\nlids need as not so urgent as the othe. two.\nSo ii you have suggestions for feese spots, please let me Know — immediately „\nIMLiM\nWith the. Kellogg grant expiring next June, I feel first priority must be given\nby me to fund raising; accordingly, I am determine© to concentrate on this area even\nthough at the neglect ©t soma other important activities „\nOn the basis oi a taik today Cl6th) with Carlton &mith,- RCA VP in Washington,\nwe are going to get at least $k5,G0u to get the bums proposal on the iOad, We ex¬\nplained we didn't have stall to undertake the carrying toward of this undertaking; if\nwe could obtain outside funds lor a man, secretary , and travel we could launch the\nprojecto\nEcuador - IGA contract for two-phase ETV project has been endorsed by top\nexecutive responsible tm that area « Virtually certain the first phase calling lor a\ntwo man'team for three giontns to make feasibility study will be approved shortly „\nOn the Pakistan ETV Development - the Vice President wants to wait \"till\nafter the presidents foreign aid legislation has got thru congress; then hell move0\nIncidentally* in response to request from the State Department for a man to\nspeak at the UNESCO meeting in Tanganyika on Educational Radio for Africa«, We\nnominated tire© NAEB radio experts and they chose Harry Skomia 0 Appropriately\nHarry is Chairman of fee NAEB Foreign Relations Committee and Chairman of fee Mass\nMedia Committee of the UoS„ National Commission for UNESCO*\nFCC MATTERS\nThe JCEB is going to take the lu 4*11.0 ore reaeras, Court of Appeals to aek for\na review and reversal of three FCC rulings issued in Jbte July which it contends were\narbitrary, capritious, contrary to fee public’s interest, and adverse to nationwide de¬\nvelopment of non-commercial educational television„ 'The principle issue here is the\ndetermination of fee FCC tha t the public interest is better served by providing in any\ncommunity which ms two existing commercial outlets a feird commercial outlet ass on-"
}