{
  "id": "d184-97",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n1346 Connecticut Avenue\nWashington 60 D« Ca\n21 Februrry 1961\nMr. John C. Schwarzwalder, Manager\nStation KTCA-TV,\n1640 Como Avenue,\nSt. Paul 13, Minnesota .\nDear John:\nI have read your recent communiques with a wry smile »ut full appreciation for\nyour utter candor and vigor of expression. Sincerely ,though l frequently\ndisagree with your views and invariably deplore your tannere I never fail to\nrespect your native acuity and keen perceptual faculties. These qualities\nare important in a director, for it is only through the exility and willingness\nto raise searching questions on both sides of a question that we can detect\nthe truth and error about matters that arise.\nI would be lees than human if I were not tempted to reply to you in kind, but it\nill becomes us both to indulge in a merles of intempemte exchanges * I shall\nvigorously defend my action and assart my views at the Board meeting and you\nwill be given a similar opportunity. However, there are a few points that ought\nto be clarified immediately»\nThe responsibility for the letter to Dick Burdick should not be placed on the\nExecutive Committee. I checked the general policy position with them but the\nexposition of our position and its specific application was mine.\nAlthough Leonard Marks suggested that we employ specif! counsel or offer to\nassist in any way we wished to heip WHYY-TV, he pointed out that the FCC has\nrefected attempts by trade associations; unions, chambers of commerce to\nIntervene on behalf of applicants. Since NAEB, neve/ in its history, has inter¬\nvened in a local situation I did not feel it incumbent upon me as president to\ndepart from this precedent of long standing. And, yince legally NAEB was too\nlate to intervener in any case, there seemed no point in going to the Board\nfor an emergency consideration of a well-established policy.\nI failed to for see, however, that a statement of our traditional policy of staying\nout of local contests would, in this particular instance, be construed or made to\nappear not as non-intervention but as active opposition to the educational\ninterest. This misinterpretation was aggravated by the fact that Dick was unaware"
}