{
  "id": "d1770-0",
  "text": "N-A-E-D NlWS LETTlP\nNational Association of Educational Broadcasters\nMadison, Wisconsin —■ Sept. 7, 1957\nConvention Booster Issue /\nEverything is pointing toward this annual N-A-E-B convention at the\nUniversity of Illinois in Urbana on September 15 and 14. Jos. F. Wright,\nDirector of WILL, and his staff will be hosts to the delegates.\nWith the assistance of his lieutenant, Frank E. Schooley, Mr. Wright has\nplanned most interesting meetings. Reports from members indicate that many stations\nnot represented in former years will answer the roll call this year. Larger\ngroups of delegates, too, are in order. One member station is sending seven of\nits workers on a 500 mile jaunt to be there. How about your people?\nBUSINESS SESSION CALLED\nA business meeting for members will be held on Tuesday afternoon. With the\nroutine matters are several which need the consideration of all members. Plans\nfor more effective use of the Associations recording machine, participation in\nthe National Conference program, and elections are scheduled. A nominating committe\nwill be appointed early in the session to receive recommendations for the various\n* elective offices.\nURBANA HOTEL ACCOMMODATIONS\nThe Urbana-Lincoln Hotel has been recommended as a stopping place for\nrepresentatives at the convention. Rates are from \"1.75 to $2.50 single and\nfrom $2.75 to $5.50 double. Members make their own reservations.\nASSOCIATION PECORDER AT CONVENTION\nA demonstration of recording technique will be staged on the Association1s\ntranscription equipment in the WILL studios. Members are urged to have their\ntechnical workers see the demonstration and learn how easy it is to make good\nrecords. The equipment will bo available for use by members without charge\nthroughout the coining year,\nMEMBER STATIONS TALK REBROADCAST PLAN\nSeveral educational stations in the mid-western area are thinking about,\nand will discuss at the convention, plans for rebroadcasting certain of the\nothers* programs. Carl Menzer, at WSUI, is already experimenting with pick-ups.\nHe reports picking up WOI and VVHA at Iowa City sufficiently well to rebroadcast\nthe signals. He proposes further testing at other stations. The matter will\nbe talked over at the convention. Check on a receiver, in your community, and\nsee which educational stations come in veil enough to he rebroadcast.\nThe technical men will have their opportunities at the convention to talk\ntheir problems over together. Stations are urged to send their engineers to\nthe meetings. Bring along practical suggestions and actual problems for\ndiscussion."
}