{
  "id": "d1770-3",
  "text": "F.C.C. EXAMINER SUSTAINS KFUO CASE\nKFUO, operated by Concordia Theological Seminary in St. Louis, has been\ngiven favorable consideration in its counter application for half time on the\n550 Kc. channel after KSD, the Post Dispatch Station, had petitioned for full¬\ntime use of that frequency which both shared.\nExaminer P. W. Seward made a recommendation from which we quote: \"The\nservice rendered by Station KSD is similar to that rendered by other stations\nlocated in the St. Louis area; the operation of this station full time as\nproposed herein would not provide any new kind of service for the public interest.\nIt would appear therefore that the major interests that would be served by the\nassignment of additional time to KSD, with‘the resultant deletion of Station KFUO,\nare the private interests of the licensee of KSD.\n\"It is not in the public interest to delete a non-profit station whose\nprograms spread the Gospel in an attractive and interesting manner and affords\neducational and cultural programs, expecially when that station serves, a$d\nproposes to servo, the area with more diversified programs that will supply a\nlocal need of general public interest to grant a commercial station additional\ntime would be to afford only beneficial result from the granting of such\nadditional time would be to afford the commercial station an opportunity to\nincrease its profit. This is especially true when the additional time of the\ncommercial station is to be devoted to a class of programs which is already\navailable from other stations in the area.\n\"From a consideration of the entire record it a jpears that the grant of the\napplication of Station KFUO for one-half time on the frequency 550 kilocycles\nwould be an equitable distribution and use of the frequency in the St. Louis area;\nthat the use of the frequency in the St. Louis area; that the use of but per\ncent of the broadcast time on a particular frequency by a broadcast station is\ninadequate for the economic operation of such station that it is in the public\ninterest to grant the application of Station KFUO, a non-profit broadcast station,\nfor one-half time on the frequency now used by it and Station KSD; that such use\nwould supply better and more equitable use of the 550-kilocycle frequency; that\nsuch grant would continue in operation a station that has heretofore rendered\nmeritorious service and would bring to the area needed local service of a general\nnature.\n\"After considering the entire record, it appears that the grant of the\napplication of Station KSD for full time on the frequency 550 kilocycles would\nnot be in the public interest and that the grant of the application of Station\nKFUO for the use of one-half time on said frequency would serve public interest,\nconvenience, and necessity.\"\nLet's watch this case. If the F.C.C. approves the examiners report it may be\nan indication to give hope to other non-commercial stations. If the recommendation\nbased on facts, is not sustained someone should do some explaining.\nEXCHANGE PACKET TO CONTINUE\nThe exchange packet service will be resumed in October with the first\nmailing going out early in the month. The success of this service depends\nentirely upon you as members. Won't you, right now - make a note to send thirty\ncopies of all now bulletins, scripts, forms, programs and other- publications to\nH. A. Engel, Radio Hall, Madison Wisconsin, at once?"
}