{
  "id": "d435-16",
  "text": "February 9$ 19$k\nPage THREE\nLos Angeles\nI had a long conversation with Bill, His advisory board of 21 is quite active.\nThey wanted Jim Haggerty, the state secretary to serve, but he designated Bill Bassett®\nHaggerty is a member of the San Francisco board, Bassett has not been active but I\npromised to talk to him and discuss the need for his participation® Bill has a good\nrelationship with the key union people. His key staff people are instructors at\nthe University and are, in most cases, members of officers of the unions involved.\nHe has a fine relationship with all of the unions, especially the Musicians. Capt,\nHancock has been a member of the Musicians* Union for many, many years. He*3 con¬\ntemplating holding a conference with all of the unions involved. He accepted my\nsuggestion that before he does this, he discuss the agenda and problems with his\nkey people®\nHe has an immediate transmitter problem. At present he operates his transmitter on\ntop of Mt. Wilson on a deal with John Poole. I*hink I helped him solve his problem\nin this connection, which will also act as the basis for his IBEW relationship in\nthe future. As a general solution, he would l*ke his union people limited to trans¬\nmitter, maintenance and control—in that order —and devote full time to the station#\nHe will aim for a student and apprenticeship set-up. He made it very clear that the\npolicy of the station is to be honest and fair to the unions, and to quote him$«We\naren* t interested in a wild—cat operation, nor will we go in for strike—breaking.•*\nAt present eight or nine instructors are running his shop. He agrees that he will\nfill his first announcers *s post with an AFRA member. He would like to arrange for\nthat man not to be restricted to announcing but that he be permitted to produce,\ndirect, train apprentices and part-time students, etc. He is most interested in the\nstudy course phase®\nBill o^Sce'helps, with AFRA, ASCAP AHD an. He has had some minor difficulties with\nIBEW but they have all been straightened out. As a non-commercial station he has had\nconsideration from the Musicians* Union. He is hopeful that we can work out\nsomething similar with the other crafts. He was sure that what I was doing on the\nnational level would be of help with the local groups.\nSan Francisco\nI talked to Jim on the phone. In forty minutes I got a fast fun-down on his present\nand future plans. He intends to utilize skilled professional help in his key jobs,\nboth programming and technically. He has a good working relationship with IBEW and\nfa&T labor. The four instructors at the John 0* Connor trade school of the S.F. public\nschool system are members of the unions. This technical training program is open to\ntechnicians with prior experience in electronics. His main studio will be located\nat the school and both unions have agreed to augment his crew with apprentices from\nthe school. He, of course, agreed with the suggestion that our stations operate on\na student-apprenticeship and craftsman base. His problem will be to get the consent\nof the unions to use John 0* Connor school students outside of the building when h®jjas\nadditional studios. Strange as it may seem, in S.F. his dealings have been with IEE#\nWi and not with the IA. H e has had meetings and is in good standing withthelocaljmA\npeople. He, too, is anxious that AFRA permit their people to do more than just announce.\nHe realizes the danger should he get involved in extended dramatic programs. He\nhas had no contact with the musicians. He would like to work out a program and I\nthink I can help him."
}