{
  "id": "d435-24",
  "text": "DATE? May 12, 1954\nSUBJECTS; Various\nThe attached letter to Novik speaks for Itself.. It’s as X was requested\nby Graydon to drajw up, but with -various generalities reduced to specifics,\nI do feel that the fears of one or two people have had so much effect on\nthe situation now. that Noviks value to us is likely to be virtually nil. Herewith,\nquotations from 2 recent notes from Morris;\n(l) \"My Dear Harry;\nYou have covered the understanding that you\nGraydon and I had - thoroughly and accurately.\nAs far as X am concerned, it is o.k** and I\nwill await further instructions„\"\n(.2) \"Having said what 1 did about your May 4th Memo, I\nthink I ought to tall you in confidence about on*?\nset-back that 1 have had Du© to ay desire to live\nup to the letter and your prohibition about possible\nNational negotiations,\nX think I have told you that the top XEEW people\nof Lcs Angeles and Sara Francisco, St, Louis etc,\nhave been meeting in Washington for the past couple\nof weeks. Hardy, the top Washington man, arranged\nfor an informal luncheon session to give me a\nchance to explain the problem of the educational\nstation. 1 was so anxious to avoid any possible\nviolation of the spirit of the Columbus decision,\nthat X cancelled the session and of course missed\nthe opportunity of having the sympathetic attitude\nof L.A v San Francisco and Hardy help break down\nStc Louis which, as you know, is a hard nut to crack. **\nUni ©S3 this is to be reduced to an impossible situation of fearfulness,,\nI think we should best drop it* X therefor© hereby request authorization for\nMorrie to engage in informal conversations of the sort mentioned above, which will\nbe to the long-term advantage of all, X think all unions who read and listen now\nknow there is such a thing as educational TV, and the beet presentation of our\nsituation would be one presented by us rather than someone else\nThe reaction and in essence vote) of all officers,, to Graydon with copy\nto me (if this is o\\k, with him) is urgently needed, as well as your reactionrto\nmy May 10 note re meeting. I now believe this meeting should include Schenkkan and\nGoggin as well as a few Directors at leasty so that various sides of the problem\ncan be threshed out. Personally I^m willing to lose a member* if necessary\n{Schenkkan. you may recall threatened this on behalf of WUPC.---TV if we \"even talked\"\nto unions) rather than being \"babes in the wood\" a few years from now. May I hear\nfrom you (besides Hull and Dunn who are already firm and clear)*"
}