{
  "id": "d1343-5",
  "text": "NAEB NEWS LETTER\nNovember 15, 194!\nPage 6\nTHE NAEB TO MEET IN MAOtSON FOR THE 1642 CONVENTION.\naside from the assurance that McCarty ano Engel will whip up some\nGOOD LOCAL ARRANGEMENTS ANO AfcCC CATIONS, C8TRA INDUCEMENTS ARE\nSUGQESTCO-A FISH FRY AT THE MCCaRTY-£nGEL RANCH-A TRIP TO THE\nFAMOUS WISCONSIN DELLS (a BOAT-RIDE, INDIANS, N* EVERYTHING)—-\nANO A8 MUCH MORE AS TIME WILL PERMIT.\nRemember—Mao»son is centrally locateo in the middle west ano\nEASY TO GET TO. It 18 THREE HOURS FROM CHICAGO BY RAIL SR ROAO\n—ON THE C. M., ST. P. & P. RY, C. & N. W. Ry., I. C. Ry., NORTH¬\nWEST Airlines, and the Greyhound eus lines.\nMadison in 19423 You\"re invited!\n01D YOU LOOK AT NOVEMBERS PACKET?\nThe NAEB packet, mailed with the News Letter of November I, con¬\ntained the following items: University of Kentucky Radio Pro¬\ngrams, November 3-16; The Education of Free Men in American De¬\nmocracy ano What They Say; KOAC programs for Octobcr-Decemser;\nWOI PR0GRAM8 FOR OCTO0ER-DECEM8ER; ANO THE YOUTH COURT BOOKLET\nor OBU Campos Studios. There are some ioeas here, so if you over¬\nlooked THE'-PAOKLT, BETTER CHECK BACK.\nHAVE YOU CONTRIBUTED TP^£...PAflKEIt\nSeems like the life of the Executive Secretary is one solicitation\nAFTER ANOTHER, BUT IF YOU DON'T LIKE IT YOU CAN DO SOMETHING ABOUT\nIT OR JUST COMPLAIN. NAEB IS A MUTUAL ORGANIZATION OF THOSE IN¬\nSTITUTIONS AND INDIVIDUALS INTERESTED IN EDUCATIONS SR0ADCA8TING.\nWE CAN BE OF HELP TO ONE ANOTHER.\nNAEB SCRIPT EXCHANGE\nContributions are coming in too slowly. If some of you promising\nnaebers don't come through within the next fortnight, I'm going\nTO HOLLER «l TOLD YOU 80.\" WATCH THE OCCCMBER I NEW8 LETTER FOR\nA SPECIAL ANNOUNCEMENT.\nACTIONS BY THE COMMISSION\nPursuant to its Supplemental Report on Chain Broadcasting of October II,\n1941, the Commission amended Sections 3.102, 3.103, and 3.104 (per¬\ntaining THERETO) AND, AT THE SAME TIME, AMENDED SECTION 3.34, EX¬\nTENDING THE NORMAL LICENSE PERIOD OF ALL STANDARD BROADCAST STATIONS\nTO TWO YEARS, WITH EXPIRATION OATE Of LICENSES ON THE VARIOUS FRE-"
}