{
  "id": "d1673-1",
  "text": "- 2 -\n(ii) In determining the eligibility of privately controlled organizations,\nthe accreditation of recognized regional and national accreditation\nagencies shall be taken into consideration.\nBE IT FURTHER RESOLVED, that should the Federal Communications Commission\ndecide against adopting this present revision, that the NAEB does hereby request\nan oral hearing on this matter.\nRESOLVED, that the National Association of Educational Broadcasters express\nto Clifford J. Durr, Chairman of the Educational Committee of the Federal Commun¬\nications Commission,its appreciation for his cooperation in the cause of educational\nbroadcasting and commend him for his fearless and effective leadership in the in¬\nterests of public■service radio in America.\nWHEREAS, Robert J. Coleman and his staff did adequately provide for the annual\nmeeting of the National Association of Educational Broadcasters and,\nWHEREAS, Michigan State College did show the Association the hospitality for\nwhich it is noted, now,\n. THEREFORE PE IT RESOLVED, that this Association assembled; does express its\nheartfelt gratitude for the hospitality shown it.\nWHEREAS, W. I, Griffith has long and faithfully served the National Association\nof Educational Broadcasters and,\nWHEREAS, Mr* Griffith in his capacity of Secretary-Treasurer has kept the\nAssociation solvent and,\nWHEREAS, Mr. Griffith attended all NAEB conventions and given generously of\nhis knowledge based on long years of service, in educational broadcasting, now,\nTHEREFORE BE IT RESOLVED, that this Association thank W. I. Griffith for past\nservices rendered and wish him many years more as an officer of NAEB.\nWHEREAS, Frank E* Schooley has been a faithful servant of the National\nAssociation of Educational Broadcasters and,\nWHEREAS, Mr* Schooley has graciously served in the dual capacity of President\nand Executive' Secretary for the major portion of the year just ended and,\nWHEREAS, Mr* Schooley has prepared many fine NAEB News Letters which have been\nof great help to the membership and,\nWHEREAS, Mr* Schooley has been instrumental in arranging many fine features for\nthe Association annual meetings, now,\nTHEREFORE BE IT RESOiVED, that this Association express its appreciation to\nFrank E. Schooley and that he be given the thanks of every member of the Association\nfor the services rendered.\nOFFICERS ELECTED\nAt the closing session the election of officers for the ensuing year was held,\nwith the following results;\nPresident...Harold A. Engel, WEA, University of Wisconsin, Madison\nVice-President........Robert J. Coleman, WEAR, Michigan State College,\nEast Lansing\n.. W. I. Griffith, WOI, Iowa State College, Ames.\nTreasurer..."
}