{
  "id": "d1673-4",
  "text": "- 5 -\nWNA-D (University of Oklahoma) granted CP to make changes in antenna and mount\nsame dn top of AM antenna.\nWDTR (Detroit Board of Education) granted modification of CF make changes in\nantenna system and specify type of transmitter.\nNorthwestern Theological Seminary and Bible Training School--—applied for CP\nfor new daytime station on 900 Kc. with 1 Kw power (October 8, 1946)\nCornell University—-granted CP for Class B FM station, channel 101.3 Me.\n40 Kw., antenna 730 ft. (October 10)\nIT'S YOUR NEES-LETTER\nThe NAEB NEWS-LETTER operates as a clearing-house for information and ideas\nbetween members. How effectively it does it depends in a large measure on you,\nfor from you must come the items to be included. Ahat is wanted? Information\nabout your station programs, equipment, building improvements, publicity stunts,\npromotional activities, personnel, FCC negotiations, finances, facilities—-—and\njust plain station chatter.\nHereafter, the attempt will be made to get the News-Letter out the first of\neach month. So-—--let's make the copy deadline the 25th of each month. If you\nor your station don't break into the news, remember v/ho is responsible. GKJ\nMark your calendar for several months ahead so you won't forgot. Send that news\nto E. A. Engel, Radio Tv HA, Madison, hi scons in.\nRemember—  you don't have to wait until the 25th to send in your\ncontribution. Send it now-----—-while you think of it—-or pass the buck to\nyou r most re liable he Iper.'\nHITS AND MISSES\nSays Niles Trammel, NBC prexv in addressing The NAB convention-—~-\"l am re¬\nminded of an old European proverb that 'the culture cf a nation is determined by\nits use of soap'—-and that.the United States, with six percent of the world's\npopulation, uses one-third of the world's soap supply.\" Now we know what a\n\"cultural program\" isJ\n\"This post-war year must not happen again. If it does, broadcasters would be\nwell advised to study up on the care and feeding of The British Broadcasting Corp.\"\n(Broadcasting Magazine 9/28/46.) Tut, tut-if this be treason----.'\nBroadcasting Magazine headline-\"Hell Is Located on a Washington Kill\". Nice\nnsighb o rs they . have.\nnThe application of new and sparkling ideas in the presentation of educational,\ndocumentary and controversial issues is one of our greatest challenges today\"---\nWm. S. Paley, CBS president, 10/22/4o ) So say we alii\nEdited by-.\nH. A. Engel\nRadio WEA\nMadison, Wisconsin\nIf ov embe r 12, 19 46"
}