{
  "id": "d181-11",
  "text": "2\n£. Second priority should go to “expansion/improvement\" proposals,\nespecially where such grants would demonstrably contribute to\nimprovement of \"quality\" of station performance (see C-l below).\nIn rough order, such expansions would include the following\nsub-priorities:\n1. Proposals to increase audience served, through antenna\nrelocation, increase in power, etc.\n2. Capability for color transmission and reproduction (i.e.,\nadding color-capability to transmitters, providing color\nfilm, VTR capability to sizeable audiences).\n3. Live color origination production capability (color cameras\nand studio gear) should be limited to project(s) likely to\nprovide programming benefits to regional or national\naudiences through NET or CPB distribution.\n(NOTE: Some panel discussion focussed on responsibility of\nCorporation for Public Broadcasting to participate\nin support of hardware requirements for CPB\nproduction. No resolution or \"recommendation\" was\nreached on such divided responsibility, but the need\nfor coordination and liaison with CPB appears to be\nclear.)\nC. Criteria for evaluation of ETV applications which request\nconsideration for funding in 1969 (as contrasted with those\nwhich request \"deferral\").\n1. Overall station \"performance?' (demonstrated or proposed)\nshould be a highly weighted priority factor, where\n\"performance\" includes the meanings:\na. Maintenance of a quality signal, including the concept\nof comparability with commercial station signals;\nb. Significant contribution to diverse community program\nrequirements, responsive to contemporary social,\ninstructional and informational needs;\nc. Utilization of diverse community programming resources;\nd. Probability of program production which will be of\nbenefit to substantial audiences through distribution\ntechniques.\n2. Readiness of the applicant to proceed and support the\nenterprise in 1969 and beyond. These indicia should include:\na. Present availability of required matching funds\n(including the possibility of matching at less than the\n75% rate in some cases); non-availability of such funds\nshould be reason for deferral;"
}