{
  "id": "d181-6",
  "text": "(3)\nsuch agency of each application for such a grant which is submitted by\nit to the Secretary, and the Secretary shall advise such agency with\nrespect to the disposition of each such application.\n(d) The Secretary shall base his determinations of whether to approve\napplications for grants under this section and the amount of such grants\non criteria set forth in regulations and designed to achieve -\n(1) prompt and effective use of all educational television channels\nremaining available,\n(2) equitable geographical distribution of noncommercial educational\ntelevision broadcasting facilities or noncommercial educational radio\nbroadcasting facilities, as the case may be, throughout the States, and\n(3) provision of noncommercial educational television broadcasting\nfacilities or noncommercial educational radio broadcasting facilities,\nas the case may be, which will serve the greatest number of persons\nand serve them in as many areas as possible, and which are adaptable to\nthe broadest educational uses.\n(e) Upon approving any application under this section with respect to\nany project, the Secretary shall make a grant to the applicant in the\namount determined by him, but not exceeding 75 per centum of the amount\ndetermined by the Secretary to be the reasonable and necessary cost of\nsuch project. The Secretary shall pay such amount from the sum available\ntherefor, in advance or by way of reimbursement, and in such installments\nconsistent with construction progress, as he may determine.\n(f) If, within ten years after completion of any project for construction\nof educational television or radio broadcasting facilities with respect to\nwhich a grant has been made under this section -\n(1) the applicant or other owner of such facilities ceases to be an\nagency, officer, institution, foundation, corporation, or association\ndescribed in subsection (a)(1), or\n(2) such facilities cease to be used for noncommercial educational\ntelevision purposes or noncommercial educational radio purposes, as\nthe case may be (unless the Secretary determines, in accordance with\nregulations, that there is good cause for releasing the applicant or\nother owner from the obligation so to do),\nthe United States shall be entitled to recover from the applicant or other\nowner of such facilities the amount bearing the same ratio to the then value\n(as determined by agreement of the parties or by action brought in the United\nStates district court for the district in which such facilities are situated)\nof such facilities, as the amount of the Federal participation bore to the\ncost of construction of such facilities.\nRECORDS\nSEC. 393. (a) Each recipient of assistance under this subpart shall keep\nsuch records as may be reasonably necessary to enable the Secretary to carry\nout his functions under this subpart, including records which fully disclose\nthe amount and the disposition by such recipient of the proceeds of such\nassistance, the total cost of the project or undertaking in connection with\nwhich such assistance is given or used, and the amount and nature of that\nportion of the cost of the project or undertaking supplied by other sources,\nand such other records as will facilitate an effective audit."
}