{
  "id": "d181-93",
  "text": "EXCERPT\npp 13-14\n(emphasis added)\np. 26\nUnion Calendar No. 222\n90th Congress ) HOUSE OF HEPKESEKTATiVES ( Report\n1st Session j (No. 572\nPUBLIC BROADCASTING ACT OF 1967\nAugust 21, 1967.—Committed to the Committee of the Whole House on the\nState of the Union and ordered to be printed\nplv..x... -...J — V. ill&xt; Laj\nS. Formula j or matching funds\nThe facility grants may not exceed 75 percent of the amount deter¬\nmined by HEW to be the reasonable and necessary cost of the project.\nThis provision replaces the original restriction limiting the Federal\nshare to 50 percent of the cost of the project plus 25 percent of the\ncost of facilities owned by the applicant on the date of application.\nThe committee was told that the total non-Federal funds required\nto activate a station is beyond the financial capacity of many small\ncommunities—especially communities in areas which would fill in\ngaps in the existing national coverage by noncommercial broadcasting-\nstations.\nIn addition, black and white equipment costs have risen, it is no\nlonger possible for stations to obtain used equipment, and color\nequipment, considered essential for educational purposes, costs\nsubstantially more than black and white.\nMoreover, the activation of stations requires heavy capital outlays\nfor land, transmitter buildings and studios which are not eligible for\nsupport under the present program or this bill. In many instances these\nexpenditures are greater than the matching share of eligible equipment.\nFor these reasons, the committee felt that a Federal share of 75\npercent of the eligible costs more realistically meets the future require¬\nments than the current formula. Considering the ineligible costs,\ngrants even at the maximum Federal share of 75 percent will generally\n(except in the case of small stations) amount to no more than 50\npercent of the total costs. The committee intends that HEW will not\narbitrarily provide grants Tn the~f ufflimo u riF cTT 75> percent \"to\"each\napplicant. Instead, the committee intends that HEW will closely\nscrutinize all applications with a view toward approving only the\nminimum-peLaait^-Qf. .totalallf-r..taking.count .the\nmaximum contribution available from other sources.-In this way, the\nwidest geographical coverage and the maximum utilization of avail¬\nable funds may be obtained.\n/ ~\\rr\\/>Mn rutr S i ~nlntn/>&\nSECTION 104—FEDERAL SHARE\nUnder existing law, the Federal share of the cost of any project is\ndetermined by the Secretary but it may not exceed 50 percent of the\ncost of the project plus 25 percent of the amount the Secretary deter¬\nmines to be the reasonable and necessary cost of any educational\ntelevision broadcasting facilities owned by the applicant on the date\non which it submits an application with respect to a project, with, an\noverall ceiling of 75 percent of the cost of the project. The present law\nalso provides that not more than 15 percent of any grant may be used\nfor the acquisition and installation of microwave equipment, boosters,\ntranslators, and repeaters which are to be used to connect two or more\nbroadcasting stations.\nSection 104 would amend these provisions to establish a simple 75\npercent ceiling on the amount of any Federal grant with respect to\nany project. In this connection, the committee wishes to make it\nclear that it is its intention that Federal grants under this program\nin the maximum amount of 75 percent should be the exception rather\n(emphasis,added)"
}