{
  "id": "d181-94",
  "text": "THE PUBLIC BROADCASTING ACT\nPart IV of Title III of the Communications Act of 1934,\nas amended\nSee Educational Television Facilities Act of 1962\n(P.L. 87-447) and Titles I and II of the Public\nBroadcasting Act of 1967 (P.L. 90-129)\nPART IV - GRANTS FOR NONCOMMERCIAL EDUCATIONAL BROADCASTING FACILITIES;\nCORPORATION FOR PUBLIC BROADCASTING\nSUBPART A - GRANTS FOR FACILITIES\nDECLARATION OF PURPOSE\nSEC. 390. The purpose of this subpart is to assist (through matching\ngrants) in the construction of noncommercial educational television or\nradio broadcasting facilities.\nAUTHORIZATION OF APPROPRIATIONS\nSEC. 391. There are authorized to be appropriated for the fiscal year\nending June 30, 1963, and each of the four succeeding fiscal years such\nsums, not exceeding $32,000,000 in the aggregate, as may be necessary to\ncarry out the purposes of section 390. There are also authorized to be\nappropriated for carrying out the purposes of such section, $10,500,000\nfor the fiscal year ending June 30, 1968, $12,500,000 for the fiscal year\nending June 30, 1969, and $15,000,000 for the fiscal year ending\nJune 30, 1970. Sums appropriated pursuant to this section shall remain\navailable for payment of grants for projects for which applications,\napproved under section 392, have been submitted under such section prior\nto July 1, 1971.\nGRANTS FOR CONSTRUCTION\nSEC. 392. (a) For each project for the construction of noncommercial\neducational television or radio broadcasting facilities there shall be\nsubmitted to the Secretary an application for a grant containing such\ninformation with respect to such project as the Secretary may by regulation\nrequire, including the total cost of such project and the amount of the\nFederal grant requested for such project, and providing assurance satisfactory\nto the Secretary -\n(1) that the applicant is (A) an agency or officer responsible for the\nsupervision of public elementary or secondary education or public higher\neducation within that State, or within a political subdivision thereof,"
}