{
  "id": "d181-98",
  "text": "(5)\n(3) The term \"Secretary\" means the Secretary of Health, Education, and\nWelfare.\n(4) The terms \"State educational television agency\" and \"State educational\nradio agency\" mean, with respect to television broadcasting and radio\nbroadcasting respectively, (A) a board or commission established by State\nlaw for the purpose of promoting such broadcasting within a State, (B) a\nboard or commission appointed by the Governor of a State for such purpose\nif such appointment is not inconsistent with State law, or (C) a State\nofficer or agency responsible for the supervision of public elementary or\nsecondary education or public higher education within the State which has\nbeen designated by the Governor to assume responsibility for the promotion\nof such broadcasting, and, in the case of the District of Columbia, the\nterm \"Governor\" means the Board of Commissioners of the District of Columbia\nand, in the case of the Trust Territory of the Pacific Islands, means the\nHigh Commissioner thereof.\n(5) The term \"nonprofit\" as applied to any foundation, corporation, or\nassociation, means a foundation, corporation, or association, no part of\nthe net earnings of which inures, or may lawfully inure, to the benefit of\nany private shareholder or individual.\n(6) The term \"Corporation\" means the Corporation authorized to be\nestablished by subpart B of this part.\n(7) The term \"noncommercial educational broadcast station\" means a\ntelevision or radio broadcast station, which (A) under the rules and\nregulations of the Federal Communications Commission in effect on the date\nof enactment of the Public Broadcasting Act of 1967, is eligible to be\nlicensed or is licensed by the Commission as a noncommercial educational\nradio or television broadcast station and which is owned and operated by a\npublic agency or nonprofit private foundation, corporation, or association\nor (B) is owned and operated by a municipality and which transmits only\nnoncommercial programs for educational purposes.\n(8) The term \"interconnection\" means the use of microwave equipment,\nboosters, translators, repeaters, communication space satellites, or other\napparatus or equipment for the transmission and distribution of television\nor radio programs to noncommercial educational television or radio broadcast\nstations.\n(9) The term \"educational television or radio programs\" means programs\nwhich are primarily designed for educational or cultural purposes.\nFEDERAL INTERFERENCE OR CONTROL PROHIBITED\nSEC. 398. Nothing contained in this part shall be deemed (1) to amend\nany other provision of, or requirement under this Act; or (2) to authorize\nany department, agency, officer, or employee of the United States to\nexercise any direction^ supervision, or control over educational television\nor radio broadcasting, or over the Corporation or any of its grantees or\ncontractors, or over the charter or bylaws of the Corporation, or over the\ncurriculum, program of instruction, or personnel of any educational\ninstitution, school system, or educational broadcasting station or system.\nEDITORIALIZING AND SUPPORT OF POLITICAL CANDIDATES PROHIBITED\nSEC. 399. No noncommercial educational broadcasting station may engage\nin editorializing or may support or oppose any candidate for political office."
}