{
  "id": "d240-12",
  "text": "in the back of the cage and used it to rake the banana in. Later he needed a longer\nBtick and made one by putting a small stick in the hollow of a bamboo stick. This\nchimp was using \"insight\" and solving problems. But this was an unusual chimpanzee.\nFurthermore, the chimp couldn’t tell the others how to do this. Language is\nnecessary to the accumulation of knowledge. After all, no one person ever solves\nmany new problems himself — he mostly learns thesolutions that have already been\nmade. Therefore the capacity for speech is certainly the most important reason why\nhumans have succeeded in building the varied civilizations that cover the earth.\nDuring the last war, the handbook called \"Survival\" was written for soldiers\nwho were lost in jungles or on ice. It gave many tricks for surviving under such\nconditions. One of the most important lessons was: \"when you're in the jungle try¬\ning to get out, watch for natives. They are a chief means for getting you safely\nout. ... Where you may not know there is food, they find many kinds. ... They know\nplenty you don't know. They can do a lot of things you can't do.\nProbably no native people in the world have a richer technology than the Eskimo,\nwho have many clever devices to survive in the toughest country that man has ever\nconquered. It has taken hundreds of detailed inventions and discoveries to make\nthis possible: the igloo for shelter, snow goggles, wolverine fur around the face\nbecause the breath doesn't condense on it, and so on and on. The Eskimos show us\nwt. ingenuity at its best, and remind us that technical accomplishments are made\nby all people.\nQuestions to Think About:\n1. How did the special knowledge of the Eskimos increase Jim Nelson's chances for\nsurvival?\n2. What things here demonstrate our ability to invent special devices to suit our\nown purposes? What activities have we borrowed from other people?\n3. What factors of the physical environment represent the chief threat to our\nsurvival?\n4. What other factors affect our survival? How do you account for the rapid in¬\ncrease in mental illness in recent years?\n15"
}