{
  "id": "d240-16",
  "text": "Finally, the Hopi religion emphasizes the importance of cooperation; of com¬\nmunity spirit. The hoys are initiated into the Katchina societies and learn these\ngroup beliefs early. The religious associations are important to them throughout\nlife.\nDifferent Way\nThe Hopi shows us a way that is very different from our own. Our culture trains\nus for independence and competition; the Hopi train their children for dependence\nand cooperation. What are some of the things we do that are different?\nFirst off, our children usually live with only one adult man and one adult\nwoman in the same house; and the house is clearly set off from the neighbors. Their\nparents have nearly sole responsibility for the child — for helping him, for giving\nhim support and for punishing him. The family world our young children live in is\nvery different from the Hopi.\nWe believe that the two parents should stand together in matters about their\nchildren; this often means that the child feels he must stand up against them. We\nplace greater responsibility on our children — they learn to restrain themselves;\nthey are expected to do things, to learn things, to bring home some good grades.\nThese are some of the ways we treat our children differently than the Hopi Indians\ntreat theirs.\nEvery people has its own ways of raising their young — their ideas of how to\npunish, when to punish, and who should do it. They have their own attitudes of what\nto expect of their children and at what ages. The things they do in caring for and\nteaching their youngsters will set the pattern of attitudes and behavior; will train\nthem for the kind of culture in which they are to live.\nTeaching Important\nPerhaps you like one way better than another. Or perhaps you like some things\nthe Hopi do, but not others. The most important thing is that we must realize that\nthe way we teach our children is important in determining the kind of adults we will\nhave. Furthermore, this teaching goes on more at home than in the schools; it is a\nproduct of all the different social situations that a child gets into.\n19"
}