{
  "id": "d240-23",
  "text": "cultures.\nAmong the Hindus of India, for example, industriousness is not so im¬\nportant a value as inner tranquility — almost the opposite thing. The symbols of\ntranquility do not include the possession of things but rather the denial of world¬\nly goods. Among the Indians of the Plains bravery and endurance were important\nvalues, and these were symbolized by deeds and the possession of stolen horses.\nA\nPeople everywhere grow up into the culture they are born to. As a youth learns\nthe values of his culture, he is gradually motivated to acquire the symbols of\nthat culture. In trying to get these things, he adjusts his behavior to those\nvalued by his society. He acquires the values because only in that way can he have\nthe things to show that he has the values.\nDifferent Virtues\nWe can show this with any culture, but let's take ancient Athens and Sparta.\nThese two Greek city-states had very different values. In Athens intellectual curi¬\nosity, appreciation of the arts, And participation in political affairs were values\nof greatest importance. They were symbolized by possession of beautiful things,\ngracious living and public office.\nThings were quite different in nearby Sparta. There the most important virtues\nwere self-denial, courage, prudence, Justice and obedience. These virtues were\nsymbolized by the simple life, lack of adornment, physical endurance and ultimate¬\nly membership in a military lodge. Though Athens and Sparta had basically the same\nv-inrt of society, the difference in values made for great difference in the spirit\nof their cultures.\nValues are important in setting the direction and spirit of a people. One of\nthe most important functions of our education is to inculcate the values of our own\nsociety, to inspire the young to acquire those virtues which give meaning to the\nimportant symbols in our society. This is particularly difficult in modern America\nbecause we have such a diverse population — with different cultural backgrounds,\ndifferent modes of life, different occupations.\nTend to Vary\nOur values tend to vary from time to time and place to place, and sometimes\n26"
}