{
  "id": "d240-30",
  "text": "(We have a like system in the United Nations, where we call it the \"power of the\nveto). The Iroquois system worked very well till they disagreed over aid to the\nAmerican colonies against the British, after which the League rapidly disintegrated.\nLimited Scope\nThe Iroquois found one possible means of meeting the problem of authority —\nby giving it limited scope and assuring the full agreement of each tribe by apply¬\ning the rule of unanimity. For if authority is to be given, it must also be checked\nin some manner.\nIn general, this means: (l) that those who administer the rules — those who\nhave authority — should not be the ones to makes the rules, (2) that the people\nthemselves have the power to select their leaders, (3) that there be regular means\nfor the review of actions taken and the recalling of leaders who do not perform ac¬\ncording to public interest.\nWe must remember that authority is necessary for the orderly procedure of\nsocial life, and that this authority always involves the loss of certain personal\nfreedom. It is necessary, therefore, in recognizing authority to provide means of\nlimiting the powers of those to whom they have been delegated by proper means of\nchecks and balances. Only in this way can we prevent authority from becoming au¬\nthoritarianism.\nQuestions tp Think About:\n1. What did you think of the Iroquois Indians and their method for exercising au¬\nthority? What strong points do you see in their way? What weaknesses?\n2. Thinking of your own experiences, in how many situations is there a \"boss\" or\na leader? In your family? On the job? In the Girl Scount or Boy Scout trout?\nIn the organizations to which you belong? Do they make the \"rules\", too? How\ndo they get to be leader? What checks are there on their authority?\n3. Do you really think authority is necessary for the orderly procedure of life?\nHow is political or civic authority exercised? In our county? In the United\nStates?\n5« Do you believe that final authority rest6 with the people? How would you react\n35"
}