{
  "id": "d240-8",
  "text": "instead. So status is another feature of Tlingit culture that goes into the situ¬\nation.\nThe Tlingit think that warfare is a noble art and death in battle is a noble\ndeath. To give yourself up for the sake of the clan is considered the noblest deed\nthat a Tlingit can perform, even higher than death in battle. It assures his soul\na position in the highest heaven of the Tlingit after-life.\nCreate Situation\nCan you see how the patterns of culture create a situation and a way of seeing\nthings that will make a person willing to be the stand-in for a murderer? If you\nwere a Tlingit, you would also be willing to do so. This same thing can be said a-\nbout every custom; all social acts are meaningful in the context of their own parti¬\ncular culture.\nIf we are to understand ourselves, let alone other people, we must appreciate\nthe importance of culture. The customs of one people are always strange to another.\nBut customs are only part of a culture, meaningless unless seen in terms of the\nwhole design of life. Our American customs are part of our American design of life.\nAs we come to understand it, we grow in appreciation of man.\nQuestions to Think About:\n1. Are there any situations in America in which a person would willingly die? If\nyou think there are any, what things would influence him? What kinds of loyal¬\nties would be involved? What attitudes or beliefs might influence him?\n2. What actions in our American culture might seem odd to a people from another\nculture, say the Chinese, or the Tlingit Indians?\n3. Chinese who come to America often find It difficult to understand that a grand¬\nmother would take direction from a mother on how to rear her children, for in\nChina the older a person is the more knowledge he is supposed to have. How\nwould you go about explaining this to a Chinese?\n4. If you know some people who have recently come to this country from foreign\nlands, what differences in their culture, as contrasted to ours, have you\nfound? Can you explain these differences?\n10"
}