{
  "id": "d1350-0",
  "text": "\"n- a- e- b news-letter\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nEdited by Harold A. Engel, President\nStation WHA, Madison, Wisconsin\nAPPRAISE YOUR RESOURCES f\nThe recent announcement made by the Columbia Broadcasting System that it has\nallocated ^200,000 for next season’s School of the Air is an incentive for educa¬\ntional stations to evaluate their own resources. This sum is for the cost of\nactors, musicians, writers and directors, but does not include charges for time on\nthe air. Some 25 men and women are now engaged in research on the school series\nwhich will open on October 6,\nIfi/hat about the talent resources within the staff of every school in the country?\nAuthorities in many fields are available to the educational station which will seek\nthem out and assist in adapting their material to radio. The commercial operator\nmust go out and buy that kind of talent to have it available.\nti our institutions are the really big names in many fields• These are\nstars to be featured by the educational stations. It will usually take considerable\nwork to adapt such talent to a style popular enough to command a sizeable portion\nof the listening audience—-but it is worth the effort.\nYou have resources which our commercial brethren could not afford.\nUse them well.\nOHIO STATE COORDINATES RADIO ACTIVITIES\n“in a further colsolidation of radio activities at Ohio State University,\nPresident Howard L. Bevis recently appointed I. Keith Tyler, Director of Radio\nEducation, as Coordinator of Radio Activities. All radio instruction in the several\ndepartments and schools and at the university station, WOSU, will be integrated by\nthe Coordinator who will work closely with an Advisory Committee composed of each^\n01 the radio instructors and the program manager and director of WOSU.\nAll courses and facilities of instruction regardless of department must be\napproved by the Coordinator under the new set-up in order to make possible unified\nexpansion and development,\nALABMA U REPORTS\n~ ^raydon Ausmus supplements an earlier report on Alabama University’s radio\nbroadcasting, saying that in spite of having a small staff they have put on public\nservice and public relations programs in the last year over 17 stations in the\nstate. He, as director, has a full-time script writer, and part-time student\nassistants as follows; technical, 2 secretarial, 1 production. He has the\nbacking of an advisory committee consisting of the Deans of Arts and Sciences.\nExtension Division, and the School of Law,\nLooking ahead he plans to get wider coverage for his programs, broaden the\nscope of the program service, and secure the participation of a larger number of\nstate service agencies. The development of a University Ftl station is on his\nmind too.\nPUT IT ON YOUR CALENDAR\n----HildilB Convention—-\nSaturday evening, Oct. 25,19ij.7\nSunday, all day, Oct, 26,19i;7\nContinental Hotel - Chicago\nVice-Presidenl Treasurer Executive Secretary Executive Committee\nRobert J. Coleman W. I. Grifiith M. S. Novik Waldo Abbot Michigan Milford C- Jensen. WCAL. St Olaf\nWKAR WOI 30 Rockefeller Plaza John W. Dunn. WNAD. Oklahoma James S. Miles. WBAA. Purdue\nEast Lansing. Mich. Ames. Iowa New York. N. Y. Richard B. Hull. WOI. Iowa State Russell Potter. Columbia"
}