{
  "id": "d1442-0",
  "text": "Alabama Qcdieae\nOn The Ain\nWAPI Birmingham\n1070 On Your Dial\nIN OW BEGINNING its sixth consecutive year on the air, the\nAlabama College Radio Workshop is heard four times weekly over\nStation WAPI, Birmingham. One of these programs, Alabama Mu¬\nsic Time, which is broadcast twice weekly, has been a regular pre¬\nsentation since the modern studios were first installed at Alabama\n\"\"College; and, as an educational feature, serves hundreds of\nschools throughout the state.\nSent directly to the classrooms each Tuesday and Thurs¬\nday morning at 9:45, this program is designed to aid in the\nteaching of public school music in the elementary grades,\nparticipants themselves being pupils in the Laboratory School\nof Alabama College. Miss Katherine Farrah, director of pub¬\nlic school music at Alabama College, is also director of this\nseries; and copies of the year’s schedule are available upon\nrequest by any public school music teacher.\nWorkshop student announces Alabama Music Ti\nTUESDAY EVENING PROGRAMS\nALABAMA WOMAN’S PAGE\nIn November of this year Alabama WOman’s Page made\nits debut as a regular entertainment and educational feature,\npresented at 9:45 each Friday morning. This program pre¬\nsents interesting stories about Alabama, its history, the men\nand women who have featured in its history, its legends and\ntraditions, together with sidelights on Alabama towns and\ncitizens in the news today.\nCollected as a research problem by students in the Radio\nWorkshop, this material is compiled and edited by an ad¬\nvanced student who presents the program with the assist¬\nance of the workshop group.\nTuesday evening programs, which are presented from 8:30\ntill 9:00 p.m., are designed for family groups listening at\nthat time and also feature entertainment of a cultural nature.\nConcerts are presented by students and faculty of the School\nof Music, narrated program notes being furnished by work¬\nshop students; and seasonal and classical music are combined\nto make this one of the most popular local programs on the\nair.\nAlternating with the concerts are drama programs by the\nworkshop group, assisted by students and faculty members\ninterested in the advancement of \"good theater” on the air.\nPlays heard are selected from the works of outstanding mod¬\nern dramatists or from student-written scripts of value.\nAmong outstanding books for which broadcasting privi¬\nleges have been secured are Alice Adams, by Booth Tarking-\nton; Parnassus on Wheels, by Christopher Morley; Alice of\nOld Vincennes, by Maurice Thompson; and If I Had Four\nApples, by Josephine Lawrence. Student-written scripts may\nbe adaptations from the work of well-known authors or may\nbe original as to plot and dramatization. Other plays present¬\ned will be selected from the work of Betty Smith, author of\nA Tree Grows in Brooklyn, Josephine Niggli, and other con¬\ntemporary playwrights.\nSelecting music for Alabama 'Music- 7 im-e-\n(7\n. Scene from Tuesday evening production"
}