{
  "id": "d1442-1",
  "text": "DIFFERENCES BETWEEN THE FCC AND NAEB PLANS\nIt is perhaps useful at this point to consider some of the differences between\nthe assignment plan proposed by the FCC and the one proposed by the NAEB. We wish to\nemphasize first, that we have not looked upon the NAEB plan as a \"rival\" to the FCC's\nproposal. We have considered it from the very beginning as a different approach using\nmore efficient computer techniques and providing a different background concerning the\nvalue of educational reservations. Inasmuch as many institutions may wish to comment\non one plan or the other, it would be helpful to keep the following things in mind.\nConcerning educational reservations, the FCC’s plan has sought to satisfy needs\nwhich have been identified by the NAEB spectrum study and existing state plans for\neducational television development. The NAEB plan has taken a broader view and\nsupplemented the requirements identified in those sources with an extensive study of\npopulation growth patterns and educational needs which have not yet been formalized\ninto an official plan for state-wide development. The NAEB plan provides just over\n1000 reservations (VHF + UHF) and the FCC plan provides about 700 (VHF + UHF). Of\nparticular importance has been the NAEB’s effort to provide multiple channels in large\nmetropolitan areas where developing educational and municipal needs could never be\nsatisfied by one or even two channels.\nConcerning the distribution of channels, the FCC plan has sought to distribute\nassignments rather evenly across the 70 UHF channels, and the NAEB procedures resulted\nin greater use of low UHF frequencies. While the advantage of low UHF frequencies is\nprobably a temporary one, it is important to make an efficient distribution of these\nfrequencies at this point while they are particularly useful.\nConcerning the methods used for determining the Table of Assignments, the FCC\nstaff, which has had to use manual calculations, has been particularly interested in\nthe NAEB approach which used an electronic digital computer. The computer approach\nis valuable not only for the development of the nationwide assignment table, but it\nis perhaps even more valuable because of the additional calculations which can be made\nto solve a variety of problems which may occur from time to time. A good example,\ncited in the NAEB Report, indicated that the problem of finding replacement channels\nfor Channel 37 after it was deleted from the Table took only a few hours, and there\nwas assurance that a variety of potential alternatives could be fully explored. In\nthe solution of a problem such as this using manual procedures, the tendency is to\nsettle for the first solution one is able to make rather than choosing the best\nsolution from a variety of available considerations.\nAs a final note, we should like to point out that comments concerning either\nthe FCC’s Table or the NAEB’s Table should, insofar as it is possible, be made on the\nbasis of the overall plan. It is difficult, we realize, to overlook the fact that a\nparticular channel which had been considered as \"belonging\" to a given location may no\nlonger be there. But careful consideration may have shown that in terms of the nation¬\nwide allocations pattern, moving one channel made it possible to satisfy needs in\nthree or four other communities.\nIn the full report of this study, we emphasized that it is vital that any assign¬\nment plan, at this stage of its proceedings, be considered as a new beginning rather\nthan a new ending. What we will have after these deliberations have been concluded is\na new and better base from which to operate. It is our feeling that while the FCC’s\nproposed plan is a significant improvement over the existing Table of Assignments, the\nNAEB’s suggestion enables us to go several steps further in identifying the availability\nof television channel assignments and in reserving them for a variety of educational\nand community needs."
}