{
  "id": "d1443-0",
  "text": "N A £ B to E W S L E T T £ R\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nA0 James £bel, Editor, Station WILL, Urbana/ III.\nMay 9, 1945\nDRAKE RADIO WORKSHOP\nDrake University’s radio activities are going on in about the same\nPATTERN o They ARE PLANNING A 6»W'EEK3 summer radio workshop again this\nyear. The date of registration is June 99 with the 6-week term ending\nJuly 20. Six hours of credits may be earned in the field of broadcasting\nMETHODS, PROGRAM PLANNING AND PRODUCTION, AND SCRIPT WRITING. STUDENTS\nWILL PLAN, WRITE, PRODUCE, AND BROADCAST SEVERAL PROGRAMS EACH WEEK\nWHICH WILL BE CARRIED BY THE LOCAL RADIO STATIONS KSO AND KRNT AND BY\nWOI of Iowa State College. Total enrollment in radio courses during\nTHE FALL AND SPRING SEMESTERS OF 9044-45 HAS BEEN AROUND 260. We ARE\nNOW OFFERING COURSES IN BROADCASTING METHODS, PROGRAM PLANNING AND\nPRODUCTION, RADIO CONTINUITY WRITING, ADVANCED PRODUCTION PROBLEMS,\nRADIO ADVERTISING, AND ALSO A RADIO SEMINAR.\nW9 SCONS 9M RAO8 0 8 NSTITUTE PLANS\nFor two weeks, from July 29 to August 99 inclusive, the University of\nWisconsin will serve as host to the first institute of its particular\nKIND —A WORKING CONFERENCE DESIGNED TO 8R t NG TOGETHER PERSONS CONCERNED\nWITH THE DEVELOPMENT OF FM EDUCATIONAL BROADCASTING IN THE UNITED STATES.\nThe INSTITUTE IS PLANNED TO GIVE AN OVER-ALL VIEW OF RAOSO EDUCATION’S\nOPPORTUNITIES AND TO PROVIDE HELP ON SPECIFIC PROBLEMS, RANGING FROM THE\nPREPARATION OF AN FM LICENSE APPLICATION TO THE DETAILS OF PROGRAMMING,\nSTATION MANAGEMENT, AND CLASSROOM UTILIZATION. LEADING RADIO EDUCATORS,\nENGINEERS, MANUFACTURERS8 REPRESENTATIVES, AND GOVERNMENT SPECIALISTS WILL\nSERVE AS LECTURERS, DISCUSSION LEADERS, AND CONSULTANTS.\nOH90 STME FM RADIO WORKSHOP\nThe Ohio State University in cooperation with the U. Sc Office of\nEducation, the Ohio State Department of Education and the Cleveland\nBoard of Education has announced the first Educational FM-Station\nWorkshop .\nThe Workshop will meet for five weeks on the Ohio State University campus\nwith the complete resources of the University’s radio station WOSU, its\nTeaching Aids Laboratory, its libraries and its radio personnel available\nFOR THE STUDENTS. ThERE WILL ALSO BE COOPERATIVE WORK WITH CoLUMBUS\nRADIO STATIONS INCLUDING FM STATION WELD.\nThe sixth wnd final week of the workshop will be spent in Cleveland with\nHEADQUARTERS. AT THE CLEVELAND BOARD OF EDUCATION STATION WBOE. All\nCleveland radio stations are cooperating in providing a series of\nVALUABLE AND STIMULATING EDUCATIONAL EXPERIENCES."
}