{
  "id": "d1443-0",
  "text": "1346 Connecticut Avenue, N.W., Washington, D.C., 20036\nVolume IV, Number 19 December 16, 1963\nTHE NAEB UHF ASSIGNMENT PLAN\nEarly in November the NAEB submitted informally to the FCC, the results of its\ncomputer generated UHF Assignment Table.* The report included the rationale for the\ndevelopment of the plan and a nationwide Table of Assignments which listed all operating\nand CP facilities as well as those additional channels which were assigned by the\ncomputer.\nAlthough the NAEB recommended to the FCC that it adopt the plan included in the\nreport, it suggested as an intermediate step that the FCC issue the NAEB plan as an\nalternate to its own proposal which had been released about two weeks earlier. Ihis\nis the first time that such a plan, developed largely in consultation with FCC\nengineers and according to all pertinent rules and regulations, was available to be\nconsidered as an alternate solution to the problem of television channel allocation.\nWith both plans issued for comments, the NAEB suggested, interested parties would\nhave an opportunity not just to indicate their reaction to one plan, but to express\na preference for one plan or another.\nThe FCC staff has studied the NAEB proposal carefully and has requested that\ncertain additional analyses and summaries of the computer assignment be prepared for\nfurther study. These materials were submitted and it now appears there is a very\ngood chance that the FCC will issue the NAEB plan as an alternate proposal to its own\nTable, thereby enabling comments to be filed directly concerning the NAEB Assignment\nPlan. If this is done, the Commission will probably also extend the date for filing\ncomments from January 3, 1964, to the first part of ^rch.\nWHO SHOULD BE CONCERNED\nIt is easy to think of problems of television channel allocations as a technical\nmatter which might well be left to engineers. True, these matters are technical in\nnature, but the impact of expeditious technical decisions on the future growth of all\nforms of broadcasting is a measure of the importance which educators themselves must place\non this particular proceeding. Any organization which has already had an opportunity\nto confront commercial interests who oppose the reservation of a given television\nchannel realizes the importance of preserving now the educational requirements for\ntelevision channels which can reasonably be predicted for the future. There are a\nnumber of instances where such reservations were not made in the past, and each one\ndemonstrates the wisdom of developing an assignment plan which considers at this time\nlong range educational needs, even though they may not be fully matured for the next\nseveral years.\n*If you have not received copies of the complete NAEB report, they are available from\nthe Washington office and will be sent upon request."
}