{
  "id": "d1443-3",
  "text": "NAE8 NEWS LETTER\nPage 4\n.May I, 1945\nCaptain William C„ Eody, U.S.N. (Ret.) Director, WBKB, and George Jennings\nActing Director, Radio Council - WBEZ, Chicago Public Schools, will speak\non television at the Western Arts luncheon,, Saturoay, May 12.\nWNYC TO RECEIVE SPECIAL CITATION FOR \"PATRIOTIC SERVICEH\nFor the first time in its 150-year history, the Sons of the american\nRevolution are presenting a special citation \"For Patriotic Services\nrendered New York City Home Front\" to WNYC today (Thurs. April 12).\nNever before has S.A.R. ever made a presentation such as this to a\nRADIO STATION, OR INDEED TO ANY OTHER ORGAN I 2 AT I ON—THE WNYC CITATION\n8EING A \"FIRST\" IN ALL RESPECTS.\nTHIS AND THAT\nRobert St. John, NBC London correspondent visiting his sister, Mrs,\nDorothy S„ Cooke, in Ames, conferred with WOI officials on postwar\neducational broadcasting plans and was interviewed on his war experiences\nin Greece by W01 News Eoitor Sob Mulhall....Carl Menzer has been maoe\nhonorary Chief of Police of Iowa City, Iowa. Gad, what that town is\ncoming to....WBKY is surveying its audience on its regular Monday and\nWednesday evening FM broadcasts....Elmer, how about some info on WBKY—\nequipment, results, staff, etc?....All of the naeb stations participated\nIN THE FITTING TRIBUTE TO OUR LATE PRESIDENT, FRANKLIN DeLANO ROOSEVELT.\nSpace does not permit recounting all the fine shows originated during\nTHIS PERIOD OF MOURNING....HlGGY OF 0HIO STATE, HAS PASSED ALONG PROF.\nSmith's Clear uhannel Allocation Proposal. If your engineer is interested\nDROP ME A LINE AND 1 0 LL FORWARD A COPY. PROF. SmITH IS ASSOC. PROF. OF\nE. E. at Cornell....It will be KUOM, University of Minnesota, starting\nJune 1. I'll lay some oough that the announcers will be WLBing all over\nTHE PLACE FOR A FEW DAYS....JfM MILES OF WBAA js GOING TO USE LIGHTER\nMUSIC ON HIS DINNER HOUR PROGRAM .... Nat Erwjn, THAT RECONVERTED OKLAHOMA\nCOWBOY, WAS BACK TO VISIT HIS OLD HAUNTS IN CHAMPA IGN-UrBANA. He REPORTS\nMUCH ACTIVITY AT WNAD.\nFCC ACTIONS\nKALW 8oard of Education of San Francisco Unified School Oistrict had it's\nFM LICENSE EXTENDED ON A TEMPORARY BASIS ONLY, PENDING DETERMINATION ON\nAPPLICATION FOR RENEWAL, FOR THE PERIOD ENDING JULY i, I 945, SUBJECT TO\nCHANGES IN FREQUENCY ASSIGNMENT WHICH MAY RESULT FROM PROCEEDINGS IN\nDocket 6651.\nThe Board of Education of Newark in the Bounty of Essex Newark, has\nAPPLIED FOR A CONSTRUCTION PERMIT FOR A NEW EouCATIONAL STATION TO BE\nOPERATED ON 42,500 KC, 1 KWe\nWLB HAS BEEN GRANTED PERMISSION TO CHANGE CltLL LETTERS TO KU0Mo\nSacramento city Unified School °ist. of Sacremento Calif., has had its\nAPPLICATION FOR NEW EDUCATIONAL FM STATION PLACED IN PENDING FILES.\nState Teachers College at West Chester, Pa., has applied for construction\npermit for Ed"
}