{
  "id": "d1541-3",
  "text": "Pointing to the two-thousand-plus trade journals in\nthe USA, author Vic Danilov concluded that “Almost\nevery story . . .is a potential item for some special\npublication.”\nTrade magazines are more varied than radio-TV\nprograms, and that’s saying a bit. They cover agri¬\nculture, business, foreign affairs, professions, scholar¬\nship and technical fields beyond belief. (Example: if\nyour transmitter catches fire, one group of magazines\nis interested in how you put out the blaze; half of\nthese are devoted to volunteer fire-fighting opera¬\ntions, the rest to full-time professional firemen.)\nTrade journal readers, explains Danilov, are a\nbreed apart for the publicity man. “They read nearly\nall the advertising and editorial copy, and they file—\nrather than discard—each issue.”\nSome of the major references to the trade press\nare: N. W. Ayers Directory, The Writer’s Market\n(annual), and The Working Press-Magazines.\nFUND FOR ADULT EDUCATION\nANNOUNCES FELLOWSHIP AWARDS\nFellowships totaling $205,000 were recently awarded\nto 40 broadcasters, educators, and newspapermen by\nthe Fund for Adult Education, enabling them to\nstudy for up to one year at institutions and agencies\nof their choice.\nThe Fund is an independent organization estab¬\nlished in 1951 by the Ford Foundation. In 1956\ngrants were opened to include newsmen, radio and\nTV personnel, and university faculty members teach¬\ning in mass media. According to C. Scott Fletcher,\npresident of the Fund, this extension of the program\nto the mass media now encompasses 50 per cent of\nthe annual grants program.\nRecipients of the awards were determined by a\nNational Selection Committee. Among those serving\non the committee were Howard Johnson, executive\ndirector of KRMA, Denver; Edward Stanley, direc¬\ntor of public affairs at NBC; and Ralph Steetle, ex¬\necutive director of the Joint Council on ETV.\nThose who received fellowships in mass media in¬\ncluded: Colin D. Edwards, news broadcaster and\ndocumentary producer for KPFA, CBS, ABC and\nNZBS; Sam L. Becker, director of the division of\nTelevision-Radio-Film, State University of Iowa;\nEthelbert A. Hungerford, director of operations at\nMETA; and John S. Clayton, production director,\nDepartment of Radio, TV and Motion Pictures, Uni¬\nversity of North Carolina.\nt\nOther mass media recipients included: James W.\nSanders, radio-TV instructor at Alabama Polytechnic\nInstitute; Richard E. Mansfield, Jr., staff producer-\ndirector, WTTW-TV; Mrs. Doris Karasov, volunteer\ncommunity leader; Wayne M. Carle, journalism in¬\nstructor at Brigham Young University; anfl Miss\nDorothy E. Miniace, radio-TV coordinator for Uni¬\nversity of Wisconsin.\nEDUCATIONAL BROADCASTING\nMOURNS DEATH OF TWO\nWe deeply regret the deaths of two men who were\nactive in educational broadcasting. Wallace Garneau,\na long-time member of NAEB, died of cancer the\nlast week of February. He, was director of educational\nradio station WMRC at Western Michigan Univer¬\nsity, Kalamazoo.\nMitchell Gerbick, 39, of Gary, Ind., died March 2\nafter a lingering illness. Mr. Gerbick was a member of\nthe faculty at the Purdue University Calumet Cen¬\nter in Hammond. He previously taught in the Gary\nPublic Schools and in 1953 was named the school\nsystem’s manager of the educational radio station at\nLew Wallace High School.\nNEW YORK LEGISLATURE\nAPPROVES ETV PLAN\nThe New York state legislature recently approved a\nplan for financing the state’s first full-scale ETV\nproject through the facilities of station WOR-TV in\nNew York City. The station last month agreed to\nmake its daytime facilities available to the state\nBoard of Regents for educational telecasting starting\nSept. 1.\nUnder the proposed plan, WOR-TV will be\nutilized as an educational station from 9 a.m. until\n5 p.m. on weekdays and from 9 a.m. to noon on Sat¬\nurdays. At other times the station will continue to\noperate as a commercial outlet. The state education\ndepartment will direct the ETV programs, designed\nboth for classroom and the general public.\nWith approval of the plan, it was estimated that\nthe first year of programming will cost almost\n$370,000. Thomas F. O’Neil, president of RKO Tele¬\nradio, which owns the station, and Jacob L. Holtz-\nman, chairman of the Regents’ television committee,\nsaid that WOR-TV agreed to make no charge for\ntime used but that the state would pay operating\ncosts.\nNEWSLETTER"
}