{
  "id": "d1541-5",
  "text": "ANNIVERSARIES OBSERVED\nRadio station WBGO, Newark, N. J., will observe its\ntenth anniversary in educational broadcasting with\na special program on April 16. Board of Education\nPresident Morris Fuchs asks that NAEB members\nsend congratulatory messages to be read on the\nspecial program observance featuring Gov. Robert\nB. Meyner as guest speaker. Communications may\nbe addressed to Fuchs in care of WBGO.\n*****\nA two-hour program was broadcast March 24 by\nradio station KBPS, Portland, Ore., in a special ob¬\nservance of its 35th birthday. The program, produced\nby Fred Warner, featured guests from the city,\nschools and community to celebrate the station’s\nstart in educational broadcasting.\nHOUSE PASSES\nIMPORT BILL\nThe House of Representatives passed a bill Feb. 27\nthat should prove beneficial to educational broad¬\ncasting. Known as the Eberharter Bill, it will permit\nthe importation of tapes and recordings without duty\nwhen they are used for educational purposes.\nAccording to NAEB attorney Leonard H. Marks\nof Cohn and Marks, it is hoped that the Senate will be\nable to consider the bill this season so that it may be¬\ncome effective immediately.\nWASHINGTON U. GIVES\nCIVIC EDUCATION BY TV\nWashington University last month established a Civic\nEducation Center to help increase understanding and\ndisseminate information about metropolitan prob¬\nlems, partially by means of an informal, non-credit\nTV program.\nThe center will develop television broadcasts for\ngroups of people situated at “viewing posts” through¬\nout metropolitan St. Louis. The first of its kind, it\nwill be a pilot project for the entire country in the ef¬\nfective use of TV for adult civic education.\nEugene I. Johnson, director of civic education and\nTV activities at the university, has been named di¬\nrector of the center, which will function with an all¬\nuniversity advisory committee. The center will seek\nto develop new techniques for spreading knowledge\nabout modern urban problems in areas of economy,\ngovernmental structure, history, culture and the\nmove to suburbs.\nThe idea of audience participation by means of\norganized “viewing posts” was introduced to the St.\nLouis area for the first time this fall with a series of\nnine TV programs over KETC. Issues raised during\nthe half-hour program were discussed by people\ngathered in groups of six to sixteen at “viewing posts”\nthroughout the metropolitan p,rea.\nNEW ITHACA ETV\nUSES CABLE SYSTEM\nIthaca (N. Y.) College opened its new WICB-TV\nstudios and started its broadcasting schedule last\nmonth with programs distributed over a local coaxial\ncable system. The community cable serves approxi¬\nmately 15,000 viewers in homes and business places\nof the area. ETV programs are offered from 8 to 9\np.m. Monday through Friday when the college is in\nsession.\nThe operation of WICB-TV marks the first local\norigination of television programs in the Ithaca area\non a regular basis. Prof. Royal D. Colie, chairman\nof the television-radio department, said the schedule\nhas been designed' to present information and enter¬\ntainment programs which will supplement the offer¬\nings of commercial stations, and to serve as an outlet\nfor community expression.\nWTCB also opened its FM studios to provide the\ncollege with modern equipment in both radio and\nTV. Students use the studios in closed-circuit class\nwork and assist in producing programs.\nWE BEG YOUR PARDON!\nThe program series described in the February\nNewsletter on page 2 had' one word of its title\nomitted. It should be corrected to read, “Man Is\nNot a Thing.”\nNEWS OF MEMBERS\nGENERAL\n^ Station WKAR-TV of Michigan State University\nhas been presented a certificate of recognition by the\nIngham County (Lansing) Medical Society. The\naward, made during the WKAR-TV program “Medi¬\ncal Forum,” cites the university station for “an out¬\nstanding contribution to public knowledge in the\nfield of medicine.” “Medical Forum” is produced in\ncooperation with the medical society and other Mich¬\nigan health groups and organizations.\n^ Results of a survey conducted by the Alabama\nETV Commission indicate that there are 455 televi-\nNEWSLETTER"
}