{
  "id": "d1541-9",
  "text": "SCHOLARSHIPS AND\nSUMMER STUDY\nThe Fund, for Adult Education is offering approxi¬\nmately 20 grants for study and training to individuals\nassociated with mass communications. An independ¬\nent organization established by the Ford Foundation,\nthe Fund is used to broaden and better the contribu¬\ntion of the mass media to liberal education for adults.\nEach grant will be in an amount determined by the\nFund to be adequate for the recipient to accomplish,\nwithin one year, any program of study and/or prac¬\ntical experience which he deems appropriate for his\nown improvement. Deadline for application is set\nfor Oct. 15. Details of this program may be obtained\nby writing to Leadership Training Awards (Mass\nMedia), The Fund for Adult Education, 200 Bloom-\ningdale Road, White Plains, N. Y.\n*****\nA summer Symposium in Color Television at North¬\nwestern University is slated concurrently with the\nUniversity summer session, June 23 to August 2. It\nwill be presented in cooperation with NBC and its\nChicago station, WNBQ, and offers three quarter-\nhours of credit. Designed to orient TV station staffs\nand students to the special problems of broadcasting\nin color, the symposium will feature directors and\nsupervisors and color specialists for discussion of these\nproblems. Coordinators of the symposium are Assoc.\nProf. Charles F. Hunter of Northwestern and Mrs.\nBetty Ross WTest from WNBQ.\n*****\nNBC Internships are also offered this summer by\nNorthwestern’s Department of Radio, Television,\nand Film, NBC and' station WNBQ. A limited num¬\nber of interns will spend six weeks rotating through\nthe operational divisions of programming and pro¬\nduction, and will participate in discussion sessions\nwith the station’s administrative personnel.\nThe H. V. Kaltenbom Radio Scholarship of $600\nfor the academic year is open to any student of junior\nstanding attending or entering the University of Wis¬\nconsin in 1958-59, with an interest in some phase of\nradio broadcasting, especially in news and news an¬\nalysis. Deadline for applications is set at May 1. In¬\nquiries should be addressed to Prof. H. L. Ewbank,\nin care of the university’s Department of Speech.\n*****\nMore than 25,000 scholarships for foreign study\nare listed in the new 1958 Handbook on International\nStudy, recently published by the Institute of Inter¬\nnational Education. This is a complete guide on in¬\nternational education with information on specific\nfields of study desired, in addition to the listing of\nawards and grants of more than 250 different scholar¬\nship programs. The Handbook is $3.00 and may be\nobtained from the Institute at 1 East 67th Street in\nNew York City.\nPLACEMENT SUPPLEMENT\nApril I — Producer-director with three years experience in\nETV and commercial stations would like a position with an\neducational TV station. Extensive background covers di¬\nrecting, producing, writing, work as on-camera talent and\nin film and set design. Male, 33, single. Prefers city over\n200,000 or university town. $5,800-7,000.\nApril 2 — Twenty-three-year-old English woman, single, M.A.\ncandidate, seeks any position in educational broadcasting,\npreferably starting in September. Experience includes\njournalism and teaching both in an English school and\nAmerican university, audience research work with the B.\nB.C. Licensed teacher. Location and salary open.\nApril 3 — Male, married, 32, August candidate for Ph.D.,\npresently teaching university television courses, desires uni¬\nversity position teaching TV production and direction,\npreferably with the opportunity to work on station staff.\nExperienced in all phases of production; has done all kinds\nof programming. Will locate anywhere but South, except\nFlorida. $5,200 for nine months.\nApril 4 — Young man, 22, married, draft-exempt, with M,.S.,\ndesires immediate position as producer-director or in pro¬\nduction department of ETV station. Has had extensive\nexperience at one of nation's finest ETV stations in direct¬\ning and camera work; radio background includes an¬\nnouncing and production. Location open. $4,500.\nApril 5 — Experienced producer-director of radio, TV, and\ntheatre seeks summer workshop or year-round position in\neducational broadcasting. Fifteen-year background covers\nwork in all phases of production, includes network program\ndirecting experience and various executive or managerial\npositions. Male, single, 39, M.A. Location and salary\nopen.\nApril 6 — Successfully employed TV producer-director at\nmetropolitan network affiliated station desires university\nsituation teaching radio-TV and doing actual production\nwork. Eight years professional background; good know¬\nledge of all types of music; strong on documentaries.\nMale, single, 36, M.A. Prefers southwest location but will\nconsider others. $7,000-8,000.\nApril 7 — Executive producer-director with solid backlog of\ncommercial radio-TV credits wants to put his experience to\nwork for educational purposes. Diversified background in¬\ncludes music consultation, script writing and editing,\ntalent selection and supervision, budgeting, and hiring,\ntraining and supervising employees. Male, 54, single. Pre¬\nfers San Francisco area but will consider others. $8,000-\n12,000.\nApril 8 — News and special events director seeks teaching or\nstaff position in ETV. Has five years experience in foreign\nbroadcasting; wrote and produced for NAEB; now pro¬\nduces and conducts public affairs interview ETV program.\nWill cover World's Fair this summer. Male, single, 34,\nM.A. Prefers New England, South, or Pacific Northwest.\n$6,000-7,000.\n10\nNEWSLETTER"
}