{
  "id": "d1090-0",
  "text": "THE'PRESIDENT'S PAGE\nFebruary, 1955\nDear NAEBers:\nNo one complained about my efforts last month, so I guess I'll try this page again\nIf you have any complaints, please feel free to express yourself to me. If you\nhave praise-, thanks now, and we'll both save time. Barring complaints, I'll try\nto keep plowing ahead.\nAnd that reminds me that some of you radio people are rather quiet. You know\nNAEB is both radio and television. The Newsletter needs more news about educa¬\ntional radio. The absence of news is mostly your fault for not letting head¬\nquarters have some good stories. What new program series are you doing, what new\nresults do you have on utilization, what changes in facilities, in staff have you\nmade?\nSkornia served as chairman of a sectional meeting, Speech Conference, held in\nChicago in late December. Topic was \"What to Teach in Television Courses.\" On\nthe panel were NAESer-affiliated members such as H. Clay Harshbarger, Iowa; Joe-\nNorth, Iowa State; Judith Waller, NBC; Glen.Starlin, ETRC and Oregon; and\nStanley Donner, Stanford.\nBurton Paulu's committee is at work on securing invitations and in making recom¬\nmendations to the Board for the 1956 convention site.\nI think there'll be news on the 1955-56 grant-in-aid in the next issue of the\nNewsletter.\nRight here at home, Illinois is getting lots of inquiries about the Payne Commun¬\nications Awards in television script writing.\nSy Siegel and his International Relations Committee are already at work on the\nPrix Italia contests and awards for 1955* The Board, or Executive Committee,\nwill be giving special consideration to this shortly. But if you have an out¬\nstanding program, or idea, now's the time to do something with it. Deadline will\nbe July 1. Details in the next issue at the latest.\nBob Coleman is getting some more fire under his Research Committee and we'll be\nhearing more within the next month. Now don't misinterpret my more-fire comment.\nThat committee has been and is a good one. I just happen to know that Bob is\nplanning more work, and that's good.\nCarl Menzer is unusually busy with his Engineering Committee. He must be, he's\nnot coming over here to see the Illinois-Iowa basketball game next month.\nAnd really talking about being busy, Treasurer Coleman is busier than Chairman\nColeman. There's lots of work in being Treasurer, and Bob is off to a good, if\nbusy start.\nMentioning the Treasurer reminds me that pages 3 and 4 of the President's Page\nwill be the final financial report (I hope) from the writer. Books have been\nturned over the Coleman, and when final check clears the bank here, the balance\nwill be sent to Bob. Incidentally, I apologize to any and all on whom we may.\nhave made a billing error. We made some, and where we did I’m happy and willing\nto personally apologize. And, we'll rectify the mistakes. It vas just a.little\nrough with various duties, and with books back and forth between this office, the\nauditor, and the secretarial help."
}