{
  "id": "d1384-1",
  "text": "-2-\nmay become available from members of the association. At the moment we are in no po¬\nsition to reciprocate, but perhaps some day we will be able to make a contribution\nto the pool,”\nTHE FOLLOWING IS A LIST OF REASONS T®Y STATION ^TLL DOES NOT SELL TIME, IHESE \"TOE\nSENT IN BY MR. JOE F. ^'^RIGHT, DIRECTOR.\n”1. In the first place this is a tax supported institution and we carry on no activ¬\nity T^hich might be considered as competition for any line of business in the state.\nOf course we must dispose of our surplus agricultural products, including milk, butter,\neggs, etc., but all such items are sold at a price higher than the local market,\n”2. Education and commerce simply do not mix. While it would not be true that to\naccept an advertisement v/ould mean the University v/ere endorsing that particular pro¬\nduct, the inference would be there and it would certainly be harmful to 1he best\ninterests of all concerned. Any tests made in our laboratories or any research work\ncarried on is done for purely scientific purposes and even thou^ one line of pro¬\nducts, or one make of a machine proves to be superior to another, that information is\nnever allowed to be used in a commercial way,\n”3. We feel that the use of advertising would cheapen any educational broadcast we\nmight render. Advertising over a commerical station may be all ri^t in the eyes of\nmany people, but in the eyes of those who are concerned primarily with education it\nis not all right. For instance, I learned yesterday that one of our medical men had\nbeen offered by a commercial concern as high as $600 per talk for a series of dis¬\ncourses on a certain subject. He does not feel that he should acquiesce to the\ninvitation because of his commercializing his knowledge. There are doubtless other\nreasons, but these three are foremost in my mind,”\nm. J. 0. KELLER, CHAIRMAN OF THE RADIO COMIVELTTSE OF THE NATIONAL UNIVERSITY EXTEN¬\nSION ASSOCIA-TION, PENNSYLVA^JIA STATE COLLEGE, STATE COLLEGE, PENNSYLVAi^IA, HAS SENT\nOUT THE FOLLODTNG LETTER: \"You are all familiar with the fine lectures that are\nbeing broadcast on a country wide network, under the auspices of the National Advis¬\nory Council on Radio in Education. The lectures cover topics of interest in both\nEconomics and Psychology and are broadcast by the National Broadcasting Company,\n”Just recently a new series has been announced, starting March 19th and continuing\nuntil May 21st, The Director of the National Advisory Council on Radio in Education,\nDr. Levering Tyson of 60 East 42nd Street, New York City, will be glad to cooperate\nin any way with you in furnishing printed copies of the addresses for distribution\namong students, or in other ways suggested by you. The University of Chicago has\ntaken advantage of this opportunity and many resident teachers in Economics and\nPsychology are using these copies throughout the country,\n’’While the National Advisory Council may not have the correct solution to the problem\nof Education by Radio, certainly these fine broadcasts are of such splendid character\nthat 7/e should cooperate with them in this program to the fullest extent possible.\n”Mr. Bittner, President Cavanau^, Dr. Tyson, and myself will be glad to give any\nfurther informant ion that may be wanted by you.”\nTHE FOLIO WING LETTER IS FROM m. J. C. JENSEN, DIRECTOR, RADIO STATION WCAJ,\nNEBRASia WESLEYilT UNIVERSITY, LINCOLN, NEBRASKA: ”Your bulletin. oY March 16 has just\nbeen received. It is gratifying to see the splendid response wuich is being re¬\nceived from so many of the colleges, and to learn that so many of them are sending\nto their Representatives in Congress a statement of facts regarding their broad¬\ncasting stations. This should be an effective method of molding opinion if the Fes.b\nBill ever gets through the Committee so that a vote can be hade\n”In another bulletin perhaps you should pass along to our members the fact that the"
}