{
  "id": "d1744-0",
  "text": "A-E-B NEWS - LETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nEdited by Harold A. Engel, President\nStation WHA, University of Wisconsin, Madison, Wisconsin\nOctober 3 s 194-7\nEDUCATIONAL STATIONS NEEDED-TALKER\nCommissioner Paul A, Walker9 vice-chairman of the FCC, looks to the educational\nstations of the country as a force for the betterment of radio. In a recent letter\nhe said*\n\"It is my personal opinion that educational broadcasting stations\nwould be a tremendous impetus to broadcasting generally and would\nencourage and assist commercial stations through developing\nlistening habits and greater audiences”•\nContinuing, he said: \"There is no proper conflict between educational\nand commercial broadcasting\"*\nThe advent of FM, with abundant facilities assignments in most areas, has\nremoved the real sore spot. The FCC, in its wisdom of providing a block of\nfrequencies for non-commercial use, has paved the way for greater cooperation\nbetv/een broadcasters in the interests of the listeners*\nIn\nLET* S PUSH ITl\nRecords of the FCC last week indicated the following as the status of non¬\ncommercial educational FM stations in this country*\n6 licenses\n36 construction permits\n6 applications pending\nAre we doing all we can to take advantage of our FM opportunity?\n\"NO\"* SAYS MILLER\nCommissioner Clifford J* Durr asked President Justin Miller of the NAB if his\nAssociation is \"taking an official stand in opposition to the establishment and\noperation of educational broadcasting stations by state universities and colleges\nand public school systems.\nMiller said, \"Definitely, 'No',\" in a September 26 NAB release.\nWe're still waiting for an explanation of NAB attitude toward the commercial\nbroadcasters' actions last spring which sabotaged the University of California's\nattempts to build non-commercial educational FM stations for public service*\nCODES AGAIN\nBefore the convention applause has died away, there are rumblings o± grave\ndissention over the proposed \"code\" for broadcasters.\nThrough the years self-improvement codes have come-and been virtually for¬\ngotten except to be dusted off and proudly hailed or re-adopted when critics appear\non the scene. Now we have another code-—replete with the ghosts of the past.\nThe effectiveness, in practice, of such codes is well illustrated in the Blue-\nBook studies. Don't expect much from this-or any other code——which is not\nfortified with strong enforcement provisions.\nVice-President\nRobert J. Coleman\nWKAR\nEast Lansing, Mich.\nTreasurer Executive Secretary Executive Committee\nW. I. Griffith M. S. Novilc Waldo Abbot, Michigan Milford C. Jensen, WCAL. St. Olaf\nWOI 30 Rockefeller Plaza John W. Dunn, WNAD. Oklahoma James S. Miles. WBAA. Purdue\nAmes, Iowa New York, N. Y. Richard B. Hull. WOI. Iowa Stale Russell Potter, Columbia"
}