{
  "id": "d1595-2",
  "text": "nasb mm letter...June i, i940....?age 3\ncommercial educational stations has been retained, the only change\nbeing that the position of such stations has been moved 1,000\nkilocycles higher in the spectrum. This arrangement permits the same\nreceiver to be used for the two services. The three educational\ninstitutions now authorized to use amplitude modulation in the non¬\ncommercial band can continue to do so, but the Commission hopes that\nsubsequent applicants for non-commercial educational broadcast\nfacilities will find it economic and otherwise preferable to utilize\nPM.\nApplications for PM broadcast stations will be considered by the\nCommission when revised rules and regulations are promulgated, and\nnew application forms made available. Meanwhile, pending applications\nfor high-frequency broadcast stations on an experimental basis, filed\nunder the old rules and regulations, will be dismissed without\nprejudice and the way opened to file new applications for either\nexperimental or regular PM broadcast stations, which may include the\nsimultaneous transmission of facsimile programs, when the new regul¬\nations are announced. Likewise, authorization of existing high-\nfrequency experimental stations are terminated by January 1 next,\nalso without prejudice, for the filing of new applications for either\ntype of service.\nHO >7 FREQUENCIES V/ERE REALLOCATED\nReadjustment of the ultra-high radio frequencies to provide the 40 FM\nchannels between 40,000 and 50,000 kilocycles, as well as seven\nchannels below 108,000 kilocycles for television service, is pursuant\nto allocations contained in Coma is sion Order No. 67.\nThe solution to finding space in the crowded radio spectrum for the\nneeds of these two services was achieved with the cooperation of the\nInter-department Radio Advisory Committee in shifting Government\nfrequencies. This committee, representing 13 Federal agencies,\nadvises the President in allocating radio channels for Government use.\nThe arrangement gives private services priority rights between\n60,000 and 66,000 kilocycles and between 118,000 and 119,000 kilo¬\ncycles in exchange for relinquishment to the Government of the bands\n41,000 to 42,000 kilooycles and 132,000 to 140,000 kilocycles.\nIn addition, the Commission discontinued television service in the\npresent television channels Nos. 1 and 8 (44,000 - 50,000 kilocycles\nand 156,000 - 162,000 kilocycles respectively). Accordingly, old\ntelevision channel No. 2 will be renumbered television channel No. 1;\nand a new television channel No. 2 will be assigned from 60,000 to\n66,000 kilocycles. Former television channel No. 8 (156,000 - 162,000\nkilocycles), together with frequencies between 116,000 and 119,000\nkilocycles, will be used to replace the assignments in the band\n132,000 to 140,000 kilocycles. There is no change in the other eleven\nchannels comprising the 162,000 to 300,000 television band.\nThe new allocations become effective immediately on a limited basis.\nAfter January 1, unlimited operation may be authorized. Regular\ncommercial service employing wide-band FM, which may include the\nmultiplexing of facsimile transmission sinultaneously with aural\nbroadcasting, will use the 43,000 to 50,000 kilocycle band, and non-"
}