{
  "id": "d1703-1",
  "text": "Thirty-six replies were received, of which 28 were affirmative: Alabama, Arkan¬\nsas, California, Hawaii, Idaho, Illinois, Iowa, Maryland, Massachusetts, Michigan,\nMinnesota, Mississippi, Missouri, Montana, Nebraska, New Jersey, New Mexico,\nNorth Carolina, New York, Oklahoma, Oregon, Pennsylvania, Rhode Island, South\nDakota, Tennessee, Vermont, Washington, and the Commonwealth of Puerto Rico.\nEight replies were indefinite: Alaska, Delaware, Kansas, Maine, Nevada, New\nHampshire, Ohio, and the District of Columbia. (This report was made by Chm.\nMoulder. Since the above tally Ohio, for one, has filed a favorable reply.)\n(In this connection, we want to thank all NAEB members in the several states who\ncooperated with Headquarters in urging the Governors to reply to Chm. Harris’ letter.)\nSecretary Ribicoff, in his testimony, remarked favorably on the results of the sur¬\nvey and pointed out that in at least five of the states from which no reply was receiv¬\ned one or more ETV stations are already in operation: Colorado, Florida, Kentucky,\nLouisiana and Utah.\nPRESIDENT RECOMMENDS EXTENSION OF NDEA\nOn April 25, President Kennedy sent to Congress recommendations for continua¬\ntion and modification of the National Defense Education Act, and enclosed an analysis\nby Secretary Ribicoff of HEW. Proposed legislation recommends that the student loan,\nfellowship, language and statistical improvement programs be made permanent; equip¬\nment grants, grants for guidance and counseling and grants for educational media\nresearch should be extended for another three years to permit reappraisal after the gen¬\neral education aid programs have gone into operation. Re Title VII extension Ribicoff\nwrote: “During the next few years it will be possible to conclude exhaustive studies\nnow underway of the relationship of the several media to the improvement of instruc¬\ntion. We can then reach sounder conclusions with regard to the future direction and\ncontent of this program.”\nFM STEREO TRANSMISSION\nOn April 19, FCC amended its rules, effective June 1, to permit transmission of\nstereophonic programs by FM broadcast stations on a multiplex basis. The system\nadopted is substantially the one proposed by Zenith and General Electric. Stereo¬\nphonic broadcasting will be accomplished by means of a subcarrier multiplex system\nin conjunction with the main channel operation of FM stations.\nThe amended rules do not apply to noncommercial educational FM stations at\npresent. NAEB is filing a petition to have the rules amended to extend to this class\nof stations as well. Meanwhile, EFM operators wishing to begin stereophonic trans¬\nmission immediately may file for special temporary authority.\nFCC REORGANIZATION PLAN\nPresident Kennedy, on April 27, sent a message to Congress calling for a phan\nto reorganize the FCC to give the agency greater flexibility via streamlining of routine\nprocedures and greater delegation of authority. Plan would give Chm. Minow greater\npower in acting for the Commission in assigning cases, give staff more responsibil¬\nity for making lower-level decisions."
}