{
  "id": "d1703-2",
  "text": "FCC ACTIONS\nApril 19 the Commission amended table of assignment by reserving for education¬\nal use Ch. 10 (formerly commercial) in Augusta and Presque Island, Maine. Proceed¬\nings stemmed from petition of U. of Maine to reserve Ch. 10 as part of state-wide\neducational network. Bates College, now operating Ch. 10 commercially, intends\nto operate entirely as an educational station and consented to the reservation.\nThe Commission has invited comments by May 19 concerning amending the table\nof assignment to add educational Ch. 2 0 to Athens, Ohio by deleting the commercial\nchannel from Coshocton and substituting Ch. 71 therefor. Ch. 62 presently avail¬\nable in Athens but rhe lower UHF channel for which the Ohio University plans to apply,\nwould provide better coverage and reduce shadow problems.\nMarshall University, Huntington, W. Va. was granted a CP (April 25) for a new\nlow power non-commercial educational F,M station to operate on 88.1 with 10 w. power .\nOn April 27 the Commission extended by 3 0 days the May 1 deadline for comments\ndue on suggested methods of reserving one UHF channel in both New York and Los\nAngeles for educational television.\nNETRChas already replied; JCEB and NAEB will file comments shortly.\nUniversity of Minnesota at Duluth was granted a CP (April 2 6) for a new non-com¬\nmercial educational FM station to operate on 89.1, ERP 225 w.\nWJCT, ETV station in Jacksonville, Fla., has filed a request with the FCC for\nauthority to “Scramble” its signals for a limited period of time in order to transmit\nprograms dealing with medical education.\nComments have been invited to proposed rule-making petitioned by NETRC to add\nChannel 46 for educational use in Lexington, Ky. It would involve deleting commer¬\ncial Channel 46, Bristol, Tenn., and substituting Channel 75, and substituting Chan¬\nnel 80 for Channel 60 in Richmond, Ky.\nThe Northern California ETV Assn., Inc., of Redding, Calif., has filed a petition\nfor rule-making looking to reservation of Channel 9 for non-commercial use.\nNon-Commercial Applications Accepted for Filing\nTrustees of Wheaton College, Wheaton, Illinois - CP for FM station on 81.1 me,\nlOw.\nKent State U., Kent, Ohio - CP to change frequency of WKSU-FM from 81.1 me to\n91.9 me and increase power and antenna height.\nUniversity of Notre Dame, South Bend, Ind. - CP for FM station on 91.9 me, lOw.\nFlorida West Coast ETV, Inc., Tampa, Fla. - CP to change ERP of WEDU from\nVis. 56.2 kw. Aural 28.2 kw to Vis. 100 kw. Aural 50 kw.; change type of transmitter;\nchange type of antenna; changes in equipment and antenna height.\nThe Board of Public Instruction of Dade County, Florida, Miami, Fla. -CP for\na new TV STL Station: Power 10 w, Freq. 1990-2 008 me.\nPROPOSED BILL WOULD BOOST EDUCATIONAL POSTAGE\nIn mid-April, Rep. Tom Murray (D.-Tenn.) introduced H.R. 6418, the Postage Revi¬\nsion Act of 1961, which proposes a general increase in postal rates, including two\nclasses of particular interest to educational broadcasters."
}