{
  "id": "d1703-3",
  "text": "The bill would Increase the educational materials rate from 9£ to 10$ for the\nfirst pound and from 5$ to 6£ for each additional pound. The rate for library mater¬\nials would jump from 4£ to 5$ for the first pound and from l£ to 3$ for each addi¬\ntional pound.\nThe NAEB is planning to file a statement opposing these particular increases\nsince these rates affect mailing of tape recordings and educational publications, etc.\nOther educational organizations are expected to take similar action.\nIMPORT OF RECORDINGS. FILM AND SLIDES\nNAEB is cooperating in the preparation of legislation to permit educational insti¬\ntutions to import, duty-free, sound recordings, films and slides which are to be\nused by them in educational broadcasting. The Tariff Act of 193 0 provides for the\nfree entry of books, maps, music, and similar materials by educational institutions\nfor their own use or for the encouragement of the arts, but fails to include the new\nvisual and aural techniques.\nA bill comparable to the one to be introduced was passed by Congress in 1958,\nbut expired July 1, 1960. It is hoped that the new legislation will not have a terminal\ndate.\nAT DEADLINE - MORE FCC\nOn May 10, the FCC accepted for filing the application of the\nGreater Washington Educational Television Association for a CP for Ch. 26\nRealizing that the timeliness of the information in the Washington Report is of\nvital interest to our Active and Associate Members, Industrial Associates, Board mem¬\nbers and officers, we are undertaking a new schedule of production and distribution\nof the Report . As news develops on the Washington scene we will produce a Report.\nThis may result in it being issued every other week, every week or just once a month.\nImmediately one copy will be mailed first class to the above categories of members and\nofficers, with it again being distributed to the entire membership with the regular News¬\nletter once a month, as is currently done. Many of you will receive it twice, but we\nwould like to try this production schedule so that you can have the important news from\nWashington on your desk as soon as possible."
}