{
  "id": "d1880-0",
  "text": "Volume V, Number 5\nWASHINGTON REPORT\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n1346 Connecticut Avenue, N.W., Washington, D.C., 20036\nMa.rch 18, 1964\nC. SCOTT FLETCHER NAMED ACTING PRESIDENT OF TV STATION DIVISION\nC. Scott Fletcher, former President of the Fund for Adult Education, has been\nappointed Acting President of Educational Television Stations, a Division of the NAEB.\nThe appointment was announced on March 16 in New York City by the Chairman of the\nDivision’s Board, Robert Schenkkan. In assuming this assignment, Mr. Schenkkan noted\nthat Mr. Fletcher was returning to a field in which he was active for more than a decade.\nDuring his presidency of the Fund for Adult Education, 25$ of the grants which were made\nwent for the support of educational radio and the launching of the educational television\nmovement.\nDuring the war years, Fletcher was both field and executive director of the\nCommittee for Economic Development and later President of Encyclopaedia Britannica Films.\nHe has also been active in a consultative capacity with such government agencies, among\nothers, as the Economic Cooperation Administration, the Agency for International Develop¬\nment, and the Advisory Committee for Title VII of the National Defense Education Act for\nthe U.S. Office of Education. Mr. Fletcher will have his offices at the headquarters of\nthe National Association of Educational Broadcasters.\nn\nEDUCATIONAL COMMUNICATIONS SYSTEM\nPlans for an Educational Communications System will be studied under a contract\nwhich the NAEB has developed with the Office of Education. The study proposal calls for\nan investigation of needs of institutions of higher education for an electronic inter¬\nconnection system. The project, under the direction of Jerrold Sandler, fomerly Production\nManager of WUOM, Ann Arbor, will explore these needs and develop a system whereby they\ncan be met. Ted Conant, formerly of the Ford Foundation, will serve as Associate Director\nof the project. The current contract with the Office of Education finances two phases of\na five phase project which is expected to result in the establishment of such a facility.\nPhases one and two are concerned with the thorough study of the needs and the alternatives\nfor meeting them.\nThe Advisory Committee includes Jack Suramerfield, Chairman of the Radio Board of\nthe NAEB and General Onager of WRVR, New York City; George Geesey, General IVknager of\nWAMU, Washington, and Chaiiman of the Affiliates Committee of the Educational Radio Net¬\nwork; NAEB President Harley; Carl Menzer, Director of Broadcasting at the State University\nof Iowa; Frank Schooley, Director of Broadcasting at the University of Illinois; and\nGeorge Probst, Chairman of the Board of Directors of the Broadcasting Foundation of\nAmerica. Mr. Summerfield is Chairman of the Advisory Committee.\nTWO MORE ETV GRANTS ANNOUNCED\nApproval of a $109,736 federal grant to help establish an educational television\nstation on Channel 13 at Calais, Maine, was announced today by Secretary of Health, Education,\nand Welfare, Anthony J. Celebrezze. The grant will enable the University of Inline to acquire\nr television transmission equipment for a project to cost an estimated $146,315. The Calais\nproject will be a repeater station in the State ETV network. The new station would bring\nETV to an area which receives no United States television signals and contains a\npopulation of 28,094 with an enrollment of 6,832 in 65 educational institutions."
}