{
  "id": "d1035-1",
  "text": "Radio and Television\n, By JOHN CROSBY s\nThe First Overt Act\n, rr t already on the I string along with this theory. Understandable,\nThe handwriting, I thmk, is already on rne tifiablei n0>\nThe handwriting, j. wuuiw, a© riuvmwj\nwall. The uprising began, historians wUl write,\nwhen a man first ran amok in a television\nstudio, stabbing a poor innocent cameraman\nand belting an actor with a bottle.\nI imagine every one has wanted to belt an\nactor from time to time, but stabbing^camera-\nmen is very much against '\nthe law in this state. You\nshouldn’t stab camermen even\nwhen—as this man claimed—\nyou are driven berserk by\ntelevision. The corridors of\nthe Columbia Broadcasting\nSystem, where this first overt\nincident occurred, teem with\nlikely candidates for stabbing.\nIn fact, some of the people\nin the upper echelons over\nthere have been stabbed so\noften they don’t even bleed\nany more.\nA DW XAA& tt —\nyes. Justifiable, no.\nI don’t think we should encourage assault\nas a solution. There are other easier solutions.\nOne is to turn the darn thing off. Another\neminently sane solution was arrived at by a\nfarmer named Langlotz who advertised recently\nin “The Daily Progress’’ of Charlottesville, Va.:\n\"Will trade 17 inch CBS 1952 TV set for good\nyoung Jersey milk cow.”\nHappy milking, Langlotz.\nJohn Crosby\nBut, as I say, you shouldn’t\nstab a cameraman. They’re hard-worki\nhomeloving, decent folk. Next man to run ai\nshould stab a vice-president. If no blood r\nhe’s probably hit an executive vice-president\nhe can stab away all day without doing\ndamage. (Just don’t go stabbing him in\nheart. You’ll ruin the knife.)\nThere have been innumerable instances\npeople sticking their fists or their feet throi\nthe picture tube when conditions got ir\"\nportable. (My favorite case is that of\nDodger fan a couple years back who smash—\nthe picture tube of his set when Bobby Thomson\nof the Giants hit that celebrated home run.)\nBut this, to my knowledge, is the first time\nanyone has tried to get at the source of the\ntrouble.\nHe picked “City Hospital,” I gather, more\nor less at random. Still, it was a happy acci¬\ndent. “City Hospital,” in case you never saw\nit, is advanced soap opera full of the most\ndistraught acting you are ever likely to see.\nIf a show had to be knocked off the air for a\nnight, I can think of few programs that would\nbe less missed. There are them as says that\nassault against any one connected with “City\nHospital” is justifiable, but I don’t know that\n“The Independent Mr. Jefferson,” the 'first\nof a series of educational television shows pre¬\npared by the National Association of Educa¬\ntional Broadcasters in association with NBC,\nwas a smooth, honest, unpretentious history\nlesson which demonstrated that the educators\ncan operate very well in the realm of show\nbusiness. .\nIt also demonstrated that show business,\nwhen it has a mind to, can be as educational\nas its educators because this particular show\nwas not much different from a lot of other\ncommercial shows which have plowed similai\nground. Morton Wishengrad, who may be the\noutstanding writer of commemorative programs\nof this nature, turned out a remarkably literate\nscript. Of course, he had a great collaborator\nin Thomas Jefferson, whose writings he freely\nborrowed. (“Rebellion to tyrants is obedience\nto God.” “Only in the^gfave is there absolute\nunity.”)\nThe period covered was the seventeen days\nrEat Jefferson took to write the Declaration of\nIndependence in Philadelphia. And the facts,\nI gather, were models of historical research.\nThis presented an awkward dilemma since the\nDeclaration was neither written nor signed\nnor adopted on July 4. Mr. Wishengrad, I guess,\ndidn’t want to kick a national holiday in the\nteeth and didn’t want to promulgate historical\ninaccuracy so the date was rather hurriedly\nglossed over.\nThis was the first of a series to be called\n“The Jeffersonian Heritage” and, if the rest of\nthem are this good, it’ll be well worth watching.\nWilliam Prince plays Jefferson—very ably, too.\nCopyright. 1953, N. Y. Herald Tribune Inc.\nJohn Crosby's column also appears on Sunday\nin Section 4 oj, the Herald Tribune."
}