{
  "id": "d1035-14",
  "text": "February 9, 19$k\nMr. Ralph Steetle, Executive Director,\nJoint Committee on Educational Television,\n1785 Massachusetts Ave.,NW\nWashington, DC\nMy dear Ra|qph:\nBefore I forget any of the highlights I want to get this to you. I will\nput them down as they came to me without any attempt to polish or worry\nabout terminology. I will try to give you the facts, mention the source,\nand you, Waite# and I can meet and discuss this further. I will send a\ncopy to Skoraia and you can decide whether a copy should go to Day, Senner,\nWoods and Schwartzwalder. I am sure you agree that this ought to be con¬\nfidential until we decide how to treat the whole subject.\nNow here are the facts:\nBefore I reached Miami, I knew the St. Louis picture from personal contact\nso that when I reached Phoenix I used that as a base for my discussions with\nSenner, Day, Schwartzwalder and Woods.\nMeeting in Miami\nFive day;was hardly sufficient time. I met with Messrs. Tracy, Walsh and\nHeller. I had a long conversation with Neal Haggarty, and outstanding\nlabor man of California, who is a member of the San Francisco board and who\ndesignated Bassaafff, Secretary of the Los Angeles Council, to serve as a\nmember of the board*\nMr. Tracy was interested and explained to me the past policies of IBEW—\nthey are strong on local autonomy. The radio and television division have\nhad special conditions. They have never had a policy for educational, non¬\ncommercial stations; but he said that he wanted to do all he could to help,\nand he asked that I see Mr0 Hardy, his radio-TV director. Had a long talk\nwith Hardy yesterday and we have agreed to meet in New York or Washington\non Wednesday or Thursday.\nI met with Dick Walsh, a close friend, who recognizes our proble and the need\nfor special consideration. He was going to do all he could to get word to his\npeople in Pittsburgh to cooperate with us*\nI.A. is not involved in San Francisco, but is in Los Angeles: the I.A. man is\nin charge of film there.\nThe difficult one will be St. Louis where the IA and IBEW have been battling\nfor years. While I haven*t any committment on St. Louis because I didn«t ask\nfor any, he recognizes in the TV field that the IBEW has had supremacy and\ntherefore I am confident that if it comes to a showdown we will receive favor¬\nable consideration*"
}