{
  "id": "d68-101",
  "text": "- 3 -\nThe table of channel allocations, including noncommercial educational\nreservations, has been revised several times since it was first issued in\n1952. The most recent revision, issued in June, 1965 and corrected in\nMarch, 1966, provided for 116 VHF and 516 UHF ETV reservations, an increase\nof more than two-thirds over the previous total of reservations. This table\nwas programmed into a computer, which selected the reservations on an effi¬\nciency basis. Deliberately a non-saturated table, this allocations plan was\ndesigned for a flexibility which would, in the long run, provide greater oppor¬\ntunity for educational organizations to develop a greater number of stations\nby permitting future computer selection and assignment of unallocated channels\nto places where at this time ETV may be completely unanticipated.\nThe steady growth of ETV is illustrated in the following table of stations\non the air at the end of each calendar year:\nYear\nNumber\nYear\nNumber\n1953\n1\n1960\n51\n1954\n10\n1961\n62\n1955\n17\n1962\n75\n1956\n21\n1963\n83\n1957\n27\n1964\n99\n1958\n35\n1965\n113*\n1959\n44\n(*15 stations initiated, 1 previously licensed station terminated\noperation in 1965.)\nA recent fast-growing supplemental service is the Instructional Television\nFixed Stations (ITFS), frequently referred to as the 2500 megacycles service.\nOn July 25, 1963 the Commission established the ITFS for the transmission of\ninstructional and cultural materials to schools and other selected receiving\nlocations, following an experiment in the 2000 megacycle (1990-2110) band in\nthe Plainedge, Long Island school district. The Parma, Ohio Board of Educa¬\ntion and the Mineola, Long Island school district were the first to go on the\nair on September 28, 1964. In May, 1966, some twelve systems were on the air,\nand 52 construction permits for 156 channels had been granted.\nThe Commission also licenses translators and boosters for the relaying of\nETV broadcasting, and has jurisdiction over microwaving of ETV signals.\nETV BROADCAST STATIONS\nAbout one-third of the ETV broadcast stations are licensed to state or\nlocal education systems, about one-third to colleges or universities, and\nabout one-third to community organizations. At first virtually all of the ETV\nstations were VHF; since 1960 some two-thirds of the CP grants and applications\nB-15"
}