{
  "id": "d68-103",
  "text": "- 5\n\"(1) In determining the eligibility of publicly sup¬\nported educational organizations, the accreditation of their\nrespective state departments of education shall be taken\ninto consideration.\n\"(2) In determining the eligibility of privately con¬\ntrolled educational organizations, the accreditation of\nstate departments of education or recognized regional and\nnational educational accrediting organizations shall be\ntaken into consideration.\n\"(b) Where a municipality or other political sub¬\ndivision has no independently constituted educational\norganization such as, for example, a board of education\nhaving autonomy with respect to carrying out the munici¬\npality's educational program, such municipality shall be\neligible for a noncommercial educational television\nbroadcast station. In such circumstances, a full and\ndetailed showing must be made that a grant of the appli¬\ncation will be consistent with the intent and purpose of\nthe Commission's Rules relating to such stations.\n\"(c) Noncommercial educational television broadcast\nstations may transmit educational, cultural and entertain¬\nment programs, and programs designed for use by schools\nand school systems in connection with regular school\ncourses, as well as routine and administrative material\npertaining thereto.\n\"(d) An educational station may not broadcast pro¬\ngrams for which a consideration is received, except programs\nproduced by or at the expense of or furnished by others than\nthe licensee for which no other consideration than the\nfurnishing of the program is received by the licensee. The\npayment of line charges by another station or network shall\nnot be considered as being prohibited by this paragraph.\n\"(e) To the extent applicable to programs broadcast by\na noncommercial educational station produced by or at the\nexpense of or furnished by others than the licensee of said\nstation, the provisions of s73.654 relating to announcements\nregarding sponsored programs shall be applicable, except that\nno announcements (visual or aural) promoting the sale of a\nproduct or service shall be transmitted in connection with\nany program: Provided, however, That where a sponsor's name\nor product appears on the visual image during the course of\na simultaneous or rebroadcast program either on the backdrop\nor in similar form, the portions of the program showing such\ninformation need not be deleted.\"\nB-17"
}