{
  "id": "d68-105",
  "text": "7\nOn February 8, 1965, the Commission held a national meeting of those persons in\neducation and industry interested in the development of ITFS, principally to determine\nways to meet increasing demands for channels in metropolitan areas. Partially as a\nconsequence of this meeting, the Commission has considered amendments to the rules\nrelative to channel assignment, engineering data required on application forms, and\nlocal planning in channel allocation. As a further consequence of this meeting, and\nafter investigation and study, the Commission established, on October 6, 1965, a\nnational Committee for the Full Development of the Instructional Television Fixed\nService to operate on national, regional, state and local levels.\nMICROWAVE, TRANSLATORS, CATV\nMicrowave relay systems utilize narrow, concentrated beams for efficient short\nrange transmission. Educational TV stations may use microwave equipment to provide\nprogram circuits between the studio and transmitter (TV-STL), to relay programs be¬\ntween TV broadcast stations (TV Intercity Relay), and to pick up programs that occur\noutside regular studios (TV Pickup). The rules governing such TV auxiliaries are\ncontained in Part 74, Subpart E of the FCC Rules, \"Aural Broadcast STL and Intercity\nRelay Stations.\" TV program relay facilities for use by closed-circuit TV systems\nmay be authorized on certain microwave channels in the Business Radio Service under\nPart 91, Section 91.554 of the Rules. Such stations may also be used in connection\nwith ITFS systems. ITFS stations may be used, as well as Studio-Transmitter program\ncircuits, for relaying programs between ITFS systems in adjacent areas, for delivering\nITFS programs to TV broadcast stations, and for relaying TV broadcast programs to\nITFS systems.\nTranslators are devices which change the frequency of an incoming signal and\nretransmit it on a new frequency, and which may be used to serve areas not served by\nthe primary broadcast ETV station or ITFS system. No significant changes are made\nin the technical characteristics of the signal other than frequency and amplitude.\nMany school districts construct and operate translators, and many stations operate\ntheir own translators in order to boost their signals into outlying areas for both\nschool and community programming.\nCATV stands for Community Antenna Television. These are systems which pick up\nTV signals and place them on cables to homes or public buildings in a given community\nwhich, for reasons of terrain or otherwise, would not be able to pick up that partic¬\nular signal with as much clarity, if at all. A number of ETV stations are carried by\nCATV, and many educational institutions utilize this service. Under current rules\n(Part 74, Subpart K, \"Community Antenna TV Systems\"), CATV systems are obliged upon\nrequest to carry the signal of an ETV station within whose Grade B or higher priority\ncontour the system operates and, with certain exceptions, to afford same day program\nexclusivity to such stations as against the programs of lower priority stations.\nFINANCING\nDifferent types of ownership mean different types of budgets and sources of funds.\nOn the average, stations operated by colleges and universities and by school systems\nobtain about 75% of their income from direct budgeted support. Stations operated by\nstate agencies receive about 95% of their funds from state appropriations. Community\nstations, on the other hand, receive about 75% of their support from gifts, grants\nand services, the latter primarily for the production of in-school programs. ITFS\nsystems are supported by the local institutional licensee, in some instances with\nthe aid of Federal grants.\nB-19"
}