{
  "id": "d68-111",
  "text": "13\nAlmost every State is in the planning or active stage of an interconnected\nState network. Alabama and Maine, among others, have almost complete, fully-\ninterconnected systems. South Carolina has an extensive network, combining\nbroadcast and closed-circuit facilities. The Texas Educational Microwave Pro¬\nject covers an important region of that State. Oregon was one of the pioneers\nin the live network exchange of instructional materials. More than a dozen\nStates have already linked stations toward eventuation of complete intrastate\nnetworks.\nORGANIZATIONS\nThe National Association of Educational Broadcasters, 1346 Connecticut\nAvenue, N.W., Washington, D.C. 20036, represents radio and television stations,\neducational institutions and organizations, state agencies, industrial firms,\nand individuals participating in or interested in educational broadcasting.\nThe NAEB provides consultation, conducts research, distributes information, and\npublishes materials which aid in the development of educational television and\nradio. Its operations include: Educational Television Stations Division,\nNational Educational Radio Division, Instructional Division, Individual Members\nDivision, Improvement of Televised Instruction Project, Office of Research and\nDevelopment, and Educational Communications System Study.\nNational Educational Television, 10 Columbus Circle, New York, N. Y. 10023,\nas described earlier, serves virtually all the country's educational television\nstations. In addition to distribution of new public affairs and cultural pro¬\ngramming, NET provides consultation to its affiliates on organizational, pro¬\ngramming and administrative matters.\nThe Joint Council on Educational Telecommunications, 1346 Connecticut\nAvenue, N. W., Washington, D. C. 20036 (formerly the Joint Council on Educa¬\ntional Broadcasting), is comprised of leading educational organizations,\nincluding NAEB, NET, the American Association of School Administrators, the\nAssociation of State Universities and Land Grant Colleges, the American Council\non Education, the Council of Chief State School Offices, the National Education\nAssociation, and the State Universities Association. The JCET acts as a channel\nof communication between educational interests, broadcasting, and Federal\noffices and Congress on national issues affecting educational television and\nradio, and is concerned with cooperative inter-institutional efforts that can\nbe facilitated by any form of electronic interconnection.\nThe National Center for School and College Television, Indiana University,\nBloomington, Indiana 47405, established in 1965, serves as a distribution and\ninformation center. Its purposes are to provide wide circulation of instruc¬\ntional programs, encourage quality production of telecourses, establish a\nresearch and dissemination service, and initiate a grant service for the pro¬\nduction of programs.\nB-25"
}