{
  "id": "d68-113",
  "text": "15\nL\nL\noffice of the Assistant to the Assistant Secretary, for Educational Television,\nDepartment of Health, Education, and Welfare, 330 Independence Avenue, S.W.,\nWashington, D. C. 20201, administers the program; the ETV Facilities Program,\nOffice of Education, 7th and D Streets, S. W., Washington, D. C. 20201, pro¬\ncesses applications.\nThe Office of Education, Department of Health, Education, and Welfare, 400\nMaryland Avenue, S. W., Washington, D. C. 20201, provides grants for educational\ntelevision through several bureaus. The Bureau of Research includes such pro¬\ngrams as Title IV, the Cooperative Research Act, of the Elementary and Secondary\nEducation Act and Title VII, New Educational Media, of the National Defense\nEducation Act. The Bureau of Elementary and Secondary Education administers,\namong other grants. Title III, Supplementary Educational Centers and Services,\nand Title V, Grants to Strengthen State Departments of Education, both under the\nElementary and Secondary Act. The Bureau of Higher Education provides grants\nunder such programs as Title VI, Financial Assistance for the Improvement of\nUndergraduate Facilities, Title I, Grants for Construction of Undergraduate\nAcademic Facilities, and Title II, Grants for Construction of Graduate Academic\nFacilities, all under the Higher Education Act.\nThe General Services Administration, 18th and F Streets, N. W. , Washington,\nD. C. 20405, administers the Federal Property Act, which authorizes donations of\nsurplus property, equipment and land, which may be applied for by tax exempt\nradio and television stations.\nMany other Federal agencies offer grants, program materials, or production\ncontracts to educational television stations. Among the most active are the\nRadio and Television Office of the National Aeronautics and Space Administration;\nOffice of Public Information, Department of Commerce; Special Projects Program,\nNational Science Foundation; Audio-visual Office, Weather Bureau; and the Radio-\nTV Section, Department of Agriculture.\nMost States have established educational broadcasting or educational tele¬\nvision offices or commissions, principally to coordinate activities for the\ndevelopment of State ETV networks. Many such offices are found in Departments\nof Education or Departments of Public Instruction. Many county and local\nschool systems and even individual schools have ETV coordinators for the purpose\nof achieving effective utilization of closed-circuit, instructional fixed and\nbroadcast television. Virtually every college and university, public and\nprivate, has a person responsible for ETV development and use. State and local\nETV councils and citizens organizations are sometimes quasi-official in that\nmany of their members and directors are public officials.\nB-27"
}