{
  "id": "d68-135",
  "text": "NOTES\nKit Number 1\nTELEVISION RECEIVERS FOR\nCLASSROOM USE\nHigh on the list of problems cited by teachers\nis poor reception.. Sometimes these difficulties\nare at the transmitting station, but mostly\nthey are at the receiving end. it stands to\nreason that a teacher must clear up any re¬\nception problems as a first step towards uti¬\nlizing television programs. Fortunately,\nsomething can be done in the c lassroom about\nsome of these problems.\nSELECTINGTHE RECEIVER-Many reception\nproblems can be averted by selecting the right\nreceiver and antenna. Each location will\npresent its own peculiar reception problems.\nNo one receiver can satisfy all requirements.\nSeveral manufacturers make special class¬\nroom receivers. In some cases these are\nmodifications of their retail models, but\nsometimes they are completely new designs\nplanned specificaIly for classroom service.\nThe decisions between a special ly designed\nreceiverand a \"home-type \" receiver depends\non the amount and the kind of use the set\nwi 11 have.\nTelevision receivers today are not the deli¬\ncate, hard-to-maintain instruments of a few\nyears ago, but a school which is not equip¬\nped to do its own electronic maintenance\nand repair should considera service contract\nfor the set. In all cases a reliable dealer\nwith adequate service facilities should be\npatronized.\nSCREEN SIZE - For average size class a\nset with a 21\" to 24\" picture tube is satis¬\nfactory. Large or smaIler screen size will\ncal I forad justment in the size and placement\nof the class. A group of 24 to 30, seated in\nnormal classroom spacing, can usually view\nthis size screen comfortably and clearly. If\nmaterially larger groups are to view the pro¬\ngram, then more than one receiver should be\nused in preference to a set with a larger\nscreen.\nA receiver with an aluminized picture tube\nand a dark safety glass is definitely preferred\nfor classroom use. This combination gives\npictures with brighter whites, richer blacks,\nand a wide range of grays in between. The\nsafety glass should be mounted so that there\nis a minimum of glare or reflection on the\nface of the tube from windows or artifical\nlights.\nCIRCUIT CONSIDERATIONS - Some re¬\nceivers are noted for their fringe area re¬\nception ability. If it isexpected thatsignals\nfrom a weak or distant station will be used,\nthen the set's fringe area reception character¬\nistics are important. You can expect to pay\na little more for a set with good fringe area\nreception since it will usually have a more\npowerful circuit.\nPicture stabi I ity and ease of tuning is another\nimportant factor. Various programs should\nbe viewed when testing the set to make sure\nthat there is a minimum of readjustment nec¬\nessary when the set is switched from channel\nto channel or when the programs content\nchanges from basically light to dark pictures .\nIt is normal to expect some \"touching-up\"\nof the fine tuning, but the picture bright¬\nness and contrast range should remain about\nthe same.\nC-18"
}