{
  "id": "d68-137",
  "text": "NOTES\nKit Number 1\nto adjust the sound to compensate for room\nacoustics.\nANTENNA - A good many reception pro¬\nblems experienced in classrooms can be cured\nor materially reduced with the proper an¬\ntenna o The problems relating to low signal\nstrength or reflections are the most common\nones reported by teachers. If the picture is\nsmeared, hard to keep,- “locked in\", full of\n\"snow11 or filled with multiple images (ghost)\nit can usually be improved by changing the\nantenna. This can be accomplished by using\nan antenna with higher efficiency or by re¬\norienting the present one .\nAn outside antenna is preferred for al I class¬\nroom reception and is generally necessary\nfor the reception of UHFsignals (Channel 14\nto 83). As the distance from the station in¬\ncreases, the efficiency and height of the re¬\nceiving antenna must also be increased.\nOutside antennas can be installed to serve\none room or many rooms. The most satis¬\nfactory arrangement is to have the antenna\nconnected to a master distribution system\nserving all rooms in a building. These sy¬\nstems consist of one or more antennas or¬\niented to the desired stations. Amplifiers\nare used to boost the in-coming signals and\nthese are wired to each room . A set can then\nbe wheeled into the room and plugged into\nthe antenna jacks. Systems like these are\nthe most expensive but they are also the most\nsatisfactory.\nAll new bus Iding construction should include\nprovisions for a master antenna distribution\nsystem. There are other advantages to such\na plan . By adding properly designed antennas\nnew channels can be received. Signals from\nstations using UHF channels can be converted\nin the antenna system so that a standard VHF\nreceiver can be used in the room. In addi¬\ntion a school with a master antenna distri¬\nbution system is wired for closed-circuit\ntelevision if this is planned for the future.\nMost sets have a bui It-in antenna . These are\ngenerally low in efficiency and are suitable\nonly in very strong signal areas. The \"rabbit-\near antenna, whether attached to or set on\ntopofthe receiver, is also low in efficiency .\nThis type antenna does have one advantage\nover the built-in; its size can be ad justed to\nthe direction of the in-coming signal, If one\nof these minimum-type antennas is used, the\nset should be located near an outside wall.\nThis is particularly true if the building is of\nmodern steel and concrete construction.\nSeveral locations in the room might be tried\nsince these antennas are easi ly influenced by\nexternal forces, such as steel beams, girders,\nand electrical apparatus. It may be found\nthat a set will operate better in some rooms\nthan others. Receiving rooms located on the\nside of the building nearest the transmitting\nstation are usually best.\nVIEWING SPACE - Television programs\nshould be viewed in the regular classroom.\nIdeally, these rooms should be acoustically\ntreated and well ventilated. The set should\nbe placed so that glare and reflection from\nwindows orartificial lights do notshow in the\nscreen or into the eyes of the viewers. It is\nnot necessary to completely darken the room\nfor television viewing, but the light level\nshould be reduced below normal. Turning\noff the overhead lights maybe all that is re¬\nquired, If the windows have shades, these\nmay be lowered or partially lowered. One\nof the advantages of television is that the stu¬\ndents can take notes while viewing the pro¬\ngram. A comer location in the front of the\nroom is usually best. This will give an un-\nJ\nj\n\"j\n!—f\nJ\nC-20\nr i"
}