{
  "id": "d68-138",
  "text": "NOTES\nKit Number 1\nobstructed view to the entire class. It will\na Iso he Ip the sound distribution . Many c lass-\nrooms have poor acoustics and the corner\nlocation will help to cut down on the sound\nreverberation.\nTUNING THE RECEIVER - Some reception\ndifficulties can be corrected through proper\ntuning of the receiver. There is an instruc¬\ntion manual with mostsets. Before attempting\nto tune the set you should familiarize your-\nse If with these instructions. As a minimum it\nwill identify the controls and their function .\nIfthe set has a fine-tuning control it should\nbe adjusted to give the sharpest, clearest\npicture each time the channel is changed.\nThe setting giving the best picture should also\ngive the clearest and loudest sound. If this\nis not so, then the set needs to be adjusted\nby a serviceman .\nIn addition to \"fine-tuning\" the set, it may\nbe necessary to re-orient the antenna . If the\nset uses the \"rabbit-ear\"type, it is a simple\njob to rotate the antenna until the best\npicture is obtained . If the antenna arms are\nadjustable, some improvement in the picture\nquality may be made by changing their len¬\ngth. Higher channels are usually received\nbetter on shorter arms, and lower channels\non longerarms. By alternately adjusting the\nfine-tuning and the antenna, an optimum\nfor reception can be reached.\nThe vertical and horizontal hold controlsare\nused to steady the picture. When they are\nad justed properly the picture on the receiver\nwill be \"locked\" to the transmitter signal.\nIf the picture rolls or \"flops-over\" or seems\nto be made up of a series of diagonal jagged\nlines, one or both of these hold controls may\nneed adjusting.\nThe brightness and contrast controls are used\nto ad just the relationship between the black\nand white elements of the picture. The\nbrightness control sets the overall intensity\nof the picture and the contrast control regu¬\nlates the detail of the picture by setting the\nrange of grays between black and white. In\nad justing these controls, the brightness con¬\ntrol should be turned up until the screen is\ni I luminated . Before making this adjustment,\nthe contrast control should be turned down.\nWhen you have the screen illuminated, you\ncan turn the contrast control up unti I you have\na range of gray tones between black and\nwhite. There is considerable inter-action\nbetween these controls and it may take some\npractice to get the proper combination. If\na balance cannot be achieved on the first\nattempt, then a new setting of the brightness\ncontrol should be made and the contrast con¬\ntrol read justed accordingly . A good picture\nshould have rich blacks and bright whites\nwith many shades of gray in between. If the\npicture is too dark, then the brightness may\nbe set too low. If the picture is dull, life¬\nless and washed out, the contrast control\nmay be too low. If the black elements in the\npictures have a tendency to \"bloom\" and there\nare no details in the shadow areas of the\npicture, or if the whites appear \"chalky \",\nit is an indication that the contrast control\nmay be set too high. Much of the picture\ndetail is carried in the grays. Most people\nhave a tendency to adjust sets for too high a\ncontrast. When this is done, the gray areas\ntend to become black and much of the pic¬\nture detail is lost. A good test to see if the\ncontrast control is set too high is to turn\ndown the contrast setting and watch the black\nareas; if details begin to appear, it is an\nindication that the contrast was too high.\nC-21"
}