{
  "id": "d68-168",
  "text": "Kit Number 6\nADDITIONAL INFORMATION ABOUT\nTHE LESSON EXCERPTS\nFIRST EXCERPT\nSeries PLACES IN THE NEWS is a series of weekly telecasts,\n” each approximately 20 minutes in length, produced by\nWNDT-TV in New York, with Mr„ Jerry Si Iverstein as commentator.\nThe series is made available through the Great Plains Instructional\nTelevision Library, in Lincoln, Nebraska. Mr. Si Iverstein presents\nbackground material for understandingcruciaI events and issues of\nnational or international concern. Each telecast has a focal point.\nSt may emphasize important events occurring in a nation; people\ninvolved in current affairs; the tensions which affect these people;\nthe factors which require cooperation; or efforts toward national or\ninternational cooperation in solving problems.\nThe telecastscenter around a well-informed continuity person,\nin the role of the commentator, selected guests who are important\nspecialists in particular fields, and visual or auditory materials\nthat extend or reinforce the presentation of events, issues, or indi¬\nviduals. Questions formulated by students in classrooms near New\nYork, where the programs originate, are selected for comment by\nthe special guest or the commentator.\nLesson In this lesson on AIR POLLUTION, the teacher uses film\nclips, a recorded song by Tom Lehrer, and comments by the\nteacher to explore the problem of air pollution in this and other\ncountries, the seriousness of the problem, the nature and expense\nof current and future pollution control measures. After impressing\nupon the students the vital importance of uncontaminated air to\nsurvival, the lesson considers the nature and dimensions of the\nearth's atmosphere, \"a tiny band of oxygen\" which is compared\nwith \"A single coat of varnish on the world globe.\" The lesson\nillustrates some of the sources of air pollution which have resulted\nin \"the big sewer in the sky,\" human reactions to this pollution,\nand the danger it poses to human health and life. After citing\nstatistics concerning fatalities from air contamination in certain\nspots around the world, and specific diseases orconditions attribu¬\ntable to air pollution, the film considers some of the specific con¬\ntrol measures now in effect or being tested for future use. Mr.\nSilverstein, the teacher-commentator, speaks of the \"environment\nG-12"
}