{
  "id": "d68-171",
  "text": "Kit Number 6\nfirst scene. Professor Eastman has introduced the lesson topic,\nO'Neill's play. The Hairy Ape, has commented on the nature and\nmeaning of the play, and has set the first scene, which takes place\nin the firemen's forecastle of a ship, where live the primitive brutes,\nmen long on brawn and short on brain, who stoke the coal for the\nship's boi lers. At the play's beginning, the men have returned from\nshore leave in New York. Professor Eastman's comments are alter¬\nnated with Yank's speeches from the play, given by an actor in a\nshadowbox, which is part of the te levision lesson setting . The first\nscene not only shows us Yank's habitat. It defines his values. From\nYank's speeches it is learned that Yank re jects the values of modera¬\ntion, the values of the golden past when sailing was a communion\nwith man and nature, the values of home, love, and women, and\nthe valuesof political amelioration. But he likes the life andwork\nthat he has. It makes sense to him, and he explains this as he\nspeaks of the old sailor, Paddy: \"I belong and he don't.\" Our\nlesson excerpt is Yank's expression of faith, in which he describes\nhimseIf as \"young\"and \"new. \" Says Yank: \"Everything that makes\nthe world move can't move without somepin' else. And that's me.\nYou get down to the bottom and that's me. I start somepin' and\nthe world moves. I'm smoke and steam.I ‘m the museles in\nsteel. I run the works.\" Our lesson excerpt ends as Professor\nEastman begins his introduction of the play's second scene.\nTHIRD EXCERPT\nSeries PRACTICAL POLITICS is a series of four dramatic tele¬\nvision lessons for senior high school students. The series\nwas produced by The 21-Inch Classroom, and is distributed by the\nEastern Television Network, Cambridge, Massachusetts. According\nto the Teacher's Guide, the series is designed \"to make students\naware ofour political process and to show them ways in which they\ncan participate in this process in their own communities—nowand\nlater. The aim is to stimulate thinking and to spark discussion\nrather than to give pat answers or to pile up facts. \"\nThe area of politics treated in the series, as distinguished from\ngovernment, lies in the ELECTION of our governmentaI officials.\nIt is concerned with fundamental, down-to-earth details in which\nthe individual is the key to success or failure. It concerns party\norganization, precinct work, campaigning, and all the activities\ninvolved in electing candidates to office.\nG-15"
}