{
  "id": "d68-172",
  "text": "Kit Number 6\nDesigners of the series say: \"Drama has been chosen as the medium\nwhich shows best the motives, the interplay of characterand situa¬\ntion, the essential 'humaness' of practical political action. By\nwatching these programs the student has an opportunity to come\ncloser to the realities of practical politics and to realize some of\nthe underlying problems of political life.11\nThe four fifteen-minute programs tell the story of a young candi¬\ndate for the office of state representative . Theyare chronologically\narranged to correspond with the timing of a campaign from June to\nNovember, Beginning with the candidate's first contact with\npolitics, each program shows an incident in the campaign which\ninvolves a problem to be solved. Each program ends at the point\nin the story where a decision must be reached, but the decision is\nnot stated.\nDr, Franklin Patterson introduces each lesson, provides a tran¬\nsition between lessons, and indicates sections which may be of\nparticular interest. The students' attention is directed to the\npolitical problem of getting elected, rather than to any particular\nissue,\nLesson LESSON 3, THE GIFT, is planned to show the practical\nproblems of financing a campaign. It raises the question\nof where a candidate draws the line on campaign contributions, The\ntime is September. The place in Scene 1 is the patio of a golf\nclub, looking out over the eighteenth hole. The place in Scene\n2 is Archer's home, that night. Bill Archer's opponent is taking\nthe lead in the campaign because he is able to buy TV time and\nArcher is not. As they talk after a golf game, Frazer and Walker\n(businessmen who are supporting Archer's campaign) volunteer to\nput up $500 apiece for TV spots. They invite Archer to play golf\nwith them the following week, but Fred Hale, the town committee\nchairman, vetoes the idea, pointing out that the club's membership\nis restricted and the fact that Archer is seen there may hurt his\ncampaign.\nAt Archer's home that night, Archer's wife, Susan, Fred Hale,\nand Fred's vice-chairman, Ellie Carver, are working on campaign\nbusiness. Archer has just received a call from a man who is urging\nhim to take a stronger stand on civil rights. Fred brushes off the\nidea, Ellie hands Archer the application for TV time. Susan\nhands him the checks to endorse saying that he might as well sign\nG-16"
}