{
  "id": "d68-38",
  "text": "NOTES\nKit Number 3\nThe Guide can be thoughtof as a \"blueprint\"\nof the series. It includes a statement of the\ndesign and goalsof the series as a whole, as\nwell as the scope, contour, and objectives\nof each lesson.\nSome Teacher's Guides are brief and simple,\nothers more complex, but their basic function\nis to enable the television teacher and the\nclassroom teacher to move in the same direc¬\ntion toward the same goals. As a minimum,\nthe Guide will tell the classroom teacher\nwhat is covered by each lesson, what unfa¬\nmiliar words the pupils will need to know in\norder to get the most from the lesson presenta¬\ntion, and what major points the lesson will\nemphasize. In addition, the Guide usually\nwill suggest some activities which may be\nused in the classroom to prepare the students\nfor the lesson to come, activities (if some are\nessential to the desired behavior) to be used\nduring the lesson, and immediate or long-\nrange activities which, following the lesson,\nwil I help to clarify or extend lesson concepts\nand weave the lesson into the entire coordin¬\nated learning sequence.\nAn excerpt from the Teacher's Guide,perti¬\nnent to the lesson in this film, is shown on\nthe following pages. More detailed sugges¬\ntions forusing the Teacher's Guide are given\nfor the benefitof the classroom teacher among\nthe materials in Kit Number 2.\nProduction of the Series\nAfter the programs have been outlined, the\ntelevision teacher, one or more subject mat-\nterspecialists, and the television production\nstaff work together to arrive at the exact form\nwhich the lessons will take, to prepare the\ngraphic materials, and to bring about the\nmost desirable meld of content and presenta¬\ntional elements to achieve the lesson objec¬\ntives.\nWhen the setting of the program has been\nplanned and made ready, when the graphics\nare completed, and a run-down of the presen¬\ntation sequence has been made, the tele¬\nvision teacher and the television production\nstaff may be involved in several specialized\nrehearsals. Depending upon the complexity\nof the lesson, there may be a lighting re¬\nhearsal, technical rehearsal, a dry-run (a\nwalk-through of the lesson sequence without\ncameras, but using graphic materials and\nprops), a sound and/or music rehearsal. Then\ncomes the full start-stop rehearsal, in which\nall of the elements are mixed together, and\na final consideration is given to important\naspects of teaching: pacing, clarity, empha¬\nsis, impact, and logical development.\nAt the time scheduled, the lesson will be\npresented, either \"live\" (direct from the\nstudio to the classroom) or from video tape\nor film.\nD-16"
}