{
  "id": "d68-43",
  "text": "NOTES\nKit Number 3\nSYNOPSIS OF COMPLETE TELEVISION LESSON\nUSED IN KIT NUMBER 3\nThe lesson opens with a view of the buildings\nin the \"underwaterviI lage, \" shown by models\nbuilt to simulate the specialized structures\nwhich scientists are designing for living and\nexplori ng under the su rface of the ocean. The\ntelevision teacher reminds the pupils that\nman is meant to live on dry land, on the sur¬\nface of the earth, in the atmosphere, where\nall the requirements for human life are found.\nAlthough all of these things are found in the\nsea, says the teacher, they are not in forms\nwhich man is ready to use. Therefore, when\nman's curiosity takes him into the ocean, he\nmust bring his own natural human environ¬\nments with him.\nThe teacher points out the various buildings\nand tells the particular use for which each\nwas planned. She then talks about \"Starfish\nHouse,\" man's main home and laboratory under\nthe sea, and asks the children to join her in\nseeing how explorers live in this laboratory\nunder the water.\nWe nextsee the television teacher as she ap¬\npears to emerge through the open hatch into\nthe air chamber of Starfish House. \"This is\nthe way we come in,\" says the teacher,\n\"right up out of the water. But the water\ncan't come in with us, although there is no\nfloor or door to keep it out. Can you guess\nwhy?\" She tells the pupils that she will ex¬\nplore this question with them during their\nvisit.\nThe television teacher shows the pupils a star¬\nfish skeleton and a photograph of a starfish\neating a scallop, explaining how the starfish\ndoes this. The starfish,she points out, is\nequipped to eat and breathe underwater, but\nman is not. She discusses how man uses his\nhuman brain, remembering the things he\nknows, observing the things he sees around\nhim, using these things in solving the new\nproblems which he meets under thesea.\nThe teacher then uses an aquarium in the lab¬\noratory to demonstrate the levels of the ocean,\nincluding the Continental Shelfon which the\nunderwater vi I lage stands. She discusses the\nsea creatures which live in the various levels\nand some of the unusual ways in which they\nadapt to their special environment, ways\nwhich may give man ideas for solving his own\nproblems under the sea. In discussing what\nman already knows that will help him solve\nsome of these problems, the teacher demon¬\nstrates how air pressure keeps the water from\nentering the Starfish House.\nThe teacher pointsout that although there are\ndifferences in living on dry land and living\nunder the sea, there are likenesses, too,\nwhich can be very helpful to the explorers.\nShe describes the food chain in the ocean,\ncalling the attention of the pupils to its sim¬\nilarity to the food chain on dry land.\nD-21"
}