{
  "id": "d68-44",
  "text": "NOTES\nKit Number 3\nQUALITIES DESIRABLE IN A TELEVISION TEACHER\nGeneralizations about the ideal television\nteacher are difficult to make and may be\nmeaningless, as a teacher who responds very\nwell to one situation may not do at all well\nin another.\nA teacher who is highly adept under normal\ncircumstances may be unable to function sat¬\nisfactorily when things go awry in the studio\nor when swift and unexpected changes must\nbe made.\nSome television teachers make a very good\nfirst impression but are unable to adjust to the\nspecial pressures and demands made by regu¬\nlar television lesson preparation and presen¬\ntation. Others, not too impressive when first\nintroduced to the medium, grow and improve,\nbringing increasing vitality and impact to\ntheir work as they become more proficient in\nthe specialized techniques of television\nteachi ng and more aware of i ts unusual capac¬\nities.\nThis potential for growth and improvement is\nof the utmostsignificance, for initial selection\nisonly one step in the development of an ef¬\nfective teacher. Presentational aptitude is\nimportant but is not the only consideration.\nKnowledgeof the subject field varies in im¬\nportance as we find variations in the extent\nof the television teacher's responsibility for\nlesson content . Where the teacher has con¬\nsiderable responsibility forsuch content, then\ncompetence in the subject area and in organ¬\nization of material is essential.\nIn the long run we make wiser choices if we\nrealize there is no such thing as a sterotype\nfor a superior television teacher, if we look\nbeyond the attractive, graceful, easy pres¬\nence on the screen to see what is happening\nin the classroom. How do the children react\nto this teacher? How does this teacher com¬\nmunicate? Some teachers may be excellent\nat presentation but cannot motivate children\nto learn. Some can stir up interest and en¬\nthusiasm in the children, but lack organiza¬\ntional skills. A teacher, therefore, may be\neffective if cal led upon for one function, in¬\neffectual if called upon for another. This\npossibility has moved some people to ask if\nthere should be more than one television\nteacher for some lesson series.\nA good television teacher is enabled to be a\nbetterone where there is \"feedback\" from the\nclassrooms into which the lessons are going,\nif there is opportunity for evaluation in the\nclassroom, for suggestions from the classroom\nteachers, for consultation and cooperation\namong the members of the teaching team. It\nis under these conditions that the television\nteacher's potential for growth and improve¬\nment has its greatest opportunity to reach full\nfruition.\nD-22"
}