{
  "id": "d1132-2",
  "text": "« M A D OFFERS CREDIT COURSES\nThe college or Arts and Sciences has approved a plan or offers no two\nUN 3 VERSfTV COURSES BY RAD SO THROUGH THE CO-OPERATI ON OF THE CORRESPONDENCE\nSTUDY DEPARTMENT AND WNAQ<> The ANNOUNCEMENT WAS MADE BY M S SS tyCY TANDY?\nDIRECTOR OF CORRESPONDENCEJSTUOIES» AND M e 88 VIRGINIA HaWK? WNA0 STATION\n08 RECTOR*\nBeginning March 6, Spanish 10I will be broadcast from 9? 30 to *0 AcM* every\nMonday? Wednesday and Friday for a period of 8S weeks. This is a three-\nhour COURSE AND WILL BE TAUGHT BY STEPHEN $CATORJ? PROFESSOR OF ROMANCE\nLANGUAGES,,\nOn March 7 the first lesson in History *2? a course in Oklahoma history?\nWILL BE BROADCAST BY E, £„ OaLE? PROFESSOR OF HISTORY, THIS IS A TWO-HOUR\nCOURSE AND WILL BE HEARD FROM 4 TO 4o3G PoMo EVERY MONDAY AND WEDNESDAY\nFOR 16 WEEKS,\nEnrolments in the courses must be made through the correspondence study\nDEPARTMENT BEFORE THE FOURTH RADIO LECTURE IS GIVEN, A FEE OF $5, WILL BE\nCHARGED FOR EACH SEMESTER HOUR,\nRequirements for each semester hour of credit are a minimum of three\nWRITTEN REPORTS TO BE SUBMITTED TO THE CORRESPONDENCE STUDY DEPARTMENT?\nA MID-TERM EXAMINATION AND A FINAL EXAMINATION, ThE FINAL EXAMINATION\nMUST BE TAKEN WITHIN ONE MONTH AFTER THE BROADCAST OF THE LAST LECTURE MM\nTHE COURSES\nBy THIS PLAN THERE WILL BE NO CLASSROOM INSTRUCTION AND THE CREDIT EARNED\nWILL BE RECORDED AS A CORRESPONDENCE STUDY CREDIT.\nRADIO - NEWS TRAINING RECOMMENDED\nRefresher courses for broadcast news personnel and long-range principles\nFOR TRAINING RADIO JOURNALISM STUDENTS WERE RE COMMENCE 0 BY THE SUB¬\nCOMMITTEE of the NAB Mews Committee* which met in joint session on\nFebruary 25 with representatives of the Rational Association of State\nUniversities at the Waldorf-Astoria Hotel? New York.\nThe sub-committee advised that universk ties co-operate by giving fresh¬\nening COURSES FOR NEWSROOM STAFFERS OF OUTLETS IN THEIR AREAS« TRAINING\nFOR AIRWAVE’JOURNAL!SM UNDERGRADUATES WAS RECOMMENDED TO INCLUDE SOCIAL\nSTUDIES? SCIENCE? FOREIGN LANGUAGES? SHORTHAND AND TYPING. ^NY PLAN ?\nTHE GROUP DECIDED? SHOULD ALSO INVOLVE PRACTICAL BROADCASTING EXPERIENCE\nFOR BOTH FACULTY AND STUDENTS,\nAttending the conference were sub-committee members? William Brooks?\nDIRECTOR OF NEWS AND SPECIAL EVENTS FOR NBC; PAUL WHITE* DIRECTOR OF\nPUBLIC AFFAIRS FOR CBS? AND WALT ^ENNIS? DIRECTOR OF PUBLIC RELATIONS AND\nSPECIAL EVENTS FOR WHN ? New YORK. W&tLlAM ByRKE MI LLER, .MANAGER OF THE\nNBC PUBLIC SERVICE DEPARTMENT? SAT IN AS SPECIAL EDUCATIONAL ADVISER,\nUniversity representatives consisted of: Wilbur Schramm? director of the\nState University of Iowa*© Journalism School; Mitchell Charnley? head of\nthe School of Journalism or the University of Minnesota? #and I. Keith\nTyler? acting director of radio education at Ohio State University,"
}