{
  "id": "d1132-3",
  "text": "NA£8 NEWS LETTER*__ ..P age 4.........March I, 1944\n\"CURTAIN GOING UP\" IN SIXTH YEAR OVER W K A R\nFor the 8ixth consecutive Year, Don Buell, Assistant Professor of Speech\nand Director of Dramatics* is presenting his program \"Curtain Going Up\"\nover WKAR, Michigan State College. Comment on new plays* on local\ntheatrical offerings and on personalities of the theater is given in\nCHATTY STYLE FOR ALL WHO HAVE AN INTEREST IN THE ORAMAo The PROGRAM IS\nSCHEDULED AT 6:30 ON TUESDAY*\nDon Buell brings to hss broadcasts a lifelong interest in the theater* He\nIS A GRADUATE OF THE BaKER WORKSHOP or THE: °RAWA DEPARTMENT OF #EW YORK\nUniversity and was on the faculty of the University of Nebraska before\nCOMING HERE IN 1937* Hg IS DIRECTOR OF THE PLAYS PRESENTED ON CAMPUS *\nH|8 BROADCASTS ARE BASED U&ON HIS KNOWLEDGE OF THE THEATER AS WELL AS UPON\nTHE CRITICAL COMMENT FOUND IN THE METROPOLITAN PRESS*\nMINNEAPOLIS SYMPHONY ON W L 8\nThe University of Minnesota’s Station WL8 has the distinction of broad¬\ncasting SIXTEEN OF THE MINNEAPOLIS $YMPHONY 0rCHESTRA*8 CONCERTS THIS\nSCHOOL YEAR, AND IN ADDITION IS PREPARING LISTENERS FOR THE OTHER ORCHESTRA\nPROGRAMS *\nBefore each of the orchestra's Friday evening subscription concerts* a\n45-minute preview program is broadcast on which the music IS 01SCUSSED\nAND RECORDED EXAMPLES ARE PRESENTED* *N MANY CASES* THESE PROGRAMS ARE\nBASED UPON INTERVIEWS WITH THE SOLOISTS APPEARING WITH THE ORCHESTRA*\nTen AFTERNOON TWILIGHT CONCERTS AND SIX YOUNG PEOPLE * S CONCERTS ARE ALSO\nTO BE BROADCAST THIS WINTER* ^OLOISTS FOR THESE PROGRAMS INCLUDE SUCH\nFAMOUS STARS AS ROBERT CaSAOESUS* PIANIST; CLAUDIO ARRAU, PIANIST; JOSEF\nSzI GET I , VIOLINIST, AND THE St* OtAF LUTHERAN CHOIR*\nClose cooperation has been arranged with the St* Paul and Minneapolis\nPUBLIC SCHOOLS IN THE PROMOTION OF THE SIX YOUNG PEOPLE8 S CONCERTS, OF\nWHICH THREE ARE PRESENTED IN EACH CITY* 0EFORE EACH CONCERT, BURTON PaULU*\nManager of WL8, presents two broadcasts for. school children who plan\nEITHER TO ATTEND OR TUNE IN THE PROGRAMS*\nAlthough the Minneapolis ^ymphCny programs highlight $LB8s musical\nSCHEDULETHE STATION ALSO HAS MANY OTHER PROGRAMS OF LOVE AND RECORDED\nmusic* Some of the Boston Symphony concerts have been carried at the\nTIME THEY ORIGINATE OVER THE BLUE NETWORK, AS WELL AS NBC ORIGINATED\nPROGRAMS BY THE U* S* MARINE BaND0\nGREEK MYTHOLOGY ON K 0 A C\nKOAC, Oregon’s educational radio station, at Corvalis, Oregon, has opened\nA SECOND SEMESTER OF GREEK MYTH DRAMATIZATIONS ON THEIR SCHOOL OF THE Ajr\nseries, \"Stories That Live.\"\nDuring the fall semester, the weekly broadcasts brought to life the\nHUMAN QUALITIES AN DAOVENTURES OF GREEK GqDS* THIS SEMESTER THEY TURN TO\nthe Heroes for dramatic situations taken from the abundance of fine stories\nAVAILABLE."
}