{
  "id": "d1132-4",
  "text": "NA£8 NEWS UTTER\nPage 5\n$ARCH U 1944\nIn discussing this choice of program material Program Manager Aulen Miller\nstates that \"A full understanding of our heritage of literature cannot BE\nACHIEVCD WITHOUT A KNOWLEDGE OF MYTHOLOGY0 THIS IS TRUE BECAUSE OF THE\nFREQUENT REFERENCE AND ALLUSION TO MYTHOLOGY MADE BY MOST OF THE GREAT\nWRITERS OF THE WORLO. Any OPERA-GOER, STUDENT OF ART, ANY READER OF\nCURRENT NEWS EVENTS WILL BE AWARE OF THE FREQUENCY IN WHICH MYTHOLOGICAL\nCHARACTERS APPEAR IN OUR DAILY LIVING.\"\nWith this in mind, KOAC's plans for the future include a treatment of\nScandinavian myths, folk-tales of Germanic origin and materpieces of\nWORLD LITERATURE IN NOVEL SHORT-STORY AND DRAMATIC FORMS IN THE hStORIES\nThat Live*1 cycle.\nThe selection of myths to be explored is based upon the amount of influence\nWHICH THEY HAVE UPON THE CULTURE OF THE ANqlO~3aXON WORLOo Few MYTHS ARE\nBASED UPON AN HISTORICAL ACCOUNT, BUT THAT FACT IS RELATIVELY UNIMPORTANT\nWHEN WE CONSIDER THESE TALES AS A VITAL FORM OF ART TO BE COMPARED WITH\nMUSIC, POETRY AND THE DRAMA.\nTHE PRODUCTION OF DRAMATIC SHOWS UTILIZING NONPRCFESSI ON At, ACTORS HAS\nBECOME A MAJOR PROBLEM THESE DAYS IN MOST RADIO WORKSHOPSr KOAC HAS\nSUPPLEMENTED IT8 PEACE-TIME CASTING FILES, WHICH FORMERLY LISTED ONLY\nCOLLEGE SPEECH MAJORS, WITH HIGH SCHOOL STUDENTS, COLLEGE WOMEN, AND\nASTP SOYS.\nDrama director Ray Hamby writes and produces \"Stories That Live,\" and\nCASTING IS DONE BY MRS. PhESE Cox, SCHOOL OF THE Ajr DIRECTOR.\nW N V C CARRIED FIFTH ANNUAL MUSIC FESTIVAL\nThe Fifth Annual WNYC American Music Festival, held between the birthdays\nof Lincoln and Washington, is now history —and, says Director Se Nov k,\nCAN \"BEST BE SUMMED UP BY QUOTING H|S HqnOR MaYOR F£ He LaGuaRDIA8S RECEN^\nremark in his \"Weekly Talk To The People\". Sa6d the Major, \"The Festival\nIS REALLY A BEAUTIFUL DEMONSTRATION OF MUSIC, AND IT GIVES EVERYBODY AN\nOPPORTUNITY TO CATCH UP ON THEIR MUSIC ONCE A YEAR.\"\nAs TO THE SUCCESS OF THE F|FTH FESTIVAL, THIS IS WHAT THE TWO LEADING\nMUSIC AND RADIO CRITICS HAD TO SAY. The FlFTH ANNUAL WNYC AMERICAN MUSIC\nFestival was, in the words of Olin Downes, dean of the Mew York music\nCRITICS \"..OF a SINGULARLY VARIED ANP DEMOCRATIC NATURE.... AND THE GENERAL\nPRODUCTIVENESS OF THE FESTIVAL AND THE ACCEPTANCE OF CERTAIN OF ITS\nPRODUCTS BY A WIDE PUBLIC CONSTITUTE PROOF OF (THE Fe3TIVAL*s) USEFULNESS. **\nSen Gross, dean of the New York radio critics commented that, *\\t (WNYO\nFifth American Music Festival) presents music not as a dilletante's oelight\nBUT AS THE LIVING VOICE OF A VIBRANT PEOPLE.\"\n\"And this year's WNYC American Music Festival was indeed a gala affair-\neleven PUBLIC CONCERTS AT ALL OF THE CITY*S LEADING MUSIC HALL9J 148\nPROGRAMS OF SMMPHONY, CHAMBER MUSIC, FOLK SONGS, CHORAL MUSIC, JAZZ, AND\nOPERA; FEATURING FIVE LEADING STRING QUARTETS; FOUR DIFFERENT SYMPHONY\nORCHESTRAS; AND PRESENTING OVER 57 PREMIERES OF NEW COMPOSITIONS.H\nFREC MEETS IN WASHINGTON\nAnnouncement of additional wave lengths requested for educational radio\nSERVICE, PRESENTATION OF THE PRELIMINARY REPORT OF THE COMMITTEE ON"
}