{
  "id": "d1132-6",
  "text": "NAEB NEWS LETTER\nPage 7\n. «► * .March I » I 944\nMore than 12,000 British schools regularly use the educational radio pro¬\ngrams PRESENTED BY THE BRITISH BROADCASTING COMPANY, M|SS EvELYN Gl9B3\ntold the FR£C0 This is approximately one third of all British schools.\nMiss Giaes and Sir Gerald Campbell, British Minister, described the BBC\nEDUCATIONAL PROGRAMS WHICH NOT ONLY ADDRESS ELEMENTARY AND SECONDARY\nSCHOOL CHILDREN BUT ALSO SERVE OUT-OF-SCHOOL TEEN AGE GROUPS AND ADULTS*\nBBC* s EDUCATIONAL STAFF WORKS WITH A NATIONAL ADVISORY COMMITTEE OF\nEDUCATORS TO DEVELOP A BALANCED AND SERVICEABLE PATTERN OF DAILY\nEDUCATIONAL PROGRAMS WHICH HAVE GROWN STEADILY *N POPULAR 8 TY « ADULT\nAUDIENCES FOR THE EDUCATIONAL RADIO PROGRAMS ARE KNOWN TO BE IN EXCESS\nOF 3,000* 000 o .\nSCHOOL AOMINISTRATQftS MEET \\H CHICAGO\nThe Radio Section of the Wartime Regional Conference of the American\nAssociation of School Administrators met February 29th in the Auditorium\nof the Board of Education Building at 228 North LaSalle Street, Chicago*\nThere was a display of equipment, both FM and AM, exhibits of work done\nBY SCHOOL CHILOREN AFTER HEARING RADIO PROGRAMS, AND A PHOTOGRAPH\nEXHIBIT OF STATION W8QE, BOARD OF EDUCATION STATION AT CLEVELAND IN\nCONNECTION WITH THE MEET®\nPlanneo were: the General Electric ^ilm, “Listen, Jt°s FMtt to be shown\nFOLLOWING THE MEETING IN THE STUDIOS OF WBEZ, STATION OF THE CHICAGO\nPublic Schools® Warren Bow, Superintendent of Schools, Detroit,\nMichigan was to be chairman of the panel made up of: Charles Ha Lake,\nSuperintenoent, Cleveland Public Schools; George Jennings, Acting Director,\nChicago Badso Council - WBE3, Chicago Public Schools; Judith Waller,\nDirector, Public Service, Central Division, NBC and William Dow Boutwell,\nDirector, Information Service, U® S0 Office of Education® Anna Bell\nRobinson, teacher from the Medill Elementary School and Austin *£« Ryan,\nPrincipal of the Scammon School were to act as recource persons, telling\nOF THEIR EXPERIENCES WITH RADIO IN THE CLASSROOM, ACCORDING TO PLANS\nMADE FOR THE MEETING*\nDOTS AND DASHES\nCapt. Harold a. Engel, assistant director-qn-leave from WHA, visited the\nSTATION EARLY IN FEBRUARY, EN ROUTE FROM SEATTLE TO A POOL OF EDUCATIONAL\nOFFICERS ON THE EAST COAST« By Ffs* 10 CaPT„ £nGEL WAS BACK IN MaOISON\nON A 30-DAY ASSIGNMENT TO THE ArmY*S EXTENSION AND CORRESPONDENCE SCHOOL*\nthe Army Institute headquarters at Madison*.**Wallace Garneau, Western\nState College, Kalamazoo, Michigan has forwarded two scripts for the\nNAEB Script Exchange: “Would You End War?” and “Building for Peace.w.<,**\nGarneau also reports that We have filed application with the FCC for\nan FM station.Ho•..Received just a day too late for the February 1st\nNews Letter was this note from £. W0 Ziesarth, Acting Oirf.ctor of WLB,\nUniversity of Minnesota: \"I'd like a man who can make a fairly decent\nappearance on the air for a half-time job* He could do graduate work\nTHE REST OF HIS TIME, OR THE JOB COULQ PROBABLY BE MADE A THREE-QUARTER”\nTIME PROPOSITION IF HE PREFERRED* IF YOU HAVE ANYONE IN MIND, WILL YOU\nTELL HIM TO SHOOT ME AN APPLICATION AS SOON AS POSSIBLE.\".*.* INCI DENTALLY,\nBurton Paulu, Oirector of WLB, is on leave of absence with OWI*...oWNA0,\nUniversity of Oklahoma, joineo the Associated Press “PA\" wire on\nFebruary 57*"
}