{
  "id": "d1583-0",
  "text": "/N-A-E-B news-letter\nr NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nEdited by Harold A. Engel, President\nStation WHA, University of Wisconsin, Madison, Wisconsin\nJuly 1, 19U7\nWHAT PRICE POLITICS?\nApparently the football season opened on June 21 in Washington-with appoint¬\nments to the FCC in the role of the pigskin! On that day President Truman withdrew\nthe nomination of FCC Commissioner Ray C. Wakefield from the Senate and substituted\nthe name of Representative Kobert F. Jones.\nPress reports on the deal indicate that GOP leaders high pressured the President\ninto the change because Wakefield was not \"a genuine Republican”• The man whose\nnomination they approved is ’’regarded as a conservative Republican”. He has \"always\nstayed well within the party reservation and bitterly opposed the Administration\".\n(Broadcasting, June 23, 'hi)* Mr. Jones is listed as holding an 1Q% interest in\nthe Northwestern Ohio Broadcasting Corporation which recently received a grant for\nan FM station in Lima, Ohio. That corporation also has an application in for a 1 Kw..\nstation on the 1150 Kc. frequency, in the same area.\nThis is an ill omen for those who expect the FCC to serve fearlessly in line\nwith the precepts of the Radio Act. Commissioner Wakefield’s record of service is\nabove legitimate criticism. While his sin is said to be that he is not a \"genuine\nRepublican\", we are inclined to look beyond that to decisions which did not cater to\n\"industry\" wishes and to those who would have him out of the way. It never wan\nintended that the regulated should select the regulators.\nDURR NEXT? ASKS BILLBOARD\nBillboard (.June 28, *1+7) headlines .ts story \"Durr Next On GOP Hatchet Mon List?\nJones Sure of OK\". It goes on to say, \"GOP leaders are already lining up their\nsights on Clifford J. Durr, as the second victim of what appears to be a general\npurge of the FCC after the scuttling of Commissioner Ray C. Wakefield this week in\na comedy of White House errors\".\nThe comedy in the situation is very vague. Commissioner Durr’s term expires on\nJune 30, 191+8. His record of service in behalf of the interests of listeners needs\nno amplification. By all that is right he should be returned to the FCC. The\nopposition to his reappointment is wealthy,, influential and vocal. This is a story\nwhich must be told-in the right places. Tell it',\nFM RECEIVER OUTLOOK\nUndercover Buzz indicates that ?;e may expect several manufacturers to have\n1FM-AM table model receivers in the under-fifty-dollars class available by fall. If\nsuch sets had been turned out in lieu of the small AM models which now flood the\nmarket, everyone would have been better served. The outlook definitely is better,\nFLORIDA PLANS EXPANSION\nGarland Powell, director of WRUF at the University of Florida reports that his\nstation is seeking authority to operate at night with full power. It involves the\nuse of a directional antenna to protect 'WHDH and Cuba.\nFlorida also anticipates putting in its FM application when its AM alterations\nare completed.\nVice-President\nRobert J. Coleman\nWKAR\nEast Lansing, Mich\nTreasurer Executive Secretary Executive Committee\nW. I. Griffith M. S. Novik Waldo Abbot, Michigan Milford C. Jensen, WCAL. St. Olaf\nWOI 30 Rockefeller Plaza John W. Dunn, WNAD, Oklahoma James S. Miles. WBAA. Purdue\nAmes. Iowa New York. N. Y. Richard B. Hull. WOI. Iowa Slate Russell Potter, Columbia"
}