{
  "id": "d1583-1",
  "text": "-2-\nBLOCK PROGRAMMING AT PURDUE\nDuring this summer, WBAA is trying out block programming, reports Jim Miles.\nHe says, \"Every hour of the day was taken as a unit, and programmed with the same\ntype of program so that we have classical music for an hour, popular music for an\nhour, and talk program for an hour, Ofttimes these are more than one hour segments.\nFor instance, each afternoon has two hours of classical music followed by an hour\nand a half of popular music,\n\"We are maintaining our educational hour from 7:00 to 8:00 each evening using\ntranscriptions during the first half hour and telling stories for the kiddies during\nthe second half hour which we are calling \"Storyland Special.\" Fifteen minutes of\nthis is for the I4.-7 age group, the other fifteen minutes will be devoted to con¬\ntinuous reading of children classics such as Tom Sawyer and Kidnapped.\"\n\"Occupying our attention is our fall term School of the Air. We plan now ten\nprograms for the primary and intermediate grades, and five programs for high school.\nAt least twelve of these are written and produced by the station staff,\"\nSIEGEL TURNS SCRIBE\nThe lead article in the June issue of FREQUENCY MODULATION BUSINESS is \"FM* s\nProgramming Outlook\" by Seymour N, Siegel of WNYC. He puts over some good ideas on\nlive program sources which may apply equally well to AM stations. He contends that\nit is possible to compete favorably with \"Hooped-up\" features. Read the article,\nMICHIGAN SUMS IT UP\nWaldo Abbot has taken stock and gives a report on radio at the University of\nMichigan for 19l*6-li.7, During the year they broadcast 960 programs (110 were half-\nhour shots) over six commercial stations. Included were programs from many depart¬\nments in the University,\nCertain scripts were duplicated and copies made available for listeners. On\nthe \"Stump the Professor\" program 951 letters were received from 33 states and Canada.\nMEMBERSHIP APPLICATIONS\nf0il owing applications for membership in the National Association of\nEducational Broadcasters havebeen received. This publication constitutes notice to\nall members. Unless negative votes are received within thirty days, all members will\nbe recorded as voting in favor of granting such membership, and the constitutional\napproval requirement will be thus complied with.\nFor Active Membership\nUniversity of Tulsa Tulsa, Oklahoma Ben G. Henneke\nFor Associate Membership\nPennsylvania \"State College, State College, Pa,, J. 0. Keller\nMemberships Aooepted\nUniversity of Alabama (Active)\nAlabama College for Women (Associate)\nU.S. Office of Education, Dr. Franklin Dunham (Associate)\nUniversity of Tulsa The institution is operating its own FM station KWGS.\nThe station went on the air on May 15, 19U7 on the 90.5 Me. frequency. In\naddition to its FM operation, Tulsa provides weekly programs for five local\ncommercial AM stations. Ben G, Henneke, professor of Speech, is supervising\nthe broadcasting activity.\nmiBERgHIp INVITATI0N ~\nNAEB invites to active membership institutions owning and operating their\now n AM or FM broadcasting stations. Holders of FCC CPs for stations are\n; eligible also.\nAssociate membership is available to institutions carrying on educational\nbroadcasting activities over facilities not their own, and to individuals\ninterested in the field. Write for an application blank._"
}