{
  "id": "d738-2",
  "text": "hr. Frank K. schooley\narc!. 2k, 1939\nPage #2\ncase -shich Is not as yet in production, but will be\nable to ship at a later date for test and which should\nbo popular for School use due to two very valuable\npoints. One being fcse of a 100 synchronous motor,\nand the ether Its low list* under #200*00. One can\nbe sent vou in the not too far distant future if you\ndesire, for test*\nlo are at the moment holding shinmeat because your\nletter does not indicate current voltage and frequency\nw ich we assume is IIOV - 60 cycle*\n•ill you kindly advise by return air mail as to above\nand shipment will be made promptly*\nAbout the only thing the- writer regrets in regard to\nyour tests is the fact that no time or temperature or\nhumidity tests are conte plated as we feel sure a lot\nof inform: Hon of practical future use i.y.t be gained*\nIn this connection it might be in order for the writer\nto recite to you what we have found in our several\nyears of building recorders • nd ship *ing to nearly all\nforeign countries.\nA. That temperatures have a very deoided effect on\nfrequency resfjonse «.;f most cutting cads* le do not\nconsider that a cutting containing any element that\nis adversely effected by 110 degrees of heat or 95\nhumidity or both is valuable*\nB* dor do we consider any cutting mead t~ at is effected\nby winter temperatures down to 4d degrees below zero\nis valuable.\nIn this connection, some months ago we had a most complete\ntest made of our Aircraft ..hero hone made by the Depart-\nment of Air Commerce (How C.A.A.) and were issued approv¬\nal numbers for excellence of performance. Curing tests\nwe put three of our cutting heads through the tests\nalong wit the microphones, therefore when - e say that\nour cutting heads will operate in any climate from the\nArtio to the tropics we know they will do so because we\nhave already tested them nder identical conditions.\nour Cutting heads are unconditionally guaranteed for life.\ne are enclosing a sheet on our Aircraft:.microphone tests\nso as to advise you more in detail to what the actual\ntests consisted of.\nThanking you for writing us and for the opportunity to\nsubmit our product for test, we are\nYours very sincerely.\nCOsKbel\nend .1\n.TPS’? mm"
}