{
  "id": "d738-39",
  "text": "BAND INSTRUMENTS\nELKHART, INDIANA\nNovember 24, 1939\nMr. A. James Ebel\nStation WILL\nUrbana, Illinois\nDear Mr. Ebel:\nWe have received the report on \"Instantaneous Recording Machines\"\nwhich we ordered early this month and would like to congratulate\nyou upon the carefulness and completeness of the tests which\nyou made. Where we could make comparison with tests we had run\nwe found the differences quite small.\nOne test which we did not run was the curve of optical pattern\nwidth against electrical input. The departures from linearity\nwhich you showed were quite surprising to us. Incidentally,\nis the electrical input on your curves plotted in millivolts\nor decibels, and is the pattern width in millimeters or deci¬\nbels? It would seem that such a curve would be one way of\ngetting the distortion introduced with increase of amplitude.\nHowever, we have found that there can be considerable distortion\nin the wave form without it showing up very markably in the am¬\nplitude response curves. At the present time we are beginning\nto work with a method involving picking up the wave on the re¬\ncord, examining it with a cathode ray oscilloscope, and measur¬\ning the harmonic distortion terms with a Q-eneral Radio noise\nanalyzer. We are using a Sound Specialties Co. dynamic pick¬\nup. This gives for the second, third and fourth harmonic terms\nrespectij^ely ^and of the amplitude of the fundamental\nat 1000 oycies. ' When percentage distortion terms are plotted\nagainst electrical input, curves similar to those shown on the\nenclosed blue print are obtained. I would be glad to have your\ncomments on this method.\nYou might also be interested in the turntable stability test\nwhich we use, even though it is at present qualitative rather\nthan quantitative insofar as rapid fluctuations are concerned.\nYou may be familiar with the Conn Chromatic Stroboscope which\nwe manufacture for sale to schools and for related uses. In\ncase you are not, I am enclosing a sheet describing it. We\ncut a 440-cycle tone from our temperature controlled secondary\nstandard and play it back, picking up the sound with the\nmicrophone of a Chromatic Stroboscope. If the frequency of"
}