{
  "id": "d738-41",
  "text": "Conn Chromatic Stroboscope\nC. G. Conn, Ltd.\nElkhart, Indiana\nFeb. 2, 1938\nThe Chromatic Stroboscope is a device for the precise and rapid measurement of\nfrequencies in the range represented by the piano keyboard. By an entirely visual\nmethod, the deviation of a given tone from the equally tempered scale based on the\nstandard A of 440 cycles per second may be read directly. The Chromatic Strobo¬\nscope may be used in piano and organ tuning, investigations of pitch, and musical\ninstruction and demonstration.\nTHE frequency of any tone lying within the\nrange of the piano keyboard may be deter¬\nmined directly with the Chromatic Stroboscope.\nIn the Stroboscope Unit, as seen in Figure 1, there\nare twelve windows having the relative positions\nof the white and black keys of the piano keyboard.\nThe twelve notes of the chromatic octave starting\nwith C are thus represented. Sound picked up\nby a microphone causes these windows to be\nilluminated.\nSuppose, for illustration, that a piano is availa¬\nble tuned exactly to standard equal temperament,\nwith the “A” string executing 440 vibrations per\nsecond. Now if this A is sounded, there will\nappear across the center of the “A” window a\ncharacteristic stationary pattern composed of\nalternate light and dark bars (See Figure 2).\nUpon sounding the A an octave higher, a similar\npattern appears in the same window, except that\nthe number of bars is doubled and the position\nshifted. Space is provided for seven octaves, so\nFigure 1). Since there are twelve windows, space\nis provided for 7 x 12, or 84 notes, essentially\ncovering the range described.\nIf the piano string which was previously tuned\nto the standard A is now tightened, making its\ntone sharp, the characteristic pattern which\noriginally was stationary will move toward the\nright. Similarly any note which is somewhat flat\nwill cause its pattern to move toward the left.\nThe direction of motion thus serves to indicate\nwhether a given note is sharper or flatter than\nstandard. This test can be applied over the entire\nrange without any adjustment or delay between\nobservations, since all 12 windows are illuminated\nat the same time.\nUnder many circumstances it is not sufficient\nmerely to know that a note is sharp, correct, or\nflat. It is frequently very important to know how\nmuch a note departs from standard tuning. This\ninformation can be obtained by the simple ma-\nFig. 1\nthat any one of seven A’s within the piano range\ncan produce its own appropriate stationary\npattern.\nSounding the seven A#’s will similarly cause\npatterns to appear in the “A#” window, located\nabove and to the right of the “A” window (See\nnipulation of a single knob.\nTake for example the A on a piano which has\nbeen tuned flatter than standard, say to 435\ncycles per second instead of 440. In the “A”\nwindow a pattern will be seen moving toward the\nleft. Now by moving the knob on the Fork Unit"
}