{
  "id": "d738-44",
  "text": "Conn Chromatic Stroboscope\nUse in the Physics Laboratory\nThe Chromatic Stroboscope is essentially a\nlogarithmic frequency meter, having an accuracy\nof frequency determination of about 1/20% (0.01\nof a semitone) in the continuous range of 32 to\n4070 cycles per second. The instrument is direct\nreading in the logarithmic unit, the semitone, but\nresults may be expressed in cycles per second,\nwhen required, by the use of a suitable table. A\nvisual null method is employed, and the frequency\nmeasurement is substantially independent of\nwaveform or amplitude.\nA particularly interesting application is to the\nmeasurement of the inharmonic overtones of\nstruck strings, bars, and bells, advantage being\ntaken of the selective action mentioned before.\nThe convenience of the Chromatic Stroboscope in\npermitting rapid and accurate frequency measure¬\nments should make it a highly useful piece of\napparatus in the general physics laboratory as\nwell as in one devoted to sound measurements.\nPrinciple of Operation\nThe method of measurement employed in the\nChromatic Stroboscope is, as its name implies, a\nstroboscopic one. A familiar example is often\nnoted in motion pictures when a wagon wheel\nappears to stand still, revolve slowly forward, or\nrevolve slowly backward. Twenty-four frames of\nthe film are projected onto the screen per second.\nIf the spokes of the wheel are revolving at the rate\nof 24 spokes per second, the wheel appears to\nstand still. If slightly more than 24 spokes pass a\ngiven point in a second there is a gain on the film\nspeed, and the wheel appears to rotate slowly\nforward. Similarly if there are fewer than 24\nspokes passing per second there is a lag on the\nfilm speed, and the wheel appears to rotate back¬\nward. The spokes appear stationary only when\nthe rate at which the pictures are projected equals\nthe product of the number of spokes by the num¬\nber of wheel revolutions per second.\nIn the present case, a gaseous discharge tube is\nmade to flash in accordance with the pulsations of\nthe sound reaching the microphone, and its light\nilluminates a series of twelve rotating disks which\nare seen through the twelve windows. Each of\nthese disks is imprinted with the pattern shown in\nFigure 3, consisting of seven rings of alternate\nlight and dark segments. Each ring, progressing\nradially, has twice as many segments as the pre¬\nceding one. When the number of light pulses per\nsecond is the same as the number of dark seg¬\nments passing per second on*some ring on one of\nthe disks, that ring will appear to stand still. Since\neach disk has seven rings of segments, it is suitable\nfor checking the seven octaves above its funda¬\nmental speed of rotation. As an example, the\n16-segment ring of a disk rotating at 27.5 revolu¬\ntions per second will appear stationary when\nilluminated by light flashes occurring at the rate\nof 440 per second.\nThe Disk Drive\nSince seven octaves are cared for on a single\ndisk it is only necessary to provide 12 disks, one\nfor each chromatic note within the octave. This is\nthe reason for the first part of the name “Chro¬\nmatic Stroboscope.” The speed ratio between ad¬\njacent chromatic disks should be that of the\nequally tempered semitone, that is, the twelfth\nroot of 2. It is, of course, impossible to obtain this\nirrational ratio by any definite numbers of gear\nteeth. However, by the successive use of the two\ngear ratios 89/84 and 107/101 in alternation an\nexceedingly close approximation to true equal\ntemperament is obtained.\nFor standard tuning the A disk is driven at\n27.5 revolutions per second by a synchronous\nmotor supplied with 55-cycle power by the Fork\nUnit. Calibrated sliding weights on the tuning\nfork permit variation of its frequency over a semi¬\ntone, and since all disks have their speeds changed\nby the same fractional amount, some combination\nof disk pattern and speed can always be found\nwhich will correspond to any frequency in the\nrange of 32 to 4070 cycles.\nIt should be noted that all measurements in this\nwide range are really made by comparison with a\nsingle electrically maintained tuning fork which\nhas been designed to minimize frequency errors\nresulting from supply voltage and temperature\nchanges. Furthermore, since the disks are intercon¬\nnected by gears and are not controlled by separate\nforks, an equal temperament is assured at all times.\nThus a single accurately known standard, such as\nthe 440 cycle tone being broadcast regularly by\nthe National Bureau of Standards, suffices to\ncheck the calibration.\nThis arrangement, by which a single, carefully\nbuilt fork may serve as the standard for all\nmeasurements, is the basis for the high order of\naccuracy and reliability attained in the Chromatic\nStroboscope.\nPrinted in U.S.A.—10-18-38—LG—HWS"
}