{
  "id": "d738-81",
  "text": "Radio Station\nW-l-L-L\nL\nKNIGHT MODEL 10-R-12 HEGfl.gjjER - EXCLUSIVE \"DUAL ACTION”\nCONTROL FOR 10” OR 12^RECOftBlNO - EQUIPPED FOR 78 RPM -\nOPTIONAL CHANGE OVER FOR 35-1/3 RPM - INTERCHANGEABLE\nDRIVE SCREW FOR IN OR OUT RECORDING SIMPLICITY OF\nOPERATION ASSURES CONSISTENT RECORDING.\nIn designing the KNIGHT Model 10-R-12 recorder, the main purpose\nwas to produce a device so simple as to assure good results even\nwhen operated by a person of limited experience.\nThe KNIGHT 10-R-12 recorder differs greatly in many mechanical\ndetails from any previous device. It incorporates exclusive\ndesign features throughout which render it completely foolproof\nand simpler in operation than any other recorder on tbs market.\nIn addition, all adjustments have been either carefully set at\nthe factory or designed so as to make it difficult for meddlers\nto alter them.\nThese unusual mechanical features of the KNIGHT 10-R-12 recorder,\nmake it ideal for school and home use assuring consistently\nuniform and excellent results with a minimum of experience in the\nart of recording.\nThe most outstanding feature of this new recorder is the exclusive\n\"Dual Action” control which automatically eliminates record spoil¬\nage and needle breakage, for it is impossible to drop the re¬\ncording head on the record. This control also makes it possible\nto halt a recording and later continue the recording cut without\nany gap on the record. The \"Dual Action” control eliminates the\nweight previously required on the record head. It lowers the\nrecording head to the record surface at the sanB time automatically\nengaging the recording head with the spiral drive screw, all with\nthe mere twist of the one control knob. All complicated ad¬\njustments are done away with by the \"Dual Action” control.\nThe recorder turntable has an internal rim drive powered by a\nl/60 h.p., 110 volt, GO cycle motor- This turntable is\ndynamically balanced and made of cast aluminum carefully\nmachined and furnished with a rubber record pad. The recorder\nis adjusted to run at 78 R.P.M. but a drive stud for 33-1/3\nR.P.M. is available at a slight additional cost, and the unit\ncan be quickly changed for either speed. The rim drive roller\nhas a friction release of the semi-permanent type but release\nis not necessary, unless the recorder is to be unused for a\nperiod of months.\nThe KNIGHT recorder features an overhead lead screw drive which\nis completely enclosed to protect it from dirt or damage. The\nstandard screw provided is for 100 lines per inch, cutting"
}