{
  "id": "d738-82",
  "text": "-2-\ninside out, but other threads are available at a slight\nadditional cost. All drive screws are machined with the deepest\nthread available, insuring positive feed and long wear. In\naddition, the driving nut consists of 5 threads as compared with\nthe usual single thread, thereby minimizing error in the cutting\nspiral.\nThe cutting head is of the horizontal magnetic type to reduce the\nweight of the moveable mass, and is automatically compensated for\nover-cutting on the low frequencies.\nThe cutter has a smooth response from 70 to 5000 C«P.S. and is\nfree from objectionable peaks. Cutter impedance is 500 ohms,\nother impedances are available at a slight additional cost, if\nspecified *\nTo operate the recorder it is only necessary to turn the \"Dual\nAction\" control lever which automatically engages the drive screw\nwhile it lowers the cutting head. This unique feature precluded\nthe possibility of damaging the cutting, thereby avoiding waste of\nneedles and records so common in this field.\nThe recording head carriage automatically stops at the end of the\n12\" blank ?::zord, preventing the jamming of the lead screw and\nnut and a In; protecting the needle.\nThe playback pickup is also a new and recent development, the new\nSymphonic pickup, utilizing a new inductive dynamic principle.\nThis is a wide range pickup capable of a more linear frequency\nresponse than any similar device, assuring unusual fidelity of\nplayback reproduction. Another desirable feature is the extreme\nliglitness at the needle point minimizing needle wear so\nessential with acetate recording.\nThe KNIGHT 10-R-12 recorder is housed in a heavily constructed\nleatherette carrying case for portability and equipped with a\nremovable cover©\nE12381 - Price complete as described with carrying case $99.50\nADDITIONAL ACCESSORIES FOR KNIGHT 10-R-12 PORTABLE RECORDER.\nR-33 33-1/3 R.P.M* drive shaft pulley for\nconverting ll-R-12 for 33-1/3 R.P.M.\nrecording -*p4 • 34\nRWG Special worm and worm gear for changing\nll-R-12 from inside out to outside .in\nrecording. $5.34\nRLS Spiral lead screws and nut for cutting -\n90, 100, 120, or 140 lines per inch.\nSupplied to order only. Specify which\ntype desired when ordering. $10.00\nACCESSORIES ARE AVAILABLE ONLY ON SPECIAL ORDER\nAND ARE NOT CARRIED IN STOCK."
}