{
  "id": "d738-90",
  "text": "Amplifier - Model RA1Q built in Models 212RC or 16RC Combinations (Fig.A.j\nTurn amplifier Master switch’\"'(15) 'HgTE. located on extreme left of ampll-\nfier panel, to \"ON\" position. Permit amplifier tubes to heat properly for\nabout thirty seconds. Amplifier is then ready to record. Familiarize your¬\nself with all controls on amplifier panel first (Fig.A.)\nTo record from microphone, proceed as follows: First, make certain that\nvolume controls marked' '\"Selector Volume\" (13) Fig.A., and \"External Input\nVolume\" (14) Fig.A. are turned all the way to the left to the \"OFF\" or \"0\"\nposition before making any other adjustments or connections. Turn switch\nmarked \"Selector\" (12) Fig.A. to position marked \"Micro\". Turn switch\nmarked \"Output\" Selector to position marked \"Record. Turn compensator\nswitch (16) Fig.A. to\"Speech\", if voice is to be recorded or to \"Music\nif music is to be picked up by microphone. Connect microphone by means of\nlock type screw connector to microphone connector (10) Fig.A. provided on\nuppor right hand corner of amplifier panel marked \"Microphone . Turn Se¬\nlector Volume\" control to proper recording level which is indicated by the\nswing of the needle on the meter (15)Fig.A. To determine proper level\nplace microphone before the person making the record and have him speak in\na normal tone. Advance the selector volume control until the needle swings\nto \"0\" on the scale for maximum peaks. If the average swing of the needle\ngoes beyond \"0\" the volume is too high, and should be reduced by turning\nthe control down toward the left. If the needle barely swings on the lower\nend of the meter scale, then the volume is too low and the control should\nbe advanced toward the right until the proper needle swing is attained.\nAfter recording level has been determined, make sure cutting head carriage\nis set ready for recording as described above in paragraph \"To Record\".\nSee that idler release knob is in the \"ON\" position, then turn motor switch\n(8) Fig.A. \"ON\" to start turntable rotating. Slowly lower dual action con¬\ntrol lever on cutting head carriage all the way down to its full stop. If\ncutting head lever is lowered rapidly, the blank record may be damaged and\nthe carriage may skip one thread of the lead screw. Lower control lever\nslowly* (For adjustments for depth of cut, etc., refer to \"Adjustments ).\nWhen through recording, turn control lever upward in a counter clockwise\ndirection all the way to its stop until it assumes a horizontal position.\nThen slide carriage to extreme left of cross-bar, turn motor switch off,\nlift cross-bar and swing it over to rest post on the right. Before sliding\ncarriage, make sure that control lever is raised to horizontal position to\navoid damaging lead screw. (9) Fig.A. After recording collect cut thread\nfrom record and roll into a ball. If acetate blank was cut, dispose of\nthread in metal container, as thread is inflammable. This precaution Is not\nnecessary with Phonoflex. NOTES: Recording level meter operates only in\n\"Record\" position of \"output Selector Switch\". If microphone is used dose\nby recorder while recording, feedback may occur. This is denoted by a squeal\nor howl. To remedy, merely remove speaker plug while recording.\nTo Play Back: - On Models 212RC and 16RC, first connect speaker by means of\n'cable and plugs provided, connecting plug to prongs on speaker. Insert\nmale plug in jack on lower left hand corner of amplifier panel marked \"Speaker\"\n(19) Fig.A. Turn \"Selector\" switch to \"Playback Pickup\", turn \"Output Se¬\nlector\" to \"Speaker\" position. Insert playing needle ln\"Playback Pickup\"\n(29) Fig.A. and place pickup on record at point where recording was started.\n\"Notes\") Turn motor switch on and then adjust \"Selector Volume to\ndesired volume level for reproduction. If ordinary commercial records are\nto be played, remove offset drive screw on the turntable before placing record\non table.\nRadio Recording or Dubbing:- ... „ _\nTo record from radio, an external input jack (11) Fig.A. is provided on lower\nright hand corner of amplifier panel* Connect two wires from voice coil of\nradio loud speaker to ordinary telephone plug and insert plug In jack marke\n-6-"
}