{
  "id": "d738-92",
  "text": "Recording Blanks\n7¥hen cutting Acetate blanks, the needle should be adjusted to protrude 3/8\nof an inch from the cutting head surface. It Is recommended that sapphire\nneedles be used for best results on Acetate, although steel needles are\nsatisfactory# When cutting Phonoflex blanks, a short cutting needle should\nbe used and it should be inserted all the way in as far as it will go before\nlocking in position.\nWhen cutting Phonoflex, the needle should protrude as little as possible\nfrom the cutting head surface.\nIt is recommended that steel needles be used for outting Phonoflex. Steel\nneedles should be changed after cutting the equivalent of three 12” double\nfaced blanks.\nADJUSTMENTS:\nTo Change Cutting Depth - Insert small screw driver In hole (3) Fig.A, at\nright of cutting head carriage and turn to right for lighter cut — to left\nfor deeper cut. A depth of cut indicator (5) Fig.A. serves as a reference\npoint to designate the depth of cut adjustment. The indicator moves up for\na lighter cut and down for a deeper cut. Make adjustment on a blank record\nsection as a test, varying the depth of cut until the desired cut Is obtained.\nThe cut thread Is an indication of proper cut. If thread Is dry and brittle\nthe record Is too dry and should not be used* Properly cut thread should\ngleam and should not crumble when handled. Only fresh record blanks should\nbe used.\nThe cut thread should be about the thickness of a hair and should clear the\nneedle by winding Itself around the drive post or at an inch or so from the\ngroove which is being out. Depth of cut is very important and no amount of\nprinted matter can properly describe It. Experience is the unquestionable\nteacher. Thickness of thread denotes depth of cut and this varies with weight\nof cutting head; quality and sharpness of needle; and age and quality of\nrecord blank.\nThe cut thread should not accumulate at the point of the cutting needle —\nshould be continuously undulated — almost wavy but not curly nor crinklede\nA little patience — extreme care — and an Intelligent handling of the re¬\ncorder will give extremely satisfactory results.\nTo Raise or Lower Turntable:-\nScrew and nut under main turntable bearing — 1/32” per complete turn. If\nthis adjustment Is changed, make sure that crossbar is horizontal to record\nblank within .005”. (Refer to ”Mechanical Data”)\nTo Take Up We&r on End Play:-\nScrew and Nut at right end of square crossbar (6) Fig.A. When a ’’pattern”\nor imperfection of cut groove Is visible, loosen nut and screw in end play\nadjusting screw by hand. Make adjustment carefully. Too tight an adjust¬\nment will cause the motor to slow down and produce ’’wows”. Too loose will\ncause an uneven groove cut.\nTo Change from 78 to 35-1/3 RPM;- Reverse idler drive wheel on 212RC and 212RP.\nTo Change from 100 lines per inch to others:- Standard recorders are sup¬\nplied with lead screws for 100 lines per inch. Other screws available: —\n90, 110, 120, 130, 140 lines per inch. Full instructions supplied with\nlead screw.\nTo Change for Inside-Out Cutting:-\nStandard 16” machines are supplied to cut inside-out. 12” Models are sup¬\nplied to cut outside-in. TO change either type machine for outside-in or\n-8-"
}