{
  "id": "d738-95",
  "text": "and pressure. However, there Is a remote possibility that these adjustments\nmight be loosened or jarred out of alignment. Check idler wheels (26) Fig.A\nfor 12\" Models or (8-12) Fig. C. for 16\" Models, making certain that no oil\nor grease is on the rubber surfaces of Idler wheels which would cause slip¬\npage. Also check idler bearing arms (28) Fig.A. on 12\" Models or (3-6-11)\nFig. C. on 16\" models to determine whether all parts move freely and are not\nbinding. Check Idler Tension Springs (25) Fig.A. for 12\" Models or (10)\nFIg.C. for 16\" models, to be certain that these springs are maintaining\nproper tension and have not loosened up or stretched, losing their spring\ntension, and that springs bring Idler wheels Into engagement with motor\ndrive shaft and turntable rim when idler release knob on 12* Models is in\nthe \"On\" position.\n\"Flutter\" or Cutting Head \"Wow\":-\n\"Flutter1* Is evidenced by a ripple or flutter in the reproduction when a\nrecord Is played back. This may be caused by the cutting head (34) Fig.A.\nbecoming loose on its hinges which would permit a sideways motion on the\ncutting head. This can be determined by grasping the cutting head between\nthumb and forefinger and moving It from side to side to ascertain whether\nthere is any looseness or play at the hinges in the rear of the cutting\nhead. This should be checked with the control lever (4) Fig.A. In the down\nor vertical position, to permit the cutting head Its maximum movement. If\nthe hinge adjustment is correct, cutting head should move freely up and\ndown but should have no wobble or play, sideways. To adjust cutting head\nloosen tension adjustment lock nuts (FIg.D.) as follows:\nFirst Insert screw driver In slot of tension adjustment screw, hold this\nsteady without turning, then with a small end wrench loosen tension adjust¬\nment lock nut. Now turn tension adjustment screw to right l/4 turn and then\nretighten lock nut keeping screwdriver in screw slot to prevent* it being\nturned further than already set, until lock nut Is tight. After adjustment\nIs made, test movement of cutting head as described previously. Cutting\nhead should move freely up and down with no play or wobble sideways. If cut¬\nting head moves up or down too stiffly, adjustment is too tight and this\nwill result In a \"wow\". If adjustment is too loose, recording yrill still\nreproduce a \"Flutter\". Make adjustment of tension screw as described above\nto permit cutting head to move freely and easily up or down with no play or\nwobble from side to side.\nMechanical Data:-\nThe idler wheels are equipped with oilite bearings and require a very small\namount of oil. Care should be taken in oiling to prevent the oil from com¬\ning in contact with the rubber. Idler wheels are mounted on a movable arm\nwhich automatically compensates for wear on the wheel and automatically in¬\ncreases and decreases the driving pressure as the load on the turntable in¬\ncreases or decreases. This feature minimizes \"wows\" due to changes in speed\ncaused by varying loads on the turntable•\nThe overhead structure consists of a center post, a crossbar and a swivel.\nThe lead screw is enclosed in a square protecting tubing. * Revolving in\nthe center post Is a vertical shaft to which a worm gear Is attached which\nIn turn Is engaged with a horizontal worm gear to which the feed screw Is\nsecured.\nThe lead screw which is enclosed in the square horizontal tube also has a\nbearing on its right-hand end consisting of a pointed steel screw and qut,\nwhich is visible at one end of the square tubing assembly.\nThe cutting head carriage slides over the square tubing and carries with it\nthe cutting head assembly pivoted at the rear of the cutting head carriage.\n-11-"
}