{
  "id": "d738-97",
  "text": "center main bearing. Care should be taken in loosening the nut first and it\nis advisable to remember that for every complete turn the turntable is lifted\nor lowered by 1/32”.\nAll Bogen recorders are designed for needles protruding 3/8” from the cutting\nhead plate for cutting Acetate blanks. In this position, it is possible to\ncut as far in as the cutting head carriage will permit, although this prac¬\ntice is not recommended in view of the fact that the quality is impaired a\ngreat deal at such small diameter of grooves.\nWhen the needle protrudes 3/8” the proper cuttihg angle is automatically\nobtained. If a greater angle Is desired, the needle should protrude more.\nIf a vertical position is desirable, then shorter needles should be used and\nshould protrude less than the amount specified. (Refer to \"Changing Cutting\nAngle”)\nPressure on the cutting head, which is the factor determining the depth of\ncut, may be changed by the adjustment provided for in the cutting head car¬\nriage assembly at the right of the control lever (3) Fig.A. The pressure\nIndicator (5) Fig.A. located directly underneath this adjustment and protrud¬\ning in a slot at the right of the control lever Indicates the position of\nthe pressure adjustment spring and It is only an indication as to the posi¬\ntion of the spring.\nIn view of the many types of record blanks and their consistency. It is im¬\npossible to accurately calibrate this adjustment in any way because the same\nadjustment gives a much deeper cut In a \"fresh” or \"soft” nitrate blank than\nIt would on a harder one.\nIt should be remembered that no definite instructions can be given as to the\ndepth of cut other than the fact that the shavings should be about the thick¬\nness of coarse hair. A light cut will offer less impediment to the motion\nof the cutting head and will result In better recordings; however, the cut\nshould be deep enough to insure proper tracking when played back. Generally\nspeaking, it is advisable to cut as lightly as it Is possible for the pick\nup to follow and a little experimenting along these lines is essential for\ngood recordings.\nThe phono playback pickup supplied with the recorder is of the symphonic\ntype, having a microphone output and should be connected like a microphone\nto the mike input and not to the phono stage.\nAmplifier Connections and Data RA6\nFigure F shows the connections and cables for the portable recorders. Models\n212RP and 16RP, when used in conjunction with the Model RA6 recording ampli¬\nfier.\nThe cutting head cable and pick up cable furnished with the RA6 amplifier\nare joined to one plug which is to be inserted at the amplifier. The cable\nseparates to two plugs which are Inserted into the recorder. The recorder re¬\nceives its power from the amplifier and the amplifier connects to the AC supply\nline by means of the AC cable provided.\nThe RA6 amplifier has a power consumption of 70 watts, on 117 volts AC, 60\ncycles.\nTubes Used: -1-6J7G, 1-6K5G, 1-6L6G, 1-5X4G.\nOperation of RA6 Amplifier and Recorder;-\nTo Record From Microphone:-\nRefer to Figure F in this description.\nConnect microphone to connector provided on upper left of panel. Connect all\n*13-"
}