{
  "id": "d738-98",
  "text": "cables as shown,\nTurn amplifier on by rotating ’’Volume” control in\ntil a click is heard. Keep ’’Volume” control down,\nrecord.\na clockwise direction un-\nhowever, until ready to\nTurn \"Tone” control full on to the right in a clockwise direction. This is\nthe brilliant position and is preferable in recording, as it is essential\nto record the entire frequency band.\nPlace ”Record-Play” switch in ’’Record” position.\nTurn ’’Volume” control to the proper recording level which is indicated by\nthe swing of the needle on the meter. To determine proper level place mic¬\nrophone before the person making the recording and have him speak in a nor¬\nmal tone. Advance the ’’Volume” control until the needle swings to ”0” on\n\"the scale for maximum peaks. The needle should not swing above ”0” at Any\nt ime.\nAfter recording level has been determined, make sure cutting head carriage\nis set ready for recording as described in paragraph ”To Record”. Slowly\nlower Dual Action Control Lever on Recorder all the way down to its full\nstop. If lever is lowered rapidly, the blank record may be damaged and the\ncarriage may skip one thread of the lead screw. Lower control lever slowly.\n(For Adjustments for depth of cut, etc., refer to ’’Adjustments*’.) When\nthrough recording, turn lever back counter clockwise to its horizontal posi¬\ntion. Then slide carriage to extreme left of crossbar, turn motor switch\noff, lift crossbar and swing it over to rest post on the right. Before\nsliding carriage make sure control lever is in horizontal position to avoid\ndamaging lead screw. After recording collect cut thread from record and\nroll into a ball, disposing of thread in a metal container, as it is inflam¬\nmable. This precaution is not necessary with Phonoflex.\nMonitoring during recording may be done with earphones by plugging into jack\non upper right of panel.\nTo Play Back:-\nTurn \"Play-Record” Switch to ’’Play” position.\nInsert playing needle In Playback pickup and place pickup on record at point\nwhere recording was started. Turn motor switch on and adjust ’’Volume” control\nup to desired level.\nAn external speaker may be used In place of the internal speaker by connect¬\ning a plug to the speaker leads and inserting it into the jack provided on\nthe panel to the right of the tube opening. This will automatically cut out\nthe internal speaker.\nIf a commercial record is to be played, remove the offset drive screw on the\nturntable•\nThe meter will not register on playback, but on recording only.\nRadio Recording or Dubbing:-\nTo record from radio or to dub another record, an external input jack is pro¬\nvided on the panel to the left of the tube opening. Connect two wires from\nvoice coil of radio loudspeaker to ordinary telephone plug and insert into\nthis jack. Turn \"Play-Record” switch to ’’Record” position. Tune radio to\ndesired station and adjust for proper recording level as described under ”To\nRecord from Microphone”. Proceed with recording as described In that section.\n.14."
}