{
  "id": "d860-116",
  "text": "Program Title: \"FREEDOM OF RELIGION\"\nRecord Title: \"DIVIDED WE STAND\"\nProgram 2\nHistorical Background\nJefferson's struggle for complete religious freedom in his own state, which\nhe afterwards described as the most severe of his entire life, extended over at\nleast ten years. In the radio program the action falls within a single session of\nthe Virginia legislature in 1776-1777, and there has been some telescoping of\nevents for dramatic purposes. The religious fight was fiercely fought in that\nsession and Jefferson, as a member of the committee on religion in the House of\nDelegates, was in the thick of it. Much was done to relieve dissenters at that\ntime and Jefferson himself believed that there was no extreme intolerance in Vir¬\nginia. But, as the script makes clear, he was content with no halfway measures and\ncontinued to press for complete separation of Church and State. He did not actu¬\nally present his famous Bill for Establishing Religious Freedom at this session,\nthough he probably began to draft it in 1777• It was formally presented two years\nlater, in 1779, when he was Governor; and it comprised a part of the recommenda¬\ntions of the famous Committee on the Revision of the Law (Jefferson, Edmund\nPendleton, and George Wythe). It was on this Committee that he did most of his\narguing with Pendleton. The bill was not passed until 1786, when Jefferson was in\nFrance as American Minister, and it was Madison who guided it through the legis¬\nlature. Jefferson's pride in it is shown by his request that it be mentioned on\nhis tombstone just after the Declaration of Independence. The Preamble was some¬\nwhat modified by the legislature, but the Act remains as an epitome of his phi¬\nlosophy of religious freedom and it is one of the landmarks in the history of liber¬\nty. A few years later the principle of the separation of Church and State was\nwritten into the basic law of the ttaited States in the first amendment to the\nExperimental Discussion Program Subject to Revision\n21"
}