{
  "id": "d860-117",
  "text": "Constitution.\nThe arguments for and against the separation of Church and State, as presented\nat this time, followed pretty much the line that they do in the radio script. Some\nof the characters, like McCormick and Mrs. Campbell, are imaginary, but Pendleton\ncertainly is not and particular care was taken to do justice to the position of\nthis noble conservative and lifelong friend of Jefferson. These men differed as\nfriends and they never ceased to be gentlemen. Madison's position is also true to\nhistory, though he was a very young man in 1776-1777 and. was much more prominent\nin the religious fight later than he was at this time.\nIn the script, the political conflict is set on the personal background of\nJefferson's deep concern for his wife's health - which was bad at this time for\njust the reasons assigned. The conversations between husband and wife, and husband\nand doctor, have been imagined, but everybody is in character. Jefferson and his\nfriend Dr. Gilmer joked in just this way about the state of medicine and his de¬\nvotion to his wife is in no sense exaggerated. He and she often played duets from\neighteenth-century composers, whether or not they ever played this particular bit\nfrom Mozart.\nArgument\nThe central ideas in this program are complete religious freedom and the en¬\ntire separation of Church and State. A supplementary idea, and in Jefferson's mind\nan extremely important one, is that religious diversity is not only inevitable but\ndesirable. His attitudes toward religious liberty and the freedom of the mind in\ngeneral are inseparable, and his emphasis on diversity extended to other fields\nbesides religion. Hence he appears here in his most characteristic role as an im¬\nplacable foe of any kind of enforced uniformity. To translate him into modem\nterms, he represents the complete antithesis to totalitarianism in any form.\nIn this program, however, we are particularly concerned with religion, and\none of the first questions which naturally arises is whether or not in this\ninstance the emphasis on freedom was not an expression of religious indifference\n22"
}