{
  "id": "d860-118",
  "text": "and an invitation to irreligion. It should he pointed out, therefore, that de¬\nspite the charges of later political enemies, Jefferson himself was not an irre¬\nligious man, and that in his private life he was notably moral. The clue to his\nattitude can be found in his conversations with Mrs. Graff in the first program.\nHie regarded religion as a strictly private matter which was nobody else's business,\nActually, he talked about personal religion very little, just as he was extremely\nreticent about private domestic matters. In the present program, he talked to\ndoctors about his wife and the beauty of his relationship with her is clearly\nshown; but he did not talk about her in public and there is no better way to de¬\nscribe his attitude toward an individual's religion than to say that to him it\nwas as private a matter as his intimacies with his own wife. His own theological\nopinions were expressed, not in public utterances, but in private correspondence\nand memoranda. Actually, they most nearly approximated those of the Unitarians,\nbut he never brandished them, nor did he attack the religious beliefs of others.\nHe honored them, as he expected other people to honor his; and he had intimate\nfriends among Anglicans in Virginia, Congregationalists in New England, and\nCatholics in France. He believed in free inquiry into religion as into all other\nsubjects, but it would have been utterly uncharacteristic of him to launch an\nattack on organized religion such as Thomas Paine did in The Age of Reason. What\nhe defended, as we shall see more specifically in a later program, was the right\nof Paine or anybody else to hold any opinions which he arrived st after honest\nthought and inquiry.\nAs to the government, he believed that it had no concern whatever with men's\nopinions on religion or any other subject. \"The legitimate powers of government\nextend only to such acts as are injurious to others,\" he said. Any thing beyond\nthat would be oppression, and the stifling of free thought was no cure for error.\n\"Reason and free inquiry are the only effectual agents against error,” in his\njudgment; and he pointed out that if the Roman government had not permitted free\ninquiry Christianity could never have been introduced. The bitterest fight of\nhis life was against political religion, and as he aroused advocates of the\n23"
}