{
  "id": "d860-121",
  "text": "Program 3\nProgram Title: \"SCIENTIFIC FREEDOM\"\nRecord Title: \"LIGHT AND LIBERTY\"\nThe references in the radio program to Jefferson's own scientific activities\nare based on historic fact and could have been greatly extended. He did not live\nin an age of specialization like our own, and breadth of interest was character¬\nistic of the learned men of that time, though no important American contemporary\nof his except Franklin came as near as he did to universality. Besides law and\nhistory, agriculture and architecture, he was interested in botany, ethnology,\npaleontology, climatology, and practically every known branch of scientific\nknowledge. Anyone wishing to pursue these facinating matters further will find\nsuggestions in the attached list of readings. Note should also be made of the\nfact that he was the first administrator of the American patent system and was\nhimself an inventor, though he never patented anything.\nThe controversy with Buffon, which is translated here into the form of dia¬\nlogue, found chief literary expression in the Notes on Virginia, which were not\nwritten for publication but were printed while Jefferson was in France. (He was\nthere 1784-1789 and Buffon died in this period.) The speech of Logan, which\nJefferson incorporated in his Notes from current newspaper versions of it, was\nthe occasion of bitter political attack on him in later years, when he was\ncharged with injustice to the \"murderer\" of Logan's family (left unnamed in this\nprogram).\nThe voices of criticism in the program are imaginary, but they say the sort\nof things that were said about Jefferson in his own time. At this stage of his\ncareer, however, he was on the best of terms with the chief college presidents.\nHis final words in this program, which comprise an admirable summary of his phi¬\nlosophy, are from a letter to the President of Harvard. The passage just before\nExperimental Discussion Program Subject to Revision\n27"
}