{
  "id": "d860-144",
  "text": "ALIEN AND SEDITION ACTS\n1798 •\nA. An Act Concerning Aliens, June 25, 1798\nSection 1. Be it enacted by the Senate and House of Representatives of the\nUnited States of America in Congress assembled. That it shall be lawful for the\nPresident of the United States at any time during the continuance of this act to\norder all such aliens as he shall judge dangerous to the peace and safety of the\nUnited States, or shall have reasonable grounds to suspect are concerned in any\ntreasonable or secret machinations against the government thereof, to depart out of\nthe territory of the United States, within such time as shall be expressed in such\norder,which order shall be served on such alien by delivering him a copy thereof,\nor leaving the same at his usual abode, and returned to the office of the Secretary\nof State, by the marshal or other person to whom the same shall be directed. And\nin case any alien, so ordered to depart, shall be found at large within the United\nStates after the time limited in such order for his departure, and not having ob¬\ntained a license from the President to reside therein, or having obtained such\nlicense shall not have conformed thereto,every such alien shall,on conviction there¬\nof, be imprisoned for a term not exceeding three years, and shall never after be ad-\n'mitted to become a citizen of the United States. ...\nSec. 2. And be it further enacted. That it shall be lawful for the President\nof the United States, whenever he may deem it necessary for the public safety, to\norder to be removed out of the territory thereof, any alien who may or shall be in\nprison in pursuance of this act; and to cause to be arrested and set out of the\nUnited States such of those aliens as shall have been ordered to depart therefrom\nand shall not have obtained a license as aforesaid, in all cases where, in the o-\npinion of the President, the public safety requires a speedy removal. And if any\nalien so removed or sent out of the United States by the President shall voluntarily\nreturn thereto, unless by permission of the President of the United States, such\nExperimental Discussion Program Subject to Revision\n51"
}