{
  "id": "d860-145",
  "text": "alien on conviction thereof, shall be imprisoned so long as, in the opinion of the\nPresident, the public safety may require. ...\nB. Sedition Act, July^l4, 1798\nSection 1. Be it enacted by the Senate and House of Representatives of the\nUnited States of America, in Congress assembled, That if any persons shall unlaw¬\nfully combine or conspire together,with intent to oppose any measure or measures of\nthe government of the United States, which are or shall be directed by proper au¬\nthority, or to impede the operation of any law of the United States, or to intimidate\nor prevent any person holding a place or office in or under the government of the\nUnited States, from undertaking, performing, or executing his trust or duty; and if\nany person or persons, with intent as aforesaid, shall counsel, advise, or attempt\nto procure any insurrection, riot, unlawful assembly, or combination, whether such\nconspiracy, threatening, counsel, advice, or attempt shall have the proposed effect\nor not, he or they shall be deemed guilty of a high misdemeanor, and on conviction,\nbefore any court of the United States having jurisdiction thereof,shall be punished\nby a fine not exceeding five thousand dollars,and by imprisonment during a term not\nless than six months nor exceeding five years; and further, at the discretion of\nthe court may be holden to find sureties for his good behavior in such sum, and for\nsuch time, as the said court may direct.\nSec. 2. And be it further enacted. That if any person shall write, print,\nutter, or publish, or shall cause or procure to be written, printed,uttered, or\npublished, or shall knowingly and willingly assist or aid in writing, printing,\nuttering, or publishing any false, scandalous, and malicious writing or writings\nagainst the government of the United States, or either house of the Congress of the\nUnited States,or the President of the United States, with intent to defame the said\ngovernment,or either house of the said Congress, or the said President, or to bring\nthem, or either of them, into contempt or disrepute; or to excite against them, or\neither or any of them, the hatred of the good people of the United States, or to\nstir up sedition within the United States, or to excite any unlawful combinations\ntherein, for opposing or resisting any law of the United States, or any act of the\n52"
}