{
  "id": "d860-150",
  "text": "the most formidable empire known to history; and if their economic language still\nhas a revolutionary sound, their government is extremely reactionary. Political\ntyranny is a very ancient institution. Furthermore, it may he believed that the\nexpansion of this tyrannical empire has come less from its doctrines than from\nthe chaos created by the Second World War. There is no possible analogy here with\nthe American Revolution, and the two movements should go by wholly different names.\nThe bearing of these facts and interpretations on the problems of the present\nworld is suggested in the questions which follow. It was not to be expected that\nthe revolutions of our own age would closely follow the historic American pattern,\nfor only in the British Dominions were conditions similar, and national self-gov¬\nernment has been achieved in them with full British consent. Nowhere else have\nthe people been trained in the management of their own affairs as colonial Ameri¬\ncans were. Also, we must recognize that among the peoples of the world today eco¬\nnomic opportunity and security often seem more important than political liberties\nand privileges. There are more concerned to meet their physical necessities than\nto enjoy the suffrage, and are not unwilling to barter liberty for the promise of\nsecurity.\nThis was not the sort of situation that Jefferson saw in his own country in\n1776. What attitude would he take toward revolution if he were here now? It is\nunlikely that he would discard the historic slogan: \"All governments derive their\njust powers from the consent of the governed.\" Probably he would be more aware\nthan he was in 1776 of the high cost of revolution, for he perceived that in\nconnection with the French. Since he always preferred remedial measures, he would\nprobably say that the best way to prevent costly revolutions is to remove their\ncauses. Undoubtedly he would be shocked by the Marxian emphasis on class warfare\nand would be as opposed to the \"dictatorship of the proletariat\" as to any other\nform of dictatorship. He would still emphasize the importance of reasonableness\nin human affairs, he would still put human interests first, and he would not be\nhimself if he did not set his face like flint against all forms of tyranny.\n58"
}