{
  "id": "d860-154",
  "text": "such an appeal could then he made would lead us too rar\nThe main points made in the text are historically correct: (l) orderly legal\nprocedure was followed in a time of intense excitement; (2) Adams risked his fu¬\nture in the name of justice; (3) essential justice was done. Adams' reputation\nsurvived the ordeal at the time, hut a quarter of a century later, when he was a\ncandidate for President, his political foes sought to discredit him by reviving\nthis story.\nArgument\nThis radio program differs from the others in that the part played by Jeffer¬\nson is chiefly that of narrator while John Adams is the main actor. The heritage\nwhich is described in Jefferson's words and illustrated by the main episode is in\nno' strict sense Jeffersonian, nor does it descend from John Adams alone. It is\nthe tradition of equal and exact justice to all men, regardless of status con¬\ndition, and it is the exclusive possession of no one people. Characteristically,\nhowever, it is western rather than Oriental, and it is distinctively (though not\nexclusively) Anglo-American. It is one of the finest traditions that has come\ndown to us, through the generations, from the earliest colonists in this country.\nIt is without honor in totalitarian countries, whether Communist or Fascist.\nThe program starts with a brief episode in the career of James Thomson Callen¬\nder, an unscrupulous journalist whom we have already met. By pardoning this un¬\nworthy man, who had been convicted under the unwise and probably unconstitutional\nSedition law, Jefferson rendered justice which was not required by the recipient.\nAs we saw in the program on \"Freedom of the Press\", Callender afterwards returned\nevil for good. Jefferson was gullible in this case and the whole affair was mixed\nwith polities, but the new President unquestionably went out of his way to be fair\nto an individual whom he believed to have suffered injustice.\nJohn Adams did the same sort of thing, though under very different circum¬\nstances, in his defense of the British soldiers who were tried for murder after\nthe \"Boston Massacre\" (1770). If this was not the highest and purest moment in\nAdams' life, as Jefferson said, it would be hard to match. In this time of danger-\n62"
}