{
  "id": "d860-163",
  "text": "Program 10\nProgram Title: \"NATURAL AND ARTIFICIAL ARISTOCRACY\"\nRecord Title: \"NATURE'S MOST PRECIOUS GIFT\"\nHistorical Background\nBecause of limitations of space it has been impossible to do justice in this\nprogram to the stoiy of the relationship between Jefferson and Adams, and of their\nreconciliation in 1812, when one of them was in his sixty-ninth year and the oth¬\ner in his seventy-seventh. This is one of the most wonderful stories in American\nhistory. It may be briefly summarized by saying that the two men stood shoulder\nto shoulder in the struggle for independence, that they became even more intimate\nfriends when they represented their country abroad just after the American Revo¬\nlution, that they were thrown into political opposition in the last decade of the\neighteenth century (Adams defeating Jefferson for the presidency in 1796 and be¬\ning defeated by him in 1800), and that their reconciliation in 1812, after both\nhad fully retired from public life, was brought about by their mutual friend and\nfellow signer of the Declaration of Independence, Dr. Benjamin Rush. Their cor¬\nrespondence during the next fourteen years ranged over the whole field of human\nthought and learning, and it shows them to have been supreme examples of the nat¬\nural aristocracy of talent and virtue they talked about. History contains no\nmore dramatic coincidence than their death on the same day, the fiftieth anni¬\nversary of the Declaration of Independence. Actually, Adams was wrong in saying\nthat Jefferson still survived, for of the two it was the younger who died first.\nThis program is historically accurate from beginning to end, though the quo¬\ntations do not always follow the precise chronological order. They have been\npieced together and modified here and there, but essentially the words are just\nas these men wrote them.\nArgument\nThis program, which is drawn almost entirely from the correspondence of\nExperimental Discussion Program Subject to Revision\n73"
}