{
  "id": "d860-164",
  "text": "Jefferson and John Adams In their old age, is perhaps the most difficult of them\nall to follow and unquestionably it is full of food for thought. These two men,\nwho had given the best part of their lives to the actual problems of government\nthough often they would have preferred doing something else, now discuss the\nmeaning of government. They do this informally in letters, not systematically as\none would in a treatise. Thus they jump back and forth and at times the progress\n•of their thought may not be wholly clear. The main topic is aristocracy, which\nhad been a bone of contention between them during their political rivalry. John\nAdams said that they ought to explain things to each other before they died. What\nthey do here is explain the term and make their respective attitudes known; and\nit appears in the end that there is little difference between them except in the\nmeans recommended to prevent the worst evils of both aristocracy and democracy.\nThis is more than an exercise in semantics, for they raise fundamental and time¬\nless questions. We ourselves talk much less about aristocracy and much more about\ndemocracy than they did, but the issues which they associated with these terms are\nstill here.\nThere was a time when Adams was charged with favoring Old-World aristocracy,\nthat is, a system of hereditary privilege. Actually he never did advocate this\nfor America, but he did point out the limitations and dangers of democracy. He\ndid not believe that universal suffrage and frequent elections constituted a pan¬\nacea for political ills. Indeed, he thought there was even more danger of corrup¬\ntion under a completely democratic system than under one that had some hereditary\nelements in it — a mixed system like that of the English, consisting of a House\nof Lords as well as a House of Commons. On the other hand, Jefferson was charged\nwith favoring the rule of the majority to such a degree as to advocate \"mobocracy\",\nor the rule of the rabble. Actually he was always a discriminating democrat who\nbelieved in the rule of intelligence rather than that of the emotional mob, and\nhe strongly emphasized minority rights. The views of both men were grossly dis¬\ntorted by political partisanship, but they themselves were far more than politi¬\ncians. They were profound thinkers on the subject of government, and both of them"
}