{
  "id": "d860-98",
  "text": "«The Independent Mr* Jefferson” first shows us Thomas Jeffer¬\nson arriving, sometime in May, 1776- at the house of Jacob Graff, a\nbricklayer who lives on the corner of Market and Seventh Streets in\nPhiladelphia. Mr. Jefferson has come to Philadelphia as a delegate to\nthe Second Continental Congress. He is looking for lodgings at the\nGraffsHe carries with him very little baggage—a violin, a writing\nbox, and copies of books by Milton, Locke, and Newton. The better\npart of his luggage is in his head, and consists of a number of re¬\nmarkable notions about the rights of man in a free society. Some of\nthese notions are quickly made apparent, since the Graffs, man and wife,\nquestion him rather closely before renting him rooms. They are cautious\nfolk and won»t rent rooms to just anybody, especially in these troublous\ntimes, what with Tories in the neighborhood, and so on. Mr. Graff won-\nders whether Jefferson believes in God. ”Surely this is a matter\nbetween God and me,” says Jefferson. ?sWhat is your denomination?” asks\nGraff. \"Very well, Mr. Graff,” says Jefferson. \"I have no formal\ncreed. I belong to no party, neither political, religious, philosophi¬\ncal. If I could not go to Heaven but with a party, I would not go at\nall.” ”Be careful, Mr. Jefferson,” chimes in Mrs. Graff. ”Tou risk\ndamnation!” ”No, Mrs. Graff,” says Jefferson. ”1 believe that God\napproves the open homage of reason rather than the blindfold homage of\nfear and superstition. I can only say to you that I believe in God\nand have faith in reason.” Mr. Jefferson is granted lodgings.\nHe settles down, as he says, \"with the baggage of my inheri¬\ntance,” and turns to the great task of drafting a Dcscl&ration of Inde¬\npendence for the Colonies,, All sorts of persuasive influences are\nbrought to bear , upon him to dissuade him from his work, the most per¬\nsistent of them being voiced by John Dickinson, also a member of the\nCongress. Dickinson feels that to sever the bonds with the mother\ncountry is a horrible mistake, tantamount to treason. Jefferson does\nnot believe what Dickinson believes, but passionately believes in his\nright to say it. They have many long and incisive discussions. ”The\nAmerican people will find their beginning in revolt and in diversity,”\nsays Jefferson. ”Let us praise diversity... .Would the world be more\nbeautiful if our faces were alike? If all our tempers, talents, tastes—\nour forms, our wishes, aversions, and pursuits—-were cast exactly in\nthe same mold, what shall we build? An America without variety?\nWhere all are to think alike?...Let us fire a cannon against the\njailors of all ages, the intellectual prison keepers, the civil magis¬\ntrates, and the religious zealots who enforce their dogmas upon those\nunwilling to receive them. Let us say to them? Whose foot is to foe\nthe measure to which ours are all to be cut or stretched?” Jefferson\nis forced to make compromises in his Declaration—for one thing, he is\nforced to remove a clause condemning the slave trade—but at last the\ndocument is completed, and is signed by every member of the Congress\nexcept Mr. Dickinson.\nThere was, admittedly, barely any action in ”The Independent\nMr. Jefferson,” most of the play taking place in one room of the Graffs*\nhouse, but I found the dialogue sufficiently compelling to make up for\nthe lack of movement. The script was written by Monion Wishengrad and"
}