{
  "id": "d1324-1",
  "text": "WBGO-FM, Newark Board of Education, for “What is a\nNeighborhood?” local in-school radio program for children\nand youth. Special commendations went to: University of\nMichigan Television Center, for “Twelfth Night,” local out-\nof-school TV program for adults; Indiana University Radio\nand Television Service, for “Pox on Their House, local out-\nof-school TV program for adults; Columbus Public Schools\nand WOSU-TV, for “Reading for Pre-Teens,” local m-\nschool TV program for youth; Board of Education of the\nCity of New York and WNDT-TV, for “The Wonder of\nWords,” local in-school TV program for youth; Educational\nRadio Network, for “Challenge to Higher Education,” net¬\nwork out-of-school radio program for adults.\nCoordinators of the judging centers evaluating the entries\nwere: John Buckstaff, University of Chicago; Stanley Don-\nner, Stanford University; Cliff Eblen, University of Wiscon¬\nsin; Richard Estell, Michigan State University; Lee Frisch-\nknecht, Michigan State University; Raymond Giese, Ohio State\nUniversity; Walter Kingson, University of California at Los\nAngeles; James E. Lynch, Ohio State University; and James\nMiles, Purdue University.\nFulbright Deadline Nears\nCompetition for the Fulbright awards described in the June\nNewsletter closes August 1. For information and application\nforms, write to: Committee on International Exchange of\nPersons, Conference Board of Associated Research Councils,\n2101 Constitution Avenue, N.W., Washington 25, D.C.\nTyler Contributes Journals\nTracy Tyler, former editor of the NAEB Journal, recently\ncontributed 38 copies of old Journal issues to help complete\nthe file at the NAEB Publications Office. Still needed are\nthe following: Vol. 1 No. 1, Sept. 1941; Vol. 1 No. 2, Oct.\n1941; Vol. 2 No. 4, Dec. 1942; Vol. 18 No. 9, Oct. 1959; and\nVol. '18 No. 10, Nov. 1959. If anyone has copies of these he\nis willing to give up, please send to the NAEB, 119 Gregory\nHall, Urbana, Illinois.\nHere and There\n• The SMPTE headquarters moved on July 1 to 9 East 41st\nSt., New York 17—a newly remodeled building less than\nthree blocks from the old address.\n• TelePrompTer Corporation has announced that it plans\nto sell its non-TV businesses. In making the announcement,\nIrving B. Kahn, chairman and president, said, “The current\nprofitability and growth rate of our Community Antenna Tele¬\nvision Systems and other closely related businesses, and the\ntremendous potential of pay television require the undiverted\nfocus of our management.”\nMore Summer Workshops\nSan Bernardino Valley College and University of Redlands.\nETV workshop, July 8-19. Designed to acquaint admin¬\nistrators, teachers, and others in using TV as an instruc¬\ntional medium. Concrete experience provided through the\nstudios of KVCR-TV. Write: Dr. Robert West, Director\nof Summer Sessions, University of Redlands, Redlands,\nCalifornia.\nUniversity of Georgia. Broadcasters editorial workshop, July\n25-27. Sessions include influencing public opinion; re¬\nsearch, investigation, synthetic information; management-\ngovernment relations, legal and constitutional questions;\npolitical editorializing, endorsements, handling public re¬\naction. Write Loran Smith, Center for Continuing Edu¬\ncation, University of Georgia, Athens.\nAnniversaries\nApril 28—WO I (AM), Iowa State University of Science and\nTechnology, 41st.\nMay 2—KUOM (AM), University of Minnesota, 25th.\nJune 11—KQED-TV, San Francisco, 9th.\nNew NAEBers\nACTIVE\nStation KLON, Long Beach Unified School District, Long\nBeach, California; Station WPKN, University of Bridgeport,\nBridgeport, Connecticut.\nGeneral Beadle State Teachers College, Madison, South Da¬\nkota; Henry Ford Museum and Greenfield Village, Dear¬\nborn, Michigan; West Virginia University, Morgantown,\nWest Virginia.\nINDIVIDUALS\nWilliam A. Allen, San Angelo, Texas; Bdl P. Arhos, Aus¬\ntin ; Gerald C. Beckwith, Waco, Texas; David C. Bell, Evans¬\nton; Michel Beilis, New York; Gary C. Bergland, Auburn,\nAlabama; David A. Blakeman, Frankfort, Kentucky; Thom¬\nas J. Brophy, New York; Robert W. Caughey, Fort Myers,\nFlorida; T/Sgt. Paul S. Clay, Denver; Brother I. Conrad,\nF.S.C., Hammond, Indiana; William H. Donaldson, Burling¬\nton, Vermont; SM/Sgt. Robert L. Doty, Rantoul, Illinois,\nJames Edgy, Middletown, Connecticut; Harry R. Flynn, Jr.,\nAuburn, Alabama; John A. Fiske, Jr., Coral Gables; Emil\nGaverluk, Royal Oak, Michigan; Lt. Glenn A. Giere, Red¬\nstone Arsenal, Alabama; Shevard Goldstein, Oak Park, Mich¬\nigan; Peter H. Graham, Caldwell, New Jersey; Betty Lou\nHembrough, Urbana; Vida D. Hoffacker, Fort Lauderdale;\nFrederick L. Hovde, Lafayette; Jack E. Jennerjahn, Madi-.\nson; John Henry Joseph, Spring Grove, Pennsylvania; Capt.\nLewis W. Kendrick, University, Alabama; Nasim U. Khan,\nBloomington; Gerald A. Lang, Detroit; Halsey I. Lawson,\nJr., Flint; William J. Lesko, St. Louis; Harris N. Liechti,\nWashington; F. Dennis Lynch, Iowa City; Mrs. Ruth Ly-\nnott Plakias, Madison; Curtis John McCarty, Orono, Maine;\nJames F. Macandrew, New York; Norman S. Morris, Phila¬\ndelphia; Nancy Lee Muckley, Albany; Frederick Stanley\nMumma, Lancaster; Merle Nadlin, Chicago; Mark Ollington,\nChapel Hill; James John Onder, Champaign; David L. Payne,\nCharlestown, Indiana; Michael H. Pengra, Austin; Emma\nSue Phelps, Marshalltown, Iowa; M/Sgt. Leon M. Rasberry,\nMontgomery; Mrs. Jo Ann Reeves, Sarasota, Florida; Jack\nW. Righeimer, Chicago; DeWolf Schatzel, West Lafayette;\nMrs. Claudine Shannon, Milwaukee; Gerard Sheehan, West\nNewton, Massachusetts; Dr. Dezo V. Silagyi, Huntington\nWoods, Michigan; Claude B. Smith, Evansville, Indiana; Le-\nland Smith, Detroit; T/Sgt. Johnie F. Steward, Goodfellow\nAFB, Texas; Elizabeth M. Taylor, Madison; John M. Til¬\nton, Kansas City, Missouri; John H. Tschirhart, Washing¬\nton; Loran C. Twyford, Jr., Albany; Robert J. Van Abel,\nGreen Bay, Wisconsin; Jerry D. Weaver, New Albany, In¬\ndiana; George Wheeler, Atlanta; Andrew F. Willis, Mem¬\nphis; Dr. Harry M. Wright, The Bronx; Mr. Lynn A.\nYeazel, Peshtigo, Wisconsin; Michael J. Ziegler, University\nPark, Pennsylvania; Dr. James J. Zigerell, Chicago; T/Sgt.\nLeroy J. Zoll, Eglin AFB, Florida.\nNews Notes\nPERSONNEL ,\nk Mrs. Kathleen Lardie, director of radio-TV education and\nmanager of WDTR for the Detroit Public Schools, received\nthe Communications Award at the recent 13th annual awards\nbanquet of the Wayne State University mass communications\ndivision. The award was presented for “creative leadership in\neducational broadcasting.”\n^ Tracy Tyler, professor of education and assistant to the\nvice president for academic administration, University of Min¬\nnesota, retired from the university on June 30. In a tribute\nto him delivered at the annual Education Day Dinner in May,\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 119 Gregory Hall,\nUrbana, III. $5.00 a year, $7.50 including Washington Report.\nEditor: Betty McKenzie. Phone 333-0580. Area Code 217. Report¬\ners: Region I—Michael Ambrosino, Ruane Hill; Region II—Shirley\nFord, Lou Peneguy; Region III—McCabe Day; Region IV—Richard\nVogl.\n2\nNEWSLETTER"
}