{
  "id": "d1324-2",
  "text": "Associate Dean Marcia Edwards pointed out that even before\nhe received his Ph.D. from Columbia in 1933, he had “moved\nstrongly into a new field of education—education by radio.”\nHe studied school broadcasting in many European countries\nduring those years, and served on the President’s Advisory\nCommittee on Education, in Washington. In the summer of\n1938 he went to the summer session at the University of\nMinnesota as a visiting lecturer in radio in education, and\nthus began his 25-year association with the university.\n^ Duff Browne, associate director of radio and TV at the\nUniversity of Texas, has assumed new duties as director of a\nproject to aid southern states in developing and using recorded\nmaterial for ETV. The USOE has awarded a contract to the\nSREB for the project.\n^ Rob Downey, public affairs editor of Michigan State Uni¬\nversity’s WKAR and WMSB (TV), has been elected presi¬\ndent of the Central Michigan Chapter of Sigma Delta Chi.\nHe is the first member of the broadcast journalism media to\nserve in this office.\ny Robert D. Squier, TV program director for the University\nof Texas, left June 24 for Saudi Arabia to spend eight weeks\nas a TV consultant to the Arabian American Oil Company\npublic relations department at Dhahran. This is his third such\nassignment in the past five years.\nINSTRUCTION\n^ On June 9, St. Louis University conducted its first “com¬\nmencement” rites for its program of televised course-work\ncalled “Community Campus.” Programs are presented Satur¬\nday mornings over KTVI (commercial) and repeated over\nKETC (educational) on weekdays. The graduating class of\n90 ranged in age from 17 to 78, and in formal education from\nsixth grade through college. Each graduate had watched a\nminimum of 270 class programs, completing six courses in\neach of three divisions—basic skills, basic appreciation, and\nbasic knowledge.\n^ Some 200 students who have taken part or all of their work\non television were among the 1300 graduates of Chicago’s\njunior colleges last month. Most of the 200 students took, on\nan average, almost a full semester’s college work on TV; 9\nfinished the entire junior college program via television; 20%\nof the 200 were on the dean’s honor list.\n^ First aid instruction via television enabled Mrs. Robert\nPickle of Bethany, Oklahoma, to aid in saving the life of a\nneighbor baby recently. Mrs. Pickle was one of the 1253\n“graduates” of a Red Cross first aid course offered over\nKETA, Oklahoma City. When pneumonia stopped the breath¬\ning of her four-month-old neighbor, Mrs. Pickle applied the\nfirst aid methods she had learned until the baby arrived at a\nhospital. Medical authorities reported that she was “instru¬\nmental in saving .the life of the baby.”\ny St. Louis University is currently offering a course on Com¬\nmunism via radio. Lectures are broadcast on Monday after¬\nnoons via KMOX, commercial radio station, and text assign¬\nments supplement the lectures.\n^ This spring the University of Missouri has completed a\nthree-year TV course recording project, partially supported\nby a $90,000 Ford Foundation grant for released time for\nprofessors. At the end of the project, the university has\neleven regular courses on videotape.\n^ The May program bulletin for WNED-TV, Buffalo, sum¬\nmarizes a fall, 1962, survey of the 321 schools participating\nin WNED’s in-school programs: “60,000 students in 2,000\nclassrooms viewed a quarter million hours of televised in¬\nstruction ; 79% of the schools are using ETV programs;\nwhere comparative figures are available, student participation\nhas doubled this year over last; a majority of principals and\nteachers felt there was a definite improvement in instruc¬\ntional values and production quality; the average cost per\nstudent for a full semester was $.71.”\n^ Radio is being used to teach Spanish by the elementary\nNAEB Headquarters: Suite 1119, 1346 Connecticut Avenue,\nN. W., Washington 36, D. C. Phone 667-6000 Area Code 202.\nSpanish department of the Dade County (Fla.) Schools and\nWTHS (FM). When the recording is completed in late\n1964, 720 programs will be ready in the conversational Span¬\nish series for Grades 1 through 6. Miss Clementine Carlaftes,\ncoordinator of elementary conversational Spanish for the\ncounty schools, originated the idea for the radio lessons.\nWTHS programed Grades 1 and 3 during the past school\nyear; next year Grades 2 and 4 will be included.\n^ North Carolina State College this spring introduced the\nuni-lesson, in which the object is to make the student an ac¬\ntive participant in a single-telecast lesson on a specific topic.\nVisual and audio functions of the medium focus on the ma¬\nterials to be learned; the instructor appears only when it is\nnecessary to communicate directly to the student. The first\nuni-lesson dealt with the Scholastic Aptitude Test of the Col¬\nlege Entrance Examination Board, the second with the cul¬\ntivation of roses.\nSTATE & REGIONAL ACTIVITIES\n^ September, 1964, is the goal for the operation of Kentucky’s\nnew ETV network, O. Leonard Press, vice chairman of the\nKentucky ETV Authority, announced recently. He said the\nnetwork should be completed by next spring to allow technical\ntesting for several months.\n^ Colorado’s ETV committee sponsored an ETV workshop\nat the University of Colorado earlier this year, at which\ngroups from various campuses in the state met to learn more\nabout ETV. The workshop culminated in a special 40-minute\ndocumentary program on ETV which was fed directly from\nthe university’s studios into the Colorado General Assembly\nover the microwave link from Boulder to Denver. Future\nplans call for activation of Channel 8 in Pueblo and Channel\n12 in Boulder.\nPROGRAM'S\n^ WFBE-FM, Flint (Mich.) school station, is using its fa¬\ncilities to acquaint the public with education problems in the\ncommunity. Dr. Lawrence L. Jarvie, general superintendent\nof community education, has been recording a “Superintend¬\nent’s Report” after each twice-monthly meeting of the board\nof education. Each report is broadcast three times. Dr. Jarvis\nhas also held radio press conferences with student editors.\nDearborn (Mich.) Public Schools Superintendent, Stuart\n. Openlander, has also been featured in a radio series this\nspring. On “A Place to Learn,” he has discussed vital issues\ninvolving Dearborn’s educational structure. Mrs. Marion\nCorwell, associate director of school relations, produced and\ndirected the programs.\n^ “Pox on Their House,” IERT award-winning program pro¬\nduced by the Indiana University Radio and TV Center, is a\ndocumentary investigation of the increase in venereal disease\nin Indiana. The program was presented with clinical frank¬\nness, and the Indiana University School of Medicine and the\nState Board of Health served as consultants. Jack Sheehan\nwrote the documentary.\n^ Texas Writers of Today is the title of a series presented\nearlier this year by KLRN, Southwest Texas ETV station.\nIncluded among the writers are E. P. Conkle, J. Frank\nDobie, Fred Gipson, and Mary Lasswell.\n^ WMTH-FM, Maine Township (Ill.) High School station,\nthis spring ran the second season of Playhouse 207, a series\nof student-acted and student-directed radio plays.\n^ WMSB (TV), Michigan State University, has licked the\nproblem of foreign films which run 27 or 28 minutes. Each\nweek the station videotapes an average of three or four one-\nminute Home Notes with Rosie O’Grady, of the Michigan\nCooperative Extension Service.\n^ WNYC-FM-TV, New York City, plans an increasing num¬\nber of programs in the coming months on the changes taking\nplace at Flushing Meadows, site of the World’s Fair of 1964-\n65.\n^ KQED, San Francisco, this spring televised the Asilomar\nConference of the World Affairs Council of Northern Cali¬\nfornia for the first time in its 17-year history. Speakers in¬\ncluded Asian experts from various places.\nJULY, 1963\n3"
}