{
  "id": "d1324-4",
  "text": "NEWS LETTER.,.,,..,.... par.'r 4, . , . . ..^Novemb'IR I, 1945\nF G, Ketner, President of the Ohio Council, said in a statement that\nthe stations would ’’serve Ohio farm people with production, marketing\nAND other pertinent INFORMAT 1 ONp”\nThe council has not decided where the stations would be locateDo .Ket¬\nner SAID if FCC approves the applications, that the stations would be\nSPOTTED to cover THE ENTIRE STATE WITH REGULAR BROADCAST SERVICES,\nTHIS AND THAT\nThe FCC IS GOING TO work in dead earnest to handle the flood of appli¬\ncations which have been submitted for new and improved facilities.\nOver 125 conditional grants for new FM stations have already been made\npp, .There*LL be plenty of hearing headaches when all of the AM ap¬\nplications GO to hearing. The interference issues alone are enough\nto make a self-respecting FCC ENGINEER MILLIVOLT HAPnVp,*»NOVIK SENT\nA copy OF TH^. AGREEMENT FOR POL 1V | CAL BROADCASTS DURING THE NEW YORK\nCity Campaigns^ All parties participate and agree to use the facilities\nOF the station to INFORM THE VOTERS OF THEIR RESPECTIVE STANDS ON THE\nISSUES OF THE DAYpp ,pStRATOVISI ON IS GOING FORWARD. THE FCC HAS GRANTED\nWESTINGHOUSE LICENSES FOR FIVE DEVELOPMENTAL STAT!ONS.. ,pTfeCIE VEO PRO¬\nGRAM BULLETINS FROM KUOM AND WSUIo BOTH ARE NICELY ILLUSTRATED WITH\nPICTURES AND INDICATE THE GOOD JOB BEING DONE BY THESE STATIONS•»»..\nJim Miles of WBAA visited our fair campus a few weeks back. We*ll\nRETURN THE VISIT NEXT WEEK WHEN WE JOURNEY TO WEST LAFAYETTE FOR HIS\nRADIO CONFERENCE. .The ’’HaMS\" ARE GOING TO HAVE SOME NEW CALL SYMBOLS\nop..,.My ALUMNI NEWS BULLETIN FROM THE UNIVERSITY OF IOWA SAYS THAT\nTHE $525,000 ^AOIO AND COMMUNICATIONS CENTER IS NUMBER TWO ON THE\nUNIVERSITIES BUILDING PROGRAM ,,,0oHIQGY, HOW IS YOUR BUILDING PROGRAM\nCOMING? I WANT TO TELL THE NAEBeRS ABOUT V/OSU * S NEW HOME.,., .THE FMBI\nIS BECOMING A PART OF NAB AND THE FM NEWSLETTER IS BE IN^ 01SCONTINUEDo\nI THINK THAT THE EDITORS OF THE NEWSLETTER SHOULD BE CONGRATULATED ON\nTHE FINE JOB THEY HAVE DONE FOR FM BROADCAST INGpp,.W|LL COVERED THE\nDEDICATION OF THE WORLD’S LARGEST COLLEGE AIRPORT AT THE U OF ILLINOIS\nA FEW WEEKS BACK. NELSON NORMAN AND YOUFS TRULY HAD A FIELD DAY BROAD¬\nCASTING THE GIANT AIRSHOW—JET PLANES, B-29'S, SUPER CARGOS, ETC—\nAND INTERVIEWING THE STATE DIGNITARIES PRESENT FROM THE GOVERNOR DOWN\np p pThe Clear Channel hearing has been postponed but that’s no reason\nFOR NEGLECTING TO ANSVTCR THE REQUEST FOR INFORMATION FOR OUR HEARING\nPREPARATIONSp♦,oOUR CONGRATULATIONS TO JuSTiN MILLER, NEW NAB PRES-\nIOENTp He HAS A TOUGH JOB ON HIS HANDS FOR WHICH HE IS WELL QUALIFIED .\nHeard the WHA \"Dear Sirs\" program while in Madison a few weeks bacKc\nOne of the best programs I have hivard of late snspste of* the fact that\nMcCarty played fiddle and Hartley sang cowboy sqngs-oh brotherp\nNOVIK’s FIVE POINTS FOR BETTER U.. So BROADCASTING\nIn the October 29th issue of Broadcasting Novik gave his impressions\nof FuropEp It is a story well worth your reading. Space does not per¬\nmit a complete quotation from the story but below are five points of\nrecommendation he made based on the trip:\nI. The networks should keep in Europe as virile a staff of news¬\nmen AS they had during the war. They should be there to tell the United\nStates what sort of job our forces are doing, and how the people of"
}