{
  "id": "d1863-0",
  "text": "KUSD Programs\n1936-37\nEvening Series The evening series of radio programs will be given each\nMonday, Wednesday, and Friday, from 9 p.m. to 10 p.m. Each of these programs\nwill consist of a talk 20 minutes in length, and a musical program of 40\nMINUTES.\nAfternoon Series The afternoon series will be given from 4 to 5 o'clock each\nMonday, Tuesday, Wednesday, Thursday, and Friday afternoon. The afternoon\nPROGRAMS WILL CONSIST OF TALKS, MUSIC, AND READINGS.\nEvening\nLe/Y URES\n1. \"Your Health,\" by members of the faculty of the School of Medicine: Dean\nJ. C. Ohlmacher, Professor H. V. Atkinson, Professor C. A. Hunter, Professor\nC. M. MacFall, Professor E. H. Shaw, jr.\n2. \"Current Governmental Problems,\" W. Q. Farber, assistant professor of\nGovernment.\n3. \"General Trends in English Literature\" Genevieve J. Blair, associate pro¬\nfessor of English.\n4. \"The Culture and Contribution of the Old Greek Race,\" A. L. Keith, professor\nof Latin and Greek.\n5. \"History and Development of Banking and Financial Institutions in the\nUnited States,\" J. P. Jones, assistant professor of economics.\n6. \"Contemporary World Problems,\" by members of the faculty of the department\nof history: Professor H. S. Schell, Professor Carl Christol, Assistant\nProfessor C. G. Beckwith, Instructor Robert G. Dunbar.\n7. \"Modern Zoology,\" E. P. Churchill, professor of zoology.\n8. \"The Theory and Practice of Art,\" Howard W. Joyner, assistant professor of\nART.\n9. \"Money and Banking,\" E. S. Sparks, dean of the school of business admin-\nI STRATI ON,\n10. \"American Industry,\" H. E. Brookman, associate professor of applied science.\n11. \"The Guidance of Childhood and Youth,\" C. C. Josey, professor of philosophy.\n12. \"Rural School Activities,\" Charlotte Noteboqm, assistant professor of\neducation.\nDates for Evening Series\nSept. 14,\nMed i cine,\n1\nOct.\n14, Farber 5\nSept. 16,\nFarber, 1\nOct.\n16, BLAfR, 5\nSept. 18,\nBlair, 1\nOct.\n19, Medicine,\n6\nSept. 21,\nMedicine,\n2\nOct.\n21, Farber, 6\nSept. 23,\nFarber, 2\nOct.\n23, Blair, 6\nSept. 25,\nBlair, 2\nOct.\n26, Medicine,\n7\nSept. 28,\nMedicine,\n3\nOct.\n28, Farber, 7\nSept. 30,\nFarber, 3\nOct.\n30, Blair, 7\nOct. 2 ,\nBlair, 3\nNov.\n2, Medicine,\n8\nOct. 5 .\nMedicine,\n4\nNov.\n4, Farber, 8\nOct. 7 ,\nFarber, 4\nNov.\n6, Blair, 8\nOct. 9 ,\nBlair, 4\nNov.\n9, Medicine,\n9\nOct. 12,\nMedicine,\n5\nNov.\n11, Station S\nILENT\nArmistice\nDay."
}