{
  "id": "d1863-2",
  "text": "KUSD RADIO PROGRAMS\n1935-1936\nEVENING SERIES The evening series of radio programs are given each\nMonday, Wednesday and Friday, from 9 p.m. to 10 p.m. Each of these programs\nWILL CONSIST OF A TALK 20 MINUTES IN LENGTH, AND / MUSICAL PROGRAM OF 40\nMINUTES.\nAFTERNOON SERIES The afternoon series will be given from 4 to 5 o'clock\nEACH AFTERNOON ON MONDAY, TUESDAY, WEDNESDAY, THURSDAY, AND FRIDAY. THE\nAFTERNOON PROGRAMS WILL CONSIST OF TALKS, MUSIC, AND READINGS.\nEvening Lectures to be Given\n1. What to See in South Dakota, by E. P. Rothrock, professor of geology,\nAND STATE GEOLOGIST OF SOUTH DAKOTA.\n2. Chemistry in Every Day Life, by the department of chemistry:\nProfessor A. M. Pardee, Professor A. L. Haines, Associate Professor\nE. H. Shaw, jr., and Assistant Professor Ernest Griswold.\n3. Famous British Authors, by D. C. Dickey, instructor in speech.\n4. Advertising for You and Me, by H. R. Fossler, associate professor of\nPsychology.\n5. Astronomy for Everybody, by William E. Ekman, instructor in mathematics\n6. Some Applications of Science, by M. W. Davidson, professor of Applied\nScience.\n7. History and Development of Plant Life, by Orlin Biddulph, assistant\nprofessor of Botany.\n8. The Law and the Citizen, by members of the school of law faculty:\nDean Marshall McKusick, Professor L. W. Feezer, Professor J. E. Payne,\nProfessor Claude W. Schutter, and Associate Professor Russell R. Reno.\n9. History and Museum, by W. H. Over, curator of the museum.\n10. Christ’s Sermons on the Mount, by C. S. Thoms, professor of bible\n11. Home Decoration, by Edith Abell, assistant professor of fine arts.\n12. Problems in Home Making, by Delia Garrett, instructor in Home Economics.\nDates for Eveni\ning Series Lectures\nSept.\n16,\n, Rothrock, 1\nOct.\n21, Rothrock,\n6\nSept.\n18 Chemistry, 1\nOct.\n23, Chemistry\n, 6\nSept.\n20,\n, Dickey, 1\nOct.\n25, Dickey, 6\nSept.\n23,\n, Rothrock, 2\nOct.\n28, Rothrock,\n7\nSept.\n25,\n, Chemistry, 2\nOct.\n30, Chemi TRY,\n, 7\nSept.\n27,\n, Dickey, 2\nNov.\n1, D1CKEY, 7\nSept.\n30,\n, Rothrock, 3\nNov.\n4, Rothrock, 8\nOct.\n2, Chemistry, 3\nNov.\n6, Chemistry,\n8\nOct.\n4, Dickey, 3\nNov.\n8, Dickey, 8\nOct.\n7, Rothrock, 4\nNov.\n11, Station 5\n1 LENT\nOct.\n9, Chemistry, 4\nOct.\n11,\nDickey, 4\nNov.\n13, Chemistry,\n, 9\nOct.\n14,\nRothrock, 5\nNpv.\n15, Dickey, 9\nOct.\n16,\nChemistry, 5\nNov.\n18, Rothrock,\n9\nOct.\n18,\nDickey, 5\nNov.\n20, Ekman, 1"
}