{
  "id": "d832-12",
  "text": "10,\ncommon problems. A regional meeting, in other words, is a family affair in which\nNAEB’ers get together as a family group to \"take their hair down” and tell the offi¬\ncers and staff what’s wrong. This was one of the important considerations involved\nin planning this conference and deciding whether or not to bring in outside organi¬\nzations. Not all things cast at such sessions are necessarily bouquets and it is\nbetter and less restricting if outsiders are not present for such discussions of our\norganization. For that reason we feel it is essential that principally only NAEB\nmembers, and not outsiders, attend these meetings. These are the only meetings where\nwe are this ’’exclusive.” But this is our only chance for the house-keeping and\nhouse-cleaning sessions every organization must have if it is to keep up to date and\nvital.\n’’All along, the contributions of members in your region to the NAEB, have been\ngreat. Parker Wheatley’s permissive interviews helped launch the NAEB Network.\nMr. Ralph Lowell as Administrator for the NAEB was entrusted with the funds for our\nfirst grant. We maintained, in those days, that given only a fraction of the funds\nof a commercial station we could prove that educational radio had possibilities—\nthat it was vital and necessary to adult education. We produced the JEFFERSONIAN\nHERITAGE, WAYS OF MANKIND, PEOPLE UNDER COMMUNISM, and so forth. Commercial sta¬\ntions as well as educational stations carried these programs and we proved what we\nset out to do.\"\nHere followed informal discussion, with questions and answers intended to clari¬\nfy conference goals and objectives.\nSecond General Session\nThe second general session, held Friday afternoon, was chaired by Professor W.\nWorcester Smith, WMUA, University of Massachusetts. The chairman and Professor Ray\nWyman discussed the activities of WMUA, It was indicated that the University does\nnot provide a radio staff, but does own the transmitter and a new studio will be in¬\ncorporated into one of the new buildings on campus. Three faculty members advise"
}