{
  "id": "d832-13",
  "text": "11.\nthe three student station managers, and there is a large student staff which operates\nthe system. Due to the fact that so many of the students owned only AM radios, Pro¬\nfessor Smith and some of the students designed converters which were installed in\nthe dormitories to eliminate this problem. The station operates from 5 p.m. until\napproximately midnight every day.\nThe Chairman then introduced Dr. Skornia who discussed the NAEB and its activi¬\nties.\nThe NAEB Headquarters, Network and Committees, Dr. Harry J. Skornia. \"Although\nthe Headquarters operation in Urbana is just entering its 5th year, the NAEB has\nexisted as an association since 1925. As a loose-knit organization of educational\nbroadcasters, without the necessary funds to establish a national headquarters, the\nNAEB was able to provide few of the services which became possible with the estab¬\nlishment of the national Headquarters and Network in 1951, thanks to a grant of a\nquarter of a million dollars from the W. K. Kellogg Foundation. The beginning of\nthe change in status of the NAEB probably began in 19U9 with a meeting of education¬\nal broadcasters at Allerton Park at the University of Illinois. This meeting, now\nknown as the First Allerton Conference, was made possible by a grant from the Rocke¬\nfeller Foundation. At this meeting these educational broadcasters discussed the\nrole of educational broadcasting and what might be done to give it greater impetus.\nOut of this and subsequent similar meetings came a plan to produce several series\nof truly outstanding educational radio programs which would prove that, given the\nnecessary funds, educational broadcasters could produce programs on a par with the\nbest that commercial stations could offer. Subsequently the grant I mentioned this\nmorning, from the Fund for Adult Education made possible the production of the WAYS\nOF MANKIND, the JEFFERSONIAN HERITAGE, PEOPLE UNDER COMMUNISM, and others. Prob¬\nably the planning of these programs, more than anything else made apparent the need\nfor a national headquarters for the Association, and led to the Kellogg grant."
}