{
  "id": "d832-14",
  "text": "12.\nYou are probably familiar with the services provided by the NAEB Headquarters\nbut I should like to enumerate some of them for you at this time. Here followed\na discussion of the following NAEB services:\nEducational Television and Radio Placement Service\nEducational Television Engineering Service\nEducational Television Management Consultant Service\nEducational Television Consultant Teams\nTelevision Fact Sheets\n(Three) NAEB Educational Television Production Workshops\n(Two) NAEB Educational Television Engineering Workshops\n80 TV Scholarships\nRadio (and earlier TV) Grants-in-Aid\nThe NAEB Radio Network (now serving 76 stations and distributing 18,200 hours\nof programming each year, with nine series of In-School radio programs dis¬\ntributed by the Network this year)\nRegional Meetings\nSeminars and Conferences\n\"The NAEB is the channel through which at least several Foundations make avail¬\nable the funds they approve for grants, fellowships, workshops and other types of\nsupport for educational radio and television. Consultation teams, made up of ex¬\nperienced educational broadcasters are sent out to help new television stations get\nstarted properly. Although our offerings are already rich, we want to know what\nfurther ideas for services you may have. All services offered have been a result\nof an expressed need and we constantly check with other organizations to eliminate\nduplication. We work particularly closely with, and coordinate efforts with, the\nEducational Television and Radio Center. As you can see, from the items I have\nmentioned, the services offered by the NAEB cover both local and national problems.\n\"Another area, possibly not so well known, in which we are active is the field\nof international communications. In the international sense the NAEB is the rep¬\nresentative of educational television and radio in the United States. A committee\ncomposed of NAEB officers and members makes recommendations for Fulbright scholars\nto study broadcasting in foreign countries. Through our Network we distribute\nquite a few programs from other countries, and some of our programs have been car¬\nried in Europe. We exchange ideas, publications and studies with most of the"
}