{
  "id": "d832-15",
  "text": "13\nnations of Western Europe, and some in south and central America, Mexico and the\nFar East.\n\"...There is a Headquarters and Network staff of 13, most of whom gave up good\njobs with promotion and tenure because they thought this was important. Finances\nare limited and we think it is better to be overworked than over-extended because\nthe latter might lead to collapse if finances fall off. I don't know how secure\nthe staff is, for we are paid largely from grants which expire next year. But we\ntook our jobs and had enough hope and courage and interest in the organization to\nthink that such important work should not be allowed to collapse after the 30 years\nwhich the NAEB has invested in education via broadcasting.\n\"But I should emphasize that the large proportion of labor in the NAEB is the\nwork of persons who give their time free of charge. Probably the source of the\ngreatest strength of the organization is the work done by committees. I might\nmention some of those who have been most active recently. The Engineering\nCommittee has worked with Mr. Bidlack, our Television Engineer, in planning the two\nNAEB ETV Engineering Workshops, the second of which will be held this fall at\nWKAR-TV. This Committee has also prepared several engineering reports which have\nbeen published and distributed to the membership.\n\"The Television Operations Committee a year or so ago conducted a series of\nsurveys of educational television stations and the resultant reports provided the\nonly information then existing about educational television financing, programming,\nfacilities, and so forth. This Committee is now in the process of bringing these\nsurveys up-to-date.\n\"The Research Committee has prepared a map showing the coverage of educational\nradio stations. They have conducted audience studies, cooperated in the conduct\nof the TV Monitoring Studies with which you are all familiar, and most recently\nhave compiled a \"Who’s Who\" in educational broadcasting, which will be off the\npress shortly."
}