{
  "id": "d832-45",
  "text": "NATIONAL ASSOCIATION\nof\nEDUCATIONAL BROADCASTERS\n14 Gregory Hall Urbana, Illinois\nAugust 31, 1956\nTO: ALL ACTIVE AND ASSOCIATE MEMBERS IN REGIONS II, IV & VI\nFROM: Harry J. Skornia\nRE: NOMINATIONS FOR REGIONAL DIRECTORS\nYou will recall that, at the Convention in Chicago last fall, the\nNAEB By-Laws were amended to provide for a new procedure for the elec¬\ntion of Regional Directors.\nThis new procedure calls for Directors to be nominated and elected by\nthe members within their respective regions. YOU ARE HEREWITH INVITED\nTO SUBMIT NOMINATIONS FOR REGIONAL DIRECTOR FOR YOUR REGION. Naturally,\nany nominee must be from a member institution within your region. (The\nstates composing each region are listed in the front of the NAEB\nDirectory.)\nElection of Board Members will occur as soon as possible after the\nelection of officers, at the Annual Convention, to preclude the possi¬\nbility of election of the same persons as officers and Board members.\nThe NAEB Board is in effect, with the officers, the organization’s\npolicy control committee, persons of mature judgment are therefore\nessential. Since the NAEB is not able to pay travel expenses for all\nBoard meetings, persons selected should be able to travel when necessary,\nwhich involves a contribution by his institution or himself in both\ntime and expense on behalf of the Association. Since the membership is\nitself, in effect, the legislative body of the Association, Board members\nare more nearly comparable to \"members of the Cabinet\" and as such should\nhave a broad national outlook instead of only a regional one. And\nfinally, since good Boards are characterized by dynamic group thinking\nand discussion, as originators of policy, rather than merely voting on\nindividual items submitted to them for comment by the President, forth¬\nright, broad, educational thinking is an important qualification.\nPresent incumbents for the regions from which Directors are to be elected\nthis year are as follows: Region II - Mr. Earl Wynn, Communications\nCenter, University of North Carolina, Chapel Hill, N. C.; Region IV - Dr,\nBurton Paulu, Station KUOM, University of Minnesota, Minneapolis, Minn.;\nRegion VI - Mr. Edwin Adams, School of Communications, University of\nWashington, Seattle, Washington.\nNOMINATIONS MUST BE RECEIVED AT NAEB HEADQUARTERS NOT LATER THAN SEPTEMBER\n20, 1956."
}