{
  "id": "d1758-1",
  "text": "-2-\nIMPORTANT NOTICE BELOW\nFROM PROFESSOR J. C. JENSEN, DIRECTOR AND ENGINEER, RADIO STATION WCAJ, NEBRASKA\nWESLEYAN UNIVERSITY, LINCOLN. Indeed I am due Mr. Jensen an apology for overlooking\nthe letter below. Time is now very limited for the meeting he has suggested in New\nOrleans. No doubt many of our representatives will be in attendance at the Institute\nand Council mentioned in his communication. Will you therefore kindly get in touch\nwith him relative to the suggestions made in the communication. His letter reads as\nfollows} HAs representative of the Institute of Radio Engineers on the Council of\nthe American Association for the Advancement of Science, I am arranging for a meeting\nof the Institute at New Orleans from December 28 - January 2. It has occurred to me\nthat this would be a good opportunity to have a conference of representatives of the\nEducational broadcasting stations who might be present, giving special reference to\nthe technical problems of broadcasting. With this in mind I wrote Dr. Tyler and he\nindicated that both he and Mr. Perry Armstrong would probably be present for such a\nmeeting. What do you think of the desirability of promoting such a gathering, either\nas a part of, or in connection with the meeting of the Institute of Radio Engineers?\nKindly pass this on to Mr. Higgy for his comments also.’*\nFROM MR. CARL MENZER, DIRECTOR AND ANNOUNCER, STATION WSUI, STATE UNIVERSITY OF IOWA\nIOTA CITY* (Note--You will also find that the list of plays presented during 1930-31\nby Station WSUI prepared by Mr. H. C. Harshbarger, Department of Speech, State Uni¬\nversity of Iowa as follows by comments by Mr. Harshbarger)\n15Am sorry an answer to your letter has been delayed but the enclosed information has\njust been made available. I hope it includes the information you desire but if you\nwish more please write me.\nuYou may use this in any way you see fit.”\n’’During the year 1930-31 the following plays were broadcast from Station WSUI by the\nDepartment of Speech of the State University of Iowa:\n1. Airistophanes, The Frogs\n2. Robertson, Damon and Pythias\n3. Benelli, Love of Three Kings\n4. Pierre Patelin\n5. Goethe, Faust, with an arrangement\nof Gounoud’s music\n’’One act plays by Tchekoff, and other one act\n6. Goethe, Gammer Gurton’s Needle\n7. A Noble Outcast\n8. Tom’s Cabin\n9. East Lynne\n10. Ten Nights in a Bar-room\n11. The Octoroon\nplays were broadcast.\nwFor the year 1931-32 the following plays have been listed for broadcastings\n1. Rilev, The Barong\n2. Ibsen, The Wild Duck\n3. Ibsen, Pillars of Society\n4. Ibsen, The Master Builder\n5. Ibsen, Hedda Gabbler\n6. Shakespeare, Love’s Labors Lost\n7. Taming of the £>hrew\n8. Merry Wives of 'Windsor\n9. Othello\n10. Sardou, A Scrap of Paper\n11. Damas, Camille\n12. Stringberg, The Spook Sonata\n13. Gogol, Inspector General\n14. Chekov, The Cherry Orchard\n15. Kaiser, From Morn to Midnight\n16. Pirandello, Six Characters\n17. Capek, R. U. R.\n18. The Contrast\n19. Nellie the Beautiful Cloak TTodel\n20. Captain Jenks\n21. The New York Idea\n22 • The Yiitching Hour\n’’The above list is tentative but will be followed in general. If possible The\nChildren’s Theatre will produce the followings\n1. Ali Baba and the Forty Thieves 3. Alice in Wonderland\n2. The Toymeker of Nuremburg 4. Treasure Island\n5. Cinderella"
}