{
  "id": "d1758-2",
  "text": "-3-\n\"re have don© a group of one act plays:\n1. Sheridan, The Scheming Lieutenant 2. Maeterlinck, The Death of Tinta-\ngiles.\n3. Kipling, Bimi, a dramatization\n\"The dramatic program of the Department of Speech is, of course, experimental, We\nare frankly trying to discover the best vehicle for broadcasting purposes. At the\nsame time we are concerned with giving best from the various types of dramatic litera¬\nture to the listeners of WSUI. To that end plays from various periods of the drama,\nas well as representative authors have been selected.\n\"Speaking only for myself, I am convinced that plays with a strong plot broadcast more\neasily, or more successfully from the point of view of the average listener, than do\nthose which attempt to discuss the ills of society. The talkative play, as is the\ncase with all full length plays, must be cut to an hour or less. This means that the\nstory can be made to stand out in bold relief, often time making the broadcast version\nas strong, if not stronger, than the usual production.\n\"It is probably true that the precise form of the radio drama has not been discovered.\nIf this is true, it means that in time all broadcasting stations will write, or use,\nplays written especially for broadcast purposes.\"\nFROM PROFESSOR J. C. JENSEN, DIRECTOR AND ENGINEER, RADIO STATION WCAJ, NEBRASKA\nVS'SLEYATT UNIVERSITY, LINCOLN: \"Congratulations on your special bulletin for November\n5, I am passing it on to our Expression Department and hope that they will get a\nnumber of suggestions from it.\n\"In reply to the request of Mr. C. M. Koon it seems to me that the Office of Education\nat Washington could do some constructive work by bringing more generally to the atten¬\ntion of teachers in the public schools the various educational broadcasts which are\navailable by radio, and also by cooperating with the broadcasting stations themselves\nin working out a schedule and outline of courses which would be desirable for school\npurposes.\n\"Our continuity Collegiate Fantasia* is beginning to attract considerable attention.\nThis fdea may be worth passing on as it has become a regular feature with our station.\nThe continuity parts are carried by the negro janitor, his little girl ’Sugar,’ a\ngreen freshman, a sophisticated sophomore coed, and a junior who is president of the\nDramatic Society at ’Midwest University’ where all the scenes are laid. These char¬\nacters provide the introduction and also introduce elements of romance and local color,\nwhile the dramatic club gives rehearsals which the audience hears, and the glee club\nand quartet sing. As you see the purpose is to hold the interest of the radio audi¬\nence.\n\"Our new 500 watt transmitter is covering the territory beautifully and we were heard\non a recent Monday evening in Monterey, Mexico.\n\"The Commission has returned our application for increase in power on the ground that\nit conflicts with general order Nn. 102. The Commission granted an increase of 20,000\nwatts to another Lincoln station recently, and maintained that this did not affect the\nquota of the state or zone.\n\"Are you selling any advertising time this year? One of the newspapers carries a\nstory from the University of Arkansas to the effect that they have taken on a number\nof commercial accounts recently. We are tempted to do likewise as a financial ex¬\npedient.”"
}