{
  "id": "d324-14",
  "text": "length of the time delay in the recorded presentation of a live program is\nof such extent that the public interest would require such identification.\nSouthwest points out that it is frequently expedient for it to record and\ndelay network newscasts approximately 30 minutes; that much of the news\ncontent of such programs is hours old at the time of the; live release, and\nthat it is not essential to the public interest that a recorded delay in\nthe spoken presentation of such newscasts be identified as recorded since\nthe timeliness of the program is little, if any, more affected than if a\nlive release itself were similarly delayed. A number of parties urge that\n'even if certain categories of programs are required to be announced as\nmechanically reproduced, network programs which are delayed to accommodate\n.daylight saving time or time zone differences should be exempted entirely\nfrom any such requirement. Romford Broadcasting Company suggests that since\nthe vast majority of programs on radio today are entirely transcribed or\ncontain recorded and transcribed music, it would be more realistic for\nbroadcast stations to make announcement of the fact of a \"live” program as\n•opposed to the present rule requiring identification of recorded programs.\n8. If the NARTB proposal is not adopted, ABC and many other\nparties who support the NARTB proposal urge that as a minimum, paragraph (a)\n(6) Section 3.118, should be amended, as proposed, to take care Of time zone\nas well as daylight saving differences across the country by permitting net¬\nwork prograins to be delayed up to four hours with only a single daily\nannouncement that such programs are transcribed at an earlier hour for later\npresentation. They recommend that the amendment also be made applicable\nto EM, TV and non-commercial educational Fll stations also. Some parties\nsuggest that the present and proposed requirement in the.waiver that an\nannouncement be made once each day to the effect that all or some network\nprograms are delayed broadcasts by means of transcripts n where daylight\nsaving time or time zone differences are involved serves no useful purpose\nand should be deleted. It is argued that years of experience with the\ndaylight saving time waiver have demonstrated that the failure' to make\nseparate announcement for programs transcribed and broadcast at a later time\nbecause of daylight saving time has worked no injury pn the public, stations\nor the networks and that the public has benefited from the elimination of\nrepetitious announcements and the interruption of programs. It is contended\nthat if the present waiver provision.with respect to daylight, saving differ¬\nentials is sound, a similar waiver is equally appropriate to accommodate time\nzone differences;.that the public is as completely aware of the time zone\ndifferentials and their effect on.radio and TV programs as they are.of day¬\nlight saving .time changes; that the effect upon broadcasting of time zone\nvariances pre-dates the;adoption of daylight saving.time in seme areas and\nis therefore an even more, familiar and accepted technique of American\nbroadcasting; that advertising promotion, and listening habits have educated\nthe public.in the various, time zones to the fact that leading network shows\n• originating in New. York are received via their local stations one, two or\nthree.hours later; that the public demands that its local stations carry\nthes.c network shows on a delayed basis so that the programs, are available\nlocally, in comparable leisure time, and that repeated announcements that\nthe program is transcribed for delayed broadcast is of no value and is boring\nto the average listener or viewer. It is also urged that.the provision in\nthe proposed waiver amendment — that the Commission be advised of any\nnetwork organization or individual station taking advantage of the waiver —\nbe eliminated,, since public demand and past practice indicate that\nall broadcasting stations will continue the practice pf delaying net-\nwork programs to adjust for the time zone. It is claimed, therefore that"
}