{
  "id": "d324-16",
  "text": "create the music and. whose livelihood depends upon the opportunity to create\nmore and more live music? that musicians have “been displaced from their\nchosen profession “by the millions of records played in juke—boxes, “broadcast¬\ning stations, Hwiredw musical programs and the like so that today less than\n75,000 musicians out of a total of more than 252,000 earn the “bulk of their\nliving out of music? and that unlike other displaced workers they have\nno chance of “being absorbed in other musical channels. It urges that the\nfuture of music in America, as well as the livelihood of musicians, is\nthreatened by the continued advances of mechanized music and that this fact\nmust be forefront in assessing the instant proposal. It urges that an announce¬\nment of a recorded musical program serves a necessary function in the musical\nworld by preventing the public from being deceived that it is hearing live\nmusic at the time of performance and as a constant reminder that live musicians\nare not being used. It contends that it is better to irritate a listener to\nthe point of demanding live music than to lull him into any easy, acceptance\nof canned music and all the resulting economic and cultural dislocations.\nThe Federation alleges that to abandon all requirements of revealing the\nmechanized nature of musical programs will serve to help only the entrepreneurs\nof musical automation and will cause unemployment for musicians and lessen\nthe opportunity for developing and maintaining real rusical culture in\nAmerica. It urges that the present problem is more than one of. encouraging\nthe utilization of live talent by broadcasting stations, which the Commission\nhas recognized as desirable, but that it is one also of preserving and sustain¬\ning the talent which we now have; that radio and television stations have\nMa positive responsibilityH not to utilize mechanized music in such a way as\nto discourage live talent and to blind the public to the human displacements\nthat inevitably result, and that denial of the proposed amendment will further\nthe lessening of the evils of mechanized music.\n11. The mechanical records rules were promulgated to protect the\nlistening and viewing public from deception. In former years, mechanically\nreproduced programs were markedly inferior to live programs, and rules re¬\nquiring the identification of nearly all mechanical reproductions were\nnecessary to protect the broadcast audience from being led to believe that\nprograms broadcast by mechanical reproduction consist of live talent. As\nthe quality of mechanical recordation has improved and its use by the broad¬\ncast services has increased, we have relaxed or modified the mechanical\nrecords rules whenever we found that certain identification requirements for\nmechanical records were unnecessary to keep the listener or viewer reasonably\napprised of whether a program was live or mechanically reproduced and when\nthey served only to burden broadcasters unnecessarily or to cause wearisome\nrepetition of announcements which the public for the most part would recognize\nas such, e.g., programs of one minute or less and programs delayed for one hour\nbecause of the daylight saving time differential.\n12. The two proposals before the Commission in this proceeding are\nsimilar to the proposals for amendment of the AM mechanical recordation\nrules which were before us in 1946 in Docket No. 7611. The arguments advanced\nin support of the instant proposals are likewise similar to those which we\nconsidered at that time. At the conclusion of the 1946 proceeding we amended"
}