{
  "id": "d324-28",
  "text": "5\na specific definition of interference for use in applying this\nsection is adopted, the Commission runs the risk of serious ad¬\nverse effect on existing and future television broadcast ser-\nviea|, Once the concept of definable interference is adopted,\nefforts will undoubtedly be made to have it applied in other\nsituations in which television interference pight occur,. If\ninterference is left undefined, or not specifically related to\nthe low power VHF booster service, it may ultimately result in\nsuccessful efforts to establish television stations at less than\nminimum mileage separations,\n7* Apatfaflttft serious problem raised by the proposed rules\nconcerns the effect of a VHF booster on possible future improve¬\nments of existing television broadcast stations. Section 4.903(c)\napparently recognizes the potential effect of VHF booster opera¬\ntion on future improvements of service by existing television\nbroadcast stations insofar as it provides that the VHF booster\nwill not be protected against interference from other classes of\ntelevision stations. This is indeed a salutary provision, which\nwill ensure that the existence of a VHF booster will not pre¬\nclude the improvement of existing VHF television broadcast facili¬\nties. Section 4.903(d) is apparently concerned with the problem\nof the interference which might be caused by VHF boosters to\nfuture or improved television services. The NAEB interpret*\nSection 4.903(d) as protecting future television broadcast ser¬\nvices from interference by existing VHF boosters. However, the\nlanguage of that subsection ic, in this regard, far too ambiguous.\nThis protection must be spelled out in detail. Here, again, th#\nlack of a definition of interference is also of crucial import¬\nance, Unless such a definition is provided, the entire televi¬\nsion allocation structure will be threatened.\n8. It is respectfully urged that if the proponents of\nthe proposed rules can maxe an adequate technical showing to"
}