{
  "id": "d324-57",
  "text": "In the Matter of\nBefore the\nFEDERAL COMMUNICATIONS COMMISSION\nWashington 25* D. C.\n)\n)\nAmendment of the Commission’s )\nHRtales and Regulations to permit )\n*;Uhe operation of TV translator )\nstations in conjunction with the ),\nprimary transmitter. )\n/ 5/W^1\nFCC 56-488\n32132\nj < EC El V EX\nNAEB HEADQUARTERS\nJUf'i 1 11956\nDocket No. 11611\nREPORT AMD ORDER\nBy the Commission: Commissioners Eelster and Mack not participating.\n1. The Commission has before it for consideration its Notice of\nProposed Rule Making (FCC 56-UW* issued in this proceeding on January 17*\n1956* proposing the authorization of television translators.\n2. The Commission has been concerned with the important problem\nof providing television service to small* isolated communities and sparsely\nsettled areas beyond the range of stations now on ’the air. Many such com¬\nmunities and areas are unable to support their own television station under\npresent requirements* even though channels may be assigned to the community\nor would be available for assignment. The purpose of this proceeding has\nbeen to explore the possibility of low-cost television translator stations\nas one means of extending the benefits of television to these outlying\ncommunities and areas.\n3. Translators would employ relatively inexpensive* low-powered\nequipment designed to receive the signals of existing ‘television stations\nand convert them for retransmission on one of the upper lU UHF channels —\nChannels 70-83. It is possible* by confining translators to this less con¬\ngested portion of the television band* to relax generally the operating\nrequirements for translators and to obtain maximum flexibility in the assign¬\nment of channels since the required number of protective spacings from\nexisting stations is reduced substantially. With this in mind* the proposed\nrules reduce the translator operating requirements to the barest minimu con¬\nsistent with dependable service and protection of other services.\nh* All interested parties have been afforded the opportunity of\nsubmitting comments on the translator proposal. Of the approximately 35\ncomments filed in the proceeding* only one expresses outright opposition to\nthe authorization of translators. 1/ However* a number of the comments*\nwhile generally supporting the proposal* suggest that this proceeding be ex¬\npanded to encompass other means for providing service to isolated communi¬\nties or advance suggested revisions to particular provisions, 2/ Upon our\n1/ K-V Electronics* Inc.* Ellenville* N.X.* opposes the authorization of\ntranslators* contending that their installation and operating costs would be\nprohibitive. However* no factual data was submitted in support of this con¬\ntention.\n2/ The comments are diseussed briefly in the course of the general discussion\nbelow."
}