{
  "id": "d324-58",
  "text": "-2-\ncareful consideration of the comments, we have concluded that the public\ninterest would be served by the authorization of television translators; ■\nand we are amending our rules to provide for their establishment. »'Je have,\nhowever, incorporated into the rules a number of revisions suggested by\nthe comments filed, as indicated in the course of the discussion below.\n5. Comments generally supporting translators were submitted *J\nby National Broadcasting Company, Inc., Coastal Bend Television Company\n(KVDO), Corpus Christi, Texas, the Radio Electronics Television Manufac¬\nturers Association (RETMA) and Adler Electronics, Inc., New Rochelle,\nNew York. NBC states that translators will provide an economical method\nof supplying television service to underserved areas without departing\nfrom the allocation plan. Coastal Bend submits that translators will\nafford a means by which UHF stations can serve \"white areas\" beyond their\nnormal service range. RETMA, while suggesting several amendments to par¬\nticular provisions, expresses general support for the translator proposal.\nAdler Electronics expresses support for translators and notes that it has\ndeveloped 10 watt equipment for translator use. Adler represents that a\nmodel of such equipment is available for type testing and presents technical\ndata with respect thereto. 3/\n6. ¥SM, Inc. (WSM-TV), Nashville, Tennessee, C.J. Community\nServices, Inc., Bridgeport, Washington, Washington State TV Reflector\nAssociation, and Congressman Bon Magnuson of the State of Washington\nsuggest that on-channel boosters be authorized in addition.to translators\nas part of a broader scheme for serving outlying areas. C. J. Community\nServices maintains that by its action the Commission has apparently selected\nUHF translators as the.only feasible method for extending television to\nisolated areas, and argues that this method alone will not suffice and that\nproven methods,.currently in use, such as on-channel boosters, should also\nbe employed. C. J. Community Services submits that the Commission’s obliga¬\ntion to provide for more effective use of radio cannot be discharged merely\nby translators. The Reflector Association contends that the terrain in\nWashington east of the Cascades makes direct reception of television service\nvirtually impossible and that unauthorized on-channel boosters have pro¬\nvided a practical solution. Boubts are voiced as to the feasibility of UHF\ntranslators in the area. It is argued that since the principal service al¬\nready there is VHF, UHF would not provide satisfactory coverage in rough\nterrain, and that the initial cost, as well as maintenance and upkeep, would\nbe prohibitive' in light of the technical difficulties inherent in operation\nin this part of the spectrum. The Association maintains, for these reasons,\nthat limiting authorizations to UhF translators would effectively deprive\nisolated communities of service. In urging authorization of boosters in\naddition to translators, Congressman Magnuson refers to the technical diffi¬\nculties attendant'upon operation on the higher UHF channels and notes that\nboosters would not entail conversion of outstanding sets. He submits that\nthe translator proposal is too limited in scope and should constitute only\none facet of a comprehensive, flexibile program, which would afford alter¬\nnative means for bringing service to small communities and would enable each\ncommunity to select the particular system best suited to its own economic\nand geographic conditions.\n3/ Several other comments also endorse the proposal in part."
}