{
  "id": "d324-60",
  "text": "10. Spencer Kennedy Laboratories, Boston, Massachusetts, and\nthe National Community Television Association urge the Commission to con¬\nsider the effect that translators would have on established community\nantenna systems, which have been bringing television service to isolated\ncommunities. They submit that these systems provide service to many people\nand widespread creas at a reasonable fee, and represent a large aggregate\ninvestment by local groups and the public. The Association requests the\nCommission to consider the impact that translators would have on this\nestablished and proven method of providing fringe area service^ and urges\nthat while community antenna systeras should not be protected from compe¬\ntition, the requirements for translators should not be so low that tech¬\nnically and financially unsound translator installations would undermine\nthe ability of community antennas to continue to provide service to the\npublic. Spencer Kennedy urges that because community antenna systems wore\nundertaken in good faith and offer enormous potential to local communities,\nthey should be afforded a breathing space of 3 or h years before being\nsubjected to competition from translators. This could be accomplished,\nit is suggested, by providing that in any community which on March 1, 1956\nhad a community antenna system, a translator would not be authorized prior\nto March 1, i960.\n11. We recognize that during these formative years in the de¬\nvelopment of the television service, community antennas, although not es¬\ntablished under Commission authorization, have contributed significantly\nin providing television reception to isolated areas without service from\nregular stations. But community antennas do not provide a broadcast ser¬\nvice available to the public at large. Their service is limited to sub¬\nscribers who must pay a fee, and often is not available even at a fee for\nthose members of the community in outlying areas. The Commission, under the\nCommunications Act, is obligated to provide a fair and equitable distribu¬\ntion of television service. We would not be warranted in withholding the\nauthorization of translators, designed to provide television to isolated\ncommunities, merely because they would compete with community antennas pro¬\nviding service to some people at a fee. Investments in community antennas\nwere not made on the basis of any assurance that the areas served by them\nwould remain without direct television reception. Such systems have been\ninterim measures, taken without Commission authorization, to provide out¬\nlying areas with television until direct reception could bo achieved. The\npublic interest would not be served by depriving a community of the pri¬\nvilege of obtaining direct television reception to protect these investments.\n12-. UMPQUA Radio and Television, Inc., Roseburg, Oregon, supports\nthe translator proposal but suggests that, in addition, the top lh UHF\nchannels be made available for a \"limited or modified common carrier relay\nsystem\" to provide means for relaying programs from large metropolitan areas\nto small communities, many miles distant. Archer S. Taylor, Missoula,\nMontana, proposes, similarly, that translators be authorized to relay signals\nfrom a reception point on a mountain to cable distribution systems in small\ntowns as a means of eliminating expensive microwave relays and cable runs.\nHe also suggests that translators could be used to extend service by means\nof scrambled subscription transmissions to fringe areas not connected to the\ncable systems."
}