{
  "id": "d324-66",
  "text": "-10-\n2 qualified operators, and would thus conflict with the intended objective\nof providing low cost operation. These parties maintain that because of\nthe low power employed and the automatic devices geared to take the station\noff the air upon, improper operation, there is little likelihood of any harm\nto other services, We believe the foregoing comments have merit, and we are\nrelaxing our requirements to provide for observations once every 6 hours,\n32. Western Slope asserts that the requirement of monitoring\nby a commercial grade operator will impose hardship in instances where\nsuch operators are not available in the community, and submits that where\nthe originating station assumes responsibility for correct operation of\nthe translator, so that the first class operator of the originating station\nwould be available, the hourly monitoring by a commercial grade operator\nshould be waiveo and any qualified, person should be permitted to observe\nand report to the originating station any deviation from normal service.\nAs noted above, we are relaxing the observation requirements. However, we\nare of the view that the observations should be made by an operator holding\na commercial grade license in order that satisfactory service will be\nassured.\n33. In order to implement our new translator rules, we are\nadopting FCC Form 3U6, to be used in making, application for a Construction\nPermit for a Television Broadcast Translator Station. This form and other\nappropriate forms will be available in the near future.\n3iu Authority for adoption of the rules herein is -contained in\n303(a)’ (b)* (o )a (d)> (e)> (f)' (8)» (J)> (r),\nana 307(b) of the Communications Act of 193k, as amended.\n35. In view of the foregoing, IT IS ORDERED, That effective\nJuly 2, 1^56, the Commission^ Rules and Regulations ARE AMENDED aa set\nforth in the attached Appendix.\nFEDERAL COMMUNICATIONS COMISSION\n, ' Mary Jane Morris\nAttachment Secretary\nAdopted: May 23, 1956\nReleased: May 24, 1956\nNOTE: Rules changes herein will be included in Amendment 4-4,"
}