{
  "id": "d324-68",
  "text": "SUBPuRT G - TELEVISION BROADCAST TRANSLATOR STaTIONS\nDEFINITIONS aND ALLOCATION OF FREQUENCIES\n§ 4^701 Definitions, (a) Television broadcast translator station;\nA station in the'broadcasting service operated solely for the purpose of re¬\ntransmitting the signals of a television broadcast station or another\ntelevision broadcast translator station, by means of direct frequency conver¬\nsion and amplification of the incoming signals and without significantly\naltering any characteristic of the incoming signal other 'than its frequency\nand amplitude, for the purpose of providing television reception to the\ngeneral public.\n(b) Primary station; ’The television broadcasting station radiat¬\ning the signals which axe retransmitted by a television broadcast translator\nstation, • ;\n§ 4*702 Fre■••uency assignment. (a) An application for a tele¬\nvision broadcast translator station shall be specific with regard to the\nchannel requested. One of the following channels may be assigned;\nChannel No.\nFrequency Band\nVisual Carrier\nFrequency\nAural Carrier\nFrequency\n' 70\n806-812 Me\n807.25 Me\n811.75 He\n71\n812-318 Me\n813,25 Me\n817.75 Me\n72\n818-824 He\n819,25 He\n823.75 Me\n73\n824-830 Me\n825.25 He\n329,75 Me\n74\n83O-836 Me\n831.25 Me\n835.75 Me\n75\n836-842 Me\n837.25 Me\n841.75 Me\n. 76\n842-843 Me\n343.25 Me\n847.75 Me\n77\n848-854 Me\n849.25 Me\n853.75 Me\n78 •\n854-860 Me\n855.25 Me\n859.75 Me\n79\n860-366 Me\n861.25 Me\n865.75 Me\n80\n866-872 Me\n867,25 Me\n871.75 Me ,\n81\n872-878 Me\n873.25 Me\n877.75 Me\n82\n878-884 Me\n879.25 Me\n883.75 Me\n•83\n834—890 Me\n885.25 Me\n£89.75 Me\n(b) An applicant for a television broadcast translator station\nshall endeavor to select a channel cn which its operation will not cause\ninterference to other television broadcast translator stations.\n(c) A channel listed in paragraph (a) of this section will not\n•be assigned to a television broadcast translator station located:\n(l) within 20 miles of a television broadcast channel\nassignment on the second, third, fourth, fifth, or\n• eighth channel below or above the requested .channel;"
}