{
  "id": "d324-69",
  "text": "- 2 -\n(2) -within 55 miles of a television-broadcast channel\nassignment on an adjacent channelj\n(3) within 60 miles of a television broadcast channel\nassignment on the seventh channel above or below or\nthe fourteenth channel below the requested assignmentj\n(4) within 75 miles of a television broadcast channel\nassignment on the fifteenth channel below the requested\nassignment;\n(5) . within-155 miles of a television broadcast channel\n• assignment -on the same channel as that requested for\nthe television broadcast translator station, «\nThe distances .specified above in this paragraph are to b& determined with\nrespect to channels having the above relationship, betwe n the proposed.:'\nsite of;the television broadcast translator station and .the Post Office\nlocation in any city listed in Section 3.&06 of the Commission’s Rules\nunless the channel shown-therein,has been assigned to a television broad¬\ncast station, in which case the distance shall be determined between the\nproposed site of the translator and the transmitter site of the television\nbroadcast station. Changes in the Table of Assignments of Section 3.606(c)\nmayt.be made without regard to existing or proposed television broadcast\ntranslator stations and where such changes result in minimum separations\nless than those specified above, the licensee of an affected television\nbroadcast'translator station .shall file an application for a change in\nchannel assignment to comply .with the required separations.\n(d) No minimum distance separation is specified between television\nbroadcast translator stations operating on the same channel. However, the\nseparation shall in all cases be adequate to prevent mutual interference.\nAdjacent .channel assignments-will not be made to television broadcast trans¬\nlator stations intended-to serve all or a part of the same area*\n•• ’■ § 4.703 interference. (a) An application for a new television\nbroadcast translator station or for changes in the facilities of an exist¬\ning station will not be granted where- it is apparent that mutual interfer¬\nence .-will result, within,the- area or areas intended to be served by .such\nstations. In. general, the licensee, of . a.-new television broadcast translator\nstation shall protect existing television broadcast translator stations\nfrom interference resulting from its.operation,\n(b) It shall be the responsibility of the licensee of a television\nbroadcast translator station ta correct any condition of interference which\nresults from the radiation-of radio frequency energy by its equipment on any\nfrequency outside- the assigned channel. Upon notice by the Commission to\nthe \"station licensee or operator that such interference is being caused, the\noperation of the television broadcast translator station shall be suspended\nimmediately and shall not be resumed until the interference has been elimi¬\nnated, or it can be demonstrated that the interference is not due to spurious\nemissions by the television broadcast translator station: Provided, however."
}