{
  "id": "d324-77",
  "text": "TECHNICAL OPERATION\n§ 1}.761 frequency. toleraqce. The-licensee of a television broad¬\ncast translator station shall maintain the'visual'carrier frequency and the\n; aural center frequency at the output of the translator within O.Ol\",percent\nof its'assigned frequencies when the primary station is operating exactly\non its assigned frequencies. This tolerance shall not be exceeded at times\nwhen the primary station is not on its assigned frequencies, by more than\nthe amount o.f'the departure by the primary station. .\n§ lu762 Frequency monitors and measurements, (a) The licensee\nof a television broadcast translator station .is not required to provide\nmeans for measuring the operating frequencies .of the transmitter. However,\nonly equipment having the required stability will be approved for use at a\ntelevision broadcast translator station.\n(b.) In the event that a television broadcast translator station\nis found to be operating beyond the frequency tolerance prescribed in\nSection it,761, the licensee shall promptly suspend operation of the trans¬\nlator and shall not resume operation until the translator has been re¬\nstored to its assigned frequencies. Adjustment of the frequency determining\ncircuits of a television broadcast translator station shall be made only by\na qualified person in accordance with Section U*705(d) of these Rules.\n(c) The licensee of a television broadcast translator station\nmay, at its discretion, provide means for comparing the frequency of the\ntranslator with an external frequency source of known accuracy as a pre¬\nventive measure to avoid unnecessary interruptions to service.\n§ U.763 Time of operation, (a) A television broadcast trans¬\nlator station is not required to., adhere to any regular schedule of operation.\nHowever, the licensee of a television translator station is expected to pro¬\nvide a dependable service to the extent that such is within its control and\nto avoid unwarranted interruptions to the service provided.\n(b) If causes beyond the control, of the licensee require that a\ntelevision broadcast translator station remain inoperative for a period in\nexcess of 10 days, the Engineer in Charge of the; radio district in which\nthe station is located shall be notified promptly in writing, describing\nthe cause of failure and the steps taken to place the station in operation\nagain, and shall be notified promptly when the. operation is resumed.\n(c) Failure 6f a television broadcast translator station to\noperate for a period.of 30- days or more, except for causes beyond the\ncontrol of the licensee, shall be*deemed evidence of discontinuance of\noperation and the license of the station will be cancelled.\n(d) A television broadcast translator station shell not be per¬\nmitted to radiate during extended periods when signals of the’primary\nstation are not being retransmitted."
}