{
  "id": "d324-78",
  "text": "-11-\ni b»7&h Station inspection. The licensee of a television\nbroadcast translator station shall make the station and the records\nrequired to be kept by these Rules, available for inspection by represen¬\ntatives of the Commission.\n§ U.765 Posting of station and operators licenses, (a) The\nstation license and any other instrument of authorization or individual\norder' concerning the construction of the equipment or manner of operation\nshall be posted in a conspicuous place in the room in which the trans¬\nmitter is located so that all terms thereof are visible; Provided:\n(1) If the transmitter is operated by remote\ncontrol pursuant to Section h*73>b} the station\nlicense shall be posted in the above described\nmanner at the control point.\n(2) If the transmitter is installed so as to\nbe exceed to the elements and posting of the\nlicense would result in its being so exposed,\nthe license or a photo copy thereof may be\nkept in the possession of the operator in\ncharge of the transmitter. If a photo copy\nis used, the original license shall be con¬\nveniently available for inspection by a\nrepresentative of the Commission.\n(b) The original of each station operator license shall be\nposted at the place where he is on duty: Provided, however. That if\nthe original license of a station operator is posted at another radio\ntransmitting station in accordance with the Rules governing that class\nof station sand is there available for inspection by a representative\nof the Commission, a verification card (Form 75>8-F) is acceptable in lieu\nof the posting of such license: Provided, further, however. That if\nthe operator in charge holds a restricted radiotelephone operator permit\nof the card form (as distinguished from the diploma form), he shall not\npost that permit but shall keep it in his personal possession.\nI I4..766 Operator requirements. (a) The actual operation of the\ntransmitting apparatus at a television broadcast translator station shall\nbe carried on only by a person holding a valid commercial radio operators\nlicense or permit of any class issued by the Commission except a Temporary\nLimited Radiotelegraph Second-Class License or an Aircraft Radiotelephone\nOperator Authorization, who shall provide supervision to no less e;rfcent\nthan that required by Section lu73ii of these Rules, and who shall be re¬\nsponsible for the proper operation of the apparatus with respect to those\nfunctions under his control. This responsibility, however, shall in no\nway relieve the licensee of its responsibility for the proper operation of\nthe station."
}