{
  "id": "d1306-1",
  "text": "-2-\nASSQCIATION SECURES RECURDING EQUIPMENT\nThrough a grant of five hundred dollars from the National\nAdvisory Council on Radio in Education, the NAEB has purchased\nrecording equipment to assist in the exchange of program ideas and\ntechniques. After seeing the possibilities for improving broadcast¬\ning standards. Dr. Levering Tyson reeommended the expenditure.\nEarlier in the year, Carl Menzer (WSUI) and John Stiehl\n(WHA) began testing various makes of recorders to select the one best\nsuited to the needs of the association. A Universal machine was pur¬\nchased as a result of these tests. The recorder is now at Iowa City\nwhere Carl is preparing an instruction manual to accompany the machine\non its tour of the stations.\nThe machine will soon be available to member stations\nhaving programs which they think embody something which other sta¬\ntions should know about. Other uses may be found. Because many\nstations v/ill be wanting to use this equipment, directors are urged\nto plan and rehearse their programs well in advance of the time the\nmachine is to arrive.\nIf you want the machine, write to Carl Menzer (WSQI), Iowa\nCity, who v/ill route it according to the needs of the stations. He\nwill explain the details of the round-robin plan to use the machine\nfor the improvement of educational program techniques and the estab¬\nlishment of an exchange library of recorded features.\nCOLUMBUS MEETING\nOn May 4, representatives of NAEB member stations attend¬\ning the Radio Institute met at the Deshler-Wallick Hotel. President\nH. B. McCarty presided.\nMr. McCarty reported on the meeting of the Sub-Committee\non Conflicts of the Federal Radio Education Committee, at which he\nrepresented the Association. Plans are under consideration for\nvarious studies and surveys aimed to improve relationships between\neducators and broadcasters and to provide for the development and\ntransfer of program techniques.\nCarl Menzer reported oh his experimental work in testing\nrecording equipment. His report indicated that the Universal machine\nseemed superior to others tried.\nThe matter of a meeting place for the 1956 summer convention\nwas discussed. It was voted to hold it at Madison, Wisconsin. This\nadhered to the plan of meeting at the home-city of a member station.\nThe exact dates of meeting were to be fixed later h.y mail.\nGeneral discussions on the news-letter, transcription\nservice, memberships, and other items of business followed, after\nwhich the meeting adjourned."
}