{
  "id": "d1137-1",
  "text": "A WORD FROM THE NEW PRESIDENT\nI appreciate very much the honor of heading the association and ask that each\nof you help in every possible way to make our efforts for the coming year hear fruit.\nThere are many things to do, hut an official announcement of what we have in mind will\nnot he forthcoming until earlv in the ffnll. In the meantime, I want to leave the fol¬\nlowing remarks for vour consideration.\nThe inference voiced repeatedly during the past two or three years by our com¬\nmercial friends, not only at radio hearings hut more frequently in the radio press,\nthat educational stations are not doing a good job because a good job is impossible\neven by a smaller station unless a large sum of money is spent, is an erroneous one\nthat needs some denial.\nThese statements are invariably based on judgments which follow the reading of budget\nfigures as presented by the various educational institutions.\nThe fact that an educational institution spends only $1500 or $3000 (some spend\nmany times this amount) to do a nine months* job is no more a criterion of what it\naccomplishes than it would be for us to accept the fact that because $60,000 is spent\nby a chain in producing one program it is 10C$ perfect.\nThis impression concerning educational stations has come about through a lack\nof knowledge on the part of those not familiar with educational broadcasting and more\nparticularly with the budget systems - of educational institutions. They do not take\ninto consideration, at least for the purpose of argument, that educational stations\npay nothing for talent and in most cases not even a charge is made against the radio\noperating funds for salaries. Last year, to cite our own case as an example, the\nUniversity’s budget showed a total charge against the radio station for $3950. Only\n•^600 of this was included in the salary item, A true picture would have shown that\nby charging one-fourth of the time of the Director and one-fourth the time of the\nAssistant Director to the salary item, the salary expense alone would have exceeded\n$2600. If we add to this another item which takes care of those people working at\nthe radio station but who are not on regular University appointment, another $1,000\nwould be added to this figure, or a total of $3600. It just so hardens that educa¬\ntional budgets for the most part are not made up in the way as are those of commercial\nstations.\nThe talent item would amount to a considerable sum if we found it necessary to\npay for that item in the same manner that the commercial stations do. These short\neducational talks that a certain portion of the listening public seems to enjoy\n(whether our *commercial friends believe it or not; have some value and I can prove\nit by just this one instance. One of our staff members has been giving a series of\ntalks which has been so well liked that a commercial advertiser has offered the gentle¬\nman $600 apiece for a series of twelve ten-minute talks. In my opinion the discus¬\nsions of this man were no better than those of most of our other speakers, Is it\nentirely wrong then to assume that if these talks are worth $600 apiece to this com¬\nmercial advertiser that they should be worth at least a tenth as much to us - or $60\napiece? Over our own station during the past year we have given 493 talks which,\nfigured at the rate of $60, would be worth $29,580. Likewise, I might show you that\nwere it necessary for us to pay for the musical talent which is available to*us, we\ncould easily have spent some $20,000 for that item alone.\nJust on the above.few items, therefore, my budget might have read $53,180 instead of\n&3950.. This is without all consideration of maintenance and depreciation and of such\noperating costs as operators and announcers. All such personnel are students who\nreceive the student rate of fifty cents an hour for the time actually spent. Neither\ndoes the above amount include anything for the expense of office and building rentals,\nheat, light, correspondence, and the hundred and one other little things that go to\nmake up the average operating cost sheet of a commercial station."
}