{
  "id": "d1537-0",
  "text": "SPECIAL BULLETIN\nRelease Date November 16, 1931\nTO MEMBERS\nof\nTHE ASSOCIATION OP COLLEGE AND UNIVERSITY BROADCASTING STATIONS\n(and a special request mailing list in addition to members)\nListed below you will find two very important communications. The first is from\nLEVERING TYSON, DIRECTOR OF THE NATIONAL ADVISORY COUNCIL ON RADIO IN EDUCATION,\nOF NEW YORK CITY, I am releasing this communication to the membership as a special\nrush bulletin in order that we may get the reaction from the entire group within\nthe next ten days.\nKindly note the subject matter presented in Mr, Tyson’s letter relative to the\nelectrical transcriptions of lectures now being released over a nation-wide network,\nsponsored by the economics and psychology committees of the National Advisory Council.\nWe most assuredly need these materials for the membership. If enough interest is\nshown by the membership there is no question in my mind but that Mr. Tyson will ar¬\nrange to have the series oloctricallv transcribed. This is our chance. It depends\nupon YOUR immediate action. Will you kindlv rush n letter to Mr, Tyson (address 60\nE. 42nd Street, New York City) and explain that wo need this material for the member\nstations of the Association, Will you kindly do this today in order that Mr. Tyson\nmay realize the need that college and university broadcasting stations have for this\nexcellent series of lectures. I will appreciate your sending a carbon copy to this\noffice in order that we nay complete our records before further advising Mr. Tyson\nof the Association's reaction. PLEASE DO THIS TODAY.\nThe following is a copy of Mr. Tyson’s letter:\n\"Your special bulletin with release date November 5 has just come in and is very in¬\nteresting.\n\"There is a bit of information which I would very much like to have if it is entirely\nin order to ask for it.\n\"Perhaps you are aware of the fact that the economics and psychology committees of\nthe Council have been broadcasting programs over a nation-wide network beginning\nOctober 17th. I am enclosing a list of the two series. Those were put on the air\na little bit earlier than we expected would be possible as we hardly thought it would\nbe possible to get them ready before January 1st. Because of this some of the details\nwhich we expected to clear wore not settled. One of these was the possibility of\nelectrical transcriptions of the lectures. Since the start of both series we have had\nindications from quite a few sources that the lectures should be electrically trans¬\ncribed for distribution to non-network stations.\n\"What I would like to find out from members of the Association of College and Uni¬\nversity Broadcasting Stations is whether these stations would be at all interested\nin transcriptions of the various items in those two series.\n\"The enclosed circular covers only the first ten lectures and there are thirty al¬\ntogether., Both series will continue after the Christmas holidays for twenty weeks.\n\"Wo have other committees of the Council ready with programs and as these come along\nthe question of transcriptions will arise again so you can realize that the effective¬\nness of transcriptions in the eyes of the college and university broadcasting stations\nis a question which interests us very much, /my information on this point you can\ndiscover for me would be very much appreciated.\""
}