{
  "id": "d1537-1",
  "text": "-2-\nThe second communication is from TRACY F. TYLER, SECRETARY AND RESEARCH DIRECTOR OF\nTHE NATIONAL COMMITTEE OH EDUCATION BY RADIO, WASHINGTON, D. C. This letter has just ■\narrived at this office air mail special delivery. The contents of this letter are of\nsuch importance relative to the nation-wide survey being conducted by the Committee\nthat I hasten to send it on to the members. &y way of explanation I might add that\nthe questionnaire forms released by the National Committee were late in reaching this\noffice as indicated in his reply to mo. I immediately rushed an air mail letter to\nMr. Tyler asking for an extension of time for member stations of the Association in\norder that careful thought and research might be made before member stations replied\nto the questionnaire. -You will note in his letter he explains that the forms have now\nbeen redrafted in order that the survey may be more comprehensive. I am passing this\ninformation on to you so that all stations holding membership in the Association may\npresent this questionnaire to the National Committee in the new form. It is quite im¬\nportant that all member stations cooperate with the Committee in this survey, since it\nis one of the most important pieces of work sponsored by educational radio groups up\nto the present time.\nMr. Tyler’s letter follows:\n\"I have yours of November 9 and regret very much that through the absence of President\nCrane you were late in receiving your questionnaires as they were sent from this office\nin ample time to give each individual a chance to check them over and make suggestions\nand return them to us here in \"Washington by November 5. As a matter of fact we had a\nnumber of suggestions and following several conferences we have drawn up a new question¬\nnaire which is to be presented at the Chicago meeting for criticism and adoption. I\nam sending you a copy under separate cover.\nMYou will note that this now questionnaire consists of but two forms. We finally de¬\ncided to give form 1 to the person in each institution responsible for broadcasting,\neither the station director of the director of extension or the chairman of the radio\ncommittee. Form 2 will go to each of the following: the executive officer of the\ngoverning board; the president of the institution; the business manager; the deans;\nthe director of agricultural extension; the director of general extension; the radio\nstation director; the technical director of the radio station; the program director\nof the radio station; the chairman of the radio committee. Arranging it in this way\nmakes it possible to effect a great reduction in the size of the inquiry blank. I\nassume that you realize that this data will be collected by the personal visitation\nof myself to each institution. I would welcome any criticisms you might make.\n”I am going to be in Chicago next week. If you wish to reach me my address will be\ncare of the Stevens Hotel.”\nA regular bulletin will follow in the course of the next few days. In the meantime\nplease send to this office any notice of importance or interest to the members of\nthe Association.\nT. M. Beaird\nExecutive Secretary for Ass’n\nUniversity of Oklahoma\nNorman, Oklahoma."
}