{
  "id": "d582-29",
  "text": "-3-\nlation of -western books, where this is necessary to advance the Foundations\ngeneral program in the country concerned.. In Japan, for example, it seemed\nspecially urgent that more worthwhile American books., not likely to become\nbest sellers, become available for translation. Partly for this reason, partly\nas a means of establishing contacts and good relations with Japanese publishers,\nthe Foundation was instrumental in obtaining rights to about seventy titles for\nJapanese publishers with the cooperation of various American publishers. Copies\nof about 200 titles suggested for translation are being sent to Japan.\nThe Foundation5s representative in Burma is interested in a plan for\ncondensation of western political books to be published in Burmese. He believes\nthat the project can be commercially successful if two suitable titles are\ntranslated each month. This project is now under study and will be applied\nto other countries if feasible.\nIn such projects, the Foundation is interested in achieving results\nin the most efficient way possible, and for that reason seeks to cooperate with\nother organizations more directly interested in this field.\nDistribution of Asian and Western Books in English\nThe Foundation is concerned with this problem only where there is\na clear and specific need, related to other Foundation projects, which is not\nbeing met by other programs.\nTEXTBOOKS\nThe Foundation’s interest in the textbook field, in addition to special\nemphasis on the educational needs of various Asian countries, also includes not\nonly education of children and students, but of adults as well. In the latter\nease, distribution is often not through commercial channels, but is carried on\nby the organization responsible for the adult education program.\nA series of textbooks (14.28,000 copies of fifty-eight volumes) have\nbeen produced, chiefly for primary schools, designed to replace communist texts;\npreparation and distribution have been made of a textbook (20,000 copies) in\ncivics; and aid given in the preparation of modem, pro-democratic texts.\nThe Foundation also is aiding in overcoming the dearth of information\nand technical literature in one Asian country by supporting the establishment\nof an educational publishing house, which will concentrate at first on texts\nfor upper schools and books for recent graduates of secondary schools who are\nunable to make use of text material in English, even when it is available.\nIn another country assistance was given in the financing of 5*000\ncopies of a primer for teaching basic literacy. Proceeds from the sale of\nthese primers will be used by the native sponsoring organization to spread\nliteracy on a household-by-household basis. The organization anticipates\nthat it will be able to start 200 schools on the basis of these primers in\none year from the beginning of the project in November, 1953.\nLibraries\nThe donation of books as an organizing device, or in such a way as\nto aid in the development of activities in which the Foundation is interested, is"
}