{
  "id": "d582-31",
  "text": "is planned to expand its scope at a later date if this seems warranted on the\nbasis of experience at these three schools.\nIn the field of used books* the Foundation at present has only one\nproject which was initiated by Shannon McCune, now teaching geography at a Tokyo\nuniversity. McCune wrote to his fellow geographers in the United States asking\nthem to send texts in that field which he would distribute on a nominal sale\nor exchange basis. The Foundation undertook to meet transportation costs where\nnecessary. The project has shown a tendency to snowball and has touched off\na number of \"drives9 for books not specifically related to Japanese needs and\nexceeding McCunefs ability to distribute them successfully.\nThe Foundation feels that the obstacles confronting a general book\ndrive for Asia are insuperable but is' attempting through the McCune project\nand other inquiries in Asia and the United States to see if it is possible to\ndevelop a series of individual projects* in which books specifically needed\nand requested by Asian students and professors can be provided efficiently by\nan appropriate group of Americans with some assistance and encouragement from\nthe Foundation.\nOther Book Gifts\nThe Foundation has no general give-away program for books. It finds\nsmall gifts of books very useful* however* in establishing good personal relation¬\nships* in recognition of services not otherwise compensated* and in other indi¬\nvidual cases. As an example. The Asia Foundation-Ceylon has a small fund for\nthe purchase of books, some of which have gone to the Geography Department of\nthe University of Ceylon* some to government probation officers* and some are\navailable in the representative's office. It has been proposed that certain\nlabor leaders be provided with a few volumes that they have requested.\nRelations with Other Agencies Working in the Book Field\nThe Foundation feels there is not necessarily any disadvantage in\nhaving parallel operations in the book field being carried on in Asia by American\norganizations* provided that there is sufficient liaison to ensure that the capa¬\nbilities of all groups involved are fully used. Where possible* the Foundation\nurges Asian organizations with which it is working to make use of existing\nservices and facilities rather than duplicate the work of others. In the field\nof book gifts* especially* the Foundation desires to stimulate and support the\nefforts of other private groups rather than undertake action programs itself.\nAt the same time* the Foundation maintains sufficient flexibility of action\nto meet any reasonable need for books related to the Foundation's general pro¬\ngram.\nThe Foundation plans to continue and amplify its work in stimulating\nthe development of non-communist Asian literature. As its relationships with\nAsian writers* publishers* and distributors in various countries broaden,\nincreased effort will be given to promoting cultural exchange within Asia\nthrough translation into various Asian languages and English as well as travel*\nconferences* and other techniques. The Foundation will continue to regard\nboth gifts and commercial distribution of western books to Asia and the trans¬\nlation of western books into Asian languages as useful techniques to be employed\nwhere they contribute to the Foundation's general program.\n•3/15/SU"
}