{
  "id": "d1365-0",
  "text": "N-A-E-B NEWS-LETTER\n^ NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nEdited by Harold A. Engel, President\nStation WHA, University of Wisconsin, Madison, Wisconsin\nSeptember 5? 194-7\nDURR SUPPORT REPORTED ^ .\nPress report~T^riety 7/30/4?) has it that educational broadcasters and radio-\nminded liberal groups\" are engaged in a campaign to assure Commissioner Clifford J.\nDurr a seat on the three-man Broadcast Division of the FCC. Chairman Cnarles R®\nDenny is receiving many messages from interested broadcasters an.d members of Congress#\nIt is not beyond the realm of possibility that pressure wiU be brought from\ncertain interests to try to have Commissioner Durr-who has dissented in the public\ninterest in many cases-relegated to a spot where he cannot deter broadcasters from\noperating purely in their own interests. ...\nEducational broadcasters who have not yet taken a hand to see that their interests\nare protected are remiss in their duty. It is not yet too late I\nI\nREGION V TO HOLD COHERENCE\nJohn W. Dunnj director for NAEB's Region V, reports that a conference will be\nheld in Norman, Oklahoma on September 27 and 28 to which members and prospective\nmembers will be invited to attend. , vt-x\nDetails of the program have not yet been released, but knov/ing Dunn s ability as\nan organizer, it is safe to predict that headline attractions will be included.\nRegion V includes the states of Missouri, Kansas, Colorado, New Mexico, Texas,\nOklahoma, Arkansas and Louisiana. If you know of potential educational broadcasters\nin these states who should receive special invitations, ^j/rite to John Dunn at ¥NAD,\nNorman, Oklahoma, so he can issue the invitations to them.\nCONVENTION PLANS REPORTED\nSeveral surprises which cannot now be announced are planned for the NAEB meeting\nat the Continental Hotel in Chicago on October 259 26 and 27. The convention will\nprecede the Chicago School Broadcast Conference and is expected to draw a large\nattendance.\nIn general the sessions vjill be as follov/s3\nSaturday. October 25\n8200 PM Informal evening meeting\nlOsOO A.M\nllsOO\n2s00 PM\n4s30\n6s30\nSunday. October 26\nFacilities, Budgets and Standards\nNAEB Services\nThe Outlook for Educational Radio(panel cf expats;\nBusiness Meeting and Elections\nBanquet\nMonday. October 27\n9s00 AM Governmental Services to Broa.dcasters\nMembers are urged to attend this convention and to bring v;ith them staff members\nwho need the experience the sessions will give. Prospective members should be in-\nvited to attend the meeting also.\nMake your plans? Chicago, October 25? 26, 27.\nVice-President Treasurer Executive Secretary\nRobert J. Coleman W. I. Griffith M. S. Novik\nWKAR WOI 30 Rockefeller Plaza\nEast Lansing. Mich. Ames. Iowa New York. N. Y.\nExecutive Committee\nWaldo Abbot. Michigan Milford C. Jensen. WCAL, St. Olaf\nJohn W. Dunn. WNAD. Oklahoma James S. Miles. WBAA. Purdue\nRichard B. HuU. WOI. Iowa State Russell Potter. Columbia"
}