{
  "id": "d1378-2",
  "text": "(Convention Supplement\nNAEB to Meet in\nWashington,\nD.C., October\n31-November 3, 1965\nHumphrey Can't Come\nVice President Hubert Humphrey has notified NAEB\nheadquarters that he will be unable to speak at the convention\nbanquet because of a recently scheduled trip to job corps\ncamps on the West Coast at that time. Confirmation of his\nreplacement has not yet been received.\nState Department Announces\nCommunications Briefing\nThe U. S. State Department will have a foreign policy\nbriefing October 28 and 29, to which over 200 NAEB radio\nand TV station managers have been invited. This is one of\nthe Department’s semiannual communications media briefings,\nand it was especially arranged to fall just before the NAEB\nconvention. Leading State Department officials, including the\nSecretary of State, will participate in the sessions, and plans\nare being made for a White House reception by the President\nfor al'l who attend.\nSpecial Interest Sessions\nIn order to meet increasing requests for additional spe¬\ncialized sessions at the convention, the convention staff, with\nhelp from the division staffs, has organized eighteen such\nmeetings for this convention, more than ever before. In all\ncases, the staff has tried to schedule sessions of related con¬\ntent at different times so that a member can participate in all\nmeetings concerned with his special field.\nMeetings planned for this year are:\n1. Career Planning and Employment in Educational Broad¬\ncasting.\n2. New Equipment in Educational Broadcasting.\n3. ETV Facilities Act Counseling.\n4. Report on the National Conference on Educational Radio.\n5. Building a Local ETV Program Schedule.\n6. Research.\n7. Current Problems in Radio Programing.\n8. Utilization.\n9. Educational Broadcasting and the FCC.\n10. Children’s Television Programs.\n11. Public Relations & Promotion.\n12. Interconnection & Networking.\n13. New Federal Legislation & Educational Broadcasting.\n14. Cooperative Production at the Great Plains Instructional\nTelevision Library.\n15. Professionalism in ETV Production.\n16. Copyright.\n17. A Survey of International Broadcasting Activities.\n18. Educational Broadcasting & the NDEA.\nNAEB To Honor Past Presidents\nThe men who have served as NAEB president will be in¬\nvited to a luncheon at the Washington Broadcasters Club on\nWednesday, November 3. On the roster are: Graydon Aus-\nmus, Harold Engel, William G. Harley, Richard B. Hull,\nH. B. McCarty, Carl H. Menzer, Burton Paulu, Frank E.\nSchooley, Seymour Siegel, and Harry J. Skornia.\nNAEB Staff Prepares\nFor Largest NAEB Convention\nNAEB Headquarters announces that it expects over 1,000\ndelegates to attend the 1965 convention—the largest attendance\nin the history of the association. Nearly 400 representatives of\nArmed Forces TV installations will also be on hand for the\nArmed Forces Television Conference which will be held in con¬\njunction with the NAEB Convention. NAEBers and military\npersonnel are invited to attend both conferences.\nExhibit space for the 1965 convention has been filled since\nlate spring. The 78-booth display represents an increase of 18\nbooths over the Austin Convention show.\nPublicity and promotional activities for the convention\nhave been stepped up in an effort to reach non-NAEBers in\nfields indirectly related to educational broadcasting. This\nyear, for the first time, the staff prepared a special conven¬\ntion invitation which was sent to over 1,000 university presi¬\ndents, government officials, foundation heads, engineering\nand legal consultants, association directors, international broad¬\ncasters, foreign embassies, research services, and equipment\nmanufacturers.\nAirlines\nWashington, D.C., is serviced by three airports and is\neasily accessible by air at any time of the day or night. Wash¬\nington National Airport, which has no jet traffic, is only\nabout 15 minutes from the city and is most convenient to the\nhotel.\nJets will land at either Friendship Airport, which is near\nBaltimore, about 45 minutes from Washington—or Dulles\nAirport, which is one hour away, in Chantilly, Virginia.\nLimousines will take passengers from both airports to the\nWashington air lines terminal at 12th and K Streets for $2.50.\nWeather\nThe average temperature in Washington in early Novem¬\nber is about 50 degrees. Daytime temperatures will climb to 58\ndegrees, and the minimum at night should be about 41. Days\nwill be fair, according to the Washington climatologist.\nREGISTRATION HOURS\nBecause some NAEB members will be in Washington for\nthe State Department briefing prior to the convention, the\nregistration desk will be open from noon to 5 p.m. on Sat¬\nurday, October 30. If you plan to be in Washington early,\nyou are urged to register on Saturday afternoon, since you\ncan then avoid waiting in line on Sunday or Monday.\nThe registration desk will be located on the Florentine\nFoyer of the Sheraton Park Hotel. Registration on Sunday\nwill begin at noon and the desk will be open until 8:00 p.m.\nOn other days, the schedule will be as in previous years—\n8:30 a.m. to 5 :00 p.m."
}