{
  "id": "d1706-2",
  "text": "-3-\nwOur reply had been sent in and I recall, a liberal interpretation given to the\nterm ’Educational Eroadcasting.* You are doing a splendid job of keeping us in¬\nformed, and as the Federal Radio Commission ought to say to all of us - ’more power\nto you.’\n\"Many thanks for the copies of the 1EA0 dramatization. The script reads like a\ngood one and I will write you more fully when we have given it a trial. We have\nnothing similar that would be suitable for release to association stations, but\nwe have hopes of developing some worth while written material this semester.”\nFROM MR, J. C. JENSEN, DIRECTOR AND ENGINEER, STATION WCAJ, NEBRASKA WESLEYAN\nUNIVERSITY, LINCOLN, NEBRASKA: ”Your special rush bulletin from Dr. Harding has\nbeen received. Dr. Harding has put the case very pointedly when he states that\nit is the policy of the Federal Radio Commission *to cut off the arms, legs, and\nhead of educational stations, and then allow them to die a natural death,’ They\nhave not yet severed our head, but that stage of the operation may come when the\nappeal of WOW is heard on next Monday. I am sending you under separate cover a\ncopy of our brief in the WOW case. It may be that Dr. Harding, Dr. Culver, and\nsome of the other stations that are having trouble similar to ours at the present\ntime can use some of the arguments contained in it. If so you can pass it on. I\nhave already sent one to Higgy,\n\"The question is, what are we going to do about it? To what extent are we backing\nup Armstrong Perry and others in his group in the fight they are making? Are we\nmaking contacts with our Senators and urging them to support the Fess Bill? If\nwe are not active in this point, why not? It seems to me that we are coasting\nalong until we go over the precipice before we begin to call for help. A determin¬\ned cooperative effort on the part of all members of our Association would probably\ncompel the passage of the Fess Bill and put an end to one phase of our troubles.\nIsn’t it possible, even now, to ’start something’ that will bring results? You\nmay count on me to the limit.\n''Regarding the questionnaire, I wired vou as follows: ’Question fifteen of license\napplications requires statement of time allotted to various kinds of service. In¬\nterpretation suggested in vour bulletin in direct conflict wth affidavit in lic¬\nense applications. Suggest instead explanatory paragraph in questionnaire show¬\ning educational value of civic, agricultural and musical programs.’\n\"With us it works out a little differently than with the State University Station\nwhich broadcasts no church programs. Out of a total of 12 1/4 hours per week on\nthe air, we show 6 hours and 47 minutes of programs that are purely educational,\nwith an additional 1 l/2 hours of musical prpgrams by Nebraska Wesleyan and Neigh¬\nboring colleges, making a total of 8 hours and 25 minutes. This with 2 l/2 hours\nof religious broadcasts leaves very little time for entertainment and civic features*\nI have explained all items rather fully in the questionnaire, and have attempted to\nmake it as effective as possible.”\nNOTE: PLEASE PAY PARTICULAR ATTENTION TO THE SECOND PARAGRAPH OF MR. JENSEN’S\nLETTER QUOTED ABOVE. THIS IS NOT THE ONLY LETTER RECEIVED IN THE PAST FEW WEEKS\nASKING THE SAE QUESTIONS. NOW IS THE TIME TO ACT! ALL OF YOU KNOW OF THE\nDEVELOPMENTS IN WASHINGTON,\nFROM MR. DANIEL E. NOBLE, CONNECTICUT AGRICULTURAL COLLEGE, 3T0RRS, CONNECTICUT:\n\"We were pleased to receive copies of the radio play, ’An Ohio Enoch Arden.’ I\nfeel that an arrangement for the distribution of mimeographed copies of plays is\nan excellent means of providing satisfactory copy for college stations. We plan\nto use the play we have received, and at a later date, we shall write you about\nits reception."
}