{
  "id": "d1099-3",
  "text": "sonnel beginning to emerge from educational uses of\ntelevision, and many other things—including the ap¬\nparent inadequacy of present testing and measure¬\nment procedures to cope with television teaching\nneeds.\nMeanwhile, sincere thanks to the growing number\nof you who write each month to react to the News¬\nletter editorial.\nNETWORK NEWS\n—Bob Underwood\nDuring the summer months the network staff is work¬\ning on, among other things, a catalog describing the\nprogram series we have available for general distri¬\nbution. Almost forty such series are available, and\nthe network has no objection to these grant-in-aid\nseries being broadcast over commercial stations on\na one-time, sustaining basis. Many NAEB members,\neither non-active members or active members not\npartaking of network service, have used these, series\nfor public relations broadcasting over local com¬\nmercial stations. Also, many non-NAEB organiza¬\ntions and individuals have either purchased or bor¬\nrowed these series for broadcast use.\nThe reports received here on use of our programs\nby non-network groups have been pleasing and have\nencouraged us to promote these series further. The\npreparation of a catalog describing these series will\ntake a while, since the tapes must be checked; but\nwe are preparing a briefer temporary descriptive, state¬\nment on these series. This may be had by writing me\nat headquarters.\nFor those who are not familiar with our tape oper¬\nation, all of our programs are recorded full track at\n7% inches per second on 1200 foot reels. Since all\norders not connected with the offering currently being\ndistributed require additional labor for dubbing we\nare forced to make a per reel charge for these pro¬\ngrams. Full details on this charge and other matters\nregarding either rental or purchase of these programs\nmay be had by contacting me. Your request will re¬\nceive prompt attention.\nAlso, we encourage you NAEB members oper¬\nating radio stations to investigate the advantages to\nbe gained from network membership. The nine hours\nper week you can obtain from us will help your staff\ndevote more of its time to the preparation of quality\nlocally produced shows, and will enable your audi¬\nence to hear the finest programs being produced in\neducational studios throughout the country. Please\nwrite me for details about network membership.\nSince we here are planning our vacations we im¬\nagine you are, too. Have a good time!\nPUBLICITY AND PUBLIC RELATIONS\n—William Bender, Jr.\nWUOM, University of Michigan\nA number of NAEB stations also belong to the Na¬\ntional Association of Broadcasters whose head¬\nquarters are in Washington, D. C. Last spring, NAB\nmembers received a “Check-off List For Public Re¬\nlations”.\nAlthough NAB writes largely for its commercial-\nstation members, many of the suggested PR practices\napply to educational stations as well. We received\npermission to quote some excerpts from their Check-\nOff List, so here goes:\n1) Develop a public relations plan. A PR plan\nshould be founded on a bedrock of background infor¬\nmation about an individual station’s strengths and’\nweaknesses. Survey the situation and determine:\na) types of present audience\nb) audience potential\nc) signal coverage\nd) specialized interest of your present and\npotential audience\ne) your programming as it relates to your com¬\nmunity\nf) opportunities for public service.\n2) Your most saleable product from a PR point\nof view is the service you provide your community.\nThis is a telling theme, demonstrable and reflecting\nthe highest ideals of broadcasting.\n3) Establish an institutional personality. It helps\nidentify your station with the public ... as something\nof which they are a part.\n4) Develop an attention-getting special project.\nTry to find one important project for extra effort that\nwill become associated with the community leader¬\nship of your station. Whatever it is, it should fill a\nreal need in your coverage area.\n5) Assign public relations responsibility. Your\nPR plan should give someone clear cut responsibility\nfor public relations. In a small market this probably\nwill be a collatoral duty, but the important thing is\nto designate someone as an anchor man.\n6) Off the air promotion. Utilize your town’s\nWelcome Wagon and similar services to acquaint\nnewcomers with your station.\nThis just skims the top of NAB’s three-page list\nof Do’s and Don’ts. Our favorite quote from the\nBOX\nSCORE\nTotal\nAM\nStations - 3248\n(includes\n39\nnon-commercial)\nTotal\nFM\nStations - 681\n(includes 1\n58\nnon-commercial)\nTotal\nTV\nStations - 587\n(includes\n32\nnon-commercial)\n4\nNEWSLETTER"
}