{
  "id": "d1099-4",
  "text": "report reads: “Remember, in this endeavor enthusi¬\nasm can carry you a long, long way!”\n*****\nEnthusiastic note from Minnesota: KUOM began\nMay 2 a year-long series of programs and promotions\nto mark its 20th anniversary of 40-hour-a-week\nbroadcasting. This has triggered considerable cover¬\nage in news columns, and a number of special features.\nAll of which points to a neglected technique on the\nNAB list: “Celebrate Something.”\nWASHINGTON CONFERENCE\nPROVES SUCCESSFUL\n“The national welfare will be saved by assuring that\neach state has the resources and the technical as¬\nsistance to build and operate a comprehensive edu¬\ncational television network (to serve) elementary\nand secondary schools, collegiate institutes and adult\neducational purposes.”\nThus, Dr. John E. Ivey, vice president of New\nYork University, proposed a national federally aided\nETV network to over 70 participants of the Confer¬\nence on Educational Television and Related Media.\nHeld May 26 - 28 in Washington, D. C., this was\nthe first joint meeting in nearly eight years for the\nNAEB and the U. S. Office of Education. Leaders\nin both education and educational broadcasting ex¬\nchanged views to determine the status and trends in\ntheir individual fields, and to chart a course for the\nfuture which would give a clear relationship of each\nto the other.\nThrough talks and discussions, the conference\nprovided an excellent study ground for both the edu¬\ncators and the educational broadcasters. Most ap¬\nparent in the sessions was the mutual effort, as stated\nby Dr. Ivey in his proposed solution, to . . make\npossible the greatest exposure of the nation’s top in¬\ntellectual manpower to all fields of education.”\nIn his welcoming message, Marion B. Folsom, Sec¬\nretary of Health, Education and Welfare, pointed to\nthe broad possibilities for future classrooms opened\nup by educational TV. He said, “It is an exciting\nprospect that through television an inspired teacher\nmay reach unlimited numbers of students, and with\nteaching materials at her fingertips that heretofore\ncould not be given general classroom use. We know\nthat there is no substitute for the devotion and cap¬\nabilities of a good teacher,—but television may bring\ngreater opportunities for the good teacher to reach\nmore children.”\nDiscussing the problems of higher education and\nteacher preparation Ohio State University President\nNovice G. Fawcett concluded that “thoughtful,\ncreative application must be the goal, if the mind is\nto be stretched more nearly to its potential. Too\nmuch teaching is merely word-deep; it has not been\na real encounter. Television can go in one eye and out\nthe other unless the content and the techniques em¬\nployed really engage, involve the learner.\nHe added, “Successful education demands that\nthere must be a certain freshness in the ideas dealt\nwith. These ideas must be new or they must be in¬\nvested with some novelty of application to present\nconditions.”\nDr. Fawcett suggested the home and community\n“can increasingly re-enforce the work of the school\nand, with the use of the television medium, might ap¬\npropriately begin to capture some of the responsibili¬\nties that the schools have been forced to assume in\nthe past.”\nIn preparing programs with a fresh approach,\nhowever, it is generally agreed that a great depend¬\nence is placed on the ETV teacher. An Evanston (Ill.)\nTownship High School teacher, Miss Wanda B.\nMitchell, summed up the problems involved in re¬\ncruiting these teachers, labeling them confusion, fear,\nand lack of time. Although many persons think of\nthese problems as groundless, Miss Mitchell said that\nteachers frequently look upon ETV with the in¬\ndecision of Hamlet:\n“TV or not TV; that is the question\nWhether ’tis nobler in the mind to suffer\nThe pressures of increasing enrollments\nOr to take arms against a sea of troubles\nAnd by electronics end them.\nTo grunt and sweat under a weary life\nAnd make us rather bear those ills we have\nThan fly to others that we know not of?”\nAiring another point of view, Dr. William G. Carr,\nexecutive secretary of the National Education Assn.,\nadvised educational broadcasters to disregard the\nuse of television as an answer to the teacher short¬\nage, and to concentrate their attention on the ques¬\ntion of the use of television as an instrument to aid\ngood teachers. He stressed the idea that “quality is\ngoing to be the watchword of American education as\nour horizons expand.”\nIn his talk, Marshall McLuhan, editor of Explora¬\ntions, Toronto, Ont., gave mass communications a\nfurther impressive role in meeting today’s problems.\nHe said that the largest modern activity is “the con¬\nsuming of information electronically processed.”\nHowever, he warned, “Today our natural temp¬\ntation is to regard the new media as aids or distrac¬\ntions to the older studies. We have not dared to see\nthem as themselves, new art forms which can become\ndirect objects of study. For us to do this with press,\nradio, and TV would be fatal to our earlier achieve¬\nment in writing and print, because it leaves the\nJULY, 1958\n5"
}