{
  "id": "d1775-0",
  "text": "■\nA E B\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. XXIII NO. 10 URBANA, ILLINOIS OCTOBER, 1958\nNAEB OFFERS GRANTS-IN-AID FOR\nEDUCATIONAL BROADCASTING RESEARCH\nThe NAEB is offering grants-in-aid in amounts\nup to $500 for educational broadcasting research in\n1959. Through the impetus which may be provided\nby some financial assistance, the NAEB hopes to\nfoster creative research of unusual quality and gen¬\neral significance to educational broadcasting. These\nfunds are designed to cover part of the expenses of\nresearch projects.\nAny department of an accredited institution of\nhigher education may apply for a grant. While funds\nmay be applied to a project carried on by an individ¬\nual, the grant itself must be to the institution. The\ndepartment of the institution sponsoring the project\nmust accept responsibility for providing throughout\nthe project expert supervision of research, adminis¬\ntering the project, and completing it.\nApplications must be submitted to:\nSamuel L. Becker, Chairman\nNAEB Research Committee\nc/o National Association of Educational Broad¬\ncasters\n14 Gregory Hall\nUrbana, Illinois\nand must be postmarked not later than December\n31, 1958. Grants will be announced on or about\nFebruary 15, 1959.\nApplications must be submitted in five copies and\nshould consist of two main sections, as follows:\nSection I (limited to three or four pages) should state\nas a whole the following:\n1. The substantial benefits to education and\nbroadcasting (radio and/or TV) that reason¬\nably may be expected to result from this study.\n2. The hypothesis or hypotheses of the study.\n3. The relationships of the proposed study to pre¬\nvious research.\n4. Procedures of the study, including measures to\nbe employed and methods of analyzing data.\nSection II should indicate the following:\n1. The expected date by which the following will\nbe submitted to the NAEB:\na) Two copies of the full report of the study,\nb) Nine copies of a 600-word abstract of the\nfull report, arid\nc) Two copies of a financial report, together\nwith unexpended NAEB funds.\n2. A statement of the names and titles of those\nwho will serve as active consultants for the\nproject, will supervise the research, and will\nexecute the details of the study.\n3. A budget of all items that will be provided for\nthe research, indicating:\na) What amount is being requested from the\nNAEB,\nb) What amount will be provided by the ap¬\nplicant,\nc) What will be provided by sources other than\nthe applicant and the NAEB.\nAmounts of $500.00 or less may be provided by\nthe NAEB.\n4. A statement that no grant funds will be ex¬\npended for:\na) Administration of the grant,\nb) Space and ordinary facilities of the institu¬\ntion, or\nc) Purchase of capital equipment.\n5. The understanding that the NAEB has first\nright to publish a report of the study if it so\ndesires. All other publications rights will be\nretained by the grantee, provided that such\npublications bear acknowledgement of the\ngrant.\n6. The approval and acceptance of the grant by\nthe institution.\n7. The approval and acceptance of administrative\nresponsibility for the study by the head of the\ndepartment in which the work is to be done.\nSee You In Omaha\nl"
}