{
  "id": "d1775-2",
  "text": "Commissioner under subsection (c) of this section, receive com¬\npensation at rates fixed by the Secretary, not to exceed $50 per\nday, and shall also be entitled to receive an allowance for actual\nand necessary travel and subsistence expenses while so serving\naway from their places of residence.\nSPECIAL PERSONNEL\nSec. 762. The Commissioner may secure from time to time\nand for such periods as he deems advisable, without regard to\nthe civil-service laws, the assistance and advice of persons in the\nUnited States and from abroad who are experts in the utilization\nand adaptation of television, radio, motion pictures, and other\nrelated media of communication for educational purposes.\nAPPROPRIATIONS AUTHORIZED\nSec. 763. There are hereby authorized to be appropriated\nthe sum of $3,000,000 for the fiscal year ending June 30, 1959,\nand the sum of $5,000,000 for each of the three succeeding fiscal\nyears for carrying out the provisions of this title.\nPURDUE CONFERENCE PREDICTS\nOPTIMISTIC FUTURE FOR ETV\nPurdue University, Lafayette, Indiana, was the\nscene of the NAEB Conference on Televised Instruc¬\ntion August 24 to September 9. The general feeling\nof the group was that TV as an instructional medium\nis not the panacea for the ills of education but that\nit can be a potent factor in the total education pro¬\ngram.\nThe conference was sponsored by the NAEB in\ncooperation with the Purdue Television Unit. James\nS. Miles, director of Purdue’s radio station, WBAA,\nand TV unit and former executive director of NAEB,\nwas chairman of the group which met in three ses¬\nsions each day.\nTwenty of the conference registrants were repre¬\nsentatives of colleges and universities from all sec¬\ntions of the United States. Practically all of them\nhad the benefit of some experience in the televised\ninstruction field. Two of the registrants were from\nthe field of commercial television. Joining with them\nas leaders and advisors were ten persons from in¬\nstitutions in which experimental and research work\nwith TV as an instructional medium, either on open\neducational channels or closed circuit systems, has\nbeen under way for several years. They gave the\nconference registrants the benefit of their experience\nand freely discussed their findings in this field.\nAfter much deliberation and thorough reviews\nof their experiences with and experiments on tele¬\nvised instruction, they summarized their findings by\nlisting seven things TV can do in the total education\npicture. They are as follows:\n1. TV can improve the quality of instruction.\n2. TV can be used to multiply the effectiveness of\na good teacher.\n3. TV can be used to extend the boundaries of\nthe campus for programs of continuing education.\n4. TV can be used effectively for teacher training.\n5. TV can be used to bring the same or comparable\ninstruction to more students at less cost.\n6. TV can expand the efficiency of the use of\nclassroom and laboratory facilities.\n7. TV, or televised instruction, can result in\nacademic prestige for faculty members comparable\nto that resulting from published research.\nThese potential contributions of TV can be\nutilized as powerful agencies in meeting the problems\nin the years ahead if a sufficient number of ade¬\nquately-trained teachers is not available to meet the\ndemands of increased student enrollments. In the\nface of the current shortage, this problem looms as\none of increasing proportions in the coming years.\nEspecially on closed-circuit TV, one teacher can\nreach more students than when his instruction is\nlimited to one classroom or laboratory.\nHowever, it was the opinion of the group that\nthere are subject areas which do not lend themselves\nwell to televised instruction and that the value of\npersonal contact and the teacher-student relationship\ncannot be minimized. But as Dr. Clifford G. Erick¬\nson, associate dean in charge of TV at the Chicago\nCity Junior College voiced it, this does not mean\nthat TV instruction used as an aid and training\nmedium does not have possibilities that as yet have\nscarcely been touched. “Its growth in the years\nahead may surprise all of us,” he stated.\nPLACEMENT SUPPLEMENT\nOctober I - Program producer and director, with M.A., mil¬\nitary and civilian radio experience as well as industrial\nrelations and management background, desires a posi¬\ntion in ETV or educational radio. Married man, 35, will¬\ning to locate in U. S. or abroad. $6,500-7,500.\nOctober 2 - Producer-Director with 7 years of top network\nproduction experience wants an opportunity for greater\nresponsibility in ETV as manager, production manager or\nprogram manager. Presently employed with one of the\nlargest ETV stations in the country. Married man, 33,\nB.F.A. Will consider any location; prefer Northeast or\nFar West. $8-12,000.\nOctober 3 - College graduate, 2-year professional radio, TV\nand theatre school, experienced in most phases of ed¬\nucational and commercial broadcasting. Would prefer\nposition in programming and production or news and\npublic affairs. Single man, 23, B.S. Prefer Eastern U. S.,\nbut will consider any location. $320/month minimum1.\nOctober 4 - Married man, 36, desires position requiring intelli¬\ngence and responsibility as program director or produc¬\ntion director. 15 years experience in radio broadcasting.\nB.A. Prefers East in University surroundings. $8,000.\nOctober 5 - Single man, 33, with knowledge of radio-TV de¬\nsires affiliation with educational radio-TV organization, in\nproducing or directing. Midwestern U. S. if possible.\nMinimum $350/month.\nOctober 6 - Married man, 40, radio-TV production specialist\nwith widely varied experience seeks permanent position\nin educational TV. Desires position in direction, writing,\nor producing. Western seacoast or mountains preferred.\n$5,000-6,000.\nOctober 7 - Producer-director in ETV at one of the large pro¬\nduction centers with administrative experience wishes\nto find a position in administrative production and/or\nprogramming. Married man, 24, A.B. Will locate any¬\nwhere. $6,500-7,500.\nOctober 8 - Experienced radio announcer seeks position in ed¬\nucational broadcasting. Single male, 22, will locate any¬\nwhere. B.A. Teacher. $3,800-4,000.\nOCTOBER, 1958\nSee You In Omaha\n3"
}