{
  "id": "d1775-6",
  "text": "classification why don’t you submit them to the net¬\nwork? You have nothing to lose, and you may get\nyour series accepted for national distribution.\n—N A E B—\nWASHINGTON MEETING REPORTED\nIN AV MAGAZINE\nThe September, 1958, issue of the AUDIOVISUAL\nINSTRUCTION carried an excellent article by Miss\nAlice Finstad, entitled “Soul Searching on the Poto¬\nmac.” The subject of her report was the Joint\nNAEB-U. S. Office of Education Conference on Ed¬\nucational Television and Related Media, held May\n26-28 at the Department of Health, Education, and\nWelfare in Washington, D. C.\nIn Miss Finstad’s opinion the discussion divided\nitself into three schools of thought: first, the “AV\nboys,” who insisted that TV was only one in the\nwhole “array of audio-visual tools,” and kept lead¬\ning the discussions back to the role of learning, re¬\nsearch and evaluation; second, the broadcasters,\nwho pleaded for recognition of broadcast TV as a\ntool for adult education with importance akin to that\nof closed-circuit TV which tends to align itself with\nclassroom instruction and which seemingly absorbs\nthe attention of educators at most of these meetings;\nand third, Alexander J. Stoddard of the Fund for the\nAdvancement of Education, who believes that ETV\nis not a tool but a revolution and that educators\nwill be missing the boat if they mistake its nature.\nA comprehensive report of the conference will be\nreleased by the Office of Education this fall.\n—N A E B—\nETRC ELECTS NEW OFFICERS:\nJOHN F. WHITE, PRESIDENT\nEducator-broadcaster John F. White of Pittsburgh\nhas been elected president of the ETRC, national\nprogram headquarters for the nation’s ETV stations,\nChairman Ralph Lowell of the Board of Directors\nannounced. White succeeds H. K. Newburn, who\nresigned earlier this year.\nThe new president, who will asume the position\non October 1, has served since 1955 as general man¬\nager of Pittsburgh’s pioneering ETV station WQED.\nHe is a former vice-president of Western Reserve\nUniversity.\nCommenting on the election of Mr. White, Chair¬\nman Lowell said: “The continued development and\ngrowth of ETV nationally requires imagination,\nvision, and a clear understanding of the needs and\nresponsibilities of this growing medium. John White\nhas proved during his years of educational administra¬\ntion and in his energetic management of Pittsburgh’s\nWQED that he possesses these and many other\nqualities. We are indeed fortunate to have found\nsuch a man to serve as president of the Center.”\nKenneth L. Yourd was elevated to the newly\ncreated position of vice-president and treasurer of the\nETRC. Yourd, who has been acting chief executive\nofficer during the interim period, has been secretary-\ntreasurer since 1954, when the National Educational\nTelevision unit was established.\nLowell was re-elected chairman of the Center’s\nBoard. He is president of the Boston Safe Deposit\nand Trust Company and heads the Lowell Institute\nCooperative Broadcasting Council, which operates\nstations WGBH (FM) and WGBH-TV.\nThe directors also elected two vice-chairmen,\nLloyd S. Michael, superintendent of Evanston, Ill.,\nTownship High School, and Raymond H. Wittcoff,\nvice-president of the Carradine Hat Company in St.\nLouis.\n_N A E B—\nSTUDENT DISCUSSION PROPOSED\nFOR INTERNATIONAL TAPE EXCHANGE\nNAEB members who wish to participate in an in¬\nternational exchange program of taped student dis¬\ncussions are invited to contact Dr. Mildred Wilsey,\nan educator who has initiated such a program.\nDr. Wilsey, associate professor of English at Wil¬\nson College in Chambersburg, Pa., is offering to loan\nher tape recordings made when she visited Norway\nto study the reading habits of that country’s youth,\nin hopes that her project may expand in scope and\nbecome a useful method of international student com¬\nmunication.\nUnder a UNESCO grant in 1956, Dr. Wilsey did\nextensive research in the schools of Norway to ex¬\namine and compare their literature with that used\nin the schools of the United States. As a part of her\nwork, she recorded the voices of a group of high school\nstudents who were discussing Henrik Ibsen’s play,\nDoll's House. This project was so successful that Dr.\nWilsey now hopes to develop an exchange of such\ntaped discussions with students of several different\ncountries.\nIn an article published in Top of the News by the\nAmerican Library Assn., Dr. Wilsey says, “Youth,\nwhen given the chance, is always interested in com¬\nmunicating with itself in other lands. A book which\nhas been shared makes an excellent basis for com¬\nmunication.”\nOCTOBER, 1958\nSee You In Omaha\n7"
}