{
  "id": "d1775-7",
  "text": "Using her Norwegian recording as a beginning,\nshe reports, “So spirited and articulate is the (Nor¬\nwegian) repartee that it is possible to enjoy the sound\nalone without following the sense. We shall be for¬\ntunate if we, on this side, can put on as charming\na performance.”\nDr. Wilsey offers to loan her tape recording or its\ntranslation to any interested literature departments,\nrecording services, or broadcasting services, in hopes\nthat her project may expand in scope and become a\nuseful method of study.\n—N A E B—\nNEWS OF MEMBERS\nGENERAL\n► The FCC approved the acquisition of off-a-ir\nKTVQ (Ch. 25) by Independent School District\nNo. 89 of Oklahoma City from Republic TV and\nRadio Co. This gives the city a total of two ETV\nstations, as they already have KETA (Ch. 13) op¬\nerated by Oklahoma Educational TV authority.\ny KTCA (TV), St. Paul, Minnesota, rewards out¬\nstanding performances by an individual with a cer¬\namic figure, “Katie.” The award project was origin¬\nated by an ETV subcommittee of the citizens com¬\nmittee to stimulate interest in and support of the\nstation, in operation only since fall of 1957. The first\naward was given to Karlis Kaufmanis of Gustavus\nAdolphus College for his series “Descriptive Geo¬\nmetry.”\ny The FCC granted the first ETV translator sta¬\ntion to the Board of Education for Municipal\nSchools, Truth or Consequences, New Mexico. The\nstation will rebroadcast programs of educational\nstation KNME-TV, Albuquerque.\n^ The Chicago Board of Education, at its meeting\nSeptember 10, voted to purchase 226 additional AM-\nFM radio receivers for classroom use—a gratifying\n“boost” for FM in-school listening. Another addition\nto the educational equipment of the Chicago Public\nSchools will be 330 television receivers.\nAdvance listings of the WBEZ (Chicago) aug¬\nmented program schedule, along with order blanks\nfor 32 WBEZ Broadcast Handbooks for Teacher Use\nare being distributed to active NAEB members. The\nDivision of Radio and Television will be pleased to\nfurnish any of these broadcast guides upon request.\nAddress: Division of Radio and Television, 228 North\nLaSalle Street, Chicago 1, Illinois.\nGeorge Jennings, Director of Radio-Television of\nthe Chicago Board of Education, has been on sick\nleave since early June. He is improving rapidly and\nhopes to return to the job some time in October.\nPROGRAMS\n^ The Minnesota School of the Air, station KUOM,\nMinneapolis, began its 21st year of broadcasting at\nthe end of September. KUOM’s philosophy is “to\nsupplement and enrich classroom teaching by provid¬\ning some of the materials which would be difficult\nor too time-taking to collect for the individual\nteacher.” They also want their young listeners to\n“experience the joy of independent thinking, to un¬\nderstand the value of human differences, and to\ndream courageously about the future.”\nIn the field of foreign languages, the Minnesota\nSchool of the Air will rebroadcast a 30-program series\nof German for elementary grades and a brand new\n15-program edition of ESPANOL SI SI. Both lan¬\nguage series are designed to arouse interest in foreign\nlanguages and the customs and countries of the people\nwho speak them.\n^ An educational TV project that went on the air\nin New York includes adult as well as classroom fare.\nThe programs, however, are aimed primarily at class¬\nrooms in the metropolitan area of New York City.\nDirected to adults are “French Through Television,”\nand an hour-long program which will cover the Rus¬\nsian language, modern drama and Latin-American\nand international affairs. Faculty members from\nNew York area colleges and universities are giving\nthe lectures.\n► YOU, the first program series in a new radio-TV\nconcept, is a joint experimental effort in educational\nbroadcasting conducted by KSLH and KETC (TV),\nSt. Louis, Missouri. YOU is a study of the human\nbody designed for use in 6th grade elementary science\nclasses. Two separate programs are presented every\nweek, one radio, the other TV. Radio directs the\nclassroom experiments; TV presents a visual follow¬\nup of the material offered in the experiments and fur¬\nther supplements the subject matter of the series.\n^ The first color telecast on ETV anywhere began\nSeptember 14 on KTCA-TV, St. Paul, Minnesota.\nThree and one-half hours of special color features\nwere programmed. This telecast was produced as a\nspecial celebration of the completion of KTCA-TV’s\nfirst year of operation.\nJohn C. Schwarzwalder, General Manager of\nMinnesota’s first educational station, stated “Color\nTV is an ideal medium for teaching, especially in the\narea of science, and we are looking forward to the day\nthat ETV can bring live color into the homes and\nclassrooms of the Twin City Area.”\n^ WGN-TV, Chicago, a commercial station, has\nstarted a project to improve the reading instruction\nin the Chicago schools. The instructors for the TV\ncourse are experienced Chicago classroom teachers.\nThe content of the course will be taken from materials\nSee You In Omaha\nNEWSLETTER"
}