{
  "id": "d80-100",
  "text": "January 24, 1966\nM^r\nMr. James J. Howell\nAllied Sound Company, Inc.\n206~12th Avenue, South\nNahhville, Tennessee\nDear Mr. Howell\nWe have received a letter from Miss Patsy Duncan of Allied\nSound, requesting information about membership in the NAEB.\nShe requested that this information be sent to your attention.\nBusiness concerns may affiliate with the NAEB in either one of\ntwo categories. Those engaged in the manufacture and/or sale\nof broadcast or auxiliary equipment may become Industrial\nAssociates, while other business firms, without such specific\ninvolvement in broadcast equipment, may become Sustaining Asso¬\nciates. We were unable to tell, from Miss Duncan*s letter,\nwhich category would be applicable to Allied Sound.\nThe National Association <5f Educational Broadcasters is the\nonly professional and trade association serving the field of\neducational broadcasting. Our members represent more than\nfour hundred educational radio and television stations, produc¬\ntion centers and closed-circuit installations; more than 2000\nindividual members who are engaged in or seeking to promote\neducational, bultural, and public service broadcasting; and over\none hundred schools, universities, associations, commercial\nstations, and industrial firms which are a part of the expansion\nand development of education via the broadcast media. I am enclosing\na booklet which will tell you more about the aims and activities\nof the Association. Also enclosed are copies of some of our publi¬\ncations.\nAs a Sustaining Associate, your company would be joining such\nfirms as National Community Television Association, RTA Inter¬\nnational, Crowel1-Collier Publications, and the National Broad¬\ncasting Company.\nOur Sutaining Associates, as a contribution to the national\neducational broadcasting movement, pay dues of $200 annually.\nIndustrial Associates pay $500 annually. Sustaining and Industrial\nAssociates also receive certain tangible benefits in return for\nthose dues.\nA brief summary of these benefits would include: multiple copies\nof our publications as well as the various reports we publish"
}