{
  "id": "d80-113",
  "text": "August 3, 1965\nMr. Henry Shapiro\nExecutive Vice President\nElectronics, Missiles and Communications, Inc.\n160 East Third Street\nMt. Vernon, New York\nDear Mr. Shapiro:\nWe are very pleased to hear, from Mr. Frank Masters of Trade\nAssociates, Inc., that your company is interested in affiliation\nwith the NAEB.\nIt would be an honor to welcome Electronics, Missiles and Commu¬\nnications, Inc. into membership in the NAEB as an Industrial\nAssociate. Your company would be joining such firms as AT&T,\nRCA, GE and Sarkes Tarzian, Inc., in showing an interest in educa¬\ntional broadcasting and a willingness to assist in m small way in\nthe work of educational broadcasting4s national organization. Our\nIndustrial Associates, as a contribution to the national educational\ntelevision and radio movement, pay dues of $500 annually. They\nalso receive certain tangible benefits in return for these dues.\nA brief summary of these benefits would include the 25% discount\nwe give oun Industrial Associates on exhibit space reserved at the\nNAEB annual convention. Industrial Associates also have priority\nin the reserving of exhibit space. They receive multiple copies of\nour periodicals, as well as the various reports we publish from\ntime to time, receive special rates for advertising in some of\nour publications, are listed in a special listing two or three times\na year in our Journal, and are listed in our Directory of Members.\nThis is but a bare outline. In addition, although we do not attempt\nto persuade our members to buy from our Industrial Associates in\npreference to other concerns, it is only reasonable to presume that\neducational broadcasters, often struggling on minimum budgets, would\nprefer to give thdir business to those commercial concerns which\nhave evinced a sincere interest in the welfare and furtherance of\neducational broadcasting. Industrial Associates are also invited\nto attend our regional meetings and annual conventions, as well\nas our seminars and workshops, where they can meet with NAEB\nmembers of a very informal basis.\nI hope that it will be our privilege to welcome Electronics, Missiles,\nand Communications, Inc. to our Association as an Industrial\nAssociate. There is no membership application to complete for this"
}