{
  "id": "d80-117",
  "text": "August 26, 1966\nMr* ward Deutsehman\nHarvey Radio Company\n60 Crossways Park West\nWoodbuay, Long Island,\nSew York 11797\nLear Mr* Deutschman:\nAs an extension to our telephone conversation this afternoon,\nenclosed is a booklet which briefly describes the alas, activities\nand purposes of the MSB. Also enclosed are copies of sane of our\npublications together with a list of publications which are avail¬\nable.\nBriefly, the national Association of Educational Broadcasters is the\nonly professional and trade association serving the field of educational\nbroadcasting. Our Members represent more than four hundred noacownerclal\nradio and television stations, production centers, and closed-circuit\neducational broadcasting installations, and more than 2,000 Individual\nmembers who are seeking to promote educational, cultural, and public\nservice broadcasting. Also included in the membership are approximately\nam hundred schools and universities, associations, eoraaercial stations,\nand industrial firm which are a part of the expansion and development\nof education via the broadcasting media.\nIt would be an honor to welctzae Harvey Radio into membership in the MEB\nas an Industrial Associate. Your company would be Joining such films as\nASM!, RCA, GE and 3M in showing an interest in educational broadcasting\nand a willingness to assist in a small way in the work of educational\nbroadcasting's national organization. Our Industrial Associates, as a\ncontribution to the national educational television and radio movement,\npay dues of $500 annually. They also receive certain tangible benefits\nin return for these dues.\nA summary of these benefits would Include the 25$ discount we give our\nIndustrial Associates on exhibit space reserved at the HAEB annual\nconvention. Industrial Associates receive multiple copies of our\nperiodicals, as well as the various reports we publish from time to\ntime, receive special rates for advertising in saae of our publications,\nare listed in a special listing two or three times a year in our Journal.\nand are listed in our Directory of Members."
}