{
  "id": "d80-121",
  "text": "September 1, 1966\nMr. Leonard Gumly\nIrrfoimation Display Specialist\nHoffmann-La Roche Inc.\nNutley W, Hew Jersey\nDear Mr. Gumljry;\nlhank you for your Interest in the national Association of Educational\nBroadcasters as expressed in your letter of May 20, 1966. Enclosed is\na booklet which briefly describes the aims, activities and purposes of\nthe IIAEB. Ho doubt you have already received this in connection with\nyour recent application to Join the NAEB as an Individual Member. Also\nenclosed are copies of same of our publications together with a list of\npublications which are available.\nBriefly, the national Association of Educational Broadcasters is the\nonly professional and trade association serving the field of educational\nbroadcasting. Our members represent more than four hundred nonccoBifircial\nradio and television stations, production centers, and closed-circuit\neducational broadcasting installations, and more than 2,000 individual\nmembers who are seeking to promote educational, cultural, and public\nservice broadcasting. Also included in the membership are appraximately\none hundred schools and universities, associations, cccmfircial stations,\nand industrial finas which are a part of the expansion and development\nof education via the broadcasting media.\nIt would be an honor to welcome Hoffmann-la Roche into membership in the\nmSB as an Industrial Associate, four company would be joining such firms\nas ASM!, RCA, GE and 3M in showing an interest in educational broadcasting\nand a willingness to assist in a small way in the work of educational\nbroadcasting’s national organization. Our Industrial Associates, as a\ncontribution to the national educational television and radio movement,\npay dues of $500 annually. 2hey also receive certain tangible benefits\nin return for these dues.\nA sisaaary of these benefits would include the 25# discount we give our\nIndustrial Associates cm exhibit space reserved at the HAEB annual\nconvention. Industrial Associates receive multiple copies of our\nperiodicals, as well as the various reports we publish from time to time,\nreceive special rates for advertising in some of our publications, are\nlisted in a special listing two or three times a year in our Journal,\nand are listed in our Mredfcory of Members."
}