{
  "id": "d80-2",
  "text": "December l4, 1961\nMr. Don M. Muller, Manager\nProduct & Market Planning\nBfl/UB, ltd.\n1750 Vine Street\nLos Angeles 28, California\nDear Mr. Miller:\nYour letter of November 28, addressed to our Urbans, Illinois office, has been\nforwarded to me in ffeshington. I am delighted that mi/US is interested in\nbecoming an Industrial Associate of the HAEB. lie certainly enjoyed our rather\nbrief acquaintance during our recent Convention and hope that you found the\nexhibit beneficial.\nOur annual Industrial Associate dues are $500. flfelle I will not go into great\ndetail at this time, I would like to mention some of the practical advantages\nof Industrial Associate membership in the NAEB. Each Industrial Associate\nreceives credit toward the cost of exhibit space at our conventions, receives\nmultiple copies of our periodicals as well as the various reports we publish\nfrom time to time, receives special rates for advertising in ©cane of our publi¬\ncations, is listed in a special listing two or three times a year in our Journal,\nis listed in our Directory of Members, etc. This is a bare outline. In addition,\nalthough we do not attempt to persuade our members to patronize our Industrial\nAssociates, it is only reasonable to presume that educational broadcasters, often\nstruggling on minimum budgets, would prefer to give their business to those caasaer-\ncial concerns which have evinced a sincere interest in the welfare and furtherance\nof educational broadcasting.\nIn addition. Industrial Associates are considered \"members of the family\" at our\nRegional Meetings and Annual Conventions and thus are able to chat more intimately\nwith our members. Also, representatives of our Industrial Associates are involved\nin (asked to attend), most of our seminar: and workshops which are held specifically\nfor our members, and thus can meet with the members on a very informal basis.\nI would be happy to provide you with any more detailed information you might desire,\neither about the HAEB or about the advantages of Industrial Associate membership.\nI am enclosing a brochure which explains briefly scone of the functions of the HAEB.\nPlease let me know if there are any questions.\nSincerely,\nHarold R. Hill\nAdministrative Vice President\nHEH/mlm"
}