{
  "id": "d80-7",
  "text": "I^bruaay 22, 2$62\nMr. Jo© S. Sheppard\nSales Engineer\ntetort Electric Company, Ine.\n3&1 1* Baces\nFerry Bead, H.B.\nAtlanta 5, Georgia\ntear Mr. Sheppard:\nMr. Baymond Eurlbert of the Alabama ETV Cacm&Bsicm has notified us of the\npossi'blity of Xeukurt Electric Company, lac. becoming an Industrial Associate\nof the MEB. Be are wsfry pleased that your <x*apony bright he interested la\nassociating with the HAEB, and I am enclosing a brochure which briefly out¬\nlines the aims and activities of this Association.\nmie I will not go into great detail at this time, although 1 will be happy\nto supply this if you so desire, 1 would like to mention seme of the prac¬\ntical advantages of Industrial Associate membership in the MSB. Tbe Indus¬\ntrial Associate sam&ership fee is #500 annually, mefe Industrial Associate\nreceives a W§$ discount on exhibit space at our annual convention, receives\nmultiple copies of our periodicals as wen as the various reports that we\npublish fro® time to time, receives special rate© for advertising in some of\nour publications, is listed in a special listing two or three times a year\nln journal, is listed in our Directory of Steabers, etc. Ibis is a bare\noutline. In addition, although we do not attempt to persuade our members to\nbuy from our Industrial Associates in. preference to; other concerns, it is\nonly reasonable to presume that educational broadcasters, often struggling\non minimum budgets, would prefer to give their business to those commercial\nconcerns diich tore evinced a sincere interest in the welfare and furtherance\nof educational broadcasting. In addition. Industrial Associates are con¬\nsidered ’’members of the family* at our Begional Meetings and Conven¬\ntions and thus are able to chat more intimately with our members. Also,\nrepresentatives of our Industrial Associates are invited to attend most of\nour Seminars and Workshops which are held specifically for our members and\nthus can meet with the members <m a veiy Informal basis.\nIf lenkurt Electric Coegaany, me. should decide to Join the Association as\nan Industrial Associate, would you please write a letter so indicating?\nYou can enclose a check for $500 at that time, or you may indicate that you\nwould prefer to be billed for your annual dues and we will handle it in that\nmanner."
}