{
  "id": "d80-77",
  "text": "June 2, 1965\nMr. R. J. Jansen\nApplications Engineer\nBall Brothers Research Corporation\nBoulder Industrial Park\nBoulder, Colorado\nDear Hr. Jansen:\nWe are very glad to hear of your interest in^this^Association. ?\nEnclosed is a booklet whichAdescribes the aims, activities\nand purposes of the NAEB. Also enclosed are copies of some\nof our publications.\nThe National Association of Educational Broadcasters is the\nonly professional and trade association serving the field of\neducational broadcasting. Our members represent more than\nfour hundred noncommercial radio and television stations,\nproduction centers, and closed-circuit educational broadcasting\ninstallations,and more than $900 individual members who are\nseeking to promote educational, cultural, and public service\nbroadcasting. Also included in the membership are approximately\none hundred schools and universities, associations, commercial\nstations, and industrial firms which are a part of the expansion\nand development of education via the broadcasting media.\nIt would be an honor to welcome (Ball Brothers Research Corporation^\ninto membership in the NAEB as an Industrial Associate. Your\ncompany would be joining such firms as AT&T, RCA, GE and 3M in\nshowing an interest in educational broadcasting and a willingness\nto assist in a small way in the work of educational broadcasting's\nnational organization. Our Industtftal Associates, as a contribution\nto the national educational television and radio movement, pay dues\nof $500 annually. They also receive certain tangible benefits\nin return for these dues.\nA brief summary of these bemefits would include the 25% discount\nwe give our Industrial Associates on exhibit space reserved at\nthe NAEB annual convention. Industrial Associates receive\nmultiple copies of our periodicals, as well as the various reports\nwe publish from time to time, receive special rates for advertising\nin some of our publications, are listed in a special listing two\nor three times a year in our Journal, and are listed in our\nDirectory of Members.\nThis is but a bare outline. In addition, although we do not\nattempt to persuade our members to buy from our Industrial Associates"
}