{
  "id": "d993-17",
  "text": "11.\nActing on the authority given the president by the Executive Committee, the\ngroup was advised that the Continuing Committee on the Women's Conference was\nbeing discontinued and that any residual matters would be combined with the activi¬\nties of the Commission on the Education of Women.\nDr. Adams stated that it was planned to print the membership of Council\ncommissions and committees in an early issue of The Educational Record.\n9* New Business. The Committee was advised that arrangements were under way for\nthe nomination of a representative of the American Council on Education on the\nReserve Officers' Training Corps Advisory Panel of the Department of Defense.\nThe Committee was also informed that plans had been worked out whereby\na representative of the Council could participate in the meetings of the Council\nof National Organizations without the Council becoming a member of that group.\nDr. Adams also mentioned that cooperative relationships had been established\nwith the Institute for College and University Administration, sponsored by the\nAssociation of American Colleges.\nAn invitation to the Council to accept the sponsorship of American\nEducation Week, as it relates to the field of Higher Education, was presented to\nthe Committee. A long discussion followed on the appropriateness of the Council\naccepting the invitation and the many problems involved. While no formal action\nwas taken, the Committee requested the President of the Council to give further\nstudy to the matter and procure additional information concerning the obligations\nand possible outcomes before action is taken.\nDr. Adams also presented a request from the Modern Language Association\nthat the Council undertake an activity in its area of interest. After a lengthy\nperiod of discussion, during which many questions were raised, it was suggested\nthat Dr. Adams give further study to the matter to ascertain the feasibility\nof the Council's complying with the request.\n10. Staff.\nIt was recommended that Mrs. Jessie P. Tichenor, who is past the normal\nretirement age, be continued in her employment as stenographer in the office of the\nCommittee on Television through the second quarter ending June 30, 1956. It was\nvoted to approve the recommendation.\nThe desire of Howard R. Boozer, Staff Associate, to have his employment on\na part-time basis so that he could devote more time to the completion of his\ndissertation for the doctorate was explained to the Committee. After discussion\nIT WAS VOTED to approve the recommendation (l) that Mr. Boozer's\nemployment be put on a basis of approximately half time; (2) that, during the\ntime he is absent from the office, he be requested to accept continuing responsi¬\nbility for projects to which he gives staff service; (3) that authorization be given\nfor his continuing participation in the Council's retirement plan with the Teachers\nInsurance and Annuity Association and (4) that his salary be adjusted equitably\nto reflect the new conditions of his employment.\nDr. Adams reviewed the work load currently being carried by the staff,\npointing out that it had increased substantially during the past year and pointing\nout that it was continuing to increase. He also indicated that the new arrangement\nfor Mr. Boozer's employment mentioned above made the situation even more pressing."
}