{
  "id": "d993-2",
  "text": "- 3 -\nTWO NEW PRESIDENTIAL COMMITTEES APPOINTED\nPresident Eisenhower has appointed a national committee for the development of\nscientists and engineers headed by Dr. Howard L. Bevis, president of the Ohio State\nUniversity. Among the committee’s responsibilities are identifying and publicizing\nthe problem of developing a greater number of qualified scientists and engineers. In¬\ncluded in the 19 members of the committee are NEA President John Lester Buford and\nDr. Robert Stollberg of San Francisco State College, president of thq National Science\nTeachers Association (NEA).\nCOMMITTEE ON EDUCATION On April 19, the White House announced the appoint-\nBEYOND THE HIGH SCHOOL ment of a 33-member Committee on Education Beyond\nthe High School. Chairman of the Committee is\nDevereux C. Josephs, chairman of the board, New York Life Insurance Company. Vice-\nchairman is President David D. Henry of the University of Illinois. As was the case\nwith the Committee for the White-House Conference ort Education, only one third of\nthe members of the new presidential committee are professional educators. (See\nSupplement #5 for complete listing of members of the Committee.)\nAt the conclusion of its first meeting on April 27, Chairman Josephs issued a state¬\nment on behalf of the Committee pointing out that it was not going to limit its work to\nthe field of formal higher education but that it wanted to study all aspects of education\nbeyond the secondary school level. Mr. Josephs said that one of the functions of the\nCommittee would be \"to advise the President as to what we consider the proper role of\nthe Federal Government in this field to be and to recommend appropriate Federal\npolicies and relationships.\" He indicated that the Committee wished to encourage\nlocal, regional and state conferences on post-high school education but that it had\nreached no decision on whether it would recommend the holding of a White House Conference\non Higher Education. The next meeting of the Committee will be June 1.\nSTATUS OF OTHER LEGISLATION\nVETERANS On April 23 the House passed by voice vote HR 9824 introduced by\nEDUCATION Representative Teague (D-Tex.) to extend to the orphans of service\nmen in World War II or the Korean conflict who died as a result of the\n66fvi6e connected disability, the educational benefits of the Veterans Readjustment\nAssistance Act of 1952 (Korean G.I. Bill). The bill now goes to the Senate where it\nwill be referred to the Labor and Public Welfare Committee. This Committee also has\nbefore it S 3431, a companion measure introduced by Senator Lister Hill (D-Ala.) and\nsix other senators.\nMeanwhile on April 23, the President's Commission on Veterans Pensions headed\nby General Omar Bradley reported on the success of the educational benefits provided\nfor veterans of World War II and the Korean conflict, but recommended against the\ncontinuation of educational benefits for persons who have entered the Armed Forces since\nJanuary 31, 1955. The Bradley Commission's argument was that by availing himself of\nthe different forms of active military service combined with a reserve obligation, a\nperson entering the Armed Services can avoid the interruption of his training and educa¬\ntion to a degree serious enough to warrant federal compensation for that interruption."
}