{
  "id": "d993-25",
  "text": "7*\nof America; \"The American Historical Association and the Teaching of History »\nSidney Painter, Professor of History, Johns Hopkins University (Chairman, *\nCommittee on Teaching, A.H.A.); '’Teacher Certification Requirements: What They\nAre and How They Are Determined,\" W. Earl Arrastrong, Director, National Council\nfor Accreditation of Teacher Education; \"The ACLS Committee on the Relation of\nLearned Socieities to American Education,\" J0 Fletcher Wellemeyer, Staff Adviser\non Personnel Studies, American Council of Learned Socieities; and \"Interest and\nActivities of the National Research Council in the Improvement of Teaching,\" John\nS. Coleman, Executive Secretary, Division of Physical Sciences, National Academy\nof Sciences, National Research Council,, Dean Francis Keppel, Graduate School of\nEducation, Harvard University, concluded the meeting with an address which challenged\nall groups interested in the education of teachers to develop lines of communication\nand to work together as much as possible in this area of mutual concern. At the\nBusiness Meeting Dean Keppel was elected Chairman of CCTE succeeding President\nWalter E„ Hager, istrict of Columbia Teachers College, who will continue to serve\nas a member of the CCTE Executive Committee,,\nSeventy-seven persons were registered at this meeting, of whom approximately\none-half were delegates of CCTE member organizations„ Others present were guests\nfrom non-member organizations of scholars, scientists, and professional educators.\nDiscussion at the meeting was spirited, and subsequent correspondence from numerous\nsources has attested to its success.\nSeveral of the papers which were presented at the October meeting will be\npublished as a symposium in the March, 1956, issue of the Journal of Teacher Education.\nAs a follow-up, the December issue of the CCTE Newsletter contained specific reports\non the programs and committee activity having to do with teacher education of a\nnumber of associations of scholars and scientists, and of associations of professional\neducators. Many requests for additional copies of this issue havp been received.\nThe^1955 CCTE Annual Meeting was indicative of the continuing interest of\nCCTE in activities which prmote better communication among diverse types of groups\nwith an interest in teacher education. A proposal has been developed (now in\ndraft form), which would make possible a project which would continue these efforts\non a more systematic and thorough-going basis.\nThe next meeting of the CCTE Executive Committee is scheduled for April 6-7.\n1956.\nCommittee on Religion and Education\nAt its meeting on November 23, 1955> two actions were taken, one of which\nwas referred to the Executive Committee of the Council. The first was to complete\na report which will (l) summarize the activities of the Committee since it was\nappointed ten years ago; (2) appraise developments in the relation of religion and\npublic education since its first report was issued in 1947; and (3) indicate, in\nbroad outline, the need for continuing activities in this field. This report will\nbe transmitted to the Executive Committee when it is completed."
}