{
  "id": "d993-27",
  "text": "9\nIII. STUDENT PERSONNEL\nCommission on Student Personnel\nThe Commission met in Ann Arbor, Michigan, December 7-9. Its meeting on\nDecember 7 was held jointly with the Commission on Instruction and Evaluation, as\nnoted elsewhere. In its business sessions on the next two days the Commission\nrevised its projected \"study of undergraduate education” in order to clarify the\nobjective of focusing upon the vaDuen of student participation in the processes of\neducation. The Commission also clarified its plans for making a study of the\nproblems of teachers and counselors in dealing with moral and religious issues which\nmay be brought to them by individual students or which may confront them in campus\nattitudes or group activities.\nDraft of a manuscript dealing with areas of student participation in college\nand university policy-making was reviewed. Following revision it is anticipated\nthat this manuscript will be published by the Council.\nA manuscript designed as a joint statement of the Commission on Instruction\nand Evaluation and Commission on Student Personnel concerning higher education\nobjectives related to the individual student was also reviewed. This statement\nalso will be submitted for publication after further revision and review by the\ntwo commissions.\nThe Commission is making plans for a joint meeting in the fall of 1956\nwith representatives from professional associations in student personnel work, the\nobjectives of which will be to identify and discuss major issues for student\npersonnel work arising from the prospective \"rising tide of Students\".\nPresident Sarah G. Blanding of Vassar College has served as Acting Chairman\nof the Commission following the resignation of President Albert C, Jacobs in August.\nMiss Blanding's term on the Commission expired at the end of 1955. The new presidents\nof the U. S. National Student Association (Stanford L. Glass) and of the Inter¬\ncollegiate Association of Women Students (Miss Patricia Ann Roberts) both attended\nthe Ann Arbor meeting. Presidents of these two associations have been appointed\nas members of the Commission during the past two years.\nCommittee on Japanese Student Personnel Institute\nThis committee met on December 6, 1955* in Ann Arbor, Michigan, at which\ntime it received a report by Dean Wesley P. Lloyd, Dean of Students, Brigham\nYoung University, on the \"Institute for Advanced Training for Student Personnel\nServices\". The Institute, of which Dean Lloyd was the Director, was held at\nTokyo University in the summer of 1955 under the sponsorship of Tokyo University,\nthe Japanese Ministry of Education, and the National Association of Student\nPersonnel Services in Japan, and the American Council on Education in the United\nStates, and was financed by a grant from the Rockefeller Foundation. The draft\nof the written report on the Institute was been circulated to committee members\nfor comment prior to revision by Dean Lloyd."
}