{
  "id": "d993-28",
  "text": "10,\nIV. INTERNATIONAL RELATIONS\nCommission on Education and International Affairs\nThe Commission held a two-day meeting on November 27-28, 1955. Among the\nissues discussed were: the study now being made by Dr. Morrill to recommend\nbetter coordination of the exchange of persons programs being conducted by the\nInternational Cooperation Administration and the International Educational\nExchange Service, both now in the Department of State,* tax regulations affecting\npersons in the exchange program; immigration regulations; the book exchange\nprogram; the future of the Fulbright Program; and pending legislation.\nA proposal is now being drafted for submission to a Foundation to procure\noutside funds to finance the expanding activities of the Commission.\nCanada-United States Committee on Education\nAmerican and Canadian Viewpoints, prepared for this committee by Dennis\nH. Wrong, was published in November 1955 and copies have been distributed to the\nmembers of the Council. The document has been well received especially by\nCanadians. This project was financed by a grant from the Fund for the Advance¬\nment of Education.\nA proposal, which would provide for the development of a testing program\nto be carried out among some 14,000 tenth grade students in selected Canadian and\nAmerican schools, has been submitted for foundation support.\nCommittee on the Leaders Program\nThe Committee has not met since the Executive Committee's last meeting but\nit is planned to convene the Committee in March.\nAs of December 31, 1955* a total of 223 Leaders from 32 countries had been\nprogrammed out of the guaranteed quota of 345 in the July 1, 1955-June 30, 1956,\nbudget. In addition, 29 Leaders had been programmed in the July 1, 1956-June 30,\n1957, budget.\n. The preliminary contract for July 1, 1956, to June 30, 1957, increases the\nadministrative cost per Leader from $324«00 to $350.00, but decreases the number\ncurrently guaranteed to 250."
}