{
  "id": "d993-7",
  "text": "AMERICAN COUNCIL ON EDUCATION\nWashington 6, D. C.\n/\nMinutes of th\nof th\nExecutive C\nJ anuary 2^-25, 195 6\nWashington, D. C.\n1. The Executive Committee of the American Council on Education met in the\nConference Room of the Council building, beginning at 9:30 a.m. on January 2k,\n1956. Present were: Katharine E. McBride, Chairman; Walter E. Hager, Secretary;\nLouis T. Benezet, 0. C. Carmichael, Virgil M. Hancher, Henry T. Heald, Paul C.\nReinert, S.J.; Mark C. Schinnerer, Arthur Sc Adams, ex officio.\nAbsent: Samuel M. Brownell, ex officio.\nPresent as guests: J. Paul Leonard, Chairman of the Council's Pacific Coast\nCommittee; Hugh G. Price, Second-Vice Chairman of the Council; Frederick P. H.\nSiddons, Treasurer of the Council; Francis J. Brown and Helen C. Hurley of the\nCouncil staffc\n2. Minutes. The Minutes of the meeting of the Committee held October 5, 1955>\nwere approved as distributed to the membership.\n3. Review of Council. Developments. Dr. McBride opened the meeting with a short\nstatement on Council conferences which she had attended since assuming the Chairman¬\nship in October.\nDr. Adams, President of the Council, informed the Committee that arrange¬\nments had been made for them to meet during the afternoon with members of the staff\nof the U. S. Office of Education, beginning with luncheon at the Office at 1:00 p.m.\nThe purpose of the conference was to permit the U. S. Commissioner of Education\nand members of his staff to explain the objectives of their present program and\nfuture plans.\nThe attention of the Committee was called to the death on January 18, 1956,\nof Corcoran Thom, the first Treasurer of the Council, who served in that capacity\nfor twenty-nine years. The Committee, after expressing regret, adopted the\nfollowing resolution, with the request that copies be transmitted to Mrs. Thom\nand officials of the American Security and Trust Company, of which Mr. Thom had\nbeen President and Chairman of the Board:\nThe Executive Committee of the American Council on Education expresses\na deep regret at the passing, on January 18, 1956, of Corcoran Thom.\nAlways devoted to the public interest, Mr. Thom made many notable con¬\ntributions to his community and the nation during his long career. It\nwas characteristic of him that he recognized the potential importance\nof the work of the Council at its inception and that he should give\nwise energetic support to Dr. Samuel P. Capen in establishing a firm\nfoundation for Council activities. It was also characteristic that"
}