{
  "id": "d1134-2",
  "text": "network members. After doing some figuring, I\ndiscovered that a full-time network member paying\nthe Class A rate is actually paying $1.70 per hour for\nnetwork shows over a year. Class B members pay\nabout $1.06 an hour, while the Class C stations pay\n$.64 an hour.\nTo those not yet partaking of network service:\nthese figures demonstrate that you simply cannot af¬\nford to pass up network service. If you have finan¬\ncial problems, remember that you don’t pay the full\nfee until your third year of network membership; the\nfirst year you pay one-half, the second year, three-\nfourths, then the full fee. Thus, you can arrange to\nslide the network fee into your budget over a three-\nyear span.\nIt’s not too late for non-network members to order\nservice in time for broadcast beginning in October.\nIf you are interested, please write me; I’ll send you\nan offering and give you all details relative to your\nnetwork membership. This fourth quarter offering,\nby the way, is one of our best.\nPresent network members should bear in mind\nthat now is the time of the year when we really\nneed those tape returns. We have begun duplication\nof the in-school offering which ties up many, many\ntapes over the following weeks; thus, we need tapes\nfrom you in order to keep the regular offering going\non schedule.\nAlso, we could use some submissions, particularly\nin the 15-minute time segment. I am sure that many\nstations are beginning the fall season with new shows.\nIf you have any series—no matter what the time—\nwhich you feel would make good network material,\nplease submit them. If you don’t have submission\nforms, I’ll be pleased to send some to you.\nFULBRI0HT COMMITTEE ANNOUNCES\nCHANGE IN FRENCH PROGRAM\nThe Committee on International Exchange of Per¬\nsons of the Conference Board of Associated Research\nCouncils announces new specifications on the research\nappointment in radio-television offered under the\n1959-1960 Fulbright program in France.\nAs stated in these new specifications, the Director\nof Cultural Activities of the French Radio and TV\nsystem would particularly like a candidate with\nexperience in the field of commercial, rather than\neducational broadcasting. Most desirable is a person\nwith knowledge of the technical problems of large-\nscale broadcasting and of the production of programs,\nserious or otherwise, for popular consumption.\nThis is a change from the former French program,\nwhich designated research in the field of educational\nradio and TV. Educational broadcasters who have\nhad experience in commercial radio and TV would,\nof course, be qualified, and are still urged to apply.\nRCA BECOMES NAEB\nINDUSTRIAL ASSOCIATE\nRadio Corporation of America recently was named\nthe second NAEB Industrial Associate member, par¬\nticipating in the educational broadcasting movement\nin the newly provided membership classification for\nmanufacturing and industrial organizations.\nRCA representative L. L. Lewis, educational ad¬\nministrator, Industrial Electronic Products, was pre¬\nsented with a certificate acknowledging the corpora¬\ntion’s support.\nThe first Industrial Associate was Motorola, Inc.,\nwhich inaugurated the new NAEB membership classi¬\nfication last May.\nPLACEMENT SUPPLEMENT\nSeptember I - Single veteran, 26, with M.S. in communica¬\ntions, offers a background of extensive motion picture and\nradio experience. Seeks a teaching position, college level,\nwith opportunity for active broadcasting and film work.\nSpecialties are in writing, programming and production.\nLocation open. $5-6,000.\nSeptember 2 - Producer-director-writer-art director desires\na creative or administrative position in ETV. Experienced\nin all phases of broadcast and closed-circuit production,\nfrom community programming to direct teaching. Parti¬\ncularly adept at designing visual productions. Will wear\ntwo hats. Single man, 32, B.F.A. Prefers East or Midwest.\n$6,500 minimum.\nSeptember 3 - Dynamic, genuinely creative, assertive mar¬\nried man, 30, with broadcasting M.A., plus practical\njournalistic/public relations background wants to work up\nto administrative position from announcer, continuity man,\nfloor director, producer, news director. Will double as\ninstructor. Northeast, East or West coast preferred.\n$4,680 minimum.\nSeptember 4 - Available immediately: licensed teacher\nwith M.S. in television seeking either a TV teaching position\nor a production-direction job with ETV station. Has 2 years\nexperience directing telecourses; spent the past year partici¬\npating in production of live commercial and educational\nprograms. Married, 24, will relocate. Prefers not to go\nSouth. $5,200 minimum.\nSeptember 5 - Experienced producer-d i r e c t o r desires\nposition with a university-operated ETV station. For the\npast 4 years, has worked with an educational station, but\nprefers to live in a university community. Thoroughly\nfamiliar with all phases of programming and production.\nMarried man, 32, A.B. Location open. $4,800 minimum.\nSeptember 6 - Situation wanted with ETV station man¬\nager or producer-director. Qualifications offered cover ex¬\nceptionally broad creative and technical background which\nincludes producing, directing and writing. Peabody and\nAcademy Awards for film work. Married man, 49, schooled\nin European universities. Prefers New York State or New\nEngland areas. $10,500.\nSEPTEMBER, 1958\n3"
}