{
  "id": "d1134-3",
  "text": "Not included in the summary of listings are em¬\nployer interviews at the College.\nIn radio-television as well as in other branches of\nthe communications field, the demand for personnel\nhas been considerably greater than the number of\navailable graduates, according to Prof. Joe C. Sutton,\nchairman of the College’s Placement Council. During\n1957, 40 radio-television students were graduated\nfrom the College.\nThe Placement Service, Prof. Sutton explained,\ndraws the majority of its job offers from Illinois and\nneighboring states.\nROCKEFELLER FELLOWSHIP OFFERED\nThe World Affairs Center of the United States an¬\nnounces the establishment of a fellowship for the\nstudy of international organizations for the academic\nyear 1958-59. The fellowship, which has been made\npossible by a grant from the Rockefeller Foundation,\nhas been established to enable a college or university\nteacher to gain first-hand knowledge of international\ninstitutions through a year of study and research in\nNew York City. The fellowship will be open to fac¬\nulty members, preferably not over 35 years old, hold¬\ning the Ph. D. degree or its equivalent.\nApplication forms and further information may be\nobtained by writing to the World Affairs Center for\nthe United States, United Nations Plaza at 47th\nStreet New York 17, N. Y. The deadline for applica¬\ntions is March 15, 1958.\nThe Rockefeller grant makes possible one fellow¬\nship each year for three years. The World Affairs\nCenter was founded in 1957 by the Foreign Policy\nAssn, in cooperation with the Carnegie Endowment\nfor International Peace, It is an agency dedicated to\nincreasing the effectiveness of citizen engagement in\nworld affairs.\nRECOMMENDED READING\n“Magic in Mass Communication,” by John K. Weiss,\nassistant vice-president and treasurer for the Fund for\nthe Advancement of Education, is one of five articles\nby prominent educators featured in the Feb. 15 issue\nof Saturday Review under the heading “New Worlds\nin Education.”\nTracing the humble beginning and steady growth\nof ETV, the article focuses on the money and man¬\npower-saving aspects of its use, as well as on its po¬\ntential as an educating device.\nWeiss calls attention to two inherent threats to the\nfreedom of TV operation — governmental regulation\nand the staggering construction and operating cost.\nHe terms the concept of “equal time” for political\nopponents and the requirement for “public interest”\nprogramming by commercial stations “two half¬\nhearted compromises designed to assuage our guilt”\nabout violating in spirit the Bill of Rights. The key\nto the reestablishment of freedom of communication\nis, according to Weiss, in the hands of educational\nbroadcasters because, of their freedom from “spon-\nsorial pressure.”\n^ A free booklet titled Educational Television and\nthe Schools is presently available from the ETRC at\nAnn Arbor, Mich. The booklet covers such subjects\nas the kinds of TV systems used in education, the\nvarious types of educational programs which can be\ndeveloped by schools and the kinds of public relations\nprogramming used to stimulate a more positive at¬\ntitude toward schools and education in general.\ny Religious TV, a Handbook for Rabbis and Relig¬\nious Organizations has been prepared under the co¬\nsponsorship of the New York Board of Rabbis and\nthe American Jewish Committee to assist religious\ngroups in putting on TV shows upon request by their\nlocal TV stations.\nCopies of the $1 booklet may be ordered from the\nNew York Board of Rabbis, 10 East 73rd Street, New\nYork 21, N. Y. or from the American Jewish Com¬\nmittee, 386 Fourth Ave., New York 16, N. Y.\nOHIO CONTEST DRAWS\n677 PROGRAMS\nU. S. and Canadian broadcasters have entered 677\nprograms as contenders for the 1958 “Ohio State\nAwards,” Dr. I. Keith Tyler, head of Ohio State Uni¬\nversity’s Institute for Education by Radio-Television,\nhas announced.\nThe awards are given yearly by the IERT, in\nconnection with its Exhibition of Educational Radio\nand TV Programs.\nMajor aim of the exhibition, according to Dr.\nTyler, is to further the broadcasting of significant ed¬\nucational programs by singling out for special honor\nthe most outstanding entries in the various program\nclasses.\nTotal entries for the upcoming exhibition repre¬\nsented a slight increase over last year, although radio\nprograms entered dropped from 415 to 382. TV en¬\ntries rose from 253 in 1957 to 295 in 1958.\nJudging is currently under way at 17 cooperative\n4\nNEWSLETTER"
}