{
  "id": "d1134-4",
  "text": "NAEB FILES FOR\nTWO CLEAR CHANNELS\nThe NAEB recently filed comments with the FCC\nin support of the need of educational broadcasting,\nrequesting the reservation of two of the eleven clear\nchannel frequencies which the Commission proposes\nto open for other AM station assignments.\nIn appealing to the FCC at this time, the NAEB\nrecognizes that this may be the last opportunity for\nthose institutions not on the air to get an AM assign¬\nment. As the filed comments state, “It is clear,\nhowever, that if steps are not taken to set aside\nchannels for the ultimate use of educational stations\nfor non-commercial broadcasting, these new frequen¬\ncies will be exhausted before the educators have had\nan opportunity to mobilize the specific resources\nnecessary to apply for these new frequencies.” For\nthis reason, it is important that additional prepara¬\ntion time is made possible by the reservation of two\nof the clear channel frequencies for educational use.\nIn addition to the comments in favor of this re¬\nservation, a further suggestion was placed before the\nCommission in regard to the specific frequencies that\nmight be set aside. In order to make possible the\nestablishment of educational stations throughout the\ncountry, the FCC was asked to consider allocation of\nchannels which would permit distribution of the\nchannels through the entire country.\nNEW ENGLAND INITIATES ITS\nEDUCATIONAL RADIO NETWORK\nA live educational radio network in New England\nbecame a reality last month with the first regular\nbroadcasts by WEDK, Springfield, Mass., of pro¬\ngrams from WGBH-FM, Boston.\nThe Educational Radio Network, in effect, joins\neducational institutions at both ends of Massachusetts\nin cultural programming which can be received by\nFM listeners throughout Southern New England.\nIt is expected that station WAMC, at the Albany\n(N. Y.) Medical College of Union University, will\njoin the E.R.N. this year, thereby providing cover¬\nage for upstate New York and Vermont.\nAs a key affiliate of the E.R.N., station WEDK\nwill broadcast many of WGBH-FM’s programs, as\nwell as local programs some of which will be fed to\nthe network.\nWEDK is licensed to the Springfield School Com¬\nmittee and is operated with the cooperation of the\nWestern Massachusetts Broadcasting Council, Inc.\nBOX SCORE\nTotal\nAM\nStations -\n3271\n(includes\n39\nnon-commercial)\ntotal\nFM\nStations ■\n699\n(includes\n162\nnon-commercial)\nTotal\nTV\nStations ■\n584\n(includes\n31\nnon-commercial)\nThe station, which has been conducting tests since\nearly spring, successfully completed trial broadcasts\nfrom its Springfield transmitter before it was linked\nwith WGBH-FM.\nVENEZUELA ADVANCES\nWITH ETV TEACHING\nConcentrated' application of educational TV is one\nof the most promising developments in the education¬\nal system of Venezuela, according to a recently re¬\nturned ETV consultant, John R. Winnie of the State\nUniversity of Iowa.\n“In one sense,” Mr. Winnie reported, “Venezuela\nhas made more progress on a national level in educa¬\ntional TV than has the United States, where educa¬\ntional television experiments are all locally-sponsored.\nFive months ago, in-class television did not exist in\nVenezuela; today, high schools in Caracas have\nbeen exposed to experimental telecasts in the sciences,\nana the government has plans to institute educational\nTV nationally in all primary and secondary schools.”\nThe quick acceptance of ETV by Venezuelan\neducators occurred after a five-month study carried\nout by the Venezuelan National Commission for\nEducational Television with the assistance of Mr.\nWinnie, who has been in Venezuela since February\nconsulting on educational TV as a representative of\nthe Broadcasting Foundation of America.\nPublic reaction to a demonstration conducted in\nCaracas high schools was so overwhelmingly enthu¬\nsiastic that the country’s Ministry of Education ap¬\npropriated funds for the continuance of the program\nduring the coming school year.\nMr. Winnie said that Venezuela’s project is\nattracting attention throughout Latin America as an\nexample of friendly cooperation and good will between\nprivate U.S. organizations and other countries in the\nWestern Hemisphere.\nBFA’s technical assistance to the project was\nmade possible by a $30,000 grant from the Creole\nFoundation, established by a U.S. petroleum company\noperating in Venezuela. BFA will continue to supply\nassistance to the Commission with the help of a new\n$41,000 grant.\nSEPTEMBER, 1958\n5"
}