{
  "id": "d1134-6",
  "text": "legitimate and must be maintained. But the absurd\nprecautions which some broadcasters are willing to\ntake in order to avoid offending anyone seem unjusti¬\nfied, and are certainly alien to the interests of the\nvast majority of listeners.”\nRECORD ENROLLMENT CONTINUES\nCollege enrollments have set a new record this year\nfor the sixth consecutive year and will climb sub¬\nstantially with the opening of the second semester,\naccording to the U. S. Office of Education.\nThe enrollment of 3,060,000 students in 1,890\ncolleges and universities early last fall represents a 4.1\nper cent increase over the 2,947,000 who enrolled in\nthe fall of 1956, the office reported.\nLast fall’s enrollment was 45 per cent above fall\nenrollment in 1951, the year of lowest enrollment since\nWorld War II, and 25 per cent above 1949, the peak\nyear for enrollments in the immediate post-war years.\nU. S. Commissioner of Education Lawrence G.\nDerthick said that during the remainder of the school\nyear, college and university enrollments are expected\nto climb to an all-time high of approximately\n3,460,000.\nDue to an unprecedented increase in the number\nof births during the mid-1940s the. number of college-\nage persons in the population will start to climb\nsteeply in the early 1960s, Dr. Derthick pointed out.\nIn the next decade, the number of young people seek¬\ning enrollment in college is expected to double.\nNEWS OF MEMBERS\nGENERAL\ny More than 70 business and industrial firms in the\nChicago area desire television training programs for\ntheir employees, according to a recent survey by\nWTTW, Chicago.\nHighest on the preference list are programs deal¬\ning with communication skills and interpersonal re¬\nlationships, rather than with specific manual or\nacademic skills.\nForty-five of the 73 institutions that responded\nto a questionnaire circulated by the station listed\nhuman relations as number one preference.\nOther preferences high on the list are business\nletter writing, creative thinking, effective speech,\nsupervisor development, conference leadership and\nfundamental economics.\n► Raymond Hurlbert, general manager of the Ala¬\nbama Educational Television Commission has an¬\nnounced that the growing number of schools in the\nstate using educational TV courses has brought an\nincreased number of requests for specialized training\nby TV.\nEffective since January 27, Alabama’s ETV net¬\nwork signs on at 9:30 a.m., 15 minutes earlier than\npreviously. Its sign-off time at 10 p.m. remained un¬\nchanged. The additional morning programming ex¬\ntends the networks daily air time longer than that of\nETV stations throughout the country with the ex¬\nception of Chicago, Pittsburgh and Miami.\n^ Two engineers from the state-owned radio and TV\nservice in Yugoslavia are currently receiving special\ntechnical instruction at station WHYY-TV, Philadel¬\nphia’s educational UHF channel.\nThe foreign visitors are Slavko Pernus and Anton\nJese, chief engineer and maintenance supervisor, re¬\nspectively, of Radio-Televizija Ljubljana, Yugoslavia.\nThe men are members of a group of eight engineers\nselected by the Yugoslavian broadcasting agency for\nthree months of special training in the United States\nin advance of the start of TV in Yugoslavia, later\nthis year.\nThe training program is part of an equipment\npurchase arrangement made by the Yugoslav broad¬\ncasters with the Radio Corporation of America. Fol¬\nlowing an indoctrination period in Camden, N. J. the\nvisiting engineers were reassigned to specially selec¬\nted TV stations in this country for further training.\nPROGRAMS\n^ That educational TV can be as beneficial to\nparticipants as to home viewers is the basic assump¬\ntion underlying “Fields Afar,” a program series pre¬\nsented weekly over Michigan State University’s\ntelevision station WKAR-TV at East Lansing.\nThe series was inaugurated a year ago to provide\n“an avenue of expression” for colleges within the\nstate. Each Friday throughout the school year, the\nstation devotes 30 minutes to a different institution\nduring which the latter presents talents of its stu¬\ndents and faculty.\nWilliam H. Tomlinson, producer-coordinator of\n“Fields Afar,” holds that cooperation is the key to\nthe program’s success. The fact that the University\nand the visiting schools are sharing in the work re¬\nquired for putting on a half-hour program is con¬\nsidered by Tomlinson as “probably the most impor¬\ntant feature of this unique interschool relationship.”\n^ Each Monday, Wednesday and Friday at 2 p.m.,\nWILL, the University of Illinois’ educational station,\nMARCH, 1958\n7"
}