{
  "id": "d1134-7",
  "text": "takes its listeners to join in a classroom session with\nstudents of Shakespeare to hear the lectures of Dr.\nPaul Landis, professor of English.\nBroadcast directly from the classroom, the lec¬\ntures are a part of a course called “Introduction to\nShakespeare.” The lectures are designed to acquaint\nthe beginning student with the works of Shakespeare\nthrough a careful reading of 10 plays.\n^ The November 17 (1957) special Sunday pro¬\ngram by META, New York, “The Negro in American\nLife—A Long View,” has been awarded the highest\nrecognition conferred in the media field by the Na¬\ntional Conference of Christians and Jews—the Na¬\ntional Brotherhood Award. The program was jointly\npresented by META and WCBS-TV.\nDr. Alan Willard' Brown, META’s president, an¬\nnounced that the award had been given on the basis\nof the program’s “realistic, critical and constructive\nanalysis of the role of the Negro.”\ny Complete concerts of the Boston Symphony\nOrchestra will be presented over the country’s edu¬\ncational TV stations beginning in March.\nThis season’s concerts of the noted' orchestra, un¬\nder the direction of conductor Charles Munch, are\nbeing filmed by WGBH-TV, Boston, for the ETRC.\nThe Center will later make the films available to its\naffiliated educational stations.\nRobert B. Hudson, program coordinator for the\nCenter, said the programs will mark the first time\nthat one of the country’s major symphony orchestras\nwill be seen nationally in a complete television con¬\ncert on a regular basis.\ny “Stones and Bones,” a weekly program in\narchaeology presented weekly by the Alabama ETV\nNetwork, has been described as “a real mail puller”\nby Louis Peneguy, the network’s coordination and\ninformation director.\nThe favorable audience response to the program\nhas been attributed primarily to Britt Thompson,\nexecutive at Hayes Aircraft and emcee of the show.\nThompson, an amateur archaeologist, came to TV\nalmost by accident when the curator of Birmingham’s\nmuseum, who intended to go on a two-week vaca¬\ntion, invited him to fill in on his educational TV\nprogram.\nBecause of the favorable response he received,\nThompson eventually was requested to continue his\nprogram for an entire year.\n^ Bill Baird and his costumed marionettes are pre¬\nsently inspiring children to learn and like mathema¬\ntics through a program, “Adventures in Number and\nSpace,” on San Francisco’s educational TV station\nKQED. The program package of nine shows was\nreceived by the station as a gift from KPIX and the\nWestinghouse, Broadcasting Co.\nThe basic principles of math are simply and en¬\ngagingly explained by Baird and his puppets who\ntrace back through the ages the origins of the basic\nmathemetical branches. He then relates the meaning\nof each of these branches to contemporary life,\nshowing practical applications to the world of today.\n^ KBPS, the Portland Public Schools radio station\nwill be 35 years old on March 23. To commemorate\nthe occasion, the station plans a special two-hour\nbroadcast on March 24 at 7 p.m. The program will\nencompass the theme, “The Role of KBPS in the\nSchools and Community of Portland.”\nThrough its NAEB membership during the past\ndecade, KBPS has offered programs coming from\nthe nation’s leading universities, cultural centers and\nEuropean broadcasting systems.\nPERSONNEL\n^ Jack McBride, general manager of educational\nstation KUON-TV, Lincoln, Neb., will direct a new\non-the-job training project for personnel of educa¬\ntional TV stations, it was announced by the ETRC\nin Ann Arbor, Mich.\nThe Center is conducting the project with funds\nmade available by the Fund for Adult Education.\nPLACEMENT SUPPLEMENT\nMarch I — Woman, 36, single, M.A. candidate, will be avail¬\nable in September for programming, coordination work.\nBackground includes 16 years experience in writing and\nproduction for TV and films, writing for national maga¬\nzine industry and in college teaching. Will locate any¬\nwhere but South. $6,500-7,500.\nMarch 2 — Male,‘married, 27, M.A., vitally interested in edu¬\ncational TV, desires position as producer-director. Cur¬\nrently with two top network shows, has extensive experi¬\nence in all phases of live and film TV production on net¬\nwork and local level. Location open. $5,000.\nMarch 3 — Experienced announcer and producer in com¬\nmercial and educational radio-TV is seeking a position in\nproduction with ETV. Extensive background includes di¬\nrecting, writing, acting. Now employed as associate pro¬\nducer for a live TV production firm in New York. Male,\n34, single, B.S. Prefers northern location. $5,200 minimum.\nMarch 4 — June candidate for M.A,., 31, single, male, seeks a\ncareer in educational TV, preferably in a broadcasting¬\nteaching combination. Primarily experienced as a writer,\nwith additional training in radio and television produc¬\ntion. Location open. $5,500.\nMarch 5 — Woman seeks opportunity in ETV to utilize experi¬\nence in teaching, TV promotion and scriptwriting. In¬\nterested in position as production assistant, public rela¬\ntions liaison or network ETV training program. Single, 36,\nM.A. Licensed teacher. Wants to locate in major city.\n$5,500-6,500.\nNEWSLETTER"
}