{
  "id": "d1134-8",
  "text": "TV TECHNICAL TIPS\n—Cecil S. Bidlack\nIn early February, one of the most recent technical\ndevelopments was demonstrated to newsmen by the\nBlonder-Tongue Labs, of Newark, N. J. It was Bi-\nTran, a system of TV broadcasting which allows two\nprograms to be broadcast over the same television\nchannel. This is a “compatible” system which may\nbe applied to double the number of programs received\non a single channel.\nAs the system would work, each channel would\nbe divided into an “A” and a “B” portion. The “A”\nportion would contain present commercial or educa¬\ntional programming as now provided. The “B” por¬\ntion would be used for special services not now ac¬\ncorded television time and would be received only if\nthe viewer elected to decode the signal at his receiver.\nAt the demonstration, the regular broadcast pro¬\ngram (program “A”) was seen on the receiver screen.\nWhen the decoder was switched on, program “B”, a\nclosed circuit picture, appeared on the screen. Those\npresent at the demonstration commented that the\nmultiplexed program was inferior in resolution and\ncontrast to the regular program. However Blonder-\nTongue officials stated that the demonstration was\nprimarily to show the feasibility of the system and\nthat the system required refinement to improve pic¬\nture quality on the the multiplexed channel.\nIt was stated that it would cost approximately\n$5,000 to modify transmitting equipment for Bi-\nTran and about $60 for a decoder for the home re¬\nceiver. Further demonstrations will be held for radio\nand television broadcasters as well as industry and\nmilitary leaders, educators, medical and governmental\nspecialists.\n*****\nTwo papers of interest to technical personnel at\nNAEB stations and production centers will be in the\nmail soon. The first, “Film in Television” by Rodger\nJ. Ross of the Canadian Broadcasting Corporation is\na discussion of the technical quality of television film\nfrom the standpoint of the television broadcaster.\nThe second is a “how-to-do-it” paper by Mel’ Haas of\nthe WOI staff. It details their method of balancing\ncrowd noise at sports broadcasts automatically when\nthe announcer uses his mike cut-off or “cough” but¬\nton. It’s called “Automatic Crowd vs. Announcer\nBalance.”\nThese papers will be mailed to chief radio and tele¬\nvision engineers on our Technical Directory list. We\nhave extra copies available to send upon request to\nothers wishing them.\n* * * * *\nWTTW has expanded its kinescope recording serv¬\nice for outside agencies by the installation of a sec¬\nond kinescope recorder, according to Duane Weise,\nchief engineer of the Channel 11 Chicago ETV sta¬\ntion. They are equipped to record either off-the-air\nfrom Chicago stations or by direct line from their own\nor remote studios.\nThe station has also issued a new brochure cover¬\ning the WTTW-TV Recording Service which includes\nsample video recording costs. Revenue from the re¬\ncording service is applied to the operation of WTTW.\n*****\nA new line of closed circuit vidicon television\nequipment has just been announced by the General\nPrecision Laboratory, Inc., Pleasantville, N. Y. The\nmodel PD-250 camera incorporates a five-inch elec¬\ntronic viewfinder, a four-lens turret and either port¬\nable or rack-mounted control equipment. For studio\ninstallations a control console is available, equipped\nwith a 14-inch picture monitor, a five-inch waveform\nmonitor and rack mounted control unit with remote\ncontrol panel. The PD-250 camera is priced at $1,750\nand operates from an external RETMA sync or an in¬\nternal sync generator. Where budget requirements\nare restrictive, the model PD-250 camera priced at\n$1,250 is self contained and provides either video or\nRF output. It is equipped with a three lens turret\nas standard equipment but has no viewfinder.\n*****\nGlen Southworth, chief engineer of KWSC, the\nState College of Washington at Pullman, is the author\nof an article on page 100 of the February 14 elec¬\ntronics. The article outlines a method of determining\noptimum electronic focus of television cameras and\nfilm chains by a special bar chart and by adjusting\nfocus controls for maximum response of peaks on the\nwaveform monitor. This chart, developed by Mr.\nSouthworth, also permits rapid determination of the\nsystem resolution and relative resolving power of dif¬\nferent camera lenses.\n*****\nFebruary 1958 Electronic Industries contains a re¬\nport on progress achieved by the EIA Committee,\nMicrowave Relay Systems for Communication (TR-\n14) on “Standardizing Microwave Communication\nSystems.” Due to the many and varied uses of micro-\nwave systems, it has been found necessary to stand-\nMARCH, 1958"
}