{
  "id": "d1728-0",
  "text": "of the NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. 30, NO. 2 WASHINGTON, D.C. FEBRUARY, 1965\nSchenkkan and Taverner Reelected\nRobert Schenkkan, KLRN-TV, and Donald Taverner, WQED-\nTV, have been reelected to the NAEB TV Board. Other\nBoard elections were announced in the January Newsletter,\nbut a run-off was necessary in the TV Division.\nSchenkkan has also been reelected as chairman of the\nTV Board.\nNeed Personnel for Samoan ETV\nTeachers, producer-directors, and engineers are needed for the\nNAEB Samoan ETV project. Specifications call for second¬\nary teachers in all basic subject areas, with experience in\nteaching on TV; producer-directors with ITV production ex¬\nperience ; and studio operation and maintenance engineers.\nThose who are qualified who would like to participate in the\nuse of TV for instruction in the islands of American Samoa\nshould write to: Coy Ludwig, Assistant Director, Office oi\nResearch and Development, NAEB, 1346 Connecticut Avenue,\nN.W., Washington, D.C. 20036.\nUtilization Kits Available\nTwo demonstration kits dealing with classroom utilization of\nTV will be released March 1. These have been developed by\nthe NAEB under a U. S. Office of Education grant.\nEach kit consists of a 30-minute color film and a supple¬\nmentary manual. One kit, “Preparing the Television Lesson,''\ndemonstrates the special considerations involved in preparing\nand producing a TV lesson for the classroom. The other, “A\nCase Study in the Elementary School,” shows how one sixth-\ngrade teacher used a TV lesson on oceanography to teach\nsome basic science generalizations.\nThe NAEB 'Teaching Materials Library is distributing\nthese kits on a loan basis, at a service fee of $5 for each use.\nFor additional information, write Dr. Clair R. Tettemer,\nKFME, Fargo, North Dakota 58101.\nNAEB Testifies on Education Program\nIn testimony before the House Education Committee at the\nend of January, educational broadcasters supported the in¬\nclusion of educational radio and TV in President Johnson’s\nelementary-secondary education program. NAEB President\nWilliam Harley said, “We are pleased that the bill makes\nspecific mention of radio and television as supportive of edu¬\ncational services and recognizes the contribution that these\nmedia are capable of making in carrying out the intent of\nthe legislation.”\nSpeaking for NAEB-ETS, C. Scott Fletcher pointed out\nthat ETV stations can play a vital role in preschool education\nand in supplementing existing elementary and secondary fa¬\ncilities and providing occupational, vocational, and technical\nand liberal education. Jerrold Sandler, NER director, pointed\nout that educational radio stations are already at work pro¬\nviding programs to upgrade the level of education among cul¬\nturally and economically deprived families in several sections\nof the country.\nBoth educational radio and television are included for the\nfirst time in any general federal education program. Two of\nthe five titles in the bills now before Senate and House com¬\nmittees specifically mention improving libraries and instruc¬\ntional materials, including libraries of instructional materials\n(including magnetic tapes), and developing supplementary edu¬\ncation centers that could contract for educational radio and\nTV programs.\nMore specific information about the bills has been sent\nto NAEB institutional members through division offices.\nRegion III Plans Meeting\nNAEBers in Region III will meet March 21-23 at Miami\nUniversity, Oxford, Ohio. Stephen C. Hathaway, director of\nbroadcasting at Miami and chairman of the committee plan¬\nning the meeting, has announced that the program will be a\nthree-pronged affair, covering the areas of ETY, ITV, and\nradio.\nShort papers and discussion will center around the theme\n—The Emerging Role of (ETV, ITV, Radio) in Our Edu¬\ncational Society. Chairmen for the separate areas are: William\nEwing, Ohio State University—ITV; Duane Tucker, Bowling\nGreen State University—ETV; and Archie Greer, Ohio Uni¬\nversity—radio.\nRegistration, a social hour, and tours of WMUB, WMUB-\nTV, and the audio-visual service will be Sunday evening,\nMarch 21, with the opening session on Monday morning. The\nconference will adjourn at noon on Tuesday.\n• ETV program. Four speakers are scheduled: George\nParkinson, director, Milwaukee Vocational and Adult Schools,\n“Programing for What—Locus: Milwaukee”; Donald Taver¬\nner, general manager, WQED, Pittsburgh, “A Philosophy of\nETV Programing—Locus: Pittsburgh”; and Buren Robbins,\nSouthern Illinois University, and E. H. Gillis, Ohio ETV Net¬\nwork, whose topics will be announced later.\n• ITV program. Topics and speakers scheduled are: “Clos¬\ning the Gap—Research and Practice,” Lee Dreyfus, associate\ndirector of TV, University of Wisconsin. “Some Suggestions\nfor the Application of a Theory of Learning to Televised In¬\nstruction,” Charles J. McIntyre, director of instructional re¬\nsources, University of Illinois. “Viewpoint of a School Execu¬\ntive,” H. R. Cromwell, superintendent of schools, Middletown,\nOhio. “Professional Training of ITV Personnel,” Le>vis\nRhodes, director, Central Michigan ETV Council. “Findings,\nDemonstrations and Conclusions of CIC Seminars on ITV\nProduction,” Colby Lewis, director of broadcasting, Michigan\nState University, assisted by representatives of other CIC\ninstitutions. “Appraisal of Current Developments in ETV\nEquipment,” Roger Peterson, consulting engineer, Jansky and\nBailey. “Ford-Sponsored NAEB Projects for the Improve¬\nment of ITV,” speaker to be announced. Egon Guba, director,\nBureau of Educational Research, Ohio State University, will\nspeak, topic to be announced.\n• Radio program. This will cover the areas of research,\ncommunity service, and instruction. Four of the six speakers"
}