{
  "id": "d1728-1",
  "text": "have been announced: Richard Forsythe, Purdue University,\nresearch. Daniel Logan, Wayne State University, community\nservice. Robert Smith, Western Michigan University, and\nBernard Russi, Marietta University, instruction.\nConvention Talks Available\nPhotocopies of the following presentations from the 1964\nNAEB convention may be obtained from the publications of¬\nfice for 10c a page to cover duplication and postage; payment\nmust accompany order. These will not be published in the\nNAEB Journal. (Tapes of these and most other sessions of\nthe convention are available from NERN for $5 a half hour;\nwrite to NERN, Urbana office, for order blanks and infor¬\nmation.)\n1. Educational Broadcasting and the FCC. Mclvor Park¬\ner’s presentation—9 pages. Summaries of Hyman Goldin and\nSamuel Saady remarks and of question-and-answer period, by\nLawrence Frymire, session recorder—2 pages.\n2. Educational Broadcasting and the NDEA. Summary\nof session by Recorder Coy Ludwig—6 pages.\n3. Educational Broadcasting and the ETV Facilities Act.\nPresentations of Raymond Stanley, William Smith, Ian Wheel¬\ner—14 pages. Summary of question-and-answer period by Re¬\ncorder Ruane Hill—2 pages.\n4. Engineering session. Review and analysis of NAEB\nreport, “Technical Standards for Television Transmission,” by\nRon Stewart—*8 pages. UHF allocation plans, by Oscar Reed\n—51 pages. Educational FM allocations, by Roger Peterson-\n12 pages.\n5. Research session. “New Dimensions in ETV: Juvenile\nDelinquency,” by Richard I. Evans—10 pages.\n6. Educational Broadcasting Around the World. Sum¬\nmary of Burton Paulu’s remarks on “A Survey of Interna¬\ntional Broadcasting,” by Mrs. Gertrude Hoffsten, session re¬\ncorder—1 page. Presentation on the EBU by William G. Har¬\nley—5 pages.\nHawaii Studies ETV\nETV in Hawaii was the subject of the sixth annual confer¬\nence of the Hawaii Audio Visual Association January 22-23\nat the University of Hawaii. Vernon Bronson, executive di¬\nrector of the NAEB Individual Member Division, keynoted the\nmeeting, speaking on ETV in the U. S.\nOther speakers and subjects were Harold Wigren, NEA\nETV consultant, on ETV and the teacher; A.E.P. Wall, edi¬\ntor Honolulu Sunday Star Bulletin and chairman of the gov¬\nernor’s ETV advisory committee, presenting Hawaii’s plans\nfor ETV; Wesley Sakai, of the state education department,\non utilization; Ronald Bornstein, TV production specialis\nUniversity of Hawaii, on ETV production; and Howard Fos¬\nter, graphics supervisor, state education department, on closed-\ncircuit TV in the classroom.\nIf You Read Dutch . . .\nand would like to review for the NAEB a book by D. A.\ndeKorte, Televisie bij onderwijs en opleiding, please write to\nthe publications office, NAEB, Urbana.\nNAEBers Buy Over 350 First-Timer Manuals\nFollowing an announcement in the November Newsletter,\nreaders have bought over 350 copies of William E. Parke’s\nsimple manual for first-timers on TV. Copies of the 15-page\nmimeographed “Your Appearance on TV” are obtainable from\nthe NAEB publications office for 50c each for duplication\nand postage (25c for orders of six or more mailed to one ad¬\ndress at one time).\nNAEB-NER Stations Win Awards\nNER stations won three out of five top places in the first\nArmstrong Awards for excellence in FM broadcasting. The\nstations and their winning categories are WtRVR, New York,\npublic and community service; WFBE, Flint, Mich., news;\nand WUHY, Philadelphia, education. These stations and\nWUOM, University of Michigan, also won certificates of\nmerit—WUOM for music, WRVR for music and education,\nWFBE for education, and WUHY for music.\nSyracuse Seeks Ideal Teacher\nThe “ideal teacher” research project at Syracuse University\nentered its third year in January. Lawrence Myers, Jr., chair¬\nman of the TV-radio center, directs the program under spon¬\nsorship of HEW.\nIn the program, lectures are filmed and shown on CCTV.\nBefore the lecture, students indicate their concepts of the\n“ideal teacher” and also their own feelings or emotions. After\nthe lecture, the students again evaluate their feelings and rate\nthe teacher they have just seen. The two sets of evaluations\nare correlated.\nIndustrial Subjects on TV?\nBernard Dutton is attempting to establish the feasibility of\nusing TV for instruction in industrial education subjects in\nthe public schools. He would appreciate hearing from anyone\nwho knows of work which has been done in presenting such\nmatter on TV. He is particularly interested in specific in¬\nformation about program format, effectiveness of presenta¬\ntions, techniques used to best present the material, and ad¬\nvantages and disadvantages of such presentations. Write to\nhim at 22611 Barbacoa Drive, Saugus, California.\nNeeds Info on Films\nRichard C. Burke is compiling a 'list of films which could be\nused in teaching various aspects of radio and television. He\nwould appreciate hearing from anyone who knows of such\nfilms—or of such a compilation which already exists. Write\nto him at: Department of Radio and Television, Indiana Uni¬\nversity, Bloomington, Indiana 47405.\nABU Inaugurated\nThe Asian Broadcasting Union made its formal start as an\ninternational organization of broadcasters with its first meet¬\ning, in Sydney, Australia, in November. Yoshinori Maeda,\npresident of the Japan Broadcasting Corporation, was named\nABU’s first president. Some 200 persons attended the meet¬\ning, at which resolutions were adopted to expand staff train¬\ning institutions, promote program exchanges, establish a prize\nfor radio rural programs and TV documentaries, and promote\ntechnical cooperation among member organizations. The as¬\nsembly will meet again in Tokyo in October, 1965.\nUSIA Happy with English Series\nUSIA personnel have reported good results with two English\nlanguage series which NAEB staffers helped them to obtain.\nTime and Tune in English Speech was broadcast over 125\nstations of NHK’s educational network last summer, with\napparent success. It is currently being broadcast to Russia,\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, I 19 Gregory Hall,\nUrbana, III. 61803. $5.00 a year. Editor: Betty McKenzie. Editorial\nassistant: Skip Robinson. Phone 333-0580. Area Code 217. TWX\n217-344-0970.\n2\nNEWSLETTER"
}