{
  "id": "d1785-1",
  "text": "Purdue’s experimental set-up allows about 600 stu¬\ndents in seven courses to receive CC instruction at\ntwo campus locations.\nOne highlight on Saturday was Ned Rosenheim’s\n“New World” discussion program, a Conference pro¬\ngram item, treating a complex subject - Technology\nand Communications — a roundtable on “Monitor”\nwhich you heard Sunday, January 27th.\nA bad cold prevented Dick Hull’s attendance and\nthe help of his prepared talk for the closing session.\nAn unprepared but just as helpful message was given\nby past-president Schooley.\nRegion III, already the largest in NAEB,\nemerged from the Conference stronger than ever.\nTalk of a Region III network, more frequent meet¬\nings and unilateral program exchanges were heard\neverywhere. H. B. McCarty has agreed to put on\ntape his keynote speech which headquarters will dis¬\ntribute to region members.\nThe newcomers expressed sincere appreciation\nat getting to meet the old timers; and the oldsters\nradiated confidence in the future in light of the splen¬\ndid young people present at this Conference who ap¬\npeared ready, willing and able to carry on the work of\nNAEB.\n—N A E B—\nMEMO FROM THE EXECUTIVE DIRECTOR\nBy Harry Skornia\nBecause so many things are occurring just at\ndeadline, this month’s report will be very brief.\nUndoubtedly we shall be able to provide a longer\ncolumn next time.\nAs this is written, we have had relatively few\nreactions to the changed form of the Newsletter.\nWe hope you like it, and we will continue to im¬\nprove. One way to improve is to have news from\nyou, so please keep it coming — along with any\nsuggestions. Another way is to be sure your staff\nmembers have access to the Newsletter. Do you\nroute your copy to all who might profit from it?\nThe principal event of this period', since last\nmonth, is the Executive Committee meeting held\nin sub-zero Minneapolis January 10 and 11. Origin¬\nally scheduled for Chicago, the meeting-place had\nto be changed because there were absolutely no\nhotel accommodations available due to the furni¬\nture and automobile shows. Minneapolis, with\nPresident and Mrs. Paulu’s hospitality, turned out\nto be. a good choice after we finally got there (by\ntrain, with pockets full of unused airplane tickets).\nI shall leave discussion of the results of this\nmeeting to your president. Briefly, committee\nmembership was discussed (advisory to the pres¬\nident) , together with problems of goals, support\nand projects for the next year — problems which\ncould not wait for the meeting of the full Board at\nColumbus in early May, in connection with the\nIERT. I personally, was very well pleased with\nthe meeting and believe much was accomplished.\nCommittee appointments by President Paulu ap¬\npear elsewhere in this issue.\nDIRECTORY CHANGES\np. I 122 Active Members\n87 Associate Members\n76 Affiliate Members\n3 Honorary Members\n288 Total\nRadio - FM only 82\nTotal Active Membership 122\n(I) .... these 122 members operate, or have\nconstruction permits for, 155 stations,\np. 4 WUOA (FM) 3 kw\np. 10 WSLU (FM) Miss Lucille Ruby\np. 12 KUOM (AM) Phone Federal 2-8158\np. 12 Add: KTCA (TV) ch. 2 J. C. Schwarzwalder,\n(St. Paul) Director, Twin City Area Educa¬\ntional Television Corporation\nTSA Room I 10 Univ. of Minn. Mid 6-4616 Ext. 263\np. 14 WKCR (FM) 89.9 me\np. 15 WUNC-TV (Chapel Hill) Delete Communication Center\np. 16 WSLN (FM)\np. 17 WNAD (AM) Phone Jefferson 4-6900\np. 17 Delete KETA-TV and KOED-TV\np. 17 KOKH (FM) 18th & Klein\np. 18 WQED (TV) V-138 kw John F. White, Gen. Mgr.\nA-69 kw\np. 20 Add: WEMC (FM) 91.7 me Eastern Mennonite College\n(Harrisonburg) 10 w John R. Mumaw, President\nHarrisonburg, Virginia\np. 21 WLFM (FM) * 91.1 me Phone Regent 3-5577\np. 21 WHA - FM 88.7 me\np. 23 Birmingham Public Schools 2015 7th Ave., N.\nBirmingham 3 Phone Al 2-1151\np. 25 University of Chicago Phone Extension 3182\np. 31 Add: Metropolitan Educational Mr. E. A. Hungerford Jr.\nTelevision Association, Inc. Executive Director\n(New York) 345 E. 46th St. New York 17\np. 33 Northern State Teachers College Mrs. C. H. Holgate,\nDirector of Radio South Jay Street\np. 34 Baylor University 3929 Splight Phone 4-6647\np. 34 Add: Abilene Christian College Lowell Perry\n(Abilene) Dir. of Radio\nBox 215 Abilene, Tex. 2-5413\np. 34 David Lipscomb College Granny White Pike CY 2-4451\np. 37 Watson P. Dutton Phone District 7-1260\np. 38 Delete Evansville Public Library\np. 39 Delete Louisiana Educational TV Commission\np. 41 Delete Eastern Montana College\np. 42 Columbia University Center for Mass Communication\n(NO \"S\")\np. 43 Radio Free Europe 2 Park Ave Lexington 2-8902\nNew York 16, N. Y.\np. 44 Delete The Junior League of Charlotte TV Committee\np. 46 University of Wisconsin-Milwaukee\np. 46 Add: University of Wisconsin Robert N. Dick\nExtension Division Radio-TV Coordinator\n(Madison) Extension Building Univ. of Wis. Madison 6\np. 46 Add: WYOMING\nNorthwest Community College J. E. Christensen, Director\n(Powell) Univ. of Wyoming, Powel, Wyoming\np. 51 WLFM (FM) *\np. 53 Delete KETA-TV and KOED-TV\np. 53. Add KTCA twin City Area Educational TV Corp.,\nSt. Paul, Minn.\np. 53a WTIQ-TV Munford\nNEWSLETTER\nPage 3"
}