{
  "id": "d1785-10",
  "text": "The Oklahoma City Symphony” started January\n11 over WNYC, and presents contemporary Ameri¬\ncan and outstanding Norwegian works.\ny The Carnegie Institute of Technology presented\na series of four fine arts programs, “Classicism in the\nArts Today,” over WQED, Pittsburgh. Four Col¬\nlege of Fine Arts professors participated in the series.\ny A new arts and crafts program series “Telecraft\nTime,” of special interest to parents, leaders of youth\ngroups, school teachers and church school leaders,\nstarted January 23 on WTTV, Bloomington, Indiana.\nThe educational program will run for 18 weeks,\nthrough May 22, telecast via beam relay from the\nIndiana University campus studios.\nTypical projects will be demonstrations of soap¬\ncarving, shell craft jewelry, pot-holder weaving,\npaper mache animals and copper work.\n► In the same vein, KQED, San Francisco, is tele¬\ncasting a show of artistry, impromptu talk and fun.\nThe program is called “Paper Capers” and features\na wide range of lovely things made from paper. Bay\nArea sculptor Billy Shelley hosts the show, and he will\nbe joined from time to time by guests well-known in\nartistic circles, cartoonists, etc.\ny U. S. foreign policy and the nations it currently\ninvolves are given news-in-depth treatment on\nWTTW, Chicago, in their new program series,\n“America Looks Abroad,” which began January 24.\nThe 24-week series is divided into four sections: 6\nprograms on Africa, 5 on international organizations,\n7 on the other Americas, and 6 on the making of\nforeign policy. It has been kinescoped' for distribu¬\ntion to other TV stations by the ETRC.\ny “Radiation—You, Me and the Atom” is the title\nof a new TV series being presented by the University\nof New Mexico. Many fine visuals courtesy of the\nAtomic Energy Commission are featured in the tele¬\nvised programs directed by Bernarr Cooper. Sim¬\nplified sets with flasks, clicking Geiger counters and\na backdrop of an outsize white microscope sus¬\npended against a dark background add interest to\nthe program.\n—N A E B—\nMayor Robert Wagner of New York paid tribute\nto the public service performed by radio and TV.\nAddressing a monthly meeting of the Radio and TV\nExecutives Society, he said broadcasters have served\na public need by their panel shows on which city\nofficials are questioned and permitted to explain the\nissues and problems before the city government.\nTV TECHNICAL TIPS NO. 29\n—by Cecil S. Bidlack, NAEB TV Engineer\nThe revised NAEB Technical Directory is ready\nto go press. The new edition will contain the names of\nover 400 engineers and technicians working at educa¬\ntional radio or TV stations and production centers.\nThis is over a 100 per cent increase in the listings of\nthe original directory published in May, 1955; yet it\nstill is not complete.\nWe want to thank those of you have returned the\ndirectory questionnaires and test equipment data.\nWe believe we have included the names of all who\nsent this information.\nWe have also sent a second inquiry to some 20\nstations, some of whom have not yet returned the in¬\nformation (although each form was accompanied by a\nstamped return envelope). Our crystal ball is some¬\nwhat cloudy, so if the technical personnel at your sta¬\ntion is not included it isn’t because we haven’t tried.\nWe’d like to keep this directory up-to-date, and\nwould appreciate having the names of those added to\nyour technical staff. If someone leaves, too, we’d like\na post card or short note asking us to delete his name.\nIt would also help if you would advise us of errors in\naddressograph plates or in the station address and\ntelephone number.\nData secured as a result of the test equipment\nquestionnaire is being compiled. We hope to publish\nthis material soon and circulate it to all chief engi¬\nneers.\n* * *\nAnother publication of the NAEB Engineering\nService is an article which contains the constructional\ndetails of a two-channel transistor remote amplifier-\nmixer. This was designed and built by Donald K.\nHaahr of the WOI staff. The completed amplifier is 3\ninches high, 6 inches wide and approximately 8 inches\nlong. It has an overall gain of 80 DB into a 600 ohm\nload and excellent frequency response.\nThe article is complete with schematic, parts list,\nfrequency response, noise and distortion character¬\nistics, as well as three illustrations which show im¬\nportant constructional details and the completed\nunit.\nCopies of this paper have been mailed to all chief\nengineers of educational radio and TV stations. We\nshall be glad to take care of individual requests as\nlong as the supply lasts.\n* * *\nFor those of you who are thinking of new studio\nfacilities, we’d suggest reading an article which ap¬\npeared in the January 7 Broadcasting-Telecasting. It\nappears on Page 70, and tells how WSVA-TV built a\nstudio-office building with 2240 square feet of space\nPage 8\nNEWSLETTER"
}