{
  "id": "d1785-2",
  "text": "Having roused ourselves at 5:30 in the mor¬\nning of January 16 for a flight to Hagerstown\nfor the ceremony there in connection with their closed\ncircuit project, Frank Schooley, Cecil Bidlack and\nI yielded to the weather in the face of the obvious\nmisgivings of the pilot of the light University of\nIllinois plane which was to have taken us out and\nback the same day. Therefore, we do not now\nhave a report on that ceremony, or the chats we\nhad hoped to have with Dorothy Smith of the\nACE-TV Committee, Ralph Steele and Walter Em¬\nery of the JCET, and many others with whom we\nhad planned to compare notes.\nAs this is written we are ready to leave for\nthe Region III meeting at Purdue. We have ar¬\nranged for a separate brief report on this meeting\nand you will find it elsewhere in the Newsletter. I\nbelieve these regional meetings are among the most\nimportant activities of the NAEB, since many staff\nmembers who cannot normally get to the national\nconventions can generally come. We always greatly\nenjoy them.\nThe Professional Advancement Committee will\nhave held its meeting in Urbana by the time you\nreceive this. We hope to have a report on this and\nother regional and committee activity in time for\nthe March issue.\nIn closing, I’ve just looked over a brief state¬\nment on coverage, costs, and other useful guidance\nabout lower-power TV which Cecil Bidlack has pre¬\npared. We decided to send this to our various\nmailing lists, together with similar material on low-\npower FM. These will be followed by similar sug¬\ngestions for closed-circuit TV. In this we hope to\nincrease our service to members and to education\nnationally when it needs all the tools it can get to\nmeet the great increase in school enrollment at all\nlevels. We’d be interested in your reaction to this\nand the various other services we seek to provide.\nUntil next month then, that’s thirty.\n—NAEB—\nHEADQUARTERS PERSONNEL\ny At the end of January Headquarters lost Traffic\nManager, Mrs. Martha Kappmeyer, who left to await\nan addition to the family toward the end of the\nmonth. Mrs. Peggy End’erby has come to replace\nher from the Continental Illinois National Bank &\nTrust Company in Chicago.\ny Also, Headquarters gained a new chief secretary,\nMrs. Judith Gans, who came to us from NBC in\nChicago where she was secretary to the Director\nof Programming. We are happy to say our previous\nsecretary, Mrs. Mary Francis Bryner, is still with us\nas secretary for the Engineering Service.\nTV CONSULTATION SERVICES AVAILABLE\nETV stations are reminded there are still some\nfunds available (from the Ford Foundation grant) to\nprovide continuation of the consultation services in¬\nstituted last year. Under the terms of the grant,\nNAEB will provide consultation service, on either a\nteam or individual basis, in such areas as production,\ndirection, program planning, engineering, station\nmanagement, writing, staging and lighting, etc.\nAny ETV station desiring to take advantage of\nthis service should write a formal application to the\nExecutive Director, setting forth in detail the area (s)\nin which consultation is desired, reasons why the ser¬\nvice is needed, preferred dates, etc. The station may\nindicate consultants preferred, and, if possible, an ef¬\nfort will be made to obtain those indicated. However,\nfinal selection of consultants is made by the Executive\nDirector on the basis of availability and suitability for\nthe task outlined in the request.\n—NAEB—\nBRITISH IN-SCHOOL BROADCASTING\n—by Dr. Eric Goldschmidt, Managing Editor\nTellex Publications Ltd.\nThe way broadcasting to schools is being intro¬\nduced in Britain could be an excerpt from a musical\ncomedy if it were not stark fact. About 18 months ago\nMiss Enid Love toured the U. S. on a fact finding\ntrip launched by the BBC. On her return she was ap¬\npointed head of the BBC’s special schools service.\nRight through 1956 plans were laid to begin educa¬\ntional telecasts during the fall of 1957.\nIn harness with the BBC are advisory committees\nand joint educational bodies and, of course, a long\nand distinguished record for sending lessons to schools\nover radio. The weight of this machine will be\nbrought to bear on the problem when the time arrives.\nBut in April of this year commercial TV is going\nto launch its own service. This was announced almost\nas an after-thought by the chairman of the company\nwhich had incurred extremely steep financial losses\nwhile pioneering private-enterprise TV in England.\nThe intention is to send out science, geography\nand history programs three months from now. There\nwill be an experimental schedule during the early\nafternoon when the commercial screen is not other¬\nwise filled.\nOne immediate reaction came from Sir Eric\nJames, headmaster of the Manchester Grammar\nSchool, who said, “A TV set for listening to the BBC\nor its rival will enter my school over my dead body.”\nBe sure to route your Newsletter to other staff\nmembers so all may know about NAEB and national\ndevelopments in the educational broadcasting field.\nPage 4\nNEWSLETTER"
}