{
  "id": "d1785-6",
  "text": "AWARDS\n► CBS Foundation Inc., announces the establish¬\nment at Columbia University in New York a group\nof 8 one-year fellowships beginning this September\nfor eligible persons in news and public affairs in\nthe radio-TV field. Applicants can be regular mem¬\nbers of non-commercial broadcasting stations licensed\nto colleges and universities who engage a large por¬\ntion of their time in news and public affairs. Teach¬\ners of courses in radio-TV news and public affairs\ntechniques at colleges and universities are also eligible\nInterested persons should write to William C. Ack¬\nerman, Executive Director, CBS Foundation Inc.,\n485 Madison Avenue, New York 22, New York.\n► Opportunities for American graduates to study\nin Switzerland during 1957-58 have been made avail¬\nable by Swiss universities, societies, and the Ameri-\ncan-Swiss Foundation for Scientific Exchange. Ap¬\nplication is open to U. S. citizens, preferably under\n35, with a bachelor’s degree, good academic record,\nand a working knowledge of French or German.\nFor further information write to The Institute of\nInternational Education in New York City.\n^ The Institute of International Order, a non¬\nprofit organization dedicated to the support of the\nUN, is offering prizes for 15-minute radio programs\npromoting greater understanding between people and\nnations. A radio station and a community orga¬\nnization must cooperate to build this program, which\ncan take any form. This year the Institute is of¬\nfering two special awards of $25 to college stations\nfor the best programs on contributions students\nand schools can make to world peace. For further\ninformation write::\nThe Institute for International Order\n11 West 42nd Street\nNew York 36, New York\n► WGBII-TV-FM and WBUR-FM announced\nscholarships and assistantships they have available to\nthe School of Public Relations and Communications\nat Boston University. WGBH-TV-FM is offering\nten TV and one radio scholarships for $1000 each\nfor a year’s advanced study in broadcasting. WBUR-\nFM is offering an $1800 assistantship for one-year’s\nadvance study in radio.\nApplicants must have a bachelor’s degree to be\neligible. Write to: Melvin Brodshaug, Dean, Boston\nUniversity, School of Public Relations and Commu¬\nnications, 84 Exeter Street, Boston 16, Mass. Dead¬\nline for applications is March 15, 1957.\nNEWS OF MEMBERS\nGENERAL\n^ Burton Paulu’s study of TV-radio in the United\nKingdom, British Broadcasting, was mentioned in\nthe January 12th TV Digest. Saying he refuted the\nbelief that the “Third Programme” has elevated\nBritish cultural taste, the notice praised Dr. Paulu’s\nwork. Among the. quotes: “It is not possible to\nprove that a monopoly like the BBC can raise\nthe level of public culture any more successfully\nthan can a competitive commercial system like that\nof the U. S.”\ny WUOM, University of Michigan, received a\nletter from Chang Jun Yu, secretary to Syngman\nRhee, expressing the Korean president’s appreciation\nto Miss Edythe M. Albert “for her part in interesting\nMichigan children in Korea and our music.” The\nletter stems from Miss Albert’s work in “Michigan\nFestival of Song,” an educational series for Michigan\nschoolchildren prepared by WUOM and carried\nthroughout the state. This year’s festival included\na Korean folk song.\ny Michigan State University radio, WKAR and\nWKAR-FM, received a public service award given\nby the National Safety Council for exceptional ser¬\nvice to farm safety. The presentation marked the\nthird M.S.U. Radio has received the award.\nWUNC-TV, North Carolina State College, also\nreceived a public service award from the National\nSafety Council for farm safety. In addition, the\nstation collected an award from the Veterans Ad¬\nministration in appreciation of a series of VA pro¬\ngrams aired by WUNC-TV over the past several\nmonths.\n^ Sacramento State College has recently begun a\nfull-scale experimental program in TV. For the past\ntwo semesters, the college has been presenting over\nlocal stations several series of TV programs showing\nthe growth of the institution in the past 10 years\nand giving the community an overview of courses\nand procedures at Sacramento State. Future plans\nfor the experimental program include a continuation\nof the successful “SSC Campus Roundup,” and a\ntentative programming of a telecourse for credit.\n^ University of Alabama Prof. Wade Coleman will\nreceive the Palmes Academie award early in Febru¬\nary from the French government. Arrangements are\nbeing made for the presentation to be made on one\nPage 6\nNEWSLETTER"
}