{
  "id": "d733-103",
  "text": "- 96 -\n3. Activating a state-wide system of expanding educational\ntelevision for use at college level education.\nAt this writing the New York State Legislature had not passed upon\nthese recommendations, but the New York Department of Education had\nincluded $577*700 in its I96I-62 budget request to continue the various\neducational television projects already being carried on.\nThere have been other regional and local efforts to develop broad¬\ncast television for educational and instructional purposes in New York.\nThe Rochester Area Educational Television Association was organized\nin 1956 \"by the Board of Regents to construct, own, operate, and maintain\nnon-commercial education television and radio stations within the Monroe\nCounty. In I96I, the Rochester Area Educational Television Association\nfiled a request with the Federal Communications Commission for the drop-\nin and reservation of Channel 13 in the area for the use of education in\nthat community. In its petition, the Association said:\n’’Through the efforts of the Rochester Educational Television\nAssociation the people of the eleven-county Rochester area\nhave become aware of the incalculable benefits which non¬\ncommercial television could bring to Rochester, and they have\nbecome more and more vocal in expressing the need and desire\nfor an operating VHF educational television station. The\ncommunity interest is present, the educational need is acute,\nand the three-year record of experience of RAETA is clear\nevidence that a reserved Channel 13 is both practical and\nfeasible. The opportunities for enrichment, stimulation and\nchallenge through educational television programming is\ntremendous both in the schools, and, perhaps, more importantly,\nin the homes of this large area. It would, indeed, be most\nregrettable if this last and golden opportunity to provide\neducational television service to over a million persons in\nthe eleven-county Rochester area were lost through failure\nto reserve Channel 13 for educational use.”\nThe Federal Communications Commission denied this petition, and\nruled that a third commercial outlet in the VHF band was more important\nthan an educational station with compatible service. The educational\ncommunity immediately started proceedings to appeal this decision.\nIn the Schenectady-Albany area there exists the Mohawk-Hudson Council\non Educational Television. This Council includes eight colleges and 50\nschool systems. It has requested and received an additional UHF channel\nassignment to that area and hopes soon to have one or both of the reserved\nchannels assigned to that area activated.\nThe Western New York Educational Television Association in Buffalo\nhas Channel 17 on the air. This was one of the original channels reserved\nfor education in that area. Local associations achieved its activation."
}