{
  "id": "d733-104",
  "text": "- 97 -\nAn application has been filed by the school districts adjoining Buffalo\nfor an additional station and they expect to go on the air in the near\nfuture.\nSyracuse does not have an active station, though it has a UHF reser¬\nvation. Syracuse University, a leader in the field of television\ninstruction and research, and in the production and development of educa¬\ntional programs, is at this writing exploring the possibilities of\nsponsoring a drop-in VHF channel. It has an application pending now with\nthe Federal Communications Commission. The University is also planning\nto work cooperatively with the Syracuse Board of Education in constructing\nand operating an educational station on a UHF reserved channel in that\narea.\nDr. Kenneth G. Bartlett, Vice President of Syracuse University,\nsays:\n\"Syracuse University has every confidence and expectation\nthat educational television will constitute a very important\npart of the educational program for all individuals of all\nages in the near future. This community, therefore, not\nonly needs a UHF station but the educational organizations\nwithin the community must continue as they have in the past\nto utilize the channels of the commercial stations whenever\npossible.”\nOne of the most inhibiting factors in the development of broadcast\ntelevision in the down-state New York City area has been that no VHF\nchannels were available in this huge metropolitan area, which has a\npotential audience of between 23 and 24 million people. The VHF channel\noriginally allocated to New York, because no channels in the VHF range\nwere available at the time of the reservations, has been practically use¬\nless as a prime broadcasting station for educational services. This is\nbecause the area total service is in the VHF band and, therefore, prac¬\ntically all the receiving capabilities in the area are tuned only for\nVHF reception.\nArrangements recently have been made to purchase Channel 13 in the\nNew York city area for educational television purposes. If this purchase\nis consummated, it will be a large step toward the development of a\ntotal broadcast service for this area. In addition to this effort, the\nFederal Communications Commission is conducting an extended experiment\nwith a special UHF station to see to what extent UHF can be adapted to\nlarge city usages where unusual amounts of physical and electronic inter¬\nferences exist. From these two efforts may come a totally new kind of\nprogress in the development of educational and instruction development\nof television in the New York city area.\nIn summation, the future needs of New York as reflected in the\nsurvey, in addition to the presently reserved channels, are for a mini¬\nmum of 36 UHF channels to supplement the educational and instructional\nservices throughout the state. The survey indicates also that such\nlarger areas as Rochester, Syracuse, Buffalo, and northern New York State\nneed to be provided with VHF facilities of it is at all possible technically."
}