{
  "id": "d733-106",
  "text": "- 99 -\nIn Charlotte Channel 36 went on the air on September 5, 1961. It\nwas licensed to operate primarily as a commercial station, but at this\nwriting it is devoting its entire program schedule to in-school and edu¬\ncational broadcasting in cooperation with Mecklenburg County Public\nSchools. This program service is expected to continue and perhaps\nincrease. The schools are picking up the in-school and general programs\noriginating at Channel 4 in Chapel Hill, and in addition are producing\nlocal programs to meet specific needs.\nThe State Department of Public Instruction in North Carolina issued\na statement that says:\n\"As is true throughout the country, Carolina is faced with\nan exploding school population. Numerous steps are being\ntaken to provide quality education for this tremendous\nincrease in students. Instructional television has proved\nitself in North Carolina as a teaching tool and increased\nuse is necessary to help meet the increased needs of educa¬\ntion. Recommendations have been made by the State Board of\nEducation to strengthen and increase the present use of\ninstructional television in the public schools, and to\nexpand broadcast facilities. Most certainly additional\nfacilities should be made available for educational pur¬\nposes. Because television is the most powerful communica¬\ntion medium yet devised by man, it follows that a substantial\nprotection be provided for Its use in and by education.\"\nThis survey of North Carolina clearly indicates the acceptance of\ninstructional television in the schools and colleges and in the communi¬\nties of North Carolina, and that the present reservations are inadequate\nto meet the needs and the planning for further expansion there. The\nevidence suggests that, in addition to two VHF channels in the eastern\npart of the state, a total of 27 additional UHF channels be made avail¬\nable to North Carolina, for purposes of instructional and educational\ntelevision.\nNORTH DAKOTA\nNorth Dakota is a large, very sparsely populated state. There are\nno major population centers in North Dakota. The two largest areas,\nFargo and Grand Forks, are in the extreme eastern part of the state on\nthe Minnesota border. The size of the state and the sparsity of its\npopulation present a particular problem in the equal distribution of\neducational opportunities and facilities. In the public schools scattered\nin the small towns and the rural areas throughout the state are 130,000\nstudents. There are 11 colleges and universities in North Dakota, with\na total enrollment of approximately 14,000.\nDr. M. F. Peterson , Superintendent of Public Instruction of North\nDakota, said:\n\"The people of North Dakota are progressive, and they see\nthe need for educational television. Efforts are now in"
}