{
  "id": "d733-111",
  "text": "- 104 -\nthe entire state. The administration of educational television directed\nby the Oklahoma Educational Television Authority, a state Authority\nestablished by legislative action several years ago.\nMost of the initiative for educational television in Oklahoma\nderives from the Educational Television Authority, and from the\nOklahoma City Public Schools. The basic channels - 13 and 11 in\nOklahoma City and Tulsa - are concerned principally with adult and\ncommunity education, but make available direct instruction and supple¬\nmentary instruction to schools desiring to use it.\nChannel 25, which is owned by the Oklahoma City School System,\ncarries a heavy load of instructional in-school television and has been\nvery successful, not only within its own system, but in its sharing of\ninstruction with neighboring systems and through the exchange of facili¬\nties.\nSurvey responses from various sources in Oklahoma indicate that\nthe colleges and universities, aside from those actually operating or\nengaged in the operation or programming of the stations, have little\ndesire for participation in instructional television. This apparent\napathy could stem from the physical circumstance that many of the insti¬\ntutions are outside the range of either Channel 11 or Channel 13.\nThe school systems have shown a great deal of interest in, and\nhave developed a great deal of use for, instructional television but\nthe sources for in-school television are limited generally to the\nOklahoma City School System and its neighboring districts.\nDr. E. F. Bryan, of the Oklahoma Department of Education, says\nthere is need for educational television in Oklahoma and that demands\nfor it are increasing as teachers and parents become more aware of the\npotential of using television for instruction. Present needs are greater\nthan can be financed, he says, but increased funds for instructional\ntelevision have been requested from the state legislature, with slightly\nmore than $550*000 requested for the next two-year period.\nDr. Bryan sees a need for more channels throughout the state and\ngreater power, and for additional equipment. The Oklahoma City station\ncovers only a radius of about 90 miles and the Tulsa station a radius\nof only 50 miles. This is inadequate even from the standpoint of a basic\nservice for the greater part of the Oklahoma area.\nA number of the educators interviewed in Oklahoma said that in their\nopinion advent of federal funds for the development of educational tele¬\nvision facilities would spark the addition of local funds, and make pos¬\nsible the development necessary to meet the indicated needs.\nIt is difficult to project on the basis of survey responses alone\na total need for channels in Oklahoma, because of the particular state\nof development they reflect. There is evidence to indicate that there\nshould be at least two additional VHF channels in the state (one in"
}