{
  "id": "d733-113",
  "text": "local educational television channels are expected to come within the\nnext ten years from eight to twelve additional school districts in the\npopulation centers,\nOregon has made a rather impressive start toward developing a high-\nquality television service for its citizens, and for all levels of formal\neducation within the state. The backing of the state government and the\ncooperation between the two levels of education in the state is expected\nto continue* Simple mathematical extension of the projected plans indi¬\ncates Oregon will need a minimum of 17 additional channels for educational\nand instructional television.\nPENNSYLVANIA\nPennsylvania has six large metropolitan areas with populations over\n100,000 and 2b small areas with populations over 50,000. Two-thirds of\nthe people live in metropolitan areas.\nPennsylvania has 121 colleges and universities with an enrollment\nof approximately 190,000. Its public school enrollment is approximately\n1,900,000. It has three educational television stations on the air. Two\nchannels reserved for education are not yet in use. Stations on the air\nare Channel 35 in Philadelphia and Channel 13 and 16 in Pittsburgh. An\napplication by Pennsylvania State University to the Federal Communications\nCommittion for an additional VHF channel has been dismissed by the\nCommission.\nPennsylvania State University writes:\n\"Our interest in broadcast television is chiefly as a means\nof extending the facilities and services of our University\nto the people of the Commonwealth of Pennsylvania, Tele¬\nvision broadcasts would be used to strengthen and extend\nour agricultural extension and continuing education programs\ninto many areas. It is possible in the future that we may\nneed to use broadcast television for formal courses of\ninstruction also. Through the use of a broadcast facility\nwe also hope to provide high-quality educational programs\nto the people of central Pennsylvania by linking up with\nthe educational television stations in Pittsburgh and\nPhiladelphia, and with the NETRC in New York.\"\nIn its application to the Federal Communications Commission for a\nVHF channel with high power and long range in central Pennsylvania the\nState University said:\n\"The establishment of an educational television station,\nusing Channel 3 with its transmitter and tower on Rattlesnake\nMountain near the University, would provide a key section,\na central link, for a state-wide educational network. Such\na station could be linked on the west with Pittsburgh and\nthrough Harrisburg and Lancaster to Philadelphia, thus an"
}