{
  "id": "d733-116",
  "text": "- 109 -\na great degree, by television programming. And if, as indicated, the\nstate colleges soon may not be able to accept all applicants, instruc¬\ntional television programming of college courses could lessen this\nproblem considerably.\nDr. Walsh says the Commission to Study Higher Education in Rhode\nIsland reports that school enrollment will increase by one-third within\nthe next 20 years and that by 1980 the college-age population in Rhode\nIsland should increase 82$ over what it was in 1958.\nDr, Walsh says indications are that not enough teachers will be\navailable to meet these challenges to education, and that assignment of\nUHF or VHF channels should be made with regard to the reception poten¬\ntial of the area. He points out that Rhode Island is a VHF area and now\nhas a UHF allocation for educational purposes. He feels this should be\nremedied.\nThe evidence shows that this small state, with its multiplicity of\nproblems equaling those of much larger communities, would be helped\nsignificantly by a VHF allocation which could be used by the State\nDepartment of Education, and, possibly in conjunction with the present\nUHF channel, used strictly for in-school programming. An-.additional\nUHF channel, making a total of three channels for Rhode Island, should\nalso be available in the years ahead.\nSOUTH CAROLINA\nSouth Carolina has four large centers with populations over 100,000\nand nine small centers with populations over 50,000. This population is\nwell distributed. It has 26 four-year colleges and universities and\nfour two-year colleges with a total enrollment of approximately 31,500.\nThe public school enrollment is approximately 600,000.\nSouth Carolina has four television channels reserved for education,\nbut none of them is in use. It has been in the process of developing a\nclosed-circuit television system. The state educational television pro¬\nduction center in Columbia sends programs over the leased facilities of\nthe common carrier to 31 high schools in 11 counties. The General\nAssembly at the 1961 session authorized the South Carolina Educational\nTelevision Center to extend its services to a total of 52 schools in 21\nof the state’s 46 counties. Despite this expanding operation, the\ngeneral manager of the South Carolina Center writes:\n\"As you make your survey of educational television needs I\nwould like to express the needs of South Carolina as they\npertain to frequency allocation. We anticipate the need\nfor UHF service in the following cities: Conway, Andrews,\nMoncks Corner, Charleston, Waterboro, Beaufort, Hampton.\nSt. George, Kings Tree, Lake City, Marion, Bennetsville,\nFlorence, Sumpter, Orangeburg, Blackville, Aiken, Saluda,\nv Greenwood, Clinton, Chester, York, Gaffney, Spartanburg,\nGreenville, Clemson, Walhalla, and Anderson. I believe\n4"
}