{
  "id": "d733-121",
  "text": "- 114 -\nand Chattanooga, and in the central-western portion of the state), at\nleast 17 additional channels will be needed in Tennessee.\nL,\nTEXAS\nTexas has 12 centers of population of over 100,000 and 12 smaller\ncenters of over 50,000. Most of the population is concentrated in the\neastern half of the state, and the bulk of it is located in the metro-\n®reaSo These areas run in a line from north to south, from\nFalls trough Fort Worth, Dallas, Austin, San Antonio, down to\nthe Corpus Christi area on the Gulf.\nTexas has 56 institutions of higher learning with a total enrollment\nf \"PPTimately ^33*000 and a public school enrollment of more than\nt-y OOOj 000«\nEighteen television channels are reserved for education in. Texas. Three\nof these channels have been activated and a fourth, in the San Marcos\narea between San Antonio and Austin, is now in the process of being acti-\nDr.\nwrites:\nLee Wilborn, Assistant Commissioner of Education for Texas,\nOur needs for educational television service in the next ten\nyears are much stronger than I have indicated in the formal\nresponse to your questions. School Superintendents throughout\nour state are planning for some type of television service in\nalmost all meetings I attend. For example, in Denison the\nschool administrators of that section of our state were having\na meeting with Channel 13 representatives from Dallas planning\nto microwave the Channel 13 educational programs into the north-\ncentral section of the state.\n\"When our new station, Channel 9, goes on the air in the Austin-\nSan Antonio area, we have already had approaches from superin¬\ntendents in the Laredo area asking that we microwave our programs\nto them. In this central Texas area round Channel 9 we will have\n13 colleges and universities along with 26 public schools in the\ncoverage area.\ntp3t overorowaed classrooms throughout the\nstate, three to four thousand qualified teachers lacking each year, and\nnrohlfm^+w Sh£T! °utstacdiD6 teachers and professors are some of the\nI b® V?Stly imProved the use of broadcast television.\n“ S0h°01 °mcials confirm this feeling and most new\nschool buildings are prepared for television reception.\nThe University of Corpus Christi says:\n''At the present time we do have situations in our curriculum\nand our facilities which would be greatly helped by the use"
}