{
  "id": "d733-122",
  "text": "of broadcast television. It is for this reason that we\nare definitely interested in the possibility of educa¬\ntional television for Corpus Christi and that we are\npursuing our agreement with the Corpus Christi Caller-Times\nand joining in their application for television Channel 3,\nWe also see definite future needs caused by increased\nenrollments and facility shortages which can be met by the\nuse of broadcast television. We believe very definitely\nthat television space should be reserved for the future use\nof the University of Corpus Christi, and for the institu¬\ntions in south Texas.”\nDr. A* B. Martin, President of Amarillo College, writes:\n\"We are using closed-circuit television on our campus. We\nhave a television studio equipped with two vidacon camera\nchains and the necessary equipment; in addition, we have a\nmicrowave outlet to Channel 10 here in Amarillo. Each\nmorning we are broadcasting a televised credit course on a\nprogram known as Sunrise Clasroom. We are looking to\nbroadcast television to aid in the development of our\nadult and evening college programs. Broadcast television\nwould also help us to serve the increased enrollment we\nexpect, and to make effective present instructional tech¬\nniques to larger groups.\"\nThe University of Houston issued the following statement:\n\"In addition to our own college courses, KUHT has brought\nto Houston the most comprehensive adult education program\nthat has ever been achieved here by any means. Recently,\nthe public schools entered the picture with substantial\ntime requirements in potential conflict with our needs at\nthe University. Each of these three activities will need\na separate channel in the very near future, and by the\ntime any actions can be taken two of them will need more\nthan one channel.\n\"It is our firm belief that the greatest single aid to\neducation within the power of the Federal government would\nbe the reservation of a considerable section of the tele¬\nvision broadcast spectrum, probably more than anyone is\nthinking about at this time. At this time of re-appraisal\nand perhaps expansion of the channel pattern, it is vital\nto the states and to the nation that the term 'public\ninterest' be brought back into its intended vigor from\nthe desuetude into which it has lapsed during the 35 years\nof commercial broadcasting. True public interest calls\nfor the federal government to reserve the potential for\nmultiple-channel public communications in all areas of\neven moderate population density.\""
}