{
  "id": "d733-127",
  "text": "- 120 -\nspecific needs of autonomous school districts. Dr. Vail suggests that\nthere are 11 areas which should specifically he served with multiple\ntelevision broadcast facilities and his selections are approximately the\nsame as those made by the coordinating council and the institutions of\nhigher learning.\nCedar City is one of Utah's most isolated communities in relation\nto major population areas of the state. Mr. Ianthus Wright, Superintendent\nof the Iron County School District, which centers in Cedar City, writes:\n\"For several years we have been interested in educational\ntelevision, even though at present there is no channel into\nour school district. Our interest has been great enough\nthat we have sent delegates of parents, school board members,\nand teachers into Utah, and the surrounding states, where we\nhave learned that good educational television programs are in\nexistence. As a result of these studies we feel that there\nare tremendous possibilities of improving our curriculum by\nthe use of educational television, particularly so in the\nsmall schools of this rural area. At the present time we\nhave on the planning board a new high school for Cedar City\nand have planned facilities to take care of television when\nit comes. We urge that sufficient television channels be\nreserved for rural areas of Utah in order that they may take\nadvantage of these educational facilities.\"\nThis same type of communication was received from six other rural\ncounties in Utah.\nAssessment of the information, experience, and projection of planning\nin Utah, shows need for VHF channel reservations in Cedar City, Price,\nProvo, Richfield, and Vernal. These communities already have VHF channel\nallocations which are unreserved. The need is to reserve these for edu¬\ncational purposes in these areas to establish a prime state system of\neducational broadcasting. In addition to this need, and for the projected\nmultiple channel needs, a minimum of 2k additional UHF channels will be\nrequired for Utah.\nVERMONT\nVermont, a relatively small state, has only two centers with a popu¬\nlation in excess of 50,000. It has 18 colleges and universities with a\ntotal enrollment of approximately 9,000, and a public school enrollment\nof approximately 70,000. There is one UHF channel, xn Burlington, reserved\nfor educational purposes.\nDr. A. John Holden, Jr., Commissioner of Education, says:\n\"We have instructional needs which could be satisfied or\nenlarged by the use of broadcast television in such subjects\nas art, music, elementaty science for schools and rural areas"
}