{
  "id": "d733-128",
  "text": "- 121 -\nwhere special teachers are unavailable; advanced high school\nsubjects such as art, mathematics, economics, especially for\nsmall schools and rural communities. There is need for\nprograms for teachers, especially in the new mathematics and\nmodern foreign languages for elementary teachers. We already\nhave s severe shortage of teachers, especially in foreign\nlanguage, mathematics, and science. We believe the national\ndemand for teachers in these areas will create a mere acute\nshortage in rural communities of the future. There will be\nan increasing need for the reeducation and extended education\nof adults as automation and mechanization increase. As our\npresent civilization becomes more complicated and the problems\nof international relations become more complex, the need of\nexpanded programs of information and education will be imper¬\native. Educational television is one medium that will assist\nin meeting these needs, and sufficient channels should be\nreserved to provide for such needs. The University of Vermont\nhas a grant for a survey of the educational television needs\nof the state to activate one or more stations for Vermont.\nOur future extension will depend upon the results of this\nsurvey.\"\nThe University of Vermont reports it is now using closed-circuit\noperation in the medical college. In addition, it broadcasts regular\nprograms on the local commercial station. These include a daily agricul¬\nture program, and at least one course for college credit. Under a Ford\nFoundation grant, the University is surveying the state and developing a\nstate plan for educational television. The University hopes to pick up\nChannel 16, which is reserved for education in Burlington, and to operate\nit for the benefit of the educational institutions in the area.\nWith this information, and on the basis of the engineering survey,\na comparative projection indicates a minimum need of seven additional chan¬\nnels for education in Vermont.\nVIRGINIA\nVirginia has four large centers of population of over 100,000 and\nsix areas of population over 50,000. It has 1*3 institutions of higher\nlearning, serving approximately 54,000 students, a number projected to\nincrease by 1970 to 95/000. Public school enrollment is approximately\n800,000. *\nIn 1959/ the Governor appointed a commission to study the feasibility\nof educational television. Members of this commission recommended a\nbudget of $250,000 to establish the commission with a director and a pro¬\nfessional staff: *\n.To provide matching funds to localities presenting course\nwork via commercial stations; to develop programs for state¬\nwide distribution; to proceed with engineering studies of"
}