{
  "id": "d733-130",
  "text": "- 124 -\nteachers in the surrounding school systems to classroom utilization of\ntelevision* Considerable interest is evidenced in the Arlington-\nAlexandria area in the establishment of the school station in Washington,\nD.C, through the Greater Washington Educational Television Association\n(GWEIA).\nDr. Woodrow Wilkerson, State Superintendent of Public Instruction,\nsays:\n\"We see a growing interest in Virginia in the use of television\nfor instructional and educational purposes. This year 224\ndistricts report participation in educational television\ncompared to approximately 150 last year. 39 subjects are\nbeing offered compared to approximately 24 last year. Tele¬\nvision is being used primarily for supplemental, motivation,\nand enrichment.\"\nVirginia is getting a dual start in instructional television in the\nNorfolk-Hampton Roads and Alexandria-Arlington areas. Indications are,\nconsidering the needs of the rural areas, especially those in the central\nand western parts of the state, that the rest of the state will follow\nsuit with state level support. Information received from the schools and\nthe institutions of higher learning, dependent upon the financial feasi¬\nbility of such service being made available to them, affords a basis for\nprojecting a minimum need for educational channels. Contemplating the\nmultiple channel needs for instructional purposes that are becoming\nevident in the eastern part of the state, and proper service to the\nRichmond area and the smaller communities and rural areas, a minimum of\n22 additional channels will be required in Virginia to serve the needs\nof education.\nWASHINGTON\nWashington has six large centers with population of over 100,000 and\nsix small centers with population of over 50,000. It has 24 four-year\ncolleges and universities and nine two-year colleges with a total enroll¬\nment of approximately 60,000, Its public school enrollment is approxi¬\nmately 570,000.\nWashington has nine channels reserved for education which have not\nyet been activated, and two stations on the air — Channel 9 in Seattle,\n(operated by the University of Washington), and Channel 56 in Tacoma\n(operated by the public schools).\nDespite difficulty in television transmission between the western\npart of the state where the bulk of the population lies, and the eastern\nareas, plans for state-wide television for educational television to the\nextent that it is feasible are reported. However, the survey found no\norganized state plan nor unanimity of opinion as to how educational tele¬\nvision should expand in the state."
}