{
  "id": "d733-137",
  "text": "\"Since 1957 our schools have made a careful study of the\neffectiveness of television in both our instructional\nand supervisory program. The results of our study have\ncaused us to modify and expand the use of television\nfrom year to year. Next year, for example, we anticipate\nusing approximately 750 telecasts. Presently, approxi¬\nmately 50,000 pupils in our schools receive some\ninstruction via television; all our teachers receive some\nsupervision by television. This latter provision enables\nour supervisory staff to serve many more teachers than\nthey could possibly do by conventional procedures\nalone — to mention only one advantage of television.\nMIn the interest of public education, I would strongly\nurge that adequate spectrum space be allocated for edu¬\ncational television to enable schools to advance in their\nuse of this medium.\"\nMonsignor Edmond J. Goebel, Superintendent of Schools of the\nArchdiocese of Milwaukee, says:\n\"Our Catholic schools in Milwaukee have an enrollment of\n94,246 in the elementary grades and 14,000 in the high\nschools. We have requested more time on the educational\ntelevision station, but station WMVS-TV does not have\nadditional time available to serve our children properly.\nWe must offer more broadcasts.\"\nIn the general survey 90/0 of the schools responding from Wisconsin\nindicated they either were using broadcast television, or had definite\ninstructional needs which could be met by the use of broadcast television\nif it were available to them.\nThe Superintendent of Public Instruction was not optimistic about\nthe implementing of state plans, or rather implementing the plans for a\nstate network of educational television. But survey responses indicate\nneeds in Wisconsin are pressing toward increased use of broadcast tele¬\nvision on all levels of education. It state-wide educational and instruc¬\ntional television is accomplished in Wisconsin, and if the needs found\nevident in Milwaukee and Madison are projected, the future educational\nservice in Wisconsin will need a minimum of 36 additional channels.\nWYOMING\nWyoming has no large centers of population. In only one area does\nthe population total as much as 50,000. It has five colleges and univer¬\nsities with a total enrollment of approximately 6,700. Its public school\nenrollment is approximately 75,000.\nWyoming has one educational television reservation, at Laramie in\nthe southeast. This is a VHP channel. It has not yet been activated."
}