{
  "id": "d733-144",
  "text": "- 139 -\nThese approximate average coverage radii were arrived at through\nconsideration of many factors including:\na. Maximum powers and heights specified for various sections of the\ncountry in the Commissions Rules\nh• Co-channel interference\nc. Terrain effects\nd. Types of ETV stations constructed to date\ne. Propagation characteristics of various frequency bands available\nThe reported work of the Television Allocation Study Organization* * in re¬\nlation to the \"critical distance\" of television coverage at the present\nstate of the art was also relied upon in developing these ranges. 2h\ngeneral it was assumed that VHF educational outlets might well use the\nmaximum effective radiated powers available under the Rules at heights up\nto and in some cases exceeding 1,000 feet above average terrain. The\ntypical educational UHF station was projected as one which might.utilize\na 12-kilowatt transmitter, a moderately high gain antenna and a supporting\ntower, or other means of achieving an effective antenna height of 600 feet\nIt 40 recognized that the radii assumed are conservative in some cases\nfor very flat terrain and optimistic in cases of very rugged terrain. In\nthe latter instances it has been assumed that translators will have to be\nused to achieve the coverages indicated and that additional channels will\nbe available for such use. However, no effort has been made in developing\nthis national pattern to relate these details with specificity, example\ngf-gudetailed, state^tudyT-however, has-been'Included^in appendix material-'\nill ustrateH&io-f&eter. State-wide studies been undo*ilmn\nin Ohio, Maine, Kansas, Nebraska, Montana, Florida, Alabama, Wyoming,1\nNew Mexico represent further intensive approaches to the problem for which\nthis national set of requirements provides a point of departure.\nThe additional channels recommended in this study are considered for\npurposes of illustration on maps to be located at the center of the commu¬\nnity for which the assignment is listed. Such a location would rarely be\nthe case in practice, however, because line-of-sight transmission is im¬\nportant, particularly in the UHF range. Great reliance must be placed for\nthe future of educational television in the UHF portion of the spectrum.\nThis again illustrates the ultimate need for detailed engineering planning,\nprobably on a state-by-state basis, when a national pattern is established.\n* Television Allocation Study Organization, George R. Town, \"Engineering\nAspects of Television Allocations\", Report to the Federal Communications\nCommission, pp 1-731; March 1959 and Vol. II, pp 1-210; June, i960; see\nalso IRE Proceedings - TASO Issue, June, i960."
}