{
  "id": "d733-145",
  "text": "- lAo -\nL,\nTBLEVJBIOH CHAMMEL REQUIREMENTS\nTable presents a detailed brakdown of the existing FCC Table of\nAssignments, together with channels recommended for addition to the re¬\nserved category as a result of this study. Table 8 is a state-by-state\nsummary of these recommendations.\nFigs. 1 through k show the existing and recommended reservations\nwith their possible coverage areas. The multichannel recommendations\nare indicated by channel numbers given at the center of the coverage\nareas. Referring to Figs. 3 and k, a limitation of the plan in dove¬\ntailing with the Table of Assignments is noted. Holes in the area-wide\ncoverage proposals for Arizona, Nebraska, Utah, and certain other in¬\nstances are due to lack of original assignments to some sparsely popu¬\nlated areas. In cases where such coverage should become necessary in\nthe future as population growth continues, such needs might be handled\non a drop-in basis. State studies of record have successfully incor¬\nporated this procedure in their planning.\nAppendix material attached hereto illustrates certain detailed state¬\nwide studies. It is estimated that as many as 100 more \"drop-ins\" might\nbe deemed necessary in connection with state-wide specific planning, but\nthe inclusion of such a detailed analysis has been beyond the scope of\nthis national study.\nHi some cases in various states it has not been possible to meet\nthe indicated requirements set down by NAEB, particularly as regards\nmultiple service needs. This indicates the necessity for looking toward\nthe development of a more efficient UHF assignment plan. Some investi¬\ngations of this possiblity* have already been undertaken by the Federal\nCommunications Commission.\nUHF SPECTRUM CONSIDERATIONS\nThe limitations in UHF receiver interference rejection capabilities\nand the resultant necessity of assigning UHF channels within the require¬\nments of a rather comprehensive set of \"taboo\" restrictions, handicap\nUHF flexibility. In developing a state-wide UHF network system for\nChio, it became apparent that there was little flexibility and room for\nexpansion in the UHF within the constraints of the present assignment\nplan. The Ohio plan called for 29 UHF stations, with 9 of these in either\nthe relatively low power or translator class. While 8 channels were al¬\nready included in the reserved category, it became necessary to find 21\nmore. A search was undertaken on a new channel \"drop-in\" basis for these\nchannels. In only 9 cases, however, could the taboo requirements be met\nand restraints became increasingly numerous as these channels were\nsuccessively developed. In 11 cases reliance finally had to be placed\nupon nonreserved assignments in the Commission’s Table.\n*Arnold G. Skrivseth, Office of the Chief Engineer, UHF Project, Federal\nCommunications Commission, \"UHF Assignment Plan\", UHF-TV Report 5.2.2.,\npp 1-5; May 29, 1961."
}