{
  "id": "d733-15",
  "text": "- 8 -\nMoreover, there appear to be growing needs for more reservations\nin the UHF band to serve the needs for multiple channel assign¬\nments in metropolitan areas and to fill out the coverage pattern\nfor developing state-wide and regional educational television\nnetworks.\nMany channels will be required to serve future television in¬\nstructional needs and thorough planning should be done by edu¬\ncators in order to insure that these requirements are met. The\nFederal Ccmmunications Commission is under constant pressure\nfor channel space in a spectrum already crowded and pressure can\nbe expected to increase. Plans for activation of existing re¬\nserved channels and requests for additional channel space should\ninclude documentation that is as specific and definite as possible.\n\"Determination of spectrum space assignments will have to be made\nby the Federal Communications Commission on the basis of total\nneeds. In such considerations, it is imperative that the total\nneeds of education for specialized instructional services, net¬\nworking, and general cultural programming - present and future -\nbe articulated. It cannot be expected that the Federal Communi¬\ncations Commission should think these problems through and provide\nits own blue print for an adequate educational television service\nfor the nation. It is the educators, together with the pioneers\nin the educational television movement, who need to study the\neducational television requirements of the future. When needs\nare known, the proper technical planning can be done and the\nCommission can have at its disposal evidence in a form most use¬\nful for assisting in its spectrum space determinations.\"\nFunds were requested from the U. S. Office of Education under Part B\nof Title VII of the National Education Defense Act to support a program of\nresearch. The proposal was approved, and a contract was issued to the\nNational Association of Educational Broadcasters, effective January 1, 1961,\nto proceed with the survey."
}