{
  "id": "d733-18",
  "text": "- 11 -\nIn the conferences it was spelled out that the primary concern of the\nsurvey was with standard broadcast television. Consideration of closed-\ncircuit television in its various forms would be given only where it served\nto illuminate basic objectives of the survey, or when such attention could\nbe given incidentally without distracting from the primary effort. Survey\npersonnel were advised, however that consideration would need to be given\nthe possible future use of extra-terrestrial television broadcasting, as\nfrom airplanes or satellites, in those areas in which some knowledge has\nbeen accumulated.\nWith these understandings, the following over-all objectives were\nlisted:\n1. To determine within a reasonable approximation the needs of educa¬\ntion, on all levels, for television spectrum space during the next 10 to\n15 years, as a basis for determining an adequate system of educational\ntelevision channel allocations.\n2. To appraise the practical potential coverage of the present edu¬\ncationally reserved channels. From this base determine a table of assign¬\nments that will provide a comprehensive primary service to education,\nestablished to furnish a basic single national educational coverage com¬\npatible with the greatest receiving potential of each community.\n3» To determine, from the preliminary data, the variable needs of\nthe different localities for multiple channel use for educational purposes\nduring the next 10 to 15 years; and to support these findings with the de¬\ntermination of a system of allocations which can meet such needs as they\noccur.\nWith the consulting engineers, the staff mapped the distribution of\npopulation and educational institutions in relation to the present edu¬\ncational television assignments in each state. This was preliminary to\nobjectives 2 and 3* The consulting engineers proceeded in sequence from\nthis base of information.\nThe regional field consultants were called into conference and jointly\nbriefed on proposed objectives, methods, and procedures. It was determined\nto conduct the survey through the medium of the personal interview, with\na personal telephone interview as the first alternative. No questionnaire\nwas to be furnished the interviewee. Instead, the interviewer would en¬\ngage the data source in discussion, reporting and evaluating the results\nconcisely on a prepared form or, when special circumstances required such\ndeviation, in narrative form.\nDuring the survey it was impossible to interview some of the school,\ncollege, and agency administrators selected as data sources. These were\ncontacted by preliniary and follow-up correspondence. When needed, a list\nof questions to serve as a guide was sent to the respondents.\nThe survey central office contacted a significant sampling of all\nsizes of public school systems in the United States, the chief state school\nadministrators, the directors of operating educational television stations,\nand national agencies. It also helped field consultants to make contacts"
}