{
  "id": "d733-20",
  "text": "STATUS OF DEVELOPMENT\nDetermination of present and future needs of education for television\nmust, at least in part, be based upon the present development of the\nmedium in education, and upon the experience derived during its evolution.\nAs much a part of the development of educational television as the actual\nconstruction of stations has been the application of television to the\nvaried needs of education.\nIn an area where change does not come about rapidly, progress in\nadapting to this electronic tool in the eight years since the first educa¬\ntional television station went on the air has been a notable achievement\nin American education. So also has been the progress in construction and\nuse of facilities. Thirty three of the contiguous states and the District\nof Columbia now (October 1, 1961) have educational televison stations.\nMany of them are, in addition, using commercial stations for part-time\neducational programming. Of the 15 that do not now have educational tele¬\nvision, 11 either have developed state plans to establish it or have com¬\nmunities or schools that are planning individual stations.\nAn outstanding contribution of this achievement has been the general\nproof of the effectiveness and long-range economy of educational tele¬\nvision, and the emphasizing of the continuing and increasing need for\nfacilities in all areas of education.\nPractical development of educational television began in 1953 when\nthe University of Houston went on the air with the first station, KUHT,\nChannel 8. The following year eight more institutions and communities\nfollowed Houston's example. Their path was not an easy one. The seeming¬\nly large demands for original capital investment frightened many money-\npressed educators. Other needs for educational funds were many, and as\nyet there was little acceptance by the public of educational television.\nDespite these handicaps the medium continued to prove itself and to de¬\nvelop. Each step in this development has indicated the need for further\ndevelopment and additional use.\nIn the continental United States in October, 1961, there are 60\neducational television stations on the air. Of these, kO are Very High\nFrequency stations and 20 are Ultra High Frequency. Sixteen of the UHF\nstations are single outlets for educational television in communities in\nwhich the majority of the receiving facilities cannot receive them on\ntheir frequencies. As a result, their use for public service outside the\nschool or college is highly restricted. Two of the UHF stations are\nsecond channels in communities already served primarily by VHF stations.\nThese secondary, supplemental channels are used mainly for direct in¬\nschool instruction. (See map, Fig. No. 9)\nFour other communities have applied to the Federal Communications\nCommission for a second channel at the time of this writing, and several\nothers report that they plan soon to do the same."
}