{
  "id": "d733-23",
  "text": "operate closed-circuit television systems. All stations and\nsystems are exchanging programs.\"\nThe i960 Nebraska study emphasized the need for a state-wide network\nof educational television stations for the improvement of instruction and\nof educational opportunities in that state. Educational television for\nin-service teacher education is especially important in Nebraska, which\nhas approximately 6,000 teachers who lack college degrees.\nThe 1$60 Maine report on educational television said:\n\"The need for educational television in Maine is ample and evident.\nBy banding together in common educational purpose, it is possible,\npractical, and economical to provide television instruction which\nwill effectively serve educational needs.\"\nThe 1961 report of the Kentucky Legislative Research Commission\npointed out that lack of teacher competence and lack of specialized teaching\nmaterials are problems in Kentucky education which would be ameliorated by\neducational television, used cooperatively. The use of educational tele¬\nvision in Jefferson County, Kentucky’s largest community, was credited\nwith easing the impact of increasing school enrollment.\nThe i960 Kansas legislative report said, among other things:\n\"Wichita schools havebeen experimenting with television instruction\nfor the past four years. Wichita school administrators feel that\nthey have proved the value of educational television, both from\nthe standpoint of teaching effectiveness and economics.\"\nThe Education Commission of Atlanta and Fulton County, Georgia, in\nits 1961 report said:\n\"A certain capital outlay is, of course, required to introduce tele¬\nvision into a school system or colleges. However, over a period\nof time, if the television facilities are wisely and adequately\nused, they enable savings in terras of teacher time, and extended\nservices in other parts of the educational program. The ’multiple\nfactor* makes television especially helpful at a time of shortage\nof qualified teachers, The schools can retain or add hard-to-\nstaff subjects in their curricula.\"\nThe Governor’s Committee on Educational Television in Arkansas, in\nits 1961 report to the legislature, queried: \"If it is true that many\nschools do not have good and complete educational facilities, isn't it\npossible that a pooling of outstanding teaching talent from the various\nschools and colleges presented over an educational television station\nmight help alleviate the problem?\"\nIn New Mexico the Committee on State-Wide Television for Educational\nPurposes (STEP) in a March 1961 report stated:"
}