{
  "id": "d733-27",
  "text": "- 20 -\nThe only significant differences found among the various sources con¬\ncerned the means for providing educational television facilities. Com¬\nplete records of these differences were not kept nor was a complete com¬\npilation made of such collateral information gathered during the survey.\nBut the general reports of the various field consultants indicated a pre¬\nponderant attitude for tax support for such educational facilities,\nwhether for formal or informal instruction. There was indicated also a\ncloser working relationship Between the forces of education and the busi¬\nness and professional areas of the community in the development of com¬\nmunity television.\nIn the 48 contiguous states (Alaska and Hawaii have some special\nproblems) over 200 important and representative communities were queried\non the question of community needs for educational television. Respond¬\nents ranged from the heads of significant civic organizations to political\noffice holders, such as mayors and governors.\nResponses revealed major emphasis at the present time is on develop¬\ning educational television for specific use in the various areas of formal\neducation. Yet there is a wide-spread recognition of the needs of the\nvarious communities outside of the areas of formal education. The com¬\nmunities and the community leaders in at least 30 of the states indicated\nan active concern for educational television as a resource for meeting the\ninformal educational needs of the community. The law which established\nthe Alabama Television Commission states that the commission was organized\nfor the purpose of making the benefits of educational television available\nto and promoting its use for the inhabitants of Alabama. This principle\nis reflected in the attitudes of most of the communities and states which\nhave made an effort to provide educational television facilities.\nFor example, the Colorado legislature in i960, at the insistence of\nmany of its communities, made it possible for any county or city within\nthe state to use public or private funds, or a combination of such funds,\nto construct and operate television transmission facilities. In so doing\nthey removed the tax limitations on school and recreational districts for\nmoneys used for such purposes»\nThe governor’s Commission on Educational Television in Arkansas,\ncomposed of representative citizens of various communities in the state,\nrecommended to the governor and to the legislature that special legisla¬\ntion be enacted which would provide enrichment programs and adult educa¬\ntion for the general public. They underscored their recommendation with\na notation that, properly used, such a resource would tend to eradicate\nilliteracy.\nIn planning for a possible state network of educational television\nin Georgia, the Governor’s Conference on Education emphasized that:\n\"Continuing adult education is a necessity in today’s world, and educational\ntelevision can provide continuing adult education on the farm as well as\nin the city.\"\nThis feeling of a real need to bring basic and continuing education\nto the inhabitants of small towns and rural areas was reiterated in\nseveral different states."
}