{
  "id": "d733-29",
  "text": "- 22\nand national issues. \"Such an information channel is urgently needed,\"\nMrs. Patten emphasized.\nThese quotations and examples of public expression regarding the need\nfor full coverage in the states by educational television facilities indi¬\ncate the general response field consultants received in their interviews\nand contacts• The consultants reported no negative response in regard to\nthe need for community television facilities for general, continuing, and\nadult education. All reports indicated that the respondents felt that it\nwas only a matter of time until the presently allocated educational tele¬\nvision channels would be activated. In most instances the attitude re¬\nflected was that these would not be sufficient to meet the obvious needs\nof the years immediately ahead.\nA state-by-state mapping of the distribution of population shows\napproximately 200 metropolitan areas within the forty-eight contiguous\nstates. These are centers of population containing more than 100,000\npeople. They are not only marketing centers. They are centers of industry\nof education, of cultural development, and of social and political activity\nA study of the location of the presently active educational tele¬\nvision stations shows that only 56 of these nearly 200 metropolitan areas\nare now being served by educational television. Of these 56 metropolitan\ncommunities, 13 lack an effective community television service because\nthe active station is on a UHF channel and cannot be received with the\nmajority of receiving facilities in the community. Additional stations\nwhich will provide service for four more of these metropolitan communities\nare being activated.\nThere remain approximately 150 significant metropolitan communities\nin the United States which at the present time have no educational or com¬\nmunity television service. Study of the location of the presently re¬\nserved channels shows that most of these metropolitan communities could\nnot under the present circumstances expect to have any community service\nwithin the foreseeable future. A community television service cannot be\nbuilt upon a channel which is incompatible with the majority of the re¬\nceiving facilities of that community, and this is the circumstance in\nwhich these communities are.\nIn this situation are 21 key cities which have channel assignments\nnot compatible with the majority of the receiving facilities of the com¬\nmunity. Eleven of these 22 cities have already activated their UHF\nchannels, but because of this incompatibility they provide no significant\ncommunity service. The major use of these 11 UHF stations is for formal\neducation and in-school and specialized purposes. The other 11 key\ncities, observing the experience of their eleven sister cities see no\nprospect under existing circumstances of obtaining community television\nservice.\nThe 11 key cities which do not have an educational service and which\nat the present time cannot look forward to any general community educa¬\ntional service are: New York, Albany, Syracuse, Rochester, Cleveland,\nDayton, Indianapolis, Knoxville, Chattanooga, Los Angeles, and San Diego.\nThe 11 key cities which have active educational stations, but which cannot"
}