{
  "id": "d733-33",
  "text": "- 26 -\nthe various institutions made in the course of this survey substantiate the\nstatements and predictions of other reports, But the informed opinion and\ndefinitive statements of representative college and university administra¬\ntors lend an even more substantial basis to bare statistical tabulation.\nDr. Novice G. Fawcett, President of the Ohio State Uhiversity, wrote\na rather detailed reply to the question of needs. In part he said,\n\"In the survey of the needs of education for television spectrum\nspace, you are conducting an important undertaking which has\nvital implications for the educational establishment in this\ncountry, and I am happy to respond.\n\"Several of our people on campus have helped me to think through\nthis problem: Dr. Ronald Thompson, Executive Dean of Special\nServices, and author of ’The Coming Tidal-Wave of Students’, the\nfirst definitive study of the effect of successively increasing\nwaves of population on our educational institutions; Dr. Jackson\nRiddle, in the office of Instruction and Research, who holds\nmajor responsibility in the development of our University-wide\nprogram of instruction; and Richard B. Hull, Director of the Tele¬\ncommunications Center.\n\"Several things seem clear:\n1. The college and Uhiversity student populations will\ncontinue to grow. Dr. Thompson believes the enrollment catacly-\nism in higher education may well occur in the 1963-65 period,\nrather than in the 1970 *s, with a 50$ increase of the number\nof students entering college, posing new demands on educational\nresources already stretched to the limit.\n2. Every aspect of educational technology which holds\npromise in improving and extending educational resource needs\nshould be explored. Television appears to have high potential\nin this respect, and our exploration in this medium at Ohio\nState Uhiversity and in Ohio is already well under way.\n3. The electro-magnetic spectrum is already a crowded\nhighway. As the resident and extension student population\ngrows, and as new demands for instructional quality and content\nemerge, so will the demand for educational access to the tele¬\nvision spectrum grow and increase. One example: from 1957\nthrough 1961, instructional television enrollment for WOSU-TV\nincreased from 57^ to 59*080 students. Next year if new in¬\nstructional television demands on the Columbus campus alone\n(to say nothing of the four university branches) are to be\nmet, we shall need at least one additional television system.\nWhile the closed-circuit system might meet our campus needs,\nit does not answer the problem we face in the branches, or in\nthe programs of continuing extension education. This is 1961 --\nnot 19701\nh. The Ohio State Ifaiversity off-campus academic centers\nwere established to meet the needs of students during their"
}