{
  "id": "d733-35",
  "text": "- 28 -\nthink the use of television will be increasing over the next few\nyears.\"\nGeorge W. Starcher, President\nUniversity of North Dakota\n”We see an extremely bright future for educational television\nand a great potential for service to the people of our state.\nOur institution plans to use television in the future, not only\nfor formal instruction, but also for general extension educa¬\ntion. We have confidence in the future of UHF television and\nfeel that as more and more UHF stations come on the air, the\ngradual switching of all stations to this band may be the solu¬\ntion to the allocation problem. Educational institutions will\ncertainly make use of all channels reserved for them, given\nsufficient time, and if there is to be any change in the number\nof channels reserved, it should be an upward revision.\"\nOliver S. Willham, President\nOklahoma State University\n\"In North Dakota we are faced with a shortage of skilled teachers.\nFor instance, elementary teachers in this state can teach school\nwith only two years preparation. Television could help solve this\nproblem, if we could present a master teacher by television as an\nassociate teacher, working with a less prepared teacher. The\ncurriculum, and the teacher, and the teaching would be more effec¬\ntive .\n\"Television would also be important in providing service in\nspecial fields of education. Art and music, for example, in many\nareas has never been taught adequately. Physical education in the\ngrades has also been slighted. The reason of course is that in\nthe smaller schools the classroom teacher does everything. He\nhas not had a chance to be versed in everything. Television\nwould be a welcome assistance.\n\"The contribution most needed by television on the high school\nlevel is in the field of science and certain areas of the social\nsciences. The social sciences as they are being taught are\npretty much a dry, dull, textbook rehash. Social science needs\na shot in the arm, something to bring it alive.\n\"I definitely feel that the allocation of television channels\nstrictly for educational use is important. It can and will help\nmeet the cultural and educational needs of North Dakota.\"\nDr. 0. A. DeLong, President\nDickenson State Teachers College"
}