{
  "id": "d733-37",
  "text": "- 30 -\n”ln my opinion, most universities that are rapidly expanding have\ncertain weaknesses or deficiencies which might be helped by the\nuse of broadcast television. It is also my belief that although\nthese weaknesses are not too obvious at this point, they will be\ngreatly increased in a short period of time. Broadcast television\ncertainly has characteristics which make it an ideal tool for\nteaching. With a rapidly increasing enrollment and increased\nbuilding costs, it is apparent that every available method must\nbe utilized to provide an adequate college education for those\nqualified individuals• I am certain that as a state university\nwe could fulfill our obligations better through the use of broad¬\ncast television.\"\nJ. Patrick Kelly, Director\nCommunications Center\nUniversity of Nevada\n\"There is urgent need for a substantial increase in faculties,\nclassrooms, and enrollment at this college in the years ahead.\nCurrently we are accepting one out of three for admission to\nthe freshman class. Fortunately the majority of our faculty\nmembers are well qualified in their fields of specialization,\nbut it is doubtful that we can maintain our present high stand¬\nards for faculty employment unless salary schedules are sub¬\nstantially increased and unless the graduate schools of the na¬\ntion become really concerned about preparing an adequate number\nof well-qualified college teachers.\n\"We estimate that our enrollment will more than double in the\nnext five or six years, and that it will increase substantially\nbeyond that figure in the next 10 - 15 years.\n\"As the institution grows, at least a low-power UHF transmission\nfacility should be available, and in view of the centralized\nlocation of this institution a full-power VHP channel should be\nreserved. As the use of video-tape becomes easier, transmission\nto regional schools would almost automatically occur.\"\nHurbert D. Welte, President\nCentral Connecticut State\nCollege\nNew Britain, Connecticut"
}