{
  "id": "d733-39",
  "text": "\"In the Philadelphia-Delaware area, with many colleges able to\ncontribute broadcasting talents, the available broadcast time\nis almost disastrously limited, especially for television broad¬\ncasting. The educational service of our institutions at all\nlevels can be greatly accelerated by a significant increase in\nbroadcasting facilities.\"\nSculley Bradley, Vice Provost\nUniversity of Pennsylvania\n\"The Medical School is planning to develop a graduate program,\nand it is planned, if money is available, to use broadcast\ntelevision. The university is generally exploring its use in\nall of our scientific and technological curricula. We definite¬\nly hope to use it in the biological sciences.\"\nEdison Montgomery, Director\nInstitutional Planning\nUniversity of Pittsburgh\n\"The higher education establishments in the Los Angeles area\ninclude one present and one future campus of the University of\nCalifornia, as well as four major state colleges, and more to\ncome; it includes the University of Southern California, and\nfourteen other independent colleges and universities, and it\nincludes perhaps a dozen or more two-year colleges, some of\nwhich have enrollments as large as those of the state colleges.\nIt would appear that differences in curriculum among such\ninstitutions of such number and diversity imply that a half a\ndozen channels will not serve the varied needs of broadcasting\nto classrooms during the limited number of hours when school\nis in session on a given day. Fifteen channels would make a\nbare minimum, assuming that at least one is a VHF channel and\nsix are high-power UHF channels and eight are low-power UHF\nchannels. With the population and the schools that are in\nprospect here, even fifteen channels would have to be multi¬\nplexed or otherwise divided before long. No other major popu¬\nlation center has as wide spread and complex a distribution\nof peoples, schools and types of terrain*.\"\nDr. Kenneth Harwood, Head\nDepartment of Telecommunications\nUniversity of Southern\nCalifornia\nLos Angeles, California"
}