{
  "id": "d733-40",
  "text": "- 33 -\nVw\nWhile the foregoing definitive statements indicate the trend of\nimpact and the general need, these trends and needs in many instances\ndo not apply to the older and privately endowed institutions, large or\nsmall. Many of the responses to the survey evidence an inclination\non the part of many of these institutions to \"hold the line\" at their\npresent level of enrollment and of academic service. However, many of\nthe older, and especially of the smaller, private institutions have\nmixed feelings and indicate uncertainty either of their future direc¬\ntion, or of their particular place in the future pattern of things in\nhigher education. An example of this desire to be a part of the change\nand of the forward movement in meeting impacts of the future, but of\nindecision as to how to accomplish it is indicated in. a letter from\nDr. Robert w. McEwen, President of Hamilton College:\n\"Hamilton, like most small liberal arts colleges, is making\nno present use of educational television and has no present\nplans for its use into our program.\n\"We are well aware of the promise of this medium, both for\nthe improvement and as offering some potential reduction in\neducational costs. The faculty of such a college could con¬\ntribute to the development of lectures on tapes which will\nbe needed.\n\"What is lacking in the small college is any understanding of\nthe ways in which we might be able to cooperate in getting edu¬\ncational television at the college level rolling. I fear that\nHamilton, like most small residential institutions, will have\nto wait on the leadership of educational associations, or the\nstate, and then offer its cooperation, if somewhat tardily.\"\nThe survey determined that many of the smaller institutions recognize\nthe various national impacts upon the educational facilities of the coun¬\ntry, and want to participate in meeting the problems. These smaller in¬\nstitutions offer a resource for providing quality instruction through\nbroadcast television. A large number of them indicated that they were\nactively planning or had given serious thought to cooperation with other\ninstitutions in the use of broadcasting television, in the future.\nWhile a number of institutions indicated that they have no need at\npresent or in the foreseeable future for broadcast television, there was\nno locality or educational complex which did not in some measure see in\nthe future a need for the multi-use of television for education.\nAnalyzing the educational complexes, locality by locality, the study\nfound an almost unanimous indication of need and — which might be inter¬\npreted as even more important — an indicated trend to inter-institutional\ncooperation among colleges and universities, and a further trend of co¬\noperation between higher education and public schools.\nStatistically, the results of the survey are rather definite and\nfairly simple. Of the colleges and universities contacted, 601, or ap¬\nproximately 60$, responded. Of this number all but a small minority"
}