{
  "id": "d733-42",
  "text": "- 35 -\ninstruction. This demonstrates that 43$ of the reporting institutions\nare either now using or planning to use closed-circuit television.\nEarlier, this report noted a trend to cooperative effort in the\nuse of broadcast television. Tabulation of survey responses shows that\n91 colleges and universities (or 15$) of those reporting are now en¬\ngaged in a cooperative effort of one kind or another, and that 134 in¬\nstitutions plan future cooperation with other institutions or agencies.\nThis means that 37$ of these institutions are now to some degree con¬\ncerned with inter-institutional cooperation.\nIt is difficult to evoke from the colleges and universities a\ndefinite answer to the question of future need. Many institutions feel\nthey are in a period of change and growth, a period of development of\nnew processes which cannot at this time be completely nor accurately\ndetermined for a ten-year period. But a reluctance to make specific\ninstitutional commitments proved not to be a measure of reluctance to\nindicate general need. As one college president put it,\n\"I would hate to say at the present time that we are going to\nneed two channels in the future, when five years from now I\nmay find out that we will need six channels; on the other hand\nI certainly want to be sure that we register our awareness of\nthe fact that we are going to need channels.\"\nA future need of more broadcast television channels than are now\navailable to them was indicated by 321 colleges and universities (or\n53*5$ of those responding in the survey.) A number of institutions in¬\ndicated a foreseeable minimum need of channels for various instructional\npurposes. Some indicated a minimum of two channels for the institution\nor group of institutions they represented; others indicated as many as\nsix channels as a minimum for future use. Estimates of need ranged up\nto the minimum of 18 channels of varying power quoted earlier as the\ntotal educational complex estimate for the Los Angeles area.\nThis study shows a majority of the colleges and universities in\nagreement that they will need in the future many more broadcast tele¬\nvision channels than are now available to them. This was reflected in\nthe response to the question of additional reservations to meet future\nneeds. Of the colleges and universities responding, 82.5$ indicated\nunconditionally that additional channels should be reserved for their\ninstitutions or for the institutional complex to which they belong;\n15$ indicated that they did not believe it necessary to reserve any\nadditional channels for their future use; and 2.5$ were undecided\nwhether there should be additional reservations. (See Table 1.)\nThe preponderance of this positive response evidences the awareness\nof college administrators of the need for television channels in the\nfuture development of higher education.\nNOTE: See Table No. 1 on the following page."
}