{
  "id": "d733-44",
  "text": "- 37 -\nSw\nTHE KEEPS OF THE FUTURE REFLECTED NATIONALLY\nIII. THE PUBLIC SCHOOLS\nA third segment of the national picture was reflected by the public\nschools. A large number of the various-size school systems was polled,\nand the superintendents and other administrators interviewed. National\nand regional organizations concerned with public schools were surveyed.\nThe results appear to be definitive.\nThe National Education Association in its report on educational\ntelevision issued in spring of 1961, entitled \"And TV Tool\", stated by\nthe way of introduction:\n\"The salient educational fact of our time is that the quantity\nand quality of our education must be drastically and rapidly\nincreased if our people are to meet successfully economic,\npolitical and moral challenges with which they are faced. Our\nrapidly increasing population, and the increasing number of years\nof formal schooling demanded by that population indicate the\nurgency to increase the quantity of educational facilities and\nopportunities• The even more rapid increase of the world popula¬\ntion, the increasing dependency on technology as a governing\neconomic and social factor, and the divergent political and\nmoral philosophies impinging on the peace of the world as well\nas on our own security make it absolutely essential that the\nquality of every segment of our education be increased.\nSome school administrators and lay boards on all levels of edu¬\ncation believe that educational television, properly and ade¬\nquately used, can be a major instructional device to accomplish\nthis; that so used, it can improve instruction more economically\nthan any other one medium. If these things are true, it is ob¬\nvious that television for instructional purposes must be the\nresult of a well-planned, concentrated, and unified program.\"\nTfee Fund for the Advancement of Education, in its report \"Teaching\nby Television,\" issued in January 1961, said,\n\"Today the question is no longer whether television can play\nan important role in education. That question has been\nanswered in the affirmative.\"\nThe North Central Association of Colleges and Secondary Schools at\nits conference on television at Ohio State University in the fall of\ni960 reported among other conclusions the following:\n\"It is certain, for example, that the facility of television\nis now being used successfully as an educational tool at all\nage levels. It is clear that students can learn as well where\ntelevision is used by the teacher as in the conventional class¬\nroom situations, and frequently better. It is clear that"
}