{
  "id": "d733-55",
  "text": "NEEDS OF THE FUTURE REFLECTED BY THE SEVERAL STATES\nALABAMA\nOne of the first to have a state law authorizing such an agency,\nAlabama has an educational television commission charged with making\neducational television available to as many Alabama inhabitants as\npossible. The Alabama Educational Television Commission is the legal\nowner of all educational television stations now operating in the state,\nor that will in the future operate there. These stations operate as a\nnetwork, serving general community needs as well as the instructional\nneeds of the colleges and school systems.\nThe Commission now operates three VHF channels, interconnected by\ntwelve micro-wave units. In January 1961 the Commission applied for a\nconstruction permit to build another station on Channel 26 in Montgomery.\nIts immediate plan is to establish an additional station in Mobile (UHF)\nand at least one station in the Tennessee Valley of northern Alabama.\nIt has applied for, and received, reserved channels at nine additional\nlocations.\nPresent plans indicate that Alabama anticipates during the next ten\nyears a need for at least 30, and perhaps 36, channels to serve an edu¬\ncational network system. When all the presently reserved channels in the\nstate are activated there will be only 18 stations on the air (three of\nwhich would be second channels). Alabama will need an additional fifteen\nchannels reserved for educational television.\nALASKA\nThe vastness of Alaska's geographic area and the state's rugged\nterrain pose special, and difficult, problems to the planning of use\nthere of television for educational purposes. Nonetheless, stirrings\nof interest evidenced now indicate there will be demands for channels\nfor education as the state continues to grow, and as its educational\ndemands continue to grow.\nDr. William R. Wood, President, University of Alaska, writes:\n\"To the best of my knowledge there are no institutional, com¬\nmunity, or state plans in Alaska for the use of broadcast\ntelevision for educational purposes. However, a university\nfaculty committee has just submitted to me an extensive proposal\nconcerning the development of an instruction center, that\ninvolves the use of educational television. I should be very\nglad to confer at any time concerning the possibility of edu¬\ncational stations in Alaska. The principle areas that might\nbe effected initially would be Anchorage and Fairbanks.\""
}