{
  "id": "d733-57",
  "text": "learning in all schools which cannot he accommodated tradition¬\nally with plant and qualified instructors, Certainly, one\nimportant answer to this problem will be educational tele¬\nvision. If it is economically feasible to consider an edu¬\ncational television network development in Arizona, which can\nbe tied in with an educational television network nationally,\nwithin the next few years, then let’s make this come about,\nbefore we find our academic facilities are inadequate to meet\nthe problem.\"\nIn April 1961 a meeting of public school and college educators and\nrepresentative citizens at Arizona State University considered the needs\nof educational television in the state. Among recommendations of this\ngroup - aware of the needs of the state and the potentials of televi¬\nsion - were:\n1. Additional television channels for educational purposes\nshould be available in the Flagstaff, Safford, and Yuma\nareas. These transmission channels would be used immedi¬\nately to pick up programs originating from the two uni¬\nversity stations. Later they might be used for local\norigination.\n2. At least two low-power UHF channels should be available\nto education in the Phoenix and Tucson areas, so that\nKAET and KUAT could move into multiple transmission as\nthe need developed.\n3. The university stations should be linked, to enable them\nto exchange programs off the air at this time.\nk. Engineering studies should be undertaken and long range\nplanning organized to ensure organization of the state\nto make efficient use of television as a teaching medium\nin the future.\nThis report and reports from its schools indicate that Arizona will,\nwithin the next ten years, need a minimum of nine additional channels to\nmeet its growing and recognized instructional needs. Should growth in\nother parts of the state approximate that of Phoenix even more than this\nnumber will be needed.\nARKANSAS\nAn Arkansas legislative committee which studied the educational pos¬\nsibilities of television sponsored a bill in the 1961 legislature to\nestablish a state educational television commission. This commission\nwould be empowered to activate the reserved channels in Arkansas and to\nprocure such additional channels as might be needed. At this writing the\nlegislature has passed the bill and the governor has indicated he will\nsign it."
}