{
  "id": "d733-58",
  "text": "- 51 -\nThe committee was very definite in its decision that Arkansas will\nneed more than the three educational television reservations now allo¬\ncated it. Arkansas has a problem of coverage from a technical stand¬\npoint that is particularly its own. But the committee is convinced that\nif optimum use is made of television in the state, Arkansas will have\nample use for a multi-channel system in the future.\nCooper Burley, member of the study commission and supervisor of\nteaching aids for the school system, anticipates this full development\nduring the next 10 years. On the basis of the distribution of its popu¬\nlation, and the distribution of its student population, an engineering\nprojection indicates Arkansas will need at least nine additional channels\nreserved for education.\nCALIFORNIA\nOf all the states, California has one of the largest demonstrated\nneeds for use of television for instruction in its huge complex of higher\neducation and multiplicity of school systems. It has 89 four-year\ncolleges and universities and 31 two-year colleges, with a combined\nenrollment of approximately 500,000 students. This number is steadily\nincreasing.\nThere are approximately 18 major population centers in California\nand seven small population centers or communities in excess of 50,000.\nThe bulk of the population is centered in the west-central and south¬\nwestern parts of the state and concentrated in these areas along the coast,\npiere is a public school enrollment of approximately 2,830,000, in addi¬\ntion to those students in colleges and universities.\nThe need here for instructional television has long been recognized,\nhut a problem of organization and responsibility for facility ownership\nremains. There was added in 1957 to the education code of California-\n\"Section 8857 Contracts for Television Broadcast\nThe governing board of any school district or the county super-\nintendent of schools acting with the permission and on behalf\nof such a board, or boards, may enter into contracts, either\nalone or in cooperation with other school districts, for the\npurpose of participating in, or the procuring of television broad¬\ncast for use in the educational program of the schools. Nothing\ncontained in this section, however, shall be construed as author¬\nizing a school district or county superintendent of schools to\nown, lease, or operate a television broadcasting station.\"\n, ?1:iSah!S r?sulted in school districts contracting, in their experi¬\nmental and developmental periods with television, with commercial stations\nin northern California, contracting with the educational stations in\nSan I-rancisoc and Sacramento. But there has been a growing recognition\nthat these arrangements are inadequate; that if the schools alone are to\nCal?forn£y ' Par*lculfrly the densely populated areas of southern\nCalifornia - many more channels must be provided."
}