{
  "id": "d733-59",
  "text": "- 52 -\nThe Los Angeles Regional Educational Television Advisory Committee,\nfollowing a March 1961 meeting, reported the need for six channels for\nhigh-power operation for use by the larger districts for instructional\npurposes in the elementary and secondary school, and for adult education;\ntwelve channels for low-power operation to serve the local needs of the\ndistricts; and, for Los Angeles, a general educational television service\nto meet the needs of the community at large.\nDr. Kenneth Harwood at the University of Southern California, study¬\ning the Los Angeles area, substantiates the position of the Advisory\nCommittee. He projects, on the basis of educational communication need\nin Los Angeles, a minimum of fifteen to eighteen channels for instruc¬\ntional purposes within the next ten to fifteen years.\nThis need in the general Los Angeles area is aggravated by the\ngrowth, both north and south of the city, in areas that normally would\nnot be reached by the Los Angeles educational television station.\nDr. P. E. Patterson, Director of Audio-Visual Services for the\nOrange County schools, writes:\nIn the original allocations made in 1952, Orange County was\nnot considered as a potential location for an educational\nchannel, due to the fact that this county was in a small com¬\nmunity and considered a 'bedroom' of Los Angeles County.\nSince 1952, Orange County has more than tripled in growth and\nis now considered a separate metropolitan area completely\ndivorced from Los Angeles County. I would like to call your\nattention to the fact that Orange County has a considerable\namount of television being used in the schools at the present\ntime. There are probably between 1,000 - 1,500 television\nreceivers in the Orange County schools and more being added\neach year. We feel that the schools in Orange County should\nhave their own educational television facilities.''\nOrange County has predicted a school enrollment of 700,000 at the\nsaturation point and school officials there are very interested in having\nan initial educational television channel to be ops rated by the county for\nall school districts. The 700,000 projected enrollment is the saturation\nfigure. Actually expected at the present rate of growth is an enrollment\nof approximately 500,000 children in the county within the next 10 years.\nIn extreme southern California is the metropolitan area of San Diego;\nand there is a rapidly growing demand for television in the combined\nschool districts, as well as in the growing institutions of higher edu¬\ncation there. Reports from both San Francisco and Sacramento areas indi¬\ncate a minimum need of three additional television channels for\ninstructional broadcasting in those two communities.\nCalifornia has at this writing six educational reservations that have\nnot been activated. But the evidence presented by the schools and col¬\nleges for additional channels needed in the foreseeable future demands an\nadditional 32 channels in California, distributed in the great clusters\nof population in the south and in the central parts of the state."
}