{
  "id": "d733-63",
  "text": "in its public schools. If the minimum degree of the projected use of\ninstructional television is attained in Delaware, at least two additional\nchannels for projection into the southern-central and southern sections\nof the state will be needed to complete the educational system. This\nprojection takes into account the sharing of such long range facilities\nas may be made available from Philadelphia or Wilmington.\nFLORIDA\nFlorida has been experiencing one of the largest rates of population\nincrease in the United States. The consequent impact on its total educa¬\ntional system has strained the resources of the state. In planning to\nmeet the continuing growth of enrollment in schools at all levels, tele¬\nvision has been considered an important adjunct to the educational system.\nIn 1957 the Florida State Legislature passed a law creating the\nFlorida Educational Television Commission. The act sought to provide\nthrough educational television a means of extending the powers of teaching\nin public education and to raise state educational and living standards.\nThe act directs this Commission to establish a television network connect¬\ning such communities or stations as may be designated by the State Board\nof Education. Under the act such networks are to be utilized primarily\nfor the instruction of students at existing colleges and universities,\nincluding community or junior colleges of the state.\nTo meet the impact on higher education that has been increasing each\nyear - and which bids fair to increase during the next decade - Florida\nhas established a long range plan designed to provide community junior\ncollege service for all people in the state. It was originally planned\nto establish in order of need, in the various communities, between 35 and\n40 junior colleges. Of these, 24, well distributed about the state and\nmeeting the needs of the more concentrated areas of population, have\nalready been established and are in operation. In 1961 the legislature\npaved the way for the establishment of additional junior colleges to\nbring the plans up to the original quota.\nBecause use of television instruction figured largely in the planning\nof this system .of junior colleges, the Florida Educational Television\nCommission has asked the Federal Communications Commission to reserve an\nadditional sixteen channels in the state. Florida originally had five\nVHF channels and four UHF channels reserved for education. The five VHF\nchannels in the major areas of population and at the state universities\nhave now been activated and are serving the school systems, colleges, and\nuniversities in the state.\nThe four UHF channels originally reserved were obviously inadequate\nto meet the demonstrated additional needs in Florida, so the Florida\nEducational Television Commission had its engineers plot sixteen additional\nchannels which could be dropped into Florida or reserved from the general\ntable of assignments. Granting of these sixteen additional reservations\nby the Federal Communications Commission will provide Florida with a total\nof 25 channels to be activated in the general system of public education\nin the next ten years."
}