{
  "id": "d733-64",
  "text": "- 57 -\n,, this will not in itself he sufficient. The southeastern part of\nthe state - Dade County - has already applied for an additional UHF chan¬\nnel and has told this survey that it will probably need during the next\nten years at least three more channels,\nresponfe the communities and the school systems throughout\ncoupled with the official actions of the State Department of\nEducation, State Board of Higher Education, and the State Educational\nadrti+i™°? ^°™lssl0?> indicates that Projected plans will require an\npwlrf. ™ ^ channels beyond the number originally requested by the\nComm,m^!fl|l0ational/eleTiSi0n Co“mlssion ln its petition to the Federal\n+i0?J! c°“miS3i0C\" This would mean a total of 39 channels (34 in\ntodm»»+ 7° ® / I6 now on the alr) would have to be reserved for Florida\nto meet its projected needs.\naoooin^f Th!maS D- Balley' of the State Department of Education,\nwhich tha lar ee , r?co™end t0 ^e 1961 Florida legislature ways in\n«!?with t te.can make educational television an everyday part of the\nties ln m0st areas> He says: \"We plan to expand these facili-\nties as rapidly as possible.\"\nlion tan^ largest state, has a population of almost 5 mil-\nover’fiw nnn8 tw0,°/ “lion's 38 large standard metropolitan areas of\nZtJ55°,000 population - one in southeast Florida and one on the west\nthe iimin! has sixteen 4-year colleges and universities in addition to\n™ UT Sy!tem' and n has two four-year state universities\nnow m the planning stage.\ninninaileDi'il0+^da sah°01 3y3tem is composed of 67 county-unit systems that\nrollman+ 1= the ur^a0 afeas within the county. Total public school en-\nrollment is approximately 1,000,000. In fifteen areas of the state\nbodief of8 ?!rS °f thSSe oounty-urban systems are composed of large\nbodies of population ranging from 100,000 to over 1,000,000. All of S\nthese areas, as has the rest of the state, have maintained their rate of\non°tha‘« Auth°ritiesexpect the impact on the public school system and\non the system of higher education will more than double by 1970.\nGEORGIA\nDolitan°anan« Wlrh a p°pdlation of al“°st k million, has six large metro-\nove““ooo,o00. geSt 18 the Atlacta area> with a population of well\nThere are 47 junior and senior institutions of higher learnina in\ntionfnro’lect a c°mhined enrollment of 47,000. Heads of these institu-\nproject an increase in this enrollment to 82,000 by 1970,\n1 onn^m81,8^88!198 sph°o1 distrlcts, with an enrollment of nearly\narea°h«00Ji. lafgest districts are clustered in the Atlanta area. This\nr i ,?,edfatl0“al television station on the air, and proves\ninstructional television to all Atlanta schools and those in immediltelv\nown'station on/te/lr811^ , Th\\UclverSlty °f Borgia at Athens has its\nof continuing education/ ® ^ universlty and the l«6a division"
}