{
  "id": "d733-68",
  "text": "- 61 -\nMWe certainly feel that the Federal Communications Commission\nshould seriously consider the demands made upon it and set\naside adequate facilities for our future education. If\ntelevision has any use at all, we should reserve a minimum of\nchannels for our state. We have had a steady increase of\nstudent enrollment for the past twelve years. Our state is\nyoung, with a lot of natural resources and the opportunity to\nexpand and grow. We are aware that television is quite new\nand many of the uses that might he made of it are not yet\ndeveloped. At Idaho State College in the southern part of\nour state we are developing a television-communications system.\nThe University of Idaho, in the northern part of our state, is\nalso working on a similar program. If these programs develop\nand grow, much useful information will he available, not only\nto the public schools in the state of Idaho, hut to our adult\npopulation as well.\n\"I suggest that a very careful study he made of the use of\neducational television for our future generation. We in the\nState Department of Education in Idaho will he ready to aid in\nany way we can in relation to the educational use of television\nand the necessary channels to promote it for us.\"\nDr. H. Walter Steffens, Executive Dean of the University of Idaho,\nsays: ’\n\"At present there are over 4,000 resident students at the\nUniversity of Idaho. We serve more than that number through\nour adult education division. We have six agricultural experi¬\nment stations throughout the state, and have county agents in\n42 of the 44 counties. We are a land-grant university with\nstate-wide responsibilities. The University of the state has\nobligations, through television, to take its services to all\nregions of the state; and in making plans for the future it\nseems that the southeastern, the central, and the northern\nparts of the state must be remembered, in reserving channels\nfor this use. In planning for the future we must prepare for\napproximately 6,000 students on the campus, about 8,000\nstudents off campus, and several thousand of other adults\nthrough our other facilities, including television programs.\"\nIdaho has four fairly large centers with over 50,000 population, all\nof which are located in the southern part of the state. It has six four-\nand universities with a total enrollment of approximately\nU,000, and two two-year colleges with a total enrollment of almost 3,000.\nThere is a public school enrollment of approximately 175,000. Many of\nthese students are enrolled in rural schools or very small districts. If\nthe state universities and the scattered schools are to be served, and\nthe future television needs of Idaho to be protected, then it is evident\nthat several more.channels must be made available for educational pur-\nA projection of future needs indicates that a minimum of nine\nadditional channels will be required."
}