{
  "id": "d733-70",
  "text": "- 63 -\nThe school systems and colleges of Illinois surveyed indicate a\nwillingness to cooperate in the use of educational television channels*\nIn the matter of channel allocations, educators’ assessment of future\nneeds consistently reflects an intense need for multiple channels. In\nthis state, also, the Midwest Project on Airborne Television Instruction\nis an activity of considerable interest. In Illinois there are several\n\"resource institutions\" and \"demonstration schools\" for MPATI. But\nsurvey personnel did not find among educational institutions there the\nsame degree of hopeful dependency on MPATI as they discovered in neighbor¬\ning states.\nTwo plans have been advanced for primary network of educational\ntelevision in Illinois. One, assuming that Channel 8 in southern Illinois\ngoes on the air in 1961, would simply link the present three big stations\nin Illinois and add two or three high-powered stations. The other calls\nfor use of the prime VHF stations that are in a line from southern\nIllinois to Chicago, linked with the educational stations in St. Louis,\nand supported in the various localities by low-power UHF stations. This\nwould call for a primary coverage with at least fifteen channels in the\nstate•\nStudying the collective assessment by Illinois educators of future\nneeds of educational television in terms of school schedules, varying\nlevels of education, and multiple channel, a reasonable projection is that\nbetween 20 and 27 additional channels will have to be made available if\nthe future of television services there is to be protected.\nINDIANA.\nThere are kl colleges and universities with a total enrollment of\n88,000 in Indiana. Public school enrollment is approximately 950,000.\nThere are five large centers of population in the state, and seven small\ncenters of population in excess of 50,000. The population is scattered\nfairly evenly over the state.\nThere are nine channels in Indiana reserved for education. None of\nthese has been activated, although it is expected that within the next\ntwo years Channel 9 in Evansville will be put on the air, and Channel 30\nat the University of Indiana in Bloomington. Channel i+7 at Purdue\nUniversity in Lafayette has not been activated. The Purdue facilities\nand interest for some time have been involved with the experimental\nMidwest Project on Airborne Television Instruction.\nIndiana reports much interest but little activity in broadcast tele¬\nvision. Most of the major educational institutions there are involved in\nthe experimental on Airborne Project, either as \"coordinating centers,\"\nas \"demonstration schools,\" as \"resource institutions,\" or, in some cases,\nas all three.\nThere is little talk of a state network in Indiana. The development\nof channels and facilities to provide for local regional needs is more\nimmediately important in the thinking of most educators and lay boards\nthan is the development of a state network."
}