{
  "id": "d733-72",
  "text": "- 65 -\ntelevision programs in our state. We feel that there is an\nincreasing recognition of educational television’s potential,\nand are aware of the demands in many areas of Iowa for addi¬\ntional service to the schools, and to the adult population.\nWe are convinced that the present allocation of educational\ntelevision channels for Iowa are inadequate to serve the\nstate as it should he served. We know that there is a need\nfor additional channels, and for more financial support than\nis available at the present time.\"\nForest J. Moore, Chairman of the Iowa Joint Committee on Educational\nTelevision and representing the State Department of Education, writes:\n\"I am enclosing a resolution affecting the legal status of\neducational television in the state of Iowa which was passed\nby the House of Representatives with the concurrent action\nof the Senate on April 28, 1961, This resolution serves to\ndocument the needs for educational television spectrum space\nin the State of Iowa, It is evident by this legalizing action\nof our State Legislature television channels should be reserved\nfor this state to provide facilities to serve the total edu¬\ncational needs of our population.\n\"HOUSE CONCURRENT RESOLUTION 15 April 28, 1961\nState of Iowa\nWhereas, the General Assembly of the State of Iowa recognizes\nthe increasing need for additional resources and the need of\nsharing those resources so that educational benefits may be\nprovided to all the people of the State of Iowa; therefore,\n\"Be it resolved by the House of Representatives, the Senate\nconcurring, that the continued use of educational television\nand radio broadcasting should be encouraged and, to the end\nthat increased educational opportunities may be so made avail¬\nable. The use of such media should be expanded as rapidly and\nas fully as possible; and\n\"Be it further resolved that it is desirable that educational\nopportunity at all levels be extended to all the people of\nIowa, the General Assembly of the State of Iowa hereby declares\nits interest in, and intent to undertake a study of the means\nby which additional educational facilities may be employed to\nserve the educational needs of the State of Iowa; and\n\"Be it further resolved that the education resources so richly\nprevalent in the entire upper midwest should be made available\nto the people and to the schools of Iowa by means of the pro¬\nposed Upper Midwest Six-State Educational Television Network;\nand"
}