{
  "id": "d733-74",
  "text": "- 6 7 -\nThere are over 900 one-roora schools in the state8 Of the 557\nhigh schools in Kansas, k2J have enrollments of less than 150,\nand over half of these have no more than 60 students - and many\nless than half of that* It is obviously impossible to organize\nan adequate modern curriculum with such restricted resources as\nmust obtain in such small, isolated school units* To attempt\nto do so would be impractical and impossibly expensive. Yet\nevery school administrator in Kansas recognizes the great\nnumber of educational needs which are not now being served, and\nwhich cannot be adequately served in the foreseeable future,\nunless some economical means of universal assistance can be\nprovided in the neglected areas of a curriculum which must be\ndesigned to meet the needs of children and adults in the present\nworld.\n\"Without exception, the school administrators, board members,\nand teachers with whom this problem was discussed agreed that\neducational television, well organized and properly used, would\nstrengthen the total curricula of the state, and in a large\nmeasure provide those educational needs not now being served\nadequately by the multiplicity of small schools*\"\nDr. Forrest Whan, of the Kansas State Teachers Association, represent¬\ning that body before the Congressional Committee on Interstate and Foreign\nCommerce, said, in part:\n\"The teachers of elementary, secondary, and higher education in\nKansas are in a position to know of the desperate need for edu¬\ncational television in the state, and the crippling effect the\nloss of this medium of instruction would have on education in\nthe state in future years...We not only strongly urge - we plead\nwith - the Congress of the United States to see to it that\nadequate channels for state-wide educational television be\nreserved for Kansas indefinitely - regardless of how long it\ntakes - so that whatever problems face this state in implement¬\ning educational television may be solved, and the channels put\nto this great use.\"\nThe University of Kansas at Lawrence, the Kansas State University at\nManhattan, the University of Wichita at Wichita, and all of the Kansas\nstate colleges have been concerned with the development and use of educa¬\ntional television and television for instructional purposes. Limited\nbudgets and various state handicaps have delayed development of the broad¬\ncast channels.\nHowever, the State Legislative Council, in its i960 report to the\nlegislature, presented a plan for a Kansas State Network designed as a\nbasic service for the colleges and schools of the entire state. Trie mini¬\nmum plan proposed would use five VHF channels with 1,000-feet high antenna\nat maximum power and one UHF channel using 1,000-feet high antenna at\nmaximum power. These six channels would be distributed at approximately\nequal distances across the top and bottom of the state."
}