{
  "id": "d733-78",
  "text": "- 71 -\nin the state. When this is done it is evident that - if the different\nlevels of education, elementary, secondary, college, and general adult are\nto be served - there will have to be at least double channeling of the\nmajor stations. Some of these will be high-power stations, and some low-\npower. It is probable, from the reports, that if the ten additional\nstations proposed by the Legislative Research Commission are activated\nsome of them will be low-power stations. Nonetheless, these stations are\nneeded because of the geographical location of the communities and the\nterrain in which the stations will have to operate.\nA projection based upon the present proposals indicates that in\naddition to the eleven basic channels (including the active Louisville\nstation) now proposed, at least another eleven channels will be needed\nwithin the next ten years.\nLOUISIANA\nLouisiana has 20 colleges and universities with a total enrollment of\napproximately 5^,000, and a public school system which has an enrollment\n° ?PProximately 6o0,000. It has six large centers of population in excess\nof 100,000 and seven small centers in excess of 50,000.\nLouisiana has four educational television channels reserved* Two of\nthese - one in New Orleans and one in Monroe - have been activated. The\nstation in New Orleans on Channel 8 is owned and operated by a non-profit\ncommunity foundation, but serves the New Orleans schools and adjoining\nparishes. The station on Channel 13 in Monroe is owned and operated by\nthe State Department of Education.\n_ 4.vCCofdJns t0 Dr* Jt B* Gremillioa> Director of Research and Statistics\nfo* State department of Education, the Department believes that as more\nand better instructional programs are developed, more people in sections of\nthe state not now being served by educational television channels will\ndemand these services. He says plans are now being developed for extension\nof present faciliities and for activating the rest of the reserved channels.\nHe says also that additional channels are needed in the central, southern,\nand eastern portions of the state.\n• 4.i,Tiie ?tate Department of Education maintains that educational television\nis the only practical means for reaching the masses with instruction for\npre-school, elementary, secondary, college, and adult age groups.\n;?r* Harvey Gardiner is Assistant Superintendent of St. Landry Parish\nSchools, which is one of the larger systems in the state and has an enroll¬\nment of some 2b,000. He says:\nWe can visualize a situation where supervisors and master\nteachers working and planning with groups of teachers in subject-\nmatter areas could outline the instructional program whereby the\nindividual classroom work would be supplemented by weekly or\nbiweekly television lectures or demonstrations, by experts who\nwould have the time to prepare presentations more thoroughly."
}