{
  "id": "d733-85",
  "text": "could be used extensively for large entering classes, thus\nreleasing faculty for more teacher-student discussion and\nsmall conference exchanges.\n\"Broadcast television, if made available would certainly make\nit possible to experiment with new approaches to instruction\nto meet the future needs caused by increased enrollment and\nfacilities shortage. We strongly recommend that the Federal\nCommunications Commission reserve television channel space\nto serve at some future date our institution and the three\nprivate colleges in the area,”\nThe Western Massachusetts Broadcasting Council (which comprises\nAmherst, Mount Holyoke, Smith College, and the University of Massachusetts)\nfavors the reservation of television channels necessary to serve the insti¬\ntutions of higher learning, and the public and private schools as well.\nVincent C. Brann, Program Coordinator of the Radio Station at Smith College\nin Northampton, which is jointly sponsored by the W.M.B.C., said:\n\"Speaking for Smith College, I would hazard a guess that any\neducational television in the Connecticut Valley area will\nbe, when and if it comes, a four-college cooperative venture,\nsimilar to this FM Radio Project.\"\nDr. Frederick A. Meir, President of the Massachusetts State College\nat Salem, writes:\n\"We are not now using closed-circuit television. However,\nwith the erection of a new building which is now on the\nboard, we shall have a closed-circuit setup for the use of\ndifferent departments of the college. We receive educational\nbroadcasts from Channel 2 in Boston which are used mainly in\nthe Horace Mann Training School connected with the College.\nIt is possible, with increasing number of elementary school\nteachers being trained in public schools, that educational\nbroadcast facilities might be needed to keep them alerted to\nthe features of the training process which they should observe.\nCertainly experienced teachers now should be contacted for in-\nservice education. This use of broadcast television is beg¬\nging for strong application. Salem State College could be a\ncenter fbr these broadcast programs.\"\nFour colleges in Massachusetts told survey consultants that they are\nnow using broadcast television. Two said they are planning to use it.\nSixteen colleges and universities recognized a future need for it.\nDr. William F. Young, Jr., Deputy Commissioner of Education for\nMassachusetts, writes:\n\"We have much which would employ instructional television pro¬\nvided that there were educational television outlets to cover\nthe state. With adequate outlets we can foresee an increase"
}