{
  "id": "d733-95",
  "text": "- 88 -\nDr. Breckenridge says immediate plans call for an additional closed-\ncircuit system for the main campus to supplement the present broadcast\nsystem, a network for three university campuses, (this will be at the\nmain campus in Lincoln, the east campus in Lincoln, and the Medical\nCenter in Omaha), and increased efforts to strengthen the total collegiate\nprogramming, instruction, and experimentation at all levels.\nNebraska has a state-wide organization for the promotion of educa¬\ntional television, the Nebraska Governor's Committee for Educational\nTelevision. This Committee is representative of the educational and\ninterested lay forces in the state.\nIn addition, the Nebraska Council for Educational Television, Inc.\nprovides televised instruction to elementary and secondary schools, and\nin-service teacher education to the area covered by Channel 12 in\nLincoln. In this effort more than twenty-five school systems join with\nthe State Department of Education, the University of Nebraska, Teacher's\nCollege, and the educational television station KUON-TV.\nThe Nebraska Council for Educational Television is currently acti¬\nvating a three-hop translator system to extend this educational broadcast\nservice to additional schools.\nA legislative resolution supports the further development of educa¬\ntional television in Nebraska, and urges further study of participation\nin the Upper Midwest Six-State Educational Television Network, which is\nnow in the process of organization.\nDr. Floyd A. Miller, Assistant Commissioner of Education for Nebraska,\nsaid: *\n\"The potential of educational television is such that every\narea of our instructional needs could be improved if we had\nstate-wide educational television facilities. Recently the\nNebraska Council on Educational Television developed a\nprogram which combined instruction in elementary science\nwith teacher education in an effective manner. This is open¬\ning up a whole new field of endeavor.\nThere is no doubt that the need for educational television\nwill increase. Nebraska is a state of many small schools,\nsome of which can never be properly organized into effective\nschool districts, because of geography. Only by means of a\nstate-wide educational television network can these schools\nobtain the advantages of the enriched instructional program\nwhich can be made available by this powerful new medium.\nThrough a state-wide system, the best that is available in\nany part of the state can be made available to all parts of\nthe state. This means, for example, that some of the enrich¬\ning features now available at the University station can\nbecome part of the broader educational picture of Nebraska."
}