{
  "id": "d733-96",
  "text": "\"The in-service training of teachers is one of the most\npromising areas of educational television. Approximately\n6,000 of Nebraska’s 8,500 elementary teachers do not have\ncollege degrees. The upgrading of instruction through\nteacher education, therefore, is more important to Nebraska\nthan to many other states, although obviously it is\nimportant everywhere. Another contributing factor to this\nneed is found in the fact that the teacher shortage has\nrequired many persons to re-enter teaching after some years\nof absence from the classroom. Here again a state-wide\nfacility is necessary if a positive impact is to be made on\nthe entire state.\"\nStudy of the reports and the projections from the Nebraska Educational\nTelevision Council, the State Department of Education, and the University\nsystem, reveal that as a basic minimum Nebraska needs the five additional\nVHF channels it has requested and which are technically available. And,\nweighing the factors of expanded use of instructional television for in¬\nschool teaching, teacher education, extension, and continuing education,\nas projected by educational authorities in the state, at the minimum,\nthis network would very shortly have to be double-channeled. Some areas,\nsuch as the Lincoln-Omaha region and some of the smaller areas to the\nwest, would have to be more than double channeled. So projected, Nebraska\nwould require 12 UHF channels in addition to the 5 VHF channels now being\nrequested -- a total of 17 additional channels.\nNEVADA\nIn many ways Nevada is unique among the states* It is a large state\nwhich has a very small population, and the major population is centered\nin the two large areas around Reno in the west-central part of the state\nand Las Vegas in the southeast. It has a public school enrollment of\napproximately 60,000 and one university located at Reno with an enroll¬\nment of approximately 3,800. Channel 10 in Las Vegas and Channel 5 in\nReno have been reserved for education, but neither has yet been activated.\nDr. Byron Stetler, Superintendent of Public Instruction of Nevada,\nsays that if television receiving facilities can be expanded and extended\nin Nevada, there will be use for educational broadcasting. He also says\nthat as facilities become available they will be used to a greater extent\nby the University and he believes that the channels now reserved for edu¬\ncation should be continued to be reserved and sufficient additional chan¬\nnels reserved to protect future needs. The study made in Nevada shows\nthat the prime service could be rendered by the two VHF channels now avail¬\nable there. But if any extended service should develop from the\nUniversity, or from the central stations to the smaller population areas\nof the state, it would have to depend in some measure on translators, and\non a microwave connection between the primary outlets. There should be\nan additional reservation at Carson City to take care of that area, and\npossibly another outlet which would probably be a satellite station at\nAlco, and Tonopaw. It is very difficult to project much beyond this"
}