{
  "id": "d733-98",
  "text": "- 91 -\nL,\nDr, Eldon L, Johnson, President of the University of New Hampshire,\nwrites:\n\"I am sure that there are many curriculum deficiences,\ninstructional weaknesses, and facilities shortages that\ncan be helped by using broadcast television. One area\nof possibility is in remedial courses such as English \"A\"\nnow being taught to approximately 20$ of our freshman class.\nIn many cases an extremely high percentage of a department's\ntime is spent in teaching introductory courses such as\nHistory I and History II or History of Civilization. This\nis a general requirement for all Liberal Arts freshmen and\nperhaps could be done by one of our best lecturers, thereby,\nconserving the time of the rest of the department for their\nspecialties. Extension work in both agriculture and general\neducation can be revolutionized by television.\n\"We have barely scratched the surfaces of the uses of edu¬\ncational television. We are certain, however, that for\nremedial teaching and general introductory courses, it can\nbe used effectively. At all levels, television adapts well\nto courses that make use of demonstration or rely on the\nlecture technique. These are the areas in which the greatest\npressure will be felt with the future increase in enrollment.\nOne of the greatest areas of usage to help solve this problem\nof numbers is the possibility of teaching many of these\ncourses by television throughout our university extension\ndivision. I certainly feel that television channels set aside\nfor educational use should be preserved to that end. Also\nthat applications for translators by educational television\nlicense holders should be given consideration.\"\nDr. Arthur E. Jensen, Dean of the Faculty of Dartmouth College at\nHanover, says:\n\"We believe that television has a real place in the educa¬\ntional program of the future. We are cooperating with other\ninstitutions in this state and hope that we can connect with\nChannel 11 and Channel 2 in the future. I am very eager to\ncooperate in any way possible so that the present wasted\nmiracle of television can be used positively in the educational\nwork in the country.\"\nEducational and instructional television has made an excellent start\nin New Hampshire. If additional coverage could be made available to the\nnorth and central parts of the state, it would serve the basic need for\na single service. However, a statement of the State Department of\nEducation reveals that extension of instructional services to the lower\ngrades and to junior and senior high schools, will create a scheduling\nproblem and a load problem that will necessitate additional channels."
}