{
  "id": "d733-99",
  "text": "On the basis of the projections which have been made, and the infor¬\nmation concerning the need for, and the development of, instructional\ntelevision, at least two more prime stations need to be made available\nin New Hampshire (the extreme northern one probably spilling over into\nand sharing time with part of Vermont). In addition, a dual-coverage\nfacility which would require four channels should be made available for\nthe future.\nNEW JERSEY\nNew Jersey, one of the smaller states in area, has a large (over\n90$) urban population, well distributed. It has 25 four-year colleges\nand universities and three two-year colleges with a combined enrollment\nof approximately 85,000 and a public school enrollment of nearly 1 million.\nNew Jersey, or rather the educational institutions in New Jersey,\nwas among the first to experiment with instructional television, but it\nhas been one of the slower states in developing this medium. This lack\nof progress in an area so well begun, has been due mainly to a lack of\npolitical interest and support. But several state department (such as\nthe Department of Conservation and Economic Development) have expressed\na desire to use instructional television to develop their programs, par¬\nticularly among the in-school population.\nA hopeful note in New Jersey came from Dr. Ernest E. McMahon, Dean of\nUniversity Colleges and Extension at Rutgers University. Dr. McMahon\nsays he plans to\n\"reach a wide general adult population with college level\nmaterials, in a variety of curriculum subject.\" He said,\n\"There is now and it will increase, a need to serve the huge\nexpanding population in New Jersey. Currently only the north\nand central New Jersey areas are being served with in-school\nclasses. Educational television is urgently needed to help\nserve the growing needs.\"\nThe growing need of which Dr. McMahon speaks is indicated in the\ngrowth of the population in this already densely populated area during\nthe last ten years. The advance in New Jersey’s population was 25$ during\nthis period.\nNew Jersey has six channels reserved for education. Properly used\nthese could serve, on a cooperative basis, the basic instructional needs\nof the state at this time. But, recognizing that the state university\nand college system may be more closely tied-in with in-service teacher\neducation and cooperative development of instructional materials for\nschools in the future, and reviewing the engineering report, there is\nevidence that these numbers should be at least doubled, in terms of the\nfuture needs."
}