{
  "id": "d23-107",
  "text": "TO: Messrs* Jim Miles* Waldo Abbott* and Ed Weggener\nFROM: John W. Dunn\nSUBJECT: FAE Production Centers Project\nUpon returning home to Norman, I reread Scott Fletcher «s letter to Jim Miles, dated\nApril 4, 1952* The fourth paragraph of this letter seems to justify the coiaaittee\nwhich was elected by the Board of Directors to assist in the administration of the\nfunds from FAE*\n\"I am writing to ask you and through you, your associates in NAEB, to\nevaluate the resources and technical skills of the several institutions\nwhich may be interested in having some financial assistance in program¬\nming, and to make recommendations to me for specific grants*8\nIt would seem to me that the use of the word MyouM in succeeding paragraphs is\nplural rather than singular* May I again affirm my stand which was taken during\nmeetings of the Board of Directors with regard to the relationship between NAEB and\nall foundation projects s\nThat NAEB maintain all control ever projects rather than that this con¬\ntrol be delegated to individuals who may or may not be in sympathy with\nthe ideals of educational broadcasting*\nFrom our several conversations on this project, several ideas erystalized.\n1. All active and associate members of NAEB would be given an oppose\ntunity to make application for grants under the terms of this\nproject.\n2. That regional directors will be asked to recommend that certain\nproduction centers, not affiliated with NAEB, b® permitted to make\napplication for project grants.\n3« That other than publicity to these groups, no widespread or gen¬\neral announcements be made regarding the proposed project, grants.\n4« That all projects will be in the field of adult education.\n5o That no moneys allocated under the project be spent for any equip¬\nment. Any special equipment needed specifically for the accomplish¬\nment of the project might be allowed.\n6. That legitimate expenditures under the project may include money\nfor script writers, production, program co-ordinator, key talent, or\nresearch.\n7o That the ceiling for any radio project will be $7,000, for any T¥\nproject $9*000; but that no production center will necessarily be\nallocated the maximum figures."
}