{
  "id": "d23-13",
  "text": "6. ABC and several of the parties supporting the objectives of the proposed\namendment —the confinement of announcements of mechanically reproduced pro¬\ngrams to those where the element of time is of special significance and where\nthe public might otherwise be misled— point out that the proposed form of the\namendment can be construed as requiring all mechanically reproduced speeches,\nnews events, news commentators, forums, panel discussions and special event\nprograms to be announced as such regardless of whether the element of time is\nof special significance. They urge that announcement requirements should not be\napplied flatly to such programs simply because they fall in one of the listed\ncategories but that the amendment should be clarified so that it can be con¬\nstrued only as requiring announcements when the particular program, because of\nits contents or its participants, might cause^the listening or viewing public\nto be misled Unless an accompanying announcement is made. These parties claim\nthat the element of time is not of special significance in every speech, forum\nor like program and a recordation announcement should not be required if such\nis the case. It is urged, for example, that there is no reason to require an\nannouncement in a case where a live newscaster*s commentary is supplemented by\nrecorded interviews if the manner of presentation precludes the creation of any\nimpression or belief that the recorded events are occurring simultaneously with\nthe broadcast. It is suggested that the necessary clarification be made by\nchanging the punctuation of the pertinent sentence in the proposed amendment\nor by deleting all reference to specific categories of programs which must be\nannounced as mechanically recorded. It is \"urged by those favoring the latter\nmodification that it is preferred, with only a general requirement that all\nmechanically reproduced programs in which the element of time is of special\nsignificance be announced, because of the natural tendency to accept illustra¬\ntions as all-inclusive.\n7. VJhlle agreeing that the proposed amendment properly restricts the\nscope of the mechanical reproduction rules to an area that takes into account\ncurrent broadcasting realities, NBC suggests that, in order to achieve as much\nflexibility as is consistent with the public interest, any ne\\ir mechanical\nreproduction rules should also exempt programs of one minute or less from\nannouncement requirements in the same manner as they are exempted under the\npresent rules; that mechanically reproduced commercial announcements and other\npolitical, public service and promotional announcements, even though they\nexceed one minute in duration, should be exempted completely from any announce¬\nment requirements since there is no reason to require such announcements in\nthese matters; and that any new mechanical reproduction rules should give\nbroadcasters the same option as is now present in the television rules to\nmake the requisite announcement of a mechanically reproduced program either\nat the beginning or at the end of the program. NBC points out that the Commis¬\nsion denied a request in 1950 (Public Notice 48056, Report No. 1639* March 20,\n1950) proposing that announcement of the use of mechanical reproductions be\nrequired before such a program instead of either before or after, as permitted\nby the TV rules, since it recognized that a choice was desirable in order to\nmaintain structural balance in programming. Southwest Broadcasters, Inc.,\nsuggests that identification announcements of mechanical reproduction be re¬\nquired only once for any programs of five minutes or less in conformity with\nthe present AM and PM rules. It is also suggested that even if the element of\ntime is of significance in programs consisting of news, speeches, etc.,\nidentification of mechanical reproduction should not be required unless the"
}