{
  "id": "d23-15",
  "text": "there is no necessity for stations taking advantage of the waiver to advise\nthe Commission, and that such a requirement would he unnecessarily \"burdensome\nto both the industry and the Commission*\n9* In opposition to the proposed amendment, Charles W. Balthrope, .\nSan Antonio, Texas, states that the present requirements of the mechanical\nreproduction rules are adequate and not excessive; that they have served the '\nbroadcasting industry well for many years; that no reason now exists for their\nchange; and that their relaxation might tend to dissipate the intent of these\nrules as far as proper identification to the listener is concerned. Richard\nBlanchard Jr*, of Hollywood, California, contends that the present announce¬\nment requirements of the mechanical reproduction rules are too lax; that\nstronger rules should be formulated to eliminate all doubt, in all types of\nshows including time-delayed programs, as to whether a program is live or\nmechanically reproduced* He urges, in particular, that the television rules\nbe amended to require an announcement both at the beginning and end of a\nprogram, as now required by the AM and I’M mechanical reproduction rules. He\nsubmits that the public is interested in knowing when a program is live or\nrecorded and not in the networks* time problem; that the fact that dramatic\nand other types of shows are live is a major factor in the public*s enjoyment\nof them, and that too much misleading data concerning mechanically reproduced\nprograms is now broadcast deliberately to give the impression that such pro¬\ngrams are live. While of the view that no harm would result from adoption\nof the proposed NARTB proposal, three broadcasters charge that the major radio\nnetworks give only lip service to the identification rules for mechanically\nreproduced programs by hiding the announcement under loud music, applause,\nor the like,, or by making a statement such as \"This is John Doe transcribing\nfrom New York”; that this approach is not justified by the facts of public\nacceptance but is probably done to suit the commercial sensitivities of the\nadvertising agencies, and that it has virtually rendered the public insensible\nto just what constitutes a mechanical reproduction. These broadcasters state\nthat if the comments received herein indicate a question of candor on the\npart of licensees with respect to the possible practical —though not\ntechnical*— violation of the rule, as has become the habit on some network\nprograms, .harm might result from adoption of either proposed amendment. How¬\never, they state that if the Commission takes strong action to require practi¬\ncal adherence to the rule as finally adopted, the question of adherence will be\nmoot, and the question of concern about the adoption of these amendments will\nbe resolved.\n10. The American Federation of Musicians, representing some 252,000\nprofessional musicians in the United States and Canada, opposes the NARTB\nproposal and any relaxation of the mechanical reproduction rules for the reason\nthat it would augment the practice of presenting mechanically reproduced music\nas if it were being produced live. The Federation states that it recognizes\nthe great advances made in the art of mechanical reproduction, but it urges\nthat where the techniques of mechanical reproduction are used indiscriminately\nto destroy the livelihood of musical artists whose abilities are exploited by\nthese techniques, serious problems are raised which warrant the Commission\nto require all mechanically reproduced musical programs to be announced. It\ncontends that basic to the problem is the impact upon those musicians who"
}