{
  "id": "d23-17",
  "text": "the AM mechanical reproduction rule only to the extent of permitting the\n\"broadcast of transcribed or recorded material of one minute or less without\nidentification* We explained in the Public Notice issued December 6, 1946,\nthat this amendment was made because the requirement of an announcement to\nidentify transcribed or recorded programs of one minute or less \"tended to\nrequire more interruptions for explanatory announcements than was necessary to\navoid deception of the public.\" Since that time the AM and PM mechanical\nreproduction rules have not been changed, except for the addition of the\nfootnote to the AM rule in 1947, as amended in 1948, waiving identification\nrequirements with respect to network programs which are transcribed and broad¬\ncast one hour later because of the time differential resulting from the\nadoption of Daylight Saving Time* The Commission was of the view that\nrepeated identification of such delayed broadcasts was burdensome to broad¬\ncasters and the public and unnecessary if an appropriate announcement\nwas made at least once daily.\n13. The present TV mechanical recordation rule was last amended\non November 28, 1945. Unlike the AM and PM rules, which require identifying\nannouncements both before and after programs of a longer duration than 5\nminutes and at each 30 minute interval also if longer than 30 minutes, the\npertinent television rule requires such an announcement either at the\nbeginning or end of a recorded program regardless of its length, including\nthose one minute or less, which are excepted -under the AM and PM rules. In\n1950 we denied a request to amend the TV rule to require an identifying *\nannouncement at the beginning of a mechanical reproduced program (Public\nNotice 48056, Kept. No. 1639, March 20, 1950)* We pointed out in our\ndecision that, in adopting the television rule, the time whun the identifying\nannouncement was to be made was left to the discretion of the licensee so\nlong as the viewer was not left with the impression that a mechanical\nreproduction consisted of live talent. We recognized that television licensees\nmight prefer to maintain structural balance in their programming by announcing\nthe use of mechanical reproductions at the end of a program instead of before,\nand we held that no facts were presented which warranted requiring an identi¬\nfying announcement before a television mechanical recordation.\n14. We have carefully considered the many comments filed in this\nproceeding, and we conclude that they point up the need for making the\nmechanical records rules for the AM, PM and TV broadcast services uniform and\nthe desirability of'additional relaxation in identification requirements along\nthe lines of the NAETB and ABC proposals* We are of the view that, in the\nlight of the present broadcast situation, the present identification require¬\nments are too stringent, and to the extent that they are, impose a needless\nburden on broadcasters and detract from the public*s enjoyment of programs.\nWe believe that the general protection afforded by the rules against any\naffirmative attempt by a licensee to create the impression that any broadcast\nby mechanical reproduction consists of live talent is adequate to protect the\npublic from harmful deception as to the nature of most programs and that\nspecific requirements as to identification of recorded programs and material\nat the time of broadcast are needed today only where the element of time is of\nspecial significance in such programs. Since the possibility of the public"
}