{
  "id": "d23-26",
  "text": "3 -\nthan luiMia pow*r.-/ Only on* of th* educational television\nstations now und*r construction (WGTV, Athens, Georgia, on Chan-\nn*l 8) will utilise maximum powwr. Of th* operating educational\n*®l«vi»ion stations listsd below? only six ars in th# UHF. It\nis contssplatsd that ths growth and sxpansion of educational\ntelevision will take ths fors not only of ths creation of new\nstations? but also of the improvement of the facilities of ex¬\nisting stations. The sane? of course? is true of commercial\ntelevision operations.\n5« The Commission has previously recognised the importance\n°T maintaining television service to viewers residing within\nthe outer limits of service of television stations as contem-\nky ***• Kules. It has also recognized the desirability of\nimproving service to these persons by increasing the power of\nexisting facilities* In all Instances the Commission has pointed\nout that no changes would be made in minimus mileage separations\nso as to deprive viewers of such service. This concern was made\nvery clear when rules were considered for UHF satellites in\nfrequencies above Channel 70* The Instant proposal itself recog.\nnlzes the possibility of interference from VHF boosters to the\nouter limits of service of television broadcast stations? and\nthe Commission initially rejected the proposal for VHF boosters\non this ground. Accordingly? the NAJBB wishes at this time to\nfocus attention on the necessity for providing sufficient safe¬\nguards so that there will be no interference if VHF boosters are\nV These stations *r«: WBIQ, Birmingham, Ala., Chan. 10} KQKD,\nSan Francisco, California, Chan. 9} KRMA-TV, Denver, Colorado,\nChan. 6} WTHS-TV, Miami, Florida, Chan. 2} WILL-TV, Urbana,\nIllinois, Chan. 12) WTTW, Chicago, Illinois, Chan, lit KLSE.\nMonro*, Louisiana, chan. 13j WYES, N*w Orloans, Louisiana,\nChan. 8} WGBH-TV, Boston, Mass., Chan. 2( WTVS, Detroit,\nMich,, Chan. 56| WEAR-TV, East Lansing, Mich., Chan. 60} KETC,\nSt. Louis, Missouri, Chan. 9} KBON-TV, Lincoln, N*b., chan. 12s\nWCET, Cincinnati, Ohio, Chan. 48} WOSU-TV, Columbus, Ohio,\nChan. 34} KOAC-TV, Corvallis, Oregon, Chan. 7} WHYY—TV,\nPhiladelphia, Pa., Chan. 35; WQED, Pittsburgh, Pa., chan. 13}\nWKNO-TV, Memphis, T*nn., Chan. 10} KUHT, Houston, Texas,\nChan. 8} KTCS, S*attl*, wash., Chan. 9; WHA-TV, Madison, wis.,\nChan. 21} WMVS-TV, Mllwauk**, wis., Chan. 10. *"
}