{
  "id": "d23-51",
  "text": "Before the\nFEDERAL COMMUNICATIONS COMISSION\nWashington 259 D. C.\nFCG 55-1197\n25602\nIn the matter of\nAmendments to Part 3 of the )\nCommission’s Rules to extend )\nCONELRAD to the Noncommercial )\nEducational FM and the International)\nBroadcast Services® )\n)\nDOCKET NO. 11568\nNOTICE OF PROPOSED RULE MAKING\n1* The Commission has before It the approved CONELRAD Plan for the\nNoncommercial Educational FM and the International B roadcast Services. This\nplan was developed in cooperation with licensees. Department of Defense and\nDirector, Office of Defense Mobilization, and government agencies concerned.\nIn order to put this plan into effect it is necessary to modify Part 3 of the\nCommission’s Rules as set forth in the attached Appendix. It is proposed to\nchange the title of the present Subpart G of Part 3 of the rules to read,\n\"CONELRAD FOR STANDARD, FM AND TELEVISION BROADCAST STATIONS.\" It is further\nproposed to add a new SLbpart H to Part 3 of the Rules as set forth in the\nattached Appendix.\n2. These proposed amendments are promulgated by authority of Sections\n303 (r) and 606(c) of the Communications Act of 193k as amended and Executive\nOrder No* 10312 signed by the President December 10, 1951.\n3» Any interested party who is of the opinion that the proposed\namendments should not be adopted or should not be adopted in the form set\nforth herein may file on or before January 3, 1956 a written\nstatement or brief setting forth his comments. Comments in support of the\nproposed amendments may also be filed on or before the same date. Comments\nor briefs in reply to the original comments may be filed within one week from\nthe last day for filing said original comments or briefs. No additional\ncomments may be filed unless, (1) specifically requested by the Commission,\nor (2) good cause for the filing of such additional comments is established.\nThe Commission will consider all such comments tiiat are submitted before taking\naction in this matter, and, if any comments appear to warrant the holding of\na hearing or oral argument, a notice of the time and place of such hearing or\noral argument will be given.\nk. In accordance with the provisions of Section 1,76k of the\nCommission’s Rules and Regulations, an original and Ik copies of all\nstatements, briefs, or comments shall be furnished the Commission\nFEDERAL COMMUNICATIONS COMMISSION\nAt t achment: Appendix\nAdopted: November 30, 1955\nReleased: December 2, 1955\nMary Jane Morris\nSecretary"
}