{
  "id": "d23-52",
  "text": "APPENDIX\n•'Change title of Subpart G to read 'CONELRAD FOR STANDARD, FM AND TELEVISION\nBROADCAST STATIONS’.'•\nSUBPART H - CONELRAD FOR ' NONCOMI ERCIAL EDUCATIONAL FM AND INTERNATIONAL\nBROADCAST STATIONS.\n3.1001 SCOPE AND OBJECTIVE\n(a) this subpart applies to all radio stations in the noncommercial\neducational FM and the international broadcast services located in the\nContinental U. S., and is for the purpose of providing for the alerting and\noperation of radio stations in these services during periods of air attack\nor imminent threat thereof.\n(b) Thd objective of these CONELRAD rules is to minimize the naviga¬\ntional aid that an enemy might obtain from the electromagnetic radiations from\nradio stations in the noncommercial educational FM and international broadcast\nServices, while simultaneously providing for a continued radio service under\ncontrolled conditions when such operation is essential to the public welfare.\n3.1002 ALERTING\n(a) All radio stations in the noncommercial educational FM and the\ninternational broadcast services licensed by the Federal Communications Commis¬\nsion are responsible for making provisions to receive the CONELRAD RADIO ALERT\nmessage and the CONELRAD RADIO ALL CLEAR, (as used herein the termHlicensed by”\nincludes every form of authority issued by FCC pursuant to which a radio station\nmay be operated, including constructions permits, station licenses, temporary\nauthorizations, etc).\n(b) The CONELRAD RADIO ALERT will be initiated by the Commanding\nOfficer of the Air Division (Defense) or higher military authority.\n(c) The provision of an adequate receiver, to monitor any standard,\nFM or TV broadcast station either by aural or by automatic means, during all\nhours of operation of noncpmmercial educational FM or international broadcast\nstations, will be considered as compliance with the requirements of paragraph\n(a) of .this section. Other means of receiving the CONELRAD RADIO ALERT may be\nauthorized by the Federal Communications Commission in special cases*\nNotes Every standard, FM and TV broadcast station will be\nnotified of the RADIO ALERT by telephone calls or by radio broadcasts.\nImmediately upon receipt of the RADIO ALERT, each standard, FM and TV broad¬\ncast station itfill proceed as follows on its normally assigned frequency:\n(1) Discontinue the normal program in progress.\n(2) Cut the transmitter carrier for approximately\n£ seconds.(Sound carrier only for television stations).\n(3) Return the carrier to the air for approximately\n5 seconds.\n(b) Cut transmitter carrier for approximately $ seconds"
}