{
  "id": "d23-6",
  "text": "- 5 -\ning is for broadcast at an hour not exceeding the time zone\ndifferential between the place where the program originates\nand where it is rebroadcast. Each station which broadcasts\nnetwork programs at a later hour in accordance with this\nwaiver shall make an appropriate announcement at least once\neach day between the hours of 10:00 a.m. and 10:00 p.m.,\nstating that some or all of the network programs which are\nbroadcast by that station are delayed broadcasts by means\nof transcription. This waiver provision also applies during\nthe annual periods in which daylight saving time will be ef¬\nfective with respect to network programs transcribed and re¬\nbroadcast one hour later because of the time differential re¬\nsulting from the adoption of daylight saving time in some areas.\n4. Section 3.653 is amended to read as follows:\n§ 3.653 Mechanical reproductions.\n(a) No mechanically reproduced program, whether visual or aural,\nconsisting of a speech, news event, news commentator, forum,\npanel discussion, or special event in which the element of\ntime is of special significance, or any other program in which\nthe element of time is of special significance and presenta¬\ntion of which would create, either intentionally or otherwise,\nthe impression or belief on the part of the listening audience\nthat the event or program being broadcast is in fact occurring\nsimultaneously with the broadcast, shall be broadcast without\nan appropriate announcement being made either at the beginning\nor end of such reproduction or at the beginning or end of the\nprogram in which such reproduction is used that it is a mechan¬\nical reproduction or mechanically reproduced program: Provided.\nhowever. That each such program of one minute or less need not\nbe announced as such.\n(b) The exact form of identifying announcement is not prescribed,\nbut the language shall be clear and in terms commonly used and\nunderstood. Any other program mechanically reproduced or series\nof mechanical reproductions, including a mechanical reproduction\nused for background music, sound effects, station identification,\nprogram identification (theme music of short duration) or iden¬\ntification of sponsorship of the program proper, need not be\nannounced as provided in subsection (a), but the licensee shall\nnot attempt affirmatively to create the impression that any pro¬\ngram being broadcast by mechanical reproduction consists of\nlive talent.\n(c) The requirements of subsection (a) are waived with respect to net¬\nwork programs, transcribed and rebroadcast at a later hour because\nof the time zone differential between the place where the program\noriginates and where it is rebroadcast, this waiver being applic¬\nable whether the off-the-line recording is made by the network it¬\nself at one of its key stations or by an individual station, but\nonly when the off-the-line recording is for broadcast at an hour\nnot exceeding the time zone differential between the place where\nthe program originates and where it is rebroadcast. Each station"
}