{
  "id": "d23-62",
  "text": "therein Would require reallocating several' of the upper UHF ’television\nchannels to industrial, scientific .and medical use. We are of the view,\nhowever, that the proposed translator operation should not be altered\nmerely on the strength of Lcnkurt*s alternative proposals. The urgent\nneed for television service, in isolated communities requires prompt\naction, and the public interest would not be served by delaying final\naction on translators'until final disposition of the Lenkurt petition.\nHowever, our action herein in authorizing the operation of translators\non. Channels 70-83 is without prejudice to any action on the Lenkurt request\nthat we may find the public interest requires.\n16. Several parties urge that translators should be limited to\nthose areas without local television service, .aid that translators should\nbe required t6 cease operation in any area after a local station goes on\nthe air. Cascade Broadcasting Company, permittee directly or through sub¬\nsidiary Companies of several television stations in the Pacific Northwest,\nmaintains that the operation of stations in small communities is marginal\nat best, so that competition from a translator could very easily.force such\nstations out of existence. Archer S. Tesy lor submits that translators\nshould be prevented from competing with regular television stations and.\n'threatening their existence.. He voices a fear that an existing station,\nunder the rules as proposed, could use a translator to extend its service\nfor the purpose of competing with other stations, far beyond its normal\nservice area. Columbia Broadcasting System, Inc., submits that translators\nshould be.authorized expressly for the purpose of serving \"shadow areas\"\nwithin the normal service area of existing stations, as well as to communi¬\nties outside such normal service area. To.prevent the use of‘translators\nfor the purpose of extending the normal service area of stations in order to\nencroach upon areas already receiving multiple signals, CBS suggests that\napplicants should be required to demonstrate a need for the type of service\ncontemplated.\n17. The forpgoing comments are concerned with the possibility\nthat translators may be employed to compete with ragularly established\nstations and suggest various rules for avoiding or limiting'such use.\nTranslators are intended primarily to provide a means whereby television\ncan be brought to. areas without service. Translators could also be employed\nto bring multiple services to communities too small to support several 'sta¬\ntions on a regular basis. We recognize that the use of translators in com¬\npetition with regular stations raises a number of serious questions. Never¬\ntheless, we do not agree that a universal, hard end fast rule governing such\nsituations should be adopted at this time. We believe, .rather., that such\nquestions can be more appropriately considered as they arise.,\n18. Several comments raise the question of the economic feasi¬\nbility of translators. Spencer' Kennedy maintains that-since translators'\nwould not originate local programs, they will lack an adequate financial\nbase. Archer S, Taylor and the National Community Television Association\nsubmit that dependence on voluntary contributions from the public represents\nan unsatisfactory means for financing. Spencer Kennedy states that inasmuch\nas the local community will be dependent upon continued translator' operation,"
}