{
  "id": "d23-63",
  "text": "-7-\napplieants should be required to obtain a permit from the community and\nshoulo. be required to deposit in escrow sufficient funds to ensure con¬\ntinued operation for at least 5 years. Archer S. Taylor suggests that\ntranslators be authorized to operate on a subscription basis, or be per¬\nmitted to present local commercials on slides. - The Association maintains\nthat translators will cost in excess of „>1000, and urges that applicants\nshould oe required to demonstrate that they have made adequate surveys to\ndetermine what equipment will be required for satisfactory service and that\nthey have adequate financial resources to construct and operate the stations.\n19• recognize that translators must be adequately financed\nto ensure their construction and operation during the term of authorization.\nNevertheless, we are of the view that the proposed requirements for an\nappropriate financial showing are adequate for the purpose and that trans¬\nlators can.be adequately financed under the proposal. We see no necessity\nfor or desirability in adopting any of the more stringent proposals advanced\nin the foregoing comments. With respect to the suggestions relating to\nsubscription operation, this general matter is the subject of -a separate\nproceeding (Docket No. 11279). With respect to the suggestions that\ntranslators be authorized to introduce local slide commercials, we believe\ntnat in tnis initial stage in their development, translators should be\nlimited to the rebroadcasting of other stations.\n20. Western Slope submits that fully automatic and unattended\noperation should be permitted so long as the manufacturer is required to\ninclude protective devices which will prevent radiation when no signal is\navailable or when there is a deviation from the authorized operation or\nfrequency. We believe, however, that in this initial stage, translators\nshould be attended by a qualified operator to insure satisfactory per¬\nformance, Moreover, translators are engaged in broadcasting and -Section 318\nof the Communications Act requires that a qualified operator be in atten¬\ndance of a broadcast operation. But it should be noted, in connection with\nthis general problem, that remote control operation of translators is per¬\nmitted and, as indicated below, other requirements are being relaxed. The\ncontrol point, under the rules, need not be manned continuously where\nsuitable automatic devices are provided to deenergize the transmitter.\ne believe that the rules we are adopting represent the maximum relaxation\nof supervisory requirements consistent with dependable service and protec¬\ntion of other services.\n21. .Sylvania Electric products, Inc., suggestsethat the proposed\nrules be modified to permit demodulation and remodulation techniques to be\nemployed in the operation of translators. We have carefully considered\nthis suggestion but -are of the view that such techniques would unduly in¬\ncrease the complexity of the transmitting apparatus and would thus neces¬\nsitate more supervision during operation. The direct frequency conversion\nmethod of operation is geared'to meet the objective of the present rules:\nto provide simple, inexpensive apparatus capable of operating with minimum\ntechnical supervision and least likely to affect adversely the operation\nof other stations."
}