{
  "id": "d23-71",
  "text": "- 4 -\nmay be authorized to provide additional reception. 4 separate application •\nis required for each television broadcast translator station and each appli¬\ncation' sha3.1 be complete in all respects.\n§ 4*733 (Heserved)\n§ 4.734 Remote control operation, (a) A television broadcast\ntranslator station may be operated by remote control, provided that such\noperation is conducted in accordance., with, conditions set forth in Sub-\nparagraphs (l) through (5) of this paragraph.\n(1) The control point shill be located on premises under\nthe control and supervision of the licensee or its\nagent. Facilities shall be provided at the control\npoint to enable the operator to observe the trans¬\nmissions of the television broadcast, translator\nstation at any time, and which will permit the\noperator to turn the transmitter on and off at will.\n(2) An operator holding a commercial radio operators\nlicense of any class issued by the Commission except\na Temporary Limited Radio Telegraph Second Class\nLicense or an Aircraft Radiotelephone Operator\nAuthorization, shall be in charge .of this control\npoint and shall observe the transmissions of the\ntelevision broadcast translator station at tho\ncontrol point within one hour after the start of\nany period of operation and during operation at.\nintervals of no more than six hours. The operator\nin charge shall promptly correct any condition of\nimproper operation observed and if unable or not\nqualified to do so under the provisions of Section\n4.750 .(d), shall immediately suspend operation until\nsuitable repairs can be made.\n(3) A cam rier operated device shall be installed at the\ncontrol point which shall give a continuous visual\nindication whenever the transmitter is radiating! or,\nin lieu thereof, a device shall be. provided which\nwill give a continuous visual indication when any\ntransmitter control circuits have been placed in a .\ncondition to produce radiation*\n(4) The control circuits shall bo so designed and installed\nthat failure of any part of the circuit which results\nin loss of control from the remote control point will\nplace the transmitter in an inoperative condition."
}