{
  "id": "d23-73",
  "text": "- 6 -\ns 4.737 Ant£gn-7 location. (a) £n applicant for a nc 17 television\nbroadcast translator station or for a change in the facilities of an existing\nstation- shall endeavor to select a site which will provide a line-of*-sight\ntransmission path to the entire area intended to be served and at which there\nis available a suitable signal from the primary station or stations. The\ntransmitting antenna should be placed above growing vegetation and trees lying\nin the direction of the area intended to bo served to minimize the possibility\nof signal absorption by foliage.\n■(b) A site within 5 miles of the area intended to be served is to\nbe preferred if the conditions in paragraph (a) of this Section can bo mot,\n(c) Ccnsi oration should bo given to accessibility of the site at\nall seasons of the year and to the availability of facilities for tho\nmaintenance and operation of the television broadcast translator station.\n(d) The transmitting antenna should be located as near as is prac¬\ntical to the transmitter to avoid the .use- of long transmission lines and tho\nassociated power losses.\n(©) Consideration should be given tc the existence of strong radio\nfrequency fields from ether transmitters at the translator site and the\npossibility that such fields may result in the retransmission of signals\noriginating'cn frequencies other than that of the primary station.\nEQUIP;'LENT\n1 4.750 Equipment -and installation, (a) An application for con¬\nstruction permit for a new television broadcast translator station or for\nchanges in the facilities of an existing station shall specify equipment which\nhas been type approved by tho Commission,\n(b) Type approval will be granted only after tests have been made\nat the Commission’s Laboratory, Laurel, Maryland. manufacturers may submit\na production mod^l for type approval and such approval, if granted, will be\nconsidered to apply to all identical models manufactured under that type\nnumber. No change, either mechanical or electrical, may be made in any type\napproved apparatus without prior approval of the Commission upon appropriate\napplication therefor. Type approval may bo withdrawn at•any time if the\napparatus fails to meet the requirements under which tqpe approval was\ngranted.\n(c) Type approval will be granted only if the apparatus meets\nthe following requirements?\n(l) The frequency converter and associated amplifiers\nshall be so designed that the electrical characteristics\nof the incoming signal will not bo altered significantly\nupon retransmission except as to frequency and amplitude,"
}