{
  "id": "d23-74",
  "text": "7 -\n(2) The overall characteristics cf the apparatus shall\nbe such that emissions on any discrete frequency\nmore than 3 Me above 'or bo low the upper and lower\nlimits respectively, of the assigned channel shall\nbo attenuated no less than 60 decibels below the\nvisual transmitted power, regardless of whether such\nemissions are generated within .the translator or are\nproduced as the result of on external signal introduced\ninto the input circuits of the translator apparatus,\n(3) The local oscillator employed in the. frequency\nconverter shall bo sufficiently stable that, subject\nto variations in ambient temperature between -15° and\n/55° Centigrade and power main Voltage variations of\n15a>, its frequency will-not vary more than 0.01 percent,\n(4) The translator shall bo, .so designed and adjusted\nthat its overall characteristics will remain essentially\nlinear under all conditions, cf operation. It shall bo\nequipped with suitable automatic, circuits to maintain a\nconstant output under conditions whore the intensity of\nthe received signal varies 20 decibels. If a manual\nadjustment is provided to.compensate for differing average\nsignal intensities which may be encountered in various\nlocations and installations, provision shall.be made for\ndetermining the proper setting of the manual adjustment\n.by moans of a meter or meter jack to measure direct\ncurrent of voltage of appropriate circuits in the trans¬\nlator, If improper adjustment cf the manual control;could\nresult in improper operation of the- translator, a label- : 1\nshall be affixed at the adjustment control bearing a. ..\nsuitable warning,\n(5) . The tube or tubes employod.in the final radio\nfrequency amplifier shall be of the proper rating to\nsupply the rated power output. The rated maximum peak visual power\noutput cf the translator shall.not be greater than 10 watts.\n(6) The ^apparatus shall-be equipped with suitable automatic\ndevices which will place.it in.an inoperative•condition\nin the, -absence of a visual and aural signal f^om the.•\nprimary station. Such.automatic devices may be provided\n.. with reasonable time constants to prevent momentary\n- failures of the incoming; signal from interrupting the\noperation. . • • •\n(7) In general, the transmitter shall be mounted on racks and\npanels or in totally enclosed frames protected as required\nby Article,,310 of the National.Electrical Code."
}