{
  "id": "d23-75",
  "text": "(8) (i) Any manufacturer desiring to submit a translator\nfor type approval shall supply the Commission with full\nspe cif i cation',.do tails (two sworn copies) as well as the\ntest data specified in this section. If.this information\nappears to meet the requirements of the Rules* shipping\ninstructions will be‘issued to the manufacturer. The\nshipping charges to and from the Laboratory.at Laurel,\nMaryland, ^shall be paid for by tho manufacturer. Approval\nof a translator will only be given on the basis of the\ndata obtained from a sample translator submitted to the\nCommission for test.\n(ii) In approving a translator upon the basis of the\ntests conducted by the Laboratory, the Commission merely\n. recognizee that the type of translator has tho inherent\ncapability of functioning in compliance with the Rules, if\nproperly constructed, maintained, and operated.\n(iii) additional Rules with respect to withdrawal cf _\ntype approval, modification of typo approval equipment,\nand limitations on the findings upon which type approval\nis based are set forth in Part 2, Subpart F, of the\nCommission’s Rules,\n(d) The installation of<a television broadcast translator station\nshall be made only by, or under the direct supervision of, a qualified\nelectronics engineer, .and any repairs or adjustments made during or sub¬\nsequent to the installation, which could result in improper operation, shall\nbe made by or under the direct supervision cf an operator holding a valid\nfirst or second class radiotelephone operators license issued by tho\nCommission.\n(e) The choice cf transmitting and receiving antennas is left to\nthe discretion of the applicant. In general, the transmitting antenna should\nbe designed to provide maximum signal over the area intended to be served\n-and toJ minimize radiation over other areas, particularly those in which\ninterference could be caused to tho reception of other stations. The\nCommission reserves the right to require the use of a suitable directive\ntransmitting antennas in order to permit the assignment^of the same channel\nto two or more television broadcast translator stations located in the some\ngeneral area. An application fer construction permit for q new television\nbroadcast translator station., or for changes In the facilities of an\nexisting station, shall supply complete details of the proposed receiving\nand retransmitting antenna systems, including an accurate plot of tho field\npattern of the transmitting antenna, if directive."
}