{
  "id": "d23-79",
  "text": "-12-\n(b) Any repairs or adjustments to a television broadcast trans¬\nlator station which might result in improper operation of the equipment\nshall.be made only by or under the direct supervision of a person holding\na valid, first or second class radiotelephone operators license issued by\nthe Commission.\n(c) The licensed operator on duty and in charge of a television\nbroadcast translator station may, at the discretion of the licensee* be\nemployed for other duties or for the operation of another station or sta¬\ntions in accordance with tbs class of license which he holds and the Rules\nana Regulations governing such stations. However, such duties shall in no\nwise interfere with the operation of the television broadcast translator\nstation.\n.§ lu767 marking and lighting of antenna structures. The marking\nand lighting of antenna structures employed at a television broadcast\ntranslator station, whore required, will be specified in the authorization\nissued by the Commission* Parc 17 of the Commission1s Rules sets forth\nthe conditions under which such marking and lighting will be required and\nthe responsibility of the licensee with regard thereto.\nI 7o8 Additional orders. In case the Rules contained in\nthis part do not cover all phases of operation or e:qperimentation with\nrespect to external effects, the Commission may make supplemental or\naaditional orders, in each, case as may be deemed necessary.\ns 1+*769 Copies of Rules. The licensee of a television broad¬\ncast translator station shall have current copies of Part 3, Part k, and\nPart 17-of the Commission's Rules available for use by the operator in\ncharge, and is expected to bo familiar with those Rules relating to the\noperation of a television broadcast translator station. Copies of the\nCommission*s Rules may be obtained from the Superintendent of Documents,\nGovernment Printing Office, Washington2$3i D.C., at nominal cost.\nOPERATION\n§ U-781 Station records, (a) The licensee of a television\nbroadcast translator station shall'maintain an operating log showing\nthe following: 6\n(1) Hours of operation.\n(2) Call letters, channel, and location of primary\nstation or stations,\n(3) Time of periodic observation required by Section\nIu73U(d), and operating conditions, signed-by the\noperator making the observation.\n(U) A record of all repairs, adjustments, maintenance, tests,\nand equipment changes, showing the date of such events, the\nname and qualifications of the person performing the operation,\nand a brief description of tte matter logged."
}