{
  "id": "d23-8",
  "text": "LJ jj*rt\n\\ l\\J ^ federal cOMMUNICATIONS COMMISSION\n[ Washington 25, D. C.\nReport No. 2928 BROADCAST ACTION\nThe Commission en banc, by Commissioners McConnaughey (Chairman), Hvde\nDoerier, Lee, Mack and Craven, took the following action on Oct. 5;\nRELAX RULES ON IDENTIFICATION OF RECORDED IR0GRAM3\nThe Commission finalized rule making which liberalizes regulations\npertaining to the identification of recorded broadcast programs\n115^6), effective Nov. 7. *\nHJBLIC NOTICE 0$\n36946) ^\nOctober 4, 1956\nr\n_ 11:1 substance, the eavei^lng'Ee partStlTdr- Qrtw relaxafc the present AM,\nand TV identification requirements for recorded programs to require\nUSi!u0rm^ aPProPrlate announcement, either at the beginning or conclusion\nof the broadcast, 31,17 with respect to recorded programs or material in which\nthe element of time is of special significance and the lack of an announcement\nJ: 6 he lmpr'388lon bellef in tbG mind of the listener or viewer\nthat the event or program is, in fact, occurring simultaneously with the\nbroadcast.\nNo identification will be required for recorded programs one minute\nor less in duration, and waiver of the recorded announcement requirements will\nbe permitted when network programs are transcribed and rebroadcast one hour\nlater by stations on standard time during the annual periede in which daylight\nsaving time is in effect and where network programs are transcribed and ro-\nbroadcast at a later hour because of the time differential. Under the waiver\nprovisions only a single daily announcement is required to identify all such\nprograms transmitted, for delayed broadcast. There is no requirement that the\nCommission be advised by any network or station taking advantage of either\nThe amendments make it clear that they do not require mechanically\nreproduced programs to be announced as such when the time element is not of\nspecial significance; they require only one identifying announcement either\nbefore or after the broadcast of recorded programs at the option of the\nlicensee when the time element is significant.\nThe changes .ore, in general, along the lines of proposals of the\nNational Association of Radio and Television Broadcasters (NARTB) and the\nAmerican Broadcasting Co. (ABC). The proceeding was initiated Nov. 16, 1955.\nIt affects the AM rules (Sect. 3.118); TV (Sect. 3.653); FM (Sect. 3.288) and\nnoncommercial educational FM (Sect. 3.588).\n__J\n- FCC -"
}