{
  "id": "d23-80",
  "text": "-13-\n(b) Where an antenna structure is required to be illuminated,\nsec Section 17.38, Recording of tower light inspections in the station\nrecord, of Part 17 of this chapter*\n(c) The operating log shall be made available upon request\nto any authorized representative of the Commission.\n(d) Station records shall be retained for a period of two\nyears.\n1 U.782 (reserved)\n§ U•733 Station identification, (a) The call sign of a\ntelevision broadcast translator station shall be transmitted in international\nMorse Code by means of an automatic keying device, at the beginning and end\nof each period of operation and during operation, within 5 minutes of the\nhour and half hour. This transmission may be accomplished either by\nturning the visual and aural carriers of the translator on and off in the\nproper sequence or by superimposing an audio frequency tone containing the\ntelegraphic identification, on the visual and aural carriers radiated by\nthe translator. The modulation level of the identifying signal shall not\nbe less than 30 percent of the aural signal.\n(b) The Commission may, in its discretion, specify other\nmethods of identification.\n(c) Call signs for television broadcast translator stations will\nbe mace up of the initial letter K or W followed by the channel number\nassigned to the translator and two letters. The use. of the initial letter\nwill generally follow the pattern used in the broadcast service, i.e,,\nstations west of the Mississippi River will be assigned an initial letter K\nand those east of the Mississippi River the letter W. The two letter com¬\nbinations following the channel number will be assigned in order and re¬\nquests for the assignment of particular combinations of letters will not be\nconsidered.\n§ h.78h Rebroadcasts, (a) The term \"rebroadcast\" means the\nreception by radio of the programs or other signals of a radio or televi¬\nsion station and the simultaneous or subsequent retransmission of such pro¬\ngrams or signals for direct reception by the general public.\n(b) The licensee of a television broadcast translator station\nshall not rebroadcast the programs of any television broadcast station or\nother television broadcast translator station without obtaining prior con¬\nsent of the sta.tion whose signals or programs axe proposed to be retrans¬\nmitted, The Commission shall be notified of the call letters of each\nstation rebroadca.st and the licensee of the television broadcast translator\nstation shall certify that express authority has .been received from the\nlicensee of the station whose programs are retransmitted.\n(c) A television broadcast translator'station is not authorized\nto rebroadcast the transmissions of any class of 'station other than a\ntelevision broadcast station or anbther television broadcast translator\nstation."
}