{
  "id": "d23-91",
  "text": "STATE OF WISCONSIN\nSTATE RADIO COUNCIL\nBOARD OF VOCATIONAL AND ADULT EDUCATION - DEPARTMENT OF PUBLIC INSTRUCTION\nDEPARTMENT OF AGRICULTURE - STATE TEACHERS COLLEGES - UNIVERSITY OF WISCONSIN\nRADIO HALL, MADISON\nRovember 6, 1954\nHr. George C. McConnsughay, Chairman\nFederal CoramnieetionB Coradsaion\nWashington 25, P.C.\nDear airt\n(ft\nBet Proposed Buie Making\nInter-eity Beley Stations\ny\nBecause of the negative vote in the Wisconsin referendum November 2\non the question of a statewide educational television networic, ve are not in\na position to make a specific request or file a formal comment in the review\nof existing rules regarding inter-city relay stations.\nKowever^the outcome of the referenda has a direct bearing on the\ninter-city relay problem, and we are therefore providing this informal report\nfor your background information.\nP\nOne of the main arguments of those opposed to state educational tele¬\nvision was that eoata are so high the taxpayers could not afford ouch a service.\nThe dseonain Committee on State-Owned ‘Hat-Supported Television, leader of the\nopposition to the proposed statewide network, stated that the relay service\nalone for the network would oost approximately <450,000 annually. This estimate\nwas based on an assertion that the WO rules would not permit the State of Wla-\nootmin to construct and operate Its own nlerowava system. The report of that\nCoalites wee widely quoted and was undoubtedly influential In defeating the\nplan. In addition, the opponents vigorously challenged the legality of the\nState Radio Council proposal In hearings before legislative eomittees end wed\n,the #450,000 relay ooat estimate as an example of prohibitive costs.\nIhe Wisconsin State Hallo Connell, an the other hand, offered a state¬\nwide educational television network plan in whioh the interconnecting alaroweve\nrelay service could he provided for an estimated aiwial oost of only #25,000., ,\nRetails of this proposal are oootalned in the accompanying copy of a msmorandia\ndit(»d October 26, 1954 on \"KLorowave Relay FaeilitlesHeeded.*\nThis plan, with Its oost estimate of only #25,000 annually, was ridiculed\nty the opposition as being wholly unrealistic in view of the present WC rules.\nAt the same time, we were unable to state positively that the State Radio Council's\nplan to construct and operate its own microwave relay system would be approved.\nAccordingly, we are forced to conclude that a factor in the defeat of the\nWisconsin educational television network plan Is an existing WC rule which per¬\nmits opponents to claim that the State oonld not construct and operate Its own\nrelay system and would, therefore, be obliged to purchase ocenon carrier service\nat e oost of approximately 3450,000 annually.\nCreated to “plan, construct, and develop a state system oj radio broadcasting for the presentation\nof educational, informational, and public service programs—Wisconsin Laws of 19U5."
}