{
  "id": "d23-93",
  "text": "\\ T°t\n, From?\nDate?\nWisconsin Legislative Council\nWisconsin State Radio Council\nOctober 26, 195U\nEDUCATIONAL TELEVISION\nMemorandum On\nMICROWAVE RELAY FACILITIES NEEDED\nfor\nNoncommercial Educational Television Network\nfor the State of Wisconsin\nI PURPOSE\nTo provide an educational television service throughout the state, a system of\ntwelve transmitting stations has been proposed0 Herewith is an outline of a\nmicrowave relay system to interconnect the twelve broadcast stations for simultaneous\ntransmission of the same programe\nIT DESCRIPTION\nThe proposed relay system is illustrated on the accompanying map. It consists\nof two main relay circuits a s follows?\n1. A two-way circuit between Madison ana Milwaukee. This link would make\nit possible to originate TV programs in either Madison or Milwaukee.\n2. A one-way circuit from Madison to the TV station located near Eau Claire\nvia Adams and Black River Falls with a branch circuit from Black River\nFalls to the TV station near LaCrosse.\nThese two main circuits would supply programs directly to channel 10 (Milwaukee),\nchannel 58 (Adams), channel 32 (LaCrosse) and channel 19 (Eau Claire). The remaining\nTV stations would be programmed by relay pick-up service as indicated on the map.\nFor example, channel 1x6 (Wausau) would be programmed by picking channel 58 (Adams)\noff the air near Wisconsin Rapids, converting to microwave frequency and transmitting\nover a microwave relay to Wausau. For same of the TV stations, as indicated on the\nmap, two such operations would be required. For example, channel 19 (Eau Claire)\nwould be picked up near Barron, transmitted by microwave to the Shell Lake station,\nthen channel 30 (Shell Lake) would be picked up near Cordon and transmitted by\nmicrowave to the Superior station.\nIll ESTIMATED RELAY CIRCUITS\nNo. of Hops\nMadison to Milwaukee (two-way) 3\nMadison to Eau Claire (Colfax FM site) 6\nPick-up of Channel 19 on Barron Hill (Barron County) relayed to Shell Lake 1\nPick-up of Channel 30 near Gordon relayed to Superior Station 1\nPick-up of Channel 30 near Hayward relayed to Park Falls Station 1\nPick-up of Channel 58 near Wisconsin Rapids relayed to Wausau Station 1\nPick-up of Channel 21 on Blue Mound relayed to Highland\nBlack River Falls relay station (on Madison to Eau Claire link)to LaCrosse 1\nPick-up of Channel 58 near Berlin relayed to Chilton Station 1\nPick-up of Channel 2 h near Green Bay relayed to Marinette Station 1\nTotal two-way hops 3\nTotal one-way hops"
}