{
  "id": "d783-1",
  "text": "2\n2. Since it is during this process that the speed is reduced\nfrom 15 to this will be the greatest single loss of\nquality in the entire operation* It is, therefore, reasoned\nthat the very finest equipmant be obtained to minimize this\nloss as much as possible,\n3* Since the masters sent to the Network are made on many dif¬\nferent types of machines, it i s highly desirable to duplicate\nthese masters on equipment that can be adjusted easily to\nagree with the equipment making the original*\n2i« Since the determining quality is established by the primary\nstandards, it is essential that Network headquarters have\nequipment capable of performing at this level* This equip¬\nment, properly maintained and tested, will in a practical\nsense be the first link in the process of establishing\nstandards.\nThe Group specifically recommended the Ampex 300 tape recorder for this\napplication* It is recommended that two of these be purchased immediately to re¬\nplace all other equipment which is now used to duplicate master tapes* The ap¬\nproximate cost of two Ampex 300 tape recorders is $3,600.00\nThe purchase of the Hewlett-Packard test equipment was endorsed by\neveryone in the Group,\nHead Alignment: The Group agreed that the problem of head alignment\nwas mainly one of fully informing everyone of the proper technique to use* It was\nsuggested that a tape recorded program be circulated around the Network which\nfully explains the correct procedure to follow in aligning the recording heads*\nSeveral practical tips were offered as means in which this could most effectively\nbe carried out*\nBasic Standards: The first seven basic standards were agreed to in\nfull. The eighth basic standard, \"Electrical Characteristics\", is not complete\nat this time and much more work has to be done before I would recommend issuing\nit. The basic standards are grouped into two catagories, primary standard and\nsecondary standard. The primary standard are the highest attainable today using\nthe finest equipment and a speed of 15 ips* The secondary standards are accept¬\nable standards for use in playback.\nThe basic standards which are most complete at this time are:\n1, Type of tape:\nA* Plastic back—red oxide.\n2. Type of wind:\nAo Tape wound with oxide in—(\"A\"- wind)*\n3* Reel size:\nA. Primary standard—10(NARTB)\nB* Secondary standard—7\"«"
}