{
  "id": "d783-107",
  "text": "THIS GROUP SHALL HAVE FULL AUTHORITY TO ACCEPT OR REJECT PROGRAMS WHICH SHALL\nBE OFFERED ON THE TAPE NETWORK. NO OTHER CROUP OR INDIVIDUAL CAN COMMIT THE NET¬\nWORK TO ANY OFFERING.\nCost:- four meetings yearly\nif regionally centered $1,000.\nif nationally chosen $2,000 - $3,000.\n3.- At least one station has asked the tape network to defray some of its costs\nin securing a show for the network. This whole matter seems to hinge around\nthe question of intent. If the station is going to some expense to secure\na show and would do so even if it were not offered on the network — then\ncertainly no payment should be made. The reverse certainly should be true\nwithin limitations. Certainly if the network were to add even the modest\nsum of $10.00 per hour for each show secured the cost would soon eat us up.\nAdd $5,000 yearly to the cost of operation and the membership fees would\nhave to be increased sharply.\nPROPOSAL:- THE NAEB TAPE NETWORK MANAGER SHALL MAKE EVERY EFFORT TO SECURE ALL\nSHOWS AT NO COST. IN NO EVENT SHALL HE PAY MORE THAN $10.00 PER HOUR (Plus\nsupplying the tape). IN NO EVENT SHALL HE AGREE TO PAY ANY STATION MJKE THAN\nITS YEARLY SERVICE ASSESSMENT.\n1*.- Much has been said about \"in-school\" programs on the tape network. There\nare at least three distinct types — those used by school stations with a\nmaster teacher plan — those without a master teacher plan — and those\ncollege stations who work on a regional basis© There is a school of\nthought that holds out for evaluation similar to films. Others say the\nfilm evaluation never meant anything and neither will this. There are\nmany other points of disagreement so that this seems like the best.\nPROPOSAL:- THE WHOLE QUESTION OF IN-SCHOOL PROGRAMS OFFERED ON THE NAEB TAPE\nNETWORK IS REFERRED TO THE PLANNING GROUP (See NAEB Kellogg Project below)\nWITH INSTRUCTIONS TO DELINEATE THE PROBLEMS AND~SUG(&ST WORKING CROUPS WHO GAN\nRECOMMEND WAYS TO SOLVE THEM.\nEstimated cost:- for one meeting each for three groups\nif regionally centered $1,500.\nif nationally chosen $2,500 to $3,500.\n5.- The master file problem is not as urgent as others at this time. Nor is\nthere any clear recommendation to make. There seems to be no danger to the\ntapes until hot weather therefor I make the following;\nPROPOSAL:- THE NAEB TAPE NETWORK MANAGER SHALL BRING IN A RECOMMENDATION ON\nTHE PROPER STORAGE AND HANDLING OF TAPE MASTERS FOR APPROVAL AT THE NEXT BOARD\nOF DIRECTORS* MEETING."
}