{
  "id": "d783-108",
  "text": "-3-\n6.- The relationship between the Network Manager and the Executive Director\nas presently existent is not a problem* I felt originally that this should\nbe more carefully spelled out for years to come« As of this wilting I am\nnot too sure that there needs to be two executives in the Headquarters*\nOffice* Much of the work that Rider has been forced to do could as well be\ndone by a chief clerk. Similarly, once the pattern is set — certainly by\nthe end of this year — Miles* successor would be available to do more.\nIt is a problem that needs only thought at this time. Therefore, I\nmake the following:\nPROPOSAL:- MILES AND RIDER SHALL EVALUATE THEIR JOBS AND BRING IN A RECOMMENDATION\nAT THE NEXT BOARD OF DIRECTORS* MEETING. ALL BOARD MEMBERS SHALL BE THINKING OF\nPOSSIBLE SUGGESTIONS FOR MILES* SUCCESSOR AND SHALL COMMUNICATE SUCH SUGGESTIONS\nTO THE PRESIDENT. MILES* SUCCESSOR SHALL BE SELECTED AT THE NEXT BOARD OF\nDIRECTORS* MEETING AND SHALL BE RECOMMENDED TO THE UNIVERSITY OF ILLINOIS FOR\nAPPOINTMENT. HIS TERM SHOULD OVERLAP MILES BY AT LEAST ONE PDNTK.\nNAEB HEADQUARTERS\n1. - Several discussions have been held regarding the charging of some of the\nactivities normally borne by the NAEB treasury to the Kellogg Grant.\nRealistically we must at the end of five years support outselves. Inasmuch\nas this is the paramount issue I make the following:\nPROPOSAL:- ALL OF THE ACTIVITIES WHICH NAEB HAS NORMALLY CARRIED ON THAT CAN BE\nTRANSFERRED TO HEADQUARTERS SHALL BE SO TRANSFERRED. THE MONIES IN THE NAEB\nTREASURY SO SAVED SHOULD BE LEFT THERE AGAINST THE DAY WHEN THE GRANT STOPS. NO\nUNUSUAL EXPENDITURES FOR SUCH THINGS AS BOARD MEETINGS, ENGINEERING OR LEGAL\nTALENT SHOULD BE ALLOWED UNLESS AND UNTIL THERE IS PROVIDED A WAY TO CARRY ON\nWITH SUCH ACTIVITIES AFTER THE GRANT IS ENDED. THIS APPLIES* ONLY TO REGULAR\nOCCURANCES — SPECIAL PROJECTS SHALL BE CONSIDERED ON THEIR MERIT... ..\n2. « The Executive Director has attempted to visit as many stations as time would\nallow. He has in every instance tried to tie such visitatiorjup with a meet¬\ning or other event — thus expenses are held to a minimum. Both the head¬\nquarters and the station benefit from this visit. It has been suggested\nthat regional directors should do this visitation. I personally do not\nfeel that this will have the effect of strengthening the central source of\ninformation which headquarters should be. Perhaps in the light of the recent\nemergence of the headquarters operation the duties and responsibilities of\nthe regional directors should be re-examined. This question too might be\ntossed to the planning group for delineation and recommendation.\nPROPOSAL:- THE EXECUTIVE DIRECTOR SHALL VISIT AS MANY MEMBER INSTITUTIONS AS\nTIME AND MONEY WILL ALLOW — ALWAYS TYING THAT VISIT TO A MEETING IN THE VICINITY\nWHENEVER POSSIBLE."
}