{
  "id": "d783-116",
  "text": "/\nAugust 29, 1932\nMr. Robert VanDuyn\nW. Km Kellogg Foundation\nBattle Creek, Michigan\nDear Bob*\nMany thanks for your fine letter of August 19 and for the attached check.\nThe check has been properly credited to our account by the University of\nIllinois Business Office.\nThanks, too, for the kind words on our progress report. I do think we have made\nprogress this past year and am very hopeful for the year to come. We are pro¬\nceeding with the idea of making the Minneapolis nee ting more than just a \"con¬\nvention.Incidentally, we would be happy if you and Hugh could find tine to\nattend this nee ting. It will be held Koventoer 6-7-8. 1 will be happy to make\nany reservations for you which you desire.\nAs you know, I do agree that an \"improvement program for NAEB and its board\"\nis a must. Would there be any possibility of us talking about this further\nin the very near future? I plan to be in Urbana most of the time between now\nand tiie Minneapolis meeting so would be available whenever It seems convenient\nto you.\nI will remind the Board again of our responsibility for evaluation of the\nproject. I assure you a complete evaluation will be accomplished.\nIn answer to your specific question regarding what progress has been made to¬\nward the accomplishment of Purpose 3, nay I point out the followings the Regional\nConference held in Norman, Oklahomaj the All©rton Conference held in June) and\nthe Iowa State College TV Works hop just concluded. These have all helped on\nthe first two points mentioned under this purpose. They have more adequately\ntrained personnel. They have concentrated some expert attention on the problems\nof educational station management. They have provided sessions on surveys and\nstudies. They have carefully examined the knotty problems of programming and\nproduction.\nI don’t mean by the above that we have done all that could have been done or\nwill be done, but I do think we have made a fine start.\nThere are at the moment 87 active members of NAEB. 70 of these subscribe to\nthe NAEB Tape Network. To the best of ny knowledge there are but 10 to 20"
}