{
  "id": "d783-118",
  "text": "\\ 0 Q UMV exJLJ^ ,\nJL , \\) Lsu /K-O (jL-^yf^v.\nS' - T^O-'U- c^-o^^wT\" (\nH, juXju^^tZ^'^iL-Q.\nBATTLE CREEK, MICHIGAN\n, _yj\nt-7 J0qx cu /vuctw\nai2^W. K. KELLOGG FOUNDATION\nDIVISION OF EDUCATION\nHUGH B. MASTERS\nDIRECTOR\nAugust 19, 1952\nROBERT G. VAN DUYN\nASSOCIATE DIRECTOR\nMr. Jim Miles, Executive Director\nNational Association of Educational Broadcasters\nUniversity of Illinois\n119 Gregory Hall\nUrbana, Illinois\nDear Jim:\nThe delay in answering your letter is due to the fact that for the\npast many days we have been having budget hearings and have as a part\nof this activity been making a very complete review of the NAEB project-\nproposal, progress reports, and supplementary materials.\nYou and your staff has developed an excellent report on the work\nthat is being carried on and there seems to be ample evidence that con¬\nsiderable progress has been made. We are, of course, pleased and de¬\nlighted to know that the tape duplicator is in use. The very fact that\nduring the past year NAEB has developed permanent headquarters and es¬\ntablished a tape network is a real accomplishment; and plans for the\nsecond year seem to offer many possibilities for even further growth\nand development. The convention planned for this fall in Minneapolis\nwould seem to be an excellent next step. We are agreeable to the sug¬\ngestions in the proposal that special speakers and consultants be used\nas needed for this meeting.\nEven though there has been some excellent accomplishments made\nduring the first year, we share with you a real concern in many ways\nfor the program.'7 We hope that in the year ahead the NAEB Board, with\nthe assistance of the staff, will be able to develop a more effective\nkind of operation with respect to its many and varied activities^’ It\nwould seem wise to set up an improvement program for NAEB and its\nBoard using outside consultants until after its own staff and the easily\naccessible help from the affiliated agencies are used. We are most sym¬\npathetic with the problems confronting the Board and are more than will¬\ning to be helpful in any way we can. Also, are there not others within\nthe institutions from which the Board members come that they could draw\nupon for counsel and advice? We would like to do some thinking along\nthis line with you, if you think it has merit.\nWe also hope that the staff and the Board will be able to lay a\nbasis for a more systematic and complete plan of evaluating the work\nof this particular project than seems to have been done so far. We\nrecognize at least some of the difficulties involved, but believe that\nit must be done and that the full responsibility for doing so rests with\nthe Board and the staff."
}