{
  "id": "d783-34",
  "text": "HEADQUARTERS REPORT\nThe first year of the educational broadcasting project sponsored by the\nKellogg Foundation can truly be called a shakedown. year© It is said that broad¬\ncasting in its broadest scope is one of the min elements of mass communication©\nWhile the NAEB may have solved many of the problems of mss communication# it\nstill found basic communication very difficult0 When -you add to this the fact\nthat there Here many problems which demanded the ultimate in communication# you\nbegin to get some idea of the magnitude of the task© That we have been able to\nhold together at all is perhaps a major accompli,shrasnto To say that we have actu¬\nally forged ahead and are on more solid ground than a year ago ia# in effect# great\npraise©\nIt is important to be historical for a moment# especially for the bene¬\nfit of those who may read this report and do not have tbs background of active\nRAEB-crSo NAEB organised under this name in 193i|. from v.he dying embers of what\nwere once the strong fires for educational broadcasting >f the mid-twenties» It\nmanaged through the late thirties and the war years of the forties to stay in exist¬\nence — but progressed very little® The end of the war* the opening of the FM band#\nand the allocation of 20% of the FM channels for educations! purposes — largely at\nthe Instigation of NAEB — breathed new life into those embers* The next bit of fuel\nadded was the strengthening of the News-Letter# taking it avvy £rom. a strict house\norgan function and making it a voice for educational broadcai tinge The fires were\npushed to white heat By the Allerton Seminar of X9k9 and kept, there by the sub«\nsequent seminar in I9$0o The seminars gave form to the idea of the tap® network\nwhich was quickly inpleioBntedp The continued associations prompted the then K&EB\nPresident to call a special meeting from which was formed the Joint Committee on\nEducational Television©\nThe membership rightfully felt that it had gone perhaps as far as it\ncould go under its own power and so as led its emissaries to send out fosiers for"
}