{
  "id": "d783-4",
  "text": "Page 2\nCo He has consistently said that this sort of development\ntakes time since it is his sideline businesso\nUnless I misjudge Too good., there are other reasons for his not\nbuilding a duplicator for* us that he has not mentioned* These\nmay be?\nA© He is concerned about competition0 He has complained\nto me about the Georgetown installstiono\nBo He is not particularly impressed with our needo I\nbelieve he said he supplies .SPOstations himselfo\nCo He does not want to do business mth the University*,\nPerhaps he is sensitive about the bidding* the con¬\ntracts, the legal points in generalo\nDo Our close proximity makes him fear that we can easily\nhound him about the performance, repairs, breakdowns,\netc*, The two he has sold are many miles away from him*.\nJust coincidence???\nEo He wants our duplicating business« This has never been\npointedly discussed* It would not be like him to take\nthe initiative on this r.\n3o As bad as the head situation is, something could be worked out\nat this time0 If we could obtain 11 Ampex. Presto, or other\ngood heads at this time, a duplicator could be put into opera-\ntionc If more of the same heads are not available we could\noperate about two to three thousand hours with the first ones\nwe obtainedo This would be about a year* The mi chine then\ncould be adapted for other better available heads at that time.\nIn other words, m would be compromising on the electronics at\nthis time* However the mechanical mechanism is about at a state\nof practical perfection*,\niu There is sons indication that Ampex Electrical Carp* lias devel¬\noped something in the i*ay of a mass duplicator. If sor this\nshould be investigatedc\n$Q I am assuming that it is most important that something be worked\nout in the way of mass duplicating before June*,\n6<o It is still most important, tec*inicalXy, that a single mandrel\ntype of mass duplicator be obtainedo\nOn the basis of the foregoing, it appears to me that we have only one\npossible course to follow»"
}