{
  "id": "d783-5",
  "text": "Pag© 3\nWe should immediately make some concerted effort to determine whether\nor not and when Too good will build us a duplicator 0 This should b© a,\nserious, high level, well-=planned visit* It should be an all-out\neffort to persuade Toogood to build this machine* If this fails-—\nif no promise is obtained to build this machine within a time limit\nwhich is felt necessary, then we have the following alternatives©\nlo Find someone else to build the thing©\n20 Build it ourselves©\n3o Use commercial stock equipment0\nA glance at the alternatives should impress us with the importance of\ngetting Toogood to build this machine himself© Some thought should be\ngiven to the following questions©\n1© Why has he built two machines for other people and not for the\nUniversity? Does he fear that we511 compete? Were they\nfriendly agreements? Was he pressured into building them? Did\nhe simply build them as experiments, as test models?\n2© If we suddenly came up with 11 good heads someihere, wuld he then\nbuild for us? This is about what happened with the Canada deal©\nHe said that he was impressed when the fellow showed up with\na dosen Presto heads©\n3o Would Toogood weaken if he felt we were going to get someone\nelse to build the duplicator for us?\nko Would it expedite matters if he were offered a retainer fee\nfor the year following the installation of the duplicator to\nreln^mrse him for any attention he has to giv© the machine©\nSo Would it ease his mind if the machine were rented from him\nrather than purchased? Therefore he could reclaim the machine\nif it were used in competition with him-?\n6© Is it possible that since we are a very good customer of 3M\nand sine© Toogood depends upon 3M a great deal that some pres-\nsure could be brought to bear on Toogood by 3M?\nFrankly I have not made any headway with Toogood in the last six months©\nI believe some decision should be mad© at this time as to which course\nto follow,,\nRobert H© Johnston\nRecording Engineer"
}