{
  "id": "d1312-0",
  "text": "■\nA E B\nEngineering Newsletter\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 GREGORY HALL DECEMBER, 1957 URBANA, ILLINOIS\nTV TECHNICAL TIPS (October)\n—Cecil S. Bidlack\nDuring the second week of September, I had the\nopportunity of visiting CBS Television City in Holly¬\nwood and both its kinescope and videotape recording\ninstallations. Consequently, I can give you a brief\nfirst-hand report of my observations.\nCBS has five Ampex prototype videotape\nmachines installed and in service. Since most of the\nWest Coast television network programs are delay¬\ned', I had the opportunity of seeing VTR pictures in\nthe control room and on the air. The picture quality\nis excellent although a light fine grain noise could be\nseen both in the control room and on my hotel room\nreceiver. The amount of this noise varies with re¬\ncording heads and with head life. However, the\ntaped picture is a noticeable improvement over the\nkinescope recordings I saw in Los Angeles last\nOctober.\nThe problem of interchangeability has not yet\nbeen completely licked although progress is being\nmade in the development of new recording heads.\nLack of uniformity in different production runs of\nrecording tape is still a problem although both head\nlife and tape uniformity are being approved and 100\npasses of the tape and comparable head life are be¬\ning achieved. Due to the problem of interchangeabi¬\nlity, when long delays of program material are en¬\ncountered, the head and tape must be stored together\nfor playback or a kinescope recording made as a\nprotection copy. The revolving head and guide mech¬\nanism is changed as a unit. This can be accomplish¬\ned in fifteen minutes when everything clicks.\nA bulk erasing machine has been developed to\nerase videotape. The reel is placed on a spindle which\nrevolves slowly as the reel of tape is moved slowly\ninto and out of the field of a large degaussing coil.\nWhen the tape was erased by hand, no two operators\nsecured uniformity of erasure. Now that the machine\nNAEB Engineering Newsletter\nDecember, 1957\nNAEB Engineering Newsletter, a quarterly publication issued\nby the National Association of Educational Broadcasters, 14\nGregory Hall, Urbana, III. $2 a year, edited by Cecil S. Bid-\nlaclc.\nhas been developed, uniformity is assured and no re¬\nsidual magnetism is left on the tape.\nIn the kinescope recording room nine or ten\nmachines (I lost count) are installed, both 16 and 35\nmm. All recording is done double system. Mechanical\nshutters are used and sound tracks are recorded on\nquarter inch standard magnetic tape on Fairchild re¬\ncorders. Two optical sound on film recorders are also\navailable. Since the output of the recorders is negative\nfilm, network playback is from the negative picture.\nThe sound track is played back on a Fairchild re¬\ncorder which is synchronized with the picture.\nAn interesting facet of the film operation is that\niconoscope film chains are universally used for all\nmonochrome film playback. Through a patching\npanel any projector and its associated camera chain\ncan be patched to any control room so that complete\ncontrol of the projector is from the studio on the air.\nAt present color film is shown on flying spot scanners\nalthough 3-Vidicon color film cameras are being in¬\nstalled since dense color film cannot be shown on\nthe scanners. 35 mm. film is used exclusively, which\ngive almost live film quality and excellent kinescope\nquality.\n* * * -x- *\nAnother network practice that, I’m sure, will be of\ninterest, is the use of “protection” copies. ETV\nstations buy one kinescope recorder which is expect¬\ned to produce results 100% of the time. I was\npresent in the CBS kinescope recording room when a\n1"
}