{
  "id": "d1312-1",
  "text": "program was being recorded. Four kinescope recorders\n(two 16 and two 35 mm.), two magnetic sound re¬\ncorders and an optical recorder were used. No doubt\na videotape copy was being made too, but that facili¬\nty is located some distance away from the kine room.\nThe same use of a “protection” copy is made on\nplayback. I saw a videotape recording on the air\nbacked up by a 35 mm. kinescope recording. They\njust don’t take a chance of losing a program on the\nair - it costs them money.\nOf course I realize that ETV stations don’t have\nthe funds or the personnel which are necessary for\nthis type of operation. However, it does point up the\nfact that 100% reliability is difficult to achieve unless\nsome such procedure is followed.\n*****\nAnother operating practice which ETV stations\ncan, and which many of you I hope are following, is\nthat of showing “ corners” on your image orthicons.\nIf you’re using second-hand camera tubes, then I\nrealize you’re limited because of previous scanning.\nBut if you’re using new tubes, don’t be afraid to\noverscan them on the air. I was surprised to see “big,\nfat corners” showing on the live monitors which ob¬\nviously had to be adjusted to show the entire raster.\nI was informed that this is standard operating\nprocedure.\nBy following such a procedure, you get increased\noperating life, increased resolution because you are\nusing more of the target, and if deflection drifts, the\nvideo control operator is aware of it. Yet, I have\nvisited stations where there was no monitor adjusted\nso that the entire raster could be seen and no corners\ncould be seen on the camera viewfinders. Consequent¬\nly, no one knew how much they were underscanning\nthe target.\n*****\nFor these NAEB stations who have Magnecord\nPT6-A and PT6-J magnetic tape recorder combina¬\ntions, factory modification information is now avail¬\nable which will bring these machines to conformity\nwith those having NARTB approved response. The\nchanges are simple for those PT6-J amplifiers that in¬\ncorporate the 5881 output tubes and a 5879 input\ntube. We’ll be glad to supply Thermofax copies upon\nrequest; or you can get the original by writing to Mr.\nHugh J. Daly, General Sales Manager, Magnecord,\nInc., 1101 South Kilbourn Ave., Chicago 24, Illinois.\nThe schematic is on 8% x 11 paper which makes\nsome component values a bit hard to read on our\ncopy. Necessary modifications for the PT 63-J and PT\n6-BN will be made available later.\nA search through the files of these columns fails\nto disclose mention of an article in the SMPTE\nJournal for February 1955, “A Short History of\nTelevision Recording” by Albert Abramson. It con¬\ntains an excellent bibliography on television recording.\nOn writing to Mr. Abramson for permission to re¬\nprint his article, we discovered that the material it\ncontains is taken from his Electronic Motion Pic¬\ntures, published late in 1955 by the University of\nCalifornia Press. We suggest this book as recom¬\nmended reading for any television engineer, for it is\nreally a history of the television camera and con¬\ntains a very complete bibliography on the develop¬\nment of television equipment and processes.\nWe had the opportunity of meeting Mr. Abramson\nwho is employed by CBS-Television in Hollywood.\nHe graciously conducted Merlyn Rawson and me on\na very complete tour of the CBS Television facilities.\n*****\n“Is Portable Test Equipment Portable?” is the\ntitle of a short article in September 1957 Electronic\nIndustries and Tele-Tech. It’s a summary of a cur¬\nrent test equipment study being conducted at the\nU.S. Navy Electronics Laboratory in San Diego. The\nmilitary services have found that technicians fre¬\nquently will not use certain items of test equipment\nsimply because they are too large and bulky to carry\neasily.\nThe factors of weight, width, height and length\nwere investigated. On the basis of this investigation,\nthe maximum acceptable dimensions have been set\nat 8 inches wide, 18 inches by 18 inches long with a\nmaximum acceptable weight of 14 pounds. It’s good\nto know someone is making a study to determine what\nportable really means. Maybe this study will help\nbreak down the usual criterion of portability - “it\nhas handles.”\nMuch has been done in recent years to improve\nthe design of radio and television equipment for\nfield use. We can remember the old radio days when\namplifiers, mixers and volume indicator meters were\nbuilt as units on iron panels with audio transformers\nencased in iron cases and then packaged in oak cases\nan inch thick. Those too, were the days of battery\noperated amplifiers where you lugged a 6-volt A\nbattery and 180 volts of B battery, also in a sturdy\noak case, to the top of the stadium.\nThe present-day engineer can carry his transis¬\ntorized amplifier and the rest of his equipment in a\ncamera gadget bag or briefcase, ride to the heated\npress box in an elevator, plug the amplifier into the\nAC line, attach the broadcast line and he’s ready to\n2\nENGINEERING NEWSLETTER"
}