{
  "id": "d737-100",
  "text": "A record may be dubbed by plugging an external phonograph (High Impedance)\ninto the dubbing jack and proceeding with recording as for radio.\nAmplifier Connections and Data RA10:-\nFigure G shows the connections and cables for the portable recorders Models\n212RP and 16RP when used in conjunction with the Model RA10 recording amp-\nThe cables are furnished with the amplifier and their connections are clearly\nmarked in the illustration* Please note that the recorder AC cable plugs\ninto the receptacle on the amplifier, and the amplifier connects to the AC\nsupply line directly.\nThe RA10 Recording Amplifier has a power consumption of 75 watts, on 117\nvolts AC, 60 cycles, 9\nTubes Used: 1-6F5G, 2-6C8G, 2-6N6G, 1-6Y4G,\nThe combination of the Model RA10 amplifier and either the Models 212RP or\n16RP portable recorder is equivalent to the standard Models 212RC or 16RC\ncomplete recording systems. The operation of the complete combination unit\nis described in this instruction book on page 6 and this may be used in\nits entirety in the operation of the portable setup as illustrated in Figure\nU,\nService Notes-\nThe combination Models 212RC and 16RC have been designed so as to give\nquick and easy access to the tubes In the amplifier should it become neces-\nsary to do so.\nThe ampiifier is fastened to the front of the case, which is hinged on the\nbottom. Removing two screws in the upper corners of the large control panel\nand two screws on the SIDES of the case, near the front, allows the ampli¬\nfier to swing forward on its hinges. All tubes are now accessible for test\nor replacement. Figure E shows the position of these tubes, as well as the\nplug and socket arrangement for the amplifier.\nShould it become necessary to service the amplifier, it may easily be removed\nby disconnecting the sockets shown in Figure E, then removing the four\nmounting screws on the swinging front of the case. This front may be entirely\nseparated from the case proper, as the hinges are slip type, y\n-16-"
}