{
  "id": "d737-20",
  "text": "RCA MANTUFACTTIJRIXG COMPANY, DfC.\nA RADIO CORPORATION OF AMERICA SUBSIDIARY\nDear Jim:\nYour letter of July 14th regarding the ultra directional microphone\nwas forwarded to me while I was in Camden and upon inquiring about\nthe status of this new microphone I found that it is still in the\ndevelopment stage and that they are not yet entirely satisfied with\nthe performance they have been able to obtain. Therefore, there\nis no such unit available for sale and we ere not in a position to\npromise when it will be available.\nIn reference to the transcription equipment, we announced a new version\nof our 70-B Turntable at the NAB Convention this month and while we\ndid experience some difficulty due to flutter in acetate recordings\nwe now feel that this has been entirely overcome and for your informa¬\ntion, the difficulty was not entirely in the turntable itself.\nInvestigation proved that in most cases the flutter was on the recording\ndue to poorly damped oscillation of the cutting head of the recorder\nand since the new diamond point lateral pickup of our turntable was\nmore sensitive at the low: frequencies than those previously used\nwe immediately thought that the flutter was in the reproducer rather\nthan in the recorder.\nTo eliminate this, we have added a float stabilizer on our recorders\nand we have changed the damping and the tonearm suspension of the\nturntable itself.\nThe new/ 70-C Turntable is the same price as the 70-3, namely, f525.00\neach with the diamond point lateral pickup and filter. I have no\nliterature at the present time on the new turntables but you will\nreceive a new catalog within the next week or so which will show\nphotographs of the new unit.\nYour letter of July 20 to Mr. Ginzbourger of Klaus Radio and Electric\nCompany, Peoria, regarding tests on recording equipment for the National\nAssociation of Educational Broadcasters, has been referred to me and\nwhile I am not sure just what you have in mind, I think we can arrange\nto ship you one of the portable recorders for test. This recorder is\nXU'50\n* ' G O\nRCA\nALL\nTHE\nWAY”"
}