{
  "id": "d737-29",
  "text": "Mr, Hersh\nJuly 29, 1939\n-2-\nousr^iolse level teats would be more valid if\nmade under these conditions- In addition,\nthere Is no general agreement as to what should\nconstitute standard recording level.\nle. The frequency patterns were first photographed\nand the measurements made from the ejfelargeraents.\nWe feel that this will increase the accuracy of\nthe measurements many fold. Also the relation¬\nship between recorded level and the width of\nthe pattern washoheoked using the relations\ngiven in Appendix 3.\n3b. Tliis out was eliminated and the stability was\ndetermined from the noise level cut made under\n2a which was extended somewhat.\n3b. This test was altered as follows: The beats\nbetween the recorded note and the standard were\ncounted and the turntable stability was stated\nIn percent age variation. This, of course,\nalters 3.\nThese changes were made in the original specifica¬\ntions to increase the accuracy and validity of the tests and\nI trust that you will approve them.\nBefore making any tests on any of the machines, two\nor three records were out with each machine to familiarize\nthe operator with the operation of the machine and to check\nit for faulty operation. With the Model 12 HC, we experienced\ndifficulty with the rubber puck creeping up on its shaft when\na load was placed on the table. This difficulty was remedied\nby replacing the puck with one taken from the 12 HP model\nwhich didn’t exhibit that particular characteristic. As close\nas we could measure them, the pucks were similar, so I feel\nthat the tests on the 12 RG model are still valid.\nAlso on the 12 RO model we found the armature to\nbe against one of the pole pieces, naturally giving rise too\nlow level output and high distortion. This was corrected by\nadjusting one- of the set screws on the bottom of the head.\nWe took great pains with this adjustment and as a result got\nessentially the same characteristics with this head as we\ndid with the head on the 12 HP model, which I believe is\nsimilar.\nXou will note that as part of the specifications\nfor the tests we asked the manufacturer to submit a statement"
}