{
  "id": "d737-40",
  "text": "Mr. A. James Ebel\n-2-\nNovember 24, 1939\nplayback is not exactly 440 cycles (there is usually a rise\ndue to the frictional slip of the drive mechanism during cut¬\nting) it will be necessary to adjust the knob on the fork\nunit and the pitch rise can be measured directly in hundredths\nof a semitone or cents. Short period fluctuations can be\nseen as motion back and forth of the pattern. The extent\nof this motion can be measured by adjusting the knob on the\nfork unit to produce motion in only one direction and then\nin only the other direction. This can be done if the swing\nis not more than perhaps three a second, but at higher speeds\nonly a qualitative estimate can be secured. This method also\ndemonstrates very definitely the differences in the pitch rise\nat the inside and at the outside of a record due to the greater\ntorque required when cutting the outer portion. To illustrate\nI am enclosing curves taken last year on a Presto maohine by\nthis method. The pitch rise in cents is plotted against the\nradius at which the cut was made in inches. We have also found\nthat the resistance of the record material to cutting produces\na considerable change in torque as shown by the irregularity\nof curves taken on points 1/10” apart. A case in point is\nincluded. The deviations shown on both of these curves are\nso great that it is unlikely that the method of counting beats\nwould be feasible. I wonder if you have had much experience\nwith the disadvantages of such a pitch rise of playback and\nwould be interested to have your comments on this line.\nThe dubbing test seems like a very satisfactory method for\nmaking comparisons of recording quality and we would like to\ndo some work along this line. As we understand it, the stand¬\nard record was picked up with a high quality pickup and its\noutput fed into the input of the recorder being tested. In\norder that we have available the same record you used we would\nlike to know the maker and the number of the Hungarian Rhapsody\nNo. 2 which you used in making your tests.\nI shall look forward to hearing from you.\nVery truly yours,\n0\nAcoustical Engineer\nC. G. CONN LTD.\nOHS:aim\nEnel.-"
}