{
  "id": "d737-83",
  "text": "Suggested Moderations of the NAEB Instantaneous Recording\nMachine Tests.\nProposed by-\nPaul E. Griffith and Dr.vJ. M. Cowan\nUniversity of Iowa\nUnder\nMethod of Making Tests.\n1. Frequency Response and Distortion Test.\na. Cuts should be made at a diameter of 12 inches\non a 16 inch record at 33.333 rpm at a pitch\nof 120 lines per inch, and/or 9 inches on a\n12 inch disc at 78 rpm. at a pitch of 110-112\nlines per inch. The width of the groove in\nboth cases should be 5.5 to 6 mils. With the\nusual rounded point needle this will give a\ngroove depth of 2.5 mils, which is standard on\npractieally all commercial records.\nb. The normal recording level should be that which\nwhich gives a diffraction pattern equal in width\nto that on the ”standard level” record. The test\nfrequency should be 1000 cycles.\nc. The calibrating cut should be 3 db below(b).\nThe frequency run should be made by sweeping the\noscillator through the range at a UNIFORM RATE,\nand marking breaks of sufficient time to give\ntwo unmodulated grooves should be made automatically.\nThe input voltage to the recording amplifier should\nbe kept constant. A motor-driven oscillator dial\nis preferable. The frequency run should start at\nat 50 cps and contain marking breaks at 100, 300,\n500, 800,and 1000 cycles, and every thousand cyeles\nthereafter, until 10,000 cycles is reached.\nd. The cutter-amplifier linearity run should be made\nat 100 cps, to check for saturation at low frequencies,\n1000 cycles, and at the resonant frequency of the\nhead as determined from the frequency run diffraction\npattern.\ne. The diffraction pattern should be measured under\nparallel light rays in order to avoid the correction\nfor recording diameter.\n3.c. Unmodulated cuts of at least five lines should be\nmade at the minimum, median, and maximum recording\ndiameters. These cuts should be carefully checked\nfor any variation in width. A calibrated microscope\nshould be used. The frequency-run disc should also\nbe examined for any indication of hill-and-dale modu¬\nlation. Most recorders have insufficient filtering\nbetween the motor and feed mechanism and the resulting\nspoke pattern on the record is very noticeable."
}