{
  "id": "d737-87",
  "text": "INSTRUCTIONS\nBogen Models 212RC and 16RC Recording Systems\nBogen Models 212RP and 16RP Portable Recorders\nBogen Models RA6 and RA10 Recording Amplifiers\n♦ ♦■if##**-***##**--***#***.**\nBogen recording systems are composed of two ■units - either a 12* or 16”\nrecorder and the Model RAIO recording amplifier, housed in one compact por¬\ntable carrying case. With the Models 212RP and 16RP an external amplifier\nis recommended, such as Bogen Models RAIO or RA6.\nPower Consumption;-\nModel 2lS'RP - 3\"ff Watts\nModel 16RP ~ 117 watts\nModel 16RC - 192 watts\nModel 212RC - 110 watts\nModel RA6 - 70 watts\nModel RAIO - 76 watts\nFor 110 volts AC 60 cycle operation.\nAn AC cord and plug is provided and connection is made by means of an AC\nmale flush receptacle built in on base plate of 16RC or 212RC recorders.\nOn Models 16RP and 212RP, the AC receptacle is mounted on the side of the\ncase. External connections to amplifiers are described under ”Amplifier\"\nheading.\nPreparing Recorder for Operation;-\nOn Models 212RC or 16RC, remove speaker cover from lower section of case by\nmeans of slip hinges and set on side* Pickup and crossbar assembly are\nlocked for portability or transportation. Unlock pickup lock screw (30)\nFig.A by turning knob to left until pickup can be lifted free. Unlock cross¬\nbar assembly (32) Flg.A by turning drive post knob (31) Fig.A until assembly\ncan be lifted free of rest post (1) Flg.A.\nSet dual action control lever (4) Fig.A on outtinghead oarriage (33) Fig.A\nto up or horizontal position. Always keep lever in this position only lower¬\ning It to record.\nSet recorder for 33-1/3 or 78 RPM, at whichever speed It is desired to re¬\ncord. On the Models 16RC or 16RP speed change is accomplished by rotating\nspeed change control knob, which is located on base plate in lower left hand\ncorner (9) Fig. C. Turn knob pointer to either 33-1/3 or 78 RPM as desired\nand indicated by engraved plate under knob.\nOn Models 212RG or 212RP, speed change Is effected by reversal of Idler drive\nwheel, located under turntable (26) Fig. Ae\nBefore making speed change on Models 212RC or 212RP, make sure to release\nthe idler wheel from engagement with the motor shaft and turntable rim. This\nis accomplished by means of the Idler release knob, located In the upper*\nleft hand corner of the base plate (22) Fig.A. Lift the knob and turn all\nthe way to the left to position marked ”0FF” on indicating plate, press\nknob down before releasing it to make certain that it falls into locking\nslot provided*\nAfter idler release has been set make speed change on Models 212RC\nor 212RP as follows;-\nSlide outting head carriage (33) Pig.A all the way over toward center post\n-3-"
}