{
  "id": "d737-88",
  "text": "(35) Pig.A, then lift and swing the entire crossbar assembly (32) Pig. A.\nover to the right out of the way so that when the turntable (37) Fig.A. is\nlifted by inserting two fingers in the holes of the turntable* it is pos¬\nsible to lift the turntable without striking the cutting head carriage.\nWhen the turntable is removed, note rubber idler wheel located on the left\nin back of motor shaft (26) Pig.A. Motor shaft is machined in two steps\n(24) Fig.A. If idler wheel is set to engage lower step or larger diameter\nof motor shaft, the recorder is set for 78 RPM (Fig.B.) If 33-1/3 speed\nIs desired, merely lift idler wheel and reverse It, replace on Its bearing\nshaft so that it will engage with upper step or smaller diameter of motor\nshaft (Fig.B).\nCAUTION: - Handle rubber idler wheel gently as the rubber Is ground\nvery accurately and It may be deformed by unnecessarily rough handling.\nReplace turntable carefully. Turntable shaft will slide freely if Inserted\nproperly. Never apply force but rotate gently and lower slowly into place.\nAfter replacing turntable turn idler release knob (22) Fig.A. to \"on\" posi¬\ntion, ready for recording.\nSetting Cutting Needle:-\nfo insert cut-bing needle, (35) Fig.A., slide cutting head carriage all the\nway back to the point nearest the hinge of the overhead crossbar assembly.\n(7) Fig.A. Lift the overhead assembly upright all the way over and turn\nthe assembly to a convenient position. In this position the underpart of\nthe cutter (34) Fig.A. is visible and accessible and the needle may be easily\nfastened into place.\nAll cutting needles have a flat surface on the upper end of the shank, which\nfits Into the chuck of the cutter. Insert the needle so that this flat side\nfaces toward, and is locked by the needle thumb screw (35) Fig.A. After\nneedle is inserted, lower crossbar assembly over rest post at the right of\nturntable (1) Fig.A. This is the resting position for assembly when not re¬\ncording. (Refer to paragraph Recording Blanks\" for further details regard¬\ning needle setting for different recording blanks.)\nTo Record:-\nPlace a standard Acetate or Phonoflex record blank on the turntable, making\nsure that the record lies flat. 1/16\" thick blanks should be used since\nthe recorder Is adjusted at the factory for these blanks. Thicker or thinner\nblanks are not recommended, but if it Is desired, refer to \"Raising or\nLowering Turntable\" under section \"Mechanical Data\", for necessary adjust¬\nments.\nRemove crossbar assembly from rest post and swing over to turntable center\npin, in position shown In Fig,A. Lower crossbar assembly to fit over center\npin and offset drive pin. (2) Fig.A. Turn drive post knob (31) Fig.A. on\ntop of crossbar assembly until it falls into proper engagement with offset\ndrive pin. This will place center post (36) Fig.A. of crossbar assembly\nflat on the record. Make sure this center post Is down perfectly flat against\nrecord surface before recording.\nIf recorder is set for \"inside-out\" recording, slide cutting head carriage\n(33) Fig.A. all the way over toward the center of the record. Then slide\ncarriage back to the right just far enough to permit the cutting head to\nclear the center post base (36) Fig. A when cutting head is lowered. If\nrecorder is set for \"outside-in\" recording, slide cutting head carriage to\na position where cutting needle will be about 1/4\" in from edge\" of record¬\ning blank when cutter is lowered for recording. In either case, cross¬\nbar assembly and cutting head are now in correct position for recording."
}