{
  "id": "d737-91",
  "text": "\"External Input\". Turn selector volume control to \"0\" position. Turn \"Ex¬\nternal Volume Control\" slightly on, then select radio program desired. Pro¬\nceed as in Paragraph \"To Record From Microphone\" setting \"Compensator\" switch\nto \"Music\" or \"Speech\" as desired, and \"Output Selector\" to \"Record\" posi¬\ntion. Adjust recording level meter for proper volume level as described in\nparagraph above marked \"To Record From Microphone\" but use control marked\n\"External Input Volume\" to adjust needle swing on meter to proper level.\nPlace crossbar assembly In recording position and record as described pre¬\nviously* To make a recording of a commercial record (dubbing) the procedure\nis the same as described for radio recording, except that an external phono¬\ngraph player is used to play the record to be copied or recorded. Connect\nexternal phono pickup (high Impedance type only) to \"External Input\" jaok\nby means of an ordinary telephone plug and proceed with all other adjustments\nas described for radio.\nPublic Address:-\nTurn ^Selector*’ switch to \"Micro\" position; turn \"Output Selector\" to\n\"Speaker\" position; adjust volume level with \"Selector Volume\" control and\nuse microphone in usual manner to pick up speech or music whichever is to\nbe reproduced. If microphone Is used in same room as loudspeaker. Increas¬\ning the volume too much will cause what is known as feedback. This is in¬\ndicated by a \"howl\" from the loudspeaker and Is caused by the fact that tbe\nmicrophone is too close to the loudspeaker. To minimize this \"feedback\"\nkeep microphone on side and away from loudspeaker as far as possible. To\nplay records for public address use, set recorder amplifier controls to posi¬\ntion described under Paragraph \"To Playback\" and adjust volume to desired\nlevel with \"Selector Volume\" control.\nMixing;-\nMixing or fading of two different signals can be accomplished by means of the\ntwo volume controls marked \"Selector Volume\" and \"External Input Volume\". To\nmix when recording with microphone against a musical background, connect\nmicrophone in manner described under Paragraph \"To Record From Microphone\"\nthen connect External Phono Pickup or other source of input signal for musi¬\ncal background to \"External Input\" jack. Adjust recording level meter for\nproper swing using both volume controls and proceed with recording in usual\nmanner described above. Mixing can also be accomplished for Public Address\nuse by using the two volume controls on the amplifier panel simultaneously.\nAny external input device, except microphone, can be connected to \"External\nInput\" jack and is controlled by \"External Input Volume\" control.\nMonitor:-\nThe loudspeaker serves as a monitor when the \"Output Selector\" switch is in\nthe \"Record\" position. The signal being recorded is reproduced through the\nloudspeaker at a reduced volume level. Headphones can be used for monitoring\nIf desired by plugging the headphones into the jack (19) Fig.A. in place of\nthe loudspeaker.\nIMPORTANT (Models 212RP and 212RC) Fig.A.\nThe Idler release is provided to eliminate the possibility of flat spots de¬\nveloping on the Idler wheel. Always turn the Idler release knob to the \"On\"\nposition when about to record. Make sure, however, that the \"On-Off\" AC power\nswitch is In the \"Off\" position. Always use the AC power switch to start and\nstop the turntable when recording, leaving the idler release in the \"On\"\nposition. When through recording, release the idler release from engagement\nwith the turntable by lifting idler release knob and turning knob all the way\nto the left to position on indicator plate marked \"Off\". Caution:- Do not\nuse the idler release as a start and stop switch when recording. Use it only\nto engage at the beginning of recording and to disengage when you are through\nrecording.\n•7-"
}