{
  "id": "d737-93",
  "text": "inside-out, a set of special gears is available to order. Pull instruc¬\ntions are supplied with gears*\nTo Change Cutting Angle:- n ^ ,\nOn Models 212RP and 212RC cutting angle can be changed by inserting needle\nfurther into chuck or bringing needle out further before locking in chuck.\nOn Models 16RP and 16RC angle of needle can be changed by adjustment collars\nat the rear hinge of the cutting head, Fig.D. A wire cutting angle adjust¬\nment key is furnished with these models and should be inserted as shown in\ndiagram Fig.D* into two holes provided on hinge collars. By moving these\ncollars up or down, angle of cut can be changed.\nNOTES: - Due to a new design principle of the pickup, in which the needle\nis' ffie armature, needles of .068” must be used. Ten needles are supplied\nwith the recorder.\nAll rotating parts of the recorder must rotate smoothly without indication\nof variable friction. Good oil is essential but must be used sparingly to\navoid sticking. Too much oil is just as bad as too little.\nCheck turntable speed with stroboscope disc. If black lines appear to move\nin the direction of motion of turntable, speed is faster than 78 RPM. If\nlines appear to move counter clockwise, speed is slower than 78 RPM.\nIf black lines are easily followed with the eye, the error in speed is not\nmore than 3 RPM. This error is passable.\nSpeed may be affected by the following:-\n(A) Motor trouble or line voltage fluctuations — voltage changes in\nexcess of 7% should be avoided.\n(B) Old or damaged cutting needle — do not use steel needle for more\nthan three 12” blanks (6 recordings) — do not use a steel needle\nif it has cut accidentally into the aluminum.\n(C) Dry (old) or inferior blanks.\n(D) Too much, or too little, pressure by motor shaft against idler pulley.\n(E) Friction caused by lack of oil in any of the movable parts.\nWhen test or short recording is taken in order to save blankfs space, it is\nnot necessary to move carriage to its back stop to play back. At end of\ntest recording, raise control lever, move cross bar assembly to rest post\nposition, and play back. At end of play back, if carriage has not been moved,\nit is possible to continue the cut just where it left off in the previous cut.\nThe RA10 and RA6 recording amplifiers have been especially designed and built\nfor these recorders and are recommended to assure best results. However,\nother Bogen amplifiers may be used. The schematic diagram indicates the im¬\npedances and connections. Note that the recorder playback pickup works into\na microphone circuit.\nIMPORTANT:\nAlways lower dual action control lever slowly.\nTake care of Acetate shavings. They are inflammable.\nMake sure that control lever is in horizontal position before lowering\ncrossbar assembly over record blank.\nWhen lifting crossbar all the way over to change needle or oil lead screw,\nmake sure that carriage is either locked (lever down) or all the way\nto the right.\n”Wows” or Waver In Recording:-\nMWowsM usually are denoted by a wavering reproduction in the recording and\nare troublesome mostly when making musical recordings. The recordings will\nhave an unsteady sound particularly on sustained musical notes. There are\n-9-"
}