{
  "id": "d737-94",
  "text": "many causes for \"wows”, some are mechanical but very often \"wows\" are\ncreated by poor recording blanks, either old or dry or warped*\n\"Wows\" are probably the most misunderstood cause of trouble in the record¬\ning field and this is mostly due to a false conception that most \"wows\"\nare due to changes in speed of the turntable.\nIt is a matter of record, however, that many \"wows\" are caused by varying\ndepth of cut which causes a varying intensity in volume level.\nIn order to ascertain if \"wow\" is due to variation in speed, or to vari¬\nation in output level, it is only necessary to feed a steady note into the\nrecorder, watching closely the physical rise and fall or motion ol the\ncutting head on the record as the turntable revolves. When this test cut\nis played back and the playback pickup moves up and down in unison with the\n\"wow\" it is a definite indication that this defect is caused by an irregular\nor warped recording blank.\n\"Wows\" are also caused by dehydration variation in some of the inferior re¬\ncords now on the market. This cause may be detected by listening to the\ncutting needle as a steady note is fed into the cutting head. Whenever the\ncutting needle passes over a dried portion of the record, the sound emitted\nby it will decrease and will increase when passing over a softer portion of\nthe record.\nIf the record blank does not lie flat on the turntable, objectionable \"wows\"\nwill surely result and any dirt or foreign matter under the record blank or\n■under the rubber covering will tend to emphasize this most objectionable de¬\nfect.\nBogen recorders compensate automatically for variation of drag and will not\ncause any \"wows\" due to change of motor speed unless the turntable has been\naccidentally bent out of true or if the \"floating power\" motor mounting has\nbecome loose either in shipping or for any other reason.\nOther possible causes for \"wows\" are as follows:-\nRecord Slipping:-\nThis may occur if the offset drive pin (27) Fig.A. were removed to play a\ncommercial record and it was attempted to record without replacing it. Al¬\nways be sure that the drive pin is in place on the turntable before\nrecording.\nOverhead Drive Screw Binds (9) Fig.A.\nIt is possible that the crossbar assembly may be bent or twisted out of\nalignment thereby causing the drive screw (9) Fig.A. to bind. Adjustment,\nof the drive screw is described under \"Crossbar Assembly\".\nMotor Drive Shaft or Idler Wheel Binds\nThe recessed turntables on Bogen recorders prevent the possibility of record\nshavings falling -underneath the turntable and becoming snarled or enmeshed\nin the motor drive shaft or idler wheel assembly. Nevertheless it is possible\nthat over a period of time record shavings may work down and eventually be¬\ncome snarled in the motor shaft or idler wheel bearings (#24-26-28) Fig. A.\nor (2-3-6-8-11-12) Fig. C, causing binding at any one of these points result¬\ning in \"wows\". If this occurs, carefully clean all shavings or foreign\nmaterial from these points and make certain that all points are properly\nlubricated and move freely.\nSlippage between Idler Wheel and Turntable on Motor Shaft Drive:-\nAll recorders are carefully adjusted for proper driving speed, motor torque\n•10*"
}