{
  "id": "d737-96",
  "text": "The lever, located in front of the cutting head carriage, controls both the\nengagement of the carriage with the lead screw and the lowering of the cut¬\nting head over the record at the time of cutting.\nThe cutting head carriage should slide freely over the square tubing cross¬\nbar and the proper friction is automatically obtained by a spring and pres¬\nsure pad assembly enclosed within the carriage itself and no adjustment need\nbe made to change this friction.\nThe felt padding with which the recorder is equipped will take up ordinary\nwear and the spring pressure pad previously mentioned will compensate as\nwear occurs.\nShould the carriage rock a trifle, this should not be construed as a defect\nbecause, in cutting, the spring pressure pads will compel the cutting head\ncarriage to assume its proper position and slide smoothly across the square\ncrossbar without any impediment, or rocking.\nCrossbar Assembly:*\nThe overhead assembly should turn freely and this can be tested by holding\nthe center post in the left hand, lifting the overhead assembly and turning\nthe chromium plated knob pinned over the center post shaft, with the other\nhand.\nEven when the control lever in the carriage is down, it should be easy to\nrevolve the center post knob without any effort or binding.\nThe right-hand bearing of the lead screw (6) Fig.A. is probably the most\ndelicate mechanical adjustment in the machine and the utmost care should be\nexercised before attempting to alter this adjustment.\nAs previously explained, this bearing consists of a conical hole drilled at\nthe right-hand end of the lead screw into which the conical end of the steel\nscrew is inserted. This construction is necessary to avoid any excessive\nfriction caused by the thrust exerted by the lead screw in revolving and in\nview of its small surface will, from time to time, wear a trifle, thus caus¬\ning a pattern in the grooves cut by the cutting head. This pattern takes\nthe appearance of light and dark cuts into the records in groups of ten\ngrooves but while this defect is not objectionable from an acoustical stand¬\npoint, it may, however, cause one groove to cut into the other in the event\nthat the defect is too pronounced.\nIn order to correct it, it is necessary to secure a wrench to fit the nut\nwhich secures the bearing screw and to release this nut by turning to the\nleft. Turn the bearing screw by hand without forcing it then secure it in\nplace by tightening the nut again, making sure, however, that the adjusting\nscrew does not turn. Test the adjustment by turning the center post knob\nand be certain that it revolves freely without any binding and make a test\ncut. When the adjustment is properly made, no pattern of the type previously\ndescribed should appear.\nRaising or Lowering Turntable:-\nIt has already been mentioned that the recorder is adjusted to cut 1/16”\nblanks. If a thicker record Is used, a deeper cut will be obtained on the\ninside of the record and a lighter cut toward the outside edge. If a thinner\nrecord Is used, a shallower cut will be obtained on the inside than the out¬\nside.\nIf, for any reason, it is desired to adjust the machine so as to cut either a\nthinner or thicker record, this adjustment can be made only by removing the\nrecorder from the case and by turning the screw located at the bottom of the\n•12*"
}