{
  "id": "d1417-0",
  "text": "■\nA E B\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. 29, NO. 6\nJUNE, 1964\nU. of Denver Considers Info Center\nGeoffrey Z. Kucera, assistant professor, radio-television-film,\nUniversity of Denver, writes that his department is consider¬\ning establishment of an International Mass Media Information\nCenter. He would like comments on facilities and services\nwhich such a center might offer—and opinions of NAEBers\nas to whether it would be useful to them and to others in\nthe mass media area.\nThe basic function of the proposed center would be to\ncollect and disseminate information concerning film, press,\nradio, and TV in every part of the world. As proposed, the\ncenter would provide, without charge, the following services:\n• Monthly bulletins in the areas of film, press, and radio-\nTV, containing up-to-date information on important develop¬\nments in these media.\n• International directories in various areas of the media (key\nbroadcasting personnel, press training facilities, educational\nfilm producers).\n• Occasional papers.\n• An international yearbook and atlas—a compendium of the\nmost significant and useful information with regard to the\nmass media in every country of the world.\nAlso, the center would answer specific inquiries and con¬\nvene conferences of American media personnel and students\ninterested in the international aspects of the media. It would\noffer its services to scholars in various parts of the world\ninterested in research into the mass media, providing guid¬\nance and acting as intermediary between such scholars and\nfoundations which might underwrite the research.\nMore Summer Workshops\nUniversity of Missouri, Kansas City. Six graduate and un¬\ndergraduate courses, the first beginning June 8, in radio\nspeech, audiovisual and TV materials, ETV production,\nETV production-classroom projects, utilization of ETV\nprograming, and a workshop seminar in television educa¬\ntion.\nNew York University. From June 30 to August 7, two courses\nin teaching by television carrying graduate credit, Work¬\nshop in Instructional Television, eight points, and Tele¬\nvision and Education, six points. Contact Professor\nCharles A. Siepmann, NYU School of Education, Wash¬\nington Square, New York, N.Y., 10003.\n1967 NAEB Convention Bids Wanted\nNAEBers in the West who want to submit bids for the 1967\nconvention should have formal bids in the Washington office\nby July 31, 1964. Members of the Permanent Convention\nCommittee will examine the bids prior to the fall convention\nin Austin, and the site for 1967 will be chosen at that time.\nInformation to be included in the bids is listed on page 1\nof the January Newsletter.\nJournal to Inaugurate Program Reviews\nWith the September-October issue, the NAEB Journal will\nbegin a column of radio and TV program reviews. Art Weld,\nMichigan State University, will serve as program review edi¬\ntor. He is now accepting suggestions for regular reviewers.\nRegion II Meets\nThe South Carolina ETV Center at Columbia hosted the\nNAEB Region II April 9-11. Participants were able to attend\nspecial-interest conferences—for ITV producers and direc¬\ntors, studio and classroom teachers, engineers, and radio per¬\nsonnel. They could also view (via closed-circuit) instructional\nor general-audience TV programs and discuss them.\nFCC Commissioner Kenneth A. Cox spoke at the lunch¬\neon, and Fr. Hugh Michael Beahan, Grand Rapids, Michigan,\nwas the banquet speaker. R. Lynn Kalmbach was conference\nhost, and Arch Lugenbeel was coordinator.\nSix NAEBers who came to the field from different\nbackgrounds discussed their recipes for professionalism. Other\ntopics considered were broadcast station administration and\nfinance, the Federal ETV Facilities program, the allocations\npicture, and the ECS project.\nRegion III Meets\nAbout 100 NAEBers registered for the Region III meeting\nat Indiana University’s new radio-TV building March 22-24.\nAmong the I. U. staffers participating were George C. John¬\nson, director of radio and TV education, chairman; Douglas\nG. Ellson, department of psychology, keynoter; Philip Peak,\nassociate dean of the school of education, banquet speaker;\nand Elmer G. Sulzer, director of radio-TV communications,\nwho served as chief director of tours of the facilities of the\nnew three-story building.\nTopics under discussion were FM and ETV programing,\nnews and public affairs programing, the ITV teacher, the\nlarge-city educational radio station, “Educational Media: Gad¬\ngets or Teaching Aids?” and the future of the radio school\nof the air. NAEB personnel presented reports on the new In¬\nstructional Division, the ECS project, and network educa¬\ntional radio.\nNews Notes\nSTATE AND REGIONAL\n^ Texas Governor Connally’s Committee on Education Be¬\nyond the High School has endorsed the use of educational\ntelevision as a means of enriching and improving college and\nuniversity instruction. A sub-committee has been appointed to\nmake recommendations on implementing a state-operated ETV\nsystem. One consideration to be dealt with by the subcommit¬\ntee is whether a state ETV system for higher education\nshould be operated as a state-wide network or whether col¬\nleges in such areas as far west Texas and the Panhandle\nshould be served by taped rather than live television.\n1"
}