{
  "id": "d1412-3",
  "text": "Public Relations Committee\nElmer Sulzer, Chairman, Director, Broadcasting Services, Indiana University,\nBloomington, Indiana\nWilliam Bender, School of Medicine, University of Michigan, Ann Arbor, Michigan\nMarys D. Benjamin, Radio-TV Department, University of Texas, Austin, Texas\nFranklin Bouwsma, Detroit Educational TV Foundation, Detroit 28, Michigan\nRaymond D. Cbeydleur, Department of Speech, Manatee Jr* College, Bradenton,\nFlorida\nLou Pen©guy, Alabama Educational TV Commission, Birmingham 3, Alabama\nSeymour Siegel, Director, Municipal Broadcasting System, flew fork. New York\nReverend R* C. Williams, Director of Ccraaunioation Arts, Creighton University,\nOmaha, Nebraska\nRadio Network Committee\nRichard F„ Vogl, Chairman, Manager, Station WOI„AM~EM, Iowa State University of\nScience & Technology, Ames, Iowa\nRobert Boyle, Station KUOM, Uhivorsity of Minnesota, Minneapolis, Minnesota\nEdwin G. Burrows, Station WHOM, University of Michigan, Ann Arbor, Michigan\nMyron Curry, Station KFJM-AM, Uhiverslty of North Dakota, Grand Forks, North\nDakota\nClifford Eblen, Stations WHA-AM-SM, Uhiverslty of Wisconsin, Madison, Wisconsin\nJohn Ehle, Camimioations Center, University of North Carolina, Chapel Hill,\nNorth Carolina\nBurt Harrison, Station KWSC, Washington State University, Pullman, Washington\nKen Kager, Station IflJOW, University of Washington, Seattle, Washington\nDonald R* Quayle, Station WOSU, Ohio State Uhiverslty, Columbus, Ohio\nJohn Regnell, Station WILL, Uhiverslty of Illinois, Urbana, Illinois\nJack Suiaerfield, Butler Hall, New York, New York\nPhilip Thompson, Station WUCT, Uhiverslty of Tennessee, Knoxville, Tennessee\nWayne C. Wayne, Stations VKAR-AM-EM, Michigan State University, East Lansing,\nMichigan\nRadio Network School Committee\nKathleen N. Lardie, Chairman, Station WDTR, Board of Education, Detroit, Michigan\nAinslle Brisker, Station KUHF, Uhiverslty of Houston, Houston, Texas\nMcCabe M. Day, Station WVSH-FM, Huntington City Schools, Huntington, Indiana\nDorothy Klook, Station WXNE, Board of Education Station, New York, New York\nHarry L*mb, Station WTDS-FM, Toledo Public Schools, Toledo, Ohio\nL:Ilian Lee, Station WABE, Atlanta Board of Education, Atlanta 9, Georgia\nAiu^ne MsKellar, Station WHA, University of Wisconsin, Madison, Wisconsin\nJeanne Hinge, Station WNPS, Orleans Parish School Board, New Orleans, Louisiana\nClaude B. Smith, Director of Radio & Instrumental Misic, Evansville School\nCorporation, Evansville, Indiana"
}