{
  "id": "d534-109",
  "text": "ON OF EDUCATIONAL BROADCASTERS\nNATIONAL ASSOCIAT\nOFFICE OF EXECUTIVE DIRECTOR\nUNIVERSITY OF ILLINOIS\n119 GREGORY HALL\nURBANA, ILLINOIS\nKay 28, 1954\nHr, Claud© B. Smith, Director\nRadio ard instrumental Music\nSchool °ity of Evansville\nPublic Schools Office\nEvansville 8, Indiana\nDear Mr* SmithI\nI am very happy to inform you officially that the Board of Directors of the\nNAEB has approved your application in behalf of the School City of Evansville\nfor naa.QO.iate membership in our association*\nYou will now be receiving regularly from us the monthly NAEB Newsletter» var¬\nious additional publications of interest as they are published, and many\nother item* You should, of course, feel free to writ© to us at any time for\nany information you would like concerning educational broadcasting. We will\nalways try to help*\nEnclosed you will find a list of the materials available from the KAEB.\nPlease let us know which of these you would like to receive and we will send\nthem to you.\nAlso enclosed is an announcement of the KAEB fall convention and announcements\nof workshops and fellowships now available. Binder separate cover we are\nsending you the last three litMSlofrtcrs and several other items of interest.\nYour certificate of membership will be sent you soon.\nPerhaps the greatest good of an NAEB membership is the associations you fora,\nIvs good to know that others are having the »am problems you are and how\nthey are solving them. It has been the tradition with NAEB, in its thirty\nyears as the association of educators who broadcast, to exchange this sort\nof information on a friend-to-friend basis. You will find lots of friends\nin NAEB, and lots of people with good advice and good, staff resources to\nsupplement those which you have.\nSincerely,\nHorry J, Skornia\nExecutive Director\nHJSsrtb\nanc,\nc.c.t'Hr, Graydon Auaiaus, KAEB President\nMr. John Durm, V-P & Membership Chrma,\nMr* Paul Rickard, your Regional Director"
}