{
  "id": "d534-11",
  "text": "Page 2 of 2 Pages\nRHODE ISLAND COMMITTEE ON EDUCATIONAL TV, Providence, R.I. (Television Council)\nApplication made by Albert J. KcAfoon, representing the Rhode Island Juvenile Court.\nNo other information available.\nBOARD OF PUBLIC INSTRUCTIONS Jacksonville, Florida (Production Center)\nApplication made by Julian D. Morse in the name of the Audio-Visual Department of\nthe Jacksonville Schools.\nApplicant states production center has used and is using facilities of Radio Stations\nWJHP and WIVY, commercial outlets in Jacksonville on a regular basis.\nMost of programs produced in own studios and tape recorded for delayed broadcast.\nStudio is 9* x 14®. Technical Equipment: Kagnecord Tape Recorders, 4 mikes, 1 turntable.\nList of 1951-52 productions rather distinctive. Ten weekly series together uLthweddy\nmusic series. 1952-53 plans include Youth Forum series and Homemakers Series.\nROOSEVELT COLLEGE, Chicago, Illinois (Production Center)\nApplication made by Edward J. Sparling, President of the College.\nApplicant states college is accredited by North Central Association and other accredit¬\ning agencies; that college, at present time, is presenting over WB&B, Chicago, weekly\nhalf hour television show and several short radio series over FM stations.\nStaff of two working with TV and radio and other from college staff as needed.\nMISS DOROTHY TICHENER. RADIO & TV CHAIRMAN (Individual)\nNational Federation, Business & Professional Women*s Clubs, Xnc.\nMiss Tichener*s responsibility is that of coordinating the radio and TV programming\nof the various National, State and Local Chairmen of BFi, Federation numbers 160,000\nand some 2,900 clubs. Each state federation has a Radio & TV Chairman as well as each\nlocal club. \"My idea in seeking associate membership was that we might effect a\ncooperative basis of operation being of some help to you and at the same time aligning\nourselves with your operations”.\nCLIP.CAST YOUR VOTE & RETURN IMMEDIATELY TO JIM MILES\nOn the basis of the report given by the Chairman of the Membership Conanittee on the\napplicants for Active and Associate Membership in NAEB, I vote as follows:\nACTIVE: Griffith Institute & Central School...Yes__No\nASSOCIATE: Museum of the City of New York...Yes_No\nPresident’s Roan, Alliance College............Yes_No\"\nR.I. Committee on Educational TV......Yes_No\"\nBoard of Public Instruction, Jacksonville, Fla....Yes_No\"\nRoosevelt College, Chicago, Illinois.Yea_No\"\nMiss Dorothy Tichner, BFW...Yes No\"\nSigned^\nOfficial Position with NAEB"
}