{
  "id": "d534-119",
  "text": "Box 2002\nUniversity, Alabama\nOctober 12, 19$k\nMr. Rae 0. Weimer, Director\nSchool of Journalism\nUniversity of Florida\nGainesville, Florida\nDear Raes\nMy apologies for the delay in replying to your letter of September 2$.\nAt this busy period of getting the station going and trying to get set\nfor the MAKE Fall Convention, I am, rather behind schedule on correspondence.\nIn direct reply to your question, without question the University of\nFlorida should hold membership in the National Association of Educational\nBroadcasters. This is the one organization representing non-commercial\neducational radio and TV stations and production centers. Of the approximate\none hundred and fifteen educational radio and TV stations in the country,\none hundred and five are ACTIVE members of NAEB. Of about one hundred\ninstitutions producing radio or television programs but not operating their\nown station, eighty five are ASSOCIATE members of ABB. We have about\nseventy five individual or A.,s6ci/ 11' members who are individuals teaching\nradio or television or just interested in educational broadcasting. NAEB\nrepresents and promotes the interest of all of these three levels. At the\npresent time only active members hold a vote but a constitutional amendment\nis up for approval at the Fall Convention which proposes to give the vote\nto associate members also. Frankly, I do not have the scale of membership\ndues at tnis moment but I am asking Harry okornia, our Executive Director,\nto forward these to you immediately.\nI definitely feel that you should be represented at the MAEB Convention\nin New York because it will be an introduction for you to the organisation\nand you will learn a great deal from the Convention. The program looks\nvery excellent indeed. As to the type of membership you should hold in\nNAEB, you are eligible for active membership if you are operating your FM\nstation as a non-commercial educational enterprise. If you establish\nonly production studios in TV and do not operate a station as above, you\nwill be eligible for associate membership. If neither of the above\npossibilities is true, you should certainly take an individual membership.\nActive and associate memberships are institutional. Affiliates are individual\nmemberships."
}