{
  "id": "d534-29",
  "text": "February Hi, 19^3\nMrs. Zelda Horner Kosh\nvSauervisor, Speech Education Department\nArlington Public Schools\nlii26 Horth Quincy Street\nArlington, Virginia\nDear Mrs* Kosh:\nPlease permit me to welcome you to membership in the NAEB and to\nour Interest in making the full facilities of our o“aSzat?on\navailable to you in any way wherein we may be of service.\n, . 'Ihe National Association of Educational Broadcasters, now 26 years\nold, has always been the voice of educational institutions and individuals\nDurlnrethnterested in ?tili!!ins radio anc television as an educational tool.\nthe aast several years the organization has increased its activities\nianl of influenc«* Toa are, no doubt, aware of the ,'JAEB\nrJ rr;rfhereby).rny °f fche world’s fin«'t P««r«»s are made available\n^or broaacasttng on the e ucational stations throughout the country. This\nrtirPP7 naS exp4naed from a three programs per week \"bicycle\" network to\nn °\" ®Ppro^*tely eight hours of programming per week, during\n41 lvo ‘•\"\"the, through oirect negotiations with countries of estern\nEurope, we nave increaseo the flow of cultural aid informational programs\nQireations 60 a considerable extent and expect to expand our inter-\nnational exchange considerably during the current year.\n„ f?ch year conducts several seminars ana workshops for the\nhv^,d !?8 of Personnel anc through a grants-in-aid orogram made possible\nby the -und ,or adult education has been able to contribute to tte imorove-\npr°Z™mxn« on the local level to a significant extent. This year\nae hu/e. created a special committee within the or ganization, ' eaded by dr.\nat-anti^n'T, °r **** f>use at 6h® “niversity of Texas, to devote narticular\nmittlP problems of our associate member* and two special corn¬\nea Mon/™ :fp!n ! 8 co\"floer“ble “\"ouPt of time to the problems of school\nstations, ne hope to continue to serve the needs of educational radio and\nincreasingly'\"in'the radi° a\"d television .production groups\nVery sincerely yours.\nGAipk\nGray don Ausmus,\nPresident"
}