{
  "id": "d534-43",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nOFFICE OF EXECUTIVE DIRECTOR\nUNIVERSITY OF ILLINOIS\n119 GREGORY HALL\nURBANA, ILLINOIS\nFebruary 26, 1953\nMm Tawiy Hoskins\nConsultant on and Television\nAssociation of Junior Leagues of America, Inc*\nWaldorf Astoria\n305 Park Avenue\nMew fork, M*V lark\nDear Mm Hoskins*\n1 a® very happy to inform you officially that the Board of Directors of the MSB has\napproved your application for affiliate membership in our association*\nIon will now be receiving regularly from us the monthly K4SB Hewa-Iottar* additional\npublications of interest, and many other things* Tou should, of course, feel free\nto write to this office at any time for any information concerning educational\nbroadcasting*\nBnd*r separata ewer m are sending you a copy of the MSB Rftdl^TB}sr3,sAaft.Mito«mte»\nwhich we hope you will find useful*\nYou will note that you are classed as an affiliate member* the association at its last\nconvention in Minneapolis decided that now was the time to broaden Its membership base*\nHence, it created a new type of membership known as affiliate*\nHy definition, active members own and operate their own stations* Associate members\nregularly produce programs for use over stations they do not own* Affiliate members\nneither own their own stations nor produce programs regularly but are interested in\neducational broadcasting and wish to be kept informed of its progress.\nAny on© who is an affiliate member of this organisation and who at any time in the\nfuture qualifies for either associate or active membership can automatically be put\nin those classes merely by notifying the Executive Director.\nPerhaps the greatest good of an IMS membership is the associations you form. Xt*s\ngood to know that ethers are having the same problems you are and how they are solving\nthem* It hail been the tradition with w&fgB to exchange sort of information on a\nfriend-to~frlend basis* You1!! find lots of friends in MSB*\nSincerely yours,\nFrank E* Schooley\nExecutive Director\ncot Qraydon Ausmus\nParker Wheatley"
}