{
  "id": "d534-70",
  "text": "objectives of nakb\n£ ^m°re’ $T Un“6? eff0rt «* mutual “operation the dissemination of knowledge\nby and of radio and television broadcasting to the end that benefits of both tech¬\nnical and educational features of broadcasting may be extended to all.\nWHO BELONGS TO NAEB\nThere are, at the present time, 98 ACTIVE members; 81 ASSOCIATE members; 17 AFFILIATE\nmember and 1 HONORARY merger of NAEB. These members are to be found in 40 states and\neach week rleS Applications for membership in NAEB are being processed\nWHO MAC BELOW TO NAF.R\nACTIVE: Any university, college, school or other educational, cultural or public\nservice agency, orgara^ativn or association of recognized standing which is actively\nengaged in eaucational, cultural an . public service, non-commer-. ,al broadcasting 7\nover a radio and/or television station or stations regularly licensed to it bv^h^\nFederal Communications Contission, or holding a construction permit for such a station\nor stations, may be elected to ACTI VE MEMBERSHIP. * n statl°n\nASSOCIATE: Any university, oollcy, school or other educational, cultu-al or oublic\nservice agency, organization or association of recognized standing which is Ltivelv\nengaged in the production and broadcasting of educational, cultural and nublic sI^Le\nto^ASSWIATE ^ ** Sligible f°r ACUVS W be elected\nt\nAFFILIATE: Any university, college, stool or other cultural or public service aeencv\norganization or association not elipihit for Active or Associate Membership, or any\nindividual interested in or seeking to p.omote education, cultural and public service\nbroadcasting may be elected to AFFILUTE MEMBERSHIP. r 0 servlce\nHONORARY: Any individual wt>j shall h.ve Bide outstanding contributions to the Asso\nelation as a representative of a Memfer in good standing, or any individual' who shall\nhave made a significant contribution co educational, culturallnd public service 11\nSSp^ \"Jr* 7 Unanim°US VOtG £ thfc 8?ard Directors, be elected to HONORARY\nWH/V DOES IT COST\nCosts of Active Membership are baer on the pow rating of the station Class A-\n5 kw or above, #50 per year; Class J: 1 tar to . .9 kw, @25 per year- Cllss -\nthan 1 kw, $15 P«r Year. For Associate or AfflHate Membership^''the membeiuhipfee\nis a flat> charge of $10 per year• $11 classes 6? membeEhip receive the MAF*3 luFfoK\nLETTER which is issued monthly. A.. ACTIVE members are eSgTwe to 1oL to Mm\nWPE NETWORK. Costs for this agaii are based on power ratings. ASSOCIATE combers\nwill be eligible to participate in ne Radio and TV Script Exchange at a fee which\nwill adequately cover the costs of * derating the scchange, lcn"
}