{
  "id": "d534-8",
  "text": "Page 2\nSection 1 c INDIVIDUAL MEMBERS so elected to the NAEB as prescribed by the\nConstitution shall have no voting power and they cannot be elected to any\nconstituted office of this association. They may, however, be extended the\nprivilege of the floor at regularly stated conventions of the association.\nMake these changes and you can carry the educational T? stations along with us. BUT\nI am inalterably opposed to changing those portions of Article III, Section 1 a of\nthe By-Laws which reads as follows: \"Shall be eligible for active membership in the\nassociation to the extent of one membership for each institution, irrespective of the\nnumber of stations operated by the member\"....and.....\"Each active member shall be\nentitled to one vote and shall be entitled to participate in all affairs of the\nassociation\"•\nHere the emphasis is on INSTITUTIONAL MEMBERSHIP and not on how many radio and TV\nstations may be operated by the institution. When a great number of us added FM\nstation to our operations, no one got any more votes.\nFurthermore, I am of the opinion that we should hold to the FCCfs definition of an\neducational TV station. I well remember the hassel v/e had over some of the radio\noperations that went commercial but still wanted to be in NAEB. A commercial TV\nstation is commercial whether it’s operated for non-profit or not. To depart from\nthe basic principles which have been established over the years by blood, sweat and\ntears would be making a grave mistake.\nThe fact that only one vote is allowed an institution, regardless of how many broad¬\ncast stations they may operate, does not preclude the fact that the institution and\nits broadcasting personnel can be very active in the affairs of NAEB, Nor does it\nkeep any institution from sending as many representatives to national meetings as\nthe old pocketbook will allow. And these people can be appointed to committees as\nper the Constitution and By-Laws and can have a vote in the business of these\ncommittees.\nIn this connection, I am in favor of overhauling our whole concept of NAEB which is\ngeared too much to the horse and buggy days of the association. With the advent of\nthe School Broadcast station and more lately the educational TV station, it seems\nlogical there should be spheres of activity incorporated into the thinking and\nwork of NAEB:\nRADIO\n1. The general educational radio operation (either AM or FM) with perhaps\ngreater interest on general adult programming but may include on a secondary\nlevel in-school broadcasts.\n2. The school broadcast stations (mostly FM) which serve the classrooms of the\nsystem which sponsors the station. Some programs of general interest but in\nthe main the emphasis is on the school room audience,\n3. The production center which uses facilities not its own. No problems of\nstation operation. Emphasis wholly on production either for general audience\nor school room.\nTELEVISION\nThe educational television operation may eventually have to be divided very\nmuch as radio. Right now two divisions will suffice:\n1. Educational television station.\n2. Television production center."
}