{
  "id": "d1415-1",
  "text": "NAEB NEWS LETTER.Oct# 1, 1939 Page 2\nFGC POSTPONES ACTION OF STAMDARBS FOR SHORTWAVE\nThe Federal Communications Commission has announced adoption of the\nfollowing reaolutioni\nWhereas, on May 23, 1939, the Commission adopted Rule No* 42o03(a)\nhaving to do with the conduct of international broadcast stations,\nwhich rule was thereafter suspended pending further investigation,\nand\nWhereas, the outbreak of the Suropenan war has injected into the problem\nof international broadcast regulations various additional significant\nfactors, and\nWhereas, on September 6, 1939» this Commission appointed a committee\ncomposed of Chairman Fly, Commissioner Brown and Commissioner Craven\nto study the various phe.ses of the communications problem In relation\nto current war conditions, to maintain contact with the various Qovera~\nment agencies and the industry and to report to the Commission its\nrecommendations, which committee has made studies and held various\nconferences on the problems in relation to international broadcasting#\nTHEREFORE, BE IT RESOLVED, That said rule is hereby further suspended\npending the conclusion of said studies and conferences and subject\nto the report of said committee recommending to the Commission such\nfurther action as it may deem appropriate.\nBEE BROADCASTING-\nBROAD CASTING- for September 15th haa a couple of articles of expeci&l\ninterest. Be sure to read «Court Holds Economic Interest Vital ,\npage 22; and the editorial, «Who Won?\" on page 4S* Page 15 also\nreports postponement of RCA date for recording fees to December 1.\nFREQUENCY MODULATION\nThe current issue of Fortune carries a good article on frequency\nmodulation and the possible effects of Major Edwin Howara\nArmstrong0© findings on broadcast!ngo\nRECORDING MACHINE TEST REPORTS IN D^^AND,\nManufacturers« educators, and the general public have highly\nendorsed the report of the NAEB committee on instantaneous recording\nmachine teste, which was released at the convention in Ames*\nFCC ACTIONS\nWKAR, Michigan State College, has been grantee. special\nauthority to rebroadeast naval Observatory time signals from the\nNaval observatory station*\nvmUF, University of Florida, was granted permission\nsimultaneously with station &OA on dept, 23, Oct. (,\nfor purposes of broadcasting football games*\nto operate\nand Oct* 21,"
}