{
  "id": "d1551-1",
  "text": "-1-\nTV Technical Tips No. 15\nBy Cecil S. Bidlack, NAEB TV Engineer\nThe Federal Communications Commission has recently placed its first mobile TV moni¬\ntoring unit in operation. It was developed and constructed by the Field Engineering\nand Monitoring Bureau, which also operates it.\nThis mobile TV unit is necessary due to the fact that the Commission s fixed monitor¬\ning stations cannot monitor distant TV transmissions. It is equipped with a variety\nof precision electronic instruments for studying TV signals in the service areas of\nindividual stations. These include frequency measurements, modulation measurements,\nwave form observations, and spectrum emission analyses to check distribution of the\nTV signal over its assigned channel.\nIn addition to aiding enforcement and checking of compliance with the Commission's\nTV engineering regulations, the mobile TV monitoring unit will obtain other data\nwhich will be useful to the Commission in considering various general TV problems.\nIt will operate in and out of the field engineering districts as needed.\nThe FCC has revised Part 3 of its Radio Broadcast Services rules and codified therein\nits Standards of Good Engineering Practice concerning Standard Broadcast Stations.\nThis Report and Order is effective January 2, 1956. No major changes in the rules\nor standards are made. All the revision does is to combine in a single edition all\nthe rules, regulations, and technical standards for the radio broadcasting services—\nAM, FM, TV, etc.—incorporating all outstanding amendments.\nThe Commission has not mimeographed or otherwise reproduced copies of this revision;\nhence the only means of obtaining one is to order the issue of the Federal Register\nin which it appears, or wait until the printed revision of the rules is put on sale\nby the Superintendent of Documents. We shall announce later when these are avail¬\nable for distribution.\n**********\nThe Commission has also finalized rule making to set forth requirements for type,\napproval of frequency monitors for visual and aural transmitters and for modulation\nmonitors for the aural transmitters for TV stations. The new rules become effective\nDecember 12; however in view of the fact that some outstanding monitors may not meet\nthe new requirements, stations have until June 1, 1957, to fully comply.\nThe Report and Order for Docket 11094 which outlines these changes may be secured by\nwriting to the FCC requesting a copy of public notice No. 24716.\nWe are indebted to Cy Braum of the JCET for bringing the above items to our attention.\nWe talked to Wayne Bundy of the Louisiana Educational Television Commission at the\nNAEB Convention in Chicago and recently had a letter from him asking us to.secure\ninformation on the operation, use, and effectiveness of the TV shutter-equipped"
}