{
  "id": "d1551-10",
  "text": "-10-\nThe Federal Communication Commission needs field intensity measurements\non television frequencies. Since this, data is no longer required in proof\nof performance tests, the FCC is unable' to'revise- transmission data in the\nlight of actual measurements as they would prefer. If you have field strength\ndata on your educational TV or FM channel, they would be glad to have it in\ntheir files. We*re sure they would respect your wishes and keep it confi¬\ndential if you wish since they maintain a public file and a confidential\nfile. Some of your Electrical Engineering Departments, too, might cooperate\nwith the FCC. in transmission surveys done as laboratory .or thesis work.\n-;bbhh;-\nThe FCC has partially revised Part V? of its rules which concern inci¬\ndental and restricted radiation devices to avoid interference with author¬\nized radio.services.\nOf greatest general public interest in the new rules is the limitation\nof amount of permissible radiation from radio receivers operating between 30\nand 880 megacycles, which includes FM and TV receivers. Rules, with certain\nexceptions, will be applicable to all receivers 30 to 880 me that are manu¬\nfactured after March 1, 1956. The rules require each receiver to carry a\nseal certifying compliance with Commission regulations.\nHarold Gorsuch of the WOSU-TV staff graces the cover of the February\nOhio State University Monthly, the official Alumni publication of the Uni¬\nversity” HeT s seen behind a-W0SU-TV camera which is looking for someone to\nbecome Dean of Broadcasting at Ohio State. The story gives full picture\ncoverage on the WOSU-TV facilities and is headlined: WANTED, TOP Man for\nTOP Job. The lead for.the story is the want-ad which follows:\n\"WANTED: Man with experience in commercial television, with flair for show¬\nmanship AND thorough understanding of educational concepts; must be dedi¬\ncated to development of possibilities in educational television. Position:\nheading educational broadcasting at state university. Salary: good. Work¬\ning conditions: excellent.\"\nThe WOSU-TV facilities were designed and installed by Robert C. Higgy,\ndirector of WOSU, who will serve as an interim director and then take over\nthe combined technical direction of WOSU and WOSU-TV when the above posi¬\ntion is filled."
}