{
  "id": "d1551-7",
  "text": "Broadcast News, a publication of the Broadcast Equipment Sales Department of RCA#\nThis \"“issue also contains a very fine article on Planning TV Microwave Systems*\nMost radio and television stations receive Broadcast News; if not, contact the\nRCA sales representative and ask to be put on theirmailing list.\n* •* *\nWe recently received advance catalog information from Kliegl Bros, on\nfive new fixtures added to their line of lighting units. Perhaps of greatest\ninterest to educational TV stations is the Pattern Projector, (250 to 3000\nwatts) with a set of sixteen different patterns which can be used to break\nup those blank walls on TV sets. These instruments sell from $55.00 to $130.00\ndepending on wattage. The complete set of 16 patterns may be purchased for\n$2U*00. For further information write Herbert R. More at Kliegl Bros.\n* * *\nThe \"Multitape\" Duplicating Equipment at Network Headquarters has now been\nmodified so that all channels record a full width track on the tape.. Work is\ncontinuing to improve the technical quality of network tapes and it is hoped\nthat soon we may report the equipment delivering the maximum in frequency re¬\nsponse with a minimum of wow, flutter, noise and distortion.\nGlenn Blackburn* s crew in the \"back room\" has begun a program of close, in¬\nspection of Network tapes returned. It would make a distinct improvement in\nNetwork quality if NAEB tapes would not be rewound before being returned.\nThis will eliminate much of the variation in tightness of wind observed by.an\ninspection of incoming tapes and will enable us to do a better.job of dupli¬\ncation. One of the shortcomings of our duplication equipment is that supply\nreel tension is a function of gravity, the amount of tape and radius of.the\ntape unrolling from the reel* Consequently, when tape is wound with widely\nvarying tension on the supply reels we have some difficulty which can only be\novercome by a major modification of the equipment. This unevenness of wind re¬\nsults in wow in music especially at the start of programs because we duplicate\nprograms backwards so that we don*t have to go through the time consuming job\nof rewinding more than 700 tapes per week after duplication. Psychologically\nthis is bad because many people who listen to the beginning of the program may\nnot stay with us to the end where we do a better job as far as wow is concerned.\n-x- -x- •*\nFCC*s Technical Research Division recently revised its T.R.R. Report No. 2U.15\non \"Present Knoitfledge of Propagation in VHF and UHF TV Bands.\" You may obtain a\ncopy by writing to FCC Technical Research Division, Room 7358, New Post Office\nBuilding, Washington 25, D* C.\nSWAP SHOP ITEM\nClement E. LaFond of WKNO, the Memphis Community Television Station, writes\nthat they have one DuMont TA-S12 Iconoscope Film Camera chain for sale. He\nstates that this chain has been used but was in good operating condition when\nremoved from service. He believes that this is an excellent buy at the low\nprice they have set. Write direct if you are interested in its purchase."
}