{
  "id": "d653-10",
  "text": "6'\n<£-\nPLEASE ADDRESS\nriverside school, front street Schenectady 5, new york fr 7-8517\nOctober 11, 1962\nMr. Harold Hill\nVice-President\nNAEB\n131*6 Connecticut Ave.\nWashington 6, D. C.\nDear Harold:\nIt has taken me all this time to get over the NYSERTA Meeting, and find a few\nmoments to thank you for the major contribution -which you made to it. Just\nyour being there was enough as far as I*m concerned. But, the comments and\nsuggestions that you made, both privately and during the meetings themselves,\nwere a tremendous asset5 all the more so because having you there provided the\nkind of recognition of NYSERTA that we could not get any other way.\nIt was great fun having you over to visit us even briefly at home, seeing our\nstation, and going out to dinner. I never cease to be amazed at the endless\namount of energy you have. A1 and I discussed this afterward. It took us a\nday to wake up after the merry chase you led us following our trip to Schoharie.\nI just wish that Bunny and I could be at the Philadelphia meeting to do a little\nmore of the same. But, of course. Bunny is working, and I have to attend the\nAffiliates Meeting the three days preceding the NAEB Meeting, which would mean\nthat I would be out of the office all that week. I will, however, try to get\ndown to Philadelphia for at least one of the days. I wish you great success\nwith the Philadelphia meeting.\nIf Dan Button does not send you a copy 6£ the speech for the journal, please\nlet me know and I will remind him that he offered to do it.\nOur NYSERTA Meeting was greatly enhanced by having Vem Bronson and Bill Harley.\nI am sure that those people who are not members of the NAEB or do not know very\nmuch about NAEB are certainly much more aware of the value of the national or¬\nganization when they see in person the fine caliber of leadership it has.\nI hope we can get together again soon.\nSincerely,\nDonald E. Schein\nDES:ft Manager\nmohawk-hudson council on educational television"
}