{
  "id": "d653-23",
  "text": "NEW YORK STATE EDUCATIONAL RADIO AND TELEVISION ASSOCIATION\nReport of the Television Station Activation Committee\nApril 5, 1963\n1, Statewide meeting of community leaders: The committee recommends\nthe following Resolution for consideration by the general membership:\n\"RESOLVED, that the President of the New York State\nEducational Radio and Television Association, in\ncooperation with the Commissioner of Education of\nNew York State, invite community leaders, legislators\nand other interested people from key areas in New York\nState to attend an informational meeting, at which time\nthe State plans for educational television and other\naspects of educational television might be explained\nby a high level representative from the New York State\nGovernment•\"\n2. Survey of local institutions and councils engaged in educational\ntelevision:\nThe Committee recommends a survey of all stations, councils,\ninstitutions of higher learning and any other educational television agency,\nin order that those who are planning to activate a station, institute or\nform a council, or produce programs over local commercial stations might\nhave specific information available concerning other operations in the\nState*\nThe survey will be duplicated by the State Education Department\nof New York under the sponsorship of N.Y.S.E.R.T.A. It will be distributed\nto anyone in the State who requests such information from an existing council\nor station or from the State Education Department.\nThe survey will include: The kinds, types and sources of educational\ntelevision programs produced and broadcast in New York State; staffing;\noperating budget analysis; initial and present capital outlay; composition\nof Board of Trustees; program and finance committee structure and function;\nand brief narrative history of the organization.\nIn accordance with the above, the Television Station Activation\nCommittee recommends that the general membership vote the following Resolution\n\"RESOLVED, that NYSERTA begin a survey of various councils\nand institutions regarding personnel, budget, legal composition,\nprograming, and any other information which might prove to be\nof value to individual members of the association and those\nindividuals or groups making plans to begin work in educational\ntelevision broadcasting.\""
}