{
  "id": "d653-32",
  "text": "^^N.Y.S.E.RXA.\nNCV yo«K S TATS EDUCATIONAL RADIO AM TBLB/ISI&i ASSOC/ApoW\nHave you over received aoro than you have put into an organisation? It may\nsound impossible, but then KTSHEYA isn't, the ordinary \"run of the will\"\n'organization*\nThrough tha generous cooperation of the Adler Educational Systems, a division of\nLitton^. Inc.- (formerly Adler Electronics* Inc*.developers of the 2£00 megacycle\nsystem of TV diattribution)* no are able to give our xaorebers an outstanding\ninstructional television book -which usually sells for about $£<,00 in bookstores,,\nOne copy of Educational Television Guidebook, by Philip Louis, will bo given,\nat no cost, to every W&tIMk iwnfeor requesting It* To receive this highly\nacclaimed book, -sdiich is worth Koro than two tiros your membership dues, make a\nwrit tan request (post cas’d will do) to Mr,, Stanley K Lapin, Director., Adler\nEducational Systems Division. Litton Systems, Inc** to? Rochelle, to? Tork*\nythie offer is restricted to HISSITA members in good standing as of February 1, 196iu\n•» #n * # # * -ra ■» * # -js- •& * *■ * » * # * * * ^ * #\nTHE LEGISLATIVE SCENE\nLegislative Seminar - The State Education Dspartraeni Hill told & legislative seminar concerning\noduwMonal Tojevd-sion on February X8th„ Consaissioner Lee of the FCC will compare TV\ndevelopments in this state with those around the nation, while mongers of the Department will\nattempt to show our Xaw-aakers the need for greater future appropriations in this field*\nIncreased TV Aid Mow Up% to Stats legislators «• State Aid to schools, under the Local Assistance\n““^Trcgi'^ may taka a $2^(XXF3u^p iFTH©“requost formulated by the Education Department and\napproved by the Governor is passed by trie Legislature* This package of $8000^000 would be\nused to assist closed circuit systems^ 2£00 megacycle users and the TV broadcast activities\nof the 'Jew York City Schools*\nCouncils will also gain if the budget submitted by the Governor is passed by the Legislature*\nAn increase of $100,000 is requeetsd for Councils ard technology, bringing that sum up to\n$700,000*\nEvery meaner should make an effort to acquaint hia legislators with the need for these funds*\nThis is important if television is to move forward*"
}