{
  "id": "d1654-3",
  "text": "August 1 marked the day on which the new postal\nrates went into effect. If you have not been informed\nof the provisions of this new law, I suggest that you\nget a copy of it. Briefly stated, however, the new law\nprovides that educational sound recordings (this in¬\ncludes network tapes) may be sent for 4 cents for\nthe first pound and 1 cent for each additional pound\nno matter where mailed in the U. S. and possessions.\nIt used to cover just zones one, two and three. In¬\ncidentally, if you have labels prepared for your net¬\nwork mailings, be sure to have the words “Library\nMaterials” put on the label. This evidently indicates\nthe reduced rate is applicable for packages bearing\nthat mark. This new law promises a great saving in\nexpenditures for postage, and we were most pleased\nat its passage.\nAlso of note are two new network members:\nKRVM, Eugene, Oregon, licensed by the Eugene\nPublic Schools, and WNPS, New Orleans, Louisiana,\nlicensed by the Orleans Parish School Board. We wel¬\ncome these new members and hope they find their\nmembership profitable.\nBest regards to all from the network staff.\nFULBRIGHT SCHOLARSHIPS\nNOW AVAILABLE\nIndividuals interested in research or lectureships\nunder the Fulbright Program will have until October\n1 to file their applications for the 1959-60 academic\nyear.\nm many cases the presence of applications, the\nquality of the proposed projects and the individuals\napplying may help create or influence the creation of\nopenings not listed in advance. For this reason, per¬\nsons interested in broadcast assignments are urged\nto file application particularly where awards are pro¬\nvided but not specified to a particular field.\nThose who qualify in the broadcast-related areas\nof value to the NAEB are designated NAEB rep¬\nresentatives. These credentials have been of con¬\nsiderable value to previous scholars in their contacts\nwith European broadcasting organizations.\nFrance now offers an award in Educational Radio\nand Television, which was held this year by John\nW. Meaney, University of Houston, our NAEB rep¬\nresentative. Under this award, “the grantee will\ncarry out research in the field of educational radio\nand television in collaboration with the French\nBroadcasting System (Radio-Television Franeaise).\nHe will be affiliated with the educational research\ncenter of the Centre National de Documentation\nPedaqoqique in Paris. His assignment will include\nnot only research, but also occasional lectures and\nseminars, addressed to colleagues of the Centre, on\nAmerican methods in this field'. He may be able to\ntake active part in programming with the French\nBroadcasting System. He should have a fluent com¬\nmand of the French language.”\nThe United Kingdom will offer four lecture and\nthree research awards in unspecified fields. Other\ncountries offering research awards available in any\nfield are Austria (4), Denmark (1), Finland (5),\nIreland (1), and Norway (6) . Some of these awards\nhave suggested areas of research but applications will\nbe accepted in any field.\nGeneral eligibility requirements for Fulbright\nAwards are U. S. citizenship; for lecturing, at least\none year of college or university teaching experience:\nfor research, a doctoral degree, or recognized pro¬\nfessional standing; and in some cases, a knowledge of\nthe country’s language.\nThe Conference Board Committee for the pro¬\ngram is also developing a Register of Scholars who\nexpect to be available in the future for overseas as¬\nsignments. Scholars who are generally interested in\nsuch assignments are invited to complete and return\nbrief data sheets indicating academic background,\npreference as to countries, probably periods of avail¬\nability, and foreign language competence. The data\nsheets are provided by the Committee upon request\nand do not commit a scholar in any way.\nFor application forms and additional information\non Fulbright Awards or the Register of Scholars,\nwrite: the Institute of International Education (1\nEast 67th St., New York 21, N. Y.) or the Conference\nBoard of Associated Research Councils (2101 Con¬\nstitution Ave., Washington 25, D. C.).\nPITTSBURGH GETS\nSECOND ETV CHANNEL\nHonors as the first city to be allocated two educa¬\ntional TV channels go to Pittsburgh, Pa. after last\nmonth’s F.C.C. ruling.\nThe Commission shifted Chan. 22 from Clarks¬\nburg, W. Va. to Pittsburgh for educational use. In\na counterproposal, the Metropolitan Pittsburgh Ed¬\nucational Station requested use of Chan. 16 instead\nof Chan. 22; however, decision on this proposal will\nnot come until later this month.\nPittsburgh’s present ETV station, WQED, Chan.\n13, now programs almost 12 hours daily and has been\nin operation since April, 1954. It requested an ad¬\nditional channel in order to enlarge its educational\nprogram for both classroom and home instruction\nand for specialized educational service to industries\nand professions in the Pittsburgh area.\n4\nHave Set The Date\nNEWSLETTER"
}