{
  "id": "d1757-0",
  "text": "SPECIAL BULLETIN\nRelease Date December 17, 1931\nTO MEMBERS\nof\nTHE ASSOCIATION OF COLLEGE AND UNIVERSITY BROADCASTING STATIONS\n(and a special request mailing list in addition to members)\nSome weeks ago your attention was called to the radio course in music appreciation\nsponsored by Station WLB under the auspices of the General Extension Division of the\nUniversity of Minnesota. A number of communications have been received relative to\nthis announcement and for those program directors and managers who have not as yet\nasked for this bulletin I would advise that you get in touch with the University of\nMinnesota at an early date.\nFROM MR. H. B. SUMMERS, PROFESSOR OF PUBLIC SPEAKING, KANSAS STATE COLLEGE OF AGRI¬\nCULTURE AND APPLIED SCIENCE, MANHATTAN, KANSASs \"With the cooperation of the radio\nstaff of the College Broadcasting station here at Manhattan, we are planning to offer\nnext semester a course in Radio Speaking and Announcing. As a part of the work, we\nwant to give our students as wide a background as possible of information concerning\npolicies and types of programs in typical stations throughout the country. With that\nend in mind, I am taking the liberty of requesting as much information as possible,\nalong the lines suggested below:\nFirst - Tvpes of program you use - as much in detail as possible\nwith approximate percentage of total time given to each.\nSecond -Any information available as to preferences of your listen¬\ners for different tvpes of programs enumerated.\nThird - Your station’s policy with respect to topics and material\nfor radio discussions - what subjects are barred, etc.\nFourth -Your station’s policy as to censorship of material for\nbroadcast - whether advance manuscripts are required, etc.\nFifth - The extent to which you present programs of an educational\nnature, and specific types of programs of this type most used.\n\"I should likewise appreciate information on these additional points, unless you do\nnot care to make such information public. First, as to the ownership of your station\nsecond, how it is financed; third, any newspaper tie-up; fourth, rates charged for\nadvertising program; and finally, size and assignments of your studio staff.\ny'In addition, I should like to have copies of programs of typical broadcasting days;\nany available printed material concerning your station and its broadcasting policies;\nand finally, to be placed on your mailing list for material of this type issued in\nthe future.\nWI shall be very appreciative of any other suggestions you may care to offer concern¬\ning material for use in our projected course. Do you know of any work of this kind\ndone in other schools, and can vou suggest any published material that would be use¬\nful to us?\"\nNo doubt many of the program directors have already supplied Mr. Summers with the\ninformation he has requested. Those of you who have not assisted in his work shoud\nsend him material at the earliest opportunity. I am today sending him copies of all\nbulletins we have released from this office and in this he can find many helpful sug¬\ngestions that will assist him in his work."
}