{
  "id": "d1757-3",
  "text": "Placement Office Needs Positions\nSome 250 persons who are actively seeking employment in edu¬\ncational broadcasting have credentials on file at the NAEB\nPlacement Office. Placement Officer Julie Hunt says that the\nnumber is increasing rapidly and that the range of candidates\nis wide—from technicians to station managers, and from re¬\ncent college graduates to NAEBers with extensive broadcast\nexperience.\nCurrently “Positions Available” are not keeping up with\n“Personnel Available.”\nInstitutional members can obtain a free screening service by\nlisting openings with the NAEB Placement Office. Location\npreferences and minimum salary requirements are considered\n—and thus the institution is not bothered by Mr. X, who\nwants to work on the West Coast for a salary of $10,000,\nwhile the job is in New England at $7,500! Credentials of the\nscreened applicants are sent to the NAEB institution to be\nexamined leisurely. The institution then contacts the appli¬\ncants of interest directly. (Candidates do not contact the in¬\nstitution.)\nFor further information on how the NAEB Placement Serv¬\nice operates, write Miss Julie Hunt, NAEB, 1346 Connecti.-\ncut Avenue, N.W„ Washington, D.C., 20036.\nNew NAEBers\nACTIVE\nThe University of South Florida, Station WUSF (FM),\nTampa, Florida.\nASSOCIATE\nThe Salesianum School, Wilmington, Delaware; The Univer¬\nsity of South Florida, Tampa, Florida.\nSUSTAINING\nDow, Lohnes and Albertson, Washington, D.C.; Stations\nWABC (AM and FM), (Commercial), New York.\nNETWORK\nThe University of South Florida, Station WUSF (FM), Tam¬\npa, Florida.\nINDIVIDUALS\nElizabeth G. Bailey, Madison; Jeffrey Bell-Gam, Bloomington,\nIndiana; James Bwogi, Bloomington; Jack A. Carroll, La¬\nfayette; Dennis R. Coles, Toronto; B. Kendall Crane, Pitts¬\nburgh; Donald Dorin, West Lafayette; Frank D. Edington,\nJr., Vermillion; Mrs. Rosemary M. Elstun, Columbus; William\nFagan, Lafayette; Stephen J. Feit, Valley Stream, New York;\nAlbert Feldman, New York; Roland K. Fisher, Helena; Mr.\nGraeme R. Foster, Hagerstown; Francis Z. Gana, Blooming¬\nton; Howard H. Gillaspie, Terre Haute; Edwin L. Glick,\nAthens; Lee U. Good, Bozeman; Inez Grant, Bloomington;\nWilliam J. Grigaliunas, Mt. Pleasant, Michigan; Dr. Barton\nGriffith, Columbia, Missouri; Mr. Chris Griner, Bethlehem;\nJulia James, Boston; Raymond K. Janson, Canton; Cho-Jen\nYu, Bloomington; Leander Komakec, Bloomington; John H.\nKroyer, Madison; Mrs. Alice Lewitin, New York; Patricia A.\nLutz, Huntingdon, Pennsylvania; Donald W. MacLennan;\nColumbia, Missouri; Sister Mary Brian, R.S.M., Chicago;\nRev. John McLaughlin, S. J., Fairfield, Connecticut; Elroy\nA. Migacz, Milwaukee; Mohamed Omer Mohamed, Bloom¬\nington ; Levy Charles N’Goma-Mby, Bloomington; Edward\nC. Obrist, Boston; Arthur A. Paul, Riverside, California;\nJerry A. Richards, Toledo; Charles D. Ritchie, Tampa; Sa¬\nrah Marie Schlesinger, Baltimore; George Schneidewind,\nMadison; William Schwab, Mokena, Illinois; John S. Shaf¬\nfer, Jr., Westport, Connecticut; Edward J. Shaughnessy,\nSomerville, Massachusetts; Mrs. Frank Shepherd, Columbia;\nAli M. Shummo, Bloomington; James H. Spear, Sharpsburg,\nMaryland; Charles M. Sradomski, Leetsdale, Pennsylvania;\nJ. Kenneth Webb, Logan; Ernest P. Weckesser, Jr., Kent,\nOhio; John P. Witherspoon, San Diego; John H. Worthing¬\nton, West Lafayette.\nPLACEMENT\nPERSONNEL AVAILABLE\n(For information, write Miss Julie Hunt, Placement Service,\nat the NAEB office in Washington.)\nDecember I—Wanted: Position in writing, producing, directing\nfor educational television. M.A. from UCLA in radio &\nTV production. Several years experience in Army and\nassociate director for specials. Free-lance writing. Mar¬\nried. Salary minimum $5,500. Location open but prefers\nEast or West Coast. Will teach along with job.\nDecember 2—Ph.D. in broadcasting (speech) wants adminis¬\ntrative and/or teaching position in radio-TV-speech.\nOver 15 years of teaching and administrative experience.\nNow at major university. Practical broadcasting experi¬\nence. Special interest in ETV development and utiliza¬\ntion. Publications. Male, 41, married (one child). $10,000\na year needed with permanent position in friendly com¬\nmunity.\nDecember 3—Ten years a high school teacher, and five years\nan associate director with commercial network. Two\nforeign languages; M.A. degree. Seeks position as pro¬\nducer/director in ETV. Any location in U.S.A.\nDecember 4—Writer, director, researcher, music director de¬\nsires position in ETV. Experience researching and script¬\ning documentary films. Qualified to teach music or U. S.\nhistory. A.B., cum laude (music) and M.A. (communica¬\ntions). Female, 23, single. Prefers Southwest or Midwest.\nDecember 5—Qualified audio technician with varied experi¬\nence in the Armed Forces Radio Service for over 16\nyears. Seeking position with educational radio or tele¬\nvision within the state o,f Florida, or elsewhere.\nDecember 6—TV director-producer prefers Ohio, Southwest,\nWest Coast, or overseas in non-teaching position; has\ndirected 700 programs over ETV station; has produced\npublic relations and information-type programs over\ncommercial TV in Cleveland and New York area. Good\nannouncing voice; has written publicity. M.A. in educa¬\ntion and M.A. in history. Eight years teaching experience.\nSalary range: $7,000 to $8,000.\nDecember 7—Married male, 29, B.F.A. in drama-speech, with\nbackground in educational radio, commercial radio and\ntelevision, 6 years of teaching desires a position as pro¬\nducer-director in Southern California. Minimum salary,\n$6,500. Interested in both educational radio and tele¬\nvision.\nDecember 8—TV production, male, 28, married. Strong in film\nediting with directorial abilities. Network film experience,\nlocal documentary production. Seeking responsible and\ncreative TV situation. Associate in arts, B.S. (3 years in\nprogress). Location open. Minimum salary: $6,500.\nDecember 9—Producer-director-manager, with technical ability,\nexperienced in all aspects of ETV station management,\nwide background of studio and remote production, pres¬\nently completing two years as chief and special projects\nofficer of one of Army's largest closed-circuit produc¬\ntion facilities, desires position with growing creative\n‘'medium market\" installation.\nDecember 10—ETV producer-director, 8 years experience, in¬\nschool television all grade levels, also numerous com¬\nmunity television programs. Age 40, married, no chil¬\ndren. Presently employed; location and salary open.\nPOSITIONS AVAILABLE\n(In order to be considered by these institutions, the reader\nmust be an Individual Member of the NAEB, with credentials\non file with the NAEB Placement Service. Non-members can\nsave time by sending the $10 annual dues and $5 Placement\nregistration fee at the time of inquiry.)\nDec-1 Closed-circuit and educational television systems en¬\ngineering company on East Coast seeks technician or\nengineer with considerable background in closed-circuit\nor broadcast television maintenance. Salary $6,000-\n$7,000.\nDec-2 Executive producer for major ETV station. Heavy local\nlive schedule. Experience in educational or commercial\ntelevision required. $8,000-$12,000. Open immediately.\n4\nNEWSLETTER"
}