{
  "id": "d45-15",
  "text": "c .0 r y\nFUND for av; ' ;;:: jcatior\n934 East Green Street\nPasadena 1, California\nFebruary 1954\nKr . Gray don Ausmus\nPresident, national Association\nof & fteational Broadcasters\nUnivo-sity of Alabama\niveniiy, Alabama\n®eaz' K tv:'' SI\nIt gives % frp&r l pleasure, on bs!-Alf of the Board of Directors of The land\nfor Adult & nation, to inform yU that the Board, at its January 20s 1954 meeting,\napproved a p- nt of $30*000 to the Rational Association of Educational. Broadcasters\nt: provi; .11: a television engineering service for a period of one year beginning\nFebruary 1 . 7.954, Within a f/r days a cheek in the amount of $30*000 will be\nf it by ou' .^counting Department to Mr. Harry J. Skornia, Executive Director of\nthe NationalAssociation of Educational Broadcasters.\nOur Board unt?.» ©tandf# that \\Ms grant will make possible the addition to the\nheadquarters S'-iff of th© KAUB of a television engineer, particularly qualified\nfor kinescope *>srtttions, to provide guidance and assistance to nev educational\ntelevision statics. His assistance to the stations would be directed\nprincipally tow&it kinescope recorder operations but also toward the solving\nof other technical problem; bou*\\i up i/ith studio and control, the transmitter\nand film equipment. The engineer would concentrate on technical standards\nin television, including television audio problems and camera operation.\nIt is recognised by ovr toard that with its very large investment in th physical\nfacilities of educational television stations, the Fund has a direct\ninsuring proper technical and engineering standards, not only in the ■*'<**•\nkinescope equipment but :n a1! phases of station operation and mair <onanoe. The\nservices described are esbremely important not only to the Fund, Icr/ever, but also\nto the total development of educational t-elevA^ion. It has to our -\nDirectors that the National Association of Educational Boradcar^rs is a\nparticularly appropriate organisation to dischary© this funct^cn.\nAt th© ©nd of the- grant year our Board would app relate receiving an audited financial\nstatement with respect to this grant, and someth® during the course of the year\na report of the service?? rendered would also be appreciated. Mr. Griffiths will\ncontinue to keep in clone touch with you on all matters of our mutual concern.\nWe trust that this gran* will enable the Nationd Association of Educational\nBroadcasters to render s highly essential service at this stage of th®\ndevelopment of eduoatioial television^\nWith all good wishes*\nSincerely your a*\nMartha C. Howard\nMGHiJm\nocs Mr. Harry Skornlim, Executive Director.\nNational Association of Educational Broadcast erf;"
}