{
  "id": "d1281-0",
  "text": "■\nN\nA\nEJ\n9\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. XXVI NO. 4\nAt the IERT\n• NAEB luncheon. Friday, April 28, 12:15 p.m., in\nthe Hall of Mirrors. John Burns, president of RCA,\nspeaking on “Progress of Instructional Television—\nA Businessman’s View.” Project reports by William\nG. Harley, NAEB president, and John F. White,\nNETRC president. Also final report of the Hagers¬\ntown project, and a report on the Midwest Airborne\nproject.\nTickets will be sold at the IERT, along with tickets\nfor other meals and functions. Price, $3.50.\n• NAEB Board meeting. Saturday, April 29.\n• Utilization session. Wednesday, April 26, 2:00\np.m. Demonstration of large-class use of television\ninstruction, presented by Martha Gable, director, ra¬\ndio-TV education, Philadelphia Public Schools. Clair\nTettemer, chairman of TV subcommittee of NAEB\nUtilization Committee, will present the NAEB tele¬\nvision utilization kit.\n• American Council for Better Broadcasts luncheon.\nWednesday, April 26, noon, in the Yellow Room.\nLouis Hausman, speaker.\n• ACBB morning session. April 26. Featuring a\npanel of high school teachers and students on “How\nWe Learn to Evaluate Broadcasts”; Dr. Chalmer Hix¬\nson, Ohio State University, on Midwest Airborne edu¬\ncation; Clifford Eblen, program director, WHA, Uni¬\nversity of Wisconsin, on “Newscasting as a Broad¬\ncaster Sees It”; Dr. Lee Dreyfus, assistant director\nof broadcasting, Wayne State University, on “The\nApproaches Are Different”; and Dr. Stuart Hyde,\nSan Francisco State College, on “Creating a Climate\nfor Good Radio-TV.”\n• IERT Awards Dinner. Friday, April 28, 7:30\np.m. Presentation of Ohio State Awards for out¬\nstanding TV and radio programs of 1960. A record\n717 entries have been placed in competition; this is\n115 more than last year’s entries. Videotapes were\nentered this year, for the first time. This year’s pro¬\ngram will include an hour-long television show fea¬\nturing segments from some of the prize-winning pro¬\ngrams and a documentary of the history of radio and\nTV as it is reflected in the various awards given by\nthe institute since 1937.\nAPRIL 1961\nWASHINGTON OFFICE PHONE NUMBER\n. . . is NOrth 7-6000. Address is Suite 1119, 1346\nConnecticut Avenue, N. W., Washington 6.\nHow to Save Money\nOn Your NAEB Membership\nIndividual membership dues in the NAEB will be\nraised to $10 per year as of July 1, 1961. However,\nmembers (or prospective members) may pay for as\nmany years in advance as they care to at the current\nrate of $7.50, if payment is received before June 30,\n1961. Payment should be sent to the NAEB, 1346\nConnecticut Ave., N. W., Washington 6, D. C.\nIndividual members (now numbering some 700)\nreceive the Newsletter, the Journal, a directory of\nmembers (issued semiannually)—plus other reports\nand surveys from time to time. They also have a\nvoice in the affairs of the association, being repre¬\nsented on the NAEB Board of Directors by an Indi¬\nvidual Member Director (currently Dr. Harry J.\nSkornia) elected by and from the Individual member¬\nship.\nThe current student membership rate of $5 and\nthe group student rate of $4 will remain in effect.\nThe foreign rate will be increased to $12.50 per year.\nDeadline Nears for Grants-in-Aid\nNAEB institutional members who want to apply for\nthis year’s radio program grants-in-aid have until\nMay 1 to do so. Each grant is limited to $1,000—in\norder to encourage applications in those instances\nwhere modest outside assistance might mean the dif¬\nference between a mediocre series and an outstanding\nseries.\nSend applications, accompanied by pilot tapes, to\nthe NAEB, 1346 Connecticut Avenue, N. W., Wash¬\nington 6, D. C.\nCONDITIONS\n• Programs must be suitable for use on the NAEB\nRadio Network.\n• Full domestic and foreign radio rights to the pro¬\ngrams—and TV rights to idea, format, and script—"
}