{
  "id": "d1281-1",
  "text": "must be obtained for all program materials included;\nthese rights become NAEB property.\n• A grant-in-aid cannot carry the full burden of pro¬\nduction costs.\n• No grant will include funds for capital expendi¬\ntures.\n• Production should start by September 15, 1961.\nA firm completion date, not later than June 30, 1962,\nmust be indicated.\n• A tape recording of each radio program produced\nwith the help of these grants is to be delivered to\nthe NAEB for possible use on the network. These\nrecordings are to be made upon a professional-type\ntape recorder using plastic-base tape on 1200-foot or\n2400-foot reels recorded full width at 15 inches per\nsecond.\nHOW TO APPLY\nApplication should be in letter form, with four\nexhibits attached. Six copies of all written material\nand exhibits must be supplied, together with a state¬\nment of the staff and facilities available for the\nproject, and the pilot on tape.\nExhibit A. A description of the proposed series.\nThis should be in two parts: (1) A brief statement\nof the general concept of the program, its educa¬\ntional objectives, and the method of treatment. (2) A\nmore detailed analysis of each program in the series,\ndevelopment of the central theme, production format,\nparticipants, and related information.\nExhibit B. The proposed budget for the project.\nThis should be in two parts: (1) The part you ex¬\npect to contribute from your own resources and per¬\nsonnel, with dollar equivalents or values clearly indi¬\ncated. (2) The part you would expect to receive as\na grant-in-aid.\nExhibit C. Some evidence of your ability to pro¬\nduce a series of programs in this area. This must in¬\nclude: (1) A pilot program on tape, meeting specifica¬\ntions set forth above, from the proposed series. This\nprogram should indicate clearly the form, the partici¬\npants, and the content to be included in the final\nseries. If it is not possible to secure the services of\nkey personnel for a sample program, such a program\nmay be produced with actors portraying such content\nauthorities. (2) Biographical information on content\nauthorities, program participants, and production per¬\nsonnel.\nExhibit D. A statement of the willingness of your\ninstitution to accept the requested grant, to abide by\nthe conditions stipulated and to make the necessary\nfinancial reports. This statement also should include\na declaration of ability to accept and administer the\ngrant. This must be signed by an administrative officer\nof your organization.\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, I 19 Gregory Hall,\nUrbana, III. $5.00 a year, edited by Betty McKenzie.\nNAEB Convention Planning Begins\nThe NAEB Headquarters staff in Washington has\nbegun work on the 1961 convention, to be held in\nOctober in the capital city.\nIn response to requests on previous convention\nquestionnaires, there will be more time devoted to\nNAEB business sessions and to special-interest sec¬\ntion meetings. A special feature this year will be an\n“association clinic,” in which NAEBers will have an\nopportunity to ask questions about NAEB affairs—\nwhat the association is and isn’t doing and why.\nThere will be three business sessions instead of two.\nLast year there were complaints that there were\ntoo many section meetings at the same time, thus\ndepriving members of an opportunity to attend several\nsuch meetings. This year there will be only two such\nmeetings running simultaneously.\nDATES\nSunday, October 22: Registration begins.\nNAEB Board meets.\nMonday, October 23: Convention opens at 2 p.m.\nRegistration continues in a.m.\nNAEB Board meets in a.m.\nTuesday, October 24: NAEB luncheon.\nWednesday, October 25 : NAEB banquet.\nThursday, October 26: Convention closes at noon.\nLOCATION\nWillard Hotel, 14th and Pennsylvania Streets, N. W.,\nWashington, D. C.\nMandatory Conelrad Drill April 28\nA nationwide Conelrad drill will take place April 28\nbeginning at 4:00 p.m. and continuing until 4:30 p.m.\nParticipation is mandatory for all AM, FM, and TV\nbroadcast stations in the continental United States,\nincluding Alaska. Broadcast stations in Hawaii and\nin the territorial possessions are requested to partici¬\npate on a voluntary basis.\nAll AM broadcast stations not holding National\nDefense Emergency Authorizations for operation in\nthe Emergency Broadcast System on 640 or 1240 kc\n—as well as all FM and TV broadcast stations, un¬\nless authorized by the FCC to operate—will leave\nthe air and remain silent during the 30-minute period.\nSPECIAL PUBLICATION OFFER\nEach month the NAEB offers a special sale on a particular\nNAEB publication, at less than one-half the normal price. This\nmonth's special:\nNAEB SEMINAR ON CHILDREN'S\nTELEVISION PROGRAMS—99c\nA report of the seminar on children's television programs held\nat Boston University, March 29-April I, 1958, for educational\nand commercial broadcasters of children's TV programs. Edited\nby Harold Hill.\nPayment must accompany order. Send to: Special Publi¬\ncation, NAEB, 119 Gregory Hall, Urbana, Illinois. THIS OFFER\nEXPIRES MAY 15, 1961.\n2\nNEWSLETTER"
}