{
  "id": "d1440-10",
  "text": "Report of the\nSPECIAL COMMITTEE ON SCHOOL MEMBERSHIP\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nTo the President:\nYour committee, appointed to consider a policy for the\nNational Association of Educational Broadcasters should the\nsohools now entering the field of broadcasting seek membership,\nmet in Columbus, Ohio, on May 8th, 19^*\nThe problem regarding membership arises from the fact that\nmany school systems are applying for FM licenses and will be\nengaged in broadcasting educational programs. These schools\nwill undoubtedly wish to become affiliated with an organlzatlo\nsuch as the NAEB or to form their own group. Under the present\nconstitution all these schools are eligible to membership In NAEB.\nIt is recognized that, while there is a general similarity in\nthe problems of all educational broadcasters, there are some very\nspecial differences in the policies and objectives of the college\nand uunlversity group as compared to those of the schools, me\nparticular differences lie in the fact that the college and\nuniversity broadcasters are concerned primarily with programs on\nthe adult level, even though some university stations may have\nschool broadcasts* The public school stations will be interested\nin the in-school type of program and on the school age level.\nThe committee agreed that it is highly desirable to have an\norganization, such as NAEB, which is concerned with the uniqufe\nproblems of adult education eminating from the colleges and\nuniversities. Such an organization will permit free discussion\nof mutual interests and intimate exchange of ®xP®£lences not\nnoeBible if the group be expanded to include a wider field, he\nunqualified acceptance of membership by schools Is therefore\ndeemed unwise*\nThere are some school stations which will extend their broad¬\ncasts beyond school hours and classroom application and will\nattempt to reach an adult audience. In these instances the\nproblems of these stations may approach those of the colleges\nand universities. You committee concludes that some provision\nshould be retained whereby such schools might become members in\nNAEB.\nAfter consideration of these questions, the committee wishes\nto offer the following recommendations:\n1, That the article in the present constitution regarding\nmembership be retained."
}