{
  "id": "d1440-2",
  "text": "NETWORK NEWS\n—Bob Underwood\nAs you read this the mass duplicators are turning out\nprograms for the second quarter offering. This of¬\nfering has quite a bit of “meat” to it, we believe, and\nwe will be pleased to receive any comments you may\nhave about it.\nWe now are plugging away trying to get the\nopening and closing lines for all programs in this of¬\nfering. These will be mailed to you as soon as pos¬\nsible, but the times for all programs are not yet avail¬\nable. We’re making progress on the new cue sheet\nsystem: this quarter we’ll have all the openers and\nclosers in a bundle, and who knows what the next\nquarter will bring!\nAfter a few mental struggles the tape inventory\nsheets have been completed and mailed out. This in¬\nventory statement covers the time from Issue #50,\n1956 through Issue #7, 1957. You may wish to retain\nthese inventory sheets for keeping your future records\non tape shipments; just remember not to charge your¬\nself for any tapes until their release date.\nFor your information, the tape inventory balance\nas of Issue #7 was minus over four thousand tapes.\nWe do not believe it takes four thousand tapes to\nkeep the network stations supplied for one, two or\neven three weeks, and we certainly could use another\nthousand or so tapes around here.\nTwice during the past month the production\nstaff has had to find something else to do because our\nsupply of tape had been exhausted. And I don’t have\nto tell you who represents our largest source of tape,\ndo I? Please return tapes as soon as possible after\nbroadcast. And all you stations who go off the air\nduring the summer—don’t forget to clean off your\nshelves before you leave. We can use the tapes!\nAlso, we could use some submissions, particularly\nin the in-school division of network activity. The\ntime is drawing near when the School Committee\nwill select the series for the next in-school offering,\nand the Committee welcomes the opportunity to re¬\nview your submissions. Let us hear from you in this\nregard. Submissions for the regular offering will also\nbe received gladly.\n—NAEB—\nA national 14-member Advisory Committee of prom¬\ninent commercial and educational broadcasters is\nassisting in planning Ohio State University’s 1957\nIERT. The annual 4-day conference, oldest and larg¬\nest of its kind in the nation, has been scheduled for\nMay 8-11 at the Deshler-Hilton Hotel in Columbus.\nDIRECTORY CHANGES\np. I 121 Active Members\n77 Affiliate Members,\n288 Total Members\n11 TV Only Members\n(I) ... These 121 members operate . . . 154 stations\np. 5 WETV V-12 kw„ A-6 kw. (was WABE-TV)\np. II WTVS (TV) Delete: William Wood Add: Henry\nD. Brown WKAR (AM) Change phone number\nEXT. 2272\np. 18 Delete WQED\np. 25 Loyola University Delete: Boyd W. Fellows Add: Stan\nSzydlik\np. 32 University of Pittsburgh Delete: William Tacey Add:\nTom Coleman\np. 38 Under Illinois Delete: Sheldon Fisher (Urbana) Add\nunder Indiana: Sheldon Fisher Radio Station WTHI\nTerre Haute, Indiana\np. 42 Columbia University Miss Marjorie Fiske Address is:\n605 W. I 15th Street New York 25, New York\np. 45 Under Tennessee Add:\nMotion Picture Laboratories Frank M. McSeary 1672\n(Memphis) Union Ave.\nMemphis 4, Tenn.\np. 53 Delete: WQED\nREPORT FORM PARIS\nKeith Engar\nNAEB Fvlbright in Paris\nThe French Broadcasting System has just completed\nits latest series for NAEB. As designed by Madame\nMagdeline Paz, the series, titled “French Ways of\nLife,” features French leaders in several fields who\nare interviewed in English in an informal situation.\nYou’ll be as astonished as I was with the critical\nself-examination these brilliant men and women give\nFrance.\nThe result is a first-rate, almost brutally frank\nevaluation of the French way of doing things in\nvaried fields of the arts, education, housing, health,\netc. Among those interviewed are Jules Romains,\nAndre Maurois, Jean Sarailh, and equally distin¬\nguished men and women, perhaps not as well known\nto Americans.\nAfter hearing the programs, I feel they could\nwell be kept as part of an audio library, at least if\none wants to understand the France of today. These\ninterviews provide the kind of incisive insights only\na Frenchman could give. If I may add a personal re¬\nflection, one also is given additional standards with\nwhich to evaluate his own country.\n—NAEB—\nIDEA FOR NAEB COMMITTEEMEN\nThe IERT meeting, May 8-11 at Ohio State University will be a\ngood time to get together, with all members of your NAEB com-,\nmittee that will be .there. Why not try to sandwich in a small\nNAEB committee meeting during the regular course of events?\nNEWSLETTER\nPage 3"
}