{
  "id": "d1440-4",
  "text": "NEWS OF MEMBERS\nGENERAL\n► Televised education in Memphis may come to an\nend within the next 2 months unless $110,000 is ap¬\npropriated by the city and county commissions for\n“basic” operation cost.\nJulian Bondurant, president of the Memphis\nCommunity TV Foundation which activated\nWKNO-TV last June, said neither commission has\nacted on the station’s October request for financial\naid.\nIn order to meet legal requirements, the money\nwould have to be appropriated by the city and county\ncommissions through their respective boards of edu¬\ncation. The amount needed - less than the cost of\none textbook per school child in Memphis - would\nsupplement $50,000 paid by the state and other\nrevenues which go into the station’s budget of nearly\n$30,000 a year.\n► In a Chicago Daily News story, “TV Digs Own\nGrave Here,” decrying the sterility of Chicago’s com¬\nmercial TV, reporter Jack Mabley mentioned\nWTTW, Chicago’s ETV station, “looks better every\nday as its commercial counterparts deteriorate.”\n► The future looks grim for WTHS-TV, Dade\nCounty’s ETV station. If $76,200 isn’t found some¬\nwhere for next year’s budget, the station will fold\non June 15; and the channel will almost c&rtainly be\nassigned to a commercial broadcasting company.\nTV authorities feel the school system should\ncontribute the money; but Dade County School\nBoard members are divided 3-2 against it. (Esti¬\nmated cost to raise the money is about 35c per year\nper child in Dade schools.)\nThe Miami Daily News ran two big articles Feb¬\nruary 14 and 15 publicizing WTHS-TV’s problems\nand extrolling benefits the station gives listeners. We\nagree with reporter Louis Blanchard when he warns,\n“For want of a nail ...”\n► A 4-months’ feud between the Philadelphia\nBoard of Public Education and WHYY-TV, the, city’s\nETV station, was settled February 21, 1957. The set¬\ntlement paves the way for the school board to give\nthe station full financial backing and put a program\nof ETV in the public schools.\nThe agreement calls for reorganization of the sta¬\ntion board to give the school district greater rep¬\nresentation. They will have 5 more members on the\n21-member WHYY-TV board, a total of 10 rep¬\nresentatives.\nAnother “term” was the resignations of Laurence\nLePage, chairman of the WHYY board, and Walter\nBiddle Saul, president of the station. This removes\nthe station’s two top officials. LePage said he would\nsubmit his resignation only when reorganization was\nfully implemented.\nSaul was not at the meeting, but when advised\nof the terms, commented his resignation was a small\nprice to pay in comparison to public interest in ETV.\nPERSONNEL\n^ The Metropolitan Educational TV Association,\nNew York, has added two persons to its executive\nstaff. Dr. A. W. Brown, provost and professor of\nEnglish at Union College, Schenectady, was named\npresident, and Richard D. Heffner was appointed\ndirector of programming for META.\nMrs. Claire Gregory is the new women’s director of\nthe Indiana University Radio and TV Service. She\nis also lecturer in the I. U. Radio and TV Depart¬\nment and is primarily responsible for programs of\ninterest to women and children.\n► Marguerite Fleming of KSLH, St. Louis, is\nrather a famous person to her alma mater, Illinois\nWesleyan University. A fellow Wesley alum at\nNAEB Headquarters spotted a large article on Miss\nFleming in the latest issue of their alumni maga¬\nzine. The story was a nice tribute to the KSLH man¬\nager. She seems to be collecting a lot of tributes\nlately!\nWe are grieved to report the death of Donald Ames, program\ndirector for KDPS, Des Moines Public Schools radio station. Mr.\nAmes died of a heart attack December 21, 1956. He had been\nwith the station since its beginning five years ago. Notice of\nhis demise should have appeared in the February NEWSLETTER,\nand our apologies to all concerned that it did not.\nNEWSLETTER\nPage 5"
}