{
  "id": "d1440-7",
  "text": "We hope to meet some NAEB engineers there\nand will be checking the bulletin board near the reg¬\nistration desk to find out how we can get together.\n* * * *\nAnother date to remember is the NARTB En¬\ngineering Conference and broadcast equipment dis¬\nplay at the Conrad Hilton in Chicago April 8-11.\nThe past two years through the cooperation of\nNARTB we have provided educational station en¬\ngineers who wished to attend with NAEB identifica¬\ntion cards. This card entitled them to register for the\nPlacement Supplement\nThe following are persons registered with, us last month.\nAnyone wishing further information or wishing to register\nwith the NAEB placement Service contact Mrs. Judith Ste¬\nvens, 14 Gregory Hall, Urbana, Illinois.\nMarch I — Director with commercial station desires ETV\nposition as producer-director. Interested in teaching. Male, 23,\nM.S. (Syracuse), married. Location open. $85/wk.\nMarch 2 — Floor manager and producer of children s\nshows for large ETV station desires program director posi¬\ntion in the same field. Will teach. Is also a speech and\nhearing specialist. Has been teacher-consultant and talent\non network shows. Male, 33, married, M.S. in August 57.\nLocation, salary open.\nMarch 3 _ Male, 30, married, M.A. in music, desires a\nposition as music director or in production in educational\nbroadcasting. Has 6 years experience in educational radio,\n2 years in commercial transcript field. Also 2 years of courses\nand broadcast experience in TV. Location open. $5500.\nMarch 4 — Production assistant for commercial TV wants\nswitch to ETV. 3 years experience as announcer and has writ¬\nten and produced ETV shows. Male, single, 23, B.A. Location\nopen. $4000.\nMarch 5 — Producer-director at commercial TV station\ndesires switch to ETV. Much technical experience-permanently\nresponsible for 5 regular shows. Male, 29 married. Location\nopen. $4500-5000.\nMarch 6 — Producer-director and production manager\nfor commercial TV desires changeover to ETV. Trains person¬\nnel, often designs and builds his own sets. Male, 28, married.\nLocation open. $7000.\nMarch 7 — Control room operator for educational radio\nstation, also does tape recordings, wants a position with more\nchance for advancement. Male, 35, single. Location open,\nbut prefers East. $300/month.\nMarch 8 — Male, 38, married, Ph. D. im radio-TV, now\nTV coordinator for school system, has much experience or¬\nganizing and directing in-school TV. Wants ETV position where\ncan fully utilize knowledge of medium-producer, in-school\nbroadcasting, etc. Location open. $7500.\nMarch 9 — Assistant professor of speech and radio-TV,\nand producer of numerous ETV shows. Has been in education¬\nal broadcasting almost 20 years. Male, 38, married, Ed.D.\nPrefers West Coast, Florida, New York. $6-7000.\nMarch 10 — School audio-visual director with_ many years\nteaching experience wants ETV position. Has various courses\nin radio-TV. Male, married, 32, M.A. Location open. $5-6000.\nEngineering Conference sessions only, and also per¬\nmitted entrance to the equipment exhibits by pay¬\nment of a daily or reduced registration fee for the en¬\ntire meeting.\nWe hope this privilege will be extended for the\nApril meeting. A further notice will be forthcoming\nwhen definite approval of this procedure has been\nobtained.\n* * * *\nWe have occasional inquiries about the avail¬\nability of used equipment member stations may have\nand are not using. This is especially true of used fre¬\nquency modulation transmitters. The most recent\ninquiry asked where a used 10 watt FM transmitter\nmight be obtained.\nWe realize many tax supported stations find it\nvery difficult to dispose of unwanted equipment. But\nif any of our readers have serviceable equipment\nwhich might enable an institution to get on the air,\nwe’d be glad to help buyer and seller get together.\n* * * *\nATTENTION GAIN GRINDERS!\nElectronic fuel injection for automobiles will\nmean the end of mechanical linkages for accelerator\ncontrol (no carburetor). Instead, a potentiometer\nwill accomplish the function of present day accelera¬\ntors. Wonder if they’ll ever rate automobiles in dbh\n(db above one horsepower).\n* * * *\nIRE Transactions for February, 1957 contains a\npaper by Duane Weise, chief engineer of WTTW,\npresented at the Sixth Annual Fall Symposium of the\nIRE Professional Group on Broadcast Transmission\nSystems. It describes the WTTW studio facilities in\nsome detail and contains other practical papers of in¬\nterest to TV engineers.\nKeith Ketcham, chief engineer of WOI-TV, has\nprepared a resume of a paper by E. D. Good'ale of\nNBC on “Phase, Amplitude and Aperture Correction\nin TV systems.” We have reproduced this resume and\nsent it to chief engineers of ETV stations and pro¬\nduction centers. Additional copies are available upon\nrequest to NAEB.\n* * * *\nWe hope more of you will follow Howard\nAndreasen’s example and drop us a note telling of\nyour plans. The Independent School District of Des\nMoines was granted a CP for Channel 11 on Dec¬\nember 12, 1956. They plan to operate at their present\nKDPS studio until their new TV studio is finished in\nlate summer of 1958.\nPresent plans call for regular programming to\nbegin in late September, 1957, with 10 kw ERP.\nPower will be increased to 50 kw when the new trans¬\nmitter site is completed.\nPage 8\nNEWSLETTER"
}