{
  "id": "d1021-105",
  "text": "CONF/Dfcfl'r/yi^\n. st li sd\nemails of approval ef Grcnts-ilsi-Alcl :'<u radio* fee. :3d on the re^m-Mnd&tioas of\nv-ue flrsni-e.mr'fid 0:*rribtee* sftd t-ssb able to erssdite this coneidfrabl:/ while\n:1b torn.\nBr. I^wssorn and X drove from torn ::-. •. r to Jackson together and had an ex-\n•■■• ' ■ ■ this *\n• ©ported\n/l ;;u ft esmsnt vMxih corps-log to emerge rsgardissg the vgp in\nand- to ■ 93S* . It r . i' if • .\n'\nav this time* except as mentioned under the Jackson report Infow. Basic dis¬\ncussions 5.‘cn’Oi.ved around reactions to the fix?©\"organisation meetings taking\n'he past J\nof sea oo.BVypo: . tn of the iffi, the Elite* and the FiE sec o to t e emerging*\nk) «~cf- ’ucr; Face ids of sy crowded agenda* Stanley Andrews and Francis\n* 3S <j -f‘ * **c to J'f — f < ; \"'or\ndiseussio - oc a :’dbl £ • Sfet in s i ayself. The-meeting was\ndigger,' r ... . pews con¬\ncerning the desirafoilitgr in air opinion of their possibly setting; up a tape\nend/or film raid film clip distribution end production facility.\nFrom the .'discussion it ©surged that the job which HPAC intends to do mast\nbe done largely ., . tionaL outlets* although ap¬\npreciated*^ would not provide adequate distrifetion. The problems of the ETEQ\nand the HAEB* if faced with- any attempt to handle production and distribution\nfor the WAG (except on a v&xy limited basis) sIscTtoiM be insurmountable.\nFor both'-ftp the several\nIntere\nBefore we broke up* X suggested that we try to make mailable to the WAG\nfor a trial offer to its xfrm editors, one of oar\n'csped agricultiirsl series — probably a fcmt-i^-id production alreadr avail¬\nable. ThB Co: Ir would make ava:ll,fble such a .series klso in television. Out\nof the experience secured in this trial ran ssipht emerge the desirability of\nall of unendorsing the creation of perhaps a ooeranrciallp^opsrated center\nxo.r dis'cmoiroxon purposes only Fetch could handle such jobs for six ceeganisa—\ntions. ©de doss not mean that men a ccrcsaereial center would tans over the\n3'uWork. v - ' ' l} ,-ick for one of the\nimB programs on taps; if all other clearances could be provided, the distri¬\nbution joio in this ease could be turned over to such a Gender*\nIn xriew of the Center’s inability also to handle such large scale distri¬\nbution* this seeizsd tentatively of inters as to -ferr as well. Follcwing the\ndiscussion we had* the WAG left with tie iiKpreasi^n that tbs; creation of either\na production or distribution facility by them out ef Kellogg Foundation funds\nwas out., of the puo.^tion* si;=e-e the job,, oisse tecs.: d* v;e:f.e be more ccsspli-\ncated than th^y at first thought."
}