{
  "id": "d1021-131",
  "text": "x\nReport No* 1\nTo: NAEB BOARD OF DIRECTORS 11-17-54\nFrom: Frank E* Schooley\nRes Presidential Activities, etc*\nlo It is the intention of the president to issue these reports\nfrom time to time, in much the same form as this* They’ll be\nnumbered, dated, and subject matters indicated*\n2* Also, I hope to keep abreast of more or less routine board\nmatters by mail* I’ll use a form and ballot, and will furnish\nsecond copy of ballot if you care to use same for records* Personally,\nI’d think it would save file space if you’d indicate your votes on\nrecommendation sheet* But you’ll get two copies on first mailing\nso you can judge what you wish to do*\n3* Treasurer gob Coleman and I had thorough going over of problems\nrelating to the treasurer’s duties, obligations, and financial\npractices of NAEB. No doubt, Bob will have many questions from\ntime to time. However, we did agree on a number of things, vfoich\nI’ll list here:\na* Schooley will retain duties of treasurer to Jan* 1, 1955*\nb« Schooley will transmit funds in approximate amount of\n$40,000 shortly before first of new year* Balance after\nJan* I*\nCo Schooley will handle all deposits, disbursements through\nDecember 31, 1954; Coleman all transactions beginning\nJ an o 1 o\ndo Coleman will furnish request for Board approval of\ndepository designation*\ne, Coleman will seek Board approval of bonding in amount\nof $40,000 *\nfo Schooley will prepare and mail all statements up to\nJanuary 1, and including mailing of statements for 1955\ndues*\ngo Normally, all revenues and bills for payments will pass\nthrough headquarters. Revenues will simply be mailed on*\nBills will have appropriate notations, such as account to\nwhich they should be charged, and approval of proper\nauthority in headquarters0\nI think I’ve stated most matters of importance that we discussed, and\nI believe I’ve reported correctly our agreements. As I say, we’ll\nprobably meet again or discuss again many situations until Bob\nlearns the complexities of operations*\n4* While in Ann Arbor for the Illinois-Michigan football game (which,\nI need not tell you, Illinois lost) had lunch with Waldo, Garnet,\nEd Staheff, and Ed Willis* Also visited Center offices and all\nstaffers*\n5* Page 1 is running out and I hope to hold as many reports to one\npage as is possible, so I stop on page 1, report 1*\ncc: Skornia"
}