{
  "id": "d1021-18",
  "text": "SUMMARY OF RESULTS OF QUESTIONNAIRE ON WEEKLY DISTRIBUTION (NON-IN-SCHOOL)\n54 out of 76 stations returned the questionnaire, though not every station\nanswered every question.\nThe question on the types of broadcasting done (\"general audience\" or \"in¬\nschool\") drew the following answers:\nA. This station is a general educational station and does not do in-school\nbroadcasting. 22 stations (40.7/6 of responding stations)\nB. This station is a general educational station and does do in-school\nbroadcasting. 12 stations (22.2$)\nC. This station does in-school broadcasting only. 4 stations (7.4%)\nD. This station does in-school broadcasting primarily and general audience\nbroadcasting secondarily. 8 stations (14.8$)\nE. This station places equal emphasis on in-school and general audience\nbroadcasting. 7 stations (13$)\n51 out of 54 stations (94.3$) publish program schedules. 17 (31.5$) publish\nmonthly, 8 (14.8$) quarterly, 7 (13$) each semester or 4 months, 6 (11.1$) bi¬\nmonthly, 3 (5.5$) every 6 months, and 1 (1.9$) daily, 1 yearly, 1 bi-weekly, and\n1 every 7 weeks.\n19 stations (35.2$) prefer to begin new series during the first full week of\na broadcast season, 12 (22.2$)during the first full week of a month. To 13\nstations (24.1$) it makes no difference.\n24 stations (44.4$) prefer that the year to be divided into the four seasons\nJanuary through March, April - June, July - September, October - December.\n12 stations (22.2$) prefer that the seasons be December - February, March - May,\nJune - August, September - November. Among the 12 stations which ranked their\npreferences, the latter schedule is slightly more preferred. But since the former\nschedule is preferred by the larger group, the Network will attempt to return to\nit immediately.\n4 stations (7.4$) prefer that series begin at various times throughout the\nseason and not all at the same time at the beginning of each season. 6 stations\n(11.1$) said that it made no difference to them when series began.\n11 stations (20.4$) prefer that as many Network series as possible begin with\nthe same issue, even if this means decreasing the Network output during one to\nthree weeks at the end of each broadcast season, 25 (46.3$) prefer that the\nNetwork maintain as far as possible a fairly steady output rather than begin as\nmany series as possible with the same issue. 9 (16.7$) prefer that the Network\nattempt to strike a balance between these two choices, and 5 (9.3$) said it made\nno difference to them."
}