{
  "id": "d1021-180",
  "text": "P.S. Just at press time came a note from Stewart Howe, Vice-President of\nIllinois Institute of Technology and member of the NAEB Public Relations Poli¬\ncy Committee. Stew points out that I do not tell what the CNO (on which I\nreport) is. Guess I*ve slipped on several like that. Here are a few recent\nones used.\nCNO stands for Council of National Organizations\nAEA stands for Adult Education Association\nACPRA stands for American College Public Relations Association\nNPAC stands for National Project in Agricultural Communications\nTFAE stands for The Fund for Advancement of Education\nFAE stands for Fund for Adult Education\nETRC stands for Educational Television and Radio Center\nNL stands for NAEB Newsletter\nIncidentally, Stew and the Public Relations Committee generally have\nreacted often, and did make suggestions earlier which we carried in the NL,\nOur thanks to Stew, Jim Niles, Elmer Sulzer and the others who have given us\nthe benefit of their thinking.\nRecently editors of midwest organizations belonging to the Council of\nNational Organizations have been meeting monthly in Chicago to discuss mutual\npublication problems and to advise one another on possible methods of improving\ntheir publications. Associate Director Harold Hill has represented the NAEB\nat these meetings, and many of the recent changes in layout, format, type, etc.,\nin the Newsletter have come about as a result of suggestions made at these\nmeetings.\nThat editors experienced in publishing materials for national organizations\nbelieve forward strides have been made in the Newsletter is evidenced by this\nletter just received by Hill from Mrs. Ruth Pinkus, editor of B*nai BPith’s\nWomen1s World;\n”Your January Newsletter came last week, and I just wanted to tell you that\nin my humble opinion, the new appearance compared to the old is as sunlight\nto the darkest night. I have been trying to make similar improvements, and\nyour success cheers me on.”"
}