{
  "id": "d1021-21",
  "text": "COPY\nHoteg From Radio Station KOAC\nDear Harry 8\nI thought you 'd be interested in the information contained in the following\nletter to Ralph Steetle, as well as the material which we ve submitted\non the KOAC request for hearing against the 550 kc, applicant at Lewiston*\nThanks for your help,\n/&/ James Morris, Program Manager, KOAC\nMr, Ralph Steetle\nExecutive Director\nJoint Committee on\nEducational Television\n1785 Massachusetts Av©», N.W.\nWashington, D. C.\nFebruary 4, 1954\nbear Ralphs\nAn event occurred here in Corvallis on January 29 which indicates an activity\nof tremendous significance to those of us interested in the possible future\nof educational television.\nMaurice Mitchell9 at present with Encyclopedia Britanniea Films, better known\nas the former head of Broadcast Advertising Bureau and prominent radio and\ntelevision broadcaster, addressed the banquet meeting of the Oregon Audio-visual\nAssociation,\nMr, Mitchell devoted the major portion of his remarks to educational TV,\nCertain of his statements will be of Interest to yoji, I am sure 8\n\"The reservation of channels to educational television was like\n250 prime business locations being removed\n''Every educational television station licensed is a threat to broadcasters,\"\nMf,'as a commercial broadcaster, you permit an educational TV station to\nbe licensed you start by conceding that commercial stations do not serve\nIn the public interest. If you were a commercial broadcaster,, would you\nso concede?\"\n\"(Broadcasters are) a tough, closelmit, hard-hitting group of business men,\"\n\"Here, then, is a hard core of people (commercial broadcasters) out to\nkeep these channels away from educational TV assignments,\"\nAfter having so thoroughly outlined the position of the commercial broadcasters,\nand having given his own background as a radio and TV broadcaster, newly moved\nover to the film industry, Mr. Mitchell proceeded to use the same line of\narguments against educational TV that we have heard so many times before—only\nin more colorful language than most of our opposition are capable of commanding.\nHe spent some time on the\"fallacious cost figures\" which educators have proposed\nfor television stations,that our operating costs for an annual budget wouldn’t"
}