{
  "id": "d1021-8",
  "text": "QUESTIONNAIRE\n-3-\nU. This is the most important part of the questionnaire!\nIn the space below you will find three examples of how the 52 issues (weeks)\nof a year might be divided into four broadcast seasons of equal length. The\n\"Typical Dates\" given are the release dates during 1955. (The actual dates\nwould vary slightly from year to year.)\n\"Example A\" shows how Network Headquarters divided the year into seasons when\nmas s- duplic at ion was begun two years ago.\n\"Example B\" divides the year so that the third season falls from Issues 23 to\n36, when many stations close down for the summer.\n\"Example C\"shows how the year may be divided according to present Network sched¬\nuling. Tills division evolved through the attempt to distribute the maximum\namount of Network programs without strict regard to seasons. It may be altered\naccording to your wishes.\n\"Example D\" affords you an opportunity to indicate any other way in which you\nwould prefer the year to be divided into 13-week seasons of equal length.\n\"Example 1\"affords you an opportunity to indicate, if you wish, how you^would\nlike the year to be divided into broadcast seasons of unequal length. Please\nnumber these different examples of broadcast seasons according to your pref¬\nerence.\nIssues\nTypical Dates\nB)\nIssues\nTypical Dates\nI - 13\n(Jan. 2 - Mar. 2?)\n1*9-9\n(Dec. - Fed. 27)\nlh - 26\n(April 3 - June 26)\n10 -22\n(Mar. 6 - May 29)\n27 - 39\n(July 17 - Sept. 25)\n23 - 35\n(June 5 - Aug. 28)\nho - 52\n(Oct. 2 - Dec. 25)\n36 - 1*8\n(Sept, h - Nov. 27)\nIssues\nTypical Dates\nD)\nA fourth division of the year\n47-7\n(Nov. 21 *5>U - Feb.\n13)\ninto seasons of EQUAL LENGTH;\n8-20\n(Feb. 20 - May 15)\n21 - 33\n(May 22 - Aug. lU)\n31* - 1*6\n(Aug. 21 - Nov. 20)\nE) _A division of the year into\nseasons of UNEQUAL LENGTH;\nF) _We prefer that programs begin\n—■ at various times throughout\nthe season and not all at the\n—. same time at the beginning of\neach season.\n—g) _Makes no difference.\nComment;\n(i/n/55)"
}