{
  "id": "d1511-0",
  "text": "•NAEB NE'AS LETTER\nNAT IONAL ASSOCI AT 1 ON OF EDUCATIONAL BROADCASTERS\nA, James Cbel, Editor, Station VM L L, Urbana, Jll*\nFebruary I, 1945\nFCC PROPOSES ALLOCATION PLAN\nThe. FCC announced its proposed allocation plan January l5, 1945 covering\nTHE UTILI7ATI0N OF FREQUENCIES FROM 25,000 KC TO 30,000,000 KC. ThE\nreport OF THE FCC AS IT APPLIES TO EDUCATION IS ENCLOSED WITH THIS NrwS\nLetter* Op importance to us mainly is the allocation of 20 channels\nADJACENT TO THE LOW END OF THE COMMERCIAL FVl BAND FOR THE EXCLUSIVE USE\nBY NON-COMMERCIAL EDUCATIONAL BROADCASTERSp\nThere is a great deal of discussion among the experts in FM transmission\nAS TO the VMSOOM OF MOVING THE FM BAND UP TO THE 84,000 TO *02,000 KC\nrange. Your editor attended the convention in New York last week\nAND witnessed A RED-HOT DISCUSSION AMONG THE BEST ENGINEERS IN THE BUS¬\nINESS ON THIS VERY TOPIC. As A MATTER OF FACT THE CONVENTION WAS\nEXTENDED TO SATURDAY AFTERNOON SO THAT A SPECIAL SESSION MIGHT BE\nDEVOTED TO THIS PROBLEM ALONE.\nThe FCC propagation specialists of the engineering department prepared\nA paper V'HICH showed THAT THERE WOULD BE LONG-DISTANCE INTERFERENCE IF\nFM remained at ITS PRESENT SPOT IN THE SPECTRUM. ThE PAPER ALSO PURPORTED\nTO SHOW THAT THERE Y'OULO BE NO REDUCTION OF COVERAGE DUE TO THE USE OF\nTHE HIGHER FRECUENCIES. MAJOR ARMSTRONG CONTESTED THIS POINT OF VIEW,\nPOINTING OUT THAT THERE HAS NEVER BEEN TO HIS KNOWLEDGE ANY CASE OF\nDESTRUCTIVE INTERFERENCE DUE TO LONG DISTANCE TRANSMISSION AND THAT THE\nEQUIPMENT SITUATION WOULD BE MUCH MORE DIFFICULT.\nYour editor has witnessed some long distance interference but whether it\nCOULD BE called DESTRUCTIVE OR NOT IS A MATTER OF OPINION. He HAS ALSO\nBEEN CALLED UPON TO DESIGN A NUMBER OF FM INSTALLATIONS AND IS PROCESSING\nA 50 KW COMMERCIAL FM APPLICATION AT THE PRESENT TIME. NqNE OF THE\nEQUIPMENT MANUFACTURERS WOULD GIVE ANY INDICATION OF HOW THEY WERE GOING\nTO GET 50 KV\\I OUTPUT AT THOSE FREQUENCIES NOR CAN YOUR EDITOR SEE HOW\nTHIS AMOUNT OF POWER AT THESE FREQUENCIES CAN BE TRANSMITTED TO AN ANTENNA\n500 FEET HIGH WITHOUT EXCESSIVE LOSSES. UNDOUBTEDLY THE PROBLEM CAN BE\nWORKED OUT BUT THE SOLUTION IS NOT APPARENT NOW,\nThe NAEB Allocat\nAT THE February\nIN A TECHNICAL W\nWE IN EDUCATION\nAND ALLOCATED TO\nFREQUENCIES THAT\nAVAILABLE BY THE\nOUR FREQUENCIES\nALLY AT THE LOW\nION Committee has decided not to offer an oral argument\n28 HEARINGS on THE TOPIC SINCE WE HAVE NOTHING TO OFFER\nAY WHICH WOULD NOT BE PRESENTED BY OTHERS AND BECAUSE\nmust feel VERY GRATIFIED THAT THE FCC HAS SEEN OUR NEEDS\nUS 20 CHANNELS. We«RE SURE THAT WE CAN OPERATE AT ANY\nFCC SEES FIT TO ASSIGN SO LONG AS RECEIVERS ARE MADE\nMANUFACTURERS. ThIS IS ASSURED BY THE ALLOCATION OF\nCONTIGUOUS WITH THE COMMERCIAL FREQUENCIES AND INCIDENT-\nFREQUENCY ENOn?"
}