{
  "id": "d1511-1",
  "text": "NAEB MEWS LETTER\nPage.2\nFebruary *, 1945\nTHAT SERVICE WILL BE OFFERED TO MARGINAL LISTENING AREAS.\nPROGRAM AODITIONS AT WILL\nStarting the first of January the Illinois Farm Hour was expanded to a\nFULL HOUR running FROM I 2100 TO I J 00 Pf^* EVERYDAY BUT SuNDAY. ThIS PROGRAM,\nONE OF THE OLDEST FARM SERVICE PROGRAMS IN THE AREA, IS HANDLED BY OuKE\nReonier. Featured on the program is the latest accurate information on\nFARM practices, market REPORTS, WORLD NEWS, NEWS OF UNIVERSITY EXTENSION\nACTIVITIES AND SUITABLE MUSICo\nFor You At Home is the title of a new program directed to the urban home¬\nmaker. This is another offering by the Home Fconomics department of the\nUniversity of Illinois. The program is handled by Jessie Hpathman, who\nis already well known to ''ILL listeners through her Homemakers Quarter\nHour heard regularly at 1*00 PM dai lYo For You At Home is heard at\n91OO A.m. and is immediately followed by Home Exercises at 9tl5 making\nthis half hour period OeVOTEO exclusively to service features for the\nhousewife.\nRADIO INSTITUTE tS CALLED OFF\nThe Institute for Education by Radio, held annually in Columbus, has been\ncalled ©ff for 1945, IT WAS announced January 17 by Dr. I. Keith Tyler\nOF Ohio State University^ the director.\nThe institute, which last year had an attendance of 1108, was scheduled\nfor ?<Uy 4-7. The cancellation, Or. Tyler said, is in cooperation vith\nTHE government’s REQUEST FOR SUCH ACTION TO RELIEVE TRANSPORTATION AND\nhotel CONGESTION.\nIt IS expected that Columbus meetings of several organizations usually\nHAVING sessions IN CONJUNCTION WITH THE INSTITUTE ALSO WILL BE CALLED OFF.\nThey include the Association for Education by Radio, the National Assoc¬\niation OF Radio Fafm Directors, the National Association of Women Dir^\nECTORS—an affiliate OF THE NATIONAL ASSOCIATION OF BROADCASTERS, THE\nJunior Tov-n.^v-eeting League, and the National Association of Equcational\nBroadcasters.\nTy'O activities of the institute, however, will be HELD as scheduled.\nOne is the judging of entries in the annual American Exhibition of\nRecordings of Educational Radio Programs and the other the decision on\nentries for the Edward Bernays Radio Ay'aro.\nAccording to Or. Tyler, the institute program committee is considering\nSOME substitute ACTIVITIES WHICH MAY INCLUDE CLOSED-CIRCUIT BROADCASTS\nTO MEMBERS IN VARIOUS PARTS OF THE COUNTRY.\nBROADCAST CONSTRUCTION IS FROZEN AGAIN\nThe FCC has announced a new ’’freeze” on broadcast construction which will\nALL BUT ELIMINATE ANY NEW CONSTRUCTIONS OR ANY IMOROVEMENTS IF THEY\nEXCEED AN EXPENDITURE OF MORE THAN $500.OC. ThIS IS NOT ONLY A FREEZE\nBROUGHT ON BY A SHORTAGE OF MATERIALS BUT ALSO A SHORTAGE OF MANPOWER."
}