{
  "id": "d1511-4",
  "text": "NAEB NEWS LETTER\nPaqs 5\nFebruary 1945\nOn Friday afternoon, January 26, I took leave of the IRF Convention and\nSPENT A MOST ENJOYABLE AFTERNOON AS THE GUEST OF WORRIE NoVIK AND HIS\nSTAFF AT WNYC. From the time I VAR GREETED BY THE CHARMING AND EFFICIENT\nWiss Davies till the time I took leave of the boys at the City Center,\n1 VAS constantly amazed AT THE SCOPE OF THE WNYC OPERATIONSo ThE STATION\ndidn’t grow to its present PROPORTIONS OVER NIGHT HOWEVER.\nWNYC, ”New York City’s Own Station”, entered the radio field, then hardly\nOUT of the experimental stage, in 1924. WNYC WAS SOMETHING NEV'—A MUN¬\nICIPALLY operated NON-COMMERCIAL radio STATION DESIGNED TO SERVE THE\nCULTURAL AND EDUCATIONAL NEEDS OF A CITY OF MANY MILLIONS. ThE CALL\nLETTERS CONY (C|TY Of J^EW YoRk) WERE ABANDONED IN FAVOR OF WNYC BECAUSE\nOF POSSIBLE CONFUSION WITH THE AMUSEMENT PARK GqnEY 1SLAND.\nA FEW HOURS BEFORE THE OPEN ING CEREMONIES TOOK PLACE, THE POROUS PANELING\nOF THE STUDIO WALLS AND CEILINGS WERE DECORATED WITH A COAT OF PAINT.\nThis made the formerly sound-proof studio a giant drumhead with all sorts\nOF vibrations. Too late to do anything but rip out the offending panels,\nChief Engineer Raymond Assersow suddenly saved the day by hastily hanging\nsome old potato burlaps around the studio. This however, made it un¬\nbearable CLOSE and stuffy—air CONDITIONING NOT HAVING BEEN PERFECTED\nAT that time.\nOutdoor ceremonies that opening night in 1924 were interrupted by a\nsudden torrential downpour that drenched gowns, high hats, and official\ncut-aways. The Fireman’s Bi^NO was rained out for the first time in its\nhistory.\nWJZ, four years old itself, sent a bouquet of roses to baby WNYC ON ITS\nopening night.\nMayor Hylan, attempting to predict the future, expressed his skepticism\nREGARDING RADIO BY SAYING THAT ”...RADIO WOULD RETRENCH RATHER THAN\nexpand.” Well, they said the automobile was only a passing fancy too.\nThe original WNYC reception room was decorated in Spanish Patio Style,\nWITH AN ELECTRICALLY LIGHTED FOUNTAIN SURROUNDED BY POTTED BAYONET\nPLANTS. These soon had to be .emoveo because they were being used as\nash receivers. Canaries in brilliant yellow cages \"chopped” or “rolled”\naccording to species to lend some vocal \"color” to the studios.\nThe infant station took a real step forward some years later with the\ninnovation of “The Masterwork Hour\"—a pioneer step—broadcasting a\nregularly scheduled daily full-hour recorded concert of outstanding\nsymphonic music.\nOn January 1, 1938, 'ANVC came of age vhen it started functioning as a\nseparate city department under the direct supervision of Mayor P. H\nLaGuaroia. Shortly afterward, M, S, Nqvik was appointed the station’s\nfirst director. Under the paternal wing of a culturally alert and music¬\nconscious executive like P. H, LaGuardia, he began to expand the VHNYC\nprograms and services to the millions of inhabitants of New York City\nand surrounding communities. Increased time devoted to fine music—\n“live” concerts direct from the many concert halls and outdoor SU 1 iER\nmusic centers—was an integral part of this growth. Recognition of"
}