{
  "id": "d1639-1",
  "text": "-2-\nthe full development of educational broadcasting, but it should not become\nengaged in the day-to-day operational activities and decision making\nfunctions that will inevitably be the requirement of networking. In essence\nDr. Killian does not believe that there should be a strong national\neducational broadcasting network development (a system which he feels would\nreduce local stations to affiliates and in which peoples' choices of\nprograms would be determined by fiat from a remote central point). NAEB\nand NET feel that regardless of the philosophical question some kind of a\nnetwork-like activity is inevitable - in fact, will be demanded by the\nstations - and when it comes into being it should not be a function of the\nCorporation, but rather some other agency or agencies to which the\nCorporation delegates management responsibility.\nOn the eve of the Executive Session by the Senate Sub-Committee, there were\nindications of an emerging schism in education's ranks on the matter.\nNAEB immediately took the initiative in contacting representatives of NET\nand the Carnegie Commission on ETV to clarify the situation. In\nconsequence, there were two quick meetings in Boston at which a number of\nmisunderstandings were cleared up and several areas of agreement determined*\nThe educational broadcasters agreed to go along with the removal of the\nprohibitive language so that the Corporation would have the option to\narrange directly with common carriers or through an intermediary. NAEB\ncounsel pointed out that since the Corporation controlled the money, it\nhad the ultimate responsibility for interconnection no matter whether it\ndelegated it to intermediaries or not*\nAt the same time, the Carnegie group agreed that in exercising this\nresponsibility the Corporation had a number of options open to it, including\nestablishing a new organization with representation from stations and\nprodram producers and that this new entity might be given the responsibility\nfor operating and managing interconnection facilities.\nNAEB agreed to associate itself with this position and at the same time\nenter into the record the view that, while the Corporation retained\nultimate responsibility for interconnection, it should exercise this\nresponsibility by delegating scheduling and programming functions for such\ninterconnection to an outside agency or agencies; moreover, the most ,\nappropriate way to do this would be to create some sort of an educational\nbroadcasting traffic agency in which the stations and producers participated\nAccordingly, NAEB, NET and Dr. Killian all wrote letters to Senator Pastore\nto supplement the record of the hearings of his Committee. The NET letter,\nreflecting a Board meeting following the Boston conferences, takes a more"
}