{
  "id": "d1410-4",
  "text": "paper covering technical details on this scanner which will be sent upon request.\nIf you wish further information on the DuMont line we*d suggest you write direct\nfor their catalog or their color planning packet which is also available.\nThe State University of Iowa is conducting a \"Short Course\" on color television\nto be held on April 1$ and 16, Attendance is expected to be around fifty, composed\nof chief engineers and production managers of nearby TV stations, TV repairmen, stu¬\ndents and faculty of the University, The announcement reached us last week, too\nlate for us to make plans to attend. Looks like an interesting and informative pro¬\ngram. Professor Edward M. Lonsdale of SUI*s E. E. Department is Chairman of the\nconference.\nWe*d like also to mention the General Precision Laboratory Model PB-610TV Pro¬\njection system which was demonstrated at the TV Engineering workshop last October.\nIt projects a picture up to 9 x 12 feet in size, is wheel mounted for mobility, and\nwas designed for group viewing in schools, hotels and industrial organizations. It\ncan be used either for closed circuit programming with studio or industrial cameras\nor for viewing \"off the air\" broadcasts by the use of the TV receiver incorporated\nin the unit. Systems of this type should be of great value to educational institu¬\ntions especially in medical or dental schools. The most minute details of surgical\noperations can be picked up on a TV camera and fed to almost unlimited numbers of\nviewers located in local or remote auditoriums. Industrial plants too can demon¬\nstrate complex machine shop operations to large groups of personnel concerned.\nFor more complete information,including price, write to General Precision Lab¬\noratory, Pleasantville, New York.\nWe had a recent request from M. McCabe Day, Director of the Audio-Visual Cen¬\nter, Station WVSH, Huntington, Indiana, asking for information to enable them to\nbuild a 2^0 watt amplifier for their 10 watt FM transmitter. Lacking this we told\nhim of two stations with 25>0 watt FM transmitters for sale. Perhaps one of our read¬\ners has the information he wants or has equipment for sale. If so, we*re sure he*d\nbe interested in hearing from you.\nMarch 8 and 9 we spent at the TV Laboratory, State University of Iowa at Iowa\nCity. We met the entire staff, observed their operation and reported these obser¬\nvations back to them. We hope that our recommendations and suggestions will prove\nof value to them.\nThey are conducting an experiment at the TV laboratory in Iowa City to study\nthe effectiveness of the discussion method of teaching when transmitted from one\nroom to others by means of television. Dean Dewey B. Stuit of the College of Lib¬\neral Arts is in general charge of the project and the class meets in the TV Studio.\nBut since we*re already late we*11 give all the details in the May Newsletter."
}