{
  "id": "d1410-6",
  "text": "-6-\nWhat W8 ar© attempting to do is to draw attention to th© fact that for small citiss\nlow power transmitters may be the answer for local coverage for educational and\ncommunity stations. We do not believe that adequate live picture quality can be\nobtained from present day vidicon cameras to compete with image orthicon camera\npictures. Consequently we do not recommend the entire \"package” for educational\nuse; -•Al number of: commercial stations have tried to use vidicon cameras for live\nstudio use but almost without exception have changed to image orthicons. Even\nthe Limestone, Maine AFTS station now uses image orthicon cameras for live pictures.\nHowever the use of a low power transmitter with a small and inexpensive tower may\ncut equipment costs in half and allow many more communities to have television ,\nservice. As this is written we have on hand brochures from the Dage Television\nDivision, Thompson Product Inc. which give complete equipment lists and prices\nfor low power TV stations for various types of operation. We also have a brochure,\nfrom Adler Communications Laboratories, New Rochelle, New York which describes.their\nline of low power television transmitting equipment listing many possible.combin¬\nations of equipment and prices. No doubt there are others in the field with simi¬\nlar equipment available.\n####***##*\nIn last month1s column we promised a more detailed account of the teaching experi¬\nment now being conducted in the TV Laboratory.*, State University of Iowa at Iowa\nCity. They are attempting to determine the effectiveness of the discussion method\nof teaching by using television transmission from one room to another.. The course\nmaterial is Political Science 304, Comparative Foreign Government's, which is\ntaught by Professors Kelso and Whitesel. The experiment is being directed by\nProfessor H. Clay Harshbarger and Dr. Sam Becker. Technical setup was arranged\nby Clarence D. Phillips and Robert Stumme.\nIn this study the members of one section or group will be situated around a table\nand will be taught by the discussion method. Students in another room will see.\nthe first group in action on a television screen and will listen to the discussion.\nIn addition the watching group will be able to communicate with the discussion\ngroup by means of an inter-communication system. The hypothesis is that the use\nof the inter-ccm system will keep the second group in a participant instead of\njust an observer role. The constituency of the two groups will be \"rotated\"\nduring the semester so every student will be a member of each group.\nThe study is concerned primarily with discovering what problems are involved i$\nthis type of teaching. It is believed, however, that television does possess in¬\nherent characteristics which will permit the use of the discussion method in teach¬\ning two or more groups simultaneously, yet preserve some of the unique features\nof the small group situation. There would seem to be little question that tele¬\nvision can be very effective when the lecture method of teaching is used; because\nthis simply involves the transmission of picture and sound to several different\nlocations - locations which may be only a few feet away or many miles away. .The\nstudy being undertaken at Iowa City is particularly significant in that it will\nattempt to study the use of television with the small-group-discussion situation\nbeing preserved.\nDuring the course of the semester, particular attention is being given to the pre¬\nparation of the most appropriate types of material, use of visual aids, methods"
}