{
  "id": "d1410-7",
  "text": "■7-\nof stimulating and guiding discussion and the discovery of the most effective\ncamera and microphone techniques. Student reaction to the experiment is very\nfavorable. Some lament,‘’Televising the group keeps us on our toes, we donft\ndare come to class without adequate preparation.“\nRCA has announced a new high quality, three speed turntable for radio and tele¬\nvision broadcasters, the Type 3Q-2A. It.is priced complete with cabinet at\n$398. All standard types of broadcast tone arm assemblies may be easily mounted\non the cabinet and, if desired, two tone arms for various types of pick-ups can\nbe accommodated. The new design has a simplified speed changing mechanism with\na minimum of moving parts with self compensating neoprene idlers.\nWe also recently received a new RCA catalog on Broadcast Test and Measuring\nEquipment for AM-FM and Television.\nApril was travel month at NAEB Headquarters. Bidlack spent April 4 and 5 at\nNela Park in Cleveland at a GE Lighting Conference. A more complete report on\nthis will come later when the papers presented are avilable. We tried to promote\ninvitations to this conference for all educational TV stations but have no way\nof knowing how successful we were. The conference was held in two sections\nApril 4 and 5 and the same program was repeated on April 6 and 7. At the April\n4 and 5 sessions, Carleton Musson and Robert Irwin of WKAR-TV were there, as\nwell as Albert Hrivnak and Thomas Martin of WBOE in Cleveland and Herbert Seitz\nof Indiana University. Other educational station representatives may have been\npresent at the Wednesday and Thursday sessions which we did not attend. Invi¬\ntations to this conference were issued thru the Lamp Sales District offices of\nGeneral Electric. If you didn’t receive an invitation to attend, you might\nask your GE lamp salesman about it.\nApril 6 and 7, your TV Engineer was in New York representing NAEB at the Film\nCouncil of America meeting. Dr. Skornia, NAEB Executive Diredtor spent the eve¬\nning of April 6 in Pittsburgh visiting WQED and at noon on April 7, he met the\nwriter at La Guardia and we attended the NAEB Region I meeting in Amherst, Mass¬\nachusetts. This meeting is covered elsewhere in the NEWSLETTER.\nOur paths parted in Amherst with Dr. Skornia going to Boston to visit WGBH-TV\nand Bidlack returning to Cleveland. On Monday, April 11, Bidlack visited W. B.\nLouis at WBOE and talked over their television plans. Monday evening Dr. Skornia\nand Bidlack reached Columbus for the Institute for Education by Radio-Television\nand Tuesday morning Harold Hill, NAEB Associate Director, and John Holt, NAEB\nNetwork Manager, arrived.\nOn Monday April 18 following the Institute, everyone was back at Headquarters but\nApril 20 and 21 Bidlack spent in Chicago at the SMPTE Convention returning to\nthe office Friday morning to pass Dr. Skornia and NAEB. President Frank Schooley\non their way to Chicago for a meeting with G. H. Griffiths of the Fund for Adult\nEducation."
}