{
  "id": "d1704-2",
  "text": "THE FBSS BILL\nSenator Simeon D. Fobs, of Ohio, introduced the hill in the Senate reserving\n15% of the channels for broadcasting. While it is not expected that it will he\npassed this session, your unreserved support will be required to secure passage of\nthe hill at a later session of Congress. Your own Senators should be informed,\nand asked to support it. A letter from the President of your institution will\ndo much to assist the support rapidly gathering in Congress for our work.\nANNUAL REPORT OF FEDERAL HAP TO COMMISSION\nAvailable from the Superintendent of Documents in 'Washington, D. C. for\nten cents, and contains all the General Orders of the Commission, Rules and\nProcedure, and a complete report of the work of this body up to December 1, 1950.\nEach member of your staff should have a copy.\nEDUCATION ON THE AIR\nThis is the title of a hook giving the proceedings of the Ohio State\nUniversity Institute of last Bujaaer. It is a volume of 400 pages and contains\nmuch inforrmition of value to educational stations, being the first publication\npresenting a complete picture and discussion of nearly every problem encountered\nin educational broadcasting. Cun he obtained from the Bureau of Educational\nResearch, Ohio St«te University, Columbus, Ohio, for three dollar®.\nSTATION PROGRAMS\nThe following is the list of programs received to date frfft golligg iiatleast\nPrinted monthly programs from KFKU, University of Chiot^O* WWltll, W1A0*\nTwo weeks printed program KSAC.\nThree months printed program WEAI.\nSemester printed program. University of Kentucky.\nWeekly mimeographed program WJfAD, WE AO.\nMonthly nirtieographed program WCAJ.\nTwo weeks printed program WDAY.\nASSOCIATION RECORDED FEDORAJJ\nA committee, eoneisting of Fe&ird, of wNaD, Jensen, of \"!0AJ, Wright* of WILL,\nand Eiggy* of WE AO, has been considering the possibility of a regular prorata for the\nAssociation to be bro&doait by a group of our stations. information Is needed as\nto where &moh programs e&tt be recorded at - reasonable prioo. Indications? are that\nthe cost will be prohibitive, exceeding tm hundred dollars per weekly half hour\nprogram* tour suggestions and ideas as to what might he properly included in sueh\na program will hi of value to the committee. Should speakers of national importance\nhe used or should the program be devoted to both speech and classical music?"
}