{
  "id": "d616-10",
  "text": "Mr, W. W. Early, Mgr,\nRecording and Record Sales\nRCA Manufacturing Co.\nCamden, N. J.\nDear Sir:\nThe plan you have proposed for licensing broadcasting\nstations to use your phonograph records vitally affects members\nof the National Association of Educational Broadcasters*\nhoped -fr ha 4MraMaggaaatwx^ workdddout. ——\"A\nThe fee of ten dollars per month which you set for non¬\ncommercial stations seems like very little, and to you it likely\nis. However, as we look at it in a practical way, we find that\nit takes on an entirely different aspect.\nMost of the educational stations operate on a limited-\ntime basis. Some are on the air but a few hours a week, ethers\noperate during the daytime, and only two or three are permitted\nto be on the air at night. In all there are but about twenty-\nfive stations in this non-commercial, educational class.\nThe operating budgets of these stations are very\nlimited. Practically nothing is allowed for buying program talent\nAppropriations for the biennium have been made and budgets set\naccordingly. In most cases it would be extremely difficult, if\nnot impossible, to get revisions.\nIf your company were the only one concerned the matter\nmight not be so serious; but at least three companies are likely\nto adopt the policy. Thirty dollars a month immediately becomes\nan item - more money than most of the stations have allowed each\nmonth to buy new records with.\nIt is acknowledged that you are not endeavoring to make\na profit on non-commercial stations for the use of your records.\nThe levy has been described as a \"bookkeeping charge\". With this\nbeing the case it can be assumed that you wish to reduce the\nbookkeeping to a minimum. »\nWhat jCsf&gE'to propose is that a non-commercial station\nbe permitted to use your records as in the past, upon filing\nwith you a sworn statement that it does not sell time and will\nnot use the discs for profit. The station would also give you\nthe guarantee that no record would be played more than once a\nday (your plan limits certain numbers to 2 playings a day),\nexcept where the playings are in relation to each othet as a\npart of a continuous program. (This would cover recorded themes\nand numbers which might need to be repeated, as a part of an\neducational sequence.)\nAnother consideration is that of announcing the trade-\nname of records. It is contrary to the established policies of\nthe public institutions operating the stations. It was this"
}