{
  "id": "d616-2",
  "text": "RCA MANUFACTURING COMRAWY,, 1M€\nA RADIO CORPORATION OF AMERICA SUBSIDIARY\n(Camden, dVew ^Jetseij\nmCA VICTOR\nD I V I S I ON\nJanuary 4, 1938.\nGentlemen:\nRecently there has \"been considerable litigation started by others\nin connection with the use of phonograph records for radio broadcast and\nother commercial purposes. As you probably know, RCA Manufacturing Company,\nInc. manufactures and markets phonograph records. We have from time to time\nbeen called upon to state our position with respect to such uses of records\nproduced by us. In order to avoid any possible confusion or misunderstanding,\nwe have thought it advisable at this time to restate our position in the\nmatter, which is as follows:\nAs manufacturer of Victor and Bluebird records we claim to have prop¬\nerty rights in phonograph records produced by us sufficient to entitle us\nto prohibit the use of said records for radio broadcast or other commercial\npurposes unless our prior written consent is obtained.\nOur Victor and Bluebird phonograph records are sold to the original\npurchasers under written agreements which expressly provide that they are to\nbe used only for non-commercial purposes on phonographs in homes and that they\nwill not be resold or used for any other purpose. Notice of our rights and\nof the existence of these agreements is given to third persons by appropriate\nlanguage printed on the label of each of our records, which notice is repeated\nin greater detail on the envelope in which each record is enclosed. Therefore,\nradio stations and others who may use our records for commercial purposes\nwithout our consent infringe our rights and knowingly become a party to and\nindeed the inducing cause of a breach of the agreements entered into between\nus and the original purchasers of our records.\nIn addition to the foregoing, because of the inherent similarity\nbetween the business of radio broadcasting and that of manufacturing and\nmarketing phonograph records, we believe that the action of radio stations\nin using Victor or Bluebird records for radio broadcast purposes without our\nconsent, contrary to the notice appearing on the records, and in the face of\nexpress notice of our rights, constitutes an unauthorized use of our product,\nan infringement of our property rights and unfair competition. Expecially is\nthis so in view of the fact that commercial transcription records licensed\nfor radio broadcast purposes are available from several sources.\nStandard and All-wave Radio Receivers • Radio Phonographs • Auto Radios • Farm Radios • Broadcast Station Transmitters, Microphones and Associated Equipment\nPhotophone Theatre Equipment • Victor and Bluebird Records • Electrical Transcriptions • Marine Radio Equipment • Transoceanic Radio Equipment • Aviation\nand Police Radio • U. S. Government Radio Equipment • Centralized Sound Systems • Public Address Systems • 16 MM. Sound Projectors and Cameras • Film\nRecorders • Eaboratory and Test Equipment • Standard and All-wave Antennae • Faradon Condensers • Individual and Component Radio Parts and Accessories"
}