{
  "id": "d616-4",
  "text": "Wtm MANUFACTURING COMPANY, IT^D\nMCA YICT©M\nD I V I S I ON\nRADIO CORPORATION OF AMERICA SUBSIDIARY\n('ZanuLzn, yVew fJezbe/^\nGentlemen:\nWe have received your recent reply to our registered letter of January 4, 1938\nsent to all broadcasting stations in the United States, in which we advised you\nof our position with respect to the unauthorized use of our Victor and Bluebird\nphonograph records for radio broadcast and other commercial purposes, and we\nassure you that it is not our desire to take any arbitrary or unreasonable posi¬\ntion in this important matter.\nOur letter was in a large measure prompted by a desire to caution you against the\nactivities of certain individuals or organizations which, we are informed, have\nrecently been offering for a substantial fee to license radio stations to use\nfor radio broadcast purposes phonograph records produced by us. This action does\nnot have our approval or consent and no such license can extend to you the right\nto use our records for broadcast purposes for, as pointed out in our letter of\nJanuary 4, we have not authorized any one to deal with our property rights in\nphonograph records produced by us or in our behalf to license the use of any of\nour phonograph records for radio broadcast or other commercial purposes.\nThere are pending several serious problems concerning the commercial use of phono¬\ngraph records -- problems which affect not only our company but every record manu¬\nfacturer, as well as their recording artists, the labor unions to which many of\nthe artists belong and the owners of the copyrighted material which is frequently\nrecorded on records. We are hopeful that all these problems can be solved in the\nvery near future in a manner which will permit radio stations to continue to use\nphonograph records upon some reasonable basis which will be satisfactory to all\nconcerned. We are working intensively on these problems and shall continue to\ndo so.\nMeantime, we desire to cooperate with you and to assist in meeting your temporary\nneeds. Therefore, we suggest that in the event you wish to continue to use over\nyour station phonograph records produced by us, upon receipt of the enclosed\napplication signed by you we shall be glad to extend to you our assurances that\nuntil further notice from us to the contrary, use by you of our records for radio\nbroadcast purposes will not be made the basis of any claim by us against your\nstation.\nVery truly yours,\nAss't Mgr. Recording and Record Sales\nStandard and All-wave Radio Receivers • Radio Phonographs • Auto Radios • Farm Radios • Broadcast Station Transmitters, Microphones and Associated Equipment\nPhotophone 'Theatre Equipment • Victor and Bluebird Records • Electrical Transcriptions • Marine Radio Equipment • Transoceanic Radio Equipment • Aviation\nand Police Radio • U. S. Government Radio Equiptnent • Centralized Sound Systems • Public Address Systems • l6 MM. Sound Projectors and Cameras • Film\nRecorders • Eaboratory and Test Equipment • Standard and All-wave Antennae • Faradon Condensers • Individual and Component Radio Parts and Accessories"
}