{
  "id": "d616-8",
  "text": "KC1A. MANUFACTURING COMPANY, IAC\nVICTOR\nD I V I S I ON\nRADIO CORPORATION OF AMERICA SUBSIDIARY\n155 EAST 24th STREET\nNEW YORK, N. Y.\nPHONE: BOgardus 4-6200\nApril 17, 1959.\nMr. Frank E. Schooley,\nThe National Association of Educational Broadcasters,\nUniversity of Illinois,\nUrbana, Illinois\nDear Mr. Schooley:\nWe appreciate your letter of the 15th inst. with\nregard to the processing and duplicating of instantaneous recordings.\nWe have already had some correspondence with Mr.\nJoseph Wright, Director of Public Information of the University of\nIllinois, with reference to some processing work which he contemplates\nneeding. We promised him that we would do this work for him and he,\nof course, has been furnished with our prices.\nUnfortunately, we would not at the moment like to\nopen up generally this offer to the National Association of Educational\nBroadcasters inasmuch as we are making some definite plans covering\nthis type of work and they will not be completed for a matter of three\nor four weeks. At that time, you may be sure that we will write you\nagain and, if our prices and the manner of handling have been decided\nupon, you will then be in a position to notify your members. This,\nhowever, does not affect the work which we contemplate doing for Mr.\nWright.\nThe approximate amount of time for a 10-inch 78 rpm\nrecording is three minutes, fifteen seconds; and for a IE-inch 78 rpm\nfour minutes, fifteen seconds. The margin necessary for observance in\nmaking the master should be not less than 5/16 of an inch and a maximum\nof 1/4.\nfbw/ah\nWe trust this information will be of some help to you.\nCordially yours.\nRCA MANUFACTURING COMPANY, INC.\nFrank B. Walker\nVic e-Pr e sident\nStandard and All-vsave Radio Receivers • Radio Phonographs • Auto Radios • Farm Radios • Broadcast Station Transmitters, Microphones and Associated Equipment\nPhotophone Theatre Equipment • Victor and Bluebird Records • Electrical Transcriptions • Marine Radio Equipment • Transoceanic Radio Equipment • Aviation\nand Police Radio • U. S. Government Radio Equipment • Centralized Sound Systems • Public Address Systems • 16 MM. Sound Projectors and Cameras • Film\nRecorders • Laboratory and Test Equipment • Standard and All-voave Antennae • Faradon Condensers • Individual and Component Radio Parts and Accessories"
}