{
  "id": "d1145-1",
  "text": "N/uLB NE'.V3 LETTER.,. . .NO?. 1, 1940..... Page 3\ninMTITUTE FOR EDUCATION BY KaDIP\nThe Twelfth Institute for Education by Radio, the national con-\nranee of broadcasters and educators, meeting under the auspices\no“ Ohio State University, will be hell at the Oeshier-piallick Hotel,\nMM ur-bus, Ohio, Monday through Wednesday, .ay 5-7, 1941, it has been\nannounced by Professor H. 17. Charters, Director of the Institute.\nMae Fifth /American Exhibition of Radio Programs will also be held\ninoonj m wi fa bhe Institute, sific tlons will\nsame as last year. Specifications and entry blanks will be available\nJanuary 1; closin date for entries will be March 15, Address\ncommunications to I. Keith Tyler, Ohio State University,\nFFC ACTIONS\nYO was ranted special authority to operate an extra 15-minutes\nweekdays between October 4 and IS (10/7/40)\nW03U was granted permission to operate special time in order to\ncarry the inauguration ceremonies of President Howard K. Bevis of\nOhio State University. (10/15/40)\n•-••ml was granted modification of licei.se authorising deletion of\nfreauenoy 15*250 and addition of 15,350 and 17,750 kc. Same for\nWRU’7. (10/15/40)\n■7NAD was granted authority to operate limited time periods in order\nto give special period to K3GF for special broadcasts, (10/16/40)\n’TEAR was granted special authority to operate late on October 16\nin order to conclude Michigan State-Temole football game account.\n(10/16/40)\ngranted authority to oj i\nlate schedule, October 19. (10/16/40)\niven permission to operate; nr; eur . Mr hour Mu ring\nft of Octobej in older to carry see;\n(10/22/40)\nJCFDT was granted permission to operate a ft e mo.•; b*u7 * uu ; '* s’\nand Movemoex 1 in*order to carry football games* (10/23/40)\na given permission to one rate afternoon hours on October 26\nand 27. (10/23/40)\nWBAA was granted a motion permit to increase power to. 5 ZWt\nincrease hours of operation, move transmitter and install directions\nantenna. (10/23/40)\nTfHUL was given license to.cover cone ruction permit for increase in\npower and equipment changes. (10/25/40)"
}