{
  "id": "d1145-4",
  "text": "NAEB News Letter\nMarch 1, 1939\nPage 5\nREPORT OF THE HBG TO THE NASU\nThe above is to attract your attention. There are certain portions of\nthe report of the Radio Broadcasting Committee to the National\nAssociation of State Universities, which should be of particular interest\nto NAEB members. The excerpts of the report, presented by President\nA, G, Crane of the University of Wyoming, followss\n»»PROGRESS — Great progress has been made during the past year in the\nbroadcasting programs of the universities in this Association, All in all\nit has been one of the most favorable years in the actual growth of\neducational broadcasting, and particularly in the development of working\norganization. The production of programs is being studied and attacked\nwith a fuller realization of the magnitude and importance of the task.\n11 COOPERATIVE ORGANIZATIONS — It is Indeed remarkable and heartening to\nnote the spread of organization for the cooperative production of programs\nThe wide adoption of the principle of cooperation shows that the soundness\nof this principle is gaining wider and wider acceptance. Cooperation\nbetween institutions, between great public agencies, cooperation in\nfaculties through advisory committees and councils, are examples of\ncooperating between producers of broadcasts. There are also additional\ngains in cooperation with commercial broadcasting stations, A deliberate\neffort to create machinery for cooperation also implies a keener realiz~\nation of the Importance of the program itself. Cooperatively a group of\nindividuals or institutions will have greater selective power and a larger\nreservoir of talented broadcasters and will make possible a division of\nthe work of production,w\nMThe following is a summary of information secured from the institutions\nconstituting the National Association of State Universities. The\ninformation was secured in reply to recent inquiries. It Includes only\nthose institutions that have a sizeable program of broadcasting.\nInstitutions omitted are either those from which no report has been reoel^l\nor ones doing very little broadcasting,\n“Florida, The most significant development of the past year has been\nthaT'oF'the Florida Hadio Service Council. In an effort to organize the\nsupport of education by radio. President John J. Tlgert of the University\nsuggested to a number of state civic bodies that they form a group ®\nexpress this support of educational broadcasting, and to unite the various\ninterests desiring to encourage such work. More than a\nresponded, and a constructive program of work Is firmly established and\ncentered around the support of the University's own radio department and\nIts radio station WRUF. The program of the Council calls for an effort\nto bring together the various commercial, cultural, fraternal and social\nInterests of the state In a united front to accomplish the purposes formally\nadopted.\n“Illinois. In its radio work this year .the University of Illinois has\ntaken two significant steps; (1) A standing \"Radio Advisory Committee,\"\ncomposed of seven prominent members of the faculty, was appointed to stuc^sr\nthe programs being offered to determine how they could be Improved education\nally. This committee has arrived at certain definite conclusions ahd\nhas made suggestions to the President concerning future development of"
}