{
  "id": "d1369-1",
  "text": "100 Register for NAEB Conference\nAs we go to press, nearly 100 registrations have been received\nfor the NAEB conference, Improvement of Instruction by\nTelevision and Radio, to be at the University of Illinois May\n13-15. A full schedule of speakers and demonstrations of radio\nand TV instructional programs has been planned.\nU. of Wichita Holds ETV Seminar\nCharles A. Siepmann, chairman of the Department of Com¬\nmunications in Education at New York University, will be\nthe featured speaker at a special seminar on ETV at the\nUniversity of Wichita May 17 and 18. He will deliver a formal\naddress the evening of May 17 and then the following morn¬\ning he will have a special question-and-answer session. Admis¬\nsion is free. For information, write: Director of TV, Uni¬\nversity of Wichita, Wichita 8, Kansas.\nNational Observances Announced\nApril 28-May 4. Mental Health Week. Theme: National\nRally Against Mental Illness. Leaflets telling how or¬\nganizations may participate available from the National\nAssociation for Mental Health, Inc., 10 Columbus Circle,\nNew York 19.\nMay 18. Armed Forces Day. Detailed information available\nfrom the Office of the Assistant Secretary of Defense,\nWashington 25, D. C.\nJuly 4. Proposed celebration: spontaneous nationwide ringing\nof bells in all cities and villages. April 14 This Week\nMagazine to carry story telling of plans to date. Idea pro¬\nposed by two readers of that publication, as outlined in\nFebruary 17 issue.\nRegion II Meeting Attracts 200\nFurther development of educational radio, the challenge to\nETV, and the future of the NAEB were emphasized by\nguest speakers at the NAEB Region II conference in Tampa\nMarch 29-30. About 200 persons attended the meeting, which\nwas hosted by Tampa’s ETV station, WEDU.\n• Richard B. Hull, chairman of the NAEB Board, told\nmembers that radio is the simplest, cheapest, and sometimes\nthe most effective of all tools. He declared that the use of\nradio by only one person increases the concentration given to\nit. It is in this instance, he added, that radio comes closer to\nreading or a teaching machine than any other media. Radio is\nthus better able to serve the individual. He continued that it\nhas been found that in courses that are mainly lecture, offered\non television, the video portion offers very 'little to the stu¬\ndent. He cited the success by other countries that rely pri¬\nmarily on radio to reach the people, and pointed out that\nradio has been a single factor in combating ignorance and\nilliteracy in Central America.\n• Banquet speaker John T. Caldwell, chancellor of North\nCarolina State College, envisioned the challenge to ETV as\nno less than the challenge to education. He stated that the\nspecific challenge to educational television is to develop de¬\nmonstrable improvements in the educational process itself. The\nnew technology of our days includes the process of expanding\nknowledge, he said, and technology permits us to store and\nretrieve knowledge. Dr. Caldwell said that we should im¬\nprove our capacity to transmit knowledge. “We often forget\nthat the 'learner is the key,” he said. “The psychology of\nlearning is the basis on which we transmit knowledge. The\nprincipal attribute (of television) is the breaking of distance.\nThe value of ETV can be considered in the light of its im¬\nprovement of the effectiveness of teaching, the improvement\nof college campuses, and the improvement of craftsmanship of\nteaching as an aid to learning.” He noted that institutional\nresistances to changes on campuses are great. “We resist\nchange because we are status imitators.” Also there is the\nresistance of the individual scholar, and on many campuses,\nhe said, there is very little acknowledgment of any better\nway of teaching.\n• NAEB President William G. Harley told conferees of\n.NAEB’s current activities and future projects. He said there\nare new kinds of people to be served, mentioning educational\nresearch and social psychology fields and personnel as exam¬\nples. He said institutions must pull together their differences.\nHe then touched upon a proposed reorganization of NAEB\nto get maximum involvement of individuals. (This proposal\nis still in the drafting stage and has been presented to other\nNAEB groups.)\n• Gerard Appy, Region II TV Director, announced that the\n1964 regional meeting will be in Columbia, South Carolina, to\nbe hosted by the ETV Center. Graydon Ausmus, University\nof Alabama; Hugh deSamper, Williamsburg, Virginia; and\nHolt Riddleberger, WEDU, Tampa, will serve as an advisory\ncommittee for that meeting, Appy said. He also announced\nmembers of a committee to select the site for the 1965 re¬\ngional meeting: Edward Herp, Florida State University;\nHoward Holst, Memphis; and John Young, University of\nNorth Carolina.\nRadio Notes from Region II Meeting\n—by O. Leonard Press\n• Mr. Andreas Pot, touring educational radio stations in this\ncountry for Radio Nederland, sat with us throughout a long\nday of talk and, when pressed, was good enough to make some-\nexcellent observations from a perspective none of us can\neasily attain. It was his comment that we are overly pessimis¬\ntic about the quality of what we do and its worth. He did\nsay, though, that the fifteen stations he has visited in this\ncountry are operated rather inadequately, especially in pro¬\ngrams of news background, radio drama, and faculty talent.\nHe suggested that a great void we could well fill is in news\nand commentary, since it was his view that world news is\ninsufficiently covered in our commercial press.\n• A general discussion revealed that a large majority of sta¬\ntions do very little local production, but depend upon the\nNAEB and other sources for programs. NAEB Vice Presi¬\ndent suggested that each station manager look long and re¬\nflectively at the many opportunities he has of interpreting\nthe local community through local programs.\n• We solved no major problems but we discussed them all\nat varying lengths—directions, purpose, attitude of station\nmanagers toward their stations’ importance in the face of TV,\ngetting a better share of funds in institutions where TV is\nfinanced on the same budget, the NAEB’s role in promoting\nbetter radio station financing. Some time was devoted to spe¬\ncific problems of station representatives in attendance, and I\nthink in that area some value may have been realized by those\nwith questions.\n• A good deal of discussion was given to the proposed Madi¬\nson seminar. A vote showed that eight of the approximately\nfifteen station representatives attending were at least 50%\ncertain of attending such a meeting in Madison in July or\nAugust. There was a certain amount of enthusiasm for such\na meeting, tempered with concern over the agenda. The feel¬\ning was that it ought to be well planned with papers prepared\nbeforehand and a publication to come out of it.\n• An informal vote indicated that 90% of those in attendance\nwould be willing to contribute as much as $300 in increased\ndues so that NAEB could provide a comprehensive national\nservice for radio—i.e., personnel to work on improved na¬\ntional programing and on improving and selling a positive\nimage of educational radio to ourselves, to our administra¬\ntions, and to the public at large. It was pointed out, however,\nthat while the money might be available, budgeting it would\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 119 Gregory Hall,\nUrbana, Hi. $5.00 a year, $7.50 including Washington Rteport.\nEditor: Betty McKenzie. Phone 333-0580. Area Code 217. Report¬\ners: Region I—Michael Ambrosino, Ruane Hill; Region II—Shirley\nFord, Lou Peneguy; Region III—McCabe Day; Region IV—Richard\nVogl.\n2\nNEWSLETTER"
}