{
  "id": "d1459-10",
  "text": "This year's the first time we've condescended to platter\nor ET deals like this. However, with more outlets, it seems to\nwork. The principal other ET series we've secured, placed and\nsponsored, is one on conservation: fires, forests and the like.\n&\n& * #\nWOULD YOU MIND ANSWERING- A FEW-?\nDoc's probably the most curious radio man in the country.\nHe hates to tell classes anything as facts that maybe aren't.\nLest year, in his pursuit of facts: three surveys. This\nyear: already four! He sits up nights checking and recheckmg\nthem. Here they are:\n1. With George Willeford., PG-, who hones to use the findings\nfor the start of a Thesis in Speech, a survey of budgets,\npersonnel, space, equipment, -nd operation of all the\neducational stations in the United States.\n2. Another survey of personnel, policies, salaries, training\nrequirements, openings expected., of everybody in all the\ncommercial stations of Indiana — over forty of them.\nThis heIns find students jobs, and what the station .\nmanagers say sets them un as a sort of unofficial advisory\ncommittee to be sure I. U.'s Radio training program is\npractical and gets down to brass tacks. Incidentally new\ncourses in News Broadcasting, Radio Advertising, etc.,\netc. are being added.\n3. A survey of listening over the Christmas holidays, in the\nhome town of each student (other than Bloomington and\nIndianaoolis) around the country.\n4. A survey of Indianapolis listening, like number 5 below.\n5. A survey of Bloomington listeners.\nWhat's new about these listener surveys, we think, is that\nthey begin to get at qualitative as well as quantitative infor¬\nmation. Listeners were asked twelve questions. They did answer\nthem all, in most cases, even over the ohone, in case rou're sure\nwe couldn't get away with it. They Included, questions on occu¬\npation, car radios, FM receivers, whether they thought radio was\ngetting better or worse (this was interesting when correlated with\nthe programs they were listening to at the time called), what tney\nthought^of the program being listened to, what they like most and\ndislike most about radio, how many were listening, etc. Persons\nwith radios on but who were not really listening were also.sepa¬\nrately listed, since we think if a person has to “go see' it\ndoesn't prove much listener significance or concentration.\n(continued, on next page)\n-11-"
}