{
  "id": "d1459-2",
  "text": "SPEECH PROBLEMS\nWe t>oint with pride to our PROBLEMS IT? EVERYDAY SPEECH broad¬\ncasts which are done every Sunday morning at 11:30 over WHAS,\nLouisville, which has been giving us free time and paying half\nour line charges since 1938 in case you wonder whether the Univer¬\nsity has any real friends around.. PROBLEMS IN EVERYDAY SPEECH is\na series of programs devoted to the understanding of voice,\npersonality and adjustment problems related to speech.\nThere1re 26 broadcasts in the series, covering such subjects\nas cleft-oalate speech, stuttering, aphasia, dialects, foreign\ns-oeech and so forth. Along with the broadcasts, there is^ a\n28-page discussion manual, replete with hints and. ideas what to do\nbefore, while and after listening, suggested films and readings,\netc. There has been considerable demand for these Manuals (which\nWHAS distributes on request for us), and many letters come in\nfrom sincere and. worried parents wishing advice from our Speech.\nClinics. The scripts are semi-dramatic in form but once in awhile\nthere1re panel discussions with speech experts taking part, talks,\nuse of frequency records to demonstrate heading d.efects, and. so\non.\nMary Clare Regan and Phyllis D. Weidig wrote all the scripts\nas a project in Radio Seminar under Doc Skornia, with the cooper¬\nation of Dr. Robert Milisen. Doc says some of them were written\nand corrected and rewritten four or five times before he got just\nwhat he wanted. Dr. Milisen is director of the Indiana University\nSpeech Clinic, one of the finest in the nation.\nft ft ft\nft\nREPEAT\nYou* ve heard us talk about FROM FREEDOM’S FORGE before. That\nwas the Indiana Presents series which got all the fine comments\nlast year. Well, we're doing 11FFF\" again — every Wednesday night\nat 7:00 over WIBC, Indianapolis. Bob Lee still directs,and he's\nat the point now xvhere he almost remembers every cue by heart. It\nwas Bob, too, along with Fred Brewer, who wrote all the shows —\nhistorical stuff in a whiz-bang fashion. Dan Sherwood, of the\nI. U. English Department, still narrates.\n■ft * ft ft ft\nIN THIS CORNER\nJule Shaw, post graduate, is still directing THE CHILDREN'S\nCORNER every Saturday * morning at 9^00 to 9*15 over WIRE, Indian¬\napolis. Kiddies in WIRE'S range still get the same big bang.out\nof the -program, too, with Miss Peggy Singer, senior, of SapPington,\nMo., as the Story Lady, counting her fan mail.\n-3-"
}