{
  "id": "d1459-6",
  "text": "your fingers, and Miss Kelley has the xvarm, friendly quality\nnecessary to make the children listeners believe she's standing\nright next to them.\nThe Indiana Department of Education has given us all hinds\nof cooperation. They're the folks who published, the Teacher's\nManual for us....and. see to its distribution. It has 103 pages,\nshould you like to know. Over 2,000 copies have been distributed\nto teachers using our broadcasts.\nAs we've said before, the programs aren't haphazard things.\nEach week's broadcasts are all done up in a neat package. For\ninstance, if Mister Bill is up in Alaska telling the kiddies about\nthe salmon fisheries, you can bet your boots that the same week\nMister Andy will be■talking about the migratory habits of salmon —\njust like that. We think it gives a SCHOOL OF THE SKY a smooth\nfinish. We hope you think so, too.\nThis isn't all we've to say about the SCHOOL OF THE SKY,\nthough. Johnson is busy — has been since early in January —\nplanning a continuation of the SCHOOL OF THE SKY through\n1948-1949. This new series will have two programs for high\nschool children: in guidance and science. Three elementary\nshows probably will be in the fields of music, social studies\nand stories. With another Manual for teachers and. music books\nfor the youngsters, we have our aspirin tablets stocked up for the\nnew SCHOOL OF THE SKY opening date — September 2?, 1948.\n* # # * *\nAROUND THE ROUNDTABLE\nIt wouldn't be the Radio Department without the I. U.\nROUNDTABLE. And we're back at our same post again at 10:00\nevery Sunday morning on WIRE, Indianapolis, who has given us\nprobably $80,000,00 worth of time and line charges during the\noast ten years they've been carrying this and other programs.\nRobert Lee, as usual, moderatesf\nWe began our new series last year, on the 5th of October,\nif you'd like the date as an anniversary to note. Before this,\nour ROUNDTABLES had been complete in each one-half hour broadcast.\nBut we've something new on the ROUNDTABLE, now. It usually takes\nthree broadcasts to cover an issue. This, we feel, lets the\nparticipants investigate and. present their topic more fully than\npossible on one program.\nFurthermore, each bracket of discussions has two permanent\ndiscussion panel members, with a third in as a guest each week.\nThis gives the program more variety, too, but allows the listener\nto follow a pretty smooth pattern of thought throughout the\ndiscussion series,\n(continued on next page)\n-7-"
}