{
  "id": "d1458-11",
  "text": "o\nWe now know a lot of stuff like:\n59^ of all Bloomingtonians with phones have more than one\nhome radio.\n30$ have car radios.\n5.4$ have FM receivers in working order.\n2.02 persons, on an average, were listening.\n29# of radios were on, between 8:00 a.m. and 10:00 n.m.\n66.1# think radio is getting better.\n11.5% think it’s getting worse.\n22.4# think it’s staying the same.\n17.3$ of the listeners didn't know what program they were\nlistening to.\n20.8# didn1t know the station.\n7.2# didn't know either the station or the urogram they\nwere listening to.\nWe also know the most nodular urograms and urogram tyues by\noccupations. Incidentally uouular music and news seem to be\nfavorites of most, not comedy or variety urograms as we d thought.\nCommercials, static and soap oueras seem the three tou griues.\nThe home towns surveyed are too numerous to list here, but\nit gives an interesting comuarison for big towns versus small\ntowns, towns with, versus without, stations, Indians versus\nnon-Indiana listening, etc. The whole compilation of taoles\nmakes quite a book. If you can't live without it, let us know,\nand we'll see what we can do.\n•k * -m- #\n*\nHELP,* PLEASEi\nAs a sort of clearing house for this year, here again is\nthe list of former I. U. people in radio and. where we think you\nnow are. We know there are at least as many more that we don t\nhave addresses for. In order that we may be of more mutual help\nto each other, would you, now, before you forget it, tell us of\nany omissions or corrections you knoxv of, inciud.ing friends^ of\nyours, your own titles and. addresses? Send it on the attached\nnostcard, addressed to the Radio Deuartment at I.U.\nWith a little help from you — and ulease give us a lift\nwe can, in another month or two get out another NEWSLETTER devoted\nto an exchange of nexvs about you — your latest shows, exner-\niences, who's moved and. where to, marital and family developments,\netc. How about it?\nFor addresses, see next uage.\n-12-"
}