{
  "id": "d686-102",
  "text": "Senator Edwin C« Johnson\nJune 19, 1950\n« 2 -\nThe fact remains with AM frequencies in a confused and cluttered\nstatus, not only domestically, but internationally, PM on a long-time\nprojection remains a logical and satisfactory method of serving the\naudio listener* PM communication, if for no other reason, should be\nestablished and protected as a defense measure in the event of a\nfuture conflict. Obviously, for air-defense reasons, AM radio will\nin large part be shut down in the event of bombing attacks on the\ndomestic United States. PM could insure continued audio service.\nHow with TV the fastest growing, most glamorous medium of\ncommunication yet devised, and public acceptance a matter of dramatic\nrecord, there exists an opportunity, before the freeze is lifted, to\nmake the TV medium doubly effective by adding PM tuner units and\nthus to insure and establish a double service—both sound and sight—\nfor every TV purchaser at a fractional additional cost.\nSuch a move on the part of TV manufacturers would insure\nmillions of PM receiving units which could be used when TV service\nwas off the air (mornings, afternoons, etc.) or when the viewer had\nwearied of the TV program.\nSuch a move on the part of TV manufacturers would encourage\nadvertisers, PM sot purchasers, and broadcasters to continue develop¬\nment toward a basically logical audio service in the future.\nMany prospective TV licensees could select antennae sites,\nbuild towers, and install PM service—and subsequently use the same\ntower and location for the addition of TV. In a very real sense,\nbuilding an adequate FM installation is step number one in establish¬\ning a TV station.\nAnd, again, in the event of war, there would be a sufficient\nnumber of PM receivers as a result of this move, which would b©\nready and waiting to receive vital communications when AM radio was\noff the air and TV service was stopped or limited.\nThe national Association of Broadcasters believes in the future\nof PM radio. Proportionately, more college and university and\nschool licensees have taken advantage of the PCC FM allocation plan\nto build their own stations tha& has been the case in commercial\nradio. As of February 1, 1950, there was a total of ?!{. FM non¬\ncommercial station authorizations, and many more pending.\nThere has been a different attitude toward PM which we neither\nappreciate nor understand. It Is difficult to understand, for\nInstance, why a manufacturer who makes PM transmitters and TV\nreceivers will fail to include an FM tuner in his TV set when it\ncan be done for from $2.00 to $3.00 per unit.\nFurthermore, you are aware that the U.S. Bureau of the Census,\ndespite pressure from all sides, would not include an FM ownership"
}