{
  "id": "d686-11",
  "text": "January 17, 195>1\nMr. Seymour Siegel\nRadio Station Y7NYC\nMunicipal Broadcasting System\nNew York, N. Y.\nDear Sy:\nI have your last several letters before me and shall try to\nanswer at one tine the several points you raised.\nIn regard to the Radio and Television Bibliography, copies\nwere mailed to all people receiving the June-July issue of the News-\nLetter. Furthermore, on page 19 of that issue reference was macfe to\nthis fact and additional single copies of the bibliography were of¬\nfered at 204 each. Apparently some members didn*t receive their\ncopies due to errors in mailing, but a good many members did receive\nthem since I received comments on the bibliography from a number of\npeople on the nailing list.\nAs to the addressograpfa plates, I will tiy to have them prepared\nin time for the next News-Letter mailing. It will cost somewhere in\nthe neighborhood of fl6.0C) to set up the addressograph plates and\nabout $1.£0 each time thereafter to run off the envelopes.\nYou also asked me about having the News-Letter printed. This,\nI am afraid, is out of the question for financial reasons: the Uni¬\nversity of Minnesota print shop, which does such work at somewhat less\nthan current commercial rates in Minneapolis, would charge $10.00 to\nset up in type the material on a typical News-Letter page. Since the\nNews-Letter runs to about 2$ pages for each issue, the type-setting\nFill alone would be $2£0 per issue, in addition to which there would\nbe the cost of stock and labor for the actual printing. Since it now\ncosts me something less than $5>0 per issue, including all costs, I\ndon*t see how we could afford such an outlay.\nBy this time you—and all members of the board of directors—\nshould have received the minutes of our Washington meeting. I am\ngenuinely sorry about the delay in getting this out and will try to\ndo better next time.\nAs to the list of active and associate members and accompanying\nvital statistics, I will get in touch with Dallas Snythe to see what\nkind of questionnaire we can dope up."
}