{
  "id": "d686-12",
  "text": "Mr, Seymour Siegel\n-2—\nJanuary 17* 1951\nI wrote to Jerry Fran ken as soon as I heard from him about the omission\nof The Billboard from ray bibliography. I explained that I didn't cover much\nmaterial in any trade magazine—including Billboard, Variety and Broadcasting—\nfor two reasons: First, because the various periodical guides from which 1 got\nmost of my bibliographic entries list little or no material from those magazines;\nand second, because the people who use such a bibliography probably are aware of\nthese magazines, anyway. It is true that the bibliography mentions Variety and\nBroadcasting occasionally, and Billboard not at all, but this is because a few\nentries from those magazines are given in the Guides to Periodical Literature\npublished by the H.W. Wilson Company. It was simply out of the question for me\nto make a personal survey of all the magazines published in order to select\nradio articles.\nI am enclosing a postal card from Theodore Kain from St. Paul in which he\nsays we are using an old out-of-date list for our educational television fund re¬\nquest. I don't know how true this is, but I thought I would send along Mr. Kain's\ncard to you.\nI talked with Stuart Haydon on the telephone Sunday about testifying before\nthe Commission next week. I wired Stuart yesterday that it would be okay and that\nI would be available for consultation in Washington January 20th in preparation\nfor an appearance on the 22nd, 23rd, or 2l*th. I will do my best for the cause l\nBefore signing off may I suggest two things about the next News-Letterl\nFirst, I should have your President's Page as soon as possible—if not sooner.\nSecond, since Dick Hull's man bowed out as editor of the FCC action section, I\nam looking for somebody to put together this part of the publication each month,\nyou have any suggestions?\nIncidentally, for some very strange reason, during the past month I have\nreceived almost no news from members excepting that included in the WHIG releases,\nand one or two special mailings from members who had particular stories to tell\nor request to make. This surprises me no end. Are NAEB members bashful about\ntelling the world and each other how good they are?\nCongratulations on the good coverage in Time and the Saturday Review of\nLiterature relative to your own work, NAEB, and\"i3ucational WT~Tl Is good to\nknow that our new president is in there pitching—and getting such excellent\nresults1\nOn page 2 of the minutes of our meeting in Washington in December, I\nincluded the following two paragraphs:\n\"Vote 5 to 1 in favor of dispensing with the office of Executive\nSecretary now held by Morris Novik, and instructed the- Secretary\nto so inform Mr. Novik.\"\n\"The president appointed an Advisory Committee to tte Board of\nDirectors as follows: Georg© Probst, chairman; Robert Hudson;\nMorris Novik; William Sener; Parker Wheatly. The Secretary\nwas instructed to inform the members of their appointment to\nthis committee.\""
}