{
  "id": "d686-123",
  "text": "As a basis for discussion therefore* I make the following proposals as to\nwhat topics such a session might cover®\n(a) The whole subject of foundation support for educational radio and\ntelevision activities could be reviewed® Within the last twelve months the\nFund for Adult Education of the Ford Foundation has given $260oQ00 to Iowa State\nCollege for an experimental television project* $90*000 to the Joint Committee\n#\non Educational Television* $300*000 to NAEB for a radio programming project*\nand $25*000 for television monitoring studies® The Kellogg Foundation has\ngiven $215*000 to NAEB to support some of its work® The Ford Foundation also\nhas set up a general radio and television industry workshop to which it has\nassigned over $1*000*000®\nThese grants of about $2*000*000 demonstrate great faith on the part of\nthe Ford and Kellogg Foundations in the educational potentialities of radio\nand television® It seems to me that we should get some qualified person (per¬\nhaps Bob Hudson of the FAE?) to review these developments* and to tell the\nconvention the why* how* and wherefore of all of this®\n(b) Less spectacular* but still very important* are two other recent trends®\nThe first of these—like the foundation grants—first came up during the past\nyear® The FCC tentatively reserved 209 TV channels for educational use® The\nfinal decision on this matter has not yet been taken—although it probably will\nbe made before April—but it seems almost certain that some 200 channels wil?\nbe reserved for educational television. This suggests another area for dis¬\ncussion: what principles underlay the reservations5 to what use can educational\ntelevision be put* how much does such a station cost3 and how does an institution\nor a group of institutions set up such a station?\n(c) My final suggestion pertains to television courses given for credit0\nHere is another relatively new development of great interest to MJEA members®\nThe University of Michigan and others have done a good job here3 many of the\nMJEA conventioners may wish to spare their experiences®"
}