{
  "id": "d686-138",
  "text": "University of Minnesota\nGeneral Extension Division\nMinneapolis 14\nRadio Station KUOM\n770 ON YOUR DIAL\nDecember 27, I9$l\nMr. tlchard cider\nManager, MALE! Tape tietwor\n119 Gregory iiaLl\nUniversity of Illinois\nUrbans, Illinois\nbear bisks\nX hanks\ndOp\n<7\nI\non station 60\na lot for distributing the publicity build dp/on dtatlo\nto .members of the lap© Zratwork. X Stt,,H**tybu send a copy of fyis to ayo\nHinton at m)I since he is our contact Dhayon. \\ \\\nFleas© let me know as quiekXjr aid you can p’h&t Ust pt&j&tm acceptance is\nun ^U’tioa 60, and if tine is of the essence send a carbon of your letter to ns\noiroct to bisnoa. -^ \\ \\ / /\n^ x x \\ *-x\nbton o^t point'* Should we at KU$i proceed\n\\f«r January through dune service\n■«r are you going to bill us\nfirst sent out notice on\nmake payment now or await\nisBrifediateiy to pay\non the basis dote;\nfor that later err7 \\ X\nthis and m\nfurther word ^rom you,\nJl fisv© Sy SifcgeUs vbfettyryto you of Imceu&er 21 relative to Tape\nnetwork 4p«r| uion&l problei»»—«6t knowing as much of the background as you\ndo, ny .. nufciks may nop.be very helpful but X am sending them along for\nwhatever \\thfiy\\pay be\n4^st 62~~a^f, let me s&„ that X do not snare win t is ^ arently\nyours and Ui^r-eeticem over taking shows free i\"Ji or other Federal agencies.\nX have not read any letters that you and dim nay have written to by on this\nsubject, so i may be misinformed as to what your position really is; however,\ninsofar as 1 understand the point on which you differ X would say that\nparagraph 3> on pegs 2 of Gy»s letter expresses say conviction in the matter.\nIf, of course, thin s progressed to the point where the NJ&B Tape\nMetwork offerings consisted principally of government programs X should be\nsomewhat alarmed, but X do not think that situation is apt to develop,\nUn the matter of package distribution X again am without benefit\nof a full presentation of your point of view, .iowtvor, X shewed jy'e letter\nto Audrey dune booth, the you*t, lady at £UtM who is in charge of receiving,\nscheduling, and forwarding all BABE tapes, and asked her to provide m with\na comment on the procedure which 1 could forward to you, X m enclosing a"
}