{
  "id": "d686-2",
  "text": "January H, 1951\nMr. Seymour Siegel\nRadio Station WHIG\nMunicipal Broadcasting System\nMunicipal Building\nNew York City, Hew York\nDear Si:\nI had just written you a letter this morning but decided to\ncall instead* This is a follow-up*\nI enjoyed chatting with you and I am still a little breathless\nat the speed with which you are moving things along* If I may use\na mild mild phrase, you are terrific. The deal that Dallas is\nworking on sounds like an excellent idea. I shall be interested in\ngetting more details on the project. The story in Time magazine is\nworth a great teal. Congratulations upon swinging it. It is a good\nstory with only a minimum of the usual Tims tongue-in-cheek 3tory\nwriting. I wondered if someone paid thorn to put the BBC story\nimmediately afterwards.\nI called Ralph this afternoon and he and I are meeting in\nBiloxi on the 13th to look over the hotels there and make a final\ndecision. I*a writing the Buena Vista today and asking that they\nhold the dates November h, 5, and 6 subject to our final decision\nafter we look the place over, -e should be able to make the trip\nfor twenty-five or thirty dollars each.\nGriffith has sent me application blanks and suggestions for\nimprovement upon the new one and I am waiting to hear from Dick 'for\nhis suggestions on an NAEB pamphlet* I will/move both of those\nthings along as fast as possible and will get letters out within\nthe next day or two to members of the Board concerning a membership\npush. I shall also urge regional meetings.\nThe idea of having the Board'chat with Redmond is an excellent\none. He is one of the most brilliant men I have met in the last ten\nyears and made, without question, the most significant contribution\nof any man in the two Rockefeller Foundation-University of Illinois\nSeminars* His grasp of the potentialities of educational radio amaae\nme.\nMy duties at homo have been so heavy in the last two months that\nI have not 'written Seipnan about studying in Hew York but shall do so\nin the ne; t day or two. Ac soon as I have had a reply from him con¬\ncerning the availability of the courses that I lack, I will contact you."
}