{
  "id": "d686-47",
  "text": "Uorch 6, 1251\n\\\n\\ %\nMr. Seymour 51 ©gel\nRadio Staton A’HTC\nNew York City, Now York\nDear Sii • .\n, ’ ' ' \\\nEnclosed please find a first draft of the revision of our NAEB brochure,\nalso copies of the old brochure* I propose that we keep tho sac® form with\nthe detachable application for membership blank end a corrected list of\nH*rB member®, both active and associate. I have wirad Paulu for an up-to- '\ndate list of members and fchooley for a brief history^ I have commitsioned\none of our* outstanding Ari Department professors to do a new cover psig©\nand have promised that within the next two or three diajys*\nI hsv© wired Griffith to revise the application blank tentatively and\nto go ahead and use It* I doubt that we can send invitations to prospective\nmembers on the same basis as the Academy of Political Science invited you\nto membership siaply because acceptance of the various schools as members\\pf\nMED hinges upon a complete investigation, approval by the e ccutive committee,\nand a final vote of the entire senior ship* I m afraid we had better keep\nthe form currently being used*\nI have forwarded to each regional director every' application for a\nstation in the noncommercial band that has been filed with the FCC since\nOctober, 1950 with the request tlrat he contact them ia*ediately if he has not\nalready done so* X shall continue to scan Broadcasting each week and forward\nonce a month new application and new CJPs to the regional director involved.\n^.1 suggest that you revise the enclosed gunk on HABB and have the re-\nviel(|t blanks mimeogr^hed and ©end at least ten to each regional director\nfor his immediate use* AS soon as I have received your revision of the\nenclosed material, I will; toss the deal at a local printer and have the\nbrochure within two weeks* My guess is that one thousand will b© enough\nto take care of the organisation for some time and I can personally mail out\nto the regional directors and officers fifty to on© hundred copies. X\nsuggest further that we keep the size of the prerent brochure in order to\nfacilitate nailing in a (standard legal sis© envelope. I have not contacted\nour local printer^concerning prices or details but suggest a soft color in\nthe basic paper and possibly a contrasting color ink for the printing. The\none color inking process will cost us less money and will require less time\nfor printing. If you prefer having it done in New York, I will forward\nto you the design or designs for the cover page and lot you proceed from there.\nI am sorry that I have hot been able to get this done sooner but continued\n• to wait until Friday of last week to h^r fro* Dick for the materials which\nhe indicated that he had for it and superimposed upon a very busy schedule."
}