{
  "id": "d686-49",
  "text": "New Albany City Schools\nDEPARTMENT OF AUDIO-VISUAL INSTRUCTION\nNEW ALBANY, INDIANA\nSCHOOL-OWNED\nRADIO STATION\nWNAS—FM\nVERNON McKOWN-DIR. AUDIO-VISUAL INST.\nMARVIN V. OAKES-DIR. RADIO PRODUCTION\nMarch 13, 1951\nHARRY R. DAVIDSON-SUPERINTENDENT\nAUSTIN A. COLE-PRINCIPAL\nMr. Graydon Ausmus\nDepartment of Radio\nUniversity of Alabama\nUniversity, Alabama\nDear Mr. Ausmusr\nI would like to tell you that I am very happy to hear that the NAEB meeting\nwill be held on the Gulf of Mexico next fall. Many of us in Indiana, are making\nplans to attend. According to advanced information this should be a very com¬\nplete and worthwhile program.\nYou are now in the process of program planning and I have one suggestion to\nmake to the committee. As you well know we have numerous 10 watt PM stations\nspringing up all over the country, and as a result we have many people who have\nhad little or no training in radio that are looking for meetings that will enable\nthem to better administer and program these stations. Our problems are quite\ndifferent from those of the larger university and public school stations and our\nphilosophies in many instances run somewhat counter to those stations that\nattempt to operate with trained personnell. As organizer and administrator of\nWAS, the first low power FM station in the public schools of America, I have had\nnot only to pioneer in this work but also to answer hundreds of questions for\nthose who are following. We 10 watt people are at present looking for a national\norganization whose meetings we can attend and feel that we have a chance to talk\nthings over with others of like interest. Four of us in Indiana, have found that\none of these programs is the Chicago School Broadcast Conference. This group is\nregional, however, and we are looking forward to NAEB. On behalf of the other\nthree people may I suggest that we begin next fall at Biloxi to have at least one\nsession devoted entirely to low power FM and if possible make it a general session\nin which the low power FM people have a chance to present what they are doing and\nthe help they would like to have from NAEB and its members. Last year at Columbus\nwe were given a spot but it was certainly not a good one. I would like to make\nthis special request for one year only. We believe that in one such meeting we\ncan present to directors of the larger stations the ideas that we would like to\nget across. Then in years following the low power meetings could be only individ¬\nual sections of the larger meeting.\nI can assure you that we will have some very Interesting discussions and\nquite a group of 10 watt people there, provided we can get some publicity in advance\nto those who are not yet members of NAEB.\nI shall be very happy to help in the selection of panel members from among\nthe low power people and if necessary moderate the discussion. If the committee\nis at all interested in having one session of this type please drop me a line and\nI shall be glad to suggest questions for discussion for this program."
}