{
  "id": "d108-12",
  "text": "John H. Le r.c hREGEIVED\nNAEB HEADQUARTERS\nNOV 17 It53\n»»ovember 16, I9ff\nMr. John Holt\nNetwork Manager\nNAEB Tape Network\nUniversity of t I Iinois\nI 19 Gregory Hal I\nUrbana, III! noi s\nDear Mr. Holt:\nMany thanks for your prompt attention\nin sending me the six names of your Acceptance Committee\nto whom, this date, I have sent the forms. I have\nstipulated, you will note, the date of January 9, 1954\nas a suitable beginning date from Salzburg.\nThere are a number of details I should like\nto work out in policy matters before going, if this\nprojected series is accepted. I am able, you see, to\nexecute a reporting commission as it were, and could\nvery well get on tape the specific kind of information\nor material the network would like to have. I have\nthought that the type of thing already done on the\nsample or audition tape would give you a rough notion\nof what will be done. Incidentally, I learn to my chagrin\nthat the quality of the copy-tape sent you ( and hence\nsent to the other committee members) is not good. Thereto\nI request that I be allowed to submit another tape for\ncritical consideration, for as a producer, I could not\nIet this stand I\nA second tape will be done this Wednesday\nwhich treats Finland# Pawn in Europe; a travel talk\non Corsica, review of Admiral Steven's Assignment Russia,\ninterview with a young Greek girl. Third show being\nreadied for taping Friday: Economic Survey of Spain,\ntalk on Cairo, chat with an English journalist, articles\ndealing with America's effort abroad ( specifically in\nItaly).\nI want to have six stand-by tapes of this rather\ndateless type ready before leaving. I expect, too, to\ndraw up a complete schedule of assignments and topics\nfor 13 programs and have this sheet mimeographed and\nmailed out. It will be understood that these topics\nmay change once I am on the spot in Europe, but this\nlist certainly will give an idea of the kind of reporting\nassignment I have given myself.\nAny further suggestions or comments will be\nvery much appreciated. If you should like to see me\nin Urbana in the near future I would be pleased to\ndrive over and to go into the modus operandi of"
}