{
  "id": "d108-78",
  "text": "Tokyo, Japan\nAug. 20, 1956\nMr. Robert Underwood\nNAEB\nUrbana, I!Iinois\nDear Robert:\nI am very fortunate in having obtained the services\nof Marcel Grilli for the forthcoming talk on music which we\nrecord this Saturday, Aug. 25# I have also written Mrs. Ruth\nSasaki in Kyoto, unquestionably one of the leading Western\nexperts on Buddhism to come up ( at her convenience) and speak\non the 2500th anniversary of the death of Buddha., for the\n12th and concluding program. As yet, she has not confirmed\nthis, but I wi 11 call her at her home next week.. Right now\nin the tremendous heat that has settled over Japan I suspect\nshe is living at a mountain resort.\nBut I should like to turn attention to something else\nin this letter, namely some good ( albeit conservative and\ninstitutional) publicity. I wrote a friend of mine at B/T\nWilson McCarthy. He suggests ( see enclosed) that you get\nin touch with Mr. Fred Fitzgerald, the news editor.. So ^m\ngoing to ask you to devise the story and send in the glossy\nprints for B/T, and only hope the story will break in the\nfirst weeks in September.\nI would suggest that you state something of this kind.\nJohn Lerch, writer-producer, has just completed a series\nof 12 fifteen minute programs for the National Association\nof Educational Broadcasters. The taped programs emanate\nfrom Tokyo and are informative in nature, consisting of\ncurrent topics in the news, discussion with political\nand artistic leaders, interviews with key figures who\nthrough light on problems basic to Japanese life and\nNAEB plans to release the series to _ subscriber\nstations in the fall ( date). Mr. Lerch is currently\nradio production supervisor with the Voice of the United\nNations Command, operated by the Army Psychological\nWarfare Detachment in Tokyo. Prior to this assignment in\nthe Far East, he was a producer for Radio Free Europe in\nMunich, il Above photo shows him at an exhibit of miniature\nshrines; ”this one being the Yomeimon Gate at Nikko, perhaps\nthe most famous and elaborate in Japan. The picture shows\nthe scale model, an esact replica, prepared for a Tokyo\ncollector who engaged 20 artists to work on the replica for\na period of years. II\n( etc... anything else you wish to add\nabout NAEB or REPORT FROM JAPAN)"
}