{
  "id": "d1182-14",
  "text": "-15-\nCHIGAGO ABC CUTS AM EUDGET FOR_TV\nTelevision niannir.- for the American Broadcasting Company in Chicago for new\nm-TV has cut Al^program budget nearly 1,10,000 per month. Other aBG depart¬\nments in addition to AM program have been asked to cut budgets.\nSENATE INTERSTATE. COMMERCE COMMITTEE PLANS\nSenate Interstate Commerce Committee chairman Wallace White ordered study by a\nsub-committee composed of Sen. Charles VI. Tobeyj Senator Albert b.Hawkes, and\nSenator Ernest Vi. McFarland to outline an agenda of procedure and scope for a\nbroad study of communications.\nCommittee plans to give particular attention to cZ ^\ncarrier communications, and has had conferences _ ^ nr-nart ierVs procedure\nProblems of the TV spectrum will be studied as will otate Department s pioceaure\nin negotiating international agreements.\nTo demonstrate scope, committee is reported to want to know if W 1b a\nfor its more than 2000 members and to be concerned with patent cont.ols intt\nradio industry.\nMASTER DEFENSE PLAN SET FOR\nTelevision FM, AM and Facsimile have been considered in a ‘“aster defense emergency\nreported subrnmed to Secretary James Forrestal. Place ef these facilities\nL over-a31 defense plan was indicated as was emergency system of broadens ing\noutside of\\’ashington. Russell J. Hoploy is director of the Civil Defense Planning\nDivision of the Department of Defense,\nC OLLSGKS FALL DCMN IN r;DUCATI0NAL_K^\nSneaking at the final, dinner of the American College Public Relations Association,\nUTiffh Torrv KLZ (Denver) manager warned the college men to use more practical\nintelligence in I\" dealirl with TV and FM than they had in the past with\nAM radio.\nDescribing one of the great troubles in past years \"as that monster known as\nthe Educational Broadcast\", Terry stated it was usually heard on. y y- ■\nproud author and the station engineer.\"\nJ&STSfSXiSSW -\nlisteners away...\"\nTerrw concluded:' \"If radio hasn't yet reached a high level of usefulness to #\neducational institutions, then you educators must stand up and s -\nm; W’B SURVEY Fat 1949\nBroadcast Measurement Bureau plans a new study f°* y194xncorporIted\"in°d\niho\"!orthcOTing1\"rosoarch^will°he^measurom0nt of scores>f Aw stations plus TV and\nFM aufio^es ?or iho first time. Daily and weekly audience totals will bo\nreported as well as daily frequency of listening."
}