{
  "id": "d1182-5",
  "text": "-6-\nunder the conditions which you have outlined, entirelv free from royalty restrictions.\nThe announcement which you will make is quite satisfactory. W® &re willing to make\nthis unusual concession in view of the educational aspect of your programs.\nThe permission given above covers only the\nfour titles mentioned and if further plays are to be used it will be necessary for\nyou to get authorization for their use in advance of the broadcasting date.\nVfe do hope that you will have success with\nyour programs and we’ll cooperate in every way possible to make them worthwhile.\nVery truly yours\nWALTER H. BAKER COMPANY\nBy Theodore Johnson\nNo doubt every program manager and director of our entire membership received this\nweek announcement signed by Harold P. Brown, Managing Editor of the Radio igest, re¬\nlative to the Beauty Queen of American Radio Contest. I need not explain the entire\ncontest as you are already acquainted with it. However, if you desire specific details\nwrite immediately to Harold P. Brown, Managing Editor of the Radio digest, 420 Lexing¬\nton Avenue, New York City, and I am sure that Mr. Brown will rush all details to you.\nEntries in this contest must reach New York on or before October 30. It appeals to\nme that here is an excellent opportunity for nation-wide publicity for our member\nstations. The Digest will run a brief sketch of the career of any one of your station\nartists. This will afford an excellent avenue of publicity which otherwise you could\nnot hope to secure. Vie think enou-’h of the idea from the standpoint of publicity\nalone to submit materials for this feature. All of us agree we need more publicity\nfor educational stations.\nIt was recently proposed that a collection be made of photographs of staff officials,\nstudios, and talent in each of the educational institutions holding membership in the\nAssociation and that a brief history of the station itself be submitted by each of\nthe program directors, the same in turn to be made into a permanent printed bulletin\nfor use of the members at large. Tail you please send me your comments on this propos\ntion, offering any suggestions or criticisms.\nYou may expect another bulletin just as soon as replies are received from over the\ncountry on many pending questions which will be of general interest to all of us in\nhelping to produce better programs in our studios.\nVery truly yours,\nT. M. Beaird,\nExecutive Secretary for Association\nUniversity of Oklahoma\nNorman, Oklahoma"
}