{
  "id": "d1827-1",
  "text": "Berkeley, and WBAI, New York.\nTrevor Thomas, Acting President of the group, asserted there is no Communist\ninfluence in station operation, agreed that Communists had appeared on programs in\nkeeping with established policy of presenting a complete range of viewpoints.\nAmerican Jewish Congress and American Civil Liberties Union assailed hearings\nas invasion of constitutional rights. NAEB indicated to I&cifica group that it stood\nready to help if its support was appropriate to the circumstances and if, in fact,\nabridgement of rights of free speech was at issue.\nMILWAUKEE TO LAUNCH SECOND ETV STATION\nThe Milwaukee Vocational and Adult Schools will inaugurate its second station,\nCh. 36, on January 28. Milwaukee, which already has VHF station Ch. 10 in operation,\nwill become the third community in the nation to initiate a second non-commercial\nchannel in order to take care of the expanding needs for instructional use of TV.\nNAEB PERSONNEL PROJECT GROUP MEETS\nMembers of the Evaluation Committee for the Survey of Educational TV Personnel\n(conducted by NAEB under a Title VII USOE grant) met for four days in Washington last\nweek to evaluate the data compiled and make recommendations, based on the findings,\nregarding the type of training programs and other opportunities which need to be\nprovided to develop the numbers and quality of personnel to fit the indicated needs\nfor ETV manpower. The memorandum developed by this committee will be incorporated in\nthe final report expected in April.\nParticipants: Vice Pres. Kenneth Bartlett, Syracuse U.; Hartford Gunn, WGBH-TV,\nBoston; Dean Arnold Perry, U. of N.C.; William Bowden, Southern Regional Ed. Board;\nand George Parkinson, Milwaukee Vocational & Adult Schools. James Fellows, Assoc.\nDirector of the Project, conducted the sessions.\nMPATI FILES FOR SIX CHANNELS\nThe Midwest Project for Airborne Television Instruction, which has been\noperating on channels 72 and 76 on an experimental basis, has asked the FCC for six\npermanent assignments in the UHF band. The six channels are not yet specified but will\nbe indicated in a subsequent filing.\nWith six channels, MPATI indicates it could expand its offerings next fall\nto a six-hour daily service offering 72 courses for 12 grades as well as college.\nBefore Airborne ETV can become permanent there will have to be a modification\nof rules to provide for integration of its system in the UHF allocations plan designed\nfor ground-based stations.\nNAEB is studying MPATI filing in relation to its recent nationwide allocation\nproposals.\nAPPLICATIONS TO FCC FOR ETV RESERVATIONS\nRequest by U. of Idaho in Moscow shifting reservation for non-commercial\neducational use from Ch. 15 to Ch. 12. (Granted)\nRequest by Catrillo College, Aptes, Cal. to reserve Ch. 22 in Watsonville.\nRequest by Western Washington State College, Bellingham, to reserve Ch. 18,\nBellingham.\nRequest by S. Carolina ETV Commission for a new educational station on Ch. 7,\nCharleston.\nFCC ANNUAL REPORT AVAILABLE\nThe annual report of the FCC for fiscal year 1962 is now on sale by the\nGovernment Printing Office, Washington 25, for 50^ •"
}