{
  "id": "d543-110",
  "text": "NAEB International Awards\nEach year producers of North Americans outstanding radio and television programs\ncompete in the Airericaa Exhibition of Educational Radio and Television Programs®\nThis Exhibition is sponsored by Ohio State University* s Institute of Education\nby Radio«Television. Its purpose is to further the broadcasting of significant\neducational programs by selecting outstanding exiles for special awards* All\nawards are based upon programs actually broadcast by either commercial or non*\ncomnerci&l radio or television stations* networks and organisations#\nDuring tha past few years the following series distributed by the HAEB Radio\nNetwork have been honored with Ohio State Awards i\nThreescore and Five\nTo Make Ifen Free\nAmerica On Stage\nOur Civil Rights\nTales from the Four Hinds\nOld Talcs and Row\nRussia Todsy\nLittle Orchestra Society Childrens Concerts\nJust Why Stories\nPrison Doeur®nt\nWhen Men Are Free\nScrolls From the Dead Sea\nPacific Portraits\nThe Minds of lien\nOne Nation Indivisible\nFallout and BisarmaEonfc\nScience Survey\nFootsteps of the Fro©\nIfeot Mr* Shakespeare\nCharles F* lettering. Monkey Wrench Inventor\nIdeas and the Theatre\nTalcs of the Valiant\nAmerican Adventure\nCooper Union Forum\nOf Many Things — Dr# Bergen Evans\nTbs Fourth «RM\nHands Across the World\nThe Child Beyond\nRobin Hood\nHow You TaUcI\nStories *n Stuff\nIn addition to these swards, HAEB entries have won several first awards in the\nInternational Italia Prize Competition in documentary, music and other areas*\nThis international competition is conducted by Radio Italiana, and some thirty\ncountries participate*\nCitations by various other organizations (soo International section separately\nattached) have also been received, together with requests for many of the programs\nthus recognized, some of which have also boon carried by United States commercial\nnetworks, and many of which have boon carried on the largest of the United States\ncommercial stations*"
}