{
  "id": "d543-13",
  "text": "NAEB HEADQUARTERS\n14 Gregory Hall\nUrbana,Illinois\nTos All Committee and Subcommittee Chairmen\n>- Harxy J. S:omie\nDates November 6, 1959\nIn fairly random fashion, many of you have discussed with us projects for which\nwe need funds* It is our hope that for some (I really hope for all) ve can find\nsupport. This should involve a multiplicity of sources.\nWould you each, please, therefore, send a statement of the one (preferably)\nproject we should concentrate on in your area, with:\n—■ a brief write-up we could copy with a minimum of rewriting (since\nwe have virtually no staff to do this).\n— estimated budget needed.\n— possible contacts (person, firm, address) and indication of whether you\ncould handle ary or all of these contacts (or suggest who might), if\nauthorized by the NAEB so to proceed on its behalf?\nWould you please add also*\n— a statement of the area of emphasis you would suggest for the comittee\nnext year, and possible redefinition of your committee’s functions.\n— possible reorganizations of the committee (only if you feel this is\nindicated).\n— suggested new names for committee members.\n— a reaction to a three-year rotation basis for committee membership.\n— any other suggestions you may have for the improvement of our work.\nSince committees are the great strength of the NAEB, and have been the source of\nmany of our best new ideas, we also want to thank you for the selfless efforts\nyou have already given. We hope our growing stature is a source of satisfaction\nto you, as it is to us.\nOne of the roles I see for the NAEB is to help its members achieve recognition,\nstature, realization and outlet for their ideas, ideals and work. We do\nour best to achieve that role. We should like to help our members get articles\npublished, and have them named to various distinguished comissions, councils and\nboards. We wish to help all we can in such connections. 3h this, as in all other\ncases, your suggestions are most welcome."
}