{
  "id": "d543-141",
  "text": "To:\nFrom:\nDate;\nSubject; NAEB Board Meeting\nThis Is officially to notify you, on behalf of President William Harley, that the Board\nMeeting is scheduled in his suite (number not yet available) at the Deshier-Hilton\nHotel, Columbus, Ohio:\nat 8:00 May 4 and\nat 9s00 a«m. and 2:00 p.m., May 5.\nSince there are many very basic decisions to be made, it is our hope that you can all\nparticipate. If for any reason you find it completely Impossible to attend. Bill and I\nwould appreciate a note from you to this effect, and mention of any items, or sugges¬\ntions you have to offer.\nRegarding expenses: It has been our practice to hold Board Meetings in connection\nwith the XERT and the NAEB Convention, which our Board members would normally\nattend anyway, at their institution's expense. For those who cannot secure expenses\non this basis, the NAEB has paid for one Board meeting per member per fiscal year\n(July l - June 30), Since funds are limited (in fact, overdrawn), we hope as many as\npossible can travel at their institution9* expense.\nIf you must travel at NAEB expense, buy transportation tax-exempt, listing yourself\nas NAEB Board Member or Officer (title), and save receipts and itemized listing of\ntaxi fares, meals, transportation, hotels, etc., since these currently are handled on\nUniversity of Illinois vouchers, which we shall, have at the Board meeting for signature\nfor those involved,\nPresident Harley also asked if we would attach a list of other NAEB (committee and\nother) meetings.\nThose known are listed herewith:\nMay 5\n1:00 p„m.\nRadio Network School Committee\nMay 6\n9:00 a\n9:30 a.m*\n11:00 a.m*\n12:30 p.m*\nInternational Relations Committee (ail day)\nNewcomer Meetings\nDiscussion groups (Newcomer Meetings)\nACBB Luncheon - Hall of Mirrors (Skomia involved)\n2:00 p.m.\n4:30 p.m.\nEIA: Technical Handbook (by invitation only)\nWelcome newcomers at reception - Ballroom\nMay 8\n11:45 a.m.\nNAEB Luncheon - Ballroom\n2:00 p.m.\nCCTV Committee\nNAEB Board of Directors ^\n(All Officers and Directors)\nHarry J. Skoraia\nApril 24, 1959\nDirectors)\ndm"
}