{
  "id": "d543-143",
  "text": "NAEB\nNational Headquarters\n14 Gregory Hall \\\nUrfeana, Illinois \\\nV\nApril 21t, 1959\nMr, Robert Schenkkan\nDirector, Radio-T?\nUniversity of Texas\nAustin, Texas\nDear Bob:\nWe1 re most grateful for your request for more information. We*re getting,\nfrom this Board, the most intelligent questions and informed suggestions\nwe’ve had since I’ve been here, and we’re all pleased as punch. We want\neverybody to know everything possible about all this. Harold Hill has Wen\npreparing various budget and other administrative materials for the next\nBoard meeting for several days; we then go over together and revise, and\nrewrite before they’re dittoed, We hope and believe that the materials for\nthe Board this time will be the best so far.\nHow to your questions. Yes. I’ll put Austin on my itinerary and schedule\nfor June Hi and 1$. I’ll come in June 13 I guess. It appears that each\nRegional meeting (we’ve had four so far this year) kills one more week-end\nfor me, but that can’t be helped. I’ll do my best and you can let me know\nlater what is wanted.\nIt is also a pleasure to give you the figures on tapes. For the year ending\nJune 30, 1959, it will corns to 312,216 reels. Stacked on top of each other\ntills is about 1700 feet, or one and a half times the height of the Empire\nState Building. (Our boys give us complete answers, sir I) We buy 15>00 to\n1700 new tapes per year. We own about lit,000 in all.\nOn our present budget basis, the cost to us for handling (including dupli¬\ncation, mailing, labor, tapes, administrative, etc., but not any charge for\nSkomia’s or Hill’s time or some other overlapping things which would occur\nregardless) comes to about 83 cents per reel. It would be difficult to pro¬\nrate cost of preparing offerings, handling orders, pro-rating management,\netc., so the 03 cents total will have to do, I guess.\nOur best,\nHarry J. Skoraia\nExecutive Director\nHJStJO\ncc: William G, Harley\nMr. Harold E. Hill ^\nMr. Robert E. Underwood, Jr."
}