{
  "id": "d543-15",
  "text": "hr. Hurry J* Skornie* Executive director\nnotional Association of Eiucetionei lroKtc««iir»\nSrogory holt\nUniversity of Illinois\nSir Son#, Illinois\nBoor horryt\nThanks for your hovenber | letter tN the followup from tlo conversation\nI h*4 with Moral4. treotly opprocioto your taking tho time one trouble to\npfwto so much background. At tho present tins tiio next MtTftC beeri mooting\nIs scheOuiei for February 11*12*1$ in Washington where o dinner moot log ml tit\nFCC commissioners is planned. It Is another meeting might ho col lei\nhot t soviet tho SFA mot tor moy ho ftemiHei with executive comsl ttoo msohors\nif hill to thinks quick action is Iniiceteo. (Executive committee msohors in*\neludes hot oh towel 1* tverett Cose, Ueyi i. Michael* emerge b. Stoddard,\nJohn F* hhi to, ftoymonS H. Wtucoff.)\nApropos any action of til respect to tho complex of issoos which ym ffomice\n(and In view of tho current TV gel* scandals and tho upcoming 41 so jockey\nscandals) —my recrnmndetlen mooli ho to folk ml th Cousins shoot this si too*\ntlon oo4 Its Implications (ho mooli ho hotter believed thou t on tho NC1BC\nhoori); mi th iimori hooks of MMlftlts (msktng your contact through Scotty or\n§r Iff I th oni sotting up » $**ey conversation mi th ono of thorn* yourself*\noni hooks) s oni stmt lorly mlth Jock Sooth oni brow Pearson (contacts Cohn S\nMarks).\nYou might also ho Ohio to is somothlng mlth tho industry mon recently hired\nto “change tho public imago of Th.** I coo*t soy his noma, in his case—end\nmoro particularly In tho coso of tho foregoing paragraph—the obvious point\nIs that mo already have • ¥i»stetion £TV network oni o ib$*stetien rod to not*\nmrk which 4o precisely mhot hollar Mppmen colls for, ill mo nooi is moro\noneoorogomont oni support, hhito heroic Foi loms con scorcoly ho expectei to\nJoin In such on effort, it com ho soli to him—oni any iniostry parson—that\nmany of our stations oro also HM msohors oni If thoy wont to scratch o point\nthoy con Mp©int mlth price,\" etc.\nTho root problem oni iongor In supporting oni Impiomonelng tho points of viom\noni tho convictions mhlch mo holi 1st (I) tho iongor of oppoorlng Colons!vc\nor ieg*ln*tho*mangors oni (I) of assuming o groat iool moro knomioiyo on tho\nport of everyone than octuoily Is tho coso* o*f»« many of tho son!or portlciponts\nIn iftl* Airborne* otc.* hove little background* oni tholr support Is gut to\nhonest oni genuine. Tho further pint mhlch Schwarxwetder mokes <technological\nobsolescence* tho Perth!on*, etc.) Is something also mo cannot forgot in taking\nour positions."
}