{
  "id": "d543-181",
  "text": "To: New NAEB Board Members\nGraydon Ausmus\nKeith Engar\nRaymond Hurlbert\nJames Miles\nJohn Schwarzwalder\nEdwin Browne\nGlenn Starlin or Kenneth Harwood\nCC: William Harley\nJack McBride\nRobert Schenkkan\nRobert Coleman\nFrank Schooley\nE. A. Hung erf ord\nGertrude Broderick\nFrom: Harry J. Skornia\nDate: (date to be shipped)\nHbuiLu. ~\n■irA> * 7- ‘\nHiu-U&JCt\n6>v\nHerewith, as backgrounding on particularly our Kellogg and Hill-Elliott rela¬\ntions, are recent requests and documents on those subjects.\nYou will also, in a few weeks, receive the budget report of our financial status\nas of December 31, for Headquarters and the Network. The general fund report,\non monies handled by NAEB Treasurer Bob Coleman, will probably first be dis¬\ntributed on or about dates adjacent to the IERT (May 6-9), which is when the\nnext NAEB Board meeting will be held.\nSince the two regular Board meetings of the NAEB each year are held in connec¬\ntion with the IERT, and at our own Convention, the NAEB does not attempt to\npay the travel expenses of Board members for these meetings. There is $1500\nbudgeted as a travel item for cases where the Board member would otherwise\nhave to travel at his personal expense. In such cases, up to the limit of funds\navailable, we have, where necessary, paid travel for the Board member(s) con¬\ncerned to either the IERT (Columbus), or the NAEB Convention.\nOther items will begin coming to you regularly. These will include a proposal,\nstill in draft, to Kellogg; another to Hill-Elliott; our final report to Ford, etc.\nI have also asked former Secretary Boyter for either the ditto stencils or addi¬\ntional copies of the minutes of the last Board meeting. As soon as these are re¬\nceived, 1*11 get copies to you. If we have to cut new stencils on these, in view\nof our present secretarial situation, there may be some delay.\nWith what Bill Harley will be passing on to you I hope we’ll soon have you feel¬\ning that you know the background you need on our current status. If not, please\nlet us know. We’ll do our best to answer any reasonable questions.\nhjs:rs\n1/8/59"
}