{
  "id": "d543-21",
  "text": "Hr. Peter Oselet,\n3, Sweater 3, ]£»9\nAt the mamt osr aont doapsrate need is for «sw Aesez duplicators to replace\n<wr geierd^ie<r »M» Inferior tetolma. For m W3 notions at asking ns\nfar progrsaa.\na program am offered as totab at Manet distribute to Bolted States cdu-\nif mmm to parcime.? tores. oar oaten moon® tend would to wiped ate.’\nPar though stwBgTTc-wl^ionB, and loyalty, and odaeaUanal note,, w an\npoor in dollars.\nThe next most argent mod is for ue to secure funds to Mt op • Watotogton\noffice, in elan ad^aoooex to tto aeon# of odocattonel Mwocdatiana, Ma\nwould like, for inotcewe, to be tote to jawtide, an radio at teaat, t*m\ntto Washington ana, tte idai of public affairs «d sew pragmas m bellow\niai not polios blotter area, bat news of what is haraeateg to education,\neconomics, and to tee not of tto world — wbito wili B*d non of tto\ncteoioi«i-a»feii« proooaeoa of oar nation and tto ilManH relation to teen.\nHe would hope for earn funis, to tola, to begin lin network ante for\n• dnestlon, frew tote ana, tee cash fclrely asterra®.\nAnd finally, since to tto oanrtsrelal field no broadcast staff sectors excopfc\ntto engineer (who aunt bane an CSC lioenae) ban »v SpeoLfte .ducatiooal,\nmoral or other proftwatonal standards to test, we nod randa to tote establish\nsuch professional stwwJerda (with edntom odnoaUooal aid otter qualifications)\nat least for edaoBbtonsl broadcasters, for tto nation, m teal these tools\ncm too powrFoT to \"iffilf use by people whs am not man of ttolr profound\nsocial, nomads, sod personal effects and eondittontag. to would hop®,\noreittueUy, that ttoae shasdarda would ba useful to toe osareretel redte\noperators, so well*\nttere, fewtefly, to oar dUfswa, and ow dm an. *t tto present mmtA prospects\nam not too bright, fm aw* too am acted by os tor funds feel that this to\na \"yard\" field, to awed sataUy to art otters bosk tots tto Held —> to help\neducators and ednsabten to heap open toe cram root* sources of idea*, tesptow.\nUsn and feed-back.\nX did not Intend to go on at sort) length, tot year mm letter aneouraged as\nto speak as frankly as X bore, ballswing tost car own rente of integrity to\nat least notated by yews,\nXf I an tote to cone to Bsw Xork assn, X shall Into forward to testing yon.\nMeanwhile, anything >. Karine or you can do to help m amr me crisis —\nin helping to secure toe support of other groups and iaOividnate, will be\ngreatly appreciated, X IU>1 tost far asm to et etas toot Matter an asm\nnoctent professional ssaaslstiao and \"autaateholp\" netswart; dtosppeor* trm toe\naosns in Anris*."
}