{
  "id": "d543-23",
  "text": "MEW YORK MCADQUAJtTm\nmil OOEIIT. W.titf.nt\nNotional a\nAudience!\nBoard\n\\_rv *\nA\nKRNAtO F. KAMINS, ImwUm ¥•<•-*•••«*«!\nVERA SIRVI, f*»W»c tonric« Director\nCANON AT CLIFTON\nCALIFORNIA HCAOQUARTUtS\nMRS. MARY COOOAN, Edvcolio* Director\n152 bit End A«m«, N*w York 21, N. Y\n190 North Canon Drivo\n•ororty Kill*. Colitorora\nTolofikono tiotote*r 9-9070\nTotophM# CRotMow 1-R141\nOctober 30, 1959\nHarry J. Skornia, President\nNational Association of Educational broadcasters\n14 Gregory Hall\nUrbana, Illinois\nDear Dr. Skornia:\nBernie Kamins and Dale Clark: hav# told me of your gracious\nhoapitality at the convention. May I express my gratitude, and\nalso take this occasion to venture an opinio that we also say\nhave been of some assistance. Hernia has had a great deal of\nexperience in his line of work, and I believe the publicity that\nhe was able to get in th*i papers w * mutually beneficial.\nI get the impression from my people that you feel that I am so\nsituated a3 to be able to mak* a very l*rge financial contribution\nto your group. T am very sorry to have to tell you that this is\nquite out of the question and 1 am go ig t take some time now to\nexplain.\nYou see, I personally live on the income of a trust fund, the\nprincipal of which cannot be touched. However, I did have some\nother money available to me in a capital fora which was convert¬\nible, but in order to preserve the in me from this money it was\npreferable to use the stock as fcrolatters; for a bank loan rather\nthan sell it. In order to ip*r<ite the National Audience Board,\n(at a trem n financial less)- T \"Hated ch i Loan; and\nit ha< been in tr* 1**3 unci inc^-asart,\namortized and increased, over the yaars, Surely I shouldn’t\nhave to tell you, of all people, t it the prerequisite to an\n■~tion supported by tax deduct ible ■d.-sations--deductible\nonor»--is that the rganination be \"exclusively educational*,\nimply i«nh in tbs - w rk thal w« could be ex-\ny educational. If we^e ' <;~irv I would be able to\nusiness expenses from mv inconv tax. If we were a charity,\nrue sens* of trie word I w ild be )le to live on donations\nre deductible t the donor*, H I have not been able\nbusiness deductions becaun* 1 a® not a busine9sv and I have\nable to receive any donations because we do not satisfy\nireaent laid down by the Treasury Department. The result\nthe Board has been literally a millstone around my neck."
}