{
  "id": "d543-49",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nSeptember 18, 1959\nOFFICE OF EXECUTIVE DIRECTOR\n14 GREGORY HALL\nURBANA, ILLINOIS\nPERSONAL\nMr. William G. Harley\nRadio Hall\nUniversity of Wisconsin\nMadison b, Wisconsin\nDear Bill:\nSorry for all the things I’ve had to refer to you lately.\nThis letter is an attempt to edge a little closer to an estimate of the cost of the\nWashington move to me personally. I’ll set everything forth to you rather frankly.\nI have no objection to your sharing with Hull, Miles, the Executive Committee\nor anyone else you wish — but I’d rather not go into this detail for the whole\nBoard, since, as you’ll see, it’s rather personal in spots, and I'd think the\nExecutive Committee as the “move” committee — or others,you designate -- are\nall who need. Or perhaps you could designate you, Hull and Miles (and/or\nothers) to do the close work on this.\nSince you weren't so close to the operation in 1953, perhaps I should briefly\nreview a few of the conditions under which I came:\n1) Housing Costs:\nWe found a house in Champaign, and bought it as of June 1, 1953,\nfor occupancy September 1. I could neither live there nor in\nBloomington, of course, during the summer. I therefore had to\ntake a Hotel room for 3 months (at about $2 0.00 a week), eat out,\netc. during this time. (There was no one here then to help me\nfind an “out” for this. Later, when Bidlack came, we were able\nto find him a place at the faculty club, at very little cost, until\nhe was able to move into a house.) Some of this time I was “on\nthe road” with expenses paid by the NAEB. But, during this time,\nI was paying payments and taxes on 2_ houses and 1 hotel room,\nnone of which I was occupying (except the hotel room, between\ntrips, so I could work in the office nights and weekends, as\nGraydon will remember,. NAEB reimbursed me for none of this, nor\nfor moving costs . I didn’t expect them to, of course, since I felt\nI was making a permanent move. Graydon, who was President at"
}