{
  "id": "d543-50",
  "text": "Mr. William G. Harley, Page 2, September 18, 1959\nthis time, can confirm all this, as can Schramm. It was at this time\nthat Son Lee got rheumatic fever (in Bloomington) so this (see also\nnext item) was a hectic time.\n2) Medical Expenses Attendant on the NAEB Tob:\nAlthough I was well enough for Indiana University, the State Depart¬\nment, consultant jobs for the Army, etc., when I came here I had to\ntake a physical (for University of Illinois retirement). They pro¬\nnounced me * ‘unemployable . ” With Wilbur’s support I set out to\nprove them wrong, since all bridges (Vienna, Bloomington) were\nburned. I made several trips to Chicago at $40.00 a shot, not in¬\ncluding travel costs, for all sorts of specialized (kidney sections,\nheart, etc.) tests. These were later continued here. In all I spent\nover $400.00 and untold time and anguish (none of it reimbursed) on\nthis. Some months (over a year) later, upon receipt of a change of\nstatus for me (I was, during this time, not qualified for insurance,\netc., but was able to stay on the job and draw salary ((from which\ninsurance was deducted anyway)) ), Wilbur wrote a cute note to ask\nif he should now congratulate me on my promotion from “unemploy¬\nable” to “sub-standard” — which I still am. (I had also been 4-F\nduring the war, and was unable to get into intelligence, etc., for\nsome of these reasons.) During these six and one-half years, I\nthink my energy and health have proved themselves, except as noted\nbelow. I do not have constant colds, headaches, family illness, etc.,\nas some have, and have missed virtually no time due to illness.\nThere is one thing though: I was warned that heart and kidney prob¬\nlems might get me, if I didn’t exercise regularly, as prescribed. I,\ntherefore, work out every noon hour I’m here — not for the hell of\nit — but because I’ve been warned I'd better if I want to survive.\nThere are other precautions I observe, but this is the only one rele¬\nvant here. (I do have an eye muscle problem ((my son’s, more severe,\nrequired surgery to correct)), and at Indiana took weekly treatments at\nthe eye-clinic at no cost. This need is also taken care of here, at no\ncost, as part of my exercise and fitness program. I’d need to get\nsomething comparable in Washington.)\nThe point of this is that many newcomers, joining the physical fitness\nprogram I’m in, say it would cost several hundred dollars a year any¬\nwhere else. I would, if we moved, have to find an athletic club with\nfacilities and staff to go on with this. Not sure of cost, but there\nwould be some. (Here the only cost is $3.00 a year for a locker.)\n3) Actual Losses:\nSomewhat over a year ago I was on the ropes with far more trips than"
}