{
  "id": "d543-51",
  "text": "Mr. William G. Harley, Page 3, September 18, 1959\neven this year. Because not all vouchers had come through, I had\nborrowed some $400.00 (trips upcoming were end to end, including\nspeech at NAPSAE in San Diego; UNESCO, AEA, conference with\nMilton Mayer, all immediately following our Convention). In the\nafternoon of that day I planned to get away to get traveler’s checks.\nAt noon my wallet was cleaned out (from the locker at the gym —\nwhere several others lost things too). My personal insurance\ncovered $100.00. To this day I’m out approximately $3 00.00. I\ndid not, and shall not, request reimbursement for this, though in\nmost firms or associations, of course, I would have. But if I were\nreimbursed, I feel a precedent would be set whereby any staff or\nBoard member, suffering similar loss, whether due to theft, drunken¬\nness or carelessness, would also deserve this. I’ve never even men¬\ntioned this except earlier to you. But I thought it might help prove\nI’m not out to get all I can.\nUntil this year also, I never claimed or got any reimbursement for\nhome (or town) entertainment. Through the years (the Board used to\nmeet fairly often in Champaign-Urbana during Ausmus, Schooley and\nPaulu administrations; we had the Professional Advancement Committee\nout 2 or 3 times; and we used to have lots of foreign visitors: RTDF,\nBBC, etc., etc.) I’d guess this ran to a couple of hundred dollars.\nHere, too, no claims were or will be made. When we go to Washing¬\nton, however, since this will become quite an item as many more\npeople will come in, we’ll have to make provision, and I’ll perhaps\nget a credit card (Diner’s) for luncheons, etc. I’ll get stuck for.\nThrough the years with NAEB I’ve been a “check-fumbler” — and\nhave gotten by pretty well. I’m not sure it has always done the NAEB\nor me personally any great credit, however. I'd feel better if I could\noccasionally pick these up and know it could be put on an NAEB bill\n(without my being ”on the road”).\n4) Home Investment:\nOld as it is, I have approximately $3 0, 000 (not nearly all paid for) in\nmy house. This includes purchase price (not including interest, etc.,\nof course) plus new structural improvements (foundation, etc.), new\nfurnace and heating system, new sink-dishwasher-garbage disposal,\netc., units and cabinets, kitchen remodeling, basement and plumbing\nimprovements, drainage and other redesign, attic remodeling, etc.\n(I probably have sunk my roots as deeply as any of you. Hence, I’ve\ntried to make the house as trouble-free as possible, since I'm away a\nlot. And I truly thought this was my last move.) These figures, of\ncourse/ exclude paint, roofs, gutters, yard, etc.\nShortly before Helen left, I had a firm offer of $35,000 for the house\n(for conversion into apartments). We talked it over, and since it"
}