{
  "id": "d543-52",
  "text": "Mr. William G. Harley, Page tyr, September 18, 1959\nappeared (cf. Schooley’s mention of Kellogg opposition to Washington\nmove about that time) we’d be in Champaign “from now on’* we turned\nit down. Not sure what you’d do in my case now. If I get $35,000,\nI’ll feel proud and happy. If I get $30, 000, that’s really all I have in\nit, so I suppose I couldn’t complain, though I’d regret now having been\nable to sell at $35,000 or not making something on it, as one normally\ndoes in times of inflation. If I have to take less than $3 0,000, (and\nmaybe even between $30,000 and $35,000) I’ll certainly feel that\nmaybe the NAEB should in some way make it up to me. Or if it stands\nidle for several months (like Christiansen’s in Ann Arbor, where do I\nget the money or down payment for a house in Washington area? I\nhave no income but salary, and, between property settlement with\nHelen, housekeeper, insurance, trying to help Dad, and other fixed\nexpenses, I have been unable to accumulate much. The value\nquoted may seem high. But the home is really all I have but insurance,\nin view of the retirement situation at Illinois if I leave.\nAll this, of course, is without relation to Washington house prices —\nfor once I buy in Washington I think that’s my problem. I’d guess\nit’s high there too, but haven’t checked. How do you feel about\nthis? Please tell me whenever you think I’m “gouging.” I truly don’t\nmean to.\n5) Furniture:\nHere it gets a bit personal. When Helen left, in the settlement most\nof our furniture (some of the oriental rugs and lamps; some beds,\nchests, etc. from her family; all the silver, dishes, table linen, etc.,\netc.) became hers. But the kids and I use all this as long as we live\nin Champaign. This means my moving won’t cost too much (since\nthere won’t be much to move), but I’ll need to buy lots of furniture.\nIf I don’t move, I don’t have to. Yet the Board or others could well\nfind it kinda funny if we put in for “new furniture for Skornia.” This\ngets sticky. Should a lump sum of $1,500 or so — afraid I’d not\nmake anything on this — be planned for, or should it simply be con¬\ncealed (with other items above and below) in a substantial salary\nincrease? (I could get an increase to, say $17,500 and still not have\nas much money at the end of a year, I expect, as I have now. See\nbelow.)\n6) School Facilities:\nThe kids live within walking distance of school here. We are in a\nstate university town, and I planned on the kids going to school here.\nWhat will (High and Junior High) school costs be there? And trans-"
}