{
  "id": "d543-54",
  "text": "Mr. William G. Harley, Page 4, September 18, 1959\nto retirement, or investment. Much would be lost if paid as salary —\nin taxes.\nBefore we discuss with the full Board who goes, etc.. I’d like to meet with you\n(and others you might appoint to work out Washington move details) to go over\nsome ideas I’ve so far not adequately suggested to you. If we move others from\nhere, “move” expenses might mount up. We’d need to investigate, set ceilings,\netc. or we may “go for broke.”\nIf, in early discussions, I mentioned that there would be problems, and didn’t\ngive a quick “yes,” I trust you see what I mean. How expensive can I become\nbefore it’s cheaper to get the NAEB “another boy?” (If you do — get one you\ncan trust — and with loyalty and devotion to NAEB rather than self-aggrandizement\nor separate empire-building — or I’ll blow the place upl)\nI’m always abashed to bring up things like such expenses. I feel apologetic and\ncheap even mentioning them. The professional Skornia is excited about the pros¬\npect of going to Washington. I feel I know the proper circles — and believe I\ncould do a re-invigorated job for NAEB — open a new era! The personal Skornia\nmust ask himself “What’s it really going to cost me to make this move?” Can I\nafford this? For actually, before I come out even the same as I do now at the\nend of each year, a pretty substantial salary increase (or item by item payment)\nwill be needed. Won’t people in the NAEB think I’m in it for Skornia if this gets\ntoo high?\nI’ve attached extra copies of this. Bill. I’ve discussed with no one. I expect '\nI’ve forgotten some things besides, for I have always found every move costly.\nBut these are illustrative, and give an idea of what I could move for, without\nthe move being a salary cut for me.\nIt’s a tough one. Your ideas will be appreciated. The NAEB has always been fair\nto me, and you can be sure I’ll never let it down. I’ve tried to be as objective as\nI can about this. I invite you to be equally frank and to make whatever sugges¬\ntions you have to offer.\nHarry J. Skornia\nExecutive Director\nhjs:rs\nEnclosures"
}