{
  "id": "d543-73",
  "text": "TO? Messrs. Richard Hull august 4, 1959\nWilliam Harley\nHarry Skornia\nFROMs James $. Miles\nGentlemens\nWHILE WORKING OH THE A IR30HME TV PROBLEM OUR ATTORNEYS\nSECURED FOR US PAGES 1955 TO 1998 OF THE OFFICIAL FCC REPORT\nIN THE MATTER OF THE 25 MGS TO 890 USES, DOCKET NUMBER\n1X997, TAKEll OH JUNE 26 s 1959.\nThe MORE OF THIS DOCUMENT I READ THE MORS ! BECAME\nCERTAIN OF THE S0MFU8I0M IN THE MINDS OF MANY OFFICIALS REGARDING\nEDUCATIONAL NEEDS AS THEY RELATE TO TELEVISION, THESE PAGES\nARE REPLETE WITH QUESTIONS FROM THE COMMISSIONERS ADDRESSED\nto Mr. Stewart and Mr. Braum for which they bid not have\nANSWERS. I BO NOT KNOW WHY RALPH StEYTLE WAS NOT THERE TO\nATTEMPT THE ANSWERS, BUT THE FACT REMAINS HE WAS ABSENT,\nI AM SURE OF ONE OF TWO YB3HS8S~ (a) WE ARE BEING POORLY\nREPRESENTED IN WASHINGTON OR (b) THERE ARE MANY ANSWERS WHICH\nNAVE NEVER BEEN ASCERTAINED.\nWe ALL KNOW THAT SOMETHING IS GOING TO BE BONE ABOUT THE\nFIRST OF THESE ALTERNATIVES AND WE WILL HOPE THAT THIS\nREPRESENTATION WILL BE BETTER, BUT HOW A ONE MAN STAFF CAN\nREPLACE A FIVE OR SIS MAN STAFF AMD PROVIDE BETTER ANSWERS IS\nA VERY GOOD QUESTION.\nISy REAL REASON FOR WRITING THIS LETTER IS TO SUGGEST THAT\nm ALTERNATIVE (s) ABOVE IS THE MOST LIKELY TO S£ TRUE AND IF\nTHIS IS 30 WE SHOULD BE DOING SOMETHING ABOUT IT, I HAVE NO\nSPECIFIC PROPOSAL TO MAKE BUT CERTAINLY W£ SHOULD BE ABLE TO\nanswer Commissioner Cross*s question which was, “You weren't\nVERY SPECIFIC. HAVE YOU ANY IDEA WHAT VOUR MEEDS ARE (FOR\nMULTIPLE CHAf4MgLB AMD ADDITIONAL VHF CHANNELS)? DlD YOUR\nORGANS 2AT ION STUDY THAT? n\nThe answer to the above question took a whole page after\nwhich Commissioner Cross restated, “Do you know what you need?\nCan you tell us?”\nTo this Mr. Stewart replied with the single word, ”No*m\nA little later Commissioner Ford tried to ask exactly the\nSAME QUESTION. Mr. BBAUM ATTEMPTED THE ANSWER THIS TIME AND\nMENTIONED ALABAMA AND THE MICHIGAN STATE PLAN. He THEN WOUf^B\nTHIS UP 3Y SAYING, “WE THINK WS NEED CHANNEL SPACE TO PROVIDE"
}