{
  "id": "d543-86",
  "text": "Phillip Coombs\n- 2 -\nJuly 20* 1959\nSteetlo tolls mo (and lot me make It clear I am not speaking on his personal\nbehalf nor on behalf of the JCET, the NAEfc or any othor group), that he wit I\nbe out of this particular picture within a year regardless of whether the\nJCET Is refinanced by Its own constituent members or by some outside source\nor not at all. 1 aw ocagly concerned at the prospect that the JCET function\nmay not continue—and until a genuinely qualified successor to SteetTeTs—\nfound egqplly concerned about hit leaving the Washington scene.\nSeveral of the alternatives I understand to have been discussed thus far by\nArthur Adams, President Jorgenson and others* seem to me singularly Inept\nend unrealistic, for Instance* one proposal which Steetle was instructed to\ndiscuss separately with Harley as MAE* president end White as NETRC president\ncal ad for the following: Adams at the American Council, one way or another\nwould find 50% of a new JCET budget. Then the MAE* and the METRE would be\nasked to pick up the other 50% on e radio of I (MAI*) to 10 (NETRC). This\nwould obviously almost guarantee conflict or suggest to the NETRC it should\nassume the Washington function, a result which would concern me even more.\nWhen asked why the constituent members of the JCET could not singly assume on\nan aqua! pro rata basis continuing support of tha JCET and its function,\nStaetia infers the answer lies in ‘educational politics.» Tha NEA, for in-\nstanca, is rumored to be quite wiIIIng to pick up the check for the whole bill.\nThese comments ere only suggestive end not meant to rapresant a full analysis\nof the problem. However, I cannot escape the conclusion that the function\nwhich the JCET has fulfilled must somehow be continued. And In its continuance,\nthat function should ba carried on In behalf of the entire educational\nestablishment (not any specie! interest group) end for ell the various elec¬\ntronic communications madia which education does now or may employ.\nI have said quite enough about our concern for an overall educational communica¬\ntions policy within tha Foundation, in any event, that is a long-time problem.\nHowever, time is running out for solution of the more immediate problem—the\nfuture of the JCET function.\nPlease do not feel obliged to answer this letter. I have singly tried to\nconvey some thoughts on what I believe to be a matter of mutual concern.\nSincerely*\nRBH/mh\nRichard 6. Hull* Director\nRadio and TV Broadcasting\nBcc: Ralph Steetle ^\nBill Harley"
}