{
  "id": "d1232-2",
  "text": "Summer Studies Offered in ETV\nIndiana University. For the first time, the I.U. radio-TV de¬\npartment will offer a special 8-week workshop in ETV.\nThe plan is to offer school teachers and administrators,\nindustrial personnel, and graduate students an opportuni¬\nty to work in depth in organizing, developing, and per¬\nforming for ETV.\nStanford University. A special program in ETV will be of¬\nfered June 24 to August 17 by the 21st Radio-Television-\nFilm Institute, the School of Education, and KQED, San\nFrancisco ETV station. Participants will study communi¬\ncation in society, ETV operation, teaching by TV, and\nproduction, and may elect one of the ten regular institute\ncourses, which provide training in writing, production,\nand performance for all three media, and programing and\nmanagement.\nNew NAEBers\nASSOCIATES\nColorado Educational Television Commission, Denver, Colo¬\nrado; Rochester Area Educational Television Association,\nRochester, New York.\nSUSTAINING\nStation KYA, San Francisco, California.\nINDIVIDUALS\nWilliam E. Abel, Montgomery, Alabama; Donald L. Albrit¬\nton, Boston; Mrs. Robert M. Allen, Arlington, Virginia;\nCapt. Robert W. Anderson, Fairborn, Ohio; Rudolph W. Ash¬\nby, Wichita Falls, Texas; Capt. Helen C. Atkinson, Brooks\nAFB, Texas; Jackie Bastiani, Milwaukee; Capt. Dean E.\nBates, New York; Mrs. Cynthia F. Birrer, Philadelphia;\nRoger A. Booth, Chicago; Tom Borden, San Francisco; A1\nBrezgel, Milwaukee; Carol Bruss, Milwaukee; Barbara\nBryant, Adelphi, Maryland; Leonard C. Buyse, Ithaca, New\nYork; Milburn R. Carlson, Palo Alto; Capt. Edmund P.\nCarr, Biloxi; Lynn E. Cato, Washington; Gordon Clay-\ncombe, San Francisco; Sally Hutchison Clyde, Sioux City,\nIowa; John Coney, San Francisco; E. Dana Cox, Jr., Mt.\nPleasant, Michigan; Capt. Charles J. Curry, Vance AFB,\nOklahoma; Major John E. Devlyn, Lackland AFB, Texas;\nRaymond R. DiMeo, Pittsburgh; Paul Doll, Milwaukee;\nVernon J. Elslager, Montgomery, Alabama; Capt. Jack N.\nFarmer, Gunter AFB, Alabama; Stanley Field, Falls Church,\nVirginia; Lisa Fillman, New York; William T. Fortune,\nWichita Falls, Texas; J. Edwin Foster, New York; John\nV. Gaeuman, Brooks AFB, Texas; Rita H. Gentile, Philadel¬\nphia; William Graf, Milwaukee; Judy Grages, Milwaukee;\nDavid Grieve, San Francisco; J. Anthony Grosboll, Jack¬\nsonville, Florida; Robert Hagopian, San Francisco; Paul E.\nHarrison, South Arlington, Virginia; Warren Haushalter,\nMilwaukee; Jim Heiss, Milwaukee; Capt. Rosa Hernandez,\nGunter AFB, Alabama; Capt. Anne T. Hines, Maxwell AFB,\nAlabama; Sister Mary Jeanelle, Chicago; Charles Jenz, Mil¬\nwaukee; Dr. Bettye U. Johnson, Commerce, Texas; Ken¬\nneth F. Lam, Louisville; Joseph O. Lawson, Wichita Falls,\nTexas; C. H. Logan, Milwaukee; Donald L. McCaleb, San\nLouis Obispo, California; Donald E. Madden, Wichita Falls,\nTexas; George Edward Manno, Floral Park, New York;\nGerald Marans, San Francisco; Penny Martin, Rockville,\nMaryland; Dr. Roland M. Meffert, Maxwell AFB, Alabama;\nFred Meyer, West Allis, Wisconsin; Loyde Middleton, Nash¬\nville ; Don Mills, San Francisco; William Gene Moll, Austin;\nRichard Moore, San Francisco; Rudolph Morris, Washington;\nTerry Muehleisen, Milwaukee; Winifred Murphy, San Fran¬\ncisco; Jerry Natrop, Hales Corners, Wisconsin; Oguz Nay-\nman, Washington; Daniel C. Niemeyer, Philadelphia; Thom¬\nas E. O’Brien, Denver; Bernard E. Park, Fairbanks, Alaska;\nJames E. Parsons, Myrtle Beach AFB, South Carolina;\nGeorge Peters, Milwaukee; Ronald Phelps, Milwaukee; Billy\nJ. Phillips, Rantoul, Illinois; Joseph Plesh, Milwaukee; David\nNAEB Headquarters: Suite 1119, 1346 Connecticut Avenue,\nN. W., Washington 6, D. C. Phone 667-6000 Area Code 202.\nPort, Milwaukee; Tom Radai, Milwaukee; Mary Raitt, Wash¬\nington; Jane Redlin, Milwaukee; Jonathan C. Rice, San\nFrancisco; Clayton A. Roehl, Mt. Pleasant, Michigan; Dan¬\niel A. Rose, Boston; Bob Rosenow, Milwaukee; Jules Ross-\nman, East Lansing; Nora Rowley, Washington; Stanley Sa-\nbik, Plymouth, Michigan; Irving Saraf, San Francisco; Dave\nScheunemann, Milwaukee; Steve Siehr, Milwaukee; 2/Lt.\nDavid P. Slater, Amarillo; Duane R. Smith, Monroeville,\nPennsylvania; R. L. Smith, San Francisco; Mrs. Dinah\nSpindler, Buenos Aires, Argentina; Irwin P. Starr, Ann\nArbor; Theodore Steinke, Milwaukee; Marvin L. Thall,\nPhiladelphia; Lt. Col. Thomas R. Cook, Jr., Maxwell AFB,\nAlabama; Boake C. Thompson, Champaign, Illinois; Ray¬\nmond A. Toth, Wichita Falls, Texas; William Triest, San\nFrancisco; J. H. Warf, Nashville; Capt. James I. Wieden-\nfeld, San Antonio; Dale W. Wile, Eugene, Oregon; Paul A.\nWilliams, San Francisco; William B. Willingham, Bloom¬\nington, Indiana; Ken Winslow, San Francisco; Steve\nWoida, Greendale, Wisconsin; Everett L. Woodcock, Damas¬\ncus, Maryland; Hassan M. El Zein, Bloomington, Indiana.\nNews Notes\nPERSONNEL\n^ William Balfour Macdonald has been appointed to a newly\ncreated position at WTTW, Chicago, as producer responsible\nfor long-range development and production of local and net¬\nwork ETV programs. He was a staff member of WTTW in\n1955-56; most recently he was writer and producer-director\nfor several commercial and government film projects in New\nMexico.\n^ Science Research Associates, Inc., Chicago, have announced\nthe appointment of William W. Cobbs, II, as director of the\ncompany’s newly created audiovisual materials department.\nCobbs formerly was director of education programing for\nLouis De Rochemont Associates, Inc.\n^ Colonial Williamsburg’s Radio-TV Manager Hugh De-\nSamper reports that the public service institute sponsored by\nNAB and American University recently was a “solid” seminar\nand that he gleaned many new programing ideas from it.\nGENERAL\n^ Philadelphia’s educational TV (Channel 35) and radio sta¬\ntions have switched call letters from the former WHYY to\nWUHY-TV and WUHY-FM. The WHYY call letters have\nbeen assigned to the recently acquired Channel 12, which is\nscheduled to begin broadcasts in September. Channel 35 has\ndiscontinued its evening programing, but continues to broad¬\ncast its daytime, in-school programs.\n^ On April 15, WOAK, Royal Oak (Mich.) 10-watt school\nstation, will begin its seventh year of live broadcasting of the\ncity commission meetings.\n^ Iowa State University’s WOI has combined with eighteen\ncommercial and educational stations in the state to form the\nIowa State University Radio Concert Network. Stations will\nbroadcast twice a month until July; programs will consist of\ntaped concerts originating on the university campus.\n^ Beginning in September, University of Texas CCTV video¬\ntapes are to be given Spanish soundtracks for viewing in\nclassrooms at the Monterrey (Mexico) Institute of Technology\nand Higher Studies. A freshman chemistry course will be\nthe first to receive a Spanish soundtrack, and a professor from\nMonterrey will work in the studios at the University of Texas\nto supervise the dubbing. The three-year project is being\nfinanced under a new Ford Foundation grant.\n^ WMHT, Mohawk-Hudson ETV station, is soon to receive\na new transmitter allowing an increase in power to twelve\ntimes what it is now. The gift is from commercial WTEN,\nswitching from UHF to VHF.\n^ The University of Wisconsin has approved allocation of\nfunds to establish an FM station on the campus at the Uni¬\nversity of Wisconsin-Milwaukee. Formal application is to\nbe filed with the FCC soon.\n^ Latest means of obtaining TV receivers for Alabama class¬\nrooms is through merchandise trading stamps. Recently a\nAPRIL 1963\n3"
}