{
  "id": "d1634-0",
  "text": "CONSTITUTION OF THE ASSOCIATION OF COLLEGE & UNIVERSITY BROADCAST¬\nING STATIONS\nPreamble:\nBelieving that radio is in its very nature one of the most im¬\nportant factors in our national and international welfare, we, the\nrepresentatives of institutions of higher learning, engaged in edu¬\ncational broadcasting, do associate ourselves together to promote,\nby mutual cooperation and united effort, the dissemination of knowl¬\nedge to the end that both the technical and educational features of\nbroadcasting may be extended to all.\nArticle 1\nMembership;\n(a) Any college or university of recognized standing may be\nelected to membership in this organization by approval of the Exec¬\nutive Committee, and a two-thirds vote of all active members of the\nAssociation,. each active member being entitled to one vote.\n(b) Active members shall consist of such institutions of high¬\ner learning, owning and operating their own broadcasting stations,\nas are members of this Association. Any institution of higher\nlearning may become an associate member of this Association in tht.\nsame manner as provided for active membership. Associate members\nshall have all the privileges of active membership, except that\nthey shall not be permitted to vote or to hold office. An experi¬\nmental or amateur station, owned, and operated by a recognized in¬\nstitution of higher learning, may be elected to associate member¬\nship.\nArticle 2\nDues:\nThe annual dues or registration fees of active members shall\nbe $10, payable January 1 of eaoh year. The dues of associate\nmembers shall be $7 annually.\nArticle 3\nOfficers:\nThe officers shall be a president, vice-president, secretary-\ntreasurer, and six additional executive committeemen. One commit¬\nteeman shall be selected from each of the five radio zones in the\nUnited States, and one shall be a member-at-large, for a period of\none year. These officers shall be elected by a majority vote of\nthe active members present at the annual business meeting, which\nshall be held at a time and place designated by the Executive Com¬\nmittee."
}