{
  "id": "d1707-11",
  "text": "12\nUNIVERSITY OF MICHIGAN\nNovember 24\nNews of Burgoyne’s defeat reaches Paris, persuading the\nFrench to enter an alliance with the colonies against Great\nBritain\nCAMPUS NEWS\nThursdays, 3:15-3:30 p.m.\nNews of research, student activities of state-wide interest, an'\nnouncements of campus events, interviews with University per-\nsonalities featured in the news of the week, sports, interviews with\ncampus authorities concerning news events, and little-known facts\nconcerning the University, will be prepared and presented by\nstudents in the classes in Broadcasting aided by the Michigan Daily\nthe University News Service, and the Alumni Association. These\nprograms will enable University Alumni and parents of students\nupon the campus to keep in contact with the University.\nHIGH SCHOOL FORENSIC SERIES\nFridays, 3:00-3:30 p.m.\nThis series of programs has been arranged for the High School\nForensic Association in the Middle West area. The national debate\nquestion for the schools for 1938-39 will be “Resolved: That the\nL nited States Should Establish an Alliance with Great Britain ”\nThe following programs will be of interest to the debate teams and\ncoaches in the Middle West area. Those talks which are starred\nwill be printed and distributed free following the broadcast, so\nthat the material contained may be quoted in debate.\nOrganizations which have signified their intention to co-operate\nin the reception of these programs are the National Forensic\nLeague, Michigan High School Forensic League, Ohio High School\nSpeech League, Indiana High School Debating League, Indiana\n±iigh School Discussion League, Kentucky High School Forensic\nLeague, Tennessee Interscholastic League.\nOctober 14\nThe United States and Great Britain Should Form an Alli¬\nance: definition of terms, interpretation of question, funda¬\nmental issue, available references. Arthur Secord, Manager of\nMichigan High School Forensic Association\nOctober 21\nDiscussion of the Affirmative Case: briefing the question, major\ncontentions, supporting arguments. Presented by the Univer¬\nsity of Michigan Men’s Debate Team"
}