{
  "id": "d1093-1",
  "text": "MEMBER STATION REPORTS\n- 2 -\nUniversity of Michigan . ...\n-Pending the o oration of its own Ft.! station, the institution is providing\nprograms for other stations as follows:\nyy-JK . 2 half-hour and 1 quarter-hour programs\nWKAR .......... 3 twenty-five minute programs\nY^pag . 5 quarter-hour programs\nYiYjj . 3 quarter-hour programs\nVilKZO & YiJEF. 1 twenty-five minute program (tentative)\nA transcription network service is planned in cooperation with the Michigan\nState Medical Society. „ , 0 . . , „ „ _\nThe FM development is being delayed because of the lack of materials fo c\nstructing the transmitter house. The call letters ViiATX have been assigned—but\nare unsatisfactory to the University. About fifty alternate calls have been pro¬\nposed—but none of them could be made available. A new building which will house\nthe Broadcasting Service is now in the ”hole-in-the-ground’ stage.^\nThe present staff: Y.aldo Abbot, director of broadcasting service; Donald E.\nHargis, Hymns of Freedom program producer; Robert D. Essig,.Technician;\nRobert Bouwsma, production; Elizabeth Cole Stevens, continuity editor; Hans Pick,\nmusic; and Adele Sefton, secretary.\nUmversii^ution ^ —— tWQ stations, YiILL (AM) licensed in 1922, and WIUC\n(FM^ILL6operates^^ytime, seven days a week. It takes the opportunities of those\nliving in the University community to the \"larger university campus which is the\nYYIUC received its equipment just before the \"freeze” order. Its service is\nlimited at present because of the shortage of receivers m tne area. Plans a\nunder way for a new and more powerful transmitter, and an expanded program service.\nSpecial evening broadcasting permission has been obtained for basketball.games\n(all home and ‘away-from-home games this season) for TWILL. Station also carries the\nfootball and baseball games. , , _T , 91 1Qy,n\n3000 farm broadcasts—that *s the record WILL completed on November 21 1946.\nIt does a full hour for rural listeners each week day—and that’s a lot ot\nagriAUbooklet of \"Governing Policies\" has been printed by HILL. Stations\nering restating their own administrative or operational structure should ask for\ncopy. Also get the Organizational Chart which Frank Schooley has prepared.\nDirector Schooley and Ex. UAEB Executive Secretary, Jim Bbel have been out\nvisiting. Their jaunts, in the interests of football primarily, took them to Waldo\nAbbot and V,allace Garneau at Michigan on October 25, and to Bloomington on the day\nof the Illinois-Indiana football game, but Harry Skornia was absent. Jim Mies\nand his IfiEAA crew visited at Urbana on October 5. More of us should get around to\nsee how our colleagues are operating—and not wait for football as an excuse\nnecessarily."
}