{
  "id": "d888-26",
  "text": "University of Michigan • Ann Arbor, Michigan\nE. G. Burrows, Associate Director - Radio, and Manager, WUOM\nDecember l8QEU3£l 1961\nMr. Harold Hill,\nNAEB\n1436 Conn. Ave. NW\nL\nWashington 6, D.C.\nDear Harold:\nI have had our engineers check over the Acda letter advising on the\nbest equipment and methods to receive Radio Nederland broadcasts.\nAccording to them the information is good and accurate and they see\nno reason why such a note should not be distributed. There are, of\ncourse, alternatives to the equipment and methods recommended. For\ninstance, we have a better receiver than the one they recommend, but\nour receiving antenna, for reasons of space, building location, etc.\ncannot duplicate what they suggest.\nAt the moment. Radio Nederland is transmitting four times a week to\nus. The same program is transmitted on Tuesdays at 10:30 AM (EST) and\nagain at 2:15 PM (EST). That Another report is transmitted at 10:30 AM\nFriday and again at 2:15/ Presently we are able to receive the morning\nbroadcasts but the afternoon ones are almost inaudible. The reasons for\nthis we donrt know nor how long the situation/ willlast# Acda seems\nsufficiently cooperative to change times and frequencies for us when\nand if transmissions fail over a short period of time. In addition we\nare getting standby programs on tape#\nThank you for sending the information on the disputed clause in FCC\nregulations. I find the phraseology still very vague and puzzling. I\ndoubt very much that educational stations are paying attention to it,\nbut it certainly bothers us. It would seem to me that any series\nproduced under a grant or any program, like ’’European Review” from\nAcda, which we in turn supply to NAEB, is not specifically being\nprovided to us alone through the ausppces of another organization.\nA comparison of what the regulations are for commercial stations with\nthose for educational stations would seem to indicate that the FCC had\nsomething very specific in mind, but I donft still see what. One of\nthese days perhaps we can explore it more fully. In the meantime we will\nkeep our fingers crossed.\nCordially,"
}