{
  "id": "d888-42",
  "text": "June 8, 1962\nMr. J.W. Acda.\nHead Central Programme Service\nRadio Nederland Wereldomroep\nHilvarsum, Holland\nBear Hr* AcdaI\nI have turned Hr* van Eldlk'e letter over to our head of engineering\nand I am sure he will receive a reply to some of the more technical\nquestions raised*\nBill Harley*s statement to you that more HAKE stations are not using\nEuropean Review because the shortwave quality is often poor, is perhaps\nan oversimplification of the problem* It is perfectly true that during\ncertain months this past winter reception was poor and I doubt if much\ncould or can be done about it* Reception right now is near perfect*\nThe number of stations using the program from NAEB is about average for\nour network programs. Many NAEB stations (uafor tunately) do not seem to\nhave a great interest in wide news coverage or material from foreign\nsources* Another drawback is the relative timeliness of most European\nReview programs* On almost all programs there are references to \"today,\"\n\"yesterday\" or \"tomorrow\" and even though the programs are in the hands\nof stations around the country within a week, their news is already\ndated* I have tried every way I could think of, and within the limits of\nmy time, to promote the use of the program directly by stations with\nshortwave equipment* In several eases I have been successful# but not to\nthe degree that either of us might wish*\nIf I may digress briefly# NAEB has begun distributing (In addition of\nEuropean Review) a weekly 15-minute program from the BBC, London, and\none from Radio Australia, Sydney* These two programs - World Report and\nInternational Report - are designed as commentary on larger Issues,\nbackground information, and human Interest stories of a timeless nature*\nThere are occasional references to \"this week\" but even these are few.\nBoth programs are taped at the source and airmailed Immediately to NAEB\nheadquarters in Urbana* Both programs arrive within ?2 hours, are\nduplicated and mailed the same week* The cost to BBC and ABC is not large#\nat least in their terms, and is probably a great deal less than the\nactual cost of a shortwave transmission (though I have no figures to go on)*\nThe quality of the program is assured by the use of tape, and the programs\nare so produced that they are not dated within one week, and sometimes\ntwo or three*\nI do not wish to suggest by the above that you should terminate all\nshortwave transmissions to us or to this cotan try. Certainly WHOM is more\nthan happy - and we are not alone - to have these programs available and\nto be able to broadcast them within hours of their reception here* For"
}