{
  "id": "d888-47",
  "text": "August 2kt 1961\nMr* J.W. Acda,\nHead Central Programme Service\nRadio Nderland Wereldomroep\nHilversum, Holland\nDear Mr* Acdat\n\"European Review\" was received here on August llj. loud and clear#\nperhaps the best signal we have had so far* I am confident that we\nwill have good reception tomorrow* I have had word that WBAA at\nPurdue University, Lafayette, Indiana had good reception of the\nprogram last week also* WHA, University of Wisconsin, Madison,\nWisconsin, has equipment and will try a pickup tomorrow though they\nmay be too far outside the main path of the signal*\nI am extremely flattered and honored by your invitation to attend\nthe opening of your new studios at Hilversum* Bob Jones and his wife\nhave told me of your hospitality and describe the new facilities in\nglowing terms. Unfortunately because of personal and business\ncommitments I am going to have to decline your most generous offer.\nThis is Just about the time that the University plans to go on the air\nwith a new radio station In Grand Rapids, Michigan* The headaches\nalways attendant upon inauguration of such a station will require all\nof ray time.\nI don’t know, of course, what other invitations you have extended* It\nwould certainly be significant to all of us to have a representative\nof U.S. educational broadcasting at your ceremonies. Perhaps you would\nconsider inviting Mr. William Harley, president of NAEB, whom you met\nin Washington* His duties in connection with the forthcoming national\nconvention of NAEB the latter part of October might well prohibit his\naccepting* But I am sure, since WXJOM cannot be represented Individually,\nthat we would all look with favor on someone representing educational\nbroadcasters collectively*\nTwenty-five years ago I spent considerable time In Europe* One of these\ndays I hope to return for an extended visit* You can be assured that\nHilversum will be on my itinerary* In the meantime we will continue to\nstay In touch via shortwave* Thank you again*\nE*G. Burrows\nManager, WUOM"
}