{
  "id": "d818-101",
  "text": "-2-\nI am glad about Skornia. I certainly approve that arrangement and also the\nappointment of Schooley as acting executive director on a temporary basis until\nJune.\nI am especially sorry I can't be with you to discuss the subject of training\ntelevision personnel. Such a subject is pretty hard to review by mail, so I won't\nhave much to say about it here except to repeat my sentiments in favor of doing\nprojects locally which would combine on-the-air-work with training programs* Coming\nback to our symphony telecast, which is pretty prominent in my thinking right now,\nit is providing us with the best training in television production that anyone could\nimagine. We have one or two other series going on local television stations, and the\npeople on our staff working on them are also learning a great deal*. It is for that\nreason that I am inclined to think of a combination workshop and broadcast series,\nsomething that would be possible in any place which had access to television stations\nas well as some workshop unit* But when you discuss this problem in your meeting,\nyou may find my procedure quite impossible to follow* so don't let anything that I\nhave said stand in the way of drawing up any plan which you in your group discussion\nmay arrive at*\nIncidentally what is the relationship between the television training program\nyou mention on page 2 of your letter and the FAE plans for training television\npersonnel about which some of us met with Hudson, Blakely, and others in New fork\nin November? It seems to me FAE intends to provide some kind of internships for\ntraining in the very near future. Would this plan about which you write be a part\nof that plan or something different?\nSometime soon the Executive Committee and/or the Board of Directors is going\nto have to look into the matter of our Fulbright scholarships. Grapevine report\nseem A to indicate that there will be one to England but not for the continent. What\nhave you heard about this? In any event, we've got to be sure to avail ourselves\nof the best possible advice in selecting the best people who represent us in this\ncapacity* I think there are two things we have to be sure of5 we get people who\nwill meet the general requirements for Fulbright scholars imposed by the committee's\nchoosing people who work in the other fields* and that we do so with the maximum of\nobjectivity* Specifically, 1 think it is important that the people we send over to\nEurope compare generally in caliber and type with the Fulbright scholars who go over\nto work in fieldssuch as biology, history, English literature, etc., etc. You know\nray constant btotfpSjfgJon the subject of status for our own group within our institutions.\nWell, we want that within the fulbright community, too, and we aren't going to get it\nif we send over a station announcer or program director who doesn't fit into the\ngeneral Fulbright pattern. I realize, of course, that we have got to get people who\nhave a background in broadcasting and that folks with a dozen degrees after their\nnames may not understand our problems at all. But we Ho want those who will represent\nus well among Fulbright people. We also want to avoid injection of personal factors\nin the choice of these people. It would be most unfortunate — I am sure you would\nagree — if the selection of Fulbright people became a log-rolling operation within\nthe Board of Directors. The fact that one or more members of the Board might be good\npeople to choose is all the more reason why we should set up some system for choice\nwhich would result in maximum objectivity in selection and the avoiding of any personal\nclashes among members of the Board. For this reason I suggest that we call upon some\npeople who are generally familiar with Fulbright procedures. George Probst's friend\nat the bniversity of Chicago, Walter Johnson, with whom I believe George had his talks"
}