{
  "id": "d818-13",
  "text": "-12-\n-, and Stanton, Frank, eds.. Communications Research 19U8-\n19b9• New York: Harper & Brothers, 19h9. xviii /' 332.\nMerton, Robert K., \"Progress in Communications Research: Patterns of Influence:\nA Study of Interpersonal Influence and of Communications Behavior in a Local\nCommunity.\" pp. 180-222 in ..Lazersfeld, Paul F., and Stanton, Frank eds.,\nCommunications research 19118-19U9. New York: Harper & Brothers, 19h9•\n-Mitchell, A. S., \"Effect ,of Radio Programs on Silent Reading achievement of\nNinety-One Sixty Grade Students.\" Journal of Educational Research, XLII\n(February 19U9)> pp. U60-70.\nRicciuti3 Edward A., A Study of Listeners and Nonlisteners to Various Types\nof Radio Programs in Terms of Selected Ability7Attitude, and Behavior\nMeasures. 19l*$Q (Doctoral Dissertation, Fordham University) ”\nSandage, C. H., Qualitative Analysis of Radio Listening in Two Central Illinois\nCounties. Urbana: University of Illinois, I9I4.9. ?'. 57*\nSchramm, Wilbur, \"The Effects of ’Mass Communications: A Review.\" Journalism\nQuarterly, XXVI (December 19U9), pp. 397rii09.\nSiepmann, Charles A., and Reisberg, Sidney, \"To Secure These Rights: Coverage\nof a Radio Documentary.\" Public Opinion Quarterly, XII (Winter 19U8-U9),\nop.61*9-58. -\nSmythe, Dallas W., Smythe, Jennie N., and Hyle, Howard H., An Inventory of\n(Noncommercial) Educational Radio Programming. Urbana: Institute of\nCommunications Research, University\"-oT Illinois,\nTyler, Tracy F., \"Significance of Radio Research.\" Association for Education\nby Radio Journal, VIII (January 19U9), p. U9•\nWhan, F. L., The Kansas Radio Audience of 19h9. Wichita: Municipal University\n-- The 19h9 Iowa Radio Audience Survey. Des Moines: Central Broad¬\ncasting Col, march 19h$'» P. 5l / 27.\nYoung, James R., \"Understanding Radio News.\" Journalism Quarterly, XXVII\n(Winter 1950), pp. 19-23.\n8. Instruction in Radio and Television\na.General Text Books\nDrewry, John E., ed., Contei. -^rary Journalism. Athens: University of Georgia\nPress, 19U9. P. 12T.\nOmmanney, Katherine Anne, and Ommanney, fierce C., The Stage and The School.\n2nd. rev. ed. New York-: Harper & Brothers, 1950. p. xvi / 571.\nReinsch, J. Leonard, Radio Station Management. New York: Harper & Brothers.\n1950.---\nSchramm, Wilbur, ed., Mass Communications. Urbana:. University of Illinois Dress,\n19U9, P. xi / 552 “ ^"
}