{
  "id": "d818-131",
  "text": "I. PBPJKCTIOH OF PROGRAMS TO BT$ /-'BO-DtJCEB AT KPTA AFP\nMAPI AVAILABLE TO THIS TAPS WKfWOM, OF THE MAKB\nMUSIC\n(o\nTHIS CQIPQu : t A series of six approximately one-hour programs with out¬\nstanding contemporary composers. These programs are prepared under the\ngeneral direction of Americo Chiarito, ItPFA'e Music Director, and include\ninformal interview's with compeers analysing and comment lag on their own\nand their contemporaries* work; performances, both live and recorded, of\nthe composer's work with explanatory and critical program notes by the com¬\nposer himself. Present plans call for a series of six programs with the\nfollowing composers:\nDarius Milhaud\nBoger Sessions\nErnst Krsmek\nJohn Edmunds\nAndrew Imbrie\nmis Kohs\n4\nTOWARD A CKEaTIY- MUSIC; A series of nine pro rams, ranging from twelve to\ntwenty-five minutes each, in which the experimentalist, Harry Partch, explains\nthe basis of a musical philosophy that led to his construction of a new\nscale and the invention of radically new musical instruments, This series\nrepresents a summary of thirty ye«rs of musical research by Harry artch\nwho is one of the most controversial figures in the contemporary music\nworld. The three concluding programs in the series contain examples of Mr.\nPartch's compositions using the forty-three tone scale. The following\nis a listing of program titles and the times for each program:\nCreativity in Music - l6*\nEducation and the Mew Instruments - 17*\nEducation and the Record Repertory - 12*\nEducation and Acoustics - l6*\nThe Writers on Music - 13*\nMusical Perspectives - l6*\nMy Instruments - 21*\nCastor and Poilus (music) - 24*\nThe Oedipus Dance Music - 25*\nOilOfeAju COKCJSBTS: A series of thirteen one-half hour programs of choral music\n. Involving the Berkeley Chamber Singers and choral groups from Stanford\n* University, San Jos© State College, Modesto Junior College, University of\n0 California, College of the Pacific and Dominican College. The programs\nwill include both traditional and contemporary works for chorus.\nSTKIflQ QffAKTgT K£H:;AK3ALS: Through an arrangement with members of the Quartet\nand the Uhlverslty of California, KPFA has be mi given permission to record\nd the open rehearsals hold hy the Orlller String Quartet. These are \"unst gad*\n* rehearsals and contain all of the exchanges, humorous and otherwise, between\ny n 0 members of the Quartet. There will be between four end five program hours\nin the entire rehearsal series."
}