{
  "id": "d818-132",
  "text": "Pa s* 2\nMUSIC (Cent.)\nCORTJMPQRAHY MUSIC? A. program series* to be recorded la the KFFA studio*.\nfeaturing pierform&nces of contemporary music by student performers of out¬\nstanding ability. The series will place particular emphasis u on premier\nperformances ef contemporary music and will serve both as an outlet and an\nl incentive for new voile, particularly for younger composers. In most in-\n^ stances the performer will have had the opportunity to study the score with\nthe composer. It is expected that this series will number five or six half-\nhour programs.\n/\nTHE •: It .J'AH.-'D PlAM): One program only, approximately one hour in length, with\nMare Aje&ian, internationally known pianist, explaining and demonstrating\nJohn Cage’s music for tho prepared plane* The program will Include the\nstop by step preparation of the instrument and the performance of works\nfor the prepared piano. ^\nSOHG ALIVE: A series of twelve twenty-minute programs on American Folk Songs and\nBallads, reduced in cooperation with the folk song collectors Urn %kin\nand Sidney Hobertson Cowell. The series will include new field recordings\nof many of the singers from whom modem scholars have derived the majority\n©f the songs included in their collections. The personal collections,\nrecorded In the field on portable, hl/sh fidelity tape equipment, of Sam\nBakin and Sidney Cowell are probably the most extensive folk song collection*\navailable outside of the Library of Congress Archive of American Folk Song.\nAuthoritative commentary on the songs and ballads included in the program\nseries will be supplied by Mr. Hekla and Mrs. Cowell. This will be the\nfirst attempt, based on field recording®* at a truly definitive series on\nAmerican folk songs.\nPUBLIC AFFAIRS\nAFRICA: A dneumaptary series concerning the development of African independence\n*mov«aatttslnmrious parts of the continent. Program material already\nassembled Includes interviews with key persons In relation to the resistance\nmovements. The completed series ineludl^-vniiHfC., supplementary narration\nand editing will amount to six half-hour programs• The following is a list\nof participants in the series:\nSouth Africa\nG. P. Jooste, Ambassador from South Africa to tho Uhited States and\nChief U. N. delegate from South Africa.\nMichael Scott, International Leaguo for the Sights of Man and a\nparticipant in South African Rest stone a movement.\nGeorge Houser, Executive Secretary, Americans for South African\nResistance.\nCentral Africa\nKlrilo Japhst, spokesman before the United Rations Trusteeship\nCouncil, Wa-M©ru tribe, Tanganyika."
}