{
  "id": "d818-134",
  "text": "urmtiwm aid drama\nMW WRITING: A series of ten half-hour program# presenting readings from the\nnew work of both well known and lesser known American writers. Emphasis\nin the series will be upon good program production* and the author’s own\nvoice will be used only in those instances wh re he is an exceptionally\ngood reader of hie own work. Among the writer* contributing to this eerie#\n” are the following:\nRobert Duncan\nWill lam Iverson\nRobert Horan\nWeldon Xee«\nJosephine Mile#\nHenry Miller\n.Rosalie Moor#\nKenneth Patchen\nKenneth Ferroth\nFred Safier\nMO mm v >'h$4 DKAMA: A Studio production of verse plays by the American poet,\nKenneth Rexroth. Thar* are three plays in all— h&edra, Ii&igonla la AutM.\nand Beyond the Mountains. The eerie# will number throe program# of approx¬\nimately forty-five minutes each.\n2\nCKIlPRBg'S PB08BAHS\n/\nQliCS If; OK A TIH d A story eerie# for children from six to sixty. A selection\nof twelve Irish folk and fairy tales a# told from memory by Josephine\nGardner, easily the most outstanding traditional story teller living in\nthis country. Programs In the eerie* vary In length from twelve to twenty\nminutes each. Story titles include: The Wee Bed Man. The Twelve Magic\nWindows. The King of Ireland’s Son. Feather of My Wing* and others.\nBOBIR SON CBtlSOK: A dramatised reading in approximately twelve half-hour epi-\neodes by”Charles bevy, similar in production technique, including sound\nof foots* to the production of Treasure Island, which was included in the\nWinter 1952 offering of the HAt# Tape network.\na\nQIlMAPFriPt A dramatised reading in twenty or more episodes of the novel by\n\"\"\"' Robert Louis Stevenson. Single episode# will vary between thirty and\nforty-five minutes in length. The production team headed by Charles Levy\nha# gained valuable experience in It# productions of Huckleberry Finn*\nTreasure Island, and Robin Hood, and it is expected that the production of\nKidnapped will mark an improvement over these previously successful pro¬\nductions.\nv>\nPlCTURl STORY: A program employing dramatised reading of stories selected for\ntheir particular suitabll ty in evoking picture Ideas. This program format\nhas proved uniquely successful in f?FAf# broadcasts for children. The pro¬\ngram\" i« designed specifically for primary school children. The readings are\nbroadcast end the children send in picture# illustrating the story. On sub¬\nsequent programs the station announcer acknowledge* receipt of the picture#.\nThirteen fifteen minute programs.\n■i"
}