{
  "id": "d818-17",
  "text": "-16-\nDragoo, K. L., ’’Educational Stations of the Nation: KALW.\" Association for\nEducation by Radio Journal, VIII (February 19h9), pp. 69-70.\nDunn, A., \"Experimental Teaching in Radio Listening.\" English Journal,\nXXXVIII .(April 19h9), pp. 19U-7*\nDye, L. F., \"Home Nursing on the Air.” Practical Home Economics, XXVII\n(May 19h9), PP* 299-60.\nElwell, G. A., \"Children Decide in Portland, Maine.” Association for Educa¬\ntion by Radio Journal, VIII (April 1949), pp* 90-2..\nFisher, S., \"Credit Courses on the Air.\" Education, LXX (December 19h9) s\npp.225-7*\nFisher, Sterling >7., \"College by Radio.\" Variety, CLXXIII (January 5, 19U9),\nP* 96. -\nFoster, C., and Langerman, R. L., \"Physical Education on the Air.” School\nActivities, XXI (November 19U9), pp. 98-100.\nGitlin, I. J., \"Communications Mediums Explain and Illustrate Nuclear Energy.\"\nJournal of Educational Sociology, XXII (January 19k9), pp* 327-30.\nGoldstein, H., \"Air rraves for Adult Education.\" Adult Education Journal, VITI\n(January 19^9), pp. 60-3*\nHall, Gertrude M., \"Radio in State Teachers Colleges.\" School and Society,\nLXIX (January 22, 19it9).., pp. 61-3.\nHayakawa, S. I., \"The Task of the Listener.” ETC., VII (Autumn 19h9),\nHelman, E. F., \"Educational Stations of the Nation: WBOE.\" Association for\nEducation by Radio Journal, VIII (January 19U9), p>. 53-6.\n-:-—.—9 \"WBOE Broadcasting.\" Educational Music Magazine. XXVIII\n(January 19U9), PP* 17 /*\nHunter, Charles. F., \"The Radio program Planning Course.” Quarterly Journal\nof Speech, XXXVI (April 1950), pp. 209-13*.\nJacobs, M. G., \"Are You Listening?” Elementary English, XXVII (January 1950),\npp. 19-22.\nLamb, H.' D‘., \"Educational Stations of the Nation, WTDS.\" Association for\nEducation by Radio Journal, VIII (Anril 19U9), pp. 88-90.\nLardie, Kathleen N., \"Educational Stations of the Nation, 17DTR.” Association\nfor Education by Radio Journal, VIII (March l?h9), pp* 76-8\nMalanson, W., \"Flit Low Power, Low Cost; New 10-mile Voice for Schools.\"\nScholastic, LVI (February 1, 1950), pp. 30T /.\nMarsh, L. T., \"Emergency Radio Program.\" Recreation, XLIII (August 19h9),\nP.265. ‘ 7\".\nMcCarty, H. B., \"As It Looks from the State Radio Council.\" Wisconsin\nMedical Journal, (May 19ii9)."
}