{
  "id": "d818-18",
  "text": "' .-I?.\".\n-t ’’Radio in State Service.” State Government, XXII (November\n1949), oo. 260-2. --■---\nMcGilvrey, M. J., ’’Radio and the Schools, Achievement and Challenge.”\nAssociation for Rlucatlon by Radio Journal, VIII (February 19U9), po. 63-4.\nMiller, R. A., \"Radio Roads to Reading.” Education, LXIX' (May 19h9) PP. 595-8.\nMorrison, Jack, \"Radio Instruction in Southern California High Schools.”\nHollywood Quarterly, IV (Summer 1950), pp. 392-U02.\nNovotny, L. E., Education and the Mass Media of Communication: Radio.\"\nElementary English, XXVII (April 1950), pp. p4o-6 /.\nOlson, 0. Joe, ed.. Education on the Air. Nineteenth Yearbook of the Institute\nfor Education by RadTo~. Columbus: Ohio State University, 19U9. ?. vii /\nWH\nParker, E. C., \"Radio and Television in Religious Education.\" in Lotz, P. H.,\ned., Orientation in Religious Education, pp. 164-70. :\nRamsey, Mm. H., \"Educational Stations of the Nation:- KCVN.\" Association for\nEducation by Radio Journal, ix (Aoril 1950), pn..90-l. \" '\nRaymond, John C., and Frazier, Alexander. \"Daytime Serials as Laboratory\nMaterial.\" English Journal, XXXVIII (December 1949), pp. U63-7.\nRidenour, N. A. \"Community Education through ^ress, Radio, Films and Drama.\"\nMental Hygiene, XXXIII (January 1949), no. 71-7.\nRoss, Harold T., \"Can the Colleges Use Low Power FM?\" Quarterly Journal of\nSpeech, XXXVI (February 1950), pp. 6l-4.\nSartain, Harry, andPrunty, Evelyn, \"SOS—School on Saturday.\". Association\nfor Education by Radio Journal, IX (March 1950), or*. 76-7. “ \"\nSasman, L. M., \"Publicity by Radio.\" Agricultural Education Magazine, XXI\n(June 19h9), p. 271. ---~-\nSkinner, J. ?., \"Atlanta’s Radio Education Plans. \" Association for Education\nby Radio Journal, VIII (February 1949), pp. 67-8. ' “ ' \"\nSowers, A., \"Reaching Parents by Radio.\" International Journal of Religious\nEducation, XXV (April 1949), pp. 10-11. ‘ ‘ “\n-, \"Teaching Family Relations by Radio.\" Journal of Home Economics,\nXLII (January 1950), po. 16-17.\nStrickler, W. M., \"Louisville Experiment in Education by Radio.\" Association\nfor Education by Radio Journal, VIII (November 1948), op.27-8. Same,\ncondensed in Education Digest, XIV (February 1949), op.48-9.\nTemple, W. J., \"New Low-Cost FM.\" Scholastic, LIV(April 6, 1949), p. 28t.\nTravis, J. G., \"education in the News.\" Nation’s Schools, XLIII (February 19491\npp. 60 /. — .'"
}