{
  "id": "d818-187",
  "text": "Box 2002\nUniversity, Alabama\nSeptember 23, 195U\nMr, Burton Paulu\nRadio Station KUOM\nUniversity of Minnesota\nMinneapolis lU, Minnesota\nDear Burton:\nI have been waiting for a long time for your letter of September 20\nsaying, \"The Paulu family is back!” Now I shall be waiting eagerly\nfor your reactions to the year in the U.K. I know it was a wonderful\nexperience for you and the family# I know Frances and the youngsters\nare glad to be back in their lovely home and I am sure you are glad\nto be back at the reins at KUOM*\nI suppose that I need not tell you that all of us are immensely\nconcerned that the VHF channel in Minneapolis - St. Paul has not been\ndeveloped nationally. It is beginning to stand out. I feel more\nconfident now that you are at home that something can come of it.\nI'm eager to see you and hope we may soon have a long chat concerning\nNAEB. I have missed your wise counsel and advice during the past year#\nMany things are at a point of resolution and many important decisions\nare coming up at the Fall Convention* I hope to schedule a rather\nlengthy Board meeting to discuss again directions for the next ten\nyears. The past two years have been necessarily a period of waiting\nand maneuvering. Now, decisions have to be made and they must be the\nright ones.\nMiss Moyra Xouas, Staff Producer for the BBC, is now with us for the\nnine months ahead. We are extremely pleased to have been able to\nwork out an arrangement whereby we coula secure such a person at the\nUniversity of Alabama* I hope you ana she may have an opportunity to\nexchange reactions at the Fall Convention*\nMrs. Ausmus is not teaching for the first time in eight years and is\ncurrently having a well deserved rest. The other two important members\nof my family are happy and busy.\nOur own TV development here is moving rapidly and we expect to be on\nthe air from our own studios by early November# As you can easily\nimagine there is much noise and confusion, much coming and going."
}