{
  "id": "d818-202",
  "text": "^ MEMORANDUM\n^(effective January 1, 1957): December 21, 1956\nTO: NAEB EXECUTIVE COMMITTEE^®lehard Hull, Vice Resident-elect; Jack\nMcBride? Secretaryselect5 Robert Colman. Treasurer)5 and Harry Skornia,\nExecutive Director\ncC1__To_:iBoard of Directors (as of January 1, 1957) (for their information)\nFROM; Burton Paulu, President-elect\nFirst ? let me tell you how happy I am to have such a fine set of officers\nand directors to work with during 1957* We should make a good team, with\nche mixture of youth, enthusiasm and experience which we collectively represent\nI have just returned from the second of two trips undertaken to orient\nmyself for my new duties as NAEB President. First I went for a couple of\ndays to Urbana to talk to Frank Schooley and Harry Skornia. Then I took a\nsomewhat longer trip to Washington, New York, East Lansing and Ann Arbor. In\neach place I talked to people holding various points of view on educational\nbroadcasting and NAEB. Both trips were well worth while.\nOne of the things I am very anxious to do upon succeeding to the\npresidency is to revive the Executive Committee which met rather frequently\nduring the Siegel and Ausmus regimes. You will recall that during their\nterms of office, the committee, mad© up of the president, vice president,\nsecretary, and treasurer (the Executive Director also attended) met every\nthree months or so to review the basic problems of the organization and to\nadvise the president. This procedure I should like to reinstate. I want\nand need your advice; this should involve more people in the decisions of\nthe organization; should help provide continuity in policy; and should\nfacilitate liaison between the officers and the Board of Directors. Such a\ncommittee, of course, cannot reverse the actions of the Board of Directors,\nbut it can make some interim decisions. (It xvould still be possible, in\nthe event of a major policy matter, for the whole Board to be convened."
}