{
  "id": "d818-205",
  "text": "14 Gregory Hall\nUrbana, Illinois\nDecember 26, 195&\nDr. Burton P&ulu\nK U 0 M\nUniversity of Minnesota\nMinneapolis, Minnesota\nDear Burton:\nJCET Meeting did little except approve budget that\nRalph had prepared, in line with approval given previously by\nthe JCET Executive Committee. Considerable time spent in\ndressing up, but no fundamental changes made. Amount was\nsame as Ralph had furnished prior to meeting, 139,960, which\nis same as ,140,000 received for operations tills year. /as\ndecided on consideration and motion by Mark Shinnerer that\nwe would not request three-year grant, but would indicate\nthree-year sup ort would be ducky.\nRest of time was spent discussing various spots in\nUSA where development is anticipated, or where shots are being\ntaken, including special predicament of Chairman Jorgensen.\nSubsequently, on December 28th to be exact, JCET counsel will\nfile reversal of field (based upon engineering studies) changing\nJCET position on de-intermixture for Hartford, Conn.\nweather was bad, and Jorgensen arrived around 11 a.m.,\nand Bchlnnerer got in about 45 minutes late. Fuller wasn't there,\nNewburn wasn't there. Snowden wasn't there. Crippen and\nChristiansen represented Fuller and Newburn, respectively.\n2. On World Brotherhood Conference, I'd say it de¬\npends upon what happens, but I'm inclined to your view. If\nwe h^ve someone in Hew York area, fine. Takes lots of money,\non which there might be some doubt of over-all value.\n3. On John Dunn, I frankly don't have a good sug¬\ngestion. I wrote the best I could. I'm afraid writing won't\ndo much good, and certainly arguing with John by letter won t\nhelp. I'd almost suggest similar technique, namely brief note\nof regrets—sorry for first time in history of NAKB which had\nas one of itsoriginators, Oklahoma, the Sooner State won t\nhave John Dunn in NAEB. Regrets from us, and a proper timing\nof some opening in the future may bring him back. One never\nknows........Just arranged with Al Partridge to handle NAEB\nexhibit and represent NAEB at AETA conference in Chicago (in\nbetween couple of calls on our TV suit)."
}