{
  "id": "d818-43",
  "text": "- 43 -\nTyler, Tracy F., \"How About Wired Television?\" Association for Education\nby Radio Journal, VIII (February 1949), p. 61.\nw\"Television Poses Important Problems.\" Association for\nEducation by Radio Journal, (March 1949), p. 73.\nTyrell, W. J., \"Television in the Social Studies.\" Social Education, XIII\n(January 1949), pp. 25-6.\nWetter, A. H., and Sable, M. A., \"Television Is Here to Stay.\" National\nEducation Association Journal, XXXVIII (September 1949), p. 462.\nYard, C. L., \"Experiment With Television, State Teachers College, Millersville,\nPa.\" Industrial Arts and Vocational Education, XXXIX (March 1950),\np. 137.\nTelevision in Foreign Countries\nAnonymous, \"Britain Opens World's Most Powerful TV Station.\" Radio and\nTelevision News, XLIII (March 1950), p. 132.\n\"Future of Television.\" Economist, CLVII (August 6, 1949), pp* 287-8.\n———, \"School Children and Television.\" Times Educational Suppelement,\nMDCCCXX (March 17, 1950), p. 197.\n-—j \"Television: The Outlook for British Manufacturers in the Imminent\nBattle for World Markets.\" Scope, (September 1949), pp. 68-77.\n——, \"Television Session, June 8, 1949.\" Industrial Canada, (July 1949),\npp. 186-99.\n--\"Television; Visual Educationist's Dream.\" Times Educational\nSupplement, MDCCLXXI (April 9, 1949), p. 22.7.\nCrampton, C. W.,. \"The Advertiser Looks at Video.\" Canadian Business,\n(March 1949), pp. 50-2 /.\n---9 \"Canada's Television Tease.\" Canadian Business, (January\n1949), p. 38-40 /.\nCross, Peter D., \"British Television.\" Britain Today, (July 1949), pp. 15-19.\nDort, P. H., \"The BBC Television Newsreel.\" BBC Quarterly, III (January 1949),\npp. 229-34.\nGorham, Maurice, Television. Londons Percival Marshall, October 1949.\nJohnston, D., \"Television and the BBC.\" Spectator, CLXXXIII (July 22, 1949),\np, 102.\nSilvey, Robert, \"Television Viewing in Britain.\" Public Opinion Quarterly,\nXIV (Spring 1950), pp. 148-50.\nStone, C. W., \"Plan Now for Television.\" Food for Thought, (January 1949),\npp. 5-8 /."
}