{
  "id": "d818-90",
  "text": "University of Minnesota\nGeneral Extension Division\nMinneapolis 14\nRadio Station KUOM\n770 ON YOUR DIAL\n2k December 19S>2\nMr. Janes S. Miles\n119 Gregory Hall\nUniversity of Illinois\nUrbana, Illinois\n■4\nDear Jim: j /\nHere it is the morning of December 2k and I am dictating a reply to your\nimportant memorandum of December 19 relative to the television training project,\na project which you asked me to reply to so that you would get my comments by this\nmorning. I an sorry for the delay, but I just'couldn*t make.it before now.\nI like very much the idea of developing thfse training programs. We certainly\nwill need sette people. Especially, we are \"going to need experienced administrators\nto head these stations: ray three days down at the Atlanta conference earlier this\nmonth pointed that up as never before. \\ \\ 7 / ^\nOne of our problems is howto train people for Educational television end not\nhave them run off and sell their services to the highest bidding commercial station!\nI suppose we*11 just have choose our,subjects ckrefully and then hope for the best.\n/ j \\ T V v\nGenerally speakihg, tjiife is lay thought a/bouUthis. I think that the ideal setting\nis one where you ^r«h'\"get peiple to go ori the air, live, combining their live air pre¬\nsentations with ^/opportunity t^ work in a closed circuit situation. Looking at this\nfrom the standpoint of developing opeEuoft training center at the University of\nMinnesota, X like a procedure Somewhat'as follows:\n| \\\nSupposing* we go to one of the two local commercial stations and get time on the\nair for a series or programs.; (We already have one half-hour series on WC CO-TV j and\nif KSTP ever settles its ...strike, we should be able to get a regular series on their\nair too.) We would,Jheq^t&ld the project around a series of actual telecasts, and\nclass members would come as close as union rules and their talents permit for the\nactual business of planning and presenting these shows on t he air. We would use our\nclosed circuit facilities here ©t the University for rehearsing and trying camera\nshots, etc., for the air series and would also center about this equipment various\nkinds of projects which would not necessarily have any direct relationship to the\nair shows.\nThis procedure, I think, would have the advantage of combining the motivation\nto be derived from going on the air with actual workshop conditions. One reason\nthat X like this idea is that the symphony television project which is now in full\nswing is giving us at KUOM the best chance to learn television production we’ve ever\nhad. As of the moment, Dawson, Irv Fink, Holmberg, several of our engineers and\nseveral of our miscellaneous employees and I are putting in what amounts to full time\non the series; and other members of our staff are going to be in on it before very\nlong. Just last night, for example, Brets and I worked for three hours choosing\ncamera shots for the first movement of the Schubert Unfinished Symphony. All of this\nhas been teaching us a great deal about television production and is doing so much\nbetter than if we were getting ready for a kinescope or a closed circuit presentation."
}