{
  "id": "d818-92",
  "text": "MEMORANDUM\nDecember 22, 1952\nTO: president J© L© Morrill\nFROM* Burton Paulu, Manager of KUOM\nSUBJECT: A proposal for the joint operation by the Minnesota educational\ncommunity of one or more noncommercial educational television\nstations*\nIn any plan for one or more noncommercial educational television stations\nfor Minnesota* the determination of the licensee must be u basic consider¬\nation* Furthermore, any. proposal for educational television in Minnesota\nmust provide adequate pcrtieipation at the policy level for the state* s\nentire educational community0\nThe proposal. has been made that the University of Minnesota serve as\nlicensee of these stations* Under thia proposal the participation of other\neducational institutions, school systems, agencies and groups can and should\nbe definitely assured through the establishment of a Minnesota Educational\nTelevision Commission which would play an authoritative role in policy\ndetermination*\nA« BASIC LEGAL RKQUIREMEMS FOR THE LICENSEE\nEvery broadcasting 3tation roust have a licensee who thereby assumes certain\nresponsibilities before the law©\n(1) All stations must be operated in accordance with the provisions\nof the Commuicatlois Act of 193L and the Federal Communications Commission’s\nRules. Among other things these require that the licensee be ultimately\nresponsible to the Commission for the station’s program output end technical\noperation. This responsibility cannot be shifted to anyone else; the\nlicensee therefore must be prepared to undergo any penalties assessed\n{gainst him by either the FCC or the Federal Courts as a result of violations\nof the Communications Act or the FCC rules*\n(2) The Commission^ Rules also provide that the licensee of a non¬\ncommercial educational television station be prepared to 3erve the general\neducational television needs of its entire area} in other words, such\nlicensee could not operate solely with reference to its own immediate\ninterests* Among other things it must make air time available to other\neducational groups and agencies.\n(3) Many legal rasponsibilities stemming from other sources than\nthe Communications Act of 193U also must be borne by station licensees.\nThus a licensee must comply with the copyright laws or be subject to civil\nsuits for their infringement. He also is subject to libel and slander suits\ngrowing out of material he may have broadcast. In addition to these matters\ndirectly concerned vith broadcasting ha also i3 subject to neny legal require**\nments of a more general nature."
}