{
  "id": "d818-96",
  "text": "University of Minnesota\nGeneral Extension Division\nMinneapolis 14\nRadio Station KUOM\n770 OX YOUR DIAL\nMr* Graydon Ausmus\nStation WUOA\nUniversity of Alabama\nUniversity, Alabama\nDear Graydons\nI have your letter of December 18 relative to the executive\ndirectorship and the executive committee meeting which you proposed.\nI would be all for Harry Skornia if he is willing and available\nto take the job. I agree we should not wait longer than June 1; the\nquestion of how long we wait of course depends upon how pressing things\nare, and I don't suppose June 16 is any worse than June 1, but certainly\nwe shouldn't go much beyond that if we can help it, — and if we can\nget it done sooner, so much the better!\nI would certainly go along with the idea of having Frank Schooley\ndo the job in the interim between Miles' departure and the new executive\ndirector's taking office. I agree that a division of responsibilities\nbetween Frank and Jim would not be desirable; Jim can be available for\nconsultation, but decisions should be made by one person, not by two.\nI would also go along with the reconstitution of the committee.\nWe are making progress on our state network project and also on our\nsymphonyLtelecast series; but both of these will require tremendous\neffort on the part of all of us at KUOM, and I certainly wouldn't be\nable to do justice to the job of looking for an executive director\nat this point.\nSo far as general advice to the new committee goes, assuming that\nSkornia is not available, that is—I think we may make a mistake if\nwe look too high. There is, after all, an important basic housekeeping\njob that has to be done; and if Adkins or Crabbe can do it, then I'd\nbe for hiring them or somebody like them. Frankly I think that the\nquestions about the new NAEB headquarters raised by the setting up of\nthe new FAE television-radio production and distribution center may\nmake this position somewhat less durable than we had originally thought\nand may make it hard to get someone of Greenlee's caliber.\nAs far as the executive committee meeting goes, I would not be\nable to leave Minneapolis until after January 25. That will be the\ndate when our telecast series takes a little break; we have broad¬\ncasts on January U, 11, 18 and 25, the next one not coming until\nFebruary 22. I may be able to get away for a meeting or two shortly\nafter January 25, but certainly not before then. Furthermore, the\nlegislature meets on January 6, and I will be concerned with the plan¬\nning and launching of the bill which corresponds with the state network."
}