{
  "id": "d665-11",
  "text": "*• Professional .Advancement\nThis activity will be concerned with the determination and advance¬\nment of professional standards. Through it, educational institutions will\ncooperatively identify and support standards in the training of educational\nbroadcasting personnel, the training of technicians, the organization of in¬\nstructional materials, basic values of production, and the basic processes of\nutilization.\nSuccessful integration of electronic communications and education\ndepends on the development of a core of professional personnel with the philo¬\nsophical concepts and practical understanding adequate to that process. There\nis now no agency which identifies, stimulates, encourages, and recognizes\nstandards of professional excellence in tits area,\nThe standards set will serve further to stimulate and interest edu¬\ncational personnel generally, and prospective contributors to this field, in\nbecoming active participants in the over-ell effort to advance education through\nthe intelligent use of educational technology. To this end, it will, in cooperation\nwith institutions of higher education, develop courses of study in the media and\ntheir responsible uses.\nProfessional excellence will be encouraged at all levels of educa¬\ntional broadcasting. Provision will be made for recognition of individuals,\neducational institutions, and industrial organizations who have exemplified,\nmaintained and supported the adopted standards.\nEfforts will be made to encourage and initiate publication of articles\nand reports devoted to the identification and demonstration of the standards,\nB. Educational Brgadcaattng and Civic Education\nToday we are increasingly aware of the significance of the communica¬\ntions media for the survival and growth of the American society.\nSince our ideology emphasizes the primacy of the people, it is important\nthat civic education be carried on across a wide base of the population; hence,\nthe mess media, of which television is the most powerful, has an Important\nresponsibility end opportunity in this respect.\nHie aspiration which held our country together at the beginnings must\nbe the same one which inspires it now—the challenge of providing the model\nof a free government Impressive end inspiring to ell men everywhere.\nThere was a time when it seemed certain that the case for free govern¬\nment was won. Now the future of freedom is far from sure. If Americans are to\nmake freedom a reality rather than rhetoric, it must be in the context of effective\nparticipation in decision. With leisure increasing, the question will be whether"
}