{
  "id": "d665-8",
  "text": "- 4 -\nand perpetuation of our society.\nHie introduction of ETV coincides with a period of emergency in education;\nrepresented by rapidly expanding enrollments and consequent teacher and\nfacility shortages, and by international tension which has focused attention\non weaknesses in our eduestlonei system, particularly, the failure to in¬\nstill the dedication and commitment to democratic principles which Americans\nrequite for effective involvement in an ideologically id-polarised world 1\nHowever, leek of understanding among educators, by nature conservative\nand eiow to accept innovations, has bean responsible for hesitancy to use\nand develop now technologies, and the sise and complexity of our educational\nstructure has inhibited the rapid development of such understanding. Con¬\nsequently the application of communications technology to the teaching-learning\nprocess has been fragmented end sometimes has been met with positive re¬\nsistance .\nThrough the work of the National Association of Educational Broadcasters,\nin collaboration with other national educational agencies, some progress has\nbeen made in the general Held of educational communications; but the rate of\nprogress is not adequate to foe need or to foe pressures of the times.\nThe Present Status of Technology\nAt the present time in the United States, there are 255 educational radio\nstations and 70 educational television stations on She air. There ere 350 - 400\nclosed-circuit television systems in various schools and colleges. There\nare approximately 40 new television stations in advanced stages of planning\nand preparation. There are 5 state networks of educational television, one\nstate end one regional radio network, and approximately 30 states have state\nplans or central state agencies for the development of educational television.\nNational “networks\" for educational radio and television have been\ndeveloped, with distribution centers that provide vis mail several hours of\neducational programs a weak, from cooperative planning end production among\nthe stations. Four regional educational television production canters and\ntape libraries have been established.\nThe federal government has approved legislation providing for 32 million\ndollars for the further development of educational television facilities in\nmatching grants to the several states.\nWithin the next half-dozen years there will probably he 500 closed-circuit\ntelevision operations, 350 radio, and ISO ETV stations, combined in state,\nregional, and. possibly, national networks. These facilities will make it\npossible for schools, colleges, and citizens to select from programs of re¬\nmarkable quality and variety."
}