{
  "id": "d665-9",
  "text": "From the of facilities for distribution and utilisation much has been\nachieved; the technology is proceeding fast enough. From the standpoint e<\nthe need for development of people with the knowledge and skills in the\napplication of the technology progress is calamitously stow.\nThe Concept of Professionalism in Educational BroadgaaMaa\nIn spite of all present and projected progress, the fact remains that ed¬\nucational broadcasting can only be what the people Involved in it make it. Its\nnubstenrw can only result from the concepts, the skills, and the attitudes of\nits professional personnel.\nTelevision is a relatively new medium of communication—educational television\nis s new methodology, requiring new techniques and new understandings. Personnel\nwho ere adequate to the requirements end demands of this now medium have been\ndeveloped only in the past tan years and there is a critical problem of enough\npeople adequate for the Job.\nBus will requite a kind and quality of effort that will attract and develop the\npeople, thd professional educators and technologists, who have the knowledge,\nskills, and understanding# *\nMuch of the hope for excellence in educational broadcasting and to the\nuse of the electronic media depends on the broad competence and dedication\nof people attracted to it as a career. We must attract to this newly emerging\nthe very best imaginative minds of the lend. And we must continually\nupgrade the quality of those already to the field so they are adequate to the\nrequirements and demands of using the new media to its fullest potential.\nThis u a continuing task, and can only be accomplished by a free association\nof trained and dedicated personnel operating within a frame of established\nstandards that are essential to professional competency end responsibility. These\npeople are,end must be, educators who understand the implications of the\ntechnology they use, end technoigists who understand the imperatives of ed¬\nucation. they must be provided the climate and the structure for their\ndevelopment and growth, — to short, s true professional home.\nit is pniy through a comprehensive program for educational communications\nthat aU the necessary resources can be marshalled to provide the commonalty\nof understanding, the instructional Insights, and the skills necessary to the\nfull development of the total madia.\nSuch a program must adequately represent the various educational\ninstitutional Interests, and must derive Its strength from the combined judg¬\nments of the educational community."
}