{
  "id": "d952-104",
  "text": "1500 Portland Avenue\nSt, Paul 5, Minnesota\nSeptember 27, 1952\nMr. Seymour N. Siegel, President\nNational Association of\nEducational Broadcasters\nStation WHO\nMunicipal Broadcasting System\nNew York City, New York\nDear Sis\nI ha mb been advised that a vacancy may occur in the\nposition of executive secretary of the National\nAssociation of Educational Broadcasters.\nIn view of my long association with educational radio\nand TV, my administrative experience, and my familiarity\nwith the special problems of the non-commercial station,\nI believe I am particularly qualified for the position.\nA personal data sheet enclosed with this letter outlines\nthe details of my professional background. My experience\nactually dates back to 1926 when I first became a part-\ntime announcer for KUOM, University of Minnesota, then\nidentified as WLB. In 1928, I began work as a substitute\nannouncer for KSTP on a talent fee basis. My thirteen\nyears at KSTP as educational and public relations direc¬\ntor gave me experience in every phase of regional station\noperation, and so far as I know, with the exception of\nnetwork educational directors, I was the second man in\nthe nation to be placed in charge of public service pro¬\ngrams on a full time basis by any commercial station.\nMy network service brought me into daily contact with\nnearly every important professional, educational, and\nsocial welfare agency in the country. After the war I\nreturned to a managerial position v/ith NBC in charge\nof package program sales, directing the contractual\narrangements and planning of all of the then NBC-owned\nprograms from Bill Stern to Kaltenborn, from Jinx\nPalkenberg to Toscanini.\nMy academic experience dates from 1935 and the College\nof St. Catherine to the University of Texas. During the\npast twenty-five years I have participated in all of\nthe major educational radio conferences, helping to.\norganize the School Broadcast Conference, the Association\nfor Education by Radio, and the University Association\nfor Professional Radio Education."
}