{
  "id": "d952-108",
  "text": "Page 3\nServed as consultant to National Association of Radio and Television\nBroadcasters in establishing minimum standards for radio\ninstruction at the college and university level\nProducer of two motion pictures for Great Northern Railroad\nthrough Empire Photosound, Inc., St. Paul, Minn. (1936-1937)\nTechnical consultant on production for three motion pictures\nfor the National Music Camp, Interlochen, Michigan (1952)\nScript writer for radio scriuts used in observance of American\nEducation Week by National Education Association (1950-1951)\nLectures at Universities of Minnesota* Oklahoma, Illinois,\nHouston, Iowa, at New York, Syracuse, Boston, Baylor,\nNorthwestern and Emory Universities, at Colorado State\nTeachers and Texas Western Colleges, and others.\nSupervised the production of more than 9000 broadcasts from\nRadio House at the University of Texas (1946-1952)\nSupervised the production of nineteen telecasts from University\nof Texas (1950-1952)\nReferences:\nMr. Kenneth M. Hance, General Manager, Station KSTP, St. Paul,\nMinnesota\nMiss Judith C. Waller, Director of Public Affairs, National\nBroadcasting Co., Merchandise Mart, Chicago, Illinois\nDr, E. W. Doty, Dean, College of Fine Arts, University of\nTexas, Austin, Texas\nDr. Joseph E. Maddy, President, National Music Camp, 303 South\nState St., Ann Arbor, Michigan\nDr. Franklin G. Dunham, Chief, Radio Division, U.S. Office of\nEducation, Washington 25, D.C.\nMrs, Dorothy Lewis, Coordinator of U.S, Station Relations,\nRadio Division, United Nations, New York City, N.Y,\nMrs. Dorothy Gordon, Director, Youth Forum, New York Times,\nTimes Square, New York City, N. Y.\nMr, Ralph Steetie, Executive Director, Joint Committee on\nEducational Television, 1785 Massachusetts Ave. N.W.,\nWashington 6, D.C,\nMr, Parker Wheatley, Executive Director, Lovell Institute\nCooperative Broadcasting Council, Symphony Hall, Boston 15,\nMassachusetts\nMr. William S. Yale, President, Empire Photosound, Inc.,\n490 Snelling Avenue N., St. Paul, Minnesota\nDr. Albert Johnson, Department of Drama, University of\nTexas, Austin, Texas\nDr. Archie Jones, Department of Music, University of Texas,\nAustin, Texas"
}