{
  "id": "d952-123",
  "text": "The time from Tomfs divorce through his leaving\nRadio House was one of great emotional upheaval*\nPerhaps more so for him than it would have been\nfor a man of lesser stature. But at no time when\ncrisis seemed to be surmounted only by crisis, did\nTom Rishworth loose sight of, or neglect his duty\nto Radio House and to Educational Radio. At no times\ndid his personal problem fog his thinking about the\njobs at hand. I know. I was there. I directed him\nin a show the day he announced quietly to the staff\nthat he and Jane were getting a divorce. I did a\nremote broadcast with him the day after the President’s\noffice informed Tom that he \"was under investigation,’1\nCheck with Marye Benjamin as to Tom’s carrying out of\nduties up to the time of his leaving. Check with A1\nJohnson, Chairman of the U. T. Drama Department. Check\nwith Bill Cavness, another script writer there. Ask\nDr. E. P. Conkle or Tom Rousse if the Radio Committee\nwas dissatisfied with the calibre of Tom’s work. Ask\nany psychiatrist how much groundless, personal slander\nany one man can stand before his own judgement takes\nhim to another place.\nAJ the time of Tom’s leaving he had promised Hugh\nProcter, Texas Education Agency, six additional shows\nin the Radio House series \"Is Anybody Home.\" A lesser\nman would have turned the remaining six shows back\ninto the Radio House hopper. Tom promised Procter\nthat since his voice was on the first six tapes, he\nwould, as soon as he obtained tape equipment, record\nthe final six shows. This he did at Interlochen.\nTom kept his promise, prompted by his belief in the\nthings he had built at Radio House, and Procter re¬\nceived the shows well ahead of air time.\nI cite this to further my point that emotional upheavals\nhave not impaired Tom Rishworth1s capability. Tom’s\ncapability stems from a thorough knowledge of the\ntools of radio AND from a deep and sincere belief in\nradio as a social and educational force. Tom’s personal\nproblems are his own, but they will never overshadow\nhis ability, faith, and vigor for his chosen field.\nAsk any of us who have been close enough to Tom to\nknow.\nSincerely,\nR. C. Norris"
}