{
  "id": "d952-13",
  "text": "HERE IS HOW YOU CAN MAKE YOUR TALENTS\nKNOWN TO EDUCATIONAL BROADCASTERS\nOne of the most rapidly expanding fields today\nis that of educational broadcasting. Every day it\nenters the homes of more and more people, bring¬\ning with it entertainment and instruction for every\nmember of the family.\nAs a result of this expansion, the need for\nqualified personnel to operate educational stations\nis at a critical stage. If educational broadcasting is\nto continue its important work, energetic and tal¬\nented people are urgently needed.\nThere are literally thousands of capable people\nwho qualify for positions in this field. To these\npeople, however, the problem of making their tal¬\nents known to employers presents a difficulty. To\nmail resumes and letters of application to individ¬\nual stations is a long, costly procedure. Employers,\nbusy with pressing affairs, are burdened by these\nletters and often feel antagonistic toward them.\nEducational broadcasters have long agreed that\nthe creation of a central agency to handle person¬\nnel placement for them would eliminate all of\nthese present problems.\nTo answer this need, the NAEB Placement\nService was instituted in 1954 to centralize earlier\nefforts by various organizations. Its establishment\nwas made possible by a grant from the Fund for\nAdult Education, on the advice of the Joint Com¬\nmittee on Educational Television, the National Citi¬\nzens Committee for Educational Television, and the\nEducational Television and Radio Center.\nThe sole purpose of the Placement Service is to\nprovide capable personnel to manage and staff\nthe educational stations of the nation.\nThis service is free to all Individual Members\nof the NAEB.\nTo assure getting your credentials on the desks\nof prospective employers, write today and ask for\nour forms. When the forms are returned, you be¬\ncome qualified for immediate recommendation to\nemployers. Your credentials are placed in neat,\nattractive folders which make a good impression.\nFor a position with a future, you are invited to\ntake advantage of this free service. All matters are\nhandled in a confidential manner and receive\nprompt, efficient and courteous attention.\nADDRESS ALL INQUIRIES TO:\nPlacement Officer, NAEB Placement Service\n14 GREGORY HALL, URBANA, ILLINOIS"
}