{
  "id": "d952-19",
  "text": "Services (Continued)\nPUBLICATIONS\nWork of the various committees is reported in\npublications which have been acknowledged as in¬\nestimable in value in facilitating daily operations of\nmember stations and production centers. Since 1951,\n49 reports of workshops and seminars, monitoring\nstudies, regional meetings, research, surveys and pro¬\njects conducted by NAEB have been prepared.\nTwo publications are distributed to members regu¬\nlarly: NAEB Newsletter and NAEB Journal. (The latter\nis a professional magazine containing articles by edu¬\ncators and educational broadcasters.)\nAlso published for members are professional direc¬\ntories, speech and article reprints, program reports and\nbrief papers prepared as aids to members.\nRESEARCH\nFor many years NAEB has encouraged and fostered\nbasic, as well as applied, educational broadcasting re¬\nsearch. Since 1955 NAEB has published monthly an\neducational Fact Sheet Service. These comprehensive\ndigests provide an excellent source of research findings.\n(Fact Sheets have been an integral part of the Journal\nsince 1958.)\nAnnually NAEB awards grants-in-aid to help under¬\nwrite the expense of educational broadcasting research\nprojects. In addition, the NAEB Research committee,\nwith other NAEB committees, conducts research pro¬\njects resulting in reports issued to all members.\nIn 1957 NAEB conducted the first international\neducational broadcasting research seminar in coopera¬\ntion with Ohio State University.\nMEMBER SERVICES\nMembers may also avail themselves of the NAEB Placement Service; programming, engineering\nand legal counsel assistance of a general nature; management and community consultation; and\noperational advice and assistance.\nNAEB FINANCIAL SUPPORT\nFinancial support is obtained from membership dues, Net fees and foundation grants. The\nW. K. Kellogg Foundation provided the initial grant in 1951 which permitted the establishment of\nNAEB Headquarters and Network. Based on diminishing grants over a four year period, the Network\nhas become self-supporting. NAEB Headquarters is continuing to receive grants from the Kellogg\nFoundation. Recently it has begun to assume an increasing degree of self-support through dues and\nincome from related services. Fund for Adult Education and Ford Foundation grants have made joossible\nsuch NAEB services as tv engineering assistance, professional advancement activities, community relations\nand other consultation services, and'the Placement Service.\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS"
}