{
  "id": "d952-25",
  "text": "For* Hebert C. Anderson\nProject -Director, educational -television\nSoutttem Regional Education Beard\n830 Peachtree Street, K. W*\nAtlanta, Georgia\nLear Bobs\nIt was indeed good seeing you at Minneapolis, but\nI regret very much that there was so little time to down\nand chat* As is usual at conventions, there was little time\nfor anything other than a fast “hello* and Bgpod-hy»tt.\nYou will recall that I mentioned briefly the\npossibility of our securing your services as Executive\nDirector of the Rational i ssociation of Educational Broad¬\ncasters. Tills Is a possibility which I air; still exploring.\nAt a post-convention meeting of the Board of iirectors of\nNAEB, I raised this question and we discussed the subject\nof Executive Director at considerable length. Because of\nthe many new avenues we are exploring in HHEB, it was\nagreed that it would be desirable to hold a strategy meetir^sj\nof a rnasber of members of the Board, if not the entire Board,\nat a very early date to attempt to define more specifically\nthe job ahead fbr N/EB and the resultant responsibilities\nof the Executive Director before making a specific offer to\nanyone? It is conceivable that we will reorganize our entire\nheadquarters operation in terns of personnel and responsi¬\nbilities and we may be searching for two high calibre men\nrather than one. In any event, you will be hearing more\nfrom me end X hope you will keep the possibility cf a job\nwith us in mind.\nThe Executive Director at the present time is\nsupervisor of our network operation which is currently -\nfeeding something like seven and one-half hours of taped\nprograms to seventy-two stations in the country. Upon him\nfalls the responsibility to some extent of securing programs\nfor release. The Executive Director is also our national\nrepresentative with various organizations and foundations,\nthough he uorks very closely with the Board in these contacts.\nHe should be our inspiration or idea man as well as our\nengineer. His is a position of considerable responsibility\nfor organizational unity and effectiveness. NAEB is becoming"
}