{
  "id": "d1173-0",
  "text": "SPECIAL BULLETIN\nRelcaso Date November 5, 1931\nTO MEMBERS\nTHE ASSOCIATION OF COLLEGE AND UNIVERSITY BROADCASTING STATIONS\n(and a special request nailing list in addition to members^\nListed below you will find some very important communications of general interest to\nthe Association of College and University Broadcasting Stations which have been re¬\nceived since October 15. May I ask that the program managers and directors of the\nmembership list check carefully for special comments and questions presented in many\nof these communications. We are finding it impossible to answer many requests re¬\nceived from bulletins released, more especially when they deal with work of some\nspecific station. Many of the communications listed in this bulletin deal with sta¬\ntions in our membership list. It is expected that the program director will note\ncarefully the portions of the bulletin that dead with his work and correspond with\nthe individual seeking special information, etc.\nMay I also urge at this time that the membors of the Association note on their calen¬\ndars and send to this office at least every two weeks reports of progress, being made\nin their program work or any other points of interest that should be released to the\nentire membership. True, it takes a great deal of detail work to issue special bul¬\nletins of this type, and the success of your special bulletin depends on the coopera¬\ntion accorded the movement by members of the Association. A number of us have been\nof the opinion for some years that a special bulletin could be made one of the most\neffective parts of the program of our Association. Personally, I have gained a groat\ndeal of valuable information for use in our station from the exchange of ideas. I\nam sure that every station official can profit in these exchanges of ideas if he will\nbut contribute \"highlights” of interesting developments from his own institution.\nFROM MR, C. I’:. KOON, SENIOR SPECIALIST IN EDUCATION BY RADIO, UNITED STATES DEPART¬\nMENT OF INTERIOR, OFFICE OF EDUCATION, WASHINGTON, D. C. COMES THn FOLLOWING COMUNI-\nCATION: \"Wo arc pleased to note the service you are rendering the members of your\nassociation in your attempt to improve the broadcast programs by moans of exchanging\nrecords that could be used for broadcast purposes.\n\"At the Radio Institute in Columbus, Mr. Harold Lafount of the Federal Radio Commission\nsaid that educational stations were using only one-third of the time allotted to them.\nUnder these circumstances it occurs to us that no pains should be spared to insuro\nthat educational broadcasting stations make more use of their available time on the\nair.”\n”We appreciate some of the handicaps and limitations of college broadcasting stations.\nDo you think that educational broadcasting service might be materially extended and\nimproved by a rather general exchange of programs? The National Committee on Education\nby Radio probably would appreciate on article by you on this subject for their bulletin,\n'Education by Radio.”\n”ln what ways might the Office of Education bo of assistance to your organization in\nextending the service of college broadcasting stations?\"\n(NOTE: May I call your attention to the last paragraph of the communication from\nMr. Koon, iii which he asks in what ways the Office of Education might be of assistance\nto the Association of College and University Broadcasting Stations in extending the\nserivee of college broadcasting stations. May I ask for suggestions and answers to\nthis question from each station official holding membership in the Association. Will\nyou please send these to me on or before November 15. I trust that we may assemble\na list of subjects from the members that will be helpful to Mr. Koon in organizing\nthe work of the Office of Education to bo of direct assistance to the Association. May\nI hear from you at once relative to this matter.)"
}