{
  "id": "d1173-2",
  "text": "-3-\n\"Some innovations are also planned in the plays themselves, Mary Elizabeth Schwartz\nof Portsmouth, Ohio, who will be remembered as the author of the \"King\" series last\nseason and who wrote the collegiate \"Friday Nights” series for September, is preparing\na group of plays based on actual historical incidents. Men actually lived these plays.\nThey are excerpts from stories handed down from generation to generation in families\nMiss Schwartz has known.\n\"Listeners are urged to send in any interesting anecdotes or stories of their own\nforefathers and they will be dramatized by the Players. Of course actual names will\nbe made fictional, but the stories themselves will be gladly used. It is planned to\nportray these cherished legends once each month throughout the entire season.\n\"Heading the list of plays this month is \"The Violin Maker of Cremona,\" by Francois\nCoppee, October 2; \"Cherished Stories,\" the historical play, October 9; a Greek play,\n\"The Frogs,\" by Aristophanes, October 16; a revival of \"Uncle Tom’s Cabin,\" by Harriet\nBeecher Stowe, October 23; and an adaptation by Mary Elizabeth Schwartz of the famous\nstory of Tristram, and Isolt, entitled \"The Lie of the Sails,\" October 30, Don’t fail\nto listen to this well-planned program of drama, comedy, and history.\"\nFROM MR. DANIEL E. NOBLE, RADIO DEPARTMENT, CONNECTICUT AGRICULTURAL COLLEGE, STORRS,\nCONNECTICUT, COMES THE FOLLOWING: \"We are very much interested in the possibilities\nof broadcasting plays on a regular weekly schedule but, so far, we have been unable\nto arrange with our department of English to undertake the direction of the work. The\nchief difficulty seems to be the preparation of the play material. The time required\nfor the preparation of material is so great that we feel we should be unable to main¬\ntain a weekly schedule without the assistance of someone who could give full time to\nthe work.\n\"If the Association of College and University Broadcasting Stations could arrange for\nthe exchange, or for the preparation and distribution of play broadcast material, it\nwould greatly facilitate the dramatic work of the college stations. We shall be\ngreatly interested in any information you may gather from your survey.\"\n(NOTE: Some of the information requested by Mr. Noble will be found in this special\nbulletin, while we hope in the course of the next few weeks to give further advice\nrelative to exchange or preparation of play broadcast material.)\nFROM DR. B. B. BRACKETT, DIRECTOR OF RADIO STATION KUSD, UNIVERSITY OF SOUTH DAKOTA,\nVERMILLION: \"In reply to your recent inquiry, I mil say that KUSD has never broad¬\ncast any plays except those put on by modern language clubs In Spanish and French, with\nconsiderable explanations in English to make- the various situations more easy to follow.\n\"This, I judge, would be outside the kind of plays you wisn to know about.\"\n(NOTE: I was quite interested to learn of the work of the modern language clubs at\nthe University of South Dakota. I can see the possibility of a valuable tie-up on\nthe part of your radio stations with the modern language clubs in such work as Dr.\nBrackett has broadcast over KUSD. I would appreciate hearing from any director who\nhas tried a similar plan.)\nFROM MR. WILLIAM R. DUFFEY, DIRECTOR OF STATION WHAD, MARQUETTE UNIVERSITY, MILWAUKEE,\nWISCONSIN: \"Following is a list of plays which were broadcast over WHAD last year*\nFeb. 4 - Marquette Drama Period: \"The Game of Chess.\"\nFeb. 18 - Marquette Drama Period: \"Columbine.\"\nMar. 4 - Gold Mask Parers: \"Wurzel Flummery.\"\nMar. 18 - Gold Mask Players: \"Riders to the Sea.\"\nApr. 4 - Gold Mask Players: \"Rosalind.\""
}