{
  "id": "d1173-3",
  "text": "Leon Lishner. The program was produced by KUON-TV,\nLincoln.\n^ “Exploring Basic Economics,” a series of 12 programs writ¬\nten by economist and author L. C. Michelon for the South\nCarolina ETV Center at Columbia, will be shown over the\nstate ETV network this fall in cooperation with technical\neducation centers across the state.\n^ A program about the South Carolina Eye Bank, “Out of\nDarkness into Light,” was recently televised over ETV sta¬\ntions WITV, Charleston, and WNTV, Greenville. Produced\nat the ETV Center at Columbia, the program is a panel dis¬\ncussion, featuring Ted Hunter, newly elected president of the\nEye Bank Association of America.\n► “The Films of Robert Ford,” a recent three-program series\nover WTTW, Chicago, is about a young Evanston resident\nwho was graduated from Northwestern University two years\nago and has since been making his living as a producer of\naward-winning films. It features interviews with Ford and\nexcerpts from his works, Which have won awards from the\nEdinburgh Film Festival, the Committee on International Non-\nTheatrical Events, and the Edinburgh International Film\nFestival.\n^ The lecture-recitals and master classes of University of\nWisconsin visiting professor of music Paul Badura-Skoda,\nrecorded during his campus appointment last spring, are be¬\ning replayed this fall over WHA radio and TV. The master\nclasses may be circulated by NET.\nPublications\n• Mass Media and National Development, 333 pages, by\nWilbur Schramm has just been published jointly by Stanford\nUniversity and UNESCO in Paris. $7.50.\n• 50c buys Teaching about the United Nations, a new 110-\npage book by the Office of Education of the Department of\nHEW. Write the Superintendent of Documents, U. S. Gov¬\nernment Printing Office, Washington, D.C., 20402.\n• An article on South Carolina’s ETV network appears in\nthe August issue of the American Bar Association Journal.\nWritten by William F. Able, a Columbia attorney, the article\nis entitled “Continuing Legal Education By TV.” It describes\nthe role of the network in assisting South Carolina attorneys\nto keep informed on legal matters.\n• Cinema Eye, Cinema Ear: Some Key Film-Makers of the\nSixties, by London Times film critic John Russell Taylor,\nemphasizes the work of Antonioni, Fellini, Bunuel, Bresson,\nBergman, and Hitchcock, with some study of Truffaut, God¬\nard, and Resnais. Illustrated with 32 pages of photographs, the\nbook is available from Hill and Wang, 141 Fifth Avenue, New\nYork 10, for $5.95.\n• Describing over 50,000 non-book educational materials, the\nEducational Media Index is the first comprehensive directory\nin the field. The 14-volume set was published by McGraw-\nHill after a three-year USOE-financed study done by the\nEducational Media Council.\n• “The Show That Wasn’t There,” a TV and radio column\nby Robert Lewis Shayon on page 27 of the August 15 Sat¬\nurday Review, criticizes MSU’s WMSB for deciding not to\nshow the third play in a controversial trilogy on race rela¬\ntions they had already videotaped and states that film prints\nof the three plays are available to TV stations free of charge\nfrom the Anti-Defamation League, B’nai Brith, 315 Lexing¬\nton Avenue, New York, N. Y., 10016.\n• On page 50 in the same issue of Saturday Review, David\nStewart, secretary of the JCEB, discusses a new college in the\nVirgin Islands.\n• A revised edition of The Audio Visual Advisor by Salva¬\ntore J. and Dolores F. Parlato is available from Market Sta¬\ntion Box 25, Buffalo, N. Y., 14203, for $1.50. 76 pages.\n• “Free-Lance Job Opportunity: Educational Television,” by\nNancy Vogel, appears in the September 1964 issue of Writer’s\nDigest.\nPLACEMENT\nPERSONNEL AVAILABLE\n(For information, write Miss Julie Hunt, Placement Service,\nat the NAEB office in Washington.)\nOctober I Position in management, research, state develop¬\nments, or college/university academic affairs. Experience\nin management affairs, research, state and national\nagencies, and teaching (elementary through graduate\nschool). Minimum salary $12,000.\nOctober 2 Married man, 40, with B.A. and 13 years of ex¬\nperience in all phases of broadcasting—sales, program¬\ning, management and ownership. Extremely capable “on\nair.\" Interested primarily in challenging position. Will\nconsider any area or foreign country. Would be will¬\ning to teach, program, or manage. Considerable ex¬\nperience in broadcasting and public relations. Starting\nsalary $10,000.\nOctober 3 Employed Hollywood writer-producer-creator of\nnetwork programs wishes to establish contact for next\nyear as college teacher or with TV/radio station. Mar¬\nried, 48, two children. B.A. in speech, working on M.A.\nStarted in radio, over-all knowledge of radio and TV.\nSalary $10,000 minimum.\nOctober 4 Experienced producer and director in one of na¬\ntion's top ETV stations seeks further opportunity in pub¬\nlic affairs and instructional programing in social sciences.\nHe is young enough (24) to work long and hard to cre¬\nate a meaningful and entertaining product. He is married\nand responsible enough to complete a project within\nunderstandable limits posed by his superiors. He would\nprefer an academic community where his M.A. in po¬\nlitical science can be completed, and a $5500 to $6500\nsalary so he can afford it.\nOctober 5 Graduate student completing work on master's\nthesis now available for immediate employment. Engaged,\n25, B.S. Wharton School, University of Pennsylvania:\nM.A. in communications expected 1/65 from Univer¬\nsity of North Carolina. Desires position in ETV (oppor¬\ntunity for some teaching preferred). Areas of special in¬\nterest are programing and program development: pub¬\nlic affairs and station administration. Has workshop ex¬\nperience in all phases of production from “cable pulling\"\nto directing. Experienced in theater and in the opera¬\ntion of film societies. Interested more in the position\nand the opportunity it presents than in salary or location.\nOctober 6 Electronic technician—FCC First Class license. De¬\nsires to earn an ETV technical career through a position\naffording growth and security. Male, 25, single. US Army\nservice as a reporter-photographer for the Army Pic¬\ntorial Center. Graduate of R'CA Institutes course in TV\nproduction, direction and studio operations. Prefers lo¬\ncation in Pennsylvania vicinity.\nOctober 7 Commercial TV art director desires similar job in\nETV. Married, 32, two children. Experience: 2/2 years\nin commercial TV as artist, photographer, cameraman,\nproducer, and talent of children's show; 6 years in edu¬\ncational, professional and semi-professional theater as\ndesigner. B.A. in stage designing: 2 years graduate\nschool. Minimum salary $6800-$750Q.\nPOSITION AVAILABLE\n(In order to be considered through these channels, the reader\nmust be an Individual Member of the NAEB, with credentials\non file with the NAEB Placement Service. Non-members can\nsave time by sending the $10 annual dues and $5 Placement\nregistration fee at the time of inquiry.)\nOCT-1 Mideastern university needs young learning resources\nman to plan and develop activities with a new all-uni¬\nversity television office. 'Experience with other instruc¬\ntional materials desirable. Part-time graduate study pos¬\nsible for candidate without Ph.D. Salary according to\nexperience and training.\n4\nNEWSLETTER"
}