{
  "id": "d1173-4",
  "text": "-5-\n\"Please feel free to call on me at any and all times and in any way that I can be of\nassistance to you or the Association, ibid if at any time I have any suggestions that\nmight seem to be of possible interest or help to you personally or to the Association,\nI shall only be pleased to send them to you.\"\n(NOTE? Will' you please take particular note of the many valuable suggestions made by\nDean Rood relative to materials available along the line of work that has been sug¬\ngested. The suggestion in his letter if carried out would be very interesting indeedj\nnamely, securing of local color stories to be dramatized in the various regions of the\nUnited States and presented by the Association stations. I would like to have the\nreaction of other program directors, more especially in the East, relative to Dean\nRood’s suggestion of selecting materials suited for the various sections of the country\nto be presented by stations holding membership.)\nFROM MR, MARTIN HEGLAND, DIRECTOR, STATION WCAL, ST. OLAF COLLEGE, NORTHFIELD, MINNE¬\nSOTA: \"We have used no dramas in our programs broadcast over our radio station so I\nhave no information to give you in response to your recent inquiry,\"\nSKETCHES FROM TWO COMMUNICATIONS FROM MR. JOE F, WRIGHT, DIRECTOR OF UNIVERSITY PUB¬\nLICITY, AND OF STATION WILL, UNIVERSITY OF ILLINOIS, URBANA: \"We have not done a\ngreat deal in the way of broadcasting dramatic productions, We have done some Shake¬\nspeare at- one time or another and have also broadcast some plays and portions of musi¬\ncal comedies written by our students. We have broadcast a good many brief debates\nduring the last three or four years, but rather than put the whole affair on the air\nwe simply had an abbreviation of it given in the studio, I shall be glad to see what\nother schools are doing in this line,\n\"The question I should like to ask you, and hope you will take the time to give a\nfrank answer, is this: How can we work up worth while enthusiasm on the part of\nlisteners other than through the broadcast of athletic events? I really think that\nour situation here is such that we cannot get a fair picture of what educational\nbroadcasting might do, due to the fact that we are heard over such a limited area,\nwe. certainly are not getting any responses to speak of and sometimes I wonder if it\nis worth the effort. This year we are broadcasting several courses from the class¬\nroom, some' of which are very well done and are of such a nature that there should be\na rather general interest. Besides these classroom broadcasts, which take un two\nhours each day, we are on the air for another hour and a half with music, miscellan¬\neous talks of an educational nature, including agricultural material.\n\"There are times when I get rather enthusiastic about what we are doing, but at other\ntimes I have very grave doubts.\n\"Are you able to prepare any tangible results? Do your letters come in voluntarily,\nor how do you pull them? Etc. Etc.\n\"I presume all boradcasting stations, certainly educational stations, received a\nletter today from the R.C.A. Photophone, Inc., telling of their new portable disc\nrecorder and reproducer,\n\"This is apparently the sort of thing that we have discussed from time to time, and\nI wonder if the information should be passed around. The letter which came to my\ndesk was addressed to President Chase, but inasmuch as his assistant thought that he\nwould not be interested, let alone know what it was all about, he sent it on to me.\nI am writing to the Photophone people this afternoon asking for price, etc. \"When.I\nget this information I shall send it on to you if you are interested.\n”1 want to congratulate you on the bulletins you get out. They are very newsy and\ngive the sort of thing that all of us like to have,\n”1 am also sending you, in case I have not already done so, the resume of our weekly\nbroadcasts. You will note that we are broadcasting five courses, from the classroom\nas well as keeping up our talks of ten, twelve, fifteen and twenty-seven minutes on\neducational subjects.\""
}