{
  "id": "d1173-5",
  "text": "-6.*\n(NOTE? May I call to your attention the second paragraph of Mr.. Wright’s letter in\nwhioh he asks how we can work up worth while enthusiasm on the part of listeners o^her\nthan through the broadcast of athletic events. I am sure this question has confronted\nthe manager and director of eaeh of our stations* Five or six years ago it was a\nCommon \"habit” of the radio listener to write the station when he found a program that\nappealed to his fancy. Today we find that the best of programs will rarely,,, if ever,\nstimulate the radio listener to write the station, I personally feel that this is one\nreason why so many of us wonder if our programs are worth while and if they are being\nreceived in a satisfactory manner on the part of our constituents. I am of the persona!\nopinion that we must offer a varied series of programs over the eudcational stations\nin order to appeal to the fancies of all classes. Please do not misinterpret this\nstatement,, as I am also of the personal opinion that so-called jazz and similar pro¬\ngrams have no place on an educational station program. A few months ago I was pri¬\nvileged to hear one of the outstanding educators of the country make this statement,\n\"In your educational radio work on the part of the universities and colleges you\nshould not be discouraged. If you are giving a course in the appreciation of any of\nthe arts or stimulating thought among any of the sciences, you are filling your mis¬\nsion by use of this ’infant’ of education. So often we hear the question, \"is the amount\nof effort expended on the part of educational institutions in presenting their edu¬\ncational programs worth while?’ My answer to the question would be that if you are\nholding the attention of an audience of only ten patrons and stimulating a greater\nappreciation of the fine arts for this select group your effort has not been in vain.\"\nOf course none of us like to think that in most of our programs the audience is only\nten persons. But at the present time we are unable to determine the extent of our\naudience participation. L^ter in this bulletin you will find the communication from\nthe office of the Commissioner of Education Washington, D. C., relative to the pre¬\nparation of a publication on the methods of instruction by radio. Note that we may\nall help to scientifically produce a study to make available to the educational pro¬\nfession the best that is known about the technique of effective broadcasting. When\nwe have once determined the most effective technique of presenting our materials over\ncollege and university stations one of the greatest if not the greatest problem con¬\nfronting the program director*will have been solved.)\nFROM MR. R. C. HIGGY, DIRECTOR, STATION WEAO, AND PRESIDENT OF THE ASSOCIATION OF\nCOLLEGE AND UNIVERSITY BROADCASTING STATIONS, OHIO STATE UNIVERSITY, COLUMBUS* (We\nare quoting from two letters from Mr. Higgy, written by him on October IE and October\n13.) \"I have intended writing to you well before this time to give you the informa¬\ntion you have requested in letters which arrived during my absence last summer. We\nhave spent the past two weeks in getting started on our regular yearly schedule and\nthere has been absolutely no time for additional duties until now,\n\"Your first bulletin is very interesting and exactly the type of thing that ^ would\npersonally like to see continued at as frequent intervals ns possible. I appreciate\nhow difficult it is to secure information from the various stations, but I have al¬\nways believed that if tho thing is once well under way it will become much easier to\nsecure the cooperation of our stations in supplying the information.\n\"I am trying to persuade Miss Jenkins of our staff to prepare copies of four or five\nradio plays suitable for use at stations of our Association. I had in mind that the\nAssociation might do a very fine piece of work in making these available to all of\nits stations for use without royalty. That is., you could mimeograph these and send\ncopies to all stations. These plays will be of different types, and the idea in our\nreleasing these plays will be to secure interest of other stations, in order that\neventually an exchange of radio plays could be effected. I believe that we will be\nable to get these plays to you, if you believe it well to carry out this plan, with¬\nin the next week or so. We have had requests from eight or ten association stations\nand have been unable to fulfill their requests for these programs. Apparently, there\nis considerable interest in radio plays at educational stations,\n\"The work of the National Committee is progressing very nicely. The meeting of\nOctober 2 laid plans for the coming year which include the introduction of the Fess\nBill or a new similar bill into both the House and.the Senate, publication of the\nprinted bulletin weekly, in order to further the interests of our cause, and the"
}