{
  "id": "d1173-8",
  "text": "B. Direction.\n1. The lines are not to be memorized. Even if the parts rre'\nknown, books are required at the broadcast,\n2. Cues must be quickly picked up. And in general the tempo\nis faster in radio drama, since pauses for action suggest\nonly mechanical trouble to the listener,\n3. The conversational mode is required due to the psychology\n’the homo audience,’\n4,. Diction, pronunciation and breathing are to be noted,\n5, Definite characterizations help put the play across,\n6, The play should be timed carefully. Including the announcer’s\npart the play must run but 30 minutes,\n7, Perfect synchronization of lines and sound effect is necessary,\n8, The announcer’s part will, be taken by a member of the studio\nstaff. To facilitate matters, a copy of the play and suggestions\nshould bo sent in as soon as possible,\n9, A studio rehearsal will be arranged when definite scheduling\nis completed,\n10, In casting the voices are the important criteria. Guard against\neye prejudices. Casting by e°r is essential.\nSincerely yours,\nGwendolyn Jenkins..\nDramatic Assistant\nStation WEAO\nTHE FOLLOWING LETTER WAS RECEIVED AT THIS OFFICE ON THE MORNING OF OCTOBER 27 FROM\nMISS BESS G00DYK00NTZ, ACTING COMMISSIONER OF EDUCATION, WASHINGTON, D. C.t \"The\nUnited States Office of Education would appreciate having the assistance of the\nAssociation of College and University Broadcasting Stations in the preparation of\na publication on methods of instruction by radio. Among the topics that would be\nconsidered are the following?\n(1) Advance preparation by the broadcasting teacher.\n(a) General rules.\n(b) Lecture discussions, plays and musical\npresentations,\n(2) Advance preparation by the listeners.\n(a) Adult listeners,\n(b) School audiences.\n(3) Presentation of the radio lesson.\n(a) Broadcasting a highly specialized art.\n(b) Microphone technique.\n(c) Diction, pronunciation, articulation,\ntone quality, accent, and general\ncultural effect,\n(4) Reception and follow-up work,\n(a) Adult listeners.\n(b) School audiences.\n\"The principal purpose of this study will be to make available to the eudcational\nprofession the best that is known about the technique of effective broadcasting.\nThe study should also be of service to professional broadcasters and occasional\nradio speakers."
}