{
  "id": "d1377-2",
  "text": "- 2 ~\nA total of 188 members of the University faculties have participated in\nspeech programs during the year© Excellent cooperation was given by the School\nof Music which appointed Professor Hanns Pick as director of its music program.,\nby the Department of Post Graduate Medicine, whose chairman was Dr« Marvin\nPollard, tho School of Education series arranged by Dean Edmonson, the Adult\nEducation Program which was supervised by Kirs© Rubin, the Workers Education\nProgram arranged by Professor G» Giark Dickinson and Kir© A, K* Stevens, the\nVeterans series by Mr© Clark Tibbetts and Professor Charles Jameson, the\nHymns of Freedom by Dr* Donald E© Hargis and Professor Arthur Hackett*,\nRecognition and appreciation should be given to a number of members of\nthe faculties for their continuous participation in series of programs during\nthe year? Professors Randolph Adams, Arthur Hackett, Ronald Hargis, George\nKiss, Charles Jameson, Amos Morris, Hanns Pick, Benjamin Wheeler, Robert Angell,\nDr© Frank Robbins, Dr* Edward W* Biakeman, Kir* Clark Tibbetts, Kir* Sidney Giles,\nMr© A* K © Stevens © These men graciously participated in programs week after\nweek*\nListener response upon the programs for the year has been very heavy****\nmuch too large to count for this report, however, in a period covering four\nbroadcasts of \"Stump the Professor” a total of 329 letters were received* These\ncame from 83 cities in Michigan, 34 cities in Ohio, 8 cities in Indiana, also\nletters from New ^ork, Massachusetts, New Jersey, Nebraska, Pennsylvania,\nMaryland, Kentucky, Illinois, “•iseonsin, Minnesota, Missouri, Louisiana, Texas,\nWashington, Ox^egon^ California, Iowa, South Dakota, and Canada* During the year\n37 members of the Medical faculty have spoken* Counting the replies upon a single\none of these—Dr* Raymond IV* Waggoner--131 letters were received fx^om 19 states*\nThis may be taken as representative of the listeners response to other\nprograms in the Medical Series* Other programs which bring in mail response\nare the \"Hymns of Freedom\", \"Religion ih Review,” \"Home Planning Series,” and\n\"Veterans Counseling Service*\"\nA decided increase in the use of transcriptions has been evidenced this\nyear© These transcriptions are made in the Angell Hall studios and provided\nto various stations* The ^edical Series is transcribed and used over WJR,\nDetroit and later over WKAR East Lansing and will be used later in th© northern\npeninsula. The Home Planning Series transcribed has been used over Stations\nV&ZO Kalamazoo, WJEF Grand Rapids and WPAG Ann Arbor. The Workers Education\nprogram will be transcribed for W£AR and to be used latex'* by various workers\ngroups in their own localities. %e use of such transcriptions partially\nsolves the problem of obtaining speakers in this period of vastly increased\nenrollment© Such ti’anscriptions are spaced over radio stations which do not\nserve the same area.\nThe control equipment in Angell Hall is being entirely reconstructed, with\nall new wiring and a large amount of new equipment, to make this installation\npermanent so that it may be used by the Speech Department for the teaching of\nBroadcasting and for the origination of radio programs which will be presented\nby the Speech Department after the Broadcasting Service is moved to the new\nstudios to be constructed in the General Service Building* However microphones\nand remote equipment loaned by Station WJR is still being used* Such equipment\nmust be replaced by University owned equipment as soon as conditions permit\nits purchase*"
}