{
  "id": "d1377-4",
  "text": "HEWS LETTER:\n.. e ...Page 5 •\n,December 1, 1945\nv*Xl give you 24’.hours to line up some ideas*M And, out of the several\n:ra&e presented, considered and discussed at that Saturday morn ins\" 3\nclfta conference, came the one- of sailing the especial, war’s-end sign! fi¬\nance of this Thanks*,xving Day,\nV 8 How< WHQU* s public for the\nTha 'kagi.v t• sg yiotoxy dinner’1 idea epitomised in id s catchy slogans\n«Each Home Give Thanhs As It Is Able - With a Bond or Pledge on Every\nTable,* a slogan,, incidentally, which was promptly borrowed by QBE\nradio stations as far away as Uxmci e» Ind, and by the Columbia Broad-\nafeting System itself*\n1 :ty expansion plans told by president & p; 10:\nhen Eilton S» Elsenbower* President of Kansas St .be Colit^e, comes to\nthe studios of, KSAC» it ia like paying a visit to . u old friana*. i reel\n•rent Eisenhower, as a member of the College staff in 1923\"*s4„. was ons\nf the c>roup of far-sighted men. who prepared the way for the first broad¬\ncast of Kb*vO on Liecember 1„ 192^\nConcerning KSAC, President mi senhower has this to say* MKSAC has brough'\neveryday education into thousands oi Kansas homes since the first broad¬\ncast in 192h0 X t should reach a much wider audience. As you know, we\nhope to increase the station’s power from 1,000 to 5?000 watts by the\ninstallation of a new transmitter a soon as os becomes available\nWith this power we can cover the entire state effectively. We also hope\nto increase KSACPs hours of broadcast, Kansas State is fortunate in\nhaving this medium to reach rural and urban people of Kansas* and we\nplan to make it of the utmost service,M\nPresident Elsenhower knows the field of radio thoroughly. In 1926,, he\nentered the career service of the federal gpve*rnment and became assist&.> t\nt0 the Secretary of Agriculture, X n this position, one of Ms first\ndutiea was 'establishment of the Radio Service ot the Department of Agrl—\nculture* He was also responsible for the rri.-b option of the National\nXarm and Home Hour, in cooperation with r .>n?£ Broadcasting Company,\naTAFE EXPANSION AT WBAA\nYour editor s face ie red. After prodain^ the membership in general for\never a year to send in information on their station, staff changes* etc.»\n1 mislaid a letter from Jim Miles last August which «ave me the infoxma--\nion on the new members he had added to the WBAA staff * With due\n>gies to Jim and hie swell staff for the oversight here,1s the in¬\nformation*\nThere were three new members adaed to the staff last summer. The ;irst\nci: these is John Henderson as Production Manager, John worked with\nboCarty in his early days at Madison and since then, has had plenty of\nexperience in both'lefei Umate a tat,* enu radio. H e came .‘“fT®\nf iUiipue Xtet fell to tele over uiuba .riUiaias teat-nine, Job hi a, a"
}