{
  "id": "d1377-5",
  "text": "mm L£TT£R«\nPag© 6\nDecember 1, 1945?\nJuly lp has been at the station full time However, he etiil teaches\ntha radio classes the r h$ve*\nIhe second appoints is Mrs. dertrudu Ohang, the wife of a Chluusa\n11 dent working on die poctor&te here at Purdue* dhe i nd\nttally educated in C‘ '•..*>.. ;■••. .< * „ .? >m LXi ti|f her\n; ■ ters Decree fr >m t - e : 2 u. • a \\ . ■ : • . i I rlted\nfox some time as radio specialist, v*ith the Chinese tiewfc Service. She\n11 doing a fine job of integrating the teachers* manuale and ‘iohool\not the Air programs ir. general*\nThe third appointee la Jo Bundy who la new to radio, halls fro®\nRenneeXaer, Indiana., Bhe ie a graduate of ItePauw School of Music and\nhae taught public school music* She is acting as MufcIc&X director of\nthe station* organizing all our musical programs, ttllee also managed\nto wrangle bar an assistant, or music librarian,,\n*L*^L. aE&gLEBS J»i&\nbo$e of the plans for post-war expansion by PI; L are on chair way\ntoward completion* Thn position of musical director left vacant by\nthe departure of Laneon Demising is being ably filled by health\nCutler, recently discharged from the Wavy. Mr, Cutler studied «|t\nthe American Conserve, .ory oi Music and in Paris under tercel Dupre,\nBefore enterln0 the Navy ue taught ox^an at the American Conservatory\nof Music ana was organist ana choir master at one of ChicagoJa largest\nchurches, ,<en naa unuertuken the job of building better mu$lQ&X pro¬\ngrams for ‘WILL* In the continuity department under Margot Morris are\nsix part*time writers v3ho devote their time to the prepan lion ©1 the\nscripts for the daily program schedule * Bite Born, Pat Barton, Kitty\nHoffman and Ruth Breen handle the recorded and transcribed shows,\nMarilyn Murray takes care of the live musical 6howc, and Carol\nShaffner writes script for the live shows other than au&lo&l* The\naddition of &eor&e Sharp to the staff es educational pivj&rfw's director\nwas mentioned in the last issue of the hewe Letter, Phil Spradlins\nhaa joint'd the staff ns announcer and acting producer.. Phi 1 is Just\nback from, Wright Fie ld where he did technical radio wo cm. for tu ? AAPv-\nBoaides producing several shows* he takes charge of the .lltrot wo\nhours of daily proa< I casting which includes light music, news, service\ninformation and a devotional by a campus ministeru do much for\nstaff changeSo\na reorganig&tion of the office Space is also under way> ‘the hall in\nthe west wing of armory Hall will be closed off with & wall to wake\na large reception room for the radio station* Ml of the >fflc%a\nand studios will ooon off of this reception room* facilities * U\nalso be provided for another small studio for recording tr hroa leastins\nscript shows and alaouysione with a limited number of \\ nrUclpafite*\nTo sculp these facilities more adequately two new BOA pioieet:onal\nLdel record r- * «* . td b n faal »u d « ld ! u"
}