{
  "id": "d1377-7",
  "text": "NEWS LETTbK,\naverage ^5 5 megacycle signal a<\n83 predicted and the average 91 raegaoyc3 <. ©< . . / ?. a\nFCC move will not eliminate interference, *nd {'}) r«+e, cove... .0c\ndeoreaeed so far ae usable signal ip cor err ad, since the 93 teg/ ;\nsignal could be heard only thirty percent the time* compare > ;\nan £>5 to 90 percent reception of the 45.'5 - tacycle signal ,,\nHams of the country are grousing about all the surplus property goii*.\nto waste which they could use. They aren’t alone in the complaint ,\nEducational broadcasters and educational institutions would like some\naction from the surplus properties board., If you have any thoughts on\nhow to get action* send them to the NAEB surplus property committee— ,\nMenzer and ye editor*., * ^Basketball season once again which gives yours\ntruly a ohanoe to go traveling around the country in the capacity of\nannouncer* engineer* spotter* and NAEB representative, Don't forget\nwe want information from you on your technical limitations due to allo¬\ncation* program information* and anything else which can be used in\nconnection with the dear channsl hearings in January* Bend it now!!**\nHow do you like the print on this month9 s New a better. This is a speoial\nChristmas present to Mao up Wisconsin way. This is also the reason*\nthis News Letter is so late this nionth; we had to hunt all over town\nto find one of those woldfashioned*1 typewriters to make the master\n(Me said with hie tongue in his cheek)e I hope you all have a swell\nChristmas and that Santa fills your socks with programs* person.\nequipment, ideas* and to top it all off— a lot of fun in 1946,\nWGaT LICENSE NOT RENEWED\nThe Federal Communications Commission has refused to renew the Georgia\nSchool of TecynolOt>y• s license for radio station WG3T in Atlanta, The\nschool is operating the station under a temporary license that expires\nDecember IS * The commission tentatively denied the application for a\nrenewal on Octooer 20* but allowed twenty oay® for the filing of an\nexception. The Commission said the school has not protested the de¬\ncision.\nGeorgia Tech was authorized to file a renewal application provided that\nit showed that it had terminated certain agreements with Southern Broad¬\ncasting* incorporated,\nFCC STILL SWAMPED WITH APPLICATIONS\nThere are presently on file with the Federal Communications Commission\n463 applications for new standard (AM) broadcast stations and 211 ap\nplications for ohanges in existing standard (All) facilities* or a\ntotal of 674 AM applicationsc There are likewise on file 70? FM ap¬\nplications and 142 television applications,.\nOn October 23* 1945* the Commission designated 231\ntione for hearing in 6l consolidated proceedings\nof thd AM applioa*\nIt has since ooneo"
}