{
  "id": "d542-1",
  "text": "January lU, 1953\nMgs Ola Hiller\nRadio Station WBE\nFlint Public Schools\nFlint, Michigan\nDear Olas\nIf you have received your January NAEB Newsletter,\nyou will note that I have named you Chairman of our Committee\non School Stations and have listed Lamb, Gregory, M&ier, Barrett,\nLardie, and Broderick on that committee* I hope you vd.ll be\nable to serve and will send a letter to each member of the\ncommittee, as the chairman, officially notifying them of their\nappointment to the committee and outlining some of the hopes\nwe have for this committee*\nFirst, may I say that we expect all NAEB committees\nto meet twice a year, once during the Ohio Institute and once\nat the NAEB annual convention. Time will be allocated for\ncommittee meetir^s and then a period for reporting the committee\nfindings to the NAEB Board for action* v Miring the interim\nperiods I hope you will explore various problems concerning\nthe school stations and do what you can to keep the enthusiasm\nof the school stations high* I should like you and your\ncommittee to serve as a sounding board for school station\nproblems and keep me advised of activities and projects that\nare underway* I trust you will serve as the reporter for school\nstations to the NAEB Newsletter each month.\nI am extremely sensitive to the fact that there is\nno school station person on the Board and hope that this committee\nworking in cooperation with the In-School Programs Committee,\nJim McAndrew, Chairman, will see to it that the interests, desires,\nand goals of the school stations are promoted at all times. I\nhave established this committee independently of the In-Gchool\nPrograms Committee, but I trust there will be some liason and\ncooperation between the two. You should work with John Dunn,\nChairman of the Membership Committee, in promoting new school\nstation members in the organization but perhaps it is best to\nleave the oirectives for the committee up to the committee\nitself with the general statement that yours is the responsi¬\nbility of representing in this organization the public school\nstations*"
}