{
  "id": "d1025-150",
  "text": "NAEB Radio Network\n111 Gregory Hall\nUrbana, Illinois\nAugust 23, 1955\nMEMO:\nTO: Network Members\nStation Engineers\nFROM: Network Headquarters\nRe: Poorly spliced tapes\nA close inspection of Network tape-returns has revealed an alarming number\nof poorly spliced tapes. Some tapes are spliced by winding transparent tape com¬\npletely around the tape, covering the oxide layer. We find some of this type by\ncandling the tapes or we hear the interrupted signal when we monitor duplicates.\nOther tapes are found spliced with gummy electrical tape or over-size transparent\ntape. We catch some of these when they stick to the duplicator recording heads\nand break. The most prevalent type of bad splice is where the ends of the tapes\nare not closely joined before splicing or they pull apart after splicing, leaving\nexposed adhesive, even though good splicing tape is used.\nWe*ve found it necessary to check each tape returned individually and have\nhired a new person just for that purpose. We*re finding many of the bad splices,\nbut we can*t check each tape inch by inch, and many bad splices are slipping past\nus. We need your help.\nWe use the splicing method outlined below. If you will call this method to\nthe attention of the people who handle your tape splicing, perhaps we can alleviate\nthis problem. We are not attempting to dictate the methods Network members use\nwhen splicing magnetic tape. All we are interested in is a good splice. This will\nenable us to operate at higher efficiency and will result in the circulation of\nbetter tapes which are less apt to skip or break during a program. Now for the\nmethods.\nMake sure the ends of the recording tape are rigid to prevent displacement\nwhile splicing. We use a splicing block, an Edi-tall splicing block or equivalent.\nIf it*s a blank tape, we overlap the tape ends to enable easy cutting and true\nalignment of both tape ends. Of course, no cutting should be done if a break in\na program tape is being repaired. The tape is cut in the diagonal ridge of the\nsplicing block. Then we make sure the tape ends are still butted and in alignment.\nA piece of splicing tape 3/h inch or less in length is centered over the\nbutted ends. After firmly pressing the splicing tape into position on the Hshiny”,\nacetate side of the recording tape, we rub the splicing tape firmly with the fin¬\ngernail to press out air bubbles. We use Scotch #Ul splicing tape 7/32\" wide which\ncomes in 66 foot rolls. Naturally, other comparable splicing tape is equally sat¬\nisfactory.\nAn alternate method is to use a wider (l/2n) splicing tape. If this method\nis used, the splicing tape should be placed diagonally across the tape and applied\nthe same way. The excess splicing tape should be trimmed FLUSH with the edges of\nthe recording tape, making sure no adhesive is left exposed.\nThank you for helping us keep our tape in good condition.\nt\n\\\n\\ '"
}