{
  "id": "d1025-170",
  "text": "Item 23\nREPORT OF THE NETWORK MANAGER\nApril 1, 19$6\nDae to the difficulties involved in undertaking this position, the new Network\nManager has not had the opportunity to investigate and evaluate all phases of\nNetwork operations since the time of the last report. However, there are some\nmatters with which he is familiar and now brings to your attention\nMEMBERSHIP. At the present time the Network has 72 member stations, with an-\notl^rlua to join in the very near future. Thus, since the last report the Net¬\nwork has made & net gain of two (2) stations. Needless to say, we hope for more\nadditions.\nPERSONNEL. Present Network staff personnel consists of four (h) full-time em¬\nployees plus three (3) half-time employees, making the staff the equivalent of\nfive and one-half ($|) full-time employees. However, it is important to point\nout that of the seven employees presently working, six (6) (all save the Net¬\nwork Manager) will be leaving Network employment around June of this year.\nThus, the Network is faced with the challenge of hiring and breaking in prac¬\ntically an entire new staff. (Note by Skomia: A turnover of t§e same sort will\nalso occur then for secretarieX”and ML personnel.)\nEQUIPMENT. Although the present equipment is far from satisfactory, we are mak-\ning^He^est possible use of what we have. The duplicators are still acting up\nfrom time to time, s*mcl must be constantly checked. It must be emphasised that\neverything possible is, being done to maintain technical quality in our tapes,\nand for their painstaking efforts in this area all credit must be given to Cecil\nBidlack, the NAEB Television Engineer, and Glenn Blackburn, the Assistant Net¬\nwork Manager for Production. A qualified engineer on duty at all times is ur¬\ngently needed to maintain technical quality.\nOPERATION. It has been decided that the Network year trill be divided into four\nquarters of thirteen (13) weeks each beginning with the first complete week of\neach calendar year, and that a separate offering will be feade for. each quarter.\nAlso, to increase,accuracy and efficiency a number of clerical procedures have\nand will be changed.\nOUTPUT. During the past four, quarters, the Network has made considerable gains\nxn^output. For example, during the year 7/1/Sh - 6/30/55 the total air tune of\nNetwork programs broadcast over member stations was (in hours and minutes)\nUJ421:ii0 for the general offering; in contrast, the figure for the year 7/1/5$\n- 6/30/56 will be 16,331:00, a substantial increase since there are now fewer\nstations on the Network.\nPROGRAMMING. The quality of our programming continues high. Beside contribu-\ntionF^from'niismber stations, we are honored to have such sources as the BBC,\n• pbs, GBtf, RAI, etc. offering their fine programs over the Network.' There is,\nhowever, a need for more submissions from Network members, as we never can have\ntoo many good programs© Also, the Network is slowly gaining in its efforts to\nobtain a large number of fifteen (1$) minute programs for which demand con¬\nstantly exceeds supply©"
}