{
  "id": "d1025-172",
  "text": "NATIONAL ASSOCIATION\nof\nEDUCATIONAL BROADCASTERS\n14 Gregory Hall Urbana, Illinois\nJanuary 24, 1956\nMEMO:\nTO: Network Member Stations\nFROM: Harry J. Skornia\n%V>''\nRe: HIGH-FIDELITY MUSIC TAPES\nWe hope and believe that with our next program offering (for Summer 1956) we shall\nbe able to give you a definite plan for the distribution of relatively high-fidelity\nmusic tapes.\nThese tapes will be duplicated by an organization properly equipped to do the best\npossible work. They will be 24001 tapes recorded at 15 ips. (not 12001 tapes re¬\ncorded at 7i ips. as is our usual practice). Unless you can use 2400’ reels, you\nwill of course not be able to use these.\nTo cover the expense of producing and distributing these recordings, two alternate\nplans are envisioned. A station either may elect to receive the high-fidelity tapes\ninstead of an equivalent amount of tape (actually a ratio of one-hour of this music\noffering to two hours of usual -proRrams) from the remainder of the offering, or it\nmay elect to pay an extra assessment to cover the added costs, probably about $2,00\nper 2400’ reel.\nAs an example of the former alternative: If the Network offers thirteen half-hour\nprograms of top quality music (thirteen 2400* tapes), not available from any other\nsource, a station may elect to receive these instead of any thirteen one-hour\nprograms (twenty-six 1200’ tapes) or any twenty-six half-hour programs (again,\ntwenty-six 12001 tapes) from the rest of the offering.\nAs the planning for this \"hi-fi” music distribution is in the final stages, and will\nrepresent a considerable investment both in tapes and in cash, for subcontracting\nthe dubbing which we are not ourselves now set up to do, we hope you will as soon\nas possible send any comments or suggestions you may have. It is our thought now\nthat these series will not be made available except to stations who can provide\nproof of performance evidence, and has equipment good enough to justify the effort\nwe are making to keep quality standards at the highest possible level. The NAEB\nEngineering Committee has in draft form guidance for the standards which we shall\nneed to establish in this project.\nLet us have your reactions.\nJH:HJS:jy"
}