{
  "id": "d1025-46",
  "text": "Report of Acceptance Ccasaitte® meetings in Columbus\nPage 2\n5<> Propaganda programs shall be accepted or rejected on their merits,\nand no set procedure established to either accept or reject such\nprograms siT*ply because of their type* The committee went on\nrecord as not being \"afraid of government propaganda0°\n6* Holt is to write letters, reporting acceptance or rejection, to\nsubmitting stations after vote has been reported by chairman*\n7® It was decided that program submission forms must be received\nby the committee before they will attempt to evaluate the program*\nBe. Decisions on programs of a timely nature will be mad© by Skomia,\nHolt and Hill, and will not be submitted to the Acceptance Committee «*\n90 The committee agreed that timing of shows is of the utmost importance\nand that submitting stations should be constantly urged to \"tailor**\ntheir shows properly*\n10* It was agreed that one minor change should be made in the submission\nform, i «@ *, a place to indicate what brand of recorder was used in\nrecording the program®\nHo It was agreed that it would not be feasible to establish absolute\nstandards of acceptance, because it is better to judge each series\non its own merits*\nThe committee then voted on programs on which definite decision was still\nlacking!\n1» The following programs were approved for network distribution*\nAIR TRAINING (Air Fore® program)\nARCHITECTURE (KPFA)\nFINGERPRINTS OF MUSIC (WUQM)\nSPENCER SNOW SINGS (KWAX)\nTOWARD A MORE FRIENDLY WORLD (American Friends Service Committee)\nWINDOWS OH THE WORLD (British Information Service)\n2» The following programs were rejected?\nON THE DEATH OF MAJOR ARMSTRONG (WGBH)\nLA GHA2NNE (WNYC)\nFAMILY LIVING (WILL)\nAMERICAN FAMILY TODAY (WEAR)\nGASTRONOMY (KPFA)\nDEPARTMENT OF JUSTICE (WCSM)\nEVERYBODY'S CHEMISTRY (WFUV)\nPRO MUSXCA (WNYC)\nWASHINGTON BACKGROUND (George Washington U»)\nMEET THE CO'TOSER (KPFA)\n3* Holt is to write letters to those submitting the above programs^\ninforming them of the action taken by the committee 0"
}