{
  "id": "d1858-20",
  "text": "-16-\nVALLO, an organ music program which is distributed throughout Alabama on 25\nstations and is 'carried in Florida, Indiana, on the Voice of America, and on\nthe Egyptian state network. They have also produced a series, MONTEVALLO NOC¬\nTURNES, which is carried on eleven stations. Alabama Polytechnic's daily news\nis sent to stations all over the state.\nThe University of Alabama's WUOA and the radio services are under the Extension\ndivision. The teaching department has a carrier current station which is en¬\ntirely separate and is said to be the largest wired wireless station in the\nworld: (Virginia:please note). The purpose of the radio services is \"to extend\nthe resources of the University to the people of the state.” The staff consists\nof 9 full-time people and 11 part-time student assistants. Ten programs are\nproduced each week for commercial stations, some of these for state agencies;\none of the purposes of the organization being to provide help for such organiz¬\nations. One of the programs being produced is DOCUMENT: DEEP SOUTH, a NAEB-FAE\nGrant-In-Aid program. This series is a development from ALABAMA DOCUMENT, an\naward winning program at the Ohio Institute. DOCUMENT: DEEP SOUTH has been a\ndifficult series to produce, having so far involved 11,000 miles of travel. Six\nprograms have been produced at this time. The series is being carried on 23\nstations in Alabama. The PTA series is being carried on 22 stations. Radio\nservices send out 60 tapes per week. They also originate broadcasts for stations\napd networks whether WUOA carried the programs or not. WUOA operates at a power\nof 4800 watts, 10 hours a day, Sunday through Friday. The station carries all\nNAEB programs, scheduling them initially at night, then repeating them the fol¬\nlowing day. Two or three months ago they initiated block programming in 2-3\nhour blocks and have had very good reaction. In addition to BBC programs from\nNAEB, they are also carrying other BBC transcribed programs. They are planning\nto carry the foreign language programs. The Comedie Francaise will be heard,\nin French, in the heart of Alabama.\nTelevision\nThe FCC has allocated five channels (two VHF, three UHF) for educational tele¬\nvision in Alabama. The VHF channels are reserved for Tuscaloosa (the Univer¬\nsity 6f Alabama)and Birmingham; the UHF channels for Auburn (Alabama Polytech¬\nnic Institute),- Montgomery and Mobile.\nThe Governor's Conference on Educational Television met in Montgomery during\nthe last week in February, 1953. Delegates represented education, business,\nindustry, civic groups, a segment of the State Legislature and the general pub¬\nlic. The conference endorsed the use of educational television and suggested\nthat the Governor name a commission to draft plans and supervise the television\nsystem.\nGovernor Gordon Persons has named a nine-member commission to study and plan\nan educational television network for the state. This committee includes re¬\npresentatives from the University of Alabama, Alabama College and Alabama Poly¬\ntechnic Institute, the State Education Department, the State Legislature, the\npress and the general public. The committee has not yet held a formal meeting.\nIt is expected that the State Legislature will be asked during the biennial\nsession opening in May to appropriate funds for one-half the cost for construc¬\ntion and operation of one or more of the proposed educational TV stations, as an\nindication that all of the reserved channels might be used eventually for a\nstate-wide network.\nSeveral preliminary studies and surveys have been made regarding the use of these"
}