{
  "id": "d1858-6",
  "text": "- 2 -\nspace was made available, and a national headquarters was set up. This was a\ngreat step forward.\nIt came at a fortunate -time, because on the 10th of October, 1950, the FCC began\nto consider the problem of television allocations. The NAEB immediately stepped\nin. Dick Hull sent out (collect) telegrams to all the members. On the 16th of\nOctober there was a meeting at the Office of Education in Washington. The prob¬\nlems seemed insurmountable. It was going to be a tremendously expensive under¬\ntaking to plead the rights of education before the FCC, and there was no money.\nNot only that, but it seemed unlikely that anyone qualified to plead before the\n•FCC would care to represent the lost cause of education. But the NAEB raised\n*$50,000 to surmount the first item, and got General .Telford Taylor, formerly\nChief Counsel of the FCC, to represent the cause of education. ’’Never before\ndid so many confuse so few with so little.’’ Witnesses were brought in from\nall over the country. Senators testified as did presidents of universities.\nThe FCC’s decision to allocate 242 channels to educational television was more\nthan the NAEB had asked for. It was more than all the non-commercial radio\nstations on the air. in America at any time. One of the most convincing argu¬\nments which perhaps more than any other swayed the FCC’s decision was the\nMonitoring Study of Commercial Television which the NAEB had conducted. It was\na shocker. We may truly say that educational television is an achievement of\nthe NAEB. As a result, the trade magazines learned how to spell education. We\nbegan to be a force in America.\nThe NAEB then became the recipient of a grant from The Fund for Adult Education.\nAt a meeting on the tennis courts of the University of Chicago, the Executive\nBoard of the NAEB considered this overwhelming responsibility: $300,000 to be\nspent in programming. They were appalled. In the first try, in bringing to¬\ngether a professional group, they found that there had been produced a fine,\nbut not educational* show. They found that on a commercial program the educa¬\ntional consultant verifies dates. They scrapped the program and started over,\nmaking the educational consultant the final authority. It was very hard on\nprofessional script writers, but two of the series produced in this way, THE\nWAYS OF MANKIND and JEFFERSONIAN HERITAGE were so outstanding that they were\nnamed the two top programs in America by radio critic, Jack Gould. And other\nprograms, while perhaps not as outstanding, have been of great interest and\nhave been well received.\nIn the area of international exchange on radio programs, commercial radio had\ndone little or nothing and had, in fact, on one occasion at least, airily\nturned down an invitation from the French Broadcasting System who very generous¬\nly offered their Radio Diffusion*'Francaise (RDF) shows to be carried commerci¬\nally. The NAEB is approaching this problem differently. We have established\nvery cordial relationships with RDF, BBC, Radio. Italia, and others. We are\nbeginning to exchange program's with these systems in their own languages.\nThis is an opportunity for the improvement Of international relations which is\ntremendous. We have now begun to have a voice in the selection of some Fulbright\nFellows, and one achievement in international broadcast which deserves special\nmention: the BBC is- carrying the JEFFERSONIAN HERITAGE, something the Voice\nof America has never been able ta get the BBC to do with an American show.\nNAEB is beginning to do a job for the country.\nThe next speaker was Graydcn Ausmus on the subject ’’NAEB—Our Dreams”:\nOur dreams, said Mr. Ausmus, for the future am.an expansion of our dreams of\nthe past. Under Dick Hull as President, we established the Tape Network. Sy"
}