{
  "id": "d1430-10",
  "text": "NBC Public Service Prog ram\nTime\nFriday\n12:30-l :00 p.m. “U. S. Marine Band” (from Washington).\nSaturday\n1:30-l :45 p.m. “The Baxters Invest in Health”, drama;\nNational Congress of Parent and Teach¬\ners Associations.\n1:45-2:00 p.m. “War Telescope”—John MacVane from\nLondon via shortwave.\n6:00-6:30 p.m. “I Sustain the Wings”—Army Air\nForce Band, Capt. Glenn Miller con¬\nducting.\nWBAL Program\n12:30-12:45, “Masters of Rhythm,” transcribed\nmusic with six spot announcements; 12:45-1,\nTreasury Salute”, transcribed music.\n“Latest News”; spot announcement for\nArnd deodorant; 1:35-1:45, “Behind the News”.\nFront-Page Drama,” electrical transcription,\ncommercial program sponsored by Sunday\nAmerican.\n6-6:05, “Esso News”, sponsored by Standard Oil\nCo.; 6:05-6:15, “National Sports”, sponsored by\nNational Beer Co.; transcribed spot announce-\nmen^/or “Whiz Candy”; 6:15-6:30, “Paul Robert¬\nson lalk , political speech.\nE. REPRESENTATIONS MADE IN COURT:\nSTATION KHMO\n. Th<: KHMO case (4 F.C.C. 505; 70 App. D. C. 80)\nis of interest because it involves an element of judicial\nreview, and a comparison of representations made in\ncourt with present performance.\nThe Courier Post Publishing Company of Hannibal,\nMissouri, now the licensee of Station KHMO, originally\napplied for a new station at Hannibal in 1936, as did a\ncompeting applicant. The Commission, after a hearing,\nwas unable to find that a need existed for a local station\nm Hannibal and accordingly both applications were de¬\nnied.\nOn appeal to the U. S. Court of Appeals for the Dis¬\ntrict of Columbia (70 App. D.C. 80, 104 F.(2d) 213),\nthe Court found that the Commission was in error, and\nthat a need did exist for a local broadcast station to serve\nthe particular local interests of the Hannibal community\nSpeaking through Judge Vinson, the Court noted (pp.\n82-83) that service was available from other stations, but\nthat “none of these stations provide for the local needs\nof Hannibal.” The Court cited a Commission definition\nof a local station as one which would serve “to present\nprograms of local interest to the residents of that com-\nmunity; to utilize and develop local entertainment talent\nwhich the record indicates is available; to serve local\nreligious, educational, civic, patriotic, and other organiza¬\ntions; to broadcast local news; and to generally provide\na means of local public expression and a local broadcast\nservice to listeners in that area.” 1\n\" ,.The Court cited in detail the programs which the ap-\nphcant proposed to broadcast2 * * * & and relied in particular on\n1 Okmulgee Broadcasting Corporation, 4 FCC 302\n2 Thus the Court noted that the applicant “proposed to give portions of\n}!f_ YU^out 9h.arge> t0 the various local civic, educational, athfetic farm¬\ning, fraternal, religious, and charitable organizations. Its proposed n’roeram\nconsists of: Entertainment 42%, educational 20%, news 9% religious^\nagriculture 10%, fraternal 5%, and civic activities 5%. The tentative nro\ngram contemplated, particularly, the use of the facilities of the stalfon to\naid education m supplementing classroom work, and in broadcastine from\na secondary studio located at Hannibal La Grange College sublets S\nscholastic interest and athletic events; the use by the Hannibal Chamber of\nCommerce to further business relations; the use by the County Agriculture\n*£* to krm,g before farmers and farm clubs the subject matter that is\n^ ,rl th;0U/h- United States Department of Agriculture and Missouri\nAgriculture on farm problems; the use by the County Health\n& Tmhi gIVC I“for1matlon concerning maternity and child health public\nhealth problems, particularly prevention of disease, food and milk control\nsanitation; the use of the station by business in advertising- the\npromotion of literary and philanthropic activities; the promotion of better\n[9]\nthe applicant s representations that it “planned to use\nlocal talent—an abundance of which was shown to be\navailable and m this manner serve public interest of\nthat area. Thus, it appears that the petition for a con¬\nstruction permit is supported by overwhelming evidence\nshowing the local need for a local station to serve in the\nmanner set out”. (Emphasis supplied.)\nPursuant to this decision of the Court of Appeals, the\nCommission granted a license. It appears, however, that\nthe program service rendered is markedly different from\nthe representations upon which the Court relied. For\nexample, only 14.2 percent of the station’s time for the\nweek begmmng April 22, 1945, was devoted to the “local\ntalent said to be so abundant in the area. More than\n85.8 percent of its time, in contrast, was devoted to net¬\nwork programs and transcriptions. Instead of giving its\ntime without charge” to local religious organizations, as\nrepresented Station KHMO sold 4% hours of time dur¬\ning the week to such organizations on a commercial basis,\nouf charge^ ^ ^ ** l0Cal rdigious Pr°grams with-\nPART II. COMMISSION JURISDICTION WITH\nRESPECT TO PROGRAM SERVICE\n, Jhnef cont!,ntion has at times been made that Section\nof Communications Act, which prohibits censor-\nlnterference Wlth free sPeech by the Commission,\nprecludes any concern on the part of the Commission with\nInnk^TfT -TI-Ce U- Iicensees* This contention over-\nooks the legislative history of the Radio Act of 1927\nthe consistent administrative practice of the Federal\nRadio Commission, the re-enactment of identical provi-\nSH0nSin Tu Communications Act of 1934 with full knowl¬\nedge by the Congress that the language covered a Com¬\nmission concern with program service, the relevant court\ndecisions, and this Commission’s concern with program\nservice since 1934. H 6\nThe Communications Act, like the Radio Act of 1927\ndirects the Commission to grant licenses and renewals\nof licenses only if public interest, convenience and neces-\nt£VeiCYSPMt:c.tA in?TorSco°L?\\yn!1Ca^CUltUre, ™d- sociaI activities of\nservices of the several Hannibal churches.’” 80^82 3rf g!°US\n3 Including news programs read off the ticker bfaVal ^nfincer'^"
}