{
  "id": "d1430-11",
  "text": "sity will be served thereby. The first duty of the Federal\nRadio Commission, created by the Act of 1927, was to\ngive concrete meaning to the phrase “public interest” by\nformulating standards to be applied in granting licenses\nfor the use of practically all the then available radio fre¬\nquencies. From the beginning it assumed that program\nservice was a prime factor to be taken into consideration.\nThe renewal forms prepared by it in 1927 included the\nfollowing questions:\n(11) Attach printed program for the last week.\n(12) Why will the operation of the station he in the\npublic convenience, interest and necessity?\n(a) Average amount of time weekly devoted to\nthe following services (1) entertainment\n(2) religious (3) commercial (4) educa¬\ntional (5) agricultural (6) fraternal.\n(b) Is direct advertising conducted in the in¬\nterest of the applicant or others?\nCopies of this form were submitted for Congressional\nconsideration.1\nIn its Annual Report to Congress for 1928, the Com¬\nmission stated (p. 161):\n“The Commission believes it is entitled to consider\nthe program service rendered by the various applicants,\nto compare them, and to favor those which render the\nbest service.”\nThe Federal Radio Commission was first created for a\nterm of one year only. In 1928 a bill was introduced to\nextend this term and extensive hearings were held before\nthe House Committee on Merchant Marine and Fisheries.\nThe Commissioners appeared before the Committee and\nwere questioned at length as to their administration of\nthe Act. At that time Commissioner Caldwell reported\nthat the Commission had taken the position that\n. . each station occupying a desirable channel should\nbe kept on its toes to produce and present the best\nprograms possible and, if any station slips from that\nhigh standard, another station which is putting on pro¬\ngrams of a better standard should have the right to\ncontest the first station’s position and after hearing\nthe full testimony, to replace it.” (Hearings on Juris¬\ndiction, p. 188.)\nThe Commissioner also reported that he had concluded,\nafter 18 months’ experience, that station selections should\nnot be made on the basis of priority in use and stated\nthat he had found that a policy—\n. . of hearings, by which there is presented full tes¬\ntimony on the demonstrated capacity of the station\nto render service, is a much better test of who is en¬\ntitled to those channels.” (Ibid.)\nBy 1929 the Commission had formulated its standard\nof the program service which would meet, in fair propor¬\ntion, “the tastes, needs and desires of all substantial\ngroups among the listening public.” A well-rounded pro¬\ngram service, it said, should consist of\n“entertainment, consisting of music of both classical\nand lighter grades, religion, education, and instruction,\n1 Hearings on Jurisdiction of Radio Commission, House Committee on\nMerchant Marine and Fisheries, 1928, p. 26.\nimportant public events, discussion of public questions,\nweather, market reports, and news and matters of in¬\nterest to all members of the family.” (Great Lakes\nBroadcasting Co., reported in F.R.C., 3d Annual Re¬\nport, pp. 33-35.)\nBy the time Congress had under consideration replac¬\ning the Radio Act of 1927 with a new regulatory statute,\nthere no longer existed any doubt that the Commission\ndid possess the power to take over-all program service\ninto account. The broadcasting industry itself recog¬\nnized the “manifest duty” of the Commission to consider\nprogram service. In 1934, at hearings before the House\nCommittee on Interstate Commerce on one of the bills\nwhich finally culminated in the Communications Act of\n1934, the National Association of Broadcasters sub¬\nmitted a statement which contained the following (Hear¬\nings on H. R. 8301, 73rd Cong., p. 117):\n“It is the manifest duty of the licensing authority, in\npassing upon applications for licenses or the renewal\nthereof, to determine whether or not the applicant is\nrendering or can render an adequate public service.\nSuch service necessarily includes broadcasting of a\nconsiderable proportion of programs devoted to educa¬\ntion, religion, labor, agricultural. and similar activities\nconcerned with human betterment. In actual practice\nover a period of 7 years, as the records of the Federal\nRadio Commission amply prove, this has been the\nprincipal test which the Commission has applied in\ndealing with broadcasting applications.” (Emphasis\nsupplied.)\nIn hearings before the same committee on the same\nbill (H. R. 8301, 73rd Cong.) Chairman Sykes of the\nFederal Radio Commission testified (pp. 350-352):\n“That act puts upon the individual licensee of a broad¬\ncast station the private initiative to see that those pro¬\ngrams that he broadcasts are in the public interest. . . .\nThen that act makes those individual licensees respon¬\nsible to the licensing authority to see that their opera¬\ntions are in the public interest.” '\n5(5 * * * * *\n“Our licenses to broadcasting stations last for 6 months.\nThe law says that they must operate in the public in¬\nterest, convenience, and necessity. When the time for\na renewal of those station licenses comes up, it is the\nduty of the Commission in passing on whether• or not\nthat station should be relicensed for another licensing\nperiod, to say whether or not their past performance\nduring the last license period has been in the public\ninterest” (Emphasis supplied.)\n5)5 5(5 5(5 5(5 5|s *\n“Under the law, of course, we cannot refuse a renewal\nuntil there is a hearing before the Commission. We\nwould have to have a hearing before the Commission,\nto go thoroughly into the nature of all of the broad¬\ncasts of those stations, consider all of those broadcasts,\nand then say whether or not it was operating in the\npublic interest.”\nIn the full knowledge of this established procedure of\nthe Federal Radio Commission, the Congress thereupon\nre-enacted the relevant provisions in the Communications\nAct of 1934.\n[10]"
}