{
  "id": "d1430-19",
  "text": "among advertisers and advertising agencies. In 1944,\nfor example:\n26% of CBS business came from 4 advertisers.\n38% of CBS business was handled by 4 advertising\nagencies.\n25% of ABC (Blue Network) business came from 4\nadvertisers.\n37% of ABC (Blue Network) business was handled\nby 4 advertising agencies.\n23% of MBS business came from 4 advertisers.\n31% of MBS business was handled by 4 advertising\nagencies.11\nOne advertiser, Proctor & Gamble, is reputed to have\nspent $22,000,000 on radio advertising in 1944. It pur¬\nchased approximately 2,000 hours a week of station time\n—equivalent to the entire weekly time, from sign-on to\nsign-off, of more than 18 broadcast stations. Proctor &\nGamble, of course, produces many of its own shows\nthrough its own advertising agencies and has control\nover all its shows. This control is exercised, naturally\nenough, for the purpose of selling soap. It may inci¬\ndentally have profound effects on the manners, mores,\nand opinions of the millions who listen. That is an in¬\nevitable feature of the American system of broadcasting;\nbut it is not inevitable that only programs so produced\nand so controlled shall reach the ear of American listeners.\nThe sustaining program is the necessary makeweight.\n(6) Statistics oj Sustaining Programs\nBut while networks and stations alike have tradi¬\ntionally recognized the importance of the sustaining\nprogram as an integral part of the American system of\nbroadcasting, there is evidence to suggest that such pro¬\ngrams are disappearing from the program service of some\nstations, especially during the best listening hours.\nNo accurate statistical series has yet been established\nto determine the proportion of time devoted to sustaining\nprograms, or the trends from year to year. In the most\nrecent annual reports of stations and networks to the\nCommission, however, station licensees have analyzed\ntheir program structure for the month of January 1945.\nSince no definition of “sustaining” has heretofore been\npromulgated, these figures must be approached with\ncaution. Some stations, for example, classify a 15-minute\n“participating” program as sustaining, even though it is\ninterrupted by three-four, or five spot announcements.\nSome “bonus” stations which carry network programs\nwithout direct remuneration from the network classify\nall their network commercial programs as “sustaining.”\nThe returns to the Commission are in some cases care¬\nlessly prepared; some stations, for example, report more\nthan 5 hours of programs daily between 6 and 11 p. m.\nu Broadcasting Yearbook, 1945, pp. 30, 32. Comparable data for NBC\nnot available.\nSome of the returns are wholly unusable. Nevertheless,\nthe returns of 703 stations for the month of January 1945\nappeared sufficiently complete to warrant tabulation.\nThese 703 stations were on the air an average of 16\nhours and 5 minutes daily. Of this time, they reported\n8 hours and 40 minutes, or 53.9 percent, as commercial,\nand the remaining 7 hours and 25 minutes, or 46.1 per¬\ncent, as sustaining.\nThese overall figures suggest that the sustaining pro¬\ngram remains a major part of broadcasting today. On\ncloser analysis, however, certain questions arise.\nFirst, it should be noted that in general, the larger\nstations carried a considerably smaller percentage of\nsustaining programs than the smaller stations, as shown\non the following table:\nAVERAGE HOURS PER DAY AND PERCENTAGE OF\nTIME ON THE AIR DEVOTED TO COMMERCIAL AND\nSUSTAINING PROGRAMS BY CLASS OF STATION\nFor month of January, 1945\nCommercial Sustaining\nHours % of Hours % of\nper time per time\nday on air day on air\n50 kw stations (41).. 12:50 67.3 6:14 32.7\n500 w—50 kw stations (214). 10:41 61.3 6:45 38.7\n250 w or less stations (376). 7:37 47.6 8:23 52.4\nPart time stations (72). 5:46 53.3 5:30 46.7\nAll stations (703). 8:40 53.9 7:25 46.1\nSecond, the proportion of time devoted to sustaining\nprograms during the best listening hours from 6 to 11\np.m. was lower than during other hours:\nAVERAGE HOURS AND PERCENTAGE OF TIME ON\nTHE AIR, 6 TO 11 P. M„ DEVOTED TO COMMERCIAL\nAND SUSTAINING PROGRAMS BY CLASS OF STATION\nFor month of January, 1945\nHours % of Hours % of\nper time per time\nday on air day on air\n6 P.M. to 11 P.M. only\n50 kw stations (41). 4:16 84.7 :46 15.3\n500 w—50 kw stations (214). 3:38 72.9 1:21 27.1\n250 w or less stations (376). 2:38 53.9 2:16 46.1\nPart time stations (72). :46 60.5 :31 39.5\nAll stations (703). 2:51 62.4 1:43 37.6\nSource: Annual Financial Reports, 1944.\nThe above statistics are, of course, averages, and hence\ndo not illustrate the paucity of sustaining programs on\nparticular stations. The four following charts show in\nblack the commercial programs, and in white the sustain¬\ning programs, of Stations WLW, WBAL, WCAU, and\nWSIX for a random week. Especially noteworthy is the\ntendency to crowd sustaining programs into the Saturday\nafternoon and Sunday morning segments, and to crowd\nthem out of the best listening hours from 6 to 11 p.m.\nr i« j"
}