{
  "id": "d1430-34",
  "text": "Sea Soldiers’ Chorus” and the “Marine Symphony\nOrchestra.” It was carried by SO of the 215 MBS affili¬\nates to which it was made available on Wednesday\nApril 26, 1944.\n“Mutual’s Radio Chapel,” a sustaining religious pro¬\ngram, was made available to all MBS affiliates. On\nSunday, April 23, 1944, thirteen MBS stations carried it.\nNo comparable figures were available from the Blue\nNetwork (now the American Broadcasting Company).\nThe extent to which network sustaining programs have\nbeen neglected is well illustrated by this failure of the\nBlue. Network even to determine whether or not its\nsustaining programs were being carried. It is difficult\nto see how a network can maintain a well-balanced pro¬\ngram. structure or can determine which of its network\nsustaining programs to continue and which to replace,\nif it has not even determined the extent to which such\nprograms are being carried by its affiliates.\nThe eight charts following page 23 show the rarity\nof network sustaining programs from 6 to 11 p.m. on\nthe “basic affiliate” stations of the four major net¬\nworks. Network sustaining programs are shown by\na white “S” superimposed on a black square. It will\nbe noted that the following “basic affiliates” carried no\nnetwork sustaining programs whatever from 6 to 11 pm\non Sunday, April 23, 1944:\nWXYZ\nWTOL\nWPRO\nWLW\nWING\nWMT\nWJR\nWAVE\nWHDH\nWGAR\nWBBM\nWCSH\nWMAL\nWCED\nWKRC\nWHAM\nWISH\nKOIL\nWIBC\nWIRE\nWTCN\nKMBC\nWHO\nWTMJ\nWCOL\nWKBW\nWSYR\nWDEL\nWEMP\nWCKY\nWSPD\nWTIC\nSimilarly, the following “basic affiliates” carried no\nnetwork sustaining programs whatever on Monday,\nWCKY WBZA\nKMOX WTIC\nWGAR WDEL\nWMT WRC\nWHAS WWJ\nWFBM WLW\nKDKA WAVE\nKYW WIRE\nWSPD WTMT\nWBAL KSTP\nWHAM WOW\nWBZ WMAQ\nThe paucity of network sustaining programs shown on\nthe charts following page 23 results from two factors:\nfirst, the failure of the networks to supply sustaining\nprograms in quantity during the best listening hours\nand second, the failure of some stations to carry even\nthose network sustaining programs which are offered.\nThe mere fact that a station does not carry an out¬\nstanding network sustaining program does not mean, of\ncourse, that it has sacrificed public interest for private\ngain. In any particular case, the decision to cancel a\n[33]\n/ipm z^t-, irom o to 11 p. m.\nWELI\nWAGE\nWWVA\nWAKR\nWJW\nWXYZ\nWING\nWENR-\nKCMO\nWHDH\nWMAL\nWISH\nWFIL\nWEBR\nWOWO\nWSAI\nWNBH\nWEMP\nWLS WTOL\nWABC\nWEEI\nWJR\nWCED\nWDRC\nWCAU\nWPRO\nWFBL\nWTOP\nWTAG\nWJAS\nKRNT\nWBBM\nKMBC\nWADC\nnetwork sustaining program may be a wise one, reached\non the basis of the availability of a local program of\nstill greater public interest. To determine whether this\nis the case, it is necessary to compare the network sus¬\ntaining program rejected with the program scheduled\nm 1^s stead, and to view the network sustaining program\nas part of a particular station’s schedule.\nAn example of this technique may be supplied with\nrespect to Station WCAU. This is a 50,000-watt sta-\noccupying an entire clear channel by itself. Station\nWCAU is affiliated with the Columbia Broadcasting Sys¬\ntem and is owned by the group which also controls CBS.\nHence WCAU might be expected to make available to\nits listeners at least the outstanding CBS sustaining pro¬\ngrams. Indeed, one of the grounds relied on by the\nFederal Radio Commission when awarding a clear chan¬\nnel to Station WCAU as against competing applicants\nfor such assignments was that WCAU would carry the\nprograms of the Columbia Broadcasting System. (F.\nR. C. Docket No. 880, decided November 17, 1931.)\nOf the 3,165 minutes of network sustaining programs\nmade available to Station WCAU by CBS during the\nweek beginning February 8, 1945, Station WCAU broad¬\ncast 1,285 minutes, or 40.6%. From 6 p.m. to 11 p.m.\nthroughout the week, however, Station WCAU broad¬\ncast only 55 minutes of network sustaining programs, or\n20.8% of the network sustaining programs available to\nit during this time. On Mondays, Wednesdays, and\nThursdays, WCAU broadcast no network sustaining pro¬\ngrams whatever from 9:45 a.m. to 11 p.m. The full\nschedule of network sustaining programs carried by Sta¬\ntion WCAU was as follows:\n8 a.m.-\n1 p.m.-\n6 p.m.-\n11 p.m.-\n1 p.m.\n6 p.m.\n11 p.m.\n1:02 a.m.\nTotal\nSunday.\n... 180\n30\nnone\n95\n305\nMonday.\n... 45\nnone\nnone\n65\n110\nTuesday.\n... 45\nnone\n30\n65\n140\nWednesday. . .\n. .. 45\nnone\nnone\n65\n110\nThursday.\n... 45\nnone\nnone\n100\n145\nFriday.\n.. . 45\nnone\n15\n65\n125\nSaturday__ .\n... 45\n200\n10\n95\n350\nTotal.\n.. 450\n230\n55\n550 1,\n285\nMore than 63% of all network sustaining programs\ncarried by WCAU between the hours of 8 a.m. and 11\np.m. were on Saturday and Sunday. Network sustaining\nprograms from 8 a.m. to 11 p.m., by days, were broad¬\ncast as follows:\nSunday.. 210 minutes\nMonday . 45 minutes\nTuesday. 75 minutes\nWednesday. 45 minutes\nThursday. 45 minutes\nFriday . 60 minutes\nSaturday . 255 minutes\nTotal. . 735 minutes\nAmong the CBS sustaining programs not carried by\nWCAU, and the WCAU programs substituted therefor,\nwere the following:"
}