{
  "id": "d1430-39",
  "text": "Neither local listeners nor local businessmen supported\nthe station.\n“The new management reversed this policy completely.\nAll attempts at copying outside stations were eliminated.\nManagement not only studied the activities peculiar to\nthat community but also took a personal interest in them.\nStation facilities were made available on a free basis to\ncivic institutions such as the Chamber of Commerce,\nwomen’s clubs, parent-teacher association, public schools,\nand Community Chest. School sports contests were\nbroadcast, and other programs of distinctly local inter¬\nest were developed. In a relatively short time an audi¬\nence of more than SO percent of all local radio listeners\nhad been attracted to the station * * * At the time the\nnew management came in, gross monthly income was\n$2,400 and at the end of 12 months this amount has\nbeen increased to $6,000. The new manager attributed\nall improvement to the policy of making the station a\nreal local institution and a true voice of the community.”'* 6\n(b) Amateur shows have been used effectively in\ndeveloping local talent. “An Illinois retailer has used\nthis type of show for a number of years and has built\nan audience which in 1942 surpassed in size the audience\nfor any other radio program broadcast at the same time\n* * * It was competing with John Charles Thomas,\nNew York Philharmonic, and the Army Hour. Only\nthe John Charles Thomas program approached the rating\nfor the local program. As in all programs which make\nuse of local talent of fair quality, a considerable audience\nwas attracted because of an interest in local people.”*\n(c) A feed mill in Missouri developed a quartet called\nthe “Happy Millers” which sang hillbilly and western\nmusic. “Public acceptance has been phenomenal, partly\nbecause of the interest of rural people in the type of enter¬\ntainment afforded but also because the entertainers are\nall local people and well known in the community .” 7\nThese few examples can no doubt be supplemented\nfrom their own experience by many alert station mana¬\ngers throughout the country.\nWhile parallels between broadcast stations and news¬\npapers must be approached with caution, their common\nelements with respect to local interest may be significant.\nThe local newspaper achieves world-wide news coverage\nthrough the great press associations, taps the country’s\nforemost writers and cartoonists through the feature\nsyndicates, and from the picture services procures photo¬\ngraphs from everywhere in abundant quantity. But the\nlocal newspaper editor, faced with such abundant in¬\ncoming material, does not therefore discharge his local\nreporters and photographers, nor does he seek to repro¬\nduce locally the New York Times or Daily News. He\nappreciates the keen interest in local material and makes\nthe most of that material—especially on the front page.\nThe hours from 6 to 11 p.m. are the “front page” of the\nbroadcast station. The statistics of local programming\nduring these hours, or generally, are not impressive.\nExtent of Local Live Program Service\nNo reliable statistics are currently available concern¬\ning the time devoted to local live programs, partly be¬\ncause there has heretofore been no accepted definition\nB Sandage, Radio Advertising for Retailers, p. 210. (Emphasis supplied.)\n«Ibid., pp. 166-167.\n7 Ibid., p. 161. (Emphasis supplied.)\nof “local live,” partly because “wire” programs of news\nsyndicated to many stations have been included in the\nlocal live classification, and partly because programs of\nphonograph records have been classified as “local live”\nby some stations if a live announcer intersperses adver¬\ntising comments among the records. The paucity of local\nlive, and especially local live sustaining programs, is in¬\ndicated, however, by the following table which shows the\ntime reported by 703 stations as having been devoted\nto local live programs in January, 1945. The table can\nperhaps be best interpreted as showing the time devoted\nto non-network, non-transcribed programs:\nAVERAGE HOURS PER DAY AND PERCENTAGE OF\nTIME ON THE AIR DEVOTED TO LOCAL LIVE PRO¬\nGRAMS BY CLASS OF STATION\nFor month of January, 1945\n50 kw stations (41).\n500 w—50 kw stations (214)\n250 w or less stations (376)..\nPart time stations (72).\nAll stations (703).\nCommercial Sustaining\nHours %of Hours % of\nper time per time\nday on air day on air\n3:02\n15.9\n1:52\n9.8\n2:23\n13.6\n1:11\n6.8\n1:43\n10.7\n1:00\n6.3\n2:11\n20.3\n1:09\n10.7\n2:02\n12.7\n1:07\n7.0\nSource: Annual Financial Reports, 1944.\nFrom 6 to 11 p.m., moreover, non-network, non-tran¬\nscribed programs are considerably rarer, amounting on\nthe average to only 42 minutes in five hours for all sta¬\ntions. Sustaining programs of this type average only 13\nminutes in five hours.\nAVERAGE HOURS AND PERCENTAGE OF\nTHE AIR, 6-11 P. M., DEVOTED TO LOCAL\nGRAMS BY CLASS OF STATION\nFor Month of January, 1945\nCommercial\nTIME ON\nLIVE PRO-\nHours % of\nSustaining\nHours % of\n6 p.m. to 11 p.m. only\n50 kw stations (41).\n500 w—50 kw stations (214). .\n250 w or less stations (376)....\nPart time stations (72).\nAll stations (703).\nSource: Annual Financial Reports, 1944.\nper\ntime\nper\ntime\nday\non air\nday\non air\n:36\n12.0\n:12\n3.9\n:34\n11.4\n:14\n4.7\n:29\n9.8\n:15\n4.9\n:11\n15.0\n:07\n8.7\n:29\n10.6\n:13\n4.9\nOn particular stations, of course, the picture is even\nmore extreme. The eight charts following page 23,\nabove, for example, show in white the time devoted to\nnon-network programs by the “basic affiliates” of the\nfour major networks. It will be noted that on Sunday,\nApril 23, 1944, the following stations carried no non¬\nnetwork programs whatever—and hence no local live\nprograms—during the best listening hours from 6 to\n11 pm.:\nWORC WAGE\nWFCI KQV\nWNBC WADC\nWCBM WCAO\nWTRY WEEI\nWMT WCAU\nWDRC WJAS\nWFBM WTOP\nKFAB WHBF\nWHAS KWK\nKDB WGY\nWBZ WTAM\nWBZA WMAQ\nWJAR WOW\nWRC\nIn the face of this progressive blackout of non-network\nprograms during the best listening hours on many sta¬\ntions, it has been proposed that some stations be licensed\n[38]"
}