{
  "id": "d1430-47",
  "text": "headache remedies is the following announcement over\nStation WBT, Charlotte, on September 4, 1944:\n“As every one of you well knows, the United States\nis face to face with a great challenge. People every¬\nwhere are seriously concerned about the Nation’s all-\nout effort. Regardless of how or where you serve,\nyour first duty is to keep well. Get adequate rest.\nFollow a reasonable diet. Exercise properly. Avoid\nunnecessary exposures or excesses. When a simple\nheadache develops, or the pain of neuralgia strikes,\ntry a BC Headache Powder. The quick-acting, pre¬\nscription-type ingredients in the BC formula usually\nwork fast and relieve in a hurry. Remember this.\nGet one of the 25-cent packages of BC today. You’ll\nlike the way BC eases tantalizing headaches and\nsoothes nerves ruffled or upset by pain. USE ONLY\nACCORDING TO DIRECTIONS, and consult a\nphysician when pains persist or recur frequently.”\nAnother announcement over the same station said\nin part:\n“All of us have a big job on our hands if we want\nto keep America the land of the free and the home\nof the brave. The all-out effort means hard work, and\nlots of it. Production must move forward—fasti\n* * * Get one of the 10 or 25-cent packages of BC\ntoday. * * *”\n(g) The physiological commercial. Appeals to listen¬\ners to “take an internal bath,” inquiring of the listener\nwhether he has the common ailment known as “Amer¬\nican stomach,” discussions of body odors, sluggish bile,\netc., are a distinguishing characteristic of American\nbroadcasting.\nVarious networks and stations impose various restric¬\ntions on such physiological advertising. Mr. Lewis Gan¬\nnett, well-known book critic, sums up listener reaction\nthus in the New York Herald Tribune for February 28,\n1945:\n“The aspect of home-front life which most disgusted\nme on return was the radio. BBC programs may be\ndull and army radio programs may be shallow, but if\nthe soldier in Europe has had a chance to hear the\nradio at all, he has heard it straight, without the neu¬\nrotic advertising twaddle which punctuates virtually\nevery American program. . . . The first evening that\nI sat by a radio at home, I heard one long parade of\nheadaches, coughs, aching muscles, stained teeth, ‘un¬\npleasant full feeling,’ and gastric hyperacidity. . . .\nOur radio evenings are a sick parade of sicknesses and\nif they haven’t yet made us a sick nation, I wonder\nwhy.”\nAccording to data compiled by the Publisher s In¬\nformation Bureau, more money is spent for network ad¬\nvertising of drugs and toilet goods than for any other\nproducts; 27.9% of all network gross billings is for\nsuch products. Drug and cosmetic advertising is said\nto have trebled between 1939 and 1944. The increasing\nidentification of radio as a purveyor of patent medicines\nand proprietary remedies raises serious problems which\nwarrant careful consideration by the broadcasting in¬\ndustry.\nProfessor Sandage’s survey, cited above, asked various\nadvertisers who did not use radio advertising the reason\nfor their refraining. His study states:\n“A common reason for nonuse in a few communi¬\nties was the character of advertising carried by local\nstations. Leading merchants commented that radio\nmessages carried on these stations were too much like\nthe patent medicine advertisements of pre-Federal\nTrade Commission days. These merchants did not\nwish to be associated on the air with such advertisers.”8\n(h) Propaganda in commercials. The commercial an¬\nnouncement is sometimes used to propagandize for a\npoint of view or one side of a debated issue rather than\nto sell goods and services. An example is the following\nannouncement over Station KWBU, Corpus Christi,\nTexas, on August 1, 1944:\n“When you see a C[entral] P[ower and] L[ight\nCompany] lineman hanging on a pole with one foot in\nheaven so to speak and hear him holler ‘headache’,\nyou better start running. He is not telling you how he\nfeels but giving warning that he dropped a wrench or\nhammer and everyone had better look out below.\nThe C[entral] P[ower and] L[ight Company] line¬\nman has a tough job of keeping the electricity flowing\nto your home. They work night and day to keep\nheadaches from you—to keep your lamps lit and your\nradio running despite lightning, floods, and storms.\nOnly carefully trained and experienced men could do\nthis job, but there are some in this country who think\nthat the Government should own and operate the light\nand power industry. Then a lineman might hold his\njob for political reasons rather than for his ability to\nrender good service to you. Business management\nunder public regulation has brought you good reliable\nelectric service at low prewar prices. That is the\nAmerican way—let’s keep it.”\nA second example is the following, broadcast over 12\nMichigan stations in 1944:\n“American Medicine, the private practice of which\nrepresents the cumulative knowledge of decades, the\nheritage of centuries, the sacrifices and discoveries of\ncountless individuals, has made the United States the\nhealthiest country in the world. Spinal meningitis,\ndiphtheria, smallpox, typhoid fever and other fatal\ndiseases, scourges of yesteryear, are today either pre¬\nventable or curable, a credit to the tireless efforts of\nthe American medical profession. Thirty-seven states\nnow have voluntary prepayment medical or hospital\nplans developed by the medical profession and the\nhospitals. No theoretical plan, government controlled\nand operated, and paid for by you, should replace the\ntried and proved system of the private practice of\nmedicine now in use.” 9\nOn January 10, 1944, four days after the U. S. Depart¬\nment of Justice filed suit against the DuPont Company\nin connection with an alleged cartel agreement, DuPont\nused its commercial advertising period on the well-known\n»Sendagey Radio Advertising for Retailers, p. 73.\n» Journal of the American Medical Association, Vol. 127, No. 5,\n(February 3, 1945). Emphasis supplied.\n[46]"
}