{
  "id": "d1430-51",
  "text": "Table 6 shows comparable data for the major networks\nand their key stations. It will be noted that in 1939,\nthe first year for which comparable data are available,\nthe rate of return (subject to Federal income tax) on\nthe original cost of all tangible broadcast property of\nthe networks was 75.8 percent and the rate of return on\ndepreciated cost was 124.5 percent. By 1944 the rate\nof return had increased to 140.7 percent and 315.3\npercent, respectively.\nTABLE 6\nBroadcast income, original cost and depreciated cost of tangible broadcast property, of major networks and their key stations\nBroadcast Property Ratio of Ratio of\nBroadcast Original cost Depreciated income to income to\nYear income to licensee cost original cost depreciated cost\n(dollars) (dollars) (dollars)(percent)(percent)\n1944.\n1943.\n1942.\n1941.\n1940.\n1939.\n20,283,746\n14,418,690\n6,433,298\n140.7\n19,455,701\n13,884,632\n6,645,688\n140.1\n13,918,712\n10,336,822\n5,442,218\n134.7\n14,681,993\n9,934,697\n5,596,815\n147.8\n11,276,361\n11,920,128\n7,373,996\n94.6\n8,371,925\n11,044,985\n6,725,879\n75.8\n315.3\n292.8'\n255.8:\n262.3\n152.9*\n124.5\nExplanatory Note:\n(1) “Key Stations” are those owned and operated stations of the major networks which serve as the originating points for most of\nthe networks programs. In the annual reports filed for these stations, an adequate segregation between network expenses and\nstation expenses is not made. In 1944 there were ten such stations; prior to 1944 there were nine.\nSource: Annual financial reports of networks and licensees of broadcast stations.\nTables 7, 8 and 9 show the trends of broadcast reve¬\nnues, expenses, and income, expressed as a ratio to the\n1938 figures (1938=100). 1938 has been chosen as a\nbase because it is the first year for which comparable\nfigures are available for these three tables.\nIt will be noted in Table 7 that the index of broadcast\nrevenues of all networks and stations increased to 247\nby 1944, whereas broadcast expenses increased only to\n200. In other words, the increase in revenues was not\ndevoted proportionately to an increase in expenditures\nfor serving the public. Instead, the portion retained\nwas sufficient to increase broadcast income, before Fed¬\neral income tax, to 479 in 1944.\nTable 8 shows comparable data for the major networks\nand their key stations. It will be noted that while the\nrevenue index increased to 210 by 1944, total broadcast\nexpenses increased only to 191. As a result broadcast\nincome increased to 294.\nTable 8 also shows the trend of various types of ex¬\npenses. It will be noted, for example, that the program\nexpense index increased to 196 by 1944 while sales ex¬\npenses increased to 265. Sales expenses and broadcast\nincome were the only items which increased as rapidly\nas broadcast revenues, and both of these items out¬\nstripped broadcast revenues by a considerable margin.\nTABLE 7\nIndexes of broadcast revenues, expenses, and income of all\nnetworks and stations\n(1938 = 100)\nBroadcast Broadcast Broadcast\nYear revenues expenses income\n1944 . 247 200 479\n1943. 193 161 353\n1942. 161 145 237\n1941   152 134 238\n1940.  132 123 177\n1939 . Ill 108 126\n1938. 100 100 100\n1937. 103 99 120\nNote: Total broadcast revenues equals time sales less commis¬\nsions plus incidental broadcast revenues.\nSource: Annual financial reports of networks and licensees of\nbroadcast stations.\nTABLE 8\nIndexes of broadcast revenues, expenses, and income of major networks and their key stations\n(1938 = 100)\nYear\nTotal\nbroadcast\nrevenues\nTotal\nbroadcast\nexpenses\nTechnical\nexpenses\nProgram\nexpenses\nSales\nexpenses\nGeneral &\nadminis¬\ntrative\nBroadcast\nincome\n104.4.\n. 210\n191\n160\n196\n265\n168\n294\n1943\n. 171\n146\n133\n143\n187\n143\n282\n194?\n. 141\n127\n119\n123\n138\n133\n202\n1941\n. 135\n118\n114\n113\n147\n118\n213\n1040\n. 122\n113\n120\n107\n142\n111\n163\n1939\n. 109\n106\n110\n102\n123\n106\n121\n1938\n. 100\n100\n100\n100\n100\n100\n100\n1937.\n. 103\n102\nN.A.\nN.A.\nN.A.\nN.A.\n106\n(1) “Keystations” are those owned and operated stations of the major networks which serve as the originating points for most of\nthe network programs. In the annual reports filed for these stations, an adequate segregation between network expenses and\nstation expenses is not made. In 1944 there were ten such stations; prior to 1944 there were nine.\n(2) Total broadcast revenues equals time sales less commissions plus incidental broadcast revenues.\n(3) N.A.—not available.\nSource: Annual financial reports of networks and licensees of broadcast stations.\n[50]"
}