{
  "id": "d1430-56",
  "text": "determinations, but affirmative improvement of program\nservice must be the result primarily of other forces.\nOne such force is self-regulation by the industry itself,\nthrough its trade associations.\nLicensees acting individually can also do much to\nraise program service standards, and some progress has\nindeed been made. Here and there across the country,\nsome stations have evidenced an increased awareness of\nthe importance of sustaining programs, live programs,\nand discussion programs. Other stations have eliminated\nfrom their own program service the middle commercial,\nthe transcribed commercial, the piling up of commer¬\ncials, etc. This trend toward self-improvement, if con¬\ntinued, may further buttress the industry against the ris¬\ning tide of informed and responsible criticism.\nForces outside the broadcasting industry similarly\nhave a role to play in improved program service. There\nis need, for example, for professional radio critics, who\nwill play in this field the role which literary and dra¬\nmatic critics have long assumed in the older forms of\nartistic expression. It is, indeed, a curious instance\nof the time lag in our adjustment to changed circum¬\nstances that while plays and concerts performed to com¬\nparatively small audiences in the “legitimate” theater or\nconcert hall are regularly reviewed in the press, radio’s\nbest productions performed before an audience of mil¬\nlions receive only occasional and limited critical consid¬\neration. Publicity for radio programs is useful, but lim¬\nited in the function it performs. Responsible criticism\ncan do much more than mere promotion; it can raise the\nstandards of public appreciation and stimulate the free\nand unfettered development of radio as a new medium\nof artistic expression. The independent radio critic, as¬\nsuming the same role long occupied by the dramatic critic\nand the literary critic, can bring to bear an objective\njudgment on questions of good taste and of artistic merit\nwhich lie outside the purview of this Commission. The\nreviews and critiques published weekly in Variety afford\nan illustration of the role that independent criticism\ncan play; newspapers and periodicals might well consider\nthe institution of similar independent critiques for the\ngeneral public.\nRadio listener councils can also do much to improve\nthe quality of program service. Such councils, notably\nin Cleveland, Ohio, and Madison, Wisconsin, have al¬\nready shown the possibilities of independent listener or¬\nganization. First, they can provide a much needed\nchannel through which listeners can convey to broad¬\ncasters the wishes of the vast but not generally articulate\nradio audience. Second, listener councils can engage in\nmuch needed research concerning public tastes and at¬\ntitudes. Third, listener councils can check on the fail¬\nure of network affiliates to carry outstanding network\nsustaining programs, and on the local programs substi¬\ntuted for outstanding network sustaining programs.\nFourth, they can serve to publicize and to promote out¬\nstanding programs—especially sustaining programs which\nat present suffer a serious handicap for lack of the vast\npromotional enterprise which goes to publicize many\ncommercial programs. Other useful functions would\nalso no doubt result from an increase in the number and\nan extension of the range of activities of listener councils,\ncooperating with the broadcasting industry but speak¬\ning solely for the interest of listeners themselves.\nColleges and universities, some of them already active\nin the field, have a like distinctive role to play. To¬\ngether with the public schools, they have it in their\npower to raise a new generation of listeners with higher\nstandards and expectations of what radio can offer.\nIn radio workshops, knowledge may be acquired of the\ntechniques of radio production. There are already many\nexamples of students graduating from such work who\nhave found their way into the industry, carrying with\nthem standards and conceptions of radio’s role, as well\nas talents, by which radio service cannot fail to be\nenriched.\nEven more important, however, is the role of colleges\nand universities in the field of radio research. There is\nroom for a vast expansion of studies of the commercial,\nartistic and social aspects of radio. The cultural aspects\nof radio’s influence provide in themselves a vast and\nfascinating field of research.\nIt is hoped that the facts emerging from this report\nand the recommendations which follow will be of interest\nto the groups mentioned. With them rather than with\nthe Commission rests much of the hope for improved\nbroadcasting quality.\nB. ROLE OF THE COMMISSION\nWhile much of the responsibility for improved pro¬\ngram service lies with the broadcasting industry and\nwith the public, the Commission has a statutory responsi¬\nbility for the public interest, of which it cannot divest\nitself. The Commission’s experience with the detailed\nreview of broadcast renewal applications since April 1945,\ntogether with the facts set forth in this report, indicate\nsome current trends in broadcasting which, with refer¬\nence to licensing procedure, require its particular atten¬\ntion.\nIn issuing and in renewing the licenses of broadcast\nstations the Commission proposes to give particular con¬\nsideration to four program service factors relevant to the\npublic interest. These are: (1) the carrying of sustain¬\ning programs, including network sustaining programs,\nwith particular reference to the retention by licensees of\na proper discretion and responsibility for maintaining a\nwell-balanced program structure; (2) the carrying of\nlocal live programs; (3) the carrying of programs de¬\nvoted to the discussion of public issues, and (4) the\nelimination of advertising excesses.\n(1) Sustaining programs. The carrying of sustaining\nprograms has always been deemed one aspect of broadcast\noperation in the public interest. Sustaining programs,\nas noted above (pp. 29-44), perform a five-fold function\nin (a) maintaining an overall program balance, (b) pro¬\nviding time for programs inappropriate for sponsorship,\n(c) providing time for programs serving particular mi¬\nnority tastes and interests, (d) providing time for non¬\nprofit organizations—religious, civic, agricultural, labor,\neducational, etc., and (e) providing time for experiment\nand for unfettered artistic self-expression.\nAccordingly, the Commission concludes that one stand¬\nard of operation in the public interest is a reasonable\nproportion of time devoted to sustaining programs.\nMoreover, if sustaining programs are to perform their\ntraditional functions in the American system of broad¬\ncasting, they must be broadcast at hours when the public\n[55]"
}