{
  "id": "d1430-8",
  "text": "affected by a transfer or assignment of: license to a pur¬\nchaser, and the need for integrating Commission transfer\nand renewal procedures.\nStation WBAL was originally licensed to the Consoli¬\ndated Gas, Electric Light and Power Company of Balti¬\nmore, by the Department of Commerce. It began opera¬\ntions November 2, 1925.2\nWhen the Federal Radio Commission was established\nin 1927, Station WBAL was one of many stations which\nsought to procure a “cleared channel,” 25 of which were\nthen being proposed. In support of its claim to a cleared\nchannel, the station submitted “A Description of WBAL,\nBaltimore,” prepared for the information of the Federal\nRadio Commission, August 1927. The “Description”\nstated:\n“Although WBAL is owned by a private corpora¬\ntion, its operation closely approximates that of a public\nenterprise.”\nThe Station’s program policy was described as follows:\n“WBAL has endeavored to be a distinctive person¬\nality among broadcasting stations. To attain this end\nits programs have maintained high musical and artistic\nstandards. The Station’s ‘No Jazz’ policy is indicative.\n“The Station Director is also head of the Baltimore\nMunicipal Department of Music. The direct connec¬\ntions which the Director and various members of the\nmusical staff have with the private and public musical\nactivities of the City make possible a selection of the\nbest artistic personnel, and provides a means of coor¬\ndination which is seldom found possible. The Station\nhas maintained its own features to a unique degree,\nuntil quite recently, over ninety percent of its programs\nbeing rendered by its own studio organizations.\n“In addition to the regular features of the Studio,\nthe programs of the Station have included as a regular\nfeature during the winter months, semi-weekly organ\nrecitals from the Peabody Conservatory of Music, at\nwhich institution is located the largest single pipe organ\nsouth of New York. The Station has also broadcast\neach season, a number of the most important musical\nservices from various churches throughout the city.\nDuring the summer these features were supplanted by\noutdoor programs from a permanent pick-up point in\none of the public parks of the city, featuring two pro¬\ngrams each week, one by the Baltimore Municipal Band,\nthe other by the Baltimore City Park Orchestra. Pro¬\ngrams of the Baltimore Symphony Orchestra and other\norchestral and choral programs of city-wide interest\nhave also been included in the station’s broadcasting\neach season.”\nThe station also employed regular musical organizations:\n“The following staff organizations which, in line with\nthe policy of not referring to the Gas and Electric\n2 The station began broadcasting with the following statement by the\npresident of the then licensee corporation:\n“It is my privilege on this, our opening night, to dedicate this new radio\nstation to Baltimore and Maryland, and to the service of their people in\nsuch ways as may be found most useful to them. This station is to be\nknown as ‘Baltimore’, and it will be so designated and referred to in the\nfuture announcing and operation. The company which has financed its con¬\nstruction and will operate it now dedicates it to the public service of this\ncity and Commonwealth. It will be satisfied to participate along with all\nothers in this great community in such progress and advantage as its opera-\ntion may bring forth. After tonight the name of this company may not be\nheard in the announcements of this station, nor is it proposed to commer¬\ncialize its operation.”\n[7]\nCompany, are designated simply by the call letters of\nthe Station, have been retained as regular features to\ninsure a uniformly high standard of program. Some\nappear daily, others semi-weekly, or weekly.\nWBAL Concert Orchestra\nWBAL Opera Company >\nWBAL Salon Orchestra\nWBAL Ensemble\nWBAL Dinner Orchestra\nWBAL String Quartet\nWBAL Dance Orchestra\nWBAL Male Quartet\nWBAL Mixed Quartet\nWBAL Trio\n“From the personnel of the various organizations is\nalso drawn talent for special presentations, such as\ncontinuity programs, musical scenarios and programs\nfor special events.”\nThe competition among the several hundred stations\nthen on the air for the 25 proposed dear channels was\nvery strenuous, and the Commission made it clear that\n“superior programs” would be one test, or perhaps the\nprincipal test, of eligibility.3\nOn November 20, 1934, application was made for trans¬\nfer of control of the WBAL Broadcasting Company from\nthe Consolidated Gas, Electric Light and Power Com¬\npany to American Radio News Corporation, an absentee\nholding company. An amended application was filed\nDecember 1, 1934; and the transfer was approved, with¬\nout a hearing, on January 8, 1935. At that time, no\nrepresentations concerning program service were required\nof transferees, so that the purchasers were able to enter\nbroadcasting without the representations which would\nhave been required had they applied for a new station.\nCurrently, transferees are required to state whether the\ntransfer will affect the service, and if so, in what respects.\nAn examination of the program logs of Station WBAL\nfor the week beginning Sunday, April 23, 1944, shows\nthat its present mode of operation is in marked contrast\nto its operation described above under the previous\nlicensee.\nThus, during the week beginning Sunday, April 23,\n1944, only 12.5 percent of the program time between 8\na. m. and 11 p. m. was sustaining. On Monday through\nFriday of that week, less than 6 percent of the program\ntime between 8 a. m. and 11 p. m. was sustaining, and\nno sustaining programs whatever were broadcast on those\ndays between 2 p. m. and lip. m.—a total of 45 hours.4\nBetween 8 a. m. and 11 p. m. of the week beginning\nApril 23, 1944, Station WBAL broadcast 507 spot an¬\nnouncements, of which 6 were sustaining public service\nannouncements. An example—not unique—of the piling\nup of spot announcements is found in the 45-minute\nperiod from 8:15 a. m. to 9:00 a. m. on Monday, April\n3 Thus on December 5, 1927, Commissioner 0. H. Caldwell wrote to the\nMayor of Baltimore:\n“The members of the Commission have asked me to acknowledge yours\nof December 1st., and to assure you that the Commission desires to facili¬\ntate in every way the presentation of' good programs to the people of\nBaltimore through the local stations.\n“If there are any channels now in use by other stations to which any\nBaltimore station feels better entitled, by reason of superior programs, the\nBaltimore station has but to make application, and after a hearing has been\nheld, at which both sides will be given an opportunity to present full\ntestimony, the members of the Commission will endeavor to assign the\nchannel in the best public interest.” (Emphasis supplied.)\n* As used in this paragraph a “commercial” program is any program\nwhich is either paid for by a sponsor, or interrupted more than once per IS\nminutes by commercial spot announcements. A 15-minute program pre¬\nceded, followed, and interrupted once by commercial spot announcements is\nnevertheless classified as sustaining, For the Commission’s proposed future\ndefinitions of “commercial” and “sustaining” programs, see “Uniform Defini¬\ntions and Program Logs”. For a discussion of the importance of and need\nfor sustaining programs, see below, pp. 12-36."
}