{
  "id": "d1857-17",
  "text": "-13-\n**********\nAt the close of the banquet, members adjourned to Studio A at the Gommunication\nCenter where they were the guests of WUNC fbr its dedicatory broadcast which was\ncarried over a state-wide North Carolina network. The high point of the dedi¬\ncation was the dramatic production written and directed by John Clayton of the\nCommunication Center staff. This was followed by a tour of the Communication\nCenter facilities.\nSaturday, March 14\n9:00 a.m. REGION II: DOINGS AT HOME.\nThe group convened at Studio A a few minutes after 9:00 for a discussion of\nDOINGS AT HOME, state by state,\nTENNESSEE: Jack Westbrook, Acting Director, WUOT-FM\nKnoxville, University of Tennessee\nRadio\nWUCT—FM is the only educational station in Tennessee. Nearby Carson—Newman\nCollege does some public relations work on radio but that is all. WUOT has\nmade a specialty of programs on safety: One series called \"The Court of Public\nSafety\" won the Alfred P. Sloan, the National Safety Council, and the Tennessee\nSafety Council awards a few weeks ago. They are continuing their work in safety\nprograms, and are now producing a program in water safety which is being carried\non commercial stations in the TVA area. In 1953 they will have produced 350\n15-minute safety programs. They feel that one fertile field for tape network\nprograms is the safety field.\nIn addition, they have been doing a great deal with mental health, having car¬\nried the Roger Howell series from KUOM; they are now also working on a local\nseries in mental health. These are dramatized stories. The scripts are being\nwritten by a Master1a candidate in Psychology.\nThey have also developed a tape network of their own and believe that they are\nthe first to have used film cans for this purpose. They use a Magna-reel tape\nin metal cases.\nTelevision\nThe FCC has allocated 4 channels for education in Tennessee. There has been\nvery little activity except in Knoxville to which Channel 2 has been allocated.\nLast summer there was a meeting in Knoxville drawing in representatives from\ninstitutions of higher learning, press, and radio. An attempt was made to sketch\nthe possibilities educational television offered and considerable interest was\naroused. Cooperation is expected if they can get television in Knoxville. Messrs.\nWestbrook and Wright drew up three alternative plans: One was for a workshop in\nwhich they would plan the production of shows and use commercial facilities for\nthe actual production$ the second alternative — for a video—recording production\nunit; the third - for a station with a production center. As a guide to later\nactivities, this memorandum has proved extemely accurate. President Brim of the\nUniversity of Tennessee is following it closely. Money has been requested from\nthe legislature; however, the new governor is an economy man and the final result\nis not known. The essence of the Tennessee plan offered by a group from the 4\ncities concerned proposed that the legislature appropriate #600,000 to be split\n4 ways, and to be matched locally."
}