{
  "id": "d1857-5",
  "text": "PLaN NOW TO ATTEND THa CONVENTION\nIt may be a long time until the next annual convention, but it\nisn’t too early to start thinking about it. H* W. Harmon, Acting\nDirector of WSAJ, Grove City College, got the jump on other NAEB mem¬\nbers when he wrote in a recent letter: ”1 hope to be able to attend\nthe next radio convention which is held in Madison.” Mr;.Harmon re¬\nports that considerable progress has been made at Grove City College ii\nlast year or two in the presentation of program material over WSAJ.\nThe second semester program indicates as much.\nHOW’S THE WEATHER IN YOUR TOWN?\nWhen you get this perhaps I won’t care what the weather is in youj\ntown, but you may wish to know a bit about the new weather service\ngiven over WHA, Madison, Wisconsin. Harold Engel sent along a WHA\nMemorandum, which I’ll condense. Weather reports are now given over\nWHA at 8:15 and 9:50 a.m. and 12:30, 12:59, and 4:30 p.m. Also during\nextreme hot and cold spells the temperature is given every hour on\nthe hour. Information is furnished by the United States Weather Bureai\nin Madison and two broadcasts each day come direct from the Bureau.\nCLEVELAND SCHOOLS FIRST TO ACT\nThe Cleveland City Board of Education filed the first application\nwith the FCC for use of one of the new frequencies assigned for edu¬\ncational purposes. The application requests use of the 41,500 kc.\nfrequency, 500 watts power, and unlimited time.\nDUES COMING IN\nNAEB Treasurer, W. I. Griffith, Director of V/OI, Ames, Iowa, re¬\nports these additional stations have paid: WHAZ, Rensselaer Poly¬\ntechnic Institute of Troy New York; WCAL, St. Olaf’s College, North\nField, Minnesota, and KFJM, University of North Dakota, Grand Fork,\nN. D. Word has been received from Oklahoma, Kentucky, and.State s\nCollege of Washington that dues are being forwarded. Now if you haven\nstarted your payment, please don’t overlook it. The April 1 issue of\nthe News Letter will carry a complete report of members, paid and un¬\npaid, as of March 25.\nWHAT DO YOU WANT IN THE NEWS LETTER?\nThe News Letter is the service bulletin of NAEB. What subject\nwould you like to have discussed? What other services can NAEB give\nyou? The only way we’ll know is to hear from you.\nRemember, too, that the NAEB Executive Secretary is Frank E.\nSchooley, University of Illinois, Urbana, Illinois. If you send mail\ndirect time can be saved.\nAlso, packets will be mailed to members only with News Letter is¬\nsued first of each month, hereafter. News Letter will be forwarded\nfirst and fifteenth of each month, same as usual.\nDon’t bury the secretary with an avalanche of material. Or bet¬\nter still, try it and see."
}