{
  "id": "d1857-8",
  "text": "- 4 -\nproblem; that as a supporting device- for educational stations, both New York and\nConnecticut visualized joint use by all their stations of mobile units. How¬\never, mobile units are expensive:and those who have them are not using them\nmuch, though of.course it is possible to cut down on the cost by building one’s\nown mobile unit. It was then suggested that perhaps film units could do the\nwork expected of remote trucks and that the sharing of a kinescopic recording\nunit might be more helpful to educational television stations. The potential\nof tape in TV was discussed, the prediction having been made in Broadcasting by\nCrosby’s chief engineer that TV tape was practically here. The technical con¬\nsultant from DuMont Laboratories pointed out that there was a question here\nwhich the Crosby Enterprises haven’t answered; i.e., How to accommodate a range\nof frequencies which runs into the millions of cycles? Mist we run the tape at\none thousand times the speed of audio tape? Also, if tape came in, the 16mm\nprojectors in film libraries now set up in the schools might become obsolete.\nTape is likely to represent serious economic problems. The question was then\nraised whether or not there was a word we could use in the place of “education”.\nMr. Siegel asked the floor and pointed out that education was the basis for\neverything, that it is as unnatural to stop learning at age 14 as it is to die\nat age 14, that everyone has a deep vein of seriousness and wants to improve\nhimself, to know why. Reference was made to the speech by Arthur Adams at the\nAtlanta Conference, “Education Is a Good Word.” The discussion period closed.\nMembers adjourned to lunch at the Monogram Club, carrying on individual dis¬\ncussions during the lunch period.\n2:00 p.m. THESE WE SHARE\nThe group reconvened at 2:00.p.m. at the Faculty Lounge, Morehead Building, for\nthe discussion “These We Share” with Frank Schooley, Treasurer and Acting Execu¬\ntive Director of the NAEB acting as Chairman. Mr. Schooley gave a broad picture\nof the activities of the Tape Network, and explained the presence of NAEB head¬\nquarters at Illinois as chiefly resulting from the fact that the money from the\nKellogg Foundation that put NAEB in business was mostly gotten by Wilbur\nSchramm, and that the University of Illinois offered space. The functions of\nheadquarters are as follows: (a) to get out the NAEB Newsletter, (b) to keep a\nfile on active members, associate members, and affiliate members, (c) to sponsor\nsuch publications as “The Radio-TV Bibliography,” (d) to sponsor the TV monitor¬\ning studies, such as “New York TV” and “LA-TV,” (e) to arrange for the handling\nof the Fund for Adult Education series on L.P. records, (f) to arrange tours of\nheadquarters, (g) to meet visitors, (h) to supply reports to The Fund for Adult\nEducation and Kellogg Foundation, (i) to meet with the Board of Control, (j) to\nwork with the Grans-In-Aid program, (k) to handle the routine mail which for\nthe month of February was 810 letters in and 2,000 out.\nMr. Schooley then projected some slides showing such things as distribution of\nmembers, some of the printing done for NAEB, promotional materials for THE\nJEFFERSONIAN HERITAGE, publicity received, distribution of Radio-Television\nGrants, etc.\nMr. Jim Miles, the former Executive Director of the Tape Network and present\nSecretary of the NAEB then discussed the history and problems of the NAEB,\nillustrating his talk by means of slides showing: (a) station participation\nin the NAEB Tape Network, consisting of 19 at the beginning and 81 now,\n(b) monthly air time which went from a few hours at the beginning to 1231 hours\nin May, 1951, (c) total distribution reached 12,797.30 hours in education,"
}