{
  "id": "d30-101",
  "text": "AMENDING THE COMMUNICATIONS ACT OF 1934\nWEDNESDAY, MARCH 27, 1968\nHouse of Representatives,\nSubcommittee on Communications and Power,\nCommittee on Interstate and Foreign Commerce,\nWashington, D.C.\nThe subcommittee met at 10 a.m., pursuant to notice, in room 2361,\nRayburn House Office Building, Hon. Torbert H. Macdonald (chair¬\nman of the subcommittee) presiding.\nMr. Macdonald. The hearing will come to order.\nThis morning we are holding hearings on H.R. 159,86, which would\namend the Public Broadcasting Act of 1967 so as to postpone from\n1968 to 1969 the authorization for the appropriation of $9 million to\nsupport the Corporation for Public Broadcasting until it can be\nsustained by a permanent plan for financing.\n(H.R. 15986 and departmental reports thereon follow:)\n[H.R. 15986, 90th Cong., second sess.]\nA BILL To amend the Communications Act of 1934 by extending the authorization of\nappropriations for the Corporation for Public Broadcasting\nBe it enacted by the Senate and House of Representatives of the United\nStates of America in Congress assembled, That paragraphs (1) and (2) of sec¬\ntion 396(k) of the Communications Act of 1934 are each amended by striking\nout “1968” and inserting in lieu thereof “1969”.\nExecutive Office of the President,\nBureau of the Budget,\nWashington, D.C., March 27, 1968.\nHon. Harley O. Staggers,\nChairman, Committee on Interstate and Foreign Commerce,\nHouse of Representatives,\nWashington, D.C.\nDear Mr. Chairman : This is in response to your request for our views on\nH.R. 15986, a bill to amend the Communications Act of 1934 by extending the\nauthorization of appropriations for the Corporation for Public Broadcasting,\nintroduced March 14, 1968.\nH.R. 15986 would change the authorization enacted in the Public Broadcasting\nAct of 1967 from fiscal year 1968 to fiscal year 1969. This is necessary because\nthe Corporation is only now being organized and getting underway.\nThe Bureau of the Budget recommends favorable consideration of H.R. 15986\nand its enactment would be in accord with the program of the President.\nSincerely yours,\nWilfred H. Rommel,\nAssistant Director for Legislative Reference.\n(1)"
}