{
  "id": "d30-102",
  "text": "2\nDepartment of Health, Education, and Welfare,\nWashington, D.C., March 21, 1968.\nHon. Harley O. Staggers,\nChairman, Committee on Interstate and Foreign Commerce,\nHouse of Representatives,\nWashington, D.C.\nDear Mr. Chairman : This letter is in response to your request of March 15,\n1968, for a report on H.R. 15986, a bill to amend the Communications Act of\n1934 by extending the authorization of appropriations for the Corporation for\nPublic Broadcasting.\nThis bill embodies the legislative proposal contained in a draft bill submitted\nby this Department to the Congress on March 11, 1968. For your convenience a\ncopy of the letter to the Speaker of the House briefly explaining the proposal is\nenclosed.\nWe urge early enactment of this proposed legislation.\nThe Bureau of the Budget advises that enactment of this proposed legislation\nwould be in accord with the program of the President.\nSincerely,\nWilbur J. Cohen,\nActing Secretary.\nDepartment of Health, Education, and Welfare,\nWashington, D.C., March 11, 1968.\nHon. John W. McCormack,\nSpeaker of the House of Representatives,\nWashington, D.C.\nDear Mr. Speaker : Enclosed is a draft of a bill to amend the Communications\nAct of 1934 by extending the authorization of appropriations for the Corporation\nfor Public Broadcasting.\nIn view of the delay in the initiation of the Corporation’s activities, it is\nunlikely that it would need or be able to use any appropriated funds this year.\nWe anticipate, however, that it will begin to need and be able to use such funds\nin fiscal year 1969.\nThe enclosed draft bill would take cognizance of this situation by substituting\nfor the present authorization of $9,000,000 for fiscal year 1968 an authorization\nof a like amount of appropriations for fiscal year 1969. As the President indi¬\ncated in his Message on education, we will be working with the Secretary of\nthe Treasury, the Director of the Bureau of the Budget and the Board1 of Direc¬\ntors of the Corporation for Public Broadcasting, as well as appropriate Congres¬\nsional committees, to formulate a long-range financing plan.\nWe should appreciate it if you would refer the enclosed draft bill to the\nappropriate committee for consideration.\nWe are advised by the Bureau of the Budget that enactment of this bill would\nbe in accord with the program of the President.\nSincerely,\nWilbur J. Cohen,\nActing Secretary.\nFederal Communications Commission,\nWashington, D.C., March 22,1968.\nHon. Harley O. Staggers,\nChairman. Committee on Interstate and Foreign Commerce,\nHouse of Representatives,\nWashington, D.C.\nDear Mr. Chairman : This is in reply to your letter of March 15, 1968 request¬\ning the Commission’s comments on H.R. 15986, a bill to amend the Communica¬\ntions Act of 1984 by extending the authorization of appropriations for the\nCorporation for Public Broadcasting.\nWhen your Committee was considering S. 1160, which became the Public\nBroadcasting Act of 1967, the Commission supported the creation of the Corpora¬\ntion for Public Broadcasting and the provisions of the bill relating to it.\nH.R. 15986 substitutes for the present authorization of $9,000,000 for expenses\nof the Corporation for fiscal year 1968 an authorization of a like amount of ap¬\npropriations for fiscal year 1969. It also substitutes for the fiscal 1968 restriction\nto $250,000 of appropriated funds for payments under any grant or contract"
}