{
  "id": "d30-104",
  "text": "4\nSTATEMENT OE HON. FRANK PACE, JR., CHAIRMAN, BOARD OF\nDIRECTORS, CORPORATION FOR PUBLIC BROADCASTING, PRE¬\nSENTED BY JOSEPH D. HUGHES, MEMBER, BOARD OF DIRECTORS;\nACCOMPANIED BY STEPHEN AIDES, COUNSEL\nMr. Hughes. Mr. Chairman and members, we regret that Mr. Pace\ncould not be here to present this statement to you this morning. He\nunderwent major surgery last Thursday for kidney stones, from which\nhe is recovering quite nicely. It appears, however, that a period of\nconvalescence of several weeks will occur before he is back in harness\nand able fully to resume a role in the Corporation for Public Broad¬\ncasting.\nThe statement which I will present in his behalf was worked out with\nMr. Pace by telephone, and is his statement. It is as follows:\nMr. Chairman and members of the subcommittee, it is a great pleasure for me\nto have this opportunity to present to you my views on the proposed bill author¬\nizing appropriation of funds for the Corporation for Public Broadcasting for the\nfiscal year ending June 30,1969.\nBefore turning to the bill itself, I want to pay tribute to the significant role that\nmembers of your subcommittee played in the legislative process which resulted in\nthe Public Broadcasting Act of 1967 and thus in the creation of the Corporation\nfor Public Broadcasting.\nI am very pleased to report that the necessary incorporation papers will be\nfiled today and the Corporation formally established as a nonprofit corporation in\nthe District of Columbia. I look forward in the next weeks to the first formal\nmeeting of the Board of Directors, of which I have the honor to be Chairman.\nMy fellow Board members are distinguished Americans, some with backgrounds\nin television and radio, and others with broad experience in other aspects of\ngovernment, education, business, and cultural affairs. As I do, they come to this\nnew and exciting venture with a deep sense of purpose and with an openminded-\nness as to how we should function to carry out the broad intent of the legislation.\nIt was the desire of both the President and the Congress that this corporation\nbe independent in practice as well as in theory. In my judgment, there is no better\nguarantee of this than the men—and the lady—who were chosen to be the incor¬\nporators and first Board of Directors. They are people of stature and ability who\nhave already made great contributions to American life. It is clear that they take\nthis new responsibility most seriously and, working closely with the Congress,\nwill strive to see to it that the Corporation achieves the great goals set by the\nlegislation.\nThe opportunities and responsibilities facing this new instrumentality are\nenormous. We are all aware that television is an immensely powerful technology—\nnew in any relative sense and growing steadily more influential. We all seek to\nbring this technology into the full service of man and to do «io within the frame¬\nwork of our creative free society. At the same time, we are aware that the older\ninstitution of radio remains a vital and progressive force in American life,\ndeserving of the attention of the Corporation for Public Broadcasting.\nSince the Board has not formally met, I cannot speak for the directors as a\nbody. But in the weeks since the President’s nomination, I have talked with\nmany of its members and with many other people who have assessed the nature\nand purpose, as well as the experience of television to date. I have sought their\nadvice on what we should do and how we should go about doing it.\nMy own view of the immediate future is clear. While I do not want to dis¬\nappoint any of the short-range hopes held by many for this Corporation, it would\nbe equally dangerous to encourage false hopes that dramatic new departures in\nbroadcasting are going to be achieved overnight.\nWe shall move carefully—some may say cautiously, but nevertheless, our man¬\ndate from the Congress requires us to begin the first steps of the journey.\nFor example, it is clear that one of our main long-term functions will be to\nstrengthen the programming available to public television. It is also clear that\nthis is to be done mainly by strengthening local stations, providing them with\nmore choice in what they present, while at the same time helping them to main¬\ntain their independence. We hope to learn much from what others have done in"
}