{
  "id": "d30-105",
  "text": "5\nthis field, but we shall undertake our own analyses and arrive at our own\nconclusions as we move toward our first programming efforts.\nAt the start, we shall deal with the basic matters of organization of the\nCorporation, and begin by laying a pattern for our first year’s operations with\nmodest objectives that can reasonably be met.\nOf first priority will be recruiting a staff of the highest quality and experience.\nIn this process, the enactment of this legislation by the Congress would be a\nvote of confidence in the Corporation and would increase the Corporation’s ability\nto obtain the kind of men we will need on a long-term basis. It would undoubtedly\nalso assist our efforts to obtain financial support from the private sector.\nTherefore, I urge that your committee approve the pending bill. I can assure\nyou that we will spend carefully and will not build up a staff out of proportion\nto our needs. As I have said, as the hearings emphasized, and as the quality of\nmen on this Board guarantees, the Corporation will be independent. By the same\ntoken, however, we look forward to working closely with the Congress and with\nyour committee and your subcommittee.\nI hope and expect that the way we organize and operate this Corporation in\nits initial stages will give you confidence in what we will do in the future. Regard¬\nless of how the long-term financing is worked out, I have no doubt that the Cor¬\nporation must continue by its activities and by its successful operation to per¬\nsuade the Congress that this unique new instrument is serving the great purposes\nof the Public Broadcasting Act of 1967.\nMr. Chairman, I very much regret not being personally present today to give\nyou my views on the pending bill. I urge its approval so that we may go forward\nwith the beginnings of this worthwhile venture.\nThis Corporation, properly operated, can give real meaning and substance to\nthe American dream; improperly done, it is without value. I commit to you for\nthis effort the very best that I and my distinguished colleagues can give.\nMr. Macdonald. Thank you very much, Mr. Hughes.\nDo you have comments of your own that you would like to put\nforth at this time ?\nMr. Hughes. One very important comment, Mr. Chairman, which is\ntimely.\nAs of this moment, I believe, the Corporation is now in being. The\npapers were filed this morning and we are informed that the charter\nhas just been granted. So as of this very moment, in no more appro¬\npriate a place to make the announcement, than here, we are now a\nbody corporate and legally in existence.\nMr. Macdonald. I have just one question. I am not quite sure why\nthe Board hasn’t met up until this time. Would you give us some\ninformation about that ?\nMr. Hughes. Yes. I would say, Mr. Chairman, that we had an in¬\nformal meeting following the hearings before the Senate Committee on\nConfirmation. At that time, one step was taken. Dr. Killian was desig¬\nnated as Acting Vice Chairman, pending formal incorporation.\nWe did have discussions, informally, again as to future meetings, a\npossible course of action, staffing. So we have had the single meeting\nhoping that the Chairman would be back on his feet. Regrettably, his\ncondition turned the other way and surgery followed.\nMr. Macdonald. Thank you, sir.\nMr. Komegay ?\nMr. Kornegay. Thank you, Mr. Chairman.\nMr. Hughes, it is nice to see you here today.\nSo that I would know and perhaps the House would know when\nwe get this bill over on the floor, a little bit about what has transpired\nbetWeen the time the law was enacted in November of last year and\nthe present time, I am sure somebody will ask the question, will you\nfill us in and tell us what has been done in addition to your state-\n92-085—68"
}