{
  "id": "d30-108",
  "text": "8\nBroadcasting Corporation, is going to address itself to the question of\nlong-range financing ? Are you going to have a subcommittee working\non this problem?\nIs the entire Corporation going to be doing it ? When are you going\nto get started?\nThese are the kinds of questions I have in mind.\nMr. Hughes. And very valid questions. Mr. Brotzman.\nI would assume that a subcommittee of the Board, a finance com¬\nmittee, will be constituted, as is normal corporate procedure, and that\nwill concentrate on the financing side. It is my understanding that we\nhave other witnesses here today who will speak more specifically on the\nmethod of financing, both from the Treasury, HEW, and the Bureau\nof the Budget. But it is undoubtedly the case that we will have con¬\nstituted a finance committee from the Board.\nMr. Brotzman. And the rest of it, I would hope, is going to be\nconstituted in the very near future; is that correct ?\nMr. Hughes. We are waiting for today, Mr. Brotzman. Regrettably,\nfor Mr. Pace’s illness, which has set us back, but Dr. Killian has been\nnamed vice chairman on an ad hoc basis and will be able to function\nlegally in the absence of the chairman from this morning forward.\nMr. Brotzman. Thank you very much.\nI have no further questions.\nMr. Macdonald. Mr. Springer.\nMr. Springer. Mr. Hughes, have you been filled in by the national\neducation group on what took place in the passage of this bill ?\nMr. Hughes. I know the legislative history, Mr. Springer. I have\nnot been filled in by that organization, as such.\nMr. Springer. In other words, you are acquainted with the back¬\nground of this ?\nMr. Hughes. Yes.\nMr. Springer. May I say to you that if everything is run as WQED\nis in Pittsburgh, we would have no trouble with anybody. We are\nhoping that we won’t have any difficulty under any circumstances.\nBut I think we ought to be clear on what was sort of intended, I\nthink, when we got this thing together.\nFirst of all, as you know, the Public Broadcasting Act of 1967 pro¬\nvided for three titles. Title I provided for money from the Department\nof Health, Education, and Welfare to do something. Title III provided\nfor HEW to do something else. Title II did not provide for HEW\nto do anything. You understand that. You are independent.\nMr. Hughes. That is correct.\nMr. Springer. You are not dependent upon anybody except an\nappropriation from this body.\nMr. Hughes. Correct, sir.\nMr. Springer. I think the President did an excellent job, and I have\nso told him, on the appointment of the Board. We have come up with\na high-class Board. That is my opinion as of this date in 1968. I think\nyou have about as good a Board as he could have drawn from one end\nof this country to the other.\nMr. Hughes. Thank you.\nMr. Springer. Therefore, being independent, your job, do you\nunderstand, is to produce the best programing that you know how\nwithin your capabilities ?"
}