{
  "id": "d30-109",
  "text": "g\nMr. Hughes. I do understand that.\nMr. Springer. I just want to be sure we have no misunderstanding\nabout that.\nThe first thing you are doing to do is to recruit staff. How is this\ngoing to be done ? I am not asking you who you are going to select,\nbut how do you propose to go about this ?\nMr. Hughes. There has been a suggestion, Mr. Springer, by Mr. Pace\nthat a committee of the Board would be a screening committee to\ninterview candidates, determine their qualifications, and then to have it\nbecome a matter of action by the full Board.\nMr. Springer. I am glad to hear that. I hope you will have no pre¬\nconceived notions. I have no idea at this time of trying to impose the\nwill of this committee. I hope you get as high-class a staff as you have\na Board. Then you will satisfy me.\nThis Congress, may I say, and I am offering this not as extra advice\nbecause I think I know what the will of this committee is, hopes you\nget someone who can do a really good job, because the Congress is\ngoing to be watching this thing very carefully. This is going to be the\nmost sensitive thing that I think this committee has created in all the\ntime I have been here. If there is any more sensitive group than this,\nI don’t know what it is. This was certainly the most controversial.\nI would hope that the staff would be the very best that could be\nobtained. If this screening committee goes at it, you surely ought to\ncome up with something that is really good.\nMay I come to the second matter. That is how do you propose to go\nabout getting financial support from the private sector? You already\nhave approximately $2 million which you have described.\nMr. Hughes. I think that is a matter, Mr. Springer, that will be\ndetermined by the Board. I can only carry forward the local efforts\nof the individual stations in reflecting what has been done.\nIn Pittsburgh, again referring to the station with which I am most\nfamiliar, we have a public, annual campaign which generates $400,000\nfor operations. I am sure that, extrapolated to a national basis in\nsupport of the Corporation, it will be possible to obtain annual support.\nI do not think it is possible to expect to have the future budgetary\nrequirements of the Corporation underwritten in large chunks from\nlimited sources. I frankly think that would be a mistake. This Cor¬\nporation should be broadbased. There should be support from the\npublic. It is public television. That should be in addition to the appro¬\npriated moneys from the Congress.\nMr. Springer. At one time when Dr. Killian was before this com¬\nmittee, and I believe one of the Board members was here, they were\ntalking about moneys from foundations. What is your philosophy\non this?\nMr. Hughes. I can only speak personally there, Mr. Springer. As a\nfoundation executive, I am the head of the Mellon Foundation, and\nquite honestly I have been more accustomed in the field of public tele¬\nvision to be on the giving end than the requesting end.\nWe have contributed several millions of dollars for public tele¬\nvision. We have a deep conviction and dedication to this effort. So in\nthat sense, I speak professionally and say that we have indicated a\nposition and have backed that up to the extent of several millions\nof dollars."
}