{
  "id": "d30-110",
  "text": "10\nMr. Springer. Your effort so far as I know has been good. I would\nhope that if you do get sizable amounts from Mellon, from Ford,\nfrom the Carnegie Foundation, that those would come with no strings\nattached except your best judgment on how this money ought to be\nspent. Is that about the philosophy you have ?\nMr. Hughes. I certainly do. I think it would be appropriate for a\ngift to be made for programing, let us say, but certainly not with\nany strings that would in any way inhibit the Corporation or its\nactions.\nMr. Springer. I think that is a good policy to start out with. That\ncertainly meets with my approval.\nMr. Hughes. I could not agree more.\nMr. Springer. I hope you will impress on your board of directors’\nfriends that this Congress will be appropriating after this year. You\nwill be back next year. We will be here to ask you what you have done\nand to give an account of your stewardship. For a few years, I think\nthe Congress will want to know pretty intimately what is being done.\nI can say that generally the Board has received good approval for\nthe type of men you have. So far as I am concerned, I want to wish\nyou every success.\nMr. Hughes. Thank you.\nMr. Springer. Thank you, Mr. Chairman.\nMr. Macdonald. Mr. Harvey?\nMr. Harvey. I apologize for coming in late, Mr. Hughes. I just\nwant to inform you that I intend to vote against the particular bill.\nI don’t want any reflection either on Mr. Pace or the other appointees,\nbecause I think the President did a very outstanding job in making his\nappointments.\nOn the contrary, I intend to oppose the bill for the same reason\nthat I opposed it originally; that is, I think we are putting the cart\nbefore the horse. I think we ought to have the proper financing for\npublic broadcasting before we get into the venture at all. I think that\nat this time in our history it is way down the line as far as priorities\nare concerned, as far as what else we are trying to do in America\ntoday. It doesn’t reflect anything at all, however, either on Mr. Pace\nor the other appointees.\nAs I say, I think they are outstanding. I think the purposes that are\nattempted to be accomplished are good, as well.\nThank you.\nMr. Macdonald. Mr. Hughes, since there has been discussion of the\nappointees, I think it speaks very well. Since neither Mr. Springer,\nmyself, or Mr. Staggers knew who the appointees were, it might be\nappropriate to spell out in the record who the appointees are.\nMr. Hughes. Frank Pace, Jr., has been named Chairman for the\nfirst year. Joseph A. Bierne of Washington, D.C., president of the\nUnited Electrical and Communications Workers of America; Robert\nS. Benjamin of New York, a New York attorney and chairman of\nthe board of United Artists Corp.; Roscoe C. Carroll of Los Angeles,\nan attorney and general counsel of the Golden State Life Insurance\nCo.: Michael A. Gammino of Providence, president of the Columbus\nNational Bank of Rhode Island and also chairman of the Metropoli¬\ntan Opera Festival Foundation of Newport; Mrs. Hobby, of Texas,\nwho is president and editor of the Houston Post, and along with Dr."
}