{
  "id": "d30-111",
  "text": "11\nKillian served as a member of the Carnegie Commission; Sol Hause,\nof Seattle, chairman of the board of KRRO, a commercial station;\nMr. Hughes of Pittsburgh; Erich Leinsdorf of Boston, the music di¬\nrector of the Boston Symphony; John D. Rockefeller III, chairman\nof the board of trustees of the Rockefeller Foundation; Carl Sanders\nof Atlanta, attorney and former Governor of the State of Georgia;\nFrank E. Schoolie of Champaign, Ill., director of university broad¬\ncasting at the University of Illinois; Jack Valenti of Washington,\nD.C., president of the Motion Picture Association of America ; Mil-\nton S. Eisenhower of Baltimore, president emeritus, Johns Hopkins\nUniversity; James R. Killian, Jr., of Cambridge, Mass., chairman of\nthe corporation, Massachusetts Institute of Technology.\nMr. Macdonald. Thank you very much, Mr. Hughes. I would like to\nsay in passing that the Board of Directors has pretty good access to\nfoundation money, I would think, and I hope the Board exercises its\ncontacts with those groups.\nMr. Brown ?\nMr. Brown. I have no questions, Mr. Chairman.\nMr. Macdonald. Mr. Broyhill ?\nMr. Broyhill. No questions, Mr. Chairman.\nMr. Macdonald. Thank you both very much.\nMr. Hughes. Thank you, Mr. Chairman and members of the\ncommittee.\nMr. Macdonald. We shall hear next from our colleague, the Honor¬\nable Leonard Farbstein.\nSTATEMENT OF HON. LEONARD FARBSTEIN, A REPRESENTATIVE\nIN CONGRESS FROM THE STATE OF NEW YORK\nMr. Farbstein. Mr. Chairman, this subcommittee has under con¬\nsideration today legislation (H.R. 15986) authorizing $9 million in\nprogram funds for fiscal 1969 for the Corporation for Public Broad¬\ncasting.\nWhat this bill does is delay for 1 year the initial Government\nfinancing of educational broadcasting authorized under the Public\nBroadcasting Act of 1967. Like the 1967 act, it contains no provision\nfor the long-term financing of educational stations.\nH.R. 15986 is needed. It is essential that the Government provide\nshort-term funds for educational programing. But left unresolved, is\nthe more fundamental and controversial question of permanent long¬\nterm financing free from any one influence, either public or private.\nThe question is who should contribute to the long-term financing of\npublic broadcasting. The answer will spell out the scope and inde¬\npendence of educational television and radio.\nMr. Chairman, I submit the commercial broadcasters in this country\nhave an obligation to provide substantial financing for nonprofit edu¬\ncational stations. On February 8,1968,1 introduced a resolution (H.J.\nRes. 1079) directing the Federal Communications Commission to\nstudy the means and the extent to which commercial broadcasters can\nbe required to provide such fundamental support. The resolution\nwould have further put the Congress on record clearly supporting the\nview that commercial television and radio broadcasters should con¬\ntribute substantially to the long-range financing of educational\ntelevision and radio."
}