{
  "id": "d30-113",
  "text": "13\n15986 which will authorize appropriations to be made in fiscal year\n1969.\nLet me turn, now to the question of permanent financing for public\nbroadcasting. The working out of a long-term financing plan for the\nCorporation requires the most thorough consideration. This is why\nthe President has requested the Secretary of HEW, the Secretary of\nthe Treasury and the Director of the Bureau of the Budget to won?,\nwith the Board of Directors of the Corporation for Public Broadcast¬\ning and the appropriate committees of the Congress to formulate a\nlong-range financing plan that will promote and protect this important\nnew institution. As the President stated on signing the Public Broad¬\ncasting Act of 1967:\nThe Corporation will be carefully guarded from Government or from party\ncontrol. It will be free, and it will be independent—and it will belong to all the\npeople.\nTelevision is still a young invention. But we have learned already that it has\nimmense—even revolutionary—power to change, to change our lives.\nIn brief, we are asked to devise some means of providing funds for\nthe Corporation that will, with the agreement of the Congress, mini¬\nmize those aspects of the usual Federal budgeting and appropriations\ncycle which might restrict the free production of programs for this\npublic media.\nOn the other hand, such a plan must also include some means for\na public accounting at reasonable intervals, for use of public funds,\nand for decisions to be made as to the appropriate level of public\ninterest for the ensuing period.\nAnother challenge is to provide sufficient sources of revenue to get\nthe job done. Estimating the needed range of revenues requires the\nmaking of assumptions as to the quality and cost of producing pro¬\ngram materials, the number of program “options” which are to be\navailable, the number and capability of stations, the costs and extent\nof use of interconnection, and the amount of research, training, and\nother activities to be carried out. Given the rapidly changing technolo¬\ngy, economics, population trends, et cetera, estimating for several\nyears hence is extremely hazardous.\nAt the moment, it appears there are three principal techniques for\nproviding Federal funds for public broadcasting. Each has its ad¬\nvantages and disadvantages and we in the executive branch have not\nyet formed a preference for any one or a combination of them.\nThese are: (1) a tax on television and radio sets manufactured; (2)\na tax on gross revenues of commercial broadcasters; and (3) some spe¬\ncial kind of “insulation” for general Federal revenues. The follow-\ning paragraphs explore these alternatives,\nNEW TAX ON TELEVISION AND RADIO SETS MANUFACTURED\nThis is essentially the Carnegie Commission proposal. The argu¬\nment would be that purchasers of TV sets and radios will be the direct\nbeneficiaries of public broadcasting. The tax would be collected from\nthe manufacturer and hence relatively easy to administer.\nOn the other hand, it is possible that the level of expenditures for\nTV sets, currently about $2 billion annually, may level off after the\ncurrent conversion to color sets is complete. Thus, the tax revenues\n92-085—68-3"
}