{
  "id": "d30-114",
  "text": "14\nwould not keep up with the need unless there were periodic increases\nin the tax rates.\nIt can also be argued that people will not benefit from public broad¬\ncasting in proportion to the amount they spend on TV sets. And fin¬\nally, such a tax would be regressive because low-income people spend\na higher proportion of their income on television sets than high-income\npeople and would, therefore, pay a higher proportionate tax.\nA NEW TAX ON THE GROSS REVENUES OF COMMERCIAL BROADCASTERS\nThe rationale for a tax on gross revenues of commercial broadcasters\nwould be that the frequency spectrum is a public resource to begin\nwith, and that a portion of the economic returns from its commercial\nuse can appropriately be dedicated to sharing the costs of public\nbroadcasting. It is, of course, a statutory requirement under the Fed¬\neral Communications Act that applications meet the test of public in¬\nterest, convenience, and necessity. A gross revenue tax would be an\nextension of that well-established principle.\nGross revenues of radio and television broadcasters currently total\nabout $3 billion and have been growing nearly 10 percent annually.\nA tax on gross revenues would change over time roughly in proportion\nto changes in programing costs for the broadcasters. Thus, the reve¬\nnue would grow and maintain a reasonable relationship to the finan¬\ncial needs of public broadcasting.\nOn the other hand, it is possible that a large share of such a tax\nwould be passed on to consumers through increases in the retail price\nof products advertised on the broadcast media. The portion of the tax\npassed on would be highly regressive, since the products accounting\nfor the largest share of broadcast revenues—automobiles, beer, cos¬\nmetics, nonprescription drugs, soap, and tobacco—account for a much\nlarger proportion of expenditures by low-income and middle-income\nfamilies than by high-income families.\nUSE OF GENERAL REVENUES\nGeneral tax revenues might legitimately be called on to finance pub¬\nlic broadcasting on the grounds that there is a general benefit to the\npublic from the activities of the Corporation. This approach, sup¬\nported by classic public finance doctrine, would not exhibit the regres¬\nsive tax tendency of the foregoing approaches.\nOn the other hand, some people would reject this approach on the\ngrounds that general fund financing entails strict budgetary controls.\nNevertheless, it is possible that the Executive and the Congress could\nwork out some satisfactory arrangement that would permit review\nperiodically but not annually.\nFor example—\nProvide for paying of general fund revenues into a trust fund\naccording to a statutory formula—perhaps related to the total\nnumber of public television and radio stations—and authorize\nappropriations for a 3-year period to be made all at one time.\nProvide that all payments into a trust fund established by law\nwould be paid automatically to the Corporation unless the Con¬\ngress took negative action to prevent such payment."
}