{
  "id": "d30-116",
  "text": "16\nexecutive branch were at some point to come forward with tax pro¬\nposals, conceivably it might involve another committee in that juris¬\ndictional area. But I can’t predict what the proposals will be, and I\nwould rather not try to nominate other committees.\nMr. Macdonald. Yes, sir. But it is in your testimony. Therefore, I\nhave to ask you about it.\nMr. Carey. Yes, sir.\nMr. Macdonald. Why would the tax committee have anything to do\nwith public TV ?\nMr. Carey. I think, sir, there might be a feeling that any legisla¬\ntion involving special taxes would be of germane interest to that com¬\nmittee. That is a question I think probably to be settled up here.\nWhether we in the executive branch, as we developed specific pro¬\nposals, would feel it necessary to engage in conversations with the\nWays land Means Committee, I am simply not prepared to say this\nmorning. I don’t know, sir.\nMr. Macdonald. It seems clear to me. I am just asking for informa¬\ntion. I am not arguing with you.\nMr. Carey. I would say this is the primary committee, Mr. Chair¬\nman.\nMr. Macdonald. Right, and also the Appropriations Committee.\nI don’t really understand the rather murky language you use about\n“appropriate congressional committees.”\nMr. Carey. I think that was mainly intended, sir, to indicate that\nprobably more than one committee would be involved.\nMr. Macdonald. You talk about, user taxes. Do you think it fair that\nsomeone who purchases a TY set—and you indicate that low-income\npeople are the heavier users of both the products that are advertised\nand of the sets themselves—do you think it is quite fair to charge\neverybody who has a TV set a user tax ?\nMr. Carey. To support public broadcasting ?\nMr. Macdonald. Yes.\nMr. Carey. I think, sir, we generally have the feeling that user\ncharges constitute a general policy that the Congress has long ap¬\nproved. We employ user charges in many areas.\nMr. Macdonald. If I can interrupt, there is the highway bill, and\nso forth. Everyone who uses that road owns an automobile. But own¬\ning a TV set doesn’t mean that they are going to use the facilities\navailable that will hopefully be offered by the public TV concept.\nOnce again, I am not arguing; I am just trying to get your opinion.\nDo you think that is fair ?\nMr. Carey. I think relatively, Mr. Chairman, it is as fair an option\nfor us to be considering together and debating as any of the others\nthat we are speaking about. I would like my colleague from the Treas¬\nury Department to speak to this question, too, if he may.\nThese are the three primary alternatives that we have so far been\nable to dradge up. Every one of them has something wrong with it,\nand something right with it.\nMr. Macdonald. Mainly, you have pointed out what is wrong with\nthem, not what is right with them, if I read your testimony correctly.\nMr. Carey. I think the right part of the tax on TV and radio sets\nwould seem that it reaches and taxes the consumers of the public\ngood that is being provided here. While there is a very strong contra-"
}