{
  "id": "d30-117",
  "text": "17\nargument that public broadcasting is a much more generalized good\nthan it is an explicit good for the users and the owners of the receiving\nequipment, nevertheless, I think that it is a fair enough option and\nalternative to be very seriously considered, which we proposed to do\nin t alking with you and with the Corporation.\nMr. Macdonald. Then if I can paraphrase your words, that is why\nyou used the word “appropriate committees,” because you think maybe\nthis should be before the Ways and Means Committee and not this\ncommittee ?\nMr. Carey. I think it would be before this committee first of all,\nMr. Chairman, but I think if it came to a hard proposal, an explicit\nproposal, for such a tax, it could involve another part of the Congress.\nBut, again, my colleague from the Treasury Department probably has\nhis own views on that matter.\nMr. Macdonald. I would like to hear him on this point.\nMr. Brannan. On the point of the committees ?\nMr. Macdonald. Yes, the jurisdiction.\nMr. Brannan. I make the point that this is merely a matter of the\nrules of the House on which we can only speculate on possible out¬\ncomes. In a similar situation, in highway trust fund financing, the\nWays and Means Committee does not have jurisdiction over the high¬\nway decisions themselves, but under the rules of the House, it has\nbeen felt proper in the past to have them take action on the tax part\nof highway bills.\nMr. Boyd simply recognized that the House might come up with a\ndecision that the Ways and Means Committee might deal with the\ntax portion of any bill that might be included in it.\nMr. Macdonald. You use the word “might.” Are you going to rec¬\nommend that this be done?\nMr. Brannan. I suspect that we would try to anticipate what the\nHouse would do with the bill, if we were simply talking about which\ncommittee to talk with before we sent a message, if that was the kind\nof question.\nMr. Staggers. Will you yield for a question?\nMr. Macdonald. Yes.\nMr. Staggers. I am sure both of you gentlemen are for this bill.\nMr. Carey. Yes, sir.\nMr. Staggers. I would think your presentation this morning would\nindicate you are not trying to get it by this committee very well. If\nyou are trying to get some “no” votes for it, you are going down the\nright road, when you are talking about taking away jurisdiction. It\nwill have enough of a rough road now.\nMr. Carey. I don’t think it is our prerogative to take jurisdiction\naway from anybody.\nMr. Staggers. I think the administration better do a little more\nwork and send some different testimony up here if they want this bill.\nMr. Carey. The administration very much wants the bill.\nMr. Staggers. Then they better change their tactics. That is all.\nMr. Macdonald. On page 2 of your very fine statement, I didn’t\nreally understand the language that says “minimize those aspects of\nthe usual Federal budgeting and appropriations cycle which might\nrestrict the free production of programs for this public media.”\nI can read the English language, but I don’t know what that means.\nWould you explain it?"
}