{
  "id": "d30-118",
  "text": "18\nMr. Carey. I will be glad to try to do that, Mr. Chairman.\nI think what we are considering here in the way of a concept is a\ncorporation which would have very broad latitude to develop pro¬\ngrams of a high and useful quality, and what concerns everybody, as\nwe have struggled with problems of long-range financing, is the prob¬\nlem of balancing the objective of really complete freedom of such a\ncorporation on the one hand and the conventional sanctions and con¬\ntrols that normally go with direct Federal Government support and\nfinancing.\nIt is a kind of no-man’s land there somewhere. We believe that the\nCongress and the President ought to, at intervals, certainly, examine\nand reappraise what is going on in public broadcasting. I think they\nhave that responsibility.\nMr. Macdonald. What is a better way to do just that than to take\na look at how the funds are being expended ?\nMr. Carey. I think this is right.\nMr. Macdonald. If you have an alternative, I would like to hear it.\nMr. Carey. I think we are saying that as far as our thinking has\ngone, and certainly everything I am trying to say (this morning comes\nunder that title, as far as thinking has gone—it hasn’t gone too far—\nwe think that at this point the Congress and the Executive would\nwant to decide the intervals at which they both would examine these\nactivities, whether they be annual intervals, whether they be triennial\nor quintenniel intervals, but not breathe so hard on the back of the\nCorporation at every decision.\nMr. Macdonald. Traditionally, it does not go beyond 3 years. We are\nnot about to give you an open-ended thing and say, “Okay, it is a\ngreat idea. Go ahead and do it,” with no supervision over public funds.\nI am sure you would agree that that is correct.\nMr. Carey. Mr. Coston might have some points on this, Mr.\nChairman.\nMr. Macdonald. I would be happy to hear from him.\nMr. Coston. Mr. Chairman, I think you have identified one of the\nvery key issues that was raised in the hearing when the bill was origi¬\nnally discussed. It was the question of how you strike a balance be¬\ntween insulation by the Corporation from unwarranted Government\ninterferences on the one hand, and how you retain your stewardship\nand responsibility for proper use of tax moneys.\nThis committee, I think very wisely, did a number of things. First\nof all, they limited the authorization to 1 year, so that the committee\nwould have a chance to take a look at it again, to see just how it got\nset up.\nSecond, the committee inserted extensive provisions requiring audit\nand oversight by the General Accounting Office, so that the GAO will\ncontinue to exercise responsibility for overseeing the financial ac¬\ntivities of the Corporation.\nAt the same time, the committee went the other way in attempting to\ninsulate the Corporation by first providing for a Board which could\nnot be dominated by any political party. It prohibited the Corporation\nfrom engaging in political activities. It wrote in its committee report\nsome very persuasive language which I would like to quote at this\npoint. It said:\nOne of the fundamental reasons for establishing the Corporation is to remove\nthe program activity from governmental supervision. The educational stations"
}