{
  "id": "d30-119",
  "text": "19\nmust not be permitted to become vehicles for the promotion of one or another\npolitical cause, party or candidate. In the same manner, the bill strives to insulate\nthe Corporation from governmental control. The committee intends to see to it\nthat the local educational broadcasting stations conduct their operations without\nCorporation interference or control.\nSo clearly the committee struggled with the same problem again.\nWith respect to jurisdiction, I think it is very, very clear that this\ncommittee, which originated this legislation, which conducted the\nhearings on it, not only this time but on the original facilities act. of\n1962, is obviously the committee with the primary; jurisdiction over\nthe program. It is your legislation. You will review it at the end of the\nfirst year to determine where you want to go from here.\nThere is just no question in my mind but what the Interstate and\nForeign Commerce Committee will be the principal and most impor¬\ntant committee on the House side to deal with this.\nWhen we talked about appropriate committees, we were talking not\nonly about the House committees, but the committees in the other body,\nso there are at least four committees involved. There would be your\ncommittee, the House Appropriations Committee, the Senate Com¬\nmerce Committee and the Senate Appropriations Committee.\nBut clearly, the way the bill is drafted and the way the extension\namendments are drafted, it will be necessary to come back before this\ncommittee in order to get any changes or adjustments or improvements\nin the act as you have passed it last year.\nMr. Macdonald. I agree with most everything you say. But if you\nl'eel that way, why does this testimony, which must have been cleared\nbetween three departments, talk about “appropriate committees” when\nit is very clear to me what the appropriate committees are ? Here in the\nHouse it is the Commerce Committee and the Appropriations Commit¬\ntee. It is the same way in the Senate. It would be after it clears Senator\nMagnuson’s Commerce Committee and then go to the Appropriations\nCommittee over there.\nMr. Coston. I think this is very clear. I don’t think Mr. Carey\ndisagrees.\nMr. Macdonald. I don’t say he does. I say his testimony does.\nMr. Coston. I don’t think we thought very much of the use of the\nword “appropriate” except we were possibly going to save a couple of\nlines by not specifying the committees that would have concern about\nthis.\nMr. Carey. I think it is pretty clear that what this committee does\nin the area of public broadcasting will be decisive on what the country\nwill have in the way of public broadcasting. I don’t think there is any\nquestion at all about the primacy of the committee we would be con¬\nsulting.\nI simply felt at this stage, and having come very recently myself\nto this business of public broadcasting, that the language ought to—\nwell, I must say I didn’t particularly struggle terribly over the prose\nin the statement ; I just wrote what I was trying generally to get\nacross here. But I think the use of the world “appropriate” is simply\nto stay somewhat loose, because I can’t predict with enough exactness,\ngiven the fluidity of the problems we are dealing with, what may\ndevelop. My assumption at this point is that you have identified the\ntwo right committees."
}