{
  "id": "d30-12",
  "text": "1. What formula has the Corporation adopted (or will it\nadopt) regarding the ratio of distribution of funds between\nradio and television?\n2. Since television has received financial support in major\namounts from The Ford Foundation and the ETV Facilities Act\nof 1962, shouldn’t the bulk of the money now available be\ndirected to educational radio -\n3. The Corporation has announced an interconnection experi¬\nment for television. What has the Corporation done to pro¬\nvide an interconnected network for radio stations? What has\nthe Corporation done to obtain lower or free interconnection\nfor educational radio. Has there been any discussions of\nnetworking for radio; If so, what is the prospect? If not,\nwhen will such discussion be initiated?\n4. When will the Corporation have an executive and a staffs\nDescribe the staffing plans. How many individuals will join\nthe Corporation staff — where will the offices be located —\nwhat will be the structure of the Corporation.\n5. What about the ten watters? What criteria has the Corp¬\noration established for identifying the public radio station.\n6. Why two public radio studies? We have just responded to\nthe Miller inquiry for the radio committee. Now we learn that\na second study is in progress. Isn’t this duplicative and\nunnecessary;\n7. When will the Corporation begin making grants to educational\nradio stations for program production. What will be the method\nof application and how long will It take to process proposals.\nWill there be a form?\n8. In April, The Ford Foundation announced a grant of five\nhundred thousand dollars for educational radio. None of that\nmoney has been disbursed to any station or project despite a\nlapse of more than seven months. Has the Corporation proposed\nto the Foundation that the half million be granted to the Corp¬\noration for utilization in educational radio?\n9. What will be the policy of the Foundation toward matching\ngrants ?\n10. What plans does the Foundation have to support current\nradio activity such as BFA, the NER network, the NER Public\nAffairs Bureau, EEN and the like. Shouldn’t these instit¬\nutions receive early attention?"
}