{
  "id": "d30-120",
  "text": "20\nMr. Macdonald. You represent the Bureau of the Budget. In many\nways you have the final say of what goes into the budget or not, your\nsuperiors or somebody who talks to the President does. Therefore, I\nwould like to have it clear on the record, which I think it now is, that\nthe jurisdiction of this bill, which was fathered and perhaps even\nmothered by this committee, stays right here, and not by testimony be\ntaken away from us.\nMr. Carey. That is certainly the farthest thing from my intentions.\nMr. Macdonald. I would like to point out that if this committee\ndoes not pass this bill, it will never see the light of day. I would think,\nif you are in support of the bill, as Chairman Staggers mentioned, you\nwould make it clear that the appropriate committees were the four\nthat I have just stated. If you are now saying that, then, of course, I\nwithdraw my comments about your testimony.\nAre you all three saying that ?\nMr. Carey. I would think so.\nMr. Coston. Mr. Chairman, let me try to nail it down.\nThis act is an amendment to the Communications Act of 1934.\nChanges in the act also have to amend that act. I don't think anybody\nargues the jurisdiction of the Interstate and Foreign Commerce Com¬\nmittee with respect to the Communications Act of 1934.\nMr. Carey. Exactly. I agree completely.\nMr. Brannan. Yes.\nMr. Macdonald. My last question seems perhaps even to myself a\nlittle offbeat.\nIf you utilize a user tax, isn't that a form of pay TV ? Aren't these\npeople paying for something that is presently in the domain of free\nMr. Carey. May I ask Mr. Brannan to comment first?\nMr. Macdonald. Yes.\nMr. Brannan. I would say no, on the grounds that until 1965 we\nhave had a set tax on televisions which we did not regard as pay TV.\nThis was a tax paid at the time the set was purchased. It similarly\napplied to purchases of radios and cameras. We had quite a few excise\ntaxes that we repealed in 1965. It was certainly not a thing that\nvaried with whether or not you turn on the program, which is the\nreal feature of pay TV.\nMr. Macdonald. Do you all agree with that statement ?\nMr. Carey. I agree.\nMr. Macdonald. Thank you very much.\nMr. Kornegay ?\nMr. Kornegay. Thank you, Mr. Chairman.\nTo follow up that thought, the theory behind the tax, though, on\nmost of the excise taxes, is the luxury aspects of it. You added it on\nmany items that were generally considered to be luxuries. The taxes\ngrew out of taxes imposed on certain commodities during World\nWar II.\nMr. Brannan. Let me answer that that could be said of some of\nthe excise taxes. It wasn’t very consistent. It was partly because the\nCongress was not satisfied with that—that the taxes did serve to tax\nluxuries—that they were willing to repeal them.\nAir. Kornegay. It is always easy to go to those things or place a tax\non those things which you justify the easiest. Of course, the luxury"
}