{
  "id": "d30-122",
  "text": "22\nMr. Carey. To the best of my knowledge, it has not, Mr. Kornegay.\nAs I say, I have come very recently to the subject matter. It may well\nbe that back over the last several months some consideration was\ngiven to it. Perhaps Mr. Brannan knows, but I am not aware of\nanything like that.\nMr. Kornegay. That is very much akin to your second suggestion.\nYou say that the gross revenues for radio and television amount to\napproximately $3 billion annually.\nMr. Carey. That is the estimate I have, yes, sir; growing about 10\npercent per year.\nMr. Kornegay. With an annual increase of about 10 percent. And\nyou say about $2 billion worth of sets are sold each year. My first\nfeeling was that there would be a greater distance between those two\nfigures than $1 billion.\nMr. Coston. I think one of the points Mr. Carey made was that the\ncountry is undergoing a rather substantial conversion to color receivers.\nMr. Kornegay. And that is an expensive conversion.\nMr. Coston. It is an expensive conversion. It is quite possible that\nwhen that conversion has been completed, the $2 billion level wall no\nlonger sustain.\nMr. Macdonald. Except if you take into account the fact that what\nis known as the population explosion would take up the slack. I would\nthink the conversion part really doesn’t make that much difference.\nMr. Coston. That is very possible.\nMr. Carey. Your comment indicates there is a lot of homework to be\ndone in estimating in all of these categories. We are very sensitive to\nthat.\nMr. Macdonald. If the gentleman will yield, I agree with you that\nthe Corporation, the Congress and this committee—not the appropriate\ncommittees, but this committee—has a lot of work to do together just\nto figure out how much the cost will be. I think we are all just groping\na little bit to find out what this will cost.\nI would also add that I think the three suggestions about ho w to raise\nthe money are self-defeating. They knock themselves down, it seems\nto me.\nMr. Carey. We would welcome alternatives, Mr. Chairman, from\nthis quarter, certainly. I think we also have to come together with the\nCorporation’s Subcommittee on Finance. This is really, I think, the\nnext order of business as far as the three agencies are concerned. I think\nthe ball, in a way, gets tossed to them, and we will be glad to feed in\nwhatever thinking, good or bad, we have been able to do up to this\npoint, and broaden the conversation, including your staff, and do it\nover the next several months fairly intensively.\nThis is really where we are at this point. In a lot of ways, it is pre¬\nmature to be talking about the kind of things I have been talking\nabout,\nMr. Macdonald. I would suggest that testimony not be given offi¬\ncially unless it has been thought out. Don’t you think that is reasonable ?\nMr. Carey. Yes. But on the other hand, what I said at the beginning\nwas that I thought you wanted us to tell you a little bit about the status\nof the thinking, as far as it has gone. While it hasn’t gone too far, this\nis the status up to this point. It is still open ended. It hasn’t been closed\noff. It is quite open."
}