{
  "id": "d30-123",
  "text": "23\nThere may well be better alternatives than the ones I have talked\nto you about. We are certainly relaxed and ready to hear them.\nMr. Kornegay. In line with the chairman’s statement that these pro¬\nposals are sort of self-defeating, I would certainly think that the No. 1\nwould fall well into that category in that the TV set, to my way of\nthinking at the present time, anyway, is pretty well burdened down\nwith overcharges and extra charges now. We have talked about the\nchangeover from black and white to color, which is a very expensive\nthing as far as TY sets go.\nWe came along and made the manufacturers put all-channel con¬\nnections in all of them, which I expect a majority of the people in this\ncountry seldom, if ever, use. Maybe in the future they will be used as\nmore UHF stations open up. Now CATY is becoming quite popular.\nThat is another charge that is put in on them.\nI don’t know how much the old mule is going to be able to pull,\nif you come along and put a healthy tax on top of him. It may be so\nexpensive that people will not be able to buy and keep television sets.\nMr. Carey. That is really a question.\nMr. Macdonald. I have no pride of authorship.\nMr. Carey. I would say the feasibility, Mr. Kornegay, of this idea\nof a tax on TY and radio sets would stand or fall, I guess, in large\npart, on the impact of the tax you are talking about. You talk about\nanother healthy tax on TY sets and radio sets. The question is how\nhealthy the blow would be. If it turned out to be in the range of,\nlet’s say, $1 or $2, something like that, per set, you might come out to\none conclusion. If it turned out to be $25, it might be a different ball\ngame completely.\nMr. Kornegay. In order to raise any substantial revenue, it will have\nto be more than $1 or $2 per set. You talk in terms of 1 percent on the\ngross revenues of the commercial stations, which would give you,\nbased on the $3 billion figure, $30 million.\nMr. Carey. If you were going to try to run the whole enterprise by\na tax on the manufacture of radio and TY sets, that probably would\nsuggest a pretty high tax. On the other hand, if you had a mix—sup¬\nposing you had some elements of all three of the things I have men¬\ntioned here, including a hefty general fund payment into a trust fund,\nsomething of that nature—then you might still have, as a sort of\nthird leg on the stool, something like this tax on the manufacture of\nTY and radio sets which would mean that you would have a moderate\nimpact on the price.\nIf it turned out that we all settled on a mixture of taxes and general\nfunds, I think it might be viable.\nMr. Kornegay. I commend you for your willingness to explore,\nthink about and consider, so we can bat around all the ideas that might\ncome up.\nThank you very much.\nMr. Macdonald. Mr. Broyhill.\nMr. Broyhill. Thank you, Mr. Chairman.\nMr. Carey, how much of the $9 million which was authorized in\nthe act last year is included in the 1968 budget ?\nMr. Carey. We had planned on about a $4 million appropriation in\n1968, which was, in effect, half a year, I guess. That is about the way\nit was worked out. That was not, in the last analysis, recommended"
}