{
  "id": "d30-126",
  "text": "26\nlieve that this administration would give it almost equal weight in\nthat regard.\nMr. Carey. Mr. Harvey, these choices are always agonizing choices.\nI served under President Eisenhower in the budget business, as well,\nas under President Johnson in the budget business. The answer is not\nalways clear in terms of tradeoffs from one priority to another. It is\nan exercise, as you know, sir, in judgment and relative equities and\nrelative justices.\nThere are a lot of things that a President would like to recommend\nthat he doesn’t recommend. He can’t. There are a lot of things that\nhe would like to do that he can’t do. I think that the problem that\nthe Congress has, just as the problem the President has, is assessing\npriorities. When the President sends up his budget with his priorities\nin it, the Congress doesn't hesitate to substitute its judgment.\nI think this is the situation where the administration at this point\nis recommending this bill, Mr. Harvey. As of now, I have said to your\nchairman that it is my belief that the President will transmit a budget\namendment to finance it.\nMr. Harvey. In the full amount?\nMr. Carey. Presumably at $9 million, but what I said to the chair¬\nman also was that I can't read the President’s mind in the last analysis,\nand he may very well modify that figure. But I know of no reason\nat this point to \"indicate that he would. His judgment at this stage,\nand the administration’s judgment, is that we ought to have this\nlegislation, we ought to have the authority for the appropriation. The\npresumption is—on which we are all moving—that the administration\nwill w7ant it financed.\nMr. Harvey. I just want to reiterate, without taking any more time,\nthat I think this administration and the Bureau of the Budget ought\nto re-read what the Ford Foundation and the Carnegie Commission\nsaid on how this program ought to be financed, and then I think they\nought to go back and reassess their priorities in this regard.\nI can’t help but believe that somewhere along the w7ay, if we are to\nbelieve what the President said the other day, that he was willing to\ncut expenditures of $8 billion or $9 billion to get a tax increase through\nthe Congress, that this bill, w7ith this priority, will survive under those\ncircumstances.\nI have no further questions.\nMr. Macdonald. Chairman Staggers ?\nMr. Staggers. Thank you, Mr. Chairman.\nI wrould like to make one observation.\nThe bill is a very simple bill that is before the committee. All it does\nis change the figures 1968 to 1969. We have gotten far afield with all\nof the things that have come up. I don’t know how we got afield. It was\napproved last year, after bitter debate on the merits of it. If it was\nmerited then, if is merited now. I think it is in the future.\nI said then, and I say now’, that I think it is one of the most im¬\nportant bills that this committee could put out in this session of Con¬\ngress. I reiterate that. All we are trying to do is change the figures\n1968 to 1969.1 don’t think that is a big problem. We debated this issue\nlast year.\nThe men on the Corporation have been chosen, but they haven’t been\nable to organize or submit anything to Congress. That is what they are"
}