{
  "id": "d30-129",
  "text": "29\nMr. Brown. I seem to be going around the bush with you over and\nover. Is it procedures or is it the money ?\nMr. Coston. It is both.\nMr. Brown. When will the procedures be ready ?\nMr. Coston. Well, we are working on them now. I would hope they\nwould be ready within the next 2 months.\nMr. Brown. And you think then that you will be in a position to\nask for the funds?\nMr. Coston. Yes, sir.\nMr. Brown. How much are you going to ask for ?\nMr. Coston. $12,5 million.\nMr. Brown. In other words, we are talking about $9 million for\nthis and $12.5 million to pick up—we are dropping out the $10 million\nthat was in the 1968 ?\nMr. Coston. That is my understanding; yes, sir.\nMr. Macdonald. Will the gentleman yield ?\nI don’t know why you get into that, Mr. Coston. I agree with the\nchairman 100 percent. This is a very simple bill. It has nothing to do\nwith financing for any other year. It merely postpones for a year\nthe action that this committee took.\n\\°u gentlemen, by your testimony-—and I agree with the chairman\nhaving thought about it—got us off the track by projecting all these\nfigures that have nothing to do with this bill. Whv don’t you iust\ntestify about the bill before us ?\nMr. Coston. Mr. Macdonald, I would be very happy to do that,\nbut I do feel I have to respond to questions from the members.\nMr. Brown. If I may, Mr. Carey, I would like to ask you about\none point. You said one thing that I was struck by because of another\ncommittee on which I serve.\nYou want the funds, or you suggest that the funds which would be\nprovided—on the bottom of page 5 and the top of page 6—from the\nCongress should be provided on a long-term basis, unless the Congress\ndecides to act to negate that authorization for funds. You say “unless\nthe Congress took negative action to prevent such payment.”\nWhat is your thinking behind this? Are you suggesting that nega¬\ntive action is harder for Congress to take than affirmative action?\nMr. Carey. I think that the question runs to the stability of the\nfinancing of the Corporation. From that point of view, an assurance\nof a flow of funds is probably what we would all like the Corporation\nto have. L\nThe way I express this alternative, assuming we were going into\ngeneral revenues, maybe or maybe not going into taxes along with it\nwould be that one way of providing the stability would be to say that\nthe Congress would provide for an automatic general fund appro-\nft chosentoint° a tl>USt fUnd and then be aWe tG PUH tbe String ^en\nBut that isn’t necessarily what I am suggesting here. That is one\nway to do it Another way would be for us not to use the negative\nor string-pulling approach to it and simply say for # years, 3 years 2\nyears, whatever the Congress in its wisdom decided, there will be so\nmuch money from general funds that the Corporation can count on\nIt really runs to the stability. '\nMr. Brown. Can count on from the Congress?"
}