{
  "id": "d30-130",
  "text": "30\nMr. Carey. From the Congress; yes.\nMr. Brown. Let me ask yon the next question.\nWhat can they count on from the administration? You see, Con¬\ngress can authorize the money and can even appropriate the money,\nbut the administration, the Bureau of the Budget being the deter¬\nmining body, doesn’t have to spend it, does it ?\nMr. Carey. No. But if it were set up on a direct appropriation that\nmight be true, and it wouldn’t be true if you legislated, in effect, a\nmandatory payment into a trust fund. There isn’t very much that\neven the Budget Bureau can do about trust funds.\nMr. Brown. This is not what you are talking about here. You are\nnot talking about trust funds, as I understand it. You are talking\nabout the appropriation by the Congress. This was under your third\npossibility, the use of general revenues.\nYou suggest that the Congress should appropriate the money, make\navailable the money, and precommit itself for 3 years.\nMr. Carey. Into a trust fund. That is what it says.\nMr. Brown. What about the administration’s control of the ability\nto put general revenue funds into a trust fund ? This is general rev¬\nenue. This is not a tax that goes directly into a trust fund. This is\ngeneral revenue appropriation, as I understand, and, as I understand,\nthere is a distinction. Will the administration have no control over\nthis ?\nMr. Carey. The administration in the short run wouldn’t have\ncontrol. The administration would have a voice, however, at, let’s\nassume, 3-year intervals to reconsider both the mechanism of funding\nand the merit and scale, and dimension, of the funds.\nSo we would have our lick at it at the same time the Congress did,\nif this kind of an alternative were adopted. The administration, the\nexecutive branch, wouldn’t be completely out of the action any more\nthan the Congress would.\nMr. Brown. You are avoiding the point I am trying to hit on, of\ncourse, and that is whether or not the administration would have con¬\ntrol in the final analysis over the expenditure of the funds that are\neither within the trust fund or the placement of those funds in the\ntrust fund.\nMr. Carey. I see what you mean. I am sorry.\nMr. Brown. The President did not control the expenditure of funds\nunder the highway trust fund?\nMr. Carey. He had something to do with the rate of commitment\nof funds under the highway trust fund. But I don’t think he would\nhave any control over particular highway projects. I don’t think the\nadministration wants any part of control over the grants and con¬\ntracts that the Corporation would make.\nMr. Brown. He had a slowdown of the expenditure of highway\ntrust funds, did he not ?\nMr. Carey. Yes, sir.\nMr. Brown. Is that possible in this; that is, in the recomendations\nyou are making, or considering here ?\nMr. Carey. I can’t see that kind of control here, Congressman.\nMr. Brown. I do think it is a point of some interest because it makes\na difference to me as a Member of Congress whether you are expect¬\ning Congress to authorize an open-ended expenditure of money, and"
}