{
  "id": "d30-131",
  "text": "31\nyet the President has the possibility of controlling ultimately the ex¬\npenditure of that money. To me, that removes the eminent trustees\nof the Public Broadcasting Corporation from congressional control,\nbut does not necessarily free them from administrative control by\nthe President.\nNow, if I can go to one other point, it is suggested that if we had\nthe operation financed by the taxation on gross revenues of commercial\nbroadcasters, that “a large share of such a tax would be passed on to\nconsumers through increases in the price of products advertised on the\nbroadcast media.” Where are you suggesting that the other share\nbesides the larger share would come from ?\nMr. Carey. I would like my colleague from the Treasury to try\nto answer that one.\nMr. Brannan. I might call your attention to the fact that we say\nsimply that it is possible that a large share of such a tax would be\npassed on in this way.\nMr. Brown. Under What circumstances is it possible ?\nMr. Brannan. It might affect the price charged by TV stations, or\nit might be absorbed to some extent by the advertisers, or it might be\nShifted on in the price of the advertised products. These are ques¬\ntions that would depend on the market structure in those cases where\nsome further long-run study would be appropriate, if we wanted to\nsay more about it.\nMr. Brown. I would like to submit to you, sir, without trying to\ndevelop the point—because we apparently are anxious to hurry on to\nthe next witnesses—that any business operation, whether it be a com¬\nmercial television station, a radio station, or an advertiser on that\nstation, that is unable to pass on additional taxes to the consumer\nisn’t likely to stay in business too long because his profit shrinks and\nhe will leave the field in the face of competition that is making a better\nprofit.\nI can’t see how you can suggest that a large share or any share of\na tax is going to be passed on. It is probably all going to be passed on,\nin point of fact. It seems to me rather practical business.\nMr. Carey. I don’t know that we can predict that. It may well be\nthat some part of this might be borne as a goodwill item, an expense\nof business goodwill.\nMr. Brown. Let’s go to the final point I would like to pursue with\nyou at some length, but apparently will not be able to do so.\nIf the Federal Government is in some financial difficulty and has\npriority problems, as was suggested by the gentleman from Michigan,\nof which this may not rank very high, if the burden, as suggested by\nthe gentleman from North Carolina, on the manufacturers of televi¬\nsion sets and on the consumer is too heavy for practical application, I\nam surprised that you haven’t suggested the possibility of a pay tele¬\nvision arrangement with ETV. Is this practical ?\nMr. Brannan. I have not studied that in particular detail. It is\nprobably worth looking at.\nMr. Carey. I think if I could comment a little bit, Mr. Brown, I don’t\nknow that we have ruled that out for all time as an alternative, but at\nthe present stage, giving you a personal reaction for what it is worth,\nwhat we are trying to do and wliat we thought Congress wanted to do\nin enacting this important legislation was to maximize the improve¬\nment in quality of public broadcasting, and to do it in a way that it"
}