{
  "id": "d30-133",
  "text": "33\nin its matching-grant program for facilities construction. Title I\naccomplishes this purpose. .\nWe recognize at the same time that facilities provide only the\ntechnology, and that to be truly effective these facilities must be used\nto broadcast programs of substance, quality, and depth. To do so, a\nnew device is needed in order to provide to every noncommercial\nradio and television station new opportunities to create and to share\nin that kind of diverse and significant programing.\nTitle II of the act, in creating the Corporation for Public Broad¬\ncasting, accomplishes that goal. We are aware that no plan for per¬\nmanent financing of the Corporation for Public Broadcasting has\nbeen put forward to the Congress. We are confident, however, that\nthose designated by the President to develop such plans will arrive\nat satisfactory proposals for this purpose in due course.\nWe have wholeheartedly agreed that a study of the instructional\nuses of radio and television should be undertaken to help clarify in\nwhat ways instructional broadcasting pertains to education, and to\ndetermine whether and what Federal aid should be provided. Title\nIII establishes such a study.\nWe look forward eagerly to cooperating in its research. Its findings\nwill set new horizons and suggest new opportunities for effective serv¬\nice to the Nation by educational broadcasting.\nWe emphasized not only our total support for this integrated pro¬\ngram of construction, usage and research, but, even before the crea¬\ntion of the Carnegie Commission, the urgency of its need. Noncom-\nmerical, educational broadcasting can only progress with the aid this\nact promises. It will be given new life and new opportunities for\nservice to the continuing education of our citizens by implementa¬\ntion of the Public Broadcasting Act at the earliest possible moment.\nThe Carnegie Commission’s report, the President’s 1967 state of\nUnion message, the 1967 conference of educational broadcasters and\ntheir governing boards on long-range financing problems, the intro¬\nduction of the act and the speedy and enthusiastic response and sup¬\nport of the Congress to that act, the establishment of the National\nCitizens Committee for Public Television—all these events converged\nearly in 1967 to create a wave of enthusiasm that promised to carry\neducational broadcasting a long way toward its goal.\nFollowing the passage of the Public Broadcasting Act, stations\nand institutions across the country made plans for the establishment\nof new stations and for the improvement of existing ones. Private\ncitizens, local governments and institutions, business and industry,\nfollowed the leadership shown by the Congress in adopting thisr\nlegislation.\nFunds were pledged from a variety of sources to match those which,\npresumably, would continue to be granted through the Federal facili¬\nties program. Complicated projects of planning and research were\nundertaken in the area of programing as well: Regional networks—\nin some sections of the country only a dream for many years—\nsuddenly became visible realities with headquarters and staff and pro¬\ngraming schedules. Thus, Congress created a new interest throughout\nthe country. .\nA year has passed since the Public Broadcasting Corporation was\nlaunched in the Congress. There have been no funds available under"
}