{
  "id": "d30-135",
  "text": "35\ngranting not yet more than dreamed of, directed to the needs and\ninterests of the American people.\nLocally, regionally, and nationally, educational radio and television\nbroadcasters, aided by the Corporation, must reach out to the problems\nof our people, must furnish the means for realizing communication\namong peoples. America realizes today as never before that education\ncannot stop when schooling ends; that education in the context of our\nneeds is not necessarily formal instruction.\nContinued opportunity for continuing education in the broadest and\nmost significant sense, in promoting community understanding, will\nbe an important goal of the Corporation’s programing responsibility.\nWe are already late in meeting this goal; further delay is unthinkable.\nWe reiterate, and incorporate herewith by reference, all of the\nsupportive testimony which we and many others have submitted in\nearlier hearings on the Public Broadcasting Act. If the authorization\ncannot be realized in 1968, then it has to be 1969. The need is now.\nYou will note in reviewing my statement that there is a great note\nof urgency, which I think has not been brought out in the hearing\nthis morning. I shall assume that the committee embers will note\nthat in the statement.\nI would like to give you one more statement. I am from Wisconsin,\nthough I am not a pleader for Wisconsin. That is the situation I\nknow best. The story I am about to tell you is pretty much typical of\nsituations elsewhere around the country with respect to the under¬\nstandable delay in what has happened in these appropriations, both in\nterms of title I, which is an extension of the Facilities Act, and the\nCorporation for Public Broadcasting.\nThe momentum which was generated by this committee and by\nothers in the Congress by the passing of the Public Broadcasting Act\nlast fall enabled a great deal of activity on the part of States and local\ngroups all over the country last year.\nIn Wisconsin, we are pioneers in educational radio. We will cele¬\nbrate our 50th anniversary next year, but there has been difficulty\nin establishing statewide educational television.\nThanks to the efforts of many of you on this committee in the\npassage of the Public Broadcasting Act, the Wisconsin Legislature,\nin the last hours of its session last December, passed on Educational\n-Communications Act, authorizing the State to proceed with the\nestablishment of additional educational television stations, arranged\nfor $400,000 under long-term bonding for matching funds, engineer¬\ning surveys, and so on.\nA new board, responsible for both educational radio and educa¬\ntional television has been established and met March 1. I reported\non the first meeting of this board to the major entity concerned with\neducation in the State of Wisconsin, the Coordinating Committee for\nHigher Education in Wisconsin, on the 1st of March. My report was\naccepted. I won’t go into the details of this.\nThe important point for this committee is, I think, that I was\nasked one question when I finished that report. The question came\nfrom Walter J. Kohler, former Governor of Wisconsin, now the\nchairman of this coordinating committee. Governor Kohler said:\nI understand that now that we have passed this legislation and we are all\nset to go, the Congress hasn’t acted with the appropriation. What is the story?"
}