{
  "id": "d30-136",
  "text": "36\nI did my best to explain the story. But I think this kind of mood\nis present, not only in Wisconsin but elsewhere, and this applies not\nonly to title I, which I am concerned with in this story, but also to\ntitle II and the establishment of the corporation.\nWe have lost some momentum, and I think many of you gentle¬\nmen understand this. It was certainly the intent of the committee\nin its report—and I shall not take the time to go back and quote your\nown report—that all these matters of financing and so on, while not\nbeing set aside with no consideration, should be set aside until, ap¬\npropriately, once the corporation is established and is in being, and\ncan show some track record, it could be brought into focus.\nThe only other point I would like to make, Mr. Chairman, is that\nit seems to me, as a representative of educational radio and educa¬\ntional television broadcasters, that somewhere, at least in this morn¬\ning’s discussion which I have heard, we have somehow missed a point.\nThere has been, quite properly, a concern over the moneys appro¬\npriated for the purposes of this act and the problems which the Con¬\ngress finds itself faced with in terms of Vietnam, the cities, gold, and\nall of the rest of the problems besetting our country. I think the\nfundamental point which most of us would wish to make to you gen¬\ntlemen is that a democracy, which is our form of government, does\nnot act effectively unless its citizens understand what these issues are\nabout.\nMr. Macdonald. Sir, before we get into that, and I think we have\nbeen around the bush several times, to quote Mr. Brown, if you would\njust read the bill, the bill before us is not the Public Broadcasting\nAct. It merely states that we strike out 1968 and insert 1969.\nSo, all of these philosophical discussions about whether this bill is\na good bill or a bad bill, or what is in the bill, all of that, seems\nirrelevant to me.\nI hope you will confine your remarks, as I tried to have the mem¬\nbers from Budget, Treasury, and HEW, to that, it would be helpful.\nNothing else is before us. We have already passed the bill.\nMr. Robertson. I couldn’t agree with you more, Mr. Chairman. It is\nnow the law of the land. The sole issue is whether 1968 gets changed\nto 1969.\nMr. Macdonald. Right.\nMr. Robertson. I would only add a sentence or two to say that I\nwould like to strongly second or emphasize two points that Mr. Hughes,\nfrom the corporation, made.\nThat is, that the corporation now being in being will be very much\naffected by the rapid action of this committee and of both Houses of\nCongress, not only in passing this bill that is before you, but the\nsubsequent appropriations for the corporation in two ways.\nCongressman Springer mentioned earlier the importance of the\nmakeup of the board. That has been done, I think, to most peoples’\nsatisfaction.\nThe next most important thing is the selection of staff. We all\nknow that when we try to find excellent people to take responsible\npositions, whether they are really interested in doing this or not is,\nin part, a matter of what dollars are available, what confidence is put\ninto this."
}