{
  "id": "d30-137",
  "text": "37\nI think that a rapid action on the part of this committee on this\namendment and subsequent appropriations for the corporation will\nenable this new, excellent board to find the kind of staff that it needs.\nSecond, that such action also will encourage the corporation\nmembers and will make manifestly easier for them the job of securing\nprivate funds. From the very beginning there has been the argument,\nquite properly, that the funds this corporation has at its disposal\nshould be both public and private.\nI could go into that from my experience. I know there are many\nnational and regional groups that look with favor upon the establish¬\nment, of the corporation as a place where they can put their dollars to\nhelp all of public broadcasting rather than contributing specifically\nto one station or another.\nThat, in essence, Mr. Chairman, are the points I would like to make.\nMr. Macdonald. Thank you very much.\nOur next witness is Ben Kubasik of the National Citizens Commit¬\ntee for Public Television.\nSTATEMENT OF BEN KUBASIK, EXECUTIVE DIRECTOR, NATIONAL\nCITIZENS COMMITTEE FOR PUBLIC TELEVISION\nMr. Kubasik. My name is Ben Kubasik, executive director of the\nCitizens Committee for Public Television.\nThomas Hoving is chairman of the National Citizens Committee\nfor Public Television. Mr. Hoving would have been here today were\nhe not abroad on business in his capacity as director of New York\nCity’s Metropolitan Museum of Art.\nI am here today to speak on behalf of the 120 distinguished Ameri¬\ncans who comprise the committee and, by extension, those millions of\nAmericans who anticipate change in broadcasting through public\ntelevision and public radio.\nThe Citizens Committee is growing. More individual Americans are\nbeing asked to join. Thousands of other citizens are serving in auxil¬\niary capacities to the national committee. These include members of\nnational organizations and associations as well as participants in\npresently constituted and newly forming State and local organiza¬\ntions aiding in the growth of public broadcasting.\nI urge on their behalf the immediate amendment of the Public\nBroadcasting Act of 1967 to allow the $9 million authorized to finance\nthe Corporation for Public Broadcasting to carry over into fiscal 1969.\nWe obviously would have preferred that the initial intent of the\nPublic Broadcasting Act of 1967 had been carried out. This would\nhave meant that $9 million would have been made available to the\nCorporation for Public Broadcasting for fiscal 1968. And that the\n$10.5 million in facilities and new construction moneys would have\nbeen made available to stations in fiscal 1968.\nBy saying this, I am reiterating the unanimously passed resolution\nput forward by the National Citizens Committee at its first annual\nmembership meeting, held only a month and a half ago in New\nOrleans. If no objection, I would like to submit for the record both the\nresolution and a list of the committee’s membership. (See pp. 39-42.)\nIn the resolution, the committee hailed the Congress for passing\nthe Public Broadcasting Act of 1967 and noted that by its action the"
}