{
  "id": "d30-140",
  "text": "40\nThe National Citizens Committee urges Congress to reaffirm its commitment to\nthe bill as passed and appropriate the full amount as authorized.\nMembers of the National Citizens Committee for Public Television\nyimim”Alexander11?^1: Journalist (bi-weekly column, “The Feminine Eye”),\nLife Magazine, Los Angeles\nFran Allison: Actress, Englewood, New Jersey . „ ,\nDavid Am ram : Composer in Residence, Philharmonic Hall, New York City\nRobert O. Anderson : Industrialist and rancher, Roswell New Mexico\nSeth G. Atwood: President, Atwood Vacuum Machine Company, Rockford,\nIllinois; Past President, Young President’s Organization\nThomas Baillantine: President, Louisville Title Insurance Company\nRobert E. Bell: Vice Chairman, Wyoming Educational Television Commission,\nUniversity of Wyoming, Laramie\nLeonard Bernstein : Composer, conductor, New York City\nMrs. Rexford S. Blazer: Patron of the arts and education, Ashland, Kentucky\nDonald Brayton, M.D.: Associate Dean, School of Medicine, UCLA, Los Angeles\nKingman Brewster. Jr.: President, Yale University, New Haven\nRobert McAfee Brown; Professor of Religion, Stanford University, Stanford,\nHerbert B. Cahan: Vice President, Westinghouse Broadcasting Company, Inc.,\nBaltimore; Chairman, Maryland Educational-Cultural Television Commission\nMrs. Edmund D. Campbell; President, Greater Washington Educational Tele¬\nvision Association, Washington, D.C.\nPaddy Chayefsky: Author, New York City\nKenneth B. Clark: Metropolitan Applied Research Center, New York City\nRabbi Seymour Cohen: The Anshe Emet Synagogue, Chicago; Past President,\nSynagogue Council\nSister Mary Corita: Professor of Art, Immaculate Heart College, Los Angeles\nBill Cosby: Actor, Beverly Hills\nHoward T. Cox ; President, Capital National Bank, Austin, Texas\nNina Cullinan : Patron of the arts and education, Houston\nJonathan Daniels ; Editor. The News and Observer, Raleigh\nMrs. Moise W. Dennery (T) : President, Greater New Orleans Educational Tele¬\nvision Foundation (WYES-TV)\nOwen Dodson: Professor of Drama, Howard University, Washington, D.C.\nCarl J. Dolce: Superintendent of Public Schools, New Orleans\nT. L. Donat, M.D.; President, North Dakota Educational Television Commis¬\nsion. Fargo\nRev. Robert F. Drinan, S. J.; Dean, Boston College Law School\nLee A. DuBridge: President, California Institute of Technology; Chairman,\nCommunity Television of Southern California (KCET)\nRichard Eells1; Professor of Business, Columbia University, New York City\nRalph Ellison (T) : Author, New York City\nWilliam A. Emerson, Jr.: Editor, Saturday Evening Post, New York City\nJohn H. Fabretti: Vice President. Planning and Administration, California-\nWestern States Life Insurance Company; Chairman of the Board, KVIE,\nSacramento\nMel Ferrer; Actor, Beverly Hills\nMortimer Fleishhacker, Jr.: Chairman, Precision Instrument Company; Presi¬\ndent. Bay Area Educational Television Association (KQED). San Francisco\nRev. William F. Fore: Executive Director, Broadcasting and Film Commission,\nNational Council of the Churches of Christ in the U.S.A., New York City\nR. Buckminster Fuller : Engineer. Carbondale, Illinois\nPhillip Gainsley (T) : Attorney, Minneapolis\nJohn Kenneth Galbraith : Professor of Economics, Harvard University\nGeneral James M. Gavin : Chairman, Arthur D. Little. Inc., Cambridge\nEdwin O. George: President and Director, Detroit Edison Company; President,\nDetroit Educational Television Foundation\nRev. Richard R. Gilbert: Chairman. Division of Mass Media, United Presby¬\nterian Church in the U.S.A., New York City"
}