{
  "id": "d30-141",
  "text": "41\nBrendan Gill: Drama Critic. The New Yorker Magazine, New York City\nBryghte D. Godbold : Executive Director, Goals for Dallas, Dallas\nJacqueline Grennan : President, Webster College, Webster Groves, Missouri\nAndrew Hacker: Professor of Government, Cornell University, Ithaca, New York\nJoyce Hall: Chairman of the Board, Hallmark Cards, Inc., Kansas City, Missouri\nFred Harvey Harrington : President, University of Wisconsin, Madison\nMichael Harrington : Author, New York City\nHarlan H. Hatcher : Former President, University of Michigan, Ann Arbor\nSamuel P. Hayes : President, Foreign Policy Association, New York City\nLeland Hazard: Professor of Industrial Administration and Law, Carnegie Insti¬\ntute of Technology; Honorary Chairman, WQED, Pittsburgh\nE. William Henry: Attorney, Washington, D.C.; Former Chairman, FOC\nJerome H. Holland: President, Hampton Institute, Hampton, Virginia\nThomas P. F. Hoving (T) : Director, Metropolitan Museum of Art in New York\nCity\nAlex Jacome: President, Jacome’s Department Store; Past President, Arizona\nBoard of Regents, Tucson\nDevereux C. Josephs (T) : Chairman of the Board, WNDT, New York City\nGarfield I. Kass: President, Kass Realty Company, Inc., Washington, D.C.\nMilton Katims : Conductor, Seattle Symphony Orchestra\nHerman Kenin: President, American Federation of Musicians; Vice President,\nAFL-CIO, New York City\nDavid Lloyd Kreeger: Chairman, Executive Committee, Government Employees\nInsurance Companies, Washington, D.C.\nArthur B. Krim: President, United Artists Corporation, New York City\nRalph O. Langley: Attorney, San Antonio, Texas\nMrs. H. Gates Lloyd, III: Patron of the arts and education, Philadelphia\nArthur Logan, M.D.: Surgeon, New York City\nRalph Lowell (T) : Chairman, Boston Safe Deposit and Trust Company; Presi¬\ndent, WGBH Educational Foundation, Boston\nMyrna Loy : Actress, New York City\nJohn W. Luhring: Regional Vice President, Union Bank; President, Community\nTelevision of Southern Calif ornia, Los Angeles\nWilliam P. Mahoney, Jr.: Attorney, Phoenix; Former Ambassador to Ghana\nMrs, Bennett Martin: Patron of the arts and education, Lincoln, Nebraska\nMrs. Eugene McDermott: Patron of the arts and education; Member, Women’s\nAdvisory Council, KERA/Channel 13, Dallas\nDonald McGannon: President, Westinghouse Broadcasting Company, Inc., New\nYork City\nRalph McGill: Publisher, The Constitution, Atlanta\nArthur Miller: Playwright and author, Roxbury, Connecticut\nNewton N. Minow (T) : Attorney, Chicago: Chairman, Chicago Educational\nTelevision Association ; Former Chairman, FCC\nMaurice B. Mitchell: Chancellor, University of Denver\nRobert Montgomery: Actor, New York City\nMrs, Jennelle Moorhead: Professor of Health Education, University of Oregon-\nFormer President, National P.T.A.; Eugene, Orgeon\nFrank B. Morrison ; Former Governor of Nebraska, Omaha\nHugo Neuhaus: Architect, Houston\nMike Nichols: Director, producer, Beverly Hills\nAntonia Pantoja: Executive Vice President, Puerto Rican Forum, New York\nCity\nRosemary Park : Vice Chancellor for Educational Planning and Programs, UCLA\nLos Angeles\nRev. Everett C. Parker: Director, Office of Communications, United Church of\nChrist, New York City\nI. M. Pei: Architect. New York City\nLouis S. Peirce: Chairman, Educational Television Association of Metropolitan\nCleveland\nErnest J. Philipp: President, Community Broadcast Council, Milwaukee\nA. Craig Phillips: Vice President, Richardson Foundation, Greensboro, North\nCarolina\nGerard Piel (T) : President and Publisher, Scientific American, New York City\nNorman Podhoretz: Editor, Commentary, New York City\nHarold Prince : Broadway producer-director, New York City\nEdward M. Purcell: Physicist, Harvard University, Cambridge, Massachusetts"
}