{
  "id": "d30-144",
  "text": "44\nControl Room Director who replied that it would be a few minutes before he\ncould put him on the air. When the commentator asked the woman how long she\nplanned to remain there, she raised her head slightly and asked “How long would\nyou like?” The responsible judgment of what constitutes news is most demanding\non the TV news media. I believe this requires something more than a beard and a\nguitar. Are they looking for news or viewers? I think you should look for news.\n“When people see it on TV they are experiencing it for themselves” said Fred\nW. Friendly, one time head of CBS News and now Professor of Columbia Uni¬\nversity Graduate School of Journalism. “It must be true, the viewer feels be¬\ncause he is seeing it. We cannot tamper with that trust, or we will lose\neverything.” NBC issued a directive last summer stating that no newsman is to\n“arrange”, “modify”, “stage”, “schedule” or “re-enact a news event. I Believe\nmost radio and TV stations now have similar instructions or an operating policy.\nLike all rules, there are exceptions which require responsible judgment. Clearly\nthere would be no problem when a presentation to an honored guest is re-enacted.\nBut should a newsworthy person be asked to walk fast or slow to better cover\na demonstration in the background? What if background music or applause is\nadded to a program? Consider the cameraman who missed filming a hoodlum\ndemonstrator throwing a rock through a window. Fortunately the broadcaster\nhas already answered most of these questions and presents the event unchanged\nas it happened. This responsibility assumed by broadcasters is no accident;\nit is their direct recognition of the right of free speech granted by our Constitu¬\ntion, which right has repeatedly been reaffirmed by the Courts, the Communica¬\ntions Act and the Rules and policy of the Federal Communications Commission.\nThe freedom enjoyed by the broadcast news media is not absolute. It is difficult\nat best to focus on a human being or event which pre-supposes that an initial\ndecision has tentatively been made and that this particular person or event\nis newsworthy. TV coverage even though entirely complete and accurate can,\nbecause of lighting, camera angle and other technical factors, eompletelv distort\nthe news. Thus there is the responsibility of reporting pictorially, what was said\nor done, without technical distortion.\nIn this and other respects, the broadcast media is at a disadvantage with the\nprint news media. The print media enjoys the luxury of evaluating the news¬\nworthiness of a President’s statement or other important event after it has\noccurred rather than carrying them as they occur. Consider coverage of an auto¬\nmobile race, live on TV. Normally you would expect to film the skill of the\ndrivers with possibly the main event being an interview with the winner. But\nwhat if the main event is a tragic and painful death? The TV newsman here\nmust make an instant decision which balances the public’s right to know con¬\nsistent with good taste and the mores of the times.\nWhen TV seeks to cover an important national figure, conditions may apply\nwhich would not apply equally to the print news media. Recently this entire\nmatter was brought to the public’s attention when Richard S. Sala'nt, President\nof CBS news, frankly told viewers that an interview with the President had\nbeen subject to some degree of control from the White House. TV coverage may\noften involve the power of some degree of veto as a pre-determined condition of\nthe interview.\nThere are also situations in which the very nature of TV coverage require the\nnewsman to be conversant in either local, national or international affairs.\nOn-the-spot radio or television news coverage may inadvertently jeopardize a\ndelicate local, national, or international situation. A delay in reporting such\nan event may properly be indicated. I do not classify this as censorship. It simply\nreflects responsible self-discipline in making judgments based on a great deal\nof experience and professional integrity on the part of the newsman.\nTV has an added hardship in that it serves both as a news reporting medium\nand platform for various political views. Unlike the editorial section of a news¬\npaper or magazine, the TV viewer is not always able to emotionally or intel¬\nlectually distinguish between the two. TV bears a responsibility in news presen¬\ntation which is greater than any others news media before in our history.\nMistakes have been made and will be made in the future. However, the Broadcast\nNews media on the whole has met, in my opinion, and dealt with each new\nchallenge as it appeared. This has been accomplished through the broadcasters’\nself-imposed code. This responsible approach is the only way the forward looking\nresponsible broadcaster maintains the rights granted him by our Constitution and\nthe corresponding duty which any right involves.\nWTe now have a new factor to deal with. This is the ETV station and the\nsupport it will receive from the newly created and as yet unfunded Public"
}