{
  "id": "d30-146",
  "text": "46\nwords and which would be reported in full in some newspapers and magazines.\nIn brief, on most evenings the average citizen who wishes to be better informed\nor to stretch Ms mind a bit or even dip into the best in our culture has no oppor¬\ntunity to do so—he is deprived of choice.\nThe educational station in a service area is a part of the media that the\nlicensee analyzes. To the extent that the educational station is airing special\ninterest viewing, it may not be necessary for the commercial station to carry\nas much of this type programming as might otherwise be necessary to “meet\nthe needs of the community.”\nThus it seems to me, the commercial station has a selfish motive in insuring\nthe continuation of a viable educational station, and limiting his obligation\nto carry programs that he cannot sell. By appropriate encouragement, he might\nbe persuaded to undertake an annual contribution to the station, in his budget,\nto insure that the educator stays on the air for a full program schedule. Under\nthis reasoning, he should be able to charge off such contributions as a business\nexpense. To this extent both the responsible commercial and educational TV\nstations serving the same community can better allocate their prime time eve¬\nning hours. For example, the commercial station could provide greater depth in\nits regular hard news coverage realizing that the in depth analysis need not\nbe provided because this is the function of the adequately financial ETV sta¬\ntion. As a matter of fact, on a current basis, there is a possible marriage between\ncommercial and ETV television stations. (I hope one or the other will not get\npregnant.) ABC has already announced that it does not intend to cover the\nRepublican and Democratic Conventions from gavel to gavel. I do not see why all\nnetworks could not cooperate and financially support the ETV coverage from\ngavel to gavel. The networks would then be free to monitor the entire conven¬\ntions and select for presentation what they choose. Also any member of the\npublic, would have a choice to view the entire proceedings over ETV.\nA commercial station can, of course, make a tax deductible charitable con¬\ntribution to an educational station. However, I find that revenue regulations\nlimit tax deductible charitable contributions of all kinds to 5% of the com¬\npanies’ taxable income and this could be a limiting factor on the amount the\ncommercial station could contribute to the educational station. If my reasoning\nis sound, it follows therefore that support should be given to a proposal to regard\nthese contributions by commercial stations to educational stations as a business\nexpense. The presentation of news over broadcast media has now become one of\nthe public’s primary sources of news. They want more of it and they want the\ndetails which are not possible with headline or capsule news presentation. They\nalso want to know what the other fellow thinks.\nOne of the matters you will be discussing in this National Television News\nConference is a new element—public opinion polling. Regardless of the judg¬\nments you may reach on the merits of television polling, I welcome the broad¬\ncasters use of new methods to inform the public. From what I can observe, the\npublic opinion is not without problems. Students could have a ball loading the\nresults. They can have one group repeatedly call in with a “yes” vote and another\ngroup with a “no” vote. This not only distorts the public’s view but also may\ndeny the vote to someone with a genuine interest in the issue. It is also possible\nfor special interest pressure groups to alert their membership and insert an un¬\nknown loading factor. Many other statistical inaccuracies can creep into such\npolls. Time Magazine in its October 20, 1967 issue cited an example of one city\nhaving inconsistent votes on related questions and that one station discon¬\ntinued its poll when 82% of the listeners indicated they believed poll results in¬\nvalid In essence, the question is “Do broadcast polls or poll results constitute\nnews?” The broadcaster is aware of the problems and his response is an auto¬\nmatic caution signal. .\nThe broadcast industry has and must in the future assume responsibility for\nthe news its presents. Our system will simply not permit or tolerate news to be\npresented under the auspices of the government. Yours is the responsibility\nto accurately report the news. We both have a responsibility to make sure\nthis right is not diluted. This requires a great deal of mature common sense.\nIf your judgment is to program these polls, so be it. I would caution dis¬\nclaimers as to results and I would certainly coordinate closely with your local\ntelephone company to insure that local communications are not jammed particu¬\nlarly those involving safety of life and property. There have been some specific\nexamples of this problem."
}