{
  "id": "d30-147",
  "text": "47\nMr. Macdonald. Mr. Ivornegay.\nMr. Kornegay. Mr. Chairman, I have done my share of chasmo-\nrabbits this morning. I have no questions, but I would like to sav\nI’m going to vote for the bill.\nMr. Macdonald. I think the majority will.\nThank you all very much.\nThe hearing is concluded.\n(The following resolution was submitted for the record:)\nResolution on Public Broadcasting Adopted by the General Board of the\nNational Council of Churches, February 22,1968\nTlie Public Broadcasting Act of 1967 is a significant step toward realizing\nthe full potential of non-commercial broadcasting. We therefore, commend the\nCongress for its vision in establishing a system of public broadcasting through\na private corporation, and express our appreciation to the Chairmen of the\nHouse and Senate Interstate Commerce Committee and to other persons who\nworked diligently for the passage of the Public Broadcasting Act\nWe support the continued development of Public Broadcasting as a major\neducational force in American life. We believe that Public Broadcasting can\nfijjlfhn°^.ilr° fldA R pr°£ramf ervic‘e that will analyze and interpret the dom-\nmant aspects of American culture, including the arts, religion, economic and\nsocial life, science and technology, government, law, and democratic institutions\nand practices. We especially support the potential in Public Broadcasting for\nJCUltUra1’ PUWiC affairS and ^ertainment Program! for\nWe believe that such a broadcast service will contribute information and\ninterpretation on issues which the people of this country are facing, or will\nelectorate proVlsl°n of which is essential to the maintenance of an informed\nWe recognize the valuable role of Public Broadcasting in making possible\nequal educational opportunities for all citizens, through formal educational\ncourses, and additionally, its service to the public as a means of continuing\neducation for everyone who has completed his formal education S\n(Whereupon, at 12:20 p.m., the subcommittee adjourned.)\no"
}