{
  "id": "d30-16",
  "text": "Following the Suffern Conference on Public Radio held jointly\nby the Corporation for Public Broadcasting and the Ford Found¬\nation, Bernard Mayes prepared a paper entitled ”Programming\nfor Public Radio: Some Preliminary Considerations. A con¬\nsensus of contributions from participants in the Suffern Con¬\nference. \" N\nIt strikes me that Mayes initial premise is wrong. The con¬\nflict is not over programming. The conflict, if any exists,\nis how to make public radio viable.\nEducational radio has not, as Mayes suggests, been largely\nconcerned with academic interests. Many stations — a major¬\nity — devote some (if not most) of their program schedule\nto public needs and public programming.\nThere was no evidence introduced at Suffern to suggest that\nbeefing up of the present system would fail. Educational\nradio has existed and expanded during the last half century\neven with extreme economic limitations. Can anyone say how\nstrong the medium would be had it been supported in the manner\nof educational television?\nThe issue is not programming. The main question is the manner\nin which revitalization of the medium is to occur. Is the\npresent structure and strength to be ignored.' Is an entirely\naew distribution system to be developed?\nThe Corporation (and others who involve themselves in the\nfunding of educational radio) must be aware of political facts.\nTo reject the established medium (even at its present limited\nlevel of effectiveness) would be unwise.\nThere must be a concern for those stations, institutions and\nindividuals who are performing the public broadcasting role\nin radio. There must be an identification of those individuals\nin educational radio who would operate stations in the public\nsector if they were financially able.\nDespite disagreement with Mayes preliminary statements,\nI find myself concurring with his conclusion.\nUltimately, programming will be the issue. Initially, we\nshould address ourselves to other matters including the de¬\ncision making that will provide the best utilization of the\nexisting educational radio system."
}