{
  "id": "d30-95",
  "text": "Statement by Frank Pace Jr. ,\nPresident, International Executive Service Corps\nto the Senate Committee on Commerce\non his nomination to be\nChairman of the Corporation for Public Broadcasting\nMarch 8, 1968\nMR. CHAIRMAN:\nIt is a privilege to appear before this Committee which determines our\nqualifications for confirmation of the President’s appointment to the Board of\nthe Corporation for Public Broadcasting. I have read Dr. Land’s classic\nstatement before this Committee on the value of the confirmation process, and\nendorse it thoroughly.\nWhen the President asked me to undertake this assignment I was aware\nof its importance and its scope. In the weeks since that time I have talked to\nmembers of the Carnegie Commission on Educational Television, headed by\nDr. James R. Killian, Jr. , visited public broadcasting stations and talked to\ntheir presidents and staff, discussed the issues with presidents of foundations\nand universities, heads of commercial television, young people, and the Chair¬\nman of the National Citizens Committee for Public Television, Thomas Hoving.\nThe opportunities and difficulties that lie before us are far greater than I had\nenvisioned. May I outline them briefly?\nPublic television, properly organized and effectively implemented, can\nfill a void in this nation which is more discernible every passing day. This\ncountry has made the transition from virtual isolation to world leadership with\nsuch rapid:ty that our system has had too little time to readjust to the new\nrequir imposed on it. Down the long road, it is to be hoped that public\ntelevision can help provide to our people a sense of history, perspective and\nunderstanding of our needs and purpose that is essential to maintain our position\nin the world.\nEqually important is the opportunity to satisfy the urge for self-\nimprovement which has been one of the great American characteristics. With\nconstructive programs, effectively and artistically developed, any American\ncan turn a knob and open up new opportunities for growth and self-improvement.\nIf public broadcasting is properly oriented, there need be no ghetto of the mind\nor spirit in this nation.\nFurther, public television accords with the American tradition established\nby our founding fathers: Any citizen, poor or rich, irrespective of race, color\nor creed, may, with the twist of the wrist, have available the best of history,\nart, music, drama or entertainment."
}