{
  "id": "d1280-1",
  "text": "Albert Fredette, Station Manager of WAMC, Albany Medical College, and Chairman\nof the Board of Directors for the Individual Member Division, stressed Bronson's competence\nfor the Job. \"Vernon has served for years as the Chairman of the Professional Developments\nCommittee of NAEB, and has thought more and preached more than anyone else about the\nimportance of raising the status of educational broadcasting to a true profession;\nconsequently, he is ideally suited to head this function and work actively to implement\nsome of the ideas his Committee has so long advocated.\"\n$13 MILLION ADDED TO ETV FACULTIES ACT; BYSTROM COMMENTS\nFor the fiscal year 1965, $13 million has been appropriated by the Congress, of\nwhich $300,000 is for administrative purposes. A total of $21 million of the $32 million\nhas been appropriated to carry out the ETV Facilities Act, Public law 87-447•\nAs of October 1, there have been 4-2 grants made for a total of $7*364*529; there\nare a total of 36 applications which have been accepted for filing and are awaiting further\naction. The applications request a total of $7,509*521 in Federal funds. Of this figure,\napproximately $2 million cannot be awarded because necessary local matching funds are not\nimmediately available.\nIn commenting on these figures. Dr. John Bystrora, Assistant to the Secretary of\nHEW for ETV said, \"I believe that there is in excess of $3 million represented in\napplications now under preparation for which local matching funds are available. We\nencourage state and local agencies to take full advantage of the use which this Federal\nincentive can stimulate.\"\nETV GRANTS ANNOUNCED\nApproval of five more grants under the ETV Facilities Act has increased the total\nnumber to 4-2 since funds became available in May, 1963* These grants were to:\nSpokane School District No. 8l, Spokane, Washington, for the establishment of a\nnew station operating on Channel 7• Amount of Federal grant approved: $201,991*\nUniversity of Houston, Houston, Texas, for the expansion of the station operating\non Channel 8. Amount of Federal giant approved; $294-,996.\nEducational Television Association of Metropolitan Cleveland, Cleveland, Ohio, for\nthe establishment of a station operating on Channel 25. Amount of Federal Grant approved:\n$250,000.\nUniversity of Illinois Board of Trustees, Urbana, Illinois, for the expansion of\nWILL-TV, Channel 21. Amount of Federal grant approved: $300,000.\nGreater New Orleans Educational Television Foundation, New Orleans, Louisiana,\nfor the expansion of WIES-TV, Channel 8. Amount of Federal grant approved: $196,235.\nAPPLICATIONS RECENTLY ACCEPTED FOR FILING\nThree new applications have been accepted for filing under the ETV Facilities Act:\nThe State Board of Control of Florida and Florida Educational Television Commission,\nboth Public Corporations of the State of Florida acting for and in behalf of the University\nof South Florida, Tampa, Florida, for the establishment of a new broadcast station on\nChannel 16 in Tampa. Total estimated project cost: $482,398.\nCommunity Television of Jacksonville, Florida, to expand the operation of WJCT\noperating on Channel 7 i& Jacksonville. Total estimated project cost: $301,04-0.\nLeHigh Valley Educational Television Corporation, Bethlehem, Pennsylvania, for the\nestablishment of a new station on Channel 39* Allentown. Total estimated project cost:\n$504,834."
}