{
  "id": "d1280-2",
  "text": "Publications\n• Television in Teacher Education is a 72-page book¬\nlet edited by Edwin P. Adkins and obtainable from\nthe American Association of Colleges for Teacher\nEducation, 1201 Sixteenth St., N. W., Washington\n6, D. C. Single copies $1.50.\n• Radio and Television, a Selected Bibliography may\nbe obtained from the Superintendent of Documents,\nU. S. Government Printing Office, Washington 25,\nD. C., for 25 cents. Author of the 45-pager is Patricia\nBeall Hamill.\n• “Automation in Education,” a reprint from Teach¬\ners College Record, may be ordered from the Bureau\nof Publications, Columbia University Teachers Col¬\nlege, 525 W. 120th Street, New York 27, for 50 cents\nper copy.\n• Several articles from the “international issue” of\nthe NAEB Journal (July-August 1960) have been\ntranslated and inserted in the Japan Broadcasting\nCorporation’s semi-annual bulletin “Kaigai Joho,”\nwhich was issued last month.\n• The American Council on Education, 1785 Massa¬\nchusetts Avenue, N. W., Washington, D. C., has\npublished a comprehensive study of Educational Ac¬\ntivities of Business. The 180-page book sells for $4.\n• Coming out in the fall will be a book on the\nNixon-Kennedy debates, with contributions by lead¬\ning figures in the TV industry and communications\nfield. Called The Great Debates, the book is to be\npublished by Indiana University Press.\n• The Institute of International Education, 1 East\n67th Street, New York 21, has released two publica¬\ntions on summer study. For 25 cents, the summer\nscholar may obtain a copy of the LIE News Bulletin,\nwhich is devoted to a report of summer study oppor¬\ntunities. The other publication, “Summer Study\nAbroad,” lists summer programs and scholarship\npossibilities. The booklet is free.\nSummer Workshops\n• International Communications Workshop, June 5-\n16. On the campus of the University of Southern\nCalifornia, Los Angeles. Sponsored by the National\nCouncil of the Churches of Christ in the U. S. A. To\nstudy the major communications media and their\nvalue to the church. Write John Groller, Registrar/\nInternational Communications Workshop, 1521 Wil-\nshire Blvd., Los Angeles 17, California.\n• Workshop in the Creation and Utilization of In¬\nstructional Television Programs, July and August,\nsix weeks. Boston University. Facilities: two fully\nequipped TV studios, film chain and closed-circuit\noperation. For TV production personnel and class¬\nroom teachers. Write Dr. Murray R. Yaeger, Work¬\nshop Director, Boston University, 640 Commonwealth\nAvenue, Boston.\n• Workshop in Airborne Television Instruction,\nJune 19-30. Northwestern University. Designed to\nprovide training in use of televised instruction in the\nclassroom. Special programs designed for workshop\nuse will be broadcast from the MPATI aircraft. Write\nArea Coordinator, Airborne Television, School of\nSpeech, Northwestern University, Evanston, Illinois.\n• Television in Education, July 10-28. University of\nCalifornia at Los Angeles. Will include classroom\nutilization, lesson planning, administration of ETV\nin the school, overhead TV, self-directed TV, remote-\ncontrolled cameras. Write Education Extension, Uni¬\nversity of California, Los Angeles 24.\nBack Issues of Journal Available\nThere have been requests recently for back issues of\nthe NAEB Journal. Issues since the NAEB began\npublishing the Journal in October, 1956, are available\nexcept for the following: November, 1958; December,\n1957; January, 1958; October, 1959; November, 1959;\nJanuary-February, 1960; March-April, 1960. The\nprice is $1 per copy.\nIn addition, most back issues of the AERT\nJournal (as the publication was known before it was\ntaken over by the NAEB) are available at $1 each.\nIssues no longer in print are available on microfilm\nstarting with Vol. IX.\nFAE Officials Honored\nOn March 14 in Milwaukee, the NAEB co-sponsored\nwith the NETRC a banquet to honor FAE officials\nfor their work on behalf of educational broadcasting.\nPlaques were presented by the NAEB to C. Scott\nFletcher, G. H. Griffiths, and Ann Spinney.\nMay To Be National Radio Month\nTheme of this year’s NAB-sponsored National Radio\nMonth is “Radio—The Best Sound Around.” Edu¬\ncational stations may find this an ideal opportunity\nto call attention to educational radio while national\nemphasis is being placed on all radio. The NAB is\ndistributing campaign aids to radio stations—and lists\nof suggestions to civic groups to urge their coopera¬\ntion.\nBooks Beat TV\nA specialist in instructional materials declared at the\nUniversity of Michigan recently that books are the\nmost efficient teaching aids and TV the least efficient.\nLouis Forsdale, of the Horace Mann-Lincoln Insti¬\ntute of School Experimentation at Columbia Uni¬\nversity’s Teachers College, said this is because the\neffectiveness depends on the degree of control which\nAPRIL 1961"
}