{
  "id": "d1280-3",
  "text": "the individual learner has over the educational tool.\nWith TV, he said, the individual exercises no control\nover what he sees and when and he can’t repeat the\nexperience as he can with books.\nNews of Members\nGENERAL\n^ Televising on a regular basis over a new CCTV\nsystem began at the University of Akron this se¬\nmester. Thirty-five rooms have been prepared for\nTV reception, and three lessons can be presented\nsimultaneously over the system. Seventeen of the\nrooms have been equipped with talk-back circuits.\n► A story in the Chicago Daily News reports that a\nchildren’s religious program broadcast at 8:30 a.m.\nSundays has received as many as 1,500 letters in\none week. The program, “The Magic Door,” is pro¬\nduced by commercial WBBM-TV and the Chicago\nBoard of Rabbis.\n^ KUT-FM, student-operated station at the Uni¬\nversity of Texas, is now on the air seven days a\nweek, from 3 to 11 p.m. Sunday broadcasting was\nadded in February.\n^ “Interesting Fact” reported in the schedule of the\nCorning (N. Y.) ETV project: “The cost of the\nevening programs for the entire year is approximately\nthat of one two-minute network commercial.”\n^ The Mohawk-Hudson Council on ETV (New\nYork) reports that it should have a station on the\nair within a few months. This is earlier than thought\npreviously, due to an offer of a microwave unit by\nthe Capitol Cities Broadcasting Corporation.\n► Two courses are being offered this semester over\nthe Texas CCTV microwave network which links\nthree campuses—the University of Texas, Huston-\nTillotson College, and St. Edward’s University. By\nfall, the network will expand to include eight other\ncolleges and universities.\n^ WTTW, Chicago, has received a $2,000 contribu¬\ntion from the Chicago Federation of Labor and its\n“Voice of La,bor” station, WCFL.\n^ At the University of Aabama, a cooperative ar¬\nrangement between the TV station and the art de¬\npartment has solved the problem of station identi¬\nfication and program promotion visuals. Commercial\nart students prepare the visuals as a class project.\nPERSONNEL\n^ Larry Frymire, manager, WKAR, has been named\npresident-elect of the Michigan State University Men’s\nClub (Faculty).\n^ Edmund Williams, formerly in the TV division\nat Ohio State University, has joined the staff of\nOhio University, Athens, Ohio, as supervisory tele¬\nvision engineer.\n^ Robert D. Squier, formerly producer-director in\ntelevision for Walter Reed Army Medical Center, is\nthe new TV program director for the University of\nTexas. Fie succeeds Harvey R. Herbst, who is on\nleave of absence to serve as assistant manager of\nChannel 9, the new ETV station which will begin\nserving the Austin-San Antonio area next year.\n► C. F. Schropp, director of audio-visual education\nfor the Des Moines Public Schools, writes that his\nwife died March 2 due to a coronary occlusion. She\nhad accompanied him for many years to NAEB\nmeetings and was known by many members.\nBOX SCORE\nTotal\nAM\nstations\n3529\n(includes\n39\nnoncommercial stations)\nTotal\nFM\nstations\n965\n(includes\n192\nnoncommercial stations)\nTotal\nTV\nstations\n583\n(includes\n55\nnoncommercial stations)\nCorrections on Committee List, 1961\nPlease make the following corrections on the com¬\nmittee list distributed with the March Newsletter.\nAwards and Citations\nShould be M. S. Novik instead of Maurice\nNovick.\nConstitution\nWalter Emery’s address should be as follows:\nDepartment of TV and Radio, College of Communi¬\ncation Arts, Michigan State University, East Lansing,\nMichigan.\nDevelopment\nJohn Larsen’s location is Ogden, Utah.\nRadio Network School Committee\nDelete John von Szeliski.\nTV Planning Committee\nShould be Colby Lewis instead of Lewis Colby.\nU tilization\nArlene McKellar is from the Wisconsin School\nof the Air. Dorothy Klock is from Station WNYE.\nPLACEMENT SUPPLEMENT\nApril I — To receive M. S. in radio-TV production from the\nUniversity of Wisconsin in August. Desires position in\nradio or TV production, or production combined with\nteaching in both fields. Experience: 12 years technical\nelectronics, I year TV production teaching and TV\ncamera director. Married. Prefers west or west-central\nU. S.\nApril 2 — TV engineer. Prefers transmitter or studio position,\nwith opportunity to complete college education. Experi¬\nence: 4 years telecasting: limited AM experience. Mar¬\nried.\nApril 3 — B. S. in journalism. Would like position combining\nteaching and management. Experience: I I years com¬\nmercial broadcasting, with 6 years in management. Mar¬\nried. Southwest preferred. $9,000.\nApril 4 — M. A. seeks position in broadcast or closed-circuit\nETV. Certified secondary teacher. Experience: 4 years\nradio-TV teaching, 3 years ETV producer-director, 2\nyears CCTV, 8 years radio. Married. Prefers West Coast\nor Northwest. $8,000.\nApril 5 — Highly qualified engineer with unusual and extensive\nbackground wants position as chief engineer. Has de¬\nsigned important commercial TV stations in large cities\nand also ETV closed-circuit installations. ETV experience\nincluded design to installation, operation, and mainte¬\nnance, and training student aides for technical installa¬\ntion work, development, and operation.\nApril 6 — Man experienced in writing, announcing, directing,\nand production. Will consider position in any of these.\nB. A. in radio-TV from UCLA. Prefers East Coast or\nWest Coast or Middle Atlantic areas.\n4\nNEWSLETTER"
}