{
  "id": "d1117-1",
  "text": "Students Participating\nin Mock TV Rehearsal\nmock-up rehearsal equipment (see EducaTiVe Newsletter No. 46) it\nis possible to train a nucleus of faculty and students proficient in\nworking with the medium of television.\nFrom this point, contact should be made with the local television sta¬\ntions. Many of the broadcasters, particularly those in TV areas that\nare just building up, will gladly make air time available for educa¬\ntional purposes. Here is a fine opportunity to do an excellent public\nrelations job with the community at large. Programs organized to give\nthe taxpayers a more intimate look at the activities of the school\nmake for better understanding and support. This does not mean\nputting the classroom before the TV camera -- it is much more than\nthat. Showmanship, and a sensitivity to community interests, are\nessential for viewer interest. In addition, the youthful performers\nwill have had profitable experiences.\nThere is a trend now evident to include television in the budget con¬\nsiderations accorded other audio-visual materials of instruction.\nHowever, this move is not yet strong enough to insure an adequate\nsupply of receivers for each school. Up to this time, it has been\nfound necessary for most schools to work out their own methods of\nArranging for Equipment obtaining the desired equipment. The Parent-Teacher Associations\nhave been predominantly successful in this area. A well-planned\nplea to this group maybe the answer. Some schools have held sales,\nbenefit performances, or similar fund-raisers. In isolated cases,\nsome benefactors have underwritten the full cost of the sets. While\nthis generally represents the picture at present, many new schools\nunder construction have been planned to include provision for tele¬\nvision as an accepted and necessary facility.\nReports are already documented concerning institutions with TV in\nevery room. Some Universities, Laboratory Schools, and Military\nTraining establishments are already wired with coaxial cable net-"
}