{
  "id": "d1897-2",
  "text": "nAEQ NEWS LETTER\nPage 3\nJuly i, 1942\nSuggestion (cngx'p)\n7o Syphilis in the Expectant Mother\n8c Congenital Syphilis\n9. Public health Education and Venereal Disease Control\n0, Gonorrhea and the Public Health\no ^ENERBAL Disease Control as Related to National Defense\n*2. Summary of Facts Important to Venereal Disease Control\nElmer will be glad to have you run the complete series, or parts of\nTHE SERIES, ALTHOUGH CERTAINLY THE FIRST AND LAST ONES SHOULD BE USEOo\nHOSE WISHING TO USE THE SERIES OF TRANSCRIPTIONS, LET ME KNOW AND ®E8LL\nARRANGE A SCHEDULEo\nMEB MEET SET FOR NOVEMBER I I\nDon T BE MISLEAD BY THE HEADING. THE NATIONAL CONVENTION IS SCHEDULED\nfor Madison, September 10 and II. However, George Jennings, Acting\nDirector of the School Broadcast Conference has tentatively scheduled\nAN NAE8 SESSION FOR 4 O'CLOCK, WEDNESDAY AFTERNOON, NOVEMBER II. GEORGE\nSAYS, BECAUSE OF LACK OF TRAVEL FACILITIES THIS FALL, WE ARE STREAM¬\nLINING our Conference to two days and planning large general sessions\nWITH A NUMBER OF CONCURRENT MEETINGS RATHER THAN AS HERETOFORE WITH\nA LARGE NUMBER <JF SHORT SESSIONS o . . . HELLO TO EVERYONE.1*\nKENTUCKY SUMMER PROGRAM\nComplying with the policy of Dr0 Herman ^ee Donovan, president of the\nUniversity of Kentucky, to maintain an all out policy of war aid, the\nINSTITUTIONS S RADIO DEPARTMENT IS PRODUCING THREE WEEKLY SERIES OF\nPROGRAMS THIS SUMMER OVER THE MM NETWORK OF THE MUTUAL BROADCASTING\nSystem, dealing with various phases of American life. The programs\nARE NOT DESIGNED TO BE MORALE BUILDING1' IN THE MORE VOCIFEROUS SENSE\nOF THE WORD, BUT ARE INTENDED TO CALL THE LISTENER^ ATTENTION TO\nAmericana, of which they have reason to be proud, says Sulzer.\nThe programs, are titled, respectively, \"Southern Appalachian Folklore;\"\n\"What Makes American Music;\" and\"L|Ncoln, the Youth.\"\nIn addition ot the Mutual program, the University of Kentucky will pre¬\nsent eight programs per week over WHAS, Louisville, and three over the\nsouthern network of Mutual, during the summer.\nWNYC EXPANDS \"MUSIC AT WORK\" SERIES\n\"Music at Work\", WNYC's hour program of music dssigned ## for worker\nin defense plants throughout the city, was expanded on June 26th, when\nit began broadcasts of \"live\" concerts by the WPA War Services Band No. 2."
}