{
  "id": "d1901-0",
  "text": "N-A-E-B NEWS - LETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nEdited by Richard B. Hull, President\nStation WOI, Iowa State College, Ames, Iowa\nMORE NEr N-A-E-B STATIONS JOHNSON BILL UPSETS CLEAR CHANNELS\nMAYFLOVER HEARINGS POSTPONED SENATE HEARINGS IN PROSPECT\nMEMBERS TESTIFY N-A-E-B AT OHIO INSTITUTE\nMARCH 20. 1948\nCLEAR CHANNEL CASE GOES TO SENATE\nThe fight over clear channels entered another phase with the surprise intervention\nof the Senate Interstate Commerce Committee with the presentation of the Johnson\nbill\"(S.223l) which called for clear channel breakdown and limitation of U.S. radio\npower to 50.000 watts._The FCC, instructed by the commerce committee to hold up\nthe clear channel decision (and yet, needing it to meet the May 1 deadline for pro¬\nposed changes in the North American Broadcast agreement) was reported in some\nquarters ready to seek postponement of the NARBA conference now scheduled for\nAugust in Canada.\nActing on instruction of the Interstate Commerce Committee, Senator Charles F. Tobey,\n(Republican, N.Y.) acting chairman of the committee, wrote the FCC to withhold its\nclear channel decision pending congressional hearings on Senator Johnson's measure.\nSenator Edwin C. Johnson (Democrat, Colorado) introduced a measure which proposed to\nlimit the power of domestic broadcast stations in the band from 550 to 1600 kc. to\n509000 watts and further proposes that such 50,000 watt stations shall not be pro-\ntected to a contour less than 500 microvolts per meter half of the time, based on\nmeasurements made during the second hour after sunset for all seasons for the year,\nEDUCATIONAL RADIO HIGHLIGHTS\nIN THIS ISSUE’\nJohnson Bill Memorandum-2\nWisconsin Files Fourth FM Bid—--2\nMarch Radio Clip Sheet—-3\nSecond NORC Report on Radio-4\nComposer Criticizes Radio-6\nFMA Fears Duplication—-  7\nThe Mayflower Case-  8\nOklahoma U. Conference Report-10\nFCC Educational\nRadio Educators—Chicago, Apr, 2——11\nN-A-E-B. Salutes New Station-12\nDurr Champions Free Speech-14\nV.NYC Music Festival Stand-out-15\nFrench Government Radio Plans-15\nNorth Carolina Views Ed. Network—-16\nN-A-E-B Business Page----17\nN-A-E-B News By Districts-19\nActions—25\nVice-President Treasurer Executive Secretary Executive Committee\nJohn Dunn W. I. Griffith M. S. Novik Seymour Siegal, WNYC, New York Graydon Ausmus, WUOA-FM, Alabama\nWNAD, University of Oklahoma WOI 30 Rockefeller Plaza Carl Menzer, WSUI, Iowa Ralph Steetle, WLSO-FM, Louisiana\nNorman, Oklahoma Ames, Iowa New York, N. Y. Frank E. Schooley, WILL, Illinois William Sener, KUSC-FM, California"
}