{
  "id": "d1901-15",
  "text": "’16-\nFREQUENCY MODULATION ASSOCIATION MARKS THE 1948 SCOIEBOARD\nEverett Dillard, president and T'illiam Bailey, secretary of FMA report the follow¬\ning facts to show how FM is growing:\n1. FM stations increased from 136 to 412 during past year*\n2. FM service already available to 60,000,000 listeners.\n3. FM networks \"in the making” number nearly 12.\n4. FM facilities investment now totals $100,000,000.\n5. FM equipped receivers last year number 1,175,000.\n6. FM stationsto be on the air by January 1 will number 1000.\nMr. Bailey made these predictions:\n1. One-thousand FM stations will be on the air by next January 1.\n2. FM will reach 117,000,000 listeners or 8J+% of the U.S. population.\n3. FM business in 1943 will run $500,000,000\nSOUTH DAKOTA COMMERCIAL BROADCASTERS MEET AT N-A-E-B STATION KUSD\nLed in discussion by John F. Meagher, (KYSM, Mankato, Minnesota) NAB District 11\ndirector, South Dakota Broadcasters have formed the South Dakota Broadcaster’s\nAssociation at a meeting called by N-A-E-B station KUSD, University of South\nDakota. Secretary of the new organization is Irving Merrill, KUSD director.\nResolutions passed included one urging the University of South Dakota physics\ndepartment to initiate courses leading to the degree of communications electronics\nengineer. Rates for political broadcasts were determined following a discussion\nof NAB standard of practice.\nUNITED NATIONS USING CANADIAN SHORTTAVE\nThe United Nations radio division is making experimental use of the big CBC trans¬\nmitter at Sackville, New Brunswick, to beam its broadcasts to Australia and New\nZealand. UN is trying the experiment because CBC’s strong signal has been reaching\ninto Central Europe, and Russia. (UN broadcasts to the Antipodes have, in the past,\nbeen carried to the U.S. Vrest Coast and relayed from Hawaii.)\nRURAL FM NETWORK TO GO ON AIR IN NEW YORK IN MAY\nThe Rural Radio Network, composed of ten different cooperative farm organizations\nincluding the New York State Grange and the New York State Farm Bureau Federation,\nwill go on the air early in May using radio relay links instead of the usual tele¬\nphone lines. Eith headquarters in Ithaca, N.Y., three of the six FM stations in\nthe net will be operating by that time. There will be stations in Newfield,\nHermitage, Bristol Center, DeRuyter, Cherry Valley, and Turin, New York.\nNORTH CAROLINA VIERS EDUCATIONAL FM NETWORK\nGovernor Cherry of North Carolina has appointed a State Education FM Radio committee\nto explore the advisability of the state entering the educational FM field and join¬\ning the expanding list of universities, colleges, and city school systems who find\nFM radio a unique and valuable tool as an educational and public service device.\nNamed as chairman of the committee is Dr. Clyde Erwin, State Superintendent of\nPublic Instruction, Meeting, which took place March 2,was for the purpose of\nlooking over performances of FM stations in other areas of the country and studying\nthe prospects and opportunities for educational FM radio as they exist in North\nCarolinaf"
}