{
  "id": "d1901-22",
  "text": "NEWS FROM REGION V (Cont.)\n-23-\nMlssouri\nLaboratory equipment for use in transmitting a daily facsimile newspaper at the\nUniversity of Missouri school of journalism is being installed through arrangements\nwith the St. Louis Star Time Publishing Company, operators of KFRU, Columbia.\nSchool of Journalism now writes all newscasts as journalism project for KFRU.\n*** ***\nNEFS FROM REGION VI - Regional Director - William H, Sener - KUSC, Los .Angel es.,\nCalifornia \"(Montana, Tashington, California, Idaho, Oregon, Nevada, Arizona, Utah\nand Territory of Hawaii)\nOregon\nN-A-E-B station, KOAC, Oregon State College, features a new program series devoted\nto women over the state entitled, ’’Clubwoman’s Half Hour”, Program specializes on\ntopical material, serious and light. Serious side will feature problem areas such\nas \"Color Blind”, Halsey’s book dealing with race problems, pegged on basic book\nmaterial,\nN-A-E-B station, KOAC, Oregon State College, has 5000 watts and fan mail.indicates\na greatly increased range for the state-owned radio station KOAC since night-time\npower was increased to 5000 watts, according to James M« Morris, program manager for\nthe station. The increased power went into effect December 7, 1947, when permission\nwas granted by the Federal Communications Commission following completion of engineer¬\ning for the new power.by Grant. Feikert, chief engineer, and his staff. Edgar 1 .\nSmith, president of the state board of higher education pushed the button changing\nthe station to its new high power on the occasion of the Station’s Silver Jubilee\nDecember 7.\nWashington\nLouis Clements, engineer, has left FOB, New York City, to assume position on\nFebruary 1st of Chief Engineer at N-A-E-B station KFSC, Pullman, Washington,\nAppointment of a new chief engineer was one of five new assignments at KFSC,\nClements will head the technical division of the station, bringing to it 19 years\nof experience* Prior to his work as studio operations engineer with FOR, Clements\nwas a technician in recent CBS color television experiments. During the war he\nserved in the Army as tower construction and ground system chief for the American\nExpeditionary stations in the Mediterraneans earlier, transmitter engineer with\nWCCO, Minneapolis,.\nBob Bingham, station Manager of FGAI, Elizabeth City, N.C, has joined KFSC to fill\nnew position of Events Director, Bingham will supervise the station’s expansion\ninto sports, news, and special events coverage, in which he has specialized for\n23 years. A well-known sports and news announcer with rINZ Hollywood, Fla., and\nWMCA, New York City, Bingham held the position of sales promotion director of FBT,\nCharlotte, N.C. before putting FGAI on the air last fall.\nRobert Concie, former KF.rSC staff announcer and more recently on the announcing\nstaff of KFIO, Spokane rejoins KFSC, Pullman, Fashington, as Chief Announcer.on\nFebruary 1st, A production man as well as a fine studio announcer, Concie will\ndirect the announcing staff and supervise a new tie-in bet?/een announcing and\nstudio production.\nLeonard Hegnauer, KWSC Farm Editor moves to KNEW, Spokane, same duties. New farm\neditor of KWSC, Pullman, Fashington, effective February 1st is Paul Spechko."
}