{
  "id": "d1901-23",
  "text": "NEWS FROM REGION VI (Cont.)\n-24-\nWashington\nIra Myers, KWSC, Pullman, Washington, staff engineer and acting chief engineer\nuntil recently has been given new permanent position at the station of Assistant\nChief Engineer, effective February 1st*\nCalifornia\nThe WESTERN RADIO CONFERENCE will be held at the Marines Memorial Building in\nSan Francisco March 20 and 21, On the agenda are topics of general interest in¬\ncluding: ’’World Affairs Are Your Affairs”; ’’Toward a More Responsible Use of\nRadio”; ’’The Local Station and Community Education”; ”Radio and the School”; and\n”0f Mikes and Men’s Minds,”\nWashington\nN-A-E-B station KWSC, Washington State College (Pullman) has embarked on an office\nbuilding program doubling the station’s present space, due for occupancy April lf\nOccupants will include station manager Blake; engineer Myers; secretary Nuttal;\nchief announcer, Concie; stenographers and continuity writers. Present office\nspace will be converted into an enlarged record library, audition room, and offices\nfor traffic and music sections,\n*** ***\nWSA REGISTERS GROWTH\nIn its seventeeth year of broadcasting the Wisconsin School of the Air has recorded\nits greatest enrollment, A total of 427,050 listeners are registered as hearing\nthe 10 programs offered each week, according to H. B, McCarty, director of the pro¬\nject. This is a substantial increase over the 361,257 reported in 1946-47. The\nfigures are based on actual reports from teachers using the programs in their\nschoolrooms, and do not include regular out-of-school audience. Largest class is\n’’Journeys in Music Land” with Professor Gordon, in which 66,767 are registered.\nSome singing class!\nSCHOOL BROADCASTS IN COLORADO\nThe age-old problem of ’’What Should I Study and Why,” will be viewed objectively\non YOUR CAREER a new University of Colorado (N-A-E-B Member in Boulder) radio\nseries aimed at answering ’’career” questions of high school students and graduates.\nThe programs which started the firgt week of March over eight Colorado stations\nwill feature educators from the University pnd specialists in each of the thirteen\nfields of knowledge to be presented.\nAccording to Ellsworth Stepp, head of radio at the University of Colorado, ’’One\nof the greatest problems facing the high school graduate has always been a lack\nof exact knov/ledge of the studies he might pursue in college, and the opportunities\noffered by each.»’\nRecognizing the immediate need for such broadcasts, Mrs* Nettie Freed, Superintendent\nof Public Instruction for Colorado, stated she will urge school superintendents\nthroughout the state to take full advantage of the program."
}