{
  "id": "d1901-24",
  "text": "-25-\nFEDERAL COMMUNICATIONS COMMISSION\nFebruary 2,1948 (Educational) March 15, 194B\nNEWS—APPLICATIONS—ACTIONS\nText of S-2231 (Johnson Bill)\nTo limit power of radio broadcast stations — Ee it enacted by the Senate and House\nof Representatives of the United States of America in Congress assembled, that\nsubsection (c) of section 303 of the Communications Act of 1934, as amended, is\namended by inserting before the semicolon at the end thereof a colon and the\nfollowing: \"Provided, that no broadcast station operating in the amplitude modu¬\nlation broadcast band on frequencies ranging from five hundred and fifty kilocycles\nto sixteen hundred kilocycles shall be granted a license to operate with power in\nexcess of fifty thousand watts, and in the granting of instruments of authoriza¬\ntion for such stations no station’s skywave signal shall be protected for a signal\nintensity of less than five hundred microvolts per meter 50 per centum of the time\nbased on measurements made during the second hour after sunset for all seasons of\nthe year.\"\n•7<r-7<\nAMPLITUDE MODULATION APPLICATIONS\n1330 KC - New Station\nNEW-The Reorganized Church of Jesus Christ of Latter Day Saints. Independence. Mo,-\nConstruction permit for a new standard broadcast station to be operated on 1380 kc.,\npovi?er of 5 KW, and daytime hours of operation (Graceland College)\n930 KC - Measurement Authority\nNLBL - State of Wisconsin. Department of Agriculture, Stevens Point, Wis.-.Authority\nto determine operating power by direct measurement of antenna power,\n1450 KC - Designated for Hearing\nKBPS - Benson Polytechnic School, Portland. Ore.-Hugh Francis McKee, Portland,: Ore.-\nDesignated for hearing application of KB^S(BML-1280) for modification of license\nto change the specified hours of operation of KBPS, in consolidated proceeding\nwith application of McKee for new station to operate on 1450 kc,, 250 watts, sharing\ntime with KBPS (BP-3225)j further ordered that hearing now scheduled for Febru¬\nary 23, 1948, on application of McKee be postponed and the consolidated hearing\nbe scheduled for May 26 and May 27, 1948, at Portland, Ore,\nAPPLICATIONS (FREQUENCY MODULATION) COLLEGE. UNIVERSITY, AND INSTITUTIONAL•\nApplications Accepted For Filing\nKMHB - Mary Hardin-Baylor College, Belton - Modification of construction permit\n(B3-PK-1033, as modified) which authorized a new FM broadcast station to change\ntype of transmitter, ERP from. 2,9 K57 to 12.0 KVI, antenna height above average\nterrain to 317 feet and make changes in antenna system.\nApplication Accented For Filing\nVDTR - The Board of Education of the City of Detroit. Detroit, Mich. - License\nto cover (B2-PED-34, as modified) which authorized a new non-commercial educational\nFM broadcast station."
}