{
  "id": "d1901-4",
  "text": "-5-\nAs to radio's cultural value, only 20 percent of those questioned wished there were\nmore serious programs on the air. Fifty-two percent said they liked both serious\nand entertainment programs—and are satisfied with their present radio diet. Twenty-\nsix percent said they seldom listen to serious or educational programs.\nDr. Lazarsfeld warned broadcasters against'.accepting these figures too complacently,\nstating that \"the opinion survey is only one part of the picture.\" He noted the\nwidest area of approval is in the lower educational and income groups. He pointed\nout \"that higher—or so-called \"expert\" groups—were not nearly so laudatory.\"\nHONORARY DEGIJSES FPL COMMUNICATIONS REPRESENTATIVES AND WORKERS\nBoston University, in its fifth annual Founder's Day Institute Exercises, conferred\nhonorary degrees on ten men, prominent in radio, motion pictures, news, public\nrelations, and industry. An honorary doctor of law degree was awarded to Justin\nMil3.er, president of the National Association of Broadcasters; a doctor of commercial\nscience degree went to David Sarnoff, president of RCA, Honorary doctorates also\nwent to Spryos P. Skoursas, President Twentieth Century Fox Films; Joseph Arthur\nRank, British industrialist and motion picture producer; Grove Hiram Pattern, Toledo\n(Ohio) Blade editor; Glen Griswold, publisher, Public Relations News: George Horace\nGallup, director of the \"Gallup Poll”; and Earl Newsome, president, Nev/some Company;\nRaymond Rubican, director of Encyclopedia Brittanica Films and Paul Hoffman, Stude-\nbaker Company president, were also awarded doctorate degrees.\nFRENCH-BROADCASTING COMPANY TWITES COMMERCIAL BROADCASTERS TO FRANCE\nThe French government invited six prominent commercial broadcasters to visit France\nfor the announced purpose of furthering the interchange of public service and edu¬\ncational radio programs between France and the United States. No educational\nagencies or educational radio groups ?rere included in the invitation.\nScheduled to leave March 20 and to return March 29 were Robert Swezey, general u\"\nmanager MBS; William Brooks, NBC public events director; William Fineshriber, Jr.,\nCBS national program director; John S. Mayes, manager WINX, Washington) a repre¬\nsentative for MarX Woods, ABC president; and A, D. Willard, Jr., vice-president\nNational Association of Broadcasters.\nUNIVERSITY OF MINNESOTA HOLDS \"NEWS SHORT COURSE\"\nA two-day session which covered problems ranging from community programming policy\ndifferentiations to radio's access to the news was held March 4 and 5 on the Minne¬\nsota University Campus, Speakers highlighting the session included Larry LeSueur,\nUnited Nations correspondent for CBS; Dr, Kenneth Baker of the National Association\nof Broadcasters; Dr, Wilbur Schramm of the University of Illinois; and Soren\nMunkhoff, WOW (Omaha, Neb.) news director. The meeting closed with the annual\nbusiness session of the Northwest Radio News Editors Association, headed by Orrin\nMelton, KS00 (Sioux Falls, S.Dak.)\nIARNE HOLDS SEMI-ANNUAL MEETING\nThe Iowa Association of Radio News Editors meet March 27 in Des Moines. Professor\nMitchell Charnley, University of Minnesota Journalism Department, will head a news\nclinic. H. R. Gross, KXEL, Waterloo, will report on the IARNE road and weather\nservices while Richard B, Hull, W0I, Iowa State College, Ames, will moderate a panel\non \"editorializing in the news.'\""
}