{
  "id": "d1086-3",
  "text": "- ] 1 -\n9- In attempting to determine what specific request it should makefor\ntelevision channels, the NAEB has quickly canvassed its membership to discover\ntheir immediate interest in obtaining television facilities * The attached\nengineering statement in support of these Comments relies in part upon the\nresponses elicited in this canvass* An expression of affirmative interest\nin televisicn broadcasting was received, even on this short notice, from 32\nNAEB members.\n10. As the attached engineering statement shews, those Comments are\nsubmitted in connection with the utilisation of television frequencies in the\nband li?0 to 390 megacycles* In accordance with that statement, the MED considers\nthat at least 10 channels in the UHF band should be made available exclusively for\nthe use of educational broadcasters. Allocation of UHF rather than VHF channels\nis requested since Commission assignments in the VHF band already preclude the\nreservation cf even a single VHF channel for non-commercial educational use.\n11. In the Commission’s notice of Proposed Rule Making in the above-entitled\nproceeding. Appendix A sets forth, in paragraph III-A-1, that the first priority cf\nallocation is \"to provide at least one television serv±c®^tc all parts of the\nUnited States.\" In view cf the fact that the use cf television for non-commercial\neducational television broadcastings is, for the reasons set forth above, at least as\nimportant as commercial television broadcasting, the NAEB urges that sufficient channels\nbe set aside to permit at least one non-commercial educational television service to\nall parts of the United States.\n12. In its Notice of Proposed Rule ''akiag (paragraph 13 c and d) the Commission\nhas indicated its concern with the necessity of reaching a decision on the advis¬\nability of reserving a portion of the UHF band exclusively for non-commercial educa¬\ntional broadcasting. Pursuant to the invitation expressed in this public notice,\nthe NAEB herewith suggests the following;\nA- That there be reserved in the UHF band 10 frequencies exclu¬\nsively for the use of non-commercial educatianaL broadcasters*\nB, That those channels be located in that portion of the UHF band\nwhich the Commission contemplates allocating in its instant\nNotice of Proposed Rule Making if such allocation is engineer¬\ning - xvise feasible without disturbing the allocations proposed\nfor commercial broadcasting*\nC* In the event that the allocation requested in 1 above is not\npossible, that the Commission reserve 10 channels immediately\nadjacent to Channel 55 for non-commercial educational television.\nIn support of its request there is attached hereto and made a part hereof on\nengineering statement by Jansky and Bailey, consulting radio engineers for the NAEB,\n13* Petitioner respectfully requests an opportunity to present witnesses in\nsupport of its proposal, and to participate in the examination and cross-examination\nof all persons who participate in W s proceeding and for the right to file a brief and\notherwise present its views in oral argument.\nRespectfully submit ted\nvarcus Cohn\nCohn and T*arks\nlii?0 new York Ave-, ii.V.\n•ashington, D. C*\nIts Attorneys\nNATIONAL ASSOCIATION OF EDUCATION\nBROADCASTERS\nBy\nMarcus\" Cohn"
}