{
  "id": "d1689-0",
  "text": "V\nREGISTRATION\nSIXTEENTH INSTITUTE FOR EDUCATION BY RADIO\nOhio State University - Columbus, Ohio\nMay 3 - 6., 19^6\nNAME\nORGANIZATION\nMAILING ADDRESS\nAARNES, HALE- Chairman, Radio Department, Stephens College - Columbia, Missouri\nABBOT, WALDO - Director of Broadcasting, U. of Mich., - 4004 Angel1 Hall, Ann Arbor\nACKERMAN, WILLIAM C. - Director, Reference Dept., CBS - 485 Madison Ave., N. Y.\nADAMS, BRYON - South High School, Columbus, Ohio\nADA'iS, CAROL N. - Women*s Program Director, WEBC - 55° Market St. SW, Canton 2, 0.\nADA14S, W. E. - Manager, Merchants Business Bureau - 207 B. Wayne, Ft, Wayne^ Ind.\nADAMS, WILLIAM J. - Program Director, WHEC - 40 Franklin St, Rochester, N. /•\nADKINS, GALE R. - Asst. Director, Radio House, Texas University «- Austin, Texas\nAHN, GEORGE B. JR. - Director Public Relations, Home Missions Council - 297-4 Ave NY\nALAMPI, PHILLIP -> Farm Director, WJS - 3^ Rockefeller Plaza, New York\nALBINGER, ALBERT R. - Production Director, WOOL - 33 W°* High St., Columbus, Ohio\nALLEN HAROLD P. - Announcer, WENS - 33 N. High St., Columous, Ohio\nALLEN, JEANNE - South High School, Columbus, Ohio\nALLEN, NIMROD B. - Executive Secy,, Cols. Urban League r 107 N. Monroe Ave, eols, 0-\nALLEN, SHANNON - Shannon Allen Associates T 1026 17th St. NW, Washington D. C.\nALLEN, MRS. SHANNON - 1727 Mai's Avenue, Washington, D. C.\nANDERSON, EVELYN - Radio Instructor, Capitol University - 818 Buclaire, Bexley, Ohio\nANDRUS, JO-ANN - South High School, Columbus, Ohio\nAPPLEGATE, V. G. - Cadiz, Ohio\nARTHUR, JACK - South High School, Columbus, Ohio\nAUSMUS, GRAYDON - Director, Radio Broadcasting Services,\nUniv. Alabama,\nUniversity,\nBox 2002\nAlabama\nBABBERT, EUGENE -\nBADENOCH, NENA W.\nSouth High School, Columbus, Ohio\n- Radio Relations Director, Nat»l. Soc. for Crippled Children\n' and\"Adults -HT“§. La Salle Street, Chicago, Ill.\nBACHMAN, JOHN W. - Director of Radio, KWBU, Baylor Univ. - Waco, Texas\nBAEDECKER, HAROLD J. - The Athens Messenger - Athens, Ohio\nBAILEY, MILDRED - Director Women’s Activities, WCOP - Boston, Mass.\nBAKER, DONALD J. - Student - 1557 Republic, Cols, Ohio\nBAKER, FRED - Kent State University Radio Workshop - Kent, Ohio .\nBAKER. JOHN C. - Chief, Radio Service, U. S. Dept. Apple*, Washingtonc.p, *^ *\nBAKER, KENNETH H. - Director of Research, NAB, - 17b& ”Nn St NW, Washington 0, D. C.\nBALCh! MARCELLA - Ohio State University >\nBALDWIN, ROGER W. - Director, Amer. Civil Liberties Union - 17° - 5th Ave, N*\nBALTIN, WILL - Exec. Secy., Television Broadcasters Assoc. - 50° Fifth ave, N. Y.\nBANCROFT, FRANCES - 202 Arps Hall, Ohio State Univ., Cols. - 127 W. Court St,\nUrbana, Ohio _\nBANGER, IRENE C. - Education Dept., Q,uarrie Corp. - 35 3- Wacker Drive, Chicago\nBANISTER, CLAIRE - Asst. Extension Radio Editor, Extension Service, A. and A.\nCollege of Texas, College Station Texas _\nBARBER, MARY-I» - Director of Home Economics, Kellogg Co. - Battle Creek, Mich.\nBARKER, FRANK S. - Federal Publishing Company - 1996 luka Avenue, Cols, Ohio\nBARLOW, BILL - Publicity Director, WLW - Crosley Square, Cincinnati, 0.\nBARNETT, NAOMI - University of Cincinnati\nBARTELL, GUY R. - Collinwood Veterans Institute, Cleveland, 0.\nBARTELL, GERALD A. - Production Director, WHA - Madison, Wisconsin\nBARTLETT, KENNETH G. - Director, Radio Workshop, Syracuse Univ. - Syracuse, h. Y*\nBATTLES, ROY S. « Farm Program Director, WLW - Cincinnati, 0.\nBAUER, W. W. Director of Health Education, Amer. Med. Assnf - 535 N.Dearborn, Chic\nBAYLOR, DAVID M. - Program Director, WGAR Statler Hotel, Cleveland, 0."
}