{
  "id": "d1689-1",
  "text": "HAMS\nORGANIZATION\nMAILING ADDRESS\n152 W 42nd St., N.Y.\nBEACH, HUGH D. - Public Relations Director, “Newsweek11\nBEAEID, CAROLYN - South High School, Columbus, Ohio\nBEARDSLEY, T. ISOBEL - Asst, in Public Health Education, St. Dept. Health -\nlg Dove Street, Albany 6, N. Y.\nBEARUP, T. W. - Overseas Representative, Australian Broadcasting Commission *-\nAustralia House, London W. C. 2 England . .\nBECKER, ALFRED W. - Program Director, Spartanburg Broadcasting Co. - 291 E. Mai .\nSpartanburg, South Carolina\nBECK, PRANCES M. - Teacher of Radio, Collinwood High School, Cleveland - 1©7\nAlvason Road, East Cleveland 12, Ohio\nBECK, JOAN - South High School, Columbus, Ohio\nBECKER, HELEN S. - Program Chairman, Vice-President, Cleveland xvadio Council\n17427 Lampath Blvd, Shaker Heights 20, Ohio\nBEELER, ROBERT S. - Asst. Extension Editor, Univ. Ill*. Station WILL. Urbana,\nBEER, ROBERT M. - General Manager, Beer and Koehl Wate—PM - Ashland, Ohio\nBEISTLE, ALDARILLA S. - Script Writer, WGAR - Statler Hotel, Cleveland, - 2525\nEuclid Avenue, Cleveland, Ohio\nBELL MARY JEAN - South High School, Columbus, Ohio\nBELL, RICHARD H. - Director Religious Press and Radio, First Community Church\n1320 Cambridge Blvd., Columbus t\nBERGOFFEN, WILLIAM W. - In charge, Radio Activities, Div. of Information and edu¬\ncation, Ut S. Forest Service - South Ag. Bldg^ wash. D. C.\nBERKSON, SEYMOUR - General Manager, International News Service - 235 E '5 St, N.Y.\nBERLING2R, HARRY - Ohio State University . T\nBERTERMANN, EUGENE R. - Director of Radio, International Lutheran Hour - 355° S\nJefferson, St. Louis, 18, Mo.\nBERULU. ARMAND A. - Supt., CBC French Farm Broadcasts, CBC -1231 St. Cath St. Mont.\nSEVILLE, HUGH M.. - Director Research, NBC - 3^ Rockefeller Plaza, N, Y.\nBEVIS, HOWARD L. - President, Ohio State University - Columbus\nBEVIS, MRS. HOWARD L. - President's House, Ohio State University, Columbus\n3IALICK, ROSE L. - Writer, Benton and Bowles, Inc, - 444 Madison Ave, N, Y-\nBICKEL, Mrs. Clyde E. - Co-chm, Radio Comm, Gen. Federation Women's Clubs, Wash,DC -\n109 Farrand Park, Highland Park 3, Michigan\nBIEBRICH2R, ANNE - Extension Specialist, Agricultural and Home Economics Extension,\nOhio State University, Campbell Hall, Columbus\nBIGSLEISEN, GRACE A. - 2935 Norwood St., Columbus\nBIGELEISEN, JACOB - Research Associate, Ohio State University\nBILDERSEE, MAX U. - Supervisor, Audio Bduc,, St. Education Dept, Albany - 1\nhenge Lane, Albany, N. Y.\nBILSBOROUGH, MARY LOU - Chairman French Dept., Stephens College, Columbia, Mo,\nBIMSON RICHARD H. - Minister, Chairman Church Council, Sacramento, California\nCouncil of Churches - 5010 15th Avenue, Sacramento, Calif.\nBINGHAM, PAT - South High School, Columbus, Ohio\nBISHOP MILDRED - Leader, Camp Fire Girls, Cols. - 545 Linwooa Ave, Columbus, 0.\nBITTERMANN, HELEN R. - Sales Rep., WBNS - 33 N. High St, Columbus, Ohio\nBLACKWELL, DOROTHY - Chairman, Comm, on Radio Education, Div. Audio-Visual Muc.\nSt. Louis Public Schools, 4466 Olive St., St. Louis, 8, Mo.\nBLAIR DOROTHY E. - Dir. Public Relations, Marietta College - Marietta, Ohio\nBLAKE MRS, F. C, - Pres., Univ, Women's Club r? 579 High St, Worthington, Columbus\nBLAKEY, W. C. - Vice-Pres., Dirt. Educational Serv., Ajmer. Education Press, Inc.\n400 S. Front Street, Columbus\nBLAUHUT, DON - Ohio State University\nBLISS, MILTON E. - Farm Program Director, WRA, Univ. Wise., Madison, Wisconsin\nBLOK, NILS C. - Katz Agency T 500 Fifth Avenue, New York\nBLOOM, MRS, HERMAN A. - AAUW - 295 S. Dawson, Columbus, Ohio\nBOFFO, LOU - Kent State University, Kent, Ohio\n- 2 -"
}