{
  "id": "d1689-17",
  "text": "NAME\nOE.G-.rtIT IZ AT I ON\nmillNG ADDRESS\nNEHER, RICKARD - Program Director, WH3C - 550 Market Ave. S, Canton, Ohio _\nNELSON, MELVIN L. - Managing Editor, News Bureau, WHO - 9l4 Walnut St,^ Dos Moines\nNELSON, HARRY L. Mrs. r Civic Program Director, WCOY - 208 So. McDonougn St.,\nMontgomery, Alabama\nNELVILLS, LARRY - Special Broadcast Services, WLW - l40 W 9th St., Cincinnati, Ohio\nNEWCOMB, ALAN H. - Ohio Wesleyan University, Delaware, Ohio\nNEWMAN, WINIFRED H. - Asst. .Supt. Schools, Ravawha County^ Charleston, w. Va.\nNEWSOM, PHILIP S, - Radio News Manager, UP - 220 E. 42nd Street, New York\nNXARCHOS, HELEN - Ohio State University _\nNIDA, MRS. JACK - Pres. Elect, Cols. AAUW - 2737 Broad St., Columbus\nNIPP, PRANK L. - Chief Radio Dept., Chinese News Service, Radio City, New Yorn:\nNOVIK, M. S. - Radio Consultant - 3° Rockefeller Plaza, New York\nNISONGER, KERSCHEL W. - Director Bureau of Special and Adult Education, OSU, Cols.\nNYVALL, JANE C. - Instructor, Radio, Univ. of Alabama - Box 2002, Univ., Alabama\nOBRIST, EDWARD C. - Asst. Manager, WpEN - 1522 Walnut St., Philadelphia, Pa.\nO’CONNOR, SALLY A. - Michigan State College, East Lansing, Michigan\n01HOLLORSN, BILL - Continuity Chief, WOW - Rm 220, Insurance Blag., Omaha, Nebr.\nOLDS, H. ROBERT - Public Relations, Byer and Bowman Adv. Agency -203 E Broad, Cols.\nOLIVER, SEHORITA MARIA ROSA - Council for Inter-American Cooperation, Argentina\nORTH, MARY JANE - Ohio State University\nORR, WILBERT I. - Sales Director, WENS, 33 W. High St., Columbus\n0STHEI-4HR, REV, ANTHONY L. - Catholic Schools of Phila. (Radio Council) Jr. Town\n’ 1 Meetings of the Air - 3743 Spruce St., Philadelphia\nOTTMANN, MRS. W. P. - President Omaha Radio Council - 2425 Mary, Omaha, Nebr.\nOURY, MYRON E. - Northwestern University, Evanston, Illinois\nOWEN, DAVID - Asst. Prof,, University of Michigan, Ann Arbor, Michigan\nOWEN, F0BR3ST F. r Public Relations Director, WELL ~ Battle Creek, Michigan\nPAGE, HART Ohio Medical Journal t c .\nPALARIEL, LORAYNE G. - Supervisor Radio Education, Dept. Education - fib Court\nHouse, St, Paul, Minnesota\nPAPIER, JSRRE - South High School, Columbus\nPARK, BEN K. - Producer, WHA - Radio Rail, Madison, Wisconsin\nPAEIKER EVERETT C. - Director, Joint Radio Committee, Congregational Christian,\n.. “.. Methodist and Presbyterian USa churches - 227 4 Ave, New York\nPARKER, MRS. JAKES C. - Vice-Pres., Nat»l. Congress Parents and Teachers, Chicago\n1729 Union Blvd., SE, Grand Rapids, Michigan\nPARKINSON p. GEER - Program Director, WBNS - 33 N. High Street, Columbus\nPARKS, RALPH R. -r Extension Agricultural Engineer, Univ. of Ill, Urbana, Ill.\nPATTERSON, DOFiQTHY F. - Speech Teacher, Cooley High School, 3754 Pingree, Detroit\nPATTERSON, DR. EDNA F. - 2423 East Main Street, ColumDus\nPAUL, GREGORY H. - Ohio State University „ a ^\nPAULIN, BERTHA D. -t Girl Scout Public Relations, 1991 Waltham Road, Columbus\nPAULU,'BURTON - Manager KUOM, University of Minnesoata, Minneapolis, Minn.\nPAXTON, S. S. - Ohio State University\nPEERY, FRED A. - Promotion and Merchandising Manager, WOAI - DJ31 Navarro at.,\nSan Antonio, Texas.\nPENNISTER, MRS. C. R. - Child Program, WMRN - Marion, Ohio\nPEPPARD, S. N. - Acting Director, Bureau of Child Guidance, N. Y. Bd. of Education\n228 E 57th Street, New York\nPSSSOLANO, PRANK JOHN t St. Vincent College - 431 Freeport Road, New Kensington, Pa<\nPETTSGREW C. W. - Exec Secy, and Editor, Junior Town Meeting League, (Amer. Bduc.\n■press, Inc.) - 400 S. Front St., Columbus\nPFAUTCH. WAYNE - South High School, Columbus\n18 -"
}