{
  "id": "d1689-20",
  "text": "NAME\nORGANIZATION\nMAILING ADDRESS\nSAFFORD, DWIGHT - South High School, Columhus\nSAKS, LEWIS H. - Ohio State University\nSAGU2, SAMUEL R. - Owner, Manager, WSRS, Cleveland Heights, Ohio\nSAMPLE, FRED W. - Chicago Edition,' Broadcasting Magazine, 360 N. Mich., Chicago\nSAMUELSON, CLIFFORD S. - Advertising Manager, General Mills, Inc., Chamber of Com¬\nmerce, Minneapolis, Minn.\nSANDBERG, ROBERT A. - Asst, to the President, St. College of Washington, Pullman,\nSANDERS, KENNETH B. - Juvenile Court, 50 East Mound St., Columbus /Wash.\nSANDEK, ROBERT - Director of Public Service, ABC - 3° Rockefeller Plaza, New York\nSAVIN, CORAM. - Antioch College, Yellow Springs, Ohio\nSAYLER, ALLEN - International Education Dept., UAW.CIO - 28 W. Warren, Detroit\nSCHACHT, HENRY - Supervisor of Public Service, KPO - 420 Taylor, San Francisco\nSCHAFFER, LARRY - South High School, Columbus\nSCEARRER, JOSEPH F. - Ohio State University\nSCHIAPFACASSE, CHARLES JR. - Ohio State University\nSCEELLENGER, HAROLD K. - Director of Public Relations, Columbus (OSU)\nSCHENER, J. D. - Production Director, WFIL, Philadelphia, Pennsylvania\nSCHIERER, MARY ELIZABETH - Asst. Prof., Univ. of Missouri - Waters Hall, Columbia.\nSCHIMMEL, ROBERT C, - Radio Coordinator, Boston Public Schools, Teachers /Missouri\nCollege Building, Boston, Mass\nSCHMIDT, MILDRED - 483 Crestview, Columbus\nSCHNEIDER, SAM B. - ^arm Director, KVOO, Tulsa, Oklahoma\nSCHOOLER, MRS. JAMBS M. - Columbus Scholarship Society\nSCEOOLEY, FRANK E. - Rsst. Dir. WILL, Univ, of Ill, also Pres., NAEB, Urbana, Ill.\nSCEROER, ALBERT W. - Supervisor of Music, Public Schools, Woodville, Ohio\nSCEUH, KATHERINE M. - Ohio State University\nSCHULEIN, NANCY G. - Stephens College, Columbia^ Missouri\nSCHWALBACE, JAMES A. - Extension Specialist -in AUral Art, Univ. of Wisconsin, WHA\nMadison, Wisconsin\nSCHWARTZ, LLOYD M. - Ohio State University\nSEAMAN, GERALD L, - Radio Executive, Bert S. Git tins, Advertising - 739 N. Broad¬\nway, Milwaukee, Wisconsin\nSEAMAN, MILDRED I. - Program Director, KFKU, Univ. of Kansas - Laivrence, Kansas\nSEAE.LE, HELEN - Coordinator of Speech, Drama and Radio, Briarcliff Jr. College\nScarborough-on-Hudson, New York\nSEATT, DAVID - Announcer, WOOL - 33 N, High St., Columbus\nSEEL, HELEN - Curriculum Asst., Bd. of Education - 2l6 E 9th, Cincinnati, Ohio\nSENER, WILLIAM H. r 8949 S. Bishop, Chicago\nSEROTA, SAM t Education Director, WIP - 35 S 19th St., Philadelphia, Pa.\nSHANNON, E. S. r Asst. Supt. Schools, Wood County - f25 Green St., Parkersburg, W.\nSHANOWER, DON - Kent State University, Kent, Ohio . /Va*\nSHARP, FERN - Director Women’s Activities, WBNS - 33 N. High St., Columbus\nSHAW, HORACE J. - Office Sec, ’’Broadcaster1 s Exchange”, General Conf. Radio Comm¬\nission of SDA - 6840 Eastern Avenue, Takoma Park, Washington, DC\nSHELL, TED F. - Announcer, WOOL - 788 S. Remington, Columbus\nSHENEFIEL, LEE - Kent State University, Kent, Ohio\nSHEPPARD, PATRICIA E, - Michigan State College - East Lansing, Michigan\nSHERMAN. VAL C. - Public Relations Director, Nat’l. Cooperative Milk Producers,\n1731 Eye Street, Washington, D. C.\nSHOUTING, MARY ELLEN - Capitol University - Columbus\nSICKER, ERNESTINE A. - Radio Public Relations, American Red Cross - 1731 Ella Street\nCincinnati, Ohio\nSIEGEL, SYMOUR N. - Director of Programs, Municipal Broadcasting System, Municipal\nBuilding, New York\nSIMONSON, GLORIA KENT t- Ohio State University\nSINGH, AMAR JIT - Ohio State University\n- 21 -"
}