{
  "id": "d1689-22",
  "text": "NAME\nORGANIZATION\nMAILING- ADDRESS\nSTEVE, MRS. FANNIE M. - teacher, Broadcast, WHA, Univ. of Wise., Madison, Wise.\n17^.0 Kendall, Madison\nSTEWARD, MURIEL - Publicity Director, Hennepin County TB Assoc. - 404 S. 8th St.\nMinneapolis, Minnesota\nSTONE, SIDNEY C, - Radio Director, Bowling Green State University, Ohio\nSTOODY, RALPH - Director, Commission on Public Information - 150 5th Ave., N. Y.\nSTRAUS, HELEN S. - Director Educational Dept., WMCA - 1657 Broadway, New York\nSTRAUS, NATHAN S. - President, WMCA - 1&57 Broadway, New York\nSTUYVSSANT, MARI - Public Relations Dept., J. Walter Thompson Co., 420 Lexington, NY\nSULLIVAN, GRACE E. - Gen. Secy., Ohio Congress of Farents and Teachers - 3350\nLoveque-Lincoln Building, Columbus\nSULZER, ELMER G. - Director Public Relations, Univ, of Ky,, Lexington, Kentucky\nSWARTZ, FRANK W. - Farm Director, WBNS - 33 N. High St., Columbus^\nSWEATT, KELSEY B. - Exec. Secy,, New England Council on Radio in Education, in\ncharge of Public Relations, Mass., Dept, of Education - 200\nNewbury Street, Boston, Massachusetts\nSWISHER, GERALD - Regional Representative, AT - 1801 Superior Ave., Cleveland\nSWISHER, MRS. MARK H. - United Council of Church Women, Committee United Council -\n1840 Baldridge Road, Columbus\nTAYLOR, CHARLES K. - Chief Announcer, WCOL - 33 W* High St., Columbus\nTAYLOR, J. CAREY - Asst. Supt., Baltimore Public Schools, 3 s* 25th St., Baltimore\nTAYLOR, DAVIDSON - Viee-Pres., Director of Programs, CBS - 485 Madison, New York\nTAYLOR, LYTTON R. - Radio WGN - 44l Michigan, Chicago\nTESGARDIN, JUDY - South High School, Columbus\nTEEGARDIN, NORMA - South High School, Columbus\nTHAYER, PAUL - South High School, Columbus\nTHOMAS, RITA M. - Director Women’s Activities, WHKC - 22 E. Gay St., Columbus\nTHOMAS, ROBERT D. - Eastern Sales Mgr., WBNS - 33 N. High Street,.Columbus\nTHOMAS, RUTH M. - Assoc. Prof, Wilberforce University, Box 275* Wilberforce, Ohio\nTHOMPSON, BAN H. - Radio Director, Asst. Manager, Dept, Public Information, Nat’l\nSafety Council - 20 N. Wacker, Chicago, Illinois\nTHOMPSON, PENN - Field Representative, American Fat Salvage Committee, New York -\nMundelein, Illinois\nTHOMPSON, WAYNE N. - Asst. prof. Speech, Univ. of Mo., 5°1 Turner Ave., Columbia,Mo.\nTHOMSON, MRS. MARGARET - Radio Chairman, Red Cross - 47 Spirea Dr., Dayton, Ohio\nTILTON, MRS, EARL -r AAUW - 2390 Arlington, Columbus ^ _\nTINNEA, JOHN ¥\\ - Asst. Station Director, KWK, Chase Hotel, St. Louis, Mo.\nTOALSON, MARK K. - Production Manager, WS.B - Biltmore Hotel, Atlanta, Georgia\nTOEPFNER, JEAN I. - Asst., Sales Dept., WBNS - 33 N, High St., Columbus\nTOEPFNER, MRS. JOSEPH- 2413 Bawick 31vd., Columbus\nTONKIN, JOSEPH D. - Field Serv. Officer, U. S. Dept, of Agric. Radio Serv., Wash,DC\nTOOKE, FRANKLIN A. - Program Manager, KDKA - Grant St., Pittsburgh, Pa.\nTOPE, REBECCA - Secy, Miss Josette Frank, Child Study Assn - 221 W 57th St., NY\nTOTTEN, HAL - Farm Director, WGN - 44l Nr Mich. Avenue, Chicago\nTOTHSRINGHAM, WALLACE C. - Speech-Radio, Muskingham College - New Concord, Ohio\nTOV/ERY, JAMES G. - Editorial, Review and Herald Publishing Association, Wash, DC -\n2483 East Main Street, Columbus\nTOWERY, MS, MABLE A. - Office Editor, SDA Headquarters, General Conference,\nTakoma Park, Wash. - 2483 East Main St., Columbus\nTEaCE, GENS - Program Manager, WKBN - 17 N. Champion St., Youngstown, Ohio\nTRAGSR, FRANK N. - Asst, to Pres, Nat’l, Conference of Christians and Jews, N. Y. -\n3 Blackstonc Place, New York\nTRAXLER, JOHN N. JR. - Writer, Producer - 3901 Randall Street, St. Louis, Mo.\nTREFFINGER, MRS. RAYMOND H. - Pres., Bexley Women’s Club - l4S Stanbury, Columous\n- 23 -"
}