{
  "id": "d1689-6",
  "text": "NAME\norganization\nMAILING ASDRESS\nELLIS H. EMORY - Radio Officer - Domestic Broadcasting Division, Netherlands\nInformation Bureau. - 10 Roekefeller Plaza, New York\nELLIS, HAROLD - Manager, Public Information, Univ. California - Berkeley, a\nELLIS, JOAN - Commentator, NBS - 3^9 W* 57th St., New York\nELLSPSRMAN, MRS. ERED - Cols, Fed. Women*s Clubs - 33o Tibet, Columbus\nEELSTRQM, GLENN E. - Ohio State University .. ..\nELSON, WINFRED P. - General Services Socy., Foreign Missions Conference o\nAmerica >*• 156 Fifth Avenue, New York\nEMERSON, ROBERT S. - Chairman, Radio Dept., NYU - Washington Sq., New Yor*\nEMERY, WALTER B. - Attorney, FCC - Washington: - 4407 aim St,, C^evy Chase,\nEMKITT, HELEN P. - Pres., Ohio Congress of Parents and Teachers - 335° Leveque-\nLincoln Bldg., Columbus lf .. v.m\nEHGBL, HAROLD a. - Asst. Director, WHA, Univ. Wisconsin - nadio Kali, Madison, V-isq.\nE1IGBL, mu - Barm Director, Hamilton Broadcasting Co. - High Street, Hamilton,0,\nESHBACE, CHARLES E, - Farm Program Director, WBZ - 275 Trenont St, Boston -\n4QS Atlantic Avenue, Boston 10, Mass,\nEYaNS, BOB - Production-Manager, Fort Industry Co. T 136 Huron St., Toledo, Ohio\nE7AN3, LEWIS D. - Ohio State University\nEVaNS, PHIL - Farm Director, KMBC - Kansas City, Mo.\nEVERSON, CARL M, - V. Pres, Gen. Mgr., WHKC «r 22 E. Gay St, Columbus\nEWING, THELMA L. - 1745 N. 4th Street, Columbus _ _ ,\nEWXHG, WILLIAM H. - Program Supervisor, WOSU, Ohio State University, Columbus\nEYESTOHE, MAXINE A. - Michigan State College, East Lansing, Michigan\nFAUOINSTSIE, ROBERTA E. - Extension nutritionist, Campbell HaH. OSU. Columbus\nPARLEY, BELMONT M. - Press and Radio, national Education Assn., led lbth St, M\nWashington, D. C. , _ . ,,\nFARMER, J. EDWIN - Director Public Relations, Ohio Public Healtn Association -\n. 1575 Neil Avenue, Columbus, Ohio\nFARRELL, ALFRED - Ohio State University\nFARRELL, MARY V. - 4l0 Hamilton Avenue, Columbus 3> Ohio\nFAYE, BILL - South High School, Columbus\nFEDDERSEN, DONLEY F. - Reviewing Stand, Northwestern Univ. - Evanston, Illinois\nFEINSTEIN, SHIRLEY - South High School, Columbus\nFEL3ER, MARGUERITE B. - Felber Feature Service - 110 E 42na St., New lorm\nFERTE, A. J. - Salesman, WCOL - 33 N. High St., Columbus\nPICK, ANNETTE - Exec Secy, Camp Fire Girls -r 209 S. High Street, Columbus\nFISCHER, JOAN - South High School, Columbus\nFISHER, SHIRLEY - South High School, Columbus\nFISHER, STERLING W, - Asst. Public Service Counselor, NBC - Radio City, new York\nFITZGERALD, L. C. - Chief Radio Service - Branche #6 Veteran s Administration -\n52 Starling Street, Columbus\nFLEMING, MARGUERITE - South High School, Teacher Radio and vrama - 93° Francis\nAvenuo, Columbus, Ohio\nFL0E3A, HART K. - Federation of Glass, Silica Sand Workers of Aaer., CIO, Columbus\n1976 N, Fourth St., Columbus . „ _ .\nFOL^Z MIRIAM R. - Home Economics Radio Editor, WOSU, Ohio State Univ., 0 urn us\nFOLTZ! RUTH M. - Elementary Program Coordinator, Board of Education, «50*.\nFORSHSE, GLENDORA - Teacher, Mackenzie High School, 9275 rfyoming «o, J-etroit\nFORSLING, BETTY - Radio Editor, Newsweek - 152 W 42nd Street, N. Y,\nFOSTER I'i'Xh C. - Dean of Woman's Staff, Pomeren Hall, Ohio State Univ,, Columous.\njOSTEp! MICHAEL J. - Aest to Public Director, CBS - New York City\nFOTHEEINGHAM, WALLACE C, - Speech and Radio, Muskingaa College - 103 Lakeside,\nNew Concord, Ohio\nFOX, KATHERINE L. - Director, Special RroaAc^ct ServiWLW «p l40 tf 9th *,\nCincinnati, Ohio\nT 7"
}