{
  "id": "d566-100",
  "text": "Personal Thoughts on the Managership\nSince discussing this problem with Messrs* Schramm and\nHudson, I have given the .latter a lot of consideration. I\nhave also checked into the staie of progress of my doctoral\nprogram* There appear to be three courses (3 units), and\nthe languages left to complete before the prelims. This\nseems to me to be a sufficiently small amount of work that it\nneed not influence a decision one v.ay or the other.\nMy thinking on the subject solidified as follows: I\nconsider the network operation extremely important* The\npossibilities that can be visualized by projecting this\nprogram into the future are inspiring. Uhile I cannot be\nconsidered a parent to this baby, I like to think that I\nmight be a second assistant midwife. Having gotten involved\nin the growth of a promising child it would e somewhat\nfrustrating to abandon it before maturation. The desire to\ncarry the job a few more steps forward and the unusual promise\nof the opportunity weigh heavily in favor of tieinp my kite\nto NAEB tape.\nI strongly desire to finish my degree. Several times I\nhave started and stopped a doctoral program. This time I mean\nto finish, even if I qualify as one of the most senile of\ngraduates. Any job that precluded this possibility would be\nout of the question. I believe that this particular job would\nnob prevent my going ahead with the degree program. This is\nespecially true if the full time basis can be delayed until\nSeptember. This wou^d allow me to pick up two of the required\nthree units, or one unit and a language during the summer. I\nam approximately half ready in both languages. I will not be\nstarting from scratch in either one. Therefore, it seems possible\nto complete this requirement in the near future, I am not against\nfacing another couple of years of working nights, week-ends, and\nholidays. I have rather gotten used to it.\nAfter a couple of years of marginal existence the prospect\nof a full time salary is enticing to say the least. I do not\nneed to stress the fact that the cost of supporting a family\nhas risen somewhat. I have endeavored, however, not to let\nthis be the determining factor.\nThen there is television. Television is a fascinating\ngadget. I cert-inly do not v;ant to be separated from TV\npermanently. At the same time I do not want a full time\nprogramming or production job. Such experience is most\nvaluable in learning the details of the medium. At the same\ntime such a job involves such time-consuming attention to the\nhour-to-hour and day-to-day minutia of keeping things running\nsmoothly that there is never an opportunity to observe the\nthing in its entirety. I feel that what I need to do in\nTV is to be connected to the degree that I can ■ eep a hand\nin, but be sufficiently free to observe its operation\nobjectively. That doesn’t seem possible in an active\nproduction capacity*"
}