{
  "id": "d566-103",
  "text": "September Id, 1951\nDean Wilbur Schramm\nDivision of Communications\nUniversity of Illinois\nDear Dean;\nReceived a hasty note from Jim Miles in which he asked\nthat I inform you that, in his words, \"The board meeting went\nabsolutely OK# I think we now have a solid foundation\". So.\nI have so reported.\nIn ray reply to him I expressed my joy that the project\nhad now a solid foundation. However, I was saddened to find\nthat the network itself did not yet have this 3olid foundation.\nThat foundation being—tape. A problem on which no decision\nwas made and no action taken. There came a word that Siegel\nwas sending a Fire Prevention program to be duplicated in as\nmany copies as possible—but no word as to where we were to\nget the tapes on which to make these copies. Everyone seems\nworried about a duplicator, more programs, more copies of\nprograms, etc. etc., but I can’t seem to get anyone to worry\nabout the impasse that faces us in the immediate future if\nsomething isn’t done about tapes. Maybe I’m a worry-wart, but\nI don’t see any quick answer.\nI requested from the School of Journ and Comm one or two\ngraduate assistants for the coming school year. My thought\nwas that there are going to be a number of projects underway,\nsuch as promotion, potential audience counts, digging through\nthe trade press and other literature, readying materials for\npublication, etc. for which an assistant or twfo from journalism\nand/or communications would be most useful. Prof. Siebert\nhas informed me that the school has none that he can make\navailable. So, I thought it might be well to check with you\non the possibility of the Institute’s having a hidden corner\nin the program somewhere. I guess no one knows for certain just\nhow much of this sort of work there will be, but I should\nguess that it will be considerable. Don’fr know what our\nbudget would stand. Maybe it is something you will want to discuss\nwith Jim. On the other hand I doubt he would object to having\none or two assistants which were paid by the Institute.\nSorry to trouble you with these little matters, and\nmany thanks for your patience and consideration."
}