{
  "id": "d566-130",
  "text": "Hr. Seymour Siegel\n.2-\nNovember 28, 19$1\nI am writing to Mike Hannah by this same mail.\nI do plan to attend the American Council on Education meeting in Wash¬\nington and the UNESCO meeting in New York. Regarding the exhibit,\nwould you have any idea of how much space would be available for this?\nI feel very' strongly that the News Letter should be published in this\noffice. It will be extremely difficult to transfer funds to Paulu to\npay for publishing this at another location. I am writing him to\nthis effect, suggesting that he send his rough draft to us here on\nthe December 20 issue, at least, so that we can process and distribute\nit.\nI will have a total plan on the Committee on Committee^ idea for your\napproval December 8. This, to me, seems to be the very heart of the\nKellogg project and it is absolutely neceseaiy that we proceed on this\nwith a minimum of delay.\nI was very troubled by your concluding statements regarding the service\nassessment for WNYC. I was certain that all of the old timers would go\nalong on this without any question. I realize that you have performed\nlong and valuably on this matter, but I still believe that it will be\nabsolutely necessary to present a united front during these early years\nif we wish to make the tiling a success.\nI like the idea for a clipping service for NAEB. Could you suggest\nary such service in New York?\nI note in the September meeting that you were going to send us archival\nmaterials on NAEB now in your possession. We do have adequate space\nfor these, and should they be of such nature that they should go in a\nlibrary, the University Library has agreed to include them in its\ncollection. Needless to say, they can make no promises without first\nseeing the material.\nI am writing to the following people on whom I have carbon letters\nfrom you: Miss Ola Hiller, Flint, Michigan; Mr. Arthur Cornwell, Terry-\ntown, New York; Mr. John Young, Chapel Hill, North Carolina; Hr. Bob\nGreenebaum of Carnegie; Mr. Robert Steele, Ohio State; Professor\nRaymond Wyman, Amherst, Massachusetts; Miss Gloria Dapper, New York;\nMr. James Petersen, Muncie, Indiana, and Miss Flora Schreiber, Garden\nCity, New York."
}