{
  "id": "d566-149",
  "text": "NAEB Tape Network\nMr. Seymour N. Siegel\nPresident, NAEB\n2500 Municipal Building\nNew York 7, N.Y.\nDear Sy:\nWell, at least we are in complete agreement on a couple of\npoints. Neither of us believes, \"that we are doing more than\n50$ of the job that should be done\". We also agree that, \"many\nof the problems *** are dependent auixaxxxKKS for answers on a\nquestion of policy, as well as procedure.\"\nI am not at all certain that we can agree on exactly what the\njob to be done is, and how much of it can be accomplished with\nany given amount of facilities. Obviously we are not in agreement\non yia policy* and precisely who should establish it.\nBefore going further let me say clearly and simply that any\npersonal feelings of mine that creep into this discussion are\nentirely the result of the desire to make the network service as\nefficient and as significant as I possibly can. I do not in any\nway think of this operation as \"my baby\". I do not posess the\nslightest desire to establish policy for the network. Both »\nbecause of personal feeling in the matter, and because it seems\nto suit the democratic nature of the association, I feel\npolicy in relation to the network is a matter for the board of\ndirectors and duly appointed committees. I am a paid employee\nof the NAEB. I am fully aware that I was not hired to dictate\npolicy to the organization. As an employee, however, I strongly\nfeel that on the basis of my experience in this job that I\ncan offer some suggestions and opinions. Not only can, but\nshould offer these opinions. In this spirit the following\ncomments are made. Where policy is established I have and will\ncontinue to operate in accordance with that policy.\nFurthermore, I have tremendous admiration for you as a\nperson; for your forthright courage and determination. I hold\nin respect the position you occupy in this organization. In\ninstance is any of the following meant as a personal affront\nto you. I enlarge upon the points you discussed only to offer\nanother opinions in the effort to reach a more workable\narrangement.\n1. The package system. You are quite correct in assuming\nthat the package system of distribution was a temporary\nexpedient. It remains so. Its end depends upon sufficient\nduplicating facilities to allow separate copies for all"
}