{
  "id": "d566-152",
  "text": "to date convinces me that our present arrangement yields maximum\nefficiency and minimum unit cost for duplicating. Being so\nconvinced I see no reason to change the method.\nOur staff consists of myself, two full time employees, and\na part time student who helps with some of the labor. It\nis not impossible that there is an amount of work which is\nmore than we can accomplish. Unlike ths. New York City the\nmiddle west xaiMXxtamxioisKiiigxx spawns human rather than\nsuper beings. How large a staff the membership can eventually\nsupport is not yet clear to me. I think it will take some\nmore experience before we can answer that one. It will be\nnecessary to gear the size of the output to a staff that the\nmember stations can support. Perhaps it xsh& isn’t pessimistic\nto plan on the staff being composed of normal people—\nunaddicted to benzedrine and other stimulants.\nWisconsin is dubbing a series of programs this time. It\nis one of the shows they are contributing to the network. We\nsend them the tape and they return the program ready to go.\nFrom what Ray Stanley tells me, and observing the rate at\nwhich they are coming in^I judge that WHA is finding that\nduplicating tapes in large volume is not a simple task. They\nhave been doing excellent work, and we appreciate their help\nand interest. We have tentatively planned to utilize two\nmember stations, perhaps more, on the Ford Fund programs.\nEven counting on help from other stations, there is\na point somewhere that is beyond our capacity to deliver.\non the implication that the network is being operated to suit\nthe personal convenience of the members of this office. Such\nis not the easel Furthermore, I consider it an ill-temperred\nimplication to make.\nI am most grateful that I do not work for the City of New\nYork. I refuse to work twenty-four hours a day for any sum of\nmoney—let alone my present salary^--or for any purpose, no\nmatter how important. Furthermore, I shall take such\ncomments more seriously when evidence is forthcoming to indicate\nthat there is anyone on the WNYC staff who has put in longer\nhours than I have since last January 15. And five months of\nthat for i time pay, tool Meanwhile, such false assumptions\nas you seem to have made only emphasize the need to bring the\noutput volume and the staff available into closer harmony.\nI agree with Browning, tTitaaan A man’s reach should stg\nexceed his grasp”. I have many times changed my idea on what\nis and is not possible. But, daydreamer though I be, I\nkeep my practical sights on what is ”possible”.\n”A” foe effort is perhaps satisfying to an eighth grader,\nbut somehow smacks of insult at this level. Are personal\ndifferences of opinion that important?"
}