{
  "id": "d566-153",
  "text": "6* Communication, coordination, and operation#\nIt would be ridiculous to say that we have kept everyone\nadequately informed b£ on everything that is going on here at\nany given moment# I had thought that we at least made an effort\nto keep everyone informed on all of the important things. 1/ve\nalso report on our progress at board meetings# It is possible\nthat this is entirely inadequate# If so, it can be corrected#\nThe above, however, was not what I had in mind when I\nmentioned communication and coordination. It may well be a\npart of the total picture, but it is by no means the only\npart• . . ,\nThis problem is many sided and I will try to stick\nthose aspects affecting the network. The first illustration\nmight beging; why the storm about getting the program*\ncommittee’s reactions to a series of programs? Did you not\nappoint this committee for this purpose? Only too true we have\nbeen unable to utilize it fully. We have been forced to make\nup the schedule largely without their opinions. However, we\nhave reserved it for questionable cases or cases involving\na major policy decision. If it had been possible, and I\nhope it always will be in the future, I would never have sent\nout a program without the approval of this committee# As stated\nin general terms earlier, I an not about to say—nol we won t\noffer a series done by the FSA# All I want to do is submit it\nfor approval by the program committee.\nIt is absolutely true that we haven’t done this m all\ncases. Is neither the executive director nor the network\nmanager to be allowed any room for exercise of judgement? I\nrepeat, I think all programs should be selected by a\ncommittee. The judgment refers to emergencies and the frequent\nexigencies of an operation of this sort.\nIn general, it is my thought that the relationship between\nthis office and the officers and boardof NAEB is such that a\nsmooth running operation is well nigh impossible. It appears\nto me to be entirely a matter of organization, precisely who\nis responsible for what? How much division of responsibility\nand decision of committment can there be? I might point out\nthat in the following proposals fckacfc when this office is\nindicated it is intended to imply that the power of decision\nis vested in the executive director who, I assume, is directly\nresponsible to the NAEB board for such action as he may take.\nI will not spend the time discussing the specific\ninstances that have resulted in these proposals. It would^\ntake far too much space and time, and I believe the principles\nwill be dear from the xjt&fcifcicfiL proposals themselves.\nI, therefore, propose the following steps to improve\nthe organizational position of the network in the association\nas a whole:\na. That the board of directors, appointed committee, or\nother duly constituted body give serious and detailed\nconsideration to the specific functions of the network, its"
}