{
  "id": "d566-158",
  "text": "December 27, 1951\nMiss Jeanne Lowe\nRoger Brown, Inc*\nJUO East l*9th Street\nNew York 17, New York\nDear Miss Lowe:\nIn thinking about the most advantageous time to release a\nstory on the Tape Network, it would seem wise to utilise a worthwhile\nnews story in conjunction with it. Somewhere near the end of February\nthe NAEB will release a rather important news story concerning several\nseries of programs which are being produced under a grant from the\nAdult Educational Fund of the Ford Foundation* A sizeable sum of money\nand a good deal of energy are being expended to secure national pub¬\nlicity on this release* I would think that a story on the Network\nreleased to coincide or to shortly follow this release would be the\nbest way to secure maximum effect.\nIf this sounds like a good idea, please let me know and I\nwill keep you informed as the details of the above plan develop. This\nwould time the Network story toward the end of February or the first\nof March.\nI am enclosing a oouple of brochures on the Network and a\ngood deal of material related to the current schedule. The anecdotes\nand quotations concerning listener reaction will take a little time\nto assemble since most of them go directly to the stations and rarely\ncone into our office. However, I will get a note out to a number of\nstations and as soon as they have sent in some of t\\i s material, I\nwill forward it on to you.\nOur method of operation, as of this moment, probably requires\nsome explanation to enable you to fully understand all of the accompany¬\ning material. There is enclosed a list of the stations divided into\n12 geographical legs. You will note that this list differs slightly\nfrom the one in the brochure, which results from the fact that stations\nare now required to bear part of the operating costs. On this basis,\na number of the stations have been unable to continue at the present\ntime.\nWe now make one copy of all programs for each of these 12\ngeographical legs* The stations on each leg then \"bicycle” the tapes\naround to each other."
}