{
  "id": "d566-159",
  "text": "Kiss Jeanne Loire\n-2-\nDecember 27, 1951\nWe currently employ what we call a \"package” system* This\nmeans that somewhere between four and eight weekly hours of programming\nare made up for each package* This package goes as a unit to each\nstation and may be retained by the station for a week. They may use\nas many of the programs as they desire and can schedule them during that\nweek to suit their convenience.\nYou will notice that our programs are originated by a wide\nvariety of organizations* There exists a committee made up of represen¬\ntatives of member stations which decides program policy and largely\ndetemins the composition of the Network schedule. The content of each\npackage is decided upon and an offering is made to the stations accord¬\ning to a tentative time schedule* After the stations have replied a\nfinal schedule is made up, copies of which are returned to the stations.\nThe packages are mailed from Headquarters in aaple time to meet these\nschedules.\nAs much information and material useful in promotion is sent\nto the stations as far in advance as possible. The stations are com¬\npletely free to use or reject as many of the programs as they desire*\nThere is no pressure of any kind tending to require stations*to utilize\nprograms.\nBetween the brochures and the dittoed material you can put\ntogether a fairly complete list of all the programs which we have\noffered. This, like many of the other materials, probably will seem\ndisjointed and quite unclear* We do not have anything in writing which\nfully tells the whole story. However, I hope this letter will provide\nyou enough information so that you will know which aspects of the\noperation you think would be of interest and about which you would like\nmore information.\nNaturally we are very anxious that a good story be published\nin a national magazine and are most willing to provide you all the\ninformation you want and need, so on anything that is not clear or\nwhich needs more detailed explanation, please let me knsw and I will\ndo ay best to fill in all of the details.\nI also should add that the operation, as roughly outlined\nabove, is a temporary expedient* When we are fully equipped we intend\nto supply every station with its own copy of all programs* This will\nmake a much simpler and far mors efficient kind of organization. It\ndepends, however, upon a large duplicating machine which we do not yet\nhave. We are hopeful that this machine will be built for us by the\nL. S. Toogood Recording Company of Chicago in the near future* It is\nonly then that this service will achieve the kind of operation that\nwas planned at its inception."
}