{
  "id": "d566-161",
  "text": "f\"^ O C| 1?),\n'/touVTL^\n■ INC.-\nSUCCESSOR TO THE EARLE FERRIS COMPANY, INC.\nPRODUCT PUBLICITY - PUBLIC RELATIONS\n40 EAST 49th STREET • NEW YORK. 17, NEW YORK.\nPLAZA 5-3100\nROGER BROWN, PRESIDENT EARLE FERRIS, CHAIRMAN OF THE BOARD\nDecember 14, 1951\nMr. Richard L. Rider\nManager, NAEB Tape Network\nUniversity of Illinois\n119 Gregory Hall\nUrbana, Illinois\nDear Mr. Rider:\nPaul Jansen of Minnesota Mining and Manufacturing Company, for whom we handle gene¬\nral consumer publicity, has informed me of your interest in placing some national\npublicity stories on the NASB Tape Network. I have already spent some time going\noyer this story with Seymour Siegel and think it has good possibilities for a maga¬\nzine story if we can get some more material which would indicate public response\nto the programming your network offers.\nMr* Siegel suggested that I write to you for further information on the NAEB Net¬\nwork. There are two angles that I would particularly appreciate your help on. The\nmost important one, mentioned above, is some specific anecdotes and details on\nlistener reaction around the country. Do you or your member stations have letters\nfrom listeners which would indicate that the NAEB network is filling a need not\nmet by the commercial radio stations? If we can show public enthusiasm, the story\nwill have much greater acceptance than if we can only say the member stations\nhave long felt the need for this type of programming.\nThe other matter which would be of interest is the mechanics of informing stations\nof available programs and the actual scheduling. Would it be possible for you to\nsend me a sample week’s mailing to member stations to show how you work this out?\nWe would be interested, of course, in any other information which you may think\nis pertinent. For example, are there any events coming up in the next month or so\n5r0Vid! ? for a n9WS story? Your hel? win certainly be appreciated\nand we look forward to hearing from you soon.\nBest wishes for the network's success.\nSincerely yours,\nJeaixi/ie\nJeanne Lowe\nJL:im"
}