{
  "id": "d566-44",
  "text": "■3-\nAdditional Programs\nThere are several other series in various stages of negotiation and\nconsideration* A brief description and a summary of the status of each\nprogram is given.\n1. Cumberland Forest Festival Concerts* Eight one-hour concerts given at\nthis festival under the direction of Dr. Roy Harris. These are promised to\nWNYC by September 1. It is still not clear when they will be available to\nus. Presumably before the first of October.\n2. Army band concerts. Ten concerts by the US army band. They are, presently\nthree reels in length. Probably should be cut to an hour. Six are presently\non hand. Remaining four coming from WNYC.\n3. U and the A bomb. A series done by WOSU. Audition copy on hand. Remiinder\navailable on short notice. Needs to be heard by committee.\nh» Cooper Union Forums. More of the same. First series is given in New York\nstarting in October. There are four series a years.\n5>. Ford Fund Shows. We hope by October or November.\n6. A Time For Planting. A WLW production that looks very interesting from\nthe scripts. Wouldn’t we need AFRA clearance on this?\n7. Science and People. A series of 13 programs on science and research\ndone by WILL. Should be auditioned by committee. Available on short\nnotice•\n8. Bach Memorial Concerts. A series of half hour piano recitals of much of\nBach’s keyboard music. Played by Gunnar Johannsen of U of Wisconsin. Probably\nwould have more appeal had they had the series done on the harpsichord. A\npossibility for those wanting the real long hair.\n9. Wisconsin Freshman Forum. A series of hour-long talks. Good possibility.\nProbably would take some time for Wisconsin to get it ready.\nNOTE: Most of this has just sort of drifted in. There has not been a concerted\ncampaign to round up program materials. As soon as the committee can get\nthe machinery organized a vigorous campaign should be undertaken. When we\nhave a backlog large enough to allow long range planning and notification,\nI will be happy.\nMORE NOTE::: In addition the school committee is busy getting three programs\nlined up for school use. Once that service has started there will be a\nnumber of strictly school programs in the mill at all times."
}