{
  "id": "d566-45",
  "text": "/\n2 5\nOn or about the first of January,* I asked all members of NAEB 'to submit\nquestions -which NAEB* through meetings g might help solve. The attached are the\nanswers I hairs receiired from that leirfcer^ together with the suggested areas I hair©\nmade at several times® The first undoubtedly is the most complete. It is a re¬\nport from WOSU. I think you will enjoy reading it and all the rest of the letters®\n**********\nWOSU STAFF\nI« NAEB NETWORK\nThis report presents the thinking of WOSU staftambers on the question\nof improiring the services which HAEB renders to university stations® It is quite\nlikely that seme of the questions, suggestions& and criticisms also apply tc MSB\nservices to other types of educational stations®\nRecording Quality of NAEB Programs\nGenerally speaking the recording quality of programs received from the\nNetwork have not been of satis factory broadcast quality® This may be due to poor\nrecording at the originating point or for other reasons® Whatever the cause our\nengineering staff reports that the frequency response of these tapes is often\npoor* probably because of improper head alignment® In same cases it would seem\nthat poor production at pick up source ms the difficulty.\nWe suggest that this problem be explored at the proposed meeting with\nattempt to arriire at certain minimum standards. We suggest also that consideration\nbe given to th© possibility of preparing a small booklet which would set forth\nsuch standards along with basic suggestions for operation and maintenance of tape *\nrecording equipment. The latter would be especially valuable where an adequate\nengineering staff is not available to operate and maintain th© equipment. Perhaps\nit would even be possible for the NAEB to arrange for teams of technical specialists\nto visit stations to conduct on-the-job training programs of station personnel in\nrecording techniques.\nNAEB Network Programming\nIn general ohe TifOEU staff has been enthusiastic about the way program\nofferings hare developed. We approve of the present trend toward more programs\noriginating from various universities to complement programs from non-university\nsources. ' ' '\nWe suggest that most offerings from the network be non~musioal!in nature\nand that whatever music is offered should be of a nature not generally arailable on\ncoords. We believe that many schools and departments of music have outstanding\nfeoulty members or student groups capable of presenting this special type of pro¬\ngramming. This policy would limit quantity but would provide a distinctive service.\n4 _ Our stafi would like to see more exchange of outstanding talks or lectures\navailable on the various campuses. By a oarefhl selective process wa believe tint “"
}