{
  "id": "d566-97",
  "text": "I<t£j\nReport to Messrs* Schramm, Siebert, Hudson, and Schooley. To\naccompany report on NAEB Tape Network operation, prepared\nfor the executive board of NAEB,\nSTATEMENT\nThis report is submitted to accompany the report prepared\nfor the executive board of NAEB which covers the operation of\nthe tape network service to date. The additional information\ncontained in this report is of concern to &he University of\nIllinois as custodian of the Tape Network. The major report\nwill be completed by approximately the 25th of April.\nFACILITIES\nIt appears safe to say that the efficiency of the network\nservice has been somewhat improved since the University of\nIllinois took it over. It cannot be said, however, that it\nis at the point where further improvements are not possible.\nThere is much to be done. Some of the following points are\nobvious, but are included in order to present as complete a\npicture as is possible at this time.\nRecording service: If the network is to gain in the efficiency\nof its operation it is essential that the recording service\navailable to it be vastly implemented. This is not intetided to\nreflect on the personnel of the recording service. Bob\nJohnston and his fellow-workers have been most cooperative, and\ntheir work has been excellent. The difficulty appears to be\nthat there is insufficient equipment and time to complete our\nbusiness in addition to the many assignments the recording\nservice handles for University agencies,\n- Some of the pressure is the result of the backlog of recording\npast series for file purposes. However, it is almost certain\nthat once these are caught up, the volume of work will be no\nless in view of proposed expanded operations of the network.\nAdditional equipment (including a mass tape duplicator) will\ngreatly relieve this problem. It v/ill be necessary, however, to\nreserve a sufficient number of hours per week to fulfill the\nnetwork’s obligations. This amount of time will, of course,\nvary greatly in proportion to the amount of pro* ramming to be\noffered.\nEquipment.\nIn addition to the equipment needed in the recording service\nit is imperative that network headquarters have a tape machine of\nsufficient quality that it can be used for editing, timing, and\nchecking quality of tapes received. This would include an\nadequate speaker system, editing and splicing equipment, etc. Such\nequipment would facilitate the operation immeasurably, at the same\ntime taking a great burden off the shoulders of the recording\nservice."
}