{
  "id": "d1685-0",
  "text": "Office of Executive Secretary\nUrbana, Illinois\nJuly I, 1941\nFALL CONVENTION GOES TO PURDUE\nA majority of those voting for the Fall Convention site designated\nPuroue University as their choice. So the Fall Convention will be held\non Purdue University campus, September 5 and 6. That means Gib Williams\nCAN GET TO WORK NOW.\nPreu•dent Ingham $ill announce a Convention proqram committee within\nA FEW DAYS, AND YOU'LL BE KEPT ADVISED ON PLANS. ONE PLAN YOU CAN\nMAKE IS TO BE PRESENT AT THE MEETING. PLAN TO BRING A NUMBER OF\nYOUR STAFF MEMBERS. ILLINOIS WILL CHALLENGE YOU ON THE NUMBER,\nWHAT SAY?\nWISCONSIN LEGISLATURE AGAIN SMILES ON WHA\nOn June 4 the Wisconsin Legislature passed the second bill to extend\nAND IMPROVE THE BROADCAST SERVICE OF STATE-STATION WHAe THE BILL\nPROVIDED FUNDS FOR THE PURCHASE OF LAND, CONSTRUCTION OF A STATION\nHOUSE AND THE ERECTION OF A MODERN ANTENNA. THE FIRST BILL NEARLY\nDOUBLEO THE STATION’S OPERATING BUDGET.\nThe WHA PLAN IS TO MOVE THE TRANSMITTER TO A SITE SOME FIFTEEN MILES\nfrom Madison in the direction of the state’s center of population.\nThis change, coupled with the improved transmission given by the\nTALLER RADIATOR, WILL BRING POPULOUS MILWAUKEE COUNTY WITHIN THE\nPRIMARY SERVICE RANGE OF THE STATION. OVER HALF OF THE POPULATION OF\nTHE STATE WILL THUS BE WITHIN THE PRIMARV SERVICE AREA OF THE TRANS¬\nMITTER.\nSMILES FOR HIGGY AND OHIO STATE, TOO\nR. C. Higgy, Director of WOSU, writes:\nWYOU CAN SAY FOR US ANYTIME NOW THAT WE HAVE NEW STUDIOS AND OFFICES\nIN THE MAKING AS THEY ARE DEFINITELY UNDERWAY NOW. THE UNIVERSITY\nArchitect is now drawing plans and the money is all set aside for an\nADDITION TO OUR JOURNALISM BUILDING WHICH WILL GIVE US COMPLETE NEW\nSTUDIOS AND OFFICES DONE IN A VERY SUBSTANTIAL WAY. I DON * T KNOW JUST\nHOW WE WILL STAND IT ALL AFTER LIVING FOR TWENTY YEARS IN WALLBOARD\nTEMPORARY STUOIOS ANO OFFICES.\nSPEAKING OF LIBERTY\nA LETTER FROM MISS MARJORIE GREISSER OF THE COUNCIL FOR DEMOCRACY,\n285 Madison Avenue. New York City, speaks for itself:"
}