{
  "id": "d1685-2",
  "text": "NAE8 NEWS LETTER\nPage 3\nJune l> 1944\nPEABODY AWARDS ANNCUNCED\nThe George Foster Peabody Annual Radio Awards Board has announced awards\nFOR THE PAST YEAR. WINNERS IN THE USUAL SEVEN CLASSIFICATIONS OF THE\nPeabody Radio Awards are:\nOutstanding community service by a regional station—\"These Are Americans,\"\nKNX, Los Angeles.\nOutstanding community service by a local station—\"Calling Longshoremen,”\nKYA, San Francisco.\nOutstanding reporting of the news—Edward R. Murrow, CBS.\nOutstanding entertainment in drama—\"Lux Radio Theatre,\" CBS, and \"An\nOpen Letter to the American People,\" CBS, Double Award.\nOutstanding entertainment in mustc—\"Mus«c and the Spoken Word,\" (Salt\nLake City Tabernacle Choir) KSL, Salt Lake City.\nOutstanding educational program—\"Ameri cajs Town Meeting,” Blue.\nOutstanding children's program—\"Let's Pretend,” CBSc\nWRUF WINS HONORABLE MtNTION\nThe National Board of Fire Underwriters has announced the winners in its\nTHIRD ANNUAL COMPETITIONS FOR OUTSTAND 8NG PUBLIC SERVICE IN THE FIELO OF\nFIRE PREVENTION.\nRadio Station KMTR of Hollywood, California, has been awarded one of the\nTWO FIVE-HUNDRED DOLLAR GOLD MEDALS OFFERED. KMTR TOOK THE TOP HONORS\nIN THE RADIO FIELD FOR ITS SERIES OF BROADCASTS IN CONNECTION WITH THE\nLos Angeles Fire Department.\nThe FIVE-HUNDRED DOLLAR GOLD MEDAL IN THE NEWSPAPER FIELD WAS AWARDED\nto the Burlington, Iowa, Hawk-eye Gazette.\nHonorable mention for fire prevention work was awarded by the Underwriters\nto Radio Stations WEBR, Buffalo, New York; WLS, Chicago, and WRUF,\nGainesville, Florida. The honorable mention to WRUF was \"in particular\nappreciation of the services of the Station in rounding up fire-fighting\npersonnel in various emergencies caused by forest fires.\"\nThe Gold Medal will be presented to KMTR of Hollywood at a luncheon in\nNew York on May 25th.\nSYRACUSE SERIES PRAISED\nFor seventeen weeks now the city of Syracuse, New York and Onondaga\nCounty have participated in a series of radio programs to promote post-war\nplanning. According to the secretary of the American Society of Planning\nOfficials, Walter Blucher of Chicago, the results have been gratifying.\nThe radio series, titled Syracuse on Trial, has resulteo in these\ndevelopments:"
}