{
  "id": "d1685-3",
  "text": "NAEB NEWS LETTER\nJuly 1, 1941\nPage 4\nWAS REINSTATED. New RELAY STATION TO OPERATE ON I646,2090,2I90, AND\n2830, 20 WATTS, (6/10/41j\nKWLC, Luther College, was given permission to operate special periods\nIN ORDER TO BROADCAST LUTHER COLLEGE SUMMER SESSION CONVOCATIONS.(6/16/4\\)\nWNAD, University or Oklahoma, was granted authority to regain silent ^\nfrom August I to September 14 in order to observe summer vacation. (6/1641,\nK^DY, South Dakota State College, was granted permission to remain\nS,l LENT FROM JUNE 15 TO SEPTEMBER 15. (6/ 13/41 )\nWBAA, Purdue University, was granted extension or completion date on\nits construction permit which calls for new transmitter, NEW SITE,\nand increase IN power, and change in hours or OPERATION,, (6/19/41)\nMunicipal Broadcasting System, City or New York, was granted its\nAPPLICATION FOR A CONSTRUCTION PERMIT ON 43,500 KC IN LIEU OF 46,700.\n(6/23/41).\nThe Commission en banc on May 27 amended its Rules or Practice and\nProcedure by striking the third proviso or Section 1.71 thereof, reading\nas follows:\n\"PROVIDED, FURTHER, THAT IN CASES WHERE AN APPLICANT DESIRES A MODI¬\nFICATION OF A RULE OR REGULATION, HE SHALL SUBMIT A FORMAL PETITION\nSETTING FORTH THE DESIRED CHANGE AND THE REASONS IN SUPPORT THEREOF.\"\nThe Rules of Practice and Procedure are amended by adding the following\nnew provision:\n\"AMENDMENT OF RULES\"\n\"Sec. IoBI - Requests for amendment of rules. Any rerson may petition\nFOR AMENDMENT OF ANY RULE OR REGULATION. SUCH PETITION SHALL SHOW THE\nDESIRED CHANGE IN THE RULES AND REGULATIONS AND SET FORTH THE REASONS\nIN SUPPORT THEREOF.\n* * * * *\nParagraph (b) of Section 1,72 of the Rules of Practice and Procedure\nIS HEREBY REPEALED, AND THE FOLLOWING PROVISIONS ADOPTED IN LIEU\nthereof:\n(b) If AN APPLICANT IS REQUESTED BY THE COMMISSION TO FILE ANY DOCU¬\nMENTS OR INFORMATION NOT INCLUDED IN THE PRESCRIBED APPLICATION FORM,\nA FAILURE TO COMPLY WITH SUCH REQUEST WILL CONSTITUTE A DEFECT IN\nTHE APPLICATION.\n(c) Applications which are not in accordance with the Commission’s rules,\nREGULATIONS OR OTHER REQUIREMENTS WILL BE CONSIDERED DEFECTIVE UNLESS\nACCOMPANIED EITHER (l) BY A PETITION IN ACCORDANCE WITH SECTION 1.81"
}