{
  "id": "d1685-6",
  "text": "NAEB NEWS LETTER\nPage 7\nJune !, 1944\nWestern Michigan College of Education, Kalamazoo, resubmitted its application\nFOR A CONSTRUCTION PERMIT FOR A NEW NON-COMMERCIAL EDUCATIONAL BROADCAST\nSTATION TO OPERATE ON 42,500 KILOCYCLES* (4/27/44)\nLicenses of WNYE, Board of Education, New York City, WBEZ, Board of\nEducation, Chicago, and W1UC, University of Illinois -non-commercial\nEDUCATIONAL BROADCAST STATIONS —WERE RENEWED TO MAY I, 1945. (4/26/44)\nUniversity of Southern California, Los angeles, applied for a construction\nPERMIT FOR A NEW NON-COMMERCIAL EDUCATIONAL BROADCAST STATION TO OPERATE\nON 42,900 KILOCYCLES. (4/25/44)\nThe Commission en banc on May 30 amended Section 4.3(b) of its Rules\nGOVERNING BROADCAST SERVICES OTHER THAN STANDARD, SO AS TO INCREASE THE\nLICENSE PERIOD OF RELAY BROADCAST STATIONS FROM TWO TO THREE YEARS AND\nMAKE EXPIRATION DATES OF RELAY BROADCAST STATION LICENSES AS NEARLY AS\nPOSSIBLE THE SAME AS EXPIRATION DATES OF THE LICENSES OF THE BROADCAST\nSTATIONS WlTH WHICH THEY ARE USED. (THERE ARE A FEW CASES WHERE A RELAY\nBROADCAST STATION IS LICENSED FOR THE USE OF TWO STANDARO BROADCAST\nSTATIONS. IN SUCH CASES, A LICENSE FOR EACH STATION WILL BE ISSUEO.)\nSection 4.3(b) as amended reads:\n“Section 4.3 —LICENSE PERIOD: RENEWAL —\n(a) ***\n(a) - Licenses for relay broadcast and special relay broadcast stations\nAUTHORIZED UNDER SECTION 4.22 OF THE RULES AND REGULATIONS WILL BE\nISSUED FOR A PERIOD RUNNING CONCURRENTLY WITH THE LICENSE OF THE BROADCAST\nSTATION WITH WHICH IT IS TO BE USED*\n(c) ***\n(D) ***\nAt THE SAME TIME THE COMMISSION AMENDED SECTION 3.404(a) STATING THE\nREQUIREMENTS FOR PROGRAM AND OPERATING LOG ENTRIES BY THE LICENSEE OF\nEACH BROADCAST STATION, BY ADDING A FOURTH REQUIREMENT “(4) An ENTRY\nSHOWING, FOR EACH PROGRAM OF NETWORK ORIGIN, THE NAME OF THE NETWORK\nORIGINATING THE PROGRAM.M\nOFF THE CUFF\nBob Coleman at WKAR has a good promotion idea. Students presenting\nMUSICAL PROGRAMS ARE GIVEN TEN PRINTED FORM CARDS TO BE FILLED IN AND\nMAILED TO HOME TOWN PAPERS, ANNOUNCING PERFORMANCE ON WKAR..,.On THE SAME\nFREQUENCY, BUT MILES AWAY MlKE HaNNA^S WHCU AT CORNELL ISSUES A COMPLETE\nPREVIEW OF AGRICULTURAL PROGRAMS CARRIED ON WHCU AND OTHER NEW YORK\nstations.*ooMax Krone of Southern California visited WILL and WHA after\nthe Ohio meeting..Harold Ellis of Berkeley did the same..*cPreo Puller,\non leave from WHA, has been promoted to Captain in the Coast Guard**•«\nJuly I issue of News Letter will carry a supplement giving NAEB roster....\n—ScHOOLEY"
}