{
  "id": "d975-16",
  "text": "3\ndeeply involved in racial issues. The program presented itself with\nsuch quality it was later re-aired by WFMR, a popular local FM station.\nThe Milwaukee disturbances did more than disturb. Action programs\nwere instituted from many fronts. One of the most interesting was a\nrequest by Milwaukee radio and television newsmen and management personnel\nto the University to assist in staging monthly meetings to share ideas on\ncore city coverage. The meetings are held on the WUMW studios and have\nalready come up with a workable voluntary code of newscasting to operate\nduring urban disturbances. The group is operating outside the boundaries\nof progessional competition, sharing opinions and practices that suggest\nlocal broadcasters in Milwaukee are both concerned and committed.\nSix nights each week, in the late listening hours, WUWM reaches the\nblack community with several hours of jazz. The listeners have been\nhighly responsive to the service which provides them meaningful music\nnot found anywhere else on their dials.\nIt doesn’t stop there. Several times throughout each broadcast\nyear, the station does a 11 spectacular,” providing 57 consecutive hours\nof programming along a single idea. One time it is jazz with comment.\nAnother time the marathon treated TIThe Problem of Women”. It might be\nall talk; it might be primarily music, or a skillfull blending of both.\nBut it is there. It is big. It is being heard.\nOn July 21st, a new weekly series of hour programs entitled \"Black¬\nboard” introduced the Reverend Walter B. Hoard, a negro who is both\ntalent and producer. Soul music and discussions of its meaning, talk\nabout Black history and culture, interviews with some of the 500 core\narea organizations, talks with members of the black community ... and\nsome news. Who cares? The Milwaukee Journal did an unheard of thing in\nwriting a two-column, four-inch review of the opening program. (Incidentally,\nthe show is re-run once each week to get a second audience.)\nMuch more is on the drawing boards at WUWM. This is a station that\nnot only enjoys being a part of the action, but creating action itself.\nYou’ll hear more from Milwaukee.\nCONTACT: Dr. Ruane B. Hill, Director\nWBFO, Buffalo: William Siemering makes the telling point that for\nhis station, programs for the disadvantaged are not designed as a summer\ncooling factor. The decision to get with the movement came in 1965 and\nhas been an on-going element of the station’s policy and practice ever\nsince.\nITEM: In 1965, WBFO did a series entitled ”To Be A Negro” which\nmade it painfully clear to the white community what it is to be black.\nIt is common currency now to say, \"Let’s not do black programming only\nfor blacks; the whites need considerable information too.\" WBFO was\ndoing just that four years ago.\nITEM: A black student, Guy Colston, at SUNY-Buffalo, did a beautiful\ndocumentary on Resurrection City that didn’t make the NER circuit, but\nstill may have currency in light of today’s news that Resurrection City\nis to be rebuilt, first in Fairfax, Virginia and then later in Selma, Ala."
}