{
  "id": "d975-196",
  "text": "-2-\nA footnote must be that stations and networks recently found it tragically\nnecessary to program in response to the assassination of Senator Robert F.\nKennedy. NET scheduled a 2 1/2 hour memorial program for the Senator\nJune 7, including musical segments from New York's Lincoln Center t Cleveland's\nShiloh Baptist Church, and the Los Angeles Philharmonic. A eulogy was read\nby Theodore Sorensen, and a film shown of an interview with Senator Kennedy\nby James Day, manager, KQED, San Francisco. A NET Journal on \"This\nQuestion of Violence\" was rushed to completion for showing, June 10. Over\nthe weekend, the EEN and individual stations departed from their regular schedule\nto rebroadcast past programs which were appropriate in paying tribute to the\nSenator's memory.\nAs this report was prepared, the Ford Foundation announced major grants\nto educational stations and regional networks under the Foundation's Project for\nNew Television Programming.\nWith this financial aid, WGBHr Boston will produce 20 one-hour dramas on\ncontemporary Negro life. WI DT, New Yo.k will produce 39 one-hour program's,\n\"Where It's At,\" a series exploring the social, cultural and artistic life of Negroes\nin Harlem, the Bedford-Stuyvesant section of Brooklyn and Newark KLRN,\nAustin, Texas will broadcast 39 one-hour programs on Mexican-American com¬\nmunity affairs. \"Cleveland Now\" will be an hour-weekly series on plans to\nrevitalize the city, on WVIZ, Cleveland. WOLN, Erie, Pennsylvania will carry\n10 one-hour reports and discussion on local housing needs. KUHT, Houston,\nTexas will produce a consumer education series for low-income residents. KCET,\nLos.Angeles, will produce 70 half-hour programs on the daily drama of life in\nSpanish-speaking sections of the city. WYES, New Orleans, will broadcast 156\none-hour programs on issues related to the Negro community. In South Carolina,\nthe ETV network will provide 18 half-hour programs of information and education\non job opportunities for the unemployed. Several other stations and networks\nwill produce general public affairs series which, while not directed exclusively\nto \"ghetto\" problems or populations,may be expected to treat such issues directly\nfrom time to time. San Francisco's KQED will revive its 45-minute \"Newspaper\nof the Air.\" WITF, Hershey, Pennsylvania will produce a series of broadcasts\non significant community activites. WJCT, Jacksonville, will air 150 one-hour\nprograms on a news magazine format, treating local and state affairs. The New\nHampshire network will produce 34 one-hour news magazine programs for coverage\nof state and regional issues. The Eastern Educational Network will continue its\nseries of cooperative productions on public affairs and special events coverage\n(such as those described here. )\nBesides cooperative production with regional and national networks,\nmany ETV stations continue to produce and plan for special programming dealing\nwith local community problems, or put local perspective on the national issues\ninvolved.\nKCET, Los Angeles, has developed plans for two projects aimed at the\nNegro and Mexican-American communities. First will be \"Feedback for"
}