{
  "id": "d975-197",
  "text": "-3-\nAdvancement\", a soap opera-type series aimed at Spanish-speaking Angelenos,\nto introduce \"patterns of self-improvement\" to them. Another, \"Inner-City\nFestival\", which will bring entertainment ranging from the Los Angeles\nPhilharmonic to rockr and roll groups into ghetto areas for performances to be\nbroadcast by the station. One of the station's regular \"McElroy Reports\" (staff\ncommunity affairs newsman Leo McElroy) focused on ghetto employment with\nrepresentatives from Green Power, the California Minority Employment Council\nand Project Outreach.\nWETA, Washington, has expanded its TV Job Center program to four nights\neach week. Also, its series of evening-long Town Meetings on the educational,\nsocial, economic and political problems and issues confronting the District of\nColumbia public schools, and the station's role in the EEN \"Help Wanted\" program.\n131 Florida, the Director of Radio and ETV for the Department of Education\ncalled a meeting in the state capital of community leaders, station managers\nfrom across the state, and members of the State Advisory Board on ETV and\nRadio, to explore the efforts and prospects for improving the status of deprived\ncitizens and enhancing race relations. The State Department of Education will\nprovide video tape for programs -- and subsidies for TV and radio production\ncosts -- which concentrate on the problems and solutions that are being attempted,\nrather than paying excessive attention to violence.\nIn New Orleans, WYES broadcast \"An End To Talk\", a panel on race\nrelations. It provided participation by a large studio audience, and home viewing\naudience (by telephone). Moderated by a Louisiana jurist, the discussion turned\nout to be lively and candid. The panel included a law professor, a Negro dentist,\nand \"an angry unemployed black man, a powerful white shipbuilder, and a top\nLabor Department official, \" according to the local newspaper.\nIn Boston, the night that Martin Luther King, Jr. was assassinated, soul\nrock singer James Brown and \"The Flames\" were booked at the Boston Garden,\nand 15, 000 black youngsters were expected to show up (as reported by WGBH's\nHartford Gunn at the April 21, ETS Day meeting). Mayor Kevin White (who is_\nwhite), and Councilman Tom Atkins (who is Negro) were concerned that either a\ncancellation of the event or_a performance as scheduled might compound problems.\nAt the Mayor's request, WGBH (the only station that could send an all-black crew\nto cover the event) broadcast the performance live, repeated it later the same\nnight, and the following night. White, Atkins and Brown appealed to the viewers\nto stay home, and the program is credited with helping to control a potentially\ndisastrous situation.\nBeginning later this month, WGBH will broadcast its own weekly \"black\nmagazine\" (repeated once each week). \"Say, Brother\" will include news of the\nghetto, features on black people and activities, a forum for Negro opinion, and\na showcase for black artists, performers and entertainers. The production\noffice will be located in Boston's Roxbury ghetto, and people working on the"
}