{
  "id": "d975-232",
  "text": "2\nmust attempt to get back to some very rudimentary steps. The\nmost essential need, as I see it, is simple, direct contact between\nNegroes and whites. All Americans tend to stereotype others out\nof ignorance and instinct. There's a pervasive pattern now in\nwhich many Negroes generalize excessively about the attitudes and\ncallousness of white Americans. Perhaps more intensely, there\nis an excessive tendency by white Americans to regard the Negro\nas a figure of either listless subservience or one of criminal vio¬\nlence. Fear permeates black-white relationships today. Iam\nconvinced that most white Americans in the North, in particular,\ndo not have the remotest grasp of the problems, attitudes, frus¬\ntrations and aspiration of American Negroes. I suggest simply\nthat when a black man and a white man, or a Negro women and a\nwhite woman, or a Negro family and a white family spend any time\nat all together they Learn, and the fear is at least a bit diminished.\nI am reasonably convinced that more Americans have traveled\ngreat distances to make contact with and learn about individuals\nin opposite regions of the country or overseas than to make con¬\ntact with or learn about individuals \"on the other side of town. \"\nI suspect that more Americans have read Fielding's Guide to\nEurope than Baldwin's guide to the American ghetto. What I sug¬\ngest here is that educational television stations should seek as\nmuch as possible to give attention to the more normal life and\nattitudes of ghetto dwellers and Negro citizens. I think it would\nbe immensely valuable if educational television stations sponsored,\neditorialized for, or in any other way encouraged simple, direct\ncontact between black and white, rich and poor. This can be done\ndozens of different ways and through dozens of different channels:\nchurches, clubs, organizations, etc. This may all sound vague,\nbut the suggestion is instrinsically simple. What I'm talking about\nhere is a simple need for Negroes and whites to sit down once in\nawhile in informal situations and settings to talk, to eat together,\nto work together, to be together. The best application of such a\ngeneral suggestion must, of course, in specifics, be developed\nlocally.\n3. The educational television stations can give\nsome balance and perspective on race relations in America and"
}