{
  "id": "d975-27",
  "text": "V\n- 4 -\nway to communicate in the home or on the streets, but when these kids\ncome up against the job market they have to use another language* this\nis what weTre trying to give them.\" & & s\n_ ITil be passing along reports to related ideas, experiments, and\ntraining and hiring efforts by other educational radio and television\nstations as they com in. Several stations have reported a sincere\ndesire to hire blacks but point to a lack of preparedness on the part\nof job applicants. The Urban Workshop and the WTHS-TV project suggest\nstation training as one possible answer.\n. .. N°w ”hat about and your station? Silence doesn't necessarily\nindicate inactivity, but if you are involved, then why not take that\nnext logical step and involve yourself where the good things you are\ndoing can be shared at the national level? Let me ask you the fol-\nWhat programs for, by or about Disadvantaged citizens is your\nstation working on?\nWhat ideas are on the drawing board?\nCan you share funding solutions with other ETS stations?\nWhat good program ideas failed in their production and why?\nHow have you \"plugged in\" to the inner city or the rural\nghetto in your part of the country?\nWhere do you find most support for such programming?\ngovernment? School Boards? Church organizations?\nMunicipal\nAre you training anyone from Disadvantaged groups in com¬\nmunication skills with a view toward staff employment?\nHave you found hiring Negroes on your staff facilitates a\nmore meaningful station approach to this programming? If\nso, in what ways?\nWhat is the value of a black production unit?\nDo any of your programs get replay on local commercial stations\nwhere such stations have a larger coverage pattern than your\nIs the audio track for such programs being used by local\nradio? y\nThese are only a few of the questions. You are raising others\nevery day as you decide your own station’s approach to programming for\nthe Disadvantaged. It is your answers, based on your own first hand\nexperience that I hope you will share with us."
}