{
  "id": "d975-46",
  "text": "EDUCATIONAL\nCULTURAL\nBROADCASTING\nCOMMISSION\nMARYLAND\nNEWS RELEASE\nFOR IMMEDIATE RELEASE\nJULY 24, 1968\nMARYLAND E7V NAMES\nEXECUTIVE PRODUCER FOR URBAN AFFAIRS\nThe appointment of Walter S. Brooks as Executive Producer for\nUrban Affairs was announced today by Dr. Frederick Breitenfeld, Jr.,\nDirector of the Maryland Educational Cultural Broadcasting Commission.\nMr. Brooks was formerly National Target City Project Director for the\nCongress of Racial Equality*\nMr. Brooks is expected to work closely with the people and\norganizations in Maryland*s urban communities, establishing and\nlinking their activities and interests to program development at\nthe Maryland Center for Public Broadcasting now under construction\nin Owings Mills# His exclusive concern with urban problems and\nhis four part role as producer, production supervisor, talent scout,\nand coordinator of organized group viewing and \"follow-up\"* make\nhis position with Maryland ETV a \"first\" in the nation.\nA native of Havre de Grace and a graduate of Ansonia High\nSchool, Ansonia, Connecticut, Mr. Brooks served in the Air Force\nand the Post Office Department before becoming active in the civil\nrights movement.\nSince i960 he has participated in CORE, NAACP, SCLC and SNCC\nactivities in Maryland, Alabama, Mississippi and the Northeast. From\nChairman of the New Haven, Connecticut Chapter of CORE in I96I, he rose\nto national leadership in I965 as Field Secretary for CORE.\nIn 1966 Mr. Brooks was appointed National Target City Project\nDirector for Baltimore and a member of CORE*s Executive Council. In\nBaltimore he was instrumental in arranging for the funding of training\nprograms for inner city residents and for the improvement of communication\nbetween the Black community and the city.\nIn making today*s announcement Dr. Breitenfeld said, \"Mr. Brooks1\nposition as Executive Producer will give him the responsibility and\nfreedom we believe are essential to his serving Public Broadcasting in\nMaryland in the identification of needs and the development of programs\nto serve the urban community.\"\nFirst broadcasts from the Maryland Center for Public Broadcasting\nare scheduled for next spring.\nContacts E* B. Woodworth\n301-337-6652\n1101 ST PAUL STREET BALTIMORE MARYLAND 21202 TELEPHONE (301) 837-6652"
}