{
  "id": "d975-50",
  "text": "The FM Radio Service of the State University of New York at Buffalo, 88.7 me., 3435 Main Street, Buffalo, New York 14214\nJuly 2, 1968\nMr. Ken Clark, Project Director\nPrograms for the Disadvantaged\nNational Educational Radio\n1346 Connecticutt Avenue, N.W. ®\nWashington, D.C. 20036\nDear Mr. Clark:\nFirst I want you to know how pleased I am that the NAEB finally\nappointed someone to this most important position. 1 Have\"'long been\nH isappointed~that they had not done more in~~this area before.\nI am enclosing a number of materials on programs WBFO has pro¬\nduced and is planning in this area. Our record goes back to 1965 when we\ndid a series entitled, TO BE NEGRO, to let the white community know what\nit feels like to be a Negro in our society. One of our black students\ndid an excellent documentary on Resurrection City; we sent this to\nNER network but I don*t believe they distributed it and it is, of course*\nno longer current. We did a series called, NATION WITHIN A NATION, on\nthe Iroquois Confederation which several stations around the country have\nused and it is still available and timely. You will see from one of the\nenclosed program guides that we ran the guide as advertising in Buffalo*s\nlargest Negro weekly and sent this to our predominantly ’white subscribers\nas another medium of communicating black thought and culture.\nWe had offered the enclosed proposal to the Ford Foundation for\nfunding a studio in the black ghetto to be staffed by black personnel.\nWe have good black support for this idea but unfortunately we donlt have\nthe funds. I do plan, however, to go ahead with a more limited project of\nthis nature using some existing university facilities and staffing it with\nblack students who work at WBFO. You can see from some of the enclosed\nmaterial a description of a pilot project we had in this regard last summer.\nI don*t see this as a \"summertime only\" activity, and all our efforts are\nnot aimed at \"cooling it\" for the summer but to provide ongoing communication\nfrom this all too separate and unknown part of society.\nMy personal feeling is that the network being contemplated by the Ford\nFoundation will have little value if local stations are not also doing even\nmore to correct the problems in their own communities. They must have cred-\nA Member of the National Association of Educational Broadcasters"
}