{
  "id": "d975-6",
  "text": "-7-\nThe forum first took up \"City Government and the Black Community\"\nand then moved to \"Education and the Black Community\". Key civic leaders\nin their fields are questioned by blacks who make the questions hard.\nIt is hoped the forum series will continue indefinitely; the emphasis will\nremain local.\nAlso at WCED, a four part series is now in production (untitled at the\nmoment) featuring Miss Delfine Sisay, a native of Sierra Leone. . . a teacher,\npoetess with a strong background in African television.\nMiss Sisay's series will analyze and compare black work as differentiated\nfrom work by black people. Hers is a cultural affairs approach and early pro¬\nduction indicates WOED has a strong entry thereby.\nCONTACT: Sam Silverman, Program Director1 : '\n* * * *\nSPECIAL REQUEST FOR INFORMATION:\nSeveral stations have reported a desire to make stronger contacts in the\nblack communities of their cities. . . . to strengthen accurate feedback. But they\ndon't knowhow to go about iL If you have something to say on this subject, please\nshare it. No one has \"the\" answer, but some of you have worked out communica¬\ntions lines that click. Maybe your experience can help the rest of us.\nIncidentally, if you are working on program ideas that you'd like to share\nat once; or, if you want information about something some other station is doing\nand can't wait for the mails. . . .please feel free to call collect: (202) 667-6000.\nThe faster we can move our national dialogue, the more effectively this\noffice can serve you. Don't hesitate to pick up the phone.\n;|c\nNEXT WEEK: WETA, Washington, D. C.a look at a very unusual .\nseries doing something positive about job employment for\nghetto dwellers.\nKSPS, Spokane. . . .moving with a new idea that points up\nmisconceptions blacks and whites have about each other.\nEastern Educational Network. . . . Grant funds permitted a\nvariety of original programs, some of them concerning\nthe Disadvantaged.\nWUSF, Tampa. . . . working With a project to involving six\nETV and six ER stations in Florida."
}