{
  "id": "d975-70",
  "text": "Pa o-o s\nETV REPORTER\nJune 20. 1908\nMARYLAND EDUCATIONAL OFFICIALS AGREED AT A RECENT CONFERENCE TO RECOM-\nmend installation of TV antennas and distribution systems in all new school construction in\nthe state. At a two-day meeting called by Governor Spiro Agnew. educators from across the\nstate decided that this basic equipment should be a requirement for state approval of new\nschool facilities.\nThey proposed an immediate budgeting of funds for classroom TV receivers, and the develop¬\nment of a state purchasing plan which would assure the acquisition of compatible equipment in\nlarge quantities to effect cost savings. The Superintendent of Schools' Committee on Admini¬\nstration and Finance was given authority to assume responsibility for approving the coordinat¬\ned purchasing plan to be developed by the Maryland Educational-Cultural Broadcasting Com¬\nmission. the Division of Instructional TV of the State Department of Education, and the\nDepartment of Budget and Procurement.\nThe Broadcasting Commission's Engineering Division will assume responsibility for develop¬\nment of standard specifications for equipment to be installed in the schools. The conferees\nalso approved a recommendation calling for an amendment to the state aid formula which\nwould provide additional professional assistance to the school systems in coordinating TV\nprogram planning and scheduling between teachers, schools, and the ETV network.\nNEW FILMS. TELECOURSES AVAILABLE FROM —\nGreat Plains National Instructional Television Library. University of Nebraska. Lin¬\ncoln, Neb, 68508. \"Approaching Poetryproduced by WNDT-TV, Educational Broadcasting\nCorp., New York City, contains fifteen, 20-minute lessons and an optional 30-minute, in-\nservice program. The series is intended to help the classroom teacher present poetry to\nthose high school students who may never have been introduced to the subject. Pulitzer Prize-\nwinning poet Gwendolyn Brooks appears as an on-camera guest. Quad videotapes or a kine¬\nscope of representative lessons from the series, and a sample copy of the accompanying\nteacher's guide, may be obtained free, from the Greant Plains Library, which also has avail¬\nable a series of sixty, half-hour videotaped lessons, entitled \"TV High School. \" designed for\nnon-high school graduates to prepare them for the national high school equivalency test. The\ntelecourse, produced by the Manpower Education Institute of New York City, is divided into\nfive required areas of instruction: English. Mathematics. Social Studies. Science and Litera¬\nture. Preview samplers on either quad videotape or kinescope, and sample Home Study Kits\nmay be obtained by contacting the Library.\nTHE FCC TOOK THE FOLLOWING ETV ACTIONS DURING THE PERIOD JUNE 12-25:\nReceived request from the Nebraska ETV Commission for assignment of call letters\nKRNE-TV for new station in Merriman.\nAccepted for filing applications by Boston Catholic TV Center. Inc. . Andover. Mass.,\nfor a CP for a new ITFS station in Wood Hill, Mass., and by Duke University. Durham. N. C.,\nfor a new ITFS station at the Duke Medical Center. Durham. Also accepted for filing an\napplication for a license to cover a CP for new station WVTB by the University of Vermont\nand State Agricultural College, St. Johnsbury. Vt. , and an application to cover the modifica¬\ntion of CP to extend the completion date for WETX by The Greater Washington Educational\nTelevision Association. Inc., Washington, D.C.\nGranted CPs for Translator stations to: Joaquin Sierra ETV Assn. . Mt. Bullion.\nCalif.. for station on CL. 80 to rebroadcast KQED (Ch. 9) San Francisco, to serve Mariposa.\nCathey's Valley and Hornitos; for station on Ch. 12 to rebroadcast KQED to Coulterville and\nGreely Hill; and for station on Ch. 6 to rebroadcast,KQED to Twain Harte and Belleview."
}