{
  "id": "d975-72",
  "text": "Page 10\nETV REPORTER\nJune 26, 1968\nAMPEX CORP. , REDWOOD CITY, CALIF. , IS MARKETING A NEW CLOSED-CIRCUIT STU-\ndio TV camera designed for local or remote control in multi-camera operations. The CC-327\nfeatures a 9-inch electronic viewfinder; single cable operation; four-position, rear-actuated\n”C\" mount lens turret; rear operated image tube focusing; top and rear tally lights; composite\nor non-composite output with internally-gene rated industrial sync; and EIA RS-170 output. The\ncamera also features two-way communications for dialogue between cameraman and remote\nunit operator.\nAn optional remote control unit operates system power, beam current, target voltage, pedes¬\ntal and video gain. It is available on a single rack panel as a one or two-camera remote con¬\ntrol. The unit comes ready for mounting in a standard 19-inch relay rack. A switch on the\nback of the camera is used to select local or remote control.\nThe CC-327 camera sells for $2,700. Single camera control units are priced at $300 and a\ndouble camera unit carries a $550 price tag. A 25-foot length of cable with connectors is\n$250 and a 50-foot cable with connectors is $300. The camera is 25-1/2 inches long without\nlenses, and weighs 67 pounds.\nTHE FIRST ANNUAL INSTITUTE FOR INSTRUCTIONAL TELEVISION WILL BE HELD AUG. 19-\n30 at the studios of KCET in Hollywood, Calif. The Institute, designed to offer a comprehen-\nsive study of the elements of TV communication as they apply to teachers and others involved\nwith ITV, will consist of 10 3-hour sessions.\nThe course, sponsored by the Hollywood Chapter of the National Academy of Television Arts\n& Sciences, Community Television of Southern California, the Institute for Teaching of the\nCalifornia Teachers Assn., and the University of California Extension, Los Angeles, will\nbe offered on a credit or non-credit basis.\nThe program will feature discussions of ITV today, designing the TV lesson, writing the\nscript, using AV materials, directing, performing, utilization, and evaluating the telecast.\nAdditional information is available from the University of California Extension, P. O. Box\n24901, Dept. K, Los Angeles, Calif. 90024.\nTHE INAUGURAL CONFERENCE OF THE EDUCATIONAL TV AND RADIO ASSOCIATION OF\nCanada (ETRAC) will be held at the University of Calgary’s Banff Centre for Continuing Educa¬\ntion August 16-18. Approximately 120 delegates from throughout Canada are expected to at¬\ntend. Information is available from Convention Chairman L. Alan Robertson, CARET, Southern\nAlberta Institute of Technology, Calgary 41, Alberta.\nUPCOMING EVENTS IN ETV —\nJune 30-July 3: NCTA 17th Annual Convention, Boston, Mass. Contact: National Cable\nTV Assn., One Farragut Square South, 1634 Eye St., N.W., Washington, D.C.\nJuly 7-10: Educational Broadcasting Institute on Principles of Supervisory Management,\nCollege Park, Md. Contact: EBI Registration, NAEB, 1346 Connecticut Ave., N.W., Wash¬\nington, D.C. 20036.\nAug. 16-18: Conference of the Educational Television and Radio Assn, of Canada, Banff,\nCanada. Contact: L. Alan Robertson, CARET, Southern Alberta Institute of Technology, Cal¬\ngary 41, Alberta, Canada.\nSept. 9-13: International Television Conference, London, England. Contact: The Insti¬\ntution of Electrical Engineers, Savoy Place, London, W.C. 2, England.\nEDITOR'S NOTE: Mention of ETV REPORTER when inquiring about events listed here\nwill be appreciated."
}