{
  "id": "d1456-1",
  "text": "NAEB NEWS LETTER.._Jan. I, 1940.page 2\nprogram of experimentation directly related to the existing station\nAbout 20 applications are ending action by the Commission for new\nstations desiring to use frequency modulation* There are now 34\namplitude modulated stations and 20 frequency modulated stations\nauthorized by the Commission.\nBefore a permanent policy can be established with respect to either\nor both systems of modulation on frequencies above 25,000 kilocycles\nfor regular broadcasting service, studies and investigations must\nbe made regarding the relative values of the two systems, the patent\nsituation, the frequency needs of ell radio services, and whether\namplitude or frequency modulation, or both systems, should be recog¬\nnized for other services as well as broadcasting. It is also nec¬\nessary to consider the possible future effect that broadcasting on\nultra high frequencies may ultimately have upon standard broadcasting\nin the bend 550 to 1600 kilocycles.\nThe frequency bands above ooroximately 25,000 kilocycles are some\ntimes referred to as -very high frequencies'1-, \"ultra high frequencies\",\nor \"ultra short waves\". These frequencies possess relatively short\ndistance characteristics as compared with the loxver frequency bands,,\nThe signals are subject to rather wide diurnal and seasonal variations\nin signal strength at distances beyond the horizon; therefore, as\na practical matter, these frequencies may be said to be useful for\nbroadcast service up to about IOC miles only*\nMajor E. H. Armstrong, professor of electrical engineering at\nColumbia University, appeared as a -witness in behalf of frequency\nmodulation at the Federal Communeations Commission engineering\nhearing in June, 1936. On the basis of testimony of experts who\ntestified at this hearing, and after studies had been made Jointly\nby the Commission’s Engineering Eepartment and the Interdepartment\nRadio Advisory Committee, the Commission and the President adopted\npermanent allocations above 25,000 kilocycles for the various govern¬\nment and non-government radio services*\nAmplitude modulation h p been used as the standard system for\ntransmitting speech . ho by radio. It is the only system of\nmodulation which ie n-,e& by the existing services operating on\nconventional freqi • a ■. . i.e,, below 25,000 kilocycles.\nThe claimed chief advantages of the two methods are set forth briefly\nas follows:\nAmpl1tude Modulation\n1. Amplitude modulation utilizes a much narrower band of fre¬\nquencies, i.e,, about one-f fth of the frenuenoy bend required for"
}