{
  "id": "d1456-3",
  "text": "NAEB NEWS LETTER. .Jen. 1, 1940.... .page 4\nOur bulletin for the second semester, copies of which will be sent\nyou as soon as they come off the press, outlines sixteen School of\nthe Air programs for the second semester. Although our isolated\nsituation does not permit us to brag about huge numbers of enrollees\nas you blessed middle westerners can, we have increased our enroll¬\nment approximately three hundred percent over last year, which is\ngratifying to us.\nPrograms which will be continued from the first semester are:\nAmerican Wildlife, High School Science, What’s News, High School\nHorae Economics, Land of Make-Believe, Let’s Sing, Mr. Georgraphy,\nThe Drama of Amerioan History, ISusio Appreciation, and Plays in\nMiniature. New Offerings include one vocational guidanoe program,\none panoramic review of American literature, and Mour state\", which\nis self-explanatory.\nIn addition to these regular broadcasts to the classroom, there is\nevidenced a growth of interest in the station by various departments\nof the college. For instance the Speech Department is responsible\nfor a half-hour roundtable once a week, as is the Department of\nSociology and Political Science. The Graduate School of Sooial Work\npresents a weekly drama under the general heading, \"The Newest\nFrontier of Human Knowledge\". The School of Religion offers a\nhalf-hour weekly \"History of Religion\", and the English Department\ngives three weekly programs.\nOne new program will oh is not being publicized in the School of the\nAir bulletin is a Smith-Hughes agricultural series. As in several\nprevious school programs, this is being produced experimentally for\none semester before being offered to all of the schools.\nWe have a set of sixteen scripts on high school etiquette called\n\"Bob and Mom\", dealing with a series of situations such as must be\nmet by the average high school student. Most of these scripts have\nworked out very well. If any members of the N.A.E.B, would like to\nread a couple of these with possible production in mind, we should\nbe glad to furnish them. If, after perusal, the entire series is\ndesired, it will be available. Of course, we’re as poor as the\nproverbial church mouse, so the cost of mimeographing and mailing\nwould have to be taken ©are of at the other end of the line.\nIncidentally, this offer holds for any of our programs in which\nanyone might be interested. Any similar kind offers?\nM. Reid White"
}