{
  "id": "d1182-16",
  "text": "-17-\n-_ FEDERAL C0M1UNICATIONS COMMISSION\nAugust 1, 1948 (Educational) August 31, 1948\nNWS—APPLICATIONS—ACTIONS\nr- ______— --——=\nLai-Pa^R EDUCATIONAL FM STATION AIMDMENT OKAYED BY FCC.\nProposed amendments to FCC Rules and Regulations making possible non-commercial, .\neducational FM stations with power of less than 10 watts were made final August 18\nby an FCC order.\nThe order said that only three comments on the proposed amendments were received,\nwith two supporting the change and one suggesting engineering changes beyond the\nscope of the proposal concerned.\nWHAT LOW POWER FM MEaNS\nFavored by the U, S. Office of Education, low-power FM_tiunsmi11ers_ ar e_^l re ady\nin ap-DlicationVtages at 'several'universities, ' incJU^i^^ -IM\n^q^q^as_juccessfnlly broadcast on an experimenfcj^^^\nTia-inp- a pi watt transmitter and covering an...area.\nLow-power FM broadcast is to be authorized in the 88-92 kc band, now allotted\nto the non-commercial educational service. The FCC said \"such a station could\nget on the air for the expenditure of a few thousand dollars, covering an area\n2 to 5 miles in radius.\" \"General Electric can make transmitter deliveries for\nthis new plan with iu 30' to 60 days.\nThe wav is now' open to literally hundreds_of,\nuniversities to seive student and adult population^tJ^wgcpst--and to make\nthelrTnitial entrance into FM broadcasting through 1 owtpower_Fr/I.\ngny »s \"LAST CHANCE\" 7;ARMING TO EDUCATORS TO GRAB rFF,_CHANNELS .\nBoards of Education, colleges and universities have been urged^to make full use\nof radio in education by Federal Communications Commission Chairman.Wayne Coy\nat the second annual conference on radio in education at Indiana University\nAugust 29•\nCoy pointed out +h°+ ^ +** dove of radio. educators had teen_interested |\nhi. so-that educaM°5Sl-StiSS£§3t§_;XSi!S--£.sSSi^M--i£Pin ^ °af\nwr Now education has an opportunity with 20, channels allocated, for_Be_nonr.\n^g^i5 educational FH servige^enpugh to\nhe said.' Although there was general rejoicing fgurjjears ago..ghenjihese..channels\nthi^TITe now o~nly~17 such stations in operation aPO-Q-fireJffidgi:\nconstruction.\nnnrrw that radio channels are too ._yaluaag_Lo_beJLen jn^dleness^Jie-BrsdigM\neducators would lose their second and perhaps last chance to own_ad^e£abg-l£gl£\n•^m~^TV7tV.lo^ unless they~talce ad-vantage_ef_tbeir opportunity, (oont.next page)\n(The Federal Communications Commission's annual publication entitled \"Statistics of\nthe Communications Industry in the United States” for the year ^ e\n1946, is now on sale by the Superintendent of Documents, Government Printing Otii\nWashington 25, D.C., at 55 cents a copy. _ __"
}