{
  "id": "d1182-20",
  "text": "FCC APPLICATIONS (FREQUENCY MODULATION) COLLEGE, UNIVERSITY, INSTITUTIONAL (cont.)\nFor CP Modification\nWWIH-FM-Loyola University, New Orleans - Modification of construction permit (BPH-\n201, as modified, which authorized a.new FM broadcast station) to change ERP from\n190 KW to 11,685 KB, transmitter (Make, type and power), decrease antenna height\nabove average terrain to 378 feet, decrease overall height above ground to 398\nfeet and make changes in antenna system.\nFor Construction Permit\nWPTL-FM- Providence Bible Institute. Providence. R.I.- Construction permit to change\nERP from 2.5 KvT to 2,880 tvatts and make changes in antenna system.\nFor CP Modification\nBHKB-FM- .State of Wisconsin, State Radio Council, Madison, Wis., - Mod. ifi cat ion\nof construction permit (BFED-86, which authorized a new FM broadcast station) to\nchange frequency from 89.9 to 89.3 me., type of transmitter to RE-1-520 A-DL,\ndecrease overall height above ground to 454 feet and make changes in antenna system.\n*** ***\nFCC -ACTIONS (FREQUENCY HCBULATION) COLLEGE, UI^IVERSiTY, INSTITUTICFAL\nGranted License\nUHAD-FM-State of Wisconsin, State Radio Council, Madison, Bisc.. - Granted license\nfor new non-commercial educational FM stationfELED-287\nGranted Construction Permit\nLewis College of Sc:'1 wee md Technology. Chicago, Illinois;-North Shore Broadcast*\ning, Co., Inc.., Evanston, Ill; Lewis College of Science and Technology, Class B,\nChannel. 226, 93.1 me., 34 KW., 535 ft.; estimated cost $72,842 (Docket 8772),\nFor CP Modification\nKFUO-FM-Evangelical Lutheran Synod of Missouri. Ohio and Other States, ClaytontMo.-\nModification of construction PgEfflJt (BPH-V02, as modified, which authorized a new\nFM broadcast station) to change/to the Lutheran Church, Missouri Synod.\nGranted License\nIpUB-Mary Hardin-Baylor College. Belton - License to cover construction permit\nTB3-PH-1033, .as. modifiedy which authorized a new FM broadcast station.\nGranted GP Modification\nKQAG-FM- Stillwater,Okla. - Granted modification of CP for extension of comple¬\ntion date to 2-15-49. (BMPED-137)."
}