{
  "id": "d1182-3",
  "text": "-4-\nP. M* Collier, Secretary of Debating League, University of Oregon, Eugene, Oreogn.\nL. A* Mallory, Coach of Debate, University of Yfyoming, Laramie, Yfyoming.\nE. R. Rankin, Director of University Extension division. Chapel Hill, Worth Carolina.\nFROM MR* ALLEN MILLER, RADIO DIRECTOR, UNIVERSITY OF CHICAGO, CHICAGO: \"VJe have done\nno broadcasting of dramatic productions from the University studios,\n\"Tie are, however, faced with the same problems you mentioned since we are considering\nthe broadcasting of student productions this year. Consequently, if others are able\nto give you the necessary information, we would appreciate the report you suggest\nsending to all members of the Association of College and University Broadcasting\nStations.\" (NOTE—In the course of the next few days—after I have received replies\nfrom some ten or twelve states—I expect to send out a special bulletin on the pro¬\nposition of broadcasting radio dramatic productions. This will give you the reaction\nof the various station managers from over the country.)\nFROM MISS GLADYS L. BAKER, ASSISTANT PROGRAM DIRECTOR, STATION KFKU, UNIVERSITY OF\nKANSAS, LAWRENCE: \"Mr. Ingham has handed me your letter of September 30 regarding\nthe plays broadcast over this station*\n\"We have not to date broadcast any plays, although we have and still are considering\nthe matter. Last year Professor Allen Crafton, Head of the Department of Speech and\nDramatic Art, expressed his willingness to cooperate in broadcasting plays. He sug¬\ngested that we write the Samuel French Company regarding the royalty charges. In\nreply to Mr* Ingham’s letter stating our case we received the following answer:\ni-— We suggest you submit a list of the titles you are interested\nin for radio broadcasting, and if available, we shall be glad to\nquote you the best possible royalty terms• The fees listed in our\ncatalogue apply only to amateur stage presentations.’\n\"We submitted Professor ^lien's selection of eleven one act plays each taking ap¬\nproximately twenty minutes.* Vfe received the following reply:\n’Yours of the 10th at hand. The following are available for\nbroadcasting over Station KFKU, each play at a royalty of $10.00\nfor one broadcast;-\nA Minuet, Spreading the News, Judge Lynch, No’Count\nBoy, Constant Lover, Maker of Dreams, The Boor,\nRosalie, Yiorkhouse Ward, Noble Lord,\nSmarty’s Part is not available at present.’\n\"Professor Crafton has suggested the possibility of a series of famous scenes from\nShakespeare and other well known dramatists. As our budget does not cover the ex¬\npense of royalty we have not accepted the offer of Samuel French.\n\"We shall be glad to receive any information and suggestions you may have regarding\nthe use of plays by college stations. Professor Crafton is particularly interested\nin securing information regarding actual production of the play.\" (NOTE—I wish to\nstate here the experience ViNAD had with the V< alter H. Baker Company,, Boston, as well\nas other compani*s to whom we applied for permission to broadcast plays over our\nstation--without paying royalties.. The letters below, written on November 8, 1930,\nand reply on the part of the company November 12, 1930, are self-explanatory. *\npersonally believe any of the companies will grant permission to our member stations\nif all interested program directors will join in a request to them."
}