{
  "id": "d1182-9",
  "text": "-10-\nUAFRE GRGMIZED--STA1IDAFDS—(Continued)\nCommittee on Accreditation\nCommittee consists of Judson Williams(Texas College of Mines), Kenneth Bartlett\nTjyracuse University). Thomas Rishworth (University of Texas). Russell Porter\n(University of Denver), and Judith Waller., (NBC).\nStandards of Admission\n(Standards set forth by the UAFRE, are basic and minimum standards\nrequired for admission and not optimum or ideal, it is explained.\nThey are described as an \"irreducible minimum.\")\nA. Curriculum\n1. Four-year college or university program leading to the bachelor's degree.\n2. One-fifth to one-fourth of the total credit hours must be in specific\nradio courses.\n3. A definite core of radio courses required of all radio majors must include:\n(a) Introduction or orientation to radio\n(b) Continuity writing\n(c) Announcing\n(d) Radio advertising and sales\n(e) Program planning and building\n(f) Production\n4. Other courses in radio may be elected in accordance with the student's\nindividual interest, capacities, and abilities.\nB. Staff and Teaching Personnel\n1. At least one-half of the credit hours taught in radio must be under the\ndirection of instructors with a record of successful commercial experi¬\nence in radio.\n2. At least one-half of the*courses must be under the direction of instructors\nwho meet the educational and academic requirements of the non-professional\ndivisions of the institution*\n3. Frequent refresher courses or opportunities for training within the in¬\ndustry should be' made available to the staff. i\nC. Laboratory and Ecuipment\n1. Laboratories should provide a broadcasting outlet such as a university\nstation to which students have adequate access, or regular broadcasts over\na commercial station, or wired-wireless broadcasting to the campus.\n2. Logged broadcasting must be a regularly scheduled, activity either as a\nfunction of one of the above outlets or as a. separate broadcast activity.\n3. Equipment used in professional training must be such as to allow the\nstudent a general acquaintance with all problems of station operation."
}