{
  "id": "d247-102",
  "text": "Internationally* production of quality recordings of distinctive\nprograms, nowhere els© available in the United States, would help us to meet a\ngrowing need in international good will on behalf of the United States, which\nno one else is meeting. The United States Information Agency, various other\nUnited States Agencies (such as the 10A and TCA), and numerous international\nagencies (UNESCO* the European Broadcasting Union* the International Music\nCouncil, the International University of the Air, etc a, in all, of which the\nNAEB is the designated representative of the United States on behalf of\neducational broadcasting) are constantly begging u* to meet this need and\ndemand *\nD agnostically wo are attempting to upgrade the content, production\nstandards, and technical quality of educational broadcasting as a national\nresource and movement. He bslieve that converting to Arapex equipment for all\nprograms distributed for broadcast would provide an example and leadership which\nwould be felt at the local station level as well. The new educational FM\nstations which are going on the air at an increasing rat© particularly need this\nhigh quality in programs used, as well as encouragement to purchase such equipment\nfor their own use. As soon as possible we would also like to begin, on a gradual\nbasis, to distribute stereophonic tapes for educational use, both in the class¬\nroom and for general and adult education uses0\nThe NAEB has always been distinguished by equal interest in both\ntelevision and radio as instruments whose potential has never been fully realized\nfor education. In many solid research studies (in Wisconsin* Philadelphia, and\nmany other places) it lias been found that for certain subjects (music appreciation,\nin-school broadcasts requiring student activity while listening, taking directions\nand notes at the same time, etc*) radio is not only more economical, but also\nbetter than television. However, although in recent years, when television has\ncaptured the attention of Foundations and others, w© have been able to secure"
}