{
  "id": "d247-11",
  "text": "November 10, 1959\nRef. #-23\nDr. Harry J. Skornia\nNAEB\n14 Gregory Hall\nUrbana, Illinois\nDear Harryl\nThank you for your note. Since I am swampeo, I can only comment briefly\non your letter to Dick Hull. Frankly, I am quite distressed over what\nSEEMS TO BE THE BEGINNING OF A VENDETTA WITH JACK WHITE AND THE CENTER.\nMany of us have strong attachments to both NAEB and the Center anO feel\nTHAT EDUCATIONAL BROADCASTING CANNOT AFFORD TO HAVE A SPLIT BETWEEN THE\ntwo. Surely now that the Board has voted to advise the radio planning\nCOMMITTEE THAT THE NETWORK SHOULD STAY UNDER NAEB, WE CAN BURY OUR\nPASSIONS AND SEE WHERE WE CAN WORK CLOSELY WITH THE CENTER. I THINK IT\n15 THE HEALTHIEST DEVELOPMENT THAT THE CENTER IS GOING TO TAKE OVER\nFUNCTIONS OF BFA* If WE ARE COLDLY REALISTIC—AND 1 DON*T THINK WE ARE—\nWE MUST CONCLUDE THAT THOSE WHO INSTIGATED BFA SURELY WOULD CONTINUE TO\nOP.RATE. I AM AT A LOSS TO UNDERSTAND YOUR POSITION ON THIS. WlTH LRt\nand Airborne, Jack had to act quickly.\nIt seems to me that NAEB and the Center ought to have the closest liaison\nIN THE FACE OF THIS LATEST BOONDOGGLE WHICH HAS FAR MORE SINISTER IM¬\nPLICATIONS FOR LOCAL CONTROL OF SCHOOLS THAN ANY DEVELOPMENT THUS FAR IN\nEDUCATIONAL BROADCASTING. So STRONGLY DO 1 FEEL THIS IS THE CASE THAT I\nsent James Armsey a two-page blast on the Ford Foundations inconsistent\nPOLIGIES.\nIt seems to me that far from trying to throw hooks into Jack, you ought\nTO MEET WITH HIM IN AN EFFORT TO DETERMINE WHAT OUR COMMON COURSE OF\nACTION OUGHT TO BE. To BE SURE, WE MUST RESIST ANY ATTE PT TO HAVE A\nSUGAR DADDY (SUCH AS FORD) TELL US WHAT WE SHOULD BE} AND WE SHOULD MAKE\nIT CLEAR TO JACK THAT WE HAVE CLEARLY DECIDED AT DETROIT THAT NAEB WILL\nRUN ITS OWN AFFAIRS. THIS DONE, WE CAN DETERMINE WHERE WE CAN WORK TO¬\nGETHER. Remember, you now have a TV Board and a Radio Board which will\nGARRY A GREAT DEAL OF STRENGTH FOR NAEB. I THINK JACK MIGHT NOT FULLY\nREALIZE THE SIGNIFICANCE OF THIS MOVE, ADOPTED UNANIMOUSLY.\nI STILL CANfT DECIDE WHAT HAPPENED TO ME RE! INVITING JACK TO ATTEND\nBoard Meeting. However, that*s water over the dam. I would like to\npoint out that the TV Managers gave Jack a unanimous vote of appreciation\nFOR HIS GREAT WORK THE FIRST YEAR AS CENTER PRESIDENT. | MENTION THIS TO\nEMPHASIZE THAT WHILE WE MUST HAVE A STRONG NAEB AND AR WILLING TO PUT IN"
}