{
  "id": "d247-169",
  "text": "Present:\nMINUTES\nNAKB EXECUTIVE BOABD HEFTING\nIITINOIS CENTER , LASALLE HOTFX, CHICAGO\nJANUARY 23, 1959 — 10:00 A.M.\nWill lam Harley, Jack McBride, Robert. Sehenkkan, Gaaydon Ausmus,\nRobert Coleman, Keith Fngar, Harry J. Skornla\n1.\n2.\nu.\n5.\n6.\n7.\n3.\nColeman's financial report ( attached) presented and approved unanimously.\nBrief report from Harley re IFRT: .\nMl Terminal p,' nt fr m rord expires Dec. di> ivtv\n(21 FCC .Jill undoubtedly move on UHF problem by spring; JCE!T watch¬\ning closely to see education's Interests are protected in what-\never steps ar^ t aken*\nDate of next board meeting set for Columbus as follows:\n3:00 F. ., Monday evening. May l;., 1959\nAll day, muesday, May 5, 1959\nUnanimous a -novel of Cohn-Marks bill of 1 2600.00.\nConvention Ians and jurlsdlctl ns discussed. Kay I,ardles committee\nhard at work and Skornla is to confer with them Feb. 13, In Detroit.\nRegional conferences were dlsucssed. Harley reported on Region IV meeting\nIn Minneapolis, (Jan. 15) and on rlans for Region III meeti-g. Fast\nLansing, E©b* 19-20*\nBrief discussion on SAFE c nsitlutlo and observatl ns that revisions\nare a natural d evelorment of growth. Expected Kilos, Marks, Harley will\nmeet shortly to discuss possible changes 1-eluding provision for\nfttll-t\" e president.\nBrief discussion of NAEB Headquarters and prospects for future growth.\n9# NAEB committees discussed\nA,\nB.\nC .\nD*\nProfessional advancement:\nNecessity for continuation of seminars asserted.\nMemberships: ‘ ew drive for individual memberships to be launched\nshortly. Brought out that criteria for is dividual membershi\nurgently needed* under direction Lay Hurlbert. He, Harley, Schooley\ntonBet soon to develop \"rationale” and promotion plans. ^rley\nurged all members of Board to take out memberships. Center s tuft\npromised to do member of committee 195o» likewise.\nInternational relations: NAEB'a role in t Is field reviewed. A*ax\nAlex Sutherland, attended to give hi. observations. Harley read\nexchange of corresoo dence with SI Siegel, long tiiie chairman of\nthe committee, relating to question of his continuance !n this\nposition while also 90 Ive In BFA, Harley to go to ew -ork and\ndiscuss with 3! before making final decission.\nPublic realtlons: Project of an 5TAFB logottpe or signature slide\nfor all member tv stair1 ns to use at sign-off -- received favorable\nresponse. Being eveloped by Sulzer*"
}