{
  "id": "d247-178",
  "text": "2.\nThis raises the question about where NAEB funds are kept and how they are ad¬\nministered. 'We’ll try to explain this, herewith,very briefly.\nAt the University of Illinois we have two funds. The first, called Trust: NAEB,\nis basically for the Network operation, Income for this fund comes from Net¬\nwork fees, sale of publications, dubbing and sale of tape recordings, mailing\nand handling charges, and reimbursable services (which generally means admin¬\nistrative charges for work done by the staff in connection with funds handled by\nColeman). All expenses of the Network operation are paid from this fund. In\naddition, $4,100 per year is currently being transferred from this fund to Trust:\nKellogg (explained below) in accord with our agreement with Kellogg that we should\ncontribute earned income to the operation of Headquarters. Also, starting with the\n1957-58 fiscal year, $1,500 per year is taken from this fund and put into a “Re¬\nserve for Replacement of Major Equipment” (Duplicating equipment, primarily).\nThis fund has managed to show a balance, sometimes fairly large, sometimes\nsmall, at the end of nearly every year recently. This has enabled us to build up,\nin Urbana, a general reserve for future Headquarters and Network operations in\ncase this becomes necessary.\nThe other fund handled in Urbana, called Trust: Kellogg, receives as income the\nannual Kellogg grant, plus the $4,100 mentioned above (transferred from Trust:\nNAEB). This fund is used to support the Headquarters operation, provide travel\nfunds (for committees, officers, staff. Executive Committee and Board), and pro¬\nvide funds for Regional meetings. (Until this year it also provided for one Sem¬\ninar a year. There were no funds for this year since last year the Foundation\nagreed to give us twice the normal amount so that we might hold the Research\nSeminar). Any balance remaining in this fund at the end of a fiscal year is de¬\nducted from the following year’s grant from Kellogg. (Details of both of the\nabove accounts will be explained in the financial statements for December 31,\nwhich will be forwarded to you as soon as possible after receipt of the neces¬\nsary “papers** from the University Business Office.)\nTreasurer Coleman handles all other funds — income from dues, Newsletter and\nToumal subscriptions, sale of albums, and all funds received from sources other\nthan the Kellogg Foundation. In general these are divided into two accounts.\nOne of these receives income as indicated above, other than fund grants, and\nthe expenses from this fund are regulated by the Board, mainly through annual\napproval of what is called the “NAEB” budget, to distinguish it from the budgets\nhandled through this office. Fund grants are handled separately by Treasurer Robert\nColeman and an accounting is kept of the income and expenditures for each fund\nproject. 5% of each grant is transferred to the general account discussed above\nto cover administrative costs. Mr. Coleman also has a general NAEB reserve fund\nwhich has been built up gradually over the years. Sometimes the Board makes\nspecial appropriations from this fund. In general, any balance left from the opera¬\nting budget at the end of the year is transferred to this reserve, and any deficit in\nthe operating budget would be covered by transfer of funds from this reserve.\nCopies of the NAEB budget, discussed above, as approved by the Board in Omaha,"
}