{
  "id": "d247-24",
  "text": "I believe the question was raised a- to how the National Audience\nBoard could become a more effective organization. Obviously the\nanswer to that question- constitutes the burden of my work. We\nattended the UNESCO Conference and gained from it--we attended\nyour conference and gained ircr it. These are the steps through\nwhich the Board is made a more effective organization. We lino\nourselves at present in a rather extraordinary dilemma: we are\nknown at the top but not at the bottom and not in between. Believe\nme, the Board is well known to Stanton and well known to Sarnoff,\nbut not known at all in between. We are about to take a series of\ntrade advertisements, which I think will greatly improve the\nsituation. Frankly, I sent Hr. Ramins to Detroit so that he could\ntalk to some of the automobile people, while Professor Winnie and\nDale Clark would devote themselves almost exclusively to the acti¬\nvities of your convention, it is absolutely necessary for us to\nuse this dual approach to the implementation of policy, if we are\nto survive. Although the actual cash realized by the negotiations\nis negligible, it does help satisfy the answer to your question as\nto how we are to become more effective. Every contact with a major\nagency, every contact with a major sponsor increases the effecti¬\nveness of our work.\nI understand the question was asked as to how we can help each\nother. X think if your people were to call attention to our work,\nwhich, by the way, is carried on by many of the same p* pie who are\ninterested in yours, that would be a very effective contribution you\ncould make to us. On our part, may I call your attention as an\nexample, to the great amount of space that v? gave to Alabama Edu¬\ncational Television in the issue preceding the present Newsletter.\nBelieve me, this Newsletter is read by the industry and the press\nas well as by the public.\nAs to money, I do believe that Mr. Ramin could be helpful by\noffering you his professional services on what might be called a\ncontingency basis--and I am suggesting this mystlf. ft did not\noriginate with Mr, Ramins. He does have some wealthy clients who\nmight very well be induced to become interested in your organization\nbecause their contributions are tax deductioie. since we are honor\nable people, I'm sure you will understand I am making no guarantees\nwhatsoever.\nThis is my over all analysis of the relationship between the\nNational Association of Educational Broadcasters and the National\nAudience Board. 1 should be pleased to hear from you. Also, it\nmight be possible that we could afford an associate membership\nsit we are eligible. I believe this matter was broached in Detroit.\nVery truly yours,\nPeter Goelet"
}