{
  "id": "d247-40",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nOFFICE OF EXECUTIVE DIRECTOR\n14 GREGORY HALL\nURBANA, ILLINOIS\nOctober 14, 1959\nMr. William Harley\nStations WHA-AM-FM-TV\nUniversity of Wisconsin\nMadison, Wisconsin\nDear Bill:\nAttached to this letter are two items. One is the budgetary analysis\nof our financial status (which I’ll have for Board meeting).\nThe other is a listing of some serious afterthoughts I have, based on\nthe belief that a Washington move will cost at least $10,000 (in\nduplicate equipment: photo machines, mimeo, etc. facilities, etc.,\netc., moving costs, salary adjustments, etc.) before thinking of\nadding additional staff. And at least an assistant (plus a secretary)\nwould be essential or, again, I’d be bogged down with details,\nvisitors, etc.\nThis may all irritate you, a little. Frankly the fiscal picture, once\nwe get it all down, is not as good as I thought it would be.\nAs I said earlier, all this would be changed if we had the necessary\nfunds to provide the necessary staff, etc.\nThese simply raise the question about our present fiscal ability to\nmove without Skornia’s possibly \"cracking up.\" For, by dint of trying\n(each night, week-ends, etc.), to help edit Washington report, prepare\nall sorts of reports., etc., I've about had it. And I don’t think I'm\neither slow or inefficient.\nAnd, not done, are scores of even more important things: Foundation\nrequests, professional development plans, etc. Not sure how much\nadditional frustration I can stand-for each year has brought more\nwork, and the Washington move will mean another large increase-• I\nmight as well not go if I'm to be unable to work closer with Lenny, the\nvarious academies, etc. Meetings of this sort take time. If we could\nmove me, getting assistant and secretary there, and rental, and a year\nlater move the rest, I’d like it better. But we need money first. I\nmake decisions on personal fiscal commitments only when it makes sense.\nThe recent accident taught me on how thin ice we are skating.\nSincerely,\nHJS/dp\nExecutive Director\nEnclosures"
}