{
  "id": "d247-41",
  "text": "Estimate of Financial Future\nHerewith an estimate of income and expenditures from all presently known source a until\nDecember 31, 1963, This of course includes no foundation grants, since none are currently\nexpected, or in negotiation. It assumes that any increases (of a minor nature) in income\nfrom more members or more Network members will be offset, in part at least, by the. increased\ncost of servicing -these members, as well as other steadily rising operational costs. No\nadditional staff is provided for, and no \"Washington move\" expenses are included, and no\nsalary increases are listed. In other words, all figures given have been based on present\nbudgets. During the course of the present three-year grant from Kellogg, tbs MSB is\ncommitted to contribute, from its own income, the following amounts to the budget of the\nHeadquarters operations 1959,*60 — *09>165J 1960-61 •» (>19*165$ 1961s62 — 029>165, On the\nbasis of present operations it is calculated that only 04,165, annually, of the sums\nT&etied can be expected to accrue from the Urbana (essentially the Network) operation. The\nbalance of this contribution each year must come from the NAEB General Administrative budget,\nadministered by the NAEB Treasurer.\nAnalysis of NAEB General Administrative account;\nBalance, 6/30/59 ,\nProbable expenditures, 7/3/59 ** 12/31/59\nProbable balance, 12/31/^9\nProbable surplus, I960 (based on proposed budget)\nLess Contribution to Hq. Opn. (1959-60)\nProbable balance, 12/31/60\nProbable surplus, 1961\nLess Contribution to Hq. 0pn» (1960-61)\nProbable balance, 12/31/61\nprobable surplus, 1962\nLess Contribution to Hq. Opn. (1961-62)\n0 8,322.50\n5,000.00\n8,322.50\n15,000.00\n8,322.50\n25,000.00\nLess Complete Hq. Opn, support, 7/1 - 12/31/62\nProbable deficit (Gen. Adrn., incurred in covering Hq.\nmaintenance at present level), 12/31/62\n010,702.12\n5,000.00\n^WTSZ\n3,322.50\n-6,677.50\n-16,677.50\n-25,951.50\n0-10,281.88\ntlrbana Account;\n.'Reserve, 6/30/59 (CanH assume annual increase due to commitment\nto help underwrite annual contribution to Hq. Opn.)\nLess probable deficit in General Adm. (from above)\nProbable total reserve, 12/31/62\n039,778.95\n-10,281.88\n025,7197707\n1963 Operationsg\nTotal Incomes\nNetwork\nUrbana non-Network\nGen. Adm.\nTotal Expense *\nNetwork\nHeadquarters\nGen. Adm.\n1963 Operating Deficit\nLess probable reserve, 12/31/62 (from above)\n^ Probable deficit, 12/31/63\n036,575.00\n4, 165.00\n25,122.50\n036,575.00\n51,903.00\n17,100.00\n066,162.50\n105.578.00\n29,h?7>07\nr.This reserve has been accumulated (in the Network budget) to cover replacement of present\nduplicators (value - 020,000.00) or other capital equipment replacement. Commitment of\nthese reserves for other purposes would leave no capital replacement budget for our presently\nnearly worn-out Network duplicators. A grant for new Ampex or other equipment would of\ncourse free this last reserve for other uses."
}