{
  "id": "d247-53",
  "text": "Mr. William G. Harley, Page S, September 18, 1959\nportation ? Will I need to get a second car? Etc ., etc . ?\nHow about college? I don’t know of any good state universities (or\nequivalent) there. American University is a social sciences and\neconomics school. Mary likes music and art, etc. Lee likes science\n(Johns Hopkins?). Do I then have to send the kids away to college\nat $2,000 a year, instead of the few hundred it would cost here? As\nyou can see, if we don’t “bookkeep’’ this, and I fear it would be\nridiculous to do so, the move could cost me several thousand a year\nin this and similar items alone.\n7) Housekeeper:\nMrs. Ballard is not only honest, dependable, and a virtual mother\nto the kids, she does all our laundry, cleaning, cooking, etc. The\ncost is $12 0 a month plus social security. What do I pay in Wash¬\nington — if I can get a person of equal integrity? (I suppose if I’d\nremarry this problem would be solved. Maybe a committee should\nbe set up on this 1) If, as I expect, it would cost $200 or $250 (as\nsome others pay), you can see my problem. Actual moving costs\nwould, of course, be expected from NAEB. They’d be very low com¬\npared to these other considerations — which reminds me of “living\nallowance’’ adjustments which the Foreign Service makes as one\nchanges posts.\n8) Father, Families, etc.:\nTwice a year I go with the kids to visit Dad and relatives in Michigan,\nMinnesota, etc. One day’s drive from here. This is really getting\ntoo picayune, I fear, but I see this as an illustration of other small\nadditional expenses, and which together are a factor in my private\nplans. It is a little like title costs, interest on money which needs\nto be borrowed if I buy there before I sell here, etc. And if I don’t\nbuy within a year I have capital gains (on my Bloomington house, if\nnot here) to pay.\nI’ll absorb all I can. But if the move is intended as a step up for me,\nas well as for the NAEB, I thought I should raise some of these prob¬\nlems early enough so you and/or others whom you might designate to\nwork with you, could consider.\nThese are of course in addition to the retirement investment (some\n$5,000 to $6,000) I lose when I leave Illinois . I believe we’ve\nalready discussed this —. I described this situation in an earlier\nletter. This would be a lump sum purchase of something equivalent"
}