{
  "id": "d247-60",
  "text": "TO\nNAEB Board or Directors\nAugust 4, 1959\nFROM:\nGentlemen and Mrs. Broderick:\nHerewith the revised Constitutsow* This, was conceived at the\nConstitution Committee meeting *k Columbus last May, given\nform by Harold Hill during early June, commented on by the\nConstitutson Committee during late June, dratted sn present\nform by Lenny Marks during early July, and nov$ at the\nSUGGESTION OF BILL HARLEY, IS BEING DISTRIBUTED TO EACH OF YOU,\nAs Chairman of the Committee t think it is complete* I believe\nIT SAYS SHAT «E ©ANT IT TO SAY« \\j DOES REPRESENT SOME RADICAL\nCHANGES FROM THE PRESENT CONSTITUTION, BUT IT CERTAINLY STREAM¬\nLINES OUR ORGANIZATION AND SHOULD PROVIDE THE BASIS FOR THE\nFLEXIBILITY WE ALL KNOW MAEB NEEDS TO COPE WITH THE PRESENT\nDAY RAPIDLY CHANGING NATIONAL PICTURE*\ni HOPE YOU ©ILL LET PAST PREJUDICES AND PERSONALITIES REMAIN\nBURIED AND WILL READ THIS DOCUMENT WITH AN OPEN M!MO, THINKING\nFIRS? AND FOREMOST OF NAEB AND ITS POSITION TODAY. FOLLOWING\nWHICH I WOULD BE MOST HAPPY TO RECEIVE YOUR SUGGEST SONS FOR\nFURTHER CHANGES OR SUGGESTIONS FOR PRESENTATION OF THIS TO THE\nMEMBERSHIP.\nIt IS OUR CURRENT THOUGHT THAT WE WILL DISTRIBUTE COPIES OF\nthe Constitution to all voting members early in September.\nWe VS ILL INCLUDE A PAGE OR TWO OUTLINING THE PROPOSED CHANGES\nAND STATING THAT A VOTE WILL 8E HELD ON THE ADOPTION OF THE\nConstitution and Bylaws at the first business session in\nDetroit. Bill Harley suggest that m do this a? the very\nfirst session so that 'if it is mot adopted, the necessary\nACTION CALLED FOR BY THE PRESENT CONSTITUTION CAN 8£ CARRIED\nON.\nI HOPE I CAM REPORT TO THE MEMBERS THAT THE BOARD OF DIRECTORS\nUNANIMOUSLY RECOMMENDS THE ADOPTION OF THIS NEW CONSTITUTION..\nTherefore, if you have any reservations, please write to me\nNOW.\nCopies to: Constitution Committee\nand Headquarters\nThere will oe a meeting of the Constitution Committee at\n9:00 a.m., Tuesday, October 27 in Detroit. I trust you will\nALL PLAN TO ATTEND."
}