{
  "id": "d247-85",
  "text": "Gr. Phi Hip Coombs, Secrotary\nThe fund for the Advancement of Education\nkll Hadison Avenue\nHew York, New York\nGear Phils\nSeveral weeks ago—a* a byproduct of another meeting—8i 11 Harley, Ralph\nSteetle and i found ourselves In a full-scale, daylong \"no agenda9* session\non the past, present and \"futures*' of educational radio and television,\nnotably the latter.\nWhat had begun as a kind of exercise in remenisconce (since each of us had\nbeen Involved in ETV*S beginnings) turned into an extended and serious\nspeculation about ETV, Its status, its directions and problems. Since each\nof us in this session was \"without portfolio?1 we hoped our thinking was for\nthe general \"good of the order.1*\nThis session has been very much on my mind ever since, end I finally deter¬\nmined to write you an off-the-record letter for whatever it might be worth\n(at least I will have enjoyed catharsis).\nAlthough we discussed many things, we found ourselves returning again end\nagain to what wa believed were two items of major concern—the one general\nend the other immediate end specific.\nI think I have already explained the general item in my recent memorandum to\nyou end Dr. Stoddard in re airborne television, the need for (end the apparent\nabsence of) e ford foundation policy which can comprehend the whole vista of\neducational communications—or at least relate In some kind of understandable\nframework—those projects In educational communications which the foundation\nend Its several funds have supported, ere supporting, or may support. 1 will\nnot labor this point.\nOur immediate end specific concern Is whet will happen—not to the Joint\nCouncil on Educational Television per se—but whet will happen to the JCET\nfunction when JCET funds under the foundation terminal grant ere exhausted.\nWhether the issue Is protection of presently reserved ETV channels, realloca¬\ntion of channels by the fCC on an ali-UHf basis (or some combination of VNF-\nOHF), the special reservation of channels for airborne ETV, new allocations\nfor simultaneous k-chemtel UHF Instructional television as General Electric\nproposes, or some new development In electronic communications. It seems\nevident the educational establishment must have e spokesman In Washington who\nIs not only vigorous end effective, but knowledgeable In the needs of educa¬\ntion and the ways of technology."
}