{
  "id": "d247-87",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nJuly 20, 1959\nOFFICE OF EXECUTIVE DIRECTOR\n14 GREGORY HALL\nURBANA, ILLINOIS\nMr. William Harley\nStations WHA-AM-FM-TV\nUniversity of Wisconsin\nMadison, Wisconsin\nDear Bills\nI have received through the mail a travel accident policy from Walker B.\nJohnson, Insurance, Madison, with a scribbled note which I cannot quite make\nout except the words “Harley ordered to send to you.“\nI presume that this was sent as a sample policy so we could see what benefits\nwe could get under this coverage, but there is nothing to make that clear.\nI have looked over the policy and discussed it briefly with Harry. One thing\nthat appears as a weakness to me is that this policy, as written, offers no\nmedical expense nor any weekly indemnity. I realize that it is these latter\ntwo items which may run up the cost of such a policy, but it seems to both\nHarry and he that these are iiqportant considerations — with the weekly indem¬\nnity clause perhaps as important as the death benefit clause.\nAlso, as Harry and I look at this whole problem, we*re wondering whether or\nnot it might not be cheaper for the NAEB to pay for individual policies for Ihe\npersons involved, i.e., Skomia, Hill, the President and any others the Board\nmight designate. Harry has a personal policy which is much cheaper for poten¬\ntial value received than anything we have found in the group area.\nThere is another possibility, of course. I e:xpect that $2$,000 coverage would\nbe adequate, and we (all of us, that is) could make 225 trips, buying trip coverage\ninsurance coverage of $25,000 each time, for the amount of the premium indicated\nfor the sample policy received from Mr. Johnson. And all of us put together\nwould never make this many trips in a year unless our method of operation changes\nradically.\nI realize that Harry and I have been modified proponents of a group insurance\nplan, and that now I seem to be arguing against it. However, that*s what\ninvestigation is for, and the more we look intoAthe more some of these other\npossibilities seem to be the sounder solution.\nIncidentally, although we didn*t get a reaction from everyone on the Board,"
}