{
  "id": "d247-88",
  "text": "Mr. William Harley, Page 2, July 20, 1959\nhere is a summary of the comments received in reply to my memo of May 28,\nabout the insurance coverage — I list them here because I don*t believe all\nof them sent you copies of their replies as I had requested they do.\nHungerford — Peels Board members should take trip insurance each time\nand charge to NAEB when on NAEB business.\nSchenkkan — Approves general notion of travel insurance; doesn*t care\nwhether Board is covered or not, but feels other coverage is indicated; should\nmake several inquiries to make sure we get as low a premium as possible.\nMiles — Thinks we should have the $100,000 coverage, with a rider to\ninclude Board members and perhaps even workshop attendees, where the attendees\nare literally travelling on NAEB business.\nEngar — \"All for it if, in your judgment, it can be financed.\"\nMcBride — Has been in favor — hopes we could proceed to put the major\nHeadquarters staff on the policy. Only problem is one of budget, and this\nwill dictate how much we can do.\nSchwarzwalder — In favor of travel insurance — to include Board members.\nHarwood — \"The plan of travel insurance seems very good.\"\nSo there we have seven reactions out of a possible fourteen. Perhaps the others\ndon*t have strong reactions one way or another.\nIncidentally, the point that Miles raises is one that has long bothered me, i.e.,\ncoverage for workshop and seminar attendees. I know that Leonard doesn*t ifeel\nwe have to worry about this, but other legal opinion I have sought seems to\nindicate that we would be liable so long as we are paying attendees* expenses,\nwhich means that they are actually traveling on business for us. However, I\ndon*t want to belabor this point, since the concensus seems not to favor such\ninsurance (based on previous Board discussions, since the May 28 memo didn*t\ngo into this).\nAt any rate, how would it be to consider individual travel policies (with\npayment for death or dismemberment, plus medical costs and weekly indemnity)\nfor Harry, you and me, say at $25,000 or $50,000 (with $5,000 medical and\n$150 weekly indemnity)? Then we could authorize all others traveling on NAEB\nbusiness (and this might even include workshop attendees) to buy a $25,000\npolicy each time they took a trip (this latter would cost only $1 per trip).\nAt any rate, this is something else we can consider, and Itll be happy to get"
}