{
  "id": "d1752-1",
  "text": "step down from chairmanship but remain on Commission. Rep. Comm. Charles H.\nKing, appointed by Eisenhower to fill remainder of Doerfer's term (to June 30,\n1961) will be replaced by a Democrat.\nThere is likelihood that Congress may reorganize FCC. Dean Landis, appointed\nby the President-elect to study and report on the regulatory agencies by Dec. 15\nhas long been critical of such agencies for failure to anticipate problems and\ntake corrective action in advance. Senator Khgnuson (D-Wash.), Chr. of the\nSenate Commerce Committee, has announced that he will conduct his own investiga¬\ntion of the regulatory lag. He is said to lean toward putting FCC under an admin¬\nistrator with the commissioners serving as a sort of appellate board. Meanwhile\nhis opposite number in the House, Congressman Harris (D-Ark.), has let it be known\nthat curbs on trafficking in TV and radio licenses will be priority items on the\ninvestigative agenda of the new Congress.\nSen. Magnuson’s ETV bill has much improved chances of being passed. Senate\npassed it in last Congress; House Commerce Committee approved another version —\nbut Eisenhower administration opposed and Rules Committee killed it. In this\nconnection, it is pertinent to cite excerpts from a statement made by President¬\nelect Kennedy for NAEB's San Francisco convention:\n\"Today our schools and colleges face a crisis of appalling proportions in\nterms of deficits in dollars, teachers, classrooms and services. American pro¬\ngress and even our national survival is directly dependent on what we as a nation\ndo now about the shameful weaknesses and deficiencies of our educational system.\n\"We must seize all means at hand to help education cope with these dire short¬\nages and improve both the quality and quantity of educational opportunities avail¬\nable to our citizens at all levels, both in and out of school.\n\"Television, a device which has the potential to teach more things to more\npeople in less time than anything yet devised, seems a providential instrument to\ncome to education’s aid. Educational television has already proved that it can\nbe a valuable supplement to formal education and a direct medium for non-formal\neducation.\n\"Despite the heroic efforts of people such as yourselves to establish educa¬\ntional television stations across the United States, only a small part of the total\npotential has been achieved. To date, only 50 of the 267 channels reserved for\neducation have been activated and 2/3 of the population still has no access to edu¬\ncational television service. This is not for lack of zeal or interest on the part\nof educators or state or local officials, but, primarily, for lack of funds for the\ninitial capital investment required for construction of stations.\n\"Since education is a matter of national concern, the Federal Government should\nassist in expediting and accelerating the use of television, as a tested aid to\neducation in the schools and colleges of the nation and as a means of meeting the\nneeds of adult education. I pledge you that I will back actively suitable legisla¬\ntion aimed at this objective in the next session of the Congress and will urge its\nsupport by my Democratic colleagues.\"\nNEW EDUCATIONAL TV SERIES\nThe Association for Higher Education has just announced a new TV series —\nMEET THE PROFESSOR -- scheduled to start Jan. 29 on ABC to introduce teachers of\ntoday’s college students to the American public. The series is designed to pro¬\nvide Americans with a realistic picture of the men and women who have such a vital\nrole in shaping the country's future and to replace present stereotypes about the\nprofessor. Different disciplines, types of institutions, and parts of the country\nare being taken into consideration in the selection of outstanding participants\nfor the Sunday afternoon presentations.\nManagers of ETV stations will be invited to nominate professors from their\ncommunities for inclusion in the series."
}