{
  "id": "d1752-3",
  "text": "Daring the past 10 years MEB has held more than 30 seminars and work¬\nshops devoted to helping its members improve themselves in everything from\ncreative writing to television production — and to help advance the cause\nof activities (in which its members have a stake) ranging from communications\nresearch to live, interconnected networks. It is high time, it seems to me,\nto devote a seminar to the association itself, e.g., an MEB seminar on the\nMEB.\nOn the 12th anniversary of the first Allerton House seminar — a land¬\nmarking meeting which established the aims of educational broadcasting —\nI propose an Allerton House conference devoted to a study of the aims (and\nmeans .of implementing them) of educational broadcasting's professional asso¬\nciation. It would include a thorough check-up plus prescriptions to insure\nthe association's continuing good health and robust future.\nWho would be the attending specialists? For the most part they would be\ndrawn from our own ranks: officers, directors, committee chairmen, and\nretained consultants. Personalizing the association for a moment, I think\nof MEB (a la David Riesman's formula) as being largely inner-directed, in\nthe sense that its source of direction was implanted by the pioneers in the\nmovement and is directed toward destined goals and generalized ideological\naims. Ihus, rather than being overly responsive to the expectations and\nwishes of others, the MEB has a gyroscope that keeps it on course. On the\nother hand, the association must avoid rigidity in its attitudes, maintain¬\ning a delicate balance between the demands imposed by maintenance of tradi¬\ntional direction and the impact of the external environment. So, in addition\nto a gyroscope, it must have radar as well, so that, while adhering to what\nwe know is good and true, we can still be responding and utilizing signals\nfrom a changing environment. In other words, ours should be a self-propelled\norganization that is also realistically responsive to altered circumstances.\nAccordingly, I envision the Seminar as being largely our own show —\ninner-directed -- with our own leaders bearing the major responsibility. To\navoid astigmatism and self-deception, a few outside experts might well be\nbrought in to give us the benefit of their insights and special competencies.\nTo the contribution of these \"others\" would be added the inner contribution\nof working papers provided by each of the standing committees of the MEB.\nThe preparation of these studies would constitute the principal activity of\nthese committees from the time of their appointment in January until the\nstaging of the seminar in July. With some stimulating presentations from\nconsultants plus carefully prepared papers from the committees, the seminar\nshould have an ordered body of pertinent material to dig into that should go\na long way toward assuring a fruitful outcome to its deliberations.\nThe first Allerton House meeting is reported to have been characterized\nby the revelation of a great truth — the truth that educational broadcast¬\ning has a job to do and is capable of doing it. I am confident that a third\nAllerton House seminar such as is here proposed would generate the same sort\nof revelation and exhilaration and would inspire realistic confidence and\nassurance that the MEB not only has a big job to do but is fully capable of\ndoing it.\nIn future columns — providing there is sentiment to support such a\nseminar — I will discuss in greater detail some notions concerning its organi¬\nzation and operation."
}