{
  "id": "d1460-17",
  "text": "| THE NATIONAL..ASSOCIATION OE EDUCATIONAL BROADCASTERS (|\n[_;_t\n1. The National Association of Educational Broadcasters represents the\nnon-commercial, educational AM and EM radio stations, workshops, and production\ncenters, owned and operated \"by colleges, universities, and public service\nagencies in the U. Sc\n****\n2. Active membership in this organization is open to any accredited college,\nuniversity, or other educational institution which operates a non-commercial or\nnon-profit educational radio station,\n3. Associate membership is open to any institution or organisation engaged in\nradio teaching, broadcasting, production, study, or educational promotion,\n*****\n4. Active and associate members in addition to participating in the consulting\nservice offered to members by N-A-S-B officers and directors, regularly receive\nthe N-A-E-B Newsletter as part of their membership services, and from time to\ntime special reports not available to non-members on U,S. educational and public\nservice radio operations, costs, and policies,\n*****\n5. The N-A-E-B Newsletter is available on a special subscription arrangement to\nagencies or individuals not qualified to participate in the organization either\nas active or associate members©\n****\n6. Inquiries with respect to N-A-E-B may be addressed to any of the directors\nlisted below or to the officers listed on the front page of this publication,\n7. Inquiries with respect to N-A-E-B Newsletter subscription may be addressed\nto the editor's office, WOI, Ames, Iowa\nREGIONAL DIRECTORY NATIONAL ASSOCIATION OE EDUCATIONAL BROADCASTERS\nREGION I - Director - Seymour Siegelr WNYO, City of New York, Includes states of:\nMaine, New York, Connecticut, New Hampshire, Massachusetts, Vermont, Rhode Island,\nPennsylvania, New Jersey, Delaware, and Maryland*\nREGION II - Director - Graydon Ausmus, WUOA, University of Alabama at\nUniversity, Alabama* Included states of; Virginia, West Virginia, Alabama,\nKentucky. Tennessee. North and South Carolina, Georgia, Elorida, and Mississippi,\nREGION III - Director - Frank Schooley„ WILL, University of Illinois, Urbana,\nIncludes states of: Ohio, Michigan, Indiana, Illinois, and Wisconsin.\nREGION IV - Director - Carl Menzer, WSUI, University of Iowa, Iowa City.\nIncludes states of: Iowa, Minnesota. North and South Dakota, Nebraska, and\nWyoming,\nREGION V - Director - Ralph W. Steele, WLSU, Louisiana State University, Baton RougeJ\ni'nclude-s states of: Missouri, Kansas, Colorado, New Mexico, Oklahoma, Arkansas,\nTexas, and Louisiana* !\nREGION VI - Director - William H. Sener, KUSC, University of Southern California, 1\nLos Angeles, Includes states of Montana, Washington, California, Idaho, Oregon, j\nNevada. Arizona, Utah, and the Territory of Hawaii."
}