{
  "id": "d1460-3",
  "text": "RUTGERS UNIVERSITY CONTINUES OUTSTANDING FORUM SERIES\nRutgers University, N-A-E-B member in New Brunswick, N. J, presents a challenging\nand unusual program series each Tuesday over seven cooperating commercial stations\nin New Jersey.\nTitled the \"Rutgers University Forum\", the program originates from the University\nCommons, On Tuesday. August 2nd, the Forum will mark its 136th broadcast with\na discussion by four leading authorities in sociology and philosophy of society's\ninability to readjust itself at a rate comparable with technical development in\nthe atomic age*\nParticipants in the Forum will be Max Birenbaum, co-director of the Human Relations\nWorkshop at Rutgers* Dr. Joseph Neyer* philosophy professor, at Rutgers, and Dr.\nLeon Wolcott, co-director of the Human Relations Institute and professor of sociology\nat Trenton State Teacher's College, Dr, Mason Gross will be guest moderator.\nWSUI STARTS RURAL 'SCHOOL CF THE AIR1\nNAEB station WSUI (University of Iowa) will begin something ne?7 in educational\nradio this fall—radio programs will be broadcast daily to supplement classes in\nrural schools for eastern Iowa pupils.\nDirector Carl ttenzer of the Iowa City stations says WSUI and KSUI-FM will carry\ntwo 15-minute programsdaily beginning September 20th, They will be designed for\nrural elementary pupils--not formalized classes—but imaginary tours of the 4$\nstates and foreign countries as well as music appreciation work.\nPilot plan was worked out with Johnson County (WSUI home county) superintendent\nof schools Frank Snider, whose 97 schools are 40 percent radio equipped,\nU,S.D.A, TELEVISION PROJECT FORMALLY APPROVED\nFormal approval under the Research and Marketing Act has been extended to\na television research project of the Radio and Television Section, Office\nof Information, United States Department of Agriculture,\nHeading the project will be Ken Gapen, Assistant Director of Information in\ncharge of Radio & Television* Dana Reynolds will be Operations Manager? Tom\nNoone, Television Information Specialist, and Maynard Speece (N-A-E-B station\nKUOM, Minneapolis) Program Director.\nProject will study television utility as a means of conveying to farm and city\npeople benefits of agriculture and home-economics research. Realistically con¬\nceived it will explore techniques and methods with audience appeal and compre¬\nhension as major objectives.\nN-A»E-B ANNUAL MEETING OCTOBER 10-11-12 AT ILLINOIS UNIVERSITY IN URBANA\nFOR DETAILED INFORMATION—ADDRESS FRANK SCHOOLEY, STATION WILL, URBANA, ILL."
}