{
  "id": "d220-1",
  "text": "2\nof travel for the NAEB officers mentioned above. Hotel expenses\nand banquet expenses are also included. Additional meal expenses\nare not included. The total figure, $2,£68.37, is broken down on\nthe attached financial sheet.\nIf this total budget Is approved on the basis of one fare for each\nactive and each associate member, I shall do all in my power to\npersuade each member to come by auto, to share rides along the way\n\"and to, therefore, boost attendance. You will note from the\nattached replies to my wire that a good many members would be\nwilling to pay at least a part of their own expenses. I believe,\nhowever, that what is fair for one is fair for another and that\neach member organization should receive the equivalent of one fare,\nwith perhaps some priority going to active members.\n![.. The program is a busy one. If this much money is being\nspent for the workshop I feel that a busy schedule is essential\nif we are to achieve worthy results.\nThe program is designed so that maximum participation on the part\nof those attending will result. From past experience I believe\nthat the small group discussions should yield valuable dividends,\nnot only for members of Region II but for us as officers of NA123.\nThe 2:00-3:30 discussion on Saturday afternoon, for instance, may\nbring considerable enlightenment to us as members of the board.\nWe may want to do some discussing of our own during the 3:45-5:15\nperiod on Saturday afternoon as a result of what we learn in the\n2:00-3:30 period.\nAlthough WUNC has been on the air since November, we have not yet\nheld our christening ceremonies. It seems to me that the workshop\nwould be a good time to baptize the station. If the workshop is\napproved the Communication Center will take upon itself the job of\nwriting a documentary defining educational broadcasting and will\npresent that program live over a network of stations sometime during\nthe Friday evening, 8:45 to 10:15 session.\nIf this workshop is approved there remains at least three weeks of\nheavy organizational planning to be done. I would appreciate,\ntherefore, an early decision.\nSincerely yours.\nends.\n00: Jim Miles\nBurton Paulu\nFrank Schooley"
}