{
  "id": "d220-103",
  "text": "15\nSUMMARY\nThe figures presented in this budget analysis certainly\nindicate to\"the experienced Director or Manager of an\nEducational Station that, in general, after thirty years,\neducational radio is still, in most instances, very unsound\nfinancially. In the majority of cases, directors are faced\nwith the problem of running systems without any fuel to\ncarry them along.\nIt remains a mystery to this investigator how, on the\none hand, directors are able to operate, and, on the other,\nhow these very same directors keep doing excellent work in\nprogramming. Of particular concern to members of the NAEB,\nshould be the quality of personnel used at these stations.\nAgain, in all too many instances, we find staff salaries\nare below those paid to other faculty members and below those\nsalaries paid in commercial.\nWe can not Ignore the fact that many clerks in the Public\nSchools are making more than many producers, writers, pro-\ngran directors, and announcers.\nIt is no wonder that commercial broadcasters are con¬\nstantly taking the cream in personnel, when the above men¬\ntioned conditions exist within cur field of education.\nAdministrators, at least many of them, are apparently\nnot cognizant of this important fact. No reputable insti¬\ntution in this country permits a consistent bleeding within\nits structure. True, there is a turn-over of faculty members\nin general, but it is from one institution to another; only\na small minority leaving the profession completely.\nIt would be difficult to discover recognized institu¬\ntions allowing major departments to be bled of key personnel\nto the extent that they allot/ departments of radio and\ntelevision to be bled. Salaries, today, won't hold trained\npeople, and consequently, directors are not able to build\na sound, well-trained, and well-balanced staff.\nOf particular concern should be the over-emphasis given\nto staffing a station with student help. Although it is the\npolicy of many educational stations to train students\nfor the industry, it would appear, nevertheless, that some\ninstitutions use this as an inexpensive means of staffing\nthe major positions. Examination of those tables dealing"
}