{
  "id": "d220-21",
  "text": "- 3\nbeen of groat interest and have bean well received©\nIn the area of international exchange on radio programs* commercial\nradio had dono little or nothing and hadp in fact, on on© occasion\nat least, airily turned down an invitation from the French Broad¬\ncasting System who very generously offered their Radio Diffusion\nFran cade© (RDF) shows to be carried- connereially© The NAEB is\napproaching this problem differently© We have established very\ncordial relationships with RDF, BBB, Radio Italia, and others* W©\nare beginning to exchange programs with these systems in their own\nlanguages© This is an opportunity for the improvement of inter**\nnational relations which is tremendous * We hav© now begun to have\na voice in the selection of some Fulbright FellowsB and one achieve¬\nment in international broadcast which deeervea special mention:\nthe BBC is currying the JEFFERSONIAN HERITAGE, something the Voice\nof America has never been able to get the BBC to do with an American\nshow© NiwEB is beginning to do a job for the country©\nThe next speaker was Graydca Ausmus on the subject NRSB--Qur Dreams:\nOur dreams a said Mr. Ausxaus 8 for the future are an expansion of\nour dream® of the past© Under Dick Hull as President, we established\nthe Tape Network© Sy Siegel gave us national significance© For\nthe first time people began to realise that in America w© have a\ndual system of broadcasting, and he urged that we stress this fact\nin our teaching and in our public approach© People can no longer\nsay \"American Radio\" and mean \"Commercial Radio.\" They must take\nus into account, and wo ourselves must bo th© publicists of the\nchange© And now, as Mr. Siegel has pointed out* th© NAEB fea©\nbecome internationally significant ©\nWhat now? life need to do vigorous, far-reaching planning and\nthinking; w® must stay, out in front© W© are a part of a very signi¬\nficant movement - one of a number of organizations trying to extend\neducation to the total population; a task which is staggering in\nits problems and immense is its implications© It may be that tho\nsocozid half of thie century will bo known to history a© the period\nin which education was extended to adult populations. 'W© must not\nforgot that we are radio-television, but wo must remember that,\nfirst of all 0 we are educator®© a© can't expect to be saviors,\nbut we can play a very significant role©©© This is our dream©\nAnother goal must bo a soli&lfieation of our organization and the\nutilization of the resources of our members© ffe must pull ideas\nout of this conferone© and others like it© W© need broader parti¬\ncipation from our members© We need a wider use of the existing\nbrain power©\nOther goals which wo must strive for are: 1) expansion of head¬\nquarter operations which now operates 6-8 hour# per day, 2) expan¬\nsion of consultation services on the local level0 3) expansion of\ninternational relations (the new opportunity in regard to the\nFulbrights is a good example of this). International exchange of\ncommunications people i.s vitally important. This year 3 of our\nfolk® will go abroad © Next year, if w© are successful, perhaps"
}