{
  "id": "d220-23",
  "text": "5\n2s00 potto THESE V/E SHARE.\nThe group reconvened at 2s00 pom© at th© Faculty Lounge,, Morehead\nBuilding* for the discussion \"These V/© Share,\" with Frank Schooley,\nTreasurer and Acting Executive Director of tho NAEB acting as Chair*\naan« Mra JehooXey gave a broad picture of the activities of the\nTape Network, and explained the presence of NAEB headquarters at\nIllinois as chiefly resulting from the fact that the money from the\nKellogg Foundation that put NaEB in business was mostly gotten by\n’ilbur 3ohraun9 and that the University of Illinois offered space0\nThe functions of headquarters are as follows: a) to get out NAEB\nNows Letter, b) to keep a file on active members*, associate members,,\nand affiliate members, c) to sponsor such publications as \"Th©\nRadio-TV Bibliography, ** c) to sponsor i&<a TV moaitoring studies*\nsuch as \"TV-New York” and ”TY-LA,\" e) to arrange for the handling\nof the Fuad for Adult Education series on L.P. records* f) to\narrange tours of headquarter®, g) to meet visitors* h) to supply\nreports to The Fund for Adult Education and Kellogg Foundation, i)\nto meet with the Board of Control* j ) to work with the Grants-In-\nAid program* k) to handle the routine mail which for the month of\nFebruary was 810 letters in and 2*000 out*\nMr. Schooley then projected some slides showing such things as\ndistribution of members* some of the printing done for NAEB, pro¬\nmotional material® for THE JEFFERSONIAN HERITAGE, publicity received\ndistribution of Radio-Television Grants* etc*\nMr. Jim Miles* th® former Executive Director of the Tape Network\nand present Secretary of th© NaEB then discussed tho history and\nproblems of the NaEB, illustrating his talk by means of slides show®\ning: a) station participation in the NAEB Tape Network, -consisting\nof 19 at th® beginning and 81 now* b) monthly air time which went\nfrom a few hours at the beginning to 1231 hours in May, 1951, c)\ntotal distribution reached 12*797<>30 hours in education* d) the\nmonthly tape production in February, 1950 - 17 reels; at the start\nof the Kellogg Grants - 53 reels; 4 month® later (May* 1952}\n1061 re©le« Now the weekly output is 950 to 975 reels* ®) th© new\ntiming device was shown* f) th© Master Board device was pictured,\ng) speed reduction on the Ampex from 15 to 7^ i.p.e. was shown*\nthe point being made that at this stage in th© distribution process*\nopeners and closers added to the shows were necessary, and the plea\nwas made that contributors do the opens and closes theasalvoi. It\nwas pointed out that the Ampex does SKe ai~ngl© dube whicH were\nnecessary* h) the duplicator was then pictured and described, and\nit was pointed out that it is now operating at its maximum with\nthe present staff, between 950 and 1000 reels of tap® for a 40-hour\nweek, i) the distribution method through ”th© bin” was pictured and\ndescribed in detail* j) the paper routine was shown, k) the distri¬\nbution of station® through 30 states was shown, 1) the income charts\nwith new rate® were projected, and it was pointed cut that th® new\nrates would bo 8 times the present rate* so at the close of the\nKellogg support,the NAEB income from memberships will be between\n•$32 * 000-$35 * 000, that this was tho cheapest programming one can get,\nand finally* that th® network was constantly on th® lookout for\ngood ahowso\nIn th© discussion period* the question was asked if a program* when\nsubmitted and refused, could b© rosubmitt* After some discussion\nit was finally cuggostod that one resubmit with supporting arguments"
}