{
  "id": "d220-30",
  "text": "~ 12 -\nReferring to the University's plan® for television, Mr* Gray\nstated that the thro© lastltutione of the Consolidated Univex*eity\nwould have one transmitter, If financial support could bo arranged,\non Channel 4 VH3?, with studios on each campus* Ha thought that\nprogram materials on the thro© campus os would be practically inex¬\nhaustible: Raleigh - our agricultural and technical school «*\nthe resources of agriculture* forestry, engineering, textiles* and\narehiteetur®5 at the University at Chapel Kill « the College of\nArts and Sciences, business and professional schools. Division of\nHealth Affair®,, School of Journalism, Department of City Planning,\nSchool of Social tforfc, etc; and in the Woman's College - fine artsQ\nhorn® economic®, education, and ethers©\nHe found la television an unparalleled opportunity for educational\nservice to the people of North Carolina. tfith a single transmitter\non Channel 4 wo would hope to reach 5,000,000 to 4,000,000 people\nwith programs of educational value. This ia an extension of exten¬\nsion of tremendous significance for no in North Carolina, In radio\nwo have not yet taken advantage of our consolidated opportunities,\nla television m have overy intention of doing so©\nMr* Gray then welcomed the delegates to tho campus„ wished thorn\nsuccess and good luck in an undertaking of great importance©\nMr* Kay Xyaer mad© the principal address; \"A Pro Sooks at Educa¬\ntional Television,” Ho opoko with humorc w 1 op~Tinc©rity\nJo Hi© group'pTiTatlag first his own experiences with educational\nt ©1©vision *\nHo had gotten Into tho educational television picture when Mr* Gx>ay\ncalled and asked if h© would oar© to assist the University with some\nof its project;** His first educational TV experience was at the\nPoaa State conference which he attended with Mr* Gray, Ho went with\nmisgivings; k© felt, frankly, as a professional that ho was \"going\nslumming\" among all of these innocents who knew nothing of show\nbus lama® but were out \"bear hunting with cap pistols*\" But that\nconferonce was an awakening. K© found that the educator® had com©\nto say that they didn't know about this medium* but that they had\nmis,sod out on educational opportunities of radio and motion pictures\nand they wore not going to miss out ca this opportunity if tolovi*\nsi0.1 could be used for educational purposes* They were there\nhonestly to learn. On© of tfc© most astounding facts which rae\nbrought to hie attention at that conference was, that in the city\nof Chicago* because of juvenile vandalism, tho cost of window\nbreakage ia tho schools was J3C0,GQ0 por year* Thi© ooenod one’s\n©y@3 to qost factors ia education and to th© possibility that\neducation might actually cost less in the long run if on© could\ncut down on such things as juvenile vandalism* H® began to a©© that\neducational television might take tho world into the schoolroom*\nthat children with otherwise very limited opportunities might* '\nthrough television, 13©© and hear and learn things that had thereto-\nfori been shut off from thorn* H© learned p © op i © wore taking courses\nby -iolaFisioa froa aaotarn a«3«rTa Onivarsity, <»«ttins uo to it »r/i\nIS *o*». eo„*8* er.dit to«r4 a eoli*** i^/eo Jeh^oe,"
}