{
  "id": "d220-33",
  "text": "15 -\nSaturday, March 14\n9:00 a.uu REGION II: DOINGS AT HOME-\nThe group convened at Studio A a few minutes after 9*00 for a\ndiscussion of DOINGS AT HOME, ©bat© by state®\nTENNESSEE: Jack ^estbrook, Acting Director., tfUOT-FM,\nKnoxville, University of Tesnessoa\nRadio\nWtfWTFM is the only educational station in Tennessee,. Nearby Carson-\nNerrnan College does ace© public relations work on radio but that is\nalio VJUOT has mad® a specialty of programs on safety: One aeries\ncalled \"The Court of Public Safety” won the Alfred F- Sloan, the\nNational Safety Council, and the Tennoseo© Safety Council awards a\nfew weeks ago® They are continuing their work in safety programs,\nand era now producing a program in water safety which is being\ncarried on commercial stations in the TYA area- la 1953 they will\nhav© produced 350 15-minute safety programs- Thoy feel that on©\nfertile field for tap© network programs is the safety fioldo\nIn addition, they have been doing a great deal with mental health,\nhaving carried the Roger Howell series from XUOM; thoy are now\nalso working on a local series in mental health- Those are drama¬\ntized stories- The scripts are being written by a Master's candi¬\ndate in Psychology.\nThey hav© also developed a tap© network of their own and believe\nthat they ar© th© first to have used film cans for this purpose©\nThey uso a Magna-reel tap© in metal eases,,\nTelevision\nTh© If^TdTTiaa allocated 4 channels for ©ducatIon in Tennessee. There\nhas been very little activity except in Knoxville to which Channel 2\nhas been allocated© Last summer there was a mooting in Knoxville\ndrawing in represent at ives from institutions of highor learning,,\npress,, and radio- An attempt was mad© to sketch the possibilities\neducational television offered and considerable interest was aroused-\nCooperation is expocted if they can get television in Knoxville.\nMessrs- tfostbrook and bright drew up three alternative plans: One\nwas for a workshop in which they would plan the production of shews\nand ueo commercial facilities for th© actual production; the\nsecond alternative - for a video-recording production unit; th©\nthird « for a station with a production center. As a guide to\nlater activities,, this memorandum ha© proved extremely accurate©\nPresident Brim of the University of Tennessee is fallowing it closely\nMoney has been requested from th© 1©giolature; howeverB th© new\ngovernor is’ an economy man and th© final result is not known. The\nessence of th© Tennessee plan offered by a group from the 4 cities\nconcerned proposed that the legislature appropriate 5600,000 to bo\nsplit 4 ways, and to be matched locally.\nFLORIDA: Vernon Bronson, Director, WUH3, Dad® County\nRadio\nThree educational station© aro on the air in Florida: V?TIIS a - Dad ©\nCounty Public School System station; IV T A 22, Univ©2asity of Tampa;"
}