{
  "id": "d220-34",
  "text": "16\nand kYPRK, Rollins College. Tampa has had remarkable success\nin liaison with the local commercial stations. The NBC affiliate\nhas given them studio equipment and a complete kitchen for home\neconomies shows* The CBS affiliat© has been equally generous.\nThey are on t ho air 2 houses to 3 hours daily, 4 hours on Sunday.\nThey aspect, shortly to go on 8 hours a day. They have a 20~atudent\nstaff, 3 pieces of recording equipment. WPEE is largely a Classical\nmusic station. Of its 28 hours on the air per week, 14 hours are\nclassical music„ and they also carry 5a hours of NAEB Tape Network\nshows. WPRK has done a number of special ©vents shows. CBS will\nplay back a WPRK music festival program Saturday, March 21.\nJacksonville: There is no school station in Jacksonville but\nmost of the schools use a commercially produced 15«minute weekly\nshow - \"Music for Youth,\" and the audio-visual group has produced\nten \"Know Your Schools’5 programs.\nMiami: tfTHS took three years after getting its construction\npermit to got on the air. It has now been on th© air 4 years. It\nleant? hoavily on help from the NAEB; Is building up a large record\ncollection particularly In L.P«*s. They arc particularly interested\nin the possibilities of using radio in furtherance of the bi-llngual\nIdea in Miami which has 1,000*000 Spanish-speaking visitors a year.\nThey are hoping to teach conversational Spanish to the very small\nchildren, and i;ke plan :!@ to repeat the broadcast a number of times\na day. At preseat* ;hes© programs aro wa©d by the teachers on\nrecords. The schools have receiver© and sound systems* but have\nnot been completely sold on either. WTIIo is on the air from 3:00\nto 93O p.m«, and they estimate 5*000 to 7,000 regular listeners.\nThe University of Miami docs two TY chow© a week and 15 radio chows\na wook on co.amorciai station® and are working on the NA2B Fund for\nAdult Education graat»\nTelevl©ion:\nFIo:?YdT~Tia$ boon extremely fortunate in its TV allocations. There\nare 9 allocations, and they are well placed. Th® Uad® County School\nSyatom was the fis'st institution to file with the FCC and the first\nto file an amended appll cat! on. There has been very little assist¬\nance outside, but pending th® decision of one vote on the school\nboard8 Miami should get into the picture. The other allocations\nstand as follow®: West Pal® Beach has done very little; Tampa\nis very lively and looks hopeful; an application ie ready in Gaines*\nvilla; Jacksonville, working through its Citizens Committee* is\nabout ready to file and ha© raised some money; in Tallahassee the\nCitizens Committee ia organizing* and if Gainesville gets a station\nit in a natural assumption that Tallaha®so©0 ©it© of Florida State\nUniversity* -fill also get a station; tt*s very doubtful that Panama\nCity will make any progress; there ie a great deal of interest and\ngood possibilities at Orlando. To sum up* It*3 likely that 5 of\nthe 9 allocations will see some action soon.\nGEORGIA: *ilvin Gaines, Supervinor of Radio Education, Director\nof tfABE0 Atlanta e Georgia\nRadio\nWABS is th© only educational station in Georgia.\nDespite certain"
}