{
  "id": "d220-42",
  "text": "23\nthe sasi© time, a ad it is felt that the commercial people do not\nrealise the complications which television will create. Commercial\noperators are planning film operations with kinoe from Cuba, Mexico,,\netc* They are not planning facilities for seen© building, visual\na&ds, @tc« , and AIPR should be way ahead in its planning* There\nare special problems in Puerto Klco which will require special\nsolutions* They are fearful but feel they have no choice and will\ngo ahead. Operation costs ar© a frightening factor, but they hep©\nthat the central distributing agency of the TIAEB will com© through\nwith a good quantity of good programs,,\nIn the discussion period that followed, the first question which\nwas asked was: what ar® th© chances of extension of the June 2 dead®\nlino? The consultants replied that if tho community could show\nactivity, tho chances are good for extension-* The deadline itself\nhas' bean a good thing in making the educators go ahead; however, it\nis likely that if pressure has kept a community from making progress\nthus far, tho same pressure will get the asterisks removed from tho\n•allocation lists*\nHas the report of the Sew Yox»k Commission hurt TY plans in the more\nprogressive states? It has, because construction permits had\nalready boon granted* But on tho other hand, it has served to\ncrystallize anppovt for educational television*\nIn os© community in North Carolina w© have th© support of commercial\noperators and no 'opposition* Vf© expect to b® able to raise some\nmoney. Our production possibilities are not too groat. If w© had\nenough money for a projector operation, what would w® be able to\nput on? The Chicago Center will bo putting out films -and kinoecops®\nwith an original goal of an hour a day within two yoapsj They hop®\nto produce educationally significant material©* NAEB la working\nvery closely with tho Center. $hat would the ’grass roots’ people\nlike NAEB to do? At on© point# NAEB planned to establish & film\ndistribution center, but this plan has temporarily been suspended*\nYour international committee found 1800 films abroad which will he\nuseful* la addition, there arc tremendous resources 'at the ’grass\nroots’ level. A film operation' can b® much, loss expensive than\nmany b©Xi©v©9 and not every station ha® to i>© a produet ion center*’\nOn the othor hand, th® boat program source la tho world for local\nstations is going to be the local community, and tho educational\nstation should make itself available to all community agcncios*\n?/hat is needed is faith. Vs have to get on the air and bo confident\nthat wo can program©\nShould a student who wants to go into educational television get a\nMaster’s degree? In Illinois tho decision has been mad© that train®\ning in television will be a fifth year study. A similar decision\nhas b®on mad© in North Carolina*\nThor© have boon ®ome very bad experiences with educational radios\ntelevision consultants trained in the media but knowing nothing of\neducation. There is a real need for trained personnel who know both\neducation and the media©\nHow can w© got accurate and adequate information on costa in &©!©■*>\nvision? Th© estimates sad© by Arthur Huagerford a® far back as\nt,h© Pena State conference ar© available in mimeographed form from"
}