{
  "id": "d220-44",
  "text": "- ^5 ~\nfch© N«.2B and the real pleasure which he felt in seeing th© dream\nof his early NA2B association come true in this very active\nKegion II meet!Qgp Ho then called upon the group chairmen to\nreport the findings of th© afternoon session. These are summarized\nas follow© : (Any d is cropanci es noted between the sec oian endat i ons\ngiven hero and those sent out by Kr. ochooley must be attributed\nto human fallibility in reporting - whose, this deponent aaith not),\nftha report for Group I waa presented by Hiss Camille Halyard.\nHow Gan KUSB Help Ha?\na o Programming, . .by sending out advance leaflets on all programs\nand program series which are mop© specific than those*at\npresent supplied nambars. Too often program chosen or rejected\non insufficient evidence. JVAYcJ OF MANKIND was cited so an\nillustration. (Send all a complete Hat of WAEB membership,\nAssociate, Active, and Affiliate)\nB* : 1) to allocate small grants to small stations to help\ncarry on special work in th© station;\n2) to giv© scholarships to help individuals (teachers)\nget further training in radio smd TV techniques*\nThis is carried on on a seminar basis in some\nplaces 0 but. . * i ncompt ot © , not all school system©\ncan afford trained radio people;\n3) to help pay for trips to production cantors for\ntraining ©ducators©\nc* ’«?Qffkshopa or seminars :\nlT tTle t up more' grass roots’ workshops, where\nmutual profit can be derived from various\n©xpepioness;\n2) to provide training session at regional workshops\nfor TV production (commercial station help, etc*)\nD* jj.ewsl ofet ary, « Complied bulletin... t\n^ j-j r-5 compTIe'Tescr i p t i o n and to giv© ©valuations of\nways TV is being utilized by public school system,\na 'do*a and dont*s column, in short,\n2) to giv© information as to th© prevailing ways of\nremunerating t‘al©at...to give scale for paying\nHad 1o~TV personnel, in education.\n3) to send out leaflets giving latest technical dave»\nlopm eat©.\n-^sohange Bureau...to help th© region cot up a way to exchange\nradio and TV scripts. Conferees are aware of the need for\nlocal programming, but a script exchange would be useful in\ncertain areas, auch as literature, which doesn’t have much\nlocalieEo\nHow Can >7e Help N&EB?\nA. Programming: 1) to offer suggestion© in which ways programs\ncan fit into modern school procedures (hours9\nflexible curriculum, etc.);\n2j to send in. list of our local programs so that\nan exchange column page might bo used in th©"
}