{
  "id": "d220-47",
  "text": "- 28\nfor the purpoae of setting' up a placement bureau,, Th© Ne^slstter\nshould sari'1© as a j ob-i nformati on \"source for educational Radio®\nTV persons instead of Broadcasting*\nRegional Productlon and Dlstributioa\nIt was highly recommended that stations within ©aoh particular\nregion set up a production and distributing center for dealing\nwith subject peculiar to the region, programs to b© made available\nto extra-regional station through NAEB.\n* * * * *\nThe report for Group IV was presented by Mr« Hoyt Calvin. The follow*,\ning recommendations were mad®*\nHow Can NAEB Help Members:\n1* The NAEB should investigate the possibilities of providing\n.consultant services to schools desiring to establish or\nimpro ve EM broadcast ingo\n2» Other miaeellaneoua comments of value:\na* Gaines advised that teacher training in radio utilization\nshould be an important factor in now school broadcasting\nopsratione*\nb* In television, it was mentioned that commsrci&l programs\ncan b© carried on educational television stations provide?!\nthat audio is cut off during the commercials, and this\nassumes the program itself was of a nature to be class!®\nfiefl as educations\nc» High gain should be secured in television installations\nby using a high gain antenna and wave guide transmission\nlines should be used between the transmitter and the\nantenna even though the first cost of these installations\nwill be higher*\nd. In purchasing television equipment, watch for adaptable\ncharacter!sties necessary in eas@ nor© power is added\nlater or even for the days of colox* television*\nHow Can Members Help NaEB?\n1. Exchange of personnel between stations bo encouraged and\nfacilitated by the Professional advancement Committee of\nNAEB o\n2o The NaEB should establish a Television Network on both the\nnational and regional basis*\n* * * * *\nFollowing the group report®, ih© members of the Executive Board of\nthe NAEB# Graydon Ausmus, Frank ochool©yfl Jim Miles, and Sy Siegel,\nsummarised the work of the conference* Other® present Joined in a\nlively discussion of the aim® and ideal® of NAEB and the accomplish*\nmeat® of the meeting* (For a statement summarising the summaries,\nsee Foreword * }"
}