{
  "id": "d220-48",
  "text": "UNIVERSITY FILM PRODUCERS ASSOCIATION\nDepartment of Cinema, USC\n3518 University Avenue\nLos Angeles 7, California\nFellow UFPA Members:\nAttached is the preliminary program for the Seventh Annual Confer¬\nence of the University Film Producers Association, which will be\nheld at the University of Southern California during August.\nThe general theme of the meeting will be \"Educational Television\nand the University Film Producer.\" Probably the most important\nproblem which we, as producers, face and will face in coming years\nis that of films for television. As time goes on, this will in¬\nclude practically all of us. The real challenge is in developing\nour techniques, personnel and facilities so that we can integrate\nthis type of production into our program.\nIn August, we will have a chance to thrash over the problems and\nto hear from many individuals outside the organization. As in the\npast, the agenda will include screenings, a chance to see the\n\"sights\", and some time for \"recreation\".\nI recognize that there are two problems confronting many of you,\nas far as your coming: l) selling your administration on the idea\nand 2) the expense. On the first point, if a letter from me re¬\nquesting your participation and pointing out the specific benefit\nto your program would help, please let me know to whom it should\nbe addressed and what approach would be most effective. On the\nsecond point, if you would be interested in a transportation pool\n(car, train, or airplane), let me know. We are hopeful that the\ntotal cost for meals and lodging during the conference will be\naround $35.00.\nIn order that we may correct our mailing list, please check and re\nturn the attached postcard, at once. If you know of anyone who\nshould receive notices of the conference who is not a member, let\nme know.\nThis conference is yours. Any suggestions you have will be most\nwelcome by your Program Chairman, Bill Blume, and the committee,\nEd Freed, Bill Jordan, and Harry Webb. Call on me if I can be of\nany help to you.\nCordially yours.\nSEVENTH ANNUAL CONFERENCE—August 17-21, 1953\nUniversity of Southern California\nAPR 3 0 1953"
}