{
  "id": "d220-59",
  "text": "REPORT OF THE PROCEEDINGS OF THE SEMINAR WORKSHOP\nREGION II, OF THE NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nPlace: Communication Center, University of\nNorth Carolina, Chapel Hill, N. C.\nTime: March 13 and March 14, 1953\n10:00 a.m. THIS IS OUR JOB.\nPromptly at 10:00 a.m. the Seminar Workshop of Region II of the NAEB was con¬\nvened by Earl Wynn in Studio A at the Communication Center, University of North\nCarolina, Chapel Hill. Mr. Wynn called upon Graydon Ausmus to make the invoca¬\ntion and then introduced Chancellor Robert Burton House of the University who\nspoke, not from notes but after notes played in him inimitable manner on his\nharmonica. ~The Chancellor then spoke with great earnestness of the signifi¬\ncance of educational broadcasting and telecasting in extending the educational\nfacilities of the universities of the country and the school systems to all the\npeople, pointing out that extension through radio and television was a logical\nstep in the history of this University and of most other major universities.\nHe welcomed the members most cordially to the campus and wished them well in\ntheir work.\nGraydon Ausmus, President of the NAEB, then welcomed the members in behalf of\ntheir national organization and spoke briefly of the importance with which the\nExecutive Board regarded regional conferences. Conferences such as these, he\nsaid, would be invaluable in providing new leadership, new ideas to the di¬\nrection of NAEB and would serve to fertilize and re-vitalize the work of members\non the '’grass roots1’ level. The first regional conference held at the Uni¬\nversity of Oklahoma last year had been an inspiring event, and he anticipated\nequally fine results from this conference in the Southeast.\nFollowing these messages of welcome, all participants were introduced to the\ngroup and the work of the conference was declared officially under way.\nThe first speaker was Seymour Siegel, Immediate Past President of the NAEB, who\nspoke on 'NAEB—Our Achievements.” Mr. Siegel reviewed rapidly the history of\nNAEB from its formation in 1929, its long period of comparable inactivity,\nthrough the significant events of the Allerton House meeting at the University\nof Illinois in the summer of 1949 when for two weeks the conferees, NAEB\nmembers discussed the nature of the educational broadcasting problem. The\nconferees referred back to a study made by Lazarsfeld in 1947 for NARTB,\n\"What Did the American People Think of Radio?\" NARTB had boasted of the re¬\nsults: 70% of the American people thought a good job was being done. The\nAllerton House turned that figure over and 30% of the American people were not\ngetting what they wanted. Were the commercial broadcasters right in saying\n\"the best radio program is one that sells the most goods,\" and \"radio can’t\nafford to be anything but commercial,\" and \"commercial radio is made in the\nimage of the American people and any criticism is a criticism of the American\npeople\"? The first conclusion of the Allerton House conference was that it was\nnecessary for educational broadcasters now scattered here and there over the\ncountry making bricks without straw to begin to exchange resources. The first\nprogram made available through WNYC was from Cooper Union, \"Great Themes in the\nGreat Hall.\" This project looked easy at first but soon became a tremendous\nburden for the NYC staff with no budget. Then in 1950 at Lexington there\nsuddenly became available to NAEB what looked like a vast sum - 0240,000;"
}