{
  "id": "d220-65",
  "text": "- 7 -\nchannels picked up by June, the consultation services will have to be consider¬\nably expanded. This will mean not only using our own consultants from the edu¬\ncational broadcasting field and from the advisory groups, but special con¬\nsultants from other areas. JCET is sending out a fairly considerable volume of\ninformation in its mailing service to potential applicants, and it must be\nremembered that these are local communities, not only states. Another national\norganization, the National Citizen*s Commission for Educational Television,\nRing Building, Washington, D. C., is most actively concerned with community\neffort, while the JCET largely represents the interest of education. The NCCET\nalso was established by The Fund for Adult Education. Milton Eisenhower and\nMarion Folsom are its Honorary Co-Chairmen. It is a very high powered and\neffective organization.\nThere is a third organization also in the picture, also recently set up by the\nFAE funds, The Educational Television and Radio Program Center of which George\nStoddard, President of the University of Illinois, is President of the Board,\nC. Scott Fletcher of the FAE and Dick Hull are members. Others include Dr.\nRobert D. Calkins, President of the Brookings Institute,Mr. Harold D. Lasswell\nof the Yale Law School, and Me. Ralph Lowell of Boston, banker and trustee of\nthe Lowell Institute, which operates the non-commercial educational FM station\nin that city. These are educators of stature. They plan to produce very few\nprograms themselves but to farm out the work, after the area of study has been\nselected, to educational institutions or commercial organizations. They will\nact principally as a Distribution Center. The NAEB has been the only organi¬\nzation to provide an Advisory Committee to the Center. This committee has been\nselected: George Probst of Chicago, H. B. McCarty of Wisconsin, Graydon Ausmus\nof Alabama, and Robert Hudson of Illinois (University of Illinois).\nThe FAE has offered matching funds to 13 key potential stations. The selections\nhave been made, primarily, on the basis of population, and educational grants\nmay follow. No announcements have been made of this.\nWhat has been the effect of all this high-level activity? There are 22 to 24\napplications in around the country, 13 or 14 construction permits have been\ngranted, and plans for activation are rapidly taking shape in a dozen or more\nplaces. The station at Houston, Texas, will soon be on the air. The station\nin Los Angeles expects to be on the air April 24. Typical of the activity was\nthe state-wide meeting in Florida on February 13-14: the Governor*s Conference.\nThe JCET, NCCET, and DuMont Laboratories have been flooded with requests for\nconsultants. Miami has an application in and there is promise of some equip¬\nment. Gainesville is making plans to go ahead, and Tallahassee likewise. The\nCitizens Committee of the JCET will be down there shortly. By June 2 in\nFlorida we can expect 4, 5, or 6 applications to be in.\nOf course, all over the United States the Educational Television forces are\nfighting the \"economy cry.*' Television is expensive, but compared to normal\neducational costs, the cost of educational television is insignificant, and\nwe must view the cost in comparison with the total cost of education because\neducational TV will have an effect of great magnitude on the total educational\neffort.\nMinnesota's legislative hearings are now going on and Burton Paulu, who was to\nhave been at this conference, is at those hearings.\nIn Wisconsin the plan was to install one or two stations this year and keep\nthe other allocations. This apparently will be the pattern in many places."
}