{
  "id": "d220-70",
  "text": "contact, it is very easy to get lax, and audience receptivity is going to be\nthe text of educational television. We will learn, of course; we will get\nbetter. Of the 13 kinescopes done here at the University of North Carolina,\nthe percentage of good ones, he thought was terrific; but those most closely\ninvolved knew that many were not as good as they had wanted them to be and\nthat, if they were done over, there would be things that would be done differ¬\nently. This attitude is essential.\nHe was convinced that educational television can be the greatest force in our\ngeneration, the greatest force for education since the invention of the print¬\ning press. But every bit of showmanship which can be developed will be needed\nbecause people, eager as they are to be challenged, are reluctant to admit that\nthey want to ”be educated.\" They will be interested in education if we can pro¬\nduce something that piques their interest. Even on the elementary level of\n\"The College of Musical Knowledge1’ where no mental calisthenics were called for,\nthere was some challenge to the listener. Although some of the questions were\non the level of ’’Who says, ’Lopez speaking?*, on two occasions he had received\nwrong answers.\nWhen people expect entertainment, they do not want to feel that they are being\neducated. When they expect education and receive it entertainingly, then we\nhave rung the bell. Entertainment in education does not mean dilution, it\nmeans interest. Don't think that because people ought to want education, they\nwill. . It must be presented as challengingly and provocatively as possible.\nA case in point of the failure to understand what showmanship really is was\nthe comment of one educator on the Psychology series mentioned earlier, that\n•'This was done without one bit of showmanship.” In the first place, the\nseries required that the lecturer boil down his material from 50 minutes to\n29 minutes; that meant that he could not wander as he might otherwise; that his\nmaterial had to be edited carefully; that he had to punch his points to get\nthem across. This is the essence of showmanship; the minute he started edit¬\ning, he was in show business. Any effective communicator is in show business.\nIn his own experience, Mr. Kyser paid tribute to a motion picture director who\nhad him work on the simple problem of going through a door from 9s00 in the\nmorning until 2:00 in the afternoon before they got a take. A lot of little\nthings were involved. It is these little things that will make or break many\neducational television shows; such things as not dropping your eyes in front\nof the camera but keeping in contact with the invisible audience. Everyone\nwho touches educational television must try to put all the possible showman¬\nship into it that he can.\nEducational television is on the soundest ground in the world. In commercial\ntelevision the problem is \"the word” - the plot, the message, what to say,\nwhat to do; and ”the word” is getting thinner and thinner. Hut for educational\ntelevision we have an endless fountain of knowledge. ’’The word” is what we have\nthe most of. Then too, our actors have the essential ingredient of great per¬\nformance: conviction. There is no need to worry about how you look on tele¬\nvision; if you have the conviction, it will show in your eyes and you will in¬\nvite people up through the tube.\nThe future of this great opportunity and challenging responsibility is ours:\nto take to all the people the storehouse of wisdom and know-how accumulated by\nour colleagues and their predecessors. There is a great part that the educa¬\ntional telecasters can and must play in getting educational TV off the ground.\nAnd after that, how high it flies is up to them. They are the pilots."
}