{
  "id": "d220-77",
  "text": "-19-\nIn Richmond, interest is high in educational television. The State Department\nof Education has allocated $2,000 to pay for the study of facilities and possi¬\nbilities, and plans to engage an engineer for necessary studies. The need Is\nfelt for \"booster stations.\" There are 5 UHF allocations to the State of Vir¬\nginia. After the Richmond meeting at which Mr. Wynn spoke and the panel dis¬\ncussion which followed, a great deal of interest was aroused and some progress\nhas been made.\nThe Virginia Museum has done little so far but has resources. It is planning\nto expand its services as a regional distribution center, adding theatre and\nmusic facilities. A new wing is being built for theatre, radio, and television\noperation. There is plenty of room on stage, good lighting facilities and ade¬\nquate shops. A separate staff is planned for this operation: a director, design¬\ner, and technician as a permanent staff. They will use local talent. Its pur¬\npose is to bring in eminent artists and scholars for the making of films. These\nof course will be available for the Fund for Adult Education’s Radio and Tele¬\nvision Center. They plan to make films on all the visual arts. It is felt\nthat the people of Virginia appreciate the rare opportunity offered by the ad¬\nvent of educational television. They are very conscious that what is done must\nbe good or the whole program will fail spectacularly.\nWEST VIRGINIA: Raymond D. Cheydleur, Director of Educational Radio-TV\nMarshall College, Huntington\n(Represented by letter as follows)\nI have delayed this letter in the hope that the situation would change\nhere. Due to the sudden illness of Professor Otis Ranson which has appar¬\nently turned into a prolonged affair, I will not be able to attend this\nyear’s convention. We have had to double up on the work, etc.\nI do want to add this, however, and that is: Come-or High Water, you\nmay expect me at the next meeting.\nDuring the last three years, Marshall College Radio has grown a great deal.\nWith little or no real educational radio and television being done in this\nstate, we have been able to add six courses in this field - have developed\na healthy enrollment in spite of declining college enrollments - have obtained\n$50,000 and have built modern educational radio studios - have pioneered in\neducational television with a series in Psychology.\nWe a re also in the early stage of developing a new Department of Advertising\nand we hope to have this in operation next fall.\nOur greatest problem is that of fighting the apathy, the ignorance, and the\nbackwardness of education in this state. Having been raised in the Wiscon¬\nsin system and having such good states as Illinois and Minnesota as neigh¬\nbors, I find that the snail-like progress being made in this area is most\ndiscouraging.\nThe one suggestion I have to make is that it might be well for NAEB to con¬\nsider some means by which an active public relations program may be carried\non. This should certainly be slanted for the information of college presi¬\ndents, deans, comptrollers, /and members of state board of finances.\nBest of luck with your conference. I’m certain it will be excellent,\n(Signed) Raymond D. Cheydleur, Director\nEducational Radio-TV"
}