{
  "id": "d220-89",
  "text": "INTRODUCTION\nIn this country, the efforts of the educators to\ndevelop educational broadcasting have been somewhat\nineffectual and have met with only a limited degree of suc¬\ncess. If one has been in the educational broadcasting field\nfor many years, this may, for the moment, appear extrava¬\ngant and without foundation, for he realizes that few areas\nof education have ever been confronted with such a variety\nof difficult problems. It is hard to imagine a Professor\nof English teaching a seminar in The English Novel of 1670,\nor a Professor History, with a course about The Princlpape\nof Augustus, having daily administrative problems as varied\nand complicated as those that confront the Director or\nManager of an educational radio station.\nCertainly in many areas of education there is little\nneed for the average'teacher to be concerned with the hand¬\nling of thousands of dollars worth of equipment, the\ndepreciation, and eventual necessary replacement of it.\nThe majority of teachers need never worry about pressures\nfrom Athletic Departments or other non-educational depart¬\nments, for broadcasting time. Neither do they have the\nproblem of seeing their trained staffs slowly but constantly\ntaken from them by the demands of industry for more seasoned\npersonnel. True, there is a constant turnover of personnel\nin all institutions, but that turnover is mostly from within\nthe field. Only a minority will leave the profession\naltogether; in educational broadcasting, it is probably\ncloser to the majority who leave to enter the commercial\nworld.\nIf one is new to educational radio and television,\nand one reviews its history, he gains a tremendous respect\nfor those who have fought the battle of ignorance and\napathy that has been met at every turn. At the same time,\nhowever, he is amazed at what hasn't been done and what\nhasn't been achieved in this important area of communica¬\ntions. Becuase operating budgets play such a serious part in\ndetermining the extent and quality of educational broadcast¬\ning, this study was made to determine just what the financial\npicture was in one year—the year 1954.\n1"
}