{
  "id": "d1550-0",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVol. IV,' No. 11 DuPont Circle Building, Washington, D.C. 20036 August 2, 1963\nNEW \"INSTRUCTIONAL TV FIXED SERVICE\" (2000 me) ESTABLISHED\nOn July 25, the FCC, hy Report & Order, established a new \"Instructional\nTV Fixed Service\" to promote ETV by using channels in the 2500-2690 me band to\ntransmit instructional and cultural material to schools and other selected receiver\nlocations. It will enable a central transmitter to serve scattered local schools and\nother reception points which, in turn, will convert the transmissions for viewing\non conventional receivers in those places. The 31 channels provided will permit\nsending different subjects simultaneously. As the FCC explains, \"The primary\npurpose of the new service is to provide for the licensing of transmitting facilities\nto send visual and accompanying aural instructional material to selected receiving\nlocations in accredited public and private schools, colleges, and universities for\nthe formal education of students.\"\nSystems licensed for this purpose may also be used for other incidental\npurposes, such as transmission of cultural material, special training material, and\nspecial material to professional groups or individuals. They may also be used for\nadministrative purposes, and to relay material to and from commercial and noncommercial\nTV stations, but not to interconnect TV fixed systems in different areas, or to\nestablish relay systems to cover an entire state or large portion thereof.\nAs a result of NAEB urging, eligibility in the ITV Fixed Service is identical\nwith that of the noncommercial educational TV broadcast service. Ten watts is\nconsidered to be the nominal amount of power needed, but higher powers may be\nauthorized in special cases. The new rules are being made effective Sept. 9 to\nenable school systems to plan making use of this auxiliary service and for manufac¬\nturers to begin development of the equipment needed.\nFM FREEZE T.TkW.n\nOn July 25, the FCC adopted a table assigning the 80 commercial FM channels\nto states and communities, and lifted (except for Puerto Rico and the Virgin Islands)\nthe freeze on applications for new commercial FM stations or channel changes which\nwas imposed last Dec. Channel assignments in the table (including those to existing\nstations) total approximately 2,830, in 1858 communities in the 48 conterminous\nstates. All new assignments conform to a table of minimum co-channel and adjacent\nchannel mileage separations which was adopted by the Commission July 25, 19&2. New\nrules which accompany the table of assignments and are effective Sept. 11 are\ngenerally the same as those pertaining to the TV assignment table.\nFurther rule making is promised with regard to future assignments on the 20\neducational FM channels (and also as to future assignments in Hawaii, Alaska, Puerto\nRico, Guam, and the Virgin Islands). Pending these further proceedings educational\nassignments will continue to be made under existing provisions. Applications for\nnew or changed facilities on the top three educational channels (2l8, 2191 & 220) must\nstill comply with the minimum mileage separations and other requirements with respect"
}