{
  "id": "d1550-12",
  "text": "-12-\nPROPOSED NAEB TAPE TESTING PROGRAM\nTest tapes should be sent to Mr. Edward Kratt, Radio Station WNYE,\n29 Fort Greene Place, Brooklyn 1, New York. They should carry an indica¬\ntion of the make, model and serial numbers (both transport mechanism and\namplifier) of the recorder used as well as make, model and serial numbers\nof the test oscillator used.\nTapes should be recorded at 7 1/2 inches per second.\nRecording levels should be maintained as indicated below. \"Reference\nrecording level\" for these tests is defined as the level indicated by maxi¬\nmum peaks on the recorder VI meter. This is usually 0 DB. If a different\nmaximum recording level is used, please so indicate. Record test tapes as\nfollows:\n1. (A) At reference recording level, record two minutes of continuous\n1*00 cps tone.\n(B) At 10 DB above reference recording level, record two minutes\nof continuous 1*00 cps tone.\n(This may easily be done by inserting a 10 DB pad between os¬\ncillator and amplifier for step A and removing it without\nchanging amplifier gain for step B. As the VI meter will\ndoubtless go off scale for' step B, one terminal of the VI\nmeter may be disconnected.)\n(The above to establish reference level and to check dis¬\ntortion)\n2. Two minutes of no recorded sound (blank tape) accomplished by dis¬\nconnecting the oscillator and terminating the input of the record¬\ning amplifier with a matching resistor.\n(To check noise)\n3. At 20 DB below reference level, record one minute of continuous\n^000 cps tone followed by two minutes of continuous 7500 cps tone.\n(To check head alignment)\n1*. At 20 DB below reference recording level, record continuous tones\nas indicated below. Test oscillator output should be held constant.\n■loo\ncps\ntt\n30 seconds\n1*000\ncps\n10\nseconds\n50\n10 . \"\n5000\nit\n10\nit\n100\ntt\n10 \"\n6000\nn\n10\ntt\n200\nit\n10 \"\n7500\n10\ntt\n500\ntt\n10 \"\n10000\ntt\n10\ntt\n1000\ntt\n10 \"\n1*00\ntt\n10\ntt\n2000\ntt\n10 \"\n(To check frequency characteristic)\n£. At 20 DB below reference recording level, record five short pulses\nof 3000 cps tone one second apart. The start of -the fifth pulse\nwill be used as a starting time reference.\nAfter a few seconds silence, record a 3000 cps tone for approxi¬\nmately lli minutes followed by another few seconds of silence..\nThen, record five more short pulses at one second intervals with\nthe start of the fifth pulse exactly fifteen minutes after the\nstarting time reference noted above.\n(To check timing, flutter and wow)"
}