{
  "id": "d1550-2",
  "text": "Auric on 1200 camera for making kinescope recordings. He’s had little or no luck in\nsecuring information on this process although he’s been trying to find out about it\nsince March. We have knowledge of only KUHT in Houston and KCTS in Seattle having\nsuch equipment, and when we last heard from them neither station had achieved the\nresults they required for on the air use of these ”kines.”\nIt?. Bundy suggests a questionnaire to obtain a summary of the experience of those\nusing the above equipment in connection with a high quality monitor to make kinescope\nrecordings. Questionnaires can be a nuisance and are easily pushed back in a desk\ndrawer. First we’ll have to determine who is using this method of kine recording;\nthen we’ll be ready for the questionnaire stage.\nPerhaps you are one of those making kinescope recordings with an Auricon equipped\nwith a TV shutter, and are willing to share your experience with others who would\nalso use the system. If so, won’t you drop us a short note saying you’re willing to\noutline your experience to help others? If you feel like going on and supplying some\ndetails of your experience we’d be happy to have them, and we’ll see that Mr. Bundy\nand others who are interested receive them.\nOtherwise we’ll probably be sending out a letter to all educational TV stations and\nclosed circuit studios with an enclosed card upon which you can indicate that you\nhave had experience with this system of kine recording, which from the standpoint of\ninitial investment costs less than a third of a GPL or RCA kine recorder. After\nthat, you’ll receive our questionnaire—but Bundy, and there may be others, would\nlike the information now. Will you cooperate?\n***********\nWhile we’re speaking of video recording, on November 9 Bing Crosby Enterprises Inc.\ndemonstrated the new improvements on their TV tape recording system. This system is\nsaid to be of commercial quality now for monochrome television, but it is expected\nthat it will be eighteen more months until the system is of commercial quality for\ncolor TV. Observers reported the color tape demonstrated gave pictures of fair to\ngood quality, but did not equal the live pictures seen on the screen of a color TV\nset.\nPreliminary estimates place the price of the video tape recorder at $60,000 to\n$75,000 as compared with $18,500 for a kinescope recorder. However, magnetic tape^\nrecording of video signals when perfected, should offer many advantages over the film\nmethod. Qf these advantages, instant playback might well top the list since we could\ncompare tape quality directly with our live pictures. Magnetic tape may also be\nedited quickly and easily, and it is reported that duplication is no problem. The\nfact that the tape can be erased and used over and over again should also contribute\nmaterially to the reduction of cost of video recordings.\nAs demonstrated, the video tape recorder employed the regular 3M No. Ill-A audio tape\nexcept that it is one-half inch wide. Tape speed is 180 inches per second. For\ncolor recording, five tracks are used, one for each primary color, one for sound and\none for synchronizing pulses. Present bandwidth recorded is 2.5 megacycles, which\nis coaxial cable quality; however this bandwidth is expected to be raised to 3 me\nwithin the next year.\nOthers in the field apparently believe that video tape recording is still ’’around\nthe corner” which monochrome television hid behind for so many years. They point out\nthe large investment in film equipment, the huge back log of film and the large sum\nNBC is spending to equip its network originating studios with color film equipment."
}