{
  "id": "d1217-10",
  "text": "-11-\n1947 GEORGE FOSTER PEABODY AY'AIDS\nFive network radio shows and three individual stations carried off Radio’s highest\nhonors. They were recently named at a luncheon in New York as winners of the 1947\nGeorge Foster Peabody awards.\nPresident William Hedges of the New York radio executives club presided as.three\nawards went to the American Broadcasting Company and two to the Columbia Broad¬\ncasting system. Other awards went to station WBBM of Chicago (CBSTT KXAR .of-Hope,\nArkansas, (MBSyV and V:QQW of Washington. D.C, Three additional special citations\nwent to station T.CCO of Minneapolis (CBSV; the Columbia Broadcasting system; and\nthe United Nations Netvrork for Peace.\nFirst Award\nAward number one, to WBBM, is for outstanding public service by a regional station\nfor its program ’’report uncensored.\" The citation reads-’’This program has helped\nto educate and arouse a great community to the cause of juvenile delinquency,”\nThe first special mention is in this same class, to PCCO for a series called \"As\nthe Twig is’Bent.\" It brought the passage of a state youth conservation law for\nMinnesota.\nSecond Award\nAward number two is for outstanding public service by a local station, to KXAR for\nits disaster broadcast fronTcotton valley. The award committee says---\"Here .is\nthe remarkable record of a new station which rose to the crisis when the neighbor¬\ning county was devastated by a tornado...Mutual Broadcasting system should be proud\nof this junior.\"\nComments on Award\nThe CBS program \"CBS views the Press\" wins the commentary award. The citation.\ncomments—\"If the FCC criticizes radio, the newspapers print the story with glee.\nBut if radio has the temerity to criticize the press, each newspaper looks the\nother way and ~says—'tWHO, ME?r’»_The~?eabody committee calls the show a \"hard¬\nhitting, frequency witty, and always stimulating criticism of the New York press• ’’\nRadio Reporting\nThe 1947 peabody prize ; for radio reporting goes to Elmer Davis of the American\nBroadcasting Company, who took the 1939 award. The committee says--\"In a day of\nhysterical utterance, his resolute reasoning points steadily toward a possible\npeace. ’’\nFifth Award\nAward number five, for drama, is another prize for ABC. The show is the \"Theater\nGuild of the Air,\" and the citation says--\"It has done what every great company\nalways dreamed of doing, it has brought the best of the theater into every home,”\nSpecial Citation\nA special citation in drama honors the CBS program \"Studio One\" for what the_Peabody\nCommittee calls~Taste, Restraint and Radio Craftsmanship.\"\nThe third ABC award of 1947 is for music—-the presentation of the Boston Symphony\norchestra."
}