{
  "id": "d1217-11",
  "text": "•12-\nEducational Award\nNext in these \"Academy Awards11 of the broadcasting field is for the outstanding\neducational program—to CBS for documentary shows on housing, health and old age\nsecurity. The Peabody .judges also mention the series called \"CBS is There,” an\nunusual method of making history come alive„\nIn this educational group comes the third special citation for 1947-—to the United\nNations network for peace. 115 American stations which banded together to carry\nactual U-N debates.\nChildrenfs Program\nEighth in the seris of top performers of 1947 in radio is LQQL of rashington-The\nprize is for the best children!s program of what the Peabody committee calls a year ■\nof generally poor children’s programs.\nPresentation\nThe awards were first presented in 1940. They are in memory of George Foster\nPeabody, a New York banker and life trustee of the University of Georgia. They\nare administered by the Georgia journalism school and the National Association\nof Broadcasters.\nThe awards were presented by Edward leeks, Editor of the Atlantic Monthly and\nhead of the Peabody Committee, and Dean John Drewry of the Georgia School of\nJournalism.\nPEABODY POSTSCRIPT\nThe Peabody Award Luncheon furnished the setting for some \"double-digging\"\nby Edward Leeks, editor of Atlantic Magazine, who made some sharp comments\nabout radio, and Elmer Davis, aBC commentator who reciprocated with respect\nto the publishing business.\nInstead of the compliments expected by the radio representatives in the audi¬\nence, Leeks began his remarks with a criticism of radio. He believes radio\nneeds a good overhauling, and compared it to a youngster searching for his\nfirst success.\n\"Then radio finds a success,\" said Leeks, \"it repeats it over and over until\nI and five-million other listeners could throttle it..\"\nAt this point radio statiqn managers and the performers who were guests at\nthe luncheon began to look glumT Their smiles did not return until the\nfirst award winner, Elmer Davis was introduced. Davis accepted his medal\nfor outstanding reporting and then stepped to a microphone.\n\"It is true,\" said Davis, \"that radio repeats a success.\" Then he added that\nthe practice of repeating it isn’t Unknown in the publishing business. Lhile\nveeks stepped aside, the audiepoe smiled broadly as Davis continued. \"The\npublishing business has been making more money than ever before these past\nfew years, and they've been publishing more books than ever! but I doubt that\nthese books are all better than they used to be..\""
}