{
  "id": "d1217-2",
  "text": "-3-\nN-A-E-B stations involved in the clear channel issues include the follow¬\ning:\nT'NYC, City of New York IrTNAD, University of Oklahoma\nKUOM, University of Minnesota WCAL, St.Olaf College\nKOAG, Oklahoma A. & M. College WOSU, Ohio State University\nV'KAR, Michigan State College WHCU, Cornell University\nWOI, Iowa State College\nHull presented the committee with letters from the Iowa Farm.‘Bureau Federation\nand the Farmers Grain Dealers Association to support his claim there is.a demand\nfor night broadcasts by WOI, The Iowa State College station now is limited to\ndaytime operation because Station KFI of Los Angeles, California, holes clear\nchannel rights to the wave length used by WOI,\nEarlier, James G. Patton, president of the National Farmers Union,.said that agri'\ncultural colleges should be permitted to have better radio facilities, and farm¬\ners better radio service.\nCalled \"Scandal\"\n\"One of the scandals of our day,\" he said, \"is the fact that our great agricultur¬\nal colleges cannot broadcast the information which they have to the farmer at\ntimes when the farmers wish to listen.\n\"I suggest that the FCC work out a pattern so that every state or region has a\ncollege or nonprofit station to which all farmers can listen day and night.\"\nHull said that N-A-E-B takes the position that college and university stations\nshould be permitted to meet the \"needs and wants\" of their listeners at night\nas well as during the day. He added: \"The grant of superpower to the.present.\n1-A clear channel licensees would not only prevent college and university stations\nfrom securing nighttime broadcast hours which are so essential in order.to reach\nthe largest audience, but would also have the effect of seriously curtailing the\nservices to the present radio listening audience during the day.\"\n-*-** -***\nRADIO COUNCIL WINDS UP SUCCESSFUL YEAR\nOne of the country’s most successful radio councils celebrated another year of\nfruitful activity at its annual spring banquet Monday, April 12,. At the Roose¬\nvelt Hotel in Cedar Rapids, Iowa, the members of the radio council, which includes\nrepresentatives from more than a dozen local organizations, met to mark another\nyear of activity. Represented also were Cedar Rapids’ two radio stations, I MT\nand the new KCRG and its FM adjunct, KCRK. Main event of the evening was the\nmemorial talk presented by Mrs, Virgil Hancher, wife of the State University of\nIowa president to honor the memory of Pearl Bennett Broxam. Pearl Broxam was a\nworker for many years in educational radio as program director at station i SUI,\nUniversity of Iowa, Her accidental death last November deprived educational\nradio of one of its hardest workers. Everyone in Iowa radio felt the loss,. A\nPearl Bennett Broxam Memorial Fund has been started by the Cedar Rapids Radio\nCouncil to provide prize incentives for high school students interested in radio."
}