{
  "id": "d1217-22",
  "text": "From THE COOPERATIVE CONSUMER - March 31, 1948\nRURAL RADIO AT STAKE\nFar-reaching decisions are being made in Washington just now in the field of radio.\nOne issue of the greatest importance is whether already-powerful radio stations shall\nbe given even more power to dominate the air- another of like importance is whether\nthe owners of radio stations shall be given the privilege of expressing their own\neditorial views on the air and thus, by virtue of their special position, be able to\nexert great Influence on the formation of public policy*\nHow these decisions are made *111 depend upon the qualities and the attitudes of the en\nwho make them; and here is introduced a question that, though it likely will not come\ninto the open as a formal issue, is important not only to the radio decisions but to\nthe whole future of democratic self-government.. It may be put this way: 1 hat hope s\nthere in the government for the conscientious public servant who tries to serve the\npeople’s interests?\nClifford J0 Durr has made a record of serving the people’s interests as a meraber of the\nFederal Conmmnications Commission* He has championed, to take one example, better\nradio service for farm people. He has opposed the big radio interests on more than\none occasion*\nDurr’s term of office as a member of FCC is due to expire on June 30, and the President\nhas not sent his name to the senate for reappointment* Does this mean, as in the recent\ninstance of Mariner Eccles of the federal reserve board, another conscientious public\nservant being sacrificed?\nThere Is no assurance, of course, that the senate would confirm Durr's reappointment\neven if it were made. The people whom he has served are scattered over the whole\nnation, concerned with other things. The vested interests he has opposed, in this\ncase the big radio owners, are at the scene., They and their errand-doers in and out\nof congress can gang up and get what they want*\nIf Durr is sacrificed on the altar of reaction, the people of the country will be the\nlosers and, as Maurice dieting points out in his article in this paper, rural radio\nwill suffer a loss from which it may never recover*«\nVARIETY MAGAZINE, spokesman for the show business and the radio industry made a special\nApr! unusual award to FCC Commissioner Durr on March 12, 194V®\n\"Clifford J. Durr is one of the few Commissioners in the history of the FCC\nwho has been able to see the woods for the trees. By contrast with the lawyers\nand engineers who have usually been his colleagues, he has insisted that the\ndecisive criterion of radio service is not primarily the coverage pattern, the\nbalance sheet, or the subtleties of a practitioner before the FCC Bar, but..what\ncornea out of the loudspeaker—the proggam*\n\"It is pre-eminently Durr who has refused to lend his assent to Commission\ndecisions which might tend to corrode the foundations of a truly free,.,aSa\n^monopolized radio,, It Is Durr who has struck out sharply against inflated sale\nprices for facintiea which are primarily the .property of.thepul&ico And"
}