{
  "id": "d1217-9",
  "text": "RADIO AND EDUCATION PARTNERS. SAYS MILLER\nRadio and education have a bright joint future, Justin Miller, president of the\nNAB commercial trade organization, told the third annual Georgia Radio Institute\nthis week at Athens, Broadcasting, he said, is an expanding industry which will\nin size rival automobile manufacturing within a decade. But he warned that it\nwill \"bring difficulties and headaches as well as wonderful new programs*1. Train¬\ning of personnel to guide the industry is a vital problem, he added.\nIdentity of Interests\nHiller said broadcasters and educators have not always seen that their interests\nare common. 11 On the one said/1 he said, nwe have seen opposition by a few broad¬\ncasters to the licensing of educational stations and to state-supported educational\nbroadcasting, and on the other side we have seen the incongruity of a few educators\n—trying to tear down freedom of speech over the radio and urging Government con¬\ntrols for radio programming.H\nMiller expressed the hope that \"as time goes by, both sides will see the identity\nof their interests in preserving all the freedom which makes broadcasting useful\nto both groups.\"\nCause of Decreased Number of Educational Stations\nThe NAB president attributed the decline in the number of educational stations in\nthe 1930*5 to poor programming, the depression, and poor management, but added\nthat competition by entertaining programs was a greater contributing factor.\n\"A university professor, lecturing successfully, in the &64 vocabulary of his\nprofessional mystery, to a carefully selected group of young intellectual giants.\nsometimes turned out to be a very poor attraction on the radio— it v;as too easy\nto tune out the professor and tune in the comedian,\" Judge Hiller told the insti¬\ntute audience.\n*7-*-\nThe National Association of Educational Broadcasters is on record as approving the\nprinciple of commercial radio as it operates in the American system and of oppos¬\ning government ownership of radio. However, N-A-E-B has insisted on the necessity\nof furnishing special programs for special audiences and enriching the U.S. radio\ndiet, which effectively serves only two-thirds of U.S, listeners, by producing\nspecial programs for the other one-third who are not now regularly served by most\nU.S. radio programming. _____~~___\nFOUR HOURS CP MUSIC (OPERA, BALLET. JA?Z) ON NET.' YORK EDUCATIONAL STATION\nMusic lovers will be able to enjoy four hours of uninterrupted music on the Munici¬\npal Broadcasting System (NAEB member station WNYC), Saturday afternoons, beginning\nApril 17, when three new music series will have their premieres0. Great Operas,\nwith Thomas H. Cowan as commentator? Ballet Time, presenting music of the classical\nand contemporary ballet, and Jazz Jubilee, commemorating a half-century of jazz in\nNew York City, currently observing its golden anniversary.\n\"Great Operas\", scheduled from 2;30 to 5:00 p.m. on Saturdays, will present full-\nlength recorded operas, with guest appearances by well-known figures in the world\nof opera reminiscing with Thomas H, Cowan._Mr. Cowan also conducts the Monday night\n\"Velvet and Gold\" opera hour on the City Station (8;00-9:45 P.m. on WNYC and WNYC-FM)\nBallet Time will be heard from 5;30-6;15 p.m. on Saturdays and Jazz Jubilee from\n6;15-6^45 P.m. Master of ceremonies for Jazz Jubilee will be Jack Lazare, who also\nconducts the daily Disc Date on WNYC from 5s00 to $”55 P.m,"
}