{
  "id": "d1323-0",
  "text": "THE PRESIDENTS SAY\nThe Center (NETRC) has announced that it will shortly open a\nWashington office!\nThis announcement may remind some of the story of the young Abe\nLincoln, who in providing an inventory report of household goods\nto be offered for sale, enumerated them as follows: 1 stool with\nleg missing, 1 chair with seat out, and one rifle that might be\nworth looking into.\nLet’s do some looking into it - together. Is a Center Washington\noffice a gun at our head? Or is it an additional arm, close at\nhand, to help carry on a common campaign?\nThe Center’s move to open an office in the nation’s capital is\nbased on its growing realization of a need for expert on-the-spot\nemergency and staff help to serve its network stations and to\nprovide for its own service of information upon which to base Center\npositions; the immediate stimulus for activating the office is\nthe up-coming modification of the JCET. (See\"Washington Report”)\nThe intention of the Center to come to Washington has provoked a\nnumber of concerns - and conferences. Was this encroachment?\nWould it mean unproductive conflict and wasteful competition?\nWho’s to do what? And to whom? Or with whom?\nThe Center people agreed fully and it was in this mood of mutuality\nthat the discussion was carried on. The results, I believe, were\na much better understanding of our respective purposes, agree¬\nments on coincidental approaches and activities, and a shared\ndetermination to make a real effort toward not mere peaceful co¬\nexistence, but purposeful co-effort.\nNow, let me reassure some. I am fully aware of the risks of\nriding a tiger or lifting the tent flap for a camel. And NAEB,\ndespite its willingness to cooperate, is equally determined to\nadhere to certain principles and have care for certain concerns.\nThe NAEB, whose principal resource is people, has a responsibility\nto see to it that the mobiliztion of effort in use of the new\nmedia in the service of education remains subject to democratic\ncontrol. There is a deep feeling in the association that these\ninstruments in careless or unskilled hands or in control of those\nwho would exploit them for ignoble purpurposeor special advantage\ncan be most dangerous. It will always be our obligation as a\ngrass-roots bastion to see to it that these miracle devices are\nresponsibily used as powerful forces for enlightment.\nHowever, we would be derelict if we did not explore all reasonable\npossibilities for organizational cooperation. No one group can\ndo the job alone. Xa Realizing the ssxxlKsxtkxmxkss the sense it\nmakes to coordinate common efforts, the NAEB chose to make this\nmatter the occasion for a fresh approach to NAEB-NETRC relation¬\nships. A day-long meeting was held January 19 of officers of both\nagencies to (1) establish a common ground for understanding and\ncooperation and (2) develop a joint plan for reallocation of\nformer JCET staff services."
}