{
  "id": "d1323-0",
  "text": "A E B\nm\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. 28, NO. 7 JULY, 1963\nNAEB at the IERT\n• At the NAEB Board meeting which preceded the IERT in\nJune, O. Leonard Press was elected secretary and Harold Hill\nwas elected treasurer of the NAEB.\n• The Board passed the reorganization plan which the Plan¬\nning Committee has been working on for several months.\nPreliminary plans have been presented at previous regional\nmeetings and special-interest conferences, and the plan as ap¬\nproved by the Board was presented to those attending the\nNAEB luncheon at the IERT. This version will be distributed\nto members by mail prior to the Milwaukee convention, where\nit will be discussed and voted upon.\n• Only about half of those attending the NAEB luncheon\nclaimed Individual Membership in the NAEB.\n• The Radio Seminar Committee (see May Newsletter) met\nseveral times during the IERT to plan the next radio seminar,\nwhich will be in Chicago in January, 1964.\nFour More Go to Samoa\nIn mid-July four more men will go to Samoa to work on the\nNAEB ETV project there. They are: Blair L. MacKenzie,\nformerly general manager of WHRO-TV, Norfolk, who will\ndirect ETV operations in Samoa; John D. Giovannini, from\na Green Bay (Wis.) commercial station, who will be manager\nof operations-production; and two TV engineers—Harry R.\nFlynn, Jr., from Auburn, Ala., and Albert O. Peck, Jack¬\nsonville, Fla. Henry Cronin, chief operating engineer, is al¬\nready in Samoa.\nVernon Bronson, NAEB director of research and develop¬\nment, who will accompany the men to Samoa, recently said\nthat he expects to recruit TV teachers and supervisors this\nsummer, for work in the fall. He also said that all bids are\nin on the equipment. Design engineers for the project are\nCarl Smith Electronics, Cleveland, and William G. Kessler\nis the project engineer.\nAdvance Registrants to be Insured\nNAEBers who register for the Milwaukee convention before\nNovember 1 will receive insurance coverage free of charge.\nThe policy provides for $10,000 in case of accidental death and\n$1,000 ($25 deductible) for medical expenses in case of acci¬\ndent. Participants will be covered from the time they 'leave\nhome for the convention (or 72 hours before the convention,\nwhichever is a shorter length of time) until they arrive home\nafter the convention is over (or until 72 hours have passed).\nThis will be in effect only for adults and spouses who register\nin advance.\nNAEB Will Aid USIA\nUnder the terms of a contract recently signed with the U. S.\nn Information Agency, the NAEB will assist in the develop¬\nment of a new series of English-teaching programs to be\nused in radio broadcasts. The NAEB will prepare an outline\nfor a program series for teaching English from the elemen¬\ntary to the advanced level, as well as 65 completed scripts.\nThe NAEB will also prepare a series of 39 quarter-hour\nscripts for teaching intonation, rhythm, and pronunciation at\nthe intermediate level. The USIA will place the recorded pro¬\ngrams on local radio stations overseas, as an extension of its\nfield program of teaching English overseas.\nUSIA has already conducted an extensive English-teaching\nprogram via television, but radio has a larger audience than\nany other means of communication in many parts of the world.\nThis audience has increased sharply in recent years, largely\nthrough the introduction of low-cost transistor receivers.\n250 Attend IERT\nRegistrants numbering 250 for the 33rd annual Institute for\nEducation by Radio-TV convened at the Nationwide Inn, Co¬\nlumbus, Ohio, June 12-14 to study better programing in broad¬\ncasting. As an aid to the studying, outstanding television pro¬\ngrams were distributed via the motel’s closed-circuit system\nand could be received in each guest room. Taped radio pro¬\ngrams were also available for audition. The programs were\nselected from among the entries in the 27th annual American\nExhibition of Educational Radio and Television programs.\nThis year 722 programs (343 radio, 379 television) were en¬\ntered by 201 entrants.\nAWARDS\nAmong the award winners were the following educational\ninstitutions: MPATI and Wayne State University, for a\nprogram in the series En Avant! French II, network in¬\nschool TV program for children and youth; University of\nMichigan Television Center, for “Rebel to Reformer,” local\nout-of-school TV program for adults; Western New York\nEducational Television Association, Inc., and New York State\nDepartment of Education, for “American Literature: Senior\nHigh School,” local in-school TV program for adults;\nWENH-TV, University of New Hampshire, for “Art at your\nFingertips,” local in-school TV program for children and\nyouth; KOGO-TV (commercial station) in cooperation with\nthe University of California Extension and the Community\nEducation Council, San Diego County Schools, for “Man in\nSpace,” local in-school TV program for adults; WOI-TV in\ncooperation with the Iowa Joint Committee on Educational\nTelevision, for “Iowa TV Schooltime-Domino’s Doctor,” in¬\nschool TV program for children and youth; the New York\nCity Board of Education in cooperation with the School Tele¬\nvision Service of WNDT-TV, for “Voting Booth, U.S.A.,”\nlocal in-school TV program for children and youth; Radio-\nTV Section and Bureau of Correspondence Study, University\nof Colorado, for “Music of the Dry World,” local in-school\nradio program for adults; the Minnesota School of the Air,\nfor “The Soft-Loud Gets Tuned,” local in-school radio pro¬\ngram for children and youth; WHA and the Wisconsin\nSchool of the Air, for “Songs of Spring,” local in-school\nradio program for children and youth; WBGO-FM, Newark\nBoard of Education, for “Africa: Many Faces, Many Pat¬\nterns,” local in-school radio program for children and youth;\nWFBE, Flint (Mich.) Public Schools, for “The News of the\nWeek,” local in-school radio program for children and youth;\n1"
}