{
  "id": "d1323-1",
  "text": "-2-\nI opened the meeting by reminding everyone that our initiation of\nthis meeting was in keeping with NAEB’s traditional position of\ndoing whatever it can to foster the best interests of educational\nbroadcasting, regardless of its possible impact on the association.\nThe NAEB is a sel-help organization in which we \"associate ourselves\nto promote, by united effort and mutual cooperation, the dissem¬\nination of knowledge, inforumation and education to the end that .\n... benefits of broadcasting may be extended to all. If others\nare better able and more competent to carry out certain aspects\nof this purpose, more power to them. The NAEB role in organizing\nthe JCET and blueprinting the Center testify to this consistent\nattitude. Moreover, that the present officers of NAEB believe\nthe needs of our nation transcend the Association and personal\nconsideration.\nIn our view, the time had come to forgetj# petty jealousies and\nold wounds and get on with the job - mobilizing our efforts\ntoward common goals by developing a unified, coordinated, mutually-\nsupporting modus vivendi within the general frame of a network\nand trade association relationship. As Loren Stone expressed it,\nit was time to stop thinking in terms of \"us” and \"them\" and think,\ninstead, of \"we”. What are we going to do?\nA diversity of organizations is needed. But so is recognition of\nthe necessity for yielding of some sovereignity by all to the\ncommon effort. NAEB reaffirms its offer to cooperate with all\ngroups and all states who are resolved that these tools are to be\nused for the benefit of humanity and who are resolved that\nindividual differences between them must yield to these higher\nneeds.\nIf the tandem harness with NETRC does not work out, another Lincoln\nstory may be appropriate. A letter from General McClellan telling\nhim how to the country reminded him, Lincoln said, of the Irishman\nwhose horse kicked up and caught a foot in the stirrup.\n\"Arrah!\" said he. \"If you1re going to get on, 1*11 get off.\""
}