{
  "id": "d1261-4",
  "text": "the world today, features appearances by various\nmembers of the NYU staff and faculty.\n► “American Foreign Policy 101 — Europe and\nAsia,” an undergraduate course, will be televised by\nthe Metropolitan Educational Television Assn, in\ncooperation with Hunter College starting Feb. 5,\naccording to META's president, Dr. Alan W. Brown.\nThe series of 15 TV classes will be conducted by\nDr. John G. Stoessinger, assistant professor of politi¬\ncal science at Hunter, on WPIX from 11:30 a. m. to\n12:30 p. m. each Wednesday.\n^ The challenge to American education will be put\nsquarely before the public when the Educational\nPolicies Commission holds a special “hearing” before\neducational TV cameras Feb. 12 in New York City\nat the studios of META. The program will be pro¬\nduced by META for the ETRC at Ann Arbor, Mich.\nPlanned to show Americans what they can do to\nstrengthen the educational system in this country,\nthe hearing is being filmed for delayed broadcast\nover the nation’s educational TV stations. Present\nplans call for two hour-long programs. The production\nis financed by the Center.\nThe unrehearsed meeting will be conducted in a\nmanner of a regular hearing of the commission. To\ndwell on subjects of critical importance in view of\n^ recent worldwide developments, the session will con¬\nsider such topics as science education, Russian edu¬\ncation and the teacher’s part in strengthening edu¬\ncational processes.\nThe Educational Policies Commission was created\nby the National Education Assn, and the American\nAssn, of School Administrators to formulate policy\nand advise on educational problems in this country.\nBOX SCORE\nTotal AM Stations\n3195\n(includes\n38 n\non-commercial)\nTotal FM Stations\n677\n(includes\n140 n\non-commercial)\nTotal TV Stations\n572\n(includes\n28 n\non-commercial)\nFURTHER NAEB\nCOMMITTEE APPOINTMENTS\nIn addition to the committee appointments an¬\nnounced in the January Newsletter, President Burton\nPaulu has appointed the following persons to two\nad hoc committees:\nUHF Tax Relief Committee — ad hoc — Frank¬\nlin G. Bouwsma, Station WTVS, Detroit, chairman;\nRichard S. Burdick, Stations WHYY-FM-TV, Phila¬\ndelphia; Richard Hull, Stations WOSU-AM-FM-TV,\nOhio State University; Jack McBride, Station\nKUON-TV, University of Nebraska; Uberto Neely,\nStation WCET, Cincinnati; Richard Vogl, Stations\nWOI-AM-FM, Iowa State College.\nMagnuson Bill Committee — ad hoc — Robert\nSchenkkan, Radio-TV, University of Texas, chair¬\nman; Mrs. Gertrude Broderick, U. S. Office of Edu¬\ncation; Vernon Bronson, Stations WTHS-FM-TV,\nDade County (Florida) Board of Public Instruction;\nJames Day, Station KQED, San Francisco; Earl\nWynn. Station WUNC-TV, University of North\nCarolina; Leonard Marks, Cohn and Marks, ex officio.\nHarold E. Hill. NAEB associate director, was re¬\ncently named chairman of the Audio-Visual Com¬\nmission on Public Information at the Commission’s\nquarterly meeting in Williamsburg, Va. He succeeds\nCharles Schuller, director of the AV center at Mich¬\nigan State University.\nHill is author of the Commission’s fourth publica¬\ntion, AV on the Air, a manual on the use of radio and\nTV as public relations tools to be published soon.\nSUGGESTIONS FOR PROGRAM\nGRANT-IN-AID APPLICANTS\nEdward Rosenheim, Jr.\nChairman, NAEB Grants-in-Aid Committee\nEd. Note: Applications for program grants-in-aid for\n1958 are now being accepted at NAEB Headquar¬\nters. Brochures giving complete instructions as to\nhow to apply for a grant are currently being distrib¬\nuted. The deadline for receipt of applications is May\n1, 1958.\nEdward Rosenheim, Jr., University of Chicago,\nchairman of the NAEB Grants-in-Aid committee, has\nwritten the following article to help prospective ap¬\nplicants file an application.\nThe printed announcement of the second of three\nyears of radio programming support by the NAEB\nand ETRC under the general theme of “The\nTwentieth Century American” will provide prospec¬\ntive applicants for grants-in-aid with most of the\nnecessary information concerning topics and proce¬\ndures. In particular it should be noted that, since the\nannouncement of the project is this year being made\nfar earlier than previously, the new deadline for all ap¬\nplicants is May 1, 1958. In addition to this announce¬\nment, there is available from NAEB Headquar¬\nters a more detailed account of the principles under-\nFEBRUARY, 1958\n5"
}