{
  "id": "d534-10",
  "text": "TO : Officers, Directors, Members of Membershir^ommittee, NAEB\nFROM: John W. Dunn, Chairman, Membership ttee 10/6/52\nfour attention is invited to the following applications for a ctive and associate\nmembership in the National Association of Educational Broadcasters. These applications\nhave been received in the office of the Executive Director and have been cleared by\nthat office for presentation to the Officers, Directors and Membership Committee for\nimmediate action. Please use the ballot furnished, vote and return to NAEB Headquarters.\nInformation regarding each of these applicants has been taken directly from their\napplications.\nactive\nGMg>T.TlLMSTITUTE & CENTRAL 3 CHQOL, Springville, N.Y. WSPE-FM 88.1 me\nSchool accredited by the University of the State of New York and is apparently a\nsecondary •school.\nStation opera'■•es on 10 watts of power from 9*25 a.m. to 300 p.ra. and has been in\noperation sinev March 10, 1952. Station operated by the Drpartment of Comnuri cations.\nTwo studios each 13* x 14f* Technical Equipment: Gates Console, Presto tape recorder,\nWeb-Cor Tape Recorder, 3 mikes, G. E. Transmitter, Preston turntables (adapted for\nmicropgroove.\nRecorded Music Library* of some 800 selections.\nStaffs Director (full ttme); Consulting Engineer (part time) and Part-time, paid\nstaff of high school students.\nApplication made by Thom ftialiams, Director\nASSOCIATE\nQm.£LMUm* «ew York City. (Production Center]\nApplication made by Miss Janet Pinaey, Supervisor of Educational Department\nApplication states that during past year. Museum has appeared 45 weeks on a 10 minute\nregular weekly spot on a 2 hour packaged show on WABC-TV in addition, applicant states\nthat appearances have also been made on a number of other TV shows originating in\nNew fork City and that the resources of the Museum are there for use on telecasts at\nany time.\nStaff of the Educational Department: Supervisor and two others.\n1S BOOM, ALLIANCE COLLEGE, Cambridge Springs, Pa. (Individual)\nInstitution is a ccredited by Middle States\ncasting courses or as a production center.\nAssociation and offers no work in broad-"
}