{
  "id": "d534-105",
  "text": "TO : Membership Committee, Officers & Directors, NAEB\nFROM: John V*. Dunn 5/14/54\nThe following applications for membership have been r?ce^-\nprocessed as of this date. Please mail your ballots to NAEB HEADQUARTERS, 14\nGregory Hall, University of Illinois, Urbana, Illinois.\nACTIVE KETC-TV, St. Louis Educational TV Commission\nc/o Washington University\nSt. Louis 5, Missouri\nChannel 9\nConstruction Permit from FCC as of May 6, 1953 ..\nOne Studio 30* X 6O’, temporarily converted from a gymnasium. Two camera chain\nwith necessary lights. Altec Audio in control room with HCA turntable.\nGray Telop, 2X2 slide projector, 16mm film projector, magnetic fUn {layback,\none RCA film chain. One GPL 16mm kinescope recorder, one StancU hoffman magnetic\nfilm recorder. . . .\nOne 16mm motion picture camera, plus splicer, rewinds, etc.\nTransmitter RCA TT5A water cooled transmitter; utilizes tower owned oy bt. Lo1\nUniversity and using 6 bay super turnstile antenna. No remote e.u.pmenU Temporarily\nusing space in St. Louis University stadium for scene shop, art department :nd\nTwelveSfull\\ime department heads on paid basis plus ’’engineers and secretaries\".\nApplication made by Richard J• Goggin, General Manager.\nASSOCIATE MARIETTA COLLEGE, Marietta, Ohio\nAccredited by North Central Association\nOperates wired wireless set-up. Radio Department a division of the Speech Depart¬\nment. Use faculties of WMOA, 250 w. Mutual station in Marietta. Programs\noriginated in their own studios. Two studios: one 1/’ X 16 j other 25 a 50 .\nControl, ET turntable, tape recorders, etc. appear to be standard. Music\nlibrary of 800 pop records, subscribe to Capital Classics series, use oi Music\nDepartment classical records. Three people in radio teaching.\nApparently most of effort on wired wireless set up with student staff. Only one\nprogram aeries over concnercial outlets reported.\nApplication made by R. A. Barnhart, Director, Radio Activities.\nASSOCIATE SOCIAL SCIENCE FOUNDATION, University of Denver, Denver 10, Colorado\nAccredited by North Central Association\nPrograms are not originated in own studios. Foundation part of University of\nDenver. Foundation offers weekly series of 15 minute radio programs, JOURNEYS\nBEHIND THii NEWS, over 10 station hook-up. JOURNEYS BEHIND THE NEWS on TV offered\non KFEL-TV, Denver.\nThree stuff members engaged in mass media work.\nApplication by C. Dale Fuller, Director of the Foundation."
}