{
  "id": "d534-13",
  "text": "WASHINGTON SQUARE COLLEGE OP ARTS & SCIBiCfiS MEW YORK UNIVERSITY (Teaching Department)\nHew York, N.I.\nPlease note that the Radio Club of New York University already maintains Associate\nmembership in NAEB. THIS IS AH ADDITIONAL APPLICATION FOR MEMBERSHIP ON THE PART\nOF THE RADIO DEPARTMENT.\nRadio Department offers an elaborate array of radio courses and, some work in TV*\nFull time staff of three.\nPhysical facilities include 3 studios, 1 announce booth and 1 control room with\nadequate technical equipment.\nDepartment apparently does no radio or TV work on any commercial outlet but does\nmaintain and operate a \"wired wireless\" station which by their statement is a\n\"student activity and not an official university station\". Wired wireless station\nstaffed by students with rather typical programming for such an outlet.\nARIZONA STATE COLLEGE, Tempts Arizona (Teaching Department)\n(Production Cento)\nCollege accredited by North Gentral Association and the American Association of\nColleges for Teacher Education,\nCollege uses facilities of four commercial outlets in Phoenix and 1 outlet in\nMesa, Arizona. Department maintains its own “wired wireless\" station.\nCollege has good production record; maintains its own studios (2) good dimension\nand treatment. Adequate technical facilities. They are adding to their present\nequipment.\nOne full time director of radio-TV; student chief engineer. Make use of seme\n50 faculty members from some 15 departments in their production work. Fundamental\ncourses in radio but no degree.\nApplication made by Richard H. Bell, Director, Radio-TV Section.\nOAST YOUR BALLOT,. CLIP £ SEND TO JIM MILES. DO NOT SEND TQ MEMBERSHIP COMMITTEE CHR.\nOn the basis of the report made by the Chairman of the Membership Committee on the\napplicants for Active and Associate Membership in NAEB, I vote as follows:\nACTIVE: Rollins College.....Yes No\nSan Mateo College.........Yes ' No*\nASSOCIATE: Radio Dept. Washington Square College, NYU...Yes No\nArizona State College...*..Yes No*\nSIGNED\nOfficial Position with NAEB"
}