{
  "id": "d534-7",
  "text": "TO « Officers, Directors and Members, Membership Committee\nFROM : John W. Dunn, Chairman, Membership Committee Sept. 22, 1952\nSo far, Pve received only three reactions from officers and board members and two\nreactions from the Membership Committee regarding my memos of Sept. 10 & 11 which\nhad to do with some very pressing problems concerning membership in NAEB.\nNow several of you are concerned over the TV lads and how we shall handle them in\nNAEB. Article IX of the By-Laws of NAEB clearly states among other things: \"Radio\nBroadcasting, TELEVISION and Facsimile are included in the term BROADCASTING as used\nwithin these By-Laws\". Therefore, we can legitimately include television not only\nin the title of our association but also in the basic overall concept of NAEB.\nAlthough we need no general overhauling of the constitution and by-laws to bring\neducational TV stations into the fold, there are some notable changes which ought to\nbe made —* both in the Constitution and the By-Laws — so as to be consistent with\nthe spirit and intent of both the Preamble to the Constitution and Article IX.\n(1) ARTICLE I (A) of the Constitution of NAEB should be amended to read as\nfollows: “Any university, college, school or public service agency of rec¬\nognized standing engaged in educational, non-commercial broadcasting over a\nradio station AND/OR A TELEVISION STATION controlled by it or holding a construc¬\ntion permit for EITHER A RADIO OR TELEVISION STATION may be elected to member¬\nship by the Board of Directors.\nThe caps are the changes I propose making. To this article I would add:\nPROVIDED, HOWEVER, THAT ANI SUCH UNIVERSITY, COLLEGE, SCHOOL OR PUBLIC SERVICE\nAGENCY SO ELECTED TO MEMBERSHIP ON THE BASIS OF A CONSTRUCTION PERMIT AND WHO\nALLOWS THAT CONSTRUCTION PERMIT TO LAPSE OR IS DENIED RENEWAL BY THE FEDERAL\nCOMMUNICATIONS COMMISSION SHALL AUTOMATICALLY REVERT TO ASSOCIATE MEMBERSHIP.\n(2) Nothing needs to be done to ARTICLE I (B) so far as television is concerned\nsince by definition in Article IX of the By-Laws broadcasting includes Television.\nHowever, I am in favor of striking out the word, “INDIVIDUAL\" to be found in\nArticle I (B) and setting up another classification, I (C) to read as follows:\n(C) The Board of Directors of the NAEB may, by unanimous consent, extend\nINDIVIDUAL MEMBERSHIP to those persons (l) who have rendered outstanding\nservice to the association over a period of years as a representative of\neither an Active or Associate member of the association in good standing;\n(2) who shall have made a distinct contribution to the cause of educational\nbroadcasting in America.\n(3) In the By-Laws of the Association, Article III, Section 1 a, ACTIVE DEFINI¬\nTION should have the following changes, \".....engaged in educational, non¬\ncommercial broadcasting over a radio station AND/OR TELEVISION STATION, shall\nbe, etc., etc....11 The caps are the changes I propose making.\n(4) ASSOCIATE definition as found in Article III, Section 1 b of the By-Laws\nneeds no change to include Television. Here again I am in favor of striking\nout the word, \"INDIVIDUAL\", and setting up Section 1 c which would read as follows"
}