{
  "id": "d1552-0",
  "text": "Office of Executive Secretary\nUrbana, Illinois\nNovember 1, 1939\nWHY DON’T YOU SEND EE SPUE DOPE\nAbout all I ever read about what educational radio stations ere\ndoing comes from Broadcasting, The Radio Guide, Educational Radio\nand Recording, Radio Daily, or Variety. Now, I ask you, is that\nany way to treat your secretary who is supposed to pass along dope\nto other members? Why not tell me what you are doing in the way\nof new programs? Why not sit down and tell me what you think is\nwrong with radio; with NAEB; or with yourself. Let8s have better\nnews for the News Letter^\nRECORDING LICENSE FEES\nThe NAEB committee which is working on this subject is still on\nthe Job. Our suggestion to NAEB members is to wait until you get\nsome definite word from NAEB before you actually pay RCA-Victor\nany others,, NAEB has been assured by RCA-Victor that if the matter\nis not settled by December 1 that an effective extension date will\nbe set, Pre-mature action by some NAEB members might make the whole\ncase more difficult for the association. In its negotiations to\ndate RCA-Victor has indicated every desire to reach a satisfactory\nagreement with NAEB. However, it seems best to Novik, who is\nrepresenting NAEB in the negotiations, not to press for action\nright now.\nLA GUARDIA HEARING BEFORE FCC\nYou will recall action taken by the NAEB at the Ames Convention,\nendorsing the petition of Mayor F. H. La Guardia, requesting\npermission of the FCC for non-commercial, educational and\nmunicipal broadcast stations to rebroadcast programs of the\ninternational shortwave stations. Well, the hearing has been\nheld (see BROADCASTING, November 1)„ Yours truly appeared at the\nhearing as NAEB representative in behalf of the La Guardia petition.\nThere was no opposition to the petition except that presented by\nthe engineering* staff of the FCC.\n7/e have been informed by some NAEB members that they are filing\nrequests with the FCC to rebroadcast programs of WRUL (formerly\nY/1XAL). Perhaps you should give serious consideration to the\nsame problem. May we suggest that your application should make\nclear that the request is. for experimental purposes.\nSARNOFF ON EDUCATION AND RADIO\nNBC PRESENTS for November carries an article by David Sarnoff,"
}