{
  "id": "d462-114",
  "text": "Page 3\nAugust 30* 1968\nTo: Mr. Raymond Shirley\nFrom: Kenneth R. Clark\nFor WUOT to dramatically begin programming Soul Music makes\nno sense unless you have a real purpose. Who listens to WUOT?\nAre you convinced your listeners are not interested in that kind\nof music? I cannot answer that; you can. Might you have a\nlarger audience, perhaps even a more devoted audience if you\nwent more heavily into reflecting this issue? I don’t know; you\ndo.\nI don’t think anyone can give you adequate answers because\nno one other than yourself can possibly understand what WUOT and\nKnoxville mean to each other. So two stations are alike; that is\npart of the joy of broadcasting in this country. These specialized\n\"images” are incredibly varied as you know even within a single\ncity. Your letter suggests some concern over whether WUOT is doing\nas much as other stations. X don’t think that is relevant. You\nare doing things; you are making an effort. Whether that effort\nshould be more or less is up to you. Maybe Marjorie Newman’s idea\nof tailoring her programs for the Disadvantaged clearly and spe¬\ncifically to her educated audience, knowing that audience is in a\nposition to work changes, makes sense within the WUOT context.\nThe real impact on listeners as a result of human relations\nprogramming varies from station to station. I cannot give you\na clear cut answer. Nor can I tell you if regular listeners\ndropped away. My reports do give a contact person for each\nstation discussed. You might find relevant answers, perhaps\neven surprising answers should you want to write directly to\nthese people.\nI think there is a misunderstanding about the obligation of\nany station in this perplexing and ephemeral thing called human\nrelations. No station is expected to forget its loyal listener-\nship. No station is asked to alter its image overnight, or even\never. But Life changes. And the people who listen to radio change\nwithin themselves and from one generation to another. The status-\nquo in broadcasting just doesn’t exist. It isn’t the nature of\nthe medium.\nMany stations have found that the more deeply they involve\nthemselves in the human predicaments of their comnunities, the\nmore fully they play an active role, the more challenging and\nsatisfying become their places in those communities.\nI don’t really think WUOT has a problem, and I hope the pro¬\ngram reports have not suggested anything of the kind by comparison.\nThe reports are designed as a means of sharing ideas, nothing more."
}