{
  "id": "d462-117",
  "text": "- 2 -\nThe South Carolina Educational Television Center is readying\nits new series, THE JOB MAN CARAVAN for early September airing.\nIt is a cycle of eighteen half-hour programs.\nEach program will build around the \"Job Man\", Bill Terrell as\nhost. Terrell, Black and tuned in, comes out of Memphis, is a\ngraduate of Fisk University and enjoys a following as one of\nColumbia, S. C.Ts top D.J.Ts.\nEach week the show goes on location to tape segments in Black\ncommunities representing a cross section of South Carolina living.\nLarge and small urban communities will be underlined with a few\nforays into rural areas. This is how it works:\nThe Mobile Unit Caravan rolls into a Black community. The area\nhas already been researched to determine job availabilities and\nrequirements. Presence of the truck has been heavily promoted in\nadvance. Loudspeakers beckon a street audience with Soul Music.\nThree Black girls — attractive and attractively dressed alike —\nare billed as \"Jobettes\" and they handle interview chores and pass\nout verbal and printed job information from the \"Job Man Desk\".\nA Black entertainer, usually known to the audience will ac¬\ncompany the truck and will work with Bill Terrell — doing a few\nnumbers and chatting with those who show interest in job possibil¬\nities. A number of interviews will be taped between Terrell and\nlocal unemployed citizens.\nWhy the location work? Because thereTs a need to wed local\njobs to local residents, to prove success at home possible. In\naddition to the ard job information and entertainment elements\nof the remote segments, two other kinds of information will be\navailable: (1) Training programs for unskilled people and (2) Ad¬\nvice to drop-outs to get back to school, finish up and then job\nhunt with more going for you.\nThis taped, remote segment will then be joined with in-studio\nelements for each program. For example, there will be a series of\nshort (45 sec.) how-to-do-it bits offered by Black experts on grooming,\nhow to dress and act in an interview, how to prepare a personal re¬\nsume, how to present yourself to the company receptionist, etc.\nThen, the series expects a \"name\" entertainer for a single number.\nThe show also plans to include success stories of young people\nusefully employed in the community, will offer information about\ntesting procedures for job applications and will discuss guidance\nand training opportunities throughout the state.\n, Transitions between the three remote and three studio segments\nof each program will be low keyed with Soul Music in the background"
}