{
  "id": "d462-118",
  "text": "- 3 -\nwith the video emphasizing pictures of employed young Blacks and\nsupers telling what the jobs are.\nThe series does not expect to work miracles. But it does\nexpect to stimulate job interest, motivation and application to\neighteen South Carolina Black communities.\nCONTACT: Henry Cauthen, General Manager\n*****\n17CVE, Richmond (Central Virginia Educational Television Corp.)\nreadV for a September 16th debut. Titled\nAMERICANS FROM AFRICA:A HISTORY, the series will explore the topics\nin thirty programs. The objectives are explained this way:\nIn the crisis atmosphere of today, there is an urgent need\ntor wider understanding of the NegroTs part in American history,\nlife and culture. A course on educational television that traces\nthe story of the Negro American from the African background to\nthe present should contribute significantly to improving human\nrelations.\nThe three major goals of the course will be:\n1* -^° ma^e teachers, students and other viewers aware of\nthe significant role played by Americans from Africa in\nthe development of this country and to provide them a\nbasis for appreciation of the important contributions\nmade by Negroes to American life and culture.\n2. To assist teachers to broaden their knowledge of the\nneglected subject of Negro history, thus enabling them\nto present in their classrooms a more informed analysis\nof the roots of the crisis that now confronts the nation.\n3. To provide all viewers a broader perspective for assessing\nthe demonstrations and disturbances featured in news media\ncurrently.\"\nDr. Edgar Allan Toppin, Professor of History, Virginia State\nColiege Petersburg, Virginia will teach the course which is being\noffered for graduate and undergraduate credit throughout the state.\nThis is the kind of informed television we need more of. Our historv\nbooks have committed the sin of omission long enough. WOVE is doing\nsomething about that. 8\n4-* Th? ®eries wil1 be nationally available through the Great Plains\nNational Instructional Television Library of the University of Nebraska*\nCONTACT: Mrs. Mary Anne Franklin, Program Director\n* * * * *"
}