{
  "id": "d462-129",
  "text": "- 4 -\nset up in advance in various community centers throughout the core\ncity and were well attended. Interesting sidelight: a local com¬\nmercial station carried the series at 6:30 AM; WVIZ cleared 11:30 AM\ntwice weekly.\nCONTACT: Betty Cope, General Manager\n*****\nWITF, Hershey early this year started a continuing chain reaction\nof community involvement using the station as a catalytic agent to in¬\nvestigate and discuss human relations within the station*s coverage\npattern. What has happened at WITF could very well become a model\nfor other community-minded stations with a similar persuasion toward\ncivic conscience.\nIt all began with WITF*s resolve to become involved with the\nproblems with ’’people left behind”. And that enormous group includes\nboth blacks and whites in urban and rural ghettos, migrant workers,\nthe poorly educated, the non-motivated, the under-employed - in other\nwords, a great and varied segment of the population.\nGathering together a Resource Committee of 100 representing both\nthe Haves and the Have-Nots a decision was taken to act. Appropri¬\nately the first series was titled ”A Time to Act.\"\nThe series lasted one month. Four 1/2 hour documentaries were\nassembled treating the ghetto in Harrisburg. Each program debuted\non a-Monday and was replayed each evening through Thursday of that\nweek.\nSixteen mini-town meetings (a total of approximately 1000 people\nattending) were organized by the station in cooperation with civic\ngroups, each with its own resource leader and an assembly of infor¬\nmation experts. The groups watched the TV programs then took up the\ndiscussion as the information they had just digested applied to them\nin their own area.\nFriday nights during the month were given over by the station\nto lengthy open public forums. Forum #1 treated education, #2 dis¬\ncussed housing, #3 took on employment and #4 summarized the entire\nmonth’s effort.\nWITF promoted the series heavily and provided all of the town\nmeetings with brochures of background information.\nThe local press maintained a curious silence until the end of\nthe month, but since then has joined the adventure in human relations\nby reporting the station’s activities in full."
}