{
  "id": "d462-130",
  "text": "5\nSome civic authorities in Harrisburg were opposed to the series\nfrom start to finish* \"A Time to Act\" told the story as it was - a\nstory of despair, deprivation and disillusion - a wretched record that\nmany people would have preferred kept under the rug.\nBut the story was told. Now three of the mini-town meeting groups\nhave formed permanent human relations commissions in their own areas.\nMinority interests, particularly black, now look to WITF with con¬\nfidence and trust. Accordingly, planning, execution and feedback\nhave all become easier.\nUnder a Ford Foundation grant, INTERACT begins at WITF in the\nFall. The nine months of programs will especially concern the Harris-\nburg-York-Lancaster tri-city area.\nThe subject matter, relevant to blacks and whites alike, struc¬\ntured on a monthly basis goes like this:\nOctober:\nNovember:\nDecember:\nJanuary:\nFebruary:\nMarch:\nApril:\nMay:\nJune:\nPolitics\nEducation\nA Smoking Clinic\nUrban Welfare\nIs Religion Obsolete?\nThe Honest Generation; youth and the\nnew morality\nMegalopolis\nHuman Rights and the Ghetto\nHow Fine Are the Fine Arts\nAgain, the station will work with local civic action groups to\nstage the mass viewing sessions with mini-town meetings backed up\nwith discussion leaders, information experts and printed resource\nmaterial.\nEach individual subject will be treated through a variety of\nformats on fifteen separate evenings. WITF reporters will attend\nthe mini-town meetings and a news report of the discussions will be\naired on the station’s 11:00 o’clock news on those evenings so the\ngroups can see how others are reacting to their reactions to the se¬\nries. And that is a round robin of community involvement few stations\ncan claim.\nIn addition to INTERACT, a new series will join the WITF Fall\nschedule as a direct follow-up to A TIME TO ACT. This program, titled\nDIALOGUE IN BLACK AND WHITE is designed as a combination discussion\nand film report on what community action is resulting as aftermath to\nthe earlier series.\n\"Operation Headstart\", a project of the Office of Economic Op¬\nportunity, is a household word. But how many of us really understand\nhow it works? WITF thought its viewers should understand. Accord¬\ningly, they produced a 1/2 hour program to do just that. Sixteen\nchildren (black and white) from the Harrisburg Headstart project came\nto the studio and were shown in a series of situations that approxi¬\nmated the kind of pre-school experience the project itfas giving them."
}