{
  "id": "d462-149",
  "text": "3\nWKCR, New York (Columbia University) is working under a Ford\nFoundation grant to ready a sixteen program series for Fall built\naround a forum idea. The pilot, done this summer, shows real promise.\nTitled URBAN FORUM it will rely heavily on ghetto dwellers to\ntell it like it is. Discussions, interviews and poetry reading will\nbe interspersed to examine the many faces of Black poverty in New York.\nPoverty of opportunity, poverty of motivation, poverty of basic knowl¬\nedge ... all this will be a part of the series.\nCOLUMBIA FORUM, is an on-going series that tackles current issues\nthrough lectures and a question-answer format. One hour programs are\nheard twice each week and consider such topics as social movements,\nurban riots, violence and protest.\nComing up soon will be COLUMBIA PRESS CONFERENCE with a guest\nexpert featured. Though not always related specifically to the ghetto\nissues, the series will include appearances by James Farmer and other\nminority leaders. It is planned as a factual series about people\nhighly involved in current events.\nAs of the moment there are four Blacks on the WKCR staff ...\nperforming as DJTs (2), one Engineer-Producer combination and one\nAnnouncer.\nCONTACT: Roger Berkley, General Manager\n*****\n17CBE, Columbus (Columbus Public Schools): has been airing a\nseries of fifteen minute programs twice a week for the last three\nyears. It is a modest idea and done without fanfare. But the con¬\ntribution of PROJECT AIM to improving the lot of minority youngsters\nin Columbus is incalculable.\nDevised to help stem a severe drop-out rate among high school\nstudents, PROJECT AIM hits them earlier when they are still in junior\nhigh. The series is cased in a simple format. On each program a\nBlack who has achieved in his own life is invited to submit to inter¬\nview and discussion on how he or she \"made it\" ... the route they\ntook to success, including the hardships. They also describe in\nfull just what their profession or occupation is all about. They\ntalk as Black people who entered their chosen work with that mark\nagainst them. The implication is obvious. If they can do it, so can\ntheir young listeners.\nThe host-interviewer is a black high school student, chosen by\nhis school and carefully coached by VJCBE prior to joining the series.\nA series of \"test interviews\" were set up in which WCBE staff members\nwillingly submitted to being \"guests\" while the young broadcaster-to-\nbe sharpened his approach."
}