{
  "id": "d462-157",
  "text": "-6-\nwhat has currency and significance. Certainly all of the\nOEO Action Centers will be visited (there are six such\ncenters in Orleans Parish). Sports, money management,\nshopping tips, housing projects, hospital problems, and\na man-in-the-street are all possibilities for this live\nproject which will put the cameras where the action is and\nlet the story grow.\n3. COFFEE HOUSE will run an hour and one half. It is\nexplained as an informal \"happening\" by, for and about\nuniversity and high school students. Current events, word\nassociation exercises, poetry readings and music will all\n\"happen\" in a staged coffee house atmosphere. While not\nslanted particularly toward the Disadvantaged, problems of\nthe poor as well as creative works of ethnic groups will be\nshowcased.\n4. MY NEW ORLEANS is projected as a monthly essay combining\nfilm, stills and words in an impressionistic view of the city.\nEach program will be created from the point of view of a\ndifferent individual or group. Very definitely the ghetto\ndweller's \"mind's eye\" picture of New Orleans will be a\npart of the series.\nCONTACT: W. S. Hart, General Manager\nKCET., Los Angeles is back in the report again, this .time with a program\nabout a.white drama student who helps' black teenagers. The 30 minute docu¬\nmentary produced by KCET's assistant director of programming Gordon Hoban\nwith a grant from ETS, tells the story of Steve Kent, a U.S.C. drama student\nwho built the \"Watts Towers Theater V/orkshop\" from a crowd of Negro teenagers.\nThe sensitive program shows Kent working with his group in elementary\n\"theater games\" devised to allow participants to work from the inside out, acting\nout their attitudes, opinions and loves and hates about life. Slowly the group of\nsociety's misfits coalesce as a group. Mutual dependence, a sense of rhythm and\ntime and a new power of concentration appear.\nImpx*ovisationai skits based on the teenagers own ghetto background\nillustrate their theatrical progress. The program is beautifully photographed\nby Les Blank who eventually became accepted as a member of the group and,\nalong with his camera rolling, played the \"games\" that reveal a frightening,\nlonely, desperate world most of us know little of.\nCONTACT: Charles Allen, Program Director\n■>)i >;< i\\i >:<"
}