{
  "id": "d462-185",
  "text": "deliberately isolated—the traditional concept of ghetto as developed in\norganized discrimination against the Jews in Europe throughout the centuries.\nDoes it seem to you that the term \"ghetto\" is more descriptive and explana¬\ntory of what has happened and what is happening than is the word \"slum\"?\nHave you heard of poor whites living in ghettos? They live in slums.)\nMy plan for the inner-city (or ghetto) took into consideration the\nconcept that has been put forth by many educators-sociologists-psychologists\nthat thus far the compensatory education programs in this country have not\neffectively raised the level of learning of the children. (You may recall\nthat this was a basic statement in the fine NET documentary on the Bedford-\nStuyvesant, Brooklyn,, school experiment, \"The Way It Is.\")\nPart of the reason for failure is that these programs have concentrated\non the concept that this is a print world, that the student's orientation,\nintake and output is print, is reading. The child in Bedford-Stuyvesant\nsays he doesn't find anything interesting in school. What he means is that\nhe's bored because he can't read the book used as the core of instruction.\nWe. cannot teach him to read the book as we might teach children who have\nnot suffered the psychologically destructive, deprived backgrounds of many\nof these children. We must first reach this child to motivate him toward\nthe personal worth and confidence that will give him a base for being willing\nto learn. We must use those means to reach him to which he is already tuned\nin: radio and television. To continue to push print as the primary approach\nis to continue to create an ever concentric circle of stone walls surrounding\nthe child. ^o^o^-i^antly, we must do away with the print oriented evalua¬\ntions—really misevaluations--of the child: information-learning and infor¬\nmation-testing^\nMuch has been said, particularly in relation to school integration,\nabout the ability and readiness of the ghetto child to learn. Frequently,\nwe offer conclusions about the ghetto child through intelligence test\nresults. We find generally low IQs. All this shows is the fallacy and\ninadequacy of intelligence tests.\nOutside of the school that child thinks, uses his mind. The child in\nthe ghetto, just to survive, must make meaningful, effective judgments and\ndecisions every moment of the day--and night. And this takes a kind of\nintelligence that most of us have not had to exercise. When talking about\nsurvival in the ghetto, it is not like the experience of most of our children\nplaying in the back yard. It is an experience usually lacking the guidance\nof an adult. It requires an intelligence of a high practical order that is\nnot reflected in the verbal oriented-cultural achievement evaluations we\ncall IQ tests. It is the kind of ability many industry people say they are\nlooking for, but have not yet really utilized.\nThe intelligence and potential are clearly there. They must be\nmotivated and matured through communications and education. They must be\ncommunicated with and given an opportunity to communicate."
}