{
  "id": "d462-194",
  "text": "EDUCATIONAL TELEVISION STATIONS\nA division of\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nPHONE: 667-6000 • 1346 CONNECTICUT AVENUE • WASHINGTON, D.C. 20036\nAugust 8, 1968\nSixth Report on Programming for the Disadvantaged\nKen Clark, Project Director \nWilliam A. Emerson, Editor of the Saturday Evening Post, -examined\nthe issue that relates to your work and mine in the August 10, 1968 issue.\n’’The ghetto is a container for the condensing and storing of\nundesirable human beings. We are putting these people in\nvertical filing cabinets called tenements, and we are literally\nfiling them away, stacking them up as high as we can make\nthem climb. Around Harlem and all of the other ghettos, we\nhave dug a cultural moat so deep and treacherous, we have\nbuilt a wall of deprivation so slippery and high, and we have\nstrung around them a barbed-wire thicket of prejudice so\nforbidding that even those who keep the will to escape need\na terrible bit of luck to manage it.’’\nWhat are we educational broadcasters doing to stop the ’'people-filing'*\nin Summer ’68? Cuite a bit. But Mike Pengra, Program Operations Manager\nat KSPS-TV, Spokane points out a danger to stations in secondary markets.\nMajor market stations have reacted to racial incidents in their cities\nwith dedicated activity. But what about the smaller market where the black\npopulation is small, non-vocal. ., .invisible? Is there indeed a need for stations\nin such areas to take the initiative, to maintain a strong minority programming\nliaison.. .. regardless of the temper of the city or of racial incidents taking\nplace? Well, one militant black in Spokane recently jolted a black-white con¬\nfrontation by pointing out that minority peoples there ’’may not be ready to burn\ndown the town, but they all have matches in their pockets. \" Think about it.\nKSPS thought about it and came up with a remarkable plan. The station\nrecognized that it had to move into the arena of minority affairs. The answer;\nwork with the local Youth Opportunity Center and the local school system; obtain\na list of Disadvantaged kids (primarily black, but with the possibility of both\nIndians and Orientals in the running too), KSPS would then screen the list down\nto from six to eight.\nThen community spirit got into the act. Local businessmen and civic\ngroups are being approached to sponsor one boy each for a year of training by"
}