{
  "id": "d462-196",
  "text": "-3-\na $250, 000 grant from the Carnegie Corporation to make it possible to produce\na number of specials for the purposes of testing regional networking on a live\ninterconnected basis wherever possible. Nearly twenty programs were so\nproduced, several tackling the urban problems. Two of the best:\nHELP WANTED, a WETA, Washington, D. C. production that looked\nat hard-core unemployment in a 90 minute probe that originated live from\nWashington, Philadelphia and Buffalo. A teenager from Philadelphia, a man\nin his late 20’s in Buffalo, and a man over 45 in Washington, D. C. participated\nin the talk which was structured to (a) find out what it is like to be a member of\nthe hard-core unemployed; (b) to see what business is doing to alleviate un¬\nemployment; and (c) to create a meaningful communications channel between\nbusinessmen and the unemployed.\nTALKING BLACK pulled apart the ideas that bind and do not bind a black\ncommunity with ghetto residents in Pittsburgh’s nHill\" section, Boston's Roxbury\nDistrict, and New York’s Harlem responding to a trio of black reporters. Short\nfilms on the cities illustrated the discussions which centered on differences and\nsimilarities of the respective cultural structures.\nThe EEN has recently been granted $300, 000 for programming by the\nFord Foundation. This grant permits a bit more flexibility in program plans.\nAt this reading, EEN plans on a regional public affairs one hour series\non alternate Tuesdays beginning October 15th. There will be 16 to 20 programs\nin this series. In addition, 6 to 10 cultural events and hearings will be covered.\nOn both series material for, by or about the Disadvantaged will be included.\nEEN, a leader in interconnecting is making a real contribution to minority\nprogramming through its simultaneous delivery on up to 25 connected stations\nand through early tape delay on eight others.\nCONTACT: John R. Morrison, Director of Programming\nsjc sjc sje\nDown in Florida, the State Department of Education has allocated $6,400\nto be divided among six ETV and six ER stations for purposes of Disadvantaged\noriented programs.\nWUSF Radio and Television, Tampa, reports plans for a two part series\nin which they hope to pull apart the racial \"thing\" in that city. The stations will\ncompare the Florida of the travel posters with the Florida of the slums, of the\npoor, of the disadvantaged. They will explore the police-citizen relatipnships\nand station personnel will see first hand what's happening when they take night\nrides through the city. . . . first with a black officer, then with a white. Program\n#1 will be this comparative analysis of the black-white syndromes."
}