{
  "id": "d462-20",
  "text": "-3-\nSome stations have reported difficulty in making meaningful contact\nwith the ghetto. Some stations have said they offer training to minority\npeople and have to go begging for applicants. Some stations say they can't\nfind qualified men and women who are black to write, produce and direct.\nSome station producers find management still reluctant to make an all-out\neffort to change traditional thought regarding this new kind of programming.\nNo one says these issues are easily resolved. The brighter aspect is that\nfor every negative there is now a ringing positive to counterbalance. The\npendulum is swinging. There is change of telling proportions. Programming\nand employment and employment practices of the past are daily being negated,\naltered, or thrown out all together. Public broadcasters across the country\nare discovering that deep involvement in the black-white confrontation is not\nonly necessary to the health of a viable station operation; it is ethically,\nmorally right - and a whole new audience and talent pool are being secured\nin the process.\nEvents that would have seemed surprising even a year ago are proving\nbonus factors for those stations in the movement. KLRN-TV San Antonio-\nAustin wanted a black sportscaster for its hard news show. None was available,\nso the station hired the Dean of Men from a local high school on a part time\nbasis, trained him, and watched him become an articulate and community-\napplauded sports reporter. The employment of minority people is on an\nascending curve. *\nWTHS-TV, Miami needed black youth expertese for its daily half-\nhour series; the station invited the militant Black Students' Union of the\nUniversity of Miami to research, write and produce news, history, and other\nfeatures. The result: a cooperative venture that is providing a rich, innovative\nviewing experience.\nI need not labor this point. Public broadcasting has joined its multiple\nforces to contribute solutions to the race and poverty problems of America.\nThe research of the past three months amply illustrates this. The question\nnow is simply where do we go from here? There is sufficient evidence from\nstation response to the program reports to indicate this kind of sharing of\ninformation must continue.\nItem: A particular underlining of public broadcasting's commitment\nis anticipated in the forthcoming national convention to be held in Washington,\nD. C. , November 20-22, 1968. A number of special interest sessions relating\nto the topic of this report are planned regarding broadcast radio and television,\ninstructional programs, training and employment and promotion. The central\nfocus will occur on Friday morning, November 22nd at the General Session\nwhen an all black panel will discuss \"Soul: Does Public Broadcasting Have It?\"\na panel to be moderated by Dr. Kenneth B. Clark, President, Metropolitan\nApplied Research Center. At this writing three panelists have given firm\n* See Appendix B"
}