{
  "id": "d462-29",
  "text": "page four\nPrograms for the Disadvantaged\nOctober 11, 1968\nthe rear areas, looking for publishers with the ammuni¬\ntion to help shore up flagging defenses» The most com¬\nmonly adopted tactic of the educator-publisher forces\nhave been a combination of holding action, strategic\nwithdrawal, and scorched earth policy.\"\nPublisher policy and professional historian prerogatives not¬\nwithstanding, Station WDTR feels further airing of the issues is\nin order. Consequently, the varying topics of -'History and Human\nRelations,\" \"The Historian Looks at Textbooks,\" and \"History and\nthe High School Teacher\" are now on tape, ready for WDTR listeners\nCONTACT: Dorothy Fe Patterson, Program Director\n* * * *\nWSHA, Shaw University, Raleigh, North Carolina, goes on the air\nin November of this year. Shaw, with an enrollment of 1030 stud¬\nents (all black but five) has decided to move into the communi¬\ncations field in a carefully designed program of development.\nStage one will see the station begin its initial program service\non a five days per week basis, broadcasting from 4:00 to 10:00 p.m\n1. 4:00 - 6:00 will stress news, educational and\ncultural information for the broad Raleigh audience.\n2. 6:00 - 8:00 is planned primarily for the general\nShaw University community (faculty and students) and\nwill present a variety of interviews, discussion and\nhistory programs.\n3. 8:00 - 10:00 will be primarily for the Shaw stud¬\nents - their music, their views etc.\nAs soon as possible, the program schedule will move out into the\nRaleigh community, emphasizing materials that have particular\ninterest and relevancy to ghetto residents (i.e. social security,\nhealth, problems of the aged etc.)\nStage Two will take place in about two years with the opening of\na department of communications that will include rhetoric, speech\nand hearing as well as broadcasting. A full undergraduate broad¬\ncasting major will then be available.\nStage Three brings the training up to the Master’s degree level."
}