{
  "id": "d462-58",
  "text": "v 'gy\nEDUCATIONAL TELEVISION STATIONS\nA division of\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nPHONE: 667-6000 • 1346 CONNECTICUT AVENUE • WASHINGTON, D.C. 20036\nSeptember 13, 1968\nTenth Report on Programming for the Disadvantaged\nKen Clark, Project Director\nFrom a statement made to employees by Ohio Bell President Frederick\nR. Eckley:\n. . .We are moving away from the past with its outworn\nphilosophies and policies. We have set our sights on a\ngoal that is criticized by some, but is morally right\nthat is sometimes hazy and indistinct but we believe\nattainable.\nThe decision has been made and we have begun. \"\nsjc sjc * * *\nKVIE. Sacramento: The station has filmed a half-hour study of a Maidu\nIndian who lives in a wilderness area of Plumas County, California. The program\nis not. intended to reflect the Indian as a \"disadvantaged\" person. However, the\nAmerican Indians are a minority group almost wholly disregarded by broad¬\ncasting. This program, BRYAN BEAVERS: A MOVING PORTRAIT, offers a\nquiet, low key study of a man adjusting to life without fanfare - a man who is\na combination of two cultures and who has found values in both.\nBryan Beavers is a remnant of one of 21 distinct linguistic tribal groups\nthat once populated the territory that is now California. He lives in a log cabin\nwhich he built on land long occupied by his ancestors.\nBRYAN BEAVERS: A MOVING PORTRAIT is a view of life in progress\nwith neither beginning nor end, a concept which is not only artistically valid\nfor television, but perhaps closer to truth and basic realities - so say the KVIE\nproducers of the program. They go on:\n\"The program approaches television cinematography from\nthe standpoint that all things are capable of importance to\nall people, and that it is the artist's role to reveal this\nimportance. Thus, it is possible to discover universal\nvalues within the simplicity of regionalism and to reveal\na simple subject or movement as important with no need for\njustification other than its own existence. \""
}