{
  "id": "d462-66",
  "text": "2\nI want to report on a project called DROPOUTS ANONYMOUS dreamed up\nand implemented by commercial stations KFRE and KFRE-TV in Fresno, Cal.\nThe idea is as valid for you as it is for them.\nConcerned about the high dropout rate in their area, the stations\nlaunched a campaign in February, 1966. The initial project lasted one\nfull year, proved itself, and is continuing indefinitely - as long as\nthe need exists. It was so successfull, all other broadcasting stations\nin the city willingly cooperated.\nAllow me to quote from the forward to a brochure prepared by the\nstations which best explains the purpose:\nDROPOUTS ANONYMOUS is a continuing campaign, in announcement\nform, offering aid and moral support to high school students\nabout to drop out and to older youths and even adults who\nnever completed high school.\nIt brings the potential dropout together with one who has\nalready faced - and solved - a similar problem.\nDROPOUTS ANONYMOUS will elicit response of a depth and\nintensity that is hard to predict. Late at night, the\nfourteen-year-old who is pregnant and terrified, the\nhandicapped enrolled in courses he canTt handle, the\nnA\" student whose uneducated parents want her to quit\nschool and bring home her weekly paycheck, the listless,\nthe forgotten, the lonely, to whom the invitation to call\nDROPOUTS ANONYMOUS is a beacon of light, a ray of hope,\na sign that there is someone who will listen and help.”\nAn organizing committee was formed under the Fresno Community Council\nrepresenting schools, hospitals. Armed Forces recruiting offices, fra¬\nternal and civic clubs and community service organizations.\nThat group in turn was and is supported by a much larger number\nof people on standby call. Some of these volunteers man telephones\non regular shifts. Many are simply available for referral calls.\nThese volunteers were deliberately chosen for their religious,\nracial, ethnic, economic and educational backgrounds. VJhen the \"key\nreceptionist\" decides that a particular committee member could com¬\nmunicate more effectively, that volunteer is asked to make the contact.\nThe KFRE - KFRE-TV role was one of initiating the project and of\nproviding the publicity to keep it moving. Once started, the program\nwas turned over to local citizens7 groups to administer. But the broad¬\ncast facilities remain an integral element of the project through an¬\nnouncements and attendant publicity.\nThe major appeal is to listeners and viewers who are contemplating\ndropping out of school or who have already left school. The suggestion"
}