{
  "id": "d462-68",
  "text": "- 4 -\nthe 4th, 5th, and 6th grade students and one-third for 7th and 8th graders.\nKSLK reports many classes tune into the entire series, however, finding\nsomething of value in every program. The topics are elementary and re¬\nvolve around such things as: (1) family activities; (2) the importance\nof school attendance; (3) playground behaviour; (4) courtesy; (5) sports¬\nmanship; (6) beautification of your own backyard (a grass-growing pro¬\nject last year had the kids sprouting greenery all over the district);\nand (8) responsibility to self and to others.\n\"Project U” is directed to the problems the Districts teachers\n(mostly Black) themselves find in their daily work. Two staff writers,\none Black, one White help the teachers prepare the weekly scripts.\n\"Mr. Achiever\" is another fifteen minute, weekly series for in¬\nschool listening. Again written by teachers of one particular district\nin St. Louis, the programs emphasize good study habits and the notion\nthat achieving with ones1 self early in life, transposing that \"achieve-\nability\" to external activities as well as to school can tend to make\na young person achievement-prone for the rest of his life.\nCONTACT: Gertrude H. Hoffsten, General Manager\n* * * * *\nWBAA, Lafayette (Purdue University), reports again with a new series\nof discussions stressing the whole spectrum of human relations in the\nLafayette-West Lafayette area.\nThere was considerable foot-dragging in civic circles over the\nappointment of a Human Relations Council to consider problems basic to\nboth communities. However, a great many people, both Black and White,\nfelt there had to be some kind of coordinating group to understand the\nproblems before sensible solutions could be attempted. Accordingly,\npublic pressure began to mount (joined by WBAA management). Before a\npetition could be presented, the point was abundantly made and the\nEstablishment appointed a Human Relations Commission.\nWBAA will investigate this Commission and its work. For example,\nthe first several programs in the talk series will deal with these\nkinds of questions:\n1. What problems exist in the Greater Lafayette community\nbetween Blacks and Whites?\n2. What can a Human Relations Commission do to help the\ndisadvantaged in the Greater Lafayette area?\n3. Do you think the selection of members for the Human\nRelations Commission was fair?\nIf all that doesnTt stir up some interest, WBAATs plans to be\npresent to record both city council meetings at which the Human Relations\nCommissions will be named and approved by the city councils will, if\nnothing else, continue the dialogue. And continue the dialogue, we must."
}