{
  "id": "d1112-2",
  "text": "PRESIDENT'S COLUMN\nA century and a quarter ago Alexis de Tocqueville observed that Americans were\nan association-minded people, that they had a passion for getting together. Percep¬\ntive as he was, the scholarly Frenchman hardly could have foreseen that today in this\ncountry there would be some 20,000 \"getting togethers\" with an annual attendance\nestimated at 10 million.\nAlmost anyone in the U.S. can attend some kind of convention, whether he be hod\ncarrier, teacher, lawyer, or candlestick maker. The conventions vary greatly in pur¬\npose, size and usefulness. At one extreme is the raucous jamboree where horse-play\nand revelry overshadow more serious aims; at the other, are the sedate gatherings of\nvarious learned societies and scientific organizations.\nWhy do professional people spend time and money to attend conventions? The\nWashington Post recently categorized the people who had come to the American Bar\nAssociation convention as: lawyers who look upon the ABA as a trade association to\npromote their interests and protect their bread and butter; politicians who are con¬\ncerned with power, with who is elected to office, with who makes policy; craftsmen\nwho come to learn, who listen to panels on highly technical subjects, and gather in¬\nformation to help them in their private practice, and socialists, who come to see\ntheir old buddies, to tell tales, to live it up.\nWere these same types present at the NAEB convention at San Francisco? Yes, to\nsome extent, and these disparate approaches pose a major problem, i.e., planning an\n^-agenda to satisfy a wide variety of expectations and interests. Should the program\nbe planned to provide a lavish banquet of many morsels or with a few main courses and\nseveral special side dishes? Should people be stuffed with a continuous diet of raw\nmeat or have a little light wine and an opportunity to relax occasionally between\nservings? Does our convention fit the needs of a varied membership as individuals\nas well as the purposes of the conposite membership which is the association? Is it\nserving a genuine purpose or is it merely a social convention?\nAnswers to these questions depend upon what one conceives to be the purposes of\na NAEB convention. Among other things, I suggest it should attempt to:\n1. Advance the general aims of the association: improving the professional\nqualifications of educational broadcasters and the quality of educational and gen¬\neral broadcasting; working \"to the end that the educational, cultural and technical\nbenefits of broadcasting may be extended to all.\" The agenda should be planned ac¬\ncordingly, since its parts take on added force as they are perceived to be relevant\nto these purposes.\n2. Chart new courses. This is the opportunity for setting new directions,\naccelerating recent moves, adding momentum to current projects, reinforcing, re¬\nfocusing, or revising policies. While adhering to the general purposes, specific\ngoals need to be set and particular approaches selected. The convention is our only\nopportunity for group \"brain-storming.\" It provides an environment for face-to-face\ntwo-way flow of ideas in which vexing issues can be mutually explored, varied experi¬\nences brought to bear on the clarification of problems, and cooperative determinations\nmade as to desired destinations.\n3. Provide a reverberation chamber. For these three days out of 365 the mem¬\nbers are in group milieu that makes them highly attuned to NAEB concerns both as\n^ receptors and stimulators. The convention should create a sort of cyclic-response\nmechanism by which officers and members interact with one another. The administra¬\ntor should stimulate the audience with his conception of how and what is to be done;\nthe audience should, through its reactions, stimulate him, and, in turn, the admin¬\nistrator restimulate the members through his sensitive response to their wishes and\nfeelings."
}