{
  "id": "d1112-3",
  "text": "4. Reaffirm the individual in his choice of a career in educational broadcast-^\ning. A clearer perception of goals, the encouragement derived from realization that\nothers are meeting and over-coming similar obstacles, the zest that comes from feel¬\ning a part of a forward-moving, expanding, positive movement. All these should come\nfrom the convention experience. The conventioneer should return home -with streng-\nened motivation and heightened sense of his own challenging role in helping to build\na free and informed society. Hopefully, he should feel this so intensively as to\nimpart this same sort of lift to workers in his own shop.\n5. Provide professional recognition opportunities for the individual. Such\nopportunities range from making awards to veterans for accomplishments of the past\nto affording younger people a chance to contribute their ideas, share their scholar¬\nship, and exhibit their capacities. Through reading of technical papers, participa¬\ntion in panels, and remarks from the floor, members can enhance their status and\nstature among their peers and gain leadership roles in the guidance and direction\nof their professional organization.\n6. Afford a rich and useful learning experience. The attendee should get his\nmoney’s worth in terms of information and stimulation that can be effectively ap¬\nplied to his own work. This should include finding out about new methods, improved\ntechniques, and the latest developments in equipment and technocracy. He should be\nable to gain fresh insights, novel ideas and new perspectives. And, finally, he\nshould receive some measure of inspiration, something to \"set spark to the spirit.\"\nThis means not only arranging to have competent technical authorities and stimulat¬\ning sessions on pertinent topics, but, above all, providing for exposure to some\ngreat minds.\n7. Demonstrate the cohesion and strength of the organization. Our convention\nshould be more than a platform for the ritualistic utterances of tribal leaders ^\n(what Hayakawa terms \"accustomed sets of noises\") whose principal function is to\nstrengthen our group loyalties, reinforce our professional allegiances, and produce\na common bond of reactions. Loyalty, Edgar Dale reminds us, is more than blind fol¬\nlowing; it is intelligent devotion to a cause or organization. More than grudging\nassent, spectatoritis, aloofness, it means getting involved, participating, helping\ndetermine which way the organization is going and taking responsibility for the con¬\nsequences. It means thoughtful examination of values and then standing together on\na common ground.\nOur open forum business sessions provide an environment for frank, free and\nopen discussions that, though they may appear to produce undue stresses and strains,\nresult ultimately in harmony, cooperation, and a feeling and thinking together that\nachieve not just consent but consensus. The tested fabric is the more secure. Our\nassociation can tolerate, without disintegration, much more disorganization and\nstress than many people recognize.\n8. Be conducive to congeniality and comradeship. This is not fellowship in the\nAmerican Legion sense, but in the mutuality that comes from sharing.the same problems\nand hopes, of meeting and accepting common challenges and responsibilities. The con¬\nvention provides the opportunity each year to sit down at one table, enjoy with others,\nexperience in common. We all appreciate the yearly opportunity to renew acquaintances,\nreminisce with old friends, and meet newcomers. To a certain extent an NAEB member\ncan say appropriately of his convention-going what the cabman said about taxi driving:\n\"It’s not the work I enjoy so much; it’s the people you run into.\"\nApplying these criteria to the recent gathering in San Francisco, it comes close\nto meeting them all. Congratulations to Jim Day and his staff for a first rate pro¬\nduction job and to all who contributed for affording those who attended a most reward\ning and memorable experience. -- WGH"
}