{
  "id": "d1206-1",
  "text": "Pag© 2*\nWhat toplo would you like to have discussed? And if you wish to\ndiscuss your station8s merits* there will be allotted 5 minutes to\neach member to report at the end of the session..\nThe dosing session of the meeting will be for business purposes\nincluding the usual reports* discussion of aims and purposes for\nNAEB in the coming year* what should be done to improve the News\nLetter, and election of officers..\nThere will be no registration fee.. Accommodations iaay be secured\nat Memorial Union or the Sheldon-Munn Hotel in Ames, but more particulars\nwill be found in the August 1 issue*\nLocal Chairman Griffith reports existence of a swell 18-hole golf\ncourse at Ames and suggests that some members might oare to bring along\nthe olubSc Joe Wright has been named chairman of the Golf committee*\nTwo members have already made plans to arrive for golf on Thursday*\nAre there others? Menzer replies that he expeots to be on hand Thursday*\nHow to get to Ames? Well, that’s simple* Fly, ride, or walk* Ames\nis on the main line of the Chicago and Northwestern railroad* Highways\npassing through Ames include the Lincoln (U*S. 30) and routes 65 and\n69* If you wish to fly, land at Iowa City and you oan get a plane\nthere at any time for the rest of the trip to Ames*\nAnd while mentioning Iowa City, I*m reminded that long before September 1\nCarl Menzer hopes to have his station and staff located in the new\nbuilding, which will be done by August 1* We surveyed the layout a\nfew days §go and suggest you oan get many good pointers by a visit to\nWSUI* Carl says you’re wlloome on the way to Ames, or on the return\ntrip - In other words, at all hours on all days*\nWTAW LEAVES NAEB RANKS\nEugene !P* Dumber?, Program Director of WTAW, College Station, Texas,\nwrites? MDean F* C* Bolton, who is In charge of our radio has told\nme that we had best drop our membership in the National Association\nof Educational Broadcasters with a view of Joining the National\nAssociation*“\nINDIANA HOLD RADIO CONFERENCES\nfhe North dentral Radio”aBWor¥“^onferenoe was held on Indiana University\ncampus, June 16 and 17, according to reports from Bob Allen, program\ndirector of radio broadcasting for Indiana U* In announcing the con¬\nference, the program said? MThls is a conference where radio people\nof the North Central States may sit down around the table to discuss\ntheir mutual problems with great frankness and confidence* The sub¬\njects for discussion have been suggested by the station representatives\nattending the conference. These problems have been classified into\nsix panels each with a chairman and discussion leaders* All discussions\nare open to the floor at all times* There are no speeches and no 9\n8distinguished speakers9* Here you can present your problems and get\nan answer If the representatives of 60 stations can furnish the answer.M\nThis conference is another indication of the progressive work Lee\nNorveli© and Bob Allen are doing in Radio at Indiana* Perhaps, we can\nhear more about this at the NAEB convention*"
}