{
  "id": "d1802-1",
  "text": "ETV To Be Topic at\nInternational Montreux Festival\nEducational television will be among the topics to be\ndiscussed at the International Festival of Television\nArts and Sciences next May at Montreux, Switzerland.\nOther subjects to be included during the five-day\nTV symposium will be color television; future TV\narts and sciences; studio, filming, videotape and\ncamera techniques; the role of commercial TV; and\nspace broadcasting. On the latter subject, Russians\nand Americans are expected to highlight the debates.\nAnother ETV Station tor Miami?\nThe Dade County School Board is applying to the\nFCC for permission to build and operate a second\nETV station, according to the Florida E-TV Network\nNewsletter. The letter also said that the Florida ETV\nCommission plans to petition the FCC for a drop-in\nof a Channel 11 frequency near Orlando so an ETV\nstation might be achieved there if local and state\nfunds become available.\nInternational University of the Air\nNeeds Radio Scripts\nNAEB stations and individual members are in¬\nvited to make contributions to the International Uni¬\nversity of the Air.\nThe International University of the Air is an\norganization of European broadcasters who exchange\nshort scripts on matters of current interest for trans¬\nlation and broadcasting on several European radio\nsystems. During the past year NAEB has provided\nthe International University of the Air with scripts\non the Role of the Best-Seller, and on the American\nPress. These have been well received, and additional\nprogram series are requested.\nAt the same time that American scholars who can\nprepare scripts especially for this purpose are sought,\nNAEB stations and members who have scripts al¬\nready prepared are invited to make them available\nfor international exchange. The need is for scripts\nin series of three or four, each talk running from\nten to fifteen minutes. Serious consideration of im¬\nportant subjects, with a philosophical rather than\npragmatic approach, is preferred.\nFor further information write to Burton Paulu,\nDirector, Department of Radio and Television Broad¬\ncasting, University of Minnesota, Minneapolis 14.\nNetwork May Offer Audition Tapes\nAs part of its continuing effort to provide a more\nadequate service, the NAEB Radio Network is con¬\nsidering sending audition tapes to network members,\nalong with the regular printed quarterly program of¬\nferings. Under the proposed plan, at the time the\nprinted offering is mailed, all network members\nwould receive tapes of programs Nos. 1 and 2 from\neach new series included in the offering. After the\norders were received, distribution of new series would\nproceed with program No. 3 from each series.\nThis would give each station manager the oppor¬\ntunity to hear rather than just to read about new\nseries. Also, this system would eliminate much useless\ndubbing of series ordered but never used.\nAlthough the final procedures for this plan have\nyet to be decided, all network members should submit\nnow their reactions to this proposal. If interest is\nsufficient final plans will be made. If a lack of in¬\nterest is apparent, these plans will be abandoned and\nthe present system will continue. All network mem¬\nbers are urged to send their comments to the network\nmanager.\nPLACEMENT COLUMN\nDecember I — Available now. Will receive B. A. in business\ncommunications in June. Male, 27, married. Will go\nanywhere. Two and a half years of experience in edu¬\ncational FM broadcasting—from applying for CP to\npurchasing equipment, training staff, programing, pro¬\nducing, and going on air. $5400.\nDecember 2 — B. A. in TV production. Male, 22, married.\nHonor student, winner of top awards in his field. Com¬\nmercial experience. Desires position as producer-writer-\ndirector with ETV station seeking hard-working, knowl¬\nedgeable idealist. $5500.\nDecember 3 — Male, 25, unmarried, with B. S. in communica¬\ntions, two years with Armed Forces Radio and TV, and\ntraining in all phases of radio. Seeking position in edu¬\ncational radio as announcer in St. Louis area. Open\nsalary.\nDecember 4 — Married man, 33, with M. S. in education*\nseeking management position in educational radio. Ten\nyears of experience in educational broadcasting doing\nproduction, programing, and administration. Last four\nyears program director in large midwestern university\nstation. $7000 minimum, any location.\nDecember 5 — Single man, 27, wants to write for, help to\nproduce, or to organize private or civic ETV. Has B. A.\ndegree in English and education. Does not object to\nforeign or domestic travel.\nDecember 6 — Versatile, creative, productive man, 29, mar¬\nried, wants writer-producer position in either educa¬\ntional radio or TV. Professional announcing and selling\nbackground. Holds 1st FCC Phone License. Has M. S.\nin speech and is speech therapist, working on Ph.D.\nTape available. $6500 minimum.\nSTUDENT TRAVEL GROUP NEEDS EDUCATION DIRECTOR\nSITA (Student International Travel Association) is\nlooking for someone to join its organization as edu¬\ncation director. Their requirement: “A young edu¬\ncator with some sales incentive and imagination.”\nAnyone interested should write to NAEB Headquar¬\nters.\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, I 19 Gregory Hall,\nUrbana, III. $5.00 a year, edited by Betty McKenzie.\nNEWSLETTER"
}