{
  "id": "d977-102",
  "text": "March 2$, I9$S\nMr. John K. Walts\nEducation Program\nThe For<s Foundation\n477 MadI ton Avenue\nMow York 22, Now York\nDear John:\nI am enclosing the second draft of \"Request of the NASS to the Ford Founda¬\ntion.\" Actually this If the fifth draft of a document which Is Churchilllan,\nat iaast In the sense of \"blood, sweat and tears.\" It represents the earnest\nand best efforts of us all, and most notably those of Harry Skornla.\nHowever Imperfectly the Committee may have managed to convey Its notions of Its\nhopes and plans. It has triad to make explicit a series of needs and opportune\nties In education wharain we believe educational radio—and particularly educa¬\ntional television—can play a significant and major roio In the future.\nIn stating our concepts wa have tried to transcend existing structures or\n\"hierarchies\" within educational broadcasting, and to address ourselves rather\ntoward the Issues end needs end the opportunities, not to the sustaining of\nexisting people, places, organisations or activities per se, our own or others.\nWe hope we have managed to make clear that our concern Is not technical or\norganisational \"proprietorship\" of the new means of electronic communication,\nnor an infatuation with them as gadgets* nor a preoccupation with the techniques\nas ends in themselves. But we do believe that whiia \"these instruments are\nonly e means to an and,\" It Is highly Important at this stage In educational\nhistory not to operate In e double vacuum. The ends must be defined end the\nmeans must be shaped to the ends. The frequent feet that neither objective Is\nachieved Is e situation with which ell of us ere abundantly fern)Iter.\nObviously this is an HAEB request, conceived In terms of our own tradition,\nexperience and conviction. This, of course. Is our frame of reference end we\ncannot be quite so objective as to deny our own existence. However, in each\ncase where we mention an existing activity or facility within NACi's operational\nframework we hope it Is clear this Is a reference to an already established\nr4source whose values can be transmuted to the future, not an effort to perpetu¬\nate the status quo. Our goal: e framework to catalyze e wide-scale attack on\nthese educational problems."
}