{
  "id": "d977-159",
  "text": "tester He)son\nJune 6, 1958\nPage 2\nMrLnfl the first year the proposal would envision a continuation—w)th some\nreductions—of the services made possible by the present Foundation grant.\nSimultaneously, plans for a sharp cut-back of services In the second year\nwould be under way.\nParing the second year a number of services previously offered would be elim¬\ninated altogether and arrangements for their complete termination—or continua¬\ntion under other than Foundation auspices—at the end of the year would be\ncompleted. Such a plan would assure NAC8 services to new and pending stations\nat a vital time (the Senate has just passed a bill providing $1,000,000 to\neach State for educational television equipment), it would also provide for\nan orderly termination of services and presently-employed personnel over the\ntwo-year period.\nResearch—An “.Article o£ Conscience11—$60.000\nThe Committee has also directed me to identify—quite separately and apart\nfrom the foregoing—what might be classified as an “article of conscience.*1\nWe describe it as a two-year $60,000 program of “Research In Educational\nTelecommunications,'1 during 1959-60. While the MAES itself is prepared to\nundertake such a project, the auspices under which |t H conducted are far\nI ess Important than meeting the need. We have quite specific concepts of that\nneed and of what we mean by “research,” and those concepts come from the\n“firing line.\"\nAt virtually every national and international conference held on educational\ntelevision this year (most recently the NAEB-U.S. Office of Education session\nin Washington) which Scanlon and Stoddard attended, the first and most urgent\nneed expressed has been for research: for the collection, coordination, inter¬\npretation and distribution of findings j_n a clearing house function, for the\n-development of research of different types from those now avallabie. Including\neffects and combined uses. No where does there exist any picture\n2f ShS. total 1 tv of Involvement jn these areas, only Its parts.\nIt Is our belief that the results of two years of intensive effort, responsive\nto the urgings NAEB has received from agencies, would be educationally signifi¬\ncant whether carried beyond 1959-60 or not. It is also our belief for the\namount budgeted a capable director could be secured on leave from a permanent\nposition, and a comprehensive approach to this spectrum of problems begun.\nI will be most grateful for your reactions and I stand ready to provide you with\nmore detailed information at your request.\nSincerely,\nRichard B. Hull, Chairman\nFoundation Committee\n2480 North Starr Road\nColumbus 21, Ohio\nRBH/mh\nw'\ncc: Paulu, Schooley, Chadeayne, Miles, Skornia"
}