{
  "id": "d977-167",
  "text": "-1*-\nCambridge lies in the midst of farm fields. It is far off the iiain highway-\non a gravel back country road. A railroad line runs through the fields, passing one\nend of the town. There is the main street: lumber yard, bank, barber shop, general\nstore, garage, Masonic Hall, a restaurant, a tavern. The school is one turn to the\nleft and down a block. As we go up the steps, a sleepy dog gets up and walks slowly\naway from the entrance of the two story red brick building.\nInside, the superintendent, Mr. Harsha, greets us, takes us to his tiny -office.\nWe ask him about the school board’s answer to our request. He fumbles a moment,\nthen gives us their answer. Their answer is: No.\nWe ask him why. He says that Cambridge has had much unfavorable publicity because\nof its school. The board feels that the television program will be more of the\nsame — another black eye for Cambridge. He hints that people from \"higher up” are\ntrying to push Cambridge into abandoning its school. The town, he concludes, would\nnot be a very good subject for a television diow.\nAt this point, our producer. Bob Shayon, said he wsuld be interested in talking\nto the head of the school board. The superintendent made a phone call, and in a few\nminutes, Harry Cairns, a big, poker-faced man came into the room.\nBob Shayon began to explain the project. WOI-TV, he said, was trying to prove\nto the world that democracy really works in the local community and that the people of\nthe small town have the ability and the integrity to face their problems hone stly\nand come to intelligent decisions on them. We had chosen Cambridge because it was a\ntypical town and because it had a problem. We did not care what Cambridge did about\nits problem so long as it recognized it for what it was and tried to deal mth it\nhonestly. Then Bob Shayon asked Harry Cairns if it were possible to arrange a town\nmeeting so that the people could decide, in the democratic way, if the town wanted\nto go on television.\nMr. Cairns said yes it was possible. The meeting was set for Thursday night,\ntwo days hence, in the high school room of the school.\nAt eight o’clock on Thursday evening, £6 people of Cambridge were seated at\ndesks in a large room on the second floor of the school. Someone said the church\nchoir was practicing and they would be over later on. The Masons sent word they\nwere entertaining guests and could not com© but would send a representative.\nBecause we thou^it this meeting might be an interesting piece of \"Americana”, we\narranged to have a sound film made of the entire proceeding. We were not quite certain\nwhat effect cameras and lights would have on these people. Nor were we quite sure what\nwe would learn from the film. As it turned out, this film gave us the basis for all\nof our pre-show tactics and for the format of the television show itself.\nThe school superintendent introduced Mr. Shayon who explained to the group,\nin much the same fashion he had explained to Harry Cairns, what WOI-TV was trying to\ndo. He said the people present would have a chance to vote on whether they would like\nrepresentatives of the town to appear on television. But first, Mr. Shayon said, it\nwas necessary for us to determine whether the town would do for our purposes. In order\nto have a program there must be differences of opinion. It was up to the toi«i to prove\nthat it could provide representatives for each of the alternative views of the school\nproblem."
}