{
  "id": "d977-174",
  "text": "-11-\nThe vote on the electric vote-board is an artificial device. The people of\nCambridge are probably not ready to come to a decision on their problem. They may not\nbe ready for ten* perhaps twenty years. This much* however* is true: The people of\nCambridge will* sooner or later* decide what to do about their school. It may be a\ndecision by default. No decision* that is* the decision to drifts is none the less a\ndecision. By forcing these people to reach a provisional decision now* we are\nimpressing on them and on the audience the fact that talking is not enough* that at\nsome time in the future a decision must be made* and action must be taken. In this way\nwe move forward* out of our half hour of time-present* five* ten, twenty years into the\nfuture* to demonstrate symbolically the end of the present process of discussion* even\nas* at the beginning of the broadcast* we reached back into time to picture the built-\nup values of the years which are the meaning and the heart of all decisions.\nThe dry-run closed circuit broadcast of November 1$ proved to us that by using a\nprofessional* highly organized format* to enclose a free and spontaneous discussion, we\ncan create a satisfying* rewarding television show.\nIll — The Towns Talk: A Long View\n\"We were going to hold the discussion down to U$ minutes* tut we ended up by talk¬\ning an hour and U§ minutes. It was almost impossible to stop it.\"\nThis is the statement of Carlyle Gouger* Story County Extension Agent. He is\ntalking about the group of 35 men and women he brought together to watch our dry-run\nproduction of The Whole Town's Talking. These people had never come together before.\nAlthough they were all from Story County, they knew little about Cambridge or its\nschool problem. They were assembled to test the effectiveness of our show\\ln creating\nan atmosphere for constructive discussion. We wanted to find out if the people of\nCambridge talking about their problem would stimulate other people to discuss the\nproblems of their communities.\nMr. Gouger* s report indicates that on this score the program was very successful.\nThe discussion of the problem of school district reorganization was intense and pro¬\nlonged. Many of those present thought the Cambridge people were not altogether\nrealistic about facing up to their problem. They felt that the final vote to con¬\nsolidate represented a step which might have been helpful fifteen years ago* -but was\nout of date as a solution to present difficulties. By watching the people of\nCambridge, by getting an objective view of the problems of an Iowa town* these people\nhave, we believe* gained insist into the real issues facing their own communities.\nA second reason for assembling this test group was to get reactions on the\nprogram itself. In general these reactions were favorable. The group liked the film\nintroduction* they liked the school room setting, they liked the use of guests* they\nliked the vote. They liked veiy much the idea of bringing together people from a\nsingle town to talk over a community problem."
}