{
  "id": "d977-4",
  "text": "the situation Is as confused aa it is internationally* Sincere\nrequests for information and guidance in both television and radio ftrea hundreds\nrQnlSoow 1OT iT^y «nry man gury^ feMi TMfiirfrr iii uvuil v xpjluu wuw\nof dd&iinistrstcre, associations* schools and individuals are cross^vofbrred\nte»tgatterflMm one organisation and agency to another*\nThe JCBT* being essentially TV-only* has its Washington and txreqvsntjy\nrespooslbdXitlefl and neither the background nor qualifications to service such\ngeneral requests* The SEED* likewise heavily c«?sitted for 77 only* and invogvod\nin I «>:&> effort to rally support fir itself long enough to drsaatiee the\nmewing of education in the television domt area* ie also not equipped to\nherila such aocrdiantioa* ^ ^\nThe NAJ5B* Shiah hae the tradition* reapimsibility* and reeouooai within vm\nraska* hae neither the staff* nor the budget to handle each needs7 adequately; For\nunfartunately l) in the current preoccupation with television* funds for the\nsupport of radio* or joint televislo&redio planning have been virtually non*\nexistent* except for the far-sighted assistance provided by the W. K* Kellogg\nI Foundation* And 2) educational television* unfortunately^ hae coese to mean* to\nall too many* only programs on e network basis*\nThe fact (which the HAEB sod broadcasting historic/is know all too well from\nthe U. S* experience in educational radio) that stations also may he lost* or\nbecome ineffective* because of poor local progressing or management* pocr production*\npoor technical operation* poor public relations or poor educational orientation*\nhas cOl too often boon overlooked* Yet unless support ie provided in all these\nareas* as well as in basic research, and inter-media balance* besides the support\nnow given in the television progress area naticroeCUy* some of the millions already\nspent* and the many more yet to be spent* nay be largely wasted ir In duplications*\ncontradictions* costly trial and error* and other mistakes which^a responsible\nassociation like the NAEB* adequately supported* sod adequately guided by the\nnation’s best ndndojcould prevent*\nIn its deliberations, prior to the preparation of this request, the NAEB and\nits governing Board firmly agreed to the need for putting the national educational\nwelfare ahead of that of the NAEB* It is willing to discuss any now role which\nit might plcy* independently or as a part of any responsibly planned merger* which\nwill Hp provide the unified national leadership and clearing house functions so,\nI hS**0\nl (K^eas^Eption that it may remain a separate ctrganisatio&^he NAEB plans\nthe establishment of a Policy Guidance Council to examine its directions and insure\nthat its objectives ore both honest and educationally valid* Such a Council will\nbe composed of outstanding educators* industrialists and national leaders whose\nwisdom can be tapped and whose recommendations will be followed*]\nA first step* at a lower* more specific level* has already taken in this\ndirection* following the recent NAEB Research Seminar. Tho NAEB Research Camdttee\nhas been reconstituted* and a group of educational consultants has been named to\nguide the NAEB in its functions and activities in tho Research area. These plans\nare more fully outlined in the Research Request which follows.\nSpecific Requests\nThe NAEB does not believe that the tasks it faces can be efficiently undertaken\non a ahart-tem bairi.0. The availability of competent, educationally Wjaliftea\npersonnel on basic, end the ability to undertaha long-tom projects, particularly\nto instructional, research, teacher-training anti similar areas, la seriously ccapro-\nmiaad, if not wholly vitiated, by ecy year-to-year approach."
}