{
  "id": "d977-45",
  "text": "MEMORANDUM eeiy£0\n\"««> station\nJanuary 14S 1958\nTos Gertrude Broderick, Henry Chadeayne, Franklin Dunham, Harold\nHill, Richard Hull, Leonard Marks, J^jnes Miles, Edward\nRosenheim, Fr^g^ooley, ■Harry^^'^ornia\nProm: Burton Paulu\nHere, all wrapped up In one omnibus memorandum, Is a review\nof the schedule we will be following during the period January\n19 through 23, 1958.\nSunday, January 19® Rosenheim9 Skomla and Paulu travel to\nAnn Arbor. \"Reservations (I understand) have been made at the\nMichigan Union by Ray Stanley® (If you haven’t heard about yours,\nbetter get in touch with Ray; he wrote confirming mine. I arrive\nat Willow Run at 8:30 p.ra. on Northwest Airlines #312, and shall\ntake a cab to Ann Arbor alone unless I hear from one of you that\nyou are arriving about the same time.)\nWi^.1 Rosenheim and Skomia try to call me in my room about\n10:00 p.m®? We cannot meet before then because of previous\nappointments by Skomia, but we then can meet for a few minutes®\nMonday, January 20® Breakfast together at 8:30 to prepare\nfor later meeting with ETRC personnel® Rest of day as required\nwith ETRC®\nTravel to Chicago that evening (I take American Airlines #781,\nleaving Willow Run at 6:25 and arriving Chicago Midway at 6:50 pom®)®\nStay at Del Prado Monday evening? reservations made by\nHeadquarters.\nTuesday, January 21. Meeting of Foundation and Finance\nCommittee all day (starting at 9:30 a®m.) at Del Prado (Chadeayne,\nHill, Hull, Miles, Paulu, Schooley, Skornla).\nHull, Skomia, Paulu travel to Washington Tuesday evening on\nCapitol #16, leaving Chicago 6:00 p.m®, arriving Washington 9*08\np.m® (Availability of space determined by Headquarters? each\ntraveler to make own reservations with Capitol, however)« In\nWashington, stay at Dupont Plaza. Reservations made by Steetle\nat Paulugs request? three singles for January 21; Paulu alone for\nJanuary 22.\nWednesday, January 22. Meeting in Washington (starting at\n9:30 , r>lace to be announced) of ad hoc steering committee\n{Broderick, Dunham, Hull, Marks, Paulu, Skomia) to plan Washington\nmeeting. Wednesday evening: Hull and Skomia depart Washington®\nThursday, January 23® Paulu at JCET meeting? returns to\nMinneapolis that evening on Capitol #119, leaving Washington 5*^5;\narriving Minneapolis 9*1? P*ro.\nBPids"
}