{
  "id": "d977-51",
  "text": "«\nI\nf<ECSlV(:i)\n^station\nhtiH 4\n2 ?o Hr] a\n(Wlw„ ‘ * ®UC\nMr. John Weiss, Tiee*J»r©«ldent\nThe fund for Advancement of Education\n1*77 Madison Avenue\nMew York 22, New York\nDear Johni\nMarch 1, 1958\nTills is to report that Harry Skortda has now completed the first draft of\na new HAEB proposal for submission to the Ford Foundation. Burton Faulu,\nSkornia and I will be giving the material an intensive review during the\nnext several weeks. As quickly as a final and formal document can be pre¬\npared we will put It in your hands.\nOn behalf of all of urn may I thank you for your interest and your careful\nand considered reactions to our preliminary draft proposal. They were ex*\ntremely helpful. -You were most generous with your time, and we are grate**\nful for it*\nYou may be interested in a brief account of our Washington activities* You\n.recall we had discussed the possibility of a national «overview and direct¬\nions* session on KT? to be called, by the U* S. Office of Education and the\nMBS (with the. 1950 SW meting before the channel reservations as a pre¬\ncedent).\nYou recall it was this mating -which brought the JCET into being. Mow near¬\nly 8 years later we felt it was tine to try to reappraise and assess the di¬\nrections and. the goals in education to which television is feeing applied.\nMe spent two days with Franklin Dunham and Gertrude Broderick who report the\nD. H. Office of Education will not only officially sanction such a meeting,\nbut has a great deal of enthusiasm about it. Dates have been set {May 26,\n2? and 28) and official invitations from the U. S. Office of Education will\nbe forthcoming shortly. We would hope that you. Dr. Stoddard, and others\ncan plan to attend.\nDr. Arthur Adame of tb Aiaerlcan Council on Education signified ills interest\nin having the Council participate and offered the services of the Council’s\ntelevision committee staff toward this end. (tinder the Joint sponsorship\nof HAEB and the U. S. Office the Council would be a participant, not a host,\nand. on© of the previous rationales whereby the RAEB, the JCET, the SYNC, etc.\nwould ask the Council itself to participate, does not now prevail)•\nStetilp teqmaaad his interest in such a meeting and pledged his support on\nbehalf of JCET."
}