{
  "id": "d977-6",
  "text": "This sill provide tar continuing engineering assistance to stations In-haing\nand lrHplannlng stages, tar kinescope and other recording problems, for space\nand architectural planning assistance tar studios, for studies of land-line\nnetwork feasibility at the proper tine for radio and/or TV, for SCC technical\nrelations, and far technical workshops (budgeted under Professional Advancement)\njLU*\n4*\n(A\n80,000.00 per year\n1400,000.00 5 year total\nStar the past seven years the NAEB has operated the NAEB Vodio Network, using\nji, tape distribution. At first supported by the W. K. Kellogg foundation, this\ni activity, as noted below, is now supported on a minimal operational basis by\nHowever, this basis can only he termed wholly unsatisfactory, as coopered to\nthe need. There are no funds for a qualified program director, for example,\nwithout which no truly satisfactory national service can be provided. Present\nequipment is out of date and antiquated. No adequate archive preservation is\npossible. No personnel or budget exist for foreign program distribution. No\nfunds are available to the NAEB Itself for program grants, contracts or\nproduction. He present arrangement, whereby program funds for radio as well\nas television ere channeled through the ETRC, has resulted in much friction,\nembarrassment to the NAEB, and x^sunderatandings which freeing the ETRC, at\nleast for a time, from this radio responsibility) would relieve. The Center\nhas neither the radlo-qualifiod staff nor the patience to administer these\nfunds currently in a manner satisfactory either to the preservation of\nsatisfactory relations between the NAEB and its own members $ the status of\nthe NAEB in relations with foreign organisations or the N. S. Government; or\nrelations between the Center and the NAEB.\nThe sun requested for this service would be allocated as fallowst\nSalaries\nCoordinator\nNetwork Manager\nAssistant Network Manage? - Production\nAssistant Network Manager - Traffic\nDuplicator Operators (2 0 &3,600)\nMiscellaneous Labor (2 half-time)\nStenographer\nRetirement and W. C.\nHavel (for the Coordinator)\nSupplies and Expenses (including tapes)\nProgram grants (radio, domes tic)\nProgram exchange (radio, foreign)\nEquipment replacement and upkeep\nTotal needed per year\nEstimated income from network members\nTotal requested\n* 8,400.00\n6,000.00\n5,600,00\n4,400,00\n7,200.00\n3,230.00\n3,300.00\n3,870.00\n2,000.00\n20,000.00\n> 40,000.00\n20,000.00\n4,000.00\n2,000*00\nms?xxm\n50,000.00\ni &,obo.66\nThe coordinator of program development would, with hie staffs\n- Provide program coordination (for local programming only, avoiding the\nNetwork ETV program functions of the ETRC) in TV as well as radio, as\ncoordinated\n• Operate the NAEB Radio Network, including the handling of International\nexchange programs."
}