{
  "id": "d977-7",
  "text": "5. Basic Haaber\njT^ervicea\nPage 6\nI 67,130.G0 per year\n335,650.00 5 year total\nDuring the past few years the NAEB baa lost considerable xambers of membera,\nboth from the Network and the Association, because its staff and budget have\nbeen 00 asall, and the energies and funds available so fractionalised, that\nthe services which station and educator members should logically expect have\nnot been farthcculng.\nOur newsletter and Placement aarvioa are at present operated by ene half,\ntins aiqdani. Oar Journal is edited by another student. We have so editor\nto edit toe ceovsntlSa conwittoe, workshop and annual reports, Ractsheeis\nand other materials which wo issue* this is not a responsible ttaamer in\nwhich to operate an association which expects to be useful to its members,\nand provide a truly national and international center and flow of assistance,\nguidance, leadership and cervices.\nRequested therefore are funds (replacing our present placement\nas follows1\n^—Editor (and .Public Relations)!/\nPlacement Officer\nEditorial Assistant--—^\nStenographer\nRetirement and W. C.\ntotal Salaries\ntravel\nSupplies and Efcqportfsss 0\n^ i r Region^jetinga\nConsultant Services\nPublications\nTotal\n^-*k\n1^400.0)\n6,000*00\n4,800*00\n4,800.00\n3,300.00\n2,730*00\n> ... ' '\",\n[ ly\n' *10, er,\n> y 6Av-\nsarvice grant}\n$30,030.00\n2,000.00\n2,000.00\n—1,500.00\n21,600.00\n10,000.00\n$£7,130.00\nThe sma included in the Consultant Services item include funds presently\nexpended from other grant funds for Mcnagsaent Counsel, Consultation Services\nand Placement. Provision is also made for $5,000 for “isvrasidence* con¬\nsultants, who would be available in station and production center situations\nwhere they would be critically needed.\nInDTE* EXCEPT FOR CAPITAL. ALL THE ABOVE ITEMS ARE ESSENTIALS FOR CONTINUATION\nOF PRESENT HJNCTIO^r'Bm THE REVlSIBSS NOTED. THOSE WHICH FOLLOW ARE J\n\\E5\nESSENTIALLY FOR NSW SERVICES.\nResearch Department $ 73,600.00 per year\n368,000.00 for 5 years\nAs stated at the beginning of this request, regarding the need for a research\ncoordination center not only for the U. S. but also to ssaet international\nneeds, the MSB’S responsibility in this area baa become inescapable.\nAt the recant NAEB Research Seminar, attended not only by those in charge of\nresearch for the BTV stations of the IT. S. but also by representatives of\nCanada, the various agencies of the U. S., and some twelve distinguished\nconsultants and educators, for their counsel, this obligation was firmly put\nto the NAEB. One of the statements drafted by this Seminar is applicable\nhares"
}