{
  "id": "d977-94",
  "text": "-6-\nCAEE: The Canadian Association for Adult Education\nWe have devoted considerable energy and time to meeting all reason¬\nable requests from this group. The NAEB Executive Director gave the keynote\naddress and appeared on several TV programs and college and university panels\nand platforms in February of 1957 in Saskatoon, Saskatchewan, for a confer¬\nence devoted to educational radio and television in Canada.\nCBC: The Canadian Broadcasting Corporation\nA warm bond of friendship exists between the NAEB and the CBC,\ndating from the 1940’s when experimental CBC programs served as models\nand encouragement for NAEB efforts. Since that time the NAEB has exchanged\nmaterials and programs with the CBC, in whose studios our Waya of Mankind,\namong other NAEB programs, were produced, and we have had the pleasure o\nincluding several CBC broadcasters (as well as others from British, Australian,\nNew Zealand, French and other Foreign systems) as students in our various\nworkshops and seminars, particularly during 1956-57. Their contributions\nto a genuine understanding of universal broadcasting educational principles,\nas well as what they received from these conferences, are among our most\nrewarding efforts in the international field. As the year closed, union and\nother barriers had been cleared away to make possible NAEB Radio Network\nuse of the entire CBC 4 * Wednesday Night” series of outstanding cultural\nprogramming, and some of the NAEB’s better offerings of in-school series have\nbeen made available for CBC use.\nCNO: The Council of National Organizations of the AEA\nThe Executive Director is a member of the CNO’s Executive Committee,\nwith which he met several times during the year • He is also a member of\nits Broadcasting Committee, which he succeeded in having created to\nreplace the former TV Committee, of which he was also a member. The\nAssociate Director is a member of the CNO’s Convention Committee and is\none of the leaders in the CNO’s Editors* Conferences.\nDAVI: The Department of Audio-Visual Instruction, of the National Education\nAssociation\nThe Executive Director is a member of the Editorial Board of this organi¬\nzation’s Audio-Visual Communications Review, is a member of the committee\nfor its National Tape Repository at Kent State University, and has given numer¬\nous addresses before national and state conventions—the most recent being at\nIndiana University June 7, 1957. We also have an exchange of all materials\nwith this organization.\nEBU: The European Broadcasting Union\nThe NAEB during the past year was approved for Associate membership\nin this organization. The Executive Director’s article on the NAEB, carried\nin the EBU Bulletin, for the first time made known to international readers\nthe existence and significance of a non-commercial service in the U. S."
}