{
  "id": "d1164-10",
  "text": "-4*\nFROM MR. R. O.- EIGGY, DIRECTOR OF BROADCASTING STATION TNEAO, OHIO STATE UNIVERSITY,\nCOLUMBUS: \"I regret that I have not been able during the past few weeks to write you\nmore fully concerning Association matters. Our case before the Federal Radio Commis¬\nsion has taken me away from the office for nearlv two weeks, which together with our\nannual Farmers* Week celebration has made it a very busy time.\n\"In reference to your request for copies of the plays to be given during Februarv, I\nhave asked Miss Jenkins, of our staff, to give me copies of all possible plays to be\nreleased in this manner. We are often under obligation to the author and cannot al¬\nways obtain permission to release these for general distribution to our stations. I\nam sure that we will be able to secure several additional plays for you within the\nnext few days. I have not had any reaction from any of the stations in reference to\nthe first play ’The Underground Railroad’ sent you last October. This was a particular¬\nly successful play for us, and I would appreciate to know something of its reception.\nWe have had many fine comments and words of appreciation about the play ’An Ohio Enoch\nArden’ which you apparentlv distributed some time ago.\n\"You have asked for some information on our pre sen-difficulty before the Federal Radi®\nCommission. It is the result of the inability of the University and the commercial\nstation, with which it shares time, to agree upon a satisfactory division of time as\nrequired in G. 0. 105.' A hearing was held on Nevomber 24 and the following examiner’s\nreport was unfavorable, a time division being proposed which is entirely unreasonable,\nPnd limits all broadcasting to essentially daylight hours. A recent bulletin of the\nNational Committee contained a statement of this examiner’s report, and as issue, to\nbe mailed within the next week, will contain a complete text of the exceptions as\nfiled by Attorney General Gilbert Bettman of the State of Ohio who is handling the\ncase for the University. Attorney General Bettman has made a very fine presentation\nand has shown a fine interest in our work. He is an exceptionally aboe and agressive\nlawyer, and apparently is willing to carry the fight just as far as it is necessary.\n\"Your various letters and bulletins are most interesting and helpful. A copy of Dr.\nHarding’s letter is a very beautiful presentation of the difficulties of the education¬\nal stations and I hope that some publicity will be given to his statements. Have you\nsent copies of all bulletins to Mr. Tyler, Mr. Perry and Dr. Morgan of the National\nCommittee? If not, please send them copies of future releases from your office. It\nmight be well to include all the members of the National Committee, if it is practical\nfor you to do so.\n*'I trust that you will proceed with whatever matters seem best to you and not hesitate\nto make expenditures within the limits of our resources for any matters which seem\nbest to you.\n\"I am much interested in recording matter, and as you know, attempted last year to\nget some definite action and recommendation in the hope that some money could be\nobtained to proceed with a definite program. If the suggestions you receive show\nconsiderable interest it would be well to follow this matter closely. I shall be\nglad to assist you when any definite plan is proposed.\n\"We have had many research projects under way here but our recent difficulties have\nmade it necessary to side track these, but we are still hoping to make available some\nmaterial of value in connection with program service. May I suggest that you inquire\nfrom other stations as to program listener surveys?\"\nFROM MR. W. L. KADDERLY, PROGRAM DIRECTOR, RADIO STATION KOAC, OREGON STATE AGRI¬\nCULTURAL COLIEGE, CORVALLIS, OREGON* \"I am ashamed of the fact that until now I have\nexpressed no appreciation for the several bulletins that you have issued in your\ncapacity as Executive Secretary for the American Association of College and University\nBroadcasting Stations.. I have read each of these bulletins, have found them most\ninteresting and valuable—and after the reading my determination to express a ’thank\nyou’ was registered mentally. But the actual transposition of those mental ’thank\nyou’s’ to paper has been a long time oc ingG"
}