{
  "id": "d1164-11",
  "text": "\"Fortunately, the executives who must pass upon the destinies of radio at this in¬\nstitution are forward looking and progressive. Paul V. Maris, our director of exten¬\nsion, has for years believed that radio is a powerful factor in the field of adult\neducation. His active support of appropriations needed by our station has gone a\nlong wav in securing our present very good equipment, and funds that have at least\nenabled us to demonstrate the possibility in educational programs. Our president.\nDr. W. J. Kerr, also has looked upon radio as one of the potent means of enabling this\ninstitution to better serve the people of the state.\n\"The result is that we are rather fortunately situated with an unlimited license and\nwith modern studios and modern equipment. Of course, we do not possess everythin?: we\nwould like to have, but we do have most of the essentials.\n\"An examination of the list of stations in the United States indicates that KOAC is\nthe only.one in the country owned and operated by a publicly supported educational\ninstitution that holds an unlimited license on a regional channel with 1000 or more\nwatts power. A veritable ’Last of the Mohicans.’ And we are in grave danger of join¬\ning the ranks of those who have been forced to share time.\n\"Since September 21, 1931, we have operated 12 hours a day except Sunday, Up to that\ntime we were operating about six hours a day. In fact, our budget for the present\nfiscal year was based upon e six or seven hour program daily except Sunday. It was\nnecessary to go to 12 hours in order to hold our unlimited license and our State Board\nof Higher.Education authorized us to make the jump. No added funds were provided for\nthe 10C% increase in program service, so we have been using up our money for this year\nat a more rapid rate taan was contemplated. As -things stand right now we will run out\nof money sometime around April first unless something is done between now and then to\nreplenish the budget. Df course, we have plans in mind and under way, but whether or\nnot these are consumated remains the question at this moment.\nYour.special 'rush’ bulletin including letter from Director Harding to Dean Vogt was\nmost interesting—and another bit of evidence to support our determination to go the\nlimit in holding our present unlimited license.\n\"I find we are not sending you our advance program schedules. Next week’s schedule\nis enclosed and hereafter you will receive this material regularly.\n\"Again let me thank you for the information contained in your bulletins. You are per¬\nforming a real service.\"\nFROM DR. B. B. BRACKETT, DIRECTOR OF STATION KUSD, UNIVERSITY OF SOUTH DAKOTA,\nVERMILLION, ON FEBRUARY 24 RELATIVE TO A VERY IMPORTANT NEWS RELEASE DEALING WITH\nMINNESOTA STATIONS* \"The enclosed news clipping should interest our members and the\ninformation should get on to Mr. Perry, unless he already has full data about it.\n\"The Carleton and the St. Olaf people have been very active and consistent members of\nour Association, Minnesota University has not subscribed to membership recently, but\nI think they did so some years back.\n\"By the way, Minnesota University has two calls, YILB and WGMS, I do not know why.\nYou have them listed separately. I think they have only one station and one 1000\nwatt transmitter.\n\"I understand that MIDI of the Dunwoody Industrial Institute, Minneapolis, Minnesota,\nhas been forced to sell out by the pressure of its commercial partner, in a manner\nalmost identical with the efforts of T/ffiHM to get the time of its educational associates^\nThe news clipping sent by Dr, Brackett is from The xMinneapolis Tribune, Thursday,\nFebruary 18. It reads as follows* \"Colleges Seek Radio Rights\"-From the Washington\nBureau of The Minneapolis Tribune—Washington, February 17— A contest between the\nrights of educational institutions and purely commercial radio st\nved"
}