{
  "id": "d1164-7",
  "text": "«*8*»\nof Listening to KSAC; Irregular Hours; and Comments by Listeners* In addition to\nthe above, policies of state-owned eduoational stations are discussed at length\nand much valuable information is presented as a result of a questionnaire survey.\nFrom the above it would seem that such a survey could be of extreme value to every\neducational station. It offers a means whereby the station director may obtain\ndefinite data as to the effectiveness of his programs, as well as the listeners and\narea served at all times. Too many good programs fail because they are more or\nless a \"shot in the dark.\" This would be corrected if a yardstick in the form of\nsuch a survey were available for reference.\nA communication from T, Atherton Dixon, The Travel and Industrial Development\nAssociation of Great Britain and Ireland, British Empire Building, Rockefeller\nCenter, 620 Fifth Avenue, New York, advises that a series of fourteen-minute talks\nby well known writers is available free of charge. These travel talks are free\nfrom advertising matter and it is not necessary to credit the Travel Association as\nthe souroe of this material.\nH. Sugihara, president of the Oriental Radio Association, whose address is\nP.0. Box 150, Dairen, South Manchuria, writes that the Association is holding a\ngeneral meeting in Dairen this winter. He further writes*\n\"Availing the chance of a large congregation of radio men and men connected\nin the radio, and exhibition of a wide of various helpful data is planned. W’not\nyou be good enough to send us with your*\nGuides and Pamphlets\nAdvertising materials and posters\nPrograms of Broadcasting and hand bills\nView photos of your station\nand other interesting materials.\"\nPerhaps some NAEB members will be good enough to forward H. Sugihara the ma¬\nterial desired. Thank you please,\n#\nIt is understood that Dr, George Zook, Director of the American Council on\nEducation, has honored our vice-president, W. I* Griffith, as well as Dr, Tyson;\nDr. Chase, President of New York University; and Dr. Crane, President of the\nUniversity of Wyoming, with an invitation to consider the establishment of a radio\neducational institute. This committee meeting will be held in New York City,\nOctober 15, Members of NAEB may look forward with a great deal of interest to the\nresults of this meeting.\nListed below are a number of interesting bulletins available, in most cases,\nfree of charge. Limited space does not permit details of the material to be given\nhere but they are listed for reference in event you are interested in the work\nbeing done."
}