{
  "id": "d1297-0",
  "text": "K \\ V\\ V TTTLT\n\\\nm\nP\"\nWr\\) Ul\\\nlLL\nlH\nOffloe cf Executive Secretary\nUrbana, Illinois\nJune 1, 1939\nCHECK YOUR STANAIMS IS NAEB\nThe July 1st Issue of the News Letter will carry a full accounting\nof NAEB membership to date. Including those who have andnth„f!!bePBhlos\nM not contributed their annual dues,, We repeat; re8\nhave gone to the University Broadcasting Council, the Chloago fh d-o\nCounoll of the Board of Eduoatlon, Indiana University, and the\nMunicipal Broadcasting System (WYNC) of New York City,\nThe next News Letter will also contain the tentative program for the\nfall meeting In Ames, Have you made your plans to be In Ames on\nSeptember 1 and 2? You're trailing If you have overlooked these dates,\nwhat HAVE YOU BONE THAT IS WORTHWHILE\nSitting here In the sweltering heat of Urbana-Champalgn wondering\nwhat NAEB member stations have done in worthwhile educational broa\ncasting, doesn't help me or other NAEB members. What we should do\nmore is pass along the Information that may be an incentive or guide\nfor others*\nWhy not sit down right now, Jet down a few notes of things »°®°™p^ahed'!\nthings that went flat, and hopes for the future, send them along to\nthe Exec \"so and 1st others learn of your doings? A suggestion -\ncertain portions of your annual report might be Just the thlngo\nCHIP AGO RADIO COUNCIL PLANS F.*A4U PROGRAMS\nThe offioe of the Radio Council of the Chicago Public Schools has\nIssued a tentative schedule of Radio programs for the fall semester*\nEleven radio stations are cooperating in the presentation or ]jna\nprogramso Harold Wc Kant Is Director of the Radio Gounoll and will\nwelcome NAEB members whenever In Chicagoo\nGOINGS-ON AT W H A\nWHA8 s application for the 070 Ko* dear-channel has been scheduled\nfor hearing on July 31 before the r„0.C. Legislation to enable the\ncase to be carried on and to finance operation of the station Is\npending In the Wisconsin Legislature,,\n® • * *\nThe Congressional Forum is a new WHA program in\nRepresentatives and Senators participate* Boreas\nmessages in Washington and forward them to Madison by alr-exprea\nOne congressman is heard each day8 to make up a two-week schedule*"
}