{
  "id": "d1297-1",
  "text": "- 2 -\nCALIFORNIA’S UNIVERSITY EXPLORER ON NET^TORK\nHale Sparks, the University of California’s ’’University Explorer”, on a program\nby that name, is on CBS each Sunday evening and is heard by an international\naudience. Tore than 300 letters a week are received on the program.\nEight campuses of the University are ’’explored” via the microphone to acquaint\nlisteners with the varied activities of the institution.\n\"m-Ty EXPANDS -\nLHA-Fr, which recently received the equipment necessary to bring it up to its\nallotted 3 kw. power, has increased its operating schedule from six to seven and\none-half hours daily.\nListener reports indicate that the station can be heard beyond the fifty-mile\nrange expected of it. One response came from 135 miles and many come from beyond the\nfifty-mile circle.\n’HAD, the transmitter to serve Southeastern ’\"isconsin, is expected to be in\noperation this summer.\nTHE TALENT TARKET\nFrom time to time members need new staff workers or know of trained young\npeople vdio want radio employment. It has been suggested that the ^ S-LET'HCR serve\nas a clearing house for such matters. So-it will do that when information is\nsent.\nAVAILABLE! 1 Announcer (male) 2 Continuity writers (female)^\nAll are graduates of University of South Dakota v/ith majors\nin Radio-Speech. ?vailable June 1947. For information write to\nIrving Tlerrill, Hgr. KUSD, Vermillion, South Dakota.\nHITS AND HISSES\nA new target for the \"industry”l Proposals are before the FCC for facilities^^\nwith which to take advertising-free programs to subscribers to the ’’baffle service”,\nfi. ’’clarifier” would be required for use by the subscriber to give undisturbed re¬\nception. Perhaps listeners are willing to pay for radio as-they-like-it.\nTHIN-SKIN DEPARTIlENTs NAB, piqued by the criticism of radio at the Ohio\nInstitute, is said to be contemplating a meeting of its own to v/hich invitations\nwould bring \"top-critics\" to discuss \"only a few specific subjects\".\n”I do not agree that there is a plot against radio; it is simply a growing\npublic protesting against pablum”. ..Arch Oboler, (Variety 5/28/’47)\nSpeaking of the obstacles in financing the \"Voice of America\" broadcasts\nfrom this country, BROADCASTING (6/2/*47) editorializes! \"Private enterprise\ncould do it tvirice as well for half as much\". Domestic radio could be Exhibit A\nfor the defenses\n\"I am sincerely convinced that radio can be and must become a great instrument\nin the promotion of good government\".\n......Gov. George T. Ilickelson of South Dakota at KUSD's 25th\nAnniversary."
}