{
  "id": "d1297-4",
  "text": "INSTITUTION\nADDRESS\nDIRECTOR\nCALL\nREGION V -• John W. Dunn, MAD\nKFKU University of Kansas\nKOAG-FII Oklahoma A & M\nV/LSU^FM Louisiana State University\nWNAD Oklahoma University\n(assoc.) Rocky Mt. Radio Council\nLawrence 5 Kan.\nStillwaterj Okla,\nBaton Rouge, La.\nNorman, Okla.\nDenver, Colorado\nHarold G. Ingham\nH, H. Leake\nRalph Steetle\nJohn \\7. Dunn\nAllan Miller\nREGION VI — James Morris, KOAC\nIC'^SC State College of '''■ashington\nKUSC-FM University of South. Calif.\nKOAC Oregon State College\n(ASSOC.) University of California\nPullman, Mash. ' Fred Hayward\nLos Angeles, Calif Mm. H, Sener —'\nCorvallis, Ore.. James Morris —\nBerkeley, Calif. Hale Sparks —“\nME?fflERSHIP APPLICATIONS\nThe NAEB constitution provides that applicants \"may be elected to membership\nin this organization by approval of the Executive Committee, and a two-thirds\naffirmative vote of all active members of the Association\". This publication\nconstitutes notice to the Executive Committee and all members of the pending\napplications. Unless negative votes are received within thirty days of publication\nmembers will be considered as having voted in the affirmative and membership will\nbe granted to the applicant.\nActive Membership iloolications\nUniversity of Alabama, University, Alabama Graydon Ausmus\nAssociate Membership Applications\nU.S. Office of Education, Washington, D.C. Dr. Franklin Dunham\nAlabama College for Women, Montevallo, Ala. Miss Maryland Wilson\nUNIVERSITY OF ALABAMA has a construction permit for an\neducational FM station and is waiting to get it on the air. The\ninstitution sums up a total of 2835 minutes of programs on the air on\nseveral commercial PM stations in the year 1946-4?. These included such\nprograms as; Alabama Round Table, Your Family Is Your Fortune, Life and\nHealth, This Is Your University, And Now-A Story, Little Concerts, and\nnumerous special events originations.\nFuture plans embody the extension of the radio service to all parts\nof the state. The scope of programs is to be broadened to bring in more\nUniversity departments, to expand the exploration by radio of the state*s'**^\naccomplishments, history, folklore, scenic beauty and to appraise its\nsocial, cultured, and economic potentialities,\nGraydon Ausmus, who attended the Columbus meeting, as director of\nthe broadcasting service is guided by a radio advisory committee of\nthree deans.\nALABAMA COLLEGE applied for associate membership many months ago,\nbut through error the application was inadvertently \"filed\". Thanks to the\npatience of Miss Wilson, the matter vms finally straightened out. The\ncollege is part-owner of MAPI (leased and operated commercially) and\nprovides numerous programs for that station by transcription. Miss Wilson,\ntoo, was at the Columbus NiVEB meeting."
}