{
  "id": "d656-121",
  "text": "(S. Il60 Hearing, Witness List* continued)\nThursday, April 13, 1967\nEverett N. Case, Chairman of the Board of Directors, National Educational Tele¬\nvision, 10 Columbus Circle, New York, N.Y. 10019* and President of the Alfred\nP. Sloan Foundation, New York City\nJohn F. White, President, National Educational Television, and member of its\nBoard of Directors, 10 Columbus Circle, New York, N. Y. 10019\nE. William Henry, Director of the National Association of Educational Broadcasters\nand former Chairman of the Federal Communications Commission, Arnold & Porter,\n1229 Nineteenth Street, N. W., Washington, D. C.\nEdwin G. Burrows, Manager of WU0M Radio, University of Michigan, Administration\nBuilding, Ann Arbor, Michigan, 48104, and Chairman of the Board, National\nAssociation of Educational Broadcasters\nJack G. McBride, Manager of KU0N, Lincoln, Nebraska, head of Nebraska Educational\nTelevision Network, and Chairman of the Board of Educational Television Stations\nDivision of NAEB, University of Nebraska, 12th & R Streets, Lincoln, Neb. 605O0\nNewton N. Minow, member of the Board of the Chicago Educational Television\nAssociation, former Chairman of the Federal Communications Commission,\nmember of the Board of NET; Leibman, Williams, Bennett, Baird and Minow,\n208 South La Salle Street, Chicago, Illinois 60604\nDevereux Josephs, Chairman of the Board, WNDT, 51 Madison Avenue, New York\nCity 10010\nC. Scott Fletcher, member of the Board of NAEB, member of the Board of the Miami\nEducation Television, WTVS; and Executive Consultant of Educational Television\nStations, 1346 Connecticut Avenue, N. W., Washington, D.C. 20036\nFriday, April l4, 1967\nDr. George Bair, Chairman of the Board, Instruction Division, NAEB; Director of\nEducation, South Carolina Educational Television Commission, 2712 Millwood\nAvenue, Columbia, South Carolina 29205\nJerrolG Sandler, Executive Director of National Educational Radio Division of\nNAEB, 1346 Connecticut Avenue, N. W., Washington, D. C. 20036\nDr. Fred Harrington, President of the University of Wisconsin and a Director\nof NAEB, Madison, Wisconsin\n* Not necessarily in order of appearance.\nPage 2"
}