{
  "id": "d656-124",
  "text": "MEMORANDUM\nTo: Executive Staff April 3, 1967\nETS Staff\nFrom: Chuck Marquis\nHere is the current status of NAEB witnesses and the general outline of their\ntestimony:\nThursday, April 13 (following National Educational Television’s Everett Case^-\nand Jack Whit^approximately 11:00 a.m. NAEB Board Chairman,\nEdwiiTBurrofogsy WUOM, gives general background of NAEB, names\ngroups of witnesses and that they will all support S. 1160 without change.\nGives bri^f-g-ener<TT\"slabeK^ent in support of S. 1160. Introduces next\nwitness,Cjh__W.illiam Henry.^ Henry, Public Director of NAEB and former\nChairman of FCC, will describe why he supports bill, and that it does not\nthreaten freedom of broadcasting. At ajipr^>xima4ejsy 1:30 p. m. testimony\nresumes with ETS panel. Chaired by j£ack McBride,JETS Board Chairman\nand KUON, Lincoln, Nebraska and Nebraska ET\\T\"Network. McBride\nanalyzes bill re ETV stations, citing successMJwstorjTbfH^V Facilities\nAct, what bill means to stations. Introduces(Newton Minnoy^ member of\nBoard of WTTW, WXXW, Chicago and NET ancT former uTiairman of FCC\nwhen ETV Facilities Act was passed. Minnow cites why act wiJJUxelp_iiis\n^stations, NET, and the entire U.S. McBride then intro due e/Devereux\nJoseph^), former Chairman of Board of WNDT, New York. Speaking as\narbusinessman and citizen. McBride then introduces C. Scott Fletcher,\nNAEB Public Director, ETS Executive Consultant, member of the Board\nof the two Miami school-owned ETV stations, former President, NET,\netc., and instigator of the Carnegie Commission. Emphasis would be on\nsupport of the Commission by the original ETS Ralph Lowell Committee,\nand the previous 1964 Conference which mandated this action and the\n1967 Conference which followed it up, and which was attended by the\ngoverning board members of the stations as well as the managers and\nin general how the Conference responded to the bill, etc. (We assume\nthis will last through 4:30 p. m. , April 13th).\nFriday, April 14 - 10:00 a.m. NAEB Instructional Division witness, George Bair,\nChairman of the Instructional Division and Director of Education for the\nSouth Carolina ETV Network and additional witnesses. They will speak to\nthe fact that instructional uses of television are relevant to all three titles\nof the bill and that the world of instruction believes this bill will be ex¬\ntremely constructive. (It is assumed this will last until noon. )\nFriday, April 14 - 1:30 p.m. National Educational Radio, division of NAEB\nwitnesses, Jerry Sandler will Chair the panel representing particularly\nthe National Educational Radio Network./Tie will speak td^a dip’s support\nof all phases of the bill. With him will beUUesTfcg, PaffraHx/ Head of the\nJohnson Foundation which has long supportecT^ducational radio and\nsponsored the Wingspread Conference last year, a parallel Conference\nand effort to the ETS Conferences and the Carnegie report. Additional"
}