{
  "id": "d656-135",
  "text": "*- ■*• •*• / and lj-15 aji beginning ca 0:13 p.m. in ouimcss uicaue. juit: i-Jiuai lwo\nprograms in the 1966-67 Forensics Forum schedule will be conducted in April. An evening\nof oral interpretation will be held April 12 and a Hyde Park Forum, featuring talks on a\nvariety of subjects, will be April 26. Both are at 7:30 p.m. in the River Valley Room\nof the University Center.\nAmong other April events are: one man exhibit of paintings by William Landwehr,\ngraduate teaching assistant in art, Chester Fritz Library art gallery, Monday (April 3)\nthrough April 14; Military Ball, 8 p.m., Friday (April 7); recognition dinner for\nGraduate School Dean and Mrs. C. J. Hamre, State Ballroom and Dakota Lounge, University\nCenter, 6:30 p.m., April 10, and Film Club Series presentations, Education Building\nauditorium, 8 p.m., April 21 and 29.\n^yujr\\XlK SB u iSZZZT j ; 1 h 7\nU PLANS SESSION FOR HOSPITAL, NURSING HOME HEADS\nGRAND FORKS, N. D. -- The eighth annual School for Hospital and Nursing Home\nAdministrators is scheduled April 12-13 at the University of North Dakota. The school\nis being jointly sponsored by the North Dakota Hospital Association, the UND General\nExtension Division and the College of Business and Public Administration.\nSessions at the University Center will be conducted by members of the UND\nfaculty who are trained in the fields of management and human relations. Modern\nmanagement techniques will be the special concern of the two-day school. \"Buzz sessions\"\nhave been included on the program to enable administrators and their representatives\nto discuss mutual problems.\nRegistration will be held in the University Center Fireside Lounge at\n8:15 a.m. April 12. Fees are $10 for the first registration from an institution and\n$7.50 for each succeeding one from the same institution. Information about hotel and\nmotel accommodations may be obtained from Harvey C» Hanson, executive director. North\nDakota Hospital Association, Grand Forks. Program brochures and pre-registration\nforms are available through the University General Extension Division.\n-UND-\nU STUDIES ROLE OF EDUCATIONAL RADIO, TV\nGRAND FORKS, N. D. -- A recent Ford Foundation grant of $38,000 to National\nEducational Radio, a division of the National Association of Educational Broadcasters,\nfor a comprehensive study of the status and needs of educational radio in the United\nStates is expected to provide beneficial effects for local educational radio stations\nsuch as the University of North Dakota's broadcasting service, KFJM.\n\"This grant is a recognition that educational radio needs developing,\" said\nMyron Curry, director of KFJM and closed circuit television at UND. \"For KFJM and other\neducational radio services, the findings of the survey can assist in development of\npatterns and goals. We will have data available which has never been available before.\"\n(continued)"
}