{
  "id": "d656-72",
  "text": "2\nand talent in presentation of even the best ideas. For instance, very many\nstate and local PTA groups have been among the numerous beneficiaries of the\npublic-service requirement in the licensing of commercial radio and television\nstations. We have found station managers generous with their allocations with¬\nin desirable time schedules. People knowledgeable in the matters at issue are\nused, but there is not available for us, or any other such groups, the sort of\nassistance necessary to bring about a really effective presentation. While\nsuch efforts have often enjoyed a mild sucqess, their audience tends to be\nlimited to those already knowledgeable and interested. The discussion format\nis generally used as most lively for the least money, in which it is almost\naccidental if the most important points are made, and made in such a way that\nthe various sides of an issue are clear to the listener.\nIt seems to us that the presentation of issues central to our society,, the\nwelfare of our families, and of children, in such a way that thoughtful con¬\nsideration is aroused in the viewer, or that new ideas enter into the minds of\nthe viewers to enrich their lives, warrants dedication of resources comparable\nto those commonly lavished on programs designed only to entertain and pass the\ntime.\nWe have therefore welcomed the recent proposals to increase the available re¬\nsources for educational television. We most warmly support Senate ll60 and its\nproposals to improve facilities and program resources for both educational\ntelevision and educational radio. We feel it is important that educational: radio\nbe included in this measure, for its ability to accomplish so much public ser¬\nvice at low cost, its facility for live coverage, and its potential for sub¬\nstituting the imagination of the listener for elaborate productions.\nWe very warmly approve the declaration of policy that encouragement of noncom¬\nmercial educational radio and television broadcasting, including their instruc¬\ntional use, is in the public interest; that their expansion and development\ndepend on both local and national freedom, imagination, and initiative, but\nare also of appropriate concern to the federal government. We approve the\nprovisions for the \"Corporation for Public Television\" and its purposes. We\nnote and approve that, coordinate with the studies to be undertaken by the\nCorporation, the President has directed the Administrator of the National\nAeronautics and Space Administration to conduct experiments on the require¬\nments for a communications satellites system.\nIt is our view that these opportunities should not be lost to secure for edu¬\ncational noncommercial television and radio the advantages of advancing tech¬\nnology, including interconnections through the means of communications\nsatellites. We would suggest further, that the financing of improved facili¬\nties and programs not be limited to one or two or three methods. We would\nrecommend the consideration for the future not only of appropriated funds but\nof earmarked taxes upon receivers, a tax on commercial station licenses, the\nproposed share of savings from the use of communications satellites, and the\nacceptance of private funds.\nWe would express a concern that (l) the present pioneers of so much that is\npromising in educational television and radio be fully utilized in plans and"
}