{
  "id": "d656-75",
  "text": "NATIONAL CONGRESS OF PARENTS AND TEACHERS\n700 North Rush Street, Chicago, Illinois 60611\nNATIONAL EDUCATIONAL RADIO\nConference on Educational Radio as a National Resource\nRacine, Wisconsin, September 26-28, 1966\nReport of the National PTA Representative, Milton R. Litterst\nThe conference on Educational Radio as a National Resource, in Racine, Wis¬\nconsin, September 26-28, was sponsored by National Educational Radio, a di¬\nvision of the National Association of Educational Broadcasters, in coopera¬\ntion with the Johnson Foundation. It was attended by 70 key individuals\nfrom government, industry, education, and the arts.\nThe purpose of the conference was to define and mobilize the unique resources\nand potential of educational radio in order (l) to preserve and foster the\nideals of American education; (2) to provide the American people with infor¬\nmation, instruction, and cultural enrichment in a manner and to a degree never\nbefore attempted; and (3) to further the cause of international understanding.\nE. G. Burrows, manager of Station WUOM, University of Michigan, and chairman\nof the board of directors of National Educational Radio, was chairman of the\nconference. The meeting place in Racine ttas \"Wingspread,11 headquarters of\nthe Johnson Foundation, which was designed by Frank Lloyd Wright.\nLeslie Paffrath, president of the Johnson Foundation, extended a warm wel¬\ncome to those in attendance and explained that \"Wingspread\" was more than a\nunique building, it was in reality a center that had dedicated its resources\nto developing a wide variety of cultural and educational programs devoted\nto the exploration of all phases of the special, creative spirit of man.\nWingspread,\" he said, is an idea--a belief that man the individual is im¬\nportant and that the potentialities inherent in his mind and spirit must be\nencouraged to develop; and the building is intended to serve as a place where\nmen can exercise their creative and intellectual powers to their fullest.\nCharles A. Siepmann, professor of communications at New York University and\nauthor of many books and publications pertaining to educational radio broad¬\ncasting, was the keynote speaker. Several of his provocative statements\nwere as follows:\n—Man has never communicated less significantly than he does today.\n— Facts taken by themselves are an alibi for thinking, and they can become\nthe steam that obscures the mirror of truth.\nEducation must be played in a new key, since much of education, in the\nbroad sense, is outdated and antiquated.\n—Education today must be provided from the cradle to the grave and must\nbecome a way of life.\nEducation should involve all the agencies of the community, and it should\nbe of and for the community."
}