{
  "id": "d656-87",
  "text": "April 5, 1967\nThe Honorable Bob Sikes .n\nRoom 1112\nHouse Office Building\nWashington, D.C.\nDear Mr. Sikest\nRepresentative Harfcey Staggers of West Virginia has introduced a bill\n(H.R. 6736), The Public Television Act of 1967, to the House of Representa¬\ntives. This bill was given support by Claude Pepper of Florida (H.R. 6845)\nand Torbert MacDonald (H.R. 7670) of Massachusetts. The proposed legislation,\nin accord with the recommendations of President Johnson, calls for increased\naid to educational television and for the first time, provides for financial\nsupport for non-commercial radio.\nThose of us who have worked in educational radio for many years are\naware of the significant role it has to play in education. We have found\nthat radio can be used as effectively, and in some cases more so, to teach\nmany things. Not least important, it is far less expensive and perhaps this\nis the reason that more attention has not &een given to its support and devel¬\nopment. Throughout the country radio is being used in the education of public\nschool children, university students, and for the continuing education of\nadults in the community. Its effectiveness has been demonstrated over and\nover again. Here in Florida a plan is being considered for a state-wide radio\nnetwork to be made possible by placing an educational radiosstation at each of\nthe twenty-six junior colleges. Other services to the people of Florida in¬\nclude the distribution of program materials by our own station, WFSU-FM, to\ncommercial stations throughout the state for public service broadcast.\nPublic recognition of its potential as well as financial support are\nneeded if radio is to reach its full potential as an instrument of education.\nIt therefore is important that radio be given equal status with television\nin the forthcoming legislation. A Public Broadcasting Act, rather than one\nfor television with radio riding along would help to accomplish this.\nI hope you will keep this in mind and support the full inclusion of radio\nin all titles of the propped bill. Mr. Jerrold Sandler, Executive Director of\nNational Educational Radio, 1346 Connecticut Avenue, NW#in Washington, will be\nsending background materials for your use. If you have any further questions\neither of us will be happy to discuss them with you.\nSincerely yours.\n(Mrs.) Marjorie Newman\nProgram Director, WFSU-FM"
}