{
  "id": "d938-2",
  "text": "Ill\nMASTER PIERRE PATELIN\nStory of the Television Play\nIn a small French village in 1450, more or less, Pierre\nPatelin, a lawyer by profession but a rascal by nature, decides\nto increase his threadbare wardrobe by wheedling cloth from the\ndraper, Jacques Beaumarchand. Leaving his cottage with his\nwife’s blessing, he approaches the draper’s shop. The Draper,\na cautious merchant who gives no credit and cheats when the op¬\nportunity arises, is completely taken by Pierre’s maudlin\nflattery of his (the draper’s) deceased father. On the strength\nof a promise to pay when the draper calls to eat goose and drink\nwine, Pierre leaves the shop with the cloth under his arm.\nAt his cottage, he is greeted by his wife, Guillemette,\nwho connives with Pierre to deceive the draper by claiming that\nhe, Pierre, has been ill in his bed for three months. A few\nmoments later, the draper arrives to find the lawyer in bed and\nGuillemette in tears. Jacques’ happy anticipation of goose and\nwine is turned to indignant frustration as he repeatedly demands\nthe money or the cloth. Finally, Jacques is convinced that he\nis suffering from a faulty memory. Dazed, he leaves the cottage\nof Pierre.\nPierre and Guillemette are interrupted in their revelry\nby a shepherd who requires the lawyer’s assistance in meeting\nthe court charge of his employer who has caught him stealing\nand slaughtering the sheep. Pierre plans to win the case\nthrough trickery. He sends the shepherd to the court. Later,\nPierre follows to discover that Jacques Beaumarchand, the draper,\nis the plaintiff in the shepherd’s case. Pierre manages to con¬\nceal the truth from the stupid and bombastic judge. The judge\nrefuses to listen to the draper who confuses his loss of the\ncloth with the loss of the sheep. The judge releases the shep¬\nherd and strides from the court. The draper leaves and Pierre\nturns to the shepherd for his fee only to find that he is re¬\nsorting to the same evasive method to avoid paying Pierre’s fee."
}