{
  "id": "d1142-3",
  "text": "will be telecast to grades kindergarten\nthrough eight. High school students receive\ndriver education and guidance and health\ninstruction. Mathematics and other sub¬\njects will be added 'later.\nSTATE AND REGIONAL\n^ Georgia’s four ETV stations became an\ninterconnected network on September 13,\nwith programs emanating from 881 Peach¬\ntree St., N.E., Atlanta. The four stations\nare WGTV, Athens; WXGA-TV, Way-\ncross; WVAN-TV, Pembroke; and WJSP-\nTV, Warm Springs. By the beginning of\nthe 1966 school year, five new stations will\nbe linked into the network to provide state¬\nwide coverage. The current four stations\nreach an estimated 650 schools with about\n700,000 students.\n^ The State University of New York has\nbegun the first phase of its ETV network\nwith the broadcast of three noncredit pro¬\ngrams this fall. In the spring semester, four\ncourses carrying college credit are planned.\nThis is the first phase of the state-wide\nnetwork the university plans to establish\nwithin ten years.\nGENERAL\n^ KTCA-TV, St. Paul, will embark this\nfall on a major development plan costing\nover a million and a half dollars. Plans in¬\nclude establishment of full color origination\nstudios, a taller transmission tower, in¬\ncreased power for KTCI-TV—its sister sta¬\ntion which went on the air this summer—\naddition of more broadcasting channels in\nthe St. Paul-Minneapolis area, installation\nof extensive control equipment to facilitate\nmulti-channel scheduling flexibility, doub¬\nling of network interconnection facilities be¬\ntween KTCA-TV and its companion sta¬\ntions locally and ETV stations in Duluth,\nwest central Minnesota, and other antici¬\npated stations.\n^ Radio and television have joined with\ngeneral communication and public address to\nform a new communications area in the\nspeech department at Ohio State University.\nProposed major curriculum changes will\nprovide both the undergraduate and gradu¬\nate student with broader practical and theo¬\nretical study of al'l forms of communica¬\ntion. Keith Brooks was appointed director\nof the new area.\n^ KUED, University of Utah, used a re¬\nmodeled 1961 Volkswagen bus as a remote\nunit for taping programs in an old mill\nsouth of Salt Lake City. Staffers were\npleased, felt that the bus could be used un¬\nder conditions where larger remote units\nwould be prohibited.\n^ “Channel 48 Can’t Run on Credit\nCards!” is the headline on an editorial urg¬\ning viewer support of WCET, Cincinnati.\nThe editorial appeared in the station’s Sep-\ntember-October program guide.\n^ KWSC-TV, Washington State Univer¬\nsity, has ordered three new RCA studio\ncameras and a second Ampex videotape re¬\ncorder; these will be installed by January\n1. Existing Dumont cameras will be placed\nin a van for remote work on campus. The\nstation began its fourth year of broadcasting\non September 28.\n^ WETA, Washington, D.C., in its Oc¬\ntober program guide, expresses appreciation\nto Howard University for its generous co¬\noperation in providing a building to house\na major part of the WETA television oper¬\nation.\n^ Wisconsin’s State Radio Council has\nreceived a CP for installation of a new\nlOkw amplifier for WHA-FM, permitting\nthe station to more than triple its transmit¬\nter power output. To be completed by De¬\ncember 1, the change will give WHA-FM\na 50-microvolt service range of about 90\nmiles instead of the present 70 miles.\n^ WOSU-TV and WOSU received a cer¬\ntificate of recognition from the Ohio high¬\nway safety department recently—for out¬\nstanding personal service rendered to traf¬\nfic safety through participation in the 1965\nvehicle safety-check program.\n^ Regents of New Mexico State Univer¬\nsity have received a CP for an educational\nFM station, 740 watts.\n^ KCUR-FM is moving to new quarters\non the University of Missouri at Kansas\nCity campus, and at the same time the sta¬\ntion is applying for authorization to increase\nits effective radiated power from 365 watts\nto 40,000 watts.\n^ A group of 16 foreign broadcasters\nspent the month of October at Syracuse\nUniversity participating in the fifth annual\nInternational Broadcast Seminar sponsored\nby the U. S. State Department and admin¬\nistered by the TV-radio center of the uni¬\nversity.\n^ KRMA-TV, Denver, received the 1964-\n65 media award from the Denver Bar As¬\nsociation for its program about the law,\nWe the People. Jerry Karsh produced the\nprogram.\n^ Schenectady hosted the fall conference\nof the New York State Educational Radio\nand TV Association October 13-15. James\nA. Fellows, assistant to the NAEB presi¬\ndent, gave the keynote address.\n^ As of November 1, about 90% of the\nmusic programs of KANU, University of\nKansas, will be in stereo. KANU was the\nfirst educational station in the country to\nbroadcast by means of FM multiplex stereo\n—on December 17, 1961.\n^ On the evening of October 16, Nord-\ndeutscher Rundfunk at Hamburg, Ger¬\nmany, broadcast to its viewers programs\nthat were broadcast to WQED, Pittsburgh,\nviewers on October 5. Programs included\ntwo produced by WQED—“Practical Poli¬\ntics” and a history of the station, and oth¬\ners such as NET’s “Norman Thomas” and\n“Roomful of Music,” and EEN’s “Kolta-\nnowski on Chess.” All regular station-break\nannouncements were included, and a five-\nminute statement by NET’s Basil Thornton\ncompleted the program.\nPLACEMENT\nPOSITIONS AVAILABLE\n(For information, write Miss Yasmine Mirza, Placement Service, at\nthe NAEB in Washington. In order to be considered through these\nchannels, the reader must be an Individual Member of the NAEB,\nwith credentials on file with the NAEB Placement Service. Non-mem¬\nbers can save time by sending the $10 annual dues and $10 Place¬\nment registration fee at the time of inquiry.)\nNov I September I (1966) opening in eastern city university for assistant to asso¬\nciate professor with Ph.D. to teach radio and TV courses and a basic speech\ncourse. Possibly some TV production. Commercial experience helpful. Salary\n$9,000 to $13,000 depending on qualifications.\nNov 2 Classroom teacher in area of broadcasting and mass communication. Produc¬\ntion minimal at present; there are plans for growth and development of\nacademic program. Would share broadcasting courses with one other person\nin area, and teach other basic speech courses in department dependent upon\ninclination and training. General speech background preferred; M.A. neces¬\nsary. Must have imagination, ambition, and ability to work with others. Salary\n$6,000 to $7,500.\nNov 3 Man or woman with Ph.D. or Ed.D. to work with institutions of higher learn¬\ning of a state, advising and guiding on uses of TV for instruction. Civil\nService exam required. At least two years of higher institutional experience\nnecessary. Starting salary $10,640 with guaranteed annual increments in ex¬\ncess of $400. Guaranteed vacation, sick leave, and personal leave time.\nNov 4 Middle Atlantic independent liberal arts college has opening for person with\nbroadcasting experience, preferably in news and public affairs. Would con¬\nduct systematic study of current commercial and educational broadcasting\nand assist in creative audiovisual work.\nNov 5 Producer-director for large ETV station in Southeast. Applicants should have\nat least four years of college work with major in broadcasting or its equiv¬\nalent and at least one year of experience in TV or film production. Starting\nsalary $5,500.\nNov 6 Major Midwest ETV network wants experienced chief engineer who is creative\nand flexible. Adaptability to change and ability to give assistance and ad¬\nvice to existing 'ETV stations necessary. Position involves planning additional\nstations and interconnection; some travel. Salary in five figures.\nNov 7 Large Northeastern ETV station seeks creative experienced producer-director.\nMust be capable of handling major project work. Experienced applicants only;\nright experience a factor. Excellent opportunity. Equal opportunity employer.\nSalary $8,000.\n4\nNEWSLETTER"
}