{
  "id": "d1339-2",
  "text": "PLACEMENT\nPERSONNEL AVAILABLE\n(For information, write Miss Julie Hunt, Placement Service,\nat the NAEB office in Washington.)\nJanuary I—Production manager, 27-year-old male, with 7 years\nof educational TV experience wishes to be located with\na TV station or production unit that is part of or near\na college or university. Majored in TV and would like\nto work and finish education at the same time. Would\nlike to settle in the Southwest or Southeast, but will ac¬\ncept other offers. Salary $9,000. One year of commer¬\ncial TV experience and 2 years of commercial radio ex¬\nperience. Would also be interested in a P-D position\nworking with new teachers, which he has specialized in\nfor the last two years. Has ITV and community ETV work\nexperience.\nJanuary 2—Position wanted with educational station. Has ex¬\nperience as script writer, continuity writer, announcer,\nnewscaster, and audio producer and director. Married\nmale, 29. Holds B.A. in sociology and B.A. in radio and\nTV, both from Indiana University. Prefers salary $475 to\n$500 a month. Will consider any location.\nJanuary 3—Chief engineer of ETV station desires position with\nstation or network offering greater challenge and re¬\nsponsibility. Five years engineering experience in com¬\nmercial and educational television. Successfully planned\nand carried out extensive improvements in an expanding\nETV operation. Male, 23, married. Location open. Salary\nrange, $9,500-$12,000.\nPOSITIONS AVAILABLE\n(In order to be considered through these channels, the reader\nmust be an Individual Member of the NAEB, with credentials\non file with the NAEB Placement Service. Non-members can\nsave time by sending the $10 annual dues and $5 Placement\nregistration fee at the time of inquiry.)\nJan. I University ETV station in northeastern U. S. seeks tech¬\nnicians capable of operating TV control room equip¬\nment and doing necessary switching. Extensive training\nnot required; will be provided after employment. Salary\nopen, dependent upon background and experience. Open\nimmediately.\nJan. 2 Associate or full professor to serve as head of academic\nprogram in radio-television at major Midwestern univer¬\nsity. Will teach undergraduate and graduate level cours¬\nes, direct graduate study and research, exercise general\nsupervision over teaching staff and academic program\nand coordinate classroom work with station operation.\nPh.D. and college level teaching experience required.\nSalary open, depending upon training and experience.\nPositions Jan. 3, Jan. 4, and Jan. 5 are with a new communi¬\ncations arts department in the Southwest. Salary and\nrank are dependent upon degree and/or experience.\nJan. 3 Full-time engineer capable of maintaining and operat¬\ning a television studio containing equipment for educa¬\ntional and instructional television; also maintaining oper¬\nation on a school AM-FM radio transmitter. Applicant\nmust be able to maintain equipment without outside\ncontractual help. Require minimum of B.A. degree and\nexperience in either educational television broadcasting\nor equivalent professional broadcasting. This is a non-\nprofessorial position; member of staff. (For list of equip¬\nment mentioned above, contact NAEB Placement Serv¬\nice).\nJan. 4 Producer-director capable of working with university\nprofessors in formulating ITV program for on-campus use;\nalso necessary that he have background to accomplish\nimaginative cultural ETV programs for community con¬\nsumption. Full-time position. Should have some academic\nteaching experience in order to accomplish one or two\nthree-unit upper-division courses in production and di¬\nrection for students in communication arts department.\nJan. 5 Television and film writer capable of teaching senior\nyear and/or graduate level courses in creative writing\nfor television and film. Should have at least an M.A. or\nequivalent professional experience plus higher educa¬\ntional teaching experience.\n%\nAsian Broadcasting Union to Begin\nJuly, 1964, will see the inauguration of the Asian Broadcasting\nUnion, with headquarters in Tokyo. All broadcasting organi¬\nzations of national character in independent countries in Asia\nand the Pacific region are eligible for membership. Draft\nstatutes were studied at the Fifth Asian Broadcasters’ Con¬\nference in Seoul, Korea, last fall.\nSchedule Set for International Conference\nThe Japan Broadcasting Corporation will host the second in¬\nternational school broadcasting conference April 9 to 15, 1964,\nin Tokyo. The organizing committee met in Rome under the\nsponsorship of the European Broadcasting Union, to decide\nupon the schedule for the conference.\nInvitations were dispatched to 160 broadcasting organiza¬\ntions of 125 countries at the end of October. Working lan¬\nguages to be used will be English, French, and Japanese.\nProposed subjects for the sessions include the fundamental\npurposes of school broadcasting and the individual character¬\nistics of radio and television with special attention to audi¬\nence organization and assessment of results; essential re¬\nquirements for starting a school broadcasting service; assist¬\nance and information to developing countries with special at¬\ntention to the training of personnel; radio and TV in the\nfight against illiteracy and in fundamental instruction of\nadults; radio and TV in teaching history and geography for\npromotion of international understanding; teaching of science\nand mathematics through radio and TV; teaching languages\nthrough radio and TV; and correspondence courses in asso¬\nciation with radio and TV.\nUNESCO Seeks Candidates for Paris Positions\n1. Chief of radio and visual information, department of mass\ncommunication. Responsible for activities designed to pro¬\nmote knowledge of aims and activities of UNESCO and\nthe organizations of the U. N. system through radio broad¬\ncasting and visual information media of all forms. Qualifi¬\ncations and experience required: university degree or\nequivalent attainments; substantial professional experience\nin the field of radio and visual information as director of\nproduction or producer, and knowledge of radio and visual\ninformation organizations in countries with different cul¬\ntural traditions; administrative experience relevant to di¬\nrecting and supervising the work of a group of radio and\nvisual information producers and technicians of several\nnationalities; perfect knowledge: reading, writing and\nspeaking, of English or French and good working knowl¬\nedge of the other; familiarity with other languages an addi¬\ntional asset; knowledge and appreciation of the aims and\nactivities of the organizations of the U. N. system. Closing\ndate: February 15, 1964. Salary, $10,650 per annum.\n2. Chief of press division, department of mass communica¬\ntion. Under the general directives of the director of the\ndepartment, this person is responsible for planning and\nexecuting activities designed to promote knowledge of the\naims and achievements of UNESCO and the organizations\nof the U. N. system through news agencies, the daily and\nperiodical press and other publishing enterprises. Qualifi¬\ncations and experience required: university degree or\nequivalent attainments; substantial professional experience\nas a writer or editor in a news agency and/or newspaper\nor periodical, preferably also with a national or interna¬\ntional public information service; knowledge of the press\nin countries with different cultural traditions desirable;\nadministrative experience relevant to directing and super¬\nvising the work of a group of journalists and press officers\nof several nationalities; perfect knowledge: reading, writ¬\ning and speaking, of English or French and good working\nknowledge of the other; familiarity with other languages\nan additional asset; knowledge and appreciation of the\naims and activities of the organizations of the U. N. sys¬\ntem. Closing date: January 31, 1964. Salary: $10,650 per\nannum.\nBoth positions are two-year appointments.\nPersons interested in these positions should contact Mr.\nJohn Sauls, Office of International Administration, Room\n5321, Department of State, Washington, D.C. at the\nearliest possible date.\nNEWSLETTER"
}