{
  "id": "d1781-0",
  "text": "N-A-E-R NEWS LETTER\nNational Association of Educational Broadcasters\nMadison, Wisconsin — September 22, 1937\nCONVENTION REPORT ISSUE\nURBANA MEETING REFLECTS OPTIMISM FOR FUTURE\nThe Annual convention of the National Association of Educational Broadcasters,\nheld at the University of Illinois on September 13 and 14, indicated that members\nare more than ever convinced that their cause is right. Interpretations of\nrecent developments lent encouragement to all in planning for future growth.\nJos. F. Wright, Director of WILL, and his assistant, Frank Schooley, arranged\nprograms of immediate interest to educational broadcasters. A need felt in past\nyears was filled by providing two sessions dealing with the engineering aspects\nof radio.\nTREASURER BRACKETT COMPLETES LONG SERVICE\nB. B. Brackett of KUSD, for many years treasurer of the N-A-E-B, in a letter\nrequested that he be relieved of that office for the coming year. Poor health and\ndoctor’s orders for a rest have forced Mr. Brackett to reduce his activities. It\nwas with regret that the Association accepted his resignation. As one of the\nfounders of the organization, originally known as the Association of College and\nUniversity Broadcasting Stations, Mr. Brackett has always been an earnest and tire¬\nless worker for the cause of educational radio. The Association wishes him a\nspeedy recovery to good health.\nDELEGATES VISIT W-I-L-L AND CAMPUS\nMembers in attendance at the convention had the opportunity to see the Illinofe\ncampus in a bus tour. Stops were made at the WTLL studios and at the transmitter\nsite on the farms at the extreme southern end of the campus. Frank Schooley\nserved as guide on the tour and in his best announcing style called off the points\nof interest as the bus jogged along.\nThe WILL studios $re in a small building on the campus used entirely for radio.\nIt is beneath the oid antenna towers. The second floor consists of a music studio,\nan announcers booth, and an operators booth. The first floor includes a reception\nroom, central control room, and an adjacent studio. The new station house is very\nattractive and large enough to accommodate the more powerful transmitter now\nbeing sought. Over it rise the new 325 foot masts of the directional antenna\nsystem.\nNOW-A NEW SECRETARY-A NEW ADDRESS\nFrank Schooley, of V/ILL at the University of Illinois, Urbana, has been chosen\nto serve as executive secretaryJbr the coming year.' After this all notes for the\nnews-letter, and all material for the exchange packet are to be sent to him.\nIn this, the final news-letter by your former secretary, we want again to\nappeal to members for their cooperation in making these services possible.\nUnless everyone helps in the gathering of news and printed specimens the secretary\ncan do little. Make it a habit to contribute regularly.\n1937-38 is an opportunity year for educational broadcasters.\nDo we have our plans laid for making the most of it?"
}