{
  "id": "d1781-0",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n1346 Connecticut Avenue, N.W., Washington, D.C., 20036\nVolume V Number 7\nApril 30, 1964\nAPPY NAMED VICE PRESIDENT OF ETV STATION DIVISION: GUM APPOINTED TO BOARD\nGerard L. Appy, Associate Director of the Georgia Center for Continuing\nEducation at the University of Georgia, was named Vice President of the Educational\nTelevision Stations (ETS), the newly organized division of the NAEB representing the\nnation*s educational television stations.\nAnnouncement of the appointment was made April 15 hy C. Scott Fletcher, former\nhead of the Fund for Adult Education established by the Ford Foundation in 1951> who\nbecame head of the new ETS organization last month.\n\"Mr. Appy knows the problems and potentials of educational television from the\nground up as a result of his long experience in every facet of the medium. He is\nideally suited for our effort to strengthen and expand the entire movement,\" said\nMr. Fletcher.\nAt the same time, it was announced that Hartford N. Gunn, Jr., General Manager\nof the WGBH Educational Foundation, Cambridge, Massachusetts, had accepted an invitation\nto serve on the Board of Directors of the new ETS organization to replace Mr. Appy, who\nn resigned to take the executive post with the new NAEB division.\nFCC OUTLINES PROCEDURE FOR REDUCED AURAL POWER\nOn April 1, 1964, the Commission amended Section 73.682(a)(15) of the rules,\neffective May 11, 1964, to permit VHF television stations, as well as UHF television\nstations, to operate with an aural power between 10 and 1[0 per cent of the peak visual\nradiated power.\nAny television station desiring to permanently reduce its aural effective\nradiated power must file an application on FCC Form 3°1. The application should be\naccompanied by a full description of the exact means proposed to accomplish the change\nin power. After review of the application, it will be determined whether the proposed\nchange may be authorized by a mere modification of license or, because of modification\nof existing circuitry or elimination of certain transmitter stages, a construction\npermit will be issued*\nWhere a construction permit is issued authorizing the change, a license\napplication on FCC Form 302 to cover the construction permit must ultimately be filed.\nSuch license applications will noimally require new performance measurements, but only\non the aural portion of the station facilities.\nInformal requests for special temporary authority to operate with reduced\naural power will be considered where a station wants to experimentally determine the\nexact reduced aural power level best suited for its individual service area require-\nments. Such temporary authority will be limited to a maximum of 90 days, within which\nperiod it would be expected that the station will have determined at what power level\nit wishes to operate and will have filed an application for permanent operation on\n^ FCC Form 301."
}