{
  "id": "d1781-2",
  "text": "Monday Afternoon Session\n—President McCarty, presiding—\nPresident A. G, Crane, University of Wyoming, chairman of National Committee\non Education by Radio, outlined the origin, objectives, and work of his committee.\nIt does not advocate a government monopoly of radio, he said, but favors the\nownership of some facilities by non-profit agencies.\nDr Crane outlined a cooperative plan proposed for certain regions under which\neducational institutions and broadcasters would work together. A \"Council”\nwould be formed through the agencies and broadcasters would reserve certain\nperiods of time for the programs developed.\n\"There must be a place, and a provision made for state-owned, institutionally\nowned, school-owned, city-owned stations,\" declared Dr. Crane, explaining how\nthey would fit well into the plan he proposed.\n\"The Committee feels that the educational stations are rendering a pioneer\nservice. They must be preserved and their number multiplied. Our plan is likely\nto encourage their number to increase. The educational stations can furnish the\nessential leadership needed.\"\nS. Howard Evans. Secretary of the National committee on Education by Radio,\nreported on \"News From the Nation’s Capitol\". He called Senator White1 s resolu¬\ntion \"the most exact indictment ever made ofthe radio industry.\" The Interstate\nCommerce Committee of the Senate reported the resolution in for passage.\nIn the House, said Evans, the indictment is more general. With the Connery,\nWigglesworth, and Bacon resolutions pressing for investigations of various phases\nof radio, broadcasters have plenty to think about.\n\"Things are in such a condition in Washington as to indicate that there is\nneed for an explanation of radio’s activities\" said Evans. The admission by tho\nindustry1 s trade papers that a clean-up is expected is looked upon as an admission\nby the industry that a clean-up is needed.\nMonday Evening Session\n—President McCarty, presiding—\nEverett Mitchell, NBC, spoke on \"Announcing\". He reviewed the characteristics\nhe looks for in selecting announcers. \"Personality - that certain sparkld'is the\nfirst requirement, he explained. A boy must be able to fit into any kind of a\ngathering. He must be able to deal \"eye-to-eye\" with those whom he meets. He\nmust be neat.\nSpecialization, said Mitchell, is no longer required. He doesn’t want just\nsports announcers, classical announcers, etc. He wants men capable of taking all\nkinds of assignments and handling them well. College training is necessary. A\nknowledge of music, foreign languages, and psychology is sought. Mr. Mitchell\ngave a member of the audience an audition using the NBC script for trying out\nannouncers.\nElmo Scott Watson, writer for the Western Newspaper Union, and author of\nseveral well known radio shows talked on \"Continuity Writing\". Tho first funda¬\nmental, he says, is to forget about writing for the eye, and write for the ear.\nClear language, simple words, and short sentences are needed. Ho advocated reading\neverything aloud before including it in a finished script.\nGomer Bath, of WMBD, Peoria, spoke for Edgar Bill on \"Services on an\nEducational Station\". On his station, he said, all of the time from 6;00 to 10:30\nPM was sold, but still the station devoted from 10$ to 13$ of its tine to education\n17$ to civic service, and 7$ to religion. Ho mentioned police bulletins, weather-\nbureau pickups, interviews with visiting notables, and charity drives as examples\nof how a station can serve a community.\n\"Educational stations are in a position to experiment with programs and point\nthe way to other stations so they can serve better,\" concluded Mr. Bath."
}