{
  "id": "d1896-1",
  "text": "NAE8 NEWS LETTER-......\nLEAKE TO Q~P~A (cont^d)\nPage 2\nJuly I, 1942\nLeake leff early in June to assume his new duties with the government\nAGENCYo A PART OF HIS WORK WILL CONSIST OF TRAVELING ABOUT THE STATE\nTO SPEAK TO CIVIC CLUBS AND OTH|R ORGANIZATIONS TO EXPLAIN THE WORK\nOF THE OPA 0 On THE WHOLE LEAKE S NEW WORK WILL BE MAINLY IN PUBLIC\nRELATIONS- He WILL MAINTAIN HEADQUARTERS AT THE STATE OFFICE OF THE\nagency in Oklahoma City for the remainder of the summer months*\nThe production manager*s duties WITH WNAD are being handled during his\nabsence 8y Miss Betty Swidensky.\n“THE PROFILE: THAT WAS MCCARTY{j\nSoys, he deserves it. Wish we could send copies to all of you* The\nWisconsin State Journal of May 24 carried about a full page devoted\nTO THAT GUY McCARTY. THERE WAS HSS NAME AS THE AUTHOR OF ”ThE GuEST\nEditorial.” There was a career sketch by William L. Dounda, State\nJournal Radio Editor. There was Mac8s picture*\nTRANSCRIBED SERIES OFFERED BY SULZER\nThe University of Kentucky Radio Studios through its director, Elmer\nSULZER, has OFFERED TO SUPPLY A SERIES OF TWELVE 15-MINUTE TRANSCRIBED\nPROGRAMS ON SOCIAL DISEASES, ENTITLED “©UR H|q0£N ENEMY - VENERKAL\nDiseases.”\nThe series has two definite purposes in mind: (I) to acquaint the\nPUBLIC WITH THE DETECTION OF VENEREAL DISEASES, AND (gfr TO INDICATE\nTHE COURSE OF ACTION TO BE TAKEN WHEN THE DISEASES ARE DETECTED.\nSpeaker on the series will be Dr* Charles Baker, syphilologjst, of\nTHE COMBINED Lex 8NGTQN-FaVETTE CqUNTY PUBLIC HeaLTH CLINIC, LEXINGTON,\nKentucky. Elmer says the clinic has been adjudged by the United States\nPublic Health System as the finest health department in the United\nStates during the past four years.\nThe Committee has auditioned the first two programs in the series* Dr0\nBaker presents the subject matter interestingly and with good taste*\nSuggestions for the *2 programs are:\nI* The Venereal Disease Problem\n2* Early Syphilis\n3. The Importance of Undiagnosed Syphilis with Respect to the\nPublic Health\n4. Heart Disease - a Complication of UaTE Syphilis\n5o Syphilis of the Nervous System\n6* Premarital Examinations as Related to Venereal Disease Control"
}