{
  "id": "d1302-3",
  "text": "Walter Meives as cameraman, and George\nVukelich as writer. Senator Nelson indi¬\ncated the approval of the group after the\nshowing by leading a standing ovation for\nthose responsible for the program.\n^ KQED, San Francisco, opened the gate\nof communications between the opposing\nviewpoints of the Negro and the law en¬\nforcer recently in a program, “The Police,\nthe Negro, and Justice.” Negro Comedian\nDick Gregory and San Mateo Undersher¬\niff Wesley Pomeroy talked, and some spe¬\ncific suggestions for change in Negro-po¬\nlice relations emerged.\n^ WNDT, New York, recently produced\na series of programs to guide unemployed\nyoung people through the basic steps essen¬\ntial to finding and getting a job. When\nbroadcast by WMHT, Schenectady, “You\nCan Get a Job” was accompanied by a local\n“job window” informing viewers about lo¬\ncal job availabilities and counseling serv¬\nices.\n^ KUHF, Houston, is presenting Students\nEverywhere, which allows international stu¬\ndents to express their views on world af¬\nfairs, the United States, and their own\ncountries. Students also play music from\ntheir own countries. Co-producers are Clem¬\nent Die! from Nigeria and Luis DeL'lano\nfrom Mexico. The University of Houston\nhas a foreign student population of over\n700.\nGENERAL\n^ (A television workshop February 4 and\n5 at the Medical College of Georgia has\nbeen set up to assist medical agencies in¬\ncorporating CCTV into their training serv¬\nice. George Griffin, senior producer for\nGeorgia’s ETV network, will be a guest\nspeaker.\n^ During its fifth anniversary celebration\nin January, WRVR, New York, broadcast\na message from Governor Rockefeller and\ngreetings from other leaders in government,\neducation, the arts, and business. Rocke¬\nfeller said, “. . . You may be proud of your\nachievements and of the high cultural and\nintellectual standards of your programs. I\ntrust your plans for the years to come will\nbe successful. . . .”\n^ WMSB-TV, Michigan State University,\ndefines its audience on the back of its pro¬\ngram schedule: “Some people . . . would be\nashamed to take from mankind without giv¬\ning in return, or to hinder the progress of\nmankind through their ignorance, inade¬\nquacy or irresponsibility. . . . These are\nthe intended audience of WMSB.”\ny Wayne State University has received a\ncolor film camera chain, a TV film projec¬\ntor, and related equipment from the WWJ\nstations. The $25,000 gift will be used in\nCCTV, particularly in science and medical\ncourses.\n^ KRMA-TV, Denver, celebrated its tenth\nyear of telecasting on January 30.\n^ WEIQ-TV, Mobile, became an inter¬\nconnected station with the Alabama ETV\nnetwork in December. The 125 miles of\nmicrowave connections brings the network\ntotal to 508 microwave circuit miles.\n^ The Georgia ETV network has begun\nusing a remote videotape preview unit to\ndemonstrate what the network offers to\ngroups meeting around the state.\n^ Montana State University’s film and TV\ncenter has received a $220,000 grant from\nHEW to establish a videotape network\nconnecting the center and Montana hospi¬\ntals where student nurses are in training.\nDuring the five-year project, courses in\nmany subjects will be recorded at the cen¬\nter with tapes distributed among the hospi¬\ntals. Individual VTR units will be placed\nin each participating hospital.\n^ The school TV service of WNDT, New\nYork, has been reorganized to serve the\nsuburban school districts. In recent elec¬\ntions, Theophilo Vincent was chosen chair¬\nman of the curriculum committee and My¬\nron H. Turner chairman of the utilization\ncommittee. Vincent is assistant superintend- ^^\nent of the Plainedge schools and Turner is\nprincipal of Eatontown schools.\n^ Three stations have expanded Sunday\nprograming services. KVIE, Sacramento,\nand WFSU, Florida State University, have\ninitiated Sunday programing* and WTTW,\nChicago, has added four hours, during which\nit will repeat the best of current and past\ncultural programs. KVIE will offer NET\nspecials and repeats of the week’s best pro¬\ngrams, beginning at 4 p.m. WFSU will\nbroadcast from 1 to 8 p.m. WFSU is also\nbeginning a daily children’s pre-school pro¬\ngram at 5 p.m. Monday through Friday.\nPLACEMENT\nPOSITIONS AVAILABLE\n(For information, write Miss Yasmine Mirza, Placement Service, at\nthe NAEB in Washington. In order to be considered through these\nchannels, the reader must be an Individual Member of the NAEB,\nwith credentials on file with the NAEB Placement Service. Non-mem¬\nbers can save time by sending the $10 annual dues and $10 Place¬\nment registration fee at the time of inquiry.)\nFeb I Creative graphic artist for growing Midwestern state university. Applicant\nshould have designer-illustrator background with competent skills in paste-up,\nlayout, handlettering, and good academic background with degree from ac¬\ncredited university or recognized art school. Variety of assignments will include\nhot press operation.\nFeb 2 ETV producer-director for new, large 2500mc ETV operation with private\nschool system in large northeastern city. Filming experience preferred. Pre¬\nsents genuine challenge and opportunity to grow. Available now. Salary\n$8000-$10,000, depending on experience and qualifications.\nFeb 3 Producer-director at outstanding new ETV station. Calls for candidate of some\nexperience or particularly strong producing-directing talents. Salary commen¬\nsurate with ability and experience.\nFeb 4 Large northeastern ETV station seeks creative experienced producer-director.\nExcellent opportunity for right man; must be capable of handling major proj¬\nect work. Only experienced applicants will be considered. An equal oppor¬\ntunity employer. Salary open.\nPositions 5 through 7 are with a growing Midwestern university radio-\nTV division. Salary dependent upon experience.\nFeb 5 Two TV producer-directors experienced with broadcast and instructional pro¬\nduction. Summer openings.\nFeb 6 Four TV production assistants—half-time—able to function in any TV crew\nposition including assistant director, both in studio and on remote location.\nInterested in masters candidates. $50 per week; open in fall.\nFeb 7 One film (TV) director to produce and develop TV film and slides. Open\nsummer.\nFeb 8 Graphic artist familiar with all types of TV graphic techniques to work with\nmedia director and TV producer-director in planping and setting up complete\ngraphic arts studio for northeastern state university. Previous TV graphic ex¬\nperience desirable but not necessary. Salary $6,930-$9,270, depending on\nexperience and qualifications. Open April.\nFeb 9 Assistant professor of communications. Dual responsibilities include teaching\nand managing news and public affairs for TV station in northwestern state\nuniversity. Ph.D. in some phase of mass media desirable but not mandatory.\nSalary $9,000 (II months), negotiable on experience. Open September I.\nFeb 10 Producer of in-school programs for elementary school. Preparation and pro¬\nduction of 15-minute radio programs, newscasting, special program produc¬\ntion and announcing. Must be able to initiate ideas for program series and\npursue their development. Requires script writing and script editing. Liaison\nwork with teachers. Applicant should be able to type for rough copy work.\nRequires B.A. or M.A. in radio, speech, theater, or education. Previous full¬\ntime radio experience desirable. Salary $5700-$6000. University benefits.\nFeb 11 Personnel for in-school classroom-oriented production. Producer-directors, film\npersonnel and operating engineers (1st class license preferred, minimum 2nd\nclass). Oriented toward heavy classroom TV experience; experience with\nvideotape equipment and operation helpful. Midwest TV station. Salary open.\nFeb 12 Radio-TV engineer with 1st class license for major western university. Five\nyears experience in radio-TV studio operation and maintenance. Starting sal¬\nary $530 per month.\n4\nNEWSLETTER"
}