{
  "id": "d839-15",
  "text": "whose education has been studied more than any other primitive peoples.\nThe Hopi tend always to think of themselves as part of a group. They do not\nlike to compete. Teachers report that when they play basketball, they do not keep\nscore. Their ceremonies do not give important parts to individuals, but generally\nemphasize uniform participation by all. The Hopi feel close ties to their fellows\nand are reluctant to leave their villages to seek work or fortune. What are the\nways of this education that support these ideas and attitudes?\nA Hopi infant is constantly surrounded by many relatives, with whom he has\nclose ties. He can get from any of them the assistance or moral support he needs.\nHe therefore learns to live in a society of many people of all ages who treat him\nwith even friendliness. That is the first way.\nThere are few pressures on a Hopi child when he is an infant. He is fed at the\nbreast for a long while; he is not worried over getting dirty or about his toilet\nhabits. The adults around him are not making demands that he has difficulty to ful¬\nfill. That is the second.\nParents Not Angry\nThe Hopi child is scolded when he does something he shouldn't, but his parents\ndon't get angry. More particularly, if one person scolds him, somebody else will\ncomfort him. The parents are not set off apart as an old group, but there are\npeople of all intermediate ages living in close association with him. He is not\nseparated so strictly by generation lines. Even in many religious ceremonies, all\nages participate as equals to the best of their ability.\nWhen the Hopi boy or girl gets into greater mischief and must be punished,this\nis done by impersonators of the Katchina spirits. Therefore, it is not his friends\nand relatives who chastise. This gives him a sense that the spirits will harm him\nif he is naughty. It also keeps him from feeling any resentment toward those he\nloves. Indeed, they are apt to take his side against the spirits, so he feels that\nhe has their support. As often as not, the spirits will not only relent, and with¬\ndraw the threat, but will even give the child a present on the promise of good be¬\nhavior.\n18"
}