{
  "id": "d839-29",
  "text": "of Upper New York State. Every Iroquois belongs to a long-house. Such a house\nis the home of several units of the kind we call a family. The women in these\nlong houses are all related as mother and daughter or as sisters. The men that are\nmarried to them remain pretty much outsiders. The old mother is a sort of matri¬\narch, and has authority over the affairs of the long-house.\nThe long-houses are banded together—again through the women--to form clans.\nEach clan has a council, and here the men share the authority with the mothers w.rfl\nsisters over clan affairs. There are also tribes, that are governed by a council\nof clan heads.\nThe tribes are territorial units and have authority over a given area of land.\nBut the clans are family units — kinship groups. These units are not limited by\nland,and extend acress tribal boundaries. So a person who belongs to the Onondaga\ntribe, say, is also a member of the Snipe clan, and has ties of blood in neighbor¬\ning tribes. Because all the clans do this, everybody has allegiance to two sets\nof groups and is subject to two sets of authority.\nTribal Federation\nThe most interesting part of the Iroquois system of authority is the famous\nLeague of the Iroquois, a federation of the six tribes. Each tribe appointed\nsachems -- as they called their senators -- who met together to decide matters\nfor the whole group. The tribes agreed to give authority over affairs to a small\ngroup of men wham they appointed for the positions.\nI\nThese sachems really had authority only over inter-tribal relations. They de¬\ncided when to go to war and when to declare peace with their neighbors. They also\nmaintained peaceful relations among themselves. By means of this system the Iroquois\nwere a strong power in affairs before whites came and throughout the colonial period\nin America.\nNow, the Iroquois were aware that in giving authority they endangered inde¬\npendence. The several tribes did not want to forego their own sovereignty so they\nhad a rule that any decision of the council of sachems had to be unanimous. Since\nthe delegations voted by tribes, this meant that any tribe could prevent action.\n3^"
}