{
  "id": "d1413-0",
  "text": "DRAFT* Please suggest corrections in listing*\n„-V '-\nNAEB C01MITTEES AND MEMBERS\nAwards & Citations Committee\nFrank E. Schooley, Chairman, Director of Broadcasting- University of Illinois,\nUrbana, Illinois\nVernon Bronson, Station WTHS-EM-TV, Board of Public Instruction of Dade\nCounty, Miami, Florida\nFranklin Dunham, Chief of Radio-TV, Department of Health, Education & Welfare,\nOffice of Education, Washington, D« C.\nH0 B« McCarty, Director of Broadcasting, University of Wisconsin, Madison,\nWisconsin\nIo Keith lyier. Office of Radio Education, Ohio State University, Columbus,\nOhio\nJudith Waller, Evanston, Illinois\nConstitution Committee\nJames S. Miles, Chairman, Director of Broadcasting, Purdue University, Lafayette,\nIndiana\nGraydon Manus, Director of Broadcasting, University of Alabama, University,\nAlabama\nRichard Bell, Radio-TV Bureau, Arizona State University, Tempe, Arizona\nFranklin Dunham, Chief of Radio-TV, Department of Health, Education & Welfare,\nOffice of Education, Washington, D. G«\nWalter Emory, Michigan State University, East Lansing, Michigan\nGarnet Garrison, Director of Broadcasting, University of Michigan, Ann Arbor,\nMichigan\nAnaand Hunter, Director of Broadcasting, Michigan State University, East\nLansing, Michigan\nLeonard Marks, Cohn and Marks, Washington, D. C„\nDevelopment Committee\nWilliam Harley, Chairman, Stations WTL/WAM»FM-TV, University of Wisconsin. Madison\nWisconsin\nFranklin Bouwsma, Detroit Educational TV Foundation, Detroit 28, Michigan\nJames Etheridge, Florida Educational TV Ccmmission, Tallahassee, Florida\nRichard Hull, Director, Radio and TV* Ohio State Uhiversity, Columbus, Ohio\na, A„ Bemgsrfard, Jr.,, User task Bhivsr.itjr, Vau Jerk, Jfcw losrlt\nJames S« tales, Director of Bro&dc as ting, Purdue University, Lafayette, Indiana\nRobert Sohenkkan, Director of Broadcasting, Uhiversity of Texas, Austin, Texas\nFrank E. Schooley, Director of Broadcasting, Uhiversity of Illinois. Urbana,\nIllinois\nJohn Schwarzwalder, Manager, Twin City Area BTV Corporation, Uhiversity of\nMinnesota, St. Paul, Minnesota"
}