{
  "id": "d1413-1",
  "text": "-2-\nCONVENTION PROGRAM HILIGHTS\nThursday, November 6\n9:00 A.M.-12:00 N.\n2:00-iu00 P.M.\n6:00-7:00 P.M.\n7:00-8:30 P.M.\n8:30-9:30 P.M.\nRegistration\nOpen meeting NAEB Board of Directors (Open to all members).\nGeneral NAEB Business Session (Open to all members.)\nReports by officers and committee chairmen.\nDiscussion from the floor of general NAEB business\nPresident's Reception (Radisson Hotel).\nSmorgasbord Banquet (Radisson Hotel).\nAddress: Hubert H. Humphrey, U.S. Senator from Minnesota\nFriday, November 7\nGeneral and special interest sessions, morning and afternoon.\nAttendance at Minneapolis Symphony Orchestra rehearsal, 12:00-1:00 P.M.\nDinner session: Address by FCC chairman Paul A. WaLker\nSaturday, November 8\nConvention sessions morning and afternoon.\nU:30-5:30 P.M. Annual meeting (members only) with election of officers.\nROOM RESERVATIONS:\nMAKE THEM NOW I HI Li\nHotel accommodations have been reserved as follows;\nIn the Center for Continuation Study. This is located on the University of\nMinnesota campus in Minneapolis. Most of the convention sessions will be held\nin or within walking distance of the Center. During the convention all 60 of\nits sleeping accommodations will be available for NAEB use.\nAt the Radisson and Curtis Hotels in downtown Minneapolis. Blocks of rooms have\nbeen reserved for MSB guests in both of these hotels. The Radisson and Curtis\nare among Minneapolis' best hotels. Both are located in the downtown s ection\nof Minneapolis, and are withing a 15 minute car or taxi ride of the University\ncampus. Streetcar riders will find themselves in for a 20-30 minute jaunt in\neither case, with the Radisson a little closer that way.\nMake your reservations nowi Hotel rooms will be much in demand on November 6, 7 and\n8. In addition to the usual weekend traffic, there will be a complete hotel sell-out\non account of the Minnesota-Purdue football game on November 8. We have obtained\nthese rooms in the Radisson and Curtis with difficulty—and they will not be held\nlong if we do not quickly reserve them.\nIf you prefer a hotel room to a (rather chilly) park bench, fill out one of the\nthree pages which follow and mail it in right away!"
}