{
  "id": "d1413-2",
  "text": "Maabership Committee\nRaymond D* Birlbert, Chairman, Manager, Alabama Educational TV Commission,\nBirmingham. Alabama\nGertrude Broderick, Sub-Chairman, Individuals & ^'filiates. Office of\nEducation, Washington 25, D. C.\nHugh Mix, Sub-Chairman, Actives & Associates, Station WRAD-AM, Uhiversity\nof Oklahoma, Homan, Oklahoma\nJack D. Summer field, Sub-Chairman, Industrial Associates & Sustaining,\nButler Hall, Heir York, Hear York\nKenneth A* Christiansen, Director of TV, University of Florida, Gainesville\nFlorida\nLee Dreyfus, Station WDET, Wayne State Uhiversity, Detroit, Michigan\nHerbert Hake, Radio-TV Department, leva State Teachers College, Cedar Falls\nIowa\nEdward G* Sherburne, Department of Visual Ccmmunloations, Uhiversity of\nCalifornia, Berkeley, California\nGerald J* Willsaa, Department of Radio & TV, Denver Public Schools, Denver,\nColorado\nProfessional Advancement Committee\nVernon Bronson, Chairman, Station WTHS-TV, Board of Public Instruction of Dade\nCounty, Miami, Florida\nMartha Gable, Division of Radio & TV, Philadelphia Public Schools, Philadelphia\nPennsylvania\nPatrick Hazard, Annenhurg School, Uhiversity of Pennsylvania, Philadelphia,\n-JPeimsyl vania\n( Carl Manafigtr Station WSUI, State Uhiversity of lose, Iowa City, Iowa\nftobdrESohenkkan, Director of Broadcasting, diversity of Texas, Austin, Texas\nLoren Be Stone, Manager, Station KCTS-TV, University of Washington, Seattle,\nWashington\nEarl Uyrm9 Director of TV, Uhiversity of North Carolina, Chapel Hill, Worth\nCarolina\nPublications Committee\nFrank E„ Sohooley, Chairman, Director of Broadcasting, Uhiversity of Illinois*\nUSrbana, Illinois\nGertrude Broderick, Office of Education, Washington 25, D. G.\nWalter Emery, Michigan State Uhiversity, East Lansing, Michigan\nPhilip Lewis, Board of Education, Chicago 1, Illinois\nEd Stasheff, Department of Speech, Uhiversity of Michigan, Ann Arbor, Michigan\nElmer Sulzer, Director, Broadcasting Services, Indiana Uhiversity, Bloomington,,\nIndiana\nTracy Tyler, University of Minnesota, Minneapolis 14, Minnesota"
}