{
  "id": "d1900-1",
  "text": "The Board of Directors and the Division Boards shall each elect one of their\nown number as chairman. The five, together with the President of the Association,\nshall constitute the Executive Committee.\nThe various Divisions will be autonomous within their respective areas of\nconcern. (This is spelled out in more detail in the By-Laws which will be reprinted\nin the NAEB Year Book to be issued soon after the first of the year.)\nThe By-Laws also provide for the establishment of local, state, and area chapters\nof Individual Members.\nMethod of Election — Each Division shall determine in the future how its Board\nshall be elected, whether at-large nationally or on a regional basis. However, to\nconstitute the initial Boards, the present Board of Directors has approved the\nfollowing plans submitted by steering committees appointed at the convention to repre¬\nsent each Division, (it should be pointed out that, since a completely new structure\nhas been established, nominations recently called for under the existing structure\nare invalid and will be discarded.)\nRadio Station Division - To be elected regionally, as at present. Call for\nnominations has been mailed to allJRadio Station members.\nTelevision Station Division - To be elected at-large on a national basis.\nDetails will be sent to all TV station members on December 11.\nInstructional and Individual Member Divisions - Each of these Boards is to be\nelected from nominees selected by nominating committees in each Region. These\ncommittees have been appointed by the President and are due to report by Dec. 13,\nat which time ballots will be prepared and mailed to eligible voters.\nNew Dues Structure: Upon the recommendation of the Board of Directors, the\nmembership, in Milwaukee, approved a new dues structure for Institutional Members,\nto go into effect as of January 1, 1964. This new structure applies to all Insti¬\ntutional and Institutional Affiliate members, and is based on the operating budget\nof the member. Qualified Institutional members electing membership in more than\none Division must pay the appropriate dues for each Division. Such dues will be\nbased on the portion of the operating budget allocated to each operation, i.e.,\nradio, television, and instructional. (Note - The new By-Laws provide that, in\naddition to the regular Association dues indicated below. Division Boards may\nestablish additional service charges for particular additional services approved by\nthe members of any Division. This, however, is an internal matter for each Division.)\nOperating Budget\nLess than $25,000\n$25,000-99,999\n$100,000-249,999\n$250,000-499,999\n$500,000 and over\nAnnual Dues\n$100\n200\n300\n400\n500\nThe maximum dues payable by any one Institution, regardless of the number of Divisions\nit joins, are $750.\nDues for Individual Members are not being raised at this time. As in the past,\nthe Board will determine dues for those in the Associates category.\nMore detailed information about dues, billing, etc., plus a questionnaire\nasking institutions which Divisions they wish to join and which dues categories\nthey fall into, will be mailed to all Institutional members in the near future.\nNOTE - This Washington Report is being mailed to all members by first class mail.\nCopies will, therefore, not be included in the next Newsletter."
}