{
  "id": "d1504-0",
  "text": "A E B\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 GREGORY HALL\nURBANA, ILLINOIS\nRADIO GRANTS OFFERED\nThis year the NAEB and ETRC will start a 3-year\nprogram of grants for educational radio production.\nThe Center will provide funds annually to ac¬\ncredited educational institutions for development of\nradio programs intended for national distribution.\n“Under the 3-year plan all programs will fit the\ngeneral theme ‘The American in the Twentieth Cen¬\ntury’,” said ETRC President H. K. Newburn. “The\nproject is an effort to employ radio broadcasting to\naid a better understanding of and a more effective\nresponse to the challenges and opportunities of 20th\ncentury life.”\nFormal grant announcements, if not already in\nyour hands, will be mailed with complete application\ndetails to the NAEB institutional mailing list within\na few days.\nTIME FOR PRIX ITALIA\nCompetition is open again for the annual Prix Italia.\nNAEB may submit two literary or dramatic works,\nwith or without music, and a TV documentary, a\nnew classification this year.\nSince NAEB will be represented on the Music\nJury, our stations and production centers are barred\nfrom competition in this category.\nAccording to the new statutes, the TV documen¬\ntary is to be “produced especially for TV, inspired by\nfacts and illustrating events of an artistic, literary,\nscientific or social character, or by a news item. It\nmay be submitted as a film or telerecording of a live\ntransmission. Documentaries produced partially by\nboth these methods will also be accepted.”\nEntries must have a minimum length of 13 min¬\nutes and not exceed 60 minutes. The film must have\na double international sound track.\nThis year’s competition will be held from Sept¬\nember 30 to October 14, 1957. All entries must reach\nRome prior to August 15. Closing dates for entries in\nNew York is June 1st, to provide enough time for\ntranslations, shipping, etc.\nEntries in any category should be sent to Seymour\nNAEB Newsletter\nVol. XXII, No. 4\nApril, 1957\nNAEB Newsletter, a monthly publication issued by the\nNational Association of Educational Broadcasters, 14 Gregory\nHall, Urbana, III., $5 a year, edited by Mrs. Judith Stevens.\nApplication for 2nd class mail privileges pending at Urbane,\nIllinois.\nSiegel, WNYC, 2500 Municipal Building, New York,\nat the earliest practicable date.\nTWO GRANTS-IN-AID AWARDED\nNAEB awarded two workshop grants-in-aid last\nmonth to the University of New Mexico and the Uni¬\nversity of Miami.\nThe University of New Mexico is using their\ngrant for a workshop in in-class utilization of ETV\nprograms. Summer TV and production workshops\nwill be made possible by the NAEB grant to the Uni¬\nversity of Miami.\nBoth grants are made available through funds\nfrom the Ford Foundation.\nTHREE SCHOLARSHIPS GIVEN\nMessrs. F. Craig Johnson and William S. Baxter, both\nof Ohio University, and Ronald Kostka of the Uni¬\nversity of Illinois, were awarded NAEB scholarships\nto help carry on their work.\nJohnson, instructor in Radio-TV at Ohio Uni¬\nversity, will use his grant for study at the 1957 sum¬\nmer session at the University of Wisconsin. Baxter,\nassistant professor of Journalism at Ohio University,\nis planning to attend the 1957 summer school at the\nState University of Iowa.\nKostka receives his scholarship for being NAEB\nFact Sheet Editor, and he will use. it to further his\nstudies.\nSKORNIA APPOINTED TO\nUNESCO COMMISSION\nHarry J. Skornia, NAEB Executive Director, was one\nof five prominent American specialists appointed by\nSecretary of State John Foster Dulles to the U. S.\n1"
}