{
  "id": "d1504-2",
  "text": "Thence to Boston, for the Westinghouse Broad¬\ncasting Company’s conference on Public Service Pro¬\ngramming. Here were representatives of all the West¬\ninghouse stations, plus people from a hundred more\nstations, together with such NAEB’ers as Judith\nWaller, Sy Siegel, Parker Wheatley, Dick Hull, Keith\nTyler, Jim MacAndrew and Gertrude Broderick.\nIt was interesting to hear commercial program\ndirectors discuss the problems we educators have so\noften talked about. The Westinghouse meeting was\nunquestionably one of the best conferences I have\never attended - and twenty years in the business has\ntaken me to a good many. I hope we have some good\ncommercial participation in our St. Louis convention\nnext fall; we could learn a lot from some of these\npeople!\nMid-March took me to Chicago for a stimulating\none-day meeting with the Ad Hoc Committee which\nset up the Fourth Allerton House Seminar on Radio\nProgramming. Lee Dreyfus and Harold Hill joined\nthe group which had previously met in Ann Arbor to\ndiscuss grants-in-aid. The high level of discussion at\nthis and the other NAEB sessions I’ve recently at¬\ntended impressed me very much; we have learned to\ngive, take, and compromise in order to set up work¬\nable procedures.\nSt. Patrick’s day found me flying to Washington\nfor a session of the JCET, one of the several organiza¬\ntions advancing the cause of educational broadcast¬\ning to which NAEB has contributed so much, both in\nits formative and operational stages, (thanks to such\nable representatives as Sy Siegel, Gray don Ausmus,\nand Frank Schooley).\nAs this goes to press, I shall be in Urbana, where\nthe Foundations Committee (Frank Schooley, chair¬\nman; Dick Hull; and Jim Miles) is scheduled to meet\nto review and assemble suggestions from members\nand staff on foundation requests for the coming year.\nThe next day Marguerite Fleming will join us to talk\nover plans for this year’s convention.\nCan I stay home now to help clean house, work\nin the garden, or repair children’s bicycles? No - not\nfor a while. The Radio Programming Seminar will\nmeet at Allerton House on April 22-24; and that’s a\nproject close to my heart, after having managed an\neducational radio station for 20 years. In May, of\ncourse, I’ll be at the IERT, where I hope to see many\nof you. Finally, of course, there’s our own convention,\nOctober 30 to 31, and November 1, in St. Louis.\nThese meetings are important, and often exciting.\nOur organization couldn’t carry on its manifold ac¬\ntivities without frequent conferences among its of¬\nDIRECTORY CHANGES\np-\nI 122 Active Members\n86 Associate Members\n78 Affiliate Members\n289 Total Membership\nFM-Radio only 83\n(I) .... these 122 members .... construction permits for\n155 stations.\n5 KRMA-TV Add: Howard Johnson\nDelete: James Case\nWTUM (FM)* University of Tampa\nAdd: W. Ernest Vincent, Director Radio-TV\nWFSU-FM Florida State University\nAdd: University Broadcasting Service\nII WMCR (FM)* Western Michigan University\n12 Under Missouri\nAdd:\nKCUR (FM) University of Kansas City\n(Kansas City) C. J. Stevens, Director\nRadio-TV\n5100 Rockhill Road\nDelmar 7878\n29 Under Missouri\nDelete: University of Kansas City\nC. J. Stevens, Director\netc.\n32 Ohio Department of Highway Safety\nDelete: U.C. Felty\nAdd: Gordon Jeffery, Director\n37 Under Raymond D. Cheydleur\nAdd: University Broadcasting Service\n40 Under Minnesota\nAdd: The Evangelical Lutheran Church\nOffice of Public Relations\nJames V. Anderson\nRadio Television\n422 South Fifth Street\nMinneapolis 15, Minnesota\n42 Delete:\nColumbia University Erik Barnouw\n(New York) Editor, Center for Mass\nCommunications,\n1125 Amsterdam Avenue\nUniversity 5-2000\n45 Under Virginia\nDelete:\nDr. Jean Erwin\nSuperintendent, Speech Education\nAdd:\nMiss Evenly Thornton, Librarian\n47 Add:\nTeaching Aids Centre\n349 George Street\nToronto 2, Ontario\nCanada\n48 Add:\nKCUR (FM) University of Kansas <\nKansas City, Missouri\n51 WMCR (FM)* Western Michigan University\nficers, committee members and staff. But, like all\nrecent NAEB presidents, I find these demands on my\ntime and strength terrific. In addition, directing\nradio and television at the University of Minnesota\ntakes a little time, too—as do Frances, Sarah, Nancy\nand Tommy Paulu at 5908 Queen Avenue South in\nMinneapolis!\nBut it’s fun as well as work, because I believe in\nour objectives and enjoy working with our members.\n—NAEB—\nNEA’s Department of Audio-Visual Instruction\nwent on record last month as being against any switch\nor change in ETV channel allocations and for an ex¬\nperiment to see how subscription ETV would work.\nAPRIL, 1957\n3"
}