{
  "id": "d1504-4",
  "text": "The Network staff usually checks in tape returns seated on boxes, with tapes piled in the mid¬\ndle of the floor. Seated I. to r. are Adeleke Ojo, Zoltan Ujhelyi, Network Manager Bob Un¬\nderwood, and Engineer Jess Trump.\nNETWORK NEWS\n—Bob Underwood\nIn the last Newsletter we mentioned the tape re¬\nturns had been running a bit slow, and evidently\nmany of you decided to help out, because the returns\nhave increased considerably. Many, many thanks to\nall who rounded up the old series and returned them\nto us. We appreciate your cooperation, and the\nsteady stream of tapes you keep coming in helps us\nimprove our service.\nIf we have the proper number of tapes our pro¬\nduction people can dub, pack and ship a complete is¬\nsue in three or four days. This means you will get\nyour tapes sooner and have plenty of time to set up\nyour continuity.\nThe second quarter offering began April 7, so you\nshould have the cue, sheets for this quarter together\nwith the times for the first few issues. Also, additional\ninformation on some of the series has been sent, in¬\ncluding the package of promotional material for\n“Your Rights Are On Trial.” Please let us know your\nreactions to the type of promotional package made up\nfor this series; your ideas may influence other pro¬\nducers of grant-in-aid series.\nAs of this writing, 20 stations have not ordered\nfor the second quarter offering. If you are one, we\nurge you to do so as soon as possible. Since we have\nbegun distribution on this offering, we will have to\ncharge $2 a reel for back programs. Of course, if you\norder late and wish to begin with the programs cur¬\nrently being distributed, there is no charge.\nDon Dean, one of our hourly student employees,\nbecame a father again on March 10; a boy this time -\nDonald Kent Dean - a seven pound, nine ounce bun¬\ndle of joy. Congratulations to Don and his wife, La-\nvonne!\n—N A E B—\nJohn A. Perkins, president of the University of\nDelaware, has been named Under Secretary of the\nDepartment of Health, Education and Welfare. He\nsucceeds Herold C. Hunt, who resigned February 4\nto return to a teaching post at Harvard University.\nAPRIL, 1957\n5"
}