{
  "id": "d1504-6",
  "text": "“The Fight for TV Dominance.” Broadcasting.\n51:25, p. 27, December 17.\nTV networks and Hollywood movies compete\nfor station programming time.\n“TV Laid An Egg.” Sponsor. 10:25, p. 25, Novem¬\nber 17.\nNew fall network programs imitative, lack\ncreativity and suffer low audience ratings.\n“TV Program Time Tops 100 Hours Per Week.”\nBroadcasting. 51:25, p. 28, Decem¬\nber 17.\nStations increase hours in the air per week; de¬\nvote more time to network programs and film\nfeatures, less time to local live programming.\n“Old Movies Click on TV.” Tide. 30:23, p. 49, Dec¬\nember 14.\nFeature films are achieving high audience rat¬\nings.\n“TV Revenue Is Up, But Shows Are Creaky.” Ad\nAge. 27:50 p. 53, December 10.\nNetwork income is up but sponsors can’t find\nnew, exciting, high-rating programs for spon¬\nsors.\nLangman, Anne W. “Television.” Nation. 183:25,\np. 546. December 22.\n“Ding Dong School” and Walter Winchell\nleaving air in 1957 are victims of TV’s single\nmeasure of program success, the rating system.\nWhite, David Manning. “What’s Happening to\nMass Culture?” Saturday Review. 39:\n44, p. 11, November 3.\nPrediction that TV and other mass media may\nbring to “average” man a cultural richness no\nprevious age could give him.\nTEACHING BY TV\n► “Workshop for Writers” is a 16-weeks’ tele-course\nfor credit put on by the University of Cincinnati\nEvening College over WTCET. Two hours of college\ncredit will be granted upon successful completion\nof the required written assignments and the final ex¬\nam to be held on campus. Close to 100 persons sign¬\ned up for the course.\n► New York State’s first televised educational pro¬\ngram offering college credit, “Inductory Geography,”\nhas been launched. The Mohawk Hudson Council of\nETV reported 800 inquiries about the course had been\nreceived, but enrollment figures are not available as\nyet.\n► KETC, St. Louis, has the results of a survey made\nby their School Programs Department. They found\nthey have a weekly classroom audience in excess of\n150,000, that 696 schools take their programs, and\n2065 teachers regularly use their series. A fine record\nof growing audio-visual education!\nAWARDS AND WORKSHOPS\n► Michigan State University’s 7th annual Summer\nTV Workshop, August 5-23, will offer a foundation\nin TV production to school and community leaders,\neducators and members of the TV industry. The\nworkshop, available on a credit and noncredit basis,\nis divided into two general areas - directing and\nbroadcasting fundamentals.\nFor further information, write: William H. Tom¬\nlinson, Co-director, TV Summer Workshop, Depart¬\nment of Speech, Michigan State University, East\nLansing, Michigan.\n► A one-week workshop-conference on instructional\nTV sponsored jointly by the California State Depart¬\nment of Education and San Jose State College will be\nheld in San Jose, July 15-19, 1957. In addition to the\none-week program, a full six-week Instructional TV\nCourse for credit will be offered from June 24 to\nAugust 2 for all who wish to develop skills in in¬\nstructional TV. For information, write Richard B.\nLewis, coordinator of Audio-Visual Services, San Jose\nState College, San Jose 14, California.\nFCC ACTIONS\n► The FCC ruled against a proposal to shift th edu¬\ncational reservation in Bozeman, Montana, from\nVHF Channel 9 to UHF Channel 22. Montana State\nCollege and JCET opposed the proposal, for the col¬\nlege plans to use the channel in 2 years. Spokesmen\nsaid the switch to UHF would seriously affect the\ncollege’s ability to serve the entire state. Also, prep¬\narations for technical facilities had already been\nmade.\n► Two members of the FCC testified that assigned\nTV channels for education should be kept for edu¬\ncation as long as there is any indication they will be\nso used. Chairman George C. McConnaughey and\nCommissioner T. A. Craven testified at a hearing be¬\nfore the House Interstate Commerce Committee.\nCraven said he believes no legislation is necessary\nto “nail down” the assignment of such channels for\neducation. He said the channels should be reserved\neven in a case where educational use might be 10\nyears off.\nMcConnaughey said the Commission has dem¬\nonstrated a most lenient attitude and he thought they\nwould continue to do so.\n—N A E B—\nThe high price of TV sets is still a major deterrent\nto mass TV ownership in Japan. A 14-inch set costs\naround $200 - about 6-months’ take-home pay for a\nJapanese factory worker.\nAPRIL, 1957\n7"
}