{
  "id": "d1578-1",
  "text": "President’s Page— I I\nI’m AFRAID I MIGHT LEAVE SOMEONE, AND WITHOUT INTENT. PROFESSIONAL\nAdvancement committee had work to do in connection with TV Production\nWorkshop at Iowa, and the Engineering committee is deeply involved in\nthe Engineering Workshop at East Lansing.\nI wouldn’t want anyone to thnk that it’s all work and no play. Under¬\nstand OUR IMMEDIATE PAST PRESIDENT IS VACATIONING IN THE WEST. HOPE\nto be in Colorado the third week in August, myself. I will have at¬\ntended the annual convention of the Association of Teachers of Jour¬\nnalism WHEN YOU READ THIS.\nYour president will be representing NAEB at a meeting of JCET in Wash¬\nington on August 31 . Or, he did represent you, depending upon when\nYOU READ THIS.\nThe convention keeps moving along. Keep the dates in mind. Be sure\nTO MAKE YOUR PLANS EARLY, YOUR HOTEL RESERVATIONS EARLY.\nIn another section of the Newsletter, you'll read about additional\nCONVENTION PLANS. LUNCHEON SPEAKERS WILL INCLUDE Or. JOHN W. TAYLOR,\nExecutive Director of WTTW, Channel 11, Chicago; Superintendent of\nSchools Ben Willis, Chicago, and Dr. Frances Horwich, otherwise known\nas Miss Frances. Other speakers will be announced later.\nEfforts are being made to secure some more top-notch speakers, too,\nand I do mean top-notch, but courtesy to potential speakers requires\nME TO LEAVE THEM UNNAMED AT THE MOMENT. We DO HAVE ACCEPTANCE FROM\nONE DISTINGUISHED UNIVERSITY PRESIDENT.\nAnd WITH ALLr we’ll HAVE SOME GOOD BUSINESS SESSIONS, AND SOME GOOD\nSESSIONS ON BOTH RADIO AND TELEVISION PROGRAMMING, ON RADIO AND TELE¬\nVISION STATION OPERATIONS.\nGosh, I thought I was going to have lots to write when I started this.\nI've begun to run dry. Maybe I’ve looked at too many license appli¬\ncations. At home, we've been busy preparing license applicants for\nWILL-AMi-FM-TV. Yep, WILL-TV is on the air.\nHad notes recently from a couple of guys up in Minnesota. But they're\nIN A GOOD SPOT IN THIS SEASON OF THE YEAR. NOTE FROM BURTON PAULU IN\nMinneapolis, and from Milford Jensen, not so far away in Northfield.\nMarguerite Fleming was a recent caller at headquarters, too.\nSuppose most of you have seen that Dick Hull has a year's leave of ab¬\nsence from Iowa State College in order to do a year's study of educa¬\ntional television for the Center. And many of you who know Lyle Nel¬\nson will be sorry to note that he's left the Center, to take a posi¬\ntion AS ASSISTANT TO THE PRESIDENT AT SAN FRANCISCO STATE COLLEGE.\nWell, since I expect to write all of you later this month on some mat¬\nters of Association business, think I’ll just stop here.\nRegards to all,\n---Frank E. Schooley"
}