{
  "id": "d1578-1",
  "text": "In numerous interviews'Mr. Minow has expressed his interest in educational\nbroadcasting and in both the Senate and House committee hearings on ETV legislation\nmade strong statements of support. Commended by President Harley for his testimony\nhe replied, \"We have to make a start on the New Frontier somewhere!\"\nHOUSE HEARINGS\nHearings before the Subcommittee on Communications and Power of the House Com¬\nmittee on Interstate and Foreign Commerce Committee were held March 20-23. Wit¬\nnesses included NAEB members: Martha Gable, Armand Hunter, Raymond Hurlbert, Vernon\nBronson and John Crabbe. Although no commercial industry representative appeared a\nsupporting letter from LeRoy Collins, President of NAB, was entered in the record.\nTwo witnesses appeared to request that the legislation be amended to provide\nthat the funds be used for leasing lines: Robert Landry, Vice President for Market¬\ning, AT&T, N.Y ; and Francis E. Almstead, TV Consultant, N.Y. State Department of\nEducation. John White, President of NETRC, and William Harley, President of NAEB,\nboth interpolated into their testimony strong objection to such a provision, point¬\ning out the importance of maintaining the distinction between federal support for\ncapital equipment as opposed to operating funds. Congressman Moss (D.-Cal.) agreed\nand stated that such a proposal went far beyond the original concept of the legisla¬\ntion, whose central purpose, he believed, was to get stations on the air so as to\ntake up the reserved channels. In his opinion, a provision that permitted leasing\nof facilities, would ensure that the legislation would not be approved by the Congress.\nPresident Harley again read into the record the letters, from President Kennedy\nand former Vice President Nixon (originally presented at the NAEB convention in October)\nand submitted, that as statements from the spokesmen of both major political parties,\nthey indicated bi-partisan support for Federal assistance in fostering educational\ntelevision.\nResponding to questions raised previously by Chairman Oren Harris as to how ready\nthe several states are to use federal funds for ETV, Harley indicated that in the\nprocess of conducting a state-by-state survey of the needs of education for televi¬\nsion spectrum space, NAEB had acquired considerable data on the \"status of the art\"\nin each state. He then introduced Vernon Bronson, director of the survey, who pre¬\nsented a \"roll-call\" of the states, which provided a partial answer to Harris' question.\nEarlier, Dr. Edgar Fuller, testifying for JCEB, offered the services of this agency\nin compiling a full report on the readiness of each state. JCEB-NETRC-NAEB are now\nworking on this survey for inclusion in the record.\nMeanwhile, Oren Harris has written to state governors to ascertain the degree of\nreadiness within each state to use federal funds for educational television facilities.\nBoth Harris and Ribicoff are said to place a great importance upon the results of this\nsurvey. So far, the returns have been slow to come in.\nNAEB has informed people in each state concerning the Harris letter so that they\nmight cooperate with their governor in supplying information relevant to the formula¬\ntion of his response.\nPending the results of this survey and a statement from HEW, the hearings have\nbeen adjourned and the record remains open for filing of statements by interested\nparties.\nHearings are not expected to resume until early in May, at which time it is pre¬\nsumed that the HEW position will be presented by the Commissioner of Education, Dr.\nSterling McMurrin. He was scheduled to appear as the lead-off witness on March 22,\nbut that morning it was announced that a postponement had been requested. Coming on\nthe heels of the Senate vote and discussion of the Ribicoff letter, there has been\nspeculation on a possible relationship. There is also a feeling that the HEW position\nmay be altered somewhat for the House hearings. HEW may make recommendations of its\nown for what it considers suitable ETV legislation, taking into account some of the\nquestions raised by Ribicoff in his letter to Magnuson, and moving the Department into\nan affirmative posture."
}