{
  "id": "d1679-0",
  "text": "Office of Executive\nUrbana, Illi\nSeptember 16,\nSecretary\nNO I S\n194 i\nEN3SL ELECTED PRESIDENT OF NAEB\nHarold a. Engel, WHA, University of Wisconsin, was elected president of\nthe National Association of Educational Broadcasters as the organization\nCLOSED ITS ANNUAL CONVENTION ON PURDUE UNIVERSITY CAMPUS, SEPTEMBER 6.\n£NGEL, FOR A NUMBER OF YEARS EXECUTIVE SECRETARY OF NAEB, HAS LONG BEEN\nAN ACTIVE MEMBER OF THE ASSOCIATION.\nOther officers elected were Gilbert 0, Williams, WBAA, Purdue, vice-\npresident; and W. I. Griffith, WOI, Iowa State College. Elected to the\nExecutive Committee were H. H. Leake, WNAD, University of Oklahoma,\nrepresenting the southerndistrict; Carl Menzer, WSUI, University of Iowa,\nmid-west district; Allen Miller, KWSC, Washington State College, north¬\nwest district; Morris Novsk, WNYC, New York City, eastern district, and\nE. J. O'Brien, KFJM, University of North Dakota, northwestern district.\nThe elected officers were nominated by a committee comprised of the\nassociation^ four past presidents in attendance at the convention,\nW. I. Griffith, Carl Menzer, H. b. McCarty, and Jos. F. Wright.\nEXECUTIVE COMMITTEE ORGANIZES FOR WORK\nAfter the close of the convention early Saturday afternoon the Executive\nCommittee met in the Audience*studio of VV3AA, and later held an adjourned\nsession in the Union Building*.\nIt was decided to advise the Federal Defense Communications Board, of\nwhich James L. Fly, FCC Chairman, is also chairman that NAEB stands ready\nas an association to serve in the present national emergency and to\nREQUEST THE DESIGNATION OF NAEB MEMBER STATIONS AS THE ONE IN EACH COM¬\nMUNITY TO OPERATE IN EMERGENCIES WHEN IT MAY BE NECESSARY TO CARRY A\nSIMULTANEOUS BROADCAST TO ALL PARTS OF THE COUNTRY AT ANY TIME. THE\nDefense Communications Board has been so notified and also advised of\nthe Resolution adopted on the floor of the convention, a copy of which\nyou will find elsewhere in the News Letter.\nThe Committee also voted to promote the exchange of Defense ideas, pro¬\ngrams, and scripts. Future issues of the News Letter will contain special\narticles outlining what our stations are doing. The story of WNYC and\nNational Defense will appear October I. the issue of October 15 will\ncarry the story from Iowa: WSUI and WOI.\nA new oress for the News Letter was also approved. Watch for the nest\nissue,\nSCHOOLEY WAS RE-NAMED EXECUTIVE SECRETARY."
}