{
  "id": "d1679-4",
  "text": "CONVENTION SPOTLIGHTS\nNOW, IT IS DIFFICULT TO BRIEFLY SUMMARIZE ALL THAT WAS SAID AND DONE AT THE\nCONVENTION BUT HERE l*LL MENTION A FEW OF THE IMPRESSIONS JOTTED DOWN. If\nYOU WEREN T THERE, YOU MISSED MORE THAN I CAN TELL HERE.\nPresident Edward C. Elliott, Purdue, jolted the meeting into serious business\nRIGHT FROM THE START WITH HIS WORDS OF WELCOME. The CHALLENGE VAS ACCEPTED\nFOR NAEB BY PAST PRESIDENT H. B. ‘JcCaRT Y, SERVING IN THE ABSENCE OF PRESI¬\nDENT Ingham.\nNoVIK, WNYC, CHAfGED THAT THE EDUCATIONAL STATIONS HAVE THE DUTY AND PRIVI¬\nLEGE OF DEVELOPING MORALE AND DEMOCRACY. THE SPIRIT OF THE STATION MUST\nBE REFLECTED ON ALL PROGRAMS, HE SAID.\nCaptain Harold ^ent, with his numerous titles, brought greetings from Ed\nKirby, then outlined the objects of the Bureau of Public Relations, War\nDepartment. He pointed out that we must have a strong army, and to have it\nV'E must have a good army and civilian morale, a goal of the Bureau1 s is\nto present the truth about the ARMY. He suggested a possible organization\nof the newscasters of educational stations. Y.’e may hear more of that later.\nDr. Lull, Purdue, in correlating the previous speakers’ remarks pointed out\nthat it does make a difference what people think and believe and that the\neducational stations had an obligation here.\nIn the Friday afternoon session, ^isbs Williams presided in the absence of\nto* C. Jensen, vice-president. J. Philip Staley kicked off with comments\non available scripts and the fight was on. It ended with a pledge of\nMEMBERS PRESENT TO SUPPLY A SCRIPT EXCHANGE WITH SCRIPTS AND WITH DIRECTION\nof Nat Erwin to undertake the work.\nCarl Menzer, WSUI, opened the discussion on station promotion. Ioeas flew\nto thick and fast we haven’t room to list them here. Session adjourhed in\nTIME FOR A TRIP TO THE NEW IV BAA TRANSMITTER SITE, WHERE EXPERIMENTAL BROAD¬\nCASTS WERE BEING MADE NIGHTLY WITH THE NEW 5 KW OUTFIT.\nFriday evening the members h^ld a speaker-less banouet at Biltz’s and a\nHAPPY TIME WAS HAD BY ALL.\nSaturdayes program opened with a tour of the Purdue Speech Clinic with Dr.\nM. D. Steer demonstrating eouipment that was of interest to the radio group.\nYou may find more about this in a future News Letter.\nThe Saturday morning and afternoon sessions were combined, with W. I. Grif¬\nfith PRESIDING. ttlGHT HERE ANO NOW I WANT TO SAY THAT TOO LITTLE TIME WAS\nAVAILABLE FOR THE THINGS WHICH COULD HAVE BEEN GIVEN GREATER TIME. PLANS\nARE BEING MADE TO AVOID A LAST-MINUTE JAM AT THE NEXT CONVENTION.\nRalph Townsley, Chief Engineer of WB'AA, displayed wis new studio equipment\nAND BRIEFLY EXPLAINED ITS OPERATION. WITH A LITTLE URGING BY GlBBS\nWilliams he admitted desioncng a small sound effects machine, too. Blue\nPRINTS WILL BE MADE AVAILABLE TO YOU FOR COSTS OF THE PRINTS, 1 THINK."
}