{
  "id": "d109-102",
  "text": "APPENDIX E\nINTERNATIONAL ACTIVITIES OF THE NAE& (HIGHLIGHTS)\nJuly 1, 1956 - June 30, 1957\nNAEB is a member of the Universite Radiophonlque Internationale, European\nBroadcasting Union, and Prix Italia*\nNAEB International Relations Committee Chairman, Seymour Siegel, elected\nPresident of 21-nation (European) Prix Italia Conference and Exhibition.\nNAEB Entry, for second successive year, wins million-lire Prix Italiana First\nAward at Prix Italia Conference.\nNAEB provides jurors for all categories for which NAEB entries not submitted,\nfor above ♦\nNAEB-selected Fulbright Scholars to France (Keith Engar) and Italy (Bernard\nBuck) devote energies to new exchange series between Radiodiffusion-T^l^visio\nFrancaise and Radio Italiana with NAEB.\nThirty NAEB member institutions serve as hosts to foreign scholar broadcasters\nstudying U. S. educational broadcasting.\nNAEB Executive Director (Harry Skomia), former president (Frank Schooley) and\nothers serve on Advisory Committee to Fulbright Commission for broadcast per¬\nsonnel .\nExchanges of publications and programs with broadcast systems of England,\nFrance, Italy, Japan, Australia, Sweden, Austria, Canada, and other nations.\nResearch exchange maintained with Western European broadcast systems and\nUNESCO. Much of this and U. S. ETV Research distributed world-wide by\nNAEB ETV Research Fact Sheets.\nNAEB Executive Director assisted in the selection of U. S. representatives to\ntwo UNESCO International Conferences (Journalism; and Effects of Mass Media\non Children).\nNAEB Executive Director named to U. S. National Commission for UNESCO.\nFrench Radio's Madame Magdeleine Paz addressed NAEB 1957 convention.\nVarious NAEB members visited radio and TV stations in nations of Europe, South\nAmerica and far east.\nExecutive Director addressed Canadian Provincial Adult Education Conference\non Radio and TV in Saskatchewan, February, 1957. Scheduled also for lectures\nfor Board of National Missions of Presbyterian Church in Alaska, August, 1957."
}