{
  "id": "d109-49",
  "text": "GENERAL STATEMENT\nAs we survey past annual reports and seek to establish perspective\nfor the accomplishments of the NAEB during the past year, we are impressed\nby the increasing universality of the applicability to education of all that we\ndo. The NAEB is as interested in radio as in television; as interested in\nelementary and in-school instruction as in adult education; as interested\nin research and educational philosophy as in broadcasting techniques; as\ninterested in the good we can do members and other groups, as we are in\nthe good of the NAEB as an association; as interested in individuals (edu¬\ncators, students and station staff members) as in stations and institutions.\nOur recent merger with the Association for Education by Radio and\nTelevision has increased our interest in and emphasis on professional quali¬\nfications for educational broadcasters as educators. Recent demands for\nnew television uses have increased the emphasis we have had to give to\nresearch, seminars, consultation and other services in this field. The\nrenewal of interest in FM radio has made it imperative to increase the tech¬\nnical quality as well as the content and quantity of network offerings.\nIncreasing requests for help and consultation from broadcasting\nsystems abroad, government and international agencies, and other profes¬\nsional associations of the U. S. during the past year have forced us into\nincreased and increasing liaison with most of the important educational asso¬\nciations now in existence.\nAbove all, then, 1956-1957 has been a year of growth and diversifi¬\ncation of efforts. Much consolidation must still be achieved in order to\nmake certain that all recent advantages are used unselfishly and to the\ngreater dignity, integrity and efficiency of American education and American\nbroadcasting.\nMEMBER SERVICES\nAn Association like the NAEB, which is primarily a member-service\nbased organization, must always be vigilant against activities and associa¬\ntions which might lead it too far afield, or cause it to neglect service to its\nmembers. At the same time an organization without the cooperation and\nrespect of other associations would be of little service to its members, and\nwould have few resources with which to enrich and stimulate membership\nthinking.\nTherefore, in spite of the accomplishments listed below under ACTIVI¬\nTIES AND RECOGNITION and ORGANIZATIONAL RELATIONS, by far the greater\npart of the energy and time of the NAEB and its staff and officers is devoted\nto member services."
}