{
  "id": "d109-54",
  "text": "-6-\nThe recently announced availability of $300,000.00 from Center\nfunds for the production solely of radio programs for the NAEB Radio Network\nduring the next three years, plus the increased flow of fine programs\nfrom abroad, through the efforts of our International Relations Committee,\npromise increased stature and quality for this NAEB service to the nation.\nCOMMITTEE ACTIVITIES\nOne of the great strengths of the NAEB, as compared to other organi¬\nzations functioning more entirely as staff operations, is the amount of work\ndone each year by its officers, board and committee members, all of whom\nserve without reimbursement. The visible output of NAEB Committees is great,\nto say nothing of the thousands of man-hours consumed in general associa¬\ntion planning; in planning and screening programs, applicants for seminars,\nworkshops and scholarships; and in other association business.\nAlthough NAEB committees have been active in varying degrees during\nthe past year, the work of several of them warrants particular mention .\nThe Professional Advancement Committee\nThis committee held a two-day meeting in Urbana during which\nrecommendations for professional advancement activity, both for this year\nand on a long-range basis, were drawn up. In general, the committee\nrecommended a continuation of the NAEB scholarship program, established\na priority list of workshops and seminars that should be held this year and\nin the future, recommended continuation of NAEB consultation services and\ngrants-in-aid to on-going workshops and seminars, discussed at length the\nproblem of professional stature for educational broadcasters, and appointed\na special subcommittee to consider this latter problem. In addition, through¬\nout the year, certain members of this committee served on the special\nsubcommittees which planned the workshops and seminars held, and\nassisted in the selection of workshop and seminar participants, and work¬\nshop grant-in-aid and scholarship recipients.\nThis committee works very closely with other NAEB committees\n(Engineering, Foundations, Membership, etc.) in order to reflect, in the pro¬\nfessional advancement activities recommended, the. needs of the members,\nand to continue to determine new needs as they arise.\nThe Radio Network School Committee\nThis committee met three times during the year, in connection with\nboth the NAEB Convention in Atlanta and the Institute for Education by\nRadio-TV in Columbus and at a special meeting in Chicago. This committee\nauditioned all programs submitted for consideration for use on the In-School\nportion of the NAEB Radio Network and selected those programs to be used."
}