{
  "id": "d109-55",
  "text": "-7-\nThe committee also established a set of criteria for In-School programs for the\nguidance of member stations submitting such programs for Network considera¬\ntion, and appointed a subcommittee to prepare a complete catalog of In-School\nprograms currently on file at the Network indicating both grade levels and\nsubject matter areas for all series. Another subcommittee will examine\nthis catalog carefully to determine areas of program weakness (both as to\ngrade level and subject area) and will attempt to get member stations to pre¬\npare and submit programs in those areas of the greatest need. Another subcom\nmittee will attempt to establish a library of special programs for particular\ndays during the year, such as Christmas, Thanksgiving, Columbus Day,\netc., which will then be made available to school stations since such\nstations make great use of such programs during the school year. This\ncommittee has also worked very closely with the American Friends Service\nCommittee in an effort to produce a series of programs, on the elementary\nlevel, which will, through the use of overseas recordings, attempt to\nbring about a better understanding of other cultures •\nThe Program Grant-in-Ald Committee\nThis committee is charged with the responsibility of selecting those\nprogram series which will be given grants-in-aid by the Educational Tele¬\nvision and Radio Center. During the past year this committee, which\nnormally meets only once a year (to make selections), held two two-day\nmeetings in Chicago. This was necessary because of a change in submission\ndeadlines made by the ETRC.\nThe Permanent Financing Committee\nThis committee is charged with one of the greatest responsibilities\nof any NAEB Committee. It was formed to study the present financial\nsituation of the NAEB (budgets, sources of income, etc.) and to re-evaluate\nthe various roles and responsibilities of the Association in order to make\nrecommendations as to the future financial structure and self-support of\nthe Association. The committee held one special meeting in Chicago and,\nin addition, met in connection with the Region III meeting in January\nand the Institute for Education by Radio-TV in May. This committee has\nalready presented tentative recommendations to the NAEB Board of Directors\nregarding future activities of the NAEB, based on potential financial sup¬\nport. However, this committee realizes the long-range implications of\nits deliberations and recommendations and will continue to study the problem\nand propose possible solutions to the Board. One recommendation of this\ncommittee, concurred in by the Membership Committee, was to make a\nconcentrated effort to increase the number of individual members of the\nAssociation in order to increase total income from membership dues. This\nmembership drive has been instituted, as is pointed out below in the para¬\ngraph devoted to the Membership Committee."
}