{
  "id": "d109-60",
  "text": "12\nReport of the NAEB TV LIGHTING AND STAGING WORXSHOP (August 19-22, 1956,\nAnn Arbor, Michigan) published February, 1957.\nReport of the NAEB TV PROGRAM PLANNING SEMINAR (August 26-September 1,\n1956, Madison, Wisconsin) published February, 1957.\nPAPERS FROM OUTSIDE SOURCES REPRINTED AND DISTRIBUTED BY THE NAEB\nDURING THE PAST YEAR:\n“Standardization and Control of the Kinescope Recording Process,** by Rodger\nRoss, CBC.\n“WOI-Two Channel Transistor Remote Amplifier Mixer,’* by Donald K. Haahr.\n“Phase, Amplitude and Aperture Correction in Television Systems,” by E. D.\nGoodale, of the NBC Engineering Department.\nPUBLICATIONS NOW IN PROCESS (beyond new editions, revisions, and current\nissues of regular services):\nReport of the FOURTH ALLERTON NAEB SEMINAR ON RADIO PROGRAMMING\n(April 21-24, 1957).\n“Closed Circuit Television Technical Considerations,” a technical paper now\nbeing prepared for publication this summer.\nDuring the past year, thanks to a grant from the Ford Foundation, a\nspecial publications review and study was made. Following the recommenda¬\ntions of the consultants engaged for this study, many changes in the format\nand content of the Newsletter and Journal have already been made, and a\nlarger number of recommended improvements will be instituted in all publica¬\ntions during the coming year.\nGRANTS IN AID\nThe philosophy behind Grants-in-Aid in general, as administered by\nthe NAEB, is that educational broadcasting needs strengthening not only in\nits central organs, but also at the local level: in improved program produc¬\ntion, research, staff training and other aspects. The various grants-in-aid\nof the NAEB have therefore been principally devoted to helping educational\nradio and television stations and production centers and their parent institu¬\ntions, to improve their competence, facilities, program output, and the local\nand educational respect they enjoy, in order that the entire movement may\nmove forward soundly."
}