{
  "id": "d109-61",
  "text": "-13-\nIn this sense even the Scholarships which the NAEB has been privileged\nto grant during the past few years, with funds provided by the Fund for Adult\nEducation, and more recently by the Ford Foundation, are a type of grant-in-\naid. These Scholarships have enabled some two hundred of the over two\nthousand staff members of educational television and radio stations to secure\nadditional educational training and improved skills. They have also made\navailable to institutions desiring to give workshops and summer sessions,\nadditional students and funds which would not otherwise have been available.\nThe training received by these scholarship recipients has been supplemented,\nof course, by the consultation service which the same donor has made possi¬\nble, whereby the best authorities in the nation have been made available to\nentire station staffs, at their home location, in order to provide guidance and\nassistance in a way which would be possible under no other circumstances.\nHowever, the specific grants-in-aid projects of the NAEB during the past\nfew years, and intensified during 1956-57, are as follows:\nRadio Program Grants-in-Aid\nOriginally, until the ETRC was created as a program center, the NAEB\nadministered annual program grants-in-aid in both radio and television, with\nfunds from the Fund for Adult Education, .Eighty thousand dollars per year\nwere offered, half in television and half in radio, to make possible the pro¬\nduction, on a matching basis, of programs of higher quality than the stations\ncould produce with only their own resources. This made possible, for example,\nthe employment, usually on a short-term basis, of outstanding content authori¬\nties, writers, and producers, who would otherwise not have been available.\nWith the creation of the ETRC, these funds were given to it to adminis¬\nter. The Center,with a qualified program staff, handles all such projects\ndirectly for television. For radio, it has left to the NAEB the distribution\nof announcements and the judging and selection of applications. Under this\narrangement, the issuance of contracts and payments is handled directly by\nthe Center, on the basis of NAEB recommendations. Resultant programs,of\ncourse, are for distribution by the NAEB Radio Network. This arrangement\nhas resulted in the production and distribution of many fine programs, as\nindicated in Appendix D.\nDuring the past year, the ETRC has made available, from its program\nfunds for radio, $300,000 ($100,000 a year) for a three-year program of\nsuch grants anchor contractual arrangements for the production of outstanding\nradio programs. Resultant productions are expected to provide new strength\nto the NAEB Radio Network. More importantly, it will make possible increas¬\ningly high levels and standards of production at educational radio stations,\nwhich will be recipients of most of these funds."
}