{
  "id": "d109-62",
  "text": "14\nWorkshop Grants-in-Aid\nAs listed in the SEMINARS, WORKSHOPS AND CONFERENCES section,\nfollowing this, the NAEB has for several years tried to meet the national\nneed for special workshops and seminars for members of educational station\nstaffs in both television and radio. Personnel for whom these training\nsessions have been conducted has ranged from educational administrators and\nmanagers to program directors, writers, producers, engineers, staging and\nlighting directors and the various other persons on whose competence the\nsuccessful operation of educational television and rddio facilities depends.\nIn this area too, however, the NAEB has felt that the central associa¬\ntion should not attempt to do the entire job. Therefore, during the past\nyear, with funds provided by the Ford Foundation, Workshop Grants-in-Aid\nwere made available for the first time to educational institutions planning\nor desiring to conduct workshops or seminars of their own. As a result of\nthese grants, the outstanding authorities in the nation are serving as con¬\nsultants and instructors at ten workshops at universities around the nation.\nThese workshops, which would in most cases have had access only to local\npersonnel for instruction and staff, have been made outstanding ones, thanks\nto this program of grants-in-aid. And once started, we believe a standard of\nquality will have been established which should cause the institutions to\nwish to preserve it in subsequent workshops, which we hope will become\nregular features of their educational activities.'\nResearch Grants-in-Aid\nBecause of the need for the results of research of different kinds, for\ndifferent use, from different types of educational operations, and in different\ntypes of communities throughout the nation, the NAEB during the past year made\navailable, from the regular Research allocation in its current Kellogg Founda¬\ntion grant, modest grants to six educational institutions qualified to carry\nout such research projects. Although funds for this purpose were very modest,\nit appears that useful results will become available from them for national\nNAEB distribution. And, once again, a tradition and pattern of self-examination\nwill have been assisted to develop at the local level. . .a tradition which\nwe hope will be considered essential enough to continue from locally-\navailable funds.\nSEMINARS. WORKSHOPS AND CONFERENCES\nT3fe__NAEB ETV Staging and Lighting Workshop\nThis workshop was held August 18-22, 1956, at the University of\nMichigan, for 21 representatives of ETV stations and production centers.\nConsultants in staging and lighting were brought in to explain and demonstrate"
}