{
  "id": "d109-63",
  "text": "-15\nbasic principles and techniques. Workshop participants were also given an\nopportunity to take part in practical exercises in staging and lighting which\nwere then critiqued by the consultants. This was the first workshop held\nfor ETV people involved in staging and lighting and, according to the reports\nturned in by the participants, filled a long-felt need in the field. A brief\nreport of this workshop has been published and is available from NAEB\nHeadquarters.\nThe NAEB ETV Program Planning Seminar\nThis seminar, designed for those persons actively engaged in planning\nprograms for ETV stations and production centers, was held August 26-September\n1, at the University of Wisconsin. Academic subject-area specialists, (from\nthe humanities, the physical sciences and the behavioral sciences) were\nbrought in to discuss their fields and make recommendations as to the sub¬\nject matter that might well be presented by TV. Consultants in program\nplanning and production were then used to help the 25 participants translate\nthese general ideas into ETV program possibilities. Great use was made of small\ngroup discussions, led by recognized leaders in the field of TV programming.\nFrom the reports filed by the participants, this seminar resulted in all of the\nparticipants returning to their stations with many new ideas and concepts\nabout ETV programming. .A report of this seminar has been published and is\navailable from NAEB Headquarters.\nThe NAEB Fourth Allerton Seminar in Radio Programming\nIn recent years, due to the terms of grants received, the NAEB has\nbeen unable to place as much emphasis on educational radio as it has on\neducational TV. However, each year an effort has been made to hold at\nleast one seminar or workshop designed especially for educational radio\npeople. For example, last year, a seminar in audio and radio engineering\nwas held and special emphasis was given to the problems Of the small FM\nstation. This year it was possible to provide a seminar for persons actively\nengaged in planning programs for educational radio stations. It should be\npointed out, too, that whereas foundation money granted for TV workshops and\nseminars has been sufficient to pay all expenses involved, this has not been\ntrue for radio and, for the seminar being discussed, less than half of the\nexpense incurred by the participants was paid by the NAEB. The fact that we\nstill filled our quota of 28 participants, in spite of the fact that participants\nhad to pay a large part of their expenses, speaks well for the continued intense\ninterest of educational radio broadcasters in improving themselves and thus\nthe programs they are able to offer to their audiences. Academic subject area\nconsultants (in humanities, the physical sciences and the behavioral sciences)\nwere brought in to set forth what they felt the public should be told, through\nradio, about their respective fields. In addition, consultants in audience\nsurveys, music programming and legal problems were also used. Considerable\ntime was spent in group meetings so that a free exchange of ideas might be"
}