{
  "id": "d109-66",
  "text": "-18-\n6. Appeared on TV panels at the NAEB Staging and Lighting Workshop,\nRegion III Meeting, Central States Speech Association meeting,\nand the University of Toledo Television Workshop.\n7. Was appointed to Panel Four (Propagation Data) of the Tele¬\nvision Allocations Study Organization and participated in four\nmonthly meetings.\n8. At the request of the President of the ETRC, prepared for the\nCenter a report on the “Status of the Ampex Videotape Recorder;”\nwith the assistance of members of the NAEB Engineering Committee.\n9. Prepared, secured for duplication and circulated the following\nfor interested technical and other station personnel:\na. Reports on the NAEB Radio and Audio Engineering Seminar\nand the 1955 NAEB TV Engineering Workshop.\nb. Two articles on Kinescope Recording by Canadian authorities:\n“Television Studio Practices Relative to Kinescope Record¬\ning” by Harold Wright, (SMPTE reprint), CBC; and “Stand¬\nardization and Control of the Kinescope Recording Process”\nby Rodger Ross, CBC.\nc. “WCI-Two Channel Transistor Remote Amplifier Mixer”\nby Donald K. Haahr, of the WOI-TV Engineering Staff,\nIowa State College.\nd. “Phase, Amplitude and Aperture Correction in Television\nSystems” by E. D. Goodale, of NBC, New York.\ne. “Low Power Television Technical Considerations,” pub¬\nlished as a Supplement to the February, 1957, NAEB News¬\nletter.\nf. A complete revision of the NAEB Technical Directory which\nlists over four hundred names of technical personnel at all\neducational television and radio stations and production\ncenters.\ng. An NAEB Test Equipment Inventory listing test equipment\nin use at educational television and radio stations.\nh. A monthly NAEB Newsletter Column called Technical Tips.\ni. A quarterly compilation of the Technical Tips Columns\ncalled the NAEB Engineering Newsletter which is mailed to\nthe Technical Directory list of personnel.\nj. Assisted Richard Lawson, of the WILL-TV staff, in the\npreparation and publication of two issues of a Staging,\nLighting and Graphic Arts Newsletter.\nIn addition to the above service, Mr, Cecil S. Bidlack, NAEB TV En¬\ngineer, furnishes much technical advice by correspondence. He is also\nactive in the supervision of equipment and maintenance of the NAEB Network.\nHe is a Senior member of the Institute of Radio Engineers, a member of its"
}