{
  "id": "d109-70",
  "text": "-22-\nAt the first joint Annual Convention of the CIO-AFL, thanks to Mr.\nNovik's efforts, a joint resolution was passed unanimously, pledging support\nto educational television nationally. Several gifts in equipment and cash\nhave been made by labor unions, particularly in Chicago and Houston, but\nalso in other areas. The IBEW, IATSE, NABET and AFTRA have all contributed\nto such gifts, and to efforts to assist ETV stations generally. This is not to\nsay that some trouble spots do not remain, but progress is generally more\nencouraging than we had hoped at the time this problem developed.\nIn closing his last report, Mr. Novik wrote:\n\". . .There is a definite need for the development of a closer working\nrelationship with aU unions. Cooperation and interest in the community\nstations will help—not only in clearing up the matter of rights and protection\nof members—but also in the development of local programming.\n“The national leaders of the AFL-CIO are definitely interested in\nEducational TV. The recent convention manifested this interest. It seems\nto me that there is room for a closer relationship and a more enthusiastic\ninterest on the part of the NAEB and the Educational Stations involved for\ndeveloping this relationship and support.*'\nIn closing our report on this service generally, we should like to\nrepeat one paragraph from an earlier report by Mr. Novik as well:\n“The role of the NAEB in training the personnel and helping the\nstations in operational problems, it seems to me, is the difference between\nlife and death. Limited as this help may be, had we had it twenty years\nago, we would have a different educational broadcasting picture in this\ncountry today.M\nOTHER CONSULTATION SERVICES\nWith funds from the FAE, continued for this year by the Ford Foundation,\nthe NAEB has been enabled to provide material assistance in many diverse areas\nof need to educational television stations in varying stages of development,\nfrom operating stations to preliminary studies. Consultants were sent on\nrequest to Detroit, the University of Nebraska, Ohio State University, Memphis\nand the Oregon State System of Higher Education. Assistance has also been\ngiven in Miami and Alabama, where additional visits are scheduled for the\nfuture, as soon as local arrangements are finalized. Started as a purely\nexperimental project, this project has been very successful, having made\nit possible for ETV Stations and their staffs to secure expert consultation\nassistance on the spot in solving problems which they could not otherwise\nmeet, in various planning and operational areas."
}