{
  "id": "d109-84",
  "text": "-36-\nSMPTE: The Society of Motion Picture and Television Engineers\nThe NAEB is represented officially in this society by its Engineer, who\ncontributes papers and serves other liaison functions. NAEB engineers gener¬\nally are encouraged to become members of such groups, and many do so.\nSREB: The Southern Regional Education Board\nThe Executive Director served as a consultant to last summer’s Daytona\nconference. Constant liaison and an exchange of ideas, consultants, publica-.\ntions and materials is regular practice with this imaginative regional organiza¬\ntion.\nTASQ: The Television Allocations Study Organization\nThis special group was set up to study and recommend the definitive\nallocation of frequencies for TV in the U. S. The NAEB Engineer is a member\nof Panel Four, charged with the study and analysis of Propagation Data needed\nfor this study.\nUFPA: The University Film Producers Association\nThis group is represented on the NAEB Organizational Liaison Committee\nPrincipal exchanges between the two groups occur in the areas of coordination\nof film production for ETV and non-TV uses, to avoid, as much as possible,\nduplication of functions, and maximum support for and utilization of each\nothers' efforts and products.\nUNESCO: The United Nations Educational, Scientific and Cultural Organizatioi\nDuring the past year the Executive Director assisted in the selection of\nU. S. representatives for two international conferences. Similar advisory and\nconsultant functions are provided for UNESCO on a regular basis. During the\nyear the Executive Director was also appointed to the U. S. National Commis¬\nsion for UNESCO, as well as to membership on two committees: The Mass\nMedia Committee and the 1957 Convention Planning Committee. There is\nalso an equally friendly relationship with the U. N. itself, from which the\nNAEB has received numerous materials for distribution and with which it has\nbeen able to assist in numerous broadcast projects.\nURI: Universite\" Internationale Radiophonique; The International University\nof the Air\nThe NAEB is represented in and has assumed a considerable leadership\nrole for, this group, which is interested in setting up a regular exchange be¬\ntween educational departments of the broadcasting systems of Europe and the\nUnited States. Within the next few years, the flow of materials in this ex¬\nchange is expected to be very significant, thanks to specific plans laid at\na meeting a few months ago in Europe, at which the NAEB was represented by\nits Fulbright scholars to France and Italy."
}