{
  "id": "d109-86",
  "text": "-38-\nor the Center, or both. The NAEB is often called upon as advisor in the plan¬\nning and implementing of study tours for educational broadcasters on request\nfrom numerous independent and governmental agencies administering such\nexchanges.\nOne of the finest recognitions to come to the NAEB from abroad was\nthe winning, for the United States for the first time, of the Prix Italia First\nAward for Original Radio Musical Composition in 1955. The winning entry was\nHenry Brant’s Oratorio for Radio, entitled ‘December.* This composition\nhas during the past year been broadcast by the radio systems of most of the\nWestern World, bringing new prestige to the U. S. generally. It is signifi¬\ncant that this entry was from educational radio and the NAEB. An NAEB entry\nwas also the winner of the First Award in the Documentary Class in 1956 in\nthis same international competition with “Sounds of My City,** by Tony\nSchwartz, which is a sound picture of the world's greatest city. New York.\nThis documentary program is now available for sale in long-playing record\nform in the United States.\nIn addition to the fine programs we receive from member stations, from\ntheir regular productions and through ETRC grants-in-aid, our programs from\nforeign sources have increased through the continued efforts of the NAEB\nInternational Relations Committee. Presently, such foreign sources as the\nCanadian Broadcasting Corporation,The French Broadcasting System, The\nBritish Broadcasting Corporation, Radio Italiana, The Swedish Broadcasting\nSystem, Radio Austria and The Japanese Broadcasting System are represented\nin Network offerings.\nAs the first educationally-operated network in the world, the NAEB\nRadio Network has served as a model for operations in many parts of the\nUnited States and many foreign nations.\nOther international relations aspects of NAEB activities are included\nunder ORGANIZATIONAL RELATIONS and ACTIVITIES AND RECOGNITION.\nFINANCIAL SUPPORT\nPresent support for the Association is provided by grants from the Ford\nFoundation, the W. K. Kellogg Foundation, by member dues, a small sum from\nthe sale of publications and record albums, and (for radio) member-station\nnetwork fees, which make the Association partly self-supporting.\nPrevious grantors include the Fund for Adult Education, the Rockefeller\nFoundation, and several others, as listed in the “Analysis of Grants Made\nto the NAEB,\" attached as Appendix B, which have provided support during\nthe last eight years of the NAEB's thirty-two years of existence."
}