{
  "id": "d109-87",
  "text": "■39-\nProgress towards self-support is outlined in the report, under COM¬\nMITTEE ACTIVITIES, of the Permanent Financing Committee,\nIn addition to support of the Association itself, which has been\nforthcoming during the past few years, as well as that which has been avail¬\nable to the ETRC, the JCET, and the American Council on Education’s TV\nCommittee, all of which strengthen our common effort, we should like to\nmention the gratifying support which many of our member stations have\nreceived and are continuing to receive from local industries, local commercial\nbroadcasting stations, local foundations, and various other civic, educa¬\ntional, professional, and union organizations. Most of these gifts and\ngrants have been for, or in the form of, capital grants. However, some have\nalso begun to be forthcoming for program and staff support as well. We\nbelieve this bespeaks a growing recognition of the importance of the specifi¬\ncally educational uses of radio and television to which our efforts are\ndevoted.\nMEMBERSHIP\nMembership gains for the past year were the largest achieved by the\nNAEB in any single year.\nProgress in Network Membership is shown in tabular form in the\nNAEB RADIO NETWORK REPORT.\nThe status of current Active (operating stations). Associate (produc¬\ntion centers). Affiliate (organizations active in the field but not qualifying\nfor active or associate membership), and Individual Membership is shown\nin tabular form in Appendix A. Gains for the past year are as follows:\n1955-56\nActive\nAssociate\nAffiliate\nIndividual\n* Included Individual Members\n115\n79\n73*\n1956-57\n125\n87\n51\nover 500\nThe increase in Individual members is due to absorption of the AERT\nmembership. The decrease in affiliates is due to the transfer of individuals\nto the new individual member category in a reclassification of membership,\neffective this year. All members except Honorary and Individual are now\ninstitutions.\nThe Honorary Memberships remained at three: two former Federal\nCommunications Commission Chairmen, whose efforts were in large part respon\nsible for the allocation and preservation of frequencies in the spectrum for\nETV and educational FM stations; and the former educational and public service"
}