{
  "id": "d1594-1",
  "text": "NAEB MEV/S LETTER.... JUNE 1, 1940 ... .Pago 2\nstandard broadcast• There was testimony that a band width of less\nthan 200 kilocycles can be used for EM, but this lessens the noise-\ndiscriminating quality which has been established by experimental\noperation with the wide channel. Testimony advocating the narrower\nband width was not supported by experience in program service.\nMoreover, the narrower band width would jeopardize use of facsimile\ntransmission on the same channel. The Commission believes that\nregular program service should begin on a 200-kilocycle band basis\nwhich can be conveniently reduced if developments warrant. By adopting\nthe wide-band EM channels at this time, it will be possible for the\nto continue the use of receivers designed for wide-band reception\neven though narrower channels may later be authorized.\nThe opening of a new band for commercial broadcast will help to correct\nnumerous defects and inequalities now existing in the standard broad¬\ncast system. These inequalities result from the scarcity of frequenci©\ntheir technical characteristics, and the early growth of broadcasting\nwithout technical regulation. There is today a lack of stations in\nsome communities, and other communities do not have sufficient choice\nof program service. The establishment of the new broadcast band in\nthe higher frequencies will enable many communities to have their own\nbroadcast stations.\nExperimental operations show that FM stations can operate on the same\nchannel without objectionable interference with much less mileage than\nis possible with standard broadcast stations. FK has the ability to\nexclude all except the strongest signal. Also, FM stations require\nmuch less mileage separation than do standard broadcast stations. The\nservice range of FM stations, though limited, will in many cases be\ngreater than obtained from the primary service of comparable standard\nbroadcast stations.\nThe licensing of classes of standard broadcast stations in the same\narea with different frequencies and different power has resulted in a\nwide disparity in the extent of service to the public. 'The system of\nclassification now employed for standard broadcast stations will not\nbe used for FM stations,. The rules and regulations and engineering\nstandards to be issued for FM in the near future will enable appli¬\ncations to be made for facilities to serve a specified area. FM\nstations will be rated on the basis of coverage rather than power.\nCompetitive stations in the same center of population will be licensed\nto serve the same area.\nThe present situation of certain standard broadcast stations having\nlarge daytime coverage and restricted nighttime coverage on duplicated\nchannels will be avoided. The coverage of EM stations will be\nsubstantially the same both day and night. However, FLi stations do\nnot have the long-distance coverage of the present high-powered\nclear-channel standard bx*oadcast stations. The latter may be required\nindefinitely, for widespread rural coverage. But for covering centers\nof population and trade areas, the new class of station offers a\ndistinct improvement.\nThe Commission deems it in the public interest to allocate a con¬\ntiguous band of frequencies to accommodate both commercial and\neducational FM stations. The band between 42,000 and 50,000 kilo¬\ncycles is particularly suited for this service. Under the new alloc¬\nation, the same number of frequencies heretofore assigned to non-"
}