{
  "id": "d1594-4",
  "text": "NAEB NEWS LETTER....JUNE 1, 1940,,..Page 5\n’’The National association of Educational Broadcasters urgently\nrequests the Senate Appropriations Committee reinsert in appropri¬\nations bill ^40,000 item for use of United States Office of Education\nin radio educational activities and also urges elimination of provision\nwhich prohibits the WPA from accepting any relief project which deals\nwith radio so long as it is educational activity. We commend earnest\nconsideration of these recommendations by your committee and cite\nrecord of Office of Education radio activities as meriting continuation\nof this work,”\nUNIVERSITY OF aLaSKA ON THE AIR\nThe University of Alaska broadcast three series of programs over\nKFaR, Fairbanks (610 K.C.) during the academic year which has just\nclosed.\nRADIO aT U, OF MICHIGAN\nWaldo Abbot says in his May News Letter that five radio courses are\nto be offered at the University of Michigan during the summer session.\nCourses are: Fundamentals of Broadcasting, Laboratory in the\nRecording and Reproduction of Speech, Radio Reading and Dramatics,\nStage and Radio Diction, and The Writing and Production of all Types\nof Continuity for Broadcasting.\nNEW BOOK BY 1I0RRIS OF KOAC\nRADIO GUILD PLAYS, a group of fifteen radio plays written especially\nfor high schools and colleges, including original drama, historical\nplays, fairy tales and adaptations from famous plays and short stories\nwill be published this summer by the H. u Wilson Company of New York.\nJames M« Morris, in charge of dramatic work at Oregon’s State-owned\nstation, KOAC, is the author.\nThe new book will grant broadcasting rights to high school and college\nradio workshops and other non-commercial groups. A director’s hand¬\nbook, included with the volume, gives suggestions for the production\nof radio plays and the workshop training of students.\nNOTE KENTUCKY PUBLICITY\nIncluded in the packet you will find a tearsheet, showing plctorially\neducation in the hills of Kentucky. When we first saw the sheet we\nprevailed upon Elmer Sulzer to get one for each NaEB member. The\npublicity first appeared in the Louisville COURIER-JOURNAL on May 19.\nSOME FCC ACTIONS\nKWLC, Luther College, Decorah, Iowa, has requested modification of\nlicense to change hours of operation and facilities of KGCAo KGCA,\nDecorah, has been granted special authority to remain silent pending\nmodification of license for KWLC and arrangements with the station.\nWSUI, University of Iowa, applied for license to cover construction\npermit to increase power, install new transmitter and dlrectionul\nantenna. Application was made May £3.\nWBAA, Purdue University, was granted special temporary authority on\nMay £7 to operate extra hours on June 9th in order to broadcast\nPurdue’s complete Commencement Service0"
}