{
  "id": "d652-19",
  "text": "- 2 -\nAlso elected to three-year terms on the Board of Trustees were:\nLee E. Campion\nLou Kleinman\nPaul C. Reed\nJames A, Fellows was elected to a three year term as Trustee-at-Large.\nEDUCATIONAL RESEARCH AND COMMUNICATIONS CONVOCATION\nThe President announced that N.Y.S.E.R.T.A, would cooperate with the State\nEducation Department*s Educational Research and Communications Convocation\nbeing held in Albany during the week of November 18-22. N.Y.S.E.R.T.A. will\nparticipate in the program on Thursday, November 21. Details will be worked\nout at a later date.\nFALL MEETING\nThere was a great deal of discussion concerning the location of the Fall\nmeeting. Pinebrook Lodge was suggested as the site of the meeting, but\nseveral members felt it was inconvenient and that some people might have\ndifficulty with transportation if the meeting were held there. It was\npointed out, however, that one of N.Y.S.E.R.T.A.*s most successful meetings\nhad been held at Pinebrook in September, 1961,\nIt was finally decided that the Fall meeting would be held at Pinebrook\nLodge, Upper Saranac Lake, on September 12, 13, and 14.\nJohn Porter was appointed Program Chairman for the Fall meeting.\nCOMMITTEE CHAIRMEN\nA1 Fredette was appointed Chairman of the RADIO STATION ACTIVATION Committee\nto replace Jim Fellows who has moved out of the State.\nThe President asked the following Committee Chairmen to continue in their\npresent positions for another year:\nDOSSIER COMMITTEE - Donald Schein, Chairman\nTV STATION ACTIVATION COMMITTEE - John Porter, Chairman\nMEMBERSHIP COMMITTEE - Ruane Hill, Chairman\nRESEARCH COMMITTEE - Loran Twyford, Chairman\nENGINEERING COMMITTEE - John Soergel, Chairman\nCLOSED CIRCUIT TELEVISION COMMITTEE - William Millard, Chairman\nLEGISLATIVE COMMITTEE - Les Martin, Jr., Chairman\nLEGISLATIVE COMMITTEE\nDr. William Rock, Al Fredette, Donald Schein, and William Millard were\nreappointed to membership on the Legislative Committee."
}