{
  "id": "d138-178",
  "text": "\"ROLE OF THE CLASSROOM TEACHER” - Rim Content Outline page 2\ncontent of the course of study. (Salvage archeology\nor theater relics.)\n(3) to highlight some special event* observance, or holiday.\n(Easter Fires at Fredericksburg.)\nb. Demonstration of television used as total instruction where\nclassroom teacher has no knowledge of the subject or where\nthe classroom teacher must refresh his knowledge, relearn\nsubject content, or restore his proficiency in skills. (Topology\nor Spanish.)\n(1) Classroom teacher is seen in the role of learning participant,\ninvolved in absorbing subject matter or improving skills,\nwhile, fora time at least, television teacher provides\npractically all of the teaching.\n(2) To stress active rather than passive role of the learning\nclassroom teacher, film takes the classroom teacher\nout of the picture, showing that the class could\nreceive this part of its learning experience entirely\nfrom the screen. Film then puts classroom teacher\nback in the scene to illustrate that even where his\nknowledge of the subject is limited, he can still\ncontribute a great deal.\n(3) Classroom teacher is seen as a creator of classroom climate,\nstimulator of classroom attention and interest, leader\nof classroom response. By his attentive absorption in\nthe lesson, his readiness to follow the suggestions from\nthe screen, his patent interest, enthusiasm, and respect\nfor the television teacher, the classroom teacher is\nseen as providing a constructive model for student\nattitudes and reactions. His leadership is shown as\nbringing new vitality, focus of attention, depth of\ninterest.\n(4) Classroom teacher's leadership is demonstrated in his leading\nof practice or drill after the lesson on screen.\n(5) Film demonstrates that eventually these television lessons,\ncomplete in themselves, may be used as a major re¬\nsource among other resources in this classroom, such\nas:\nthe textbook. . .\nthe tape recorder. . .\nthe overhead projector. . .\nspecimens or artifacts\nall designed for one purpose only. . . to improve the\n1"
}