{
  "id": "d138-92",
  "text": "Outline - Film 2: Role of the Classroom Teacher Page 5\nThe Narrator explains that in addition to these long-range preparations for the\nclassroom teacher's specialized contributions to the learning situation, he has impor¬\ntant contributions to make toward weaving this one lesson into the total fabric of\ndynamic classroom activities.\nAs we see brief examples of these contributions, the Narrator mentions (1) review\nof preceding lessons, (2) motivation for introduction of a new concept, (3) physical\n^ preparations for effective viewing. (\"Coming into the lesson, you as an efficient\nteacher will be sure that the set is in good working order and ready for viewing.\"\nMay show pulling set over to the proper place, checking the monitor controls, etc.)\nMaking the point that the teacher is an active participant instead of a passive\nviewer during the lesson, the Narrator mentions that the class will actively participate\nin the lesson if the teacher sets the tone.\nAgain with brief demonstration examples, we leam from the Narrator that during\nthe lesson the classroom teacher will be appropriately involved with the class and\nthe lesson on screen, that, depending on the nature of the lesson, he will perhaps\n(1) simply pay close attention to the lesson on screen, (2) take notes, (3) help students,\n(4) participate with the group in some activity, (5) lead pupil response.\nThe Narrator makes the point that the classroom teacher is always aware, during\nthe television lesson, of what ishappening to his students. If trouble comes because a\nchild can't see, the teacher may move the pupil's chair to provide a better sightline.\nThe teacher may help a child with some process or point which is giving trouble.\nNarrator suggests that the classroom teacher may anticipate which pupils are likely to\nneed help during the lesson and put those children in an outside row, where the teacher\ncan attend to their special needs without distracting the attention of other members of"
}