{
  "id": "d1212-0",
  "text": "A E B\nm\nEngineering Newsletter\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 GREGORY HALL JUNE, 1958 URBANA, ILLINOIS\nTV TECHNICAL TIPS (April)\n—Cecil S. Bidlack\nThe first week in March I spent at Redwood City,\nCalif. Here I had the opportunity to take the five-\nday factory training course covering the operation\nand maintenance of the Ampex Videotape Recorder.\nThree days were devoted to the study of schematics\nand block diagrams of the various chassis employed\nin recording the video and audio signals of a TV pro¬\ngram on magnetic tape. For the last two days of the\ncourse, the students go through the setup procedure\nr as outlined in the comprehensive instruction manual\nfurnished with each recorder.\nr,\nThe Ampex Videotape Recorder consists of two\nstandard racks of electronic equipment and' the con¬\nsole, which contains the transport mechanism and\nother electronics. All rack and console wiring is com¬\npleted at the factory. In fact, the racks are bolted\ntogether and shipped that way. Each recorder is\nplaced in operation and given a final test at the fac¬\ntory to see that it meets operating specifications be¬\nfore shipment. When the equipment arrives at its\ndestination and is uncrated, installation consists of\nhooking it up to the 60-cycle AC power circuits, mak¬\ning video connections and the rack-to-console wiring.\nThis latter wiring is a very simple job with only three\ninterconnecting cables involved', two of which termin¬\nate in factory-mounted spade type terminal strips\nwhich connect to appropriate terminals in the end of\nthe console. The third cable contains ten coaxial cables\nwhich require soldered connections to the proper\nconsole terminal. Once these connections are made,\nyou are ready to begin the initial check-out pro¬\ncedure which is detailed step by step in the instruc¬\ntional manual.\nFor proper set-up and maintenance, a dual trace is\nrequired on the test oscilloscope. Ampex recommends\nNAEB Engineering Newsletter\nJune, 1958\nNAEB Engineering Newsletter, a quarterly publication issued\nby the National Association of Educational Broadcasters, 14\nGregory Hall, Urbano, III. $2 a year, edited by Cecil S. Bid-\nlack.\na Tektronix Model 541 with a dual input pre-ampli¬\nfier and also a high gain pre-amplifier unit for certain\nother tests. A reference tape for initial tests is sup¬\nplied with each unit as well as a micrometer depth\ngauge for measuring head protrusion from the rota¬\nting drum. A standard test tape is being developed\nwhich will be supplied with all machines. Degaussing\nis accomplished at present with the conventional bulk\ntype unit now used for erasing audio tapes, since the\nrecorder has no erase head. An accessory unit is now\nbeing developed which will make degaussing an auto¬\nmatic process for consistent erasure.\nThe recording tape has been vastly improved over\nthat orginally used. At one time rejections sometimes\nran over 90 per cent of the tape supplied to the user.\nAt present there is only one method of testing the\ntape and that is by recording a video signal and play¬\ning it back. This practice is recommended when a\nnew reel of tape is received. We used one reel of tape\nfor tests during the week, erasing it manually when\nthe occasion demanded. I saw no evidence of drop¬\nouts, which were once the major defect making the\ntape unfit for use.\nTo enable the tape to be spliced, an “edit” pulse\nis laid down along the bottom edge of the tape over\nthe control track. These pulses are “developed” by\napplying a carbonyl iron powder suspended in a\nvolatile fluid to the coated side of the tape. This so¬\nlution dries rapidly and the tape is cut by the use of\n1"
}