{
  "id": "d1105-6",
  "text": "-6-\nOn April 11, 1956, the FCC proposed rule making amending\nSections 3.66 (AM), 3.274 (FM) and 3.572 (noncommercial educa¬\ntional FM) of the FCC Rules and Regulations to authorize the\nremote control operation of all standard and FM broadcast stations,\nincluding those authorized to operate with directional antenna\nsystems or with powers in excess of 10 kilowatts. Present regula¬\ntions permit remote operation, subject to certain conditions, only\nby standard non-directional and FM broadcast stations authorized\nto operate with powers not in excess of 10 kilowatts.\nThe NARTB has completed a very extensive survey of this prob¬\nlem. As a result it has accumulated a large volume of data which\nshows that remote control operation of any station including those\nwith directional antennas is entirely possible and practical. In\nfact, the data shows that once the remote control operating and\ntransmitting equipment is properly adjusted, there are fewer\noutages with remote operation than when an operator is in attend¬\nance. As far as directional antennas are concerned, consulting\nengineers participating on a panel discussion of this problem at\nthe recent NARTB Broadcast Engineering Conference stated that\nonce properly designed and properly adjusted, these directional\narrays are one of the most stable elements of the transmission\nsystem. They recommended that once adjusted, the tuning houses\nshould be locked and remain locked and stated that a weekly check\nwas sufficient to assure maintenance of the proper pattern.\nComments on this proposal, Docket No. 11677 should be filed\nwith the Commission on or before June 1, 1956.\n*****\nNote for iHnflgcQpe recorder operators. Jack Chenoweth of\nKETC recommends the use of the following equipment as a means of\nobtaining matched camera shots for kinescope recording. He\nstates that KETC uses a Weston Photronic Model 594 RR photocell\nin conjunction with a Simpson Model 29 DC microammeter with a\n0-50 microampere scale.\nTheir method is to mount the photocell within the hood of\ntheir video recorder to measure the illumination from the picture\ntube. The cameras in use should be focused on the same scene\nwith the same focal length lens and at the same distance from the\nscene. The same peak to peak video voltage and pedestal levels\nshould be set. By switching between cameras, any difference in\ngray scale will show up in the reading of the microammeter. By-\nadjustment of beam, target, and perhaps lens stops, it is possible"
}