{
  "id": "d1292-0",
  "text": "1346 Connecticut Avenue, N.W.\nWashington 6, D. C.\nPhone North 7-6000\n7ol. II No. 8\nAugust 1963\nProposed Changes In Copyright Lav - Cause for Concern\nAt various regional meetings I have reported on the possible onerous changes\ncontemplated in the Copyright Law; it is time now to provide you with a fuller\nreport and indicate the extent of the impact the proposed amendments would have\nupon educational broadcasting.\nCurrent Developments\nThe present Copyright Law was enacted in 1909 and is out-of-date in respect to\nchanges in technology, business practices, and judicial interpretations. In 1955\nCongress authorized studies leading to general revision of the Copyright Law. In\n1961 the Register of Copyrights submitted a list of tentative recommendations.\nDuring the past year the Copyright Office has held several panel meetings to\ndiscuss these recommendations (in which NETRC and NAEB participated) and four or\nfive more such meetings are yet to be held. Following the panels, the Copyright\nOffice will complete a proposed bill in early ’64. Consequently, little time\nremains in which to influence the Register of Copyrights so that provisions in the\nfinal draft serve the best interests of educational broadcasting.\nSpecific Problem\nUnder present law, anyone may give a public performance of a copyrighted non-\niramatic literary or musical work, without the copyright owner's consent, if such\na performance is not \"for profit\"; thus, educational broadcasters may use copy¬\nrighted historical, poetical, and musical materials, so long as the material is not\ndramatized and such use is non-profit.\nIn the proposed draft bill submitted by the Register in Februsry 1963, there\nare alternatives proposed:\n1. Alternative A would retain the present \"for profit\" limitation.\n2. Alternative B would wipe out the \"for profit\" limitation and prohibit\nany performance of any copyrighted literary or musical work, without the\ncopyright owner’s consent, except for three exceptions, including\nperformance of a copyrighted work by an instructor or pupil in the course\nof normal teaching activities, and performance of the work without\nexpectation of commercial advantage and without any payment of the\nperformers for services."
}