{
  "id": "d1292-1",
  "text": "-2-\nThe Copyright Office explicitly stated that the purpose of Alternative B was\nto deny ETV any free use of non-dramatic literary and musical copyright material\nnow available under present law. '\nVigorous opposition to Alternative A (retaining the \"for profit\" limitation)\nhas been registered by music and book publishers groups. ;\nAlthough the present and proposed law provide certain exclusive rights to the\ncopyright owner by enabling him to refuse anyone the right to make and publish\ncopies and to print, reprint, publish and vend copyright material, the courts have\nevolved an implied limitation on such exclusive rights through the doctrine of\n\"fair use\". There is nothing in the statutes about \"fair use\", but the doctrine\nevolved by the courts means that copyrighted material may be used to a limited\nextent where such use is for a reasonable purpose which is noncompetitive with the\ncopyright owner’s market.\nHowever, there is much uncertainty about this area and no one can be certain\nof his legal rights to use copyright material under \"fair use\". There is no\nstatement of the number of words, lines, or notes that can be used without\npermission and mere achnowledgment of source does not avoid infringement.\n\"Fair use” is obviously of importance to educational broadcasters with their\nneed to use excerpts from copyright material for instructional, expositional, and\nillustrative purposes. But the uncertain application of the fair use doctrine\ndiminishes its value for education under the present law.\nThe Register’s Report proposes a statutory affirmation of \"fair use” and\nindications of its scope; however, the preliminary draft still does not define\n\"fair use\", but merely lists four factors which shall be considered in its\ndetermination. Thus, the proposed change, does not afford educational broadcasting\nany substantially greater certainty of protection than the present dubious status\nof the \"fair use\" doctrine. *\nActions by Educators\nOn July 23, the NEA convened a conference in Washington of representatives of\nforty-seven national organizations (including NAEB, NETRC) which have a stake in,\nand are vitally affected by, proposals for revision of the Copyright Law.\nThe group discussed the importance of working toward an expansion of\neducation’s rights under copyright law beyond the present limited and undefined\npattern which now prevails and the need to support educational exemption to insure\nthe full availability of copyrighted materials non-profit educational use by\neducational users.\nPrecedents cited for special consideration of education under law include:\n1. Historically, there is a long series of exemptions for education in tax\nlaws, postal laws, duty payments, etc.\n* The preceeding material is based upon a memorandum prepared for the NEA by\nHarry N. Rosenfield."
}