{
  "id": "d319-33",
  "text": "• 3\nThe Radio Italians Prize shall be awarded by the Italia Prize Juries,\nThe Juries shall choose among the entries submitted to the Italia\nPrize, after th© said Prize has been awarded* the most deserving work in\neach one of the two categories provided for in Art, 3 of the Italia Prise\nStatute.\n4\nThe sum allocated to the ft--die Italians Prize shall be equal to half\nthe amount of the sum allocated to the Italia Prise.\nTho sum in question shall, he paid to the winners in Lire by the\nSecretariat.\nUnder reserve of the Regulations specified in the present Appendix*\nthe rules of the Italia Prize Statute* \"mutatis -mutandis81, are applicable\nto the Radio Xtaliana Prize. , _\nf\nI\n1\nThe Prise shall be called the Italian Press Association Prize.\ns 2\nThe Prize shall be awarded every year to a work having the character\nof an artistic* literary or scientific documentary* a reportage or a\nmagazine programme* created especially for broadcasting.*\nThe Prize may not be divided.\n3\nEach Broadcasting Organisation participating in 'the. Italia Prise, may\nsubmit each year on© entry* under reserve of the regulations laid down by\nArt. 14, paragraph 2, of the Italia Prize Statute,\n4\nEntries submitted must have a maximum duration of 30 minutes.\nEntries forwarded to the Secretariat of the Italia Prize shall consist\nof s\na) two recordings in the original languagej\nb) a sufficient number of copies of th© French and English\ntranslation of the text;\nc) explanatory notes on the work.\nThe entries forwarded to compete in the Italian Press Association Prize\nshall form one of the •categories” mentioned in Art. 13 of the Italia Prise\nStatute,\n6\nThe sum allocated to the Italian Press Association Prise shell be paid\nin Lire to the winner by th® Secretariat.\n7\nUnder reserve of the Regulations specified in the present Appendix, the\nrules of the Italia Prize Statute, ^mutatis mutandis”, are applicable to\nThe Italian Press Association Prize."
}