{
  "id": "d319-52",
  "text": "Robert F. Wagner\nMayor\nWNYC\nWNYC-FM\nREenvEB\nTHE CITY OFNEW YOfck\nMUNICIPAL BROADCASTING SYSTEM\nMUNICIPAL BUILDING' ^55\nNEW YORK 7, N. Y.\nWHH*h*ll 3-3400 ; q January 6, 1955\nu^yprs'itVot iiDiiis4 '\nSeymour N. Siegel\nDirector\nMr. Frank E. Schooley\nPresident\nNAEB\nStation WILL\nUniversity of Illinois\nUrbana, Illinois\nDear Frank:\nI have your note of January 3rd and I am somewhat concerned by your mention\nof the series of \"The Investigator\". If this is the program that I think it is,\nit is a single one hour documentary which was broadcast by the Canadian\nBroadcasting Corporation on June the 4th of last year and which brought\nabout a Parliamentary Inquiry. It is now being bootlegged in the United\nStates because the rights could not be procured from the CBC. Outside\nof the implications of the script being written by a writer who was\nreportedly deported from the United States and the fact that no network\nin this country has so far touched the program, there is always the question\nof our relationship with the CBC. I hope, therefore, that if this is the\nprogram that you have in mind, that careful consideration be given to this\nby the network Subcommittee before any acceptance or any arrangement is\nmade to broadcast an illegal version.\nI have spent the morning with Hovey and drove him to Idlewild for his return\nto Rome. He is, as you know, doing a magnificent job and I have completed\narrangements with him for us to obtain additional series of musical programs\nbefore too many weeks have pasX&sf *\nThe Report from Prix Italia has just arrived and a note that our entries for\nnext year will be in the field of music and in the field of drama. We will be\nrepresented on the documentary jury so therefore we cannot make an entry\nin the documentary class. I hope that something can be done to obtain sufficient\nresource to really produce a prize winner. You, no doubt, were present at\nthe Convention when I made my report but this has now become a matter of\nextreme importance to the State Department inasmuch as NAEB represents\nAmerican prestige and it is essential that we really do something of great\nimport. It would seem that in view of the fact that we now can enter in the\nmusical field , that we consider commissioning an American composer to\nTlie Voice Of TTie City"
}