{
  "id": "d319-86",
  "text": ". Robert F. Wagner,\nMayor\nSeymour N. Siegel\nDirector\nWNYC\nWNYC-FM\nTHE CITY OF NEW YORK R j V£0\nMUNICIPAL BROADCASTING SYSTEM\nMUNICIPAL BUILDING\nNEW YORK 7, N. Y.\nWHit.hall 3-3600\nDQUARTERS\n**\n7i«i\n-i-P 26 i956\nPR\nl|2[3|4j6[6\nSeptember 26, 1956\nMrs, Judith Stevens, Newsletter Editor\nNational Association of Educational Broadcasters\n14 Gregory Hall\nUrbana, Illinois\nDear Mrs, Stevens:\nI have your note of September 21st concerning the Prix Italia Award.\nI am enclosing herewith a copy of the letter that I sent to Mr. Schooley which gives\nbackground information on the entire Prix Italia. I do not think that this material\nshould be necessarily published. 'Die information that should be of interest to you\nis that there were twelve (12) musical entries and three (3) documentary entries\nsubmitted to the International Relations Committee of NAEB. I arranged for special\njuries here in New York to listen to the entries and the Music Jury decided that the\nentry from the University of Indiana, \"The Ruby\" by Norman Dello Joio was the best\none to represent the United States. The Documentary Jury picked the Tony Schwartz\nproduction of \"Sounds of My City\" which was presented on WNYC. The documentary entry\nwon the Italian Press Association Prize of one million liras' The program, along with\nthe other prize-winning programs, will be made available to the NAEB Tape Network\nfor distribution to member stations.\nTony Schwartz is a young man (in his middle thirties) who has spent\nthe last eleven (11) years carrying a tape recorder about with him in the same fashion\nthat you or I might carry a camera. He has some 45,000 sounds of New York City. He\nrecently was one of the producers of a section of the program on \"Wide, Wide World\"\nover the NBC Television Network. He has had documentary programs broadcast over\nCBS and over Mutual. He first appeared on the radio on WNYC a half a dozen years ago.\nThis represents the second year in a row that an NAEB American Entry has won a prize.\nThis is in the nature of some sort of a record. Next year because NAEB will be on the\nMusic Jury, musical entries by NAEB will be out. There will be an opportunity, however,\nfor member stations of NAEB to submit entries in the field of drama and in the docu¬\nmentary field.\nNAEB is represented at the Prix Italia General Assembly by\nMr. Bernard Buck, Program Director on leave of absence from WNYC and presently NAEB's\nFulbright Scholar in Rome. It was represented on the jury by Miss Ruby Mercer who\nconducts the program, 'Mr. and Mrs. Opera\" on WNYC* and has a daily program on W0R.\nMiss Mercer has gone on from Italy to Israel where she will be recording several\nspecial programs especially in the field of music.\nTTie Voice Of Tfie City"
}