{
  "id": "d319-88",
  "text": "September 25, 1956\nHr* Frank Schooley, President\nNational Association of Educational Broadoastsrs\nStation WILL\nUniversity of Illinois\nUrbana, Illinois\nBoar Frank t\nI Have just received the bare facts of the nesting of\nthe General Assembly of the Prix Italia which was held at Rimini\non Tuesday, September 11th. Hr. R. Beseneon of the Swiss Broad-\ncasting System was elected President for this year. Hr. Richard Quartet\nof the Canadian Broadcasting Corporation was elected one Vice-President\nand Jon Boon of the Belgian Broadcasting system was elected the other\nVise-President.\nThe Prlx Italia Award for the best music program went to the\nNetherlands entry and is entitled, \"Jobe”. The Radio Italians prize\nin the field of music went to the Italian entry, \"Baronf§ Game\".\nIn the field of drama, the Prlx Italia was awarded to the\nFrench entry entitled, \"Arithmetical Problem\". The Radio Italians prise\nwent to the Swiss entry called, \"Balled for Tim\". In the documentary\nclassification, the NAEB entry, \"Sounds of Ky City\", was given the\nItalia Press Association prise. This latter amounts to one million lire\nor approximately $1600. According to the arrangements that ws have made\nwith Tony Schwartz, approximately a third of this will be sent to NAEB\nto defray our entry fees, translation charges, etc.\nThe observations and suggestions submitted by the Chairmen\nof the three juries run something like this: \"The high caliber of the\nwork submitted made the selection of winners difficult and the usual\npraise characterised the discussion in ell of the juries. The definition\nof \"documentary\" and the differences in understanding of the ward sparked\nlong discussions with the adoption of the BBC proposal to insert the\nphrase, \"based on actual fact\" into the statute. A sub-committee was\nappointed with membership from the United Kingdom, Monaco, Italy and\nLuxemburg to work on the problem and report back to the Secretariat by\nthe end of the year."
}