{
  "id": "d1261-0",
  "text": "■\nA E B\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 GREGORY HALL\nNAEB SCHOLARSHIPS AND WORKSHOP\nGRANTS-IN-AID\nEd. Note: The November issue of the Newsletter\ncarried a story explaining how application should be\nmade for Scholarships and Workshop Grants. How¬\never, a typographical error in that story led to con¬\nfusion on the part of some readers. Therefore, more\ndetailed information, with deadlines, etc., is printed\nbelow.\nSCHOLARSHIPS\nApplications for scholarships for study between June\n1 and Aug. 31, 1958 must be received at Headquarters\nnot later than April 1, 1958. Successful applicants\nwill be notified by May 1, 1958. The amount of the\nscholarship will depend on the length of the workshop\nor summer session to be attended, as follows: $75\nfor a week (5-7 days), $150 for two weeks (10-14\ndays), $200 for three weeks (15-21 days), and $250\nfor a summer session of six to eight weeks.\nA detailed announcement, setting forth complete\ninformation about these scholarships and how to\napply, was sent to everyone on the NAEB mailing\nlist several months ago. If another copy of the an¬\nnouncement is desired, please send your request to\nHeadquarters.\nWORKSHOP GRANTS-IN-AID\nThe Workshop Grants-in-Aid are intended to permit\ninstitutions planning summer workshops in television\nto upgrade the caliber of the workshop faculty by\nproviding funds to bring in outstanding consultants\nwho might be unobtainable otherwise.\nThese grants are not intended to completely fi¬\nnance workshops, but to supplement the budgets of\nalready planned workshops. As indicated below, com¬\nplete information about the proposed budget of the\nworkshop must be included in the application, and\nURBANA, ILLINOIS\nNAEB Newsletter\nVol. XXIII, No. 2\nFebruary, 1958\nNAEB Newsletter, a monthly publication issued by the\nNational Association of Educational Broadcasters, 14 Gregory\nHall, Urbana, III. $5 a year, edited by Hans J. Massaquoi.\nthe institution’s share must at least equal the amount\nrequested from the NAEB and should preferably be\nconsiderably larger than the amount requested. If\nfailure to receive a grant would prevent the applying\ninstitution from holding a workshop, no application\nshould even be filed.\nApplications, to be considered by the committee,\nmust be received at Headquarters not later than\nMarch 28, and the letter of application, plus any\nsupporting statements or documents, must be sub¬\nmitted in six copies. At the completion of the work¬\nshop a report must be submitted to the NAEB setting\nforth how the grant made the workshop more mean¬\ningful and effective, how many persons attended, the\nover-all results that can be anticipated from the\nworkshop, a complete accounting of funds (both\nNAEB and institutional) and any other information\nthat might be helpful to the NAEB in carrying on\nthis project in the future. Any funds remaining from\nthe grant must be returned to the NAEB.\nThe letter‘of application should include the fol¬\nlowing information: (1) who is sponsoring the work¬\nshop, (2) when and where it will be held, (3) the\npurpose of the workshop, (4) the proposed budget\n(indicating clearly how much the institution will\ncontribute and how much is requested from the\nNAEB), (5) the staff involved, (6) for whom the\nworkshop is primarily designed, (7) whether or not\ncollege credit will be given, (8) how participants are\nto be selected, (9) cost to the participants, (10) the\n1"
}