{
  "id": "d1261-3",
  "text": "parative literature met their professor, Dr. Floyd\nZulli, for the first time Jan. 18 while taking their\nfinal examinations.\nThe course, “Sunrise Semester,” was presented\nover WCBS from 6:30 to 7 a. m. on weekdays from\nSept. 23 to Jan. 10.\nStudents, who came from communities within a\n50-mile radius of New York City, were enrolled for\nthree points of degree credit. They had previously\nsubmitted a term paper and taken home quizzes. The\ncourse covered 16 works by novelists from Stendhal to\nHemingway.\n^ Due to the many viewer requests for increased\nprogramming on WTVS, Franklin G. Bouwsma, exe¬\ncutive secretary of the Detroit Educational Televi¬\nsion Foundation, has announced that starting the\nweek of February 10 WTVS will broadcast 64*4 hours\nof programs each week. To do this, Saturday pro¬\ngramming has been discontinued, but programs will\nbe carried continously from 9:00 a.m. to 9:30 p.m.\nMondays through Fridays and from 6 to 9:30 p. m.\non Sundays.\nPERSONNEL\n^ Dr. Keith M. Engar, program director of KUED,\nthe University of Utah’s educational TV station, has\naccepted an invitation by President Burton Paulu to\nserve as NAEB liaison officer with the American\nEducational Theatre Assn.\n^ Appointment of Garnet R. Garrison as director\nof broadcasting at the University of Michigan, Ann\nArbor, has been approved by the Regents.\nProf. Garrison, a member of the Department of\nSpeech faculty since 1947 and director of TV since\n1950, will serve as the administrative head for both\nradio and TV which up to now have operated inde¬\npendently under two directors.\n^ Samuel B. Sullivan, long-time Illinois school ad¬\nministrator, has joined the ETRC as a consultant on\nschool uses of TV, ETRC President H. K. Newburn\nhas announced. The appointment is for six months.\nSullivan served from 1943 to 1956 as superinten¬\ndent of the DeKalb (Ill.) Public Schools in which\ncapacity he directed a curriculum development pro¬\nject for all class levels.\nHe left school administration in 1956 to become\nconsultant to an architectural firm which designs\nschool buildings and has served in that capacity until\ncoming to Ann Arbor.\n^ Two NAEBers, Dr. Burton Paulu and Seymour\nSiegel, will participate in a seminar on educational\nbroadcasting and the dedication and formal opening\nof FM radio station WYSO to be held Feb. 8 on the\ncampus of Antioch College, Yellow Springs, Ohio.\nPurpose of the seminar, whose moderator will be\nDr. Edgar Dale of Ohio State University, is to “ar¬\nrive at a broad understanding of educational broad¬\ncasting and the opportunities presented to WYSO and\nother stations.”\nPROGRAMS\n^ The first news conference at the White House\nsince Oct. 30 with President Eisenhower answering\nvital questions posed by the nation’s press was tele¬\nvised Jan. 17 on KQED, San Francisco. It was the\n124th conference of this kind held by the President\nsince he took office five years ago.\nThe long interval since this regular weekly pre¬\nsentation was aired on the Bay area’s community TV\nstation was due in part to the minor stroke suffered\nby the President Nov. 25.\n^ “Discovery,” a series produced for the ETRC by\nWGBH-TV in Boston, has won the Sylvania Award\nas the outstanding local educational children’s pro¬\ngram. Another Sylvania Award went to the ETRC\nfor making it possible for ETV stations throughout\nthe country to receive films and kinescopes of educa¬\ntional programs of outstanding merit. Also honored\nwith a Sylvania Award was the National Broadcast¬\ning Co. for the educational TV project which it con¬\nducted jointly with the Center. This project involv¬\ned the provision of live educational programs for\nETV stations last year.\nThe Sylvania Awards were established by Syl¬\nvania Electric Products, Inc., to annually honor out¬\nstanding TV personalities and programs.\n^ Each Wednesday evening at 7:30 through March\n5 the Merrill-Palmer School in Detroit will present a\nTV program about camping in a series titled “Giant\nStep,” on WTVS, Channel 56, Detroit’s educational\nTV station.\nThe programs are designed to provide information\nof value to parents and to people interested in camp\nprograms for children.\n^ “University,” New York University’s educational\nTV series, has been selected by the Department of\nDefense for re-showing to servicemen and their fami¬\nlies at overseas bases throughout the world.\nKinescopes of the half-hour programs will go to\narmed forces TV stations at 23 isolated bases where\ncommercial video is not available,. The filmed shows\nwill be distributed by the Office of Armed Forces In¬\nformation and Education of the Department of De¬\nfense.\nThe series, designed to illustrate the aims and\ncontributions of an institution of higher learning in\nNEWSLETTER"
}