{
  "id": "d1261-9",
  "text": "DIRECTORY CHANGES (Cont.)\nP. 35 Delete: Arlington County Public Schools\nMiss Evelyn Thornton\n1426 N. Quincy St.\nArlington, Virginia\nKenmore 8-4032\nDelete: Virginia Museum of Fine Arts\nLeslie Cheek, Jr.\nDirector\nBoulevard & Grove Ave.\nRichmond, Virginia\nP. 36 Delete: University of Ottawa\nR. H. Shevenell\nDirector of Research\nSchool of Psychology\nAdministration Building\nOttawa, Ontario, Canada\nCentral 5-6751\nP. 39 Delete: WITJ\nAdd: WICB (in place of WITJ))\n(Under WRFK)\nAdd: WRPI (FM)* Rensselaer Polytechnic Institute,\nTroy, New York. (See WHAZ)\nU. OF T. GROUP TO SEEK\nCHANNEL ACTIVATION\nA new organization to seek activation of an educa¬\ntional TV station for the Central Texas and San\nAntonio areas has been assured by the Board' of Re¬\ngents of the University of Texas.\nThe regents approved University representation\nin an organization which will also include San Antonio\nschools and colleges and other educational institutions\nin Central Texas. The objective of the group will be\nto activate VHF Channel 9, now allocated to San\nAntonio.\nThe University will seek funds from private\nsources for equipment and for program operations\ncosts. A total capital investment of $300,000 and an¬\nnual operating funds of $50,000 will be required, it\nwas estimated.\nPRESBYTERIANS PLAN\nSUMMER SEMINAR\nThe Presbyterian Board of National Missions has an¬\nnounced a six-week broadcasting seminar to be held\nJune 23 to Aug. 2 at the Board-owned radio station\nKSEW in Sitka, Alaska.\nThe seminar, which will be limited to 10 Presby¬\nterian college students with a background’ and in¬\nterest in modern broadcasting, will entail the study\nof communications techniques, learning to prepare\nradio-TV programs, announcing, producing and di¬\nrecting.\nCost of . the fare to Sitka and back is $250. In\naddition each student is responsible for his round-\ntrip fare to and from San Francisco.\nInterested students should apply before March\n10 to Presbyterian Summer Service and Study Pro¬\njects, 808 Witherspoon Building, Philadelphia 7,\nPenna.\nIDEA EXCHANGE\nEd. Note: Efforts to start a regular “Idea Exchange”\ncolumn in the Newsletter have, ujp to this point,\nfailed to yield the desired response. In the hope that\ninterest in such column will eventually increase, and\nin the firm belief that such a column could be of\ngreat value to many members, we once again ask for\nyour participation. The proposed column, however,\ncan only be as regular as your contributions.\nThe item below is a sample of the type of con¬\ntributions we would like to include in an “Idea Ex¬\nchange” column.\nA unique tuition arrangement for students en¬\nrolled in TV courses televised by WTVS has been\nreported from the University of Detroit.\nTo enable students to own a portable UHF TV\nset, the University deducts the price of each set\npurchased at a University-approved dealer from the\nstudent’s tuition. If the student wishes to convert an\nold set, the cost is likewise deducted from his tuition.\nEach set comes with a copper ring indoor UHF\nantenna. If this is not satisfactory, he buys his own\noutside antenna.\nVENEZUELA ETV-RADIO\nPOSSIBILITIES STUDIED\nA $30,000 program to study the possible use of TV\nand radio in education in Venezuela has been an¬\nnounced in New York by the Broadcasting Founda¬\ntion of America.\nThe study will be made by a committee of Ven-\nzuelan educators with John Winnie, associate pro¬\nfessor at the Television Center, University of Iowa,\nserving as technical advisor. It will be financed by a\ngrant of $30,000 from the Creole Foundation. The\nlatter was established by the Creole Petroleum Corp.,\na United States firm, said to be the largest petroleum\nproducer in Venezuela.\n10\nNEWSLETTER"
}