{
  "id": "d813-22",
  "text": "4\n*\n6 or 8 or 10), 4) ws are beginning to expand through cooperation\nwith the Voice of America with which w© are now negotiating, 5)\nw© must moot the needs of the public schools with more programs\nand more ideas, 6) w© must fae© the problem of the distribution of\nprograms to the schools; the library of the tf. 3„ Office of Educa¬\ntion is about to die, Should thd NaEB take over? ?) wo mu3t expand\nour membership. In the past it has boon restricted to station\noporatoroo Should wo include teachers of radio, or does The Asso¬\nciation for Education b,/ Radio scot this need? 8) we need to sol'/©\nth© problems of upgrading of personnel and of academic curricula,\nand 9) wo need to examine the services provided our associate\nmembers* ^r© w© doing all we can?\nFinally, our greatest challenge is in educational television.\nWhat is our rol© to be? ttc are an advisory group to the Educational\nRadio and Television Center* Do we tell them what i® needed? Ar©\nwe a program* script e and film exchange?\nW© need to look for challenging visionary ideas such a© a landline\nor rolay^coxuieeted educational network. Working together, we can\nadvene® the cause of education, the cause of educational radio,\nand th© cause of educational television*\n* * ♦ * *\nEarl Wynn then led a brief discussion period® The question was\nasked, \"How about a mobile television unit bo act both as a central\nservice and a demonstration device?” It was pointed out that as\na central service It wouldn't bo needed because th© program center\nwould probably solve th© program distribution problem; that as a\nsupporting device for educational ©tail one, both Now York and\nConnecticut visualized joint ua© by all their stations of mobile\nunits * However, mobile units are expensive and those who have\nthem ar© not using them much, though of course it is possible to\ncut down on th© cost by building one’s own mobile unit. It was\nthen suggested that perhaps film units could do the work expected\nof remote truck® and that th© sharing of a kiaoscopie recording\nunit might bo more helpful to educational television stations*\nThe potential of tape in TV was discussed, the prediction having\nbeen made in Broad easting by Crosby*© chief engineer that TV tape\nwar. practically here.* ^h© technical consultant from DuMont Labora¬\ntories pointed out that there was a question here which the Crosby\nEnterprise© haven't answered; i.e.. How to accommodate a rang©\nof froQueneios which runs into th© millions of cycles? Must w© rum\nthe tap® at one thousand times th© speed of audio tape? Also*, if\ntap© came in, th® 16mm projectors' in film libraries now set up in\nth© schools might become obsolete. Tap© is likely to represent\nserious economic problem©. Th© question was then raised whether\nor not there was a word wo could u®« in th© place of \"education”:\nMr. 3iogol asked th© floor and pointed out that education was th©\nbasin for everything, that it is as unnatural to stop learning at\nago 14 as it is to die at ag® 14, that everyone has a deep vein\nof seriousness and want© to improve himsolf, to know why. Reference\nwas mad© to the speech by Arthur Adams at the Atlanta Conference,\n\"Education Is a Good Word.” Th© discussion period elosedo\nMembers adjourned to lunch at th® Monogram Club, carrying on\nindividual discussions during th® lunch period©"
}