{
  "id": "d813-26",
  "text": "The NCCET also was established by Th© Fund for -idult Education.\n..*ilton -Siscnhower and Marion Foleon' ar« its Honorary Co-Chairmen.\nIt is a very high powered and affective oreanizatioa*\nThere is a third organization also in the picture,aloo recently setup\nby the FAS funds. The Educational Television and Radio Program\nCenter of which George Stoddard, President of tho University of\nIllinois, is President of the Board, C. Jcott Fletcher of the FAB\nand Dick Hull are members. Others include Dr* Robert D„ Calkins,,\nPresident of the Brookings Institution, Harold D. Lasawell of the\nYale Law school, and Mr. Ralph Lowell of Boston, banker end trustee\nof the Lowell Institute, which operates the non-commercial educa¬\ntional FM station in that city. These are educators of stature.\nThey plan to produce very few programs themselves but to farm out\nthe work, after th© area of study has been selected, to educational\ninstitutions or commercial organizations* They will act principally\nas a Distribution Center. The N« £B has boon the onlj' organization\nto provide an advisory Committee to the Center, This committee ha®\nbeen selected; George Probst of Chicago, H* B0 McCarty of Y/iseonsin,\nGraydon ^usmus of Alabama, and Robert Hudson of Illinois (University\nof Illinois).\nThe FAE has offered matching funds to 13 key potential stations*\nThe selections have been made, primarily, on the basis of popula¬\ntion,and educational grants may follow* No announcements have been\nmade of this.\ntfhat has been the effect of all this high-level activity? There\nare 22 to 24 applications in around the country, 13 or 14 construe^\ntlon permits have been granted, and plana for activation are\nrapidly taking shape in a dozen or more places* The station at\nHouston0 Texas will soon be on the air* The station in Los nageles\nexpects to be on th® air April 24« Typical of the activity was tho\nstate-wide mooting in Florida on February X3-I4: tho Governor’s\nConference. The JCET, NCC3T, and DuMont Laboratories have been\nflooded with request® for consultants* Miami has an application in\nand there is promise of some equipment* Gainesville i© making plans\nto go ahead, and Tallahassee likewise* The Citizens Committee of\nthe JCET will be down there shortly. By June 2 in Florida w© can\nexpect 4, 5, or 6 applications to bo in*\nOf oourse, all over tho United States the Educational Television\nforces are fighting the ’economy cry’. Television is expensive,\nbut compared to normal educational costs, the cost of educational\ntelevision is insignificant, and we must view the coat in comparison\nwith the total cost of education because educational TV will have\nan effect of great magnitude on the total educational effort*\nMinnesota’s legislative hearings are now going on and Burton Paulu,\nwho was to have been at this conference^, is at those hearings*\nIn ilsoonsin the plan was to install one or two stations this\nyear and keep th© other allocation®. This apparently will bo th®\npattern in many places*\nIn New York the Report of the Governors Commission has mad© things\nlook discouraging on the surface and has undoubtedly had ill\neffect© elsewhere, but Now York will go ahead with private funds\nand at least th© report of tho Commissi on and tho accompanyinr"
}