{
  "id": "d813-31",
  "text": "13\nthe earn© course as given in Western Reserve classrooms. Thera\nwaa an audience of 50c000 people from 9:00 to 9-*30 each morning\nfor thin show, Truoc this program was on a commercial atat ion9\nbut ©ducatora must tako into account the possibility that commer-\noial tel©caster® will not always be able to guve them th© time.\nHe asw such hires as Iowa’State’s wThe Whole Town’s Talking” -\nentertaining; onlighteningB and skillfully don©, and, more impor¬\ntant, a program with an effect on th© life of the state* As a\nresult of this program* many things got dona in Xowac\nHe sew that educational television could create something for a\nminority audience, that it could present th© whole gamut of educa¬\ntion* His horizons were widened, and unlimited possibilities of\nwhich he had never d2*eamed before now cam© into view®\nHowever, he went on to nay, educators are going to have to remember\nthat television is merely a mechanical channel through which we\ncan think and act, Success lies within our capacity, but we will\nnevor bo better than our willingness to obey ail tha rules of show¬\nmanship required to make tha medium effective*\nReferring to hie own experience* Mr, Kyser said that whenever he\nhad been successful it had been on th© occasions when h® had used\neverything hs had. If a man finishes?, a show and coiaoa off stage\nsaying,, \"Gee, what a sorry audience,1’ he is blaming the audience\nfor his own inof f ect i vene o© . Ho has not done a good job. w .'if feet\nhaa never controlled cause and never will,” And this is tru«> not\nonly of professional show business*, but it i® going to be equally\ntrue of \"academic ©how businoos-’ whatever audience level any\ngiven show is programmed, ?re must aim for and hit the bull’* eye\nwith that specific audience, rt© cannot shut our eyoe and r/hooto\nIt will be hard, toot in television because it is always hard when\nyou are not rubbing shoulders with the audience. It is hard with\nmovies to know how well you ar® doing® Having done that, too, this\ncould be said out of experience. Of coups® you can always go to\nsee your movies?,, but this can b@ too hard. When the audience is,\nnot out there in immediate contacts it Is very easy to get lax* and\naudience receptivity is going to be the teat of educational tele¬\nvision* Xe will learn, of coureo; we will got better. Of the 13\nkinescope© done here at the University of North Carolina, th«>\npercentage of good ones, h© thought* was terrific. But those most\nclosely involved knew that many wore not es good as they had wanted\nthars to bo and ttiat„ if they war® dona over, there would be thing©\nthat would b$ done differently. Thie attitude is essential®\nHe was convinced that educational television can be the greatest\nforce in cur generation, the greatest force for education\nsine© the Invention of the printing press. But every bit of show¬\nmanship which can b© developed will be needed because people* ©agar\nas they arc to b® challenged, are reluctant to admit that they want\nto\"be educated.” They will be interested in education if we can\nproduce something that piques their interest. Even on the elementary\nlevel of \"Ths College of Musical Knowledge” where no mental ca3Is-\nthenicss were called for, thare was some challenge to the listener."
}