{
  "id": "d813-32",
  "text": "“14 “\nalthough some of th® quest!ou& were oa th© level of \"Who says 8\nfLo!^GS 'speaking?*, on two occasions h@ had received wrong answers.\ntfkaa people expect eat©rt©lament0 they do not want to toe! that\nthey ar©~being educated. When they expect education and receive\nit ©nt©rtaiainglyp then we have rung the hel3.« Entertainment in\neducation does not mean dilution* it means interest. BonH think\nthat because people ought to want ©due&tioa, thoy will. It must b©\npresented as ohalleagingTy and provocatively as possible.\nA eao© in point of the failure to understand what showmanship\nyea11v is was the comment of one educator on the Psychology aerie©\nmentioned earlier, that \"This was done without one hit of showman¬\nship.\" In the first place, the eerie® required that the lecturer\nboil down his material from 50 minutes to 29 minutes 5 that meant\nthat ho eoul-5 act wander as he might otherwise; that his material\nhad to fee edited carefully; that hs had to punch his points to get\nthen across. This is the essence of showmanship; th© minute h®^\nstarted editing* ho was la show business. Any effective ©ommunica-\ntor is in show business.\nXn his own experience, Mr. Kyser paid tribute to a motion picture\ndirector who had him work oa the simple problem of going through a\ndoor from 9:00 in the morning until 2:00 in th© afternoon before\nthoy got a take. A lot of little things were ‘involved. It if? these\nlittle things that will make or break many educational television\nshows; such things aa not dropping your eyes in front ef th© camera\nbut keeping in contact with th© invisible audience*. Everyone who\ntouches educational television must try to put all the possible\nshowmanship into it that h© can.\nS&usat:!©n&l television la on the soundest ground in th© world. In\ncommercial television th© problem is #the word*- the plot* th©\nmessage, what to say, what to do; and *fch© word is getting thinner\nsad thinner. But for educational television we have an endless\nfountain of knowledge. *The .word* is what wo have the most of«\nThen too, our actors have th© essential ingredient of great perfor-\nmane®: conviction. Thor© is no need to worry about how you look on\ntelevision; if you have the conviction, it will show in your eye©\nand you will invito people up through th© tub®.\nTh© future of this great opportunity and challenging responsibility\nis ours: to take to all the people the storehouse ef wisdom and\nknow-how accumulated by our colleague® and their prodecoasor®.\nTker© i© a groat part that the educational tel©caster© can and must\nplay in getting educational TV off th® ground. And after thatft\nho* high it flies is up to them. '-They arc the pilots. -\n4 * * ❖\nAt th© close of th© banquet, members adjourned to Studio A at th©\nCosaunieation C©at©r whore they wor© tha guests of SVftC for its\ndedicatory broadcast which was carried over a state-wide North\nCarolina network. The high point of tho dedication was th® drama¬\ntic production written, and directed by John Clayton of th© Comrauni-\ncation Center staff. This was followed by a tour of th® Communica¬\ntion Center facilities."
}