{
  "id": "d813-38",
  "text": "- 19\n.\nof the Coromunication Cantor which has as its coal th® sitsnsion\nof th© University to all the peopl© through ail th® mass media\nof eoamuflication« WUNCe therefor©, has - in theory at least -\nno permanent staff and no budget* In practice^ on® staff member\nof th© CoEsunication Center de^otos approximately two-thirds of\nhis time to the 3tation8 end th© student engineer is paid; all th®\nrest of th® help is voluntary® tfUNC has made a considerable effort\nin th© area of foreign-origlnoted programs® The Communication\nCenter’s additional radio activities include producing special\nprogram series for other agencies® One series underway at th®\nUniversity lsaAM2RICAN ADVENTURE, being produced under a grant\nfrom the IJAEB-FAE, A number of C ommuni cation Center series are\ncarried on commercial station® either by tape or FM networks Nor h\nCarolina being extremely fortunate in the great number of active\nKM stations in th© state®\nTelevlsion\nTh® first activity in educational television in the Stats of North\nCarolina was the Consolidated University’s conference last June,\ndrawing together 150 deans and administrators from the three\ncampuses® ^fter two day® of study, upon the advic© of th© conferees,\nth© University formed a Television Advisory Council, directed the\nCommualeat1 on Center to produce 13 kinescopes9 directed the writing\nof a 115-page volume on theory, costs, and administration of eduoa*\ntional television in th® University, and recommendad the sppeintrant\nof a 6tat@ Television Commission.. Governor Umstead has appointed\nsuch a Commission, and Earl Wynn has besn appointed its Executive\n.Secretary, Local committees have been formed in each of th® eight\ncommunities to which allocations wore made, and there have been a\nnumber of moetiags, stat e«wido and community y-wifie, in an effort to\nget the beat possible plan. It might b® said that \"everyone has\nmot everyone else*\" President Gray has made th© point that the\nUniversity will activate no more than one channel, Channel 4, in\nChapel Hill, The other 7 allocations are the problem of the roe\nof the state* If the University does activate Channel 4? it will\nbe a completely educational, non*commercial venture, Thor® will\nbe studios on all three campuses, Th© £tafcefe position is that it\nwill engage ia enough activity to demonstrate intent and thus\nreserve the other channels. Several communities, however, may g)\nahead on their own on a small scale. No money has been requested\nfrom th® legislature for th®’next two years except for study purioaeo\nThe University ia seeking private funds to activates Channel 4.\nSOUTH CAROLINA: Ernest Lent0 WUSC8 University of South\nCarolina,\nRadio\n>nn?<r~is the only educational radio station in South Carolina, The\nproject was conceived 13 years ago and has now been on the air\n9 ®e©k8. This is a lQ»watt station, programming 37 hours a week*\n$U3C carrier 4 NAEB shows in th® morning which are repeated severe!\ntimes and carries, in addition^ 16 NA3B adult shows for a total of\n10 hours of programming a woe!r. They also carry a number of trans¬\ncribed shows,. Staff ia as follows: I!r. Lent has a third class\ntickot; tkei*® ia a etudsnt with a third class ticket. It is diffi¬\ncult to get student interest because ther® ia a carrier current\nstation on campus which operate® with no faculty supervision; the\nstudents hav® ’cart© blanch®* in programming and operation., Since"
}