{
  "id": "d813-45",
  "text": "26\n3)\nMewaletter;\nto ¥©nd in our programming needs if NAEB doesn't\nhave thorn. If several ask, than perhaps something\ncould b© done. Or, if NaSB can't moot a specific\nneed, perhaps a member can*\nB. Scripts.\n.To provide) scripts for exchange and tc tell what is\nneeded in scripts.\nC. Research..To offer oureolvss, particularly classroom teachers,\nas resource persons for program dovolopment, using\nteachers Instead of script writers.\nOno of our biggest worries was the fear that th© \"participation*\naspect for those taking part in TV would bo forgotten - and the\nterrific motivation and values that arose out of it* particularly\npublic schools.\n* * *\nTh© report for Group II was presented by Mr. Vernon Bronson, and\nGroup II recommended the following:\nWhere possible,group tape offerings into blocks of 13-wook series,\n^Suggestion not intended to discourage special program offerings.\nTh© establishment of a screening committee in each region to\nwhich members within the region would submit programs considered\nby th© member to b© worthy of distribution. The regional\ncommittee would act on each program submitted, by:\n1. accepting th© program and rocoranending it for national\ndistribution, la which caso it would be forwarded to\nnational head quart©rsf th© program would fall into alter¬\nnative categories listed as follows:\n2. accepting the program for regional distribution,, in which\ncase it would arrange for regional 4iatribution,\n3« rejecting the program for distribution0\nTh© establishment of a system of diattribution,on a regional basis,\nof pi’evi ously distributed programs. This may bo accomplished\neither by a regional dopoalttoi’y or by expanding national head¬\nquarters o\nInterests of educational broad east era . can best be served by using\nth© already existing machinery of th© NAEB for planning, produetio\nand distribution of educational programs on film from the Chicago\nEducational Radio and TV Cantor. Members of the NASB will look\nto their own organisation for leadership.\nThat th© NASB explore the possibilities of obtaining' LP records\nwith program notes including timing from all recording companies*,\neither fro© or at reduced prices for NASB active stations.\nThat all sources bo explored to obtain funds to produce programs\non all levels of education* **lso to obtain funds for scholar¬\nship®, int ornshipe „ and fellowships for representatives of all"
}