{
  "id": "d813-63",
  "text": "- 5 -\n(d) the monthly tape production in February, 1950 - 17 reels; at the start of\nthe Kellogg Grants - 53 reels; 4 months later (May, 1952) - 1061 reels. Wow\nthe weekly output is 950 to 975 reels, (e) the new timing device was shown, (f)\nthe Master Board device was pictured, (g) speed reduction on the Ampex from 15\nto 7q i.p.s. was shown, the point being made that at this stage in the distribu¬\ntion process, openers and closers added to the shows were necessary, and the\nplea was made that contributors do the opens and closes themselves. It was\npointed out that the Ampex does the single dubs which are necessary, (h) the\nduplicator was then pictured and described, and it was pointed out that it is\nnow operating at its maximum with the present staff, between 950 and 1000 reels\nof tape for a 40-hour week, (i) the distribution method through \"the binn was\npictured and described in detail, (j) the paper routine was shown, (k) the dis¬\ntribution of stations through 30 states was shoxvm, (l) the income charts with\nnew rates were projected, and it was pointed out that the new rates would be\n8 times the present rate, so at the close of the Kellogg support, the NAEB in¬\ncome from memberships will be between §32,000 and §35,000, that this was the\ncheapest programming one can get, and finally, that the network was constantly\non the lookout for good shows.\nIn the discussion period, the question was asked if a program, when submitted\nand refused, could be resubmitted. After some discussion, it was finally sug¬\ngested that one resubmit with supporting arguments. Frank Schooley then dis¬\ncussed very briefly the Newsletter asking that the news items be sent to head¬\nquarters and pleading prayerfully that they arrive by the deadline of the 25th\nof the preceding month. He pointed out that the editor was looking for general\nstories of any kind dealing with educational radio-TV and was much interested\nin getting more material from the field. In the area of research, Mr. Schooley\nsaid that headquarters was looking for suggestions as to what research NAEB\nshould undertake and what would be of most value to individual members. He\npointed out that where members initiated studies, NAEB might be able to help\nplan and integrate them. He referred to the monitoring studies which had been\nmentioned earlier in the day, specifically that the New York #3 TV Study would\nbe out shortly, and he mentioned as of particular interest to all educational\nbroadcasters the study of effectiveness of promotional work in connection with\neducational programs which has just been conducted by Station HILL.\nSeymour Siegel followed Mr. Schooley with \"Our National Radio Programs.” What\nhave we done with the §300,000 grant? Our only restrictions were that we pro¬\nduce 4 programs, one in each of the following areas: (a) American Heritage,\n(b) anthropology, (c) public affairs, (d) international affairs.\nThe show which was finally written under (a) was THE JEFFERSONIAN HERITAGE, with\nDumas Malone as consultant, Frank Papp as producer, and Claude Rains as Jeffer¬\nson. Five writers were used in the show.* This is a '’consumer durable\" and\nwill be just as good 20 years from now as it is today. The show has had wide\nrelease, tremendous promotion, and The Fund for Adult Education is very proud\nof it; we are proud that the FAE is proud. We have proved that, as educators\nand given the resources, we can do the job.\nPEOPLE UNDER COMMUNISM had the consultative assistance of the five top Russian\nexperts in the country. This was the most expensive show to produce because\nof the vast research involved. In fact, it turned out that we were financing\na major research project, and so it became necessary to cut back the research\nscope. However, it is a good series which makes it possible for the listener\n*There was some indication, in fact, that several of these may have been used up."
}