{
  "id": "d813-79",
  "text": "-21-\nThey hope to produce educationally significant materials. NAEB is working very\nclosely with the Center. What would the ’grass roots’ people like NAEB do? At\none point, NAEB planned to establish a film distribution center, but this plan\nhas temporarily been suspended. Your international committee found 1800 films\nabroad which will be useful. In addition, there are tremendous resources at the\n’grass roots’ level. A film operation can be much less expensive than many be¬\nlieve, and not every station has to be a production center. On the other hand,\nthe best program source in the world for local stations is going to be the local\ncommunity, and the educational station should make itself available to all com¬\nmunity agencies. What is needed is faith. We have to get on the air and be\nconfident that we can program.\nShould a student who wants to go into educational television get a Master’s de¬\ngree? In Illinois the decision has been made that training in television will\nbe a fifth year study. A similar decision has been made in North Carolina.\nThere have been some very bad experiences with educational radio-television con¬\nsultants trained in the media but knowing nothing of education. There is a real\nneed for trained personnel who know both education and the media.\nHow can we get accurate and adequate information on costs in television? The\nestimates made by Arthur Hungerford as far back as the Penn State conference\nare available in mimeographed form from the JCET. Also, manufacturers, when\ngiven the exact requirement of a given community,will give an exact estimate.\nThe discussion closed with a brief word from Hr. Siegel who informed the mem¬\nbers that the Beacon Press, Boston, Massachusetts, will be publishing the\nscripts of THE JEFFERSONIAN HERITAGE and WAYS OF MANKIND in book form. These,\nwill be available in 350 pocket editions, and it is anticipated that there\nwill be a big demand for them. Three new programs are available to NAEB mem¬\nbers: 1) A REVIEW OF BRITISH WEEKLIES, 2) CEC’s: OVER THE BACK FENCE, 3)\nMutual Security Agency’s: LETTER FROM ITALY. These are available through Mr.\nSiegel at WNYC.\nFinally, it takes a third class ticket to operate an educational transmitter.\nEvery educational broadcaster should get a third class ticket; infect, he\nought to go on and get a second and a first.\n’’This is an endless adventure, be Ye of good faith.”\n#****###*#\n2:00 p.m. Small Group Discussion: HOW CAN NAEB HELP US?\n3:00 p.m. ” » « HOW CAN WE HELP, OURSELVES & NAEB?\nDuring the afternoon, the Workshop divided into four groups as indicated below*\nEach group chose a chairman and recorder. Two chief topics were discussed: How\nCan NAEB Help Us? and How Gan We Help NAEB? The discussion continued to 5:00 p.m.\nat which time recordings, films and kinescopes were available for listening and\nviewing.\nGroup II:\nVernon Bronson, Chairman\nRalph Sears, Recorder\nC.R. Graham\nDan Matthews\nJack Westbrook\nRichard Wilson\nJohn Young\nGroup I:\nMrs. Camille Halyard, Chairman\nMozelle Causey, Recorder\nBenjamin Aycrigg\nL.0. Brackeen\nGeorge Booley\nMrs. Zelda Kosh\nCharles Maclnnis"
}