{
  "id": "d813-81",
  "text": "-23-\nW\nE. Exchange Bureau-to help the region set up a way to exchange radio and TV\nscripts. Conferees are aware of the need for local programming, but a\nscript exchange would be useful in certain areas, such as literature, which\ndoesn’t have much localism.\nHow Can We Help NAEB?\nA. Programming: l) to offer suggestions in which ways programs can fit into mod¬\nern school procedures (hours, flexible curriculum, etc.);\n2) to send in list of our local programs so that an exchange\ncolumn page might be used in the Newsletter;\n3) to send in our programming needs if NAEB doesn’t have them.\nIf several ask, then perhaps something could be done. Or, if\nNAEB can’t meet a specific need, perhaps a member can.\nB. Scripts.To provide scripts for exchange and to tell what is needed in\nscripts.\nC. Research.To offer ourselves, particularly classroom teachers, as resource\npersons for program development, using teachers instead of\nscript writers.\nOne of our biggest was the fear that the ’’participation\" aspect for those tak¬\ning part in TV would be forgotten - and the terrific motivation and values that\narose out of it, particularly public schools.\nThe report for Group II was presented by Mr. Vernon Bronson, and Group II\nrecommended the following:\nWhere possible, group tape offerings into blocks of 13-week series. Suggestion\nnot intended to discourage special program offerings.\nThe establishment of a screening committee in each region to which members\nwithin the region would submit programs considered by the member to be worthy\nof distribution. The regional committee would act on each program submitted\nby:\n1. accepting the program and recommending it for national distribution,\nin which case it would be forwarded to national headquarters, the\nprogram would fall into alternative categories listed as follows:\n2. accepting the program for regional distribution, in which case it\nwould arrange for regional distribution.\n3. rejecting the program for distribution.\nThe establishment of a system of distribution, on a regional basis, of pre¬\nviously distributed programs. This may be accomplished either by a regional\ndepository or by expanding national headquarters.\nInterest of educational broadcasters can best be served by using the already\nexisting machinery of the NAEB for planning, production and distribution of\neducational programs on film from the Chicago Educational Radio and TV Center.\nMembers of the NAEB will look to their own organization for leadership.\nThat the NAEB explore the possibilities of obtaining LP records with program\nnotes including timing from aLl recording companies, either free or at reduced\nprices for NAEB active stations."
}