{
  "id": "d813-82",
  "text": "- 24 -\nThat all sources be explored to obtain funds to produce programs on all\nlevels of education. Also to obtain funds for scholarships, internships,\nand fellowships for representatives of all levels of education.\nThat all reels be labeled with program titles and reel sequence.\n##**#####\nThe report for Group III was presented by Mr. Walt Whitaker. The following\nrecommendations were made:\nPromotion of ,NAEB Tape, Network Programs\nThe need- for a survey of promotion for tapes was discussed, both on the\nlower level and from NAEB. (l) Information; (2) Mailing piece; (3) Gim¬\nmicks. It was' emphasized that promotional materials are needed in advance.\nRecording and ET Vs (Program,and Production..Aid)\nThe need for some centralizing agency (NAEB) furnishing information on avail¬\nable materials of this sort was brought up. Some schools do not have a suf¬\nficient number of records and ET's for their use. It was recommended that\nNAEB compile information that would be useful for the member stations in\nwriting away for ET*s and for transcription services. Also, that NAEB con¬\ntact recording companies for the purpose of arranging free distribution of\nrecords or for buying the records at a reduced rate. It was mentioned that\nno help has come from either the recording company or the distributer when\nthese companies were approached by most individual stations.\nPublish a list of companies which in turn publish the time of music.\nAcceptance Comintttf.p (Uniformity of Materials)\nRevise the rules and standards on the programs in regard to the timing of\nthe programs under consideration for distribution. Eliminate excessively\nlong talk programs. Conform.to radio timing.\nFarm out program ideas to the regional members, for NAEB coverage with or\nwithout budget assistance — or. the individual members for production in\nfield in which certain schools excel. One of the chief purposes being\nto avoid duplication in production.\n•NAEB and the Chicago Center\nThe unanimous Heeling -about this ..matter was that NAEB should not be subor¬\ndinated to the Center inasmuch as the years of work would be in jeopardy,\nthat the former organization should control the selection and distribution\naspects of the programs to educational stations.\nUp-Grading Personnel for Radio and TV (Encourage students)\nA broad knowledge of the field should be required as well as specific\nknowledge. The pay scale should be as high as it can go to fit the local\npicture. NAEB should help survey the field for the purpose of setting up a\nplacement bureau. The Newsletter should serve as a job-information source\nfor education radio—TV persons instead of Broadcasting."
}