{
  "id": "d813-9",
  "text": "“MANY THANKS FOR INVITATION TO YOUR MARCH MEETING. FORTY TO\nFIFTY DOLLARS WOULD COVER NEEDS DEPENDING UPON SHARED TRANSPORTATION.”\n(Signed) C. P. MACINNIS, Director\nInstructional Materials Bureau\nCity Public Schools\nColumbia, S. C.\n\"MR WYNN I WILL MAKE EVERY EFFORT TO ATTEND MEETING OF REGION TWO\nNAEB MARCH I3-U4.. I WILL STAND TRAVEL EXPENSES IF YOU CAN PROVIDE\nFOOD AND LODGING DURING STAY. WHAT ARE YOUR PROGRAM PLANS?”\n(Signed) WILLIAM FELTON\nRadio Director\nMississippi State College\nStarkville, Miss.\n\"INTERESTED IN ATTENDING. REQUIRE APPROXIMATELY FIFTY DOLLARS PLANE\nTRAVEL AND EXPENSES. ADVISE IF SATISFACTORY. PLEASE MAIL DETAILS OF\nCONFERENCE SOON.\n(Signed) Z2LDA HORNER KOSH\nSupervisor, Speech Education\nArlingtoh Public Schools\nArlington, Virginia\n\"MR. RICHARD WILSON, PROGRAM MANAGER OF RADIO STATION WHPS HIGH\nPOINT HIGH SCHOOL WILL ATTEND NAEB SEMINAR WORKSHOP MARCH 13 and llj.\nIN CHAPEL HILL. WILL YOU TAKE CARE OF COST OF TRANSPORTATION, MEALS\nAND ROOM?\n(Signed) D. P. WHITLEY\nPrincipal, High Point High School\nHigh Point, N. C.\n\"APPRECIATE INVITATION. PLEASE PARDON DELAY. JUST RETURNED FROM\nCORCORAN JURY. UNFORTUNATELY WE OPEN A MAJOR EXHIBITION ON MARCH 13\nWITH OTHER ITEMS ON FOLLOWING WEEKEND. SUGGEST SATURDAY AND SUNDAY\nli| and 15 MARCH. MUSEUM CAN PAY HALF MY EXPENSES IF NAEB CAN AFFORD\nOTHER PORTION. CORDIALLY.\n(Signed) LESLIE CHEEK, JR.\nRichmond, Va. via Champaing, Ill.\n\"AM PLEASED TO ACCEPT YOUR KIND INVITATION TO NAEB SEMINAR WORKSHOP.\nDUE TO LACK OF STATE TRAVEL FUNDS WILL APPRECIATE ALL POSSIBLE\nFINANCIAL AID. THOUGH YOU MAY COUND ON MY ATTENDANCE DESPITE ABOVE\nSITUATION.\n(Signed) RAYMOND D. CHEYDLEUR\nDirector Educa. Radio-TV\nMarshall College\nHuntington, West Virginia\n\"WOULD BE DELIGHTED TO ATTEND NAEB REGION TWO MEETING IN ABSENCE OF\nKEN WRIGHT WHO IS ON TEMPORARY LEAVE. OUR TRAVEL FUNDS ARE LOW. ANY\nASSISTANCE WILL BE APPRECIATED. UNDER ANY CONDITIONS WILL MAKE PLANS\nTO ATTEND.\n(Signed) JACK WESTBROOK\nActing Director, WUOT\nKnoxville, Tenn."
}