{
  "id": "d1746-5",
  "text": "NAEB NEWS LETTER...March 1, 1940...Page 6\n(parent education) and many others* Scripts of programs now on the\nair will eventually be placed in the Script Exchange. A new catalog\nlisting more than 500 available scripts may b© obtained by writing\nto the Script Exchange, U. S. Office of Education, Washington, D.C.\n(100 per copy).\nOne illustration of the use made by schools of Exchange scripts is\nthe series broadcast by the District of Columbia Board of Education.\nPacing the work of the junior high school curriculum, the Board of\nEducation broadcasts scripts from the loan collection. Programs\nwere available through the Exchange on nearly every subject touched\nby the District of Columbia curriculum.\nTo help in the production of its scripts over local stations, the\nScript Exchange publishes a Radio Manual, a Handbook of Sound Effects,\nand a Glossary of Radio Terms.\nActing as a clearing house of information on radio, the Script\nExchange answers scores of inquiries each week and makes surveys of\ntrends and activities in radio education.\nThrough one of its newer services, the Exchange aids schools inter*\nested in the use of recordings. Now available are 24 recordings of\nthe AMERICANS ALL — IMMIGRANTS ALL series, named the outstanding\ndramatic radio series of 1939 by the Women’s National Radio Committee\nand the American Legion Women’s Auxiliary.\nSuggestions on how these recordings may be used in the school and\ncommunity are published in a Manual supplied free with the recordings.\nAdditional background facts on how democracy flourished because of the\ngifts of many races and peoples —* theme of AMERICANS ALL — IMMIGRANTS\nALL — are contained in a Handbook for Listeners. This handbook is\nalso free with the purchase of recordings. For complete information\nwrite to the Script Exchange, U. S. Office of Education, Washington,\nD.C.\nWhen the Radio Division demonstrated that large audiences are avail¬\nable for educational radio, Commissioner of Education Studebaker\nsuggested to the Federal Communications Commission the reservation\nof a band of ultra-high frequencies for the exclusive use of educational\nagencies. As a result, the Federal Communications Commission\nestablished a \"class of high frequency broadcast stations to be\nlicensed to organized non-profit educational agencies.\"\nThe U.S. Office of Education is now assisting school systems and\ncolleges in making applications for these frequencies and supplies\nadvice dm problems of equipment, personnel and programming. A free\nbulletin. Ultra-high Frequency Educational .broadcast Stations, gives\ndetailed information on the value, nature, and methods of operation\nof a school-owned broadcasting station*\nIn 14 communities in all parts of the country, Educational Kadio\nProjects operate with the assistance of the U.S. uffice of Education.\nThese cooperative enterprises are responsible for local Schools of\nthe Air, educational programs and scripts which enrich school\ncourses of study. Funds for this work come from W.P.A. allocations\nmade by President Roosevelt to the U. a. uffice of Education to\n\"demonstrate the use of radio in education.”"
}