{
  "id": "d86-39",
  "text": "In our search for new approaches in education we have now\nturned to the most powerful medium of communication yet devised\nby man -- television. We have a continuing obligation to make\nthe fullest use of this already proven instrument. An almost\naxplosive Increase in enrollments, an extreme shortage of physi¬\ncal facilities and an acute deficiency in the number of able\nteachers forces education to examine carefully many new educa¬\ntional media of communication. Among the new media, television\noffers many advantages for every level of education.\nIt is no longer necessary to demonstrate the effectiveness\nof television as an instrument of positive value in the educa¬\ntional process. Substantial evidence is now in to support the\nworth of the new tool. In large part it is beyond the experimen¬\ntal stage and has become a basic and integral element of those\neducational systems that have been able to include it in their\nregular operations. The weight of this evidence is available\nin a large body of published material that has most certainly\ncome to the attention of this committee in its deliberations.\nCalifornia is only one of the states that has recognized\nthe potential use of television as an instructional tool. The\nstate moved swiftly to avail itself of the educational resource\nmade available by the reservation of educational television\nchannels. The reservations were announced by the Federal Communi¬\ncations Commission in April of 1952 and within the same year\nGovernor Warren convened a statewide conference on educational\ntelevision In Sacramento in which more than 2,000 educational,\ncommunity and professional leaders participated. One of the\nrecommendations of this conference was that an Advisory Com¬\nmittee on Educational Television be appointed by the Governor.\nSuch a committee was appointed and held its first meeting in\nFebruary of 1953. During a period of changing administration,\nactivities of this committee were at a minimum. It was re-acti¬\nvated by Governor Brown in early i960, and its findings as of\nthe present time are contained in the first report recently ac¬\ncepted by the Governor, copies of which are being made available\nto you. It should be pointed out that the report, for the most\npart, is a statement of conclusions and recommendations based on\none year of study of Immediate needs. The report does not docu¬\nment fully the problems the state faces that cause it to consider\ntelevision as an instrument that may help solve a serious educa¬\ntional dilemma.\nIn California, \"people\" appear to be at once Its greatest\ncommodity and Its greatest problem. The population of the state\nis increasing at a rate of 50,000 new citizens each month, and\nthis rate is expected to continue to Increase wall into the\nfuture. The combined effects of immigration and \"birthquake\"\nare staggering. In 15 years more than 1,000,000 students will"
}