{
  "id": "d86-40",
  "text": "2\nbe enrolled in California institutions of higher education; in\n10 years more than 5,000,000 will be enrolled in public elemen¬\ntary and secondary schools. The University of California will\nsoon be operating nine campuses; it expects to add two more in\nthe next ten years.\nThese new students require new facilities. The financial\nresources of the state are taxed to the limit to provide the\ncapital funds necessary to meet the ever increasing demands for\nnew housing for education. Too often the funds available for\nboth capital and operating are so limited that operating funds\nare used for capital outlay and the quality of instruction\ndeteriorates. One of the conclusions drawn in a recently adopted\nmaster plan for higher education in California is, and I quote,\n\"Funds for capital outlay cannot be supplied after 1960-61\nentirely within the present tax structure; thereafter, higher\ncurrent revenues or bond issue money or both will be required to\nmeet higher educational construction needs.” In general, the\nsame can be said in terms of meeting the needs for elementary-\nsecondary educational facilities.\nMeans of extending the walls of the classroom, of bringing\nthe best of teaching to more pupils, of making fuller use of\nexisting facilities, of assuring that each student has equal\naccess to the best possible kind of instruction, of using the\nnew media to Improve instruction to the highest point, must be\nprovided. The full and wise use of television can become one of\nthe most important of those means.\nTelevision in its many forms is many things. It is the\nexcitement of young people sharing a learning experience with a\nskilled teacher who has at hand the resources, the materials per¬\ntinent to a subject that might not otherwise be available to all\npupils. It teaches teachers, upgrading the educational leader¬\nship of tomorrow. It Introduces to many students new teaching\ntechniques that bring alive many materials that have heretofore\nbeen only inanimate representations of the real thing. It Is\nsensitive to change and can adjust to meet current needs. It is\nhere and now and constantly creative. It is imaginative and im¬\nmediately responsive to new thoughts, now ideas, new techniques.\nIn California, as in many other states, there appear to be\nfour major areas of service for educational television. In gene¬\nral those can be identified as follows:\na. Open circuit television stations, operating at medium\npower, licensed to institutions of higher education or\nlarger school districts, the purposes of which are to\ncarry on programs of formal instruction within the con-"
}