{
  "id": "d86-41",
  "text": "- 3 -\nfines of their particular area of Jurisdiction, either\na single campus or district. Generally speaking such\nstations would, during daytime hours, originate formal\nInstructional programs from one or more points to be\npicked up and used in clusters of viewing areas that\nmight be scattered over a rather wide area. The pur¬\npose of such a service would be to make the best use\nof the best teachers to the greater advantage of more\nstudents, and to free other teachers for more indivi¬\ndualized work with those students who require a greater\namount of individual assistance. In addition, some\nstudents would be able to gain the televised portion of\ntheir study in their own homes thus alleviating to\nsome degree pressures upon the school plant. The\nlatter would be particularly true in adult education\nprograms carried on during evening hours.\nb. Open circuit stations of low power, licensed to smaller\nschool districts, to be used primarily for administra¬\ntive and in-class instruction. Here the emphasis would\nbe placed upon the improvement of instruction where\nlarge groups of students could benefit from the best\nteaching available in the district.\nc. Closed circuit installations ranging in size from one\nconfined to a single classroom where teaching in such\nsubjects as science, medicine, art, and certain other\ntechnique courses will be improved through the use of\nthe new medium. Here the television camera is a new\nkind of blackboard, projector, or microscope, one that\nis fluid and moves at the command of the teacher. The\nextension of this is obviously that situation in which\nthe teaching is conveyed by cable connection to other\nclassrooms so that more students may participate.\nd. Open circuit television stations that will assume\nbroad instructional and community responsibilities.\nAt the present time in California, two such stations\nexist, both of which were brought into being and con¬\ntinue to operate through the efforts of private enter¬\nprise, However, it is reasonable to expect that larger\ninstitutions of higher education will assume in other\nparts of the state the kinds of responsibilities under¬\ntaken by KVXE in Sacramento and KQED in San Francisco\nand will become licensees of similar kinds of develop¬\nments. Irj such stations are found elements that are\nnot organized education. They present services that\nare of great benefit to the citizenry. They are an\nimportant part of the best of the television medium,\nassuming a responsibility for general education of an\ninformal nature in addition to formal instruction by\nand for the organized elements of public education in\ntheir service areas."
}