{
  "id": "d86-42",
  "text": "- 4 -\nA note of interest to those of us connected with the\ntwo stations now operating in California is to realize\nthat the history of higher education in the United\nStates will show that it began as a product of the\nefforts of private enterprise. Gus? great public insti¬\ntutions were founded in years following the establish¬\nment of many of our important private institutions. It\nwould appear that history is repeating itself in the\nestablishment of educational television stations in\nCalifornia.\nThe services of the existing stations in the state\ncould be extended to many new areas if funds could be\nobtained to establish repeater stations in selected\nareas.\nCalifornia is not lax in its interest in educational tele¬\nvision nor is it inactive. This committee has before it a docu¬\nment that suggests certain immediate steps that must be taken to\npermit the full and free expansion of educational television in\nthe state. The Assembly Committee on Ways and Means of the\nCalifornia Legislature has recently completed a study on recom¬\nmendations in higher education. One of these recommendations\ncalls for an orderly introduction of television into the curri¬\nculum of the schools. The Senate Committee on Education is\npresently studying ways by which educational television may ex¬\npand in the state in a constructive way, and a bill has been\nintroduced in the present session of the legislature to open the\nway for that expansion. The State Department of Education in\nApril of i960 completed a study and has adopted a basic state\npolicy. The University of California has received appropriations\nin an amount of $407*000 in the last three years to prepare for\nthe expansion of television in the state. It has developed a\nstatewide plan for the University and hopes it may gain funds in\na substantial amount over the next seven years to establish a\nstatewide educational television network. The state colleges\nhave recently received appropriations and are presently instal¬\nling closed circuit facilities on several campuses, not for\nexperimentation but for actual use of these facilities In their\nteaching programs. Two of the state colleges have been actively\nengaged In closed circuit experimentation over the past several\nyears. Contained in the Governor’s budget request in i960 was\nan amount of $500,000 to be used for educational television in\nthe state.\nThe only reason California has not gone further ahead is\nthat It has been unable to develop sufficient capital resources\nto establish necessary facilities to make use of\" this Important\nresource to the people of this state. As has been pointed out,\nthese are avenues of communication through which can be dissemi¬\nnated much that*is of great value. There is every possibility"
}