{
  "id": "d86-5",
  "text": "-3-\neach seeking to establish an educational station in its community, joined to¬\ngether in 1955 as the Central California Educational Television Association to\nactivate KVIE (Channel 6) in Sacramento. This station began broadcasting in\nFebruary, 1959, after a long and intensive effort to raise the necessary expenses\nof operation.\nProgress elsewhere in the State, where only ultra high frequency channel reser¬\nvations exist, has necessarily been slower. A community organization has been\nformed in Fresno and the adjacent communities in an attempt to activate\nChannel 18, and is currently seeking to have the Federal Communications\nCommission alter the channel reservation to Channel 12 in the standard broad¬\ncast band. San Bernardino College has made application to activate the\nchannel in that community (Channel 24) but is prohibited from pursuing its\ninterest further until the Legislature removes the legal prohibition against\nschool districts owning and operating television transmission equipment.\nOne of the important applications envisioned by those who fathered the reser¬\nvation of television channels for education was the use of this technological\ntool for supplemental instruction in the classroom. This application, which\nhas come to be known as Instructional Television (XTV) was instituted in the\nPhiladelphia public schools very early, before the advent of educational tele¬\nvision, and came to full flower during 1954 and 1955 with establishment of\neducational television stations in such cities as Pittsburgh, St. Louis and\nCincinatti. California was unable to avail itself of this resource during\nthese years by virtue of an Education Code which prohibited school districts\nfrom contracting with television stations for classroom television services.\nAttempts were made to modify this Code in two successive sessions of the Legis¬\nlature, but it was not under the passage and signing of AB 1535 (Appendix C) in\nthe summer of 1957 that California schools could begin to employ television in"
}