{
  "id": "d1544-3",
  "text": "y This summer Harvard University is in¬\nstalling a special $100,000 network of co¬\naxial cables and amplifiers to provide multi¬\nchannel distribution throughout the univer¬\nsity of computer information, TV signals,\nand other electronic data. Making use of\ntechnical facilities in the WGBH-TV\nstudios, the system will eventually link li¬\nbraries, laboratories, and classrooms of the\nuniversity for prompt interchange of infor¬\nmation and demonstrations.\ny The local Kiwanis Clubs recently pre¬\nsented $3,588 to KRMA-TV, Denver, as a\ngrant for production and recording last\nyear of the six-program series Count Down\non Crime.\ny Marvi'n Rapp, president of the Long Is¬\nland ETV Council, hopes to have Channel\n53 on the air before the end of the year.\nCBS has given equipment valued at $115,-\n000 to the council.\ny June 3 was the date for raising a 200-\nfoot antenna tower atop a 612-foot build¬\ning to give WTTW and WXXW trouble-\nfree reception over a 60-mile radius around\nChicago. This is reported as the first time\nthat a UHF and VHF helical antenna have\nbeen united in a single tower, transmitting\ntwo TV broadcast signals from a single\npoint.\nThe Chicago ETV Association also re¬\ncently accepted its 37th member, the first\nto be admitted in several years: Barat Col¬\nlege of the Sacred Heart.\ny WCET, Cincinnati, has received $25,000\nfor new equipment, from the Crosley Foun¬\ndation.\ny Prominent New Yorkers met May 17 to\ninaugurate the Friends of Channel 13, a\ngroup supporting WNDT.\nINSTRUCTION\ny The Tri-State Instructional Broadcast¬\ning Council has announced that it was serv¬\ning about 400,000 elementary and second¬\nary students in Pennsylvania, New Jersey,\nand Delaware at the end of the school year.\ny FM educational programs reached an\nestimated 300,000 students in elementary\ngrades of 185 school systems in New York\nlast year, according to the Empire State\nFM School of the Air. The school offered\nfourteen different programs weekly through\na network of 14 FM radio stations.\ny With a recent program including a per¬\nformance by the 26th Air Division Band,\nMiss Katherine Turnbull completed her\nsixth year of Understanding Music. Stu¬\ndents throughout the Schenectady, N. Y.,\narea view the programs, for which WMHT\nprovides preparatory and follow-up mate¬\nrial for teachers.\nPROGRAM'S\ny For its series Profile: Traffic Safety\nWHA-TV, University of Wisconsin, has\nwon the Alfred P. Sloan Award, a citation\nfor distinguished service to safety present¬\ned by the National Safety Council. Lee D.\nO’Brien produced the programs, which were\nwritten by Alan Chechik and William Rich¬\nards. The program used films, slides, and\npictures to take a close look at the three\nE’s of traffic safety—Education, Engineer¬\ning, and Enforcement.\ny “Civil and Criminal Commitment: Medi¬\ncine and the Law” is the name of a one-\nhour report produced by WGBH-FM, Bos¬\nton. Four prominent legal and medical fig¬\nures discussed the dilemma of a society\nwhich seeks to aid the mentally ill yet is\nhampered by the fact that involuntary com¬\nmitment may infringe on civil liberty.\ny KOAP-TV, Portland, Oregon, is mak¬\ning a TV documentary about a day in the\nlife of a state legislator.\n^ WTVS, Detroit, recently offered view¬\ners 10 hours of special programs—a samp¬\nler of what ETV has offered in the 10\nyears WTVS has been on the air. (October\n12 is actually the anniversary date.)\ny WNED-TV, Buffalo, recently present¬\ned an hour special, “Conversation: Alco¬\nholism.” Three panelists discussed the dif¬\nference between the social drinker and the\nalcoholic, the physical effects of alcoholism,\nand the problem of teen-age drinking. On\nthe panel were the executive director and\nvice-president of the National Council on\nAlcoholism and the director of the commu¬\nnity health department of the American\nMedical Association. Joe Vecchione pro¬\nduced the program.\ny KVCR-TV, San Bernardino, Calif., has\ntaped two half-hour programs featuring M.\nGerard de la Villesbrunne, counselor of the\nFrench Embassy, Washington. He discussed\nCharles de Gaulle’s views on world affairs.\nPLACEMENT\nPOSITIONS AVAILABLE\n(For information, write the Placement Service, at the NAEB office in Wash¬\nington. In order to be considered through these channels, the reader must\nbe an Individual Member of the NAEB, with credentials on file with the\nNAEB Placement Service. Non-members can save time by sending the $10\nannual dues and $10 Placement registration fee at the time of inquiry.)\nJuly I Inter-institutional ITV network in Southwest seeks producer-director specializing in\nhigher education. Ability to deal convincingly with faculty planning committees es¬\nsential. May also produce and direct general adult programs. M.A. preferred but\nnot essential for experienced person. Salary: $7,000.\nJuly 2 Producer-director for large Midwestern university AM-FM service. Duties include\ndaily magazine format air shift. Excellent creative opportunity with respected pro¬\ngressive station. Can continue education while employed full time. Experience pre¬\nferred but not essential. $6,000 to $8,000 with top fringe benefits. September I.\nJuly 3 Program manager for statewide ETV network. Assistant professor rank with possible\nlimited teaching responsibilities. Ph.D. or at least Mi.A. with extensive experience in\nproducing, directing and programing an ETV station with knowledge of cultural,\ncommunity, instructional and public service programing and program sources.\n$1 1,000 to $1 1,700. July I.\nJuly 4 Production-operations manager for state ETV network. Assistant professor rank with\npossible limited teaching responsibilities. Ph.D. preferred; M.A. mandatory. Must\nhave extensive experience in ETV production, staff supervision, and fiscal manage¬\nment. Must be experienced producer-director of high quality community, cultural\nand instructional programing. University-oriented applicant preferred. $11,000 to\n$1 1,700. July I.\nJuly 5 Senior producer-director for ETV net. Instructor rank. Must have M.A. and extensive\nexperience in on-the-air production and direction of in-school, public service and\ncultural programing over an ETV station. $8,400 to $9,000. July I.\nJuly 6 TV graphic arts supervisor for state ETV net. Instructor position in university pro¬\nduction center. Must have extensive experience in design and execution of TV graphics\nfor in-school, community and cultural ETV programing. Must have supervisory and\ncreative ability under pressure of broadcast operation. $8,400 to $9,000. July I.\nJuly 7 Chief engineer for state ETV net. Assistant professor in university-operated ETV net¬\nwork; no teaching. College degree preferred. Must have practical, design and sta¬\ntion engineering experience. First class license required. Must have extensive super¬\nvisory experience and ETV broadcasting experience. $11,000 to $11,700. July I.\nJuly 8 Director-manager of closed-circuit installation at major university. Assistant profes¬\nsorship with some teaching. Ph.D. or near completion desired. Must have education\nbackground and experience in coordinating, producing and directing ITV lessons\nat college level. Must be capable of teaching ETV and developing ITV programs\nand their utilization. AV experience desired. $11,000 to $ I 1,700. _ July I.\nJuly 9 Director of program development for extension division of major university. As¬\nsistant to associate professorship. Ph.D. preferred but M.A. plus experience accept¬\nable. Must have experience in coordinating, writing and producing adult and col¬\nlege level cultural and instructional programing for broadcast; also in over-all\npackaging of adult and college level ETV program fare with creativity and academic\nintellectual honesty. Directing experience desired. $11,300 to $12,000. July I.\nTechnical institute in large eastern city has four September openings. Ph.D.\nor near essential. Salaries are: instructor $5500 and up; assistant professor\n$7000 and up; associate professor $8000 and up; professor $9000. Needed\nJuly 10 Verson to teach speech fundamentals and to develop speech correction.\nJuly I I Person to teach speech fundamentals and English.\nJuly 12 Person to teach speech fundamentals and to develop drama.\nJuly 13 Person to teach speech fundamentals and to develop business speech.\n4\nNEWSLETTER"
}