{
  "id": "d1890-2",
  "text": "-3-\nWINGSPREAD RADIO CONFERENCE IS A WING-DING\nSome seventy people met,September 25-28, at Wingspread (the Frank Lloyd\nWright designed home near Racine, Wisconsin, which now housas the\nJohnson Foundation) to consider \"Educational Radio as a National Resource.\nThe three-day meeting was sponsored by NER, and underwritten by the\nJohnson Foundation, which has previously supported several NER radio\nseries.\nParticipants included people in industry, commercial broadcasting,\ngovernment, education, philanthropy. NAEB representatives included the\nentire NER Board, Richard Hull, Chr. of the NAEB Board, and myself.\nOthers included: Charles Daly, V.P., U. of Chicago; Richard Doan, TV\nGuide; Clark M. Eichelberger, V.P., United Nations Assn.; Howard Kany,\nCBS; George Probst, Edison Foundation; and L. F. Tijmstra, Director of\nRadio Nederland. Major speeches were made by Prof. Charles Siepmann,\nN.Y.U.; Bob Shayon, radio-TV critic for Saturday Review; and yours truly.\nDuring the three-day session, the participants enjoyed the gracious\nhospitality and splendid cuisine provided by the John Foundation, the\nstimulating environment afforded by Mr. Wright's organic architecture,\nand worked long hours in five separate discussion groups. The\ndiscussions were lively and sometimes heated. (There were several\ncommercial broadcasters in the group and sometimes it sounded like a\nre-play of the IERT meetings of the past 35 years.) Everybody agreed\nthat something needed to be done to make educational radio a more potent\nforce in our society and some consensus, if not unanimity, was achieved\non how best to realize this objective. Some of the recommendations\nincluded: establishment of a national program production and training\ncenter; inclusion of radio in any communication satellite proposals; and\nsetting up of a public affairs radio news bureau in Washington. Under¬\nlying all the discussion was an emphasis on the need to make educational\nradio relevant - in particular, to address itself to community needs.\nMost attractive participant: Myrna Loy, actress, member of the Board\nof National Committee Against Discrimination in Housing, and former\nmember of the U. S. National Commission for UNESCO.\nDEPARTURES FROM OUR REGULAR PROCEDURES\nJohn Witherspoon, to Santa Barbara, as Associate Director for Tele¬\ncommunications, the Brooks Foundation.\nFrederick Breitenfeld, Formerly Associate Director, ETS Division, assumed\nresponsibilities, October 3, as Executive Director, Maryland Educational-\nCultural Television Commission, Baltimore."
}