{
  "id": "d920-45",
  "text": "KTCA- TV\ntwin city area educational television corporation\nCHANNEL i\nMINNEAPOLIS • ST. PAUL\nMINNESOTA\nBuilding TSA—Room 110 Telephone\nUniversity of Minnesota Midway 6-4616—Ext SG3\nSt Paul 1, Minnesota\nNovember 15, 1957\nDr.Burton Paulu\nPresident\nNational Association of Educational Broadcasters\nKUO?\nUniversity of Minnesota\nMinneapolis lit, Minnesota\nDear Dr. Paulu:\nYour lengthy, single-spaced protestation of innocence has been received\nand noted. I realize the effort you must have put into this essay and\nregret that I find it obscure in some places and contrary to fact in\nothers. The unconscious humor of your statement that Harold hand's talk\ncontained a significant analysis of educational broadcasting in the face\nof the man's correct statement that he knew little or nothing about that\nsubject, is a case in point. Can you seriously deny that in terms of\nnumbers involved, work performed and trouble taken, the Follies was \"the\nmajor effort\" of the convention? If you can, you will need better argu¬\nments than Hand's significant analysis. My remarks were much closer to\nunderstatement than to hyperbole.\nSimilarly no one with any basic parliamentary experience will be con¬\nvinced that tabling a recommendation is a simple matter of delaying con¬\nsideration. I am now sure that the recommendations will be considered\nbut you will pardon me if I feel this liappy result stems largely from\nefforts of mine subsequent to the Convention. Incidentally the prelimin¬\nary minutes are in error in referring to the \"Schwarzwalder proposals.\"\nAs I understand it the proposals were adopted and recommended by the TV\nOperations and Development Committee. I am proud to have suggested the\nproposals but they are no longer mine (. veept in theeyes of those who\nwant to defeat them).\nAnother small point full of unconscious humor was your citation of the\nAllerton House Conference as an NAEB aid to ETV in the same letter in\nwhich you admitted the Board of the NAEB had tabled the two ETV proposals\nwhich came out of the Conference.\nAs to the domination of NAEB by Midwestern Radio Stations I fail to see\nhow you can deny it. As long as WTTfo, with an $800,000.00 budget, serving\n6,000,000 people has the same voting power as, say, KSTE (FM) in Emporia,\nKansas, this domination will continue. I am not blaming you, personally,\nfor this situation, I simply object to your saying it is not a fact and\nI feel you are not entirely candid when you fail to admit the truth of my\ncontention. The \"Midwestern social club\" remark is equally true. For\nthe phrase I am indebted to Dick hull who used it at the convention and\nsaid the NAEB was that and a lot of other things as well. I agree fully\nwith his statement but not, I think, with what he meant."
}