{
  "id": "d920-55",
  "text": "2\n— Concerns regarding the professionalism of teachers and our own staffs\nand solves, and how mass media may assist in the development of , as\nwell as in winning higher status, respect and remuneration for, education\nand educators*\n— Concerns regarding the present absence of objective standards for station\nstaff members ©accept engineers* Recognition of the responsibility of\nprogram planners and producers for 'the mental and emotional effects of\ntheir fare, as drug manufacturers must be responsible for the physical\neffects of their products. This requires increasingly high standards\namong program personnel, access to qualified advisers for all kinds of\nprogress* and the need to develop a \"profession” of educational broad¬\ncasters*\n— Concerns lest TV try or claim to do everything or too much, rather than\nencouraging educators to make the best uses of all available media and\ntechniques, each for its best function as tools of education. Education\nis bigger than either TV or radio or both together.\n— Concerns regarding undue preoccupation of educators with traditions\ngrowing out of commercial practices rather than necessarily the real\npossibilities of the (radio and TV) media; and regarding certain stereo¬\ntypes and practices likely to confuse the difference between \"educational\"\nand \"commercial\". This is essentially a concern about \"single-track\nthinking,\" which can be prevented only by courageous experimentation,\nto which the NAEB is committed.\nThese are undoubtedly too hastily sketched to be fully understood in the\nbrief time available here. However, I hope they suggest to you the deep\nfeeling present in the NAEB as an association, that these instruments, in\nunskilled or careless hands, can be most dangerous; but that in professional\neducators* hands they can become powerful forces for enlightenment and the\npersonal development of man.\nThe MSB’s \"thread of continuity\" through the years, then, has not been\nlimited to techniques. In its concern at the philosophical and social\nscience level it has turned eagerly for guidance to the outstanding humanists,\neducators, scientists and social scientists in America — for workshops,\nseminars, and consultations.\nWith the ETRC handling TV Networking, and the JCET guarding and activating\neducational frequencies in TV, on behalf of the \"educational public\", the\nNAEB was left with a broad area of other services to provide. Why do and did\neducational stations flounder or disappear? It has been the MSB's role to\nanalyze the causes and kinds of failure which mey occur and to insure against\nthem in the areas of technical, personnel, promotional, administrative,\noperational, local programming problems,,and other areas.\nHerewith a brief listing of those functions which the NAEB, after over 30\nyears of experience, through lean and rich years, seeks to provide* Hazy\nof these services could not be provided without the generous support of such\nfoundations as the Ford and W. K. Kellogg Foundations. And even now staff\nand budget do not enable us to provide them to the public generally. For\nthe NAEB is essentially an association of members who elect its officers and\ndetermine its policies."
}