{
  "id": "d920-58",
  "text": "13) General (Educational) public relations (correspondence end reports)\n14) Liaison with other groups (MSA, AGE, AGPRA, AEA, AVCPI, kasrican\nHeritage Foundation* BFA, CHO, DAVI, 5APSAE, KARTS, KEA, HP AC, REE.\nTASO, UNESCO National Cccsaisslcn, USIA, VO A, and some fifty others)*\nThe NAEB is also a member of the JCET, end maintains liaison with\nthe ETRC through its Advisosy Committee to the President of the Center*\n•\n15) Peculiarities of NAEBt\nBoth Radio and TV\nAM and PM\nUKF and VHP\nPublic school and general adult education\nCredit and non-credit\nOpen and closed circuit\nActives, Associates, and Affiliates (all institutional), plus\nIidividuals\nEducators plus broadcasters\nPhilosophy plus skills\nInternational plus national\nLocal assistance as well as national support\nAll officers and members of the Board are unpaid, and are elected by institutional\nmembers* Many of the most significant contributions of the NAEB are also made\npossible by the selfless devotion of ’unpaid cosgEdttee members, who contribute\ntheir Himtfrn resources and special skills to the movement through their own\nassociation*\nThe NAEB, in spite of its wide area of services, does not seek to be all things*\nIt has declined offers of funds, in some cases, because the projects involved\nwould lead it too far afield*\nThinly staffed, often found with various \"kinds* of NAEB members arguing hotly\nwith others, frequently forced to compromise with its dreams, for fund end\nother reasons, the ©urging maturity of the ®MAEB spirit® is, I believe, that\nof a family of \"crusaders® fighting for what they believe in* I hope it may\nencourage you to believe that a new type of profession of broadcasters is\nemerging in Africa* We hope our nation, and your nations, may be the better\nfor its efforts. They will continue to be unremitting.\nIn recent months, requests for assistance and expressions of interest in member-\nship in the NAEB, from abroad have greatly multiplied. We are trying valiantly\nto be of assistance. As those pressures increase, we must ask ourselvesi Who\nknows bat that, sees© day, we may join with you, from many nations, in an\nInternational Association of Educational Broadcasters?\n. HJS/dc\nNovember 27, 1957"
}