{
  "id": "d920-9",
  "text": "6\nInternational Relations\nWithin the last few months a new organisation, the Broadcasting Foundation\nof America, has come into being. It was formed principally by two former I7AEB\nofficers and e omit tee workers. In explaining to us the reasons for its formation,\nthese individuals stated that the reasons on which they had proceeded were based m\nthe NAEB*3 apparent unwillingness or inability to meet the great need for American\nleadership which exists in the international program exchange area®\nThe MSB* g inability to meet the need in this area is, we must admit, a fact.\nIn answer to invitations to the MSB to provide speakers, consultants, judges and\nrepresentatives to distinguished international broadcasting conferences,particularly\nin Europe, the NAEB*s inability to provide funds for travel for its most logical\nrepresentatives has resulted in cur having to delegate, for representation, whoever\nccaild attend, or happened to be in Europe at the time* as .hlbright scholars, or\nindividuals on sabbaticals, etc. Consequently# for many conferences, the NAEB has\nbeen embarrassingly inadequately represented* Opportunities for leadership of the\nhighest order have teen missed* And various other organisations, less acceptable\nto European broadcasting and educational leaders, begin to be accepted, reluctantly,\nas reporasentatives of American education and educational broadcasting in such\ncapacities*\nIn the few cases when the representatives we have been able to secure at little\nor no cost to the TJAEB have been good, the resultant flood of letters and requests\nto us has been gratifying* The fine offices of several European broadcasting systems\nproudly display on their walls framed citations from the ??A£B for programs they have\nprovided the NAEB, at no cost to us. Our inability to repay them in kind, in even\na few programs created specifically for them, which they would gladly broadcast,\nhas met with a patience which reveals unusual understanding of the still prevalent"
}