{
  "id": "d1814-0",
  "text": "Vol. IV,~ No. k DuPont Circle Building, Washington 6, D.C. February 25, 1963\nMEB COMPUTER STUDY EXTENDED TO INCLUDE MICROWAVE AND AIRBORNE\nThe USOE has made a supplemental giant to the MEB under its contract for a\ndetermination and evaluation of a nationwide assignment of TV channels. This will\npermit the MEB to make a study (using electronic computer methods) of the need for\nan availability of microwave frequencies. The problem has two major aspects. First,\nwhat are the relationships of standards (both equipment and frequency) to the\nallocation of microwave frequencies; and second, the equitable distribution of\nmicrowave frequencies for TV interconnection and relay. This study will make use of\nthe information already obtained in the original assignment study and in the earlier\nstudy of the needs of education for TV channels. The project will also include a\nstudy of standards and allocation feasibilities for airborne television channels.\nThis study will be conducted by the MEB Office of Research and Development of\nwhich Vernon Bronson is the Director and James Fellows is the Assistant Director,\nwith engineering work being done by Jansky & Bailey, MEB*s engineering consultants.\nMEB WOULD BE REPRESENTED ON JOINT UHF COMMITTEE PROPOSED BY FCC\nThe MEB would be represented on a \"Committee for the Full Development of UHF\nBroadcasting\" which the FCC proposes to establish to help expedite the expansion\nof UHF TV service which will be ushered in by all-channel receivers. The Commission\nbelieves it is vital to follow up the all-channel regulations with all appropriate\nsteps to enhance the development of UHF broadcasting. Through the proposed committee\nthe FCC could obtain insight into the problems as they arise and, where appropriate,\ntake corrective rulemaking or other actions. The committee could also perform the\nvery useful function of collecting and disseminating information concerning the\npractical problems confronting the UHF broadcaster in differing market circumstances,\nthe methods used by broadcasters to meet these problems, and whether a particular\nmethod was successful or effective.\nIn addition to an MEB representative, the committee would be composed of\nrepresentatives of the FCC and the various groups which could be helpful in promoting\nthe growth of UHF, such as: the UHF broadcasters (including the recently formed\nAssociation for Competitive Broadcasting), Electronics Industry Association, MB,\nNETRC, the three major networks. The FCC made clear that the list is by no means\ncomplete and others who believe they could contribute would, of course, be welcome.\nTENNESSEE LEGISLATURE APPROPRIATES $1.5 MILLION FOR ETV\nOn Feb. 20, the Tennessee State Legislature appropriated $1.5 million for\ncapital expenditures to implement a statewide ETV network. The state*s two\nexisting stations - WKNO-TV, Memphis, and WDCN-TV, Nashville - will be increased to\nmaximum power, and plans contemplate construction of three more stations at Knoxville,\nChattanooga,and Lexington. The transmitter for the University station (Knoxville)"
}