{
  "id": "d1822-0",
  "text": "Volume V Number 13\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n1346 Connecticut Avenue, N.W., Washington, D.C., 20036\nB August 2&, 19^4\nNDEA LEGISLATIVE SITUATION\nThe House Education and labor Committee has reported a bill (HR 11904) which,\namong other things, provides for a two-year extension of NDEA: adds English, history,\nand geography to Title III; and adds a $35 million program to provide for institutes\nto train librarians, guidance personnel, and teachers of history, geography, modern\nforeign languages, and English.\nThe next step is a hearing before the House Rules Committee; it is expected\nthat the bill will be granted a rule and be called up within the next two weeks. A\nsimilar bill has been passed (August l) by the Senate which adds remedial reading and\ncivics to Title III, adds institutes for educational media specialists, and grants a\nthree-year extension to NDEA.\nADDITIONAL ETV FACILITIES GRANTS ANNOUNCED\nApproval of three more grants under the ETV Facilities Act has expanded the total\nnumber of grants to thirty-seven since funds became available in May, 1963. They total\n$6,123,040 in Federal funds.\nOn July 31> it was announced that grants had been approved for Yakima School\nDistrict No. 7, Yakima, Washington, for $79,278 to provide studio equipment for Station\nKYVE-TV, Channel 47. Estimated total cost is $129,967.\nA grant was also given on the same day to Mohawk-Hudson Council on Educational\nTelevision, Schenectady, New York for $163,626 to expand and improve the facilities of\nChannel 17, Station WMHT-TV, a project costing an estimated $259,183*\nOhio University in Athens, Ohio received a grant of $149,347 on August 3 to\nexpand existing facilities of reserved Channel 20, Station WOUB-TV. The total cost of\nthis project is an estimated $199,130. The expanded coverage would include portions of\nOhio and West Virginia and will provide service to a population in excess of 490,000.\nHEW APPLICATIONS ACCEPTED FOR FILING\nFive new applications, four of them from the University of Vermont and State\nAgricultural College, have been accepted for filing under a program of Federal assistance\nto establish or expand educational television broadcast facilities. The four applications\nfor the Vermont institution, located at Burlington, are: For $307,06l to activate\nchannel 22, Burlington. Total cost, $6l4,123. For $98,820 to activate channel 49,\nRutland, total cost $197,640. For $86,l62 to activate channel 30, St. Johnsbury. Total\ncost, $172,365* And for $154,682 to activate channel 26, Windsor, total cost, $309,365*"
}