{
  "id": "d1822-5",
  "text": "NA£B NE’'S LETTER\nPAGE 6\nOctober tt 1943\nCarlo Opera performances* At ten o'clock, WNYC signs-off —after pre¬\nsenting »5 HOURS OF DIVERSIFIED AND INTERESTING PROGRAM FEATURES —A\ntypical Sunday schedule “for the instruction, enlightenment, entertain¬\nment, RECREATION, AND rELFARE OF THE INHABITANTS OF THE C|TV“*\nftBEZ - “THE RADIO VOICE OF THS CHICAGO, PU8LIC SCHOOLS?\nStation WBEZ began its first school year of full-time broadcasting for use\nin the Chicago Public Schools on Monday, September 20th. The station will\nBE ON THE AIR THREE AND A HALF HOURS EVERY SCHOOL DAY, FROM 10:30 A.M.\nUNTIL 2:IB P.M., UNTIL OCTOBER 4TH, WHEN THE STATION WILL SIGN OFF AT\n,3° PSEw-ESTER SCHEDULE - PROGRAMS FOR IN-SCHOOL LISTENING HEARD OVER\nT.QEZ ONLY\n•“Destination Unlimitco\nMondays\n10:30 a.m.\nBefore the Doctor Comes\nMondays\n10:45 a.m.\nLest We Forget\nMondays\n11:00 a.m.\n•Languages in Action\nMondays\nII:30 a.m.\n•The another Goose Lady\nTuesdays\n10:30 a.m.\nThe Thousand Million\nTuesdays\n11:00 a.m.\n•Numbers at Work\nTuesdays\n11:30 a.m.\n•New Worlds for Old\nWednesdays\n10:30 a.m.\nChina and India Speak\nWednesdays\n10:45 A.M.\nPan-American News\nWednesdays\n11:Q0 A.M.\n•Let's Tell a Story\nWednesdays\n11:30 a.m.\nLife for Wildlife\nThursdays\n10:30 a.m.\nChina\nThursdays\n11:00 a.m.\n•By Freedom's Light\nThursdays\nII:30 a.m.\n•Contact\nFrioays\n10:30 a.m.\n* Indicates repeat broadcast of programs hear on station WIND, 560 kc;\nWJJD, 1160 KC; AND ViBEZ, 42.5 MC.\nWKAR ADOS AP HEKS SERVICE\nTo give the mose complete information possible, VVKAR has now installed a\nDIRECT WIRE FROM PRESS ASSOCIATION, INC., THE RADIO SERVICE OF THE\nAssociated Press. Ne^s broadcasts will be given on a regular schedule\nEVERY HOUR OF THE DAY BEGINNING OCTOBER I.\nFor almost three years news has been broadcast THROUGH the COOPERATION of\nthe Lansing State Journal by direct wire from the newsroom. This arrange¬\nment WAS VERY SATISFACTORY BUT BECAUSE OF THE DIFFICULTY OF TRANSPORTATION\nIT WAS IMPOSSIBLE TO SCHEDULE MOKE THAN THREE NEV‘8 BROADCASTS PER DAY.\nWith the teletype installed in our own studios the news can be given as\nSOON AS RECEIVED.\nThe news will be heard every hour, at five minutes before the hour, except\nAT 10:00 A.M. ANO AT 12:00 WHEN IT WILL BE ON THE HOUR. Two SPECIAL\nFIFTEEN MINUTE NEWS SUMMARIES ARE SCHEDULED AT 11:15 AND AT 6:30 EACH DAY.\nThese broadcasts will make the news service of this station as complete\nAS CAN BE OBTAINED."
}