{
  "id": "d1606-0",
  "text": "1346 Connecticut Avenue, N.W., Washington, D.C., 20036\nNovember 8, 1963\"\nVolume IV, Number 17\nBRIEF SUMMARY OF THE NAEB UHF ASSIGNMENT PLAN\nA nationwide television channel assignment plan devised by an electronic\ncomputer was released on Monday, November 4, by the NAEB. The plan provides for\napproximately 2600 assignments of television channels in the UHF band. No addi¬\ntional assignments were made for VHF channels. All assignments made by the\ncomputer were built around existing facilities, and none of the 2,365 new assign¬\nments which the computer was able to make affects the 202 educational and com¬\nmercial UHF stations now operating or holding construction permits.\nThe NAEB report has been presented to E. William Henry, Chairman of the FCC,\nand to members of the FCC staff who assisted in providing data for the computer\nprogram which prepared the assignment table. Steps are now being taken to file\nthe plan with the FCC, either as a recommendation that the Commission issue the\nplan as an alternative to its own proposed UHF table released two weeks ago, or\nas a comment in the current rule-making proceedings for UHF assignments.\nAt a news conference in Vfeishington on November 4, NAEB President Harley\nsaid, \"We look upon this not only as an opportunity to meet the increasing demand\nof education for broadcast television channels, but as a method for increasing the\nnumber and diversity of commercial television stations. The additional channels\nprovided for in the NAEB plan meet needs in both areas for additional facilities,\nand the computer approach which made this possible is now documented as a reliable\nmethod for solving a variety of nationwide or regional allocations problems.\"\nThe assignment plan recommends that 864 UHF assignments be reserved for\neducational purposes. This is in addition to 45 educational UHF stations now\noperating or holding construction permits and is also in addition to slightly over\n100 educational VHF stations now operating or reserved. Considering the entire\nVHF-UHF plan, the NAEB is recommending that approximately 1,000 channels be\nreserved. A number of cities are provided with at least two reservations and\nadditional reservations are provided in larger cities, some of which are already\noperating two educational channels.\nUsing the computer to consider the complete range of alternatives, the NAEB\nplan has found well over 600 more assignments than are in the FCC’s proposed Table.\nIteny of these additional assignments are in places where television coverage is\ndesirable but not necessarily of primaiy importance at the moment. Thus, the NAEB\nplan improves the potential diversity of television service not only for educational\npurposes but for commercial purposes as well.\nThere are three important points regarding these recommended reservations.\nFirst, NAEB has not sought to load this with educational reservations, either by\nasking that even a majority of unused channels be set apart for non-commercial\npurposes, or by suggesting that all low UHF channels be reserved and commercial\nbroadcasters be left with the remainder.\nr"
}