{
  "id": "d1606-1",
  "text": "Second, the plan does not impose a limit of educational reservations for\nany location. Although no location is assigned more than four reservations, this\nis not necessarily a maximum. The effort has been to provide reservations where\nthey will be needed. In a number of cases, commercial broadcasters have been\nsitting on CP’s for a number of years, thereby preventing others from access to a\nfacility. In several large communities this has already worked as a disadvantage\nfor educational broadcasters and it is hoped that by avoiding a plan which sets a\nmaximum of two educational channels per community (as proposed in the FCC plan)\nthat the number of problems caused by the CP-sitter can be reduced. The NAEB plan\nprovides greater protection for educational interests by providing more reserved\nchannels, but it also benefits commercial broadcasters by providing a greater total\nnumber of assignments. The plan reflects planning for commercial potential as it\nrelates to population distribution, as well as a consideration of educational needs.\nThird, reservations were based on statewide television plans which have been\ndeveloped for education, NAEB surveys of educational need, and other information\nwhich demonstrated the importance of providing channels for educational purposes.\nFollowing are the recommendations which NAEB makes with respect to this plan\nand the procedures with which it was devised.\n1. On the basis of the assumptions and background presented in this report,\nthe technical precision with which this plan has been developed and the possibility\nfor further exploration and use of the computer techniques for channel allocations,\nthe NAEB recommends that the FCC adopt the Table of Assignments which is included\nwith the report.\n2. In consideration of information already included in the report, the\nNAEB recommends that the FCC adopt this Table as a new basic Table and that changes\nproposed for specific locations be based on this Table of Assignments.\n3. It is recommended that the FCC adopt the reservations which are listed\nin the NAEB Table of Assignments and that the Commission consider the reserved\nchannels in this report as providing only for minimum educational needs. For this\nreason, it is further recommended that unreserved channels be considered as\ngenerally available either to commercial or educational applicants without pre¬\njudgment that a number of educational reservations fixed at this time can serve all\nfuture needs.\n4. The NAEB recommends that the FCC accept not only the basic plan which\nis presented, but also the recorded data which are available for the Commission’s\nuse at any time for whatever modification or further exploration may be desired.\n5. Finally, it is recommended that the FCC use this information as the\nbasis for a periodic re-examination and possible re-allocation of the unoccupied\nchannels of the UHF spectrum, and that computer procedures be used to conduct\nthe re-examinations and re-allocation.\nThe study was conducted by an NAEB staff directed by Vernon Bronson.\nTechnical consultants were the Jansky and Bailey Broadcast-Television Division of\nAtlantic Research Corporation. Funds for the study were provided by the National\nDefense Education Act, through the United States Office of Education.\nCopies of the NAEB UHF Assignment Table are being sent to all Active and\nAssociate members."
}