{
  "id": "d1481-0",
  "text": "April 12, 1947\nEVERYBODY’S\nBUSINESS\nKEITH HUTCHISON\nAmerica’s World Bank\nTHIRTEEN months after its formal inauguration at\nSavannah, the International Bank for Reconstruction\nand Development has yet to make its first loan. This is not\ndue to any lack of demand for its services. Eight member\ncountries have made bids for a total of $2,310 millions and,\nwhile some of their applications are in too tentative a form\nfor action, others have been submitted with detailed plans\nwhich have been carefully examined by the bank’s economic\nexperts.\nOne reason for delay has been the difficulty in finding and\nkeeping a president for the institution. In theory, this officer\nis selected by the twelve-man board of executive directors\nelected by member countries; in practise, there is an unwrit¬\nten agreement to allow the United States, as the largest\ninvestor in the bank, the right of nomination. The president\nis paid $30,000 tax-free, but despite this attractive remunera¬\ntion and the dignity and prestige supposedly attached to the\nposition, it proved hard from the first to persuade any\nqualified person to accept it. At length, after a three-month\ncanvass, Eugene Meyer, eminent publisher of the Washing¬\nton Post and former chairman of the Federal Reserve System,\nagreed to undertake the task, amid general applause.\nSix months later, Mr. Meyer resigned, giving explanations\nthat satisfied nobody, and the frantic hunt was resumed.\nFor another three months, business was held up while finan¬\ncial circles gossiped about internal difficulties which led one\ncandidate after another to refuse the prize. Finally, John\nJ. McCloy, a corporation lawyer with banking connections\nand former Assistant Secretary for War, agreed to accept\nthe nomination. He did so on his own terms, one of which\nwas the resignation of the American executive director,\nEmilio G. Collado, and his replacement by Eugene R. Black,\nvice-chairman of the Chase National Bank. Simultaneously,\nMr. McCloy appointed Robert L. Garner, a director of\nGeneral Foods and formerly connected with the Guaranty\nTrust Company, as vice-president.\nAs a result of these changes, the New York financial\ncommunity is now strongly represented at International Bank\nheadquarters and its former coldness to the institution has\nbeen replaced by a more cooperative attitude. This is im¬\nportant because the bank’s dollar resources, which will reach\nsomething over $700 million by the end of May, are totally\ninadequate to meet the demand on it for dollar loans. Con¬\nsequently, unless its activities are to be severely restricted, it\nmust market its own securities in the United States—an\noperation that can only be carried out with the blessing of\nthe big financial institutions. That this will probably now be\nforthcoming is indicated by a bill, authorizing New York\nsavings banks to invest their funds in International Bank\ndebentures, which now awaits Governor Dewey’s signature.\n425\nFor months, this measure had been kicked around at Albany\nbut as soon as McCloy’s appointment was confirmed it passed\nboth houses of the state legislature without difficulty.\nProspects for obtaining additional resources in the New\nYork market have, therefore, brightened perceptibly, and a\nsmall experimental issue of bank debentures will probably\nbe made in the next few months. But undoubtedly the heads\nof the dozen or so investment houses and insurance com¬\npanies which dominate the securities market will keep a sharp\neye on the kind of loans the bank makes. They are not\nlikely to look with approval on borrowing by countries that\nhave failed to make what Wall Street considers a satisfactory\nsettlement of private debts, or on those which nationalize\nindustries in which American capital is invested. And if the\ndirectors and officers of the International Bank should ignore\ntheir frowns, the market for bank debentures will probably\nbecome very sticky. That means that Wall Street can pull\nthe new institution up short whenever it sees fit.\nThe advent of Mr. McCloy did not create this braking\npower which is implicit in the dependence of the bank on\nAmerican capital; it merely put into the chauffer’s place a\nman the private bankers could trust, and so reduced the\nneed for back-seat driving. And the appointment of Mr.\nBlack should also make for smoother riding, since, in this\nrather complicated financial vehicle, he will operate dual con¬\ntrols on behalf of the American government.\nThe United States holds 37V2 per cent of the voting power\nin the bank and, in addition, the articles of agreement pro¬\nvide that the bank can only borrow funds with the approval\nof the member in whose market those funds are raised.\nSo long, therefore, as this is the one large country with\nsurplus capital, it will exercise a practical veto on the bank’s\noperations.\nThe Bretton Woods Agreements Act, which provided for\nAmerican participation in both the International Bank and\nthe International Fund, set up a National Advisory Council\non International and Monetary Policy. This body, known\nas the N.A.C., is composed of the Secretaries of the Treasury,\nState, and War, the chairman of the Federal Reserve System,\nand the chairman of the Export-Import Bank. Its function\nis to issue policy directives to the American executive direc¬\ntors of both the International Bank and International Fund,\nand this means, I am reliably informed, that it debates at\nlength every loan request made to the former. But while\nthe bank and its officers are prohibited from reaching deci¬\nsions on political grounds, the N.A.C. does not appear to\nlimit itself in the same way.\nI am told, for instance, that a request by Poland for a\nvery large loan, part of it earmarked for rehabilitation and\nexpansion of the Polish coal fields, has been held up in the\nN.A.C. because one member insisted that the Poles were\n\"without integrity.” This sweeping indictment of a people,\nit is to be feared, may bar Europe from supplies of fuel which\nit desperately needs. I am sure that is bad economics and, in\nview of the fact that poverty is communism’s best ally, short¬\nsighted politics as well. In an even more curious case, objec¬\ntion was raised to the proposed use by Chile of part of an\nInternational Bank loan to develop oil lands which, under\nChilean constitutional law, cannot be alienated from the\nstate. The encouragement of a socialized oil industry, it was"
}