{
  "id": "d827-14",
  "text": "r, /W2-'\nOn the Air\nCBA Opposes\nAid to ETV\nawwvwmwww By Del Carnes\nrfiLORADO BROADCASTERS ASSN.\nThas gonePon record opposing any federa\nI legislation granting funds for educational\ne—j? rii. -\nvelopment of ETV. .'federal intrusion into the\nfree ‘\"“rpn^ and tt,at Amen^ through local\n^mbTn «Z I— needs of each state and\ncommunity.” . rtnt>ome federal fond*\nAn the fBA tis«* resolved not only to oppose\nfor “h, ground* - » f\nuneconomical)\nBon to oppose iny legl»lti*lon^~tg t*\"- “»»\n/L? :rr^3|^3r^?tS\nC'\"'teiMrIbu tte jedem: grmment. It It a fact ol life\n«*«** to «. «*\"**£\nhas proved it. OO^V.\n;he national through local determination of the educ.tlooa\nneeds of eaeh state and community. believe\nIf it i—— what i think It means, then l don t believe\nIt. And neither, apparmBy. d\"ea Newton Mlnow. litoow.\nthe dynatnlo yomtg bora «t the Federal\nCommission, broedcantlng. resalatory body, tan apokM up\noften for ETV and would like to see Its expansion.\nBv their very nature, commercial broadcasters will nev-\ner S!nfc,n ruling .he «* - educancoalbroa-\ncasters. It just ian’t profitable for them. And I dent for\none minute suggest that they- program all year without turn-\nmB Although commercial broadcaetera have donated Ante,\nmoney and effort in behalf of KTV, they have tutsunted a\npatemalisUc aMltnde toward, the\nLienee, arts, language, ete., instead of westerns, private\n^rtyZ^Tu is all right for poppa to pipe pmior a\ndime every now and then, but don’t let the neighbor do\nit or the boy will get spoiled*\nThose interested in color television willMbs. Intmw\nrartd in o story on pope 19 by Jmntno Dthner. Mto\nnihuttr *avs color TV not only i* becoming\ntechnically, but ha* taken on the a*pect of a *♦«♦«*\nsymbol. #\nKRMA-TV, Denver’s ETV outlet, Thursday night (at 7:S0\np.m.) begins televising the award winning “Science in\nAction” series. The half-hour shows, which have been run- I\nning since 1950, are designed not only to keep viewers in- |\nformed on important developments in all phases of science\nbut to entertain and to stimulate as well.\nThe series explores such topkm as spaee, the *>Iar\nsystem, high blood pressure, arche<5*le»i finding*. cowraic\nravs nuclear rockets and man-made maladies.\nProducer of the aeriee i» Brttjmnb. Dra7',0™*'\nveritewho head, the televiaion department of Bte Calif'’\"''*\nz ~ sr ;srJ^r—\nLTand'IjXZ^nT tub*. -\nstarts.\nQ 3# tjC(: ^\ncZ'-tlsC f ^^ ^ 'yH-4"
}