{
  "id": "d827-38",
  "text": "March 15, 1$6Z\nThe Honorable Warren G. Magnuson\nChairman\nSenate House Interstate and Foreign Commerce Cossaittee\nHew Senate Office Building\nWashington 25, D. C*\nDear Senator Msgnuson:\nThe raeafoership of the national Association of Educational\nBroadcasters is extremely concerned about the deleterious effect the\nGriffin ajaendaent to H*B* 132 will have upon the effective use of the\nmoney provided by the Magauson-Boberfcs bills for the necessary ex-\npansion of educational television in the various states* it seems\nunfair and unwarranted to exclude an approved non-profit educational\ncorporation from participation In these benefits because among its\nsupporting meuft>ership may be public libraries, museums, private foun¬\ndations, private educational institutions, and members of the general\npublic*\nThese are all elements of the general effort for public\neducation and their support and participation in the development of\na local educational station will in no way affect the value of such\na facility for public elementary, secondary, and college instruction,\nand it will add mash to it in terms of resources, and general adult\neducation.\nOn the other hand, if this amendment were allowed to stand,\nthere is no doubt that it would greatly inhibit the development of\neducational television in state networks and in regional networks, as\nwell as in the local communities • Every place a community has developed\nan educational television facility, or is organised to develop one,\nwould have to be excluded from networking participation under the\nGriffin amendment; such exclusion of a key location might preclude the\nactual development of such a network. How inimical this would be to the\npurposes of the Magnuson-Roberfcs bills can be better understood when\nit is realized that most initial activity and the greatest development\nin educational television have come from the type of non-profit educa¬\ntional organization that would be excluded by the amendment."
}