{
  "id": "d827-43",
  "text": "-4-\nAdministration and supported in testimony by the American Council on Education. (See\nthis Bulletin, Vol. XI, No. 4).\nThe Senate Committee on Labor and Public Welfare has pending before it a companion\nmeasure, S 1072, on which hearings were held in the spring of 1961. No further action\nhas been taken on S 1072 since then, and the Soaate Committee is not expected to take\nup the bill until the House has acted.\nDigest of Committee Bill--The provisions of HR 4999 as amended by the Committee on\nInterstate and Foreign Commerce and ordered reported are summarized in an official\nrelease from the Committee as follows:\nI. Construction of Teaching Facilities: $45,000,000 annually are authorized for\ngrants for the construction of new teaching facilities for the training of physicians,\npharmacists, optometrists, podiatrists, nurses, or professional public health personnel;\n$15,000,000 annually are authorized for grants for the construction of new teaching\nfacilities for the training of dentists; finally, $15,000,000 annually are authorized\nfor replacement or rehabilitation of existing teaching facilities for all of the fore¬\ngoing categories.\nMatching grants for construction of new schools, and for major expansion of existing\nschools may be made up to 2/3 of the cost of construction. Other grants may not exceed\n50 percent of the cost of construction, and may only be made where the school will\nexpand its first-year class enrollment by at least 5 percent (but not less than 5 stu¬\ndents) . Grants to schools of Public Health may be made up to 75 percent of cost of\nconstruction.\nII. Student Loans. The 5-year loan program authorizes loans to students of\nmedicine, dentistry, and osteopathy. The loan program is administered by the individual\nschools which would be required to put up 10 percent of the funds lent. Loans are re¬\npayable within 10 years beginning 3 years following graduation. Up to 50 percent of\nsuch loans (at the rate of 10 percent a year) may be forgiven upon certification by the\nState Public Health Officer for practicing in a shortage area, or for employment by a\nGovernment agency or a nonprofit organization.\nIII. Research Facilities. The amendment would extend for a period of 3 years the\n50:50 matching grants for the construction of health research facilities. The maximum\nexpenditure authorized is $50,000,000 annually. The amendment also authorizes grants\nof up to 100 percent for the construction of national or regional health research\nfacilities which are of particular value as a national or regional resource for research.\nIV. Maximum 10-Year Authorization: 10-year program for construction of teaching\nfacilities including planning for such facilities, $755^000,000; ^-year extension of\nconstruction of health research facilities (not including regional and national\nfacilities), $150,000,000; 5-year student loan program (a substantial portion of this\nsum however, is repayable), $72,500,000.\n45 th ANNUAL MEETING\nPICK CONGRESS HOTEL\nAMERICAN COUNCIL ON EDUCATION\nOCTOBER 4-5, 1962\nCHICAGO, ILLINOIS\nA Bulletin Published Irregularly by\nAND NATIONAL AFFAIRS\nAMERICAN COUNCIL ON EDUCATION\n1785 MASSACHUSETTS AVENUE, N.W., WASHINGTON 6, D. C.\nDistributed free in specified quantities through the heads\nof organizations and institutions holding membership in\nthe Council. Individual subscriptions $5.00 per year."
}