{
  "id": "d827-45",
  "text": "March 19, 1962\n|p\n0\nSenator Warren G, Magnuson\nSenate Office Building\nWashington 25, D. C.\nDear Maggie:\nI want again to tell you how very much we appreciate the work you have\ndone in behalf of educational broadcasting, through steering your own\nbill for federal assistance to educational television through the Senate,\nand finally getting the House to act on the matter. You have performed\nan important service to the country in making it possible to activate\nmore of the reserved channels.\nAs you approach the conference sessions to iron out the differences between\nthe two versions of the legislation, I would like to tell you of a few\nconcerns I have:\n1. There has been a great deal of pressure exerted by the Telephone\nCompany either to force inclusion ofleased micro-wave inter-city circuits\nor try to scuttle the whole thing. I have told the local folks, who were\nasked by their New York office to try to persuade me to their point of view,\nthat I thought any attempt tc include any operating expenses, whether rental\nof micro-wave channels from the telephone companies, or other, would surely\nkill chances to get any legislation. Neither stations or viewers should be\npenalized just because AT&T is committed to lease of facilities, rather than\nsale. I hope this dog-in-the-manger attitude does not prevail.\n2. I think there is no concern in educational circles about the \"matching”\nfund requirements of the House bill. It is something we can live with\nallright.\n3. The $10,000 matching find for the state surveys is probably too small. It\nis quite likely that the average state survey will cost considerably in excess\nof the $20,000 contemplated by this. Perhaps $20,000 of federal funds to be\nmatched by $20,000 of local funds would be more realistic. The state studies\nmust be well done if they are to have real meaning.\n4. Bill Harley, President of NAEB, is quite concerned over the\"bureaucracy\"\nwhich appears to be developing over the administration of the bill in the\noffice of the Commissioner of Education. They are beginning to draw up\nregulations, duplicating the responsibility requirements of the FCC — planning\nto inquire into legal, financial, programming, etc. competencies of the\napplicants — to the point where its possible they could dissipate a large\npart of -the funds as well as negate the authority which should be reposed\nin the state educational television agencies. Perhaps it would be better to"
}