{
  "id": "d827-90",
  "text": "himself, the Secretary is placed in a position where he may\ndesignate a person responsible immediately to him who will be in\na position to expedite the formulation of such policies and the\nmaking of such decisions. However, the full responsibility for\nthe administration of the program remains with the Secretary,\nwith whom it has been placed under the conference agreement.\nThe conferees anticipate that the Secretary will keep the\ncommittees of the Congress responsible for this legislation\nadvised at regular intervals of the operation of this program.\nThe decision of the conferees to enact this legislation in\nthe form of an amendment to the Communications Act of 1934-\nlikewise lends emphasis to their view that this program is a\nprogram aimed at promoting particular broadcast services within\nthe general framework of broadcasting in the United States.\nAttention is called by the conferees to the provision contained\nin the legislation that the Federal Communications Commission is\nauthorized to give to the Secretary all assistance requested by\nthe Secretary to carry out the program. The conferees are\ngratified that the Federal Communications Commission has\nrecently established in its Broadcast Bureau an Office of\nResearch and Education for the specific purpose of assisting\neducational broadcasters in their efforts directed at expanding\nand improving educational broadcasting. The conferees are\nconfident that the Federal Communications Commission will put\nforth its best efforts to promote the educational television\nprogram provided for in this legislation. If the Secretary will\navail himself of the expert services which can be rendered by\nthe Federal Communications Commission he will be in a position\nto minimize the administrative expenses incurred in connection\nwith the execution of this program.\nENTITIES ELIGIBLE FOR CONSTRUCTION GRANTS.-- Under the\nHouse amendment nonprofit community educational television\norganizations would not have been eligible to receive construction\ngrants. The Senate bill would have permitted any nonprofit\nfoundation, corporation, or association which was organized to\nengage in or encourage educational television broadcasting to\nreceive construction grant funds.\nThe conference agreement makes eligible to receive\nconstruction grants any nonprofit foundation, corporation, or\nassociation, which is organized primarily to engage in or\nencourage educational television broadcasting and which is\neligible according to the rules and regulations of the Federal\nCommunications Commission in effect on April 12, 1962, to\nreceive a license from the Commission for a noncommercial\neducational broadcasting station.\n-10-"
}