{
  "id": "d1337-1",
  "text": "WHAT WNYC IS DOING\nWAR EFFORT PROGRAM\n54^ §f WNYC’s entire broadcast schedule is devoted to war effort? and civilian\ndefense programs. Other stations cooperate in the war effort, b>ut no station\ncan match this record.\nThe following official government war services programs wore instituted by and\narc hoard exclusively over WNYC: ' \"\nFor over 170,000 Air Wardens, WNYC carries regular programs\nTo more than 40,000 Fire Department Emergency Auxiliary Cofcrps (P^EAC)\nmembers, WNYc 'broadcasts nightly instructions\nThe HELP V/AHTED COLUMN OF THE AIR of tho United States Employment\nService is broadcast twice daily by WNYC\nTb. Selective Service Board Members and civilians, WNYC broadcasts\nregular programs from Selective Service Headquarters,\nPrograms from the Civilian Dofenso Volunteer Office at Pershing Square\nis another source of regular WNYC broadcasts.\nSpecial War Emergency Services:\nSelective Service Registration: During Selective Service registration\nperiods, WNYC broadcast directly from Selective Service Headquarters,\ngiving up-to-the-minute instructions and late information to lLocal\nBoards and registrants.\nRationing Registration: During the registration of Nov/ York’s sevypn\nand one-half million citizens for War Ration Books, WNYC was th<^\nmedium usod by tho Board of Education to roach the 35,000 teachotT\nregistrars with last minute instructions, and to give important dir¬\nections to tho millions of registrants,\nWoro WNYC to perform no other function during tho entire yoar, tho\ncost of this service to the City for facilitating tho registration ,\nof tho seven and onc-half-million people during the throe day period\namounts to only $0,013 (LESS THAN A CENT AND A HALF PER PERSON),\nRation News and Necessary Consumer and Marketing Information for New York House\nwives comprise 12/b of' all WNYb' broadcast time;\nTwice daily ration nows roundups (3:55 and 8:55 p,m,) i\n23 other separate and distinct rationing and consumer programs weekly:\nTHE CITY CONSULAR GUIDE - Department of Markets\nRATIONS AID RECIPES - Mrs, F* F, Gannon, Dopartmont of Markets\n' OFFICIAL 0, P. A, CONSUMER NEWS\n0, P, A, CONSUMER DRAMA"
}