{
  "id": "d1337-15",
  "text": "The scenery track is the variety used for sliding- olos'et doors used in homes and\nis manufactured by the Washington Steel Products Company of Tacoma, Washington^\nKCTS installed theirs in 20 foot lengths running completely around the studio.\nTheir flats were hung from the tracks to within an inch of the floor so that\nmerely by rolling the proper flats in place four back, drops may be used for a given\nlighted area. It is believed that this sytem will save considerable studio space\nand make scene shifts much easier and practically effortless. The,- nylon wheels\non the tracks1 are camparatively quiet in operation.\na it it a a » it a it it a\nCongratulations to K. Winston Bugg of WABE, Atlanta, Georgia, who was transferred\nto the Senior Member Grade in the Institute of Radio Engineers.\nit it it if it it a * it it it\nYour NAEB TV Engineer has been elected to Active Membership in the Society of\nMotion Picture and Television Engineers.\n###########\nCongratulations,too, to Mr. and Mrs. Lawrence C. Anderson of WHA-TV whose 7 lb.\n3 oz. baby daughter very conveniently waited to arrive until her father returned\nhome from the NAEB TV Engineering Workshop.\na a a a a it it it & it it\nNAEB Staffers, husbands, and wives, got together with 100% attendance at a Christ¬\nmas Party at the Bidlack’s on December 16. Phe Skornias, Hills, and Bidlacks were\nco-hosts for the affair. Some very novel gifts were features of the gift exchange.\nNAEB Engineering secretary Cathryn Polanka and her fiance John Reed were presented\nwith the gift of a spice set in honor of their approaching marriage December 26.\nNAEB President Frank Schooley and Mrs. Schooley were also there.\nit it it it a it it it it it it\nAn engineer's dream of a ONE MILLION WATT television station is now a reality wi£h_\nthe installation of a new RCA UHF transmitter for WBRE-TV (Channel 28) at\nWilkes-Barre, Pennsylvania. In another month, G.E. will install its \"first megawatt\ntransmitter at WILK-TV (Channel 34) also in Wilkes-Barre. Thus Wilkes-Barre will\nbecome the showcase for the ultimate in TV power and these two installations may\ndo much to strengthen the cause of ultra-high frequency television.\nIn achieving the goal of one million watts, RCA and G.E. use slightly different\napproaches, although both use their 12 kw transmitters as building blocks. RCA\nmodifies two of its 12^- kw transmitters to get 25 kw power, feeds the output into,\nan antenna with a gain of 46, using conventional beam tetrode tubes in the output\nstage. G.E. gets its 45 kw by harnessing three 12 kw units, modified so there are\n4 klystron powered ..visual amplifiers, 2 aural, feeding a conventional 25 gain\nhelical antennai\nRCA's 46 gain antenna is 96 feet long, weighs Tg- tons and will be shipped and\nhoisted in two sections. G.E. uses-its standard 5 bay helical UHE. ajxtenna. which\nis 43 feet long and weighs 1-J- tons.\n—TV Digest\n\" * it it it it it it it it it it it\nPlanning to shoot color film for television? If so, CBS Television Engineering\nDepartment „has prepared a small brochure titled \"Color Television Film Shooting\nPractices. It contains recommendations as regards staging, lighting, cameras,\nfilm, and last but certainly not least, sound. Write to the CBS TV Engineering\nDept., 485 Madison Avenue, New York City, for a copy."
}