{
  "id": "d1337-3",
  "text": "NAEB INAUGURATES AN ENGINEERING SERVICE\nWhen Cecil S. Bidlack reported at NAEB Headquarters in Urbana, July 1; he be¬\ncame its first Television Engineer and thus inaugurated an engineering service\nto its members. , t\nThis, new engineering position was made possible by a grant to the NAEB'from the-\nFund for..Adult Education. In a letter to President Ausmus,-Miss Martha C. • How¬\nard, a member of the FAE staff, expressed the hope that the grant \"would enable\nthe National Association of Educational Broadcasters to plan sufficiently far\nin advance to render an engineering service of the highest caliber to the devel¬\noping educational television stations of the country.\"\nMr. Bidlack has been a member of the radio staff (WTAM) and a technical director;\non the television engineering staff (WNBK) of the National Broadcasting Company\nin Cleveland, He has been actively engaged in television work since May of 19U8\nwhen he went to NBC in New York for television training. In New York, he par¬\nticipated in studio and field television operations including the 19h8 political\nconventions in Philadelphia.\nHe is not,new in the educational field having been Technical Supervisor of WOSU,\nthe Ohio State University station, for eleven years prior to moving,to Cleveland\nin 1938. He. graduated with an Electrical Engineering degree from Ohio State\nUniversity.\nOne of Bidlack*s first duties was a trip to the New York area to complete arrange¬\nments, for the NAEB Television Engineering Workshop to be held October 19. to 27\ninclusive. The NAEB Engineering Committee has selected and notified all success-**\nful applicants for this workshop. Their names are listed elsewhere in this\nmonth*s Newsletter. (See the August Newsletter for Workshop details.)\nWhile on this trip east, Bidlack visited WGBH and the upcoming WGBH-TV. He went\nover studio plans in detail with Hartford Gunn, Jr., Assistant Manager for Opera¬\ntions who reports a number of Bidlack* s suggestions, were passed on to the .archi¬\ntects. - . ••'•••••\nHe also visited WCjED in Pittsburgh on-the return trip to observe facilities arid\noperation there. On August 12, he met in an advisory capacity with a sub-commit-:\ntee of the Iowa Joint Committee for Educational Television to help work out a\n\"minimum package\" for educational television in Iowa, On this trip he inspected,\nfacilities of WSUI, and the State University of Iowa closed circuit TV studio at'\nIowa City; WOI-T? and WOI at Ames, Iowa; and the facilities of WHA-T? and WHA in\nMadison, Wisconsin. -\nRequests for information on film scanning equipment from the University of Ala¬\nbama, and for data on studio switching systems from WKAR-TV at Michigan State\nCollege have been received and information supplied in spite of the fact that\nthe TV engineering reference material is building up slowly.\nOn August 2.7, Bidlack appeared on the program of the pEB Production Workshop at\nEast Lansing. His topic, ’.'What the .Educational Producer Should Know about Tele¬\nvision Engineering,\"\" He also visited WKAR-TV and WCET in Cincinnati, to observe\noperation and see their facilities.\nWOSU-TV has requested Bidlack*s services for staff training when it is ready to\ngo on the air late this fall."
}