{
  "id": "d1337-6",
  "text": "7-\nmembers to ask if they had a surplus FM antenna to take care of the WUOA request.\nHowever we can make use of NAEB and the Newsletter to make availabilities and\nwants known to all members. TJhy not try it?™\nx x x *- x x * x x x\nSetchell Carlson, Inc., New Brighton, St. Paul 12, Minnesota, manufactures a 17\ninch television monitor, Model K£6, which sells for 0199 less audio or j2lU with\naudio. It features unit construction with the main power supply permanently\nattached to the main chassis and three plug-in units: 1) Horizontal oscillator\nand high-voltage section, 2) Video amplifier, sync separator and sync control\namplifier, 3) Vertical oscillator and output and audio amplifier, if desired. It\nis enclosed in a gray metallic finished plywood cabinet and uses a 17KPh picture\ntube. Audio output is 1.7 watts at hOO cycles at less than 10% distortion. These\nmonitors are being used at KUOM and WHA-TV in case you want opinions of their\nsuitability.\nx x -x- x x x x x x x x\nWeston Electrical Instrument Co., Newark 5>, N.J., makes a TV studio Lightmeter\nModel 9l£ TV which lists at 00. It has two ranges 0-300 foot candles for\nnormal lighting for black and white TV and a range of 0-1^00 foot candles for\nthe higher illumination levels required in color TV. It is an incident light\nmeter whose acceptance angle exceeds 180 degrees.\nFROM THE FCC\nThe 31st and 32nd construction permits for educational television stations were\ngranted recently by the Federal Communications Commission. The CP*s went to\nthe Detroit Educational Television Foundation and the Oklahoma Educational Tele¬\nvision Authority respectively. The Oklahoma CP is for a station in Tulsa on\nChannel 11. The Oklahoma ETV Authority has been previously granted a CP for a\nChannel 13 outlet at Oklahoma City.\nThe Michigan State Board of Agriculture has asked the FCC to designate commercial\nVHF Channel 10, assigned to Parma-Onandaga, Mich., as a non-commercial educational\nchannel in connection with a proposed channel and location switch for WKAR-TV.\nWKAR-TV noitf operates non-commercial on UHF .Channel 60 at East Lansing.\nThe Alabama Educational Television Commission has applied to the FCC for an edu¬\ncational, non-commercial TV station on Channel 10 at Birmingham, Ala.\nENGINEERING WORKSHOP ROSIER COMPLETE\nTwenty-six engineers itfill be attending the NAEB Television Engineering Workshop\nin the New York area October 19-27. Of this group, three are from educational\nTV stations now on the air, ten are from stations having construction permits,\nseven are from institutions having closed circuit TV installations, and four are\nactive in helping plan details of educational stations and networks.\nThe workshop is given an international flavor by the attendance of Gerard Colliot\nof Radiodiffusion-Television Francaise. Last October M, Colliot was chosen for\na year*s study in the United States under the Work Study Training for Productivity\nProgram (WSTP) sponsored by the Foreign Operations Administration (FOA) of the\nU. S. Government and the French Government, He will return to France at the con¬\nclusion of the workshop."
}