{
  "id": "d1326-0",
  "text": "TJrbana, Illinois\nMarch 15, 1941\nSUGGESTED NATIONAL DEFENSE S ICR VICE FOR NAEB\nIn response to an NAEB communication to the National Defense\nCommission regarding the part educational, municipal stations\nshould play in the National Defense program, Bernard C, Schoenfeld\nChief, Radio Section, Office for Emergency Management, says that\n\"Your group can be of inestimable value in Defense.\" The letter\nspeaks for itself:\n“You ask if ?/e have any proposals as to how you might help the\ncountry6 We suggest that a group like yours might help us by\nusing radio in the following way:\n£,1 - By using radio to tell the citizens of a particular community\nthe specifier Defense problems and Defense activities of that\ncommunitye Too many radio programs generalize on Defense work\nall over the country. We believe that radio used microscopically\nhas better results,\n“2 - It is very important that we*make the listener aware of his\npersonal relationship to the entire problem of Defense. Facts\nand statistics do not cause a Nation to stand close together in\ntime of emergency, unless each citizen has been made to realize\nhow that fact or statistic relates to him.\n\"Consequently, we would like to see these local programs emphasize\nthe responsibility of each individual in the community in which he\nlives; responsibility of the housewife and what her job is in\nDefense; the responsibility of the school boy and what his job\nis; and so on down the list, with shopkeeper, farmer, teacher,\nbutcher, baker and candlestick-maker. Too many of us think that\nthe only Defense workers are the factory workers and the drafted\nmen. An organization like yours, decentralizing radio to local\nareas, could make everyone realize what his individual job is in\nthe entire picture. Technically, this can be better done through\nsimple and human programs rather than speeches by \"big names\".\n\"Envision the citizens of a town of 4,000 listening over the air\nto the machine operator who lives down the block, listening to\nthe foreman who comes from that region, listening to the president\nof the plant discussing the doings of this plant in the Defense"
}