{
  "id": "d1326-3",
  "text": "NaEB NEWS LETTER ... March 15, 1941 . Page 4\nWNAD EXPANDS ON MARCH 29\nWNAD, University of Oklahoma radio station, will go on its new\nwave length of 640 kilocycles March 29 and broadcasting will be\nstepped up from nine hours a week to approximately 10 hours a\nday.\nThis new increase in time and new wave length has been approved\nby the federal communications commission. WNAD will continue\nits present power of 1,000 watts*\nUnder the new arrangement, WNAD will be able to give complete\ncoverage to Oklahoma., Additional equipment will be added to\nincrease the range of the station. The new wave length enables\nthe state to serve a larger area.\nWNAD is a non-commercial station, and was one of the earliest\nbroadcasting stations in this part of the country*\nOH. ELMER 1 HERE IS W1LVT KENTUCKY IS DOING\nAgain, Kentucky Elmer Sulzer of Lexington responds. Says Elmer,\n\"Perhaps the following activities of the University of Kentucky\nmay be of interest.\"?\n\"1. During the early part of the Christmas holidays we broadcast\na fifteen minute program over coast to coast Mutual dedicated\nto the Homecrafters Clubs of America and featured interviews\nwith members of the Lexington Homecrafters (Which group has\nincidentally provided toys for our mountain listening centers?\nfor the past three years). We included on this program a few\nmusical numbers by our staff orchestra typical of Christmas\nand the mountains.\n\"2. At the present time we are making a series of six record¬\nings for the Kentucky Society for Crippled Children. These\nfifteen minute recordings will be used on virtually all Ken¬\ntucky radio stations in connection with the Society in their\nannual spring drive for funds. The programs are built around\nthe doings of a central character — a crippled child who\nwe call Captain Pluck. Our staff orchestra furnishes a\nmusical opening rnd close*\n\"3. We are broadcasting each week over WLAP, Lexington, a\nseries of fifteen minute evening programs for the aviation\nEnlistment Office in Lexington.\n\"4. Last slimmer we presented a thirty minute program each Sunday\nafternoon over WLW bearing the title, \"Visiting Kentucky*a\nIndustries\". These broadcasts were made from the scenes of\nKentucky* s largest industries."
}