{
  "id": "d1224-0",
  "text": "of the NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. 30, NO. 6 WASHINGTON, D.C. JUNE, 1965\nNAEB Comments on\nTranslator Proposal\nIn comments concerning the FCC proposal to liberalize its\nrules regarding authorized power and available frequencies\nfor TV translator use, the NAEB expressed general support\nfor the principles and aims of the proposal. However, the\nNAEB filing also explored some doubts about certain aspects\nof the plan.\nThe proposal would permit secondary use by high-power\n(up to 100 watts) TV translators on all unoccupied unreserved\nassignments in the Table of Assignments.\nThe NAEB questioned the wisdom of linking the proposal\nto the present Table of Assignments when a modified Table\nis currently being considered in another docket. The NAEB\nproposed that the FCC resolve the over-all UHF docket pro¬\nceeding first, and then provide opportunity for additional com¬\nment in the current proceeding in light of those conclusions.\nECS Enters Design Phase\nUnder a new contract with the U. S. Office of Education,\nthe NAEB ECS project will design three model systems to\ntest the feasibility of furthering academic cooperation by\nmultipurpose electronic networks. One system will emphasize\nintra-state cooperation, one will be regional, and one will con¬\ncentrate on use of non-university resources such as leading\ncultural and research institutions. The USOE contract will\nsupport the 18-month design phase at a cost of nearly $145,000.\nNAEB-NER Receives Grant\nFor the second year, the National Home Library Foundation\nhas awarded funds to NAEB’s educational radio stations.\nNER will use the $30,000 grant for production grants-in-aid;\nto distribute programs from domestic and foreign sources, with\nemphasis on literature and drama; and to provide program\nconsultation services.\nIn making the grant announcement, NHLF officials indi¬\ncated that they were pleased with the use to which the funds\ngranted last year were put. The initial grant made possible\nthe production of more than 100 programs, which are being\nreleased via NERN this year.\nAttention Speakers,\nConsultants, Evaluators!\nThe NAEB is developing a list of outstanding professional\nresource personnel for ETV, to be published in a “Personnel\nResource Guide” for members, educators, and laymen. The\nguide will not be exclusively a speaker’s guide. It will include\nnames of people who can serve as consultants, evaluators, and\nspecialists as well.\nThis will not be exclusively a source for free assistance.\nWhere expenses and/or honoraria are required, the guide will\nso indicate.\nThe committee of NAEBers working on the project is\nasking for recommendations. Please submit names and the\ntopic area or areas in which each can best serve to NAEB\nWashington by August 1, 1965.\nSole Radio Peabody Award\nGoes to WRVR-FM\nTwo \"firsts\" were established recently with the awarding of the\n1964 George Foster Peabody Award to WRVR-FM, Riverside\nChurch station, New York City. It was the first time in the 25-\nyear history of the awards that an entire radio station received\nsuch recognition, and it was also the first time that only one\nradio award was made.\nIn the photograph, Jack D. Summerfield (center), WRVR\ngeneral manager and chairman of the NER Board of Directors,\naccepts the award from John F. Drewry, dean of the University of\nGeorgia's Henry W. Grady School of Journalism, which, with the\nPeabody Board, administers the annual awards. Paul Porter, Pea¬\nbody Board member and former FCC chairman, looks on.\nSummerfield expressed appreciation to the affiliates of NERN\nand to the NAEB, as well as to those directly involved with\nWRVR. The Peabody was WRVR's ninth award in thirteen months.\nThe citation noted that \"Riverside Radio WRVR-FM has be¬\ncome one of the most influential factors in the expanding use of\nFM radio. It not only serves the discriminating metropolitan New\nYork listeners, but its tapes have been used by 105 radio stations\nfrom Alaska to Florida, and by networks abroad. This process of\ncross-fertilization is lifting the entire moral, intellectual and cul¬\ntural levels of radio.\"\nAmong the 1964 television winners were NET's \"The French\nChef\" and \"Intertel.\"\n1"
}