{
  "id": "d1076-1",
  "text": "will be sent to the presidents of all colleges and uni¬\nversities with enrollments of over 1,000, over the\nsignature of Purdue President Dr. F. L. Hovde.\nNAEB members can help support the project by\ntaking every opportunity to endorse the project to\ntheir administration.\nJames S. Miles will be director of the conference\nfor the NAEB and Purdue, Consultants and staff\nwill be announced later.\nSTATION MANAGEMENT SEMINAR\nPlans are also in progress for the seminar in Edu¬\ncational Television Station Management which is\nslated for August 24 - 27 in Madison, Wis. Managers\nplanning to attend are asked to notify the planning\ncommittee and suggestions on the content or conduct\nof the seminar are also requested by Richard L. Rider,\ncommittee chairman. Further details will be available\nlater.\nMEMO FROM THE\nEXECUTIVE DIRECTOR\n—Harry Skornia\nThere are numerous things to report on at this time.\nMost of these (upcoming Seminars, Workshop Grant-\nin-Aid results etc.) will be found in separate stories\nin this issue and later issues, and other brief items\nwill be reported on orally at the NAEB luncheon at\nthe IERT in Columbus, May 12, at 12:15.\nWe’ll hope to see as many of you as possible there\nand at the NAEB TV and Radio Utilization sessions\nat 2:15 the same day. These were organized by Gale\nAdkins’ committee, and sub-committee chairmen\nGeorge Johnson (radio) and Clair Tettemer (TV).\nThey promise to be excellent.\nA word is in order on the NAEB Seminar on\nChildren’s Television Programming held at Boston\nMarch 29-April 1. Over twenty NAEB people were\nin attendance. I believe all indicate that they gained\ngreatly from it.\nAlthough this was essentially a separate NAEB\nSeminar, provided for from our current Ford Founda¬\ntion grant, it was held concurrently with the Seminar\nfor commercial station and network personnel respon¬\nsible for children’s programs. Held by Boston Uni¬\nversity with a grant from the Foundation for Char¬\nacter Education, the latter Seminar was directed by\nDr. Ralph Garry of the Boston University School of\nEducation, assisted by Dr. David Mackey.\nNAEB local hosts were the WGBH-TV staff,\nnotably Henry Morgenthau III, and Hartford Gunn,\nJr. Dr. Fred Rainsberry of the CBC, and Harold Hill\nalso contributed mightily to the planning of what\nturned out to be a most successful meeting.\nHolding both seminars at the same time and in\nthe same place, with some overlap of general sessions,\nenabled us to share the talent and expense of the\nnumerous fine consultants: Eugene Hallman, Bruce\nAttridge and Patricia Latham of the CBC; Eleanor\nand Nathan Maccoby of Harvard and Boston Uni¬\nversity, respectively; Dr. Frederick Sheffield of Yale;\nDr. Dale Harris of the University of Minnesota; Rob¬\nert Homme of WHA-TV; Robert Lewis Shayon of\nSaturday Review; Dr. Alberta Siegal of Stanford;\nDr. Arthur Lumsdaine of California and Armed Serv¬\nice Studies; and Dr. Urie Bronfenbrenner of Cornell.\nIt also made possible the sort of interchange between\ncommercial and educational children’s program people\nwhich is all too rare—though participants would have\nliked still more. A transcript of the. proceedings is\nbeing taken off tape by the CBC, and we hope a\nworth-while publication will result.\nA similarly fine report of the recent NAEB Re¬\nsearch Seminar, held at Ohio State, is in the last stages\nof preparation by Keith Tyler.\nSo much for meetings. At this point I’d like to\ntalk over briefly with you something else, about which\nI have strong convictions.\nI think there was a tendency in the early days\namong educational broadcasters to consider ourselves\nessentially technicians. We aped commercial tech¬\nniques. It was not what we transmitted, but how we\ncould “dress it up” and give it “the old socko” that\nconcerned all too many of us. I think this has been\none of the problems which commercial broadcasting\nhas not adequately solved—and it is responsible for\nmany of the criticisms of our time.\nWhat I’m trying to say, I think, is that we must\ncontinue increasingly to have standards, and a social\nphilosophy. We must have a character of our own, so\nthat what we stand for is clearly recognizable. The\nvalues we stand for should be worthwhile ones, the\nsame ones which motivate the highest ideals of de¬\nmocracy and education. We and our facilities must\nnot be, as adult educator John Walker Powell of the\nFAE describes it, “a taxi that people can take in any\ndirection they want to go.”\nWTe should, I think, stand for respect for intellect¬\nual activity. We should be against concern only with\nmaterialistic values. We need not be neutral—we\ndon’t give burglars “equal time” when we do law en¬\nforcement programs. Our culture, mores, and public\nand private life are characterized by certain things\nwhich our nation’s principles and our own consciences\n2\nNEWSLETTER"
}