{
  "id": "d1076-2",
  "text": "tell us we shouldn’t do. We must not get caught in\nsaying—“you shouldn’t do this, but if you do, here’s\nhow to do it better.”\nIn other cases the commitment is less firm. We\nmay not have to take sides for or against reciprocal\ntrade, as Mr. Powell puts it, but we must be for\nhaving it discussed intelligently, and decided about.\nThe same goes for atomic tests and conservation of\nnatural resources and all the rest.\nThe “veto” influences which so generally and fre¬\nquently keep certain types of discussion or programs\noff A-time on commercial stations (and I recognize\nthe sponsorship and other business-like considerations\nwhich justify this) should not be effective in our\ncase.\nIf we are to have the courage and the freedom to\ndiscuss all the things that need discussing, of course,\nwe must each carry on constant educational programs\nfor our governing boards and other supervisors. For\nmany of the problems we should be discussing are\n“controversial.” And heaven help us if we avoid con¬\ntroversy only because controversy gives us prob¬\nlems—even though obviously all of us make certain\ncompromises in order to survive. But we must quite\nfrequently have the courage to challenge the status\nquo, or the directions our society seems to be taking.\nWe must take issue with “the others” when we have\nsomething to contribute. If we, with the perspectives\nand resources which our educational parent institu¬\ntions contain, do not do this, who will?\nTherefore, I believe that once an “educational”\nbroadcaster enters the field, he has sobering and al¬\nmost terrible responsibilities for the exercise of cour¬\nage, tact and imagination. How well we live up to\nthese responsibilities will largely determine how im¬\nportant and indispensable a force we become in our\nnation and the’world—how much we really deserve\nto survive as a separate service. For, important as\nclassroom television and radio for children and schools\nnow are, we can’t wait for the younger generation to\ngrow up, to solve many of our most pressing problems\nnor must we leave them with such intolerable condi¬\ntions that they can no longer correct them. General\nprograms, and adult education programs, are all also\nan important part of what we, as a group, should be\nthinking most seriously about.\nBOX SCORE\nTotal\nAM\nStations\n- 3229 (includes 38\nnon-commercial)\nTotal\nFM\nStations\n698 (includes 158\nnon-commercial)\nTotal\nTV\nStations\n- 586 (includes 31\nnon-commercial)\nNETWORK NEWS\n—Bob Underwood\nThe new network offering, that for the third quarter\nof 1958, is now in distribution to the network stations\nand copies of it are available to others upon request.\n(A number of offerings will be available at the NAEB\nexhibit at the IERT.) We feel this offering contains\nseries particularly appropriate for summertime listen¬\ning, and we expect wide acceptance from those sta¬\ntions remaining on the air during the summer.\nOur plans for network programming during the\nnext academic year are in formation, and we honestly\nfeel this coming “season” will be one of the finest\nin the history of the network. This optimism is based\npartly on the availability of numerous grant-in-aid\nseries which will be offered during the period from\nOctober 1958 through June 1959. In addition to these\ngrant-in-aid series we have two new music series: a\nnew season of Little Orchestra Society Children's\nConcerts, a series from UN Radio, another Carnival\nof Books series, and Cooper Union lectures. These\nseries, plus others now tentatively scheduled, promise\nexcellent programming for network stations in the\nmonths ahead.\nIn addition to these regularly scheduled programs,\nthe network has been fortunate enough to acquire a\nnumber of special programs which we have been\ndistributing regularly and will continue to distribute\nas additional special programs come to our attention.\nIn past weeks we have distributed a reading of Dr.\nSchweitzer’s “Declaration of Conscience,” a special\ndocumentary on “The Maidens of Hiroshima,” in-\nviews with, among others, a young American who\ntoured Communist China and an important Japanese\npolitician; not yet distributed at this writing is the\nLinus Pauling-Edward Teller debate on “Fallout and\nDisarmament.” Thus, it is evident that the network\nis providing its members with the type of program¬\nming one would expect to find on noncommercial\nstations.\nWe have some plans to improve the flow of in¬\nformation on programs from the network office to\nthe stations. The bulk of this information will be\ncontained in the weekly cue sheets, according to\npresent plans, and this new use of the cue sheets will\nbegin with Issue 27. Naturally, addenda to the in¬\ndividual offerings will continue to give what advance\ninformation we have on series; the use of this system,\ntoo, will be stepped up beginning with the third\nquarter offering. All network stations should examine\neach week’s cue sheets carefully from now on.\nI hope that I have the opportunity of seeing many\nMAY, 1958"
}