{
  "id": "d1076-7",
  "text": "highway safety problems in Massachusetts. This is\nthe first time since the awards were established in\n1934 that a university radio station has been honored.\nThe program was cited as “the best public service\nseries by a radio station in the United' States, out¬\nranking a large field of commercial station entries.”\nThe META-Board of Education series, the “Living\nBlackboard,” has been awarded a special citation from\nthe Manufacturing Chemists’ Assn, in recognition of\nan outstanding contribution toward advancing an un¬\nderstanding of and interest in science. The series\nprograms particularly named were “Science Corner,”\nthe “Science Club,” and “Career in Focus.”\nOn the basis of fine symphonic broadcasts and a\nhigh intellectual level of programming, WDET,\nWayne State University’s radio station, was awarded\nETV\nSTATIONS ON THE AIR\nKCTS\nSeattle, Wash.\n9\nKETA\nOkla. City, Okla.\n13\nKETC\nSt. Louis, Mo.\n9\nKLSE\nMonroe, La.\n13\nKOAC-TV\nCorvallis, Ore.\n7\nKQED\nSan Francisco, Calif.\n9\nKRMA-TV\nDenver, Colo.\n6\nKTCA-TV\nSt. Paul, Minn.\n2\nKUED\nSalt Lake City, Utah\n7\nKUHT\nHouston, Tex.\n8\nKUON-TV\nLincoln, Neb.\n12\nWAIQ\nAndalusia, Ala.\n2\nWBIQ\nBirmingham, Ala.\n10\nWCET\nCincinnati, Ohio\n48\nWETV\nAtlanta, Ga.\n30\nWGBH-TV\n• Boston, Mass.\n2\nWHA-TV\nMadison, Wis.\n21\nWHYY-TV\nPhiladelphia, Pa.\n35\nWILL-TV\nUrbana, Ill.\n12\nWIPR-TV\nSan Juan, P. R.\n6\nWKAR-TV\nEast Lansing, Mich.\n60\nWKNO-TV\nMemphis, Tenn.\n10\nWMVS-TV\nMilwaukee, Wis.\n10\nWOSU-TV\nColumbus, Ohio\n34\nWQED\nPittsburgh, Pa.\n13\nWTHS-TV\nMiami, Fla.\n2\nWTIQ\nMunford, Ala.\n7\nWTTW\nChicago, Ill.\n11\nWTVS\nDetroit, Mich.\n56\nWUNC-TV\nChapel Hill, N. C.\n4\nWYES-TV\nNew Orleans, La.\n8\na certificate by the Detroit Advisory Council for Ed¬\nucation by Radio and Television. Another honor\nawarded the university came to its television depart¬\nment as a citation for outstanding programs on\nWTVS.\nThe American Council for Better Broadcasts has\nplanned an outstanding program for its national con¬\nvention in Columbus, Ohio, May 14 and 15. The\nline-up of speakers includes Mrs. Dorothy Culbertson,\nNBC’s coordinator of ETV; Dr. Tracy F. Tyler, editor\nof the NAEB Journal and education professor, Uni¬\nversity of Minnesota; Barrie Thorne, representative\nof BBC; George C. McConnaughey, Esq., former\nchairman of the FCC; and Dr. Leslie Spence, execu¬\ntive director of ACBB.\nNEW YORK ETV APPROVED\nThe New York Board of Regents recently gained ap¬\nproval for the state’s first major venture in educa¬\ntional television. The final step was accomplished\nwith Gov. Averell Harriman’s signature on a bill ap¬\npropriating $600,000 for telecasts over WOR-TV, a\nprivately owned New York City station which of¬\nfered' use of its daytime hours to ETV.\nThe appropriation was previously approved by the\nstate legislature to defray operating expenses of the\nproject. State-financed educational TV previously\nhas been limited to closed-circuit experiments in some\nschools. The new program calls for continuation of\nthose projects and includes a fledgling plan for state\naid to school districts for ETV.\nAccording to an announcement received from the\nNational Assn, of Broadcasters, members of the\nNAEB are invited to participate in the observance\nof May as National Radio Month.\nHAGERSTOWN PLAN\nREPORTED BY NEWSCASTER\nWhen ABC newscaster Edward P. Morgan recently\nspent a few days in Hagerstown, Md., he expressed\nan interest in the instructional TV experiment cur¬\nrently in progress there. He visited Pangborn Ele¬\nmentary School, one of 23 schools in Washington\n(Md.) County that are teaching by television, and re¬\nlated his impressions to his newscast listeners.\nStarted just fifteen months ago, the five-year\nprogram has been helped by contributions and sup¬\nport from the Fund for the Advancement of Educa¬\ntion, the television manufacturing industry and the\nNEWSLETTER"
}