{
  "id": "d1076-8",
  "text": "telephone company. But, as Morgan commented,\n“ . . . the most important ingredients in this labora¬\ntory problem are not the electronic but the human\nelements: the teacher and the child.”\nOne certain conclusion that Morgan found is\nthat the television teacher can reach an almost un¬\nlimited number of students in a curiously personal\nway, without the distractions of huge, unwieldy\nclasses. Morgan described in detail his experience in\nwatching thirty second-graders take a music lesson\nvia television.\nAnticipating the use of TV in other school systems\nhe said, . . communities not so fortunate to have\ntheir capital investment in equipment underwritten\nas Hagerstown has, may get at it through economies\nin the size of the teaching staffs.”\nMorgan examined, too, the possible dangers of\n“softening” American education by using television,\nbut reporting the findings of the Hagerstown experi¬\nmenters he concluded, “Oddly enough, the relatively\nsmall television screen tends to command a child’s\nattention, which almost invariably strays away from\nthe classroom instructor. As one supervisor put it,\n‘television is no substitute for a teacher, but get a\nteacher who can project on TV and make the children\nparticipate and the whole experience comes alive.’ ”\nThe National Assn, for Better Radio and Tele¬\nvision is urging listener-viewer response in an effort to\nimprove programming by “crashing the rating cur¬\ntain” and writing directly to executives of the sponsor.\nA list of addresses has been compiled by sponsor and\ntrade name and may be obtained for 55 cents by\nwriting to NAFBRAT, 822 Victoria Ave., Los Angeles.\n5, Calif.\nWGBH-TV ANTICIPATES POWER INCREASE\nThanks to an equipment gift from Westinghouse\nBroadcasting Co., WGBH-TV, Boston, expects to be\ntransmitting on full assigned power of 100 kilowatts\nnext September. The ETV station, which now uses\n56 kilowatts, estimates the power increase will per¬\nmit reception by 88 per cent of the population of\nMassachusetts and all of Rhode Island, with the\nConnecticut Valley becoming a fringe area.\nWGBH-TV’s gain stems from a 1954 hurricane\nduring which a Westinghouse antenna was blown\ndown, necessitating a power switch for WBC’s station\nWBZ-TV. Rather than have the 25-kilowatt amplifier\nstand idle longer, Westinghouse gave it to WGBH-TV.\nFCC ACTION\nPittsburgh’s educational television station, WQED,\non Channel 13, has asked the FCC for UHF Channel\n22, in hopes of establishing a second ETV outlet in\nthe city.\nIn Walla Walla, Wash., the Commission has sup¬\nplanted VHF channels with UHF, making one avail¬\nable for educational use. The city’s former educa¬\ntional channel will be turned over to commercial use.\nPLACEMENT SUPPLEMENT\nMay I - Available immediately: 16mm. film cameraman with I I\nyears background; fast and accurate with a fundamental\nknowledge of all types of cameras; experienced in instruc¬\ntional and sports films, script preparation, editing. Location\nand salary open.\nMay 2 - Creative teacher with four years experience desires\nchallenging position in broadcasting, eventually working in\nproduction of educational shows, or teaching with school\nETV system. Has had experience in ETV. Man, 26, married,\nB.S. Location and salary open.\nMay 3 - August candidate for M.A. in radio-TV prefers position\nas producer, director, or administrator in ETV or radio.\nSeveral years experience in educational broadcasting; cap¬\nable of handling all phases of production, writing, announc¬\ning. Single male, 27. Desires western location, preferably\nDenver or San Francisco. $5,000.\nMay 4 - Single man, 30, A.M. in television, with TV network\nexperience, seeks production and programming position in\nETV. Hard work a must; in return, results will be of highest\ncaliber. Part-time teaching accepted. Location open.\n$5,400 minimum.\nMay 5 - Vital, professional man, for last five years public re¬\nlations director in addition to duties as dean of liberal\narts college; desires administrative position in educational\nbroadcasting as station manager, program director, writer,\nor producer-director. Experience with weekly public serv¬\nice TV show. M.A., late 40's, married. Location open.\n$7,500-10,000.\nMay 6 - Male, 25, single, M.A. in broadcasting; currently\ntraffic manager of educational radio station, also doing\nETV and radio production; wishes position as ETV producer-\ndirector, or radio program director. Prefers West or Mid¬\nwest. $4,500 minimum.\nMay 7 - Single man, 23, M,.S. in communication arts, seeks\nposition as ETV producer-director. Experience in college\ntheatre, commercial radio; also staging, lighting, flooring,\ndirecting in eastern ETV station. Location open, with pref¬\nerence for Midwest. $4,500 minimum.\nMay 8 - Adept news caster, writer and editor with six years\nradio experience desires similar position in educational\nbroadcasting. Additional skills in copy writing, scripting\nclassical music shows. Single male, 34, B.A. Location open.\n$4,200 - 5,200.\nMay 9 - Woman with over 20 years college teaching experience\ndesires position in ETV; would enjoy teaching courses in\nradio and TV with emphasis on programming; experienced\nin teaching theatre, speech arts, radio and TV courses.\nAdditional background with commercial station, summer\ninstitutes. Single, Ph.D. West coast, Midwest, East.\n$5,000 - 8,000.\nMay 10 - News and special events director seeks staff position\nin ETV in combination with administrative duties. Has five\nyears experience in foreign broadcasting; wrote and pro¬\nduced for NAEB; now produces and conducts public affairs\ninterview ETV program. Male, single, 34, Mi.A. Prefers New\nEngland, South, or Pacific Northwest. $6,000 - 7,000.\nMAY, 1958"
}