{
  "id": "d683-25",
  "text": "-2-\n5. the Corporation for Public Broadcasting\ntT-]<=> riirrrrnp-r-^h^v-i^l rnrront rrf Pay-TV?\nThe Public Broadcasting Act is not related to pay-TV.\nPay-TV experiments to date have been built on a general\nentertainment service, not on the need to provide more\nextensive educational, informational, and cultural\nmaterials by means of broadcasting. The Public Broadcasting\nAct will aid only programs broadcast freely to all homes.\n6. Will the\naj Corporation for Public Broadcasting\n>ort of^ac^io \"\ndiminish the need for local control and support\nand television stations?\n8.\nNot at all. Currently about $70 million is\neducational broadcasting from local or non-federal sources.\nFederal support from the Public Broadcasting Act will not\nreplace this income. Local support of stations will continue\nto be ~i 1 .. .T* m!rryr“m \\ | 1 i't.—nfinnirg ~ 1 .\nf i n a n r j n g n ri rf—t~n r n i pi r o g ir n mm i n g ' i' r\" r i rr-\nWhy should the average tax payer pay for a program service\nfor the elite?\nNo one is proposing that the programs of the Corporation\nbe for the \"elite\". Although existing educational broad¬\ncasting stations occasionally appeal to such audiences,\nthe majority of programs appeal to other audiences includ¬\ning school children, underprivileged adults, laborers,\nmunicipal employees, retired persons and others; virtually\nall groups of citizens. The Act will enable the develop¬\nment of new services with broadened appeal.\nWhy is the American tax payer being asked to build a\nfederal broadcasting network?\nHe is not. The present bill asks only that funds be\nappropriated for a one year period to improve and expand\nexisting radio and television program services to bring\nto the American public additional educational, informational,\nand cultural materials. There are now 2 national and 7\nregional and 10 state non-commercial radio and TV networks.\nThe proposed Act would aid them in more effective distribut¬\ning of materials to educational radio and television stations"
}