{
  "id": "d683-37",
  "text": "^\\W !///✓_\n\ndmbcRsr\nJune 8, 1967\nThe Hon. Silvio 0. Conte\nHouse Office Building\nWashington, D.C.\nDear Congressman Conte:\nOn behalf of the Western Massachusetts Broadcasting Council, Inc., I urge you\nto support the present bill (passed by the Senate as S. 1160) now before the House\nproposing the establishment of a Public Broadcasting Corporation and the appropri¬\nation of federal funds for its operation. The proposal has been presented to the\nHouse as HR 6736 by Congressman Harley 0. Staggers of West Virginia and as HR 7670\nby Congressman Torbert H. Macdonald of Massachusetts.\nThe Western Massachusetts Broadcasting Council operates WFCR, an educational\nFM radio station located in Amherst, Mass., which can be heard in a radius of up\nto 100 miles. In cooperation with WGBH (Boston) and WAMC (Albany) and the Eastern\nEducational Radio Network, its signal reaches into all of New England and most of\nthe Northeast. It receives its funds from the University of Massachusetts and\nAmherst, Mount Holyoke and Smith Colleges (soon from Hampshire College now being\nfounded) and from contributions by its interested listeners. From the current\nProgram Guide, which I enclose, you will see that broadcasts of great variety are\ncarried daily. These are supplemented by live programs of wide import - such as\nUnited Nations Security Council debates - in times of national or international crisis.\nWith the broad and general attention given television, we are encouraged by\nthe new, if belated, interest accorded educational radio in the present legislation.\nThe Council is presently considering measures whereby programs at our five partici¬\npating colleges can be coordinated even more closely by radio connection to the\nbenefit both of our own students and faculty and to our other WFCR listeners. Federal\nsupport for such a local network would assist the Council greatly in its plans.\nFor these specific reasons and for our general agreement with the intent of\nthe proposed legislation, we hope you will give this Bill your immediate and\nvigorous support.\nSincerely yours\nHorace W. Hewlett, President\nWestern Massachusetts Broadcasting Council,In\nHWH:lc\nEnel.\nAMHERST COLLEGE* AMHERST, MASSACHUSETTS-OFFICE OF THE SECRETARY - ALPINE 3-2561, EXTENSION 321"
}