{
  "id": "d683-44",
  "text": "SUOQJESTIOtiS CONCERNING LEGISLATIVE CONTACTS\nIt is difficulty though not impossible, to generate enough letters and\ntelegrams to a Member of the Congress to impress him by sheer volume\nalone. Failing that, the best method is by means of personal visits\nor conmmicationa' from people he has reason to respect — top educator*,\nGovertssaental figures (mayors, State assemblymen, and the like) and busi¬\nnessmen. The higher the level of the individual, the more attention hie\nmessage will receive.\nThe ecwmmicaticms should be as personal as possible!\nA. The moat effective is a personal visit, either in Washington or\nwhen he la at heme; in these days of jet travel, most Members are\nheme at least once a month, and many are home weekly. Each Member\nmaintains an office in his home district or state, and you can usually\nlearn your Member’s schedule by calling his office, You can get the\nnumber from Information in the city where his office is located.\nPerhaps the most effective thing you can do will be to arrange for a\ngroup of educators, businessmen and interested parents to meet with\nthe Member when he is home.\nIf you do this —\n(1) Have a min spokesman who is well schooled in the facts;\n(2) Bring the Member supporting information and proposals In\nwriting, if possible; and\n(3) Ash for a commitment this is important.\nB. The second most effective action is a personal telephone call. You\ncan reach the office of any Congressman or Senator by calling him\nperson-to-person at Area Code 202, CApitoi 4-3121, which is the\nnumber of the Capitol switchboard. Generally, his staff will attempt\nto have the call answered by a staff member; this Is only natural\nsince Members receive many calls each day. At this point you will\nhave to use your judgment as to whether you should “hold out” for a\npersonal conversation with the Member. If he is a Senator from a\nlarge and populous state, your chances of talking to him personally\nwill be small. If he is a Congressman, or a Senator from a sparsely\npopulated state, you will usually be able to get him personally if you\nkeep trying.\nWhen you get your man on the phone, remember that he is busy, State\nyour case m rapidly and as concisely m you can; make note® ahead\nof time to insure that you cover all important points. In closing,\nmk for a commitment — and make sure he does not couch it in\n^733\n(over)"
}