{
  "id": "d683-51",
  "text": "-2-\n4. We believe that the method of selecting the Corporation's\nBoard of Directors is consistent with the bill's objectives and\nprovides adequate insulation of corporation activities from govern¬\nment control.\n5. We concur that no political test should be made for directors\nand that the Corporation should not be able to be involved in political\nactivities.\n6. We concur that the Corporation be essentially non-operational\nin any broadcast functions.\n7. We agree that it is important for the Corporation to provide\nfunds direct to educational radio and TV stations to support their\nown operations in addition to their support of particular local pro¬\ngramming.\n8. We recognize that the bill prevents the Corporation from\noperating a network or interconnection facility of any kind. We are\naware of the position of the Carnegie Corporation which holds that the\nCorporation should be the source of funds for, and therefore the final\nauthority with respect to such interconnection systems. Should the\nCorporation fund direct distribution of programs to stations, the NAEB\nagrees that the Corporation would necessarily retain ultimate authority\nover this distribution.\nWe do see a distinction, however, between the simple interconnection\ndelivery system for the Corporation to effect distribution of programs\nand a full nationwide network operation involving transmission of pro¬\ngrams at specified days and times. We support the provisions of the bill\nwhich encourage networking services, which as pointed out above, are\ndistinct from the Corporation's distribution services.\n9. We concur that the Corporation could have an archival library\nand we assume that this is not intended as an operating program exchange\nor distribution service.\n10. We support the bill's proposition that the Corporation provide\nnecessary public information services. We assume this also allows the\nCorporation to fund the public information services of its grantees -\nstations, program services, and networks.\n11. We concur that the Corporation should have authority to accept\noutside support.\n12. We support the provision of the Act which would remove restric¬\ntions against the establishment of free or reduced interconnection rates\nfrom the common carriers for educational broadcasting.\n13. We endorse the President's recommendation for further study of\nappropriate means for future financing of the Corporation.\n14. We concur with the importance of research in public television\nas well as demonstrations and training.\nTitle III\n1. We approve the purposes of the proposed study. We hope the\nstudy will be comparable in conduct and impact to the Carnegie Commission\nstudy of public television.\n2. We concur that it would be useful for the study to coordinate\nappropriate media research reports previously made, however we feel"
}