{
  "id": "d683-58",
  "text": "(3)\n(b) Contract for production or procurement of educa¬\ntional television and radio programs for distribution to educa¬\ntional television and radio stations;\n(c) Make payments to non-commercial educational\ntelevision and radio stations for programming and other\noperating costs;\n(d) Establish and maintain a library and archives\nfor non-commercial educational television and radio programs;\n(e) Publicize and disseminate information on\neducational television and radio;\n(f) Support interconnection facilities for distributing\nand transmitting instructional and public television or\nradio programs;\n(g) Encourage the creation of new non-commercial\neducational television or radio stations.\n(7) The Corporation could not own or operate any television\nor radio broadcast stations, system, or network or interconnection\nor program production facility; and it and its contractors and\ngrantees would be free from Federal direction, supervision or control,\n(8) Nothing in the Communications Act of 1934 could be construed\nto prohibit U.S. communications common carriers from rendering free\nor reduced rate interconnection services to Corporation grantees or\ncontractors and local noncommercial educational television and radio\nstations, in accordance with F.C.C. rules and regulations,\n(9) Annual reports of its operations and on its condition\nwould be made to Congress by the Corporation.\n(10) For fiscal year 1968, $9,000,000 would be authorized to\nbe appropriated and for fiscal year 1969, such sums as may be\nnecessary, to assist the Corporation in carrying out its activities.\nThese appropriations would remain available until expended.\nSTUDY OF EDUCATIONAL AND INSTRUCTIONAL TV BROADCASTING\n(Title III)\nTitle III of the Public Television Act of 1967 authorizes the\nSecretary of Health, Education and Welfare to conduct or contract\nfor a study of instructional television and its relationship to\neducational television and its advantages and disadvantages in com¬\nparison with other educational media. This report shall be submitted\nto the Congress on or before January 1, 1969. An appropriation of\nsuch sums as may be necessary (but not exceeding $500,000) is\nauthorized for this purpose."
}