{
  "id": "d683-83",
  "text": "-2 -\na summary of the total number of new stations and numbers of expansions that have\ncome about as a function of the ETV Facilities Act.\nWe must have specific examples of the local accomplishments in human\nterms of the new local stations and the expanded facilities of the previously existing\nstations. This would mean, for example, reference to the accomplishments of the\nsecond stations in Chicago, Pittsburgh, and Minneapolis and the accomplishments\nof such new stations in the last five years as Los Angeles, Cleveland, San Jose,\nTopeka, Syracuse, Rochester and Honolulu, all of which came about absolutely as\na result of the ETV Facilities Act.\nTitle II\nWe, of course, generally approve of the establishment of a nonprofit\neducational broadcasting corporation. Moving to Subpart B on the Corporation,\nassuming that all other details are routine, we, of course, applaud Sections396\n(a) (1), (2) and (3). In (4) we should take the opportunity to accent the \"responsive\nto the interests of people\". This is a valuable emphasis in our behalf.\nSec. 396(5).\nWe certainly want to support the belief that it is necessary and appropri¬\nate for the federal government to engage in this activity.\nSec. 396(6).\nThat a private corporation is logical as a result.\nReference in these points to the ETS 1964 Conference, the establishment\nof the Carnegie Commission, the Carnegie Report and the general mandates from\nthe 1967 conference.\nSec. 396(b).\nWe agree that such a corporation should not be a government agency.\nSec. 396(c)(2).\nAppears to have a typographical error in that we want to include candidates\nas members of the Board who are eminent in such fields as education,\ncultural affairs, civic affairs, and the arts, radio and television; this\nlanguage seems much better to us and we propose it.\nWe also, of course, should recognize that we must count on the wisdom\nof the President and the Senate and that c(l) and c(2) must be taken together in this\nrespect.\nSec. 396(d)(1).\nVie note that this title allows the Board members, including the Chairman\nand the Vice Chairman to be full time government employees. We think\nthis is not right and would propose at least a limit of three or perhaps a\nban on any government employee as Board members."
}