{
  "id": "d1477-0",
  "text": "■\nA E B\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. 29, NO. 8 AUGUST, 1964\nNER Music Personnel to Meet\nThe University of Minnesota and KUOM (AM) will host\nthe third annual NAEB music personnel conference Septem¬\nber 30 and October 1. In making the announcement, Confer¬\nence Chairman Harry Wdliver pointed out that this is a\nswitch from the original plan announced in December.\nThis year’s conference will include all NAEB-NER mem¬\nbers, rather than being limited to those in one region.\nBurton Paulu (director of radio-TV broadcasting) and\nRussell Walsh (KUOM) are planning the program, assisted\nby other committee members: Kay Fraser (WFIU, Indiana\nUniversity), Ann Bums (WBAA, Purdue), and Welliver.\nMeetings will be in Coffman Memorial Union and the Center\nfor Continuation Study.\nProgram content will be presented in the September\nNewsletter.\nConvention Info\nLater this month, NAEBers will receive more information on\nthe October convention, including advance registration cards\nand hotel reservation cards. Delegates are urged to make\nreservations early, particularly for air transportation, as noted\nelsewhere in this issue.\nIn a mailing last month, key convention speakers were\nannounced to NAEBers. Carl T. Rowan, director of the\nU. S. Information Agency, will speak at the banquet, and\nLester F. Beck, psychology professor from Oregon, will\nkeynote the convention.\nTuesday, October 27, will be devoted to NAEB Divisions,\nwith each Division planning its own program, business meet¬\ning, and luncheon. There will be no regional luncheons this'\nyear. Tuesday night all will converge for a Texas barbecue.\nFree Radio Programs Available\n• NASA offers a new series, The Peaceful Uses of Space,\nten half-hour programs on a recent Boston conference on the\nsubject. Among the participants are Hugh Dryden, NASA\ndeputy administrator; Wernher von Braun; James R. Kilian\nJr.; and Astronaut L. Gordon Cooper.\nAlso available for free loan to educational broadcasters\nare radio production aids, including a tape of satellite and\ntelemetry sounds and tapes of historical moments in the\nspace program. The latter includes excerpts from each Proj¬\nect Mercury flight, the voices of Presidents Eisenhower,\nKennedy, and Johnson, and NASA officials. Stations may\ndub these onto their own tapes.\nRequest from NASA, Educational TV and Radio Pro¬\ngram, Code AFEE-4, Washington, D.C., 20546.\n• Radio Nederland’s series featuring musical excerpts from\nthe 1963 Holland Festival of Arts is free to broadcasters.\nOrder the Holland Festival, 1963, album containing four\nhalf-hour programs from: Willard C. Wichers, Director\nMidwestern Division, Netherlands Information Service, Neth¬\nerlands Museum, Holland, Michigan, 49423.\nNAEBers: Reserve Space Now\nAirlines authorities have advised NAEBers to reserve plane\nspace now for the NAEB convention, October 25-28, in Aus¬\ntin, Texas. Since daylight savings time ends on the 25th, that\nis the day when all airlines will make a major schedule\nchange. Carriers review their reservations records at the time\nof a schedule change and protect passengers on alternate\nflights, we have been told.\nThere is no jet service into Austin, just to Dallas or San\nAntonio. Braniff and Trans Texas operate flights from Dal¬\nlas to Austin. From San Antonio, the best method seems to\nbe to rent a car and drive the 65 miles on four-lane highway\nto Austin.\nNAEB Sets ITV Conference\nCharles McIntyre, chairman of the NAEB Instructional\nBoard, has announced plans for the third annual NAEB ITV\nconference. The meeting will be May 8-11, 1965, at the Deau¬\nville Hotel, Miami Beach.\nTentative plans call for registration to begin at noon on\nSaturday, May 8, and for the conference to end with a lunch¬\neon on May 11. The hotel will provide special rates for par¬\nticipants and their families and these rates will apply for\ntwo days before and after the meeting, if rooms are available.\nNAEB Produces \"Fifth Freedom\"\nThe NAEB is currently producing, through the facilities of\nWRVR, New York, a series of book programs of a new\nand different kind. They are not book reviews, author inter¬\nviews, or discussions centering around one book. Rather, each\nprogram will deal with a topic, and guests will refer to var¬\nious books in discussing the topic.\nProvocative subjects are being discussed, and participants\nare bringing at least four or five books into the discussion.\nEach program will have two guests and, as host-moderator,\nRalph Backlund, Virgilia Peterson, Leo Rosten, or Gore\nVidal.\nThe National Educational Radio Network will distribute\nthe twenty-six 30-minute radio programs to its members, and\nto commercial stations for use in public service time. Made\npossible through a grant to the NAEB, the series is jointly\nsponsored by NAEB and the American Library Association.\nOn the ad hoc advisory committee for the series are\nRichard Bye, R. R. Bowker Co.; Eleanor Smith, Brooklyn\nPublic Library; Jack Summerfield, general manager of\nWRVR-FM; William Harley, NAEB president; and Virginia\nH. Mathews, National Book Committee.\nPetersen Joins NAEB Board\nInstitutional Affiliates of the NAEB have elected as their\nrepresentative on the NAEB Board James K. Petersen, di¬\nrector of television and radio at Florida Atlantic University.\nThe election to fill this slot was postponed at the time of the\nother Board elections in December.\n1"
}