{
  "id": "d1477-2",
  "text": "Kantner, director of the School of Dramatic Art & Speech.\n^ Robert L. Davy, former sales promotion planner for the\nBoeing Company, is now an assistant professor of communi¬\ncations at Washington State University. He replaces John\nBrower, who resigned earlier to work at WETA-TV, Wash¬\nington, D.C. Davy is also a writer-producer for KWSC-TV\nand KWSC.\n^ Charles McIntyre has been appointed director of the new\noffice of instructional resources at the University of Illinois.\nThe office is a consolidation of the former office of instruc¬\ntional research and the office of ITV.\n^ A Baptist minister, James R. Swedenburg, has been elected\npresident of the Alabama ETV Commission. He is the fourth\npresident of AETC since its creation in 1953.\n^ Robert B. Schweikart, former assistant manager and pro¬\ngram director of WOSU Radio, Ohio State University, has\nbeen named director of communications of the university’s\nCenter for Continuing Medical Education. He will coordi¬\nnate the Ohio Medical Education Network, now encompass¬\ning 36 hospitals served by eight FM stations (seven commer¬\ncial and one noncommercial).\n^ Bill Oxley is serving as TV program director for Univer¬\nsity of Texas radio-TV and KLRN-TV. He moves to Aus¬\ntin from San Antonio, where he had worked three years as\nproduction supervisor of the KLRN office there. Replacing\nOxley in the latter post is Bill Moll, promoted from the po¬\nsition of news editor on the KLRN Austin staff.\n^ Lyn Jarvis has joined the University of Alabama broad¬\ncasting services staff as a producer-director. He was for¬\nmerly employed by commercial WSFA-TV, Montgomery.\n^ John De Prospo, executive officer of WNYC, New York\nCity, recently received a citation from a Norwegian-Ameri¬\nca committee which is conducting a year-long celebration of\nthe 150th anniversary of Norway’s constitution. The citation\nwas for fostering better understanding between the men and\nwomen of both countries. De Prospo has been with the Mu¬\nnicipal Broadcasting System since 1934.\n^ B. Eugene Koskey has left Northern Illinois University\nto be coordinator of technical studies, Sabah Radio, for the\nPeace Corps. This summer eight radio technicians are being\ntrained in operation and maintenance of transmission equip¬\nment and tower construction. In the fall they will go to\nSabah (formerly North Borneo, and now a state in the Fed¬\neration of Malaysia) to work for Sabah Radio.\n^ Joe Johnson has accepted a position at the University of\nUtah, and is leaving his post as associate sports editor,\nWKAR, Michigan State University.\n^ Gordon Gainer has been promoted at WKAR from news\neditor to program’ director. Two new staffers at WKAR are\nRichard Arnold, farm editor, and Lowell Newton, news edi¬\ntor.\n^ David Robertson, former studio supervisor for WMHT,\nSchenectady, has been named production manager for the\nstation. Brita Peterson is a new WMHT staffer, serving as\nproduction assistant.\n^ Rudy Bretz, vice president of National Education Sciences,\nrecently returned from three months in southeast Asia. Sent\nby the Department of State as a TV specialist, he spent three\nweeks with Televisi Republik Indonesia in Djakarta, a month\nwith Telivishen Malaysia in Kuala Lumpur, and two weeks\nin Singapore. He gave an advanced course in production tech¬\nniques to staff personnel, with daily lectures, studio demon¬\nstrations, and critiques of the local entertainment programs\non the air. Enroute, he visited the staff at the NAEB Samoan\nETV project.\n^ Elmer G. Sulzer has resigned the posts of chairman of the\nradio-TV department and director of radio and TV commu-\nNAEB Headquarters: Suite 1119, 1346 Connecticut Avenue,\nN.W., Washington, D.C., 20036. Phone 667-6000. Area Code 202.\nnications at Indiana University. He will devote more time to\nteaching as a regular faculty member. Pending the selection\nof a successor, George C. Johnson will be acting chairman.\n^ Marion Corwell, associate director of school relations for\nthe Dearborn schools, has been elected chairman of the De¬\ntroit chapter of the Michigan School PR Association.\n^ Two members of the Chicago staff of the United Presby¬\nterian radio-TV division have been named to the unit’s New\nYork headquarters staff. Donald Roper is new associate chair¬\nman of the division for operations, and Robert Norris is di¬\nrector of field services.\n^ Jay J- Heitin is new executive editor of the NAB’s TIO.\nFor the years 1952-1963 he was sales director for WNBC-\nTV, and he spent the last year teaching in the English de¬\npartment, City College, Santa Barbara, California.\nREGIONAL AND STATE\n^ Services of the new ETV station in Richmond (scheduled to\ngo on the air in September) will include schools in the Wil¬\nliamsburg area. Colonial Williamsburg recently contributed\n$10,000 to the Central Virginia ETV Corporation, operators\nof the station.\n^ In Hawaii, a governor’s advisory committee on ETV has\nrecommended immediate establishment of a state-wide ETV\nsystem of three VHF and six UHF stations. The network\nwould be licensed to the University of Hawaii and operated\njointly by the state education department and the university.\nLegislation may be introduced in the 1965 session to finance\nthe ETV system.\nPROGRAMS\ny KUED, University of Utah, is producing a program for\nNET on current Utah school crises. Called “A House Divid¬\ned,” the half-hour program is the first of seven special pro¬\ngrams on local issues. It will be released on NET stations\nthe week of August 31.\nTitles of the other six programs selected from among\nideas submitted are: “Poverty: The Survival of a Region,”\nWQED, Pittsburgh; “The Far Right in Southern California,”\nKCET, Los Angeles; “The Chamizal Story: Return of U. S.\nProperty to Mexico,” KUHT, Houston; “Cattle Crisis,”\nKUON, Lincoln, Nebraska; “School Desegregation,” WNDT,\nNew York; and “The Wilderness Controversy,” KNME,\nAlbuquerque.\n^ Modern Math for Parents is a five-week series being pre¬\nsented by the Mohawk-Hudson Council on ETV this sum¬\nmer on WRGB, Schenectady. Programs are being video¬\ntaped for the New York state education department.\n^ WNED-TV, Buffalo, received a first prize award for\n1963 from the American Association for State and Local His¬\ntory and Broadcast Music, Inc., for the TV program “The\nMcKinley Assassination.”\n^ The University of Michigan TV Center won the American\nBar Association’s Gavel Award for the 20-part series, A\nQuest for Certainty, which probes the nature and values\nof the American legal system. This is the second time in four\nyears that the center has received the award.\n^ The University of Illinois Medical Center, Chicago, re¬\nports that a new weekly 15-minute series on WTTW has\nbeen well received. After fourteen shows during the summer,\nthey hope to continue the series in the fall.\nGENERAL\n^ Chicago’s two ETV stations, WTTW and the new WXXW,\nare requesting permission from the FCC to relocate their\ntransmitters and antennae atop a 55-story apartment building\nnow under construction. Developers of the building have of¬\nfered the ETV stations a rent-free lease, valued in excess\nof a million dollars over the next 10 years.\n^ WMUB-TV, Miami University (Ohio), plans to use its\ngrant under the ETV Facilities Act to obtain new transmis¬\nsion equipment to extend its coverage. A second videotape\nrecorder will also be purchased.\n^ The Los Angeles Home Show committee gave the new\nAUGUST 1964\n3"
}