{
  "id": "d1231-3",
  "text": "NAE8 NEWS LETTER\nPage 4\nOctober I, 1945\nPROGRAMMING o\" ’’HOWEVER,1' NOVIK WENT ON, \"EOUCATI ONAL, UNIVERSITY, AND\nSTATE-OWNED RADIO STATIONS IN THIS COUNTRY HAVE A GREAT DEAL TO LEARN\nfrom the European stations,\"\nIn attendance at the convention were: Bob Coleman* WKAR; Carl Menzer,\nWSUI; Burton Holmberg, KUOM; Hunnington Miller, KUOM; I * Keith Tyler,\nWOSU; John Henderson, WBAA; Armon Bonney, WSU!; M*C* Jensen, WCALf F* E,\nSchooley, WILL; A,J, Ebel, WILL; John Stiehl, WHA; H,B* McCarty, WHA;\nBill Harley, WHA; Mrs, Grover, WCHU; Mike Hanna, WCHU; WJ. Griffith,\nWOI; Oick Hull, WOf; Prof, Webb, KUOM; Prof. Rook, KFJM; Morris Novik,\nWNYC o\nABBOT R£nORTS IN\nHere is a letter from Waldo Abbot explaining his absence from the con¬\nvention?\nDear Jim:\n| WANT TO THANK YOU FOR YOUR KSNQNESS IN GIVING ME ADViCE ON\nWHAT STUDIOS TO SEE IN PREPARATION FOR OUR CONSTRUCTION OF STUDIOS AT\nthe University of Michigan. II went off with the architects and visited\nWGY making a very thorough study of their AM, FM and television studios\nAt 6bs in Nev.. York, we were taken through the studio building and saw\nTHEIR TRANSMITTER FOR FM AND THE CONTROL ROOM„ NBC EVEN SHOWED US\nSTUDIOS THAT MOST OF THE PEOPLE AROUND THERE DIDN8T/ KNOW ABOUT; ES¬\nPECIALLY ON THAT IS THE PROCESS OF CONSTRUCTION.\nEo Content at WOR conducted us through three new studios that\nTHEY ARE BUILDING ON THE FIRST FLOOR OF THEIR BUILDING, He HAS REALLY\nMADE A STUDY OF ACOUSTICS AND THE SHAPES OF SOME OF THE STUDIOS GIVE\nME THE HEEBY-JEEBIES, BUT THEY REACT ALRIGHT ON SOUND. LESLIE JOY\nDOWN AT KYW WAS WONDERFUL,, He EVEN TURNED OVER TO US ALL THE PLANS\nAND SPECIFICATIONS FOR THEIR STUDIO BUILDING. WE SAW NOT ONLY STUDIOS\nAND CONTROL ROOMS, BUT AIR CONDITI ON ING»--LOTS OF INFORMATION,\n! EXPECT THAT THEY WILL TEAR DOWN MORRIS HALL VERY EARLY IN\n1946 AND CONSTRUCT THE NEW §ERVICE BUILDING. UNIVERSITY BROADCASTING\nFACILITIES WILL BE ON THE FIFTH FLOOR OF THIS NEW STRUCTURE AND WILL\nINCLUDE FOUR STUDIOS, THE LARGEST OF WHICH WILL BE 28 X 40; THREE STUDIO\nCONTROL ROOMS AND A MASTER CONTROL; OFFICE AND RECEPTION ROOM FOR ME;\nCONTINUITY ROOM AND A SCRIPT ROCMJ MUSIC LIBRARY AND SOUND EFFECT ROOM;\nAND A LARGE LOBBY IN THe MEANTIME THE UNIVERSITY IS CONSTRUCTING TWO\nSTUDIOS FOR THE DEPARTMENT OF SPEECH IN ANGELL HALL WHICH WILL BE TEM¬\nPORARY DURING THE CONSTRUCTION PERIOD FOR THE BROADCASTING OF OUR PRO¬\nGRAMS-, We ARE PROGRESSING AS RAPIDLY AS POSSIBLE UNDER THE PM CON¬\nSTRUCTION Permit, but are being held VP by change in the transmitter\nSITE AND BY LACK OF EOUIPMENT o\nThere8s some news for your letter. Sorry i didn^t get to the\nChicago meeting, but 1 expect to get a report on it from you.\nCordially yours,\nWaldo Abbot"
}