{
  "id": "d1646-4",
  "text": "Dr. Arthur G-. Crane\nPage 5\nability and the public good will of such boards? We have suggested a method\nwhereby we think they might be selected from known leaders in public welfare, repre¬\nsentatives of education, of religion, of labor, of medicine, of law, of public\nwelfare of any character. We have suggested that they be selected from those\nleaders, nonpartisan, nonpolitical, in character; that their terms be staggered\nso that it would take a series of years for any party or parties to capture con¬\ntrol of these fifty or sixty boards.\nAmerica has achieved reliability and trustworthiness in many of her public\nofficials. I wish to mention to you as an example the public schools which spend\nmillions of dollars annually. How many cases do you remember of public school\nofficials being accused of malfeasance in office or improper use of power, or\npartisanship being dragged into the public school systems? We have succeeded\nin that case in electing American citizens—government officials if you please—\nthat have proven themselves trustworthy.\nI think that America at large has great respect for her judiciary, and I ask\nyou, is it not possible that in a thing as vital to American life as radio broad¬\ncasting we can be equally successful in selecting trustworthy officials?\nI am a public school man and consequently I am familiar with the public\nschool situation, but let me say this, that not only public but private schools\nare alike in this situation, and I speak for one as much as for the other. I can\nnot forsee how America, judging by her past practice and standards can permit the\nentrance into the schools of radio broadcasting if it is sponsored by and paid for\nby advertisers. No matter how commendable the thing advertised may be, the com¬\npetitors of that particular firm are going to object to the exploitation of a pub¬\nlic institution supported by everyone's taxes for the promotion and sale of any¬\nbody^ product. If that is true, then the service to the schools, public and\nprivate, is largely denied any private broadcasting system, but a public system,\n(MOKE)"
}