{
  "id": "d212-82",
  "text": "- 4 -\n10o Finally, I look with deep concern on the growing tendency of our association\nto be top-heavy.\nSome years ago, when I made recommendations for dividing tho country into regions\nwith regional headquarters to be set up in each region, I had in mind that\nregional organization would really amount to something. Actually, our regional\nset-ups are nothing more than a farce„\nRegional, directors should be,and I believe in most cases are, in a better posi¬\ntion to know more about educational broadcasting in their part of the country\nthan Si in New York or Jim in Urbana. Actually, the President of NAEB should\nbe the guide, pointing the way; the Executive Director should be the coordinator\nand the President’s right-hand man. The Regional Directors of the organization\nshould be the wheel horses pulling the load, each in his own region. In ny\nopinion, if NAEB is to grow strong with each local educational station and each\nregion maintaining its own stamp of identity, it must start with STRONG REGIONAL\nORGANIZATIONS.\nWhile I’m for Jim getting out over the country, still I think we must be realistic\nabout the whole matter. More good would come from allowing funds for regional\ndirector's to make junkets over their region.\nI’m for REGIONAL CONFERENCES, preferably in the spring of the year. These confer¬\nences might be two-day affairs where educational radio people might get together\nand let their hair down. PRACTICAL would be the keynote of these get-togethers.\nI noticed at Biloxi, Region V had only four out of ten active members represented\nand no associate members. I believe other regions were worse off than we were.\nBy keeping in close contact with regional members, I know that regional directors\ncan really pour a wealth of information into the President’s and Executive Direc¬\ntor’s offices that will mean something.\nFurthermore, I think the National Headquarters and the President’s Office should\nutilize regional offices more in association business. In short, let’s VITALIZE\nthe regional set-up and make it count for something. Let’s get our feet on the\nground and our head out of the cloudsJ Let’s climb down out of our nice pink\nivory towers and get our ears to the ground! Let’s bypass the lures of the\nacademic and the glib talking idealists!\nWe’re BROADCASTERS first, last and always, filling a decided need in the\nAmerican scene. Let’s run NAEB on a hard-headed, practical, businesslike\nbasis 2\n*\n■'HQ?*-'"
}