{
  "id": "d212-98",
  "text": "NAEE TAPE NETWORK\nMarch 11, 1952\nMEMORANDUM\nTO: ALL NAEB STATIONS\nFROM: Dick Rider\nRE::::::: Submitting programs for network use.\nThe time has come to remind you once again that we are on the trail of\nprograms. We should like to announce the summer schedule as soon as possible.\nWe are also thinking about the first offerings for next fall. Thus, we need some\nprograms to think about.\nIn this regard I invite your attention to the report of the two program\ncommittees issued following the Purdue meeting, which most of you have received\nand which is reproduced in the current NEWS-LETTER. Especially consider the sug¬\ngested list of program needs, a copy of which is attached.\nPlease consider your program schedule and see if you have anything that\nwill meet the network*s needs. If you see a possibility let us know about it.\nIn submitting a program send us a brief prospectus on the series which covers talent,\npurpose, format, etc. and a list of the individual programs. Of course, send along\na few sample programs.\nWe have not yet published our document on technical standards, however\nthere are certain basic points which should be mentioned in the event that one of\nyour series is used. We require original recordings wherever possible to use as\nour masters. We hope that as time goes by more of you will make these originals\nat 15 ips, especially for musical programs. At the moment, however 7& is satis¬\nfactory. Wo prefer that the station originating a program send us a complete\nshow, including opening and dosing credits, all continuity, etc. If this isn*t\npractical, we can finish them here. In no case do you lose ary tapes on this\ndeal. Any that you send in are returned to you. If we know ahead of time we\ncan supply you tapes on which to record our masters.\nIf some of you who have submitted programs are wondering what has hap¬\npened to them let me say that you will hear from us shortly. Sometimes it is a\nclow process, for us to listen to them here, some of them go to the program com¬\nmittee, sometimes we wait to see what develops for the next offering, etc. How¬\never, we do consider them all, and eventually I will write to you and you will\neven get your tapes back l In any cases where speed is essential, we can arrange\nto do it in a hurry."
}