{
  "id": "d465-19",
  "text": "ROUGH DRAFT - PROPOSAL\nsn\n8* Film documentary showing the various class activities\nthat developed from one educational broadcast* This\nwould start by shewing or planning a part or all of the\nfilm or tape of the program stimulating this utilisation0\n9* Collections of class work resulting from educational broad-\noasts* This could include art, literature, science,\nmusic, and similar projects.\n10. Complete utilization workshop (short or long) outlines\nincluding suggested handouts, sample scripts, time table#,\nprogram examples, etc.\n11. Tape recordings of the discussion within a class following\nan educational broadcast.\n12* Reprints of selective speechs, articles, in quantity for\nuse with committees and discussion groups.\nThese suggestions are quite rough and certainly need refining.\nBut they do indicate some of the possibilities which have been dis¬\ncussed within the MEB Utilization Committee.\nThis problem breaks down into several phases. To do all of\nthese at once would require considerable money. Actually, the\nfirst step would be to pin-point the needs and the supply of material.\nA phase structure which might be followed is suggested here.\nPHASE I - F.XPLORATQRY\nThe objectives of this phase would be to define the project,\nlocate areas of needs:, find examples of utilization, and orient\nkey people into the project. Specific utilization projects could\nbe worked out with the local station or organizations if they can\nor will undertake the financing. The most practical and expedient\nmethod of doing this would be by a personal visit to the various\nlocations. An itinerary for these visits can not b© worked out\nuntil a preliminary approach has been made through correspondence.\nOff hand, the points that appear most likely to come up with usable\nmaterial is Pittsburgh, Chicago, St» Louis, Boston, Philadelphia,\nHaggerstown, Seattle, Ban Francisco, Sacramento, and Denver , I*m\nsure that all of these could not be visited but a series of letters\nshould eliminate some. In meet instances, the areas mentioned have\nboth an educational radio and television station in operation.\nBorne exchangeable material might result from these first visits.\nHowever, the principle objective would be orientation, and the\ndevelopment of a proposal to be made to either a foundation or the\nU.S. Office of Health, Education, and Welfare."
}