{
  "id": "d465-39",
  "text": "Information Sheet on NAEB Utilization Kit Project\nFebruary 22, I960\nFor the past year the NAEB Utilization Committee has been discussing\nways to help their affiliates develop good utilization of their school\nbroadcasts* There is no \"sure fire\" formula for using educational broad¬\ncasts any more than there is for teaching* Utilization technique is some¬\nthing a teacher must develop for herself, but there are some things we\ncan do to help this process*\nAll of us are acquainted with the frantic search that begins around\nthe first of May for materials to use with \"utilization workshops\" to be\nheld during the summer* This is understandable when you consider that\none of the basic precepts of all utilization courses is familiarization\nwith the medium and the uses made of it*\nEven if we have locally produced materials we need to obtain other\nexamples of programs and utilization procedures if we are to keep from\nbecoming hopelessly ingrown. From the committee*s discussions it seemed\nobvious that one thing that was universally needed was a readily avail¬\nable library of utilization information and materials* To meet this need,\nthe Utilization Committee is developing kits of material to be made avail¬\nable on short term loan from NAEB Headquarters* These utilization demon¬\nstration kits will take many different forms* There will be material\nspecially prepared for use with teacher groups, school administrators,\nP.T.A.»s and other community groups* We have not developed a standard\nformat for these kits but expect to use various media and combinations\nof media to tell the story.\nIn some instances the kits will consist of collections of program\nexamples, either on tape or film* Others will be specially produced\nmaterials showing some specific type of utilization. Still others will\nattempt to define basic terms or objectives*\nSome of the ideas proposed in our committee meetings are?\n1. A file of sample kinescope or tape recordings of successful school\nprograms. Along with these films or tapes, study guides, lesson\nplans, utilization results, and other printed material would be\nfurnished*\n2* Special edited \"kines\" showing various aspects of school tele¬\nvision programs. For instance, a 30«minute film showing short\nexamples from different school programs could be put together\nfrom existing material. Other \"kines\" could be edited to tell\na story. Transitions could be made by inserting special commen¬\ntary kinescope recorded footage. Films illustrating the strengths\nof television or defining (by illustration) what is meant by\nvarious terms such as \"enrichment\", \"supplementary\" and \"direct\nteaching\". The list of such special uses of kinescope programs\nis almost limitless*\n3* Excerpts from taped radio broadcasts could be put together with\ntape transition consnentaries similar to above.\nlu Interviews with teachers, supervisors, administrators, pupils,\nparents, etc* telling of their experience with educational bread-\ncasts could be put on film or tape*"
}