{
  "id": "d465-40",
  "text": "Information Sheet\nFebruary 22, I960\n-2-\n5* Film reports illustrating findings from research. This could\nbe a documentary treatment of a complete research project with\nemphasis on how to carry out a project.\n6. Capsulized dramatization on film or tape following a program\nidea from planning to utilization.\n7. Filmstrips or slide collections with synchronized tape com¬\nmentary illustrating utilization procedures and results. An\nalternate suggestion would b® to supply a script with the slides\nor filmstrips for local presentation.\n8. Film documentary showing a variety of class activities that\ndeveloped from one educational broadcast. This would start\nby showing or playing a part or all of the film or tape of the\nprogram stimulating this utilization.\n9. Collections of class work resulting from educational broad¬\ncasts. This could include art, literature, science, music\nand similar projects.\n10. Complete utilization workshop outlines (short or long) includ¬\ning suggested handouts, sample scripts, time tables, program\nexamples, etc.\nXL. Tape recordings of the discussion within a class following an\neducational broadcast.\n12. Reprints or recordings on film or tape of selected speechs,\narticles in quantity for use with committees and discussion\ngroups.\nThis project is being carried out in several phases. The first\nstep is to find cut what utilization materials now exist, and how they\ncan be made available through the NAEB. The second step is to develop\nkit ideas with local educational groups. These steps would be followed\nby screening, production, and distribution phases.\nThe NAEB Utilization Committee is undertaking to carry out the\nfirst two steps of this plan. The development and distribution steps\nwill need to be financed from outside of the NAEB. There are several\npossibilities for this financing and they will be contacted at the\nproper time. The success of this project depends on the cooperation\nof schools, educational broadcasting stations and individual NAEB\nmemberso"
}