{
  "id": "d465-49",
  "text": "Harold Hill\n-2-\nMarch 7, I960\nThrough the Television Committee I heard of the plans being made\nby the/JACET to develop a curriculum for teachers colleges dealing\nwith classroom utilization of television programs, I met with the\ntwo associate secretaries of this organization and we discussed\nour joint projects. They feel that our materials are drastically\nneeded by the education colleges and requested that they be kept\nthoroughly informed of our development plans. At present their\ncurriculum study is in a tentative outline form and as soon as it\nis edited they will send me a copy. On Wednesday afternoon we\nhad a second meeting of the DAVI Television Committee and at that\ntime we explored further the arrangement and plans for the invita¬\ntional seminar. At the committee’s suggestion, I have written to\nAnn Hyer to see if I might be added as official member of the DAVI\nTelevision Committee.\nI talked with Dr. McPherson for nearly an hour and a half. We went\nover .the proposal as submitted to his office. He had several sug¬\ngestions to improve the proposal. Let me go over them one by one.\nFirst, he felt that we should spell out in a little more detail the\nexact kind of audience we would be aiming toward. He seemed to have\nsome difficulty in getting the picture of how these kits would be\nused. I guess that I felt that this was so obvious to everyone it\nwould not need to be spelled out. He suggested that we submit\na one or two page supplement, and I will' get busy on this right\naway, and.send it to you for forwarding with your comments to the\nH. S, Office* He felt that our time schedule and our phase plan\nwere entirely feasible and would fit into their plan nicely. He\nsuggested that we might want to correlate some of our work with\nseveral other people that are currently either doing projects for\nhim or are being considered for projects. He couldn't tell me\nwho these were off hand but I will write him to find out what he\nhad reference to. He suggested that in the budget we had not in¬\ncluded enough time for the project director. His estimate was a\nthird to a fourth time to get the thing under way. I think that\nwe would agree, it would probably take more than a fifth time but\nfor the first phase this looked entirely logical and I would sug¬\ngest.not changing it. The second thing on the budget,he had the\nfeeling that we should include a few other items. These are mostly\nhousekeeping items such as administrative services and the 1% over-\n152 “\"*ra°tS+T to include. I knew that the\nthL for oLt B wlP P^POsals but I had no information about\nfor P33^5. However, we agreed that any final budget would be\norked out jointly after the thing had been accepted or rejected\n+Lth+ Above all, I felt that McPherson was quite in-\nterested and quite favorable towards our project. I do have the\nit wmS he “°? rderStand exactly ™ have in ndnl or how\nsliiis"
}