{
  "id": "d465-5",
  "text": "KTCA-TV\nTWIN CITY AREA EDUCATIONAL TELEVISION CORPORATION\nSt. Paul 8, Minnesota\nOFFICERS\nLoring M. Staples\nPresident\nRonald M. Hubbs\nFirst Vice President\nCHANNEL 2\nMINNEAPOLIS • ST. PAUL\nMINNESOTA\nJohn C. Schwarzwalder\nGeneral Manager\nOctober 12, 1959\nMr. Harry J. Skomia\nf- Vi\n. Telephone\nHfyV /Midway 5-5565\nOct 7\n14\n195S\n’If 12,\n'■*\nWendell T. Burns\nVice President\nExecutive Director\nNational Association of Educational Broadcasters\nPhilip H. Nason\nVice President\nJohn deLaittre\nSecretary\n14 Gregory Hall\nUrbana, Illinois\nA. A. Heckman Dear Harry:\nTreasurer\nTRUSTEES\nWendell T. Burns\nJohn E. Carroll\nForrest E. Conner\nGeorge D. Dayton II\nJohn deLaittre\nMiss Adelaide M. Enright\nSamuel C. Gale\nSander D. Genis\nClemens Granskou\nA. A. Heckman\nLeonard H. Heller\nRonald M. Hubbs\nMrs. Charles Hymes\nWilliam C. Lang\nWilliam G. Law\nSamuel H. Maslon\nPhilip H. Nason\nWilliam L. Nunn\nRev. Walter H. Peters\nJohn S. Pillsbury, Jr.\nRufus A. Putnam\nJohn W. Seeger\nLoring M. Staples\nHarold Wood\nYour letter of September 18 to John talking about the\n\"Utilization Kits\" touches a project near to my heart.\nThere is certainly a great need for material to help new\nteachers develop utilization techniques for both tele¬\nvision and radio.\nIn going through my files prior to coming to KTCA,\nI came across several letters concerning this project.\nBoth Jack McBride at KUON and Mike Ambrosino at WGBH-TV\nsaid they would be willing to develop a kinescope program\ndealing with utilization techniques.\nI think it would be a good idea if the Utilization\nCommittee would spend some time giving serious consider¬\nation to this project at the Detroit meeting. I have\nwritten Gale Adkins to see if he is planning on holding\na general Utilization Committee meeting. If he has not\nmade plans for such a meeting, I will attempt to get the\nTelevision Sub-committee together. As for my involvement\nin the project John has left the decision up to me. It\nis as you can gather, a matter of having enough time on\nhand. It is foolish to say that I will do this in my\nspare time because this commodity just does not exist.\nI think, however, that these materials are so important\nthat I will find the necessary time. I am flattered that\nyou want me to work on the project. I’ll do my best. If\nI find either the project or my responsiblities here at"
}