{
  "id": "d465-60",
  "text": "- 7 -\nVIII. Other Support: There is currently no other support available for\nthis project, nor has this project been submitted to any other agency or\norganization. The National Association of Educational Broadcasters and its\nAffiliates participating in this project will provide the necessary adminis¬\ntrative and supervisory support in addition to those items listed above* This\nis not an extension of nor addition to any previous project supported by the\nU. S. Office of Education*\nIX. How the Kits Would be Used: The purpose of this project is broadly\ndefined as making available to local groups materials to help them develop\nor improve classroom utilization of Educational broadcasts. The kits are\nprimarily intended to be used with groups but this would not preclude indi¬\nvidual use*\nThe list of sample kit ideas in Section II of this proposal is not\nintended to limit the project but merely to suggest the various types of\nmaterials to be included in the kits* It is expected that during the explor¬\nation phase many new ideas and needs will be identified and clarified. These\nwill not all be of equal value and one of the most important s teps in the\nexploration phase will be the assigning of priorities to the various pro¬\nductions •\nEach kit will be developed with a specific audience or use in mind*\nSome form of total organization will be developed after the field is surveyed*\nDeveloping this total approach will be one of the primary functions of the\nNAEB Utilization Committee. The budget for Phase I includes the expenses\nfor a meeting of this committee to screen ideas, to develop an overall plan,\nand to make specific production plans. A tentative organization plan for the\nkits is suggested belowj\nThree classes of kits would be developed. The first of these would\nbe designed for use in locations.where educational broadcasts have never\nbeen used. In addition to specific utilization examples these kits would\ninclude basic information and materials about the educational broadcasting\nfield. Different presentations would be developed for use with school\nboards, school administrators, curriculum directors, classroom teachers, and\nparent-community groups. Considerable emphasis would be placed on research\nfindings, organization and general classroom utilization examples from many\ndifferent locations.\nThe second set of kits would be planned for use where there is a\nhistory of educational broadcasting. These would deal with ideas and sug¬\ngestions to*help the local schools improve the utilization of the broadcasts.\nThe materials used in these kits would be more advanced and sophisticated.\nThese materials would also be produced with a specific audience in mind.\nThe third set of kits would be organized to provide material for utilization\nworkshops and courses*\nWhile this plan calls for three separate sets of kits it is antici¬\npated that in some cases a kit could serve several different audiences*\nMaterial from one kit could be reorganized to serve a different purpose or\naudience. Every effort will be made to keep the individual kits specific\nwith only one objective and one audience in mind*"
}