{
  "id": "d465-63",
  "text": "Comments from Committee Members\nAll of the answers to my letter of inquiry were enthusiastic about the project.\nA good many of you had specific suggestions to make about the kits or the develop¬\nment plans® Many comments seemed to relate to the problem of spelling out the\ndirection or orientation for the kits® Elaine Afton suggested that the kits be\ndesigned for specific group utilization® She felt that there would need to be\nkits oriented towards a school board audience® Other kits could be oriented toward\nsuperintendents, principals and curriculum directors. A third set of kits could\nbe aimed primarily for the teacher who will be presenting televised lessons and a\nfourth set of kits designed for teachers using television in the classroom®\nBenarr Cooper pushed this idea a little further by saying he felt we had to deter¬\nmine what the immediate aim of each one of these kits should be. His concern was\nalso for the audience with which these kits should be used® He asked, \"If we\nrelease this or that particular leit, what can we reasonably expect will be the\nresult of its release, how will it be used, what will happen when it is used?\"\nHis suggestions organized the kits into two areas for two different groups of\nteachers: 1) Teachers in schools where educational broadcasts have not been\ntried and are not being used, and 2) Kits for schools where such broadcasts are\nbeing used. This latter group would be broken down into two broad categories:\nA) Schools where there is carefully planned use of broadcasts for direct instruc¬\ntion and enrichment purposes, and B) Schools where the majority of teachers are\nnow using such broadcasts as a break in the deadly routine of \"mass,'and \"messy15\nteaching and preparation.\nBernie felt we should make a choice between the two groups in order to tackle the\nproblem with our limited facilities. He suggested that we concentrate on producing\nmaterials for teachers in group 1 or in areas where educational broadcasts have not\nbeen tried. He also felt that we might concentrate our first efforts towards devel¬\noping or encouragiig utilization workshops. He would tie these into some kind of\nlocal credit arrangement for the teachers participating. Following the workshops,\nthe kits would then be thought of as follow-up. The comments above about the AACTE\nand DAVI bear a little on this orientation but should not necessarily keep us from\nthinking of some work in the utilization workshop field.\nWanda Mitchell commented that the areas of need for these kits would be quite varied,\nand felt that kits would have to be prepared on a broad basis to be of practical\nvalue. She suggested that the needs might be ascertained by some kind of a survey\nto be made at the Classroom Teachers Division meeting at NBA this summer® Our con¬\ntacts with the Department of Classroom Teachers on the DAVI invitational s eminar\ncommittee could be cultivated to get this kind of survey made® I would imagine\nalso that one of the major activities of the invitational seminar, when it takes\nplace, will be in the ascertaining of specific needs®\nIn Lew Rhodes1 answer he provided the information regarding the activities of tha\nAACTE and reported there was some interest on the part of Dr. Stoddard in financing\na planning meeting for the utilization project. Perhaps there will be something\nfurther on this in the near future since Lev/ would meet with Dr. Stoddard the first\nweek in March. Lew also felt that the kits should be more closely aimed towards\nspecific groups ® He commented that kits should be designed for teacher training\ninstitutions, local or regional workshops, and individual school use. I assume\nthat while there might be some overlapping with some kits some of them would be\nspecifically produced for the above purposes. He also interjected a new thought\ninto the project and that is the possibility of making these kits available for\npurchase. In our discussions with Dr. McPherson of the Title VII staff, he sug¬\ngested that a small rental charge be made for the use of these kits, the money\naccruing from these charges to go into future production projects. I think we will\nwant to talk this over rather carefully,* it does have the intriguing possibility\nof keeping the project going but it might throw the v/rong light on the entire purpose."
}