{
  "id": "d465-64",
  "text": "r\n-1-\nLew stressed the importance of keeping the production of these kits in the\nhands of one person or a group of utilization committee members* This sug¬\ngestion also was made by several others* The need seems to be to have some\nmechanism to make sure that when the project is completed it will all fit together\ninto some kind of a total approach*\nJim Fellows* comments reemphasized what many others had said* He felt that our\ncategories were too broad and cumbersome and we should narrow onto more specific\nactivities•\nMarguerite Flemming responded by sending an outline of plans for a \"Let's Find\nOut'* kit. She suggested the need for a special national commnttee meeting with\nplenty of material to look at and evaluate. In line with our suggested meeting\nat the IFRT in Columbus, she felt that we should solicit as much material from\nstations as possible with an eye towards screening this material and laying out\nan overall plan.\nA good many of you indicated your preference for some of the kit ideas expressed\nin the project outline dated January 26th. The concensus was that ideas 1, 2,\n3, 7, 8, ? and 10 were the most feasible. Numbers 1 and 8 seemed to be the most\nurgent. This is encouraging since we can start on the file of sample kinescopes\nor tape recordings immediately. All of you are familiar with some school\nbroadcast and could make nominations of series that should be represented in\nthis sample file. If you would send me their titles along with the name of the\nperson to be contacted, I will undertake to get a preview copy for our May\nmeeting in Columbus.\nFrom all of the above comments I think you can see we have our hands full. The\nproject definitely needs to be put into proper focus. We should be impressed\nwith the amount of interest this project has created. Some of the comments\nindicated that there needed to be more communication between committee members.\nThis memo is an attempt at this communication. To facilitate unilateral\nexploration of the subject, I will include a list of the committee membership\nas I know it.\nWe need to spend some time on this project in Columbus. In my previous letter I\nasked how many would be able to meet on May 3rd and, while I didn't hear\nfrom everyone, those that I did hear from indicated they would be available. To\nthe rest of you, check over your calendar and see if you can’t clear May 3rd.\nWe really need a long uninterrupted session to deal with the loose ends of this\nproject."
}