{
  "id": "d465-71",
  "text": "Harold Hill\n-2-\nMarch 15, I960\nproject and if you would scan the roll and tell me if it is complete, I\nwill at least adjust my records.\nMarguerite hasn’t written since her request for some money to help them\nproduce a pilot kit. You have a copy of the letter I wrote to her\nfollowing your and my conversation about making some money available.\nI would like to let her know how this money can be paid. I really\nhave no preference in this matter but would appreciate a copy of any\ninvoices or bills they might turn in. This is just so I will know\nwhat is going on. Perhaps you can give me some suggestions as to\nhow this might be handled and I can forward them to Marguerite. During\nmy visit with Elizabeth Golterman in Cincinnati, we talked about this pilot\nkit and future production and developments. Elizabeth was very anxious\nthat money would be included in the budget (not this pilot kit' budget) to\npay for the staff time involved in the producing of kits. Since she is\non the Advisory Committee who will review the Title VII proposals\nshe felt that most of the committee were in agreement with her. McPherson’s\ncomments certainly bore out an attitude of including enough money to pay\nfor everything.\nI sent you a copy of the letter I received from Dr. Willis of the\nChicago Public Schools and also a copy of the letter I sent to Elizabeth\nMarshall. Friday I received one of the most pathetic letters I have\never seen. Liz seems to be caught in the middle of a monstrous power\nplay. I have decided that the best thing we can do is to sit back and\nwait for some reaction from Jennings. As of yet, he has never answered\none of my letters. He has completely ignored two letters addressed to\nhim, any comment on the letter to Dr. Willis and when I stopped in Chicago\nto talk with him and Liz, he didn’t show up for work that day or even\ncall in. The next time I am going through Chicago, I will attempt to\nsee him but there appears to be a great deal under the surface and I’m\nsure none of this is aimed either at NAEB or our people. It is a purely\nlocal issue. I feel we should sit and wait.\nThe NAEB stationery and envelopes arrived today. Thanks very much. I\nthink you had better send some regional directors stationery to John\nsince I dipped rather heavily into his supply for our initial communica¬\ntion venture.\nBy the way, I sent a general request and information letter to about\nsixty-five in the educational.broadcasting field. It is too soon for\ntheir answers but something should be coming in shortly.\nTell Harry we are looking forward to his visit on the 2l|th. I hope\nthat we can have time for a little conversation. Perhaps if his\nschedule is not too crowded, we could have lunch on the 2lith.\njjirector of School Programs\nCRT/gvc\nend.\nP.S. Enclosed is a copy of a letter\nreceived from George Jennings between\nthe typing and mailing of this letter,\nI’ll send a copy of my answer."
}