{
  "id": "d465-72",
  "text": "KTCA-TV, Channel 2\nSt# Paul 8, Minnesota\nMarch 17, I960\nMr. George Jennings\nDirector of Radio and Television\nBoard of Education\n228 LaSalle Street\nChicago 1, Illinois\nDear George t\ny\np\n* lrB,lco“8 le*tBr cam« last week. Indeed I do know\n\"T* 8lowly- Hlfl latter wan somewhat delayed by going\nt the NAB headquarters In Washington and then back to us through Chicago.\nThe Important thing la that you will be able to help us get this Utilise?\nticn Project underway.\n**”**?• Ta are scheduling a NAEB Utilisation\nmeeting** M*} * *\" Colunl™»* «>i* will coincide with the IERT\ntlon^at *that jLf1 rf!ibl*» W9J’,Duld llk» to haT» JW kit for presenta-\nJr”? this doe!mt «ive y°“ much time and to do the\nl kit deserves will take time. If It la impossible to\ncomplete the kit by then, perhaps a portion of the kit could be used.\n4 4. ^is whole project needs to be pilled together Into one overall\nIntegrated approach. We have suffered from \"much generalised talk and\nlittle specific action\". We need concrete examples to help us focus\nHlfflim' P^,)lT’t0 8 l8tter aH th8t the committee has dlscuaaed la\n1 wo“ld saggsst that we try to get together to talk It out.\nbut this too would take up valuable time. I'm tentatively planning on\nH^aShar?Und the.flr!,tTof APrtl‘ **nda Mitchell at Fvaraton\nowwhlp Hi£> School, as well as Liz Marshall, are on this committee.\nof«!T^.?UA0“r>8?could be adJU9t«d* we could meet In your\nAPkiH to discuss what might be done. If you feel this\n1*e S8* started, let me try to summarize the committee's\ndateV T* thl8» 8nd yoar knowledge of the material available\ni^the Chicago schools, you may be able to see what this kit should con-\n1.\nWe are thinking of these kits as being aimed at a specific\naudience. Our ultimate goal la to have special kits fer use\nwith various groups such as Boards of Education, School Adnlnla-\ntrators, teachers community groups, etc. Of course some materials\ncould be used with several different groups, but our feeling has\nbeen that If we assume too broad an audience the presentation\nlwuld become a general P.R. pitch and tend to try to cover the\nwhole field. We will need a few of these gener* kitTtat ou?\nhop« is that first we can serve the classroom teacher audience\n“Sf17 alm8fi tCTrarda h8lpin*tt8n"
}