{
  "id": "d465-80",
  "text": "- u -\nKAY N. LARDIE\nKay felt that If the project is going to be successful it irould have to\nbe underwritten by some outside funds« She suggested that they would have\nseveral samples of kinescopes or video tapes that might be usedo She is also\nwriting a pamphlet for a national organization titled \"’’Utilization of Tele¬\nvision in the Classroom\"* I wrote to see if this pamphlet was something that\ncould be included in the NAEB distribution plans but have not received an answer,\nSome of the things that they are using in Detroit are: 1) a kit prepared for\nteachers who are to present a telecast, giving examples of good and poor visual\nmaterials, a list of do’s and don’t’s and a sample script, etc®; 2) a video\ntape for presentation to the Board of Education which was also used at a meeting\nof all the principals in the city. The video tape had excerpts from nine\nprograms, five minutes each, together with an opening and a summary of production\ntechniques. The entire tape ran 5>3 minutes5 and 3) a kit of materials giving\nsamples of each bulletin that goes out from the Radio-Television Office to the\nschools.\nWhile all of these are directed at the Detroit needs, Kay felt that they\nwould be helpful in other areas,\nJAMES F. MACANDREW\nJim said, \"I am in complete agreement that the promotion of good utilise-\npractices is a highly important aspect of school television and one which most\nof us ignore throu^i lade of manpower and money,\n\"Although we include some suggestions on utilization in our manuals, they\nare superficial and not in any way what I should like them to be,\n\"At a meeting in Cambridge less than three weeks ago, (letter dated March\n31, I960) representatives of seven states agreed that a combined attack on the\nsubject of more effective utilization information was very important. While\nI am not in a position to do anything constructive at the moment because of\nother pressures, I shall be very happy to talk with you in Columbus and make\nany contribution I can,\"\nFor more information about the Cambridge meeting, see Keith Nighbert’s\nreply below,\nDAVID W. MARXER\nDavid said, \"We consider utilization one of the major aspects of educational\nbroadcasting and want to cooperate in the development of effective materials\nfor this purpose. For the past several years we have worked on in-school TV\nutilization with steadily increasing success. We attribute this success to the\ngradual development of a sense of involvement of our consumer group. Kits\nspecifically designed for utilization workshops could be of tremendous value and\nwould certainly reduce the strain on those responsible for organizing said\nworkshops. We always attempt to collect pertinent publications for distribution\nat our workshops but invariably miss some of the most pertinent ones and include\nsome less pertinent, A current bibliography (kept up to date) on pertinent"
}