{
  "id": "d1909-0",
  "text": "The Radio Institute of the Audible Arts\nFOUNDED BY THE PHILCO RADIO & TELEVISION CORPORATION\nEIGHTY BROADWAY . . . NEW YORK\nPITTS SANBORN, DIRECTOR\nNEWS LETTER MARCH 28, 1935\nEducational Broadcasting\nTHERE WERE, according to a recent report, thirty-eight broadcasting stations operated by\neducational institutions in twenty-two states. A list of these stations is noted on another page\nof this bulletin.\nSince the Radio Institute of the Audible Arts was founded some months ago by Philco\nRadio & Television Corporation, it has received from some of these groups interesting material\nabout the educational programs which they are conducting. In the thought that an abstract of\nthese “air curricula” might be of interest to all of our correspondents, we are setting down as many\nas space will permit.\nThis very informal survey by no means purports to he a complete picture of educational broad¬\ncasting, but is merely suggestive of what is being done and can be done in this direction. We\ncordially invite correspondence with other educators and broadcasters who are active in this work.\nYour experiences and suggestions will be most helpful to us in our work of stimulating interest in\nand fuller utilization of radio today, in its broadest aspects, as an instrument of education and culture.\nOhio School of the Air\nOf the various “Schools of the Air” now available\nthrough the radio, that conducted by the Department\nof Education of the State of Ohio is one of the oldest\nand best known.\nEmploying the facilities of stations WLW and\nWOSU, the School presents a fifteen minute program\nthree days a week. On Tuesdays from 2:15 to 2:30\np.m. there is a story period, in which history, nature\nstudy, trades and crafts are taught. Each Wednesday\nfrom 2:30 to 2:45 p.m. famous stories and fairy tales\nare presented in dramatic form by the Schuster-\nMartin School of Drama over WLW. On Thursdays,\na general story period is presented over the same\nstation.\nFor each of these broadcasts, the public schools\nusing the programs are provided with prepared ques¬\ntionnaires. The entire subject of the broadcast is dealt\nwith exhaustively, the questionnaires being of the true-\nor-false, fill-in, drawing and underlining type.\nOhio Emergency Radio Junior College\nThe radio junior college, conducted by Ohio\nState University in cooperation with the Emergency\nSchools Administration from the University radio\nstation WOSU, is now completing its second year on\nthe air.\nCourses in Psychology, Home Economics, French,\nEnglish, Social Ethics, Engineering and Education are\noffered to regularly enrolled students at remote points,\nwho are furnished with syllabi, manuals, supplemen¬\ntary notes and readings, and examinations.\nTwenty county radio teachers or supervisors are\ntaking an active interest in enrolling students. Seventy\nof Ohio’s eighty-eight counties are represented in the\nenrollment and listeners in seven neighboring states\nhave filled out registration cards.\nBesides the fact that it provides college courses for\nunemployed young people, the College offers obvious\nadvantages over casual and unplanned listening to\neducational programs."
}