{
  "id": "d1397-3",
  "text": "-4-\nthey will be very glad to give us some time. The whole manner is one of granting us\na favor, never for a second admitting to us that there is a federal check up on the\ntypes of their programs before a renewal is granted of their broadcasting license.\nApparently they think that we are too stupid or too preoccupied to know anything of\nthe regulations under which they work and unconscious of their pride in announcing\nfollowing our broadcast that ’’this program was brought to the air as a 'VKZO contri¬\nbution to public service.\" And I must admit that when faculty members are too con¬\ndescending about the whole matter, I remind them in much the same manner as the\nstation management assumes with me, that our minutes on the air have great commer¬\ncial value and since they are giving us the time so generously it behooves us to be\nvery humble and grateful.\nTo be sure, all of the more desirable hours have been taken by their commercial\npaying programs. We are given occasionally two choices of time, but usually there\nis no choice. We are assured that the time given us is subject to change at any\ntime within a few hours notice, and that notwithstanding the fact that we mail out\nand otherwise distribute some five thousand printed programs for each twelve-week\nperiod. I dare say we give their station the most consistently wide distribution\nof advertising of anyone using it. They have never even so much as expressed the\nslightest gratitude for that fact, altho we have always given them copies of the\nprogram and occasionally a statement of their distribution. In all fairness to\nthem I am glad to state that they have never shifted our time of program except\nbetween college terms. That statement of course does not cover the programs which\nhave been cut off altogether with notice of only an hour or so because of a football\nor baseball game. There is nothing that I can say that would add one whit to the\nexpression of indignation that all educational broadcasting directors experience\nbecause of those games. I merely join in the chorus of irritation. Another point\nwhich I must in all fairness make to the station management is that they have tried"
}