{
  "id": "d1878-5",
  "text": "IDEA EXCHANGE\nEd Note: Efforts to start a regular “Idea Exchange”\ncolumn in the Newsletter have, up to this point,\nfailed to yield the desired response. In the hope that\ninterest in such column will eventuaXly increase, and\nin the firm belief that such a column could be of\ngreat value to many members, we once again ask for\nyour participation. The proposed column, however,\ncan only be as regular as your contributions.\n—N A E B—\nNETWORK NEWS\n—Bob Underwood\nAs an additional service to network members, we are\nconsidering serving as an ordering agent for any sta¬\ntions wishing to obtain either mailing cases, tape\nboxes or tapes.\nAnyone interested in purchasing such materials\nthrough the network is invited to contact us for fur¬\nther details. There is no obligation to buy simply be¬\ncause you inquire.\nThe mailing cases, which we have made to order,\nmay be obtained for approximately $2 each. The\ntape boxes run about 10c each, and the tapes about\n$2 each. Of course, we would not be able to quote\nfinal prices until we had some indication of the quan¬\ntity needed for each item.\nIf you are interested in this idea, please contact\nme stating your interest in either mailing cases, tape\nboxes, tapes or all or any combination of the three.\nWe will be pleased to take it from there. I look for¬\nward to hearing from you.\nPlease do not forget the tape returns.\nWQED GETS $250,000 WESTINGHOUSE GIFT\nA gift of a 500-foot transmitter tower, adjoining land\nand buildings was made by Westinghouse Electric Co.\nto WQED, Pittsburgh’s educational TV station. The\nproperty, valued at $250,000, has been used by\nWQED since the station went on the air April 1, 1954.\nGwilym Price, president of Westinghouse Electric\nCo., presented the deed to John Rayan, president of\nWQED, during a luncheon.\nDonald McGannon, president of Westinghouse\nBroadcasting Co., predicted at the luncheon that ed¬\nucational TV stations will become an indispensable\npart of the United States educational system.\nMore than three years of WQED operation in\nPittsburgh, McGannon said, is proof that educational\nTV need not be dull. He said educational TV “sup¬\nplies pure research for commercial television in de¬\nvelopment of varied forms and techniques before they\nare brought into commercial television.”\nCommissioner Robert Lee of the FCC told the\ngroup that his own original concern about the feasi¬\nbility of educational TV has been erased by the suc¬\ncess of many stations and that he is now its ardent\nsupporter.\nWQED, now broadcasts 90 hours of programs per\nweek and reaches directly a total of 350 classrooms in\nPittsburgh area schools.\n1958 NAEB CONVENTION\nThe NAEB’s national convention will be held\nat the Sheraton-Fontenelle Hotel in Omaha, Neb.,\nfrom Tuesday, Oct. 14 through noon Friday,\nOct. 17.\nENGINEERING NEWSLETTER"
}