{
  "id": "d1649-2",
  "text": "^ Mark Damen, free-lance writer and producer, has been\nnamed producer-director for WUFT-TV, University of Flori¬\nda. He is a native of The Netherlands and formerly was spe¬\ncial projects producer for WQED, Pittsburgh, and special\nprojects director for WYES-TV, New Orleans. He also was\nproducer of This New House, NET series on the European\ncommon market.\n^ Ray Carlton is the new facilities supervisor-technician for\nWUFT-TV. He was formerly studio supervisor and lighting\ndirector for KLRN-TV, Austin, Texas.\ny Karl Haas, director of fine arts for commercial WJR, De¬\ntroit, has been appointed by the governor of Michigan as\nchairman of a new State Council for the Arts.\n^ James K. Buckalew has begun his duties as radio-TV jour¬\nnalism instructor at the University of Iowa. For the last\nthree years he has been with WTHI-TV, Terre Haute, In¬\ndiana, producing and presenting news shows and working\nwith public affairs programs, as well as serving at times as\nannouncer and director.\n^ Martin E. Pinsker, supervisor of network operations for\nCBS, this fall is teaching a course in announcing, speaking,\nand newscasting for New York University. He will stress\npractical broadcasting skills, using tape recordings, individual\nanalysis of performances, discussions of styles, and review of\nprofessional requirements.\n^ H. Lee Marks has been named chief engineer of WTV1,\nthe Charlotte, North Carolina, ETV station scheduled to be¬\ngin operations next year. Marks has been assistant chief en¬\ngineer for KTCA-TV, Minneapolis-St. Paul.\n^ Murrell F. Jones, superintendent of Monroe County schools,\nIndiana, has been named field associate for MPATI. He will\nwork with all schools in southern Illinois and four southern\nIndiana counties.\n^ Jack D. Hewett, former commercial radio station executive\nand announcer, has been appointed admissions counselor at\nIthaca College, New York.\n^ Jonathan Schiller, formerly program director of WIAA-FM\nat the National Music Camp, Interlochen, Michigan, is now\nthe coordinator of music communications for the School of\nMusic at the University of Illinois.\n^ George Gerbner has written, for the October Phi Delta\nKappan, a critical essay on the new NBC series about a high\nschool teacher, Mr. Novak. On the whole he seems to feel\nthat the series is a promising one, one which will generally\npresent the teacher in a realistic light.\n^ Jack Jennerjahn, WHA-TV producer-director, has resigned\nto join the staff of KTCA, St. Paul-Minneapolis.\n^ WFSU-TV, Florida State University, announces new staff¬\ners : Richard Heuer, production manager, formerly producer-\ndirector at WMSB, Michigan State University and free-lance\nfilm cameraman in New York City; Ron Whittaker, staff\nproducer-director, formerly producer-director in New Bruns¬\nwick, Canada; D. Keith Carlson, also staff producer-director,\nformerly WFSU studio supervisor; and Ron Bissland, studio\nsupervisor.\n^ Richard B. Sessoms has joined Colonial Williamsburg as a\ngeneral assistant in the press bureau. Among his duties will\nbe handling television liaison.\n^ William Scott, formerly with KCSD-TV, Kansas City, has\njoined the staff of WETV, Atlanta, Georgia, as producer-\ndirector.\n^ Harold Lowery has been promoted to producer by the\nBirmingham studio of the Alabama ETV network. His former\nposition as film editor has been filled by Eric Smith, Jr., who\nhad a similar job with the network’s Auburn studio.\n^ Added to the St. Petersburg Junior College radio-TV com¬\nbination teaching-production staff are David Platts and Ken¬\nneth Stein. In August the department moved into its own\nmodern classroom-studio building.\nNAEB Headquarters: Suite 1119, 1346 Connecticut Avenue,\nN. W., Washington, D. C., 20036. Phone 667-6000. Area Code 202.\nINSTRUCTION\n^ Last month the Wisconsin School of the Air began its 33rd\nyear of broadcasting programs for in-school listening. Through\nthe ten stations of the state broadcasting service, the School\nof the Air reached some 235,000 pupils during the 1962-63\nyear. This year’s schedule includes thirteen series of programs\ncovering creative activities, health, music, science, and social\nstudies.\n^ Meantime, WHA-TV, the University of Wisconsin tele¬\nvision station, is offering twelve courses for in-school view¬\ning. WHA-TV coverage was extended in May, 1963, to cover\nan eleven-county area. The Wisconsin School of the Air-\nTelevision courses are in arithmetic, French, algebra, kinder¬\ngarten, nature, science, and Exploring the News.\n^ TV College of the Chicago City Junior College will be on\nthe air on WTTW for its eighth consecutive year. College\ncourses for the fall trimester will be in biology, physics, art\neducation, German, English composition, speech, psychology,\nslide rule, and world literature.\n^ Stanley P. Lapin, of Adler Electronics, predicts that teach¬\ning by TV is likely to become as familiar as the use of text¬\nbooks by 1970. Lapin made the comment in a speech before\nthe third annual ETV conference at Fordham University in\nAugust.\n^ Dr. Seymour A. Smith, president of Stephens College, has\nannounced the ten colleges and universities that will partici¬\npate with Stephens in the telephone network linking their\nclassrooms (see August NAEB Newsletter, page 3). For the\nfirst semester of 1963-64, these will participate: Drury Col¬\nlege, Springfield, Missouri; Kansas Wesleyan University,\nSalina; Langston University, Langston, Oklahoma; LeMoyne\nCollege, Memphis; Morehouse College, Atlanta; and Wilber-\nforce University, Wilberforce, Ohio. During the second se¬\nmester these four will join the telephone network: Grambling\nCollege, Grambling, Louisiana; Jackson State College, Jack-\nson, Mississippi; Southern University, Baton Rouge, Louis¬\niana; and Tougaloo Southern Christian College, Tougaloo,\nMississippi.\ny The University of Texas announces that an octagonal lec¬\nture hall in its new undergraduate library and academic cen¬\nter will allow almost limitless possibilities in imaginative\nteaching. From his lectern, the lecturer can call forth visual\nprojections, recorded sounds, and ETV presentations—or bring\ninto view a demonstration set up in advance on a revolving\nstage. Lectures can be translated simultaneously into four lan¬\nguages for individual headsets, and microphones are distrib¬\nuted throughout the auditorium so that students can ask or\nanswer questions.\nGENERAL\n^ September 12 was dedication day for the Philadelphia area’s\nnew ETV outlet on Channel 12, WHYY-TV. Among the\nroster of guests on the opening program was FCC Chairman\nE. William Henry, introduced by NAEB President William\nHarley. A number of programs on the new station originate\nin the Wilmington studios—including a series of weekly news\nanalysis programs to be produced by the Wilmington news¬\npapers.\n^ September, 1964, is the target for large-scale programing\nby the Charlotte-Mecklenburg (N.C.) station, WTVI. Work¬\ning drawings for the station are finished and construction bids\nare being received.\nGeorgia’s fourth ETV station, WVAN, Pembroke, began\nroadcasting September 9. It transmits videotapes originated\nby WGTV, University of Georgia.\n^ Northwestern University’s “Reviewing Stand” begins its\nthirtieth year of continuous broadcasts with the program of\nOctober 13. It is radio’s longest-run discussion-interview series,\nand one of broadcasting’s oldest programs still on the air. It\nbegan as a cooperative venture of commercial WGN and\nNorthwestern University, and two years later Mutual Broad¬\ncasting began carrying the weekly programs. Today it sup¬\nplies the series to some 125 of its affiliates.\nOctober, 1963\n3"
}