{
  "id": "d1868-3",
  "text": "SkxEB NEWS LETTER.. ,, .MAY I, 1940.. ..Page 4\n“Section 3.94(c) is hereby made Section 3.94(d), and Section 3.94(d)\nis made Section 3.94(e)f and the following is inserted as Section\n3.94(c):\n“Section 3.94(c). The licensee of a standard broadcast station may,\nwithout further authority of the Commission, rebroadcast on a non¬\ncommercial basis a noncommercial program of an international broadcast\nstation, provided the Commission is notified of the call letters of\neach station rebroadcast and the licensee certifies that express\nauthority has been received from the licensee of the station origin¬\nating the program.H\n\"Section 4.10(d) is deleted; Section 4.10(c) is made Section 4.10(d),\nand the following is inserted as Section 4.10(c);\n\"Section 4.10(c). The licensee of a noncommercial educational broad¬\ncast station may, without further authority of the Commission, rebroad¬\ncast the noncommercial programs of a standard broadcast station oj\nan international broadcast station, provided the Commission is notified\nof the call letters of each station rebroadcast and the licensee\ncertifies that express authority has been received from the licensee\nof the station originating the program.\"\n\"The words \"or noncommercial educational\" are stricken from Section\n4.10(b).\"\nSEE PACKET; ■.VEtCOKE OKLAHOMA BAPTIST\nFor the first time the NAEB packet contains a contribution from the\ncampus studios of Oklahoma SaptistUniversity.newassooiateember\nof NAEB. Ralph E. I.atthews, director of Oklahoma Baptist University\ncampus studios says;\n\"Our radio work here at O.B.U. has progressed very satisfactorily this\npast year. We have developed a fine schedule and ^«ene P\nhas been solendid. Our University broadcasts are oarrieu y\n0*1*0,, w «. 'X/S.ttSNwriSSw\nmonthly when we present our Varsity variety suu Q++4arlfi»nce\nauditorium we always have from 500 to 600 people i a\n\"I enjoy very much receiving the NAEB newsletters and the items\nincluded in it and find it very helpful.\nYou*11 also find material from’Ohio State, Washington State, Illinois,\nand the University of Kentucky.\nAGPA REPORT ON RADIO\nThe report oi ». -«**1 S? “SC'S SS*01*'\nAssociation was presented at ~ ttie committee was Elmer Sulzer,\nbs.s.’s s\";*™\nK.:rf,-.e“*::ix?™“ s— - — *• • •*\nthe report for you in the NAEB packet."
}