{
  "id": "d1568-1",
  "text": "Page 2\nSection 3*\nSection k»\nSection 5>.\nSection 1.\nSection 2*\nSection 1.\nSection 2*\nSection 1.\nAny educational institution or public service agency which meets\nthe qualifications mentioned in Section 1 and Section 2 of this\narticle and whose name has been approved by the Board of Directors\nand on the payment of the annual dues of the association to the\ntreasurer of the organization, may become an active or associate\nmember of the association.\nEach institution may hold one membership- Each active member is\nentitle to one vote irrespective of the number of stations oper¬\nated by the member. An associate member holds no vote except as\na member of an association committee to which he has been duly\nappointed.\nAny member may be suspended for any act which, in the judgment of\nthe Board of Directors, constitutes a violation or breach of any\nof the terms of the charter or by-laws of this association by\nan affirmative two-thirds vote of the entire Board of Directors;\nprovided, however, that no such vote shall be taken until such\nmembers shall have been advised in writing by registered mail of\nthe charged preferred against him at least fifteen days before\nsuch vote by the Board of Directors; and provided further, that\naction of the Board of Directors may be reversed at the next\nannual meeting of the Association by a two-thirds vote of those\nin attendance at the convention.\nARTICLE IV\nOfficers & Directors\nOfficers of this association shall be a president and others\nduly authorized and elected in accordance with the by-laws of\nthe Association, from among the active membership.\nThe Board of Directors shall consist of the president, other\nauthorized officers and other members, each representing one\nof the districts of the Association.\nARTICLE V\nElection of Officers and Directors\nOfficers and Directors shall be elected at the annual meeting\nof the Association in a manner specified by the by-laws.\nIn case of a vacancy of office, the Board of Directors shall\nhave power to fill the same until the next annual meeting.\nARTICLE VI\nAmmendments\nThis constituttion may be ammended by a two-thirds vote of the\nactive membership. Notice of any proposed ammendments should be\nj"
}