{
  "id": "d1568-4",
  "text": "Page 5\nSection 1\nSection 2\nSection 3\nSection 1\nSection 2\nof transacting business. If less than a quorum is present a\nmajority of the active members present may adjourn from time to\ntime until a quorum is present. No member shall be entitled to\nbe represented by proxy.\nA majority of the. Board of Directors shall constitute a quorum.\nThe President of the Association shall serve as chairman of the\nBoard of Directors. In the absence of the president, the members\nmay choose a chairman.for the meeting.\nARTICLE III\nNomination and Election of Officers and Directors\nThe Nominating Committee shall present a slate at the annual\nmeeting for the following officers:\nPresident Secretary\nVice-President Treasurer\nSix Directors\nexcept as otherwise provided in Section 2.\nAny member of the Association may make additional nominations\nfrom the floor.\nThere shall be one Director elected from each of the six districts.\nDirectors from Districts one, three and five shall serve two\nyears, beginning with election in odd-numbered years; Directors\nfrom Districts two, four, and six shall serve two years, begin¬\nning with election in even-numbered year.s\nElection shall be by ballot when necessary. A chairman and two\ntellers shall be appointed to receive the ballots for each officer\nand trustee. They shall canvass the ballots so cast and announce\nthe result to the presiding officer, who thereupon shall declare\nthe members receiving the majority of the votes cast elected to\nthe respective offices.\nARTICLE IV\nInitiation Fees and Dues\nActive Members. Each active member shall pay dues for each\nfiscal year ending December 31* in accordance with rates\nestablished in Section 2, and upon billing by the Association\nTreasurer.\nClassification for Determining Dues. For purposes of determining\ndues the members shall be classified according to transmitter\npower, and shall pay according to classification within which each\nmember’s station or stations fall, provided; however, that the\nmaximum payment shall not exceed $50.00 annually."
}