{
  "id": "d1540-0",
  "text": "A E B\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 GREGORY HALL URBANA, ILLINOIS\nNAEB TO PRESENT SESSIONS\nAT COLUMBUS INSTITUTE\nTwo clinics on instructional uses of television and\nradio will be sponsored by the NAEB on opening day\nof the Institute for Education by Radio-Television in\nColumbus, Ohio, May 12-15. A luncheon program\nfeaturing a distinguished speaker is also planned for\nMay 12 as a third event organized by the NAEB\nUtilization Committee under the chairmanship of\nGale R. Adkins.\nThe two clinics, scheduled as simultaneous meet¬\nings, will concentrate on actual problems encoun¬\ntered in the use of television and radio for instruc¬\ntional purposes. John Henderson will conduct the\nradio clinic, and Clair Tettemer will be in charge of\nthe television session.\nThe Monday luncheon, which drew a capacity\ncrowd last year, will be the only general NAEB\nluncheon at the 1958 Institute. Because it is sche¬\nduled for the opening day of the Institute, those\nplanning to attend are urged to send in reservations\nto NAEB Headquarters. A deposit is not needed for\nthe reservation. The luncheon is set for 12:15 p.m.\nwith the afternoon sessions beginning at 2:30.\nGRANTS-IN-AID APPLICATIONS\nDEADLINE NEARS\nApplicants for 1958 program grants-in-aid are remind¬\ned that the deadline for receipt of applications at\nNAEB Headquarters is May 1, 1958. Since announce¬\nment of the project was made earlier this year than\nlast, the deadline is correspondingly earlier.\nThese grants-in-aid are part of a three-year plan\nof support for educational radio programming spon¬\nsored by the ETRC and NAEB. The general theme\nof the plan is “The Twentieth Century American.”\nNecessary information concerning topics and pro¬\ncedures for prospective grant applicants may be ob¬\ntained from Headquarters.\nNAEB Newsletter\nVol. XXIII, No. 4\nApril, 1958\nNAEB Newsletter, a monthly publication issued by the\nNational Association of Educational Broadcasters, 14 Gregory\nHall, Urbana, III. $5 a year, edited by Jane Lombard.\nNAEB DISTRIBUTES\n\"DECLARATION OF CONSCIENCE\"\nThe NAEB network facilities have provided people\nof this country with their first opportunity to hear\na broadcast of Dr. Albert Schweitzer’s “Declaration of\nConscience.” Although Dr. Schweitzer’s text has\nbeen broadcast by all other major free nations of the\nworld, as far as it is known, until this time the United\nStates, Soviet Union, and Communist China were the\nonly major nations which did not broadcast it.\nNAEB has distributed a half-hour tape-recorded\nreading of the Declaration as a special program of¬\nfering to its network member stations in the United\nStates, Hawaii, and Puerto Rico for an estimated\nlistening audience of 40 million. This reading was\ndone by Dr. Emory Ross at station WNYC, New\nYork.\nStations were also provided printed texts of the\nDeclaration, made possible by the Saturday Review\nwhich first published it in this country.\nDr. Schweitzer’s Declaration is an appeal to\npeoples of the world to realize the implications of nu¬\nclear warfare and experimentation. His statement\nwas read last April 24 over Radio Oslo and released\nto all nations under the auspices of the Nobel Prize\ncommittee.\n—NAEB—\n1"
}