{
  "id": "d1540-1",
  "text": "GREETINGS FROM THE PRESIDENT\n—Burton Paulu\nNow more than ever before, we of NAEB are edu¬\ncators who broadcast, rather than broadcasters who\neducate.\nOne of our problems in maintaining this emphasis\nis to free ourselves from the attractiveness of the in¬\nstruments we use. Microphones and cameras are fun\nto work with; what is more, sooner or later most of\nus must personally learn to operate them. For a\nperiod during World War II, I had to man the main\ncontrol room at KUOM several hours each week, al¬\nthough I am no engineer, and I have produced many\nbroadcasts, although production has never been one of\nmy primary responsibilities.\nHave you ever noticed how educators and subject\nmatter experts often are intrigued with the mechanics\nof broadcasting? It is not at all unusual to find ed¬\nucators, with no knowledge whatsoever of technical\nprocedures, spending more time talking about the\nsound pick up, lighting, picture quality and' visuals\non programs than about their basic educational val¬\nues.\nBut despite the challenging technical problems\nthat confront us, we have come more and more to\nrealize that microphones, cameras and programs are\nonly the means to the end, and not the end itself.\nWe broadcast to provide educational services for our\nlisteners and viewers, not just for the sake of broad¬\ncasting. That is the reason NAEB conventions now\nfeature more talks by educational leaders and fewer\nroundtables on techniques. This also explains the in¬\ncreased interest of our members in the overall educa¬\ntional process. NAEB “oldtimers” are doing more\ngeneral reading and accumulating more degrees. New\nstaff members frequently have backgrounds in the\nhumanities and education, as well as in announcing,\nwriting and production.\nAt the same time that we are extending our ed¬\nucational horizons, it is encouraging to note that\nteachers and educational administrators are gradually\ndeveloping greater regard for the broadcasting\nprocess. Many—perhaps most— of them do not yet\nappreciate how many types of knowledge and skill\nbesides our own are involved in educational radio and\ntelevision. The planning and production team at a\nminimum must include administrators, content\nauthorities, teachers, producers, research workers and\nengineers. But progress is being made. On the na¬\ntional front, NAEB contributes through its work¬\nshops, seminars and conventions. Locally, our indi¬\nvidual members are developing themselves as educa¬\ntors, while always advancing their proficiency in\nbroadcasting techniques. Taken together, all this is\nleading to better understanding among the several\ngroups involved in educational broadcasting.\nMEMO FROM THE\nEXECUTIVE DIRECTOR\n—Harry Skornia\nThe NAEB is a pretty amazing organization. Within\nour ranks we have TV and radio; closed circuit and\nopen-circuit; school, college and university stations;\nproduction centers, individuals, and on and on.\nWTe also are a busy organization. I am amazed at\nthe number of projects we sometimes have going on\nat the same time. For instance right now we have in\nthe planning stage:\nA Children’s Program Seminar (which will be\nover by the time you receive this)\nA Video Recording Workshop\nA Utilization and Teachers’ Workshop and Semi¬\nnar\nAn ETV Managers’ Seminar\nIERT Sessions\nA Washington meeting with various related\ngroups.\nComing in daily are applications for any of another\nhalf dozen projects for which applications and screen¬\ning are necessary:\nThe Workshops and Seminars mentioned above\nWorkshop Grants-in-Aid\nRadio Program Grants-in-Aid\nScholarships\nOther deadlines, such as for Research Grants-in-Aid,\nand meetings, such as the Region VI meeting and the\nResearch Seminar, are now past for this year, of\ncourse.\nThese are mentioned so you will not be surprised\nif no one of us has time to read all the applications.\nWith all the reports, correspondence, and other\npressures, there simply isn’t time. You’ll also under¬\nstand why applications have to be sent with the\nproper number of copies. If we began to make copies\nhere for distribution to the far-flung committee and\nsub-committee members who make the selections, it\ncould easily run to hundreds of copies.\nIn addition to this, I will personally have been out\nof the office on NAEB business twenty-nine days\nduring the first three months of 1958. Harold Hill\n2\nNEWSLETTER"
}