{
  "id": "d1540-2",
  "text": "and Cecil Bidlack have also been on the road a good\ndeal for meetings at which they best represent the\nNAEB. This helps explain why, particularly at such\na time, you may not necessarily receive a reply from\nthe person you address.\nNone of this is by way of complaint. I think it\nproves that we’re growing. Certainly all of us, in¬\ncluding president, committee chairmen, officers and\ndirectors, are very busy.\nWe think all this is a good sign. We hope you\nagree and understand.\nNETWORK NEWS\n—Bob Underwood\nDuring the past few weeks we have offered and sent\nquite a few special programs to member stations.\nForemost among these programs was a reading of\nDr. Albert Schweitzer’s “Declaration of Conscience.”\n(To my knowledge we are the only American net¬\nwork to make this Declaration available to its listen¬\ners, and I think we should be proud of this fact.)\nSome of these special programs are made available\nto us by member stations; however, the vast majority\nof them come from independent producers who either\nhave access to certain individuals who would not\notherwise appear on the air or who have produced\nprograms which the commercial stations either can\nnot or will not carry. We feel that the programs we\noffered to you were appropriate material for educa¬\ntional stations.\nIn connection with these special programs the\nonly request we make is that stations broadcasting\nthem so inform us. We assume that stations order¬\ning a given special program will broadcast it; how¬\never, when a program of great importance and gen¬\neral interest (like the Schweitzer program) comes\nalong, we send it to all network stations without go¬\ning through the routine of offering and ordering. It\nis the broadcasting of this type of special program\nwith which we are concerned'.\nConsider the Schweitzer program: when the an¬\nnouncement about its distribution went out, it car¬\nried a simple form stating that Station So-and-So\nbroadcast the program. Stations which did broadcast\nthe program were requested to return the form. Now,\nover two weeks later, the number of forms returned is\nnegligible.\nIf we are to continue offering special programs of\nthis nature we must have some evidence that they\nare being broadcast and heard throughout the coun¬\ntry. It is imperative that we have something con¬\ncrete to show the producers so that they will continue\nto make their programs available to us; and we our¬\nselves must determine if the time and' tape utilized\nin distributing these programs is worth the effort.\nTime and time again we have been approached\nby members requesting that the network make every\neffort to obtain programs of special interest to listen¬\ners to educational stations. We, are happy to do this,\nand we have succeeded in obtaining such programs.\nHowever, we cannot continue to obtain such pro¬\ngrams unless you are going to broadcast them and\ninform us of your actions. May we have your coopera¬\ntion? If you broadcast or intend to broadcast the\nSchweitzer Declaration please let us know by return¬\ning the form we supplied. Thank you.\nPUBLICITY AND PUBLIC RELATIONS\n—William Bender, Jr.\nWUOM, University of Michigan\nOne critical phase in any publicity operation comes\nafter your research is finished, your information is all\norganized and your story is written. Now, who can\nyou get to print it? How far will it go?\nEach additional outlet you find for a given story\nhas the same, functional effect as researching, organ¬\nizing and writing an entirely new story. Hence the\nproblem of distribution—or “mileage”—takes on con¬\nsiderable importance.\nMost broadcasting stories peter out after distribu¬\ntion to local newspapers. A few are pushed along to\nout-of-town papers and to publications like Broad¬\ncasting-Telecasting, Variety, TV-Guide, Radio-TV\nDaily and our own NAEB Newsletter. Occasionally,\nthere will be one worth sending to the wire services\nfor regional, state or national distribution.\nYour story might find a home in campus pub¬\nlications, too: the yearbook, student paper, alumni\nmagazine or faculty newsletter. In larger colleges and\nuniversities, a flurry of special publications originate\nin the various schools and departments. Often the\neditors welcome items about the broadcasting work\nof their faculty and students.\nOne of the most challenging and richly rewarding\noutlets for your stories may be found in the field of\ntrade journals.\nThe September 1957 issue of Pride, published by\nACPRA, had a stimulating article on this subject.\nAPRIL, 1958\n3"
}