{
  "id": "d1540-4",
  "text": "NAEB SEMINARS PLANNED\nPlans are currently progressing for two forthcoming\nNAEB seminars to be held in the summer. The\nSeminar on Instructional Uses of Television and\nRadio is set for July 21-25 at Allerton House, the\nUniversity of Illinois Conference Center. Following\nthis, in August, the Television Management Seminar\nwill be held at the University of Wisconsin.\nAnnouncements giving complete information on\nthese seminars will soon be sent to NAEB member\nstations. Further details will also appear in future\nissues of the Newsletter.\nETV DIRECTORS PREDICT\nNATIONAL NETWORK\nDirectors of the nation’s non-commercial ETV sta¬\ntions predict that a national live network will be in\nexistence by 1968, according to a report released by\nthe ETRC and its affiliated stations. The report,\nbased on last month’s meeting of the Center’s affili¬\nates, foresees a total of 100 stations linked together to\nserve 80 per cent of the country’s population.\nDistribution of programs by live networks will be\nstarted first on the state level, as they are now in\nAlabama, then through regional networks and in 10\nyears, by a live national network. To help meet the\nincreasing demands at all levels of education, the ETV\ndirectors envision longer on-the-air schedules for ed¬\nucational stations, more remote broadcasting, the use\nof color, and improved programming made possible\nby larger and better trained staffs.\nThe managers regard the purpose of their total\nservice as being basically the same as the objective\nof education in general, but implementing it to give\nall people in a given area the educational and cultural\nvalues formerly communicated only to a few.\nNBC RENEWS ETV SERIES\nNBC joined the ETRC last month in a third coopera¬\ntive venture in national network programming for\neducational TV stations. Three live series, telecast\nin New York, started March 24, and will continue\nfor 13 weeks. The weekly series programs, which are\nsent to the nation’s interconnected ETV outlets, are\nconcerned with the subjects of American jazz, A-\nmerican foreign policy, and medical and scientific\nresearch.\nMonday evenings, educational TV enters a re¬\nsearch laboratory at New York University’s Medical\nCenter for the series titled “Decision for Research.”\nThis program, designed to interest more young people\nin research fields, examines medical and biological re¬\nsearch in its methods, aims, achievements, and re¬\nwards.\nErwin D. Canham, editor of the Christian Science\nMonitor, is host on “Briefing Session,” a Tuesday\nevening series which deals with American foreign\npolicy. Manning a panel with him are political scien¬\ntist Robert Strauz-Hupe and radio-TV commentator\nMerrill Mueller. Guests from the fields of journalism\nand government help to review the current status of\nforeign policy and present varying points of view.\n“The Subject is Jazz” on Wednesday, with host\nGilbert Seldes, author of “The Seven Lively Arts.”\nThis series traces the history and development of\nAmerican jazz, featuring guest appearances by jazz\nauthorities from professional and academic fields.\nEach week a combo demonstrates the various kinds\nof jazz.\nIn addition to the three live series, NBC and\nETRC present a group of filmed programs. “Report\nfrom America,” which reports on various aspects of\nAmerican life, had previously been broadcast only in\nforeign countries.\nThe ETV project is conducted jointly by NBC’s\npublic service programs department, directed by Ed¬\nward Stanley, and the Center’s program department,\nwhose representative is Edward Cohen.\nSENATE HEARINGS\nON FUNDS FOR ETV\nSen. Warren Magnuson (D-Wash.) has planned' hear¬\nings on educational television for his Senate Com¬\nmerce Committee soon after Congress returns from\nEaster recess, according to a report in the March 17\nBroadcasting. The hearings in part will deal with\nMagnuson’s own bill (S 1759) to provide up to $1\nmillion to each state for ETV.\nSen. Magnuson has proposed this bill, feeling that\neducational TV has not been overly successful be¬\ncause state legislators and educational groups failed\nto provide funds.\nBOX\nSCORE\nTotal\nAM\nStations - 3222\n(includes\n38\nnon-commercial)\nTotal\nFM\nStations - 697\n(includes\n157\nnon-commercial)\nTotal\nTV\nStations - 583\n(includes\n31\nnon-commercial)\nAPRIL, 1958\n5"
}