{
  "id": "d361-104",
  "text": "6\nINSTRUCTIONAL TELEVISION FIXED SERVICE\nThe ITFS provides 31 channels in the 2500-2690 megacycle band, thus\nrelieving the pressure for broadcast ETV allocations when the sole need is for\nthe transmitting of instructional materials over a limited area. The ITFS may\nalso transmit special materials to selected receiving locations such as police\nand fire stations, clinics and similar places where training or orientation\nmay be enhanced through TV. Especially significant is the fact that up to five\nprograms (because of potential channel shortages in many areas, in May, 1966\nrule-making was in progress to amend Commission rules to authorize a maximum of\nfour channels per licensee for a single site) may be transmitted and received\nsimultaneously, thus tending to alleviate the scheduling problem in many\ninstitutions.\nIn 1961 the Midwest Program for Airborne Instruction, Inc. (MPATI) begin a\ntrial period of experimental transmission of educational programs by UHF to\nparticipating elementary, secondary and higher education institutions in Indiana\nand parts of Ohio, Kentucky, Illinois, Michigan and Wisconsin from aircraft\ncircling above Montpelier, Indiana. On June 30, 1965, the Federal Communications\nCommission, in ruling on MPATI's petition for regular operation on six channels\nin the upper UHF broadcast band, deemed the Instructional Television Fixed\nService more appropriate for MPATI's purposes. Accordingly, the Commission\nauthorized MPATI to apply for six channels in the 2500-2690 mc/s band, and\nprovided for a phase-out of the two-channel UHF trial operation by the end of\nthe 1969-1970 school year. MPATI's application for a CP for six ITFS channels\nwas approved in March, 1966.\nITFS channels are 6 mc/s band width and are organized in seven groups of\nfour and an eighth group of three. ITFS transmitting equipment is relatively\nlower in cost than television broadcast equipment. However, while the 2500 mc/s\nsignal is transmitted openly, the cost of a special receiving antenna and\nconverter remove the system, for practical purposes, from home use. In\naddition, ITFS transmission is not intended for reception by the general public.\nBecause technical considerations and operations differ from that of\nstandard VHF and UHF broadcasting, detailed rules and regulations governing ITFS\noperations have been established. Among the most pertinent considerations are\nthe following: requirements for eligibility to be a licensee of an ITFS station\nare the same as those for a noncommercial educational television station;\ntransmitter engineers must be technically qualified, but routine operations may\nbe performed by third-class radiotelephone permit holders; remote control and\nunattended operation of some equipment are provided for; permission to utilize\nthe signal must be obtained by the potential user from the transmitting licensee.\nB-18"
}