{
  "id": "d361-106",
  "text": "- 8 -\nAs early as 1952 the FCC recognized the incipient financial difficulties\nconfronting ETV when it stated:\n\"It will admittedly be a difficult and time consuming\nprocess in most instances, but the likelihood of ultimate\nsuccess, and the importance to the public of the objective\nsought, warrants the action taken . . . Television is\nclearly a fertile field for endowment, and it seems probable\nthat sufficient funds can be raised both through this method\nand through the usual sources of funds for public and\nprivate education to enable the construction and operation\nof many noncommercial educational stations. As concerns the\ncosts of operation, there is the possibility of cooperative\nprogramming and financing among several educational organi¬\nzations in large communities.\"\nPublic and private financing have greatly assisted ETV. The Ford Founda¬\ntion's Fund for the Advancement of Education has been one of ETV's principal\nsupporters, and at the present time is providing funds for National Educational\nTelevision and percentage-matching grants for community stations.\nAn ETV finance study completed by the National Association of Educational\nBroadcasters in 1965 showed direct budgeted support accounting for 54% of the\naverage income of all stations, and gifts, grants and donations providing 237..\nAbout 207. of ETV income is earned through services rendered by stations, such\nas production contracts, rental of facilities, and consulting. The average\nyearly budget for all stations was $370,000, although individual station\nbudgets varied from less than $80,000 to more than $2 million. The average\npercentages for individual items were: salaries, 4470; equipment and engineering,\n25%; overhead, affiliations, office supplies and similar costs, 1170; expansion,\n8%; procurement of programs from outside sources, 3%; other expenses, 97o.\nThe Educational Television Facilities Act of 1962 provides matching Federal\ngrants of up to one million dollars per state, to a total of $32 million, for\nthe construction and expansion of ETV stations. This Act--Public Law 87-447--\nis administered through the Department of Health, Education, and Welfare. Other\ngovernment legislation--some expressly specifying educational television and\nsome by implieation--helpful to both broadcast ETV and ITFS includes the Elemen¬\ntary and Secondary Education Act of 1965, specifically Title III, Supplementary\nEducational Centers and Services, and PL 815, Construction and Assistance to\nFederally Affected Areas; The Higher Education Act of 1965, specifically Title I,\nGrants for Construction of Undergraduate Academic Facilities, Title II, Grants\nfor Construction of Graduate Academic Facilities, and Title VI, Financial Assist¬\nance for the Improvement of Undergraduate Instruction; National Defense Education\nAct, especially Title III, Financial Assistance for Strengthening Instruction in\nScience, Math, Modern Foreign Languages, and other critical subjects. Title VI,\nLanguage Development, and Title VII, Research and Experimentation in more Effective\nUtilization of Television, Radio, Motion Pictures and Related Media for Educa¬\ntional Purposes; Vocational Education Act of 1963; Appalachian Regional Develop¬\nment Act of 1965, especially Title II, Special Appalachian Programs; Economic\nOpportunity Act of 1964, particularly Title I, Youth Programs, and Title II,\nUrban and Rural Community Action Programs; and the State Technical Service Act\nof 1965.\nB-20"
}