{
  "id": "d361-107",
  "text": "9 -\nIn a speech to the International Radio and Television Society in the fall\nof 1964, then Federal Communications Commission Chairman E. William Henry\nexpressed concern for the financial needs of educational television, clarifying\nthe issue as a crucial one. Chairman Henry stated:\n\"Educational television has accomplished wonders with\nthe resources at its command. But the time has come to say\nthat it will never realize its full potential until its\nfinancial base rises to a radically new level. While that\nlevel does not have to be anywhere near the posh plateau\ninhabited by commercial television, it must provide support\nfor good programming on a realistic basis. That educational\ntelevision should permanently struggle for subsistence is\nintolerable ... we must not fail to supply educational\ntelevision, one way or another, with sufficient funds. The\nresult is far too important for the future of this industry\nand this country.\"\nAPPLICATION PROCEDURES\nThe Commission's Table of Assignments, Section 73.606 of the Rules and\nRegulations, contains the educational reservation status and frequencies of\nchannels allocated to a given city. An educational organization or institu¬\ntion may apply for a reserved or nonreserved channel. Funds available\nthrough the Educational Television Facilities Act of 1962, however, are allo¬\ncated to permittees or licensees on reserved channels only, unless the\nConstruction Permit had been obtained prior to passage of the Act.\nIf there is no reserved channel in a given community, a qualified group\nmay petition for reservation of an unused assigned channel, for the \"drop-in\"\nassignment of a channel, or for the reallocation of a channel from another\ncity. The petition must clearly delineate the purpose of the proposal and\nshow why it would be in the public interest. If the Commission determines the\nproposal warrants consideration, it will institute rule-making proceedings, and\nif the assignment is subsequently made, an application may then be made to\nactivate the channel.\nVirtually all prospective applicants obtain legal and engineering counsel\nto assist in supplying required and accurate information to the Commission.\nExpeditious processing frequently is dependent upon the good order of the\napplication and the completeness, specificity and preciseness of the information.\nApplicants for new broadcast stations, license renewals, or\nin existing facilities, must give local public notice of intent,\nlocal station (if any) and/or in a local newspaper, as specified\n71.580 of the Rules and Regulations.\nmajor changes\nthrough a\nin Section\nB-21"
}