{
  "id": "d361-110",
  "text": "12\nFCC Form 701: Application for Additional Time to Construct\nRadio Station.\nFCC Form 321: Application for Construction Permit to Replace\nExpired Permit.\nFCC Form 323E: Ownership Report for Noncommercial Educational\nTV, FM, or Standard Broadcast Station.\nNETWORKS\nAt the beginning of 1966 no live national ETV network existed, although\nNational Educational Television (NET) had well advanced plans for such inter¬\nconnection. The potentials of an ETV national and, indeed, worldwide satellite\nnetwork were being given realistic consideration. Regional live networks\nalready exist and national tape networks are active.\nNET has become known as the \"fourth network,\" not rivaling, but supple¬\nmenting the three commercial networks. Taped programs are distributed to more\nthan 100 ETV stations. Funded primarily by the Ford Foundation, NET provides\nto its affiliates five hours per week of newly produced programs, two and a\nhalf hours per week of updated children's programs, and access to a large\nlibrary of programs for re-run. Production is arranged with independent pro¬\nducers or with affiliated stations, with consultation or supervision of the\nNET staff.\nThe National Association of Educational Broadcasters (NAEB), through the\nW. K. Kellog Foundation and the National Home Library Foundation, established\nin late 1965 a program service to its affiliates under its Educational Tele¬\nvision Stations Division. Programs made available from ETV stations and other\nsources are distributed through a tape network arrangement.\nInstructional materials are distributed on a national basis by the North¬\neastern ITV Service in Boston, Massachusetts, the Great Plains Regional ITV\nLibrary, Lincoln, Nebraska, and the National Center for School and College TV\n(encompassing the former National Instructional TV Library of New York) in\nBloomington, Indiana.\nAt the beginning of 1966, the Eastern Educational Network (EEN) was the\nonly physically interconnected ETV regional network. The EEN supplies in¬\nschool programming and about 80% live evening programming to stations in Maine,\nNew Hampshire, Massachusetts and Connecticut, and is developing an extension of\nits live interstate network on a regular basis to include members in New York,\nDelaware, Pennsylvania and Washington, D. C. The Upper 6, Midwest Educational\nTelevision, a regional network similar to the EEN, was being planned.\nB-24"
}