{
  "id": "d361-112",
  "text": "- 14\nThe Educational Media Council, 1346 Connecticut Avenue, N. W., Washington,\nD. C. 20036, is composed of representatives of national educational and business\norganizations, including such groups as the American Book Publishers Association,\nthe American Library Association, and the Society of Motion Picture and Tele¬\nvision Engineers. This group researches and develops plans for projects for the\neffective use of specialized interests and skills in educational communications\nat all levels.\nThe Department of Audio-Visual Instruction (DAVI) of the National Education\nAssociation, 1201-16th Street, N. W. , Washington, D. C. 20036, holds conferences,\nconducts research projects, publishes reports and provides consultation on educa¬\ntional media, including television, for its member schools and teachers.\nThe National Commission on Educational Television, 26 New Street, Cambridge,\nMassachusetts 02138, was established by the Carnegie Corporation of New York in\nNovember, 1965. Its purpose is to study the technical, organizational financial\nand programming considerations of ETV, to determine the medium's role in\ncontemporary America, and to make recommendations for its future support and\ndevelopment.\nThe national Committee for the Full Development of the Instructional Tele¬\nvision Fixed Service, Federal Communications Commission, Washington, D. C. 20554,\nwas established in late 1965 to serve as a liaison, informational and advisory\ngroup on 2500 mc/s on the national, regional, state and local levels. Its members\nrepresent, principally, non-profit educational institutions and organizations.\nOther groups on the national level, such as the College Conference Division\nof the International Radio and Television Society, are involved in educational\ntelevision activities. Many regional, state and local groups, such as the\nSouthern Regional Education Board, are active in educational broadcasting matters.\nGOVERNMENT AGENCIES\nSpecial offices relating to educational broadcasting have been established\non State and Federal levels.\nThe Educational Broadcasting Branch, Federal Communications Commission,\nWashington, D. C. 20554, has as its purpose the facilitation of the development\nof educational broadcasting, including all forms of radio and television for\nwhich the FCC is responsible. The Branch is involved in the development of rules\nand regulations governing educational broadcasting, is concerned with inter-agency\neducational broadcasting affairs, and provides informational, liaison and guidance\nservices.\nThe Department of Health, Education, and Welfare has two offices responsible\nfor the Educational Television Facilities Act of 1962, which provides matching\ngrants for the construction or expansion of ETV broadcasting facilities. The\nB-26"
}