{
  "id": "d361-114",
  "text": "NOTES\nKit Number 1\nSOME THOUGHTS ON THE\nSTRENGTHS AND WEAKNESSES OF TELEVISION\nAS AN INSTRUCTIONAL RESOURCE\nSome of the weaknesses exhibited and criticized in instruction\nby television, are not inherent in the medium or in the basic\nnature of its specific contributions or total impact. They appear\nto reflect, rather, as shortcomings in the planning, preparation,\nand presentation of the materials which the channel conveys.\nWe should keep this in mind when we attempt to assess the poten¬\ntialities or limitations of television AS A CHANNEL, AS A RE¬\nSOURCE, AS A TOOL. Implicit in any meaningful statement\nabout what television can or cannot do in the classroom are the\nqualifications: \"well-planned, effectively-presented, appro¬\npriate television offering and properly used.\"\nWITH THIS IN MIND, we suggest that:\n• Television can enhance the impact and the clarity of things taught. .\nthrough effective technical presentation . It has an impressive capac¬\nity for bringing the materials of learning into clear, close, imme¬\ndiate, and meaningful focus.\nTelevision can provide for each student \"the best seat in the class¬\nroom.1 It offers superior opportunity for close-up observation.\nIt can change the physical point of view, from close scrutiny of\nsmall areas, to observation of larger areas at greater distances,\n(or it can reverse these perspectives), smoothly and quickly.\nThis flexibility and \"finger-tip control\" heighten television's capac¬\nity for directing attention and enhancing concentration.\nBy establishing direct eye contact, television makes possible a\none-to-one, personal relationship between the television tea¬\ncher and each individual student in the classroom.\nTelevision can enable a class to watch an activity which would be\nspoiled by direct observation.\nTelevision can reinforce the important relationships which bring\norder to learning by (1) superimposition, (2) split-screen presen¬\ntation, (3) other special technical effects.\nB-28"
}