{
  "id": "d361-116",
  "text": "NOTES\nKit Number 1\n0 Television can make significant contributions in such areas as group\nguidance, instruction in library use, physical education, driver\ntraining, and other such subjectareas where extremely large group\nrepresentations are feasible, and where detailed and close-up\ndemonstrations are impractical or impossible in a large classroom\nwith a live presentation. (This is particularly true where school\nsystems have their own television equipment.)\nSome of these things television does better than others. In some of\nthese areas the strength of its contribution is conditioned by the way it\nis used in the classroom.\nBut there are some weaknesses inherent in the medium, some things\nwhich television is not, and cannot do, despite excellence of planning,\npreparation, and presentation, despite skill in utilization.\n• Television cannot conduct a seminar discussion efficiently.\n0 Television cannot give specific and direct personal help.\n• Television cannot assess the special situation, the special character of\na particular class as a group, the special needs and interests of in¬\ndividual students within a particular classroom. Although, for the\nreasons we have given, the reactions of the viewers are really in¬\ndividual reactions and may thus help us work with individual\ndifferences, it is the classroom teacher who must make the assess¬\nments and design the activities which take these differences into\naccount.\n9 Television cannot answer questions, cannot detect confusion and lack\nof understanding, cannot detect and adjust to degrees of interest,\nattention span, emotional reaction, levels of awareness or read¬\niness .\n0 Television cannot offer the warm, personal climate in which the shy\nchild gains confidence, the aggressive child learns to discipline\nhis energies, the rejected child moves toward acceptance, the\nbright and talented children find the best channels for their abil¬\nities. It must leave these important tasks of reassuring, guiding,\ninspiring, and counseling to the classroom teacher.\n• Television has neither brains, integrity, nor feelings—no essential moral\nor intellectual nature of its own. It has no ability except to\ncommunicate, but if used skillfully, it can communicate excep¬\ntionally well.\nB-30"
}