{
  "id": "d361-121",
  "text": "Kit Number 2\nWorking with the Teacher's Guide, the calendar, and with\nstate and local courses of study, the classroom teacher plans\nhow best to coordinate his objectives, to schedule his\ntime and that of the class, to coordinate resources and\nmaterials to determine the over-all content of the course\nor unit of study.\nA DESIGNER\nKnowing that activities which are appropiate for devel¬\noping skills are not necessarily those most appropriate for\ndeveloping attitudes or reinforcing knowledge or estab¬\nlishing values, the classroom teacher mustdesign activites\nappropriate to the behavior which he and the television\nteacher want to result.\nA SPECIALIST IN STUDENTS NEEDS, INTERESTS, STRENGTHS,\nAND WEAKNESSES\nThe unique insightsof the classroom teacher are invaluable\nto the successful utilization oftelevised instruction. Better\nthan anyone else he knows the nature of this class as a group\nand of his students as individuals.\nDrawing upon this knowledge of his studentsand theirsitua-\ntions, he makes sure that his students have what they need.,\nto have and know what they need to know to get the most\nfrom the lesson on the screen. He organizes the physical\nclassroom in the best way possible to permit maximum\nviewing.\nDuring the television lesson the classroom teacher is ac¬\ntively involved with his class as a whole and with its\nindividual members, exemplifying attentive interest in the\nlesson on the screen, observing student reaction, leading\nresponses.\nThe special knowledge of the classroom teacher provides\nthe guidelines for involving the students in the class in total\ngroup activities, in small groupactivities, and inactivities\nsuited to the individual students, to clarify, reinforce, and\nentend the television lesson.\nProviding for the indivdual differences of his own students\nis one of the most important responsibilities of the classroom\nteacher, the thing which only this member ofthe team can\ndo, the thing which this partner is enabled todo better be¬\ncause of the other partner's contribution.\nC-4"
}