{
  "id": "d361-132",
  "text": "NOTES\nKit Number 2\nRESPONSIBILITIES OF THE CLASSROOM TEACHER\nWITH TELEVISED INSTRUCTION\n1. - to help learners learn from their television experience.\n2. - to get himself ready for the telecast by reading the manual and\ncarrying out its suggestions as far as practicable. (He should use\nthe manual, not follow it slavishly; he should improve on it and,\ni n any event, never ignore it!)\n3. - to get his c lass ready for the te lecast by giving purpose of the lesson\nand alerting students as to the things to watch for (gives listening\nassignments).\n4. - to show class how the tele lesson relates to what they \"re studying.\n5. - prior to tele lesson, to get materials ready for students to work with\non the program.\n6. - to make physica I arrangements of the room, necessary for te lecast.\n7. - to observe learners during the telecast (to note where they are\npUzzeled, where involved, where disinterested, etc.)\n8. - to participate with students during the telecast in front of the room\n(standing, not sitting) actively working with students.\n9. - to follow up immediately by clarifying, re-explaining, carrying\ntopic further building on the telecast.\n10. - to feed back to TV teacher the reactions of the class at specific\npoints during the te le lesson (what went over and what didn't; what\nwas clear and what wasn\"t clear)„\n11 . - to build and maintain a favorable attitude toward the telecast.\n12. - to study the literature in the field (research reports).\n13. - to experiment with creative follow-up activities.\n14. - to bring books and other materials to class to have available at the\nconclusion of the telecast.\n15. - to use the telecast as a springboard for further learning activities.\n16. - to provide ample opportunities for interaction following the telecast\nbetween teacher and learners and between learners.\n17. - to evaluate the success or failure of Instructional Telvision in his\nclassroom\nPrepared by\nHarold E. Wigren\nEducational Television Consultant\nNational Education Association\nC-15"
}