{
  "id": "d361-136",
  "text": "NOTES\nKit Number 1\nWithin the past few years, \"printed\" or\n\"etched\" circuits have come into general\nuse. Both of these type circuits are essen¬\ntially the same. Where they are used, they\nreplace the bulkier, hand-wired circuit.\nBoth the printed circuit and the hand-wired\ncircuit have certain advantages . The print¬\ned circuit isstable, cheaper to manufacture,\nand is more compact. On the other hand,\nthey are easier to damage and difficult to\nrepair. The hand-wired circuit is stable,\nrugged, easy to repair, but is bulky and more\nexpensive to manufacture. Either type can\ngive excel lent service . Before se lecting one\nor the other, the kind of use the set will have\nand who is going to service the set should be\nconsidered.\nCABINET - Receivers are available in three\nbasic cabinet designs; table model, con-\nsolette, and console or floormodel cabinets.\nIt makes little difference which type is\nselected as long as certain specifications are\nmet. The cabinet should be such that it can\nbe mounted on rollers or on a roller stand.\nThe set should be placed at a convenient height\nfor group viewing . In high school classrooms\nthe bottom of the screen should be 4 1/2 feet\nfrom the floor. This height shou Id be reduced\nfor elementary grades.\nThe stand shou Id be sturdy and difficu It to tip\nover, but it must be small enough to go\nthrough doors and ha I Iways. If it is going to\nbe used on different floors in the building it\nshould be made of lightweight material, such\nasaluminum tubing, so it can be carried from\nfloor to floor.\nThe cabinet itse If shou Id be made of wood or\nmetal. While a good cabinet is important\nto the durability of the set, the purchaser\nbe careful not to spend a lot of money on\nneedless cabinetry. A well-built, sturdy\ncabinet of simple design is usua I ly sufficient.\nSAFETY CONSIDERATIONS - There are\ncertain safety features that should be stand¬\nard on a 11 sets . The picture tube shou Id have\na bonded face plate or be covered with shat¬\nter-proof glass. The back of the set should\nbe enclosed to prevent personal injury or\ndamage to the set. The cabinet should be\nwell ventilated so that the heat generated\nby the set will not be trapped. The instru¬\nment should be transformer powered, free\nfrom shock hazard. Underwriters Laboratory\napproved, and be wired so that it can be\ngrounded. It might be desirable to have a\ndoor covering the controls so that they can\nbe pre:-set and locked. Some sets also have\na lock on the rear cover to prevent tampering\nwith the set.\nSOUND-One of the most often overlooked\nparts of a television program is the sound.\nThe sound is just as important and, in some\ninstances, more important than the picture.\nThe FM sound broadcasting system used in\ntelevision is capable of exce I lent quality.\nIn many cases this quality is lost at the re¬\nceiver. A classroom receiver should have\nan amplifier that will deliver 5 to 10 watts\nof undistorted power. The speaker shou Id be\na minimum of 8 inches in diameter and mount¬\ned facing the front. Some table models use\na small speaker mounted on the side or top\nof the set. If a set with this type speaker is\nused, then provisions should be made to at¬\ntach an auxiliary front-mounted speaker to\nthe set. This may be mounted in the stand or\nin anauxuliaryspeaker cabinet. The repro¬\nduced sound should be clear in all parts of\nthe room, free from distortion, buzzing or\nhum. A tone control is not generally nec¬\nessary but if one is available it can be used\nC-19"
}