{
  "id": "d361-169",
  "text": "Kit Number 6\nthat is destroying humanity,\" the urgent need for people to be\naroused to the threat and to \"prod\" officials and government to\nundertake preventive and \"clean up\" measures against air pollu¬\ntion. He gives the estimated cost of cleaning up our atmosphere.\nThere is repeated a film clip seen at the beginning of the lesson,\npicturing a wasteland of smog and smoke.\nLesson Excerpt The excerpt from this PLACES IN THE NEWS\nlesson on AIR POLLUTION, seen in Film 6,\ncovers approximately the last four minutes of the lesson. Jerry\nSilverstein, the teacher-commentator, is making the statement:\n\"We are at this moment creating an environment that is destroying\nhumanity.\" Mr. Silverstein suggests that we must all be aroused\nto the threatand must \"prod\"officials and governmentto take pre¬\nventive and \"clean-up\" action. He cites the cost of cleaning up\nour atmosphere at about two bi I lion dol lars. \"Remember the opening\nof our program?\" he asks. \"It bears repetition.\" There is seen\nthen, to close the lesson, the film clip with which it began, a\nsegment from the National Film Board of Canada's production,\nTHE FIRST MILE UP.\nSECOND EXCERPT\nSeries FRANKLIN TO FROST is a series of sixty-four telecasts\non American Literature, each slightly less than thirty\nminutes in length, produced and distributed by Midwest Program\non Airborne Television, Inc., Lafayette, Indiana. The teacher is\nProfessor Arthur M. Eastman. Of selection, order, emphasis, the\nResource Guide (available through the producers) says: \"Only\nimportant authors have been selected, since it seems easier for the\nstudent to remember more, and more of what is first rate, when the\nstudy is thus limited. The arrangement is chronological. The\nprinciples of importance and chronology will occasionally be vio¬\nlated in the interest of i I lumination.... These principles will also\nbe violated when it seems wise to specialize—to stop our study of\nindividual authors and explore the basic principles underlying the\nvarious genres or kinds of writing — Narrative Fiction, Poetry,\nHumor and Satire, Drama. The emphasis is critical. The goal is\nto develop a disciplined and pleasurable knowledge and under¬\nstanding of a series of significant works by American authors, from\nFranklin to Frost.\"\nG-13"
}