{
  "id": "d361-37",
  "text": "NOTES\nKit Number 5\nA SEQUENCE USED IN DEVELOPING\nINSTRUCTIONAL TELEVISION LESSONS\nClass room Need\nTelevision lessons are effective only when\nthey answer a need which exists in the class¬\nroom. That need must be recognized and\ndefined, perhaps by the classroom teacher as\nthe one closest to the classroom situation. It\nmustbe articulated either by teachers orad-\nministrators. Ideally, then, when curriculum\ndecisions are made concerning the use of\ntelevision lessons in the classroom, the design\nof the television lessonswill follow the class¬\nroom need.\nIdea Development\nThose concerned wi th the development of the\ntelevision lesson should seek out individuals\nas sources of advice and consultation. They\nshould ask the help of classroom teachers,\ncurriculum supervisors, special interest\ngroups, and specialists in education, subject\nmatter, and television production , From the\ninformation furnished by these advisors, the\nProgram Developer can determine the kind of\nsupport the television lesson is to offer, the\nlevel at which it is to be used, and the nature\nand extent of the content.\nIdea Evaluation\nAs the content and form of the lessons emerge,\na committee of specialists scrutinize the pro¬\nposed lessons. This committee includes class¬\nroom teachers, content authorities, curricu¬\nlum directors, and television producers. In\nsome instances, these will be the same people\nwho helped with the idea development. How¬\never, this is an opportunity to involve addi¬\ntional people and to have a fresh reaction to\nthe ideas. The lessons should be evaluated\nfor their relationship to the need which ex¬\nists, the contribution they make to learning,\ntheir adaptability to television and potential\nfor using the medium to advantage, their ap-\npriateness of form, and their place in the\ncurriculum.\nRefinement of Idea for\nT e I e v i s i o n\nUsually, there will emerge from the larger\nadvisory committee a small working group\nconsisting of the producer-director, the on-\ncamera teacher, the writer (if there is to be\na separate writer), and one or more consult¬\nants who are specialists in content, curricu¬\nlum, lesson theory, and classroom teaching.\nThis small core of workers will map out the\nspecific television lessons in terms of series\nand specific lesson objectives, generaliza¬\ntions or main ideas to be covered in each\nlesson, the relationship among the various\nlessons, the lesson sequence, and review and\ntest segments.\nTeacher's Guide\nIdeally, the Teacher's Guide should be writ¬\nten after a television lesson is produced, This\nis not possible unless the series is being pre¬\nrecorded far enough in advance to allow for\nwriting, printing, and distribution . Most\nTeacher's Guides are written before the pro¬\ngrams are produced since the majority of pro¬\ngrams are broadcast I ive or recorded just be¬\nfore they are used. Sometimes the television\nteacher writes the Teacher's Manual alone.\nIt is a better idea, however, ifoneortwo\nmembers of the planning group can help.\nD-15"
}