{
  "id": "d361-75",
  "text": "Bl BLIOGRAPHY\nAND TV, TOO, Department of Classroom Teachers, Department of Audio\nVisual Education, National Education Association, Washington, D. C.,\n1961, 63 pp.\nBased on the conference working papers of eight educators,\nexamined and revised by 22 classroom teachers and television\npersonnel, this has much basic information about instructional\ntelevision, presented clearly and directly. One of the best of\nthe beginning references for the classroom teachernew to tele¬\nvision .\nDESIGN FOR ETV, Planning for Schools with Television, Prepared by\nDave Chapman, Inc., Industrial Design for Educational Facilities Lab-\noratolries. New York, 1960.\nA superbly illustrated report showing how to plan new schools or\nadapt existing schools for teaching by television. Excellent\nmaterial on room arrangement for television. It presents the\nconclusions of a study conducted by industrial designers in con¬\njunction with educators, psychologists, architects, engineers,\netc. While the equipment section needs up-dating, it is highly\nrecommended. Free on request. (Diamond)\nEDUCATIONAL TELEVISION: The Next Ten Years, Wilbur Schramm,\n(Ed.), Stanford: The Institute for Communications Research, 1962,\n375 pp.\nA report and summary of majorstudies on the problems and poten¬\ntial of educational television, under the auspices of the United\nStates Office of Education, contains major questions, issues and\nguidelinesbasedondiscussions with national leaders in the field\nof educational television. A most comprehensive, thoughtful,\nand scholarly approach to the major aspects of television's present\nand future in education.\nEQUIPMENT GUIDE FOR CLASSROOM TELEVISION, Sylvania\nSecond publication, more detailed information about equipment\nconcentrating on the \"hardware\" of educational television and\ntypical ETV systems, with some reference to installation, main¬\ntenance, and personnel considerations. Attractively and clearly\npresented, but commercial in orientation.\n1-3"
}