{
  "id": "d361-77",
  "text": "INTERACTION IN LEARNING” IMPLICATIONS FOR TELEVISION,\nFinette P. Foshay (Edo), National Education Association, Division of\nAudioVisual Instruction, 1201 16th Street, N.W., Washington, D „ C.\n20036, 1959.\nThis pamphlet, prepared by a group of distinguished educators\nfor the NEA, examines in detail the components of interaction\nand the need for it,. Especially worthwhile is the second half,\nwhich discusses in detail techniques for achieving interaction\nwhen using television. (Diamond)\nMONOGRAPH NO. 1 OF THE TECHNOLOGICAL DEVELOPMENT\nPROJECT OFTHE NEA, Donald P. Ely (Ed.), Created under contract\nwith UoS„ Officeof Education, Department of Health, Education, and\nWelfare, (Special Supplement of AV Communications Review.)\nDefinition and terminology in the rapidly-growing field of in¬\nstructional technology. Considers \"The Changing Role of the\nAudio Visual Process in Education\" to arrive at a definition of\nthe field and a glossary of related terms designed to unify those\nworking in instructional technology by clarifying their image of\nthemselves and their communications among themselves.\nNEW MEDIA IN HIGHER EDUCATION, James W. Brown and James W.\nThorton, Jr. (Ed.), San Jose State College, California, Published by\nthe Association for Higher Education and the Division of Audio Visual\nInstructional Service of the National Education Association, 1201 16th\nStreet, N. W„, Washington, D. C. 20036.\nPREPARING OBJECTIVES FOR PROGRAMMED INSTRUCTION, Robert\nR. Mager, Ph.D., Senior Scientist, Behavioral Science Project, Central\nResearch Laboratory, Varian Associates, Palo Alto, California, Fearon\nPublishers, 828 Valencia Street, San Francisco, California, 1961.\nA book for teachers and student teachers. . .for anyone interested\nin transmitting skills and knowledge to others. . .a book about\npreparing instructional objectives. . .a basic step to successful\nlearning.\nPRODUCING YOUR EDUCATIONAL TELEVISION PROGRAM, Pre¬\npared by C. Edward Cavert for the Mohawk-Hudson Council on Educa¬\ntional Television, Schenectady, New York, Published under a grant from\nGeneral Electric, (Revised Edition, 1961. Original Edition written by\nAngela McDermott and Donald E. Schein, 1955.)\n1-5"
}