{
  "id": "d361-84",
  "text": "WE'RE GLAD YOU HAVE THIS KIT . .\n. . . and we hope you will see others in the series, because we believe\nthese materials can be of practical value to you who are now working\nwith or who contemplate working with television in the classroom.\nCertainly your interest in investigating these resources represents an en¬\ncouraging trend in education today. . . a healthy open-mindedness to¬\nward new approaches, when our familiar, traditional habits have proved\ninadequate or inappropriate. This becomes increasingly importantas the\nswiftly-shifting dimensions of twentieth-century life continue to demand,\nin those who help youngsters learn, an alert capacity for enlisting new\nresources and putting them to work in the most efficient ways possible.\nOne of these resources is instructiona I te levision . Aswe explore ways of\ngetting at its best performance, experience indicates that this helpful\nmedium does not bestow identical blessings in all cases, and we are\nbeginning to see why it may succeed in one c lassroom to a greaterextent\nthan in others and appear to favor some teachers or school systems more\nthan others.\nThe plain truth is that instructional television works best for those who\nknow how to use it. The object of these kits is tohelpyou join the ranks\nof those whoknow, for this is no mysterious body of knowledge, no com¬\nplex system of new and hard-to-learn techniques. As you view these\nfilms and see television taking its place in the classroom, see good\nteachers working with television in effective ways, you will likely dis¬\ncover that you are a I ready prepared to use it properly. The methods are\nthose which all good teachers know well. Clues to some of the answers\nare found within you, yourself, in your own personal strengths and weak¬\nnesses, your particular capabilities, and your special interests.\nYou need only acquire some new ways of thinking about yourself and\nyour important work, some guidelines for organizing the help at hand\ninto more useful patterns. We think you will find that in seeking out\ntelevision's best ways of working, you will have discovered yours, too.\nAdditional information may be obtained by writing to:\nDr. Clair R. Tettemer\nNAEB Teaching Materials Library\nc/o KFME-TV/Channel 13\nHighway 81 South\nFargo, North Dakota 58101"
}