{
  "id": "d1338-11",
  "text": "-12-\nWinifred, Cathryn, Roz, Bob and Joanne gracing the south half of the room nearer\nthe entrance door. Our telephone system is being revised with a more flexible ar¬\nrangement where all phones will have all lines available.\nThe boys in the back room, Glenn Blackburn, Don Weber and our part-time duplicator^\nPatricia Gerrity and Jerry Rosenwasser remained unmoved by it all and our Network\nManager, John Holt, blissfully auditioned new network programs surrounded by reels\nand reels of tape in the former photographic laboratory light trap that serves as\nhis office\n-tt -it -;t -it -ft * -it -it -;t -it fl-\nOur Engineering Secretary, Miss Cathryn Polanka, is wearing a diamond on the ring\nfinger of her left hand. The lucky man is John Reed, a junior at the University\nof Illinois in the Division of Special Services, who is studying Personnel Manage¬\nment. The wedding is tentatively set for late December.\nWGBH-TV RECEIVES MICROWAVE RELAY GIFT FROM RAYTHEON\nAn invisible electronic link between WGBH-TV studios in Cambridge and its trans¬\nmitter on Great Blue Hill, 10 miles away, has just been donated by the Raytheon\nManufacturing Company of Waltham, Mass. Charles F. Adams, Jr., president of Ray¬\ntheon, presented the gift, which was announced by Ralph Lowell, trustee of the\nLowell Institute and president of the WGBH Educational Foundation.\nMr. Lowell also reported that WGBH-TV engineers already are preparing to install\nthe new microwave relay equipment, the KTR-100, on the roof of the station studios\nat 8U Massachusetts Avenue, opposite M. I. T. \"We deeply appreciate this generous\ngift from Raytheon,\" Mr. Lowell said. \"It is an indispensable part of our educa¬\ntional TV station, and will contribute greatly to the efficient and faithful re¬\nproduction of WGBH-TV programs in the homes of New England viewers.\"\nThe KTR-100 is a small microwave relay which picks up the sound and picture re¬\ncorded by television cameras and microphones, and flings both through the atmos¬\nphere at the same time without wires or cables. This electronic pathway from\nWGBH-TV studios extends south to Great Blue Hill.\nAlthough the KTR-100 is light enough to carry by hand in its metal \"suitcases,\" it\nwill be mounted permanently on a steel pedestal above WGBH-TV studios. The sight\nand sound are transmitted and received at each end of the 10-mile path by a four-\nfoot \"dish\" or aluminum reflector. The transmission from studio to transmitter\ncannot be interrupted by hurricanes or ice storms. ' After a program has been re¬\nceived by the \"dish\" on Great Blue Hill, it is then sent out through the WGBH-TV\ntransmitter over its 8U9 foot high antenna.\nERECTION OF WGBH-TV TOWER AND ANTENNA\n'•Erection of the WGBH-TV, Channel 2, tower and antenna began in late October,\" an¬\nnounced Ralph Lowell, Trustee of the Lowell Institute and President of the WGBH Edu¬\ncational Foundation. WGBH-TV tower, which is located on the summit of Great Blue\nHill, Milton Massachusetts, was custom built by Lehigh Structural Steel Company,\nand designed to withstand a wind velocity of 135> m.p.h. Steel anchor bolts pin\nthe four legs of the self-supporting tower deep into the granite of Great Blue\nHill. Florence Stove Company, Kankakee, Illinois, manufactured the antenna pole,\nwhich along with the six bays of the RCA antenna weighs 22,000 pounds, heaviest\nof any Boston TV station antennas."
}