{
  "id": "d1338-16",
  "text": "WTTW TO occupy EAST MING OF SCIENCE MUSEUM\nA three-year contract has been signed by the Chicago Educational Television Asso¬\nciation for space in the Museum of Science and Industry, The Association will\nset up studios and offices of WTTW in the east wing of the museum. Approximately\n13,000 square feet of space has been set aside for two studios, each 60 x UO\nfeet, a master control room, a film studio and offices of the station. The re¬\nmainder of the east wing is occupied by the A rmy. The station also will have\naccess to a theatre in the west wing of the building, which can accommodate\nlarge audiences and is equipped with a coaxial cable.\nA spring target date has been set for ¥TTW»s first program, with a regular sched¬\nule planned for next fall. WTTW will have its own entrance to the east wing for\npersonnel and guests of the station. Museum visitors will reach the station\nthrough the main museum entrance. Studios will be glass paneled to provide an\nexhibit for museum patrons.\nALABAMA MOVES AHEAD WITH STATP-WIDE ETV NETWORK\nAlabama is moving steadily toward the establishment of a state-wide educational\nTV network, with the initial part scheduled to operate by the year1s end. Inter¬\nviews with key officials during a recent tour of the area by National Citizens\nCommittee for Educational Television representatives brought out these facts:\n1. A ^00-foot tower erected atop Mt. Cheaha, highest point in the state, has\nbeen completed. A transmitter has been ordered. Operating at maximum\npower, the signal from this tower will provide coverage for some 60% of\nthe population of Alabama and will reach well into Georgia.\n2. Micro-wave relay units linking Tuscaloosa, Birmingham, and Auburn to\nMount Cheaha are being installed,\n3. At Tuscaloosa, seat of the University of Alabama, a studio is under con¬\nstruction with all equipment on hand. At Auburn, seat of the Alabama\nPolytechnic Institute, plans have been approved for another studio and\nconstruction is scheduled to begin soon.\niu A series of conferences, clinics, and workshops have stimulated general\nenthusiasm and concrete program planning on the part of educational in¬\nstitutions and systems throughout a major part of the state.\nWhile the ETV leaders of the State are waryof flat predictions, the present situ¬\nation indicates that by the end of the year a majority of the state*s population\nwill be within range of an ETV transmitter telecasting programs originating from\nthree producing units: the University of Alabama, Alabama Polytechnic Institute,\nand the Greater Birmingham Educational TV Association, Inc.—comprising the 2\npublic school systems surrounding Birmingham.\n* -x- -* -x- * * -x- * * * * * -x- -x- * -x- -x- -x- *\nEDUCATIONAL STATIONS NOW ON THE AIR\n* Feb. 10, 1955\n* AM—22 Mi—125 TV—11 *\n* -x-\n* WUNC-TV Chapel Hill, 1-8-25 -x-\n* WEDM-TV liunford, Ala., 1-7-22 *"
}