{
  "id": "d1338-19",
  "text": "-20-\nfour studios, preview the upcoming studio, roll and douse the projector and change\nslides, touch up tuning on the three micro-wave receivers, and keep the transmitter\nlog.\nMonday January 17 was spent in Washington with Cy Braum, engineering consultant\nfor the Joint Committee on Educational Television. Cy is preparing an informative\npaper on FCC procedures and we spent considerable time at the Broadcast Bureau of\nthe Commission getting some ideas on proof of performance test from TV license\napplications. Cy and I worked together and cooperated on engineering problems\nwhich concern educational television stations. One instance of this cooperation\noccurred when Dr. Skornia and I were in Seattle. It was Monday morning and KCTS\nhad scheduled and advertised a program for Tuesday evening. However on the pre¬\nvious Friday they had been informed by the FCC that they had not followed the\nproper procedure to obtain the Special Temporary Authority to conduct program tests.\nThey hurridly submitted the necessary information to the FCC but were afraid the\nSTA might not be received in time for the program to go on. Since we were in\nSeattle, we were able to bring Cy in on the problem. After Loren Stone explained\nthe situation to him, Cy, in Washington, was able to expedite action. Within a\ncouple of hours the STA was granted, Stone stopped worrying and the program went\non as scheduled, thanks to the working together of all agencies concerned.\nThe Colonial Airlines pilot informed his passengers they were landing in a \"snow\nshower\" in Syracuse, Monday evening (17). If five inches of snow is a shower, I’d\nhate to be there when it really snowed. There were times as we were descending ^\nthrough the shower when the wing tip lights were barely visible. I breathed a\nsigh of relief when I could see lights on the ground and the landing seemed to be\nno problem. Tuesday I visited the closed circuit studios at Syracuse University,\nalso their FM station WAER. Had quite a chat with Dr. Eugene S. Foster and Art\nWeld. They told me that at one time all of the live talent programs on WSYR-TV\n(a local commercial station) came from the Syracuse University TV studios. With\nthe construction of a live talent studio downtown, the programs originating in\nthe Syracuse University studios were cut back to a one half-hour daily commercial\nin addition to the regular schedule of educational programs Saturday and Sunday\nby the University. They took me on a tour of their studio and control room until\nJohn Soergel came in. He showed us their new GPL kinescope recording installation\nand there ensued quite a discussion of the problems of kinescope recording. Soergel\nrequested copies of the NAEB Engineering Committee reports on kinescope recording\nwhich he should have by this time. I also met Paul North, Technical Supervisor\nof WAER and spent some time in his office discussing the problems of radio and\ntelevision engineers at educational stations.\nWednesday morning (19) I met Jim Grant of the General Electric Company. We first\nvisited, the WSYR-TV live studio,then their film studio and master control room.\nThen we went to the G.E. demonstration studio where Jim gave us a fast run down\non the complete G.E. line of studio equipment. Among other things we saw the new\nG.E. color film and slide scanner under test. Their projector is manufactured by\nEastman and is of the continuous motion type. A rotating split circular mirror,\nwhose semicircular segments tilt as they rotate, enables the scanning raster to\nfollow the motion of the frame in the gate of the projector. An f/l.6 optical\nsystem is used in order to deliver the maximum amount of light to the dichroic\nmirrors and photo-electric cells.\nWe also visited Electronics Park with its assembly lines and test bays. Here we\nsaw equipment in various stages of construction and test from VHF television\nantennas to the G.E. chromacoder, which is their solution to the problem of the\npick-up of live color television. Grant says that each item of television built"
}