{
  "id": "d1338-2",
  "text": "-3-\nOir-DAY MEETING FOR REGION III ENGINEERS HELD AT W3EZ\nWBEZ, Board of Education station in Chicago, was host to engineers from NAEB\nRegion III members on June 10, The meeting was under the auspices of the NAEB\nRegion III, Paul B. Rickard, Director of Radio-TV at Wayne University and Di¬\nrector for the region, and the Engineering Staff of the Division of Radio and\nTV, Chicago Public Schools, George Jennings, Director, and E. H. Andresen,\nChief Engineer.\nIn the morning session, at the LaSalle Street studios of WBEZ, Mr. Andresen\ndemonstrated several pieces of broadcasting equipment which have been found\nuseful in the Chicago Public Schools, Since equipment is always of prime\nimportance to a public school or university station, considerable time was\nspent on this and the good features of each item were pointed out. A tour of\nthe studios and control rooms completed the morning session.\nIn the afternoon, a closed-circuit television demonstration, using both Orthi-\ncon and Vidicon cameras, was set up at the Adams Street studios of WBEZ. There\nwas discussion concerning the value and place of closed-circuit equipment in\nschool situations. Ross Utter, chief engineer of the Zenith Radio Corporation,\npresented many useful suggestions about maintenance procedures, Cornelius\nMcCarthy, of the WBEZ engineering staff, told about tape-recording problems;\nand John Lopatka, also of WBEZ, talked on master antennae for TV and FM re¬\nception. Mr. Lopatka also discussed a master antenna system devised by WBEZ\nengineers which is less expensive than any system available commercially. The\nbalance of the afternoon was given over to a question-and-answer period, and\nthe engineers closed the session at 5?30 p.m.\nThose who attended were unanimous in feeling that such a meeting was helpful\nand might well be continued on an annual or semiannual basis.\nWCET, CINCINNATI EDUCATIONAL TV STATION NOW ON\nCincinnati*s educational television station, on channel U8, Station WCET, went\non the air July 26 with a regular schedule of 1$ hours of educational tele¬\ncasting per week. The station will be on Monday through Friday. According\nto an engineering check, the.WCET signal will cover most of the Greater Cin¬\ncinnati area.\nThe station went on the air with a test pattern on June 29# Studios are at\nthe Cincinnati College of Music. Manager of the new educational TV station\nis Uberto T. Neely and Robert Huber is program director.\n-x- -x- * -x- x- -x- % * -x- -x*\nWOSU-TV, Columbus, Ohio, (Ch. 3h, educational), expects to have building plans\nready in a few weeks, after which the State will ask for bids. But no target\nwill be set until contract has been awarded."
}