{
  "id": "d1338-7",
  "text": "CONSTRUCTION BEGINS ON NEW KETC BUILDING\nPlans for KETC*s (Channel 9, St, Louis) permanent studios and offices at the cor¬\nner of Big Bend and Millbrook Blvds., have been approved and construction .is now\nunderway, Dr, Arthur H. Compton, chairman of the St, Louis Educational Television\nCommission and former Chancellor of Washington University announced. KETC went on\nthe air from temporary studios located in McMillan Hall at Washington University\noh September 21,\nContributed by Arthur B. Baer, president of Stix, Baer & Fuller department store,\nSt. Louis, the new building will be known as The Julius and Freda Baer Memorial,\nin honor of Baer*s parents. It will be erected at a cost of about ->185,000 on\nland made available by Washington University and is scheduled to be completed\nbefore the first of the year.\nThe 1U,000 square-foot building, designed for television operations, includes\na large studio, scenery storage room, sceneery shop, offices, control room, kine¬\nscope ’recording room and film rooms. Dr. Compton explained that the office and\nstudio sections of the new building will be of welded steel frame construction.\nThe studio exterior will be of insulated paneling while the office exterior will\nbe a combination of brick veneer and insulated panels. The steel and insulated\npanel construction of the studio section is being utilized because of its internal\nflexibility and adaptability for expansion. Also, it can be erected speedily and\nits cost is low.\nOwnership of the studio building will be retained by Washington University. It\nwill be leased to the St. Louis Educational Television Commission, operator of\nthe community-sponsored station KETC, for 20 years, at W1 per year.\nTV ‘NEWS BRIEFS\nThe FCC has approved a proposal under which commercial TV station KOLN in Lincoln,\nNebraska, will move from VHF Channel 12 to VHF Channel 10, and will turn Channel\n12, together with its operating equipment, over to a Trustee who will make it\navailable for use by the University of Nebraska.as a non-commercial educational\nstation. Under the proposal, the Trustee agrees to sell the present Channel 12\nbroadcasting facility to the University for ^100,000 up to July 1, 19^6, if the\nUniversity desires to buy.\nThe FCC added TV Channel 79 to the assignments at Toledo, Ohio. The action gives\nToledo three commercial channels and one educational reservation.\nNEW OSU BUILDINGS GIVEN OK\nTrustees of the Ohio State University have approved a giant building program.\nIt features.a ^2,500,000 campus auditorium, five 11-story dormitories, a new re¬\nsearch laboratory, television station and classroom building. The television sta¬\ntion and lab are estimated to cost ^200,000 each.\nKTHE, LOS ANGELES SUSPENDS OPERATION\nKTHE (TV) Los Angeles, second U.S, educational TV and first Los Angeles area UHF\nstation, suspended operation on September 15. The University Department of Tele¬\ncommunications will continue use of station facilities for instruction and research\nbut programs will not be telecast. The reason for the suspension was lack qf funds"
}