{
  "id": "d1686-4",
  "text": "NAEB NEWS LETTER\nPage 5\notiUNE I t 1944\nALSO HELP Dr. EDWIN Fra,\\KO GOLDMAN CELEBRATE HiS 26TH CONSECUTIVE YEAR\nAS DIRECTOR OF THE GOLDMAN Band, BY BROADCASTING HIS MONDAY AND FRIDAY\nNIGHT CONCERTS FROM THE »V*ALL IN CENTRAL PARKo\nNorman Oello Joio’s “Magnificat” which received its world premiere\nPERFORMANCE DURING WNYC's FlFTH ANNUAL AMERICAN MUSIC FESTIVAL THIS PAST\nFebruary \\\\2th thru 22nd) was selected for consideration by the Music\ncritics Circle of New York for their annual award for an outstanding new\n22SH5fJ^ '''0RK* IHE \"m£qn|p'cat\" received its first performance during\nthe WNYC American Music Festival Concert by the National Orchestral\nAssociation Symphony under the direction of Leon Barzinat Carnegie hALi\non February 14.\nOn Friday evening, May 26th, New York City’s Own Station WNYC and WNYC-FM\nbroadcasted the premiere performance of \"The Prince of Eisenach” from\nHunter College Auditorium.\n\"The Prince of Eisenach\" is a feature presentation of the New York City\nHigh School of Music and art Bach festival. It was written and produced\n8Y THE STUDENTS OF THE SCHOOL UNOER THE SUPERVISION OF LEONARD MaNHEIM\nOF THE RAMATIC DEPARTMENT. STAGING, SETS, SCENERY, DANCES, AND COSTUMES\nARE ALL ORIGINAL AND DESIGNED BY MEMBERS OF THE VARIOUS DEPARTMENTS OF\nthe High School of Music and Art. is of\n\"The Prince of Eisenach\" is sased upon Johann Sebastian Bach's Peasant\nCantata and Coffee Cantata. - T\nGordon Heath's \"Pledge for Tomorrow\", an original script dealing with thf\nwork of nurses, inaugurates the new Saturday night half-hour dramatic\nseries, \"I'M YOUR NEXT OOOR NEIGHBOR\" on WNYC, June 3 Leonard SeZnste.n\noutstanding young American composer and assistant conductor of thc New *\nYork Philharmonic Symphony, will serve as musical consultant and compose\nBarb^ M Watson UATER S*°WS ,N THE series» v\"h,ch is being produced by\nPHIL COHEN TAKES NEW POST\nThe Office of War Information on May 2l named 33-year-old Philip Cohen\nas director of the powerful OWI broadcasting station in Europe The\nrIcZ'?LNT, !S 'N 0PERATI0N EIGHT AND a HALF HOURS A DAY SENDING MESSAGES\nFROM THE ALLIED COMMAND TO THE UNDERGROUND IN OCCUPIED EUROPE- ITS\nMESSAGES ARE TRANSMITTED IN SIX LANGUAGES.\nDirector Cohen is a Harvard graduate who formerly was Chief of the Radic\nBureau of the domestic branch of OWI. HE began his career in radio in\nof Eouc'T^on °F ™E Radi° Product,°n Program of the United States Office\nCRAVEN ASKS NOT TO BE REAPPOINTED\nCommissioner T. A. M. Craven, whose term as a member of the Federal\nCommunications Commission expires on June 30, 1944, has announcfo that\non April 26, 1944, he requested the President not to reappoint him for\nanother term."
}