{
  "id": "d657-0",
  "text": "THE\nAMERICAN JEWISH COMMITTEE\n386 FOURTH AVENUE, NEW YORK 16, N. Y. Cable Address, \"WISHCOM, NEW YORK”\nTelephone MURRAY HILL 5-0181\nJACOB BLAUSTEIN, President\nIRVING M. ENGEL, Chairman Executive Committee\nVICTOR S. RIESENFELD, Chairman Administrative Committee\nALBERT H. LIEBERMAN, Treasurer\nGUSTAVE M. BERNE, Associate Treasurer\nEDWARD A. NORMAN, Secretary\nJOHN SLAWSON, Executive Vice-President\nJOSEPH M. PROSKAUER, Honorary President\nHERBERT H. LEHMAN, Honorary Vice-President\nSAMUEL D, LEIDESDORF, Honorary Vice-President\nHERBERT B. EHRMANN, Boston, Vice-President\nMILTON W. KING, Washington, Vice-President\nFRED LAZARUS, Jr„ Cincinnati, Vice-President\nNATHAN M. OHRBACH, New York, Vice-President\nRALPH E. SAMUEL, New York, Vice-President\nDAVID SHER, New York, Vice-President\nJESSE H. STEINHART, San Francisco, Vice-President\nALAN M. STROOCK, New York, Vice-President\nFRANK L, SULZBERGER, Chicago, Vice-President\nApril 1, 1949\nDear Sirj\nMost small educational stations have one problem in common. They want to\nput on top-notch public service programs — but they can*t afford the high\nexpenses involved. How many small stations can sign up Norman Corwin to\nwrite for them? Or Raymond Massey to play the lead role? Such would be\nheaven for the educational station. Today, however, shows of the highest\ncaliber, written and produced by names such as those mentioned above, are\navailable to you free of charge or at a nominal cost.\nThe American Jewish Committee issues the enclosed Radio and Television\nBulletin of Available Pro-Democracy Scripts and Recordings, which lists\nscripts and recordings that deal intelligently and artistically with the\npressing problems of prejudice and discrimination. The choice of material\nin this Bulletin ranges from spot announcements to full hour shows. All\nof it is either free of charge or fairly inexpensive. In this way, we\nhave made available for the small station, whose spirit is willing but\nwhose pocketbook is not, some of the finest production and writing talent\non radio and television today.\nBefore sending these Bulletins to you, I consulted with NAEB*s President,\nRichard B, Hull, in order to get his approval. Here is what he wrote me:\nWI think the American Jewish Committee is to be Complimented on this\nBulletin, which is as comprehensive a thing as I have seen, I know that\nall of our NAEB members will be interested in receiving the Bulletin and\nin using some, if not the majority of the plugs,1*\nWe think our Radio and Television Bulletin can get no higher recommendation.\nSincerely yours,\n(Miss Lynne Rhodes\nRadio Department\nLR:ms\nenc.\n,181"
}