{
  "id": "d657-14",
  "text": "- 12\nprovided nobody connected with the production of the broadcast is paid. It\nmay also be produced at educational meetings and at schools. Full-scale\nproduction and a cast of about eight are required. The Radio Department of\nthe American Jewish Committee, 386 Fourth Avenue, New York 16, New York, is\ndistributing copies of this script free of charge.\n22. THE HARBOR WE SEEK - A thirty-minute dramatization by Brad Crandall of\nmodern racial prejudice, based on the biblical lesson of \"The Good Samaritan.\"\nIt is an original Station WSB, Atlanta, Georgia, broadcast. The story is\ntold of Dr. Thomas Franklin and his young friend, Mike, whose experiences\nhelp set the course for \"the harbor we seek.\" Full-scale production and a\ncast of about ten are required. The script may be rebroadcast on independent\nlocal stations and can be secured without charge from the Radio Department\nof the American Jewish Committee, 386 Fourth Avenue, New York 16, New York.\n23. THE SEEDS - The \"Bright Tomorrow\" series includes this thirty-minute\ndramatization by Sol Panitz, originally presented on Station WINX, Washington,\nD.C. The story is told of an Italian immigrant who glories in becoming an\nAmerican citizen. His dreams of a nearly perfect America break up into ugly\nvisions of reality, wherein he finds the sordidness of the minds of some of\nhis fellow Americans. Full-scale production and a cast of about six are\nrequired. The script is not to be used for any purpose without prior per¬\nmission from the author, Sol Panitz, c/o Kal, Ehrlich and Merrick, Star\nBuilding, Washington, D. C. In order to secure copies of the script without\ncharge, write to the Radio Department of the American Jewish Committee,\n386 Fourth Avenue, New York 16, New York.\n24o THE EDITOR OF NEWVILLE - This fifteen-minute radio play by George Egon\nHatvary is an original American Brotherhood Week presentation by the National\nConference of Christians and Jews. It is the story of a newspaper editor\nwho fights for those principles upon which every community in America must\nbe based. Fairly simple production and a cast of about fourteen are required.\nThe script may be rebroadcast on local independent stations. A free copy of\nthe script can be secured from the National Conference of Christians and\nJews, 381 Fourth Avenue, New York 16, New York. Extra copies may be reproduced\nor secured at a charge of ten cents each.\n25. MUSIC FOR WORLD BROTHERHOOD - This thirty-minute dramatization by Jerome\nBayer is an original American Brotherhood Week broadcast presented by the\nNational Conference of Christians and Jews. It is a comparison of the harmony\nof music with that of true democracy. Full-scale production and a cast of\nfive are required. The script maybe rebroadcast on local independent stations.\nA free copy of the script can be secured from the National Conference of\nChristians and Jews, 381 Fourth Avenue, New York 16, New York. Extra copies\nmay be reproduced or secured at a charge of ten cents each.\n26. WHAT’S THE WHY? - A twenty-minute radio play by Esther M. Hawley origi¬\nnally presented in celebration of American Brotherhood Week by the National\nConference of Christians and Jews. It is a dramatization about two girls\nwhose friendship withers when one of them receives a promotion in her position.\nThe old cliches are used against the girl who receives a promotion to compen¬\nsate the loser for her failure. Her unfounded reasoning is pointed out.\nSimple production and a cast of about four are required. Permission to re¬\nbroadcast this script must be obtained from the National Conference of\nChristians and Jews. A free copy of the script can be secured from the National\nConference of Christians and Jews, 381 Fourth Avenue, New York 16, New York.\nExtra copies may be reproduced or secured at a charge of ten cents each."
}