{
  "id": "d657-20",
  "text": "- 18 -\ncance of the Statue of Liberty. Simple production and a cast of about\neleven are required. This script may be rebroadcast on local independent\nstations. For a free copy of the script write to the National Conference\nof Christians and Jews, 381 Fourth Avenue, New York 16, New York. Extra\ncopies may be reproduced or received at a charge of ten cents each.\n13. HOW DID HE GET THAT WAY? - The \"Let’s Play Fair\" radio series by Gretta\nBaker includes this fifteen-minute script originally presented by the\nNational Conference of Christians and Jews. It tells the story of a school¬\nboy who forms unwarranted prejudices because of his own shortcomings. Fairly\nsimple production and a cast of about eight are required. The script may\nbe rebroadcast on local independent stations. For free copies of the script\nwrite to the Radio Department of the American Jewish Committee, 386 Fourth\nAvenue, New York 16, New York.\n14. ONE GOD - A thirty-minute dramatization by Hedda Rosten adapted from\nFlorence Mary Fitch’s book \"One God, The Way We Worship Him.\" The script\noriginally produced by Station WNEW, New York, New York, describes the\ntraditional ways in which Jews, Catholics and Protestants worship the One\nGod. This script is particularly appropriate for presentation during\nBrotherhood Week and Religious Book Week. Full-scale production and a cast\nof about fourteen are required. This script may be rebroadcast on independent\nlocal stations. Scripts are being distributed without charge by the Radio\nDepartment of the American Jewish Committee, 386 Fourth Avenue, New York 16,\nNew York. Recordings of this program are also available and are listed under\n\"Recordings.\"\n15. THE RIGHTS OF BILL - A fifteen-minute dramatization written by Jerome\nBayer and originally prepared for the National Conference of Christians and\nJews. Fred, Joe and Mary, all of college age, while on a trip to Washington,\ndiscuss the duty of all to treat everyone as an equal, regardless of race,\nreligion or nationality. This is a simple script to produce and requires a\ncast of about eleven. Independent local stations may rebroadcast this script.\nCopies of the script may be secured without charge from the Radio Department\nof the American Jewish Committee, 386 Fourth Avenue, New York 16, New York.\n16. LOOK BEYOND THE LABEL - A thirty-minute dramatization by Irene D.\nJawarski. This script points up the fact that one should not be misled by\n\"labels,\" but should judge a person on his own merits. Fairly simple pro¬\nduction and a cast of eight are required. It may be broadcast on independent\nlocal stations. Scripts are obtainable for fifteen cents each from the Bureau\nfor Intercultural Education, 1697 Broadway, New York 19, New York.\n17. MEET YOUR RELATIVES - A thirty-minute dramatization by Alice B. Nirenberg\nadapted from \"The Races of Mankind\" pamphlet. This script shows that science\nanswers the myth of race superiority. It is simply written and can be easily\nproduced. The cast consists of twelve characters. This script may be re¬\nbroadcast on independent local stations. Copies may be secured from The Public\nAffairs Committee at ten cents a script. The following credit should be given:\n\"Meet Your Relatives\" is adapted from Public Affairs Pamphlet Number 85, \"The\nRaces of Mankind,\" published by the Public Affairs Committee, 30 Rockefeller\nPlaza, New York 20, New York.\n18. GUARANTEED FOREVER - A fifteen-minute Gretta Baker script originally pre¬\nsented on the \"Let’s Play Fair\" radio series by the National Conference of\nChristians and Jews. Servicemen who are not able to be at home to celebrate"
}