{
  "id": "d657-6",
  "text": "- 4 -\neto. are told. Every story has in#common a positive treatment of the problems\nof intergroup tensions. The following are the programs in the series:\nI. \"The Lesson\" - Starring Geraldine Fitzgerald, story by Marie\nLeslie Harrison from Mademoiselle.\nII. \"The Outcasts\" - Starring falph Bellamy, story by B. J. Chute\nfrom Colliers.\nIII. \"Rosika, The Rose\" - Starring Vera Zorina, story by Claudia\nCranston from Atlantic Monthly.\nIV. \"My Little Boy\" - Starring Melvyn Douglas, story by Carl Ewald\nfrom Woollcott Reader, Scribners.\nV. \"Yes, Your Honesty!\" - Starring Stefan Schnabel, story by George\nand Helen Papashvily from Anything Can Happen, Harpers.\nVI. \"Seasoned Timber\" - Starring Raymond Massey, story by Dorothy\nCanfield Fisher from Seasoned Timber, Harcourt, Brace & Co.\nVII. \"Birthday Gift\" - Starring Hugh Marlowe, story by B. J. Chute\nfrom Woman’s Home Companion.\nVIII. \"That Greek Dog\" - Starring Everett Sloane, story by MacKinlay\nKantor from The Saturday Evening Post.\nIX. \"There Isn’t Time New\" - Starring Bambi Linn, story by Helen\nGregutt from Seventeen.\nX. \"Act of Faith\" - Starring Alan Baxter, story by Irwin Shaw\nfrom The New Yorker.\nXI. \"My Song, Yankee Doodle\" - Starring Helen Claire, story by\nCarl Glick from This Week.\nXII. \"Watch That Play, Little Man\" - Starring Jay Jostyn, by Joe\nArchibald from Popular Sports.\nXIII. \"Bonus Notches, Pal\" - Starring Betty Garde, story by Dorothy\nWalworth from Reader’s Digest.\nThese programs may be presented on radio networks or independent local sta¬\ntions. Copies without charge may be secured from the Institute for Democratic\nEducation, 415 Lexington Avenue, New York 17, New York. Recordings of these\nprograms are also available and are listed under \"Recordings.\"\n9. LET FREEDOM SING - A series of ten, fifteen-minute disc jockey programs,\nin script form, written by Bernice Ravin, and produced by the Institute for\nDemocratic Education. The stories deal with American history and culture.\nThis series is based on Americana records by Decca, Lang-Worth, M-G-M, RCA-\nVictor, Columbia, Public Service Records. Permission to broadcast the\nprograms of this series has been granted by Station WEEI, Boston, Massa¬\nchusetts and by the Institute for Democratic Education. Full-scale produc¬\ntion is required. The scripts may be broadcast on all radio stations and\nmay be secured without charge from the Institute for Democratic Education,\n415 Lexington Avenue, New York 17, New York."
}