{
  "id": "d657-7",
  "text": "Spot Announcements\n- 5\n1. FOREIGN LANGUAGE SPOT ANNOUNCEMENTS - Scripts of one-minute spot announce¬\nments are available in Polish, Italian, Czech, German, Spanish and Lithuanian.\nThey are designed to improve intergroup relations. These programs are avail¬\nable gratis as a public service feature for foreign language broadcasts from\nthe Institute for Democratic Education, 415 Lexington Avenue, New York 17,\nNew York. Recordings of the spot announcements are also available and are\nlisted under \"Recordings.”\nSPECIAL ONE-TIME BROADCASTS\nReligious Scripts\n1. BEHOLD THE JEW - (Rosh Hashanah - New Year) - This half-hour dramatiza¬\ntion written by Milton Geiger and sponsored by the American Jewish Committee\nis an original Jewish New Year program presented on the National Broadcasting\nCompany network. Florence Eldridge starred as narrator in this adaptation\nof Ada Jackson’s prize-winning poem \"Behold the Jew.\" The story is told of\nthe contributions of the Jewish people, great and small, to civilization.\nFull-scale production and a cast of about twelve are required. This program\nmay be rebroadcast on member stations of the National Broadcasting Company\nnetwork and independent local stations. The scripts can be secured free from\nthe Radio Department of the American Jewish Committee, 386 Fourth Avenue,\nNew York 16, New York. Copies of the entire poem \"Behold the Jew\" can be\nsecured for $1.50 from the Macmillan Company, 60 Fifth Avenue, New York 11,\nNew York. Recordings of this program are also available and are listed\nunder \"Recordings.\"\n2. THE SEALED TUNNEL - (Yom Kippur - Day of Atonement) - A half-hour drama¬\ntization, written by Irve Tunick and originally presented by the American\nJewish Committee on the Columbia Broadcasting System Network in commemoration\nof Yom Kippur. It tells the history of the famous Touro Synagogue in Newport,\nRhode Island, which was dedicated as a national shrine. Full-scale production\nand a cast of about ten are required. The script may be rebroadcast on member\nstations of the Columbia Broadcasting System network and local independent\nstations. Free copies of the script may be secured by writing to the Radio\nDepartment of the American Jewish Committee, 386 Fourth Avenue, New York 16,\nNew York. Recordings of this program are also available and are listed under\n\"Recordings.\"\n3. DAY OF ATONEMENT BROADCAST - (Yom Kippur - Day of Atonement) - A half-hour\nprogram originally presented on the Columbia Broadcasting System network\nexplaining the significance of Yom Kippur, the Day of Atonement. The holiday\nmessage at the end of the script may be delivered by a leader of the com¬\nmunity. Simple production and a narrator and choir are needed. The script\nmay be rebroadcast on member stations of the Columbia Broadcasting System\nnetwork and local independent stations. Scripts can be secured without\ncharge from the Radio Department of the American Jewish Committee, 386\nFourth Avenue, New York 16, New York. Recordings of this program are also\navailable and are listed under \"Recordings.\""
}