{
  "id": "d657-9",
  "text": "- 7\nmay be secured from the Radio Department of the American Jewish Committee,\n386 Fourth Avenue, New York 16, New York. Recordings of this program are\nalso available and are listed under \"Recordings.\"\n9. THE BITTER HERB - (Pesach - Passover) - A half-hour dramatization written\nby Morton Wishengrad and sponsored by the American Jewish Committee. It is\nan original Mutual Broadcasting System network broadcast in commemoration of\nPassover. The story is told of the reunion of the Korman family in America\nafter its separation in Europe during the war. The urgent need to help^dis-\nplaced persons is expressed. Raymond Massey starred as narrator. Full-\nscale production and a cast of about seven are required. A choir furnishes\nthe music background. The script may be rebroadcast on member stations of\nthe Mutual Broadcasting System network and local independent stations.\nScripts can be secured without charge from the Radio Department of the\nAmerican Jewish Committee, 386 Fourth Avenue, New York 16, New York.\nRecordings of this program are also available and are listed under\n\"Recordings.\"\n10. THE FOUR QUESTIONS (Pesach - Passover) - This half-hour dramatization\nwritten by Morton Wishengrad and sponsored by the American Jewish Committee\nwas originally presented on the Mutual Broadcasting System network in com¬\nmemoration of Passover. It is an adaptation of Meyer Levin's \"Portrait of\na Chaplain,\" which originally appeared in Commentary Magazine. The story\nis based on the life of Chaplain Irving Tepper and his courageous and un¬\ntiring efforts to help his fellow servicemen. Melvyn Douglas starred as\nnarrator. Full-scale production and a cast of about five are required.\nThe script may be rebroadcast on member stations of the Mutual Broadcasting\nSystem network and independent local stations. Scripts can be secured with¬\nout charge from the Radio Department of the American Jewish Committee, 386\nFourth Avenue, New York 16, New York. Recordings of this program are also\navailable and are listed under \"Recordings.\"\n11. THE THIRD COMMANDMENT - THE STORY OF A MODERN EXODUS - (Pesach -\nPassover) - This is a half-hour dramatization presented by the American\nJewish Committee on the Mutual Broadcasting System network in commemoration\nof Passover. It is an adaptation for radio by Milton Geiger of Franz Werfel's\n\"Third Commandment.\" A modern parallel is drawn of the ancient Exodus from\nEgypt under a new Pharoah. The story is told of how the Jewish people are\nforced to leave Austria, under Nazi domination. It is a heart-warming story\nof the close bonds between a rabbi and a priest. Philip Merivale starred as\nnarrator. A cast of about twelve and full-scale production are required.\nThe script may be rebroadcast on member Mutual Broadcasting System network\nstations and local independent stations. Scripts can be secured free from\nthe Radio Department of the American Jewish Committee, 386 Fourth Avenue,\nNew York 16, New York. Recordings of this program are also available and\nare listed under \"Recordings.\"\n12. THE GOLDEN CALF - (Shewoth - Tabernacles) - Half-hour dramatization\nby Adele and Katharine Seymour presented on the National Broadcasting Company\nnetwork in observance of Shevuoth, which tells of the retribution that over¬\ntakes a German who bows before the false Gods of Hitler Germany. Jose Ferrer\nstarred as narrator. A cast of about nine and full-scale production are\nrequired. The script may be rebroadcast on member stations of the National\nBroadcasting Company network and local independent stations. This program,\nproduced by the American Jewish Committee, can be secured free of charge\nby writing to the Radio Department of the American Jewish Committee at 386"
}