{
  "id": "d1517-0",
  "text": "NAEB NEWS LETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL 8ROADCASTERS\nFrank Eu Schooley* Editor, Station WILL, Urbana* Sll,\nMay lf 1944\nSEE YOU IN COLUMBUS\nThe National Association or Educational Broadcasters will hold a meeting\nat \\2 noon* Sunday* May 7 in the Oeshler Wallick Hotel* Columbus* Ohio,\nThe meeting will be held in conjunction with the Fifteenth Institute for\nEducation by Rad«Oo Your secretary will be in town Thursday evening ano\nwill remain for the entire Institute* If you have any suggestions for the\nmeeting agenda* please advise so we can arrange to cover a multitude of\nPROBLEMS IN OUR TWO-HOUR SESSION,\nRADIO INSTITUTE OPENS MAY 5 IN COLUMBUS\n\"Padio-~Sworo and Ploughsharel\" is the theme chosen for the fifteenth\nannual Institute for Education by Radio* to be held May 5~8 in Columbus*\nUNDER THE SPONSORSHIP OF Oh 10 STATE UNIVERSITY,\nOr, i, Keith Tyler of Ohio State is director of the institute* established\nin 1930 by the University* 11 to provide an annual meeting for joint dis¬\ncussion BY 8R0ADCASTERS* EDUCATORS, AND CIVIC LEADERS OF THE PROBLEMS OF\nEDUCATIONAL BROADCAST ING,0\nA HIGH SPOT OF THE PROGRAM WILL BE THE ANNUAL DINNER THE EVENING OF May 7*\nwith Elmer Davis* director of the Office of War Information* as speaker.\nThe Columbus Boys1' Choir will give a musical program, and President Howaro\nLc Bevis of Ohio State will preside.,\nThe conference program includes general and special sessions* emphasizing\nthe role of radio in the war and in the peace; work-study groups; and\nROUND-TABLES,\nGeneral sessions include a symposium on “How Free is Radio?”, H* V,\nKaLTENBORN* NBC COMMENTATOR* PRESIDING* WITH REPRE3ENTAT IVES OF CANADIAN\nAND U0 S0 CHAINS, THE FEDERAL COMMUNICATIONS COMMISSION* AND OTHER AGENCIES\nPART ICI PAT ING; A SYMPOSIUM ON \"CqmBAT REPORT fiNGK* Ha B0 McCaRTY* UNIVERSITY\nof Wisconsin* presiding; a symposium on “Radio’s Role in Understanding”*\nVice President Harvey H0 OaVis of Ohio Stars presiding, with discussions\nof labor* race* ano international relations; and a closing summary session\non “Radio and Postwar Problems\" wi th Or* Tyler presiding.\nTwo special sessions are scheduled* one on \"Regional Station International\nBroadcasting”* the other on “Morale on the, Fighting Fronts.\" In the first\nOF THESE THE BRITISH BROADCASTING CORPORATION IN LONDON WI Li, ORIGINATE\nPROGRAM MATERIAL FOR WLWP CINCINNATI, The INSTITUTE AUDIENCE WILL HEAR\nTHE ENTIRE PROCEDURE* INCLUDING PRELIMINARY CUEING ON THE TRANSATLANTIC\nCHANNELS* THE PROGRAM MATERIAL FROM ClNCINATI AND THE MATERIAL FROM LONDON.,\nAS THE CLOSING PORTION OF THE \"MORALE” PROGRAM * INSTITUTE ATTENDANTS W8LL\nHEAR A SPECIAL BROADCAST OF “The CATHOLIC HOUR1’ „ THE DRAMATIZATION OF A"
}