{
  "id": "d1425-2",
  "text": "- 3 -\nIowa, which operates with 500 watte at night, and is 780 miles from Atlanta;\nStation KUSD, Vermillion, South Dakota, which operates with power of 500 watts\nat night, and is 920 miles distant from Atlanta; Station WILL, Urbana, Illinois\nwhich operates with power of £50 watts at night and is 490 miles distant from\nAtlanta; VMvlN, Fairmont, West Virginia, which operates with power of 250 watts\nat night and is 462 miles distant from Atlanta; and Station WJAR, Providence,\nRhode Island, which operates with power <£500 watts and is 897 miles from\nAtlanta. In each of these cases the recommended separation, in order to avoid\nobjectionable interference, undur the present operating conditions is 800 miles\nand the recommended separation under the conditions which will exist if the\napplication is granted, is 1,000 miles. Although there would be interference\nwith the stations named if this application is granted, that interference would\nbo no greater than that which now exists. Station KARK would not receive any\ngreater interference from WGST than it now receives from other stations.\nNight quota due the State of Georgia is 3.64 units and that assigned\nat the time of the hearing was 4.26 units. It is now assigned 4.46 units.\nThe night quota due the Third Zone is 36.00 units and that assigned at the\ntime of the hearing was 46.225 units. It is now assigned 46.70 units. The\ngranting of this application would increase the night quota .2 unit.\nUpon consideration of the application, the evidence adduced at the\nhearing, the Examiner's Report, and the entire record, the Commission was of\nthe opinion and so found, that public interest, convenience, and necessity\nwould be served by the grant of the application of Georgia School of Tech¬\nnology, licensee of Radio Station WGST, Atlanta, Georgia, for modification\nof license, and, accordingly, entered its order granting the said application,\nconditioned upon compliance with Rules 131 and 132 of the Commission's Regu¬\nlations, the said order to become effective at 3:00 A. M., Eastern Standard\nTime, March 3, 1936.\nAdopted March 10, 1936\nI hereby certify thn.f ti-|0\ncorrect copy c f tic f : ( •.:,...v\nthe forlorn* is a ML true and\nu’ ■ : s &r»d Grounds\n'■i ■ nestions Commission\nfor Decision of iL o\nHEkI\nIT L. PETTEY,\nBy—.\nSecretary."
}