{
  "id": "d1084-1",
  "text": "develop UHF broadcasting, jeopardize lull development of ETV service. However, if\nreduction of mileage separation does occur, education's interests must be observed\nin assignment of any drop-in's that might result.\nFCC has revised March 16 interpretation of sponsor identification rules which\nindicated the use of free records without identification on the air of the donors\nwas in violation of Communications Act. FCC will review whole question of sponsor\nidentification; meanwhile, stations need not announce source of free records on the\nair unless they are received in payment for plugs.\nChairman Ford, recently infomed in person of NAEB's progress in making good\nits promise to provide the Commission with a documented statement on the needs of\neducation for spectrum space, expressed his gratification at our undertaking the\ntask and reemphasized importance of such a document, a view he first enunciated at\nNAEB luncheon, Columbus. Earlier, Commissioner Robert Lee, who will spend k days\nwith us at San Francisco, wrote to commend NAEB for retaining Jansky & Bailey as\nour engineering firm to survey education's needs for spectrum space. \"I wish to\ncongratulate you for the forward step and the able assistance you have enlisted.\"\nNAEB has agreed to provide FCC with a preliminary allocations plan for education\nin January, a complete plan by June.\nSignificantly the lead of Chairman Ford's speech before Radio-TV Executives\nSociety, New York, Sept. 21 asserted: \"The Commission's primary duty in the broad¬\ncast field is to make available to all parts of the country a broadcasting system\nwhich can be utilized by private enterprise and educational interests to serve the\ntastes, needs, and desires of the public.\"\nFLASH\nOn Sept. 29 the FCC, in an important decision, responded to NAEB's petition\nto grant an exception in behalf of educational broadcasters regarding the use of\nmicrowave facilities for inter-city TV relays. Significance of this decision is\nthat now education can establish its own microwave facilities to link educational\nTV systems in widely separated communities, rather than resorting to common car¬\nriers. Ruling, which excepted noncommercial educational users only, should have\nprofound influence in development of state and regional ETV networks and closed\ncircuit systems. Previously the use of microwave facilities was limited to con¬\nnecting broadcasting stations only. Commission stipulated inter-city facilities\nwere to operate in 6575-6875 me. band; within a city or for other short hauls,\nfrequencies about 10,000 me. are to be used. Move was initiated by U. of Texas,\nwhich is planning an inter-city micro-relay system connecting Austin to San Antonio\nand other points.\nAlso on Sept. 29, FCC awarded second ETV allocation to Milwaukee, Channel 36.\nGrant was to the Milwaukee Vocational and Adult School, which also operates Chan¬\nnel 10. Additional facility provides for growing services to schools. Milwaukee\nis second city to have two ETV stations; Pittsburgh was first.\nU.S. OFFICE OF EDUCATION NEWS\nThe Advisory Committee on New Educational Media will meet in Washington Oct.\n25-26. New members expected to attend for the first time: Wm. E. Spaulding,\nPres., Houghton Mifflin Co.; Margaret Divizia, Dir., Audio-Visual Ed., L. A.\nPublic Schools; Frederick Hovde, Pres., Purdue University; Armand Hunter, Dir.,\nRadio-TV, Michigan State University."
}