{
  "id": "d1089-3",
  "text": "MAEB NEW LETTER\nPAGE 4\nAugust I, 1945\nSTATION WSUte BONNEY SUCCEEDED Mrs* PEARL PENNETT PRQXAM WHO LEFT TO BE\nDIRECTOR OF PUBLIC SERVICE AT RADIO STATION WMT IN CEDAR RaPIDSp\nBONNEY COMPLETED HIS UNDERGRADUATE WORK AT KANSAS Un1VERS ITY, LAWRENCE,\nKans«, and Kansas State Teachers College at Emporia, Kans*, majoring in\nDRAMATICS, ENGLISH, HISTORY AND SPEECH*\nHe taught two years in Kansas high schools and spent Ig weeks in study\nAND ACTING AT THE PRISCILLA BEACH THEATER IN PLYMOUTH, MaSSo, IN THE\nSUMMER OF 1943*\nAfter two and one-half years1 experience in educational raoio at Kansas\nState Teachers College, Bonney spent a year at the Emporia radio station\nKTS'W WHICH IS AFFILIATED WITH THE MUTUAL BROADCASTING SYSTEM,\nDuring the past year the new proqram oirector has served as an assistant\nIN RADIO AT WSUI WHILE WORKING 01^ AN AOVANCEO DEGREE IN THE DEPARTMENT OF\nSPEECH*\nFCC REVOKES WARTIME EQUIPMENT RELAXATION\nThe FCC HAS revoked its wartime relaxation policy which allowed BROAD¬\nCASTERS TO CONTINUE OPERATING EVEN THOUGH THEY WERE UNABLE TO LIVE UP TO\nthe pre-Pearl Harbor engineering standards because equipment and material\nwas not available* The FCC SUPPLEMENTAL statement OF POLICY, ISSUED\nJuly I 7, directs broaocasters to make application to the WPB for needed\nFACILITIES* In MANY CASES, THE FCC POINTED OUT, THIS WILL MEAN THAT\nBROAOCASTERS MUST ENTER PROJECTS CALLING FOR PRACTICALLY THE REBUILDING\nOF OLD EQUIPMENT, ANO IN SOME CASE8 FOR CHANGING OF TRANSMITTER SITES*\nThe FCC WILL direct each LICENSEE with wartime conditional clauses to\nAPPLY FOR THE NECESSARY IMPROVEMENTS WITHIN*. THE NEXT 30 DAYS* IN ITS\nSTATEMENT, THE FCC SAID INFORMATION HAD BEEN OBTAINED FROM THE WPB TO\nTHE EFFECT THAT NEEDED EQUIPMENT ANO MATERIAL IS OR WILL BE AVAILABLE IN\nTHE NEAR FUTURE EXCEPT IN CASES WHERE FREQUENCY MODULATORS OR MODUCATION\nMONITORS ARE REQUIRED, OR WHERE TWO STATIONS ARE OPERATING FROM A COMMON\nANTENNA OR JOINT STUDIO*\nTHIS AND THAT\nOrchids to Harry Skornia, University of Indiana, and American Broadcasting\nCompany for the fine radio listener institute held in Indianapolis July\n11-12* Jim Miles of WBAA adds his congratulations too****.Among others\nTO FILE APPEARANCES FOR THE JULY 30 HEARING ON PROPOSED FM RULES AND\nStandaros is WCHU* Ronnie Lowoermilk will be there for the U. S. Office\nof Education watching things for the rest of usp**** Have you studied\nTHE PROPOSED STANDARDS? I THINK YOU*LL FIND THEM INTERESTING.\nSurplus Property Committee meetings thus far have indicated the importance\nOF A WELL FUNCTIONING SURPLUS PROPERTY DISTRIBUTION SYSTEM ON A STATE¬\nWIDE BASIS* What is the STATUS of your state’s organization?*.*..\nMoRRIE NovSK OF WNYC TOLD THE New YORK STATE INSTITUTE OF COMMUNITY\nService that local radio stations can play an important part in the civic"
}