{
  "id": "d160-13",
  "text": "Agenda Item #10\nNAEB BC&RD OF DIRECTORS\nMeeting of April 29 , 1961\nColumbus, Ohio\nProposal for a Revised Network Fee Structure\nAttached is a proposal prepared by Len Press which is self-explanatory. However,\nit does not include a schedule of fees, nor an explanation therefore. This latter\ninformation is presented below.\nNetwork fees are currently due to be increased by 20% as of July 1, 1961. This\nwould make the new rates: Class A (5kw and over, AM; lOkw and over, FM) - $960;\nClass B (l-4kw, AM; 1-9.9kw, FM) - $600; Class C (Less than Ikw, both AM and FM)\n- $360* Mailing and handling charges would remain the same as they are now, i.e.\nClass A - $100, Class B - $50, and Class C - $25. Rate for In-Schcol programs\nwould remain at 25% of regular rate or $2 per program, whichever is loss, Limited\nService (In-School, plus one hour a week of regular programming - available only\nto stations owned and operated by schools or school systems) would be one-half\nthe full rate indicated above. The full service is currently approximately 10 hours\nof programming per week •\nIt is now proposed to substitute the following for the rate structure outlined above:\nThe 20% increase in rates would not be imposed. Instead, the number of hours of\nprogramming regularly offered would be reduced to five hours per wee:. Rates\nwould then be (as they have been this year): Class A - $800, Class E - $500,\nClass C - $300.\nIn addition to the five hours of programming offered for the basic rate, the Network\nwould continue to offer (in each quarterly offering) a few hours of programming\n(perhaps up to five additional hours per week, but not necessarily) w iich the stations\ncould buy at $1.00 per hour, or fraction thereof. These programs would be made\nup of the same kind included in the regular offering, i.e., programs provided by\nmember stations, by overseas broadcasting systems, resulting from crants-in-aid,\netc., — programs which do not cost the Network any money to procure.\nThe most important additional feature, however, would be the offering, as such\nprograms could be procured, of truly outstanding programming JgufifciSk the.Network\nwould have to pay a fee. For example, the Network has been offered programs,\nfor a fee, by the CBC - a special series of four, one-hour programs <£or a fee of\n$1000), and the CBC Wednesday Night drama (for a fee which would perhaps range\nfrom $650 to $850 per hour). And there are other such sources of programming.\nThese programs, when available, would be included in the quarterly offering, and\nthe cost thereof pro rated among the stations taking the program. Therefore, if\nthe programs first mentioned above were obtained from the CBC, and 50 stations"
}