{
  "id": "d160-14",
  "text": "-2-\nordered them, the cost would be $2 0 per station for the four hours of programming 0\nor $5 per hour. Naturally, the cost to each station would depend on the number\nof stations ordering, but the offering would be so devised as to indicate how many\nstations would have to order so that a certain price might be ohtainec . The\ndetails of this system can be readily worked out, and if. as would seme times be\nthe case* not enough stations ordered such a series, it would net be possible to\noffer the series due to the prohibitive cost.\nHowever, the important point is that such a system will provide a meins for stations\nto procure truly outstanding programs (perhaps in the place of some of the *‘routine®*\nprogramming offered over and above the basic five hours), whereas the present\nsystem of network fees does not so provide.\nIf the Network is to grow in strength and stature, we must not complacently accept\n4‘routine5* programming to the exclusion of all else. The proposed system would\nenable stations to make a wider choice than they now enjoy; the reduction in the\nnumber of hours offered in the basic system would require the Network Acceptance\nCommittee to be more selective than they now are when choosing the ba sic offering.\nTo simplify bookkeeping there would be no change in the present mailing and\nhandling charge, but it would include any and all tapes, from anyone of the three\ncategories, which a station might order.\nThe 3‘sliding scale” of rates would apply only to the basic rate; on ail additional\nprogramming, both “routine” and “special” all member stations, regardless of size\nwould pay the same amount.\nThe stations subscribing to the limited service (as described above) would continue\nto pay the rate they now pay. New Network stations (which are allowed to join\nthe Network at half-rate the first year, three-fourths the second year, and full fee\nstarting the third year) would still enjoy the same advantage so far as the base rate\nis concerned, but such a reduction would not be applicable to programs ordered\nover and above the basic five hours.\nIf they do not so order, the Network will not suffer financially because there will\nnot be the outlay for tapes, duplication, shipping, etc., and even though the\ntotal income will be lower, so will the resultant expenses,\nIt may appear that, since the same income will foe derived if stations average seven\nhours of programming a week, the stations are being penalized because (if the flat\n20% increase is adhered to) they could get ten hours of programming lor the same price.\nSuch is not the case for two reasons. In. the first place, most stations order an\naverage of only six or seven hours of programming a week now, from the available\nten hours. In the second place, many stations now order programs they are not sure\nthey intend to use, simply because they can get ten hours for the same price as five,\nor less. This results in Network expenses from duplication, tapes and shipping\nfor programs which are not then used by the ordering stations. The system outlined\nabove will cause the stations to be more selective in their program choices, thus\nreducing the wasteful practices now in effect."
}