{
  "id": "d160-15",
  "text": "-3-\nIn order that stations may have a chance to audition programs which are offered\nover and above the basic five hours, they will be given an opportunity to buy\naudition tapes for $1, with this $1 being applied to the cost of the series if\nit is ordered,\n4‘Specials’* which are now offered free to the Network from time to time will still\nbe made available on the same basisQ i.e0* free*\nIt is our belief that the proposed system will also result in a higher grade of pro¬\ngramming at the stations because station managers and program directors will be\nmore apt to listen to the programs they are getting from the Network. Under the\npresent system they are paying for ten hours whether they use it or net, or whether\nit is good programming or not. Under the proposed system they will .Insist that the\nfive hours of programming they receive in the basic offering be top-notch* and this\nwill cause the Network and the Network Acceptance Committee to be more discerning\nin their selections. In the second place, the managers and program directors\nwill pay more attention to those programs for which they must pay the additional\nfee* over and above the basic fee.\nIt should be pointed out that the budget (Agenda Item #12) for 1961-1962 is based\non the income to be expected if the flat 20% increase is instituted. This for two\nreasons - first it would be unwise to prepare a budget based on an income plan\nwhich is merely in the proposal stage; secondly* without experience it is difficult\nto estimate with much degree of accuracy what the income will be from the sale\nof programs over and above the basic five hours, and to estimate what the cost of\nprograms purchased under such a plan would be. However, it is safe to assume\nthat the Network will be as safe financially under the p. oposed system as under\nthe 20% increase because of the reduction in expenses which we know will occur with\nthe reduced number of hours automatically offered in the basic service.\nIt is our plan, if the above system is approved ., to work out details of an additional\nfinancial structure which would permit the sale of some sort of Network service\nto commercial stations and to NAEB Associate members for use on commercial stations.\nPrior to this Board meeting the above information and the attached were made\navailable to the Network Acceptance Committee* the Network Planning Committee\nand the NAEB Radio Board* through their respective diairmen. The two committees\nmet and considered this proposal carefully and passed their recommendations on\nto the Radio Board. The Radio Board then considered the matter and will present\noral recommendations at the time of the Board meeting,\nStaff Recommendation\nIt is recommended that the Board approve the new Network fee structure as outlined\nabove* with any minor modifications which might be necessary purely for\nadministrative purposes. It is further recommended that the Board approve* in\nprinciple* the matter of establishing a system whereby programs could be sold\nto commercial stations and to NAEB Associate members and authorize the staff to\nproceed with such establishment and implementation."
}