{
  "id": "d160-17",
  "text": "the happenings; in educational need$, ■wants, desires, a ctivities\nin the use of the media or possible uses of the media for\neducational purposes. It could cohtain reports of activities\non all fronts, present the pros and cons, present findings\nand opinions, present the editorial views, present the\nphilosophies and mundane facts. It could and should he of\ninterested to all interested persons in and outside the\nformal academic ranks.\nThis might he the monthly puhlication.\nThe QUARTERLY and the JOURNAL might well contain advertising\nif advertisers are found. The HEWS LETTER should never contain\nadvertising.\nIf a third publication is ’undertaken then certain other consideration\nshould he given to the total prchiefs:\na. The nature of each should he well defined.\nh. The contents or each should he pre-determined, and then the\npolicies governing contents should he strictly adhered to.\nc. The formats should he predetermined and strictly adhered to\nin the exploratory-experimental *x era.\nd. The probability of financial success should he made and\nestimated before jumpting. The history of such publications\nshould he studied. The good or harm to NAEB should he\nconsidered. The availability of advertising from advertisers\nshould he considered. There are many publications in the field\nwhich have difficulty.\ne. The Committee feels that an experimental issue of this third\npuhlication would he a reasonable undertaking, and some memhess\nof the Committee would really urge the step.\nf. Some members of the committee are apprehensive about the\nlomg range financial stabilityof the expanded puhlication\nconsideration. I believe none are stricttly opposed, although\nmost members recognize the existeance of the vacuum.\nA footnote on the HEWS LETTER. It should he more like the NAB\nMember Service and HAB Highlights published for the fjfeEOCX\ngoing-information of members. It needs more government information\non a day-to-day, week-to-week basis."
}