{
  "id": "d160-18",
  "text": "STATUS REPORT - INTERNATIONAL ACTIVITIES - 4/21/61\nNew Projects\n1* Both OCm & OEEC are being contacted with a view to their\nfinancing the translation and lip sync dubbing of certain\nprogram series which could be helpful on an international bails#\n2. So far unapproached African Countries are being contacted* at\ntop levels* A1thought we have been in touch with certain\nrepresentatives of the Africa Radio Union (Morocco, Tunisia,\nUAR?, Ghana, Guinea & Libya) Countries, little concentration\nhas been placed on the Northern African countries. Recently\nwe have learned of their extreme Interest in TV and have been\nin touch with some of their key government officials, although\nthey were not in the Education/Communicat ibns Field. They\nhave asked to put us in touch with the appropriate officials as\nsoon as possible, since they say there is a desire for prompt\naction. Morocco is most interested, with Tunisia and Libya.\n- ■ says they h^re the funds to pay for services\n3.\nThe Cameroons are anxious to have TV and fere not Involved vd th\nany other European Broadcasting Systems. It is my understanding\nthis is also true for Dahomey, as well as Sierra Leone. Vince\nChecchi will looks into this on his trip to Ghana and Nigeria*\nA memo,with recent information from those countries, will be\nforwarded soon. (Louis Pinto, Ambassador from Dahomey).\n4. Nigeria had been thought to already have a semi-commercial\nTV and Radio of their own alongside the federal regional service\nof Nigerian Broadcasting Company, which is non-commercial.\nBut recently understand that they want to do more and surpass\nLagos and Ibadan. Nearly 20 Nigerians have made application\nto the American Consulate and Attorney General% Office for\npermission to study here in contemplation of expanding their\nradio and TV facilities.\n(At the African Resources Institute in New York, March 27,28, I\ntalked with «Faja Wachuku (Chairman, Nigerian Delegation to UN)\nwho, along with F/jy Ellah, Nigeria Consulate General assured\nme that their first interest was in education and that they\nwould be more than pleased to consider NAEB*s help in educa¬\ntional programming. This will be followed up here and In\nNigeria. (Tape letter with copy for Harold of Materials\nrequest sent 4/18.) )\n5. A #2.3 million training center for Telecommunications will\nbe built in Malaya so that 250 trainees (on a regional basis)\ncan be taught the latest in Telecommunications techniques.\nThrough Francis Colt De Wolf,it is thought possible that\nNAEB might have a part in the Radio/Tv aspects of training."
}