{
  "id": "d160-19",
  "text": "INTERNATIONAL ACTIVITIES 4/21/61\nMost of the recent concentration has been on the African\ncountries. However, in the last few weeks the Middle East\nhas come in for much attention along the communications front*\nABPT and others have invested in a minor financial way in\nLebanon and Jordan. Already there are many concerns about\nthe commercial aspects. I am told that a reputable organization\nwith ability and comera in the educational area could be meet\nhelpful. (Lebanon currently has two TV stations.)\nA letter from a Mr. Harry Zinder to Ralph Steetle detfed\n1/25/61 spoke of a survey team from the United Nations to\nassess the possibilities of educational TV there. The two-\nman team was to be TKTjk there from 4-6 weeks beginning\nin May. Already there is much fear that this will be too\nlightly a look into what could be one of the most effective\nways Israel could have of educating her heterogenous population.\n(Two prominent Israelis have offered help and introductions\nto the Cabinet people involved. They were not directly\ninvolved but were in the Pan±l&ment# or EX key officials.)\nThey say the Government is absolutely dedicated to a\npositive plan of education by TV. As soon as possible*\nIt is also understood recently that Cyprus, which has had\nTV since 1957, is contemplating expansion in this vein -\nas part of its all-over development program.\nCairo has the big TV station in the Middle East, as yoiiknow.\n(There are currently three under construction at Alexandria,\nMansura & Assuan,) Also they are linked with Syria. The\nUAR k SYRIA have just been granted a loan of #1.3 million\nfrom the Development Loan Fund for telecommunications Improvement-\nThe procurement of equipment and SERVICES will be from the U/s/\nGreece wants to have a Government system in conjunction with\na receiver plant. So, we understand, does Turkey. Both\ncountries will be contacted by me on this trip.\nSouth America has been relatively ignored with the exception\nof Honduras (and a couple of others who have written us\nspecifically) because of the tendency of the new stations\nthere to eagerly become associated with commercial endeavors.\nABPT has been particularly been active there, as have others. *\nEcuador, Venezuela and Argentina have particularly participated.\nHowever, other countries like Bolivia - less develoued - are\nconcerned about education. Even Argentina (which already has\nsix stations in operation) has educational aspirations for the\nother 26 (twenty-six) channels soon to be allocated to the\nprovincial cities.\nMost importantly, under the auspices of the OAS, an estimated\n#232 million Inter-American Telecommunications Network is\ncontemplated....which will include broadcasting and TV."
}