{
  "id": "d160-20",
  "text": "• 3\nINTERNATIONAL ACTIVITIES 4/21/61\n8. Television and the formation of an Eastern Caribbean public\nservice network is to be established in the West Indies,\npending approved attention to educational need* Kadio stations\nwill be started in Antigua, Barbados, Jamacia, St. Lucia, St*\nVincent and Trinidad under federal control with particular\nrespect to be placed on public need* (Last September wepad\nunderstood that some, especially St. Lucia, would be semi-\ncommercial and not particularly interested in education. Due\nto certain \"back-firing” in surrounding communities , the reverse\nseems to be true.)\n9. On the national front, we are checking into the possibility\nof a paid series describing the activities of the Stock Exchange.\nContinuing Projects\n10. Contacts and ideas proceed along the Nutrition Information\nProgram referred to in earlier memos.\n§5y^n^regard to AMA, Dick Rhineheur (sp?) called me from Chicago\ntwo of three days before I left. He seemed to be under the\nimpression that we were to present a written ‘proposal for\na radio and/or TV series. It was my impression we were to\nmeet and discuss the possibility with just a rough proposal.\nHarold Hill was going to Chieago on other business and agreed\nto track this down. If such should be the case, perhaps Len\nPress could rough out a series before he leaves. (Dick Informs\nme AMA is quite unjtappy with MEDICAL MILESTONES. The Center\nhas farmed it out and the first three scripts have been\nrejected.) He says they have plenty of money for such\ninformational programs. We should follow up on this quickly.\n12. Training & ©rogramming project plan being drawn up by\nmembers of International Relations Committee. Hopefully,\nthis can be polished in Columbus for written proposal to present\nto various agencies. (ICA, USIA, STATE, AG, SBA, Commerce, etc.)\nCommittee must determine actual costs, then cwer-ride can he\nestablished.\n13. Recruitment has not been pushed since local ability to\nhandle currently already strained. More time must be\ndevoted to this along with a greater awareness of the\nimportance of two year contract agreements.\n14. Comprehensive research and development program must be\nconsistently encouraged and pushed, as well as our particular\ncapabilities, until contract or contracts are let."
}