{
  "id": "d160-44",
  "text": "EXECUTIVE STAFF MEETING\nOctober 19, 19 64\nStaff Present: HER, VB, JA, JS, JAF, RB, CL\nHill put the following question to the staff: *‘Should the full board debate the matter\nof groups of individuals who want to align themselves with divisions other than_the_\nIndividual Member Division ?*’\nThis question immediately evoked a discussion of the Music Director s petition to\n$lign with the Radio Division.\nThe staff felt the answer to this question was spelled out in the Constitution, i.e.,\nall such groups should be aligned with the Individual Member Division, the\npresident has the authority to make this decision and it is not, therefore, a matter\nfor board discussion.\nThe staff recommended that the President notify the NER Board that it is not in a\nposition to accept this group into NER membership. If the NER Board wishes to bring\nthis matter to the attention of the full board, it may do so.\nSandler felt that the proper place for this matter to be discussed was before the full\nboard. He did not feel this matter should be decided by presidential ruling.\nHill asked for staff’s opinion on the following question: “Should those institutions\nwishing to be members of NAEB who have not joined a division (at least partially for,\nmonetary reasons) be provided: (1) some kind of specialized membership with NAEB,\nor. (2) should the divisions establish some sort of special category for them within_,\nthe divisions ? “\nHill pointed out that due to loss of members who could not afford division dues, NAEB\nhad suffered approximately an $8,000 loss of revenue. Hill also pointed out that if\nNAEB does not provide a home for these people, someone else will.\nSandler and Appy pointed out that if NAEB provided a special institutional membership\nfor prospective division members, the divisions would suffer and they felt the whole\npurpose of the reorganization would be defeated.\nAll agreed that in time homes for these people would have to be found, probably within\nthe divisions, but they did not recommend setting up such categories of membership\nat this time.\nAppy felt that in time, the divisions, if given a chance, would increase their member¬\nship and NAEB would recoup this initial loss of revenue and that he was, therefore,\nagainst giving borderline cases an “out” at this time."
}