{
  "id": "d1100-0",
  "text": "NATIONAL\nASSOCIATION OF EDUCATIONAL\nBROADCASTERS\n1346 Connecticut Avenue, N.W.\nWashington 6, D. C.\nPhone North 7-6000\nVol. II No. 10\nOctober 1963\nTHE FORD BOMB - Fission and Fall Out\nThe recent announcement by the Ford Foundation of $6 million grant to the Center\nto “strengthen programs on non-commercial television stations\" (and simultaneously\nwithdraw from other types of support for radio and television) has had immediate\nand wide-spread repercussions in the educational broadcasting field. The initial \\\nconsequences were to split off various elements of the Center’s operation# leaving\na nucleus of activity centered around the provision of five hours of high quality\nETV programs per week. Sloughed off were: radio# instructional TV# Washington\nrepresentation# and general welfare activities in behalf of the TV stations.\nImmediate fall-out effects were the separation of BFA from the Center# the termination\nof support for ERN# and phasing out of the National Instructional TV Library.\nSecondary consequences were the immediate consideration by people in the field\nof what the impact of these altered circumstances would be# what new structures or\norganizational patterns should be developed to fill the gaps; there was even some\ngalvanic action.\nINSTRUCTIONAL TV\nAnticipating the premature discontinuance of the Center’s contract for the National\nInstructional TV Library# a series of regional meetings were held across the country\nto consider what the appropriate criteria should be for selecting a new location and\nauspices for the national service. Results of these conferences will be presented\nto the Advisory Committee for the Educational Media Branch of USOE (October 16-18).\nOn the basis of this advice# the Branch will issue “specifications\" and interested\nparties will be invited to make proposals.\nRADIO\nRepresentatives of NAEB# BFA# and ERN met in Washington to consider what might\nbe done about continuing some sort of “live\" interconnection activity for radio.\nThe upshot was the development of an expanded concept of adding radio into a\nbundle of communication services for higher education which could be provided\nby electronic interconnection. Besides radio broadcasting# such a system linking\ninstitutions of higher education would facilitate sharing of human and material\nresources# cooperative research# conduct of conferences# cooperative use of\ncomputers# and the rapid collection# retrieval# and exchange of information."
}