{
  "id": "d1100-2",
  "text": "-3-\nstockpile of tapes and office equipment. Suggested budget: $53,3 06. On the\nbasis of 40 stations, annual cost per station would be $1,335 and cost per hour\n(on basis of 80 hours of programs per year) would be $16.70.\nThe Affiliates Committee recommended that a separate organization be established\nin Washington to represent ETV stations, indicating that on the basis of individual\nexperience of members of the Committee, that the NAEB structure. Board organization,\nand general lack of effectiveness precluded the likelihood of the NAEB proposal\nbeing successful.\nA good deal of discussion ensued pro and con NAEB and the NAEB proposal. Before\nlong it was clear that there was general consensus on objectives and the\ndifferences were only on methodology. After a straw vote, it was agreed that a list\nof points be worked out with the NAEB relative to organizing the TV stations within\nthe proposed new structure of the Association. A report of these discussions is to\nbe presented to the TV Station managers at Milwaukee.\nIn my judgment, the New York discussions were most beneficial. There was a good\ndeal of useful catharsis, a reaffirmation of confidence in NAEB as the appropriate\nagency within which to organize; and the conference ended with a general feeling\nof closing ranks and going forward together in building a strong new enterprise for\nETV stations within a strengthened Association.\nSTATUS OF NDEA EXTENSION\nOctober 8 the Senate by an 80-4 vote passed HR49 55, which provides for a three-\nyear extension of the National Defense Education Act, plus other provisions for\nFederally impacted areas and vocational education. Importance of NDEA to\neducational communications people is that its Title VII provides funds for research\nand dissemination projects in educational media. During its first five years, the\nEducational Media Branch has expended over $2 0 million in underwriting research\non new teaching tools, especially TV. NAEB has received contracts totalling\napproximately a quarter of a million dollars for projects of national scope and\nmany of its member institutions have been able to undertake valuable research\nprojects with such USOE grants.\nSince the House version provided only for expansion of the vocational education\nprogram, the measure must now go to conference; however, unless the House\nunanimously agrees to this procedure, it will be necessary for the House Rules\nCommittee to determine whether to send it to conference. Because Chairman\nHoward Smith (D, Va.) is known to oppose some of the expansion now contained in\nHR4955, this may be difficult. The members of the House Rules Committee are\nlisted below. If you are in the home state of a member, you may wish to check\nwith him to see if he is fully aware of the importance of this legislation to your\nschools and colleges. If you are not located in a home state of a member, you\nmay wish to suggest that your Congressman contact members of the Rules Committee."
}