{
  "id": "d1695-0",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL 8R0A0CASTERS\nFrank E. Schooley, Eos tor* Station WILL, Urbana, III*\nJanuary I, 1944\nUNIVERSITY OF KANSAS ROUNDTABLE\nThe University of Kansas Roundtable broadcasts, heard at 9:30 p.m, each\nFriday over KFKU, are planned by a committee of seven University faculty\nMEMBERS, APPOINTED BY CHANCELLOR DEANE W, MaLOTT. UNDER THE CHAIRMANSHIP\nof Paul Bo Lawson, dean of the College of Liberal Arts and Sciences, the\nCOMMITTEE MEETS ONCE A MONTH TO DECIDE ON TOPICS WHICH SEEM TO BE OF THE\nGREATEST CURRENT INTEREST AND TO NAME THE PARTICIPANTS FOR EACH PROGRAM.\n\"Roundtable programs are primarily for the discussion of questions of\nECONOMICS, GOVERNMENT, AND WAR PROBLEMS WHICH ARE BEFORE THE PEOPLE OF\nTHE WORLD,\" OgAN LaWSON SAID. \"If* COMING MONTHS WE PLAN TO CONSIDER SUCH\nTOPICS AS CONVERSION TO PEACE-TIME STATUS, POST-WAR EDUCATION, ANO OUR\nRELATIONS WITH OTHER PARTS OF THE WORLD.\"\nThe University of Kansas Rounotasle began in 1938 as an “open forum oiscus\nSION ON CURRENT TOPICS OF INTEREST.\" AFTER FIVE YEARS ON THE AIR, THE\nRQUNOTABLE CONTINUES IN ITS ROLE OF INTERPRETER or CURRENTLY IMPORTANT\nNATIONAL ANO INTERNATIONAL ISSUES OF A SOCIAL, POLITICAL, AND ECONOMIC\nNATURE.\nThe Roundtable broadcasts this year are produceo entirely without a script\nBUT EACH GROUP OF PARTICIPANTS SPENDS FROM € 1 GMT TO TON HOURS IN PREPARING\nTHEIR PROGRAM. At INFORMAL PRELIMINARY MEETINGS, THE SPEAKERS DISCUSS AND\nEXCHANGE DATA ON THEIR TOPIC. THEY DRAW UP AN OUTLINE, DRAFTING THE PRE¬\nSENTATION OF EACH PARTICIPANT. AFTER THEY CHECK THE OUTLINE, ADDING\nPERSONAL NOTES, FACTS, FIGURES, AND QUOTATIONS WHICH THEY WISH TO USE, A\nREHEARSAL RECORDING OF THE BROADCAST IS MADE. The REHEARSAL SERVES TO PUT\nTHE SPEAKERS AT EASE ANO MAKES POSSIBLE MANY IMPROVEMENTS IN THE ACTUAL\nBROADCAST.\nParticipants of the Roundtable discussions are University faculty members,\nLOCAL BUSINESS AND PROFESSIONAL MEN, AND AN OCCASIONAL OUT-OF-TOWN GUEST.\nKENTUCKY PRESENTS \"YOUR HEALTH LN WARTIME\"\nPrecautions to avoi6 influenza, colds, pneumonia and other diseases,\nEPIOEMIC AT THIS TIME, WILL BE CONTAINED IN A SERIES OF WEEKLY RADIO TALKS\nON THE SUBJECT, \"YOUR HEALTH IN WaRTIME,\" THE FIRST OF WHICH IS SCHEDULED\nFOR PRESENTATION OVER WHAS, L0U38VILLE, SATURDAY, JANUARY 15, AT IH5 P.M.\nThe PROGRAMS WILL BE PRESENTATIONS OF THE UNIVERSITY OF KENTUCKY IN\nLexington, and the speaker will be Dr. Charles G. Baker, of the Lexington-\nFayette county health department, who prepared the Peabody-awaro-winning\nRADIO TALKS ON VENEREAL DISEASES LAST YEAR.\nNEW YORK HOSPITALS \\H W NYC SERIES\nThe inside story of New York hospitals will be presented in a new series\nOF RADIO PROGRAMS TITLED \"EVERY 40 SECONDS,\" TO BE PRODUCED OVER New York"
}