{
  "id": "d1695-3",
  "text": "NAEB NEWS LETTER\nPage 4\nJanuary !* 1944\nFRIENDLY WOMAN OVERHEARD TELL I NO HER MORE COMELY FRIEND* nWELLs MAYBE HE S\nNOT YOUR BOY FR 3 END * BUT NOBODY 1S TAKING ME TO SEE \"OKLAHOMA TONIGHT*\n\"Sidelights; Mac McCarty handles the MC job masterfully; the Chicago sub¬\nway looks mighty insecure; Wally Kay negotiated for Lonoon Column and\nANOTHBR BBC NEWS SHOW* TO BE PRESENTED IN TRANSCRIPTION OVER OUR STATION;\nTHE PORTABLE WIRE RECORDING OUTFIT* DEMONSTRATED BY MAJOR KENT, SHOULD\nBE A GREAT HELP TO STATIONS WHEN MADE AVAILABLE AFTER THE FOR CIVILIAN\nuse . You can even erase voice on the thing*1\n\"Conclusion; It8s good to be back home in the country, ano WHA is still\nTHE NATIONS. OUTSTANDING EDUCATIONAL RADIO ST AT ION l \"\nWHA 8 S ANNUAL REPORT WAS ON THE LAST NAE8 PACKET. HOPE YOU DION8T OVERLOOK\nIT. Dio YOU* OR CAN YOU* DO AS WELL*\nMORRIS NOVIK* WNYC, MADE THE PA (Ap) NEWS CIRCUIT LATELY WITH THE YARN\nregarding: \"a Student marine private* Joseph Torraca who decideo that\nhis showing of New York to a couple of buddies would not be complete\nWITHOUT A VISIT/TO THE C|tY HaLL AND A CHAT WITH MAYOR LaGuaRDIA.\nSo, Torraca took his fellow marines—Joseph Flounders of Philadelphia\nand William Wallace of Elmhurst, Illinois—down to City Hall*\nPrivate Torraca approached the attendant in charge of information.\n\"I TOLD MY PALS I 8D INTRODUCE THEM TO THE MAYOR,\" WHISPERED TqRRACAo\n\"Help me out, will yum?\"\nThe three marines were invited into Mayor LaGuaroia\"s office* listened to\nHIS WEEKLY BROADCAST AND THEN WERE INTRODUCTED TO THE MAYOR BY NOVIK.\nThe marines chatted with the Mayor for several minutes and then went on\nTHEIR WAY* THEIR SIGHTSEEING TOUR OF NEW YORK COMPLETE.\nCOMM ISSI ONER STUPEBAKER URGES USE OF F^M\nIn a LETTER ACKNOWLEDGING RECEIPT OF NAEB RESOLUTION ON RESERVATION OF\nFACILITIES FOR EDUCATIONAL USE IN THE POST-WAR PERIOD* COMMISSIONER JOHN\nW, Studebaker writes: \"I trust that we can count on the National assoc¬\niation of Educational Broadcasters to encourage wider use of F-M not only\nBY MEMBERS OF THE ASSOCIATION, BUT BY OTHER INSTITUTIONS OF LEARNING.\nFCC ACTIONS\nWRUF, Unive&sity of Florida, applied for extension of special service\nAUTHORIZATION TO OPERATE UNLIMITED TIME FOR THE PERIOD OF FEBRUARY 1, 94\nto November I, 1946. (Dec. 27)\nWLB. University of Minnesota, was granted request to waive FCC rules, so\nas to permit identification of Station WLB as Minneapolis and St. Paul.\n(Oec. 28)\nWSCH, Ohio State University, was granted license to cover construction\npermit for new relay broadcast station to be used with W0SUo (Dec. 30/"
}