{
  "id": "d1806-0",
  "text": "■\nN\nA\nE\nE\nw\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. XXIII NO. 11 URBANA, ILLINOIS NOVEMBER, 1958\nHARLEY ELECTED NAEB PRESIDENT\nWilliam Harley, program director of WHA-AM-\nFM-TV, University of Wisconsin, was elected NAEB\npresident at the recent convention in Omaha. Har¬\nley, who has served as NAEB secretary and is cur¬\nrently director for Region III, will take office Jan¬\nuary 1, 1959 and serve for one year.\nNAEB By-Laws changes approved by mail prior\nto the convention (see story on Constitutional and\nBy-Laws amendments elsewhere in this Newsletter)\nprovide for three vice-presidents beginning in 1959.\nThose elected as vice-presidents were: 1st vice-pres¬\nident, Jack McBride, manager, KUON-TV, Univer¬\nsity of Nebraska; 2nd vice-president, Robert Schenk-\nkan, director of radio-TV, University of Texas; 3rd\nvice-president, Graydon Ausmus, director of Radio-\nTV, University of Alabama. McBride is currently\nvice-president and has served previously as secretary.\nSchenkkan is now director of Region V. Ausmus ser¬\nved' three years as Regional director, two as vice-\npresident and was president of the Association in\n1952 and 1953.\nRobert Coleman, Michigan State University, was\nre-elected treasurer and Keith Engar, manager of\nKUED, University of Utah, was elected secretary.\nDirectors for Regions II, IV, and VI, and the Direc-\ntor-at-Large normally elected in even-numbered years,\nand directors for Regions III and V, to fill the unex¬\npired terms of Harley and Schenkkan, are being elec¬\nted by mail as provided in the By-Laws (see separate\nstory below in this Newsletter).\nNOMINATIONS FOR NAEB\nBOARD ANNOUNCED\nNominations for the NAEB Board of Directors\nwere announced at the recent NAEB Convention.\nThe Director-at-Large and Regional Directors to rep¬\nresent Regions II, IV, and VI are to be elected this\nyear and will serve two-year terms, beginning Jan¬\nuary 1, 1959.\nAll voting members (Actives and Associates) in\nRegions II, IV and VI were invited to submit nom¬\ninations for Director for their respective regions, and\nall Individual Members were invited to submit nom¬\ninations for the Director-at-Large, who must be an\nIndividual Member. The names of nominees are\nlisted below and ballots will be mailed on November\n12, 1958, to all those who are entitled to vote.\nDirector, Region II\nLee Franks, Program Director, WUFT, University,\nof Florida, Gainesville\nRaymond Hurlbert, General Manager, Alabama ETV\nCommission, Birmingham\nKeith Nighbert, Program Director, WKNO, Memphis\nDirector, Region IV\nMartin Busch, KUSD, University of South Dakota,\nVermillion\nJohn Schwarzwalaer, Manager, KTCA, Minneapolis-\nSt. Paul\nRev. R. C. Williams, Director, Communications Arts,\nCreighton University, Omaha\n(Note: Edward Slack, KUSD, withdrew as a nom¬\ninee.)\nDirector, Region VI\nKenneth Harwood, Chmn., Dept, of Telecommunica¬\ntions (KUSC), University of Southern California,\nLos Angeles\nRoger Houglum, Manager, KRVM, Eugene, Oregon\nPublic Schools\nGlen Starlin, Director of Radio (KWAX), Univer¬\nsity of Oregon, Eugene\nHarold Winkler, President, Pacifica Foundation\n(KPFA), Berkeley\n(Note: Loren Stone, KCTS, and Edwin Adams, Uni¬\nversity of Washington, withdrew as nominees.)\nDirector-at-Large\nMrs. Gertrude Broderick, U. S. Office of Education,\nWashington\nRaymond Cheydleur, Manatee Junior College, Bra¬\ndenton, Florida\nMrs. Dorothy Klock, WNYE, New York City Board\nof Education\nHarry Lamb, WTDS, Toledo, Ohio Public Schools\nEdward Stasheff, University of Michigan, Ann Arbor\n1"
}