{
  "id": "d1806-3",
  "text": "One of the most pleasant surprises I had at the\nConvention was the trouble a great many of you took\nto express your enthusiasm for what I have recently\nbeen trying to do in this column. Apparently more\nof you than I had hoped, like, rather than resent,\nhaving challenges thrown at you, and at what some¬\ntimes becomes a sort of collective smugness on the\npart of all of us. Since “you’ve asked for it,” at least\nin the persons of many people who have spoken and\nwritten to me, I shall continue in this vein whenever\npossible.\nThe next Newsletter will contain the first part\nof a two-part effort to try to get at the development\nof a kind of philosophy which I think should begin\nto evolve as we become a national movement with a\nsignificant following and role. It will be presented\nin two parts solely for reasons of space, since we do\nnot feel justified in expanding the size of the News¬\nletter simply to enable the Executive Director to\nramble. I will be most grateful, therefore, if you\nwould let me know what you think of this more sus¬\ntained effort, as it will appear in the December and\nJanuary issues.\nOnce again, our thanks for your many ideas and\nsuggestions, and for the support you all are giving\nyour association and its staff. We shall continue to\ntry to deserve this support.\nNETWORK NEWS\n—Bob Underwood\nThe network staff wishes to thank all those who\nhad a good word for the service at the convention.\nIt is encouraging to receive recognition for a job\nwell done, and believe me, your network production\nstaff—engineer, tape duplicating operators—deserve\na pat on the back.\nThe next network offering, that for the first quar¬\nter of next year, was late in getting out due to some\nminor procedural difficulties. However, it is out\nnow, and your order is expected. It looks like a pretty\ngood selection from which to choose.\nIncidentally, we still can stand some submissions\nin the quarter-hour area. Surely you have a good\nfifteen minute series going which could be submitted\nto the network. Why don’t you send it in today?\nAnd, how about some half-hour series, too?\nAlso, between issues of the Newsletter I have had\nto put out a memo about the lack of tapes coming\nin to this office. We start on in-school production\nin a couple of weeks, and this tape load, when added\nto our normal weekly tape requirements, could cause\na shutdown here unless we have more tapes. Your\ncooperation is needed now!\nWe hope all network members were able to sched¬\nule the special two-hour United Nations Day pro¬\ngram the network was able to distribute. It was a\nfine program, and our thanks to UN Radio for mak¬\ning it available to us.\nThe addition of this special UN Day program\nto our list of specials for this year makes a very im¬\npressive list. To date we have distributed twenty-\nnine specials this year, some of which have included\nfive or six programs. We feel this is a needed service,\nand from the response we have received, it appears\nthat member stations like this type of service. We’ll\ndo our best to keep locating and distributing special\nprograms.\nBest regards to all from the network staff.\nAPPLICATIONS NOW ACCEPTED\nUNDER HILL-ELLIOTT BILL\nThe Office of Education announced that it is\nnow prepared to consider applications for Federal\nfunds to support research projects in educational tele¬\nvision, radio, motion pictures, and related communica¬\ntion media.\nThe National Defense Education Act authorizes\n$3 million for the first year, and $5 million for each\nof the three succeeding years to support research in\nthese areas. An initial appropriation of $500,000 was\nmade to get the program under way.\nDr. Roy M. Hall, Assistant Commissioner for\nResearch, reported that procedures for fund applica¬\ntions are now being prepared. During the time re¬\nquired for their completion, applications for research\ngrants or contracts may be made by letter or on the\nform now utilized by the Cooperative Research Pro¬\ngram.\nInquiries concerning the new research program\nshould be directed to the Director, Communications\nMedia Research Program, Office of Education, De¬\npartment of Health, Education, and Welfare, Wash¬\nington 25, D. C.\nDr. Hall announced that the Office of Education\ninvited a number of interested organizations to send\nrepresentatives to a meeting in Washington October\n20 and 21 for the purpose of designing a broad frame¬\nwork for research in this educational area.\nIS YOUR DIRECTORY LISTING\nUP TO DATE?\nHeadquarters will publish a new Directory of\nMembers shortly after the first of the year. If\nany changes have occurred which should be re¬\nflected in this new edition, please let us know im¬\nmediately. The Directory is designed to provide\nhelpful and up-to-date information, but can do\nso only if you will keep us informed of changes.\nPlease check the current Directory to see if your\nlisting is accurate, and if not, advise us right away.\n4\nNEWSLETTER"
}