{
  "id": "d1184-0",
  "text": "NEWS N A61BC£mR\nN AKONALASSOCIAKON - EDUCATIONAL BROADCASTERS\nFrank E. Schooley, Editor, Station WILL, Urban J,°flfmois J* *941\nON THE DEFENSE FRONT IN IOWA\n(Editor’s Note: This is the second and third in the series or\nARTICLES ON DEFENSE AND THE EDUCATIONAL RADIO STATIONS.)\nEducational stations, WSUI, State University of Iowa, and WOl ,\nIowa State Collece are on the front for National Defense. Their\nprograms reflect the spirit of the times, the PROCRESS IVE LEADER¬\nSHIP DISPLAYED BY EDUCATION’S OWN RADIO STATIONS*\nNATIONAL DEFENSE ON WSUI:\nThese programs, according to Director Carl Menzer, are all re¬\nlated in some manner to National Defense:\nAiviER I CAN8 S DEFENSE FRONT - CAPTAIN E. 0. Culver AND OTHER MEMBERS\nOF THE DEPARTMENT OF MILITARY SCIENCE AND TACTICS GIVE THE ANSWER\neach Tuesday over WSUI. The program, supervised by Colonel Ho H«,\nSlaughter, department head, reports state and national news, per¬\nsonal items of Iowa men in service as well as news from army camps\nAND POSTS, RECRUITING CENTERS, AND DIVISION HEADQUARTERS*\nAMERICA GOES FLYING - In ORDER TO KEEP ABREAST OF THE INDUSTRY’S\nEXPANSION AND NEW DEFENSE DEVELOPMENTS, WSUI BRINGS ‘’AMERICA GOES\nFlying” each Tuesday evening* Conducting the program is Robert\nSmylie, who has just graduated from the Civil Pilot training ad¬\nvanced AND CROSS COUNTRY COURSES UNDER THE JURISDICTION OF THE ARMY\nand Navy Air Corp*\nAiviER I Can LEGION - It’s thehAmerican Legion” show aired the fourth\nThursday of each month by representatives from various American\nLegion posts throughout the first Iowa Legion district*\nAMERICAN LEGION AUXILIARY - The ’’Star OF SERVICE” IS THE BASIS FOR\na series of programs by the \"American Legion Auxiliary”* The five\nPOINTS OF THE STAR INCLUDE: REHABILITATION, AMERICANISM, CHILD WEL\nFARE, EDUCATION, AND COMMUNITY SERVICE*\nTHE AMERICAN HERITAGE - In these days when the American tradition\nIS under fire from the four cobners of the earth, IT IS OBVIOUSLY\nAPPROPRIATE FOR A STATE UNIVERSITY TO REMIND THE PUBLIC OF THE\nPOSITIVE RELIGIOUS, POLITICAL, AND CULTURAL VALUES OF THE UNITED\nStates* Therefore, WSUI has scheduled each Tuesday a vital program"
}