{
  "id": "d1184-1",
  "text": "(2)\n“The American Heritage,” sponsored by the school or letters and con¬\nducted by Or. Charles Howell Foster of the department of English*\nCURRENT COMMENT - Defense and Iowa's part in the program are given a\nPROMINENT PLACE IN PROFESSOR C. WOODY THOMPSON'S ’’CURRENT COMMENT” OVER\nWSUI each Wednesday*\nEDUCATION SPEAKS - ’’EDUCATION SPEAKS” —AND ITS VITAL VOICE IS HEARD BY\nWSUl LISTENERS* THIS PROGRAM, SPONSORED BY THE I OWA STATE TEACHERS\nASSOC l'AT I ON, IS A SYMPOSIUM OF NEW IDEAS AND METHODS FROM THE LEADING\nEDUCATORS IN THE COUNTRY, AND IT PRESENTS POSSIBLE CHANGES AND THE AD¬\nVANTAGES AND DISADVANTAGES OF OUR MODERN EDUCATIONAL SYSTEM*\nFOURTH ESTATE - When THE NEWSBOY BRINGS YOUR MORNING OR EVENING PAPER,\nYOU SCAN THE HEADLINES AND ARTICLES, HURRI EDLY—BUT HAVE YOU EVER\nSTOPPED TO THINK WHAT YOU SHOULD KNOW ABOUT ’’READING YOUR PAPER IN\nWar Time”? That's just one of the many up-to-the-minute topics from\nthe ’’Fourth Estate,” discussed over WSUI. Others include ’’Propaganda\n—How To Recognize It,” \"What is the Freedom of the Press?”, ’’The Press\nand Law” and \"Polls and Public Opinion.” The program is supervised\nby Professor Charles L. Sanders of the school of journalism.\nGEOGRAPHICAL ASPECTS OF NATIONAL DEFENSE - YOU CAN’T CONSULT THE MAP\nIN YOUR OLD GEOGRAPHY BOOK—OR EVEN LAST YEAR * S MAP—FOR THEY ARE\nchanged now. But every Thursday afternoon you can hear a discussion\nof “Geographical Aspects of National Defense” over station WSUI. Pro¬\nfessor Harold h. McCarty of the college of commerce directs a round\nTA8LE DISCUSSION ON THE CUSTOMS, CLIMATE, RESOURCES, AND HISTORY OF\nA LOCATION PLAYING AN IMPORTANT PART IN THE WORLD*S NEWS*\nHEADLINE NEWS - EXPLANATION OF THE WORLD'S BEWILDERING ACTIVITIES IN\nA CONCISE CAPSULE—THAT'S “HEADLINE NEWS.” THE COMMENTATOR IS DR. JACK\nT. Johnson of the department of political science, who gives a clear\nANALYSIS OF THE WEEK'S NEWS IN AN AUTHORITATIVE AND IMPARTIAL MANNER*\nIOWA CONGRESS OF PARENTS AND TEACHERS - PROMOTING DEMOCRACY IS IM¬\nPORTANT IN THE WORLD TODAY AND THAT*S THE PURPOSE OF * SERIES OF\nBROADCASTS SPONSORED BY THE “IOWA CONGRESS OF PARENTS AND TEACHERS.”\nIOWA FEDERATION OF BUStMESS AND PROFESSIONAL WOMEN'S CLUBS - IOWA\nFederation of Business and Professional Women's Clubs are taking an\nACTIVE ROLE IN NATIONAL DEFENSE. THEREFORE, THE NATIONAL THEME,\n“Strengthening Democracy for Defense,” is the basis for a series of\nPROGRAMS OVER WSUI THE SECOND THURSDAY OF EACH MONTH.\nIOWA STATE LEAGUE OF WOMEN VOTERS - The “Iowa LEAGUE OF WOMEN VOTERS”\nIS LINING UP TO HELP THE GOVERNMENT IN THE “BATTLE OF PRODUCTION.” THIS\nPROGRAM, SCHEDULED FOR THE FIRST SATURDAY OF EACH MONTH AT 9 O'CLOCK\nIN THE MORNING*\nMM AN AMERICAN - THAT*S THE TITLE OF A TRANSCRIBED SERIES PREPAREDLY\nthe United States Department of Justice which is broadcast over WoUl\neach Saturday*"
}