{
  "id": "d1184-3",
  "text": "(4)\nTranscribed programs, written spot announcements, or other program materials\nHAVE BEEN USED WHEN SUPPLIED BY THE FOLLOWING NON-GOVERNMENTAL AGENCIES! UNITED\nService Organizations, the British War Relief Society, Institute for Oral\nand Visual Education, Royal Norwegian Government, Friends of Democracy,\nBundles for Britain, and United States Flag Association\nON THE DEFENSE FRONT OF W 0 I\nThe day-by-day story of America preparing is now being told over WO I in\nA NEW SERIES CALLED \"On THE DEFENSE FRONT.”\nAs part of each program, there is a five minute summary of the latest\nDEFENSE HAPPENINGS.\nThe Agricultural Extension Service at Iowa State is presenting speakers\non Mondays to discuss Iowa*s part in the \"Food for Defense” drive.\nAs in the past on WOl, Tuesdays set aside for discussions from”the\nChallenge to Democracy”, the pamphlet series published this year by the Ex¬\ntension service. During October, Clarence Matterson of the History Department\nFACULTY SCUSSING HIS PAMPHLET, “DEMOCRACY AND NATIONALISM.” TUESDAYS\nin November will bring Charles Norby to the microphone with his study of\n\"The Machine and Democracy.” In December, John Vi eg will offer a more general\ndiscussion of “Democracy on Trial.” Finally, to summarize the series, L. Qe\nSchmidt, History Department head, will appear early in January.\nThe Iowa Industrial and Defense Commission offers a speaker for ”0n the\nDefense Front” every Thursday. Rooney Selby, secretary of the Commission,\nAPPEARS MOST OFTEN, WITH REPORTS Cf WHAT IS BEING DONE FOR DEFENSE BY IOWA\nINDUSTRY.\nFridays are dedicated to discussions of the consumer and defense, with\nGertrude Dieken, consumer reporter, offering up-to-the-minute hints on price\ntrends of everything from refrigerators to rents.\nAlso related to the defense picture, of course, are the 6 daily newscasts\nCARRIED OVER WOl, IN WHICH WE GIVE FULL DETAILS ON HAPPENINGS IN WASHINGTON\nAND ELSEWHERE UN THE DEFENSE PICTURE.\n“Lest We Forget” a transcribed dramatization series based on American\nHistory, is indirectly relateo to defense and greater understanding of the\nprobG^ms involved in it.\n“Farm Facts” is a daily agricultural information program-—45 minutes\nIN LENGTH—WHICH WOl HAS BROADCAST FOR SEVERAL YEARS. THIS SERIES, FOR WHICH\nSam Reck is emcee, has included an enormous amount of material on the Food-\nfor-Oefense drive of the U. S, Department of Agriculture.\nCalculated to increase understanding of the defense effort and various\nproblems related to it sre two weekly discussion programs. One is ”Let!s\nTalk It Over,” heard on Fridays for a half-hour. The other is “International\nForum”, heard Saturdays. Both feature members of the faculty in informal\ndiscussion of currents problems, which nowadays are almost all related to the\nDEFENSE EFFORT.\n“Homemakers Halfhour”,\nYEXRS, HAS BEEN FEATURING A\nA WOMEN®S PROGRAM WHICH WOl HAS CARRIED FOR MANY\nGREAT DEAL OF MATERIAL IN RELATION TO DEFENSE *\nWHERE SHALL WE MEET SEPTSMSSR 4 & 5. 1942?\nWhere shall we meet for the annual Fall convention of NAEB?\nYou CAN HELP DECIDE BY ADVISING NOW WHAT YOUR WISHES ARE. SEE THE ENCLOSED\nVOTING SHEET AND CAST YOUR PREFERENCES."
}