{
  "id": "d1102-0",
  "text": "\\\nN-A-E-B NEWS - LETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nLOUISIANA UNIVERSITY\nHAS NEN STATION\nulsu-fk\nEdited by Richard B. Hull, President\nStation WOI, Iowa State College, Ames, Iowa\nJANUARY 1, 1948\nN A S 3 ORAL ARGUMENT\nCLEAR CHANNEL HEARING\nJA'TARY 19 \nNIT CHAIRIiAN AND NEN MEMBERS ON FEDERAL COMMUNICATIONS COMMISSION\nCoy, director of the Washington Post radio stations NINX and NINH-FH\nwas sworn as new chairman of the FCC December 29, 1947. One time assistant to the\nlate president Roosevelt, Coy replaces former Chairman Denny who is now with NBC,\nFormal nomination will he sent by President Truman to the Senate. Senator Taft\nand GOP Chairman Carroll Reece is said to oppose his appointment. (Coy is a Demo¬\ncrat, originally from Indiana)\nGeorge Sterling, former chief engineer of the FCC has been appointed to succeed\nE. N. Jett on the Commission; Jett resigned his post to take a position as presi¬\ndent and director of the Baltimore Sun Papers Radio Division. (Sterling is a\ni Republican from Maine). Sterling’s appointment will be sent to the Senate for\nconfirmation along with that of Coy.\n11 • F, Jones (Republican, Ohio) and E, M, r*ebster (Democrat, Washington, D.C.)\nwere new appointees to the FCC last year. This now brings the FCC to its full\ncomplement of 7 members. Old members include Clifford Durr (Democrat, Alabama),\nPaul A. Nalker (Democrat, Alabama), and Rosel H. Hyde (Independent, Idaho).\nRetiring Commissioner Jett had been with the FCC and its predecessor, the\nFederal Radio Commission, for IS years. His association with radio dates back to\n1911 when he joined the Naval Service of the United States. Jett’s entirl career\nwith the Nation has been devoted to ^ork in the radio field. During the war Jett\nwas Chairman of the Coordinating Committee of the Board of Wartime Communications.\nHe leaves a record of long, faithful, and intelligent service as an outstanding\ncivil servant.\nEDUCATIONAL RADIO HIGHLIGHTS\nIN THIS ‘ISSUE\nLouisiana State’s New Station....2\nUNYC FM-Netw'ork Planned in East.. 3\n\"Aussie\" Radio Director in U.S...4\nEducators Drop Station Grants..,.5\nColumbia U. Proceeds with FM.5\nSchools Protest Petrillo Ban,....6\nMaddy Predicts AFM Break-up..... .7\nFCO Clear Channel Complications....?\nN-A-E-B \"Clears'* Named.8\nReligious Radio Workshop (N.Y.)...,9\nN-A-E-B Personal Notes.10\nVoice of America Okayed.*..,.11\nHints for Program Managers.15\nFCC Educational Actions.17\nN \"...the radio, the press, the motion picture—each of these devices N\ncount- their listening, reading, viewing audiences in the millions (they)...\nA can rise no higher, achieve no more significance, can reflect no more under— 0\nstanding or depth of purpose than the level of those who operate them.\"\nE rn\n\"Radio, in itself, is neither good nor bad; it simply reflect the desires,\nB beliefs, and ambitions of those who operate it.\" g\nAce-President Treasurer\nJohn Dunn W. I. Griffith\nWNAD, University of Oklahoma WOI\nNorman, Oklahoma Ames, Iowa\nExecutive Secretary Executive Committee\nM. S. Novik Seymour Siegal, WNYC, New York Graydon Ausmus, WUOA-FM, Alabama\n30 Rockefeller Plaza Carl Menzer, WSUI, Iowa Ralph Steetle, WLSO-FM, Louisiana\nNew York, N. Y. - Frank E. Schooley, WILL, Illinois William Sener, KUSC-FM, California"
}