{
  "id": "d1102-10",
  "text": "Indiana Looks Ahead\n11\nUpon this conviction, and with its eyes turned sharply into the\nfuture, Indiana University is increasing its facilities to participate\nin the training of tomorrow’s physicists. The University’s cyclotron,\nits spectrographs, cloud chambers, delicate electrical meters, and\nmany other items of research equipment are being readied to give\nfuture graduate students practical, firsthand experience in the\ninvestigation of physical problems in the pioneer fields of electronics,\nand atomic and nuclear structure, as well as in the classical phases\nof the subject, with the hope that their hands may contribute a\nfair share of the future miracles of physics. The University’s\nundergraduate physics laboratories and classrooms are being equipped\nwith additional apparatus, and new courses are being added so that\nthe ground work of the future miracle-makers may be substantial\nand complete, and so that an army of teachers may be trained for\nthe generation of a- livelier general interest in the subject.\nToday Indiana offers her facilities to the men and women\nwho would add to the marvels of the past and become the miracle-\nmakers of tomorrow.\nCharles Hire,\nActing Head of the\nDepartment of Physics.\nChemistry\nWHE nature of World War II has demanded help from all\nbranches of science. The chemists have done their share.\nThrough the excellent cooperation of chemical specialists in thirty\ndifferent fields the development and production of 870,000 tons of\nsynthetic rubber, tons of special explosives, drugs such as atebrin,\npenicillin, plastics' for aeroplanes and plywood gliders, and special\nalloys for armament, electrical equipment, and rocket planes—all\nthese and many more have been produced.\nThe impression is generally given that these new products\nare the result of short-time, high-powered research, completed in\ntwo or three years. Nothing could be farther from the truth.\nThese wartime emergency developments were actually dependent\non, and would have been impossible without, the knowledge accumu¬\nlated over many years, in a large number of fields.\nThe chemist deals, with atoms and molecules. The way in\nwhich the atoms are combined into molecules determines the"
}