{
  "id": "d1102-12",
  "text": "Indiana Looks Ahead\n13\nYes, these men know our country has found again the strength\nthat made us great; has found again, in this mighty power to\ndestroy, the power to create.\nAnd they see how this miracle, this mighty power, this energy\nused now for war, can, after victory, create a new and finer\nlife than we have ever known before.\nNew cities, new farms, new homes, new industries, new op¬\nportunities for returning heroes and every man, opportunities to\nplan and work and grow, to build a new and greater America.\nThat’s the way they want it to be.\nThat’s the way it’s got to be!\nNational production, postwar, must be at the rate of at least\n140 billion dollars a year—at least 40 per cent more than the 1940\noutput of goods and services, and within shouting distance of the\npresent astronomical wartime output, which includes hundreds of\nbillions’ worth of war materials for which the government is the\ncustomer.\nLooked at in such terms, tomorrow’s production job will be\nno cinch.\nIt s a big undertaking, but there are many factors that will\naugur well for success in it.\nFor instance, on the postwar want list of Mr. and Mrs. America\nwe find: two and a half million automobiles, nearly two million\nmechanical refrigerators, three quarters of a million dining-room\nsets, more than a million new vacuum cleaners, one and a quarter\nmillion new washing machines, six billion dollars for new homes.\nA few years of war have brought progress in science, invention,\nand technology which otherwise might have required a quarter-\ncentury or more. Aviation, electronics, plastics, chemicals, light\nmetals—these barely suggest the endless possibilities of new markets\nat home. And beyond, waiting exploration, are other possibilities\nof expanding foreign markets.\nBarring the disaster of price inflation, Mr. and Mrs. America\nwill have stored up vastly more buying power than they have ever\nhad before with which to satisfy their wants.\nTo realize this production miracle we will need a distribution\nmiracle.\nThe great pent-up postwar demand for goods and services will\nstay pent up unless it is released by the full use of the particularly"
}