{
  "id": "d1102-12",
  "text": "STATION ICUSP aDDS FARM FEATURES\nStation ItUSD, non-commercial public service outlet of University of South\nDakota, has a new working arrangement with South Dakota (A.&H. College) whereby\ninformation from the Agricultural Extension Service is broadcast regularly.\nIrving Merrill, ICUSD director, acts as farm reporter, (A full report on ICUSD* s\nunique Workshop activities is scheduled for a later N-A-3-B Newsletter).\nRADIO MEETINGS PLANNED EOH 1948\nApril 30 - May 3 ■— Institute for Education by Radio, Columbus, Ohio.\nMore details on this annual nation-wide gathering in forthcoming issues.\nApril 37 - 39 — Three-day for RED1s (Radio Farm Directors) in Washington,\nD.C. Get details of meeting from Chuck Worcester, WMT, Cedar.Rapids, Iowa, .\nCOUNCIL OH RADIO JOURNALISM ELECTS OFFICERS\nThe Council on Radio Journalism has elected new officers and authorized\narrangements for internships of journalism in commercial radio stations.\nThe new officers are Mitchell V. Charnley, University of Minnesota Journalism\nprofessor, president; S. R. Vadeboncouerur, WSYR, Syracuse, N.Y., Chairman of\nthe NAB News Committee, Vice-Chairman; and Arthur Stringer, NAB Staff Director,\nSecretary and Treasurer.\nInternships in previous years were held by at least two NASB members,\nFrank Schooiey (WILL, University of Illinois) and Jim Schwartz (WOI, lo^a State\nCollege).\nNEW YORE! PF.ARQDY A~'API) COM IITTEE ClTES\nNew York City’s non-commercial, public-service outlet WNYC was recommended\nto the National Peabody Awards Committee for \"public service rendered by a local\nstation\" 1000 watts or under for live coverage of United Nation meeting with\na special commendation for the station's airing of city transit hearings.\nAlso recommended by the New York Committee as the outstanding educational\nprogram was ABC's \"Town Meeting of the Air,\" and for ’’outstanding children's\nprogram,\" ABC's \"Land of the Lost.\" Special recommendations in the same classic\nfication were made for WQXR! s \"Youth Eorum\" with Dorothy Gordon,\nNErr TRANSCRIPTION SERIES ON RACIAL TOLERANCE FOR SPRING OE 1948\nNew Tolerance Series Ready Next Spring.\nNext album of 13 quarter-hour transcriptions produced by the Institute for\nDemocratic Education to aid in racial problems will be ready for release in the\nSpring of 1948, it was announced at the Institute's board of governors meeting\nin New York. Board members present included Robert Saudeck, ABC; Lyman Bryson,\nCBS; and Elsie Dick, MBS.\nNew series called \"Stories to Remember,\" contains radio adaptations of short\nstories written by such writers as MacICinlay ICantor, Irwin Shaw, Dorothy Canfield\nFisher and Claudia Cranston. Series was conceived and produced by Earold Franklin,\nprogram director of the Institute, and directed by Earle McGill, Programs feature\nstars of stage and screen in leading roles,"
}