{
  "id": "d1102-16",
  "text": "Indiana Looks Ahead\n17\nindividualized development of independent, thinking, moral per¬\nsonalities. We need citizens who are not morally neutral, not\ncoldly scientific, but who are concerned about moral principles\nand their practical applications: citizens who are not merely in¬\ntellectual but whose emotional experience and training are sufficient\nto give added insight into human needs. It will be the increasing\nduty of higher institutions of learning to assume a greater re¬\nsponsibility for the development of forceful, morally-sound citizens\nbecause many other institutions are exercising a decreasing influence\nin this field. Here education must recognize its responsibility to\nprovide continuous lifelong assistance. To the carrying out of this\ntask the University will need to dedicate all its institutional wisdom,\nits energy, and its creative imagination.\nOur experiences in global war are forcing us to extend our\nintellectual horizons to see the broader implications and results of\neducation; to see that in building a worthy individual life or a\nworthy national life, the surest foundation is a sound education.\nEvery individual, every group, every nation is definitely affected\nby the amount and character of education prevailing. In this\nconnection the most critical and difficult problem of this generation\nis the development and maintenance of a peaceful cooperative\nrelationship among nations.\nThe solution of the problem lies, first, in the developing of a\nfuller understanding of our own personalities, and of the person¬\nalities of other people, together with a right attitude towards our¬\nselves and good will towards others; and, second, in coming to\nrealize that a genuine loyalty to the smaller social group does not\npreclude but rather enhances a true loyalty to the larger group; in\nshort, that we can have both a true nationalism and a sound inter¬\nnationalism just as we can at one and the same time have a\nfamily pride and a deep community interest.\nIn a democracy education is especially essential because all\nthe people must help to determine all social policies. Peace or\nwar, prosperity or depression, freedom or regimentation, depend\nupon the power of ideas in the minds of the total population. If\nwe want the best in national life we shall have to teach the best\nin ideas, in ideals, and in practice in all our public schools and higher\ninstitutions of learning.\nA further task to be faced is that of enhancing education in\nthe eyes of youth and of raising it to new prestige levels. A real\neducation gives the light by which to go forward and the spiritual"
}