{
  "id": "d1102-16",
  "text": "December 15\nFEDEBAl COMMUNtCAT IONS COMMISSION\nApplications <fe Actions\nEducational Stations\nJanuary 5\naM -Application Accepted, for Filing - 830 KC\nWNYC - City of New York, Municipal Broadcasting System, New York, N.y\nExtension of special service authorization to operate additional time between\nthe hours of 6:00 a.m. EST, and sunrise at New York, N.Y., and between the\nhours of sunset at Minneapolis, Minx;., and 10:00 p.m., EST, using direction¬\nal antenna designed therefore, for the period beginning 3:00 a.m., EST, 3-3-43.\nAM - Miscellaneous Actions\nWSOH - The Ohio State University, area of Columbus, Ohio - Granted CP to\ninstall new transmitter equipment and increase power to 50 watts. (3PEY-257)\nAvl - Modification - 1250 KC\nKPaC - Port Arthur College, Port Arthur, Texas - Modification of construct¬\nion permit (B3-P-5125, as modified, which authorised increase power, install\nnew transmitter and change transmitter location) for extension of completion date.\nAM - Applications Tendered for Filing - 850 KC\nKFUO - Evangelical Lutheran Synod of Missouri, Ohio and Other States,\nClayton, Mo. - Construction permit to increase power from 5 KW to 10 10'/, install\na new transmitter and change the transmitter location,\nAM - License Extensions\nKFJM - University of North Dakota, Grand Forks, N.D. - Held in abeyance action\non KFJM1. s application for renewal of license, pending securing of further informa¬\ntion, and present license was extended on a temporary basis only to March 1, 1948.\nACTION\nAM - Docket Cases - 920 KC — (Shares Time KUSD, South Dakota University)\nThe Commission announced its Final Decision granting application of Lee-Smith\nBroadcasting Company for a new station in Faribault, Minn,, to operate on 920 kc.,\n1 KW, unlimited time, DA day and night (BP-4581; Docket 7875), subject to\napproval of transmitter site and antenna system by the Ca*.; and denial of the\napplication of KFNF, Inc., for a construction permit to change transmitter site\nof station KFNF, Shenandoah, Iowa, install a new antenna system, and increase\ndaytime power to 5 KW (presently operating on 920 kc. , with 1 KW.day, 500 watts\nnight), without prejudice to the immediate filing of an application specifying\noperation which will provide the operation of Lee-Smith Broadcasting Co., and\nother proposed and existing stations with protection in accordance with the\nCommission’s standards. (BP-5840; Docket 8164) (Comrs, Coy, Jett and Jones\nnot participating.)"
}