{
  "id": "d1102-2",
  "text": "-3-\nULSU-FM Staff has Basic Staff of 13\nOperation of the station is under the direction of Ralph Steetle (HAH3\nDirector for Region V), assisted by Program Director, Lucile Ruby; Chief Engineer\nB. L. Gibson; Continuity Editor, Martha Uarner Matrailer; Script Writer, Prances\nJones Butler; Transcription Librarian Vivian Dyer Thornton; and Office Manager,\nMrs. Sally Chappuis. In add.ition the staff includes two transmitter engineers,\nGeorge Perry and James Ford; two control operators, Kenneth Byrd and Thomas\n0’Q,uinn; two announcers, Buddy Campbell and Franklin Lewis, assisted by Qualifi¬\ned students,\nLouisiana Radio Development Planned Since 1945\nFirst formal steps toward ULSU-F-I development were taken April 7, 194-5 when\nthe Board of Supervisors resolved to authorize the General Extension Division to\napply for a construction permit from the FCC. Prior to this a great amount of\npreliminary planning and investigatory work had been done. The former director\nof General Extension, Dr. Marion B. Smith and the Dean of the University,\nMajor Fred C. Frey had directed preliminary studies. Dr, J. V. Brouillette,\ndirector of the General Extension Division together with two acting directors\nof radio, Miss Charlotte Searles and Miss Fora Landmark conducted the research\nand made all preliminary preparations for FCC application. The late Dr. Uilliam\nB, Hatcher lent the project his warmest support.\nUhy Frequency Modulation?\nThe University chose to construct an FM station rather than an amplitude\nmodulation station because FM is the newest and finest form of the broadcast art,\nLSU feels that FM is superior to ordinary radio; it will in 5 to 8 years, to a\nlarge extent, replace radio as we knew it now, FM high fidelity with its capacity\nfor authentic reproduction of music and its static-free characteristic were\nimportant considerations.\n* •.:<*** *****\nTTTYC-FM FETrr0RIC FLAMMED SOON OF FASTERM SEABOARD\nPlans for an Eastern FM network to emphasise educational and public service\nprograms are being developed by Seymour Siegel, director of UHYC, Few York City\nmunicipal station.\nThe proposed network is to be purely an \"off-the-air” operation without\nactual physical connections. The Continental Fetwork, now in operation, uses\nthe same method for some of its pick-ups.\nThe non-commercial, public service network, keyed by Station URYC, will\nhave coverage in 3 or 4 Eastern states. The City of Few York is expected to\nfurther participate through the City Education Department1s Station, UFYE-FM.\nThe Rational Association of Educational Broadcasters (F-A-E-B) will cooperate\nin the development, and will have an announcement on further extension of the net¬\nwork in an early Fewsletter,\nNearly all of the F-A-E-B AM stations, notably those in Iowa, Minnesota,\nIllinois, Michigan, Ohio, Uisccnsin, and Indiana are in the process of planning.,,\nconstructing or operating. FM stations in addition to their AM outlets."
}