{
  "id": "d1102-20",
  "text": "Indiana Looks Ahead\n21\npicture of the student body had improved. Studies made at\nIndiana University in the student body indicate that the prevalence\nof decay is the same as at Minnesota.\nIndiana University is keenly aware of the hazards to the\ngeneral well-being and health of the people of this state resulting\nfrom dental disease. Its Dental School ranks with the best schools\nof America in training young men to enter the practice of dentistry\nand wage war against the ravages of dental decay. But even\nmore important than the training of skillful dentists, Indiana\nUniversity recognizes the value of the prevention of dental decay.\nToward this end, the Dental School has made it attractive for\nscientists to conduct research, hoping to develop methods whereby\ndecay could be greatly reduced.\nAs an example, we are now prepared to announce a program\nwhich has been shown to control approximately three-fourths of\ndental decay. This is done by requiring the patient at any age\nto follow a prescribed diet designed to eliminate certain bacteria\nwhich are in the mouth when teeth are decaying. Once these\nbacteria are eliminated, the teeth will stop decaying.\nThis sounds much easier than it really is, however, because\nfor each patient the number of bacteria in the mouth must be\ndetermined, and he must then go on a sugar-free diet for a period\nof approximately two weeks, and a modified diet thereafter. It\nis not always easy to get full cooperation from patieftts in using\na diet where sugar is missing, and consequently it is difficult to\ncontrol decay by this means. It is a well-known fact that dental\ndecay is most active in children and young adults. The recom¬\nmended diets not only are designed to reduce the activity of the\nbacteria causing tooth decay, but also are planned to supply all of\nthose food factors necessary for the well-being and good growth\nof the individual. Anyone may take advantage of this program\nby arrangement with his local dentist or by applying directly to\nthe School of Dentistry.\nTwo years ago, Indiana University looked forward eagerly\nto the day when it could offer to the children of Indiana more hope\nagainst the- hazards to their health and disfigurement to their\nappearance resulting from tooth decay. But, today, Indiana Uni¬\nversity looks forward to more easily applied methods which will be\neven more effective. It now appears that these hopes may become\na reality. More research and more time will be required, however,\nto verify our early encouraging results."
}