{
  "id": "d1102-5",
  "text": "TELEVTSICiH, CENSORSHIP, AHD TEE MORALS OF CEILDREE\nA report v/as circulating through Hollywood that Los Angeles County was\nconsidering censorship of video programs. County Supervisor Roger U. Jessup,\naccording to BILLBOARD, proposed the censorship to prevent ’’Blood and thunder11\nprograms from entering homes, where children might see them. Jessup’s pro¬\nposal was referred to the County Youth Commission which will study the matter\nand issue a report. The Commission is already analyzing the effect of radio\nand flickers on small fry.\nThe only two active television \"broadcasters in the area, Klaus Landberg\nof ICTLA and Harry Lubcke of Don Lee radio, replied that television must\nremain free of governmental censorship as must other media of communication\nif it is to .operate in the best interest of the public.\nThis is a reiteration of the age-old argument of protecting the young\nwhich within contemporary memory has assailed the works of Horatio Algier,\n’’yellow-backed novels,” Wild Tfest tales, and children’s radio serials, not\nto mention Dick Tracy.\nThought might be given to the remarks of sharp-tongued Philip Tfylie in\nthe January issue of KASPER’S Magazine withrespect to cotton-wool rearing\nfor a long view on one side of the issue.\nFurther thought might well be given by all who deal with press, radio\nand movies, either as practioners or guardians to the proposition that failure\nto emphasize the ’’good” and failure to program positively in the public\ninterest may be a far greater sin than any number of violations of good taste,\nCAEADIAH RHLIGIOTJS 3y;0ADCACTHP.S HAIRS U, S. - CAI'APA SUP.YEY\n\"Evangelical Radio Programs of Canada\", a non-profit service for religious\nand educational broadcasters, is making a survey through the United States\nand the Dominion of Canada for a long and short-wave station project in one\nof the West Indies. They say the policy of the operators of the new station\nwill be to give precedence to ’’programs of high cultural value, and to en¬\ncourage public service, and religious broadcasting,’’\nERPC has been compiling a comprehensive list of program types and\nsources in the public service field. It is to be published at cost for those\ninterested in this type of program.\nEvangelical Radio Programs of Canada may be addressed at 1102 Seventh \" i\n: Street Lest, Calgary, Alberta, Canada.\n-i_____i\nSCHOOLS 0E ,:usic PROTEST PETRILLO BAH\nThe 22nd annual convention of the national Association of Schools of\nMusic protested Petrillo’s ’’anti-recording\" ban as \"selfish and unwarranted,\"\nThe protest came in the course of their Boston meeting, December SO.\nThe Association contends that records are as essential to the music teacher\nas microscopes to the scientist,\nPetrillo issued an order, effective January 1, forbidding American\nFederation of Musicians members to make further phonograph recordings."
}