{
  "id": "d1102-7",
  "text": "PEESIEENT HULL WARNS N-A-E-B\nRichard B. Hull, N-A-B-3 President, warned N-^-E-B member stations who■testified\nin the October Clear Channel Hearings, appealing for night-time and special\nexception for their stations in any re-allocations of U. 3. Clear Channels that\nthe decision expected at the end of the oral argument (“beginning January 19,\nscheduled to end in 60-days) is a highly involved affair and no predict ions\nare possible.\nThe Clear Channel dispute, now 3 years in progress, is a highly complex affair.\nThere is question in some quarters, hall says, whether or not the stated issues\nare the real issues in the minds of all parties concerned.\nIt was pointed out that the CCBS (Clear Channel Broadcasting Service), in effect\nthe publicity and lobby \"front\" of 26 clear channel stations, was content for a\nlong time to hold a \"defensive position,\"' When it became apparent there was\nsome actual liklihood of clear channel frequencies being \"broken down,\" the\nCCBS reacted aggressively urging that super-power or 750,000 watts be given to\nstations now using 50,000 watts.\nSome observers, Hull reports, feel the CCBS contention that duplicate operation\ninvolves interference is only one factor in their thinking argument, and that\ntheir other stronger motive mayv be (l) to maintain through high-power and pro¬\ntection superior competitive advantage in their respective radio markets.\nThe whole issue is a complicated one, technically and policy-wise. There are\nthousands of pages of exhibits and testimony which have to be studied by the ECC.\nThere are many points of view dictated by lack of information, mis-information*\nand understandable self-interest, not to mention honest confusion.\nHull pointed out that of the original number of educational stations on the\naM\nband (numbering nearly 200 twenty years ago) only 50-odd survive. Nine of\nthese\nnon-commercial, educational stations in New York, Michigan, Iowa, Oklahoma\nand\nOhio are on disputed clear channel frequencies. They have managed not only\nto\nweather the storm, but to provide worthwhile and unique program service for\ntheir\nrespective tax-paving citizens. They now seek equal rights to serve their\naudiences in the most important part of radio’s daily 24 hours — at night.\nIt is hoped -the willingness and ability of these 9 educational stations to serve\nthe special interests of thousands of people with farm and market information,\ngood music, and education will not be denied them. This is the first objective\nof these college and university stations. With the 26 opposing clear channel sta¬\ntions, the primary objective necessarily is first to sell time and only secondly—\nexcept emergency-wise — to furnish public service.\nThe N-A-E-B clear channel stations have not challenged the American system of\nradio, nor the abolition of sponsored programs, nor asked fqr the break-down\nof clear channel service, nor assaulted the rights of listeners in the major\nservice areas of the contending clear channel stations. The NAME again reiterates\nits stand against government-owned or government-controlled radio. .\nThese 9 N-A-E-B stations have simply asked for equal opportunity — equal rights\non the channels they use —> to serve citizens within their own states and areas."
}