{
  "id": "d1102-9",
  "text": "N-*.-E-B personal notes\nSeymour Siegel, W'NYC (Municipal Broadcasting System, New York City) Manager,\nplans a visit to Iowa State College (WQI) the end of February. He will \"be\nguest speaker at an ISC Social Science Seminar.\n**********\nHarold Engel, Assistant Director WHA (University of Wisconsin) reports a\nstudy of sciiool listening to be available for Newsletter publication in\nthe near future. “It sets a pattern\", he says, \"which may prove' of consider¬\nable value to those who plan school broadcasting activities,\"\n**********\nL. L. Lewis, WOI Chief Engineer, plans a tour of Iowa and adjoining states\nto study EM installations in progress and in operation. WO I will begin\nconstruction on WOI-EM, January 19.\n**********\nIrving Merrill, Director KUSD (University of South Dakota) visited WOI during\nthe Christmas holidays. He reports he and his family find Vermillion, South\nDakota, a very pleasant place to live. College staff and townspeople are\nshowing an increasing interest in the expanded plans, new euipment, and more\ncomprehensive program of KUSD, N-a-E-B members will find Merrill's Radio\nWorkshop worth considerable investigation. It's a fine operation.\nWe wish to express our deepest sympathy to Michael R. Hanna,\nDirector, Station WHCU (Cornell University) in his recent\nbereavement. His wife, Mazel Hanna, died December 29, leaving\nthree.sons. Funeral services were held in Ithaca, New York.\nDr, I Keith Tyler, Director Ohio State Institute for Education by Radio writes\nentries are coming for the \"Twelfth American Exhibition of Educational Radio\nPrograms.\" He says that entry blanks are still available, but that entries\nclose February 1, 1948.\n**********\nFrank T. Stockton, Dean of University Extension at the University of Kansas\n(Owns and operates Station KEKU) sends his regrets at his inability to attend\nthe recent N-a-E-B Convention in Chicago. Dean Stockton, recently appointed\nas Dean has supervision over KEKU.\n************\nJohn Dunn, N-A-E-B Vice president and Director WNAD (University of Oklahoma)\nwrites his conviction is we must continue to expand our membership. Dunn\nwill have a full report soon on the progress of WNAD's EM station now in\nprocess of construction.\n************\nCarl Menzer, Director WSUI (State University of Iowa) writes that their new\nEM station, KSUI, is giving good service and good coverage. He promises a\nreport soon on the entire operation."
}