{
  "id": "d1561-0",
  "text": "NEWS N AEB^TIER\nNATIONAL ASSOCIATION - EDUCATIONAL BROADCASTERS\nFrank E. SHiooley, Editor, Station WILL, Urbana, Illinois\nv\nDecember 1, 1941\nNATIONAL DEFENSE ON K 0 A C\n(Editor's Note: This is the seventh in a series of articles on\nNational Defense programs being presented by educational broad¬\ncast ING STATIONS.)\nAs THE OFFICIAL VOICE OF THE STATE OF OREGON, KOAC RECOGNIZES THE\nFACT THAT THE STATE AND NAT 1QN ARE ENGAGED IN THE JOB OF PREPARING\nAmerica for national defense. Through cooperation with defense\nAGENCIES, KOAC STRIVES TO KEEP OREGONIANS IN TOUCH WITH PROGRESS\nOF THE PROGRAM AND SHARES ITS FACILITIES IN THE PRESENT EMERGENCY o\nPrograms built by the KOAC staff on developed cooperatively with\nPATRIOTIC AND DEFENSE AGENCIES ARE PRESENTED EACH WEEK DAY. (KOAC\nis silent on Sunday.) In addition, a liberal use is made of\nANNOUNCEMENTS AND TRANSCRIBED SPOTS ISSUED FROM VARIOUS GOVERN¬\nMENTAL AGENCIES.\nAS MANY OTHER STATIONS, IN THE EARLY DAYS OF THE EMERGENCY PROGRAM,\nKOAC BROADCAST MANY LIVE SPOTS, ONE MONTH TOTALING MORE THAN 150\nOF THEM IN ADDITION TO NINE 15-MINUTE TRANSCRIPTIONS, FIVE 5-MINUTE\nTRANSCRIPTIONS, A REBROADCAST OF A NATION-WIDE ADDRESS OF PRESIDENT\nRoosevelt, and a half-hour remote from a temporary army encampment\non,#olman Field, Corvallis.\nThe trend now is a greater use of transcribed programs as well\nAS DEFINITE USE OF THE THEME OF PREPAREDNESS AND DEFENSE IN MANY\nPROGRAMS OF MUSIC, NEWS, AND REGULARLY SCHEDULED SERVICE FEATURES\nFOR FARM, HOME, AND BUSINESS.\n;N DEFENSE OF AMERICA is THE TITLE GIVEN A DAILY 15-MINUTE BROAD¬\nCAST FEATURING ON MONDAYS (3:15 P.M.) A UNITED STATES NAVY REPRE¬\nSENTATIVE in person: on Tuesdays (9:45 p.m.) an Army script; on\nThursday (3:15 p.m.) a United States Army representative in per¬\nson; on Friday (9:30 p.m.) a United States Marine Corps trans¬\ncription, and on Tuesday and Saturday (5:30 p.m.) programs built\nUP FROM TIMELY INFORMATION PROVIDED BY THE OREGON STATE DEFENSE\nCouncil, the National Association of Broadcasters, Office of\nEmergency Management, the United States Treasury, and others.\nKOAC SCHOOL OF THE AIR programs (school DAYS I\\:00-H 520 a M )"
}