{
  "id": "d1561-2",
  "text": "NAEB NEWS LETTER\nPage 3\nDecember I, 1941\n(10:15-11:00 A o M o) ARE HIGHLY FLAVORED WITH NATIONAL DEFENSE BY\nCONSTANT AND JUDICIOUS WEAVING OF MATERIAL INTO THE PROGRAMS, AND\nTHROUGH SPECIAL GUEST 6PI AKERS SUCH AS Dr. HELEN MjTCHELL, NATIONAL\nNUTRITIONIST OF WASHINGTON, 0. C., AND DEAN AVA 8. MlLAM, CHAIRMAN\nof the Oregon Committee on Nutrition for Defense*\nK W S C»S CONTRIBUTIONS TO NATIONAL DEFENSE\nKWSC‘S CONTRIBUTIONS TO NATIONAL DEFENSE CAN BE DIVIDED INTO TWO\nCATEGORIES—ADDITIONS AND SACRIFICES* THE RADIO STATION OF THE\nState College of Washington reports a major contribution of the\nLATTER TYPE WITH THE LOSS OF HUGO L. LlBBY, WHO WAS CALLED INTO\nACTIVE SERVICE IN THE ARMY LAST AUGUST. NOW SERVING AS A SECOND\nLIEUTENANT IN THE ORM NANCE DEPARTMENT, LlBBY IS STATIONED AT\nLittle Rock, Arkansas. He came to KWSC in the fall of 1939 as\nChief Engineer, and during his two years of service to the State\nCollege of Washington he made numberous iMPaovEViENTS in the trans¬\nmitting AND TECHNICAL EQUIPMENT*\nKWSC HAS BEEN DOING ITS PART WITH POSITIVE CONTRIBUTIONS AS WELL\nAS SACRIFICES* KENNETH YEEND, STATION DIRECTOR, BELIEVES THAT HIGH\nQUALITY IN DEFENSE PROGRAMS IS MORE DESIRABLE THAN QUANT!TV* A\nDISCRIMINATE SELECTION OF PROGRAMS HAS BEEN MADE. VARIOUS INTEREST\nGROUPS ARE BEING REACHED WITH FEATURES WHICH ATTRACT LARGE FOLLOWINGS\nBECAUSE OF THEIR INTRINSIC ENTERTAINMENT AND EDUCATIONAL VALUES.\nBelieving that information is the first and most important defense\nDUTY OF RADIO, KWSC MAKES FULL USE OF ITS UNITEO PRESS SERVICE AND\nOTHER NEWS SOURCES. SlX QUARTER—HOUR NEWSCASTS ARE SCHEDULED DAILY*\nImportant news bulletins are released as they are received, war\nCOMMENTARY» a well-written five-minute news analysis by James F.\niv'CGLINCY, IS HEARD EACH DAY. HIGHLIGHTS OF THE WEEK IN REVIEW AND\nThe Week 8 s News are fifteen mi nute~\"news summaries presented on Mon¬\nday and Saturday respectively.\nSeveral sqheduled defense programs are KWSC School of the Air\nfeatures for out-of-school listening* School children certainly\nshould be acquainted with international affairs and domestic defense\nefforts. The College of the Air has adopted other of the defense\nshows, those designed primarily for an adult audience. Included\nIN THIS GROUP ARE THREE PROGRAMS WHICH PRESENT VARIOUS VIEWPOINTS\nON CONTROVERSIAL QUESTIONS AS WELL AS INFORMATION ANO EXPERT ANALYSIS\nOF CURRENT AFFAIRS* THE FIRST OF THESE IF FACULTY FORUM, HEARD FOR\nA HALF HOUR EACH TUESDAY EVENING* The PROGRAM IS PRODUCED BY ALLEN\nMiller, formerly with the University Broadcasting council and the\nORIGINATOR OF THE CHICAGO ROUND-TABLE. EACH WEEK fvlR. MILLER, NOW\nIN CHARGE OF PRODUCTION AT KWSC, BRINGS THREE FACULTY MEMBERS TO\nTHE MICROPHONE TO DISCUSS VARIOUS ASPECTS OF CURRENT AFFAIRS AS\nRELATED TO NATIONAL DEFENSE.\nAnother discussion feature utilizing a unique method of presentation"
}