{
  "id": "d1561-4",
  "text": "NAEB NEWS LETTER\nPage 5\nDecember I, 194)\nPRESENTATION OF FIVE DAILY PROGRAMS* THREE--EARLY MORNING, NOON\nANO EVENING—BRING THE FARMER NEWS, ENTERTAINMENT AND INFORMATION*\nTWO PROGRAMS FOR HOMEMAKERS ARE PRESENTED DAILY—MORNING AND\nAFTERNOON. On EACH OF THESE FARM AND HOME BROADCASTS A GREAT DEAL\nOF MATERIAL RELATED TO DEFENSE IS PRESENTED. THE PLACE OF THE\nFARMER IN DEFENSE IS IMPORTANT; KWSC HAS RECOGNIZED THIS FACE\nAND DEVOTES A CONSIDERABLE AMOUNT OF ATTENTION TO SHEWING FARM\nPEOPLE HOW THEY CAN HELP WITH GREATER PRODUCTION. THE WORK IN\nMAKING THE PUBLIC CONSCIOUS OF THE NEED OF INCREASED FARM PRO¬\nDUCTION IS CARRIED BEYOND THE ACTUAL KWSC BROADCASTING. PUBLICITY\nAND INFORMATION IN PRINTED FORM IS RELEASED TO RADIO STATIONS AND\nNEWS SOURCES ALL OVER THE STATEo\nTWO PROGRAMS PROMOTED BY THE AGRICULTURAL EXTENSION SERVICE ARE\nESPECIALLY DIRECTED TOWARD DEFENSE WORK. FOOD FOR FREEDOM,\nA WEEKLY QUARTER HOUR BROADCAST BY THE Agr{CULTURAL ADJUSTMENT\nAdministration, features an interview and a short transcribed\n\"report of an official observer in England on the war of food.\"\nThe other special program is for homemakers Miss Velma Phillips,\nDean of the College of Home Economics at W.'S. C. is the state\nchairman of the committee on Nutrition for Defense and is pro¬\nmoting THE SERIES. *'0R DaILY MEALS IS DESIGNED TO FURTHER PUBLIC\nKNOWLEDGE OF FOOD, ESPECIALLY AS IT IS RELATED TO DEFENSE NEEDS.\nThe assistance afforded the housewife in her daily preparation\nOF MEALS GIVES THE PROGRM IMMEDIATE APPEAL.\nIN ADDITION TO ITS FULL SCHEOULE OF DEFENSE PROGRAMS, KWSC IS\nCOOPERATING WITH A NUMBCR OF DEFENSE AGENCIES BY AIRING NUMEROUS\nTRANSCRIBED SPOT ANNOUNCEMENTS. SPOTS FOR DEFENSE SAVING, U. S.\nArmy, U. S9 Navy, Marine Corps, Coast Guard, N. a. B. Manpower,\nCoal for Defense, and U, S„ 0. are among those used.\nKQAC SCHOOL OF THE A 1 ft\nA FIVE YEAR STUDY BY LEADING EDUCATORS RECENTLY MADE PUBLIC BY\nthe Educational Policies Commission of the National Educational\nPolicies Commission of the National Education association and\nthe American Association of School Administrators, presents a\nprogram of policy and action to educate the children of America\nFOR GUARDIANSHIP AND DEVELOPMENT OF A FREE SOCIETY. It HAS LONG\nBEEN REALIZED BY LEADING EDUCATORS AND PSYCHOLOGISTS THAT A LASTING\nDEMOCRACY MUST HAVE ITS ROOTS IN THE PUBLIC SCHOOLS. FUTURE GEN¬\nERATIONS MUST HAVE THE SAME DEMOCRATIC IDEALISM AS THE FOLDING\nFATHERS IF DEMOCRACY IS TO FLOURISH. TO ACCOMPLISH THIS REQUIRES\nTHE INDOCTRINATION OF THE PRINCIPLES OF DEMOC^RCY WITHIN THE REGULAR\nCURRICULUM OF THE PBULIC SCHOOL SYSTEM.\nIN KEEPING WITH THIS POLICY, THE KOAC SCHOOL OF THE AIR HAS TAKEN\nas its theme, \"The American Child in a Working Democracy.\" The"
}