{
  "id": "d1561-7",
  "text": "NAEB NEWS LETTER.\n.•.December I, 1941\n.*....000.c Page Bo\nCommunity officials from high state officers to local fiu s ld i ng in¬\nspectors, have been interviewed on the weekly “This, Our Community11\nPROGRAM, PREPARED FOR CIVICS CLASSES. TWO YOUTHFUL INTERVIEWERS\nfrom the Corvallis Junior Nigh School have conducted the programs,\nthe purpose being to create a vivid picture in the student listener’s\nMIND OF HOW the VARIOUS PHASES OF COMMUNITY LIFE RELATE TO HIM.\n\" AIR UN 1 Vi£RSs TY“ FORi/.SQ IN CONNECT I CUT VALLEY\nAn “AIR UNIVERSITY? COMPOSED OF FIVE CONNECT ICUT VALLEY COLLEGES AND\nTHREE COOPERATING NEW ENGLAND RADIO STATIONS, OFFICIALLY TOOK FORM\nlast month with the object of improving educational programs origi¬\nnated BY MEMBERS, AND OF SPONSORING PROGRAM SERIES DRAWING JOINTLY\nUPON THE RESOURCES OF THE INSTITUTIONS REPRESENTED.,\nThe group, to be known as the Educational Radio Council, includes\nAmherst College, Massachusetts State College, Mount Holyoke College,\nSmith College, Springfielq College, and radio stations WSPR in\nSpringfield, WHYN in Holyoke, and WHAI in Greenfield. Stateon VVBRK\nin Pittsfield has been invited to cooperate and will enter upon\nLATER MEETINGS OF THE COUNCIL.\nFrancis C. Pray, of Massachusetts State College* is chairman of the\nCouncil, and Anne Wilder of Mount Holyoke is secretary.\nAn experimental joint program on science in defense ss now being\nplanned by the Council with member colleges handling various phases\nof the subject.\nRecordings of programs in this first series will be made by each\ncollege. Upon completion of the series late in December, the Council\nwill meet in closed session and play back the transcribed programs\nwhile radio experts and college representatives criticize them i.n\nTHE LIGHT OF THE IR EFFECT5VENESS 6N THE SERIES.\nOHIO INSTITUTE, May'5-6\nThe Thirteenth Institute for Education by Radio, the national con¬\nference of broadcasters and educators, meeting under the auspices\nof Ohio State University will be heldo at the Deshler-Wallick Hotel,\nColumbus, Ohio, Sunday through Wedne^ay, May 3-6, 1942, it was\nannounced November 27 by I. Keith Tyler, Director of the Institute.\nStart now to record programs for entering in the Sixth American\nExhibition of Educational Radio Programs, Specifications and entry\nblanks will be available December 15; closing date for entries\nMarch 15.\nMICHIGAN ON W45P (FM)\nPalmer E.. Fry, W46D, reports that the Detroit FM station is carrying"
}