{
  "id": "d1561-8",
  "text": "NAEB NE'AS LETTER\nPage 9\n...December\nI 94 j\nPROGRAMS ORIGINATING ON THE UNIVERSITY OF MICHIGAN CAMPUS* WHERE\nWaldo Abbott holds forth* According to the arrangements W45D is\nTO HAVE THE PROGRAMS FOR FlvV EXCLUSIVELY FOR ONE YEAR. HERE 9 S\nA SAMPLE DAILY PROGRAM FOR A WEEKl\nMonday - 3:30 - 4:00\nTuesday-I 1:15 -II:45\n7:00 - 7:15\n7:15 - 7:30\nAednesday5:00 - 5:30\nThursday 3:30 - 4:00\n7:00 - 7:15\n7:15 - 7:30\nFriday 3:30 - 4:00\nFold songs and folk tales\nUniversity Choir •\nThe World Today: News\nComments by Prof* R. H0\nMcDowell\nFaculty and students of\nthe School of Music\nFries Memorial\nMadrigal Singers\nSports and Health\nFaculty from Uni versnw\nSchool of Music\nUniversity Symphony Or¬\nchestra\nWNYC BED I NS SERIES ON “CRIMINAL LAW ENFORCEMENT\"\nFor the second succesive year, WNYC, New York C?ty5s Own Station\nIS BROADCASTING THE CtVfL SERVICE COMMISSION LECTURES ON “CRIMINAL\nLaw Enforcement” in New York City* The Programs, braodcast from\nTHE AUDITORIUM OF METROPOL ( TAN VOCATIONAL HjGH SCHOOL I N MANHATTAN\nare on the air each Wednesday.\nRadio depends on the listener's ability to understand and follow\nwhat he 1 s hearing* Next* Saturday, December 6, WNYC, New York\nCity's Own Station, is going to start a weekly test of that\nability* The medium is a new program called “How \"ell Do You\nListen?\" It will be hears eac$ Saturday, from 5:30 to 6:00 p.m.\nIt3s a quiz show—the city stat on8s second (the other is the\nmusical Symphonic Varieties on Sundays) with a team of contestants\nlistening to descriptions of hypothetical situations* !hey are\nthen presented with a series of alternative solutions with the\ncorrect answer based on the descriptions which were read to them*\n“LEGALLY QUALIFIED CANDIDATE” DEFINED\nRules foverning political broadcasts have been clarified by the\nFederal Communications Commission so as to define a “legally quali\nfieo candidate*\" This ss pursuant to Section 316 of the Communi¬\ncations Act which reads:\n“If any licensee shall permit any person who is\na legally qualified candidate for any public office to\nUSE A BROADCASTING STATIONS, HE SHALL EFFQRD EQUAL OP-"
}