{
  "id": "d1716-13",
  "text": "COLUMBUS ISRT FLAKS ANNOUNCED\n-Hi-\nOne of televisions most famous characters will be the main speaker at the April 19\nbanquet of the 22nd Annual Institute for Education by Radio-Television at the Deshler-\nW&XXick Hotel, it has been announced by I, Keith Tyler, Institute directoro\nKTo Oliver J0 Dragon, better known as Ollie, of the \"Kukla, Fran and OXlie** puppet show\nwill speak on the topic, \"The Cultural and Educational Possibilities of Television,**\nOllie will be introduced by his puppet friend Kuklao Voice for both Ollie and Kukla is\nBurr Tillstrom, puppeteer for the NBC TV show0\nIn addition to arrangements for the annual dinner speaker, plans for over 30 special-\ninterest and work-study sessions are now well underway, Dr, lyier said. The Institute,\nknown as IERT, will be held April 17-20,\nTelevision to be Stressed\nFor the second year, the growing importance of television as a medium for education on\nschool, college and adult levels will be emphasised, Arnold Lo Wilkes of WBAL-TV,\ndirector of public affairs and education for the Hearst Corporation, will lead a panel\non education through commercial television stations,\nGroup discussion on simple TV techniques for education will be led by Edward Stasheff,\nstation WNYE's television supervisor. News by radio and television is a third area to\nbe covered by a special-interest group. Station WCCO's James Bormann, president of\nthe National Association of Radio News Directors, will lead the panel.\nOther Special Interest Meetings\nNew to the Institute program agenda this year will be three special-interest meetings.\nThe first, broadcasting to foreign countries, will be lead by Gerald Kean, acting di¬\nrector for United Nations Radio, Broadcasting in public relations is the subject for\nthe two other new panels. The college level group will be chaired by Lynn Poole, pub-\nlie relations director for The Johns Hopkins University, Allen H, Wetter, associate\nsuperintendent of Philadelphia public schools will lead the panel on broadcasting in\nschool public relations.\nAmong other topics for group discussion meetings are broadcasting by national organiza¬\ntions, chaired by Charles R, Sterritt, chief of the Audio-Visual Division of the\nAmerican National Red Cross, and building and holding audiences by Allen Miller, KWSC's\nmanager.\nEditor of Scholastic Teacher, William D, Boutwell, will, lead a panel on high school\nradio and television workshops. The meeting for discussion of education through com¬\nmercial radio stations will be chaired by Gordon Hawkins, program and education di¬\nrector for Westinghouse radio stations. Other areas, including those of agriculture,\nmusic, religion and campus broadcasting, also will be given special attention in\ngroup meetings.\nPurpose of the annual XERT is to bring together commercial and educational broad¬\ncasters in order to help the two groups gain mutual understanding concerning problems\nrelated to educational broadcasting,\n1+50 Entries in Recording Exhibition\nMore than 1j50 entries of radio and television programs have been submitted for competi¬\ntion in the X6th annual American Exhibition of Educational Radio and Television Pro¬\ngrams, it has been announced by Tyler* The yearly exhibition consists of programs\naired\"over U, S, and Canadian radio and television stations during the past year. For\nthe first time, local and regional television shows, as well as network programs,\nhave been entered in the competition."
}