{
  "id": "d1716-30",
  "text": "r\n-31-\n\"MDNITOR\" AND \"SATURDAY REVIEW\" SALUTE WHA AND KUOM\nUNIVERSITY OF WISCONSIN'S RADIO SERVICE DESCRIBED BY \"CHRISTIAN SCIENCE MONITOR\"\nThe February 2 issue of the Christian Science Monitor contained the following article\nabout WHA and accompanying FM stations under the title \"Rural Wisconsin Tunes in on\nCulture and Education\"\n\"Living remote from the big city is no hardship in Wisconsin, In fact* it8s an advan¬\ntage when it comes to cultural and educational events. Deep in the north woods a ranger\nand his family can tune in their radio for a dinner-hour symphonic concerto On a large\ndairy farm., miles from town* a homemaker is kept posted on the newest books, A salesman\ndriving over lonely roads picks up the voice of a favorite college professor as he\nlectures on English literature,\n\"From 7 a»ra. until 11 p,m, a good share of Wisconsin8s residents can tune in on farm\nand home hints* concerts by today’s greatest artists* great plays and books* and polit¬\nical forums produced by the Wisconsin State Broadcasting Service, By next summer* with\ncompletion of two new FM stations now under construction* all residents will be within\nlistening range of their state university and all of the state agencies and services.\nFunds for the two new stations were voted at the last session of the Legislature,\nSet Up in 19\n\"This steady fare of informational* education* and cultural programs is provided by\nthe Wisconsin State Radio Council and broadcast from Station WHA in Radio Hall on the\nuniversity carpus in Madison, The council was set up by the Legislature in 19ii-5> to\ndevelop a system of broadcasting of public service programs not duplicated fey commer¬\ncial stations,\n\"Members of the council include the governor and representatives of the University of\nWisconsin* the State Board of Normal School Regents* the Board of Vocational and Adult\nEducation* the Department of Agriculture, and Department of Public Instruction, The\ncouncil draws on the university* the Department of Agriculture* and a wide variety of\npublic and civic agencies for programs,\n\"Although in some states programs are broadcast from university campuses* listening\nranges are generally limited, Wisconsin* a leader in providing service programs to\nall residents* has done so by building its new stations on FM brands which are not\ncrowded as those in the AM spectrum. In the six years since 19h$ the network has\ngrown rapidly and with the two new additions will have a total of eight stations.\nPupils Listen to Series\n\"Microphones are taken directly into classrooms so that adults can share with students\nwhat some of the university’s best loved and most popular faculty members have to offer.\nThe College of the Air series this year offers a wide range of courses* including Survey\nof Russian Literature* History and Origins of World War II* and History of Journalism,\nSome of the courses are rebroadcast at night to reach a larger adult audience,\n\"More than 1^0*000 pupils in school rooms each week listen to the School of the Air\nseries designed for in-school listening. Creative expression is stimulated through\nmusic* drama* and story in the ’Let’s Draw8 lessons. One of the most popular with\nadults as well as school children is the ’Afield with Ranger Mac’ series on nature and\nconservation conducted by Wakelin McNeel* state I4.-H Club leader and chxef of the jun¬\nior forest rangers."
}