{
  "id": "d1716-33",
  "text": "THE NAEB TAPE NETWORK\nPrepared by Richard Rider\nNAEB Tape Network Manager\nUniversity of Illinois, Urbana\nENGINEERING CONFERENCE\nNetwork Headquarters and member stations have long been aware of the technical short¬\ncomings in our operation. Tape recording, and mass duplication in particular, present\nmany complicated problems. In an effort to provide a broad base while working toward\na solution of these problems an engineering group meeting was held January 3 and I;.\nThose participating were;\nJack H. Stiehl, Chief Engineer, WHA\nNorris E. Grover, Chief Engineer, WKAR\nAndy Andresen, Chief Engineer, WBEZ\nRalph Townsley, Chief Engineer, WBAA\nBerten A. Holrriberg, Chief Engineer, KUOM\nRobert H. Johnston, Recording Engineer, Tape Network\nRobert Von Behrins, Research Engineer, Minnesota Mining &\nManufacturing Coup any\nC. G. Barter and John Hines, Magnecord, Inc.\nThe recommendations of the group are being re-worked and re-written. In the near future\nthe chief engineers of all stations will receive a detailed formulation of technical\nstandards for the Network. Management and program personnel will be informed of all\nthe implications of these standards to program acceptance and the use of NAEB tapes*\nIncluded will be positive steps to assist stations in standardizing head alignment and\ntiming of tape recorders.\nWe are confident that this will be a positive start in our program to materially up¬\ngrade the mechanical quality of Network programs.\nPROGRAM COMMITTEE MEETINGS\nOn pages 3 through 8 of this issue are the major recommendations and statements of the\nNetwork Acceptance and In-School Program Committees which met jointly on February ?<>\nand 9 at Purdue University. By now, most of you will have received a somewhat more\ndetailed report of these recommendations.\nIt is felt that these meetings provide a working base on which to build long range pro¬\ngram plans. It is most stimulating to get representatives of several stations together\nand discuss programming standards and needs.\nMember stations will soon be receiving memoranda and survey questionnaires pursuing\nthe program ideas considered by the committees."
}