{
  "id": "d260-68",
  "text": "Problems\nlarger-tlnan-usual classes, gain\nmore time to prepare lessons, md\nwork with individual students and\nsmall groups, etv facilitates the re¬\nscheduling and variations in class\nsize such arrangements require.\nThe quality of teaching—Better\nuse of teaching talents, partly\nthrough etv, frees many school and\ncollege teachers of the necessity of\nrepeating each lesson to several\nclass sections, gives them more\ntime to keep up with their fields,\nsupervise student activities, meet\nwith supervisors, correct papers,\nand do other tasks for which the\nschool day leaves little time.\nThe training of teachers—Teach¬\ning is one of the few professions\nwhose practitioners rarely see each\nother’s work. By permitting teach¬\ners to watch one another in action,\netv is a new avenue to the teacher’s\nprofessional growth. Also, many\nThe Learning Lens: V\n32\nture, but wouldn’t for nine or ten separate sec¬\ntions. I’ve shown films of Pavlov at work. We used\na chimpanzee for an experiment in animal psy¬\nchology, and a fire official discussed the use of\nlie-detection techniques in arson investigations.\nOnce, while the course was dealing with child\ndevelopment and the case of Helen Keller, an\neight-year-old blind and deaf girl and her teacher\nconsented to come to the studio. The studio was\na strange environment for the girl. She started\nwalking around, touching things. The camera fol¬\nlowed her, giving a kind of powerful immediacy\nto the scene that you couldn’t possibly achieve\nin a classroom. That sequence was taped, and\nthree years from now the girl and her teacher\nplan to come back. Classes then will have a chance\nto see how her development has progressed.\n‘ ‘ Televised instruction shifts more responsibility\nto the student for learning, instead of his being\nspoon-fed. And ETV is not starkly impersonal.\nIn a way, it goes beyond face-to-face contact be¬\ncause it is literally eye to eye. Students have\noccasional personal conferences, considerable cor¬\nrespondence, and frequent telephone talks with\nme. Some of our televised courses have arrange¬\nments for discussions with proctors in the class¬\nroom. Too many questions in the so-called stimu¬\nlating interchange in the classroom are simply\nclarification of small points. Questions by tele¬\nvision students tend to be more fundamental,\nindicating that they are clearing up points of fact\nthemselves and going beyond to the difficult job of\nproblem solving, reasoning, and analysis.”"
}