{
  "id": "d260-75",
  "text": "Virtually every one of the 16,500 students in\nthirty-seven of the county’s elementary and sec¬\nondary schools receives at least one period of tele¬\nvised instruction daily. The Washington County\nETV system has 74.3 miles of coaxial cable reach¬\ning into schools ranging from the ultra-modern\n1,500-pupil North Hagerstown High School to the\ntwo-room, forty-five-pupil school in rural Beaver\nCreek. Since it is a closed-circuit system, more\nthan one course at a time can be telecast. The\nsystem has six channels and telecasts a total of\n125 lessons a week in all twelve grades and in\nall major subjects.\nBut with regard to the goals, operations, and\neffects of televised instruction, the Washington\nCounty project is similar to other school systems\nin that it closely coordinates ETV with classroom\nteaching.\nThe only course in which instruction is entirely\ntelevised is “Math for Mathematicians,” which\ndeals with the elements of calculus, analytical\ngeometry, and other college-level mathematics.\nThe course is an advanced, difficult elective in\nwhich only sixty-five students in four high schools\nin the county were enrolled in the 1959-60 school\nyear. In outlying Hancock High School, only\nthree students were enrolled; without television,\nno single school could likely spare a teacher for\nsuch a small number of students. In most of the\nclassrooms where the course is televised, no teach¬\ners are present. It is broadcast Monday, Wednes¬\nday, and Friday. On Tuesday and Thursday, the\nteacher visits the high schools in rotation for\nreview, testing, and discussion with students en¬\nrolled in the course.\nThe Hagerstown project headquarters, Television\nCenter, began in a corrugated metal shed and\nnow has five studios, offices for twenty-six tele¬\nvision teachers and supervisors, an art studio, and\nrooms for film storage and equipment —14,000\nsquare feet in all. The atmosphere is a blend of\na busy broadcasting center and an academic set¬\nting. Charts, maps, textbooks, laboratory equip¬\nment, and blackboards are arrayed among daz¬\nzling klieg lights and electronic gear. Tacked on\na wall of a cubicle housing the videotape machine,\nas shown in this photograph, is a note of Robert\nBurns’ wish come true two centuries later:"
}