{
  "id": "d1300-1",
  "text": "R,B.H.~38\nHAEB PUTS UP ITS PUKES\n(Prom — THE BILLBOARD, October 23, 1948)\nBattle Lines Set at Meet in Champaign\nHull ffins Pirat Skirmish\nChicago, Oct, 16.-- If tbs country8» educational broadcasters are to win their\nfight to service* one third of the population which, surveys hare indicated, i»\ndissatisfied with commercial radio, they must win a major bat;l© within the next\nyear* This became apparent at th© 22nd annual meeting of the National Association\nof Educational Broadcasters (HAE3) in Champaign, Ill., this week. Battle linos\nwere clearly drawn at the meeting with opposition from commercial broadcasters\nexpected on on© flank. On another ia a fight within th© MSB , with on© element,\nth© progressive fore® now in power, favoring th© establishment of a network,\nhiring of an executive secretary, doubling of duet an-1 other aggressive action.\nStill another group is satisfied to remain status quo.\nfirst skirmish was won by th© progressive element when?. Dick Hull, head of radio\nfor Iowa State College and its station WO I at Awes, was re-elected president,\nwith th© board of directors and membership okaying his expansion plans. Hull3©\nattitude can b© summarized by two statements he made at th© meeting.\nuTh@ next year is the one in which w© are going to hare to discharge our obliga-\ntion to bring one-third of th© American radio audience th© public service program\nraing it cannot find on tbs air today, * he said, #We 9;re going to have to get\ntogether If we3 re going to he more than a curie si ty on th© scone, \"\nType of opposition educational broadcaster® can eatpeci from outside their own\nrank© was indicated by reports that a former FCG commissioner was interested la\ntrying to.have 20 HU channels presently assigned to educators taken away and\ngiven to potential commercial telecasters.\nFights Mov©\nAgainst this mors and others of a similar typo the MSB expects to fight vigorously.\nResolutions passed at th© meeting called for th© setting up of a Washington office\nto protect MEB interests, the eventual hiring of a full-time executive secretary\nand ar rang ©assents for an intensive publicity and promotion campaign. Indicative,\naim, was the board's resolution stating that MSB policy would be based on a\ndecision to petition the FOG to reserve some television channels in the U-E-F\nband for eventual use by educational stations* even th© educational Institutions\nmight not be in a position to use these channel a for years. Behind latter point\nwas th© reasoning that such channels are comparable to natural, resource® and\nshould be reserved for us» by institutions publicly ovned or backed,..\nm b®%\nEstablishment of an educational FM network received much consJ deration at th©\nthree-day mestix*g October 10-12. After opposition from soma members it was decided"
}