{
  "id": "d1300-3",
  "text": "R.B.H.-39\nTELEVISION - RADIO\n3com dows man that ivory tower8\nTHEMES EDUCATIONAL BROADCASTERS CONVENT IOR\nUrbasja* III-# October 12\nTh® Association of Educational Broadcasters in conventioa her© adopted a resolu¬\ntion yesterday (11) In favor of strong representations to the PCG to reserve\ncertain television channels for educational and non-profit purpo&os.\nIt was pointed out that non© Is now so reserved and fueling was expressed that\nthe procedure following in keeping fM frequencies for this purpose could be\nfollowed la TV.\nTo Establish Standards\nUrbana, Ill., October 12\nla sharp contrast to the ivy-wallrd aeadetaio atfuoephere of 111 Xante University,\n50 station operators opened the 22ad mooting of the National Association of\nEducational Broadcasters, Sunday (10) with a hard-headed, huolneso approach to\ntheir problems. Dominant tone of the conclave i® that educational, radio must\ncome down from its ivory tower la order to compete for audiences and public\nsupport.\nInitial, project for th© SAEB will be the job of getting up standards for new\neducational stations as well as standards for professiooal teaching qualifica¬\ntions in more than TOO college® offering couries In radio and television. Many\nMSB are burned over th® fact- that th® national Association of Broadcasters stole\na march la th® latter category by setting up the University Association for\nProfessional Radio Education.\nNAE3 Is also mulling plan® to establish central headquarters in Washington to\nact as legislative coordinator and keep member stations informed of JfGC actions\naffecting them. Some talk was also heard of employing a full time executive\nsecretary, a parttim© post now held by Morris Sbvik, N.Y. radio consultant,\nnecessity of creating & director of research for audience survey# on effective¬\nness of educational stations was also discussed.\nKeynote of th® organization was sounded by Richard Hull, MAID proxy, who sai&s\nwNAIB6s objective is for th® raor® than 50 aenfeer stations to provide program\nservice in term* of the special interest of U.S„ regions and cities. No long¬\nhair effort, NAEB points to member stations such & KOAfi, Oregon; WIG, N.Y.;\nWEAR, Michigan; WOI, Iowa, which are commanding a large share of regional audi¬\nence® and ar® promotional-minded and publicity conscious.®\nProposals were also drawn up for a transcription network linking present AM and\nBM station# owned by city boards of educations and universities.. Suck a move\nwould provide pro grass covsrag® for to major population area# in the U.S.\n— 1*0® VARIETY\n(Wednasdsy, October 13, 1948)"
}