{
  "id": "d1546-0",
  "text": "A E B\nmt\nm\nEngineering Newsletter\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 GREGORY HALL SEPTEMBER, 1957 URBANA, ILLINOIS\nTV TECHNICAL TIPS (July)\n—By Cecil S. Bidlack, NAEB TV Engineer\nNews of the month centers around publications of the\nEngineering Service. A two-page mailing of additions\nto the NAEB Test Equipment Inventory was sent to\nall chief engineers on our mailing list on June 12. The\nJune Engineering Newsletter is at the printers and\nshould be in the mail by the end of the week.\nIncluded with thp ENL is a four-page list of ad¬\nditions and corrections to the NAEB Technical Di¬\nrectory. This brings the February 1 directory up to\ndate as of June 1. We urge you to help us keep this\ndirectory up to date by keeping us informed of\nchanges on your technical staff. Many times, the only\nnotice we have of a person’s departure is the return\nof mailing by the post office. When this happens, we\ndelete the name from our mailing list.\nThe June ENL also features an article by James\nR. Leonard, chief engineer of WCET in Cincinnati,\nOhio. He gives constructional details of an electronic\nsync device for double system kinescope recordings\nwhich is incorporated in their Stancil-Hoffman S/5\nMagnetic Film recorder.\n* * * * *\nA second issue of a Staging, Lighting and Gra-phic\nArts Newsletter was also mailed this month. This we\npublished with Dick Lawson of the WILL-TV staff.\nThe June 10 issue contains an article by Bob Peary\nof the TV staff of the University of Alabama on the\n“Selection of Title Printing Equipment for TV.” It\nalso has a revised edition of an article by George\nMurphy of the TV Studios of the Alabama Polytech¬\nnic Institute on “Slide Making for Television.”\nWe know that our mailing list of staging, lighting\nand graphic arts personnel is far from complete. Ad¬\nditional copies of this newsletter are available which\nwe’ll be glad to send to those interested. If you wish\nyour name on the mailing list, we’ll be glad' to include\nit.\nNAEB Engineering Newsletter\nSeptember 1957\nNAEB Engineering Newsletter, a quarterly publication is¬\nsued by the National Association of Educational Broadcasters,\n14 Gregory Hall, Urbana, III., $2 a year, edited by Cecil S.\nBidlack.\nDuring the past month we’ve received copies of\nthe thirty-one technical papers presented at the 1957\nNARTB Broadcast Engineering Conference in April.\nIf any if our readers are interested in the list, we’ll be\nglad to send them a copy. Most of these papers are\navailable from the authors upon request.\n*****\nThe new Spectra C-3 Brightness Spot Meter, just\nannounced, should prove to be a very useful tool for\nTV studios, especially for those making a serious at¬\ntempt to control brightness ratios. This instrument is\nentirely self-contained, being battery operated. A\nmaximum battery life of over 400 hours operating\ntime is claimed due to an automatic switch in the\npistol grip which turns the meter on when it is picked\nup and turns it off when it is put down.\nThe meter measures an approximate three degree\nangle of view although an area several times that\nbeing measured is seen through the eyepiece surround¬\ning the black dot which indicates the measured area.\nSpectral response closely matches the C.I.E. lum¬\ninosity curve. Full scale readings of 50, 500, 5000 or\n50,000 footlamberts can be obtained by the use of a\nrange control on the side of the instrument. Its cost\nis slightly less than $400.\n*****\nRCA tube engineers are working on a new one-\ninch vidicon tube similar to existing types but which\nwill have much higher sensitivity. The new tube can\nbe operated at higher signal electrode voltages than\ncurrent types and thus provide an appreciable in¬\ncrease in sensitivity. The new tube can be used for\n1"
}