{
  "id": "d1176-11",
  "text": "-11-\nJust for the sake of experiment and, perhaps, simplification of words, let us see\nif it is possible to make a more convenient selection of terminology for describing\nemulsion position. Let us assume that for’ lack of any better identification we take\nthe letters \"A” and \"B\" to denote the two types of emulsion position. Having done\nso let us try to make some decision as to which of these might most appropriately\ndenote \"Standard Emulsion Position” and which one would be \"Non-Standard Emulsion\nPosition,\" In shopping around for some basis for decision one cannot help but be\nintrigued by the fact that when we attempt to thread a roll of \"B Wind\" raw stock\ninto a standard projector, the unexposed emulsion is in the \"Standard\" position.\nConversely, the opposite is true for \"A Wind\" stock. Upon first inspection this\ndoes not seem to have any particular significance since such stock is uhexposed.\nHowever, accepting this similarity for whatever it is worth let us draw upon the\nfact by substituting the term \"A Wind Emulsion Position\" for the term \"Non-Standard\nEmulsion Position.\" Likewise we will substitute the term \"B Wind Emulsion Position\"\nfor the term \"Standard Emulsion Position.\"\nAt this point it would seem that even a further change is possible. Since we have\ndecided to use the letters \"A\" and \"B\" for describing both \"x*ind\" and \"emulsion po¬\nsition\" let us drop this latter term entirely and refer to all l6mm, film stocks as\nbeing either \"A Wind\" or \"B Wind,\" irregardless of whether they be raw or exposed,\nnegative or positive, single or double perforated etc. Such a step has the effect\nof creating a new and needed identification which describes a film in terms of both\nits emulsion position as well as its wind, wherever applicable.\nNow, let us see what happens when we try to apply the foregoing definitions in actual\nfilm practice. First let us recognize the fact that double perforated raw unexposed\nfilm has no particular \"wind\" designation and accordingly can be considered as \"A B\nWind\" or more simply \"universal\" wind. This is true only up until the time that it\nis run through a camera or a printer, after which it definitely acquires according\nto our new definition a \"wind\" designation of either \"A\" or \"B.\" In the case of cam¬\neras, this \"wind\" designation would be alifays \"B.\" In the case of contact printers,\nthe resulting \"wind\" designation will be determined by two interlocking factors\nwhich, on one hand, involves the order of the printing operation as to \"Heads First\"\nor Tails First,\" and on the other hand involves the type of single sprocket raw\nstock which the printer is designed to handle. This is true even though the printer\nmay be loaded with double sprocket stock since the printer has only a single sprocket\ndrive.\nAnother point which must be recognized is the fact that in all contact printing op¬\nerations a negative of a particular \"wind\" will always produce a print of the oppo¬\nsite \"wind.\" Provided that one observes the simple, memorizable rules which will\nfollow herewith, no condition should arise which will produce an ambiguous release\nprint of a type which cannot be projected to produce proper vertical and horizontal\nimage symmetry as well as proper sound and time sense.\nApplying Proposed Terminology\nAfter making the indicated changes in terminology our rules for determining film\n\"wind\" by inspection of processed stock are as follows:\n\"A Wind Film\" - Hold up a piece of film vertically with the top of the picture\nupward. Left and right picture detail appear normal only when the emulsion\nsurface is toward the eye. (In the case of 16mm. sound film the sprocket holes\nwill be on the left)."
}