{
  "id": "d1176-16",
  "text": "-16-\nDATA ON EASTMAN 737k NEGATIVE FILM STOCK\nby Keith K. Ketcham\nChief Engineer, WOI-AM-FM-TV\nHere is a brief analysis of the new Eastman Kodak 737k film stock which we feel has\namazing possibilities for kinescope recording negative work. The sensitometric plots\nshow the characteristics of the 737k negative stock in Figure 1, the 7302 stock in\nFigure 2, and print through sensi in Figure 3.\nFirst of all, let me say that the reproduction on this film stock, printed in accor¬\ndance with the attached, far exceeds any other method we have used in regard to tonal\nreproduction, both from the standpoint of viewing the picture and as shown from the\ncurves in Figure 3. There is very little curvature, although some is evident in\nboth the black and white end of the picture. By comparing this print through sensi\nwith those of the 7302-7302 or the 7373-7302 process, we find this one to have essen¬\ntially a linear range from the usable black to the usable white as compared with\nthese other processes.\nThe plot of Figure 1 represents the measurements of a 21 strip sensitometric exposure\nat the head of a strip of Eastman Kodak 737k film. There are only 19 points plotted,\nsince the remaining three points were down near base density and were of no interest\nto us. We then exposed this film to a negative electronic grey scale, consisting of\n10 equal steps of black and xdiite. Our original intention was to obtain an over-all\nsensi density range of near 1,0, which we did, in that the zero per cent step gave\na density of 0.18 and the 100$ white step gave a density of 1.18 (1.18 - 0.18 is\n1.0), Allowing for a nominal 10$ setup in the video picture, and realizing, as a\npractical matter, that the setup in a picture may vary from five to ten per cent,\nwe pegged our black level at the ten per cent step giving a density of 0.33. This\nwas done using a GPL machine having a 10-NP-ll transcriber tube, operating at 25,000\nvolts on the anode. The camera was operated with a lens stop of F-2#0, and the peak\nto peak driving voltage applied to the grid from the electronic grey scale was 18\nvolts.\nThe nominal gamma of this developed negative Eastman Kodak 737k was 1.0.\nFigure 2 shows a partial sensitometric plot of the print stock used in this particu¬\nlar test. In this case, Eastman Kodak 7302, processed to a gamma of 2.50 was used.\nHere, again, you will note that only 13 of the 21 steps have been plotted, since we\nwere not interested in exposures near base density and were trying our utmost to\nsteer clear of this region. Figure 3 is a plot of the negative sensi printed througi\nthe positive release stock and shows a total maximum density variation at the par¬\nticular parameters used of 0.05 to 2.15.\nIn a release entitled \"Specifications for Motion Picture Film Intendedjfor Television\nTransmission\" by Charles Townsend of NBC-TV in New York, we glean the following in-^\nformation. The release print stock should have a density range of approximately 1.5\nand should nominally range between O.k and 1.9. You will note that the zero per\ncent blanking region, as originally exposed on the negative stock, gave a density of\n1.95 on the print stock and the 100$ blanking (white level) over-shot our mark a\nlittle bit and hit 0.30 at 100$ blanking (white level)."
}