{
  "id": "d1176-2",
  "text": "■2-\nThe Audio Engineering Society’s annual convention is scheduled for\nOctober 12-16 in New York City,\nWe regret that more of the names in our NAEB Technical Directory are\nNOT FOUND. IN THE DIRECTORIES OF THE THREE ORGANIZATIONS 'LISTED ABOVE,\nWEfD LIKE TO SEE THE CHIEF ENGINEERS OF OUR EDUCATIONAL RADIO AND\nTELEVISION STATIONS MEMBERS OF ONE OF THESE PROFESSIONAL SOCIETIES,. ..\nEach of these societies publishes a Journal containing technical pa¬\npers PRESENTED AT CONVENTIONS OR MEETINGS OF THE SOCIETY. MUCH TECH¬\nNICAL REFERENCE INFORMATION IS FOUND ONLY IN THESE PUBLICATIONS. AT¬\nTENDANCE AT THEIR TECHNICAL MEETINGS CAN BE VERY STIMULATING. fT MAY\nINTEREST YOU TO KNOW.THAT YOU CAN BELONG TO ALL THREE OF THE.SE ORGANI¬\nZATIONS, FOR LESS THAN THE PRICE OF HALF A PACK OF CIGARETTES PER DAY .\nWe*D BE HAPPY TO TELL YOU WHERE YOU CAN GET MORE INFORMATION ON MEM¬\nBERSHIP.\nWOSU-TV, the Ohio State University television station on Channel 3kt\nSHOULD SOON HAVE A TEST PATTERN ON THE AIR, We SPENT FOUR DAYS THERE\nTHE WEEK OF AUGUST 15 HELPING BOB HlGGY WITH THE INITIAL TESTS OF THE\nWOSU-TV VIDEO EQUIPMENT. THE STUDIO BUILDING IS COMPLETE, THE TOWER\nAND ANTENNA WERE INSTALLED A YEAR AGO. THE TRANSMITTER IS NEARLY\nREADY' TO GO WITH* CAVITIES ON HAND TO BE INSTALLED AND COMPLETION OF\nTHE TRANSMISSION LINE I S' AWAITING THE ARRIVAL OF THE F I L T ER PL E X ER .\nWOSU-TV is Completely RCA equipped with the exception of a GPL kine—. .\nSCOPE RECORDER. OFFICES, AIR-CONDITIONED STUDIOS .AND TRANSMITTER\nARE LOCATED IN 'A' NEW BUILDING ON THE UN I V ER S I T Y ■ F ARM A.LITTLE OVER A-\nMILE FROM THE M'A I N‘ CAMPUS THE UNIVERSITY SHOULD. BE VERY PROUD OF\nTHESE FINE T E L E V I S 1 O N' F A C I L I T I E S . It IS HOPED THAT WITHIN THE NEXT\nTWO YEARS AN ADDITION TO THIS BUILDING WILL BE CONSTRUCTED TO HOUSE\nTHE WOSU-AM-FM STUDIOS AND STAFF. THIS WILL ENABLE WOSU TO LEAVE\nTHE ^TEMPORARY*’ FACILITIES BUILT OVER 2^ YEARS AGO AND REMODELED.. MANY '\nTIMES IN THE INTERVENING YEARS.\nWE RECENTLY RECEIVED A REVISED EDITION (DEC. 1, 1 95lj-) OF PART I^.OF\nthe Federal1 Communications Commission’s Rules’and Regulations cover¬\ning Commercial Radio Operator’s Licenses. . With reference to Section\n13.28 RENEWAL SERVICE REQUIREMENTS, RENEWAL EXAMINATIONS, AND EXCEP¬\nTIONS, WE BELIEVE ALL HOLDERS OF COMMERCIAL RADIO OPERATORS* LICEN¬\nSES WILL BE INTERESTED IN THE FOLLOWING NOTE AT THE END OF THIS SECjlON.\n\"Bv order °ated amd effective April k, 1951, THE Commission temporarily\nWAIVED THE REQUIREMENT OF PRIOR SERVICE AS RADIO OPERATOR OR EXAMINA¬\nTION FOR RENEWAL IN THE CASE OF ANY APPLICANT FOR RENEWAL OF HIS COM¬\nMERCIAL RADIO OPERATOR LICENSE. THIS ORDER IS APPLICABLE TO COMMER¬\nCIAL RADIO OPERATOR LICENSES WHICH EXPIRED AFTER JUNE 30, 1950, UNTIL\nFURTHER ORDER OF THE COMMISSION.\""
}