{
  "id": "d1176-3",
  "text": "-3-\nTV Technical Tips No. 13\nOctober, 1935\nBy Cecil S. Bidlack, NAEB TV Engineer\nThe 1955 NAEB TV Engineering Workshop, made possible by a grant from\nthe Fund for Adult Education, is now history. Representatives from\nEIGHT EDUCATIONAL STATIONS NOW ON THE AIR ATTENDED AT THE WORKSHOP.\nOthers in the group were from stations' under construction or in plan¬\nning STAGE.S AND FROM CLOSED CIRCUIT STUDIOS.\nIn OUR OPINION, THE 1955 WORKSHOP WAS BETTER THAN THE 195^4* WORKSHOP IN\nMANY WAYS. BUT SINCE WE MIGHT BE SLIGHTLY BIASED, PERHAPS WE SHOULD\nAWAIT THE WRITTEN COMMENTS FROM THOSE ATTENDING, RESTRICTING OURSELVES\nTO REMARKING NOW MERELY THAT WE RECEIVED MANY FAVORABLE COMMENTS FROM\nTHOSE IN ATTENDANCE. THE ENGINEERING COMMITTEE IS TO BE CONGRATULATED\nupon its choice of WKAR-TV as the Workshop site. With the excellent\nCOOPERATION OF THE WKAR-TV STAFF, THE PROGRAM MOVED AT A FAST PACE.\nWITH SOME DIFFICULTY, WE KEPT PRETTY YfELL. ON SCHEDULE, PROVIDING AN\nOCCASIONAL BREAK (UNSCHEDULED) IN THE DAYTIME SESSIONS AND STILL\nSEEING THAT SPEAKERS RECEIVED THEIR ALLOTTED TIMES.\nIn SPITE OF THE FACT THAT OUR DAY BEGAN AT 8 A. ft/1. AND RAN UNTIL 9\nOR 9:30 P. ft/I., WITH RUMP SESSIONS LASTING MUCH LATER, ATTENDANCE WAS\n100> FOR THE WEEK WITH VERY FEW TARDY ONES FOR THE MORNING SESSIONS.\nOF THE TWENTY-FIVE WHO RECEIVED WORKSHOP GRANTS, ONLY BOB HlGGY OF\nWOSU-TV WAS UNABLE TO BE PRESENT. HE REMAINED IN COLUMBUS IN ORDER\nTO GET WOSU-TV ON THE AIR WITH TEST PATTERN. DAN JACOBSON OF THE\nBroadcast Bureau of the FCC attended as an invited guest as did\nCy Braum of tHE JCET.\nTwo DA‘YS OF THE WEEK’S PROGRAM WERE DEVOTED TO KINESCOPE RECORDING, I\nWITH LIGHTING, TRANSMITTERS, MICROWAVE, FILM, SWITCHING, AND STUDIO\nEQUIPMENT, AS WELL AS PERSONNEL RELATIONS, RECEIVING ATTENTION, OUR\nSPEAKERS WERE FROM TELEVISION EQUIPMENT MANUFACTURERS, ALLIED SERVICES,\nTHE NETWORKS, AND OUR OWN EDUCATIONAL STATIONS AND INSTITUTIONS. THEY\nALL DID A FINE JOB AND WE CAN BE PROUO OF OUR EDUCATIONAL TV PERSONNEL\nWHOSE TALKS AND THE TECHNICAL INFORMATION THEY IMPARTED WERE ON A PAR\nWITH THE OTHER SPEAKERS ON THE PROGRAM. IN MY OPINION, IT WILL BE\nA CHALLENGE TO KEEP THE PROGRAM OF FUTURE WORKSHOPS, IF SCHEDULED, ON\nA LEVEL WITH THE ONE JUST CONCLUDED,\nThe Fall General Meeting of the AIEE (American Institute of Electri¬\ncal Engineers) will be held October 3“7 AT THE ft/ioRRisoN Hotel in\nChicago. The Broadcast Group of the AIEE will devote its entire time\nOctober U to the topic of closed circuit TV. One of the speakers\nwill be Carl IWenzer, Director of WSUI and KSUI and Chairman of the\nNAEB Engineering Committee."
}