{
  "id": "d1176-4",
  "text": "-li-\nAnd while we're on the topic of closeo circuit TV, did you know that\nTHERE ARE NOW BETWEEN 1,000 AND 1,500 INSTALLATIONS OF INDUSTRIAL\nCLOSED CIRCUIT TELEVISION? MOST OF THESE ARE RELATIVELY SIMPLE SINGLE\nCAMERA INSTALLATIONS, ALTHOUGH SOME ARE MORE ELABORATE AND A FEW ARE\nEQUIPPED FOR COLOR • THE TV EQUIPMENT MANUFACTURING INDUSTRY BELIEVES\nTHAT A BOOM IS NEAR IN INDUSTRIAL TV. At PRESENT, THE LARGEST USER\nIS THE UTILITY INDUSTRY WITH RAILROADS, BANKS AND THE STEEL INDUSTRY\nALSO IN THE FIELD. HOWEVER, THE POSSIBILITIES ARE ALMOST UNLIMITED AND\nWITH EVERY CURRENT INSTALLATION SAVING MONEY, INCREASING EFFICIENCY,\nOR ELIMINATING DANGER, IT IS BELIEVED THAT WITHIN THE NEXT FIVE TO\nTEN YEARS INDUSTRIAL TV COULD BECOME A 5 TO 10 MILLION DOLLAR BUSINESS.\nMore than twenty manufacturers are now producing this equipment built\nAROUND THE FEATURES OF LOW COST AND RUGGEDNESS OF THE VIDICON PICK\nUP TUBE.\nCy BrAUM OF THE JCET IS REVISING THE JCET LIST OF CLOSED CIRCUIT TELE¬\nVISION FACILITIES IN USE AT EDUCATIONAL INSTITUTIONS. If YOU HAVE\nCLOSED CIRCUIT FACILITIES AND ARE NOT INCLUDED IN THIS LISTING OR DO\nNOT RECEIVE HIS QUESTIONNAIRE INTHE NEAR FUTURE, HETD BE GLAD TO HEAR--\nFROM YOU. CY HAS ALSO RECENTLY PREPARED AN EXCELLENT PAMPHLET ON\n\"Low Cost Educational TV Stations.\" He'd be glad to send you a copy\nUPON REQUEST. YOU MAY ADDRESS HIM AT 17^5 MASSACHUSETTS AVENUE, N.W.,\nWashington 6, O.C.\nNote for the West Coast! RCA is holding its 9th Color TV Seminar in\nSan Francisco on Friday, October 28 and Saturday, October 29. The\ntwo-day course will consist of technical lectures ano demonstrations\nof the latest color techniques and equipment. Through the courtesy of\nKUON-TV THE LIVE COLOR CAMERA and 3-V, FILM CAMERA DEMONSTRATIONS\nWILL BE HELD IN THEIR STUDIOS, RESERVATIONS MAY BE MADE THROUGH YOUR\nRCA Broadcast Field Representatives.\nHave a note from Wallace Garneau, Director of Broadcasting at WMCR-\nWestern Michigan College of Education at Kalamazoo, Michigan which\nsays, WMCR has for sale a 250 watt General Electric FM transmitter,\na 2-bay General Electric antenna, and an 8-bay Western Electric clover\nLEAF ANTENNA (lj.200 POUNDS). THE TRANSMITTER IS FIVE YEARS OLD, IS\nIN GOOD CONDITION AND WAS GIVING US FINE SERVICE WHEN WE CHANGED TO\n36,000 WATTS POWER. HERE IS AN OPPORTUNITY FOR A 10-WATT STATION TO\nINCREASE ITS POWER AT A TREMENDOUS SAVING. THE TRANSMITTER IS TUNED\nTO 91 MEGACYCLES. WMCR INVITES BIDS ON THE EQUIPMENT.\n\"IT MIGHT BE VERY HELPFUL IF A SECTION OF THE NEWSLETTER WERE DEVOTED\nTO AVAILABLE EQUIPMENT FROM MEMBER STATIONS, A NUMBER OF WHICH ARE\nINCREASING POWER.\""
}