{
  "id": "d1176-5",
  "text": "■5-\nWe!d be happy to include items such as the above or an \"Equipment\nWanted\" column. Our biggest problem is to get the information regard-\nING WHAT IS FOR SALE AND WHAT IS WANTED. . NEWSLETTER DEADLINE IS THE.\n25th of the month; so get your items in before that DATE.\nDuMont is now filming the Jackie Gleason series on the Electronicam\nSYSTEM, USING 35 MM FILM. THE SYSTEM WAS DEVELOPED BY JAMES L. CADDIGAN\nof DuMont and includes a specially designed Mitchell motion picture\nCAMERA WITH AN IMAGE ORTHJCON TELEVISION CAMERA IN A SINGLE OPERATING\nUNIT, AN OPTICAL SYSTEM SPLITS THE LIGHT SO THAT IT IS SHARED BY THE\nFILM AND ELECTRONIC PICK UP SECTIONS AT THE SAME TIME.\nUsing a TV technique, it is possible to film Gleason*s half-hour pro¬\ngram WITH A TWO-HOUR AFTERNOON REHEARSAL PERIOD FOLLOWED BY AN EVENING\nPERFORMANCE BEFORE A LIVE AUDIENCE. THREE 35 MM CAMERA UNITS ARE USED,\nPROVIDING SIMULTANEOUS IMAGES ON TV SCREENS AND ON FILM. THE DIREC¬\nTOR SELECTS THE SHOTS BY MEANS OF PUSH BUTTONS. By THE USE OF THIS\nNEWLY DEVELOPED SYSTEM, IT IS POSSIBLE TO RECORD A SHOW IN ONE TENTH\nTHE TIME REQUIRED USING STANDARD MOTION PICTURE TECHNIQUES.\nBerten Holmberg, of the NAEB Engineering Committee, KUOfvi, and the Twin\nCity Area ETV Corporation, writes that he has recently received infor¬\nmation ON THE EXACT PROCEDURES FOR SWEEPING OUT GENERAL PRECISION LAB¬\nORATORY Camera Controls. They are also in receipt of a field modifi¬\ncation WHICH CORRECTS A TARGET BLANKING DIFFICULTY WHICH HE STATES WAS\nALMOST AN IDENTICAL VERSION OF THE ONE THEY DEVELOPED TO TAKE CARE OF\nTHIS MATTER IN THEIR CAMERA.\nThis brings upa service which we hope all of you are aware of. Most\nTELEVISION EQUIPMENT MANUFACTURERS FIND IT NECESSARY TO MAKE MODIFICA¬\nTIONS TO EQUIPMENT AFTER IT IS IN THE HANDS OF BROADCASTERS. YOU SHOULD\nAUTOMATICALLY RECEIVE THESE MODIFICATIONS WHICH HAVE BEEN FOUND NECES¬\nSARY TO ELIMINATE MAL—FUNCTIONING WHICH MAY NOT HAVE BEEN OBSERVED\nWHEN THE EQUIPMENT WAS DEVELOPED AND WHICH, THROUGH USE, BECOMES AP¬\nPARENT. If YOU ARE NOT RECEIVING OCCASIONAL DATA FROM THE MANUFACTURER\nOF THE EQUIPMENT YOU ARE USING, WE SUGGEST YOU ASK TO BE PLACED UPON\nTHEIR MAILING LIST TO RECEIVE ANY AND ALL MODIFICATIONS TO IMPROVE THE\nOPERATION OF EQUIPMENT.\nRCA publishes a \"Technical Bulletin, Maintenance ano Modification notes\non RCA Broadcast Equipment.\" General Electric publishes \"Broadcast\nEquipment Product Service Digest.\" No doubt DuMont, GPL and other\nEQUIPMENT MANUFACTURERS PUBLISH OCCASIONAL BULLETINS OF THE SAME TYPE\nON THE IR EQUI PME NT.\nIt WILL SAVE YOU MUCH TIME AND EFFORT IF YOU RECEIVE THESE MODIFICATIONS\nOF YOUR EQUIPMENT, DON * T THROW THEM IN A DRAWER AND FORGET ABOUT THEM.\nThey are issued only to help you get the best from your equipment."
}