{
  "id": "d1176-6",
  "text": "-6-\nTV Technical Tips No. llj.\nNovember, 19£5>\nBy Cecil S. Bidlack, NAEB TV Engineer\nThis column will of necessity be brief and in keeping with the remain¬\nder of the November Newsletter. First, the deadline for copy has\npassed and before we know it another deadline will be staring us in\nthe face. Second, we were traveling twenty-three of October^ thirty-\none DAYS WITH ONLY TWO DAYS BETWEEN OCTOBER 4 AND 31 IN THE OFFICE,\nWHICH IS HARDLY ENOUGH TO GET BACK INTO THE ROUTINE, MUCH LESS GET\nOUT THIS COLUMN.\nBriefly, we spent October i{. IN Chicago at the AIEE meeting on Closed\nCircuit TV, the 5th at Fordham University to discuss their proposed\nCLOSED CIRCUIT V IDI CON INSTALLATION, AND OCTOBER 6 AND 7 AT THE ! SMPTE\nMEETING IN LAKE PLACID. A PORTION OF THE MORNING SESSION ON THE 7™\nWAS DEVOTED TO EDUCATIONAL TELEVISION WITH PAPERS BY MrS . G . G*. t\nBroderick of the U.S. Office of Education, Art Hungerford of META,\nNew York City, and Allen DeLand of ETRC. October 10 we spent in Bos¬\nton IN THE VERY FINE STUDIO OF WGBH-T V-Ffl/i. OCTOBER 12-15 WE WERE\nback in New York attending the Technical Sessions of the Aduio En¬\ngineering Society where we presented a paper on the operation of the\nNAEB Network on the i!|.th.\nDick Rider and yours truly spent October 19 in Lafayette, Indiana\nat WBAA with Jim Miles and Ralph Townsley going over their television\nstudio plans. Dick was returned to Champaign and eight p.m. on Octo¬\nber 20 found us in Tuscaloosa, Alabama with Graydon'Ausmus. We spent\nfour days with Joe Stuckey, UOA-TV Chief Engineerygoing over .'his in¬\nstallation and operation preparatory to their first program feed to\nthe Alabama network on October 31• We made a side trip to Auburn\nwhere we met Ed Wegener and George Murphy. They have a fine new\nbuilding which,like WGBH-TV, they have already outgrown and are seeking\nAVAILABLE SPACE ADJACENT TO THEIR PRESENT FACILITIES.\nOn our way to Chicago, October 25 we met Ken Christiansen of the South¬\nern Regional Education Board and the Atlanta Schools TV station.\nOctober 26-29 we attended the NAEB Convention in Chicago where Al\nPartridge put us to work as a projectionist.\nWe can’t mention the NAEB Convention without expressing a wish that\nmore engineers were in attendance. Going over the registration list\nwe found only six engineers registered. Of these, only two, Glen\nBishop of WMCR ano Carl Menzer of WSUI were from operating stations,\nTHREE WERE REPRESENTATIVES OF EQUIPMENT MANUFACTURERS. THE WRITER OF\nTHIS COLUMN COMPLETED THE LIST. WE BELIEVE THAT MANY TELEVISION\nENGINEERS WOULD HAVE BEEN, INTERESTED IN MANY OF THE SESSIONS ON TELE¬\nVISION. NO DOUBT THE RADIO SESSIONS WOULD HAVE BEEN INFORMATIVE TO\nTHOSE WHOSE!' PRIMARY INTEREST IS RADIO. THE THURSDAY AFTERNOON\nCONVENTION PROGRAM FEATURED A TOUR THROUGH THE SPACIOUS STUDIO FACIL-"
}