{
  "id": "d658-1",
  "text": "MICHIGAN STATE UNIVERSITY\nOF AGRICULTURE AND APPLIED SCIENCE • EAST LANSING\nMr. H. J. Skornia\nNAEB\nFact Sheet Service\n14 Gregory Hall\nUrbana, Illinois\nCONTINUING EDUCATION SERVICE\nDear Mr. Skornia:\nFirst off, I want to tell you the Fact Sheet Service is a reliable\nsource of information which we find very helpful. Thank you for it.\nIn reference to paragraph two of Fact Sheet Series IV, Number 7,\nDecember 1, 1955, under production procedures, I would like to say,\nthat we have used radio and television in simulcasts for a television\nseries, involving a panel of two experts and a moderator, dealing with\ntwo books which treated the same or similar subject matter. Listeners\nwere as much impressed as viewers but for different reasons and in\nvarying intensity. No formal research was made on this program.\nAnother incidence in which our radio station was used to augment our\ntelevision productions, occurred in the telecast credit course series\nof basic Literature and Fine Arts-music, last spring. One-half hour\nbefore the program was telecast, music of the period was presented by\nradio as a required segment of the telecourse credit program. This\nmade possible the inclusion of many musical selections illustrative of\nthe period to be discussed in the lesson. Students felt it provided\ngreat enrichment for the course. Direct line from the television studio\nto the radio station was used for the simulcast. Continuity linked the\nradio series and augmented the music telecast.\nThe simulcast was carried in the fall term of 1954, the music course\nwas telecast spring term, 1954. In our present schedule of planning,\nboth programs will be reissued in 1957.\nYou indicated in the Fact Sheet that you would like to have suggestions\nor comments concerning this correlation of radio and television so we\nwere prompted to send the information along to you.\nVery sincerely yours,\nTelevision Producer-Coordinator\nLEM:tmm\n\"IT 15 FOR US THE LIVING\nTO BE DEDICATED HERE TO THE UNFINISHED WORK\nLINCOLN"
}