{
  "id": "d658-52",
  "text": "13. Developing information which will explain the program to pupils, teachers and\nparents so that they will understand the purposes and values of using television\nfor instruction\n14. Developing information which would be helpful to other school systems interested\nin using closed-circuit television instruction\n15. Determining ways of using television in cooperation with teaching training in¬\nstitutions in the preparation of teachers\n16. Developing techniques in using television for training teachers to use television\nThe program to achieve these purposes will attempt to operate in typical school\nsituations using the regular teachers and resources of the system. Adequate special-\nlized and technical assistance will be provided as needed for planning, producing\nand evaluating the work. As new assumptions are made and new educational pro¬\ncedures developed and evaluated, safeguards will be constantly considered to make\nsure that each child will have a good program of education.\nClosed-circuit television facilities will be extended to all the schools of the county\nas follows:\n1 . Plans for the 1956-57 school year\nThe T. V. center at the Board of Education office, two senior high schools and\nsix elementary schools in Hagerstown, the Washington County Museum of Fine\nArts, and the Washington County Free Library are to be linked by coaxial cable\nin the first circuit. Telecasting is scheduled to begin with the opening of school\non September 10. (6,000 pupils)\n2. Plans for the 1957-58 school year\nExtension of circuits to include two high schools and thirteen elementary schools\nin the Hagerstown area, September 1957. (6,210 additional pupils)\n3. Plans for the 1958-59 school year\nExtension of circuits to include all the other county schools, five high schools\nand twenty elementary schools, September 1958. (5,790 additional pupils)\nA six weeks summer workshop will be organized to develop the initial program in the\nuse of television for instruction.\n-6-"
}