{
  "id": "d658-57",
  "text": "Surrey Elementary School\nThe Washington School\nThe Television Center at the Board of Education offices, the Washington County\nMuseum of Fine Arts and th^, Washington County Free Library are also included\nin this installation.\nDuring the next two years the circuit will be extended to include all forty-eight schools\nin the county.\nIt was decided to place enough television receivers in a classroom to allow one set for\nfifteen or twenty pupils, thus bringing each pupil into intimate contact with the screen.\nBEGINNING DIRECT INSTRUCTION BY TELEVISION\nTelecasting high school lessons began on September 11, 1956, by the use of temporary\nmobile equipment. The elementary instructional program was initiated on November 15,\n1956, for grades 4, 5 and 6, and the primary program for grades 1, 2 and 3 on December\n17, 1956.\nUp to the present, all telecasting has originated at the Television Center of the Board\nof Education. It will be possible, when equipment is available, to originate lessons\nfrom the North Hagerstown High, the South Hagerstown High, the Washington County\nMuseum of Fine Arts, and the Washington County Free Library.\nThe method of sending the picture and sound of the lessons to the schools is rather unique\nThe lessons originate in an area much like the conventional broadcast television studios.\nMulti-camera situations are used to provide a variety of predetermined \"shots\" portraying\nthe ideas which the teacher wishes to use. An ordinary microphone is used for the\naudio pick-up. Pictures and sound from films, or pictures from slides can be added to\nthe lessons as desired.\nThe video and audio signals are carried by coaxial line to transmitters installed by the\nC. and P. Telephone Company. These transmitters distribute the signals over coaxial\nlines to all of the schools in the circuit. By using transmitters operating on different\nfrequencies, it is practical to send several programs simultaneously over the cable. Pro¬\ngrams are currently being transmitted on channels 2, 4 and 6. Equipment has been\ninstalled at regular intervals to overcome line loss as signals are transmitted along the\ncable. The signals are therefore maintained at sufficient strength to service the schools\naround the circuit. Additional amplifiers, however, have been installed in each school\nto again strengthen the signal before it is sent throughout the building to furnish the sets\nwith enough signal for good viewing.\nSets in the classroom are tuned to the channel on which the program is supplied. This\nsystem makes it possible to use regular television equipment without modification. Since\nstandard equipment is less costly than custom made equipment, this is a considerable\nadvantage.\nThe diagram on the following page explains the distribution of the video and audio\nsignals to the schools in the closed-circuit.\n-10-"
}