{
  "id": "d842-10",
  "text": "Program 3\nProgram Title: \"A STUDY IN TECHNOLOGY”\nRecord Title: \"SURVIVAL\"\nMost of vis spend most of our time making things and using things that other\npeople have made. By making things, we have reached every part of the globe and\nhave established ourselves in the more difficult parts by changing conditions to\nsuit our needs. The ability to do this gives us our superiority over all other be¬\nings.\nThe mushroom cloud that is the symbol of our time can be traced back to man's\nfirst use of fire. We of the Western Civilization have surpassed all other people\nin what we have been able to make and do. Our conquest of time and space has been\ndazzling. We have opened up sources of power undreamed of a few generations ago.\nWe have shown what a creative and powerful being man is.\nBut our great accomplishments are built upon the creativity of man during the\npast half million years or more. Before there could be atomic energy there had to\nbe electricity and steam. Before there could be electricity and steam there had to\nbe high grade metallurgy. Before metallurgy could develop there had to be controlled\nfurnaces; before these, building materials to withstand fire. The inventions of\ntoday always rest upon those of yesterday in an intricate weaving of knowledge and\ndiscovery. No people have ever built a civilization from scratch. All have built\nupon the preceding civilizations.\nCertain inventions have been curcial in making us master of our environment.\nThe conquest of fire is the most heralded, and goes back as far as Sinanthropus,the\nape-man of China who dwelt perhaps 500,000 years ago. But some others are Just as\nimportant; tanning hides,making string, making inedible food digestible by cooking,\nthe shaping of wood and stone. Much later inventions like the bow and arrow extended\nman's range. Farming and herding lifted man from his dependency upon nature and\n^xper-1 mental Discussion Program Subject to Revision\n13"
}