{
  "id": "d842-11",
  "text": "made of him a creator. All of these things, of course, were invented by people who\nlived like the primitive people of today. It is upon these inventions that later\ncivilizations have been built.\nWe humans are not the only animal to make things — the bee makes his hive, the\nbeavers their dam, and the birds their nests, but they do this by instinct. Apes\nhave been watched using Bticks and stones as tools. They have even been able to\nmake tools from time to time in captivity. But the ape does not teach his young how\nto make tools or to use them. Only man has the ability to learn to make things and\nto pass on this knowledge by teaching it to his children.\nWe have inherited special equipment that makes this creative ability possible.\nOur hands can pick up a needle or heave a boulder. This remarkable versatility is\npossible because our hands do not have to be used to support our body. They are the\noriginal all-purpose tool. An important partner to the hand is the eye. No other\neyes are as well-equipped as ours. They can see in color; they can focus for range;\nthey have a delicate shutter arrangement to adjust for differences in light; and\nthey have an extremely fine-grained retina to give an accurate image.\nPerhaps the most important of these features is the \"stereoscopic visiorf which\ngives us the close calculation of depth by means of a range-finder much like those\non modern cameras. Try threading a needle or lighting a cigarette with one eye\nclosed,and you will soon discover the importance of focusing with both eyes on your\nwork. The hand and eye are tool-making tools.\nBut our ability to make things rests on something besides physical equipment.\nWe have the mental endowment as well. Modern science does not know what makes for\nthis special ability. Certainly learning is necessary, acid man does more learning\nthan other animals — but other animals do learn from experience. Some scientists\nbelieve that the human animal is more capable of \"insight\" than others — that Is,\nthey can\"see\"things that don't exist; they can imagine the relations between things\nbefore they have experienced them.\nSome apes have been able to solve problems. One psychologist put a banana out¬\nside a chimpanzee's cage beyond his reach. After a while the chimpanzee saw a stick\nlU"
}