{
  "id": "d842-19",
  "text": "Family Necessary\nEverywhere human beings have families. The family is necessary as a means of\ncooperation among men and women for procreation and rearing the young. Family life\nis always regulated by the culture, and people within that culture are expected to\nlive according to the established family pattern. But family organization every¬\nwhere is different. Not only are there different customs governing marriage, but\nthe set-up of family life, the relative position of men and women and their rights\nand duties vary from one culture to another.\nThe family is in many ways the most important part of a society. It is through\nour family that we acquire our culture. The family expresses the attitudes of our\nculture, and we as infants and children tend to accept the patterned behavior that\nis found in our family.\nThe way our family is organized is very important to the way we see our whole\nsociety. Those subtle attitudes and feelings that we are seldom aware of, but which\nmotivate our every act are acquired through the pattern of relationships within the\nfamily. In a culture where the father is a strict authoritarian figure, we tend to\nget the acceptance of authoritarian political organizations.\nIn a culture where the family includes a number of adult women and the child\nhas many women to serve as mother, there is less of a tendency to expect love re¬\nlationship from only one person. In a culture where many people work in a common\nenterprise,there is more emphasis upon cooperation and less upon individual achieve-\nmant.\nIndividuality Family\nIn our culture,the isolation of the small family unit as a separate group dis¬\ntinct from all others, supports our strong feeling of individuality. The Chinese\nfamily system, in contrast, reinforces the idea that the individual is a part of\na larger going concern, and must subordinate his own personal interests to this\nlarger group. The idea of individuality is less apt to get strong support in the\nChinese family organization.\nAll people, everywhere in the world, believe their own family system is right\n22"
}