{
  "id": "d842-33",
  "text": "way a family can be organized and the rules by which marriage is regulated can very\nenormously. In fact, I doubt if any of us could think up a set of marriage rules\nthat anthropologists haven't found in one place or another.\nAn important part of \"human nature\" is that man always lives with other people\nand always lives according to the general patterns of behavior that his fellows ac¬\ncept. That is, man lives in society, and has culture. The society may be email or\nlarge,the cultures may vary greatly, but there always is a society of people living\ntogether and a set of cultural rules which determine how they live together.\nGeneral Features\nEach culture also has certain general features. Everywhere there are \"values\"\nby which men Judge the conduct of others, and by which they try to live. These\nvalues are always given some form of symbolic expression --value symbols may be cart\nand homes, they may be cows or horses or camels,or they may be sacred stones, skins\nof albino deer, touching an enemy without killing him, and a host of other things.\nAnd the values that these things symbolize may be bravery,intellectual activi¬\nty, serenity, hard work. In short, many human characteristics may be regarded as\nvalues, but always there are values, and almost anything can come to be accepted as\na symbol of those values, so long as it fits within the culture itself.\nThe same thing can be said about other features of human behavior: There must\nbe a means of education; there must be a system of rules or ethics; there must be\nsome leadership or authority; there must a system of belief and understanding of the\nyorld. For all people have these things; all people have language, literature\n(though not writing, of course) and other arts. But the foim they take can vary\ngreatly from one culture to another.\nThe world is a museum, and the anthropologist's job has been to study its col¬\nlections. We have found in them a wonderful variety of behavior. This variety of\nbehavior shows that \"human nature\" is not fixed and constant;but rather it is amena¬\nble to a wide range. Yet, it has also shown that there are constant elements in it;\ncertain broad generalizations that apply to all peoples, however primitive or ad¬\nvanced.\n38"
}