{
  "id": "d842-7",
  "text": "patches, but rather a whole fabric with an overall pattern that integrates and uni¬\nfies the specific treatment of each of the various parts. It is this unity that\ngives the word culture its special meaning.\nLet us return to the Tlingit Indian of Southeastern Alaska who let himself be\nkilled — for this is the center of the story \"Stand-in for a Murderer\". He does\nthis, first, because the land his group owns was trespassed on by a hostile clan,\nand this property is a matter of life and death to his people. His clan is in a way\nhis family, though it includes hundreds of people. He feels each of these to be\nhis Immediate relatives; he treats clan members as brothers and sisters. His clan\nmeans to him what our mothers and our children mean to us.\nSo we see two things that we can understand are involved: property and family.\nNext comes law. The law of the Tlingit Indians holds that the clan is responsible\nfor any act committed by any member. If someone in his clan commits a murder, it\nis not the murderer himself who is responsible, but the whole clan. Another element\nin Tlingit law is the rule that we recognize from the Biblical injunction of an eye\nfor an eye. The clan of the murdered man demands retribution, and if it doesn't\nget it, there will be a feud. Now we have property, family and law.\nMore Important\nThe next element in Tlingit culture has to do with status. The position a\nperson has is more important to the Tlingit than it is to us, though we are also a-\nware of different social positions. A man's position is inherited from his uncle,\nand with it goes the privilege of wearing certain crests and bearing certain titles.\nThe amount of wealth he has,the feasts he has given and the brave deeds he has done\nall may raise his position. Every Tlingit is so concerned with status that he takes\ngreat affront at the slightest insult — an attitude that often leads to hostility\nand violence.\nMoreover, this careful measure of status is applied in the rule of an eye for\nan eye. The clan of the murdered man can demand the life of a person of exactly the\nequivalent position as the man they lost — to even the score precisely. If the\nmurdered was more important, his clan will offer another, les3important, person\n9"
}