{
  "id": "d175-12",
  "text": "A Radio Station Looks At\nAmerican Education\nThe factors that go to make up the educational crisis in America\nhave begun to impinge themselves on the consciousness of the\nAmerican people with increasing force. The nation's schools are\nbulging at the seams. Enrollment of school children will increase\nby almost 9 million within the next 5 to 6 years. More than 50,000\nnew teachers will be required to handle this increased work load.\nAnother 75,000 teachers will be needed to replace those who nor¬\nmally retire or leave the profession. Adequate school buildings,\nnot to mention teachers, during the next 6 years would cost more\nthan 25 billion dollars. Although States and local communities are\nspending about 500 million dollars more in 1954 than last year,\nit is obvious that even current needs have not been met.\nWNYC as a municipally-operated non-commercial radio station\nis attempting in this Educational Institute of the Air to examine in\ndepth the American educational scene. A full week of broadcasting\nwill be devoted to an appraisal of how educational processes are\ncarried on—from the nursery to the adult level—and to a thought-\ninspiring survey of the job which must be done for tomorrow's\neducation.\nWe do not delude ourselves that any of our listeners will be\nglued to the radio receiver over the entire 6-day period. Neverthe¬\nless, we feel it a proper function of a municipal medium of com¬\nmunication in a democracy to make audible the latest thought on\nan important problem. In essence, this is a week-long radio docu¬\nmentary which we hope will stimulate citizen thinking in an im¬\nportant area.\nIt is only a beginning, but, if our listeners are inspired to pro¬\nceed with deeper and stronger analysis, we shall have rendered\na great public service.\nThe Educational Institute of the Air is produced by WNYC\nunder the terms of a grant from the Edward L. Bernays Foundation\nto the National Association of Educational Broadcasters. The pro¬\ngram co-ordinator for all of the programs has been Mrs. Anne W.\nLangman to whom great thanks is due. Special mention must be\nmade of the yeoman service rendered by members of the staff of\nWNYC, its Program Director Bernard R. Buck and the Assistant\nProgram Director, A. Alan Levin. It is impossible in this space to\nindividually enumerate the large number of distinguished educa¬\ntors and scholars without whose advice and assistance this project\ncould not have been launched, but our gratitude is not thereby\ndiminished.\nSEYMOUR N. SIEGEL\nDirector of Radio Communications"
}