{
  "id": "d1787-5",
  "text": "NAE3 NEWS LETTER......PA(3E 5.MAY '« *9^3*\nSMEAR THE PIE ALL OVER THE LISTENER'S FACE*\nThere are still those who criticize educationally owned stations because\nTHEIR PROGRAMS DO NOT CONTAIN AN ABUNDANCE OF ENTERTAINMENT FOR THE MASSES*\nFor many years the University of Illinois, Station WILL, has carried the\nslogan “The University of the airm and we have tried to live up to that\nstandard. Some of our programs are built around showmanship and a large prrt\nOF THE TIME IS DEVOTED TO MUSIC, BUT THE SHOWMANSHIP TYPE OF PROGRAM IS EDU¬\nCATIONAL AND THE MUSIC IS NOT THE JAZZ VARIETY.\nNot ONLY DO WE BROADCAST TALKS OF THE COMMONLY ACCEPTED lengths of ten and\nTWELVE MINUTES ON SUBJECTS WE THINK HAVE SOME RATHER GENERAL INTEREST, BUT\nWE EVEN GO AS FAR AS TO BROADCAST LECTURE COURSES OUT OF THE UNIVERSITY\nclassroom. Last year 37 such courses were aired. Many of these lectures run\nA FULL FIFTY-MINUTE CLASS PERIOD^ AND OUR LISTENERS LIKE THEM0\nFrankly we have never made a listener survey because such surveys cost money\n—MORE MONEY THAN WE THINK WE CAN JUSTIFY FOR THIS TYPE OF THING. RATHER\nGENEROUS FAN MAIL THOUGH INDICATES APPROVAL OF OUR PATTERN. AFTER ALL, \\ HE\nUniversity itself does not survey the student body to see what type of\nCOURSES T!,E STUDENTS THEMSELVES WANT AND HOW THOSE COURSES SHOULD BE OFFERED.\n?C ARRIVE AT CUR PROGRAM SCHEDULE, A GROUP OF US SIT AROUND THE TABLE AND\nAFTER WE HAVE SCHEDULED THE STANDARDIZED T^PE OF THING WE DO-MUSIC, NEWS,\nMARKET REPORTS, BOCK REVIEWS, THE FARM AND HOME HOUR, ETC.—WE TRY T>\nDETERMINE WHICH OF THE SEVERAL HUNDRED COURSES BEING OFFERED IN THE FOLLOW¬\nING TERM HAVE SUBJECT MATTER WHICH SHOULD PROVE OF RATHER GENERAL INTEREST.\nAfter the courses have been determined, we attempt to pick that lecture\nSECTION IN EACH COURSE WHICH IS ADDRESSED BY THE BEST RADIO PERSONALITY\nIN THE GROUP.\nTO THE UNINITIATED THIS MATTER OF CLASSROOM BROADCASTS MAY SOUND HOPELESSLY\nDRV AND STILTED. We HAVE POUND, HOWEVER, THAT THIS TECHNIQUE IS FAR BETTER"
}