{
  "id": "d496-103",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nOffice of the President\nStation KUOM\nUniversity of Minnesota\nMinneapolis II4., Minnesota\nNovember 13, 1957\nDr* John C. Schwarzwalder\nGeneral Manager\nKTCA-TV\nBuilding TSA - Room 110\nUniversity of Minnesota\nSt. Paul 1, Minnesota\nDear Dr. Schwarzwalder:\nI have received my carbon copy of your letter of November\n6th to Dick Vogl, director of NAEB’ s Region ]±, in which you\nstate that, unless \"the present reactionary tendencies in\nNAEB leadership can be reversed promptly,” KTCA will not renew\nits membership. Since the Issues you raise are important\nto the whole educational broadcasting movement, as well as\nNAEB as such, I shall send your letter to our Board of\nDirectors. What follows is my own reaction, however, since\nthe Board has not yet seen your letter.\nI appreciate your acceptance of Dick Vogl's invitation\nto write out your reactions to certain actions taken by the\nNAEB Board of Directors at the St. Louis convention, but\nnevertheless I do not think your main points are well taken.\nIn fact, this letter Is like some other communications of\nyours which recently have come to my attention. It reveals\nyour sense for the dramatic and your skill In writing; it is\nmore emotional than logical; and It is the sort of letter\nwhich, after second thought, I should think you would. In\npart at least, want to withdraw. Most important of all,\nhowever, it shows an incorrect perception and Interpretation\nof the facts.\nYour major point (Items 1 and 2) is an expression of\ndissatisfaction with the Board of Directors for not immediately\naccepting the recommendations of the Television Operations and\nDevelopment Committee in regard to activating new television\nstations, and In connection with educational television stations\nraising money nationally.\nThe official action taken by the Board of Directors appears\nin the preliminary Minutes as follows: ”Both Schwarzwalder\nproposals as reported in detail to the Board by the Television\nOperations and Development Committee were discussed at length.\nBecause of the importance of each and the many implications\nconcerned therein, consensus was that no action should be taken"
}