{
  "id": "d496-104",
  "text": "-2-\nby the Board at this time but that both Schwarzwalder proposals\nshould be tabled until the special meeting in early December,\"\n(However, the Board did decide on a restructuring of some NAEB\ncommittees in accordance with another suggestion from the same\ncommittee.)\nPlease notice that, rather than being \"summarily declined\"\n(as you state), these recommendations are being held over so\nthey may be discussed more fully at the special meeting of the\nBoard which will be held within the next few weeks for the\nexpress purpose of examining the basic philosophy and organization\nof NAEB with regard to its services to television members, its\nliaison with education generally, its status with the PCC, and\nits working relationships with other groups active in educational\nbroadcasting. This meeting will be attended by members familiar\nwith the problems of both institutional and community stations,\nas well as by advisers from other fields with whioh we work.\nSince this meeting had been agreed upon previous to the discussion\nof your proposals, it was only natural that they should be considered\nin broad context rather than piecemeal. If you had been fully\naware of our plans, I do not see how you could have reacted In\nthis way to the Board1s treatment of your proposals.\nYour point 3 states that \"NAEB Is dominated by a group of\nMidwestern Radio Stations with little interest in ETV and\napparently no interest in the community television stations.\"\nThis you reinforce later by saying that there has been \"during\nthe past six years an Increasing tendency for the NAEB to become\nmore and more a Midwestern social club for radio operators.\"\nThese statements are obviously Incorrect. More and more\nNAEB workshops and seminars are being devoted to television.\nIn fact, the Allerton Seminar, where the proposals referred\nto in your letter were developed, was such a meetings we\nsecured the funds for it, planned it with the assistance of\nmen from both institutional and community stations, and invited\nparticipation from all the educational television stations (including\ncommunity stations) then on the air. What is more, recent changes\non our Board of Directors (an increasing number of NAEB officers\nand directors are responsible at home for television broadcasting),\nthe greater Involvement of television members (both community\nand otherwise) on committee assignments, the nature of the\nworkshops and seminars we support, and our recent convention\nprograms all provide further evidence of NAEB* s consistent\nInterest in educational television.\nSurely you cannot be serious in saying that \"the major\neffort of the convention was devoted to the production of an\namateur theatrical.\" The talks by Raymond Wittcoff and Harold\nHand, among others, contained significant analyses of educational\nbroadcasting. Though other duties interfered with my attending"
}