{
  "id": "d496-109",
  "text": "Coleman seconded and unanimous approval was given.\nSchooley moved that the president of the NAEB in\nconsultation with the Chairman of the ETRC Affiliates\nCommittee appoint one NAEB community station member.\nBronson seconded and approval was unanimous.**\n(ALthough the Minutes do not so state , it was under¬\nstood that travel and living costs incurred in\nconnection with this meeting would be borne by NAEB.)\nIn view of these Board actions» I now am sending out this\nnotice to set the time of the meeting, and to start getting\nan agenda together.\n1, Personnel. Have I left out anybody from NAEB who\nwas intencteT'to^e covered by our action in St. Louis? Unless\nthere is a reply to that effect, I shall assume not.\n2. Date. (We have assumed that the place would be\nChicago. )'“Attached is a calendar. Please' mark7 it up as\nindicated, and I®11 set the time as soon as I have all the\nreturns. It*s unlikely there will be one time when all of\nus can come. But I611 take the dates when most can be there.\nPlease let me hear from you by return mall.\"\n3* Agenda. What proposals do you have for an \"agenda**?\nShould we start with a consideration of our Constitution? Of\nour purposes and objectives? Of our relations with other\ngroups? Would you like to list individual items which could\nthen be made into an agenda whose adaption or change would be\nthe first order of business?\n4. Advisers. What suggestions do you have for advisers\nfrom within or without our ranks (in addition to the NAEB\nparticipants listed at the head of this memorandum)? What\nfields do you think should be represented—education, government,\neducational administration, learned societies, foundations,\ncommercial broadcasting, what? (My listing of these groups\nis not an indication that I believe we should invite advice\nfrom all; it is done just to elicit comments!)\nLet me hear from you by return mall if possible about the\ndate, and soon afterwards as to meeting procedures."
}