{
  "id": "d496-127",
  "text": "Dr. John G. Schwarzwalder\nNovember 18, 1957\n-2-\nThe Board of Directors of the NAEB is faced with some very\nGRAVE DECISIONS WHICH WILL HAVE A LASTING EFFECT UPON\nBOTH RADIO AND TELEVISION BROADCASTING FOR EDUCATIONAL\nPORPOSES, AND, VERY RIGHTLY, THEY DID NOT FEEL THAT THEY\nCOULD MAKE ANY SNAP JUDGMENTS NOR SUPERFICIAL DECISIONS\nUPON ANY MATTERS AS FUNDAMENTAL AND AS FAR REACHING AS\nTHE TWO PROPOSALS MADE BY YOU AT ALLERTON HOUSE.\nThis does not mean that the Board did not give a lot of\nCONSIDERATION TO THESE LARGER PROBLEMS, NOR THAT IT DOES\nNOT RECOGNIZE THE NECESSITY FOR MEETING THE CHANGING NEEDS\nOF OUR PROFESSIONAL ORGANIZATION. It JUST FELT THAT IT\nWAS NECESSARY TO TAKE A LONGER AND MORE DETAILED LOOK\nAT THE WHOLE PICTURE RATHER THAN TO ATTEMPT SEGMENTED\nDECISIONS,\nJ THINK YOU WILL ADMIT THAT YOU ARE BEING SOMEWHAT UNFAIR\nIN SAYING THAT NAEB IS ”DOMINATED BY A GROUP OF MIDWESTERN\nRADIO STATIONS HAVING LITTLE INTEREST IN ETV AND APPARENTLY\nNO INTEREST IN THE COMMUNITY ETV STATIONS. \" YOU SHOULD\nKNOW THAT 6 OF THE 12 PEOPLE ON THE BOARD OF DIRECTORS\nREPRESENT EDUCATIONAL TELEVISION STATIONS. ONE OTHER MEMBER,\nBob Schenkken, is the Chairman of the ETV project of the\nSouthern Regional Education Board and has considerably\nMORE THAN A PASSING INTEREST IN THE WELFARE OF ALL ETV\nSTATIONS, AND MY STATION IS ESSENTIALLY A COMMUNITY STATION,\nand as Chairman of the Station Activation Committee of the\nSREB AND HAVING BEEN ACTIVELY INVOLVED IN THE PROMOTION\nOF TWO OTHER COMMUNITY STATIONS IN OUR STATE, I FEEL\nTHAT I HAVE SOME RIGHT TO SPEAK FOR COMMUNITY STATIONS.\nIn view of these facts, I THINK it would BE HARD to maintain\nYOUR POSITION THAT ETV IS NOT PROPERLY REPRESENTED ON\nthe Board of Directors of NAEB. I know you were chagrined\nTHAT THERE WAS NOT MORE IMMEDIATE AND POSITIVE ACTION ON\nYOUR SUGGESTIONS AT St. LOUIS, AND I KNOW THAT YOU ARE AN\nIMPATIENT MAN, AND I BELIEVE THAT THIS CAUSED YOU TO MAKE\nSOME JUDGMENTS WITHOUT HAVING ALL THE FACTS AT HAND.\nI HOPE YOU WILL RECONSIDER AND WITHDRAW SOME OF THE STATEMENTS\nYOU MADE AND JOIN WITH ALL OF US IN THE SELFLESS\nPURPOSE OF STRENGTHENING AND EXPANDING NAEB„"
}