{
  "id": "d496-132",
  "text": "- 3 -\nThe Board agreed that by bo defining the problems and areas to be\nserved by HAEB, its constituents would know what the Association is,\nhas to offer, and will not aspect more.\n7. Regional Director lection. The Associate Director was invited\nto speak to' the problems of election of regional directors and consti¬\ntutional amendments# In the recent regional director ©lections, no\ncandidate received a majority votes Region 1, a plurality of two; Be-\ngion 3* & plurality of Ij Region 5# a plurality of 6* In previous years,\ninterpretation has been that majority metes the highest vote# Bronson\nthat those candidates with the highest number of votes be elected,\nthus defining majority as meaning plurality* Hull seconded for opinion\nby legal counsel* Harks pointed out that no standard procedure is set\ndown in the by-laws, that the situation can b© justified on the basis\nof precedent, but that, strictly speaking, majority must mean half plus\none or more* Past officers have been legal and d© facto officers, how¬\never# Hull withdrew his second! Bronson withdrew tS© notion# Schenkkaa\nthen moved# with a second by Col«n, to re-submit the names of those\nACTION candidates with the two highest votes in each region to that region for\nPaiau election* Vote was xmanimous and the Board suggested that the Consti¬\ntution Committee re-examino the problem and provide recommendations*\n8. Constitution taxi. By-Dw Ar.<H«taents. Associate Director Hull\nthen discussed the draft of the notice and explanation of proposed ore rid-\nlaonts to the Constitution and By-Laws# Mams moved* with a second by\nSchenkkan, that the amendments to the Const!tuWon and by-laws as pro¬\nposed by the Constitution Comities be approved for submission to the\nmembership for vote* After Board discussion, Schcnldcan withdrew his\nsecond and Adairs withdrew the tan tion* Sohenkkan's motion that the mater¬\nial be handled In the customary fashion, by mail, dleTTor lack of a\nsecond* Hull then moved * with a second by Bronson, to table the matter\nuntil the Columbus SoarS of Directors* meeting. Motion and second with¬\ndrawn. After further discussion, Hull moved that, since subsequent de¬\nliberations by the Board at this meet ing * might make a difference, since\nthere Is insufficient time, and since certain language needs changing,\nthe oroposed eaendmentsto the Constitution and By-lava be tabled until\nthe Columbus Board meeting# Bronson seconded and vote was unanimous#\n9* Proggam Sp^orship over.ET V Stations. Legal counsel was invited\nto report on a possible critical problem to the ETV movements the com¬\nmercial sponsorship of programs over ETV stations# Discussion by ETV\nstation managers at the All or ton seminar indicates the area is not clear¬\nly defined ted several interpretations are available* Since such pro¬\ngramming is becoming increasingly prevalent, legal counsel recommended\nthat some action b© taken for clarification of position. Counsel rec¬\nommended three possible approaches* an adoption of a code of practices,\nasking the FCC for definition since none is available, or an informal\ndiscussion by ETV stations prior to approaching the FCC. Marks pointed\nout that these are not necessarily the only methods of approach*” Con¬\nsensus of the Board was that the problem was critical and' that fchelliB\nshould b© the organisation to make the approach, once decided* The mat¬\nter was tabled pending subsequent discussion.\nThe Board adjourned at 12*35 for lunch to reconvene at 2*00 p#r.#"
}