{
  "id": "d496-137",
  "text": "In this area, does not commit Ion BFA as SAHB or a part of It,\nis not lailine to merge Identities, and in view of the above will\nACTIOM replace th* present HAKB International Relations Committee Chair-\npa ulu mm *\n30* Securing LEV Funds From ETV Lqulpcien t Manufactures.\nKcBride reread' the television operations \"and\" i)e veljopruent Committee\nproposal concerning the securing of funds from television equipment\nmanufacturers for the ETV broadcast stations. Considerable dis¬\ncussion followed. It wa noted that this was not general fund raising\nand was designed for only a segment of BA B membership* Discussed\nalso was the idea of an NAEB central purchasing agency for equip¬\nment md supplies, the possibility of seeking equipment rather than\ndollars, and a rocognlticn of the fir andal needs of the ETV\nstation members* Schooley moved, with a second by Schenkkan, that\nthe Board recognises the proposal as an interesting idea with some\npromise but is reluctant to act because of inherent problems\nand without the consultation of the ETRC* After discussion, motion\nand second were withdrawn. It was pointed out that this proposal\ncontains proolcans relation to fund raising by other organisations*\nSohenkkan then moved that the Board accept the Television Operations\nand Development Committee recommendation that fund raising activity\nfor individual members lies outside the province of BABB and NAEB\nshould not engage in this activity* Hull seconded and vote was\nunanimous*\n31. Chairman Harley of the ad hoc committee on ETV station\nactivation read a rough draft of the committee proposal* Adams\nmoved acceptance of the report in principle. Broderick seconded\nand'vote was unanimous. The committee report in final form was\nto be presented on the following: day.\n32* Sc hen kk an moved that NAEB go on record before the House\nWays end Means Sub-^omnil tee as favoring removal of the excise\ntax on UHF receivers, with Hull to b© authorised to transmit those\nviews by what over means ho deems necessary* Hull seconded and\nvote passed th Schooley abstaining,\nSohenkkan then moved that the Committee authorised in St. Louis\nto study UHF tax legislation relief have its duties broadened to\nInclude the study of all matters uniquely related to UHF broad¬\ncasting. Bronson seconded and vote was unanimous.\n33* First subject of discussion vr, the need for promotional\ndevelopment and activation, one of the ten needs cited earlier.\nSkornia reviewed NAEB acti/ity in this area at present* Consensus\nthat educational broadcasting needed a \"corporate Image”, a unity '\nof approach towards this end, national publicity, promotion and\ninterpretation* Realistic ally, no entity can pro early function\ntoday without a real public relations program# Discussion then\ncentered on the need for anational publicity office in New Xork where\ntop publicists and facilities ©re located also, on th© need 1 or\ntop columnists, such as John Crosby, to make mention of educational\nbro adcas ting ac fciv±ty *\n3b» It was th© consensus of the Board that the NAEB Journal needs\nimprovement, that itTiee&s to be a more professional magasine, that it"
}