{
  "id": "d496-139",
  "text": "10\ncomprising the SREB, but nationally as well, identifying the need as\nbasic to th© survival and success of the ETV movement#\nBack of these expressions were five vital concerns that!\n1) Baserved ETV channels, already in jeopardy, may aeon be lost*\n2) All, or nearly all, of these charnels must b© activated if the\nmajority of the nation*s population is to be reached and served.\n3) An increase in the number of existing stations Is required to\nprovide the necessary mutual aid and program resources*\n4) No present efforts toward this end seem to offer an immediate\npractical solution, or, indeed, a long-term one*\n5) A number of community and institutional HT7 developments are at\na stage of \"ripeness” where encouragement and skilled advice,\nif made available immediately, can result in new ETV stations*\nRecommendations are, therefore, made that immediate end simulta¬\nneous efforts be undertaken to activate channels on a country-wide\nbasis, \\itllizing all available resources, HAEB, JCET, ETRC, SB 13, and\nall the additional resources which may be marshalled* A specific mecha¬\nnism and procedure is recommended toward this end*\nRecommendations :\n1, Appointment of a national coordinator and chairman, and regional\ncoordinators who together will constitute the NAEB Television Develop¬\nment Committee* This committee will enlist the advice and assistance\nof all those interested in this area of development*\nAreast 1* Hew England (Gunn)\n2* Hew York, Pennsylvania (Hungerford)\n3* SREB States (Bronson)\n4* Illinois, Indiana, Michigan, Ohio, Wisconsin (Schooley)\n5* Iowa, Minnesota, North Dakota, South Dakota, Nebraska\n(Schwarswsider)\n6* Colorado, Wyoming, Arizona (Johnson)\n7* Washington, Oregon, Idaho, Ion tana (Stone)\n6. California, New Mexico, Nevada, Utah (Day)\n2* The committee will make consultants available upon request to\ncommunities and institutions which need help In the development of edu¬\ncational television stations* Consultant service of two kinds is en¬\nvisioned* Those two kinds of service are governed by time considera¬\ntions, but both shall ultimately be made available*\na) Immediatelyi there shall be made available as part-time\nconsultants to service such needs in their own are as managers of ex¬\nisting television stations* These consultants are to be placed on a\nper diem and honorarium basis.\nb) As soon as Increased funds can be founds consultants shall\nbe made available on along ©r-term basis.\n3* All consultants shall act to advise, assist and Instruct the\nlocal persons in the formation of a corporation or organization, approach\nsources of funds, plan station program, advise on equipment, application\nfiling, etc#"
}