{
  "id": "d496-160",
  "text": "-3-\nI presented the general background as had been done with\nChadeayne and Newburn, and then showed the resolution to\nJorgensen and Steetle. Jorgensencs first reaction was to ask\nthat we not make any requests for funds to carry out these\nplans until the JCET’s current request (then before the Fund)\nhad been acted upon* He reminded me that we had pledged\nourselves to support the JCETfs request for a two year grant,\nand that, since this undoubtedly involved some questions of\njurisdictional areas, it might jeopardize the Joint Council’s\nrequest if we should go to the Ford Foundation or one of the\nFunds with our request for this money before the JCET’s\nrequest had been acted upon. I readily agreed to this. (As\na matter of fact, since their grant is for the period beginning\nJanuary 1, and our Foundations Committee requests for the\nfiscal year under which we operate—July 1, 1958 - June 30,\n1959—will not be made until some-months thereafter, theirs\nis acted upon first anyway.)\nJorgensen then requested me to write him a formal letter\ntransmitting the resolution of the Board which he would then\ndistribute to the members of the JCET, for discussion at the\nnext meeting of the Council (or executive committee, whichever\nmeets first). This I since have done for both him and Newbum.\nThe situation was not one in which it was possible for\nthe JCET to formally respond to our proposal. In the first\nplace, this secret had been so well kept that the proposal hit\nJorgensen and Steetle without, I am sure, any previous\nknowledge of it on their part; hence, they had no thought-\nthrough reaction. In the second place. President Jorgensen,\nbeing an experienced university administrator, would naturally\nrefer this to the entire Joint Council before coming up with\na reply. When It does come before the Council, I shall be in\nthe unique position of a member of the Council passing upon\nthe proposal, and also the spokesman for the organization\nwhich makes it! This may put me In what is known colloquially\nas \"the hot seat!\"\nInsofar as I was able to guess the reactions of Jorgensen\nand Steetle, as expressed and implied, I believe this proposal\nwill not meet with their full approval. They suggested that\nthis was an area in which the Joint Council had a great and\nimmediate interest? and, of course, it is. They suggested\nthat the proposal constituted an implied criticism of the way\nthis part of the job has been done. In fact, the resolution\nexpressly Indicates this? it says \"No present efforts toward\nthis end seem to offer an immediate practical solution, or,\nindeed, a long-term one.\"\nWhere do we go from here? First. 1 shall formally transmit\nthis proposal to Dr. ifewburh for the ETOc, EH' Br. Jorgensen-*\n(with a carbon to Ralph Steetle) for the JCET."
}