{
  "id": "d496-166",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nStation KUOM\n0 O PY University of Minnesota\nMinneapolis 14, Minnesota\nJanuary 319 1958\nDr. John R. Richards, Chancellor\nOregon State System of Higher Education\nUniversity of Oregon\nEugene, Oregon\nDear Chancellor Richards:\nWe of the National Association of Educational Broadcasters\nwere very surprised to learn that serious consideration is\nbeing given to selling Radio Station KOAC in order to support\nKOAC-TV. Although our Association is much Involved in all\naspects of educational television, we nevertheless believe that\nradio should not be curtailed in order to support television.\nRadio and television provide quite different services*\nThat is the reason radio remains such an Important medium of\ncommunication, despite television®3 dramatic development in\nrecent years* Radioes program pattern, of course, has changed\nin response to television^ competition* But in the educational\nfield, the in-school use of radio continues to grow; none of\nthe major \"schools of the air\" have been dropped because of\ntelevision, although they have adapted to television by empha¬\nsizing programs of nonvlsual nature* For adult listeners, the\nnews, information and musical offerings of educational stations\nhave actually increased in importance, now that so many commercial\nstations limit themselves to news-on-the-hour and disc Jockey\nprograms*\nSo much has been said about the effect of television on\nradio, that it is often overlooked that the older medium is\ncurrently expanding. There are more radio stations on the air\nnow than ever before; the number of radio receivers is\nsteadily increasing; and commercial radio income has risen\nover last year9s level as advertisers realize the extent and\namount of radio listening*\nThe public hearings which will shortly be held to discuss\nKOAC0 s future will undoubtedly bring forth evidence to support\nthe statements made above, so I shall not go into detail here.\nBut x*e of the National Association of Educational Broadcasters\nstand ready to provide documentary proof of these contentions\nif that should be necessary.\nKOAC should not be the first of America®s major educational\nradio stations to go off the air because of television!\nYours sincerely.\nBP:ds\nBurton Paulu\nPresident"
}