{
  "id": "d496-172",
  "text": "lc Grants-In-Aid. Although originally funds \"were handed\nover to the NAEB for disbursement,” it later was ”decided to\nmodify the plan because the ETRC is not a grant-making organisation\nand needed to take more direct responsibility for the radio\ngrants program® (All quotations ©re from Ray Stanley’s\nmemorandum®) Thereafter, grants were made by the Center, ”after\nscreening of applications and recommendations from the NAEB\nGrants-In-Aid Committee®” The current three-year plan of support\n(we are now in the second year) ”was motivated by the desire of\nthe Center Board to develop a less random, more unified relation¬\nship between radio series®” This led to the decision to build\nprograms around the theme ”American in the Twentieth Century.”\nwith an allotment of $100,000 per year for three years® For the\ncurrent year, the $100,000 allocation has been divided as followss\n$40,000 . . * Grants-ln«Aid\n2,000 • ® . NAEB Administrative costs\n6.500 • o . ETRC Administrative costs\n2.500 o o ® NAEB Current Opportunities Fund\n■^£^000 o®o Available for Commissioned Programs\nIn the ensuing discussion, w© of NAEB asked what had happened\n5° •'“J.balance allocated to radio commissioned programs\nfor 1.957 but never used, and if It could later be reassigned to\nradio programming® Newburn replied thstj.t had reverted to the\nCenter’s general budget. ”We (the Center/ could go to the [Center?\nBoard and ask that this be done, but we are in no position to make*\nsuch a request since funds were not used last year.” (This . of\ncourse, is a matter of concern to us of NAEB, since over $50*000\nwas lost from radio programming in 1957 as a result of the\nCenter’s inactivity in regard to the commissioned series. But\nI doubt that any will go unspent this year, since w© now have\nplans for the $49,000, as reported below.)\nThe Current Opportunities Fund” was set up so that NAEB\nHeadquarters might have quickly available funds to record and distribute\nspecial event programs which could not be foreseen in advance.\nThis money ’would be intended primarily to provide for costs\ninvolved in recording, engineer and editing charges, plus honoraria\nto talent, where that was necessary.” Administration of the Current\nOpportunities Fund will be by Harry Skornla, with unexpended funds\nreturned to the Center and a cost-accounting report made®\n2® Commissioned Programs. There was much discussion of\nthe commissioned programs, and of NAEB®s disappointment at no such\nprograms being set up for the current year, with the result that\nthe money earmarked for such programs reverted to Center general\nAfter a careful review of possible subjects for commissioned\n^ w?s decided to develop this year’s series on the theme\nof Education in America.” There was discussion of the subject,\nconsultants and production techniques. As to implementing the\ndecision. The point was made that the Center staff cannot work\nup multiple compatetiv© proposals, but within the framework of a\naeiected focus, could work with Center consultants in the preparation\nm0thods °r creating programs. Such alternatives would\nbe submitted to the Grants-in-Aid Committee for their scrutiny"
}