{
  "id": "d496-19",
  "text": "copy\nSent {or the information of\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 GREGORY HALL\nURBANA, ILLINOIS\nStation KUOM\nUniversity of Minnesota\nMinneapolis 14, Minnesota\nMarch 6, 1957\nMr. Edward Stasheff\nDepartment of Television\nUniversity of Michigan\nAnn Arbor, Michigan\nDear Sdt\n’fien the Executive Committee met in Minneapolis in January\nto appoint committees, it sometimes had difficulty in deciding\nexactly what each committee was to do. Communications from\ncommittee members and chairmen have indicated doubts on their\npart too. Therefore, I think we should set up a little handbook\nin which the areas of responsibility for each committee are defined.\nIf well done, this should facilitate the work of committees during\nmy administration, at the same time that it provides guidance\nto subseouent officers and committee members.\nI should prefer to do this through exchanges of correspondence\nwith the committees rather than by a unilateral statement, how¬\never. Time makes it impossible for me to write letters to every¬\nbody immediately but I am trying to go through the committees on©\nby one, and some correspondence with Frank about the Publications\nCommittee, together with the preliminary study of HAEB periodicals\nturned out by Glenn Hansen and Theodore Peterson, provide me with\na spring board to write about the Publications Committee.\nIt seems to me that the main function of the Publications\nCommittee is setting the basic policy to be followed by the\nseveral NAEB publications, that is, the Newsletter, and the Journal.\nTo this end, I think the Hansen-Peterson study provides a certain\namount of guidance, though it doesn* t answer what seems to me is\nthe basic Question! what is to be the relationship between the\nNewsletter and the Journal on the on© hand, and all the other\npublications about the mass media on the other? Hie purpose of\nthe Newsletter has always seemed rather clear to me. As its title\nIndicates, it is a means of providing an exchange of news among\nmembers of the organization. It is a sort of house organ for an\norganization."
}