{
  "id": "d496-203",
  "text": "MEMORANDUM\nTo:\nMembers, NAEB Board ,pf Directors\nJack McBride Jutj g 0\nHaskell Boy ter ° ^ Ml / j\nRobert Coleman\nE. Ac Hungerford, Jr*\nVernon Bronson\nWilliam Harley\nRichard A. Vogl\nRobert Schenkkan\nEdwin Adams\nGertrude Broderick\nPrank E* Schooley/—\n& Mvc\n,l-£\n■W'iS\nJune 6, 1958\ncc: Leonard Marks\nHarry J* Skornia\nFrom: Burton Paulu\nSubject: (1) The Washington Meeting—Wonderful!\n(2) Foundation News—Discouraging!\n(3) The Magnuson Bill—Passed,\n(4) Board of Directors Meeting plans—Undecided,,\n(1) The Washington Meeting\nIt was a significant meeting! We of NAEB can take pride in\nhaving initiated it*\nBeing mailed under separate cover (to those of you who were\nnot there) is some material which describes what went on, such\nas the program, a list of participants, and copies of several\nof the principal speeches.\nThe quality of the talks was up to the very best I have heard\nanywhere at a conference, convention or institute. We got off to\nan excellent start Monday morning with fine statements by Novice\nG* Fawcett, President of Ohio State University, and William Go\nCarr, executive secretary of the NEA* Marshall McLuhan of\nToronto University threw us a couple of fast curves with his\ndistinctions between ideas expressed in print and through the\nelectronic media. Whether or not one agreed with his point,\nthough, the overall effect was highly stimulating* Monday\nafternoon*s reports provided important information on the status\nof television, films, research, and radio.\nTuesday morning maintained the high standards of the previous\nday* Those of you who have heard Leonard Marks in action need\nonly be told that he was up to his usual level of performance*\nDavid Stewart gave a good summary of the status of reservations,\nafter which Edgar Dale provided a superb review of the general\nproblem of introducing mass media from the year 4000 B.C* to\ndate, while Wanda Mitchell gave us the teacher’s point of view*\nThe Tuesday afternoon sessions followed through logically from\nthis one*"
}