{
  "id": "d496-205",
  "text": "-3-\nOn May 28, Mr. Nelson wrote to Dick Hull to reply for both the\nFund for the Advancement of Education and the Ford Foundation.\nAfter reminding us that he had made no promises during our meeting\nof May 21, he then said that it would be impossible for either Fund\nor Foundation to support the project we had presented to them.\nWhy this flat and complete turndown for our big proposal? All\nfour of us were optimistic after our talk with Mr, Nelson. However,\nfor the record X should report that he did indeed tell us that he\ndid not have the authority to commit either Fund or Foundation.\nFurthermore, he did not say anything which specifically declared\nhis approval, although we felt (perhaps wishfully!) that his line\nof questioning implied approval. But he warned uss the decision\nwould depend not only upon the merits of our case, but also upon\nthe general earning status of the Ford Motor Company, as well as\non the overall policies of the Fund and Foundation in regard to\nbroadcasting.\nWhat do we do now? Dick, as Foundation Committee chairman,\nis exploring the possibility of a grant for a smaller project.\nWhile the action of the Fund and Foundation appears to be final\non our big proposal, the door may still be open for a terminal\ngrant providing for a gradual tapering down of our present Ford-\nsupported activities.\nAs things develop, 1*11 keep you informed.\n(3) The Magnuson Bill\nThe Senate passed the Magnuson Bill on May 29. The final\ntext of the bill, together with the discussion which preceded its\npassage, may be found in the Congressional Record, Senate, for May\n29, pp. 8779-8782. Congratulations to our committee (headed by\nBob Schenkkan) for its good work! We are already in touch with\nLenny Marks about the bill*s future in the House.\n(4) Board of Directors Meeting Plans\nIt was the unanimous feeling of the executive committee after\nthe Washington meeting that its results taken alone do not require\na meeting of the Board of Directors. At some past general meetings,\ninformal off-the-record conferences among the representatives of\nthe major groups present have lead to long-range plans. In this\ncase, though, the representatives of the JCET, the ETRC and the\nfouncations were not of policy forming level. However, the state¬\nment of conclusions which Dick Hull is now formulating may provide\nus with guidance for future NAEB activities. But it was our feeling\nthat nothing growing out of this conference would justify the\ntrouble and the expense of an immediate Board meeting.\nAs to a meeting to discuss Foundation relations, it is too\nearly to tell if such a session is required. This will depend on\nwhat develops as a result of Dick*s further negotiations with the\nFord and Fund people."
}