{
  "id": "d496-207",
  "text": "MEMORANDUM\nJune 12, 1958\nTo: NAEB Board of; Directors\nJack McBride\nHaskell Boyter\nRobert Coleman MUG\nE« A. Hungerford\nVernon Bronson\nWilliam Harley\nRichard A, Vogl\nRobert Schenkkan\nEdwin Adams\nGertrude Broderick\nFrank E, Schooley\nHarry J. Skornia\nHarold Hill\nCecil Bidlack\nLeonard Marks\nFrom: Burton Paulu\nMost of you know of my longstanding interest in foreign\nand international broadcasting. My graduate work at the\nUniversity of Minnesota was mainly in international relations.\nDuring the early years of World War II, I began to follow\nnews reports from Britain, Germany and Italy on my short wave\nradio, A year-and~a-half overseas with the radio section of\nthe Office of War Information in 1944 and 1945 Introduced me\nfirst-hand to European broadcasting, both domestic and inter¬\nnational, and later led to the decision to write my doctoral\ndissertation about the Voice of America, Then came my\nFulbright year In London (1953-1954), during which I gathered\ndata for the book on British broadcasting which some of you\nhave seen, (Incidentally, I finished reading page proof on\nit the very week I was elected NAEB president in Atlanta!)\nEver since the book was published, I have wanted to go\nback to England to make a study of the effects of competition\non British broadcasting, as well as to look again at radio and\ntelevision on the European continent. Unquestionably, the\nUnited Kingdom now provides a wonderful laboratory In which\nto see just what happens when a noncommercial benevolent\nmonopoly like the BBC is joined by an aggressive, commercially-\nsupported private television system like the ITA, The outcome\nof such a contest is of interest to us in this country, too,\nsince we ascribe so many of the strengths and weaknesses of\nour broadcasting system to its competitive commercial status.\nWe say that our programs are made \"good* by competition,\nand that they can be good because our commercial system\nprovides the funds for the best talent. Others complain that\ncompetition forces down program standards, and that ratings\nrather than intrinsic merit determine program format."
}