{
  "id": "d496-215",
  "text": "-2-\nher plans, which are only now being formulated, though, the\nend result of which cannot yet be foreseen. Although working\nat and with Badlo Sweden, Miss Lundin should not be considered\na part of Radio Sweden.\nBut the other three people named above definitely are\nin Radio Sweden. These people are confused by the BFA\nsituation. Mrs. Bergman, who talked with Si in Italy or\nsomewhere, was especially so. To her, BFA had now officially\ntaken over NAEB’s international activities. But Mr. Poalsson,\nher superior, did not have this idea, so we cannot definitely\nconclude that Mrs. Bergman*s misunderstanding resulted from\nanything Si intentionally said. But the confusion exists.\nI explained patiently, and several times over, that\nNAEB does many things, of which getting programs from abroad\nand distributing them via our tape network is only one; that\nSi was a past president of NAEB and past chairman of our\nInternational Relations Committee; but that he no longer was\nin either capacity. I also explained that NAEB did not have\na permanent office In Europe, and that I therefore was not\nIts permanent European representative (as Mrs. Bergman had\nhastily concluded).\nI tried my best to define our separate organizations and\ndifferent spheres of Interest, and I hope with good effect.\nBut I definitely avoided showing any displeasure with BFA or\ncriticizing them. The Swedes are smart enough to figure out\nthat there is some overlapping of interests, of course, but\nfor the record let me state that I did not take off on BFA or\nany of its organizers!\nI heard portions of four shows. Portrait of a City\n(Gothenberg) is one of several Swedish Radio Is contributing\nto what I assume is a BFA series. It was done for BFA, and\nwas initiated at their suggestion. Quite good; well worth\ncarrying, especially for a station like KUOM, with a large\naudience of Scandinavian descent; but good anyhow.\nInternational Almanac is another BFA show being done for\nthem once a month. It interviews Swedes In the news, In the\nexample heard, an explorer and an opera singer. Also good\nshow, though a little more Swedish promotion than City Portrait.\nStockholmer's Diary is distributed through the Swedish\nRadio agents in Burlington, Vermont, Mr. and Mrs. Gunnar\nChristiansen. It is on the order of International Almanac,\nis definitely pre-BFA in origin, and is not handled by BFA\nat all."
}