{
  "id": "d496-22",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nOFFICE OF THE PRESIDENT\nStation KUOM\nUniversity of Minnesota\nMinneapolis U|, Minnesota\nMarch 6, 1957\nMr, Prank Schooley\nStation WILL-AM-FM-TV\nUniversity of Illinois\nUrbana, Illinois\nDear Prank:\nWhen I returned to the office Monday I had a total of 12\nletters from you, delivered by Harry Skornia at Ann Arbor or by\nthe mailman here in Minneapolis, I certainly appreciate the\ntime and attention you are continuing to give to NAEB affairs.\nMy only concern is that, as past-president, you will set an\nexample which will result in the next past-president (me, that isi)\nalso having to work long hours for the Association at a time when\nhe might feel that a rest was deserved!\nThank you for the information about the JCET meeting. I am\nsorry I couldn't attend, but a temperature of 102 for three days\nleft me with little choice. I talked to Ralph in Boston though,\nand he told me that there would be a meeting of the Executive\nCommittee on the evening of March 17 and of the full council on\nthe 18th. I shall try to be present at these. I discussed some\nNAEB-JCET-ETRC problems with Harry Newburn in Ann Arbor, and\nfurther with Ralph and Dick Hull in Boston. I hope you and I\ncan have a chat in Washington on this topic.\nAnother important subject is that of NAEB foundation relations,\nI think we should have a meeting of the Foundations Committee in\norder to firm up our policy and approaches both to Kellogg and\nFord. How would a day or two in the last week of March in Urbana\nsuit you? Dick would be free a couple of days during that week.\n(I shall get in touch with Jim Miles after I get your schedule.)\nWould this be soon enough to draw up policies in regard to both\ngroups as well as to explore other foundation possibilities?\nIn this connection, I should like to have Marguerite Fleming\nmeet with us to talk about the convention. She seems worried about\nthis, and earnestly requests a meeting. By having her come to\nUrbana rather than having Harry and/or me go to St. Louis, we\nshould be able to conduct other NAEB business in addition to that\nof the convention, and also can give Marguerite the advantage of"
}