{
  "id": "d496-220",
  "text": "Drafted April 27,\nStockholm\n1959\nTranscribed April 30, 1959\nDepartment of Radio and\nTelevision Broadcasting\nUniversity of Minnesota\nToi Keith Engar\nWilliam Harley --\nHarry J. Skornia\nFrom s Burton Paulu\nParis was fine; Stockholm is fin© too*\nAs I have already reported, we are now quite heavily\ncommitted to give to and take from UHI. Mme. Druon of RTF\nwill forward the documents to Keith, who will have to start\nthe ball rolling, and keep it rolling until I return in\nSeptember.\nNow, about Stockholm. The most interesting development\nso far took place this morning. The (Italian) chairman\nobserved that American stations had not taken many television\nprograms from European sources. Romney Wheeler of USIA\nthereupon recommended the acceptance of the ETBC's pending\nEBU membership application, which had been stalled due to\nconstitutional and legalistic problems. He urged that it be\napproved, and read from a letter to him by Jack White so\nstating. The EBU secretary reported that now only action by\nthe proper EBU body (administrative assembly?—not the present\ngroup, anyhow) remained to be done.\nSig Mickleson of CBS, who is here with three of his\nEuropean staff (Olympics, live programs when transatlantic\ntelevision is technically feasible), also supported the ETRC\nrequest. Sig said this would give an outlet to European\nprograms which commercial television1s crowded schedules do\nnot permit.\nI thereupon supported the ETHC,s request too, even in\nthe absence of instructions from you. Why? Because I think\nwe cannot be a dog-in-the-manger here; because I think they\nwill get it anyway; because I think it is to American\neducational television^ overall advantage for them to\nbelong; and because I think NAEB*s opposing it would put us\ninto an impossible strategic position.\nYou can disassociate yourselves from me if you wish.\nBut if you support me, I think someone of you should drop a\nnote to Jack 'White reporting that I did support their\napplication, and wishing them luck! We donft want Wheeler\nor anyone els© misreportlng that I either opposed it or\ndragged my feet!"
}