{
  "id": "d496-227",
  "text": "Drafted May 12, 1959\nBramley Cottage\nLinks Hoad\nBramley, Surrey, England\nTranscribed May 15 , 1959\nDepartment of Hadio and\nTelevision Broadcasting\nUniversity of Minnesota\nToj Keith Engar\nWilliam Harley^\nHarry J. Skornia\nProm t Burton Paulu\nHere I am, back before the window of my study in Bramley.\nI returned to lovely weather, the kind we counted on when we\nrented this place in Surrey, and the kind of weather that\nmakes us wish this were the beginning of our first month here,\nrather than the end of the eighth!\nBerlin was interesting: interesting in itself; for its\ntwo political divisions; and for its importance in the news.\nI toured both sections, took many pictures in both (to\ndocument the Incredible difference between the eastern and\nwestern sectors); and recorded an interview with two of the\ntop people in Bias. This should have reached KUOM by now.\nIt is available to any and all interested NAEB stations.\nMy line was: last night in my hotel I listened to radio\nprograms from all sides—Rias, west Berlin, east Berlin,\nwest Germany, east Germany, BBC, French, AFN, Polish, VGA\nand Moscow; what are the reasons for all these services, what\ndifferences are there in the programs, and especially, what\nis the purpose of RIAS.\nIn Hamburg I talked to Walter Schultz, In charge of\nforeign contacts for Norddeutche Rundfunk. (He, of course,\nspeaks only for radio in Northern Germany; there are some six\nor seven other German networks, each as independent as\nAmerican local stations on the same network.; I asked about\nsupplying programs to NAEB. Yes, this was being done through\nSeymour Siegel and BFA. What about some extra programs. Yes,\nthey recently sent an opera by R. Strauss; it was sent to\nNAEB-WNYC-BFA: he seemed to lump us all together. I tried\nto explain, but he was less patient than the Swedes.\nHe did make one point of interest, though. They have\nno problem getting permission from musicians to distribute\ntapes of major musical performances. Their musical schedule\nis superb: I heard their symphony orchestra, and it Is\nfirst rate. When they do premieres and works commissioned\nfor them, they like extra performances In the States. The\nperson to contact here is: Walter D. Schultz, Norddeutscher\nRundfunk, Rothenbaumchaussee 132-134, Hamburg 13."
}