{
  "id": "d496-235",
  "text": "Drafted July 12, 1959\nBramley Cottage\nLinks Hoad\nBromley, Surrey, England\nTranscribed July 16, 1959\nDepartment of Badio and\nTelevision Broadcasting\nUniversity of Minnesota\nMinneapolis 14, Minnesota\nTo1 Harry J, Skornia\ncc * Bob Coleman\nBill Harley ^\nKeith Engar\nFrom* Burton Paulu\nHeturned from 18-day drive on the Continent a couple of\nnights ago to find your letter of June 22 waiting for me.\nGlad to read of fund possibility for NASB to stay in EBU.\nAs to Bayreuth and Salzburg. The revised Salzburg\nprogram makes it look like a very valuable meeting. Since\nyou say, \"If Engar and Harley agree, I agree to your attendance\nat Salzburg August 23-29, and Bayreuth enroute\"; and since\nKeith has implied approval; while bill hasn’t expressed himself\nat all; I shall plan to take this trip, unless disapproval\nreaches me first.\nI have written again to the head of Baverlan Hadio-\nTelevislon. He never answered my letter of March 5 (copies to\nyou), so I sent him another copy today, and asked him to\narrange for me to see an opera at Bayreuth on August 20, to\ntalk to some of his people there on August 21, and suggested\na meeting in Munich around noon on August 22 (Munich is on\nthe circuitous route I must follow to get from Bayreuth to\nSalzburg.)\nTotal costs for this trip should be well within the $475.61\nremaining from my $1,000 advance, but might exceed one or the\nother separate balance. (By my records* $221.06 on Current\nOpportunities; $254.55 Administrative General. How about it.\nBob; do your records agree?)\nAs to my returning dates* My sailing was slightly\ndelayed by some Holland-Amerlean Line changes, so we now are\nscheduled to leave Southampton September 11, reach New York\nSeptember 19, and be back at the office around September 22.\nBut I am requesting an earlier boat should there be any\ncancellations, and am still hopeful.\nMeanwhile, send me any dope you get on BFA, Bayreuth and\nSalzburg. While there, 1*11 negotiate as best I can with both.\nBPids"
}