{
  "id": "d496-237",
  "text": "Skoraia - 2\nthe difficulty that we at KUQH had in ordering discs, listed\nin the catalogue, which we learned were out of stock. He\nreplied that they do not consider their service as the counter¬\npart of a commercial music record library, and that they could\nnot afford to stock additional copies of all the programs in\nthe catalogue. However, they are trying to carry extras of\nsome items apt to be in considerable and extended demand.\nI was particularly interested in reviewing BBC-BFA rela¬\ntionships. Apparently BFA had proposed becoming the USA\ndistribution medium for BBC programs, but this offer the BBC\nhas rejected. Frost pointed out that they do not even deal\nthru their own New York office, preferring to service the USA\n(and the rest of the world, for that matter) direct from London,\nso why should they appoint BFA as their American representative.\nThey had done a few special shows for BFA (for example, for BFAfs\nCities of the World series), but these were the exceptions, not\nthe rule.\nFrost declared himself strongly pro-NAEB, and is surely\naware of BFA's expanding tendencies. I should be much surprised\nif BFA got many special favors out of BBC, even though Basil\nThornton is with them.\nIncidentally, Barry Thorne is back in England. I havenft\nseen him yet, but intend to invite Barry and Barbara out to\nsee us before we leave. The new man, Derek Hussell, and I\nhave a luncheon date for next week, and I shall try to brief\nhim as to the facts of educational broadcasting in America*\nI asked Frost what he knew of BFA deals with Bayreuth and/or\nSalzburg. He didn't know of any, but said he would check in\nhis files and let me know. X have exchanged letters with the\nGermans and Austrians about these festivals, and shall do my\ndarndest to get some good tapes for NAEB. If their rules pro¬\nhibit mass duplication, lfll try for rights on a few of our\nprincipal stations.\nThank you Harry for your kind words. Let me assure you,\nI greatly appreciate the many services you've performed for me\nwhile I have been over here!\nWith best personal regards,\nYours sincerely\nBurton Paulu\nCC to william Harley ^\nKeith sngar"
}