{
  "id": "d496-255",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n147 Argyle Road\nEaling\nLondon, W. 13, England\nMr. Graydon Ansmus\nRadio Station TOOA\nUniversity of Alabama\nUniversity, Alabama\nDear Graydon;\nLast night BBC-TV did a remote (“outside broadcast,” or ”0. B.” to them)\nfrom a circus. I didnft watch it--I did watch a not-very-well-done TV\nfilm a bout Oxford, but turned back to BBC radio, Radio Berlin and the\nUS Armed Fa* ces network from 9:00 until midnight. But this morn, ngs\nLondon Times contains an int erestiig story about that in its legal re¬\nports.\nMr. Justice Vaisey, so the Times reports, refused to issue an injuo tion\nrestraining BBC from televising that circus. The objector stated that\nthe BBC ”were not registered as exhibitors of performing animals, and\ntelevisirg them was illegal. It was scandalous that the BBC should em¬\nploy Professional commentators with charming manners and irreprochcb Je\nvoices todeceive a public so notoriously gullible Mas the British into\nbelieving that the animals lived in luxury with kindhearted trainers.”\nThe BBC’s attorney said the objector had no legal- basis upon which to ob¬\nject, and observed that on an earlier occasion he had “unsuccessfujjy\ntried to stop the BBC f rom broadcasting the description of a bull fight.\n\"Mr. Justice Vaisey said tint he had the greatest a dmiration for thaB. e\nwho sought to r estrain or limit anything in the nature of cruelty to\nthese humbie c reatures who were so subservient to and dependent on\nhuman beings, but the BBC were not commi-uting any wrogful act for which\nMr. MacHicbael coujd gjetr edress. ”\nThe Times a Iso carried a full repat on the Government White pape r fa a\ncompetetive tv project. This is goiig to be a bitter fight, Ithink. The\nplan is for a BBC-type corporation to hare program control, but selling\nadvertisements during proper program breaks. This of course will pxobably\nresult in adv8 rtisers influencing programs in the direction of enkter-\ntainman t—and what adience figures Ifve been ab le to get da old of indi¬\ncate that British tastes in radio (aid surely in newspapers) are no better\ntha ours--if as good; consequently the EB^'s cultural, monopoly argument\nmay go by the boards. I^cidei&aXiy^: affter a g) od deal of readiig of both\nsecondary works and documents I think the cultural monopoly aspect is the\nreal reason for the broadcasting monopoly, aud tafk of frequency shortages\nand adequate covers e is only secondary. So, the fight here will be a\nstrong one. /he Times—now headed by Haley, formerly BBC Director General\n--opposes this editorially, and it carries a good deal of weight, and\ngenerally supports rather than opposes the bonservative Government."
}