{
  "id": "d496-258",
  "text": "-4-\nAnd then there’s the lecture circuit.1 Next Monday X go to Bournemouth (a\ncity on the Southern coast of England )to taLJc to the Hotary Club. Wednesday\nfollowing I take pa* t in a big affair for school childr$ n in which we tel/\nthem about America. December 1 I talk in a series arranged by the Common¬\nwealth Fund on \"Television, Friend or Foe.” (Their title, not mine.1)\nThere’s a \"dining” club just out of London for December 12. and this sort .\nof thing will undoubtedly become more ad more frequent, something vh ich is\ngood for all of us, I thin£, since I will learn about -^gland that way,\naid—I hope—England dDout Aerica (and American broadcas ting.) Ad there\nmay be af ew broadcasts in the offing, too.\nAll this doesn't leave much time for entertainment, but we har e got ten in\naf things. Frances and I have gone three times to symphony cuonc erts\nin Festival Hall. The orchestrasw ere pretty good, the conductors mostly\nonly fair, the hall’s acoustics poor (too dead), and the audieic es large\nand enthusiastic. I guess we operate in the German and French rather than\n•British orchestral traditions. Theatre is another at cry: we saw the\nOld Vic do All's Well; it was superb—they don’t have the restraint in\ndoing comedy Shakespeare which seeas to inhibit thd r musical performances\nGraham Greenes Living Room was well done, though not a satisfying play;\nit gets all tangid up with posing problems, and then has the heroine kill\nhers&df to avoid having to solve them. And we took one drive into the\ncountry with BBC hosts, during which we visited the church in vh ich Gray\nwrote his famous Elegy, and had tea in a charming old 17th Century inn.\nOr living problems are now well under control. Of course the lo<a 1 ner-\nchants are thrown by our American ways, but they are getti g used to us:\nwe now In ow that Philadeljhhia CremmCheese is Demi-Se}.; they ha'K recv ered\nfrom the diock of having somebody buy half a week’s groceries at a time,\ninstead of purchaa ng in (Jriblets daily; and, the aght of a five-pound\nnote (about $15.00) doesn ts care them to death, even though they seldom\nsee more than a one-pounder.\nFinally, the British continue to be excellent hosts. Last Sunday, for\nexample, we had tea with Sir Arthur and \"lady Bliss. (He is one of Englands\nbest contemporary composers, and was BBC \"music director for two years in\nthe war). The week before we went out to visit two people who entertained\nme in the Lake Country in Selp ember 1945. And Fulbright, Commonwealth\nFundand English Speaking Union add to the University Of London in offering\nsac all-culturd. -business contacts at the rate of one or two every week.\nSo, things go well here. I trust—the same with youi But. • • let me\nhear from you, if a letter isn't already on its way over here.\n¥ours sincerely,\nBurton Paulu\nPS's: Harry: in quoting any of my letters in the News Letter, be sure to\ncut out any editorial comment that is adverse BBC, cr might for any otter\nreason, embarrass me.\nLarry: Your letter was good, and most welcome. Keep me on your list.\nRegads.\nGraham: Let me hear from you too. How goes it in Italy?\nTo All: Excuse ;this method of correspondence, but I have no secretarial"
}