{
  "id": "d496-30",
  "text": "March 8, 1957\nDr. Burton Paulu\nK U 0 Mt One Eddy Hall\nUniversity of Minnesota\nMinneapolis, Minnesota\nDear Burton;\nLet*s take the light things first. I hope to reach 101.\nComments regarding Seay conversations referred to his trip\nto South America—that*3 where he is now. I offered to go along\nif Kellogg paid my way. He said, *You*ve Just been turned down.*\nTurned down on suggestion Kellogg send me with Seay. All was in\nkidding, and related only to Indicate good mood of Seay.\nLike you, VOA may come along some day, but I*m not too\nhopeful about governmental agencies at times, including VOA.\nWe can discuss excise tax exemption on all-channel receivers.\nIt’s a matter of principle with me, on which I believe neither\nNAEB nor JCET should take a stand. And, Ralph has been instructed\nby JCET MOT to take a stand. He was Instructed NOT to testify,\nno matter what his feelings are on the matter, ^nd, most of all,\nit’s a dead duck anyhow. Congress will make no exception for\nall-channel receivers. This, I believe. This, Heffeman concedes\nfor all practical purposes in talk with me. This, Senators on\nthe Foreign Commerce Committee believe, and have so expressed\nthemselves publicly.\nOn the Foundations committee, I agree that meeting would be\nhelpful, but I point out that anytime later than this week or\nnext week may be too late. So, what do we do. I feel we should\ndo this — let Schooley go ahead and explore and move as fast as\nneed be. And, I won't make definite moves without conferring and\ngetting approval, i.e., won't make specific requests* Any request\nto Ford later than sometime within next two weeks may be too late\nfor July 1 funds. I don't have details, I'm giving you my best\nguesses.\nWhat does Paulu do? I suggest you get Foundations Committee\nvia letter, let me have items for which funds should be requested,\nin order of preference if possible. Can send carbon to you. I\nmay need this dope within week or ten days. Then, final form of\nrequest to Ford, Just for example, might be decided upon at\nmeeting you suggest for late March."
}