{
  "id": "d496-35",
  "text": "copy\nSent for the information of\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 GREGORY HALL\nURBANA, ILLINOIS\nApril k, 1957\nDr. Harry Newburn\nEducational Television and Radio Center\n1610 Washtenaw Avenue\nAnn Arbor, Michigan\nDear Harry:\nSince becoming president of NARB, I have been re-examining\nthe functions of our various coimnittees, Perhaps it would be a\ngood idea, therefore, if you and I jointly tried to define the\nrole of the Advisory Committee to President of the BTRC.\nAs you will recall, I was the chairman of the original\ncommittee appointed back In 1953. Then our problem was that of\nsetting up the Center, Now, it seems to me, the committee^ main\nrole is to provide liaison between the Center and its members, and\nthe Center and NAEB.\nI can think of several specific contributions the Committee\nmight make. In the first place, the criticisms we hear occasion¬\nally of the Center, from people both inside and outside the\neducational television movement, are certainly our concern. If\nthey are justified, perhaps we can help you meet them. On the\nother hand, if the Center Is doing all it can on a given matter,\nand still is receiving unmerited criticism, we should be prepared\nto speak in your defense.\nWe also should provide NAEB-STRC liaison. If educational\nbroadcasting Is to be strong, it must remain unified: we should be\none group of educational broadcasters, rather than competing groups\nof radio and television broadcasters. Perhaps this committee can\nsometimes help close the ranks.\nWhen and how often we should meet? Between now and Columbus\nwe shall be pretty much snowed under by the NAEB Radio Seminar,\nthe Columbus meeting Itself, and your Affiliates meeting. I\nassume that Schooley, Hunter, Hull — and perhaps Robertson —\nwill attend the Affiliates meeting. Perhaps I should come along\nand listen In; what do you think? (not to the exclusion of Harry\nSkornia, or any other regular guests from NAEB, however.) Perhaps\nthis committee could have lunch with you on Tuesday noon, May l1*,\ncould meet by ourselves that evening, and then you and I could\nhave a final session on the morning of the 15th."
}