{
  "id": "d496-75",
  "text": "ACTION: There being no pending hearing in which to\nparticipate, no determination of our oosition need be made now.\nThe reactions quoted above indicate general approval of UHF tax\nrelief* But I would like to hear from more of you on this.\nb mM.staffi officers, committee members. arid\n• seminar participants.\na) GERTRUDE BRIDERICK: \"Since we are not legally liable\nfor accidents or mishaps to workshop or seminar Participants.\nI favor rescinding the action taken at Columbus. That action,\nas I recall, was prompted by advice from our Assistant\nExecutive Director that we were legally liable. I am\ninclined to sustain the action taken with respect to a £25,000-\nlimit travel policy on the NAEB Executive Director, Associate\nDirector, Television Engineer, NAEB Officers and committee\nmembers while traveling on NAEB business and expense. The\nfact that the Executive Director and his Associate are covered\nby a University of Illinois policy does not relieve us of\nour obligation, in my opinion, unless we exclude all others\nwho may have coverage of one kind or another.”\nb) VERNON BRONSON: \"No insurance for seminars but the\nresolution to cover employees officers and directors. Covers\na moral obligation. Insists this carried through.\"\nc) R. J. COLEMaN: 1) I do not favor taking out insurance\non workshops and seminars if we are not legally liable. I also\nsuggest that we cancel the proposed insurance on the upcoming\nTV /Management Seminar. Most of the participants will be\ncovered by their institutions anyhow and NAEB does not have\nthe money for this purpose if it is not a necessary expenditure.\n?) I am in favor of taking out group insurance to cover those\nnot covered by their own institutions (such as Bidlack). I\nfind that, in my own case, if I get travel authorization\nfrom the University even though the trip is not at University\nExpense, this is considered as in line of duty and therefore\ncomes under University coverage. I feel sure that this same\npertains to most institutions from which our officers and\nBoard members come. What I am saying is this: I favor a\nminimum expenditure unless or until NAEB has more money to spend\nthat it now does.\"\nd) JACK MCBRIDE: \"If funds are made available to permit\ntaking out an insurance policy for the August television\nmanagement seminar, then I recommend this be so done. However,\nI would not want to see the seminar watered down greatly\nbecause of the financial burden imposed, especially since we\nhave no legal obligation. In general, my feeling is that while\nthere is no legal obligation but a moral obligation as pointed\nout by Leonard Marks, we should take out insurance on the\nAugust seminar. I recommend that this same question be included\non the agenda at the St. Louis Board meeting for considerable\ndiscussion. I therefore recommend that the Executive Director\ninvestigate and determine costs for a blanket liability\nprotection nollcy for all workshops and seminars but that a"
}