{
  "id": "d496-84",
  "text": "TO: NAEB Officers and Directors\nCO: Harry J* Skornia\nHarold Hill\nRADI:\nPROM: Burton Paulu\nSUBJECT: Exchange of. Memoranda between Burton Paulu (March 22,\n1957) and Harold Hill (May 2, 1957) relative to the\nTIAEB Constitution and By Laws0\nOur Columbus agenda was too crowded for us to go into the\ncontents of either of these two memoranda* Now that I have\nhad a chance to go over Harold's reply, I find that he and I\nare in general agreement on the nonsubstantive items I brought\nup© He picked up several mistakes X had made in reading the\nConstitution, and suggested several Improvements in the changes\nI had outlined*\nIt seems that at our St* Louis meeting we ought to take\nsome action on the Constitution, at least in the direction\nof ironing out these various discrepancies in phraseology*\nIn addition to this, we may want to change certain features\nof it to expedite our procedures, and also to tighten them up*\nI should appreciate the reactions of each of you to my\nmemorandum and Harold's, and also to this question* Do you\nagree with me that v/e should have a Constitution Committee\nwhich will go over the matter of both substantive and word\nchanges, reporting at one of our business meetings In St* Louis?\nIf so, who would you recommend as members and particularly as\nchairman of such a committee?\nThis Is a matter which will require a good deal of\ncareful thought and hard work* The chairmen at least ~~ and\nas many other members as possible^hould be fairly well acquainted\nwith NAEB's internal operations, and should be quite skillful\nIn writing the kind of language In which Constitutions are\nnormally phrased, Harold Hill* of course, will be very helpful\nIn putting this together, but I am sure that he wouldn't want\nto assume final responsibility for drafting the exact changes\nintroduced at the Convention* In any event, we shall ask\nLenny Marks for his assistance* But the main job is ours,\nneither his nor Harold's*\n?£ay I hear from you on these matters sometime at your\nearly convenience?"
}