{
  "id": "d496-89",
  "text": "* -\nMEMORANDUM\nSeptember 19, 1957\nTo: Members of the Nominating Committee\nRichard B. Hull, Chairman\nMartha Gable\nHoward L. Johnson\nHarry Lamb\nH. B. McCarty\nJames S. Miles\nJames Robertson\nEdward Wegener\ncc: Board of Directors; Harry J. Skornia\nProm: Burton Paulu\nFirst, let me thank you for your willingness to serve on this\nimportant committee. Since the officers of NAEB bear major\nresponsibility for managing the affairs of the Association, and\nsince the people nominated by this committee are usually those\nelected, you can see that your job is an important one.\nI have tried to appoint to this committee people representing\nthe major interests and points of view found in our Association.\nThere are representatives of universities, public school systems\nand community television stations; people whose principal interest\nis in radio and some whose major work is in television; some from\nlarge stations and some from small; some who have been with us\nfor a long time, and others who are relatively new to NAEB. Taken\nas a whole 1 think this committee represents an excellent cross\nsection of our membership.\nFor your information, may I quote from the minutes of the\nColumbus meeting of the NAEB Board of Directors:\n^As to nominating officers for the Association, recommendations\ncame forth that officers be nominated in advance of the\nconvention and that several slates be presented to the\nmembership. Paulu will appoint a nominating committee\nprior to the St, Louis convention and suggest that the\nnominations be made available sometime in advance. It\nwas pointed out, however, that in previous years the\nnominating committee was announced early in the convention\nand the membership encouraged to talk with the committee\nthroughout the convention.”\nIt didn't seem practical to make nominations ”in advance of the\nconvention, since the committee has to meet in order to engage in\nthe kind of frank discussion required, and it can't do that before\nits members arrive in St. Louis. But it is possible to announce\nnominations prior to voting (on the last day).\nSince your names will be listed in the next Newsletter, you\nprobably will receive a number of suggestions from members. May\nI too, therefore, make a few comments?"
}