{
  "id": "d1435-11",
  "text": "SOCIAL RESPONSIBILITY OF RADIO 109\nof competition in the economic field by the tremendous growth\nin the concentration of economic power in the last seven years.\nWhat has this matter of the growth of monopolies and the\nforecast of a business recession to do with freedom of expression\nand editorial policy in radio?\nIt seems to me that it has this to do with it. The free ex¬\npression of views and opinions on social, economic, and political\nquestions provides some check on the behavior of large corpo¬\nrate interests and monopolies. The removal of competition in\nthe field of ideas would be of benefit to the large corporations\nmuch as the removal of competition in business.\nThere is a trend today towards imposing severe restrictions\nupon labor organizations in the country. Here at this Institute\nthere has been some evidence that some commercial broad¬\ncasters would prefer not to have the competition of vigorous,\nlive, non-profit, non-commercial educational stations.\nThe present campaign urging punitive action against demo¬\ncratic organizations of workers and towards imposing conform¬\nity of ideas under the penalty of a challenge of your patriotism\nwill thrive on a one-sided presentation of views and opinions\nand will soon die in an atmosphere of free expression of con¬\ntroversial views and opinions on public issues.\nTwin demands for editorial rights and the creation of prop¬\nerty rights in radio channels for owners of broadcast stations\nare part of a current trend towards concentration of control in\nthe expression of ideas. This trend in the field of expression\nof ideas reflects the concentration of economic power in the\nradio broadcasting industry.\nReports for 1946 show that five corporation sponsors pro¬\nvide one-fourth of the network billings, and just 10 corporation\nsponsors supply over one-third of the network billings.\nIf certain advocates are victorious in their fight for property\nrights in radio channels and station editorializing, their victory\nwill be over you, the American listener. You will be the vic¬\ntim. For your daily decisions in building a stronger democracy\nyou will have lost a large part of your opportunity to choose\nalternatives through the competition of ideas.\nIn a truly free radio, it seems to me, the owner of a broad¬\ncast station will have rights of expression that are neither\ngreater nor lesser than those of other responsible persons or\norganizations in the community the station serves.\nIn the WHKC case, the UAW-CIO fought for observance"
}