{
  "id": "d1435-13",
  "text": "SOCIAL RESPONSIBILITY OF RADIO III\ntheirs, adding this suggestion. After you have listened, speak!\nIf you have heard balanced programming, equal treatment of\nopposing views, tell the station, the network; tell the FCC and\nyour friends. Those are the programs which will maintain and\nextend democracy. But if you have heard a one-sided pres¬\nentation, then speak up, too, for by your silence you will be\nvoting for the loss of important rights that you are entitled\nto as a listener.\nPAUL D. P. SPEARMAN5\nI SUPPOSE THAT MY THINKING AND MY ANSWER tO the ques¬\ntion, “Should Radio Have an Editorial Policy?” conforms to the\nthinking of no other man; that I may be put down as a non¬\nconformist from the very outset.\nBriefly, I am personally opposed to any attempt to infringe\nupon or limit the right of free speech, whether by radio or\notherwise. I am a stickler for the maintenance of all constitu¬\ntional rights and am unalterably opposed to any tinkering with\nany of them by Congress or by any administrative agency which\nthe Congress may create. I believe, however, that there are\nlegal rights which should be exercised most sparingly, and I\ndo not believe any of them should ever be abused. Because\neditorializing is such a tremendous responsibility, I personally\nbelieve that the right to editorialize should be exercised, if at\nall, only in extraordinary circumstances. The right should be\nused only when it follows the ascertainment of all facts and\nan objective analysis of them, and these requirements can be\nset only by men of outstanding experience who possess the\nhighest order of common sense and good judgment.\nEditorials, in my opinion, should never be broadcast with\nreference to controversial issues which admit of logical argu¬\nment, both pro and con, supported by facts. Such questions\nshould be reserved for bi-partisan discussion to the end that\nthe public may get the benefit of all the facts, and to the further\nend that intelligent listeners may form their own opinions on\nthe basis of the facts presented on both sides of the subject,\nwithout having to depend upon the argument of another.\nMy real thinking on the subject of editorials can best be\nstated by referring to an experience I once had in court. I\nargued in support of a motion then before the court. During\ns Attorney, Washington, D. C."
}