{
  "id": "d1435-14",
  "text": "112\nEDUCATION ON THE AIR\nthe course of the argument by my adversary, in opposition to\nthe granting of the motion, he was interrupted and asked by\nthe court, “Does counsel challenge the power of the court to\ngrant this motion?” My adversary quickly flashed back the\nanswer, “Counsel does not challenge the power of the court\nto grant the motion, but he does say that if the court exercises\nthat power the court should be impeached!” That just about\nstates my position with reference to editorializing.\nThe right of free speech is guaranteed by the First Amend¬\nment to the Federal Constitution, and I, like millions of others,\nam adamant in my opposition to any attempt at limitation of\nthat right, and that regardless of who may attempt to cir¬\ncumscribe it.\nThe Congress is completely devoid of power to limit or\nrestrict the plain meaning of the First Amendment to the Con¬\nstitution. Further, it is axiomatic that the Congress cannot con¬\nfer power upon an administrative or quasi-judicial agency to\ndo that which the Congress itself is precluded from doing. In\nshort, the Congress cannot clothe the Federal Communications\nCommission with power or authority to restrict the right of free\nspeech, and any attempt to confer such authority on that Com¬\nmission would clearly be unconstitutional and invalid. It fol¬\nlows as a matter of course that the Federal Communications\nCommission has no authority to promulgate a rule or render a\ndecision which would prohibit the broadcasting of editorials\nby radio. Actually, for the Commission to make such a rule\nor by decision establish such a precedent not only would violate\nthe First Amendment to the Federal Constitution, but would\nbe a clear violation of Section 326 of the Communications\nAct which specifically prohibits the Commission from exer¬\ncising any power of censorship over that which is broadcast\nby radio stations.\nIf it should be assumed that broadcast stations are to go in\nfor editorializing on this, that and the other subject or issue,\nwhat, in general, may be expected? In the main, we could\nexpect the slanting of editorials in the direction of what would\nbe best personally for the broadcaster. Since he is limited to\nreceiving a license for a maximum of three years and must\napply to some agency of the Federal Government every three\nyears for the right to continue in business, that simply means\nthat under a Democratic Administration he would tend, in most\ncases at least, to go along with the Democratic line of thought,"
}