{
  "id": "d1435-17",
  "text": "SOCIAL RESPONSIBILITY OF RADIO II5\ngo to any station other than his own and demand time to express that\ngroup’s judgment. I don’t see how freedom of speech enters into the\nquestion of the broadcaster’s right to use a facility, a wave length, over\nwhich he has monopoly, in the interest of expressing his own opinions.\nIt would seem to me that he is not at all shut off any more than anyone\nelse from the regular channels of freedom of expression.\nMr. Howell:\nI would just like to ask Mr. Griffin if he means that he is opposed\nto the broadcaster’s having equal access to his own facilities along with\nthe other members of the general public. Do you believe, then, that a\nclarification of that particular language of the Mayflower decision\nis in order?\nMr. Griffin:\nI think, Mr. Howell, you raised the difficulty that worries most of\nus when you pointed out that, in those abundantly desirable things\nyour own station did, you said: “the listeners had faith in us and had\nfaith in the station.” Therefore, the listeners gave more support and\nmore attention to your statement of the situation.\nI don’t think there would be any difficulty with the Commission in\nyour case. However, if a man owned a radio station and decided to\nuse that control to air his political or economic views steadily and inces¬\nsantly, it seems to me that such broadcasts probably would not merit\nspecial attention and special consideration. I should think that radio\nbroadcasters, like the rest of us, ought to be required to get “space”\nrather than having a special access that is barred to the rest of us.\nSubstantially, Mr. Fly says, directly in answer to your question, that\nhe favors letting the decision stand where it is.\nMr. Spearman:\nMr. Chairman, in talking about the infernal Mayflower decision,\nI suppose I am the only living man who knows what is in that record\nbecause I spilled blood in getting it in. The man who heard that\ncase is now dead.\nI don t think the Mayflower decision should have been written\nas it stands.\nI think it should have been thrown into the ashcan rather than re¬\nleased. I think the Federal Communications Commission still ought to\nsay something that would indicate they do not feel bound by the decision.\nThe decision went all out in left field. It didn’t decide the case on\nthe record. It simply set up a prerequisite for someone to meet before\nhe could get a license. If that wasn’t censorship—the way it was han¬\ndled—I am a monkey.\nThe Commission established a precedent. It set up a condition to"
}