{
  "id": "d1438-0",
  "text": "1346 Connecticut Avenue, N.W.\nWashington 6, D. C.\nPhone North 7-6000\nVol. II No. 12\nDecember 19 63\nOn a Personal Note\nLike so many others, I too feel compelled to express something of my feelings about\nthe death of President Kennedy.\nSince so much has been said and written about him already, and expressed so much\nmore eloquently than I could hope to do, this may seem rather needless and\nredundant. And yet, the fact that so many of us have this compulsion for personal\nexpression is, in a way, a measure of the man we have lost. Something there was\nabout the late President that made for a one-to-one relationship with thousands -\neven millions - of people everywhere, in this country and around the world. People\nquite literally thought of him as a personal friend. It did not matter that they had\nnever met him or spoken to him; they knew him. In part this was a factor of the age\nof electronic communication which made the sound of his voice and his image a\ncommon experience in all our lives. But the media were only means of extending a\nmagic that had to be present in a personality which retained its impact when trans¬\nmitted through these devices. More likely this feeling of personal kinship he\nengendered was the result of his sensitivity to other people - a tribute to his under¬\nstanding and sympathetic heart.\nI, too, had this feeling of personal friendship; though, in fact, I had merely met him\nonce and had seen him perhaps a dozen times in person. The meeting was the\noccasion of the signing at the White House of the ETV Facilities Act. About ten of\nus, looking solemn and dignified, were ushered into the President s office. He\nimmediately arose and came around the desk to greet the Congressional members\nwith a quip and a smile, calling them by their first name or nickname (Hello, Orin;\nHi, Maggy). Everybody relaxed and opened up under the warmth of the President's\neasy manner and friendly informality. I was especially impressed with the fact that\nthe President did not wait to be approached but cai£g forward eagerly to greet\neveryone - including John Bystrom and myself, who were rather self-consciously"
}