{
  "id": "d1463-0",
  "text": "N-A-E-Q NEWS .LETTER\nNational Association of Educational Broadcasters\nMadison, Wisconsin - March 20, 1957\nOHIO INSTITUTE NAEB PLANS TAKE SHAPE\nThe following program has been arranged by the NAEB as a part of the annual\nRadio Institute at Columbus, May 5 - 5.\nMonday, May 3 - 2:00 P.M.\nEDUCATIONAL BROADCASTING BY EDUCATIONAL STATIONS\nPresiding: Carl Menzer, WSUI\nVice President, NAEB\nI EDUCATIONAL STATIONS ON THE MARCH\nRoll call by Jos. F. Wright, WILL\nFour minute reports of current outstanding achievements\nin college broadcasting from coast to coast.\nII WHY THE EDUCATIONAL STATION?\nH. B. McCarty, WHA, President NAEB\nIII GENERAL DISCUSSION\nItem I concerns every member! Information on who will be present to give re¬\nports, what topics are to be listed, whether reports to be read will be submitted,\netc., should be sent to Mr. Wright without delay. The program must be made up.\nSend the data to Jos. F. Wright, Radio WILL, Champaign, Illinois. Don*t wait for a\nspecial invitation. Select the subject — and write it up. Four minutes, or 500\nwords isn*t much; but enough in which to say a lot.\nNAEB 3USINSSS SESSION - COLUMBUS. OHIO, MAY 5\nThe association will hold a closed meeting at the Ohio Institute on Monday\nevening, May 3. Among the items to be taken up are the matters of the recording\nequipment, transcription exchange service, the annual convention pirns, and other\nbusiness which may be at hand.\nLOOKING TO THE COMING SEASON\nThis is the time of year when program planners are busy on their schedules for\nnext fall and winter. Now, while people are in their normal activities, before the\nexamination time, and before potential broadcasters scatter for their summer vaca¬\ntions, is a good time to lay the groundwork.\nMore than ever before various teaching departments are wondering how they can\nadapt their material to radio. Conferences and discussions will help thorn to get\nstarted right. Why not visit the department heads and talk over the possibilities,\ngive auditions to find suitable voices, select able writers, and work toward com¬\nbining abilities.\nIn most eVery department are younger men, the leaders of tomorrow, who have\nsecret desires to try the radio. By working with them, some unusual features may\nbe developed. Look now to the coming broadcasting season!"
}