{
  "id": "d391-45",
  "text": "REPORTS OF WORKSHOPS AMD SEMINARS\n2.\nPubl.\nNo.\nW-l Public School Broadcasting (Third Allerton Seminar) - Harry Lamb, Editor\nA report of the deliberations and recommendations of the seminar\non in-school broadcasting, held at Allerton Park, University of\nIllinois, June 15-24, 1952. 50 pp. Paper. $1.00\nW-2 In-School Writers* Seminar - Edward Stasheff, Editor\nA report of the seminar for writers of in-school radio programs\nheld at Station KSLH, St. Louis, Missouri, June 7-H; 1954. 36 PP*\nPaper. $1.00\nW-3 NAEB Region II Seminar Workshop Report - R. F. Schenkkan, Editor\nReport of meeting of NAEB members in Region II, held March 13-14,\n1953; at the University of North Carolina. 25 pp. Paper, $1.00\nW-4 NAEB Region III Workshop Proceedings - William Bender, Jr., Editor\nReport of the meeting of NAEB members in Region III, held May 22-24,\n1953, at the University of Michigan. 19 pp. Paper. $1.00\nW-5 NAEB Lincoln Lodge Seminar on Educational Television - Burton Paulu, Editor\nA report of the deliberations and recommendations of leaders in the\nfield of educational broadcasting who gathered at the University of\nWisconsin, June 21-27, 1953; for an intensive \"think session\" about\neducational television. June, 1953* 109 PP« Paper. $2.00\nW-6 NAEB First TV Production Workshop - 1953 - Edward Stasheff, Editor\nReport of production workshop for persons engaged in educational\ntelevision, held at the University of Illinois, August 28-Septem-\nber 18, 1953* September, 1953* 112 pp. Paper. $2.00\nW-7 NAEB Second TV Production Workshop - 1954 - Edward Stasheff, Editor\nReport of the production workshop for persons engaged in educational\ntelevision, held at Michigan State University, August 23-Septem-\nber 10, 1954. An account of its lectures, demonstrations, pro¬\ncedures and projects. April, 1955* 133 PP« Paper. $2.00\nW-8 NAEB First TV Engineering Workshop - 1954 - Cecil S. Bidlack, Editor\nReport of the engineering workshop for technical personnel in\neducational television, held in New York City, October 22-26,\n1954. June, 1955* 6l pp. Paper. $2.00\nW-9 NAEB Management Seminar - 1953\nReport of the seminar for educational television management personnel,\nheld at Iowa State College. September, 1955* Paper. $1.00\nF-10 NAEB Region IV Meeting\nReport of the meeting of NAEB members in Region IV, held October\n1, 1954, at Iowa State College. October, 1954. 24 pp. Paper.\n$1.00"
}