{
  "id": "d391-66",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 GREGORY HALL\nURBANA, ILLINOIS\nDr. Harry Skornia\nExecutive Director\nNAEB\nJuly 13, 1959\n14 Gregory Hall ‘ t\nUrbana, Illinois\nDear Harry:\nI think that the NAEB should definitely participate in the\nacitivity of the International Association for Mass Communication\nResearch which you wrote about. First of all, I think it important\nthat an organization in the United States cooperate in these inter¬\nnational ventures. Secondly, it seems to me that the bibliographical\nmaterial will prove of tremendous benefit to educational broadcasters\nand broadcast researchers in this country.\nI would think that it might be well to have one member of the\nresearch committee representing the NAEB in each of the five sections\nof the International Association. If you think this is all right, I\ncan write to some of the members and see if they are interested.\nMeanwhile, I will write to Terrou, of the Association, and get\nfurther details on how we might participate, cost of the documentation\ncards, how and when bibliographical items shouHbe sent. We can then\nnotify all members of the NAEB in the newsletter to feed items in —\nany of their research projects or other materials which are suitable --\nto a central place. This also could well be the function of one member\nof the research committee. Actually, if people send it in proper form,\nthe chairman of the committee could handle this quite easily. Anyway,\nI will let you know when I get details from this fellow in Italy.\nMarshall McLuhan was through the other night -- spent the night\nin Iowa City while en route to the West coast. For the first time, I\nbelieve I have some idea of what it is he really plans to do. Some¬\nhow, this simply does not get communicated in his letters. As you can\nimagine, it was an interesting evening. He does not agree with me\nbut I am now not at all sure that he could not sit down for six months\nand write the report which he plans to wind up with after talking to\npeople here and there for a year or so. I also explained my suggestion"
}