{
  "id": "d391-95",
  "text": "Dr. Skornia\nNovember 17, 1959\nPage 2\n1 do not mean to imply that the NA£B should provide consultation only for\nthe institution seeking to get a hundred-thousand dollars from the gov¬\nernment or some foundation. I believe that the small FM station which\nwants to duplicate the Kager study or wants to pretest some of its programs\nwith audience response profiles should also have help from the NAEB.\nThe possible reorganization of the committee depends completely on whether\nwe want to attempt what I have suggested above. If we do attempt it, I\nbelieve that thought should be given to a representation on the committee\nof the various research approaches. Dick Evans is obviously a good man\nwho approaches problems from the social psychologist1a point of view.\nBruce Westley is a good general experimental design and philosophy of\nscience man. Ken Harwood is good on the historical and broadcast end* X\nthink that we have noone now who represents the sociology approach or the\neducational-psychology approach. For the former, 1 would think that some¬\none such as David Sills, currently acting director of the Bureau of Applied\nSocial Research at Columbia would be excellent. Howard Rowland at Pitts¬\nburgh would represent this point of view also, but not as well. Charles\nNeidt of the University of Nebraska would be a very fine educational\npsychologist. Hideya Kuraata would be another good sociologist but I just\ndo not think that he has the time to be of much help.\nThe problem with this committee that I have suggested should be immediately\nobvious. None of them are members of the NAEB except Harwood and, defining\nmembership loosely, Bruce Westley. It might be possible to have a committee\nof NAEB members and include the sort of persons I have named above on the\nconsulting team. The problem here is that members of the committee would\nfeel that they should be doing the consulting and, in many cases at least,\nI am sure that they should not. This could create great problems. This\nis not to say that persons such as Ellery and Merrill are not able and\nhave not been good members of the committee. However, if you are trying\nto obtain funds to set up such a program, their names are not going to\nhelp as much as names such as Sills, Evans, and Neidt. Secondly, and to\nbe honest, they do not have the research background or experience to give\nas much help as I believe the people could whom 1 have nam«&• On the other\nhand (and here you see how ambivalent I am), they have been extremely\ncooperative as members of the committee this year. Both are quite eager\nto work for the NAEB.\nAnyway, if such a consulting team was set up, the members (or member) who\nwould act as consultants on any particular job would depend on the type of\njob it was. Obviously, if it is instructional television, an educational\npsychologist is needed. If it is general evaluation of a broadcasting\nstation or some of its programs, a broadcast researcher is needed. If it"
}