{
  "id": "d1389-0",
  "text": "NEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. XXVI NO. 5 MAY 1961\nn\nNAEB Sends Team To Sudan\nDr. Sydney W. Head, on leave from his duties as\ndirector of the division of communications services at\nthe University of Miami, is heading a three-man\nteam of broadcasters in the Sudan. The contract be¬\ntween the NAEB and the International Cooperation\nAdministration was signed last month.\nDr. Head is already in the Sudan, and two en¬\ngineers will join him this month. Clarence D. Phillips,\nchief engineer of the television center at the State\nUniversity of Iowa, will be the studio engineer, act¬\ning as consultant and also training native personnel\nin basic electronics and in operating and maintaining\nstudio and control room equipment.\nA transmitter engineer is yet to be named. He\nwill serve as consultant in installation, operation, and\nmaintenance of transmitters and antennas—and will\ntrain native personnel in these functions. Dr. Head\nwill serve as program advisor.\nPurpose of the project is to aid the Sudanese\nGovernment in its program to improve the technical\nand programing operations of its official radio broad¬\ncasting facility, to get an acceptable and competent\ncountrywide coverage. Programs will be in Arabic,\nEnglish,' and in local native dialects. Both medium\nand short wave facilities are to be expanded, and the\nprogram content is to be improved to compete favor¬\nably with outside broadcasts now being beamed into\nthe Sudan.\nMinow To Speak At NAEB Convention\nFCC Chairman Newton M. Minow will be the\nkeynote speaker at the NAEB convention. He will\nspeak on Monday, October 23, at 8:30 p.m.\nBecause the Willard Hotel could not handle the\nconvention exhibits (because of lack of power), the\nsite has been changed to the Marriott Motor Hotel,\n“Twin Bridges.” This hotel is near the Washington\nMonument. Room rates are guaranteed at the follow¬\ning prices: singles, $12; doubles, $16; and twins, $17.\nNAEB Board Actions\nFollowing are the highlights of the Board meeting in\nColumbus, Ohio, following the IERT:\n• R. Edwin Browne was elected secretary of the\nBoard.\n• The Board ratified the new “charter” of the Joint\nCouncil on Educational Broadcasting (successor of.\nthe JCET) and agreed that NAEB will continue as a\nconstituent member.\n• Approval was given for the expenditure of up to\n$9,000 for remodeling some equipment and buying\nnew Ampex “slave” equipment for the Network.\n• Plans were approved to have a summer seminar\nfor Board members and key committee chairmen.\nThis will be an association self-examination type of\nseminar — a look at what was planned at the Aller-\nton seminar ten years ago, what has been done, and\nwhat the future should be.\nPlanning committee for the seminar (July 16-20\nat the University of Wisconsin) consists of R. J.\nBlakely, Vernon Bronson, Larry Frymire, Harold\nHill, Keith Nighbert, Edward Rosenheim, and Harry\nSkomia.\nPROGRAMING FROM WASHINGTON TO CONTINUE\nThe Board also approved continuation of the NAEB\nNetwork radio programing from Washington. At the\npresent time, this consists of a 15-minute weekly re¬\nport and 30-minute “specials” from time to time.\nAs of September 1, someone will be needed to handle\nthe job, as Leonard Press’s leave from the University\nof Kentucky will have expired.\nPlease write to Harold Hill at the Washington\noffice if you know of anyone who will be in Washing¬\nton on a special assignment and who might be able to\nhandle this half-time programing job as well.\nAre You \"Packaging\" Instructional Materials?\nThe National Education Association is studying\nthe impact of technology upon education—and as part\nof the study, they are examining the development of\n“packaging” of materials. This means combining of\nmedia and materials into an instructional package or\nsystem of materials, to teach part or all of a course.\nMembers of the NAEB are urged to cooperate in\n1"
}