{
  "id": "d1389-1",
  "text": "this study by notifying the NEA of any “packaging”\nplans they know of by schools or businesses. Write\nto Lee E. Campion, Associate Investigator, Technolog¬\nical Development Project, National Education Associ¬\nation, 1201 Sixteenth Street, N. W., Washington 6,\nD.C.\nGeorge Jennings Dies\nGeorge Jennings, Chicago educational broadcaster,\ndied April 4, 1961. He had been director of radio\nand television for the Chicago Public Schools for\nfifteen years, joining the staff in 1938. Also under\nhis supervision was the operation of WBEZ, the FM\nradio station of the schools.\nMr. Jennings was instrumental in the planning and\ndevelopment of Chicago’s ETV station, WTTW. He\nalso inaugurated and directed the School Broadcast\nConference, which pioneered in classroom utilization\nof radio and TV.\nSpeech Association To Meet\nThe Speech Association of America will convene\nin New York City during the Christmas vacation this\nyear. Sectional meetings will be devoted to specialized\nareas of speech and theater, and there will be a general\nsession for new members. More than 2,000 teachers\nare expected to attend. For further information, write\nthe Speech Association of America, Indiana Uni¬\nversity, Bloomington.\nSummer Employment Needed\nAfrican students who are studying in this country\nneed summer employment in order to continue their\neducation in the fall. All of these students speak\nEnglish, and most of them will be available from June\n1 to September 1. If you have or know of such sum¬\nmer employment opportunities, please write African\nAmerican Students Foundation, Inc., Suite 3308, 375\nPark Avenue, New York 22.\nRegion II Members Convene\nNAEB President William Harley and John Schwarz-\nwalder, general manager, KTCA-TV, St. Paul, were\nfeatured speakers at the Region II conference April\n21 and 22 in Birmingham. Individual conferences\nwere scheduled for production, utilization, and engi¬\nneering.\nSPECIAL PUBLICATION OFFER\nEach month the NAEB offers a special sale on a particular\nNAEB publication, at less than one-half the normal price.\nThis month's special:\nTELEVISED INSTRUCTION—99c\nA report of a conference on the use of television in instruc¬\ntion, Purdue University, August 25-September 5, 1958. Edited\nby James S. Miles and Raymond E. Wolf.\nPayment must accompany order. Send to: Special Publi¬\ncation NAEB, 119 Gregory Hall, Urbana, Illinois. THIS OFFER\nEXPIRES JUNE 15, 1961.\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 119 Gregory Hall,\nUrbana, III. $5.00 a year, edited by Betty McKenzie.\nState ETV Commissions\nRespondents to the request in the February News¬\nletter for listings of states with ETV commissions\nnamed Utah, Tennessee, Vermont, South Carolina,\nand Pennsylvania. These are in addition to Alabama,\nFlorida, and Oklahoma.\nNews of Members\nGENERAL\ny For the third straight year, the Detroit Council on\nETV and Radio has given “Musicale,” a Wayne State\nUniversity TV series, a first award as the outstanding\ncultural music program on TV.\n► Six California state colleges are being equipped\nwith CCTV systems by RCA. Full-scale operations\nare planned for the fall term, with major emphasis\non TV as an instructional aid in teaching the humani¬\nties and other courses which lend themselves to lec¬\nture-demonstration presentations.\n^ Dr. Erling S. Jorgensen, on leave from the Uni¬\nversity of Montana, is traveling around the country\nstudying the type of ETV network to recommend to\nhis state’s legislature.\n► The New York State Board of Regents has pre¬\nsented to the New York legislature a plan to encourage\nTV usage there.\n^ Ampex demonstrated in March a new, low-cost\ntape recorder designed specifically for CCTV. An ap¬\npraisal of the recorder by Rudy Bretz and Ken\nWinslow will appear in the May-June issue of the\nNAEB Journal.\n^ April was designated as Educational Broadcasting-\nMonth by Governor John B. Swainson of Michigan.\nMarch 29 marked the 39th anniversary of broad¬\ncasting from the University of Michigan.\nPROGRAMS\n^ Florida’s Governor Bryant chose the state’s five\nETV stations as a means of talking with employees\nof the road department recently. The program was\nvideotaped and distributed to the stations for simulta¬\nneous broadcasting. Employees over the state viewed\nthe program in rooms especially equipped for the oc¬\ncasion.\ny WJCT, Jacksonville, televised “live” the principal\nsessions of the annual convention of the Florida Edu¬\ncation Association which met in that city.\n^ The art of simply reading a book to children is\nnot dead, according to a release from the Wisconsin\nState Radio Council. Using no music background and\nproviding characterizations by his voice alone, Norman\nMichie reads from a book each weekday to the chil¬\ndren of the state.\n^ Governor Patterson became Alabama’s first\ngovernor to be seen on a live press interview program\nover a statewide TV network when he appeared on\nthe ETV network one day in April.\n^ KSLH, St. Louis, is presenting a program to\nanswer questions of school parents. Queries are sent\n2\nNEWSLETTER"
}