{
  "id": "d1389-10",
  "text": "THE STAMP MAN\nNo. S61-85. How to Organize and Run a Stamp Club.\nOn this transcription, the Stamp Man gives complete, simple and\ninexpensive instructions for organizing and operating a stamp\nclub. In his talk he answers the practical questions people ask.\nHistorical Events of the United States. The Stamp Man tells of\nthe historical events of the United States which have been hon¬\nored by special commemorative issues of United States Stamps.\nMUTINY ON THE HIGH SEAS\n“Mutiny on the High Seas\" was written by Jon Slott, famed\nwriter of “White Fires of Inspiration” which received the Carnegie\nAward as the finest educational dramatic series to be presented on\nthe air. The talent used includes radio’s best dramatic actors and\nactresses.\nThis series dramatizes the great exploits of the most dauntless\nspirited men who ever sailed the seven seas. The listener is inspired\nby' their fearlessness in sailing the unknown; their courage to face a\nsea of hidden reefs and wild inaccessible stretches of unnavigated\nwaters. Marco Polo's adventures in the Far East, Magellan's sailing\nthrough the treacherous straits at the tip of the South American con¬\ntinent, William Dampier’s exploits in the Pacific Ocean, and Sir\nFrancis Drake’s experiences in circumnavigating the globe, are a few\nof the adventures brought to life by means of these transcriptions.\n*No. M119-122. Marco Polo.\nPart I. Marco Starts to Far East. Marco’s father and uncle re¬\nturn from Far East with request that a hundred friars be sent to\nKublai Khan to teach Christianity, but the request is not granted.\nThey take Marco with them on their second trip to the unknown\nEast. They cross the deserts of Persia, the lofty steppes of Pamir,\nthe mysterious Tibet and China. Part II. At the Court of Kublai\nKhan. The Polos learn of an army marching to overthrow\nKublai Khan. Marco builds artillery engine to hurl huge stones\ndown onto the enemy. Enemy is confused and routed. Kublai\nKhan arranges a banquet for the captured leader, which is follow¬\ned by his execution. The great Khan is duly impressed by Marco\nand decides to send him on an important mission to Karazan.\nNo. M123-130. Marco Polo.\nPart III. Marco Rises in Favor. He obtains much valuable in¬\nformation regarding the Karazan Province, which pleases Kublai\nKhan very much, so he honors Marco by permitting him to select\n11"
}