{
  "id": "d1389-2",
  "text": "to the station, and once a week educators and a panel\nof parents are brought together to tackle the questions\non the air.\nPERSONNEL\n► Roy J. Johnson has been named interim director\nof the division of communications services at the Uni¬\nversity of Miami, replacing Dr. Sydney Head, who is\non leave of absence heading an NAEB project in the\nSudan. Johnston comes to Miami from North Carolina,\nwhere he was director of WUNC-TV.\n► Also at Miami, Paul Nagel, Jr., has been named\nacting chairman of the radio-TV-film department in\ncharge of teaching and other academic activities.\n^ Dr. Walter Emery, Michigan State University,\nreceived the Distinguished Alumni Award at the\nnational convention of Pi Kappa Delta (national\ncollegiate forensic fraternity) March 27, at Oklahoma\nState University.\n► Arthur David Cloud, Jr., has been appointed\ngeneral manager of WYES-TV, New Orleans. He\nreplaces Duff Browne, who resigned. Cloud is return¬\ning to New Orleans after a four-year stay in Chicago,\nwhere he headed the radio-TV department of Camp-\nbell-Mithun, Inc., an advertising agency.\nPRESIDENT'S SAY-SO\nAt this time last year there was serious discussion\nin progress concerning the possibility of transferring\nthe NAEB Radio Network to the NETRC. Subse¬\nquently negotiations broke down and the transfer was\nnot voted upon at the NAEB convention in San\nFrancisco. Negotiations have not been re-opened\nsince. While it is conceivable that the transfer might\nbe effected in the future, no such possibility currently\nexists.\nIn any case, we should continue to preserve and\nstrengthen the Network in every feasible fashion. In\nthis respect, an inter-office memorandum prepared by\nLeonard Press (working on Network news pro¬\ngraming from Washington while on leave from the\nUniversity of Kentucky) so impressed me that I felt\nit should be given greater currency. I am publishing it\nforthwith.\n—Bill Harley\nARE THE RESOURCES OF MEMBER INSTITUTIONS BEING FULLY EXPLOITED?\nAmong the most important of our resources,\nsurely, are the faculties of our institutions. This re¬\nsource is nowhere near being fully exploited. And it\nshould be.\nThere is hardly a faculty in this country which\ndoes not number at least a few brilliantly original\nminds which are as articulate as they are knowledge¬\nable. There is hardly a college in the country which\ndoes not have a Frank Baxter or an Alan Watts or an\nS. I. Hayakawa or an Alburey Castell . . . scholars\nwho are at once authoritative, provocative, and enter¬\ntaining—who may not yet be known beyond their own\ncampus but who deserve to be.\nWith such enormous intellectual treasure in our\ninstitutions, it is a matter of unhappy wonder that\nthe vitality of Network programing should seem to be\ndraining off under a growing dependence on programs\nfrom outside agencies. The problem is one of balance.\nThe Network should certainly be a window on the\nworld outside, but it must never cease to be a window\non the rich world inside as well.\nThis is to suggest the need of a shift in emphasis.\nWhy aren’t we mining more productively the wealth\nwhich is our faculty?\nPerhaps the answer is that too many of us think\nthere is no point in offering our best faculty lecturers\nto the Network because, after all, every member school\nthinks its teachers are tops, as they unquestionably\nare.\nOr perhaps many of us have fallen into the habit\nof thinking that a program which doesn’t require\nextensive production is not unique enough, somehow,\nto be worth submitting to the Network.\nThe answer to the first “perhaps” is, of course,\nthat there is nothing as stimulating to the intellect, on\nevery level, as an exchange of ideas and expression\nby a variety of exciting personalities. And member\ninstitutions are much more likely to attempt to do\nlikewise than to petulantly refuse to program other\nfaculties.\nThe answer to the second is that it takes quite a\nproduction to equal the fascination, the humor, the\ndepth, the inspiration—the sheer entertainment value\n—of an outstanding lecturer. And even such a pro¬\nduction requires, at center, a display of no mean talent.\nA good teacher, on the other hand, needs little if\nany production. He provides his own. He is a master\nof pacing, of style, of content development. All he\nneeds is your microphone and a conducive atmosphere.\n• Recommendation 1: Tape your top teachers in\nterms of series which you and they feel are worth\ndeveloping for the large and critically responsive\naudiences of the Network. Submit two programs for\neach teacher. Be selective in the extreme ... it would\nbe an unusual institution that did not seem to have\nmany such superior lecturers. Select on the basis of\nsubject as well as teacher . . . but we do not want\nMAY 1961\n3"
}