{
  "id": "d1389-2",
  "text": "FORWARD\nThe C. P. MacGregor Company is the World’s oldest and largest\nproducer of high quality transcribed dramatic productions. It has been\nin business for 12 years and has served more' than 400 radio stations\nin every English speaking country of the World. The recording\nstudios are the finest equipped in the West, and the quality of the\ntranscriptions is unsurpassed.\nIn response to the growing school demand, it has been decided to\nmake a trial offer of a few of MacGregor’s finest educational features;\nand Dr. Cline M. Koon, nationally known authority in the school use\nof radio and recordings, was employed to select from the vast library\nthe programs which he considered most suitable for school use. This\ncatalogue contains a descriptive list of his selections.\nMost of the selections offered in this catalogue fall in the fields\nof history, drama, and stories for younger children. The historical\nfeatures are as authentic as it was possible to make them. They are\nnot intended to present a complete history of a period, but to arouse\ninterest and to develop an insight which will stimulate even the slow¬\nest pupils to want to learn more, and to carry out projects originating\nfrom the ideas and suggestions in the selection. The historical and\nliterary episodes are dramatically presented by some of the best\nknown voices on the air today. Suitable supporting music and sound\neffects are used to make all episodes vividly realistic. For the first\ntime, the C. P. MacGregor Company offers schools some of radio’s\nfinest educational features.\nEvery transcription includes two fifteen minute programs on a\n16\" disc. They run at 33 1/3 revolutions-per-minute, and cannot be\nplayed on an ordinary phonograph. They are laterally cut and may\nbe played on any disc sound recorder, turntable, or transcription player\nwhich operates at 33 1/3 RPM. When played on a reasonably good\nreproducer, the quality is better than that obtained from the finest\ntypes of electrical phonographs. In addition, the volume of sound may\nbe increased to meet the needs of practically any school situation.\nWith reasonably careful use, the transcriptions will last indefinitely.\nThese (selections are intended for serious educational use in\nschools, and should not be regarded as a source of entertainment or\nrelaxation. Therefore the teacher should select the programs most\nsuitable to meet her instructional needs, and encourage her pupils to\nbenefit from listening in much the same way they benefit from reading,\nor other class activities. Definite plans should be made for listening,\nand the teacher (and possibly some of the pupils) should listen to the\nepisode before it is presented to the class. Listening should be fol¬\nlowed by class discussion and other activities to capitalize upon the\ninterest aroused, and to intigrate the transcribed material into the\nlearning situation at the time.\nC. P. MacGregor, President"
}