{
  "id": "d1389-6",
  "text": "*No. D22-23. Edgar Allan Poe.\nPart I. The Raven. Charges against Poe. He explains the\norigin and recites “The Raven.” Poe and Virginia living in\npoverty. He receives only $10 for his immortal poem. Part II.\nPoe Offered a Government Position. Letter received from Wash¬\nington offering Poe a secretarial job in the Library of Congress.\nHe and Virgnia are quite elated. Poe starts to Washington by\ntrain, but meets a man on the train who offers him liquor. They\nboth get drunk. Virginia and her mother discuss the good times\nahead. But when Poe arrives at the Library of Congress, he is so\ndrunk that he is refused the position and ordered out of the\nGovernment office.\nNo. D18-25. Edgar Allan Poe.\nPart III. Poe at West Point. Poe receives an appointment to\nWest Point. His foster father visits him there. Finds Poe very\nunhappy. Poe explains why he does not like West Point. He de¬\ncides to leave. He fails to report for drill, and, after giving an\nunsatisfactory explanation, is dishonorably discharged. Part IV.\nThe Effect of Virginia’s Death Upon Poe. Poe grieves, quotes\nparts of “Annabel Lee.” His mother-in-law tries to console him,\nbut Poe refuses to be comforted. He discusses life and death, and\nhis love for Virginia. He lives at the home of Mrs. Clemm, his\nmother-in-law.\nNo. D28-34. Mary Stuart—Queen of Scots.\nPart I. Mary Becomes Queen. Mary lands safely in Scotland\nand gives thanks to God for His protection on the sea voyage from\nFrance. Her coming to Edinburgh is not desired by the discordant\nCouncil which is trying to govern Scotland, but the common peo¬\nple welcome her, as they hope for better times. Messenger rides\nto London to inform Queen Elizabeth, who had encouraged pirates\nto take her ship at sea. Part II. Mary Avenges the Murder of\nDavid Rizzio. Having married Lord Darnley to satisfy the\nwishes of her royal council, she refuses to permit him to have\nany influence in the affairs of state or to be more than a servant\nabout the Palace. He resents this and the influenced of her secre¬\ntary, David Rizzio. So he has Rizzio killed; but Mary cleverly in¬\nduces him to tell who the murderers were, and she has them put\nto death. Their friends swear vengeance.\n*No. D31-37. Mary Stuart—Queen of Scots.\nPart III. Lord Bothwell Clashes with Lord Darnley. Bothwell,\ncrude but loyal, warns Mary of intrigues and plots against her.\nClashes with the weak simpering Darnley whom Mary plans to\nwed. The wedding. Part IV. Mary Goes to England and is\nImprisoned by Elizabeth. After the death of Lord Darnley,\n*When two or more transcriptions dealing with one series are\nlisted, the most suitable one for school use is starred thus (*).\n7"
}