{
  "id": "d1389-8",
  "text": "persuades him to go for a walk. The horse runs off. Part IV.\nStrauss' First Opera. Johann dressing for the opera. Irritated at\nPoldi. Mme. von Eld sings leading role. Strauss directs orchestra.\nMrs. Strauss goes back stage to see Mme. von Eld. Tells her what\nJohann likes and dislikes. Johann enters and is disturbed to find\nPoldi there.\nNo. D80-91. Elizabeth Barrett.\nPart I. Elizabeth Meets Mr. Browning. Elizabeth receives a\nletter from Robert Browning asking to meet her, but her stern\nfather advises her not to see Browning since she is an invalid.\nShe is very oppressed but her Uncle Sam encourages her and gives\nher a good-luck locket. Part II. Browning Grieves for Elizabeth.\nThe life of Elizabeth in retrospect. Browning inconsolable over\nElizabeth’s death. In his dreams, she returns and encourages him.\nBut he was always sad thereafter for when Elizabeth died, his\nsoul was buried with her.\n*No. D82-85. Elizabeth Barrett.\nPart III. Browning Meets Ebee. Browning calls at the Barrett\nhome unexpectedly, and is told by her father that Elizabeth is an\ninvalid. Introduced to her. They discuss writings, but her father\ninterrupts with questions about finance and affairs of state. Later\nUncle Sam tells Browning of the utter dominance of Elizabeth by\nher father. Part IV. Elizabeth Marries Browning. Browning\nfinally persuades Elizabeth to be his wife. They are secretly mar¬\nried and sail for Italy. Mr. Barrett is shocked to hear of it, and\nnever forgives her.\n'•f\nNo. D96-97. Brigham Young.\nPart I. Mormons Enroute West Send Men to Fight in Mexican\nWar. They are encouraged by Young’s vision as they plod across\nthe Great Plains. U. S. Army officer arrives and asks that men be\nsent to fight the Mexicans. Five hundred enlisted. Not one. falls\nin battle. Scout Flint warns of Indian trouble ahead. Young pro¬\nposes that peaceful means be used in dealing with the Indians.\nPart II. Hard Times, But Finally Reach Their Destination.\nYoung stresses his faith in God. Scout Flint reports that the only\ntwo water holes in the next 40 miles have, been poisoned by the\nIndians. Game is scarce. Young becomes ill. Young arises from\nhis sick bed to ride ahead and gives his approval to a favorable\nspot for the new settlement.\n*No. D98-99. Brigham Young.\nPart III. The Arrival. The Mormons arrive at Salt Lake and\nstart building their homes. Young directs his people to till the\nsoil which is barren and hard to work, but becomes fertile after it\nis irrigated. Indians unfriendly. Part IV. The Locust Plague.\nThe winter of 1847-8 brings death and near starvation but their\nfaith never wavers. The next summer the locusts descend and\n9"
}