{
  "id": "d1499-3",
  "text": "NAJEB NEWS LETTER\nDec. 1, 1940\nPage 4\nbe developed.\n\"Courses are conducted in radio broadcasting, script vrriting, radio\nin education, and research in radio. Mr. Robert £. Allen is director\nof radio programs, and Dr. Lee Norvelle is responsible for the\nadministrative part of the work. On January 1st they expect to move\ninto new headquarters where they will have the most modern type of\nbroadcasting equipment, adequate studios, and auditioning facilities.\n\"IOffA - Radio Station WSUI has, during the past year, oompleted the\ninstallation of new transmitting equipment and directional antennae,\nwith a power of 5,000 watts day and 1.000 watts night. An application\nis on file with the Federal Communications Commission to increase\nthe night-time power to 5,000 watts. A new building devoted entirely\nto radio broadcasting has been erected with entirely new equipment\nfollowing the latest engineering practices. Total expenditure for\nthis orolect has been approximately Jl37,000.00. The radio station\nopera*- V with a budget of $8,000.00 annually for maintenance and op¬\neration. The State University broadcasts approximately thirteen\nand a quarter hours daily. Carl H. Menzer, Director.\n\"Outstanding figures in many fielos of radio University\nof Iowa'' first annual radio conference October 17-19, 1940. The\nobject of the three-day conference was to consider problems in\napplied radio, consisting of lectures, discussions and demonstrations.\n\"KANSAS - The University of Kansas owns and operates its own station,\nKFKU, which shares time with 1/ifREN, a regional station affiliated with\nthe N.P.C. Blue Network. KFKU is on the air an average of six hours\nper week during the school year. The University provides a budget\nof 4,550.00 for the broadcasting station. During the\nthe station broadcast 585 different programs, involving 35 different\ndepartments and eight colleges of the University. Faculty members\npresented approximately seventy percent of the total number of programs.\n\"No dei nite move has been made toward the organization of a radio\ncouncil. However, some attempt has been made to encourage the ctate\nDepartment of Education to take tie initiative in forming a radio\ncouncil on a state-wide basis.\n\"KENTUCKY - University of Kentucky programs are broadoast regularly\nover the Mutual Broadcasting System, six carried coaet-to-coast;\nThe Southern Network; V/HAS, Louisville; \"L\", Cincinnati; JLAh,\nLexington. The School of the Air is presented five days a week\nthe programs designed so as to be equally helpful to B°hool ch\nand adults. Five fifteen minute agricultural programs are presented\nweekly. Miscellaneous programs include \"From the Kentucky Mountains,•\n\"Listening Centers, \"The Wildcat Review,\" \"Behind the Headlines,\n\"Trie Best Band in Dixie,\" student interviews. The Rhythmettes,\n\"Visitinq Kentucky’s Industries,” and rc~ -7 special features originating\nin the University of Kentucky studios. Mr. Elmer 8. Sulzer is Director\nof Radio Activities.\n\"In order to make the University and other valuable radio features"
}