{
  "id": "d1499-4",
  "text": "NAEB NEWS LETTER^_Dec. 1, 1940.Page 5\navailable to people living in the more remote portions of eastern\nand south-eastern Kentucky, a plan was inaugurated during the spring\nof 1833 whereby the University would administer the equipping of\nsuch locations with radio sets, the operators of such Listening\ncenters to see that they were tuned regularly to educational and\nother cultural programs of worth, and to encourage people to come\nin and listen. Funds for the purchase of the sets for such centers\nhave been donated by public spirited organizations and individuals*\nThere are thirty-eight Listening Centers at present.\n\"As an experiment in testing the value of a closely controlled\neducational and cultural radio system in the Kentucky mountains, the\nUniversity of Kentucky has established a 100 watt station V7BKY, to\nbe located at Beattyvllle, and to be operated in close cooperation\nwith the Lee County Board of Education. Each of the fifty-four\nschools in Lee County will be equipped with receivers. The University\nof Kentucky College of Education has carefully developed a thirty-\nminute program to be broadcast to Lee County schools each day of\nthe week and designed to supplement the students* regular work. In\naddition broadcasts will include news, agriculture, homemaking, health,\nweather, time, and numerous other services.\n\"MICHIGAN - During the past year the University of Michigan presented\n19 radio programs weekly over three commercial stations: WJR, Detroit;\nWCAR, rontiac; WMBC, Detroit. These stations provided their facilities\nfree, the University paying telephone tolls upon programs to the\nstation’s transmitter. Such series as ”The Awakening Community,”\n“Your Interesting Children,”“World Affairs,” “Iivmns You All Should\nKnow,” “Marital Relation Series,” \"Michigan High School Forensic\nAssociation Series,” and student forums were presented. A check on\nlistening audiened is obtained by sending mimeographed copies of\nthe various talks.\n4The University Broadcasting 3ervice is an adjunct of the University\n^tension Service. It is under the control of a University Committee\non Broadcasting and its Director since 1925 has been Professor Waldo\nAbbot•\n“The facilities are used by students in the Department of Speech.\nClasses in the fundamentals of radio, radio dramatics, radio writing,\nradio speech, and laboratory in the recording and reproduction of\nspeech are offered.\n“The University has recently been granted authority for the application\nfor a frecuency modulation station ktf, the application has not yet been\nfiled.\n\"OHIO - Broadcasting program of over 38 hours per week over W03U\npresents a variety of cervices including: Thirty-nine Radio Junior\nCollege courses have been broadcast with a total enrollment of nearly\n10,000. Programs for schools were broadcast and received in a large\nnumber of classrooms throughout Ohio. Informal talks broadcast have\nincluded more than 1,000 appearanced by members of the faculty, repre¬\nsenting more than 60 departments of instruction. There are programs"
}