{
  "id": "d1499-5",
  "text": "NAKB NEWS LETTER..... Dec, 1, 1940.Page 6\nof special interest to farmers, music broadcasts for cultural improve¬\nment, news and information, spedial broadcasts of meetings and lec¬\ntures, and sports activities and games. An informal exchange of\nprograms has been conducted, with the Mutual Broadcasting System. An\naspect of the station*s work, assuming increasing importance, is the\ntraining and experience gained by students in broadcasting work.\nW03U programs have recently been honored through two \"First Awards\"\nin the National Exhibition of Recordings of radio programs. R. C.\nHiggy is Director of Broadcasting Station WOSU.\n\"OKLAHOMA - The University of Oklahoma h^s done most of its broad-\ncasting over its own station, WNAD. The Oklahoma Network was used,\nhowever, for two series of programs. Plans have been made for the\nbuilding of a new antenna and the movement and improvement of WNaD*s\ntransmission equipment. This is dependent upon a change of frequency\nin March, 1941. The WNAD budget is augmented by fees from classes\nin the various radio techniques, H. H. Leake, Production Manager,\nRadio Station WNAD.\n\"A move is under way for the formation of a state radio council for\nthe purpose of stimulating and promoting public service broadcasting.\nTwo general meetings have been held, the last one on October 22 and\n23. The chairman of your Radio Committee has acted as consultant\nto the Oklahoma authorities at both conferences. Oklahoma is moving\n3teadily towards the formation of a state-wide radio council on\nlines similar to the Rocky Mountain Radio Council.\n\"OREGON - Three regular radio courses are taught. University students\nbroadcast an average of four hours a week in the fields of news,\npoetry, music, drama, and quiz programs. The faculty likewise broad¬\ncast about four hours a week. These broadcasts are made over KOAC,\nCorvallis, by remote control from Eugene. KOAC is state-owned and\noperated under the supervision of the State Board of Higher Educa¬\ntion, Two studio8 were constructed on the campus during the past\nsummer and will be equipped and furnished during the course of the\nyear.\nn; ;UTH DAKOTA - The major trend during the past twelve months has\nbeen i. ward increased student control of station policies and practices\nuntil KU3D has reached the stage of being almost entirely student\noperated. actual control is vested in the faculty radio board and\nfaeul':.y ..rector who is the director of the University Information\n>e h ce. The station has as its purpose for broadcasting the dissem¬\nination of educational and public service features. KU3D has placed\nless emphasis upon strictly ioademic programs of limited interest,\nand decided emphasis upon broadcasts by and for children. A shift\n' of frequency from 890 to 660 is contemplated, subject to approval\nfrom FFC.\n\"vn3C0‘:siN - The University of Wisconsin owns fcnd operated ?fliA, (940\nkc. , 500C watts). A staff of eight full-time and six part-time workers\nis employed. The Committee on Radio Broadcasting is authorized to\nformulate and recommend the broadcasting policies of the University,\nalthough station 1VHA is on the budget of the State Department of\nAgriculture. During 1939-40, WHA broadcast 58 hours a week at a\ncost oi $26,594.00, or about $8.80 per broadcasting hour. Thirteen"
}