{
  "id": "d1499-6",
  "text": "Fage 7\nNAEB NEWS LETTER... .. Dec. 1, 1940\nprograms, planned especially for school listening, axe presented each\nweek over the Wisconsin School of the Air. The 3chool of the Air is\napproved by the State Department of JPublic Instruction and the\nWisconsin Education Association. The Wisconsin Research Project in\nSchool Broadcasting, financed by the General Education Board, was\nterminated in September, 1939. The report is being prepared for\npublication.\n“The Wisconsin “College of the Air“ is in its seventh year. The\nprogram includes ten courses or weekly series of broadcasts. WHA\nbroadcasts 28 hours of musical programs & week,about half of whioh\nare classical music. The Farm Program and the Home-makers* Program,\nbroadcast daily, have been on the air since 1921. During a typical\nweek as many as 150 students participate in WHA programs. The\nstation offers a recording service to University and state depart¬\nments.\n“The scope of broadcasting of WHA is broader than those encompassed\nby strictly university activities. State departments, other\neducational institutions and civic organizations carry their\nmess^g 8 to the public over the station. Political forums were\narranged and put on during the primary and. regular election campaigns.\nFree time on the air was provided for all qualified parties and\ncandidates and no censorship was exercised. This has been charact¬\nerized as the “most democratic broadcasting in America.”\nFCC ACTIONS\nWSaJ, Grove City College, was granted authority to determine operating\npower 'oy direct measurement of antenna power. (11/14/40;\nmiAt University of Wisconsin, was also granted same authority. (11/14/40)\n7.0SU, Ohio State University, applied for similar authority. (11/15/40)\nUOi, Iowa State College, applied for the same authority. (11/15/40)\nWRUr, Worl .Vide Broadcasting Corp., was granted a^construction\nto make changes in equipment and increase power of station fur* 20 *5\n50 KW. (11/16/40)\ny/kar ichigan State College, was granted special permission to\noperate extra time on November 16th for football game broadcast.\n(11/18/40)\nWRUF University of Florida, was granted special permission to operate\nextra time on November 16th in order to carry late football broadcast.\n(11/18/40)\nWTAW, Texas A & M, app led for authority to determine operating power\nby dt ect measurement of antenna power. (11/20/40)\nUniversity of Iowa, was granted special permission to reduce\nhours of operation from unlimited to 8 hours daily during Christmas\nreC’ess. (11/22/40)"
}