{
  "id": "d1756-1",
  "text": "KLRN-TV, southwest Texas, sends photos of proclamations\nby two different governors of Texas—February 11-15, 1963,\nand in 1961. Donald W. Hansen, director of radio at Wichita\nUniversity, writes that this year, for the second year, the\nKansas governor is proclaiming an Educational Broadcasting\nWeek.\nAny Broadcast Sales Seminars?\nDonald W. Hansen, director of radio at Wichita University,\nis planning a broadcast sales seminar. The class, restricted to\nseven upper-division students, will be taught by sales man¬\nagers of local commercial stations. Students will meet once a\nweek for a two-hour lecture-discussion period. Each student\nwill be assigned to a salesman from one of the stations, and\nwill make the rounds one afternoon a week to observe pres¬\nentation methods, servicing, etc. Hansen would like to hear\nfrom anyone else who has attempted this sort of seminar—and\nhe is interested in both results and student reactions. His ad¬\ndress : 1751 N. Fairmount, Wichita 8, Kansas.\nBell System Presents Tele-Lecture Seminars\nThree prominent NAEBers participated in the most recent\nTele-Lecture seminar on October 21. They were Larry T.\nFrymire, chief of Educational Broadcasting Branch of the\nFCC; William G. Harley, NAEB president; and Richard B.\nHull, director of radio and TV broadcasting and of the Tele¬\ncommunications Center, Ohio State University, and chairman\nof the NAEB Board of Directors.\nThis was the third in the series of seminars, which allow\ndiscussion between educators and telephone company consult¬\nants. Each educator presents a short talk by phone from the\ncity in which he is located. Then telephone company personnel\nlocated at various listening and participating posts continue\nthe discussion. Other NAEBers who have participated in the\ntwo previous seminars are: Hartford N. Gunn, Jr., general\nmanager, WGBH, Boston; R. Lynn Kalmbach, general man¬\nager, South Carolina ETV Center; and James G. Paltridge,\nstatewide director of ETV, University of California.\nPublications\n• Newly published by Pennsylvania State University is a 74-\npage book, Comparative Research on Methods and Media for\nPresenting Programed Courses in Mathematics and English\nThe book reports on a project directed by C. R. Carpenter and\nL. P. Greenhill, under a USOE grant.\n• Donald L. McCaleb, coordinator of public relations for Cali¬\nfornia State Polytechnic College, writes that he has just com¬\npleted a research paper, “A Survey of the Uses of Television\nin the Public Relations Programs of Colleges and Universities\nin California.” He states that he will be glad to send copies of\nthe 53-page report to Newsletter readers as long as the supply\nlasts. Write to him at the college, San Luis Obispo, California.\n• The Buttenheim publication Overview, a magazine for edu¬\ncational executives, has changed its name to American School\n& University.\n• The 1963 edition of HEW’s book Grants-in-Aid and Other\nFinancial Assistance Programs Administered by the US. De¬\npartment of Health, Education, and Welfare is off the press.\nIt is obtainable from the GPO, Washington, D.C., 20402, for\n$2.25.\n• Reprints are available of the address delivered by Gilbert\nSeldes at the annual awards dinner of the Alfred I. duPont\nAwards Foundation in March, 1963. Write for copies of “The\nPublic Interest” to the Curator, the Alfred I. duPont Awards\nFoundation, Washington and Lee University, Lexington,\nVirginia.\nEQUIPMENT FOR SALE\nBecause of the closing of a TV training studio, a correspond¬\nent has for sale two used Iconoscope cameras and auxiliary\nequipment. Write to Margaret Stone, Northwest Schools, 1221\nNorthwest 21st Avenue, Portland 9, Oregon.\nNews Notes\nPERSONNEL\n^ Richard S. Burdick, executive vice president and general\nmanager, WHYY, Philadelphia, will leave the first of the\nyear to become general manager of Boston Broadcasters, Inc.,\na commercial TV group applying for Channel 5, CBS affili¬\nate in Boston. Replacing Burdick at WHYY will be Warren\nA. Kraetzer, vice president for development and secretary of\nNET.\n^ Walter P. Sheppard has assumed the new post of faculty\nprogram director of WBUR (FM), Boston University; he\nis also an assistant professor of broadcasting at the university.\nHe came to Boston from the University of Wisconsin, where\nhe recently completed requirements for the Ph.D.\n^ Col. DeWolf Schatzel has joined Dallas consulting engi¬\nneers A. Earl Cullum Jr. and Associates. He was recently\nwith MPATI.\n^ Geoffrey E. Geilich has been appointed program director\nfor WUHY-FM, Philadelphia, succeeding James W. Keeler,\nwho is leaving to become assistant program director of\nWNYC, New York. Geilich has been with WUHY for four\nmonths, and he was previously manager of WXPN, Univer¬\nsity of Pennsylvania. Keeler has been program director at\nWUHY since 1956.\n^ Daniel Rose, formerly a scholarship student with WGBH-\nTV, Boston, has joined the staff of KCSD-TV, Kansas City,\nas assistant producer.\n^ William G. Harley, NAEB president, and James A. Fel¬\nlows, assistant director of research and development, spoke at\nthe Fourth Air Force Television Conference at Lowry Air\nForce Base in October in Denver. Harley was the banquet\nspeaker, and Fellows presented a paper on evaluating the ef¬\nfectiveness of TV presentations.\n^ Gilbert Seldes, former dean of the Annenberg School of\nCommunications, University of Pennsylvania, has been ap¬\npointed consultant to the program department of NET. He\nwill spend a week a month in New York City for that pur¬\npose. Seldes retired June 30 from his position at the Annen¬\nberg School, which he had held since 1959.\n^ Jack Aistrop, transcription distribution manager, will move\nto the United States January 1 to be BBC’s representative in\nthis country.\n^ Mickie Newbill has returned to the University of Florida\nfrom the University of Michigan, where she received the\nPh.D. in broadcasting. She is serving as assistant professor\nand as WUFT producer-director.\n^ George Mastroianni has been named program director for\nWFCR, Amherst, Massachusetts.\n^ Edward Steele II, formerly of WMTV, Omaha, has been\nnamed producer-director at the Auburn studio of the Alabama\nETV network. Assisting him will be Jack Penn, from the U.\nS. Army TV department.\n^ Two University of Michigan Television Center staffers are\nteaching courses in the speech department this year. Alfred\nSlote, senior producer, teaches dramatic writing for radio\nand TV, and Mike Berla, film editor, teaches a course in\ntechniques of cinematography.\nRon R. Browne has been named assistant professor of\nroadcasting at Boston University. He was formerly on the\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, I 19 Gregory Hall,\nUrbana, III. 61803. $5.00 a year, $7.50 including Washington Re¬\nport. Editor: Betty McKenzie. Phone 333-0580. Area Code 217.\nReporters:\nRegion I —Michael Ambrosino, EEN, 238 Main St., Cambridge,\nMass.\nRegion II —Shirley Ford, WUOT, University of Tennessee, Knox\nville.\n—Lou Peneguy, AETC, 2151 Highland Ave., Birming¬\nham, Ala.\nRegion III —McCabe Day, WVSH, School City of Huntington, Ind.\nRegion IV —Richard Vogl, KTCA-TV, 1640 Como Ave., St. Paul,\nMinn.\n2\nNEWSLETTER"
}