{
  "id": "d1756-5",
  "text": "National averages frequently don't mean much to Individuals. Yet, the high level of\nbroadcast employee Income prevails In Just about every section of the nation. City by city,\nregion by region, the typical wages paid to station staff announcers, salesmen, technicians\nand other personnel rank at or near the top, when contrasts are made with reasonably compara¬\nble types of work.\nFurthermore, the very nature of the Industry — Involving networks; large, medium and\nsmall stations; agencies, etc. — offers exceptional opportunities for advancement to higier\npaying positions. The dynamic character of broadcasting, the cumulative expansion of new\nstations and the Industry's receptiveness to change are all factors which provide new Jobs\nand Increased pay for progressive employees and for those with Individual talents and creative\nIdeas.\nUnfortunately, all too frequently the wage structure within the many Individual radio\nstations has \"Just growed like Topsy\" and has become capricious and unsystematic.\nIn some cases, a lopsided and unsound wage pattern has resulted from the fact that cer¬\ntain staff employees are unionized and the economic strength of these unions has been used\nto push their own wages upward — ever upward — without regard for cost of living, profits,\nstation Income or other factors which affect the level of wages. Thus, today we find some\nstations able to maintain solvency despite relatively disproportionate wages received by one\nor two classes of station staff only by paying inadequate wages to several other classes of\npersonnel.\nthe time has arrived when broadcasters must give attention to scientific job evaluation\nwhereby different jobs are measured in terms of their relative contributions to the total\noperations of the radio station. Skill, experience, personal responsibility and other factors\nshould be used to set the standards by which the wages of various classes of station personnel\nare paid. Even within this framework there will still be opportunity for management decisions\nand for collective bargaining to function effectively. Both management and employees must learn\nto understand Job evaluation as a workable means of establishing equitable wage patterns. This\nneed for scientific appraisal of Jobs is as necessary and adaptable to small as large stations.\nFurthermore, there Is a need In many stations to evaluate objectively the salaries re¬\nceived by station managers In relation to wages paid staff personnel. There are not a few\ncases where station managers' Income Is disproportionately low, considering the overall Im¬\nportance of their efforts to the success of the station. Not only the profits of ovnership\nbut the Incomes available to staff personnel depend on successful management.\nMAKE-WORK POLICIES HURT EVERYOHE\nMaximum operational efficiency Is retarded by make-work concepts and by artificially Im¬\nposed work quotas. Featherbedding does not Increase the total piece of Income pie going to\nlabor. It does result in ultimate unemployment and reduced wages because it holds back ex¬\npansion and Improvement.\nThe efforts of a few radio unions to prevent dual broadcasting of AM and FM programs or\nto demand premium wages for dual operations (Involving no additional work effort) actually\nretard the growth of HI. By this very approach, they Impede the expansion of total employ¬\nment and potential future wage Income within the radio Industry.\nA broadminded acceptance by each and every radio union of the fundamental economic trends\nunderlying PM and television development will actually increase, not reduce, total industry\nemployment ond wage incomes for musicians, technicians, announcers and other station Personnel.\n-6-"
}