{
  "id": "d1410-1",
  "text": "-1-\nTV TECHNICAL TIPS NO. 6\n(March, 1955)\nBy Cecil S. 3idlack, -NAEB TV Engineer\nBig news of the month from the Engineering Service was that the first issue of\nthe NAEB ENGINEERING NEWSLETTER went into the mails on February 10. It was sent\nto all those engineers who returned our Technical Directory cards. If you haven’t\nreceived your copy,send us your name on a post card and we'll put one in the mail\nto you. The first issue contained 21 pages and consisted mainly of reprints of the\nengineering news columns from the regular NAEB Newsletter. We hope to have No. 2\nroll from the presses in April, so watch for it.\nAs we go to press, our Technical Directory list is still growing. Nearly 175\nengineering staff members of educational stations, AM, FM, and TV, have returned\nour directory cards. Soon we plan to publish a Technical Directory—-we want it\nas complete as possible, but we can't dream up a list of names. Some one has to\nsend them to us. So-dear reader, check with your engineers and ask them if they\nhave returned our directory cards. If they haven't, a post card will do. ? • ? •\nCarl Menzer, Chairman of the NAEB Engineering Committee, was in Urbana February 21.\nHe and Mrs. Menzer are now on their way to Mexico for a winter vacation. During\nhis stay here, we worked out a tentative program for the 1.955 TV Engineering ■\nWorkshop. A grant has been made by the FAE which makes the Workshop possible. The\ntentative program has been sent to a number of people for their comments and\nsuggestions. Soon there will be an official announcement of the time,place, and\ndeadline for applications. Watch for it.\nJoseph Place, Audio-Visual Director for the Ferguson-Florissant School District of\nSt. Louis County, Missouri, has sent us an article for the next ENGINEERING\nNEWSLETTER, \"A Low Cost Master Antenna System for Television in Schools.\" In this\narticle he tells how he solved the problem of a master antenna system in two of\nthe schools of his system at low cost. In one school, two antennas serve 19 class¬\nrooms at a cost of $125.00; and in the other, one antenna serves 12 classrooms at\na cost of $75.00. We are making copies of his paper and will be glad to send it\nto you upon request.\nWinston Bugg of WABE in Atlanta is rewriting a couple of items on tape recording\nfor the next ENGINEERING NEWSLETTER. We are also happy to announce that he has\nbeen registered as a Professional Engineer in Georgia, and has been elected Vice-\nChairman of the Atlanta Section of the IRE. Congratulations!\nWe are also happy to record that Bob Higgy, Director of W0SU, is back at his desk\nafter a second eye operation. He reports that the weather of the past few weeks\nhas practically stopped work on the new W0SU-TV building. We sent him ordering\ninformation on RTMA Resolution Charts and Slides and test films. So you see,\nthings are moving along at W0SU.\nBill Dunbar of General Communications, Fort Atkinson, Wisconsin, stopped by on his\nway home from a trip south. He left literature on the General Communications\nline of distribution amplifiers, switching systems, master power supplies and\nvoltage regulators. If you want more information, I have inquiry cards or you can\nwrite him direct."
}