{
  "id": "d1410-10",
  "text": "-10-\nA \"Pop\" Eliminator*\nOne of the virtues of tape recording lies in the opportunity to stop the re¬\ncording at any point for the correction of errors or other editing. However, upon\nstopping or restarting, it may occur that a \"pop*1 is recorded. This is particularly\ntrue of the popular Magnecorder. Magnecord engineers suggest that .01 mfd. condei>*\nsers across the motor switches will eliminate the trouble when stopping, but these\ndo not help when starting.\nBob Parris, WABE engineer, observed that at the instant of starting the level\nindicator would fluctuate considerably, and deduced that this is caused by the sud¬\nden drain on the power supply by the erase-bias oscillator. If the oscillator could\nbe started a bit before the tape began to move, this transient would be confined to\nthe area of the recording head groove—or to one-half cycle at the highest playback\nfrequency.\nMr. Parris*, solution is simple. A microswitch with a leaf spring actuator is\nmounted on a suitable metal bracket at the rear of the tape transport mechanism in\nsuch a position that it is operated by the shaft of the safety button extending\nthrough the rear of the chassis. The normally open contacts of the switch are con¬\nnected in series with the oscillator power supply, across the lowest two terminals\non the connector strip—marked 1 and 2 in the Magnecord instruction booklet.\nIn operation, with the selector switch in \"Record'* position, the safety button\nis pushed and held down for about two seconds, and then the control knob is moved\nto \"Forward\" position. It*s as simple as that, and foolproof.\nThis same feature is useful in erasing to a very precise point on the tape, as\nis often necessary in editing. The point at which erasing is to begin is marked,\nand then the tape is rethreaded so that it passes over the erase head but under the\nplsyback head. With the selector set on \"Record\" and with the tape positioned\nexactly over the erase head,, depress the safety button and move the tape by hand\nor by the motor for any desired distance. Erasure is complete, very clean, and can\nbe started and stopped at exact points.\nFinally, it is suggested that whenever the selector control is moved from \"Lis¬\nten\" to \"Record'* a slow positive movement will prevent some noise which may occur\nwith fast or jerky operation.\nPlease note that the title has no biological significance.\nContributed by K. Winston Bugg, Chief Engineer WABE, Atlanta, Ga."
}