{
  "id": "d1410-14",
  "text": "-m-v\nNAEB Headquarters\nIk Gregory Hall\nUrbana^ Illinois\nA Low Cost Master Antenna System for Television-in Schools ■\nBy Joseph C. Place#\nIn October 195U, the Ferguson-Florissant School District installed master an¬\ntenna systems in two of its elementary schools. These two installations were ex¬\nperimental for the purpose of finding a low cost antenna system that might be in¬\nstalled in all school buildings. Two schools were selected for the test; 1) a new\n12-room elementary school with conduit provisions for the master network and 2) an\nolder building which had no provisions for television.\nPrimarily the antenna systems were designed to receive KETC on Channel 9, the\neducational television station of the St. Louis Educational Television Commission.\nOne school was Ik miles air line from the KETC transmitter, the other was 10 miles\nair line.\nIn the new 12-room building, one ten element conical antenna (lazy X) was in¬\nstalled on the chimney stack half way up from the roof. Approximately 35> feet of\nflat 300 ohm lead in was used to connect this to the distribution box. This was a\nBrach Mul-Tel No. 300-72 k set coupler (no tubes) designed to provide four 72 ohm\ncoaxial outputs from one 300 ohm antenna, RG£9U coaxial cable was used for distri¬\nbution.\nOne 72 ohm coaxial line (RG5>9U) approximately 22£ feet long connected the dis¬\ntribution box to six classrooms, (See Fig. 1) all rooms connected in parallel.\nEach of the second and third coaxial lines connect the distribution box to three\nclassrooms. Each classroom is equipped with a wall plate containing a 72 ohm con¬\nnector.\nIn the older building, there are nineteen classrooms on three floors* Due to\nthe arrangement of rooms, two ten element conical (lazy X) antennas were strategi¬\ncally placed on the roof to give shortest distribution to the classrooms. One\nantenna served thirteen classrooms and the other six classrooms. Distribution boxes\nfor both antennas were located in the attic* Again 300 ohm flat twin lead was used\nfrom these antennas to distribution boxes.\nThe antenna serving the thirteen classrooms was connected to two distribution\nboxes providing seven 72 ohm lines to classrooms. (See Fig. 2) Three of the lines\nhad two classrooms paralleled on each line. One line had three rooms connected in\nparallel and the other line had four rooms connected in parallel.\nThe second antenna, serving six classrooms was connected to a distribution box\nproviding for four 72 ohm lines. Two lines from this box served the six class¬\nrooms, with each line having three classrooms in parallel. (See Fig. 3)\nThe longest run in the nineteen room installation was approximately 13>0 feet;\nthe shortest approximately !?0 feet. Due to the lack of conduit for the installa¬\ntion of the distribution system and due to the fact that the cable would be within\nthe reach of small children, this cable was housed in wire mold. Each classroom\nwas provided with a 72 ohm wall plate connector."
}