{
  "id": "d1410-2",
  "text": "-2'\nDage Division of Thompson Products put on a demonstration of their vidicon camera\nequipment in the TV-MP studios of the University of Illinois, February 25. They are\nproviding a “package\" TV station for the Armed Forces with one live vidicon camera,\ntwo film projectors, vidicon film chain, 100 watt VHF transmitter and antenna for\n$52,000. If the FCC approves, these low power packages might be the answer for\nschool systems in smaller cities with a VHF channel reservation.\nWork is progressing on the installation of the WTLC (or as we at NAEB so quaintly\ncall it, WILL-TV)transmitter, and bids have been received for the erection of the\nantenna on the Illinois Memorial Stadium. Schooley reiterates, \"Could be on the air\nin thirty days.\"\nJoe Belcher of the General Precision Laboratory writes to tell about a new TV Utility\nProjector Model RA-101C which sells for $2,350. Joe says it has the basic mechan¬\nism from their standard telecine unit but less pedestal, upper magazine, trimmings,\netc. Says it1s normally delivered with an intermittent usable for color vidicon,\nor image orthicon use but can be ordered for \"ike\" chain use. These units can be\nused as standby equipment, preview, telecine, or small background projection jobs\n(U* x 6*)* Also sound is flat to 7 kc, with better than usual light distribution\nand 600line resolution.\nThe report of the 195U TV Engineering Workshop is about ready to turn over to Harold\nHill and his blue pencil. The printer is now working on the 195>U Production Work¬\nshop with page proofing partially complete.\nBob MacDonald and Paul Carlson of Philco*s Chicago office stopped here the other day\nto tell us that Philco is going into production on their new TV Cinescanner. It em¬\nploys a continuous film transport mechanism operating in conjunction with a flying\nspot scanner. The scanner is available either for monochrome or color, with the\nmonochrome projector readily convertible to color at some future date, if desired.\nFAE GRANT TO KUHT\nKUHT. the University of Houston*s educational television station, has been awarded\na $34,500 grant by the Fund for Adult Education, General A. D. Bruce, president of\nthe University, has announced. The money will be used for the purchase of kinescope\nand film equipment Mr. John C. Schwarzwalder, KUHT manager, stated. He said, \"This\nnew equipment will enable KUHT to further serve the community and the nation by pre¬\nserving in permanent form programs of educational value.\" The University is one of\n12 schools in the country receiving this grant. The University of North Carolina\nis the only other college in the South receiving a similar grant.\nIncluded in the list of equipment to be bought are two studio cameras with 12,000-\nfoot magazines for filming complete 30-minute programs. These can be used either\nfor kinescoping or for straight film production. This equipment will be used to\nmake film recordings of KUHT programs which will be sent to the Educational Tele¬\nvision and Radio Center, Ann Arbor, Michigan, for distribution to other educational\ntelevision stations. A group of such programs from KUHT has already been planned,\nMr. Schwarzwalder said. The first of these will be a series of programs on Life\nSciences with Dr. H. Burr Roney, associate professor of biology at the University.\nIn addition, KUHT will now be able to kinescope programs for use by area commercial\nstations or local advertising agencies."
}