{
  "id": "d1410-9",
  "text": "•9-\nae a result of the workshop sessions, plus what probably is equally important,\nmeeting and getting acquainted with other engineers and discussing their mutual-\nproblems. If you want another notice of the 1955 TV Engineering Workshop telling\nhow to apply, write to me at lU Gregory Hall, Urbana, Illinois and youfll receive\none by return mail. Remember the deadline for applications is'June 1, 1955*\nHerb Evans, Chief Engineer of WTHS, the FM station of the Board of Public Instruc¬\ntion of Dade County (Miami) Florida, sends along an idea that should be of interest\nto many school systems.\nThe Dade County school system is ready to request bids on approximately 120 fixed-\nfrequency fm receivers for WTHS reception. These are essentially quality FM tuners\nplus a 20 kc \"alarm channel\" which responds only to 20 kc modulation, not unlike\nstorecasting* Upon receipt of 20 kc modulation of proper duration, a receiver-\neven if previously silent—will sound a self-contained alarm bell. Once actuated,\nthe bell will continue to ring until school personnel respond by pressing a button.\nAt this time the bell will cease ringing and the receiver audio will become alive*\nThe main idea of these receivers is to provide a civil defense alerting system\nunder school system jurisdiction. A secondary function is -to provide a calling\nsystem by which messages may be sent almost instantly to the entire school system.\nPresent practise, by telephone, takes more than a day. Further the set audio may\nbe operated at any time if WTHS is to be monitored.\nMr. Evans developed the circuits for this receiver after a year of experimenta¬\ntion and test. A pilot model is now in operation at the station. The receiver\nwill be completely enclosed with two push buttons the only accessible controls.\nThirteen tubes and other controls are accessible only to service personnel. AC\npower for the receiver is applied and shut off each day by the automatic class-\nbell program clock which employs a punched paper tape. The cost of each receiver\nis expected to be in the neighborhood of $120.00 when the contract is awarded.\nApril 28, the second station of the Alabama Educational Television Commission,\nWBIQ, Trent on the air on Channel 10 in Birmingham. This is the 13th noncommer¬\ncial educational television station on the air. The opening program ceremonies\nwere also telecast by WTIQ, Munford Channel 7 and by commercial WBRC-TV, Birming¬\nham. George B. Storer officially presented the station a 5 kw RCA transmitter,\n6-bay antenna and other station equipment formerly used by WBRC-TV. The.Munford\nstation WTIQ went on the air last November, and a third station WAIQ in Andalusia,\nChannel 2, is planned for September. The Alabama Educational Network has studios\nin Birmingham, Tuscaloosa and Auburn connected by microwave."
}