{
  "id": "d1772-3",
  "text": "way of finding the point marked'. The 30 kc signal\nmay also be modulated by a voice signal giving edit¬\ning instructions or it can be AM modulated by verti¬\ncal sync pulses so that the precise cutting point on the\ntape may be located. A splicing jig is provided to as¬\nsure accuracy in joining the cut ends of the tape to¬\ngether.\n*****\nWhile we are not aware of any educational FM\nstation using multiplex transmission, in the future\nthis type of transmission might well be used in\nstereophonic broadcasting. The FCC is taking an¬\nother look at multiplexing and attempting to de¬\ntermine whether additional uses are feasible, ap¬\npropriate, or should be permitted in the FM band.\nWritten comments are invited covering seven\nspecific applications of FM multiplex under Docket\nNo. 12517. These should be filed on or before Sep¬\ntember 2, 1958.\n*****\nWe have an equipment “buy” for an educational\nstation planning to go on a reserved UHF channel.\nThis is equipment for a complete UHF TV station\nand includes the following:\n1) One Continental 1 kw UHF transmitter\n(Chan.)\n18) Diplexer and approximately 400 feet of\ntransmission line\n2) One G. E. Helical antenna\n3) Two GPL Image Orthicon Camera chains\n4) One GPL PA 505 Vidicon Film Camera\n5) Two GPL PA 100 16mm projectors\nIt also includes sync generator, switcher, master\nmonitors and other miscellaneous equipment. This\nstation was in operation until June 20, 1958 and the\nequipment is being sold on an as is, where is, con¬\ndition. The price is $25,000 for the lot. If you are\ninterested in the purchase of this equipment contact\nthe writer of this column.\nTV TECHNICAL TIPS (September)\nOn July 31, the FCC adopted a new policy regarding\nthe operation of private television microwave links.\nWe quote the new statement of policy:\n“Television broadcast station licensees will have\nthe option of operating their own private television\nintercity relay facilities or obtaining intercity tele¬\nvision transmission service from communications\ncommon carriers in all cases except those in which a\ndirect interconnection is desired with common carrier\nfacilities. Such relay stations are not to be used as\nintermediate links in common carrier intercity tele¬\nvision transmission facilities.”\nThe above ruling means that it will now be pos¬\nsible for educational stations to build state or re¬\ngional networks regardless of the fact that common\ncarrier service is available to serve the stations or\ncities interconnected. In the past, private facilities\nwere authorized, however once the common carrier\nfacilities were available to provide the service, they\nwere obligated to use it regardless of the fact that\ntheir own microwave links were providing a satis¬\nfactory service at a much lower annual cost.\nThe Commission, in announcing this policy,\nstipulates that “the use of frequencies for intercity\nrelaying shall be on a secondary basis and subject to\nthe condition that no harmful interference is caused\nto television pickup and television STL stations”.\nAt the present time, there are about 50 private MCW\nlinks in use including those at ETV stations in Ala¬\nbama and North Carolina .\n*****\nIn another action adopted July 30, the FCC pro¬\nposed rule making in Docket No. 12567 to permit\ntelevision translator stations to operate with a maxi¬\nmum power of 100 watts whereas the present maxi¬\nmum power output of these translators is 10 watts.\nAround 125 translators are now in operation,\nhaving been authorized by the Commission in May\n1956. At that time, power output was limited to 10\nwatts until data upon actual operation could be\nobtained. In the two years which have elapsed since\nthis authorization, the FCC has received no reports\nof interference between translators or other services.\nSince numerous requests have been received to in¬\ncrease power output, the Commission believes that\nconsideration should be given to permit this increase\nsince the additional power will improve the service\nnow being provided as well as bringing service to\nnew areas where there is little or no TV reception.\nTranslators retransmit the signals of another tele¬\nvision broadcasting station or another translator by\ndirect frequency conversion to the top 14 channels\n(70 to 83) of the UHF television band.\nA note from Hartford Gunn of WGBH, Boston,\nstates that their Ampex Videotape Recorder is now\ninstalled and in operation . He reports that their\nbiggest problem to date is how to keep down traffic\non the machine.\n—N A E B—\nWILL-TV is looking for a used GPL image orthi¬\ncon camera chain as well as an iconoscope film chain.\nThey have some large screen RCA television projec¬\ntion equipment to trade for the above . If you are\ninterested in making a swap, contact Rob R. Beldon,\n4\nENGINEERING NEWSLETTER"
}