{
  "id": "d1772-4",
  "text": "chief engineer, WILL-AM-FM-TV, University of\nIllinois, Urbana, Ill.\n*****\nIn answer to the rising need for standardization\nof video tape recording practices in the television\nindustries, Mr. Axel G. Jensen, Bell Telephone Labs,\nEngineering Vice-President of the Society of Motion\nPicture and Television Engineers has announced the\nformation of a Video Tape Recording Engineering\nCommittee, by the Society.\nThe official scope of the committee, which will be\nchaired by Mr. Howard A. Chinn, CBS Television,\nwill be “To propose standards and good engineering\npractices for the construction, operation and measure¬\nment of video tape recording and reproducing equip¬\nment and for those video tape or other characteristics\nwhich affect performance and interchangeability.”\nInitially, the committee plans to consider stand¬\nardization in the following areas: tape (dimensions\nand identification), tape reels (hub and flange), tape\ntracks (locations, video-, audio-, control-, and cue-\ntracks) , recorded signal electrical characteristics\nvideo, audio, control and cue), tape leaders, methods\nof measurement, terminology and tape splicing.\nThe committee will be composed of engineers\nexperienced in the areas of tape manufacturing, equip¬\nment manufacturing and broadcasting. It will also\nhave liaison with other organizations in the television\nand related fields. The committee has already started\npreliminary investigation into all the areas tentatively\nestablished within the scope of its activities.\nA live educational radio network in New England\nbecame a reality last month with the first regular\nbroadcasts by WEDK, Springfield, Mass., of pro¬\ngrams from WGBH-FM, Boston.\nThe Educational Radio Network, in effect, joins\neducational institutions at both ends of Massachusetts\nin cultural programming which can be received by\nFM listeners throughout Southern New England.\nIt is expected that station WAMC, at the Albany\n(N. Y.) Medical College of Union University, will\njoin the E.R.N. this year, thereby providing cover¬\nage for upstate New York and Vermont.\nAs a key affiliate of the E.R.N., station WEDK\nwill broadcast many of WGBH-FM’s programs, as\nwell as local programs some of which will be fed to\nthe network.\nWEDK is licensed to the Springfield School Com¬\nmittee and is operated with the cooperation of the\nWestern Massachusetts Broadcasting Council, Inc.\nThe station, which has been conducting tests since\nearly spring, successfully completed trial broadcasts\nfrom its Springfield transmitter before it was linked\nwith WGBH-FM.\n*****\nHonors as the first city to be allocated two educa¬\ntional TV channels go to Pittsburgh, Pa. after last\nmonth’s F.C.C. ruling.\nThe Commission shifted Chan. 22 from Clarks¬\nburg, W. Va. to Pittsburgh for educational use. In\na counterproposal, the Metropolitan Pittsburgh Ed¬\nucational Station requested use of Chan. 16 instead\nof Chan. 22; however, decision on this proposal will\nnot come until later this month.\nPittsburgh’s present ETV station, WQED, Chan.\n13, now programs almost 12 hours daily and has been\nin operation since April, 1954. It requested an ad¬\nditional channel in order to enlarge its educational\nprogram for both classroom and home instruction\nand for specialized educational service to industries\nand professions\nin the Pittsburgh area.\nETV STATIONS ON THE\nAIR\nKCTS\nSeattle, Wash.\n9\nKETA\nOkla. City, Okla.\n13\nKETC\nSt. Louis, Mo.\n9\nKLSE\nMonroe, La.\n13\nKNME\nAlbuquerque, N. M.\n5\nKOAC-TV\nCorvallis, Ore.\n7\nKQED\nSan Francisco, Calif.\n9\nKRMA-TV\nDenver, Colo.\n6\nKTCA-TV\nSt. Paul, Minn.\n2\nKUED\nSalt Lake City, Utah\n7\nKUHT\nHouston, Tex.\n8\nKUON-TV\nLincoln, Neb.\n12\nWAIQ\nAndalusia, Ala.\n2\nWBIQ\nBirmingham, Ala.\n10\nWCET\nCincinnati, Ohio\n48\nWETV\nAtlanta, Ga.\n30\nWGBH-TV\nBoston, Mass.\n2\nWHA-TV\nMadison, Wis.\n21\nWHYY-TV\nPhiladelphia, Pa.\n35\nWILL-TV\nUrbana, Ill.\n12\nWIPR-TV\nSan Juan, P. R.\n6\nWKNO-TV\nMemphis, Tenn.\n10\nWMVS-TV\nMilwaukee, Wis.\n10\nWOSU-TV\nColumbus, Ohio\n34\nWQED\nPittsburgh, Pa.\n13\nWTHS-TV\nMiami, Fla.\n2\nWTIQ\nMunford, Ala.\n7\nWTTW\nChicago, Ill.\n11\nWTVS\nDetroit, Mich.\n56\nWUNC-TV\nChapel Hill, N. C.\n4\nWYES-TV\nNew Orleans, La.\n8\nSEPTEMBER 1958\n5"
}