{
  "id": "d1571-2",
  "text": "•3\nO\nr^\ni\nr'\nr\nBOARD OF DIRECTORS MEETING AT BATTLE CREEK\nThe NAEB Board of Directors met May 23-21* in the Board Room of the W* K. Kellogg\nFoundation in Battle Creek, Michigan* This was fitting in that the main business\nof the meeting was a review of the first year of operation under the Kellogg Grant*\nThe meeting at Battle Creek also offered the Board an opportunity to learn at some\nlength of the operation of the W. K* Kellogg Foundation. Under the direction of Mr.\nRobert VanDuyn, Associate Director, Division of Education, W. K. Kellogg Foundation,\nthe following members of the Foundation staff told the history and philosophy of the\nFoundation t\nDr* Benjamin Horning, Director of the International Division, explained the operation\nof his division, with special emphasis on aid to Latin American countries*\nDr. Matthew Kinde, Director of the Division of Medicine and Public Health, explained\nthe four general principles of the Foundations (a) Kellogg is not a research founda¬\ntion; (b) limits itself to the application of knowledge; (c) its interests are more\nrural than urban; and (d) since Mr. Kellogg was deeply interested in children, the\nFoundation also reflects this interest*\nMiss Amy Viglione, Associate Director of the Division of Nursing, explained the\nFoundations two interests in the fields of (a) nursing service administration, and\n(b) practical nurse training*\nDr. Andrew Pattullo, Director of the Division of Hospitals, described the growth of\nthe training program for hospital administrators from one course at the University\nof Chicago in 193U to fifteen academic programs at present, six of which were\nassisted by the Kellogg Foundation*\nThe operations of NAEB under the Kellogg Foundation during the present year were\nthoroughly and frankly discussed by the Board with members of the Kellogg staff and\nwith Dean Wilbur Schramm of the University of Illinois. Plans were made for a\nreport to the Foundation on the first yearfs operations, to be made to the Founda¬\ntion before July.\nThe Board decided that the Foundation Adult Education programs on Jefferson and\nRussia be released September lf>, 19E>2, and that the series on \"Ways of Mankind\" be\nreleased November l£, 19^2. *\nThe consensus of the Board was that the FAE programs be distributed by tape to the\nNAEB network, and that the stations could keep the programs and pay for them, or\nreplace the tape. It was also approved that the FAE programs be distributed to\ncomrrercial stations on tape at a fixed fee to be determined by headquarters.\nThe Executive Director, James Miles, reported on the plan for headquarters for 19^2-\n£3# It is hoped that packages seven and eight will be the last ones to be distrib¬\nuted by the present \"bicycle\" method, as the mass duplication is to be in operation\nsometime in July* He also reported on the School Broadcasting Seminar to be held at\nAllerton House June V~> through June 2£, which will include some twenty-one school\nbroadcasters under the guidance of H. B. McCarty, I. Keith Tyler, and James Mac-\nandrew.\nDick Hull, Director of Region IV, told of the television workshop to be held in\nAugust at Iowa State College.\nThe Junto Schools, Philadelphia, Pa., were accepted as associate members and the Uni¬\nversity of Houston, Texas, operators of station KUHF, were accepted as active members*"
}