{
  "id": "d1571-5",
  "text": "- 6 -\nCOLUMBIA UNIVERSITY RELEASES NEW MENTAL HEALTH SERIES\nThe Communications Materials Center of Columbia University, under the direction of\nErik Bamouw, recently made available a new series of 6 quarter-hour programs on the\nsubject of emotional health. The series is entitled, ”Why Did He Do It?” and is\nnarrated by radio reporter George Hicks, Consultants were Dr* Dallas Pratt and Dr*\nDavid Abrahams en*\nSeries Revised\nA review of the sample audition disc, which contains two of the six case histories\nin the series, has been made by Northrop Dawson, Jr* program director of KUOM, at ^\nthe University of Minnesota* Mr* Dawson writes?\n”This is a series dealing with problems of emotional health, combining reportorial\nand actuality recording techniques, and featuring George Hicks, well-known network\nreporter*\n”The sample audition disc features the true case histories of..*a convicted arsonist\nand...a convicted burglar, concentrating primarily on the synptoms of emotional mal¬\nadjustment which impelled the criminal, in each case, to seek an outlet in anti¬\nsocial activity. The story is told partly in straight reporting by Hicks, partly by\ncut-ins of tape-recorded interviews between Hicks and the subject-interviewee and\nrecorded statements by the latter and the psychiatric specialist who handled his\ncase.\n”The result is an educational program of unusual inpact. The approach is straight¬\nforward and honest, with no attempt to over-dramatize the story with, devices or\n’gimmicks.” The inherent drama of the real-life situation is sufficient to hold\nthe listener’s interest.\n\"Each program demonstrates how the subject-interviewee has been helped via psychiat¬\nric treatment, and concludes with an appeal for early recognition and treatment of\nemotional madadjustirent, thereby stressing the inportance of initial ’prevention*\nrather than eventual cure*”\nThe cost of airing the discs varies, depending upon the population of the city in\nwhich a radio station broadcasts. Full details about radio rights and costs, as well\nas a brochure on the Communication Materials Center, may be had by writing to Erik\nBarnouw, Communications Materials Center, Columbia University, 1*13 West 117th Street,\nNew York 27, New York.\nKEITH TYLER’S OSU CLASSES VISIT WBQE\nThe staff at WBOE and the administration of the Cleveland Public Schools recently\nwere visited by I. Keith Tyler and members of his class in radio education at Ohio.\nState U. In the group of 20 brought by Tyler were repressntatives from Turkey, India,\nPakistan, Japan and the Philippines.\nOne morning was used for observing radio lessons in the elementary schools. On a\nsecond morning lessons in two of the high schools were watched. During one after¬\nnoon staff rrenibers explained the operation and management of WBOE. On the second\nafternoon William B. Levenson, assistant superintendent, explained the philosophy\nbehind the use of radio lessons in the Cleveland schools. Immediately after that,\nunder the direction of Tyler, the class members discussed their observations and\nmade a critical analysis of what they had seen and heard.\nEVER HEARD A BIG SYMPHONY ORCHESTRA REHEARSE? YOU CAN—IN NOVEMBER"
}