{
  "id": "d1571-6",
  "text": "< '** 7 *■»\nWNYC AIRS HEALTH DOCUMENTARY SERIES\nA series of five documentary programs, under the general title ,fThe Endless Frontier,\"\ndramatizing major achievements in the fight against disease, began weekly over WNYC,\nthe Municipal Broadcasting System of New York City on Wednesday, June h*\nThese transcribed programs are narrated by Raymond Massey and cover such subjects as\nthe discovery of cortisone, the science of nutrition, scientific progress in the\ncontrol of cancer and heart disease, and the practical applications of scientific\ndiscoveries at home by the medical corps in. Korea#\nMusic for the series is provided through the cooperation of Local 802 of the Ameri¬\ncan Federation of Musicians, by a grant from the music performance trust fund of the\nrecording industry# \"The Endless Frontier\" series, is presented by WNYC in coopera¬\ntion with the Health Information Foundation, a non-profit organization which gathers\nand disseminates news of health needs, progress, and services#\nFive N. Y . Times Reporters on C. C. N* Y» Symposium\nFive reporters of the New York Times took part in a symposium on \"Reporting the\nForeign Scene\" broadcast transcribed by WNYC, on Friday, June 13• The discussion was\npart of the John H. Finley Lecture Series held recently at City College of New York#\nThe participants were all alumni of C. C. N* Y* They are Morton Yarmon, Foreign News\nDesk Copy Editor of the Times; A, M. Rosenthal, United Nations Correspondent; Harold\nFaber, former Times Korean War Correspondent; Milton Bracker, former Chief South\nAmerican Correspondent; and the moderator, Irving Lorge, Professor of Education at\nColumbia University and a member of the Times General News Staff*\nThe Finley Lecture Series is named in honor of the late John H. Finley, third presi¬\ndent of C* C. N. Y. and, himself, an editor?of tbs New York Times#,\nNine Complete Operas Broadcast on. Opera Festival\nNine complete operas by six composers were broadcast by WNYC during the week of Sun¬\nday, June 1 through Saturday, June 7, when the City Station inaugurated its Opera\nFestival# The recorded performances featured well-known stars of the opera world#\nVerdi was represented ty \"Rigoletto,\" \"Aida\" and \"La Traviata,\" and Mozart by \"The\nMarriage of Figaro\" and \"The Magic Flute*\" The remainder of the Festival schedule\nconsisted of \"Tannhauser\" by Wagner; \"Daughter of the Regiment\" by Donezetti; \"Car¬\nmen\" by Bizet; and \"Faust\" by Gounod*\nThere were six evening performances, two matinees, and one Sunday morning broadcast#\nThe WNYC Opera Festival was a notable addition to the other WNYC Festivals presented\nthroughout the year — the American Music Festival in February; the Shakespeare\nFestival in May; and the American Art Festival in October*\nHOW CAN EDUCATIONAL RADIO HOLD ITS AUDIENCE IN COMPETITION WITH TV?\n— FOR THE ANSWER COJE TO THE NAEB CONVENTION IN NOVEMBER\nMINNEAPOLIS IS ONLY FIVE HOURS FROM NEW YORK OR WASHINGTON"
}