{
  "id": "d1373-1",
  "text": "NAE8 NEWS LETTER. __ . . . Page 2.. . ■.. -Y arc* I •; ,\ninclude: “The Tinder Box,*' \"The Wild Swan,” mAladdin and His Lamp.”\n“Ferdinand the Bull, \" \"Pinnochio, \" ’’Enchanted Stag,” “Puss in noc : ,n\n\"Ali Baba and the Forty Thieves,” “Tom Thumb,” “The Nightingale,\"\n“Simple Simon,\" \"Goody Two Shoes,\" and \"The Adventures of Princess Maid-\niliEo\" Based upon three years of experience at educational story¬\ntelling, THE SERIES PROMISES TO BE BETTER THAN EVER.\nEach of these semester program series has claimed a sizeable audience*\nFrom the children come appreciative letters, valentines, Christmas cards,\nAND DRAWINGS THEY HAVE MADE TO PICTURE THE STORIES. TEACHERS WRITE OF\nTHE INTEREST SHOWN BE THEIR PUP ILS AND SUGGEST STORIES SUITABLE FOR\nPRESENTATION.\n\"The Land of Make-Believe is the most popular program in our\nSCHOOL,\" SAYS NORMAN JANNEY, PRINCIPAL OF FRANKLIN GRADE SCHOOL IN\nPullman. \"At present our listening audience includes our eighty\nPRIMARY STUDENTS, MOST OF WHOM ARE FAMILIAR, IN VARYING DEGREES,\nWITH THE STORIES PORTRAYED. THE METHOD OF PRESENTATION OF THIS\nPROGRAM IS EXCELLENT FROM BOTH THE TEACHERS1 AND STUDENTS* POINT\nOF VIEW. IT IS A WELL-DIRECTED DRAMATIZATION WITH A VERY INTEREST¬\nING INTRODUCTION THAT IMMEDIATELY CATCHES THE HIGHLY IMAGINATIVE\nFANCY OF YOUNGER CHILDREN,\nThe GREATEST VALUE OF THESE PROGRAMS COMES FROM THE MOTIVATION\nTHEY GIVE TO CLASS ACTIVITIES. DEMONSTRATIONS, DRAMATIZATIONS,\nAND OTHER GROUP ACTIVITIES NATURALLY FOLLOW INTERESTING PROGRAMS.\nExtensive library reading of desirable material is a natural\nOUTGROWTH.\"\nBut THE TRIBUTE COMES IN THE PROVING OF A THEORY. EDUCATORS SAID THAT\nEDUCATION BY MEANS OF ENTERTAINMENT WAS WORTH A TRIAL. AND SIX SEMESTERS\nHAVE SHOWN KWSC THAT IT CAN BE DONE—^AND THE STATION OF THE STATE COLLEGE\nof Washington can do it.\nIT HAS HAPPENED HERE\nRecognizing that history really does repeat itself and that there is\nSOME CONSOLATION IN THE FACT THAT A SITUATION EQUALLY AS SERIOUS AS THE\nPRESENT ONE HAS BEEN EXPERIENCED AND WEATHERED BY THE NATION BEFORE,\nWJR, Detroit, and Waldo Abbot, delve into history for a fifteen-minute\nBROADCAST ENTITLED ”IT Has HAPPENED HERE.\"\nUnder the direction of Abbot, director of broadcasting for the University\nof Michigan, the program reveals that the United States has had dark\ndays before, even traitors, and that enemies have invaded our land, but\nalways, American determination and ingenuity have won out. The program\nis broadcast Tuesdays at 3:15 p.m.\nADDITIONS TO NAEB SCRIPT EXCHANGE\nTitle AUTHOR SOURCE:\nUniversity of Michigan\nh\nFrom Legal History (I)\nFrom Legal History (II)\nThe Fourth Fiddler\nEllie Terretta\nEllje Terretta\nSarah B. Staebler"
}