{
  "id": "d267-63",
  "text": "14\nIIASB RADIO NETWORK\nPROGRAM OFFERING PROGRAM OFFERING\nTitle : FIRST IMPRESSIONS OF FAR\nAWAY PLACES\nType: Informal Discussion\nTime: 15:00\nNo,: 20 Programs\nOrigin: WICAR\nAudience: General\nSerial Number: 57-12\nRelease Date: January 20, 1957\nFollow a professor of drama as he takes a sabbatical leave and tours around the\nworld, recording his impressions of people and places in such places as Taipai,\nDelhi, Singapore, Cairo and Rome.\nAfter eighteen years of active work in dramatics, Don Buell, Professor of\nSpeech, Michigan State University, was granted a six month sabbatical leave to\nnake a theatre junket around the wor3.d, He found little theatre outside New\nifork, Japan and Italy, but with the dramatist*s eye, and the reporter*s.curi¬\nosity he records those vivid first impressions of a not-so-average tourist as\nhe makes his first trip around the world. Not posing as an expert in political\nscience or history, Mr, Buell tried to catch the man-on-the-street feeling of\nJapan, Formosa, Manila, Hong Kong, Malaya, Thailand, Geylon, India, Egypt, and\nItaly as the Cargo-Liner on which he and his party were passengers stopped over\nin the major and not-so-major ports of the world.\nWith the interest in travel, and the great number of tourists who are en route\nthese days, this series promises to be of interest to all listeners: those who\nhave been, those who are planning to go, and those who are longing to go. After\nbroadcasting weekly for 17 years over WKAR in a report of theatre news and re¬\nviews, Mr. Buell is thoroughly at home before the microphone, and these years\nof ad libbing about the theatre have stood him in good stead on this present\nseries. The programs are entertaining, yet educational, and catch the human\nside of those countries that are making tomorrow*s headlines.\nProgram\nIssue\nTopic\n1.\n3\nSailing from \"The City of Lights.\"\n2.\nh\nMeet the captain and his crew.\n3.\n5\nA 07,000 boat ride for h3 miles: the Panama Canal.\nk.\n6\nLeis that float toward Diamondhead,\n5.\n7\nJapan, the enigmatic country.\n6.\n8\nKyoto rises from the storybooks.\n7.\n9\nSecond Balcony cheers at the Kabuki Theater,"
}