{
  "id": "d1559-1",
  "text": "NA£B NEWS LETTER., Page 2,,\n,July *>*945\nENCE SHOULD BE OF THE UTMOST IMPORTANCE* {Ed«TORuS NOTES The CONTINUING\nCOMMITTEE HAS BEEN APPOINTED AND WILL MEET IN WASHINGTON ON JULY *$c\nNAEB WILL BE REPRESENTED ON THIS COMMITTEE,)\nFCC ANNOUNCES FINAL ALLOCATIONS FOR FMa TELEVISION AND FACSlMiLIE\nWash’ngton* June 27{UP)~~ The Feqeral Communications Commission\nANNOUNCED TODAY FINAL WAVELENGTH ALLOCATIONS FOR ALL POSTWAR HIGH FRE¬\nQUENCY BROADCASTING? OUTMODING PRESENT FREQUENCY MODULATION EQUIPMENT,\nN?NTY CHANNELS WILL BE CREATED BETWEEN 88 AND 08 MEGACYCLES» The NEW\nALLOCATION WILL SHIFT THE ENTIRE FM INDUSTRY FkOM ITS PRESENT BAND OF\n42 TO 50 MEGACYCLES,\nThe television banos were fixed at 44 to 50? 54 to 72? and 76 to 88\nMEGACYCLES*\nThe new frequency band between 88 and 92 megacycles will be for non¬\ncommercial? EDUCATIONAL FM AND BETWEEN 92 AND | 06 MEGACYCLES FOR\nREGULAR FM0\nThe Commission said in its final report that it found these frequen¬\ncies INTERFERENCE-FREE AND BEST SUITED FOR FM TRANSMISSION,\nThe new set-up* it was SAID? WOULD INVOLVE REMODELING of all existing\nFM transmitters. In additions approximately 400*000 persons who bought\nFM RECEIVERS FOR THE LOWER BAND BEFORE THE WAR MUST EITHER CONVERT THEIR\nSETS TO THE NEW BANDS OR BE CONTENT TO RECEIVE STANDARD BROADCASTS*\nAccording to a survey? FCC said* 365*000 sets for combineo standard ano\nFM RECEPTION CAN STILL BE used FOR STANDARD BROADCASTS BUT CANNOT BE\nCONVERTED TO THE NEW FM FREQUENCIES, An ADDITIONAL 30*000 SETS MAV BE\nCONVERTED FOR FM RECEPTION ON THE HIGHER FREQUENCY FOR ABOUT i*0, THE\nFCC SA I Do\nSTATUS OF PRESENT FM LICENSEES AND APPL1CANTS UNOER SHIFT\nOperators of educational FM stations and applicants for new educational\nFM facilities now know definitely how to plan for the future* A state¬\nment by FCC Chairman Paul C„ Porter points to an early issuance of En¬\ngineering Standards for the new bands, #n the meantime educational\nOPERATORS CAN SIT TIGHT WITHOUT JEOPARDIZING THE PROCESSING OF THEIR\napplicat ions. Chairman Pqrter^s statement oeclares that no applications\nWILL BE ACTED UPON FINALLY UNTIL SIXTY DAYS AFTER THE FREEZE 18 LIFTED,\nHere is how the new allocations will affect you:\nit. If YOU ARE THE OPERATOR of A NON-COMMERCIAL EDUCATIONAL STATION YOU\nWILL CONTINUE TO OPERATE IN THE 42-44 MC 0ANO WHICH HAS BEEN SET ASIDE\nAS THE INTERIM OPERATION BANO FOR ALL FM STATIONS OUR8NG THE TRANSITION\nPER 100* The FCC WILL EXPECT YOU TO INFORM THEM OF YOUR PLAN OF TRANS¬\nITION FROM THE PRESENT FREQUENCIES TO THE NEW FREQUENCIES, THE EXACT\nPROCEDURE WILL VARV WITH LOCATION ANO WILL BE MADE VERY FLEXIBLE BY THE\nFCCa More details will be available on this part of the change later>"
}