{
  "id": "d1346-15",
  "text": "16\nFORD HAM AIRS NEW DISCUSSION SERIES\n\"U.S.A. Perspective, 1952\", a six-week series has been broadcast over WFUV-FM,\nFordham University, since Sunday, July 6*\n•The series, produced by Pierre Marique, Jr., is divided into two parts. The\nfirst part centers around a discussion of the headlines of one year ago. This is\nfollowed by a question ans answer period between the moderators and guests*\nAlternating panel mentoers, along with Mr. Marique, include Miss Lelia West,\nlecturer and radio and IV personality Dr. Joseph R. Sherlock, Professor of Psy¬\nchology at Fordham University; Mrs. Robert A. Voegler and Mr. Thomas F. Cohalan.\nGuests on-the first program,, which analyzed the headline - \"Dewey Asks Build-Up\nof Strength to Cause Exhaustion of Reds\" - were Mr. Adolph A. Berle, Jr.$ The Honor¬\nable Walter A. Lynch; Commissioner John C. Maher, Chairman of the Parole Commission,\nN.Y.C.; and Mr. Daniel J; Rlesner, Vice President, National Republican Club and dele¬\ngate to the Republican National Convention.\nSAFETY AWARD MADE TO WHA\nUniversity of Wisconsin radio station WHA has been honored with an award for\nservice to the cause of traffic safety in Wisconsin, H. B. McCarty, director of the\nState Radio Stations announced recently.\nThe award, presented to WHA by the safety division of the Wisconsin State Mctor\nVehicle Department, was given in recognition of timely broadcasts of safety messages\nwhich played a part in reducing Wisconsin*s traffic death rate from more than lh\ndeaths per hundred million miles of travel in 1935 to less than seven deaths per hun¬\ndred million miles in 1951.\nSpecial safety programs broadcast during the year were:\n\"The Skid Test,\" performed on frozen Pine Lake near Clintonville in January;\nan interview with women school-traffic police of Milwaukee on Mrs* Aline\nHazard*s Homemakers* program; State Board of Health monthly \"Home Safety\"\nseries in cooperation with the National Safety Council; American Automo¬\nbile Association; and National Safety Council public service announcements*\nThe programs were carried by WHA, Madison; WLBL, Aubumdale; and the State FM\nnetwork.\nKUSD RECEIVES ACCOLADE FROM STATE ORGANIZATIONS\nCommending KUSD for its efforts in inproving the health of citizens of South\nDakota, the state health organizations recently adopted a resolution praising the\nUniversity of South Dakota radio station and radio department for writing and pro¬\nducing health education programs.\nAt the South Dakota health organization conference held in Huron last week plans\nwere also made to develop a series of programs for broadcast on South Dakota radio\nstations next year dealing with state health problems.\nMINNEAPOLIS IS ONLY FIVE HOURS FROM NEW YORK OR WASHINGTON"
}