{
  "id": "d1346-17",
  "text": "-18.\nWNYC AIRS FOURTH ANNUAL COLGATE UNIVERSITY FOREIGN POLICY CONFERENCE\nAgain this year WNYC mil broadcast all major sessions of the Fourth Annual\nColgate University Conference on American Foreign Policy direct from the campus of\nColgate University at Hamilton, New York, Saturday, July 26 through Thursday, July 31-\nLeading statesmen and distinguished representatives from all parts of the world\nwill participate in discussing various aspects of the conference’s general theme\n'’Implementing Our Foreign Policy.” Among thoee representing the United States will be\nAmbassador Ernest A. Gross, Deputy U.S. Representative to the U.N.; Assistant Secre¬\ntary of State Willard Thorpe; Secretary of the Army Frank Pace, Jr.; and former Sup¬\nreme Court Justice Owen J. Roberts. In addition, tentative acceptances have been re¬\nceived from Governor Thomas E. Dewey of New York, Senator William Benton of Connecti¬\ncut, Senator Eugene Milliken of Colorado and Representative John McCormack of Mass.\nIncluded ajiong the representatives of foreign countries are Hume Wrong, Canadian\nAmbassador to the U.S.; Percy Spender, Australian Ambassador to the U.S.; B.R. Sen,\nIndian Ambassador to the U.S.; You Chan Yang, Korean Ambassador to the U.S.; Mohammed\nAli, Pdcistan Ambassador to the U.S.; Abba Ebban, Israeli Ambassador to the U.S.;\nLeslie K. Munro, New Zealand Ambassador to the U»S. and J. Rafael Oreamuno, Costa\nRican Ambassador to the U.S.\nFor the first time in the four-year history of the conference, a Communist coun¬\ntry has accepted an invitation to participate. Ljubo Drndic, Director of the Yugoslav\nInformation Center in New York City will represent his country.\nWHA ANNOUNCES POLITICAL BROADCASTING PUNS\nTo assure all candidates for Wisconsin elective offices an opportunity to speak\nover the air directly to people in all parts of that state a Political Education Forum\nhas been arranged by the Wisconsin state stations headed by WHA.\nRepresentatives of the legally qualified parties were invited to attend a prelim¬\ninary meeting in the Secretary of State’s office on July 18. At that meeting rules\nwere agreed upon for the conduct of the Forum, and time assignments were made by the\ndrawing of lots. It was agreed that; if a candidate cannot be present in person at\nthe time of the broadcast he may exchange time with another candidate, have someone\nspeak in behalf of his candidacy, or arrange to have a tape recording made. It was\nalso agreed that no speaker should appear on the Forum more than once.\nCandidates will speak from the Radio Hall studios on the University campus in\nMadison. The broadcasts will go out over WHA-AM In Madison and 9 FM stations.\nThe ’’rules” agreed to by both Democrat and Republican candidates further state;\n’’Station officials will not in any way censor the talks presented. All speakers\nare aware of the libel laws and the less tangible rules of good taste. Each speaker\nwill assume full responsibility for his statements and should remember that he is be¬\ning heard by thousands of thinking.Wisconsin citizens.\n”At the time of the broadcast each speaker is required to file at the studio a\ntyped copy of his talk. These copies will be available at Radio Hall for inspection by\nanyone who may wish to inspect them. (A manuscript of from six to seven standard pages,\ndouble-spaced typed, is the usual length of a quarter-hour broadcast.)”"
}