{
  "id": "d1346-19",
  "text": "-20-\nJOHNS HOPKINS U. AWARDS $6000 FELLOWSHIP\nWilliam .Suchmann, graphic artist and designer with the American Broadcasting Com¬\npany, has been awarded the WAAM TELEVISION FELLOWSHIP by the Examining Committee for\nthis award. The Fellowship carries a ^6,000 stipend and a year’s graduate study at\nthe Johns Hopkins. University.\nThe WAAM Fellowship, the first of its kinds to be offered in the television in¬\ndustry, was created by mutual agreement between the WAAM Board of Directors and Johns\nHopkins. The WAAM directors have committed the Fellowship for a period of five years.\nJohns Hopkins will guide the studies of the Fellow and make available to him aLl the\nfacilities of the University.\nThis Fellowship was established in order that a mature person of high standing\nand currently active in television may have nine months free from his professional\nduties to pursue special studies of his own choosing vhich will add to his effectiv.\nness when he returns to his regular work in the industry. During his residency at\nJohns Hopkins, Mr. Suchmann will carry on an individual program of academic graduate\ns tudy.\nPlans Study of Psychology\nMr. Suchmann was graduated from the University of Pennsylvania in 1939 and from\nthe Franklin S'chool of Professional Art in 191*8• He has been with the American Broad¬\ncasting Company’s department of art since 19l*9> where he has been assistant director\nin charge of visual presentations for television commercial advertising and graphic\nportions of many types of programs.\nThe Fellowship recipient plans to study with Johns Hopkins authorities in the\nfields of educational method and psychology. With these faculty members he hopes to\nexplore what is known about the learning processes, through visual presentation, and\nto apply this knowledge to the design of graphic art presentation for television.\nThe Examining Committee was composed ofi Dr. Franklin Dunham, Chief of Radio-TV\nfor U.S. Office of Education; Mr. Henry Fischer, Special Adviser to Board of Regents,\nUniversity of State of New fork; P. Stewart Macaulay, Provost, The Johns Hopkins Uni¬\nversity; Dr. Sidney Painter, Chairman, Department of History, The Johns Hopkins Uni¬\nversity; Lynn Poole, Producer of ’’The Johns Hopkins Science Review”; and Mr.. Robert\nSaudek, Director of the Ford Foundation Radio-TV Workshop.\nKUSD ADDS TO STAFF, AWARDS SCHOLARSHIPS\nFour new staff members have been added to the University of South Dakota radio\ndepartment and station KUSD, according to Keith Nighbert, head of radio at the univer¬\nsity. They include: Mrs* Ruth Atkins, Vermillion, who will be traffic secretary and\nwomen's director; and John Briggs, Timber Lake, who will assume the responsibilities\nof studio engineer. Russell Jolly, of Elmhurst, Ill#, currently with NBC in Chicago,\nwill assume the position of production director on August 1. David Grover, of the\nAlabama Polytechnic institute, will take over as program director September 1. Until\nthat time, Howard Holst, Pierre, will serve as program director.\nScholarships amounting to ^350 have been awarded to four students planning to en¬\nter the departments of radio and radio engineering at the University of South Dakota\nnext fall, as follows: a $100 South Dakota Broadcasters association radio scholarship\nto Harlan Peterson, Beresford; a ^100 South Dakota Broadcasters association radio\nengineering scholarship to Jaron Zastrow, Columbia; a $100 South Dakota Health organ¬\nization scholarship to William Tosch, Madison; and a $f>0 radio guild scholarship to\nGary Altman, Plankinton. All four of the scholarship winners were graduated from\nhigh school this spring."
}