{
  "id": "d1346-21",
  "text": "-22-\nNAEB TAPE NETWORK MASS DUPLICATOR NOW IN OPERATION\nby John Holt\nTape Network Manager\nDon*t let it throw you, but we at last have a ’’mass duplicator.11\nAfter waiting for the good news for well over a year, some of our readers are\ncertain to take this note as a bad joke. But it is quite true. The Network now has\nits long-awaited duplicating machine, and it is in operation. Mr. Francis Rawdon\nSmith, designer of the electronics component, and Mr. Robert Johnston, Manager of the\nUniversity of Illinois Recording Service, spent three long days early this month mak¬\ning the initial installation and testing the equipment, and it is now in active use.\nThe amplifier now being used with the Toogood-designed mechanism is a temporary\nunit. Mr. Smith is working on another which he considers to be more satisfactory and\nwhich he will install in a few weeks.\nOn the whole, we are quite delighted with the duplicator and with our progress\nin learning to use it. The recording device is mounted on a table, the motor beneath\nit, and the electronic equipment in a separate cabinet. On each side of a frame ris¬\ning above the table are recording units, six on one side, five plus the master, or\nplay-back, unit on the other. The tapes lie on horizontal plates extending from the\nframe, pass over recording heads in the orthodox manner, and wind onto empty reels on\nwhich they stay. There is no rewind: the programs are duplicated backward.\nFull efficiency in the utilization of the equipment has not yet been realized,\nof course. A certain dexterity of operation has yet to be achieved by those piloting\nthe machine. The duplication is done at 22| ips., or ten minutes to a run-through,\nmaking up to eleven good copies. The variable is in the human element — loading and\nunloading the machine. But we are learning fast.\nAs programs are duplicated for individual distribution, they will be moved dir¬\nectly from the duplicating machine to a large cabinet with a pigeon hole alloted to\neach station.\nThese pigeon holes have no backs, but extend through the width of the cabinet.\nThus, on one side, they face the duplicating machine, and on the other they are open\nto our mailing area. The recordings are drawn from the pigion holes on the mailing\narea side of the cabinet, packed, and moved to our shipping window where they are\npicked up by the University of Illinois Mailing Center. And from there they go to\nthe stations.\nThe Network, then has made one more solid achievement in creating the operating\nbasis toward which so many have worked for so long.\nBIG BOY — PLANNING MILLION DOLLAR TV STATION?\nLITTLE BOY — BUILDING 10 WATT FM STATION IN PHYSICS LAB?\nTHE NAEB CONVENTION WELL HAVE SESSIONS FOR BOTH OF YOU"
}