{
  "id": "d1346-25",
  "text": "-26-\nAdministration Committee\nAmong the duties of the station manager or director is the responsibility to:\nformulate a basic policy with the school administrator, assume leadership in the plan¬\nning and production of schedules, build an adequate staff trained in teaching tech-\nniques as well as radio, cooperate with networks, local stations and community groups,\npublicize the services of the station, and evaluate the broadcast service.\nThe expansion of radio stations and the advent of TV will demand the services of\na number of additionalbroadcasting personnel. Therefore, it is recommended that NAEB:\n1) explore ways and means to set up internships with school broadcasting stations, 2)\nact as a clearing house for applicants for positions in school broadcasting, 3) spon-.\nsor the establishment of TV workshops, h) encourage foundations to give financial\nsupport to the production of programs for in school.\nScript Committee .\nSince the. planning, research and writing of scripts demands many work hours and\nsince so many have common educational objectives, some definite plans should be form¬\nulated to exchange materials, publicize script sources, encourage participation in\nscript contests that result in publication of scripts in the public domain and to set\nup plans to encourage organizations to use funds for preparation of scripts in desig¬\nnated areas* ,\n* Facilities Committee\nThe facilities committee report had three major divisions: 1) broadcast facilities\n2) reception facilities, and 3) servicing provisions* A transmitter for school broad¬\ncasts should be of sufficient power to reach the school community to be served. The\nstudios should be adequate for the activities of broadcasting including rehearsal,\nstudio production and radio classes with provisions for future expansion. Reception\nfacilities, including the acquisition and assignment of classroom radios, should be\nconsidered early in the planning for school broadcasting. Plans for the purchase of\nreceivers may include administrative purchase, individual school purchase with student\nbody participation, purchase by PTA groups, or gifts. Classroom reception may be\nprovided either by individual classroom receivers or through centralized sound systems*\nA tape recorder is suggested as an excellent aid. Servicing of school receivers may be\nby staff service personnel, contracted commercial service, or vocational students*\nProgramming Committee\nA program of high quality requires an adequate staff. Wherever school organiza¬\ntion makes it possible, subject consultants should help decide whether to use broad¬\ncasting as a classroom aid. Practically speaking, this responsibility should be\ncarried out by the supervisor and a teacher committee, assisted by a station coordin¬\nator and/or script writer assigned to the series.\nThe resources available to help satisfy program needs are, as follows! .station\nstaff members, supervisors and teachers within the school .system are .g prirapry source\nfor programs* Other educational stations are very helpful in offering scripts or\nsample programs • This general practice has become much more effective through the\nimportant work of the NAEB. The United States Office of Education has a script and\ntranscription exchange which can be very helpful. Commercial stations are often quite\nwilling to have school stations carry their educational programs. Community resources\nshould be explored for program aids."
}