{
  "id": "d1346-3",
  "text": "- h -\nThrough the narrative of the new radio series it is hoped to show that the\nprinciples enunciated by Jefferson and other great men of our history, which may\nhave lost meaning for many persons because of their familiarity, were outlined in\nwords actually spoken by living human beings at particular times and places.\nTo a public that, largely because of the Jefferson Heritage, selects its own\ngovernment and thereby helps to work out the destiny of its own land, the NAEB\ndramatic offerings will make an effort to bring home the eternal Jeffersonian truth\nthat \"The earth belongs to the living generation.\" '\nHence, it is felt, it can be'assumed that contemporary radio listeners — a\ncross-section of the voting public— will be easily stimulated to learn what men\nhave done with Jeffersonian principles over the years and what is being done with\nthese principles now.\nAs a mirror of the trend of historic thought and action from an early American\npredominantly agricultural society in an age of slow transportation and relative\nphysical isolation to a contemporary industrial society closely interlocked with the\nrest of the world, the NAEB programs will strive to reflect the American ideology as\nJefferson saw it. , This ideology is that human considerations come first and that the\nsanctity of the personality and freedom of the mind are the most precioiis of human\npossessions* *\nQuality Is Goal\nCommenting on the \"Jeffersonian Heritage\" series of radio programs, Mr. Probst\nsaid: ‘\n\"We are engaged in producing programs of the quality of ‘Henry V*\nor Sherwood's ’Abraham Lincoln in Illinois,* or MacLeish‘s ‘The Fall of\nthe City.» We are trying to produce programs that are ‘consumer durables.1\nWe are trying to produce programs that can be rebroadcast ten or twenty\nyears from now to both our satisfaction and the satisfaction of the\nlistener.\n\"We are doing this really against the whole current of American\nwriting and American commercial radio, which are devoted to the production\nof programs that are really ‘consumer perishables.1 --- At no previous\ntime in American radio has there been an occasion when anybody had the\nfunds, or thought it was worthwhile to try to create an outstanding\nseries of programs about Jefferson, or about any other outstanding American\n. * * «\"\n“The Jefferson Heritage\" is based on the research and writings of Prof• Dumas\nMalone, Columbia University. It is produced and directed by Frank Papp, written by\nMarton Wishengrad and Milton Geiger, with music by Wladimir Selinsky. It stars\nClaude Rains•\nWHAT WILL EDUCATIONAL RADIO DO NOW THAT TELEVISION IS HERE?\n—— OUR NOVEMBER CONVENTION WILL HELP YOU FIND THE ANSWER"
}