{
  "id": "d1346-6",
  "text": "- 7 -\nTRUMAN ENDORSES EDUCATIONAL TELEVISION\nPresident Truman, in a recent conference with members of the Federal Communications ■\nCommission, enthusiastically endorsed the reservation of television channels for edu¬\ncational use, according to Paul A# Walker, FCG chairman*\nThe commissioners, who began processing applications for new television stations on\nJuly 1, visited the White House at the invitation of the President. He commended’\nthem for their decision regarding educational television and urged that everything\n^possible be done to encourage the utilization of the reserved channels*\nChairman Walker told the President that although the Commission has reserved tele¬\nvision channels for education, the responsiblity to use those channels now rests with\nthe educators themselves.\nIn an interview at the close of the conference, Commissioner Frieda B. Hennock said\nthe President was gratified that the Commission has taken a firm stand on this issue*\n\"President Truman told us that he considers our decision to set aside 2i*2 channels\nfor non-commercial educational stations the most important one the Commission has ever\nmade,\" reported Miss Hennock.\nPresident Calls for Educational Cooperation\n\"He said that these educational stations would be of particular benefit to the boys\nand girls of this country, and would provide information to the adult population; he\ncalled upon educators of the country, and socially-minded segments of all communities,\nincluding foundations, to work together to get these educational stations built as\nsoon as possible.\"\nWalker said the President indicated his willingness to participate in this effort by\nmaking a public speech on the subject*\nTALK ABOUT EDUCATIONAL TELEVISION.\nBy Members of the Federal Communications Commission\nCommissioner Frieda B« Hennock reminded the National Jewish Welfare Board that educa¬\ntional television can strengthen American democracy when she spoke in Detroit in Mgy .\n\"These educational television stations could serve many millions of Americans in\ntheir schools and hones on a constant, intimate and inexpensive basis. They could\nspread knowledge, enlightenment and culture throughout the country on a scale hither¬\nto unknown* They could open the doors of the home and classroom to the finest\nteachers, physicians, artists and specialists of all kinds, including welfare. They\ncould spread the treasures of museums and libraries right before your eyes* Truly,\n3>0 million TV sets could become 50 miliion of our best equipped classrooms, to sup¬\nplement those classrooms in existing schools today.**\n\"Like democracy itself, educational-TV must be a coirmon undertaking, a mutual respons¬\nibility which none may shirk without increasing the dangers of nonfulfillment.\nAction in the form of spplications for TV licenses is needed and needed now, if we\nare to insure against the loss of this opportunity by default*\"\nMINNEAPOLIS IS AN EAST PLACE TO GET TOs\nFIVE JftIN RAILROAD LINES; FIVE TRANS-CONTINENTAL AIRLINES"
}