{
  "id": "d1346-8",
  "text": "~ 9 -\nWALKER URGES IMMEDIATE ACTION ON TV APPLICATIONS\nIn a speech made at the Fifth Annual Radio and Television Institute, Penn State Col¬\nlege, FCC Chairman Paul A. Walker pointed out the need for immediate action in apply¬\ning for reserved educational TV channels. The penalty, he said, might very well be\nthe loss of these reservations to educational television.\nAfter a resume of the educational stations* battle for reserved channels Chairman\nWalker went on to say: ,\n\"No request for a change in these reservations — or for any change in assignments\nin the Commission^ entire assignment plan — is to be considered for one year from\nthe effective date of the order. This date was June 2. So beginning June 3> 1953*\nanyone may request that a non-commercial educational assignment be changed to a\ncommercial assignment.\nJust what considerations will be persuasive with the Commission should there be any\nefforts to delete specific reserations after June 2, 19$3> I cannot foretell. But\nthis I can state: The best protection that educators can arrange is a definite pro¬\ngram of action designed to obtain financial support and the support of the education¬\nal community. Happily, there are increasing indications that Anerican education does\nnot intend to lose these assignments by default.\n\"The American Council on Education sponsored an institute here at Pennsylvania State\nCollege in April to study this problem. Those in attendance were unanimous in their\nconcern that educational groups take forthwith the steps necessary to establish and\ndevelop stations. A two-day institute was held in June by the Consolidated University\nof North Carolina under the leadership of President Gordon Gray to consider the po¬\ntentialities of educational television stations. The Association of Land-Grant Col¬\nleges and Universities at its annual meeting in Washington on November 13 will devote\na special session to the use of these assignments.\nJCET Aid\n\"Assisting university and school administrators is the Joint Committee on Educational\nTelevision which performed such stellar service in presenting education*s case before\nthe Commission. Now the JCET has set up a field consultation service to educators.\n\"The JCET*s program now has these objectives: (1) establishment of organizational\npatterns appropriate for varied educational interests planning to participate in the\nuse of a television channel; (2) explanation of legal procedures required by the FCC\nfor the application of a construction permit; (3) discussion of technical facilities\nneeded; (h) encouragement of program exchange on a regional and national basis.\n\"Last year the JCET received $90,000 from the Fund for Adult Education established by\nthe Ford Foundation. This year the Fund provided $lii£,000. This is a public service\nof the highest order. I cannot think of a more urgent cause for which funds could be\nprovided at this time. This money is an investment in the future of our nation. It\nwill pay dividends in the intellectual and spiritual development of our children. It\nwill pay dividends in the increased ability of adults to acquit themselves mere ably\nas responsible citizens of a free democracy. The Fund for Adult Education; established\nby the Ford Foundation deserves the congratulations and the gratitude of every Ameri¬\ncan who is interested in more and better education for all.\nMINNEAPOLIS IS ONLY FIVE HOURS FROM NEW YORK OR WASHINGTON"
}