{
  "id": "d1030-15",
  "text": "February 9$ 19$h\nPage TWO\nHeller is an old, personal friend and we spent a great deal of time together*\nI reviewed the Los Angeles and San Francisco situations. His key people are\nactive in both stations. Hejwanted to be educated on the whole problem because\nthe matter has come up at their boards and they are in the throes of determining\na policy* The matter may come up for consideration in the near future. I stressed\nthe need for securing cooperation so that the first voice hired should not be re-*\nstricted but should be given permission to instruct students, to produce, to diaect\netc. etc. I think we can obtain this but there again each local will have to decide\nThe only area that he was worried about is what would happen if Los Angeles or\nSan Francisco were to use senior high-school or junior college dramatic societies\nto put on Hamlet or life with Father, etc. Of course, I advanced all of the WNYC\narguments. He admits they are valid but may be in immediate, direct conflict with\nactors who are seeking employment on commercial stations. I do no think we have to\nwo$£y about this because the area of conflict will depend to a large degree on the\narea of close relationship in each community*\nI didn't discuss the matter with Petrillo because I can always meet him in New York,\nand my WNYC pattern I am sure could be extended. In addition, the very friendly\nrelationship in Los Angeles will go a long way to help.\nTo sum up, I am glad I gpt into it and it is too bad this was not done six months\nago when the immediate problems like St. Louis would hot be so urgent. I made it\nvery clear that I wasn't involved in negotiation, that I wasn't setting up con¬\ntracts for the individual stations but tiding to evolve a general policy*\nBefore I enumerate the highlights of each area, I would like to tell you how en¬\ncourage I was by Sill Senner's complete grasp of the problem and his relationship\nwith the key community people. Frankly, I don't think anybody knew the extent of\nhis contacts and his relationship with these people.\nI don't think I ever met Jim Day before but I couldn't help but be thrilled at his\ngrasp of all of the problems and his concept of the role of the station in the\ncommunity.\nHouston was a revelation^ I spent three hours with John, and I saw his set-up.\nI think I will be able to help him with the Mayor, who is an old friend and the\nformer president of the F.M. Association. He knows the area, he knows where he\nis going and I think he will educate his superiors to the role of the station. I\ncannot help but feel that there should be more contact between our key guys and\nhim and his station. Unless I have been taken for a ride, I am convinced that he\nwill not be kicked around, and he will not allow the station to be used for any\npersonal or sectional advantages.\nBill Woods, of course, is a trained, experienced guy. I got to talk to him only\nbecause when Dick called me in Houston about some problem which arose, he told me\nthat 4» was meeting with the Union people. I called baba and made it clear that I\nwas speaking as an old friend and that I hoped to get to Pittsburgh only after I\nfinished the other cities. As it was, I was able to help him with some suggestions\nfor his meeting, and received from him a very good report on his IA negotiation\nwhich, by the way, I hope will help Dick in his negotiations.\nThat's it—-and now for the individual cities*"
}