{
  "id": "d914-10",
  "text": "S-OJP-I\n14 September 1953\nTo Whom It May Concern?\nNational Association of Educational Broadcasters\n630 Fifth Avenue\nHew York 20, New York\nWhile listening for the second time to the superb NAEB series THE\nJEFFERSONIAN HER IT ACE as broadcast here over WSUI, the conviction grew\nin my mind that there should be a comparable series about another great\ndemocrat, the late, Olympian Mr. Justice Braudels*\nSince Louis D« Braudels, perhaps more than any other individual, had so\nmuch to do with the expanded horizons of our present way of life, from\nthe standpoint of social, economic and industrial legislation, certainly\nhe deserves so much recognition? Considering his background and the\nabsorbing humanness and individuality of the man, the drama and conflict\nof his life, there should be ample material for an inspiring and\ninformative series titled, perhaps, BRANDS IS? DISSENTING HtQPHET* As\nlawyer and justice, LDB was first a determinedly free American and a\nsingularly conscientious citizen, yet nearly all that the average\nsupposedly well-educated, well-informed individual knows about him is\nthat he was a Jew and a Supreme Court Justice* In view of his monumental,\ncontribution to the American way of life, isn8t it about time something\nwas done to bring the facts homo to a thoughtful few at least?\nMay I suggest that Claude Rains would be an admirable choice to portray\nMr* Brandeis? Or Raymond Massey* And as technical adviser who could\npossibly be a better choice than Dr* Alpheus Thomas Mason, currently\nMcCormick Professor of Jurisprudence at Princeton University? Dr* Iks on3 3\nBRANDEIS? LAWYER AND JUDGE IN TEE MCDERN STATE and BRANDEIS? A FREE MAN°S\nLIFE are authoritative, definitive —» and superb readingl They could, I\nshould think, form the point of departure for a superb radio series to\nsupplement and Implement THE JEFFEHSCMIAN HERITAGE*\nSincerely,\n(Signed) Laura Eliza Blivon\n(Laura Elisa Bliven) Postoffice Box 405\nCedar Rapids, Iowa"
}