{
  "id": "d914-36",
  "text": "(MSB Hatwork Acceptance Gosssittee Beport - 1953)\nFags 2\nThe offerings of the MSB Taps Network for this Fail lack variety, and they\nare very think picking* I cannot understand i&y members have not yt/t been offered\nthe Fund for Adult Education (brants-in-Aid programs. \\te ware required to have then\nall at MSB Headquarters by August 1st at the very latest* There want be at least\nseven series of programs that are available* They sere chosen because they mere\nexcellent programs* Why aren9t they being distributed?\nFrankly, it would seem to m that the Fund for Adult Education wtuld get\ndisgusted with the Tape Network* The Fund put tjp 180,000 and all it hart received\nso far is a report* The member stations who won awards have all broadcast their\nown programs or are going to shortly, but the rest of the membership has not even\nbeen offered these programs*\nX understand that there is a plan to release them all at one time, anti make\na big splurge in the papers* That8® bad* Ws all love a big splurge in the papers,\nbut if me get all of these programs at one time, it is going to croud our ini&»\nvidual schedules* So sfcy are these progwaas sitting in the Hague? Gregory Hall*\nAt the very least, the network Acceptance Ccessittee should be continually\ninformed about the status of grant&»io-aid programs*\nThe Ccesnittee raises another questions are me not getting too much material\nfrom abroad for the Network, and negLecting our member stations? X agree tha\\ the\nBBC plays and foreign music are outstanding* They are very, very good* But 1\ndon8t think we ought to take everything that is offered just because it originates\nin a foreign country* Certainly me should encourage interchange of programs inter**\nnationally «— but let8® make sure that they are geared to American audiences* And\nlet8 a not go so overboard an foreign programs that our hCEa^produoed programs are\ncooperatively bypassed*\nGranted, an eaosellent job as been done by our officers in obtaining pro**\ngrams, and the privilege of offering them, from foreign countries* Adequate\nforeign programs are available to individual member stations from the international\ninformation services* Why should member stations pay a 1400 fee to get foreign\nprograms from MSB when so mazy can be obtained free? It is fine for the Tape\nnetwork to list all such foreign programs and give stations information as to where\nthey can be obtained* The function of the MSB Tape network, as X see it, is to\nprovide programs we cannot get otherwise*\nThere are other tendencies in programming, noted by the Ccesnittee, which we\nfeel should be corrected* Too many long programs are being offered* Hours of music\nand talk* Too many half-hour programs* Why aren’t more 15»mixxute programs made\navailable?\nHow regarding the Program Planning Committed * It has dons a wonderful job\nin obtaining excellent programs and financial support ffcom outside agencies* A\nnew and equally competent ccesnittee should be appointed for this purpose* How*\never, X think the Network Acceptance CoBndttee should not only he espowered, but\nalso instructed, to suggest program series to member stations which could be\nproduced on a cooperative basis* Programs could be developed and coordinated\nthrough the Acceptance Committee which would be of great value, with a number of\nmember stations actively participating and contributing to the project* For ea»\nample, every one of us has sons kind of a book-'&uthor program* If thirteen\nmember stations could each develop one in a series —» one really outstanding"
}