{
  "id": "d914-39",
  "text": "E. G. Burrows, Associate Director-Radio, and Manager, WUOM\nUniversity of Michigan • Ann Arbor, Mic\nMr. William G. Harley\nNational Association of\nEducational Broadcasters\n1\n1346 Connecticut Avenue, NW\nWashington 6, D.C.\nDear Bill:\nThe Network Acceptance Committee, which met hastily on Wednes¬\nday of the Convention, came up with several recommendations. The\nmost important of these was the request that you (or Harold or\nsomeone else you might assign, if you are out of town) present a\nweekly five-minute report on new developments in educational broad¬\ncasting. It was felt that this should include both radio and TV.\nEmphasis should, of course, be placed on NAEB without neglecting\nother organizations. Items such as those that appear in the News¬\nletter or printed \"Washington Report\" might well be given advance\nnotice here, though the presentation should be addressed to the\ngeneral public and not to station personnel or other broadcasters.\nWe would need to find a title for the program which would not\nconflict with the existing \"Washington Report.\" Such a five-minute\nreport can easily be included each week with the other five-minute\nprograms currently being distributed. If you find this added task\nis simply not possible at this time, please let me and Bob Underwood\nknow since we want to include it in the first quarter 1962 offering.\nThe Committee extended its appreciation to John Lewis for his\nwork on \"Washington Report\" and recommended that headquarters be\non the lookout for funds to increase this type of coverage of\nWashington affairs. An immediate suggestion would be the purchase\nof an Ampex 600 or other comparable portable machine which could be\nused in gathering interviews on location, could be used for record¬\ning your program at your office, and might even be used for small\nediting jobs.\nWord has just been received from Acda that (finally) some\nstandby European Review programs are on their way. As soon as we\nhave them in hand, we will announce distribution of the program.\nWhen shortwave transmission is poor, we will substitute a pre-taped\nprogram. The Committee agreed that, although the experiment might\nnot prove satisfactory, NAEB should make an effort to disseminate\nthe programs on tape. If enough member stations eventually are\nable to receive the programs direct, or if not enough stations\nagree to use the tapes, we will drop the programs from the network.\nBut at least we can say to the Netherlands that we have tried."
}