{
  "id": "d1507-0",
  "text": "WA EB !■) £ I S LETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nFrank £. Schooley, Editor, Station WILL, Urbana, III*\nSeptember 15, 1944\n(A Supplement)\nTHE NASB CONVENTION* OCTOBER PP AMD 2,1\nYes, in a little more than A MONTH NASB WILL be holoing its annual con¬\nvention at the Morrison Hotel in Chicago, on Sunday ano Monday, October\n22 and 23,\nIf you have any suggestions for the meeting agenda, please forward them\nto the Executive Secretary no later than October I*\n✓\nAlreaoy these topics have seen suggested:\nReport on the FCC hearing,\nEducational participation in the NAB-yardstick-listener survey.\nPolitical broadcast over educational stations.\nPromotion and public relations.\nImproving program quality.\nThe institutional budget and the radio station.\nEducation for and education by radio.\nThere will also be a business meeting which will include election of\nOFFICERS? APPOINTMENT OF A NEW EXECUTIVE SECRETARY, AND REPORTS FROM\nOUT-GOING OFFICERS,\nWSUI INAUGURATES FALL PROGRAM SERIES\nWSUI, University of Iowa, has announced its fall schedule of classroom\nbroadcasts, Roman literature will be broadcast three times weekly with\nProfessor Dorance S, White of the classical language department. He\nwill survey the eight fields of Roman literature. Professor B. V, Craw¬\nford of the Englfshxdepartment will broadcast his course on the English\nNovel, Professor Philip Greeley Clapp, of the music department, will\nbroadcast his course on late 19th century music. And, \"Little Known\nReligious Groups’5 will be broadcast by Professor Marcus Bach. This\nCOURSE INCLUDES THE STUDY OF VARIOUS RELjOOUS GROUPS WHOSE MUSIC ANO\nLITURGY ARE AN INTEGRAL PART OF THE NAT I ON9S RELIGOUS heritage.\nWNYC GIVES SPECIAL STORM SERVICE\nThe Federal Communications Commission gave New York City*s Municipal\nBroadcasting station, WNYC, authority to continue service after lOJOO p,m.\ntoday. The station usually goes off the air at 10500 p.m. WNYC Director\nMorris Novik says the FCC granted the time-extension in order to keep the\nPUBLIC INFORMED ABOUT SUBWAY TIE-UPS, TO REDIRECT TRAFFIC AND PERFORM\nOTHER PUBLIC SERVICES IN CONNECTION WITH THE HURRICANE.\nRANDOM NOTES -Jim Miles, recently named general program director for\nW8AAf Purdue University, is instituting a number of new features including"
}