{
  "id": "d208-132",
  "text": "NAEB RADIO PROGRAM PLANNING\nIDEA CLINIC\n1. CRITIC’S CHOICE. This shav is ran successfully by WNYC; musical in nature\nI-- bub with a good gimmick* The idea is to run new LP*s in a program* with intro¬\nductions taken from the critical comments in the press, Saturday Review,\nHarper»s, various musical journals, aid other sources. Guest critics are used\nat WNYC from time to time; most towns would have a few such critics, at least.\nIt is probable that your listeners will know one or two critics fairly well,\nbut with a gleaning from numerous sources, you111 generally be giving\"them\na lot of releases that will be new to them. Adaptation of the idea might be\nto use non-working, but qualified critics such as local symphony conductor,\nteachers of music, etc*\nFACULTY PLATFCRM. Notiling new about tils idea, of course, but the title is\n‘ free to anyone who wants to use it. WUOT, Knoxville, uses tills nightty and\nalso tapes a special once a week version of a contemporary subject for some lg\nTennessee commercial stations to carry on gratis time. The idea is to provide\na platform from which faculty members can project their ideas and facts* outside\nthe classroom. This is opinion but backed by training and research; in other\nwords, totie faculty standing which carries a connotation of qualified people, we\nhope. Format is an interrogation of the faculty member by two questioners—\none a^Journaliaa professor, the other a radio newsman. They delve into back¬\nground, of course; only a quick mentioning of the surface facts in order to\nset the picture up, then into the deeper meanings. Subjects have included:\nall current problems/Nuclear Weapons as a Goad to Peaceful Solution of Problems,'\nWhat Does Education for Group Living Really Mean to Vbur Children?/democracy\n^s an Ideal in History, and special subjects from scientists, language people,\nx^ra±±HKS±£tx,<^ducaticnists, etc*\nWINTERTIME SUNDAY. WUOT uses this for student training; it would be a\nbetter show for the audience if it were done by professional staff, of course.\n£ or mat is a visit to someone’s house, that of the moderator, at which time\nsome four or feve intelligent, mature people read poems, essays, short stories,\narticles, critical materials, and similar belle lettres to each other and thence\nto the audience at home. Idea behind the show is to attempt to revive to some\nextent the old-fashioned (?) idea of reading aloud for diversion. Naturally\nsome discussion of the material often comes in; sometimes this takes most of the\nprogram and only one or two items are read. Program is carefully rehearsed for\ninterpretation, timing, style, etc.\nSAFETY BEGINS BEFORE BREAKFAST. This program won the Sloan Highway Safety\nAward for WUOT this year. Format is a breakfast table conversation between Mr.\nand Mrs. John Qo Safety• No realism, of course; we know nobody would discuss\nsafety before .yforhji breakfast, and nobody would be named J. Q. Safety, either •\nThe dialogue iheavily spiced with humor of a fairly sophisticated kind, but the\nactual Safety ideas are sound and serious, caning from the National Council and\nstate council. Success depdnds upon smart writing and professional acting of\nwell-paced, light comedy; but always remembering that the real purpose is to\ncommunicate ideas for highway safety.\nNOTE: FRANK, would you please indicate jiuthe NEWSLETTER that I would welcome\n\\ ideasfpr publication in lafcef issues; ideas that give complete details^-Tell^ ’em\nVto/Sendvbhea to me at 1UCT, The University of Tennessee, Knoxville, and I will\npass them along to you.\nNOTE; Ken Wright's Committee will welcome program ideas from\nNAEB members for inclusion in this monthly sheet."
}