{
  "id": "d208-15",
  "text": "&JLL2\n14 September 1953\nNational Association of Educational Broadcasters\n630 Fifth Avenue\nNew York 20, New York\nTo Whom It May Concern!\nWhile listening for the second time to the superb NAEB series THE\nJEFFERSONIAN HERITAGE as broadcast here over WSUI, the conviction grew\nin my mind that there should be a comparable series about another great\ndemocrat, the late, Olympian Mr* Justice Braudels*\nSince Louis B® Braudels, perhaps metre than any other individual, had so\nmuch to do with the expanded horizons of our present way of life, from\nthe standpoint of social, economic and industrial legislation, certainly\nhe deserves so much recognition? Considering his background and the\nabsorbing humanness and individuality of the man, the drama and conflict\nof his life, there should be ample material for an inspiring and\ninformative series titled, perhaps, BRANDS IS! DISSENTING PROPHET* As\nlawyer and justice, LDB was first a determinedly free American and a\nsingularly conscientious citizen, yet nearly all that the average\nsupposedly weH«educated, ¥elX*»informed individual knows about him Is\nthat he was a Jew and a Supreme Court Justice* In view of his monumental,\ncontribution to the American way of life, isnQt it about time something\nwas done to bring the facts home to a thoughtful few at least?\nMay I suggest that Claude Rains would be an admirable choice to portray\nMr* Brandeie? Or Raymond Massey* And as technical adviser who could\npossibly be a better choice than Dr® Alpheus Thoms Mason, currently\nMcCormick Professor of Jurisprudence at Princeton University? Dr® Mason8s\nBRANDEISt LAWYER AND JUDGE IN THE MCKERN STATE and BRANDEIS* A FREE MAN9S\nLIFE are authoritative, definitive «— and superb reading I They could, I\nshould think, fora the point of departure for a superb radio series to\nsupplement and Implement THE JEFFERSONIAN HERITAGE*\nSincerely,\n(Signed) Laura Elisa Bliven\n(Laura Elisa Bliven) Postoffice Bcsc 405\nCedar Rapids, Iowa"
}