{
  "id": "d208-182",
  "text": "-8.\ncasting Voice programs» In addition, VOA provides the field\nwith prepared programs to be placed on local radio stations\nby the USIA missions# The Broadcasting Service supplies TV\nmaterial regularly to 15 countries# This material consists\nof a special series entitled “Industry on Parade” and special\nevents. Additional television material is supplied the field\non request#\nPress Service\nSends a daily flow of 75,000 words of news and a monthly\naverage of 28,000 photo prints to USIS posts in 77 countries.\nAs part of this service, a daily press file is transmitted\nby wireless for use in 55 countries by 10,000 foreign news\noutlets. In addition, 75 million publications of all kinds\nwill be distributed in the year by the field posts, to be\nread by hundreds of millions of persons# From pilot models\nof pamphlets and other source materials prepared in Washington,\nthe field posts determine how many copies they require and\nproduce them locally and at regional centers#\nMotion Picture Service\nPrepares American documentary films in 22 languages. The\nfilms are seen by hundreds of millions ci persons annually\nthrough loans to private groups and public agencies# Maintains\nsome 6000 16mm sound projectors and over 300 mobile units.\nIn addition, many U, S, documentary films are exhibited through\ncommercial theaters abroad,as well as through an increasing\nnumber of foreign television stations#\nInformation Center Service\nServices 155 information centers in 63 countries which\nconduct library programs and community activities such as\nlectures, exhibits, and film showings based on the libraiy\ncollection. The average information center has from 7,000\nto 10,000 volumes and the world-wide collection totals slightly\nless than two million books# Twenty-nine bookmobiles extend\nthis service into remote areas in six countries. Several\ncomprehensive three-dimensional traveling exhibits are\nconstantly being moved from country to country for display\nat U. S. Information Centers, These graphically supplement\nthe books and other reading material found in the Centers,\nThe service also is responsible for the translation and\ndistribution of American books overseas, and for the\nInformational Media Guaranty Program# Formerly vested in\nECA and MSA, the latter program guarantees the convertibility\ninto dollars of foreign currencies received by American\npublishers and motion-picture producers from the foreign\nsale of their approved materials. Agreements to this effect\nare now in force with nine countries, chiefly in Europe;\ntotal contracts of $22 millions have bee:, guaranteed."
}