{
  "id": "d208-193",
  "text": "fcadio Program Planning—3 <>\nto interpret our tores, economic philosophies, political ;aid so dal character¬\nistics :in terms of our industrial!zed society*\nSkomia reported on a series called What Is A Good School? which would be\nan attempt to compare the basic concepts of s<3ioo!fii} private, parochial,\nAmerican versus European, progressive, traditional „\nFinally, Skomia reported on a discuss!cn with a Mr. Birch about a series\non the three branches of U. S* government.\nThe seven de Tocqu ©virile scripts war® given much attention. All members\npresent had read all or most of than aid a lengthy discussion culminated in the\ndecision that these programs did notwarrant a \"prestige11 production budget. We\nrealize that there is a consider able investment in the scripts, and it should\nbe reclaimed by hewing the programs produced for network distribution on a\n/Imail budget by one of the NAEB members. Th© Universities of Minnesota, North\nCarolina, and Wisconsin were suggested as possible producing agencies » A ceil¬\ning of $5000 was agreed upon as the price of prodiction if possible. I pro¬\nposed an idea that the cemuittoe accepted for future references to follow the\nd© locquevill® pro grans with a 20th Century de Todquavillo to comment on the\nAmerica of today, fallowing same of the paths taken by thclnriginal de Toccjue-\nville. Alistair Cooke was mentioned as a possible central' figure.\nPaul Street of National Education Association has suggested a serif:© tdod\nhj with the NEA Centennial of 1957. The theme would be \"In Educated People;\nMoves Freedom Forward\", and the aim of the seiies would be to interpret the role\nof education in a democracy. This has been dene, so the approach would have to\nb® fresh and creative. The committee felt that the information in the proposal\nmo too sketchy, asd instructed®*!® to write for ihither details* (Letter to\nStreet attached.)\nV/® discussed two cuirent books that might b® used as bases for two series.\nOn© isWeston LaBarr©*s The Humaiy Animal on anthropological development, and the\notlier is They Thought Tby Milton Mayer, a study of the Genoa*\ncitizen iii a ;a^!33.^^ow^undcrT^Eire~'lEzis* It was the thought of the committee\nfeiatf \"oh© books would simply serve as a catalyst to get such scrips underway\nwl'fch other research to bo used. No action was taken on these ideas.\nFrom Glenn Starlin came the proposal to use Dr. Caste 11 on on© or more\nseries on the3© subjects: (1) From Puritanism to Pragmatism, tracings of\nMari can 'thought, (2) a prog rm the history of\nthought, (3) Every Man His Own Moralist, dealing with elementary ethics, and\n(4) Education in Mociez^\"g&ewky. \"Uso Starlin suggests that Dr. Castall might\no® willing Id” resume two former sell e s , Invitaiicai to Head, and Window on the\nIvory Tower. The committee reacted vcrylPavorably i'ball suggestions, bui''ex¬\npressed” preference for the programs in the order listed afcov®^ I was* instructed\nto write Starlin an affirmative answer. (Letter to Starlin attached.)\n^ James A. Sweet of the Libraiy of Congress proposed the Libr&iy -ssoekly\nchamber music concerts, complete with 15 minute book reviews during intermission.\nThe usual netmjk duplicating troxfcles with music discouraged the committee from\nrecommending this, but the thought was that member stations might like to get\nthe tapes direct from WGMS, Washington, for a small fee, Boraie Buck sent word\nthat he had used these tapes, and found the music excellent but the reviews\n(Soil. I was instructed to inquire of Mr,., Sweet if the tapes are still avail¬\nable for individual stations. (Letter to Sweet attached. 1"
}