{
  "id": "d208-2",
  "text": "COPY\n\\\nreceived\nradio station\nCANADIAN BROADCASTING CORPORATION\n«3f3ilE&\njWILL 0 V/IU.0\nor;:vi.Asity of itn'fio'ii\nSeymour N. Siegel\nWNYO, Municipal Broadcasting System\n2500 Municipal Building\nNew York 7, No Y.\nJuly 16, 1953\nDear 8y:\nAt long last a number of us have had the opportunity to listen to two\nof the shows in the ^Jeffersonian Heritage” series* The two tapes\nwere those which you apparently sent to Dr* Dilworth, Director of Pro¬\ngram Planning and Production, almost a year ago* I hadn’t been aware\nthat they were available here until quits recently*\nX think all of us were impressed with ,TThe Living Declaration .** The\nshow had vitality and humour, as well as dignity and point* I could\nperhaps wish that Wishengrad hadn’t made Jefferson quite so aphoristics\nbut maybe that was the only way significant aspects of his philosophy\ncould be put across within the half hour limit* The music and the\nballad singer were very nice indeed*\nwThe Democrat and the Commissar** by Milton Geiger met a mixed reception\nhere* Several of us felt that the device of bringing back Jefferson\nto testify before a posthumous committee on revolutionary activities\nwas cumbersome. I personally felt that the case against the Commissar\nwould in some listeners’ sands be prejudged before the argument began,\npartly because the Commissar uses an obviously Russian accent* Other\nmembers- of the Department didn’t feel this way at all and like! both\nthe voice used and the show as a whole* I think all of us agreed that\nthe intellectual content is good, with the battle of ideologies being\nthrown into sharp and interesting relief.\nMy reason for writing you now is to ask if we could obtain the other\neleven tapes in the series* Following our current election campaign\nwhich is occupying a good deal of network time, we shall have seven\nhalf-hour periods on Thursdays, 3:00 to 8:30 P«M«, in which a selection\nfrom the Jeffersonian series can be presented. I have read the scripts\nand had made tentative decisions about the shows we would like to use*\nHowever, after hearing two of the broadcasts I think we could make a\nbetter selection from actual listening to the entire series.\nWould you let me know if we could obtain these tapes fairly soon, since\nAugust 13 would be the date of the first broadcast."
}