{
  "id": "d208-210",
  "text": "RADIO PROGRAMMING IN THE FACE OF TV\nDick Vogl, Program Director, WOI\n(The following is an abbreviated version of his talk,)\nBasic program-production staffs at WOI are separate. We feel this is the best way\nto overcome the TV GIANT and preserve our 31-year investment in radio. Radio\nstaff inaugurated a campaign to STAMP OUT TV. This was unsuccessful. TV at the\noutset, at least, has too much glamour for that. People watch it as long as some¬\nthing wiggles. It has the attraction of a child’s new toy. Newspapers give it\nall kinds of free publicity.. .the fact that the ’’story’1 is about TV makes it ’’news.”\nRadio programming within this framework becomes critical. We make it a point (with¬\nin practical limitations) to offer alternate programs... the old idea which many\neducational radio stations have used successfully against commercial radio. We\ntry to program a strong ’’culture” show on radio across from a weak \"entertainment”\nfeature on TV.\nWe let the TV audience know what’s offered on radio. Whenever possible we insert\na radio promotion spot, calling attention to a specific radio show, on TV ahead of\nthe low-grade television program. For instance: \"Tonight ’Ways of Mankind’ tells\nthe story of THE BORROWED WIFE over WOI-FM. This program can be heard at 8 o’clock.”\n(This is a pitch for the disgruntled TV audience who would turn the set off at 8\no’clock rather than watch a whodunit.) Similarly, we offer classical music night¬\nly from 0 p.m. to 11 p.m., across from wrestling, boxing, several poor dramatic\nshows, etc.\nWe can follow the foregoing practice because we operate both the radio and the TV\nstation. Local conditions will dictate variations on this plan. We continue to\ncapitalize on good music. So far TV has failed to come up with anything that can\ncompete with classical music.\nWe try to offer GOOD radio drama. Recent RCA announcement that Old Vic is recording\npil 1 the Shakespeare tragedies on LP is good news for educational radio. Shakes¬\npeare lends himself admirably to radio...his sets were limited...his lines told\nthe story. Shakespeare is 85% reading, 15% setting. We continue to promote radio\nnews. We feel radio can do a better job of it that TV...more completely...more\nquickly... .TV news is limited to ’’All the news that fits our filmi\" Radio has no\nsuch limitations.\nEducational radio, \"Radio With a Purpose,” can compete with TV better than commer¬\ncial \"entertainment” radio. Puck (a comic weekly) recently announced results of\nsurvey on impact of TV in major metropolitan market. Two pro-radio results: (l)\nRadio listening in TV homes is higher among better-educated than among less educa¬\nted homes, and (2) After two years of TV, a Radior-TV home begins to come back sharp¬\nly to nighttime radio listening.\nNote how network radio is meeting the TV challenge. More drama, more documentary,\nmore experimentation.. .the sort of thing NAEB has been doing for years.’ This means\ngreater competition for educational radio, but it also means more people will be¬\ncome awakened to the value of high-class programming.\nAs given at 1953 National Convention\nNorman, Oklahoma\nOctober 31, 1953"
}