{
  "id": "d208-212",
  "text": "Dawson-2\nNow I’m not enough of a research specialist to analyze why, against roost earlier\npredictions,radio is showing such an amazing vitality in the face of television.\nMaybe Dallas Smythe will do us a survey on that one of these days. I frankly would\nnever have predicted \"Trend Number Two\"-the fact that radio is booming.\nBut on\"Trend Number Two\"—-the evident raising of standards in radio-I’m going to\nstick my neck out. I thin’- it quite likely stems from two possible causes.\nFirst, it’s quite evident that Television has had a paradoxical effect on both\nmovies and radio. Movies, if you follow them at all, are better than ever-more\nmature, more tasteful, more and more appealing to a discriminating, intelligent,\nadult audience. And we’ve already noted the same trend in radio.\nWithout any figures or charts to back me up-and this, anyway, is something that\ncan't be measured statistically-I’d say that Television has put its major empha¬\nsis on the mass audience. Correspondingly, the other media have had to appeal to\na more discriminating mature audience and are finding it profitable.\nAs for the second cause, here I could really be sticking my neck out, so I'll put\nit in the form of a question....\nBut isn’t it just possible that the networks have been eyeing the educational broad¬\ncasters a little more closely than they would ever admit?\nTen years ago, we, the educational broadcasters, were figuratively patted on the\nhead and then pretty much ignored-certainly not to be taken seriously. Since\nWorld War II, the \"step-child\" has grown up. I think we all realize that, slowly\nbut surely, without the funds to put on a continuous high-pressure publicity cam¬\npaign, we are neverthe less reaching an ever-larger audience of people (not neces¬\nsarily the intellectuals alone) who are finding that educational radio programs can\nbe exciting, rewarding listening. People who are finding, perhaps, for the first\ntime, that a spark has been put to the spirit, as Anatole France phrased it, and\nthat they have caught fire from, say, a discussion of one of the Great Books, or\nan excerpt from a fine play, or a talk on science or philosophy, or a strain of\ngreat music.\nWe are, in short, each of us, a potential force in our community. Our efforts are\nbeing increasingly recognized and appreciated. The Allerton House predictions of\n1949 and 1950 are coming true. So what about our program for the future?\n* * * % * * * * * * *\nWithin present time limitations, I’m going to suggest two major point of emphasis\nwhich apply to all of us, if we want to continue to grow and expand, influence-\nwise, ih our communities.\n* * * * ********\nFirst, we’ve got to continually work toward up-grading our standards of presenta¬\ntion, to meet the demands of an increasingly discriminating, adult audience. We\nstill,to some degree, continue to suffer a sort of hangover from the earlier days\nof educational radio when we were content with relatively un-professional student-\ntype production and performance.\nWe are too often satisfied with a poor speaker as long as his subject is vital. We\ncompromise there. We know that it's important to do a series on child development,\nsay, and from a standpoint of inter-campus relations, we have to have Professor\nSo-and-So, who is the established local authority on child development."
}