{
  "id": "d208-6",
  "text": "COPY\nUNIVERSITY OF CALIFORNIA\nDEPARTMENT OF ANTHROPOLOGY\nLOS ANGELES 24, CALIFORNIA\nJuly 30, 1953\nAIR MIL\nMr* George E* Probst\nRadio Office\nUniversity of Chicago\nChicago 373 Illinois\nDear George:\nYou have asked me for advice on continuation of radio programs in\nthe field of anthropology for the coming year—while I am on safari in\nAfrica* It is not easy to know where to begin, for my two years5 ex¬\nperience has given me many feelings and attitudes that are difficult\nto summarise, but I will try to record a few impressions that seem to\nme worth passing along at this point*\nLet me say that my first lesson has been that there is no sub¬\nstitution for talent. If you are to continue—especially with the title\nto which my name is now associated—be certain to get people who have\nreal talent, especially writers and the producer,, I have worked with\nseveral writers and I Imox-r the difference it makes whether the person has\nreal ability or not* Two things are important: a sensitivity to the\nEnglish language as an instrument of communication and as a medium for\nart; and a sensitivity for culture patterns and attitudes foreign to\nthose that are his own* You will find the two go together. It makes\nfar less difference if the writer knows anything about anthropology as\na subject so long as you have a proper anthropologist to monitor that\naspect•\nThis raises a crucial question: who might replace me? The cul¬\ntural demands of modesty make me reluctant to assert any special talent\nfor myself, but I feel that certain qualities have been important in the\nsuccess of the f%ay3 of Mankind*n The first important item is that he\nknows what he wants to say. A second is that he be able to work with\nwriters. With this some rules emerge, and I feel that despite certain\nlapses I was on the whole successful. The first rule is that the an¬\nthropologist be able to command the respect of able writers. This\nmeans that he must not only have competence in his own field and Intel”\nlectual honesty, but also a measure of breadth of interest and ability.\nThe writers are justifiably suspicious of the narrow specialist who sees\nthings only through the small eye of his particular needle. One of the"
}