{
  "id": "d208-61",
  "text": "- 3 -\n8* The presence of State associations of broadcasters in most\nStates of the Union, and of specialized groups such as the Association\nof American Women in Radio and Television, the National Association of\nRadio and Television Broadcasters, calls for a maximum use of all\norganized facilities to promote highway safety*\n9* Every broadcaster will be asked to volunteer his personal\nefforts and the facilities of his station to the local organization\nconcerned with highway safety* In addition each State association will\nbe asked to volunteer its assistance to the governors of the several\nStates in the establishment of State programs concerned with highway\nsafety*\nRespectfully submitted, HAROLD E. FELLOWS, Chairman\nDaily Newspaper Committee\nThe 3ii-man committee representing the daily newspapers in the\nWhite House Conference on Highway Safety recommends to t he President of\nthe United States that the Conference:\n1* Strongly encourage the creation of a permanent organization\nor agency to cariy on its work the year around and disseminate news and\nmaterial for the information of the nation1 s daily press*\n2. Urge the nation*s daily press to enlist the press associations\nin disseminating highway safety news on a broader and more dramatic scale\nby wire and other means*\n3* Urge the newspapers to strive to improve and humanize their\nspot coverage of accidents, concentrating on the personalities of the\nindividuals involved and the effects of the accidents on the individual\nor his survivors.\nRequest the daily press to exchange ideas on the various\ndevices and methods proved successful in local and regional highway safety\ncampaigns, and that the American Newspaper Publishers* Association be\nasked to serve as the medium of distribution*\n5* Urge the daily newspapers in their State associations to move\nin concert in highway safety educational work, employing their wire asso¬\nciations within their States on highway safety problems common to them.\n6* Request the President of the United States to write a letter\nto each of the publishers and the editors-in-chief of the nation*s daily\nnewspapers asking him to enlist his personal interest and the influence\nof his newspaper in the White House Highway Safety Conference Crusade for\nSafety."
}