{
  "id": "d1090-1",
  "text": "New NAEBers\nACTIVE\nNorth Central ETV Association, Inc., KFME (TV), Fargo,\nNorth Dakota; Ogden Public Schools, KOET (TV), Ogden,\nUtah; San Mateo Junior College District, KCSM (FM) and\nKCSM-TV, San Mateo, California; University of Bridgeport,\nWPKN (FM), Bridgeport, Connecticut; University of Idaho,\nKUID (FM), Moscow.\nASSOCIATE\nFlorida Educational Television Commission, Tallahassee.\nINDIVIDUALS\nAbu Bakr Awad Sid Ahmed, Khartoum, Sudan; Robert E.\nBaum, Hoboken, New Jersey; Mrs. Percy C. Benner, Urbana,\nIllinois; Mrs. Barbara Boekemeier, New York; Duff Browne,\nAtlanta; Lawrence damage, Detroit; Betty Cope, Cleveland;\nJesus Maria Cortina, Mexico City; H. Y. Couch, Atlanta;\nJohn L. Del Mar, Barrington, Illinois; T. C. Flaherty, Chicago;\nJohn Flower, Omaha; Mrs. Elsie Fulghum, Lakeland, Florida;\nRichard Gerrero, East Lansing; William Green, Elgin, Illinois;\nKay June Herman, Kew Gardens, New York; Wendy Kaplow,\nHackensack, New Jersey; Philip G. King, New York; Merlin\nJ. Lucia, Green Bay, Wisconsin; Ronald P. McKenna, Syra¬\ncuse; L. C. Michelon. Cleveland; Charles N. Neubauer, Auburn,\nAlabama; Mary Odle, Detroit; David O’Keefe, Austin; Jack\nE. Penn, Washington; William C. Prigge, Indianapolis; Harold\nS. Salzman, Washington; Dale A. Schonmeyer, Michigan City,\nIndiana; Sister Manetta, S.C.C., Chicago; Christine Smith,\nBiloxi; Robert E. Smith, Urbana, Illinois; Mark E. Spencer,\nEnglewood, Colorado; Snitwongs Utesnand, Bloomington, In¬\ndiana; Mrs. Margaret A. Yerian, Norfolk.\nSummer Workshops\nConcordia Theological Seminary, in cooperation with Radio\nStation KFUO, St. Louis. Mass communications work¬\nshop specializing in religious broadcasting. S-day lecture-\nlaboratory workshop. Ended August 2.\nLong Island ETV Council, under contract with New York\nState Education Department. 3-week workshop at Hofstra\nUniversity, Hempstead, New York. Frank Iezzi, of\nHofstra, directed the workshop, with Stanley Handleman,\nof Brooklyn College, instructing. Consultants were:\nBernarr Cooper, chief of the bureau of mass communica¬\ntions ; Robert Hilliard, associate for TV in higher edu¬\ncation; and Worthington Gregory, associate in TV for\ncouncils.\nSt. Lazvrence Valley ETV Council, also under contract with\nNew York’s education department. Two workshops—a\n2-week one at Oswego in July, and a 3-week one at\nWatertown, ending August 9. In addition to the con¬\nsultants listed above, others at these two workshops were\nRichard Jones, director of SETCO; Socrates Sampson,\nart director WHEN-TV; Lee Campion, director of the\ndivision of educational communications for the state; and\nMrs. Grace Lacy, associate director, cultural projects.\nWMHT, Schenectady, New York. 2-week beginning course of\nintensive training in TV production techniques, in August.\nPurpose : to train high school students to continue the\n“Inquiring Youth” series, presented last fall on WMHT,\nand entirely produced by high school pupils. Plans are\nfor the training course to be offered annually.\nWENH-TV, Durham, New Hampshire, in cooperation with\nEEN and the University of New Hampshire Extension\nService. 3-day production workshop in August. Speakers\nwere: Michael Ambrosino and Virginia Biggy from EEN,\nDave Davis and Greg Harney from WGBH-TV, Gene\nGray from the 21\" Classroom, Jac Venza from CBS,\nLee Polk from WNDT, and Ned Cramer from\nWCBS-TV.\nNews Notes\nPERSONNEL\n► Robert E. Spiller, professor of English literature at the\nUniversity of Pennsylvania, has been named acting dean of the\nAnnenberg School of Communications replacing Gilbert Seldes,\nwho retired as dean last June. Seldes was the first director of\nthe school and has served as dean since May, 1959. He will\ncontinue as professor in the school.\n► The University of South Florida, Tampa, announces two\nappointments. William Brady, former program director for\nWDZ, Decatur, Illinois, has been named radio coordinator, and\nManny Lucoff, producer-director for WEDU, Tampa, is TV\ncoordinator.\n► Rudy Bretz, head of planning and development at UCLA,\nhas announced a new affiliation. He is vice president for TV\nsystems planning for the National Education Sciences Cor¬\nporation, Anaheim, California.\n► Kenneth B. Hobbs has joined the staff of Battelle Memorial\nInstitute, Columbus, Ohio. Until recently he was chief of\neducational TV and radio with NASA. At Battelle he is a\nmember of the publications-public services staff, and he will\nassist in planning and coordinating seminars and conferences\nat the institute, among other duties.\n► LeRoy Lastinger, general manager of WEDU, Tampa, spent\nthe summer lecturing at the University of Halifax. He was\ninvited by the Nova Scotia education department.\n► Ruane Hill has left Syracuse University to join the staff\nof the University of Wisconsin-Milwaukee. John Rider, for¬\nmerly with the University of Texas, will replace him as station\nmanager of WAER, Syracuse.\n► Erik Van de Bogart has been named in-school program\nproducer for WMHT, Schenectady, New York. He will work\nwith TV teachers in preparing programs for use in classes at\nall grade levels. He was formerly employed as a producer-\ndirector at the Corning ETV project. He succeeds Mrs. Bar¬\nbara Hund at WMHT.\n► WOUB-TV, Ohio University, announces new personnel:\nDuane Straub, production supervisor, formerly at WMSB,\nMichigan State University; Thomas Psinka, graphics super¬\nvisor, new graduate from Ohio University; Miss Elizabeth\nTaylor, continuity and public relations director, new graduate\nfrom the University of Wisconsin; Mrs. Cindy Smith, traffic\nand network affairs director, formerly with NET in New\nYork; and James Herron, film and tape librarian for TV\nand AV.\n► WHYY-TV, Philadelphia, announces three new appoint¬\nments. Paul Taylor, who will handle news and announcing\nassignments and also host various special programs, was. with\na Philadelphia commercial station, WRCV, for the past thirteen\nyears. Edward S. Shaw, news director of WHYY’s Wilmington\nfacility, was formerly news director of WAMS, Wilmington\ncommercial radio station. Philip G. Rebert, film director, was\npreviously connected with A1 Paul Lefton Co., a Philadelphia\nadvertising agency.\n► Key staff appointments were recently announced by WHA-\nTV, University of Wisconsin. Steve Markstrom, WHA-TV\nstaff member since the station began operation in 1954, and\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 119 Gregory Hall,\nUrbana, III. 61803. $5.00 a year, $7.50 including Washington Re¬\nport. Editor: Betty McKenzie. Phone 333-0580. Area Code 217.\nReporters:\nRegion I —Michael Ambrosino, EEN, 238 Main St., Cambridge,\nMass.\nRegion II —Shirley Ford, WUOT, University of Tennessee, Knox¬\nville.\n—Lou Peneguy, AETC, 2151 Highland Ave., Birming¬\nham, Ala.\nRegion III —McCabe Day, WVSH, School City of Huntington, Ind.\nRegion IV —Richard Vogl, KTCA-TV, 1640 Como Ave., St. Paul,\nMinn.\n2\nNEWSLETTER"
}