{
  "id": "d1090-2",
  "text": "program coordinator for the past year, has been named as¬\nsistant to the manager. Theodore Nielsen has become station\nprogram manager after serving since 1960 as producer and\nproduction manager. Karl Schmidt has been appointed special\nprojects director, in an administrative and developmental ca¬\npacity. He has been on the WHA staff since 1947.\n► Col. Robert E. Wood has been transferred to the Pentagon\nas director of ETV and film, USAF. Col. Thomas C. Cook has\nsucceeded him as director of ETV at Academic Instructors\nSchool, Air University, Maxwell AFB.\n► Victor Kerns has been named assistant director of school\nprograms for KTCA-TV, Minneapolis-St. Paul. He has been\na school and college teacher and curriculum administrator for\ntwenty-three years, and has taught junior high science subjects\non the Alabama ETV network for four years.\n► Karl Haas, director of fine arts for commercial WJR, De¬\ntroit, is representing the Ford Foundation as their consultant\nin Berlin, Germany. While in Berlin he will retain his post\nat WJR.\n► New on the staff of WTTW, Chicago, is A1 Binford, for¬\nmerly with WMVS and WMVT, Milwaukee.\n► Charles Vlcek, CCTV coordinator at Central Washington\nState College, Ellensburg, has received the NDEA New Media\nEducation fellowship to Michigan State University, for three\nyears of study leading to the doctorate degree.\n► New staffers at WMVS and WMVT, Milwaukee are:\nLarry Long, producer-director, formerly on the staff of KUON-\nTV, University of Nebraska and Bill Perrin, continuity writer\nand station announcer, formerly a Milwaukee teacher and also\non the staff of several commercial radio stations.\n► Ben A. Bohnhorst has been appointed acting vice president\nof MPATI, following the resignation of B. D. Godbold, who\nleft his post of executive vice president to become staff vice\npresident of the Graduate Research Center of the Southwest\nat Dallas. Bohnhorst has been MPATI’s director of course\ndevelopment.\n► Verne Weber, University of Michigan, has replaced Edward\nStasheff as the NAEB representative to the University Film\nProducers Association.\n► NAEB President Harley was the banquet speaker August\n19 at an ETV workshop sponsored by the state department of\npublic instruction at the University of North Carolina.\n► Mrs. Mary Ann Buddington has joined the NAEB Wash¬\nington staff as secretary to the president. She replaces Pat\nWatts, who left August 1.\nSTATE AND REGIONAL ACTIVITIES\n► Pennsylvania recently appropriated $970,000 for the de¬\npartment of public instruction to help establish and operate\nETV facilities.\nGENERAL\n► Purdue University’s WBAA has been placed under ad¬\nministrative jurisdiction of university extension. No staff\nchanges are contemplated and no immediate drastic programing\nchanges are planned—although fuller development of college-\nlevel credit courses by radio is anticipated.\n► New uses of photography and TV in education will be out¬\nlined in papers at the SMPTE technical conference in Boston\nOctober 13-18. Hartford Gunn, Jr., general manager of WGBH,\nis topic chairman for the education papers. Among those on\nthe schedule are: Michel Beilis, AT&T; Robert W. Cannaday,\nJr., Modern Language Project; Theodore Conant, Ford Founda¬\ntion; John A. Maurer, JM Developments, Inc.; Russ Morash,\nWGBH; and Alan R. Stephenson, 21\" Classroom.\n► A recent report describes the first year of pay-TV in the\nHartford project as “encouraging and enlightening.” The re¬\nport says that over 3,000 homes are being served and that\nprogram expenditures are consistent and disconnections have\nbeen low.\nNAEB Headquarters: Suite 1119, 1346 Connecticut Avenue,\nN. W„ Washington, D. C„ 20036. Phone 667-6000. Area Code 202.\n► WFSU-TV, Florida State University, has won $500 and a\ngold plaque for its “—Soon There Will Be 74” entry in the\nAmerican Federation for the Blind national competition. The\nprogram dealt with local blind residents who' have become\nsuccessful despite their sightlessness. The telecast title was\ntaken from a case history included in the program which de¬\nscribes a Tallahassee girl who will soon become the county’s\n74th blind person due to an incurable illness she contracted.\n► NAEB Industrial Associate Dage Television has become\na division of the Harvey-Wells Corporation. In a letter telling\nof the new affiliation, Dale A. Schonmeyer, regional sales man¬\nager, says it appears that 1963 and on into 1964 will be truly\nbanner years for the Dage Television operation. While Dage\nis dropping certain camera equipments from the line, he says\nthey are being dropped only in favor of “higher quality, much\nimproved equipment which is being made available to com¬\npletely replace that equipment which may be dropped. In ad¬\ndition to this we intend to supply that type of camera equipment\nwhich has been manufactured in the past to any of our cus¬\ntomers who may wish to continue expanding their present\nsystems with the previously used camera equipments.”\n► During the month of August, KUON-TV, University of\nNebraska, trained 16 Colombians and 18 U. S. citizens who will\ntake part in the Peace Corps ETV project in Colombia. Ron\nHull, KUON-TV program manager, coordinated the training\nproject, which involved three hours of Spanish, three hours of\nTV production, and three hours of film production each day\nsix days a week. The trainees will operate two TV stations\nin Bogota, with ITV programs during the day and adult pro¬\ngrams in the evening.\n► DePauw University’s WGRE recently hosted the first In¬\ndiana Collegiate Broadcasting Conference. Plans are afoot for\nanother meeting at Butler University in October. The purpose\nof the conference is to better acquaint personnel of Indiana\ncollege stations with each other, to discuss problems of common\ninterest, and to explore the possibilities for an Indiana college\nnetwork.\n► A power increase in mid-August doubled the coverage area\nof WBIQ-TV, Birmingham, according to Raymond Hurlbert,\nAlabama ETV Commission general manager.\n► In reporting on activities at radio station WNAS, Vernon\nMcKown, director of A-V education for the New Albany-Floyd\nCounty (Ind.) schools, says that for fourteen years, 22-member\nstudent staffs have been planning, writing, and producing weekly\nprograms for use in the elementary classrooms. In 1962-63,\nthese included “Junior Quiz” (science), “Our Community”\n(local history), “Spell Around,” “Magic Carpet” (stories), and\n“What Would You Do” (ethics).\n► Wanda B. Mitchell, TV department, Evanston Township\nHigh School, reports the activities there: A daily radio show\nof school news and interviews sent via direct telephone line to\nEvanston’s WEAW for broadcast. This program is written,\ndirected, produced, and engineered by high school students. On\nPTA open house nights last year, the Radio Workshop used\nCCTV monitors in the lobby to demonstrate how a radio show\nis presented, and they also distributed to parents the program\nschedule of their daily broadcasts. TV activities include fresh¬\nman orientation lessons (24 in one week) ; group counseling\nin course election; remotes from the swimming pool, auditorium,\nand gym; interviews with college representatives and a member\nof the College Entrance Examination Board; daily science\ndemonstration; interviews with school personnel; demonstra¬\ntions by Junior Red Cross and the industrial arts department;\nand instruction in every major sport. The radio studio was\nrecently outfitted with a new tape recorder, new board, and\nnew acoustical drapes.\n► WJCT, Jacksonville, gained $36,000 from an auction during\nits recent third annual fund-raising campaign. Fred Rebrnan,\ngeneral manager, said area merchants donated over a thousand\nitems including a mink stole, a 1963 Thunderbird, a pony, and\nCaribbean cruises. The most unusual donation (by the Atlantic\nCoast Line) was a 105-foot tugboat.\nSEPTEMBER 1963\n3"
}