{
  "id": "d627-10",
  "text": "KTCA-TV\nTWIN CITY AREA EDUCATIONAL TELEVISION CORPORATION\nCHANNEL 2\nMINNEAPOLIS • ST. PAUL\nMINNESOTA\nSt. Paul 8, Minnesota\nOFFICERS\nLoring M. Staples\nPresident\nJohn deLaittre\nFirst Vice President\nWendell T. Borns\nVice President\nRonald M. Hubbs\nVice President\nPhilip H. Nason\nFtce President\nGeorge D. Dayton II\nSecretary\nA. A. Heckman\nTreasurer\nTRUSTEES\nDouglas K. Baldwin\nWendell T. Burns\nJohn E. Carroll\nForrest E. Conner\nGeorge D. Dayton II\nJohn deLaittre\nMiss Adelaide M. Enright\nSamuel C. Gale\nSander D. Genis\nClemens Granskou\nA. A. Heckman\nLeonard H. Heller\nRonald M. Hubbs\nMrs. Charles Hymes\nWilliam H. Lang\nWilliam G. Law\nSamuel H. Maslon\nThomas Moore, Sr.\nGerald T. Mullin\nJohn H. Myers\nPhilip H. Nason\nWilliam L. Nunn\nRev. Walter H. Peters\nJohn S. Pillsbury, Jr.\nRufus A. Putnam\nJohn C. Savage\nJohn W. Seeger\nNeil Sherburne\nLoring M. Staples\nHarold E. Wood\nJohn C. Schwarzwalder\nGeneral Manager\nJanuary 11, I960\nMr. Harry Skornia\nExecutive Director\nNational Association of Educational\nBroadcasters\nlh Gregory Hall\nUrbana, Illinois\nTelephone\nDear Harry:\nWe are working on a research project to submit to the\nDefense Education Act. We hope to meet the February 1st\ndeadline for Title VII Proposal. This project that we\nare planning will call for the use of audio tape recordings\nand we will need to have them duplicated in rather large\nnumbers. I know that you have the equipment for making these\nduplicates for the tape network, but I don’t know whether\nor not ycu ever contract to do other recording duplication.\nIf so, I would like to get some information about your\nrates. For instance, what would the cost be to have two\nfifteen-minute tapes duplicated, each week for thirty-five\nweeks? Of course, the number of duplications would be\nimportant and I am assuming that we would need in the\nneighborhood of sixty copies of each.\nOf course all this is tentative, but we do have to have\nsome idea of where we could get tapes copied and how\nmuch it would cost for the job. Perhaps this is a much\nmore complicated question than it appears. If so, let\nme know whether or not you can contract for this kind of\nwork and, if you can, I will call and talk with you about\nit on the phone.\nOne other item I may as well enclose with this letter. Over\nthe week-end I started to draft a letter to McPherson at\nthe Department of Health, Education, and Welfare. He is\nthe Chief of the Dissemination and Services section. I\nhad contacted him earlier about dissemenation contracts and\nin his reply to me he suggested that an outline of my"
}