{
  "id": "d627-18",
  "text": "ROUGH GRAFT OF PROPOSAL\nNAEB UTILIZATION KIT PROJECT PROPOSAL\nFor the past two years, the Utilization Committee of the NAEB\nhas been discussing the development of demonstration kits of materials\nto help schools Improve their use of educational broadcasts . The\ngeneral plan is to collect materials in kit form which would then\nbe made available on short term loans from NAEB Headquarters * Con¬\nsiderable interest has been generated in both developing and using\nthese materials, but three problems seem to stand in the way: shortage\nof production funds: a person with the time to spearhead the devel¬\nopment 5 and the lack of a specific plan*\nMany good ideas have been put forward as to the type of material\nto be developed o Everyone feels that there is plenty of \"raw\nmaterial\" available, but they are not sure where it is or what\nshould be done with ito Gome of the ideas for kits are noted below:\n1* A file of sample kinescope or tape recordings of success¬\nful school programs. Along with these films or tapes,\nstudy guides, lesson plans, utilization survey results,\nand other printed material could be furnished.\n2„ Special edited \"kines* showing various aspects of school\nprograms. For instance, a 30-minute film showing short\nexamples from different school programs could be put to¬\ngether from existing material. Other \"kines\" could be\nedited to tell a story. Transitions could be made by\ninserting special commentary kinescope recorded footage.\nFilms Illustrating the strengths of television or defining\n(by illustration) what is meant by various terms such as\n\"enrichment, supplementary, and direct teaching\" • The\nlist of such special uses of kinescope programs is almost\nlimitless.\n3. Excerpts from taped r^dio broadcasts could be put together\nwith tape transition commentaries similar to above.\nhf Interviews could be put on film or tape with teachers,\nsupervisors, administrators, pupils, parents, e tc •\ntelling of their experience with educational broadcasts.\n5. Film reports illustrating findings from research. This\ncould be a documentary treatment of a complete research\nproject with emphasis on how to carry <*it a project.\n6. Capsulized dramatization on film or tape following a\nprogram Idea from conception to birth.\n7. Filmstrips or slide collections with synchronized tape\ncommentary illustrating utilization procedures and re¬\nsults. An alternate suggestion would be to supply a\nscript with the slides or filmstrip for local presenta¬\ntion."
}