{
  "id": "d627-42",
  "text": "KTCA-TV\nTWIN CITY AREA EDUCATIONAL TELEVISION CORPORATION\nCHANNEL 2\nMINNEAPOLIS • ST. PAUL\nMINNESOTA\nSt. Paul 8, Minnesota\nOFFICERS\nLoring M. Staples\nPresident\nJohn deLaittre\nFirst Vice President\nWendell T. Burns\nVice President\nRonald M. Hubbs\nVice President\nPhilip H. Nason\nVice President\nGeorge D. Dayton II\nSecretary\nA. A. Heckman\nTreasurer\nTRUSTEES\nDouglas K. Baldwin\nWendell T. Burns\nJohn E. Carroll\nForrest E. Conner\nGeorge D. Dayton II\nJohn deLaittre\nMiss Adelaide M. Enright\nSamuel C. Gale\nSander D. Genis\nClemens Granskou\nA. A. Heckman\nLeonard H. Heller\nRonald M. Hubbs\nMrs. Charles Hymes\nWilliam H. Lang\nWilliam G. Law\nSamuel H. Maslon\nThomas Moore, Sr.\nGerald T. Mullin\nJohn H. Myers\nPhilip H. Nason\nWilliam L. Nunn\nRev. Walter H. Peters\nJohn S. Pillsbury, Jr.\nRufus A. Putnam\nJohn C. Savage\nJohn W. Seeger\nNeil Sherburne\nLoring M. Staples\nHarold E. Wood\nJohn C. Schwarzwalder\nGeneral Manager\nTelephone\nMidway 5-5565\nFebruary 19, I960\nHarold Hill, Administrative Vice President, NAEB\nlit Gregory Hall\nUniversity of Illinois I960\nUrbana, Illinois\nDear Harolds\nEnclosed is a sample of the letter I am goi§g to send out\nto the various school program people around the country.\nI am also enclosing an information sheet on the project.\nI will start these letters on their way next week. If\nyou see any changes that should be made in either the\nletter or information sheet, let me know.\nI still have not had any official notification from\nSuperintendent Willis that we can use the Chicago\nmaterial. My conversations with Liz Marshall have\nindicated that it will be all right but we do need some\nofficial recognition of the project. I also have not\nheard from George Jennings, but as you saw, I have\nwritten to him also.\nLast week I sent out letters to all of the utilization\ncommittee members. I included a project outline with\nthis letter and asked for their help in locating various\nplaces where kits might be developed. It is too soon\nto have any answer from this series of letters•\nI received the information relative to the USOE contract\nproposals. Since thepe are still a few questions in my\nmind, I have placed a call to McPherson in Washington but\nhave not tracked him down yet. If there is a March 1st\ndeadline, I want to find out from him what he would like\nto have in addition to the proposal form already in his\nhand. For instance, there is no budget breakdown or\ntime table included in the original outline. I will try\nto find out what kind of supporting information he will\nneed and I will see that he gets it. If you have any\nfollow-up on the material you sent me on the 11th, drop\nit in the mail."
}