{
  "id": "d627-52",
  "text": "13* Gregory Hall\nUxt>sna, Illinois\nMarch 9, I960\nMr. Clair R. Tettewr\nDirector of School Programs\nStation KTCA-T7\nTwin City Area Educational\nTelevision Corporation\nSt. Paul 8, Minnesota\nDear Clair:\nThanks for your very canplete report on your Cincinnati trip. It looks as\nthough there msy be a good chance for us to get the utilisation kit contract\nfrom USOE. As soon as you send through the exploiter? materials Jim\nMcPherson wanted, until look them over and send them along to him.\nI m having sore HAT® stati nsuey and envelopes sent to you. They are\nprinted without address, which mates it hatter for uses such as yours.\nr\nI haven*t had a chance yet to really talk to Harcy about whether or not\nhe got to see Gale Adkins while he was there. Harey get back from\nCincinnati on Friday afternoon (he was driving and wisely didn»t start\nhere in the snow storm Thursday evening), and then left again on Monday\nafternoon for Wa^ington. I hope Gale did get there and that Harry got\nto talk to him, because I tom been very unsuccessful in getting Gale to\nanswer ny letters about law Modest file service, tho IMP utilisation\nsession, etc.\nSo far as expenses for a Utilisation committee resting in Colut&ua are\nconcerned, re have notified committee ch^r^n that re will pay the\nextr* night*s hotel bill for committee members attending conkttee\nrasetings held either the day prior to or the day following the XFJ3T.\nOf course, this is ^plicablc only if there is real need for a com*\nn&tte© meeting, and in the care of the Utilisation committee I believe\nthere certainly is such a reed. Gale knows about this, and I hope he*11\nmore on it soon.\nWe share your interest in co-operating with DOT as ranch as feasible.\nHarry has been meeting with a special top-level committee composed of\nrepresentatives of HAEB, DOT, HETflC and a couple of other organisations.\nThis group is attesting, I Ix-lieve, to outline areas f responsibility\nand working on closer co-operation among the various groups."
}