{
  "id": "d627-55",
  "text": "I. Project Titles Developing demonstration materials of class¬\nroom utilization of educational broadcasts.\nII. Problem? One of the most serious problems facing edu¬\ncators when they begin using educational broadcasts in their classrooms\nis developing utilization \"know how”. Considerable agreement has been\nreached as to the value of the teaching team approach when television\nor radio is usedo Much has been learned about the developmental and\nbroadcast end of this team* but the classroom teacher, the second and\npossibly the most important member of this team, has been left to shift\nfor herselfo Local school systems and a few other educational groups\nsuch as the National Association of Educational Broadcasters have made\nsome attempts to help the teacher develop utilization skills. Probably\nthe most serious deficiency in these utilization courses or workshops\nhas been the lack of adequate demonstration material.\nFor the past two years the Utilization Committee of the NAEB has\nbeen planning the development of kits of materials to help schools im¬\nprove or initiate the use of educational broadcasts. The general plan\nis to collect materials in kit form which would then be made available\non short term loan from NAEB Headquarters. Where materials do not now\nexist and a need is clearly indicated specific kits will be produced.\nMany good ideas have been put forward as to the type of material\nthat should be included in these kits. Preliminary investigation indi¬\ncates there is considerable \"raw material” available, but it is not in\na form which can be distributed and readily used in the field. Some\nexamples of the kits are noted below. This list is not intended to be\ncomplete but is shown to demonstrate the type of kits to be produced.\n- A file of sample kinescope or tape recordings of successful\nschool programs. Along with these films or tapes* study guides,\nlesson plans, utilization results* and other printed material\nwould be furnished.\n- Special edited \"kines\" showing various aspects of school tele¬\nvision programs. For instance a 30-minute film showing short ex¬\namples of different school programs could be put together from ex¬\nisting material. Other \"kines” could be edited to tell a story.\nTransitions could be made by inserting special commentary kine¬\nscope recorded footage. Other films could illustrate the strengths\nof television or define (by illustration) what is meant by various\nterms such as \"enrichment”, \"supplementary”, and \"direct teaching”.\nThe list of such special uses of kinescope recorded programs is\nalmost endless.\n- Excerpts from taped radio broadcasts could be put together with\ntape transition commentaries similar to above.\n- Interviews with teachers, supervisors* administrators* pupils*\nparents, etc. telling of their experience with educational broad¬\ncasts could be put on film or tape."
}