{
  "id": "d627-58",
  "text": "V\nPersonnel:\n- 5 -\nPROJECT DIRECTOR.Clair R. Tettemer\nMr. Tettemer is the Director of Research and School Programs for\nKTCA-TV, the educational television station in Minneapolis-St. Paul. He\nholds a M. A. and B. S. from The Ohio State University and has completed\nhis Ph. D. residence requirements. He has had extensive radio-television,\naudio-visual, and administrative requirements. This includes seventeen\nyears with the U. S. Army in an active and active reservist status with\nthe Army Overseas Radio Stations and the Office of the Chief of Informa¬\ntion. He also held the rank of Assistant Professor with the Department\nof Speech and Film Director with the Department of Television Develop¬\nments at Michigan State University; Educational Television Producer and\nResearch Associate with the Bureau of Educational Research at The Ohio\nState University and the Ohio School of the Air; Director of School Pro¬\ngrams with KETC and Executive Secretary of the School Administrator’s\nTelevision Committee in St. Louis, Missouri; and his present position\nwith KTCA-TV.\nAt present Mr. Tettemer is the Chairman of the Television Sub¬\ncommittee of the NAEB Utilization Committee. He has worked with teachers\nin developing classroom utilization of educational broadcasts for many\nyears. During this time he has taught utilization courses and workshops\nat The Ohio State University, the University of Kansas City and Washington\nUniversity* He has served as a consultant for the NAEB and participated\nin several of their seminars.\nCONSULTANTS ..NAEB Utilization Committee\nThe members of this Committee have been working on the develop¬\nment of this project for more than a year. They have been selected\nfor this Committee because of their interest and work with the develop¬\nment of educational broadcast utilization. They will be used indivi¬\ndually as consultants and supervisors of kit production. The Committee\nas a whole will evaluate the plans for material production as well as\nthe completed kits. The members of this Committee ares\nGALE ADKINS (Utilization Committee Chairman), Radio-TV Research,\nUniversity of Kansas, Lawrence, Kansas.\nGERTRUDE BRODERICK, Office of Education, Washington 25, D. C.\nBERNARR COOPER, Department of Speech, Florida State University,\nTallahassee, Florida.\nJAMES FELLOWS, Empire State FM School of the Air, Syracuse\nUniversity, Syracuse, New York."
}