{
  "id": "d627-62",
  "text": "—2—\nThe plans for the invitational seminar will include a great many classroom\nteachers* For this purpose the Department of Classroom Teachers of the NEA\nhas a representative on tha steering Committee. Miss Anita Ruffing, Vice\nPresident of the Department of Classroom Teachers, is working with the DAVI\ncommittee•\n3. Title VII Request\nOn February 29 a formal proposal for a Part B contract under Title VII was sent\nto the U.S. Office of Education. The proposal roughly followed the outline I\nsent you in my February letter. The time schedule was changed to conform with\nthe schedule as set forth by the Title VII office in Washington. There were\nfour phases outlined in this proposal: Exploratory, Developmental, Production,\nand Distribution.\nThe budget called for &6,5>ltO.OO to cover Phase I only. After confe» Ingwith\nDr. McPherson, Chief of Dissemination and Services of the U.S. Office of Edu¬\ncation, we decided to only budget for Phase I and then if the project is accepted\nand a contract awarded, the budget for the other phases can be developed v/hen we\nhave the results of Phase I.\nIn the meantime, however, we are going ahead to do some work of a pilot nature\non our own. If there is a Title VII contract our pilot phase will be absorbed\ninto the Title VII Phase I, Exploratory work. If a Title VII contract does not\ndevelop then our pilot projects can be used to demonstrate what could be dene to\nother potential financial sources. Let me hasten to say, we have no concrete\nleads on money at this time.\nU. Pilot Projects\nAs mentioned above we have attempted to put together some pilot kits. These\nmight be used on the NAEB Utilization Program at the IERT. Whether or not these\nkits are used on this program they will give us something specific to discuss\nwhen we meet in May. With a little luck and a lot of hard work these kits will\nbe available for distribution and use this summer. We will be able to plan our\nfuture activities better from the feedback comments on these kits.\nMarguerite Flemming and the staff of KSLH .\\n St. Louis are working on a kit\nshowing the wide range of utilization activities growing out of the NAEB tape\nnetwork distributed radio series ”Let’s Find Out*’. This kit will be either a\ncollection of slides or a filmstrip with an accompanying tape recorded narration®\nAnother kit is being planned with Elizabeth Marshall and the Chicago Public Schools.\nAll of us are familiar with the excellent job Liz has done in presenting utilization\nprograms by means of slides. Her kit will consist of slides and a tape recorded\nnarration. The third pilot is being developed here in the Minneapolis Public\nSchools’ Radio-Television division. This kit will attempt to document the various\nkinds of utilization activities coming out of a single television lesson. Teachers\nknown for their previous good utilization practice are being asked to keep a diary\nof their class activities relating to a single lesson. From these diaries four or\nfive patterns of utilization will be selected. Pictures of these activities will\nbe taken and tape recorded comments from the classroom teachers will be collected.\nThe pictures, together with sections from the kinescope recording of the program,\nthe teachers* tape recorded comments, and the narration will be woven together and\nrecorded on film by the kinescope recording process.\nAll three of these pilots suffer from a lack of coordination. They are being\ndeveloped as pilots of techniques and not necessarily a part of an integrated\nutilization package. This is a definite weakness in our approach."
}