{
  "id": "d627-7",
  "text": "14 Gregory Ball\nTJrbsna, Illinois\nTOt Gale Mkins and Glair Tetteroer\nFROMi Harold K* Hill\nDATEt October 16, 1959\nAs you both know there has been quite a bit of correspondence dealing\nwith the possibility of the RAK8 establishing some sort of utilisation\n“kit* which could be used by people fairly new in the field who need\nhelp in making the best possible use of TV, either open or closed circuit,\nfor instructional purposes. Harry has asked me to follow up an this\nproject since I have worked fairly closely with the Utilization Coemlttee\nin recent years, and this memo is addressed to the two of you since Gale\nis chairman of the Utilisation Committee and Clair is chairman of the TV\nSubcommittee on Utilisation.\nSeveral years ago, at Columbus, the committee discussed the possibility\nof asking certain stations (or people, really) to prepare kinescopes\nand/or films which could be kept in a library at HAEB Ileadquartars and\nloaned to those needing help* It was thought, you will recall, that it\nmight be possible, in some instances, to prepare special kines or clips\nshowing exactly how certain courses might best be taught — or at least\nhow one station had been successful in teaching said course. At the same\ntime the committee realised that not all stations would be in a position to\nprepare special kines, but that they might be able to put together several\nclips showing how certain subject matter had been taught at their stations,\nutilising actual sections of kines used in a given course. This might be\npresented straight, or might be done with voice-over narration which would\nexplain the procedures being followed.\nEveryone realised this would be a big job, but it was agreed that \"just\na start* would be extremely helpful — if Headquarters only accumulated\nthree or four clips a year, it would be that muoh scare help than is now\navailable to novices. Some members of the committee volunteered to pre¬\npare such materials and send them to Headquarters. However, the project\nnever actually *got off the ground* and we still have no kines.\nOne project that did get started (but has been dragging its feet somewhat)\nwas the index file that Lew Rhodes agreed to prepare. Ibis was even helped\nalong to the extent of a 1300 grant from HAEB to KU0&-TV to help defray\nthe expenses of the project* !fce latest word from Lew is that ha had it"
}