{
  "id": "d627-70",
  "text": "KTCA-TV\nTWIN CITY AREA EDUCATIONAL TELEVISION CORPORATION\nCHANNEL 2\nMINNEAPOLIS • ST. PAUL\nMINNESOTA\nSt. Paul 8, Minnesota\n_ xq-\nMarch 15, I960\n*J\\^\\'\\1‘ ' ’ Mr. Harold Hill, Administrative Vice President\n* National Association of Educational Broadcasters\nlU Gregory Hall\nUniversity of Illinois\nUrbana, Illinois\nTelephone\nMidway 5-5565\nGeorge D. Dayton II\nSecretary\nA. A. Heckman\nTreasurer\nTRUSTEES\nDouglas K. Baldwin\nWendell T. Burns\nJohn E. Carroll\nForrest E. Conner\nGeorge D. Dayton II\nJohn deLaittre\nMiss Adelaide M. Enright\nSamuel C. Gale\nSander D. Genis\nClemens Granskou\nA. A. Heckman\nLeonard H. Heller\nRonald M. Hubbs\nMrs. Charles Hymes\nWilliam H. Lang\nWilliam G. Law\nDear Harold:\nReceived the copy of your letter to Dr. McPherson this\nmorning. I think this should help keep the situation\nstraight and might stir him to some kind of activity.\nEnclosed is a copy of a substitute page 7* I hate to\ninfringe on your limited time, but I would like to have\nyou go over part IX pretty carefully. My suggestion is\nthat we have this page multilithed and send it, along\nwith a new multilithed first page, and ask Dr. McPherson\nto substitute them in the proposals we sent him. The\nchange I would make on the first page would be to make\nthe heading read as follows: \"Application to the\nCommission of Education, U. S. Office of Education,\nDepartment of Health, Education, and Welfare, for Funds\nto Support a Dissemination of Information on New Educa¬\ntional Media Project Under the Provisions of Public Law\n531, 83rd Congress\". As soon as I have your answer about\nthis first page and the new page 7 I will have them\nmultilithed and send them to you.\nSamuel H. Maslon\nThomas Moore, Sr.\nGerald T. Mullin\nJohn H. Myers\nPhilip H. Nason\nWilliam L. Nunn\nRev. Walter H. Peters\nJohn S. Pillsbury, Jr.\nRufus A. Putnam\nJohn C. Savage\nJohn W. Seeger\nI am also enclosing a copy of a memo Progress Report\non the utilization kit project. In fact I will enclose\nseveral copies so you can pass one on to the appropriate\npeople. I am sending a copy of this report to everyone\non the Utilization Committee and will send Gale several\ncopies. Also, enclosed is a Utilization Committee\nMembership list. The list is as complete as I can make\nit but in the back of my mind I seem to recall that the\nRadio Subcommittee has one additional member. Whoever\nthis is, we are not contacting them for help on the\nNeil Sherburne\nLoring M. Staples\nHarold E. Wood"
}