{
  "id": "d627-73",
  "text": "George Jennings\n-2-\nMsrch 17, 1960\nAnother orientation we should keep in mind is whether the kit\nis designed for use with teachers who have some knowledge of\nor experience with education broadcasts# Or if the teachers\nare starting from scratch*\n2* The kits may deal with either school radio broadcasts or school\ntelecasts or both. Our original Intention was to treat the field\nof utilisation without reference to radio or television, but this\nagain seemed to be too broad a slice* While most people tend to\nemphasise television utilization, radio is still very much\nalive# I note in the March NAKB Newsletter that four new edu¬\ncational FH stations were granted a C.P# in one day.\n3* As for the type of presentation, the committee felt that it\nwould be advantageous to the local user if the material was\nall in one form or another* This means that slides should\nnot intermix with film, opaques or flat pictures. However,\na series of slides, with a coordinated audio tape narration, would\ngo together and not be too complicated for use. If money is\navailable later on we might want to put the whole presentation\non film to further simplify their use*\nli* The type of presentation and the various slants that each kit\nwould take are limitless# While we canft possibly tackle\nthese ideas at once, here are some of the conroittees* sugges-\n■f 4 nno«\n- A file of sample kinescope or tape recordings of successful\nschool programs. Along with these film or tapes, study guides,\nlesson plans, utilization results, and other nrinted material\nwould be furnished*\n- Special edited \"kines\" shewing various aspects of school\ntelevision programs. For instance, a 20 or 30 minute film\nshewing short examples from different school programs could\nbe put together from existing materials# Other \"kines\" could\nbe edited to tell a story* Transitions could be made by\ninserting special commentary kinescope recorded footage.\nOther flias could Illustrate the strength of television or define\n(by illustration) what is meant by various terms such as\nnenrichment\", \"supplementary* and \"direct teachir^\".\nExcerpts fro© taped radio broadcasts could be put together\nwith tape transition commentaries similar to above.\n• Interviews with teachers, supervisors, administrators, pupils*\nparents, etc. telling of their experience with educational\nbroadcasts could be put on film or tape.\n* Fil?Jr®port8 illustrating findings from research. This\ncould be a documentary treatment of a complete research\nproject with emphasis on how to carry out a project or a\nsummary of research findings."
}