{
  "id": "d627-76",
  "text": "H. Hill\nApril lli, I960\n- 2\nOn April E>th I got a note from Elizabeth saying that she hadn’t heard\nanything new and evidentally didn’t even know that George and I had\ntalked*\nThings are clearing up a little more around here and I will be able\nto tend shop a little closer after this week. I am planning on calling\nGeorge the first of next week and if he agrees and if it seems advisable,\nI would like to f^y into Chicago Friday the 22nd to meet with George,\nLiz and possibly Wanda. If these plans do not meet with your approval,\ntry to get an answer to me before the 19th*\nI had also hoped to get to St. Louis to talk with Marguerite about\nthe kit they are developing but I could not work this into my schedule\nand had to give it up. I will also try to talk with her by phone\nnext week. I don’t have as much concern about the St. Louis kit as\nI do the Chicago one.\nAs for the rest of the contact work I said I would do, it stacks up\nlike this:\nOf the more than forty letters I wrote to people in the educational\nbroadcasting field I have answers from about sixteen. I will try to\nextract the important parts of these answers and put them in some\nuseable form for our May 3rd committee meeting. I am hoping that a\nreasonable developmental plan will result from this meeting. I would\nlike to plan on using the remainder of the consultation money to\nfollow up on some of these specific ideas coming from the correspondence.\nI had hoped to make these trips before the May 3rd meeting but my\nwork here, along with the slowness of the replies to my letters, makes\nthis impossible. I will have to do this in May and June. This will\nprobably work out better anyway since I will have the committee’s\nsuggestions to work from.\nI have been appointed to membership of the DAVI Television Committee\nand appointed as a representative to the DAVI Steering Committee to\nplan a utilization seminar. This Steering Committee is meeting May\n2nd in Columbus and I will be there to meet with them. Through my\ncontacts with these committees we should be able to correlate both\norganizations’ utilization activities.\nCordially,\n-Clair R. Tettemer\nDirector of School Programs\nCRT/gvc"
}