{
  "id": "d627-77",
  "text": "MEMO:\nAbstract of Correspondence\nTO:\nNAEB Utilization Committee\nrfceived\nWd headquarters\nFROM:\nClair R. Tettoner\nDATE:\nApril 18, 1960\nAPR 2 3 1960\nrt\nIn our Utilization Kit Development we planned to contact key people in\nthe Educational Television field to assess what material was now^available.\nwhat might be developed with a minimum of support and what needed to be produced\nwith full supporto To do this a series of letters was sent to two different\ngroups. One letter went to each committee member asking for suggestions and\ncomments. A summary of these answers was sent out March 10th0 Another letter\nwent to % people active in the fields This list was not intended to be complete\nand no -doubt some important contacts were overlooked, A list of the people\nreceiving this letter is included along with an abstract of the answers received,\nPEOPLE CONTACTED (* Received Answer)\nAIMSTEAD, Francis E., Ed, Dept,, State Ed. Bldg., Albany/ new York\nAMBROSINO, Michael J., Mgr. Sch. Pg WGBH«TV, Mass. Ave., Cambridge\nAUSMUS, Graydon, Dir, Broadcast Service, Ext. Div«, U. of Alabana\n* BENJAMIN, Mary D., U. of Texas, Austin, Texas\nBOYTER, Haskell, Dir., Radio and TV, Atlanta, Georgia\nBRISH, William M., Supt. of Scho., Hagerstown, Md.\nCHRISTIANSEN, Kenneth A., Dir. of TV, U. of Florida\nCORWELL, Marion, TV Coordinator, H. Ford Museum, Dearborn, Michigan\n* DAY, James, Gen. Mgr., KQED, Channel 9, San Francisco, California\n* DUNLOP, W. John, Dir. Children^ Pgm», Toronto, Canada\nEICKS, Jean A., Station WNYE, Brooklyn, New York\nENGAR, Keith M., Station Mgr., KUED, Channel 7, U. of Utah, Salt Lake City\nFEDDE&SEN, Donley F., Prog, Mgr., WTTW, Channel 11, Chicago 37, Illinois\n* GABLE, Martha, Dir., Radio & TV Education, Philadelphia, Pennsylvania\nGUNN, Hartford N., Gen. Mgr., WGBH-TV, 8U Massachusetts Ave0, Cambridge 39\nHETTINGER, Charles P., Supervisor, TV Education, Pittsburgh Public Schools\nHILLER, Ola B., Flint Bd. of Ed., Flint, Michigan\nHOLST, Howard D., Prog. Dir., WKNO-TV, Memphis, Tennessee\nHULL, Richard Be, Dir. of Radio and TV Broadcast ing;W)SU-TV, Columbus 21, Ohio\n* HUNTER, Armand L., Michigan State University, East Lansing, Michigan\n* HYDEN, Victor M., Jr., Ed. TV Coordinator, KVIE, Sacramento 9, California\n* KLOCK, Dorothy, StationWNIC, Brooklyn, New York\ni/Jffi, Harry, D., Toledo Public Schools, Toledo, Ohio\n* LARDIE, Kay N., Detroit Public Schools, Detroit, Michigan\nLEE, Lillian, Prog. Dir., WETV, Atlanta, Georgia\n* MACANDREW, James, Ex. Dir., Regents Ed. TV Project, New York 17, New York\n* MARKER, David W., University, Alabama\nMEANEY, John W., Dir. KUHT, U« of Houston, Houston, Texas\nMILES, Jim S., Dir., WBAA-TV Unit, Purdue University, Lafayette, Indiana\nMORRIS, James M., Dir., KOAC-TV, Corvallis, Oregon\n* MCBRIDE, Jack, Dir. of TV and KUON-TV, U. of Nebraska, Lincoln Nebraska\n* MCDOLE, ?fana B., Dir., TV., Seattle Public Schools, Seattle 9, Washington"
}