{
  "id": "d627-78",
  "text": "- 2 »\n* MCINTYRE, Charles J., Dir* of Instructional TV, U* of Illinois, Urbana, Xllo\n* MCKINNEY, Marjorie S., Cinncinnati Public Schools, Cincinnati, Ohio\nMCKELLAR, Arlene, Station WHA, Uo of Wisconsin, Madison, Wisconsin\n* NIGHBERT, Keith J., Gen. Mgr., WENH-TV, U. of New Hanpshlre, Durham, N.H.\n* NORRIS, Audrey, Hamilton County Schools, Cincinnati, Ohio\nSCANLON, Marie C., Station WBGO, Newark U, New Jersey\nSCHEIN, Donald, MohawMfudson Council of ETV, Schenectady, New York\nSCHENKKAN, Robert F., Dir* Radio - TV, U, of Texas, Austin, Texas\nSCHROPP, Clifton F., Mgr. KDPS«TV, 1800 Grand Ave., Des Moines lb, Iowa\n* SEEL, Helen, Cincinnati Public Schools, Cincinnati 2, Ohio\nSIKES, Rhea, Dir. of School Service, WQED, Pittsburgh, Pennsylvania\nSINCLAIR, Dorothy, Supervisor, TV ft Radio, Houston Schools, Houston, Texas\nSITTIG, John, Dir., A^V Edo, Bd. of Ed., Columbus, Ohio\nSPANIER, Leah, Curriculum Coor®, Brooklyn 25, New York\nSTONE, Loren B., Station Mgr., KCTS-TV, U. of Washington, Seattle 5, Wash.\n* STROBEL, Edna May, Coor. of Ed. by TV, New Orleans, Louisiana\nS’lENSON, Patricia Green, Mgr., Radio Station KBPS, Portland lit, Oregon\n* TAFF, Paul K., Station Mgr., WMVS-TV, Milwaukee 3, Wisconsin\nTRF.NHOIME, A.K., Dir. of Instructional Materials, Portland 16, Oregon\n* TYLER, Margaret C., Supervisor, Ohio School of the Air, Ohio State U., Col*, Ohio\n* WARD, James M«, U. of Colorado, Boulder, Colorado\nWIGREN, Harold, Houston Independent School District, Houston, Texas\nWILLSEA, Gerald, Dir. of Radio ft TV Activities, Denver Public Schools, Denver\n* WYNN, F,arl, Dir. of TV, U. of North Carolina, Chapel Hill, North Carolina\nABSTRACT OF CORRESPONDENCE;\nMARY D. BENJAMIN\nIndicated interest in the project and will need some time to find out what\ncan be done but will correspond further.\nJIM DAY\nThe letter was referred to Larry Smith, Director of School Broadcasting\nfor KQED. Suggested including a kinescope from the introductory conversational\nSpanish series \"Saludos Amigos*1. This series won a first place in Ohio State\nAwards in 195>9 and has been very popular with the schools in the Bay area. They\ncould furnish a kinescope from the series at the usual kinescope duplicating\nfee. Stucty guides for the series are also available in limited quantities as\nis a standard size 33 1/3 RFM recording developed for use with the program.\nA list of the program titles for the Spanish kinescope series was included.\nLarry also included an education bulletin from the Office of the Superintendent\nof Schools, San Mateo County, on utilization and instructional television.\nThis bulletin consisted basically of a three-page outline of how to select\nand use a television series. This was written by Mrs. Sally Davis, Consultant\nfor Instructional Television, Committee on Public School Telecast Service,\nSacramento, California and is titled \"A Teachers Viewpoint*1. Other than this\nmaterial, Lariy felt that with the present staff limitations they would not be\nable to undertake production of a utilization kit. However, he was most\ninterested in the future development of this project."
}