{
  "id": "d627-79",
  "text": "- 3 -\nW# JOHN DUNLOP\nReply was received from A# H# Partridge, International Exchange Officer\nfor the Canadian Broadcasting Corporation# He felt that the CBC would not be\nable to help with the project due to the fact that departments of education\ndo not consider that CBC personnel have a right to instruct teachers in utiliza¬\ntion methods # In addition to this he felt it would be difficult to make program\nmaterial available outside of Canada« He suggested that we contact Mr. W* Bruce\nAdams of the Toronto Board of Education to see if they could participate in the\nproject# A letter was subsequently addressed to Mr# Adams# As yet no reply has\nbeen received.\nMARTHA A# QABLE\nThe Philadelphia schools have a silent color film with excerpts of their\nTV programs# The film is about 60 minutes long# They are currently putting\nthis on two 30 minute reels and adding a commentary on tape to go with the\nfilm. Martha suggested that we might be able to use this film material#\nARMAND L. HUNTER\nCharles Ruffing, Program Associate fcar WMSB answered the letter# He said,\nnWe will be more than glad to aid your project, but would like to hold off with\nsomething definite, until the first part of April# Schools that are utilizing\nin-echool programs are forming an association among other things to handle\nprojects of this nature# Pm sure that by then I will have more information\nfor you#*1\nVICTOR M# HYDEN, JR.\nVic indicated he was v/riting his doctoral dissertation on the problem of\nutilization. He suggested three people in the KVIE area for us to contact#\nThese people are: Instructional Television Consultants in their area# Letters\nhave been sent to each of them# While they have very little in the way of material\nin outline form,.they have developed some procedures which have been used with thteir\nevaluation sessions, utilization meetings and classroom teacher workshops#\nThey will be sending some suggestions for kits they might develop for us in the\nnear future. Vic said, ”We would be very interested in assuming the responsi~\nbilities for a utilization kit if the cost were underwritten# I am sure at\nleast one of the three full-time field consultants would like to do this as a\nsummer project# Y/e would be most fortunate if this could be worked out because\nof the experience and insight gained by these consultants during the current\n8chool year.\"\nDOROTHY KLOCK\nDorothy said, nI have received your set of questions dealing with utiliza¬\ntion of educational broadcasts and I will send you come answers to them shortly#”\nSo far we have not received any further information#"
}