{
  "id": "d627-8",
  "text": "Gale ftjkins and Clair Tettemer, Page 2, Ootober 16, 1959\n\"reedy to go\" at the beginning of the Burner, but that during hie vacation\nseveral more questionnaires were returned cod he wanted to include them\nto mt&» the file aa complete ae possible. Unfortunately, all of tills was\ntaking place at the same tine that lew was moving from tCUOR-TV to the\nCentral ‘rHohli an EOT Council. BaturaUy, his new duties toe* a great deal\nof hie time, and we all appreciate the problems he has faoed and are\nextremely grateful far the excellent work ha has done on this project,\nmost of which has bean on a purely voluntary basis.\nRow wa haw cans to the place where it is imperative that we get the file\naervioe finallead and announce lte availability, and I believe Lew will\nhave this reedy very aeon. But, more important, baaed on the number of\ninquiries we get at Headquarters and the discussion •g^™Pr°?u0\nseminar at Perm State this past summer, we must get the \"utilisation kit\"\nproject rolling if we we going to aervioe the growing demands for help\nfrom members just entering the instructional TV field.\nI vrctl'i suggest that as many members of the Utilisation Comaittoo as are\npresent st Detroit {jet together sad finalise plans. If we get only\noansnltnents for on© or two klnes, we will be that much ahead* Clair, as\nchairman of the TV Subeosiaittee, has Indicated a willingness to ride heard\non this within the time limitations imposed by his new job. But he will\nneed the help of the entire ooGsaittee in laying plans and in getting kinea\nfrom those who are willing to help. In addition, we may want to consider\nother utilisation possibilities, such as film slide kit© which might be\nmade up by some of our members who already have prepared such materials for\nlocal us©. (As m example, you’ll both recall that Lis Marshall had a set\nof slide® at the Purdue seminar in the wmrmr of 1958 which she uses to help\nthe Chicago teachers* Maybe scissetfelng of this sort - perhaps with a booklet\nor text of some kind - could be developed so that it might be loaned to\nmembers needing such help*) Incidentally, although he is primarily concerned\nwith radio still (and is chairman of the Radio Utilisation aibconmittee),\nGeorge Johnson would be very helpful in laying plans, and I just hope that\nhe will be in Detroit so he can meet with us. I presume that Lew Rhodes will\nbe there, too*\nIncidentally, more as a progress report than minor\nprojectshave gotten rolling as a result of the HAEB Fern State seminar\non instructional TT production this past summer* First, ttere was quite\na bit of discussion about what a shame it was that so many graphics (on\nwhich much tins and effort had been spent) had to be discarded by stations\n(largely due to storage problems) after they had been used on a given series*\nSpecial reference was made to picture graphics* It was therefore suggested\nthat, those who had such pictures which they would discard should instead send\nthem to Headquarters where a catalog of sorts would be prepared and distributed\nso that those needing pictures could write in and borrow thorn. So far I have\nreceived pictures from only about three people, but have promise of more,\nmie this is not truly a \"utiUsmUon* project, it is to some degree ami, I\nbelieve, should be encouraged by the Utilisation OanlttM*"
}