{
  "id": "d627-81",
  "text": "- 5 -\nresearch and projects is frequently* requested by workshop participants and would\nbe most helpful. I believe that materials included in such a kit should be of\na general, rather than of a specific, nature due to -the problems peculiar to\nvarious locales.” In answering my specific question Dave indicated that they\ncould offer teachers guides and could prepare demonstration kinescopes of conplete\nschool broadcasts or selected portions for kit distribution* He felt they would\nbe able to undertake production of a specific utilization kit if the cost were\nunderwritten. Two names were forwarded to be contacted and letters have gone\nout to these people. In conclusion, he said, ”this is a very significant and\nchallenging project ifaich should provide a real service to educational broad®\ncasting. The value of in-school broadcasting is measured by utilization. The\nnebula of our joint experience needs to be crystalized into a useful tool.”\nJACK MCBRTDE\nRobert W. Fox, Producer for In-School Television for KUON, answered for\nJack. Sob said, ,!TTe at KDCH-Tv have been wanting to do something like this for\nsome time now, but we have sane different motivations for our project. However,\nafter thinking about your needs, I am of the opinion that there would be a\nstrong possibility of its fitting right into your ideas.\n”Let me tell you what we have done. We have put together a series of all of\nour live in-school studio presentations. We have included geometry, American\nhistory, senior English, art and elementary science. This series, approximately\nIS minutes in length, gives you a birds-eye view of two broad aspects - tele®\nvision teaching and the incorporation of audio visual techniqies into teaching\nby television. Each segment has a minimum time of eight minutes and a maximum\ntime of 13 minutes. In all of our segments we have attempted to use all of the\ndevices that television teachers can use in order to make their presentations\nmore effective. This is not a doctcred-up series but our in-school program\nuses some or all of these techniques in a regular broadcast day.”\n/\nI wrote to Bob asking if the material he had mentioned could be sent for\npreview and he called me to tell me he was sending the presentation. I under®\nstand that I can keep this until after our May 3 meeting and I will bring it to\nColumbus for the committee's preview.\nWANA MCDOLE\nWith her reply, Wana sent soms mimeographed material that they use in their\nutilization program. She said, nWe feel as you do ® that good utilization by\nthe classroom teacher is the key to successful educational television.” The\nmaterial that she sent included a story-board type plan of a fifteen minute\nkinescope with suggestions for classroom teachers and the utilization of tele¬\nvision programs. This proposed kinescope is planned to be used by building\nstaffs and followed by group discussion. Another item that she sent was a sheet\ntitled Suggestions for Utilization of Television in the Classroom. This is an\noutline far the teacher pointing up the specific utilization steps of pre-planning,\nmotivation, preparation, viewing, follow-up, and evaluation. A third item was\ncalled When You're On TV and is designed to give the teacher who is going to\nappear on tV some help in choosing what to wear, how to organize materials, using\nvisual aides etc. A fourth item was a three-page bulletin called Tuning Your TV Set"
}