{
  "id": "d627-82",
  "text": "- 6 -\nand it dealt with the problems of classroom reception and how to use TV in the\nclassroom with a few suggestions on selecting a TV set for classroom use. A\nfifth item was a mimeographed bulletin entitled Facts About Television. I will\nbring all of these items to the Columbus meeting.\nCHARIES J. MCINTYRE\nMac said, BI think that probably such kits Y»uld prove very useful. We\nhave had several local people who now, after almost a year in TV, wish they\ncould transmit some of their know-how to their colleagues.\n\"As you know, we are just really getting under way and do not have much\nof a background in either materials or experience. We regret, but do not think\nwe can help much at this time.1*\nMARJORIE MCKINNEY\nMarjorie and Helen Seel sent a joint reply to my letter. They said they\nwere very interested in the NAF,B*s attempt to get materials together. They\nsaid, \"I really do believe that the success or failure of educational TV will\ndepend on how well the telecasts are utilised hy classroom teachers. This is\nan area to which we have given considerable attention but thus far have little\ntangible to submit for a kit.\" They felt that if money could be made available\nto finance the recording of programs, they would be able to participate. Several\npages from their TV Handbook, which gave suggestions on utilization, were enclosed.\nThese refer more or less to mechanics and they would like to see this project\ndevelop materials which go much beyond the type of suggestion they would be\nable to make. In a follow-up letter they emphasized the need to have the material\nthoroughly documented. They have had some difficulty in showing sane parts of\nseries out of context and felt we should be very careful to insure that the\ngroup viewing the program knew the purpose and any special conditions for the\nuse of the program.\nKEITH J. NIGHBERT\nKeith said, \"Your letter about the NAEB Utilization Committee arrived by\ncoincidence. I was about to write to you for the information that you sent in\nyour letter. The Northeastern In-School Television Conference elected me\n(Nighbert) to prepare a Title VII proposal for a teacher utilization project.\"\nKeith went on to say that they did not have at present any materials available\nfor kits but they could supply study guides at cost to the project. He felt\nthat if they were able to procure funds for an* in-school director, they would\nbe happy to produce a utilization kit but felt that any project should be based\non real study of what the kit was intended to do. He suggested contacting two\nother people and letters have gene off to them. He made some suggestions to\nour project plans based on what they plan to do in their Northeastern project0\nHe felt that we should limit the project. It seemed to him that we were really\ntackling a dozen major ideas at once. He felt that our first concern should be\nto provide a strong guide for the teacher to help her correctly and fully\nutilize in-school programs. This might be done by using a kine or tape to\ndemonstrate pre-telecast procedure, use of study guide, and post-telecast\nprocedure."
}