{
  "id": "d627-83",
  "text": "- 7 -\nAUDREY NORRIS\nAudrey said she would be very happy to work with us in developing some of\nthe utilization kits. She particularly was interested in material which could\nbe used to get to John Q. Public. She sent samples of the material they use in\ntheir utilization work. One of these was a booklet called Stand By, You1 re On\nThe Air. Since she sent several copies of this, I will enclosed one with this\nreport. Other kinds of information which she felt should be included in the\nutilization kit was a series of leaflets entitled Discriminate Use of the Mass\nMedia of Communication. This is for teachers, administrators and parents.\nI gather these are materials that they have developed in the Cincinnati area.\nAudrey also offered to expand the notes she has used in several talks on this\nsubject. She said she would be able to undertake production of a utilization\nkit if the cost were underwritten. In a second letter, she detailed the things\nthat are available from her office. She has a film produced in cooperation with\nthe Ohio Bell Telephone Co. which actually tells the story of station WCET.\nShe feels that part of this film would be useful for a project. She has sent\nme a print of the film and I will bring it to the Columbus meeting.\nEDNA MAY STROBEL\nEdna May had this to say: “The idea of information kits to help local\ngroups develop utilization of educational broadcasts sounds exciting. To\nsay there is need for this material is the educational television understatement\nof I960. At present. New Orleans has nothing to contribute to this project.\nIt is unfortunate that a 30-minute program TV Classroom Report , which the\nNew Orleans Public Schools did live last May, was not taped or kinescoped.\nThis type of program is just the thing you need.\" I wrote a second letter to\nEdna May to see if we would be able to get an outline or run-down sheet on this\ntelevision Classroom Report. This might be something that would be worth\nhaving re-produced and recorded on kinescope for our kit file.\nPAUL K. TAFF\nPaul*s letter was answered by Otto Schlaak, Coordinator for Instructional\nTelevision. Otto said that at present they do not have any materials available\nfor a utilization kit nor are they in a position to take part in any specific\nproduction of such kits. However, they like the idea and this project is one\nthat should be developed soon. He suggested \"A good boil-down of results of\nresearch into effectiveness of TV as a teaching device in each area; 1) enrichment,\n2) supplementary/and 3) direct teaching. This could be documented by statements\nfrom superintendents, supervisors, etc., laying it onethe line that this medium\ndoes work effectively.......I (Otto) pulled together some\nthings on this for a meeting of superintendents last month. Hie evidence\nproperly presented can be very formidable. Nothing convinces educators quite\nas well as other educators reporting scientific studies.\" He ended up by asking\nif we would have any of the materials ready for summer workshops this year. In\na second letter from Otto, he indicated that they have two examples of instructional\ntelevision programs which could be made available for our sample kinescope file.\nHe enclosed a brochure on these two series and I will have these in Columbus.\nOne is on the slide rule; the other is on basic math. While they are used in\nMilwaukee for adult education, they still might have some value in their\nrelation to classroom utilization."
}