{
  "id": "d627-9",
  "text": "Gale Adkins and Clair Tet tamer, Page 3, October l&t 1959\nThe second item from the seminar* I realised that many of our numbers\nhad conducted all sorts of experiments in instructional TV and had some\nidea of what would work, how best to treat a given subject, etc. Tills\nrealisation was a result of the large number of booklets, reports, etc,,\nwhich some of the participants brought along to distribute to fellow\n\"a^iiMorlana.* Therefore, after the meeting, X circulated a memo to the\nmembership suggesting that those with booklets which they were willing\nto send free to anyone requesting that they send a sample of each to\nHeadquarters, will prepare a bibliography and circulate it to the\nmembership so that they will know where to write for copies of reports\nthat may help thorn with some of their own problems. This may save a\nlot of trial and error cm the part of the novices, because they can learn\nfrom what otters have dene, TMs project is just getting started, but so\nfar we have received perhaps a dozen booklets from three or four sources.\nThen, of course, the seminar discussed the need for services like the\nfile service and the kites X have talked about above, Actually, X think\nwe wist not weary about trying to start with kites on every subject* I\nhave a hunch that that may be what has bogged us down to date — we have\nbeen a little too mbitious, and thus awed at the magnitude of the task\nfacing us ~ we have felt that we should have a great number of kines and\nclips right off the bat in order to meet the demand. However, X feel\nthat we should try to get started, even if we have only one clip the first\nyear - one is better than note* And this is the reasoning we have\napplied to the two other projects X have mentioned above. Vie say net have\na file of 10,000 picture graphics, mad we certainly won’t cover all possible\nsubject areas, but we can meet the needs of sgme. and this is better than\nnot being able to meet tte needs of AnOBe same thing is true of\ntbs booklets and reports — even if we can list only 25 in the bibliography,\nthat will be something, and if we help only two or three members with a\nspecific problem through this method, it will be far better than not\nhelping them at all,\nAnd that's the way X think we should approach the kites and clips idea.\nIf we get ote cap two, they will meet someone's need and at least that much\nservice will have been rendered. And“we canr£ ever build up any of these\nservices without starting, evm if the start is small.\nSo, I hop© we can get together in Detroit — at least those members of the\ncommittee who are there. And my whole purpose in this memo was to suggest\nsuch a meeting and also try to susaasriae some of the steps and thinking of\nthe past fbw years. See you in Detroit.\nCordially,\nms/&p\ncot H. J, Skomia\nHarold S, Hill\nAssociate Director"
}