{
  "id": "d627-94",
  "text": "KTCA-TV\n” TWIN CITY AREA EDUCATIONAL TELEVISION CORPORATION\nCHANNEL 2\nMINNEAPOLIS • ST. PAUL\nMINNESOTA\nSt. Paul 8, Minnesota\nOFFICERS\nLoring M. Staples\nPresident\nJohn deLaittre\nFirst Vice President\nWendell T. Burns\nVice President\nRonald M. Hubbs\nVice President\nPhilip H. Nason\nVice President\nGeorge D. Dayton II\nSecretary\nA. A. Heckman\nTreasurer\nTRUSTEES\nDouglas K. Baldwin\nWendell T. Burns\nJohn E. Carroll\nForrest E. Conner\nGeorge D. Dayton II\nJohn deLaittre\nMiss Adelaide M. Enrich-\nSamuel C. Gale\nSander D. Genis\nClemens Granskou\nA. A. Heckman\nLeonard H. Heller\nRonald M. Hubbs\nMrs. Charles Hymes\nWilliam H. Lang\nWilliam G. Law\nSamuel H. Maslon\nThomas Moore, Sr.\nGerald T. Mullin\nJohn H. Myers\nPhilip H. Nason\nWilliam L. Nunn\nRev. Walter H. Peters\nJohn S. Pillsbury, Jr.\nRufus A. Putnam\nJohn C. Savage\nJohn W. Seeger\nNeil Sherburne\nLoring M. Staples\nHarold E. Wood\nJohn C. Schwarzwalder\nGeneral Manager\nTelephone\nMidway 5-5565\nJune 10, I960\nMr. Harold E. Hill, Vice President\nNational Association of Educational\nBroadcasters\n111 Gregory Hall\nUrbana, Illinois\nM JWHIWO\ni\nDear Harold:\nThanks for the counting in your June 3 letter. Actually,\nthe difficulty is going to be with the July 1 deadline. I have\nasked Arnold Thorson, our Office Manager, to get together the\nlist of calls and other items that are related to this project\nand as soon as that is ready I will send it to you for payment.\nIt certainly should be there before the first of July. On the\nother hand, I have several projected trips dealing with these\npilot kits but cannot make these until later in the summer. This\nis unfortunate and may mean that we will have to cancel these\nplanned trips. I would like to make an alternate suggestion and\nyou can certainly decide whether this is possible or advisable.\nShould you end up with some money in this grant that you want to\napply to the project, we could send you a bill for consultant's\nservice in almost any amount you say. If this could be paid in\nadvance we would hold it as a balance here which could be applied\ntowards future work which you would approve towards the development\nof the pilots•\nIt seems almost inexcusable to not use this money. There\nare so many things that need to be done and certainly not the\nleast of which is more work on this utilization project. If\nwe could get an extension on the use of this money then I feel\nsure it would be put to good use.\nI will be in Washington from June 19 to July 1. I expect\nto spend some time with the people in the U. S. Office and will\ntry to develop some information on our project. The under-cover\ngrape vine has indicated we are due for financing of Phase I of\nour proposal but since I have not heard from you, I gather that\nthere has been no official word.\nCordial\nlair R. Tettemer\nDirector of School Programs\nCRT: gvc"
}