{
  "id": "d627-96",
  "text": "Harold Hill\n- 2 -\nAugust 11, I960\nFor instance, I am going to send out the letters requesting kit production\nproposals before hearing from the U.S* Office* I will use the NAEB funds\nI now have to cover this and if we can reclaim any of this from the govern¬\nment grant we will*\nSecond, the money will be used primarily to complete the pilot kit\nphase. I am planning on going to St. Louis next weekend to work with\nMarguerite Flemming and Gertrude Hoffstein to finish the St. Louis pilot*\nThen after school starts in September I will spend a day or two in Chicago\ntrying to get their kit put together* The third kit, the one here in the\nTwin Cities, will be re-planned* The program example, selected by the\nMinneapolis school system, is all wrong and we might just as well start\nfrom scratch*\nA third use for the money will be to do some of the extra of pre¬\nliminary coordination for the grant. For instance, it may be necessary\nto go to Washington in order to work out the terms of the contract*\nI will only do this if it cannot be handled any other way.\nIncidentally, in a recent letter from Harry he asked which com¬\nmittees would like to make reports at the October meeting. I don’t\nknow what plans Gale has for the Utilization Committee and I am not\nplanning anything specific from the Television Sub-committee, but would\nlike to make a report as Project Director for this utilization kit pro¬\nject* This brings up another question. Would it be possible to get an\narticle in the Journal about the plans for these kits? I would like to\nuse it as a means of making a report to the entire membership* It is\nlikely that this could not be made prior to the convention but might be\nincluded in the convention issue. I want to be sure, however, that we\nknow we are going ahead with the project before announcing it. I have\nreceived dozens of requests for use of our material which grew out of the\noriginal information seeking letters. I can imagine what might happen\nfrom an article in the Journal* Let me know if such an article can be\nincluded and, if so, when would be the best time?\nSincerely,\n,Glair R. Tettemer\nDirector of School\nPrograms & Research\nCRT/gvc\nEnel*\nc/c Harry Skornia"
}