{
  "id": "d627-98",
  "text": "**m 2\nthe timid of School Broadcast utilisation. From their answers\ntoe following generalisations wars made.\na) Vary little material dealing with classroom utilisation\nof educational broadcasts exists*\nb) There Is a great need for special utilisation materials,\nparticularly demonstration of educational broadcasts and\ntheir utilisation* The proposal for this service was\nenthusiastically received* Many replies sere accompanied\nby requests for use of the first kits to be completed.\nc) There arc many competent people available to develop inform¬\nation or demonstration material kite. Some of these people\nhave worked extensively in the utilisation field.\nd) Very fee people indicated that they had or could get funds\nto develop their Ideas.\ne) Several organisations other than the MAKB are interested\nin the field of utilisation. (These organisations sere\ncontacted. The results from these contacts is listed in\n3 beloe.)\nf) One or more pilot kits should be developed as an example\nof the service to be offered. (See 2 beloe)\ng) The material having the most immediate need eas a library\nof examples of outstanding school programs* These should\nbe gathered from all over toe country and mould demonstrate\nserious kinds of programs as well as various types of\nutilisation patterns*\n2. Three pilot kits are in development at the present time. One\nof these, a kit showing classroom activities relating to the\nradio series \"Let1® Find Out\", is being developed by the staff\nof %$XB in St* Louis, Missouri* The kit la approximately 8$f\ncompleted* It mill consist of i\n— a set of 2x2 color slides\n— audio tape commentary to accompany slides\n— presentation outline for discussion leader\n—* printed material for distribution, such ast etudy guides, utili¬\nsation suggestions and series information sheets*\nOther pilot kits are being prepared by toe Chicago Public Schools\nand the Minneapolis Public Schools. Preliminary versions of\nthese three kits were demonstrated to a group composed largely\nof classroom teachers at the Institute fear Education by Badlo\nand Tslevision in Columbia, Ohio last May* The group viewing\nthe pilots gave their reactions with suggestions for these\nspecific kits as well as toe completion of the project* ill of\ntheir comments were favorable and many people expressed their"
}