{
  "id": "d1592-0",
  "text": "Offloe of.Executive Secretary\nUrbana, Illinois\nSepto15, 1939\nINGHAM TQ HEAD NA3SB\nProf 0 Harold Go Ingham* KFKU9 University of Kansas* Lawrence, Kansas,\nwas elected president of IfAEB at th© closing session of the convention\nwhich was held September 1 and 2 at Ames, Iowa* The ©lection of officers\n^01 imaged a fine convention on the campus of Iowa State Col-lege*\nUpon recommendation of the nominating committee composed of Jos* F*\nfright, Station WILL, Wo lo Griffith, Station WOX, and M» R. White,\nStation KWSC, the following officers were elected for the coming year:\nPresident—Professor Harold. G* Ingham, KFKU, Lawrence, Kansas; Vice«\nPresident—Mo Ho White, KWSC, Pullman, Washington; Treasurer—-Professor\nWo I® Griffith, WOI, Ames, Iowa0\nMembers of the Assoc lotion Executive Coismittee ares Carl Menzer, VSUI,\nIowa City, Iowa; Me S* Novik, Municipal Broadcasting System, Hew York\nCity; Harold Engel, WHA, Madison, Wisconsin; Homer Heck, WNAD,. Norman,\nOklahoma; Mo C* Jensen, WCAL, Northfleld, Minnesota; Luka L» Roberts,\nKOAC9 Gotval1is, Oregon0\nOPENING SESSION\nGetting back to the opening of th© convention, your secretary reports\nWo I« Griffith, WOI, presiding* An address of welcome was made for\nIowa State by Dean Harold V. Gaskill9 Dean of Science Division in the\nabsence of President Friley«, President Carl Menzer responded for NAEB*\nThen came th© talk by Harold Kent«\nWHAT CHICAGO RADIO COUNCIL IS DOING\nHarold WQ .Kent, Director of the Chicago Radio Council of the Chicago\nPublic Schools, had a real story to tell about what is being done in\nChicago* The text of his talk follows?\n** Ladle© and gentlemen, the topic for discussion this morning is, ’What\nthe Chicago Public Schools are Doing in Radio in Education,, * Before 1\nenter into that, 1 should, perhaps, for a general, better understanding;,\nexplain in th® simplest fashion possible, the philosophy underlying\nthe various types of educational broadcasting*\nI need to dwell upon the differences between th© basic\n;en@4>3 oi network broadcasting to schools, and those which govern the\nproduction and presentation of programs on local stations; but there\nhave bean two rather widely differentiated schools of thought growing\nup about the question of how to use radio In education* These two\nschools of thought are firsT, that group of people who maintain that"
}