{
  "id": "d1592-10",
  "text": "SATURDAY AFTERNOON\nParticipants\nWilliam Bearup, Overseas Representative in London, Australian Broadcasting Commission\nFranklin Dunham, Chief of Radio Service, United States Office of Education\nBetty Thomas Girling, Station KUOM, University of Minnesota\nMajor James Grimman, Director of Audio-Visual Aids, Ontario Department of Education\nHarold Kent, Director, Chicago Radio Council—WBEZ\nWilliam Levenson, Directing Supervisor of Radio, Cleveland Board of Education\nJames Macandrew, Coordinator of Programs, Station WNYE, New York City\nRuth Weir Miller, Radio Assistant, Philadelphia Public Schools\nMargaret Carey Tyler, Supervisor, Ohio School of the Air, Station WOSU, Ohio State\nUniversity\nProfessional Training for Radio\n(Program for Both Sessions)\n2:00 p. m.. Room 1440, Deshler\nChairman, Armand L. Hunter, Chairman, Department of Radio, Northwestern\nUniversity; and Director, Northwestern University-NBC Summer Institute\nThe Place and Need for Professional Training for Radio in Colleges and Universities\nGerald Bartell, Production Manager, Station WHA, University of Wisconsin\nKenneth G. Bartlett, Director, Radio Workshop, Syracuse University; and Chairman,\nFREC Committee on Standards for College Courses in Radio\nLyman Bryson, Director of Education, Columbia Broadcasting System\nJoseph Callaway, In Charge of Radio Education, Michigan State College\nVirgil Hicks, Program Director, Station KTSM, El Paso\nKarl Koerper, Vice-President, Station KMBC, Kansas City, Missouri\nJennings Pierce, Director of Public Service, Western Division, National Broadcasting Company\nLuke L. Roberts, Education Director, Station KOIN, Portland\nJudith Waller, Director of Public Service, Central Division, National Broadcasting Company\nThe Reverend R. C. Williams, S.J., Creighton University, Omaha\nSPECIAL SESSION\nOrigination of \"Our Foreign Policy\"\n5:50-6:30 p. m.. Ballroom, Deshler\n(Doors Closed at 5:55 p. m.)\nMembers of the Institute are invited to attend the origination of the regular weekly series, Our\nForeign Policy, broadcast over the National Broadcasting Company, 6:00-6:30 p. m., EST.\nPresiding, Jennings Pierce, Director of Public Service, Western Division, National\nBroadcasting Company\nInternational Information Policies\nParticipants\nBenjamin Cohen (Chile), Assistant Secretary-General In Charge of Infor¬\nmation, U-N\nSterling Fisher, Assistant Public Service Counselor and Director of the United\nNations Project, National Broadcasting Company\nFrancis Russell, Director, Office of Public Affairs, United States Department\nof State\nWilliam T. Stone, Director, Office of International Information, United States\nDepartment of State"
}