{
  "id": "d1592-10",
  "text": "NAEB NEWS LETTER* *•.Sept* 15, 1939 Pag® 11\nprograms, and the right arrangements for broadcasting of such program^®\nwould bring ample financial support from our enlightened philanthropists\nand from many organizations that have long bean anxious to promote\ngenuine adult education.\" Well® 1 think that anyone of you here who\nhas been responsible for the operation of an educational radio station®\ndevoted primarily to the furthering of adult education® and giving all\nof your time and thought to broadcasting the best educational programs\nwhich you can build, have not found many philanthropists or organizations\nsitting around on your doorsteps with out-stretched hands offering you\nthe thousands of dollars which you know you need to do the job you are\naware should be done* It just doesn’t work that way* Even the\nRockefeller Foundation which has been interested In radio® financing\nfellowships and councils, has not been willing to continue its support\nindefinitely. They believe® for instance® in launching a project and\nsetting it on its feet® but at the end of a number of years® feel that\nthat organization or council should be self-supporting, so® X do not\nagree with Mr., Yarros trat this is the answer® and that if he or hi®\nfellow educators were mi lling an educational station® thejr would have\nany more luck financing it than Joe wright or Harold McCarty or anyone\nof you* Take, as an examle, the case of the contribution to the\nUniversity of Chicago of 138,000 by the Sloan Fund for the purpose of\nstimulating and vitalizing the Hound Table. This money did enable\nthe University to pay the participants® to transcribe and reprint the\ndiscussions® send out more publicity on the program, but has it made\nthe Hound Table any better? The Crossley rating does not show that\nit has® and® Mr* Yarros® only educatox^s are responsible for that\nprogram - it is mm by a University and not by commercial broadcasters*\nFrankly® I think if it were, it might be better - I don’t know® I just\nsay® I think it might*\n\"When all is said and done® i radio station must be financially sound\nbefore it can continue to operate indefinitely and must broadcast\nprograms acceptable to the lit tener bofox*© it can become permanent\nenough to be financially sound * One goes around in the well-known\nvicious circle*\n\"It is not easy to build, hour after hour, exceptionally good educational\nprograms* Programs of real quality, quality is difficult to achieve\nand when one is faced with ten® twelve, fifteen hours daily, week in\nand week out® it is easy to understand how one can become lax and think\nthat anything might do/ Then, too® I have heard some educational\nbroadcasters brag about the number of programs which they have had on\nthe air oser a given period of time* Is that anything to brag about®\nrather wouldn’t it be better to b\\*ag about the quality of programs, and\ntheir audience appeal? Fewer programs exceptionally well planned with\nreal established following, mean more than twice as many mediocre in\nquality* Nothing 1© harder than tv take material that in itself does\nnot have an audience appeal and fr\\m that make an interesting radio\nprogram * we all have that problem to contend with* We have been, we\nthink® making some headway toward hotter programs® but often we stop\nand ask ourselves why w© think them! should be so many educational or\npublic service shows* Are we sure Lhat the public is clamoring for\nthem? I® for on©, am not* How doea Mr* Yarros or any educator know\nwhat the public wants - the general public? How does he know that\nthey are not satisfied with the infinite amount they ax*e already\nreceiving? X am speaking, of course® of the general public, not"
}