{
  "id": "d1592-12",
  "text": "M&38B News Letter3...Sept. 15, 1939 Pag© 13\nthe person delivering it will be able to do a better job with it,\nthan if it is dull® Granted even that the material comes from the\nperson doing the broadcasting, it might need going over* vory often\nwould; in fact, I might say* almost always would.\n\\ word or two More ©bout this radio course. There is a vital need\nin this country for a school where real radio training may be had -\nmaybe one such school* maybe two* not more* The faculty teaching in\nsuch a school would have to comprise seasoned radio people ©quipped\nto turn out continuity writers,“\"production men, announcers and actor©\ncapable of being taken over by small stations for intensive apprentice^\nship, looking to radio as their life work. This is not what I have\nin mind as a radio course at the college or university which owns my\nradio station. At present the radio inudstry cannot absorb all of\nthe people who are clamoring for admittance^ therefore, it is not\nfair to give students who would enroll in such a course the idea that\na job is awaiting him or her immediately upon graduation. But if the\nstudent enrolls with the understanding that it is more in the nature\nof an appreciation course than anything els© and that the chances of\na life career arc* slim, a course such as I have in mind would be\nextremely beneficial. Those who showed outstanding aptitude along\nradio lines, might be encouraged to go farther, and all could be\ngiven experience at the University station. Should the members of\nmy advisory council be interested in enrolling, the knowledge which\nthey would gain would b© of tremendous us© in the planning of the\ncommunity program in which they wore interested, a© student and the\nlay member would both gain an appreciation of radio and its many\nproblems, which should be helpful in many ways®\n\"There is still another suggestion. 1 would most definitely consider\nthe question of an educational network not only within the stab©\nitself, but between states within a certain radius. I realize that\nline costs are a serious problem, but with a pooling of resource© and\nthe availability of a program exchange, thereby cutting program costa,\nit does not seem to be out of the rang® of possibility. By tying\ntogether a number of educational Institutions, the radio director\nwould have a much larger faculty to draw upon, specialists in many\nmore fields with the decided advantage of being able to pick and choose\nin the interest of quality,\n”1 can envisage an affiliation between both educational and commercial\nstations within a state to the advantage of all concerned, where the\nprime objective would be better public service programs for the whole\nstate through adequate coverage.\n\"These are not new ideas, they have been set forth before, by members\nof your own association, but X believe in them and aa sure they would\nbe given almost my first consideration, should X be faced with this\nvery difficult job of running an educational broadcasting station.\n\"These things are not impossible of accomplishment. Many of them are\nundoubtedly being attempted by those of you who are now running\neducational radio stations. Frankly, X have heard so few programs\nfrom suoh stations, that X feel totally inadequate to make suggestions\nor criticisms. Often though I have the feeling that the majority of\nnon-commercial stations spend a great deal of their time merely"
}