{
  "id": "d1592-15",
  "text": "SUNDAY MORNING\nWORK-STUDY GROUPS, Second Session\nAll Groups Meet from 9:00-11:30 a. m., unless otherwise noted\nAgricultural Broadcasts\n9:00 a. m.. Junior Ballroom, Neil House\nChairman, John C. Baker, Chief of Radio Service, United States Department of\nAgriculture; Secretary, Herb Plambeck, President, National Association of Radio\nFarm Directors\nMarket Reports\nJames Chapman, Farm Program Director, Station WTAM, Cleveland\nE. J. Rowell, United States Department of Agriculture\nRecording Equipment\nDon Lerch, Farm Program Director, Station WEAF, New York\nJohn McDonald, Information Specialist, Farm Security Administration\nChris Mack, Farm Program Director, Station WNAX, Yankton\nJohn Ryan, Extension Editor, South Dakota State College\nHal Totten, Farm Program Director, Station WGN, Chicago\nSmall Stations and Amateur Speakers\nFloyd E. Carlson, Extension Forester, New York State College of Forestry, Syracuse\nC. M. East, County Agent, New Albany, Indiana\nDarwin Kindler, Manager, South-Central Rural Electric Cooperative, Lancaster, Ohio\nJ. O. Martin, Information Specialist, Farm Security Administration, Indianapolis\nNews and How To Do It\nChanning Cope, Farm Program Director, Station WAGA, Atlanta\nDick Hull, Program Manager, Station WOI, Iowa State College\nTed Mangner, Farm Program Director, Station KMOX, St. Louis\nHenry Schacht, Farm Program Director, Station KPO, San Francisco\nRadio Has Failed the Farmer\nC. Maurice Wieting, Special Assistant, National Council of Farmer Cooperatives, Discussion\nLeader\nChildren's Programs\n9:00 a. m.. Parlors A, B, C, Deshler\nChairman, Josette Frank, Educational Associate for Children’s Books and Radio,\nChild Study Association of America\nTopic, Local Programs—New and Experimental\nStory Telling. Helen Straus, Educational Director, Station WMCA, New York City\nYouth Forums. Dorothy Gordon, Moderator of Youth Forums, The New Yor\\ Times\nTeen-Age Programs. Eugene King, Station WOR, New York\nTelevision. Dorothy McFadden, Junior Programs, Inc.\nRecordings. Gloria Chandler, Radio Consultant, Association of Junior Leagues of America,\nInc.\nUniversity Workshop. Betty Girling, Director, Minnesota School of the Air, Station KUOM,\nUniversity of Minnesota\nJunior Newscasts; Nature Programs; Music; Reading the Comics; Books Dramatized; In-School\nPrograms. Discussants to be announced\nSummary, Dorothy Lewis, Coordinator of Listener Activities, National Association\nof Broadcasters"
}