{
  "id": "d1592-2",
  "text": "CONFERENCE NOTES\nRegistration Procedure. Two registration desks will be maintained at the con¬\nference, one in the lobby of the Neil House and one in the lobby of the Deshler-\nWallick Hotel. Advance registrants, however, will obtain their tickets and badges\nat the Information Center in the lobby of the Deshler-Wallick Hotel.\nThe general registration fee is $5.00, which includes a copy of the proceedings,\nEducation on the Air, 1946 (separately priced at $3.50), and admission to all\nmeetings. Single-session registration is $.75, and general registration for students\nis $1.00. These latter registrations admit persons to the meetings, but do not include\na copy of the proceedings. General registrants will be admitted to all meetings by\nbadge; single-session registrants must present tickets. Students in high schools and\ncolleges will be required to present fee cards or other evidence of school member¬\nship when requesting student registrations.\nThe Institute for Education by Radio is a cooperative conference maintained\nthrough the interest and support of its members. The Ohio State University grants\na small allotment to cover a portion of the expense, but the bulk of the cost for\nthis annual meeting and for the printing of the proceedings is supplied by con¬\nference registration fees. The Institute pays neither honoraria nor expenses for its\nspeakers, and it is the custom, in furtherance of the cooperative character of the\nmeeting, for speakers and chairmen to pay registration fees on the same basis\nas other participants.\nAnnual Institute Dinner. Tickets for the dinner, Sunday evening, May 5, if\nnot purchased in advance, may be obtained at the registration desk; the price is\n$3.50. All reservations for the dinner must be made by Sunday noon, May 5. Dress\nwill be informal.\nOfficial Conference Proceedings. Each year the proceedings of the Institute\nare published under the title, Education on the Air. The yearbooks may be purchased\nat $3.50 a copy from Ohio State University, except the 1935 yearbook which is\navailable from the University of Chicago Press. There was no conference in 1945,\nbecause of wartime travel conditions, so no yearbook was published for that year.\nIssues for 1930, 1940 and 1941 are out of print. A reduced price for back copies\nis made when they are purchased in sets. A set of the proceedings of past years\nis on display at the conference registration desk.\n•\nAll meetings are scheduled on Eastern Standard Time.\nOpen discussion on matters of radio education is one of the chief functions of\nthe Institute. Members are urged to take part freely in discussion.\n©\nThe exchange of materials among the members of the Institute has proved\nhelpful in the past. Tables will be provided in the Deshler lobby where this ma¬\nterial may be placed. Members are encouraged to bring such materials for\ndistribution.\n3"
}