{
  "id": "d1592-4",
  "text": "feBB Mews Letter.•.Sept 15, 1959 Pag© 5\ncomplete incident from either a well-known story on the reading list3\nor a now book; and the Incident is not of the continued serial type9\nwherein the locomotive is left plunging through the bridge, and you are\nfold to go and read the book to accomplish the ending for yourself.\nRather, w© feel that in presenting a complete Incident with th©\nsuggestion that since there are other Incidents just as appealing,\njust as interesting, the child will have had a pleasurable experience\nin the listening period; and it has been our happy experience that\nthere has bean a multitudinous run on th© book at the library\nimmediately following the broadcast* In the broadcast handbook accompany¬\ning this series, five or ois; other books of similar them© are suggested,\nand the branch libraries endeavor to keep a radio bookshelf of these\nbocks on hand *\n\"Th© third program for fifth and sixth grad© is another Chicagoland\nprogram entitled, Makers of Chicago. Here we take each week a\ndifferent national fly hr racial group which makes up part of our\ngreat metropolitan center® One week it1 a th© Mexicans; another week.,\nthe Chinese; a third weak, th© Lithuanians, and son, and on*\n\"Let’s take one of the programs, for example,--on® on Mexico® In a\nschool located close to Hull House, which is now th© center of a\ngreat Mexican neighborhood, we have a group of children who will\npractice three Mexican folk songs which they will sing in Spanish on\nth© program. The.se ar© catchy tunes, and because they ar® children\nsinging them, the children listening have a spontaneous rapport\nestablished which provides a bit of very happy color® Than, we have\ngone to the Mexican consul and as lead hie cooperation in selecting\nsomeone to b© interviewed on two phases of Mexican life; on©, an\nanecdote, or legendary story concerning th© native'land* In this\ncase, the consul himself will be interviewed on the program, and is\ngoing to tell th© story of th© eagle and the serpent guiding the\nAztecs to a permanent abode at Tenoch tit lan in that fabulous lake\nvalley saucer wherein is located th© City of Mexico* Then, th©\ninterviewer proceeds to develop a second phase of th© interview with\nthe Mexican consul — namely, by questions on such things as where th©\nMexican neighborhoods are, in and about Chicago; when th© Mexican®\ncam.© to Chicago; and in what capacity; and what have th© Mexicans\ncontributed- to the construction of Chicago? You can apply your own\nthinking to th© potentialities of this program.\n\"Then, moving into the upper group — th© seventh and eighth grad©\nprogram — of the elementary school, we present fiv© programs, again\npurely a© a choice, for th® teacher to select one or possibly two\nwhich\"fit her needs as content within the personnel of her class®\nThese programs, again, are:\n\"Science — this one entitled the Science Reporter, a series of\nprograms wherein we tell the story of magneTs^ tree rings, pre¬\ncipitation, the solar system, and so on, and follow it with a special\ndemonstration at one of our great service museums, to which are\ninvited two members of each listening class* These students come\ndown on a later day of that week; attend the demonstration; handle\nthe objects assembled for that purpose; make notes; and return to\ntheir respective listening classes and retail in their own language\nand in their own way, the further enrichment which they have obtained"
}