{
  "id": "d1592-6",
  "text": "SATURDAY AFTERNOON\nWORK-STUDY GROUPS, First Session\nAll Groups Meet at 2:00 p. m.\nThe work-study groups devote themselves intensively to problems in the general fields indicated.\nEach chairman has selected a panel of resource persons to give expert advice. The agenda for\neach group has been developed by the chairman through correspondence with members.\nAgricultural Broadcasts\n2:00 p. m., Junior Ballroom, Neil House\nChairman, John C. Baker, Chief of Radio Service, United States Department of\nAgriculture; Secretary, Herb Plambeck, President, National Association of Radio\nFarm Directors\nPromoting the Farm Program\nR. J. Coleman, Director, Station WKAR, Michigan State College\nWallace L. Kadderly, Farm Program Director, Station KGW, Portland\nBill MacDonald, Farm Program Director, Station KFAB, Lincoln\nSam Schneider, Farm Director, Station KVOO, Tulsa\nWhat Rural Listeners Want\nAngus Campbell, Bureau of Agricultural Economics, USDA\nAndy Woolfries, Farm Program Director, Station WMT, Cedar Rapids, Discussion Leader\nSponsorship And/Or Public Service\nBob Child, Farm Program Director, Station WGY, Schenectady\nPhil Evans, Farm Program Director, Station KMBC, Kansas City, Missouri\nGeorge Round, Extension Editor, University of Nebraska\nTeaching by Radio\nHelen Powell Smith, Clothing Specialist, Cornell University\nJim Miles, Extension Editor, Station WBAA, Purdue University, Discussion Leader\nChildren's Programs\n2:00 p. m., Parlors A, B, C, Deshler\nChairman, Josette Frank, Educational Associate for Children’s Books and Radio,\nChild Study Association of America\nTopic, Network Programs and Problems\nEducation and Entertainment. Lyman Bryson, Director of Education, Columbia Broadcasting\nSystem\nParents’ Attitudes and Public Relations. Grace Johnsen, Director of Women’s and Children’s\nPrograms, American Broadcasting Company\nWatching Script: the Continuity Department’s Job. Dorothy Kemble, Manager of Con¬\ntinuity Department, Mutual Broadcasting System\nChild Listeners and Adult Programs. Doris Corwith, Assistant to Manager of Public Service,\nNational Broadcasting Company\nA Psychiatric View of Children’s Listening Needs. Dr. S. Harcourt Peppard, Bureau of Child\nGuidance, Department of Education, New York City\nJuvenile Listener Reactions. Clifford Samuelson, General Mills, Inc.\nShaping Social Attitudes Through Radio. Henriette K. Harrison, Radio Director, National\nCouncil of the Young Men’s Christian Associations\nSummary\n7"
}