{
  "id": "d1592-6",
  "text": "HAJE5B-News Lettar**«S«pt 15, 1959 Pag© 7\nIf properly utilized, will prove a valuable enrichment factor®\nwThe first step in direct action in utilization is a visit which each\nscript writer makes to a different school each week, to sit with the\nteacher and the class as they listen to her program. This script\nwriter, being a teacher herself, knowing the classroom routine, can\nlisten with a kind of jaundiced ear — if that is physiologically\npossible — and come back better prepared week after week to write\nscripts more closely attuned to the listening atmosphere she desires*\nI wonft enlarge upon this, but it is a valuable point*\nnA second step in our utilization activities is the Program Bulletin.\nSamples of that are available® This Program Bulletin is four page©\niia length and is issued each week in th© Superintendent*s mail. The\nfirst pag© lists current topics and items of interest to th© teacher,\nand includes special broadcasts. It covers trends® In other words,\nit i© a weekly newspaper of radio in education® The succeeding three\npages contain all programs which we recommend for listening in th©\nclassroom and in free time® Those ar® divided into grade groups.\nAll the programs for kindergarten, first and second grade are Included\ntogether. Each section of the listings, then, can be detached from\nthe rest of th© bulletin and kept within th© Immediate circle of\nprimary teachers® We list programs from NBC, CBS, and WLS, which,\nstill maintains a strong school-time program® It has beer, interesting\nto note that while w© list both our own Radio council programs and\nthose of th© networks and WLS, that by far th© preponderance of\nlistening is tuned in to those stations which carry our programs.\n\"A third point in the utilization procedure is th© handbook which I\nhave mentioned before. Each on© of our series of school-time programs-\nhas a eemeister handbook which is placed in th© hands of the teacher;\nand anyone, any teacher, can use these, and with careful study know\na great deal about this program before it is broadcast. She can\nmotivate the youngsters to a listening pitch where attention will\nbe ©panned wholesomely for the fifteen-minute period; and then can\ncarry on activities of a diversified nature either in committea work\nor small group work, or as a class®\n\"Another thing that we do in some instances, is make recordings of\nour programs, which are available in case th© teacher missed th©\nprogram — or in other cases, we have sent out a copy of th© script\nwhich the teacher is able to present as a simulated broadcast, t©\nmaintain interest in the series.\n\"As a further utilization activity, w© have organized what we call\nthe Ohicagoland Radio Dinner Club; and her©, at eaoh bi-monthly\nmeeting, an actual program is presented on a playback and a panel of\ncritics evaluates the effectiveness of the program. Such people a©\nMargaret Harrison of the Progressive Education Association, and\nLuella Hoskins of my own staff, and others, conduct these meetings®\n\"Perhaps the largest ©repression of our concern for utilisation will\nbe found in our National School Broadcast Conference which will have\nits third meeting in Chicago on December 6, 7, and 8. This conference,\nwhich attracts radio educators from all over the United States, is\nchiefly concerned with th© problem of utilization® Actual classes in"
}