{
  "id": "d1592-9",
  "text": "MAEB Hews Letter»».Sept 15. 1939 Pag® 10\nX am, X would Ilk© to give you the same speech - 1 dug it out of th©\narchives and road it * it’s a pretty good speech (HE) and it expresses\nthe way I still feel about it. Conditions haven’t changed a great\ndeal since then. But there are too many of you her© that heard me\nmake it at the Institute, so I must think up other ways to s&$ many of\nthe same things I said then,\n\"Seriously, has the situation changed, are educationally owned radio\nstations in any better condition to support themselves today than\nthey were in 1935, i© it any easier to build educational programs of\nquality than it was then, is the problem of building an audience for\nan educational station any lew®, and what* if anything has been don©\nduring the past five years to make me any more sure that X could or\nwould want to run such a station now?\n\"The whole business of radio and broadcasting sprung into being very\nquickly and before w® knew it had gotten to the walking stage - after\nit learned to walk what happened? X can go back ten or fifteen years\nand see great changes between then and now - but I go back five years\nand see scarcely any* Why is it? The .America*s Town Meeting of the\nAir ha© been on the network five years, the formula is the same, maybe\nit is better maybe it is worse - the formula is the same, I read Mr,\nVictor Yarros’ article which was appended to your preliminary program*\nIn it ho states \"What the Town Meeting of the Air can do, our education¬\nal institutions of authority and prestige can do, and do. bet teg--—-\nX am not forgetting th® University of Chicago Sunday morning broadcast,\nIt is good as far as it goes, but it is not a© good as it might be,\netc,\" I wonder .lust what suggestions Mr, Yarros would have for improv¬\ning both the Town Meeting and the Bound Table, X wonder if he knows\njust how much time and money goes into those programs, how many people\nof authority and prestige compos© the committee that arranges th© Town\nMeeting and the hours of time and thought which have gone into both\nprograms? It is so very easy to sit on the side lines and say \"they\ncould be improved,\" We know they could be improved, but we also know\nthat with all the best thoughts back of them, and with th© trying out\nof innumerable suggestions, the calibre of th© programs remains about\nth© same, Bon(t assume for one minute that I don’t think, oftentimes,\nthat they both could b® improved, but I know that every effort is\nbeing put forward to make those improvements and we have not gotten\nvery far, I wonder if Mr, Yarros realizes how difficult it is when\ncontroversial questions are being discussed, to get the people who\nknow and who should be willing to present their views, to stand up\nin front of a microphone and be frank and honest and willing to \"get\ntheir necks out,\" In many instances, in the case of the Town Meeting,\nyou could get people to make speeches, but they refuse to be heckled\nin front of an open microphone. So it is not always as easy to\naccomplish the changes as those sitting on th© side lines think,\n\"What has all of this to do with the subject we are supposed to be\ndiscussing, How I would run an educational radio station? Only this,\nthat the problems today are the same as they were five years ago, the\nprincipal one being, that under the American System of broadcasting,\nour first question is to build radio programs of Interest to our\nlisteners and th© second, is the financing of such programs as well\nas th© operation of the station,\n\"Mr® Yarros is very confident, in his article, that with \"the right"
}