{
  "id": "d1370-1",
  "text": "NAE8 NEWS LETTER\nPage 2\nMarch l, 1945\nATTRACTIVE PROGRAM STRUCTURE IS BEING DEVELOPED THAT WILL INCLUDE A NUMBER\nOFiSTUDENT AND OTHER PROGRAMS THAT WOULD BE CLASSED AS ENTERTAINMENT.\nFive commercial radio stations, WHAS, Louisville; WLAP, Lexington; WLW,\nCincinnati; WCKY, Cincinnati and VVSM, Nashville, have given the University\nPERMISSION TO REBROADCAST THEIR NON-COMMERCIAL PROGRAMS OF LOCAL ORIGINA¬\nTION.\nCLEAR CHANNEL ACTION BY FCC\nThe Federal Communications Commission plans to check policies affecting\nTHE NAT I ON * S BIGGEST RADIO STATIONS — THE 50,000 WATTERS♦\nThe Commission will begin hearings Way ninth to determine if there should\nBE A CHANGE IN THE METHOD WHEREBY CLEAR CHANNELS ARE ALLOCATED TO THE\nBig Boys, of which there are 53*\nThe FCC says the reason for the hearing is that there still are large\nareas in the nation which receive no radio service during day hours and no\nadequate night service which is free from interference.\nThe FCC also may look into the possibilities of authorizing stations to\noperate on more than the present 50,000-watt maximum.\nAt present certain wave lengths are allocated for the dominant or exclusive\nuse of high-power stations. What the Commission wants to learn is whether\nthe number of clear channels should be increased or decreased in order to\nBRING ABOUT A MORE EQUITABLE DISTRIBUTION OF RADIO SERVICE, ESPECIAQLY TO\nRURAL AREAS.\nClear channel assignments In this hemisphere are permitted in a North\nAmerican Regional Broadcasting Agreement drawn up on Dec. 13, 1937 and\nexpiring March 29, 1946.\nThe Commission said it wants to tackle the problem before the treaty\nexpires so that it can make recommendations to the State Department.\nAt the same yias the Commission has disclosed that net sales of time by\nTHE NATION*S 50,000-watt STATIONS IN I 944 TOTALLED $58,624,000, AN\nincrease of $9,708,000, or 19.85 per cent, over 1243.\nThe FCC report attacheo to the preliminary allocation proposal for\nEDUCATIONAL STATIONS (ATTACHED TO LAST MONTH9S NEWS LETTER) INDICATED\nTHAT EDUCATIONAL STATIONS MIGHT BE ABLE TO OFFER COVERAGE TO THE UNSERVED\nAREAS WHICH ARE LARGELY OF A SUB-MARGINAL CHARACTER. This INDICATES TO\nYOUR EDITOR THAT APPLICATIONS BY EDUCATIONAL STATIONS TO BREAK DOWN CLEAR\nCHANNELS MIGHT BE FAVOPABLY CONSIDERED. WE ARE NOW WORKING THE TECHNICAL\nPOSSIBILITIES FOR REASSIGNMENT OF ALL REGIONAL EDUCATIONAL STATIONS TO\nCLEAR CHANNELS AND FOR THE INCREASE OF OPERATING TIME FOR LIMITED CLEAR\nCHANNEL ASSIGNMENTS. THIS ACTION IS MORE OR LESS A BRAINSTORM OF YOUR\nEDITOR AND IS NOT AN OFFICIAL NAE8 ACTION. WhAT DO YOU THINK OF THE\nPOSSIBILITIES?"
}