{
  "id": "d1370-3",
  "text": "NAEB NEWS LETTER...°Rage 4..........MARCh I. 1945\nMUTER USING THERMIONIC VACUUM TUBES TO GENERATE OSCILLATIONS. WHEN Mr0\nJansky came to *vlinnesota, the University Station W'AS using a one-kilowatt\nSPARK TRANSMITTER TUNED TO 200 METERS. *\\‘ARKET AND WEATHER REPORTING HAD\nBEEN ADDED TO COMMUNICATION WITH OTHER AMATEUR STATIONS* AND THE STATION\nWAS IONEERING IN THE FIELD WHERE IT WAS RECOGNIZED AS ONE OF THE MOST\nPOWERFUL AND EFFICIENT SPARK SETS IN THE NORTHWEST*\nIt was under Mr, Janskys supervision that the station began the building\nAND OPERATION OF A CONTINUOUS WAVE TRANSMITTER WITH He C. T0R8ES AS CHIEF\nOperator. Careful and extensive investigation showed that, although the\nVACUUM TUBE TRANSMITTER WAS PUTTING LESS THAN HALF AS MUCH POWER INTO\nTHE AIR AS THE SPARK TRANSMITTER, THE RELIABLE COVERAGE W'AS CONSISTENTLY\nHIGHER. WITH THESE RESULTS, a MORE POWERFUL VACUUM TU8E TRANSMITTER W'AS\nBUILT. The new EQUIPMENT WAS NOT CONFINED TO TELEGRAPHIC COMMUNICATION,\nBUT EXTENDED TO RADIO TELEPHONY AS WELL. THIS APPARATUS W>AS FIRST USED\nIN THE SPRING OF !92l TO BROADCAST DAILY WEATHER REPORTS 8Y RADIO\nTELEPHONE. THE PROGRAM OF THE STATION W'AS ENLARGED LATER TO INCLUDE ONE\nCONCERT A W'EEK, AND DURING THE SEASON, PLAY-BY-P^AY ACCOUNTS OF THE HOME\nFOOTBALL GAMES WERE BROADCAST WITH GOOD REPORTED COVERAGE.\nWith these developments, radio telephone broaocasting on a regular schedule\nat THE University of Minnesota, using the call letters 9XI-WLB is the\nCOUNTRY S OLDEST RADIO TELEPHONE BROADCAST STATION WHICH HAS BEEN IN\nCONTINUAL OPERATION SINCE IT WAS ESTABLISHED. DURING THIS PERIOD, THE\nEQUIPMENT WAS ALSO USED FOR THE INSTRUCTION OF STUDENTS IN THE AOVANCED\nK.Uol.Lo SIGNAL CORPS COURSE.\nAmateur and experimental work went ahead when in 1923 the electrical\nENGINEERING DEPARTMENT MOVED INTO ITS NEW 8UILDING W’HERE THE BROADCASTING\nAND EXPERIMENTATION WAS HOUSED IN A SUITE OF ROOMS ON THE THIRD FLOOR.\nIn 1923 the *Ashburn-Crosby Company of Minneapolis loaneo the University\nA COMPLETE 500 WATT WESTERN ^LECTRIC 8R0A0C AST SET, W'HICH LATER BECAME A\nGIFT. WLB COOPERATED CLOSELY WITH WCCO, WHICH W’AS SUPPORTED BY THE C|yiC\nand Commerce Association. The arrangement gave the University Station\nTHE ADVANTAGE OF THE STUDIO AND Wl RE SERVICE OF THE LARGER 5,000 W'ATT\nSTATION. IT PROVIDED, ALSO, AN ALTERNATIVE BROADCASTING APPARATUS, W/HICH\nMADE IT POSSIBLE TO BROADCAST FROM BOTH THE CAMPUS STUDIOS OF WLB, AND\nTHE Anoka studios of WCCG. During this time, enough hours of broadcasting\nW'ERE SENT OUT FROM THE UNIVERSITY TRANSMITTER TO WARRANT THE CONTINUANCE\nOF THE STATION S TRANSMITTING LICENSE.\nThe programs broadcast under these arrangements included* a weekly organ\nCONCERT, FOOTBALL GAMES, AND SOME FACULTY INSTRUCTION. PROFESSOR CtARKE\nTAUGHT A NON-CREDIT COURSE IN ESPERANTO TO MORE THAN 2,300 PA 10 STUDENTS.\nAnother experiment in radio classes was Professor Jules Prelin*s class in\nFrench which he %etu once a week.\nIt soon became evident that the University needed more and better time\nTHAN IT COULD GET WITH THE USE OF COMMERCIAL FACILITIES. The GOOD EVENING\nHOUR WHICH W'AS FIRST ASSIGNED TO WLB FOR BROAOCASTING INFORMATIVE PROGRAMS\nW'AS CHANGED AS ADVERTISING DEMANDS ENCROACHED UPON IT. FINALLY, THE ONLY\nAVAILABLE TIME W'AS A USELESS LATE EVENING PERIOD, W'HICH HAD TO BE REFUSEO.\nThere was an added difficulty of censurship by the commercial station"
}