{
  "id": "d1370-4",
  "text": "NAEB NEWS LETTER\nPage 5\nMarch I, 19*5\nWHICH INHIBITED THE FREEDOM NECESSARY FOR UNBIASED EDUCATIONAL BROADCAST¬\nING* As A RESULT , WLB WENT 8ACK TO USING ITS OWN TRANSMITTER FOR ALL\nBROADCASTING. S|fstCE THEN A FEW OF THE UNIVERSITY PROGRAMS HAVE BEEN\nPICKEO UP BY COMMERCIAL STATIONS, BUT ALL OF THEM HAVE GONE OUT FROM\nWLB*S OWN TRANSMITTER.\nIn the spring of 1926, President Ooffman appointed a Radio Broadcasting\nCommittee to determine the broadcasting policies of the University. Its\nMEMBERS WERE CHOSEN FROM THE FACULTY AND ADMINISTRATIVE STAFF OF THE\nUniversity. At the recommendation of this group, the activities of the\nWL8 STAFF WERE DIVIDED INTO: PROGRAM PRODUCTION ANO PRESENTATION, AND\nDEVELOPMENT IN INSTALLATION OF NEW EQUIPMENT.\nWLB MOVED INTO ITS MEW QUARTERS ON THE GROUND FLOOR OF £ODY HaLL ON\nApril 10, 1939. Additional space had been a pressing need with the\nEXPANSION OF BROADCASTING ON 760 KILOCYCLES, AND THE NEW STUDIOS WERE\nPLANNED FOR MAXIMUM EFFICIENCY IN USING THE BROADCAST TIME ALLOTTED TO\nTHE STATION. ThERE ARE TWO LARGE STUDIOS: 245 BY 43*, AND 20* BY 24’,\nFOR USE IN MUSICAL AND DRAMATIC BROADCASTING. INTERVIEWS, NEWS PROGRAMS,\nAND TALKS ORIGINATE IN A THIRD SMALL STUDIO, (6* BY 9*). *N ADDITION\nTO THIS SPACE, THERE IS A SMALL AUDITION STUOIO, (9* BY IC * )» ADJOINING\nA COMBINED AUDITION ROOM AND OFFICE FROM WHICH IT IS POSSIBLE TO REGULATE\nTHE CONTROLS FOR A REHEARSAL, AND DIRECT PERFORMERS THROUGH A TALK-BACK\nSYSTEM WITHOUT ASSISTANCE FROM THE MASTER CONTROL ROOM. THERE ARE TWO\nCONTROL ROOMS, WITH ENTIRELY INDEPENDENT EQUIPMENT. The LARGEST SET)\nFOR CONTROLS IS ARRANGED SO THAT THE THREE SMALLER STUDIOS ARE GROUPED\nAROUND IT, THE AUXILIARY CONTROL IS NEXT TO THE LARGEST STUDIO WHICH IS\nSEPARATED FROM THE OTHERS BY A HALL. The STAFF OCCUPIES SEVEN OFFICES,\nAND A PUBLIC RECEPTION ROOM MAKES IT POSSIBLE TO HEAR THE BROADCASTS\nWHICH THE STATION CARRIES. (Two NEW REMOTE STUDIOS SINCE THAT TIME, AS\nWELL AS A NEWS ROOM.)\nThe new transmitter, located on the University Farm Campus has been very\nEFFICIENT. It IS AIR-COOLED, WHICH MAKE S IT THE ONLY ONE OF ITS KIND\nin the Twin Cities. Since its first operation, there has been general\nAGREEMENT THAT IT IS ONE OF THE FINEST TRANSMITTERS IN THE NORTHWEST.\nThe station’s CONSISTENT listening area (that DISTANCE which IS COVERED\nBY A STEADY CONSISTENT SIGNAL SUBJECT TO NO INTERFERENCE) IS 70 MILES.\nIncluding the secondary area acceptable for all practical purposes -\nTHE station’s LISTENING RADIUS IS SLIGHTLY OVER 200 MILES.\nTHE ARRANGEMENTS FOR CARRYING CAMPUS AND CITY BROADCASTS ARE EXTENSIVE\nAND EFFICIENT. Aj PRESENT, WLB HAS LINES TO MOST OF THE FIVE Tw»N C|TY\nSTATIONS, AND REMOTE CONNECTIONS - EITHER DIRECT, OR EASILY AVAILABLE -\nTO ALL THE BUILDING ON THE UNIVERSITY CAMPUS. ThE DIRECT LINE TO\nNorthrop Auditorium has been very useful in the broadcasts of the\nMinneapolis Symphony Orchestra. During the winter of 1938-1939 a series\nOF SYMPHONY PROGRAMS CARRIED BY ALL OF THE STATIONS IN THE STATE, ORI¬\nGINATED WITH 'ALB, AND WAS SET UP BY ITS OPERATORS. PERHAPS THE GREATEST\nVIRTUE OF THE NEW STUDIOS IS THAT THEY HAVE BEEN PLANNED FOR FLEXIBILITY\nIN ARRANGING BROADCASTS. S|X COMPLETE SIMULTANEOUS BROADCASTING SET-UPS\nCAN BE ACCOMMODATED - ALL FOUR OF THE STUDIOS AND TWO REMOTE CHANNELS\nMIGHT CONCEIVABLY BE IN USE ftT THE SAME TIME."
}