{
  "id": "d1370-8",
  "text": "NA£B NEWS LETTER\nPage 9\nMarch I, 1945\nTEMPER AND 10$ MENTAL. .. .CaRL iV'ENZER, WHO ALSO FOLLOWS HIS BASKETBALL TEAM\nAROUND THE CONFERENCE FOR BROADCAST tNG PURPOSES, WILL REPORT ON PURDUE\nIN THE NEXT ISSUE OF THE NEWS LeTTER*..*HEARD ABOUT THE NEW PuLSE-T|ME\nModulation'? Seems to have great possibilities for television* 4 don t\nTHINK IT WILL CHANGE THE AM OR PM PICTURE IN ANY WAY o .* * THERE 1S A LOT MORE\nTHAN MEETS THE EYE IN THE ORGANIZATION OF A StaTE-^IDE PM NETWORK* ASK\nTHOSE WHO ARE NOW IN THE PROCESS* The LOCAL AUTONOMY QUESTION IS A TOUGH\nNUT TO CRACK*.*.THERE WILL BE AT LEAST FIVE FIRST LINE BROADCAST EQUI PMENT\nMANUFACTURERS TO CHOOSE FROM AFTER THE WAR INSTEAD OF TWO AS THERE WAS\nTEN YEARS AGO* S|JCH COMPETITION SHOULD PRODUCE SOME FIRST CLASS EQUIPMENT\nAT A REASONABLE FIGURE.•.*Gr|FFITH WRITES THAT IOWA StaTE IS APPLYING FOR\nA TELEVISION STATION AS WELL AS FOR AN PM STATION. He ADDS THAT HE HOPES\nTHAT MOST OF THE PROBLEMS OF TELEVISION ARE SOLVED BY THE TIME THEY ARE\nCALLED UPON TO OPERATE THEIR STATION*.o.I SM STILL NOT GETTING ENOUGH NEWS\nOF NAEB MEMBER ACTIVITIES FIRST HAND. WhaTSA MATTER WITH YOUSE GUYS?\nSlTTlN* ON YOUR TYPEWRITER?\nFCC ACTIONS\nWNYD_City of New York Municipal Broadcasting System was granted license\nTO COVER CONSTRUCTION PERMIT TO REINSTATE CONSTRUCTION PERMIT FOR NEW\nRELAY BROADCAST STATION*\nWTAW_Agricultural and Mechanical College of Texas has filed a petition\nFOR CONSIDERATION AND GRANT UNDER COMM ISSI ON POLICY OF 1-4 6-45 OF THEIR\nAPPLICATION FOR CONSTRUCTION PERMIT TO CHANGE FREQUENCY FROM 1450 KILO¬\nCYCLES TO 1470 KILOCYCLES AND TO CHANGE HOURS OF OPERATION FROM DAYTIME\nTO UNLIMITED.\nThe College of the Pacific of Stockton, California has applied for a\nCONSTRUCTION PERMIT FOR A NEW NON-COMMERCIAL EDUCATIONAL BROADCAST\nSTATION TO BE OPERATED WITH POWER OF 4 KWC\nThe Evangelical Lutheran Synod of Missouri has applied for construction\nPERMIT FOR A NEW NON-COMMERCIAL EDUCATIONAL BROADCAST STATION TO BE\noperated on 42.9 MC with a power of 250 watts*\n4n response to a request by Cornell University, licensee of Station ^HCU,\nIthaca, New York, for special temporary authority to operate between\n7:30 and 8 a.m, during February 4945, the Commission approved a letter\nADVISING THE LICENSEE THAT SECTION 3*87 OF THE COMMISSION S RULES PERMITS\nITS OPERATION FROM 4 A.M* TO LOCAL SUNRISE WITHOUT THE NECESSITY OF\nAPPLYING FOR SPECIAL PERMISSION IF THE DOMINANT STATION ON THE CHANNEL\nHAS AGREED TO SUCH OPERATION. 4n THE INSTANT CASE, THE DOMINANT STATION\nON THIS CHANNEL, WWL, LICENSED TO LOYOLA UNIVERSITY, NEW ORLEANS, La.,\nAPPEARS TO HAVE CONSENTED TO VVHCU's OPERATION DURING SUCH TIME.\n—£bel"
}