{
  "id": "d1494-0",
  "text": "n-a-e-q nd/vs letter\nNational Association of Educational Broadcasters\nMadison, Wisconsin — December 5, 1936\nWASHINGTON CONFERENCE - DECEMBER 10-12 L\nThe NAEB is one of the sponsoring agencies of the First National Conference\non Educational Broadcasting- to be held in the capital city next week. An im¬\nposing array of topics and speakers is listed on the program.\nPresident McCarty and Secretary Engel assisted in the formulation of plans\nfor the sessions. Both will attend the conference and participate in sectional\nmeetings. Mr. McCarty will speak on the problems of the station director. The\nsessions are planned in cooperation with the U.S. Office of Education and the\nF. C. C.\nProceedings of the Conference will be published by the University of Chi¬\ncago Press (5750 Ellis Ave., Chicago) and may be obtained on special advance\nsubscription for $2.00.\nIt is hoped that many members will be able to attend these sessions. Con¬\nference headquarters is the Mayflower Hotel, Washington.\nREBROADCAST NETWORK FOR EDUCATIONALS?\nThe possibility of exchanging programs between educational stations in the\nmiddle west is being discussed by W0I and WSUI engineers. According to Direc¬\ntors Griffith and Menzer, the Iowa stations W0I and WSUI could form the hub of\na direct rebroadcast network which might include KSAC, WHA, and WILL. These\nstations can be heard by the Iowa stations. The hook-up might be extended to\nother stations if tests showed it practical. The hook-up might be used only\nfor special programs and at times when atmospheric conditions were favorable.\nMember stations interested in the possibilities of such a plan are asked to\ncheck on the reception of other educationals and the quality of the signals for\nrebroadcasting.\nDECEMBER EXCHANGE PACKET\nStill some member stations have not sent to the Secretary copies of bulle¬\ntins, programs, forms, scripts, or other pieces for exchange purposes. If this\nservice is to be continued every station must cooperate. The next packet will\ngo out on December 15 — that gives you time to pack up your pieces now rind send\nthem aldng.\n1937 MEMBERSHIP CAMPAIGN\nTreasurer Brackett reminds us that it is time to look to our 1937 member¬\nships. Statements for renewals will be received soon.\nTo WSAJ, of Grove City (Pa.) College, goes the distinction of being the\nfirst to pay its dues for the coming year.\nA campaign to bring into the organization all agencies eligible for member¬\nships will be started at once. Prospective members’ names should be sent to the\nsecretary. Institutions carrying on broadcasting activities over commercial\nfacilities are eligible to full membership."
}