{
  "id": "d1494-2",
  "text": "SHORT FLASHES FROM THE FIELD\nKOAC - Oregon State Agricultural College. KOAC's new Director of Farm Pro¬\ngrams is Burton Hutton, who comes to Oregon1s state-owned station after more\nthan ten years’ experience in the agricultural journalism field. He replaces\nC. R. Briggs, who joined the Spokane office of the Soil Conservation Service.\nHutton graduated from Oregon State in 1927 -and became agricultural editor\nfor the Pendleton East Oregonian. In 1929 he returned to Corvallis as assistant\ncity editor of the Gazette Times., He commenced work under E. T. Reed, Editor\nof Publications, for the Oregon State System of Higher Education, in 1935 which\nposition he held until hir appointment to KOAC November 1 by the Oregon State\nBoard of Higher Education.\nKUSD - University of South Dakota. The station will be off the air for\nseveral weeks while new equipment is being installed.\nKFKU - University of Kansas. Miss Seaman sends these notes: Station KFKU\nstarted its 12th year of broadcasting with several new programs. The Department\nof Speech and Dramatic Art and the School of Education are each sponsoring two\nprograms a week.\n\"To the Stars Through Difficulties\" is a pretentious series of 30 episodes\ndramatizing Kansas history from the coming of the pioneers down to the notifica¬\ntion ceremonies for Gov. Landon, as the nominee for president. These plays are\nwritten by Prof. Allen Crafton and are presented by the Kansas Players.\nThe program of request readings with musical background, presented each\nweek by Prof. Robert Calderwood, Department of Speech and Dramatic Art, has re¬\nceived much appreciative comment.\nDr, R. A. Schwegler, Dean of the School of Education, discusses the prob¬\nlems of \"Educating Yourself\" each week and Dr. Bert A. Nash addresses the P.T.A.\neach week about \"Personal and Family Problems.\"\nThe School of Fine Arts presents the University Symphony Orchestra, the\nUniversity Band, the A Cappella Choir, the Glee Clubs, String Quartet, Chamber\nMusic Ensemble and faculty members each month in concert over KFKU, as well as\nrecitals by advanced students from the Music Department. Dr. Charles S. Skilton\nwill resume the Music Appreciation Period in December.\nThe College of Liberal Arts and Sciences is offering lessons in Spanish,\nFrench, German, a Study of Shakespeare and Book Reviews as a part of the KFKU\nSchool of the Air. These courses are presented primarily as a supplement to\nthe class work in secondary schools and junior colleges. In addition to the\nabove courses, the Department of Physical Education conducts two popular \"Ath¬\nletic Scrapbooks\" each weak.\n^SAJ - Grove City College. H. W. Harmon says: WSAJ is a 100 Watt station,\nbroadcasting at designated hours: Sunday College Chapel at 4:30-5:30 and two\nevenings per week at 7:15-10:30. We. usually use Tuesday and Thursday evenings\nfor about one hour beginning at 7:15. This program is a faculty, student, and\nlocal civic program and is largely educational in character.\nOur faculty has become quite aware of the educational values and the pos¬\nsibilities of radio for our students. From our program sheet you will see\nthat our students are taking an active part in the programs. On an average,\ntwenty-five students appear before the microphone weekly.\nWSUI - State University of Iowa. Carl Bilenzer says, \"WSUI is planning on\nbroadcasting all home basket-ball games direct from the floor, and all out-of-\ntown games by telegraphic reports.\""
}