{
  "id": "d515-27",
  "text": "3.\n1*. Tape length:\nA. Primary standard—2^00 ft. plus $0 minus 0\nBo Secondary standard—=>1200 ft. plus 25> minus 0.\n5. Erasing and recording width:\nA. Entire width of tape (full track)\n6. Tape speed:\nA. Primary standard—1£ inches per second\nB. Secondary standard—inches per second.\n7* Tape alignment:\nA. Recording and reproducing heads shall be aligned\nperpendicular to travel of tape.\nThe above standards are basic to the entire industry and should not\ncause any conflict with any kind of equipment generally used in the broadcast stations.\nIn the three areas of standardization the proposal was generally agreed\nto. It was believed necessary that the standards for tape duplication be the very\nhighest attainable today* The standards in the area of tape acceptance bears\nemphasis for they involve a change from our nornal routine in the past® It is\nrecommended that the standards of tape acceptance be the primary standard. This\nmeans that tapes offered to the Network for acceptance be recorded at l£ inches\nper second and be of very good quality® Either size reel may be accepted however.\nThe philosophy followed in making this decision is as follows: It is absolutely\nnecessary, if we are to distribute good quality tapes, that the master sent to\nthe Network be of the very highest attainable with the equipment the stations\npossess. It is, therefore, believed that requiring the masters to be made at 15\nips. will go farther in insuring this requirement than will 7j ips. It may appear\nridiculous on first thought to require l£ ips. masters when we turn right around\nand duplicate them at ips. However, it is believed the requirement of masters\nat l£ ips. will have an uplifting effect on all programs sent to the Network. If\nit does this, then it is entirely justified for it requires little additional cost.\nFurthermore, it is suggested that it bo a requirement that, whenever possible,\nthese masters be original recordings on pre-erased tapes.\nIt is belie ved that full attainment of these standards will require a\ngood distribution program accompanied with complete written instructions® Our\nprocedure for adopting officially these standards Is as follows: the immediate\ntwo weeks are being spent on a little study on the electrical standards® I will\nthen send out a revised form of standards to the members of the Group. They will\nthen answer with sny other suggestions® Their answer will constitute an official\nrecommendation to the NAEB Board of Directors for adoption. We will then send\ncopies of these standards to all the chief engineers of stations in the Network.\nIt is possible that the electrical standards may take more time than two or three\nweeks. If so, the standards as much as are complete can be circulated® It is\nbelieved that with continued effort and cooperation the Tape Network can operate\nwith standards more complete and workable than any other set of standards existing\nin the country today.\nRHJ :WC\nRobert H. Johnston\nRecording Engineer"
}