{
  "id": "d515-66",
  "text": "MSB TAPS NETWORK\nFebruary 20, 1952\nME&)RANDUM\nTO: ALL NETWORK STATIONS\nFROM: DICK RIDER\nRE:::::::: USE OF TAPE NETWORK PROGRAMS\nTills memorandum is intended to clarify present practices in the use of pro-*\ngrans received through the NAEB Tape Network*, These practices apply generally to all\nnetwork programs* EXCEPT FOR CERTAIN SPECIFIED SERIES. One such exception is the mater¬\nial supplied by the BBC., All stations should have received a copy of the BBC restric¬\ntions as published by them. If not* please let us 'mow and we will supply one. Another\nexception is THE NEW WORLD OF ATOMIC ENERGY which was given limited clearance by AFRA.\nIn the future the attached form will be used to obtain pertinent information\nfrom the originating source,, This information will accompany program offerings.\nIt is essential that all stations rigidly adhere to all restrictions imposed\non the use of pro grains supplied to us* In case of doubt please check with headquarters\nbefore subjecting NAEB tapes to unusual uses.\n1. Dubbing programs for delayed use* or far re-use. Except where specific¬\nally prohibited the dubbing of tapes for delayed use or for later re-use is permitted*\n2o Dubbing programs for non-broadcast use. Except where specifically pro¬\nhibited the dubbing of tapes for classroom* library* or other legitimate educational\nnon-broadcast use is permitted *\n3o Network programs will not be supplied for use by stations not partici¬\npating members of the network,. There are certain exceptions to this* but the right of\nexception rests 'with the Board of Directors of NAEB and not with the individual station.\nbo Under no circumstances may a member station provide network programs\nfor coimrercial stations. This area provides our greatest risk* Special care is re¬\nquested to insure that this policy is followed»\n5. Network programs may not be used over wired wireless* gas-pipe, or\nother non-licensed campus stations.\nThese areas seem to have j>°sed the majority of problems* lour complete co¬\noperation is requested.\nDR:¥G\nEnc.\nDick Rider"
}