{
  "id": "d515-79",
  "text": "TO\nDATE\ns Seymour Siegel\nFROM s John W. Dunn* WNAD,\n: January 3, 1952\nSUBJECT : MAEB Tape Network & NAEB\nOn several occasions of late, I have voiced opinions and suggestions regarding our\nNAEB Tape Network. Both Jim and Dick have met these opinions and suggestions with\nanswers which perhaps in their judgment were valid but not entirely satisfactory\nto us.\nTo begin with, I think it should be emphasized over and over again that the NAEB\nTape Network belongs to no one individual or group of individuals, but the ENTIRE\nassociation; that it should not be run for the satisfaction of any one individual\nor group of individuals, but it must be operated for the benefit of the association\nas a WHOLE and according to the wishes of the majority.\n1, I am not so sure but what the NAEB Tape Network is tied directly to and actually\ncenters in this thing which we call THE NATIONAL ASSOCIATION OF EDUCATIONAL\nBROADCASTERS. Certainly, all of us can recall in those days before the actual\nvitalization of the network how we felt regarding this project of the future—\nthat it would be THE thing which would save NAEB from going under and that it\nwould be the heart of NAEB operations. There was, at that time, a feeling that\nNAEB had very little to offer member stations scattered all over the nation in\nthe way of material assistance. We took their money in the form of dues and let\nit go at that. The tape network vjw the best answer to this pressing problem.\nIn my estimation it has certainly been one of the greatest factors in preserv¬\ning NAEB and pushing it ahead. And to look at the whole thing realistically,\nit still is one of the principal things the association has to offer member\nstations.\n2. Furthermore, I am not so sure that we can always divorce membership in NAEB from\nparticipation in the NAEB Network. Most certainly, active membership in the\nassociation is required for service from the network, and I do think it is the\nbest LURE v/e can offer educational radio stations to become members of NAEB.\nYou will recall that I have made several suggestions along this line:\n(1) That we offer FREE network service for one year to NEW stations joining\nNAEB. With not too many new possibilities, such a move couldn’t hurt us\nfinancially. This offer would certainly introduce them to the advantages\nof the network AND would make them feel that v/e are vitally interested in\nthem. Most of the new stations will have a hard enough time as it is—\nstarting off on limited budgets and facing operational difficulties. Our\nhelp in PROGRAMMING would be REAL help.\n(2) That membership in NAEB would automatically carry with it a number of FREE\nhours of NAEB Tape Network service on a SLIDING scale. For the larger\nstations there would be fewer hours than for the smaller ones. Many of us\nwould find that membership dues in NAEB—small as they may seem to some—\nwould be justified in the eyes of administrators with whom we have to live\n12 months out of the year."
}