{
  "id": "d515-95",
  "text": "NAEB TAPE NETWORK\nMarch 11, 1952\nMEMORANDUM*\nTO* * ALL NAEB STATIONS AND MEMBERS OF IN-SCHOOL PROGRAM COMMITTEE\nFROM I DICK RIDER\nRE itsxsst IN-SCHOOL PROGRAMS FOR POSSIBIE NETWORK USE.\nHaving now begun—at long last—the distribution of in-school pro grams,\nit is necessary to conduct an intensive search for outstanding series to be\nused as future offerings* Our immediate concern is for programs to be used\nduring the second semester of the 1952-53 school year* These programs are\nto be selected by the in-school committee at their meeting which coincides\nwith the Institute For Education by Radio-Television in Columbus* The plan\nis to have these programs distributed before the close of the current school\nyear* It is also planned to maintain an NAEB audition room at the Institute\n—so there is a double incentive to have as many programs as possible for\nall interested to hear while in Columbus*\nTHEREFORE— I strongly urge you to consider all of your in-school\nprogram series for offering to the network* In this regard I call your\nattention to the report issued by the Network Acceptance Committee and the\nIn-School Program Committee which most of you have received, and which is\nalso reproduced in the current NEWS-LETTER* I particularly invite attention\nto the list of suggested areas, a copy of which page is attached for your\nconvenience*\nThe following are the major procedural points:\n1. Send all possible series to network headquarters* We will catalogue\nthem and have them all ready for the committee to audition*\n2* The committee prefers to have available a whole series, which has\nbeen standardized at 1L programs* (Exceptions can be made, of course*) If\nthis isn*t possible, send a good representative sample of programs—this\nwould mean more than the best single show in a seriesi\n3* Send at least one copy of the appropriate teacher*s manual or other\nsupplementary material.\nIt* These are for audition purposes only. Individual arrangements will\nbe made for those series to be used® You will get back soon after the Colum¬\nbus meeting all tapes which you send in*\n5>o Time is short—so, please consider this problem soon, and get your\ntapes off to us at the earliest possible date*"
}