{
  "id": "d811-10",
  "text": "role as the leader in the birth of a new profession requires at least the\nutmost in responsibility, even though already-existing recognition of its\nrole is a tribute to what it has done so far* Raw far there is yet to go\nis most apparent only to those in the 5AEB who are seeking to develop\nnecessary standards in time to meet the need* for this reason, not only\neducators of the United States bat also thoee in aaeh organisations as\nUNESCO, and other international scholars are being consulted in the gradual\ndevelopment of what we hope will be a sound foundation for what we believe\nwill one day be a recognized, respected profession, policing itself as\nrigorously as the professions of medicine, dentistry or lew. The possible\nindirect influences of such a development on the commercial media, as weU,\nare obvious.\nIn the request presented herewith, we have attempted to\ndemonstrate the responsibility incumbent upon us* Although the KAB3 would\nbe the central, coordinating agency in the project proposed, the minds and\ncounsel required^ will be those from all the disciplines which education\nfa rP\nencompasses, as well as (and perhaps principally ),[c ©operative efforts-wyth\nteacher-training institutions on whan, eventually, mast rest the burden of\ndeveloping in teachers the understandings and skills required to cope with\nthe advantages and etrengths^as well as the limitationsy>f electronic\ncommunications instruments as basic core educational instruments.\nAt a meeting December 5*6, 1958 of the NAEB*s Professional\nAdvancement Committee, with the President-elect and the Executive Director,\nan effort was made to develop the steps to be taken in this project* At\nthat time it was felt that, in spite of the steps already taken, considerably\nmore pre-preparation, was necessary prior to formalizing our request* It\nrequired careful discussion, for example, with responsible representatives\nof the American Association of Colleges for Teacher Education and other"
}