{
  "id": "d811-13",
  "text": "40-\n\\\nHowever, during the period of the proposed grant project, it\nIs our hope that the status and qualifications of educational broadcasters\nwill become increasingly important to educational administrators* This is\nin turn related to the effort of the KAEB to achieve self-support*\nDuring the past year the MAE B baa experimented with self-\nsupporting workshops and seminars* It will continue to do so* However,\non the basis of present experience and inquiries it appears that a charge of\napproximately $100*00 for a workshop is the maximum that can be charged, and\nthat the present ability of teachers to pay, or the present evaluation of\nfunds which schools are willing to males available, is more nearly of the order\nof $$0.00 as the \"ideal\" registration charge which could be counted on at\nthe present state of recognition of broadcasting as a profession. This\ncontrasts sharply with the $$00*00 charged by the National Association of\nBroadcasters (NAB), the association of commercial stations of the United\nStates, for two-weeks management and other seminars* Considerable subsidy\nseems inevitable if the MATE is to raise the local status of educational\nbroadcasters to the level of other employees^ of educational institutions,\nwhose importance to the whole institution^ functions is recognized suffici¬\nently to justify more expenditure on the part of the institution for in-\nservice training, conferences and related activities. q\nFinally, before presenting the specific reques^ it is*our belief\nthat we should make clear some of the respects in which the sort of training\nwhich the NAEB visualizes as essential to teacher-training and educational\nstation staff training, differs from that which would prevail without the\nNAEB*s assistance and leadership.\nIn the first place, the NAEB sees television and radio as\ninseparable. No other organisation, to our knowledge, has through the years\nso stubbornly insisted that there are essentially equal roles for both media\nto play, if the educational needs of the nation are to be served and the"
}