{
  "id": "d811-26",
  "text": "January 21, 1960\n14 Grocery Hall\nUr bona, Illinois\nDir* ’ lour ice r, Sony, Director\nDivision of Education\nU. K* Kollo^ Aouxidntion\n250 Champion Street\nBattle Creel:, f&ohl'jen\nDear Maurice t\nIntended to send you a copy of tills, but with a note saying “for your infor¬\nmation* —* Somethin/; slipped on tills somewhere, 1 fear*\nlour conclusion was correct* At the ougcostlon of several poople, like Herman\nCousins, Denny Maries, and others — we did send this to quite a number* Par¬\nticularly to new foundations, whoso area of emphasis is not yet decided. I\npersonally don* t put oo terribly much faith In this, but thought It miefat be\nworth a try*\nIt was not sent to sovoral with whom we already have appointments t United\nStates 13$eel ’oundctlon (reoonasonded to Ur* Homer Turner by their San irencisoo\nDirector, who knows of our work), etc.\nHarley and I leave for a week in Tidy York, January 25 - 29, for conferences\nof this sort. lh are even talking to a couple of professional “furd-roisers\"\nbut so far ore a bit squeamish about usine tills, except as a last resort*\nShortly after our return, perhaps son®time in bbruary or March, we'd like very\nmuch to chat with you over developments since our last (dinner) meeting*\nThe crux of our problem Is this* Tho Center (Uhite et al) ere now coiny into\nradio network distribution, ford had «iven lnrfu funds to the Broadcast ’atm-\ndation of America (iiy Siegel, Coerce Probst end others), with whioh they bought\nduplicating equipment, hired staffs, and had travel funds wo could only onvy*\nThey (BA) wore of festively squeostni; us out of the International cron, since\nthey could pay for pro; rams, etc* Tlien lord discovered that the manorous jjroups\n(^AEB, the Center, XA) most of which Aord created, were cottinc in each others'\nway* Hence they ( ord) exerted their influence (vithholdinw funds to BAA) to cot\nthis on-eoinc radio distribution set-up and a whole international relations organ¬\nization tranaferrod to the Center, including X’A's radio clientele* He were in"
}