{
  "id": "d811-9",
  "text": "-6-\nbe included in any definition of a professional association of individuals\nwhose principal functions are using these media for educational purposes.\nThe entire new concept of the profession which this opened up made us\ngrateful that we had not previously established qualifications which might\nhave excluded them. And, to date, there is no other organisation to which\nthey can turn for the experience, training, guidance and assistance they so\nurgently need. Unless the NAEB proves responsive to this challenge within\nthe next few years, however, it is a virtual certainty that such individuals\nirf-n either find their home with other organisations (we do not here refer\nto the perfectly natural membership of such individuals in such content-^f\noriented areas as the American. Association of Teachers of 'fcamgeegaftp English,\nfscience, ModelaJ^^ we seek to encourage) or will form a splinter\ngroup of their own.\nA rtmrt delaying factor has been the international role of the\n*\nNAEB. Within the last two years individuals from the NAEB have been\ninvited to serve as speakers, judges, and consultants at various educational\nconference £ Abroad, including Canada and Latin America. Since the NAEB\nis unique internationally as well as in the United States, educators and\neducational broadcasters of these nations naturally inquire regarding raenfcer-\nehip by them in the NAEB, Thanks to the efforts of various NAEB representa¬\ntives, for exanple, educational television is on the threshold of realization\nin Canada, Venezuela and other nations. No great obstacles are foreseen\nwhich would permit mambership by them in the NAEB until developments and\ngrowth warrant the formation of their own organizstions~or possibly a new\ninternational role for the NAEB eventually. However, a sobering responsi¬\nbility is placed on the NAEB to make sure that standards and qualifications\n'hm& for educational broadcasters will be as carefully designed and as\n*\nprofessional in nature as the best minds available can make AA& The NAEB9 s"
}