{
  "id": "d728-109",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nMinneapolis, Minnesota\nMay 12, 1952\nMr* Ralph Steetle\nJoint Committee on Eduoational Television\n1786 Massachusetts Avenue N«W®\nWashington 6, Do C.\nDear Ralph;\nLike everybody else in eduoational broadcasting, I have spent a good deal of\ntime lately thinking about those 242 reserved channels® What should education\ndo about them? Specifically, how can I get my institution to apply for re¬\nserved Channel 2 in the Minneapolis-St® Paul area?\nThis past month provided me with some stimulating experiences® First there\nwas the Columbus Institute with its emphasis on television® Then there was\nthe National University Extension Association convention in Austin where I\nlearned a great deal about how administrators look at television from talking\nto them and having them talk to me® Last week I spent two days at the Univer¬\nsity of Kansas inspecting the closed circuit color television installation\nthey use for instruction in surgery, and talking to a number of their officials\nfrom the chancellor on down about the University of Kansas and television®\nThen came a couple of days at Iowa State.\nFrom all of this have emerged certain convictions as to what we should do to\nget educational institutions to apply for licenses® I am reporting these to\nyou because JCET is the natural center for coordinating information and activ¬\nity about eduoational television, as well as to the NAEB Board of Directors\ntime NAEB will continue to be a spearhead group. If what I suggest is old\nstuff just forget it—although in that case you might derive satisfaction from\nknowing that someone in the field has arrived at the same conclusions you cams\nto in Washington® If my ideas are new but not good please say soa others may\nhave them too, and the sooner we are put right the better® If these procedures\nare both new and good, perhaps you can help put them into effeot. So, here\ngoes l\n1® We must disseminate basic information about the allocation plan to school\nadministrators and others who are in a position to take action® The FCC’s\nreport is much too long and Involved for college president®, superintendents\nand legislators to read} yet it includes much information which should be spread\naround® (I am trying to do my bit here by preparing an artiol® for the next\nQuarterly of Film Radio and Television which will cover some of the items in\nwhich I found the NUEA group In Austin to be interested®)\nZo We need campaign literature, such a@ booklet® giving the ABC’s of the 242\nChannels® I have noticed that many of the same questions arise wherever this\nis discussed® For example, one of the vice-presidents of the University of\nMinnesota and the Chancellor of the University of Kansas both asked me how they\noould justify money for a television station when only a portion of the oitisens\nof each state oould be reached by its transmitter® An educational television\noateohism might be circulated with suggested answers to such recurring questions,\ntogether with supporting statistical data when available®"
}