{
  "id": "d728-11",
  "text": "-2-\n■?\nRobert Van Duyne of the Kellogg Foundation spoke briefly for the Foundation,\nand stressed the importance of evaluating the project as it proceeds,. President\nSiegel then outlined some of the purposes of the Kellogg projects training of\npersonnel; setting up of seminars; making of studies on programming and management.\nHe also stressed the importance of clearly defining and differentiating between\nthose NAEB activities financed by Ford and Kellogg.\nThere was much general discussion of the procedure to be followed when the\nKellogg Supported NAEB central office is organized* President Siegel stated that,\nin his opinion, much of the Executive Director's work would have to be done in\nNew York because of its many program potentialities and news outlets.\nThe Board extended the appointment of Richard Rider as Network Manager to\nJune 30, 1952, and elected him assistant Kellogg Project Director for the period\nJune 1, 1951 to June 30, 1952, at the total rate of $6,000 per year. The Secretary\nwas instructed to notify Rider of this action.\nWith the approval of the Board the President appointed a working executive\ncommittee as follows* Ausmus, Miles, Paulu, and Siegel. This committee was\ncharged as follows: if no executive director was chosen, it was to search for a\ncandidate acceptable to the Board; if and when one should be chosen, it was to\nconsult with him in implementing the Kellogg Grant.\nThe Board authorized the President to offer the position of NAEB Executive\nSecretaiy to Robert Hudson.\nResolved the program acceptance committee is to draw up written standards\nand procedures for selecting programs for the NAEB Tape Network, these to be re¬\nported to the Board of Directors.\nResolved the chairman of the program committee may call a meeting of the\nprogram committee if necessary, expenses to be defrayed from Kellogg funds.\nResolved that $100 of Kellogg funds are to be assigned for use of James\nMiles as chairman of the program committee.\nResolved that the NAEB Board of Directors appoint a committee to represent\nit in the administration of the Educational Broadcasters Services Project of the\nKellogg Foundation at the University of Illinois. This special committee, respon¬\nsible to the NAEB Board of Directors and holding office subject to its pleasure,\nshall consult with, instruct, and supervise the executive director in implementing\nthe objectives of the grant as outlined in the proposal originally submitted by\nthe University of Illinois to the Kellogg Foundation on behalf of the NAEB.\nIt is the intention of the Board of Directors that, subject to this special\ncommittee's supervision, the NAEB executive director shall use to best possible\nadvantage all the existing educational program resources available—both NAEB and\nnon-NAEB—including the projects of the Ford Fund for Adult Education. He is al30\n•fco develop ways and means for training educational radio personnel utilizing the\nfacilities of the University of Illinois as available, as well as through other\nseminars and conferences."
}