{
  "id": "d728-112",
  "text": "May 13, 1952\nPresident Charles E. Friley\n117 Beardshear\nIova State College\nBear President Friley?\nThis is to advise you of progress made by the Radio and Television\nTeaching Committee with respect to a summer television conference on\n\"Building and Operating an Educational Television Station which we\nwould propose to hold on the Iowa State Campus July 14 through\nJuly 18,\nWe would expect members of the conference to Include school and\ncollege administrators and educational radio and television directors\nfrom those same schools.\nInasmuch as the Joint Committee on Educational Television has complete\ndata on institutions which have expressed an official Interest in tele¬\nvision, it would be proposed that we avail ourselves of their mailing\nlist and transmit for us the necessary invitations and descriptive\nbrochure. Thus Iowa State would not be in the position of making some\nimplied determination of what schools could and could not operate tele=>\nvision stations as would be the case if we Issued direct invitations.\nYou will recall the Committee previously had recommended a conference\nfor these same dates involving different program and production areas\nof television at an estimated cost of $6,200,\nIn view of a number of developments including lifting of the FCC freese,\nthe reservation of 242 channels for education, the expressed need and\nconcern of many educational institutions for basic information, the\nCommittee wishes to withdraw its previous proposal and to substitute\nthe present one.\nAnother factor in our revised proposal is the request of the National\nAssociation of Educational Broadcasters to hold a conference for edu¬\ncational radio station managers at W0I«TV and to contribute funds\npresently estimated at $1,500 and some manpower for such an endeavor.\nTheir executive secretary, James Miles, and a representative from the\nKellogg Foundation, Mr. VanBuyn, will be on campus tomorrow to discuss\nthis matter and to consider a joint and expanded conference which\nwould Involve educational administrators as well as station managers."
}