{
  "id": "d728-114",
  "text": "PROPOSED TELEVISION CONFERENCE & WORKSHOP\nIowa State College\nJuly 14-19\nObjectives\nTo provide basic orientation and information on the con¬\nstruction and operation of an educational television\nstation in terms of WOI-TV and related educational TV\nbroadcast experionce.\nAttendances\nCollege, university, and public school administrators;\nradio directors at universities, colleges, and secondary\nschoolso Total attendance would be restricted for the\nconference to 100; attendance for the workshop would be\nrestricted to 40.\nRegistrations\nNo registration will be accepted after July 1, Registration\nfees of $6.50 will be charged for the \"Conference Period\"\n(July 14, 15, 16); registration fees of $15.00 will be\ncharged for the \"Workshop Period\" (17, 18, 19).\nStructures\nConference would be divided into two sections—\"General\nConference\" and \"Workshop\" each three days in length.\nGeneral conference period would be devoted to lectures*\ndemonstrations, discussions, and exhibits on the basic\ntheme of \"Building and Operating an Educational Tele¬\nvision Station,\"\nWorkshop period would be devoted to more detailed explora¬\ntion of problem areas of TV station construction, equip¬\nment, staff, operation, and production. The group of 40\nwould be divided into groups of 10, each with a consultant\nleader. It is expected this more restricted group would\nconsist of representatives from educational institutions\nwho expect to build stations in the immediate future.\nResources\nDr. George Town, associate director. Engineering Experiment\nstation.\nPersonnels\nL. L, Lewis, chief engineer, WOX-AM-FM-TV and staff.\nEdward P, Wegener, program manager, WOI-TV and staff.\nJames Butts, chief engineer, KWWL, Waterloo0 Iowa,\nRalph Steetle, executive director. Joint Committee on\nEducational Television.\nSeymour Krleger, JCST attorney.\nRudy Brets, former CBS-TV producer,\nMayo Simon, PAE producer-writer.\nWilliam Levenson, assistant superintendent, Cleveland Schools.\nPaul Walker, chairman, Federal Communications Commission."
}