{
  "id": "d728-122",
  "text": "WUOM\nUniversity of Michigan\nAnn Arbor, Michigan\nJune 12, 1952\nFellow Members of the NAEB Board:\nI am enclosing dittoed copies oJT two letters which I have\nreceived and one exhibit.\nBob Hudson was in Ann kv'oojtTthe other day; and, in the course\nof our conversation, I ea^oavored to get from him some idea\nof the status of the 4k»ntIn\nthe course of the conversation, I said that the Board had\nbeen in some doubt as to whether this grant had been made\nto the NAEB, to Jim Miles as Executive Director of NAEB,\nor to Jim Miles In person0\nI also pointed out that it was my personal feeling Hudson\nhad been disturbed by the fact that the suggastfeiag^f this\ngrant had been reported to the NAEB Board of Directors<> I\nsaid that it was my understanding that Hudson had said that\nthis grant had been made to Jim Miles and was supposed to be\nconfidential,, As you all know my feelings in regard to this\ngrant, I do not think that I have to enlarge upon what I said\nto Hudson In the course of the conversation,.\nIt was a very pleasant talk that I had with him but very\nmuch to the point (you know me)0 I made It clear, however,\nthat I was expressing my own opinions, which were not neces¬\nsarily those of the Board of Regional Directors.\nAmong other things, I told him^that it seemed to be the\noonaagsws of certain of the officers that the meeting with\nJ^c^Fle^tcheff. should be strictly a closed meetingo I also\ntold Hudson' that there was 3ome basis for thinking that the\ngrant had been made to Jim personally. The enclosed letter\nfrom Bob may be of Interest to you. He also sent me a copy\nof a letter which he sent to Seymour, which I am also enclosing.\nThe convention committee met in East Lansing last week. Plans\nare progressing very well. It sounds to me like it should be\na very satisfactory meeting, with most of the sessions in the\nform of town hall meetings for general membership.\nCordially yours,\nQJlrloV'\nWA:cfo Waldo Abbot, Director\nEncs. 3 Region III"
}