{
  "id": "d728-132",
  "text": "TO : Officers & Directors\nFROM: John W. Dunn\nDATE s August 8, 1952\nSUBJECT: Scran®* s Letter\nWilber’s letter shock but not unexpected. Agree with him that if we xd.sh to con¬\ntinue present set-up, we must act as soon as possible. Ought to be enough of us\nat Ames to start the ball to rolling.\nBelieve we should have someone who has extensive background in educational broad¬\ncasting and believes in the principles and philosophies of educational broadcasting.\nOur man should have maturity, good judgement, considerable initiative and adminis¬\ntrative ability, not to mention tact and diplomacy. Big order, Jim has done a\nmagnificant job. Haven’t always agreed with Jim in everything. Still I admire\nand respect him for a guy who’s \"big”.\nTo get light person is going to be hard. Older men will be reluctant to give up\nsecurity, seniority, retirement build-up for something which offers a passel of\nheadaches and a year-by-year existence for four years and after that,.,a big question\nmark. Any younger man. must be severly scrutinised.\nBefore anyone takes Jim’s place, we should thoroughly overhaul Executive Director’s\njob. We should define duties, obligations, powers, etc. We haven’t been fair to\nJim because he’s never known where he stood. Hard on him and us.\nAs to Wilbur’s statements: we \"threw him to the dogs” at Battle Creek; the founda¬\ntion was “very much worried” after the Battle Creek meeting; *» we got a severe\ngrilling” when annual report made — need considerable explanation and justification\nbefore X accept them without the proverbial salt. Reminds me too much of the gag\nyou pull on kids: “Better be good or Santy won’t come to see you”. I’m getting\njust a little weary of the attitude of some people that the Officers and Board of\nDirectors of NAEB are a bunch of kids or maybe just plain simpletons.\nOur records, taken together, represent a rather imposing number of years in educa¬\ntional broadcasting. All of us have above the average administrative «ihii and\nability or else we wouldn’t be where we are today with our respective institutions.\nAll of us have vision. What’s more we believe wholeheartedly in this thing called\neducational broadcasting to which we have dedicated our lives and our fortunes.\nAnd the combined value of educational broadcasting installations not to mention\nyearly operational budgets represents an investment that runs into seven figures*\nI’ll admit I am a REBEL. I’m a rebel because I don’t like “daws1' hidden in velvety\npaws, thinly veiled insinuations and controls which supposedly are for certain pur¬\nposes. I want to see the last untrammeled bulwark of freedom of thought and freedom\nof speech in America remain that way.\nIf Kellogg or may other foundation is genuinely interested in furthering the cause\nof educational broadcasting in America, X think they should begin by having some\nrespect for the National Association of Educational Broadcasters and faith in the\nofficers and directors and HALS to such an extent that we don’t have to have nurses\nfeed us foundation pabXum. Maybe we’ve failed to impress them with our worth. But\nif to impress them means to bow the knee, then count me out.\nLast, I’m getting just a little tired of Wilbur’s song and dance about Illinois.\nWhy doesn’t he just come out and say: \"Look, boys, Kellogg has given this money\nto the University of Illinois to administer and NOT to MAES. Mow be good boys and\nplay the game the xvay we want you to play it or we pick up all the marbles and bow-\nout\".\nThose of you who want to say “Amen\", do so. Those who want to cuss me, may do so.\nThat’s the AMERICAN way2"
}