{
  "id": "d728-138",
  "text": "WHAT THE INSTITUTE ACHIEVED\nThe group which came together at the Institute was an extremely diverse\none. It included representatives from virtually all segments of higher educa¬\ntion, state departments of education, local public and parochial school districts,\neducational radio and television activities, manufacturers of television equip¬\nment, foundations, and the Federal Communications Commission. In the group\nthere was a wide diversity of experience in radio and television, and of opin¬\nions concerning the most practicable methods by which educational values may be\nrealized through television. In the early discussions there was a polite but\nunmistakeable air of concern that one’s own point of view might not be given an\nadequate platform. There were those who were firmly of the opinion that tele¬\nvision had no educational uses save in classroom applications, where special\n\"closed circuits\" which involve few of the complications of regular broadcasting\nchannel assignments could be used. At the opposite pole were others who had no\ninterest in TV applications of such \"limited scope\" as classroom uses. Some\nwere devoted to the importance of utilizing the \"educational reservations\"--\nthe 2k2 channels which are being withheld from possible commercial competition\nfor one year, in behalf of educational operators which would own and manage these\nstations on a non-commercial basis. Other participants were convinced that non¬\ncommercial operation was impracticable if not impossible, and that cooperation\nwith commercial stations was the \"only\" answer. And of course there were many\nparticipants who professed ignorance of the answers, who came hoping to find\nsome. Perhaps, at the outset, the one unifying characteristic of the group was\na feeling that television has effects upon viewers which are decidedly \"educa¬\ntional\", in a broad sense of the term, and that it behooves educators to explore\ncarefully the potential of this new communication device as it may be used for\npursuing the abiding objectives of our educational organizations."
}