{
  "id": "d728-141",
  "text": "demonstrated by kinescopes, film, and live production, during the initial two\ndays.\nThe Institute program was formally opened Monday morning, April 21, with a\nwelcoming address by Penn State President Milton S. Eisenhower, followed by a\nconsideration of television's meaning for education by Arthur S. Adams, President\nof the Council. Dr. Allen B. DuMont, president of the Allen B. DuMont Laborator¬\nies, Inc. then discussed some of the technical dimensions of educational tele¬\nvision, and Ralph Steetle, Executive Director of the Joint Committee on Edu¬\ncational Television, described \"Education’s Response to the Challenge of Tele¬\nvision.\" Chairman Paul A. Walker of the Federal Communications Commission then\ngave a friendly but ringing challenge to educators to respond to the opportuni¬\nties afforded by the reservation of 2^2 channel assignments for non-commercial\noperation, in a speech which is being re-played over the tape network of the\nNational Association of Educational Broadcasters.\nDiscussion at the Institute was continuous, on the informal level. On the\nformal level, discussion was fostered by dividing the participants into four\nseparate groups, each with own leaders and consultants but each discussing the\nsame agenda. After two or more hours of discussion in the smaller groups, the\nentire group would come together and the agenda would be reviewed once again,\nwith the separate group leaders and consultants constituting a panel. Within\nthis format, there were three principal areas of discussion. The first of these,\n\"The Significance of Television for the Educator\", included such topics as\nwhether television is an educational luxury or an educational essential, quali¬\nties of TV as an educational device and the like. \"Basic Planning for Education¬\nal Television\" was the second main topic, with attention given to such matters\nas FCC rules, the problem of local organization for meeting the legal require¬\nments of a station license, size of staff needed, capital and equipment costs,"
}