{
  "id": "d728-155",
  "text": "MSB HEADQUARTERS\nOctober 9, 19$2\nDear NAEB*er:\nRecently a group of NAEB’ers had a chance to discuss membership in NAEB* and more\nrecently still John Dunn and other have expressed themselves via the mails on this\ncomplex subject* I believe it is perhaps tine to outline the various points at issue\nso that you may have the total picture*\nX will attempt to give both sides of the issues even though I feel rather strongly\nabout some of these problems*\nIf I had to state the questions in very simple and concise form, I would say*\n(1) Is the basic purpose of NAEB institutional or individual?\n(2) Is there any room for individual memberships?\n(3) How can all departments of an institution be assured of equal represents*-\ntion in NAEB?\n(It) What services should NAEB perform for the individual segments of its\nmembership?\n(£) How will we support the total NAEB organisation once Kellogg funds are\nexhausted?\nEnglarging on the above, the basic philosophy of NAEB has, it seems to me, always\nbeen institutional* We have never seen ourselves in competition with the indivldial\nmembership organizations, such as AER* On the other hand, we have never turned down\nan individual applicant in the past who has evidenced some interest in educational\nbroadcasting® These people sonetines only kept their menbership for a year after\nleaving an educational institution, but at other times they have kept them for a\nnumber of years*\nI suppose there might be another sub-division here, too* Numerous institutions have\ndone no broadcasting in the past but are now interested in broadcasting, particularly\ntelevision* Some of these may never operate their own station* Some may never have\nan active production center® Some may be able to devote but a fraction of one man*s\ntime to the preparation of educational broadcasts* Whether we can legitimately rule\nout these institutions or whether thsy must show some evidence of production ability\nbefore we admit them is, to ny way of thinking, a good point for discussion* Certainly\nthe way for a small institution to start things in the educational broadcasting field\nis for it to build up interest on the part of an individual on that campus* Thus,\nyou could make a pretty good case that if a responsible person from an acceptable,\naccredited institution applied for number ship in NAEB and raarely said that he had\nan interest in educational broadoasting, lie should be allowed to join®\nThere are those in NAEB who would argue with good logic that we should admit individual\nraenbers wherever we can find them and in as great a quantity as we can get them* Thus,\nit would almost be incumbent on these people operating a large unit (such as WOI^\nWUOM, WNXC) to insist that the department heads of th&ir units take out individual\nmemberships in NAEB* It would also admit such people as those now appearing on our\nsubscriber list: representatives of comnerGial radio, of professional education, and\nof sales organizations* The argument goes that as long as these people do not have\na vote and cannot hold office, there is no reason why we can*t accept their money*\nThis, of course, might go a long way toward answering the fifth question I posed*"
}