{
  "id": "d728-174",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nOFFICE OF EXECUTIVE DIRECTOR\nUNIVERSITY OF ILLINOIS\n119 GREGORY HALL\nURBANA, ILLINOIS\nNovember 14, 1952\nAirmadl-%©ciaa Delivery\nMr# Qraydon Ausaus\nStatical WUOA\nUniversity of Alabama\nUniversity, Alabama\nDear Craydon*\n1 will try to answer the specific points in your letter of November 12*\nFirst, operational details of headquarters have in the main been left to me*\nIf I felt I needed support or advice, I vent to Sy. This was a fairly\nooma-renee. I lmagina I will not need to bother you very U**.\nwhich need policy determination can normally wait until Board or Executive\nCc^ittee meetings. All of this does not mean that I won't be calling on you\nfrom time to time and asking your advice, but I think it does mean that you\nneed not worry about this end of things# lour Job is ao involved that*\nimagine you are going to have to assure yourself that good operation is\nexisting in certain areas and then depend on it to go by itself#\nIn the past, funds have been provided forthe president's secretary,\ncalls, etc, directly between 3y and Frank. % merely made up a slip «£P#per\nindicating what the bill was and where it was to beolarged.^pt'OTedandsignBd\nit, and sent it to Frank for direct payment. I believe the contingency fund\nwas handled in the same way. However, 1 will let Frank answer more specifically\non this#\nThe minutes of the Board are fairly well along toward cce^latiOTi. IiWd\nhave them in your hands within a week. As 1 briefly review them, the only\nimaediate *>' na which needs to be dona is to order a committee to select\nFulbright grantees, You do, of course, need to select the other oosmittees.\nIn this regard, there is nothing snored about the committeealigrammt which 3y\nhas used for the last year or so. In other words, you may have as many oaa-\nmitteos as you like and call them whatever you like, too.\nWe are gradually assembling material for the Keya-Aattar. and I believe we will\nfollow aprooedure of trying to gat it out the firatof the month. I am tenter-\ntlvely biting toward a Bovembar 24 deadline for the Iboember isaue. I may *#to\nsons dhaneesln the iWe-Enttar format, but it will cover essentially the same\ntMngslt has in the pastT Inever believe in having columns or pages Just to\ns^ have them. I would be happy to have a •President's Page* or a \"Message"
}