{
  "id": "d728-198",
  "text": "Mr* Harry Skomia\n4\nDecember 24, 1952\nThere is considerable discussion regarding the relationship of NAEB and the new\nradio-television programs center* NAEB does have a member on the board of this\ncenter «nd has a strong advisory committee to the center* In addition, three\nof the first five members of the board named were presidents of NAEB institutions*\nThis is why I see the new center pulling strongly with NAEB in the future*\nMany other projects are also rather closely tied to us •— the WOI—TV workings,\nthe new Citizens Committee for Educational Television, and so on. In other words,\nthe activities are extremely numerous, but in each case NAEB is strongly represented\nand sits in the key position* I believe there is enough love for the association on\nthe part of all our members to allow us to continue in this spot if we put forth\nany effort at all*\nIf I were going to sum up this whole thing, 1 would do it with two statements made\nby good NAEB*ers* The first of these was made by George Probst after we got our\nfirst FAE show on the air* He tided diligently to convijp his opinions more\neloquently later, but nothing quite sums up the last year like his three little\nwordsi \"We made it.* The second statement which seems important to me was one\nmade by Dick Hull in a meeting in Chicago, December 5* 1952. It was made after\nthe new center was assured, and it looked like NAEB participation was going to be\nthe guiding force. I donft remember liis exact words, but the thought was that\nnow was not the time for NAEB to rest on its oars, that there was still much work\nto be done, that the next few months would be critical ones in the life of the\nassociation, and that everyone must pull Ms own part of the 4 load •\nNeedless to say, everyone to whom I have talked about our phone conversation was\nsure that you would pull your part of that load* All have strong confidence in\nyou *»:n.d know that your basic ability to get along with people and to carefully\nadminister a proposition such as this will mean continued success for NAEB in\nparticular and educational broadcasting in general.\nEnclosed are some materials I think you will find helpful* Packets such as tMs\nwill be cortdng to you more or less regularly throughout the next few months.\nExcept fqr! the tMngs which are marked •Save*, you may destroy them if you are\ncramped for sMpping space on the way home* I tMhk they will give you a better\npicture of tMs whole proposition than I have been able to do in a few words •\nNeedless 5 questions or would like to have my ideas\non any p De happy to try to answer you posthaste.\nJSMill\ncci Fran]\nSincerely,\nJim Miles\nExecutive Director"
}