{
  "id": "d728-23",
  "text": "2« Evaluation. We* ve got to have a yardstick against which to measure what\nwe are doing* Furthermore, the Foundation will require not only an annual report\nand forecast program for the coining year, but also a stricter evaluation of the\nprogram,, Why don* t you appoint a kind of visitors committee from NAEB to look\nover the project in the spring of each year and make such suggestions as they\ncan? And in the second and fourth years of the project, why not hire an outsider\n— at least an \"outsider\" like Charles Siepmann — to come in for a week, study\nthe project, and make his own report and recommendations?\n3* Take-Over. This isn*t too early to begin making plans for taking over on\na gradual basis the operating expenses of the network*\nh. Jim*s successor. Jim feels he should stay only one year* If that is\nso, and you can’t change his mind, then I think you should have a successor by\nlate next spring, so that there will be no hiatus* It seems to me you should do\none of two things: (a) Bring in one of the titans of the organization to serve\nfor a year, as Jim has done* This will be all right for one more year, but after\nthat there should be continuity* If you bring in another one-year man he should\nbe able to move to Urbana for the year, and we shall find him housing* Jim makes\nit as satisfactorily as anyone could, still keeping his home in Lafayette, but\nhe would be the first to tell you that such an arrangement has grave difficulties,\nboth for the project and more notably for the director* As another alternative,\n(b) you could bring in one of the younger men of NAEB to be director for the re¬\nmainder of the project* I think it will have to be a younger man, whose obliga¬\ntions are not so severe and whose roots are not so deep in university security and\ntenure* For a younger man, this could be a stepping stone to a great career, and\ncertainly would be if he did well in the directorship .... In appointing a\nyounger man, you would not have to think of his salary in terms of the §#000\nin the budget. In fact, it would be better to pay him less at first and boost\nhim*\nWell, I hope I can say some or all of this at the meeting, and you don’t have\nto deal with my suggestions second hand* But the weather may lick me this time,\nand if it does please give the Board my warmest greetings and my congratulations\non the way they are digging into the new problems that con» with this new era of\nNAEB.\nWith best personal wishes, I am\nSincerely yours.\nWilbur Schramm"
}