{
  "id": "d728-73",
  "text": "EXHIBIT VII\nYOU can’t afford to miss the REGIONAL CONFERENCE\nMarch 28, 29, & 30 at the University of Oklahoma, Noman<> The conference will make\neducational radio history. That’s true l But what’s even more important YCU will\nhave an opportunity of meeting and working with some of the grandest guys and gals\never. They*re all working just like YOU to make educational radio really count0\nHERE! S THE TOP BRASS FROM NAEB;\nSeymour N. Siegel, WNYC, wew York City, President of NAEB\nGraydon Ausraus, WUOA-FM, University of Alabama, Vice President, NAEB\nBurton Paulu, KUON, University of Minnesota, Secretary & News Letter Editor, NAEB\nFrank Schooley, WILL, University of Illinois, Treasurer, NAEB\nJim Miles (on leave from WBAA) Executive Director, NAEB, Ur&ana, Illinois\nACTIVE MEMBERS OF REGION V (they’ve all said they’ll be here);\nJohn W. Dunn, WNAD & WNAD-FK, University of Oklahoma, Region V Director\nRo Edwin Browne, KFKU, University of Kansas\nLucile Ruby, WLSU-FM, Louisiana State University\nBill Gemar, KMUW-FK, University of Wichita\nJim Randolph, KWGS=»FM, University of Tulsa\nRobert Do Hilgendorf, KSAC, Kansas State College\nJohn Woodworth, KOAG, Oklahoma A & K College\nVirgil Co Hicks, KVOF-FM, Texas Western College\nElaine Tuckeu, KCKH&FM, Oklahoma City ^oard of Education\nMarguerite Fleming, KSLH-FM, St. Louis ^oard of Education\nRose Jeanne Carlisle, KANW-FM, Albuquerque tiigh School\nASSOCIATE MEMBERS REGION V HAVE BEEN INVITED\nc TO DATE THE FOLLOWING ARE COKING:\nTon Rishworth, University of Texas\nJohn Bachman, Baylor University\nLowell Go Perry, Abilene Christian College\nWE HAVEN’T HEARD FROM THESE:\nSoutheastern College of Louisiana\nKansas state Teachers College\nUniversity of Colorado\nMAF' 0* ’’’HE ACTIVE AND ASSOCIATE MEMBERS APE COMING THROUGH BY CAR AND BRINGING\nSEVERAL OF mHEIR S'.’AFF MEMBERS WITH THEM. THAT’S THE RIGHT IDEA l THE MORE WE\nHAVF AT THE REGIONAL CONFERENCE, THE BETTER CONFERENCE WE’LL HAVEo"
}