{
  "id": "d728-76",
  "text": "PROGRAM SCHEDULE FOR REGIONAL CONFERENCE\nREGION V, NAEB, MARCH 28, 29 & 30, NORMAN\n1.\nFRIDAY, MARCH 28th\n9:00 a.m. - 10:00 a.m.\nREGISTRATION, WNAD LOBBY, South Wing, Oklahoma Memorial\nUnion Building\n10:00 a.m.- 12:00 noon\nOPENING SESSION, Room 165 UNION, Regional Director John\nW, Dunn, presiding\n10:00-10:05\n10:05-10:15\n10:15-10:20\nMeeting Called to Order by the Regional Director\nRoll Call for Active and Associate Members, Region V\nWelcome to tie University of Oklahoma - Carl Mason Franklin,\nExecutive Vice President, University of Oklahoma\n10:20-10:30\nAnnouncements\n10:30-11:30\n\"The State of Educational Broadcasting in the USA\" - Seymour\nN. Siegel, WNYC, President, National Association of Educa¬\ntional Broadcasters\n11:30-12:00\nQuestions and Group Discussion pertaining to President\nSiegells Message to Active and Associate Members of Region V\n12:15 p.m. - 1:45 p.m.\nLUNCHEON SESSION, Dining Rooms 2 and 3 UNION, Vice President\nGraydon Ausmus, WUOA, presiding\n1:00—1:40\n\"Public Relations for Educational Broadcasters\" - George W.\nChurchill, Director of Public Relations, University of\nOklahoma\n2:00 p.m, — 4:00 p.m.\nAFTERNOON SESSION, Room 165 UNION. General Theme: NAEB\nComes to the Grassroots. Regional Director John W. Dunn,\npresiding.\n2:00—2:45\n\"Bringing NAEB Up to Date for Regional Members\" - NAEB\n2:45—3:00\nTreasurer Frank Schooley, WILL.\nQuestions from the Floor on NAEB\n3:00—3:45\n\"NAEB Headquarters and NAEB Tape Network Operation\" - Jim\n3:45—4:00\nMiles, WBAA, Executive Director, NAEB\nQuestions from the Floor on Headquarters and Tape Network\nNOTE:\nSince a great number of delegates in attendance will not\nhave had an opportunity to check in earlier, the afternoon\nsession will close around 4:00 p.m.\n6:30 p.m. — 8:30 p.m.\nDINNER SESSION, Dining Rooms 2 and 3 UNION, Regional Direc¬\ntor John W. Dunn, presiding\n7:30—8:15\n\"The Free World vs Communism\" - Dr. M. L. Wardell, David\nRoss Boyd Professor History, University of Oklahoma\n8:30 p.m. - 10:00 p.m.\nWE GET ACQUAINTED, West Lounge of the Union\nWNAD OPEN HOUSE Coffee Served in Studio A\nSPECIAL AUDITION of NAEB SHOW—Room 160 UNION"
}