{
  "id": "d728-95",
  "text": "naeb headquarters\nla9 David Kinley Hall\nMarch 19, 19$2\nMEMORANDUM\nTO* The Executive Committee\nFSOMi The Director of Studies\nSUBJECT* Research Agenda for the Norman Meeting, March 27.\nThere are three important items which I think you should deal with at the\nNorman meeting which relate directly to research*\n(1) Comments on final request to Fund for Adult Education for the 1952-53\nfiscal yearo I have twice invited members of the Research Committee to comment on\nthe proposals presented in Mr. Pzobst’s January 3 letter to Mr. Fletcher and to offer\nany additional proposals which seemed to them to be desirable. Up to date, I have\nreceived comments in detail only from Bob Coleman. He concurs in Items 1, 2, 3, and\n9 in Mr. Probst’s letter. He is dubious about Item !*, and he regards Item 6 as a\nmatter of operations rather than research.\nMy own views are expressed only with respect to the following entries in\nthe tentative estimates attached to Mr. Probst’s letter*\nTV Monitoring Project. I think the textual justification\nfor this item should be spelled out much more positively than it is\nin Mr. Probst’s letter. A casual reading of his letter might give\nthe impression that we rate this project rather lew.\n\"The People Look at TV.\" It seems to me that the final\nproposal shouid provide somo explanation of this sizable project,\nand there is no explanation in Mr. Piobst’s letter. I would be\nglad to prepare a half-page explanation of the scope, procedure,\nand significance of the study if the Executive Board so desires.\nQualitative Analysis. No comment.\nDiary Studies. No comment.\n(2) Proposal for Research Program on Kellogg Grant for 19H>2”li>3. On March\n9, I transmitted to the Research Comnattee w^ all NAEB officers and Board\nmembers a memorandum with this title. Ity recommendation is that when the budget for\n19£2-S3 on the Kellogg Grant comes under consideration by the Executive Board or the\nwhole Board these proposals should be discussed and if possible adopted. In response\nto my circularization of the proposal, I have heard comments from Mr. Paulu and Mr.\nColeman. Both of them concur in approving of my Project #1 (in the March 5>th memo¬\nrandum). On Project #2, Mr. Coleman feels that this is ’’essential if the NAEB net¬\nwork is to serve the nember stations to the fullest degree.” Mr.Paulu feels that\nthis project \"is also good, but I am less enthusiastic about it then about the other\none.\" Jfyr own feeling is that both of these projects are essential to the fulfill¬\nment of the c omraitments given the Kellogg Foundation in applying for the grant, and\nfor a proper evaluation of operations under the grant®"
}