{
  "id": "d173-15",
  "text": "1-16\nNARR:\nOCCASIONAL\nMARINERS3\nTOC;\nHARR:\nSo far. we have seen the daily life of New York City; but now we are\nin for something special. It is May the eleventh, eighteen thirty\none; and on the deck of the President, having just come down from New¬\nport, there stand two young men; both well dressed after a rather\nquiet European fashion; both have long dark hair, in the fashion of\nthe day: both have eager darting eyes; although both seem very tired\n(they have been without sleep for some time). They are surrouneded by\nSHOUTS luggage and they glance back and forth at the city, and the sea; and\nthe green fields that surround it, as if they were strangers from an¬\nother planet that had never seen the earth before. They axe strangers;\ncome from France to see this curious new land that is supposed to be a\ndemocracy. This one, aged twenty six, is Alexis Charles Henri Glsrel\nde Tocqueville, son of a French count. He is already turning over\nin his mind how he will describe this new country he is visiting:\nAs for the harbour and the city itself, wall, picture to yourself\nan attractively varied shoreline, the slopes covered by lawns and\ntrees in bloom right down to the water, and saore than all that, an\nunbelievable multitude of countly houses, big as boxes of candy, but\nshowing careful workmanship: add to .this, if you can, a sea covered\nwith sails, and you will have .the entrance to the city from the water0\nI am much struck by how convenient these little houses must be, and by\nthe attractive air they give the countryside. Such is cur first im¬\npression of the city of New York,\nBeside young Mr. de Tocqueville stands his great friend, also a French\nnobleman; but three years older. This young man, wearing a cloak, is\ntwenty nine. His name is Gustave Auguste de la Bonniniere de Beaumont.\nHe too is glancing about, and turning over what to ssy when he writes\nhome:\nAt each instant you glimpse great bays Which cut into the chores and\nBEAUMONT:"
}