{
  "id": "d1198-1",
  "text": "page 2\nCayer, Mrs. David, Chr., Comm. Radio Council, Winston-Salem, N.C.\nChak, Leo J., Grad. Student, Ohio State University, Colurahus 10,Ohio.\nChase, W. Linwood, Prof, of Edu., Boston University School of Edu., Boston 16.\nChurch, Chas. F. Jr., Edu. Dir,., Radio Sta. KMBC, Kansas City 6, Mo.\nClark, Agnes N., Women's Prog. Actv., WJR, Detroit 2, Mich.\nClarke, Lucille, Radio Chief, Am. Red Cross, New York 10, N.Y.\nCline, Wm. R., Sta. WIS, Chicago, Ill.\nColeman, Wra. A., Dir., Radio Div., Dept, of Comraun. Arts, Fordham Univ., Bronx 58\nCollins, Neil, Pub. Relations Acct. Exec., Byer & Bowman Adv. Agency, Columbus 15-\nCollins, Sid., Prog. Director, WKMO, Kokomo, Ind.\nCooper, John M., Sales Dept. INS, New York 17, N.Y.\nCorey, Victoria M., Edu. Dir., KDKA, Grant Bldg., Pittsburgh, 19-\nCott, Ted, Dir. of Prog & Operations, WNEW, New York 22, N.Y.\nCoulter, Graham T. Asst Ed., Va. Agr. Ext. Ser., Blacksburg 12, Va.\nCousino, Bernard A., Pres. Cousino Visual Edu. Ser., Inc., Toledo 2, Ohio.\nDarby, Clella E., Director, Des Moines Radio Council, Des Moines 11, Iowa.\nDavis, Ann, Dir. of Women's Activities, WGKR, Charleston, W. Va. (N.Y.\nDemorest, Charlotte, Dir., Radio Workshop, Briarcliff Jr. College, Briarcliff Manor,\nDenison, James H. Adm. Asst, to Pres. Michigan State College, E.Lansing, Mich.\nDick, Elsie, Dir., Edu. Programs, Mutual Broadcasting System, New York 18, N.Y.\nDoha, Norman H., Instructor in Radio Writing & Speech, Otterbein College,Westerv.0.\nDonnell, Philip Stone, Dean of Engr., A & M College, Stillwater, Okla.\nCorn, Jack, Student at South High School, Columbus, Ohio.\nDruce, Olga, Dir., Benton Sc Bowles, Inc., New York 22, N.Y.\nDuell, George, Student at South High School, Columbus, Ohio.\nv^ast, Charles M. Co. Agl. Agent, Floyd Co., New Albany, Ind.\nEaton, Tom, News Dir., WTIC, Hartford, Conn.\nSberhardt, Cherie A., Dept, of Edu., University of Detroit, Detroit, Mich.\nEbert, Arnold C. Dir. Agl. Programs, KOAC, Corvallis, Oregon.\nEckelberry, Roscoe H. Editor & Prof., Ohio State University, Columbus 10, Ohio.\nEllis, Caroline, Commentator, KMBC, Kansas City 6, Mo.\nEwing, William H., Prog. Supv., WOSU, Ohio State University, Columbus 10, Ohio.\nFay, William A., V. Pres., Stromberg Carlson Co..WHAM-FM, Rochester 4, N.Y.\nFaulkner, Anne I., V. Pres. & Sec’y. Gloria Chandler Recordings, Inc. N.Y. City.\nFillis, Ben E., Jr., Asst. Chief, Midwest Area, USDA, PMA., Chicago 3, Ill.\nFlaherty, Jane, 0., Asat. Promotion Dir. WIBC, Indianapolis 6, Ind.\nFlatow, Natalie, Radio Director, Girl Scouts, N.Y. 17, N.Y.\nFleming, Marguerite, Teacher, Radio and Dramatics, South High School, Columbus, o.\nFrank, Josette, Edu. Adviser to Superman, Inc., New York 17, N.Y.\nFranklin, Harold, Prog. Dir., Institute for Democratic Edu., New York 17, N.Y.\nFranken, Jerry, Radio Editor, The Billboard, New York City.\nFred C. Frey, Acting Pre3., Louisiana State University, Baton Rouge, La.\nFry, Evan A. Radio Dir., Reorganized Latter Day St. Church, Independence, Mo.\nLF^ye, Grace Hare, Exec. Dir., Columbus Town Meeting, Columbus, Ohio.\nFrye, Homer E., Gen. Mgr., Cols. Better Bus. Bureau, Inc., Columbus 15, Ohio.\nFunnell, Mildred, Director, Women's Activities, WTAM, Cleveland 14, Ohio.\nGabbard, Bessie F., Asst. Prin, Linwood School, Cincinnati 26, Ohio.\nGail, Harry R._, Pub. Rept., School Ser., Westinghouse El. Corp., Pittsburgh 30, Pa.\nGapen, Kenneth M., Asst. Dir. of Infor., U.S.D.A., Washington 25, D.C.\nGarrigus. Frederick H., Asst. Prog. Mgr., Edu. Dir., Columbia System, Boston 12,\nMass."
}