{
  "id": "d1198-13",
  "text": "page 2\nDabney, Mary K., Pub. Relations, Community Cheats, New York City 17\nDaly, Ranny, Prod. Dir., WING, Dayton 2, Ohio\nDaly, Rita, WING, Dayton 1, Ohio\nDay, Charles R., News Dir., WEAR, Cleveland, Ohio\nDay, Dorothy, Dir. of Women's Activities, WJW, Cleveland\nD.*Benedetto, Julia (Student) OSU, Columbus, Ohio\nDewatt, Mary J. (Student) Radio Workshop, Denison Univ., Granville,\nDingley, Dorothy (Student), New York, N.Y.,\nDinwiddie, Joel C., Instructor, Stephens College, Columbia, Mo.\nDohn, Norman H., (Student) OSU, Westerville, Ohio\nDolhar, Louis (Student), Kent State Univ., Kent, Ohio\nDowling, Fred R., Dir. of Radio, Ohio Wesleyan Univ., Delaware, Ohio\nDozer, Clark L. (Student), OSU, Columbus, Ohio\nDuffy, Ann, WHKC, Columbus, Ohio\nDeshler 1568\nDe shier 1875\nDeshler 520\nOhio.\nDeshler 421\nDeshler 624\nDeshler\nU^ngel, Harold A., Asst. Dir. WHA, U. of Wis., Madison, Wis.\nEngel, Luella, Farm Dir., Fort Ham. Broadcasting Co., Hamilton, Ohio\nEvans, Emerson, Instructor in English, OSU, Columbus, Ohio\nEverson, Carl M., W.Pres & G. Mgr., WHKC, Columbus 15, Ohio\nFay, Sara A., Instructor in Radio, Stephens College, Columbia, Mo. Deshler 84l\nFeddersen, Donley F., Chr. Radio Dept., Northwestern University,Evanston 1177\nFedorka, Frank (Student) Kent State Univ., Kent, Ohio PeS!^er 10 ^\nFerris, Earle, Pres., Natl. Assn, of Pub. Relations Counsel, New York Deshler\nFish, Mrs. Fenton 0., Dir., Ohio Council of Church Women, Columbus 6, Ohio\nFleming, Catherine T., Instr. in Radio, St. Louis University, Mo. Neil House 5^0\nFolpe, Norman (Student) OSU, Columbus, Ohio\nFoltz, Miriam R., Home Ec. Radio Editor, WOSU, Columbus 10, Ohio\nFord, Robert H., Charge of Radio, College of Agl., Univ. of Ky.,Lexington-N.H. 77&\nForman, Jonathan, Editor,Ohio State Med. Assn., Columbus, Ohio\nFoth, Edith E., (Student), Miami University, Oxford, Ohio Fort Hayes 5\nFox, Frances I. Radio Writer, Farmers Home Adm., Wash. D.C., Fort Hayes 5\nFrost, Dorothy M. (Student), New York 27, N,Y. * 2\nFulkerson, W. Kenneth, WHEC, Rochester 11, N.Y.\nGatliff, Edwin, Narrator of Nature, WMOH, Hamilton, Ohio\nGertz, Sally (Student), OSU, Columbus, Ohio\nGist, (Mrs.) Wm. C,, Wellsburg, W. Va.\nGoddard, Bette L., H. Ec. Ext. Rep., Ext. Service, Butler, Pa.\nGratke, Paul, Chief, Dept, of Ed., Milwaukee 7, Wis.\nGreenfield, Stanley R., Pub. Relations Dir., Students' Org., Chicago\nGrove, Elsie, Teacher, Home Ec., S. High School, Columbus 6, Ohio\nNeil House 282\nDeshler 627\nDeshler 347\n37, HI-\nHanson, Eleanor, Dir. Women's Activities, WHK, Cleveland 13, Ohio\nHanson, Mrs. Nelle G., Cleveland 20, Ohio\nHarm, Robert L., Kent State Radio Workshop, Kent, Ohio (Student)\nHarrington, Evaline, 880 E. Broad St., Columbus, Ohio\nHart, Esther R., H. Ec. Ext. Rept., Pa. State College, State College,\nHarter, Martha L., (Student), Denison University, Granville, Ohio\nHawthorne, Mrs. Wm. B., Radio Council, Cleveland 6, Ohio\nHeathman, Jessie E., Asst. Ed., Univ. of Ill., Urbana, Ill.\nHj^fferman, David J., Supt. of Schools, Chicago, Ill.\n'Hester, Harriet H., Am. Medical Assn, Chicago 10, Ill.\nFort Hayes\nFort Hayes 1217\nDeshler 718\nPa. N.H. 179\nDeshler 735\nDeshler\nDeshler 1356\nDeshler 1347\nDeshler 1768"
}