{
  "id": "d1198-3",
  "text": "page U\nf>atrtp»f^erinan P., Coordinator of Radio, Univ. of Oklahoma, Norman, Okla.\nHarold H., Dir., Radio Service, Oklahoma A & M College, Stillwater, Okla.\n\" lesourd, Howard M., Dir., Institute for Dem. Edu., New York 17,\nlesaure, Mrs. Morris N., State Radio Chr., Am. Legion Aux\nLevin, Sylvan, Music Dir. WOR, New York l8, N.Y.\nLierle, Dean. Jr. M., Student, State University of Iowa, Iowa City,\nLippincott, Ruth, Teacher of Music, South High School, Columbus,\nLondon, Howard J., Dir. of Radio & Motion Pictures, Natl. Foun.\nWgT'Chet., WBNS, 33 North High Street, Columbus, Ohio.\nVCo^tridge, Buryi, V. Pres 'and Gen. Mgr., Tri-City Broadcasting Co., Davenport,la.\n^uke, Robert A., Exec. Secy., Adult Edu. Council of Met. Cin.\nLytle, Harry C., Program Director, WMAN, 1-fens fie Id, Ohio.\nN.Y.\nZanesville, Ohio.\nIowa.\nOhio.\nof I.P., New York.\nCincinnati 2, Ohio.\nMcIIatton, Martha A., Radio Editor, Indianapolis News, Indianapolis 6, Ind.\nMcKim, Judson J., Dir. of Ed. & Religious Programs, WKRC, Cincinnati 6, Ohio.\nMcStea, Elizabeth M., Dir. of Pub. Relations, New York 16, N.Y. (Camp Fire Girls)\nMadsen, Mrs. Esther M., Dir. of Radio, NAT1. WCTU., Evanston, Ill.\nMahoney, Robt., News Editor, Inti. Broadcasting Corp, KWKH, Shreveport 92, La.\nMall, Richard M., Head, Radio Section, Kansas State College, Manhattan, Kans.\nMarkel, Hazel Kenyon, Edu. & Pub. Ser. Dir., Col. Broadcasting System,WTOP, Wash.7\nMartin, Festus H., Asst. Forester, Inf. & Edu,, Ark. Div. of Forestry, Little\nRock, Ark.\nMartz, Homer H., Agricultural Dir., KDKA, Pittsburgh 19, Pa.\nMi^es\", Jim S. Director WBAA, Purdue University, West Lafayette, Ind.\njxMiller, Allen, Dir., Rocky Mt. Radio Council, Denver 2, Colo.\nMiller, Ruth Weir, Edu. Dir., WCAU, CBS Sta., Philadelphia 3, Pa*\nMiller, Neville, Radio Attorney, Miller & Schroeder, Washington h, D. C.\nMinsky, Louis, Managing Editor, Religious News Ser., New York 16, N.Y.\nMoody, Tom, 979 E. Livingston Ave., Columbus 6, Ohio.\nMoop»«f^Sortense, Dir. of Radio, Miami Univ., Oxford, Ohio,\npfcl'rgan, Williams., Prog. Dir., WNAD, Univ. of Oklahoma, Norman, Okla.\nMorris, James M., Program Mgr., Radio Station KOAC, Corvallis, Oregon.\nMoses, John B., Program Dir., WHKC, Columbus, Ohio.\nNeal, Nathan A., Supervisor, Eng. Service, WBOE, Bd. of Ed., Cleveland 14, Ohio.\nNewsom, Philip S., Radio News Manager, United Press Assns, New York 17, N.Y.\nNicholson, Anne P., Free Lance Radio Script Writer, Chicago, Ill.\nNolan, Catharine E., Exec. Secretary, Community Radio Exchange, Buffalo 2, N.Y.\nO'Kollaren, Bill, Continuity Editor, WOW, Omaha 2, Nebr.\nOlpin, A. Ray, President, University of Utah, Salt Lake City, Utah.\nOram, Richard G., Prog. Director, WRRN, 108 Main St., Warren, Ohio\nOrr, C. Richard, Instructor of Radio, Denison University, Granville, Ohio.\nOstrom, JohnW., Asst. Prof., Wittenberg College, Springfield, Ohio.\nOwen, Forrest F., Pub. Relations and Prog. Director, WELL, Battle Creek, Mich.\nPage, Thomas J., Farm Frog. Dir., WNBC, 30 Rockefeller Plaza, N.Y. 20, N.Y.\nPaltridge, J. G., Pres, KGIL, San Fernando Valley Broadcasting Co., Sherman Oaks\nParker, Mrs. James C.,Pres.,Natl.Council,Camp Fire Girls, Grand Rapids, Mich\\ 031X1\nParkinson, Geer, WBNS, 33 N. High Street, Columbus, Ohio.\nParsons, Edgar, Acting Mgr., WRFD, Columbus, Ohio.\nParsons, Robert H., Dir., Radio Dept., Moody Bible Institute, Chicago 10, Ill.\nPatterson, George C., Program Manager WAVE, Louisville 2, Ky."
}