{
  "id": "d1198-4",
  "text": "paf?e 5\nPerry, George, Instructor in Radio Technique, Marywood College, Scranton 9, Pa.\nPettegrew, C. W., Exec. Sec'y, Junior Town Meeting League, Columbus 15, Ohio.\nPfautsch, Wayne, Student at South High School, Columbus, Ohio.\nPfeiffer, Vera B. (Mrs.) Asst. Prin. & Teacher, Denby H.S., Detroit 6, Mich.\nPlxley,JU A., Owner-Executive, WCOL, Columbus 15, Ohio.\nPr^trf'GeraId, Student, South High School, Columbus, Ohio.\nA-PIrescott, Herbert L., Dir. of Publicity & Radio, Grinnell College, Grinnell, Iowa.\nQuigley, A. Adele, Sec'y to Mr. London, Natl. Foundation for I.P., N.Y. 5, N.Y.\nQuigley, Harold J., Minister, Ninth Pres. Church, Troy, N.Y.\nRachford, Helen Fox, Dir., Audio-Visual Edu., County Schools, Los Angeles 12, Cal.\nRademacher, Isabel B., Radio Chr., Lindblom Technical H.S., Chicago, Ill.\nRanson, Jo,, Publicity Dir., WKN, 15^0 Broadway, New York 19, N.Y.\nReeves, Jerome R., WBNS, 33 N. High St., Columbus, Ohio.\nReich, J. E., Edu. Dir., W0W0, Ft. Wayne 2, Ind.\nRenfro, Harry K., Dir. Pub. Re la tions ,ICX0K, St. Louis 1, Mo.\nvRSynold3, Dana D., Spec, in Information Radio Service, USDA, Washington 25, D.C.\nRipMrd3on, Robt. Noble, Jr., Grad. Asst., Michigan State College, East Lansing. '\n✓ffishworth, Thomas D., Dir. of Radio House, University of Texas, Austin 21, Texas.\nRitchie, Douglas E., Dir. of Press and Radio, British Inf. Ser., New York 20, N.Y.\nRitchie, Wells, Supvr. of Press & Inf. Service, Canadian Broadcasting Corp.,\n35^ Jarvis St., Toronto 5, Ontario, Canada.\nRitter, Robt. P., Program Director, WSAM, Saginaw, Mich.\nRobinson, Mrs. Edward L., Jr., Jr. League of Buffalo, Inc., Buffalo, N.Y.\nRoby, Elizabeth R., Counsellor, N.Y. City Public Schools, Brooklyn, N.Y.\nRoeder, Chas. A., Asst. General Manager, WCBM, Community House, Baltimore 13, Md.\nRoeder, Lucile L.., WCBM, Community House, Baltimore 13, Md.\nRogers, Dorothy L., Publicity Director, Comm. Chest of Cinti, Cincinnati 2, Ohio.\nRosenberg, Albert J., Mgr., Text-Film Dept., McGraw Hill Book Co., New York l8,N.Y.\nRosser, Pearl, Director of Radio Edu., Int. Council of Religious Edu., Chicago 1.\nRowse, Donovan, Special Asst, to N.A. Director, British Broadcasting Corp.,N.Y. 20.\nL/Jtaby, Lucile, Program Director WLSU, Louisiana State University, Baton Rouge 3,La.\nRutherford, Grace M., Audio-Visual Dept, of City Schools, Amsterdam, N.Y.\nSareyan, Alex, Mgr., Promotion and Interpretation, Natl. Mental Health Foundation,\n1520 Race St., Philadelphia 2, Pa.\nSaunders, Betsy I., Exec. Sec'y, Comm. Radio Council, High Point, N.C.\nSayler, Allen W., Radio Rep., VAW-CIO, Detroit 1, Mich.\nSchalinske, Theodore, Dean of Men, Capital University, Columbus, Ohio.\nSchechter, A. A., V Pres., In charge of News, Mutual System, New York l8, N.Y.\nSchimmel, Robt. C., Radio Coordinator, Boston Public Schools, Boston 15, Mass.\nSchooley, Frank E., Asst. Dir., Will Univ. of Illinois, Urbana, Ill.\nLeprfD. Schooler, Dir. of Radio. Roosevelt College, Chicago 13, HI.\nygeaman, Gerald L., Radio Exec., Bert s. Gittins Advertising, Milwaukee 2, Wis.\nSerota, Samuel, Educational Director, WIP, 35 S. 9th St., Philadelphia 7, Pa*\nShackson, L. Lee, Chr., Comm, on Audio-Visual Aids, Otterbein College, Westerville\nSharp, Fern, WBNS, 33 N. High St., Columbus, Ohio\nShelley, .John D. ’'Jack” News Manager, WHO, Des Moines 7, Iowa.\nSholL^'itarry, Director, Public Rel., Cinti & Hamilton Co. Red Cross, Cincinnati 2.\nSi^el, Seymour N., Dir. of Prog., 1/NYC, New York 7, N.Y.\nyg^epmann, Chas. A., Chr., Dept, of Communications in Edu., N.Y. Univ., New York.\nSittig, John H., 980 Miller Ave., Columbus 6, Ohio (OSU)."
}