{
  "id": "d1198-9",
  "text": "Page 3\nHochheimer, Rita, Asst. Dir., Bd. of Ed., Brooklyn, N.Y.\nHoffman, Marion R., Student, Mich. State College, E. Lanaing\nHogan, John F., Neva Dir., Me. Broadcaating System, PortaInd\nHove11, Rex, Mgr. KFXJ, Grand Junction, Colo.\nHudson, Robt. B., Dir. of Ed. CBS, New York 22, N.Y.\nIrvin, Ruth Beckey, Sup.\nIvea, Almon B., Sec'y, D\nState Dept, of Ed., Columbus, Ohio\nDeshler\n1060\nDeshler\n460\nMe.\nDeshler\n326\nSeneca\n238\nN.Y.\nDeshler\n1555\n, D.C.\nDeshler\n1241\n, N.H.\nDeshler\nN.Y.\nDeshler\n1023\nJonea, Edvard C., Instructor, Syracuse University, Syracuse 1\nJapoba, Leland B., Aaat. Prof, of Ed., OSU, Columbus 8, Ohio\nixfohnsen, Grace M., Mgr. Continuity Acceptance Am. Br. Co., Nev York 20 Deshler 1472\nJohnson, George C., Dir., Radio Education, Indiana Univ., Bloomington Deshler\nJohnson, Soulard J., Aaat. Gen. Mgr. CBS, St. Louis, Mo. Deshler\nJonea, Bette M., Student, U. of Minn., Minneapolis 14 Deahler\nJones, Mary S., V Prea., Middle Tenn. Radio Council, Brentwood, R l,Tonn.\n424\n737\nKay, Warren C., Radio Aaat., Phila Pub. Schools, Phtla. 47, Pa. Deshler 428\nKearful, Mrs. Viola S., Prea. Saginaw Radio Council, Saginaw, Mich.\nKearney, Margaret Mary, Chr., Phila. Catholic Schools, Philadelphia,Pa.Deahler 925\nKellogg, Dorothy, Aaat. Supv. Radio Ed. Bd. of Ed., Toledo 2, Ohio Neil House 517\nKemble, Dorothy A. Dir. Continuity Acceptance, MBS, New York Deshler 954\nKempton, Willett, Dir. U.S.D.I., Washington, D. C. Deshler\nKiernan, Frank, Exec. Dir, N.Y. T.B. & Health Assn., New York l6 D?shler 328\nKnight, T.S., Prea.,Empire Crafts Corp., Newark, N.Y. Bsahler\nKroggel, Ray P., Ed. Rept. Radio Corp. of Am., New York, N.Y. Deahler 1348\nLabbitt, Myrtle E., Women's Editor, CKIW, Detroit 26, Mich. Deshler 1066\nLaHay, Wauhillan, Radio Publicity Dir.,N.W. Ayer & Son, New York City\nlahr, G. Roy, Coordinator, Battle Creek Pub. Schools, Battle Creek,Mich.Deshler 640\nLakeman, Mrs. Mary B., Natl. Radio Chr. Am. Leg. Aux., West Springf.,Maas.\nLamb, Harry D., Dir., Radio-Visual Ed., Toledo Pub. Schools, Toledo Neil House 522\nLambert, Richard S., Supv. of Ed. Broadcasta,Can.Brdctg. Corp., Toronto Deshler 636\nx^^.on, Sherman, Coordinator of Radio, Univ. of Okla., Norman, Okla. Deshler\nv^e'rch, Jr. Donald G., Dir. of Agr. CBS, Washington, D. C. Deshler\nV^Levenson, Wm. B., Directing Supvr,,WB0E, Cleveland, Ohio Deshler 1476\nLockard, Willard M., 2111 Tuller St., Columbus, Ohio (WCOL)\nlyon, Don W., Production Director, Syracuse Univ. Radio Wrkshp,Syracuse Deshler 1QL8\nMacdonald, W.(Bill) E., Farm Service Director KFAB, Lincoln 1, Neb.\nMacFarland, Barbara S., Sales Promotion CKLW, Detroit, Mich\nMcCarthy, Florence C. Dir., Utica Pub. Schools, Utica 3t N.Y.\nMcCrum, Thomas K., Purdue University, W. Lafayette, Ind.\nMcCuskey, Alice E., WOSU, Columbus\nMcHatton, Martha A., Radio Editor, Indianapolis News, Indianapolis 6\nMcHugh, Olive E., Chief of Evaluation, Toledo Bd. of Edu., Toledo 2\nMcKenrie, F. G., Dir., Australian Govt., New York,\nDeshler\nDeshler\nDeshler 1105\nDeshler 923\nNeil House 529\nDeshler 1136\n^Mahan, Bruce E. Dir. Ext. Div. Univ. of Iowa, Iowa City, Iowa\nM^rkey, Paul R., Student, OSU, Columbus, Ohio\nV/tfiartin, Leo, Head. Dept, of Radio, Univ. of Alabama, Tuscaloosa\nDeshler 1678\nDeshler 1223"
}