{
  "id": "d1592-13",
  "text": "NAEB News Letter....Sept. 15, 1989 Pag© 14\ncopying the commercial stations, instead of launching forth on new\na©Q8o But undoubtedly, againt I am wrong.\n«X heartily dislike speeches which seem to b© destructive in their\nattitude but in spite of all the constructive things I have stated\nhere, I cannot, for the life of me, see how an educational radio\nstation can hope to gain general acceptance faced with economic\ninsecurity.\nwAfter all it is not just a question of building better educational\nshews or training educators to become better radio speakers; it is a\nquestion of providing good radio to the public as a whole every hour\nof the day or night during its operation, whiesh mean® quality programs\nwhich means money - or 1 would not car© to run it. And 1 still have\nto be shown how that can be don©0^\nFollowing the talk a lengthy discussion of problems ensued* Then\ncame a report by Dr. Leonard Power of the United States Office of\nEducation. H® told mostly of the research h© is carrying on for the\nOffice of Education, in connection with the work of the Federal Radio\nEducation Committee. Dr. Power is Consultant for the committee and\nassistant to the chairman. A review of the work of the committee will\nbe found in the packet.\nTOUR AMD BANQUET\nWith vasts expanded Professor Griffith and W. E® Stewart guided the\ndelegates around the present WOX establishment and then to the new\nService building, which will contain new studios, controls room,\noffice facilities, and transmitter. Everything will be up-to-date w\nwhen finished. Th© product is further evidence of the support being\ngiven the educational radio stations by their own institutions.\nAt the banquet, held in Memorial Union, an RCA television camera was\non display and th© possible future uses.of television and facsimile\nin education were explored by an RCA representative. Following the\nbanquetg a number of important committee meetings were held. A\nfew of the engineers confabbed a bit, tdo«>\nROUNDTABLES\nOpening the Saturday morning session, with Jo© Wright, WILL, presiding,\nwas th© report of th© recording machine test committee. A.James Ebel,\nChief engineer of WILL and chairman of the committee mad© the report\nand distributed copies to those present. Others have since been\nmailed copies of th© report. There followed the prepared talk of\nDr* Lazarsfeld.\nDBo LALaRSFEDD ON RESEARCH\nUnable to be present, the paper on \"What Should Research Do for\nEducational Broadcasting* by Dr. Paul F. Lazarsfeld, Office of Radio\nResearch, was presented to the convention by Prof. Griffith. The\ntext follows;\n\"You probably know that a number of educational stations have had"
}