{
  "id": "d1592-18",
  "text": "SUNDAY MORNING\nReview of the Year in Religious Radio, Highlighted by Transcribed Excerpts.\nEverett C. Parker, Director, Joint Radio Commission of Congregational-\nChristian, Methodist and Presbyterian U.S.A. Churches\nPanel Participants\nElsie Dick, Director of Religious Broadcasts, Mutual Broadcasting System\nElinor Inman, Director of Religious Broadcasts, Columbia Broadcasting System\nWilliam Smith, Acting Director of Radio, National Council of Catholic Men\nRoss Snyder, Professor of Religious Education, Federated Theological Faculty, University of\nChicago\nDiscussion\nProfessional Training for Radio\n9:00 a. m., Room 1440, Deshler\nChairman, Armand L. Hunter, Chairman, Department of Radio, Northwestern\nUniversity; and Director, Northwestern University-NBC Summer Institute\nA continuation of the Saturday session (see page u for detailed program)\nSUNDAY AFTERNOON\nGENERAL SESSION\nRadio Faces the Future\n11:50 a. m.. Ballroom, Deshler\n(Doors closed at 11:58 a. m.)\nThis session examines radio’s responsibilities in the light of two challenges: the program report\nof the Federal Communications Commission and the implications of atomic energy. The first\nportion of the program, a broadcast of The People’s Platform, opens up the questions raised\nby the FCC report, in preparation for a more complete discussion at the Annual Institute\nDinner. The second portion of the session will include both a broadcast of the University of\nChicago Round Table and a discussion of the implications of the material of this broadcast so\nfar as broadcasting is concerned. This session also provides an opportunity for the audience\nto observe and compare, side by side, two outstanding network discussion programs.\nA. Will Government Supervision Improve Radio Programs?\nAn Origination of The People's Platform—a Modified Radio Debate over the net¬\nwork of the Columbia Broadcasting System, 12:00-12:30 EST.\nSydney M. Kaye, Executive Vice-President and General Counsel, Broadcast\nMusic Incorporated\nCharles Siepmann, New York University, Author of Radio’s Second Chance\nLyman Bryson, Director of Education, Columbia Broadcasting System,\nChairman"
}