{
  "id": "d1592-19",
  "text": "SUNDAY AFTERNOON\nB. The Implications for Radio of Atomic Energy\nProgram Arranged by Radio Office, University of Chicago\nThe Implications of Atomic Energy — A University of Chicago Round Table\nDiscussion\nThe basic material for this session will be presented through an origination of the weekly\nUniversity of Chicago Round Table program over the National Broadcasting Company. The\nbroad implications of atomic energy will be discussed by three outstanding scientists. The\nactual broadcast will be from 12:30 to 1:00 p. m., EST.\nReuben Gustavson, Vice-President, University of Chicago\nHarold Urey, Winner of the Nobel Prize, and Distinguished Service Professor\nof Chemistry, University of Chicago\nJoyce Stearns, Dean of the Graduate School, Washington University\nWhat Are the Implications for Radio?—A Panel Discussion\nParticipants\nClifford J. Durr, Commissioner, Federal Communications Commission\nCharles Siepmann, New York University, Author of Radio’s Second Chance\nKarl Wyler, Manager, Station KTSM, El Paso\nDiscussion from the Floor\nSPECIAL SESSION\nTelevision and Education\nProgram Arranged by Television Broadcasters’ Association, Inc.\n3:30-5:00 p. m.. Hall of Mirrors, Deshler\nPresiding, Kenneth Bartlett, Acting Director, School of Adult Education, Syracuse\nUniversity\nStatus and Prospects of Television\nWhat Is Status of Television Today? Richard Hubbell, Production Manager and Television\nConsultant, Crosley Corporation—WLW, Cincinnati\nWhat About Programs? Noran E. Kersta, Manager, Television Department, National Broad¬\ncasting Company\nWhat Are the Prospects for the Future? B. Ray Cummings, Vice-President In Charge of\nEngineering, Farnsworth Television and Radio Corporation\nWhat Does Television Mean to Education?—A Panel Discussion\nLyman Bryson, Director of Education, Columbia Broadcasting System\nRobert Child, Stations WGY and WRGB, Schenectady\nWilliam H. Ewing, Program Supervisor, Station WOSU, Ohio State University\nWallace S. Moreland, Assistant to the President, Rutgers University\nNathan M. Rudich, Production Manager, Station WNYC, New York; and Chairman, Radio\nand Television Department, New School for Social Research\nI Edward Stasheff, Director of Television, New York City Board of Education\n[Discussion from the Floor"
}