{
  "id": "d1592-22",
  "text": "NAEB News Letter.«..Sept. 15, 1939 Page S3\nFrom 1929 to 1934 MT. Fly served as a Special Assistant United States\nAttorney General acting as government counsel in actions in volving\nrestraint of trade under federal anti-trust laws and regulatory\nmeasures under commerce power.\nIn 1934 Mr« Fly became general solicitor and head of the legal depart¬\nment of the Tennessee Talley Authority, and serced in this capacity\nuntil 193? when he became general counsel of the Tennessee Talley\nAuthority.\nPresident Roosevelt nominated Mr. Fly to be a member of the Federal\nCommunications Commission on July 27, 1939. He was confirmed by the\nSenate on August 1 without opposition, and took the oath of office\nSeptember 1, at which time he was designated by the President to\nserve as Chairman.\nChairman Fly’s term of office expires June 30t 1942. Ha fills the\nunexpired term of tiie late Anning S. Prall.\nMr. Fly Is married and la the father of two' children, a boy and a\ngirl. He is a Democrat and a member of the Protestant Church.\nHELP FROM THE FCC\nThe Feoeral Communications Commission has amended section 3.90 (a)(2)\nof the Standard Broadcast Rules by deleting the words \"together with\nthe name or title of each” and adding the words rr0f the complete\nprogram” so that the rule will read:\n” •. • (2) An entry briefly describing each program broadcast, such aa\n♦music*, ♦drama*, fspeech*, etc., together with the name or title\nthereof, and the sponsor’s name with the time of the beginning and\nending of the complete program. If a mechanical record is used the.\nentry shall show the exact nature thereof such as ’record*, *trans«\ncription* etc., and the time it is announced as a mechanical record.\nIf a speech is made by a political candidate, the name and political\naffiliations of such speaker shall be entered.”\nThe Commission’s action was taken following complaint that the\nprevious rule requiring a log entry of the names of the particular\nrecords used Imposed a financial burden, particularly on local\nstations» The Commission also stated that a further study would be\nmed© of the rules governing log entries to insure that they impose\nno unnecessary burden on any particular group of stations.\nFOG ACTIONS\nWSLA |formerly XISAL), World Wide Broadcasting Corp., has been granted\na obstruction permit for a new low frequency relay broadcast station\nto operate on frequencies 1646, 2090, 2190, and 2830 kc., with 20\nwatts power. WSLA has also been granted a construction permit to\nvrr >. ' iva-i :c. > \\ 10 OOv. 0 y : ■ 11 • a. 0 0.-0 -olo - . ■:\nnear town of scituate, Mass.\nThe FCC extended present license of BUSD, University of South Dakota,\non a temporary basis to October 1, pending determination upon appllo-"
}