{
  "id": "d1592-4",
  "text": "FRIDAY AFTERNOON\nWilliam Bearup, Overseas Representative in London, Australian Broadcasting\nCommission\nGeorge Cremeens, Director of Public Service and Special Events, Station\nKRNT, Des Moines\nStephen Fry, Manager of Program Operations, British Broadcasting Corpora¬\ntion, New York\nW. Kenneth Fulkerson, Producer, Rochester Junior Town Meeting of the Air\nGeorge Hammersmith, Teacher of the Social Studies, Macomber Vocational\nHigh School, Toledo\nR. S. Lambert, Supervisor of Educational Broadcasts, Canadian Broadcasting\nCorporation\nWatt Long, Assistant Superintendent of Schools, Portland, Oregon\nJ. Carey Taylor, Assistant Superintendent of Schools, Baltimore\nDiscussion from the Floor\nInformal Reception for Newcomers\n4:00-6:00 p. m., Hall of Mirrors, Deshler\nI. Keith Tyler, Director, and Ardis Hillman Wheeler, Executive Secretary,\nInstitute for Education by Radio, Hosts, with Columbus radio stations cooperating\nThis informal gathering is held for those who are attending the Institute for the first time.\nA number of those who are old members of the Institute will be present to help the new¬\ncomer get acquainted and to explain the general procedures of the Institute. Hospitality\narrangements include hostesses, assistant hostesses, and pourers, in addition to the “Old Timers.”\nMusic furnished by Columbus Radio Stations\nFRIDAY EVENING\nGENERAL SESSION\nHas Radio Reconverted?\n8:00 p. m.. Ballroom, Deshler\nPresiding, Edgar Kobak, President, Mutual Broadcasting System\nHas Radio Reconverted? Is Broadcasting Assuming Its Postwar Obligations?—\nA Symposium\nEach participant will have eight minutes for an opening statement in the symposium.\nThis will be followed by a free-for-all panel discussion among the participants.\nClifford J. Durr, Commissioner, Federal Communications Commission\nH. B. McCarty, Director, Station WHA, University of Wisconsin\nJustin Miller, President, National Association of Broadcasters\nNathan Straus, President, Station WMCA, New York City\nDavidson Taylor, Vice-President and Director of Programs, Columbia Broad¬\ncasting System\nDiscussion among the Speakers\nDiscussion from the Floor"
}