{
  "id": "d1592-5",
  "text": "FRIDAY EVENING\nMeeting for Chairmen\n10:30 p. m., Room 223, Deshler\nI. Keith Tyler, Director, Institute for Education by Radio, Chairman\nA meeting for chairmen of work-study groups, section meetings and round tables for the\npurpose of acquainting these group leaders with procedures for carrying on their meeti gs.\nSATURDAY MORNING\nSaturday, May 4\nGENERAL SESSION\nRadio and the International Scene\n9:30 a. m.. Ballroom, Deshler\nPresiding, Sterling Fisher, Assistant Public Service Counselor and Director of the\nUnited Nations Project, National Broadcasting Company\nRadio in Postwar Europe. Arno Huth, Author, Radio Heute und Morgen, etc.,\nGeneva, Switzerland\nThe Challenge to Radio of Postwar China. P. H. Frederick Chao, Professor of Edu¬\ncation, National College of Rural Reconstruction, Chungking; and Representative,\nChinese National Association of Adult Education\nRadios Role in Australia. William Bearup, Overseas Representative in London,\nAustralian Broadcasting Commission\nRadio Policies in the U-N. Benjaman Cohen (Chile), Assistant Secretary-General\nIn Charge of Information, United Nations\nPlans for International Broadcasting. Francis Russell, Director, Office of Public\nAffairs, United States Department of State; and William T. Stone, Director,\nOffice of International Information, United States Department of State\nDiscussion\nJudges’ Report on the Tenth American Exhibition of Educational Radio Programs\nSATURDAY NOON\nOPEN LUNCHEON\n(Guests Welcomed)\nThe Association for Education by Radio\n12:00 noon, Grand Ballroom, Neil House\n(Reservations Close Friday, May 3, 8:30 p. m.)\nPresiding, Luke L. Roberts, First Vice-President\nIntroduction of Retiring Officers\nIntroduction of Incoming Officers\nOrigination of The Northwestern University Reviewing Stand\nSubject: The Role of the School in Society\nThi« weeklv feature arranged by Northwestern University and heard over the Mutual Broad-\no^ting System will oriJnate from the luncheon. It will be recorded in Chtcago for distnbu-\nS„Ur/r network^,, .he regular lime on Sunday. The actual dtscuaston wll be from\n1:00 to 1:30 p. m., EST.\n6"
}