{
  "id": "d1592-8",
  "text": "SATURDAY AFTERNOON\nWalter N. Ridley, President, American Teachers Association\nWalter E. Robinson, Administrative Assistant, Public Schools, Highland Park, Michigan\nFrank Schooley, President, National Association of Educational Broadcasters\nArch Shawd, Vice-President and General Manager, Station WTOL, Toledo\nGeorge Slade, Educational Director, Stations WBZ-WBZA, Boston\nEdward Stasheff, Station WNYE, New York City Board of Education\nEarl W. Wiley, National Association of Teachers of Speech\nMusic Broadcasts\n2:00 p. m.. Red Room, Neil House\nChairman, Ernest LaPrade, Director of Music Research, National Broadcasting\nCompany\nCommercial Radio as a Musical Force. Abram Chasxns, Music Consultant, Station\nWQXR, New York\nMusic in the American School of the Air. Charles Sidney Freed, Producer-Director,\nMusic Division, Columbia Broadcasting System\nMusic on a College-Owned Station. Burton Paulu, Manager, Station KUOM, Uni¬\nversity of Minnesota\nBroadcasting Music Education Programs Under Commercial Sponsorship. Cecile\nCreed, Field Assistant, Standard School Broadcast, San Francisco\nSymphonic Music on the Air. Izler Solomon, Conductor, Columbus Philharmonic\nOrchestra\nBroadcasting by National Organizations\n2:00 p. m.. Parlor H, Deshler\nChairman, Inez B. Kimball, National Radio Director, Girl Scouts\nWhat Is the Responsibility of National Organizations and the Radio Industry in\nEducating Our Youth to Meet the Changing Trends of the World: i.e., Race Rela¬\ntions, Religious Differences, Moral Standards, Changes in Formal Education, etc.?\nEdgar Kobak, President, Mutual Broadcasting System\nEdward A. Richards, Deputy National Director, American Junior Red Cross\nDo Radio Executives Look Down Their Noses at National Organizations?\nHenriette K. Harrison, National Radio Director, National Council of Young Men’s Christian\nAssociations\nJennings Pierce, Director of Public Service and Station Relations, Western Division, National\nBroadcasting Company\nWill Radio Measure Up to the Responsibility It Assumed in the Public Service\nDuring the War Years in Order to Justify Itself as Free Enterprise?\nClifford J. Durr, Commissioner, Federal Communications Commission\nMrs. George Fielding Eliot, Radio Chairman, Women’s Action Committee for Victory and\nLasting Peace\n9"
}