{
  "id": "d1408-2",
  "text": "Mills rr0V e testimony is offered in tenhs of our own particular experience\nand special problems, the testimony is Intended to support the original and\nbasic point of view that broadcasting station licenses are granted \"in the public *\ninterest, convenience* and necessity\"s One of the principles involved is to\nprovide satisfactory program service to the largest number of listeners,, An¬\nother is to provide a program choice. This* as we understand it. means service\nto rural as well as urban areas, and it means service in terms of the peculiar\nneeds, interests* demands and economic necessities of the population elements\ninvolved,,\nIt seems a reasonable assumption that a broadcasting station is assigned its\nfrequency and rwwer, not only in terms of non-interference with other stations,,\nbut primarily and positively in terms of (1) its geographical location or area,,\nand (2) the number and kind of population elements residing in that area and their\nbasic needs and wants, together with ability of a station to serve them Ve\nsuggest that the special abilities of the regional educational or public service\nstation to perform this function be carefully scrutinized and evaluated* and\nthe requirements of those stations in terras of evening broadcast time, to\nprovide optimum service for the population in their respective areas be con¬\nsidered.\nToday* as we change from war to peace* we face the necessity of making\nadjustments in land use, in the production* marketing and distributing of agri¬\ncultural commodities, in keeping with changing national and international\nX •\nconditions and needs. To meet the problems and changing conditions confronting\nagriculture calls for the latest information? clear thinking and effective coop¬\neration in planning and developing programs and practices which are the most\nlogical. The democratic way of life is to present the issues. Inform the public\nand let them, through their Congressional delegations* enact suitable legislation,"
}