{
  "id": "d1408-2",
  "text": "The statement which follows is a formal, terse outline of\nthe plan:\nThe National Committee on Education by Radio, concluding jour\nyears of study and investigation, recommends to the President, the\nCongress, and to the people of the United States a plan for an American\nsystem of radio broadcasting to serve the welfare of the American\npeople }\nThe people of the United States shall establish a broadcasting system\nto supplement but not to supplant the present private system, and to\nmake available to American listeners programs free from advertising\nand presenting entertainment and information to promote public wel¬\nfare. Such supplemental public system should meet as far as practicable\nthe following specifications:\n[1] The management of such public broadcasting system, including\nthe determination of program policies, shall be vested in a series of\nboards—national, regional, and state—with suitable powers to insure\nservice to both national and local needs. These boards should be non¬\npartisan, the members carefully selected from leaders active in fields of\npublic welfare, such as agriculture, labor, music, drama, schools, religion,\nscience, medicine, law, the arts, and other civic interests. It is suggested\nthat appointments to the national board and to the regional boards be\nmade by the President of the United States, confirmed by the United\nStates Senate, and to the state boards by the respective governors, in\nall cases the appointments to be from lists of eligible persons nominated\nby the supreme courts of the several states.\n[2] The system shall be available for public business, for public\nforums, for adult education, for broadcasts to schools, for public service\nby nonprofit welfare agencies, and for other general welfare broadcasts.\n[3] Nonprofit welfare stations shall be assured the right of affiliation\nwith the federal system.\n[4] The system shall ultimately be extended to provide satisfactory\ncoverage of the continental United States, including remote rural sec¬\ntions as well as more densely populated urban areas.\n[5] The provision of funds and the allocation of suitable broadcasting\nchannels necessary for the effective operation of the system shall be made\nby the federal government.\n[6] Recordings of programs of general significance shall be made and\nshall be available for broadcasting from nonprofit stations.\n[7] A continuous program of research shall be maintained by the\npublic boards to study the desires of the people, the preparation of pro¬\ngrams, the technic of broadcasting, and the results of the broadcasts.\nThe National Committee on Education by Radio believes\nthat this plan presents a happy combination of private and\npublic broadcasting systems—that it is a plan which will not\nwork undue hardship on the present broadcasters, will improve\nthe service to the listeners, and will be of untold benefit to a\nnation whose happiness and very existence is dependent upon\nthe general standards of its people. The national system, dedi¬\ncated solely to public welfare, will make audible and effective\nthe voice of a nation.\nWanted—An Honest Radio Writer\nThere are few men in public life who have not, at one\ntime or another, been misquoted. Even when the press is\nprovided with advance copies of an address, there is a tend¬\nency upon the part of some newspapermen to report the sen¬\nsational rather than the important statements. Impartial\nobservers report that the American public experiences greater\ndifficulty in securing reliable information concerning radio than\nin the case of almost any other subject.\nThe choice radio facilities of this country are assigned to\ncommercial, interests and are exploited for profit. The chain\ncompanies and the larger stations all maintain highpowered\npublic relations staffs. From these grist mills are turned out\ndaily an endless mass of words and pictures, much of which\nthe companies hope will find its way into the newspapers and\nmagazines of the country. A great deal of this material is\n1 Adopted by the National Committee on Education by Radio, March 25, 1935.\nThe Committee is composed of representatives of the following groups: National\nAssociation of State Universities. National Association of Educational Broadcasters,\nNational Catholic Educational Association, National University Extension Associa¬\ntion, National Education Association, The Jesuit Educational Association, National\nCouncil of State Superintendents, Association of Land-Grant Colleges and Universi¬\nties, and the American Council on Education.\nhighly flavored propaganda. Is it any wonder that radio edi¬\ntors of newspapers are sometimes biased in their viewpoint?\nNewspapers should have a source of unbiased information\nwhich might be used as a balance-wheel to offset the releases\nof “honeyed” propaganda. This material should originate with\nwell-educated, independent, unbiased, and skillful writers who\nhave no interest, other than professional, in the broadcasting\ncompanies, artists, or related industries. More of these indi¬\nviduals [and there are a few of them in existence] are very\nmuch needed by the American public.\nThe radio is gradually being accepted as an American insti¬\ntution. The better class of radio listeners are learning to select\ntheir programs with greater care. They follow radio notes in\nthe newspapers and periodicals. Individuals connected with\nthe broadcasting stations attempt to keep informed.\nCan the American listener secure the facts about radio\nbroadcasting? Can the commercial broadcasters, themselves,\nobtain accurate information on the subject? Can the leaders\nin education, government, and civic affairs depend upon the\nnewspapers and popular magazines for unbiased accounts?\nThose who have been studying this matter for some time\nfeel that one of the greatest needs of the present is for fearless,\nunbiased reporting of facts concerning the various aspects of\nradio broadcasting. Has the picture been painted too darkly?\nThat is not the intention. There have been a few rays of light.\nOn the other hand, anyone who reads at all and knows the\nfacts could point out numerous illustrations of inaccurate\nreporting. Let me give you an illustration from which you\nmay draw your own conclusions.\nOne of the monthly radio magazines published recently an\narticle entitled “Which System of Broadcasting?” presenting\nthe results secured from a ballot distributed among its Cana¬\ndian readers.2 A ballot, printed in an issue of the magazine,\nattempted to determine the attitude of Canadians toward\ngovernment versus private control of radio. Such a study has\nlittle value as a research project. It begins with a serious\nhandicap because it limits the voters to those who receive\ncopies of the magazine, and, further, to the peculiar type of\nperson who would participate in such a poll. However, the\nmagazine attempted to be fair. The author of the article refers\nto the fact that “the issue is not a clear-cut one.” He then says:\nMost of our readers in the Dominion evidently would prefer to pay\n$2 a year tax and have programs free from sales ballyhoo, but at the\nsame time, they want the variety embodied in the sponsors’ programs\nand the high type of artist.\nReporting this study, a trade magazine of the commercial\nradio broadcasting industry, in an article headed “Control of\nBroadcasting by Canada Thru Tax Is Opposed by Listeners,”\nbegins with this remarkable statement:\nA substantial majority of Canadian listeners favor the United States’\nbroadcasting system as against their own system of governmental con¬\ntrol with a receiver tax, according to a poll of the Canadian audience\ntaken by Radex, published by the Radex Press, Inc., Cleveland.3\nThe National Committee on Education by Radio regrets\nthat it cannot bring the facts to every home in the country.\nIn Education by Radio, which reaches only the leaders in\neducation, government, and civic affairs, it attempts to present\nan unbiased viewpoint of education by radio as well as of other\naspects of radio broadcasting which bear upon the Commit¬\ntee's field of activity. At no time has such an unbiased service\nbeen so necessary as at present.\n2 Radio Index 11:38-40, January 1, 1935.\n3 Broadcasting 8:52, March 15, 1935.\n[23]"
}