{
  "id": "d1408-8",
  "text": "Monday*, April 22;. 1946\nClimatology Committos\nia cooperation with\n0„ $, Weather Bureau and Radio Station WOX\nWE\nThe weather over Iowa during c? weekend wan a w< >me one of generally\nclear to partly cloudy skies n& unseasonably wans temperature, Afternoon\nhighs ranged from the low seventies on Saturday to the low and mid eighties\non Sunday, with the high of 85 reported at Onawa Sunday afternoon, Temperatures\nthis morning wore mostly in the mid fifties with a low of 52 reported at Ames\nand Mason City, A moderate flow of moisture from the gulf in a weak, low\npressure trough ext ending from northern Maine to New Mexico has caused increasing\ncloudiness over the mid-west this morning with considerahls shower activity in\nnorthwest Iowa Accumulated amounts have been light to moderate with a twenty k\nfour hour total of *$1 of an inch at Inwood.,\nimmu\nAmes, Considerable cloudiness with occasional showers or. thunderstorms\nthin afternoono tonight and tomorrow, Continued unseasonably mild\ntoday and tonight® becoming cooler tomorrow afternoon.\nIowa: Considerable cloudiness with occasional showers and scattered thunder»\nstorms in west and north portions this afternoon® south and east\nportions tonightt and south central and extreme east portions tomorrow\nModerately cooler in northwest section this afternoon and conightt and\nin eart and central section Tuesday,\nTanning Outlook;; Continued cooler trend east and central portions Tuesday night..\nWednesday partly cloudy with showers in southeast and south\ncentral portions* Accumulated precipitation during shower\nperiods will be rather substantial in most sections South\nand southwest dads of 15 to 20 miles per hour shifting to\nnorthwest and north ir northwest section this afternoon and\nnortheasterly elsewhere tonight or tomorrow,. Average maximum\ntoday in the high seventies Average temperatures Tuesday ~\nNorthwestv low 45, high 60s South and East* low 58 higjh 67*\nAverage temperatures Wednesday *> Northwest® low 26, high 70?\nSouth and EastP low 46,, high 70,\nEXHIBIT m"
}