{
  "id": "d1060-0",
  "text": "NEWS NA61B GETTER\nNATIONAL ASSOCIATION ~ EDUCATIONAL BROADCASTERS\nFrank E. Schooley, Editor, Station WILL, Urbana, Illinois\nMay I, 1942\n\"HERITAGE OF HUMAN 1 TV\" ON WHA\nA SERIES OF ORIGINAL EXPERIMENTAL DRAMATIZATIONS UTILIZING UNUSUAL\nINNOVATIONS IN RADIO TECHNIQUE IS NOW 3EING OFFEREO BY THE UNI¬\nVERSITY of Wisconsin station WHA under the title of \"Heritabe of\nHumanitYo\" Romance Kqopman, WHA staff writer is the author and .\nTHROUGH THE PROGRAMS IS RE-EVALUATING THE FACTORS AND FORCES BY\nWHICH SOCIETY CONTINUES.\nPhilosophically \"Heritage of Humanity\" offers much to a world in\ndistress,, Such subjects as the dignity of man, the decency of\nWORK s THE NEED FOR BEAUTY, BELIEF IN A HIGHER POWER, LOVE BETWEEN\nMAN AND WOMAN, AND THE VALUE OF LEARNING ARE INDICATIVE OF THE\nSCOPE OF THIS THIRTEEN WEEKS SERIES HEARD EACH WEDNESDAY AFTERNOON\nat 4:00 o’clock, The broadcasts are directed by Gerald Qartell and\nTHE WHA PLAYERS WITH ORIGINAL MUSIC FURNISHED BY DON VOEGLi AND\nWHA Student Ensemble,\nLA GUARDI A APPEARS BEFORE F.C.C.\nNew York Mayor F. H. La Guardi a appeared April 29 as an attorney\n8EFORE THE FEDERAL COMMUNICATIONS COMMISSION. La GUARDfA URGED\nTHAT HIS CITY 0 S RADIO STATION, WNYC, BE ALLOWED TO REMAIN ON THE\nAIR UNTIL 11:00 p.Mo, New York time.\nThe city’s application is opposed by the Columbia Broadcasting\nSystem, which operates station WCCG at Minneapolis and by the\nstate OF Minnesota. WNYC and WCCO operate on the same wave length.\nLa Guardi a contended that the granting of the city’s application\nwould cause no interference in the primary service area of WCCO.\nMacARTHUR day on k w s c\nWhen students of\nDay recently, KWS'\nWENT *■ ALL-OUT\" IN\nWest to observe M\nof Eastern univer\nWar Bonds to camr\nday’s activities\nMENTED ITS REGUAL\nhe State College of Washington celebrated MacArthur\n, THE 5000 WATT COLLEGE-OPERATED RADIO STATION,\nBROADCAST COVERAGE. THE ONLY INSTITUTION IN THE\ncArhur Day, the State College joined with a number\nm-E8 IN WINNING A DRIVE TO SELL UNITED STATES\n~ groups Complete public service coverage of tie\nnd the advance publicity which KWSC gave supple-\ncontributions to the war effort, according to"
}