{
  "id": "d815-16",
  "text": "University of Michigan • Ann Arbor, Michigan\nGarnet R. Garrison, Director of Broadcasting E. G. Burrows, Assistant Director - Radio\nWUOM\nANN ARBOR 91.7 M.C.\nhy 12, 1961\nMr. Richard Kimball, Director C I i\nAmerican Academy of Rome MAE HEADuUAru\\\nVia Angelo Messina 5\nRome, Italy\nDear Mr. Kimballs\n7|819|ip|ll,12tl|2|8|4|5i<\nA few days ago we forwarded to George Wilson at the\nAcademy recordings of compositions by Ross Lee Finney.- Presumably\nthese tapes will be used by the Academy and for broadcast purposes\non RAI.\nWhile discussing the situation in Rome with Professor\nFinney, it occurred to me that more should be done in the way of\nan exchange with Italian broadcasters utilizing, perhaps, the\nservices of the American Academy in such a way that would benefit\nall parties concerned. Let me try to outline my ideas briefly.\nNot only as manager of WUOM but also in my present\ncapacity as chairman of the Network Acceptance Committee of the\nNational Association of Educational Broadcasters, 1 am interested\nin securing foreign program materials for use on educational, non*\ncommercial stations throughout the United states. In turn, I am\nsure, WUOM and other stations could provide program materials in\nexchange to the foreign broadcaster.\nNAEB has already been fortunate in securing two or\nthree series of programs especially narrated in English on Italian\nmusic and literature. These were prepared in Rome exclusively for\nNAEB stations. Arrangements were made through an RAI representa¬\ntive in the United States. There are certain drawbacks to this\narrangement and we are anxious to see more come out of Italy.\nI must also take note of the fact that other organiza¬\ntions and individual stations, both commercial and non-commercial,\nhave obtained program materials direct from RAI. The Broadcasting\nFoundation of America has obtained recordings of music festivals,\nfor instance, which have been made available for a fee to all\nU.S. stations. However, it seems obvious that much more can be\ndone. And in no case that I know of has the arrangement been made\non the basis of an exchange.\nWhat would be the possibility, for instance, of receiving\nhere recordings of concerts, lectures, interviews, etc., given at\nthe Academy by Americans or English-speaking guests, or of music"
}