{
  "id": "d1468-0",
  "text": "Office of Executive Secretary\nUrbana, Illinois —•\nMarch 15, 1940\nFREQUENCY MODULATION\nWell, if 1 must take my pen in\\an& to say that I think Jim Ebel\nwrote a good analysis of Frequency Modulation \"to whet your interest,\"\nI’ll do it. I do it because with but one exception there has been\nno comment. I wonder if NAEB members realize what is going on? I\ncould preach a good sermon here and get plepty of support from Howard\nEvans and others (can’t I Howard?)9 but i’ll just say again, don’t\nsell short frequency modulation. There are possibilities of an\neducational chain here, far brighter than any proposal to date.\nYour present station may become obsolete. Are you interested? The\nFCC hearing opens March 18th. Education will be represented and\nperhaps NAEB by one or more delegates. How many of you have applied\nfor a licensed frequency modulation station?\nWHEN AND WHERE TO MEET IN FALL *\nWith the April 1 issue of the News Letter will come a questionnaire\nregarding desires of NAEB members for time and place of fall meeting.\nQuestionnaire will be based upon action token at Ames annual convention.\nDon’t fail to cast your ballet when next News Letter arrives (and\nit won’t be long now).\nMICHIGAN NEWS LETTER BY GRANDPA\nWaldo Abbot of Michigan keeps in touch with his former students\nwith a monthly news letter. We quote one item of special interest\nbo NAEB friends:\nFLASH\n?’We interrupt thi3 program to bring you a bulletin just received\nfrom the University Hospital. Marie Abbot Jackson (American\nHistory as Told by American Artists Series, An Art Pilgrimage to\nForeign Museums Series) has the heir. The initial broadcast on\nMarch 3rd was punctuated by squeals and interference, the tone and\nspeech frequencies will be improved for future broadcasts. The new\narrival is on the MALE network. According to strength of signal\nthe Infant station has superpower, but was assigned 7^ lbs;\nbroadcasting with decided frequency from 328 E. Huron Street, Ann\nArbor; by authority granted by the F ather (Dr. Howard Jackson)\nC hild (Howard Coleman Jackson, Jr»7 £ ondition (fine - quality\nexcellent). This is the grandparent Station W M A.\""
}