{
  "id": "d1468-5",
  "text": "NAEB NEWS LETTER... MARCH 15, 1940. ..Page 6\nCBS \"Americans All - Immigrants All” series also appears in the\ncatalog. This program* the major radio series of the U. S. Office\nof Education for 1938-39h was designated \"the most original and\ninformative radio program of the year” by the Women’s National Radio\nCommittee and the American Legion Auxiliary, The 24 recordings of\nthe \"iuaericens All. - Immigrants All” series * telling the story of\nracial contributions to the growth of America, are now available\nfrom the Script Exchange in 12 and 16-inch sizes at cost prices.\nCoincident with the publication of the new catalog, the Script\nExchange reports that to date, 4?3G4 organizations have used series\nof scripts from the Exchange. This figure does not include thousands\nof additional groups which have received individual scripts, production\naids, and general information. It covers only those organizations\nwhich have received at least one complete series of scripts. Data\ncompiled during the survey shows that the scripts were used for\nproduction on the air; over sound systems, for mock-broadcasts, in\nradio work-shops, and as aids to social studies.\nThe Federal Radio Education Committee was set up by the Federal Com¬\nmunications Commission on December 18, 1935 n to serve a 2-fold purpose:\n(1) To work for the elimination of controversy and misunderstanding\nbetween educators and broadcasters, and (2) to help promote active\ncooperative efforts between the two groups.\nDiscussing the work of the Script Exchange, John W. Studebaker, U. s.\nCommissioner of Education ajid Chairman of the FREC, said:\n\"It is my belief that the Script Exchange offers a practical means\nof furthering the fundamental purpose of the Federal Radio Education\nCommittee, which is to bring about active cooperation between\neducators and broadcasters.”\nThe Fourth Edition Catalog is one of a series of publications designed\nto promote more effective local broadcasting and educational and\ncivic organizations. (Copies may ba obtained at 10 cents each\nthrough the Educational Radio Script Exchange, U. S. Office of\nEducation, Washington, D. C„)\nROCKY MOUNTAIN RADIO COUNJIL STEPS OUT\n\"A Guide to Good Listening” in the Rocky Mountain Region tells of\neducational programs available In that section of the country and also\nrelates who carries the programs. Sixteen stations and 27 educational\ngroups, including colleges, school, and parent-teacher groups are\nrepresented on the Council„\nkoac loses its frequency protection fight\nMethods of calculating interference as embodied in the Federal Com¬\nmunications Commission1s propagation curves, being recognized by the\nindustry as a whole, take precedence over limited measurements, the\ncommission held today in affirming its Proposed Findings of Fact and\nConclusions of September 16th last looking to authorizing the Salt\nRiver Broadcasting Co., licensee of Station KOY, Phoenix, Ariz., to\nchange that station’s frequency from 1390 to 550 kilocycles, the auth¬\norized power to remain at 1 kilowatt. The contemplated grant was\nopposed by the Oregon State Agricultural College, on the ground that"
}