{
  "id": "d1044-0",
  "text": "CHANNEL\nKFME\nFARGO,\nMOORHEAD\nNORTH CENTRAL EDUCATIONAL TELEVISION ASSOCIATION, INC.\nHIGHWAY 81 SOUTH\nFARGO. N. DAK. 58101\nArea 701 232-8921\nFebruary 17, 1966\nJames Fellows\nAssistant to the President\nNational Association of Educational\nBroadcasters\n1346 Connecticut Avenue\nWashington, D.C.\nDear Jim:\nEnclosed is the financial statement for the Library for January, 1966, I\nspent the better part of three days in Austin last week and must say that\nI am less than happy about things* I would have written this sooner but\nhave spent the better part of this week being sick.\nThe problems in Austin are still the same and they will not get any better,\nI am convinced that there will never be any help from Bob. He is neither\ninterested in or able to straighten out the personality problems between Marye\nand Earl. 1^11 bring you up to date on the project subject by subject.\nKit Number 3\nDistribution proceeding but the volume of bookings has decreased. Business\nmay kick up when more titles are available and new brochure is sent out.\nKit Number 5\nThe first release print was finally received and looked at. It is acceptable\nbut the sound is erratic. I asked Earl to check it and he claimed it sounded\nokay to him. Even though it isn»t a first quality recording job, getting it\nout is important and it isn»t that bad. I was supposed to receive the rest\nof the release prints by Wednesday of this week (February 16, 1966) but as\nusual I didn^t.\nKit Number 2\nEarl is currently printing up the shooting of this script. I saw a rough,\nrough cut, interlocks of about one half of the script. I feel that this was\na complete shamble. At this time I donH even know how it will turn out.\nThe footage is not like the script but then the script is impossible. I tried\nto talk with Earl and Marye about the problems but got absolutely no where.\nIt was left that Earl would finish the interlock cut and then I’ll just have\nto go look at it and will have to re-edit until it comes out like something."
}