{
  "id": "d1667-1",
  "text": "- 2 ~\n1937 MEMBERSHIP REPORT\nThe twentieth membership, according to Treasurer B. B. Brackett, is that of\nWKA, University of Wisconsin.\nUnofficially we report (without the Treasurer’s verification) two more.\nKenneth Bartlett, Director of Broadcasting, Syracuse University, says, ”1 would\nsuggest that you take our membership and I shall personally guarantee the foe.\"\nElmer G. Salzer, Director of Radio at the University of Kentucky, writes, \"Our\nPresident has given his consent that we join the Association, so I have made out\na requisition for the membership fee and you should receive this shortly. I hope\nto be in Columbus for the May meeting, but whether I am or not, I hope you will be\nfree to call on me at all times that I can lend assistance to the affairs of the\nAssociation.”\nWHY NOT A NATIONAL ”RADI0 GUILD”?\nIn a letter to your Secretary from Garland Powell, Director of WRUF, we find\na suggestion for consideration of all members. In part Major Powell saysr\n’’Here at WRUF we have organized a group from the University, headed by Melvin\nLobel, known as the UNIVERSITY OF FLORIDA RADIO GUILD. This group, naturally, is\nwhat its name implies find is extremely active in the field of dramatics and, to\nmy mind, very beneficial to the University of Florida. It was established on the\nCampus of the University of Florida in 1934, has 20 members, and they elect 10 new\nmembers each year. Its primary purpose, outside of the usual dramatics .and speech,\nis broadcasting radio plays. Of course, they take men into the organization who\nare qualified in acting, and one of the prerequisites of membership is that its\nmembers shall appear in a certain number of radio plays in some capacity. They do\nnot have any annual dues, or anything of that sort, but do have a distinct place\nin Campus activities.\n”It has stimulated a tremendous interest in radio broadcasts and radio\nactivities. They, have produced dramatic programs over this station once a week\nfor the past three years, naturally picking plays that are of educational value.\nI could mention quite a number of things, but now to the meat of this letter, would\nyou kindly bulletin NASB, first to ascertain if there are any like organizations\nin our membership, and second, if so, would they be interested in coordinating\ntheir work, and building a better cooperation and coordination between such organ¬\nizations by the means of a national association or a national guild?\n’’Naturally, I am tremendously interested in such a movement, not only from\nthe point of view of programs for this station, but from the more unselfish view\nof helping each other and ueveloping, if you please, a better and greater demand\nfor the better things in dramatics for radio, graduation from the various insti¬\ntutions to enter the radio field and dramatics, which is a thing that is badly\nneeded now. In this statement I am sure that you agree with me after listening to\nsome of our chain broadcasts in dramatics.”\nAll right — we want to know the answers.\n1. Are there any similar organizations among our members?\n2, What about coordinating such work through a national organization?\nLet’s have your reactions’. The matter will come up for discussion at the\nColumbus meeting on May 3. Think and talk it over. If you can’t be at the Ohio\nmeeting send your reactions to the Secretary, at Madison."
}