{
  "id": "d1249-0",
  "text": "FINANCIAL ASPECTS OF RADIO BROADCASTING\n(Amounts are given in dollars of the United States of America)\nAustralia. Income increased 12f0 in 1932. It was already sufficient to cover\nall expenses.\nAustria. The operating company paid an 8f/o dividend on its stock in 1931 and\nincome increased in 1932.\nBelgium. The broadcasting budget for 1933 was increased from 14,000,000 to\n18,000,000 francs because of increased income in 1932.\nCzechoslovakia. Profits for 1933, estimated on results in 1932, will be about\n$1,000,000.00.\nDenmark. The income increased over Q% in 1932. The accumulation of surplus is\nembarrassing to radio officials as the broadcasting system is fully\ndeveloped and the law prohibits the use of broadcasting income for pur¬\nposes other than broadcasting.\nFinland. The income increased 9% in 1931 and was still.increasing in 1932. It\nwas already ample to cover the expense and a satisfactory return on the\ninvestment.\nFormosa. The income increased in 1932. No deficit reported.\nGermany. The income decreased about 1% in 1932 because the unemployed Yrero\nexempted from paying license fees for radio receivers. The number of\nlicensed receivers increased. The Government has taken over the operation\nof broadcasting and directly controls radio manufacturing and sales.\nGreat Britain. I-come in 1931 was over $7,000,000.00. The Government retained\nabout $2,625,000.00. The balance covered operating expense and a satis¬\nfactory return on money invested. The operating company voluntarily paid\ninto the national treasury $1,000,000.00 from a balance put aside for\nfuture development. The income increased in 1932.\nHolland. Broadcasting is supported entirely by voluntary contributions. There\nis no advertising revenue and no license fees are charged. The surplus of\nincome over expenses is more than $450,000.00 yearly. More than 275,000\nsubscribers pay for program service over wires although the same programs\ncan be received by radio.\nHungary. The income increased 6fo in 1931-32. Income has been more than suf¬\nficient to cover expenses since 1896, when broadcasting began over tele¬\nphone circuits.\nIceland. The Government contributes $20,000.00 yearly to supplement the income\nfrom listeners’ license foes. This is not considered as a deficit but as\na service to the citizens.\nIndia. The private operating company went bankrupt. The Government is now\noperating broadcasting and income is increasing."
}