{
  "id": "d1663-1",
  "text": "nearing. ~\nThe Commission took actions ( June 2l) looking toward a comprehensive revision of FM\nbroadcast rules, at the same time inviting comments on whether duplication of AM programs\non FM stations should be curtailed, although no rules will be adopted in the latter area\nwithout fuither proceedings. As to many of the allocation and assignment matters, the\nproceeding looks toward adoption of rules without fuither proceedings.\nProposing three classes of commercial FM stations (now two) and two of educational\nstations, the proposed Rule Making would provide minimum co-channel and adjacent-channel\nmileage separations, as follows:\nClass _\nClass A\n(low power)\nClass B\n(intermediate\npower)\nClass C\n(high power)\nClass D\n(low power\neducational)\nClass E\n(high power\neducational)\nMaximum facilities\n( or eguivalent)\nProtected service\narea radius_\nMinimum co-channel\nspacing\n1 kw ERP, 250 ft.*\n25 iniies\n115 miles\n20 kw ERP, 500 ft.*\n50 miles\n190 miles\n100 kw ERP, 2,000 ft.*\n100 miles\n300 miles\n10 w (trans. power), 100 ft.* 6 miles\n25 miles\npa-mp as for mayTTTiwm commercial station at the same\nlocation\n* Above average terrain\nComments to the proposed rule making are due September 5*\nThe FCC ( on July 6) proposed further rule making which would amend Sec. IV of its\nbroadcast application forms to require applicants to state what efforts they have made\nto ascertain the audience needs and interests of their communities, and the manner in\nwhich they are meeting them or intend to meet them. The new information would be required\non applications for CPs, renewals, assignments of CPs or licenses, and consent to transfer\nof control. In companion action, the FCC proposed to revise logging requirements to\nprovide the factual information needed to complete the intended revised forms. Comments\nin both matters may be filed before September 7 and reply comments by September l8.\nThe FCC ( on June 28) proposed rule making which would preclude licensing VHF trans¬\nlators to TV broadcast stations just to extend the latter's service area. It is not pro¬\nposed to place any additional restrictions insofar as UHF translators are concerned. Com¬\nments are invited by September l8.\nGranted CP ( on Jxme 28) to the University of Notre Dame Du lac, Notre Dame, Indiana,\nfor a new noncommercial educational FM station to operate on 91*1 with 10 watts.\nGranted CP ( on June 2l) to the Trustees of Wheaton College, Wheaton, Illinois, for\na new noncommercial educational FM station to operate on 88.1 me with 10 watts; remote\ncontrol permitted.\nDenied ( on July 6 ) petitions for reargument, rehearing and oral argument on petition\nfor rehearing of Jiily 20, i960 Decision which granted new Class B FM station to Riverside\nChurch (NYC)and denied application of Huntington-Mbntauk B/cg. Co., Inc., for a like\nfacility in Huntington, L.I., N.Y."
}