{
  "id": "d1688-11",
  "text": "ORGANIZA'TION _MAILING ADDERSS\nHUSTED, MARJORIE C. - Betty Crocker, Director Home Service Dept., General Mills,\nMinneapolis, Minnesota\nHBBAHIM, ABDEL AZIZ ESSAYED - Representative Egyptian Education Office - 2200 Kal-\norama Road, Washington, D. C.\nIIUTH, ARNO - Radio Expert - 66-07 99th Street, Forest Hills, L. I.\nHUTE, MARGARET - 66-07 99th Street, Forest Hills, D. I.\nINMAN, ELINOR F, - Director Religious Broadcasts, CBS - 485 Madison Ave., New York\nIRWIN, CAROL - Program Development, ABC - 30 Rockefeller Plaza, New York\nIRWIN, RUTH BSCXSY - Supervisor, St. Speech and Hearing Therapy, St. Dept. Education\n200 Thurman, Columhus\nDAVID E.\nSLOISE L.\nJACOBS, LELAND B. - Instructor, Ohio State University\nJAMES, WALTER B. - Asst, to Chairman, Fed. Comm. Comin., Washington, D. C.\nJEFFERS, CARLTON C. - Radio Chm, Parkersburg Jr. League - 1025 Juliana, Parkersburg,\nJENNINGS, GEORGE - Radio Council, 228 N. La Salle St, Chicago, Ill. # /W, Va.\nJENSEN, MILFORD C. - Operations Director, WCAL, St. Olaf College - Northfield, Minn,\nJESSE, MARY - Women's Director, WAVE - 334 E, Broadway, Louisville,.Xy.\nJOHN, WALTER W. - Chief, Information Service, Production and Marketing Admimstra-\ntion, U. S. Dept* Agriculture - 5 S. Wabash, Chicago\nGRACE M* - Director, Women’s Childrens Activities, ABC, Radio City, N. Y-\nARNOLD C, - Announcer, WJBC - Indianapolis News Bldg., Indianapolis, Ind.\nMRS. CATERINE D, - Editor, Round Table, Research Director, Human adventure\nUniversity of Chicago - 850 E. 58th St, Chicago\nProgram Director, WCAL - St. Clef College, Northfield, Minn.\n- Music Supervisor - 233$ Berv/ich Blvd., Cclumous\nOhio State University\nOhio State University\nDirector, Developmental Programs, WBNS - 33 N, High St., Cols.\nRadio Director, Texas Forest Service, A. and M. College,\nCollege Station, Texas\nJOHNSON, WILLARD L. - Vice-Pres. National Conference of Christian and Jews - 381\n4th Avenue N, Y,\nJOHNSTONE, G. W. - Director, Radio Department, Nat'l. Assoc. Mfgs. - 307*44 Madison\nJONES, BUTLER A. - Prof. Social Science, Talladega College, Talladega, Ala.\nFLORENCE H. - Scriptwriter, Radio Consultant, Comstock Hill, Norwalk,\nFRANK N. - Salesman, WCOL -33 N- High St., Columbus\nJOHNNY E. - Columbus Dispatch, Columbus\nLOUISE - Ohio State University\nFRED - Program Director, WWSW, Pittsburgh, Pa.\nGENS S. - Public Service, NBC - Washington, D. C.\nJOENSEN,\nJOHNSON,\nJOHNSON,\nJOHNSON,\nJOHNSON,\nJOHNSON A. MAXINE ■\nJOHNSON, ERWIN K.\nJOHNSON, IRWIN A. •\nJOHNSON, R. VERLE\nJONES,\nJONES,\nJONES,\nJONES,\nJOYNER,\nJUSTER,\n/NY\nConn.\nXABDERLY, WALLACE L. - Farm Director, XGW - 1011 S.W. 6th Ave., Portland, Oregon\nKAHN, LSN - Ohio State University\nKAMI NS, ROBERT W. - News Editor, WKZO - Burdick Hotel, Kalamazoo, Michigan\nKARL, max Director Public Serv. Programs, WTCN - Wesley Temple Bldg., Minneapolis\nKARNEY, BEULAH - Director, Beulah Karney, Inc. - 165 W. Wacker, Chicago, Illinois\nKAUFMAN, LENARD - Radio Information Director, NYC Veterans Service Centers - 500\nPark Avenue, Now York\nKAYE, SYDNEY M. - 165 Broadway, New York\nKEITH, ALICE - President, NAB - 1366 Irving Street NW, Washington,D.C.\nKEENAN, PATRICIA C. - Society Editor, Columbus Citizen - 3256 Indianola Ave., Cols.\nKEIZER, HENRIETTA,- Director of Music Education, Capitol Univ., Columbus\nKELLER, EDITH M. - State Supervisor Music, St. Dept. Education, Columbus\nKELLEY, DON S. - Public Relations Director, CBS - Wrigley Bldg, Chicago.\nKELLEY, HELEN - WLW - l40 W. 9th Street, Cincinnati, Ohio\n- 12 -"
}