{
  "id": "d1688-13",
  "text": "NAME\nORGANIZATION\nmailing ADDRESS\nLAND, HERMAN W. - Radio Director, Kircher, Helton and Collett - 321 W 1st tree ,\nDayton, Ohio r\nLANDS, EVERETT A. - Radio Instructor, Chicago Boys Clubs - 120 S. La Salle, lca£\nLANG, LILLIAN A. - Asst. Program Operations Dept., BBC.- o30 Fifth Ave., New lor\nLANGTRY, MARTHA R. - Corres. Secy-elect, Cleveland Radio Council - 17313 a\nAvenue, Lakewood, Ohio\nLAPRADS ERNEST - Director Music Research, NBC - 30 Rockefeller.Plaza., .New Yor\nLARDIE, KATHLEEN N. - Supervisor, Dept. Radio Education, Detroit Public Schools\n93U5 Lawton Avenue, Detroit, Michigan\nLARUE, DON - Ohio State University\nLARUE, JOHN W, - News Editor, WAKE - Central Tower, Akron, Ohio\nLATTIMHR, DAVID V. - Asst. Program Director, WOSU, Ohio State University, Columbus\nLAUGELIN, HUGH - University School, Ohio State University, Columbus, phio\nLAUGELIN, MARY J. - Ohio State University\nLAUSCHE, MRS. FRANK J. - Governor's Mansion, Columbus\nLAWTON, SHERMAN P. - Coordinator, Radio, Univ. Oklahoma - Norman, Oklahoma\nLEADER. ANTON M. - Vice-Pres., Radio Directors Gu$ld - Hotel Gladstone, E 52nd St,\nLEADER, ROSALINDS L. - 305 W 52nd Street, New York\nLEAKE, MRS. DOROTHY V. - Representative, EWFT - Kemp Hotel, Wichita^ialls, exas\nLEAKE, SSGSNS JR. - Promotion, WAVE - 334 Broadway, Louisville, Ky.\nLEAKS, HAROLD H. - Director, Radio Services, Oklahoma A. and M. College, tillwat r,\nLEE, ROBERTA JEANNE - Stephens College, Columbia, Missouri /\nLEFFQRGS, ORLAND S. - Instructor, Manchester College - 145 Ferry St., tfabasn, Ind.\nLEHMAN, ROSE L. - Radio Education, Detroit Bd. of Education - 9345 Lawton, Detroit\nLEMBSCX, HARVEY - Nevr York University, N. Y.\nLEMONS, BDD - Farm Service Kiroctor, WXY - Oklahoma City,.Okla.^ .\nLEONARD, JAMES - Program Manager, WSAI - 115 E 4th St., Cincinnati, Ohio\nLEECH, DON t Farm Director, WEAF, NBC - New York\nLERSR, ROSSLEB - South High School, Coluipbus\nLESLEIN, CHARLOTTE - South High School, Columbus . . ATV\nLE SOURD, HOWARD M. - Director, Inst, for- Democratic Education-415 Lexington av^.,NY\nLEVENSON; WILLIAM' B. - Directing Supervisor, WBOE, Cleveland Bd. of Education\nLEVINSTEIN, JUSTINE -r 104? Oakwood Avenue, Columbus _\nLEVINE, LEON - Asst. Director Education, CBS - 485 Madison Avenue, New York\nMADELYN - Ohio State University\nANN - South High School, Columbus\nDAVE - Announcer, WFIN Findlay, Ohio _ >\nDOROTHY - Coordinator Listener Activity, NAB - 335 Filth Ave., NY\nJACK W. - Assoc. Director, Rocky Mt. Radio Council - 21 E 18th Ave, Denver,\nMRS. LAWRENCE D. - AAUW - Columbus . _ - , (C°i0;„fl\nMRS. MARY C. - Asst. Director, Women's Divison, Allied Liquor Industries, Ihc.\nNew York - 6 East 36th Street, New York.\nWILBUR S. - Acting Director, Society Advancement of Public Education by\nRadio and Television - Milford, Ohio\nLIEBER, MARTHA D. - Ohio State University . c q r. . Wn11\nLINCH, SAM H, - Supervisor Radio Education, Atlanta Public school System, City Hall\nAtlanta, Georgia , T\nBINDLEY, MERRILL R. - Radio Director, Wm. H. Block Co. - 50 3ff. Illinois,.Indianapo\nLINES AIT, EDMUND J. - Program Director, KSO - 800 Old Colony Bldg, Des Moines / is\nLINTON, DAVID - Program Manager, Intercollegiate Broadcasting System - 5°7 5 Ave.NY\nLINTON, HARRIET B. - Research As*t., Bureau Applied Social research, Columbia\nUniversity, 15 Amsterdam Avenue, New York\nLIPPINCOTT, LOUISE - Teacher, South High School ll60 Ann Street, Columbus\nLISK, HAROLD - Ohio Editor, International News Service r 35 OaY st*> Columbus\nLOCKARD, MURRAY - Ohio State University , . ^\nLOCKE, JOHN F. - Director, Community Relations, Cincinnati Ba. of Education\n216 E. 9th Street, Cincinnati\n- 14 r\nLEVI I\nLEWIS,\nLEWIS,\nLEWIS,\nLEWIS,\nLEWIS,\nLEWIS,\nLEWIS,"
}