{
  "id": "d1688-16",
  "text": "organization___mailing address_\nMILLER, BOB G. - Associate Barm Program Director, WLV/, Cincinnati, Ohio\nMILLER, CLAUDE - Kent State University, Kent, Ohio\nMILLER, DOLORES,- South High School, Columbus\nMILLER, ELEANOR - Radio Information, U. S. Dept. Agriculture, Washington, in C.\nMILLER, ELIZABETH *r Junior League,* Columbus\nMILLER, JUSTIN, Pres,, NAB - 1760 N Street, Washington, D. C.\nMILLER, KjSNNETH R. - Director, Public Information, Amer. Social Hygiene Assn.\n1790 Broadway, New York\nMILLER, M. HUGHES - Educational Service, Amer. Education Press - 400 S. Eront, Cols.\nMILLER, JANE E. - Producer College Workshop, Central St. Teachers College *- Stevens\nPoint, Wisconsin s ^\nMILLER. MRS. RUTH WEIR - Radio Assistant, Philadelphia Public Schools, Radio Office\nWilson School, 12th and Wharton Sts, Philadelphia, Pa.\nMILLER, JIM - South High School, Columbus\nMILES, JOE R. - Radio Editor, Columbus Star, 62 E. Broad St., Columbus\nMILLS, GEORGE E. r* Prof, Western Mich. College of Education, Kalamazoo, Michigan\nMILLS, SARAH - Ohio State Journal, Columbus\nMINDERMAN, EARL - Director Information, FCC, Washington, D. C.\nMINDERMAN, MRS. EARL - 3°5l Idaho W., Washington, D. C. .\nMINIACE, DOROTHY E. - Coordinator Speech and Radio Education, Dept, of Education,\n108 Union, Schenectady, New York\nMINSKY, LOUIS - Managing Editor, -Religious News Service - 3&1 ^4 Ave, Now York\nMIFTZES, MARILYN - South High School, Columbus\nMIRACLE, ELLIS B. - Radio Director, Zanesville Schools, Zanesville, Ohio\nMONROE, ANNABEL - Ohio Wesleyan University, Delaware Ohio\nMOODY, CARL 0. - Radio Education, Detroit Bd. of Education - 9345 Lav/ton, Detroit\nMOODY, TOM - South High School, Columbus .\nMOORS, CLARENCE C. - Program Manager, KOA-NBC - 1625 California St., Denver, Colo.\nMOORS, HOETENSE - Radio Director, Miami University - 110 So. College, Oxford, 0.\nMOORE, MRS. RUSSELL - Pres., PTA -5925 Olentangy Blvd., Worthington, Columbus.\nMORELAND, WALLACE J. - Asst, to the President, Rutgers University, New Brunswick,NJ\nMORGAN, MRS. HAZEL B. - Author, Lecturer - 3336 Slsmere Rd., Cleveland, Ohio\nMORGAN, HOWARD C. - Prof. Speech and Dramatics, Sarlham College, Richmond, Ind.\nMORGAN, RUSSELL V. - Director Music, Cleveland Bd of Education - 1380 E 6,^Cleveland\nMORPHY, MRS. ELYDA M. - WHA Program \"Music Enjoyment\", School of the.Mr, Univ.\n01 Wisconsin — l620 Monroe, Madison, Wisconsin\nMORRIS, CLAUDS C. - Radio and Special Events Director, The Community Chest of All¬\negheny County - 4615 Forbes Street, Pittsburgh, Pa.\nMORRIS, JAMES M, *r Acting Program Manager, KOAC - Corvallis, Oregon _ _\nMORRISON, NEIL M. - Supervisor of Talks and Public Affairs, CBC - 354 Jarvis St.\nMOSES, JOHN B. - Program Director, WOOL - 22 E. Gay St., Columbus /Toronto\nMOWREY, PAUL B. - Nat‘1. Director of Television, ADC - New York\nMUR.OS, BEN W. - Program Director, WCAE - William Penn Hotel, Pittsburgh, Pa.\nMURPHY, FLORENCE M. - Director of Radio Promotion, Minneapolis Star Journal and\nTribune, Minneapolis\nMURRAY, ROBERT 0. - Associate Editor, Advertising Age - 100 E. Ohio, Chicago, Ill.\nMUSCHANY, ELMER G. - Production Director, KXOK - 12th and Delmar, St. Louis, Mo.\nMYERS, PAUL A. *■ Program Director, WV7JL - Hawley Bldg., Wheeling, West Virginia\nNADA1, RUTH D. - Continuity7- Writer, WWVA - 810 Main St., Wheeling, W. Va.\nNAFZGSR, LESTER H. - Station Director, WELD - 33 N. High St., Columbus\nNARAMORE, C, RAYMOND - Rochester School of the Air, ’WHAM - Sheratan Hotel, Rochester\nNATHAN, A. NAAL - WBOE - 1380 East 6#a, Cleveland, Ohio /KY\nNEAL, P, B. f Musical Director, WBNS - 33 N. High Street, Columbus\nNEELEY, DUANE - South High School, Columbus ... r\nNEFF, RUSSELL E. - Director Radio Dept., Knox Reeves Advertising, Inc. - 600 1st\nNational Bank Bldg., Minneapolis, Minnesota\n- 17 -"
}