{
  "id": "d1688-18",
  "text": "NAME\nORGANISATION\nMAILING ALLRRSS\n801 w 12th,\nPOTTHE,\nPOWERS,\nPRATT,\nPROSST,\nPRIOR,\nPRYOR,\nQTJACONRUSH, AMANDA\nPFEIFFER, ROBERT A. - Announcer, State Univ. of Iowa.WSUI, Iowa City, I°™a\nPEL I FREE MRS. VERA PARES S - Second Asst. Principal and Teacher, Derby High,\n1704 Glynn Court, Detroit, Michigan\nPICKENS, VIRGINIA K - Educational Assistant, WLS - 1230 W. Washington, Chicago\nPIERCE, JENNINGS J. - Manager, Public Service and Station Relations Dept.,\nSunset and Vine, Hollywood, Calif.\nPIKE, ANN E. - 'Ohio State University\nPIXLEY, LLOYD A. - Owner, WOOL - 33 N. High St., Columbus\nPIXLSY, MRS. LLOYD A. - l44 N. Drexel Avenue, Columbus .\nPLAMBSCK, HERB H. - Farm Service Director, TOO - Central Broadcasting ompany,\n9144 Walnut, Des Moines, Iowa\nPOPE, SULALIE - Singer, Brookside Hotel, Kansas City, Mo,\nPORTER, R, RUSSELI - Director, Radio Office Emporia Teachers College\nEmporia, Kansas\nPCRTERFELD, ELIZABETH B. ^ ^ ,+Vl\nPORTERFIELD, JOEL D. * Chief, Division of Venereal Disease, ehio Dept, of H ai ,\nRoom 303, St. Dept. Bldg, Columbus #\nRUSSELL - Director, Inst. Arts and Sciences, Columbia University, New York\nHELEN - Asst. Manager, WITH - 7 3. Lexington St., Baltimore, Maryland\nGERALD - South High School, Columbus ^\nGEORGE E. - Exec. Secy, Univ. of Chic.Radio Office - 850 5S St., Chicago\nEMERSON J. - Station Manager WRRN - 2nd Nat’l Bldg, Warren, Ohio\nROBERT N. r Educational Director, WCAU - 1^22 Chestnut St., Philadelphia, a.\nPUHAN, ALFRED - Chief, European Broadcast Section, State Department, OIC\n224 West 37th St., New York\nEditor, Conn. Agricultural Experiment Station, Box 1106, New\nHaven, Connecticut\nQDAINTANCE, JOHN - South High School, Columbus\nQJJI&L3Y, HJ0OLD J. - MINISTER, l60S Park Blvd, Troy, New York\nQDSLLO, JAMES H. - Publicity Manager, King-Trendle Brod. Corp, - -7°° Ctroh B1 g*\nDetroit, Michigan\nRADER, MRS. CLARA - Seeds Road, Grove City, Ohio\nRALLS, M. MARGARIETE - Radio Chm, Nat’l. Federation of Business and Professional\nWomen’s Clubs, New York - 401 Hartmant Theatre Bldg, Cols,\nRAMSEY. NORMAN A. - Announcer, 3^48 Indianola Avenuo, Columbus. .\nRAMSOWER, HARRY C. - Director, jigric. Extension, Ohio State University, Columbus\nRANKIN, FORNEY A, - International Broadcasting Division, St. Dept., Washington, DC\nl6l0 N, Greenbrier St., Arlington, Virginia\nHANSON, MR. JO - Publicity Director, WHN - 1540 Broadway, New York City\nRAY, WILLIaM - Manager, News and Special Events, Central Division, NBC, Merchan¬\ndise Mart, Chicago\nREAVIS, G. H. - Asst. Su.pt., Public Schools, Cincinnati, Ohio\nRECK, W. EMERSON - Director of Public Relations, Colgate Univ., Hamilton, N. Y.\nREDFIELD, EVELYN 0. - Asst., Radio Opinion Agency - 1235 No. Honor© St., ^Chicago\nREDFIBLD, ROBERT H. - Exec. Director, Radio Opinions -Agency, 1235 N.^Honore, Chic.\nREDMOND, RICHARD J. - Pres. Gen. Manager, Planned Music, Inc. - 63O E. Broad, Cols.\nREED, PAUL C. - Director, Visual and Radio Education, Rochester Public Schools,\n13 S. Fitzhugh St., Rochester 4, New York^\nREEVES ELIZABETH B. - Director, Radio Public Relations, Knox Reeves Advertising\nInc., 600 1st Nat’l Bank, Minneapolis, Minn.\nREEVES, JEROME R. - Director, Program Promotion, WBNS, 33 N. High Street, Cols..\nREINHARD, HARRY 1, - Radio Director, Veterans Administration, Keystone jBldg, Philiy.\nRENFRO, HARRY K. - Director Public Relations, KXOK - 12th and Delmar, St. Louis\nRENNIE, JOHN Oju - Director, Press an.d Radio Division, British Information Services\n30 Rockefeller Center, Now York\nRENOLLET. HAL C, - Director of Agriculture, KOA-NBC r 1625 California St., Denver,\n„ X5> - Colo."
}