{
  "id": "d1688-2",
  "text": "NAME\nORGANI ZaTI ON\nmailing address\nBOFFO, OPAL - Director Radio Workshop, Kent State University, Kent, Ohio\nBONDER, ABE - assoc. Field Secy., Midwest Section, National Jewish Welfare Board,\n203 N. Wabash, Chicago, Ill.\nBONNETTE, VIRGINIA - South High School, Columbus, Ohio\n30NNEY, ARMOR - Program Director, WSUI, Iowa City, Iowa\nBOREL, RICHARD A. - Station Manager, WBNS, Inc. - 33 No. High Street, Columbus\nBOREL, MRS. RICHARD A, - Columbus, Ohio\nBORIAN, DOROTHY A. - Secy., Dept. Radio Education - 9345 Lawton, Detroit, Mich.\nBOULTON, GRACE - Science Broadcasts, WHAM, Bd. of Education r 13 S. Fitzhugh St.,\nRochester, 4, N. Y.\nBOWEN, HARRIET - South High School, Columbus, Ohio\nBOWER, WARREN * Asst. Director, Division of General Education, NYU, 100 Wash. Sq. E\nBOWERSOX, OLIVE I, - Head Adult Serv. Div., Akron Public Library » 1049 /NY\nJefferson Avenue, Akron 2, Ohio\nBOYAJIAN, JULIA A. - Alpha Epsilon Rho, Syracuse Univ., Syracuse, New York r\n3422 Chadwick Drive, Los Angeles 32, Calif,\nBOYER, ELLEN F. - English Teacher, South High School, Cols. - 319 Kendall PI., Cols\nBOTeR, F. PAGE r* Stephens College, Columbia, Missouri\nBRADFORD, CONSTANCE - Junior League, Columbus, Ohio\nBRANDES, DON C. - Salesman, WOOL - 33 N< High Street, Columbus\nBRASSFIELD, JIMSIANA - Director, Home Economics, Wilberforce, Box 254, Ohio\nBRAWLEY, HaRRY M, - Education Director, WCHS, Charleston, West Virginia\nBREM3ECK. COLE S. - Asst. Prof. Speech, Manchester College - N. Manchester, Ind.\nBRINES, PAUL C, - Asst. Manager, WGN - Tribune Tower, Chicago\nBROCK, CLARENCE A. - Principal, Rivesville High School, Rivesville, W. Virginia^\nBROCK, J. W. -r Instructor Speech, Director Dramatics, Albion College - Albion, Mich\nBROCK, MRS. J AIRIES W. - 1108 Jackson, Albion, Michigan\nBRODERICK, MRS. GERTRUDE G, - Radio Education Specialist, U. S. Off Education, Wash\nBROFEE, LINWOOD H. - Agric. Div., Maine Broadcasting System, WCSH t Portland, Me.\nBRONSTSIN, ETHEL - South High School, Columbus, Ohio\nBROOKS, JULIA E. - Reporter, Cleveland Call and Post - 102 Hamilton Ave, Columbus\nBROWN, DOUGLAS D. Attorney, Wm. H. Block, Co. * 50 N. Illinois St., Indianapolis\nBROWN, SONIA J. - Station Relations Manager, Intercollegiate Broadcasting System,\n507 Fifth Avenue, New York\nBROXAM, PEARL BENNETT - Director Public Interest, WMT “ Cedar Rapids, Iowa\nBRYAN, JACK H. - Deputy Inf. Director, Natfl. Housing Agency - Soc. Security Bldg.\nBRYSON, KATHERINE - 450 Riverside Drive, New York /Wash., DC\nBRYSON, LYMAN - Counsellor Public Affairs, CBS 4S5 Madison Ave., N. Y.\nBUCHANAN, RONALD S. t 1174 Ellsworth Avenue, Columbus, Ohio\nBUCHER, L. R. - Scout Exec., Boy Scouts Amer, - 26 N. Grant Avenue, Columbus\n3UCHHEIMER, ARNOLD - Ohio State University\nBOTTOM, JESSE H. - CIS Agricultural Director for New England, WSEI, Boston\nBULLOCK, JIMMIE L. - Kent State University, Kent, Ohio\nBURKE, HARRY D, - General Manager, KFA3 - 620 Farnam Street, Omaha, Nebraska\n3URWELL, GERALDINE E. - Capitol University, Columbus\nBURRIS, RICHARD E. «r News Director, KSO - Old Colony Bldg, Des Moines, Iowa\n3UBRISQN, VIRGINIA r- Radio Editor, Columbus Citizen - 34 N. 3rd St, Columbus\nBUTCHER, JESSE S. - Radio Director, USO - 350 Fifth Avenue, New York\nBUTLER, MARGARET M. - First V. Pres, Elect, Cleveland Radio Council - IO63 Rfealie\nAvenue, Lakewood 7> Ohio\nBYRON, EDWARD A. - President, Byron Productions - 73° Fifth Avenue, New York\nCALDWELL, MRS. ELIZABETH - Technician, Stephens College, Columbia, Missouri,\n1212 East Ash St., Columbia, Mo.\nCALLAHAN, EDNA M. Clothing Specialist, Campbell Hall, OSU, Columbus\n- 3 -"
}