{
  "id": "d1688-23",
  "text": "NAME ■\nORGANIZATION\nMAILING ADDRESS\nSault Ste,\nTRENHOLM. H. COUNCIL!. - Exec. Secy., Amer. Teachers Assoc. - POBox ZJ1, Montgomery\nTROTHAN, ELISABETH - Chm., Women's find Children's Programs, WSJS.- fltW2l /iua.\nMarshall Street, Winston-Salem, North Carolina\nTROUP, CORNELIUS V. - Pres., Ft. Valley St. College - Ft. Valley, Georgia\nTUCKER, FRANCES L. - Editorial, Radio Writer, Brand Names Research Foundation\n119 W. 57th Street, New York\nTURNELL, ELIZABETH J. - Director Radio Workshop, Radio Staff, WIRE, DePauw Univ.\nBox 444, Greencastle, Indiana\nTURNER, MARY J. - Ohio State University ^ „ _ .\nTYLER, I. KEITH - Director, Institute for Education \"by Radio, OSU, Columbus\nTYLER, MARGARET C. ~ Supervisor, Ohio School of the Air, WOSU, OSU, Columbus\nTYLER, FLORA V. - 1991 Berkshire Road, Columbus\nTYLER, TRACY F. - Asst. Prof. Education, Editor ASR Journal, Univ. of Minnesota\n1564 Fulham Street, St. Paul, Minnesota\nUHRIG-, MRS. ELIZABETH *r 31° So. Burgess, Columbus\nUL3RICR, RAYMOND G. T Program Director, WSOO - 107 W, Portage Ave\nMarie, Michigan\nUPCHURCH, GAJNELLE H. - Teacher, Akron East High School - 90 Frances Ave.\nURAI, DICK - Kent State University, Kent, Ohio ff , , .\nU^RSNN, DOROTHY - Radio Writer, OPA, Radio Branch - 1630 lbth,NW, Washington\nVADELBONCOEUR, EDMUND R. - Vicd-Pres., WSYR - Syracuse Kemper Bldg, Syracuse, NY\nVALLBNDSR, GEORGE E. - Farm Director, WBCM - 100 Center, Bay City, Michigan\nVANDAGRIFT, CARL W. - Program Manager, WOWO - 925 s* Harrison, Ft. Wayne, Ind.\nVANDEVENTSR, DENVER - Division, Director Empire Crafts Corp* - 18o9 Kirg Ave, C\nVANDEVENTER, MARY -r IS69 King Avenue, Columbus\nVSITCH, SAM L. r» Publisher, National County Agent - 1330 line St., Philadelphia\nVENN, ELMA L. - Ohio State University\nVINCENT, MARILYN - South High School, Columbus _ ...\nVINCENT, SIDNEY - Director, Glenville High School Radio Workshop, Script-writer\nW30E - Rockwell and B 6th St., Cleveland, Ohio\nVIRTUE, R. S. - County Agent, Extenion - West Virginia University, Morgantown,\nMoundsville, West Virginia\nVOGELMAN, ROY C. Chief Announcer, WHA, Madison, Wisconsin\nVOSS, EDWARD- Student, Toledo Public Schools\nVOSS, GEORGS - Asst. Radio Director, Natl. Found, Infantile Paralysis, 120 ^roadway\nNew York\nAkron,0.\nDC\nCYRIL C. - Midwest Indoor Editor, Billboard - 155 N. Clark St.., Chicago\nPAUL E. - General Manager, WPAY - 1009 Gallia St., Portsmouth, Ohio\nPAUL H. - Asst. Prof., Ohio University - 57 Slminoo.Place, Athens, Ohio\nJUDITH C. - Director, Public Service, NBC, Merchandise Mart, Chicago\n:SL0ISE K. - Public Relations Associate, Community Chest - 155 E 44th St.NY\n’WARD, PHYLLIS - South High School, Columbus\nWARING, ELSIE R. - 275 Acton Road, Columbus, Ohio\nWARNER, JOHN W. - County Agent, Jnd. County Agr. Extension Assn., Court House,\nIndiana, Pennsylvania\nCATHERINE M, - Asst. Supervisor Music, City Schools - 2405 21 AveS, Nash¬\nville, Tennessee\nSARA R. - Home Demonstration Agent, W. Va. Agricultural Extension Service-\n400 National Bank Bldg., Wheeling, West Virginia.\nE. CHAMP - Prof, of Education, Wilberforce Univ., *• Box 171» Wilberforce\nWASSERMAN, SIDNEY - Ohio State University _ < /Ohio\nWSATHSRWAX, LESTER F. - Farm Director, KFBI - Wichita, Kansas\nWAGNER,\nWAGNER,\nWAGNER,\nWALLER,\nWALTON\nWARREN,\nw aerbn,\nwarriet,\n- 24 -"
}