{
  "id": "d1688-3",
  "text": "NAME\nORGANIZATION\nMAILING ADDRESS\nCALLAWAY, JOE A. r Director Radio Education, Michigan State College, East Lansing\nCALVERT, WILLIAM R. - Ohio State University\nCAMP, MARIE - South High School, Columbus, Ohio\nCAMPBELL, ANGUS t U. S. Dept. Agriculture,. Washington, D. C.\nCANADAY, MIRON S., JR. -p Asst, to Director, WMBI - 153 Inst. PI.. Chicago\nCANAD AY, MARION t WMBI,- 153 Inst. PI., Chicago\nCANTER, RUSSELL E. - Chief Announcer, WBNS - 33 N. High St., Columhus\nCARI-CARI, MRS. CLaIRS - Asst, to Radio Director, Gardner Advertising Company -\n915 Olive Street, St. Louis, Mo.\nCARLILE, W, A. - Salesman, WOOL - 33 N. High St., Columhus\nCARL I LB, Mrs. W. A. - 2595 Bryden Road, Columhus\nCARLSON, FLOYD E. - Asst. Prof. Forest Extension, NY St. College Forestry, Syracuse\nUniversity - Syracuse, New York\nCARR, HAROLD H. - Program Director, WOAI t- IO31 Navarro, San Antonio 1, Texas\nCARRINGTON, ELAINE - Writer, 17 West 54th Street, New York\nCARSKADOH, THOMAS R. - Chairman, Radio Committee, American Civil Liberties Union,\nNew York: — Chief, Education Department, 20th Cent, Fund,\n33C West 42nd Street, New York\nCARVER, CHARLES H. - WH2C, Inc, r 40 Franklin.Street, Rochester, N, Y.\nCASE, CLAUDIA A. - Continuity Writer, WCOL - 33 N. High St., Columbus\nCASON, FRANK A. - Production Dept., WSB - Biltraore Hotel, Atlanta, Georgia\nCASPERSON, CHARLES - South High School, Columbus, Ohio\nCASTLE. RUTH - Speech Teacher, Public School, Ambassador Hotel, Kansas City, Mo.\nCAVE, PEGGY- - Director Women’s Activities, KSD - 12th hnd Olive, St. Louis, Mo,\nCEAK, LEO J. - 3740 East l47th Street, Cleveland, Ohio\nCHAMPION, JO - South High School, Columbus, Ohio\nCHANDLER, GLORIA - Radio Consultant, Assn, of Junior Leagues of Amer., Inc, - Wal¬\ndorf-Astoria, New York\nCHANG, GERTRUDE H. - School of the Air, Asst., WBAA, Purdue Univ. - W. Lafayette,Ind,\nCHANG, SHELDON\nCHAO, PUHSIA FREDERICK - Representative, Chinese National Association of Adult\nEducation, Pishan, Szechwan, China: - Jurnald Hall,\nColumbia University, New York\nCHAPMAN, ALVAM L. - Bureau Research Education by Radio, Univ. Texas, Austin, Tex.\nCHAPMAN, JAMES P. - Director Agriculture, WTAM - 815 Superior Ave, Cleveland, 0.\nCHAPMAN, LEILA M. - 65 S. Fourth Street, Columbus, Ohio\nCHARLES, ANN - Music Director, WOSU t- 134 - 15th Avenue, Columbus\nCHARNLEY, MITCHELL V. - Prof. Journalism, School of Journ., Univ. of Minn. Minn.\nCHARTERS, W. W. - Director Research Service, Stephens College - Columbia, Mo.\nCEASE, FRANCES BROWN - Coordinator, Youth Broadcasts Radio Workshop, 1192 Webster\nHall, Detroit 3I» Mich.\nCHASE, W. HOWARD - Director, Dept. Public Relations, General Foods Corp. - 250\nPark Avenue, New York\nCHASE, W. LINWOOD ^ Prof. Education, Boston University School of Education - 84\nExeter Street, Boston l6, Mass.\nCHASINS, ABRAM - Music Consultant, N. Y. Times - WSXR, New York\nCEAVOUS, ARTHUR M. - Chm. Dept. Ind. Ed,„ Wilberforce Univ., Wilberforce, Box 286\nCHILD, ROBERT £. - Charge of Programs, Agricultural Broadcasting, WGY, General\nElectric Co,, 1 River Road, Schenectady 6, New York\nCHILLRUD, MRS. ELLA G. - Chm. Children’s Radio programs, Northeastern Radio Council\nSchenectady - 722 Plymouth Ave,, Schenectady, New York\nCHOW, FABIAN - Director, Chinese Nows Service, Midwest Bureau - 201 N. Wells St.,\nChicago\nCHRISTENSEN, FRED G. - Production and Programs, WMPS - 215 Columbian Mutual Tower\nBuilding, Memphis 3* Tenn.\n- 4 -"
}