{
  "id": "d1688-4",
  "text": "NAME\nORGANIZATION\nHAILING ADDRESS\nCHRISTIAN, MRS. HENRY C. - Public Relations Chra, Cleveland Radio Council - 1568\nLauderdale Avenue, Lakewood 7» Ohio\nCHRISTIANSEN, KENNETH A. Asst. Prof. Speech, Ind. St. Teachers College, Terre\nHaute, Ind.\nCHURCH, CHARLES F. JR. - Director of Education and Research, KM3C - Pickwick Hotel\nKansas City, Missouri\nCLAGGERT, CHARLES E. - Vice-Pres. Gardner Advertising Co. - 915 Olive St, St, Louis\nCLAIR, JOHN J. JR. - Frederick Hart and Co, Inc. - 350 Madison Ave, Hew York\nCLARK, MRS. VIRGINIA BERRY - Extension Specialist, Home Management, WBAA, Purdue\nUniversity, West Lafayette, Indiana\nCLARKE, LUCILLE V. - 728 Clarerdon Road, Narberth, Pennsylvania\nCLEMENS, PAT - South High School, Columbus\nCLOS, JEAN HENRI JR. -r Production Manager, WHAS, Louisville, Kentucky\nCOBWIN, ESTA - South High School, Columbus\nCOHEN, JUSTIN R. - Ohio State University\nCOLE, IMOGENS A. - ,0hio State University _ .\nCOLEMAN, ROBERT J. - Director WKAR, Michigan State College, E. Lansing, Michigan\nCOLLICOTT, RUTH - 323 W 9th Avenue, Columbus\nCOLLINGS, MARI L. - Home Economist, Extension Service, U. S. Dept. Agriculture,\nU.. S. Dept. Agriculture, Washington, D. C.\nCOLLINS, ELEANOR - Asst. Dean of Women, Pomerene Hall, OSU, Cols, 10 Ohio\nCOLLINS, NEIL - Byer and Bowman Adv. Agency - 2O3 S. Broad St., Columbus.\nCONNALLY, MARY P. - School of Public Health, Univ. of Mich., Ann Arbor, Michigan\nCOOKS, ANNE M. - Director Dramatics, Howard University, Washington - 1855 Calif.\nD.\nStreet NW, Washington D. C.\nCOOKE, PAUL - Instructor English, Miner Teachers College - Washington,\nCOOPER, MADGE - Director Women’s Activities, WMKM, Marion, Ohio\nCOPE, CHANNING t Farm Director, WAGA - Atlanta, Georgia\nCOPELAND, BILL - Byer and Bowman Adv. Agency, 2O3 East. Broad St., Columbus\nCOREY, OLGa - New Leader - 7 Bast 15th Street, New York\nCOREY, VICTORIA M. - Asst. Educational Director, XDKA * Grant Bldg, Pittsburgh^, Pa\nCORWITH, DORIS S. - Asst to Manager, Public Serv, Dept, NBC - 3^ Rockefeller, N.Y.\nCCTT, TED - Program Manager, WNEW - 5°1 Madison Avenue, New York\nCOTTSRMAN, JOSEPHINE H. - Jr. League Parkersburg, W, Va. - 2810 Riverview Drive,\nParkersburg, West Virginia\nCOYLE, WILLIAM E, - Radio Director, Washington Evening Star, Washington, D.^C.\nCRAMER JOHN F. - Dean, General Extension,Division, Oregon State System of Higher\nEducation - 220 S. W. Alder Street, Portland, Oregon\nCREED, CECILS A. - Field Asst, and Educational Consultant, Standard Oil Company\nof Calif. - 225 Bush Street, San Francisco, Calif.\nCREMEENS, GEORGE W. - Special Events Director, KRNT - 715 Locust, Des Moines,\nCHILL, LUCINDA- Analyst, U. S. Dept. Agriculture, Washington, D. C.\nCRISSMAN, HELEN JO. - 26 E 56 Terrace, Kansas City, Mo.\nCROOKS, WILLIAM K. t Program Manager, WFMJ, 101 W. Boardman, Youngstown, Ohio\nCROSS, CHRISTOPHER - U. S. Radio Liaison Officer, United-Nations, New York\nCROWE, RAMONA - South High School, Columbus\nCUMMINGS, JAMBS E. - National Catholic Educational Assn. - 1312 Mass. Ave NW,\nCUNBEN, DORIS - Collinwood High School, Cleveland, Ohio\nCUNEEN, PEGGY A. - Collinwood High School, Cleveland, Ohio\nIowa\nWash\n/DC\nDABNEY, MARY K. - Public Relations, Community Chest and Council - 155 E St.NY\nDALE, EDGAR - Ohio State University, Arps Hall, Columbus\nDALLY, ORVILLE L. - Ohio State University\nDAL23LL, MADGE - Director Continuity, WKMO ~ 400-1/2.N. Main St., Kokomo, Ind.\nDAMERON,XBNNETH - Faculty member, Ohio State University, Columbus\nDAMERON, Mrs. Kenneth - 1853 Tewksbury Rd., Columbus\nDAN AARON - Ohio State University\n- 5 -"
}