{
  "id": "d1688-5",
  "text": "NAME\nORGANIZATION\nMAILING ADDRESS\nDANIEL, R. CLIBTON - Manager, WCAS - Hotel Wm, Penn. Pittsburgh, Pa,\nDARBY, CLBLLA E. - Director, Des Moines Radio Council - 73r(i St., Des Moines, Iowa\nDARROW, BEN H. - Historian, OPA - Union Commerce Bldg, Cleveland, Ohio\nDAUBENSPECK, ELOISE - Chief-Radio Branch, OPA - 3rd and DS.U., Washington, D. •\nDAVIS, JAMES D. - Asst. Prof, Radio, Michigan State College - East Lansing, Mich.\nDAVIS, KENNETH L. - Associated Press - Dispatch Building, Columbus. ______\nDAVIS, MOSEE RABBI - Program Editor, Eternal Light, Jewish Theoxogical Seminary\n122 St and Broadway, New York\nDAVIS, NANCY E. - Ohio State University . .\nDEACON, RUTH E. - Home Demonstration Agent, Agr. Sxtenfeion Service, Cour ous ,\nCadis, Ohio\nDElaFIBLD, CHARLES - Supervisor of Exchange, C3C - 35>+ Jarvis St., Toronto, Ontario\nmmm, Ctuawm - Secy, for Radio, federation Protestant Welfare agencies -\n122 East 22nd St,, New York ,\nmm. ffiSCRffiS v. JR. - President, Town Hall, Inc. - 123 W* St.,\nDENNY, MRS. GEORGE V. JR. - Secretary, Town Hall, Inc, - 123 w 43 St., Now Y\nDE ROODE, DAVID - South High School, Columbus, Ohio\nDEVON MERRILL - Instructor, Ohio State University, Columbus\nDION, ELSIE - Director Women1s Programs, MBS - l440 Broadway, New York\nBICXSSSCJ5 JelXS 14. - Chief, Radio Section, toer. Red Cross - 17 and * Sts. Wash.\nDICXKAM. JOHN J. - Director Special Services, WBAL - Lexington Bldg., Baltimore\nDIETRICH, JOHN G. - United Press, Columbus\nDIXON, WILLIAM R. - Ohio State University\nDOBOS, JOHN - South High School, Columbus . , ,\nDONAHOE, HOWARD A. - Promotion Director, WOOL - 33 N. high St., Columbus\nDGNNALLY, MRS. ERED L. - 190 Clinton Heights, Clintonville, Columbus\nDONOVAN, S. A., REV. DUNSTAN - Ave Maria Hour - Graymoor, Garrison, New iorK\nDOCRLSY, KATHLEEN - Ohio State University\nDORN, JACK - South High School, Columbus\nDORRIS, VIRGINIA H. - Theatre Consultant, Assn. Jr. Leagues of Amer. - Waldorf\nAstoria, N. Y.\nDOUGLASS, DEAN S. - Regional Mgr., Educational Dept. RCA - 445 No. Lake Shore\nDrive, Chicago\nDOWNING, JAKES J. - Division Manager, UP - 220 E 42nd St., New York\nDOWNING, MARILYN - South High School, Columbus\nSi OLGA I Producer-Director \"House of Mystery\", Benton and Bowles - Uhh Madison\nDUBBY, ANN - Ohio State University ___ 1 * ,A\nDUNHAM, EDWIN L, - Producer, NBC - Radio City, New York r\nDUNHAM, BRANKLIN - Chief of Radio, U. S. Office of Education, wash, D. .\n15Qg Gallatin Street NW, Washington, D. C.\nDIMI, JOHN W. - Director, WNAD, University of Oklahoma, Norman, Oklahoma\nDURR, CLIBBORD J. - Commissioner, BCC - Washington, D. C.\nEAST, CHARLES M. -\nECKSLBEBRY, ROSCOE\nEDELSBERG, ROSALYN\nEGAN, MARGARET C. -\nEDMONDS, JOHN M. -\nEDWARDS, WILLIAM T,\nEHRENSBERGER, RAY -\nSIGNS, SIDNEY H. -\nElSENDERG, PEARL L\nELLIOTT, RUSSELL E\nCounty.-Agricultural Agent, Floyd County - 17^1 £. Spring,\nNew Albany, Ind. ^ _ ,\nH. - Editor, Prof, Ohio State University - Columbus\n- South High School, Columbus, Ohio ,\n. Bacuity Director, New Tools Bor Learning - 280 Madison yye. , NY\nRadio Manager, Community Bund - 100 W. Monroe, Chicago, Ill.\n, - Director Instruction, Bla. St. Dept. Education, Tallahassee\n- Chm. Dept. Speech, Radio, University Maryland, College Park\nManager, Press Dept., NBC - 30 Rockefeller Plaza, New York\n. , Ohio State University\n, r. Director Public Relations, Detroit WMCA - 2020 Witherell,\nDetroit, Mich.\n- b -"
}