{
  "id": "d1688-7",
  "text": "ORGANIZATION\nMAILING ADDRESS\nNA ME •\nFOX, FRANCES I. - Radio Specialist, Farm Security Administration, U. S. Dept, of\nAgriculture — 2090 Pennsylvania Ave SE, Washington D. C.\nFRANK, JEAN - South High School, Columbus\nFRANK, JOSETTE - Educational Associate, Child Study Assn. Amer. - 221 W 57 St, NY\nFRANK, PHILIP - Exec. Secy, BMI - 2?0 Park Avenue, N. Y.\nFRANK, RUDY - Promotion Manager, WELI - 221 Orange Street, New Haven, Conn.\nFRANKEL, LOU - Writer, American Mercury - 510 Lexington Avenue, N. Y. - 250 Albany\nAvenue, Brooklyn, New York\nFRANKLIN, HAROLD - Program Director, Inst. Democratic Education, Inc. - 415 Lex¬\nington Avenue, New York\nPRATER, FRANCES - Educational Director, McClatchy Broadcasting Co., Sacramento.\nFREDRICK, BOB - South High School, Columbus\nFREEMAN, ANDREW G. - personnel Counselor, AAF Wright Eield, Dayton, 606 E. Main\nSt., Xenia, Ohio\nFREEMAN, G. MALLORY - Asst. Manager, WRNL - 323 E. Grace St., Richmond, Virginia\nFRENCH, JOSEPHINE -r Director, Radio Education, Akron Board - 70 N. Broadway,Akron\nFRENCH, ROBERT S. - Director Operations, WAKR - 1st. Central Tower, Akron, Ohio\nFREYREs SSNORITA - Council for Inter-American Cooperation, Argentina\nFRIAR, JEANNE E. - University of Cincinnati, Cincinnati, Ohio\nFRIEDHEIM, ROBERT W. - Manager, Radio Recording Division, NBC, New York\nFRYE, GRACE HARE - Exed. Director, Columbus Town Meeting - 5^4 E Broad, Columbus\nFRYE, HOMER E. - Manager, Better Business Bureau - 35 E. St., Columbus\nFRY, PAUL R. - Vice-Pres., KB ON - 2027. Dodge, Omaha, Nebraska\nFRY, STEPHEN r Program Operations Director, BBC - 63O Fifth Avenue, New York\nFULKERSON, W. KENNETH - Head, Rochester Board of Education - 233 Roslyn St, Roch.\nFULTON, MARGARET J. - 6676 Woodweil Street, Pittsburgh, Pa.\nFUNNELL, MILDRED - Director Women’s Activities, WTAM - NBC Bldg, Cleveland, Ohio\nFURNISS, WALTER - News Editor, WOOL - 33 N. High St., Columbus\nGABBARD, BESSIE F. - Asst. Prin. Linwood School - 1609 Clayton St, Cincinnati, 0.\nGAFFNEY, PAULINE M. - Radio Public Relations, McCurdy andCo. - E, Main, Rochester\nGAIL, HARRY R. - School Service Dept., Westinghouse Elec. Corp, - 306 Fourth\nAvenue, Pittsburgh, Pennsylvania\nGALLSH2R, W. C. - Education Director, KYW - l6l9 Walnut St, Philadelphia, Pa.\nGALLEYS GLADYS - Chief, Division of Field Studies, Extension Service, Wash. D. C.\nGARAFREDIAN SADIS S. - Advertiser, Newark Advocate - Newark, Ohio\nGARDNER, DEWALD J. - Agricultural Attache, South African Legation - 3101 Mass.\nAve., Washington, D. C.\nGARNEAU, WALLACE L. - Director of Radio, Western Michigan College, Kalamazoo\nGARRIGUS, FREDERICK H. - Asst. Program Manager; Educational Director, WESI -\n182 Tremont Street, Boston 12, Mass.\nGARVIN, ALMA L. - Extension Nutritionist, Campbell Hall, Ohio State Univ., Cols.\nGARWOOD, KELTON - South High School, Columbus\nGAY, CHUCK - Radio Editor, Dayton Daily News, Dayton, Ohio\nGE3HARD, BRUNO - Director, Cleveland Health Museum - S9H Euclid Ave., Cleveland\nGESHRING, BETTY J. - Teacher, East Columbus School\nGELLHORN, MRS. GEORGE - President, Radio Council, St. Louis - 4366 McPherson,\nSt. Louis, Mo.\nGEORGE, RAMON T. - Director Radio Broadcasting, Western Washington College of\nEducation - N. High, Bellingham, Washington\nGERARD, GEORGE - Ohio State University\nGIB3GNY, HAZEL L. - Instructor, Teaching Aids Lab., Ohio State University, Cols.\nGIESSL, HUGH N. - Manager, WBCM - 100 Center, Bay City, Michigan\nGIFFORD, LYNN E. - Program Director, WBBN - Warren, Ohio\nGILBERT, GEORGE - Kent State University, Kent, Ohio\nGILL, CHARLES F, - Sales Manager, Audio Section, General Electric Company -\n1001 Wolf Street, Syracuse, New York\n- 6 -"
}