{
  "id": "d1688-8",
  "text": "NAME\nORGANIZATION\nMAILING ADDRESS\nGILL, HELEN - Manager, Radio Dept., New Tools for Learning Bureau, 280 Madison Ave\nGILSTRAP, MARGUERITE - Radio Information, US Dept Agriculture, Washington, DC /NY\nGIMPRICH, ROSALIE - Antioch College, Yellow Springs, Ohio\nGINN, ANN - Director Women's Acitivites, WKMO - 400 l/2 N. Main St, Kokomo, Ind.\nGIN SLAP-, JOHN - Ohio State University\nGIRLING, BETTY T. - Director, Minnesota School of the Air, KUOM, Univ, of Minn.,\nMinneapolis, Minnesota\nGIST, RUSSELL H« - State Agent, Extension Divison, College of Agriculture -\nOglebay Hall, Morgantown, West Virginia\nGLADE CARL F. - Ohio State University\nGLASCOCK, ANN T. - Stephens College, Columbia, Mo.\nGLENN, HELEN - 44-15 Rosemary Parkway, Columbus\nGLASCOW, MRS. EDWINA T. - Director Public Relations, Columbus Urban League -\n107 N. Monroe Ave,, Cols,\nGODDARD, BETTE L. •* Home Economics Extension Representative, Extension Service,\nCommunity Building, Butler, Pennsylvania\nGOLDBERG, RUTH D. - Assoc. Amer. Soap and Glycerine Producers, Inc. - 295 Madison\nAvenue, New York\nG00D30LD, ELLA M2IKLA - Pres. Cleveland Radio Council - 332b Bradford Rd. Cleve.\nGUULO, BRADFORD S. - Ohio State University\nGOULD, JACK - New York Times, New York\nGOUSTIN, IRENE JUDITH - KUOM, University of Minn., Minneapolis, Minn.\nGOVS, FLOYD S. - Head, Dept, of Education, Oberlin College - 172 Elm St., Oberlin\nGRAMSERG, SALLY L. - Continuity, WHKC, Columbus ^ /Ohio\nGRANT, LOWELL E. - Director, Flint Public Schools Radio Workshop - 23O1 Moun¬\ntain, Flint, Mich.\nGRANGER, LESTER R. - Exec. Secy., National Urban League - 1133 Broadway, New York\nGRAYSON, MITCHELL - Producer, ABC - Radio City, New York - 233 £ 3^h St, NT\nGREGG, META F. - Teacher East High School - 110 S. Ardmore Road, Columbus\nGRENZOW, DAISY - Editor, Amer. Education Press - 400 S. Front St., Columbus\nGRIFFIN, BETTY C. - Educational Director, WIBX - 1st Nat'l Bank Bldg., Utica,NY\nGRIFFITH, BERNARD I, - Asst. Secy, Ohio Education Assn. - 215 E Broad St, Cols.\nGRIFFITH, LOUISE - 1955 N. Devor Road, Columbus\nGRIFFITH, W. I, - Director, WOI, Iowa State College, Service Bldg., Ames, Iowa\nGRIMMGN, JAMES W. - Director Audio-Visual Aids, Ontario Dept, of Education -\nPark Bldgs, Queens Park, Toronto, Ontario, Canada\nGRISEWOOD, EDGAR N. - Director Univ. Broadcasts, NYU - 100 Washington Square, NY\nGROSS, MRS. C, C. - Chra. Radio and Motion Pictures, Women's Department, Ohio\nCouncil of Churches - 288 S North Broadway, Columbus\nGROSSMAN, ELIZABETH - Ohio State University\nGROVE, ELSIE - Teacher, South High School - 93° Francis Avenue, ^Columbus\nGRUNZWEIG, FREDERICK, B. r Czechoslovak Government Information Service -\n1790 Broadway, New York\nGUERNSEY, SLWOOD, D. - Inductive Coordination Engineer, Ohio Bell Telephone Co. -\n42 East Gay Street, Columbus\nHAAS, MARK L. - Educational Director, WJR ** Fisher Bldg., Detroit, Mich.\nHACKATHORN, KENNETH K. - Vice-Pres., General Manager, WEK - 1JH Terminal Tower\nCleveland, Ohio\nHAID, ALLEN L. Managing Director, WHIZ - Lindarcade, Zanesville, Ohio\nHAINES, HOWARD F, - Ohio State University\nHAINES, SUB R. - Asst. Elementary Education, Ohio State University, 222 - loth\nAvenue, Columbus\nHALL, DON - South High School, Columbus\nHAMILTON, WILLIAM H. - Radio Manager, Adv. Dept., B. I. duPont de Nemours and Co.\nInc., Nemours 2535 - Wilmington 98, Delaware"
}