{
  "id": "d1688-9",
  "text": "NAME\nORGANIZATION\nMAILING ADDRESS\nHAMMERSMITH, GEORGE J. - Soc. Studies Teacher, Macomber Vocational High School >-\nUl35 Mayfield Drive, Toledo, Ohio\nHAN AUER, BERT - Program Director, WFBR - 10 E. North Ave.., Baltimore, Mary land\nHANLON, JIM - Asst, fublic Relations Director, NGN - 44l N. Michigan Ave, Chicago\nHANNA, GENEVA R. - Instructor, Ohio State University University School, Columbus\nHANSON, GERTIE L. - Director Radio Workshop, Central State Teachers College,\nStevens Point, Wisconsin\nHARDER, GEORGE A. - Manager, Public Relations, Westinghouse Radio Stations, Inc.\nl6l9 Walnut Street, Philadelphia, Pa.\nHARDY, LSLA - Asst. Prof., Ohio State Univ. - 2685 Eenthorn Road, Columbus\nHARMON, TOM D. - Farm Editor, WOOL - 33 N. High Street, Columbus\nHARRIS, CARL - South High School, Columbus\nHARRIS, JOAN S. - Ohio Wesleyan University, Delaware, Ohio\nHARYO, JAMES - Office Training School, Columbus\nHARLEY, WILLIAM G. - Station Manager, WHA, Radio Hall, Madison, Wisconsin\nHARM, MARJORIE LEA - Director Child Program, WHK - Terminal Tower, Cleveland\nHARMaN, tom D. - Farm Editor, WOOL, Columbus - Box 22b, Circleville, Ohio\nHARMAN, L. FOSTER - Public Relations and Promotion Manager, WKBN - 1? N. Champion\nStreet, Youngstown 3» Ohio\nHARPER, FLORENCE - Teacher, Columbus schools - 65 S. 4th Street, Columbus\nHARRY E. - Vice Pres., Sales Mgr., Bell Sound Systems, Inc.- 1183 Essex Ave\nPATRICIA - Ohio State University . /Columbus\nOhio\nHARRIS\nHARRIS\nHARRISON, HENRIETTI\n347 Madison\nK. - Nat1It Radio Director, Nat1If Council YMCA\nAvenue, New York\nHARRUFF, PATRICIA - Ohio State University _ .\nHARSEMAN, MRS. GEORGS - Radio Vice-Chairman, Red Cross - cS W. Monument Ave., Dayton\n536 Daytona Parlay, Dayton, Ohio\nHART, ESTHER R. - Home Economics Extension Representative, Agricultural Extenfeion,\nCourt House, Franklin, Pennsylvania (Box 468) n\nKART, tERS. HENRY G. - Dept, of Speech, Vanderbilt University, Nashville, ienn.\nHASKINS, JAMES S. - Agricultural Relations, Carl Byoir and Associates, Inc.\n10 E. 40th Street, New York\nHATHAWAY, MRS. LLOYD B. - Chin., Winston-Salem Radio Council - 6th Floor, Pepper\nBldg., Winston-Salem, N. C.\nHAWK, VIRGINIA - Promotion Director, Univ. Chicago Round Talbe, Univ of Chicago\nHAWKINS, GORDON - Program and Education Director, Westinghouse Radio Stations, Inc.\nIbl9 Walnut Street, Philadelphia, Pennsylvania\nHAWTHORNE, MRS. WILLIAM B. - Cleveland Business and Professional Women’s Clubs and\nCleveland Radio Council - 1870 E 101 St, Clevelana.\nHAYWARD MICHAEL, Instructor, New York Univ., Washington Square, New York\nHAZARD, ALINE W, - Director Home Programs, WHA, U. of Wise., Madison, Wisconsin\nHEATKMAN, JESSIE E. - Asst. Extension Editor, Director Home Economics Radio Pro¬\ngrams, University of Illinois - Urbana, Illinois\nFEBEEER, MILES - N* Y. State Radio Bureau, 112 State, Albany, New York\nEEF^ERNAN, DAVID J. - 1st Asst. Cook County Supt. Schools, Chicago - 9545 Hamilton\nHELLER, ROBERT P. - Producer, CBS - 485 Madison Ave, N. Y. I Chicago\nHELMAN, EDWIN F. - Coordinator, Senior High School programs, WBOE, Cleveland rub-\nXic Schools - 1380 East 6th Street, Cleveland, Ohio\nHENDERSON, JOHN - Production Manager, WBAA, Purdue Univ., W. Lafayette, ^Indiana\nHENRY, HELEN - Women’s radio Director, WSAM - 6l0 Eddy Bldg., Saginaw, Michigan\nHERNDON, CARLES A. - Information Specialist, Radio Service, U. S. Department 01\nAgriculture - 705 Oglethorpe St. NW, Washington, D. C.\nHERRICK, DWIGHT B. - Manager, Public Service Department, NBC, Radio City, New-Ybrk\nEESLEP, CHARTER - Washington Repr. MBS - 712 Jackson PI. NW, Washington, DC\nHESTER, HARRIET H. - Free-lance writer, producer - 1300 Davis St., Evanston, Ill.\n- 10 -"
}