{
  "id": "d1221-12",
  "text": "-12.\n19# TV ENGINEERING WORKSHOP WINNERS ANNOUNCED\nThe names of the 2£ recipients of the TV Engineering Workshop Grants, awarded by\nthe National Association of Educational Broadcasters have been announced by Dr.\nHariy j. Skornia, NAEB Executive Director,\nThe grants, providing for travel and living expenses, are to enable engineers with\nprimary responsibilities in educational television to receive additional profes¬\nsional training and intensive supervised experience. The Workshop, to be held at\nEast Lansing, Michigan, September 12-16, was made possible by a grant from the Fund\nfor Adult Education.\nWorkshop grant recipients were selected by the NAEB Engineering Committee.\nNames of the 25 winners are:\n1* Andresen, Emil H. - Chief Engineer, Radio Station WBEZ, Board of Education,\n228 North LaSalle Street, Chicago 1, Illinois.\n2, Arnold, Edward J. - Technical Consultant, Channel 2U,'Baltimore Community Edu¬\ncational TV, Inc., 1121 Ramblewood Road, Baltimore 12s Maryland.\n3. Baird, Robert E. - Chief Engineer, Radio Station KWSC, State College of Wash¬\nington, Pullman, Washington.\nU. Benson, William Gordon - Transmitter Supervisor, Radio Station KUOM, University\nof Minnesota, Minneapolis, Minnesota.\n5>. Berbaum, Clarence -Assistant Chief Engineer, University of Illinois, Television-\nMotion Picture Unit, 320 Peabody Drive, Champaign, Illinois.\n6. Boggioni, A. J. - Radio Engineer, Radio Station WOSU, The Ohio State University,\nColumbus 10, Ohio.\n7. Byrd, Jim - Chief Engineer, Television Station KUHT, Cullen Boulevard, Univer¬\nsity of Houston, Houston, Texas.\n8. Colaw, Donald W, - Assistant Broadcast Engineer, University of Illinois, Tele¬\nvision-Motion Picture Unit, 320 Peabody Drive, Champaign, Illinois.\n9* Evans, Herb - Chief Engineer, Station WTHS-TV, 275> N. W. Second Street, Miami\n36, Florida.\n10. Gorsuch, Harold D. - Chief Radio Operator, Radio Station WOSU, The Ohio State\nUniversity, Columbus 10, Ohio.\n11. Higgy, R. C. - Director, Radio Station WOSU, The Ohio State University, Columbus\n10, Ohio.\n12. Johnson, James R. - Supervisor of Engineering Tests, Television Station WOI-TV,\nIowa State College, Ames, Iowa.\n13. Kaspar, Vernon J. - Engineer-in-charge, WOI-TV Studios, Television Station\nWOI-TV, Iowa State College, Ames, Iowa."
}