{
  "id": "d1221-14",
  "text": "Proposed WUNC-TV nUni-Sync\" System\nIn the Technical Tips column of the July NAEB Newsletter we mentioned three micro-\nwave installations linking together multiple studio operations feeding an educa¬\ntional TV transmitter. Unless each studio has a film chain, the integration of\nslides and film into a program is a problem due to picture rollover. Each instal¬\nlation presents an individual problem due to location of the film chain with re?*\nspect to the transmitter.\nCharles A. Idol, Engineer-in-Charge of the WUNC-TV Raleigh studio is working on\nthis sync lock problem. WUNC-TV has three studios, at Raleigh, Chapel Hill and\nGreensboro. The film chain is located at the transmitter site which is about eight\nmiles from Chapel Hill. Here, in brief, is the plan Mr. Idol is working on to en¬\nable WUNC-TV to switch or lap and super slides at the transmitter over the video\nfrom any of their three studios without difficulty.\nAt each studio sync from the transmitter is received with a Conrac tuner, processed\nwith the stabilizing amplifier, then fed into the special equipment. In this\nequipment, the horizontal components are separated by differentiation and fed into\na multivibrator, whose period is sufficiently long so the equalizing pulses do not\ninitiate a cycle of operation. The purpose of this unit is to produce output pulses\nat 15.7SO kc only, with no 31.£ kc pulses at all. Each of these output pulses is\nfed into a phantastron circuit, provided with an adjustable time constant from\nabout £ microseconds to about U0 microseconds. The trailing edge of the resulting\nrectangular pulse is used, after differentiation and clipping, to operate the hori¬\nzontal section of the RCA Genlock on the sync generator. Adjustment of the phan¬\ntastron delay results in the pictures being locked horizontally, with the sync be¬\ning transmitted from the transmitter, as they arrive at the transmitter.\nThe horizontal section, described above, performs very well. Without the vertical\nsection, however, the device is pretty well worthless. To provide the required\nvertical delay, about 16,300 microseconds, more complicated means are required.\nIt was decided that, even with its unusual stability, the phantastron circuit would\nnot delay 16,000 microseconds with the required stability. Hence, recourse was\ntaken to counters, where, it is expected, more exact methods obtain.\nBriefly, the horizontal pulses, after elimination of the equalizing pulses des¬\ncribed above, are fed into a system of binary counters. Since the vertical sync\npulse occurs coincident with a horizontal pulse during one field and 31.75 micro¬\nseconds behind a horizontal pulse during the next field, mere counting of the\n15.75 kc pulses will not result in a constant delay from field to field. Hence,\nwe have resorted to producing of 31.5 kc pulses from the 15.75 kc pulses, and\nthese are the pulses that are counted. After a prescribed number, 520, have been\ncounted, a gate is opened, through which comes an equalizing pulse from the delayed\nhorizontal pulses (output of the above-mentioned horizontal section). This set of\n31.5 kc pulses, too, is generated from the 15.75 kc output pulses. The pulse that\ncomes through the gate triggers a univibrator, which generates a synthetic vertical\nsync pulee (no serrations). This synthetic vertical sync pulse is fed into the RCA\nGenlock vertical phasing section. Assuming the counter circuits open the gate at\nthe proper time, the total delay produced is very nearly determined by the hori¬\nzontal section, namely the phantastron circuits. The counters are reset by a ver¬\ntical sync pulse, separated from the sync input by integration."
}