{
  "id": "d1221-2",
  "text": "-2-\nwill be prepared by committee members and made available to the NAEB merbership.\nThe committee reconvened Monday evening and Tuesday morning. It adjourned Tues¬\nday afternoon in time for Carl Menzer and John Brugger to catch late afternoon\nplanes.\n##***##*ana\nWe had a number of items in our Newsletter folder to include in the column this\nmonth but to us the news of new developments at the NARTB Convention in Washington\nrates priority. Perhaps the most unique of these-is the DuMont flying spot tech¬\nnique for live television pick-up called VITA3CAN. In this system a flying spot,\nor beam of light from a cathode ray tube \"scans” the scene or object to be tele¬\nvised. The light reflected from the object or persons in the scene is picked up\nby multiplier photo tubes. The tubes convert the light into a black and white or\ncolor television signal that may be broadcast from a television transmitter.\nIn the DuMont display, two light sources or scanners were used: one fixed, taken\nfrom a regular DuMont film scanner and passed thru a port in a wall and focused on\nthe set; one portable and mounted like a camera with a lens turret containing four\nlenses for varying the angle of the shot. T'ke multiplier photo-tubes are placed\nin •’scoops” similar to those used for conventional TV lighting. Four tubes are used\nin each scoop, two with red selective filters, one with a blue selective filter and\none with a green selective filter. The filters permit only the light of a desired\ncolor to pass into the cell. Four, six or eight of these ’'scoops\" may be used to\npick up a scene. They are placed in the same relative positions as lights in a\nconventional system and produce the same effect as lights when they are turned on\nand off.\nThe picture seen by these photo tubes may be transmitted either in black and white\nor in color. Since this Vitascan system operates by picking up reflected light,\nthe light source must be very rigidly controlled and no ambient or stray light per¬\nmitted to reach the scene. Thus, talent on the program is working practically in\nthe dark since the light from the flying spot sc-miner is not sufficient to light\nthe studio. By using stroboscopic lights so synchronized that they light only dur¬\ning verticle blanking time, the persons being televised \"see” a lighted studio\nwhile the scanning \"light” sees a dark room.\nObviously this system cannot be used for outdoor pickups. Neither could it be used\nfor large productions. However for most local inserts in net programs, for news,\nfor talks, for commercials, or small studio operation, seems to me it is a very\npractical thing.\nAccording to DuMont’s price sheet, stations already equipped with a Monochrome\nMultiscanner can be equipped for live monochrome for $9,207. For stations with a\ncolor Multiscanner, equipment for live color costs $15,692.\nFor stations with no present Multiscanner equipment, live monochrome equipment will\ncost $18,415 and color monochrome equipment may be secured for $32,570. If you want\nmore information on this latest development, write DuMont for their brochure on the\nVitascan Color Studio Scanner or see p. 122 of the May 23 Broadcasting-Telecasting\nMagazine or p. 10 of the liav 21 Television Digest."
}