{
  "id": "d1221-4",
  "text": "scope. We wish it were possible for every engineer in educational broadcasting to\nattend this exhibit of broadcasting equipment. We would also wish that they might\nhear the papers presented at the Broadcast Engineering Conference held in connection\nwith this convention. Perhaps in the next year some arrangement can be made so\nthat those who have the time, the desire, and the means can attend.\na#*#-###*###\nAlso of interest in educational circles were two demonstrations being held contin¬\nuously last week in Washington: FM Multiplexing and Phonevision.\nThe Multiplex Services Corporation, in cooperation with WGMS (FM) of Washington\nwere demonstrating their FM Multiplex equipment manufactured by Gates Radio Company.\nBy \"multiplexing” we mean the transmission simultaneously without interference of\nmore than one program on a single FM channel. One program is transmitted on the regu\nlar FM channel which may be picked up on the ordinary FM receiver. One or more pro¬\ngrams may be \"multiplexed” over this regular program by the use of special equipment.\nThese multiplexed programs are sent out on a super audible subcarrier in addition to\nthe public broadcasts. If only one program is multiplexed, ihe full 50-15,000 cycle\nFM frequency range may be transmitted; however if more than one program is multi¬\nplexed, the audio frequency range of each multiplex channel is limited to 50 to\n85000 cycles.\nObviously special receiving equipment must be employed to receive programs transmit¬\nted on the subcarrier (s). ‘The FCC has recently amended its rules to permit FM broad¬\ncast stations to use multiplex methods for the transmission of income-producing\nsubsidiary services such as storecasting, transitcasting, and functional music. It\nwould be possible for educational stations to employ multiplexing in an FM network\noperation. The network program could either be transmitted to the next relay station\non the main channel if it were to be carried locally or if a local program were\nscheduled at this time the net program could be transmitted on the multiplex channel.\nSchaefer Custom Engineering also had FM equipment on display; however tine did not\npermit us to see their equipment*\nThe Zenith demonstration of Phonevision also was of considerable interest. Some ed¬\nucators feel that some such system of scrambled television pictures may be an an¬\nswer to the problem of securing tuition for college or other courses televised for\ncredit.\nIn Phonevision, both audio and video are scrambled. The audio portion unscrambled,\nsounds a bit like inverted speech; the picture version is scrambled by changing\npicture polarity (i.e. blacks are white and vice versa) as well as horizontal dis¬\nplacement of groups of lines. Each subscriber’s TV set is equipped with a decoder\nwhich must be set properly for each program it is wished to receive. In the dem¬\nonstration system used, programs were numbered end on a punch board. By punching\nthe proper program number on the board, the code number (five digits) is uncoverd\nto which the receiver decoder must be set to receive the program. Each set must\nhave an individual combination set up, otherwise the code number for a particular\nprogram coulc be passed around.for friends and neighbors to use. The system might\nalso be set up so that the subscriber could purchase decoding information at coin\nmachines, utilize a coin box mechanism on the set or call a Phonevision operator\nfor decoding information."
}