{
  "id": "d1221-5",
  "text": "One other development at the NARTB Convention will no doubt produce a great deal\nof comment. It is the proposal by FCC Commissioner Robert E» Lee for a realloca¬\ntion of the spectrum between £0 and 890 megacycles. Commissioner Lee read his pro¬\nposal at the Thursday (May 26) morning session of the Broadcast Engineering Confer¬\nence held in conjunction with the NARTB convention. He wished it made clear that\nthis is not an official FCC proposal but is his own thinking on the matter.\nThis reallocation would provide hi television channels, six megacycles wide between\n60 and 3i;2 megacycles. It would delete only Channel 2 of the present VHP bands\nand include all of the present high band VHF channels (7-13). It would move the\npresent FM band (88-103 me) to the top of the TV channels giving FM 3i|2 to 362 me.\nIt would also mean moving military, aeronautical mobile and navigation, amateur,\nland-mobile, and government non-military channels. Commissioner Lee stated that\nthis was a long range project that might take as long as 1$ years to complete *\nMost of the comments we heard were favorable. The reallocation would bring all TV\ninto the VHF band. Due to ease of design of TV tuners, it might decrease the cost\nof all-band TV sets considerably. By proper choice of channels, some space mi gut\nbe found immediately although the complete change would take time. This plan if\naccomplished might well take care of television needs for the next 100 years as well\nas providing better transmission for the mobile services by moving them to the SU\nto 60 me band. Spectrum space of the entire UKF TV band would become available for\nreassignment.\nICONOSCOPE FILM CAMERA MODIFICATION*\nMany stations using iconoscope film cameras and slide changers which douse the lamp\nwhen slides are changed may have experienced the same sort of trouble that we have\nhere at KQED. During periods of slide change, an audibile 60 cycle hum was noticed\nin many receivers. After considerable experimenting it was finally found that same\nwas caused by the extreme change in level of black and white content and the sudden\nchange from a slide with large white content to total black during slide change.\nThis condition was finally licked and brought about two favorable conditions: first\nit entirely eliminated the 60 cycle hum during slide change, and second was much\nmore enjoyable to watch on the receiver as there were no great changes in contrast\nand no retrace lines visible during slide changes as so often is the case.\nThe above condition was eliminated in the following manner. A piece of zip cord\nwas connected from the slide changer rotating motor to two asc. sockets mounted\non the base inside the film camera as close to the front as possible, and two ho\nwatt lamps installed in same* As the slide projector lamp is doused and the rotat¬\ning motor starts, the zip cord leads which are in parallel with the rotating motor\nleads, will light the two UO watt lamps and thereby keep a fairly even light on the\nmosaic of the Iconoscope tube. Lamps of different wattage may be tried but in our\nparticular case the hO watt type proved most satisfactory.\n^'Contributed by Lariy M. Reed, Chief Engineer KQED, San Francisco, California,"
}