{
  "id": "d1221-6",
  "text": "-o-\nTV TECHNICAL TIPS NO. 10\nJuly, 19tt\nBy Cecil S. Bidlack, NAEB TV Engineer\nThe NAEB Engineering Committee, as this is written, is considering applications for\nthe 1955 NAEB TV Engineering Workshop. However,its decision on the participants\nwill not be made in time for us to include the names of successful applicants in\nthis issue of the Newsletter. Individuals will be notified as soon as a decision is\nreached, and the entire list of successful applicants will be published next month.\nThe Workshop will be held at WKAR-TV at Ea:,t Lansing, Michigan.\nBriefly, the program of this year’s Workshop has been set up to cover various phases\nof TV engineering on the five days of the week of September 12-16. The Monday\nmorning session will cover lighting, with talks on lighting fundamentals and measure¬\nment, TV lighting equipment, and TV lighting. Monday afternoon topics are inter¬\ncommunication systems, switching systems, production-engineering relationships\nand personnel problems. Monday evening will be given over to a round table dis¬\ncussion of the day’s program.\nTuesday and Wednesday have been set aside for kinescope recording. Tuesday morning\ntopics ares general considerations for making kinescope recordings, kinescope re¬\ncording systems, and a demonstration of operating practices on the WKAR-TV kine\nrecorder. Tuesday afternoon talks cover film cameras, magnetic sound recording,\noptical sound recording and kinescope quality control. The Tuesday evening ses¬\nsion will cover kinescope faults and shortcomings with film clips from the ETRC\nat Arm Arbor. Wednesday morning the WKAR-TV crew will demonstrate lighting, re-\nhersal and the actual kinescope filming of several types of TV program material..\nWednesday afternoon topics cover photographic aspects of kinescope recording, film\nprocessing and electronic gray scale for quality control. A trip to the local film\nprocessing plant is also scheduled. A round table session covering the day’s activi¬\nties is scheduled for Wednesday evening.\nThursday’s general theme is transmitters, with the morning session devoted to proof\nof performance measurements. Thursday afternoon will feature a round table on\ntransmitter operation, adjustment, and maintenance as well as a discussion of con¬\nsiderations of microwave installations and a description of systems in actual use.\nThursday evening. Workshop participants will get together at a dinner meeting at\nthe Kellogg Center.\nFriday morning’s session covers film pick-up devices and includes vidicon cameras\nand flying spot scanners. The new Du Mont Vitascan system will be discussed as well\nas a low power TV package. The morning session ends with a talk on TV test equip¬\nment. At the afternoon session the kinescope recording made Wednesday morning will\nbe shown and discussed.\nWorkshop participants will be expected to arrive Sunday afternoon or evening for\nroom assignments at Butterfield Dormitory, a new men’s dormitory a short walk from\nthe WKAR-TV studios. An informal coffee hour will be held Sunday evening at Kellogg\nCenter which is just across the street from Butterfield Eormitory. This will enable\nparticipants to register for the Workshop and offer the opportunity to get acquainted\nbefore the opening Workshop session on Monday morning."
}