{
  "id": "d1221-9",
  "text": "-9-\nTV Technical Tips No. 11\nAugust , 1955\nBy Cecil S. Bidlack, NAlB\nTV Engineer\nElsewhere in this issue of the Newsletter will be found a list of the\nRECIPIENTS OF THE TV ENGINEERING WORKSHOP GRANTS. IN THE JULY NEWS¬\nLETTER WE INCLUDED A BRIEF RESUME OF THE PROGRAM OF THE WORKSHOP.\n1/E HAVE LITTLE TO ADD TO THIS RESUME EXCEPT TO SAY THAT AT THIS DATE\nMOST OF THE PROGRAM DETAILS OF THE WORKSHOP HAVE BEEN SETTLED AND\nCONFIRMED, To US THE PROGRAM SEEMS TIMELY, INFORMATIVE AND VERY\nWORTHWHILE.\nAlong with the resurgence of radio, the NAEB Network is moving ahead\nTECHNICALLY. HERE AT NETWORK HEADQUARTERS WE ARE INVOLVED IN THE\nPROCESS OF CHANGING OUR DUPLICATORS OVER FROM HALF-TRACK TO FULL-TRACK\nRECORDING HEADS. THIS SHOULD BE GOOD NEWS TO SOME OF OUR NETWORK\nSTATIONS WHO HAVE ENCOUNTERED DIFFICULTIES IN PLAYBACK. At THE PRE¬\nSENT TIME, EIGHT OF OUR TWENTY-TWO DUPLICATING CHANNELS HAVE BEEN\nCONVERTED TO FULL WIDTH HEADS. The REMAINDER OF THE CHANNELS WILL\nBE CONVERTED AS SOON AS THESE HEADS ARE RECEIVED FROM OUR SUPPLIER.\nSO IF YOU NOTICE SOME CHANGE IN RECORDING LEVEL FROM TAPE TO TAPE,\nIT IS DUE TO THE FACT THAT ONE TAPE MAY BE FROM A HALF WIDTH CHANNEL,\nTHE NEXT MAY BE FROM A FULL WIDTH CHANNEL WITH CONSIDERABLY HIGHER\nOUTPUT.\nAS THIS IS BEING WRITTEN, ChAMPA I GN-UrBANA IS IN THE SECOND WEEK OF\nA PERIOD OF HIGH HUMIDITY. SINCE OUR QUARTERS ARE NOT AIR CONDITIONED,\nTHESE ARE TRYING DAYS IN THE \"BACK ROOM.” THESE ARE THE DAYS WHEN WE\nWISH WE COULD PUT EVERYTHING ON NEW TAPE, SOME OF THOSE RETURNED TO\nUS BEING VERY STICKY. THE STICKY ONES DRAG ON THE TAPE GUIDES AND\nSOMETIMES BREAK; MUSIC WOWS, AND MUCH TIME IS LOST. Vi E HAVE HOPES OF\nGETTING SOME RELIEF EITHER THROUGH AIR CONDITIONING OR DE-HUMIDIFYING.\nWhatever is done will probably be too late for this season.\nThrough it all, Glenn Blackburn, our Network Production Supervisor,\nCHECKS AND RE-CHECKS OUR OUTPUT, ENDEAVORING TO MAINTAIN A QUALITY\nSTANDARD FOR THE NETWORK.\nThe NAEB Engineering Committee too, is embarking on a quality control\nPROGRAM FOR THE NAEB NETWORK. SOON THOSE OF YOU FURNISHING PROGRAMS\nfor the Network will be asked to submit a test tape which Ed Kratt\nof WNYE HAS volunteered to test. From the information which you re¬\ncord, HE WILL BE ABLE TO CHECK HEAD ALIGNMENT, FREQUENCY RESPONSE,\nHARMONIC DISTORTION, NOISE AND TAPE SPEED. NETWORK HEADQUARTERS HAS\nORDERED A LOW DISTORTION AUDIO OSCILLATOR AND A NOISE AND DISTORTION"
}