{
  "id": "d1397-0",
  "text": "*—*• Prat»anted with the compliments of\nthe m\\mi committee u mn\nDABBLING ITT COLLEGE BROADCASTING* 1201 Sixteenth Street Northwest\nWashington, D. C.\nBy mischance not having received a copy of the program for this afternoon, I am\nat a loss to know the exact subject of my talk, also the subjects of the other talks\nto be given this session in order that X might know just how I should fit into the\nscheme of things. I trust that my comments will not however be a mere repetition of\nwhat every one else has said. Yet I suspect that most of us have had very similar\nexperiences; the only object in reporting them being the hope that the weight of the\nsum total of them will someday be of sufficient pressure to bring about changes.\nFor the past four years Western State Teachers College has had two fifteen-\nminute broadcasts per week, plus one half hour Sunday twice a month, over the local\ncommercial station which has a service radius of about one hundred miles. The sta¬\ntion has been a part of the Michigan network, and is to be a part of the NBC this\nyear. My own experience with the broadcasts has been limited to the past two years\nand has been a responsibility added to my already existing full-time job.\nMy most trying experiences have been with attitudes of skepticism or condescen¬\nsion from four different angles. In mentioning these, 1 do so because these are the\npoints at which we need most help. Let me hasten to add, however, that actually\nthose were overshadowed by the response which we received from our listening audi¬\nence and by the cooperation and hard work of faculty members and outsiders asked to\nparticipate. Some.of the fifteen-minute roundtables broadcast ranwired, according\nto reports, from fifteen to twenty-five hours preparation on the part of the partic-\nipants.\nin the first place, many faculty people even yet look upon radio programs as\nbeing primarily cheap and vulgar having about the same relation to the listening\naudience as the penny tabloids have to the newpaper reading public. A few\ntain for the radio such contempt that they will not even have receivingsets\n\"address by Dr. William McKinley Robinson, Director, o?'their\ntional^Association1*?6fidvSational’Broadclsters, Iowa City, Iowa, September 10, 1935."
}