{
  "id": "d1397-1",
  "text": "FLORIDA LEGISLATURE OVERCOMES ADMINISTRATIVE APATHY\nRunors of difficulties in providing for the operation of st vtion WRUF, of the\nUniversity of Florida, have been heard. Major Garland Powell gives us this first¬\nhand information. ’’The Governor and the Budget Commission recommended to the\nLegislature that they lease the station. The Senate was agreeable to that but\nour Senator finally got a bill through for an appropriation of $37,000 to run the\nstation one year while they were trying to lease it, and finally increased our\nappropriation $7,400 a year for two years. Therefore, in a joint meeting of the\nAppropriation Committees of the two houses neither would accept the other’s\nrecommendations. Finally tho House sent their committee back to the Senate com¬\nmittee and said they would not withdraw from their position. Consequently, the\nSenate accepted and our appropriation went through for $40,000 a year for the\nnext two years. The bill became a law without the Governor’s signature.”\nMajor Powell and his helpers are to be congratulated on successfully demon¬\nstrating that their work is truly in the state’s interest.\nWISCONSIN GETS SCHOOL BROADCASTING GRANT\nTo carry on a comprehensive study of the place and value of radio in the\nclassroom the general Education Board has provided funds for a two year study at\nthe University of Wisconsin in conjunction with Station WHA.\nLester Ward Parker has been named radio education specialist on the project\nand is now at work on preliminary arrangements. Tho Wisconsin School of tho Air\nwill be used in connection with the experiments. Further appointments of person¬\nnel will bo announced soon.\nSHORT FLASHES FROM THE FIELD\nWCAL - St. Olaf College. This report on the WCAL-WLB application comes from\nM. C. Jensen, manager of the Northficld station:\n”No report has been available on the WCAL-ViLB application as yet. Although\nthe hearing was hold May 5, Governor Benson of Minnesota succeeded in keeping the\nrecord open until June 25, when he filed a deposition in opposition to the appli¬\ncation. as we understand it, the deposition was accepted by the Commission on\nJuly 1, and the Examiner is expected to release his report very shortly. However,\nthe Commission expects to recess about the middle of July, and v/ill not convene\nagain until some tine in September. Therefore, a final decision on the application\nis not looked for until some time in the Fall.”\nWRUF - University of Florida. Major Garland Powell, director of the station,\ntolls of a new program which may suggest an idea for other states. He says, HFe\nhave a very important series of broadcasts going on now which have tremendous\neducational value. We call them the FLORIDA INDUSTRIAL BROADCAST. We are taking\none big industry a month, going to its place of operation, and while they are\noperating go from place to place describing what they are doing, how thoy 'ire\ndoing it, tho number of men emoloyed, and all of the very pertinent facts.”\nSend your notes for the next news letter\nto NAEB headquarters regularly:\nHarold a. Engel, Exec. Secy.\nRadio Hall, Madison, Wis.\nON TO URBANA - SEPTEMBER 13-14\nN-A-E-B ANNUAL CONVENTION"
}