{
  "id": "d361-100",
  "text": "2\nHISTORY\nEducational broadcasting has played an important role in Federal Communi¬\ncations Commission actions since the beginning of public broadcasting. Educa¬\ntional institutions were among the pioneers in experimental aural broadcast\nwhich led to the establishment of regular AM broadcasting following World War I.\nIn 1941 the Commission allocated five channels for noncommercial FM broad¬\ncasting, increasing the number to twenty in 1945. In May, 1966, 301 educational\nFM stations and 24 educational AM radio stations were licensed by the Commission.\nIn 1949 the FCC invited comments on the advisability of providing channels\nfor noncommercial educational television operation, and on March 22, 1951, as\npart of a general review of television, the Commission proposed such a course.\nOn April 14, 1952, after extensive proceedings, the Commission opened UHF\nchannels for the expanding TV needs and concomitantly reserved 242 channel\nassignments (80 UHF and 162 VHF) for noncommercial educational use. These\nreservations constituted about 127, of the total allocations at that time. The\nCommission stated:\n\"We conclude that the record shows the desire and ability\nof education to make a substantial contribution to the use of\ntelevision. There is much evidence in the record concerning\nthe activities of educational organizations in AM and FM broad¬\ncasting. It is true and was to be expected that education has\nnot utilized these media to the full extent that commercial\nbroadcasters have, in terms of number of stations and number\nof hours of operation. However, it has also been shown that\nmany of the educational institutions which are engaged in aural\nbroadcasting are doing an outstanding job in the presentation\nof high quality programming, and have been getting excellent\npublic response.\n\"And most important in this connection, it is agreed that\nthe potential of television for education is much greater and\nmore readily apparent than that of aural broadcasting, and that\nthe interest of the educational community in the field is much\ngreater than it was in aural broadcasting . . . The public\ninterest will clearly be served if these stations are used to\ncontribute significantly to the educational process of the\nnation. The type of programs which have been broadcast by\neducational organizations, and those which the record indicates\ncan and would be televised by educators, will provide a valuable\ncomplement to commercial programming.\"\nThe first ETV station to go on the air was KUHT, University of Houston,\nTexas, on May 23, 1953.\nB-14"
}