{
  "id": "d361-102",
  "text": "4 -\nhave been in the UHF spectrum. However, in early 1966 almost 60% of the ETV\nstations were still VHF. All-channel receiver legislation passed by Congress\nauthorized the FCC to require that all TV sets sold after April 30, 1964 be\ncapable of receiving UHF as well as VHF signals. With the number of VHF unused\nreservations continually diminishing, the continued growth of UHF ETV stations\nseems likely. Commission engineers have found that differences in UHF channel\nnumbers will not necessarily result in significant differences between the\neffectiveness of the respective signals.\nETV station programming varies considerably, from in-school instructional\nmaterials to performing arts programs for the home viewing audience. Materials\nare obtained from many sources, including individual stations, private pro¬\nducing organizations, National Educational Television, the National Association\nof Educational Broadcasters, and Instructional Television Libraries located in\nBloomington, Indiana, Boston, Massachusetts, and Lincoln, Nebraska. Local in¬\nschool programs, ideally, are locally produced and may be entire series,\nindividual lessons, or part of a lesson such as a demonstration. Reinforcement\nmaterials, such as civic tours, visits to cultural sites, and interviews with\nprominent persons are frequently included. Cultural programming is broad in\nscope, and includes public affairs programs, many of a probing and controversial\nnature, interviews with persons in all areas of life, analysis as well as\npresentations of the performing and plastic arts, and programs for special groups\nsuch as children, or on special subjects. Educational television does not\nusually compete with commercial television insofar as it does not attempt to\nreach a mass audience with materials representing a common denominator, but\ntries to reach a large spectrum of minority viewing groups with special\ninterest programs.\nIn 1965 and 1966 more and more ETV stations began to seriously explore\ncolor capability, and in 1967 National Educational Television expects to begin\nproviding some color programming.\nThe Federal Communications Commission Rules and Regulations has a special\nsection devoted to noncommercial educational stations. Part 73, paragraph 621,\nreads:\n\"In addition to the other provisions of this subpart,\nthe following shall be applicable to noncommercial educa¬\ntional television broadcast stations:\n\"(a) Except as provided in paragraph (b) of this\nsection, noncommercial educational broadcast stations will\nbe licensed only to nonprofit educational organizations\nupon a showing that the proposed stations will be used pri¬\nmarily to serve the educational needs of the community; for\nthe advancement of educational programs; and to furnish a\nnonprofit and noncommercial television broadcast service.\nB-16"
}