{
  "id": "d361-108",
  "text": "- 10 -\nAll broadcast applications must be submitted in triplicate to the Secretary,\nFederal Communications Commission, Washington, D. C. 20554. After they are\ntendered, if complete and in conformity with the rules, they are formally accepted\nfor filing and assigned a file number. An application is not acted upon until\nat least 30 days following acceptance, during which period it is subject to\nobjecting petitions. Processing of applications involve three major areas of\nexamination and review; Engineering, Financial and Legal. The engineering\nexamination verifies calculations to determine if they conform to the technical\nrequirements of the Commission's rules. The Antenna Survey Branch determines\nwhether the proposed antenna structure meets Federal Aviation Agency regulations.\nAn accountant checks the financial qualifications, including adequacy of resources\nand matters such as discrepancies between estimated and potential actual operating\ncosts, and total costs balanced against particular costs. The financial\nexamination is particularly concerned with verification of the source of funds:\nwhether the applicant has available or committed the funds necessary to con¬\nstruct and operate the station for one year, including Educational Television\nFacilities Act grants if applied for, or has been given the authority to use the\nmoney, bonds, securities or other finances described in the application. Attorneys\ndetermine whether the applicant is qualified under the Communications Act to\nbecome a licensee. They review technical and economic findings, check the corporate\nstructure, determine if there are any matters before the Commission which might\naffect the applicant, and analyze the Statement of Program Service.\nWhen an application for a new station or for changes in an existing facility\nis approved, a Construction Permit (CP) is issued. The permittee has 60 days in\nwhich to begin construction, and a period of six months thereafter for completion\nof the project. If the station cannot be constructed in the specified time an\nextension may be applied for. Following issuance of the CP the permittee may\nrequest call letters, with the first available preference assigned. Within 30\ndays from the time the CP is issued the permittee must submit an Ownership\nReport. This report also must be filed with each application for a license\nrenewal, and within 30 days of a change of officer or ownership of the station.\nWhen construction of the facility is complete in accordance with the CP,\nthe permittee may conduct equipment tests, following notification of the\nCommission. Application for the license may be submitted, accompanied by\nmeasurements of equipment performance. At the same time--but at least ten days\nbefore regular programming is scheduled to begin--Program Test Authority (PTA)\nmay be requested. PTA is contingent upon approval by the FCC of performance\ndata as detailed in the license application. In effect, PTA entitles the per¬\nmittee to begin regular station operation and programming, although the license\nitself is not granted until the license application receives final approval.\nRenewal dates vary by geographical region; a new licensee must file his first\nrenewal at the first appropriate date; thereafter licenses are normally valid\nfor three year periods.\nB-22"
}