{
  "id": "d361-125",
  "text": "Kit Number 2\n2 „ Let each viewer list quickly the questions and comments which\ndeveloped during the film. From these the chairman may\nselect samples to present to the group for discussion,\n3. Why are the television teacher and the classroom teacher\nfrequently designated the \"teaching team?\" What do you\nsee as the specialized role of each of the team members? Is\nthis the same in all instances?\n4. Review the major areas of the Responsibility Scale, What\ndoes each of these areas imply as to the role of the classroom\nteacher? The television teacher?\n5. Review the examples of television instruction in each area\nof responsibility as reflected in the film. Can you think of\nother lesson examples for each area?\n6. What area of responsibi lity did the eighth grade social studies\ntelevision lesson represent? Specify the utilization activities\nreflected from the eighth grade social studies classroom in\nthe film. Toward what goals were these directed? Can you\nsuggest other activities which would be appropriate in u-\ntilizing this social studies lesson? (Distinguish between\nactivities which occur to you for general classroom use and\nthose which suggest themselves to you in connection with the\nspecial needs of your particular classroom or the needs and\ninterests of your own individual students.)\n7. Discuss the selection of televised instructional materials as\nan important aspect of utilization. What are the major con¬\nsiderations in selecting television lessons for the classroom?\nWhy is it desirable for the classroom teacher to be aware of\nthese considerations and involved in the selection?\n8. Discuss the classroom as a \"wardrobe of resources.\" How\ndoes the role of the television teacher relate to this \"ward¬\nrobe?\" The role of the classroom teacher?\n9. The more imaginative and resourceful the classroom teacher\nis, the more effective is the utilization of the television\nlessons. Discuss,\n10. Whatdoes each viewer see individual ly as strengths inhisown\nteaching? As weaknesses? (Write these down for personal\nevaluation. Being specific adds clarity.)\nC-8"
}