{
  "id": "d361-170",
  "text": "Kit Number 6\nLesson O'NEILL'S PLAY: THE HAIRY APE.\nThe Resource Guide—American Literature for Senior\nHigh School Students/ prepared by Arthur Eastman and Lorraine\nAlkon, devotes its Chapter XIII to Drama, which includes Session\n49: The Play Seen, and Session 50: The Play Read. Chapter XIV,\nEugene O'Neill and Arthur Miller, has four lesson divisions:\nSession 51: O'NeiH's The Emperor Jones, Session 52: The Hairy\nApe, Session 53: Miller's Death of a Salesman: Parti, and\nSession 54: Death of a Salesman: Part IL Says the Resource\nGuide: \"A Comparison. The Hairy Ape, like The Emperor Jones,\nis written on two levels: it begins on the literal or physical level\nand advances into the symbolic or metaphysical. It also concerns\na magnificent being, the Hairy Ape, who, like the Emperor Jones,\nis doomed from without and from within; and it, too, ends in death.\nLike The Emperor Jones, it is written, not in acts, but in eight\nscenes.\"\n\"The meaning of the play. In The Hairy Ape, as in The Emperor\nJones, the central figure is representative of al I of us, the Everyman.\nThus, his nickname is Yank, and his almost forgotten name is Robert\nSmith, a name that is average, universal. But Yank, like Jones,\nis a kind of heroic everyman. He may be short on brains, but he\nhas vitality, energy, courage, toughness. And he identifies his\nproblem with a kind of superb metaphysical precision—the problem\nof modern man who has lost his old harmony with nature, his old\nreligious security; the problem of alientation, of not belonging.\n\"Like The Emperor Jones, The Hairy Ape seems to suggest that\nman cannot win. So the Hairy Ape'senvironment from first to last\nis like a jail or prison—in the stokehole, which looks like a cage;\nin the jail itself; in the cage, finally, at the zoo.\n\"Mode . The Hairy Ape differs from The Emperor Jones in mode .\nJones is a tragedy. This play is a comedy. Yank may get hit but\nhe never gets hurt. Hence we fee I for him none of the pain we felt\nfor and with Jones. So it is that life does not end for the Hairy\nApe with a bang—as it does for Jones. Nor with a whimper—as\nit might for a lesser being. But with a wry joke at the absurdity\nof man's condition. \"\nLesson Excerpt The excerpt seen in this fi Im covers approximate ly\nfive minutes from the latter part of the play's\nG-14"
}