{
  "id": "d361-173",
  "text": "Kit Number 6\nsince they're overdrawn already. Paul (Archer's brother) asks\nArcher what promises he made to Frazer and Walker in return for\nthese checks. They argue as to whether or not Archer is obligated\nto the two men if he accepts their checks. Fred har^ds Archer a\npen. Archer looks at the checks and the TV application wondering\nwhether or not to sign them.\nProblem: SHOULD ARCHER ACCEPT THE MONEY?\nLesson Excerpt The lesson excerpt seen in this film begins at the\nend of Scene 1, just as Archer receives the money\nfor the TV time. It continues for almost five minutes to the close\nof Scene 2, where Archer is looking at the checks and theTVappli-\ncation, wondering how to resolve the problem of the campaign con¬\ntributions .\nFOURTH EXCERPT\nSeries SCIENCE REPORTER is a continuing television offering,\nproduced by the Massachusetts Institute of Technology in\nassociation with WGBH, Boston. There are thirteen programs to\neach of the SCIENCE REPORTER series, and these programs are\ndistributed by National Educational Television, New York. Each\nof the videotaped programs is one-half hour in length. Host for the\nseries is John Fitch, M.I.T.'s Science Reporter, who travels about\nthe country reporting on progress and problems ofscientific research\nand technology. The range of subjects is wide, and the men to\nwhom Science Reporter Fitch introduces his viewers are national\nand international authorities in their highly-specialized fields.\nLesson COMPUTER SKETCHPAD (Science Reporter Program 42)\nfeatures a highly-sophisticated computer programing\nsystem seen in the Lincoln Laboratory at Massachusetts Institute of\nTechnology. In this program, we are told, a man is talking to a\ncomputer in away that is different from anything that has been done\nbefore. Drawing with a light-pen, the man will be using a graphic\nlanguage which is cal led \"Sketchpad. \" As the M.I.T. representa¬\ntive describes the process: \"You are seeing a designer effectively\nsolving a problem step by step, and he will not, at the outset, know\nwhat his problem is, nor will he know exactly how to solve it. He\nG-17"
}