{
  "id": "d361-39",
  "text": "NOTES\nKit Number 3\nEXCERPTS FROM THE\nTE AC H E R 1 S GUIDE TO ACCOMPANY\nTHE TELEVISION LESSON SN KIT NUMBER 3 *\nPREFACE\nThe Use of Generalizations in the Teaching of\nScience and How the Generalization System\nRelates to Science Programs\nMemorization of subject matter and mastery\nof unrelated facts does not seem to be the\nappropriate way to grasp broad understandings\nofsubjects. This is true in almost all subject\nareas and especially in the sciences. Science\nis constantly changing as new phenomena are\nobserved and discovered, but it is character¬\nized by having a few basic generalizations\nwhich compose the structure of science.\nThese generalizations do not exist as isolated\nvertical threads within a single area of sci¬\nence. They are horizontal generalizations\nwhich extend across all scientific endeavor.\nScience instruction at the elementary school\nlevel needs an economyof ideasaround which\nto design the experiences of children. It\nwouldseem beneficial then, for you and the\ntelevision teacher to \"team up\" to present this\norganized system of gaining scientific know¬\nledge .\nThe system of using generalizations to teach\nbroad concepts has implications for you, for\nthe television teacher, and for yourstudents\nin the following ways:\n1 . It wil I provide the basic approach to¬\nward the understanding of science that the\ntelevision teacher will follow in the presen¬\ntation of the televised lesson.\n2. Itwi 11 provide you with some insight\ninto the basic approach that will be used by\nthe television teacher, and wil I supply a base\nupon which classroom activities can be ar¬\nranged to correlate the telecast with class-\nwork o\n3. It will provide the student with the\nframework into which scientific data may be\nplaced in order to \"organize\" understanding\nof the nature of science.\nA working knowledge of the following seven\ngeneralizations will establish more effective\ncommunications between you and the tele¬\nvision teacher and will provide the vehicle\nby which a more complete understanding of\nthe nature of science is possible. Read them\ncareful ly.\n* Adapted from the K LRN Teacher's Guide.\nD-17"
}