{
  "id": "d361-93",
  "text": "Kit Number 1\n11 . We have seen in the film, examples ofwhat television brings\nto the classroom. Can these contributions alone bring about\nlearning? What else is needed?\n12. \"Television can bring the lesson and the child together. But\nthe classroom teacher must apply the 'glue' to make that\nlesson stick.\" Discuss the implications of this statement.\n13. Is this \"glue\" the same for all teachers? What are its ingre¬\ndients?\n14. Please name (in a general way)some good preparation activ¬\nities for a te levision lesson. (For example: review of pre¬\nceding material; survey of the content outline for the year,\nunit or series; vocabulary work; studying the material in the\ntext; listing questions for which pupils need answers; dis¬\ncussion; library reading; practice in viewing skills; defining\nviewing objectives, etc.)\n15. Please name (in a general way) some good follow-through\nactivities. (For example: answering questions, framing\nthought questions, defining and discussing the main ideas in\nthe lesson, drill, experimentation, problem solving, dis¬\ncussing reactions to the lesson, testing, writing specia I mater¬\nial, preparing related art work, etc.)\n16. Do activities for preparation and activities for fol low-through\ndiffer in KIND? Can the same activities be used for either\npurpose? Where does the basic distinction lie? Can you\nsuggest activities which wou Id be appropriate for one purpose\nbut not for the other? What is the main purpose of a 11 activ¬\nities used in connection with the television lesson?\n17. What do you understand to be involved in utilization of tele¬\nvision lessons in the classroom? Is there more involved than\nsimply enabling the students to see the television lesson?\n18. How does the pupil's experience with television viewing at\nhome affect his experience with formal instruction by tele¬\nvision ?\n19. What factors doyou see as influencing the impact and accept¬\nance of instructional television in the elementary classroom?\nIn the secondary classroom?\nB-7"
}