{
  "id": "d357-136",
  "text": "dans laquelle les materiaux sonores (verbe et musique), unis, opposes, superposes,\nsont traites de maniere a creer une atmosphere poetique (celle de l’univers onirique)\na l’interieur de laquelle Faction (si on peut parler d’une «action a propos de\nRuisselle ») se developpe sans encombre.\nRuisselle est essentiellement une oeuvre lyrique. CEuvre lyrique et non Opera.\nCe qui la distingue de l’opera, c’est d’abord que le chant (au sens traditionnel du\nterme) n’y a pas la premiere place, c’est ensuite que l’element verbal y a la meme\nimportance que le musical, les deux intimement lies, la musique ayant ete ecrite\nen fonction du texte et dans le meme esprit de creation radiophonique.\nCEuvre lyrique aussi par le fait que chaque personnage est defini par l’ecriture\nmeme. Ici le musicien rythme les phrases du poete. A chaque personnage correspond\nune maniere d’expression verbale, mecanique pour Univox, molle pour Gelseneur,\nmonotone comme coule une eau et dont les seules intonations sont comme le bruit\nd’une eau butant sur les cailloux, pour Ruisselle, syncopee, deformee pour Cacta, etc.\nA ces modes d’ecritures correspondent trois modes principaux dans l’expres-\nsion musicale.\nLe parler-chante ou parler-rythme. Le «Monsieur» illustre cette maniere. II\n« parle-chante ». C’est-a-dire qu’il parle, puis qu’il recite (qu’il semble reciter, car\ndeja le musicien a note sa recitation), puis qu’il module insensiblement de plus\nen plus, et qu’enfin, il chante. Pas d’accord qui donne le «la», le passage du\nparler au chant se fait sans transition, naturellement.\nCacta illustre egalement cette maniere d’une maniere encore plus particuliere,\nparce que peut-etre moins sensible. Au cours de son monologue-delire exprimant\nla transformation de la Plante-Reine en Reine des reves, elle ne declame pas\nseulement. L’idee ici est cede de dechirement, d’ecartellement d’un personnage qui\npasse d’un regne en un autre. Chaque mot est une arme tranchante (doublement\ntranchante, puisque Cacta en souffre et veut que Kis en souffre). Le musicien note\nici une declamation imitative qu’il exagere encore grace au metteur en onde. Les\nphrases sont brisees, cassees brutalement, les mots sont traites charnellement comme\nune viande qu’on decoupe, etires, amincis, gonfles, lamines. Pour mieux exprimer\nce delire, le musicien impose ici des rythmes hoquetants, dur travail pour l’actrice\nqu’y doit s’y plier. Inutde de dire qu’il s’agit la d’une sorte d’exploit, pour lequel"
}