{
  "id": "d357-137",
  "text": "il est necessaire d’avoir une actrice exceptionnelle. L’extraordinaire Casares en est\nune sans laquelle nous n’eumes pu realiser ce que nous voulions.\nLe second mode d’expression musical est le chant (au sens traditionnel), uni-\nquement reserve dans Ruisselle a un chceur d’enfants (role remarquablement tenu\npar la Maitrise de la R.T.F.). Leurs chansons, simples, repos melodieux a l’interieur\nd’un reve cahotique, constituent une transposition enfantine du theme de Ruisselle.\nElies apportent un rayon de clarte, un coin de fraicheur dans un univers de feu\net de glace.\nEnfin, la musique. II faut distinguer la encore, la musique qui sert d’indicatif\naux personnages, dont les apparitions et disparitions ne sont annoncees que musi-\ncalement, phrases musicales qui les propulsent et la musique qui chante sous la\nparole. Dans ce deuxieme cas, on pourrait presque dire que le poete a donne les\nnotes au musicien. Ainsi chante Ruisselle, sans chanter, et de meme Kis.\nContrairement a ce qui peut paraitre, les procedes techniques sont assez restreints.\nC'est volontairement que les lieux de Faction n'ont pas ete definis plus precisement\n— le realisateur ayant voulu, avant tout, mettre Vaccent sur Finterpretation et sur les\npossibilities pour chacun des comediens et des comediennes d’exprimer Fimage de leur\npersonnage tout au long de remission, mais aussi dans Finstant meme oil il entre dans\nFaction; d'oii parfois ces changements dans le debit de la parole, ces fluctuations dans\nles timbres de la voix oil dans Vintensite d’expression:\n— passage du parler au chanter pour le Monsieur et son phraser un peu faux,\n— debit mecanique precipite et inintelligent de Univox,\n— delire verbal de Carta la Verte avec des chutes brusques devant creer comme des\nzones d’assechemen?,\n— ou encore le parler mou, larvaire de Gelseneur lorsqu’il est aux prises avec son\npropre fantome, parler parfois presque chante.\nTechniquement, toutefois. il a ete fait usage:\n— de la chambre d^echo pour obtenir certains effets de reverberation de « spatia-\nlisation »,"
}