{
  "id": "d357-140",
  "text": "MAURICE JARRE (Savoyard, ne en 1924) Etudes au Conservatoire de Paris avec Jacques\nde la Presle (harmonie), Louis Aubert (orchestration et composition) et Felix Passeronne (percussion).\nDirige la musique de scene pendant cinq ans de la Compagnie Madeleine Renaud-Jean-Louis\nBarrault.\nDepuis 1950 ecrit toutes les musiques de scene du Theatre National Populaire (directeur Jean\nYilar) ou il est egalement Directeur de la Musique (Le Prince de Hombourg, Lorenzaccio, Don Juan,\nMacbeth, La Ville, etc.).\nEn 1951, creation a Darmstadt d’un ballet pour Ondes Martenot et instruments a percussion\nMasques de Femmes.\nEcrit la musique du premier spectacle en France Son et Lumiere pour le chateau de Chambord,\npuis pour celui du Palais des Papes en Avignon.\nEn 1953, creation au Festival International de Musique d’Aix-en-Provence, de Mouvements\nen Relief.\nEn 1954, creation au Theatre de l’Empire, a Paris, de TOpera-Ballet Armida avec Maria Feres,\ndemande par la Biennale de Yenise pour le Festival 1955.\nMusique de Films: Hotel des Invalides, mis en scene par Franjus;\nWaivers d’Utrillo, mis en scene par Georges Regnier.\nMusique de Radio: Cain, de Michel Arnaud, mise en ondes par Jean-Jacques Yierne;\nResurrection, de Stephane Frontes, mise en ondes par Alain Trutat;\nLe Songe de la Mort, d’apres le Cardinal Newman, mise en ondes par Claude\nRoland Manuel;\nNoel du Diable, de Jean Grimod, mise en ondes par Georges Godebert.\nROGER PILLAUDIN — Ne a Moulins (Allier) le 28 decembre 1927, a fait ses etudes secon-\ndaires au Lycee de Moulins, puis au Lycee Blaise Pascal a Clermont-Ferrand.\nEtudes de lettres et d’anglais a la Faculte de Clermont-Ferrand.\nEtudes d’Art dramatique au Conservatoire de Clermont-Ferrand - Animateur d’une jeune\ncompagnie (1950-1953).\nDepuis 1952 (decembre) assistant de production R.T.F.\n1954-1955 — producteur de remission « Lettres Choisies » chaine Paris-Inter.\nA publie un recueil de poemes: Poemes de la main gauche (Seghers editeur)."
}