{
  "id": "d357-143",
  "text": "Le protagoniste d’une aventure hallucinante entreprend de faire le recit de ce\nqui lui est arrive certaine nuit ou, rentrant d’une agreable soiree, il se decida\nsoudain, pousse par une inexplicable curiosite, a entrer dans une boutique d’an-\ntiquaire encore ouverte malgre l’heure tardive. Le proprietaire, un petit homme\nau crane chauve, qu’il apercevait, dans la journee, toujours a la meme place,\nimmobile et le regard fixe comme en attente, s’avance a sa rencontre et lui demande\nson aide pour le pieux devoir qu’il est tenu d’accomplir. II doit — dit-il — proceder a\nla sepulture d’une femme tendrement aimee et qu’il considere, dans sa douce folie,\na la fois morte et vivante. Notre homme, trouble et pris de curiosite, consent.\nMais une autre surprise l’attend: il n’y a point de cadavre dans la caisse d’hor-\nloge ou l’antiquaire dit avoir depose sa chere morte. Neanmoins, de plus en plus\nsaisi par l’atmosphere qui s’est creee, le visiteur aide le pauvre fou a transporter\nle cadavre imaginaire dans le reduit qui lui est destine. Cependant la fiction a peu\na peu acquis une etrange realite, l’obsession finit par prendre corps chez lui aussi,\net c’est avec une stupefaction melee d’horreur qu’il pergoit a son tour la « presence »\nde la morte, dont le poids se fait sentir a la fatigue de ses bras et de ses jambes,\net dont il finit par entendre la voix...\nL'art radiophonique est parvenu a Vage adulte. Toutes les recherches techniques\n— depuis le simple bruitage des origines jusqu’a la stereophonie — ont ete maintenant\nmises en oeuvre.\nSans songer un instant a pretendre qu’il nous faut les tenir dorenavant pour revo-\nlues, ce qui serait une grande sottise, il m’a paru necessaire de tenter un essai dans le\ndomaine oppose et de rechercher si, par un depouillement total autour d'un texte, pou-\nvait s'obtenir a Vecoute un effet aussi puissant, peut-etre plus puissant encore.\nJe suis parti de la constatation suivante. Lorsque nous racontons une aventure\ntragique dont nous avons ete Vacteur ou le temoin, nous reproduisons sans peine les\nemotions que nous avons ressenties a la vivre: il sujfit de trouver le ton. En revanche,\nles faits qui les ont provoquees, tout ce qui est venu de l’exterieur pour frapper Vun\nquelconque de nos sens, nous sommes contraints de le reduire a une description (et\ncombien de fois la chose apparait-elle indescriptible), alors que c'est cela qui demeure\nen nous Vessentiel."
}