{
  "id": "d357-144",
  "text": "Quand le sens le plus touche a ete Vouie, la radio seule pouvait done reproduire ce\nrapport, ce « dialogue » entre le passe — Vexpression du souvenir — et le present,\npermanent pour le narrateur, du souvenir lui-meme.\nA ce probleme de deux temps juxtaposes s’ajoutait celui des temps comme rythme,\nde la relation entre les voix (ou les bruits essentiels, deux seulement pendant quarante\nminutes) et les silences.\nEn somme, puisque ce recit etait fait pour Voreille, il devait etre considere et traite\ncomme une partition.\nCLAUDE AVELINE\nEmission presentee avec la distribution suivante:\nMoi Charles Yanel\nUAntiquaire Frederic O’Brady\nRealisateur: Albert Riera\nCLAUDE AVELINE — Ne a Paris en 1901, Claude Aveline comment par etre editeur d’art.\nDe vingt a trente ans, il publia une cinquantaine de volumes. Cependant, il ecrivait lui-meme des\ncontes (UHomme de Phalere), des essais (La Merveilleuse Legende de Bouddha), des nouvelles (Le\nPoint du Jour), qu’il devait ensuite appeler ses « gammes ».\nC’est en 1930, avec les deux tomes de Madame Maillart (depuis reunis en un seul), qu’il entre-\nprit son grand roman d’une adolescence: La Vie de Philippe Denis. Il attendit neanmoins vingt-deux\nans avant d’en donner la seconde partie: Les Amours et les Haines. En 1955, a paru le troisieme et\ndernier volume, sous le titre de Philippe. Il avait publie entre temps d’autres romans, Le Prisonnier,\nLe Jet d’eau, la « Suite policiere » (La Double Mort de Frederic Belot, Voiture 7 place 15, L'Abonne\nde la ligne U), sans oublier Le Temps mort, recit paru clandestinement sous l’occupation allemande.\nVoyageur, on lui doit en 1934 La Promenade egyptienne et en 1951 Et tout le reste nest rien,\ninspire par les fameuses lettres de la Religieuse portugaise. Cet ouvrage est d’ailleurs avant tout un\nessai sur l’amour, comme les deux plaquettes jumelles de Pegomancie et d'Avec toi-meme avaient\nreuni auparavant des reflexions sur l’homme et le souvenir.\nClaude Aveline n’a jamais cesse. de se passionner pour les grands problemes de notre epoque.\nLes textes reunis sous le titre caracteristique de Les Devoirs de VEsprit en temoignent. Engage volon-\ntaire en 1939, il a contribue des juillet ’40 a la naissance de la Resistance interieure, et appartint\nau fameux reseau du Musee de l’Homme.\nIl a ecrit specialement pour la radio des oeuvres ou il a cherche a en utiliser toutes les ressources\n(L'CEil-de-chat, Le Bestiaire inattendu) et il a toujours collabore aux adaptations de ses romans\npour la radio et la television.\nIl est president d’honneur de la Societe Anatole France, president du jury du Prix Jean-Vigo,\nmembre du conseil d’administration de 1’Alliance Franchise et du conseil executif de la Societe\nEuropeenne de Culture.\nEn 1952, le Grand Prix de la Societe des Gens de Lettres a couronne l’ensemble de son oeuvre."
}