{
  "id": "d357-152",
  "text": "Le sujet: Ruth est gisante sur sa couche de malade; le temps qui se deroule est\nl’heure qui precede sa mort. Elle emploie cette heure a faire la lumiere sur ce qui\nfut sa vie. Elle met a profit ce temps: sa volonte guide et corrige la suite des sou¬\nvenirs et des visions, elle veut penetrer jusqu’au noyau de son inquietude. Elle\ncraint en effet d’avoir perdu la Grace; de cela elle voit un signe dans la perte de sa\npatrie, elle accepte 1’echec et toutes les souffrances en punition de ses fautes, et a\nla demande: « quelles fautes? » elle repond de la maniere la plus comprehensive:\n« Parce que j ai trop peu aime ». A la fin cependant, il ressort que la crainte d’avoir\ntrop peu aime n’est qu’un leurre, autant que la crainte d’avoir perdu la Grace.\nUn mouvement circulaire s’est opere: dans la patrie Ruth voit le symbole de\ntoute harmonie; etant donne qu’elle a du quitter son pays, elle craint de ne pas\netre digne de l’harmonie, de ne pas faire partie de l’amour de Dieu; et ceci parce\nqu’elle n’a pas aime suffisamment.\nA ce point de ses reeherches, elle constate, pour son excuse, qu’il n’est personne\nqui aurait merite son affection (d’ou il semble resulter, naturellement, que la patrie\nperdue n etait pas du tout un paradis) mais Ruth est assez courageuse pour faire\nun pas de plus et pour reconnaitre que sa crainte de ne pas avoir assez aime regarde\nau fond une seule personne: un scelerat qu’elle aurait peut-etre pu sauver par l’amour.\nLa decision d’arriver jusqu’au noyau de son inquietude et de ne pas fuir les\nimages du passe, est recompensee. Dans une conversation imaginaire elle force\nl’homme a confesser que l’amour n’a pas besoin de dignite et de justice: et c’est\nle debut d’un revirement.\nPour la Grace non plus il n’est pas question de conditions de dignite et de\njustice. L heroine se sent a nouveau en possession de la Grace et puisqu’elle se sait\naimee de Dieu, elle comprend aussi qu’elle a elle-meme toujours aime. Sa vie n’etait\ndone pas sans signification. Elle meurt consolee.\nPETER HIRCHE"
}