{
  "id": "d357-154",
  "text": "Je confectionnai ma deuxieme piece a 16 ans. Sans avoir jamais entendu parler d’Anouilh ou\nde Sartre, je n’y presentais que des trepasses et, tout bien considere, j’en suis fier encore aujourd’hui.\nPour le restant, cette piece etait un dialogue routinier, rempli d’un lyrisme de pacotille, ce qui\nm’empeche d’y songer autrement qu’en rougissant. Par bonheur, rien de mes oeuvres de jeunesse\nn’a ete conserve.\nApres mon baccalaureat, en 1941, j’ai ete militaire. J’ai pu echapper a une cretinisation com¬\nplete au cours de ma premiere annee passee en Russie, en composant des poesies. J’espere que celles-ci\nde meme ont disparu pour toujours. En Russie je m’essayais aussi au drame, quand il m’arrivait\nd’avoir un peu de temps: par surcroit, je me trouvais alors sous mandat d’instruction et devais me\npreparer a passer en conseil de guerre. J’avais done une occasion magnifique d’experimenter sur moi-\nmeme comment le mecanisme de la justice produit, avec le temps, sur un homme objectivement\ninnocent, la conviction d’etre un reprouve.\nEn meme temps j’avais atteint mes vingt ans et avec eux commencjait un decennaire critique.\nOn dit que les annees de guerre comptent double... Peut-etre est-ce vrai en ce qui concerne la deca¬\ndence physique, mais certainement pas touchant le developpement de l’homme.\nLa guerre finie, en quatre annees je n’avais rien gagne d’autre que la desagreablc impression\nde devoir partager le monde avec des cretins.\nJe n’avais rien appris qui put me permettre de regler ma vie au sortir de la captivite, et j’etait\naussi trop paresseux pour rattraper en quelque fagon ce que je n’avais pas appris. Ma vocation\nd’autre part, qui m’avait aide a supporter les annees de guerre, etait selon toute evidence a peine\nsuffisante pour ecrire des textes de cabarets et de chansons en vogue qui, tous comptes faits, ne\nconnurent jamais la vogue. A Francfort-sur-le-Main, j’etais entre temps devenu aide-maqon et plus\na Berlin je deambulais par les rues en qualite de veilleur de nuit.\nMon premier travail serieux pour la radio (un «feature »: Je ne veux pas etre le prochain,\nen 1949 obtint d’abord un certain succes, mais ensuite il ne fut plus transmis pour des raisons poli-\ntiques. C’est seulement en 1953, quand j’atteignais deja 30 ans, que se produisit un changement en mieux.\nJ’ecrivis mon premier jeu radiophonique: Uhistoire d'amour la plus Ctrange du monde et a\nmon grand etonnement, la NWDR de Hambourg declara qu’elle voulait bien l’accepter et qu’elle\ns’occuperait de moi. En recevant cette nouvelle, je la pris pour une mauvaise plaisanterie de la\npart des amis; et quand je fus bien force d’y croire, j’avais la meme impression que le chevalier\ndu lac de Constance, auquel on dit qu’il est desormais sauf: je sentis un frisson apres coup.\nApres l’emission de Uhistoire d'amour la plus etrange je requs plusieurs lettres de jeunes\nauditrices. Il me semblait que ces lettres etaient semees de traguenards et de pieges, et pour fuir\ntous les dangers je me mariai. Toujours en 1953, j’ecrivis mon deuxieme jeu radiophonique Le sourire\nde Veternite; il fut transmis par la RIAS de Berlin et a ete mis en onde cet ete par la NWDR\nde Cologne. Suivirent en 1954 La louange de la dissipation et Le retour, transmis l’un et l’autre\npar la NWDR de Hambourg. Malheureusement il est a croire que je suis a peu pres l’incarnation\ndu plus paresseux des loirs. Mais, plaisanterie a part: les symptomes abondent en ce sens. Si par\nexemple quelqu’un me demandait: « Que pensez-vous quand vous ne pensez a rien? » je devrais\nrepondre pour etre conforme a la verite: « Je pense que je suis accroche des bras et des jambes a\nune grosse branche et reste ainsi suspendu en Fair ». Mais il s’agit d’une position tout a fait incommode.\nPETER HIRCHE"
}