{
  "id": "d357-21",
  "text": "a) with the necessary translations and with the indispensable\nadaptations of the work;\nb) with the recording of the work by means of instruments suitable\nfor the mechanical reproduction of sound with a view to the broadcasts\nprovided for under c) hereunder;\nc) with two broadcasts of the work either by direct broadcast or in\nrelay or by means of instruments suitable for mechanical reproduction. For\neach of these broadcasts the Author shall be credited with the usual amounts\npaid by the Broadcasting Organization for works of the same nature. No\nadditional amounts of any kind shall be claimable by the Author on account\nof the fact that the work has been awarded a prize.\nIn the above mentioned statement, the Author must also declare that,\ninsofar as the entry is concerned, he is the sole owner of the rights of\ntranslation, adaptation, reproduction and broadcasting, otherwise he must\nindicate the owner or owners of either one or of all of these rights. In the\nlatter case, the Organization submitting the entry may reguest from the\nAuthor, making it a condition to be fulfilled before submitting the entry to the\nJuries, written authority from the said owners covering the points in a),\nb) and c) above.\n8\nThe Juries, in the case of works with music, shall only examine entries\naccompanied by one of the four statements listed hereunder:\na) if the work has not yet been published or been the object of a\ncontract for publication, the Author must make a written statement authorizing\n—in the event of the work being awarded a prize—all the Organizations\nparticipating in the Italia Prize to make the necessary copies, reserved to\ntheir own exclusive use, agreements to the contrary excepted, for the two\nbroadcasts mentioned in Art. 7 above;\nb) if the work, though not yet published, has already been the subject\nof a contract for publication, the Author must accompany it by the statement\nmentioned under paragraph a) above signed, however, by the lawful owner\nof the copyright;\nc) if the work has already been published by a third party and no\n23"
}