{
  "id": "d357-212",
  "text": "Reflexions de Ton de Leeuw sur l’art musical\nLa musique d'aujourd'hui semble avoir perdu Velan vital et le caractere eruptif qui\nout provoque — il y a un demi-siecle — un developpement extraordinaire.\nSans vouloir nier le role de la conscience chez les grands compositeurs de cette\nepoque, je voudrais insister sur la spontaneity et I'intuition, elements essentiels des\ngrandes decouvertes de Strawinski, Schonberg, Bdrtok et d'autres.\nDe nos jours, on stabilise, on recherche I'equilibre. Travail bien necessaire apres\nI’eruption volcanique, mais infiniment dangereux.\nUn heritage immense est entre nos mains; heritage qui s'etend d'ailleurs bien au-\ndeld de cinquante ans, et qui depasse desormais les frontieres de la vieille Europe.\nLes limites creees par le style et la tradition s' elargissant de plus en plus, I'artiste doit\nfaire face a un nouveau probleme. Car I'heritage nest pas toujours un appui, mais peut-\netre une menace pour sa personnalite.\nLa production musicale des dernieres decennies nous montre clairement qu'il est\ninfiniment plus facile d'employer n'importe quel moyen d'expression que d'aller a la\nrecherche d'un langage propre.\nHeureusement de vives reactions s'elevent contre cette facilite. Mais ici encore, il\ny a un autre danger qui me parait plus grave, parce que plus difficile a discerner.\nIl est evident qu'on peut se defendre contre un abus de liberte en limitant consciem-\nment les possibilites et en creant une langue qui soit aussi pure et ordonnee que possible.\nEn se basant sur une theorie evolutionniste — ce qui explique, mais ne prouve point\nle droit d'existence — on en est venu — sur la voie du dodecaphonisme — a la\ncomposition dite « totale ».\nIl est pourtant a craindre que Veffort de soumettre tous les elements sonores a\nI'emprise de la conscience revele moins la superiority de Vesprit sur la matiere qu'une\nangoisse profonde de Vinconnu, I'incontrolable. Mais en fuyant Vinconnu, on risque\nde rendre sterile le plus profond de soi-meme...\nEn somme, il s'agit, dans les deux cas, du probleme de la liberte. L'artiste createur\ntrouve ici une preoccupation qui depasse en importance la division habituelle du monde\nmusical en « dodecaphonistes et les autres ».\nC'est par la qu'il faudrait commencer; tout le reste nest que relatif dans une epoque\nsans style au sens propre du mot. Les tres grands de notre siecle ont toujours compris cela.\nLa decouverte des moyens electro-acoustiques a elargi considerablement nos possibi¬\nlites d'expression. Ici encore plus que jamais, le compositeur devra prendre position\navant de se lancer dans le vide."
}