{
  "id": "d357-217",
  "text": "En classe, le maitre dicte un probleme de composition. II s’agit d’un de ces\nproblemes comme nous avons tous eu a en resoudre au cours de notre carriere\nscolaire: un train, un cavalier, un cycliste partent respectivement de trois endroits\ndifferents. Connaissant leur allure respective, calculer a quelle distance, a quelle\nheure, en quel lieu se produira leur rencontre.\nProbleme d’une portee pratique considerable, comme on peut le voir.\nLe petit Fernand Bellavoine, le rouquin du 6®me banc, suce son porte-plume et\nreve. Et voici que soudain, pour lui, les personnages du probleme prennent corps\net s’animent. Le cavalier, c’est naturellement Foncle Henri qui porte une epingle\nde cravate en fer a cheval et est, notoirement, un turfiste fervent. Le cheval s’appelle\nPyrrhus et a mauvais caractere. Pourtant Fernand n’hesite pas a sauter en croupe\nderriere Foncle Henri et c’est en cet equipage que Foncle et le neveu quittent Paris\ndans la brume matinale.\nLa randonnee la plus extraordinaire qui soit va commencer car, si le Pere Theo,\nle vieux mecanicien de la locomotive, et son chauffeur Mimile sont pleins d’indulgence\npour les cancres, il n’en va pas de meme pour le cycliste. C’est lui l’ennemi, l’affreux\ntraitre aux moustaches en forme de guidon, l’homme a abattre.\nUne lutte serree s’engage tandis que la route s’allonge. Tout s’anime, tout parti-\ncipe a la folle randonnee depuis les petites minutes qui, tout au long du chemin, se\ncachent dans l’herbe et font la ronde dans la clairiere, jusqu’a l’armee des grands\nkilometres imbus de leur personne.\nRouge, decoiffe, la bouche entr’ouverte, le petit Fernand termine dans la preci¬\npitation la quatrieme page d’operations aberrantes et de ratures ornementales quand\nla voix du maitre retentit:\n— Je ramasse les copies!\nAffole Fernand rassemble les elements du probleme et livre une derniere bataille\ntandis que la voix du maitre se fait plus pressante:\n— Fini ou pas fini, je ramasse les copies. Comme toujours Mr. Bellavoine se\nfait attendre!\nDeux longs doigts crayeux s’allongent vers la copie de Fernand et s’en saisissent.\nLa feerie s’acheve..."
}