{
  "id": "d357-229",
  "text": "Tim est le pecheur de truites le plus fameux de la contree. II connait en. detail\nles moindres recoins de chaque lac et de chaque torrent. Les habitudes des truites,\nleurs preferences et leurs humeurs n’ont pas de secrets pour lui. Ses retours de\npeche sont tous caracterises par un fait memorable.\nII a remonte le torrent pour capturer la plus grosse truite qui ait jamais hante\nun cours d’eau, mais aussitot la lutte qu’il engage avec elle s’avere des plus extenuan-\ntes et d’un succes douteux: la Bete est la certainement dans son refuge, mais rivalise\navec lui de ruse et d’agilite. Les heures passent, et c’est la premiere nuit,- passent\nun autre jour et une autre nuit encore. Le pays est dans 1 anxiete pour Tim qui\nn’est pas revenu: on discute les motifs probables de son absence, on se perd en\nconjectures, on organise des expeditions de secours. A la fin les journaux eux-memes\ns’interessent a l’affaire et annoncent la disparition de Tim, le pecheur de truites.\nOr il est toujours la-haut, acharne dans son effort, seul avec lui-meme, le torrent\net la truite insaisissable. Dans un moment de faiblesse il en est venu lui, Tim!\na acheter quelque truites a un maraudeur de peche a temps perdu: ainsi, outre le\ndoute, s’est desormais insinuee dans son esprit rhumiliation.\nQuelque temps se passe encore et Tim ne revient pas: le voici a bout de forces\net blesse, mais ce qui le retient c’est le fol espoir de triompher et le sentiment de sa\nhonte. Au village on s’habitue peu a peu a l’idee de sa mort parmi les montagnes\net la curiosite d’un chacun cesse d’etre en eveil: sa mere seule continuera a attendre Tim.\nL’histoire de Tim et des journees decisives passees la-haut parmi les vallees\nimpraticables de son pays est dans un certain sens l’histoire de l’homme a la\nrecherche d’un ideal, du bonheur qui n’est qu’un mythe.\nL’action s’ordonne sur trois « plans » differents et l’aventure est vue et inter-\npretee en autant de situations. Celle des «Chamois » et des «Ecureuils », qui\nrepresentent les guides partis de deux points differents a la recherche du pecheur\ndisparu. Celle des habitants de l’endroit qui suivent de chez eux l’evenement selon\nune perspective personnelle, qui ont leur mot a dire sur le compte de Tim et sur sa\ndisparition: le maitre de musique, le chef de la police, le contrebandier retraite, le\ncure, le journaliste a la chasse de nouvelles, la mere, chacun reagit en effet\nd’apres ses sentiments, son caractere. La troisieme situation enfin est celle\ndu protagoniste qui peu a peu monte a la poursuite de la grosse truite et commente\nen monologues interieurs ses demarches et ses pensees, evoque ses aventures passees\nau bord de la riviere et exprime sa « verite » sur lui-meme."
}