{
  "id": "d357-230",
  "text": "Ecrire pour la radio\nHelas, ecrire est en soi deja terriblement difficile. Pour la radio, ensuite, pour ce\nmiroir vocal sans merci et d'humeur on ne peut plus mysterieuse, rien ne servirait de\nfaire Ventendu ou de s'armer de toupet, seule une large experience, et tout juste,\npourra vous sauver.\nEn ajoutant a cette condition « sine qua non » une multitude de dons incertains ou\noccasionnels, que le hasard et les circonstances mettent plus ou moins en relief et qui\npourront se transformer de ce chef en chose artistique et poetique, laquelle devra se frayer\nla voie a tracers les caprices d'un haut parleur « de famille », entrer sans crier gare,\net la, faire taire ou oublier un gosse qui piaille, une porte qui claque, une maladie qu'on\nsoigne, Vindijference ou Vennui stagnant, etre capable de rendre attentifs des oreilles\ndistraites et des gens habitues a ne voir que par leurs yeux.\nNon la chose ecrite par consequent, le mot lu ou a relire dans Vintensite d^eux-memes,\na present ou plus tard, quand Vheure et la lumiere seront favorables, mais le mot devenu\nparole, voix et son, ecoute ou et non, perdu, echappe dans son sens le plus vrai, se\npretant aux equivoques et aux humeurs de Vinterprete, qu’on ne repeche plus, qu’un\nrien suffit d changer et a laisser definitivement pris pour une autre dans le souvenir.\nAujourd’hui encore, apres une trentaine d'annees d*experience, je pretends qu’il\nest toujours tres difficile, meme aux praticiens de la Radio, de pouvoir dechijfrer a\ncoups de regies ou d'exemples ou d’essais Vobscur mecanisme qui explique le succes\nd’une oeuvre radiophonique. Non plus que ne peuvent Vexpliquer les poetes et les\necrivains pour leurs ouvrages ecrits et imprimes.\nNaturellement, ce qui importe c'est de «faire», et personne ne demande une\nassurance preventive contre Vinsucces ou une garantie anticipee de reussite. Le fait,\nd^ailleurs, que beaucoup d'ecrivains et de poetes dedaignent d'ecrire pour la radio ou ne\nse soucient pas de composer sous forme radiophonique, ne signifie nullement que ce\ngenre de « braille » universel soit repudie par eux comme etant sans valeur artistique\nou sans necessite aucune: ils dignorent pas que souvent ce sont precisement des poetes\net des ecrivains qui ont «forge » (comme disait Shaw) la preuve du contraire. Et il ne\nserait pas difficile d’exhiber plus d’un nom retentissant lorsqu’on feuillette le repertoire\nradiophonique ou quon se rappelle certains laureats du Prix Italia.\nD’autres causes leur interdisent de s’engager d'une maniere constante ou definitive.\nEntre autres, le caractere meme de la radio, qui est dynamique. Puis leur fidelite, par\nprofession et par passion, au texte, au livre, a la presse, qui en somme, tant bien que\nmal, restent et sont la, il faut bien le dire, statiques: nous pouvons les compter, les palper\navec tendresse, minces ou epais, de couleurs vives, temoignages d'une activite, d'un interet."
}