{
  "id": "d357-231",
  "text": "d’un metier, tandis que la radio devore et detruit toute creation dans Vinstant meme\nou elle la met au monde, et que de toute Vactivite deployee par un ecrivain radiophonique,\nmeme au cours d’une tres longue carriere, il ne reste plus d la fin qu’un monceau de\nmanuscrits. Et comme on le suppose bien, sans vie.\nMais sur ce point il y aurait beaucoup a dire. En certains pays les ouvrages ecrits\npour la radio sont imprimes. Il s’agit la d’une intelligente initiative.\nC'est pour cette raison aussi que la parole radiophonique, lorsqu’elle a reellement\natteint son but, de poesie, de narration ou de culture, devrait pouvoir interesser la presse,\nfut-ce en cette forme particuliere, comme digne de faire partie du tresor des humanites\nd'une epoque et d’une civilisation.\nJ’entends par la que la « destinee » du radiodrame, de la composition radiophonique\nest la transmission, comme Vest pour la musique Vexecution et pour les arts figuratifs le\ntableau ou la muraille, etc... Toutefois on imprime les compositions musicales, et aussi\nles tableaux et les fresques et les sculptures. Et Vavantage qu’en retire la culture\nest enorme.\nMais void une autre raison, non secondaire, qui s’ajoute a ce que je viens d’exposer.\nL’ouvrage radiophonique dans la plupart des cas n’assure pas le pain de Vartiste et\nmoins encore son beurre, puisque loin d’etre comme le livre ou la comedie d succes, il\nn’a qu’une vie ephemere, et ne peut compter sur les traductions. Une transmission, deux,\ntrois, et le voila mort, il s’evanouit.\nLa television qui, grace a Vimage, fatalement suscite Vengouement du public, est\nune sirene riche de grandes possibilites a venir: un jour ou Vautre elle obligera la radio\na se mettre sur d’autres voies particulieres, a se vouer a des taches speciales. Je ne vois\npas pourquoi Voeuvre radiophonique, avec son vaste et imporant repertoire, ne pourrait\netre immediatement convertie en television. Il existe de nombreux manuscrits qui\npourraient devenir d’excellents scenarios de television et remplacer les comedies du\nrepertoire de theatre que la television diffuse aujourd’hui mais qui s’averent, de par\nleur nature meme et leur naissance, peu faits pour la projection a Vecran. Ceux-ci\nne constituent rien d’autre qu’une position de repli, exactement ce qu’est le theatre\npour la radio, capable d’amuser ou d’instruire, independamment de Vavantage qu’on\nen retire pour la connaissance generate du theatre a tracers le texte et les figures qui\nVaniment.\nIl est d’autres causes qui empechent les poetes et les ecrivains d’apporter une\ncontribution plus etendue a la composition radiophonique dans ses nombreuses expres¬\nsions et ce pourraient etre celles qui interdisent, a quiconque est etranger aux studios de\nproduction, d'aborder de plain pied le monde radiophonique (ainsi qu’on penetre dans\nun cercle litteraire ou dans une librairie) pour connaitre les possibilites, les moyens,\nles ressources techniques, les « trouvailles » de chaque jour qui sont le fait des praticiens."
}