{
  "id": "d357-62",
  "text": "U Union Neerlandaise de la Radio m'a demande d'ecrire une oeuvre dramatique,\nqui ne fut pas congue seulement a priori en vue d'une execution radiophonique, mais\ndans laquelle fussent utilisees les possibility de la technique radiophonique.\nTai tente dans toute la mesure du possible dHntegrer organiquement dans Voeuvre\nces ejfets et possibility techniques. Vejfet n'a pas ete recherche pour lui-meme, mais\npour Vexpression qu’il permet d’obtenir.\nAinsi — pour citer Vejfet le plus frappant — pour le chceur des Erinnyes, oil nous\navons double la vitesse de tours de Venregistrement d'un chceur d'hommes, notre but\nfondamental a ete de « deshumaniser» les voix des Erinnyes. Nous donnons ci-dessous\nun aperqu des ejfets radiophoniques auxquels nous avons eu recours.\n1. Combinaison <Telements sonores a Vaide de microphones dont les relations dyna-\nmiques different de celles que permet Vexecution en salle, ainsi « solo contro tutti ». A\nce genre de combinaison se rattache V utilisation de bruits captes et renforces grace a un\nmicrophone special, comme la resonnance ordinairement inaudible de quelques instru¬\nments (cymbales, cloches).\n2. Le changement du ton obtenu par acceleration ou ralentissement de la bande\nsonore. On peut ainsi utiliser hors de leur etendue normale voix et instruments. Cet\neffet est le plus frappant dans le chceur des Erinnyes. Pour differencier leurs voix des\nvoix humaines, on a hausse d'une octave Venregistrement d'un chceur d'hommes «a\ncappella». Le ton devient celui d’un chceur de femmes, mais le timbre en differe com¬\nplement. Les formants des voyelles sont encore dans le ton des voix des Erinnyes ainsi\nobtenues, c'est-d-dire que le texte prend une couleur plus vive et plus claue, tout en\nreslant intelligible (N.B. - le deplacement d'une octave d'une voix de femme rend le\ntexte completement inintelligible).\n3. La combinaison de deux ou plusieurs enregistrements. On trouve cette combi¬\nnaison non seulement dans tous les fragments de chceur des Erinnyes mais aussi en\nd’autres endroits. Ainsi dans un endroit, combinaison de trois enregistrements du meme\nchceur: on entend alors chanter des accords, la oil le chceur le mieux entraine echouerait.\nAilleurs, un chceur mixte a ete combine avec un chceur d'hommes que Von a baisse d'une\noctave par procede mecanique: on obtient alors des basses profondes qui ne se preseii-"
}