{
  "id": "d357-63",
  "text": "tent a Vetat naturel que de faqon tout a fait exceptionnelle. Ailleurs encore on trouve\ndes enregistrements speciaux d’’instruments, combines avec orchestre ou voix.\n4. Les enregistrements sont parfois modeles dynamiquement a Vaide du bouton de\nreglage, ce qui provoque ainsi, par exemple, un decrescendo ou un crescendo qui n'est\npas joue. En outre, ceci se produit parfois apres Vintonation proprement dite, ce qui\ndonne alors une variation dynamique, impossible a obtenir par d^autres moyens.\n5. Etant donne la possibility de faire disparaitre des fragments de la bande d’en-\nregistrement, les attaques de chceur dijficiles a entonner sont preparees a Vaide d'un\naccord de soutien, accord enleve de la bande par la suite. Ainsi, des parties de chceur\nen apparence invraisemblables peuvent etre realisees de faqon simple.\n6. En inversant le sens giratoire de la bande sonore, on peut obtenir des ejfets\nspeciaux. Dans cette partition a ete utilise en particulier le montage d’effets d'inversion\ndHnstruments a percussion (inversion de coup de cymbales, de tam-tam).\n7. On a ajoute parfois au son des intonateurs electriques (generateurs de bruisse-\nment, de dent de scie).\n8. D'autres bruits ont ete egalement ajoutes (bruits de pas, pipeau, sifflement de\nla tempete).\n9. Uecho magnetique a ete par endroits employe comme ejfet.\n10. La combinaison de trois bandes sonores a permis la formation de structures rythmi-\nques depassant les possibilites d'un batteur humain (du moins d'un batteur europeen).\n11. Certains tons ont ete elimines a Vaide de filtres electriques.\n12. Certaines fois les resonances ont ete artificiellement prolongees par utilisation\ndu caveau de resonance.\n13. Par Vinversion d'une resonance, on a obtenu une presonorite a laquelle a ete\najoutee une nouvelle resonance.\n14. Pour le montage des images du passe on a repris un fragment d'enregistrement\ndeja realise. Dans les episodes ou Oreste est en proie a Vegarement, les images du passe\nse croisent comme des eclairs. Parfois dans un dedoublement schizophrUnique.\n15. Dans une de ces images du passe on entend deux fois simultanement la meme\nvoix (la oil Oreste se rappelle une chanson quil a chantee autrefois)."
}