{
  "id": "d357-65",
  "text": "ebranle ne se satisfait pas de cette decision juridique: la voix de sa conscience\ncouvre celle de la loi. II veut recouvrer par ses propres merites la paix interieure.\nA I’instigation de l’oracle de Delphes, il se rend en Tauride pour y reconquerir la\nstatue d’Artemis volee par les Barbares. Ce pelerinage volontaire, il l’accomplit au\nperil de sa vie, mais ce a quoi il s’attache avant tout c’est a la valeur personnelle\net spirituelle de cet acte. Au moment ou le bateau quitte la Tauride, ayant a sa\nproue la statue de la deesse, les deesses de la vengeance s’eloignent et Oreste se sent\ndelivre. C’est alors en homme libre qu’il peut enfin rencontrer son ennemi, Neopto-\nleme, l’epoux impose a sa fiancee Hermione et exiger reparation. Oreste sort vain-\nqueur du duel et epouse Hermione.\nHENK BADINGS est ne le 17 janvier 1907 a Bandoeng (Java). A cause des circonstances il fut\nforce de faire ses etudes a la Haute Ecole de Technique de Delft (geologie) et il obtint son diplome\nde fin d’etudes avec felicitations du jury en 1931. Entretemps il s’etait perfectionne comme compo¬\nsiteur en grande partie par la voie autodidactique de sorte qu’en 1930 deja — done avant d avoir\ntermine ses etudes a Delft — il fit executer sa Premiere symphonie au Concertgebouw d’Amsterdam.\nA partir de ce moment F execution de ses compositions devenait de plus en plus nombreuse dans les\nsalles de concert et aux fetes de musique, ce par quoi il put renoncer a sa fonction comme aide-\npaleontologue a l’Ecole de Technique de Delft pour se consacrer exclusivement au travail musical.\nEn 1934 il fut nomme professeur en chef de composition au Conservatoire de Rotterdam et au\nLycee de musique d’Amsterdam. En 1937 il eut une place dans la direction du Lycee de musique;\nen 1941 il fut nomme directeur du Conservatoire de l’Etat a la Haye. Depuis 1945 il se con-\nsacre exclusivement a la composition.\nEntre autres il a ete nomme membre de l’Academie Royale Flamande pour les sciences,\nles lettres et les Beaux-Arts a Bruxelles, a recu Fordre de la composition d’une oeuvre pour\norchestre pour le centenaire de la « Wiener Philharmonic », Fordre de la composition d’une sym¬\nphonie a l’occasion du soixantieme anniversaire de l’orchestre du Concertgebouw et Fordre de\nla composition d’une symphonie de psaumes pour le Festival de Hollande. Il obtint entre autres\ndes prix a des concours pour compositeurs anonymes avec sa Ballade pour orchestre (Radio Neder¬\nland Wereldomroep, Hilversum 1950), avec ses Six Images pour choeur mixte (Radiodiffusion fran¬\nchise, Paris 1951), Trois ballades pour chceur feminin (Radiodiffusion franejaise, Paris 1951), Suite II\npour carillon (« Jef Denijsprijs,» Malines 1951), Quintette pour piano (Accademia Chigiana, Siena 1952),\nSonate pour un seul violon III (Prix Paganini, Genes 1953), Suite pour carillon III (Malines 1953)."
}