{
  "id": "d357-69",
  "text": "Premier chant: « Pelerinage ». - Le poete arrive a Assise apres y avoir delegue\nen ambassade toute la creation avec « tout son amour et tout son chant ». II y\nentend une voix: « L’ame du petit Pauvre chante inlassablement pour le salut des\nhommes ». Ce message rafraichit son ame: « Alla fresca».\nDeuxieme chant: « Misericorde ». — Le feu de la grace fait son ceuvre. Le pelerin,\naveugle, demande la lumiere, il s’humilie: « Seigneur, je ne suis pas digne ». II demande\npardon d’avoir cede a la tristesse et communie au corps du Christ dans la plenitude\nde la joie retrouvee.\nTroisieme chant: « La Joie ». - Le pelerin crie sa joie et sa reconnaissance. Le\nchoeur acclame et benit le Seigneur. L’alleluia, exaltet anima mea, eclate. Mais tout\nest fragile sur la terre, meme et surtout la joie: le tentateur est la qui guette sa\nproie et lui tend ses pieges. Avec la force du Seigneur, la tentation aussi peut aider\na conserver la Joie, et Messire Franqois prend fin avec la Danse de joie en l’amour\ndivin. Sur la place du clair village (le Paradis), les bienheureux sont rassembles, les\npecheurs leur donnent la main, et le poete invite tout le peuple a entrer dans la ronde.\nPIERRE KAELIN (ne en 1913) a fait ses etudes de musique a Fribourg et a Paris apres\navoir ete ordonne pretre en 1937. Actuellement maitre de chapelle a la cathedrale de St.-Nicolas a\nFribourg, le compositeur de Messire Francois s’est, depuis toujours, specialise dans la formation\nde chceurs. Des 1953 a Radio-Lausanne, avec le quator vocal qui porte son nom, en 1937-39, a Paris,\navec le quator vocale A-B-C-D, pendant la guerre, comme aumonier militaire et chef de la section\n« musique vocale » a l’armee, il accumule de precieuses experiences. II ecrit en 1945 Le livre du chef\nde choeur (preface d’Ernest Ansermet).\nComme compositeur, son temperament ne le porte pas d’abord vers les formes academiques de\nla musique. Ses sources d’inspiration sont le folklore et le chant gregorien traites avec la liberte d’une\nimagination toujours en eveil. Sa musique veut etre un langage avant tout direct. La plupart de\nses oeuvres sont des compositions ou des harmonisations chorales. Ses oeuvres les plus marquantes\nsont: La Messe pour la Paix, la Messe du Sucre, le Cavalier blanc cantate pour choeur, soli et orchestre.\nIl dirige actuellement de nombreux ensembles vocaux qui se distinguent a la fois par une emis¬\nsion vocale claire et depouillee d’artifice et par un repertoire jeune, vivant, eminemment latin, que\nce soit dans la musique sacree ou dans la musique profane.\nEn 1938-39, il travaille a la Compagnie d’art dramatique de Leon Chancerel, a Paris. De cette\ncollaboration deja lointaine fleurit aujourd’hui sa derniere oeuvre: Messire Franqois."
}