{
  "id": "d357-74",
  "text": "Au Bois Lacte est la derniere oeuvre terminee par Dylan Thomas, avant de\nmourir tragiquement a New York, le 9 novembre 1953, a l’age de trente-neuf ans.\nII en avait ecrit la premiere moitie en 1947 a l’epoque ou il vivait a New Quay, un\npetit port de peche de la cote galloise (Cette premiere partie fut ensuite publiee dans\nBotteghe Oscure IX sous le titre provisoire de « Llareggub: Morceau pour la radio\npeut-etre »). Au cours des quelques annees qui suivirent, vivant a Londres, il semble\nque l’inspiration vint a lui manquer, et en depit de l’insistance amicale mais pres-\nsante de la BBC, il n’ajouta que tres peu a son manuscrit. Cependant il finit par\nretourner a son Pays de Galles natal et s’installa dans la petite ville de Laugharne,\nou il avait vecu de nombreuses annees avant la guerre. La dans sa petite maison\ndominant l’Estuaire de Laugharne, il travailla par intermittences sur le manuscrit\npendant un ou deux ans, et le termina finalement en automne 1953. Il l’apporta\na la BBC quelques jours seulement avant de quitter l’Angleterre pour son dernier\nvoyage a New York. La radiodiffusion eut lieu deux mois apres sa mort. Les chansons\nfurent mises en musique par le compositeur gallois Daniel Jones, son ami intime\ndepuis l’enfance.\nAu Bois Lacte ne comporte pas d’intrigue; Faction decrit vingt-quatre heures,\nde minuit a minuit, dans le petit bourg de pecheurs de Llareggub.\nNous entendons les reves et les desirs secrets des dormeurs. Dans le reve du\nCaptain Cat le vieux capitaine au long cours aveugle, passent a la derive les noyes,\nses anciens compagnons de voyage, et Rosie Probert, l’amour unique de sa vie.\nMiss Myfanwy Price reve de Mr. Mog Edwards, le drapier, qu’elle ne rencontre\njamais bien qu’ils s’ecrivent Fun l’autre des lettres d’amour tous les soirs. Mr. Waldo\nreve a son enfance et a ses voisines qu’il scandalise. Mrs. Ogmore-Pritchard reve a\nses deux feus maris. Tous les habitants du bourg sont endormis et revent.\nL’aube se leve sur Llareggub Hill. Les petits dejeuners cuisent et sont manges.\nCaptain Cat assis a sa fenetre entend les enfants allant a l’ecole et Willy Nilly le\nfacteur qui porte les lettres que sa femme a deja ouvertes et lui a lues a haute voix\nau petit dejeuner. L’aimante et aimable Polly Garter passe et dans la boutique les\nfemmes potinent. Puis vient «le long, paresseux, lyrique apres-midi», le crepus-"
}