{
  "id": "d357-75",
  "text": "cule et la tombee de la nuit, avec les ivrognes et les amoureux, avec les arbres\ndu Bois Lacte agites par le vent.\nComme l’a ecrit un critique, Au Bois Lacte exploite a fond le moyen d’expression\noffert par la radio en construisant une structure sonore purement verbale, « creant\nles couleurs memes, les odeurs, les caresses de Pair qui passent sur le bourg sous\nl’invisible poussee des heures ». C’est une prose de poete, bourree d’une riche ima-\ngerie, qui ravit l’oreille, lyrique, passionnee et cocasse. II y a des passages de com-\nmerage inspire, d’humour exaltant, de haine vitriolique, de profonde comprehension\nhumaine. A travers toute cette richesse verbale et cette perfection technique, brille\nle feu de la compassion.\nEn ecrivant pour la radio, Dylan Thomas avait trouve la forme qui lui permet-\ntait a la fois liberte et concentration, — une forme ou il pouvait passer de la\nnarration au lyrisme, du burlesque au tendre, sans jamais compromettre sa vision\nunique et passionnee. II semble qu’avec la publication de son Recueil de poemes\nen 1953, il ait considere que la premiere phase de son developpement poetique etait\nachevee et qu’a partir de la il ait eu l’intention de se consacrer a des travaux drama-\ntiques congus sur une plus grande echelle. Au Bois Lacte reste le seul exemple des\nchefs d’oeuvre dont sa mort nous aura prives.\nDYLAN THOMAS, ne a Swansea en octobre 1914, a fait ses etudes a Swansea Grammar School.\nAlors qu’il etait encore ecolier, il composa plusieurs poemes qui denotaient deja une forte indivi¬\nduality Quand il quitta l’ecole, il entra comme reporter au South Wales Evening Post, puis il\nvecut quelque temps a Londres, ecrivant des poemes et des nouvelles. C’est en 1934 que fut publie\nson premier livre, Eighteen Poems. Ce livre fit une vive impression sur des critiques aussi avertis que\nle docteur Edith Sitwell, laquelle se rendit compte que Dylan Thomas « a cree un idiome; il a\nremue, de faqon organique, les racines de not.re langue, et lui a donne une nouvelle vitalite ».\nEn 1936, il publiait Twenty-One Poems, en 1939 The Map of Love, volume de poemes et de nouvelles,\net en 1940 A Portrait of the Artist as a Young Dog, recueil d’histoires humoristiques relatives a\nson enfance. Il est cependant probable que ce sont les poemes publies dans Deaths and Entrances (1946)\net dans In Country Sleep (1951) — lesquels forment la derniere partie de ses Collected Poems (1953) —\nqui lui vaudront la reputation d’etre un des grands maitres de la poesie anglaise.\nDylan Thomas s’est aussi fait une renommee a la radio; il etait sans rival quand il lisait sa\npoesie et ses propres nouvelles, et il etait non moins brillant en tant qu’acteur de la radio."
}