{
  "id": "d357-80",
  "text": "Le Voyage du Prisonnier (le choix du titre rappelle intentionnellement l’oeuvre\nde Bunyan) constitue un exemple d’art dissimule sous Fart. Son auteur, Louis\nMac Neice a ecrit, parmi ses nombreuses productions radiophoniques, une certaine\nquantite de paraboles dramatiques (dont la plus connue est The Dark Tower); ces\ndernieres sont frequemment ecrites en vers ou franchement stylisees et se situent\nsouvent dans le domaine de la fantaisie pure. Au premier abord, le Voyage du Pri¬\nsonnier est une simple histoire dont Faction se passe a l’epoque contemporaine et\ndont les dialogues utilisent le langage ordinaire de la conversation. Le debut du\nrecit nous amene dans un camp de prisonniers de guerre, caique sur certains camps\nde la derniere guerre. L’auteur a recueilli la plupart des details realistes qu’il nous\ndonne au cours de conversations avec d’anciens prisonniers de guerre. Mais dans\ncette production la guerre symbolise autre chose encore que les guerres de quelque\ngenre qu’elles soient et le camp est le symbole de plusieurs types d’emprisonnement\n— emprisonnement spirituel, intellectuel, psychologique — tandis que l’oppression\ndans le camp est due tout autant a la co-existence avec les autres prisonniers qu’a\nl’ennemi. Toute la piece est basee, ainsi, sur une double interpretation et quand\nson heros declare « J’ai deja ete ici », il ne fait que resumer une maladie moderne\ntres repandue.\nWaters, ce heros, est un neurotique au passe typiquement malheureux; apres\navoir passe quelque temps dans le camp il tombe dans une espece d’etat mystique.\nLe camp, cependant, est situe au pied d’une montagne et il est lui-meme un pas-\nsionne de la montagne. Aussi, lorsqu’une occasion de s’evader lui est donnee, il la\nsaisit avec une certaine joie — non pas tellement pour ce que l’evasion represente\nen elle-meme, mais parce qu’elle lui permettra de gagner la montagne. Il a aussi un\nprejuge defavorable a l’egard des femmes, partiellement du a un mariage malheureux;\nmais, lorsqu’il rencontre une femme sur la montagne, il tombe amoureux d’elle; il\ns’eprend d’elle pour deux autres raisons: parce qu’elle a vecu, elle aussi, une tragedie,\net parce que leur amour prend naissance au bord de la mort. L’auteur ne suggere\npas, bien entendu, que ceci soit la solution ideale du neurotisme. Le heros et l’he-\nroine constituent en eux-memes un cas special."
}