{
  "id": "d357-93",
  "text": "GRANDE BRETAGNE\nMon frere est mort\nmelodrame pour la radio\nmusique de\nP. RACINE FRICKER\nlivret de\nJAKOB BRONOWSKI\nduree 82' 20\"\nLes Six Jours cyclistes se courent dans le velodrome d’une ville quelconque de\nl’Amerique du Sud. Nous sommes au soir de l’avant-derniere journee et deux freres.\nCarlo et Philip, qui font equipe sont en tete avec une avance de trois tours. Plusieurs\npersonnes, de maniere diverse, sont interessees a leur victoire: Estella, l’amie de\nCarlo; Jacko, ancien coureur et entraineur des deux freres, et avec lui sa femme\nMary; le gangster Lucky Francesco et ses trois comperes. Au cours d’un tour de\npiste chronometre Carlo tombe et se blesse. Lucky qui a parie sur la victoire des\ndeux freres s’efforce de convaincre Jacko de la necessite de remettre Carlo en piste;\nJacko, apres avoir oppose une certaine resistance, cede finalement a 1’insistance\nlourde de menaces de Lucky ainsi qu’a son propre interet. Carlo est remis en piste,\nil fait quelques tours comme un automate, puis s’abat sur le sol, foudroye par la\nmort. Jacko et sa femme quittent la ville pour fuir la vengeance de Lucky, qui a\nperdu son pari, et arrivent dans un cafe ou un orchestre de jazz est en train de\nrepeter. Les musiciens, amis et supporters de la malheureuse equipe, avouent qu’ils\nont gagne beaucoup d’argent en misant, aux dernieres heures de la course, sur la\ndefaite des deux freres. Honteux de cet acte de deloyaute ils se cotisent et remettent\na Jacko et a Mary une somme qui leur permettra de s’eloigner. Mais survient Philip\nqui convainc Jacko et quelques uns des musiciens de se joindre a lui pour se mettre\na la recherche de Lucky et venger la mort de Carlo. Ils vont attendre le gangster\ndans un bar et lorsqu’il arrive, Philip reussit a le tenir en respect sous la menace\nd’un revolver, mais les autres membres de la bande surviennent et la situation est\nrenversee. Lucky, qui ne veut pas commettre un meurtre en public, cherche a\nentrainer Philip hors du bar. A ce moment, les amis de Philip, qui etaient restes a"
}