{
  "id": "d286-124",
  "text": "NAJSB Headquarters\n14 Gregory Hall\nUrbana, Illinois\nMay 14, 1959\nMr. Heal K. McNaughten, Manager\nProfessional Products Division\nAmpex Corporation\n534 Charter Street\nRedwood City, California\nDear Neal:\nI still remember with pleasure our lunch together at Redwood City some years\nago, and have seen Bob Miner and others from your firm increasingly fre¬\nquently at our recent meetings. We are especially pleased at this, as we\nare with the Ampex affiliation as an Industrial Associate, in view of our\nincreased emphasis on the best possible quality equipment and the highest\npossible standards throughout, for our members and their stations.\nSince 1951 we have been distributing our NASB (Radio) Network programs on\ntape. We are very proud of this Network, and it is each year winning in¬\ncreased respect and recognition. For this national service to our members\nwe have been using two \"mass duplicators,” manufactured by L. S. Toogood,\nand sold by Rawdon Smith. These were purchased with funds from the W. K.\nKellogg Foundation. As 1 need not tell you, funds for radio have been diffi¬\ncult to secure in a period of TV emphasis •\nRecently, however, there is a great resurgence of interest in educational\nradio, particularly FM. We would like to retire our mass duplicators to the\nside lines, and meet the new demands of both increased quality and quan¬\ntity, with a battery of perhaps six Ampexes* The new need is Increasingly\ninternational as well as national. We have requests for our Network service\nfrom various African, Asian and Latin American National Broadcasting Systems.\nWe have recently had to take steps to amend our Constitution to allow an\n“International Associate” category for the Nigerian, Liberian and other\nBroadcasting Companies. We would like to be able to announce, and later\nindicate in our offerings, that our tapes are made on Ampex equipment, and\nto show such equipment to the increasing flow of visitors from underdeveloped\nnations all over the world, who visit us to seek our advice as they set up\nnew stations • We believe this would offer a broader market for fine equipment\nas well as for our programs."
}