{
  "id": "d286-131",
  "text": "Jun. 3» 1958\nto/ Richard B. Hull-\nHenry Chadeayne\nHarry Skomla\nFROM* Burton Paulu\nIn view of the disappointing news from Lester Nelson, you\nnay be Interested In a quick review of the notes I took during\nour oonferenoe with him on the morning of May 21.\nNelson opened the meeting by saying that we should \"replow\"\nthe whole subject for him. Although he had some knowledge of our\nnegotiations with John Weiss, he was not fully up to date.\nMe mentioned that there would be a fund for the Advancement\nof Education board meeting on Monday, May 26.\nHe asked If our proposal envlaaged an extension of NABB\nactivities. This led to his observation that the grant whloh\nwe requested was for activities which should be carried over a\nperiod of several years rather than piecemeal. He then atated\ntwo assumptions: the project we had in mind would require\nconsiderable funds; and. It would require continuity, over a\nperiod of several years.\nIf these things needed to be done, who should do them?\nThree proceedures were possible: the work could be given to an\nalready existing group; a coordinated attack using several\nRoups could be mounted; or a new group could be created \"de nuovo.\nan and later he implied — though he did not say outright —\nthat he Inclined to choice one — taking an already existing\ngroup, that being NAEB.\nHe asked what would happen after five years If the projeot\nwere not continued? We answered that we didn’t know, but pointed\noi*t that, .T.D If tbla war. ^. wortc could b.\ncompleted at any point efher tvo jsera; and that* if a\nfifth, sixth or seventh year were not forthcoming, the work that\nhad hisan done would not suffer seriously from the laok of\ncontinuation.\nHe raised the question, what should be done If the foundation\ngave ua lasa than the full amount: should there be lest money for\nall five yeara, or all of the funds for less than five years.\nHe observed that he would talk to Burlch and Pauat, and that\ntbay — not he — would decide what to do. There were various\nfactors, ha pointed out, which would predetermine the deolalon\nquite apart from the merits of our case. He Included here the\noverall earnings of the Ford Motor Company, aa well as the"
}