{
  "id": "d286-133",
  "text": "RECEIVED\nNAEB HEADQUARTERS\nJUN 1 1 1958\nAM P»\n7|8|9iiptll|12|J|2|$|4lW\n«une 7, 1958\nTO:\nBurton Paulu\nHenry Chadeayne\nHarry Skornla ts\nFrank Schooley\nJames Hiles\nFROM: Richard B. Hull\nVarious letters and memoranda addressed to me from you during the period\nJune 1 to the present In re the Lester Nelson letter of May 21, 1958,\nturning down the large scale NAEB request and the question, WHERE 00 WE\nGO FROM HERE?\nPresent and Past Tense\n1. All of us share the sense of shock voiced by Chadeayne in his June 2nd letter.\nCertainly the NAEB delegates waiting upon Nelson would have laid $0-40 odds\nfor a favorable Fund or Foundation response to the big proposal following our\nmeeting.\nA copy of Paulu*s letter of June 3, summarizing the notes taken at the May 21\nmeeting with Nelson illustrates the basis for our optimism and also the record\nof literal fact on which Nelson technically premised his May 28 letter.\n2. A telephone conversation with Nelson prior to my drafting of my June 6 letter\nappealing for a short-time grant (all of you now have copies) led me to beiieve\nquite definitely that Nelson wrote this letter under official Instructions from\nabove. This is m^ conclusion and not a paraphrase or quotation of remarks by\nNelson.\n3. One can only speculate as to what prompted such a decision In the Ford hierarchy.\nAt this point, speculation without some solid data is probably useless. Whether\nor not the upcoming meeting of The Fund for the Advancement of Education board\nJune 20 or 21 will provide illumination remains to be seen. However for the\nfeSSi Ip. 9l speculations see copy of Skornia*s letter to Chadeayne of June 3,\ne.g., items 4 and 6. A point of fact on Skornia's item I re Foundation and\nFund: Nelson is now officially the Treasurer of the Fund and a member of the\nEducation Division of the Foundation. Ergo he does speak for both and told me\nso. However WHO speaks TO him remains the question.\nNOTE: For further speculation and indictment read the chapter on foundations\nin Whyte*s “The Organization Man.“\n4. Warm thanks to Schooley and Skornia for the short-term “interim budget* detail\nthey prepared."
}