{
  "id": "d286-68",
  "text": "60\nAppendix 3 (Continued)\nThoreau, Emerson, Alcott and the other New England Renaissance leaders,*..\nThe University administration was impressed by the grant-in-aid. . At the\nconclusion of the project, George W. Sloan, Jr., who produced and directed\nseries, was appointed instructor in radio and faculty supervisor of stu¬\ndents on station WBUR, largely on the basis of his work on the grant-in-aid*\nAssociate professor Sidney A. Dimond, who wrote the series, has been invited\nto speak to several professional organizations on the subject....*’\nIowa State College — 41..Furthermore, when the job was completed we were\nable to offer it to the college administration as evidence of our ability to ex¬\npand into new areas of production, granted the necessary additional financial\naid... .we succeeded in retaining the man who carried Cleary’s routine duties\nwhile he (Cleary) was producing ‘Contour Country,’ and assigning Cleary to\nfull-time production in extra program areas. In short, one direct effect of\nthe grant-in-aid to WOI was the creation of a new and permanent staff posi¬\ntion.”\nThe George Washington University — \"The grant-in-aid... .enabled the Uni¬\nversity to begin a program of training in radio news reporting, which, in the\nfuture, may lead to a fully-developed curriculum in radio-television commun¬\nications.*,* On the basis of the knowledge we gained in producing 'Wash¬\nington Background’ the University has established a new course, to be given\njointly by the Speech and Journalism Departments in the spring, for which we\nplan to have a top Washington newsman as instructor, A good deal of the\nstudents* time in the course will be devoted to producing taped broadcasts\nsimilar to those made for 'Washington Background.’ ”\nUniversity of Illinois (Another TV grant made at the time NAEB handled these\ngrants) — \"For the first time we were able to devote a major effort to a proj¬\nect (series entitled ‘Feeding a Nation*) which we considered to be of sub¬\nstantial importance. We think we accomplished some measure of success....\nThe College of Agriculture, which worked with us on this series, has consid¬\nerable interest in television. They, too, found this project most rewarding.\nWithout the help made possible by the grant-in-aid, the College of Agricul¬\nture could not have spent so much time on the series — and without that help,\nthe series would have been impossible. A large number of their staff now\nh?; n keener appreciation of television and its possibilities. The problem of\nW' ing with academic departments is certain to be one of the chief concerns\nf a University-operated station. Where should the responsibilities be\ndivided? Where does the subject matter and and the presentation begin? We\ndo not have the answers, but we have some good ideas. These ideas are\nprincipally the result of a long and detailed period of working with tho College\nox Agriculture. ”"
}