{
  "id": "d286-72",
  "text": "64\nAppendix 6\nCONSULTATION SERVICES\n(Note: In some cases these visits were to new stations which were having\ndifficulties in which they needed assistance. In other cases they\nwere visits to locations where no station was assured. The success\nof these teams — and later individual visits — in helping to secure\nsupport, approval, and station activation is a tribute to the quality\nof the NAEB individuals who made themselves available as consul¬\ntants .)\nStation WTVS, Detroit. June 8 - 10, 1955, Consultants: John Schwarzwalder,\n(then) KUHT, University of Houston; William Harley, WHA-TV, University of\nWisconsin; Rudolph Bretz, Alabama ETV Commission; John Winnie, State Uni¬\nversity of Iowa; E. A, Hungerford, Jr,, Metropolitan ETV Association, New\nYork; Cecil Bidlack, NAEB.\nStation KUON-TV, University of Nebraska. December 5 - 7, 1955. Consul¬\ntants: Armand Hunter, WKAR-TV, Michigan State University; John Winnie,\nState University of Iowa; Jack Chenoweth, KETC, St. Louis; Cecil Bidlack,\nNAEB.\nWOSU-TV, Ohio State University. March 12 - 14, 1956. Consultants:\nArmand Hunter, WKAR-TV, Michigan State University; Jack Chenoweth, KETC,\nSt. Louis; Edward Stasheff, University of Michigan; Cecil Bidlack, NAEB.\nWKNO-TV, Memphis. March 24 - 31, 1956. Consultant: William Wood,\nWTVS, Detroit.\nWKNO-TV, Memphis. May 24 - 25, 1956. Consultant: Jack Chenoweth,\nKETC, St. Louis.\nOregon State System of Higher Education. June 18 - 23, 1956. Consultant:\nArmand Hunter, WKAR-TV, Michigan State University.\nUniversity of Alabama, Tuscaloosa, Alabama, April 17 - 20, 1957. Consultant:\nFrederick Remley, Jr., University of Michigan.\nMetropolitan Educational Television Association, New York, April 22 - 24, 1957.\nConsultants: John W, Taylor, WTTW, Chicago; George Arms, KETC, St. Louis;\nJohn White, KQED, Pittsburgh.\nKETC, St. Louis, June 15 - 18, 1957. Consultant: Richard B. Hull, WOSU-TV,\nOhio State University.\nKUED, Salt Lake City, Utah, August 25 - 27, 1958. Consultant: James Day,\nKQED, San Francisco."
}