{
  "id": "d286-84",
  "text": "76\nAppendix 13\nNAEB COMMITTEES AND MEMBERS\nJ^asuUve Committee: William Harley, Stations WHA-AM-FM-TV, Univer¬\nsity of Wisconsin, Chairman; Graydon Ausmus, Station WUOA, University\nof Alabama; Robert Coleman, East Lansing, Michigan; Keith Engar, Station\nKUED, University of Utah; Jack McBride, Station KUON-TV, University of\nNebraska; Robert Schenkkan, Station KUT-FM, University of Te::as,\nAwards and Citations Committee: Franklin Dunham, United States Office of\nEducation, Chairman; Richard Hull, Stations WOSU-AM-FM-TV* Ohio State\nUniversity; H. B. McCarty, Stations WHA-AM-FM-TV, University of Wis¬\nconsin; Frank Schooley, Stations WILL-AM-F M-TV, University of Illinois;\nI. Keith Tyler, Institute for Education by Radio-TV, Ohio State University;\nJudith Waller, 1515 Davis Street, Evanston, Illinois,\nCongtltution Committee: James Miles, Station WBAA, Purdue University,\nChairman; Richard Bell, Arizona State College; Franklin Dunham, United\nStates Office of Education; Garnet Garrison, University of Michigan; Armand\nHunter, Station WMSB, Michigan State University; Leonard Marks, Cohn\nand Marks, Washington, D. C.\nEngineering Committee: Carl Menzer, Stations WSUI and KSUI, State Uni¬\nversity of Iowa, Chairman; John Brugger, Washington County Public Schools,\nHagerstown, Maryland; Keith Ketchum, Stations WOI-AM-FM-TV, Iowa\nState University; C. E. Phillips, Station WERS, Emerson College; Fred\nRemley, TV Center, University of Michigan; Jack Stiehl, Stations\nWHA-AM-FM-TV, University of Wisconsin ,\nFinance Committee: William Harley, University of Wisconsin, Chairman,\nPlanning Subcommittee: Richard Hull, Stations WOSU-AM-FM-TV,\nOhio State University, Chairman; James Miles, Station WBAA, Purdue Uni¬\nversity; Frank Schooley, Stations WILL-AM-FM-TV, University of Illinois,\nSpecial Projects Subcommittee: Frank Schooley, Stations WILL-AM-FM-TV,\nUniversity of Illinois, Chairman; Richard Hull, Stations WOSU-AM-FM-TV,\nOhio State University; Robert Schenkkan, Station KUT-FM, University of\nTexas,\nGrants-in-Aid Committee: Edward Rosenheim, Jr., University of Chicago,\nChairman; R. Edwin Browne, Stations KFKU and KANU, University of Kansas;\nLarry Frymire, Stations WKAR-AM-FM, Michigan State University; Harry\nLamb, Station WTDS, Toledo Public Schools; Mrs. Elizabeth Marshall, Sta¬\ntion WBEZ, Chicago Board of Education*"
}