{
  "id": "d286-85",
  "text": "77\nAppendix 13 (Continued)\nClosed Circuit TV Committee: Leslie Greenhill, Pennsylvania State Univer-\nChairman; Neal Balanoff, Stephens College; William Brish, Washington\nounty Public Schools, Hagerstown, Maryland; Glenn Macomber, Miami\nuniversity, Oxford, Ohio; Miss Wanda Mitchell, Evanston Township High\nSchool; Donald Schein, Mohawk-Hudson Council on ETV, Schenectady, New\nYork; Glenn Starlin, Inter-Institutional Teaching Project, University of Oregon.\nTV Planning Committee: Jack McBride, Station KUON-TV, University of\nNebraska, Chairman; Franklin Bouwsma, Station WTVS, Detroit Educational\nTelevision Foundation; Richard Burdick, Station WHYY-TV, Philadelphia,\nPennsylvania; Hartford Gunn, Station WGBH-TV, Boston, Massachusetts;\nKeith Nighbert, Station WENH, University of New Hampshire; Richard Rider,\nStation WILL-TV, University of Illinois; John Schwarzwalder, Station KTCA,\nMinneapolis-St. Paul; Loren Stone, Station KCTS, University of Washington*\nRadio Planning Committee: Larry Frymire, Stations WKAR-AM-FM, Michigan\nState University, Chairman; E. G. Burrows, Station WUOM, University of\nMichigan; Clifford Eblen, Stations WHA-AM-FM, .University of Wisconsin;\nStephen Hathaway, Station WMUB, Miami University, Oxford, Ohio; Miss\nOla Hiller, Station WFBE, Flint, Michigan; Hugh Mix, Station WNAD, Uni¬\nversity of Oklahoma; Len Press, Station WBKY, University of Kentucky;\nE. J. Slack, Station KUSD, University of South Dakota.\n.Utilization Committee: Gale Adkins, University of Kansas, Chairman.\nRadio Subcommittee: George Johnson, Station WFIU, Indiana University,\nChairman; Gertrude Broderick, United States Office of Education; James\nFellows, Empire State School of the Air; Miss Marguerite Fleming, Station\nKSLH, St. Louis Board of Education; John Henderson, Station WBAA, Purdue\nUniversity.\nTV Subcommittee: Clair Tettemer, Station KETC, St. Louis, Missouri,\nChairman; Clifford Erickson, Chicago City Junior College; Miss Wanda\nMitchell, Evanston Township High School; Uberto Neely, Station WCET,\nCincinnati, Ohio; Lewis Rhodes, Station KUON, University of Nebraska.\nProfessional Advancement Committee: Earl Wynn, Stations WUNC-FM-TV,\nUniversity of North Carolina, Chairman; Vernon Bronson, Stations WTHS-FM-TV,\nDade County Board of Public Instruction; R. Edwin Browne, Stations KFKU\nand KANU, University of Kansas; James Day, Station KQED, San Francisco;\nDonley Feddersen, Station WTTW, Chicago; Harry Lamb, Station WTDS,\nToledo Public Schools; Carl Menzer, Stations WSUI and KSUI, State Univer¬\nsity of Iowa; Robert Schenkkan, Station KUT-FM, University of Texas."
}