{
  "id": "d286-98",
  "text": "3\nREPORTS OF WORKSHOPS AMD SEMINARS (CON*T.)\nPubl-\nNc,\nW-17 NAEB Video Recording Workshop - Cecil S. Bidlack, Editor\nReport of the Video Recording Workshop held in the WTTW Studios,\nChicago, Illinois, May 5-9, 1958, for engineers from educational\nTV stations operating kinescope, recorders. 1958. 62 pp. Paper. $1.00\nW-18 NAEB Seminar on Children1 s Television Programs - Harold E. Hill, Editor\nReport of the Seminar on Children’s Television Programs held\nat Boston University, March 29-April 1, 1958, for educational and\ncommercial broadcasters of children*s TV programs. 1958. 37 pp.\nPaper. $2.00\nW-21 NAEB Radio and Audio\" Engineering Seminar - Cecil S. Bidlack, Editor\nReport of the Radio and Audio Engineering Seminar held at Allerton\nPark, University of Illinois, May 27-June 1, 1956, for technical\npersonnel in NAEB member radio stations. July, 1956. 23 pp#\nPaper. $1.00\nW-22 NAEB TV Lighting and Staging Workshop - Hazen J. Schumacher, Editor\nReport of the TV lighting and Staging Workshop held at the University\nof Michigan, August 19-22, 1956, for ETV personnel actively engaged\nin lighting and staging work. February, 1957. 10 pp. Paper. 50$\nW-23 NAEB TV Program Planning Seminar - William G. Harley, Editor\nReport of the Program Planning Seminar, for personnel actively\nengaged in planning of programs for ETV stations and production\ncenters, held at the University of Wisconsin, August 26-September 1,\n1956. February, 1957. 64 pp. Paper. $1.00\nW-26 NAEB Research Seminar for Educational Television and Radio - I. Keith\nTyler, Editor\nReport of the Research Seminar for Educational TV and Radio held\nat Ohio State University, December 9-13, 1957, for research\nspecialists in educational broadcasting. 1958. 31 PP# Paper.\n$1#00\nW-27 NAEB Seminar on Instructional Uses of Television and Radio - Elaine\nAft on, Editor\nReport on the Seminar of instructional uses of TV and Radio held\nat Purdue University, July 21-25, 1958, for TV staffs associated\nwith educational broadcasting and educators responsible for\ntraining prospective teachers. 1958. 62 pp. Paper. $2.00"
}