{
  "id": "d684-103",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nEditorializing by ETV stations, political alignment of directors on the\nCorporation board, and the need for the public television station in the nation's\ncapital (WETA) to be on the VHF band were main topics in House hearings today\non the Public Television Act.\nFord Foundation representatives --President McGeorge Bundy, Consultant,\nFred W. Friendly and counsel David Ginsburg -- were major witnesses at the\nmorning session.\nCongressmen on both sides of the aisle questioned Mr. Bundy on his attitude\ntowards ETV stations editorializing on the air. He replied that \"what looks to one\nperson as fair comment mciy seem to a politician as a brutal attack. \" There must\nbe a sense of fairness and responsibility when reporting the news, he said.\nCongressman John E. Moss (D. -Calif.) retorted it is \"difficult\" to separate\n\"fair\" commentary from editorializing. \"Right of reply\" is one way to deal with\nthe problem, the Ford Foundation executive explained.\nCommittee minority leader William Springer (R. -Ill.) pressed Mr. Bundy\nfarther and asked \"Are you going to say there will be no editorializing? \" In\nanswer, Mr. Bundy said there is difficulty in exactly defining the word, though he\nfeels station management will assume broad responsibilities in news and public\naffairs and present all sides of issues. Mr. Friendly noted there is a difference\nbetween straight news and interpretive reporting, and, \"journalists must draw a\nline. \" \"Before you get any funds next year, you better have some conclusions\"\nto this question, said Representative Springer.\nAs to political qualification for membership on the Commission, Mir. Bundy\nsaid \"I. . .believe that it would be unwise. \" He described membership on the\nBoard as having the responsibility \"to insure the editorial integrity and professional\ncompetence of those to whom they entrust funds for programming, but there should\nbe no implication that any member of the Board is appointed for the purpose of\nwatching over the special interests of one political party or another. And it would\nalso seem to me unwise to limit membership in this Board to those who are clearly\nassignable to one or the other of the great parties. \" The general requirement of\nsenatorial confirmation will assure insulation, he said.\nMr. Bundy addressed himself to the Ford Foundation proposal of a domestic\nsatellite service. \"I do wish to reaffirm our conviction that there is great promise"
}