{
  "id": "d684-104",
  "text": "-2-\nin the satellite for public broadcasting, for instructional broadcasting, and for\ncommercial broadcasting as well. . . the power and economy of satellites can\nopen the way to a wholly new level of diversity and quality in the distribution of\nprograms. . . 11\nRepresentative Paul G. Rodgers (D. -Fla. ) said to pass effective legislation,\nthe Committee must look more than one year ahead as to the costs of funding the\nCorporation. He asked Mr. Bundy if he had specific cost suggestions. He replied,\n\"it is best to proceed along the lines of the present bill. \" His observation is that\nby next year the Board will have had a chance to study future needs and a \"closer\nlook\" can be made at that time. Mr. Donald Brotzman (R. -Ohio) said \"I'm not\nvoting for a one year thing. \"\nMr. Friendly, in his testimony, stated: \". . . it is clear from the tone and\npenetration of your questioning that if you decide to vote for this bill, you mean to\ndo so with the understanding that you are granting a birthright with all the commit¬\nment and responsibilities involved and not just a temporary permit for token public\ntelevis ion. \"\nHe added: \"What this bill can do is to stretch television and radio to provide\nenough air time, provide an electronic preserve . . . to pursue excellence.\" \"Public\ntelevision won't be confined to journalism alone; it is an instrument for culture and\nentertainment as well as for instruction and education. \"\nCongressman Albert Watson (R. -S.C. ) wanted to know why it wouldn't be\n\"proper and more economical\" to support local ETV systems rather than to legis¬\nlate another Federal \"monstrosity. \" He asserted that South Carolina \"has one of\nthe pioneer systems, \" in educational television.\nThe Governor of Utah, Calvin L. Rampton, testified on behalf of his state\nand the Federation of Rocky Mountain States. He endorsed the legislation before\nthe House Committee and stated:\n\"We feel that the educational television now present in this region has\ncontributed to the refinement and education of the public as well as our educational\nlearning process. We believe that through the use of television mediam described\nby the Public Broadcasting Act of 1967, we will move forward to national and\ninternational television which will broaden the knowledge and understanding of\nour people, and thus contribute significantly to a stronger foundation for a pro¬\nductive and peaceful society. \"\nWilliam R. Smith, director of the Mississippi Authority for Educational\nTelevision, told the Committee that the bill, if passed, could assist in improving\nthe educational, economic cultural and social conditions in that state which he\ndescribed as severe. He said that after a sweeping study of the state's total educa¬\ntional needs, one recommendation was the establishment of a state-wide color ETV\nnetwork which will be partially operable by January, 1969. He said that ETV offers"
}