{
  "id": "d684-110",
  "text": "ADDITIONAL STATEMENT BY WILLIAM G. HARLEY\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nFollowing hearings on the Public Television Act in the Senate, the\nNAEB submitted an additional statement in order to clarify the\nmatter on networking and station interconnection with respect to the\nproposed Corporation for Public Television. We would like to add\nthese same points here.\nMeetings to discuss these matters were held with representatives of\nthe Carnegie Commission on Educational Television, the National\nEducational Television Network, and the National Association of\nEducational Broadcasters. Specially, NAEB agreed to associate itself\nwith the following statement, which was included as part of a long\nletter sent to Senator John 0. Pastore and thereafter included in\nthe Record of the Hearings on S-1160 - The Public Television Act -\nbefore the Subcommittee on Communications of the Committee on\nCommerce of the United States;\n\"The ultimate responsibility for interconnection for national\ndistribution must rest with the Corporation.\n\"In exercising this responsibility, the Corporation clearly has the\noption of choosing among several methods. It might appoint an\nadvisory committee, including representatives of local educational\nbroadcast stations, to suggest to it policies for the handling of\ninterconnection or to review the interconnection decisions which it\nhad made over a stated period. As another approach, the Corporation\nmight exercise its interconnection responsibility by special\ncontractural arrangements. It might wish to aid in the formation of\na new organization or advisory group, including representatives of\nthe local stations and the program suppliers, to handle day-to-day\ndecisions on interconnection. Whatever special administrative\narrangements are made by the Corporation in exercising its option,\nhowever, it must retain ultimate responsibility.\n\"The following NAEB comments are offered in light of the foregoing\nstatement:\n\"1. An important distinction exists between an interconnected\nnational program \"distribution\" system and a \"network\" system.\n\"Distribution\" involves an interconnection system which delivers\nprograms unrelated to scheduling and unidentified as emanating\nfrom a common source. A \"network\" on the other hand, is an\nidentifiable entity responsible for initiating and supplying a known\nbody of programs either by regular shipment on tape or film, or by"
}