{
  "id": "d684-111",
  "text": "-2-\nsimultaneous interconnection. Regardless of which method is used,\nindividual stations always retain the right to accept or reject any\nprograms. Section 396(a) (3) of S. 1160 prohibits the Corporation\nfrom owning or operating a \"network.\"\n\"2. While associating ourselves fully with Dr. Killian's desire for\ninsuring the greatest possible diversity of programming for the local\nstations, we believe it is essential to the full development of a\nviable noncommercial educational nationwide service that educational\nstations, both television and radio, have access to a \"network\"\nservice as defined above. Two such networks - NET and NER (National\nEducational Radio_} - exist today, which attempt to meet these-*n&fcwork\ndemands of educational stations, though limited financing prevents a\ntruly interconnected service. These networks were specifically\ncreated to meet the needs of local stations for a regular dependable\nsupply of quality programming.\n\"Section 396 (a) of S. 1160 declares that the general welfare would\nbe encouraged by educational broadcast service not only \"in particular\nlocalities\" but \"throughout the United States,\" and encourages a\n\"national policy\" which would make such service \"available to all the\ncitizens of the United States.\" The corporate purposes outlined in.\nSection 396 (g) include assistance for \"one or more systems of\nnoncommercial educational television or radio broadcast stations\nthroughout the United States.\" At least three separate sections of\nthe bill (Sections 396 (a) (2), (4), and (g) (1) (A) emphasize the\ndesirability of diverse programming sources. There is thus ample\nprovision in S. 1160 for the Corporation to foster such a system of\nnetworks, be they the two mentioned above or others.\n\"3. Interconnection, whether for \"distribution\" or for \"network\"\npurposes, raises potentially delicate program decision-making problems.\nAt some juncture, a decision must be made regarding the choice of\nproduct to be placed in the system, if only because of capacity\nlimits. In many instances, program content will be a significant\ndecisional factor. For these reasons, the NAEB strongly favors the\nsecond and third options in the above-quoted statement of\nDr. Killian. More specifically, the NAEB believes that the Corporation\nwould best serve its own interests as well as those of educational\nbroadcasting by exercising \"its interconnection responsibility by\nspecial contractual arrangement.\" The complexity of operational\nneeds, the urgency for a regular program service of high quality,\nand the desirability of scheduled interconnection from the viewpoint\nof the local station, all require day-to-day decisions that may best\nbe made by other experienced organizations under specific contracts\nor grants from the Corporation. Likewise, the NAEB believes that a"
}