{
  "id": "d684-115",
  "text": "-2-\ny\nRep. Springer emphasized that the committee, in good conscience, could\nnot propose legislation on a matter where such significant facts were missing.\nHe qiestionaithe witness on the growth potential of educational television and noted\nthat of the 633 channels allocated to educational television only 130 were in opera¬\ntion now. He insisted on knowing how much this eventual development might cost\nand said “the cost could be very large. “\nAt the start of the hearing Rep. Staggers questioned Secretary Gardner\non the language of the bill. The Senate version (S. 1160) amended the original\nbill from the Public Television Act of 1967 to the Public Broadcasting Act of\n1967. Secretary Gardner said he felt a similar change in the House bill now\nunder consideration -- H. R. 6736, the Public Television Act of 1967 — would\nbe appropriate and that the language throughout the bill should be amended\naccordingly.\nCertain committee members made reference to the fear that the Corpo¬\nration would not be sufficiently insulated from government control and inter¬\nference. Secretary Gardner stressed that the public interest could only be\nserved by “an organization completely free from the government and from\nHEW. It must function independently. “ He said his Department has no prefer¬\nence whether the Corporation contracts directly or indirectly for interconnection\nservices. The Corporation will be prevented from becoming a propaganda agency,\nSecretary Gardner said, by the character of the members appointed to its board\nand by the fact that the local station has the final word on programs it wishes or\ndoes not wish to carry.\nTo preserve a balance of control in the Corporation for Public Broad¬\ncasting, Rep. Springer, minority leader, suggested the possibility of politically\naligning the members of the Board - similar to the FCC, FA A and other Federal\nagencies.\nIn his opening statement, Mr. Staggers stressed that hearings will con¬\nclude Friday, July 21, “even if we have to go through afternoon and evening\nsessions\" to complete them by that date.\nMore than two-thirds of the full Committee was present sometime\nduring the nearly three-hours on the opening day.\nSemantics played a part in the Committee and witness give-and-take.\nShould educational broadcasting be called “Public\"? Isn't all broadcasting\n“public\" since it is licensed by a Federal agency? What the commercial\nbroadcasters, the Carnegie Commission representatives, Ford Foundation\nSpokesmen -- and educational -- or “public\" broadcasters have to say will be\nheard in the next two weeks."
}