{
  "id": "d684-117",
  "text": "The Hon. Harley 0* Staggers\nJuly 26, 1967\nPage 2.\nunder the former limitation of $1 million per state, substituting\nthe 12*5% limitation still provides control but affords sufficient\nadministrative flexibility to accomodate to the varying rates\nof state plan development.\n3. RE PROPOSED AMENDMENT: 12^5% LIMIT ON PROJECTS PER STATE PER YEAR\nTITLE II, SECT. 396 (k)\nWe and the bill agree in principle with this proposed amendment\nin its attempt to insure that program support will be widespread\nthroughout the nation. But, to put a specific percentage in the\nbill itself would be to deny to the Corporation much-needed\nadministrative discretion in grant making, as well as to work a\nspecific hardship on certain states. In New York state, for\nexample, besides NET, there are seven ETV stations and 27\neducational radio stations on the air, with more building. In\nCalifornia there are 8 ETV stations and 32 educational radio\nstations, plus the Western Educational Network, with more coming.\nIn both states also there are frequent national productions for\nthe educational radio and TV regional and national networks. To\nput an arbitrary limit on programming and operations funds for these\nstates would be unfair to their stations, and do substantial\ndamage to network program production from them as well. A number\nof other states would have similar situations. Illinois, with 5\nTV and 20 radio stations plus the headquarters for National\nEducational Radio Network, and the Central Educational TV\nNetwork would be severely restricted. Georgia would be handi¬\ncapped also - with 9 ETV stations and a radio station, plus the\nSouthern Educational Communications Network.\nIn addition, it would be virtually impossible to relate to this\nlimit interstate interconnection charges paid to interstate\ncommon carriers. It would not be fair to include such charges\nin one state allocation in which the programming happened to\noriginate. On the other hand, per-state allocations in any\nprogram network costs would be almost impossible to determine.\nIt would appear to us that it would suffice if strong, explicit\nlanguage were included in the bill's Report regarding the\nimportance of diversity in programming and the need to give\nencouragement to public broadcasting in all the states. This\nwould leave no question as to the intent of Congress, but would\nnot specifically bind the Corporation in such a way as to hamper\nits efficient and effective administration."
}