{
  "id": "d684-118",
  "text": "The Hon. Harley 0. Staggers\nJuly 26, 1967\nPage 3.\n^ * —hTERNATIVES TO THE PUBLIC BROADCASTING CORPORATION\nAlternatives to the Corporation for Public Broadcasting have\nbeen suggested as a means to disburse federal funds to\neducational stations.\nOne such means might be to give some percentage of available\nfunds to each state for subsequent intra-state disbursal to\neducational radio and TV stations. We oppose this proposal.\nIf we are opposed to untoward government intervention with\neducational broadcasting, substituting 50 state governments\nfor one national government hardly insures less interference.\nWe further recognize that not all states; needs are the same\nA flat percentage would not take these differences into account.\nAnd if a federal agency were created to take needs into account,\nwe would have federal determination of highly sensitive program\ngrants, which no one wants.\nAnother suggested alternative is to give funds directly to\neducational stations and let them establish their own needed\nagencies. We oppose this, too. We have no doubt in the ability\nof the educational radio and TV stations to establish in time\nany new agencies which might be needed. The problem lies in\nhow to distribute funds effectively and equitably to the stations\nm the first place. One must assume that there will never be\nsufficient funds to meet all the proposals which can be made\nfor use of available funds. Thus a system of distributing money must\nwhlch is ^ fair to a11' (2) meets the most pressing needs,\nand (3) is not subject to interference by government. We cannot\nconceive of such a formula. Furthermore, it is presumed that any\nformula or system must be administered by an agency of the\nfederal government, such as HEW, which is precisely what we all\nwish to avoid.\nFurthermore, a government agency would not likely be successful\nm seeking private contributions, an essential part of the plan\nas expressed in the present bill. Thus, the need for an\nimpartial agency leads inevitably to the proposed private\nCorporation, capable of independent judgments, and insulated\nfrom government."
}