{
  "id": "d684-119",
  "text": "The Hon. Harley O. Staggers\nJuly 26, 1967\nPage 4.\n5. QUESTIONS RAISED BY THE COMPTROLLER GENERAL\nIn the Senate Report on S. 1160, two points were raised by the\nComptroller General, Elmer B. Staats, on which we would like to\ncomment. First, Mr. Staats noted that a number of grants have\nbeen made to ETV under various federal Acts, and he was concerned\nthat they be taken into account in preparing this legislation.\nWe agree that such grants should be noted, but we observe that\nthe grants mentioned are not in the same area or for the same\npurposes as the grants proposed in the Public Television Act.\nAll such grants have been for special demonstration or research\nprojects, all have been in instructional television, not in\npublic television, and none has been in educational radio. Thus,\nthere has not been nor would there be any overlap or duplication\nwith the Public Television Act. Furthermore, the study called\nfor under Title III would include study of coordinating these\nother grant areas, an activity we support, as does Mr. Staats.\nMr. Staats raised another point, which also arose during the\nhearings: what would be the auditing procedure followed by the\nproposed Corporation? We support the view expressed by other\nwitnesses: that there certainly should be an annual audit of\nthe Corporation's activities, that this should be included in\nits annual report to the Congress and to the President, but\nthat the audit should be performed by a private firm rather\nthan the General Accounting Office, because the proposed\nCorporation would itself be a private organization.\n6. THE SENATE AMENDMENT SPECIFYING \"that 3 of the 15 members\nof the Board shall be associated with the operation of non¬\ncommercial educational radio and TV stations.\" TITLE II,\nSECT. 396 (c)\nWe oppose this amendment, because of possible conflict of interest.\nThe Corporation's Board will be considering many matters related\nto the operations and financial needs of educational stations.\nTo have three of its members directly related to those stations\nmight put these three in the position of either voting on their\nown funds, or absenting themselves from such decisions. Regard¬\nless of the integrity of the individuals, questions are likely to\narise if grants were made by the Corporation to the stations with"
}