{
  "id": "d684-14",
  "text": "stations and program suppliers, and operating on a daily basis\nwith these daily problems independent of the Corporation except\nfor its continuing support and surveillance, affords the best\nopportunity for satisfying these needs in a practical and free\nmanner.\n4. The Corporation is the supplier of funds. As\nsuch, it carries the final responsibility for all of its activi¬\nties, including the essential interconnection service. That re¬\nsponsibility should be exercised in its review of the conduct of\nthose entrusted with providing the service, and in its decisions\nto continue to support one such entity over another. But that re¬\nview should not properly encompass day-to-day program decision¬\nmaking functions by the Corporation of the interconnection entity.\n5. The NAEB is also in agreement with the thoughts\nexpressed by Dr. Killian in his letter of May 3, 1967 to this\nCommittee. We share Dr. Killian's fear of the establishment of\nsuch a strong educational network that all local stations would be\nreduced to mere \"affiliates”, with programs determined by remote\nfiat and an attendant loss of diversity and local autonomy. How¬\never, the NAEB submits that the fears generated by historical re¬\nference to commercial networks are greatly allayed by the absence\nin noncommercial operations of the commercial motivations surround¬\ning such network systems. The NAEB thoroughly supports Dr. Killianfs\nview that the Corporation should be precluded from program produc¬\ntion, and from the prerogative of program scheduling.\n6. Finally, the NAEB concurs strongly with Dr. Killian's\ncomments concerning Section 396 (g) (2) (D) of S. 1160, with respect\nto dissemination of Information about noncommercial educational\nbroadcasting. Program producers, production agencies, local sta¬\ntions, and the Corporation itself, must be able to provide public\ninformation services in connection with particular programs and ac¬\ntivities. Without publicity, there is no value in broadcasting. A\npublic unalerted to program offerings at a particular time is a\npublic unable to utilize such programs. In the NAEB's experience,\nthese promotional activities are an integral part of production and\nbroadcast services.\nWe trust that our comments on these matters will be useful\nto the Committee in its deliberations upon 8. 1160.\nSincerely yours"
}