{
  "id": "d684-15",
  "text": "THE EDUCATIONAL TELEVISION FACILITIES ACT\nPUBLIC LAW 87-447\nFACT SHEET . ;>\nAct was signed Into Iaw May 1} 1962, to stimulate construction of noncom¬\nmercial educational television broadcasting facilities on VHF or UHF channels\nreserved for educational use by the F.C.C.\nThe sum of $.32 million is authorised for this purpose over a 5-year period in\nFederal matching grants, with not more than $1 million of these Federal funds\nto be applied to facilities within any one StAte. Grants may be.made for up\nto 50 percent of the reasonable and necessary cost of an eligible project, plus\nan additional amount of up to 25 percent of the cost of eligible transmission\napparatus owned by the applicant on the date of application with the following\nlimitations:\n!• In no may the Federal grant exceed 75 percent of the cost of an eli¬\ngible project.\n2. Not more than 15 percent of any Federal grant may be used for acquisition\nand installation of apparatus to be used for the interconnection of two or\nmore stations.\n3. The closed circuit usage of any equipment acquired under this program must\nbe incidental to broadcast usage.\n4. An applicant*s own matching funds may be applied only to the purchase of\nitems of equipment which are in the categories of transmission apparatus\neligible for inclusion in Federal grant projects.\n5. Expenditures for such items as land, buildings, and furniture are not\nincludable in an applicant's project, either for Federal grant or for\nmatching purposes.\nTO BE ELIGIBLE FOR CONSIDERATION FOR A GRANT, AN APPLICANT MUST BE;\n1. An agency or officer responsible for the supervision of public elementary\nor secondary education or public higher education within a State, or within\na political subdivision thereof.\n2. A State educational television agency.\n3. A college or university deriving its support in whole or in part from tax\nrevenues.\n4. A nonprofit foundation, corporation, or association which is organized\nprimarily to engage in or encourage educational television broadcasting\nand is eligible to receive a license from the Federal Communications Com¬\nmission for a noncommercial educational television broadcasting station\npursuant to the Rules and Regulations of the Commission in effect on\nApril 12, 1962.\nIN ADDITION, EACH APPLICANT MUST:\n1. Demonstrate his financial ability to provide the non-Federal funds needed\nfor the construction, operation, and maintenance of the facility described\nin his application.\n2. Give assurance that broadcasting facilities will be used only for educa-"
}