{
  "id": "d684-40",
  "text": "DAVID MARSHALL STEWART\nNASHVILLE PUBLIC LIBRARY\n222 EIGHTH AVENUE. NORTH\nNASHVILLE 3. TENNESSEE\nJune 23, 1967\nThe Hon, Dan Kuykendall\nThe United States Congress\nHouse of Representatives\nWasnington, D, C, 20002\nDear Congressman Kuykendall:\nThere is presently before the Committee on Interstate and Foreign\nCommerce bill H.R. 6736 for action by the House on S. 1160, The\nPublic Broadcasting Act of 1967, passed by the Senate, You are\nperhaps aware of the efforts during the past five year3 to establish\na state wide system of educational television stations in Tennessee,\nsome of which are already on the air. There is a great deal yet to\nbe dona in this area alone.\nThere is presently under way a study toward establishing a state\nnetwork- of educational radio stations in Tennessee. This study is\nbeing conducted by the University of Tennessee under the sponsor¬\nship of various educational institutions from across the 3tate,\nrepresented in your area by iiemphis State University, and Christian\nBrothers College who is now attempting to construct such a station.\nRepresentatives of these and other educational institutions in\nTennessee met in Nashville in January of this year to initiate this\nstudy and informally organized themselves into the Tennessee\nEducational Broadcasters Association for the purpose of establishing\nthe Tennessee Educational Radio Network. The purpose of the study\niSj4° de^ena^n0 specific needs of the State for an educational\nradio network with recommendations for location in areas not now\nbeing served and programming to be presented. There is much work\nto oe done and much financial assistance will be needed.\nThe Rublic Broadcasting Act of 1967 will provide assistance in this\nproject. e urge you to make a special effort to see that your\ncommittee and the House take action on this bill in the present\nsession and that the needs of Tennessee are included in the final\nlegislation.\nYours sincerely.\nAlvin L. Bolt, Supervising\nAudio-Visual Librarian and\nMgr. of Radio Station WPLN\nALB/ab"
}