{
  "id": "d684-45",
  "text": "language which gives him an easy 1 out . A premise to consider\nthe whole thing seriously, when it comes up\", is the same as no\ncommitment at all.\n(l) If you decide to settle for a staff member, ask for^\n\"the person who is in charge of legislative matters\".\nIn the case of a Senator, this will usually be his\nLegislative Assistant. In a Congressman’s office it\nwill very likely be his Administrative Assistant.\nC. Next in order of importance is a telegram. If you decide to\nsend a wire, make it a long one; go into detail, state your\nposition and your request fully and clearly.\nD. The least effective contact is a letter — unless it is from a\npersonal friend of the Member, or a person he has reason to\nrespect. It is physically impossible for Members to read the\nmany hundreds of letters they receive each week. Their staffs\nsimply maintain running counts of the numbers received for or\nagainst any issue, and in many cases the letters are answered\nby means of form letters which are carefully designed to sound\nlike personal letters, but which are typed in large quantities on\nautomatic typewriters and even, in some cases, signed by automatic\nsigning machines.\nBut if you write a letter, do it right:\n(l) Write it in your own words. Members and their staffs\ncan quickly spot form letters.\n(2) Use the proper form of address\nTo address a Senator:\nThe Honorable John Smith\nUnited States Senate\nWashington, D. C. 20510\nDear Senator Smith:\nTo address a Congressman:\nThe Honorable James Roe\nU. S. House of Representatives\nWashington, D. C. 20515\nDear Mr. Roe:\n(3) Members must deal with a multitude of different pieces\nlegislation in many different fields, so be specific —\nin the first paragraph of your letter, refer to the bill\nnumber and its general subject. The only exception here\nis in connection with an appropriations bill; it is en¬\ntirely adequate, in that case, to refer to \"the appropri¬\nation for Title III of the National Defense Education Act,\nwhich is a part of the Labor-HEW Appropriations Bill\".\n(4) The most influential men on any given matter are the members\nof the subcommittee to which-that particular matter is assigned.\nNDEA appropriations, for example, are assigned with all other\neducational appropriations to the Labor-HEW Appropriations\nSubcommittees, which are a part of the House and Senate\nAppropriations Committees. Lists of both of these committees\nare attached.\nU733-1"
}