{
  "id": "d684-50",
  "text": "June 30, 1967\nNAEB Position Regarding H.R. 6736\nName of Bill\nThe words \"Public Broadcasting Act\" are more appropriate and\naccurate because radio, as well as TV and other media are included\nin the Act.\nTitle I\n1. The Facilities Act has been a success to date, and its\nextension by means of this title is desirable and necessary.\n2. We support:\na. the additional dollars proposed - $10 1/2 million for\nthis next fiscal year - are badly needed.\nb. the five year extension period.\nc. lifting the per-state ceilings according to the pro¬\nposed formula as both equitable and responsive to state’s\nneeds.\nd. the inclusion of educational radio as a necessary\nmeans to achieve a full national educational broadcasting\nservice.\ne. the proposed federal-local formula which allows a\ngreater share of federal support for new stations.\nf. the addition of Guam, the Virgin Islands, Samoa and\nthe Trust Territory of the Pacific Islands to the pro¬\nvisions of this title.\ng. the addition of planning dollars good and necessary.\n3. We note, in further support of this title, that although\nmiscellaneous small grants have been made by various federal agencies\nfor TV equipment in the past, only the ETV Facilities Act has provided\nfunds for broadcast equipment for use in behalf of the general public,\nand no federal funds have ever been granted for educational radio\nfacilities.\nTitle II\n1. We concur with the general aims of the establishment of a\nCorporation for Public Television (Broadcasting) and we believe that\nCongress acts in the public interest to establish it.\n2. We strongly agree that the Corporation must be free from\ngovernmental interference in carrying out its activities.\n3. We believe the Corporation as a single, strong entity is\nessential to make efficient and mutually productive efforts in be¬\nhalf of the several hundred educational radio and TV stations and\ntheir regional and national networks and program services. We be¬\nlieve the Corporation is essential also in terms of satisfactory\naccountability of its educational broadcasting activities to the\nCongress."
}