{
  "id": "d684-6",
  "text": "May 22, 1967\nDr. ifcul B. Kannoweki\nSmithsonian Tropical Besearch Institute\nP. 0. Boat 2072\nBalboa, Canal Z one\nDear ifeul:\nThis is to thank you very imich indeed for writing to\nSenator Burdick and Representative Andrew* in behalf of S.1160.\nlast Wednesday, it passed the Senate by voice vote and is now\nentitled, •The Public Broadcasting Act of 1967.\" So the drive\nto gain Senate approval of inclusion of radio plus reconciliation\nof title with content has succeeded on one side of the Hill.\nNow, on to the House of Beoreeentatives. No date has\nbeen announced as yet, but it is expected that full Committee\nhearings, chaired by Representative Harley Staggers (W. Ta.)\nmay begin about the end of May.\nProbably, Senator Burdick sent a cony of his testimony\nbefore the subcommittee to you. I'm sure that your letter helped\ngreatly to encourage his voicing sun port of the bill. Whether you\nhave received copies of the version passed by the Senate X don't\nknow; if not, it may interest you to *mow that:\n1. Title 21 of S.1160 suggests a Corporation for Public Broadcasting.\n2. Title ill calls for a broad study of instructional TV and radio and\nalso encompasses ducational Communication System (ECS) types of concerns.\n3. The Bill recommends that the President choose nine members of the\nCorporation Board with the remaining six to be chosen by those nine.\n4. The ultimate responsibility for interconnection of educational\nstations would rest with the CorDorati on, but the Corporation would\nhave the option of setting up an advisory group and/or have contrac¬\ntual rrangements, as appropriate, with outside agencies, program\nsuppliers, networks, etc.\nThe process of approaching the Senate is now being repeated\nIn regard to the House. I don't think I have ever had so much mil\nand individual correspondence staring me in the face over so long a\nperiod and am not sure whether the prospect of more to come Is exactly\ninviting, but Excelsior! Many thanks for your help, ftaul. It's for\nU.NJ).; I'm Just an agent.\nSincerely,\nMyron M. Curry, Director\nKFJM & GCTV"
}