{
  "id": "d684-76",
  "text": "U.S. DEPARTMENT OF\nHEALTH, EDUCATION, AND WELFARE\nFACT SHEET: Educational Television\nBackground and Need\nThe concept of educational television and educational radio broad¬\ncasting has not met the promise forecast for it at the beginning of\nthe television age» ETV has been chronically under financed; personnel\nshortages exist in both educational TV and educational radio; UHF-TV\nchannels have developed rather slowly in an industry generally character¬\nized by existing changes and rapid growth; and, finally, the function\nand quality of educational television itself and the range of the\nareas it covers vary widely from State to State,,\nThe legislation authorizing support for Educational Television Broad¬\ncasting Facilities (Public Law 87-447) amended Title III of the\nCommunications Act of 19 34„ This amendment provided grants for\nfacilities and was designed to enable educational television to reach\na broad range of people within each station's service area. With the\nassistance provided by the existing $32 million authorization, a total\nof 165 to 185 stations will be in operation or completing construction\nwhen the present term of the Act expires on June 30, 19670\nTo allow minimum service of one ETV signal in all parts of the United\nStates and two ETV signals in 40 major population centers, the Federal\nCommunications Commission has reserved 632 channels for educational\nuse. In authorizing the original legislation, Congress, in its\nConference Report on Educational Television, called for \"and adequate\ntelevision system to serve the needs of all the people in the United\nStateso\" To fulfill this task, the original legislation must be\nincreased and additional incentives for continued growth and training\nof personnel should be enectedo In addition, some stimulus for program\ninnovation is necessary to improve the whole concept of educational\ntelevision,.\nIn his State of the Union Message, President Johnson declared that\neducational television should be developed as a \"vital national\nresource\". The recently issued Carnegie Commission Report, Public\nTelevision. A Program for Action, recommended \"new legislation to\nenable the Department of Health, Education, and Welfare to provide\nadequate facilities for stations now in existence, to assist in\nincreasing the number of stations to achieve nationwide coverage, to\nhelp support the basic operations of all stations, and to enlarge the\nsupport of instructional television programming.\"\nBy December 31, 1966, a total of 124 public Educational Television\nStations were operating in the United States, a sharp increase since\n1956 when, ten years before, 21 stations were in operation. The\nCarnegie Commission Report said that the past decade has seen a system\nof educational television come into being that now includes nearly two-\nthirds of the population, a national program service, patches of inter¬\nconnection, and a corps of dedicated men and women. The new legis¬\nlation will build on this foundation,,"
}