{
  "id": "d684-78",
  "text": "DEMOCRATS\nHARLEU 0. STAGGERS (Chairman) f West Virgiami\nFavorable to bill. Tends to ask a few standard questions\nimmediately following witness' formal presentation:\n''Should Corporation make programs available to commercial\nstations\".\"to foreign broadcast entities?\" \"Will\na strong PTV Corp be a theeat to commercial broadcasting?\"\nTORBERT MACDONALD (Chairman of Subcommittee on Communications and Power) Mass.\nJOHN JARMAN\nLikely to query on almost any aspect of the debate, with\nspecial emphasis on future financing, threat of competition\nto commercial tv, nature of programming, daKixahxixfcydifferences between\nFord Foundation plan (which he sees as emphasising\nsimultaneous networking) over Carnegie plan (w&th emphasis\non local stations and distribution). Answers should be\nclear, simple and direct. Confuses easily. Does not\nunderstand how ETV works.\nOklahoma\nFriendly. Has seldom been present wince first day or so.\nQuestions have emphasized availability and desttability of\nprivate financing in in Corp's financial mix.\nSAMUEL FRIEDEL (J&C****^ Md.\nSeldom present after opening of session. Friendly. Has\nintroduced companion bill to 6736 (identical). Has asked\nvirtually no questions.\nJOHN E. MOSS\nCalif.)\n/\nHas been out of country. Returned to Comm sessions for first\ntime Tuesday 18th . Expected to be leader for the bill.\nHas great authority with committee members. His questions\nhave as yet shown no real pattern, but they will be searching\nand pointed.\nJOHN DINGELL\nPAUL RODGERS\nO-XQ. <\nMich\nSe ldom present. ^Egyuiabl^.\nFlorid a\nConservative. Concerned about protection of smaller states\nwith respect to receipt of fair share of funds. Also\nfeels that grant aatixpxHgxaMxa authority and networking\nauthority whould be separate. Position on bill: questionable.\nHORACE KORNEGAY N Q\nMost questions in areas of financing, and of nechanics of\nnetworking & distribution. Good questioner, understands\nterminology. Moderately friendly. Precise answers required."
}