{
  "id": "d684-8",
  "text": ":.\\K''Vs V/ •W'vM''\n•::nj day by The New York Timm Company\n;»LVH S. ociis,Publisher 18SC-: >■'■■>\n• iL U. DRYFOOS, Publisher 19C. 1\nfrom the\ncans thus\n>d chance\nxtremists\nmSucuuo’nal solution\no accKing a violent: one,\nCo-Ahead for Public TV\nPresident Johnson’s excellent proposal for a quasi¬\npublic corporation to spark the development of non¬\ncommercial television has cleared its first hurdle with\nits approval by the Senate Commerce Committee. If\nprogress through the full Senate and the House is\nswift, as it should be, the new body can begin address¬\ning itself this year to the basic issues on which depend\nthe future of public television.\nNeither the President’s bill nor the trail-blazing\nreports of the Ford Foundation and the Carnegie Com¬\nmission on Educational Television grapple in any\nspecific terms with the ways by which educational\nTV can achieve its maximum capacities as a medium\nof information, entertainment and cultural enrichment.\nSpokesmen for all the commercial networks have\nmade clear their conviction that a strong public TV\nsystem will not only be valuable in itself but also as\na goad to higher standards in the established branches\nof television. Guidelines for the attainment of full\npublic dividends in that direction will be required.\n- A major need, of course, is to insure that education¬\nal TV will provide broader dimensions in the coverage\nof news—local, national and global—and in the signif¬\nicance of the news. The Ford Foundation plans to\n\"conduct an experimental laboratory to this end next\n•winter on ore than 100 interconnected noncommer¬\ncial stations.\nBut this experiment will still leave many unan¬\nswered questions, especially in such areas as the rela¬\ntive stress to be put on development of community-\n• oriented stations and on building up creativity in a\ncentralized network command. Most important of all\n| .'will be the drafting of recommendations for the - resi-\n| dent and Congress as to sources for the substantial\n1 'public contribution that will be needed to insure the\n'^vitality of the entire enterprise.\nCreation of the new Corporation for Public Televi¬\nsion will not solve any of these problems, but it will\nprovide the instrumentality out of which considered\nsolutions can come."
}