{
  "id": "d684-80",
  "text": "fc£POOMCVW.S •.\nWILLIAM SPRINGER Illinois\nSenior republican. Well prepared and articulate. Greatly\nconcerned with make up of the Corp Board -- his has been the\ncontinuing campaign aimed at bi-partisan membership. Also\nconcerned about unintentional editorializing by Corp.\nEnthusiastic about ETV, but not necessarily about bill.\nSAMUEL DEVINE\nOhio\nFollows Springer's lead. May questions on Board makeup,\ncompetition, future funding, any question regularly raised\non the Republican side of the aisle.\nANCHER NELSEN Minn\nReputed arch-coneervative, but could be swayed. Seldom\npresent, but concerned about standard questions: control,\ncosts, type of programming.\nHASTINGS KEITH Mass.\nSupposed qa-liriendly. Standard question areas, but is now\nemphasizing editorializing, makeup of board, and continuing\ncosts. Is a seemingly-friendly, \"trap\" type questioner.\nGLENN CUNNINGHAM Neb\nIntroduced companion bill. No questions yet.\nJAMES T. BROYHILL N. C.\nNot friendly. Standard Republican question line. Has said\nhe will not support any bill giving monies to Corp for which\nit has no direct accountability.\nJAMES HARVEY Michigan\nHas consistently queried about future financing sources for\nCorporation -- feels bill, without proposal for future\nincome, is premature. Had been supposed moderately friendly,\nnow questionable. Articulate and concerned, freuquently presetiti.\nTIM LEE CARTER Kentucky\nGenerally supports the bill (outspokenly so in early days\nof hearing) but is principally interested in its instructional\npurposes.\nXXXXXXXKXXXHXX ROBERT G. WATKENS XXXKX Penn.\nAlthough stating he thinks bill is worthwhile, in his only\nextended statement made an outspoken statement that this is\nnot the time t?o pass it, with all the other demands on fehs Govt\nmoney.\nALBERT WATSON s> c\nHas suggested giving money to State systems instead of creating\nCorporation which could become another government-created \"monstrosoty\".\nVery proud of South Carolina system; has been told, but doesn't\nrealize, that SC is one of very few complete statewide systems."
}