{
  "id": "d684-82",
  "text": "EDUCATIONAL TELEVISION STATIONS\nA division of\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nPHONE: 667-6000 • 1346 CONNECTICUT AVENUE • WASHINGTON, D.C. 20036\nNOTES REGARDING S. 1160\nPrepared by\nC, Marquis and H„ Riddleberger\nTitle I\nSec. 101. We applaud the 10 1/2 million new dollars and the extension of time for\neducational broadcasting. This is far short of the need but it is a good\nfirst step and we don't seek to expand it before this year. (References:\nETS's survey of future dollar needs - now at about $20 million from 37\nstations plus U. S. O. E„ ‘s figures on existing applications which can¬\nnot be funded because of no dollars , Also reference ETS Model which\nmust be attached and the comparison with the Carnegie Model as an\nattachment. )\nSec. 102. The 12 1/2% limit seems reasonable*. We applaud this removal of an\notherwise great restriction on expansion of ETV. We assume, of\ncourse, that the 12 1/2% is of those dollars requested for Title I only.\nSec. 103. We applaud the inclusion of educational radio. (Reference materials\nsent to Undersecretary Wilbur Cohenin 1965 and to the Senate in 1966\nin which ETS went on record recommending that radio be included.)\nSec. 104. This changes the matching formula to 75/25 across the board with no\ncredit for equipment but no limit on interconnection. We support.\n(This is consistent with our recommendations of 1965 and 1966 where\nwe noted that the matching formula had successfully generated many\nlocal dollars for each federal dollar spent. )\nSec, 105. We approve the inclusion of the territories.\nSec. 106. Adds planning dollars for the acquisition of equipment. This inherently\nlimits the planning to those applying for facilities. It may well be that\nwe should seek to allow planning for agencies other than the ultimate\nowners of the facilities, such as State ETV Authorities which them¬\nselves would not be the licensees but might do the initial planning. V/e\nmight also want to consider whether there should be a limit on the\nplanning dollars such that $200, 000 could go for planning for $50, 000\nof equipment. We might also want to recommend that prospective\nlicensees be parties to the planning.\nIn general we must support, the success of the ETV Facilities Act which\nTitle I is the extension of. This must be done in audience comparisons (Bystron\nmay be analyzing as well),on expanded instructional uses (NCSCT-Cohen paper), and"
}