{
  "id": "d953-99",
  "text": "THE UNIVERSITY OF NORTH CAROLINA\nUniversity Extension Division\nCHAPEL HILL\nOctober 7, 1952\nMr. C2*aydon Aubidlus, Director\nRadio Broadcasting Services\nManager, WUOA (FM)\nExtension Division\nUniversity, Alabama\nDear Mr. Ansmus:\nThe contents of your letter were quite a surprise. I had no idea that Earl Wynn\nwas interested in another position and I’m quite sure the University would regret\nto have him leave. Consequently, I shall keep the news confidential.\nAs you probably know. Radio started as an activity of the Extension Division.\nDr. Ralph W. McDonald, now President of Bowling Green State University, Ohio, was\nAssociate Director in charge of radio and public forum activities. Mr. Wynn who\nat that time (1939-^2) was connected with the Department of Dramatic Art, served as\nour part-time director of radio programs. He did a very satisfactory production job\nand helped arrange a series of programs by the Carolina Playmakers that was broadcast\nover a national network. After the war, he returned with many new ideas about the\nwhole field of communication. Largely through his efforts, the Department of Radio\nwas established and in September 19^5 the Communication Center of the Consolidated\nUniversity of North Carolina was approved by the Board of Trustees. My Wynn was\nappointed Chairman of the Department, Professor of Radio and Communication, and\nDirector of the Center.\nMy evaluation of Mr. Wynn is based upon contacts with him as Director of the Division,\nChairman of the Communication Committee of the faculty and as Chairman of the\nAdvisory Board of the Communication Center. The budget of the Center is listed\nseparately under the Extension section of the University’s budget and the Center is\nconsidered one of the cooperative services of the Division. I have found him to be\na man of ideas, tact, and initiative. He has many friends throughout the country\nand has been invited to serve on impesfcant national committees interested in educational\nbroadcasting. He has developed excellent working relationships with the N. C. Associa¬\ntion of Broadcasters which co-sponsors the annual N. C. High School Radio Institute,\nin cooperation with the Extension Division.\nTo be perfectly frank, as you requested, I must report that two or three personnel\nproblems have arisen during Mr. Wynn's administration. They involed questions of\nacademic tenure as well as professional efficiency. I believe he has learned a lesson\nthe hard way and that from now on he will be more careful both in the selection,\nassignment, and treatment of staff members. In my judgment, most of the difficulties\nwere those of adjustment peculiar to a University organization. The staff of approxi¬\nmately twenty persons is now working together very smoothly, effectively, and with v\nexcellent morale. I believe that most of these problems may be charged up to the\nfact he has been building new agencies within the framework of a State University"
}