{
  "id": "d82-22",
  "text": "MEMO:\nTO : NAEB Utilization Project Advisory Committee\nCopy : Gertrude Broderick\nJames Fellows\nFROM : Clair R. Tettemer - Project Director\nEnclosed is a copy of the treatment for Kit No. 2. We have received some very\nconstructive suggestions on the treatment for Kit No. 1 and plan to incorporate them\nand forward them to you as soon as we hear from all of the members. We would also\nlike to receive any comments or suggestions you might have on the treatment for Kit\nNo. 2.\nI should be able to let you know very soon if any additional money will be made\navailable from the U. S. Office. It is still my hope that at least Kit No. 1 will be\ndone by October 1 and possibly Kit No. 2.\nIn talking with Marye last evening she assured me that the other four treatments\nwill be completed by July 29. Keeping this in mind we can still hold our next meeting\nin August as previously planned. There are a few things still to be checked but tenta¬\ntively either the 16th and 17th or the 23rd and 24th of August. If either of these are\nnot all right will you please let me know.\nAs of August 1 I will no longer be a member of the KTCA-TV staff. I have\naccepted the position of General Manager at Channel 13 in Fargo, North Dakota.\nThis will only effect the project in that the operation will now be handled out of\nFargo. Due to the fact that Channel 13 will not be in complete operation for awhile\nI have asked Dee to carry on in her position as Assistant Director for the next few\nmonths. She will handle the correspondence and see that you receive the rest of\nthe treatments. I do not feel it would be possible at this time to bring another person\ninto the project,, Dee will also be leaving KTCA-TV and any further correspondence\nwill be sent from, and should be directed to, her home at 6105 Woody Lane, Minnea¬\npolis 21, Minnesota. My address after July 10, 1963 will be: North Central Educa¬\ntional Television Association, Box 6, Fargo, North Dakota."
}