{
  "id": "d82-27",
  "text": "16\nscrip* of Mch kit. TKm* draffs will fhen he (wltwtd and approved. Fol¬\nlowing this review and approval, the Ndttonol Aeroelatlon of Educational\nBroadcaster* will lot subcontracts to appropriate educational television pro¬\nduction organizations to prepare the final scripts and to produce the kit ma¬\nterials, subsequent to approval of said subcontracts by the Associate Com¬\nmissioner far Educational Research and Development. The completed kits\nwill be reviewed, and when approved, they will bo duplicated, making six\ncopies of each, with one of each to be deposited with the Office of Education.\nTo accomplish review and approval of the scripts and kit materials, a com¬\nmittee of specialists will be selected, and, after approval of the membership\nby the Office of Education, will be appointed to assist the project director\nin determining the content and method of presentation of oaoh kit and to\nassist In the selection of subcontractors to be responsible far production of\nindividual kits. The membership of this committee will consist of flvo major\nspecialists from such areas as teacher training, curriculum planning, and\ncommunication*. A representative from the Office of Education will bo\ninvited to tit with this committee. It It anticipated that the committee will\nhold three meetings during the term of the project.\nStep 2. following the production of the kits, they will be depot I ted In a\nlibrary to be operated by the National Association of Educational Broadcaster*.\nThe service will be promoted through articles In educational publications,\npresentations and demonstrations at national and regional meetings of educa¬\ntional groups, and through direct mall announcement* to educational televi¬\nsion, audiovisual, end curriculum personnel.\nA nominal charge, not to exceed $10, will be mode to cover postage, hand¬\nling, and replacements. This charge will depend upon the character and\namount of supplemental material Included In the kit. The National Associ¬\nation of Educational Broadcaster* will continue to make the kilt available\nafter the project l* concluded.\nStop 3. The project committee will bo responsible for evaluation of the\nreported uses and effectiveness of the kit*. Each kit user wilt bo caked to\ncomplete and return a detailed evaluation fam giving reactions end comment*\nabout the material.\nPlan of Operation\nSubsequent to review end approval by the Office of Education, the Notional\nAssociation of Educational Broadcastan will appoint to the prefect committee\nthe five specialists designated under fascoAwe, above."
}