{
  "id": "d82-77",
  "text": "APPENDIX F (seven)\nIt Is my understanding that the National Association\nof Educational Broadcasters are Interested In producing a\nDemonstration Kit for teachers' and classroom utilization of\nInstructional TV.\nWhat a God-sendI\nHad we had such a kit, our problems of not only utili¬\nzation, but of school district orientation would have been\nmet almost immediately at the outset of our beginning broadcasts\nfor schools on KVIE, Furthermore, it would have been a tre¬\nmendous saving in man-hours for the work we did, and repeated,\nfor many Individual districts in our fourteen-county area.\nIn spite of these past two and a half years on the air,\nsome of our larger districts are still dragging their feet in\nutilization of, and finances for the ITV service,\nA Demonstration Kit would benefit the teacher and pupils\nnot only In utilization, but alert administrators and Boards\nof Trustees to the possibilities of ITV more effectively than\nis possible at the present time.\nThis \"LEARN B¥ SEEING HOW IT WORKS\", could be the answer\nto the questions that so many ask: \"How do we use TV?\", \"Will\nit take the place of the teacher?\", \"Why can't films do the\njob?\" - and many others,\nInstructional Television, our marvelous new tool for\nlearning, has the same need In common with textbook publishers,\nfilm producers, manufacturers of business machines, automobiles,\nand countless other producers, that of &EM0NSTRAT80N MATERIAL,\nMrs, Muriel A, Keffer, Director Curriculum, A/V, TV, and\nSpecial Services, Amador County, Jackson, California\nLetter - June I4, 1961\nis is is *\nDemonstration Materials as proposed would make a marked\ncontribution to the utilization of both radio and television\nIn the classroom. It would, I feel, contribute a great deal\nto the \"average\" teacher which could result In the Improvement\nof teaching. For the imaginative teacher, the demonstratIon\ncould serve as a spark to kindle additional approaches to a\nsubject area."
}