{
  "id": "d1297-2",
  "text": "r\nGUESTITORIAL\nPROGRAMS AND YOUR AUDIENCE\nHere is where I get out on a limbi\nI know a Freshman in any organization should keep his mouth shut, turn out his\ntoes and learn from his betters, but Freshmen never do. This would seem to be an\nopportunity for me to speak my ipind, and I am going to do just that. You old-timers\nin\"the field of educational broadcasting have the right to slap me down.\nEducational broadcasting has got to grow up. At the present moment it is in\nthe doldrums, being a victim of budgetitis and a strange malady caused by lack of\nimagination, lack of vision, lack of courage.\nRadio is an expensive gal, and it seems to me that most educational insti¬\ntutions are trying to make an honest woman of her on a departmental budget that is\nentirely inadequate. I don't know where the money is going to come from, but I do\nknow that we must find it, in order to do a thoroughly adequate and competent job.\nEducational radio, it seems to me, instead of blazing new trails has been\nall too content to follov/ the program-pattern set by commercial radio in this\ncountry. All too many educational stations seek to be all things to all men and\nhave lost themselves in the welter of programming calculated to compete with the\ncommercial station set-up.\nTo my way of thinking, this is utter nonsense. A university station can not\nand should not compete with a local coiTimercial station for the constant attention\nof every man Jack and lady Jill in the community, 10, 12, 14- hours a day. A\nuniversity in the modern world is a community of scholars who are also free men\ndevoted to widening the horizons of our intellectual and cultural world and dis¬\nseminating knowledge as they discover it to be true. Just as they once learned\nto use the printing press as an invaluable tool in their v/ork, they must nov/ learn\nto use this new tool which modern science and technology has placed in their hands\nradio. They must bo made to realizo that educational broadcasting is an art in\nitself and is not a mere duplication of classroom or lecture hall presentation.\nThose of us who are actively concerned with the future of educational broad¬\ncasting, must, first of all educate the professors and the scholars in the\nrealities as well as the obligations and opportunities of this new tool.\nThat is one thing that is wrong with educational broadcasting today.\nf'nother thing that is wrong with it, is that all too often v/e do not know our\naudience. As near as I can find out, very little active research has been done in\nthe educational radio field to determine audience-nseds and audience-response.\nCommercial broadcasters work day-in and day-out on this. To be sure they have a\nsimpler problem and they measure their achievement in terms of mass appeal and\nmass response. The educational broadcaster is not so much concerned with mass\nappeal as he is with the appeal to those key persons in every community who speak\nhis language and who will, therefore, understand what he is saying and what he is\ntrying to do. To seek them out is his duty.\nV/hat I am pleading for is specialized broadcasting rather than mass broad¬\ncasting as the proper field for development by educational institutions which are\ntrying to reach out beyond the walls of their classrooms and to touch the lives\nand thoughts of persons far; away.\n-Russell B. Potter, Columbia University\nNext month's Guestitorialists R. J. Coleman, Michigan State College"
}