{
  "id": "d191-40",
  "text": "-4-\nDuring 1952-53, the NAEB sponsored a seminar for Public School Broadcasters, and\nin 1953-54 a Seminar for Writers of In-School Programs. During the last three years,\nthe NAEB also has increased liaison with broadcasting systems of foreign countries\nand with other educational organizations in the United States. It also has\nadministered three series of Grants-in-Aid, which have produced broadcast broadcast\nseries, both radio and television, which have further enhanced the prestige of the\nNetwork and the NAEB in general.\nDuring 1953-54 particularly, the NAEB established publication exchanges with\nforeign broadcasting systems and other educational organizations which spread the\nname and respect of the NAEB around the world. 1953-54 also saw the establishment,\nat NAEB Headquarters, of a central Educational TV and Radio Placement Service for\nthe United States, a Station Management Consultation Service, and a new-full-time\nEngineering Service. The NAEB also coordinated the selection and missions of the\nthree Fulbright scholars in radio and TV whom America has sent to Europe.\nAs this is written the membership of the NAEB has increased to 235 members.\nDuring 1953-54 four of its finest engineering committee reports, six Television\nOperation Committee Reports, and the first of a series of Research Committee Reports\nwere published. In addition to the reports mentioned above, the results of these\nand other committee meetings were a revised constitution, more programs auditioned\nby the In-School Program and the Network Acceptance Committees, increased exchange\nof foreign programs through the International Relations Committee, over 30,000 lines\nof publicity in newspapers and trade magazines, and the processing of nearly 200\napplications for the 120 NAEB Scholarships and Workshop and Seminar Fellowships, in\nboth television and radio, which are being granted during the 12-month period from\nOctober 1953 to October 1954.\n#***£***«#*\nConsidering the NAEB Radio Network alone, during the 1953-54 period the Network\ndistributed 28,000 hours of programming to its member stations. This is an increase\nof 27% over the 1952-53 output and an increase of 115% over the 1951-52 output.\nOver the three-year period of its existence, the Network has distributed over\n50,000 hours of programming. Network service includes programs to a general audience\nand a special category of programs designed especially for listening in the classroom,\nThese thousands of hours of programs have been distributed to a membership of\n83 stations. Last year Network membership reached 85 stations, but when the assess¬\nment fee was increased the number of stations dropped to 78. Since that time the\nnumber of network stations has slowly increased to the present membership of 83, as\nmore educational stations have gone on the air. According to the recently completed\nstudy of the NAEB Research Committee, showing a coverage of eighty million,the NAEB\nnow reaches half of the population of the United States, plus parts of Mexico and\nCanada, with these program services.\nIn 1952 we were distributing 6 hours and 45 minutes of programming per week to\n65 stations. We are now servicing 83 stations with 7 hours and 15 minutes weekly.\nThis means that approximately 1,000 tapes per week are sent out from NAEB Network\nHeadquarters. In peak periods during the past year, over 1,200 tapes a week were\nsometimes mailed. (This has of course greatly increased mailing expenses and this\nsituation has been intensified by an increase in postal rates for Zones 4 and beyond,\nin which 2/3 of the NAEB member stations are located.)"
}