{
  "id": "d191-46",
  "text": "NABS NETWORK REPORT\nCtetober* 1934\nProperly speakings, mush of any annua] report on the NAEB Network must come from\nthose ©orandtteea whose work directly relates to it* Much of the credit for the Net¬\nwork operation must also go to those committees, for the principal teak of the Network\nHeadquarters personnel is simply to coordinate and distribute in tbs- best possible\nmanner the programs and series selected by certain of the committees and to act on\nthe good advte?© of the others\nBetween th® 1953 and the 1954 Conventions the Network Manager has met at least once\nwith each of three committees * the Network Acceptance Remittee 9 the In-School Program.\nCommittee* and the In^Schoo! Program Subcommittee, He will have at least one or two more\nsuch meetings at the 1954 Convention* In the course of these meetings and of ©orres*\npondstree* not every problem which might arise was solved,, of course; but more workable\nrelationships and procedures were developed,, and* Network Headquarters believes*, a common\nunderstanding of the problems involved in our mutual interests arrived at*\nSince the last convention* th® Network Headquarters has received—up to th® time\nof this writing—from various organisations including member stations, member produc¬\ntion units, and. various outside agencies-*—24 suboXsaioa# for the In-S©hool Program\nCommittee and 108 submissions for the Network Acceptance Committee* Th© audition\ntapes accompanying these submissions were duplicated and copies sent,, together with\nforma and/or other information* to th© proper committee members• Headquarters also\nconducted a survey on in-school program preferences for the In-School Program Committee\ntte would also like to mention several other committees the work of which more\ndirectly than moat affects the Network operation* The International Relations\nCommittee has throughout the year placed a number of fine series in th© Headquarters\noffice in plenty of time for their scheduled diattributiono At the request of Network\nHeadquarters* the Engineering Committee has issued s bulletin designed to help raise\nthe quality of the master tapes of Network programs and has Investigated th© properties\nof various brands of recording tape with a view to their possible us® in the Network\noperation* Fortunately* the chairman of tb© Radio Planning Committee has been\nreadily at hand when his advice was needed* and several matters in his area were turned\nover to his committee,. And perhaps we need not add that nothing of any critical\nsignificance has been don© without due consultation with the Executive and/or Associate\nDirectors of the Association*\nTh© general emphasis of the Network Headquarters operation has during this past\nyear undergone considerable change. Less weight is put on the fflmass operation*1\naspect of th© project and more on \"personal service,,w Headquarters work assignments\nhave been rearranged and more man-hours are aXioted to individual problems and to\nthe paper work and organizational work thus engendered» In th® future* we hope to\nIncrease this \"personal service® emphasis still further,,\nThis change in organisation and advance in operation is made possible largely\nby th© acquisition of a second mass duplicator and also* at no cost to the NAEB*\nof some seventy disk cabinets* The Headquarters office space remains overly crowded\nand the Network still uses only four and a half to five workers* but the new eouio-\nmeat gives us far greater flexibility."
}