{
  "id": "d191-71",
  "text": "*\nXn order to alleviate the work-load,, we attempted for a period to place the\nresponsibility for the quality of miter tapes on contributing organisations whenever\npossible-, but this did not work wall* and,-, once again., we arr auditioning all master\ntapes tefore duplication* Happily* th© second duplicator acquired by the Network makes\navailable the worktime necessary for such auditioning.\nThe duplicators themselves deserve a few words.,, since they are a key factor in\nour operation. They are in a better condition than was th© old machine at th# time of\nthe last convention. The old machine has been rebuilt* and both duplicators have been\nfairly reliable throughout the year, although,, as we have said before,, they do not lack a\nmeasure of temperament„ During th© past few weeks wa have had soma difficulty,, apparently\ndue to changes in temperature and humidity* but this trouble seems to be ironing out\nThe Natwork Headquarters has always been somewhat handicapped by not having its\nown engineer readily available. Radio. Station WILL always has been and continues to\nfes most helpful in this area,, but of course its engineers have their prime duties\nelsewhere e Fortunately, Mr Cecil Bidlack,, the NAEB Television Engineer* is now often\nat the Headquarters office* and he has kindly volunteered to give the Network Head¬\nquarters the benefit, of his electronic experience when not engaged in his primary\nresponsibilities as TV engineer»\nThe process of scheduling and offering program* to our member stations now takes\nplace at an earlier date* and stations know three months in advance what will be available\nto them from the Network, We hope in the future to make this information available as\nmuch as six months in advance a\nThe use of submission forms by contributors ha© greatly increased since last year*\nthough it is still far from universal* and sometimes their use is far from complete\nOccasionally Headquarters has assembled for the Network Acceptance Committee information\nwhich was not included with the forms. We continue to promote the use of these forms,\nany number of which are available to members at any time.\nThe NAEB Network has been in operation less than five years, It began when\nnineteen stations took turns playing mmn tapes. It now has a headquarters office\nwhich is always in the process of distributing twelve* fifteen* or more series directly\n£fn^iSAty~°ne mamt'8r' staUons Assessments for the three classes of stations are now\n$6QQ;, $375* and $225» respectively, .And for this payment .they may obtain recorded\nprograms* some of which cost hundreds or even thousands of dollars* for less then it\nusually costs to broadcast disk-recorded music.. Moreover* this project is now almost\nself-supporting, ie@s station supported.\nThough problems remain and new problems shall arise,, th* practicality of network\nuse of tape has been proven. Major commercial networks are now considering how they\ncan best utilise tape. In this area* as in others* the NAEB has led the way, But the\norganisation has by no means become static. It is constantly seeking and reaching for\nnew goals» For instance,, the Associate Members Committee has been studying the problem\nof how th© Network can broaden the scope of its operation in order to serve this\ncategory of members.\nIn conclusion* may we note once again that the NAEB Network is not an independent\norganisation* but an association, a function* a tool of th© educational broadcasters of\nAmerica, There are a number of individuals and organisations who deserve special credit"
}