{
  "id": "d191-99",
  "text": "Active and Associate Members\n-2-\nNovember 22, 1954\n1. Ampex Electric Corporation, 934 Charter Street, Redwood City, California.\nStandard Alignment Tape for 15 inches per second. Ampex Part No. 4494.\nPrices $12,00.\n2. Audio Devices, Inc., 444 Madison Avenue, New York 22, New York.\nAudio Head Aligning Tape. Type No. 200.\nPrice: $12.00\n\"Pre-recorded at 2,000, 10,000, and 15,000 cps. at 15\" per second, with precisely\ncorrect head azimuth alignment. Provides a convenient and highly accurate\nreference for aligning magnetic recording head. Three hundred feet on 5\" reel,\nindividually boxed, with instructions.11\n3. The Dubbings Co., Inc., 41-10 45th Street, Long Island City 4, New York.\n\"The only tape indicating: Wow and Flutter — Head Azimuth Alignment —\nFrequency Response — Signal to Noise Ratio — Signal Level — Tape Speed.\"\nD-110 Test Tape. 5\" reel, 7 l/2 inches per second. Price: $12.50.\n\"WOW AND FLUTTER_ 3,000 cps tone. HEAD AZIMUTH ALIGNMENT — 5,000 cps tone.\nFREQUENCY RESPONSE — 30 to 7,500 cps in 13 steps 30, 50, 100, 200, 400, 700,\n1 kc 2, 3, 4, 5, 6, 7,5 kc. Recorded with standard NAB characteristic for\n7 1/2 inches per second, SIGNAL TO NOISE RATIO — 400 cps tone, 15 to 50 db\nin 5 db steps with announcements, MAXIMUM SIGNAL LEVEL — zero level, 400 cps,\n3% total harmonic distortion. TAPE SPEED — timing beeps at 0, 5, and 10\nminutes. Detailed instruction book enclosed.\"\nD-lll Test Tape. 7\" reel, 15 inches per second. Price: $17.50.\n\"WOW AND FLUTTER _ 3,000 cps tone. HEAD AZIMUTH ALIGNMENT — 10,000 cps tone.\nFREQUENCY RESPONSE — 30 to 15,000 cps in 14 steps 30, 50, 100, 200, 400, 700,\n1 kc, 2, 4, 6, 8, 10, 12, 15 kc. Recorded with standard NAB characteristic\nfor 15 inches per second. SIGNAL TO NOISE RATIO — 400 cps tone, 15 to 50 db\nin 5 db steps with announcements. MAXIMUM SIGNAL LEVEL — zero level, 4D0 cps,\n3% total harmonic distortion. TAPE SPEED — timing beeps at 0, 5, and 10\nminutes. Detailed instruction book enclosed.\"\n4. L. S. Toogood Recording Company, 221 North LaSalle Street, Chicago, Illinois.\nL. S. Toogood Alignment Tape. Price: about $12.50.\n\"Magnetic head alignment tape is used for aligning the playback heads of\nmagnetic reproducers to allow the interchange of recorded programs. Recorded\nsignal is one millimeter in wave length which will reproduce as 7,500 cycles/\nsec. at 7.5 inches/sec. or 15,000 cycles/sec. at 15 inches/sec. The signal is\nrecorded vertically on the tape to a tolerance of 1 l/2 minutes of arc.\nAlignment tape is high level recording and good wave form and exact wave length\nare not necessarily maintained.1.’\nJRHswc"
}