{
  "id": "d645-1",
  "text": "- 2 -\nToday our schools and colleges face a crisis of appalling proportions in terms\nof deficits in dollars, teachers, classrooms and services. American progress and\neven our national survival is directly dependent on what we as a nation do now\nabout the shameful weaknesses and deficiencies of our educational system.\nWe must seize all means at hand to help education cope with these dire\nshortages and improve both the quality and quantity of educational opportunities\navailable to our citizens at all levels, both in and out of school.\nTelevision, a device which has the potential to teach more things to more\npeople in less time than anything yet devised, seems a providential instrument to\ncome to education’s aid. Educational television has already proved that it can be\na valuable supplement to formal education and a direct medium for non-formal\neducation.\nDespite the heroic efforts of people such as yourselves to establish educational\ntelevision stations across the country, only a small part of the total potential has\nbeen achieved. To date, only 50 of the 256 channels reserved for education have\nbeen activated and two-thirds of the population still has no access to educational\ntelevision service. This is not for lack of zeal or interest on the part of educators\nor state or local officials, but, primarily, for lack of funds for the initial capital\ninvestment required for construction of stations •\nSince education is a matter of national concern, the Federal Government should\nassist in expediting and accelerating the use of television, as a tested aid to educa¬\ntion in the schools and colleges of the nation and as a means of meeting the needs\nof adult education. A useful start has already been made in this direction by the\nGovernment through the National Defense Education Act; more should be done to\nassist the development of educational television for the benefit of all our people.\nI pledge you that I will back actively suitable legislation aimed at this objective\nin the next session of the Congress and will urge its support by my Democratic\ncolleagues.\nFinally, I should like to congratulate the National Association of Educational\nBroadcasters, for its distinguished accomplishments to date and wish it continued\nsuccess in seeking to project the electronic media into the full usefulness of which\nthey are capable in the service of American education and the welfare of our country.\nSincerely,\n(signed)\nJohn F. Kennedy"
}