{
  "id": "d645-112",
  "text": "KETC- CHAN L 9\nG996 MILLEROOK\nirr. Louis 3o, ...\n.‘torch 30, 1961\ntoltoRf Tcjvernor\nJefferson City, Ueeourl\n!toar Octet\nX in Infante that Open ffcrrls, Chaiimrt of the Boise Interstate te\nForeign Cowseros Connlttee, has contacted you to find out what piano\nMissouri has for activating educational television If federal financial\nreport lo f orlheonlag*\nk*yrmwy knot*, a bill haa been passed by the Senate which would pro*\nvide up to 13*000,000 for each state for the capital needs (ether than\nbuildings) of educational television, both open-oiroult and olosed-elrauli*\nHearings were hold last week by the Oubooteitee on Cn—nnloftione, of\nwhich Morgan Moulder la the Chaimsn, on alniler legislation that haa\nbeen introduced in the House of Reproseuta&ivee*\nMissouri haa four ohannela reserved for non-coBBercial educational tala*\nvlaloni XtPO - Ghatmel 9 In St# Ionia tech want on the air In 5 apt te nr\n19#*, Channel 19 In Kansas City which X understand started broadcasting\nthis week, Channel 36 in St* Joseph and Channel 26 In Springfield* 8a\nfar aa X know, there are no atatete.de plane* However, all of us who\nhave any Interest in and knowledge of educetional television and Its teds,\nwould agree that federal fends are alnost a necessity if steatlonsl tele¬\nvision is to develop fully Its possibilities for service to the state*\nKm, for etwwpls, should be able to Increase its power from 60,000 watts\nte the ******* of 316,000 authorised by the FCC* Vs also have urgent ate\nfur te put a s*Mte sates tee operation, a seete\nvideotape recorder, and nasy other lapcrtant pleoes of aqulpewnt# 3iat-\nlarly, the Ontersity of Klaeourl needs additional facilities whlofc fsderal\nfunds would tea possible for the more effective operation of its olooed*\ncircuit lastallstlon* The indie- tions are that fsdnrel funds are about\nthe only source we sac turn to if these vary substantial needs are to be\nnet*\niterd Utesrt of the University of Missouri, when yon tew. appeared be¬\nfore the Coatettee lest week speaking in favor of the legislation* tel*\nX did not testily si the hearings? W «n point of view is Perused te\nthe enclosed copy of a letter to Mbrsm Moulder#\nX hope that you will feel it possible for you ts give a definite te posi*\nlive response to Chateau Harris's inquiry* Ten ney oonsldnr It dssltels\nto get in tench with Jtr# T«abert and with tees Uaslett, ftoperintandent\nHonorable John R*\nState of Missouri"
}