{
  "id": "d645-117",
  "text": "HtiterjatJg xtf Arizona\nOFFICE OF THE PRESIDENT\nTUCSON 25, ARIZONA\nMarch 31, 19&\nBear Governor Fannin:\nTh» national Association of Motional Broadcasters has advised\nme that Representative Gren Barrie, casalraan of the Bouse\nInterstate and Foreign Commerce Committee, indicated a desire\nthat tbs Governor of each state submit to that Committee views\nregarding the state's interest in and plans for improving edu¬\ncational television facilities should federal support legis¬\nlation be passed in the current session of the Congress. I am\ninformed that there is a strong possibility that such legis¬\nlation will be passed.\nleading by television is becoming more and more established in\nvarious parte of the country, trough the educational television\nstations excellent instruction is being given. Mid educational\nendeavors of other kinds are being carried out very successfully*\nA bill before the Congress to provide one million dollars in\neach state to improve educational television facilities over the\nnext five years, if passed, will result in much progress here in\nArizona.\nfhe University of Arizona television Station, K0AT, has made a\nplace for itself daring the two years of its operation that far\nexceeds the expectation at the time the station was established.\nWe have taught a sunfcer of courses by television with very\nsatisfactory results* Since the station operates on the open\ncircuit basis, people throughout the cosaaunity have enjoyed the\nbenefits of these lectures in a variety of fields, including\nchemistry, anthropology, Spanish, government, and art. At\nthe same time we have had videotape recordings that give to\npeople within the range of KUA.T insights into many areas of\nknowledge.\nWb received virtually all of the money for the establishment of\nthe television station from outside sources, mainly the Ford\nFoundation. In the future as the instructional program by\ntelevision expands, it will be necessary to provide a new and\nmore powerful transmitter and additional studio facilities. In"
}