{
  "id": "d645-128",
  "text": "STATE\nMICHIGAN\nCOPY\nO F\nExecutive Office Lansing\nPROCLAMATION\nEDUCATIONAL BROADCASTING MONTH\nMichigan has always been in the forefront in education. Our schools,\ncolleges and universities educate and train our children and our\nyoung men and women in the sciences, the arts and the professions.\nBecause of our outstanding educational facilities and faculties,\nour people are one of our greatest assets.\nThe Constitution of the State of Michigan sets forth that ’’the means\nto education shall forever be encouraged.” This our people have done.\nOur institutions of learning have met the challenges of changing eras\nand have kept pace with world progress.\nEducation, like other facets of our society, has adapted itself to\nscientific advances. Michigan has pioneered in the application of\nbroadcast media to education since 1922 and today enjoys the advantages\nextended by nine radio and two television education stations. More\nare in the planning stage.\nNational recognition has been accorded our largest metropolitan area\nfor its classroom use of television from the early grades through\nthe college level. In addition, there are outstanding adult programs.\nMichigan»s educational television has shown repeatedly as a useful\nmethod of making quality instruction available to every school system\nand assuring superior utilization of overburdened instructional\nstaffs. Great credit has been reflected on Michigan!s educational\nsystem as programs have been loaned to school systems throughout\nthe nation.\nTHEREFORE, I, John B. Swainson, Governor of the State of Michigan,\ndo hereby proclaim April, 1961, as\nEDUCATIONAL BROADCASTING MONTH\nin Michigan, and urge all our people to give appropriate recognition\nto this phase of education and to encourage it as a means of providing\nthe fullest benefits to all.\nGiven under my hand and the Great\nSeal of the State of Michigan\nthis Thirteenth Day of March in\nthe Year of Our Lord One Thousand\nNine Hundred Sixty-one and of the\nCommonwealth One Hundred Twenty-five.\nSEAL\n/s/ John B. Swainson\nGOVERNOR\nBY THE GOVERNOR:\n/s/ James M. Hare_\nSECRETARY OF STATE"
}