{
  "id": "d645-136",
  "text": "Page 3\nNewsletter\ncreated non-profit educational corporation, Florida Central East Coast ETV, Inc.,\nformed by public school officials and civic leaders in Orange, Volusia, Brevard, Seminole\nand other counties in that fast-growing area, to petition the Federal Communications Com¬\nmission for a drop-in of a Channel 11 frequency near Orlando so that another ETV station\nmight be activated with local and State funds -- if the latter are made available. This is\none of several possible network extensions that the Florida ETV Commission is requesting.\nFOR THE STATE DEPARTMENT OF EDUCATION, State School Superintendent\nThomas D. Bailey appointed a committee (Chairman: Mr. James L. Graham, Director of\nAdministration and Finance, State Department of Education, Capitol, Tallahassee) to rec¬\nommend sound plans for assisting county school systems in financing the use of televised\ninstruction. This committee has been working for more than three months and is ex¬\npected to announce its recommendations soon.\nYOUR SUPERINTENDENT, SCHOOL BOARD MEMBERS, PRINCIPALS,\nTEACHERS AND PARENTS may wish to watch for announcement of these proposals\n(comment, suggestions and inquiries welcomed!) and discuss them with your\nLegislators before the session next April.\nFLORIDA ETV STATIONS, CHIEF OPERATING OFFICERS, AND THEIR ADDRESSES:\nChannel 2, WTHS, Miami\nMr. Clif Mitchell, Director of TV\nLindsey Hopkins Building\n1410 Northeast Second Avenue\nChannel 3, WEDU, Tampa-St. Petersburg\nTampa Studio:\nMr. LeRoy Lastinger, General Manager\n908 South 20th Street\nSt. Petersburg Studio:\nMrs. Aimee Erwin, General Manager\n6605 Fifth Avenue, North\nChannel 5, WUFT, Gainesville\nDr. Kenneth Christiansen, Director of TV\nWest Stadium\nChannel 7, WJCT, Jacksonville\nMr. Gregory Heimer, General Manager\nPost Office Box 4758\nChannel 11, WFSU-TV, Tallahassee\nMr. Roy Flynn, Director\nBroadcasting Services\nOwned and operated by Dade County\nBoard of Public Instruction\nOwned and operated by Florida West\nCoast Educational Television, Inc.,\na non-profit civic and educational\ncorporation on whose Board of\nDirectors are representatives of\nseven county school systems.\nOwned and operated by the State Board\nof Control and the University of Florida\nOwned and operated by Educational\nTelevision, Inc., - a non-profit civic and\neducational corporation; and by Duval\nCounty School Board.\nOwned jointly by the State Board of Control,\nFlorida Educational Television Commission\nand Florida State University which operates\nit.\nTheyfll be happy to have you visit them, and werll be happy for you to visit the\nFlorida ETV Commission Office, Room 112, Knott Building, Tallahassee, too!"
}