{
  "id": "d645-163",
  "text": "Jimm 9, 1961\nTWwvetn Tjedlrwor ia^lify\nBouse of Representatives\nWashington 25, B* C.\nBear tud:\n^eortt H.R* 932, 5099, 5336 mad Ribieoft\nMay 17 before louse Bubeorawlttee\nRlblcoff*s Testiaony\nf!fiiawnn4f*arHfiHit mwi PoUNSr\n—- -.■•SSBJJgyjEggg'E- «»\nIfrrwy note of thanks you get is probably the preface to another request for\nhelp—Just like this one! I'm enclosing copies of carrespoudanoe with the\nnational Association of Educational Broadcasters headquarters staff In\nWashington! ay letter of May Sk and Harold mil's latter of June 1.\nXou will note ay point! that the stations which hare not succeeded la getting\ninto operation would receive up to $125,000 in Hatching grants, and those\nnow in operation receive nothing—even though their equlpaant is substandard\nand ready tar the scrap heap.\nIhere are two faulty assumptions operative* 1., that being on broadcast is\nproof of adequate equipment and adequate funds for operation, and 2., that\nnot being in operation Is proof at financial inability to get into operation,\nneither assumption is necessarily true. What is true hare in Toledo, how¬\never, Is that we ere in operation with equlpaant that is sub-standard for\nbroadcast both because of its age and its make. We don't even hove high\ngrade baling wire to hold things together. And the damnable thing about it\nla that we do have the production talent and the trained broadcasters to do\n• bang-up J<*. Xf Harold BUI is right, that \"all matching funds would hove\nto be new funds\" with \"no credit...for aapeadltwes already made\"—and he's\nusually right—we are being penalised\nfor our iaventii\nend resourceful-\nSince tbs final legislation hasn’t been written, perhaps you would he able\nto re-shape It to our local Interests and to those at the Betlenel Association\nof Educational Broadcasters. The KttB'e Washington office la located in the\nDuPont Circle Office Building, 13**6 Connecticut Avenue, end Harold Bill,\nAdministrative Vice-President, or Will Isa Harley, president, would gladly\nfill you la with the background.\nSincerely,"
}