{
  "id": "d645-165",
  "text": ", uM'*\nMississippi State University\nState College, Mississippi\nSchool of Abts and Sciences\nOffice of the Associate Dean\nfor Liberal Arts\nJune 13, 1961\nThe Honorable William Colmer, M C.\nHouse of Representatives\nWashington, D.C.\nDear Hr, Colmer:\nIt has come to our attention that legislation for federal aid to educational tele¬\nvision is now being drafted by the Department of Health Education and Welfare as\na result of favorable hearings before the House Subcommittee on Communication and\nPower. Since any proposed measure will be reviewed and acted upon by the House\nRules Committee, of which you are a member, we have felt that we should bring to\nyour attention developments in the ETV area now under way in Mississippi, particu¬\nlarly since we at Mississippi State University have a vital interest In this\nmatter.\nAt the outset, may 1 point out that the concern of Mississippi State University\nwith ETV derives from the fact that we have channel 2, the only educational alloca¬\ntion on the VHP band In Mississippi, naturally, this channel is much desired by\ncommercial broadcasters and to date we have managed successfully to stave off all\nattempts to have the F.C.C. turn the channel over for commercial uses. However, we\nare now in the position of having to do something ourselves toward the activation\nof channel 2 or give up the whole idea.\nIn view of our unique situation channel-wise. President D. W. Colvsrd has felt that\nwhatever is done with channel 2 should be on a state-wide basis, and should extend\nto the entire educational community, including the public schools. To this end, an\nETV committee representing the five senior white state-supported institutions was set\nup by the Council of Presidents of the Board of Trustees, Institutions of Higher\nLearning* This committee has been added to by Superintendent J. M Tubb, who has\nappointed representatives from the junior college and public school areas. Thus, our\nplanning for educational televlaion in Mississippi has become a cooperative operation\nand we envision a state-wide ETV network growing out of the activation of channel 2.\nIt ia felt that ETV will be a great boon to our state in its efforts to meet its\ncritical educational needs. Television will supplement the work of the classroom\nteacher and professor. It will particularly make possible the handling of larger\nclasaes, which are an absolute necessity in view of the current teacher shortage,\nwhich promises to get more severe as time passes. We are under no delusion that ETV\nwill be a great money-saving economy. But in a state of modest financial resources\nsuch as ours is, we shall batter be able to handle our educational needs through the\nefficiency of television. In short, ETV will save us money we don* t have!"
}