{
  "id": "d645-187",
  "text": "A two-track microwave system leads out of Lexington to the\nEast, North, and West; a single track spur leads South to Somerset. Both\ntracks lead outward from Lexington to the North and East; one of the two\ntracks leading to Louisville and West will be reversible in direction.\nThe Elizabethtown Center taps off the main microwave route for its pro¬\ngramming.\nWestern Kentucky\nChannel 17 at Bowling Green will be connected to a studio locatefl\non the Western State campus which will provide local programs and some\nnetwork programs. Channel 26 at Madisonville will provide service to\nOwensboro, Henderson, and Hopkinsville, It will be a non-programming\nlocation. A studio is to be established at Murray State College; channel\n33 located nearby will cover the Purchase area and some territory im¬\nmediately to the East. The two-track microwave network will terminate\nat the transmitter for channel 33.\nCapital Construction Costs for a Network\nAn effort fyas been made to estimate the cost of the physical\nfacilities of a network. The estimate is based on opinions of persons en¬\ngaged in television operations and analysis of plans and studies for other\nsystems having some similarities. Many factors can raise costs for a\nnetwork above the level that engineers or operating personnel might con¬\nsider \"normal,\" For example, the cost of a transmitter can varyby tens\nof thousands of dollars, depending upon the power output needed for a\nspecified coverage. The availability of a good site for a transmitter can\nonly be determined \"on the spot. \" A major cost that might arise is the\nbuilding of roads to transmitter and microwave relay sites where the best\nlocation for coverage purposes might be the worst from the standpoint of\naccessibility. A hilltop tract might have to be cleared and leveled.\nWith these types of problems in mind, estimated costs for a\nsystem are presented.\nThe Basic System\nTransmitters, UHF, 600KW effective ra/diated\npower, 1000 foot tower, necessary related equip¬\nment, and structure to house equipment. 3(Lex¬\nington, Somerset, Madisonville) @$400, 000 $1,200, 000\n- 3 -"
}