{
  "id": "d645-192",
  "text": "II. (SOME IMPORTANT FACTORS IN PLANNING\nTHE NETWORK\nAny large-scale use of educational television in Kentucky will\noperate with the objective of as near state-wide coverage as possible.\nEconomy in operation and construction is also necessary. Facilities for\nproducing telecasts must have their location dictated by availability of\nteaching talent and other educational resources. Priorities are needed\nbecause the whole network can not be built at once.\nThe following sections are designed to give the reasoning behind\ncertain portions of the plan. In addition, some ideas are presented about\nspecial problems and areas in which policy decisions eventually will\nprobably have to be made.\nLocation of Originating Facilities\nOriginating facilities are places where TV programs can be\nproduced. Building one near every transmitter is too expensive, but they\nare not tqoi expensive to make from three to six feasible. Two basic factors\nshould determine the placement of originating facilities. These are avail¬\nable educational resources and area needs. Location in relation to a trans¬\nmitter is of some importance, but generally if the distance; between, the\ntwo is twenty miles or less, a link can be provided at relatively low cost.\nLocation in the state is important with regapd to ease of access for school\npeople. Following are suggested locations for originating facilities. Some\nattention is given to timing of entrance into actual production for network\nor regional consumption.\nLexington\nThe University of Kentucky is located in Lexingtoi>. Within a\nradius of about thirty miles are four major private colleges,' Centre,\nGeorgetown, Berea, and Transylvania, The University has the greatest\ndiversity of specialised talent, library and equipment resources, and\ncourse offerings of any state-supported institution in Kentucky. In addi¬\ntion, Lexington is a hub for major highways.\nThe most extensive originating facility probably should be\nlocated in Lexington, It might be on the University campus, but this is\nnot a necessity. The probable need to use students as helpers in the\nstudios makes location on or near the campus desirable, however.\n8"
}