{
  "id": "d645-193",
  "text": "Lexingtoh is not quite central in the State, but it is close enough\nto being so that the central network controls should also be located there.\nLexington can serve as the regional programming center for Eastern Ken¬\ntucky as well as for the Bluegrass until such time as secondary originating\nfacilities are built at Morehead, Richmond, or both.\nBowling Green\nWestern Kentucky State College is the second-largest state-\nsupported higher education institution in the Commonwealth. It is located\nin one of the larger, growing cities of central-western Kentucky, Because\nof its teacher-training emphasis, Western is well suited to be a source of\nin-school programs.\nThe originating facility at Bowling Green need not be as exten¬\nsive as that at Lexington. To assure that a minimum of necessary experi¬\nence in ETV programming exists when the studio goes \"on the air, \" a video\ntape recorder and a closed circuit TV system should be installed on the\nWestern State campus at the same time the Lexington facility begins to\ntelecast. After a year of practice, during which some productions would\nhave been taped for network showing and experience gained over closed\ncircuit, the facility should be brought into the network programming. The\nclosed circuit installation would continue to serve the needs of the campus\nand allow full use of cameras and other studio equipment.\nMurray\nMurray is located in the Purchase area and can serve far-\nwestern Kentucky. Although somewhat smaller than Western State, Murray\nState College provides many of the same educational resources that justify\na production facility in Bowling Green. Murray also should be enabled to\npractice for a year before entering into the network. This could be done by\nmeans of a closed circuit system developing simultaneously with the similar\nprocess at Bowling Green.\nRichmond\nEastern Kentucky State College is located in Richmond, The\nsituation is somewhat different than with Murray and Bowling Green, for\nRichmond is within the expected coverage of a station located near\nLexingtoni, Probably, no extensive programming should-be planned for\nseveral years at Richmond. Eastern probably will eventually serve as an\noriginating facility for programs designed for Eastern Kentucky, Programs\ncould be taped in Richmond or a microwave link to the network center in\nLexington could be provided. Easterns educational resources appear to\nbe similar in quality and quantity to those of the other state colleges.\nClosed circuit TV would be useful for the campus.\n- 9 -"
}