{
  "id": "d645-196",
  "text": "This type of network would immediately allow transmission to the Cumber¬\nland and Ashland centers as well as public school programming.\nAll existing University centers probably can be reached from\nproposed end-points of the microwave interconnection without the construc¬\ntion of any intermediate relay stations. It should be a \"one-hop\" link from\nMadisonville to Henderson, and from Hazard to Cumberland.\nThe interconnecting system for the regular network can be\nmodified and extended to take in the centers as described above for an\nadditional cost of around $200, 000. The cost of equipping the centers with\nclosed circuit systems so that they can use the programs should be quite\nlow.\nSpecial Considerations\nClosed Circuit Systems\nIn the schedule of construction and operation Set out above,\nmention is made of installing closed circuit TV systems on the campuses\nof Western and Murray State Colleges. These systems would serve as\npractice systems prior to actual network and local programming at these\nlocations. If the state icolleges continue to grow at their present rates,\nthey will experience difficulty in acquiring sufficient additional high quality\nfaculty. Closed circuit TV is adaptable to a variety of uses on college\ncampuses, such as increasing the number of students who can be reached\nby a single instructor. Installation of such systems seems advisable for\neach of the colleges. Accordingly an item is included in the cost esti¬\nmates to provide for closed circuit systems. The University's unique\nposition makes strictly on-campus TV there desirable at present. Due\nto the heavy burden that the network will place upon available personnel,\nas well as the relatively slow growth of the University, closed circuit TV\nwould be perhaps more useful as a training device for TV personnel than\nfor instructional benefits. Financing of the system has not been provided\nfor, however.\nRepeater-transmitters\nThe rough terrain of Eastern Kentucky will cause difficulties\nin reception that can be fully overcome only at very high cost. The first\nconsideration must be to \"cover the ridgetops\" with a strong signal.\nMost towns are in valleys there. Many have community antennas. In the\ncase of some of the larger population concentrations, small, low power\ntransmitters (usually called repeaters) imay provide coverage at low cost.\nSuch installations would pick up the signals of the main transmitters at the\nridgetops and, by means of a directionalized signal, cover the town\ninvolved.\n- 12 -"
}