{
  "id": "d645-2",
  "text": "- 3 -\nCOPY\nOFFICE OF THE VICE PRESIDENT October 10, 1960\nWASHINGTON, D.C.\nIt is a great pleasure to extend greetings to the National Association of\nEducational Broadcasters upon the occasion of its 36th convention and to wish\nyou a fruitful outcome in your deliberations. Those of you who are actively working\nin the field of educational radio and television bear a grave responsibility. This\nNation must improve and make the fullest use of all educational means at its\ndisposal in order to adjust the institutions and methods of democracy to the demands\nof a speeding world. In this regard, the leaders in educational broadcasting have\na great opportunity as well as an obligation.\nThe headlines almost daily remind us of the challenges which our children\nand our children's children face in the years ahead. To meet these challenges\nthe continued strengthening of our educational system is of crucial importance.\nWe now have in this country the resources and the technical means of granting to\nevery citizen of our country his birthright — the right to adequate education. All\ntested means of aiding and improving instruction must be given support and encourage\nment. We must also be ingenious in using radio and television. They are proved\ninstructional tools which have an immense potential for the benefit of American\neducation and the welfare of our country.\nIn the program of education that I recently announced, I stressed the fact that\neducation is a matter of vital public concern, and that the Federal Government has\nan obligation to encourage and assist public and private efforts to improve the quality\nand scope of education at all levels.\nThe importance of radio and television as educational tools has been recognized\nin a variety of ways. These include the assignment of FM and TV frequencies for\neducational use, the inclusion in the Office of Education’s Cooperative Research\nProgram of projects related to television instruction and the research program in\nnew educational media authorized by Title VII of the National Defense Education Act.\nIn this latter respect, as you well know, the U.S. Office of Education has\ndeveloped a program designed to assist and foster needed research to provide a\nsound basis for the orderly and effective development of television as a tool of\neducation.\nI pledge my cooperation in the development of a national educational television\npolicy to help realize the goal of the fullest possible educational opportunity for ever;\nAmerican. This policy should have set forth the basic objectives of the Nation in\nthe field of educational television and it should define respective roles of the\nFederal and other levels of government, broadcasters, educational institutions and"
}