{
  "id": "d645-200",
  "text": "Director of Utilization\nAt an organizational and pay level equal to that of the Educa¬\ntional Director should b£ employed a Director of Utilization. While the\nEducational Director would be concerned with programming and course\ndevelopment conferences, the Director of Utilization would have the respon¬\nsibility for providing aid to teachers receiving ETV in their classrooms.\nHe would also have the responsibility for directing and coordinating research\nconcerned with adapting classroom situations to make the best possible use\nof ETV programs. Testing programs to evaluate various programming\napproaches should constitute an area of considerable importance to him.\nSubordinate Staff-General Considerations\nThe basic personnel outlined above would constitute the admin¬\nistrative nucleus of the network. The responsibilities assigned for central\nadministration will determine what other professional and technical staff\nwill be necessary. Operating upon certain assumptions, the following will\nindicate further requirements in major areas of operation.\nEngineering\nTransmitting facilities require a full-time qualified engineer to\nbe on duty at all times during operation. In order to provide time for main¬\ntenance operations (which are generally money-savers if carried on regu¬\nlarly), each transmitter should have on duty at all times two engineers, one\nchief and an assistant. Two engineers per facility will be sufficient during\nearly stages of operation but when broadcasting exceeds eight hours per day,\na third man probably should be available. Thus, during the first year of\noperation, two will be sufficient, but after that a third might be hired for\neach transmitter. Studios require engineers. Generally one engineer on\nduty is enough except where a video-tape recorder is used simultaneously\nwith live programming. One engineer for each function is then necessary.\nIf studies are used over a*span of more than eight hours, a second engineer\nbecomes necessary. '\nMicrowave facilities require attention of engineers who can do\nregular maintenance and handle problems as they arise. Alabama's micro-\nwave network presently takes the time of one microwave supervisor and two\njourneyman engineers with a third apparently needed.\nReception facilities may present peculiar difficulties in fringe\nareas. Experience will show the degree of need for engineers to work on\nthese problems. As many as five engineers may be necessary to assist\nschools with development of their reception systems.\n- 16 -"
}