{
  "id": "d645-201",
  "text": "An Assistant Chief Engineer for the network probably will be\nnecessary because, during construction and planning phases, these activ¬\nities will require the full-time attention of a top-level engineer working for\nthe commission. The assistant could supervise and train studio-and trans¬\nmitter operating engineers and microwave engineers. After the construc¬\ntion work was complete the assistant should be made responsible for han¬\ndling reception problems if no reception engineer is employed.\nOther Personnel\n~\"5tudio directors as managers of the individual production facil¬\nities should be employed and be ultimately responsible to the General Man¬\nager but ordinarily be under the direction of the Educational Director.\nStudio directors will have responsibility for operation of the production\nfacilities and will have charge of hiring and directing personnel other than\nengineers at each production center. They would also deal with the Regional\nProgram Boards and with the television teachers.\nProducers should be provided in each production center to have\ngeneral control of sets, camera work, rehearsals, etc. At. least one\nProgram Director should be provided at each production facility, depending\nupon the amount of live programming originating from the individual facilities.\nClerical and general production help is necessary. Also, artist\nand research help will be needed for the television teachers. This last will\nneed to develop as experience is gained in the necessities of producing visuals\nfor television teachers. A rule of thumb that might be followed at the outset?\nis one artist for two*teachers. As teachers and their assistants gain experi¬\nence the ratio probably will be changed.\nEvaluation personnel responsible to the Educational Director\nshould be stationed at each production facility. Their task would be to work\nwith the television and classroom teachers to develop criteria for the assess¬\nment of the televised work. They could also be given responsibility\n(depending upon budget) for audience surveys. The latter should be carried\non to help in measuring the breadth of reception of non-classroom pro¬\ngramming. Without such Audience evaluation, no rational basis exists for\ndeciding upon the type of o*iit-of-school programming to be carried on. The\nneed for such surveys is felt both in Alabama and in Florida.\nCentral ►office personnel needed in addition to those already\nnoted will be a coordinator of scheduling responsible for informational\nmaterials and classroom guides. This person, working under the Educa¬\ntional Director, would be responsible for releases of schedules and the\ncentral production and distribution of all course-related publications such\nas study-guides and examinations (if examinations developed by the TV\nteacher are found to be desirable.) He would also have supervisory respon¬\nsibility for clearance and general editing of study guides produced for\nregionally-oriented programs.\n- 17 -"
}