{
  "id": "d645-203",
  "text": "One responsibility of the Educational Director would be to\nsurvey the school systems of the Commonwealth annually to try to ascertain\nthe wishes of local school people about which courses should be presented.\nHe would also be expected to develop and maintain a roster of teachers\ninterested in and capable of acting as television teachers. These two pieces\nof information would be available to the Advisory Program Board to help\nthem in their decisions as to what courses to suggest for televising.\nWith a system such as this, the programs presented over\ntelevision for use in the classroom should meet the needs of the widest\npossible segment of the schools of Kentucky. Final decisions about net¬\nwork programs must, as has been stated, remain in the hands of the\nEducational Director. He will, however, have the benefit of the thinking\nof a broad cross-section of Kentucky educators and their interest and\nactivity should keep his decisions from being arbitrary or unwise.\nRegional Program Boards\nNo network can meet all local needs. Some station time should\nbe available for regional programs. Probably one-third of the time during\nthe school day should be available for locally-produced and regionally-\nconsumed programs that would not be sent out over the network. The choice\nof these programs should be primarily that of local people, although the\nresponsibility of the commission for the network means that the local\ndecisions should be approved by the Eduational Director.\nA regional prdgram board that might be a small-scale model\nof the Advisory Program Board should be provided at each originating\nfacility* The Studio Director at that facility should be an ex officio\nmember. The remaining members could be appointed by the Educational\nDirector upon the recommendation of local school organizations. The\nboard would have the responsibility for deciding upon the programs to be\nshown for regional consumption only.\nCourse Preparation\nThe key to effective utilization of ETY in the schools is consul¬\ntation between the classroom teacher and the television teacher. The most\nbeautifully presented televised lesson is, of course, worthless unless it is\nused and used properly in’the classroom.\nTelevision teachers should be chosen for their ability to \"get\nacross\" through words and illustrative visual material the subject content.\nOrdinarily they must have been good classroom teachers themselves. They\nneed to have a talent for presentation. Talents vary greatly. The person\n- 19"
}