{
  "id": "d645-205",
  "text": "The preceding statement is crucial to the whole problem of use\nof ETV. The televised portion of a class is a tool for the classroom teacher.\nIt is not a show-window for the talents of the teacher who happens to be\nchosen to televise it. Its primary purpose in most cases is to provide for\nthe highest quality presentation of the information-distributing part of\nteaching. The classroom teacher is responsible for the weaving of this\nimportant part of teaching into the whole educational process.\nThe classroom teacher can \"make or break\" the use of ETV.\nShould she be unfavorably disposed toward it, she can so influence her\nstudents that they will receive little benefit from it. Should she consciously\ntry to make the most constructive use of it, it will become an integral,\ndynamic part of the learning in her classroom.\nTwo main reasons exist for involving classroom teachers in the\ndevelopment of the courses to be televised. The first is to insure that what\nis presented is what is needed in the classrooms. The second is to insure\nthat what is televised is used. Participation of classroom teachers is nec¬\nessary for accomplishing both purposes.\nOther subsidiary purposes may be promoted by an organized\nsystem of consultation, in developing TV courses. Onens the fact that the\nsemester’s plan is developed in detail, in a logical sequence, along with a\nstudy guide for the'teachers using the TV course. Another is the fact that\nsuch careful consideration is seldom feasible for the individual teacher in\nelementary school®. Loaded down as they are, teachers frequently do not\nhave time to do fori themselves the careful study that should be the basis\nfor any course. TV provides a focus for this new effort in many commu¬\nnities. The individual teacher, under this type of arrangement is also\nexposed to her professional counterparts and is able to benefit from their\nthinking about the teaching of the particular subject.\nContinuing Adjustment of Courses\nCourse presentations should be revised from year to year.\nEven the best planned series can benefit from being adjusted to include new\nor additional materials. Less obvious, but equally important, is the fact\nthat good teachers.Revise.their lesson plans during the course of the year\nas the nped develops.\nThe televised courses should be adjusted as experience shows\njlthe need. The classroom teacher should be able to point out to the TV\nteacher desirable changes in pacing, content, or approach. Because of the\nvariety of school systems and students to be served by even one station,\n- 21"
}