{
  "id": "d645-208",
  "text": "In some cases, especially in Eastern Kentucky, reception\nproblems will exist that can be handled only through the use of more than\nthe normal amount of equipment. For example, arrangements may have\nto,be made with a community antenna system to receive the signal. In\nsome places, where a town is located in a valley, a \"repeater\" or low -\npqwered station may have to be provided that will pick up the signal of the\nmain transmitter and beam it down to the selected area. These are engi¬\nneering problems and justify the inclusion of reception engineers in the\nplan.\nAt the Receiver. Due to the types of problems noted above, some areas\nwill have difficulty in receiving a signal. In many cases, however, local\nschool authorities will be able to rely upon commercial sales and repair¬\nmen in the area to aid in providing a good antenna and distribution system.\nIn other instances, especially where a large school is concerned, advice\nof engineers provided by companies selling television receiving equipment\nor engineers working for the state network will be necessary. In a large\nschool, a single antenna using coaxial cable and boosters may be advisable.\nThe reeeiveris themselves should be good quality (not the\n\"leader\" or cheaper kind) sets. The need is for clear, unmarred pictures\nwith a minimum of distortion. Both the Florida and Alabama networks\nhave developed sets of minimum specifications for receivers. These are\ndistributed to interested schools. Schools are not required to follow the\nspecifications. In Kentucky, should the State aid in the purchase of re¬\nceivers, specifications Should be developed and schools required to use\nthem in their receiver purchases. If receivers are to be bought completely\nwith local funds, the specifications should at least be recommended--\nunless Minimum foundation money is used. In, the last case, schools\nshould be required to follow specifications developed by the network engi¬\nneers.\nThe Receiving Teachers\nAlthough the point is made in the Legislative Research Com¬\nmission report* too much can not be made of the fact that the teacher in\nthe classroom is the key-to the effective use of ETV programs. Classroom\nteachers should participate in the planning of programs; they should be\nable to suggest changes as the year passes. They also need help in using\nthe programs. The least expensive method that provides full coverage is\nthe teachers\\ manual or study guide.\nIntensive planning is recognized as a necessary part of all\nteaching. Major elements in planning for ETV classes are noted earlier\nin this section. Elements of thvs planning include a detailed outline of\nmaterial to be covered, objectives in terms of student understanding, and\n- 24 -"
}