{
  "id": "d645-209",
  "text": "a survey of resources. In most places where TV is used regularly in the\nclassroom, these elements are organized into a study guide. In many parts\nof the country study guide's are a standard part of ordinary classroom\ninstruction. The problem with them is getting people to use them, as was\nstated by the Assistant Superintendent of Schools in Cincinnati,\n. . . it is as foolish to assume that the produc¬\ntion of a curriculum guide guarantees success in\nthe use of television as it is to assume that the pub¬\nlication of any bulletin will change automatically the\ninstructional program in the classroom. Rather,\nit is as necessary to implement the television guide\nin all the proved ways as it is with any other teach¬\ning guide. *\nThis observation is important. Receiving teachers must be\naided in developing techniques for making best use of televised portions of\nlesson . Continuous experimentation should be carried on to explore vari¬\nous approaches. Enough is known from studies made in other states to\nset forth at the beginning1 suggestions as to when and for how long, class¬\nroom activities centered'on using the ETV presentation should be. But\nthe best types of uses are not so clearly established.\nAt least one teacher from each school that will use ETV should\nhave rather intensive instruction and practice in use of ETV so that this\nperson then can help other teachers in the same school with their problems.\nAs yet there is no \"one best way\" to use ETV in the classroom. The per¬\nsonality and preferences of individual teachers will result in a variety of\ntypes of use and this variety should be encouraged. Whatever approaches\nindividual teachers decide to use, they should be aided in developing their\nskill in use of ETV. For this they need knowledge of TV's strengths and\nlimitations. An organized program of instruction is necessary for this\nknowledge to be made available.\nHome Consumption of ETV\nAt the present time, only two commercial ultra-high frequency-\ntelevision stations operate in Kentucky. These are located in Lexington.\nThe educational television station in Louisville, WFPK, is UHF. UHF\nchannels are located in cities surrounding the Commonwealth. On the\nwhole, however, most television reception in Kentucky is through VHF.\n* Robert P. Curry, \"Cincinnati’s Adventure into ETV, \"\nAmerican School Board Journal, CXXXVIII (March 1959), p. 27.\nCincinnati has had several years of experience in use of ETV in the class¬\nroom.\n- 25 -"
}