{
  "id": "d645-210",
  "text": "Very large numbers of sets in the homes of Kentucky citizens can receive\nonly VHF. In order to receive UHF, adapting equipment costing $20 and\nover would be needed on these sets.\nThis fact reduces the potential audience at the outset of a state¬\nwide network. Some persons in the television field believe that a higher\npercentage of VHF-UHF receivers will be purchases in the future, thus\nreducing the degree of this limitation,\nA number of cities in Kentucky are, however, linked to com¬\nmunity antenna systems. In these cases, the ETV station can be received\non sets after conversion of the signal by the antenna system.\nShort of an actual house-to-house survey, no simple method\nappears to be available to discover the number of TV sets in the Common¬\nwealth that are presently able to receive a UHF signal. In order to safe¬\nguard against over-optimism, the assumption should be made that less\nthan half of the receivers in Kentucky can receive UHF and that the number\nof such sets will not increase very rapidly under present circumstances.\nOn this basis, programming during the early years of a network will of\nnecessity be aimed at school classes and organized groups that might\ngather at schools to view special programs in the evening or on weekends.\nSurveying Out-of-School Audiences\nOne of, the greatest apparent weaknesses of ETV programming\nfor out-of-school audiences has been the lack of accurate knowledge of \"who\nis listening? how much? how well do they like it?\" A fundamental problem\nexists that affects any decisions in the after-school program. This is to\ndecide whether to lead or to follow. The people who will make the decisions\nas to what to show over ETV will do so on the basis of what they consider\nto be needs. Perhaps the prime example of this is with so-called \"cultural\"\nprograms. •\nMost Kentuckians are not presently strongly interested in opera,\nin symphonic production,, in ballet, or in modern art. If programs dealing\nwith these types of-subjects are shown, probably only a minority of those\nable to receive these on their home sets will watch them. This, then restates\nthe problem. Should televised programs be chosen only for their mass\nappeal? If they are not, can use of a publicly-supported statewide network\nfor their showing be justified?\nAssuming that these \"cultural\" programs are valuable in spite\n- 26 -"
}