{
  "id": "d645-224",
  "text": "Congressman J. Arthur Younger\nHouse Office Building\nWashington 25, D. C.\nJuly 21, 1961\n—JDear Art:\nfp)\nYou perhaps do not remember kibitzing on the honeymoon of a young couple nearly\nthirty years ago on a trip from Seattle to San Francisco aboard the SS Enana\ny lexander, but I certainly do, for I was the bridproom. My wife was Elizabeth\nraith, daughter of Helen and Rex Smith, I hope your responsibilities in Congress\nhave not dulled your enjoyment of the practical joke — nor that your long\n^residence in California has caused you to completely forget Seattle and the\nrp|University of Washington\nMy purpose in writing you is to tell you of a deep interest I have in the bills\nj°r federal aid to educational television which are before the Committee of\nV^yoreign and Interstate Commerce in the House. I am manager of a non-commercial\neducat onal television station operated by the University of Washington as a\n-joint venture with the public school districts of Seattle and King County.\ni-jlecause I happen, at the present time, also to be Chairman of thetelevision\nLJftoard of the National Assn, of Educational Broadcasters, and national chairman\nthe c°mmLttee cf educational stations affiliated with the National Educat onal\nTelevision and Radio Center, my interest in such legislation extends far beyond\nthe needs of the University of Washington or the State of Washington.\nI was privileged to be asked to testify on this legislation before the Senate\nyomznerce Committee earlier this year. As you know the Senate bill was ntroduced\n>y Warren Magnuson from Washington. The point of my testimony then, and the thing\n(1 would like to tell you is this: The most important thing whch the educat onal\ntelevision stat ons can do is to help the public schools meet the complex nstruct-\nonal problems they face growing out of rapidly increasing enrollments and the\nnev table shortage of skilled teachers. Many of the 57 existing educational\ntelevision stations would not have come into being had not the schools of their\nrespective communities been assisted In acquiring capital equipment funds through\ngrants from the Ford Foundation and others. The sources that many of us were able\nto draw on for funds no longer are avallable to the stations which must be created\nn the next few years f the schools of our country are to be able to take advantagi\nof the medium of television to help improve their instruction. The availability of\nFederal funds will make poss ble the development of many stat ons which will not\notherwise be able to come into being. And it may be that this type of aid to these\nstat ons is a proper function of the Federal government, for the ^*4*-of television\nand particularly these non-commercial educational stations are in a sense, creatures\nof the federal government."
}