{
  "id": "d645-242",
  "text": "National Educational Television and Radio Center\nWashington Office\n1619 Massachusetts Avenue, NJ.\nNovember 13, 1961\ncc: James Robertson\nJohn White\nArthur Griffin\nPaul Owen\nSubject: ETV Legislation\nI am sending along major excerpts from a news item which appeared\nin The Washington Post on November 9, 1961, \"The Road Show” is another\nopportunity for expressing our views concerning the early favorable\naction on ETV legislation (H,R,132) now before the House Rules Committee.\nI am also sending this information to the Washington Headquarters of the\nNAEB with the request that they too may alert their membership of this\nfurther opportunity to express opinions on ETV legislation before Congress\nreconvenes in January.\n*Kennedy Road Show' Leaves Chicago,\nMoves to Nashville\n’’Chicago, NovoB - President Kennedy’s latest Washington road show,\n’The White House regional conference,* moved on to Nashville tonight\nafter opening a whole new avenue for direct White House contacts with\nthe people during a two-day stand in Chicago,\nFor the second straight day, Federal, state and local officials\nexchanged banter and ideas with representative local citizens in a\nquest for solution of such common problems as rehabilitation of our\ncities and medical care for the aged.\nPostcards Solicited\nto'avoid any KIIcH~in two-way communications, big blue postcards,\naddressed to ’the President, the White House, Washington 25, D„C.»’\nwere made available here to every regional participant to write\nMr. Kennedy directly.\nLarge posters, displaying the picture of the President, extended\nthis invitation: ’The President wants to know your views--write to him\ntoday. Cards are available here.r\nThe cards appeared for the first time in the east room of the\nSheraton Chicago Hotel, where the regional panels on ’Opportunities for\nLiving in Later Years, headed by Assistant HHFA Administrator Sidney\nSpector, and 'Opportunity for Health and Welfare,/ chaired by Under\nSecretary of Health, Education and Welfare Ivan Nestigan, were lunching.\n8We just want to be sure that anybody who has any question to\nask or suggestions to make and who didn’t get a chance to do it here can\nsend it directly to Washington,’ said Nestigan\nMEMORANDUM\nTO: All ETV Station Managers\nFrom: David C. Stewart\nDirector, Washington Office"
}