{
  "id": "d645-244",
  "text": "NATIONAL EDUCATIONAL TELEVISION and RADIO CENTER\n1619 MASSACHUSETTS AVENUE, N. W. ■ WASHINGTON 6, D. C.\nCOPY\nSent for the information of\nWilliam Harley\n7\nDecember 8, 1961\nMr. William J. lewis\nDirector, Ford Foundation ETV\nProject in Vermont\nThe University of Vermont\nPomeroy Hall\nBurlington, Vermont\nDear Mr. Lewis:\nI have received a copy of your letter concerning\nJSTV legislation written to Bill Harley, dated December 6,\n1961. Without wishing to put my oar into this correspondence\nI do, nevertheless, want to tell you how important we regard\nyour thoughts and actions on this matter of ETV legislation.\nI am happy to learn that you have taken the matter up\nwith Senator Aiken. This is very helpful. We hesitated last\nsession to make too much of a concentrated effort on the\nCatholic element in the Hules Committee on the basis of the\nthought that this action might bestir an unfavorable reaction.\nBut the last legislative session was a pretty awful snarl\nand perhaps things have simmered down somewhat since Congress\nadjourned. With respect to your third point, those persons\non the Hules Committee who might be opposed, or at least\ndoubtful, would include (in my own view):\nHoward Smith, D., Va.\nWilliam Colmer, D.,Miss.\nJames J. Delaney, D., N.Y.\nThomas P. O'Neill,Jr., D.,Mass.\nClarence J. Brown, R., Ohio\nWe believe it would be a great advantage to us if the Rules\nCommittee would consider the legislation early in this next\nsession—before we get bogged down once again in the mire of\nreligious and federal aid controversy.\nKatherine St.George, R.,H.Y.\nH. Allen Smith, R.,Calif.\nElmer J. Hoffman, R.,Ill.\nWilliam H. Avery, R.,Kansas\nI am enclosing a dozen copies of a document entitled \"A\nReport on ETV Legislation,f recently published by the Joint Council\non Educational Broadcasting. We have some additional copies of\nthis as does Bill Harley.\nRECEIVED\nNAEB HEADQUARTERS\nEnclosure:\nDCS:db\ncc: William Harle\nJack McBride\nDEC 111961\nincerely,\nDavicPCTstewart, Director\nWashington Office\nt"
}