{
  "id": "d645-247",
  "text": "0appy year\nINDUSTRY\nINFORMATION\nHEARINGS MAY CHANGE\nRADIO’S DIRECTION\nAttorney Kenneth A. Cox, when explaining the\nFCC Broadcast Bureau of which he is chief, be¬\ngins by telling broadcasters that his aim is to dis¬\npel the image of a\n“cold-blooded agency\nbent on the destruction\nof the broadcaster.”\nOriginally called to\nWashington as general\ncounsel to the FCC\nwhen Newton Minow\nwas appointed chair¬\nman, Cox became head\nof the Broadcast Bureau in April 1961.\nIn a recent talk to the Oregon Association of\nBroadcasters (a talk similar to those he gives to\nother states’ broadcasters), Cox said that the Com¬\nmission has spent so much time on television that\nit may have lost some of its “expertese” on radio.\nPlans have now been made to conduct informal\nhearings on radio and there may be some changes\nin radio rules as a result.\nSome of the questions that will be asked in the\nhearings and that all broadcasters should be ask¬\ning themselves, as reported by the bureau chief,\nare: (Continued on Page 2)\nIN COMING ISSUES\nWhat does the U.S. State Department\nthink about attacks made on it and its mem¬\nbers—particularly those made on the air?\nOne of our Washington, D.C., members, Si¬\nmone Poulain, will answer.\nA new compaign against inflation, with\nemphasis on the broadcasters’ role, will be\ndescribed in an article by Bruce Palmer,\norganizer and first president of the Council\nfor Economic Growth and Security, Inc.\nPalmer was chairman last year of the politi¬\ncal participation committee of the U.S.\nChamber of Commerce and once was named\none of America’s Ten Outstanding Young\nMen.\nA SENATOR SPEAKS\nBy the Honorable WARREN G. MAGNUSON\nUnited States Senator\nThere is no subject closer to my heart than edu¬\ncational television. For over 7 years I have intro¬\nduced and urged the enactment of educational TV\nlegislation. In the first session of the 87th Con¬\ngress the Senate acted by passing my bill, S.205,\nby the overwhelming vote of 67 to 13 in essen¬\ntially the same form as it was approved by the\n85th and 86th Congresses. Hearings have been\nheld in the House, the bill has been reported and\nis presently pending before the House Rules Com¬\nmittee.\nThe outlook for congressional action and an\nultimate program is much more optimistic than\nit has ever been before. This is due, of course, to\nthe stamp of approval which has been placed on\nthis program by President John F. Kennedy.\nThen, too, for the first\ntime words of encour¬\nagement were uttered\nby the Secretary of the\nDepartment of Health,\nEducation and Welfare,\nMr. Abraham Ribicoff.\nI am hopeful that all\nthose interested in this\nsubject will continue to\ncommunicate with the Congress urging the pas¬\nsage of this legislation in the next session, so that\nthe benefits of the legislation will become avail¬\nable to all the people as soon as possible.\n_(Continued on Page 3y\nHOW KNOWLEDGEABLE ARE YOU?\nWe respectfully suggest that perusal of\nyour AWRT Digest will help keep you in¬\nformed about the industry. You don’t need\nto be red-faced when the “top brass” talks\nabout what’s going on in Washington or\nelsewhere, so far as broadcasting goes. For\ninstance, this issue will describe for you the\nFCC Bureau in the words of its own chief,\nKenneth Cox."
}