{
  "id": "d645-248",
  "text": "HEARINGS (Continued from Page 1)\n1. What do you consider your role as a radio\nstation?\n2. What is the role of the network in radio?\n3. Is there room in radio for comedy, drama,\ndiscussion of public affairs?\n4. What sources of programing are available to\nradio stations? Are there both recorded and\nlive sources? We need to know more about\nthe sources.\n5. Is radio serving the local community?\n6. How does radio make its living?\n7. Are the Commission’s standards as to quali¬\nfications realistic or should they be tight¬\nened up?\n8. Does a specialized radio station owe an obli¬\ngation to offer more than entertainment?\nWhat about the old-time radio operator who\nis faced with competition from a newcomer\nwho avoids expense and trouble (to reach a\nspecialized audience), and thus gets the old\ntimer in trouble rating-wise? Sometimes the\nnewcomer cuts rates and accepts advertis¬\ning that the old timer wouldn’t accept, Cox\nsaid, and thus forces the old timer to do\nlikewise. This is why the Commission needs\nto know the sources of radio revenue in vari¬\nous communities, he explained.\n“There are clear limits as to how far the Com¬\nmission can go in investigating sources of reve¬\nnue,” Cox reported, “but there is a growing con¬\ncern over stations that are losing money.”\nCox believes there will be changes in the inter¬\nruption rule. “In defining interruption,” he told\nthe OAB, “we are inclined to shift to requiring\nyou to report the total amount of time spent in\ncommercials. The chances are very great that the\npresent section asking for a great deal of detail\non ‘interruption’ will be eliminated.”\nCox believes there is a good chance he will be\nable to persuade the Commission to go into many\nof the above questions and problems on radio.\nOn television the bureau chief has this to say:\n“The Commission would not like to see television\nduplicate the problems of AM radio to get expan¬\nsion to too many stations. It has been easy and\ninexpensive to get into AM on credit and with a\nsmall staff. We do need more TV competition in\nsome places but I’m afraid we might get program\ndegradation if we had too many TV stations. It\nis therefore inherent that there would be limits if\nwe went to UHF. For once a station is on the air,\nit is hard to get it off even though nothing in its\nprogram appeals to everyone.”\nExplaining the work of his own bureau, lawyer\nCox pointed out that most broadcasters’ dealings\nare with the bureau. Applications for renewal,\ncomplaints about operations, many other matters\ngo to the bureau. It has subdivisions such as the\nONE OF OUR BOYS\nRobert D. Swezey, a board member of the\nAWRT Education Foundation, is the new direc¬\ntor of the NAB Code Authority.\nUrbane, charming\nBob Swezey, 54, was a\npioneer broadcaster\nwho joined NBC in\n1939. He was general\ncounsel for the Blue\nNetwork when it split\noff from NBC in 1942.\nHe helped write an\nearlier version of the\nradio code and the TV code. Further, he was\nchairman of the NAB committees which drafted\nthe two codes, the radio code at Atlantic City in\n1947 and the TV code in Washington in 1952.\nSwezey has been away from broadcasting for a\ntime, having served as a special assistant to Sec¬\nretary of Labor James P. Mitchell during the last\nyear of the Eisenhower administration.\nThe code staff numbers seven with its members\nin Washington, D.C., New York City and Los\nAngeles.\nSwezey has said his primary attitude in the new\nposition will be to try to make the code authority\nan affirmative structure — not just “against\nthings.”\nHis contract is for two years. He will report di¬\nrectly to Governor Collins. He assumed the office\nOctober 15.\nOne of Swezey’s early decisions was authoriza¬\ntion for release of a letter to advertising agencies.\nWritten by Stockton Helffrich, director of the\nNew York code office, the letter asked advertis¬\ning agencies producing toy commercials to send\nalong demonstration toys for the code to check\nagainst their copy.\nEconomics Division with which financial state¬\nments are filed and published. It has a network\nsubdivision to which broadcasters’ problems with\nthe networks go—and so on.\nIn a hearing it is the bureau that appears be¬\nfore the examiner and before the Commission.\nCox told the OAB that when the program form\nchange was criticized by the industry, the bureau\ntried to work out the difficulties. “We did tests\nwith the NAB and are now prepared to make\nsubstantial changes in the logging rules,” he said.\nOne final point of advice for all broadcasters by\nCox: “If substantial changes are made by you in\nthe three-year period between renewals, you ought\nto tell the Commission and say why you made\nthe changes. Keep yourselves in a current status\nwith us,” he warned."
}