{
  "id": "d645-249",
  "text": "Critiques by Audiences Urged\nEditor’s Note: Gilbert Seldes, author, critic\nteacher and broadcast commentator, is the author\nof the best seller, “The\nPublic Arts.” Now, ex¬\nclusively for the Infor¬\nmation Digest, Mr.\nSeldes has brought us\nup to date on an idea\nhe’s long cherished.\nWhy don’t you\nbroadcasters let your\nown communities, on your own air, tell what they\nthink of you? Gilbert Seldes began asking that\nquestion of broadcasters some six years ago. He\nsucceeded in persuading a few of them to do just\nthat.\nNow the Dean of the Annenberg School of\nCommunications at the University of Pennsylva¬\nnia, Seldes still asks the question whenever he\nmeets a broadcaster.\nSeldes believes that panels of local persons,\ntelling honestly what they think of programing in\ntheir own areas, would benefit broadcasting and\nbroadcasters.\nRecently we asked the Pennsylvania Dean\nwhat success his idea was having. The very next\nweek he had lunch with Newton Minow who de¬\nscribed correspondence with a station owner in\nDallas, Texas. The owner wrote Minow that his\nstation had aired a program devoted to the read¬\ning of critical letters from the public and to the\nstation’s answers to them. “The significant fact,”\nGilbert Seldes wrote, “was that the program was\nfiendishly popular and kept growing in ratings.\nIt had a 23 one night in comparison with a 37\nfor a top-ranking series.”\nInstead of a program devoted to the reading of\nletters from the public about a station’s program¬\ning, Seldes wants people on the air. “I think the\nprogram should be done before an audience and\nto get out of the rut, I suggest that one week it\nbe lawyers, another pediatricians and another\nIowans in Seattle, etc,” he says. “Ideally there\nshould be time for questions.”\nSome broadcasters have fielded Seldes’ sugges¬\ntion with this reply: “Why should we invite criti¬\ncism when there’s so much of it going around\nanyhow?”\nTo them he says that station WCAU tried his\npanel critique suggestion. On one program, after\nsome conventional criticism, one panelist said,\n“You did have a good program on your air and\nyou threw it off. Why was that?”\nThe WCAU-TV moderator replied, “Took it\noff, did we?” Then he went into the history of\nthe program—a one-shot which found some favor,\nwas put on every other week and was indeed off\nfor the summer—the time when the question was\nasked. “But,” says Seldes, “the moderator then\ntold the panelist the program would be coming\nback every week in the fall.”\n“In one blow,” says Seldes, “two things had\nbeen accomplished. It became clear that a lot of\ncriticism of TV was ill-informed and it also be¬\ncame clear that the station was alert to what the\npublic wanted.”\nHere, however, is Seldes’ argument, unanswer¬\nable, he calls it, for putting a panel of local TV\ncritics on one’s own air. “In one way or another\nstation owners will be subjected to public hear¬\nings when they apply for renewal of license. How\nsplendid it will be for a station to say: ‘We have\nheld public hearings once a week (or fortnight)\never since such and such a date. We have heard\nwhat the public wanted and we have discussed\nits wants. We have justified ourselves all along\nthe line. Now bring on any critics you want. We’re\nbound to have the answers on our tapes.”—E.W.E.\nMAGNUSON (Continued from Page 1)\nI firmly believe that an educational television\nnetwork, equal to and surpassing the commercial\nnetworks, will become a fact if this legislation is\nenacted. Then, with the startling and almost un¬\nbelievable developments taking place in space\ncommunications, we will see in the very near fu¬\nture exchanges in program and ideas, not alone\nbetween the various schools and professional\ngroups within the United States, but between\nthe United States and such far-off countries as\nthose in Asia, Europe and Africa. The potential\nis unlimited, but more important is the need for\nexpanding this facility to meet the unprecedented\nneed for the future, where we know that in 1970\nthere will be more than 6,400,000 students en¬\nrolled in our colleges and universities, as compared\nto the 3,800,000 students presently enrolled. It\ndoes not take a great deal of imagination to see\nthe possibilties of educational television in the\nhigher educational field.\nI could go on endlessly giving examples of the\nuse, as well as the need, for expanding this me¬\ndium in the educational field.\nI am pleasantly surprised at the attitude of the\nnetworks and commercial broadcasters to my bill.\nI hadn’t expected their opposition to it, but I had\nno idea they would so vigorously be for it. Acti£\nally it is the kind of competition they want and\nthey envision a fourth network for education.\nProof of the success of the education stations is\nthis: when one gets started, it never does get\ntaken off the air, with almost no exception.\nThis article was written especially for The Di¬\ngest by Senator Magnuson. The ideas are his."
}