{
  "id": "d645-33",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n1346 Connecticut Avenue, N.W.\nWashington 6, D. C*\nMemorandum to: News Directors of all NAEB Radio and Television Stations\nFrom: NAEB National Office, Washington\nDate: March 21, 19 61\nYou recently received, or should have received, an invitation from the State De¬\npartment regarding a Foreign Policy Briefing Conference for radio and television\nnews editors throughout the country. This is to add a few words of detail since\nmany of you expressed a desire to know more about it.\nIn a conversation with State Department officials this morning we learned the fol¬\nlowing :\nThe Foreign Policy Briefing Conference is a totally new idea. It is an attempt\nto provide an opportunity for news directors throughout the country to hear and be¬\ncome acquainted with and to exchange ideas with the top policy makers in the\ncountry. The purpose of the Conference is to provide better understanding, in\nboth directions, between the Administration and yourselves.\nThe Conference host is Secretary of State Dean Rusk. Others who will par¬\nticipate include the President, who will, perforce, be there only briefly, top State\nDepartment officials (only Chester Bowles, as of this writing, has not been able to\nclear the time yet) Allan Dulles, Edward R. Murrow, and a number of other key\nofficials in other federal agencies. There will be many opportunities for questions\nand answers.\nThis is the first time broadcasters have been recognized in quite this way.\nInvited, besides yourselves, are news editors and some public affairs personnel\nof commercial stations in the nation, and key news and public service people from\nthe networks.\nNewspaper and other press editors will be invited to a similar conference April\n24 and 25. It is not without significance that the first conference is for broad¬\ncasters, nor was it in any way a coincidence. The State Department intended for\nthis to indicate its recognition of the importance of the broadcast media in presen¬\ntation of news and information.\nThe Conference will be held April 3 and 4 in the New State Department Building\nAuditorium.\nFinally, and most important, the State Department will appreciate your earliest\nanswer if you plan to come. They need this information in order to make proper plans\nand in order to send you who are coming further details on the Conference, on hotel\narrangements and so forth. Please address vour replies soonest, therefore^jto\nMr. Roger Tubbv, Department of State. Washington 25, D. C."
}