{
  "id": "d645-95",
  "text": "- 2 -\nBy cooperation with the Chicago Teachers College, two of the current\ncourses are open to practicing and prospective teachers. One of these, a\ncourse in Human Relations, is being taught at the graduate level with the\nexpress purpose of helping classroom teachers understand and cope with class¬\nroom problems*\nNew opportunities are also afforded, to home-bound, hospitalized and\nimprisoned students. These students number between 50 and 100 each term.\nThis instruction is provided at a much lower cost than tutorial instruction\nand with greater effectiveness than correspondence instruction.\nThe quality of this higher educational experience via television can be\ncertified as equal to or better than conventional instruction, Chicago^\nTV College was.? begun in 1956 under a grant of #500,000 from the Fund for the\nAdvancement of Education. In the three years, 1956 to 1959, intensive\nresearch was carried on in a large number of carefully controlled experiments.\nThe achievement of television students has consistently been equal to or\nsuperior to conventionally taught students. These data are summarized on\npages 7 through 9 in the printed report entitled Chicago1s TV College supplied\nto the Committee as exhibit B.\nThe TV College project has been carefully studied to determine unit costs\nof instruction. The Chicago Board of Education makes payment to WTTW for the\nactual costs of broadcasting. Currently these charges are $18,000 per month.\nThe unit cost of credit instruction via television is calculated by dividing\nthe total of broadcasting charges and all other instructional costs by the\nnumber of equivalent full-time students served. In Spring 1961, this unit\ncost is estimated to be less than classroom instructional cost by #U0 per full¬\ntime student per year. In other words, quality college television instruction\ncost, after five years of experience, has dropped to a level below classroom\ncosts and thus additional students can be added at about one-third the cost of\nclassroom instruction."
}