{
  "id": "d645-96",
  "text": "- 3 -\nEqually important is the amount of additional educational service given\nfree as a unique bonus of the broadcast television medium. At no additional\ncost, £000 not-for-credit enrollees are following one or more of the courses\nwith some regularity. Audience surveys and estimates suggest a total\nunduplicated audience of 25>0,000 who watch at least one of the nine TV College\ncourses on a reasonably regular basis.\nWorthy of attention by this Committee is the evaluation of the TV College\nproject by a panel of distinguished educators representing four fields—\naccreditation of institutions of higher education, communications# research,\nevaluation and testing, and administration of public higher education. The\npanel included the following:\nNorman Burns, Secretary, Commission on Colleges and Universities,\nNorth Central Association of Colleges and Secondary Schools\nHenry Chauncey, President, Educational Testing Service\nFrederick L. Hovde, President, Purdue University\nWilbur Schramm, Director, Institute for Communication Research,\nStanford University\nA few extracts of the panelTs evaluation dated June I960 are as follows:\nCourses at the junior college level can be taught effectively\nto a home audience by television. The results on this point were\nmost impressive and convincing. Indeed, in the few cases where\nthere were significant differences between the performance of home\nTV students and classroom face-to-face students, the differences\nwere more often in favor of the TV students than the others.\nWhen junior college work is offered on television, it brings\ninto the educational system a new group of students—an older\ngroup (median age in the 30’s), most of them housewives, who are\nstrongly motivated to continue their education but have been kept\nfrom doing so by home and family duties. These students like and\nare grateful for television courses. Once started on higher\neducation by television, they are likely to go on to a junior or\nsenior college degree. Many of them are planning to become\nteachers. Obviously this is an important group to bring back into\neducation."
}