{
  "id": "d1472-2",
  "text": "PROGRAM EXCHANGE URGED\nSixteen members of Boston University’s 1957\nInternational Seminar on Radio and Television joined\nin a plea for increased exchange of programs and\ntranscontinental radio and television networks at a\npress conference held for them at the University Oct.\n15.\nThese 16 experts are among the 30 radio and TV\nexperts from 25 countries who came to Boston Uni¬\nversity in June for the start of the four-month semi¬\nnar.\nMany of the seminar members had never seen\ntelevision before they came to the United States.\nAlthough some of them felt that United States\ntelevision is too commercial, they all agreed that com¬\nmercial television is responsible for the great tech¬\nnical progress of the medium. Several said educa¬\ntional television tends to be stuffy, too obviously ed¬\nucational.\nMiss Enoh Maria Etuk, broadcasting officer from\nNigeria, believes that each station should have some\neducation, some information and some entertainment.\nEducational TV and radio in this country, she said,\nare too technical, too blatantly educational and not\nsufficiently entertaining.\nMiss Thetis C. Frantji, head of the General Broad¬\ncasting Section in Greece, stressed the cultural ad¬\nvantages of TV. “It is bringing the theater and music\nto many people who would otherwise not be exposed\nto them.” But, she added, “TV came to the world\ntoo early, before we had fully realized the potential\nof sound.”\nThe TV picture is\\so captivating, she said, that\npeople may not think enough about what is being\nsaid.\nThe seminar is under the sponsorship of the In¬\nternational Education Exchange Service of the United\nStates Department of State. During the seminar, the\nforeign TV and radio experts inspected network\nstudios, observed stations in New York and spent\nseveral weeks individually observing radio-TV op¬\nerations throughout the country.\nBOX\nSCORE\nTotal\nAM\nstations ■\n3113\n(includes\n37\nnon-commercial)\nTotal\nFM\nstations ■\n668\n(includes\n138\nnon-commercial)\nTotal\nTV\nstations ■\n555\n(includes\n27\nnon-commercial)\nDIRECTORY\nCHANGES\nPage 1\nDelete:\nAdd:\n55 Affiliate Members\n56 Affiliate Members\nPage 31\nAdd:\nMaryland (Region 1)\nUniversity of Maryland\nW. L. Strausbaugh, Head\nDept, of Speech and Dramatic Ad-\nCollege Park, Maryland\nWarfield 7-3800 Ext. 291\nHUMAN RIGHTS DAY\nThe U.S. National Commission for UNESCO’s plans\nfor Human Rights Day on Dec. 10 are in final form\nand materials for assisting in the observance of the\nday are available free of charge for distribution.\nThis year, as in years past, the President of the\nUnited States is expected to issue a proclamation\ncalling attention to the anniversary of the adoption\nof the Universal Declaration of Human Rights\n(1948) and asking all Americans to join with the free\nnations of the world in celebrating it. In addition,\nthe governors of the 48 states are being asked to is¬\nsue similar proclamations. Last year, more than 20\ngovernors did so.\nThe emphasis this year will be on educational\ninstitutions, teachers and other groups concerned\nwith education in order to lay the groundwork for\na widespread and effective observance of the 10th\nanniversary of the adoption of the Declaration in\n1958.\nMaterials for the promotion of Human Rights\nDay, including posters, suggested radio spot an¬\nnouncements, flyers, and wall charts suitable for class¬\nroom use, may be obtained by writing to the U.S. Na¬\ntional Commission for UNESCO, Department of\nState, Washington 25, D.C.\nFCC ACTION\nFCC Examiner Hugh B. Hutchison has recommend¬\ned approval of the Puerto Rican Education Depart¬\nment’s application for a new TV station at Mayaguez.\nThe education department, which operates WIPR-\nAM-TV at San Juan, plans to use channel 3, a com¬\nmercial facility, as an additional educational station at\nMayaguez.\nf The trustees of the Louisville (Ky.) Public Lib¬\nrary have applied for a noncommercial educational\nTV station at Louisville. The station would operate\non channel 15, reserved for education.\nNOVEMBER, 1957\n3"
}