{
  "id": "d1472-4",
  "text": "Monticello, Ill.\n► The Indiana University Radio and Television\nService will be host to 75 high school radio broad*\ncasters at a two-day “do-it-yourself” broadcasting\nclinic Nov. 1 and 2.\nThe clinic is designed to provide practical in¬\nstruction and guidance to Hoosier high school stu¬\ndents who are operating their own school broadcast\nstations.\nMembers of the University department will in¬\nstruct in announcing and production techniques,\nnewswriting, sportscasting tape-recording techniques\nand technical problems.\nThe clinic, under the direction of Prof. George\nJohnson, stems from a 1949 conference on educational\nbroadcasting at the Indiana University. At that time\nthe late Wayne Coy, then chairman of the FCC, an¬\nnounced the creation of “electronic blackboards” by\nthe Commission — the allocation of low-power (10\nwatts) FM broadcast channels for use by schools for\neducational purposes.\nNew Albany High School was the first in the\ncountry to set up a station. It was followed by the\nLouisville (Ky.) Public Library.\nPresently there are 11 such stations operated by\nhigh school students and administrative staffs in\nIndiana.\n► A University of Miami-sponsored' seminar, aimed\nat teaching local ladies engaged in civic work how to\nbehave in front of the TV camera, was held in the\nstudios of WTHS-TV.\nDuring the seminar, a group of TV experts, headed\nby Vernon Bronson, director of the station, showed\nattendants the role of community organizations in\nWTHS, how to plan programs with simplicity and\neffectiveness, how to prepare and display material,\nhow to budget time and money for low-cost produc¬\ntion, and other methods of good television.\n► “There will not be enough air time to meet the de¬\nmand for televised in-school training 10 years from\nnow,” Dr. John W. Taylor, executive director of\nWTTW, Chicago, told his audience at a luncheon\nmeeting in the Chicago Club. The meeting was a\npart of the educational TV station’s 1957-58 fund\ndrive whose goal is $340,000.\nPERSONNEL\n► Henry Morgenthau, III, son of the former secre¬\ntary of the Treasury, has been appointed as TV pro¬\njects manager of Boston’s noncommercial educational\nstation WGBH-TV. He will be in charge of the devel¬\nopments of new programs and arrange for special\nclosed circuit programs planned during the year.\nMorgenthau comes from WNYC in New York\nCity where he was assistant program director. He has\nhad wide experience in producing, directing and’ writ¬\ning for TV and radio.\n► Franklin G. Bousma, program director of televi¬\nsion at Wayne State University, has been named exec¬\nutive secretary of the Detroit Educational Televi¬\nsion Foundation, operator of WTVS.\nBouwsma has been active in radio and TV for the\npast 10 years. A native of Grand Rapids, Bouwsma\nreceived his Bachelor of Arts degree from Calvin\nCollege in 1948. He was graduated from the Univer¬\nsity of Michigan with a Master of Arts in speech in\n1950. Presently, he is studying for a Ph. D. in speech\nin TV at the University of Michigan.\n► Six new staff members have been added to\nKQED’s (San Francisco) growing list of personnel,\nwhich now totals 31 employees, according to James\nDay, general manager of the Bay Area’s community\nTV station on channel 9.\nThe newcomers are Miss Jean Coffing, secretary\nto the general manager; Roy Morgan, producer-direc¬\ntor; Art Faulks, Jr., engineer; Carroll Martin, en¬\ngineer; Clyde Ney, engineer; and John Salvin, en¬\ngineer.\n► Ralph M. Rourke, former assistant manager of\nradio station WNAV in Annapolis, Md., has been ap¬\npointed writer-producer at New York University’s\nOffice of Radio and Television, Warren Kraetzer,\ndirector, has announced.\n► Governor James E. Folsom has appointed Mrs.\nBertha S. Roberts, wife of Senator E. L. Roberts, and\nNathaniel Welch, vice-president for sales, Orradio In¬\ndustries, Inc., as new members to the Alabama Edu¬\ncational Television Commission.\nThe commission is licensee of TV channels 2, 7 and\n10, the state network’s first three stations on the air.\nAlabama has been allotted four high-frequency ETV\nchannels which are not yet in use.\nPROGRAMS\n► An informative 23-week series explaining science\nin laymen’s language was launched Oct. 11 by edu¬\ncational TV station KQED in San Francisco.\nEach half-hour telecast of the series is aimed at\ngiving the viewer a basic understanding of the world\nof science without attempting to teach physics,\nchemistry or geology.\nProgram host is Philippe LeCorbeiller, professor of\napplied physics and general education at Harvard\nUniversity. He is joined by eminent scientists from\nNOVEMBER, 1957\n5"
}