{
  "id": "d1471-4",
  "text": "3\nINTRODUCTION\nOBJECTIVES:\nIn keeping with its policy of cooperating with commercial radio\nstations, of familiarizing its students with possible approaches to\naudience research within given limitations, and of contributing findings\nto the total of existing research facts, the Department of Radio this year\npresents the results of its Third Annual Survey of Radio Listeners, Because\nthis survey is intended only for general purposes, the cities covered are\nnot identified by name*\ni In this survey findings have been classified in several ways not\npreviously attempted, to our knowledge: What;is the effect of the number\nof radio stations in an area on the number of listeners, or the extent to\nwhich they protest or commend? To what extent do bad comnercials result\nin boycott of a product and how many listeners admit that they find some\ncommercials pleasant to listen to? How useful are the early morning hours\nfor radio listening? What are listeners- reactions to the adequacy of news\nby radio? how do survey results differ when questions are asked by tele¬\nphone as compared to when they are asked by personal interview? Such are\nsome of the questions asked and answered in this survey. It is our hope\nthat the answers provided may be of as much interest to the industry and\nits students as the two past surveys have been. The students of radio at\nIndiana University have, in the words of one of them, \"learned more by\ntalking to the consumer of radio than reading the works of its critics\nand operators,\" If this is true, one objective of the survey has already\nbeen achieved, i It is our hope, with this survey, to stimulate more and\nmore new survey approaches by educational institutions.\nOnce again we offer our facilities, within the limitations of our\nmodest resources, to stations and organizations wishing objective answers\nto questions about radio listening and listeners. Suggestions for\nfuture surveys will, as in the past, be welcomed, in the hope that,\nlittle by little, more facts may be available to govern the development\nradio must take if it is to retain listeners and interest non-listeners.\nSAMPLE SIZE AND AREA SURVEYED:\nThis survey was carried out by sixty radio students in their\nrespective home towns during the Christmas holiday of December 1948=\nJanuary, 1949, Twenty-eight Indiana cities and towns, eleven U. S.\ntowns and cities outside Indiana, and one Canadian city was covered in\nthis survey for a total of 1957 (1200 in: Indiana) personal interviews\nand telephone calls* these two types of interviews being approximately\nequally divided in order to compare the results of the two approaches\nfor the same and comparable areas.\nOf the cities surveyed, 17 were non-station cities, 8 were\n1-station cities, 3 were 2-station cities, 3 were 3-station cities,\nand 11 were cities with 4 or more stations. This cross-section of\nstudent home towns is fairly typical for Indiana University and is also"
}