{
  "id": "d1678-3",
  "text": "station. It would be desirable to have more repre¬\nsentation from ETV stations. If some of our chief\nengineers could serve as panel members, alternates\nor observers, I would appreciate hearing from you.\nAs a matter of information, TASO is sponsored\nby the Assn, of Maximum Service Telecasters, the\nCommittee for Competitive TV, the JCET, the\nNARTB, and the Radio-Electronics-TV Mfrs. Assn.\nThe 5 sponsoring organizations underwrite the ad¬\nministrative expenses of TASO, while the companies\nfor which individual panel members work pay the\nexpenses of operating the panels.\nTV TECHNICAL TIPS NO. 33\nNew arrivals are always news! The NAEB Network\nis proudly displaying a new Ampex 300 Magnetic\ntape recorder which arrived May 6. This new equip¬\nment will permit a thorough overhaul of our present\nAmpex machines, in constant service since March,\n1953 and gives us a feeling of security in that we now\nhave a spare.\nNew monitoring loudspeakers, too, have been\npurchased which will provide better reproduction and\npermit a better check on the quality of our output.\nA complete revamping of the inter rack wiring and\njack field is underway to provide more flexibility, and\nease of testing and checking characteristics.\nFor those of you who are familiar with Head¬\nquarters geography, the “back room” (18c Gregory\nHall) has been rearranged and Network Manager\nBob Underwood has moved his office there. With\nthe exception of Traffic Manager Peggy Enderby, the\nnetwork is now a compact working unit in one room.\nWe’d like to rearrange the “front” office to provide\nmore privacy and increased efficiency, but so far no\none has come up with a better floor plan.\n*****\nThe 81st Semi-annual Convention of the Society\nof Motion Picture and TV Engineers was held in\nWashington, April 29 to May 3. Twenty-three of the\n103 papers programmed were on TV subjects.\nOne of the highlights of this meeting was a visit\nto the Closed Circuit Color TV installation at the\nWalter Reed Army Medical Center, where its fine\nfacilities were described and demonstrated. The\nspeakers presented their talks over the TV system to\nthose in attendance in two auditoriums, and were\nviewed in full color, projected on 4 x 6 foot screens.\nAn SMPTE Committee on Closed Circuit TV has\nbeen proposed, and 38 attended an explanatory meet¬\ning to discuss the proposal. A small “ad hoc” com¬\nmittee is to be appointed to further consider this pro¬\nposal, which will review the discussion, draft a pro¬\nposed official scope of interest and an initial proposal\nof work to be undertaken.\n*****\nThe 27th Institute for Education by Radio-TV\nwas held in Columbus May 8-11. Due to the high\ninterest in teaching by TV, the equipment exhibited\nwas perhaps the largest display ever to be seen at\nthis annual meeting. Beginning at the east end of the\nmezzanine of the Deshler-Hilton, Jerrold Electronics\nexhibited their distribution equipment, Dage dis¬\nplayed their two lines of vidicon equipment and\nkinescope recorder; Transvision, its classroom re¬\nceiver; Sarkes-Tarzian had a complete studio control\ninstallation and kinescope recorder; RCA displayed\nits new vidicon broadcast type camera with field type\ncontrol units; Zenith exhibited a hi-fi combination and\na remotely controlled TV receiver.\nA number of engineers were present to participate\nin the clinic on equipment for TV teaching.\n*****\nFor those of you who are contemplating the in¬\nstallation of a 10 watt educational FM station, Mar¬\nshall College has a 10-watt Gates No. B-F-E-10,\nM(>3276, with one MO-3304 set of tubes, one JR-072\ncrystal and oven, operating frequency 88.1 me. In¬\ncluded in the package is 176 feet of new RG 18-U\ncoaxial cable and one FM-11, MO 3429 Single Bay\nBroad Band Ring Type Antenna for two and one-half\ninch pipe with mounting clamp.\nThis equipment has never been used and cost new\n$1,420.50. They offer the complete package for $1000.\nIf you are interested in purchasing this transmitter,\nwrite to Mr. Robert H. Maki, Gates Radio Company,\nQuincy, Illinois, since the transaction must be com¬\npleted through them.\n*****\nRCA has developed an electronic orbiting device\nto prevent “burn-in” on image orthicon cameras. This\nmodification kit is available for around $800 and can\nbe installed within present RCA cameras to ma¬\nterially increase the useful life of image orthicons.\n*****\nAnyone who has gone through the time-consuming\nprocess of installing coaxial connectors on RG-59/U\ncable should be interested in a time-saving connector\ndeveloped by Entron, Inc., Box 287, Bladensburg,\nMd. It’s a solderless connector which can be applied\nin a fraction of the time necessary to attach the con¬\nventional solder type connector. The solderless con¬\nnectors are less expensive and the two necessary\ncrimping tools sell at a very nominal price. Entron\nmakes a complete line of solderless connectors, also,\nfor RG-6/U, RG-8/U and RG-ll/U cables as well as\nthe tools necessary for their installation.\n4\nENGINEERING NEWSLETTER"
}