{
  "id": "d1753-1",
  "text": "GREETINGS FROM THE PRESIDENT\n—Burton Paula\nOn June 3, the NAEB filed with the Federal Com¬\nmunications Commission a statement opposing the\nCommission’s proposal of April 26 to abandon the\nTelevision Allocations Table which has governed\nthe assignment of TV channels since 1952. Our posi¬\ntion was determined by a mail vote of the Board of\nDirectors. Since the future of ETV may be affected\nby these proceedings, I should like to review the sit¬\nuation briefly for Newsletter readers.\nOn April 11, 1952, in its Sixth Report and Order,\nthe FCC set up the present Allocation Table. This\nprovided for 2,053 stations, of which 242 were to be\nnoncommercial educational stations. Subsequently\nthe number of educational reservations was increased\nto 258. In its proposal of April 26, 1957, the Com¬\nmission summarized as follows the reasons for orig¬\ninally preferring fixed assignments to proceeding on\na case-by-case basis:\n“The Table would make for a more efficient use of\nthe available channels. It would' better protect the in¬\nterests of the smaller communities and rural areas by\npreventing preemption of available channels by the\nlarger cities. It would be an effective means of re¬\nserving channels for educational purposes. It would\nexpedite the processing of applications.”\nFor us educators, of course, the Table was of par¬\nticular importance for its reservation of channels for\nnoncommercial educational stations. The JCET was\ncreated to secure these reservations, and continued in\norder to safeguard and activate them.\nThen, on April 26, 1957, the FCC proposed the\nabandonment of the Allocations Table on the grounds\nthat the reasons given in the Sixth Report and Order\nwere no longer valid. In its place, the Commission\nproposed a variation of the so-called “Craven Plan,”\nwhich would accept applications for new TV stations\non any channel, subject only to specified mileage\nseparation rules and some other technical require¬\nments. But there were to be two important qualifica¬\ntions: all educational reservations were to be retained,\nas were fixed assignments for stations within 250 miles\nof the Canadian and Mexican borders.\nBecause of education’s tremendous stake in TV,\nany changes in the Allocations Table become a matter\nof great concern to the NAEB. The FCC’s April\n26th proposal was the principal item we discussed at\nthe JCET meeting of May 22, in Washington. The\nnext day I reviewed the entire matter with Leonard\nMarks, one of our attorneys. On May 28, I requested\nthe reactions of all NAEB officers and directors.\nThose Board members replying (Adams, Broderick,\nBronson, Coleman, Hiller, McBride, Schenkkan,\nSchooley and Weld) agreed with me that we should\noppose the deletion of fixed assignments. Accordingly,\nMarks filed the NAEB’s Comments on June 3. The\nhigh points of our statement are briefly summarized\nbelow.\nAt the outset, we noted with approval that the\nCommission had agreed that it was necessary to con¬\ntinue the educational reservations, and we pledged\nourselves to do everything possible “to make the\nfullest use of these reserved channels with the greatest\nspeed possible.” Nevertheless, we still felt that our\n“interests and the interests of the public at large are\njeopardized by the abandonment, even in part, of\nthe television Table of Assignments. Particularly\nthe Commission’s proposal would abandon the reser¬\nvations, established in 1952, for smaller communities\nof the United States. The Association feels that the\nabandonment of these reservations would be viewed\nby some as the first step toward abandonment of\nreservations for educational broadcasting.”\nWe pointed out that, in establishing the Table of\nAssignments, the FCC had indicated “that it viewed\nthe reservation of educational broadcasting,” and that\nwe believed the adoption of this proposal could well\nbe “the first step toward the abandonment of these\nprinciples.”\nWe also stated that the elimination of the Alloca¬\ntions Table would lead to increased pressure for VHF\nstations, and the lessening of protection for UHF.\nThe elimination of UHF would make it impossible for\nmany educational broadcasters to have TV stations\nat all. Finally we said that, even though the Com¬\nmission proposed no lowering of technical standards,\nwe feared that, without fixed assignments, the pres¬\nsure for new stations would lead to the degradation\nof service through the lowering of mileage separation\nrequirements. In any event, we concluded, nothing\nshould be done to alter technical standards until the\nTASO study is completed.\nThe JCET has also filed comments opposing the\nCommission’s proposal. We knew this when we drew\nup our brief, but decided to file anyway in order to\nbecome a party to the proceedings.\nCommercial broadcasters are divided in their\nreactions. CBS stated that the proposal is “a sub¬\nstantial step in the right direction,” and urged that\nit be carried out as soon as possible, though with strict\nobservance of present mileage separations. NBC, on\nthe other hand, took a stand in opposition. ABC sup¬\nported the proposal in principle, but counseled delay.\nThe Westinghouse Broadcasting Co. asked for fur¬\nther study, particularly in view of the current TASO\ninquiry. Individual station reaction is divided about\n50-50.\nIt, of course, is impossible to forecast the eventual\noutcome. Nevertheless, the NAEB took a position.\n2\nNEWSLETTER"
}