{
  "id": "d1753-2",
  "text": "after careful consideration of the entire matter, which\nI think you will all support. Members who would\nlike to see the full text of our Comments may obtain\ncopies from Headquarters.\nMEMO FROM THE EXECUTIVE DIRECTOR\n—Harry Skornia\nBy the time this reaches you I hope to be somewhere\nin Northern Michigan. I expect to take most of July\nand perhaps part of August for vacation. In previous\nyears, a consecutive period has been hard to come by.\nHowever, I think Harold Hill and the rest will be\nable to keep the shop open to serve you while I am\naway.\nRecent days and weeks have been devoted to the\npreparation of various reports, principally the Kellogg\nAnnual Report. These, of course, go also to the\nNAEB Board. Because of expense, size (and a good\ndeal of statistical material, which most of you are\nfamiliar with or would only “file” anyway) we have\nnot gone to the expense of making a large number or\nsending this to members generally. However, we’ll\nhave some extras available and, if you really want to\nsee one and will return it, we’ll be glad to send one to\nyou. We are proud of it and of the progress it traces.\nA flurry of committee planning activity has also\nmarked this period: Radio Program, Grant-in-Aid\ndeadlines and meetings, planning of the Seminar for\nETV station managers and others. Hill and I have\ncombined a trip for a meeting in St. Louis, to meet\non 1957 Convention plans, with a (week-end) state\nconvention of the National Exchange Club in which\nwe both and Frank Schooley are active.\n*****\nI’d like to supplement my regular “column” this\nmonth with an informal and very personal essay\nwhich might be called: “I Don’t Want To Hurt Any¬\none’s Feelings, But . .\nHere’s the problem for which I beg your indulgent\nunderstanding: Each week I receive a large number\nof letters which begin: “I know you have a Placement\n(or Network, Traffic, Engineering, Newsletter, Jour¬\nnal, etc.) Director, but in just this one case I’d ap¬\npreciate it if you personally would . . . .etc” Many\nof these letters are marked “personal.”\nNow I am grateful for your confidence (as is Har¬\nold Hill, when he receives similarly addressed ones),\nbut.\nIf I’m to do the writer any good, I generally have\nto turn such a request over to the person who can\nprovide the answers, for in many cases I don’t know\nthem and can’t even find them, except by going to\nthe person in charge of the appropriate files. I don’t\nmind doing this, and must do it, if I’m to be of any\nhelp to the writer. But I thought it might be well to\nexplain why, a little more fully, since in many such\ncases I’ve received vigorous protests for not “doing\nit myself.”\nI believe the NAEB is still one of the friendliest\nassociations I know. And our staff still is one of the\nsmallest of any such national office. We do know, and\nwant to know, as many of you personally as possible.\nBut, let’s face it, we have grown considerably (see my\nreference in this column to our Annual Report, which\nruns to over 50 pages (just to list what we do).\nHence, specialization, form replies, assignment of\nduties and other characteristics of a growing opera¬\ntion (and of efficiency) had to be introduced. Since\nwe have a Placement, Network, Engineering, Traffic,\nNewsletter, or other Director or Editor, I can’t feel\nthat “the boss” should be reaching over the re¬\nsponsible individual’s shoulder every few minutes to\nalter his routine. Anyway, as I said earlier, with so\nmany full-time “branches” to our activities now, my\npersonal knowledge of each is increasingly superficial.\nAt the risk of boring you, let me mention a few of the\nregular services which your NAEB regularly provides.\nI’ve asterisked those which I can't fully delegate\n(though “staff work” goes into many things I get\ncredit for). Inquiries in areas not asterisked are likely\nto be referred to appropriate individuals.\nThe Radio Network (including program planning, content traffic,\nin-school, technical, shipping, billing etc. (handled by Bob\nUnderwood, who in turn refers traffic inquiries to Margaret\nEnderby and technical problems to Jess Trump)\nThe Newsletter (delegated to the editor, though I pass on to him\nall items which come to my attention and check a good deal of\ncopy, as does Hill. We also both check copy when we are\nhere before it goes to press)\nThe Journal (handled principally by the Journal editor and\nSchooley)\n* The Fact Sheet Service\nThe NAEB Directory\nSome other 20 publications and brochures per year\nProgram Grants-in-Aid (though I'm \"in on\" all policy planning,\nHarold Hill handles most of this)\nSeminars, Workshops, Conferences\n* The Scholarship Program (General inquiries, however, are\nhandled by staff available and screening is'done- by a sub¬\ncommittee)\nThe Engineering Service (handled by Cecil Bidlack)\n* Managements Consultant Relations (I handle policy and referral\nproblems with M. S. Novik - difficult decisions being referred\nalso to the Board)\nConsultation Services generally (handled by Bidlack, Hill and\nmyself)\n* Legal Counsel Relations (some also are handled by Hill—in all\ncases this is with the guidance of the President and/or the\nBoard)\n* Relations with the NAEB Board, Executive Committee and Of¬\nficers\n* Operational relations with the JCET, ETRC, CNO, AEA,\nUNESCO, the American Council on Education and various\nother organizatinons (58 in all, as listed in our Annual Report\nwith which we have continuous relations and exchanges (In the\ncase of some twenty of these, other staff members are also\ninvolved)\n* Relations with some twenty foreign associations, journals, research\ngroups, plus routine contacts with the BBC, CBC, French, Jap¬\nanese, Korean, Australian, New Zeland, German and other\nradio systems and the U. S. Information Agency (much of this\nis also handled by Seymour Siegel and Bob Underwood of\ncourse)\nJULY, 1957"
}