{
  "id": "d1753-2",
  "text": "PRESIDENT'S COLUMN\nHaving written last month about some of the criteria I feel are perti¬\nnent to evaluating an MEB convention, I have been especially interested\nin looking over the completed questionnaires which have been returned by\nthose attending the San Francisco meeting. The response covers a predict¬\nable range, reflecting the particular interests and experience backgrounds\nof the attendees. Many were enthusiastic — almost ecstatic — asserting\nit was the \"best convention ever”; others, less influenced by San Francisco's\nundoubted attributes, were, nonetheless, impressed by the quality of the\nprogram. Most of the critical comments dealt with nonsubstantive aspects,\nsuch as the high cost of the rooms and the remote location of the hotel.\nStill others deplored the lack of relevance in some of the program features\nto the precise interests of educational broadcasters.\nThe significant comments -- and the genuinely disturbing ones -- concerned\nthe failure of the convention to provide for carrying on the business of the\nassociation: to give the membership opportunity to really discuss and debate,\nto examine alternatives, to make decisions. There were remarks such as these:\n\"We came to vote and never had a chance.\" \"It was all cut and dried.\" \"Too\nmuch power politics.\" \"I didn't feel like a participant, just an observer.\"\nThere is too much truth in these observations. Much of the time in the\nbusiness sessions was consumed in reporting -- an exercise that might better\nbe limited to delivering oral briefs of written reports. This arrangement\nwould leave more time for discussion and interchange -- for the reverberant\naspect of the convention I described last month. Perhaps an hour might be\nset aside solely for the purpose of interrogation by the membership of its\nofficers (a lively feature of the Norman meeting).\nUnquestionably, more time could and should be reserved in future con¬\nventions for business sessions conducted in a thoroughly professional fashion\nwith time effectively utilized for group consideration and decision mailing.\nWe will continue to try to improve each convention over its predecessor. How¬\never, in my judgement, a convention by its very nature can never be an ade¬\nquate mechanism for thorough study and analysis of the organization convening.\nThe pressures of a three-day program of varied activities is not conducive to\nprobing in depth, to giving deliberate consideration, to making conscientious\nchoices and clear judgements, to developing creative group thinking, to shap¬\ning self-destiny. And yet, every now and again, these kinds of functions need\nbeing done.\nAny mature association must have some sort of self-correcting feed-back\nmechanism which helps it to change directions in response to unanticipated\nconditions or in recognition of unproductive programs. It must also develop\nthe means for orderly correction of recognized shortcomings.\nA part of these functions can be fulfilled at the national convention, in\nregional conferences, via the committee and board structure, and through cor¬\nrespondence and personal interviews. But these approaches only partially do\nthe job I am thinking about: a full-scale examination and agonizing appraisal\nof the NAEB itself."
}