{
  "id": "d1753-4",
  "text": "the stations. If you feel you have been wronged when\nyou receive your statement, please feel free to tell us\nso, and we’ll try to trace the source of our differences.\nINTERNATIONAL MUSIC COUNCIL\n—Keith Engar\nThe Annual Conference of the International Music\nCouncil was held May 22 to 25 in Paris at UNESCO^\nThe purpose of the IMC is to promote the broadcast¬\ning of contemporary music in many countries. The\nmajor motive is to provide encouragement for young\ntalent by giving it a hearing on several broadcasting\nsystems through major, live concerts. Fourteen na¬\ntions sent delegates representing major radio organ¬\nizations. With the able assistance of Mr. Noel Lee,\na young composer touring Europe, and qualified to\npass on technical musical problems, I represented the\nNAEB.\nThe conference was divided into two parts called\n“Selection5 and “Tribune ” “Selection” was a com¬\npetition to choose the best contemporary symphonic,\nmedium ensemble and chamber work broadcast dur¬\ning the preceding year. Each country was entitled to\nsubmit one work in each category and the delegates\nacted as jury. According to IMC rules, the three\npieces chosen were to have been given a major “live”\nbroadcast concert in each country during the coming\nyear, but no work in any category received the es¬\nsential two-thirds majority vote, so the IMC had to\nbe content with recommending that the works be per¬\nformed.\n“Tribune” was designed to give young composers\nan opportunity to be performed in several countries.\nEach delegation was entitled to submit scores of five\nworks placed within the three categories (symphonic,\nmedium ensemble and chamber). The delegation ex¬\namined the scores, then arranged submissions into\neleven concert programs in a concert for broadcast,\nor as an alternative, choose selected works from\namong the total list for the equivalent of two con¬\ncerts. IMC rules require that all music should be per¬\nformed “live,” and whenever possible, in public con¬\ncerts introduced by a spoken commentary. However,\nit is permissible to broadcast a recording of the entire\nconcert.\nDetails of the compositions will be available\nshortly from the IMC. Since this is the NAEB’s first\nyear, the project needs to be explored very carefully.\nObviously there is a great promise in it.\nTotal AM stations - 3065 (includesQ36 non-commercial)\nTotal FM stations - 668 (includes f36 non-commercial)\nTotal TV stations - 543 (includes 24 non-commercial)\nNEWS FROM MEMBERS\nGENERAL\nThree officials from neighboring states recently\nvisited the Alabama ETV Network in Birmingham\nto conduct studies in educational television.\nThey are Hill Bermont, production manager of the\nUniversity of Georgia 3-million-dollar Kellogg Center\nfor Continuing Adult Education; Mrs. Wanda John¬\nston, supervisor of audio-visual education of the\nKnoxville (Tenn.) Board of Education for City\nSchools, and from the same Board, Mrs. Penny Wind¬\nham, director of radio education broadcasting in¬\nstruction and city-owned FM station.\nMr. Bermont commended those Alabama officials\nwho “had the foresight and initiative to design a net¬\nwork for ETV across the state as soon as the FCC\nmade the channels available.”\nHe also expressed confidence that the pattern set\nby Alabama will be followed throughout the nation.\n► The Metropolitan Educational Television Assn,\nin New York City reports the receipt of a $100,000\ngrant from the Fund for Adult Education. The\nmoney was given for the purchase of TV equipment\nfor META’s production center now under construc¬\ntion in the Carnegie Endowment Building.\nThe grant has a provision whereby META can\nqualify for an additional $50,000 if it proceeds to¬\nward an on-the-air operation.\n► The Abilene Christian College in Texas has just\ncompleted its 17th consecutive year of broadcasting\nactivity, according to Dr. Lowell G. Perry, radio di¬\nrector of the College.\nAmong the accomplishments mentioned in his\ncumulative four-year Report for 1953 through 1957,\nDr. Perry announced the providing of educational\nprograms to schools and communities, the placement\nof students in the radio industry and plans for the\naddition of TV.\nPERSONNEL\n► Two prominent men in the radio-TV field received\nprofessorships at the Michigan State University’s De¬\npartment of Speech.\nThey are Walter B. Emery, general consultant\nfor the Joint Council on Educational Television and\nJ. Colby Lewis III, production manager of WTTW-\nTV in Chicago. Their appointments will take effect\nAugust 1 and September 1 respectively.\nTEACHING BY TV\nTo determine whether typing can be taught as ef¬\nfectively on TV as in the classroom, the Indiana Uni¬\nversity in Bloomington, Ind., has begun an eight-Aveek\ntyping course on WTTV (Channel 4). The course is\nJULY, 1957\n5"
}