{
  "id": "d1094-2",
  "text": "3\nIowa State College ....\n-low a.Stated elevision and FM development 1b> awaiting the outcome of a\nsituation in which the FCC wants a taller tower erected, and CAA wants one with less\nheight. The blessings of both are needed.\nVvOI is stepping into the gap as the college breaks its 46 year old tradition\nof holding a \"Farm and Home Week” meeting on its campus. Housing and food dif-\nfioulties caused its cancellation. The entire program this year will be carried\non by radio-overWOI. , , ,\nWith the approval it is seeking from KFl to operate after sundown at specified\ntimes, WOI hopes\"to broadcast certain evenings.\nKWSC - Washington State College, Pullman. _\n-Programs to promote public education in Washington are being carnea by KWSC,\nthrough WSC School of Education. Notices to listen were sent home via school .\nchildren in the station’s service area, newspaper stories were released, and window\nposters were put out.\nYiIBAA-- Purdue. . .\n-Studio and'\"office expansion plans, which have been held up because of materials\nshortages, are now being rushed under the supervision of Chief Engineer Townesly\nThe FM amplication is still in the waiting stage.\nPERSONNEL NOTES\nTom Taber, WrKAR, will become educational program director for WILL on\nJanuary 1, 1947.\nDick Ross is now KWSC chief announcer. He hails from Spokane and stations\nKFPY and KFIO.\nOur sympathv to Jim Miles of WBAA on the sudden death of his father on\nNovember 19.\nRalph Townesly, WBAA Chief Engineer, is back on the job after 3g years m\nthe army.\nH. B. McCarty, WHA, Radio Chairman for the National Congress of Parents and\nTeachers, attending the New Orleans conclave of the organization—early December.\nFACILITIES AND FCC\nWRUF (University of Florida) granted extension of special service authorization\nto operate unlimited time with 100 watts power. (November 13)\nOklahoma A&M College (Stillwater) granted CP for new daytime station on 840 Kc\nwith 10 Kw power. (November 15)"
}