{
  "id": "d985-27",
  "text": "The University of Texas\nBUREAU OF RESEARCH IN EDUCATION BY RADIO-TELEVISION\nAUSTIN\nGALE R. ADKINS, DIRECTOR\nMarch 4, 1956\nRECEIVED\nNAEB HEADQUARTERS\nMAR G 195S\nAM PM\ni?1?1?|WM2|1|2|3|4|6|?\nI\nI want to thank yon for sending me your remarkably fine\ndigest of the Hovland book, Communication and. Persuasian. The\nmaterial reached Austin almost by the time I di&7 I have now bought\na copy of the book and am very pleased with it. It is interesting\nthat the digest remains useful even with the book at hand. I am re¬\nturning to your files the typed copy you sent to me.\nYour digest of the TV Issue of The American Psychologist has\nstarted something. This must continue\"! Among the journals there\nare frequently issues devoted to television, international broad¬\ncasting, audio-visual aids, communications, and the like. Digests\nsent out with Newsletter mailings, is the ideal way to inform the\nmembership concerning special issues of various journals. After\nreading your digest of The American Psychologist* I ordered a single\ncony and found it so useful that I reoudsted each member of one of\nmy classes to buy the issue. As you said, it’s \"required reading\".\nWould it be desirable to review pertinent special issues of\njournals as a regular part of your Fact Sheet Service? If you should\ncontinue to distribute some unusually important digests free of\ncharge, you would also be plugging the Fact Sheet Service. Incidentally,\nI was glad to see a Fact Sheet devoted to the AERT Journal in December.\nMustn't become maudlin about this thing, but I owe still another\nthank you. After our recent committee meeting, you gave up a hard-\nearned Sunday morning to take Ed andne to the TV station and the bus\nterminal. It was interesting to see the changes that had been made at\nthe studio since the first production workshop. I certainly want you\nto know that your hospitality was appreciated.\nGale R. Adkins\nDirector\nDr. Harry Skornia\nNAEB Headquarters\n14 Gregory Hall\nUniversity of Illinois\nUrbana, Illinois\nDear Harry:\nGEAjpf"
}