{
  "id": "d985-48",
  "text": "BACKGROUND OF THE PROJECT\nThe members of the Washington County Board of Education and its Staff were planning\na new senior high school and felt that any new construction should include facilities for\nthe effective use of radio and television. They began a study of what to install in the\nway of conduits, duct work and flexible space in order to take advantage of future\ndevelopments. Their study convinced them that television offered tremendous possibil¬\nities for improving instruction. Inquiries directed to building construction consultants,\neducation consultants, manufacturers, commercial television groups and agencies in¬\nterested in the advancement of education served the double purpose of securing infor¬\nmation and making known the local interest in using television for instruction. The\nmembers of the Board of Education thus became well informed about the developments\nin educational television and more interested than ever in including adequate facilities\nfor its installation in new buildings. As a result of these investigations the county be¬\ncame one of the several hundred school systems which were planning to make some use\nof television for instructional purposes. Numerous experiments were being conducted\nthroughout the country to test the effectiveness of television as an instructional device.\nIt was evident that the results, while fragmentary and incomplete, indicated that the\npotentials of televised instruction were tremendous.\nIt was then that the professional organization of the electronics industry. The Radio-\nElectronics-Television Manufacturers Association (RETMA), and The Fund For The Ad¬\nvancement Of Education decided to unite in sponsoring a comprehensive project to study\nthe ways of using television for instructional purposes, to determine the contributions of\ntelevision to the solving of current educational problems, and to evaluate the results.\nIt was decided to offer the opportunity of making such a study to a typical school system.\nA system was to be selected that was not too large or too small; that included urban and\nrural areas, with manufacturing, general businesses and farming; that operated kinder¬\ngarten and junior college; that was developing an adequate building construction pro¬\ngram; that had done some work in curriculum development; and that had enlisted the\ninterest and support of parents and citizens in the educational program.\nWashington County deemed itself fortunate in having the opportunity to submit a proposal\nof what would be included if given the opportunity to develop such a project.\nThe project that was proposed provided for a five year study using television for direct\ninstruction in all the basic subject matter areas of the curriculum as well as defining the\nopportunities for its supplemental use. The plans also provided for initiating the pro¬\ngram in 8 schools in Hagerstown in September 1956 and extending to all 48 schools in\nthe county by September 1958.\nThe proposal of the Washington County School System for developing a Closed-Circuit\nTelevision Project was accepted by the joint sponsors on May 24, 1956. The project\nwas officially approved by the entire RETMA organization at their annual meeting in\nChicago in June 1956 where appropriate resolutions were adopted. A press conference\nto announce the project was planned with the help of officials from The Fund and RETMA.\nThe conference was held at the Hotel Alexander, Hagerstown, on June 26, 1956. It\nwas followed with a luncheon meeting at the Lincolnshire School, sponsored by the\nHagerstown Chamber of Commerce and attended by representatives of The Fund, RETMA,\nthe press, national educational organizations, community organizations and presidents\n-2-"
}