{
  "id": "d985-55",
  "text": "Since the classroom teacher deals mainly with class organization and the personal prob¬\nlems of the pupils, it was felt that a larger number of pupils might be grouped in the class¬\nrooms. It was decided, therefore, to vary the class size and note the results.\nPlans were then made to have members of the regular teaching staff use television\nfor direct instruction in the following areas:\nAdvanced Senior English\nGeneral Senior English\nU. S. History - Grade 11\nGeometry - Grade 10\nGeneral Science - Grade 9\nScience - Grade 6\nArithmetic - Grade 5\nSocial Studies - Grade 4\nMusic - Grades 4, 5, and 6\nArt - Grades 4, 5, and 6\nArt - Grades 1,2, and 3\nReading Experiences - Grades 1\nNumber Experiences - Grades 2\nEdward C. Kercheval\nMrs. Jane S. Guyton\nLouis E. Tuckerman\nAllan R. Powell\nJames K. Davis\nM. Eugene Mittel\nMrs. Mildred C. Vance\nRobert R. Hull\nMrs. Josephine B. Clopper\nMrs. M. Louise Davidsen\nBruce Etchison\nClyde H. Roberts\nand 2 Jane L. Cushen\nand 3 Mrs. Barbara C. Hull\nOutlines of the general framework of the lessons were developed for each instructional\narea to be included in the television program. Classroom and television teachers worked\ntogether in preparing guide material to be used in their joint handling of the lessons.\nIt was agreed to expand this material at the team meetings during the year in keeping\nwith pupil interests and the revisions suggested by the teachers.\nA feed back sheet for the classroom teacher to use in evaluating the television lesson\nwas prepared and distributed.\nThe last ten days of the workshop were spent in using simple vidicon equipment for the\npresentation of sample lessons. Each lesson was followed with an evaluation session and\nin a number of cases the lessons were retaught using the suggestions that had been made.\nThe Chesapeake and Potomac Telephone Company of Maryland, with the technical\nadvice of the Bell Laboratories, developed the system of communication for transmitting\ntelecasts to the schools participating in the television project. The cable connecting\nthe schools was installed prior to the beginning of the 1956-57 school year. Over\n65,000 feet of cable and 22 amplifiers are used to send the television signals through\nthe circuit. The entire installation was completed in approximately one month by\nengineers and construction and maintenance workers of the Telephone Company.\nIn the first phase of the project, the closed-circuit cable links the following schools:\nNorth Hagerstown High School\nSouth Hagerstown High School\nAntietam Street Elementary School\nBroadway Elementary School\nHoward Street Elementary School\nPangborn Boulevard Elementary School\n-9-"
}