{
  "id": "d985-62",
  "text": "Apart from technical advantages, the television teachers have more time to plan the lessons\nand prepare materials. This is a tremendous advantage and the television teachers are\nnoting an improvement in the quality of their lessons as they become more aware of the\nfactors that make for more effective teaching. Teachers are receiving great satisfaction\nfrom having the opportunity to develop their ideas and plan creative activities.\nThe following are successful examples of ideas developed by the television teachers:\n1 . Using two channels to teach geometry, one channel for constant reference to the\nproblem and figure, the other for solving the problem\n2. Using elastic bands on peg board to create geometric figures\n3. Fading in and out the important words or sentences that help explain the action taking\nplace\n4. Constructing charts and models with movable parts that explain the ideas being\npresented\n5. Using a magnetic board for developing a lesson\n6. Originating a \"capsule classroom\" of a few representative pupils for a class discussion\nproject\n7. Using puppets to present an idea\n8. Developing special three dimensional visuals to illustrate such concepts as - Balance\nof Trade, Election Platforms, Foundations of Federal Government, Growth of the\nTariff\n9. Interviewing citizens of the community who are engaged in representative occupations\nor professions\nIn addition, the television facilities have been used for:\n1 . Providing information to pupils about the selection of a college (program each week\npresented by two different college groups.)\n2. Helping seniors fill out the forms of the U. S. Employment Service.\n3. Presenting Armed Service information to pupils by means of a panel of six representatives\nfrom the branches of the Armed Forces.\n4. Presenting foreign language panels in both the Spanish and French languages by natives\nfrom Argentina, Guatemala, Mexico, Nicaragua, Paraguay, Peru, and Cambodia.\n5. Presenting programs of speaking, singing, and dancing by 22 representatives from 13\nforeign countries.\n-15-"
}