{
  "id": "d1866-0",
  "text": "NEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. 29, NO. 7 JULY, 1964\n40 Exhibit Booths Sold\nFrank Masters, convention exhibit manager, announced in\nearly June that 40 of the 60 booths allotted for the NAEB\nconvention had been sold. (Last year there was only room for\n41 booths total.)\nDeadline Nears for Convention Bids\nJuly 31 is the deadline for receipt of formal bids from West¬\nerners who want to have the 1967 NAEB convention in their\ncities. Bids should be submitted to the Washington office. In¬\nformation to be included in the bids is listed on page 1 of the\nJanuary Newsletter.\nEither Kansas City or Cincinnati will host the 1966 con¬\nvention. Which, will be decided during the summer.\nOhio State Award Winners\nEducational stations won about half the 1964 Ohio State\nawards, except in the category “Radio for Adults,” in which\nWRVR, Riverside Church, New York, was the only educa¬\ntional station receiving an award. WRVR also won an award\nin the “Radio for Children and Youth” category. Other non¬\ncommercial station winners here were WNYE, New York\n(three awards); WBAA, Purdue University; and KPFK,\nLos Angeles.\nETV stations winning “Television for Children and\nYouth” awards were WSIU-TV, Southern Illinois University;\nWNDT, New York; WGBH-TV, Boston; KQED, San\nFrancisco; and KNME, Albuquerque.\nEducational producers of award-winning programs for\n“Television for Adults” were Western Michigan University\nTelevision; WNDT and New York City Board of Educa¬\ntion; University of Michigan TV Center; South Carolina\nETV Network; and WGTV, University of Georgia.\nThe Canadian Broadcasting Corporation won in all cate¬\ngories except TV for adults.\nNAET Organizes\nEmphasizing that it does not consider itself in conflict with\nany existing educational broadcasting association and does\nconsider that its work will be complementary to that of the\nNAEB, the National Association for Educational Television\ncame into being May 18. Charter members are the Alabama\nETV Commission (Ray Hurlbert, general manager, NAET\npresident), the Oklahoma ETV Authority (John Dunn, di¬\nrector, NAET vice president), and the Twin City Area ETV\nCorporation (John C. Schwarzwalder, general manager, NAET\nsecretary-treasurer).\n“Membership in the new association is open to all con¬\ncerned with educational broadcasting,” Schwarzwalder said.\nHe stated the purpose of the new organization: To provide\nETV stations and other groups concerned with production\nand use of ETV programs with a means of insuring a united\napproach to problems of legislation, research, production, and\nfinance.\nPlan Women's Activities for Convention\nNAEB wives attending the 1964 convention with their hus¬\nbands in Austin October 25-28 will be able to participate in\nthe following:\n• Tour of the Texas capitol.\n• Coffee at the governor’s mansion.\n• Visit to University of Texas campus, including the breath¬\ntaking view from the 30-story library tower.\n• A milk punch brunch at Green Pastures, a plantation house\nlong noted for its hospitality.\nWrite NOW for Football Tickets\nNAEBers planning to attend the football game after the con¬\nvention should write for tickets now. The University of Texas\nwill play Southern Methodist University October 31 in Aus¬\ntin.\nAugust 1 is the absolute deadline for writing for tickets,\naccording to local committee chairman Harvey Herbst. Write\nto Football Ticket Manager, P. O. Box 7399, University Sta¬\ntion, Austin, Texas, 78712—and enclose a check for $4 for\neach ticket ordered.\nMembers to Receive Publications Discount\nBeginning August 1, NAEB Individual Members in good\nstanding will be allowed a 25% discount on NAEB publica¬\ntions orders of $1 or more. This does not include the Fact\nSheets or the periodicals (Journal, Newsletter, Washington\nReport), but does apply to all other NAEB publications.\nNote on Committee Listings\nOn the list of committees and members which appeared in\nthe June Newsletter, the year following each name indicates\nthat the term expires December 31 of that year. Chairmen are\nappointed for one year.\nFulbright Grants Include ETV\nNorway and the United Kingdom offer awards in ETV for\n1965-66 in the current listing. The University of Oslo offers\na research award in ETV. Those in the United Kingdom are\nlecturing awards—two affiliated with universities and/or other\ninterested institutions, two with teacher-training colleges.\nWhile these are the only two countries specifically men¬\ntioning educational broadcasting, several countries will accept\napplications in any field. August 1 is the deadline for all en¬\ntries. Details and application forms from: Committee on In¬\nternational Exchange of Persons, Conference Board of Asso¬\nciated Research Councils, 2101 Constitution Avenue, Washing¬\nton, D.C., 20418.\nHenry Speaks at Washington ETV Meet\nIn speaking before the Washington State ETV Association in\nMay, FCC Chairman E. William Henry urged ETV stations\n1"
}