{
  "id": "d719-38",
  "text": "An Investment in the People—Ed ucat zonal Television - Page 2\nBut first, since this is my last report, I want to thank\nall op the listeners in Delaware who have heard my bimonthly\nBROADCASTS, AND ESPECIALLY I WANT TO THANK YOUR RADIO STATION\nWHICH HAS MADE THESE PUBLIC SERVICE BROADCASTS POSSIBLE.\nOn May 12 and 15, 1959, hearings were held before the\nSubcommittee of the Committee on Interstate and Foreign\nCommerce on a number of bills, including one which I had\nINTRODUCED ON THE SUBJECT OF EDUCATIONAL TELEVISION*\nOn April 15, 1959, the Senate had passed such legislation\nINTRODUCED BY SENATORS MAGNUSON AND SCHOEPPEL. I AM GOING\nTO QUOTE TO YOU FROM THE TESTIMONY OF TWO PROMINENT EDUCATORS\nWHO TESTIFIED BEFORE THE COMMITTEE. THEIR VIEWS COINCIDE\nWITH MY VIEWS ON THIS IMPORTANT AND VITAL NEW MEDIA WHICH IS\nAVAILABLE TO THE AMERICAN PEOPLE, AND MORE SPECIFICALLY OF\nINTEREST TO DEAL WAREANS IS THE ASSIGNING OF THE NOW SILENT\nCHANNEL 12 TO DELAWARE FOR EDUCATIONAL TELEVISION BROADCASTING.\nRaymond D. Hurlbert, general manager of the Alabama Edu¬\ncational Television Commission, had this to sayt\n\"Many of you are familiar with U*S. Chamber of Commerce\nstudy, 'An Investment in the People♦ * This study points out\nthat it is not the country or the State with the greatest\nnatural resources which has the highest per capita income,\nBUT THE ONE WITH THE HIGHEST LITERACY, THE BEST EDUCATED PEOPLE•\nOur State is rich in natvral resources, but our great need is\nTO RAISE THE PER CAPITA INCOME THROUGH EDUCATION.\n\"We ARE ON THE THRESHOLD OF TREMENDOUS ADVANCES IN THE\nFIELD OF EDUCATION. SHOULD WE ASK THE QUESTION, MAS THE TIME\nCOME FOR UPDATING THE EDUCATIONAL SYSTEM OF SCHOOLS IN AMERICA\nAND IF SO, AS AN AID, DO WE NOT HAVE AN AVAILABLE TOOL IN\nEDUCATIONAL TELEVISION? In FACT, WE HAVE A PROVIDENTIAL TOOL\nTO HELP MAKE THE HURDLE OF LEAPING FROM THE TRADITIONAL TO\nTHE MODERN NEEDS IN EDUCATION. WHAT DOES INDUSTRY DO WHEN IT\nIS TIME FOR A RETOOLING JOB? Is NOT EXPENSE FOR RETOOLING CON¬\nSIDERED ESSENTIAL IN THE LIGHT OF FUTURE EFFICIENCY AND GREATER\nPRODUCTION, AND ARE NOT NEK METHODS INAUGURATED? THERE IS NO\nQUESTION AS TO WHAT BUSINESS WOULD DO IN SUCH A CASE. SHOULD\nWE NOT APPLY JUST AS MUCH GOOD BUSINESS TO THE EDUCATION OF\nOUR YOUTH? AS STOCKHOLDERS IN THIS BIG BUSINESS OF EDUCATION,"
}