{
  "id": "d1717-0",
  "text": "Vol. IV, No. 14 DuPont Circle Building, Washington 36, D.C. September 20, 19£>3~\nEDUCATIONAL PM RADIO STILL GROWING\nAccording to figures compiled by Dr. Larry Frymire, Chief, Educational\nBroadcasting Branch, FCC, new educational radio stations have been going on the air\nat an average of one a month for the past three years.\nLatest developments indicate that this trend will continue. C.W. Post College\nof Long Island Univ., Brookville, N.Y., was granted a CP on August 29, for a new\neducational FM station to operate on 88.1 me; ERP 125 v; antenna height 185. The\nUniv. of South Florida, Tampa, Carmel-Clay Schools, Carmel, Indiana, and Earlham\nCollege, Richmond, Indiana, have all applied for licenses to cover construction\npermits granted earlier for new educational PM stations. Also, the Univ. of Scranton\n(Pa.) has applied for a license to operate a noncommercial educational PM station on\n89.9 me, ERP 1.35 kw.\nFRYMIRE ACCEPTS PERMANENT FCC POST\nThe FCC announced (Sept, k) that Dr. Lawrence Frymire has accepted permanent\nappointment as Chief of the Educational Broadcasting Branch of the FCC. He had been\nserving in that capacity since September 1, 1962 on a temporary basis while on leave\nfrom Michigan State Univ. Frymire has resigned from MSU where he was associate pro¬\nfessor of communications and manager of WKAR and WKAR-PM. He had been connected with\nthe university since 1944. Frymire indicated that he will continue his attempts to\nbring about a more efficient and smoother relationship between the Commission and\neducational broadcasters.\nSTANLEY APPOINTED TO USOE ETV POST\nRaymond J. Stanley has been appointed as the director of the ETV Facilities\nprogram in the U.S. Office of Education. In this capacity he will be responsible for\nthe processing of applications for ETV grants. This part of the program is adminis¬\ntered in the Bureau of Educational Assist. Programs of the USOE.\nStanley was for many years associated with the Wisconsin State Broadcasting\nservice, first as production director of radio, then of television. He directed\nseveral Ohio award winning radio programs for WHA and was the producer of such\nnationally-distributed WHA-TV programs as \"The Friendly Giant\" and \"Great Plays in\nRehearsal.\"\nRecently he has been in charge of WOSU-TV, the Ohio State University, and for\nthe past two years has served as Acting Director of the IERT.\nSECOND ETV STATION FOR CHICAGO: RECEIVED HEW FUND GRANT\nOn September 11, the Chicago Educational Television Association was granted\na CP for a new noncommercial educational TV station to operate on Channel *20; ERP\n431.5 kw visual and 216 kw aural; antenna height 600 ft. The Chicago Educational\nTelevision Association also operates educational station WTTW on Channel *11 in"
}