{
  "id": "d1717-15",
  "text": "-16-\nWNYC OFFERS 1,3th ANNUAL AMERICAN MUSIC FESTIVAL\nFor the thirteenth consecutive year New York City’s WNYC devoted most of its musical\nprograms between Lincoln’s and Washington’s birthdays to music by American composers.\nAnd in return for thus serving the cause of American music the station reeeived-~in\naddition to the approval of its listeners--a citation from the Koussevitzky Music\nFoundation3 the lead musical article in the Sunday New York Times while the festival\nwas in progress., and a citation from Broadcast Music Incorporated..\nOver 100 Programs of American Music Broadcast\nThis year3s festival presented premiere performances of more than 5>0 new works by\nAmerican composers0 In addition, there were 16 free public concerts at such locations\nas Carnegie Hall, Town Hall, Carl Fischer Concert Hall, Brooklyn Museum, Cooper Union,\nQueens College Auditorium, Third Street Music School Settlement, McMillan Theatre of\nColumbia University and the Auditorium of the Fifth Avenue Public Library\nAltogether WNYC broadcast more than 100 programs devoted to various types of American\nmusic ranging from symphonies and chamber music to jazz and folksongs during this\neleven-day periodc In addition to many special programs there were such regular\nWNYC features as the Masterwork Hour, Sunrise Symphony, Juilliard Concert, Behind the\nScenes in Music, Chamber Music Time, Young America Plays and Young American Artists„\nIn his preface to the January-February Masterwork Bulletin of WNYG programs, Seymour\nNo Siegel, Director of Radio Communications for the City of New York and NAEB presi¬\ndent, pointed out that \"in the past dozen years, more American composers have had\ntheir works performed on WNYC more times than on any other radio station in American\nMany compositions which had first performances during one of the Festivals have\nreached the status of accepted roles in the repertoires of large symphony orchestras„\nYoung composers whose names were first mentioned on VJNYC have become familiar to\nmusic lovers throughout the country» And New Yorkers, themselves, are proud of an\nannual event which has become part of the cultural life of the City°\"\nWNYC offered a Festival booklet to its listeners listing the compositions, composers,\nperforming musical groups, location of free public concerts, and special Festival pro¬\ngrams o It was available free to those sending a large self-addressed stamped envelope\nto the stationo Free tickets to 13 of the 16 public concerts were also distributed.\nSeries Distinguished by Very Wide Repertoire.\nSome idea of the range of music broadcast during this eleven-day period may be gained\nfrom the incomplete composer list which follows* Marcel Grandjany, Elie Siegmeister\n(premiere of Symphony No, 2), George Kleinsinger (premiere of Cantata, Farewell to a\nHero), Bergsma, Norman Bello Joio, Walter Piston, Frederick Jacobi (Violin Concerto),\nWilliam Schuman (Quartet No0 1*), Aaron Copland (Sextet), Phillip James, Virgil\nThomson (\"Bayou” from Louisiana Stoiy), Samuel Barber (Violin Concerto), Ross Lee\nFinney (Quartet No. 6), and Douglas Moore (Devil and Daniel Webster).\nKoussevitzky Citation Given to WNYC\nOn the afternoon of February 13 WNYC received an award for \"public service in music\"\nat one of the concerts of the American Music Festival. The award was the first of\nits kind to be offered by the Koussevitzky Music Foundation, and was given to the\nstation’In recognition of its distinguished service to American composers and its\noutstanding contribution to the cause of contemporary musico\""
}