{
  "id": "d1717-34",
  "text": "In-School Programs\nWe are proud to announce that In-School programs are now a regular part of the Tape\nNetwork service. School programs will be distributed twice a year* The current offer¬\nings are designed for use the first semester of the 19^2-£3 school year. Programs for\nuse during the second semester will be circulated prior to the close of the present\nschool year.\nPlans are also being considered whereby school programs will be available for audition\nduring the Ohio State Institute and the annual NAEB convention.\nNAEB DISPLAY\nThe most attractive exhibit on display at the Third National Conference sponsored by\nthe United States National Commission for UNESCO described the activities of the NAEBo\nThe display was designed and built by the Art Department of the University of Illinois\nPress.\nAfter some minor adjustments and repairs are made it is planned to tour the exhibit\naround the caitpuses of some of the member institutions. It will also be used at the\nOhio State Institute.\nWe sincerely hope you will have an opportunity to see this striking exhibit.\nPROGRESS ON THE DUPLICATORl\nAfter many months of futile waiting we have seized the bull by the horns and have be¬\ngun to build a mass duplicator! Plans are still in the preliminary stage so there is\nreally little to report. We mil keep you informed of our progress. We are most\nhopeful!\nRESEARCH REPORT\nPrepared by Dallas Smythe\nNAEB Director of Studies\nUniversity of Illinois, Urbana\nThe Grand Design; Some Operational Notes\nIn our perpetual search for suggestions as to how best to serve the research interests\nof educational broadcasters, we recently asked the officers of the NAEB to react to the\ncontents of this column in recent months. The prevailing view received was that while\nit was all right to review books thought to be of special interest to broadcasters,\nwhat broadcasters really need most is practical suggestions for conducting surveys—pre¬\nsumably audience surveys. We have pondered this answer and have come up with a com¬\npromise policy for the next few columns at least. We will try to intersperse f,helpful\nhints” on survey methods with book reviews. Before pursuing this course, there are a\nfew things to be said about its implications."
}