{
  "id": "d1717-35",
  "text": "What is involved here is more than sirrply sound policy for this modest column. It is\nthe relation of the educational broadcaster to research,, When \"Research'5 is thought\nof solely in terms of \"how to conduct audience studies\" the educational broadcaster,\nhimself not a survey expert, appears to find it quite easy to acknowledge the pertin-\nence of this kind of research suggestion. Of course this is all to the good,, so far^\nas efficiency in station operation is concerned. And we will try to satisfy this felt-\nneed.\nHowever, there is much more in \"research\" for the educational broadcaster than thus\nmeets the eye. In fact, we make so bold as to assert than an easy faniliarity with\nthe main trends in social science research is an essential part of the equipment of\nthe educational broadcaster. In recent months we have heard much talk (most of it\nvery loose) which revolves around the notion of the educational broadcaster acting^\nas a social scientist in the program area. I call this loose talk because it implies\nthat the educational broadcaster is in fact acting as a social scientist when he adopts\na program devised by one particular social scientist. A more accurate view might be\nthat the broadcaster is acting as a social scientist when he includes in his program\nstructure material which reflects (a) the diversity of analytical concepts provided\nby the whole body of social scientists, and (b) a balanced application of the most\nsignificant of these concepts to the problems of his various \"publics.55 You will note\nthat this view of the responsibility of the broadcaster as a social scientist, is para!\nlei to the responsibility of the social science teacher in the classroom, as this is\ntraditionally and wisely formulated. That is, the broadcaster (or teacher) In the\nsocial sciences should present reasonably to his students alternative methods of at¬\ntacking the problems in his subject matter area, and should help the students work\nthrough the application of the significant methods.\nWhile we are diverted on the present discussion of concepts, however, let us take a\nlook at still another facet of the function of the educational broadcaster as it is\naffected by research. We have already argued that the educational broadcaster should\ncarry a heavy load as a broadcast-teacher of the social sciences. Now I should go\nfurther and argue that he should view his institution and its \"grand design\" through\nsocial scientific glasses. What is implied in this statement?\nOne could lay out the logic in general terms like this. An educational institution\n(of higher learning, especially) is set off from other social institutions by one dis=\ntinguishing marks its perpetual quest for knowledge, which in operational terras Is\nsynonymous ’with the concept of research. The broadcaster in the educational institu¬\ntion is responsible for bringing his institution's work to the public.^ Therefore, he\nmust be capable of interpreting its work in terms of research. But this is too general\nto be very helpful. Letrs take a closer look at the problem.\nSince the first Allerton meeting in 19h9 the scope and structure of the educational\nbroadcaster's broad responsibility to his institution has been usefully referred to\nas the \"grand design\" of the educational broadcaster's program policy. But we have\nnot gone far beyond identifying the general c oncept and case studies exerrplifying such\ngrand designs as yet exist only in future hopes.\nAre case studies the best way of pinning down this elusive \"grand design\"? What al'\nternatives are there? One could proceed by gathering information on the administrative\norganization fand budget and educational policy) of all institutions of higher educa¬\ntion, or secondary school systems, or elementary school systems. This would be an\nenormous job, and would enmesh us deeply in the affairs of colleges of education which\nspecialize on such matters. Or, one could proceed by approaching the problem from a\ngeneralized theoretical point of view. This would entail an inquiry into educational\ntheory, itself a full-tire job as those who observe the recurrent furores over the\ntheories dealt with in colleges of education would attest. It would involve us in"
}