{
  "id": "d1717-37",
  "text": "-38-\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n19^2 Directory of Officers9 Consultants, and Committees\nOFFICERS\nPresident-“SEYMOUR No SIEGEL, WNYC, Municipal Broadcasting System, New York, No Y«\nVice-President— GRAYDON AUSMUS, WUOA, University of Alabama, University, Ala*\nSecretary and Publications Editor—BURTON PAULU, KUOM, University of Minnesota,\nMinneapolis, Minn«\nTreasurer—FRANK SCHOOLEY, WILL, University of Illinois, Urbana, Ill.\nDIRECTORS\nRegion I—PARKER WHEATLEY, Lowell Institute, Boston, MasSo\nRegion II— ALVIN GAINES, WABE, Board of Education, Atlanta, Ga.\nRegion III-WALDO ABBOT, WUOM, University of Michigan, Ann Arbor, Mich.\nRegion IV—RICHARD B. HULL, WOI, Iowa State College, Ames, Iowa\nRegion V—JOHN DUNN, WNAD, University of Oklahoma, Norman, Okla*\nRegion VI—ALLEN MILTER, KWSC, State College of Washington, Pullman, Washo\nCONS'ULTANTS\nDirector of Studies—DALLAS W. SMYTHE, Illinois University Communications Research\nInstitute, Urbana, ILL\nGeneral Counsel—MARCUS COHN, Cohn and Marks, Cafritz Building, Washington, D. Co\nNATIONAL HEADQUARTERS OFFICE\nExecutive Director—JAMES MILES, University of Illinois, 119 Gregory Hall, Urbana,\nILL\nTape Network Manager--RICHARD Lo RIDER, University of Illinois, 119 Gregory Hall,\nUrbana, ILL\nS TANDING COMMITTEES\nExecutive Committee\nGRAYDON AUSMUS, WUOA, University of Alabama, University, Ala.\nBURTON PAULU, KUOM, University of Minnesota, Minneapolis, Minn*\nFRANK SCHOOLEY, WILL, University of Illinois, Urbana, Ill.\nSEYMOUR. No SIEGEL (Chairman), WNYC, Municipal Broadcasting System, New York, NI»\nNetwork Acceptance Committee\nBURTON PAULlTTchaLrman), KUOM, University of Minnesota, Minneapolis, Minn.\nNORTHROP DAWSON, JR„, KUOM, University of Minnesota, Minneapolis, Minn.\nBERNARD BUCK, WNYC, Municipal Broadcasting System, New York, N Y,\nRAY STANLEY, JRo, WHA, University of Wisconsin, Madison, Wisconsin\nHo Eo SALLEY, WFPL, Louisville Free Public Library, Louisville, Ky,\nIn-Sehool Programs Committee\nALVIN' GAIN^~lTChairmSiy7 WABE, Board of Education, Atlanta, Ga.\nMARGUERITE FLEMING, KSLH, Board of Education, St. Louis, Mo.\nJAMES MACANDREW, WNYE, Board of Education, Brooklyn, N* Y.\nWILLIAM LEVENSON, WBOE, Board of Education, Cleveland, 0.\nJOHN HENDERSON, WBAA, Purdue University, Lafayette, Ind.\nMo MCCABE DAY, WVSH, School-City of Huntington, Huntington, Ind*"
}