{
  "id": "d1717-38",
  "text": "Research Committee\n“ “AIXlflCLLER ^Chairman), KWSC, Washington State College, Pullman,, Wash,,\nROBERT COLEMAN, WKAR, Michigan State College, East Lansing, Mich.\nKEITH NIGHBERT, KUSD, University of South Dakota, Vermillion, Sc Do\nLEG MARTIN, WBUR, Boston University, Boston, Mass.\nFoundation Committee\nGEORGE PROBST ^Chairman), University of Chicago, Chicago, Illo\nPARKER WHEATLEY, Lowell Institute, Boston, Mass.\nRICHARD Bo HULL^ WOI, Iowa State College, Ames, la.\nH: B, MCJARTY, WHA, University of Wisconsin, Madison, Wis.\nSEYMOUR N, SIEGEL, WNYC, Municipal Broadcasting System, New York, N. L\nRelay Network Committee\nWALDO ABBOTTChairman)«, WUOM, University of Michigan, Ann Arbor, Mich,\nPATRICIA GREEN, KBPS, Portland Public Schools, Portland, Ore,\nDON LIONS, WAER, Syracuse University, Syracuse, N. Y.\nand engineering representatives from WHA, WUSV, WOSU, and WGBH\nMembership Committee\nJOHN DUNN Tchairman), WNAD, University of Oklahoma, Norman, Okla.\nED ADAMS, KUOW, University of Washington, Seattle, Wash.\nLUCILE RUBY, WLSU, Louisiana State University, Baton Rouge, La.,\nVERNON MCKOWN, WNAS, New Albany City School, New Albany, Ind.\nAdult Education Committee\nGEORGE PROBS'fTChairman), University of Chicago, Chicago, Illo\nPARKER WHEATLEY, Lowell Institute, Boston, Mass.\nRICHARD Bo HULL, WO I, Iowa State College, Ames, la..\nHo B. MC1ARTT, WHA, University of Wisconsin, Madison, Wis.\nSEYMOUR N. SIEGEL, WNYC, Municipal Broadcasting System, New York, N. Y.\nConstibutton Committee\nPARKER WHEATLEY {Chairman), Lowell Institute, Boston, Mass.\nHAROLD ENGEL, WHA, University of Wisconsin, Madison, Wis.\nWALLACE GARNEAU, WMCR, Western Michigan College, Kalamazoo, Mich.,\nED BURROWS, WUOM, University of Michigan, Ann Arbor, Mich.\nWILLIAM PFEIFFER, WBGO, Board of Education, Newark, N. J.\nAudi ting Corrimi ttee\nGRAYDON AUSMUS (Chairman), WUOA, University of Alabama, University, Ala,\nFATHER MCLOUGHLIN, WFUV, Fordham University, Bronx, N. Y.\nJOHN DEPROSPO, WNYC, Municipal Broadcasting System, New York, N. Y°\nTelevision Committee\nRICHARD B. HULL (Chairman), WOI, Iowa State College, Ames, la.\n.ED STASHEFF, WNYE, Beared of Education, Brooklyn, N. Y.\nARMAND HUNTER, WKAR, Michigan State College, East Lansing, Mich.\nPARKER WHEATLEY, Lowell Institute, Boston, Mass.\nSEYMOUR No SIEGEL, WNYC, Municipal Broadcasting System, New York, N» Y.\nConvention Committee\nBURTON PAULUTChairman), KUOM, University of Minnesota, Minneapolis, Minn.\nCAMILLE HENDERSON, WBKY, University of Kentucky, Lexington, Ky.\nROBERT COLEMAN, WKAR, Michigan State College, East Lansing, Mich.\nWALDO ABBOT, WUOM, University of Michigan, Ann Arbor, Mich.\nALLEN MILLER, KWSC, Washington State College, Pullman, Wash."
}