{
  "id": "d1610-5",
  "text": "NAEB NEVS LETTER\nPage 6\nJune I, 5943\nTHAT EACH CAN BE EXPECTED TO CREATE - IN SHORT, THE PROBABLE REACTION ON\nTHE PUBLIC, HIS PARTICULAR PUBLIC, '\"8 THE DOCTOR KNOT'S THE PROBABLY REACTION\nOF THE REMEDY HE PRESCRIBES.\nTo THE EXTENT THAT THE GENERAL PUBLIC IS RADIO CONSCIOUS, THE RADIO BECOMES\nA VALUABLE INSTRUMENT. FOR THE COLLEGE PUBLIC RELATIONS COUNSEL* The COLLEGE\nCAN SCAT CELY EXPECT TO REMAKE THE DAILY PRESS* COLLEGES CAN SURVIVE AND\nPROGRESS ONLY AS THEY HAVE PUBLIC CONFIDENCE. As LONG AS MAJORITIES RULE\nIN THIS COUNTRY, WE MUST ASSUME THAT MAJORITIES ARE RIGHT* It FOLLOWS THAT\nTHE MESSAGE MUST BE ADAPTED TO THE AUDIENCE* To EDUCATE THE AUDIENCE TO THE\nCAMPUS VERNACULAR WOULD TAKE TOO LONS, EVEN IF IT ‘\"ERE WORTH DOING* By THE\nTIME THE LESSON WAS LEARNED THE AUDIENCE WOULD BE DISSIPATED* BETTER SPEA«\nTO IT AS A LANGUAGE YOU ARE SURE IT WOULD UNDERSTAND*\nHOW DOES A PUBLIC RELATIONS MAN KNOW HIS PUBLIC - BY READING EVERYTHING AND\nLISTENING TO EVERYTHING* NEWSPAPERS, MAGA71NES, AND RADIO ARE HIS FIRST\nAND MOST IMPORTANT SOURCE, SIMPLY BECAUSE THEY HAVE THE GREATEST FOLLOWING*\nMovies are close beside them. Whatever interests a large group, even a\nPRIZE FIGHT, HAS ASPECTS THAT THE PUBLIC RELATION’S MAN SHOULD KEEP FRESH\nIN HIS THINKING*\nHarold K* Schellenger: Several years ago when our football team was playing\nAN OUT-OF-TOWN GAME, I TOOK A TRIP TO A SECTION OF OHIO NEARLY |00 MILES\nDISTANCE FROM THE CAMPUS*\nIn THE COURSE OF THAT TRIP I STOPPED IN A SMALL TOWN DRUGSTORE FOR REFRESH¬\nMENTS* At LEAST 25 PEOPLE WERE GATHERED AROUND A RADIO, LISTENING TO THE\nBROADCAST OF THE GAME FROM OUR OWN UNIVERSITY STATION*\nThe game was good, but the broadcast was bad* The cro^-d was ridiculing the\nANNOUNCER* The thought went through my mind that this scene was NO DOUBT\nBEING REPEATED IN HUNDREDS OF OTHER CROSS-ROADS TOWNS THROUGHOUT THE STATE,\nAND I SLIPPED OUT OF THE DRUGSTORE DECIDEDLY ASHAMED OF OUR PUBLIC RELATIONS\nIN THE REALM OF ATHLETIC BROADCASTING*\nA FEW MONTHS AGO I WAS VISITING RELATIVES IN ANOTHER Oh 10 TO‘*N. THESE\nRELATIVES INVITED ME TOGO WITH THEM INTO THE COUNTRY TO VISIT A RETIRED\nSCHOOL TEACHER, A PLEASANT, INTELLIGENT WOMEN IN HER SEVENTIES. 1 WAS\nINTRODUCED TO HER AND MY UNIVERSITY CONNECTION WAS MENTIONED* Her FACE\nLIGHTED IMMEDIATELY.\nHl LISTEN TO YOUR RADIO STATION ALL DAY, AND I CAN1T TELL YOU HOW MUCH IT\nMEANS TO ME,11 SHE SAID* \"YOU MUST HAVE A WONDERFUL SCHOOL*®”\nThose two incidents, I believe, will emphasize the importance of radio in\nTHE TOTAL UNIVERSITY PUBLIC RELATIONS PICTURE* ONE ILLUSTRATES THE LIABILITY\nOF POOR PROGRAMS, THE OTHER THE DIVIDENDS TO BE GAINED FFO M GOOD ONES*\nFor MOST OF THE PEOPLE RIDICULING OUR BROADCAST IN THE DRUGSTORE*? FOR THE\nLONELY RETIRED SCHOOL TEACHER, AND FOR THEIR COUNTERPARTS THROUGHOUT THE\nSTATE, THE ONLY CONTACT THEY HAVE OR WILL HAVE WITH THE UNIVERSITY THEIR\nTAXES H--LP TO SUPPORT IS THROUGH THE RADIO STATION* THEY JUDGE THE WORTH\nOF OUR WHOLE UNIVERSITY BY THIS ONE CONTACT* » SUBMIT TO YOU THAT THE\nCONTACT IS, THEREFORE, A MOST IMPORTANT ONE*\nIt is my\nTHAT IT\nBELIEVE that EDUCATIONAL RADIO HAS HAD SUCH A TOnSY-LIKE GRO-TH\nHAS NOT BEEN INTEGRATED AS CLOSELY AS IT SHOULD BE WITH THE TOTAL"
}