{
  "id": "d1610-6",
  "text": "NAEB SEWS LETTER\nPfiGE 7\nJune I, 1943\nUNIVERSITY PICTURE FROM ALL STANDPOINTS, INCLUDING PUBLIC RELATIONS..\nWhile 1 believe that universities should make a sensible and reasonable use\nOF THEIR RADIO FACILITIES FOR DIRECT PROMOTION OF THEIR ACT I VIT1ES, THE\nGREATEST PUBLIC RELATIONS BENEFITS Wl LL BE GAINED BY INDIRECTIONo A RADIO\nAUDIENCE SOON Wl LL TIRE OF HAVING Y U TELL HOW GOOD YOUR INSTITUTION IS;\nIT WILL NOT BECOME WEARY OF HAVING YOU SHOW HOW GOOD YOU ARE.\nIN OTHER WORDS, A TALK ON THE OUTSTANDING OUALITIESOF YOUR MUSIC DEPARTMENT\nHAS A NEGLIGIBLE INFLUENCE COMPARED TO THE IMPRESSION GIVEN BY A PROGRAM\nPRESENTING THE STUDENTS AND FACULTY IN THAT DEPARTMENT, A TALK ON HOW GOOD\nYOUR DEPARTMENT OF ROMANCE LANGUAGES IS WON * T COMPARE IN PUBLIC RELATIONS\nVALUE AND DIVIDENDS WITH A GOOD SEF I ES OF RADIO BROADCASTS BY WIEMJ^IRS OF\nTHAT DEPARTMENT,\nAND YOU CAN * T CONVINCE YOUR LISTENERS THAT YOU HAVE AN OUTSTANDING FACULTY\nBY TELLING THEM SO, IF ON THE OTHER HAND YOU ARE USING FACULTY MEMBERS ON\nYOUR PROGRAM WHO MUMBLE AND FUMBLE IN THEIR RADIO PRESENTATIONS,\nIN SUMMARY, RADIO RIGHTLY USED CAN BE THE MOST IMPORTANT PUBLIC RELATIONS\nASSET OF THE INSTITUTION, It REACHES MANY THOUSANDS OF PERSONS WHO HAVE NO\nOTHER CONTACT WITH THE SCHOOL, IT HAS WITHIN IT THE POSSIBILITIES FOR GOOD\nPUBLIC RELATIONS, AND ALSO FOR BAD, It NEEDS TO BE INTEGRATED AS CLOSELY\nAS POSSIBLE WITH THE REST OF THE INSTITUTIONAL PROGRAM, RATHER THAN BEING\nPERMITTED TO GO ITS OWN WAY AS JUST ANOTHER DEPARTMENT OR BUREAU,\nWKldo Abbot: I* The University of Michigan has been broadcasting over\nCOMMERCIAL STATIONS SINCE 1925,\nA8 At present, over stations WJR, 50,000 watts, Detroit; WWJ, 5,000\nwatts, Detroit; WCAR, 1,000 watts* Pontiac\nB. Station WKAR, 5,000 watts, Educational station, Michigan State\nCollege, East Lansing,\nII; Public relations from the University standpoint, consist of interpreting\nthe University,\nA, Not necessarily to increase enrollment,\nB, This allows nearly evefy type of program.\n1, With the more powerful network stations, the formula is showman¬\nship AND INFORMATION,\n2, With the local commercial stations the formula is showmanship\nAND EDUCATION,\n3, With the education stations the formula is education and showman¬\nship,\nIII, Maintaining friendly relations with the commercial stations,\na. Select the station that you intend to stick by. D0n*t shop around,\nB, Be active in the station. Know everybody. Give club lectures, etc."
}