{
  "id": "d1451-1",
  "text": "NAEB-May-*-“2*\nsupport this rapidly developing agency for spreading education to the masses out¬\nside the colleges and universities.\n\"With the support that we are hoping to have from President Weeks and his many\nfriends, KUSD*may be able to secure from the authorities at Washington more\nadequato facilities, of either a more satisfactory wave channel or permission to\nuse more power, or even both combined. We have never yet been allowed facilities\nadequate to our needs,.\n\"As on previous occasions, a very enjoyable, cooperative auto trip was organized to\ngo to Columbus early this month. On the first lap of the trip, tho Director of\nKUSD drove alone from Vermillion to Ames. Then at Ames the Director and the Chief\nOperator of WOI joined the party. At Iowa City, tho Director of WSUI was added and\nat Urbana the Director of WILL completed the party.\nAN AUCTION?\nFrom tho letters that have been received recently by the executive secretary of the\nNAEB, it would seem that a nation-wide auction is being held to secure the fall\nconvention of tho Associo.tion. Bids have been received from hotels in all sections\nof the country offering everything from auditoriums seating 7,500 people to one\nhundred-fifty miles of beautiful mountain trails.\nFrom Florida comes an offer from \"the city where dreams come true, whore one may\nenjoy healthful outdoor sport and every form of recreation and dazzling night life.\"\nA letter from Los Angeles assures, \"delightful weather in a country of endless\ncharm and beauty.\" Colorado offers, \"a desirable grouping under one roof away\nfrom tho distractions of a city—with golf and tennis, swimming and horseback\nriding.\" Washington, \"the real geographical as well as the educational center of\nthe nation\" makes a bid.\nHowever, tho majority of members who have expressed an opinion believe that the\nfall meeting should be held at a member institution, if possible, or in some\ncentrally located city. Invitations have been extended by the University of Iowa,\nthe University of Illinois, the University of Kentucky, the University of Wisconsin,\nand Iowa State College. St. Louis, Kansas City and Chicago have also been discussed\nRADIO MUSIC FESTIVAL\nAn interesting educational broadcast was the Second Radio Music Festival broadcast\nby the Wisconsin School of the Air on May 11. All children in the Wisconsin\nschools who had learned to sing the songs taught by Professor E. B. Gordon in his\nweekly \"Journeys in Music Land\" broadcasts were invited to take part. Five hundred\nchildren gathered for tho event last year. This year several times that many\nparticipated.\nA rehearsal was hold in the morning, and in the afternoon the mass chorus broadcast\nfor an hour over the state stations. A new feature this year was the rhythm band\nbroadcast. Governor Phillip F. LaFollette of Wisconsin was a special guest during\nthe festival and broadcast.\nEXTENSION DIVISION RADIO CLASS\nFrom the Evening Californian, a semi-monthly publication of the University of\nCalifornia Extension Division, comes the following item's"
}