{
  "id": "d1451-1",
  "text": "-2-\nThere is authorized $32,750,000 for fiscal 1965 for universities and colleges to\nconduct short-term or regular semester institutes for advanced -Study by teachers or\nsupervisors of teachers in several subject areas (English, reading, history, geography,\ndisadvantaged youth), library personnel, and individuals “who are engaged as, or are\npreparing to engage as educational media specialists.” Institutes in all eight areas\nare to include “study in the use of new materials.”\nIndividuals attending such institutes are eligible to receive $75.00 per week and\nthose with one or more dependents will receive $15.00 per week extra for each\ndependent.\nEligibility\nIt is clear from conversations with legal counsel at HE W that the intent of the\nSenate Committee, which added the provision on media specialists , was to provide\na means of developing or improving competences in the educational media field for\nindividuals already involved in educational media work as a means of up-grading\nthe quality of instruction in the elementary and secondary schools. There is some\nquestion, therefore, about the eligibility of staff members of educational broadcasting\nstations, closed-circuit systems, and production centers - even though a substantial\npart of their work concerns programs which are used in the schools. Legal counsel\nagreed that if the individual was on the staff of a school/or college stations serving\nschools,this would help and he admitted that these interpretations were matters of\ndegree. The decisions about who is accepted at the particular institutes, of course,\nwill be made by the individual institutional directors.\nIn any case, the USOE has decided that for the first year participation will be limited\nto individuals employed directly and full-time by schools, school systems, or state\ndepartments of education who are already exercising responsibility for media\nprograms. The need for institutes to serve individuals “preparing to engage” as\neducational media specialists and institutes for college-level teachers will be\nstudied later.\nBenefit.to Educational Broadcasting\nClearly these institutes are designed primarily for teachers, supervising teachers, or\nthose individuals in school systems who have been given responsibility for adminis¬\ntering audio-visual programs; however, .educational broadcasting still stands to\nbenefit from teacher personnel who will gain training in classroom utilization of\nradio and TV, knowledge of programming and production, on-camera and microphone\nexperience, and increased acquaintance with new materials to support classroom\nwork.\nMany of our college and university members will contract to conduct such institutes\nand there wiil certainly be an opportunity for some station staff members to attend\nsuch institutes as a means of furthering their capability in handling a particular\nfunction, medium or clientele or as a way to broaden their competences in the whole\nfield."
}