{
  "id": "d1451-3",
  "text": "NAEB-May——4i\nS. Prall, chairman of the Federal Communications Commission. It was very evident\nfrom all the remarks of the speakers and from his talk that he is working for and\nwith the educators, that ho has their interest at heart; first, because ho has been\npresident of the Board of School Commissioners of New York City, and, second,\nbecause he believes in cleaning up the radio situation. He said that his group\nwas 'ready to cooperate fully and to contribute as far as possible to the final\nand complete development of a definite practical and workable plan for tho\nextension, expansion, and modernizing of education by moans of radio broadcasting ,\n\"*For a century and more education has been closely limited to the schools. Wo have\noverlooked the many who are not scholastic; we have left almost entirely out of\nthe picture that largo multitude of men and women beyond the compulsory school age\nwho must find their learning the every day experience of life. Relaxation, growth,,\nenrichment, and recreation oomo to the public over the radio and this promises to\nbo almost as significant as an aid to tho school as for those out of school in tho\ncultivation of the larger modern citizenship objectives,*\n\"Commissioner of education John W. Studobaker was not able to bo present because of\nthe very important meeting which is to be held in Washington, May 15. At this\nmeeting it is hoped that some definite plan for the use of radio by educators will\nbe determined. Mr. Prall was asked many questions by educators about tho length\nof this meeting and objectives, etc. He said that the main difficulty in handling\nthe situation was that educators were not agreed upon what they really wanted from\nthe radio. It would be his job and the job of the broadcast division of tho . -\nfederal communications commission to work out some definite plan which would be\nacceptable both to commercial broadcasters and to educators.\n\"Mr. Loucks, executive secretary of the National Association of Broadcasters was\none of the speakers Monday morning. He recommended that one experimental station\nbe established to be used as a laboratory by educators with practical broadcasting\nexperience. That each group accept a certain amount of responsibility. Part of a\nplan has already been developed by Mir. Allen Miller, director of the radio depart¬\nment, University of Chicago. Mr. Miller gave a paper Wednesday morning on the\ntechniques of presenting dealogue-—- He made one suggestion which I believe could\nbe used to advantage to our work here in Indianapolis. He said that three voices\nwere more effective than a larger number in any discussion group on the radio.\nThis suggestion could be used to advantage next year in our Newscast by having two\nsets of newspaper reporters having three broadcast each time.\n\"Tuesday morning Mr. F. L. Redefer, secretary of the Progressive Education Associ¬\nation talked about radio problems for children and young people. It has been\ndetermined by research that children spend on the average of two and a half hours\na day listening to tho radio. Mr. Redefer told of an organization in Chicago\ncalled the Chicago Society for tho Improvement of Children's Programs. This\nsociety is apparently made up of representatives from a great many women's organ¬\nizations and other groups. He spoke of the radio committee for better children's\nprograms, organized under tho American Library Association, of the research being\ndone by the National PTA, etc. Children's programs brought about very heated\ndiscussion.\n\"Levering Tyson read a lengthy report made by a research engineering group in\nWashington which established the fact that television would not be in use for ten\nyears, but that facsimile broadcasting would be in operation within two years.\nSeveral people were of the opinion that this new facsimile broadcasting would solve\nthe problem for educators. What it is is still not very clear in my mind, but it\nseems that it is possible for printed material to come rolling out of a radio as"
}