{
  "id": "d334-1",
  "text": "ANALYSIS of educational stations in the u. s.\n(As of February 1, 19^2)\nTotal number of educational radio stations in the U. S.\n255\nTotal number of educational television stations\nin the U.\ns.\n62\nTOTAL\n317\nTOTAL\nNAEB\n*\nNumber of AM stations (l)\n39\n24\n61.5\nNumber of FM stations (2;\n216\n150\n69.4\nOn educations!, channels\n(198)\n(139)\nOn commercial channels\n( 18)\n( ID\nNumber of TV stations (3)\n62\n54\n87\nOn educational channels\n( 56)\n( 50)\nOn commercial channels\n( 6)\n( l) .\nTOTAL\n317\nTB5T(9)\n71^9\nAnalysis of stations operated by MSB members:\nRadio - AM only\n9\nRadio - FM only (4)\n111\nRadio - AM & PM (5)\n8\nTV only (6) (7)\n30\nTV, AM & FM\n4\nTV & AM\n2\nTV & FM (8)\n14\nIT®* (9)\n*Add 2 for total Active Membeivship. The Mohawk-Hudson Council on Educational Television\nis an active member holding a television Construction Permit, and the University of\nMaine (WMSB-FM) is an active member holding a radio Construction Permit.\n(1) Of the 15 non-member AM stations, 12 are owned and operated by church groups\nor other religious organisations, 1 by a school system, and 2 by broadcasting\nassociations.\n(2) Of the 66 non-member FM stations, 16 are operated by schools or school systems,\n29 by colleges and universities, 5 by Junior colleges, 12 by churches or religious\norganizations, 2 by trade or technical schools, 1 by an orphans home, and 1 by\na non-profit foundation.\n(3) The non-member TV stations are:\nKLSE, State Department of Education, Monroe, Louisiana.\nKFEC-TV, Clover Park School District #*00, Thcoma, Washington.\nKRET-TV, Richardson Independent School District, Richardson, Texas.\nWCBB, Colby-Bates-Boudoin Educational Telecasting Corporation, Lewiston, Maine.\nWHRQ~TV, Hampton Roads ETV Association, Hampton/Norfolk, Virginia.\nWXBI-TV, Department of Education, Mayaguez, Puerto Rico.\nWIPR-TV, Gfieina de Ra&ioemision Biblica, San Juan, Puerto Rico.\nNXGA, Georgia State Board of Education, Atlanta, Georgia."
}