{
  "id": "d1556-1",
  "text": "National As\nMadison, Wisconsin\nHeadquarters:\nsociaixon of Educational Broadcasters\nAugust 17 - 18\nRadio Hall (WHA), University of Wisconsin\nProgram Schedule — (Details Later)\nMonday, 17 Tuesday, Uy 18\n9:00 - REGISTRATIONS 9:00 - STATION PROGRESS SESSION *\n10:00 - OPENING SESSION - GENERAL 11:00 - BUSINESS MEETING (CLOSED)\n2:0» - NATIONAL RADIO ASPECTS 1:50 - RECORDING CLINIC\n6:00 - BANQUET (Demonstrations, auditing)\n7:50 - LAKE MENDOTA CRUISE 4:50 - ADJOURNMENT\n* A report will be called for from each member station. Represen¬\ntatives present will speak for their stations outlining the work\" of the\nstation, citing highlights, and, indicating prospects for future growth.\nTEN MINUTE MAXIMUM TIME. Stations not represented at the meeting are asl\nto write their reports (from 500 to 1000 words) and send them to the\nSecretary. PLEASE MAKE REPORTS CONFORM TO THE TIME LIMIT!\n- Suggestions -\nAnother Convention - The American Association of agricultural College\nEditors holds its annual convention in Madison on August 18-19-20.\nPerhaps some cooperative plan of representation can be arranged\nwhere institutions are interested in both organizations and could not\notherwise participate.\nProgram - Program details have not been definitely set. While we will\ndeal primarily with very practical problems certain prominent per¬\nsons are expected to be included in the program. Surprises may be\nexpected! Don’t miss them!\nRooms - Arrangements have been made with the University Club for rooms\nfor men. A special rate of $1.00 per person per night for single\nbeds has been secured. Women alone and married couples will find\nrooms in a residence hall at the same rate. Both places are within\ntwo blocks of Radio Hall. Write the Secretary for reservations.\nEntertainment - Plenty of it at hand. Except for the Monday night boat\ntrip everyone will choose recreation to suit his own tastes. Boat¬\ning, bathing, fishing, sight-seeing, tennis, golf, dancing, and\nplenty of other diversions are at hand. To do all these things you’d\nbetter come early and stay late, because our two convention days'\nare rather busy ones.\nInformation - Write Harold Engel, Exec. Secy., Radio Hall, Madison\nWE’LL MEET YOU IN MADISON"
}