{
  "id": "d1556-3",
  "text": "Minutes of the Twenty-third Meeting o^the\nNational .Committee on Education by/^adid\nWashington ,' D. G.,\nThe National Committee on Education by Radio met in Washington, D. C. at the\nC V Natl°nal EdUCati°n Ass0oiati°* 10 AM, Monday! January SO, 1936.\nCh rlea ' rVef present: Arthur G- Cr^e, (chairman), H. B. McCarty\nlu.rles a. Robinson, S. J., Agnes Samuelson, Willis A. Sutton, and George F. Zook\nto the^r^r63^ ^ ** ^ Se°retary and Sheffield\", assistant\nThe minutes of the meeting of\nSeptember 13, 1935, ?/ere approved as presented.\nBy unanimous vote of the Committee, Mr. Harold B. McCarty was accented as n\ncaster3!f ^ Committee representing the National Association of Educational Broad-\nThe secretary was directed to draft communications to be sent to the absent\nmembers expressing the Committee’s regret at their inability to be present.\n• + • DrWCI®ne disoussed the reports of the Radio Committees to the National Asso-\nversitieif tJnlversitles and the Association of Land-Grant Colleges and Uni-\nBr. Crane reported on the New Mexico plan of a public broadcasting service.\nrmmit?r\\Tyler suf”arlzed briefly his report of the five years of activity of the\nCommittee s general headquarters. The concensus of opinion of the Committee was\npublished! I°rt ^ hat °f i''b'' P8rry should be combined into a single report and\n+. Td® Committee voted to appropriate :>50 for the indexing of EDUCATION BY RADIO\nm the Education Index.\nDr. Zook reported upon a meeting, held in New York at his suggestion, between\nrepresentatives of the National Committee on Education by Radio and the National\nK?I!o01? i!Un011 °o Radl° ln Eduoation- At the same time, the invitation of the\nconsidered11718017 G°UnCl1 °n Eadio in Eduoatioii for a joint meeting in May was\nCommittee voted to authorize the chairman to act on behalf of the National\nCommittee on Education by Radio on the program committee to draw up plans for a\njoint assembly for a discussion of education by radio. This project, according to\nDr. hook, was to be under the supervision of the American Council on Education.\nSince Dr. Zook was unable to be present at the afternoon session, he wished\nto express his unequivocal desire that the Committee be continued.\nAt 12:40 PM the Committee recessed for luncheon at the Cosmos Club.\nDr. Marsh substituted for Dr. Zook during the afternoon session. Mr. Perrv\nformer director of the Service Bureau, was also present, *\nC°™littee discussed, the program for the twp-year period and arrived at the\nloilowing plan;"
}