{
  "id": "d1556-4",
  "text": "MAIN PURPOSE: To promote the use of radio for educational,cultural, and\ncivic purposes,\nGENERAL OBJECTIVES:\na. Serve as spokesman for united, organized education.\nB. Assist in the protection and extension of the privileges of\neducational broadcasters.\nC. Promote broadcasting to organized schools of all kinds and ranks.\nD. Stimulate and coordinate cooperative experimentation and research\nin educational broadcasting.\nE. Stimulate the formation of state or regional boards to promote\npublic broadcasting and assist in securing time and facilities\nfor such service.\nF. Collect, publish and distribute information conducive to the\nadvancement of public welfare broadcasting, both for the\ngeneral public and for the information of the broadcasters\nand leaders in public welfare.\nG-. Protect and promote public broadcasting service.\nH. Formulate standards for appraising the quality and values in radio\nprograms.\nI. Improve the techniques of educational broadcasting.\nThe Committee adjourned at 5:45 PM.\nThe Committee reconvened at 10 AM, January 21, with the following members\npresent: Arthur G. Crane, (chairman), J. 0. Keller, K. B. McCarty, Charles A.\nRobinson, S. J., Agnes Samuelson. There were also present Tracy F. Tyler, Secretary\nand Virginia Sheffield, assistant to the secretary.\nThe Committee voted unanimously to continue its activities for an additional\ntwo-year period, this continuance to be conditional upon the approval by the Payne\nFund of the Committee's plans and budget for the period.\nIt was voted that the chairman be given authority to adjust the minor details\nof the budget and submit it by mail for the approval of the members.\nThe following officers were elected unanimously for the ensuing year: Arthur\nG. Crane, chairman; H. J. C. Umberger, vicechairman.\nThe Committee voted to authorize the chairman, in conference with the Payne\nFund, to fiake the necessary arrangements for a treasurer.\nA telephone call from Dr. Marsh conveyed to the Committee Dr. Zook's approval\nof the proposed removal of the Committee's office to New York.\nThe Committee voted ua&aimously to remove its offices to New York because of\nthe saving in budget which such a move would accomplish."
}