{
  "id": "d208-0",
  "text": "UNIVERSITY OF ILLINOIS\nJanuary 31, 1953\nMEMORANDUM\nTO: Graydon Ausmus\nFROM: Robert B. Hudson\nSUBJECT: NAEB Seminar and/or Television Program Planning Meeting\nFollowing the meetings in New York this week, I am sure you recognize that\nthe newly organized Educational Television and Radio Program Center is\nconcerned, concurrently, with matters of staffing, philosophy and plan of\noperation, the character and breadth of the service to be offered, the\ninterests and needs of educational television stations to be served, and\nsources of creative programs internal to educational institutions.\nIn view of these concerns (and because so much fog has enveloped thinking\nabout another NAEB seminar), it occurs to me that a very practical course\nof action is open to the NAEB, acting through its Advisory Committee to\nthe Center, whereby the Center will benefit and the NAEB will be strengthened.\nMy suggestion is that the NAEB propose to the Fund for Adult Education that\nthe $5,000 grant already appropriated for a NAEB seminar be made available\nto the NAEB Advisory Committee to the Center for the purpose of holding a\nplanning meeting of the key television program people in those educational\ninstitutions that appear to be most ready to produce television programs,\nwith or without grants-in-aid, for distribution through the Center.\nIn essence, such a meeting would be concerned with creative programming-\nan assessment of what programs the potential educational television stations\nand production units are prepared to start on now, and an estimate of their\nproduction timetable for them. Of even greater importance would be the\nassessment of what the overall job is-what kinds of programs and for what\npurpose.\nIn getting at the what and the why of programs to be supplied to the Center,\nthe meeting would in effect be hammering out a program philosophy which\nyour Advisory Committee, in turn, could recommend to the Center. The meeting\nwould identify what it considers to be the interests and needs of educational\ntelevision stations, and it would clarify thinking on what should be the\ncharacter and breadth of the service of the Center to stations. There is no\ndoubt about the Board and the officers (yet to be selected) of the Center\nwelcoming advice on these points. Furthermore, the Center appears to be\nlooking to its NAEB Advisory Committee for advice, and I think this is the\nproper time for your Committee to take initiative. I feel sure that Mr.\nFletcher, as Acting President of the Center, would be prepared to underwrite\nthe expenses of your Committee in planning such a meeting.\nIf this plan appeals to you and to your associates in the NAEB, may I suggest\nthat you take it up with Mr. Fletcher and Mr. Griffiths without delay.\nI am listing on the attached sheet several procedural steps that may provide\na useful framework in which to consider this proposal."
}