{
  "id": "d208-107",
  "text": "THE UNIVERSITY □ F TENNESSEE\nDIVISION OF UNIVERSITY EXTENSION\nBOX 8450, UNIVERSITY STATION\nKNOXVILLE\nRADIO AND TELEVISION SERVICE5\nRADIO STATION WUOT\nOctober 11, 1954\nu •\n(j^W\nMr. Frank School ey\nStation WILL\nThe University of Illinois\nUrbana, Illinois\nDear Franks\nThanks for your prompt and informative letter, and Ifll reply\nin kind. Perhaps these things will be discussed after I arrive in\nNew Jfork, but in any case;\n1, I see no real problem in cooperating with the Acceptance\npeople, or am I being naive? Surely if they turn down a program\nthat we suggest, plan, and have produced, they must explain in\ndetail the reasons. Then I should inagine the thing could be\npolished up or argued out to a successful decision. I realize\nthis matter has a history of which I am only slightly aware, but\nI feel it could be worked out.\n2. I think you're completely ri^it here—that new program\nideas are badly needed. Are we really contributing anything to\nAmerican radio that is any different, or are we simply providing\nfiner content in the same old wrappings? This has worried me for\nseven years since I came into the non-ccmmercial field. Some pro¬\ngrams have been different in form and production as well as in\ncontent, but most have been conventional. I'm afraid this short¬\ncoming, if it is aich, will require good brains applied over a long\nperiod—perhaps we can supply such thinking in a separate meeting?\nAt any rate, I think the ifbollowing ideas might be worth considering*\n/\nBalladry in America — series of genuine folksongs, perhaps\nwith two or three programs produced by member stations in unique\nareas, but preferably with a production team to give unity to the\nentire series. Not regional pseudo-balladry, but the real article\nover a national area.\n^ Atomic Energy — man and his search fo r a way of bettering his\nlot, finally his discovery of the secret of atomic energy. What\nthis discovery means in terms cf destruction, medicine, agriculture,\nscience, business, an d in terms of man's future civilisation. I\nrealise this subject matter has been given a good working over, but\nI haven't heard a really good series yet."
}