{
  "id": "d208-108",
  "text": "2\nPersonal adjustment series — I believe that what I’m thinking\nabout here is to reveal in someway -the sense of security and hope\nthat a person gets from the real izat ion that other people have\nfrustrations, angers, sorrows, etc, just as the individual does.\nWe’re not different when we're neurotic and melancholy, tut are joined\nby most other people at some time or other. The aim of the series\nwould be to illustrate adjustment, somewhat like the Station 60 show\ndid, and in the illustration, to show man that he isn’t alone in his\ntroubles, and that ad jus tiro nt s can be made. Subjects such as unhappiness\nwith wife or husband, mistreatment or imagined mistreatment by children,\nlack of success in job, lack of security, lack feeling of belonging\nto society, feelings of getting no where, yearnings for vague things\nthat are unattainable, etc.\nMusical programs — this area has problems of reppoduction, I\nknow, but most of the member stations could use more good music, not\nonly from the usual mediocre college orchestras and ensembles, but\nfrom genuine professional orchestras, if such things could be\narranged. We and most others build such dicws from recordings quite\nsatisfactorily, but it would be heL pful to have musical shows in a\npackage to eliminate local planning, writing, announcing, etc, i£b\nsome extent,\n3, The idea of cooperation with the AEA is fine and there must\nbe many fields in vfo. ic h such mutual effort will give good results.\nThis matter will call & r around-the-table conference by the com¬\nmittee, I imagine, so we can find out more abo ub the plan and vhat\nit might entail. It sounds good to me.\nI hope this lengfthy essay won't discourage you too much, but I\nthought I opght to express myself a bit before the meeting. The\nprogram ideas are very sketchy here,of course, and would require\nour collective judgements and experience to work out into anything\nworth while. I'm thinking here of big p-oduction with experts in\nthe fields, and professional production people, not of some small\nschool like mine undertaking the job. I think NAEB should be big-\ntime and big-time production is a first essential. Well, I'll see\nyou in New York, Frank, and thanks for writing.\nSincerely,\nKenneth D. Wright\nDirector of Broadcasting"
}