{
  "id": "d208-178",
  "text": "-4-\nOctober 27, 1953\nMy dear Mr. President:\nOn August 1 of this year, by authority of your Reorganization\nPlan No* 8 approved by the Congress, the U. S, Information Agency\ncame into being as a separate independent agency reporting to you\nthrough the National Security Council.\nThe operations of the Agency — embracing among others the\nVoice of America, the U. S. libraries overseas, the motion picture\nservice, and the press and publications service — were all formerly\nactivities of the Department of State. We receive daily foreign\npolicy guidance from the Secretary of State.\nSince August 1, we have been engaged in organizing the Agency\nunder the new set-up and reprogramming our activities within the\nlimitations of the present appropriation. The new statement of\nmission for the Agency, adopted at last week’s meeting of the\nNational Security Council, is a great stride forward. It is of\nsupreme importance to us — and indeed to the American people —\nbecause it clearly defines the broad lines within which, f am con¬\nvinced, our overseas information service can do an effective job.\nIt reflects the recommendations of the Senate’s Special Sub¬\ncommittee on Overseas Information Programs chaired by Senator Bourke\nB. Hickenlooper of Iowa, which proposed on June 15, 1953 certain\nchanges to strengthen the foreign information program.\nIt also embodies the concept of the President’s Committee on\nInternational Information Activities (William H. Jackson Committee).\nThis concept is that psychological activities and psychological\nstrategy do not exist apart from official policies and actions.\nUnder this new mission, avoiding a propagandistic tone, the\nAgency will emphasize the community of interest that exists among\nfreedom-loving peoples and show how American objectives and policies\nadvance the legitimate interests of such peoples.\nWe shall therefore concentrate on objective, factual news\nreporting and appropriate commentaries, designed to present a full\nexposition of important United States actions and policies, especially\nas they affect individual countries and areas.\nIn presenting facts we shall see to it that they are not dis¬\ntorted and that their selection does not misrepresent a given situation.\nWe shall make\nThe President,\nThe White House."
}