{
  "id": "d208-179",
  "text": "■5-\nWe shall make sure \"that the tone and content of our material\nis forceful .and direct, but we shall avoid a strident or antagonistic\nnote.\nThis does not, of course, preclude us from making forceful,\nfactual refutations of false accusations such as those that come\nfrom the Soviet communist portion of the world.\nThe new approach will be harder hitting than previous more\ndiffuse approaches because it is based on the idea of getting\nacross a message that will be convincing. Facts, and comment\nassociated with facts, are more compelling than accusations and\nunsupported assertions on a wide variety of issues*\nFrom here on the Agency will pinpoint its activities on fewer\nbut more vital programs*\nAs pointed out by the Jackson Committee, the American people\nshare fundamental beliefs and values with millions of other men and\nwomen we are attempting to win to our side, which should be made\nclear to other peoples. These include belief in a Diety, in\nindividual and national freedom, in the rigIt to ownership of\nproperty and a decent standard of living, in the common humanity\nof all men, and in the vision of a peaceful world with nations\ncompromising their differences and cooperating in'-the United Nations,\nWe must make every effort to show the mutuality of our interests\nand goals with the legitimate goals of other peoples. We must\nexplain those goals in ways that will cause other peoples to join\nwith us in achieving them.\nI am also pleased that under these more clearly defined objectives\nthere will be greater opportunity for us to use the resources of\npatriotic private American business and non-Gove rnmental.. groups in\nsupport of the information program. Private groups have given\nsplendid support in the past, we we plan an intensive drive to further\nincrease this support and thus multiply the effectiveness of the\nprogram.\nThe content of the new directive has been transmitted to all our\nposts in 77 countries throughout the world, so that they may have the\nimmediate benefit of this guidance.\nWith deep appreciation,\nSincerely,\nTheodore C. Streibert\nDirector"
}