{
  "id": "d208-181",
  "text": "-7-\nThe Supplemental Appropriation Act of 1954 stipulated;\nThat the operations of the Broadcasting Service presently\nlucated in New York City shall be moved to the District of Columbia\nor its environs by June 30, 1954*\nField Operations\nThe operations of the U. S* Information Service (the field arm of the\nU* S. Information Agency) at present include 200 posts in 82 countries.\nEach post is an integral part of the diplomatic team, and works under the\ngeneral direction of the U. S. Chief of Mission in each country.\nThe individual post is staffed by a Public Affairs Officer (PAO),\nwho is in charge, and his assistants. They will include specialists in\nnews, radio, film, library and other cultural activities. The staff will\nvary in number from a single officer at certain posts to many individuals\nat the larger posts, end the proportion of Americans to local employees,\nas in Europe, is about 1 to 4.\nPrimarily to strengthen the field programs, the Director of the Agency\nhas accomplished the following;\n(1) Has established a direct line of command over field operations\nand direct representation in Washington for the field missions\nby appointing Assistant Directors for Europe, the Far East, the\nNear East (and South Asia and Africa), and the American\nRepublics. Spending at least half of their time working in\neach respective area, the Assistant Directors will serve as\nthe eyes and ears of the Director and with authority to act\nfor him.\n(2) Has consolidated the former Office of Policy and Plans and\nthe Office of Field Programs, at headquarters, into a new\nOffice of Policy and Programs to improve the development of\ninformation policy and programs which will further U. S.\nobjectives abroad and promote efficiency.\nMedia Operations\nThese are the five media operations of the new Agency which backstop\nfield activities;\nBroadcasting Service\nThe Voice of America broadcasts more than 75 separate programs\non a world-wide network for approximately 28 program hours daily\nin 34 languages. These programs are transmitted via short,\nmed5.um and long wave over 73 transmitters, 30 located in the\nUnited States and 43 abroad. Included among the transmitters\nabroad are those in operation aboard the U. S, Coast Guard Cutter\nCourier presently located in the Eastern Mediterranean* Seventy\npercent of the Voice's effort is devoted to the Communist-dominated\ncountries. Eleven foreign co n-ries aid in relaying and rebroad-"
}