{
  "id": "d208-183",
  "text": "-9-\nOffice of Frivate Cooperation\nBrings into effect the active participation of private\nagencies, business firms, professional groups, educational\nand cultural societies, non-profit organizations and individuals\nwho can help achieve the objectives of the government’s overseas\ninformation program. To date more than 700 projects have been\narranged. These fall into the major categories of: overseas\nadvertising, inserts in letters sent abroad, collections of\nAmerican magazines for distribution overseas, exhibits, letter\nwriting, town affiliations, community participation programs,\nunofficial ambassadors and hospitality projects for foreign\nstudents in the U, 3,\nFee organization Steps\nInternal organization of the U. S. Information Agency, is based on\nthree concepts:\n(1) The field is where the information job is performed.\nPrograms will be developed in each country to fit specific\nneeds, and the media services in Washington will provide the\nfield posts with materials suited to each particular country.\n(2) There will be a minimum of superstructure in Washington.\nIn practice, the transfer of the IIA from the Department of State\nand the merging into the new Agency of the MSA foreign informa¬\ntion activities are steps which are not to be taken overnight\non a \"crash\" basis. They will be accomplished in a period of\nmonths.\n(3) Area supervision with full authority for field operations\nhas now been established in the offices of the Assistant\nDirectors.\n(4) Reprogramming within the 1954 budgetary limitation will\nresult in reductions in the number of overseas posts, information\ncenters, broadcast hours, and other media activities.\nHistory of the Program\nOver the years, the U. S. Government has acquired considerable\nexperience in the broad and complex field of information and public\naffairs abroad. Beginning with the cultural program for the other\nAmerican Republics, authorized by the Congress in 1939 and undertaken\nby the Department of State in 1940, and the several programs of the\nCoordinator of Inter-American Affairs initiated shortly thereafter, the\nGovernment began to learn through experience the capacities, limitations\nand problems of the information approach. The war situation produced\nthe Office of War Information which, together with the resources of the\nArmed Forces, took us into the complex arena of psychological warfare.\nIn 1945-4^, on the premise that the emergency was over, the\npsychological warfare function disappeared. The remaining functions\nwere drastically reduced in scope and were grouped within the Department\nof State in the Office of International Information and Cultural Affairs"
}