{
  "id": "d208-190",
  "text": "~2~\n10.\n11c\nRENDEZVOUS IK CRKTE—IIigel Patrick with Howard Morion-Gr&wford star in this program\nwhich is based largely on the book \"1X1 Met by Moonlight by VN Stanley Moss,\n(56923«)\nPORTRAITS FROM MEMORYi \"Joseph Conrad\" [12*52”)\nTHE PRIVATE VIEW—-The program revolves around the deception that a wife and daughter\nwere forced to play upon the blind art-lover who was so dear to them, (28947*)\nHELEN by Envi p3 riee^Sonin Dresdol and Howard Marion-Crawford in the first radio\nproduction of \"Helen,\" The new translation of the play by Philip Vellacott is\nadapted and produced by Raymond Raikes, with music composed by John Hotchkis*(73558”)\nPORTRAITS FROM MEMORY: \"H. G, Wells” (12»00«)\n^Tx^Sie tale of the remarkable change in mousey little George Tapping that was\nbrought about when the mysterious Mr* X, came into his lifeQ (28*45”)\nDRAMA AT INISH-—The play, set in a small Irish seaside resort, follows with satirical\ncomedy the effects that \"higher drama\" has on the inhabitants of Inish** (57623**)\nDISCU3SI0N; \"Differences Between British and American Education\" (30 ®00n approx.)\nSpeakerss\nDr. George D. Stoddard, Former President of tile University of Illinois* UNESCO\nCommissioner* and a member of the Institute for International Education\nDr* John Macraurray, Professor of Moral Philosophy at the Univ* of Edinburgh\nDr* B<v Ifor Evans, Provost at the University College* London\nChad naans Rooney Pelletier\n-A 1W PRODUCTION\n(58*15*)\n(13 ®32ti?)\n(30\"00\" approx,,)\n12, THE SUM0NXI1G OF EVERYMAN-\nPORTRAITS FROM MEMORY?\nDISCUSSION! \"Why Study Abroad?”\nSpeakers:\nDr, Christian 0. Arndt, Professor of International Educational Relations at NYU\nMiss Agnes Cope, Instructor in Physical Educational at akewood High School,\nClevelaxid, Ohio\nMr* C* V. Dixon, at the Institute of Education, University of London—Deputy\nSecretary of the Institute.\nChairman: Rooney Pelletier,\n13. ANTONY AMD CLEOPATRA PART I (58*58«) PART II (82553”)\nMichael Redgrave as Antony and Peggy Ashcroft as Cleopatra in the Shakespeare Memorial\nTheatre Company8s presentation*, \"The music, which was composed for the stage produc¬\ntion by Anthony Hopkins, is played by the Shakespeare Memorial Theatre Orchestra,\ndirector Harold Ingram,,"
}