{
  "id": "d208-194",
  "text": "4M& ;> Prograa .:;Lm:iin0-“4j.»\nEarl Wynn has suggestcd a scries called American Accents, 13 half, hour® of\ndocumentary reporting, partly by long distance pkcne“auid csnfersnco calls. Some\nof thejldeac to b© developed would be nThe Meaning of Treason in our Dqjr,\"' \"Free¬\ndom from the Press,\" \"Is There a Place for Women in Gcv^rruDent?\" and others of\nsimilar contemporary interest* The committee thought that the idea was good,\nbut wasaaacexned over lack of unity in the various pregams of the series, -md\nover possible mechanical difficulties* 1 was: asked to write Wynn about these\nmatteas* (Letter to Wym attached, )\nMother much-discussed progran was agrin discussed; the matter of the Air\nForce meteorology series. The committee was skepti cal of format and .-some of the\ntitles scened heavily oriented toward military use only* I was instructed to\nwrite Lt« Spears of our decision and to request further information* (letter to\nSpear*s attached.)\nDr* Jchn R* Kirk of ths Uhhrersi ty of Chicago proposed a series in mid-191?ls.\nand nothing has been dene to cur kr.ori.edg3* I brought it up, we discussed it,\naid theu$it it lad some good ix>ssibilitics• I was asked to write Dr. Kirk to\nso© if his interest is still high enough to gat an audition tape. The series\nwould be called Th& Search ibr Certainty, «ind would bo a history of pJiiloscphicaL\nthought on the nahire of irv^tTaSST'cerCacLn'ty. (Letter to Bark attached*)\nBern is Buck had trittan Skornia in jrid-suaner of thin year about the Anti-\nodh College Sh&ce spear e plays each sutaacr, and suggested that •these people\nmight do a radio series for us* I have seen $ of tto Antioch plays ssid added\nan enthusiastic word* But the material from Bemi© has been lostj I wa® in¬\nstructed to write him for copies of it to be sent directly to Harcy Siegel\nwrote me that Bsrnie will, write as soon as he returns from vacation. (letter\n'to Buck attached*)\nAll of these programs were discussed as potential big budget scries with\ntelevision, publishing, foreign translation, discussion guides, and obhsr possi¬\nbilities* Tho committee finally decided upon throe separate series to be\nrecos^EMOded for large seals production, aid the rest wound up in the category\nof good ideas for the network, but in the opinion cf those present, not of\nsufficient stature for various reasons to ¥J arrant large budget treatment*\nLARGE BUDGET SRESTI3E SERIES\nOut of the stimulation, of tie ifcr©going discussions, a pattern of grogs\nthinking finally began to appear* The com&ttee members constantly kept re¬\nturning to the these of people in this society in this time and under the stress\nof this economy* We finally made u list of tigit programs from which m decided\nto pinpoint three series as the final re contendatdcn * Ttye ecri-fin diets v^ers :\nSobs variant of the idea of Aging Successfully, a gerontology aeries\nThe livia g Do^ai .-ont. 1 \"\nIT^F’IHHrsTH'/niziFio;: Means to America\nSome aspect of mental health\nThree brandies of U. S* government\nThe d.e Tocquexdll© scripts\nSeme phase of anthropology\nAmerican Accents"
}