{
  "id": "d208-195",
  "text": "7;lo Program KLsnn:mg--$?\nDuring bhs discussion that followed the compilation of this list, the there\nof man in modern society became stronger and the emphasis became clearly focused\non this idea» From tills thinking esm the final decision ihat several series\ncould be don s on the problems of an -industrialized nation* Th© committee finally\ndecided upon three series which would b© distinctly different but would be inter-\nrolated because of the common basis of the problems explored in each* We realise\nthat several dozen other series could have similar relationships, aid it is hoped\nthat further series will bo produced if the idea is worth expaniing. The three\nseries recommended ares\n1\n2\n3.\n► Industrialization in the U* S.—its impact, mealing, effect\n» Mental Health—importance a is a problem, what modern so de ty oont ribtfcen\nurcakdowns_. progress, understanding, etc.\n—a series already well outlined \"by SkoroLa; outline is avaSJ.-\nable'from him\nIn the section on rocormendations, more details are spoiled out. All of us\n.•fully idealize that these throe series, while excellent possibilities, ere perhaps\nno more exciting in potential than dozens of other proposals• But this group\nlias decided that these areas offer the best opportunity for large scale exploits,-\nlien*\nCOffilTTEE HECOl&QjlJDATIQiNS\nTliis coiomittoe is aware of the possibility that th© following reccmnwnda-\ntions, arrived at -through a Tory lopg day of deliberathn on time which aLl of\nus could have used at home and on money which tbs HAEB could, use elsewhere, may¬\nbe tossed oat. These are ^pacific proposals, aid represent th© best thinking \"\nYe could gpplly in sudi a woefully short period of time. We would like to ha*j©\n_yhe reaomaeiilations accepted, cf course, but can understand that they mty not\nO'© entirely acceptable* But if for my reason they are ignored or changed by\nsomeone elm after Ibis report is in, we will insist on kneeing who changed or\ndiscarded thorn and tdjy. I a nalybelieve that Skonaia, Eitsen, Vogt, and Wrigit\nsalize that programs*!^ a network and choosing a s<sri#s for Isggo scale re¬\nduction are jobs of great difficulty for a coEsraittee of people to do in am dsy*\nBut we were asksd to do so; “sm expect cur finding to be taken seriously.\nUn~\n(Whew l that's an Yuletlde type tirade.) Anyway, hero are the receononda—\ntions :\nTh© cor®.lit tee proposes thatths Board of the NAEB or tbs proper officials\nsubmit the following ideas in th© following order of preference for consdd^ra-\nf. on by the Educational Tele vis ion aid Hadio (lister for a 1 erg© budget ocoriess\n(1) Whafc Indus trializt:ti on Mesas to America, or this idea uni or sny\n-title* We msec! to apprec ia -teTHtiy Die merits' and th© disturbances of the high¬\nly Industri.a3.ized economy of our time. What has happened, to the home, to\ntravel, to schools, to youth, to old people, to art, to gczmxmmt because of\nndustidaliaaticn? Wo suggest 10 to 13 programs of flexible length and format\n'vc b© dot© mined, of course, by the producers*\nHarxy and Bonaro Overstreet are suggested as possible writers for thus\nseries* Ho proposal is made for producing agency, specialists for research,\npublishing aid televisicn aipects, motion picture possibilities, etc* This\nwork is far* too important to discuss in a one clay meeting. Once the area is\nchosen. Him a select group should meet for such detailed rooommendationa"
}