{
  "id": "d208-21",
  "text": "December 10, 1953\nDra Harry J» Skornia, Executive Director\nNational Association of Educational Broadcasters\n14 Gregory Hall\nUniversity of Illinois\nUrbana, Illinois\nDear Harry:\nThis is in connection with Larry Creshkoff’s letter to you of\nOctober 8. If it is true that Larry actually ©epeets to have kadiodiffusion\nFrancaise insert English explanations at frequent intervals, e.g., between\nacts and scenes, WGBH either will have to cut the English or be denied the\nopportunity to use the plays*\nExactly the same principle applies in attempting to teach an audience\nin the intermission commentary of a Symphony concert when it does not know\nmusic, as in attempting to teach an audience what a French play is all about\nby the suggested omraentaries in English. The suggestion seems to me an\noffense to the people who can benefit from the unity, movement and integrity\nof a French play in French*\nI believe tnere is plenty of evidence to support this view and I know\nof none to support its opposite. Either you can understand enough French to\nfollow the play or you cannot, but if you cannot, you will learn more by\nlistening to the real thing than to a hashed-up version. An advance pre¬\nparation course like the one fciGBH does for the Boston Symphony Orchestra con¬\ncerts might be appropriate. Both Dr. William N. Lock©, Professor of Modern\nLanguages and in charge of the Department of Modern Languages at Massachusetts\nInstitute of Technology and Professor Marston S. Balch of Tufts College agree\nthat after the plays have begun, they should continue without interruption.\nBoth of these men have given introductory remarks in English proceeding our\nbroadcasts of Comedie Francaise plays. I am enclosing copies of listener\nletters received by WGBH in the last six weeks which reflect a i*eal apprecia¬\ntion of the opportunity to hear the Comedie Francaise as one might hear it\nin Paris.\nEither let us put on the plays in French or put them on in English\ntranslation, We want them in French not because of Boston but because of\nevery good reason which is equally applicable in Ames, Madison, Minneapolis,\nUniversity City, or Houston.\nPh:eth\nEnclosures\ncc Network Acceptance Committee\nProgram Planning Committee\nMr. Seymour N. Siegel\nMr. Lawrence Creshkoff\n'arker Wheatley"
}