{
  "id": "d208-213",
  "text": "Dawson-3\nMaybe Professor So-and-So is the local authority in child development. But in\nxront of a microphone, he’s a dud. Bo v/e do the cause of child development more\nharm than good by putting him on -—and perhaps hundreds of listeners who might be\npotentially interested, tune over to another station.\nHow often do you make this kind of compromise? I know that we still do, more often\nthan we should. And I’d say, better we should schedule a series on ancient Roman\nband instruments, if we can find a scholar with a dynamic, challenging way of\npresenting his material.\nHow many of us produce beyond our limitations? How often, with a handfull of half-\ntrained speech majors and limited studio facilities, do we try to present a big-\ntime, elaborate historical documentary on, say, freedom of speech.\nDoes the material get across when our listening audience is predominantly conscious\nof the fact that a bunch of teen-ave kids are trying to make like John Peter Zenger?\nI say that our growing audience of discriminating listeners won't be that tolerant\nany more. They’ve come to expect too much from us, by way of the better NAEB Net¬\nwork offerings. If, between a program in the\"Ways of Mankind’’ series and the fol¬\nlowing locally produced program, the level of quality drops from the sublime to\nthe ridiculous, the local station looks that much more amateur and inadequate to do\nthe job it professes to be doing.\nLet’s program within our existing budgets and our existing limitations. Let's not\nhave any unfounded illusions about our potential ability to compete with elaborate\nnetwork production. And on the other hand, let's not settle for poor speakers.\nI'm not implying that we shouldn't constantly be working on increasing our capacity\nto produce bigger and better \"Ways of Mankind\" or \"Jeffersonian Heritages\" at the\nlocal level. But start in a closed-circuit situation. Have workshops in writing,\nproduction, and acting. But until you've got a production you know is top-grade,\ndon't impose it on your audience. Concentrate instead on presenting your best re¬\nsources in other than dramatic format.\nI know I'm approaching an area of conflicting opinion here. I've many times heard\nthe argument, at NAEB gatherings, that one of our primary jobs is to train students\nin radio-that on-the-air experience is a vital part of that training.\nBut I think we, as a communications industry, have out-grown that doctrine. I'd say\nthe potential audience we can command now is more important than the half-trained\nstudent whogsts to play Galileo on the air with an immature voice and a technique\nthat isn't up to the demands of a first-cldss production. Let him knock himself\nout in a closed-circuit workshop. But until he can compete in performance with the\nnetworks, keep him off the air.\nAnd while we’re on the general subject, I think we should make an increased effort\ntoward more NAEB seminars and workshops for people at the working level-seminars\nfor writers, for producers. We have too many, I think, at the administrative level,\nwithout regard for the people who are actually putting programs on the air, day in\nand day out. What your situation is, I don't know-but I know that my gang at\nKCJOi-i would give their eye teeth for a seminar on production or writing or community\nrelations. A chance to talk shop and compare techniques and formats. A chance to\nget some new ideas from some top-level writers and producers in the industry.\nSo there's Point Number One-an increased effort toward up-grading of standards\nof presentation to meet the demands of an increasing audience."
}