{
  "id": "d208-214",
  "text": "Dawson-4\nPoint Number Two. I detect, now and then, and incipient ’’Ivory Tower” point of\nview in NAEB thinking. And this is dangerous.\nSo often we say, ’’Good educational material can stand on its own feet. On its\nown merits, it will make good radio listening.” We say this too often, I think\ncategorically and complacently.\nBut how often do we present this good educational material without any attempt to\nrelate it to the listener’s world and show him how it can have meaning for him in\nterms of his everyday living?\nWe agreed, at Allerton House, that educational broadcasting, like education itself,\ncannot in a democracy be the prerogative of a privileged fewr. I say that, for\ninstance, when we go on the air cold with a reading of Plato’s Republic, without\nsome regard for the man who only knows Plato as a name out of ancient Greek history,\nwe are doing Plato a great dis-ser’-‘ oe. Putting it figuratively, we have not even\ndone him the courtesy of introducing him properly to a potential friend. And the\nsame holds true for a broadcast in the field of child development or political geog¬\nraphy or modern art.\nSome of you, I’m sure have read Alburey Castell’s fine speech at the NAEB Region VI\nmeeting in Eugene earlier this month. It came to us several days ago in the latest\nNAEB Newsletter mailing, and I can't recommend it highly enough. A great scholar,\nformerly at Minnesota, now at uregon, who is probably one of the most effective\neducational broadcasters in the business. In his Eugene speech, Dr. Castell spoke\ndirectly to all scholars and professors who might be contemplating a radio talk or\na series of radio lectures. He said, among many other valuable things: \"Presuppose\nas close to nothing as you can. Supply what your listener has to have to follow\nyou. This may cramp your style; but put up with the cramps, if you want listeners.\nThis is not to say that listeners are ignorant: they aren’t. But they don't have\nyour specialized knowledge, and they haven’t given as much thought to your topic\nas you have. Your language is esoteric. Your information is esoteric. Your pat¬\ntern. of thought is esoteric. These are obstacles to be overcome.”\nHow often are we conscious of this? And how often, even if we ourselves are con¬\nscious of it, do we make any effort to get it across to the obliging academic ex¬\npert who is taking the time to do a broadcast or a series for us? Granted, he is\nprobably donating his services for free, and we don't like to impose on him. But\nthis is ho imposition. Actually, we're not doing right by him or his material, if\nwe don't make him aware of the special demands of educational broadcasting. After\nall, he wants to do an effective job, and he looks to us to help him how to do it.\nNow, all of us recognize our obligation to serve the needs of the minority audiences\n•—and in particular, those limited groups who have already had considerable formal\neducation. But let's again be mindful, as we were at Allerton House, of the danger\nthat still exists-namely that these special services can be given too great empha¬\nsis.\nSo there you have a few predictions and recommendations for the future of education¬\nal broadcasting.\nOne-radio is here to stay and will continue to command a large audience.\nTwo-we are seeing a very definite trend toward more adult offerings on the\nnetworks, indicating their discovery that a sizable segment of the Amer¬\nican people are not, as they believed, a bunch of 12-year-olds. An\nincreased interest, generally, in educational and cultural material. A\nbig opportunity for all of us to capture an even greater audience."
}