{
  "id": "d208-65",
  "text": "7\nRemember that there is no field where there has not been a tremendous\namount of authoritative research done, and where facts are available*\nThere is drama, achievement by ordinary people, interesting personali¬\nties, community success stories, \"how to\" pieces galore, personal experience\npieces, crusading editorials and articles of expose—and even humor. All\ninteresting possibilities on their own, but also of tremendous importance\nto America's families and future*\nFOR EDITORS AND SAFETY PUBLECISTS: Don't neglect the publications\nin the Business and Industrial fields. House organs, those with the most\nlimited or restricted appeal, have a tremendous circulation* Publicists\nshould feed these editors with material of various aspects of their special\ninterests. Editor? of such publications should be reminded that, since\nthey are designed and edited to serve industry or the business house that\nproduces them, it is to management's immense benefit that workers be made\nas safety-minded while off the job as when on it.\nTHE PLEDGE: Since this is designed more for local than national\ncampaigns, not many of the larger magazines of general circulation can use\nit—except perhaps as basis for a story on how some community licked a\ntough situation through its use, and thus publicize the idea for adoption\nby other communities. The exception: House organs, trade journals, and\nothers addressed to a limited and restricted audience can employ it to\nestablish a plant record, etc.\nSUGGESTION: A special pledge be devised for the media group, pledging\nthe magazines cooperation (likewise the radio station's, newspaper's, etc.)\nin the Crusade for Safety. Upon receipt of which a Certificate of Merit\n(or of Recognition or Appreciation) be sent the journal, paper, or station\nfor framing and hanging on the wall—as a steady reminder to keep up the\ngood work of plugging safety.\nRespectfully submitted, CLARENCE HAIL, Chairman\nOutdoor Advertising Committee\nThe Outdoor Advertisers, meeting as a committee of the media group\nof the White House Conference on Highway Safety, recommends:\n1. That the Outdoor Advertising medium expand its present support\nof the traffic safety public information campaign.\n2. That State and local councils of all media be established, where\nthey do not exist, for the purpose of coordinating traffic safety public\ninformation activities.\n3. That a national organization, such as the Advertising Council,\nbe designated as the facility to provide the local outdoor advertising\ncompanies, a uniform national public information program on traffic safety."
}