{
  "id": "d208-7",
  "text": "2\nmost gratifying things to me personally has been the feeling of accept¬\nance by persons of the intellectual stature of Sinclair and Allan. The an-\ntJ’rqpoIogist must not , however, merely be a good guy; he must know when\nto say no; when to insist on alteration; what is wrong with the anthro¬\npology in a script* He must also know the limits of his own responsibil¬\nity and not try to take over the functions of the writer or the producer*\nThis last is a recurrent temptation* There are many anthropologists who\ncan serve these functions better than I, and your problem is only to find\none and dislodge him from his prior commitments.\nI would like to urge that, having found a suitable person, you\nendeavor to give him as much freedom of action as you did me* lx you\nhave an anthropologist who fills the criteria of the preceding paragraph,\nhe will neither need nor properly respond to any strong limitations on\nwhat he is to do. Give him the authority within the limitation of expecta¬\ntion set by yourself; give him time, money and talent* This means that\nyou shouldn't have too specific a set of ideas as to what he will produce,\nthough you will want to set a general course of action. This can best be\ndone by finding an anthropologist who has a demonstrated interest in (or\neven commitment to) the particular area of anthropology that you decide\nyou want*\nI might offer some general suggestions as to what makes for good\nradio shows* I personally followed the rule of being non-polemic * In¬\nstruction is better than preaching and in my opinion has a more moralis¬\ning effect*\nAnother general rule that X am fond of is that the general idea\nshould be the center of the show. The content, the particular culture\ndiscussed, and the format are all servants to the idea, which is first to\nbe determined upon and delineated.\nIn this regard you will remember we engaged in an experiment for\nthe second series of the ”Ways of Mankind.” We tried to communicate the\ntotal culture of lurok and Bali. I am not unhappy with these shows, but\nI believe the experience demonstrates that it is better to concentrate\non an idea rather than to communicate a general area of involvement. A\nculture, even a primitive one, is a large and complex: thing that cannot\nbe got in four shows or a dozen. Furthermore, one can never be sure of\ncarry-over from one week to the next. Listener experience may prove me\nwrong, but my present feeling is that we are better advised to have\neach show center on a concept, an idea or a closely associated set of\nideas•\nAs to content—we have barely scratched the surface of anthropol¬\nogy* If I were continuing, I would go back to my ^Memorandum of Basic\nPlans” and follow its leads further—but perhaps I would just as lief\nnot see others doing it. Here are some suggestions of very different\nkinds of programs that could be satisfactorily handled:\n1. Field work reports with native groups who know English. I am\nthinking of tape-recorder discussions of the problems of culture adjust¬\nment of native groups in various places* It would certainly be possible"
}