{
  "id": "d1825-10",
  "text": "The problem of interchangeability has not yet\nbeen completely licked although progress is being\nmade in the development of new recording heads.\nLack of uniformity in different production runs of\nrecording tape is still a problem although both head\nlife and tape uniformity are being approved and 100\npasses of the tape and comparable head life are be¬\ning achieved. Due to the problem of interchangeabi¬\nlity, when long delays of program material are en¬\ncountered, the head and tape must be stored together\nfor playback or a kinescope recording made as a\nprotection copy. The revolving head and guide mech¬\nanism is changed as a unit. This can be accomplish¬\ned in fifteen minutes when everything clicks.\nA bulk erasing machine has been developed to\nerase videotape. The reel is placed on a spindle which\nrevolves slowly as the reel of tape is moved slowly\ninto and out of the field of a large degaussing coil.\nWhen the tape was erased by hand, no two operators\nsecured uniformity of erasure. Now that the machine\nhas been developed, uniformity is assured and no re¬\nsidual magnetism is left on the tape.\nIn the kinescope recording room nine or ten\nmachines (I lost count) are installed, both 16 and 35\nmm. All recording is done double system. Mechanical\nshutters are used and sound tracks are recorded on\nquarter inch standard magnetic tape on Fairchild re¬\ncorders. Two optical sound on film recorders are also\navailable. Since the output of the recorders is negative\nfilm, network playback is from the negative picture.\nThe sound track is played back on a Fairchild re¬\ncorder which is synchronized with the picture.\nAn interesting facet of the film operation is that\niconoscope film chains are universally used for all\nmonochrome film playback. Through a patching\npanel any projector and its associated camera chain\ncan be patched to any control room so that complete\ncontrol of the projector is from the studio on the air.\nAt present color film is shown on flying spot scanners\nalthough 3-Vidicon color film cameras are being in¬\nstalled since dense color film cannot be shown on\nthe scanners. 35 mm. film is used exclusively, which\ngive almost live film quality and excellent kinescope\nquality.\n*****\nAnother network practice that, I’m sure, will be of\ninterest, is the use of “protection” copies. ETV\nstations buy one kinescope recorder which is expect¬\ned to produce results 100% of the time. I was\npresent in the CBS kinescope recording room when a\nprogram was being recorded. Four kinescope recorders\n(two 16 and two 35 mm.), two magnetic sound re¬\ncorders and an optical recorder were used. No doubt\na videotape copy was being made too, but that facili¬\nty is located some distance away from the kine room.\nThe same use of a “protection” copy is made on\nplayback. I saw a videotape recording on the air\nbacked up by a 35 mm. kinescope recording. They\njust don’t take a chance of losing a program on the\nair - it costs them money.\nOf course I realize that ETV stations don’t have\nthe funds or the personnel which are necessary for\nthis type of operation. However, it does point up the\nfact that 100% reliability is difficult to achieve unless\nsome such procedure is followed.\n*****\nAnother operating practice which ETV stations\ncan, and which many of you I hope are following, is\nthat of showing “ corners” on your image orthicons.\nIf you’re using second-hand camera tubes, then I\nrealize you’re limited because of previous scanning.\nBut if you’re using new tubes, don’t be afraid to\noverscan them on the air. I was surprised to see “big,\nfat corners” showing on the live monitors which ob¬\nviously had to be adjusted to show the entire raster.\nI was informed that this is standard operating\nprocedure.\nBy following such a procedure, you get increased\noperating life, increased resolution because you are\nusing more of the target, and if deflection drifts, the\nvideo control operator is aware of it. Yet, I have\nvisited stations where there was no monitor adjusted\nso that the entire raster could be seen and no corners\ncould be seen on the camera viewfinders. Consequent¬\nly, no one knew how much they were underscanning\nthe target.\n*****\nFor these NAEB stations who have Magnecord\nPT6-A and PT6-J magnetic tape recorder combina¬\ntions, factory modification information is now avail¬\nable which will bring these machines to conformity\nwith those having NARTB approved response. The\nchanges are simple for those PT6-J amplifiers that in¬\ncorporate the 5881 output tubes and a 5879 input\ntube. We’ll be glad to supply Thermofax copies upon\nrequest; or you can get the original by writing to Mr.\nHugh J. Daly, General Sales Manager, Magnecord,\nInc., 1101 South Kilbourn Ave., Chicago 24, Illinois.\nThe schematic is on 8V2 x 11 paper which makes\nsome component values a bit hard to read on our\ncopy. Necessary modifications for the PT 63-J and PT\n6-BN will be made available later.\n*****\nA search through the files of these columns fails\nto disclose mention of an article in the SMPTE\nOCTOBER, 1957\n11"
}