{
  "id": "d1825-4",
  "text": "NETWORK NEWS\n—Bob Underwood\nI am looking forward to the Convention this month\nwith great anticipation since it will provide an op¬\nportunity for me to meet with many of you to discuss\ncommon problems plus presenting the opportunity\nfor a pleasant social visit in good old St. Louis.\nAs I understand it, there will be two days by\nwhich we may meet to conduct such discussions. Dur¬\ning the first business meeting of the Convention, the\nannual network report will be presented. If at that\ntime anyone has either a question or a comment or a\nconstructive criticism regarding the network service,\nthat is the time for him to stand up and speak out.\nFrankly, I hope some people do stand up and offer\nsome comments regarding the service we have been\ntrying to provide over the years. We can’t give you\nwhat you want unless we know what it is. I’ll do my\nbest to answer your questions, and if I don’t know\nthe answer. I’ll try very hard to find it.\nThe other way by which we meet is informally.\nPlease feel free to aproach me at any time, even if it's\njust to say hello. The Convention isn’t all business.\nThe 4th quarter, 1957, programs are now being\ndistributed, and we wish to take this opportunity to\nthank all stations for getting their orders in before\nthe deadline date. This type of cooperation really\nhelps us to work efficiently in your behalf.\nNow in preparation is the offering for the 1st\nquarter of 1958. This offering will appear earlier than\nusual due to the fact that my vacation and the rush\nof pre-convention activities make it imperative that\nthe offering be done now; otherwise it would appear\nafter the Convention, and that would be much too\nlate. This is an offering containing many new series\nincluding grant series on the American theater today,\nmental health and aspects of eurrent penal systems.\nWe believe you’ll find these and all of the other series\nin the offering of interest.\nWe are prepared to receive all of the 1958 in-school\norders, so those of you who have not done so please\nsend in your order before the appointed deadline date,\nNovember 4.\nSee you all in St. Louis!\nBOX SCORE\nTotal FM stations -\n3113\n(includes\n138\nnon-commercial)\nTotal AM stations -\n668\n(includes\n37\nnon-commercial)\nTotal TV stations -\n555\n(includes\n27\nnon-commercial)\nPLACEMENT SUPPLEMENT\nOctober I - Young psychologist, Ph. D., with skill in writing, as\nwell as interest in problems involved in promoting bet¬\nter standards in mass communication field, desires\nposition in which he may contribute talent while learn¬\ning practical aspects of production and programming.\nPrefers East or West Coast. Salary open.\nNEW EDUCATIONAL\nBROADCASTING DEVELOPMENTS\nTwo stations, KTCA-TV, St. Paul-Minneapolis,\nand WHYY-TV, Philadelphia, which opened’ their\nregular broadcasting schedules Sept. 16, have brought\nthe number of ETV stations now operating in the\ncountry to 27.\nKTCA-TV, intended for use by the Twin Cities’\npublic school systems, local civic groups, the state’s\n14 private colleges and the University of Minnesota,\nwill operate about 40 hours weekly.\nWHYY-TV, which is owned by a corporation con¬\nsisting of local educational and cultural institutions,\nhad been delayed one year by financial difficulties\nbefore it could go on the air.\n^ Activation of two new ETV stations at Florida\nState University, Talahassee, and the University of\nFlorida, Gainesville, has been approved' by respective\nstate and’ school authorities.\nApproval of the two stations paves the way to a\nproposed microwave network that will link univer¬\nsities, junior colleges and eventually high schools of\nthe state.\nFlorida State University’s FM radio station\nWFSU will increase the power of its transmitter from\nTO to-1,TOO watts, Raymond D. Cheydleur, manager\nof the station, announced. The power boost, estimated\nto cost about $10,000, is expected to extend the\nstation’s signal radius to 40 miles from the campus.\n^ FCC Examiner Millard F. French has recom¬\nmended that Texas Technological College at Lub¬\nbock be authorized to operate an ETV station on\nChannel 5. TTC plans to build its station with public\ndonations, which will include about $30,000 from\neach of the two Lubbock commercial stations KCBD-\nTV and KDUB-TV.\ny The Kewanee (Ill.) Board of Education has\napplied for an FCC permit for operation of a\nnoncommercial educational FM radio station.\n—N A E B—\nOCTOBER, 1957\n5"
}