{
  "id": "d1825-7",
  "text": "y Seymour N. Siegel, director of WNYC, New York\nCity, has left for the Prix Italia meetings in Taormina,\nItaly. While abroad, he expects to make a flying\ntrip to Israel and Turkey and also to visit the BBC\nin London on his way back.\ny Miss Marguerite Fleming, manager of radio sta¬\ntion KSLH, St. Louis Public Schools, aided by mem¬\nbers of her staff, conducted a radio workshop at North\nHigh School, Evansville, Ind., on Sept. 19. The work¬\nshop was sponsored by the Evansville Teachers Assn.\ny Mrs. Harriet Davis Dry den has resigned her posi¬\ntion as META’s program supervisor, according to Dr.\nAlan Willard Brown, president of the organization.\nFor the past ten years Mrs. Dry den has been as¬\nsociated with public service broadcasting at NBC,\nCBS and the Ford Foundation.\ny Two new radio-TV instructors have been ap¬\npointed to the faculty of New York University’s Di¬\nvision of General Education, Dean Paul A. McGhee\nhas announced.\nRandy Kraft, free-lance TV and radio announcer,\nand Donald Collins, chief engineer for META, will\ninstruct during the fall semester in the Division’s TV-\nradio curriculum.\nPROGRAMS\n► The “Minnesota Private College Hour,” which in¬\nitiated its first telecast on KTCA-TV, Minneapolis-\nSt. Paul, on Sept. 16, will offer seven credit courses\n'during the current academic year.\nOf the 14 private colleges which participate in the\nproject, several combined their efforts for the pro¬\nduction of educational program series.\nThe “Minnesota Private College Hour” may be\nviewed from 8 to 9 p.m. Mondays through Fridays\nover channel 2.\n► Seven-hundred students in 22 Nebraska high\nschools will receive their instruction this year by TV\nfrom the University of Nebraska’s educational sta¬\ntion KUON-TV. The figures indicate a sharp rise\nin Nebraska’s ETV activity over last year when only\nsix high schools used the University’s TV instruction\nfor 125 algebra students.\nThe boom in Nebraska’s TV teaching, according to\nDr. K. O. Broady, University of Nebraska Extension\nDivision director and chairman of the Nebraska Ed¬\nucation Television Committee, is stimulated by the\nsuccess of last year’s TV teaching, the teacher short¬\nage and by the fact that the Nebraska plan combines\nTV and correspondence class methods. This combina¬\ntion, Dr. Broady holds, gave rise to a $115,000 grant\nfrom the Fund for the Advancement of Education to\ninsure the operation of this year’s Nebraska project.\ny “Fundamental Economics, a round-table study, is\na new TV series on the Windy City’s WTTW-Channel\n11, combining the uses of TV with direct in-plant\ntraining conferences. Each of the 10 TV sessions, 20\nminutes in length, will immediately precede longer\nconferences taking place in industrial and business\norganizations all over the Chicago area.\nThe series is produced by WTTW in cooperation\nwith the Commerce and Industry Division of the\nHenry George School of Social Science and partici¬\npating Chicagoland companies.\ny The ETRC has distributed to its affiliated stations\na series of 48 kinescoped programs entitled “French\nThrough Television.” The programs, which were\naired live earlier this year over educational station\nWGBH-TV, Boston, make up an introductory course\nin French. At least 23 communities around the coun¬\ntry will have an opportunity to view the lessons this\nfall.\ny “Problems of Everyday Living” is a META-pro-\nduced series of TV programs which can presently be\nviewed over WPIX, New York City, on Mondays,\nWednesdays and Fridays from 11:30 to noon.\nThe series, termed by a META spokesman “a\nmajor educational project in community mental\nhealth,” is designed primarily for women who make\nup the largest TV daytime audience. Without pre¬\ntending to be a panacea for the vast emotional stres¬\nses of our times, the programs bring to the open many\nof the anxiety-provoking questions of normal every¬\nday living.\ny The University of Alabama expects to bustle with\nTV activity during the coming year. Thirty live pro¬\ngrams and 20 film programs are scheduled for weekly\nproduction.\nFor in-school viewing throughout the state, the\nUniversity will televise complete courses in high\nschool Spanish and chemistry as well as eight enrich¬\nment courses in eight other subjects.\nTo adult evening viewers, cultural and informa¬\ntional programs will be presented’.\nAll University of Alabama programs are televised\nsimultaneously on educational channels 2, Andalusia;\n10, Birmingham; and 7 Munford. They can be viewed\nby about 75 per cent of the state’s set owners.\ny To help encourage young people to enter careers\nin science, New York University in cooperation with\nthe NBC is presenting a weekly TV science series en¬\ntitled “Watch Mr. Wizard.”\nDr. Morris H. Shamos, chairman of NYU’s\nPhysics Department, serves as advisor to the pro¬\ngram’s host and creator, Don Herbert. Producer of\nthe program is Jules Power.\n“Watch Mr. Wizard” is designed to present science\n8\nNEWSLETTER"
}