{
  "id": "d411-108",
  "text": "TELEGR. : UNESCO PARIS\niEcm^E&\nnaeb HEADQUARTERS\nUNITED NATIONS EDUCATIONAL,^SO^NTiFIC AND CULTURAL ORGANIZATION\nORGANISATION DES NATIONS UMISS POUR L'EDUCATiQH, LA SCIENCE ET LA CULTURE\n19, Avenue K I 6 b e r , PARIS 16®\nIn your reply, please refer to :\nEn rgpondani, veuillez rappeier .\nN- MC/CH/758.112 (ch.iii/3)\nill. February 1958\nDear Dar* Skornia,\nI am v/riting to you on the advice of Mr, Cassirer, Head of the\nTelevision Section of the Department of Mfeiss Communication, Unesco.\nI am carrying out a survey for Unesco on the use of audio-visual\ntechniques in fundamental and adult education* Its purpose is to take\nstock of experience gained, especially during the past ten years, and to\nevaluate the results of significant experiments in this field, with a view\nto making practical suggestions to Member States for the development of the\nuse of the audio-visual media and to defining Unesco’s future action.\ni One aspect of my study is the combination of regular, specially\ndesigned radio or television broadcasts, for adults, accompanied by corres-\nv pondence course, i.e. by a planned system of correspondence to ensure the\ncontact between those following and those directing the course, and eventually\nto enable the students to obtain the requisite qualifications (certificates,\ndiplomas, degrees)*\nI am planning to send a letter to a number of institutes, organi¬\nsations and universities all over the world, engaged in this type of adult\neducation, asking for information on the nature and the scope of these courses,\ntheir organisation, their effectiveness, the results obtained and on expected\ndevelopments* I am also envisaging making a special detailed study on what a\nsmall number of carefully selected American universities are doing in this\nfield, separately for radio and for television* I should be much obliged to\nyou if you could give me an answer to the following questionst\n&/[\n1* What research on this subject has been done and which publi¬\ncations could furnish me with the information I have\nmentioned above?\n°{’M^SMyUj iV/iWi iff.\n1 fatter* ! Dr. Harry J. Skornia,\nTTI*V/rs nn+T-rro Tin\nUir\nExecutive Director,\nNational Association of Educational Broadcasters,\nllj. Gregory Hall,\nUKBANA. Illinois.\nU. S. A."
}