{
  "id": "d411-112",
  "text": "March 17, 1956\nDr. Burton Paulu\nDirector of Radio and Television\nUniversity of Minnesota\nMinneapolis 14, Minnesota\nDear Burton:\n1 have just received notice from the Fund for Adult\nEducation that 1 will be awarded a grant for a year of\npost-doctoral study at Columbia University and Its Bureau\nof Applied Social Research next year. Needless to say, 1\nam quite excited by all of this. X have wanted to do it\nfor some time. This will give ms the opportunity to take\nadditional work in the area of attitude development and\nmeasurement, etc. X will also be working at the Bureau of\nApplied Social Research where X will be able to learn more\nabout their planning, organisation, and administration of\nlarge research projects. In addition to all of this, and\nperhaps even more important, this will give me time to sit\nback and think about where X am going, the directions in\nwhich television at Iowa ought to go, and the ways in which\neducational broadcasting can best serve society. X do not\nmean for this to sound as presusqptuous as it does. X am\ncertain, however, that you understand. We get so much in¬\nvolved in just dealing with the daily crises and deadlines\nwhich are always upon us that we never have a chance to think.\nWe never are able to sit back and take a very objective look\nat ourselves and what we are doing. X hope that X can do at\nleast some of that during this next year.\nHowever, X am getting off the subject. The reason X\nam writing is that X thought you should know about this be¬\ncause you might want to change the chairmanship of the research\ncommittee earlier than usual. X will be here until mid-August.\nX will then be in New York City until the following June,\nreturning here again for the summer session. X will probably\nnot be able to attend the 1958 convention and will be somewhat\nout of touch. X will be happy to continue serving as chair¬\nman but, on the other hand, will certainly understand if you\nfeel that someone should be serving who is in the midst of"
}