{
  "id": "d411-117",
  "text": "Kerch £f 1956\nTo the following Television Committee Chelrrnenj\nInward Wegener* Production Center\nLawrence Creahkoff* Television Closed Circuit\nRichard Elder* Television lUumgSMnt\nWilli an Harlej* Television Programming\nFranklin Bouwssia* a& Hoc UHF Tax Comitt®®\nTo the following Committee Chairmen Insofar as television Is\nconcerned; /\nSm Becker, Be search\nOslo Adkino* Utilisation\nClair Tettcmer* Utiliseticn-sub comlttoe Chairman\nCarl Manser* Engineering\nRobert Bchonkkan* Governmental Representation\nGentlemen;\nAs you know at the St# Louis and Chicago Board rice ting*# serious\nthought was given, to the educational broadcast movement in these\nUnited States* As a, result of Board action based on. recomenda**\ntions aado by the then active Television Operation and Development\nCommit tea md growing out of the A11 or ton House Management meetings*\ntelevision commit tees of the Association were restructured and up¬\ndated to meet the needs md better serve the demands of all tele¬\nvision members. The Television Operation and Development Committe©\nhas since been eliminated, in view of the restructuring* Five\ncommittees now cover no re specific areas*\nIn an additional effort to bring about greater efficiency within\nNAEB* President Paulu has asked a© to act as a coordinator for\nall Association television activities* While this action cannot\nbe interpreted as m official Vice President for television, it\nnonetheless means that as Vice President* I will give major\nemphasis to this arcs of Association activity* In addition to\nwhatever assignments are given me* I will serve in two major\ncapacities in regard to televisions I will represent the tele¬\nvision committees to the Board md interpret Board action on behalf\nof the committees*\nAs television coordinator, working through the Executive Committee\nand the Board, I can forward requests for action to the varlc.ua\nTelevision Committees* coordinate activities* interpret Board\nactions md pass along Information to the Committees — in general\nact as m expediter*\nmore"
}