{
  "id": "d411-123",
  "text": "■2~\n(3) It seems t© me that the announcement about the greets shmid\ng© cut much curlier **** at leest by the middle o£ September ****\ns© that researchers haw three months or s© t© develop a good\nproject rather than throwing something together la a few weeks*\nThis will give a researcher time to develop his problem\nf—fM related research., etc* X suspect that many of those\nwho have submitted proposal© have had no idea of the related\nresearch9 where their project fitted into our general knowledge\nof the coasouuaicAtlon process , whether it truly made a coatri**\nbuticns to knowledge which was more than local and historical,\netc •\n(4) iter much should b© used for this ©£ the $2,000*00? Ml?\nthree-quarters? Half?\nb) Should some of th*« ®©aey be used for a ecsssi&itt©© project? If\nso,\n(1) How much?\n(2) tihat cesssalt&ee project?\n<a) Clarence Flick, for had an interesting idea\nwhich ©asm out in a recent exchange of correspondence.\nThis is related to one of the ideas we discussed last\nDecember in Chicago. It is to set up a stratified\ndomographie audience sample through the cooperation of\ninterested universities and stations* A small sample\nwhich could be reached through each station for research\npurposes sdgfet provide a valuable nationwide gatapling\nservice for educational broadcasting. (Clarence, by the\nway, is moving to San Jose*)\nc) Should some of this money be used for publications of some kind?\n(1) W© have talked in the past about a series of pallets which\nwould explain to station managers how they could do various\nkinds of simple studies* I have started one on coincidentals,\nwhich I promised the cossaittee saaettae ago, and hope to\nfinish during the vacation period between the end of summer\nschool and the beginning of the fall tern* I am not imply¬\ning that it will be worth spending the comltte@8s mosey on\nbut rather raising the question of whether this is the kind\nof thing which you feel should be done •• keeping in mind\nthat each project that we do takes money and that means less\nw&ney for something else*\nd) Should seme of this $2,000.00 be set aside for a meeting!\nIf so, a emoting for what purpose!\nItese are a few of the possibilities which seed coraaitt®® discussion.\n1 would also like to receive the reactions of these of you who will sot\nbe in Colusfeus on the above natter and on those below.\n2. Xf we get more than $2,000.09, what then!\na) What would be the best procedure for insuring, or at least in¬\ncreasing the probability, that sound research would result\nfrom the funds availablef"
}