{
  "id": "d411-125",
  "text": "o\nSEMINAR ON INSTRUCTIONAL USES OF\nTELEVISION AND RAOIO\nAT,-LERTONH<HJSE , UNIVERSITY OF ILLINOIS, July 21-25, 1C5S\nThe National Association of Educational Broadcasters will hold a seminar on\nInstructional Uses of Television and Radio at Allerton House, the University\nof Illinois conference center near Monticello, Illinois, July 21-25, 1958. This\nseminar is made possible by a grant from the Ford Foundation.\nThis seminar is designed for educational broadcasting personnel responsible\nfor planning and structuring elementary and secondary instructional programs\nand for those in teacher-training institutions responsible for courses in teach¬\ning methods, etc. It is hoped that bringing in this latter group will increase\ntheir awareness of the real potential of radio and television as instructional\ntools and will stimulate improved preparation and training of future teachers\nin the use of these tools.\nEach NAEB Active and Associate member may nominate one person from each or\neither of the following categories:\n- Nominate from the staff of your educational station or production center\nthe person whose responsibilities bring him/her most frequently and\nclosely into the actual and total process of planning and preparing in¬\nstructional radio and/or television programs and facilitating their utili¬\nzation .\n- Nominate from your own or another institution a person in a department\nor school of education who is engaged professionally in the training of\nteachers for the public schools. Specifically, this should be an in¬\nstructor of courses in teaching methods or curriculum, a director of\nstudent teachers, or a critic teacher in a laboratory school.\nNominees will be selected, by a committee of NAEB members, from each cate¬\ngory independently and the approval or disapproval of a nominee within one of\nthe two categories will have no bearing on the potential success of the nominee\nfrom the other category from the same institution. The selection committee\nwill attempt to have approximately-thesam.enurnber from each category in the\ngroup finally selected.\nt-\nVo AWt.\n© B\\ © liL ©\na>\nid)"
}