{
  "id": "d411-139",
  "text": "2. If we get more than the $2,000, we better get together at once.\naj 1 think that we can get the sound basis you talk about by tightening\nour selection of research applications#\nIf we*re talking about ”big money” we need to get a research director.\nb) I have no ”hot ideas” for a possible research director# If we have to\nsend a man out to Washington to talk Health and Welfare out of some\nmoney, it 11 take one kind of bird—and one that Hqs# will want to\nhave a final say on.\nIf he doesn't have to hunt for funds, perhaps as Chairman it might\nbe well for you, if I may suggest it, to take a look at a couple of\nthe members of the committee itself. —Let's face it, there are few\npeople who are really qualified in this area and only a few of these\nsnend full time at it.—It might be that Merrill might be just the man,\nperhaps Adkins. I honestly don't know. They might not even be interested*\nthey may not even qualify for what we have in mind. All Ifm saying is\nthat they should be considered, and a hard look taken at their credentials#\n——Guess I'm thinking about the make up of the old committee. How does\nTannenbaum look—or Kumata?\nI’m certain that Harwood wouldn’t want it, and I certainly don't\nqualify, so that leaves you. —If you were interested I think that\nyou could have it-—and say that you take a leave of absence for a\nyear to get things rolling.\nc) If we do get some real money, and if we are able to get together, I\nwant to point out that we better have Harry and Burton there. No need\nto spend all of that money and then report to them by letter. Both S.and H#\ncould quickly clear up some of the muddy points in our minds#\nIrv Merrill's suggestion concerning the Bureau of Census is excellent. If others\nfeel that way perhaps you should go right ahead and request NAEB to act on it.\nThanks for the tip on Stephens College.-IDon’t know how much longer any of will\nlast here. Starting last week ALL must keep a diary of everything we do: this\nconsists of writing down exactly what you do, to whom you speak, when you go\nto the John, etc.—Well, Eleanor made some re alii money out of \"I^jrDay.\"—Do you\nthink I could get Hqs. to publish this? Might be worth a good laugh to the boys.\nCordially,\nRaymond D. Cheydleur\nAssistant Director"
}