{
  "id": "d411-24",
  "text": "sj/ju . f/Q0\nJanuary 20, 1958\nOr. Burton Foulu\nStation KUOK\nUniversity of Minnesota\nMinneapolis 14, Minnesota\nDear Burton:\nX appreciate your letter and comments concerning Bey Cheydleur.\nX obi fully cognisant of the fine work which he has done for the\nNAEB and 1 certainly intend to lean heavily — as well as the other\nmeabers of the committee. X believe that every member of this group\nhas a great deal to give to the NAEB.\nBeing a novice committee chairman in the organisation, I am\nnot cos^letely certain of procedures and so X hope that you trill\nfeel free to set me straight when necessary. For example, X have\nno idea of the process by which expenses for the year in NAEB are\nbudgeted. Once the report of our Columbus research seminar is com¬\npleted and polished, we will begin working on our specific research\nproposal, or proposals, for which foundation money will need to be\nsought by the NAEB. X believe that much of the preliminary work\non this proposal should be carried on by correspondence so that each\nindividual on the committee can give much thought to the matter over\na fairly long period of time. Ultimately, however, I would assume\nthat we will need to gather in a room and pin down the specific pro¬\nposal and accompanying details. X would think a meeting in Chicago,\nsimilar to the one at which the Columbus seminar was planned, with\nthe members of the research committee plus you and Harry, is a\nnecessity. Mbat X am saying, X guess, is that I hope funds can be\nset aside for such a meeting. X assums that this la a matter which\nyou con take before the board of directors. X would think that the\nsame amount of money which was budgeted for our other Chicago meeting\nwould be adequate for this one.\nThis weekend I have been going through the research correspondence\nand records of the post few years which Bay forwarded. X find that\nwe have copies of only two of the reports of research supported\nby Grants in Aid. X believe it might be helpful in"
}