{
  "id": "d411-6",
  "text": "copy\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 GREGORY HALL\nURBANA, ILLINOIS\nSent for the information of\nStation KUOK\nUniversity of Minnesota\nMinneapolis lb, Minnesota\nDr. Sea L. Seeker\nDirector, Division of\nJanuary 2, 1958\nTelevision-Eadio-Pilm\nState University of Iowa\nIowa City, Iowa\nDear Seat\nI speak for headquarters as well as for myself when I express\ngratitude for your willingness to accept the post of chairman of the\nHASS lie search Committee. This is an area in wbioh KAEB has been doing\nmore and more lately. Bob Coleman gave this committee a lot of time\nand thought several years ago. Say Cheydleur did yeoman service last\nyear.\nSow—with Bay‘a full approval—we are handing this over to you.\nBay is continuing on the committee, however, and that is good, alnoe\nit will glva us oontinuity. Besides, he can help in concluding some\nof the activities currently in progress. In fact, you may want to\neat up an occasional subcommittee with Bay at its head to wind up\nsuch projects as are In midstream. For your information, a list of\nfull membership for 1958 is attached. An you know, we have tossed\naround by mail and telephone the question of whether to enlarge the\ncommittee by including some \"name\" people from outside our ranks.\nAfter giving this much careful consideration, I’ve decided against\nit. We’ve found that committees become unwieldy If too large, and\nfurthermore that the ©oats of meeting become excessive. But, there\nis nothing to prevent our setting up an \"advisory council,\" or some\nsuch thing whenever we want to* then we could bring in Foshay,\nLazarafeld, Mlelsen, Hooper, Dick Mixon, et alii.\nThe Kesearoh Seminar held at Columbus (which other MASB duties\nunfortunately prevented my attending) made a strong recommendation\nfor a full-time research director. Thle suggestion surely meets with\n*jr approval, and 1 imagine gets Harry’s okay as wall. I shall include\nthis among the items on the agenda of the Foundation Committee, which\nwill be meeting within the next few weeks. If put into effect, I\npresume it would require funds additional to those now available to ue.\nWelcome to the ranks of BABB committee chairmen. And power to\nyou in your new position!\nWith beat regards for a Happy Mew Tear,\nYours sincerely.\nBPtds\ncos Harry Skomla, Jack McBride,\nBurton Paulu\nPresident\nBay Cheydleur, Bob Coleman"
}