{
  "id": "d411-87",
  "text": "ft : C .ftmd .\nf It «\nNational Project in Agricultural Communications\nAMERICAN ASSOCIATION OF LAND-GRANT COLLEGES AND STATE UNIVERSITIES • AMERICAN ASSOCIATION OF AGRICULTURAL COLLEGE EDITORS\nJ\nSTANLEY ANDREWS\nExecutive Director\nWELLS HALL ♦ MICHIGAN STATE UNIVERSITY\nEAST LANSING, MICHIGAN\nFebruary 7, 1958\nDr. Sam L. Becker, Director\nDivision of Television-Radio-Film\nState University of Iowa\nIowa City, Iowa\nDear Sam:\nThanks sincerely for the comments and suggestions on the proposed\ninventory-digest of radio research. The two concerns you mention are\ncertainly important and right in the spirit of the things Ken and I dis¬\ncussed as a basis for his formal proposal.\nBriefly, the idea is to add a section to the kind of treatment that\nKumata made in his inventory. This section will undertake an analytical\ntreatment, covering theory, methodology, validity of findings, etc. The\ngeneral idea of this \"extra” section adds up to a commentary on the\nvalidity of what we have learned and on the validity-reliability of the\nmethods we have used. You can appreciate that the problem is, in a sense,\ncircular as it is \"impossible” to separate research findings from method.\nMoreover, in this particular case, the fact that the compiler might have\nreservations about methods, findings, etc. is going to have an impact on\nwhat he includes in the \"descriptive” section of the inventory.\nRight now, Ken is in the process of developing a proposal. NAEB has\nagreed to co-sponsor the venture, as you know. I have not heard from ETRC\nand have some misgivings about the time it is taking them to arrive at a\ndecision. Some after-the-fact information that I have picked up suggests\nthat our approach would have had more effect if it had been based on this\n\"after” knowledge, but we shall see what we shall see.\nI shall keep in touch as things develop and share with Ken all of\nthe good ideas and offers of help that have come from the seminar parti¬\ncipants .\nSincerely yours.\nJMPsts"
}