{
  "id": "d411-91",
  "text": "UNIVERSITY OF SOUTHERN CALIFORNIA\nUNIVERSITY PARK\nLOS ANGELES 7\nFebruary 6, 19£8\nProfessor Samuel Becker\nChairman NAEB Research Committee\nTelevision Center\nState University of Iowa\nIowa City, Iowa\nDear Sam,\nCongratulations on your appointment as chairman of the research\ncommittee. I hope that the hectographed materials are sufficiently\nself-explanatory to support the modestly arbitrary position that I\nhave taken in recommending Browne, Kager, and Paulu to Skornia for\ngrants in aid.\nPrivately and personally I agree wiph you that Kager*s application\nMas-the only reasonkhly worthwhile, .one^' You may care to suggest to\nSy Kager that Kumata, Merrill, and I urge him to take extreme care in\n...Refining and identifying opinion leaders. As Merrill and Kumata suggested\nhe should consider carefully the possibility of obtaining his information\nthrough personal interviews.\nThe committee is at fault for having let the Browne matter continue\nfor as long as it has. Probably Browne does not deserve reimbursement\nof $100, but the reputation of the committee is worth at least that much.\nI agree with you that the proposed Paulu study is not worth more\nthan $300, and that Paulu* s presidency of NAEB admits some question\nof priority in our recommending him for a grant. In view of the\navailability of more money than was allocated tentatively during our\nmeeting in Chicago, and in view of the recommendations of the other\nmembers of the subcommittee, Paulu*s proposal seemed next best after\nKager * s.\nAll of the remaining proposals appeared to me to be so weak as to\nmerit very little consideration.\nHere are a few ideas regarding future NAEB research projects as\nrequested through your letter of January 28 to Keith. Hold three or\nfour annual two-week-workshops for the purpose of increasing the\nmethodological and mathematical proficiencies. Complete and extend\nthe bibliography by Paulu that was published by NAEB several years\nago. Do another monitoring study in the Smythe-Remmers series."
}