{
  "id": "d1785-0",
  "text": "OFFICERS\nEXECUTIVE COMMITTEE\nPresident: R. C. HIGGY, WEAO\nColumbus, Ohio\nVice-President: CARL MENZER, WSUI\nSTATE UNIVERSITY OF IOWA\nSecretary-Treasurer:\nB. B. BRACKETT, KUSD\nUNIVERSITY OF SOUTH DAKOTA\nVERMILLION, SOUTH DAKOTA\nof\nCallage. ar\\A UniVey^iiy\nIVoad casing\nOffice df Executive Secret,\nT. M. BEAIRO, WNAD\nSPECIAL BULLETIN\nRelease Date February 18, 1S32\nFIRST ZONE: DANIEL E. NOBLE, WCAC\nCONNECTICUT AGRICULTURAL COLLEGE\nStorrs, Connecticut\nSECOND ZONE: vl. B. HASSELMAN, WKAR\nMICHIGAN STATE COLLEGE\nEast Lansing, Michigan\nThird Zone: garland POWELL, WRUF\nUNIVERSITY OF FLORIDA\nGainesville, Florida\nFOURTH ZONE: W. I. GRIFFITH, WOI\nAm es, Iowa\nfifth ZONE: H. V. CARPENTER, KWSC\nSTATE COLLEGE OFWASHINGTON\nPULLMAN, WASHINGTON\nAT LARGE: CHARLES A. CULVER, KFMX\nTo: T!embers of the Association of College and University Broadcasting Stations\n(And a special request mailing list in addition to members)\nThis office is advised from several sources that the NAB has released a mimeo¬\ngraphed bulletin, flooding stations throughout various sections with copies,\nquestioning the Association of College and University Broadcasting Stations bul¬\nletin released on January 25, 1932. You recall that this Association bulletin\noffered comments on how educational stations should answer the special question¬\nnaire released by the Federal Radio Commission.\nThe NAB (in an unsigned mimeographed bulletin in which a copy of the Association\nbulletin is reprinted) questions the honesty and motives of the Association in\nsuggesting an interpretation of the questionnaire, more especially on the basis\nof tne wire sent to the office of the executive secretary by one of our directors.\nMay *we hasten to state that officers of this Association have no thought in mind\nof sending to the Commission any statements except statements of fact. Is there\na logical reason why educational stations should not report the broadcasting of\nathletic events as an educational feature of their programs? Is there a sound\nreason why educational stations should not report on the Federal Radio Commission\nquestionnaire the broadcasting of an hour of music by their college or university\nsymphony orchestras as educational? Is there a reason why any member station of\nthis Association should not report a fifteen minute or two hour dramatic presenta¬\ntion as educational?\nTrue, we cannot all agree on the meaning of the term \"educational.” Nor will we\never be able to acree on the term. There are decided opinions relative to its\nmeaning even among the NAB group and, needless to say, there is a like division'\nof opinion among members of the Association of College and University Broadcast¬\ning Stations. But again may we state that the features of program work as out¬\nlined above should be reported by this Association as educational.\nB’e venture the assertion that many stations holding membership in the NAB reported\nthe above mentioned programs as educational even though immediately following the\nfirst touchdown there was a solemn declaration that, ’’The ease and grace shown in\nthe play was due in part to a certain brand of cigarettes used bv the team, fol¬\nlowed, of course, by the use of a nationally known tooth paste while at the\nshowers\nSincerely you^rs,\noJ T 0 InjJL Ckl fudJ\nT. M. Beaird, Executive Secretary\nAssociation of College and\nUniversity Broadcasting Stations"
}