{
  "id": "d1843-2",
  "text": "nominations, many of which run to many pages, have\ncome in approximately as follows:\nWorkshop Grants-in-Aid\n25\nProgram Grants-in-Aid\n36\nScholarship Applications\n21\nResearch Seminar\n45\nVideo Recording Workshop\n40\nChildren’s Program Seminar\n40\nUtilization Seminar\n82\nETV Management Seminar\n35\nThe above, which, as you can see, run to slightly\nover 300 different applications for different proces¬\nsing, do not include other applications handled else¬\nwhere: network and in-school program submissions\nhandled by Robert Underwood and the network in¬\nschool committees; Fulbright applications in broad¬\ncasting for which I am on the selection committee;\nPrix Italia applications which are handled by Sey¬\nmour Siegel; the Purdue seminar, for which applica¬\ntions (please!) should be addressed to Jim Miles at\nPurdue; requests for consultation, etc. Nor does it\ninclude the several hundred travel vouchers and other\ndocuments and reports, growing out of these proj¬\nects, which we must also process. And many of these\ntoo, are often incomplete and necessitate our writ¬\ning for requested receipts, changes, explanations,\nsignatures, etc.\nThis, on top of the several hundred letters a week,\nkeep your three-man headquarters staff, as dis¬\ntinguished from the equally busy Network staff, fairly\nbusy, to say nothing of the three girls who are the\nsecretarial arm of the office. This small single office\nthey share with us and with those responsible for\nnetwork traffic, placement, and the Newsletter. Very\noften “where to put things” is a considerable problem\nin our small basement office, to say nothing of keep¬\ning them all straight. The fact that we must also\ntravel a great deal (I have been on the road sixty-\nnine days during the last six months) also complicates\nthe load for the person or persons left to handle it.\nBut so much for that. And apologies to our overseas\nreaders, library subscribers and others not concerned,\nwho “didn’t want to know that much about pen¬\nguins.” However, to those of you who do apply for\nthe various aids we offer, please submit everything in\nthe specified number of copies. Please?\n* * * * *\nThe long explanation above was not the point of\nmy remarks, however. The point was that whereas\nin these United States a few years ago, the educa¬\ntional broadcasting “professionals” could' all get into\none small room, they now number several thousand.\nWe believe that these people are better educators and\nbroadcasters as a result of the seminars, workshops,\nscholarships and other assistance which have brought\nthem together face to face, so that an “esprit de\ncorps” could develop, and have brought them to¬\ngether with many of the finest philosophers, educa¬\ntors, social scientists, historians, scientists, and other\nspecialists—the best the U. S. has to offer—to say\nnothing of broadcasters from Australia, Canada,\nBritain, France, Germany, and many other countries\nwho have helped them to define goals, refine methods,\nand develop a broader, deeper concept of the educa¬\ntional and social science responsibilities we have and\nmust have. A new definition began to emerge, not\nof a commercial broadcaster who works for an educa¬\ntional institution, but of an educator who thoroughly\nunderstands the power and responsibility of broad¬\ncast instruments, and is at the same time thoroughly\nprofessional in their use. That I think, is one of the\nNAEB’s greatest contributions—a contribution which\nwe could not have made without the faith, patience\nand support of the Kellogg, Rockefeller and Ford\nFoundations, the Fund for Adult Education, the Fund\nfor the Advancement of Education and others.\nLet me suggest the magnitude of this dynamic\nmovement in another way. So far, during the last five\nyears, with funds generously provided by Foundation\nsupport, we have held sixteen NAEB Regional Con¬\nferences in fifteen different cities. Over 500 people\nhave attended these conferences. Many tell us that\nthe relaxed, small groups represented in this type of\nmeeting—where we can be put on the spot, quizzed\nand otherwise be made to get acquainted with them\nfor several days, and be wholly frank and honest with\nthem—are the best thing the NAEB does. For here\nall kinds of problems are discussed and new ideas are\ndeveloped.\nDuring the last nine years, since the first “Allerton\nHouse” Seminar in 1949, the NAEB will by this\nAugust have conducted twenty-two Seminars and\nWorkshops for administrative supervisors, managers,\nprogram directors, producers, writers, engineers,\nstaging and lighting directors, research directors,\nchildren’s program directors, in-school program staffs,\nand teachers. This does not include the some thirty\nother workshops, seminars and special summer ses¬\nsion courses we have supported with grants-in-aid to\neducational institutions (attended by perhaps 300 ad¬\nditional educational broadcasters and teachers); yet\nwe find that nearly 500 different educational broad¬\ncast staff members have been given what several of\nthem have called the toughest but most challenging\nexperience in their professional growth in these NAEB\nSeminars and Workshops. Some 150 other educational\nbroadcasters have been able to improve their status\nand qualifications as educator-broadcasters through\nNAEB scholarship grants. A small handful have been\nable to spend one or two years in Europe, as Ful¬\nbright scholars, thanks largely to NAEB efforts in\nthis area.\nJUNE, 1958"
}