{
  "id": "d1843-5",
  "text": "and the Wisconsin State network.\n“Scrolls from the Dead Sea,” earning Honorable\nMention for WHA for broadcast over the Wisconsin\nstate network.\n“Pacific Portraits,” bringing Honorable Mention\nto station WHA for its broadcast over the Wisconsin\nstate network.\n“The Minds Of Men,” earning Honorable Mention\nfor the University of Texas and station KNOW for\nbroadcast over KNOW, Austin.\nOther First Awards for radio programs were pre¬\nsented to NAEB members: station WOSU, Ohio\nState University, for “The Pied Piper;” the Univer¬\nsity of Texas ana station KURV, Edinburg, Tex.,\nfor “Minstrel of a Thousand Years;” the Philadelphia\nPublic Schools for “Stars of Tomorrow;” University\nBroadcasting Service, station WFSU-FM, Florida\nState University, for “Prison Document;” station\nWUOM, University of Michigan, for “Trial of Gen¬\neral Porter;” station WILL, University of Illinois,\nand the NAEB network, for “Stories ’N Stuff;” the\nSouth Dakota School of the Air and station KUSD,\nUniversity of South Dakota, for “The Book Fair;”\nand Indiana School of the Sky, Indiana University\nRadio and Television Service, for “It’s Your World.”\nHonorable Mention recognition for radio programs\nwas given to: the University of Chicago and station\nWBBM for “The Sacred Note;” the University of\nCalifornia at Los Angeles and station KNX for “Uni¬\nversity Explorer;” the Minneapolis Board of Educa¬\ntion and station KTIS for “Tell Me a Story;” the\nNew York City Board of Education, station WNYE,\nfor “Songs to Remember” and “The Teller and the\nTale;” station WAER, Syracuse University, for\n“The Smoking and Health Issue;” the Indiana School\nof the Sky, Indiana University Radio and Television\nService, for “Getting and Spending” and “Portraits\nfor Today;” and the Baltimore Board of Education\nand station WBAL for “History Writes a Song.”\nTelevision honors included three First Awards\nwhich were presented to: the University of Michigan\nTelevision for its program, “Frontiers of Health;” sta¬\ntion WOSU-TV, Ohio State University, and the uni¬\nversity German department, for “Die Deutsche\nStunde;” and the Wisconsin School of the Air, station\nWHA-TV, for “The Friendly Giant—School Series.”\nHonorable Mention for television went to: the\nUniversity of Michigan Television for “Understand¬\ning Our World;” the Cincinnati Board of Education\nand station WCET for “Biology;” the Michigan State\nUniversity Extension Service for “County Agent;”\nNew York University and WCBS-TV for “Sunrise\nSemester;” and the New York City Board of Educa¬\ntion, META and station WPIX for “The Living\nBlackboard—Spotlight on Asia.”\nTwo Special Awards were also given for television\nprograms of NAEB members. The University of\nMichigan Television was cited for its program\n“Genius,” and station WQED, Pittsburg, was hon¬\nored for “A Dancer’s World.”\nThe award program, called the American Ex¬\nhibition of Educational Radio and Television Pro¬\ngrams, is sponsored yearly by the IERT. Its purpose\nis to further the broadcasting of significant educa¬\ntional programs by selecting outstanding examples for\nspecial awards. All the awards are based upon pro¬\ngrams actually broadcast by radio or television sta¬\ntions, networks and organizations.\nAPOLOGIES TO WHA\nOur apologies to Wisconsin School of the Air and\nradio station WHA, Madison, for erroneously\ncrediting in a news release their Ohio State Award¬\nwinning program, “When Men Are Free,” to the\nNew York City Board of Education and WNYE.\nTECHNICAL WORKSHOP\nPROVES SUCCESSFUL\nLast month’s NAEB Video Recording Workshop\nproved to be one of the most successful meetings\never held, according to evaluations of over thirty en¬\ngineers who attended.\nTalks and papers of outstanding personnel from\nindustry and ETV stations and adequate time allotted\nfor informal discussion added to the success of the\nworkshop, which was held in the studios of WTTW,\nthe Chicago Educational Television Assn, station.\nThis meeting, planned by Cecil S. Bidlack and the\nEngineering Committee, provided an invaluable op¬\nportunity for technical personnel to exchange ideas\nand investigate new processes and equipment. (For\nfurther details on the workshop, see “Technical\nTips,” p. 9).\n—NAEB—\nBooks are badly needed to fill the great need for\na public library available to the public in Manila.\nPresent demand for library service is indicated by\nthe lack of up-to-date textbooks and the overwhelm¬\ning public thirst for reading. Books will be welcomed\nby the recently formed Readers’ Library Assn., Inc.;\n622 Pinaglabanan; San Juan, Rizal; Republic of the\nPhilippines.\nNEWSLETTER"
}