{
  "id": "d1843-8",
  "text": "TV TECHNICAL TIPS\n—Cecil S. Bidlack\nJudging from the comments received to date from\ntwo-thirds of the participants, the NAEB Video\nRecording Workshop was an unqualified success. It\nwas held May 5 - 9 in the studios of WTTW, the\nChicago Educational Television Assn, station. From\nthe get-acquainted session Sunday evening to the\nclose of the workshop Friday noon, the exchange of\nideas and experiences was an almost continuous\nprocess. We did provide a few hours each night for\nsleeping, however many of the evening sessions con¬\ntinued over a glass of brew at the Cottage Bar of the\nShoreland until a late hour.\nMost participants mentioned how much the pres¬\nence of Rodger Ross and Harold Wright of the\nCanadian Broadcasting Corporation added to the\nprogram of the Workshop. I was more than pleased\nwhen they accepted the invitation to attend and\nespecially happy that they could be with us for the\nentire period. We are not only indebted to CBC for\nmaking it possible for us to have the benefit of their\nknowledge and experience, but as well to all organiza¬\ntions from the broadcasting and film industries whose\nrepresentatives contributed much to the success of\nthe workshop program.\nIn addition to providing much practical informa¬\ntion which the participants can incorporate in their\nown operations, the workshop highlighted three areas\nof work for the NAEB Engineering Committee:\n1) Investigation leading to a standard film repro¬\nduction characteristic\n2) Densitometer standardization\n3) Utilization of EIA grayscales to establish studio\nexposure practices.\nAt the completion of the first item, it is then believed\nthat we shall be in a position to re-evaluate the print\ndensity requirements for kinescope recordings as\nestablished by ETRC and perhaps to establish nega¬\ntive density requirements to produce these prints\nwith standard laboratory exposure and development\nprocedures.\n*****\nThe past month has been one of almost continuous\ntravel for the writer. Such a schedule isn’t the most\nconducive for the production of a column like this,\nnot because of the lack of new experiences or ideas\nbut simply because deadline dates seem so close to¬\ngether.\nRegardless of the present implementation of the\nvideo tape recording process for television program¬\nming, three papers were presented at the SMPTE\nmeeting in Los Angeles on kinescope recording. These\nalong with the seven presented on video tape record¬\ning should appear soon in the SMPTE Journal. A\ntotal of 82 papers were presented during the\nweek with the program somewhat heavier on the\nmotion picture side, as is usual for the west coast con¬\nvention.\nAt the NAB meeting the following week, broad¬\ncasting again came into its own with many new or\nimproved items being shown. Ampex was demonstra¬\nting both monochrome and color video tape recorders;\nGates was showing a new 1 kw AM and a 1 kw FM\ntransmitter with Multiplex. General Electric had its\nnew 3-image orthicon color camera in operation, as\nwell as a new monochrome image orthicon camera and\nlive and film vidicon cameras. They were also show¬\ning a transistorized (except for output tubes) sync\ngenerator and a newly designed audio console.\nRCA displayed, for the first time, AM and TV\nautomation equipment, a new TV switcher in which\nthe switching is done by transistors (relays incorpor¬\nated are for tally lights only), and a new magnetic disc\nrecorder which will record 70 seconds at 45 rpm. They\nwere also demonstrating their studio vidicon camera\nand a color camera and showing the RCA color\nvideo tape recorder transport mechanism. Sarkes-\nTarzian had complete film and live studio control\nequipment set up and in operation. There were many\nother exhibitors displaying lighting, transmitting,\nstudio, control and accessory equipment.\nThe 12th Annual NAB Broadcast Engineering\nConference session occupied two-and-a-half days of\nthe four-day meeting where an excellent program of\npapers covering AM, FM and TV subjects were pre¬\nsented. Due to lack of space, the broadcasting equip¬\nment was exhibited at both the Statler and' Biltmore\nHotels. Due to this geographical separation and also\ndue to the fact that there were several exhibition\nrooms at each hotel as well as exhibits in hotel rooms,\nas we look back we find we did not locate some of\nthem. Since the Video Recording Workshop began\nthe following Sunday, our time at NAB was neces¬\nsarily shortened.\n*****\nFollowing the workshop we spent four days at\nthe IERT in Columbus. This year, the equipment\ndisplay was larger than the previous year. ITA—\nIndustrial Transmitters and Antennas—was demon¬\nstrating a 10-watt fm transmitter as well as displaying\n50-watt and 250-watt fm transmitters. Motorola was\nshowing its new “Classroom 21,” a TV receiver de¬\nveloped especially for classroom use. This receiver is\ndesigned both for “off-the-air” or rf reception as well\nas to accept video and audio feeds from a closed\ncircuit studio without modification. It is provided\nwith a custom designed stand on wheels, featuring an\nJUNE, 1958"
}