{
  "id": "d1499-1",
  "text": "NAEB NEWS LETTER,_Dec. 1, 1940..... Page 2\npressing and handling charges only. They include a considerable\namount of public domain arrangements*\n\"To date, the following non-commercial stations have subscribed:\nWBBE Brooklyn, New York; WBKY Beattyrille, Kentuoky; WOSU Columbus,\nOhio; VWBI Chicago, Illinois; WHA Madison, Wisconsin; KWLC Decorah,\nIowa; WCAL Northfield, Minnesota; WTAW College Station, Texas;\nKF9G Los Angeles, California and KOAC Corvallis, Oregon.\n\"Although this problem of the commercial industry does not affect\nyou, I am sure you will be in sympathy with this effort to bring\nto an end a situation which has become intolerable.\n\"I appreciate the interest which prompted your inquiry and trust\nthat we may have the pleasure of receiving your support.\"\nSincerely yours,\n(Signed)\nCarl Haverlin\nManager of Station Relations\nBROADCAST MUSIC, INC.\nNovember 1, 1940\nYou will note that a number of NAEB members have already arranged\nto use BMI music. It is the feeling of the NAEB Executive Committee\nthat deoisions regarding this matter should be left to individual\nstations. However, don't fail to make your decision before it is\ntoo late.\nNA3U REPORT ON RADIO BROADCASTING\nThe Committee on Radio Broadcasting of the National Association of\nState Universities composed of President A. 0. Crane, chairman.\nPresident I. D. Weeks, President J. J. Tigert, and President C. A.\nDykstra made its annual report to the association on November 8\nin Chicago. Exoerpts from*the report are worthy of special note\nhere. Perhaps you will wish to read the oomplete report which\nwill be available in many of your libraries.\nOn progress in radio broadcasting, the commit-se report says,\n\"Last year's report showed remarkable progress in oivio broad¬\ncasting by state universities. This year's report shows continued\nand more rapid progress throughout the nation. The developments\nhave been so encouraging and so wide spread that it is very diffioult\nto summarize them. Consequently, the report of your Committee this\nyear will consist ohiefly of a summary of reports from individual\nschools. The \"High Spots\" are so numerous and so important that\nthe individual reports from the sohools are all worthy of attention.\n\"Last year*8 survey showed progress in the following features of\ncivic broadcasting:"
}