{
  "id": "d520-12",
  "text": "Mr. Mies:\nThe Neeley Printing donpany discovered that a shipping clerk had rade\na horrible mis take. He sent 66,000 blank folders to New York and only 20,000\nhere instead of the other way around*\nI spoke to Mr. Nick Karzes at Neeley printing. He authorized us to\nship the excess folders (about U£,000) from New York to Urbana by air freight\nat the printing conpany's expense. The Neeley Printing Company had farmed out\npart of the shipping job to another company — so the latter company is the\ngoat.\nI spoke to Bernard ^uck at WNYC. He said that there was no possibility\nof their sending out the folders from New York to the individual stations but\nthat he would cooperate in every way possible to get them back to us«\nHere is additional background information you should have.\nThe printing company mailed three shipments to New York.\nQ Imprinted folders by Acme Fast Freight left Chicago August 25?.\n^Blank folders by Be^er-Chicago Trucking Company left Chicago on August 25*\n^Approximately £,000 to 7>0C0 were sent ahead to New York by\nRailway Express on August 22 (WNYC has already received these.)\nWe gave Buck ihe above information by phone and then sent the telegram\n(attached) to give him additional information to help identify the folders as\nthey arrive in New York and to give him the exact nunfcer of folders which WNYC\nnhad ordered. Neither he nor I knew the exact number when we talked on the phone.\nBuck is going to send the folders air freight collect to us in Urbana.\nThe Printing Company man estimates that we should receive them in Urbana by\nSept enter 3 and U. He also suggested the Emory ^ir Freight Company to give\nus Blue Ribbon service (fast service to out-of-the-way places), and I gave\nthis information to Buck.\nHope you1re satisfied with the w^y we handled this horrible emergency.\nIt isn't very good, but it seemed the best we could do.\nLorraine\nP. S.s We have already sent to the individual stations about 18,000 folders.\nWe have 1,000 on hand here. Roz has the labels for the other 3£,000\nwhich should be sent out."
}