{
  "id": "d1836-2",
  "text": "-3-\nEurthermore (and EM transmitter manufacturers are not going to like this) the\nEM transmitter design isn’t too well stabilized as yet, and a heavy investment\nnow may prove unwise if the transmitter becomes obsolete in a year or two.\nThink seriously of having your own Engineering College build the transmitter\nif you have a faculty member or advanced student sufficiently talented and\nambitious. It has been done, and to the institution’s complete satisfaction;\nbut in case you want a factory job, a 250 watt EM transmitter will cost around\n$5,500.\nWith the transmitter you’ll need a combination frequency and modulation\nmoniter. This is required by the ECC, and you’ll not find anyone in your\ninstitution that will want to build one. The cost of a good one will be\naround $850.\nFor speech input equipment and microphones, I strongly recommend getting\ngood, standard items. The use of hgine-made equipment or attempts to adapt\npublic-address system amplifiers and microphones are serious mistakes. Don’t\ndo it! The desirable equipment to control one studio, one announcer booth,\nremotes, and recordings, with prices, is as follows:\n1 multi-studio console, including line\namplifier, monitor amplifier, seven\npre-amplifiers $1,150.00\n3 high quality microphones, stands\nand cords 320.00\n2 medium quality microphones, stands\nfind cords 100,00\nPlugs and outlet sockets for microphones 25.00\n1 remote outfit 275.00\n2 turntables, dual speed, lateral and\nverticle, complete 800,00\n1 program rack 100.00\n1 line equalizer 60.00\n2 double jack panels 120,00\n4 loudspeakers 250.00\nJack cords 30.00\n1 monitor amplifier 100.00\nTotal cost of basic speech-input\nequipment $3,330.00\nThe above equipment will adequately take care of usual needs. Later it\nmight be desirable to add such equipment as an extra remote outfit, additional\nmicrophones, sound effects (filter) panel, and recording units,\nYour antenna and antenna tower pose a problem when it comes to general¬\nization. Although the higher the latter the better, there must be a limit as\nto what can be spent, and this wi^l limit the tower’s height. Suppose you are\nable to locate your studio on the topographical hump mentioned earlier in this\narticle, and you can see out at least a mile from your roof. Let’s be\nconservative, at least for a while, and let your maintenance department fabri¬\ncate for you a 50-foot section of four-inch pipe, to be mounted on the roof\ndirectly over your transmitter and to be guyed to three points. Cost of tower\nand erection combined should not exceed $100,"
}