{
  "id": "d1696-2",
  "text": "itself to programs for schools. Other experiments are planned\nto knit the state into a single community by means of radio.\nFor example, the Workshop is considering a Friday-night\nbroadcast of choir rehearsals from a central point so that\nisolated communities may enjoy the services of a trained\nleader and benefit from superior direction and expert selec¬\ntion of programs. Similarly, the Workshop proposes to\nunite by radio all the choral societies of the state into one\ngreat chorus to study under skilled direction the same num¬\nbers. A massed performance yearly at some central point\nwill be the objective. Standardization? Perhaps, but im¬\nprovement certainly. Most of all, the experiment is impor¬\ntant because it involves co-operation from the listener rather\nthan passive reception, and that is something new in radio.\nAn effort is also being made, in co-operation with the\nUniversity station, WOSU, to study and develop new types\nof educational broadcasts. Several programs of an experi¬\nmental nature have been launched.-The advantages uf-ques=~\ntions and answers, guest speakers, dramatizations, and stu¬\ndent participation are being explored. Such presentations\nare, to an extent, replacing talks or lectures, and the pro¬\ngrams seem to be gaining in acceptance and interest.\nNot all the programs are instructional, however. Cul¬\ntural and inspirational programs have their place in edu¬\ncational broadcastingj so, also, the program that makes no\npretensions to being more than entertainment. The edu¬\ncational station must be all things to all people if it hopes\nto have an audience of any size, and without an audience\nit is as valueless as a newspaper without a circulation. En¬\ntertainment in the plan of the Workshop would be justi¬\nfied on the grounds of audience-building alone, but it has\na more important claim to attention. The Workshop must\nhelp to train the new crop of radio technicians who will\nbuild and present the nation’s run-of-the-mill, commercial\nprograms the day after tomorrow. The University will\ndoubly serve the state if it enables these future broadcasters\nto do a better job than is being done at present.\nSo, in various ways, the Radio Workshop at Ohio State\nUniversity is attempting to serve radio education by bring¬\ning to educational broadcasts the same professional tone, the\ncareful production and direction that audiences have learned\nto demand in radio programs. Neither school children nor\nadult audiences are edified or instructed by dull, uninterest¬\ning, amateurish programs. Radio education, if it is to thrive,\nmust take its cue from the professional broadcaster and sell\nits product as interestingly as the toothpaste manufacturer\nsells his. Radio can make learning an interesting, thrilling\nexperience, eagerly anticipated and treasured in memory.\nMore education at less cost will be the result if radio will\napply the seasoned advice of Alexander Pope: “Men must be\ntaught as if you taught them not.” Meredith Page\nApril\n“The Government can do nothing about such\nthings,” she said. “The only people who can do\nanything are the people who see it in the theater.\nIf they protest, the thing will disappear. You\ncontrol the opinion wherever that film or radio\nprogram or other thing is seen or heard and you\nhave the power to stop whatever is harmful to\ngood feeling between nations.”\n•\nA VERY successful panel discussion on motion\npictures is reported by Helen Rand Miller of the\nEvanston Township High School (Illinois). In¬\ncluded in the discussion were junior— and senior—\nhigh-school pupils, citizens, parents, teachers, and\na motion-picture exhibitor.\n•\nTHE reprint from the February California Jour¬\nnal of Elementary Education, “Radio in the Ele¬\nmentary School,” is available for free distribution\nto readers of the News Letter. A post-card re¬\nquest sent to the author, I. Keith Tyler, Ohio\nState University, Columbus, will be sufficient.\n•\nTEACHERS who would like to make a survey of\nmotion-picture attendance in their schools or com¬\nmunities will be interested to know that a num¬\nber of printed forms used for this purpose during\nthe Payne-Fund investigation are still available.\nThese forms are simple in arrangement and easily\ntabulated. They may be had from Mr. Dale at five\ncents the hundred, and those who apply promptly\nwill be furnished with as many as desired.\n•\nFIFTY reels of Erpi 16-millimeter sound pictures\nwere recently added to the film library of the\nOhio State Department of Education. Films in\nthis library are lent free to Ohio schools. More\nthan two thousand reels were used in February.\n•\nA PENNY postal card will bring you free a copy\nof any of the following reprints: by Edgar Dale,\n“Marriage and the Movies,” “A Discussion Con¬\ncerning the Proposed American Film Institute,”\nand “Teaching Motion-Picture Appreciation”; by\nI. K-eith Tyler, “Radio-in the High School” and\n“How to Judge a Radio Program.” Mr. Dale has\ncopies also of Russell T. Gregg’s “Experiences\nwith a State Co-operative Film Library,” an article\nthat appeared in the Educational Screen.\n•\nA STUDY of 3,512 children from 54 elementary\npublic schools in New York state made in 1934\nshowed that one-third of the children attended\nmotion pictures at least once a week, and that 6\nper cent of this third went twice each week.\nFrequency of attendance varied significantly ac¬\ncording to age. Among the older children—\neleven, twelve, and thirteen years—notably large\n[3]"
}