{
  "id": "d1696-3",
  "text": "wires connected to rings or other projections affixed to the mast at\ndifferent levels. In some cases these wires may be resonant to the\nantenna wavelength, and cause signal absorption or reflection. In\nsuch instances the lengths of these runs must be broken up by the\ninsertion of insulators. Extreme care should be used in installing\nand locating the antenna mast and the guide wires to eliminate any\ndanger of their coming in contact with power lines. Now it is time\nto attach the coaxial cable to the antenna making a reasonable attempt\nto match the antenna impedance to that of the line. It is desirable,\nof course, to run the coaxial cable from the antenna to the outlets\nthrough the interior of the building. This however, is both time\nconsuming and expensive. It requires drilling, fishing lines, and\ndefacing wall and woodwork areas. A simpler alternative is to run the\ncoaxial cable on the outside of the building to a point as centrally lo¬\ncated as possible with respect to the receivers which are to be served\nby this particular antenna. At this point an \"HM pad designed to\nmatch the single line from the antenna to the collective input impe¬\ndance of the receivers to be supplied must be inserted. If this pad\nis exposed to the weather it must, of course, be protected against\ndamage by rain. From the set side of the matching pad, cables are\nthen run to each individual set. It would of course be desirable to\nmake checks to determine how many receivers can be operated ef¬\nficiently from the single antenna by making temporary hookups before\nthe final installation is made.\nThe lines should be anchored often so that they will not sway in the\nwind, and unsupported runs should not be over a foot in length. A\ngreat variety of fasteners for both masonry and wood are available,\nand can be adapted to any situation.\nThe matching pads mentioned vary in design and quality and may be\nobtained in commercially built versions or may be built by the school\nitself if proper care in obtaining accurate data and good materials is\nused. With the development of the solderless connectors for coaxial\ncable, junctions, splices, and other transmission arrangements are\nsimply accomplished.\nIf your school has but a single receiver, it is still an excellent idea\nto consider a master antenna installation. With this approach, the\nantenna and lead-in distribution system is installed in as many rooms\nas are planned for TV viewing. When later on additional receivers\nare obtained, the correct matching pads can be constructed and in¬\nstalled, as the rooms are put into service. Another approach is to\nmount a single receiver on a mobile stand (see EducaTiVe News¬\nletters numbers 44 and 45). The set can be rolled from room to\nroom and plugged into the antenna outlets thus provided, assuming\nthat a temporary matching pad has been installed at the junction of\nthe antenna lead in and the branches.\nInstitutions planning to make the installations described should be\ncertain that they are close enough to the transmitting stations for\nadequate signal pickup.\nThe chief advantage of this system is lower cost but it should not be\nconsidered a substitute for the electronic type of distribution sys¬\ntem where cost is not a factor.\nPREPARED AS A PUBLIC SERVICE FEATURE BY MOTOROLA INC. EDUCATIONAL DEPT...\nFROM THE WORLD'S LARGEST EXCLUSIVE ELECTRONICS MANUFACTURER\nFORM NO. 7420-1\nPRINTED IN U. S. A."
}