{
  "id": "d1570-1",
  "text": "- 2 -\nCommittee Set Up to Administer the Grant\nAt its Colunbus meeting the NAEB Board of Directors accepted the grant and appointed\nthe following committee to work with the Executive Director in administering its\nJohn Dunn (Director WNAD, University of Oklahoma), chairman; Waldo Abbot (Director\nWUOM, University of Michigan); Edward Wegener (Production Director, WOI-TV, Iowa\nState College).\nThe Board instructed the committee to invite proposals from any and all interested\neducational institutions* It also said: \"Although a single institution might re¬\nceive two grants—one- for radio and one for television production—if there were\nenough promising applicants the committee should make only one grant to an insti¬\ntution.\n- NAEB ADULT EDUCATION PROJECT REPORT\nThe following programzeport is made by William Harley, Coordinator, Adult Education\nProject*\nJefferson Series: Scripts five, six, and seven (\"The Democrat aid the Communist,\"\n\"Light aid Liberty\" and \"Jefferson and Respbnsibility of Public Office\") have been\ncompleted by Writer Milton Geiger* He is now working to couple te two more by the\ntime Claude Rains returns from London at the end of the month when it is hoped four\nprograms can be taped imr®diately*\nUSSR Series; \"The Music and the Dream” (Communism^ pitch to' the Asians) and \"Terror\nAs a System of Power\" (the police state) have been produced* Scripts for the other\nthree full hour documentary dramas have received final approval and are to be pro¬\nduced as quicklyas possible.\nAll consultants have pronounced themselves well pleased with the scripts of their\nprograms* C. Dale Fuller, project director, couple ted his services on May 15, taking\na position with Radio Free Europe* *\nWays of Mankind; The first three programs were produced in the studios of the CBC\nm Toronto May 7-9; scripts fey Lister Sinclair, production by Andrew Allan, com¬\nmentary by Goldschmidt* Some who have read the Language script feel it is one of\nthe best educational radio scripts they've ever seen: the production in no way lets\nit down. The next production session was scheduled for the middle of June.\nDiscussion Shows\njfo'ferna'fcional Series; A meeting was held in New York recently with representatives\nof the CBC and BBC regarding international broadcast cooperation* Outcome; agree¬\nment to do a series of three ^-minute discussions on foreign policy with each\ncountry responsible for one program.\nFeed Back Project; Ralph Tangney of the Lowell Shop has been hired to direct this\nexperiment* He is now preparing a prospectus to submit to Prof. Robert Merton\n(Columbia), our consultant.\nCommunications Series; Mrs. Waiter Johnson of the Chicago Round Table has been\nengaged part time to supervise this project, which will attempt to produce 1*0 - 50\nquarter-hour talks by the best people in industry and education on \"Television and\nRadio for a Free Society*\" Harold Lasswell (Yale) has agreed to serve as consultant* — „\nZoj£es. from.Europe; Milton Mayer, director, is already hard at work lining up inter¬\nviewees and making contacts* UNESCO is giving him all possible assistance and, in¬\ndeed, has even loaned him an excellent portable recording machine*"
}