{
  "id": "d1570-13",
  "text": "' - 1U* -\nSAN DIEGO TEACHERS WRK ON 'UNIVERSITY' PROGRAM\nSan Diego's only television station, KFMBrTV, is televising a new daily half-hour edu.\ncational series titled \"Channel 8 University.\" The program presents popularised\npresentations of such topics as local history, music, old age, child guidance and\nvisual arts.\nTeachers from San Diego*s schools and colleges appear each afternoon, with Jack\nBriggs of the station stuff. acting as emcee for the programs* Humor and informality\nare injected into the programs to aid in maintaining entertainment as well as educa¬\ntional values.\nA typical week's schedule featured Ben Dixon, curator of the Junipero Serra Museum\n(stories of early California history)j Alexander Zimmerman (discussion of musical\ninstruments and compositions); Oscar Kaplan (discussion of ways to help people live\nlonger)5 Richmond Barbour, syndicated child guidance columnist (answers to questions\non child problems); and Everett Jackson, head of the art department at San Diego\nState College (illustrated discussion of modern art)*\nHoward L. Chemoff, general manager of KFMB-TV, cancelled five commercial half-hours\nto schedule \"Channel 8 University*\" He said that audience response has \"certainly\nmade this move worth while*”\nUNESCO COMMITTEE PROPOSES TV STUDY BY UN\nUnder the chairmanship of Robert Hudson, Director of Radio and Television, University\nof Illinois, a 6 day meeting of international television experts, called by UNESCO's\nExecutive Board, was held in Paris in April*\nAs a result of the meeting the committee proposed that \"UNESCO should undertake, a\nstudy, based on reports from individual countries, of the present structure and< fa¬\ncilities of television and of its social impact.\" Among the other recommendations\nmade were the following:\nUNESCO should make recommendations to Member States, urging that adequate attention\nbe paid to the interests of education, science and culture in all television program¬\nming* UNESCO should undertake the following specific activities in the field of\nformal and informal education fcy televisions (1), serve as a clearing house on educa¬\ntional activities and transmit information to Member States; (2) experiment in funda¬\nmental education; (3) conduct pilot projects on school television in collaboration\nwith Member States; (it) advise on the setting up of television services in countries\nwhere they might be useful, for education, and on the relation of television to other\nmeans of audio-visual education; (5>) encourage co-operation between television and\neducational film producers; and (6) encourage the cataloging of visual naterials use¬\nful in programming*\nCommittee Members\nAmerican members of the international committee of television experts werej Robert\nHudson, Director of Radio and Television, University of Illinois, Urbana; J. Davidson\nTaylor, NBC, New York; and Richard B. Hull, Director of Station WOI-TV, Iowa State\nCollege, Ames.\nTHE 195>2 CONVENTION WILL BE HELD IN MINNEAPOLIS—NOVEMBER 6-7-8\nIT TAKES ONLY ABOUT SIX HOURS TO REACH MINNEAPOLIS FROM HOUSTON"
}