{
  "id": "d1570-19",
  "text": "- 20 -\nLIVE SHOW TV PERSONNEL REQUIREMENTS\nA Report Prepared by\nEdward Wegener\nWOI-TV, Ames, Iowa\nEditor Paulu never us.es a whip, but he is a mighty persistent fellow. In the next\nfew paragraphs I am going to try to fulfill an assignment he gave me many months ago.\nGave to me - - and kept on remenbering when it wasn't forthcoming.\nJust how many cooks does it take to make a stew? That was the burden of his request.\nThe Stew in question is a WO I-TV studio show. Any* show. Let's generalize a little\nbit.\nFirst, we have found out that the minimum number of people that a show requires can¬\nnot go below l£. Let's take as an example a three-a-week children's program called\nThe Magic Window, which WOI-TV presents at four o'clock MWF. Each time this show\ngoes on the following people are involved.\nTwo\nOne\nOne\nOne\nOne\nOne\nOne\nperformers\ndirector\nassistant director\nfloor director\nproduction assistant\ntransmitter engineer\nmike boom operator\nTwo cameramen\nOne audio engineer\nOne technical dire.ctor\nOne film projectionist\nOne shader\nOne man to put up the set\nOne man to light the set\nOne man to push the camera boom\nNow that you have added them and find 17 rather than the 15> I mentioned above, don't\nworry about the inconsistency. Fifteen is the minimum staff for a show here. The\nMagic Window has an extra performer above the bare necessity for a show, and the\ndirector uses one extra assistant.\nAdditional Personnel\nBut while we are still concerned with numbers, let me mention a few that didn't\nfigure in the list above, but who are most certainly involved in all local shows;\nThe man who designed the set.-\nThe man who built it. .\nThe man who -ko-cps it equipped with props. .\nThe man who does art work for the show.\nSo you see, the usual 4staffing that is given to a college station production of a\nradio program doesn't go far in changing it from sound to pictures.\nNow, to anticipate a natural question or three - how many of these people are pro¬\nfessionally trained? How many are students? Who are they and where did they come\nfrom?\n, • •\nThe only college s tudents involved are these; Floor director. Camera boom man. Pro¬\nduction assistant. Lighting director. Assistant director.\nProfessionally trained but not college graduates are these; Cameraman, Mike man. Audio\nengineer. Shader, Stage manager. Film projectionist."
}