{
  "id": "d1570-3",
  "text": "- u -\nJCET ANNOUNCES $11+5,000 GRANT FOR EDUCATIONAL TELEVISION\nThe Fund for Adult Education, established by the Ford Foundation. has granted SlW^cra\nto the Joint Committee on Educational Television, now in its second year fp_\nThe announcement was made by Arthur S. Adams, President of the A* t trustee —'\nEducation, one of the seven constituent organizations of the Committee, and tr\nof its funds#\n11 The amount of the grant is somewhat larger than that of last year S ke6P~\ning with the expanded program planned by the JCET for 193>2-£3* Ad xp\nThe Chairman of the Joint Committee on Educational Television, Edg^F^r^elcomed\nthe new grant as an expression of confidence in the work of the Committee. ™ M\nemphasis^of the JCET Sring the past year has been to finalize the rcserved televi-\nsion channels for educational use, according to Fuller, who went on to say.\n-On April 11*, 1952, the Committee publicly hailed the new television plan of the FCC,\nwith 21*2 of the 2053 channel assignments reserved for education, as a\nvictory fbr education. Much of the credit for that victory goes to ^ 888 g ’\nuniversities, public school systems, state departments of education, ^ Public\nservice agencies, which, with the assistance of the JCET, Pres®^*da^^r®^s\nsupporting the reservation principle. These university and schocladministrators\nmust now make specific plans to use their reserved channels, and they look to the\nJCET to provide them with information and assistance#”\nField Consultation Service Planned\nTo meet this urgent need for help, the Joint Committee onEducationalTelevision has\ncompleted plans for a field consultation service to educators. Consultants with ex\nperience and know-how in the legal, engineering and programing areas of broadcast\ning will be available to advise educators at local and regional meetings#\nFuller cited four points of enphasis in the new program:\n1. Establishment of organizational patterns appropriate for varied educational\ninterests planning to participate in the use of a television channel.\n2. Explanation of legal procedures required by the FCC for the application\nof a construction permit#\n3* Discussion of technical facilities needed#\nLu Encouragement of program exchange on a regional and national basis.\nThe Committee expects to continue its legal activities in Washington, acting as\nliaison between various educational institutions and the Federal Communications\nCommission#\nRalph Steetle, Executive Director, summarized the over-all objectives of the Commit\ntee*s program:\n”The Joint Committee on Educational Television seeks to represent the\nof education in the newest and most powerful of the mass media. It will pro d\nthe necessary information to university aid school administrators to help them\nmake informed decisions in regard to television# It will levisioiTtta'ough ~\nthe expression of public and educational support for educational television through\nall possible channels#”\nMINNEAPOLIS IS THE PLACE FOR THE NAEB CONVENTION THIS YEAR"
}