{
  "id": "d1570-4",
  "text": "-5\nO\nr^\nn\nNAEB RADIO DEVELOPMENTS\nUAW-CIO GIVES FM RADIO STATION TO WAYNE UNIVERSITY\nAn FM Radio Station (VJDET) has been given to Wayne University by the UAW-CIO. An ap¬\nplication for transfer of license is now before the Federal Communications Commission\nThe gift, valued in excess of $12^,000, includes land, radio tower, transmitter, stu¬\ndio building, and studio equipment* In making the offer to the University, Walter P.\nReuther, President of the International Union, UAW-CIO, stated:\nttThe UAW-CIO is proud and pleased to be able to make this contribution to Wayne Uni¬\nversity* ♦•After carefully reviewing WDET's operation it is the sincere belief of the\nUAW-CIO that the purposes for which we sought the FM franchise can be more effective¬\nly carried out by an institution of higher education* The UAW-CIO makes this gift as\na contribution toward advancing the broad objectives for which Wayne University was\nestablished in our community.”\nDavid D. Henry, President of the tkiiversity, listed four important results the tfrii-\nversity*s operation of the station will have for the University aid for the commun¬\nity. First, it will increase the training opportunities of students in radio educa¬\ntion 5: second, it will make possible the presentation of many educational and cultural\nprograms to the community; third, it will enhance the public interpretation of the\nUniversity1 s w^rk; and finally, it will be an important asset in developing plans\nfor educational television for the Detroit area.\nWISCONSIN STATE RADIO COUNCIL MAKES FM SURVEY\nForty-two percent of the homes in the Madison metropolitan area are now equipped with\nFM receivers, according to a report on a recent study made by the Wisconsin State\nRadio Council. The findings are based on a telephone survey in which £00 Madison-\narea families were interviewed.\nThe survey shows a substantial increase in the number of FM homes over the 3&% found\nin a similar survey one year ago. In 1950 the figure was 2L.8$ and the year before\nthat it stood at 18.1$. Early in 19L6, after FM was assigned to its present place\nin the spectrum, there were virtually no receivers for that band in the Madison area.\nOn the basis of census figures on the total numberof living units, it is estimated\nthat there are now approximately 11,000 FM-equipped hones in greater-Madison.\nA sidelight of the survey revealed a wide interest in FM reception and. service among\nthose who do not now have such receivers. Approximately four out of five said that\nwhen they bought new receivers, they would insist on having FM.\nWASHINGTON STATE M KES STUDY OF CARRIER CURRENT PROGRAM PLANNING\nUnder the direction of Donald G. Hileman, assistant professor of Business Admini¬\nstration, a research study has recently been completed on the listening habits of\nthe students of the State College of Washington. The study was made to determine\nthe programming of a new carrier current, student operated and programmed radio\nstation, KMPS. Copies of the survey are available to interested parties by writing\nto Professor Hileman at Washington State.\nCAN EDUCATIONAL RADIO SURVIVE IN A TELEVISION-DOMINATED WORLD?\nTHAT’S ONE OF THE TOPICS FOR THIS YEAR’S NAEB CONVENTION"
}