{
  "id": "d1570-4",
  "text": "NAEB NEWS LETTER,\nMarch 1, 1943\nPage 5\nOther new radio series to be broadcast by the Radio Council inolude\n\"Numbers at Work,\" to be broadcast Mondays, station. WIND, Is30-1:45 p.m.,\na series designed to motivate students to study Mathematics courses now\nand elect them in high eohools and \"Languages in Action,\" heard Tuesdays,\n1:30-1:45 p.ra., also a motivation series toward understanding of languages\nand their study.\nFor kindergarten and primary listeners \"W© Visit Story-Land,\" will be\nbroadcast eaoh Monday, station WJJD, 3:14-2:30 p.m«, On Tuesdays, same\ntime and station, LeVs Tell a Story, a series of dramatizations from\nbooks for students in the upper elementary grades, will be broadcast.\nThe Thousand Million, geographical and social science background on the\nUnited Nations, will be broadcast on Wednesdays, station WJJD, 3:15-2:30\np.nu, for the upper elementary and high school students. That1 s News to Me,\na student news commentary, will be broadcast on Thursdays, same time and\nstation.\nBattle of Books, quiz urogram for upper elementary students, to be heard\neach Friday, station WJJD, 2:15-2:30 p.nu, presents teams from two schools\neaoh week in a oontest of questions on children* s books. This program is\nproduoed in cooperation with the Board of Education Library.\nFour Radio Oounoil programs for high school students will continue during\nthe second semester'. They are:\nYOUNG AMERICA ANSWERS, high school current events quiz, heard on Saturdays,\nWBBM, 12:30-1:00 p.nu*\nHIGH SCHOOL STUDIO PARY, variety show of student talent, also broadcast\neaoh Staurday, station WI1AQ, 11:30-13:00 p.nu*\nYOUR JOB IN REVIEW, interviews with executives of various trades, professions\nand U. 3. armed service branches, will be broadcast or Thursdays, station\nWJWG, 4:45-5:00 turn. Students of careers classes of Chicago Public High\nSchools submit questions to the Council to guide the speakers on this pro¬\ngram.\nPREP SPORTS, student news commentary, is broadcast each Thursday, station\nWAAF, 1:15-1:30 p.m.\nU„ Ko SERIES PLANS FOR KENTUCKY POST-WAR DEVELOPMENT\nPlans for a comprehensive economic development to take place in Kentucky\nafter the war, are contained in a series of 32 weekly radio broadcasts\nover station WHAS, Louisville, which started Sunday, February 14. The\nprograms, arranged by the University of Kentuoky, &nd broadcast from its\nstudios in Lexington, feature talks by University and other experts on\nspecialized subjects germane to Kentucky3 s future industrial development,\nincluding manpower, mineral wealth, transportation facilities, taxes,\nschools, forests, tourist possibilities, agriculture, and technology.\nDr. H. Lo Donovan, president of the University, opened the series, and Dr."
}