{
  "id": "d1907-0",
  "text": "Office, of Executive Secretary\nUrbana, Illinois\nGotober 15, 1940\nSCHOOL BROADCAST CONFERENCE PLANS ANNOUNCED\nThe fourth annual meeting of the School Broadcast Conference, a\npermanent national meeting devoted, to the utilisation of radio in\nthe classroom, will open at the Congress Hotel in Chicago, December\n4th and continue through December 6th0\nHarold W. Kent, director of the Radio Council of the Chicago Public\nSchools and chairman of the Conference Executive Committee, in\nannouncing the program for the meeting said, ”The School Broadcast\nConference, held each December in Chicago, is unique among Conferences,,\nIt has but one purpose0 That purpose is to present to radio men.\neducators, teachers and administrators, utilization procedures which\nhave been successfully used in the classroom. Radio itself can do only\npart of the teaching job. The in-service teacher, principal, or admin¬\nistrator must learn to use this exceedingly effective modern teaching\ntechnique. To that end, every session of the School Broadcast Confer¬\nence is given over to demonstrations of classroom use of radio, as\nnearly as possible under conditions which approach the classroom\natmosphere,\nIncluded among those national figures in radio and edtication who will\nattend the three day sessions ares George Denny of NBC* s 15Americans\nTown Meeting1*; Lyman Bryson of 053*8 Board of Adult Education; and\nRaymond Gram Swing, news commentator for the Mutual network. Both\nNBC And CBS will originate national broadcasts from the Conference\nmeeting hall.\nThe National Association of Broadcasters, the National Association of\nEducational Broadcasters, the Adult Educa/fcion Council, as well as\nall local Chicago stations are cooperating in tha three day session*\nFM SPEEDS USE OF RADIO IN ADULT EDUCATION\nCleveland* s pioneer high-freqtumoy educational radio broadcast station,\nT730E, operated by the Cleveland Board of Education, has been authorized\nby the Federsil Communications Commission to change Its type of trans¬\nmission from amplitude to frequency modulation.\nFirst station to operate in the ultra-short wave band set aside for\neducational stations by the FCC in 1938, ’7B0E has been breadcasting\nfrom it3 own studios to receivers in each of Cleveland*s 151 schools\nsince November 1938*"
}