{
  "id": "d1907-1",
  "text": "NAEB NEWS LETTER.,,.OCT. 15, 1940.,.Page 2\nNot?, as commercial T:K broadcasting gets under way and high-frequency\nFI1! sets become available to the public, WBOE* s programs may find\nlisteners in homes as well as in classrooms.\nWhen the Federal Communications Commission approved FM in May, 1940,\nand recommended it for all ultra-short mve broadcasting, because of\nits qualities of more faithful sound reproduction and absence of static\nand interference from other stations, it cleared a range in the high\nfrequencies from 43 to 50 megacycles for commercial broadcasting.\nAt the suggestion of U. S. Commissioner of Education John U. Studebaker,\nrepresenting more than 300 universities and colleges and hundreds of\nschool systems and other educational organizations, the FCC moved the\neducational bend to an adjoining position at 42-43 megacycles.\nIn explaining educational radio*s request for a position tangent to\nthe commercial band, Commissioner Studebaker pointed out that FM\ncommercial broadcasting mould lead to large scale retail distribution\nof FI! receivers capable of tuning in programs from educational studios*\n\"Broadcasts from schools to homes greatly enhance facilities for\nadult education,\" Commissioner Studebaker says. \"Persons over school\nage and shut-ins have at their radio dial an opportunity to study in\ncommon with pupils in classrooms. In times of extremely bad weather,\nepidemics or other such emergencies which might temporarily close\nschools, classes may be carried on by radio without interruption.\n\"Still another advantage, especially important today, lies in helping\nto establish a closer bond of understanding; bet\\?een schools and the\npublic. The American people have a right to know what subjects schools\nare teaching today and how they are taught* Schools can report on\neducation* s part in the national defense program and can show how\nschools are promoting the ideals of democracy and contributing to the\npreservation of the American way of life.\"\nCleveland* s school board is one of several preparing to enter this\nnew phase of education by radio. San Francisco* s Board of Education\nhas received a construction permit for its proposed Fli station, KALW.\nSan Mateo (Calif.) Junior College and school systems of Chicago and\nNew York have indicated they will file applications soon. New York*s\nschool system, like Cleveland, has been operating a high-frequency\nAM station, WNYO, which it expects to change to FK.\nAnother New York educational institution, the College of the City of\nNew York, has expressed an interest in an educational station. The\nUniversity of Kentucky operates ’7BICY, an AM high-frequency station\nwhich broadcasts educational programs to schools and community listening\ncenters in rural Kentucky areas. Oklahoma A. and Li. is considering\nestablishing a similar service.\nRensselaer Polytechnic Institute is reported to be building an FM\nstation, the Universities of Illinois and Wyoming, and New River\nState College, Montgomery, W. Va., are collecting equipment, and an\nalumnus has offered the University of Michigan equipment for an Ftl\nstation. Nearly a score more educational institutions and school\nsystems are developing plans for stations in the educational band."
}