{
  "id": "d1907-3",
  "text": "JffjfEB HETCS LETTER.,.. OCT. 15, 1940..., Page 4\n”TLese programs are worked out and spo nsored by a Radio Committee\nappointed by President 7eir C. Ketter. Prof. Ray A. Walters is the\nchairman of this committee,\n\"The programs are presented mainly by the Faculty and Student members\nof the college, in which the students have a very large pert, and,\nalso in the announcing, and technical operation of the station,\n\"There is an active and enthusiastic Radio Club in the college?\nU.K’s MET7 EDUCATIONAL RU)I0 ST ATI OK\nAlmost a score of important personages in the fields of education,\nradio, and government, have been invited to participate in the\ndedication of one of the most unique radio stations in the United States\nThe station is W3KY, Beattyville, established by the University of\nKentucky, and to be operated in cooperation with the Lee county Board\nof Education, The 100-watt station, to broadcast in the educational\nband on a freauency of 42,900 kilocycles, will feature programs of\nadult and school-child interest with a distinct local angle, and. will\ntest experimentally the feasibility of supplementing the University* s\nmore generalized broadcasts from Lexington, with more specific\nprograms adapted to a particular community.\nThe dedication set for Thursday night, October 17, at 7s5C p.m, from\nthe auditorium of the Beattyville grade school, and to constitute the\nfirst broadcast from the new station, will include on the program all.\nof the notables that have been invited to attend, among them, Dr.\nJ„ Studebaker, United States Commissioner of Education; James Fly,\nchairman of the Federal Comiminications Commission; John 7, Brooker*\nstate superintendent of public instruction; Hon.. Keen Johnson, governor\nof Kentucky; Barry Bingham, publisher of the Courier Journal; Robert\nK, Salyers, director of the National Youth Administration for Kentucky;\nPartin Schmidt, Louisville; Dr. Thomas D. Cooper, acting president\nof the University of Kentucky; Dr, '7. S. Taylor, dean of the University’s\nCollege of Education; and David !£. Young, U.K. assistant professor\nof Geology,\nIN CHARGE AT TREY\nA Louisville girl, Ruth Foxx, 1036 Everett Avenue, has been appointed\nprogram supervisor of 7nKY, the University of Kentucky’s new educational\nstation at Beattyville, and will assume her duties at once, Hiss Foxx,\na graduate of the University of Louisville was director of that\ninstitution’s broadcasts for one year and later was state NYa radio\ndirector. Besides her work at the Louisville institution, Hiss Foxx\nhas attended two summer sessions of the New York University radio\nwork shop.\nAt Beattyville, Piss Foxy., besides exercising general supervision over\nall programs coming from the station, rill write or edit all continuities,\ntrain announcers, rehearse and produce presentations, and prepare\nteachers’ aids to be used by the county school teachers in adapting\ntheir work to the TOKY classroom programs, l&iss Foxx will be jointly\nresponsible to T. L. Arterberry, principal of the Lee county high\nschool and executive officer ol the station, and E. u. ouiaer, nirector\nof radio activities at the University of Kentucky,"
}